{"doi":"10.1016\/j.taap.2008.10.019","coreId":"113835","oai":"oai:epubs.surrey.ac.uk:2866","identifiers":["oai:epubs.surrey.ac.uk:2866","10.1016\/j.taap.2008.10.019"],"title":"The neuroprotective action of the mood stabilizing drugs lithium chloride and sodium valproate is mediated through the up-regulation of the homeodomain protein Six1","authors":["Plant, KE","Anderson, E","Simecek, N","Brown, R","Forster, S","Spinks, J","Toms, N","Gibson, GG","Lyon, J","Plant, N"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-02-15","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"ACADEMIC PRESS INC ELSEVIER SCIENCE","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2866<\/identifier><datestamp>\n      2017-10-31T14:07:04Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:62696F736369656E6365735F6D65646963696E65:62696F5F6D6F6C6563<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2866\/<\/dc:relation><dc:title>\n        The neuroprotective action of the mood stabilizing drugs lithium chloride and sodium valproate is mediated through the up-regulation of the homeodomain protein Six1<\/dc:title><dc:creator>\n        Plant, KE<\/dc:creator><dc:creator>\n        Anderson, E<\/dc:creator><dc:creator>\n        Simecek, N<\/dc:creator><dc:creator>\n        Brown, R<\/dc:creator><dc:creator>\n        Forster, S<\/dc:creator><dc:creator>\n        Spinks, J<\/dc:creator><dc:creator>\n        Toms, N<\/dc:creator><dc:creator>\n        Gibson, GG<\/dc:creator><dc:creator>\n        Lyon, J<\/dc:creator><dc:creator>\n        Plant, N<\/dc:creator><dc:publisher>\n        ACADEMIC PRESS INC ELSEVIER SCIENCE<\/dc:publisher><dc:date>\n        2009-02-15<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        image<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        attached<\/dc:rights><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2866\/4\/Figure-1.tif<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2866\/8\/licence.txt<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2866\/9\/TAAP-D_08-00361R2-_Clean.pdf<\/dc:identifier><dc:identifier>\n          Plant, KE, Anderson, E, Simecek, N, Brown, R, Forster, S, Spinks, J, Toms, N, Gibson, GG, Lyon, J and Plant, N  (2009) The neuroprotective action of the mood stabilizing drugs lithium chloride and sodium valproate is mediated through the up-regulation of the homeodomain protein Six1   TOXICOLOGY AND APPLIED PHARMACOLOGY, 235 (1).  pp. 124-134.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.taap.2008.10.019<\/dc:relation><dc:relation>\n        10.1016\/j.taap.2008.10.019<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2866\/","http:\/\/dx.doi.org\/10.1016\/j.taap.2008.10.019","10.1016\/j.taap.2008.10.019"],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"The neuroprotective action of the mood stabilizing drugs lithium chloride and sodium\nvalproate is mediated through the up-regulation of the homeodomain protein Six1\nKathryn E. Plant1, Elizabeth Anderson1, Nicole Simecek2, Richard Brown1, Sam Forster1,\nJenny Spinks1, Nick Toms3, G. Gordon Gibson1, Jon Lyon2 and Nick Plant1*\n1Centre for Toxicology, Faculty of Health and Medical Sciences, University of Surrey, GU2 7XH,\nUK, 2Safety Assessment, GlaxoSmithKline, Welwyn, AL6 9AR, UK, and 3Peninsula Medical\nSchool, Exeter, EX1 2LU\n*To whom correspondence should be addressed: Centre for Toxicology, Faculty of Health and\nMedical Sciences, University of Surrey, GU2 7XH, UK. Tel: +44 (0)1483 686412; Fax: +44\n(0)1483 686401; Email: N.Plant@Surrey.ac.uk\nRunning Title: Six1 mediates LiCl\/VPA-induced neuroprotection\nAbstract words: 249 (250 allowed)\nNumber of Figures: 5\nNumber of Tables: 2\nNumber of Supplementary Information: 1\nAbbreviations: BD, Bipolar disorder; DAVID, database for annotation, visualization and\nintegrated discovery; HCaRG, hypertension related calcium regulated gene; LiCl, lithium\nchloride; SAM, statistical analysis of microarrays; Staurosporine, STS; VPA, sodium valproate\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nAbstract\nThe mood stabilizing agents lithium chloride (LiCl) and sodium valproate (VPA) have recently\ngained interest as potential neuroprotective therapeutics. However, exploitation of these\ntherapeutic applications is hindered by both a lack of molecular understanding of the mode of\naction, and a number of sub-optimal properties, including a relatively small therapeutic window\nand variable patient response. Human neuroblastoma cells (SH-SY5Y) were exposed to 1 mM\nlithium chloride or 1 mM sodium valproate for 6 h or 72 h, and transcriptomes measured by\nAffymetrix U133A\/B microarray. Statistically significant gene expression changes were identified\nusing SAM software, with selected changes confirmed at transcript (TaqMan) and protein\n(Western blotting) levels. Finally, anti-apoptotic action was measured by an in vitro fluorescent\nassay. Exposure of SH-SY5Y cells to therapeutically relevant concentrations of either lithium\nchloride or sodium valproate elicited 936 statistically significant changes in gene expression.\nAmongst these changes we observed a large (maximal 31.3-fold) increase in the expression of the\nhomeodomain protein Six1, and have characterized the time- and dose- dependent up-regulation\nof this gene in response to both drugs. In addition, we demonstrate that, like LiCl or VPA\ntreatment, Six1 over-expression protects SH-SY5Y cells from staurosporine-induced apoptosis via\nthe blockade of caspsase-3 activation, whereas removal of Six1 protein via siRNA antagonises the\nability of LiCl and VPA to protect SH-SY5Y cells from STS-induced apoptosis. These results\nprovide a novel mechanistic rationale underlying the neuroprotective mechanism of LiCl and\nVPA, suggesting exciting possibilities for the development of novel therapeutic agents against\nneurodegenerative diseases such as  Alzheimer’s or Parkinsonism.\nKeywords: Bipolar Disorder; Neuroprotection; Lithium chloride; Sodium valproate; Microarray;\nApoptosis\nIntroduction\nLithium chloride (LiCl) and the anticonvulsant valproate (VPA) are frontline treatments for\nthe manic phase of bipolar disorder (BD), acting as mood stabilizers (McElroy et al., 1992). The\nquoted prevalence for BD is approximately one percent of the population (Spearing, 2001),\nalthough several factors probably result in under- or misdiagnosis. First, there are many BD\nphenotypes, complicating diagnosis (Thomas, 2004; MacQueen et al., 2005). Second, from these\nmultiple phenotypes several variants exist in which one or other phase is extremely mild. Third,\nthe combination of the previous two factors result in frequent incorrect diagnosis of BD as\nunipolar disorder (Dunner, 1992; Spearing, 2001) meaning that the actual prevalence may be\nconsiderably higher. In addition to this  established therapeutic area, increasing support is being\ngiven towards the use of LiCl and VPA as general neuroprotective agents, with potential\ntreatments including disorders such as Alzheimer’s or Parkinsonism (Brunello, 2004; Aghdam\nand Barger, 2007), although the molecular rationale behind this has yet to be elucidated (Di\nDaniel et al., 2005). This combined therapeutic arena, encompassing both mood stabilization and\nneuroprotection means that the potential patient population who may be subject to chronic\ntreatment with these therapeutic agents is very large. Unfortunately, in addition to possessing\nunknown molecular mode of action(s), both LiCl and VPA have several other sub-optimal\nparameters. First, for  treatment of bipolar disorder only around 50 % of patients respond to LiCl\ntherapy and a similar number (54 %) to VPA treatment (Mendlewicz et al., 1999). Second, both\nLiCl and sodium valproate have relatively small therapeutic indices (Strakowski et al., 2001).\nThird, both LiCl and VPA require high dosing levels (millimolar circulating concentrations) to\nachieve efficacy (Jann et al., 1982; Balfour and Bryson, 1994). It is thus clear that in order to\noptimize the use of these agents and\/or develop novel therapeutics it is necessary to fully\nunderstand their molecular actions.\nBoth LiCl and VPA, along with other mood stabilizing agents, elicit wide-ranging effects on\nneural cells, including a shared ability to protect against apoptotic insults (Chuang, 2004). Several\ninvestigations have suggested that inhibition of glycogen synthase kinase 3 beta (GSK3?) is a\ncentral component to both their mood stabilization and neuroprotective abilities (Bijur and Jope,\n2000; Li et al., 2002b). However, other studies have proposed mechanisms centred around p53\nmodulation (Lu et al., 1999), phosphatidyloinositol signalling (Ding and Greenberg, 2003),\nhistone deacetylase inhibition (Phiel et al., 2001) or endoplasmic reticulum dysfunction (Kim et\nal., 2005). There is thus a need for further studies to understand how these individual effects\ncombine to produce the known phenotypic effects of these agents.\nTo begin to understand the molecular mode of action of both LiCl and VPA in neural cells we\nhave used DNA microarray analysis to examine changes in the transcriptome of human SH-SY5Y\nneuroblastoma cells in response LiCl and VPA. Concentrations used were within the therapeutic\nrange, with patient serum levels range from 0.8-2 mmol\/L for LiCl (Sproule, 2002) and 0.3-0.8\nmmol\/L for VPA (Allen et al., 2006), with brain concentrations expected to be similar due to the\ngood ability of both compounds to cross the blood-brain barrier. Both agents elicit a marked rise\nin the expression of the cell differentiation factor Six1, and we demonstrate that this increase is\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\ncentral to the ability of both LiCl and VPA to exert their neuroprotective effect.\nMethods and Materials\nCell Culture\nSH-SY5Y cells (ECACC 94030304), a human neuroblastoma cell line, were obtained from\nECACC (Porton Down, Wilts, UK) and Bristol University.  Cells were routinely cultured in\nDMEM:F12 supplemented with 10% foetal calf serum, 50 U\/ml penicillin and 50 ?g\/ml\nstreptomycin. All cell culture consumables were purchased from Invitrogen (Paisley,UK).\nAs indicated, a Six1 expression plasmid, or control plasmid, was transfected into SH-SY5Y\ncells using FuGENE 6 (Roche Diagnostics, Lewes, UK), along with a GFP expression plasmid\n(BD Biosciences) to act as an internal control. Cells were then incubated for 48 hours before the\naddition of 1 ?M STS (STS) for 16 hours\nFor siRNA experiments pre-designed Six1 silencer siRNA (Ambion, Warrington, UK) was\ntransfected into cells using the Silencer siRNA transfection system (Ambion) as per\nmanufacturer’s recommendations, with two separate siRNAs against Six1 used to ensure\nspecificity of response. In addition, a pre-designed silence siRNA against HCaRG was used to\ncontrol for off-target effects.\nDNA Microarray and Analysis\nSH-SY5Y cells were seeded at 2.4 x 105 cells\/cm2 in 25 cm2 flasks and allowed to attach\novernight. Cells were dosed daily with 1 mM lithium chloride (Sigma Aldrich, Poole, UK), 1 mM\nsodium valproate (Sigma Aldrich) or medium control. Following 6 or 72 hours of exposure, total\nRNA was isolated from quadruplicate samples using the RNeasy Mini kit (Qiagen, Crawley, UK)\nand was quantified using a Nanodrop Agilent 2100 Bioanalyser. Medium was changed 6 hours\nprior to the 72 hour time point to control for gene expression elicited by medium shock. In\naddition, the quadruplicate biological samples were composed of two samples each from the\nECACC and Bristol-sourced SH-SY5Y cells; sourcing cells from two different sites controls for\nsite-specific phenotypic changes in cell lines that can potentially obscure the biologically relevant\nchanges.\nSamples were used to interrogate the Affymetrix U133A\/B GeneChip set, representing over\n47,000 transcripts including approximately 38,500 fully annotated probe sets.\nThe data generated from the microarray analysis was first normalised using the Affymetrix\nalgorithm that allows reliable comparison of multiple arrays, minimising differences of non-\nbiological origin. Next the SAM (Significance Analysis of Microarrays) package (http:\/\/www-\nstat.stanford.edu\/~tibs\/SAM\/) was used to identify significantly altered gene expressions, and\ngenerate false discovery rate (FDR) values for the analysis. The SAM package offers the\nadvantage over other microarray analysis tools in that it does not presume equal variance or\nindependence of genes (or both), scenarios that are often violated in biological systems (Tusher et\nal., 2001). SAM settings were for a two class unpaired analysis between, using one hundred\npermutations to calculate the differentially expressed gene list. No fold-change threshold was set,\nwith instead the delta function manually altered to provide a false discovery rate of approximately\n1 %. The exception to this is for 72 hours exposure to LiCl, where a false discovery rate of 20 %\nwas used due to the very low number of differentially expressed transcripts identified when lower\nFDRs were used. To examine the potential impact on biological pathways of the identified gene\nexpression changes the DAVID software suite (http:\/\/david.abcc.ncifcrf.gov\/home.jsp) was used\nto undertake functional annotation clustering, whereby GO identifiers that are statistically over-\nrepresented are clustered according to their biological functions (Dennis Jr et al., 2003).\nTranscript level measurement\nPrimers and TAMRA\/FAM dual labelled probe specific for Six1, Bcl2, Bcl2L1 and 18S were\ndesigned using the Primer Express software (Applied Biosystems, Warrington, UK) and were\npurchased from MWG (Milton Keynes, UK).\nSH-SY5Y cells were seeded at 2.4 x 105 cells\/cm2 in 25 cm2 flasks and allowed to attach\novernight. Cells were dosed daily with either varying concentrations of lithium chloride, sodium\nvalproate or medium control. At specified time points, total RNA was isolated from quadruplicate\nsamples using the RNeasy Mini kit (Qiagen) and was quantified using a Nanodrop Agilent 2100\nBioanalyser.\nTotal RNA was treated with RNase-free DNase (Promega, Southampton, UK) to remove\ngenomic contamination. Reverse transcription was primed with random hexamers and carried out\nby Superscript II (Invitrogen) as per the manufacturer’s instructions. To ensure that DNase treated\nsamples were free from genomic contamination an RT- control (lacking enzyme) was carried out\nfor every RNA sample. cDNA generated from 50 ng (Six 1) or 50 pg (18S rRNA) of total RNA\nwas amplified using TaqMan Universal PCR Master Mix with 400 nM primers and 200 nM\nfluorogenic probe in a total reaction volume of 25 µl. Quantitative polymerase chain reaction (Q-\nPCR) reactions were run on the ABI7000 SDS instrument and quantitation was carried out using\nthe ABI proprietary software against a standard curve generated from human genomic DNA\n(Promega).\nProtein level measurement\nSH-SY5Y cells were seeded at 2.4 x 105 cells\/cm2 in 25 cm2 flasks and allowed to attach\novernight. Cells were dosed daily with either varying concentrations of lithium chloride, sodium\nvalproate or medium control. Following 72 hours of exposure total protein was extracted in RIPA\nbuffer (1xPBS pH 7.3, 1% Nonidet P40, 0.5 % sodium deoxycholate, 0.1 % SDS), with 1x\nprotease inhibitor cocktail solution (Roche, Lewes, Sussex, UK) added just prior to use.\nTotal SH-SY5Y protein extracts (5 (g per lane) were resolved on 12 % SDS-polyacrylamide\ngels and then transferred electrophoretically to Hybond ECL nitrocellulose membranes\n(Amersham Biosciences, Little Chalfont, Bucks, UK).  Membranes were blocked (1 hour) in 5 %\nfat free dried milk and then probed with primary antibodies against Six1 (sc-9127; 1:400),\ncylcinA1 (sc-15383; 1:300) or pax3\/7 (sc-7748; 1:300) for one hour (Autogen Bioclear, Calne,\nWilts, UK), followed by anti-rabbit (Six1\/CyclinA1; sc-2007; 1:5000) or anti-goat (Pax3\/7; sc-\n2022; 1:5000) IgG  for one hour (Autogen Bioclear).  Bound antibodies were visualised using\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nenhanced chemiluminescence reagents according to the manufactures instructions (Amersham\nBiosciences), and opposed to Fuji Super RX film (Fisher Scientific). Computer based\ndensitometry of gels was undertaken using a GeneGenius Bioimaging System (Syngene,\nFrederick, MD).  Immunoblots were also probed with an antibody against ?-actin (ab-8226;\n1:1000) for one hour (AbCam, Cambridge, UK), followed by anti-mouse IgG (ab-6728; 1:2000)\nfor one hour (AbCam)  to ensure even loading per lane.\nThe phosphorylation status of GSK3? within cells was determined using the  phosphoELISA\nassay (Invitrogen) according to the manufacturer’s instructions. Briefly, cells were grown as\ndescribed above and extracted into RIPA buffer. pTyr216GSK3? was measured as a marker of the\nactive enzyme, while pSer9GSK? was measured as a marker of inactive protein.\nCell Death Measurement\nSH-SY5Y cells were seeded at 2.4 x 105 cells\/cm2 in 25 cm2 flasks and allowed to attach\novernight. For the last 16 hours of cell treatment, cells were exposed to 1 µM staurosporine (STS),\nas indicated, to induce apoptosis. Cell Death was measured by LDH-leakage using the\ncytotoxicity detection kit (Roche), as per the manufacturer’s instructions. LDH measurements\nwere normalised to medium-only (0 % cell death) and 0.1 % (v\/v) Triton X100-lysed cells (100 %\ncell death). Caspase-1 and Caspase-3 activity was measured using the CaspACE assay system\n(Promega), according to the manufacturer’s instructions. Briefly, following exposure to STS, cells\nwere washed in PBS, resuspended in hypotonic lysis buffer (25 mM HEPES, pH 7.5, 5 mM\nMgCl2, 5 mM EDTA, 5 mM DTT, 1x protease inhibitor cocktail (Roche)) and lysed by four\ncycles of freeze-thaw, followed by centrifugation at 16,000 g for 20 minutes at 4 (C. Supernatants\nwere mixed with specific fluorogenic substrates (Ac-DEVD-AMC or Ac-YVAD-AMD for\ncaspase-3 and -1 respectively), incubated for 1 hour at 30 (C, and then substrate turnover\nmeasured using a Molecular Dynamics  SpectraMax Gemini XS with excitation and emission\nwavelengths of 360 nm and 460 nm respectively.\nResults\nMicroarray analysis of SH-SY5Y transcriptome following exposure to LiCl or VPA\nExposure of SH-SY5Y cells to mood stabilizing agents for 6 hours provides information on genes\nwhose expression are likely to be affected directly by the action of LiCl and VPA (i.e. primary\ntargets). In comparison, exposure to LiCl and VPA for 72 hours provides a measure of\ntranscriptome changes caused by both direct and indirect effects of these chemicals on the SY-\nSY5Y transcriptome. SH-SY5Y cells from two different sources were used in the microarray\nexperiment to control for potential source-specific phenotypes that could act as confounders to\ninterpretation of the data. Correlation analysis between the transcriptome of the ECACC- and\nBristol-sourced SH-SY5Y control cultures showed no significant variance at either the 6 or 72\nhours time points (Figure 1A). Following exposure of cells to either LiCl or VPA the\ntranscriptomes were still highly correlated (r2>0.98 in all cases), and hence results from ECACC-\nand Bristol-sourced SH-SY5Y cells were pooled for microarray analysis, increasing the power of\nthe experiment. Figure 1B-E shows the Significance Analysis of Microarrays (SAM) output plot\nfor each of the test conditions, with the correlation analysis between the two cell sources included\nas an inset. Each SAM plot details the number of altered genes identified for the specified False\nDiscovery Rate (FDR), with more detailed information on the number and direction of these\nchanges is provided in table 1. It can be seen that at a therapeutically relevant, equimolar,\nconcentration (1 mM) VPA has a much larger impact on the SH-SY5Y transcriptome compared to\nLiCl, with VPA elicited 922 changes compared to only 14 changes elicited by LiCl. The full list\nof altered genes is presented as supplementary information. As no significant difference in\ntranscriptome response was observed between ECACC- and Bristol-sourced cells in response to\neither LiCl of VPA exposure the ECACC-sourced cell line was chosen for all subsequent\nexperiments due to its increased general availability.\nA further refinement of transcriptome analysis was undertaken using the DAVID\nbioinformatic suite to interrogate Gene Ontology (GO) identifiers of transcripts altered by\nchemical treatment. As GO identifiers refer to biological processes rather than individual reactions\nany over-representation in a dataset is often indicative of a significant impact on the pathway(s)\nassociated with the GO identifiers. Table 2 shows the main GO identifiers shown to be over-\nrepresented in the microarray data, with the number of genes associated with each treatment\/GO\nidentifier indicated. SH-SY5Y exposure to VPA elicited the largest number of significantly over-\nrepresented GO identifiers, consistent with the larger number of genes altered by this drug in\ncomparison to LiCl. In general, GO identifiers over-represented after 6 hours were also seen at 72\nhours, but with more altered genes associated with them, a logical consequence of a more\ndeveloped biological response to chemical exposure. The exception to this are the GO identifiers\ngrouped under ‘cell communication’, which generally decline in number between the early and\nlate time points of the microarray analysis. This is perhaps not unsurprising given that\ntransmission of cellular signals should logically occur early in a response, with endpoint changes\nsuch as metabolic capacity occurring later, possibly as a result of these signalling pathways.\nLiCl and VPA alter Six1 expression in SH-SY5Y cells\nAmongst those genes whose expression was altered by VPA exposure, the homeobox gene sine\noculis 1 (Six1) showed one of the largest changes, being up-regulated by 31.3 fold following 72\nhours of exposure. Examination of the microarray dataset revealed that LiCl also caused a\nstatistically significant increase in Six1 gene expression although to a smaller magnitude, being\n1.7 fold by 72 hours. Due to this small fold-change, Six1 does not appear in the list of LiCl-\naltered genes presented as supplementary material, being one of those within the false negative\ngroup. To correctly identify Six1 as being significantly increased within this group would require\nan FDR of 83.5 %, resulting in an unacceptably high number of false positives. Gene expression\nof Six1 is not significantly altered by 6 hours treatment with either LiCl or VPA, suggesting that\nthe affect is due to an indirect action of these agents on Six1 expression\nTo confirm and further characterize this change, we next examined the time and dose response\nof compound-mediated increases in Six1 transcript levels by TaqMan Q-PCR. Both VPA and\nLiCl elicited a dose-dependent increase in Six1 transcript level (Figure 2a), and as observed with\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nthe microarrays, VPA elicited the larger fold-increase in transcript level (6.8 fold) compared to\nLiCl (3.7 fold). Figure 2b demonstrates that the observed increase in transcript levels was\nmirrored at the protein level, with 48 hours exposure resulting in significant increases in Six1\nprotein levels. Specific identification of the Six 1 immunoreactive band was confirmed through\ncomparison to recombinant Six1. The Six1 antibody used, targeted against amino acids 1-444 of\nthe protein, detects several other immunoreactive bands and it is possible that these correspond to\ndifferent phosphorylation states of Six1, or to other members of the Six family. As the\nimmunoreactive bands are of sizes comparable to other members of the Six family this would\nsupport the latter scenario, and interestingly several of these also alter following compound\ntreatment. The induction of Six1 transcript levels in SH-SY5Y cells occurs more rapidly\nfollowing exposure to VPA, reaching significance within 18 hours, whereas LiCl exposure\nrequired 48 hours exposure to elicit a statistically significant increase (Figure 2c). A larger fold\nincrease in Six1 expression is observed following 48 hours treatment with 3mM VPA,\napproximately 32-fold, compared to that seen in figure 2a, which is approximately 7-fold.\nHowever this difference is due to a difference in the basal expression of Six1, with the induced\nlevel being approximately 2000 transcripts\/ng input RNA in both cases. Both agents are seen to\nelicit a response only following a sub-acute exposure, in agreement with the microarray  data, and\nthis is suggestive that the effect of these agents on Six1 gene expression occurs via an indirect\nmechanism.\nSix1 contributes to the anti-apoptotic effects of LiCl and VPA\nThe classical apoptosis-inducting chemical STS was capable of causing 92 % cell death in SH-\nSY5Y cells (Figure 3a), and this was accompanied by an increase in caspase-3 activity (205 % of\ncontrol), but no change in caspase-1 activity (Figure 3b). Pre-exposure of SH-SY5Y cells to the\nanti-mania drugs VPA and LiCl for 48 hours provided partial protection against STS (STS)-\nmediated cell death,  and reduced the activation of capase-3 to 145 % and 158 % of control levels\nrespectively (Figure 3a+b).\nIn order to investigate potential mechanisms by which this effect could be mediated we\nundertook pathway analysis using PathwayArchitect, constructing the model presented in figure\n3c. In this model, both LiCl and VPA interact with GSK3?, inhibiting its action. One of the many\ncellular targets for GSK3? is beta-catenin, and hence inhibition of GSK3? would lead to an\naccumulation of beta-catenin, which in turn activates the expression of a number of factors\nincluding the transcription factor Pax3, a factor that has previously been linked to the Six family.\nA downstream target for Six1 is cyclinA1, and we hypothesize that increases in Pax3 and\ncyclinA1 would result in increased expression of the anti-apoptotic factors Bcl2L1(Bcl-xl) and\nBcl2 respectively, resulting in the observed protection from STS-induced apoptosis.\nTo test this hypothetical pathway, we next examined the effect of LiCl and VPA exposure of\nSH-SY5Y cells on the expression of factors identified within the hypothetical pathway presented\nin figure 3c. Exposure of SH-SY5Y cells to either LiCl or VPA resulted in a dose-dependent\ninhibition of GSK3? (figure 4a), as measured by decreased pTyr216-GSK3? (active form) and\nincreased pSer9-GSK3? (inactive form). Protein levels of Pax3 and cyclinA1 were increased by\nboth LiCl and VPA in a dose-dependent manner (Figure 4b). Up-regulation of Pax3\/cyclinA1 is\nproposed to result in increased levels of the anti-apoptotic proteins Bcl2 and Bcl2L1, and figure\n4c demonstrates the increased transcript levels for these factors in SH-SY5Y cells following\nexposure to LiCl or VPA.\nNext, the input of Six1 into the observed neuroprotective effect was examined through over-\nexpression and knock-down experiments. Over-expression of Six1 reduced STS-induced cell\ndeath in SH-SY5Y cells by 43 %, and this reduction was again associated with an 8 % decrease in\nthe activation of caspase-3 (Figure 5a+b). This protection from STS-induced apoptosis is not\ncomplete however, demonstrating that other mechanisms also contribute to STS-induced\napoptosis, as reviewed by Gurvich and Klein (Gurvich and Klein, 2002).\nFinally, SH-SY5Y cells were transiently transfected with siRNA targeted against Six1, and\nthen exposed to either VPA or LiCl for 48 hours. Under such a treatment regime, increased\nexpression of Six1 by compounds was reduced to 131 % and 238 % of control for LiCl and VPA\nrespectively, compared to 290 % and 878 % without Six1 siRNA treatment (Figure 5c). This\nrepression was confirmed as specific through the use of both a second siRNA targeted against\nSix1, which gave a similar level of knock-down (data not shown). Such data demonstrates that\nsiRNA treatment was capable of reducing Six1 transcript expression in the cells by up to 73 %,\nalthough further work would be required to show that this effect translated to protein levels. As\npreviously seen, in cells exposed to LiCl or VPA alone, STS exposure results in significantly\ndecreased cell death compared to STS alone (24 % and 27 % respectively; Figure 5d). Over\nexpression of Six1 in SH-SY5Y cells results in an approximately 20% antagonism of the ability of\nLiCl or VPA to protect cells from STS-induced apoptosis (Figure 5d).  Transfection of SH-SY5Y\ncells with a non-Six1 siRNA, active against hypertension related, calcium regulate gene\n(HCaRG), demonstrated that the observed effect was specific and as a result of off-target effects\n(Figure 5d). Taken together, such data is strongly supportive of Six1 being the central component\nin the ability of LiCl and VPA to inhibit STS-induced apoptosis.\nDiscussion\nThe Six family of proteins are vertebrate homologues of the Drosophila sine oculis proteins,\nwhich are involved in cell fate differentiation (Kawakami et al., 2000). Sine oculis family\nmembers interact with the eyeless, eyes absent and dachshund proteins and are central to\nDrosophila eye development (Serikaku and O’Tousa, 1994), while their mammalian homologues\n(Six1-6, Pax, Eya and Dac respectively) have also been shown to play an important role in\norganogenesis (Li et al., 2003; Xu et al., 2003; Zheng et al., 2003). Their expression in specific\nmigrating cell populations appear to be vital, as both Drosophila and mice null for Six1 are non-\nviable, with null mice exhibiting large scale abnormalities in the development of skeletal muscle,\nas well as several major organs (Serikaku and O’Tousa, 1994; Laclef et al., 2003). Beyond this\ninitial identification as crucial regulators during development, six family members have recently\ncome under the spotlight due to their potential role in tumourogenesis, which is perhaps not\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nsurprising given their established role in cell migration and differentiation. Six1 has been shown\nto regulate cellular proliferation at the G2-M checkpoint (Ford et al., 1998; Ford et al., 2000), to\nbe over-expressed in a number of tumours (Ford et al., 1998; Li et al., 2002a; Reichenberger et\nal., 2005), inhibit apoptosis within ovarian tumours (Behbakht et al., 2007), and has been shown\nto be involved in metastasis (Yu et al., 2004). A common feature of tumour development is often\nthe co-ordinate regulation of both cell proliferation and apoptosis, with up-regulation of the\nformer and inhibition of the latter being central to mutation fixation and tumour growth\n(Roberts et al., 1995; Plant et al., 1998; Pliskova et al., 2005). It is thus interesting that GO\nanalysis clearly shows that genes associated with both apoptotic cell death and cell cycling are\naffected by VPA treatment. Genes up-regulated by 72 hours VPA treatment include several genes\nimplicated in the inhibition of apoptosis, including pim-1 (Moroy et al., 1993), BAG3 (Silva et\nal., 2008), inhibin ?a (Denkova et al., 2004), as well as those associated with growth arrest,\nincluding p21 (Wakabayashi et al., 2000)  and GAS2 (Brancolini et al., 1995). Such statistical\nanalysis of GO identifier over-expression does not identify the extent of impact on a biological\npathway, merely that more genes in that pathway are altered than would be expected by chance.\nThis is exemplified by the fact although GO identifiers negative regulation of apoptosis\/cell\ncycling are over-represented in the genes up-regulated following VPA exposure so are genes\nassociated with positive regulation, including TGF? (Bursch et al., 1993) and FOXO1\n(Fukunaga et al., 2005). Such data is consistent with studies showing that VPA can elicit either\npro-apoptotic (Phillips et al., 2003; Chen et al., 2007) or anti-apoptotic (Brunello, 2004)\nresponses, with cellular fate presumably being determined by the net flow through these two\nopposing pathways under any particular cell\/species\/biological condition. Herein we demonstrate\nthat exposure of SH-SY5Y cells to VPA has an inhibitory effect on apoptosis, reducing STS-\nmediated cell death, suggesting that in this case the net flow is through the anti-apoptotic\npathway. STS-mediated cell death has previously been shown to occur through the activation of\ncaspase-3 in SH-SY5Y cells (Posmantur et al., 1997), and we demonstrate that both LiCl and\nVPA partially protect (40-50 %) cells from STS through the inhibition of caspase-3 activity.\nThe molecular mechanisms underlying the many effects of LiCl and VPA on neural cells have\nnot been fully elucidated at present. In the current study VPA elicited many more alterations to the\nSHY-SY5Y transcriptome compared to LiCl, and two potential explanations exist for this. First,\ndaily dosing of chemicals could have resulted in accumulation of  VPA within cells, effectively\nincreasing the exposure. However, daily dosing was specifically chosen due to the relatively short\nhalf-life of VPA in culture, approximately 4.5 hours, to ensure an even exposure was obtained.\nLiCl has a considerably higher half-life in culture (approximately 30 hours), but the evidence\npresented herein is not consistent with an over-exposure to this agent. Second, VPA has a\nrecognised action as a histone deacetlylase (HDAC) inhibitor (De Sarno et al., 2002), which could\npotentially result in a more wide-spread transcriptome effect following exposure. Indeed, recent\nwork has suggested that the HDAC-inhibitory action of VPA is, at least in part, responsible for the\nneuroprotective mechanisms of this chemical (Chen et al., 2007; Kim et al., 2007; Leng et al.,\n2008).\nA common action of both chemicals in neural cells appears to be inhibition of GSK3?,\nalthough this is caused by different mechanism by the two agents. LiCl is a direct inhibitor of\nGSK3? through altered phosphorylation, whereas VPA appears to act both directly and indirectly\nvia its HDAC inhibitory action (Chen et al., 1999a; De Sarno et al., 2002; Al-Assar and Crouch,\n2005). Herein we demonstrate that in human SH-SY5Y cells both LiCl and VPA are able to\ninhibit GSK3? activity, which is in line with previous work in this cell line (De Sarno et al.,\n2002). Both agents produce a dose-dependent decrease in the active pTyr216-GSK3?, while\nincreasing pSer9-GSK3? by up to 300 %. A multitude of biological roles have been identified for\nGSK3? (Jope and Johnson, 2004), and hence it is not a simple process to understand the\nconsequences of GSK3? inhibition by LiCl and VPA. Increased levels of GSK3? have been\nassociated with increased apoptosis in SH-SY5Y cells (Bijur and Jope, 2000) and ultimately\nneurodegeneration in mice (Lucas et al., 2001), and hence this has led to the suggestion that\nGSK3? inhibition may play a role in the known neuroprotective actions of both LiCl and VPA in\nhumans (Brunello, 2004). Herein we confirm that both LiCl and VPA are able to protect neural\ncells from STS-mediated cell death, and show that this is due to decreased activity of caspase-3.\nOver-expression of Six1 in SH-SY5Y cells only results in an 8 % decrease in capase-3 activity\nfollowing STS exposure, but this is accompanied by a 42 % decrease in cell death. The\nexplanation for this disparity is not clear, but may be a reflection of the sampling time point (16\nhours of STS exposure), at which point many cells will be committed to, or have undergone, cell\ndeath and hence caspace-3 measurements are an underestimate. In addition, we present evidence\nto support a novel molecular pathway downstream of GSK3? inhibition that could mediate this\neffect. This model has been generated through a text-mining approach, whereby interactions\nbetween proteins, regardless of species or tissue of origin, are organised into a network. Whereas\nthis has the advantage that it can utilise a large literature base for construction of the pathway, it is\nimportant to note that as species- and\/or tissue-specific signalling pathways may exist the\ngenerated pathway must be confirmed experimentally in the tissue of interest. The degradation of\nbeta-catenin is controlled by GSK3? in a host of cell types, including neurons (Novak and Dedhar,\n1999; Kimelman and Xu, 2006), and hence inhibition of GSK3? would lead to an accumulation of\nbeta-catenin target genes. Amongst these targets is the transcription factor Pax3, which has\npreviously been shown to regulate transcription of Six1 in murine embryonic cardiomyocytes\n(Petropoulos and Skerjanc, 2002), with both  Pax and Six family members being central to murine\nneural development (Wlodarczyk et al., 1996). Herein we demonstrate that LiCl and VPA\ntreatment results in increased protein levels of Pax3, Six1 and cyclinA1 in human neuroblastoma\ncells. Whereas we do not demonstrate a causal relationship between the increase in these protein\nlevels in the current work,  the previously demonstrated inter-relationships of Pax3 and Six1\n(Petropoulos and Skerjanc, 2002) and the interaction of Six1 and CyclinA1 in murine embryonic\nfibroblasts  (Coletta et al., 2004) suggest that one may exist, allowing us to present the\nhypothetical pathway shown in figure 3. Pax3 and cyclinA1 have been previously linked to the\nexpression of the anti-apoptotic factors Bcl2L1(Bcl-xl) and Bcl2 respectively in murine liver\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\n(DelaCoste et al., 1999; Wakabayashi et al., 2000), and we demonstrate herein that the increased\nlevels of Pax3 and CyclinA1 correlate with increased transcript levels for both Bcl2 and Bcl2L1 in\nhuman SH-SY5Y cells. The observed increases in Bcl2 family members is in agreement with\nprevious work that chronic LiCl and VPA treatment increased Bcl2 expression levels in rat brain\n(Manji et al., 2001) and Bcl2 activity, both in SH-SY5Y cells in vitro (Yuan et al., 2001) and rat\nfrontal cortex in vivo  (Chen et al., 1999b). The increased activity of these two anti-apoptotic\nfactors would explain the observed decrease in caspase-3 activity in response to STS, and as\ninhibition of caspase activity has previously been linked to neuroprotection (Ray, 2006) we\npropose that this pathway is contributing to the ability of LiCl and VPA to act as neuroprotective\nagents. The protective ability of both LiCl and VPA against a number of other pro-apoptotic\nstimuli has been previously described, including ischemic stroke (Kim et al., 2007) and glutamate\n(Leng et al., 2008), with GSK3? inhibition appearing to play a central role in both processes. The\ncurrent work demonstrates that both LiCl and VPA have the ability to protect neural cells from\nSTS-induced apoptosis and that this is also associated, at least in part, with inhibition of GSK3?.\nIn summary, we have identified Six1 as a signalling molecule through which LiCl and VPA\nprotect neuroblastoma cells against STS-induced apoptosis, lending weight to the potential role of\nthese therapeutics for neuroprotection. Moreover, we propose a hypothetical model, based upon\nexisting literature, for their neuroprotective action, centred on the increased expression of the\nhomoedomain protein Six1 by both drugs, and provide supporting evidence for it. More studies\nare needed to elucidate other pathways that also contribute to caspase-3 activation in these cells,\nand this may help in the development of new exciting strategies for neuroprotection.\nConflict of Interest Statement\nG.G. Gibson, K.E. Plant and N. Plant have all received research grant funding from\nGlaxoSmithKline to undertake this work. E. Anderson and S. Forster were directly sponsored by\nGlaxoSmithKline and the Biotechnology and Biological Sciences Research Council, UK during\nthese studies. J. Lyon and N. Simecek are current employees of GlaxoSmithKline. R. Brown, J.\nSpinks and N. Toms have no current conflict of interests to declare\nReferences\nAghdam, S. Y., and Barger, S. W. (2007). Glycogen synthase kinase-3 in neurodegeneration and\nneuroprotection: lessons from lithium. Current Alzheimer Research 4, 21-31.\nAl-Assar, O., and Crouch, D. H. (2005). Inactivation of MAP kinase signalling in Myc\ntransformed cells and rescue by LiCl inhibition of GSK3. Molecular Cancer 4, e13.\nAllen, M. H., Hirschfeld, R. M., Wozniak, P. J., Baker, J. D., and Bowden, C. L. (2006). Linear\nRelationship of Valproate Serum Concentration to Response and Optimal Serum Levels\nfor Acute Mania. American Journal of Psychiatry 163, 272-275.\nBalfour, J. A., and Bryson, H. M. (1994). Valproic Acid - a Review of Its Pharmacology and\nTherapeutic Potential in Indications Other Than Epilepsy. Cns Drugs 2, 144-173.\nBehbakht, K., Qamar, L., Aldridge, C. S., Coletta, R. D., Davidson, S. A., Thorburn, A., and Ford,\nH. L. (2007). Six1 overexpression in ovarian carcinoma causes resistance to TRAIL-\nmediated apoptosis and is associated with poor survival. Cancer Res. 67, 3036-3042.\nBijur, G. N., and Jope, R. S. (2000). Glycogen synthase kinase-3beta facilitates staurosporine- and\nheat shock-induced apoptosis. Protection by lithium. J. Biol. Chem. 275, 7583-7590.\nBrancolini, C., Benedetti, M., and Schneider, C. (1995). Microfilament reorganization during\napoptosis: the role of Gas2, a possible substrate for ICE-like proteases. EMBO Journal 14,\n5179-5190.\nBrunello, N. (2004). Mood stabilizers: Protecting the mood.....Protecting the brain. Journal of\nAffective Disorders 79, S15-20.\nBursch, W., Oberhammer, F., Jirtls, R. L., Askari, M., Sedivy, R., Grasl-Kraupp, B., Purchio, A.\nF., and Schulte-Hermann, R. (1993). Transfroming growth factor B1 as a signal for\ninduction of cell death by apoptosis. British Journal of Cancer 67, 531-536.\nChen, G., Huang, L. D., Jiang, Y. M., and Manji, H. K. (1999a). The mood-stabilizing agent\nvalproate inhibits the activity of glycogen synthase kinase-3. Journal of\nNeurochemistry 72, 1327-1330.\nChen, g., Zeng, W.-Z., Yuan, L.-D., Jiang, Y.-M., Zhao, Z.-H., and Manji, H. (1999b). The mood\nstabilizing agents lithium and valproate robustly increase the levels of the neuroprotective\nprotein bcl-2 in the CNS. Journal of Neurochemistry 72, 879-882.\nChen, P. S., Wang, C. C., Bortner, C. D., Peng, G. S., Wu, X., Pang, H., Lu, R. B., Gean, P. W.,\nChuang, D. M., and Hong, J. S. (2007). Valproic acid and other histone deacetylase\ninhibitors induce microglial apoptosis and attenuate lipopolysaccharide-induced\ndopaminergic neurotoxicity. Neuroscience 149, 203-212. .\nChuang, D.-M. (2004). Neuroprotective and neurotrophic actions of the mood stabilizer lithium:\nCan it be used to treat neurodegenerative diseases? Critical Reviews in Neurobiology 16,\n83-90.\nColetta, R. D., Christensen, K., Reichenberger, K. J., Lamb, J., Micomonaco, D., Huang, L.,\nWolf, D. M., Muller-Tidow, C., Golub, T. R., Kawakami, K., and Ford, H. L. (2004). The\nSix1 homeoprotein stimulates tumorigenesis by reactivation of cyclin A1. Proc Natl Acad\nSci U S A 101, 6478-6483.\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nDe Sarno, P., Li, X. H., and Jope, R. S. (2002). Regulation of Akt and glycogen synthase kinase-3\nbeta phosphorylation by sodium valproate and lithium. Neuropharmacology 43, 1158-\n1164.\nDelaCoste, A., Fabre, M., McDonell, N., Porteu, A., Gilgenkrantz, H., Perret, C., Kahn, A., and\nMignon, A. (1999). Differential protective effects of Bcl-x(L) and Bcl-2 on apoptotic liver\ninjury in transgenic mice. American Journal of Physiology-Gastrointestinal and Liver\nPhysiology 40, G702-G708.\nDenkova, R., Bourneva, V., Staneva-Dobrovski, L., Zvetkova, E., Baleva, K., Yaneva, E.,\nNikolov, B., Ivanov, I., Simeonov, K., Timeva, T., and Yankov, M. (2004). In vitro effects\nof inhibin on apoptosis and apoptosis related proteins in human ovarian granulosa cells.\nEndocrine Regulations 38, 51-55.\nDennis Jr, G., Sherman, D. T., Hosack, D. A., Yang, J., Gao, W., Lane, H. C., and Lempicki, R.\nA. (2003). DAVID: Database for Annotation, Visualization, and Integrated Discovery.\nGenome Biol. 4, R60.\nDi Daniel, E., Mudge, A. W., and Maycox, P. R. (2005). Comparative analysis of the effects of\nfour mood stabilizers in SH-SY5Y cells and in primary neurons. Bipolar Disorders 7, 33-\n41.\nDing, D., and Greenberg, M. L. (2003). Lithium and valproate decrease the membrane\nphosphatidylinositol\/phosphatidylcholine ratio. Molecular Microbiology 47, 373-381.\nDunner, D. L. (1992). Differential-Diagnosis of Bipolar Disorder. Journal of Clinical\nPsychopharmacology 12, S7-S12.\nFord, H. L., Kabingu, E. N., Bump, E. A., Mutter, G. L., and Pardee, A. B. (1998). Abrogation of\nthe G2 cell cycle checkpoint associated with overexpression of HSIX1: a possible\nmechanism of breast carcinogenesis. Proc. Natl. Acad. Sci. USA 95, 12608-12613.\nFord, H. L., Landesman-Bollag, E., Dacwag, C. S., Stukenberg, P. T., Pardee, A. B., and Seldin,\nD. C. (2000). Cell cycle-regulated phosphorylation of the human SIX1 homeodomain\nprotein. J. Biol. Chem. 275, 22245-22254.\nFukunaga, K., Ishigami, T., and Kawano, T. (2005). Transcriptional regulation of neuronal genes\nand its effect on neural functions: Expression and function of forkhead transcription\nfactors in neurons. Journal of Pharmacological Sciences 98, 205-211.\nGurvich, N., and Klein, P. S. (2002). Lithium and valproic acid: parallels and contrasts in diverse\nsignaling contexts. Pharmacol. Ther. 96, 45-66.\nJann, M. W., Bitar, A. H., and Rao, A. (1982). Lithium prophylaxis of tricyclic-antidepressant-\ninduced mania in bipolar patients. American Journal of Psychiatry 139, 683-684.\nJope, R. S., and Johnson, G. V. (2004). The glamour and gloom of glycogen synthase kinase-3.\nTrends Biochem. Sci. 29, 95-102.\nKawakami, K., Sato, S., Ozaki, H., and Ikeda, K. (2000). Six family genes: Structure and function\nas transcription factors and their role in development. Bioessays 22, 616-626.\nKim, A. J., Shi, Y., Austin, R. C., and Werstuck, G. H. (2005). Valproate protects cells from ER\nstress-induced lipid accumulation and apoptosis by inhibiting glycogen synthase kinase-3.\nJournal of Cell Science 118, 89-99.\nKim, H. J., Rowe, M., Ren, M., Hong, J. S., Chen, P. S., and Chuang, D. M. (2007). Histone\ndeacetylase inhibitors exhibit anti-inflammatory and neuroprotective effects in a rat\npermanent ischemic model of stroke: Multiple mechanisms of action. J. Pharmacol. Exp.\nTher. 321, 892-901.\nKimelman, D., and Xu, W. (2006). beta-catenin destruction complex: insights and questions from\na structural perspective. Oncogene 25, 7482-7491.\nLaclef, C., Hamard, G., Demignon, J., Souil, E., Houbron, C., and Maire, P. (2003). Altered\nmyogenesis in Six1-deficient mice. Development 130, 2239-2252.\nLeng, Y., Liang, M. H., Ren, M., Marinova, Z., Leeds, P., and Chuang, D. M. (2008). Synergistic\nneuroprotective effects of lithium and valproic acid or other histone deacetylase inhibitors\nin neurons: Roles of glycogen synthase kinase-3 inhibition. Journal of Neuroscience 28,\n2576-2588.\nLi, C. M., Guo, M., Borczuk, A., Powell, C. A., Wei, M., Thaker, H. M., Friedman, R., and Klein,\nU. T., B. (2002a). Gene expression in Wilm’s tumour mimics the earliest committed stage\nin the metanephric mesenchymal-epithelial transition. American Journal of Pathology 160,\n2181-2190.\nLi, X., Bijur, G. N., and Jope, R. S. (2002b). Glycogen synthase kinase-3beta, mood stabilizers,\nand neuroprotection. Bipolar Disorder 4, 137-144.\nLi, X., Oghi, K. A., Zhang, J., Krones, A., Bush, K. T., Glass, C. K., Nigam, S. K., Aggarwal, A.\nK., Maas, R., Rose, D. W., and Rosenfeld, M. G. (2003). Eya protein phosphatase activity\nregulates Six1-Dach-Eya transcriptional effects in mammalian organogenesis. Nature 426,\n247-254.\nLu, R., Song, L., and Jope, R. S. (1999). Lithium attenuates p53 levels in human neuroblastoma\nSH-SY5Y cells. Neuroreport 10, 1123-1125.\nLucas, J. J., Hernandez, F., Gomez-Ramos, P., Moran, M. A., Hen, R., and Avila, J. (2001).\nDecreased nuclear beta-catenin, tau hyperphosphorylation and neurodegeneration in GSK-\n3beta conditional transgenic mice. EMBO Journal 20, 27-39.\nMacQueen, G. M., Hajek, T., and Alda, M. (2005). The phenotypes of bipolar disorder: relevance\nfor genetic investigations. Molecular Psychiatry 10, 811-826.\nManji, H. K., Moore, G. J., and Chen, G. (2001). Bipolar disorder: leads from the molecular and\ncellular mechanisms of action of mood stabilisers. British Journal of Psychiatry 178, S107-\n119.\nMcElroy, S. L., Keck, P. E., Pope, H. G., and Hudson, J. I. (1992). Valproate in the Treatment of\nBipolar Disorder - Literature-Review and Clinical Guidelines. Journal of Clinical\nPsychopharmacology 12, S42-S52.\nMendlewicz, J., Souery, D., and Rivelli, S. K. (1999). Short-term and long-term treatment for\nbipolar patients: beyond the guidelines. Journal of Affective Disorders 55, 79-85.\nMoroy, T., Grzeschiczek, A., Petzold, S., and Hartmann, K. U. (1993). Expression of a Pim-1\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\ntransgene accelerates lymphoproliferation and inhibits apoptosis in lpr\/lpr mice. Proc.\nNatl. Acad. Sci. U. S. A. 90, 10734-10738.\nNovak, A., and Dedhar, S. (1999). Signaling through beta-catenin and Lef\/Tcf. Cellular and\nMolecular Life Sciences 56, 523-537.\nPetropoulos, H., and Skerjanc, I. S. (2002). Beta-catenin is essential and sufficient for skeletal\nmyogenesis in P19 cells. J. Biol. Chem. 277, 15393-15399. .\nPhiel, C. J., Zhang, F., Huang, E. Y., Guenther, M. G., Lazar, M. A., and Klein, P. S. (2001).\nHistone deacetylase is a direct target of valproic acid, a potent anticonvulsant, mood\nstabilizer, and teratogen. J. Biol. Chem. 276, 36734-36741.\nPhillips, A., Bullock, T., and Plant, N. (2003). Sodium Valproate induces apoptosis in the rat\nhepatoma cell line, FaO. Toxicol. 192, 219-227.\nPlant, N. J., Horley, N. J., Dickins, M., Hasmall, S. C., Elcombe, C. R., and Bell, D. R. (1998).\nThe coordinate regulation of DNA synthesis and suppression of apoptosis is differentially\nregulated by the liver growth agents, phenobarbital and methylclofenapate.\nCarcinogenesis 19, 1521-1527.\nPliskova, M., Vondracek, J., Vojtesek, B., Kozubik, A., and Machala, M. (2005). Deregulation of\ncell proliferation by polycyclic aromatic hydrocarbons in human breast carcinoma MCF-7\ncells reflects both genotoxic and nongenotoxic events. Toxicol. Sci. 83, 246-256.\nPosmantur, R., McGinnis, K., Nadimpalli, R., Gilbertsen, R. B., and Wang, K. K. (1997).\nCharacterization of CPP32-like protease activity following apoptotic challenge in SH-\nSY5Y neuroblastoma cells. Journal of Neurochemistry 68, 2328-2337.\nRay, S. K. (2006). Currently evaluated calpain and caspase inhibitors for neuroprotection in\nexperimental brain ischemia. Current Medicinal Chemistry 13, 3425-3440.\nReichenberger, K. J., Coletta, R. D., Schulte, A. P., Varella-Garcia, M., and Ford, H. L. (2005).\nGene Amplification is a mechanism of Six1 overexpression in breast cancer. Cancer\nRes. 65, 2668-2675.\nRoberts, R., Soames, A., Gill, J., James, N., and Wheeldon, E. (1995). Non-genotoxic\nhepatocarcinogens stimulate DNA synthesis and their withdrawal induces apoptosis, but in\ndifferent hepatocyte populations. Carcinogenesis 16, 1693.\nSerikaku, M. A., and O’Tousa, J. E. (1994). Sine oculis is a homeobox gene required for\nDrosophila visual system development. Genetics 138, 1137-1150.\nSilva, R., Mesquita, A. R., Bessa, J., Sousa, J. C., Sotiropoulos, I., Leao, P., Almeida, O. F. X.,\nand Sousa, N. (2008). Lithium blocks stress-induced changes in depressive-like behavior\nand hippocampal cell fate: The role of glycogen-synthase-kinase-3 beta.\nNeuroscience 152, 656-669.\nSpearing, M. (2001). Bipolar Disorder. NIH Publications 02-3679.\nSproule, B. (2002). Lithium in bipolar disorder; Can drug concentrations predict therapeutic\neffect? Clincal Pharmacokinetics 41, 639-660.\nStrakowski, S. M., DelBello, M. P., and Adler, C. M. (2001). Comparative efficacy and\ntolerability of drug treatments for bipolar disorder. CNS Drugs 15, 701-718.\nThomas, P. (2004). The many forms of bipolar disorder: a modern look at an old illness. Journal\nof Affective Disorders 79, S3-8.\nTusher, V. G., Tibshirani, R., and Chu, G. (2001). Significance analysis of microarrays applied to\nthe ionizing radiation response. Proc. Natl. Acad. Sci. USA 98, 5116-5121.\nWakabayashi, K., Saito, H., Ebinuma, H., Saito, Y., Takagi, T., Nakamura, M., Umezawa, A.,\nHata, J. S., and Ishii, H. (2000). Bcl-2 related proteins are dramatically induced at the early\nstage of differentiation in human liver cancer cells by a histone deacetylase inhibitor\nprojecting an anti-apoptotic role during this period. Oncology Reports 7, 285-288.\nWlodarczyk, B. C., Craig, J. C., Bennett, G. D., Calvin, J. A., and Finnell, R. H. (1996). Valproic\nacid-induced changes in gene expression during neurulation in a mouse model.\nTeratology 54, 284-297.\nXu, P. X., Zheng, W., Huang, L., Maire, P., Laclef, C., and Silvius, D. (2003). Six1 is required for\nthe early organogenesis of mammalian kidney. Development 130, 3085-3094.\nYu, Y., Khan, J., Khanna, C., Helman, L., Meltzer, P. S., and Merlino, G. (2004). Expression\nprofiling identifies the cytoskeletal organiser erzin and the developmental homeoprotein\nSix1 as key metastatic regulators. Nature Medicine 10, 175-181.\nYuan, P. X., Huang, L. D., Jiang, Y. M., Gutkind, J. S., Manji, H. K., and Chen, G. (2001). The\nmood stabilizer valproic acid activates mitogen-activated protein kinases and promotes\nneurite growth. J. Biol. Chem. 276, 31674-31683.\nZheng, W., Huang, L., Wei, Z. B., Silvius, D., Tang, B., and Xu, P. X. (2003). The role of Six1 in\nmammalian auditory system development. Development 130, 3989-4000.\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nFigure Legends\nFigure 1: Gene expression profile in SH-SY5Y cells exposed to anti-mania agents.\nQuadruplicate cultures of SH-SY5Y cells (two cultures each from ECACC- and Bristol-sourced\ncells) were exposed to 1mM LiCl, 1mM VPA or medium for 6 or 72 hours. RNA was extracted\nand transcript levels monitored using Affymetrix human U133A\/B microarrays. (A) Control\ncultures from both sources had highly correlated transcriptomes after 6 hours and 72 hours of\nculture. Statistical Analysis of Microarray (SAM) outputs are presented (Dose vs medium)\nfollowing 6 hours of LiCl (B) or VPA (C) exposure, and 72 hours of LiCl (D) or VPA (E)\ntreatment, showing observed versus expected scores and the lines of equivalence and significance.\nThe number of regulated genes, plus the expected false positives for the indicated false discovery\nrate (FDR) are also indicated. Correlation analysis of the SH-SY5Y transcriptome from the two\ncell sources under each experimental condition is included as an inset figure.\nFigure 2: Time and dose dependent increased Six1 expression elicited by LiCl and VPA\nexposure. SH-SY5Y neuroblastoma cells were exposed to VPA or LiCl at the indicated\nconcentrations for 48 hours and then Six1 expression measured at the transcript level using\nTaqMan Q-PCR (A) and the protein level by Western blotting with TNT-expressed Six1 used as a\npositive control.  Protein expression was determined by densitometry (n=3), normalised to actin\nlevels, and displayed as fold increase over vehicle control ±SEM (B). For time course experiments\ncells were exposed to 3mM of compound (closed bars) or medium (open bars) for the indicated\ntimes and then Six1 transcript level measured via quantitative PCR for n=4±SEM (C). Statistical\nanalysis was via one-way ANOVA; *=p<0.01, **=p<0.05 and ***=p<0.01.\nFigure 3: Putative molecular mechanism for LiCl and VPA-induced neuroprotection.\nSH-SY5Y neuroblastoma cells were exposed to 3mM LiCl or 3mM VPA for 48 hours, with 1?M\nSTS added for the final 16 hours as indicated. Cell death was then measured by LDH assay (A)\nand caspase-1\/caspase-3 activity fluorimetric assay (B). For all experiments, data represents\nn=4±SEM, with statistical analysis via one- or two way ANOVA as applicable; *=p<0.01,\n**=p<0.05 and ***=p<0.01 and figure is representative of duplicate repeat experiments. (C)\nPathway Architect software was used to develop a putative molecular mechanism by which LiCl\nand VPA could act inhibit apoptosis: LiCl and VPA inhibit, either directly or indirectly, GSK3?,\nwhich results in the observed increases in Pax3, Six1 and CyclinA1. Known target genes for Pax 3\nand CyclinA1 are the anti-apoptotic proteins Bcl2L1 and Bcl2 respectively. Increased levels of\nthese proteins result in blockade of caspase-3-mediated apoptosis and, ultimately, neuroprotection.\nFigure 4: LiCl and VPA increase the expression of Pax3, cyclinA1 and anti-apoptotic\nmembers of the Bcl2 family.\nSH-SY5Y neuroblastoma cells were exposed to VPA or LiCl at the indicated concentrations for\n48 hours and then GSK3? phosphorylation status measured by ELISA (A). Pax3, CyclinA1 and\nActin protein levels were measured by Western blotting, with TNT-expressed Pax3 and CyclinA1\nused as a positive control.  Protein expression was determined by densitometry (n=3), normalised\nto actin levels, and displayed as fold increase over vehicle control ±SEM (B). Bcl2 and Bcl2L1\ntranscript levels were measured by TaqMan Q-PCR (n=4 ±SEM) (C). Statistical analysis was via\none-way ANOVA; *=p<0.01, **=p<0.05 and ***=p<0.01. \nFigure 5: Six 1 is central to the LiCl and VPA-mediated neuroprotection against STS\ninduced apoptosis in SH-SY5Y cells\nSix1 was over-expressed in SH-SY5Y cells, which were then exposed to 1?M STS or medium for\n16 hours and then cell death measured using LDH assay (A) and caspase-1\/caspase-3 activity\nmeasured using a fluorimetric assay (B). In addition, SH-SY5Y neuroblastoma cells were exposed\nto 3mM LiCl or 3mM VPA for 48 hours, with 1?M STS added for the final 16 hours as indicated;\nwells were also transfected with siRNA targeted against Six1. Successful knockdown of Six1 was\ndetermined  by quantitative PCR and Western blotting. An off-target siRNA (HCaRG) was\nincluded as a negative control (C). Cell death was measured using LDH assay, including siRNAs\nagainst both Six1 and HCaRG (D). Each data point represents n=4 ±SEM. Statistical analysis was\nvia one- or two way ANOVA as applicable; *=p<0.01, **=p<0.05 and ***=p<0.01 and is\nrepresentative of at least duplicate repeat experiments.\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\n|Treatment |Time  |FDR  |Genes   |Gene      |Gene      |Predicted|\n|          |      |     |changed |Expression|Expression|False    |\n|          |      |     |        |Increased |Decreased |Positives|\n|1mM LiCl  |6h    |1%   |0       |0         |0         |0        |\n|1mM VPA   |6h    |1%   |155     |121       |34        |1.49     |\n|1mM LiCl  |72h   |20%  |14      |14        |0         |2.85     |\n|1mM VPA   |72h   |1%   |767     |637       |130       |8.3      |\nTable 1: Gene expression changes elicited by LiCl and VPA in SH-SY5Y cells. Quadruplicate\ncultures of SH-SY5Y cells were exposed to 1mM LiCl, 1mM VPA or medium for 6 or 72 hours\nas indicated. RNA was extracted and gene expression monitored using Affymetrix human\nU133A\/B microarrays. Statistical Analysis of Microarrays (SAM) analysis was undertaken to\nidentify statistically significant gene expression changes (Dose vs medium). False Discovery Rate\n(FDR) was manually set to provide sufficient gene changes, while limiting the number of\npredicted false positives. Numbers of genes altered under each condition are presented for the\nstated FDR, along with the predicted number of false positives within each group.\n|Biological Process                   |VPA 6h  |VPA 6h  |LiCl 72h  |VPA 72h   |VPA 72h  |\n|                                     |Up      |Down    |Up        |Up        |Down     |\n|Antigen presentation                 |        |        |          |8         |         |\n|Biosythesis                          |8       |        |          |36        |20       |\n|        Protein biosynthesis         |3       |        |          |13        |12       |\n|        Lipid biosynthesis           |        |        |          |10        |3        |\n|        Steroid biosynthesis         |        |        |          |4         |         |\n|Cation transport                     |4       |        |          |19        |         |\n|        Cation homeostasis           |        |        |          |8         |         |\n|Cell Activation                      |        |        |          |6         |         |\n|Cell communication                   |18      |        |4         |          |12       |\n|        Signal transduction          |16      |        |4         |          |12       |\n|        Intracellular siganlling     |12      |        |          |          |6        |\n|cascade                              |        |        |          |          |         |\n|        small GTPase mediated signal |6       |        |          |          |         |\n|transduction                         |        |        |          |          |         |\n|        Regulation of signalling     |        |        |          |5         |         |\n|transduction                         |        |        |          |          |         |\n|Cell cycle                           |8       |        |          |          |         |\n|Cell death                           |3       |        |          |20        |4        |\n|        Apoptosis                    |3       |        |          |19        |4        |\n|        Negative regulation of       |        |        |          |7         |         |\n|apoptosis                            |        |        |          |          |         |\n|        Positive regulation of       |        |        |          |6         |         |\n|apoptosis                            |        |        |          |          |         |\n|Development                          |11      |4       |          |          |         |\n|        Morphogenesis                |6       |        |          |31        |         |\n|        Cell morphogenesis           |4       |        |          |17        |         |\n|        Cell growth                  |3       |        |          |8         |         |\n|        Cell migration               |        |        |          |7         |         |\n|        Cell motility                |        |        |          |11        |         |\n|Electron transport                   |3       |        |          |9         |         |\n|Extracellular matrix organization and|        |        |          |5         |         |\n|biogenesis                           |        |        |          |          |         |\n|        Synapse organization and     |        |        |          |3         |         |\n|biogenesis                           |        |        |          |          |         |\n|Localization                         |22      |4       |          |99        |         |\n|        Transport                    |21      |4       |          |86        |         |\n|        Cell organization and        |14      |        |          |48        |11       |\n|biogenesis                           |        |        |          |          |         |\n|        Cellular Localization        |8       |        |          |19        |         |\n|        Lipid transport              |        |        |          |7         |         |\n|        Protein transport            |7       |        |          |21        |         |\n|Metabolism                           |45      |11      |4         |211       |72       |\n|        Regulation of metabolism     |16      |7       |          |57        |31       |\n|        Macromolecule metabolism     |22      |6       |          |113       |45       |\n|        Protein metabolism           |18      |4       |          |85        |28       |\n|        Lipid metabolism             |8       |        |          |28        |4        |\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\n|        Steroid metabolism           |3       |        |          |11        |         |\n|        Carbohydrate metabolism      |        |        |          |20        |         |\n|        DNA metabolism               |        |        |          |          |11       |\n|Regulation of Enzyme activity        |4       |        |          |10        |         |\n|        Regulation of kinase activity|4       |        |          |6         |         |\n|        Regulation of transferase    |4       |        |          |6         |         |\n|activity                             |        |        |          |          |         |\n|Secretion                            |        |        |          |12        |         |\n|        Regulation of secretion      |        |        |          |4         |         |\n|Transcription                        |16      |6       |          |48        |30       |\n|Wnt receptor signalling pathway      |        |        |          |6         |         |\n|        Cell-cell signalling         |        |        |          |23        |         |\n|        Synaptic transmission        |        |        |          |12        |         |\nTable 2: Functional Annotation Clustering of GO identifiers for regulated genes\nSH-SY5Y cells were exposed to 1mM LiCl, 1mM VPA or medium for 6 or 72 hours as indicated.\nRNA was extracted and gene expression monitored using Affymetrix human U133A\/B\nmicroarrays. Statistical Analysis of Microarrays (SAM) followed by interrogation of the database\nfor annotation, visualization and integrated discovery (DAVID) was used to identify gene\nontogeny terms that were over-represented following compound treatment.\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\nPlant et al: Six1 mediates LiCl\/VPA-induced neuroprotection\n33\n\n"}