{"doi":"10.1016\/j.brainres.2007.12.050","coreId":"177380","oai":"oai:aura.abdn.ac.uk:2164\/2186","identifiers":["oai:aura.abdn.ac.uk:2164\/2186","10.1016\/j.brainres.2007.12.050"],"title":"Induced gamma-band activity is related to the time point of object identification","authors":["Martinovic, Jasna","Gruber, Thomas","Hantsch, Ansgar","Mueller, Matthias M."],"enrichments":{"references":[{"id":3560,"title":"A cortical mechanism for triggering top-down facilitation in visual object recognition.","authors":[],"date":"2003","doi":"10.1162\/089892903321662976","raw":"Bar, M., 2003. A cortical mechanism for triggering top-down facilitation in visual object recognition. J. Cogn. Neurosci. 15, 600–609.","cites":null},{"id":3559,"title":"A set of 400 pictures standardized for French: Norms for name agreement, image agreement, familiarity, visual complexity, image variability, and age of acquisition.","authors":[],"date":"1999","doi":"10.3758\/BF03200732","raw":"Alario, F. X., Ferrand, L., 1999. A set of 400 pictures standardized for French: Norms for name agreement, image agreement, familiarity, visual complexity, image variability, and age of acquisition. Behav. Res. Methods. 31, 531-552.","cites":null},{"id":3561,"title":"Top-down facilitation of visual recognition.","authors":[],"date":"2006","doi":"10.1073\/pnas.0507062103","raw":"Bar, M., Kassam, K. S., Ghuman, A. S., Boshyan, J., Schmid, A. M., Dale, A. M., Hämäläinen, M. S., Marinkovic, K., Schacter, D. L., Rosen, B. R., Halgren, E., 2006. Top-down facilitation of visual recognition. Proc. Natl. Acad. Sci. U. S. A. 103, 449-454. Bates, E., D'Amico, S., Jacobsen, T., Szekely, A., Andonova, E., Devescovi, A., Herron, D., Lu, C. C., Pechmann, T., Pleh, C., Wicha, N., Federmeier, K., Gerdjikova, I., Gutierrez, G., Hung, D., Hsu, J., Iyer, G., Kohnert, K., Mehotcheva, T., Orozco-","cites":null}],"documentType":{"type":1}},"contributors":["University of Aberdeen, School of Psychology"],"datePublished":"2008-03-10","abstract":"Peer reviewedPostprin","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:aura.abdn.ac.uk:2164\/2186<\/identifier><datestamp>\n                2018-01-05T20:52:05Z<\/datestamp><setSpec>\n                com_2164_646<\/setSpec><setSpec>\n                com_2164_366<\/setSpec><setSpec>\n                com_2164_330<\/setSpec><setSpec>\n                com_2164_705<\/setSpec><setSpec>\n                col_2164_647<\/setSpec><setSpec>\n                col_2164_706<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nInduced gamma-band activity is related to the time point of object identification<\/dc:title><dc:creator>\nMartinovic, Jasna<\/dc:creator><dc:creator>\nGruber, Thomas<\/dc:creator><dc:creator>\nHantsch, Ansgar<\/dc:creator><dc:creator>\nMueller, Matthias M.<\/dc:creator><dc:contributor>\nUniversity of Aberdeen, School of Psychology<\/dc:contributor><dc:subject>\ngamma-band activity<\/dc:subject><dc:subject>\nnaming<\/dc:subject><dc:subject>\nobject identification<\/dc:subject><dc:subject>\nview-dependent recognition<\/dc:subject><dc:subject>\nEEG<\/dc:subject><dc:subject>\nsource localisation<\/dc:subject><dc:subject>\noscillatory brain activity<\/dc:subject><dc:subject>\nrepetition priming task<\/dc:subject><dc:subject>\ntop-down facilitation<\/dc:subject><dc:subject>\nrotated objects<\/dc:subject><dc:subject>\nhuman EEG<\/dc:subject><dc:subject>\nfamiliar objects<\/dc:subject><dc:subject>\nnatural objects<\/dc:subject><dc:subject>\nworking-memory<\/dc:subject><dc:subject>\nrecognition<\/dc:subject><dc:subject>\nresponses<\/dc:subject><dc:subject>\nRC0321 Neuroscience. Biological psychiatry. Neuropsychiatry<\/dc:subject><dc:subject>\nRC0321<\/dc:subject><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPostprint<\/dc:description><dc:date>\n2011-11-24T16:17:02Z<\/dc:date><dc:date>\n2011-11-24T16:17:02Z<\/dc:date><dc:date>\n2008-03-10<\/dc:date><dc:type>\nJournal article<\/dc:type><dc:identifier>\nMartinovic , J , Gruber , T , Hantsch , A & Mueller , M M 2008 , ' Induced gamma-band activity is related to the time point of object identification ' Brain Research , vol 1198 , pp. 93-106 . DOI: 10.1016\/j.brainres.2007.12.050<\/dc:identifier><dc:identifier>\n0006-8993<\/dc:identifier><dc:identifier>\nPURE: 1592631<\/dc:identifier><dc:identifier>\nPURE UUID: ca6a3ad4-8943-4db7-bdd6-d9e154c3a8f5<\/dc:identifier><dc:identifier>\nWOS: 000254106400011<\/dc:identifier><dc:identifier>\nScopus: 43049123763<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2164\/2186<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1016\/j.brainres.2007.12.050<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nBrain Research<\/dc:relation><dc:rights>\nNOTICE: this is the author’s version of a work that was accepted for publication in the journal Brain Research.Changes resulting from the publishing process, such as peer review, editing, corrections, structural formatting, and other quality control mechanisms may not be reflected in this document. Changes may have been made to this work since it was submitted for publication. A definitive version was subsequently published in Brain Research, Volume 1198 (10 March 2008), doi:10.1016\/j.brainres.2007.12.050<\/dc:rights><dc:format>\n14<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0006-8993","issn:0006-8993"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Brain Research"],"year":2008,"topics":["gamma-band activity","naming","object identification","view-dependent recognition","EEG","source localisation","oscillatory brain activity","repetition priming task","top-down facilitation","rotated objects","human EEG","familiar objects","natural objects","working-memory","recognition","responses","RC0321 Neuroscience. Biological psychiatry. Neuropsychiatry","RC0321"],"subject":["Journal article"],"fullText":"Induced gamma-band activity is related to the time point of object identification \n \nMartinovic, Jasna\n1,2\n \nGruber, Thomas\n1\n \nHantsch, Ansgar\n1\n \nand \nMüller, Matthias M.\n 1\n \n \n1 \n- Institut für Psychologie I, Universität Leipzig, Germany \n2 - \nSchool of Psychology, University of Liverpool, UK \n \nTotal number of Pages: 44 \nNumber of Tables: 4 \nNumber of Figures: 7 \n \nCorresponding Author:  \nMatthias Müller  \nInstitut für Psychologie I, Universität Leipzig, \nSeeburgstrasse 14-20,  \n04103 Leipzig,  \nGermany.  \nTel.: +49-341-973 5962  \nFax: +49-341-973 5969  \nEmail: m.mueller@rz.uni-leipzig.de \n \n \n 2 \nAbstract: \n \nObject recognition is subserved by mechanisms that seem to rely on the activity of distributed \nneural assemblies coordinated by synchronous firing in the gamma-band range (>20Hz). The \npresent study relied on a novel EEG-compatible plane-rotation paradigm to elicit view-\ndependent processing leading to delays in the recognition of disoriented objects. The \nparadigm involved a covert naming task (grammatical gender decision). The task’s suitability \nwas first evaluated through a control experiment that contrasted covert with overt naming. \nThe plane-rotation paradigm was subsequently employed in an EEG experiment. It was found \nthat recognition delays for disoriented objects were accompanied by induced gamma-band \nactivity’s (GBA) peak latency delays, replicating Martinovic, Gruber and Müller (2007, \nJournal of Cognitive Neuroscience). Brain electrical tomography was performed to obtain \nfurther information on the intracranial current density distributions underlying the latency \nshifts. Induced GBA was found to be generated by a set of distributed prefrontal, temporal \nand posterior sources committed to representational processing. Their relative contribution \ndiffered between upright and disoriented objects, as prefrontal activity became more \nprominent with increased disorientation. Together these findings indicate that adaptive \nchanges in dynamic coding of object identity occur during recognition of disoriented objects. \nInduced GBA is a marker of pronounced sensitivity to these changes and thus a robust neural \nsignature of representational activity in high-level vision. \n \nSection: Cognitive and Behavioral Neuroscience \nKeywords: gamma-band activity, naming, object identification, view-dependent recognition, \nEEG, source localisation \n 3 \n1. Introduction  \n \nStudies on mechanisms of high-level vision suggest objects are represented through \nformations of distributed feature-coding neural assemblies. Within and between these \nassemblies transient integrative activity is thought to occur through synchronous firing in the \ngamma-band frequencies (> 20 Hz) (Gruber and Müller, 2005; Varela et al., 2001). This type \nof activity can be detected in the high frequency range (30-90 Hz) of the human \nelectroencephalogram (EEG). It can be either evoked or induced depending on whether it is or \nis not time- and phase-locked to stimulus onset (Singer and Gray, 1995). In the visual domain \nit has been repeatedly demonstrated that evoked gamma-band activity (GBA), occurring at \napprox. 100 ms post-stimulus onset, is related to the processing and integration of features \n(Busch et al., 2004; Karakas and Basar, 1998). Meanwhile, induced GBA, occurring at \napprox. 200-400 ms post-stimulus onset, is a signature of cortical object representation \n(Kaiser et al., 2004; Lachaux et al., 2005; Tallon-Baudry and Bertrand, 1999; Tallon-Baudry \net al., 2005); particularly the late representational processing that follows successful \nidentification (Fiebach et al., 2005; Gruber et al., 2004; Gruber and Müller, 2005; Martinovic \net al., 2007).  \nAn abundance of evidence shows that increases in induced GBA amplitude \naccompany successful recognition of complex meaningful objects (Gruber et al., 2004; \nGruber and Müller, 2005; Lachaux et al., 2005; Tallon-Baudry et al., 2005). However, its time \ncourse has not been successfully related to object identification until a recent study \n(Martinovic et al., 2007) demonstrated that delays in peak latency of induced GBA \naccompanied delays in the recognition of disoriented objects. In that study, participants had to \ncovertly name images that could either be presented upright or disoriented in the picture \nplane. Covert naming was performed in the form of a phonological decision on the first letter \n 4 \nof the object’s name, with vowels as rare stimuli. While induced GBA showed latency shifts, \nevoked GBA and event-related potential (ERP) components remained unmodulated. \nHowever, the delays in behavioural and neurophysiological measures of recognition failed to \nshow a direct correlation. It has already been reported that repetition suppression in induced \nGBA amplitude relates to RT benefits obtained through visual priming, although the two \nmeasures do not correlate (e.g., Fiebach et al., 2005). Therefore the authors concluded that the \nfindings provide further evidence in support of the Tallon-Baudry and Bertrand’s (1999) \nrepresentational hypothesis, which claims that induced GBA is a neural marker of object \ncoding.  \nMartinovic et al.’s (2007) plane-rotation paradigm used a covert naming task in order \nto elicit delays in the recognition of disoriented objects. Such view-dependent recognition \neffects are a phenomenon that has long been known in behavioural literature. Picture-plane \nrotated two-dimensional (2D) images of familiar objects with a predominant environmental \norientation (e.g., horse, table, chair, etc.) generally require more time to be overtly named than \nupright images (Jolicoeur, 1985; McMullen and Jolicoeur, 1990; Murray, 1995a). Such \norientation effects are observed in speeded naming tasks performed on large and diverse \nstimulus sets, therefore demanding recognition to employ view-dependent mechanisms \n(Murray, 1998). Overt naming delays for disoriented objects obtained with plane-rotation \nparadigms are generally considered to reflect delays in recognition processes themselves. \nThese delays are thought to arise due to a nonlinear image normalisation that is needed for the \ninitial identification of the object (Jolicoeur et al., 1998; Lawson and Jolicoeur, 2003; \nWillems and Wagemans, 2001). An alternative view claims that the viewpoint costs do not \noccur during intial identification. This account, based on attentional blink and repetition \nblindness paradigms, claim that costs are incurred when representations become consolidated \nin visual memoryDux and Harris, 2007; Harris and Dux, 2005). The early versus late \n 5 \nviewpoint-effect distinction from behavioural literature does not challenge Martinovic et al.’s \n(2007) findings. As induced GBA is related to late representational processing, the delay that \nis observed in their peak latency could be due to an intervening process at either the initial or \nthe consolidated representation stage.  \nThe aim of the present study was to replicate and extend Martinovic et al.’s (2007) \nfindings on the relatedness of induced GBA to object recognition processes. In relation to \nMartinovic et al. (2007), the present study introduces three major new elements. First of all, \nmodifications were introduced to the plane-rotation paradigm in order to increase the quality \nof the data. The assignment of stimuli to the upright and disoriented conditions was \ncounterbalanced across the sample instead of being fixed condition-wise as in Martinovic et \nal. (2007). Also, a more stringent gender decision task was used instead of the phonological \ndecision that was employed by Martinovic et al. (2007)\n1\n.  \nSecondly, in order to assess the validity of covert tasks a control experiment was \nconducted. It contrasted overt and covert naming (i.e. gender decision) in eliciting object \nrecognition delays with a plane-rotation paradigm. Martinovic et al. (2007) implicitly posited \nthat tasks based on covert naming directly correspond to overt naming. However, the \ncomparability between overt and covert naming should be experimentally examined. \nConvergence of covert and overt RTs would allow us to confidently relate RT delays from \ncovert tasks to the timing of recognition processes.  \n Lastly, the EEG experiment was more extensive than in Martinovic et al. (2007). In \naddition to behavioural, ERP and event-related GBA analyses it included brain electrical \ntomography (BET). This was done in order to ascertain if shifts in latency are also \naccompanied by changes in the activity of generating cortical structures. A distributed set of \nprefrontal, temporal and posterior regions, committed to object recognition, were expected to \n                                                 \n1\n ‘Materials and Procedure’ section of the Methods contains information on the importance of stimulus \ncounterbalancing in plane-rotation studies. It also provides the relevant information on the advantages of a \ngrammatical gender decision task.  \n 6 \nbe the sources of GBA induced by entry-level object recognition (for previous findings using \na categorisation task, see Gruber et al., 2006; for a detailed model describing regions involved \nin object identification, see Bar, 2003). If induced GBA was indeed a marker of dynamic \nobject coding, as Martinovic et al. (2007) proposed in their conclusion, adaptive changes that \nlead to latency shifts should also be visible from the pattern of activity within these \ndistributed sources. In line with Bar’s (2003) model, prefrontal generators should become \nmore prominent with increased rotation through additional or prolonged top-down processing \nof possible templates that define object identity for disoriented objects (for evidence for such \ntop-down inputs in high-level vision, see Bar et al., 2006). Therefore, it was hypothesised that \nfor disoriented objects prefrontal sources should progressively enhance their activity relative \nto the temporal and posterior sources. \nThere is an additional reason for complementing the latency shifts in induced GBA \nwith another independent measure of a change in activity. From a methodological point peak \namplitude and latency in the waveforms obtained from EEG signal cannot be considered to be \nfully independent (Otten and Rugg, 2005). This is due to the fact that latency actually reflects \nchanges in the distribution of amplitude over time and in the presence of jitter it also depends \non the differences in variance between conditions. A shift in peak latency without a change in \namplitude was interpreted in Martinovic et al. (2007) as a delay which may also reflect a more \ngeneral change in the distribution of underlying high-frequency oscillatory activity. Therefore \nlooking for shifts in the amount of activity of distributed sources between upright and \ndisoriented objects allows us to get one step closer to the actual change in adaptive neural \nprocessing that may be reflected in the induced GBA latency modulations. If such changes in \ncortical processes were identified, it would allow us to connect induced GBA with specific \naspects of late representational processing of objects.  \n \n 7 \n2. Results \n \n2.1. Results of the Control Experiment \n \nIn this experiment RTs from a covert naming paradigm (i.e. gender decision) were \ncontrasted to those from overt naming using a plane-rotation paradigm. It was hypothesised \nthat both tasks would produce recognition delays for disoriented objects and that the obtained \nnaming times would correlate with each other suggesting that same processes subserved overt \nand covert tasks. \n \nTable 1 shows accuracy rates and RTs for overt and covert tasks. Error rate for overt \nnaming was 21.87 ± 2.13 % while missing data amounted to 3.27 ± 0.82 %. In covert naming \nerror rate was 19.35 ± 3.28 % and missing data amounted to 2.20 ± 0.77 %. For overt naming \nit is possible to differentiate between several types of wrong responses. Wrong names that \ncarry the same gender as the correct response, which would be accepted as an accurate answer \nin the covert task, amounted to 1.32 ± 0.38 %. Non-dominant names\n2\n with same gender, \nwhich would be classified as wrong in overt but as correct in covert naming, were shown to \nbe quite high at 9.15 ± 1.20 %. Non-dominant names of different gender were at 6.79 ± 1.09 \n% and wrong names with different gender were at 2.31 ± 0.63 %. Errors due to lipsmacking, \ndisfluency or technical malfunction came to 2.39 ± 0.44 %. \n \n------------------------------- \ninsert Table 1 about here \n------------------------------- \n \n                                                 \n2\n Images of objects often have several alternative names. In naming studies, different participants will end up \nproducing different names in response to the stimulus picture. The name that is most often produced is referred \nto as the ‘dominant name’ while other less frequent alternatives are called ‘non-dominant names’.  \n 8 \nAs expected, for both overt and covert tasks there were no significant RT differences \nbetween 60° and 300° or between 120° and 240° therefore in all further analyses they were \naveraged together to form two conditions (±60° and ±120° departures from upright). \nA 2x3 repeated measures ANOVA (task; degree of rotation) across subjects was \nperformed to contrast the accuracy rates. No main effect for the type of task (F (2, 22) = 1.22, \nn.s.) was found but there was a trend for disorientation (F (2, 22) = 3.34, p = 0.07). There was \nno interaction between the factors (F < 1). As Table 1 shows, the approaching significant \neffect of disorientation was mainly due to the fact that for covert naming there is an \ninsignificant tendency for accuracy rates to decrease with increasing disorientation (F (1, 11) \n= 3.14; p = 0.06). No such trend was present for overt naming (F (1, 11) = 1.83; n.s.). \n RT analyses were performed across subjects (2x3 repeated measures ANOVA with \nfactors task and degree of rotation) with disorientation effects further examined across items \n(one-way ANOVA). Main effects of task (F (2, 22) = 93.3 ,p < 0.001) were found. Response \nlatencies were about 200-300 ms longer for gender decision than for overt naming leading to \na significant effect. Disorientation resulted in longer response times yielding a significant \nrotation effect (F (2, 22) = 8.15, p < 0.01). The interaction between the two factors (F (2, 22) \n= 3.08, p = 0.07) approached significance, as differences in response latencies seemed to \nincrease for the disorientation of ±120° (paired t-tests: upright (278 ms), t (11) = 9.13, p < \n0.001; ±60° (247 ms), t (11) = 8.23, p < 0.001; ±120° (338 ms), t (11) =7.56 , p < 0.001). \nMain effect of disorientation was found for the gender decision (F (2, 11) = 12.25, p < 0.001) \nbut not for overt naming (F (2, 11) = 2.52; p=0.12). This difference arose mainly due to a lack \nof a RT delay for the ±120° condition in overt naming (paired t-test for ±60° vs. ±120°, t (11) \n< 1). In an across item analysis the effect of rotation on RTs was present for both overt (F \n(2,917) = 4.68; p < 0.01) and covert (F (2,972) = 4.82; p < 0.01) naming. Also, both overt and \n 9 \ncovert naming showed that the delay effect was linear when analyses across items were \nperformed (overt: F (1, 918) = 6.17, p < 0.05; covert: F (1, 973) = 8.98; p < 0.01). \n  Post hoc correlational analysis across participants (Pearson coefficient) was carried \nout to examine the relations between accuracy rates and RTs. Accuracy did not correlate with \nRTs for either overt (r = -0.14, r = -0.14, r = -0.25, for 0°, ±60° and ±120° respectively; n.s.) \nor covert naming (r = 0.38, r = 0.37, r = 0.43, for 0°, ±60° and ±120° respectively; n.s.). The \nabsence of correlations between accuracy and RTs indicates there was no speed-accuracy \ntrade-off in either task. \n In order to establish a relation between reaction times resulting from overt and covert \ntasks correlational analyses were carried out both across participants and across items. There \nwere no significant correlations for reaction times across participants between overt and \ncovert tasks (r = 0.24, r = 0.48, r = 0.20, for 0°, ±60° and ±120° respectively; n.s.). Partial \ncorrelation across items, controlling for subject pairs, showed a highly significant albeit small \ncorrelation (r = 0.23, p < 0.001).  \n \n2.2. Results of the EEG Experiment \n \n2.2.1. Behavioural data \n Mean accuracy rate was 85.7 ± 0.8 %. RTs were computed for correctly answered \ntrials between 400 and 2300 ms.  \nAs expected there were no significant RT differences between 60° and 300° or \nbetween 120° and 240° therefore they were averaged together to form two conditions (±60° \nand ±120° departures from upright) in all further analyses. The following recognition RTs \nwere found: 0°, 1162 ± 26 ms; ±60°, 1200 ± 29 ms; ±120°, 1243 ± 27 ms.  \n 10 \nRepeated measures ANOVA with the factor CONDITION (0°, ±60° and ±120°) \nrevealed a highly significant overall effect of rotation (F (2,17) = 17.97, p < 0.001). Post-hoc \npaired t-tests elucidated the effect was present between all three conditions. Participants \nresponded to ±120° rotated stimuli significantly slower than both upright (t (17) = -6.16, p < \n0.001) and ±60° rotated stimuli (t (17) = -2.82, p < 0.05). The ±60° rotated stimuli were also \nresponded to more slowly than the upright ones (t (17) = -3.19, p < 0.005).  \n  Post hoc correlational analysis across participants (Pearson coefficient) found that \naccuracy did not correlate with RTs (r = -0.01, r = -0.04, r = -0.13, for 0°, ±60° and ±120° \nrespectively; n.s.). The absence of correlations between accuracy and RTs indicates there was \nno speed-accuracy trade-off.  \n \n2.2.2. Event related potentials \nFigure 1 depicts the ERPs at anterior regional means as well as parietal and occipital \nregional means for all three conditions (see Figure 7 for regional means’ locations).  \n \n------------------------------- \ninsert Figure 1 about here \n------------------------------- \n \nTable 2 provides both the properties of the ERP components and their baseline \ncorrected mean amplitudes averaged across the respective time windows at the site of interest, \ntested with repeated measurement ANOVAs to compare across the three conditions (0°, ±60° \nand ±120°).   \n \n \n 11 \n------------------------------- \ninsert Table 2 about here \n------------------------------- \n \nAs Table 2 shows no significant amplitude modulations were found in any of the \ncomponents (N1, P300, and parietal negativity).  \n \n2.2.3. Induced and evoked spectral changes \nFigure 2 shows grand mean baseline-corrected time-by-frequency plots (TF-plots) \nacross 18 participants collapsed across all three experimental conditions. Evoked and induced \nGBA are depicted from a mean across all 128 electrodes.  \nTable 3 presents results for GBA peak amplitude and peak latency. \n \n------------------------------- \ninsert Table 3 about here \n------------------------------- \n \n------------------------------- \ninsert Figure 2 about here \n------------------------------- \n \nGamma-band amplitude evoked by picture presentations was enhanced (Figure 2a) at \noccipital sites (Figure 3a), conforming to previous findings (Busch et al., 2006; Herrmann et \nal., 1999; Martinovic et al., 2007; Tallon-Baudry et al., 1997). Evoked GBA between 50 and \n 12 \n150 ms in the 30-40 Hz range was not significantly modulated across conditions (see Table \n3). \nSpectral amplitude induced by picture presentations showed a clear peak in a time \nwindow from approx. 180 to 350 ms after stimulus onset in a frequency range between 35 and \n90 Hz (Figure 2b). \n \n------------------------------- \ninsert Figure 3 about here \n------------------------------- \n \nFor induced GBA individual frequencies with greatest amplitude ranged between 30 \nand 90 Hz (54.44 ± 2.87 Hz). Average frequencies of the highest amplitude wavelet were \n52.08 ± 3.22 Hz for 0°, 55.97 ± 4.06 Hz for ±60°, and 51.94 ± 3.21 Hz for ±120° condition. \nThere were no significant differences between frequencies at which highest induced GBA was \nobserved for each condition (F (2,17) = 0.53, n.s.) thus excluding the possibility that results \nwere biased by systematic frequency differences. In our peak-picking approach all three \nconditions were subsequently collapsed and the individual maximal wavelets (i.e., the centre \nof the ±5 Hz frequency bands) were selected from TF plots of a mean across conditions (as \ndescribed in the methods section).  \nTopographical distribution of induced gamma amplitude, computed for ± 5 Hz \nfrequency bands centred on the individual maximal wavelet in the time window of maximal \namplitude, collapsed across all three conditions is shown in Figure 3b. \nConforming to previous findings (Gruber et al., 2002; Gruber et al., 2004) induced \nGBA had a relatively broad scalp distribution, with a pronounced posterior activity, centred \nupon parietal sites and extending into the parieto-occipital sites.  \n 13 \nGrand-mean induced GBA, defined as the amplitude in the ±5 Hz frequency band \ncentred on the individual maximal wavelet in the time window 180 to 350 ms at the selected \nparietal sites after baseline subtraction, was significant when tested against zero revealing \ninduced gamma-band peaks were clearly present (0°, t (17) = 6.67; ±60°, t (17) = 4.88; ±120°, \nt (17) = 6.60; for all conditions, p < 0.001).  \n  As expected statistical comparisons of induced gamma-band amplitude showed no \nsignificant differences between conditions.  \nRepeated measures ANOVA with the factor CONDITION (0°, ±60° and ±120°) \nshowed a significant effect for peak latencies of induced GBA. As enumerated in Table 3 and \nalso in Figure 4 (means and latency distributions) and Figure 5 (time courses) peak latency \nwas delayed as a function of orientation.  Post-hoc t-tests revealed this was mostly due to a \nsignificant delay between 0° and ±120° (t (17) = -2.4, p < 0.05) and a strong delay trend \nbetween 0° and ±60° (t (17) = -2.0, p = 0.06). There was no difference between ±60° and \n±120° conditions (t (17) = -0.86, n.s.).  \n \n------------------------------- \ninsert Figure 4 about here \n------------------------------- \n \n Figure 5a shows the time-course of the grand-mean induced GBA in the 52.5-57.5 Hz \nrange (i.e., around the 55 Hz wavelet which was identified as the central frequency across all \nparticipants) whereas Figure 5b shows the time-course of activity in the ±5 Hz band around \nthe individual maximal wavelet for a representative participant. While averaging of data in \nFigure 5a has somewhat masked the observed latency delays, blending them into a more \n 14 \ngeneral shift in the distribution of amplitude, the time-course for the representative participant \nin Figure 5b demonstrates clear delay effects.   \nObserved latency delays in the induced GBA peak did not correlate with RT delays \nwhen Spearman’s coefficient correlations were calculated across participants (±60° delays, rs \n= -0.10, n.s.; ±120° delays, rs = -0.31, n.s.).  \n \n------------------------------- \ninsert Figure 5 about here \n------------------------------- \n \nStatistical parametric maps (SPMs; axial, sagittal and coronal slices) of the induced \nGBA peak for each condition are shown in Figure 6a while SPMs of differential activity \nbetween disoriented and upright conditions are depicted in Figure 6b.  \n \n------------------------------- \ninsert Figure 6 about here \n------------------------------- \n \nInduced GBA generators were widespread across source space with activity \ndistributed across bilateral prefrontal, temporal and posterior locations. Medial prefrontal \nactivity was particularly pronounced for disoriented objects, spreading into the inferior frontal \ngyrus. Table 4 provides Montreal Neuroscience Institute (MNI) coordinates of the \nsignificantly activated sources and also gives their brief anatomical descriptions. \n \n \n 15 \n------------------------------- \ninsert Table 4 about here \n------------------------------- \n \n3. Discussion \n \nThe study had three major aims: (1) replicate the findings of Martinovic et al. (2007) \nwith an improved plane-rotation paradigm; (2) assess the validity of the covert naming task in \nobtaining recognition-related RT delays; and (3) complement the findings on induced GBA \npeak latency delays through source localisation. Just as in the previous study a plane-rotation \nparadigm was used in order to elicit view-dependent processing of disoriented objects. A \ncovert naming task (gender decision) was used in order to measure the delays in recognition \nthat occur for disoriented objects. First, the task was successfully validated in a control \nexperiment. The EEG experiment replicated the induced GBA peak latency delays for \ndisoriented objects. Looking at the sources of neural activity allowed us to ascertain that \nadaptive changes in underlying neuronal generators lay behind the modulated distribution of \nthe induced GBA. Relative contribution of posterior, temporal and prefrontal sources differed \nbetween upright and disoriented objects: prefrontal activity became more prominent with \nincreased disorientation. These findings throw further light on the assumed role of induced \nGBA as EEG markers of cortical object representation.  \n In our previous study, an EEG-compatible paradigm aimed at accessing entry-level \nidentification, the level objects are recognised in everyday life, was tested. The study \ndemonstrated that covert naming tasks can be successfully used for that purpose. As a further \nimprovement, the present experiment controlled for basic differences between objects in \nnaming times by counterbalancing the assignment of stimuli to conditions across the sample. \n 16 \nSuch a procedure is preferable to fixing the assignment of stimuli to conditions as in \nMartinovic et al. (2007). Effects of plane-rotation on the recognisability of each image are \nnonlinear. Thus, one item might be easier to recognise at 300° than at 120° of rotation while \nfor another the opposite might be the case. Because of these item-specific effects of \norientation controlling for naming speeds at 0° is not fully adequate – even if the two objects \ntake the same amount of time to name when upright, differences in naming speed between \nthem can reappear once they become disoriented. For this reason stimulus counterbalancing \nacross the sample is often used in studies on view-dependent object identification (see, for \nexample Lawson and Jolicoeur, 2003; Murray, 1995c). \nThe second major change from our previous study concerned the task that was used to \nelicit the so-called covert naming. Instead of a phonological judgment on the identity of the \nfirst letter of the name a grammatical gender decision was used. This syntactic task is well \nsuited to the German language, which contains three genders: masculine, feminine and \nneutral. Grammatical gender is a lexical property of words and it is often used in implicit \nnaming paradigms that aim to examine the time course of syntactic processing (see Schmitt et \nal., 2001). It is mostly arbitrary but can also be influenced by semantic or phonological factors \n(Schiller et al., 2003) due to certain words having biological gender and other words being \ngender-marked by certain phonological regularities. While interactions between semantic and \nsyntactic factors occur at later processing stages, ERPs have shown that early streams are \nautonomous (Gunter et al., 2000).  \nTo further verify the degree of similarity between overt naming and the newly \nimplemented covert task, a control experiment was performed in which they were directly \ncontrasted. Accuracy rates between overt and covert tasks were comparable whereas gender \ndecision times (i.e. covert naming) were on average 200-300 ms longer, reflecting the \nadditional requirement of making a syntactic judgement on the object’s name. The effects of \n 17 \ndisorientation were smaller than in previous studies (e.g., Murray, 1995c) but consistent with \nMartinovic et al. (2007).  The results imply this cannot be due to the nature of the covert task \nas reduced delays were even more pronounced for overt naming. In fact, in overt naming the \ndelay between ±60° and ±120° was particularly reduced, as were the accuracies, which fell to \nabout 70% while in typical overt naming they usually stay near 100%. However, linear \nincreases with disorientation were identified for both overt and covert tasks, which fits with \nclassical findings on the linear type of disorientation delays in plane-rotation paradigms (e.g., \nJolicoeur, 1985; McMullen and Jolicoeur, 1990; Murray, 1995a). Smaller delays than those in \nprevious studies, as well as lower accuracy rates, should thus be attributed to large variability \nof the stimulus set. It included many objects with compound names such as seahorse, \nlawnmower and wheelchair as well as infrequent names such as easel and wheelbarrow; these \nitems are generally not used in overt naming behavioural studies which can rely on smaller \nstimulus sets than EEG.  \nHowever, in spite of these discrepancies between the two tasks, a highly significant \ncorrelation of RTs was found in an across item analysis. The fact that this correlation \nresurfaces across items but not across participants, who saw different images in different \nconditions, confirms the main assumption that overt and covert tasks access common \nrecognition processes. The tasks are likely to differ in their relative reliance on linguistic \nprocesses and response production mechanisms, which would explain that the correlation is \nsmall in spite of its high significance. Based on this, we conclude that the novel EEG-\ncompatible covert naming paradigm provides a very useful contribution to future \nneurophysiological studies on object recognition. It will allow future EEG studies to elicit the \nentry-level of object identification at which view-dependent processing can occur.  \nThe main hypothesis of the EEG experiment was also confirmed: peak latency of induced \nGBA was again related to recognition delays for disoriented objects, elicited by the plane-\n 18 \nrotation paradigm. The behavioural effects in our experiment were also more robust then \nthose in Martinovic et al. (2007). Significant RT delays were obtained between all three \nconditions (upright, ±60° and  ±120°). The peak latency of induced GBA at broad parieto-\noccipital sites was significantly delayed for ±120° rotated objects when compared to upright \nobjects, while a pronounced trend for delays was observed for ±60° rotated objects. This \nmodulation was again present selectively for induced GBA peak latency. No such effect was \nobserved in the ERPs or induced gamma amplitude and evoked gamma-band activity also \nremained unmodulated. \nLocalisation of generators of neuronal activity in source space indicated that a \nwidespread distributed set of bilateral prefrontal, temporal and posterior regions stood behind \nthe induced GBA. A previous study by Gruber et al. (2006) examined neuronal sources of \nobject categorisation at the superordinate level. At the superordinate level items are classified \nas an animal or a non-animal. At entry-level, which was elicited in this study, items are \nclassified as a tiger, bird, bear or light bulb, bottle or table. In their study, Gruber et al. (2006) \nfound that induced GBA was generated in left inferior temporal and lateral occipitotemporal \n(fusiform) gyri, bilateral superior and middle parietal and occipital areas and in right middle \nfrontal and precentral gyri. The observed generators for upright objects in the present study \nlargely overlapped with these areas, with the notable exception that bilateral middle frontal \nactivity was present for entry-level recognition. In fact these prefrontal areas were shown to \nplay an important role, enlarging their contribution to the induced GBA with increases in \ndisorientation. Meanwhile, temporal and posterior sources decreased their high frequency \noscillatory activity relative to prefrontal generators for disoriented items. Such adaptive \nchanges in coding fit very well with existing findings and proposed models of object \nidentification. Involvement of medial and inferior parts of prefrontal lobes, which play a \nsignificant role in memory encoding and retrieval (Cabeza and Nyberg, 2000; Nyberg et al., \n 19 \n2003) and semantic discrimination (Otten and Rugg, 2001). Their involvement supports \nprevious arguments that induced GBA is crucially related to late representational processes \nthat subserve visual memory (Gruber et al., 2004; Gruber and Müller, 2005; Martinovic et al., \n2007). Involved areas also lie in the vicinity of orbito-frontal cortex and our spatial resolution \nof approx. 11 mm combined with a localization error of approx. 14 mm (Trujillo-Barreto et \nal., 2004) cannot discount an overlap of activity. This is in general accordance with the model \nproposed by Bar (2003) which supposes that feedback into representational areas guides the \nselection between candidate templates that have resulted from bottom-up processing in \nposterior and temporal areas. Top-down feedback into the visual cortex has already been \nimplicated to play a role in successful encoding (Takashima et al., 2006) and recognition (Bar \net al., 2006) of visually presented objects. According to our findings it is therefore highly \nlikely that flexible changes in coding occurred between the generators of induced GBA. \nSources have been led to shift from more bottom-up representational processing to top-down \ndriven identification by increasing disorientation and it is possible to conclude that this shift is \nlikely to complement the observed latency delay in induced GBA. \nThis study, like Martinovic et al. (2007), failed to obtain correlations between RT \ndelays and induced GBA delays. It has been observed that performance correlated changes in \nobject representation occur in prefrontal cortex neurons but not in inferior temporal neurons \n(Rainer and Miller, 2000). Correlations between behavioural and neurophysiological \nmeasures of repetition priming have not been found in a study that measured the activity of IT \nneurons in monkey cortex (McMahon and Olson, 2007). These authors discuss that changes \nin the representational activity of IT neurons could result in enhanced post-synaptic efficacy \nand stronger firing in areas of frontal cortex that receive projections from IT cortex (also \nsupported by van Turennout et al., 2000). Indeed source localisation in this study indicated \nthat the crucial adaptive change occurred in the enhancement of activity within prefrontal \n 20 \nareas. As widespread sources are involved in the generation of induced GBA, it is possible \nthat the lack of correlation is due to the overlap of prefrontal, posterior and temporal neuronal \nactivity in the measured response. This is not purely a signal-to-noise issue. A possible \nsolution would lie in intracortical measuring of induced GBA’s latency as it moves through \ncortical areas along the ventral pathway, as in Lachaux et al.’s (2004) study. Due to their high \nsignal-to-noise ratio and area-specificity intracortical recordings have already succeeded in \nrevealing correlations between induced GBA latency and representational activity (e.g., see \nWomelsdorf et al., 2006).  \nIn summary, this study confirmed the relation first observed in Martinovic et al. \n(2007) wherein recognition time delays were accompanied by induced gamma-band latency \ndelays. A shift in the relative activity of induced GBA generators between upright and \ndisoriented objects accompanied the latency delay: with increased disorientation prefrontal \nactivity became more prominent. This is likely to indicate a shift from bottom-up to top-down \nprocessing, occurring because of additional template-matching requirements in successful \nrecognition and encoding of disoriented objects. This finding further strengthens the proposal \nthat induced GBA reflects the later stream of representational processing connected to visual \nmemory. It is now possible to assert that adaptive changes in dynamic coding of object \nidentity occur during recognition of disoriented objects. In this study induced GBA was again \nshown to be a marker that is selectively sensitive to these changes. This provides further \nevidence that induced high frequency oscillatory activity in the human brain forms a robust \nneural signature of representational activity in high-level vision. \n \n \n \n \n 21 \n4. Experimental Procedure \n \n4.1. Control Experiment  \n \n4.1.1. Participants \n12 healthy university students (7 female; aged 19 - 27 years, mean age = 23 years) \nreceived class credit or a small honorarium for participating in the study. Participants reported \nnormal or corrected-to-normal vision and all were native speakers of German. Individual \nwritten informed consent was obtained and the study conformed to the Code of Ethics of the \nWorld Medical Association. \n \n4.1.2. Materials and procedure \nThe stimulus set of 204 pictures and the practice set of 36 pictures were a result of a \nlimited pilot study conducted with a preliminary set of images in order to evaluate the \nsuitability of the selected stimuli and reassess their dominant names, focusing on their \ngrammatical gender. Images were selected from existing stimulus sets (International Picture \nNaming Project with German norms containing 525 pictures - Bates et al., 2003; 400 pictures \nfrom a French-language naming study - Alario and Ferrand, 1999; and 152 images used in \nobject recognition studies - Hamm, 1997). \nAll of the objects represented in the stimulus set had a predominant environmental \norientation which was labelled as 0° (i.e., upright). Disoriented pictures were created by \nrotating the upright picture by 60°, 120°, 240° and 300° in the frontal picture plane. The 180° \nrotation was not used as it produces RTs that are somewhat shorter than expected and very \nvariable (Lawson and Jolicoeur, 2003) due to different possible ways in which image \nnormalisation can be achieved; transformation as in other conditions or flipping-over in the \n 22 \nimage-plane. Stimulus presentation occurred in a random order and was different for each \nparticipant.  \nPresentation of stimulus images was counterbalanced across the sample so that every \nitem appeared in each of the three orientations (upright, ±60° and ±120°; with disoriented \nimages being equally distributed into 60°\/300° and 120°\/240° respectively) an equal number \nof times. Therefore stimulus presentation lists were generated in a balanced fashion for six \nparticipants at a time thus ensuring each image was assigned for presentation in an upright \n±60° (split evenly between 60° and 300°) and ±120° (split evenly between 120° and 240°) \nposition for two of the six participants. In addition stimulus lists were generated in a way that \nensured each object would be assigned to both tasks with equal frequency. This was done by \ninverting the assignment-to-task for the six counterbalanced stimulus lists thereby obtaining a \nset of lists for all of the planned 12 participants. Across the whole sample each picture was \npresented in each condition (upright, ±60° and ±120°) for a total of two times and if one \nparticipant named it covertly a matched participant would name it overtly (and vice versa). \nThis ensured that while all objects were represented in all conditions across the sample every \nparticipant saw just one version of the same object. As explained in the discussion, this is a \ncommon procedure (e.g., Murray, 1998) used to control for item-specific effects.  \nTask order was counterbalanced between participants so that one half started with \novert naming and the other half with gender decision. Overt naming was carried out in a \ntypical way with participants instructed to say the first name that came to mind upon seeing \nthe image of the object. Speech-onset latencies were measured from the onset of the target \npicture with a voice-key connected to a computer. The experimenter monitored whether \nparticipants used the expected target names and coded erroneous responses. \nThe covert naming task required participants to press one of three buttons, using \nindex, middle and ring fingers of one hand, depending on the grammatical gender of object’s \n 23 \nname, i.e. masculine, feminine or neutral. They were instructed to perform this syntactic \njudgment based on the definitive determiner (‘der’, ‘die’ or ‘das’)3 of the first correct name \nthat came to mind after seeing the picture. They indicated their response by pressing the \nbuttons corresponding to these determiners (‘1’, ‘2’ or ‘3’). Among the 204 objects presented \nthere were 68 for each of the three genders. Key-to-task allocation was not counterbalanced \nacross participants due to the over-learnt nature of gender label order, i.e., ‘der’ being first, \nfollowed by ‘die’ and ‘das’. Half way through the experiment participants were asked to \nchange the responding hand. \nBefore each of the two tasks, participants performed a practice block of 18 trials that \ncontained a subset of stimuli not used in the experiment itself. This was followed by two \nblocks of 51 trials for each task, each lasting approximately three minutes. Each trial \nconsisted of a 600 ms baseline period, during which a black fixation cross (0.3° x 0.3°) was \npresented. This was followed by a stimulus picture that was displayed for 650 ms; this was \nthen replaced by the fixation cross that remained on screen for a period of 1650 ms.  \nStimuli were presented centrally on a 19-inch flat screen monitor with a 120 Hz \nrefresh rate that was positioned 1m in front of the participant. Images of objects, subtending a \nvisual angle of approx. 5 x 5°, were all shown in black on a white background. Timing of the \npresentation of the stimuli and data collection were controlled by NESU (Nijmegen \nExperimental Setup). \n \n4.1.3. Data analysis \n \nTo match the parameters of the previous study (Martinovic et al., 2007) only correct \ntrials with RTs between 400 and 2300 ms were taken into analysis.  \n                                                 \n3\n These are German definite articles that precede a noun and mark its gender (masculine, feminine or neutral) in \nnominative case. \n 24 \nAccuracy rates were analysed across participants while RTs on correctly answered \ntrials were analysed both across participants and across items. For the overt naming task, \nobservations were coded as erroneous and discarded from the reaction time analysis whenever \na picture had not been named with the expected name, the voice-key was triggered by a non \nspeech sound, or the utterance was dysfluent. \nIn the across participant analysis median RTs were computed for each participant; \nusing medians is consistent with previous studies that employed plane-rotation paradigms \n(e.g., Jolicoeur et al., 1998) due to the skewness of RT distributions. We then computed \nmeans across participants to obtain a measure of central tendency known as a mean of median \nRT (for a similar procedure, see Murray, 1995b). In the across item analysis overall medians \nas well as means and their standard errors were computed. \nAcross participants, 2x3 repeated measures ANOVA with the factors of naming type \n(overt or covert) and degree of rotation (upright, ±60° and ±120°) was performed on accuracy \nrates and RTs. Repeated measure ANOVAs were subsequently performed within every \nnaming task separately to ascertain the exact effects of disorientation in each. Across items, \none-way ANOVA with the factor of condition (upright, ±60° and ±120°) was performed \nwithin every naming task. \nCorrelations of accuracies and RTs within every naming task were performed in order \nto check for possible speed-accuracy trade-offs. Correlations of RTs between the two tasks \nwere performed both across participants and across items in order to establish the relation \nbetween the two tasks. \nGreenhouse-Geisser correction for multiple comparisons was used when necessary. \nPost-hoc analyses were carried out using paired t-tests.  \n \n \n 25 \n4.2. EEG Experiment \n \n4.2.1. Participants \n24 healthy, right-handed university students received class credit or a small \nhonorarium for participating in the study. Six participants had to be removed; three because of \ntechnical problems during the recording, one due to excessive EEG artifacts and two due to \nthe absence of GBA. The final sample therefore consisted of 18 participants (10 female; aged \n19 - 34 years, mean age = 24 years) who reported normal or corrected-to-normal vision and \nwere all native speakers of German. None of them had participated in picture recognition \nstudies in the previous six months. Individual written informed consent was obtained and the \nstudy conformed to the Code of Ethics of the World Medical Association. \n \n4.2.2. Materials and procedure \nThe stimulus set of 204 pictures and the practice set of 36 pictures from the control \nexperiment were used. As described stimuli were counterbalanced across the sample so that \nevery image appeared in each of the three orientations (upright, ±60° and ±120° - with \ndisoriented images being equally distributed into 60°\/300° and 120°\/240°) an equal number of \ntimes across the sample.  For example, one participant would see a picture of a certain object \nin its upright position, another one in the 60° disoriented position, a third one in 120°, and so \nforth. In addition, to avoid previously reported repetition suppression effects in the induced \nGBA (Fiebach et al., 2005; Gruber et al., 2002; Gruber et al., 2004) a different object was \ndepicted in every experimental trial. To summarise, only a single image of a particular \nstimulus object was shown to each of the participants during the experiment. However, across \nall the participants, each object was shown equally often in each of the three conditions \n 26 \n(upright, ±60° and ±120°). Stimulus presentation occurred in a random order and was \ndifferent for each participant. \nParticipants performed the same grammatical gender judgment as in the control \nexperiment. They were instructed to minimise eye movements and blinking during the display \nof a stimulus or the fixation cross. Feedback was not provided after each individual trial but at \nthe end of each block. Two measures, average percent correct and average RT, were \ncomputed on the basis of all the trials in that block and were shown to the participants. If their \nperformance fell below the levels expected based on the control experiment they were \nencouraged to try and respond faster or more accurately. \nParticipants first performed a practice block of 36 trials that contained a subset of \nstimuli not used in the experimental trials. The experiment consisted of four 51 trial blocks \neach lasting approximately three and a half minutes. Each trial consisted of a variable 500-\n700 ms baseline period during which a black fixation cross (0.3° x 0.3°) was presented. \nFollowing this a stimulus picture was displayed for 650 ms which was subsequently replaced \nby the fixation cross that remained on the screen for a period of 1650 ms.  \nStimuli were presented centrally on a 19-inch computer screen with a 70 Hz refresh \nrate that was positioned 1.5 meters in front of the participant in a dimly lit soundproof testing \nchamber. Images of objects, subtending a visual angle of approx. 4.5 x 4.5°, were all shown in \nblack on a white background. Stimulus onset was synchronised to the vertical retrace of the \nmonitor.  \n \n4.2.3. EEG recording    \nEEG was recorded continuously from 128 locations using active Ag-AgCl electrodes \n(BioSemi Active-Two amplifier system; Biosemi, Amsterdam, The Netherlands) placed in an \nelastic cap. In this system the typically-used ‘ground’ electrodes in other EEG amplifiers are \n 27 \nreplaced through the use of two additional active electrodes, positioned in close proximity to \nthe electrode Cz of the international 10-20 system (Jasper, 1958): Common Mode Sense \n(CMS) acts as a recording reference and Driven Right Leg (DRL) serves as ground (Metting \nVan Rijn et al., 1990; Metting Van Rijn et al., 1991). Horizontal and vertical \nelectrooculograms were recorded in order to exclude trials with blinks and significant eye \nmovements. \nEEG signal was sampled at a rate of 512 Hz and was segmented into epochs starting \n500 ms prior and lasting 1500 ms following picture onset. EEG data processing was \nperformed using the EEGlab toolbox (Delorme and Makeig, 2004) combined with in-house \nprocedures running under the Matlab (The Mathworks, Inc) environment. Artifact correction \nwas performed by means of ‘statistical correction of artefacts in dense array studies’ \n(SCADS; Junghöfer et al., 2000). It is widely accepted in the field and has been applied and \ndescribed in several publications (Gruber et al., 1999; Martinovic et al., 2007; Müller and \nKeil, 2004).  \nAll incorrectly answered trials were excluded prior to data analysis. The average \nrejection rate was 25.1 %, resulting in approx. 43 remaining trials per condition. Further \nanalyses were performed using the average reference.  \n \n4.2.4. Behavioural data analysis \nRTs between 400 and 2300 ms, the maximum time allowed for responses, for trials \nwith correct responses were taken into further analysis.  \nAs in the control experiment median RTs for correct items were computed for each \nparticipant. Means across participants were then computed to obtain a measure of central \ntendency known as a mean of median RT. Differences in mean of median RTs for each \nparticipant were calculated by subtracting the average upright naming time from RT for 60° \n 28 \nand 120°. Therefore for each participant two delay scores were computed: RT delay for 60° \nand for 120° conditions.  \nDifferences in naming speed between the three conditions were analysed with a \nrepeated measures ANOVA comprising the factor of CONDITION (upright, ±60° and \n±120°). Post-hoc tests were performed using paired t-tests. \n \n4.2.5. Event related potentials (ERPs) analysis \nA 25 Hz low-pass filter was applied to the data before all ERP analyses. Identical to \nour previous study, three ERP components were assessed; N1, P300 and parietal negativity. \nTable 2 (see Results) lists the analysis windows and electrode sites taken into the regional \nmean for each component (also shown in Figure 7). Mean amplitude within the  \n \n------------------------------- \ninsert Figure 7 about here \n------------------------------- \n \nrespective time window was calculated for each component and the mean amplitude during \nthe period 100 ms prior to stimulus onset (baseline) was subtracted. Each component was \nsubject to repeated measures ANOVA comprising the factor of CONDITION (upright, ±60° \nand ±120°). Post-hoc tests were performed using paired t-tests. \n \n4.2.6. Analysis of Evoked and Induced Spectral Changes  \nInduced oscillatory activity was analysed according to the standard procedure \nemployed in many previous studies (e.g., Gruber et al., 2004; Gruber and Müller, 2005; \nMartinovic et al., 2007). In brief, spectral changes in oscillatory activity were analysed by \n 29 \nmeans of Morlet wavelet analysis (Bertrand and Pantev, 1994), which offers a good \ncompromise between time and frequency resolution (Tallon-Baudry and Bertrand, 1999). This \nmethod provides a time-varying magnitude of the signal in each frequency band leading to a \ntime-by-frequency (TF) representation of the signal and, together with suggested parameter \ndefinitions that allow for a good time and frequency resolution in the gamma frequency range, \nis detailed in previous studies (e.g., Gruber and Müller, 2005). In order to achieve good time \nand frequency resolution in the gamma frequency range, the wavelet family in this study was \ndefined by a constant m= f0\/σf = 7, with f0 ranging from 2.5 to 100 Hz in 0.5 Hz steps. This \ndata was subsequently reduced to form 2.5 Hz-wide wavelets. Time-varying energy in a given \nfrequency band was calculated for each epoch by taking the absolute value of the convolution \nof the signal with the wavelet. \nPreliminary electrode sites used for time-by-frequency plots were selected on the basis \nof previous findings of maximal local gamma power elicited by object identification \nparadigms; parietal for induced GBA (Gruber et al., 2004; Gruber and Müller, 2005; \nMartinovic et al., 2007) and occipital for evoked GBA (Busch et al., 2006; Herrmann et al., \n1999; Martinovic et al., 2007; Tallon-Baudry et al., 1997). These sites were further readjusted \nin order to envelop the area of maximal amplitude for data collapsed across conditions in case \nthe observed grand mean topography happened to differ from previous findings. Maps of \noscillatory responses in the ±5 Hz frequency band centred upon the maximal activity wavelet \nfor each participant during the time window of maximal activity were calculated by means of \nspherical spline interpolations (Perrin et al., 1988). \nIn order to identify the time window and frequency range of the induced GBA peaks \nmean baseline-corrected spectral amplitude (baseline: 100 ms prior to stimulus onset) was \ncollapsed together for all conditions and represented in TF-plots in the 30-90 Hz range. The \nlength of the time window of maximal gamma-band amplitude was defined based on the \n 30 \nobserved grand-mean GBA, a common approach in previous studies (e.g., Busch et al., 2004; \nGruber and Müller, 2005).  \nRegional means of interest were determined on the basis of grand mean topographies. \nDue to inter-individual differences in the induced gamma peak in the frequency domain a \nspecific wavelet for each participant was chosen based on the frequency of his\/her maximal \namplitude in an average across all three conditions. Centred upon this wavelet a frequency \nband of ±5 Hz was subsequently formed for the purpose of statistical analyses.  \nFrequencies of individual maximal wavelets were also identified for each separate \ncondition on TF-plots of mean baseline-corrected spectral amplitudes.  This was done only in \norder to verify that the selected maximal wavelets (i.e., the centre of the ±5 Hz frequency \nbands) represented all three conditions equally. Consistent with our previous study, no \ndifferences were expected between the conditions in the frequencies of maximal amplitude.  \n The peak latency of GBA was defined as the latency of maximal amplitude within the \n± 5 Hz frequency band centred upon the individual maximal wavelet (see Martinovic et al., \n2007; Posada et al., 2003; Tallon-Baudry et al., 1996). The basis of such a definition relies on \ncomputation methods that define the time-resolution of the Morlet wavelet analysis. When \nwavelet convolutions are computed the convolution peaks at the same latency as the \nrespective frequency component in the raw data, smearing the peak width due to responses \nbeing quite jittered between trials; sometimes up to 80ms or more. In other words, a gamma \nband peak will maintain its latency throughout the range of frequencies involved but its \noverall amplitude will end up being somewhat smeared across the sample. Therefore our \npeak-picking approach maintains the highest level of objectivity when comparing latency \nacross different conditions. \n For induced GBA, differences between conditions in the central frequencies of \ngamma-band activity at the regional mean, the amplitude of the gamma peak after baseline \n 31 \nsubtraction and the latency of its maximal local amplitude were evaluated by means of \nrepeated measures ANOVA with the factor CONDITION (upright, ±60° and ±120° rotation).  \nTo enable us to relate the delays in induced GBA with delays in naming RTs, peak \nlatency delays were computed to correspond with RT delays (described in behavioural \nmethods). The peak latency for upright was subtracted from peak latencies for both ±60° and \n±120° thus obtaining measures of induced GBA peak latency delays. In order to see if the \nrelations between these two measures were indirect or direct, induced GBRs latency delays \nand RT delays were correlated using Spearman’s coefficient.  \nEvoked oscillatory activity is by definition time- and phase-locked to stimulus onset \nand was analysed through a transformation of the unfiltered ERP into the frequency domain. \nEvoked GBA has low inter-individual variability and in object categorisation studies that use \nline-drawings it is usually observed at frequencies between 30 and 40 Hz, with maximal \nactivity usually occurring in a narrow time interval around 50-150 ms post stimulus-onset \n(e.g., Gruber et al., 2004; Gruber and Müller, 2005; Martinovic et al., 2007). Therefore a ±5 \nHz range was taken around a central wavelet of 35 Hz within a time window of 50-150 ms. \nFor evoked GBA, differences between conditions at the regional mean sites (see Figure 3, \nResults), the amplitude after baseline subtraction and the latency of its maximal local \namplitude were analysed by means of a repeated measurement ANOVA with the factor \nCONDITION (upright, ±60° and ±120°). \nMeans and standard errors of the mean are reported throughout the results section. All \npost-hoc tests were conducted using paired t-tests. \n4.2.7. Source modelling (VARETA) \nTo reconstruct the estimated sources of the observed effects in the time and frequency \ndomain an adaptation of VARETA (Variable Resolution Electromagnetic Tomography) was \nused. A detailed description of this approach can be found elsewhere (Bosch-Bayard et al., \n 32 \n2004; Gruber et al., 2006; Trujillo-Barreto et al., 2004). In brief, VARETA estimates the \nspatially smoothest generator-estimates compatible with the observed scalp topographies and \nplaces anatomical constraints upon the allowable solutions. The generators of the EEG data \ninside the brain are mapped by using a three dimensional (3D) grid of points (or voxels) that \nrepresent possible sources of the signal and for which the probability for grey matter is \ndifferent from zero (based on the average probabilistic brain atlas produced by the Montreal \nNeurological Institute; Evans et al., 1993).  \nTo uncover the sources of induced GBA peaks single trials were first transformed into \nthe frequency domain. Subsequently, single trial estimates of the primary current densities in \nsource space (i.e. at the predefined 3D grid locations) are computed during the time window \nof maximal activity for the ±5 Hz bands around the individually selected gamma peak \nwavelets (see gamma-band analysis methods, above). Single trial activity was previously \nscaled by a global scale factor (GSF; Hernandez et al., 1995) which takes into account \ncomplex wavelet coefficient for the full range of gamma-band frequencies during the baseline \nperiod (for a full formula and explanation, see Gruber et al., 2006.) The spectrum of the \ninverse solution for each trial and in each voxel was then calculated and averaged across the \ntime window of interest.  \n Sources of activation were analysed for each individual condition. In order to localise \nthe differences in activation between the conditions the primary current densities related to \ncondition ‘upright’ were subtracted from condition ‘±60°’ and condition ‘±120°’. Statistical \ncomparisons were then carried out by means of a voxel by voxel Hottelling T2 test against \nzero.  \nActivation threshold correction to account for spatial dependencies between voxels \nwas calculated by means of Random Field Theory (Worsley et al., 1996). The statistical \n 33 \nparametric maps (SPMs) were then projected onto coronal, axial and sagittal planes and were \nthresholded at a significance level of p<0.01. \n \nAcknowledgements  \nWe would like to thank Renate Zahn, Martin Cziuppa and Sophie Trauer for help with \ndata acquisition and Søren Andersen for technical assistance. We would also like to thank \nAnthony Martyr for proofreading the manuscript. The Deutsche Forschungsgemeinschaft \nsupported this research. J.M. was supported by the Deutscher Akademischer Austausch \nDienst (DAAD). \n \nReferences \n \nAlario, F. X., Ferrand, L., 1999. A set of 400 pictures standardized for French: Norms for \nname agreement, image agreement, familiarity, visual complexity, image variability, \nand age of acquisition. Behav. Res. Methods. 31, 531-552. \nBar, M., 2003. A cortical mechanism for triggering top-down facilitation in visual object \nrecognition. J. Cogn. Neurosci. 15, 600–609. \nBar, M., Kassam, K. S., Ghuman, A. S., Boshyan, J., Schmid, A. M., Dale, A. M., \nHämäläinen, M. S., Marinkovic, K., Schacter, D. L., Rosen, B. R., Halgren, E., 2006. \nTop-down facilitation of visual recognition. Proc. Natl. Acad. Sci. U. S. A. 103, 449-\n454. \nBates, E., D'Amico, S., Jacobsen, T., Szekely, A., Andonova, E., Devescovi, A., Herron, D., \nLu, C. C., Pechmann, T., Pleh, C., Wicha, N., Federmeier, K., Gerdjikova, I., \nGutierrez, G., Hung, D., Hsu, J., Iyer, G., Kohnert, K., Mehotcheva, T., Orozco-\nFigueroa, A., Tzeng, A., Tzeng, O., 2003. Timed picture naming in seven languages. \nPsychonomic Bulletin & Review. 10, 344-380. \nBertrand, O., Pantev, C., Stimulus frequency dependence of the transient oscillatory auditory \nevoked response (40 Hz) studied by electric and magnetic recordings in human. In: C. \nPantev, T. Elbert, B. Lütkenhöner, Eds., Oscillatory Event-Related Brain Dynamics. \nNATO ASI Series, vol. Plenum Press, New York, USA, 1994, pp. 231-242. \nBosch-Bayard, J., Valdés-Sosa, P., Virués-Alba, E., Aubert-Vázquez, E., John, R., Harmony, \nT., Riera-Díaz, J., Trujillo-Barreto, N., 2004. 3D statistical parametric mapping of \nvariable resolution electromagnetic tomography (VARETA). Clin Electroencephalogr. \n32, 47-66. \nBusch, N. A., Debener, S., Kranczioch, C., Engel, A. K., Herrmann, C. S., 2004. Size matters: \neffects of stimulus size, duration and eccentricity on the visual gamma-band response. \nClin. Neurophysiol. 115, 1810-1820. \n 34 \nBusch, N. A., Herrmann, C. S., Müller, M. M., Lenz, D., Gruber, T., 2006. A cross-lab study \nof event-related gamma activity in a standard object-recognition paradigm. \nNeuroimage. 33, 1169-1177. \nCabeza, R., Nyberg, L., 2000. Imaging cognition II: An empirical review of 275 PET and \nfMRI studies. J. Cogn. Neurosci. 12, 1-47. \nDelorme, A., Makeig, S., 2004. EEGLAB: an open source toolbox for analysis of single-trial \nEEG dynamics including independent component analysis. . J. Neurosci. Methods. \n134, 9-21. \nDux, P. E., Harris, I. M., 2007. Viewpoint costs occur during consolidation: Evidence from \nthe attentional blink. Cognition. 104, 47-58. \nEvans, A. C., Collins, D. L., Mills, S. R., Brown, E. D., Kelly, R. L., Peters, T. M., 1993. 3D \nstatistical neuroanatomical models from 305 MRI volumes, vol. 95. M.T.P Press, \nLondon. \nFiebach, C. J., Gruber, T., Supp, G. G., 2005. Neuronal mechanisms of repetition priming in \noccipitotemporal cortex: spatiotemporal evidence from functional magnetic resonance \nimaging and electroencephalography. J. Neurosci. 25, 3414-3422. \nGruber, T., Keil, A., Müller, M. M., 2002. Modulation of human induced gamma band \nresponse in a perceptual learning task. J. Cogn. Neurosci. 14. \nGruber, T., Malinowski, P., Müller, M. M., 2004. Modulation of oscillatory brain activity and \nevoked potentials in a repetition priming task in the human EEG. Eur. J. Neurosci. 19, \n1073-1082. \nGruber, T., Müller, M. M., 2005. Oscillatory brain activity dissociates between associative \nstimulus content in a repetition priming task in the human EEG. Cereb. Cortex. 15, \n109—116. \nGruber, T., Müller, M. M., Keil, A., Elbert, T., 1999. Selective visual-spatial attention alters \ninduced gamma band responses in the human EEG. Clin. Neurophysiol. 110, 2074-\n2085. \nGruber, T., Trujillo-Barreto, J. N., Giabbiconi, C. M., Valdes-Sosa, P. A., Müller, M. M., \n2006. Brain electrical tomography (BET) analysis of induced gamma band responses \nduring a simple object recognition task. Neuroimage. 29, 888-900. \nGunter, T. C., Friederici, A. D., Schriefers, H., 2000. Syntactic gender and semantic \nexpectancy: ERPs reveal early autonomy and late interaction. J. Cogn. Neurosci. 12, \n556-568. \nHamm, J. P., Object orientation and levels of identity. Vol. PhD Thesis. Dalhousie University, \nHalifax, 1997. \nHarris, I. M., Dux, P. E., 2005. Tuning objects on their heads: The influence of the stored axis \non object individuation. Percept. Psychophys. 67, 1010-1015. \nHernandez, J. L., Valdes, P., Biscay, R., Virues, T., Szava, S., Bosch, J., Riquenes, A., Clark, \nI., 1995. A global scale factor in brain topography. Int. J. Neurosci. 76, 267-278. \nHerrmann, C. S., Mecklinger, A., Pfeifer, E., 1999. Gamma responses and ERPs in a visual \nclassification task. Clin. Neurophysiol. 110, 636-642. \nJasper, H., 1958. The ten-twenty electrode system of the International Federation. \nElectroencephalogr. Clin. Neurophysiol. 10, 371-375. \nJolicoeur, P., 1985. The time to name disoriented natural objects. Mem. Cognit. 13, 289-303. \nJolicoeur, P., Corballis, M. C., Lawson, R., 1998. The influence of perceived rotary motion on \nthe recognition of rotated objects. Psychonomic Bulletin & Review. 5, 140-146. \nJunghöfer, M., Elbert, T., Tucker, D. M., Braun, C., 2000. Statistical control of artifacts in \ndense array EEG\/MEG studies. Psychophysiology. 37, 523-532. \nKaiser, J., Buhler, M., Lutzenberger, W., 2004. Magnetoencephalographic gamma-band \nresponses to illusory triangles in humans. Neuroimage. 23, 551-560. \n 35 \nKarakas, S., Basar, E., 1998. Early gamma response is sensory in origin: a conclusion based \non cross-comparison of results from multiple experimental paradigms. Int. J. \nPsychophysiol. 31, 13-31. \nLachaux, J.-P., George, N., Tallon-Baudry, C., Martinerie, J., Hugueville, L., Minotti, L., \nKahane, P., Renault, B., 2005. The many faces of the gamma band response to \ncomplex visual stimuli. Neuroimage. 25, 491-501. \nLawson, R., Jolicoeur, P., 2003. Recognition thresholds for plane-rotated pictures of familiar \nobjects. Acta Psychol. (Amst.). 112, 17–41. \nMartinovic, J., Gruber, T., Müller, M. M., 2007. Induced gamma-band responses predict \nrecognition delays during object identification. J. Cogn. Neurosci. 19, pp.1-14. \nMcMahon, D. B. T., Olson, C. R., 2007. Repetition supression in monkey inferotemporal \ncortex: relation to behavioral priming. J. Neurophysiol. 97, 3532-3543. \nMcMullen, P. A., Jolicoeur, P., 1990. The spatial frame of reference in object naming and \ndiscrimination of left-right reflections. Mem. Cognit. 18, 99-115. \nMetting Van Rijn, A. C., Peper, A., Grimbergen, C. A., 1990. High quality recording of \nbioelectric events: I: interference reduction, theory and practice. Med. Biol. Eng. \nComput. 28, 389-397. \nMetting Van Rijn, A. C., Peper, A., Grimbergen, C. A., 1991. High quality recording of \nbioelectric events. II: a low noise low-power multichannel amplifier design. Med. \nBiol. Eng. Comput. 29. \nMüller, M. M., Keil, A., 2004. Neuronal synchronization and selective color processing in the \nhuman brain. J. Cogn. Neurosci. 16, 503-522. \nMurray, J. E., 1995a. Imagining and naming rotated natural objects. Psychonomic Bulletin & \nReview. 2, 239-243. \nMurray, J. E., 1995b. Negative priming by rotated objects. Psychonomic Bulletin & Review. \n2, 534-537. \nMurray, J. E., 1995c. The role of attention in the shift from orientation-dependent to \norientation-invariant identification of disoriented objects. Mem. Cognit. 23, 49–58. \nMurray, J. E., 1998. Is entry-level recognition viewpoint invariant or viewpoint dependent? \nPsychonomic Bulletin & Review. 5, 300-304. \nNyberg, L., Marklund, P., Persson, J., Cabeza, R., Forkstam, C., Petersson, K. M., Ingvar, M., \n2003. Common prefrontal activations during working memory, episodic memory, and \nsemantic memory. Neuropsychologia. 41, 371-377. \nOtten, L. J., Rugg, M. D., 2001. Task-dependency of the neural correlates of episodic \nencoding as measured by fMRI. Cereb. Cortex. 11, 1150-1160. \nOtten, L. J., Rugg, M. D., Interpreting event-related brain potentials. In: T. C. Handy, Ed., \nEvent-related potentials: a methods handbook.  vol. The MIT Press, Cambridge, \nMassachusetts, 2005, pp. 3-16. \nPerrin, F., Pernier, J., Bertrand, O., Echallier, J. F., 1988. Spherical splines for scalp potential \nand current source density mapping. Electroencephalogr. Clin. Neurophysiol. 72, 184-\n187. \nPosada, A., Hugues, E., Franck, N., Vianin, P., Kilner, J., 2003. Augmentation of induced \nvisual gamma activity by increased task complexity. Eur. J. Neurosci. 18, 2351-2356. \nRainer, G., Miller, E. K., 2000. Effects of visual experience on the representation of objects in \nthe prefrontal cortex. Neuron. 27, 179-189. \nSchiller, N. O., Münte, T. F., Horemans, I., Jansma, B. M., 2003. The influence of semantic \nand phonological factors on syntactic decisions: An event-related brain potential \nstudy. Psychophysiology. 40, 869-877. \n 36 \nSchmitt, B. M., Rodriguez-Fornells, A., Kutas, M., Münte, T. F., 2001. Electrophysiological \nestimates of semantic and syntactic information access during tacit picture naming and \nlistening to words. Neurosci. Res. 41, 293-298. \nSinger, W., Gray, C. M., 1995. Visual feature integration and the temporal correlation \nhypothesis. Annu. Rev. Neurosci. 18, 555-586. \nTakashima, A., Jensen, O., Oostenveld, R., Maris, E., van de Coevering, M., Fernandez, G., \n2006. Successful declarative memory formation is associated with ongoing activity \nduring encoding in a distributed neocortical network related to working memory: A \nmagnetoencephalography study. Neuroscience. 139, 291-297. \nTallon-Baudry, C., Bertrand, O., 1999. Oscillatory gamma activity in humans and its role in \nobject representation. TICS. 3, 151-162. \nTallon-Baudry, C., Bertrand, O., Delpuech, C., Pernier, J., 1996. Stimulus specifity of phase-\nlocked and non-phase-locked 40 Hz visual response in human. Eur. J. Neurosci. 16, \n4240-4249. \nTallon-Baudry, C., Bertrand, O., Delpuech, C., Pernier, J., 1997. Oscillatory gamma-band \n(30-70 Hz) activity induced by a visual search task in human. J. Neurosci. 17, 722-\n734. \nTallon-Baudry, C., Bertrand, O., Henaff, M.-A., Isnard, J., Fischer, C., 2005. Attention \nmodulates gamma-band oscillations differently in the human lateral occipital cortex \nand fusiform gyrus. Cereb. Cortex. 15, 654-662. \nTrujillo-Barreto, N. J., Aubert-Vazquez, E., Valdés-Sosa, P. A., 2004. Bayesian Model \nAveraging in EEG\/MEG imaging. NeuroImage. 21, 1300-1319. \nvan Turennout, M., Ellmore, T., Martin, A., 2000. Long-lasting cortical plasticity in the object \nnaming system. Nat. Neurosci. 3, 1329-1334. \nVarela, F., Lachaux, J. P., Rodriguez, E., Martinerie, J., 2001. The brainweb: Phase \nsynchronization and large-scale integration. Nat. Rev. Neurosci. 2, 229-239. \nWillems, B., Wagemans, J., 2001. Matching multicomponent objects from different \nviewpoints: Mental rotation as normalization? J. Exp. Psychol. Hum. Percept. \nPerform. 27, 1090-1115. \nWomelsdorf, T., Fries, P., Mitra, P. P., Desimone, R., 2006. Gamma-band synchronization in \nvisual cortex predicts speed of change detection. Nature. 439, 733-736. \nWorsley, K. J., Marrett, S., Neelin, P., Evans, A. C., 1996. Searching scale space for \nactivation in PET images. Hum Brain Mapp. 4, 74-90. \n \n \n 37 \nLegends to Figures: \n \nFigure 1. Grand mean baseline corrected ERPs for 0° (black line), 60° (dotted line) and 120° \n(magenta line) at three regional means: a) anterior, b) occipital  and c) parietal, showing the \nN1 anterior\/posterior, P300 and parietal negativity components. Note: different voltage scales.  \nFigure 2. Grand mean baseline-corrected TF-plots averaged across all three experimental \nconditions and all electrodes. a) Evoked GBA; b) Induced GBA. Black boxes indicate the \ntime-window of interest (Note: different  scales). \nFigure 3. Grand mean 3D spherical spline amplitude-maps for evoked (a) and induced (b) \ngamma-band activity, based on the ±5Hz frequency band centred on the wavelet with \nmaximal activity during the time-window of interest. \nFigure 4. Latencies of induced GBA for 0°, ±60° and ±120° conditions. a) Bar Plot of peak \nlatencies’ means, with +1 SE bars. b) Box plot of peak latencies’ distributions; midlines \nindicating medians, ends of boxes indicating 25th and 75th percentiles, ends of lines \nindicating 10th and 90th percentiles and dots indicating observations falling in the outlying 10 \npercentiles. \nFigure 5. Time-course of induced GBA (parieto-occipital regional mean) with the time \nwindow for peak analyses indicated by a grey rectangle. a) Grand mean across participants \naround the central gamma-band wavelet (52.5-57.5 Hz). b) Individual maximal-wavelet \nactivity in the ±5 Hz range around the maximal wavelet for a typical participant (50-60 Hz) \n(note: different voltage scales). \n Figure 6. Source localisation of induced GBA : a) significantly activated areas for upright, \n±60° and ±120° conditions; b) areas that showed significant differences in levels of activity \nbetween upright and disoriented conditions (subtractions: ±60° and upright; ±120° and \nupright). Colourbars reflect above threshold T\n2\n values (p < 0.01) (note: different T\n2\n values \nacross conditions). \nFigure 7. Schematic representation of the 128-channel montage. Anterior, parietal and \noccipital regional means clusters as used for statistical analysis of ERP data are depicted, with \nindications of extended 10-20 sites approximated to the closest position on the electrode cap. \n \n \n \n 38 \nFigure 1 \n \n \n 39 \nFigure 2 \n \n 40 \nFigure 3 \n \n \n 41 \nFigure 4 \n \n 42 \nFigure 5 \n \n 43 \nFigure 6 \n \n 44 \nFigure 7 \n \n 45 \nTable 1. Control experiment: accuracy rates and reaction times (mean medians and SEs \nacross subjects in ms) across subjects for overt naming and gender decision tasks (n=12) \n Orientation \n 0° ± 60° ± 120° \n RT % correct RT % correct RT % correct \nOvert \nnaming \n886 \n(21) \n77.0 \n(2.0) \n947 \n(25) \n78.2 \n(3.0) \n946 \n(31) \n70.8 \n(4.2) \nGender \ndecision \n1164 \n(28) \n82.7 \n(2.8) \n1202 \n(34) \n77.5 \n(3.2) \n1284 \n(39) \n75.1 \n(4.5) \n \n \n 46 \nTable 2.  ERPs: definitions of components with mean baseline corrected amplitudes and F-\nvalues for all three conditions (n=18) \n \nComponent Site \n \nTime \nwindow \n(ms) \nμV  (Mean ± SE) F-value \n(p-value) 0° 60° 120° \nN1 anterior Anterior 145-195 -0.13 ± 0.37 -0.16 ± 0.41 -0.41 ± 0.38 2.28 (0.12) \nN1 posterior Occipital  145-195 0.23 ± 0.58 0.24 ± 0.57 0.57 ± 0.59 1.66 (0.20) \nP300 Parietal  280-400 3.89 ± 0.59 3.82 ± 0.47 4.14 ± 0.53 1.13 (0.33) \nParietal \nnegativity \nParietal  \n \n400-500 3.64 ± 0.50 3.52 ± 0.45 3.88 ± 0.57 1.20 (0.31) \n 47 \nTable 3. GBA: mean peak amplitudes and latencies with standard errors and F-values  \n \n  Condition F-value  \n(2,17) 0° ±60° ±120° \nInduced GBA Mean peak \namplitude [μV] \n0.07 ± 0.01 0.07 ± 0.02 0.08 ± 0.01 0.76, n.s.  \nMean peak \nlatency [ms] \n248 ± 10  266 ± 8 276 ± 8 3.48, \np<0.05 \nEvoked GBA Mean peak \namplitude [μV] \n0.14 ± 0.04  0.13 ± 0.03  0.15 ± 0.04 0.12, n.s. \nMean peak \nlatency [ms] \n106 ± 5  100 ± 5  106 ± 6  0.38, n.s. \n \n \n \n \n \n \n \n \n \n \n \n \n \n 48 \nTable 4. Induced GBA: Montreal Neuroscience Institute coordinates of all significantly \nactivated sources (X, Y, Z; in order of decreasing magnitude) and a brief anatomical \ndescription of relevant brain areas. \n   \nx, y, z \n \nAnatomical description \nConditions upright -50 -62 -10 \n-18 -91 -10 \n51 -62 -10 \n-25 62 12 \n23 62 12 \nlateral occipitotemporal gyrus left  \nlingual gyrus left  \ninferior temporal gyrus right  \nmiddle frontal gytrus left  \nmiddle frontal gyrus right  \n±60° -28 60 5 \n-50 -63 -10 \n26 60 12 \n50 -62 -10 \nmiddle frontal gyrus left  \nlateral occipitotemporal gyrus left  \nmiddle frontal gyrus right  \ninferior temporal gyrus right  \n±120° 23 62 -2 \n-28 61 5 \n50 -63 -10 \n-50 -61 -10 \nmiddle frontal gyrus right  \nmiddle frontal gyrus left \ninferior temporal gyrus right  \nlateral occipitotemporal gyrus left  \nSubtractions ±120°  \nvs. \nupright \n28 62 5 \n-16 -91 -10 \n-21 62 -2 \n-44 -74 -10 \n-55 -55 -10 \nmiddle frontal gyrus right \nlingual gyrus left \/ occipital pole left \nmiddle frontal gyrus left \nlateral occipitotemporal gyrus left \nmiddle temporal gyrus left \n±60°  \nvs. \nupright \n-18 -91 -10 \n35 54 12 \n-28 61 5 \n-28 -91 -10 \nlingual gyrus left  \nmiddle frontal gyrus right \nmiddle frontal gyrus left  \nlateral occipitotemporal gyrus left  \n \n \n"}