{"doi":"10.1177\/0261018307087988","coreId":"65253","oai":"oai:dro.dur.ac.uk.OAI2:6377","identifiers":["oai:dro.dur.ac.uk.OAI2:6377","10.1177\/0261018307087988"],"title":"Can the community construct knowledge to shape services in the local state ?  a case study.","authors":["Callaghan,  G.","Wistow,  G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-05-01","abstract":"The Labour government's stated commitment to shifting the balance of power to communities, citizens and users has been expressed in numerous initiatives to promote participatory governance in the local state. In this context achieving reliable ways of learning about participants' views becomes critical. A prime concern then becomes what constitutes `community knowledge' and how that knowledge can be developed. This article considers some issues that arise for communities and policy makers in reshaping local services through community involvement in governance. It draws out some implications of theoretical understandings of community, social capital and participation for the practice of community involvement and raises questions about the nature, and the potential, of community knowledge to exercise influence","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65253.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6377\/1\/6377.pdf","pdfHashValue":"c1180a3cf8472e0a3149d02f3e10437315cf1308","publisher":"Sage UK","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6377<\/identifier><datestamp>\n      2011-12-09T09:16:57Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Can the community construct knowledge to shape services in the local state ?  a case study.<\/dc:title><dc:creator>\n        Callaghan,  G.<\/dc:creator><dc:creator>\n        Wistow,  G.<\/dc:creator><dc:description>\n        The Labour government's stated commitment to shifting the balance of power to communities, citizens and users has been expressed in numerous initiatives to promote participatory governance in the local state. In this context achieving reliable ways of learning about participants' views becomes critical. A prime concern then becomes what constitutes `community knowledge' and how that knowledge can be developed. This article considers some issues that arise for communities and policy makers in reshaping local services through community involvement in governance. It draws out some implications of theoretical understandings of community, social capital and participation for the practice of community involvement and raises questions about the nature, and the potential, of community knowledge to exercise influence. <\/dc:description><dc:subject>\n        Governance<\/dc:subject><dc:subject>\n         Involvement<\/dc:subject><dc:subject>\n         Participatory research.<\/dc:subject><dc:publisher>\n        Sage UK<\/dc:publisher><dc:source>\n        Critical social policy, 2008, Vol.28(2), pp.165-186 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2008-05-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6377<\/dc:identifier><dc:identifier>\n        issn:0261-0183<\/dc:identifier><dc:identifier>\n        issn: 1461-703X<\/dc:identifier><dc:identifier>\n        doi:10.1177\/0261018307087988<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6377\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1177\/0261018307087988<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6377\/1\/6377.pdf<\/dc:identifier><dc:rights>\n        The final definitive version of this article has been published in the Journal Critical social policy 28\/2 2008 © SAGE Publications at the Critical social policy page http:\/\/csp.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\\ud\n\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0261-0183","0261-0183","issn: 1461-703X"," 1461-703x"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["Governance","Involvement","Participatory research."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n16 February 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nCallaghan, G. and Wistow, G. (2008) ’Can the community construct knowledge to shape services in the local\nstate ? a case study.’, Critical social policy., 28 (2). pp. 165-186.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1177\/0261018307087988\nPublisher’s copyright statement:\nThe final definitive version of this article has been published in the Journal Critical social policy 28\/2 2008 SAGE\nPublications at the Critical social policy page http:\/\/csp.sagepub.com\/ on SAGE Journals Online:\nhttp:\/\/online.sagepub.com\/\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n16 February 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nAccepted for publication version \n \nCitation for published item: \nCallaghan, G. and Wistow, G. (2008) 'Can the community construct knowledge to shape \nservices in the local state ? a case study.', Critical social policy., 28 (2). pp. 165-186. \n \nFurther information on publishers website: \nhttp:\/\/dx.doi.org\/10.1177\/0261018307087988 \n \nPublisher’s copyright statement: \nThe final definitive version of this article has been published in the Journal Critical social \npolicy 28\/2 2008 © SAGE Publications at the Critical social policy page \nhttp:\/\/csp.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/ \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n 1 \n \nAuthors details and biographies \nCorresponding author \nDr. G. Callaghan,  \nUniversity of Durham.  \nSchool of Applied Social Sciences \n32, Old Elvet \nDurham DH1 4RJ \nTel: 0191 3346836 \nEmail g.d.callaghan@durham.ac.uk \n \nGill Callaghan is a Research Fellow at Durham University. Her substantive research \ninterests have focused on participation, citizenship and social capital and she has a \nlongstanding interest in methods of research. Recent publications include: Callaghan, G. \n& Wistow, G. 2006. Publics, Patients, Citizens, Consumers? Power and Decision making \nin Primary Care. Public Administration 84(3): 583-601. Callaghan, G. & Wistow, G. \n2006. Governance and Public Involvement in the British National Health Service: \nUnderstanding Difficulites and Developments. Social Science and Medicine 63: 2289-\n2300. Callaghan, G. 2005. Accessing Habitus: Relating Structure and Agency Through \nFocus Group Research. Sociological Research Online 10(3). \nProfessor Gerald Wistow \nUniversity of Durham.  \nSchool of Applied Social Sciences \n32, Old Elvet \nDurham DH1 4RJ \nTel: 0191 3346836 \n \nemail gerald.wistow@btinternet.com \nGerald Wistow holds visiting chairs at the University of Durham and LSE. He is the \nacademic advisor to the Individual Budgets pilot programme at the Department of Health. \nHe chairs the steering groups for both the Hartlepool connected care project and the \nTurning Point Centre of Excellence for Connected Care. Recent publications include: \nWistow, G. & Callaghan, G. 2006. Connected Care in Hartlepool: from origins towards \nreality? Journal of Integrated Care 14(6). Callaghan, G. & Wistow, G. 2006. Publics, \nPatients, Citizens, Consumers? Power and Decision making in Primary Care. Public \nAdministration 84(3): 583-601. Callaghan, G. & Wistow, G. 2006. Governance and \nPublic Involvement in the British National Health Service: Understanding difficulites \nand Developments. Social Science and Medicine 63: 2289-2300.  \n 2 \nCan the Community Construct Knowledge to Shape \nServices in The Local State? A Case Study \n \n \nWord Count: 6,901 \n \nAbstract \nThe Labour government‟s stated commitment to shifting the balance of power to \ncommunities, citizens and users has been expressed in numerous initiatives to promote \nparticipatory governance in the local state. In this context achieving reliable ways of \nlearning about participants‟ views becomes critical. A prime concern then becomes what \nconstitutes „community knowledge‟ and how that knowledge can be developed. This \narticle considers some issues that arise for communities and policy makers in reshaping \nlocal services through community involvement in governance. It draws out the \nimplications of theoretical understandings of community, social capital and participation \nfor the practice of community involvement and raises questions about the nature, and the \npotential, of community knowledge to exercise influence.  \n \nKeywords: governance, involvement, participatory research \n 3 \n  \n \n \nCan the Community Construct Knowledge to Shape \nServices in The Local State? A Case Study \n \nIntroduction \n \nThe Labour government‟s stated commitment to shifting the balance of power to \ncommunities, citizens and users has been expressed in numerous initiatives to promote \nparticipatory governance in the local state. In this context achieving reliable ways of \nlearning about participants‟ views becomes critical. A prime concern then becomes what \nconstitutes „community knowledge‟ and how that knowledge can be developed. In this \narticle we consider what coherence exists between the theory underpinning involvement \nand the issues raised for developing knowledge by and about the community. We \nexamine the one attempt to implement policy based on community knowledge in a new \napproach to developing a need, rather than a service, based focus. The article considers \nsome of the decisions made in the process of knowledge construction and raises questions \nabout their consequences for the knowledge that is achieved.  \n \nThe Policy Initiative \n \nThe background to the policy initiative described below lies in a longstanding concern \nover the fragmentation of health and social services in Britain and the consequent failure \nto meet the needs of citizens. Attempts to address these concerns have focused on the \nreorganisation of services and the reassignment of responsibilities. The Seebohm report \n(1968) signalled significant change in advocating a shift from a focus on specific \npopulation\/need groups to generic services intended to respond to the whole person \nwithin their social and economic context. In practice, however, this shift produced \nanother silo based service organised around providers of social work and social care. \nMost significantly, it failed to encompass the NHS and housing.  The consequences of the \ndivision are starkly illustrated in the attempt to „join up‟ the services of a „free‟ NHS with \nmeans tested social care.While successive such policy initiatives have tried to achieve a \nmore holistic response to need, much of the policy debate has centred on identifying the \nbest professional solutions to fragmentation (Alasewski et al., 2003, Glasby et al 2006). \nGiven this context the recent emphasis on the legitimacy of citizen and consumer \nknowledge has brought new considerations to the fore.  \n \nThe new policy intiative, „Connected Care‟, aims to improve community well being by \nfundamentally reshaping the relationship between services and the communities in which \nthey are delivered. The term „Connected Care‟ originated in a joint report by IPPR and \nTurning Point, which set out a strategy for promoting well-being and social inclusion \n(Rankin and Regan 2004). It built upon the widespread recognition that services too often \nfailed to acknowledge the inter-connected nature of physical, social and emotional needs \nand their relationship to poverty and social exclusion (ibid. p.11). The report pointed out \n 4 \nthat the organisational imperatives upon which services are based means that they are \nfragmented, difficult to access and fail to meet needs holistically. The stated aim of \n„Connected Care‟, by contrast, is to connect health and social care services with housing, \neducation, employment, community safety, transport and other services. Fundamental to \nthis new service is a belief that the gaps between services can be bridged by ensuring that \nthe legitimacy of local user and community „voices‟ are recognised, alongside the \ncompeting (and historically more powerful) knowledge of the professionals and managers \nof services. Thus, it is proposed that a radically different relationship will pertain between \npeople and their services as communities become active participants in service planning \nand design rather than passive recipients of service. Hence, the locality\/community basis \nis a fundamental organising concept in the implementation of this new service.  \nTurning Point, believes that the provision of interlocking, bespoke services requires a \nchange in the relationship between commissioners and communities. Services will be \nmore effective if the community is involved in a meaningful way, in service planning, \ndesign and delivery. \n         (Turning Point, 2005) \n \nThe aim of Connected Care, therefore, is not only to deliver more sensitive responses to \nthe needs of individuals and their communities, but to involve those communities in the \norganisation and design of local services. The approach resonates with broader policy \nemphases on the collective as well as individual benefits of more effective public \ninvolvement: \nWhen people feel empowered and become more involved, other benefits follow. People \nliterally feel better. They are healthier, their educational attainment rises, crime falls and \nso does the fear of crime. People have more confidence in the criminal justice system, \nthere are fewer social tensions and neighbourhoods that were once run down, become \nbetter places to live – even sought after. \nHome Office 2005 p4  \nThese statements signal a belief that a shift in the historic power relations between \nproviders and local communities is necessary before services can respond adequately to \nthe dynamic and inter-related nature of need in a changing social world.  \n \nStatements about the value of empowerment and the importance of co-production are \nbased on a theoretical commitment to the role of social capital in improving wellbeing by \nenhancing the fabric of community life (Farrell, C. 2004, Halpern 2005). Although a \npopular notion in social policy, the conceptualisation of social capital is frequently \nconfused and is rarely developed systematically in policy implementation (Portes 2000, \nFine 2002, 2003). Evidence emerging from social and epidemiological research however, \nsuggests that social capital has real impact on health and wellbeing (Wilkinson 1996, \nWilkinson et al 1998, Putnam 2000, Marmot 2005). It is argued that social capital is \neffective when social networks and relations of trust are strong and, in consequence, \ncitizens are able to act in the interests of the whole community rather than on the \nindividualised basis of consumer status (authors, 2006). A reliance on the operation of \nsuch principles substantially underpins the Connected Care initiative. \n \n 5 \nThe logic of „Connected Care‟ lies further, in understanding locality as creating, as well \nas reflecting, experience (Bourdieu 1999, Dorling 2001), because it is here that the \nconcern with social capital and the relevance of a locality focus for Connected Care unite. \nIn this context, the community is designated the „actor‟ in contrast to the more structural \nconcept of locality (Cooke, P.1990)). The community‟s power to shape its own \nenvironment is active, as well as reactive to external forces. If community social capital \ncan be built through involvement and devolved power, the role of the state can become \none of facilitator in a self-sustaining process, rather than a provider of services which \nhave hitherto been seen as unresponsive to local need. The attractiveness of such \nsolutions in avoiding the need for structural change, including redistributive policies has \nbeen noted elsewhere (Fine, 2003).To fulfil its true promise, involvement must not only \nsecure improved service design, but also, in being locally determined, access and deploy \nthe local resources of social capital highlighted above. While this objective is highly \nattractive, in principle, its translation into practice presents substantial challenges. \n \nIt is intended that Connected care will be based on a radical reorientation of service \ndevelopment and delivery processes with the aim of embedding locality based structures \ninto the governance of the local state. Localisation is intended to enable, „a complex web \nof new and direct relations which can help people connect together in a new and dynamic \nway‟ (Somerville 1998 p.235). However, such interaction is undermined when learning \ncapacity within organisations varies (Shields, 1992) and while structures remain \nfunctionally organised around specific services (Foley and Martin 2000).  The \nimplication of taking a community or locality focus is that different information is \nrequired to inform service design from the professional and individually focussed \nknowledge traditionally considered central. Questions such as how information about \nneed is conceptualised, who holds such information, how it should be deployed and by \nwhom, need to be rethought. In what follows we describe how the views of service users \nand the wider community have been sought through a locally designed „community audit‟ \nprocess. We then reflect on the implications of this approach to gathering knowledge for \nthe community‟s ability to have an effective voice in local governance.   \n \n \nMethods \nThe first pilot for Connected Care was established in 2005 in the Owton ward of \nHartlepool, with participants from NHS and local authority commissioners, service \nproviders, community associations, residents and elected members. The research \ndiscussed here evaluated the process of mobilising „community‟ voice, referred to above, \nas a first step in service redesign (Callaghan and Duggan, 2006). It was based on a \ncombination of qualitative methods and documentary analysis. Interviews were \nundertaken with fifteen people identified as the „key stakeholders‟ in developing the \nConnected Care Pilot. They included the professional and lay members of the pilot‟s \nsteering group as well as elected representatives, representatives from the community \nassociations and the audit team. Non participant observation at Connected Care Steering \nGroup meetings and the Owton Community Forum provided further sources of \ninformation about the relationship of the audit to other processes. Respondents are \n 6 \nidentified below by perspective (professional (p) or community (c)) and by number to \nmaintain confidentiality.  \n \nIn achieving knowledge of the community a number of issues about process of \nconstruction emerged which clearly shaped what became „known‟. Questions include: \nHow has the community been defined? What interests are involved in shaping the \nprocess? What counts as valid knowledge of „the community‟ and who are the relevant \nrespondents? Together these questions inspire a larger question of how far the community \ncan fully own knowledge that is initiated and facilitated by groups that lie beyond its \nboundaries. In what follows we consider the impacts of these issues to problematise the \nissue of „authentic‟ community knowledge. We consider issues of reflexivity among \ncommunity and professional researchers involved in this process. \nPlace as Context: ‘the right to want things’ \n \nThe Owton ward, in which the Connected Care initiative was established, is largely based \non a post-war council housing estate on the southern fringes of Hartlepool, a town which \nhad experienced a long term process of deindustrialisation in the 1970s and 80s. \nUnemployment has been consistently well above the national average for many years and \nit is the nature of processes of exclusion and deprivation that such experiences tend to \npolarise in particular places within towns and cities (Byrne, 1999). Residents have a \nconsistently poor health, social and economic status and the ward stands at 1,075 in an \nIndex of Multiple Deprivation which comprises 32,482 wards (2005). This socio \neconomic profile was a prime factor in justifying the location of the initiative: \n \n…one of the big problems on the estate is poverty. Full stop. Poverty. Now because of \npoverty people are in debt so some of the health-related issues are about anxiety and \ndepression due to ill health being caused by debt. You‟ve also got a third generation and \nin some cases almost a fourth generation in some families of unemployment. Now that \nhas consequences for people‟s aspirations, and if aspirations are depressed then anxiety \ntends to follow as does poverty and all of those things so again you‟re back into that \nspiral. (c:1) \n \nThese contextual factors are important in describing the approach taken because they not \nonly situate the pilot itself, but will continue to have impact on the implementation of \nConnected Care in the locality. The pilot is taking place in an area with three very active \ncommunity associations but with evidence of more widespread disengagement among the \ngeneral population. One profile of the ward compiled by a local community association \nshows it to be one in which levels of participation have been consistently low (OFCA., \n2003), while a more recent MORI poll (2006) suggested that relatively few residents feel \nable to influence decisions about their area. The respondent quoted above explains why \ndisempowerment is felt by individuals within the community. Yet the notion of building \nsocial capital through involvement relies on stressing the agentic potential of \ncommunities. Involvement must play a core role in the Connected Care initiative if the \nlegitimacy of the policy is to be assured. The coherence of the community as an entity is \n 7 \ntherefore crucial. This is importantly operationalised in the definition of community \nboundary.  \n \nDefining the community \n \nAn unresolved, yet important, problem for policy lies in determining what the community \nis, (Day and Murdoch, 1993, Cohen, 1985, Dorling, 2001). The tendency of official \ninitiatives to treat community and locality as synonyms has been recognised in previous \nresearch (Madanipur, 1995, Power 1996). Such convenient elision does not, however, \nnecessarily reflect communities‟ own definitions and experience (Cooke, 1989). Jewkes \nand Murcott (1998) have pointed to the significance of the disjuncture between these \nliteratures and the strategic declarations of national and international policy bodies on \nengaging „the community‟. This became apparent in the Connected Care pilot, which was \ncoterminous with the local authority ward of Owton but not with the whole of the Owton \nManor estate. The significance of this issue emerged in the Owton Residents‟ Forum \nwhen a resident from one housing block questioned the geographical boundaries adopted \nby the pilot. While he recognised that his block was part of another local authority ward, \nhe said: „if you asked anyone where we belong they‟d say the Manor.(c:2). As this \nstatement implies, basing the pilot on ward boundaries gave electoral imperatives \nprecedence over those of community identity.  \n \nThe boundaries chosen for the project reflected the central role of councillors among its \ninitiators, and they undoubtedly saw electoral advantage in maintaining that focus, at \nleast initially. However, if the definition held by elected representatives, policy makers or \nprofessionals varies from that of the community itself there is a danger of cutting across \nthose networks of social capital that Connected Care is actively seeking to deploy (Lee \nand Ozanne, 1999). This has significant implications for the articulation of a „community \nvoice‟.  \n \nA further layer of complexity results from the fact that communities are not \nhomogeneous and may be characterised by subgroups with conflicting interests. While its \npositive aspects are stressed, the „dark side‟ of social capital, recognised most clearly by \nBourdieu, lies in its effectiveness in excluding those beyond its boundaries at the same \ntime as binding those within them (Bourdieu 1986). This applies to subgroups within the \ncommunity as well as the community as a whole. In Owton respondents identified the \nmulti-levelled nature of their community: \n„I think when you look at it, obviously, there‟s the geographical community about the \nManor, but there are clearly very different communities within that‟ (c:5) \nSuch considerations of identity, briefly stated here, interact in creating the context for the \nConnected Care pilot and raise questions about the assumption that a coherent and \nuncontested community „voice‟ is possible. They are issues that become increasingly \npertinent in a policy context of double devolution which envisages decisions about the \nallocation of resources being taken at the community level. In Owton there are at least \nthree bases of community identity, the estate, the housing block and the residents‟ \n 8 \nassociations. Each of these has been observed to form the basis for claims to legitimacy \nin local decision making forums. \nEnlisting Involvement: the community audit \nForegrounding the importance of knowledge of community definition of need implies \nthat even the most effectively designed, professionally led services are no longer \nadequate. The Connected Care Steering Group, as the group developing the new service, \ncommissioned research to learn about how the community viewed its services and the \nchanges they would want to make. This took the form of an „audit‟, the aims of which \nwere twofold. Firstly, it sought to develop community-based knowledge for designing \nresponsive and joined up services. Secondly, that knowledge was to be produced through \nbuilding capacity within the community itself. A team of local residents was recruited \nand trained in research skills by researchers from the University of Central Lancashire \n(UCLAN).  It was intended that this would shift the balance of power between \ncommunity and professionals because the production and ownership of knowledge about \nitself would become the province of the community rather than the „expert‟.  The audit \nwas expected to provide valid information from which a new service could be designed \nwhile also developing skills that could be the basis of the community‟s own control of \nknowledge about itself, and for itself, in the future. \n \nDefining the process \n \nDiffering expectations were held by participating interest groups about how a Connected \nCare audit should proceed. As the audit was an untried process, the emergence of a \nnumber of early tensions, based in these differing interpretations of purpose, was perhaps \ninevitable. The need to complete the process quickly was a pressure felt both by service \nand community leaders. This perceived imperative competed with a developmental \nmodel whose rationale lay in working at the pace of the community.  \nSo it was … community owned, peer research in a sense, the community being \nsupported… financially and trained and mentored and guided … (p:4) \nFor professionals the pressure to demonstrate progress arose from accountability to their \norganisations.  \nI think originally we were hoping to get the …audit bit finished by October and the \nreason for that was (the) PCT and Social Services were saying „Well really that‟s the \nkind of time we need to be thinking about what we‟ve done with budgets for the following \nyear.”(p:2) \n \nA conflict also existed for the community organisations (as embodied here in the audit \nteam)  between the need to develop control over the knowledge collected and used  about \nit and the need for tangible change to take place, so that confidence in a community-\nbased consultation process could be sustained. Precipitate action could bring a \ndisconnection, that has frequently been observed elsewhere, between the community \norganisations at the forefront of new projects and the wider community, resulting in the \nco-option of community members as quasi professionals (Collins, 2001). At the same \ntime community members‟ expectation of timely action was clear. \n 9 \nin Owton Manor we‟ve been surveyed so many times, honest we have, survey after survey \nafter survey and people are so fed up. I talk to our residents ….and they say „Oh God, not \nanother survey!‟ you know, and it‟s action we need. (c:5) \n \nUncertainty about how the model of Connected Care, itself, would work combined with \nthat created by new partnerships: \n….there were some tensions as well around in terms of doing this Connected Care audit, \nexactly what was that?  There … wasn‟t a framework that said „This is what a Connected \nCare audit is‟.(p:4) \nFrom the traditional perspective of policy design this lack of definition creates unhelpful \nuncertainty and ambiguity. Yet an important part of the legitimacy of Connected Care, as \na new approach, was the promise that it would be co-produced. It would not be a service \ndesigned by professionals alone, but one in which the expertise of the community would \nplay a central role. Implementing Connected Care entails achieving technical service \nredesign within a legitimacy based on community involvement. Securing this legitimacy, \nconsequently, involves achieving coherence between the theoretical basis of the initiative \nand its structural and organisational context. These fundamental issues of how \ncommunity and process are defined give rise to a number of practical issues in designing \nand validating community research. \nCan effective mechanisms for ‘community knowledge’ collection be \ndeveloped? \n \nThe locality focus of the audit research was assured through employing a host community \norganisation, but the process of selecting this organisation raised interesting differences \nbetween the philosophy, cultures and governance associated with community \ninvolvement and those of the public services. A tendering process invited the four \ncommunity associations to compete for the role of host. This had the advantage of \nestablishing a degree of transparency appropriate to the commissioning organisations‟ \nneed to demonstrate public accountability but, it emerged, was divisive:  \n…it is a shame because all the community groups in this area work together….. So it was \na shame that it put us at each other‟s throats ... (c:3) \n \nThe approach undermined existing social capital. Its application illustrates Bourdieu‟s \nemphasis that social capital has a dark side and  that an idealised discourse of community \nmust be avoided: \nI found the voluntary sector do this, they play their cards very close to the chest, or it‟s a \nsort of, it‟s a bit of a one-upmanship. When you first kick off they tell you snippets but \nthey don‟t tell you the full facts and it‟s really hard, it makes it very, very hard…(c:5) \nNo assumptions can be made about the cohesiveness of any particular sector or \ncommunity. That said, in Owton the community associations, were able to overcome the \nconflict caused by the process at that point: \n….in the end, the community groups as a whole, we‟re sort of bigger than that.  (c:6) \n \nClaims to participation within research can be rhetorical rather than real. McTaggart, \n(2001) describes this in graphic terms, distinguishing between „participatory research „ in \n 10 \nwhich the researchers „share‟ in the process and  „involvement‟ in which they are \n„entangled‟ or „implicated‟. Yet the existence of fractions of community suggests this \nopposition, although representing an important insight, may need to be refined. From \nobservation of the processes in Owton we suggest that a straightforward binary division \nwould be simplistic. The interviews suggested that elements of both sharing and \nentanglement were experienced by those producing knowledge. \n \nElements of the research in Owton were professionally led to meet the need to produce \ncomprehensive data which would satisfy social science notions of validity in its claims to \nrepresent community views. At the same time there was a clear sense of growing \nconfidence within the audit team in respect of its claim to research skills and ownership \nof knowledge. Indeed as the team assumed greater control over the processes of gathering \nevidence, the professional researchers found the situation more challenging: \n…it‟s difficult to tie them down …who they‟re going to interview so they come back and \nyou think „I didn‟t think you were doing that‟ … (p:4) \n \nA further issue in participatory research is the provision of support to community \nmembers to become participants-as-researchers. This entails developing skills and \nconfidence in the audit team: \nOne of the things again for me that I‟d learned was really how you‟re asking people, we \nwere asking people to do something really very sophisticated who had a… rudimentary \nunderstanding of the concept, but had no comparable experience to draw on to give them \nthe skill and confidence to do it. (p:5) \n \nCommunity involvement implies accepting some reduction in professional control in \ngathering information about needs. The issue of validity which grounds community \nclaims to knowledge does not map directly onto validity based on professional definitions \nof what constitutes rigorous research. The negotiations between the two and the shift \ntoward community control in developing knowledge brings about a process of co-\nproduction that is likely to challenge principles among all parties.  \n \n \nWho should research the community? \n \nOne issue, which has been widely contested, concerns the claim that research undertaken \nby community members avoids the intrusion that results from outsider research \n(Bourdieu, 1999). Bourdieu argues that structural differences between researcher and \nresearched, such as those of social class, represent a form of symbolic violence which \ndistorts the knowledge that is produced. This view was reflected within the audit team: \nI was .attracted by the fact that a) it was going to be conducted by people within the \ncommunity, talking to people in the community and I thought that was not before time \nand I thought it would probably be more successful in having or parachuting \nprofessionals, for want of a better word, in who I thought probably wouldn‟t get the same \ndepth of information (c: 4) \n \n 11 \nBourdieu points out, however, that training community members as interviewers has its \nlimitations. Social research relies on the ability to construct an analysis in a dialogue with \nthe empirical data: \nIt is not simply a question of collecting “natural discourse” as little affected \nas possible by cultural asymmetry; it is also essential to construct this \ndiscourse scientifically, in such a way that it yields the elements necessary for \nits own explanation \nBourdieu 1999 p611 \n \nHere Bourdieu raises the point that underpinning the construction and interpretation of \nempirical data, lie theories about the nature of the world. Policy is also based on such \ntheories more or less explicitly articulated (Walker, 2001). Raising the question of what \nconstitutes knowledge and how that can be created suggests the need to develop a critical \nunderstanding of the process which takes it beyond a simple empiricist account.  \n \nIn constructing authentic community knowledge, ostensibly technical issues of team \ncomposition, sampling and reporting results become significant constitutive elements. \nFor example, one issue considered by the Steering Group was how far the audit team \nshould be representative of the wider population. Initially it was intended that the team \nwould reflect the diversity of the population, but the recruitment process did not fully \nachieve this objective. Owton is an overwhelmingly ethnically white, working class \nestate within which the majority of informal community activists are women. It is not \nsurprising then that women formed the audit team in this case (though the male \ncommunity leader from the host organisation undertook some interviews). There are \nnumerous other bases of diversity in the community, however, that were not represented \nand it would be difficult to envisage a process by which this could be achieved in \npractice. The inability to reflect all forms of diversity might suggest that symbolic \nviolence can be committed within the community. What then are the consequences of this \npartial representativeness for developing legitimate community knowledge? \n \nA further issue raised in Owton was the way in which conducting research within the \ncommunity has an impact on the perspectives and relationship to their community of \nthose undertaking it. This was clear from the community researchers‟ experience: \n..once you start actually interviewing somebody more in depth you realise how complex \nthey are and the knock on effect one has to the other (c:4) \n \nUndertaking a research role brings about change which goes beyond the danger of being \ndistanced in the process and becoming a „professional community member‟ identified \nabove (Collins, 1991). Participants-as-researchers develop a different level of reflexivity \nwithin their community in the process. It is acknowledge that conducting research \nchanges the relationship between researcher and the field in ways that are likely to raise \nmore issue for community researchers than for professional researchers. Issues such as \nthe confidentiality of information, the changed relationship between respondents and \nresearcher, the purpose, findings and use of the research report each require more \nattention in relation to the community researcher role.  Further, unlike professional \nresearchers, community researchers do not leave the field when the research is over. The \n 12 \nimplications of this central relationship for both researcher and researched, and for the \nethics of participatory research need to be developed in the specific research context. \n \nThese questions about the conduct of community-based research present challenges to \nsimplistic assumptions about its superior validity and its capacity building role within the \ncommunity that deserve further attention. Nonetheless within Owton the strength of \ncommunity involvement in research was recognised by members of the community and \nstakeholders from local services: \n…they know what people want and what makes them happy and what will get them \nthrough the doors and what will keep them there because after all we‟re trying to extract \ninformation from people and we want them to feel good about giving us the information. \n(C:4) \nAt the same time there are consequences for traditional understandings about the quality \nof data as well as for the experience of community researchers. What constitutes the \ncommunity and who within the community could be regarded as „information rich‟ is a \ncentral problematic for this approach. \n \nWho are relevant respondents in ‘the community? \n \nThe basis upon which the citizen is involved in decision making is that of responsibility \nto focus on the community as a whole, rather than the individual user perspective. One \nvalue of citizen involvement is that it produces important information about social needs \nwithin a locality. Its further strength lies in the added value that involvement brings in \nbuilding social capital to help the community to address those needs. This is consistent \nwith a social model of health and a concern to improve the health and wellbeing of the \npopulation, rather than the more limited focus on improving health services (authors, \n2002). It chimes with evidence that involvement has a positive influence on health and \nother outcomes in local communities (Marmot and Wilkinson 1999). An emphasis on \ncitizenship requires the individual to be involved in promoting the interests of the wider \ncommunity rather than merely those of the user.  \n \nIn the audit process there was some difference of view about who should be defined as \nthe respondents in the research.  The audit team began by designing and conducting a \nquestionnaire for administration with the wider community. From the perspective of the \nSteering Group this was felt to be too broadly drawn because it did not have a service \nuser focus:  \n…those first questionnaires for example…….. they were fine but they gave you more of a \nsense of what it‟s like to live in the area, they hadn‟t really talked to people who were \nservice users and got the right people..(p:4) \nThis raises the interesting question of who the „right people‟ are. There is room for debate \nabout what constitutes an appropriate sample for such an audit. Arguably the Connected \nCare Audit report (Buffin and Kramer, 2005) gave relatively greater attention to the \ndirect user voice in its findings than to the citizenship dimension. While this might be \nappropriate it is important to recognise these different statuses and their claims to \nlegitimacy in developing a sample of community members. \n \n 13 \nWithin the overlapping populations of user, citizen and community a further distinction \nappears. The Audit Report suggested that service design should be based on community \n„experience‟ and „opinions‟, two forms of data which also have differing status and \nconsequent legitimacy from each other. Clarity in their definition and the relative weight \nattached to each becomes important when evidence is drawn upon as the basis of resource \nallocation. The legitimacy with which each is endowed is likely to convey different \npersuasive power when resources are contested. Developing community knowledge for \nthe design and management of local services will need to be conscious of such \ndistinctions as a basis of serving potentially different community interests. \nWhat purposes can an audit of community views serve? \nThe purposes of the audit can be understood in terms of two forms of capital (Putnam, \n2000). In conducting community research the research team access, and may even build, \nbonding capital by developing an account of community views which is subscribed to by \nthe community. A second form of capital, bridging capital, is also necessary in policy \nimplementation because it involves assuring local policy makers of the scientific validity \nof that account in order to secure a shift in power and resources. \n \nOne of the prime criticisms of previous involvement initiatives has been that they raised, \nand then disappointed, expectations when reality flouted rhetorical ambition. The \nevaluation research showed that the most important purpose served by the community \naudit was that it formed a foundation for a process of involvement: \n „…although there have been levels of discomfort and insecurity… nonetheless what has \ncome out is something we‟ve all got our hands dirty over, we‟ve all made a contribution \nto..‟(c:7) \nIn addition to ownership a further advantage of participatory research is that it gains \nsupport for the changes being developed (Whyte, 1991). The audit report was validated \nby „the community‟ at a public launch event and so provided a legitimate basis for the \nnext stage in designing a Connected Care response.  \n \nWhile the generalised findings from the audit report in Owton could give a steer on the \ndirection of service design it contained no information about how this should be \norganised. This second stage, of service design and implementation, is likely to be much \nmore contested. It will involve a range of partners, extending beyond the remit of the \noriginal Steering Group and will embrace both resource issues and the targets that the \nindividual services must achieve. Recognition that knowledge is constructed and that the \nform of construction is central to its persuasiveness, becomes important at this point. The \nprocess must be seen to be valid by the professionals involved to ensure that it provides \nan accepted alternative basis for knowing about community need. It is likely when \nresources are at issue that differences of power that have been set aside in information \ngathering will re-emerge and questions of the legitimacy of the knowledge gained will \ngrow in significance.  \n \nThe audit process provided information and raised awareness of the concept of \nConnected Care in the community. More importantly, perhaps, it provided the legitimacy \nfor the pilot to move into a service design and implementation phase. The report became \n 14 \na resource in subsequent discussions about its implementation. Its findings were \nexplicitly used by some stakeholders to counter a possible reassertion of professional \ncontrol within the services specification and design process. As this experience suggests, \ncommunity interests are no less able than professionals to play the „user card‟ (Mort and \nHarrison, 1996) to legitimate such processes. One of the issues that this initiative will \nneed to resolve as it develops is the degree to which it is „community led‟ or \n„professionally led‟ and the kind of relationship between professionals and community \nthat is sustainable, beyond the stage of merely „auditing‟ the needs of the community.  It \nwill then become clear how far the continuing process is one resembling passive \nconsultation or active partnership with the wider community based on the community‟s \nown knowledge construction.  \n \nConclusion \nThe new service is intended to address the objective of creating integrated locality based \nservices which are more appropriate to local need because they are more responsive to \nthe community‟s wishes in their design and delivery. At one level this simply represents \nyet another attempt to solve the problems of lack of integration between services and the \nfailure to achieve a holistic approach. Unlike previous such solutions, however, which \nhave sought answers through better professional and organisational integration, the logic \nof this approach is to start from the perspective of the community in which services are \ndelivered. It seeks to bring the legitimacy of the community and of the user voice to the \ntable. The potential for such voices to exercise power within the governance structure is \nimportant in providing the first condition for enabling a, previously unheard, perspective \npreviously to become powerful. It allows a perspective which starts from an \nunderstanding of need which is not based on organisational boundaries but rather is \nholistic and is based on the lived experience of community members, to be present at the \ncrucial points of service design, delivery and management. This reflects not only a \nconcern with service efficiency, but a commitment to the view that community \ninvolvement builds social capital and leads to longer term benefits in population health \nand well being. Such a commitment necessarily involves negotiations about knowledge in \nthe shift of power and control to the local community. \n \nShifting the balance of power to the community requires acceptance by professionals that \nforms of knowledge other than their own also have currency. In the past, community, \ninvolvement has frequently taken the form of closer working relationships between \nprofessionals supported by the participation of community leaders on professional \ncommittees and groups. A more radical approach would entail the community shaping its \nown services; the criteria for accessing them; and what constitutes efficient and effective \nuse.  \n \nIf the relationship between the local state and its citizens is to be reformed, claims to \ncommunity knowledge take centre stage. The stated purpose of gaining community \nknowledge in this case study was to learn what the community wanted, both to improve \nservice delivery and to enhance involvement as a means of building community capacity, \ndeveloping social capital and improving outcomes. In this article we have identified some \n 15 \nimplications contained within the concept of  constructing community knowledge and \nraised questions about the consequences of the  processes by which such knowledge is \nconstructed for its nature, ownership and use. We have tried to draw out some of the \ncomplexities underlying the construction of community knowledge as a basis for service \ndesign and delivery. In this case study a number of potential tensions have been identified \nin attempts to shift power and control through the construction of such knowledge and we \nhave suggested that this is likely to be more contested in the next stage when resources \nare deployed. Conflicts of perspective on the degree to which power can be transferred, \nare inevitable for a number of reasons. These include the lack of unanimity in \nprofessional understandings of the legitimacy of users and the public in decision making \n(authors, 2006) and potential differences between the interests of community leaders and \nmembers, respectively. The ways in which these perspectives are reconciled will be \ncrucial to where along a continuum of „involved‟-„entangled‟ this attempt at community \nempowerment sits.  \n \n \nReferences \n \nAlaszewski A, Baldock J, Billings J, Coxon K & Twigg J (2003) Providing \nIntegrated Health and Social Care for Older Persons in the United \nKingdom. Centre for Health Services Studies, University of Kent, \nCanterbury, LIK.  \nAlaszewski, A. Baldock,J. Billings,J. Coxon, K. Twigg, J.  (2003) Providing Integrated \nHealth And Social Care For Older Persons in The United Kingdom Centre for Health \nService Studies. In “Public Policy and Social Welfare”, (28): Providing Integrated Health \nand Social Care For Older Persons A European Overview Of Issues At Stake Kai \nLeichsenring, Andy M. Alaszewski (Eds.) \n \nBarnes, M., Matka, E., and Sullivan H. 2003 Evidence, Understanding and Complexity: \nEvaluation in Non-Linear Systems Evaluation, 9: 265 - 284. \n \nBourdieu P. (1986) The forms of capital. In: Richardson JG, ed. The handbook of theory \nand research for the sociology of education. New York: Greenwood Press, pp241–58 \n \nBourdieu, P, (1999) The Weight of the World: social suffering in contemporary society. \nLondon, Polity \n \nBourdieu, (2005) Habitus. pp43-52 in Habitus: A Sense Of Place. Hillier, J. and \nRooksby, E. eds. (2\nnd\n ed) Aldershot Ashgate  \n \nBuffin, J. Kramer, R (2006) Connected Care Audit: Owton Ward. Turning Point. London \n \nByrne, D. (1999) Social exclusion Open University Press Buckingham \n \nByrne, D. (2005) Social exclusion (2\nnd\n edition) Open University Press Buckingham \n \n 16 \nCallaghan, G. and Wistow, G. (2002) Public and Patient Participation in Primary Care \nGroups: New beginnings for Old Power Structures. Leeds. Nuffield Institute for Health \n  \nCallaghan, G. and Wistow, G. (2006) Publics, Patients, Citizens, Consumers? Power and \nDecision Making In Primary Health Care Public Administration 84(2):583-602 2006 \n \nCallaghan, G. and Duggan, S. (2006) Evaluation of the Connected Care Audit Process. \nUniversity of Durham \n \nCohen, A. P. (1985) The Symbolic Construction of Community, Ellis Horwood \nTavistock, London. \n \nCollins C (1999) Applying Bakhtin in urban studies: the failure of community \nparticipation in the Ferguslie Park partnership. Urban Studies 37(1):73-90 \nCooke, P. (1989) „Locality-theory and the poverty of Spatial Variation‟ Antipode, \n21(3):261-273 \n \nCooke, P. (1990), Locality, Structure, and Agency: A Theoretical Analysis  \nCultural Anthropology, 5(1):3-15 \nDay G. and Murdoch J. (1993) „Locality and Community: Coming To Terms With \nPlace‟, Sociological Review, 41(1):82-111. \n \nDorling  D. (2001)`Anecdote is the singular of data' How much does place matter?  \nEnvironment and Planning A, 33: 1335 -1369 \n \nFarrell, C. (2004). „Patient and Public Involvement in Health: the Evidence For Policy \nImplementation‟. London, Department of Health \n \nFine, B. (2002) They F**K You Up Those Social Capitalists. Antipode, 34(4): 796-799 \n \nFine, B. (2003) Social Capital Versus Social Theory: political economy and social \nscience at the turn of the millennium. London. Routledge. \n \nFoley, P., and Martin, S. (2000) A New Deal For The Community? Public \nParticipation In Regeneration And Local Service Delivery Policy and Politics l28(4):479-\n492 \n \nGlasby J., Dickinson, H. Peck (2006) Guest editorial: Partnership working in health and \nsocial care Health & Social Care in the Community 14 (5):373–374. \n \nGustavson, H. (2002) Theory and Practice: the mediating Discourse in Handbook of \nAction Research: Participative Inquiry and Practice Reason P and Bradbury H.(eds)  \nLondon Sage \n \nHalpern, D. (2005) Social Capital. Cambridge, Polity \n 17 \n \nJewkes, R. and Murcott, A. (1998) Community Representative: Representing the \nCommunity Social Science and Medicine 46(7):843-858  \n \nJoshi, H. (2001) Is there a place for area-based initiatives? How much does place matter?  \nEnvironment and Planning A. 33: 1335 -1369 \n \nLee, RG., and Ozanne, JL. (1999) Improving Health service encounters through resource \nsensitivity: the case of health care delivery in an Appalachian community Jnl of Public \nmoney and marketing. 8(2):320-339 \n \nMCTaggart, R. (1991) Principles for Participatory Action Research. Adult Education \nQuarterly  41(3):168-187 \n \nMadanipour,  A. (1998)  Social exclusion and space., in A Madanipur, G Cars and J \nAllen (eds) Social Exclusion in European Cities. London Jessica Kingsley \n \nMarmot, M., Wilkinson, R. (1999) Social determinants of health, Oxford University \nPress, Oxford \n \nMort, M., Harrison, S. (1996) The user card: picking through the organisational \nundergrowth in health and social care. Contemporary Political. Studies. 2: 1133-40.  \n \nOwton Fens Community Association (2003) Report. Hartlepool, OFCA. \n \nPawson, R., and Tilley, N. (1997) Realistic Evaluation. London, Sage \n \nPortes, A. (2000) The two meanings of social capital Sociological Forum 15(1):1-12 \n \nPower, A.  (1996)  Area Based Poverty and Resident Empowerment. Urban Studies \n33(9):1535-1564  \n \nPutnam, R.D. (2000) Bowling Alone: The Collapse and Revival of American \nCommunity, New York, Simon and Schuster \n \nRankin, J., Regan, S., (2004) Meeting complex needs in social care \nhttp:\/\/www.ippr.org.uk\/articles\/index.asp?id=469 \n \nSeebohm Report, (1968) Report by the Committee on Local Authority and Allied Social \nService. London: HMSO \n \nSomerville, P. (1998) Empowerment through residence. Housing Studies 13 no 2 p233-\n257 \n \nShields, J. (1992) Evaluating Community organization projects: the development of an \nempirically based measure. Social Work research and abstracts p15-21 \n 18 \n \nTurning Point.  (2005) Connected Care http:\/\/www.turning-\npoint.co.uk\/NR\/rdonlyres\/D7DDDF54-F64D-42DE-\nA8761F8BB1E09DDF\/0\/ConnectedCarebooklet_Dec05.pdf \n \nWalker, R. (2001) Great Expectations: Can Social Science Evaluate New Labour's \nPolicies Evaluation, 7(3): 305-330 \n \nWhyte, WF. (1991)  Participatory Action research. Newbury Park. Sage \n \nWilkinson, R. (1996) Unhealthy Societies: The Afflictions of Inequality London. \nRoutledge \n  \nWilkinson, RG., Kawachi, I., Kennedy, BP., (1998) Mortality, The Social Environment, \nCrime And Violence. Sociology of Health and Illness 20(5):578-597 \n \n \n"}