{"doi":"10.1016\/j.soilbio.2007.10.001","coreId":"63936","oai":"oai:nora.nerc.ac.uk:1344","identifiers":["oai:nora.nerc.ac.uk:1344","10.1016\/j.soilbio.2007.10.001"],"title":"Differential response of ectomycorrhizal and saprotrophic fungal mycelium from coniferous forest soils to selected monoterpenes","authors":["Ludley, Katherine E.","Robinson, Clare H.","Jickells, Sue","Chamberlain, Paul M.","Whitaker, Jeanette"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-03","abstract":"The mycelia of saprotrophic (SP) and ectomycorrhizal (ECM) fungi occur throughout the upper soil horizons in coniferous forests and could therefore be exposed to high concentrations of monoterpenes occurring in the needle litter of some tree species.\\ud\nMonoterpenes are mycotoxic and could potentially affect fungi that are exposed to them in the litter layers. In order to investigate whether monoterpenes typical of coniferous litters could influence fungal communities, we analysed the monoterpene content of freshly fallen needles of Pinus sylvestris, Picea abies and Picea sitchensis. The most abundant monoterpenes were found to be α-pinene, β-pinene and 3-carene. We evaluated the effects of these three monoterpene vapours on the biomass production of 23 SP isolates and 16 ECM isolates. Overall, 75 % of ECM isolates and 26 % of SP isolates were significantly inhibited by at least one of the monoterpene treatments and both intra- and interspecific variations in response were observed.\\ud\nMonoterpene concentrations are highest in surface litters. The differential effects on fungal taxa may influence the spatial and temporal distribution of fungal community composition, indirectly affecting decomposition and nutrient cycling, the fundamental ecosystem processes in which fungi have a key role in coniferous forest soils.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/63936.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/1344\/7\/LudleyN001344PP.pdf","pdfHashValue":"505968708568ad9fa5a4f3869ecaa7d48b9c7d00","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:1344<\/identifier><datestamp>\n      2017-02-07T11:24:58Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D5335<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/1344\/<\/dc:relation><dc:title>\n        Differential response of ectomycorrhizal and saprotrophic fungal mycelium from coniferous forest soils to selected monoterpenes<\/dc:title><dc:creator>\n        Ludley, Katherine E.<\/dc:creator><dc:creator>\n        Robinson, Clare H.<\/dc:creator><dc:creator>\n        Jickells, Sue<\/dc:creator><dc:creator>\n        Chamberlain, Paul M.<\/dc:creator><dc:creator>\n        Whitaker, Jeanette<\/dc:creator><dc:subject>\n        Biology and Microbiology<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        The mycelia of saprotrophic (SP) and ectomycorrhizal (ECM) fungi occur throughout the upper soil horizons in coniferous forests and could therefore be exposed to high concentrations of monoterpenes occurring in the needle litter of some tree species.\\ud\nMonoterpenes are mycotoxic and could potentially affect fungi that are exposed to them in the litter layers. In order to investigate whether monoterpenes typical of coniferous litters could influence fungal communities, we analysed the monoterpene content of freshly fallen needles of Pinus sylvestris, Picea abies and Picea sitchensis. The most abundant monoterpenes were found to be α-pinene, β-pinene and 3-carene. We evaluated the effects of these three monoterpene vapours on the biomass production of 23 SP isolates and 16 ECM isolates. Overall, 75 % of ECM isolates and 26 % of SP isolates were significantly inhibited by at least one of the monoterpene treatments and both intra- and interspecific variations in response were observed.\\ud\nMonoterpene concentrations are highest in surface litters. The differential effects on fungal taxa may influence the spatial and temporal distribution of fungal community composition, indirectly affecting decomposition and nutrient cycling, the fundamental ecosystem processes in which fungi have a key role in coniferous forest soils.\\ud\n<\/dc:description><dc:date>\n        2008-03<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n         \n\n  Ludley, Katherine E.; Robinson, Clare H.; Jickells, Sue; Chamberlain, Paul M.; Whitaker, Jeanette.  2008  Differential response of ectomycorrhizal and saprotrophic fungal mycelium from coniferous forest soils to selected monoterpenes.   Soil Biology and Biochemistry, 40 (3). 669-678.  https:\/\/doi.org\/10.1016\/j.soilbio.2007.10.001 <https:\/\/doi.org\/10.1016\/j.soilbio.2007.10.001>     \n <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.soilbio.2007.10.001<\/dc:relation><dc:relation>\n        doi:10.1016\/j.soilbio.2007.10.001<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/1344\/","http:\/\/dx.doi.org\/10.1016\/j.soilbio.2007.10.001","doi:10.1016\/j.soilbio.2007.10.001"],"year":2008,"topics":["Biology and Microbiology","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \n \n \nArticle (refereed) \n \n \n \nLudley, Katherine E.; Robinson, Clare H.; Jickells, Sue; \nChamberlain, Paul M.; Whitaker, Jeanette. 2008 \nDifferential response of ectomycorrhizal and saprotrophic \nfungal mycelium from coniferous forest soils to selected \nmonoterpenes. Soil Biology and Biochemistry, 40 (3). 669-\n678. doi:10.1016\/j.soilbio.2007.10.001 \n \n \n \n \n \nCopyright © 2007 Elsevier Ltd All rights reserved \nThis version available at http:\/\/nora.nerc.ac.uk\/1344\/  \n \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the \njournal article, incorporating any revisions agreed during the peer \nreview process. Some differences between this and the publisher’s \nversion remain. You are advised to consult the publisher’s version \nif you wish to cite from this article. \n \nhttp:\/\/www.elsevier.com \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnora@ceh.ac.uk \n 1\nDifferential response of ectomycorrhizal and saprotrophic fungal mycelium from \nconiferous forest soils to selected monoterpenes \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n \nKatherine E. Ludley 1,2, Clare H. Robinson 2, Sue Jickells 3, Paul M. Chamberlain 1 \nand Jeanette Whitaker 1 \n1 Centre for Ecology and Hydrology, Lancaster Environment Centre, Library Avenue, \nBailrigg, Lancaster, LA1 4AP, UK* \n2 School of Earth, Atmospheric and Environmental Sciences, University of \nManchester, Williamson Building, Oxford Road, Manchester, M13 9PL, UK \n3 Department of Forensic Science and Drug Monitoring, King’s College London, \nFranklin-Wilkins Building, 150 Stamford Street, London, SE1 9NH, UK \n \nAuthor for correspondence: Jeanette Whitaker \nTel: +44 1524 595800 \nFax: +44 1524 61536 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \nEmail: jhart@ceh.ac.uk \n \nResearch paper \nDate of preparation: 17 May 2007 \nDate of revision: 6 Sept 2007 \nNumber of text pages: 24 \nTables: 4 \nFigures: 3 \n \n* address to which proofs should be sent \n \n 2\nAbstract 26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \nThe mycelia of saprotrophic (SP) and ectomycorrhizal (ECM) fungi occur throughout \nthe upper soil horizons in coniferous forests and could therefore be exposed to high \nconcentrations of monoterpenes occurring in the needle litter of some tree species. \nMonoterpenes are mycotoxic and could potentially affect fungi that are exposed to \nthem in the litter layers. In order to investigate whether monoterpenes typical of \nconiferous litters could influence fungal communities, we analysed the monoterpene \ncontent of freshly fallen needles of Pinus sylvestris, Picea abies and Picea sitchensis. \nThe most abundant monoterpenes were found to be α-pinene, β-pinene and 3-carene. \nWe evaluated the effects of these three monoterpene vapours on the biomass \nproduction of 23 SP isolates and 16 ECM isolates. Overall, 75 % of ECM isolates and \n26 % of SP isolates were significantly inhibited by at least one of the monoterpene \ntreatments and both intra- and interspecific variations in response were observed. \nMonoterpene concentrations are highest in surface litters. The differential effects on \nfungal taxa may influence the spatial and temporal distribution of fungal community \ncomposition, indirectly affecting decomposition and nutrient cycling, the fundamental \necosystem processes in which fungi have a key role in coniferous forest soils. \n \nKeywords: monoterpenes, ectomycorrhizal fungi, saprotrophic fungi, community \nstructure, litter layer \n \n1. Introduction \n \nConiferous trees dominate the boreal zone as well as significantly contributing to \nareas of temperate forest. In coniferous trees, monoterpenes, along with \n \n 3\n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n66 \n67 \n68 \n69 \n70 \n71 \n72 \n73 \n74 \n75 \nsesquiterpenes and diterpenes, form the oleoresin that acts as the trees’ defence \nsystem, protecting the tree against herbivory, insect attack and fungal infection. The \nneedles of most coniferous tree species contain high concentrations of monoterpenes. \nThese concentrations can remain relatively high when needles fall from the branches \nand enter the litter layer (Wood et al., 1995; Kainulainen and Holopainen, 2002; \nKainulainen et al., 2003) and their volatility and generally insolubility in water are \nlikely to result in their accumulation in the vapour phase in surface litters (Wilt et al., \n1993a). Monoterpenes have widely reported antibacterial and antifungal properties \n(Payne et al., 2001; Guynot et al., 2003; Hammer et al., 2003; Suhr and Nielsen, \n2003), and their mode of action appears to be through disruption of plasma \nmembranes (Andrews et al., 1980; Trombetta et al., 2005). Monoterpene vapours \naccumulating in litter layers have the potential to equilibrate with lipid membranes \nand, in this way, influence the growth and activity of organisms living in coniferous \nneedle litters. \n \nIn coniferous forests, which tend to be on nutrient-poor and acidic soils, it is the \nfungal community that plays the major role in decomposition and nutrient and carbon \ncycling. The mycelia of both litter-degrading saprotrophic (SP) fungi and \nectomycorrhizal (ECM) fungi occur in the surface litter layer (the L horizon) and the \nunderlying F (fermentation) horizon (O'Brien et al., 2005; Genney et al., 2006; \nLindahl et al., 2007). Some sensitivity to monoterpenes by ECM has been observed in \nprevious studies. Melin and Krupa (1971) suggested that monoterpenes occurring in \nthe roots of coniferous trees are involved in maintaining the symbiotic relationship \nwith their associated fungi. They demonstrated the inhibition of growth of two ECM \nspecies by a range of monoterpenes and proposed that this inhibitive effect enabled \n \n 4\n76 \n77 \n78 \n79 \n80 \n81 \n82 \n83 \n84 \n85 \n86 \n87 \n88 \n89 \n90 \n91 \n92 \n93 \n94 \n95 \n96 \n97 \n98 \n99 \n100 \nthe host tree to control the growth of the fungus. Koide et al. (1998) also demonstrated \nthat pure monoterpene vapours, and dead needles of Pinus resinosa, generally had an \ninhibitory effect on ECM growth.  \n \nWhile the effects of monoterpenes have been tested on a small number of ECM \nisolates in these two earlier studies, so far no studies have been carried out on litter-\ndecomposing SP fungi, which are also present in the upper soil horizons. Differential \neffects on fungal taxa or functional groups could indirectly affect productivity, \ndecomposition rate, and nutrient cycling by influencing fungal community structure. \nMonoterpenes are lost from the litter as the litter ages (Wilt et al., 1993b; Kainulainen \net al., 2003) and therefore will be at their highest concentrations in surface litters. \nDifferential effects of monoterpenes on fungal taxa could therefore also influence the \ntemporal and spatial structure of the fungal community by influencing their \ndistribution through the litter and soil horizons. \n \nThe aim of this study was to test the effects of specific monoterpenes on a wide range \nof isolates of both SP and ECM fungi typical of coniferous forest ecosystems, and to \ndetermine whether there were differences in response between the two functional \ngroups of fungi studied, between individual species, or between different isolates of a \nsingle species (Mycena galopus). The monoterpenes in fresh litters of Pinus sylvestris, \nPicea abies and Picea sitchensis were identified and the most abundant monoterpenes \nselected for testing. The effects of the vapours of single, pure monoterpenes on the \nbiomass production of a range of fungal cultures grown in liquid nutrient medium \nwere evaluated.  \n \n \n 5\n2. Materials and Methods 101 \n102 \n103 \n104 \n105 \n106 \n107 \n108 \n109 \n110 \n111 \n112 \n113 \n114 \n115 \n116 \n117 \n118 \n119 \n120 \n121 \n122 \n123 \n124 \n125 \n \n2.1. Monoterpene analysis \n \nFreshly fallen needles were collected on plastic sheets placed on the forest floor over \na period of approximately eight weeks from monoculture stands of Pinus sylvestris \n(L.), Picea abies (L.) Karst, and Picea sitchensis (Bong.) Carr. at Grizedale Forest, \nCumbria, UK (National Grid Reference SD 345944). For each species, collected \nneedles were pooled and eight samples (approximately 4 g fresh weight) were taken \nfor analysis. Each sample was air-dried for 24 hours at room temperature and then \nhomogenised in an electric coffee mill (Braun Aromatic KSM2) for up to 20 seconds, \nuntil there were no whole needles remaining in the sample. Approximately 0.6 g of \nhomogenised needles from each sample were used for the monoterpene extraction and \nthe remainder of the sample was dried at 105°C for 24 hours to obtain the dry weight \nconversion factor. The fraction of needles used for monoterpene extraction was \nweighed into a clear glass vial and 50 µl of internal standard of 0.5 mg ml-1 \nadamantane (Sigma-Aldrich, Gillingham, Dorset, UK) in hexane was vortex mixed \nwith the needles. The standard was left to equilibrate for 30 min before adding 4 ml of \nhexane, vortex mixing, and placing on a Belly Dancer shaker (Stovall Life Science \nInc., Greensboro., North Carolina, USA) speed setting 5, for 90 min in darkness. The \nextract was then filtered through a 1 cm plug of cotton wool to remove particulate \nmaterial, and analysed by gas chromatography with flame ionisation detection (GC). \nGC analysis was carried out on an Agilent Technologies 6890N gas chromatograph \n(South Queensferry, West Lothian, UK). Samples of 1 μl were injected onto a CP SIL \n5 column with on-column injection (Varian Inc., Walton-on-Thames, UK), column \n \n 6\n126 \n127 \n128 \n129 \n130 \n131 \n132 \n133 \n134 \n135 \n136 \n137 \n138 \n139 \n140 \n141 \n142 \n143 \n144 \n145 \n146 \n147 \n148 \n149 \n150 \nlength 60 m, internal diameter 0.32 mm, film thickness 25 μm. The detector \ntemperature was 350°C, and the carrier gas used was H2 with a flow rate of 40 cm s-1. \nThe oven temperature programme was 50°C for 2 min, ramping at 5°C min-1  to \n115°C and then at 25°C min-1 to 325°C and held for 15 min. \n \nQuantification was achieved by referring to the internal standard, assuming a 1:1 \nresponse for internal standard and extracted monoterpenes. Identification of individual \ncompounds was carried out by comparing retention times with monoterpene standards \n(Sigma-Aldrich, Gillingham, Dorset, UK), and also using gas chromatography-mass \nspectrometry (GC-MS) analysis. GC-MS analysis was carried out on an Agilent \nTechnologies 6890 GC connected to an Agilent 5973N Mass Selective Detector. \nSamples of 1 μl were injected via an on-column inlet onto a DB-1 MS column (J & W \nScientific, USA), length 30 m, internal diameter 0.32 mm, film thickness 0.25 μm. \nThe injector port temperature was 50°C with an oven temperature programme of 50°C \nfor 3 min, ramping at 5 °C min-1 to 100°C and then ramping at 25°C min-1 to 300°C. \nSolvent delay was set at 4 min. Electron impact spectra were acquired at 70 eV and \nthe MS was run in SCAN mode (50- 550 amu at 2.94 scans per second). Data \nprocessing was carried out using HP Chemstation. \n \n2.2. Fungal cultures \n \nThe majority of the ECM and SP cultures used were obtained from the collection of \nJuliet C. Frankland, which is maintained at the Centre for Ecology and Hydrology, \nLancaster. Isolates were also obtained from a collection at the University of Cardiff. \nNew cultures were isolated from basidiome tissue collected in autumn 2003 from \n \n 7\n151 \n152 \n153 \n154 \n155 \n156 \n157 \n158 \n159 \n160 \n161 \n162 \n163 \n164 \n165 \n166 \n167 \n168 \n169 \n170 \n171 \n172 \n173 \n174 \n175 \nGrizedale Forest, Cumbria, UK, and Gisburn Forest, Lancashire, UK (National Grid \nReference SD 750588) from plots of P. sylvestris, P. sitchensis and P. abies. Details \nof individual cultures are given in Table 1. \n \nSP cultures were maintained on Potato Dextrose Agar medium (PDA) (Oxoid, \nHampshire, UK) and ECM cultures were maintained on modified Melin-Norkrans  \nagar medium (MMN).  MMN was made up with 1 l of distilled water containing (g): \n(NH4)HPO4, 0.25; KH2PO4, 0.5; MgSO4.7H2O, 0.15; D-glucose, 10.0; malt extract, \n3.0, Agar Technical Number 3 (Oxoid, Hampshire, UK) 10.15; and (mg) CaCl2.6H2O, \n50; NaCl, 25; thiamine, 0.1, FeEDTA, 16.3; citric acid, 16.3; adjusted to pH 5.5 and \nautoclaved at 121°C for 15 minutes. Cultures were stored in darkness at 20 ± 2°C. \n \n2.3. Preparation of fungal inoculum \n \nPrior to exposure experiments, fungal inocula were prepared by taking three plugs (5 \nmm diameter) from cultures growing on either PDA (SP cultures) or MMN (ECM \ncultures) and placing them in 75 ml of either 3% w\/v malt extract liquid medium \n(MEL) (Sigma-Aldrich, Gillingham, Dorset, UK) or liquid MMN respectively, in \n250 ml Erlenmeyer flasks. Liquid MMN contained per litre of distilled water (g): \n(NH4)HPO4, 0.5 ; KH2PO4, 0.3; MgSO4.7H2O, 0.14; CaCl2.6H2O, 0.05; D-glucose, \n10.0; and (mg) NaCl, 25; ZnSO4, 3.0; thiamine, 0.1; FeEDTA, 37.5; citric acid, 37.5; \nadjusted to pH 5.5.  \n \nAfter four weeks at 20 ± 2°C in darkness, the mycelia from two flasks of each isolate \nwere combined and placed in the sterile cup of a liquidiser with 40 ml of sterile \n \n 8\n176 \n177 \n178 \n179 \n180 \n181 \n182 \n183 \n184 \n185 \n186 \n187 \n188 \n189 \n190 \n191 \n192 \n193 \n194 \n195 \n196 \n197 \n198 \n199 \n200 \ndistilled water and homogenised.  Aliquots (2 ml) of homogenate were used to \ninoculate 23 ml of either MEL or liquid MMN in 100 ml Katz flasks. To the central \nwell of each flask was then added 300 µl of either: filter-sterilised liquid α-pinene, β-\npinene or 3-carene (purity > 95%, Sigma-Aldrich, Gillingham, Dorset, UK). In \ncontrol flasks the central well was left empty. The mean mass of added inoculum was \ndetermined by measuring the dry weight of three replicates of inoculum (2 ml) for \neach isolate. Three replicates of each isolate were prepared for each treatment and \nflasks were sealed with silicon rubber Suba seals (William Freeman Ltd, Barnsley, \nSouth Yorkshire, UK). As the monoterpenes are volatile, the cultures would then be \nexposed to monoterpene vapours in the headspace of the sealed flask.  \n \nDuring the exposure, cultures were incubated at 15°C in darkness and aerated once a \nweek by placing the cultures in a sterile cabinet and replacing the Suba seal with a \nsterile cotton wool bung for 45 min.  After two weeks, the liquid monoterpene \nremaining in the well was removed and replaced with a further 300 µl. Mycelia were \nharvested after six weeks (SP) and eight weeks (ECM) and dry weight biomass was \nmeasured by drying at 105°C for 24 hours. The growth form of each isolate was \nrecorded before harvesting.  \n \nReplicate exposures were carried out, comparing either ECM or SP isolates. One of \nthe experiments compared nine different isolates of the SP fungus M. galopus, \nincluding three isolates of M. galopus var. galopus, three isolates of M. galopus var. \ncandida and three isolates of M. galopus var. nigra. In total, 16 ECM isolates \n(including 13 different species), and 23 SP isolates (14 species) were tested.  \n \n \n 9\n2.4. Measurement of headspace monoterpene concentrations 201 \n202 \n203 \n204 \n205 \n206 \n207 \n208 \n209 \n210 \n211 \n212 \n213 \n214 \n215 \n216 \n217 \n218 \n219 \n220 \n221 \n222 \n223 \n224 \n225 \n \nIn order to estimate the monoterpene concentration in the headspace of the Katz \nflasks, headspace samples of 3 ml were taken through the Suba seal lid from Katz \nflasks set up without fungal inoculum (to avoid contamination of the experimental \nseries of flasks). Samples were taken every two days after monoterpene addition for \nten days and injected directly onto a Perkin Elmer 8500 gas-chromatograph (GC). The \nGC was fitted with a 1.5 ml sample loop with an unheated injector port and oven \ntemperature programme starting at 75°C, held for 1 min and ramped at 5°C min-1 to \n90°C. The column was a 1.8m x 2mm ID packed column (10% AT - 1000 on \nChromosorb W-AW, 80\/100) (Alltech, Carnforth, Lancashire, UK) and data were \nanalysed using Clarity software (DataApex, Prague, Czech Republic). Mixed standard \ngases were of 10 ppm and 60.1 ppm α-pinene and β-pinene in nitrogen (CK Gas \nProducts Ltd, Hook, Hampshire, UK). \n \n2.5. Data analysis \n \nData were analysed using Statistica (V6, StatSoft Inc, Tulsa, OK, USA). The raw \nbiomass data were tested for a normal distribution using the Kolmogorov-Smirnov \ntest for normality and found to be normally distributed. The effects of the three \nmonoterpenes were then analysed for each species separately using analysis of \nvariance (ANOVA), and means were compared between treatments using a post-hoc \nTukey-HSD test. In order to compare the overall response of SP with ECM isolates, \ndata were log transformed before ANOVA. \n \n \n 10\n3. Results 226 \n227 \n228 \n229 \n230 \n231 \n232 \n233 \n234 \n235 \n236 \n237 \n238 \n239 \n240 \n241 \n242 \n243 \n244 \n245 \n246 \n247 \n248 \n249 \n250 \n \n3.1. Monoterpene extractions \n \nIn P. sylvestris the dominant monoterpenes were found to be α-pinene and 3-carene, \nwhich contributed 46% and 37% respectively to the total monoterpene content of \nfreshly fallen litter. In P. abies, α-pinene and β-pinene were clearly dominant, \ncontributing 19% and 56% to the total monoterpene content. The most abundant \nmonoterpene in P. sitchensis litter was limonene, but the total monoterpene \nconcentration was several times lower than the concentrations found in litters of the \nother two species (100 ± 5 μg g-1 dry wt compared with 1531 ± 96 and 1175 ± 122 μg \ng-1 dry wt in P. abies and P. sylvestris respectively, data not shown). Consequently, α-\npinene, β-pinene and 3-carene were chosen for use in exposure experiments. \n \n3.2. Exposure of fungal isolates to monoterpenes \n \nMonoterpene concentrations in the headspace of the flasks remained fairly constant, at \naround 30 mg l-1. In order to compare the relative effects of the monoterpene \ntreatments on different isolates, Figs 1 to 3 present the mean final biomass of each \nisolate exposed to the monoterpene treatments as a percentage of mean final control \nbiomass. Statistical analysis was carried out on raw biomass data, rather than \npercentages, and statistically significant results are shown in Figs 1 to 3. In order to \ncompare growth between the different isolates, final mean control biomass is also \npresented in Tables 2 to 4.   \n \n \n 11\n3.3. Exposure of ECM isolates 251 \n252 \n253 \n254 \n255 \n256 \n257 \n258 \n259 \n260 \n261 \n262 \n263 \n264 \n265 \n266 \n267 \n268 \n269 \n270 \n271 \n272 \n273 \n274 \n275 \n \nTwelve of the 16 ECM isolates tested were significantly inhibited by the presence of \nmonoterpene vapours (Fig. 1).  Amanita muscaria, Amanita rubescens, Cenococcum \ngeophilum, Laccaria laccata, Paxillus involutus, Suillus grevillei, and Thelephora \nterrestris were significantly inhibited by all three monoterpene treatments. Biomass \nproduction of Hebeloma crustuliniforme was significantly inhibited by the 3-carene \nand β-pinene treatments (P<0.05), and Boletus badius was significantly inhibited in \nthe presence of β-pinene (P<0.05).  \n \nThe most severely inhibited species were P. involutus and A. muscaria (P < 0.001 for \nall treatments). Two different isolates were tested for each of these species. Both \nP. involutus isolates had a final mean biomass of less than 20% of control cultures \nunder all treatments. However, biomass of A. muscaria isolate 1 was reduced to \nbetween 11% and 17% of control biomass, while the biomass of isolate 2 varied \nbetween 34% and 51% of control biomass under the monoterpene treatments.  \n \nIn addition to an inhibition of growth, differences in the growth form of some of the \nsensitive isolates were observed. In control cultures of A. muscaria, A. rubescens, P. \ninvolutus and S. grevillei, the mycelium formed a dense mat floating on the surface of \nthe medium, whereas when these isolates were exposed to monoterpenes, little or no \nmycelium grew above the surface. \n \nIn control cultures of C. geophilum (isolate 2 in particular), L. laccata and \nT. terrestris, while there was some mycelium visible growing above the surface of the \n \n 12\n276 \n277 \n278 \n279 \n280 \n281 \n282 \n283 \n284 \n285 \n286 \n287 \n288 \n289 \n290 \n291 \n292 \n293 \n294 \n295 \n296 \n297 \n298 \n299 \n300 \nliquid nutrient medium, a greater proportion of mycelium grew submerged. These \nthree isolates did show significant inhibition under all monoterpene treatments and \nproduced a mean final biomass of between 50% and 64% (C. geophilum isolate 2), \n28% and 54% (L. laccata) and 55% and 66% (T. terrestris) of control biomass under \nthe different monoterpene treatments (Fig. 1). \n \nData for Lactarius rufus were not conclusive because of a high degree of variability in \nthe growth of the control cultures (Table 2). This variability may have been caused by \nsensitivity to the homogenisation procedure as, in fact, only one of the controls for \nL. rufus seemed to produce any new mycelium after inoculation.  \n \nTricholoma aurantium and Amanita vaginata were not significantly affected by any of \nthe monoterpene treatments (Fig. 1, P>0.05). There were no significant differences \nbetween individual monoterpene treatments for any isolates.   \n \n3.4. Exposure of SP isolates \n \nThe SP species generally grew faster than the ECM and were harvested after six \nrather than eight weeks. Only five of the 17 SP isolates tested showed significant \ninhibition by any of the monoterpene treatments (Fig. 2). As was found for the \nexposures of ECM isolates, there were no significant differences in the response of SP \nisolates between individual monoterpene treatments.  \n \n Three SP isolates were significantly inhibited by all three monoterpene treatments \n(Fig. 2); both isolates of Mycena galopus (P<0.05 for all treatments) and Mycena \n \n 13\ngalopus var. candida (P<0.01 for all treatments). Several of the isolates, such as \nMarasmius androsaceus and Cystoderma amianthinum appeared to show reduced \ngrowth in the presence of monoterpenes (Fig. 2) but the reduction was not significant \n(P>0.05). Mycena cinerella also appeared to show reduced growth under all three \nmonoterpene treatments but this was only significant for α-pinene (P<0.05). The \nvariable growth rates of the control cultures of these isolates, grown without \nmonoterpene vapours (Table 3), may explain why such apparent reductions were not \nstatistically significant. Marasmius epiphyllus also showed reduced growth under all \nmonoterpene treatments, although inhibition was only significant under one of the \nmonoterpene treatments (β-pinene, P<0.05), where biomass was approximately 30% \nof control (Fig. 2). For this isolate, there was more variability in growth rate in the \nmonoterpene-treated cultures than in control cultures, which may have contributed to \nthe lack of statistical significance of the apparent reduction in biomass under the other \nmonoterpene treatments.  \n301 \n302 \n303 \n304 \n305 \n306 \n307 \n308 \n309 \n310 \n311 \n312 \n313 \n314 \n315 \n316 \n317 \n318 \n319 \n320 \n321 \n322 \n323 \n324 \n325 \n \nA further experiment was set up to compare nine different isolates of M. galopus. \nThree of the isolates used had already been tested (M. galopus isolate 2, M. galopus \nvar. candida isolate 1 and M. galopus var. nigra isolate 1) and were tested again to see \nwhether results were reproducible. M. galopus isolate 2 had been tested twice before, \nonce showing significant inhibition under all treatments and once showing no \nsignificant inhibition. When it was tested for the third time, with the other M. galopus \nisolates, it was not significantly inhibited by any of the monoterpene treatments (Fig. \n3), and neither were the two new isolates of M. galopus (isolates 3 and 4). There was \na difference in growth between the M. galopus controls, with M. galopus isolate 4 \nappearing to be slower growing than the other two isolates (Table 4). \n \n 14\n326 \n327 \n328 \n329 \n330 \n331 \n332 \n333 \n334 \n335 \n336 \n337 \n338 \n339 \n340 \n341 \n342 \n343 \n344 \n345 \n346 \n347 \n348 \n349 \n350 \n \nOf the three isolates of M. galopus var. candida, only one isolate showed a significant \nresponse to the presence of monoterpenes; the previously tested M. galopus var. \ncandida isolate 1 again showed a significant reduction in biomass in the presence of \nα-pinene (Fig. 3a, P<0.05). Isolate 2 of M. galopus var. nigra showed a significant \ninhibition under all three treatments (Fig. 3, P<0.01). The previously tested M. \ngalopus var. nigra isolate 1 again showed no significant inhibition.  \n \nThe growth form of the SP isolates was also observed before harvesting. While some \nmycelium was visible growing above the surface of the liquid medium for most SP \nisolates, the bulk of the fungal material was always submerged.  \n \n3.5. Comparison of response of ECM with SP isolates \n \nThe overall response of ECM isolates was compared with that of SP isolates using \nANOVA (performed on log-transformed data). A significant interaction between \ntreatment and functional group was detected (P<0.05), with monoterpenes having a \nless inhibitory effect on SP isolates overall than on ECM isolates. \n \n4. Discussion \n \n4.1. Monoterpene extractions \n \nStudies of monoterpene contents of both green and senescent needles of various \nconiferous tree species have been carried out by other authors. The most abundant \n \n 15\nmonoterpenes in green needles of P. sylvestris are consistently α-pinene and 3-carene \n(Sjödin et al., 2000; Kainulainen and Holopainen, 2002). Slightly different \nproportions to those found here were reported in needles of P. sylvestris from Finland, \nwith α-pinene contributing 51% and 3-carene 17% of the total monoterpene content \n(Kainulainen and Holopainen, 2002), compared with 46% and 37% found here. This \ndifference may be due to geographical variation which has been shown to occur \n(Janson, 1993).   \n351 \n352 \n353 \n354 \n355 \n356 \n357 \n358 \n359 \n360 \n361 \n362 \n363 \n364 \n365 \n366 \n367 \n368 \n369 \n370 \n371 \n372 \n373 \n374 \n375 \n \nIn a review collating data on monoterpene emissions from different conifers (Geron et \nal., 2000), α-pinene was found to contribute 45% of total emissions from P. abies and \nβ-pinene 12%. This is similar to the 56% and 19% reported here.  \n \nIn this study, monoterpene concentrations in needles of P. sitchensis were lower than \nin the other two species. Data from the literature indicate comparable monoterpene \nemission concentrations between P. sitchensis and P. abies (Hayward et al. 2004; \nGrabmer et al., 2006), however, needle monoterpene concentrations in P. sitchensis \nhave generally been expressed as percentages of total monoterpenes rather than actual \nconcentrations (e.g. Hrutifiord et al., 1974), thus we have been unable to compare our \nfindings with those of other studies. \n \n4.2. Exposure of fungal isolates to monoterpenes \n \nThe response of both ECM and SP isolates to the presence of monoterpenes common \nin the natural environment was varied, and there was a significant difference in \nresponse between the two functional groups, with SP isolates overall being \n \n 16\n376 \n377 \n378 \n379 \n380 \n381 \n382 \n383 \n384 \n385 \n386 \n387 \n388 \n389 \n390 \n391 \n392 \n393 \n394 \n395 \n396 \n397 \n398 \n399 \n400 \nsignificantly less sensitive than ECM. There was no significant difference between the \neffects of the different monoterpenes. \nOf the ECM isolates tested in this study, 75% were shown to be sensitive to \nmonoterpene vapours when grown in pure liquid culture. In a study by Koide et al. \n(1998), all eight species of ECM that were tested were significantly inhibited by a \nmixture of α-pinene and β-pinene, suggesting that ECM fungi are generally sensitive \nto common monoterpenes. \n \nChanges in the growth pattern of fungal colonies grown on solid nutrient media and \nexposed to α-pinene and β-pinene were observed by Koide et al. (1998). With two \nECM species growing on Hagem agar, Melin and Krupa (1971) also observed, \n“compact restricted colonies with very little or no loose mycelia in the outer section,” \nin fungi exposed to a range of monoterpenes and sesquiterpenes. Corresponding \nchanges were observed in the current study. \n \nSome of the most severely inhibited ECM species were A. muscaria, A. rubescens, P. \ninvolutus and S. grevillei. Control cultures of these species produced a significant \nproportion of their mycelium floating on the surface of the liquid medium. The low \naqueous solubility of monoterpenes may protect mycelium growing below the surface \nof the liquid medium and this may explain why some of the surface growers such as \nP. involutus and A. muscaria were more sensitive. Control cultures of A. vaginata also \ngrew mainly floating on the surface, and although there was a reduction in the \nproportion of mycelium visible above the surface in monoterpene exposed cultures, \nthere was no significant reduction in overall biomass production.  \n \n \n 17\n401 \n402 \n403 \n404 \n405 \n406 \n407 \n408 \n409 \n410 \n411 \n412 \n413 \n414 \n415 \n416 \n417 \n418 \n419 \n420 \n421 \n422 \n423 \n424 \n425 \nThe isolates in this study were exposed to high monoterpene concentrations of up to \n30 mg l-1 in the headspace of the flasks. Actual environmental concentrations of \nmonoterpenes in the air-space of needle litters are difficult to quantify precisely. For \nexample, Paavolainen et al. (1998) measured monoterpenes in soil air by placing \npassive diffusive samplers within the litter, but these gave quantities of monoterpenes \ncollected over an eight week period which are difficult to interpret in terms of actual \nexposure levels. Total monoterpene concentrations in the soil (mineral and litter layer) \natmosphere under P. sylvestris were measured at 106 mg m-3 (0.1 mg l-1) (Smolander \net al., 2006), but concentrations building up in the litter layer itself will be much \nhigher. For example, Wilt et al. (1993a) measured total monoterpene concentrations \nof 3.56 mg l-1 in the air space of a sealed glass vessel filled with Pinus monophylla \nlitter. The experimental concentrations to which the fungal isolates were exposed in \nthe Katz flasks were therefore around ten times the concentration that has been \nmeasured in the air-space of coniferous litter. \n \nThe highest concentrations of monoterpenes occur in surface litters, where \nmonoterpenes are constantly volatilising from freshly fallen needles. As the litter ages \nand becomes incorporated into lower horizons, monoterpenes will virtually disappear \n(Kainulainen and Holopainen, 2002). A number of studies have examined the vertical \ndistribution of fungi through the litter and soil horizons, mostly with regard to ECM \nspecies, and all have demonstrated that certain species will segregate into particular \nhorizons, associated with particular categories of organic matter (Dickie et al., 2002; \nRosling et al., 2003; Tedersoo et al., 2003; Genney et al., 2006; Lindahl et al., 2007).  \nLindahl et al. (2007) found that there was a distinct change in fungal community \ncomposition between the surface litter, or L horizon, consisting of intact needles, and \n \n 18\n426 \n427 \n428 \n429 \n430 \n431 \n432 \n433 \n434 \n435 \n436 \n437 \n438 \n439 \n440 \n441 \n442 \n443 \n444 \n445 \n446 \n447 \n448 \n449 \n450 \nthe lower, more decomposed F horizon. They found that the litter-decomposing SP \nfungi Mycena and Marasmius occupied the L horizon, whereas the mycelium of ECM \nspecies tended to occur in the F horizon. O’Brien et al. (2005) similarly detected \nsequences of Mycena species in the L horizon, while species of Russula were more \nfrequent in the deeper organic horizons and mineral soil.  \n \nThere are many factors that will influence the depth at which different fungal taxa \ntend to occur. These may be associated with substrate quality or with environmental \nconditions that vary according to depth, such as temperature or moisture content \n(Osono et al., 2006). The variation in sensitivity to monoterpenes shown by the taxa \ntested here suggests that there is nevertheless the potential for monoterpenes in the \nlitter layer to be a contributory factor. Our finding, that the litter-decomposing isolates \ntested were less sensitive to monoterpenes than ECM isolates, would correspond with \nthe pattern of distribution observed by Lindahl et al. (2007) and O’Brien et al. (2005), \nwith SP fungi occurring in the layers containing the younger litter material and the \nhighest monoterpene concentrations. \n \nThe intraspecific variation in response shown by M. galopus adds further complexity \nto the possible influence of monoterpenes on fungal community structure. Cairney \n(1999) reviewed studies where multiple isolates of the same ECM taxa were used to \ntest various physiological characteristics. While few studies used more than five \nisolates of any species, it is clear that a large amount of intraspecific physiological \nvariation exists. This variation could be the result of adaptation to conditions in \ndifferent geographical areas, or to more localised heterogeneities (Cairney, 1999). It is \nnot possible from this study to assign the cause of the observed intra-specific variation \n \n 19\n451 \n452 \n453 \n454 \n455 \n456 \n457 \n458 \n459 \n460 \n461 \n462 \n463 \n464 \n465 \n466 \n467 \n468 \n469 \n470 \n471 \n472 \n473 \n474 \n475 \nto adaptation to any specific environmental factors. It is nonetheless important to \nacknowledge that such variability can and does exist and should be taken into account \nin any further studies. \n \nThese exposure experiments were designed to test whether there is likely to be \nsignificant variation in the response of fungi to monoterpenes. It is recognised that the \nuse of liquid culture represents an artificial system, meaning that mycelial growth \nrates and forms and the nature of rhizodeposition are unlikely to reflect those that \noccur in natural substrata. In addition, the actual growth forms of the isolates in liquid \nnutrient medium may have affected their exposure levels, as isolates growing on the \nsurface will have been exposed to higher concentrations of monoterpenes in the \nheadspace of the container. Despite these drawbacks, the results indicate that there is \nconsiderable variation between the species in their sensitivity to monoterpenes, and \nfurther investigation of the effects of monoterpenes on fungi in more realistic \nconditions would be justified.  \n \nAcknowledgements \n \nThis study was funded by a PhD studentship from the Natural Environment Research \nCouncil. We also thank the Forestry Commission for access to field sites at Grizedale \nForest, Cumbria; Dr. Andy Stott of the Life Science Mass Spectrometry Facility at \nCEH Lancaster for GC-MS analysis; Dr Damian P. Donnelly at the University of \nCardiff, and Dr Juliet C. Frankland for fungal isolates; Dr Andy Scott for statistics \nadvice; and all colleagues who helped with field work for this study. \n \n \n 20\nReferences 476 \n477 \n478 \n479 \n480 \n481 \n482 \n483 \n484 \n485 \n486 \n487 \n488 \n489 \n490 \n491 \n492 \n493 \n494 \n495 \n496 \n497 \n498 \n \nAmaral, J.A., Ekins, A., Richards, S.R., Knowles, R.., 1998. Effect of selected \nmonoterpenes on methane oxidation, denitrification, and aerobic metabolism \nby bacteria in pure culture. Applied and Environmental Microbiology 64, 520-\n525. \nAmaral, J.A., Knowles, R.., 1997. Inhibition of methane consumption in forest soils \nand pure cultures of methanotrophs by aqueous forest soil extracts. Soil \nBiology & Biochemistry 29, 1713-1720. \nAmaral, J.A., Knowles, R.., 1998. Inhibition of methane consumption in forest soils \nby monoterpenes. Journal of Chemical Ecology 24, 723-734. \nAndrews, R.E., Parks, L.W., Spence, K.D., 1980. Some effects of Douglas fir terpenes \non certain microorganisms. Applied and Environmental Microbiology 40, 301-\n304. \nCairney, J.W.G., 1999. Intraspecific physiological variation: Implications for \nunderstanding functional diversity in ectomycorrhizal fungi. Mycorrhiza 9, \n125-135. \nDickie, I.A., Xu, B., Koide, R.T., 2002. Vertical niche differentiation of \nectomycorrhizal hyphae in soil as shown by T-RFLP analysis. New \nPhytologist 15, 527-535. \nGenney, D.R., Anderson, I.C., Alexander, I.J., 2006. Fine-scale distribution of pine \nectomycorrhizas and their extramatrical mycelium. New Phytologist 170, 381-\n390. \n \n 21\n499 \n500 \n501 \n502 \n503 \n504 \n505 \n506 \n507 \n508 \n509 \n510 \n511 \n512 \n513 \n514 \n515 \n516 \n517 \n518 \n519 \n520 \n521 \n522 \nGeron, C., Rasmussen, R., Arnts, R.R., Guenther, A., 2000. A review and synthesis of \nmonoterpene speciation from forests in the United States. Atmospheric \nEnvironment 34, 1761-1781. \nGrabmer, W., Kreuzwieser, J., Wisthaler, A., Cojocariu, C., Graus, M., Rennenberg, \nH., Steigner, D., Steinbrecher, R., Hansel, A.,  2006. VOC emissions from \nNorway spruce (Picea abies L. [Karst]) twigs in the field – Results of a \ndynamic enclosure study. Atmospheric Environment 40, S128-S137. \nGuynot, M.E., Ramos, A.J., Seto, L., Purroy, P., Sanchis, V., Marin, S., 2003. \nAntifungal activity of volatile compounds generated by essential oils against \nfungi commonly causing deterioration of bakery products. Journal of Applied \nMicrobiology 94, 893-899. \nHammer, K.A., Carson, C.F., Riley, T.V., 2003. Antifungal activity of the \ncomponents of Melaleuca alternifolia (tea tree) oil. Journal of Applied \nMicrobiology 95, 853-860. \nHayward, S., Tani, A., Owen, S.M., Hewitt, C.N., 2004. Online analysis of volatile \norganic compound emission from Sitka spruce (Picea sitchensis). Tree \nPhysiology 24, 721-728. \nHolubová, V., Hrdlička, P., Kubáň, V., 2001. Age and space distributions of \nmonoterpenes in fresh needles of Picea abies (L) Karst. determined by gas \nchromatography-mass spectrometry. Phytochemical Analysis 12, 243-249. \nHrutfiord, B.F., Hopley, S.M., Gara, R.I.., 1974. Monoterpenes in Sitka spruce: within \ntree and seasonal variation. Phytochemistry 13, 2167-2170. \nJanson R.W., 1993. Monoterpene emissions from Scots pine and Norwegian spruce. \nJournal of Geophysical Research-Atmospheres 98, 2839-2850. \n \n 22\n523 \n524 \n525 \n526 \n527 \n528 \n529 \n530 \n531 \n532 \n533 \n534 \n535 \n536 \n537 \n538 \n539 \n540 \n541 \n542 \n543 \n544 \n545 \n546 \n547 \nKainulainen, P., Holopainen, J.K., 2002. Concentrations of secondary compounds in \nScots pine needles at different stages of decomposition. Soil Biology & \nBiochemistry 34, 37-42. \nKainulainen, P., Holopainen, T., Holopainen, J.K., 2003. Decomposition of secondary \ncompounds from needle litter of Scots pine grown under elevated CO2 and O3. \nGlobal Change Biology 9, 295-304. \nKoide, R.T., Suomi, L., Stevens, C.M., McCormick, L., 1998. Interactions between \nneedles of Pinus resinosa and ectomycorrhizal fungi. New Phytologist 140, \n539-547. \nLin, C., Owen, S.M., Peñuelas, J., 2007. Volatile organic compounds in the roots and \nrhizosphere of Pinus spp. Soil Biology & Biochemistry 39, 951-960. \nLindahl, B.D., Ihrmark, K., Boberg, J., Trumbore, S.E., Högberg, P., Stenlid, J., \nFinlay, R.D., 2007. Spatial separation of litter decomposition and mycorrhizal \nnitrogen uptake in a boreal forest. New Phytologist 173, 611-620. \nMelin, E., Krupa, S., 1971. Studies on ectomycorrhizae of pine II. Growth inhibition \nof mycorrhizal fungi by volatile organic constituents of Pinus silvestris (Scots \npine) roots. Physiologia Plantarum 25, 337-340. \nO'Brien, H.E., Parrent, J.L., Jackson, J.A., Moncalvo, J.M., Vilgalys, R., 2005. Fungal \ncommunity analysis by large-scale sequencing of environmental samples. \nApplied and Environmental Microbiology 71, 5544-5550. \nOsono, T., Hirose, D., Fujimaki, R.., 2006. Fungal colonization as affected by litter \ndepth and decomposition stage of needle litter. Soil Biology & Biochemistry \n38, 2743-2752. \nPaavolainen, L., Kitunen, V., Smolander, A., 1998. Inhibition of nitrification in forest \nsoil by monoterpenes. Plant and Soil 205, 147-154. \n \n 23\n548 \n549 \n550 \n551 \n552 \n553 \n554 \n555 \n556 \n557 \n558 \n559 \n560 \n561 \n562 \n563 \n564 \n565 \n566 \n567 \n568 \n569 \n570 \nPayne, C., Woodward, S., Petty, J.A., 2001. Modification of the growth habit of the \nsoftwood disfiguring fungus Ophiostoma piceae by monoterpene vapors. \nForest Products Journal 51, 89-92. \nRosling, A., Landeweert, R., Lindahl, B.D., Larsson, K.H., Kuyper, T.W., Taylor, \nA.F.S., Finlay, R.D., 2003. Vertical distribution of ectomycorrhizal fungal \ntaxa in a podzol soil profile. New Phytologist 159, 775-783. \nSjödin, K., Persson, M., Fäldt, J., Ekberg, I., Borg-Karlson, A.K., 2000. Occurrence \nand correlations of monoterpene hydrocarbon enantiomers in Pinus sylvestris \nand Picea abies. Journal of Chemical Ecology 26, 1701-1720. \nSmolander, A., Ketola, R.A., Kotiaho, T., Kanerva, S., Suominen, K., Kitunen, V., \n2006.  Volatile monoterpenes in soil atmosphere under Birch and conifers: \nEffects on soil N transformations. Soil Biology & Biochemistry 38, 3436-\n3442.  \nSuhr, K.I., Nielsen, P.V., 2003. Antifungal activity of essential oils evaluated by two \ndifferent application techniques against rye bread spoilage fungi. Journal of \nApplied Microbiology 94, 665-674. \nTedersoo, L., Kõljalg, U., Hallenberg, N., Larsson, K-H., 2003. Fine scale distribution \nof ectomycorrhizal fungi and roots across substrate layers including coarse \nwoody debris in a mixed forest. New Phytologist 159, 153-165. \nTrombetta, D., Castelli, F., Sarpietro, M.G., Venuti, V., Cristani, M., Daniele, C., \nSaija, A., Mazzanti, G., Bisignano, G., 2005. Mechanisms of antibacterial \naction of three monoterpenes. Antimicrobial Agents and Chemotherapy 49, \n2474-2478. \n \n 24\n571 \n572 \n573 \n574 \n575 \n576 \n577 \n578 \n579 \n580 \n581 \n582 \n583 \n584 \nWhite, C.S., 1986. Volatile and water-soluble inhibitors of nitrogen mineralization \nand nitrification in a Ponderosa pine ecosystem. Biology and Fertility of Soils \n2, 97-104. \nWilt, F.M., Miller, G.C., Everett, R.L., 1993a. Measurement of monoterpene \nhydrocarbon levels in vapor-phase surrounding Single-leaf pinyon (Pinus \nmonophylla Torr. and Frem., Pinaceae) understory litter. Journal of Chemical \nEcology 19, 1417-1428. \nWilt, F.M., Miller, G.C., Everett, R.L., Hackett, M., 1993b. Monoterpene \nconcentrations in fresh, senescent, and decaying foliage of Single-leaf pinyon \n(Pinus monophylla Torr. and Frem. - Pinaceae) from the western great-basin. \nJournal of Chemical Ecology 19, 185-194. \nWood, S.E., Gaskin, J.F., Langenheim, J.H. 1995. Loss of monoterpenes from \nUmbellularia californica leaf litter. Biochemical Systematics and Ecology 23, \n581-591.\n \n  \n25\n \n \nFigure 1. Growth of ectomycorrhizal fungal isolates exposed to vapours of (a) α-\npinene, (b) 3-carene and (c) β-pinene. Data are expressed as final biomass dry wt as \n% of control biomass dry wt (mean ± SEM, n=3). Significant difference from \ncontrol, calculated on raw biomass data, is indicated by * (P<0.05), ** (P<0.01) or \n*** (P<0.001), Tukey’s HSD. 1a, Amanita muscaria isolate 1; 1b, Amanita \nmuscaria isolate 2; 2, Amanita rubescens; 3, Amanita vaginata; 4, Boletus badius; \n5a, Cenococcum geophilum isolate 1; 5b, Cenococcum geophilum isolate 2; 6, \nHebeloma crustuliniforme; 7, Laccaria amethystina; 8, Laccaria laccata; 9, \nLactarius rufus; 10a, Paxillus involutus isolate 1; 10b, Paxillus involutus isolate 2; \n11, Suillus grevillei; 12, Thelephora terrestris; 13, Tricholoma aurantium. \n \nFigure 2. Growth of saprotrophic fungal isolates exposed to vapours of (a) α-pinene, \n(b) 3-carene and (c) β-pinene. Data are expressed as final biomass dry wt as % of \ncontrol biomass dry wt (mean ± SEM, n=3). Significant difference from control, \ncalculated on raw biomass data,  is indicated by * (P<0.05), ** (P<0.01) or *** \n(P<0.001), Tukey’s HSD. 1, Collybia butyracea; 2, Collybia maculata; 3, Collybia \nperonata; 4, Cystoderma amianthinum; 5, Marasmius androsaceus; 6, Marasmius \nepiphyllus; 7, Mycena cinerella; 8a, Mycena galopus isolate 1; 8b, Mycena galopus \nisolate 2; 9, Mycena galopus var. candida; 10 Mycena galopus var. nigra; 11, \nMycena purpureofusca; 12, Mycena vulgaris; 13, Mycena epipterygia; 14, Mycena \nrubromarginata; 15, Mycena sanguinolenta; 16, Rickenella fibula. \n \nFigure 3. Growth of different isolates of Mycena galopus exposed to vapours of (a) \nα-pinene, (b) 3-carene and (c) β-pinene. Data are expressed as final biomass dry wt \n 26\nas % of control biomass dry wt (mean ± SEM, n=3). Significant difference from \ncontrol, calculated on raw biomass data,  is indicated by * (P<0.05), ** (P<0.01) or \n*** (P<0.001), Tukey’s HSD. 1, Mycena galopus isolate 2; 2, Mycena galopus \nisolate 3; 3 , Mycena galopus isolate 4; 4, Mycena galopus var. candida isolate 1; 5, \nMycena galopus var. candida isolate 2; 6, Mycena galopus var. candida isolate 3; 7, \nMycena galopus var. nigra isolate 1; 8, Mycena galopus var. nigra isolate 2; 9, \nMycena galopus var. nigra isolate 3. \n \n \n \nTable 1: List of fungal species and isolates tested. Culture code numbers refer to the \nnumber assigned to them in the collection of Dr Juliet C. Frankland unless otherwise \nstated. Where there is no culture code number, cultures were from freshly collected \nbasidiome tissue. \nSpecies Culture code \nnumbers \nSubstrate or tree \nspecies (where \nrecorded) \nDate \nisolated \n(where \nrecorded) \n \nEctomycorrhizal isolates \n   \nAmanita muscaria (L.) Lam.    \nA. muscaria (Isolate 1) \n \nCardiff   \n(A mus 0044) \nUnknown  \n \n1985 \nA. muscaria (Isolate 2) M9120 Unknown 1979 \nAmanita rubescens Pers. Cardiff   \n(Ar 006) \nNo details 1988 \nAmanita vaginata (Bull.) Lam.  P. sylvestris 2003 \nBoletus badius (Fr.) Fr. M10627 Unknown  \nCenococcum geophilum Fr.  \n \n   \nC. geophilum  (Isolate 1)  Cardiff   \n(C geo 014) \nSpruce litter \n \n \nC. geophilum  (Isolate 2) M10630 Unknown 1983 \nHebeloma crustuliniforme (Bull.) Quél. M10640 Unknown 1989 \nLaccaria amethystina Cooke M8002 Unknown 1969 \nLaccaria laccata (Scop.) Cooke  Coniferous forest 2003 \nLactarius rufus (Scop.) Fr.  P. sitchensis 2003 \nPaxillus involutus (Batsch) Fr.     \nP. involutus (Isolate 1)  P. sylvestris 2003 \nP. involutus (Isolate 2)  Coniferous forest 2003 \nSuillus grevillei (Klotzsch) Singer Cardiff   \n(Se 010) \nUnknown  \nThelephora terrestris Ehrh. Cardiff  \n(Thel t 12) \nUnknown 1983 \nTricholoma aurantium (Schaeff.) Ricken M10661 P. sitchensis 1983 \n \nSaprotrophic isolates \n   \nCollybia butyracea (Bull.) P. Kumm. M9269 (b) Mixed woodland litter 1981 \nCollybia maculata (Alb. & Schwein.) P. \nKumm. \nM10277 P. sitchensis litter 1989 \nCollybia peronata (Bolton) P. Kumm. M10330 Unknown 1991 \nCystoderma amianthinum (Scop.) Fayod M9195  P. sitchensis litter 1977 \nMarasmius androsaceus (L.) Fr. M10556 P. sitchensis litter 1998 \nMarasmius epiphyllus (Pers.) Fr. M10263 Mixed woodland litter 1989 \nMycena cinerella (P. Karst) P. Karst M9235 Unknown 1980 \nMycena epipterygia (Scop.) Gray M9083 P. abies litter 1976 \nMycena galopus (Pers.) P. Kumm  \n \n   \nM. galopus (Isolate 1) M10500 P. sitchensis litter 1997 \nM. galopus (Isolate 2) M10501 P. sitchensis litter 1997 \nM. galopus (Isolate 3) M10502 P. sitchensis litter  1997 \nM. galopus (Isolate 4) M10550 P. sitchensis litter 1998 \nM. galopus var. candida J. E. Lange  \n \n   \nM. galopus var. candida (Isolate 1) M10505 P. sitchensis litter 1997 \nM. galopus var. candida (Isolate 2) M9077 P. abies litter 1976 \nM. galopus var. candida (Isolate 3) M10514 P. sitchensis litter 1997 \nM. galopus var. nigra Rea     \nM. galopus var. nigra (Isolate 1) M10504 P. sitchensis litter  1997 \nM. galopus var. nigra (Isolate 2) M9092 P. abies litter 1976 \nM. galopus var. nigra (Isolate 3) M10513 P. sitchensis litter 1997 \nMycena purpureofusca (Peck) Sacc. M9262b P. sylvestris litter 1981 \nMycena rubromarginata (Fr.) P. Kumm M9286 P. sylvestris litter 1981 \nMycena sanguinolenta (Alb. & Schwein) \nP. Kumm. \nM10273 P. sitchensis litter 1989 \nMycena vulgaris (Pers.) P. Kumm. M10280 P. sitchensis litter 1989 \nRickenella fibula (Bull.) Raithelh. M10283 P. sitchensis litter 1989 \n \n \n \n \nTable 2.  Growth (mg dry wt) of ectomycorrhizal isolates from control treatments \nafter 8 weeks in liquid culture medium. Data represent the mean of three replicates (± \nSEM). \nIsolate Control biomass (mg) \nAmanita muscaria 1 82.5   (2.9) \nAmanita muscaria 2 16.3   (3.1) \nAmanita rubescens  18.9   (1.8)  \nAmanita vaginata  32.9   (2.7)  \nBoletus badius  30.7   (5.4)  \nCenococcum geophilum 1 54.0   (8.2) \nCenococcum geophilum 2 47.4   (2.7) \nHebeloma crustuliniforme 25.9   (2.4) \nLaccaria amethystina 42.9   (4.8) \nLaccaria laccata  44.2   (3.7) \nLactarius rufus  25.9 (17.5) \nPaxillus involutus 1 53.4   (9.0) \nPaxillus involutus 2 47.2   (5.9) \nSuillus grevillei 44.4   (1.4) \nThelephora terrestris 24.0   (1.2) \nTricholoma aurantium 57.3   (5.4) \n \nTable 3. Growth (mg dry wt) of saprotrophic isolates from control treatments after 6 \nweeks in liquid culture medium. Data represent the mean of three replicates (± SEM). \nIsolate Control biomass (mg) \nCollybia butyracea    29.6 (17.0) \nCollybia maculata      7.6   (2.5) \nCollybia peronata    53.3   (5.1) \nCystoderma amianthinum    94.1 (39.8) \nMarasmius androsaceus    73.8 (18.7) \nMarasmius epiphyllus    96.4 (10.5) \nMycena cinerella  150.3 (39.4) \nMycena epipterygia    64.2   (5.7) \nMycena galopus 1 130.1   (9.1) \nMycena galopus 2   90.3   (7.7) \nMycena galopus 2   48.9 (10.4) \nM. galopus var. candida 1   63.9   (4.3) \nM. galopus var. nigra 1   47.0   (2.5) \nMycena purpureofusca  110.2 (34.2) \nMycena rubromarginata    27.0   (2.5) \nMycena sanguinolenta   96.8 (23.6) \nMycena vulgaris   50.9 (13.9) \nRickenella fibula   29.9   (3.8) \n \n \nTable 4. Growth (mg dry wt) of saprotrophic Mycena galopus isolates from control \ntreatments after 6 weeks in liquid culture medium. Data represent the mean of three \nreplicates (± SEM). \n \nIsolate Control biomass (mg) \nMycena galopus 2   74.1   (2.6) \nMycena galopus 3 101.8   (8.9) \nMycena galopus 4   39.1 (10.4) \nM. galopus var. candida 1   65.7   (5.7) \nM. galopus var. candida 2   70.2   (6.2) \nM. galopus var. candida 3   71.1   (1.6) \nM. galopus var. nigra 1   67.3   (7.4) \nM. galopus var. nigra 2 113.9   (7.8) \nM. galopus var. nigra 3   87.3   (9.5) \n \n  \n\n\n\n\n\n\nTable 1: List of fungal species and isolates tested. Culture code numbers refer to the \nnumber assigned to them in the collection of Dr Juliet C. Frankland unless otherwise \nstated. Where there is no culture code number, cultures were from freshly collected \nbasidiome tissue. \nSpecies Culture code \nnumbers \nSubstrate or tree \nspecies (where \nrecorded) \nDate \nisolated \n(where \nrecorded) \n \nEctomycorrhizal isolates \n   \nAmanita muscaria (L.) Lam.    \nA. muscaria (Isolate 1) \n \nCardiff   \n(A mus 0044) \nUnknown  \n \n1985 \nA. muscaria (Isolate 2) M9120 Unknown 1979 \nAmanita rubescens Pers. Cardiff   \n(Ar 006) \nNo details 1988 \nAmanita vaginata (Bull.) Lam.  P. sylvestris 2003 \nBoletus badius (Fr.) Fr. M10627 Unknown  \nCenococcum geophilum Fr.  \n \n   \nC. geophilum  (Isolate 1)  Cardiff   \n(C geo 014) \nSpruce litter \n \n \nC. geophilum  (Isolate 2) M10630 Unknown 1983 \nHebeloma crustuliniforme (Bull.) Quél. M10640 Unknown 1989 \nLaccaria amethystina Cooke M8002 Unknown 1969 \nLaccaria laccata (Scop.) Cooke  Coniferous forest 2003 \nLactarius rufus (Scop.) Fr.  P. sitchensis 2003 \nPaxillus involutus (Batsch) Fr.     \nP. involutus (Isolate 1)  P. sylvestris 2003 \nP. involutus (Isolate 2)  Coniferous forest 2003 \nSuillus grevillei (Klotzsch) Singer Cardiff   \n(Se 010) \nUnknown  \nThelephora terrestris Ehrh. Cardiff  \n(Thel t 12) \nUnknown 1983 \nTricholoma aurantium (Schaeff.) Ricken M10661 P. sitchensis 1983 \n \nSaprotrophic isolates \n   \nCollybia butyracea (Bull.) P. Kumm. M9269 (b) Mixed woodland litter 1981 \nCollybia maculata (Alb. & Schwein.) P. \nKumm. \nM10277 P. sitchensis litter 1989 \nCollybia peronata (Bolton) P. Kumm. M10330 Unknown 1991 \nCystoderma amianthinum (Scop.) Fayod M9195  P. sitchensis litter 1977 \nMarasmius androsaceus (L.) Fr. M10556 P. sitchensis litter 1998 \nMarasmius epiphyllus (Pers.) Fr. M10263 Mixed woodland litter 1989 \nMycena cinerella (P. Karst) P. Karst M9235 Unknown 1980 \nMycena epipterygia (Scop.) Gray M9083 P. abies litter 1976 \nMycena galopus (Pers.) P. Kumm  \n \n   \nM. galopus (Isolate 1) M10500 P. sitchensis litter 1997 \nM. galopus (Isolate 2) M10501 P. sitchensis litter 1997 \nM. galopus (Isolate 3) M10502 P. sitchensis litter  1997 \nM. galopus (Isolate 4) M10550 P. sitchensis litter 1998 \nM. galopus var. candida J. E. Lange  \n \n   \nM. galopus var. candida (Isolate 1) M10505 P. sitchensis litter 1997 \nM. galopus var. candida (Isolate 2) M9077 P. abies litter 1976 \nM. galopus var. candida (Isolate 3) M10514 P. sitchensis litter 1997 \nM. galopus var. nigra Rea     \nM. galopus var. nigra (Isolate 1) M10504 P. sitchensis litter  1997 \nM. galopus var. nigra (Isolate 2) M9092 P. abies litter 1976 \nM. galopus var. nigra (Isolate 3) M10513 P. sitchensis litter 1997 \nMycena purpureofusca (Peck) Sacc. M9262b P. sylvestris litter 1981 \nMycena rubromarginata (Fr.) P. Kumm M9286 P. sylvestris litter 1981 \nMycena sanguinolenta (Alb. & Schwein) \nP. Kumm. \nM10273 P. sitchensis litter 1989 \nMycena vulgaris (Pers.) P. Kumm. M10280 P. sitchensis litter 1989 \nRickenella fibula (Bull.) Raithelh. M10283 P. sitchensis litter 1989 \n \n \n \n \nTable 2.  Growth (mg dry wt) of ectomycorrhizal isolates from control treatments \nafter 8 weeks in liquid culture medium. Data represent the mean of three replicates (± \nSEM). \nIsolate Control biomass (mg) \nAmanita muscaria 1 82.5   (2.9) \nAmanita muscaria 2 16.3   (3.1) \nAmanita rubescens  18.9   (1.8)  \nAmanita vaginata  32.9   (2.7)  \nBoletus badius  30.7   (5.4)  \nCenococcum geophilum 1 54.0   (8.2) \nCenococcum geophilum 2 47.4   (2.7) \nHebeloma crustuliniforme 25.9   (2.4) \nLaccaria amethystina 42.9   (4.8) \nLaccaria laccata  44.2   (3.7) \nLactarius rufus  25.9 (17.5) \nPaxillus involutus 1 53.4   (9.0) \nPaxillus involutus 2 47.2   (5.9) \nSuillus grevillei 44.4   (1.4) \nThelephora terrestris 24.0   (1.2) \nTricholoma aurantium 57.3   (5.4) \n \nTable 3. Growth (mg dry wt) of saprotrophic isolates from control treatments after 6 \nweeks in liquid culture medium. Data represent the mean of three replicates (± SEM). \nIsolate Control biomass (mg) \nCollybia butyracea    29.6 (17.0) \nCollybia maculata      7.6   (2.5) \nCollybia peronata    53.3   (5.1) \nCystoderma amianthinum    94.1 (39.8) \nMarasmius androsaceus    73.8 (18.7) \nMarasmius epiphyllus    96.4 (10.5) \nMycena cinerella  150.3 (39.4) \nMycena epipterygia    64.2   (5.7) \nMycena galopus 1 130.1   (9.1) \nMycena galopus 2   90.3   (7.7) \nMycena galopus 2   48.9 (10.4) \nM. galopus var. candida 1   63.9   (4.3) \nM. galopus var. nigra 1   47.0   (2.5) \nMycena purpureofusca  110.2 (34.2) \nMycena rubromarginata    27.0   (2.5) \nMycena sanguinolenta   96.8 (23.6) \nMycena vulgaris   50.9 (13.9) \nRickenella fibula   29.9   (3.8) \n \n \nTable 4. Growth (mg dry wt) of saprotrophic Mycena galopus isolates from control \ntreatments after 6 weeks in liquid culture medium. Data represent the mean of three \nreplicates (± SEM). \n \nIsolate Control biomass (mg) \nMycena galopus 2   74.1   (2.6) \nMycena galopus 3 101.8   (8.9) \nMycena galopus 4   39.1 (10.4) \nM. galopus var. candida 1   65.7   (5.7) \nM. galopus var. candida 2   70.2   (6.2) \nM. galopus var. candida 3   71.1   (1.6) \nM. galopus var. nigra 1   67.3   (7.4) \nM. galopus var. nigra 2 113.9   (7.8) \nM. galopus var. nigra 3   87.3   (9.5) \n \n"}