{"doi":"10.1007\/s10853-010-4241-x","coreId":"140341","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5051","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5051","10.1007\/s10853-010-4241-x"],"title":"Rubber-toughened epoxy loaded with carbon nanotubes: structure-property\nrelationships","authors":["Salinas-Ruiz , Maria del Mar","Skordos, Alexandros A.","Partridge, Ivana K."],"enrichments":{"references":[{"id":37932696,"title":"Carbon nanotube-reinforced epoxy-composites: enhanced stiffness and fracture toughness at low nanotube content.","authors":[],"date":"2004","doi":"10.1016\/j.compscitech.2004.04.002","raw":"Gojny FH, Wichmann MHG, Kopke U, Fiedler B, Schulte K (2004) Carbon nanotube-reinforced epoxy-composites: enhanced stiffness and fracture toughness at low nanotube content. Compos Sci Technol 64(15):2363-71","cites":null},{"id":37932702,"title":"Challenges and opportunities in multifunctional nanocomposite structures for aerospace applications.","authors":[],"date":"2007","doi":"10.1557\/mrs2007.231","raw":"Baur  J,  Silverman  E  (2007)  Challenges  and  opportunities  in  multifunctional  nanocomposite  structures  for  aerospace applications. MRS Bull 32:328-33","cites":null},{"id":37932674,"title":"Cure kinetics modelling of epoxy resins using a non-parametric numerical procedure.","authors":[],"date":"2001","doi":"10.1002\/pen.10777","raw":"Skordos AA, Partridge IK (2001) Cure kinetics modelling of epoxy resins using a non-parametric numerical procedure. Polym Eng Sci 41(5):793-805","cites":null},{"id":37932685,"title":"Cure kinetics, morphology and miscibility of modified DGEBA-based epoxy resin–effects of a liquid rubber inclusion.","authors":[],"date":"2007","doi":"10.1016\/j.polymer.2007.01.018","raw":"Thomas R, Durix S, Sinturel C, Omonov T, Goossens S, Groeninckx G, Moldenaers P, Thomas S (2007) Cure kinetics, morphology and miscibility of modified DGEBA-based epoxy resin–effects of a liquid rubber inclusion. Polymer 48(6):1695-710","cites":null},{"id":37932695,"title":"Deformation and fracture behaviour of a rubber-toughened epoxy. I: microstructure and fracture studies.","authors":[],"date":"1983","doi":"10.1016\/0032-3861(83)90070-8","raw":"Kinloch AJ, Shaw SJ, Tod DA, Hunston DL (1983) Deformation and fracture behaviour of a rubber-toughened epoxy. I: microstructure and fracture studies. Polymer 24:1341-54","cites":null},{"id":37932703,"title":"Development of a dispersion process for carbon nanotubes in an epoxy matrix and the resulting electrical properties.","authors":[],"date":"1999","doi":"10.1016\/s0032-3861(99)00166-4","raw":"Sandler J, Shaffer MSP, Prasse T, Bauhofer W, Schulte K, Windle AH (1999) Development of a dispersion process for carbon nanotubes in an epoxy matrix and the resulting electrical properties. Polymer 40(21):5967-71","cites":null},{"id":37932709,"title":"Effect of brominated bisphenol A on the cure, morphology and properties of epoxy\/CTBN blends.","authors":[],"date":"1995","doi":null,"raw":"Partridge IK, Maistros, GM (1995) Effect of brominated bisphenol A on the cure, morphology and properties of epoxy\/CTBN blends. Plast Rubber Compos Process Appl 23(5):325-30","cites":null},{"id":37932683,"title":"Formation of percolating networks in multi-wall carbon-nanotube–epoxy composites.","authors":[],"date":"2004","doi":"10.1016\/j.compscitech.2004.01.025","raw":"Martin CA, Sandler JKW, Shaffer MSP, Schwarz MK, Bauhofer W, Schulte K, Windle AH (2004) Formation of percolating networks in multi-wall carbon-nanotube–epoxy composites. Compos Sci Technol 64(15):2309-16","cites":null},{"id":37932679,"title":"Functionalisation effect on the thermo-mechanical behaviour of multi-wall carbon nanotube\/epoxy-composites.","authors":[],"date":"2004","doi":"10.1016\/j.compscitech.2004.01.024","raw":"Gojny  FH,  Schulte  K  (2004)  Functionalisation  effect  on  the  thermo-mechanical  behaviour  of  multi-wall  carbon nanotube\/epoxy-composites. Compos Sci Technol 64(15):2303-08","cites":null},{"id":37932691,"title":"Fundamental aspects of nano-reinforced composites.","authors":[],"date":"2006","doi":"10.1016\/j.compscitech.2005.01.014","raw":"Fiedler B, Gojny FH, Wichmann MHG, Nolte CM, Schulte K (2006) Fundamental aspects of nano-reinforced composites. Compos Sci Technol 66(16):3115-25","cites":null},{"id":37932675,"title":"Glass Transitions of mesophase macromolecules.","authors":[],"date":"1956","doi":null,"raw":"Fox TG (1956) Glass Transitions of mesophase macromolecules. Bull Am Phys Soc 1(2):123-9","cites":null},{"id":37932681,"title":"In: Riew CK, Kinloch AJ (eds) Toughened plastics 1: science and engineering. Adv Chem Ser 233, Am Chem Soc,","authors":[],"date":"1993","doi":"10.1021\/ba-1993-0233.ch001","raw":"Huang Y, Hunston DL, Kinloch A J, Riew CK (1993) In: Riew CK, Kinloch AJ (eds) Toughened plastics 1: science and engineering. Adv Chem Ser 233, Am Chem Soc, Washington DC","cites":null},{"id":37932687,"title":"Influence of different carbon nanotubes on the mechanical properties of epoxy matrix composites–a comparative study.","authors":[],"date":"2005","doi":"10.1016\/j.compscitech.2005.04.021","raw":"Gojny  FH,  Wichmann,  MHG,  Fiedler  B,  Schulte  K  (2005)  Influence  of  different  carbon  nanotubes  on  the  mechanical properties of epoxy matrix composites–a comparative study. Compos Sci Technol 65(15-16):2300-13","cites":null},{"id":37932708,"title":"Influence of particle size and particle size distribution on toughening mechanisms in rubbermodified epoxies.","authors":[],"date":"1991","doi":"10.1007\/bf01184979","raw":"Pearson RA, Yee AF (1991) Influence of particle size and particle size distribution on toughening mechanisms in rubbermodified epoxies. J Mater Sci 26(14):3828-44","cites":null},{"id":37932668,"title":"Miscibility of epoxy monomers with carboxyl-terminated butadiene-acrylonitrile random copolymers.","authors":[],"date":"1989","doi":"10.1016\/0032-3861(89)90391-1","raw":"Verchère D, Sautereau H, Pascault JP, Moschiar SM, Riccardi CC, Williams RJJ (1989) Miscibility of epoxy monomers with carboxyl-terminated butadiene-acrylonitrile random copolymers. Polymer 30(1):107-15","cites":null},{"id":37932672,"title":"Monitoring dispersion of carbon nanotubes in a thermosetting polyester resin.","authors":[],"date":"2009","doi":"10.1016\/j.compscitech.2008.05.012","raw":"Battisti A, Skordos AA, Partridge IK (2009) Monitoring dispersion of carbon nanotubes in a thermosetting polyester resin. Compos Sci Technol 69(10):1516-20","cites":null},{"id":37932706,"title":"Nanocavitation in self-assembled amphiphilic block copolymer-modified epoxy.","authors":[],"date":"2008","doi":"10.1021\/ma801037q","raw":"Liu J, Sue HJ, Thompson ZJ, Bates FS, Dettloff M, Jacob G, Vergese N, Pham H (2008) Nanocavitation in self-assembled amphiphilic block copolymer-modified epoxy. Macromolecules 41(20):7616-24","cites":null},{"id":37932707,"title":"Notched impact behaviour of polymer blends: Part 1: new model for particle size dependence.","authors":[],"date":"2009","doi":"10.1016\/j.polymer.2009.09.059","raw":"Bucknall CB, Paul DR (2009) Notched impact behaviour of polymer blends: Part 1: new model for particle size dependence. Polymer 50(23):5539-48","cites":null},{"id":37932689,"title":"Reaction-induced phase separation in modified thermosetting polymers. In:","authors":[],"date":"1997","doi":"10.1007\/3-540-61218-1_7","raw":"Williams RJJ, Rozenberg BA, Pascault JP (1997) Reaction-induced phase separation in modified thermosetting polymers. In: Koenis JL (ed) Adv Polym Sci128, Springer, Berlin","cites":null},{"id":37932677,"title":"Surfactant-assisted processing of carbon nanotube\/polymer composites.","authors":[],"date":"2000","doi":"10.1021\/cm9906396","raw":"Gong  X,  Liu  J,  Baskaran  S,  Voise  RD,  Young  JS  (2000)  Surfactant-assisted  processing  of  carbon  nanotube\/polymer composites. Chem Mater 12(4):1049-52","cites":null},{"id":37932670,"title":"The effect of silica nano particles and rubber particles on the toughness of multiphase thermosetting epoxy polymers.","authors":[],"date":"2005","doi":"10.1007\/s10853-005-1716-2","raw":"Kinloch AJ, Mohammed RD, Taylor AC, Eger C, Sprenger S, Egan D (2005) The effect of silica nano particles and rubber particles on the toughness of multiphase thermosetting epoxy polymers. J Mater Sci 40(18):5083-5086","cites":null},{"id":37932666,"title":"Thermal behaviour of single-walled carbon nanotube polymer-matrix composites.","authors":[],"date":"2006","doi":"10.1016\/j.compositesa.2005.04.009","raw":"Xu  Y,  Ray  G,  Abdel-Magid B  (2006)  Thermal  behaviour  of  single-walled  carbon  nanotube  polymer-matrix  composites. Compos A 37(1):114-21","cites":null},{"id":37932665,"title":"Thermal contraction of carbon fullerenes and nanotubes.","authors":[],"date":"2004","doi":"10.1103\/physrevlett.92.015901","raw":"Kwon YK, Berber S, Tomanek D (2004) Thermal contraction of carbon fullerenes and nanotubes. Phys Rev Lett 92(1):1-4","cites":null},{"id":37932705,"title":"Toughening behaviour of rubber-modified thermoplastic polymer involving very small rubber particles 2. rubber cavitation behaviour in poly(vinyl chloride) methyl methacrylate-butadiene-styrene graft copolymer blends.","authors":[],"date":"1994","doi":"10.1016\/0032-3861(94)90728-5","raw":"Dompas  D,  Groenickx  G,  Isogawa  M,  Hasegawa  T,  Kadokura  M  (1994)  Toughening  behaviour  of  rubber-modified thermoplastic polymer involving very small rubber particles 2. rubber cavitation behaviour in poly(vinyl chloride) methyl methacrylate-butadiene-styrene graft copolymer blends. Polymer 35(22):4750-59","cites":null},{"id":37932694,"title":"Toughening mechanisms in elastomer-modified epoxies. Part 2–microscopy studies.","authors":[],"date":"1986","doi":"10.1007\/bf01114294","raw":"Pearson RA, Yee AF (1986) Toughening mechanisms in elastomer-modified epoxies. Part 2–microscopy studies. J Mater Sci 21(7):2475-88","cites":null},{"id":37932704,"title":"Toughening mechanisms of nanoparticle-modified epoxy polymers.","authors":[],"date":"2007","doi":"10.1016\/j.polymer.2006.11.038","raw":"Johnsen BB, Kinloch AJ, Mohammed RD, Taylor AC, Sprenger S (2007) Toughening mechanisms of nanoparticle-modified epoxy polymers. Polymer 48(2):530-41","cites":null},{"id":37932693,"title":"Ultra-low electrical percolation threshold in carbonnanotube-epoxy composites.","authors":[],"date":"2003","doi":"10.1016\/s0032-3861(03)00539-1","raw":"Sandler JKW, Kirk JE, Kinloch IA, Shaffer MSP, Windle AH (2003) Ultra-low electrical percolation threshold in carbonnanotube-epoxy composites. Polymer 44(19):5893-9","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-05-01T00:00:00Z","abstract":"The paper reports on the preparation, structure and properties of ternary\nthermosetting blends, based on DGEBA epoxy, cured with 3,3′-DDS and modified by\nthe addition of CTBN reactive liquid rubber and\/or 0.3wt% of commercial multi-\nwalled carbon nanotubes. The toughening effect of the phase-separated rubber\nparticles is enhanced by the presence of the nanotubes, through a change in the\nmorphology. In the absence of the rubber, the nanotubes alone produce a minimal\neffect upon the thermo-mechanical characteristics of the resin. However, the\nelectrical conductivity of the cured resin samples is found to increase by five\norders of magnitude, up to 3.6×10-3 S\/m in the ternary bl","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140341.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1007\/s10853-010-4241-x","pdfHashValue":"863287448c574542daf0570a90c36388f1c94583","publisher":"Springer Science   Business Media","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5051<\/identifier><datestamp>2011-07-13T09:25:00Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Rubber-toughened epoxy loaded with carbon nanotubes: structure-property\nrelationships<\/dc:title><dc:creator>Salinas-Ruiz , Maria del Mar<\/dc:creator><dc:creator>Skordos, Alexandros A.<\/dc:creator><dc:creator>Partridge, Ivana K.<\/dc:creator><dc:description>The paper reports on the preparation, structure and properties of ternary\nthermosetting blends, based on DGEBA epoxy, cured with 3,3′-DDS and modified by\nthe addition of CTBN reactive liquid rubber and\/or 0.3wt% of commercial multi-\nwalled carbon nanotubes. The toughening effect of the phase-separated rubber\nparticles is enhanced by the presence of the nanotubes, through a change in the\nmorphology. In the absence of the rubber, the nanotubes alone produce a minimal\neffect upon the thermo-mechanical characteristics of the resin. However, the\nelectrical conductivity of the cured resin samples is found to increase by five\norders of magnitude, up to 3.6×10-3 S\/m in the ternary ble<\/dc:description><dc:publisher>Springer Science   Business Media<\/dc:publisher><dc:date>2011-07-12T12:01:56Z<\/dc:date><dc:date>2011-07-12T12:01:56Z<\/dc:date><dc:date>2010-05-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Maria d. M. Salinas-Ruiz, Alex A. Skordos, Ivana K. Partridge, Rubber-toughened epoxy loaded with carbon nanotubes: structure-property\nrelationships, Journal of Materials Science, Volume 45, Number 10, May 2010, Pages 2633-2639<\/dc:identifier><dc:identifier>0022-2461<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1007\/s10853-010-4241-x<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5051<\/dc:identifier><dc:language>en_UK<\/dc:language><dc:rights>The original publication is available at www.springerlink.com<\/dc:rights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0022-2461","issn:0022-2461"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article"],"fullText":" 1 \nRubber toughened epoxy loaded with carbon nanotubes: \nstructure – property relationships \nMaria d. M. Salinas-Ruiz\n*\n, Alex A. Skordos, Ivana K. Partridge \nCranfield University, Composites Centre, Department of Materials, Bedfordshire, \nMK43 0AL, UK \nAbstract \nThe paper reports on the preparation, structure and properties of ternary thermosetting \nblends, based on DGEBA epoxy, cured with 3,3’-DDS and modified by the addition of \nCTBN reactive liquid rubber and\/or 0.3 wt% of commercial multiwalled carbon \nnanotubes. The toughening effect of the phase separated rubber particles is enhanced by \nthe presence of the nanotubes, through a change in the morphology. In the absence of \nthe rubber, the nanotubes alone produce a minimal effect upon the thermo-mechanical \ncharacteristics of the resin. However, the electrical conductivity of the cured resin \nsamples is found to increase by five orders of magnitude, up to 3.6 x10\n-3\n S\/m in the \nternary blend. \n \nKeywords: Carbon nanotubes; Epoxy resin; Rubber toughening; Phase separation; \nMorphology; Electrical conductivity \n1. Background \nThis paper reports a fundamental study of hitherto little studied ternary epoxy based \nblends, containing a commercial rubbery modifier and commercial carbon nanotubes. \nThe context of the original study was the identification of possible means to minimise \nthe thermal residual stresses usually created in the manufacture of adhesively bonded \naluminium-to-composite joints, such as structural elements of current aerospace \nstructures. A model adhesive was formulated for 120ºC cure, with the intention of \nidentifying the critical parameters in terms of processability and performance, in pursuit \nof the aim. Commercial multi-walled carbon nanotubes were included in the adhesive as \nthey were believed to be capable of reducing the coefficient of thermal expansion of the \n                                                          \n* Corresponding author. Tel.: +44 11 7331 5503; fax: +44 11 7927 2771;  \n  E-mail address: m.salinas-ruiz@bristol.ac.uk  \n \n 2 \nresin [1,2]. The accompanying expected increase in the thermal and electrical \nconductivity was considered to be of secondary importance to the intended application. \nA commercial rubbery adduct was used to toughen the resin [3,4] to the level expected \nin relevant commercial adhesive systems. This paper focuses on the description of the \nmicrostructures of the cured resin blends and their thermo-mechanical, mechanical and \nelectrical properties in the solid state. \n2.  Material composition, preparation and thermo-analytical characterisation \nThe epoxy resin was a standard diglycidyl ether of bisphenol-A (DGEBA), (Araldite \nMY750, Huntsman; 182 g\/eq epoxide equivalent weight), cured with 34 wt% of a solid \naromatic diamine, 3,3’-diamino diphenyl sulphone (3,3’-DDS, Aldrich) and accelerated \nwith 1 wt% boron trifluoride-monoethylamine (BF3-MEA, Chemos GmbH). The rubber \nwas a carboxyl-terminated butadiene-acrylonitrile (CTBN) rubber (Hypro CTBN \n1300x8, Emerald Performance Materials; 18% acrylonitrile content) which has been \npre-reacted with DGEBA resin to give a 40 wt% CTBN-epoxy adduct, (HyPox RA840, \nEmerald Performance Materials; 340 g\/eq epoxide equivalent weight) (Fig. 1). The \nadduct was employed to lead to a concentration of 5 wt% CTBN rubber in the final \nproduct. In the formulations containing the rubber adduct the amount of DDS was \nreduced so as to maintain the chemical stoichiometry of the base resin matrix. \n \n \nFig. 1. CTBN-epoxy adduct. \nThe multi-walled carbon nanotubes (MWCNTs) (NC-7000, Nanocyl) were added to \nthe epoxy resin to achieve a concentration of 0.3 wt% in the final composite. As \nproduced, the carbon nanotubes are highly entangled (Fig. 2), with a diameter in the \nregion of 10 nm and length ranging from 0.1 to 10 m. The mixture of carbon \nnanotubes and epoxy (without hardener) was stirred at 100ºC for 1 hour at 3000 rpm \nusing a high shear mixer (Dispermat CN10-F2); the mixture was then ultrasonicated, via \na digital sonicator horn (Branson S-450D), operating at a frequency of 20 kHz, with \nmaximum power setting of 400W. The sonication energy input was determined by the \n 3 \nneed to hold the temperature at between 97 and 103 ºC in order to maintain the relatively \nlow viscosity [5]. The total specific energy input was 1.2 kJ\/g.   \n \nFig. 2. Scanning electron micrograph (FEG-SEM) of NC-7000 multi-walled carbon nanotubes, as \nsupplied, showing a highly-entangled structure. \nThe sonicated suspension was degassed, transferred back to the high shear mixer, \nmixed with the CTBN-epoxy adduct for 30 minutes at 3000 rpm and then with the \nhardener and the accelerator for another 30 minutes at 3000 rpm. During the stirring in \nof these constituents the mixture was kept under vacuum at 80ºC. Differential scanning \ncalorimetry confirms that no significant cure reaction occurs in these systems at this \ntemperature. \nA shorthand nomenclature is used for identification of the samples. C is the \nabbreviation for the control formulation alone, CR for the control with rubber \nformulation, CN for the control with carbon nanotubes formulation and finally, CRN \ndenotes the control formulation containing both rubber and carbon nanotubes. \nFlat plaques of thicknesses between 3 and 6 mm were cast from all the formulations, \nin waxed glass moulds with metal inserts, after thorough degassing. They were cured in \nan air oven under partial vacuum. The curing cycle was 6 hours at 120ºC for all the \nformulations, which was believed to be well in excess of the time required to achieve \ncomplete cure at this temperature – see Fig. 3. \n 4 \n \nFig. 3. Conversion versus cure time at 120ºC, in the first 100 minutes. Conversion was determined by \ndifferential scanning calorimetry experiments, giving total reaction enthalpies as 449 and 380 J\/g for CR \nand CRN formulations respectively. Conversion was determined using a horizontal integration baseline, \nmethod described fully in [6]. \n2.1. Conversion and glass transition temperature, Tg \nThe glass transition temperatures, determined by modulated differential scanning \ncalorimetry (MDSC) measurements on cured samples, at a heating rate of 1ºC\/min and \nwith temperature modulation of 1ºC and period of 60 seconds, only varied between 133 \nand 134ºC for all the various formulations. Despite the prolonged cure at 120ºC, these \nsamples were found to have reached final conversion levels of between only 73 and \n75%. The rates of crosslinking in the early stages of cure in the base resin appeared \nunchanged by the presence of the nanotubes, which agrees with previous (unpublished) \nobservations in our laboratory. However, all the blended samples exhibited great \nsensitivity to any increase in cure temperature above 120ºC, in that significant post-cure \ndrifts in the glass transition temperature were observed in experiments carried out by \ndynamic mechanical analysis. The 120ºC cure does not drive the reaction to chemical \ncompletion, even after 6 hours, in any of the formulations. Post-cure can thus be \nexpected when the solid samples are heated above this temperature and to be more \npronounced in the CNT-containing samples. Post-cure experiments were carried out to \ndetermine the ultimate achievable Tg values in these systems and the results from \nMDSC measurements are shown in Table 1. To get stable values of Tg it was necessary \nto post-cure the samples at 200ºC for 80 minutes; this is far above any intended \npractical application of such blends but is probably an indication of the extent of \ndiffusional limitations on the final stages of cure. \n \nTable 1 \n0\n0.2\n0.4\n0.6\n0.8\n1\n0 20 40 60 80 100\nCure time (min)\nC\no\nn\nv\ne\nrs\nio\nn\n, \nCR\nCRN\n 5 \nCompositions of the formulations employed and thermal analysis data, with ranges \na\n \nSample \nCTBN     \ncontent (wt%) \nMWCNTs \ncontent (wt%) \nTg (ºC) \nMDSC \nCTE  \n(10\n-6\n K\n-1\n) \nTg (ºC) \nMDSC, after post-cure \nC 0 0 133 ± 1 51.93 ± 0.03 163 ± 1 \nCR 5 0 134 ± 1 52.11 ± 0.39 158 ± 1 \nCN 0 0.3 133 ± 1 51.84 ± 1.01 165 ± 1 \nCRN 5 0.3 134 ± 1 51.62 ± 0.77 162 ± 1 \na \nCTE values obtained from samples that were not post-cured \n \nThe fully cured samples exhibit a slight drop in Tg consequent on the incorporation of \nthe rubber – this is as expected in a phase separated system in which a very small \nproportion of the rubber remains dissolved within the continuous epoxy phase. Using \nthe well known Fox equation [7], the amount of rubber that has not phase separated and \nremains dissolved in the epoxy is estimated to be a very low proportion (~ 2 %) of the \ntotal rubber added.  \nIn contrast, the incorporation of the nanotubes results in a very slight increase in the \nfinal Tg of the resin, as previously noted by other authors [8,9]. The combination of the \neffects means that the final achievable Tg in the CRN blend is indistinguishable from \nthat achievable in the initial control resin.  \n2.2. Coefficient of thermal expansion \nThe thermal expansion coefficients of cured specimens were measured using a \nthermal mechanical analyzer (TA Instruments 2940). Rectangular specimens of 5×5×10 \nmm were used (BS ISO 11359-2). After placing the specimen in the cell, the linear \ndimension of the sample was monitored from –50ºC to 100ºC at a heating rate of \n1ºC\/min. A slow cooling and reheating cycle was used in order to remove the effect of \nany initial residual stresses in the polymer and the thermal expansion coefficients were \nobtained from the second heating cycle, from the slope of the extension versus \ntemperature curve in the temperature range of interest. The values at room temperature \nwere determined from an average of three specimens and are shown in Table 1. The \ndifferences in the values for the specimens tested here cannot be considered significant, \nin the room temperature region or indeed any other region between –50ºC and 100ºC. In \nthis respect the inclusion of the nanotubes fails to deliver on the initial promise of \nproperty modification. \n 6 \n3. Balance of mechanical properties \nFlexural tests were performed using the three-point bending configuration at a \ncrosshead speed of 1 mm\/min according to the BS ISO178 test standard. The \ndimensions of the specimens were 3×15×80 mm for C and CR formulations and \n2×12×60 mm for CN and CRN formulations. The span to thickness ratio L\/D was set at \n16 for all the formulations. The stress-strain dependence was linear and the flexural \nmodulus Ef was determined in the region between 5% and 25% flexural strain in the \nbeam, as an average from five specimens, as shown in Table 2. \nThe compression yield stress, yc was obtained from uniaxial compression testing of \nsix 3×5×6 mm specimens using a crosshead speed of 0.6 mm\/min (BS ISO604), see \nTable 2. The compression test fixture used was a 10 kN rated Instron compression cage. \nThis test jig is self aligning in that the movable cross-head moves downwards, \ncompressing the specimen between two parallel plate faces as shown in Fig. 4a. No \nlubricating agent was used on the specimen surfaces and the experiments were stopped \nbefore any global buckling or barrelling had occurred. The stress-strain curves showed a \nclear yield point, taken as the maximum engineering stress. The post-yield strain \nsoftening observed in these samples (Fig. 4b) is recognised as an essential pre-requisite \nof a toughenable thermosetting system [10]. \n \nFig. 4. (a) Compression cage, with a schematic of specimen loading (not to scale) (b) Stress- displacement \ncurves under compression loading, for C and CRN samples. \nSpecimen\na)\n0\n40\n80\n120\n160\n0 0.2 0.4 0.6 0.8\nDisplacement (mm)\nc\n (\nM\nP\na\n)\nC\nCRN\nb)\n 7 \nThe fracture toughness (KIC) and fracture energy (GIC) were determined according to \nthe BS ISO 13586 test standard. The values were taken from an average of five single \nedge-notched bending (SENB) specimens measuring 4×15×80 mm for the C and CR \nformulations and 3×12×60 mm for the CN and CRN formulations. The notch on the \nspecimen edge was machined to a depth of at least 40% of the specimen width. Prior to \ntesting, a sharper notch was introduced by tapping a pristine razor blade into the base of \nthe machined notch. The new notch depth was between 45% and 55% of the specimen \nwidth. For all the formulations the specimens were tested in a three point bend \nconfiguration using a span four times greater than the specimen width and a crosshead \nspeed of 10 mm\/min. Visual inspection of the fracture surfaces revealed no air bubbles; \nthe C and CN specimens exhibited a mirror fracture surface whilst the fracture of the \nCR and CRN samples resulted in a slightly matt fracture surface but without any \nnoticeable whitening. The fracture toughness results obtained are summarized in Table \n2. The aromatic nature of the hardener limits the toughenability of the system, compared \nto more conventional rubber toughened epoxies. \n \nTable 2 \nMechanical properties of the cured samples, with standard deviations\n b \nSample \nKIC  \n(MPa  m\n0.5\n) \nEf \n(GPa) \nyc \n(MPa) \nC 0.8 ± 0.1 3.4 ± 0.1 141 ± 1 \nCR 1.1 ± 0.1 2.9 ± 0.1 114 ± 2 \nCN 0.9 ± 0.1 3.2 ± 0.1 141 ± 1 \nCRN 1.3 ± 0.1 2.7 ± 0.1 113 ± 2 \nb \nProperties obtained from samples that were not post-cured \n4. Electrical properties of cured samples \nRectangular specimens of 4×12×30 mm were used to measure DC electrical \nresistivity. The cross-sectional areas were painted with silver paint to provide good \ncontact. Electrodes were connected to the test specimens on both sides and two-terminal \nDC resistance measurements were performed using a 6517A Keithley electrometer, \ntypically used for high resistance materials. The resistance of the formulations \ncontaining carbon nanotubes, CN and CRN, were obtained using a combination of a \nprecision current source (6220 Keithley Instruments) and a nanovoltmeter (2182A \nKeithley Instruments) appropriate for lower measuring ranges. The values reported in \n 8 \nTable 3 were taken after 1 minute of voltage application, determined on five specimens. \nThe AC electrical response of the materials was investigated using a Solartron SI 1260 \nfrequency response analyser. Twenty-seven frequencies in the 1 Hz to 3.16 MHz range \nwere swept on a logarithmic scale using an excitation voltage of 1 V. The conductivity, \nwhich was calculated as:  \n*\nd\nf\nZ f S\n \n \nwhere d  is the thickness, S  the area and fZ *  the complex impedance, is illustrated as \na function of frequency in Fig. 5. The base formulations follow a pure capacitive \nbehaviour with the characteristic slope of unity in the conductivity versus frequency \nlog-log plots. In contrast, the nanocomposites show a frequency independent \nconductivity, characteristic of ohmic behaviour. This behaviour, which is typically \nobserved in nanotube-epoxy composites with nanotubes forming a conductive network \n[11], is maintained up to a certain inflection frequency over which a transition to a \ndielectric response occurs. The AC spectra can be used for the evaluation of the DC \nproperties using the plateau conductivity observed at low frequencies for \nnanocomposites. The values obtained are identical to the DC measurements reported in \nTable 3. \n \nTable 3 \nDirect current electrical conductivities of the formulations in a solid state, with standard deviations\n b \nSample \n(S\/m) \nC < 10\n-9\n \nCR 3.2 x10\n-9\n ± 1.1 x10\n-9\n \nCN 1.6 x10\n-3\n ± 2.3 x10\n-4\n \nCRN 3.6 x10\n-3\n ± 3.2 x10\n-4\n \nb\n Properties obtained from samples that were not post-cured \n 9 \n \nFig. 5. AC conductivity spectra for the base formulations and for the nanocomposites. The close-up graph \nat the bottom shows detail of the response of nanocomposites at the higher frequencies. \n5. Structure – property relationships \nScanning electron microscopy (SEM) was used to examine cryo-fracture surfaces of \nthe samples. The samples containing rubber were etched in toluene for 2.5 hours at \nambient temperature in order to extract the dispersed rubber phase [12]. \nFig. 6a-b shows SEM micrographs of the cryo-fracture surfaces of the formulations \ncontaining nanotubes; CN and CRN. In these images the bright dots are the ends of \ncarbon nanotubes. Qualitative investigation of a large number of similar micrographs \nreveals the carbon nanotubes homogeneously dispersed, without any large \nagglomerates. The presence of the nanoparticles reflects itself in a significantly \nincreased roughness of the fracture surface surrounding the CNTs, as previously noted \nby other authors [13]. \n \n1.0E-10\n1.0E-08\n1.0E-06\n1.0E-04\n1.0E-02\n1.0E+00\n0 1 2 3 4 5 6 7\nFrequency (Hz)\nC\no\nn\nd\nu\nc\nti\nv\nit\ny\n (\nS\n\/m\n)\nC CR\nCN CRN\nSee close-up below\n10\n-10\n-8\n-6\n-4\n10\n-2\n0\n1.0E-03\n1.0E-02\n4 5 6 7\nFrequency (Hz)\nC\no\nn\nd\nu\nc\nti\nv\nit\ny\n (\nS\n\/m\n) C CR\nCN CRN\n10\n-2\n-3\n 10 \n \n \nFig. 6. Scanning electron micrographs (FEG-SEM) of cryo-fracture surfaces for (a) CN and (b) etched \nCRN. \nAll the formulations containing rubber displayed a two-phase morphology with an \nepoxy rigid continuous phase and a dispersed rubbery phase of isolated spherical \nparticles. The nanotubes are believed to be associated with the epoxy phase, but \npresence of nanotubes within some rubbery particles cannot be discounted. On these \nmicrographs only the imprints of the (cavitated and subsequently etched out) rubber \nparticles are visible. The darker round holes indicate some porosity in the samples, but \nthis is not significantly higher than might be expected in any cured epoxy sample. \nThe important information to be gained from Fig. 7a-b is the change in the \ndistribution and sizes of the precipitated rubber particles for the CR and CRN \nformulations respectively. Whilst difficult to quantify, the mean size of the rubber \nparticles was demonstrably larger in the CR formulation than in the CRN sample. This \ndecrease in size with the addition of the carbon nanotubes is thought to be associated \n 11 \nwith the increase in viscosity of the system caused by the dispersed nanotubes, which \nwould inhibit the growth of the rubbery domains in the pre-gel phase [14]. The \npossibility of particle nucleation being enhanced by the nanotubes cannot be discounted, \nbut has not been demonstrated. \n \n \nFig. 7. Scanning electron micrographs (FEG-SEM) of etched fracture surfaces for (a) CR and (b) CRN. \nIt is thought that the high starting viscosity of the CRN mixture is beneficial in \nmaintaining the quality of the CNT dispersion, by preventing the re-agglomeration \nduring cure that is otherwise often observed in thermosetting nanocomposites [15,16]. \nIn terms of the mechanical performance (see Table 2), the addition of the relatively \nlow modulus, rubber–rich particles to the base formulation results in a reduction in the \nflexural modulus of 15%. This is as expected in rubber toughened epoxies [3,17,18], \nwhereas no stiffening effect of nanotubes has been found [19]. The compressive yield \n 12 \nstrength is reduced by the addition of rubber, again as expected; inclusion of carbon \nnanotubes shows no effect. \nIn the notched fracture tests, there is a small, but measurable increase in the stress \nintensity factor upon the addition of rubber to the control formulation. The addition of \nnanotubes alone shows no significant effect. However, the inclusion of nanotubes and \nrubber in the formulation provides a further increase in KIC, over 10% above the value \nobtained when rubber is used alone. This synergistic effect on toughening is seen more \nclearly in the data shown in Fig. 8. In this particular system, the increase in fracture \nenergy is accompanied by an increase in the electrical conductivity, giving the solid \nCRN samples an attractive overall balance of properties. \n \nFig. 8. Fracture energy, GIC, and electrical conductivity of the formulations employed. \nFuture aerospace applications may require electrically conductive, polymer-based \ncomposites for static discharge, electrical bonding, interference shielding, primary and \nsecondary power and current return through the structure [20]. Good electrical bonding \nof a joint is needed to assist in controlling and dissipating the build-up of electrostatic \ncharge. Commercial adhesives exist that have been filled with high amounts (up to 60% \nby volume) of powdered silver, nickel or carbon black to achieve electrical \nconductivity. Unfortunately such additives make the adhesive weaker. The very high \nconductivity of carbon nanotubes makes them excellent candidates for the production of \nconductive epoxy adhesives, capable of dissipating electro-static charge build-up [21], \nand the present work shows that the required conductivity levels can be achieved \nwithout a compromise in the mechanical performance. \nThe most notable effect found in this study is the reduction of the mean rubber \nparticle size in the rubber toughened epoxy samples also containing carbon nanotubes. \n0\n100\n200\n300\n400\n500\n600\nC CR CN CRN C CR CN CRN\nG\nIC\n (\nJ\n\/m\n2\n)\n0.E+00\n1.E-03\n2.E-03\n3.E-03\n4.E-03\nC\no\nn\nd\nu\nc\nti\nv\nit\ny\n (\nS\n\/m\n)\nGIc\nConductivity\n<1 x10\n-9\n<1 x10\n-8\nIC\n x10\n-3\n x10\n-3\n x10\n-3\n4 x10\n-3\n 13 \nThe only other ternary nanocomposites system studied in the context of adhesives \npreparation, an anhydride cured epoxy, uses silica nanoparticles with CTBN rubber and \nno effects on phase separation are reported [22]. However, it should be noted that the \nsilica nanoparticles have little effect upon the viscosity of the system, unlike the carbon \nnanotubes used in this study. The toughening mechanism in the silica particle ternary \nsystem is debonding of the silica nanoparticles accompanied by cavitation within the \nepoxy matrix.  \nThe smaller rubber particles in the present CRN formulation are still large enough to \nbe capable of cavitating under the triaxial stress field at the crack tip [23,24] and would \ntherefore be expected to be contributing to toughening by initiating shear yielding in the \nsurrounding matrix, which is the conventional mechanism of epoxy rubber toughening. \nIn the absence of quantified morphology information, namely the volume fractions of \nsmall and large particles, it is not practical to use existing rubber cavitation theories [25] \nto estimate the expected toughening contributions in the different systems. There is no \nspecific evidence that a high proportion of small rubber particles is generally beneficial \nto the toughness of a rubber modified epoxy, but there have been reports of beneficial \neffects of a bimodal particle size distribution in such systems [26,27]. It is therefore \npossible that the carbon nanotubes have a positive effect on the toughness of a ternary \nblend, not by the creation of any new toughening mechanisms, but by indirectly \nenhancing the overall contribution of the existing, highly efficient, toughening \nmechanisms.  \n6. Conclusions \nThe thermosetting ternary blends of epoxy, CTBN rubber and commercial carbon \nnanotubes, characterised in the present study, show that it is possible to achieve \nsignificant electrical conductivity at a low level of inclusion of CNTs and without a \ncompromise in the thermo-mechanical performance of the adhesive. The good overall \nbalance of properties is believed to be associated with the specific morphology of these \nsystems, providing an efficient toughening mechanism as well as a conductive network. \nAcknowledgments \n 14 \nThe work reported here was co-sponsored by EPSRC via a Speculative Research in \nEngineering award EP\/C 509730 and by a Cranfield University IMRC project on \n‘Bonded Crack Retarders’, supported by Airbus UK, Alcoa Inc. (USA) and Cytec \nEngineered Materials. \nReferences \n[1] Kwon YK, Berber S, Tomanek D (2004) Thermal contraction of carbon fullerenes and nanotubes. Phys Rev Lett 92(1):1-4 \n[2] Xu Y, Ray G, Abdel-Magid B (2006) Thermal behaviour of single-walled carbon nanotube polymer-matrix composites. \nCompos A 37(1):114-21 \n[3] Verchère D, Sautereau H, Pascault JP, Moschiar SM, Riccardi CC, Williams RJJ (1989) Miscibility of epoxy monomers with \ncarboxyl-terminated butadiene-acrylonitrile random copolymers. Polymer 30(1):107-15 \n[4] Kinloch AJ, Mohammed RD, Taylor AC, Eger C, Sprenger S, Egan D (2005) The effect of silica nano particles and rubber \nparticles on the toughness of multiphase thermosetting epoxy polymers. J Mater Sci 40(18):5083-5086 \n[5] Battisti A, Skordos AA, Partridge IK (2009) Monitoring dispersion of carbon nanotubes in a thermosetting polyester resin. \nCompos Sci Technol 69(10):1516-20 \n[6] Skordos AA, Partridge IK (2001) Cure kinetics modelling of epoxy resins using a non-parametric numerical procedure. Polym \nEng Sci 41(5):793-805 \n[7]    Fox TG (1956) Glass Transitions of mesophase macromolecules. Bull Am Phys Soc 1(2):123-9  \n[8] Gong X, Liu J, Baskaran S, Voise RD, Young JS (2000) Surfactant-assisted processing of carbon nanotube\/polymer \ncomposites. Chem Mater 12(4):1049-52 \n[9] Gojny FH, Schulte K (2004) Functionalisation effect on the thermo-mechanical behaviour of multi-wall carbon \nnanotube\/epoxy-composites. Compos Sci Technol 64(15):2303-08 \n[10]  Huang Y, Hunston DL, Kinloch A J, Riew CK (1993) In: Riew CK, Kinloch AJ (eds) Toughened plastics 1: science and \nengineering. Adv Chem Ser 233, Am Chem Soc, Washington DC \n[11] Martin CA, Sandler JKW, Shaffer MSP, Schwarz MK, Bauhofer W, Schulte K, Windle AH (2004) Formation of percolating \nnetworks in multi-wall carbon-nanotube–epoxy composites. Compos Sci Technol 64(15):2309-16 \n[12] Thomas R, Durix S, Sinturel C, Omonov T, Goossens S, Groeninckx G, Moldenaers P, Thomas S (2007) Cure kinetics, \nmorphology and miscibility of modified DGEBA-based epoxy resin–effects of a liquid rubber inclusion. Polymer 48(6):1695-\n710 \n[13] Gojny FH, Wichmann, MHG, Fiedler B, Schulte K (2005) Influence of different carbon nanotubes on the mechanical \nproperties of epoxy matrix composites–a comparative study. Compos Sci Technol 65(15-16):2300-13 \n[14] Williams RJJ, Rozenberg BA, Pascault JP (1997) Reaction-induced phase separation in modified thermosetting polymers. In: \nKoenis JL (ed) Adv Polym Sci128, Springer, Berlin \n[15] Fiedler B, Gojny FH, Wichmann MHG, Nolte CM, Schulte K (2006) Fundamental aspects of nano-reinforced composites. \nCompos Sci Technol 66(16):3115-25 \n[16] Sandler JKW, Kirk JE, Kinloch IA, Shaffer MSP, Windle AH (2003) Ultra-low electrical percolation threshold in carbon-\nnanotube-epoxy composites. Polymer 44(19):5893-9  \n[17] Pearson RA, Yee AF (1986) Toughening mechanisms in elastomer-modified epoxies. Part 2–microscopy studies. J Mater Sci \n21(7):2475-88  \n[18] Kinloch AJ, Shaw SJ, Tod DA, Hunston DL (1983) Deformation and fracture behaviour of a rubber-toughened epoxy. I: \nmicrostructure and fracture studies. Polymer 24:1341-54 \n[19] Gojny FH, Wichmann MHG, Kopke U, Fiedler B, Schulte K (2004) Carbon nanotube-reinforced epoxy-composites: enhanced \nstiffness and fracture toughness at low nanotube content. Compos Sci Technol 64(15):2363-71 \n[20] Baur J, Silverman E (2007) Challenges and opportunities in multifunctional nanocomposite structures for aerospace \napplications. MRS Bull 32:328-33 \n[21] Sandler J, Shaffer MSP, Prasse T, Bauhofer W, Schulte K, Windle AH (1999) Development of a dispersion process for carbon \nnanotubes in an epoxy matrix and the resulting electrical properties. Polymer 40(21):5967-71  \n[22] Johnsen BB, Kinloch AJ, Mohammed RD, Taylor AC, Sprenger S (2007) Toughening mechanisms of nanoparticle-modified \nepoxy polymers. Polymer 48(2):530-41  \n[23] Dompas D, Groenickx G, Isogawa M, Hasegawa T, Kadokura M (1994) Toughening behaviour of rubber-modified \nthermoplastic polymer involving very small rubber particles 2. rubber cavitation behaviour in poly(vinyl chloride) methyl \nmethacrylate-butadiene-styrene graft copolymer blends. Polymer 35(22):4750-59 \n[24] Liu J, Sue HJ, Thompson ZJ, Bates FS, Dettloff M, Jacob G, Vergese N, Pham H (2008) Nanocavitation in self-assembled \namphiphilic block copolymer-modified epoxy. Macromolecules 41(20):7616-24 \n[25] Bucknall CB, Paul DR (2009) Notched impact behaviour of polymer blends: Part 1: new model for particle size dependence. \nPolymer 50(23):5539-48 \n[26] Pearson RA, Yee AF (1991) Influence of particle size and particle size distribution on toughening mechanisms in rubber-\nmodified epoxies. J Mater Sci 26(14):3828-44 \n[27] Partridge IK, Maistros, GM (1995) Effect of brominated bisphenol A on the cure, morphology and properties of epoxy\/CTBN \nblends. Plast Rubber Compos Process Appl 23(5):325-30 \n"}