{"doi":"10.1017\/S096025850818727X","coreId":"61147","oai":"oai:nora.nerc.ac.uk:6848","identifiers":["oai:nora.nerc.ac.uk:6848","10.1017\/S096025850818727X"],"title":"On the use of fungicides in ecological seed burial studies","authors":["Mitschunas, Nadine","Filser, Juliane","Wagner, Markus"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-03","abstract":"Evidence for effects of saprophytic fungi on buried seed demography is usually obtained from studies involving the simultaneous burial of fungicide-treated seeds and of untreated seeds. However, any potential influence of fungicide treatment on seed dormancy levels is generally ignored in these studies. Also, some studies assume that a combination of several fungicidal compounds provides better protection against a broader range of fungi, ignoring chemical interactions that may potentially occur between different compounds. To investigate these issues, we carried out a six-month burial experiment using seeds of Anthriscus sylvestris (L.) Hoffm., Centaurea nigra L., and Daucus carota L., and three substrates differing in organic matter content. Three fungicidal compounds, captan, iprodione, and mancozeb, were applied alone and in combination, including an untreated control. All fungicidal compounds and combinations thereof provided protection against fungal-induced seed mortality, and except for a low efficacy of iprodione in protecting seeds of Anthriscus, there were no pronounced differences in seed mortality between different fungicide treatments. Captan temporarily inhibited germination in Centaurea, whereas a similar inhibition in Daucus seeds caused by mancozeb was more long-lasting, suggesting an induction of secondary dormancy. Organic matter content only had a negligible influence on these results. Our results suggest that the basic conclusions from most seed burial studies are robust with respect to their choice of fungicide. We conclude by discussing further implications of our findings for the design and interpretation of seed burial studies","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/61147.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/6848\/2\/MitschunasN006848PP.pdf","pdfHashValue":"656f4fceec3ce325e7258f24294c21d3472e1c45","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:6848<\/identifier><datestamp>\n      2014-07-30T11:22:28Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D5336<\/setSpec><setSpec>\n      7375626A656374733D5332<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/6848\/<\/dc:relation><dc:title>\n        On the use of fungicides in ecological seed burial studies<\/dc:title><dc:creator>\n        Mitschunas, Nadine<\/dc:creator><dc:creator>\n        Filser, Juliane<\/dc:creator><dc:creator>\n        Wagner, Markus<\/dc:creator><dc:subject>\n        Botany<\/dc:subject><dc:subject>\n        Agriculture and Soil Science<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        Evidence for effects of saprophytic fungi on buried seed demography is usually obtained from studies involving the simultaneous burial of fungicide-treated seeds and of untreated seeds. However, any potential influence of fungicide treatment on seed dormancy levels is generally ignored in these studies. Also, some studies assume that a combination of several fungicidal compounds provides better protection against a broader range of fungi, ignoring chemical interactions that may potentially occur between different compounds. To investigate these issues, we carried out a six-month burial experiment using seeds of Anthriscus sylvestris (L.) Hoffm., Centaurea nigra L., and Daucus carota L., and three substrates differing in organic matter content. Three fungicidal compounds, captan, iprodione, and mancozeb, were applied alone and in combination, including an untreated control. All fungicidal compounds and combinations thereof provided protection against fungal-induced seed mortality, and except for a low efficacy of iprodione in protecting seeds of Anthriscus, there were no pronounced differences in seed mortality between different fungicide treatments. Captan temporarily inhibited germination in Centaurea, whereas a similar inhibition in Daucus seeds caused by mancozeb was more long-lasting, suggesting an induction of secondary dormancy. Organic matter content only had a negligible influence on these results. Our results suggest that the basic conclusions from most seed burial studies are robust with respect to their choice of fungicide. We conclude by discussing further implications of our findings for the design and interpretation of seed burial studies.<\/dc:description><dc:date>\n        2009-03<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/6848\/1\/N006848PP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Mitschunas, Nadine; Filser, Juliane; Wagner, Markus.  2009  On the use of fungicides in ecological seed burial studies.   Seed Science Research, 19 (01). 51-60.  https:\/\/doi.org\/10.1017\/S096025850818727X <https:\/\/doi.org\/10.1017\/S096025850818727X>     \n <\/dc:identifier><dc:relation>\n        http:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=3646964<\/dc:relation><dc:relation>\n        10.1017\/S096025850818727X<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/6848\/","http:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=3646964","10.1017\/S096025850818727X"],"year":2009,"topics":["Botany","Agriculture and Soil Science","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \n \n \nArticle (refereed) \n \n \n \nMitschunas, Nadine; Filser, Juliane; Wagner, Markus. 2009 \nOn the use of fungicides in ecological seed burial studies. \nSeed Science Research, 19. 51-60. \n10.1017\/S096025850818727X \n \n \n \n \n \n \n \nCopyright © Cambridge University Press 2009 \n \nThis version available at http:\/\/nora.nerc.ac.uk\/6848\/  \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the \njournal article, incorporating any revisions agreed during the peer \nreview process. Some differences between this and the publisher’s \nversion remain. You are advised to consult the publisher’s version \nif you wish to cite from this article. \n \nhttp:\/\/journals.cambridge.org\/ \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnora@ceh.ac.uk \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \nOn the use of fungicides in ecological seed burial studies \n \nNadine Mitschunas1,*, Juliane Filser1 and Markus Wagner2 \n \n \n1 University of Bremen, UFT Centre of Environmental Research and Technology, Dept. 10 - \nGeneral und Theoretical Ecology, Leobener Str., 28359 Bremen, Germany \n2 NERC Centre of Ecology and Hydrology Wallingford, Wallingford, UK \n \n*Current and corresponding address: \nNadine Mitschunas; Department of Landscape, University of Sheffield, Arts Tower, Western \nBank, Sheffield S10 2TN, U.K (Email: nadinemi@web.de) \n \n \nRunning title: Fungicide use in ecological seed burial studies \n \n \n \n \n \n \n \n \n \n \n \n 1\nAbstract 27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \nEvidence for effects of saprophytic fungi on buried seed demography is usually obtained from \nstudies involving the simultaneous burial of fungicide-treated seeds and of untreated seeds. \nHowever, any potential influence of fungicide treatment on seed dormancy levels is generally \nignored in these studies. Also, some studies assume that a combination of several fungicidal \ncompounds provides better protection against a broader range of fungi, ignoring chemical \ninteractions that may potentially occur between different compounds. To investigate these \nissues, we carried out a six-month burial experiment using seeds of Anthriscus sylvestris (L.) \nHoffm., Centaurea nigra L., and Daucus carota L., and three substrates differing in organic \nmatter content. Three fungicidal compounds, captan, iprodione, and mancozeb, were applied \nalone and in combination, including an untreated control. All fungicidal compounds and \ncombinations thereof provided protection against fungal-induced seed mortality, and except \nfor a low efficacy of iprodione in protecting seeds of Anthriscus, there were no pronounced \ndifferences in seed mortality between different fungicide treatments. Captan temporarily \ninhibited germination in Centaurea, whereas a similar inhibition in Daucus seeds caused by \nmancozeb was more long-lasting, suggesting an induction of secondary dormancy. Organic \nmatter content only had a negligible influence on these results. Our results suggest that the \nbasic conclusions from most seed burial studies are robust with respect to their choice of \nfungicide. We conclude by discussing further implications of our findings for the design and \ninterpretation of seed burial studies. \n \n \nKey Words \ndormancy, fungal attack, fungicide treatment, mortality, seed burial experiments, seed \nlongevity, soil organic matter content \n \n 2\nIntroduction 53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n66 \n67 \n68 \n69 \n70 \n71 \n72 \n73 \n74 \n75 \n76 \n77 \n78 \nThe effects of saprophytic soil fungi on the longevity of buried seeds have been investigated \nfor many different plant species from a wide range of different ecosystems with experiments \ninvolving the simultaneous burial of untreated seeds and of seeds treated with fungicides \n(Fellows and Roeth, 1992; Lonsdale, 1993; Dalling et al., 1998; Leishman et al., 2000; \nGallandt et al., 2004) The results underline that fungal-induced seed mortality can greatly \naffect seed demography. \nHowever, methodological aspects are usually given little consideration in such seed \nburial studies. One notable exception is the study by Van Mourik et al. (2005) which \ndemonstrated that the density of seeds buried in seed bags can markedly affect rates of fungal-\ninduced seed mortality. However, there are at least three other methodological aspects that \nwould in our opinion also merit methodological consideration. First, it is known that \nfungicides can directly affect live plants even in the absence of the targeted fungi (Paul et al., \n1989; Laird and Addicott 2008), and as outlined further below, the same may also apply to the \nseed stage of plants. Second, fungicide efficacy can crucially depend on soil characteristics \nsuch as soil organic matter content (Goring, 1967), although individual fungicides will be \naffected differently by such characteristics (Lopes et al., 2002; Andrades et al., 2004). \nFinally, different fungicides, due to their different modes of action, tend to have specific \neffects on particular fungal taxonomic groups (Paul et al., 1989), and are therefore often \ncombined to protect live plants against a wider range of fungal pathogens (Gisi, 1996). Such a \ncombination of fungicides can sometimes also result in unexpected synergistic or antagonistic \neffects on fungal pathogens (Scardavi, 1966; Gisi, 1996), and there is also the possibility of \nunexpected changes in phytotoxicity (Backman, 1978). This third aspect may also deserve \nmore consideration in the context of seed burial studies. Several fungal phyla contain \nsaprophytic genera with the potential to harm seeds (Schafer and Kotanen, 2004), and this \nprovides a motivation for combining several of these fungicides to achieve protection of seeds \n 3\nagainst a wider range of fungi (Leishman et al., 2000). This assumption of a combination of \nfungicides providing a more comprehensive protection against fungal-induced seed decay has \nhowever not yet been experimentally verified. On the contrary, it also seems possible that \ndifferent fungicides used together in a mixture may chemically interact with each other in a \nway that could negatively affect their efficacy as seed protectants. Combining different \nfungicides may even result in toxic effects on seeds similar to those observed for particular \nfungicide-insecticide combinations (Gange et al., 1992). \n79 \n80 \n81 \n82 \n83 \n84 \n85 \n86 \n87 \n88 \n89 \n90 \n91 \n92 \n93 \n94 \n95 \n96 \n97 \n98 \n99 \n100 \n101 \n102 \n103 \n104 \nSimilar to the above stated known direct effects on live plants, fungicides can also \nhave direct effects on seeds. It is known from in vitro experiments using crop seeds that \nfungicide treatment can affect germination rates, either by inhibiting or by promoting seed \ngermination (Clark and Scott, 1982; Simmen and Gisi, 1995; Hartz and Caprile, 1995). The \nsame mechanisms can also affect the timing of crop seedling emergence in the field (Smiley \net al., 1996). \nTo explore these various methodological aspects in a full factorial randomized block \nexperiment, we treated the seeds of three grassland plant species with up to three different \nfungicidal compounds alone and in combination, and buried them in three different substrates \nrepresenting a gradient in soil organic matter content. The following three main questions \nwere addressed: (1) Do treatments that combine more than one fungicide result in a greater \nreduction in seed mortality, compared to treatments that use just one fungicidal compound? \n(2) Do fungicides, alone or in combination with each other, have an influence on the readiness \nof seeds to germinate when exposed to conditions that are favourable to germination, i.e. are \ndormancy levels influenced by the fungicide treatments? (3) Do these fungicide effects on \nreadiness to germinate and on seed mortality depend on soil organic matter content? \n \nMaterial and Methods \n \n 4\n105 \n106 \n107 \n108 \n109 \n110 \n111 \n112 \n113 \n114 \n115 \n116 \n117 \n118 \n119 \n120 \n121 \n122 \n123 \n124 \n125 \n126 \n127 \n128 \n129 \n130 \nField site \nThe burial experiment was carried out in unmanaged ruderal grassland adjacent to the Centre \nfor Environmental Research and Technology (UFT) of University of Bremen, Germany (53° \n05' N, 8° 48' E). The topsoil at this site consists of almost pure sand, with an average pH of \n5.2 and an organic matter content of 1.1 % (Mitschunas et al., 2008). Mean annual mean \ntemperature and total precipitation, based on the period 1991-2005, are 9.5°C and 713 mm \n(Deutscher Wetterdienst, 2008).  \n \nMaterials \nWe used seeds of Anthriscus sylvestris (L.) Hoffm., Centaurea nigra L., and Daucus carota \nL., (nomenclature follows Jäger and Werner, 2002), three grassland species characterised by \nshort-term seed bank persistence between one and five years (Thompson et al., 1997). \nWe used three different fungicidal compounds in our experiment. Two of these \ncompounds, captan and iprodione, have been used previously in ecological seed burial \nexperiments, with captan being very regularly employed in such experiments (Wagner and \nMitschunas, 2008). The third compound, mancozeb, has been recommended for seed \ntreatment (Sinha et al., 1988), although it has not been used previously in the context of \necological seed burial studies. Both captan and iprodione are dicarboximide fungicides, \nwhereas mancozeb is a dithiocarbamate fungicide. Captan is considered very effective against \nseed-rotting fungi (Neergaard 1979), and in an agricultural context it is mainly used against \npathogens from the phylum Ascomycota (Whitehead 1998). By contrast, both iprodione and \nmancozeb are more widely used not only against Ascomycota but also against a wide range of \npathogenic Basidiomycota and Oomycetes (Whitehead 1998), the latter group now being \nrecognized as being taxonomically distinct from the true fungi (Deacon, 2006). \nAs in many previous studies (e.g. Blaney and Kotanen, 2001; O’Hanlon-Manners and \nKotanen 2004a; Orrock and Damschen, 2005; Van Mourik et al., 2005), seed bags filled with \n 5\n131 \n132 \n133 \n134 \n135 \n136 \n137 \n138 \n139 \n140 \n141 \n142 \n143 \n144 \n145 \n146 \n147 \n148 \n149 \n150 \n151 \n152 \n153 \n154 \n155 \n156 \na mixture of soil and seeds were buried. Our seed bags were made of 7 cm × 7 cm pieces cut \nfrom nylon stockings. To establish a gradient of soil organic matter content in the seed \nenvironment, we used the local topsoil and a green waste compost (pH 5.7) from a local \nsupplier (Kübel-und Pflanzerde; Kompostierung Nord GmbH, Bremen, Germany) as base \nmaterials to create three different substrates. These were pure topsoil, pure green waste \ncompost, and a 1:1 volume-ratio mixture of both materials. \n \nExperimental set-up \nPrior to the experiment, all three substrates were passed through a sieve of 5.0 mm mesh \nwidth. To control for known effects of soil fauna on fungal-induced seed mortality, a sub-\nsample of each substrate, used for filling the seed bags, was subsequently passed through a \n1.0 mm sieve and then defaunated by 24 h freezing at -20 °C, followed by 24 h at room \ntemperature and another 48 h at -20 °C (Mitschunas et al., 2006). \nEach seed bag was filled with 4 ml of respective defaunated substrate and a total of 75 \nseeds (= 25 seeds per species), and then tied up with sewing thread. To ensure recognition of \nindividual treatments at the end of the experiment, each bag was marked using colour-coded \npieces of cord. Prior to burial at the field site, the mesh bags from the fungicide treatments \nwere immersed in fungicide solutions prepared from three different fungicidal compounds on \ntheir own or in combination. \nThese fungicide solutions were prepared on 20 December 2006 by dissolving specific \nquantities of each fungicide at 20°C in 1000 cm³ of distilled water. We used 10g of Merpan \n80 WDG (active compound: captan 80% w\/w; Feinchemie Schwebda GmbH, Eschwege, \nGermany) for the captan solution, 0.8 g of Rovral 75WG (ac tive compound: iprodione 75% \nw\/w; BASF AG, Ludwigshafen, Germany) for the iprodione solution, and 2 g of Dithane \nNeoTec (active compound: mancozeb 75% w\/w; Spiess-Urania Chemicals GmbH, Hamburg, \nGermany) for the mancozeb solution. For iprodione and mancozeb, these concentrations \n 6\n157 \n158 \n159 \n160 \n161 \n162 \n163 \n164 \n165 \n166 \n167 \n168 \n169 \n170 \n171 \n172 \n173 \n174 \n175 \n176 \n177 \n178 \n179 \n180 \n181 \ncorresponded with the recommendations made by the manufacturers for soil application. The \nconcentration of captan was the same as in previous seed burial experiments (Blaney and \nKotanen, 2001; O’Hanlon-Manners and Kotanen, 2004a; Kotanen 2007). \nWe did not reduce the concentrations of individual fungicidal compounds when \npreparing the mixtures, as there was no indication for such a course of action from previous \nseed burial experiments employing mixtures of different fungicides. Instead, we dissolved the \nsame quantity of each individual fungicide compound when preparing 1000 cm³ of mixture \nsolutions as was used for preparing single-compound solutions. We also included a control \ntreatment in which mesh bags were immersed in water prior to burial, and thus had all eight \npossible different fungicide combinations, ranging from no fungicide at all to the combination \nof all three fungicides. In combination with the three levels of soil organic matter content, this \nresulted in 24 different treatments. We immersed six replicate seed bags per treatment, i.e. a \ntotal of 144 seed bags in the respective solutions on the same day as the fungicide solutions \nwere prepared. Bags were immersed for fifteen minutes to ensure complete saturation. After \nimmersion, the bags were stored over night in plastic trays at 13 °C in the dark, still separated \nby fungicide treatment. The following day, on 21 December 2006, we established three \nexperimental blocks at our grassland site for seed burial. These blocks were placed in the \ncorners of an equiangular triangle with a side length of ca. 7 m between blocks. Per block, we \nexcavated 48 cylindrical holes of 7 cm diameter and 6 cm depth in a regular grid of 6 × 8 \nacross an area of 0.6 m × 0.8 m, allowing for two replicate seed bags of each treatment to be \nburied in the same block. Individual replicates were assigned at random to positions within \nthe grid. Prior to placing each seed bag in its hole, we filled half of the hole with the same \nsubstrate that was used to fill the bag, but passed through a 5.0 mm sieve only and not \ndefaunated. After placement of the seed bags, the holes were filled to surface level with the \nsame substrate, thus ensuring that the substrate around the bags was of the same composition \n 7\n182 \n183 \n184 \n185 \n186 \n187 \n188 \n189 \n190 \n191 \n192 \n193 \n194 \n195 \n196 \n197 \n198 \n199 \n200 \n201 \n202 \n203 \n204 \n205 \n206 \n207 \nas the substrate in the bags. After six months, the seed bags were recovered from the field on \n20 June 2007. \n \nSeed viability testing \nImmediately after recovery, the contents of the seed bags were surface-sterilized by soaking \nthe bags in 70% ethanol for 2 min, followed by soaking in 1.25% sodium hypochlorite \nsolution for 4 min. Finally, each seed bag was rinsed twice for a two-minute period with \ndistilled water. After that, each seed bag was opened and germinated seedlings were counted \nand removed. Across the whole experiment, a total of four Centaurea seeds and five Daucus \nseeds had germinated during burial, and their occurrence was seemingly unrelated to \nexperimental treatments. More regularly, we found germinated Anthriscus seeds, but the \nfraction of germinated seeds of this species never exceeded 12% (= 3 seeds) in a single seed \nbag, and a three-factorial analysis of variance on arcsine-transformed data, using fungicide \ncombination and substrate as fixed factors and block identity as random factor (results not \nshown) did not provide any evidence for an influence by the experimental factors. The soil \ncontaining the remaining seeds was transferred into 9-cm Petri dishes containing a double \nlayer of filter paper (Whatman No. 1, Whatman International Ltd., Maidstone, England) \nmoistened with 5 cm³ of distilled water. The Petri dishes were sealed with Parafilm ‘M’ \n(Pechiney Plastic Packaging, Chicago, Illinois, USA) and placed in a climate chamber (Sanyo \nMLR-350H), at constant humidity of 80% and exposed to a diurnal cycle (16 h of light at \n25°C, 8 h of darkness at 15 °C) known to promote germination (Thompson and Grime, 1983). \nEvery other day, the Petri dishes were randomized. Seeds showing a visible protrusion of the \nradicle from the seed coat were considered to have germinated (Kitajima and Fenner, 2000), \nand counted and removed at weekly intervals. Between counts, the Petri dishes were re-\nsealed. This germination test was run for a total of three weeks. During this period, only about \n2% of Anthriscus seeds germinated. By contrast, ca. 98% of the Centaurea seeds and ca. 27% \n 8\nof the Daucus seeds had germinated by that time, most of them in weeks 1 and 2. To establish \nthe exact status of seeds still ungerminated after three weeks, these were checked for viability \nunder a microscope. Soft seeds were considered dead, as well as seeds containing blackened \nembryo when dissected. The remaining seeds were stained after dissection with a 0.1% \nsolution of 2,3,5-triphenyl tetrazolium chloride (Cottrell, 1947). After 12 h in an incubator at \n30 °C, seeds were classified into dead or viable on the basis of embryo and endosperm \ncoloration. \n208 \n209 \n210 \n211 \n212 \n213 \n214 \n215 \n216 \n217 \n218 \n219 \n220 \n221 \n222 \n223 \n224 \n225 \n226 \n227 \n228 \n229 \n230 \n231 \n232 \n233 \n \nData analysis \nWe carried out factorial analyses of variance based on Type III sums of squares using SPSS \n14.0 (SPSS Inc., Chicago, IL, USA). Prior to statistical analyses, all data were arcsine-\ntransformed to meet distributional requirements (Sokal and Rohlf, 1995). \nTo allow investigation of treatment effects on seed mortality, we calculated for each \nspecies in each seed bag the overall proportion of ungerminated dead seeds at the end of the \nburial period by summarising the proportions of seed determined as dead by visual inspection \nand of seeds determined dead as a result of tetrazolium testing. \nTo allow testing of treatment effects on the readiness of seeds to germinate, we also \ncalculated for each seed bag the proportion of Centaurea and Daucus seeds that germinated \nup to a specific point in time, based on the overall number of seeds that were still viable and \nungerminated after the burial period (i.e. seeds germinated in the Petri dishes over the whole \nthree-week period plus seeds that remained ungerminated but viable according to the \ntetrazolium test). Being interested in both the short-term effects and the longer-term effects on \nthe germinability of viable seeds, we calculated this ratio both based on germination in the \nfirst week of the Petri dish trial, and also based on the germination occurring throughout the \nthree-week trial. No similar data analyses were performed for ratios based on an intermediate \ngermination period of two weeks, as these were virtually identical to ratios based on the \n 9\nwhole three-week period. Neither did we analyse Anthriscus seed germination, as germination \nwas very low across all treatments, averaging only about 2% of seeds during the whole three-\nweek germination period. \n234 \n235 \n236 \n237 \n238 \n239 \n240 \n241 \n242 \n243 \n244 \n245 \n246 \n247 \n248 \n249 \n250 \n251 \n252 \n253 \n254 \n255 \n256 \n257 \n258 \n259 \nInitial analyses included both substrate type and fungicide combination as fixed \nfactors and block identity as random factor. As the experiment included within-block \nreplication of individual treatments, we were able to follow the recommendation by Quinn \nand Keough (2002) to also test for treatment x block interactions. Results from these initial \nanalyses indicated that the influence of substrate type on both mortality and readiness of seeds \nto germinate was negligible and mostly not significant. Therefore, we re-analysed the data for \nthe three soil types combined, dropping the factor substrate type from the analysis. Here, we \nonly report the results of this latter set of analyses. \nIn the case of significant fungicide treatment effects, we carried out post-hoc \ncomparisons between treatments. For post-hoc comparisons related to seed mortality, we used \nthe Tukey HSD procedure that evaluates any differences in means among all possible pairs of \ntreatments. For post-hoc comparisons related to the readiness of seeds to germinate we used a \ntwo-sided Dunnett test procedure instead of the Tukey HSD procedure, as we were only \ninterested in which fungicide combinations significantly affected the readiness of seeds to \ngerminate compared to the untreated control treatment. This procedure is more powerful \nbecause pairwise comparisons are restricted to comparing the control treatment with the other \ntreatments, whereas no comparisons are made among the latter (Quinn and Keough, 2002). \n \nResults \n \nEffects on seed mortality \nA. sylvestris was characterised by a particularly high proportion of dead seeds at the end of \nthe six-month burial period, with dead seeds making up between 31% and 48% in the \n 10\n260 \n261 \n262 \n263 \n264 \n265 \n266 \n267 \n268 \n269 \n270 \n271 \n272 \n273 \n274 \n275 \n276 \n277 \n278 \n279 \n280 \n281 \n282 \n283 \n284 \n285 \ndifferent fungicide treatments, and 66% in the untreated control (Figure 1A). By contrast, in \nC. nigra the proportion of dead seeds never exceeded 20% even in the untreated control \n(Figure 1B), and D. carota was characterised by intermediate proportions of dead seeds \n(Figure 1C). As indicated by ANOVA, there were highly significant (P < 0.001) fungicide \neffects on seed mortality both in Anthriscus  and in Daucus, whereas there were no such \neffects in Centaurea (Table 1). As indicated by Tukey HSD tests, seed mortality in Anthriscus \nwas significantly lowered by all fungicide treatments compared to the untreated control, but \nwas significantly higher in the iprodione only treatment than in the other six fungicide \ntreatments (Figure 1A). Similarly, all fungicide treatments significantly reduced seed \nmortality in Daucus, but in this species there were no significant differences among individual \nfungicide treatments (Figure 1C). \n \nEffects on dormancy levels \nAlmost none of the A. sylvestris seeds that remained ungerminated viable throughout the 6 \nmonth burial period germinated in the Petri dish trial. For this reason, data analyses on the \ninfluence of fungicide treatments on readiness of seeds to germinate were carried out only for \nthe other two species, C. nigra and D. carota. As indicated by ANOVA, the use of different \nfungicides had a significant impact on the proportion of viable seeds germinating within one \nweek in both species (Table 2A). In each of these two species, particular fungicide \ncombinations were associated with a reduction of the proportion of viable seeds germinating \nin the first week after seed bag recovery. In C. nigra, this effect was highly significant in all \ntreatments involving captan (Dunnett test: P < 0.001 in all cases), irrespective of whether this \ncompound was used on its own or in combination with iprodione and \/ or mancozeb (Figure \n2A). A two-way combination of iprodione and mancozeb also resulted in a reduced readiness \nof Centaurea seeds to germinate immediately (Dunnett test: P = 0.002). However, at the end \nof the three-week germination test, germination was close to 100% across treatments (Figure \n 11\n286 \n287 \n288 \n289 \n290 \n291 \n292 \n293 \n294 \n295 \n296 \n297 \n298 \n299 \n300 \n301 \n302 \n303 \n304 \n305 \n306 \n307 \n308 \n309 \n310 \n311 \n3B). Although the overall ANOVA test based on this data indicated a significant fungicide \neffect (Table 2B), according to the Dunnett test procedure, this was not due to any significant \npairwise differences between fungicide treatments and the untreated control  (Dunnett test \nP > 0.44 for all pairwise comparisons with the untreated control apart from the combination \nof iprodione and mancozeb, for which P = 0.054). \nIn Daucus, a significant reduction of the proportion of viable seeds germinating within \none week after seed recovery was found in all treatments combining mancozeb with one or \nboth of the other two fungicides (Table 2, Figure 3A; Dunnett test: P < 0.02 in all cases). At \nthe end of the three-week Petri dish trial, only about 27% of all viable Daucus seeds, as \naveraged across treatments, had germinated, and ca. 97% of these had done so in the first two \nweeks, indicating that in spite of favourable conditions for germination, most of the remaining \nseeds would likely have not germinated in following weeks, if the Petri dish trial would have \nbeen continued for a longer period. Final counts after three weeks indicated that the fungicide \neffects in Daucus observed after one week had persisted throughout the whole three-week \nperiod, with final proportions of germinated viable seeds still being significantly lower in two \nof the treatments involving mancozeb (Table 2B, Figure 3B), both on its own (Dunnett test: \nP = 0.042) and in combination with iprodione (Dunnett test: P = 0.005). \n \nDiscussion \nThe combination of several fungicidal compounds generally did not result in any clear further \nreduction of seed mortality compared to using just one fungicide at its recommended dosage. \nOn the other hand, we could show that individual fungicides can affect the proportion of \nviable seeds germinating under conditions known to promote germination, and that such \neffects can be prolonged. However, we found no clear evidence for soil organic matter effects. \nTreatment of seeds with fungicides generally increased the survival of buried seeds, \nalthough in one of the three test species, C. nigra, overall mortality over the six-month burial \n 12\n312 \n313 \n314 \n315 \n316 \n317 \n318 \n319 \n320 \n321 \n322 \n323 \n324 \n325 \n326 \n327 \n328 \n329 \n330 \n331 \n332 \n333 \n334 \n335 \n336 \n337 \nperiod was too low to allow any accumulation of significant differences between the untreated \ncontrol and the fungicide treatments. With the exception of the iprodione only treatment in \nAnthriscus being slightly less effective than the other fungicide combinations, there were no \nsignificant differences among individual fungicide treatments. The visual inspection of the \nresults seems to suggest that in the case of Daucus, the combination of two fungicidal \ncompounds may tend to provide a slightly better protection against fungal decay than the use \nof a single compound only, although the observed differences are too small to be significant \nwhen comparing individual fungicide treatments pairwise. \nIndividual compounds did in some instances markedly affect the readiness of viable \nseeds to germinate after retrieval from the field. In Centaurea, in the first week of the Petri \ndish trial an average of 65% of viable seeds germinated from the control treatment. By \ncontrast, this percentage was only 14-23% in the four fungicide treatments containing captan. \nAfter three weeks, Centaurea seed germination was close to 100% in all treatments, \nindicating that captan did not induce any longer-lasting dormancy. Similar short-term effects \nof captan on seed germination were previously observed in wheat seeds (Clark and Scott, \n1982). \nFungicide effects on germination were also found in Daucus seeds, where an already \nlow readiness of seeds to germinate after retrieval was particularly low in fungicide \ncombinations involving mancozeb. However, in this case, observed fungicide effects were \nmore persistent: After three weeks, when germination of Daucus seeds had largely ceased, \nsignificant differences still existed between two of the treatments involving mancozeb and the \nuntreated control. This may be interpreted as a more persistent induction of secondary \ndormancy in Daucus seeds by mancozeb. A similarly persistent but opposite effect on \ndormancy levels of seeds has been previously documented for wheat seeds stimulated to \ngerminate by the systemic fungicide benomyl (Clark and Scott, 1982). Our results extend the \nfindings of previous studies from crops seeds that tend to germinate readily (Baskin and \n 13\n338 \n339 \n340 \n341 \n342 \n343 \n344 \n345 \n346 \n347 \n348 \n349 \n350 \n351 \n352 \n353 \n354 \n355 \n356 \n357 \n358 \n359 \n360 \n361 \n362 \n363 \nBaskin, 1998) to non-crop species. Extent and duration of effects on dormancy were both \nfungicide-specific and species-specific in our study. \nAs outlined in the Materials and Methods section, substrate organic matter content, \nmanipulated by using different substrates based on local topsoil and \/ or green waste compost, \ndid only marginally influence our results. \n \nConclusions \n \nSeveral conclusions can be drawn from our study with respect to ecological seed burial \nstudies. Our results suggest that, compared to using a single compound at the recommended \ndosage, a combination of two different fungicidal compounds may often only provide a \nmarginally better protection of seeds from fungal-induced seed mortality, but that such a \ncombination may nevertheless serve as an insurance against unintentionally using a single \ncompound at a dosage too low to provide full protection, as may have been the case in our \nstudy for the seeds of Anthriscus when treated with iprodione. The benefits of combining a \nvery large number of fungicidal compounds as advocated by Leishman et al. (2000) may thus \nbe negligible and may not justify the additional effort involved. While we also did not find \nany evidence for negative effects resulting from the combination of different fungicidal \ncompounds, our results do not preclude the potential occurrence of such effects when \nfungicidal compounds other than the ones tested in our study are involved. In the absence of \nfurther research on this subject, it may thus be safest to use individual compounds at a \nsufficiently high dosage or tried and tested combinations of two fungicides that are known to \nnot chemically interact with each other. \nThere were pronounced effects of individual fungicidal compounds on seed dormancy. \nMancozeb had a lasting effect on seed dormancy in Daucus, and captan initially repressed \nseed germination in Centaurea, although this latter effect was only transient. Captan was the \n 14\n364 \n365 \n366 \n367 \n368 \n369 \n370 \n371 \n372 \n373 \n374 \n375 \n376 \n377 \n378 \n379 \n380 \n381 \n382 \n383 \n384 \n385 \n386 \n387 \n388 \nsole fungicidal compound used in many published studies, but in the absence of proof of more \npersistent effects, it seems likely that the results of these studies have not been compromised \nby unexpected side effects on seed dormancy. Nevertheless, given the evidence for a \nwidespread existence of species-specific seasonal germination windows (e.g. Milberg and \nAndersson, 1997; Vleeshouwers and Bouwmeester, 2001; Schütz, 2002; Baskin and Baskin, \n2006), increased levels of seed dormancy as observed in our study for Daucus seeds treated \nwith mancozeb have the potential to prevent a sizeable proportion of seeds from germinating \nin a particular year. This may be an important consideration when planning a study that \nattempts to assess the effects of fungal exclusion on the in situ emergence of seedlings. Such \nstudies are however rare, and in the only study of that kind we know of (Blaney and Kotanen, \n2002), captan was used, for which we only found evidence for short-term effects on seed \ndormancy. \nOverall, our results do thus underline the validity of previous seed burial studies using \nonly a single fungicidal compound. Moreover, in our study the differences in mortality \nbetween different fungicide treatments were generally only small. It thus seems likely that the \nbasic conclusions from most seed burial studies are unaffected by their choice of fungicide \nand that reliable conclusions can be drawn from these studies regarding the relative amount of \nburied seed mortality attributed to fungal attack as opposed to mortality that can be attributed \nto other causes. However, as the rate of fungal-induced seed mortality in such experiments \nseems to crucially depend on the density of buried seeds (Van Mourik et al., 2005), we advise \nfor caution when using data generated from such studies in seed demographic models. \n \nAcknowledgements \nJohn Sloggett provided useful comments and checked the English of the manuscript. Further, \nthe manuscript benefited from the comments of two anonymous referees and of the handling \n 15\n389 \n390 \n391 \n392 \n393 \n394 \n395 \n396 \n397 \n398 \n399 \n400 \n401 \n402 \n403 \n404 \n405 \n406 \n407 \n408 \n409 \n410 \n411 \n412 \n413 \n414 \neditor. We also thank BASF AG, Ludwigshafen, Germany, and Feinchemie Schwebda, \nEschwege, Germany, for providing fungicide samples free of charge. \n \nReferences \nAndrades, M.S., Rodríguez-Cruz, M.S., Sánchez-Martín, M.J. and Sánchez-Camazano, \nM. (2004) Effect of the modification of natural clay minerals with \nhexadecylpyridinium cation on the adsorption-desorption of fungicides. International \nJournal of Environmental Analytical Chemistry 84, 133-141. \nBackman, P.A. (1978) Fungicide formulation: Relationship to biological activity. Annual \nReviews in Phytopathology 16, 211-237. \nBaskin, C.C. and Baskin, J.M. (1998) Seeds: Ecology, biogeography, and evolution of \ndormancy and germination. San Diego, Academic Press. \nBaskin, C.C. and Baskin, J.M. (2006) The natural history of soil seed banks of arable land. \nWeed Science 54, 549-557. \nBlaney, C.S. and Kotanen, P.M. (2001) Effects of fungal pathogens on seeds of native and \nexotic plants: a test using congeneric pairs. Journal of Applied Ecology 38, 1104-\n1113. \nBlaney, C.S. and Kotanen, P.M. (2002) Persistence in the seed bank: The effects of fungi \nand invertebrates on seeds of native and exotic plants. Ecoscience 9, 509-517. \nClark, S.M. and Scott, D.J. (1982) Effects of carboxin, benomyl and captan on the \ngermination of wheat during the post-harvest dormancy period. Seed Science and \nTechnology 10, 87-94. \nCottrell, H.J. (1947) Tetrazolium salt as a seed germination indicator. Nature 159, 748. \nDalling, J.W., Swaine, M.D. and Garwood, N.C. (1998) Dispersal patterns and seed bank \ndynamics of pioneer trees in moist tropical forest. Ecology 79, 564-578. \nDeacon, J. (2006). Fungal biology (4th edition). Malden, Blackwell. \n 16\nDeutscher Wetterdienst (2008) Ausgabe der Klimadaten: Monatswerte. \nhttp:\/\/www.dwd.de\/de\/FundE\/Klima\/KLIS\/daten\/online\/nat\/ausgabe_monatswerte.ht\nm. Accessed on 03 March 2008. \n415 \n416 \n417 \n418 \n419 \n420 \n421 \n422 \n423 \n424 \n425 \n426 \n427 \n428 \n429 \n430 \n431 \n432 \n433 \n434 \n435 \n436 \n437 \n438 \n439 \nFellows, G.M. and Roeth, F.W. (1992) Factors influencing shattercane (Sorghum bicolor) \nseed survival. Weed Science 40, 434-440. \nGallandt, E.R., Fuerst, E.P. and Kennedy, A.C. (2004) Effect of tillage, fungicide \ntreatment, and soil fumigation on seed bank dynamics of wild oat (Avena fatua). Weed \nScience 52, 597-604. \nGange, A.C., Brown, V.K. and Farmer, L.M. (1992) Effects of pesticides on the \ngermination of weed seeds: implications for manipulative experiments. Journal of \nApplied Ecology 29, 303-310. \nGisi, U. (1996) Synergistic interaction of fungicides in mixtures. Phytopathology 86, 1273-\n1279. \nGoring, C.A.I. (1967) Physical aspects of soil in relation to the action of soil fungicides. \nAnnual Review of Phytopathology 5, 285-317. \nHartz, T.K. and Caprile, J. (1995) Germination of sh2 sweet corn following seed \ndisinfestation, solid-matrix priming, and microbial seed treatment. Hortscience 30, \n1400-1402. \nJäger, E.J. and Werner, K. (2002) Rothmaler – Exkursionsflora von Deutschland: \nGefäßpflanzen, Kritischer Band. Heidelberg, Spektrum. \nKitajima, K. and Fenner, M. (2000) Ecology of seedling regeneration, pp. 331-359 in \nFenner, M. (Ed.) Seeds: The ecology of regeneration in plant communities. \nWallingford, CABI Publishing. \nKotanen, P.M. (2007) Effects of fungal seed pathogens under conspecific and heterospecific \ntrees in a temperate forest. Canadian Journal of Botany 85, 918-925. \n 17\nKremer, R.J. (1993) Management of weed seed banks with microorganisms. Ecological \nApplications 3, 42-52. \n440 \n441 \n442 \n443 \n444 \n445 \n446 \n447 \n448 \n449 \n450 \n451 \n452 \n453 \n454 \n455 \n456 \n457 \n458 \n459 \n460 \n461 \n462 \n463 \n464 \n465 \nLaird, R.A. and Addicott, J.F. (2008) ‘Fungicide application method’ and the interpretation \nof mycorrhizal fungus-insect indirect effects. Acta Oecologica 34, 214-220. \nLeishman, M.R., Masters, G.J., Clarke, I.P. and Brown,V.K. (2000) Seed bank dynamics: \nthe role of fungal pathogens and climate change. Functional Ecology 14, 293-299. \nLonsdale,W.M. (1993) Losses from the seed bank of Mimosa pigra: soil micro-organisms vs. \ntemperature fluctuations. Journal of Applied Ecology 30, 654-660. \nLopes, N.P., de Queiroz, M.E.L.R., Neves, A.A. and Zambolim, L. (2002) Influência da \nmaterial orgânica na adsorção do fungicida triadimenol pelo solo. Quimica Nova 25, \n544-547. \nMilberg, P. and Andersson, L. (1997) Seasonal variation in dormancy and light sensitivity \nin buried seeds of eight annual weed species. Canadian Journal of Botany 75, 1998-\n2004. \nMitschunas, N., Wagner, M. and Filser, J. (2006) Evidence for a positive influence of \nfungivorous soil invertebrates on the seed bank persistence of grassland species. \nJournal of Ecology 94, 791-800. \nMitschunas, N., Wagner, M. and Filser, J. (2008) Increased field emergence of seedlings at \nhigh densities of fungivorous soil mesofauna. Journal of the Torrey Botanical Society \n135, 272-280. \nNeergaard, P. (1979) Seed pathology. London, Macmillan Press. \nO´Hanlon-Manners, D.L. and Kotanen, P.M. (2004a) Evidence that fungal pathogens \ninhibit recruitment of a shade-intolerant tree, white birch (Betula papyrifera), in \nunderstory habitats. Oecologia 140, 650-653. \nO´Hanlon-Manners, D.L. and Kotanen, P.M. (2004b) Logs as refuges from fungal \npathogens for seeds of Eastern Hemlock (Tsuga canadensis). Ecology 85, 284-289. \n 18\nOrrock, D.L. and Damschen, E.I. (2005) Fungi-mediated mortality of seeds of two old-field \nplant species. Journal of the Torrey Botanical Society 132, 613–617. \n466 \n467 \n468 \n469 \n470 \n471 \n472 \n473 \n474 \n475 \n476 \n477 \n478 \n479 \n480 \n481 \n482 \n483 \n484 \n485 \n486 \n487 \n488 \n489 \n490 \nPaul, N.D., Ayres, P.G. and Wyness, L.E. (1989) On the use of fungicides for \nexperimentation in natural vegetation. Functional Ecology 3, 759-769. \nQuinn, G.P. and Keough, M.J. (2002) Experimental design and data analysis for biologists. \nCambridge, Cambridge University Press. \nScardavi, A. (1966) Synergism among fungicides. Annual Review of Phytopathology 4, 335-\n346. \nSchafer, M. and Kotanen, P.M. (2004) Impacts of naturally-occurring soil fungi on seeds of \nmeadow plants. Plant Ecology 175, 19-35. \nSchütz, W. (2002) Dormancy characteristics and germination timing in two alpine Carex \nspecies. Basic and Applied Ecology 3, 125-134. \nSimmen, U. and Gisi, U. (1995) Effects of seed treatment with SAN-789-F, a \nhomopropargylamine fungicide, on germination and contents of squalene and sterols \nof wheat seedlings. Pesticide Biochemistry and Physiology 52, 25-32. \nSinha, A.P., Singh, K. and Mukhopadhyay, A.N. (1988) Soil fungicides. Boca Raton, CRC \nPress. \nSmiley, R.W., Patterson, L.M. and Rhinhart, K.E.L. (1996) Fungicide seed treatment \neffects on emergence of deeply planted winter wheat. Journal of Production Agriculture \n9, 564-570. \nSokal, R.R. and Rohlf, F.J. (1995) Biometry – the principles and practice of statistics in \nbiology research. New York, Freeman. \nThompson, K., Bakker, J.P. and Bekker, R.M. (1997) The soil seed banks of North West\n  Europe: Methodology, density and longevity. Cambridge, Cambridge University \nPress. \n 19\nThompson, K. and Grime, J.P. (1983) A comparative study of germination responses to \ndiurnally-fluctuating temperatures. Journal of Applied Ecology 20, 141-156. \n491 \n492 \n493 \n494 \n495 \n496 \n497 \n498 \n499 \n500 \n501 \n502 \n503 \n504 \n505 \n506 \n507 \n508 \n509 \n510 \n511 \n512 \n513 \n514 \n515 \n516 \nVan Mourik, T.A., Stomph,T.J. and Murdoch, A.J. (2005) Why high seed densities within \nburied mesh bags may overestimate depletion rates of soil seed banks. Journal of \nApplied Ecology 42, 299-305. \nVleeshouwers, L.M. and Bouwmeester, H.J. (2001) A simulation model for seasonal \nchanges in dormancy and germination of weed seeds. Seed Science Research 11, 77-\n92. \nWagner, M. and Mitschunas, N. (2008) Fungal effects on seed bank persistence and \npotential applications in weed biocontrol: A review. Basic and Applied Ecology 9, \n191-203 \nWhitehead, R. (1998). The UK pesticide guide. Cambridge, Massachusetts, CABI \nPublishing. \n \n \n \n \n \n \n \n \n \n \n \n \n \n 20\nTable captions 517 \n518 \n519 \n520 \n521 \n522 \n523 \n524 \n525 \n526 \n527 \n528 \n529 \n530 \n531 \n532 \n533 \n534 \n535 \n536 \n537 \n538 \n539 \n540 \n541 \n542 \n \nTable 1. Effects of fungicide combination (=fixed factor) and of experimental block identity \n(=random factor) on the proportion of ungerminated dead seeds of Anthriscus sylvestris, \nCentaurea nigra, and Daucus carota at the end of a 6-month burial period. Analyses are \nbased on arcsine-transformed data. Significant effects (P < 0.05) in bold. \n \nTable 2. Effects fungicide combination (=fixed factor) and of experimental block identity \n(=random factor) on the proportion of viable seeds of Centaurea nigra and Daucus carota \nreadily germinating within one week (A) and three weeks (B) after retrieval from the field. \nAnalyses are based on arcsine-transformed data. Significant effects (P < 0.05) in bold. Due to \ninsufficient germination, Anthriscus sylvestris was not analysed. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 21\n543 \n544 \n(Table 1) \n \nEffect   A. sylvestris  C. nigra  D. carota \n d.f.  F P  F P  F P \nFungicide combination 7  66.86 < 0.001  1.56 0.225  12.70 <0.001\nBlock 2  10.48 0.002  0.81 0.465  1.22 0.324 \nFungicide combination × Block 14  0.46 0.950  1.24 0.258  1.13 0.339 \nError 120          \n545 \n546 \n547 \n548 \n549 \n550 \n551 \n552 \n553 \n554 \n555 \n556 \n557 \n558 \n559 \n560 \n561 \n562 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 22\n563 \n564 \n(Table 2) \n \nEffect   C. nigra  D. carota \n d.f.  F P  F P \nA) Germination after one week        \nFungicide combination 7  10.85 < 0.001  5.34 0.004 \nBlock 2  1.20 0.329  0.50 0.618 \nFungicide combination × Block 14  2.18 0.012  1.49 0.124 \nError 120       \n        \nB) Germination after three weeks        \nFungicide combination 7  5.78 0.003  4.12 0.012 \nBlock 2  2.62 0.108  6.34 0.011 \nFungicide combination × Block 14  0.34 0.988  1.28 0.231 \nError 120       \n 565 \n566 \n567 \n568 \n569 \n570 \n571 \n572 \n573 \n574 \n575 \n \n \n \n \n \n \n \n \n \n \n 23\nFigure captions 576 \n577 \n578 \n579 \n580 \n581 \n582 \n583 \n584 \n585 \n586 \n587 \n588 \n589 \n590 \n591 \n592 \n593 \n594 \n595 \n596 \n597 \n598 \n599 \n600 \n601 \nFigure 1. Percentage of seeds that were dead at the end of a six-month burial period, in \nrelation to particular combinations of captan, mancozeb, and iprodione used alone or \nin combination: A) Anthriscus sylvestris; B) Centaurea nigra; C) Daucus carota. \nFungicide treatments: control = untreated control; C = captan; I = iprodione; \nM = mancozeb. Bars and error bars indicate back-transformed mean values and 95% \nconfidence intervals. In case of ANOVA significance (P < 0.05), differences between \ndifferent compound combinations are indicated by lower-case characters. \n \nFigure 2. Percentage of viable Centaurea nigra seeds that germinated in the Petri dish test \nfollowing the six-month burial period, depending on particular combinations of \ncaptan, mancozeb, and iprodione alone or in combination: A) after one week; B) after \nthree weeks. Fungicide treatments: control = untreated control; C = captan; \nI = iprodione; M = mancozeb. Bars and error bars indicate back-transformed mean \nvalues and 95% confidence intervals. Particular fungicide combinations that differ \nsignificantly from the untreated control as indicated by two-sided Dunnett tests are \nindicated by asterisks (*** P<0.001; ** P<0.01; * = P<0.05). \n \nFigure 3. Percentage of viable Daucus carota seeds that germinated in the Petri dish test \nfollowing the six-month burial period, depending on particular combinations of \ncaptan, mancozeb, and iprodione alone or in combination: A) after one week; B) after \nthree weeks. Fungicide treatments: control = untreated control; C = captan; \nI = iprodione; M = mancozeb. Bars and error bars indicate back-transformed mean \nvalues and 95% confidence intervals. Particular fungicide combinations that differ \nsignificantly from the untreated control as indicated by two-sided Dunnett tests are \nindicated by asterisks (*** P<0.001; ** P<0.01; * = P<0.05). \n 24\n602 \n603 \n604 \n605 \n606 \n607 \n608 \n609 \n610 \n611 \n612 \n613 \n614 \n615 \n616 \n617 \n618 \n619 \n620 \n621 \n622 \n623 \n624 \n625 \n626 \n627 \n(Figure 1) \n \n \nTreatment\n100\n80\n60\n40\n20\n0\nc b c c c c c\nA\nSe\ned\nm\nor\nta\nlit\ny\n[%\n] 100\n80\n60\n40\n20\n0\nB\ncontrol C I M CI CM IM CIM\ncontrol C I M CI CM IM CIM\n100\n80\n60\n40\n20\n0\nC\ncontrol C I M CI CM IM CIM\na\nb b b b b b ba\nSe\ned\nm\nor\nta\nlit\ny\n[%\n]\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 25\n628 \n629 \n630 \n631 \n632 \n633 \n634 \n635 \n636 \n637 \n638 \n639 \n640 \n641 \n642 \n643 \n644 \n645 \n646 \n647 \n648 \n649 \n650 \n651 \n652 \n653 \n (Figure 2) \n \n 100\n80\n60\n40\n20\n0\ncontrol C I M CI CM IM CIM\n*\nA\nG\ner\nm\nin\nat\nio\nn\nof\n v\nia\nbl\ne\nse\ned\ns\n[%\n]\n* * * *\nB\ncontrol C I M CI CM IM CIM\n100\n80\n60\n40\n20\n0\nTreatment\nG\ner\nm\nin\nat\nio\nn\nof\n v\nia\nbl\ne\nse\ned\ns\n[%\n]\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 26\n 27\n654 \n655 \n656 \n657 \n658 \n659 \n660 \n661 \n662 \n663 \n664 \n665 \n666 \n667 \n668 \n669 \n670 \n(Figure 3) \n \n \ncontrol C I M CI CM IM CIM\n100\n80\n60\n40\n20\n0\nA\nTreatment\n* * *\nB100\n80\n60\n40\n20\n0\ncontrol C I M CI CM IM CIM\n* *\nG\ner\nm\nin\nat\nio\nn\nof\n v\nia\nbl\ne\nse\ned\ns\n[%\n]\nG\ner\nm\nin\nat\nio\nn\nof\n v\nia\nbl\ne\nse\ned\ns\n[%\n]\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"}