{"doi":"10.1068\/dcos6","coreId":"65424","oai":"oai:dro.dur.ac.uk.OAI2:5916","identifiers":["oai:dro.dur.ac.uk.OAI2:5916","10.1068\/dcos6"],"title":"Postcolonial Bombay : decline of a cosmopolitan city?","authors":["McFarlane,  C."],"enrichments":{"references":[],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2008-01-01","abstract":"Discussions of cosmopolitanism in Bombay often focus on the rubrics of communal tension, tolerance, and violence, and frequently report the decline of a once cosmopolitan city, especially as a result of the communal riots and bombings that occurred in the early 1990s. However, claims that the city has undergone a general social transformation since the 1990s need to be tempered by the multiple forms of cosmopolitan imaginations and practices that exist in the city. There is a wide\\ud\nvariety of alternative cosmopolitan formations - not all of them progressive - reflected in civil society\\ud\norganizations and lifestyle changes for different groups, and often vividly reflected in film. This paper will chart two examples of contemporary cosmopolitanism. The first part of the paper explores the cautious optimism of film in the promise of cosmopolitan Bombay during the early years of Independence, before briefly discussing how cinema later attempted to reflect the destabilizing of the postcolonial vision of urban national development. The second part of the paper begins with\\ud\ndiscussion of the contemporary cinematic portrayal of elite-oriented global cosmopolitan modernity, and then contrasts this with a different form of global cosmopolitan modernity articulated through the work of the Slum\/Shack Dwellers International network. This discussion conceives of cosmopolitanism as social, marking a counterpoint to the tendency in discourses of liberal cosmopolitanism\\ud\nthat emphasizes the agency of the globally aware individual. Methodologically, the paper seeks to\\ud\ndemonstrate that relating often analytically separate realms such as film and civil society can provide a wider politicocultural lens through which to examine urban change","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65424.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5916\/1\/5916.pdf","pdfHashValue":"4966c15a50ecd5101577113689733966da25a957","publisher":"Pion","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5916<\/identifier><datestamp>\n      2015-09-10T13:49:51Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Postcolonial Bombay : decline of a cosmopolitan city?<\/dc:title><dc:creator>\n        McFarlane,  C.<\/dc:creator><dc:description>\n        Discussions of cosmopolitanism in Bombay often focus on the rubrics of communal tension, tolerance, and violence, and frequently report the decline of a once cosmopolitan city, especially as a result of the communal riots and bombings that occurred in the early 1990s. However, claims that the city has undergone a general social transformation since the 1990s need to be tempered by the multiple forms of cosmopolitan imaginations and practices that exist in the city. There is a wide\\ud\nvariety of alternative cosmopolitan formations - not all of them progressive - reflected in civil society\\ud\norganizations and lifestyle changes for different groups, and often vividly reflected in film. This paper will chart two examples of contemporary cosmopolitanism. The first part of the paper explores the cautious optimism of film in the promise of cosmopolitan Bombay during the early years of Independence, before briefly discussing how cinema later attempted to reflect the destabilizing of the postcolonial vision of urban national development. The second part of the paper begins with\\ud\ndiscussion of the contemporary cinematic portrayal of elite-oriented global cosmopolitan modernity, and then contrasts this with a different form of global cosmopolitan modernity articulated through the work of the Slum\/Shack Dwellers International network. This discussion conceives of cosmopolitanism as social, marking a counterpoint to the tendency in discourses of liberal cosmopolitanism\\ud\nthat emphasizes the agency of the globally aware individual. Methodologically, the paper seeks to\\ud\ndemonstrate that relating often analytically separate realms such as film and civil society can provide a wider politicocultural lens through which to examine urban change.<\/dc:description><dc:subject>\n        Cosmopolitanism<\/dc:subject><dc:subject>\n         Mumbai<\/dc:subject><dc:subject>\n         Informal settlements<\/dc:subject><dc:subject>\n         Postcolonialism.<\/dc:subject><dc:publisher>\n        Pion<\/dc:publisher><dc:source>\n        Environment and planning D : society and space, 2008, Vol.26(3), pp.480-499 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2008-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5916<\/dc:identifier><dc:identifier>\n        issn:0263-7758<\/dc:identifier><dc:identifier>\n        issn: 1472-3433<\/dc:identifier><dc:identifier>\n        doi:10.1068\/dcos6<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5916\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1068\/dcos6<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5916\/1\/5916.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1472-3433","issn:0263-7758","0263-7758"," 1472-3433"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["Cosmopolitanism","Mumbai","Informal settlements","Postcolonialism."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n07 August 2009\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nMcFarlane, C. (2008) ’Postcolonial Bombay : decline of a cosmopolitan city ?’, Environment and planning D :\nsociety and space., 26 (3). pp. 480-499.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1068\/dcos6\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n,  \n \nDurham Research Online \n \nDeposited in DRO: \n07 August 2009 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status of attached file: \nAccepted for publication version \n \nCitation for published item: \nMcFarlane, C. (2008) 'Postcolonial Bombay : decline of a cosmopolitan city ?', Environment \nand planning D : society and space., 26 (3). pp. 480-499. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1068\/dcos6 \n \nCopyright statement: \nMcFarlane, C. (2008). The definitive peer-reviewed and edited version of this article is \npublished in Environment and planning D : society and space, 26,3, 480-499, 10.1068\/dcos6 \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n 1 \n \n \n \n \n \n \nPostcolonial Bombay: decline of a cosmopolitanism city? \n \n \nEnvironment and Planning D: Society and Space \n \nJanuary, 2008 \n \nColin McFarlane \nDepartment of Geography \nDurham University \nSouth Road \nDurham \nDH1 3LE \n \nTel: 0191-334-1959 \nFax: 0191-334-1801 \nEmail: colin.mcfarlane@durham.ac.uk \n \n \n \n \n 2 \nAbstract \n \nDiscussions of cosmopolitanism in Bombay often focus on the rubrics of communal \ntension, tolerance and violence, and frequently report the decline of a once \ncosmopolitan city, especially from the communal riots and bombings that occurred \nin the early 1990s.  However, claims that the city has undergone a general social \ntransformation since the 1990s need to be tempered by the multiple forms of \ncosmopolitan imaginations and practices that exist in the city.  There are a wide \nvariety of alternative cosmopolitan formations – not all of them progressive - \nreflected in civil society organizations, lifestyle changes for different groups, and \noften vividly reflected in film.  This paper will chart two examples of contemporary \ncosmopolitanism.  The first part of the paper explores the cautious optimism of film \nin the promise of cosmopolitan Bombay during the early years of Independence, \nbefore briefly discussing how cinema later attempted to reflect the destabilizing of \nthe postcolonial vision of urban national development.  The second part of the \npaper begins with discussion of the contemporary cinematic portrayal of elite-\noriented global cosmopolitan modernity, and then contrasts this with a different \nform of global cosmopolitan modernity articulated through the work of the \nSlum\/Shack Dwellers International network.  This discussion conceives \ncosmopolitanism as social, marking a counterpoint to the tendency in discourses of \nliberal cosmopolitanism that emphasizes the agency of the globally aware \nindividual.  Methodologically, the paper seeks to demonstrate that relating often \nanalytically separate realms such as film and civil society can provide a wider \npolitico-cultural lens through which to examine urban change.   \n \nAcknowledgements \n \nI am grateful to Alex Jeffrey, Craig Jeffrey, Tariq Jazeel, Geraldine Pratt, and the \nanonymous referees for very useful comments on an earlier version of this paper. \n \n \n \n \n \n 3 \nIntroduction \n \nBombay has long been coupled with notions of cosmopolitanism (Appadurai, 2000; \nPrakash, 2006).  The writer Pico Iyer (2003) has described the city as inevitably \ncosmopolitan given its economic and cultural draw within India.  He has written of \nBombay as “the center of the subcontinents bright lights, big-city dreams – home to \nthe strenuous fantasies of „Bollywood‟ and hunting-ground of mobsters and their \nmolls - is at once the „Capital of Hope‟, to which hundreds of thousands of \nnewcomers flock each year, dreaming of making their fortunes, and a decidedly \nruthless place, where more visitors find jobs than homes” (Iyer, 2003: 3).  Gyan \nPrakash (2005: 499) has written of the city‟s “captivating imaginations, its \nrepresentation as a place of desire and dreams”.  It is a city, Iyer (2003: 3) relates, \nthat is both “beachhead for the modern” and “multi-cultured port”, a “haven of \ntolerance” for Hindus, Muslims, Parsis, Christians, Sikhs, Jains, and others bound \nin a “money-minded mix”.  Its kindred spirits, he suggests, are those other island \nstaging-posts of people, capital and modernity, Hong Kong and Manhattan.  \nBombay has been for centuries a focus for global trade around the Arabian Sea and \nbeyond, owing in large part to its endowment with one of the largest harbours in \nSouth Asia, and, especially from the mid-nineteenth century, has long been \nattractive to a wide range of migrants.  Conversely, the figure of the city as \ncosmopolitan is a constant feature in narratives of its recent decline (Prakash, 2006; \nVarma, 2004). \n \nMost discussions of cosmopolitanism in Bombay focus on the rubrics of communal \ntension, tolerance and violence, and a range of commentators have remarked on a \ndecline of a cosmopolitan city, marking as watershed the communal riots and \nbombings that occurred in the early 1990s.  Appadurai (2000) describes this period \nas the „decosmopolitanization‟ of Bombay, while Varma (2004) writes of the city‟s \n„provincialization‟.  However, notwithstanding the force of these events within the \ncity, claims that the city has witnessed a general social transformation from the \nearly 1990s onwards need to be tempered by the multiple forms of cosmopolitan \nimaginations and practices that have circulated the city.  There are a wide variety of \nalternative cosmopolitanism in the city – not all of them progressive - reflected in \ncivil society organizations, lifestyle changes for different groups, and portrayed \n 4 \noften most vividly in film.  While there are important distinctions with the past, \nthese cosmopolitanisms often resonate with the Bombay that existed before the \n1990s.   \n \nIn this paper, I will begin by narrating the destabilizing of the notion of a \ncosmopolitan city through the postcolonial period.  I will argue that in the half \ncentury that followed Indian Independence in 1947, the undermining of the \ncosmopolitan city was closely linked to a growing disenchantment with the \nmodernizing state and prospects of urban opportunity and justice, along with a \nrelated history of communalism and violence.  However, rather than characterizing \nthis destabilizing as „decosmopolitanism‟ or „provincialism‟, I argue that Bombay \nis a city of multiple cosmopolitanisms not all of which take communalism and \nviolence as their central points of reference.  I will chart just two contrasting \nexamples of this in the latter half of the paper, one a global consumption oriented \ncosmopolitanism, and the other a learning network of civil groups working in \ninformal settlements.   \n \nLocating cosmopolitanism \n \nIn contrast to the preoccupation with cultures and individuals in the „North‟, the \npaper connects with a growing interest in the different ways in which people living \nin the „South‟ become cosmopolitan, including work that has traced the formation \nof sub-national, subaltern or rural cosmopolitanisms (see, for example, Gidwani, \n2006; Gidwani and Sivaramakrishnan 2003; Hall 2002).  Cosmopolitanism is \nnotoriously difficult to define, and as Pollock, et al (2000) suggest, this may in part \nbe because definition, with its attendant possibilities of universalism and exclusion, \nseems an uncosmopolitan thing to do.  I take cosmopolitanism to refer to a \nparticular kind of worldliness, a cultural pluralism that connects different sites and \npeople.  Following Mignola (2000: 721), cosmopolitanism is “a set of projects \ntowards planetary conviviality”, distinct from globalisation as a set of designs to \nmanage the world.  „Planetary‟ should not be confused with the scale of the globe; \ncosmopolitanism can be more or less inclusive or exclusive, and it can be \npredominantly global, national or local in character, for instance in some \nmulticultural neighbourhoods (Sandercock, 2003).   \n 5 \n \nMignola links cosmopolitanism to the emergence of the colonial modern world, and \nconnects this with attempts by the modernising Western nation-states to assert \nauthority over the rest of the world through the global design of Christianity and the \ncivilising mission.  He goes on to usefully distinguish between cosmopolitan \nprojects and critical cosmopolitanism.  The former arise from within historical \nglobal designs such as the civilizing mission, and have failed to escape the \nideological frames of these designs despite often being critical of them.  Critical \ncosmopolitanism refers to the perspectives of those exterior to global designs.  He \nelaborates: “By exteriority I do not mean something lying untouched beyond \ncapitalism and modernity, but the outside that is needed by the inside.  Thus, \nexteriority is indeed the borderland seen from the perspective of those „to be \nincluded,‟ as they have no other option” (Mignola, 2000: 724).  If cosmopolitan \nprojects are critical of colonial modernity they do so from a perspective within \ncolonial modernity, whereas critical cosmopolitan projects are located in the \nexteriority and issue forth from colonial difference, often in the form of \n„cosmopolitanisms from below‟.  As Pollock et al (2002: 582) write: \n“Cosmopolitans today are often the victims of modernity, failed by capitalism‟s \nupward mobility, and bereft of those comforts and customs of national belonging”.   \n \nI will consider three instances of cosmopolitan imaginaries, all of which take the \ncity and its modernity to be central.  First, an effort by the legendary film director \nRaj Kapoor to depict in the early years of Independence a form of national \nmodernism that was closely linked to notions of cosmopolitanism.  This effort \ncautiously portrays a progressive nationalism that would recreate Bombay in the \nimage of Prime Minister Nehru‟s modernist vision of a planned and just city \nproviding opportunities and services for all.  The city is portrayed as a potential site \nof cosmopolitanism, as a space that welcomes and assists migrants from all over \nIndia regardless of background, a potential vividly interrogated in the popular film, \nShri 420.  In Mignola‟s (2000) terms, this is a cosmopolitan imaginary that emerges \nfrom the interior rather than the exterior, linked to the nationalist vision of open, \ntolerant and well planned cities.  The paper goes on to briefly trace the destabilizing \nof this cosmopolitan imaginary of Bombay through the developmental crisis of the \n 6 \n1960s, the violence of the national emergency in the 1970s and the riots of the early \n1990s, and connects these shifts to changing portrayal in film.   \n \nSecond, I consider a particular cosmopolitan imaginary at work in contemporary \nfilm, especially new family film, which presents an image of modernity as global \nconsumption.  This casts an image of an exclusionary cosmopolitanism reserved for \nthe city‟s globe-hopping elite.  This cinema portrays glamorous, globally aware \nindividuals, predominantly in luxury residential and café interiors in Bombay or \nelsewhere in the world, and often set against dramatic panoramic views that hover \nabove the lives and interstices of the city.  Third, the paper then shifts from the \npanoramic views that drift above the city in the „city of spectacle‟ to the ground \nlevel, to the „city of debris‟ (Mazumdar, 2007).   This part of the paper traces a \nform critical cosmopolitanism that emerges from modes of social learning and \nsolidarity present in a network of civil society groups based in informal settlements, \nSlum\/Shack Dwellers International (SDI).   \n \nSDI is an international network of nongovernmental (NGOs) and community-based \norganizations (CBOs).  The Indian SDI group, known as the Alliance, is a key node \nin this network and originates in central Bombay, in the struggle for housing, \ninfrastructure and services.  This struggle is peripheral to Bombay cinema and in \nsharp contrast to elitist consumption-oriented cosmopolitanism.  The analysis shifts \nfrom the portrayal of the city in film to a distinct register of inquiry and experience, \nand focuses on what constitutes the imaginaries and practices of a transurban civil \nsociety network.  SDI can be characterised as form of critical cosmopolitanism \nissuing forth from an exterior.  My central concern is with how SDI‟s \ncosmopolitanism is produced, and here I focus on SDI‟s cosmopolitanism as social, \nreproduced through the frames of group learning and solidarity.  This marks a \ncounterpoint to the tendency in discourses of liberal cosmopolitanism that \nemphasise the agency of the individual (Calhoun, 2003).  Calhoun critically locates \nmuch cosmopolitan discourse in the drive for world citizenship and global \ndemocracy developed from Kant‟s famous late eighteenth century essays written in \nthe period of emerging nation-states and individual rights (see also Mignola, 2000).  \nIn Vertovec and Cohen‟s (2002) influential collection, Conceiving \nCosmopolitanism, various contributors worry over the complicity between \n 7 \ncosmopolitanism and a Eurocentric liberal universalism that emphasizes the rights \nand responsibilities of the global citizen (Rattansi, 2003).  \n \nThese three instances of cosmopolitan imaginaries are distinct in form, nature, \nconstituency and objectives.  The first two are internal cosmopolitanisms in that \nthey are connected to elitist visions of the modern city, and the third is a critical \ncosmopolitanism that emerges from groups occupying the vacuum of nationalist \nstate modernism and are largely excluded from the lifestyles and spaces of the \ncontemporary elite cosmopolitan.  However, the examples of elite consumption-\noriented cosmopolitanism and of SDI are connected in that they are imaginaries that \nspeak back to conventional discourses of cosmopolitan Bombay by not taking the \ncommunalism and violence of the 1990s as their central reference points.  They \nremind us that there are histories and presents operating on a variety of registers \nwhich, while connected in different ways to communalism and violence, operate \nbeyond the commonplace observation of a “portrait of cosmopolitan Bombay in \nruins” (Prakash, 2005: 499). \n \nFilm, urban space and modernity \n \nMethodologically, the paper connects two seemingly distinct registers of \nexperience, narrative and portrayal: film and civil society.  Film is a key repository \nof the urban imagination in Bombay, continually reproducing and contesting \nnarratives and images of the city as variously cosmopolitan or divided, violent or \nhospitable, booming or in decline, collapsing or developing.  Mazumdar (2007: \n197) argues that cinema is “the major reservoir of the urban experience in India”, \nand brilliantly reveals the role of cinema as an archive of the modern that houses \nallegorical images of the city, claiming that cinema is “the most innovative archive \nof the city in India” (Mazumdar, 2007: xxxi).  Kaarsholm (2007: 1) echoes this \nview: “Indian films have not only portrayed the process of urbanization as a \nstruggle towards coming to terms with and formulating agendas for modernity, but \nalso as reactions to and counter-programmes against this process”.  Ashis Nandy \n(1998: 7) has been still more explicit, arguing that “the popular film is low-brow, \nmodernizing India in all its complexity, sophistry, naiveté and vulgarity.  Studying \n 8 \npopular film is studying Indian modernity at its rawest, its crudities laid bare by the \nfate of traditions in contemporary life and arts”.   \n \nAs a highly popular visual and experiential field, cinema registers distinct and \nsignificant impacts on urban discourse and imagination.  It is the starkest arena \nwhere the „city of spectacle‟ – of film, television, media, advertising, and design - is \nportrayed, a visual, experiential moment through which to reimagine the city, and \nwhich resonates with the many ways in which the material city and its people are \nchanging (Mazumdar, 2007).  Film has the capacity to illuminate the lived spaces \nof the city, and to portray the city in different ways.  The paper seeks to open up the \nrelationship between cinematic space and urban social space\n1\n.   \n \nIn contrast, civil society organizations produce their own narratives about social \nchange, and seek to contest the nature of change through multiple imaginaries and \npractices.  The civil society groups I explore in this paper operate in what \nMazumdar (2007) refers to as the „city of debris‟ - of informal settlements, dense \nneighbouroods, street hawkers, traffic congestion, construction debris, and refuse – \nwhich variously resonate with and diverge from the city of spectacle.  This is the \ndomain of lived experience, everyday struggle, routine and organization, and \ncannot be straightforwardly reconciled with the world of film.  The city of spectacle \nand the city of debris intersect in a variety of ways: in the lives of civil society \ngroups who loyally watch the latest films and sing their latest songs; in the cable \ntelevision or film advertising that is so commonly found in hutments in informal \nsettlements; by indirectly informing public debate about the nature of urban change \nand the city‟s inhabitants; or in portraying visions of the past, present and future of \n                                                 \n1\n Indian cinema is a complex industry, and at its widest includes Bombay-based „Bollywood‟ film \nproduced in Hindi, and films produced in Tamil, Telegu, Kannada, Malayalam, and Bengali.  \nBombay-based Hindi film predominates in India and has taken on a large international audience \namongst Indian diasporas as well as in the Middle East, parts of Africa, Russia and throughout South \nand Southwest Asia.  It operates on a far smaller annual turnover than Hollywood, but produces a \nmuch higher quantity of films, most of which fail to return a profit.  In this paper I am concerned \nwith Bombay-based, films which have generally sought to be „all-inclusive‟ in audience appeal \n(Kaarsholm, 2007) and which have combined dancing, simple melodies and extravagant spectacles \nwith narratives of everyday life.   \n \n 9 \nBombay‟s urban spaces.  Taken together, the intersections, homologies and \ndivergences between film and civil society offer a wider politico-cultural lens \nthrough which to view Bombay‟s contested cosmopolitan imaginaries.  In \nparticular, for my purposes in this paper, this juxtaposition of film and civil society \nreveals specific relations between the city and narratives and images of urban \ncosmopolitanism.   \n \nCosmopolitanism and modernity can be closely interlinked, and film and civil \nsociety offer two useful realms through which to read those changing relations.  It \nis perhaps unsurprising that Bombay‟s modernity has often been thought of in \ncosmopolitan terms given the city‟s historically high number of migrants and \nmulticultural make-up.  Modernity, then, is a keyword in this paper, understood \nhere as a multiple, changing site through which particular imaginaries and practices \nof the new city are deployed.  These are efforts to break from present or past \nconditions and design or live a different kind of urban life.  Again, these can be \nmore or less inclusive or exclusive, global, national or local.  The three examples \nexplored reveal specific instances in postcolonial Bombay where the relation \nbetween cosmopolitanism and the modern city is mobilized in particular ways.  In \neach instance, the specific form of the relation between cosmopolitan and modern \nalters in imaginary and practice, but the key elements of cultural pluralism in \nrelation to cosmopolitanism and new imaginaries and practices of urban life in \nrelation to modernity remain in each case. \n \nThe paper is based on fieldwork conducted over several research visits to Bombay, \nand especially two trips between October 2001 and March 2002, and November \n2005 and June 2006.  This research has focused on informal settlements, \ninfrastructure and social justice, and has involved in particular a wide range of \ninterviews with state officials, NGOs and CBOs, including repeated interviews and \nmeetings with over thirty members of the Indian Alliance and other members of the \nSDI network, as well as observations of their work.  The analysis of film is taken \nfrom existing scholarship, and in particular the work of Ranjani Mazumdar (2007), \nRavi Vasudevan (2000), Ashis Nandy (1998) and Preben Kaarsholm (2007). \n \nFrom cosmopolitan to provincial city? \n 10 \n \nOf cosmopolitan Bombay, a great deal of attention has been given in recent years to \nthe ethno-religious riots and bomb blasts of the early 1990s (Appadurai, 2000; \nVarma, 2004), to the recent terrorist attacks on the train network (Punwani, 2006), \nand to attempts to depict the city as a „global city‟ (Banerjee-Guha, 2001; Grant and \nNijman, 2002, 2004).  While any discussion of cosmopolitanism and Bombay must \nbe set against these backdrops, I hope to show here that there are other \ncosmopolitan imaginaries and practices in the city that do not take communalism or \nviolence as their points of departure.  However, before proceeding it is important to \nset the paper in the context of recent changes that have informed debates about \ncosmopolitanism and the city. \n \nAt a general level, the last 15 years have demonstrated that Bombay‟s capital-\ninduced cosmopolitanism is not inevitable.  It has become commonplace since the \nearly 1990s to talk about the demise of a cosmopolitan city and the emergence of an \nintolerant, xenophobic city in its place (Appadurai, 2000; Varma, 2004; Virani, \n2001).  This is due in particular to the mass riots that took place in late 1992 and \nearly 1993, which followed the destruction of the Babri Masjid in Ayodhya (in the \nstate of Uttar Pradesh in north India) by Hindu extremists.  The events spurred \nexisting local tensions, resulting in the worst riots in the city‟s history: 900 people \nwere killed and the psychosocial geography of the city was drastically altered.  The \nriots were followed by thirteen bomb blasts on 12\nth\n March, 1993, the most \ndestructive bomb explosions in Indian history, which killed over 250 and left 700 \ninjured.  The bombs targeted key political and economic structures in the city, \nincluding the stock exchange and the political headquarters of the Hindu extremist \nparty, the Shiv Sena (Shivaji‟s Army), and were widely interpreted as retaliation by \nMuslim gangs to the riots (Zaidi, 2003).   \n \nGyan Prakash (2006: 98) states: “The communal violence and bomb blasts left \nmany people wondering if Bombay‟s cosmopolitanism had just been a façade”, but \nrightly cautions: “The death of the city gives birth to an imagined past” (ibid. 88).  \nTensions between Bombay‟s different groups were, of course, present in the city \nbefore these riots.  In 1956, shortly before the city was made the capital of the new \nlinguistic state of Maharashtra, there was violence between groups demanding that \n 11 \nthe city become the capital of a Gujarati state and those demanding it go to \nMaharashtra (Appadurai, 2000: 628).  In 1984, the city witnessed the first major \ncommunal riots since Independence (Punwani, 2003).  In many of these cases, the \nShiv Sena played a crucial mobilising role (Hansen, 2001).  One of the most \nxenophobic regional parties in India, the Sena is a pro-Marathi movement formed \nwith the objective of ethnic control of Bombay and Maharashtra.  Founded in 1966 \nby former cartoonist Bal Thackeray, who remains the party‟s president and \nauthority, the party has sought to fight for the „sons of the soil‟ through any means \npossible.   \n \nInitially, south Indians were the targets, their very presence portrayed as \nresponsible for denying native Maharashtrians jobs.  Gradually, the enemy morphed \ninto Muslims, who were closely associated with the Pakistani „terrorist threat‟ in \nSena propaganda.  During the 1980s and 1990s, the party capitalised on the waning \nsupport for the Left following, in particular, the unsuccessful attempts by unions \nand left-wing parties to resolve the textile strike in the early 1980s (Shaikh, 2005).  \nIn more recent years, the Sena has associated itself with the national Hindutva (the \nland of Hinduness) movement across the country, and in particular with the \nBharatiya Janata Party (BJP), a major national party of the Hindu right.  As \nAppadurai (2000: 643) has observed, this articulation frames the city “as a point of \ntranslation and mediation between a renascent Maharashtra and a re-Hinduized \nIndia”.   \n \nThe zenith of the Sena movement arrived when the party made it into power at both \nthe city and state level in Maharashtra in 1995.  It was during its time in state \ngovernment that the party renamed Bombay as „Mumbai‟.  Mumbai has been \ncommonly used historically by Marathi speakers, distinct from the „Bambai‟ used \nby Hindi speakers.  This renaming should not be confused as a straightforward \neffort to shake off an English colonial heritage; it is an active attempt to reinscribe \nthe space of the city as Hindu, to the exclusion, in particular, of Muslims (Hansen, \n2001)\n2\n.  This has often manifested itself in the demolition of informal settlements \n                                                 \n2\n It also involved the renaming of various roads and buildings, including the city‟s iconic Marine Drive, \nthe backdrop for many films set in Bombay.  Although still known throughout the city as Marine Drive, \n 12 \nwith high proportions of Muslims.  The Sena has since lost the state to Congress, \nbut retains control of the municipal corporation.  Despite recent preoccupations \nwith feuds among the Thackeray family leadership, and a number of defections to \nCongress, the party retains a strong grassroots base in Maharashtra.  The process of \nethnicization of city-space linked to the shift to „Mumbai‟ represents, for Appadurai \n(2000), a critical moment in the „decosmopolitanization‟ of Bombay, what Varma \n(2004) calls the city‟s „provincialization‟.  However, notwithstanding the scale and \nforce of these events, claims that Bombay has undergone a general social \ntransformation from the early 1990s onwards are overstated, and fail to account for \nthe multiple forms of cosmopolitan imaginary that operate on a variety of historical \nand spatial registers in the contemporary city.  They assume that the city before the \n1990s was cosmopolitan, and attribute too much causal efficacy to the riots and \nsubsequent bombings.  In addition, there are a wide variety of alternative \ncosmopolitan rubrics, reflected in civil society organizations, lifestyle changes for \ndifferent groups, and often vividly portrayed in film.  While there are important \ndistinctions with the past, these cosmopolitanisms often resonate with the Bombay \nthat existed before the 1990s. \n \nNational modernism: film, planning and urban justice \n \nIn the early postcolonial period, following Indian Independence in 1947, a great \ndeal of film – especially those of the legendary director and actor, Raj Kapoor – \nconnected the city with the nationalist vision of modernist planning and social \njustice.  Independence linked the nationalist movement with the projects of \ndevelopment and democratisation, both of which were often presented as signalling \na break with colonial government (even if the continuities were stronger than \nimplied, see Bose and Jalal, 1997; Corbridge and Harriss, 2000; Legg, 2006).  The \nconstitution combined fundamental and directive rights that enabled universal \nsuffrage, welfare reform, and reserved places for groups such as harijans (dalits, or \n„the oppressed‟).  The vision of nationalist modernism emerged most powerfully in \nthese early years of Independence, when the Indian state was wrestling between \n                                                                                                                                            \nthe formal name is now Subhash Chandra Bose Marg, after the nationalist anti-colonial leader who was \noften accused of fascist sympathies due to his links with the Nazi party in Germany.   \n 13 \nGhandian conceptions of India as village-based and Nehruvian visions of India as \nan urbanising country moving towards modernity.  In this latter narrative, the cities \nwhere to be the loci of progress, opportunity and social justice.  Bombay, the \ncommercial capital of India since well before Independence, became a key site for \nthis vision.   \n \nMany films of this period sought to portray the possibilities and dangers of national \nmodernity through the city.  Narratives of urban alienation and moral corruption, \noften represented in figures of the tramp and the refugee were particularly common, \nalongside utopian visions of urban equality.  I connect this moment with the 1955 \nclassic of Indian cinema, Shri 420, directed by and starring Raj Kapoor (Figure 1).  \nShri 420, along with several other films of the 1950s, addressed the opposition of \ncity and countryside.  One of its most famous songs, „Ramayya Vasta Vayya‟ \n“generates an imagined universe of the village as a counterspace to the harshness of \nthe city” (Mazumdar, 2007: 45).  Kapoor captured a notion of the city as both a \nplace of class division and oppression, narrated through films like Awara (1951) \nand Shri 420, and a site of struggle for social justice, echoing the frequent labour \nstrikes of the period (e.g. of the mill workers) and the activities of the communists \n(Prakash, 2006).  Writing about this period, Ravi Vasudevan suggests (2000: 116) \nthat “the cinema of that time communicated a popular democratic perception which \nworked through some of the rationalist and egalitarian approaches of the liberal-\nradical intelligentsia, but on its own terms”. \n \n 14 \n \nFigure 1: Shri 420, Film Poster \n \nKapoor frequently deployed the figure of the tramp, as Kaviraj (2007: 69) writes: \n“In some Hindi films, particularly those by Raj Kapoor, the figure of the tramp as \nChaplin is taken up with modification as the „natural‟ carrier of such an outsider‟s \nvision”.  His (1951) Awara portrayed this through the homeless man, an unloved \ntraveller on an uncharted lonely path singing songs of happiness (Bakshi, 1998: \n104), a theme echoed in Shri 420 and Jagte Raho (1956) (see Gayatri Chatterjee‟s \n1992 (2003) study, Awara).  A close associate of Kapoor‟s in film, Khwaja Ahmed \nAbbas, formulated the story for Shri 420.  Abbas was a committed Marxist who \nwas already becoming disillusioned by politics by 1949, when he published a series \nof articles in the Bombay-based popular magazine, Blitz, listing the socialist \npromises Nehru had made but was failing to implement.  Of Abbas, Kapoor and \nShri 420, Bakshi (1998: 108) writes: “They had a critique of the unfulfilled \npromises of Independence but they were not entirely disenchanted then”.  Shri 420 \nconnects the city with Nehruvian national discourses of economic opportunity and \nsocial justice.  Indeed, Kapoor has acknowledged that he sought to portray, in \nVarma‟s words (2004: 67), a “period of Nehruvian effervescence about the \npossibilities of a modern, socialist and secular nation as embodied in the space of a \nwell-planned city”.  Varma (ibid) has argued that the film “commented on the \nhopes and desires of countless migrants who flocked to the city looking for both \neconomic opportunity and social justice”.   \n \n 15 \nWhen the film was released in 1955, Bombay‟s cinema halls and streets echoed to \nRamayya Vasta Vayya, the film‟s main song which “virtually became a national \nanthem” (Bakshi, 1998: 107).  The film itself is a rags-to-riches tale of greed, urban \nimmorality, and modernist possibility.  It begins with the main character, the young, \nChaplinesque Raju played by Kapoor, setting off on the road and ending up in \nBombay.  On his way along dusty roads from the north Indian town of Allahabad, \nmuch is made of Raju‟s poverty and amiable naiveté.  To this lively, cheery tune, \nhe skips along the lonely road in a nonchalant manner: \n \nMera joota hai Jaapani \nYeh patloon Englistaani \nSar pe laal topi Russi \nPhir bhi dil hai Hindustani \n \n(My shoes are Japanese \nMy trousers English  \nOn my head, red Russian hat \nMy heart‟s Indian for all that) \n \nRaju soon comes across a sign stating that Bombay is 420 miles away and decides \nto follow it.  The 420 in the title of the film has a double-meaning, it references not \njust distance but a section of the Indian penal code enforced for crimes of petty \nfraud and trickery, so the title in effect means Mr Fraudster, connecting immorality \nwith Bombay from the start.  Raju arrives in the city to bustling streets of traffic, \npeople, buying and selling, making him dizzy and appear lost and out-of-place, in \nsharp contrast to the relaxed joviality with which he traveled to the city.  His first \nmeeting is with a beggar, who tells him that people in Bombay hear nothing but \n“the jingle of coins”.  The beggar goes on to tell Raju that the educational \nqualifications, commitment to work, and gold medal for honesty that Raju says he \nhas brought with him will mean nothing in Bombay, but that “if you live by lying \nand cheating there are 420 ways” to get by.  This signals Raju‟s arrival in India‟s \ncommercial city par excellence – he has traveled from a provincial Indian town to \nan island separated from the mainland not just by the Arabian Sea but by the \nruthlessness of capital.   \n 16 \n \nFor Varma (2004: 65), Raju‟s song announces an “arrival into cosmopolitanism”, \nembodied in his scrappy attire as much as in the portrayal of Bombay as city of \nmigrants.  The film casts Bombay as a both a potential site of greed, moral \ncorruption, and alienation, and as potential site of opportunity and justice.  Through \nthe film, different characters and story lines portray a city of progressive \nnationalism – a well planned city tolerant of difference that provides opportunity \nand amenity to all citizens.  For example, Raju is exposed to narratives of urban \ninclusiveness and justice through a group of pavement dwellers he befriends in the \ncity.  This contrasts with the provincial and exclusionary nationalism that other \ncharacters, beset by greed, embody.  The film narrates Raju‟s redemption from \ngreed and trickery and ends on a note of optimism for the city and its future, \nemphasized by the image of Raju and his new found love, Vidya, looking out \nhopefully at a panorama of the city in the final scene.  Shri 420 suggests to the \nviewer that the city, with commitment from the state and the public, can be a site \nboth for cosmopolitanism and progressive nationalism.   \n \nHowever, off the set Kapoor became increasingly disillusioned as he aged, and \nfound progressively less hope in the prospects of the modern and just city.  Bakshi \n(1998: 94) argues that the progressive nationalism Kapoor sought to optimistically \nportray in Bombay met its end in the violence of the national emergency in the \n1970s: “In some ways the enterprise of Kapoor and the Indian „project‟ ran \nparallel”, from the hopefulness of his Jis Desh Mein Ganga Behti Hai (The Land \nwhere the Ganges Flows) to the jaded Ram Teri Ganga Maili (Ram, your Ganges is \nsoiled\/dirty), which journeyed from “its Nehruvian „tryst with destiny‟ to Indira \nGandhi‟s assassination and the growing political and social violence” of the late \n1970s.  On the emergency and its aftermath, he writes (1998: 93): “How did we \njourney from the ideals that Nehru appeared to embody to their betrayal by his own \ndirect descendents?”  A national state of emergency, lasting between 1975 and \n1977, had been declared by President Fakhruddin Ali Ahmed on the advice of \nCongress Prime Minister Indira Gandhi.  This followed opposition attempts to \nsecure Gandhi‟s resignation when the High Court of Allahabad declared that her \nelection had involved corrupt practices.  Gandhi used the emergency to assert \nauthoritarian control over her party and the opposition, to aggressively put an end to \n 17 \ntrade and student union strikes and protests, to demolish informal settlements across \nthe country, and to install a draconian family planning program of forced \nvasectomy.  Much of the violence of the emergency was played out in cities.   \n \nHowever, the destabilizing of the early postcolonial vision of urban development \ncannot be solely attributed to the authoritarianism and violence of the emergency \nalone.  From the early 1960s, there was a growing disenchantment with the \nnationalist vision of the well-planned, ordered and just Bombay which emerged \nfrom rapid, haphazard urbanization and growing urban poverty.  For example, in \n1965, a collection of Bombay‟s leading architects - Charles Correa, Pravina Metha \nand Shirish Patel - were involved in the publication of an influential special issue of \nthe Bombay-based architectural magazine Marg (Modern Architects Research \nGroup), Bombay Planning and Dreaming.  This issue argued that the solution to \neasing congestion in Bombay lay in a new, well-planned modernist „twin city‟ - \nNew Bombay - made-up of twenty inter-connected but self-contained towns.  If \nMarg‟s arguments for New Bombay were highly influential among Bombay \nplanners and middle-classes, it was as much to do with a sense of hopelessness \naround the possibilities of improving rapidly urbanising congested Bombay, than it \nwas for an enthusiasm around modernist planning ideals (Shaw, 1999).   \n \nThe discussion of the postcolonial model of national urban development and its \nsubsequent crisis, then, needs to be connected to a confluence of factors, including \nhistories of political violence and a failure of planning and administration, which \nconnect nation, development and identity.  Cinema reflected this, particularly \naround the themes of violence, despair, and the sense of failure and nonlegality of \nthe state.  Indeed,  Mazumdar (2007: 7) has argued: “Reworking a certain vision of \nmodernity in which the state is the sole repository of legitimate action, the hero \ntook on the role of smuggler [e.g. Deewar, 1975]…The moral divisions between \nlegal and nonlegal, the legitimate and the criminal, grew increasingly fuzzy, \nopening up a reflection on dystopian forms in urban life”.  In this context, the \ncinematic antihero emerged, embodied most explicitly in the actor Amitabh \nBachchan (e.g. Amar Akbar Anthony, 1977), reminiscent of the James Dean or \nMarlon Brando rebel characters of post-war Hollywood cinema.  This is a form that \nexpressed the insecurities of modernity that it then addressed through poetic justice \n 18 \n– the form of the melodrama, a performance of excess and emotionally charged \nfilm.  The „angry man‟ figure of 1970s film addressed the crisis of the period – a \ncrisis of national development - as a furious figure representing the margins of \nurban society and railing against a corrupt and often repressive state (Mazumdar, \n2007).   \n \nIf in the 1950s Kapoor sought to portray with cautious optimism a Nehruvian vision \nof Bombay as cosmopolitan and progressive, this popular vision had unravelled in \nthree decades, losing ground to disillusionment, anger and frustration.  In Bombay, \nsince the emergency, another key instance of the destabilising of a modern \ncosmopolitan imaginary can be identified in the Bombay riots of the early 1990s, \nwhich emerged not just from communal tensions but from resentment at the \nenduring poverty in the city: “After 1993, the deep emancipatory moment of the \nurban modern, which spoke to new visions of community, independence and \nfreedom, was shattered” (Mazumdar, 2007: 30).  However, far from marking the \n„decosmopolitanization‟ or „provincialization‟ of Bombay (Appadurai, 2000; \nVarma, 2004; Virani, 2001), alongside the slow unravelling of the nationalist \ndevelopmental and cosmopolitan view of the city a variety of other cosmopolitan \nmodernisms have taken shape.  One example of this, well documented in cinema, is \na global consumption-oriented cosmopolitanism associated with high-end urban \ninteriors.  While the next part of the paper begins by discussing this cosmopolitan \nglobal modernity and its portrayal in Bombay cinema, it will shift then focus to a \ndifferent set of global cosmopolitan imaginaries and practices that emerge not from \nelite lifestyles but from poverty and informal settlements.   \n \nGlobal modernism: new urban cosmopolitanisms \n \nRanjani Mazumdar (2007) traces a particular cosmopolitan imaginary at work in \nrecent film, especially new family films, which present an image of modernity as \nglobal consumption and which connect with a range of changes to the political, \neconomic, social and physical landscapes of the city.  These films often reveal \nglamorous, globally aware individuals, predominantly located in luxury residential \nand café interiors in Bombay or elsewhere in the world.  She points to the \nmaterialization of a new kind of “surface culture” that is central to this emergent \n 19 \ncity of spectacle, where surface “refers to the expressive forms of architecture, \nadvertising, print, television, film and fashion” (Mazumdar, 2007: 110).  This form \nof modernity is rooted in an explosion of new kinds of high-end design, advertising \nand commodity circulation, creating distinct links between consumption and the \naestheticization of urban space: modernity as consumer cosmopolitanism.  As \nIndian cities have increasingly globalised, laden with a wide range of images and \ncommodities of contemporary capitalism, “the urban references are not just \nBombay and Delhi, but London and New York” (Mazumdar, 2007: xxii).  \nMazumdar describes this as a kind of urban desire for scale and spectacle, vividly \nexpressed in film.  This desire is marked by an anxiety around the cultural politics \nof globalisation.  For example, there is a persistent return in recent films to a \nspecific „Indianness‟, a particular understanding of tradition, reflected in, for \ninstance, the family photograph advertising used for Kabhi Khushi Kabhie Gham \n(2001), a film about a globalised family that moves through high-end spectacular \nurban India to the urban spaces of London\n3\n (see Figure 2).  \n \n                                                 \n3\n Indeed, part of the explanation for the popularity of Indian films in the Middle East is to do with \nthe portrayal of the large, relatively stable and traditional family unit that resonates still in new \nfamily film, as opposed to the narrative of family dysfunctionality often shown in American films \n(Kaarsholm, 2007).   \n 20 \n \nFigure 2: Kabhi Khushi Kabhie Gham, Film Poster \n \nMazumdar positions these changing depictions of the city in film in a wider context \nof urban transformation in Bombay, linking these disparate sites with the concept of \nurban delirium, “in which commodity display, the crisis of space, new kinds of \narchitecture, the spectacle of film, and television converge” (2007: 111).  Much of \nthe interior spaces in new family film mimics the experience of proliferating air-\nconditioned shopping malls in the city, where the shopper is exposed to “the \ncommercial, aesthetic, and architectural splendour of interior spaces” (Mazumdar, \n2007: 148).  Mazumdar argues that in South Asian cities, this commodified world is \npossible only through simulation: “The panoramic interior expresses a crisis of \nbelonging, fear of the street, and the desire for the good life – all at once” (ibid).  \nThese films are “created as perfectly designed and landscaped sets, the new \ninteriors have emerged as the space of the „virtual city‟, where the Bombay of \nclaustrophobia is made to physically disappear” (Mazumdar, 2007: 117).  There is \nlittle scope for urban social justice in these elitist articulations of the city, which \nseek not to address the city‟s poverty and „residual spaces‟ but to banish them from \nview.  However, this „city of spectacle‟ continually intersects with the „city of \ndebris‟.   \n 21 \n \nThese cinematic depictions represent changes that have taken place in the city over \nthe past 15 years.  If Bombay is often spoken and written of as India‟s „most \nmodern city‟ (Rao, 2006), this discourse has taken a new turn with the emergence \nof a managerial and technical elite associated with the growth of global financial \nservices in particular parts of the city (Grant and Nijman, 2002).  The geographies \nof these groups are increasingly segregated and exclusive, reflecting new spaces of \nglobal connection and local disconnection, and associated with particular images of \nwhat the modern Indian city should look like.  There has been an important role in \nthis regard, as Partha Chatterjee (2004: 143) has argued, for the “intensified \ncirculation of images of global cities through cinema, television, and the internet”, \nand through the increasing tendency of the elite and middle classes to travel \nglobally.  In addition, the proliferation of new residential enclaves that mimic \nEuropean and American cities, often expressed vertically given Bombay‟s high real \nestate costs, provide escape from the city of debris through elevation.  These \nchanges and forms of urban escapism are accompanied by the transformation of \ninteriors, from cafes and residences to banks and offices.   \n \nThe state plays an active role in these changes, and is increasingly seeking to attract \ninvestment and to develop infrastructure that will facilitate new globalising service \nand financial industries.  Recent years have witnessed intense debates around the \ntransformation of public space, provoked particularly by an increasing \ncorporatisation of space that has followed India‟s economic liberalisation reforms \nin the early 1990s (Corbridge and Harriss, 2000).  For example, a recent \ncontroversial ruling by the Supreme Court will see two-thirds of the vacant former \n„mill lands‟ in the centre of the city transformed not into social housing as many \nhad hoped but into shopping malls and corporate entertainment (on the decline of \nthe mills, see D‟Monte, 2002).  These developments have been closely associated \nwith the demolition of informal settlements, which in recent years have been coded \nless by ethnicity than politico-corporate Bombay‟s self-declared trajectory to \nbecome the „next Shanghai‟ by 2013 (Bombay First, 2003).  To this end, an \nestimated 90,000 huts were torn down during the winter of 2004-2005, leaving \nsome 350,000 people homeless and without alternative accommodation.   \n \n 22 \nMazumdar (2007) argues the city of debris and the city of spectacle converge and \ndiverge in a range of ways, from the self-styled high-end cosmopolitan identities \nportrayed by groups of the poor, including imitations of western fashions and the \nsurge to embrace the flood of new technologies; film and television; and the \ntransformations in residential and commercial interior design.  While her case is \ncompelling, there is a danger here of reducing the „city of debris‟ to a set of residual \nspaces that simply seek to imitate the city of spectacle.  Within this city of debris \nare multiple forms of living, getting by and imagining the city that do not conform \nto this consumer-oriented city of spectacle, even in the informal hutments that \ncontain the cable television and saturated advertising that Mazumdar highlights.  \nThere are distinct social imaginaries and movements being carved out from the \ninterstices of experiences and struggle in the Bombay „slum‟, and it is to one \nrevealing example of this that I now turn.  This example briefly tells the story of a \ndistinct set of imaginaries and practices that remains global in scope but which are \nproduced through the work of people living at ground level in informal settlements \nrather than the high-end residential complexes that tower over the city.  This \nmovement, like several other social movements and civil society groups in the city, \narticulates a progressive urban imagination that seeks justice for the poor.  This \nimagination resonates with the modernist visions of filmmakers like Kapoor \nworking in the early years of Independence in its collectivist struggle for universal \nprovision, although it is distinct both because of its global scope and in its \ninsistence that the informal settlement, rather than the national state, remain the \ncentral reference point.  In addition, it is another instance of cosmopolitanism that \nexists largely outside the rubric of communalism and violence. \n \nSlum cosmopolitanism: global exchange and the informal settlement  \n \nA few blocks from Mumbai Central railway station, in the generally middle-class \nneighbourhood of Byculla, is the resource center of the National Slum Dwellers \nFederation (NSDF) and Mahila Milan („Women Together‟), two of the groups that \nmake-up the Bombay chapter of Slum \/ Shack Dwellers International (SDI).  SDI \nseeks basic housing, infrastructure and services for the urban poor, and is a global \nnetwork that owes its existence to a programme of international exchanges initiated \nlargely by a mixed bag of activists working in central Bombay.  The resource center \n 23 \nis a support network for NSDF and Mahila Milan members across the city, and acts \nas a nerve-center for the national and international network of which the NSDF and \nMahila Milan are a part.  It is a hub of activity: the three phones ring frequently \n(every couple of minutes or so, mostly for male leaders of NSDF) and people from \nthe local area constantly come in and out, some depositing money, some asking for \nloans, and some for advice from the NSDF individuals available.  During telephone \ncalls, as Appadurai (2001: 30) has commented based on his work with these groups, \nleaders “exchange information about breaking crises, plans and news across these \nvarious locations in Mumbai – and also across India and the world…a call [is] as \nlikely to come from Phnom Penh or Cape Town as from Mankhurd or Byculla [in \nBombay]”.   \n \nThe third organisation in this Bombay network is an NGO called the Society for \nPromotion of Area Resource Centres (SPARC), an NGO set-up by middle-class \nactivists in the early 1980s.  This tripartite group refers to itself as the Alliance \n(McFarlane, 2004, 2007).  Mahila Milan is predominantly but not exclusively a \nwoman‟s organisation.  Most of the women live in pavement huts and are generally \nformally uneducated, although many have now been members of municipal \ncommittees and have travelled to different countries to take part in exchanges with \nother groups.  The Byculla group is made up of fifteen predominantly Muslim \n„leaders‟ (one of which is male) most of which have gone to around five different \ncountries in the past fifteen years or so.  However, as one SPARC official said, they \n“never introduce themselves as international leaders…their identity is very \nlocal…they view their role as peer support and will talk about their own area”.  600 \nwomen are members of Mahila Milan in Byculla alone (Patel, 2001: 7), and groups \nmembers generally work well together despite their often different religious, ethnic \nand caste backgrounds.  Mahila Milan‟s work predominantly involves organizing \nand running daily savings schemes; providing a forum for mobilizing and \ndiscussion women‟s support, rights, and short- and long-term plans; negotiating \nwith the local state, building and police officials; and participating in exchanges.  \nThese exchanges involve groups of poor people traveling from one settlement to \nanother to share stories and experiences with other poor people in what amounts to \nan informal „training‟ process.  The exchanges have facilitated the formation of the \nloose transnational network, SDI. \n 24 \n \nSDI is a host of civil society groups supported by a range of donors and \ngovernments (see Edwards, 1999; Patel and Mitlin, 2002; SDI, 2003; McFarlane, \n2006a).  The network spans predominantly Asia and Africa, including Cambodia, \nColombia, India, Kenya, Namibia, Nepal, the Philippines, South Africa, Sri Lanka, \nSwaziland, Thailand, and Zimbabwe, and is associated with groups in many more \ncountries.  SDI, following Batliwala (2002: 396) has a „grassroots‟ focus.  This is to \nsay that the network is predominantly constituted and controlled by those “who are \nmost severely affected [by urban poverty] in terms of the material condition of their \ndaily lives”.  There is a regular program of exchanges internationally that have been \nongoing since the late 1980s.  Patel, Bolnick, and Mitlin (2000: 402) suggest SDI‟s \nwork “is not a global process that focuses on international policies and practices but \nit is global in outreach and strengthens groups‟ capacity to deal with what is \noppressive and exploitative within their local environment.”  In SDI, struggle \nremains the locality (for example, the local municipal corporation), and this is \ninformed in part, as Saskia Sassen (2003: 11) has remarked, by “the knowledge and \ntacit innovation of multiple other localities around the world engaged in similar \nlocalized struggles with similar local actors”.  It is a capacity-building movement \nthat seeks to develop the skills of the poor in order to negotiate with government, \nand even to self-build housing and infrastructure solutions.  In campaigning for \nhousing, infrastructure and services it is modernist in its objectives, but in its \nmethods SDI differs from many twentieth century movements in that it is cautious \nof the state, seeking to negotiate with whoever is in power without ever becoming \naligned to a single political party. \n \nSDI‟s work has been driven by a set of strategies that largely originated with the \ncentral Bombay group, including daily savings and credit schemes, supporting \nwomen in development, enumerations\n4\n of settlements, mapping of settlements, \nexchanges of poor people between settlements (locally, nationally and \ninternationally), the forming of national networks, house and toilet exhibitions, \n                                                 \n4\n Enumeration in SDI refers to a census conducted by people on their own and in other urban areas. \n 25 \nland-sharing models\n5\n, and partnerships with authorities based on a commitment to \n„non-party alignment‟.  This „box of tricks‟, as one SPARC leader put it, has \ntravelled through exchanges.  The Indian group has played a key role in co-\nordinating, designing and participating in exchanges and in the movement of \nstrategies and ideas around the network.  The strategies listed above are explicitly \nframed as guidelines to be translated from place to place, rather than as models that \nare to be copied.  For instance, in the translation between places, daily savings may \nbecome monthly savings in accordance with different earning patterns, and model \nhouses for exhibitions may draw on different materials and deploy different spatial \ndimensions in accordance with local conditions and preference.  Alternatively, one \ngroup may prioritise sanitation, whereas another may prioritise data collection \nthrough enumeration in the hope of using the data to influence authorities.  In \ncontrast to the global circulation of high-end interior and exterior design we find in \nparts of globalising Bombay, design in SDI is grassroots oriented and based on \nbasic local needs and preferences informed by global conversation and exchange. \n \nThrough both a programme of learning that has emerged around the travelling \nstrategies described above, and the production of new modes of solidarity, SDI \nconstructs a particular critical cosmopolitanism.  I do not wish to suggest that there \nis a singular cosmopolitanism in SDI, but trace the general form that these \ncosmopolitan imaginaries take and the practices that inform them.  Solidarities \nreflect the notion that SDI member groups, while living in different contexts, share \na perceived common space on the socio-economic and political peripheries of the \ncity.  These solidarities are reproduced through the travelling of knowledge, ideas \nand practices that takes place around the strategies outlined above.  SDI‟s \ncosmopolitan imaginaries are social: they are produced through learning practices \nthat take place in group activities (McFarlane, 2006b).  The social form of SDI‟s \nparticular kind of cosmopolitanism marks a contrast from the emphasis in much \ncosmopolitan discourse on the agency of the individual (Calhoun, 2003; Rattansi, \n                                                 \n5\n „Land-sharing‟ refers to state housing policies that involve housing construction for the poor being \ncross-subsidised through part private sale, a scheme that has proven highly controversial in Mumbai \nin the form of the Slum Rehabilitation Authority (SRA) scheme (Mukhija, 2004).   \n \n 26 \n2004).  The next two sub-sections will expand on social learning and solidarities in \nmore detail. \n \nSocial learning \n \nThe most frequent way in which learning is referred to in SDI is in terms of \n„learning-by-doing‟ in groups (ACHR, 2000; SDI, 2003; Patel and Mitlin, 2001).  \nLearning is conceived as taking place “in situ” (Homeless International, 2000: 7).  \nFor example, SPARC have written about learning in exchanges: “Normally NGOs \ndesign workshop-type exposure programmes where the week‟s programme is \norganised in advance.  We have never used that system, because we are quite clear \nthat the most effective way in which people learn is practically, by doing things” \n(ibid).  This means that learning occurs through an “immediate immersion in the \nongoing projects of the host community” (Appadurai, 2002: 41).  This immersion \ncan be any of a whole range of activities, ranging from “scavenging in the \nPhilippines and sewer digging in Pakistan to women‟s savings activities in South \nAfrica and housing exhibitions in India” (ibid).  Taking part in practices in a given \nplace mediates the relationship between different groups.  Visiting groups tend to \nparticipate in whatever local activities are going on at the time of the exchange, \nfrom methods for designing toilet blocks to fraught negotiations with local \ncontractors around the delivery of construction materials.  The insistence on social \nlearning taking place through groups of the urban poor rather than through \nprofessionals characterises learning in different parts of the SDI network, as the \nfollowing quotation from Amita Mbaye, part of a Senegalese Savings and Loan \nNetwork, indicates: \n \nWhen I asked the technician (who works with us in Dakar) to show us how [housing] layout plans \nare designed, he used such sophisticated jargon that I barely understood a word he said.  In Protea \nSouth (Gauteng, South Africa) during our last evening, we asked a woman to draw us a plan.  When \nshe explained house modelling, I understood and felt that I too could do it (Patel and Mitlin, 2002: \n132). \n \nTo some extent, then, learning in SDI is a product of displacement.  This is learning \nas a relational process combining „near‟ and „far‟, a process that in some measure \n 27 \ncalls such binaries into question.  SDI members learn about daily savings, \nenumerations, exhibitions, exchanges, or negotiations with authorities, by \nparticipating in the practices of groups and through local, national and international \nexchanges.  Knowing in SDI, then, is the ability to participate in the practices of \nsocial groups, and to be open to the ideas and activities of struggle in different \nlocalities, meaning that both learning and the result – for example, a model house, \ntoilet block, or set of documents for an enumeration - take on a cosmopolitan \ncharacter.  Ideas about housing construction, enumeration, daily savings, or \nnegotiating tactics with the state, garnered through years of experience living in \noften neglected parts of the city, circulate and are translated through exchange in \ndifferent urban contexts, with the Bombay groups taking on a key „teaching‟ role in \nthe SDI network.   \n \nIn exchanges, particular individuals and groups within SDI are more or less \ninfluential, and there is a politics of replication at work in the network that reveals \ncommunity groups as not simply part of SDI networks but subject to them.  For \nexample, in the Piesang River area of South Africa a member of the Homeless \nPeople‟s Housing Federation “explained that the visitors from India [Bombay] had \nadvised them to build communal water points, as a collective space where women \ncould talk about the Federation – however, the Federation women of Piesang River \nhad their minds set on the conventional on-site access to water, and this had \nremained their demand” (Huchzermeyer, 1999: no pagination).  This indicates a \ntension in SDI.  On the one hand, SDI seeks to encourage autonomy and change in \nthe learning process as knowledge travels.  On the other hand, SDI, by virtue of \nencouraging the travelling of knowledge, creates the possibility of travelling \nknowledge and ideas, especially from influential SDI leaders in groups such as the \nBombay Alliance, marginalising local concerns.     \n \nDespite these difficulties of negotiating insider\/outsider relations, the specific form \nof worldliness that SDI leaders reflect is constituted by local experience and \ntranslocal interaction, and is productive of the particular kinds of imaginations and \npractices of SDI members.  There are political consequences of this locally: \ncosmopolitan knowledges are mobilised in local political negotiations, for instance \nthrough the use of enumeration data or housing exhibitions in political negotiations \n 28 \n(these politics are not without their difficulties, and I do not wish to appear to \nromanticise SDI‟s work – see, for instance, critical commentary in McFarlane 2004, \n2007).  This account of SDI‟s cosmopolitan practices parallels Craig Jeffrey‟s \ndescription of Jat young men's „straddling strategies‟ in his paper in this volume \n(and see his earlier work on low caste leaders' political strategies, Jeffrey et al, \n2005). \n \nSolidarities \n \nWhile much cosmopolitan literature has described solidarity as solidarity to an \nabstract humanity at large (Rattansi, 2004), solidarity in SDI is not universal but \nspecific and grounded.  These are solidarities to other groups of the urban poor, and \nthe specific solidarity networks are multiple and over-lapping, including \nneighbourhood SDI co-operatives, nation-wide SDI federations, and SDI as a \ntranslocal network of the urban poor.  They are solidarities that reflect a sense of \nbeing in a similar position on the social, economic and political margins of the city; \nexterior to the global design and promise of capitalist modernity (Mignola, 2000; \nPollock et al, 2000).  They are structured in part through, for instance, class, \ngender, caste, ethnic, religious, and family based solidarities that might extend to \nrural areas or other towns and cities.  Gender based divisions are perhaps the most \nimportant in SDI.  These come in the shape of male dominated city groups, which \nin terms of decision-making and government negotiation often sit hierarchically \nabove the female dominated savings groups.  Translocal solidarities negotiate these \nmultiple divisions and evolve through a range of activities that accompany \nexchanges, such as the sharing of stories about coping with housing demolition, \nmusical events, festivals to mark the opening of new toilet blocks or the completion \nof new housing blocks, the vernacular documentation of exchanges through reports \nand, not uncommonly, even poetry about exchanges\n6\n.   \n                                                 \n6\n For instance, Patrick Hunsley Magebhula, President of the South African Homeless People‟s \nFederation, has indicated some of this solidarity in his poem about the exchanges between South \nAfrica and India, entitled „Face to Face‟:  \n“Face to face with one another \/ Face to face with reality \/ Face to face with poverty \/ It is for real \nwe are poor \/ It is for real we need each other \/ The grass cannot live without roots \/ Government \ncannot survive without people \/ Fish cannot live without water \/ We have to live for each other \/ We \n 29 \n \nLocal solidarities do not just overlap with translocal solidarities in SDI, but are \nreconfigured by translocal exchanges.  There is a fragmentation in this process as \nnew solildarities get produced and existing solidarities are challenged.  For \ninstance, it is usually the same people that constitute exchanges, people that SDI \nleaders believe have become key illustrators of SDI‟s activities, such as the Byculla \nMahila Milan group.  ACHR has described these groups as “vanguard \ncommunities”:  \n \nThe ones up at the front of the line, the innovators, the risk takers, the go-getters.  So in Bombay, \nyou have your Byculla Mahila Milan, and in Pune [India] there's Rajendranagar.  Then South Africa \nhas its Philippi and Zimbabwe has its Mbare. In Phnom Penh you have Toul Svay Prey and in the \nPhilippines it's Payatas.  These communities become demonstration centers and hosts of \ninnumerable exchange visits (ACHR, 2000: 9). \n \nThe use of these kinds of groups has the consequence of implying that these are \nmore learned and worldly members of SDI.  While this can create local tensions, \nsome of these tensions have been addressed both through existing solidarities found \nin local SDI co-operatives, and through a sense of participation and exposure to \nSDI‟s international horizon through visits from other international groups.  \nSolidarities produced through exchange are also gendered: it is generally women \nwho go on exchanges, sometimes producing pride or resentment in husbands left at \nhome.  This is particularly unusual in societies such as India‟s, where it is, \ngenerally speaking, men who are more mobile, with women remaining at home or \naccompanying men, for instance in migration for work.  Translocal solidarities in \nSDI are not universalistic „citizen of the world‟ solidarities, nor are they necessarily \nabout tolerance and openness.  They emerge in the form of mutual support, even if \nthat support and encouragement is often superficial (for example, sensitive issues \n                                                                                                                                            \nhave to come face to face with reality \/ It is for real that we need each other \/ The city cannot survive \nwithout the hobos who will eat the crumbs that fall from the rich \/ We are part of daily city life \/ We \nhave come face to face with other squatters \/ We have come to learn from each other \/ Yes, we saw \npain, courage, endurance and perseverance in one another‟s eyes \/ There were no solutions to our \nneeds \/ We only had each other‟s unity, strength and experience \/ We were face to face with reality \nand poverty \/ We cannot live without India and India will suffer without South Africa” (ACHR, \n2000). \n 30 \nsuch as domestic abuse only rarely emerge, and generally do so only among closer-\nknit local women‟s groups).  While translocal solidarities are part of SDI‟s \nimaginaries, they must be seen in conjunction with SDI‟s travelling strategies \noutlined above – enumeration, exhibition, savings, land-sharing, etc. – which are \nthe loci of learning practice.  It is through a combination of practices of social \nlearning around particular strategies with a sense of translocal solidarity extending \nacross urban peripheries, that SDI‟s particular critical cosmopolitanism is \nconstituted.   \n \nWhile most discussions of cosmopolitanism in Bombay focus on communal \ntension, the Indian Alliance and its work in the SDI learning network is a distinct \nexample of critical cosmopolitanism reproduced through participation in group \npractices.  SDI‟s cosmopolitanism offers a counterpoint to those of Western elites \nthat have captured the attention of much of the resurgence of debates around \ncosmopolitanism, and emerges from groups whose experience of imperialism, \ncontemporary development and globalisation differs markedly from some of the \nobjects of analysis often explored in cosmopolitan debates.  The social nature of \ncosmopolitanism in SDI contrasts with a tendency in literature on cosmopolitanism \nto focus on the agency of the individual subject, their imaginative and physical \nmobilities, and their appreciation of cultural diversity (Calhoun, 2003; Rattansi, \n2004).  In doing so, it marks a contrast to the global cosmopolitan modernity rooted \nin high-end consumption that is reflected in recent transformations in Bombay and \nportrayed in new family film.  This is a cosmopolitanism that does not hover above \nthe city in luxurious apartments and offices, nor does not seek to imitate the city of \nspectacle.  It is produced through a translocal engagement in the everyday spaces of \nthe city of debris, and resonates with struggles of the past in linking \ncosmopolitanism and modernity in an effort for basic urban services. \n \nConclusion \n \nThe relationship between Bombay and cosmopolitanism has been multiple and \nchanging throughout the post-Independence period, but it has always been crucial \nto debates and imaginaries of urban social justice.  Cosmopolitanism has been \n 31 \nclosely linked to notions of Bombay as a modern city, and at stake in these \nconnections are some of the limits of what a socially just Bombay might look like \nand require.  The postcolonial model of national development has been destabilised \nsince 1947.  This has been a due to a confluence of state developmental and \nplanning failures to meet the growing demand of housing, infrastructure and \nservices, and the stoking of communal tensions culminating in horrific periods of \nviolence, especially during the emergency in the late 1970s and the riots and \nbombings of the early 1990s.  These histories have been captured and reflected in \npopular Bombay cinema, recalling Nandy‟s (1998: 7) assertion that Bombay film is \n“Indian modernity at its rawest, its crudities laid bare”.   \n \nHowever, cosmopolitan imaginaries and practices have far from disappeared in the \ncity, and those that exist inventively recast the relationship between cosmopolitan \nand modern.  The claim that the city has experienced a general social \ntransformation to a „decosmopolitanised‟ city through the 1990s assumes that the \ncity before this was cosmopolitan and attributes too much causal efficacy to the \nriots.  This conventional narrative about Bombay‟s cosmopolitanism needs to be \ntempered by the multiple forms of cosmopolitan imaginations and practices that \nexist in the city.  SDI is one such example, existing in contrast to the elitist \nconsumption-oriented cosmopolitanism that Mazumdar (2007) traces in the lifestyle \nchanges of different groups in the city and in the transformation of select urban \ninteriors and exteriors, often captured vividly in film.  These contrasting narratives \nand images outline an inclusive cosmopolitan modernism that is locally oriented \nbut outward looking, against an exclusionary cosmopolitan modernism that is \nglobally oriented and seeks to escape the local geographies of the city.  While there \nare important distinctions, these cosmopolitanisms resonate with the Bombay that \nexisted before the 1990s.    SDI‟s cosmopolitan imaginary and modernist aims echo \nKapoor‟s vision portrayed in Shri 420 that looked optimistically for a Bombay that \nwelcomed migrants and guaranteed collective provision and urban social justice.  \nBy contrast, however, SDI is suspect of the state, distancing itself from party-\npolitical alliances and seeking to negotiate with whoever is in power (McFarlane, \n2004).    \n \n 32 \nHowever, I do not wish to replace a binary of cosmopolitan\/decosmopolitan with \nanother of exclusive\/inclusive cosmopolitanism.  All forms of cosmopolitan are to \nvarying extents inclusive or exclusive, implying that one important role for the \ncritic is to illuminate the politics, limits and exclusions of different forms of \ncosmopolitan imaginary and practice.  The paper underlines the need to pluralise \nand reconsider cosmopolitanism beyond the spaces and lifestyles of the global \nNorth.  In addition, the discussion of SDI marks a counterpoint to the tendency in \ndiscourses of liberal cosmopolitanism that emphasise the agency of the individual, \ninstead highlighting particular forms of cosmopolitanism imagination and practice \nare learned socially.   \n \nMethodologically, the paper has sought to demonstrate that relating often \nanalytically separate realms such as film and civil society can provide a wider \npolitico-cultural lens through which to examine urban change.  Bombay cinema \noften reflects and sometimes interrogates changes that are taking place to the city \nitself, and registers distinct and significant impacts on urban discourse and \nimagination.  Taken together, the juxtaposition of film and civil society offer \nbroader sightlines for investigating changing forms of cosmopolitanism in \npostcolonial Bombay that do necessarily take communalism, violence or Hindutva \nas their key points of reference. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 33 \nReferences \n \nAppadurai A. 2000, „Spectral Housing and Urban Cleansing: Notes on Millennial \nMumbai‟.  Public Culture 12: 3, 627-651 \n \nAppadurai A. 2002, „Deep democracy: urban governmentality and the horizon of \npolitics‟.  Public Culture 14:1, 21-47. \n \nAsian Coalition for Housing Rights (ACHR) 2000 Face-to-Face: Notes from the \nNetwork on Community Exchange.  (Asian Coalition for Housing Rights: \nBangkok).   \n \nBakshi R 1998 „Raj Kapoor: From Jis Desdh Mein Ganag Behti Hai to Ram Teri \nGanga Maili‟. In Nandy A (ed) The Secret Politics of Our Desires: Innocence \n,Culpability and Indian Popular Cinema (Pauls Press: New Delhi), pp. 92-133. \n \nBanerjee-Guha, S. (2001) „Shifting Cities: Urban Restructuring in Mumbai‟.  \nEconomic and Political Weekly.  January 12\nth\n 121-128. \n \nBatliwala S 2002 „Grassroots Movements as Transnational Actors: Implications for \nGlobal Civil Society‟ Voluntas: International Journal of Voluntary and Nonprofit \nOrganizations 13:4, 393-409 \n \nBombay First, 2003, Vision Mumbai: transforming Mumbai into a world-class city.  \n(Bombay First-McKinsey & Company, Inc: Mumbai). \n \nBose S and Jalal A 1997 „Nationalism, Democracy and Development‟.  Bose S and \nJalal A Nationalism, Democracy and Development: State and Politics in India.  \n(Delhi: Oxford University Press), 1-9. \n \nChatterjee G 2003 (1992) Awara (Penguin Books: London). \n \n 34 \nChatterjee P 2004 The Politics of the Governed: Reflections on Popular Politics in \nMost of the World.  (Permanent Black: Delhi). \n \nCorbridge S and Harriss J 2000 Reinventing India: Liberalization, Hindu \nNationalism and Popular Democracy.  (Oxford University Press: Oxford). \n \nDikec M 2002 „Pera peras poros: longing for spaces of hospitality‟.  Theory, \nCulture and Society.  19:1-2, 222-247. \n \nD'Monte, D 2002 Ripping the Fabric: The Decline of Mumbai and its Mills.  \n(Oxford University Press: New Delhi). \n \nEdwards M 1999  Future Positive: International Cooperation in the 21\nst\n Century.  \n(Earthscan: London). \n \nGarimella A (ed) 2005 Mulk Raj Anand: Shaping the Indian Modern.  (Marg \nPublications: Mumbai). \n \nGidwani V 2006 Subaltern Cosmopolitanism as Politics.  Antipode, 38, 1: 7-21. \n \nGidwani V. and Sivaramakrishnan K. 2003 „Circular migration and rural \ncosmopolitanism in India‟, Contributions to Indian Sociology, 37, 1&2, 339-370. \n \nGrant R. and Nijman J. 2002 „Globalization and the Corporate Geography of Cities \nin the Less-Developed World‟.  Annals of the Association of American \nGeographers, 92: 2, 320-340. \n \nGrant R., and Nijman J. 2004 „The Re-scaling of Uneven Development in Ghana \nand India‟.  Tijdschrift voor Economische en Sociale Geografie, 95: 5, 467-481. \n \n 35 \nHall S. 2002 „Political belonging in a world of multiple identities‟, in Vertovec \nS.and Cohen R. (eds) Conceiving Cosmopolitanism: Theory, context, and practice.  \n(Oxford University Press: Oxford). \n \nHansen T.B. 2001, Wages of Violence: Naming and Identity in Postcolonial \nBombay.  (Princeton University Press: Princeton) \n \nHuchzermeyer M 1999 Current Informal Settlement Intervention in South Africa: \nFour Case Studies of People-Driven Initiatives.  Unpublished paper, Department of \nSociology, University of Cape Town. \n \nIyer P. 2003 „Bombay: Hobson-Jobson on the Streets‟.  In Pinto R and Fernandes N \n(eds) Bombay, meri jaan.  (Penguin: New Delhi), 2-15. \n \nJeffrey C 2008 „Kicking Away The Ladder: Kicking Away the Ladder: Middle \nClass Mobilities in Provincial North India‟. Environment and Planning D: Society \nand Space 26(4) XXXX-XXXX \n \nJeffrey C, R Jeffrey and P Jeffery 2005 „When Schooling Fails: Young Men, \nEducation and Low Caste Politics in North India‟. Contributions to Indian \nSociology 39, 1-38.  \n \nKaarsholm P (ed) 2007 City Flicks: Indian Cinema and the Urban Experience. \n(Seagull Books: London). \n \nKaviraj S 2007 „Reading a Song of the City: Images of the city in Literature and \nFilms‟.  In Kaarsholm P (ed) 2007 City Flicks: Indian Cinema and the Urban \nExperience. (Seagull Books: London), pp. 60-81. \n \n 36 \nLegg S 2006 „Post-colonial Developmentalities: from the Delhi Improvement Trust \nto the Delhi Development Authority‟.  In Raju S, Kumar M.S, and Corbridge S \n2006 Colonial and Post-Colonial Geographies of India.  (Sage: London), 182-204. \n \nLey D 2004 „Transnational spaces and everyday lives‟.  Transactions of the \nInstitute of British Geographers 29: 151-164. \n \nMazumdar R 2007 Bombay Cinema: An Archive of the City (University of \nMinnesota Press: Minneapolis). \n \nMcFarlane C 2004 „Geographical imaginations and spaces of political engagement: \nexamples from the Indian Alliance‟.  Antipode 36: 5, 890-916 \n \nMcFarlane C 2006a „Transnational development networks: bringing development \nand postcolonial approaches into dialogue‟.  The Geographical Journal, 172: 1, 35-\n49. \n \nMcFarlane C 2006b „Knowledge, learning and development: a post-rationalist \napproach‟.  Progress in Development Studies, 6: 4, 287-305. \n \nMcFarlane C 2007 „Sanitation in Mumbai‟s informal settlements: state, „slum‟ and \ninfrastructure‟.  Environment and Planning A (forthcoming) \n \nMignola W D 2000 „The Many Faces of Cosmo-Polis: Border Thinking and \nCritical Cosmopolitanism‟.  Public Culture, 12, 3: 721-748. \n \nMukhija V. 2004, Squatters as Developers? Slum Redevelopment in Mumbai. \n(Alderhot, UK: Ashgate). \n \nMW-YUVA, 2001, Slum Sanitation Project: Final Report.  (Municipal Corporation \nof Brihan Mumbai: Mumbai). \n 37 \n \nNandy, A 1998 „Indian Popular Cinema as a Slum‟s eye View of Politics‟. In \nNandy A (ed) The Secret Politics of Our Desires: Innocence ,Culpability and \nIndian Popular Cinema (Pauls Press: New Delhi), pp. 1-18 \n \nNational Alliance 2005 „Bombay Slum Demolition Drive, 2004-2005‟.  \nhttp:\/\/dupb.blogspot.com\/2005\/02\/fact-tentative-sheet-related-to-large.html.  \nWebsite visited on August 5\nth\n, 2005. \n \nPatel S. 2001 Shack\/Slum Dwellers International: Exploring global spaces for local \naction in New York.  (SPARC: Mumbai).  September 2001. \n \nPatel S. and Mitlin D. 2001, The work of SPARC, the National Slum Dwellers \nFederation and Mahila Milan.  (International Institute for Environment and \nDevelopment (IIED): Poverty Reduction in Urban Areas Series, Working Paper 5.  \nIIED: London). \n \nPatel S. and Mitlin D. 2002 „Sharing experiences and changing lives‟.  Community \nDevelopment Journal.  37:2, 125-136. \n \nPatel S., Bolnick J,. and Mitlin D. 2000 „Squatting on the Global Highway: \nCommunity Exchanges for Urban Transformation‟.  In (eds) Edwards, M. and J. \nGaventa Global Citizen Action.  (Earthscan: London), 396-409. \n \nPollock S, Bhabha H.K, Breckenridge C.A, Chakrabarty D 2000 \n„Cosmopolitanisms‟.  Public Culture 12: 3, 577-589. \n \nPrakash G 2002 Rough Transcript of ‘The Urban Turn’: Panel Discussion at the \nBombay Paperie.  (PUKAR, Mumbai). \n 38 \n \nPrakash G 2005 „Edward Said in Bombay‟.  Critical Inquiry 31, 498-504. \n \nPrakash G 2006 „The Idea of Bombay‟, The American Scholar, 75:2, 88-99. \n \nPunwani J 2003 „„My Area, Your Area‟: How the Riots Changed the City‟.  In  \nPatel S and Masselos J (eds) Bombay and Mumbai: The City in Transition (Oxford \nUniversity Press: New Delhi). \n \nPunwani J 2006 „Mumbai Bomb Blasts 1 – Denial of Constitutional Rights‟.  \nEconomic and Political Weekly, 41: 36, pp. 3841-3843. \n \nRattansi A 2004 „Dialogues on Difference: Cosmopolitans, Locals and „Others‟ in a \nPost-National Age‟.  Sociology, 38: 3, pp. 613-621. \n \nRao V 2006 „Slum as theory‟. International Journal of Urban and Regional \nResearch, 30: 1, 225-232. \n \nRohatgi P, Godrej P, Mehrota R, (eds) Bombay to Mumbai: Changing Perspectives \n(Marg Publications: Mumbai). \n \nSandercock L. 2003 Cosmopolis II: Mongrel Cities.  (Continuum) \n \nSassen S. 2003 „Globalization or denationalisation?‟  Review of International \nPolitical Economy 10:1, 1-22 \n \nSDI 2003 Slum \/ Shack Dwellers International.  http:\/\/www.sdinet.org, Website \nvisited August, 2003. \n \n 39 \nShaikh J 2005 „Worker politics, trade unions and the Shiv Sena‟s rise in central \nBombay‟.  Economic and Political Weekly, pp. 1893-1900. \n \nShaw A 1999 „The Planning and Development of New Bombay‟.  Modern Asian \nStudies 33: 951-988. \n \nSzerszynski B and Urry J 2002 „Cultures of Cosmopolitanism‟.  Sociological \nReview 50: 461-481. \n \nTheroux P 2003 (1975) „The Rajdhani Express to Bombay‟.  In Pinto R and \nFernandes N (eds) Bombay, meri jaan.  (Penguin: New Delhi), 189-191. \n \nVasudevan R 2000 „Shifting Codes, Dissolving Identities: the Hindu Social Film of \nthe 1950s as Popular Culture. In Vasudevan R (ed) Making Meaning in Indian \nCinema.  (Oxford University Press: Oxford), pp. 99-121. \n \nVarma R. 2004 „Provincialising the Global City: From Bombay to Mumbai‟.  \nSocial Text 22: 4, 65-89 \n \nVertovec, S. and Cohen, R. (2000) Conceiving Cosmopolitanism: Theory, Context \nand Practice.  (Oxford University Press: Oxford). \n \nVirani P 2001 Once was Bombay.  (Penguin: New Delhi). \n \nZaidi, H.S. (2003) Black Friday: The True Story of the Bombay Bomb Blasts.  \n(Penguin: New Delhi). \n \n"}