{"doi":"10.1080\/00107510802267716","coreId":"68337","oai":"oai:eprints.lancs.ac.uk:32810","identifiers":["oai:eprints.lancs.ac.uk:32810","10.1080\/00107510802267716"],"title":"Ions and electrons in liquid helium","authors":["McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-07","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68337.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/32810\/1\/ionsPrePrint.pdf","pdfHashValue":"f70da511e3cf5a63edc093ea154e689e21202ee2","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:32810<\/identifier><datestamp>\n      2018-01-24T03:00:12Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Ions and electrons in liquid helium<\/dc:title><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:date>\n        2008-07<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/32810\/1\/ionsPrePrint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1080\/00107510802267716<\/dc:relation><dc:identifier>\n        McClintock, Peter V. E. (2008) Ions and electrons in liquid helium. Contemporary Physics, 49 (4). pp. 302-303. ISSN 0010-7514<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/32810\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1080\/00107510802267716","http:\/\/eprints.lancs.ac.uk\/32810\/"],"year":2008,"topics":["QC Physics"],"subject":["Journal Article","NonPeerReviewed"],"fullText":"Ions and Electrons in Liquid Helium by A. F. Borghesani, Oxford University Press,\nOxford, 2007, pp. xv + 542. Scope: monograph. Level: undergraduate and postgraduate.\nUnlike all other matter, helium never solidifies under atmospheric pressure, regardless of\nhow cold one makes it. When cooled below 4.2K, however, the common isotope 4He con-\ndenses to form a colourless liquid that has been a source of seemingly endless fascination\nto physicists since Kamerlingh Onnes first liquefied helum in Leiden in 1908, almost ex-\nactly a century ago. Since then, the rare isotope 3He has also been separated and liquefied\nand found to be equally facinating albeit, in some respects, markedly different from 4He.\nBoth liquids are dominated by quantum mechanics, and both are gas-like in that their\natoms are widely separated: the density of 4He is only a third of what it would be for hard\nspheres in contact (and for 3He the factor is a quarter). The reason lies in a combination\nof the very weak interatomic forces and the large quantum mechanical zero-point energy,\nso that the liquid expands to reduce its free energy. Hence London’s description of liquid\nhelium as a “quantum liquid blown up by its own zero-point energy”. Its gas-like prop-\nerties, and the fact that it remains liquid right down to the absolute zero of temperature,\nled London to suggest that the behaviour of liquid helium might be approximated by that\nof an ideal gas, so that 4He and 3He would be governed by Bose-Einstein and Fermi-Dirac\nstatistics respectively. He was right – though it is the departures from ideal behaviour\nthat are in many ways the most interesting feature of the heliums, as in both cases these\ngive rise to superfluidity and other macroscopic manifestations of quantum mechanics.\nHow can one study these exotic, but inaccessible, fluids? Their thermodynamic prop-\nerties can be measured directly, though it is far from trivial given the low temperatures\ninvolved. But what about their collective modes, their quantal properties and, in particu-\nlar their superfluidity? Given that liquid 4He is transparent, colourless, and magnetically\ninert the answers are far from obvious. Inelastic neutron scattering has been extremely\nuseful e.g. in quantifying the disperion (energy-momentum) relationship of the excita-\ntions – and demonstrating the correctness of Landau’s inspired guess that the two kinds\nof excitations, phonons and rotons, would populate different parts of the same dispersion\ncurve. But it is the use of ions as probes that has really opened up the subject to close\nexperimental analysis and examination.\nBorghesani has brought together in a single volume the results of several hundred\n1\nPublished in Contemp. Phys. 49, 302-303 (2008).\nstudies of liquid helium, all based on ions. The vast majority of this work has been based\non just two types of probe. First, the negative ion is what is created within a few ps after an\nelectron is injected into the liquid. Because of its small mass, and correspondingly its large\nzero-point motion, the electron carves out a spherical cavity for itself, of radius∼ 10−20A˚,\ndepending on pressure. It possesses a corresponding hydrodynamic effective mass of\n∼ 70− 240 4He atomic masses. Secondly, the positive ion is smaller, but also augmented\nim both mass and hydrodynamic mass when the He+ at its core electrostritively solidifies\nthe 4He around it. Both ions are thus semi-macroscopic objects that can be used to study\nwhat goes on within the liquid. They are easily injected e.g. by using the particle tracks\naround a radioactive source, or by field emission\/ionization at a sharp metal point. They\ncan be moved around in the liquid by application of electric fields, and their arrival at an\nelectrode is revealed by the current that they induce.\nThe book is in three parts, covering results for liquid 4He, liquid 3He, and dense\nhelium gas. Of these, the first is by far the largest, consisting of 17 chapters. It opens\nwith a succinct introduction to superfluidity, covering the 2-fluid and Landau models and\nexplaining how they are effectively equivalent: below its superfluid transition temperature\nof Tλ = 2.17K the liquid behaves in many respects like a mixture of normal fluid (a fairly\nconventional liquid) and superfluid (with zero viscosity, carrying zero entropy); the first\nof these corresponds to a gas of elementary excitations i.e. phonons and rotons, and the\nsecond is the vacuum-like background within which the excitations move. At T = 0K the\nliquid is 100% superfluid, and at T = Tλ it is 100% normal fluid.\nBorghesani describes how ions have been used to probe the excitations via measure-\nments of mobility, to study the patterns of quantized vortex lines created if one tries to\nrotate the liquid (overall rotation of the superfluid being forbidden), to determine the\ntrapping potential of an ion on a vortex through measurements of capture and escape\nrates, to investigate excitations of the vortex core through studies of ion motion along\nvortex lines, to measure the Landau critical velocity at which superfluidity breaks down\nthrough roton creation (and the background loses its vacuum-like properties), to show\nthat the process of vortex creation involves a form of macroscopic quntum tunnelling,\nand to study many many other features of the liquid’s exotic properties.\nPart II, on ions in liquid 3He, comprises a further seven chapters. At temperatures\nwell below 1K liquid 3He behaves in a totally different way to liquid 4He because of being\n2\ndescribed by Fermi-Dirac statistics. This is clearly revealed by the ions. The author\ncovers their behaviour in the normal phase – which in reality is anything but normal, but\nexhibits characteristic Fermi liquid properties – as well as in the superfluid phases below\n2mK. For liquid 3He, however, there has been far less research involving ion motion than\nin the case of the common isotope, probably because 3He can be probed in ways that\nare unavailable for 4He. In particular, the unpaired neutron in its nucleus endows 3He\nwith magnetic properties allowing the use of nuclear magnetic resonance to investigate\nthe liquid. Nonetheless, many of the earlier experiments in 4He, e.g. on ionic mobilities\nand transport, critical velocities, and interactions with quantized vortices, have their\nanalogues in 3He. This interesting body of work is carefully described.\nFinally, the three chapters of Part III describe electrons in dense helium gas. As al-\nready remarked, liquid helium is itself gas-like in terms of its density and many other\nproperties, so it was natural to ask what would happen in the dense vapour. Not surpris-\ningly, perhaps, charged bubble states are formed much as in the liquid.\nThis is a big book, and the only obvious omission is the relatively small amount of\nwork on ion motion in solid helium – but it falls outside the chosen title and it is entirely\nunderstandable why the author would have wished to call a halt. He has done an excellent\njob by encompassing practically everything that has ever been published on ions in liquid\nhelium, from the early debates about the famous (but seemingly mythical) “Careri steps”\nin the mobility up to the very recent controversy about Maris’s “fractional electrons”.\nSomehow, he has digested this huge body of work and turned it into a coherent whole,\nand he deserves congratulation and thanks from the entire community of low temperature\nphysicists for doing so.\nPeter V. E. McClintock\nLancaster University.\n3\n"}