{"doi":"10.1007\/s10453-009-9130-x","coreId":"195691","oai":"oai:lra.le.ac.uk:2381\/7801","identifiers":["oai:lra.le.ac.uk:2381\/7801","10.1007\/s10453-009-9130-x"],"title":"Reproducibility between counts of airborne allergenic pollen from two cities in the East Midlands, UK","authors":["Pashley, Catherine H.","Fairs, Abbie","Edwards, Richard E.","Bailey, John P.","Corden, Julie M.","Wardlaw, Andrew J."],"enrichments":{"references":[{"id":44711978,"title":"Aerobiological studies based in Derby I. A simplified automatie volumetric spore trap.","authors":[],"date":"1978","doi":"10.1111\/j.1365-2222.1978.tb01513.x","raw":"Morrow Brown, H. and Jackson, F. A. (1978a). Aerobiological studies based in Derby I. A simplified automatie volumetric spore trap. Clinical Allergy 8:589-597.","cites":null},{"id":44711979,"title":"Aerobiological studies based in Derby III. A comparison of simultaneous pollen and spore counts from the east coast, Midlands and west coast of England and Wales. Clinical Allergy 8:611-619.","authors":[],"date":"1978","doi":"10.1111\/j.1365-2222.1978.tb01515.x","raw":"Morrow Brown, H. and Jackson, F. A. (1978b). Aerobiological studies based in Derby III. A comparison of simultaneous pollen and spore counts from the east coast, Midlands and west coast of England and Wales. Clinical Allergy 8:611-619.","cites":null},{"id":44711982,"title":"Atmospheric pollen season in Zagreb (Croatia) and its relationship with temperature and precipitation.","authors":[],"date":"2004","doi":"10.1007\/s00484-004-0202-x","raw":"Peternel, R., Srnec, L., Culig, J., Zaninovic, K., Mitic, B. and Vukusic, I. (2004). Atmospheric pollen season in Zagreb (Croatia) and its relationship with temperature and precipitation. Int. J. Biometeorol. 48:186-191.","cites":null},{"id":44711976,"title":"Betula pollen: One of the most important aeroallergens in Ourense, Spain. Aerobiological studies from","authors":[],"date":"2005","doi":"10.1007\/s10453-005-4181-0","raw":"Mendez, J., Comtois, P. and Iglesias, I. (2005). Betula pollen: One of the most important aeroallergens in Ourense, Spain. Aerobiological studies from 1993 to 2000. Aerobiologia 21:115-123.","cites":null},{"id":44711983,"title":"Comparison of Alnus, Corylus and Betula pollen counts in Lublin (Poland) and Skien (Norway).","authors":[],"date":"2004","doi":"10.5586\/aa.2010.005","raw":"Piotrowska, K. (2004). Comparison of Alnus, Corylus and Betula pollen counts in Lublin (Poland) and Skien (Norway). Annals of Agricultural and Environmental Medicine 11:205-208.","cites":null},{"id":44711986,"title":"Constructing a 7-day ahead forecast model for grass pollen at north London, United Kingdom. Clinical and Experimental Allergy","authors":[],"date":"2005","doi":"10.1111\/j.1365-2222.2005.02349.x","raw":"Smith, M. and Emberlin, J. (2005). Constructing a 7-day ahead forecast model for grass pollen at north London, United Kingdom. Clinical and Experimental Allergy 35:1400-1406.","cites":null},{"id":44711977,"title":"Efficacy and safety of subcutaneous immunotherapy with a biologically standardized extract of Ambrosia artemisiifolia pollen: a double-blind, placebo-controlled study.","authors":[],"date":"2004","doi":"10.1111\/j.1365-2222.2004.02056.x","raw":"Mirone, C., Albert, F., Tosi, A., Mocchetti, F., Mosca, S., Giorgino, M., Pecora, S., Parmiani, S. and Ortolani, C. (2004). Efficacy and safety of subcutaneous immunotherapy with a biologically standardized extract of Ambrosia artemisiifolia pollen: a double-blind, placebo-controlled study.","cites":null},{"id":44711984,"title":"Environmental factors affecting the start of pollen season and concentrations of airborne Alnus pollen in two localities of Galicia (NW Spain).","authors":[],"date":"2004","doi":null,"raw":"Rodriguez-Rajo, F. J., Dopazo, A. and Jato, V. (2004). Environmental factors affecting the start of pollen season and concentrations of airborne Alnus pollen in two localities of Galicia (NW Spain). Annals of Agricultural and Environmental Medicine 11:35-44.","cites":null},{"id":44711981,"title":"Frost periods and beginning of the ash (Fraxinus excelsior L.) pollen season in Basel (Switzerland).","authors":[],"date":"2000","doi":"10.1007\/bf02694306","raw":"Peeters, A. G. (2000). Frost periods and beginning of the ash (Fraxinus excelsior L.) pollen season in Basel (Switzerland). Aerobiologia 16:353-359.","cites":null},{"id":44711980,"title":"Impact of sublingual immunotherapy on seasonal asthma and skin reactivity in children allergic to Parietaria pollen treated with inhaled fluticasone propionate. Clinical and Experimental Allergy","authors":[],"date":"2003","doi":"10.1111\/j.1365-2222.2003.01809.x","raw":"Pajno, G. B., Vita, D., Parmiani, S., Caminiti, L., La Grutta, S. and Barberio, G. (2003). Impact of sublingual immunotherapy on seasonal asthma and skin reactivity in children allergic to Parietaria pollen treated with inhaled fluticasone propionate. Clinical and Experimental Allergy 33:1641-1647.","cites":null},{"id":44712013,"title":"Links between Pollen, Atopy and the Asthma Epidemic.","authors":[],"date":"2007","doi":"10.1159\/000103230","raw":"Taylor, P.E., Jacobson, K.W., House, J.M. and Glovsky, M.M. (2007). Links between Pollen, Atopy and the Asthma Epidemic. International Archives of Allergy and Immunology 144:162-170 Vega-Maray, A. M., Valencia-Barrera, R. M., Fernández-González, D. and Fraile, R. (2003). Urticaceae pollen concentration in the atmosphere of North Western Spain. Annals of Agricultural and Environmental Medicine 10:249-255.","cites":null},{"id":44711988,"title":"Quantitative trends in annual totals of five common airborne pollen types (Betula, Quercus, Poaceae, Urtica, and Artemisia), at five pollen-monitoring stations in western Europe.","authors":[],"date":"2003","doi":"10.1023\/b:aero.0000006528.37447.15","raw":"Spieksma, F. T. M., Corden, J. M., Detandt, M., Millington, W. M., Nikkels, H., Nolard, N., Schoenmakers, C. H. H., Wachter, R., de Weger, L. A., Willems, R. and Emberlin, J. (2003). Quantitative trends in annual totals of five common airborne pollen types (Betula, Quercus, Poaceae, Urtica, and Artemisia), at five pollen-monitoring stations in western Europe. Aerobiologia 19:171-184.","cites":null},{"id":44711975,"title":"The Air Spora; a manual for catching and identifying airborne biological particles.","authors":[],"date":"2006","doi":"10.1111\/j.1365-3059.2007.01610.x","raw":"Lacey, M. E. and West, J. S. (2006). The Air Spora; a manual for catching and identifying airborne biological particles. Springer, Dordrecht.","cites":null},{"id":44711985,"title":"The role of oak pollen in hay fever consultations in general practice and the factors influencing patients' decisions to consult.","authors":[],"date":"1996","doi":null,"raw":"Ross, A. M., Corden, J. M. and Fleming, D. M. (1996). The role of oak pollen in hay fever consultations in general practice and the factors influencing patients' decisions to consult. British Journal of General Practice 46:451-455.","cites":null},{"id":44712014,"title":"Understanding interobserver agreement: the kappa statistic. Family Medicine 37:360-363. generated in the Bland-Altman analysis for each of the pollen data sets. Included is length of season (n) in days.","authors":[],"date":"2005","doi":null,"raw":"Viera, A. J. and Garrett, J. M. (2005). Understanding interobserver agreement: the kappa statistic. Family Medicine 37:360-363. generated in the Bland-Altman analysis for each of the pollen data sets. Included is length of season (n) in days.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-12","abstract":"This is the author's final draft of the paper published as Aerobiologia, 2009, 25 (4), pp. 249-263.  The original publication is available at www.springerlink.com.  Doi: 10.1007\/s10453-009-9130-xHistorically in the East Midlands, UK, airborne pollen has been monitored in two cities, Derby and Leicester, situated 41 km (25 miles) apart. The aim of the present study was to compare aerobiological data from both sites to determine if a forecast based on data from one site would be sufficient for both, and to address the wider issue of reproducibility between geographically separated sites. Pollen types recorded could be split into two groups according to annual abundance, maximum daily concentration and the number of high count days. Six taxa made up the abundant group; ash, birch, grass, oak, nettle-type and yew-type, representing 90 and 88% of the total air spora for Derby and Leicester, respectively. Three consecutive years of grass and nettle pollen data are presented, supported by one year of abundant tree pollen data. There were highly significant positive correlations between the counts obtained. Line charts showing the average number of pollen grains m−3 air day−1 show similar trends, and Bland–Altman plots show little discrepancy between the amounts of pollen counted on any given day. Each day was classified according to the UK accepted threshold levels for grass. Weighted kappa statistics showed substantial or almost perfect agreement between the forecast classifications. With the caveat that this would not apply in a region with restrictions to air flow such as a mountain range or with extreme fluctuations such as a coastline site, this study suggests that data from a single site is suitable for forecasting a distance of up to 41 km","downloadUrl":"http:\/\/hdl.handle.net\/2381\/7801","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7801\/3\/Pashley%20et%20al%20revised%202.pdf","pdfHashValue":"b4b8fecf0e1b182b884532e69f3aabb41247bc27","publisher":"Springer Verlag","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7801<\/identifier><datestamp>\n                2015-12-08T14:32:03Z<\/datestamp><setSpec>\n                com_2381_6<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_9<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nReproducibility between counts of airborne allergenic pollen from two cities in the East Midlands, UK<\/dc:title><dc:creator>\nPashley, Catherine H.<\/dc:creator><dc:creator>\nFairs, Abbie<\/dc:creator><dc:creator>\nEdwards, Richard E.<\/dc:creator><dc:creator>\nBailey, John P.<\/dc:creator><dc:creator>\nCorden, Julie M.<\/dc:creator><dc:creator>\nWardlaw, Andrew J.<\/dc:creator><dc:description>\nThis is the author's final draft of the paper published as Aerobiologia, 2009, 25 (4), pp. 249-263.  The original publication is available at www.springerlink.com.  Doi: 10.1007\/s10453-009-9130-x<\/dc:description><dc:description>\nHistorically in the East Midlands, UK, airborne pollen has been monitored in two cities, Derby and Leicester, situated 41 km (25 miles) apart. The aim of the present study was to compare aerobiological data from both sites to determine if a forecast based on data from one site would be sufficient for both, and to address the wider issue of reproducibility between geographically separated sites. Pollen types recorded could be split into two groups according to annual abundance, maximum daily concentration and the number of high count days. Six taxa made up the abundant group; ash, birch, grass, oak, nettle-type and yew-type, representing 90 and 88% of the total air spora for Derby and Leicester, respectively. Three consecutive years of grass and nettle pollen data are presented, supported by one year of abundant tree pollen data. There were highly significant positive correlations between the counts obtained. Line charts showing the average number of pollen grains m−3 air day−1 show similar trends, and Bland–Altman plots show little discrepancy between the amounts of pollen counted on any given day. Each day was classified according to the UK accepted threshold levels for grass. Weighted kappa statistics showed substantial or almost perfect agreement between the forecast classifications. With the caveat that this would not apply in a region with restrictions to air flow such as a mountain range or with extreme fluctuations such as a coastline site, this study suggests that data from a single site is suitable for forecasting a distance of up to 41 km.<\/dc:description><dc:date>\n2010-04-19T15:00:03Z<\/dc:date><dc:date>\n2010-04-19T15:00:03Z<\/dc:date><dc:date>\n2009-12<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAerobiologia, 2009, 25 (4), pp. 249-263.<\/dc:identifier><dc:identifier>\n0393-5965<\/dc:identifier><dc:identifier>\nhttp:\/\/link.springer.com\/article\/10.1007%2Fs10453-009-9130-x<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7801<\/dc:identifier><dc:identifier>\n10.1007\/s10453-009-9130-x<\/dc:identifier><dc:language>\nen<\/dc:language><dc:publisher>\nSpringer Verlag<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0393-5965","0393-5965"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article"],"fullText":"Reproducibility between counts of airborne allergenic pollen from two cities in the East \nMidlands, UK. \n \nCatherine H. Pashley\n1\n, Abbie Fairs\n1\n, Richard E. Edwards\n1\n, John P. Bailey\n2\n, Julie M. Corden\n3\n \nand Andrew J. Wardlaw\n1 \n \n1\nAerobiology Unit, Institute for Lung Health, Department of Infection, Immunity & \nInflammation, University of Leicester, Leicester LE1 7RH \n2\nDepartment of Biology, University of Leicester, Leicester LE1 7RH \n3\nMAARA, No 1 Mill, The Wharf, Shardlow, Derby, DE72 2GH \n \n \nCorresponding author: Catherine H Pashley; chp5@le.ac.uk tel (+44)116 252 5078 \n \nAbstract  \nHistorically in the East Midlands, UK, airborne pollen has been monitored in two cities, \nDerby and Leicester, situated 41 kilometres (25 miles) apart. The aim of the present study \nwas to compare aerobiological data from both sites to determine if a forecast based on data \nfrom one site would be sufficient for both, and to address the wider issue of reproducibility \nbetween geographically separated sites. \n \nPollen types recorded could be split into two groups according to annual abundance, \nmaximum daily concentration and the number of high count days. Six taxa made up the \nabundant group; ash, birch, grass, oak, nettle-type and yew-type, representing 90 and 88% of \nthe total air spora for Derby and Leicester respectively.  \n \nThree consecutive years of grass and nettle pollen data are presented, supported by one year \nof abundant tree pollen data. There were highly significant positive correlations between the \ncounts obtained. Line charts showing the average number of pollen grains m\n-3\n air day\n-1\n show \nsimilar trends, and Bland-Altman plots show little discrepancy between the amounts of pollen \ncounted on any given day. Each day was classified according to the UK accepted threshold \nlevels for grass. Weighted kappa statistics showed substantial or almost perfect agreement \nbetween the forecast classifications. With the caveat that this would not apply in a region \nwith restrictions to air flow such as a mountain range, or with extreme fluctuations such as a \ncoastline site, this study suggests that data from a single site is suitable for forecasting a \ndistance of up to 41 km.  \n \nKeywords Pollen forecast, hayfever, aerobiology, allergy \n \n1 \n \nReproducibility between counts of airborne allergenic pollen from two cities in the East Midlands, \nUK.  \nAbstract \nHistorically in the East Midlands, UK, airborne pollen has been monitored in two cities, Derby and \nLeicester, situated 41 kilometres (25 miles) apart. The aim of the present study was to compare \naerobiological data from both sites to determine if a forecast based on data from one site would be sufficient \nfor both, and to address the wider issue of reproducibility between geographically separated sites. \nPollen types recorded could be split into two groups according to annual abundance, maximum daily \nconcentration and the number of high count days. Six taxa made up the abundant group; ash, birch, grass, \noak, nettle-type and yew-type, representing 90 and 88% of the total air spora for Derby and Leicester \nrespectively.  \nThree consecutive years of grass and nettle pollen data are presented, supported by one year of abundant tree \npollen data. There were highly significant positive correlations between the counts obtained. Line charts \nshowing the average number of pollen grains m\n-3\n air day\n-1\n show similar trends, and Bland-Altman plots \nshow little discrepancy between the amounts of pollen counted on any given day. Each day was classified \naccording to the UK accepted threshold levels for grass. Weighted kappa statistics showed substantial or \nalmost perfect agreement between the forecast classifications. With the caveat that this would not apply in a \nregion with restrictions to air flow such as a mountain range, or with extreme fluctuations such as a coastline \nsite, this study suggests that data from a single site is suitable for forecasting a distance of up to 41 km.  \n1. Introduction \nResearch on atmospheric pollen began in the UK in 1941, with continuous trapping for extended periods at \ndifferent sites having been carried out since 1942 (Hyde and Adams 1958). Trapping and recording airborne \npollen has been useful in many different disciplines, including: monitoring climate change; estimating, \ndetection or forecasting dispersal of allergens; risk assessment of GM pollen spread; and, cross-pollination \nof plant varieties (Lacey and West 2006). \n \nAirborne pollen grains are an established cause of allergy related respiratory symptoms in predisposed \nsubjects (Epton et al. 1997), being the primary cause of seasonal allergic rhinitis, and an important cause of \nasthma (Peternel et al. 2004, Taylor et al. 2007). In recent decades allergies due to pollen have greatly \nincreased throughout the world, especially in large cities and industrialised areas (Peternel et al. 2004; \nCaiola et al. 2002; D'Amato et al. 2007). The three main types of allergenic pollen are grass, weed and tree \npollen; however, not all species elicit strong allergenic effects ( D'Amato et al. 2007). \n \nFrom a clinical perspective, pollen data can be a useful aid in diagnosing the cause of an individual’s \nallergies. For an individual allergic to particular pollen, the prediction of the start of that pollen’s season can \nallow them to adjust their daily activities so as to avoid contact with the allergen (Peternel et al. 2004), or to \nbegin taking medication. Pollen count data is also important for research into allergic rhinitis, in particular \nfor clinical trials into immunotherapy, vaccines and antihistamines, which rely on pollen counts to assess the \nefficacy of the drugs in relation to the severity of the allergenic stimulus (Keskin et al. 2006; Pajno et al. \n2003; Mirone et al. 2004).  \n \nHistorically in the East Midlands region of the UK, airborne pollen has been monitored at two cities, Derby \nand Leicester, situated forty-one km (twenty-five miles) apart. In April 2006 a new aerobiology unit was \ncreated to be responsible for counting and producing a forecast for both cities. Forecasts are produced daily \nor weekly based on the previous day or week’s data, weather forecasts, and an understanding of pollen \nseason trends. It takes time and effort to produce the counts and forecasts, so the aim of the present study \nwas to compare aerobiological data from both cities obtained over a twelve month period, followed by two \nfurther years of summer grass and nettle pollen data, to determine if a forecast based on data from one site \nwould be sufficient for both cities, and to address the wider issue of reproducibility between two \ngeographically separated locations.  \n2 \n \n \n2. Materials and methods \n2.1 Pollen Counting \nAtmospheric pollen was sampled over a twelve month period (April 2006 to 2007) using seven-day \nrecording volumetric spore traps (Burkard manufacturing Co. Ltd) situated at the Universities of Leicester \nand Derby. After this period pollen was recorded for most of the year (apart from the winter months) for \n2007 and 2008 at the Leicester site, and for the summer months at Derby. Derby (52°55’ N 1°29’ W) is an \nindustrial city with a population of about 230,000, more than 100 km from any coast. The trap was sited on \nthe roof of Derby University Mickleover site, 10 m above ground level in a suburb 110 m above sea level \nand approximately 4 km SW of the city centre. Leicester (52°38’ N 1°5’ W) is an industrial city with a \npopulation of about 280,000, about 90 km from the coast. The trap was sited on the roof of a building on the \nUniversity of Leicester campus, 12 m above ground level in an urban area 60 m above sea level and \napproximately 1 km S of the city centre. The two sites are 41 km (about 25 miles) apart.  \n \nTwenty-six pollen types were identified by pollen morphology microscopically according to British \nAerobiology Federation standardised techniques (BAF 1995). Daily slide or seven day drum traps were used \nwith mounting and staining techniques following methods described by Morrow Brown and Jackson \n(1978a). Pollen concentrations were expressed as average number of pollen grains per cubic metre of air per \nday (grains m\n-3\n air day\n-1\n).  \n \nMinimum and maximum temperature and rainfall data were provided by meteorologist David Vince for \nDerby and the Leicester city council air quality group for Leicester, from meteorological stations 0.5 km and \n5 km respectively from trap sites.  \n \n2.2 Analysis \nAnnual cumulative counts were calculated from the summation of daily average pollen concentrations. The \nsix most abundant pollen taxa were then subjected to further analyses. Where appropriate, the 95% method \nwas used to define the pollen season retrospectively, with the start of the season being the date on which \n2.5% of the total count for the 12 months was recorded, and 97.5% being the end (Andersen 1991). When \nthe 95% method was not appropriate, start and end date were defined as per Fehér and Járai-Komlódi \n(1997). \n \nA Wilcoxon signed rank test on the paired abundance data between the two cities was performed. \nCorrelation between the Derby and Leicester pollen counts for each taxa and between temperature and \nrainfall variables were calculated using Spearman's rank correlation coefficient.  \n \nTo compare the count obtained from both sites for any given day, pollen counts were normalised by log \ntransformation using ln(Y+1) where Y is the pollen count, then Bland-Altman plots were performed. The \nBland-Altman plot looks at the difference between two measures of a specific pollen type on a single day. \nThe mean value is plotted on the x-axis, and the difference between the actual values and the mean on the y-\naxis.  If there was no difference between the counts on any given day all the data would be on the y=0 axis. \nPositive y values represent days when Derby counts are higher than Leicester, negative y values when Derby \ncounts are lower. To check if the bias and variability are uniform throughout the range of measurement, the \ndata is plotted graphically. The standard deviation of the differences is calculated to take into consideration \nvariation about the mean, and the upper and lower confidence levels plotted. A Pearson product moment \ncorrelation of the difference versus average data is calculated to see if there is a consistent tendency for one \nsite of measurement, to exceed the other (the bias).  \n \nPollen levels on any given day were classified as low, moderate, high or very high based on accepted UK \ngrass pollen threshold values (Smith and Emberlin 2005) and inter-site agreement was assessed using \nweighted kappa statistics using quadratic weighting. All analyses were performed using GraphPad Prism \nversion 4.02 for Windows (GraphPad Software, San Diego California) with the exception of weighted kappa \n3 \n \nstatistics for which MedCalc for Windows version 9.6.4.0 (MedCalc Software, Mariakerke, Belgium) was \nused.  \n \n3. Results \nPollen counts were recorded at both sites from 4th April 2006 to 4th April 2007 inclusive. In Derby 17 days \nwere lost resulting in 349 days for comparison. In 2007 pollen counts continued to be recorded in Leicester \nuntil 11\nth\n October, and in 2008 from 5\nth\n February to 30\nth\n September. Derby pollen counts were recorded in \n2007 from 17\nth\n May to 7\nth\n September, and in 2008 from 4\nth\n June 07 to 8\nth\n September. Unless otherwise \nstated, results and discussion refer solely to the 4th April 2006 to 4th April 2007 study period. \n \nA Wilcoxon signed rank test was performed on the paired annual abundance data (Table 1) for each pollen \ntype and there was found to be no significant difference (p=0.7215) between the two cities. The Spearman's \nrank correlation coefficient was calculated to ensure the pairing was effective (rs = 0.8229, p<0.0001). The \npollen types recorded could be split into two clear groups according to annual abundance, maximum daily \nconcentration and the number of days in which levels exceeded 50 grains m\n-3\n air (Table 1). Six taxa; ash, \nbirch, grass, oak, nettle-type and yew-type, had peak daily concentrations reaching 300 grains m\n-3 \nair or \nhigher. In contrast the remaining taxa never reached daily peaks of 200 grains m\n-3 \nair. In terms of annual \nabundance the high group cumulated between 1850 and 6472 grains m\n-3 \nair, dependant on city and taxa \nanalysed, compared to values of 0 to 796 grains m\n-3 \nair for the less abundant group. The abundant group \nwere recorded at high levels (>50 grains m\n-3 \nair) on multiple days at both cities unlike the remaining taxa. Of \nthe six abundant pollen types, five were moderate to highly allergenic, the exception being nettle-type which \nis not generally thought to be allergenic. It should be noted, however, that nettle-type includes pollen from \nthe plant pellitory-of-the wall (Parietaria judaica), which grows in the UK and is highly allergenic (Jäger \n2004). The six taxa combined represent 90 and 88% of the total pollen count for Derby and Leicester \nrespectively. Only the six taxa in the more abundant pollen group were subjected to further analyses.  \n \nTotal annual abundance for birch, nettle-type, oak and ash were comparable between Derby and Leicester \n(Table 1). Grass was more abundant in Derby than Leicester, whilst yew-type was higher in Leicester than \nDerby. Maximum daily concentration for all six abundant taxa was very high (>150 grains m\n-3 \nair) at both \ncities. Absolute values were comparable for grass, birch and nettle whilst maximum daily concentration for \nyew-type was higher in Leicester than Derby; and conversely for oak and ash, higher in Derby than \nLeicester. The number of days with high counts was comparable for grass, birch, oak and ash, however, \nthere were more high days in Leicester than Derby for nettle-type and yew-type, high being defined as \ngreater than 50 grains m\n-3 \nair.  \n \nOver 99.5% of the total birch, grass, nettle and oak pollen recorded during the twelve months was from the \n2006 calendar year (Table 2) enabling start and finish dates to be calculated using the 95% criterion \n(Andersen 1991). In Leicester 3.53% of the total ash recorded was from 2007, so the end of the season was \ndefined by the Derby dates alone. Yew-type pollen was recorded in high quantities in both years so no start \nand finish dates were calculated. To enable other comparisons, the end of the 2006 season, and the start of \nthe 2007 season were defined as per Fehér & Járai-Komlódi (1997) and the two partial seasons used together \nas they covered a full twelve month period. Birch and grass pollen season start and finish dates were very \nsimilar at both sites, whilst nettle exhibited a slightly longer season end tail in Derby. The oak season in \nDerby was prolonged in both directions. \n \nThere were highly significant positive correlations between the counts obtained for each taxa from the two \nsites (Table 3) and also between temperature and rainfall measurements at the two cities for the same time \nperiod. The correlations between temperature variables were much stronger than that for rainfall.  \n \nLine charts showing the average number of pollen grains m\n-3\n air day\n-1\n show highly similar trends, although \nabsolute peak values vary with some taxa (Fig. 1). Bland-Altman plots (Fig. 2) show little discrepancy \nbetween the amounts of pollen counted by the two sites on any given day, although birch, grass, and nettle-\ntype show tighter agreements than ash, oak and yew-type as indicated by less distance between the upper \n4 \n \nand lower confidence levels (represented by the dotted lines). Pearson product moment correlation of the \ndifference versus average data generated in the Bland-Altman analyses showed no significant trend in the \ndifferences between the counts from the two sites as the average count increased for grass, nettle-type, oak \nand yew-type pollen (Table 4). The two pollen types with the shortest seasons (ash and birch, with 21 and 20 \ndays respectively) showed weak trends, with ash exhibiting a significant but weak positive trend and birch \nexhibiting a significant but weak negative trend (p = 0.019 and 0.0204 respectively). \n \nFor both cities, each day during the grass pollen season was classified as having low, moderate, high or very \nhigh levels of grass pollen according to the UK accepted threshold levels (Smith and Emberlin 2005). In \naddition a further seven days at the beginning and end of the season were analysed to capture the tails. As \nseen in Table 5, the majority (71%) of the days were classified identically in both cities. The remaining \ndays, with a single exception, varied by only a single category e.g. low or moderate, moderate or high, high \nor very high. Weighted kappa statistics comparing the grass pollen levels from both cities (Table 6) showed \nalmost perfect agreement (k = 0.871) between the values for each city.   \n \nAs there are no accepted threshold guidelines for the other pollen taxa analysed, the grass forecasting levels \nwere used to classify each day during the respective seasons (extended by 7 days each way) for the \nremaining five taxa. As with the grass levels, weighted kappa analysis showed substantial or almost perfect \nagreement between the two data sets for all the pollen types analysed (Table 6).  \n \nIn 2007 and 2008 for the grass and nettle pollen seasons, there was a highly significant positive correlation \nbetween the counts recorded from both cities (Table 7). Line charts showing the average number of pollen \ngrains m\n-3\n air day\n-1\n show near identical trends; and the Bland-Altman plots show little discrepancy between \nthe amounts of pollen counted by the two sites on any given day (Fig. 3). Pearson product moment \ncorrelation of the difference versus average data generated in the Bland-Altman analyses (Table 7) showed \nno significant trend in the differences between the counts from the two sites for grass and nettle in 2007, and \nnettle in 2008. Grass counts during 2008 showed a weak but statistically significant negative trend. \nWeighted kappa analysis showed substantial or almost perfect inter-site agreement between the two cities \ngrass and nettle seasons (extended by 7 days in one direction) when the days were classified as low, \nmoderate, high or very high (Table 7).  \n \n4 Discussion \n4.1 Defining the Pollen season  \nAt least ten different criteria for calculating the length of pollen seasons have been published (Jato et al. \n2006). The two most popular methods involve either defining the start of the season as the date in which the \ncumulative count reaches a pre-defined quantity, eg. Sum75, (Driessen et al. 1990; Emberlin et al. 1999), a \ntechnique often used for forecasting purposes during the season with no defined end point, or defining the \nseason retrospectively as the period during which a defined percentage of the annual total was counted with \nthe remaining percentage equally divided either side of the season e.g. 90% (Andersen 1991; Piotrowska \n2004), 95% (Andersen 1991; Rodriguez-Rajo et al. 2004; Mendez et al. 2005) and 98% (Galán et al. 1995). \nThe retrospective percentage technique eliminates the long tails of low values at the start and end of the \nseasons which could otherwise introduce bias to the results during statistical analysis (Galán et al. 1995). \nThe 98% criterion was shown to yield the longest grass season in a multi-year, multi-city study and resulted \nin a long tail at the end of the season (Jato et al. 2006). When applied to the data in this study, the 90% \ncriterion shortened the season to an extent that excluded the first high (>50 grains m\n-3 \nair day\n-1\n) grass day of \nthe year (data not shown). For these reasons the 95% criterion was used to define the season for both cities, \nand where discrepancies in the start and finish date occurred, the longest period that encompassed 95% for \nboth cities was used for further analyses.  \n \nIt was not possible to use the 95% criterion to define the ash and yew-type pollen seasons. As detailed in the \nresults section, only Derby dates were used to calculate the ash season using the 95% criterion. No season \ndates were attributed to yew-type pollen, but for the purposes of comparing data the method of Fehér and \nJárai-Komlódi (1997) was used to define the end of the 2006 and start of 2007 yew-type pollen seasons. The \n5 \n \n2007 start date being defined as the day when a concentration of 3 grains m\n-3 \nair was consistently exceeded, \ni.e. the pollen concentration was above 3 grains m\n-3\n air on at least 5 days during the following week. The \n2006 end-date being defined inversely as the last day on which the concentration was consistently still over \n3 grains m\n-3\n air.  \n \nThe 2007 and 2008 grass and nettle seasons were defined using the 95% criterion based on the Leicester \ndata only. Leicester winter months 2007\/08 and 2008\/09 were not counted, however the 2006 data showed \nthat less than 0.3% of the annual grass and nettle counts are produced within this period, and therefore these \nmissing data would have minimal if any impact on the season dates. In addition, historical data from Derby \nprovides further support that the winter months contribute very little towards the grass and nettle seasons. \nDerby pollen was recorded consistently between 1991 and 2005. During the periods 1\nst\n Jan to 4\nth\n Feb and 1\nst\n \nOct to 31\nst\n Dec, the total grass count contributed to between 0.3 and 0.7% of the annual total (mean = 0.45), \nand for nettle 0.2 to 1.7% (mean = 0.62) (data unpublished).  \n \n4.2 Pollen abundance \nOne of the key aims of this study was to determine whether a forecast based on data from one site would be \nsufficient for both cities. Pollen forecasts have many functions, many of which are related to hayfever. \nThese include being used to diagnose the causative agent of an individual’s hayfever, to warn sufferers on \nthe start and severity of a particular season (Peternel et al. 2004), and also to assist with the timing for \nhayfever related clinical trials (Davies and Smith 1973). For specific pollen to be a serious risk of causing \nhayfever it needs to be both allergenic and present in quantities that can elicit a response, therefore only the \nmore abundant pollen types were subjected to further analysis in the study. Days with high counts were \ndefined as those when the maximum daily concentration was higher than 50 grains m\n-3\n air. This is the \nthreshold used in the UK to define high grass pollen days, based on the observation by W. Frankland and R. \nDavies that when the mean daily concentration of grass pollen grains in the air of central London exceeded \n50 grains m\n-3\n, all of their patients in the area who were clinically sensitive to grass pollen experienced \nsymptoms (Davies and Smith 1973). Whilst it is acknowledged that not all pollen types will cause symptoms \nat the same threshold values, there are no other threshold values for the other pollen types based on UK \nclinical data. The group of pollen types defined as abundant were present at high levels for between eight \nand thirty-three days over the study period and therefore represent the key taxa used for the pollen \nforecasting service. In contrast the remaining pollen types that made up the less abundant group never \nreached high levels at both cities. In fact only three pollen types reached high levels at either site, pine-type \non one day in Derby, and plantain and plane for three days and two days respectively in Leicester. Plantain \nand pine-type are considered to have low allergenicity and plane moderate to high. The six taxa in the \nabundant group in this study are consistent with the most abundant pollen types in a 21 year study in \nSwitzerland, and four of them are in the list of the most important aeroallergens in Europe (Clot 2003). The \nSwiss study also listed pine-type as being highly abundant, which in this study was the seventh most \nabundant at both sites, but clearly less abundant than the other six.  \n \n4.3 Pollen season characteristics \nThere are a number of different characteristics that can be used to describe the pollen season. Those used in \nthis study include annual abundance, maximum daily concentration, number of days with high counts, \nseason start date and season end date. There was no consistent difference noted between the two cities, and \nthe differences that were observed were both pollen and method of observation specific. For example, oak \nshowed consistency between the two cities in terms of annual abundance, maximum daily count and number \nof high days and yet clearly exhibited a prolonged season in both directions in Derby compared to Leicester. \nGrass was consistent between both cities in terms of maximum daily count, number of high days, and start \nand end of season, however, the annual abundance was clearly higher in Derby. Yew-type was more \nabundant and reached a higher maximum daily count in Derby than Leicester, but was at high levels for two \ndays longer in Leicester than Derby. This highlights the fact that caution must be exercised when comparing \ntwo sites based on these types of characteristics, and warns against the use of a single measurement such as \nstart date for comparing seasons.  \n \n6 \n \n4.4 Comparison between the Leicester and Derby pollen seasons \nRegardless of how the counts from the two cities were compared, there was clearly a very strong \nrelationship between the data. For all six taxa analysed, the counts from the two cities were correlated in a \nstrong, highly significant and positive manner, as were minimum and maximum temperature. Rainfall was \nalso highly significantly correlated between the two sites, however the relationship was not as strongly \npositive. The implication from this is that rainfall can vary between the two sites, and this may have an \neffect on the pollen levels recorded, whereas temperature is fairly stable and therefore less likely to be a \nfactor in any differences in the pollen counts.  \n \nPollen concentration trends between the two sites were similar for all six taxa; however, the absolute peak \nvalues did vary. To see if differences in peak values had an effect on the corresponding forecast, each day \nwas categorised for each taxa as having low, moderate, high or very high pollen levels. The numbers of days \nwith agreeing classifications compared to non agreement was compared using weighted kappa statistics. \nKappa statistics is a means of comparing inter-observer variation, or in the case of this study, inter-site \nvariation. Weighting the kappa statistic takes into consideration how far apart any discrepancies are. A \ndifference of a single category, such as high to very high, would be considered in higher agreement than one \nof two categories, such as moderate to very high. A kappa statistic of 0.81 to 0.99 is considered to be almost \nperfect agreement, and that of 0.61 to 0.80 substantial agreement (Viera and Garrett 2005). Birch, grass, \nnettle-type and oak showed almost perfect agreement, and ash and yew-type substantial agreement.  \n \nA difference of a single pollen grain can lead to a day being classified into a different category e.g. 29 grains \nis classified as low, 30 grains moderate. These discrepancies will affect any comparisons based on \nclassifications, such as the kappa statistic. An alternative means of assessing inter-observer variation is the \nBland-Altman plot (Bland and Altman 1999), which compares the actual counts and plots the data \ngraphically. In addition a Pearson product moment correlation is calculated to assess bias in the dataset. In \ngeneral, the Bland-Altman plots showed little discrepancy between the amounts of pollen counted by the \ntwo sites on any given day, with four of the six taxa exhibiting no bias, and two taxa exhibiting weak trends. \n \n4.4.1 Comparing the abundant tree pollen taxa \nThe ash tree (Fraxinus) belongs to the olive family, and for many years was considered as being important \nonly as secondarily allergenic pollen due to cross-reactions with pollen from the olive tree (Olea), \nconsidered to be the most allergenic pollen in the Mediterranean. Since 1991, however, ash has been \nincluded in the list of the major allergenic pollen in Europe (Peeters 2000). A recent review of allergenic \npollen has suggested that ash rarely induces allergic respiratory symptoms (D'Amato et al. 2007). At both \nDerby and Leicester sites, ash pollen was the sixth most abundant pollen type reaching high levels on ten or \nmore days during the twelve month main study period. The trends were comparable and the season start \ndates identical. There was good correlation between the two sites, although this was the weakest of the six \ntaxa analysed, possibly reflecting the smaller dataset due to it being the least abundant of the six and having \none of the shortest seasons. The Bland-Altman showed good agreement, although there was a statistically \nsignificant weak positive trend in the dataset. This weak positive trend occurs when Derby has higher counts \non high days, with Leicester typically having higher counts on lower count days, which is also seen when \nthe data is displayed graphically. After classifying the days as low, moderate, high or very high, the \nagreement between the sites was substantial, implying it is possible to use one dataset to forecast for both \nsites for ash pollen.  \n \nBirch pollen (Betula) is considered to be one of the most allergenic aeroallergens, especially in Northern \nEuropean countries (Adams-Groom et al. 2002; Corden et al. 2000; D'Amato et al. 2007). In terms of \nabundance during the main study period (April 06 to 07), birch pollen ranked 2\nnd\n in Derby, and 3\nrd\n in \nLeicester in terms of total abundance, and first for both cities in terms of max counts in any given day. \nSeason start and finish dates were within one day of each other at both sites and the data was very highly \ncorrelated. The peaks and troughs in pollen counts were mirrored almost perfectly between the two sites. \nBland-Altman showed a very tight relationship between the counts from both sites, although there was a \nweak but significant negative trend in the dataset. This trend suggests that Derby counts were higher than \n7 \n \nLeicester when the counts were lower; and lower than Leicester when the counts were higher; however, \ncloser inspection of the data suggests this may be an artefact rather than a true statement. Kappa analysis \nafter classifying the days as having low, moderate, high or very high birch pollen counts shows the two sites \nto be in almost perfect agreement. These results indicate that data from either site can be used to forecast for \nboth.  \n \nThere are two main oak tree species found throughout the East Midlands, UK Quercus robur (English oak) \nand Quercus petraea (Sessile oak). Whilst oak is considered to be only a moderate allergen (Jäger 2004; \nEgger et al. 2008), there is evidence that it is has had clinical significance in the study area (Ross et al. \n1996). Oak was the fifth most abundant pollen type for both cities during the main study period (April 06 to \n07). With a total abundance of over 2,000 grains at both sites, this was a relatively high year for oak pollen. \nA study in Derby from 1970 to 1997 recorded only one year with levels that was higher than this (Corden \nand Millington 1999). Oak appeared to exhibit a prolonged season in Derby compared to Leicester, starting \nthree days earlier, and ending thirteen days later; however, the actual trends are very similar with the main \npeaks coinciding perfectly. The counts for the two sites were highly correlated; the Bland-Altman plot \nshowed good agreement with no bias within the dataset, and the kappa analysis after each day had been \ndescribed as having low, moderate, high or very high counts showed almost perfect agreement. This would \nsuggest that forecasting for both sites can be based on data from a single site, and cautions against the use of \nseason start and finish dates as sole indicators for agreement between multiple sites.  \n \nDue to an inability to distinguish between them morphologically, pollen from Taxaceae (yew family) and \nCupressaceae (cypress, a conifer family) are grouped together as yew-type. The cypress family is known for \nmoderate to high allergenicity (Jäger 2004), whereas yew pollen is considered to be low. The grouping of \nTaxaceae and Cupressaceae in one type has artificially augmented the importance of this group (Clot 2003). \nThe diversity of trees and shrubs that make up this group could potentially also explain the high number of \npollen peaks found over three consecutive months (Feb to April). Even with the diversity of plants that make \nup this group and the fact that many trees from this group are planted as ornamentals, all the peaks and \ntroughs are in alignment between the two sites, albeit with Derby peaks being higher than Leicester in April, \nand Leicester being higher than Derby in February and March. There is a very high correlation between the \ndata from both sites, the Bland-Altman plot shows good correlation, with no significant trend in the data and \nthe kappa analysis after allocating the days to low, moderate, high and very high showed substantial \nagreement. For yew-type pollen it can be concluded that data from one site would be sufficient to forecast \npollen levels from both.  \n \n4.4.2 Comparing nettle and grass pollen over three consecutive seasons \nThe Urticaceae family consists of more than 50 genera, of which the two most important are Urtica (nettle) \nand Parietaria (pellitory of the wall). Both Urtica and Parietaria are common weed plants, with Urtica \nbeing more ruderal than Parietaria (Vega-Maray et al. 2003). Parietaria pollen grains elicit severe \npollinosis, however, it is not possible to readily distinguish Parietaria grains from Urtica by pollen \nmorphology so in this study the two pollens are grouped together under the term nettle-type. Both are found \nin the area around the two study sites analysed in this study, although the exact distribution of them is not \nknown. Nettle-type is clearly a key component of the aero flora for both cities, being the second highest \npollen type in terms of abundance in Leicester and third in Derby during the main study period (April 06-\n07). In the two subsequent years, even with the reduced counting period, the total abundance of nettle-type \nin both cities was even higher than in 06-07 (data not shown). In general a single species will exhibit a \ntypical pollen distribution, with a lag at the start and end and a clear peak nearer to the start of the season \nthan the end. Nettle-type pollen does not follow this pattern, in part due to the different flowering times of \nthe different species that make up the group. For example, Urtica dioica flowers from June to August, \nUrtica urens from June to September, and Parietaria judaica from June until October (Corden and \nMillington 1991). All three species named can be found in the study area. Whilst there may be differences in \nthe exact species composition between Leicester and Derby, which may explain the few discrepancies noted \nin peaks and troughs towards the end of the 2007 season, in all three years there was a high correlation \nbetween the counts for both cities, and substantial agreement between the counts as indicated by both kappa \n8 \n \nstatistics and the Bland-Altman plot. In addition no bias was found in the dataset after Bland-Altman \nanalyses had been implemented in any year. Taken together it can be argued that counts from either site \nwould be sufficient to forecast the nettle-pollen levels for both cities.  \n \nThe grass family Poaceae (Gramineae) is very large and consists of over 600 genera, including grasses of \nlowlands and meadows, as well as cereal crops such as oats, barley and wheat. Grass pollen is the primary \ncause of pollinosis in many parts of the world, including the UK (Emberlin 1997, D'Amato et al. 2007). In \nthe East Midlands, UK during the study period April 06 to April 07, grass ranked first in terms of total \nabundance in Derby, and fourth in Leicester. Maximum daily counts for both cities were almost identical, \nand both cities had nearly 30 days with greater than 50 grains m\n-3\n air day\n-1\n. This is the threshold at which all \nof patients in the area clinically sensitive to grass pollen are likely to experience symptoms (Davies and \nSmith 1973). Season start dates were within two days of each other, and end dates identical. There was a \nvery high correlation between the counts; and whilst absolute pollen counts varied, peaks and troughs \nmirrored each other almost perfectly. The Bland-Altman plot showed a tight relationship between the counts \nfrom both sites, with no bias in the dataset. Most of the days during the pollen season were at comparable \nlevels according to classification groups, with only one day out of the 70 days analysed being more than one \nclassification out. Kappa analysis of this data showed almost perfect agreement between the classifications \nat both sites. 2006 data clearly shows that grass pollen from one site can generate a forecast applicable for \nboth sites. In addition, as with nettle pollen, grass pollen was recorded for a further two years; 2007 and \n2008. As with 2006, the Bland-Altman plot shows a very tight agreement between counts from both cities, \nand peaks and troughs mirror each other almost perfectly. Whilst no bias was found in 2006 or 2007, a weak \nbut significant negative trend was found in the 2008 dataset, suggesting that Derby counts were higher than \nLeicester when the counts were lower; and lower than Leicester when the counts were higher, but a closer \ninspection of peaks and troughs showed that this was not the case. There was a very high correlation \nbetween counts; and kappa analysis of data after classifying each day as having low, moderate, high or very \nhigh counts, showed almost perfect agreement. Data from 2007 and 2008 therefore support the assertion that \na forecast based on grass data from one of the sites will be accurate enough to represent both.  \n \n4.5 General discussion \nMost comparative between site pollen studies from Europe have assessed regions that are geographically \ndivergent. For example, between different European countries (Alcázar et al. 2009; Corden et al. 2002; Jäger \net al. 1996; Piotrowska 2004; Spieksma et al. 2003), or between cities in different regions of the UK \n(Adams-Groom et al. 2002; Morrow Brown and Jackson 1978b). This study was unique in that it analysed \ntwo sites that represent two different cities from a specific geographical region (East Midlands, UK) that \nwere relatively close together; 41 km (about 25 miles). Over three consecutive seasons, both grass and \nnettle-type pollen levels were shown to be consistent between the two cities. Methods of analysis comparing \nthe absolute data (Bland-Altman) and those that compared classifications of the data (kappa statistics after \nclassifying the days as low, moderate, high and very high) showed tight agreement and substantial or almost \nperfect agreement respectively. This study has shown that, for the purpose of pollen forecasting, the count \nfrom one site in the region is suitable for forecasting for the whole region. This finding was supported by the \nabundant tree pollen data collected during the first year of the study. Together the abundant tree taxa, grass \nand nettle-type pollen represented over 88% of the air spora in the East Midlands, UK. \n \nA similar study in Sydney Australia counted pollen from three sites in a 30km region, and concluded that, \nwhilst for clinical trial purposes data collection must be local and applicable to the study population, for \ninforming the public about pollen counts, the count from 1 trap is a reasonable estimation in a 30 km region \n(Katelaris et al. 2004).  \n \n5. Conclusion \nPollen counts were clearly highly correlated between the two sites analysed. Grass is the most allergenic \npollen in the region, and for three consecutive years this study has shown that both grass and nettle-type \npollen data from one site is suitable for forecasting for the region. This was supported in the first year of the \nstudy by the abundant tree pollen taxa; ash, birch, oak, and yew-type, not sampled in subsequent years. With \n9 \n \nthe caveat that this would not apply in a region with restrictions to air flow such as a mountain range, or with \nextreme fluctuations in conditions as one would get from a coastline site, this study suggests that a forecast \nbased on data from a single site may be suitable for forecasting in a 40 km region.  \n \nAcknowledgments \nThe authors are grateful to the Midlands Asthma and Allergy Research Association (MAARA) for providing \nfunding to carry out this study; to Mike Greenwood, Elizabeth Taylor, and the rest of the team from the \nFaculty of Education Health and Sciences at the University of Derby for kindly changing the pollen traps; \nand to David Vince and Claire Barbour for providing weather data for Derby and Leicester respectively.  \n \nReferences \nAdams-Groom, B., Emberlin, J., Corden, J., Millington, W. and Mullins, J. (2002). Predicting the start of the \nbirch pollen season at London, Derby and Cardiff, United Kingdom, using a multiple regression \nmodel, based on data from 1987 to 1997. Aerobiologia 18:117-123. \nAlcázar, P., Stach, A., Nowak, M. and Galán, C. (2009). Comparison of airborne herb pollen types in \nCórdoba (Southwestern Spain) and Poznan (Western Poland). Aerobiologia 25:55-63 \nAndersen, T. B. (1991). A model to predict the beginning of the pollen season. Grana 30:269-275. \nBAF (1995). Airborne pollens and spores: a guide to trapping and counting. The British Aerobiology \nFederation. \nBland, J. M. and Altman, D. G. (1999). Measuring agreement in method comparison studies. Stat. Methods \nMed. Res. 8:135-160. \nCaiola, M. G., Mazzitelli, A., Capucci, E. and Travaglini, A. (2002). Monitoring pollinosis and airborne \npollen in a Rome university. Aerobiologia 18:267-275. \nClot, B. (2003). Trends in airborne pollen: An overview of 21 years of data in Neuchatel (Switzerland). \nAerobiologia 19:227-234. \nCorden, J. and Millington, W. (1991). A study of Gramineae and Urticaceae in the Derby area. Aerobiologia \n7:100-106. \nCorden, J. and Millington, W. (1999). A study of Quercus pollen in the Derby area. Aerobiologia 15:29-37. \nCorden, J., Millington, W., Bailey, J., Brookes, M., Caulton, E., Emberlin, J., Mullins, J., Simpson, C. and \nWood, A. (2000). UK regional variations in Betula pollen (1993-1997). Aerobiologia 16:227-232. \nCorden, J., Stach, A. and Millington, W. M. (2002). A comparison of Betula pollen seasons at two European \nsites; Derby, United Kingdom and Poznan, Poland (1995–1999). Aerobiologia 18:45-53. \nD'Amato, G., Cecchi, L., Bonini, S., Nunes, C., Annesi-Maesano, I., Behrendt, H., Liccardi, G., Popov, T. \nand van Cauwenberge P. (2007). Allergenic pollen and pollen allergy in Europe. Allergy 62:976-990. \nDavies, R. R. and Smith, L. P. (1973). Forecasting the start and severity of the hay fever season. Clinical \nAllergy 3:263-267. \nDriessen, M. N. B. N., Vanherpen, R. M. A. and Smithuis, L. O. M. J. (1990). Prediction of the start of the \ngrass pollen season for the southern part of the Netherlands. Grana 29:79-86. \nEgger, C., Focke, M., Bircher, A.J., Scherer, K., Mothes-Luksch, N., Horak, F. and Valenta, R. (2008). The \nallergen profile of beech and oak pollen. Clinical and Experimental Allergy 38:1688-1696. \nEmberlin, J. C. (1997). Grass, tree and weed pollens, in Allergy and Allergic Diseases, A. B. Kay, ed., \nBlackwell Science, 835-857. \nEmberlin, J., Mullins, J., Corden, J., Jones, S., Millington, W., Brooke, M. and Savage, M. (1999). Regional \nvariations in grass pollen seasons in the UK, long-term trends and forecast models. Clinical and \nExperimental Allergy 29:347-356. \nEpton, M. J., Martin, I. R., Graham, P., Healy, P. E., Smith, H., Balasubramaniam, R., Harvey, I. C., \nFountain, D. W., Hedley, J. and Town, G. I. (1997). Climate and aeroallergen levels in asthma: A 12 \nmonth prospective study. Thorax 52:528-534. \nEriksson, N. E. (1978). Allergy to pollen from different deciduous trees in Sweden. Allergy 33:299-309. \nFehér, Z. and Járai-Komlódi, M. (1997). An examination of the main characteristics of the pollen seasons in \nBudapest, Hungary (1991-1996). Grana 36:169-174. \nFountain, D. W. and Cornford, C. A. (1991). Aerobiology and allergenicity of Pinus radiata  pollen in New \nZealand. Grana 30:71-75. \n10 \n \nGalán, C., Emberlin, J., Dominguez, E., Bryant, R. H. and Villamandos, F. (1995). A comparative analysis \nof daily variations in the Gramineae pollen counts at Codoba, Spain and London, UK. Grana 34:189-\n198. \nHyde, H. A. and Adams, K. F. (1958). An atlas of airborne pollen grains. Macmillan & Co Ltd, London. \nJager, S., Nilsson, S., Berggren, B., Pessi, A. M., Helander, M. and Ramfjord, H. (1996). Trends of some \nairborne tree pollen in the Nordic countries and Austria, 1980-1993 - A comparison between \nStockholm, Trondheim, Turku and Vienna. Grana 35:171-178. \nJäger, S. (2004). Europe Polleninfo.org .http:\/\/www.polleninfo.org. Accessed 29\nth\n April 2009. \nJato, V., Rodríguez-Rajo, F. J., Alcázar, P., de Nuntiis, P., Galán, C. and Mandrioli, P. (2006). May the \ndefinition of pollen season influence aerobiological results? Aerobiologia 22:13-25. \nKatelaris, C. H., Burke, T. V. and Byth, K. (2004). Spatial variability in the pollen count in Sydney, \nAustralia: can one sampling site accurately reflect the pollen count for a region? Annals of Allergy \nAsthma & Immunology 93:131-136. \nKeskin, O., Alyamac, E., Tuncer, A., Dogan, C., Adalioglu, G. and Sekerel, B. E. (2006). Do the leukotriene \nreceptor antagonists work in children with grass pollen-induced allergic rhinitis? Pediatric Allergy and \nImmunology 17:259-268. \nLacey, M. E. and West, J. S. (2006). The Air Spora; a manual for catching and identifying airborne \nbiological particles. Springer, Dordrecht. \nMendez, J., Comtois, P. and Iglesias, I. (2005). Betula pollen: One of the most important aeroallergens in \nOurense, Spain. Aerobiological studies from 1993 to 2000. Aerobiologia 21:115-123. \nMirone, C., Albert, F., Tosi, A., Mocchetti, F., Mosca, S., Giorgino, M., Pecora, S., Parmiani, S. and \nOrtolani, C. (2004). Efficacy and safety of subcutaneous immunotherapy with a biologically \nstandardized extract of Ambrosia artemisiifolia pollen: a double-blind, placebo-controlled study. \nClinical and Experimental Allergy 34:1408-1414. \nMorrow Brown, H. and Jackson, F. A. (1978a). Aerobiological studies based in Derby I. A simplified \nautomatie volumetric spore trap. Clinical Allergy 8:589-597. \nMorrow Brown, H. and Jackson, F. A. (1978b). Aerobiological studies based in Derby III. A comparison of \nsimultaneous pollen and spore counts from the east coast, Midlands and west coast of England and \nWales. Clinical Allergy 8:611-619. \nPajno, G. B., Vita, D., Parmiani, S., Caminiti, L., La Grutta, S. and Barberio, G. (2003). Impact of \nsublingual immunotherapy on seasonal asthma and skin reactivity in children allergic to Parietaria \npollen treated with inhaled fluticasone propionate. Clinical and Experimental Allergy 33:1641-1647. \nPeeters, A. G. (2000). Frost periods and beginning of the ash (Fraxinus excelsior L.) pollen season in Basel \n(Switzerland). Aerobiologia 16:353-359. \nPeternel, R., Srnec, L., Culig, J., Zaninovic, K., Mitic, B. and Vukusic, I. (2004). Atmospheric pollen season \nin Zagreb (Croatia) and its relationship with temperature and precipitation. Int. J. Biometeorol. 48:186-\n191. \nPiotrowska, K. (2004). Comparison of Alnus, Corylus and Betula pollen counts in Lublin (Poland) and Skien \n(Norway). Annals of Agricultural and Environmental Medicine 11:205-208. \nRodriguez-Rajo, F. J., Dopazo, A. and Jato, V. (2004). Environmental factors affecting the start of pollen \nseason and concentrations of airborne Alnus pollen in two localities of Galicia (NW Spain). Annals of \nAgricultural and Environmental Medicine 11:35-44. \nRoss, A. M., Corden, J. M. and Fleming, D. M. (1996). The role of oak pollen in hay fever consultations in \ngeneral practice and the factors influencing patients' decisions to consult. British Journal of General \nPractice 46:451-455. \nSmith, M. and Emberlin, J. (2005). Constructing a 7-day ahead forecast model for grass pollen at north \nLondon, United Kingdom. Clinical and Experimental Allergy 35:1400-1406. \nSpieksma, F. T. M., Corden, J. M., Detandt, M., Millington, W. M., Nikkels, H., Nolard, N., Schoenmakers, \nC. H. H., Wachter, R., de Weger, L. A., Willems, R. and Emberlin, J. (2003). Quantitative trends in \nannual totals of five common airborne pollen types (Betula, Quercus, Poaceae, Urtica, and Artemisia), \nat five pollen-monitoring stations in western Europe. Aerobiologia 19:171-184. \nTaylor, P.E., Jacobson, K.W., House, J.M. and Glovsky, M.M. (2007). Links between Pollen, Atopy and the \nAsthma Epidemic. International Archives of Allergy and Immunology 144:162-170 \n11 \n \nVega-Maray, A. M., Valencia-Barrera, R. M., Fernández-González, D. and Fraile, R. (2003). Urticaceae \npollen concentration in the atmosphere of North Western Spain. Annals of Agricultural and \nEnvironmental Medicine 10:249-255. \nViera, A. J. and Garrett, J. M. (2005). Understanding interobserver agreement: the kappa statistic. Family \nMedicine 37:360-363. \n12 \n \nTable 1 Pollen types identified by morphological characteristics from Derby (DBY) and Leicester (LTR) \nand their respective allergenicity (A) where 0 is none or very low, 1 is low, 2 is low to moderate, 3 is \nmoderate, 4 is moderate to high and 5 is high. Included are total annual abundance (N) and maximum daily \nconcentration (M) in grains m\n-3 \nair, and number of days with higher than 50 grains m\n-3 \nair (T). \nCommon name Latin name A* N M T \n   DBY LTR DBY LTR DBY LTR \nGrass Poaceae 5 6472 4982 435 442 29 28 \nBirch Betula 5 5724 5281 953 943 18 15 \nNettle-type Urtica, Parietaria judaica 0,5 5692 5507 448 467 28 33 \nYew-type Taxaceae, Cupressaceae 4 4693 6377 474 681 24 29 \nOak Quercus 3 2643 2748 775 674 8 10 \nAsh Fraxinus 4 2108 1850 379 303 10 12 \nPine-type Pinaceae 1\n2\n 796 499 81 38 1 0 \nAlder Alnus 4 507 485 37 32 0 0 \nWillow Salix 1 318 360 19 30 0 0 \nElder Sambucus 2 225 160 26 16 0 0 \nDock Rumex 4 160 33 21 3 0 0 \nHazel Corylus 4 158 194 19 38 0 0 \nElm Ulmus 1\n1\n 152 83 11 4 0 0 \nSweet Chestnut Castanea 2 144 89 23 36 0 0 \nRape-type Brassica 2 93 113 11 20 0 0 \nPlantain Plantago 1 89 472 4 139 0 3 \nPlane Platanus 4 81 401 11 159 0 2 \nGoosefoot Chenopodiaceae 2 77 103 6 8 0 0 \nBeech Fagus 2 72 22 15 5 0 0 \nMugwort Artemisia 5 61 58 3 6 0 0 \nPoplar Populus 1\n1\n 37 91 6 18 0 0 \nHorse Chestnut Aesculus 2 32 51 4 8 0 0 \nHornbeam Carpinus 2 25 259 3 40 0 0 \nLime Tilia 0 24 72 2 12 0 0 \nRagweed Ambrosia 5 0 0 0 0 0 0 \n*Allergenicity information from Jäger (2004) except \n1\n(Eriksson 1978) and \n2 \n(Fountain and Cornford 1991).\n13 \n \nTable 2 Season characteristics for the most abundant pollen types recorded in both cities. When dates are given, those for Leicester (LTR) are \npresented as the number of days before (-) or after (+) the respective Derby (DBY) date.  \n \n Ash Birch Grass Nettle Oak Yew-type \n DBY LTR DBY LTR DBY LTR DBY LTR DBY LTR DBY LTR \nTotal pollen grains m\n-3 \nair (all data) 2108 1850 5724 5281 6472 4982 5692 5507 2643 2748 4693 6377 \nTotal pollen count (2006 only) 2097 1785 5718 5274 6470 4979 5692 5507 2639 2742 2673 1788 \nContribution of 2007 data to total (%) 0.54 3.53 0.10 0.13 0.03 0.05 0.00 0.00 0.16 0.22 43.05 71.96 \nDate season starts  15\/4\/06 0 22\/4\/06 +1 6\/6\/06 -2 7\/6\/06 -1 6\/5\/06 +3 n\/a n\/a \nDate season ends  5\/5\/06 n\/a 11\/5\/06 0 29\/7\/06 0 10\/9\/06 -5 11\/6\/06 -13 n\/a n\/a \n \n14 \n \nTable 3 Correlation between the pollen counts from Derby and Leicester for the abundant \npollen taxa. In addition correlations between the temperature and rainfall for the two cities \nare given. \nTaxa Spearman r 95% confidence interval P value (two-tailed) \nAsh 0.6710 0.3246 to 0.8587 0.0009 \nBirch 0.9504 0.8731 to 0.9811 <0.0001 \nGrass 0.8778 0.7964 to 0.9279 <0.0001 \nNettle 0.8407 0.7660 to 0.8929 <0.0001 \nOak 0.7724 0.5915 to 0.8792 <0.0001 \nYew-type 0.8292 0.7515 to 0.8843 <0.0001 \nRainfall (mm) 0.5364 0.4537 to 0.6100 <0.0001 \nMin temp 0.9554 0.9448 to 0.9641 <0.0001 \nMax temp 0.9792 0.9741 to 0.9832 <0.0001 \n \n \n \nTable 4 Pearson product moment correlation (r) of the difference versus average data \ngenerated in the Bland-Altman analysis for each of the pollen data sets. Included is length of \nseason (n) in days.  \nTaxa n r \n95% confidence \ninterval \nP value (two-\ntailed) \nsignificant correlation \n(alpha=0.05) \nAsh 21 0.5068 0.0960 to 0.7701 0.0190 yes \nBirch 20 -0.5141 -0.7794 to -0.0926 0.0204 yes \nGrass 56 -0.1029 -0.3562 to 0.1645 0.4506 no \nNettle-type 93 -0.0543 -0.2552 to 0.1511 0.6052 no \nOak 37 -0.1413 -0.4450 to 0.1915 0.4041 no \nYew-type 96 0.0914 -0.1112 to 0.2867 0.3760 no \n \n15 \n \nTable 5 The number of days from each site with corresponding grass pollen counts according \nto classification levels. Data shown includes the full grass pollen season plus an additional 7 \ndays at the start and end of the season to capture the tails.   \nLeicester \n  Derby   \n Low \n(0-29) \nModerate \n(30-49) \nHigh \n(50-150) \nVery high \n(>150) \nLow 31 6  1 \nModerate 2 1 1  \nHigh  1 8 8 \nVery high   1 10 \n \n \nTable 6 Weighted kappa statistics to demonstrate inter-site agreement after the days have \nbeen classified as having low, moderate, high or very high pollen counts, for all six pollen \ntypes. Analyses based on season data extended in each direction by an additional 7 days.  \nTaxa Quadratic weights SE \nAsh 0.755 0.167 \nBirch 0.916 0.167 \nGrass 0.871 0.118 \nNettle-type 0.979 0.097 \nOak 0.911 0.140 \nYew-type 0.758 0.094 \n \n16 \n \nTable 7 Correlation between the pollen counts from Derby and Leicester during the 2007 and 2008 grass and nettle seasons; Pearson product \nmoment correlation (r) of the difference versus average data generated in the Bland-Altman analysis, including length of season (n) in days; and \nweighted kappa statistics to demonstrate inter-site agreement for season data extended in one direction by an additional 7 days. \n \n Spearman’s rank \ncorrelation coefficient \nPearson’s product \nmoment correlation \nKappa statistics \nTaxa and year Spearman r P value \n(two-tailed) \nn Pearson r P value \n(two-tailed) \nSignificance \n(alpha =0.05) \nQuadratic \nweights \nSE \n(Kw'=0) \nGrass 2007 0.8638 P<0.0001 91 0.0341 0.7486 No 0.858 0.099 \nNettle 2007 0.7161 P<0.0001 93 0.2031 0.0509 No 0.610 0.094 \nGrass 2008 0.9467 P<0.0001 64 -0.3470 0.0050 Yes 0.915 0.119 \nNettle 2008 0.8352 P<0.0001 90 0.1651 0.1198 No 0.708 0.098 \n \n17 \n \nFig. 1 Line graphs showing daily average pollen count during respective pollen season for \nboth cities (a) ash (b) oak (c) birch (d) grass (e) nettle-type, and (f) yew-type.  \n \nFig. 2 Bland-Altman plots showing difference against average pollen count each day for \nDerby and Leicester (a) ash (b) birch (c) grass (d) nettle-type (e) oak, and (f) yew-type. \nDotted lines represent the 95% confidence interval. Pollen counts were log transformed using \nln(Y+1) to normalise. The x-axis is the mean pollen count on any given day, the y-axis the \ndifference between the mean and the actual value, with positive y values representing days \nwhen Derby counts are higher than Leicester and negative y values when Derby counts are \nlower.  \n \nFig. 3 Left panel, Bland-Altman plots showing difference against average pollen count each \nday for Derby and Leicester. Dotted lines represent the 95% confidence interval. Right panel, \nline graphs showing daily average pollen count during respective pollen season (a) grass \n2007 (b) nettle 2007 (c) grass 2008, and (d) nettle 2008. \n \n\n\n\n"}