{"doi":"10.1029\/2004JA010835","coreId":"194739","oai":"oai:lra.le.ac.uk:2381\/707","identifiers":["oai:lra.le.ac.uk:2381\/707","10.1029\/2004JA010835"],"title":"Formation and motion of a transpolar arc in response to dayside and nightside reconnection","authors":["Milan, Steve E.","Hubert, B.","Grocott, Adrian"],"enrichments":{"references":[{"id":44681614,"title":"A correlative study of magnetic flux transfer in the magnetosphere,","authors":[],"date":"1979","doi":"10.1029\/ja084ia06p02573","raw":"Holzer, R. E., and J. A. Slavin (1979), A correlative study of magnetic flux transfer in the magnetosphere, J. Geophys. Res., 84, 2573–2578.","cites":null},{"id":44681622,"title":"A simple model of the flux content of the distant magnetotail,","authors":[],"date":null,"doi":"10.1029\/2004ja010397","raw":"Milan, S. E. (2004a), A simple model of the flux content of the distant magnetotail, J. Geophys. Res., 109, A07210, doi:10.1029\/2004JA010397.","cites":null},{"id":44681627,"title":"A study of the CDAW 9C substorm of May 3, 1986, using magnetogram inversion technique 2, and a substorm scenario with two active phases,","authors":[],"date":"1997","doi":"10.1029\/98ja02383","raw":"Mishin, V. M., et al. (1997), A study of the CDAW 9C substorm of May 3, 1986, using magnetogram inversion technique 2, and a substorm scenario with two active phases, J. Geophys. Res., 102, 19,845–19,859.","cites":null},{"id":44681609,"title":"DARN\/SuperDARN: A global view of the dynamics of high-latitude convection,","authors":[],"date":"1995","doi":"10.1007\/bf00751350","raw":"Greenwald, R. A., et al. (1995), DARN\/SuperDARN: A global view of the dynamics of high-latitude convection, Space Sci. Rev., 71, 761– 796.","cites":null},{"id":44681623,"title":"Dayside and nightside contributions to the cross polar cap potential: Placing an upper limit on a viscous-like interaction,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-3771-2004","raw":"Milan, S. E. (2004b), Dayside and nightside contributions to the cross polar cap potential: Placing an upper limit on a viscous-like interaction, Ann. Geophys., 22, 3771–3777.","cites":null},{"id":44681624,"title":"Dayside convection and auroral morphology during an interval of northward interplanetary magnetic field,","authors":[],"date":"2000","doi":"10.1007\/s005850050901","raw":"Milan, S. E., M. Lester, S. W. H. Cowley, and M. Brittnacher (2000), Dayside convection and auroral morphology during an interval of northward interplanetary magnetic field, Ann. Geophys., 18, 436–444.","cites":null},{"id":44681631,"title":"Dependence of polar cap potential drop on interplanetary parameters,","authors":[],"date":"1981","doi":"10.1029\/ja086ia09p07639","raw":"Reiff, P. H., R. W. Spiro, and T. W. Hill (1981), Dependence of polar cap potential drop on interplanetary parameters, J. Geophys. Res., 86, 7639– 7648.","cites":null},{"id":44681615,"title":"Evolution of ionospheric multicell convection during northward interplanetary magnetic field with jBz\/Byj","authors":[],"date":"2000","doi":"10.1029\/2000ja000163","raw":"Huang, C.-S., G. J. Sofko, A. V. Koustov, D. A. Andre, J. M. Ruohoniemi, R. A. Greenwald, and M. R. Hairston (2000), Evolution of ionospheric multicell convection during northward interplanetary magnetic field with jBz\/Byj > 1, J. Geophys. Res., 105, 27,095–27,107.","cites":null},{"id":44681601,"title":"Excitation and decay of solar wind-driven flows in the magnetosphere-ionosphere system,","authors":[],"date":"1992","doi":"10.1016\/0273-1177(95)00972-8","raw":"Cowley, S. W. H., and M. Lockwood (1992), Excitation and decay of solar wind-driven flows in the magnetosphere-ionosphere system, Ann. Geophys., 10, 103–115.","cites":null},{"id":44681617,"title":"Filamentary structures in the magnetotail lobes,","authors":[],"date":"1987","doi":"10.1029\/ja092ia03p02349","raw":"Huang, C. Y., L. A. Frank, W. K. Petersen, D. J. Williams, W. Lennartsson, D. G. Mitchell, R. C. Elphic, and C. T. Russell (1987), Filamentary structures in the magnetotail lobes, J. Geophys. Res., 92, 2349–2363.","cites":null},{"id":44681630,"title":"IMF By-dependent plasma flow and Birkeland currents in the dayside magnetosphere: 2. A global model for northward and southward IMF,","authors":[],"date":"1985","doi":"10.1029\/ja090ia02p01595","raw":"Reiff, P. H., and J. L. Burch (1985), IMF By-dependent plasma flow and Birkeland currents in the dayside magnetosphere: 2. A global model for northward and southward IMF, J. Geophys. Res., 90, 1595–1609.","cites":null},{"id":44681638,"title":"Interplanetary magnetic field dependency of stable Sun-aligned polar cap arcs,","authors":[],"date":"1994","doi":"10.1029\/93ja03255","raw":"Valladares, C. E., H. C. Carlson, and K. Fukui (1994), Interplanetary magnetic field dependency of stable Sun-aligned polar cap arcs, J. Geophys. Res., 99, 6247–6272.","cites":null},{"id":44681611,"title":"Ionospheric flow during extended intervals of northward but By-dominated IMF,","authors":[],"date":"2003","doi":"10.5194\/angeo-21-509-2003","raw":"Grocott, A., S. W. H. Cowley, and J. B. Sigwarth (2003), Ionospheric flow during extended intervals of northward but By-dominated IMF, Ann. Geophys., 21, 509–538.","cites":null},{"id":44681632,"title":"Large-scale imaging of highlatitude convection with Super Dual Auroral Radar Network HF radar observations,","authors":[],"date":"1998","doi":"10.1029\/98ja01288","raw":"Ruohoniemi, J. M., and K. B. Baker (1998), Large-scale imaging of highlatitude convection with Super Dual Auroral Radar Network HF radar observations, J. Geophys. Res., 103, 20,797–20,811.","cites":null},{"id":44681600,"title":"Magnetospheric and ionospheric flow and the interplanetary magnetic field,","authors":[],"date":"1981","doi":null,"raw":"Cowley, S. W. H. (1981), Magnetospheric and ionospheric flow and the interplanetary magnetic field, in The Physical Basis of the Ionosphere in the Solar-Terrestrial System, AGARD Conf. Proc., CP-295, 4, 1–14.","cites":null},{"id":44681599,"title":"Measuring the dayside reconnection rate during an interval of due northward interplanetary magnetic field,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-4243-2004","raw":"Chisham, G., M. P. Freeman, I. J. Coleman, M. Pinnock, M. R. Hairston, M. Lester, and G. Sofko (2004), Measuring the dayside reconnection rate during an interval of due northward interplanetary magnetic field, Ann. Geophys., 22, 4243–4258.","cites":null},{"id":44681639,"title":"Polar cap arcs: A review,","authors":[],"date":"1997","doi":"10.1016\/s1364-6826(96)00113-7","raw":"Zhu, L., R. W. Schunk, and J. J. Sojka (1997), Polar cap arcs: A review, J. Atmos. Sol. Terr. Phys., 59, 1087–1126.  A. Grocott, B. Hubert, and S. E. Milan, Department of Physics and Astronomy, University of Leicester, University Road, Leicester LE1 7RH, UK. (steve.milan@ion.le.ac.uk) A01212 MILAN ET AL.: TRANSPOLAR ARC MOTION IN RESPONSE TO RECONNECTION","cites":null},{"id":44681636,"title":"Polar cap inflation and deflation,","authors":[],"date":"1985","doi":"10.1029\/ja090ia01p00543","raw":"Siscoe, G. L., and T. S. Huang (1985), Polar cap inflation and deflation, J. Geophys. Res., 90, 543–547.","cites":null},{"id":44681605,"title":"Polar views of the Earth’s aurora with Dynamics Explorer,","authors":[],"date":"1982","doi":"10.1029\/gl009i009p01001","raw":"Frank, L. A., J. D. Craven, J. L. Burch, and J. D. Winningham (1982), Polar views of the Earth’s aurora with Dynamics Explorer, Geophys. Res. Lett., 9, 1001–1004.","cites":null},{"id":44681629,"title":"Properties of 6300-A˚ auroral emission at South Pole,","authors":[],"date":"1989","doi":"10.1029\/ja094ia02p01402","raw":"Rairden, R. L., and S. B. Mende (1989), Properties of 6300-A˚ auroral emission at South Pole, J. Geophys. Res., 94, 1402–1416.","cites":null},{"id":44681626,"title":"Response of the magnetotail to changes in the open flux content of the magnetosphere,","authors":[],"date":"2004","doi":null,"raw":"Milan, S. E., S. W. H. Cowley, M. Lester, D. M. Wright, J. A. Slavin, M. Fillingim, C. W. Carlson, and H. J. Singer (2004), Response of the magnetotail to changes in the open flux content of the magnetosphere, J. Geophys. Res., 109, A04220, doi:10.1029\/2003JA010350.","cites":null},{"id":44681628,"title":"Simultaneous Cluster and IMAGE observations of cusp reconnection and auroral proton spot for northward IMF,","authors":[],"date":"2003","doi":null,"raw":"A01212 MILAN ET AL.: TRANSPOLAR ARC MOTION IN RESPONSE TO RECONNECTION 10 of 11 A01212 Phan, T., et al. (2003), Simultaneous Cluster and IMAGE observations of cusp reconnection and auroral proton spot for northward IMF, Geophys.","cites":null},{"id":44681619,"title":"Solar wind dependence of the occurrence and motion of polar auroral arcs: A statistical study,","authors":[],"date":"2002","doi":"10.1029\/2002ja009245","raw":"Kullen, A., M. Brittnacher, J. A. Cumnock, and L. G. Blomberg (2002), Solar wind dependence of the occurrence and motion of polar auroral arcs: A statistical study, J. Geophys. Res., 107(A11), 1362, doi:10.1029\/ 2002JA009245.","cites":null},{"id":44681621,"title":"Solar wind electron proton alpha monitor (SWEPAM) for the Advanced Composition Explorer, Space Sci.","authors":[],"date":"1998","doi":"10.1007\/978-94-011-4762-0_20","raw":"McComas, D. J., S. J. Bame, P. Barker, W. C. Feldman, and J. L. Philips (1998), Solar wind electron proton alpha monitor (SWEPAM) for the Advanced Composition Explorer, Space Sci. Rev., 86, 563.","cites":null},{"id":44681635,"title":"Strong sunward propagating flow bursts in the night sector during quiet solar wind conditions, SuperDARN and satellite observations,","authors":[],"date":"2002","doi":"10.5194\/angeo-20-771-2002","raw":"Senior, C., J.-C. Cerisier, F. Rich, M. Lester, and G. K. Parks (2002), Strong sunward propagating flow bursts in the night sector during quiet solar wind conditions, SuperDARN and satellite observations, Ann. Geophys., 20, 771–779.","cites":null},{"id":44681634,"title":"Substorm intensifications and field line resonances in the nightside magnetosphere,","authors":[],"date":"1992","doi":"10.1029\/91ja03156","raw":"Samson, J. C., D. D. Wallis, T. J. Hughes, F. Creutzberg, J. M. Ruohoniemi, and R. S. Greenwald (1992), Substorm intensifications and field line resonances in the nightside magnetosphere, J. Geophys. Res., 97, 8495–8518.","cites":null},{"id":44681633,"title":"The configuration of the magnetosphere, in Critical Problems of Magnetospheric Physics,","authors":[],"date":"1972","doi":null,"raw":"Russell, C. T. (1972), The configuration of the magnetosphere, in Critical Problems of Magnetospheric Physics, edited by E. R. Dyer, p. 1, InterUnion Comm. on Sol. Terr. Phys., Natl. Acad. of Sci., Washington, D. C.","cites":null},{"id":44681612,"title":"The influence of IMF By on the nature of the nightside highlatitude ionospheric flow during intervals of positive","authors":[],"date":"2004","doi":"10.5194\/angeo-22-1755-2004","raw":"Grocott, A., S. V. Badman, S. W. H. Cowley, T. K. Yeoman, and P. J. Cripps (2004), The influence of IMF By on the nature of the nightside highlatitude ionospheric flow during intervals of positive IMF Bz, Ann. Geophys., 22, 1755–1764.","cites":null},{"id":44681607,"title":"The theta aurora,","authors":[],"date":"1986","doi":"10.1029\/ja091ia03p03177","raw":"Frank, L. A., et al. (1986), The theta aurora, J. Geophys. Res., 91, 3177– 3224.","cites":null},{"id":44681625,"title":"Variations in polar cap area during two substorm cycles,","authors":[],"date":"2003","doi":"10.5194\/angeo-21-1121-2003","raw":"Milan, S. E., M. Lester, S. W. H. Cowley, K. Oksavik, M. Brittnacher, R. A. Greenwald, G. Sofko, and J.-P. Villain (2003), Variations in polar cap area during two substorm cycles, Ann. Geophys., 21, 1121–1140.","cites":null},{"id":44681637,"title":"Variations in the polar cap area during intervals of substorm activity on","authors":[],"date":"1996","doi":"10.1007\/s005850050353","raw":"Taylor, J. R., T. K. Yeoman, M. Lester, B. A. Emery, and D. J. Knipp (1996), Variations in the polar cap area during intervals of substorm activity on 20–21 March 1990 deduced from AMIE convection maps, Ann. Geophys., 14, 879–887.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005","abstract":"We trace the formation and subsequent motion of a transpolar arc in response to dayside and nightside reconnection. Both high- and low-latitude dayside reconnection are observed, as well as periods of substorm and nonsubstorm nightside reconnection, during the 7-hour interval of interest on 19 January 2002. We speculate that the arc is formed by a burst of nonsubstorm nightside reconnection and that its subsequent motion is controlled predominantly by the rate of dayside high-latitude reconnection, siphoning open flux from the dusk sector polar cap to the dawn sector. The observations allow us to quantify the rates of reconnection: on the nightside, 35 and 100 kV during nonsubstorm- and substorm-related bursts, respectively; on the dayside, 30 and 100 kV for high- and low-latitude reconnection. The latter values give effective merging line lengths of 1 and 5.5 R E for northward and southward interplanetary magnetic field, respectively. We suggest that transpolar arc motion will be controlled not only by the B y component of the IMF but also by the relative magnitude of the B z component, when ∣B y ∣ > B z motion will be dawnward for B y < 0 nT and duskward for B y > 0 nT; however, when B z > ∣B y ∣, we expect that the arc will move toward the noon-midnight meridian of the polar cap","downloadUrl":"http:\/\/www.agu.org\/pubs\/crossref\/2005\/2004JA010835.shtml.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/707\/1\/Milan2005a.pdf","pdfHashValue":"620871f5c77269dbfc95ba13b2c0dd8bd6c6f33e","publisher":"American Geophysical Union (AGU)","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/707<\/identifier><datestamp>\n                2015-12-14T17:10:26Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nFormation and motion of a transpolar arc in response to dayside and nightside reconnection<\/dc:title><dc:creator>\nMilan, Steve E.<\/dc:creator><dc:creator>\nHubert, B.<\/dc:creator><dc:creator>\nGrocott, Adrian<\/dc:creator><dc:description>\nWe trace the formation and subsequent motion of a transpolar arc in response to dayside and nightside reconnection. Both high- and low-latitude dayside reconnection are observed, as well as periods of substorm and nonsubstorm nightside reconnection, during the 7-hour interval of interest on 19 January 2002. We speculate that the arc is formed by a burst of nonsubstorm nightside reconnection and that its subsequent motion is controlled predominantly by the rate of dayside high-latitude reconnection, siphoning open flux from the dusk sector polar cap to the dawn sector. The observations allow us to quantify the rates of reconnection: on the nightside, 35 and 100 kV during nonsubstorm- and substorm-related bursts, respectively; on the dayside, 30 and 100 kV for high- and low-latitude reconnection. The latter values give effective merging line lengths of 1 and 5.5 R E for northward and southward interplanetary magnetic field, respectively. We suggest that transpolar arc motion will be controlled not only by the B y component of the IMF but also by the relative magnitude of the B z component, when ∣B y ∣ > B z motion will be dawnward for B y < 0 nT and duskward for B y > 0 nT; however, when B z > ∣B y ∣, we expect that the arc will move toward the noon-midnight meridian of the polar cap.<\/dc:description><dc:date>\n2009-12-08T16:24:00Z<\/dc:date><dc:date>\n2009-12-08T16:24:00Z<\/dc:date><dc:date>\n2005<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nJournal of Geophysical Research, 2005, 110, pp.A01212-<\/dc:identifier><dc:identifier>\n0148-0227<\/dc:identifier><dc:identifier>\nhttp:\/\/onlinelibrary.wiley.com\/doi\/10.1029\/2004JA010835\/abstract<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/707<\/dc:identifier><dc:identifier>\n10.1029\/2004JA010835<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRadio and Space Plasma Physics<\/dc:relation><dc:rights>\nThis paper was published as Journal of Geophysical Research, 2005, 110, A01212.  It is also available from http:\/\/www.agu.org\/pubs\/crossref\/2005\/2004JA010835.shtml.  Doi: 10.1029\/2004JA010835<\/dc:rights><dc:publisher>\nAmerican Geophysical Union (AGU)<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0148-0227","0148-0227"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Radio and Space Plasma Physics"],"year":2005,"topics":[],"subject":["Article"],"fullText":"Formation and motion of a transpolar arc in response to dayside\nand nightside reconnection\nS. E. Milan, B. Hubert,1 and A. Grocott\nDepartment of Physics and Astronomy, University of Leicester, Leicester, UK\nReceived 7 October 2004; revised 13 November 2004; accepted 29 November 2004; published 19 January 2005.\n[1] We trace the formation and subsequent motion of a transpolar arc in response to\ndayside and nightside reconnection. Both high- and low-latitude dayside reconnection are\nobserved, as well as periods of substorm and nonsubstorm nightside reconnection,\nduring the 7-hour interval of interest on 19 January 2002. We speculate that the arc is\nformed by a burst of nonsubstorm nightside reconnection and that its subsequent motion is\ncontrolled predominantly by the rate of dayside high-latitude reconnection, siphoning\nopen flux from the dusk sector polar cap to the dawn sector. The observations allow us\nto quantify the rates of reconnection: on the nightside, 35 and 100 kV during\nnonsubstorm- and substorm-related bursts, respectively; on the dayside, 30 and 100 kV for\nhigh- and low-latitude reconnection. The latter values give effective merging line\nlengths of 1 and 5.5 RE for northward and southward interplanetary magnetic field,\nrespectively. We suggest that transpolar arc motion will be controlled not only by the\nBy component of the IMF but also by the relative magnitude of the Bz component,\nwhen jByj > Bz motion will be dawnward for By < 0 nT and duskward for By > 0 nT;\nhowever, when Bz > jByj, we expect that the arc will move toward the noon-midnight\nmeridian of the polar cap.\nCitation: Milan, S. E., B. Hubert, and A. Grocott (2005), Formation and motion of a transpolar arc in response to dayside and\nnightside reconnection, J. Geophys. Res., 110, A01212, doi:10.1029\/2004JA010835.\n1. Introduction\n[2] Recent studies have shown that observations of the\npolar ionosphere can be used to monitor changes in the\namount of open magnetic flux in the magnetosphere, from\nwhich the rates of low-latitude dayside reconnection and\nnightside magnetotail reconnection can be deduced (e.g.,\nmost recently, Taylor et al. [1996], Mishin et al. [1997],\nMilan et al. [2003, 2004], and Milan [2004b]). Increases\nin the area of the polar cap are symptomatic of the creation\nof new open flux by reconnection at the low-latitude\nmagnetopause (that is, by reconnection of interplanetary\nmagnetic field lines with closed terrestrial field lines),\nwhereas a decrease in polar cap area indicates the onset\nof reconnection in the magnetotail. However, this does not\nallow a quantification of the reconnection rate at a high-\nlatitude, or lobe, reconnection site, which is expected to\noccur when the interplanetary magnetic field (IMF) has a\nsignificant northward component [e.g., Russell, 1972;\nCowley, 1981; Reiff and Burch, 1985; Cowley and\nLockwood, 1992]. This is because lobe reconnection does\nnot change the amount of open flux in the magnetosphere\nbut rather stirs the open flux that is already present. As a\nconsequence the rate at which lobe reconnection occurs\nand the factors which control this are presently not well\nknown, though some estimates have been made from, for\ninstance, ionospheric flow data [Huang et al., 2000;\nChisham et al., 2004].\n[3] Another phenomenon associated with periods of\nnorthward IMF is the appearance of auroral arcs within\nthe polar cap, sometimes known as transpolar arcs or,\nwhen they stretch almost entirely across the polar cap, as\ntheta aurora (Frank et al. [1982, 1986]; see also review by\nZhu et al. [1997]). In the main these arcs are thought to be\nthe optical manifestation of particle precipitation on closed\nfield lines. This indicates that under northward IMF\nconditions the polar cap can become bisected by a tongue\nof closed flux emanating from the nightside auroral oval,\nwith ramifications for magnetotail structure that have been\ndiscussed by, e.g., Frank et al. [1986], Huang et al.\n[1987], and Zhu et al. [1997]. Under these circumstances\nthe polar cap can be thought of as containing two compart-\nments of open flux partitioned by the transpolar arc, and\nthese compartments map to a bifurcated lobe. The motion\nof transpolar arcs across the polar cap from dawn to dusk\nand vice versa is controlled to a large extent by the By\ncomponent of the IMF [e.g., Frank et al., 1986; Rairden\nand Mende, 1989; Valladares et al., 1994; Kullen et al.,\n2002], suggesting that these dynamics are associated with\nmagnetic reconnection.\n[4] In this paper we demonstrate that indeed the motion\nof such arcs is probably controlled by the rate of lobe\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 110, A01212, doi:10.1029\/2004JA010835, 2005\n1Also at Laboratory of Planetary and Atmospheric Physics, University\nof Liege, Liege, Belgium.\nCopyright 2005 by the American Geophysical Union.\n0148-0227\/05\/2004JA010835$09.00\nA01212 1 of 11\nreconnection transferring open flux from one polar cap\ncompartment to the other. Thus the motion of the transpolar\narc, or more importantly, the inflation of one polar cap\ncompartment, and the corresponding deflation of the other,\ncan be used to quantify the rate of lobe reconnection. We\ncompare observations of the polar aurora from the Imager\nfor Magnetopause-to-Aurora Global Exploration (IMAGE)\nFUV\/Wide-band Imaging Camera (WIC) instrument\n[Mende et al., 2000a, 2000b] with simultaneous measure-\nments of the ionospheric convection flow by the Super\nDual Auroral Radar Network (SuperDARN) [Greenwald et\nal., 1995] to quantify reconnection rates at the low- and\nhigh-latitude magnetopause and in the magnetotail.\n2. Observations\n[5] Figure 1 shows the upstream IMF conditions in GSM\ncoordinates as measured by the magnetometer instrument\nonboard the ACE spacecraft [Smith et al., 1998], between\n1200 UT on 18 January and 1800 UT on 19 January 2002.\nThese data have been time lagged by 75 min to account for\nthe propagation delay from ACE, located near the L1\nLagrangian point, to the magnetopause and the subsequent\npropagation of information to the ionosphere. This lag was\ncalculated given the location of ACE at X \u0002 240 RE and a\nsolar wind speed of \u0003350 km s\u00041, as measured by the Solar\nWind Electron, Proton, and Alpha Monitor instrument\n[McComas et al., 1998]. Our interval of interest, 0700–\n1430 UT on 19 January, highlighted in grey in Figure 1,\noccurred toward the end of an extended period of northward\nIMF. The By component changed from negative to positive\nat 0930 UT, at which time Bz reached a maximum of 15 nT.\nThereafter Bz decreased and turned negative at 1145 UT,\nand By became near zero. These variations are reflected in\nthe IMF clock angle, which progressed relatively smoothly\nfrom \u000470\u0001 to 70\u0001 between 0700 and 1145 UT and thereafter\nsettled near 180\u0001.\nFigure 1. GSM Bx, By, and Bz interplanetary magnetic\nfield components, along with the corresponding clock angle,\nmeasured during a 30-hour interval on 18 and 19 January\n2002 by the ACE spacecraft. Period pertaining to the\nionospheric observations is highlighted in grey.\nFigure 2. (a–f ) Six snapshots of the Northern Hemi-\nsphere auroral configuration during the period of interest by\nthe Imager for Magnetopause-to-Aurora Global Exploration\n(IMAGE) FUV\/Wide-band Imaging Camera (WIC) instru-\nment, presented in a magnetic latitude and magnetic local\ntime frame, with noon toward the top of each panel.\nConcentric circles mark magnetic latitudes of 60\u0001, 70\u0001, and\n80\u0001. Darker shading indicates brighter aurora. Locations of\nthree Canadian Auroral Network for the OPEN Program\nUnified Study (CANOPUS) stations, Dawson (DAWS),\nFort Smith (FSMI), and Fort Churchill (FCHU), are also\nindicated.\nA01212 MILAN ET AL.: TRANSPOLAR ARC MOTION IN RESPONSE TO RECONNECTION\n2 of 11\nA01212\n[6] Figures 2a–2f show a sequence of auroral images\ntaken by the FUV\/WIC instrument onboard the IMAGE\nspacecraft. Dayglow is evident at the top of each image;\notherwise, darker shades indicate brighter aurora. The se-\nquence of images shows a dim, somewhat contracted oval,\nwith some evidence of a nightside brightening (Figure 2a);\nfurther brightening on the nightside and the formation of a\ntranspolar arc in the postmidnight sector (Figures 2b and 2c);\na progression of the transpolar arc from dawn toward dusk\n(Figures 2d and 2e); and a confinement of the arc in the\npremidnight sector (Figure 2f), the arc appearing to shrink\naway from the dayside as the auroral oval as a whole\nexpands to lower latitudes. The locations of three stations\nof the Canadian Auroral Network for the OPEN Program\nUnified Study (CANOPUS) network (described by Samson\net al. [1992]), Dawson (DAWS), Fort Smith (FSMI), and\nFort Churchill (FCHU), are indicated in each panel. We will\nemploy magnetograms from all three stations to identify\nsubstorm onset; in addition, FSMI houses a meridian-\nscanning photometer, which we use to supplement the\nspaceborne imager.\n[7] To gain a better understanding of the motion of the\ntranspolar arc and the auroral oval, Figure 3 shows keo-\ngrams of the FUC\/WIC auroral observations along the\nnoon-midnight (Figure 3a) and dawn-dusk (Figure 3c)\nmeridians. Also included in Figure 3 are 557.7-nm auroral\nobservations from the FSMI meridian-scanning photometer\n(Figure 3b), roughly coincident with the midnight meridian\nof Figure 3a; X-component magnetograms from DAWS,\nFSMI, and FCHU (Figure 3d); and the IMF clock angle\n(Figure 3e). The times of the auroral snapshots in Figure 2\nare indicated at the top of the diagram by arrows. Dayglow\nin the sunlit hemisphere is apparent in Figure 3a, but clear\nalso is the auroral oval on both the dayside and the\nnightside. In Figure 3c the auroral oval is visible in both\ndawn and dusk sectors, and near the center of the polar cap\nthe transpolar arc is also apparent. From these observations\nit is clear that the auroral oval remained at an approximately\nconstant latitude from 0700 until 1140 UT, during the\nperiod that IMF Bz > 0 nT, whereafter it smoothly proceeded\nto lower latitude, after the southward turning of the IMF to\nBz < 0 nT. A brightening of the nightside oval is seen from\n\u00030730 until \u00030930 UT, and a clear substorm breakup is\nseen at 1245 UT. For most of the interval the magnetograms\nremain very quiet, though with the clear signature of sub-\nstorm breakup shortly before 1300 UT, corresponding to the\nonset determined from the auroral observations; no magne-\ntogram signatures are observed during the initial auroral\nbrightening period, 0730–0930 UT. We note at this point an\ninteresting feature in Figure 3a: a faint auroral feature,\nmarked by an arrow, that starts near the dayside auroral\noval at the time of the southward turning (1140 UT), crosses\nthe polar cap, and disappears into the nightside substorm\nbreakup aurora at 1300 UT. This feature marks the sunward\nend of the transpolar arc, as will be discussed in more detail\nin section 3.4.\n[8] The transpolar arc first formed near 0820 UT\n(Figure 2b) and remained visible until shortly before\n1300 UT. However, it was not apparent in the keogram of\nFigure 3c until 0850 UT and disappeared from the dawn-\ndusk meridian near 1200 UT, shortly after the southward\nturning of the IMF. During this interval a steady progres-\nsion of the arc from dawn to dusk can clearly be seen in\nFigure 3c, irrespective of whether IMF By < 0 or By > 0,\nthough the duskward motion is perhaps most rapid after the\nIMF turned from By < 0 to By > 0 at 0945 UT. In other\nwords, during this interval the motion of the arc does not\nappear to be directly linked to the dawn-dusk orientation of\nthe IMF, in contrast to reports by previous authors [e.g.,\nValladares et al., 1994; Kullen et al., 2002].\n[9] The open flux contained within the magnetosphere\nwas determined from the size of the dim polar cap in the\nauroral measurements, using the techniques described by\nMilan et al. [2003, 2004], and the variation in this as a\nfunction of time is shown in Figure 4. The total open flux\nFPC is shown as the thick solid curve in Figure 4a. We also\ndetermined the partitioning of this flux by the transpolar arc\ninto dawn- and dusk-sector polar caps, and these are shown\nFigure 3. (a) A keogram of the IMAGE FUV\/WIC\nobservations along the noon-midnight meridian. Times of\nthe auroral snapshots of Figure 2 are indicated at the top by\narrows. (b) A 557.7-nm keogram of the FSMI meridian-\nscanning photometer, corresponding approximately to the\nnightside portion of Figure 3a. (c) IMAGE FUV\/WIC\nkeogram from the dawn-dusk meridian. (d) X-component\nmagnetograms from the DAWS, FSMI, and FCHU stations.\nVariations shown are relative, an arbitrary baseline having\nbeen removed from each trace. (e) IMF clock angle.\nA01212 MILAN ET AL.: TRANSPOLAR ARC MOTION IN RESPONSE TO RECONNECTION\n3 of 11\nA01212\nby the quantities Fdawn and Fdusk, represented by dashed and\ndotted curves, respectively. We will discuss these findings in\nmore detail in sections 3.1 and 3.3.\n[10] Finally, we turn to the ionospheric convection mea-\nsurements made by the SuperDARN radars, presented in\nFigure 5, superimposed on the IMAGE auroral observations\npreviously shown in Figure 2 (though somewhat dimmed to\naid clarity). These are produced by compiling 10-min\naverages of line-of-sight Doppler velocity observations\nfrom eight Northern Hemisphere radars, which are then\nused to constrain the solution of an order 8 spherical\nharmonic expansion of the potential pattern, using the\ntechnique of Ruohoniemi and Baker [1998]. Where data\nare sparse, an IMF-driven empirical convection model is\nemployed to further constrain the potential pattern, though\nin the present case the data coverage was generally excel-\nlent, and the empirical model contributed only little to the\nfinal solutions. In Figure 5, contours show the resulting\npotential pattern, solid and dashed contours for negative and\npositive potentials, respectively, with a contour spacing of\n6 kV. The vectors indicate the locations of radar observa-\ntions that contributed to the potential solution; the length of\nthese is related to the flow speed.\n[11] The first potential pattern, from 0730 UT, Figure 5a,\nshows convection typical of northward IMF conditions.\nThis includes sunward flow near noon with two ‘‘reverse\nconvection’’ lobe cells, with centers near 80\u0001, 1400 mag-\nnetic local time (MLT), and 85\u0001, 0900 MLT, indicating the\noccurrence of high-latitude reconnection [e.g., Russell,\n1972; Cowley, 1981; Reiff and Burch, 1985; Cowley and\nLockwood, 1992; Huang et al., 2000; Milan et al., 2000;\nChisham et al., 2004]. These cells appear to be contained\nentirely within the polar cap, that is, are located poleward of\nthe dayside auroral luminosity, as expected for this recon-\nnection scenario. The two lobe cells are not exactly sym-\nmetrical about the noon-midnight meridian but are shifted\ntoward the prenoon sector, as a consequence of the IMF\nBy < 0 nT conditions that prevailed at this time. On the\nnightside, coincident with the auroral brightening first\nobserved shortly before 0730 UT, relatively strong west-\nward flows are seen in the midnight and premidnight\nsectors. These nightside flows are highly reminiscent of\nFigure 4. (a) Total polar cap flux, and the flux contained\ndawnward and duskward of the transpolar arc, determined\nfrom the auroral observations, indicated by thick solid,\ndashed, and dotted curves, respectively. Thin solid curves\nrepresent fits to these data, found using the (b) reconnection\nrates shown (see text for more details). Figure 4b shows\nestimated nightside reconnection rate, FC, and low- and\nhigh-latitude dayside reconnection rates FA and FB,\ncalculated from equations (2) and (5), respectively, for\neffective X-line lengths LA and LB of 5.5 and 0.5 RE.\n(c) IMF clock angle.\nFigure 5. (a–f) Six auroral snapshots of Figure 2, with\nSuperDARN estimates of the simultaneous ionospheric\nconvection overlaid. Vectors indicate the location of\nconvection measurements. Fitted potential contours are\nseparated by 6 kV.\nA01212 MILAN ET AL.: TRANSPOLAR ARC MOTION IN RESPONSE TO RECONNECTION\n4 of 11\nA01212\nthose reported by Senior et al. [2002] and Grocott et al.\n[2003, 2004] which are observed during nonsubstorm\nepisodes of magnetotail reconnection occurring when the\nIMF is directed northward. They found that such flows\ntend to be directed east-west for By < 0 nT and west-east\nfor By > 0 nT, consistent with the present observations.\n[12] A very similar flow pattern is observed in Figure 5b,\nat 0820 UT, though in this case the dayside flows are\nperhaps somewhat enhanced. At this time the initial devel-\nopment of the transpolar arc is apparent; the nightside\nwestward flows are contained to the west of this nascent\narc. In the next auroral snapshot, at 0900 UT, Figure 5c, the\ntranspolar arc is well developed. The flow measurements\nhave not changed substantially at this time, though the\nnightside flows are somewhat diminished. Again, these\nnightside flows are located to the west of the transpolar\narc. The postnoon lobe convection cell is contained entirely\nwithin the dusk-sector polar cap. Interestingly, the prenoon\nlobe cell convection appears to begin in the dusk-sector\npolar cap and to be directed sunward and then westward,\nsuch that it skirts the sunward end of the transpolar arc and\nenters the dawn-sector polar cap. At 1000 UT, Figure 5d,\nthe nightside flows have diminished almost entirely, though\nthe dayside flows, especially from dusk-sector to dawn-\nsector polar caps, are enhanced. The sunward flow region\nassociated with the reverse convection is now located\npostnoon, consistent with expectations [e.g., Cowley and\nLockwood, 1992], as By has become positive at this time.\n[13] At 1130 UT, Figure 5e, the lobe convection cells are\nstill present, though the flow speeds have decreased. There\nis now some enhanced convection on the nightside, appar-\nently confined to the nightside dawn-sector polar cap,\nthough there are no flow measurements premidnight to\nconfirm that this confinement is real. Finally, we turn to\nFigure 5f, 1200 UT, which shows the development of a\nstrong twin-cell convection pattern, as expected following\nthe southward turning of the IMF after 1145 UT. Unfortu-\nnately, no flow measurements are available in the premid-\nnight sector, into which the transpolar arc is being pushed.\nIn section 3 we discuss the formation, motion, and subse-\nquent decay of the transpolar arc in terms of the convection\nflows measured by SuperDARN and a theoretical under-\nstanding of the coupling between the solar wind and the\nmagnetosphere.\n3. Discussion\n[14] Our observations show the development and subse-\nquent motion of a transpolar arc during an interval of\nnorthward IMF. Before discussion of the formation and\nsubsequent motion of the arc itself, we examine the solar\nwind–magnetosphere coupling expected to occur during the\nevent, which previous studies lead us to believe that we now\nunderstand relatively well [e.g., Milan et al., 2003, 2004;\nMilan, 2004a, 2004b].\n3.1. Polar Cap Dynamics\n[15] The start of the period of interest, from 0700 until\n1145 UT, is characterized by northward IMF; thereafter, the\nIMF turned southward. During the first interval we expect\nhigh-latitude reconnection to occur between the IMF and\nmagnetotail lobe field lines; during the second interval, low-\nlatitude or subsolar reconnection between closed terrestrial\nfield lines and the IMF is expected. The latter process\ncreates new open flux, causing the polar cap to expand\nand the auroral oval to move to lower latitudes; the former\nprocess does not, and the polar cap remains of constant size\nunless nightside reconnection occurs. We now show that\nthese expectations are consistent with the observations\nduring the present interval.\n[16] The transpolar arc forms at the eastward edge of a\nnightside auroral brightening associated with westward\nplasma convection, argued by Grocott et al. [2003,\n2004] to be the signature of magnetotail closure of open\nflux during northward IMF, nonsubstorm intervals; the\nCANOPUS magnetograms confirm that substorm signa-\ntures are absent at this time. It is now clear that such\nreconnection bursts are an important component of the\nflux transfer mechanism within the magnetosphere, and we\ncoin the phrase ‘‘tail reconnection during IMF-northward,\nnonsubstorm intervals’’ (TRINNIs) to describe them. From\nthe auroral observations we estimate that prior to the onset\nof the nightside brightening associated with the TRINNI, the\npolar cap contained FPC \u0002 0.6 GWb of open flux (Figure 4).\nDuring the nightside brightening, from 0730 until 0900 UT,\nthis flux decreased until FPC reached 0.4 GWb, representing\na flux closure rate of \u000335 kV. After \u00030900 UT, tail\nreconnection ceased and the total flux content of the mag-\nnetosphere remained constant until the southward turning of\nthe IMF at \u00031145 UT. At this point, FPC began to increase\nrapidly as subsolar magnetopause reconnection commenced,\ndriving the development of a twin-cell convection pattern\ncharacteristic of southward IMF. For instance, in Figure 5f,\nflow can clearly be seen crossing the dayside auroral oval\nfrom low latitudes to high latitudes as the auroral oval\nprogresses to lower latitudes (see Figure 3), indicating the\ncreation of new open flux and the associated expansion of\nthe polar cap. At 1245 UT, substorm expansion phase onset\nwas observed in both the auroral observations and magneto-\ngrams (Figure 3). The growth of the polar cap was slowed\nand then reversed to contraction (Figure 4), as substorm tail\nreconnection commenced and then dominated over the\ndayside reconnection rate.\n[17] As described by Milan [2004b, and references\ntherein], it is straightforward to deduce the rates of dayside\nand nightside reconnection from observations of the polar\ncap area and upstream IMF conditions. Changes in polar\ncap flux content are controlled by Faraday’s law, cast in the\nfollowing form [e.g., Siscoe and Huang, 1985]:\ndFPC\ndt\n¼ d\ndt\nZ\nPC\nB \u0006 ds ¼ FA \u0004 FC ; ð1Þ\nwhere FA and FC are the rates of low-latitude dayside\nreconnection and magnetotail reconnection, respectively. B\nis the ionospheric magnetic field strength, the radial\ncomponent of which, integrated over the polar cap, gives\nthe open flux content of the magnetosphere. Dayside and\nnightside reconnection rates can be determined by fitting to\nthe observed variation in FPC. The rate of low-latitude\ndayside reconnection FA can be predicted from the half\nwave rectified Y component of the upstream solar wind\nmotional electric field, VxBS, integrated along an effective\nA01212 MILAN ET AL.: TRANSPOLAR ARC MOTION IN RESPONSE TO RECONNECTION\n5 of 11\nA01212\nscale length LA which takes a value between 5 and 8 RE\n[Milan, 2004a, 2004b]:\nFA ¼ VxBSLA; ð2Þ\nwhere BS is the southward component of the IMF, i.e.,\nBS ¼\n0 Bz > 0\n\u0004Bz Bz < 0\n8<\n: : ð3Þ\nFA, so predicted using a value of LA = 5.5 RE, is shown in\nFigure 4b. The cross-wind scale of the magnetopause is of\nthe order of 25 RE, suggesting that the reconnection\nefficiency is close to 20–25% [e.g., Holzer and Slavin,\n1979; Reiff et al., 1981; Milan, 2004a, 2004b]. We also\nassume that the nightside auroral brightening (0730 until\n0900 UT) has associated with it a nightside reconnection\nrate of FC = 35 kV, as discussed above. Integration of FA\nand FC, using an initial value of FPC of 0.6 GWb, fits\nwell the observations until 1245 UT, when the polar cap\nceases to expand as expected. The discrepancy between\npredicted and measured FPC indicates that the tail\nreconnection rate associated with the substorm onset is of\nthe order of FC = 100 kV. Using this value, the thin overlaid\ncurve in Figure 4a is found.\n[18] We also note as a point of interest in passing that the\nTRINNI, although it has an average merging rate of 35 kV,\nis clearly pulsed quasiperiodically, with a repetition period\nof \u000320 min, as suggested by the pulsed nature of the FSMI\nmeridian-scanning photometer observations (Figure 3b),\nand modulations of the associated convection velocity (for\nbrevity not shown in the present study, but described also by\nSenior et al. [2002] and Grocott et al. [2003, 2004]). We\nleave this as a topic for further investigation. Further study\nis also needed to understand why there is an absence of\nmagnetogram signatures during this reconnection event,\ndespite periodically varying convection and auroral signa-\ntures at this time.\n3.2. Formation of the Transpolar Arc\n[19] The transpolar arc forms during the TRINNI event\ndescribed in section 3.1. Here we speculate that the occur-\nrence of the TRINNI and the formation of the transpolar arc\nare linked.\n[20] Grocott et al. [2003, 2004] surmised that the direc-\ntion of the flow leaving the polar cap (dawnward or\nduskward) during TRINNIs is modulated by the prevalent\nIMF By orientation in the recent past. This control is exerted\ndue to the dawn-dusk forces exerted on newly opened field\nlines by the By orientation and the dawn-dusk component of\nthe magnetic field that this introduces into the tail lobes as\nopen field lines are stretched antisunward by the flow of the\nsolar wind. Subsequent reconnection of these field lines in\nthe tail creates new closed field lines which are not\ncontained in meridian planes but which straddle the noon-\nmidnight meridian plane of the tail, connecting the dawn\nand dusk sectors in opposite hemispheres. Figure 6 shows\nschematically tail field lines, before and after tail reconnec-\ntion, for the cases of no imposed By in the tail (Figure 6a)\nand By < 0 (Figure 6b), the situation appropriate for the start\nof the interval of interest. Figure 6 shows the Earth looking\ndown onto the north magnetic pole, with the Sun to the top\nof the page. A dashed circle shows the extent of the polar\ncap. Emanating from the nightside of the polar cap, five\nNorthern Hemisphere lobe field lines (pointing toward the\nEarth) and five Southern Hemisphere lobe field lines\n(pointing away from the Earth) are shown by solid and\ndotted lines, respectively. In Figure 6a, when a tail X-line\nforms, the resulting closed field lines are contained in\nmeridian planes, and as they contract and convect around\nthe Earth toward the dayside, they generate dawnward and\nduskward return flow in the nightside ionosphere symmet-\nrically about the noon-midnight meridian. In Figure 6b the\naddition of the By component to the tail skews the northern\nand southern lobe field lines with respect to each other. Now\nwhen reconnection takes place, the resulting closed field\nlines are no longer contained in meridian planes.\n[21] This interesting topology results in strong westward\nflow in the midnight sector of the Northern Hemisphere\nionosphere. The southern hemispheric ends of these field\nlines map to the dusk sector ionosphere and need only\nconvect slowly in the return flow. Correspondingly, in the\ndawn sector of the Northern Hemisphere, slow or stagnant\neastward return flow is expected as the southern hemispheric\nends of these field lines attempt to catch up with vigorous\nFigure 6. Representations of the magnetic field topologies\nin the magnetotail before and after reconnection, for (a) IMF\nBy = 0 and (b) IMF By < 0. Earth is shown from over the\nnorthern magnetic pole, with noon located toward the top of\nthe page. Polar cap is indicated by the dashed circle, and\nnightside field lines are indicated as solid (dotted) lines for\nthe Northern (Southern) Hemisphere. Convection return\nflows in the equatorial plane of the tail and in the\nionosphere are shown by arrows. In Figure 6b, opposing\nforces in the Northern and Southern Hemispheres result in\nthe formation of a transpolar arc (black rectangle).\nA01212 MILAN ET AL.: TRANSPOLAR ARC MOTION IN RESPONSE TO RECONNECTION\n6 of 11\nA01212\neastward flow in the midnight sector. However, the field line\nthat maps to the noon-midnight meridian in the equatorial\nplane faces competition between the Northern and Southern\nHemispheres, as both ends of this field line cannot simply\nconvect sunward in the return flow region as is the case in\nmore simple field geometries.\n[22] We speculate that this field topology, and the plasma\nand flux motions which result, may contribute to the\nformation of the transpolar arc, specifically the extrusion\nof closed plasma sheet field lines out of the equatorial plane\nof the magnetotail to bisect the lobes, as return flow is\nstymied by opposing tension forces between the opposite\nhemispheres. This would place the formation of the arc\nin the dawn (dusk) sectors at the eastern (western) end\nof a strong westward (eastward) convection jet for By < 0\n(By > 0), consistent with the present observations. We\nexpect these relationships to be reversed in the Southern\nHemisphere.\n[23] Figure 7a presents a schematic diagram of the\nenvisaged configuration that the magnetotail takes follow-\ning the onset of the TRINNI (the flows indicated will be\ndescribed in section 3.3). The magnetotail is shown in cross\nsection, looking toward the Earth. The northern and south-\nern (open) lobes are separated by the (closed) plasma sheet,\nwhich is extended to the north and south in tongues of\nclosed flux that map to the transpolar arc in the Northern\nHemisphere and presumably a counterpart arc in the South-\nern Hemisphere, a configuration suggested by, e.g., Frank et\nal. [1986], Huang et al. [1987], and Zhu et al. [1997]. To\nthe north of the equatorial plane, magnetic field lines point\ninto the picture (toward the Earth), whereas below they\npoint out of the page. Although at present we cannot be\ncertain about the mapping of the transpolar arc field lines\nbetween the northern and southern lobes, for the reasons\noutlined above we show the initial configuration with the\nNorthern Hemisphere arc displaced toward dawn and the\nSouthern Hemisphere arc displaced toward dusk, though\nthreaded by common flux. The exact nature of the inter-\nhemispheric antisymmetry\/symmetry of the TRINNI flows,\nand their relationship to transpolar arc formation, is as yet\nunclear due to a dearth of observations to date, and we leave\nthis as an avenue for further investigation.\n3.3. Motion of the Transpolar Arc\n[24] Our observations suggest that in the presence of a\ntranspolar arc the polar cap is partitioned into two regions\ndawnward and duskward of the arc, and high-latitude\nreconnection can siphon open flux from one region to the\nother, causing the arc to move. In this section we investigate\nthis idea in more detail. Fortuitously, this also allows us to\nquantify the high-latitude reconnection rate, a measurement\nthat is normally difficult to make, as estimates of the overall\nsize of the polar cap do not reveal the level of coupling.\nFigure 7. (a and b) Cross sections of the magnetotail,\nlooking toward the Earth, with north toward the top. Open\nlobes are seen to the north and the south, sandwiched\nbetween which is the closed plasma sheet, including\ntongues of closed flux which map to the transpolar arc in\nthe Northern Hemisphere and, we speculate, in the Southern\nHemisphere.\nFigure 8. Schematic diagrams indicating the expected\ndynamics of the polar cap boundary, ionospheric convection\nflow, and transpolar arc, in response to (a) high-latitude\ndayside reconnection, (b) high-latitude dayside reconnec-\ntion and nightside nonsubstorm reconnection, and (c) low-\nlatitude dayside reconnection. Thick solid curves indicate\nthe adiaroic open\/closed field line boundary, and the thick\ndotted curves represent merging gaps. Thin arrowed curves\nshow convection streamlines. Large arrows show motions\nof the open-closed field line boundary. In Figures 8a and 8b\nthe square and diamond indicate the focii of the dusk and\ndawn reverse convection cells, respectively; the circle\nindicates the point at which flow is diverted dawnward or\nduskward after crossing the high-latitude merging gap,\neffectively separating the dawn and dusk cells. In Figure 8c\nthe thin dashed curve shows the boundary between new and\npreexisting open flux. Figure 8a corresponds to Figure 7a,\nand Figure 8c corresponds to Figure 7b.\nA01212 MILAN ET AL.: TRANSPOLAR ARC MOTION IN RESPONSE TO RECONNECTION\n7 of 11\nA01212\n[25] Figure 8a shows schematically the polar cap, sur-\nrounded by the open-closed field line boundary ((OCB)\nheavy solid curve), with noon at the top of the figure. A\ntongue of closed flux, the transpolar arc, is seen to protrude\ninto the polar cap, dividing it into a dawn and dusk region,\ncorresponding to the magnetotail structure illustrated in\nFigure 7a. The dotted thick curve shows the ionospheric\nfootprint of the high-latitude reconnection site, also known\nas the merging gap, sometimes visible as an auroral spot\n[Milan et al., 2000]; the thin arrowed curves show the\nionospheric convection excited by this reconnection. We\nshow here the situation for By > 0, jByj < Bz, appropriate\nsome time after the arc first formed. Plasma flows sunward\nacross the merging gap and is then diverted east and west to\nform the two reverse convection cells. In the postnoon cell,\nplasma and flux is ‘‘stirred’’ as expected. In the prenoon\ncell, however, plasma is transferred from the dusk polar cap\nto the dawn polar cap, causing the former to contract and the\nlatter to expand. Flow streamlines crossing the OCB,\nincluding the transpolar arc, are adiaroic (‘‘not flowing\nacross’’) indicating that the arc moves with the plasma flow,\nfrom dawn to dusk. In this scenario, in the absence of\nnightside reconnection, the overall polar cap remains of\nconstant size.\n[26] In Figure 7a, an indentation is shown in the northern\nlobe, representing open field lines which have been\nremoved from the down-tail lobe by high-latitude recon-\nnection occurring at the dayside magnetopause. This open\nflux is not destroyed but is carried to the east and west by\nthe flow of the solar wind (for jByj < Bz) and laid on the\nmagnetopause as two protuberances. Pressure exerted on the\nmagnetopause by the surrounding solar wind causes the tail\nto revert to a near-circular cross section, which requires\nflows inside the lobe that redistribute the flux within and\ncause the transpolar arc to move. If the picture was to be\nredrawn for the case of jByj > Bz, then the removal of flux\nwould be displaced to dawn (dusk) for By > 0 nT (By < 0 nT),\nand the corresponding readdition of flux would occur at\ndusk (dawn). The resulting flows in the Northern Hemi-\nsphere ionosphere would take the form of single lobe cell\nwith clockwise (anticlockwise) convection, as predicted\nby, e.g., Reiff and Burch [1985] and Cowley and\nLockwood [1992]. In Figures 9a and 9b we contrast the\nionospheric flow patterns expected for jByj < Bz and jByj >\nBz, in these cases for By > 0. The redistribution of flux in\nthe polar cap and in the magnetotail implied by these\nsketches suggests that in the latter case a transpolar arc\ncould move all the way from dusk to dawn, or vice\nversa depending on the orientation of By, whereas in the\nformer case, arc motion will be toward the noon-midnight\nmeridian of the polar cap but no further, irrespective of By\nand the initial location of the arc.\n[27] The rate at which flux is transferred from the dusk\nto dawn polar caps can then be determined from the flux\nmeasurements of Figure 4. This should correspond to the\nlobe reconnection rate associated with the dawn lobe\ncell, which we will refer to as FB, though we should not\nforget that there will be a reconnection rate associated\nwith the dusk cell also, but this does not contribute to\nthe motion of the transpolar arc. The rate of expansion\nof the dawn sector polar cap will be equal to FB. The\nrate of contraction of the dusk sector polar cap has two\ncontributions: FB, as flux is siphoned to the dawn cell,\nand the contraction caused by the nightside reconnection\nFC associated with the TRINNI, which occurs solely from\nthe dusk cell (see, e.g., Figures 5a–5c). Thus we are able to\nwrite\ndFdawn\ndt\n¼ FB\ndFdusk\ndt\n¼ \u0004FB \u0004 FC :\nð4Þ\nWe can also attempt to determine FB from the IMF\nobservations in the same manner as FA in equation (2).\nMilan [2004b] suggested that\nFB ¼ VxBNLB; ð5Þ\nwhere BN is the northward component of the IMF (compare\nto equation (3)) and LB is the effective length of the high-\nlatitude reconnection site. We find that LB = 0.5 RE is a good\nfit for the observations; Figure 4b shows FB calculated\nusing this value. Equation (4) can then be used to find Fdawn\nand Fdusk (set initially to 0 and FPC, respectively), which are\noverlaid as thin solid curves in Figure 4a.\n[28] The expected flow pattern associated with\ncombined lobe and nightside reconnection is shown in\nFigure 8b, appropriate for By < 0, jByj < Bz, the IMF\norientation during the TRINNI. The former stirs flux\nwithin the polar cap; the latter causes an overall contrac-\ntion of the whole polar cap, though in this case the\nmerging gap is confined to the dusk side of the transpolar\narc. The flows across the nightside merging gap are\ndiverted toward dusk, as the observations of Grocott et\nal. [2003, 2004] suggest, unlike substorm-associated\nreconnection, in which flows would be diverted to both\ndusk and dawn, forming the nightside portion of the\ntwin-cell convection pattern. The sketched flows are in\nclose agreement with the observations in Figures 5b–5d.\nFigure 9. Expected ionospheric convection patterns for\nIMF Bz > 0, for the cases (a) jByj < Bz and (b) jByj > Bz; the\npatterns shown are appropriate for By > 0; for By < 0 the\npatterns would be a mirror image about the noon-midnight\nmeridian. Large arrows show the direction and maximum\nextent of arc motion in response to the convection flow. In\nFigure 9a, if the transpolar arc was located in the dusk\nsector, motion would be dawnward toward the noon-\nmidnight meridian. In Figure 9b, motion is duskward,\nirrespective of the location of the arc.\nA01212 MILAN ET AL.: TRANSPOLAR ARC MOTION IN RESPONSE TO RECONNECTION\n8 of 11\nA01212\n[29] The values of FB found in Figure 4b can be com-\npared with estimates of the associated convection voltage\nfrom the SuperDARN observations. From the potential\nsolutions indicated in Figure 5 we determine the potential\ndifference between the center of the dawn lobe cell (which\nappears to be located near the sunward end of the transpolar\narc), shown as a diamond in Figures 8a and 8b, and the\npoint at which flow is deflected either dawnward or dusk-\nward as it passes sunward across the lobe merging gap,\nshown by a circle. Throughout the period 0730–1200 UT\nthis varies between 10 and 20 kV, in close agreement with\nthe values of FB inferred from the changes in size of the\ndawn and dusk polar caps and calculated from equation (5)\nfor LB = 0.5 RE, as shown in Figure 4b. We consider this to\nbe strong evidence for the validity of our model of trans-\npolar arc motion. We should remember that FB and LB are\nappropriate solely for the dawn reverse cell. The total lobe\nreconnection rate, and the potential difference between the\ncenters of the dawn and dusk reverse cells (diamonds and\nsquares in Figure 8), will be approximately double these\nestimates, giving an overall magnetopause merging line\nlength of \u00031 RE.\n[30] By way of comparison, Chisham et al. [2004]\nemployed SuperDARN radar observations to measure a\nlobe reconnection rate of \u000315 kV, for a period of IMF\nBz \u0002 5 nT and a solar wind speed of 350 km s\u00041. Again,\nthis is consistent with an effective lobe merging line length\nof \u00031 RE. We contrast these estimates of the effective length\nof the merging line (the length along which integration of\nthe solar wind motional electric field equals the rate of flux\ntransfer observed in the ionosphere) with an actual high-\nlatitude merging line length of \u00034 RE deduced by Phan et\nal. [2003] for an interval on 18 March 2002. An effective\nmerging line length is not known for the interval of Phan et\nal., as no simultaneous measurement of lobe reconnection\nrate was made, but the discrepancy between actual and\neffective lengths possibly points to a high-latitude recon-\nnection efficiency of \u000325%, similar to that deduced for\nlow-latitude reconnection, as discussed in section 3.1.\n[31] Before moving on, we should emphasize that the\nlobe reconnection rate will probably differ between northern\nand southern lobes. Lobe reconnection might be expected to\noccur preferentially in the northern (southern) lobe for IMF\nBx < 0 nT (Bx > 0 nT), as suggested by Reiff and Burch\n[1985]. During most of the present interval, Bx < 0 nT, and\nlobe reconnection is indeed active in the Northern Hemi-\nsphere. We expect that lobe reconnection is inactive, or\nactive at a reduced rate, in the southern lobe, though our\nobservations do not allow this to be investigated. In other\nwords, LB, the effective length of the lobe reconnection site,\ncan be different for the two lobes, and may be a function of\nBx, though more observations will be needed to confirm\nthis. However, this discussion does suggest that the motion\nof transpolar arcs will be different in the northern and\nsouthern lobes, dependent on Bx, and that their auroral\nconfiguration in the northern and southern polar caps may\nnot appear to remain conjugate (e.g., nonconjugacy has\nbeen observed by Østgaard et al. [2003]), though we\nexpect that the transpolar arcs will still map magnetically\nto each other. This is indicated in Figure 7a, which\nshows lobe reconnection in the Northern Hemisphere,\nand the corresponding motion of the northern transpolar\narc, but with no reconnection or arc motion in the Southern\nHemisphere.\n3.4. Fate of the Transpolar Arc\n[32] Finally, we turn our attention to the interval after\n1145 UTwhen the IMF turns southward. The expected flow\npattern and response of the polar cap flux is shown in\nFigure 8c. The low-latitude merging gap now extends along\nthe dayside OCB, with flow crossing from the closed flux\nregion to the open as field lines are opened, and the polar cap\nas a whole expands with time. We expect at this time that the\nopen\/closed flux regions associated with the preexisting\npolar cap and transpolar arc are shunted to the nightside\nby the addition of new open flux. The boundary between\nnew and old open flux is indicated in Figure 8c by a thin\ndashed curve. The corresponding situation in the tail is\nshown in Figure 7b; here equal amounts of flux have been\nadded to both northern and southern lobes, as required for\nlow-latitude reconnection. The flows which redistribute the\nflux to give the tail a circular cross section, and which\ncorrespond to the antisunward flows in the polar cap, are\nalso indicated. The auroral observations show that at this\ntime the sunward end of the transpolar arc becomes bent\ntoward the noon-midnight meridian by the impinging new\nopen flux (see Figure 8c), and it is this that is observed\nas the faint auroral structure crossing the polar cap from\nthe dayside to the nightside, indicated by the arrow in\nFigure 3a, effectively marking the boundary between\npreexisting and new open flux. The motion of this\nboundary in the keogram of Figure 3a graphically dem-\nonstrates the open flux throughput of the magnetosphere,\nas it is created on the dayside and subsequently destroyed on\nthe nightside following the substorm onset at 1245 UT. The\nnightside reconnection rate during this substorm interval is\n\u0003100 kV, which we contrast with 35 kVobserved during the\nTRINNI earlier in the interval.\n4. Summary and Conclusions\n[33] We summarize the conclusions of this study as\nfollows:\n[34] 1. During a burst of tail reconnection, in the absence\nof normal substorm indicators, occurring under northward\nIMF conditions (which we name a TRINNI), a transpolar\narc forms. Such reconnection bursts have previously been\nobserved by Grocott et al. [2003, 2004], who surmised that\nthe penetration of IMF By into the magnetotail results in\nclosed field lines which are distorted out of meridian planes\nfollowing tail reconnection. We speculate that this could\nlead to a buildup of closed flux that is unable to convect\nnormally in the return flow regions due to competition\nbetween the conjugate hemispheres, resulting in tongues\nof closed flux protruding from the plasma sheet.\n[35] 2. Subsequent motion of the transpolar arc is con-\ntrolled by the rate of lobe reconnection and the associated\ntransport of open flux from one side of the arc to the other.\nTo a first approximation, if IMF By > 0 nT, then open flux is\nsiphoned from dusk to dawn (the lobe convection cell\nrotates clockwise) and arc motion will be from dawn to\ndusk, and vice versa for By < 0 nT. However, the exact\ndetails of the motion will depend on the location of the arc\nrelative to the lobe merging gap. If jByj > Bz, then the\nA01212 MILAN ET AL.: TRANSPOLAR ARC MOTION IN RESPONSE TO RECONNECTION\n9 of 11\nA01212\nmerging gap will be displaced far toward dawn or dusk, a\nsingle lobe convection cell exists, and open flux can be\ntransported easily from one side of an arc to the other.\nAlternatively, if jByj < Bz, then the merging gap will be\nplaced near noon, a twin-cell lobe pattern results, and it\nmight be expected that transpolar arcs will move toward\nthe noon-midnight meridian, irrespective of whether they\nare located in the dawn or dusk sectors, and irrespective\nof the orientation of By. In addition, transpolar arc motion\nin the two hemispheres might not appear conjugate\n(though magnetic mapping between the two hemispheres\nwill be) if the rates of lobe reconnection differ in the\nnorth and south.\n[36] 3. Tail reconnection in the presence of a transpolar\narc appears confined to dawnward or duskward of the arc.\nThis is true of reconnection bursts during substorm and\nnonsubstorm intervals.\n[37] 4. The motion of the transpolar arc allows the lobe\nreconnection rate to be estimated. The total lobe recon-\nnection rate, \u000320–40 kV, is consistent with the solar wind\nmotional electric field integrated along a merging gap with\nan effective length of \u00031 RE, close to the suggestion of\nMilan [2004a] and consistent with the measurement of\nChisham et al. [2004]. In the present case, with jByj < Bz,\nthis reconnection voltage is roughly equally partitioned\nbetween twin reverse convection cells. For jByj > Bz, a\nsingle lobe cell is expected, driven by the full reconnection\nvoltage. The effective merging gap length is probably a\nfunction of IMF Bx, and will usually differ between\nhemispheres. The observation by Phan et al. [2003] of\na high-latitude merging line of length \u00034 RE might\nimply that reconnection efficiency at high latitudes is close\nto 25%, similar to that found at low latitudes (see point 5\nbelow).\n[38] 5. In contrast, the effective length of the low-latitude\nmerging gap is \u00035 RE, \u000320–25% of the width of the\ndayside magnetosphere, as previously reported by, e.g.,\nHolzer and Slavin [1979], Reiff et al. [1981], Milan et al.\n[2004], and Milan [2004a, 2004b].\n[39] 6. The tail reconnection rate is estimated as \u000335 kV\nduring nonsubstorm bursts (TRINNIs), and as \u0003100 kV\nduring substorms, again similar to previous estimates [e.g.,\nMilan et al., 2003, 2004; Grocott et al., 2003, 2004; Milan,\n2004a, 2004b].\n[40] Further study is needed to confirm a link between\nTRINNI occurrence and transpolar arc formation. However,\nboth are expected to occur under northward IMF conditions,\nand the proposed formation mechanism predicts that arcs\nshould form at dawn for By < 0 and dusk for By > 0 (in the\nNorthern Hemisphere), consistent with previous reports\n[e.g., Kullen et al., 2002]. Arc motion is subsequently\ncontrolled by the rate of lobe reconnection, also a phenom-\nenon associated with northward IMF and controlled by the\nsense of By. The arc is not expected to disappear immedi-\nately at the next southward turning of the IMF, but the\nredistribution of flux caused by subsolar reconnection and\n(especially) substorm processes will cause a gradual reassi-\nmilation of the closed flux of the arc with the closed flux of\nthe plasma sheet. The present work has presented a frame-\nwork within which to understand arc formation and motion,\nwith specific predictions that can be tested by subsequent\nstudies.\n[41] Acknowledgments. SEM was supported by PPARC grant PPA\/\nN\/S\/2000\/00197; AG was supported by grant PPA\/G\/O\/2003\/00013. The\nCANOPUS instrument array, from which data are employed in this study, is\nconstructed, maintained, and operated by the Canadian Space Agency. The\nACE data used in this study were accessed through CDAWeb. The authors\nwould like to thank N. F. Ness at the Bartol Research Institute and D. J.\nMcComas of the Southwest Research Institute for use of the MAG and\nSWEPAM data, respectively. We would also like to acknowledge the\nprinciple investigators of the SuperDARN project for use of their data.\n[42] Lou-Chuang Lee thanks Harald Frey and Lie Zhu for their\nassistance in evaluating this paper.\nReferences\nChisham, G., M. P. Freeman, I. J. Coleman, M. Pinnock, M. R. Hairston,\nM. Lester, and G. Sofko (2004), Measuring the dayside reconnection rate\nduring an interval of due northward interplanetary magnetic field, Ann.\nGeophys., 22, 4243–4258.\nCowley, S. W. H. (1981), Magnetospheric and ionospheric flow and the\ninterplanetary magnetic field, in The Physical Basis of the Ionosphere in\nthe Solar-Terrestrial System, AGARD Conf. Proc., CP-295, 4, 1–14.\nCowley, S. W. H., and M. Lockwood (1992), Excitation and decay of solar\nwind-driven flows in the magnetosphere-ionosphere system, Ann. Geo-\nphys., 10, 103–115.\nFrank, L. A., J. D. Craven, J. L. Burch, and J. D. Winningham (1982), Polar\nviews of the Earth’s aurora with Dynamics Explorer, Geophys. Res. Lett.,\n9, 1001–1004.\nFrank, L. A., et al. (1986), The theta aurora, J. Geophys. Res., 91, 3177–\n3224.\nGreenwald, R. A., et al. (1995), DARN\/SuperDARN: A global view of\nthe dynamics of high-latitude convection, Space Sci. Rev., 71, 761–\n796.\nGrocott, A., S. W. H. Cowley, and J. B. Sigwarth (2003), Ionospheric flow\nduring extended intervals of northward but By-dominated IMF, Ann.\nGeophys., 21, 509–538.\nGrocott, A., S. V. Badman, S. W. H. Cowley, T. K. Yeoman, and P. J. Cripps\n(2004), The influence of IMF By on the nature of the nightside high-\nlatitude ionospheric flow during intervals of positive IMF Bz, Ann. Geo-\nphys., 22, 1755–1764.\nHolzer, R. E., and J. A. Slavin (1979), A correlative study of magnetic flux\ntransfer in the magnetosphere, J. Geophys. Res., 84, 2573–2578.\nHuang, C.-S., G. J. Sofko, A. V. Koustov, D. A. Andre, J. M. Ruohoniemi,\nR. A. Greenwald, and M. R. Hairston (2000), Evolution of ionospheric\nmulticell convection during northward interplanetary magnetic field with\njBz\/Byj > 1, J. Geophys. Res., 105, 27,095–27,107.\nHuang, C. Y., L. A. Frank, W. K. Petersen, D. J. Williams, W. Lennartsson,\nD. G. Mitchell, R. C. Elphic, and C. T. Russell (1987), Filamentary\nstructures in the magnetotail lobes, J. Geophys. Res., 92, 2349–2363.\nKullen, A., M. Brittnacher, J. A. Cumnock, and L. G. Blomberg (2002),\nSolar wind dependence of the occurrence and motion of polar auroral\narcs: A statistical study, J. Geophys. Res., 107(A11), 1362, doi:10.1029\/\n2002JA009245.\nMcComas, D. J., S. J. Bame, P. Barker, W. C. Feldman, and J. L. Philips\n(1998), Solar wind electron proton alpha monitor (SWEPAM) for the\nAdvanced Composition Explorer, Space Sci. Rev., 86, 563.\nMende, S. B., et al. (2000a), Far ultraviolet imaging from the IMAGE\nspacecraft. 1. System design, Space Sci. Rev., 91, 243–270.\nMende, S. B., et al. (2000b), Far ultraviolet imaging from the IMAGE\nspacecraft. 2. Wideband FUV imaging, Space Sci. Rev., 91, 271–285.\nMilan, S. E. (2004a), A simple model of the flux content of the distant\nmagnetotail, J. Geophys. Res., 109, A07210, doi:10.1029\/2004JA010397.\nMilan, S. E. (2004b), Dayside and nightside contributions to the cross polar\ncap potential: Placing an upper limit on a viscous-like interaction, Ann.\nGeophys., 22, 3771–3777.\nMilan, S. E., M. Lester, S. W. H. Cowley, and M. Brittnacher (2000),\nDayside convection and auroral morphology during an interval of north-\nward interplanetary magnetic field, Ann. Geophys., 18, 436–444.\nMilan, S. E., M. Lester, S. W. H. Cowley, K. Oksavik, M. Brittnacher, R. A.\nGreenwald, G. Sofko, and J.-P. Villain (2003), Variations in polar cap\narea during two substorm cycles, Ann. Geophys., 21, 1121–1140.\nMilan, S. E., S. W. H. Cowley, M. Lester, D. M. Wright, J. A. Slavin,\nM. Fillingim, C. W. Carlson, and H. J. Singer (2004), Response of the\nmagnetotail to changes in the open flux content of the magnetosphere,\nJ. Geophys. Res., 109, A04220, doi:10.1029\/2003JA010350.\nMishin, V. M., et al. (1997), A study of the CDAW 9C substorm of May 3,\n1986, using magnetogram inversion technique 2, and a substorm scenario\nwith two active phases, J. Geophys. Res., 102, 19,845–19,859.\nØstgaard, N., S. B. Mende, H. U. Frey, L. A. Frank, and J. B. Sigwarth\n(2003), Observations of non-conjugate theta aurora, Geophys. Res. Lett.,\n30(21), 2125, doi:10.1029\/2003GL017914.\nA01212 MILAN ET AL.: TRANSPOLAR ARC MOTION IN RESPONSE TO RECONNECTION\n10 of 11\nA01212\nPhan, T., et al. (2003), Simultaneous Cluster and IMAGE observations of\ncusp reconnection and auroral proton spot for northward IMF, Geophys.\nRes. Lett., 30(10), 1509, doi:10.1029\/2003GL016885.\nRairden, R. L., and S. B. Mende (1989), Properties of 6300-A˚ auroral\nemission at South Pole, J. Geophys. Res., 94, 1402–1416.\nReiff, P. H., and J. L. Burch (1985), IMF By-dependent plasma flow and\nBirkeland currents in the dayside magnetosphere: 2. A global model for\nnorthward and southward IMF, J. Geophys. Res., 90, 1595–1609.\nReiff, P. H., R. W. Spiro, and T. W. Hill (1981), Dependence of polar cap\npotential drop on interplanetary parameters, J. Geophys. Res., 86, 7639–\n7648.\nRuohoniemi, J. M., and K. B. Baker (1998), Large-scale imaging of high-\nlatitude convection with Super Dual Auroral Radar Network HF radar\nobservations, J. Geophys. Res., 103, 20,797–20,811.\nRussell, C. T. (1972), The configuration of the magnetosphere, in Critical\nProblems of Magnetospheric Physics, edited by E. R. Dyer, p. 1, Inter-\nUnion Comm. on Sol. Terr. Phys., Natl. Acad. of Sci., Washington, D. C.\nSamson, J. C., D. D. Wallis, T. J. Hughes, F. Creutzberg, J. M. Ruohoniemi,\nand R. S. Greenwald (1992), Substorm intensifications and field line\nresonances in the nightside magnetosphere, J. Geophys. Res., 97,\n8495–8518.\nSenior, C., J.-C. Cerisier, F. Rich, M. Lester, and G. K. Parks (2002), Strong\nsunward propagating flow bursts in the night sector during quiet solar\nwind conditions, SuperDARN and satellite observations, Ann. Geophys.,\n20, 771–779.\nSiscoe, G. L., and T. S. Huang (1985), Polar cap inflation and deflation,\nJ. Geophys. Res., 90, 543–547.\nSmith, C. W., J. L’Heureux, N. F. Ness, M. H. Acun˜a, L. F. Burlaga, and\nJ. Scheifele (1998), The ACE Magnetic Field Experiment, Space Sci.\nRev., 86, 613–632.\nTaylor, J. R., T. K. Yeoman, M. Lester, B. A. Emery, and D. J. Knipp\n(1996), Variations in the polar cap area during intervals of substorm\nactivity on 20–21 March 1990 deduced from AMIE convection maps,\nAnn. Geophys., 14, 879–887.\nValladares, C. E., H. C. Carlson, and K. Fukui (1994), Interplanetary mag-\nnetic field dependency of stable Sun-aligned polar cap arcs, J. Geophys.\nRes., 99, 6247–6272.\nZhu, L., R. W. Schunk, and J. J. Sojka (1997), Polar cap arcs: A review,\nJ. Atmos. Sol. Terr. Phys., 59, 1087–1126.\n\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\nA. Grocott, B. Hubert, and S. E. Milan, Department of Physics and\nAstronomy, University of Leicester, University Road, Leicester LE1 7RH,\nUK. (steve.milan@ion.le.ac.uk)\nA01212 MILAN ET AL.: TRANSPOLAR ARC MOTION IN RESPONSE TO RECONNECTION\n11 of 11\nA01212\n"}