{"doi":"10.1111\/1467-9299.00295","coreId":"92875","oai":"oai:eprints.lse.ac.uk:824","identifiers":["oai:eprints.lse.ac.uk:824","10.1111\/1467-9299.00295"],"title":"Contingent and non-contingent working in local government: contrasting psychological contracts","authors":["Coyle-Shapiro, Jacqueline A-M.","Kessler, Ian"],"enrichments":{"references":[{"id":17335231,"title":"A Guide to Econometrics.","authors":[],"date":"1980","doi":"10.1086\/411974","raw":"Kennedy, P. 1980.  A Guide to Econometrics.  Cambridge, MA: MIT Press.","cites":null},{"id":17335246,"title":"A meta-analytic review of attitudinal and dispositional predictors of organizational citizenship behavior.","authors":[],"date":"1995","doi":"10.1111\/j.1744-6570.1995.tb01781.x","raw":"Organ, D.W. and Ryan, K. 1995. A meta-analytic review of attitudinal and dispositional predictors of organizational citizenship behavior. Personnel Psychology 48, 775-802.","cites":null},{"id":17335228,"title":"A Return to Contract? Performance Related Pay in a Public Service’.","authors":[],"date":"1998","doi":"10.1177\/0950017098012001005","raw":"Heery, E. 1998. ‘ A Return to Contract? Performance Related Pay in a Public Service’.","cites":null},{"id":17335235,"title":"A review and meta-analysis of the antecedents, correlates, and consequences of organizational commitment.","authors":[],"date":"1990","doi":"10.1037\/\/0033-2909.108.2.171","raw":"Mathieu, J.E. and Zajac, D.M. 1990.  A review and meta-analysis of the antecedents, correlates, and consequences of organizational commitment.  Psychological Bulletin, 108, 171-194.","cites":null},{"id":17335222,"title":"Britain at Work. London: Routledge De","authors":[],"date":"1999","doi":"10.4324\/9780203279915","raw":"Cully, M. Woodland, S., O’Reilly,A. and Dix, G. 1999. Britain at Work. London: Routledge De Grip , A., Hoevenberg, and Willems, E. 1997. Atypical Employment in the European Union. International Labour Review 136(1), 49-71 Eberhardt, B.J. and Shani, A.B. 1984. The effects of full-time versus part-time employment status on attitudes toward specific organizational characteristics and overall job satisfaction. Academy of Management Journal 27, 893-900. 35Contingent workers and the psychological contract Escott, K. and Whitfield, D. 1995. The Gender Impact of CCT in Local Government, London: HMSO Eisenberger, R., Huntington, R., Hutchison, S. and Sowa, D. 1986. Perceived organizational support. Journal of Applied Psychology  71, 500-507.","cites":null},{"id":17335225,"title":"Career experiences, perceptions of employment practices, and psychological commitment to the organization.","authors":[],"date":"1989","doi":"10.1177\/001872678904201102","raw":"Gaertner, K.N. and Nollan, S.D. 1989. Career experiences, perceptions of employment practices, and psychological commitment to the organization.  Human Relations 42, 975-991.","cites":null},{"id":17335266,"title":"Commitment and employee behavior: comparison of affective commitment and continuance commitment with perceived organizational support.","authors":[],"date":"1993","doi":"10.1037\/\/0021-9010.78.5.774","raw":"Shore, L.M. and Wayne, S.J. 1993. Commitment and employee behavior: comparison of affective commitment and continuance commitment with perceived organizational support. Journal of Applied Psychology 78, 774-780.","cites":null},{"id":17335237,"title":"Commitment in the Workplace: Theory, Research and Application. Advanced topics in Organizational Behavior. Thousand Oaks,","authors":[],"date":"1997","doi":null,"raw":"Meyer, J.P. and Allen, N.J. 1997. Commitment in the Workplace: Theory, Research and Application.  Advanced topics in Organizational Behavior.  Thousand Oaks, CA: Sage.","cites":null},{"id":17335238,"title":"Commitment to organizations and occupations: Extension and test of a three-component conceptualization.","authors":[],"date":"1993","doi":"10.1037\/0021-9010.78.4.538","raw":"Meyer, J.P., Allen, N.J. and Smith, C.A. 1993.  Commitment to organizations and occupations: Extension and test of a three-component conceptualization.  Journal of Applied Psychology  78, 538-551.","cites":null},{"id":17335218,"title":"Contingent and alternative employment arrangements.","authors":[],"date":"1995","doi":null,"raw":"Bureau of Labor Statistics. 1995.  Contingent and alternative employment arrangements.","cites":null},{"id":17335219,"title":"D.C: US Department of Labor. 34Contingent workers and the psychological contract","authors":[],"date":"1980","doi":null,"raw":"(report No. 900). Washington, D.C: US Department of Labor. 34Contingent workers and the psychological contract Cook, J. and Wall, T. 1980. New work attitude measures of trust, organizational commitment and personal need non-fulfillment. Journal of Occupational Psychology 53, 39-52.","cites":null},{"id":17335270,"title":"Dealing with discrepant expectations: Response strategies and managerial effectiveness.","authors":[],"date":"1995","doi":"10.2307\/256842","raw":"Tsui, A.S., Ashford, S.J., St. Clair, L., and Xin, K.R. 1995.  Dealing with discrepant expectations: Response strategies and managerial effectiveness.  Academy of Management Journal 38, 1515-1543.","cites":null},{"id":17335253,"title":"Employability in the Finance Sector: Rhetoric v’s Reality’,","authors":[],"date":"1997","doi":"10.1111\/j.1748-8583.1997.tb00275.x","raw":"Rajan, A. 1997. ‘Employability in the Finance Sector: Rhetoric v’s Reality’, Human Resource Management Journal, 7(1), 67-78.","cites":null},{"id":17335229,"title":"Employee Relations in the Public Services. London: Routledge International Confederation of Temporary Work Businesses.","authors":[],"date":"1998","doi":null,"raw":"(Eds.) Employee Relations in the Public Services. London: Routledge International Confederation of Temporary Work Businesses. 1998.  Temporary Work Businesses in the Countries of the European Union.  Brussels: Belgium.","cites":null},{"id":17335243,"title":"Employee-organizational linkages.","authors":[],"date":"1982","doi":"10.1016\/b978-0-12-509370-5.50007-1","raw":"Mowday, R.T., Porter, L. and Steers, R.M. 1982.  Employee-organizational linkages. New York: Academic Press.","cites":null},{"id":17335217,"title":"Exchange and power in social life.","authors":[],"date":"1964","doi":"10.2307\/2574842","raw":"Blau, P. 1964. Exchange and power in social life. New York: Wiley.","cites":null},{"id":17335236,"title":"Fitting square pegs into round holes: mapping the domain of contingent work arrangements onto the psychological contract.","authors":[],"date":"1998","doi":"10.1002\/(sici)1099-1379(1998)19:1+<697::aid-job974>3.0.co;2-i","raw":"McLean Parks, J., D. Kidder and D. Gallagher 1998. Fitting square pegs into round holes: mapping the domain of contingent work arrangements onto the psychological contract. Journal of Organizational Behaviour 19, 697-730.","cites":null},{"id":17335239,"title":"Job attitudes among part-time and full-time employees.","authors":[],"date":"1979","doi":"10.1037\/\/0021-9010.64.4.380","raw":"Miller, H.E. and Terborg, J.R. 1979. Job attitudes among part-time and full-time employees.  Journal of Applied Psychology  64, 380-386. 38Contingent workers and the psychological contract Millward, L.J. and Brewerton, P. 1999.  Contractors and their psychological contract. British Journal of Management 10, 253-274.","cites":null},{"id":17335215,"title":"Manpower Strategies for a Flexible Organizations’, Personnel Management,","authors":[],"date":"1984","doi":null,"raw":"Atkinson, J. 1984. ‘Manpower Strategies for a Flexible Organizations’, Personnel Management, August, 28-31.","cites":null},{"id":17335269,"title":"Meeting trainees' expectations: The influence of training fulfilment on the development of commitment, self-efficacy, and motivation.","authors":[],"date":"1991","doi":"10.1037\/\/0021-9010.76.6.759","raw":"Tannenbaum, S. I., Mathieu, J. E., Salas, E. and Cannon-Bowers, J.A. 1991. Meeting trainees' expectations: The influence of training fulfilment on the development of commitment, self-efficacy, and motivation.  Journal of Applied Psychology 76, 759-769.","cites":null},{"id":17335211,"title":"Multiple Regression: Testing and Interpreting Interactions.","authors":[],"date":"1991","doi":"10.1177\/109821409301400208","raw":"Aiken, L.S. and West, S.G. 1991.  Multiple Regression: Testing and Interpreting Interactions.  Sage: Newbury Park, CA.","cites":null},{"id":17335227,"title":"Multivariate Data Analysis.","authors":[],"date":"2000","doi":null,"raw":"Guest, D. and Conway, N. 2000. The Psychological Contract in the Public Sector, London: CIPD 36Contingent workers and the psychological contract Hair, J.F., Anderson, R.E., Tatham, R.L. and  Black, W.C. 1992.  Multivariate Data Analysis. (3 rd ed.).  Macmillan: New York.","cites":null},{"id":17335260,"title":"Organizational behavior in a new organizational era. In","authors":[],"date":"1997","doi":"10.1146\/annurev.psych.48.1.515","raw":"Rousseau, D.M. 1997. Organizational behavior in a new organizational era.  In J.T. Spence, J.M. Darley and D.J. Foss (Eds.), Annual Review of Psychology (Vol 48), Palo Alto, CA. Pp. 515-546.","cites":null},{"id":17335249,"title":"Organizational citizenship behavior and the quantity and quality of group performance.","authors":[],"date":"1997","doi":"10.1037\/\/0021-9010.82.2.262","raw":"Podsakoff, P.M., Ahrene, M. and  MacKenzie, S.B. 1997.  Organizational citizenship behavior and the quantity and quality of group performance.  Journal of Applied Psychology 82, 262-270.","cites":null},{"id":17335272,"title":"Organizational citizenship behavior of contingent workers in Singapore.","authors":[],"date":"1998","doi":"10.2307\/256965","raw":"Van Dyne, L. and Ang, S. 1998.  Organizational citizenship behavior of contingent workers in Singapore.  Academy of Management Journal 47, 692-703.","cites":null},{"id":17335273,"title":"Organizational citizenship behavior: construct redefinition, measurement, and validation.","authors":[],"date":"1994","doi":"10.2307\/256600","raw":"Van Dyne, L., Graham, J.W. and Dienesch, R.M. 1994. Organizational citizenship behavior: construct redefinition, measurement, and validation.  Academy of Management Journal, 37, 765-802.","cites":null},{"id":17335245,"title":"Organizational Citizenship Behavior: The Good Soldier Syndrome.","authors":[],"date":"1988","doi":"10.2307\/2393071","raw":"Organ, D.W. 1988. Organizational Citizenship Behavior: The Good Soldier Syndrome. Lexington, MA: Lexington Books.","cites":null},{"id":17335250,"title":"Organizational citizenship behaviours and sales unit effectiveness.","authors":[],"date":"1992","doi":null,"raw":"Podsakoff, P.M. and MacKenzie, S.B. 1992. Organizational citizenship behaviours and sales unit effectiveness.  Journal of Marketing Research 31, 351-363.","cites":null},{"id":17335261,"title":"Organizational Psychology.","authors":[],"date":"1965","doi":"10.2307\/2090940","raw":"Schein, E. 1965. Organizational Psychology.  Englewood Cliffs, NJ: Prentice Hall.","cites":null},{"id":17335233,"title":"Outsourcing and the employee perspective.","authors":[],"date":"1999","doi":"10.1111\/j.1748-8583.1999.tb00193.x","raw":"Kessler, I., Coyle-Shapiro, J and Purcell, J. 1999.  Outsourcing and the employee perspective. Human Resource Management Journal 9(2), 5-19.","cites":null},{"id":17335223,"title":"Perceived organizational support and employee diligence, commitment and innovation.","authors":[],"date":"1990","doi":"10.1037\/\/0021-9010.75.1.51","raw":"Eisenberger, R., Fasolo, P. and Davis-LaMastro, V. 1990. Perceived organizational support and employee diligence, commitment and innovation. Journal of Applied Psychology  75, 1, 51-59.","cites":null},{"id":17335274,"title":"Perceived organizational support and leader-member exchange: a social exchange perspective.","authors":[],"date":"1997","doi":"10.2307\/257021","raw":"Wayne, S.J., Shore, L.M. and Liden, R.C. 1997. Perceived organizational support and leader-member exchange: a social exchange perspective. Academy of Management Journal, 40, 82-111.","cites":null},{"id":17335264,"title":"Perceived organizational support and organizational justice.","authors":[],"date":"1995","doi":"10.1037\/e518572013-311","raw":"Shore, L.M., and Shore, T.H. 1995. Perceived organizational support and organizational justice.  In Cropanzano, R.S. and Kacmar, K.M. (Eds.), Organizational Politics, Justice 42Contingent workers and the psychological contract and Support: Managing the Social Climate of the Workplace.  Westport, CT: Quorum Books.","cites":null},{"id":17335258,"title":"Psychological and implied contracts in organizations. Employee Responsibilities and Rights Journal 2, 121-139. 41Contingent workers and the psychological contract Rousseau,","authors":[],"date":"1989","doi":"10.1007\/bf01384942","raw":"Rousseau, D.M. 1989. Psychological and implied contracts in organizations. Employee Responsibilities and Rights Journal  2, 121-139. 41Contingent workers and the psychological contract Rousseau, D.M. 1990. New hire perceptions of their own and their employer’s obligations: A study of Psychological contracts.  Journal of Organizational Behavior 11, 389-400.","cites":null},{"id":17335255,"title":"Psychological contracts and OCB: the effect of unfulfilled obligations on civic virtue.","authors":[],"date":"1995","doi":"10.1002\/job.4030160309","raw":"Robinson, S.L. and Morrison, E.W. 1995. Psychological contracts and OCB: the effect of unfulfilled obligations on civic virtue. Journal of Organizational Behavior 16, 289-298.","cites":null},{"id":17335259,"title":"Psychological Contracts in Organizations. Thousand Oaks,","authors":[],"date":"1995","doi":"10.4135\/9781452231594","raw":"Rousseau, D.M. 1995. Psychological Contracts in Organizations. Thousand Oaks, CA: Sage.","cites":null},{"id":17335221,"title":"Reciprocity or “it’s my job”: Exploring organizationally directed citizenship behavior in a National Health Service Setting.","authors":[],"date":"1999","doi":"10.1111\/j.1467-6486.2004.00422.x","raw":"Coyle-Shapiro, J., Kessler, I. and Purcell, J. 1999.  Reciprocity or “it’s my job”: Exploring organizationally directed citizenship behavior in a National Health Service Setting. Academy of Management Conference, Chicago, August 1999.","cites":null},{"id":17335262,"title":"Social exchange in organizations: perceived organizational support, leader-member exchange, and employee reciprocity.","authors":[],"date":"1996","doi":"10.2139\/ssrn.2406773","raw":"Settoon, R.P., Bennett, N. and Liden, R.C. 1996. Social exchange in organizations: perceived organizational support, leader-member exchange, and employee reciprocity. Journal of Applied Psychology 81, 219-227.","cites":null},{"id":17335267,"title":"Temporary Workers in Great Britain, Labour Market Trends, Sept Spector,","authors":[],"date":"1997","doi":null,"raw":"Sly, F. and Stillwell, D. 1997. Temporary Workers in Great Britain, Labour Market Trends, Sept Spector, P.E. 1987. Method variance as an artifact in self-reported affect and perceptions at work: myth or significant problem.  Journal of Applied Psychology 72, 438-443.","cites":null},{"id":17335248,"title":"The antecedents of commitment to customer service: Evidence from the UK service context.","authors":[],"date":"1997","doi":"10.1080\/09585199700000041","raw":"Peccei, R. and  Rosenthal, P. 1997. The antecedents of commitment to customer service: Evidence from the UK service context. International Journal of Human Resource Management 8, 66-86.","cites":null},{"id":17335220,"title":"The consequences of the psychological contract: A large-scale survey.","authors":[],"date":"2000","doi":"10.1111\/1467-6486.00210","raw":"Coyle-Shapiro, J. and Kessler, I. 2000. The consequences of the psychological contract: A large-scale survey.  The Journal of Management Studies 37 (7), 904-930.","cites":null},{"id":17335252,"title":"The definition of contingent work. Monthly Labor Review 112, 9-16. 40Contingent workers and the psychological contract","authors":[],"date":"1989","doi":null,"raw":"Polivka, A.E. and Nardone, T. 1989.  The definition of contingent work.  Monthly Labor Review 112, 9-16. 40Contingent workers and the psychological contract Pond, S.B., Nacoste, R.W., Mohr, M.F. and Rodriguez, C.M. 1997.  The measurement of organizational citizenship behavior: Are we assuming too much?  Journal of Applied Social Psychology  27, 1527-1544.","cites":null},{"id":17335216,"title":"The functions of the executive.","authors":[],"date":"1938","doi":null,"raw":"Barnard, C.L. 1938. The functions of the executive.  Cambridge, MA: Harvard.","cites":null},{"id":17335271,"title":"The impact of psychological contract violations on exit, loyalty and neglect. Human Relations 52, 895-922. 43Contingent workers and the psychological contract","authors":[],"date":"1999","doi":"10.1177\/001872679905200703","raw":"Turnley, W.H. and Feldman, D.C. 1999. The impact of psychological contract violations on exit, loyalty and neglect. Human Relations  52, 895-922. 43Contingent workers and the psychological contract Turnley, W.H. and Feldman, D.C. 2000. Re-examining the effects of psychological contract violations: unmet expectations and job dissatisfaction as mediators. Journal of Organizational Behavior 21, 25-42.","cites":null},{"id":17335226,"title":"The norm of reciprocity.","authors":[],"date":"1960","doi":"10.2307\/2092623","raw":"Gouldner, A.W. 1960. The norm of reciprocity. American Sociological Review  25, 161-178.","cites":null},{"id":17335257,"title":"The origins and early development of the psychological contract construct. Paper presented at the annual meeting of the Academy of Management,","authors":[],"date":"1996","doi":"10.5465\/ambpp.1996.4980380","raw":"Roehling, M.V. 1996. The origins and early development of the psychological contract construct.  Paper presented at the annual meeting of the Academy of Management, Cincinnati.","cites":null},{"id":17335275,"title":"The Pay Review Body System: Its Development and Impact.","authors":[],"date":"2000","doi":"10.3828\/hsir.2000.9.3","raw":"White, G. 2000. The Pay Review Body System: Its Development and Impact. Historical Studies in Industrial Relations, 9, Spring, 71-100.","cites":null},{"id":17335213,"title":"The psychological contract: A concept in need of closer scrutiny?.","authors":[],"date":"1996","doi":"10.1080\/13594329608414876","raw":"Arnold, J. 1996. The psychological contract: A concept in need of closer scrutiny?. European Journal of Work and Organizational Psychology 5, 511-520.","cites":null},{"id":17335212,"title":"The role of perceived organizational support in the voluntary turnover process. Manuscript under review.","authors":[],"date":"2000","doi":null,"raw":"Allen, D.G., Shore, L.M. and Griffeth, R.W. 2000. The role of perceived organizational support in the voluntary turnover process.  Manuscript under review.","cites":null},{"id":17335230,"title":"The social psychology of organizations.","authors":[],"date":"1978","doi":"10.1093\/sf\/57.4.1413","raw":"Katz, D. and Kahn, R. 1978.  The social psychology of organizations.  Wiley and Sons, New York.","cites":null},{"id":17335276,"title":"The State: The Public Sector. In","authors":[],"date":"1995","doi":null,"raw":"Winchester, D and Bach, S. 1995. The State: The Public Sector. In P. Edwards (ed.) Industrial Relations. Oxford: Blackwell. 44Contingent workers and the psychological contract Zeytinoglu, I.U. and Norris, J. 1995.  Global diversity in employment relationships: A typology of flexible employment.  Paper presented at the 10 th World Congress of the International Industrial Relations Association, Washington D.C., June. Table 1. Sample composition Occupation Non-Contingent Fixed Term Temporary Teachers 1081  110  128 Firefighters ψ  137 3  1 Social workers  335  8  16 Engineers ψ  74   2  0 Other professional  493  19  20 Administrative\/Clerical 921  21  31 Technician 88  2  4 Manual\/Craft 194    9  14 Other 724    80  152 Total ψ Excluded in regression analysis Contingent workers and the psychological contract","cites":null},{"id":17335247,"title":"Towards an organizational behavior of contract laborers: Their psychological involvement and effects on employee co-workers.","authors":[],"date":"1993","doi":"10.2307\/256646","raw":"Pearce, J.L. 1993.  Towards an organizational behavior of contract laborers: Their psychological involvement and effects on employee co-workers.  Academy of Management Review 36, 1082-1096. 39Contingent workers and the psychological contract Peccei, R. & Guest, D. 1993. The dimensionality and stability of organizational commitment.  Centre for Economic Performance Discussion Paper No. 149.  The London School of Economics.","cites":null},{"id":17335251,"title":"Transformational leader behaviours and their effects on followers’ trust in leader, satisfaction, and organizational citizenship behaviours.","authors":[],"date":"1990","doi":"10.1016\/1048-9843(90)90009-7","raw":"Podsakoff, P.M., MacKenzie, S.B., Moorman, R.H. and Fetter, R. 1990. Transformational leader behaviours and their effects on followers’ trust in leader, satisfaction, and organizational citizenship behaviours. Leadership Quarterly  1, 107-142.","cites":null},{"id":17335242,"title":"Treating employees fairly and organizational citizenship behavior: Sorting out the effects of job satisfaction, organizational commitment, and procedural justice. Employee Responsibilities and Rights","authors":[],"date":"1993","doi":"10.1007\/bf01419445","raw":"Moorman, R.H., Niehoff, B.P. and Organ, D.W. 1993. Treating employees fairly and organizational citizenship behavior: Sorting out the effects of job satisfaction, organizational commitment, and procedural justice.  Employee Responsibilities and Rights Journal  6, 209-225.","cites":null},{"id":17335234,"title":"Trends, 2001.’Labour Market Spotlight’,109(1), 9 37Contingent workers and the psychological contract Liao-Troth,","authors":[],"date":"1999","doi":null,"raw":"Labour Market Trends, 2001.’Labour Market Spotlight’,109(1), 9 37Contingent workers and the psychological contract Liao-Troth, M.A. 1999.  The effects of psychological contract strength and violation on organizational commitment and organizational justice.  Academy of Management Conference, Chicago, August 1999.","cites":null},{"id":17335254,"title":"Trust and breach of the psychological contract.","authors":[],"date":"1996","doi":"10.2307\/2393868","raw":"Robinson, S.L. 1996. Trust and breach of the psychological contract. Administrative Science Quarterly 41, 574-599.","cites":null},{"id":17335214,"title":"Understanding organizational behavior.","authors":[],"date":"1960","doi":"10.2307\/2574311","raw":"Argyris, C. 1960.  Understanding organizational behavior.  Homewood, IL: Dorsey Press, Inc.","cites":null},{"id":17335256,"title":"Violating the psychological contract: not the exception but the norm.","authors":[],"date":"1994","doi":"10.1002\/job.4030150306","raw":"Robinson, S.L. and Rousseau, D.M. 1994. Violating the psychological contract: not the exception but the norm. Journal of Organizational Behavior 15, 245-259.","cites":null},{"id":17335224,"title":"What has been happening to pay in the public service sector of the British economy? Developments over the period 1970-92.","authors":[],"date":"1996","doi":"10.1111\/j.1467-8543.1996.tb00471.x","raw":"Elliot, R. and Duffus,  K. 1996. What has been happening to pay in the public service sector of the British economy? Developments over the period 1970-92. British Journal of Industrial Relations 34(1) 51-8.","cites":null},{"id":17335263,"title":"Who are employees’ social referents? Using a network perspective to determine referent others.","authors":[],"date":"1998","doi":"10.2307\/256906","raw":"Shah, P.P. 1998. Who are employees’ social referents?  Using a network perspective to determine referent others.  Academy of Management Journal 41, 249-268.","cites":null}],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2002","abstract":"Given that the contingent worker is likely to be a familiar presence in the public service workplace of the future, this paper explores the consequences of contingent work arrangements on the attitudes and behaviour of employees using the psychological contract as a framework for analysis. Drawing upon survey evidence from a sample of permanent, fixed term and temporary staff employed in a British local authority, our results suggest that contract status plays an important role in how individuals view the exchange relationship with their employer and how they respond to the inducements received from that relationship. Specifically, contingent employees are less committed to the organization and engage in organizational citizenship behaviour (OCB) to a lesser degree than their permanent counterparts. However, contrary to our hypothesis, the relationship between the inducements provided by the employer and OCB is stronger for contingent employees. Such findings have implications for the treatment of contingent and non-contingent employees in the public services","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/92875.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/824\/1\/Public_admin_80%281%29.pdf","pdfHashValue":"41001fd07349ec8ed05a3370e12c9286ffb60e83","publisher":"Blackwell Publishers","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:824<\/identifier><datestamp>\n      2010-10-01T08:44:05Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/824\/<\/dc:relation><dc:title>\n        Contingent and non-contingent working in local government: contrasting psychological contracts<\/dc:title><dc:creator>\n        Coyle-Shapiro, Jacqueline A-M.<\/dc:creator><dc:creator>\n        Kessler, Ian<\/dc:creator><dc:subject>\n        H Social Sciences (General)<\/dc:subject><dc:description>\n        Given that the contingent worker is likely to be a familiar presence in the public service workplace of the future, this paper explores the consequences of contingent work arrangements on the attitudes and behaviour of employees using the psychological contract as a framework for analysis. Drawing upon survey evidence from a sample of permanent, fixed term and temporary staff employed in a British local authority, our results suggest that contract status plays an important role in how individuals view the exchange relationship with their employer and how they respond to the inducements received from that relationship. Specifically, contingent employees are less committed to the organization and engage in organizational citizenship behaviour (OCB) to a lesser degree than their permanent counterparts. However, contrary to our hypothesis, the relationship between the inducements provided by the employer and OCB is stronger for contingent employees. Such findings have implications for the treatment of contingent and non-contingent employees in the public services.<\/dc:description><dc:publisher>\n        Blackwell Publishers<\/dc:publisher><dc:date>\n        2002<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/824\/1\/Public_admin_80%281%29.pdf<\/dc:identifier><dc:identifier>\n          Coyle-Shapiro, Jacqueline A-M. and Kessler, Ian  (2002) Contingent and non-contingent working in local government: contrasting psychological contracts.  Public Administration, 80 (1).  pp. 77-101.  ISSN 0033-3298     <\/dc:identifier><dc:relation>\n        http:\/\/www.wiley.com\/bw\/journal.asp?ref=0033-3298<\/dc:relation><dc:relation>\n        10.1111\/1467-9299.00295<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/824\/","http:\/\/www.wiley.com\/bw\/journal.asp?ref=0033-3298","10.1111\/1467-9299.00295"],"year":2002,"topics":["H Social Sciences (General)"],"subject":["Article","PeerReviewed"],"fullText":""}