{"doi":"10.4113\/jom.2008.1020","coreId":"64855","oai":"oai:cadair.aber.ac.uk:2160\/6784","identifiers":["oai:cadair.aber.ac.uk:2160\/6784","10.4113\/jom.2008.1020"],"title":"The glacial map of southern South America","authors":["Jansson, Krister N.","Glasser, Neil F."],"enrichments":{"references":[{"id":43347269,"title":"40Ar\/39Ar and K-Ar chronology of Pleistocene glaciations in Patagonia,","authors":[],"date":"2004","doi":"10.1130\/b25177.1","raw":"SINGER, B. S., ACKERT, R. P. and GUILLOU, H. (2004) 40Ar\/39Ar and K-Ar chronology of Pleistocene glaciations in Patagonia, Geological Society of America Bulletin, 116, 434–450.","cites":null},{"id":43347274,"title":"A 2.5 kyr luminescence date for a terminal moraine in the Leones valley, southern Chile,","authors":[],"date":"2005","doi":null,"raw":"WINCHESTER, V., HARRISON, S. and BAILEY, R. (2005) A 2.5 kyr luminescence date for a terminal moraine in the Leones valley, southern Chile, Journal of Glaciology, 51, 186–188.","cites":null},{"id":43347187,"title":"A glacial stage spanning the Antarctic Cold Reversal in Torres del Paine (51◦S), Chile, based on preliminary cosmogenic exposure ages,","authors":[],"date":"2005","doi":"10.1111\/j.0435-3676.2005.00266.x","raw":"FOGWILL, C. J. and KUBIK, P. W. (2005) A glacial stage spanning the Antarctic Cold Reversal in Torres del Paine (51◦S), Chile, based on preliminary cosmogenic exposure ages, Geografiska Annaler, 87A, 403–408.","cites":null},{"id":43347219,"title":"A modelling reconstruction of the late glacial maximum ice sheet and its deglaciation in the vicinity of the Northern Patagonian Icefield,","authors":[],"date":"2005","doi":"10.1111\/j.0435-3676.2005.00264.x","raw":"HUBBARD, A., HEIN, A. S., KAPLAN, M. R., HULTON, N. R. J. and GLASSER, N. F. (2005) A modelling reconstruction of the late glacial maximum ice sheet and its deglaciation in the vicinity of the Northern Patagonian Icefield, South America, Geografiska Annaler, 87A, 375–391.","cites":null},{"id":43347178,"title":"Asymmetrical drumlins in","authors":[],"date":"1989","doi":"10.1016\/0037-0738(89)90127-9","raw":"CLAPPERTON, C. M. (1989) Asymmetrical drumlins in Patagonia, Chile, Sedimentary Geology, 62, 387–398.","cites":null},{"id":43347260,"title":"Chronology and dynamics of deglaciation along and near","authors":[],"date":"1992","doi":null,"raw":"PORTER, S. C., CLAPPERTON, C. M. and SUGDEN, D. E. (1992) Chronology and dynamics of deglaciation along and near the Strait of Magellan, southernmost South America, Sveriges Geologiska Underso¨kning, Series C 81, 233–239.","cites":null},{"id":43347265,"title":"Chronology of the Late Cenozoic Patagonian glaciations and their correlation with biostratigraphic units of the Pampean region (Argentina),","authors":[],"date":"2005","doi":"10.1016\/j.jsames.2005.07.004","raw":"RABASSA, J., CORONATO, A. M. and SALEMME, M. (2005) Chronology of the Late Cenozoic Patagonian glaciations and their correlation with biostratigraphic units of the Pampean region (Argentina), Journal of South American Earth Sciences, 20, 81–103.","cites":null},{"id":43347204,"title":"Climate and chronology of Antarctica and adjacent South America over the past 30,000 yr,","authors":[],"date":"1989","doi":"10.1016\/0031-0182(89)90101-6","raw":"HEUSSER, C. (1989a) Climate and chronology of Antarctica and adjacent South America over the past 30,000 yr, Palaeogeography, Palaeoclimatology, Palaeoecology, 76, 31–37.","cites":null},{"id":43347239,"title":"Climatic inferences from glacial and palaeoecological evidence at the last glacial termination, southern South America,","authors":[],"date":"2000","doi":"10.1002\/1099-1417(200005)15:4<409::aid-jqs539>3.0.co;2-#","raw":"MCCULLOCH, R. D., BENTLEY, M. J., PURVES, R. S., SUGDEN, D. E., HULTON, N. R. J. and CLAPPERTON, C. M. (2000) Climatic inferences from glacial and palaeoecological evidence at the last glacial termination, southern South America, Journal of Quaternary Science, 15, 409–417.","cites":null},{"id":43347218,"title":"Cold climatic episode of Younger Dryas age in Tierra del Fuego,","authors":[],"date":"1987","doi":"10.1038\/328609a0","raw":"HEUSSER, C. and RABASSA, J. (1987) Cold climatic episode of Younger Dryas age in Tierra del Fuego, Nature, 328, 609–611.","cites":null},{"id":43347223,"title":"Cosmogenic nuclide chronology of millenial-scale glacial advances during","authors":[],"date":"2004","doi":"10.1130\/b25178.1","raw":"KAPLAN, M. R., ACKERT, R. P., SINGER, B. S., DOUGLASS, D. C. and KURZ, M. D. (2004) Cosmogenic nuclide chronology of millenial-scale glacial advances during O-isotope Stage 2 in Patagonia, Bulletin of the Geological Society of America, 116, 308–321.","cites":null},{"id":43347227,"title":"Cosmogenic nuclide chronology of pre-last glacial maximum moraines at Lago Buenos Aire, 46◦S,","authors":[],"date":"2005","doi":"10.1016\/j.yqres.2004.12.003","raw":"KAPLAN, M. R., DOUGLASS, D. C., SINGER, B. S., ACKERT, R. P. and CAFFEE, M. W. (2005) Cosmogenic nuclide chronology of pre-last glacial maximum moraines at Lago Buenos Aire, 46◦S, Argentina, Quaternary Research, 63, 301–315.","cites":null},{"id":43347224,"title":"Cosmogenic nuclide measurements in southernmost South America and implications for landscape change,","authors":[],"date":"2007","doi":"10.1016\/j.geomorph.2006.10.005","raw":"KAPLAN, M. R., CORONATO, A. M., HULTON, N. R. J., RABASSA, J. O., KUBIK, P. W. and FREEMAN, S. P. H. T. (2007) Cosmogenic nuclide measurements in southernmost South America and implications for landscape change, Geomorphology, 87, 284–301.","cites":null},{"id":43347185,"title":"Cosmogenic nuclide surface exposure dating of boulders on last-glacial and late-glacial moraines, Lago Buenos Aires, Argentina: Interpretative strategies and paleoclimate implications,","authors":[],"date":"2006","doi":"10.1016\/j.quageo.2006.06.001","raw":"DOUGLASS, D. C., SINGER, B. S., KAPLAN, M. R., MICKELSON, D. M. and CAFFEE, M. W. (2006) Cosmogenic nuclide surface exposure dating of boulders on last-glacial and late-glacial moraines, Lago Buenos Aires, Argentina: Interpretative strategies and paleoclimate implications, Quaternary Geochronology, 1, 43–58.","cites":null},{"id":43347213,"title":"Deglacial palaeoclimate of the American sector of the Southern Ocean: Late Glacial-Holocene records from the latitude of Canal Beagle (55◦S), Argentine Tierra del Fuego,","authors":[],"date":"1998","doi":"10.1016\/s0031-0182(98)00053-4","raw":"HEUSSER, C. (1998) Deglacial palaeoclimate of the American sector of the Southern Ocean: Late Glacial-Holocene records from the latitude of Canal Beagle (55◦S), Argentine Tierra del Fuego, Palaeogeography, Palaeoclimatology, Palaeoecology, 141, 277–301.","cites":null},{"id":43347272,"title":"Deglaciation of the eastern flank of the North Patagonian Icefield and associated continental-scale lake diversions,","authors":[],"date":"2005","doi":"10.1111\/j.0435-3676.2005.00263.x","raw":"TURNER, K. J., FOGWILL, C. J., MCCULLOCH, R. D. and SUGDEN, D. E. (2005) Deglaciation of the eastern flank of the North Patagonian Icefield and associated continental-scale lake diversions, Geografiska Annaler, 87A, 363–374.","cites":null},{"id":43347228,"title":"East-west balance of the Quaternary ice caps in Patagonia and Scandinavia,","authors":[],"date":"1948","doi":null,"raw":"LJUNGNER, E. (1948) East-west balance of the Quaternary ice caps in Patagonia and Scandinavia, Bulletin of the Geological Institute, University of Uppsala, 33, 12–96.","cites":null},{"id":43347196,"title":"Evidence from the Rio Bayo valley on the extent of the North Patagonian Icefield during the Late Pleistocene-Holocene transition,","authors":[],"date":"2006","doi":"10.1016\/j.yqres.2005.09.002","raw":"GLASSER, N. F., HARRISON, S., IVY-OCHS, S., DULLER, G. A. T. and KUBIK, P. (2006) Evidence from the Rio Bayo valley on the extent of the North Patagonian Icefield during the Late Pleistocene-Holocene transition, Quaternary Research, 65, 70–77.","cites":null},{"id":43347184,"title":"Evidence of early Holocene glacial advances in southern South America from cosmogenic surface-exposure dating,","authors":[],"date":"2005","doi":"10.1130\/g21144.1","raw":"DOUGLASS, D. C., SINGER, B. S., KAPLAN, M. R., ACKERT, R. P., MICKELSON, D. M. and CAFFEE, M. W. (2005) Evidence of early Holocene glacial advances in southern South America from cosmogenic surface-exposure dating, Geology, 33, 237–240.","cites":null},{"id":43347197,"title":"Fast-flowing outlet glaciers of the Last Glacial Maximum Patagonian Icefield,","authors":[],"date":"2005","doi":"10.1016\/j.yqres.2004.11.002","raw":"GLASSER, N. F. and JANSSON, K. N. (2005) Fast-flowing outlet glaciers of the Last Glacial Maximum Patagonian Icefield, Quaternary Research, 63, 206–211.","cites":null},{"id":43347273,"title":"Fluctuations of outlet and valley glaciers in the Southern Andes (Argentina) during the past 13,000 years,","authors":[],"date":"1999","doi":"10.1006\/qres.1999.2043","raw":"WENZENS, G. (1999) Fluctuations of outlet and valley glaciers in the Southern Andes (Argentina) during the past 13,000 years, Quaternary Research, 51, 238–247.","cites":null},{"id":43347235,"title":"Fluctuations of the Southern Patagonian Icefield during the last glaciation and the Holocene,","authors":[],"date":"1995","doi":"10.1002\/jqs.3390100302","raw":"MARDEN, C. J. and CLAPPERTON, C. M. (1995) Fluctuations of the Southern Patagonian Icefield during the last glaciation and the Holocene, Journal of Quaternary Science, 10, 197–209.","cites":null},{"id":43347200,"title":"Geomorphological evidence for variations of the North Patagonian Icefield during the Holocene,","authors":[],"date":"2005","doi":"10.1016\/j.geomorph.2005.02.003","raw":"GLASSER, N. F., JANSSON, K. N., HARRISON, S. and RIVERA, A. (2005) Geomorphological evidence for variations of the North Patagonian Icefield during the Holocene, Geomorphology, 71, 263–277.","cites":null},{"id":43347183,"title":"Geomorphology, stratigraphy and radiocarbon chronology of Llanquihue drift in the area of the Southern Lake District, Seno Reloncav and Isla de Chiloe´, Chile, Geografiska Annaler,","authors":[],"date":"1999","doi":"10.1111\/1468-0459.00057","raw":"DENTON, G., LOWELL, T., HEUSSER, C., SCHLU¨CHTER, C., ANDERSEN, B., HEUSSER, L., MORENO, P. and MARCHANT, D. R. (1999) Geomorphology, stratigraphy and radiocarbon chronology of Llanquihue drift in the area of the Southern Lake District, Seno Reloncav and Isla de Chiloe´, Chile, Geografiska Annaler, 81A, 167–229.","cites":null},{"id":43347240,"title":"Glacial Geology of Southernmost Patagonia, the Strait of Magellan and northern Tierra del Fuego, unpublished PhD Thesis,","authors":[],"date":"1992","doi":null,"raw":"MEGLIOLI, A. (1992) Glacial Geology of Southernmost Patagonia, the Strait of Magellan and northern Tierra del Fuego, unpublished PhD Thesis, Lehigh University, Bethlehem, USA.","cites":null},{"id":43347170,"title":"Glacial geomorphologic maps of Llanquihue drift in the area of the southern Lake District, Chile, Geografiska Annaler,","authors":[],"date":"1999","doi":"10.1111\/1468-0459.00056","raw":"ANDERSEN, B. G., DENTON, G. H. and LOWELL, T. V. (1999) Glacial geomorphologic maps of Llanquihue drift in the area of the southern Lake District, Chile, Geografiska Annaler, 81A, 155–166.","cites":null},{"id":43347243,"title":"Glaciation in Southern Argentina more than two million years ago,","authors":[],"date":"1969","doi":"10.1126\/science.164.3881.823","raw":"MERCER, J. H. (1969) Glaciation in Southern Argentina more than two million years ago, Science, 164, 823–825.","cites":null},{"id":43347182,"title":"Glaciations in Argentine Patagonia, southern South America,","authors":[],"date":"2004","doi":"10.1016\/s1571-0866(04)80111-8","raw":"CORONATO, A. M., MARTINEZ, O. and RABASSA, J. (2004) Glaciations in Argentine Patagonia, southern South America, In Ehlers, J. and Gibbard, P. L., (eds.) Pleistocene Glaciations: Extent and Chronology, INQUA Working Group 5, Elsevier, Amsterdam, pp. 49–67.","cites":null},{"id":43347221,"title":"Glacier modelling and the climate of Patagonia during the last glacial maximum,","authors":[],"date":"1994","doi":"10.1006\/qres.1994.1049","raw":"HULTON, N. R. J., SUGDEN, D. E., PAYNE, A. J. and CLAPPERTON, C. M. (1994) Glacier modelling and the climate of Patagonia during the last glacial maximum, Quaternary Research, 42, 1–19.","cites":null},{"id":43347241,"title":"Glacier variations in Southern Patagonia,","authors":[],"date":"1965","doi":"10.2307\/213136","raw":"MERCER, J. H. (1965) Glacier variations in Southern Patagonia, Geographical Review, 55, 390–413.","cites":null},{"id":43347171,"title":"Holocene glacial chronology in Patagonia: Tyndall and Upsala Glaciers,","authors":[],"date":"1995","doi":"10.2307\/1552024","raw":"ANIYA, M. (1995) Holocene glacial chronology in Patagonia: Tyndall and Upsala Glaciers, Arctic, Antarctic and Alpine Research, 27, 311–322.","cites":null},{"id":43347217,"title":"Ice Age Southern Andes. A chronicle of palaeocological events,","authors":[],"date":"2003","doi":"10.1016\/s1571-0866(03)80001-5","raw":"HEUSSER, C. (2003) Ice Age Southern Andes. A chronicle of palaeocological events, In Rose, J., (ed.) Developments in Quaternary Science, 3, Elsevier, Amsterdam, p. 240.","cites":null},{"id":43347210,"title":"Ice age vegetation and climate of subtropical","authors":[],"date":"1990","doi":"10.1016\/0031-0182(90)90124-p","raw":"HEUSSER, C. (1990) Ice age vegetation and climate of subtropical Chile, Palaeogeography, Palaeoclimatology, Palaeoecology, 80, 107–127.","cites":null},{"id":43347268,"title":"Ice elevation and areal changes of glaciers from the Northern Patagonia Icefield, Chile,","authors":[],"date":"2007","doi":"10.1016\/j.gloplacha.2006.11.037","raw":"RIVERA, A., BENHAM, T., CASASSA, G., BAMBER, J. and DOWDESWELL, J. A. (2007) Ice elevation and areal changes of glaciers from the Northern Patagonia Icefield, Chile, Global and Planetary Change, 59 (1-4), 126–137.","cites":null},{"id":43347177,"title":"Las glaciaciones cuaternarios en la Patagonia y Tierra del Fuego,","authors":[],"date":"1932","doi":"10.2307\/519583","raw":"CALDENIUS, C. C. (1932) Las glaciaciones cuaternarios en la Patagonia y Tierra del Fuego, Geografiska Annaler, 14, 1–164 (English summary, p. 144–157).","cites":null},{"id":43347206,"title":"Late Quaternary vegetation and climate of southern Tierra del Fuego,","authors":[],"date":"1989","doi":"10.1016\/0033-5894(89)90047-1","raw":"HEUSSER, C. (1989b) Late Quaternary vegetation and climate of southern Tierra del Fuego, Quaternary Research, 31, 396–406.","cites":null},{"id":43347267,"title":"Late-Glacial and Holocene of Argentine Tierra del Fuego,","authors":[],"date":"1990","doi":"10.1016\/s0031-0182(98)00053-4","raw":"RABASSA, J., HEUSSER, C. and RUTTER, N. (1990) Late-Glacial and Holocene of Argentine Tierra del Fuego, Quaternary of South America and Antarctic Peninsula, 7, 327–351.","cites":null},{"id":43347230,"title":"Lateglacial and Holocene variations of the Grey Glacier, an outlet of the South Patagonian Icefield,","authors":[],"date":"1993","doi":"10.1080\/00369229318736873","raw":"MARDEN, C. J. (1993) Lateglacial and Holocene variations of the Grey Glacier, an outlet of the South Patagonian Icefield, Scottish Geographical Magazine, 109, 27–31.","cites":null},{"id":43347256,"title":"Magnetostratigraphy of the Patagonian moraine sequence at Lago Buenos Aires,","authors":[],"date":"1989","doi":"10.1016\/0895-9811(89)90016-3","raw":"MO¨RNER, N. A. and SYLWAN, C. (1989) Magnetostratigraphy of the Patagonian moraine sequence at Lago Buenos Aires, Journal of South American Earth Sciences, 2, 385–389.","cites":null},{"id":43347271,"title":"Modelling the inception of the Patagonian ice sheet,","authors":[],"date":"2002","doi":"10.1016\/s1040-6182(02)00027-7","raw":"SUGDEN, D. E., HULTON, N. R. J. and PURVES, R. S. (2002) Modelling the inception of the Patagonian ice sheet, Quaternary International, 95-96, 55–64.","cites":null},{"id":43347236,"title":"Paleoenvironments and paleoclimates in Tierra del Fuego and southernmost Patagonia,","authors":[],"date":"1993","doi":"10.1016\/0031-0182(93)90005-4","raw":"MARKGRAF, V. (1993) Paleoenvironments and paleoclimates in Tierra del Fuego and southernmost Patagonia, South America, Palaeogeography, Palaeoclimatology, Palaeoecology, 102, 53–68.","cites":null},{"id":43347258,"title":"Pleistocene glaciation in the southern Lake District of Chile,","authors":[],"date":"1981","doi":"10.1016\/0033-5894(81)90013-2","raw":"PORTER, S. C. (1981) Pleistocene glaciation in the southern Lake District of Chile, Quaternary Research, 16, 263–292.","cites":null},{"id":43347173,"title":"Pleistocene glacitectonic landforms and sediments around central Magellan Strait, southernmost Chile: evidence for fast outlet glaciers with cold-based margins,","authors":[],"date":"2000","doi":"10.1016\/s0277-3791(99)00012-8","raw":"BENN, D. and CLAPPERTON, C. M. (2000) Pleistocene glacitectonic landforms and sediments around central Magellan Strait, southernmost Chile: evidence for fast outlet glaciers with cold-based margins, Quaternary Science Reviews, 19, 591–612.","cites":null},{"id":43347202,"title":"Precise radiocarbon dating of Late-Glacial cooling in mid-latitude","authors":[],"date":"2003","doi":"10.1016\/s0033-5894(02)00017-0","raw":"HAJDAS, I., BONANI, G., MORENO, P. and ARIZTEGUI, D. (2003) Precise radiocarbon dating of Late-Glacial cooling in mid-latitude South America, Quaternary Research, 59, 70–78.","cites":null},{"id":43347270,"title":"Problems of bias in mapping linear landforms from satellite imagery,","authors":[],"date":"2007","doi":"10.1016\/j.jag.2006.07.002","raw":"SMITH, M. J. and WISE, S. M. (2007) Problems of bias in mapping linear landforms from satellite imagery, International Journal of Applied Earth Observation and Geoinformation, 9, 65–78.","cites":null},{"id":43347262,"title":"Quaternary of Tierra del Fuego, Southernmost South America: an updated review,","authors":[],"date":"2000","doi":"10.1016\/s1040-6182(00)00046-x","raw":"RABASSA, J., CORONATO, A. M., BUJALESKY, G., ROIG JUNENT, F., BORROMEI, A. and QUATROCCHIO, M. (2000) Quaternary of Tierra del Fuego, Southernmost South America: an updated review, Quaternary International, 68-71, 217–240.","cites":null},{"id":43347172,"title":"Recent glacier variations of the Hielos Patagonicos, South America, and their contribution to sea-level change,","authors":[],"date":"1999","doi":"10.2307\/1552604","raw":"ANIYA, M. (1999) Recent glacier variations of the Hielos Patagonicos, South America, and their contribution to sea-level change, Arctic, Antarctic and Alpine Research, 31, 165–173.","cites":null},{"id":43347180,"title":"Reconstructing the evolutionary dynamics of former ice sheets using multi-temporal evidence, remote sensing and GIS,","authors":[],"date":"1997","doi":"10.1016\/s0277-3791(97)00037-1","raw":"CLARK, C. D. (1997) Reconstructing the evolutionary dynamics of former ice sheets using multi-temporal evidence, remote sensing and GIS, Quaternary Science Reviews, 16, 1067–1092.","cites":null},{"id":43347175,"title":"Relative and radiocarbon chronology of two former glaciers in the Chilean Lake District,","authors":[],"date":"1997","doi":"10.1002\/(sici)1099-1417(199701\/02)12:1<25::aid-jqs289>3.0.co;2-a","raw":"BENTLEY, M. (1997) Relative and radiocarbon chronology of two former glaciers in the Chilean Lake District, Journal of Quaternary Science, 12, 25–33.","cites":null},{"id":43347237,"title":"Response of chironomids to Late Quaternary environmental change in the Taitao Peninsula, southern Chile,","authors":[],"date":"2002","doi":"10.1002\/jqs.671","raw":"MASSAFFERO, J. and BROOKS, S. J. (2002) Response of chironomids to Late Quaternary environmental change in the Taitao Peninsula, southern Chile, Journal of Quaternary Science, 17, 101–111.","cites":null},{"id":43347208,"title":"Southern westerlies during the last glacial maximum,","authors":[],"date":"1989","doi":"10.1016\/0033-5894(89)90049-5","raw":"HEUSSER, C. (1989c) Southern westerlies during the last glacial maximum, Quaternary Research, 31, 423–425.","cites":null},{"id":43347238,"title":"The dynamics of chironomid assemblages and vegetation during the Late Quaternary at Laguna Facil, Chonos Archipelago,","authors":[],"date":"2005","doi":"10.1016\/j.quascirev.2005.03.010","raw":"MASSAFFERO, J., BROOKS, S. J. and HABERLE, S. G. (2005) The dynamics of chironomid assemblages and vegetation during the Late Quaternary at Laguna Facil, Chonos Archipelago, southern Chile, Quaternary Science Reviews, 24, 2510–2522.","cites":null},{"id":43347176,"title":"The landforms and pattern of deglaciation in","authors":[],"date":"2005","doi":"10.1111\/j.0435-3676.2005.00261.x","raw":"BENTLEY, M., SUGDEN, D., HULTON, N. and MCCULLOCH, R. (2005) The landforms and pattern of deglaciation in the Strait of Magellan and Baha Intil, southernmost South America, Geografiska Annaler, 87A, 313–334.","cites":null},{"id":43347220,"title":"The Last Glacial Maximum and deglaciation in southern","authors":[],"date":"2002","doi":"10.1016\/s0277-3791(01)00103-2","raw":"HULTON, N. R. J., PURVES, R. S., MCCULLOCH, R. D., SUGDEN, D. E. and BENTLEY, M. J. (2002) The Last Glacial Maximum and deglaciation in southern South America, Quaternary Science Reviews, 21, 233–241.","cites":null},{"id":43347174,"title":"The Last Glacial-Holocene transition in","authors":[],"date":"2000","doi":"10.1126\/science.290.5490.325","raw":"BENNETT, K. D., HABERLE, S. G. and LUMLEY, S. H. (2000) The Last Glacial-Holocene transition in Southern Chile, Science, 290, 325–328.","cites":null},{"id":43347179,"title":"The Last Glaciation in Central Magellan Strait, Southernmost Chile,","authors":[],"date":"1995","doi":"10.1006\/qres.1995.1058","raw":"CLAPPERTON, C. M., SUGDEN, D., KAUFMAN, D. S. and MCCULLOCH, R. D. (1995) The Last Glaciation in Central Magellan Strait, Southernmost Chile, Quaternary Research, 44, 133–148.","cites":null},{"id":43347181,"title":"The last Pleistocene Glaciation in tributary valleys","authors":[],"date":"2008","doi":null,"raw":"Journal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N. CORONATO, A. M. (1995) The last Pleistocene Glaciation in tributary valleys of the Beagle Channel, Southernmost South America, Quaternary of South America and Antarctic Peninsula, 9, 153–171.","cites":null},{"id":43347222,"title":"Using Landsat 7 ETM+ imagery and Digital Terrain Models for mapping glacial lineaments on former ice sheet beds,","authors":[],"date":"2005","doi":"10.1080\/01431160500106900","raw":"JANSSON, K. N. and GLASSER, N. F. (2005) Using Landsat 7 ETM+ imagery and Digital Terrain Models for mapping glacial lineaments on former ice sheet beds, International Journal of Remote Sensing, 26, 3931–3941.","cites":null},{"id":43347242,"title":"Variations of some Patagonian glaciers since the Late-Glacial,","authors":[],"date":"1968","doi":"10.2475\/ajs.266.2.91","raw":"MERCER, J. H. (1968) Variations of some Patagonian glaciers since the Late-Glacial, American Journal of Science, 266, 91–109.","cites":null},{"id":43347254,"title":"Vegetation and climate near lago Llanquihue in the Chilean lake District between 20,200 and 9,500 14C yr BP,","authors":[],"date":"1997","doi":"10.1002\/(sici)1099-1417(199711\/12)12:6<485::aid-jqs330>3.3.co;2-w","raw":"MORENO, P. (1997) Vegetation and climate near lago Llanquihue in the Chilean lake District between 20,200 and 9,500 14C yr BP, Journal of Quaternary Science, 12, 485–500.","cites":null},{"id":43347186,"title":"Water balance in the Patagonian Icefield,","authors":[],"date":"1992","doi":null,"raw":"ESCOBAR, F., VIDAL, F., GARI´N C. and NARUSE, R. (1992) Water balance in the Patagonian Icefield, In Naruse, R. and Aniya, M., (eds.) Glaciological Researches in Patagonia, Japanese Society of Snow and Ice, pp. 109–119.","cites":null}],"documentType":{"type":1}},"contributors":["Department of Geography and Earth Sciences","Centre for Glaciology"],"datePublished":"2008-09-01","abstract":"Glasser, N. F., Jansson, K. N. (2008). Surveillance of adenoviruses and noroviruses in European recreational waters. Journal of Maps, p. 175-196. Sponsorship: Leverhulme Trust Research FellowshipThis paper describes The Glacial Map of southern South America. This is a new map of the glacial geomorphology of southern South America between latitudes 38 S and 56 S, approximately the area covered by the former Patagonian Ice Sheets. The map was compiled from interpretation of remotely sensed images (Landsat 7 ETM+, pan-sharpened Landsat 7 and ASTER scenes). The mapped geomorphological features include terminal moraines, glacial lineations, ribbed moraine, glacier debris stripes, trimlines, empty cirques, plateau edge, volcanoes, meltwater channels, deltas, glacial lake shorelines, alluvial fans, sandar, and glacial lake outburst ood tracks. The map also indicates the current extent of major ice elds and glaciers in the area, as well as other topographic features such as lakes, rivers, shorelines, deltas, plateau surfaces and volcanoes. We brie y describe the most commonly occurring glacial landforms and provide an overview of their distribution within the mapped area.Peer reviewe","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/64855.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/2160\/6784","pdfHashValue":"834b7aa2c60569ddfca52f5cc025637ff8f391a4","publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:cadair.aber.ac.uk:2160\/6784<\/identifier><datestamp>\n                2018-01-21T19:43:10Z<\/datestamp><setSpec>\n                com_2160_7<\/setSpec><setSpec>\n                com_2160_7908<\/setSpec><setSpec>\n                col_2160_270<\/setSpec><setSpec>\n                col_2160_7909<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nThe glacial map of southern South America<\/dc:title><dc:creator>\nJansson, Krister N.<\/dc:creator><dc:creator>\nGlasser, Neil F.<\/dc:creator><dc:contributor>\nDepartment of Geography and Earth Sciences<\/dc:contributor><dc:contributor>\nCentre for Glaciology<\/dc:contributor><dc:description>\nGlasser, N. F., Jansson, K. N. (2008). Surveillance of adenoviruses and noroviruses in European recreational waters. Journal of Maps, p. 175-196. Sponsorship: Leverhulme Trust Research Fellowship<\/dc:description><dc:description>\nThis paper describes The Glacial Map of southern South America. This is a new map of the glacial geomorphology of southern South America between latitudes 38 S and 56 S, approximately the area covered by the former Patagonian Ice Sheets. The map was compiled from interpretation of remotely sensed images (Landsat 7 ETM+, pan-sharpened Landsat 7 and ASTER scenes). The mapped geomorphological features include terminal moraines, glacial lineations, ribbed moraine, glacier debris stripes, trimlines, empty cirques, plateau edge, volcanoes, meltwater channels, deltas, glacial lake shorelines, alluvial fans, sandar, and glacial lake outburst ood tracks. The map also indicates the current extent of major ice elds and glaciers in the area, as well as other topographic features such as lakes, rivers, shorelines, deltas, plateau surfaces and volcanoes. We brie y describe the most commonly occurring glacial landforms and provide an overview of their distribution within the mapped area.<\/dc:description><dc:description>\nPeer reviewed<\/dc:description><dc:date>\n2011-05-23T10:55:54Z<\/dc:date><dc:date>\n2011-05-23T10:55:54Z<\/dc:date><dc:date>\n2008-09-01<\/dc:date><dc:type>\n\/dk\/atira\/pure\/researchoutput\/researchoutputtypes\/contributiontojournal\/article<\/dc:type><dc:identifier>\nJansson , K N & Glasser , N F 2008 , ' The glacial map of southern South America ' Journal of Maps , vol 4 , no. 1 , pp. 175-196 . DOI: 10.4113\/jom.2008.1020<\/dc:identifier><dc:identifier>\n1744-5647<\/dc:identifier><dc:identifier>\nPURE: 161226<\/dc:identifier><dc:identifier>\nPURE UUID: 032509b4-77b3-402b-8612-205f158a9d5d<\/dc:identifier><dc:identifier>\ndspace: 2160\/6784<\/dc:identifier><dc:identifier>\nDSpace_20121128.csv: row: 4082<\/dc:identifier><dc:identifier>\nRAD: 3527<\/dc:identifier><dc:identifier>\nRAD_Outputs_All_ID_Import_20121105.csv: row: 1553<\/dc:identifier><dc:identifier>\nScopus: 79955465200<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2160\/6784<\/dc:identifier><dc:identifier>\nhttp:\/\/www.mirrorservice.org\/sites\/www.journalofmaps.com\/article_depository\/samerica\/Glasser_glacial_1205923008.pdf<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.4113\/jom.2008.1020<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nJournal of Maps<\/dc:relation><dc:rights>\n<\/dc:rights><dc:format>\n22<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1744-5647","1744-5647"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Journal of Maps"],"year":2008,"topics":[],"subject":["\/dk\/atira\/pure\/researchoutput\/researchoutputtypes\/contributiontojournal\/article"],"fullText":"Journal of Maps, 2008, 175-196\nThe Glacial Map of southern South America\nNEIL GLASSER1 & KRISTER JANSSON2\n11Centre for Glaciology, Institute of Geography and Earth Sciences, Aberystwyth University, SY23 3DB,\nWales, UK; nfg@aber.ac.uk\n2Department of Physical Geography and Quaternary Geology, Stockholm University, SE-10691,\nStockholm, Sweden;\n(Received 19th March 2008; Revised 25th June 2008; Accepted 26th June 2008)\nAbstract: This paper describes The Glacial Map of southern South America. This is a\nnew map of the glacial geomorphology of southern South America between latitudes\n38◦S and 56◦S, approximately the area covered by the former Patagonian Ice Sheets.\nThe map was compiled from interpretation of remotely sensed images (Landsat 7\nETM+, pan-sharpened Landsat 7 and ASTER scenes). The mapped geomorphological\nfeatures include terminal moraines, glacial lineations, ribbed moraine, glacier debris\nstripes, trimlines, empty cirques, plateau edge, volcanoes, meltwater channels, deltas,\nglacial lake shorelines, alluvial fans, sandar, and glacial lake outburst flood tracks. The\nmap also indicates the current extent of major icefields and glaciers in the area, as well\nas other topographic features such as lakes, rivers, shorelines, deltas, plateau surfaces\nand volcanoes. We briefly describe the most commonly occurring glacial landforms and\nprovide an overview of their distribution within the mapped area.\nISSN 1744-5647\nhttp:\/\/www.journalofmaps.com\n175\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\n1. Introduction\nThe aim of this paper is to introduce The Glacial Map of southern South\nAmerica, which contains the results of new mapping from remotely sensed\nimages of the glacial geomorphology of southern South America between\nlatitudes 38◦S and 56◦S, approximately the area covered by the former\nPatagonian Ice Sheets (Figure 1). This study marks a first attempt at\ngeomorphological mapping of subglacial and ice-marginal landforms in this\narea on an ice-sheet wide scale using remotely sensed images. This work\nbuilds on the pioneering study of Caldenius (1932) who first mapped\nmoraine systems around the contemporary icefields of South America. The\npalaeoglaciological significance of the mapping in terms of former ice\nextent, ice-sheet reconstruction and glacial chronology is provided in\nGlasser et al. (2008).\nCurrent understanding of the terrestrial extent of the former Patagonian\nIce Sheets owes much to the pioneering study of Caldenius (1932) who first\nmapped moraine systems around the contemporary icefields. Caldenius\n(1932) distinguished four separate moraine belts to the east of the icefields.\nHe concluded from their state of preservation that the three inner moraine\nsystems were relatively young. In accordance with the stages of the last\nWeichselian Glaciation in northern Europe, Caldenius named the three\nmoraine limits (from inner to outer) the “Finiglacial”, the “Gotiglacial”,\nand the “Daniglacial”. Later, the Finiglacial moraines were correlated to\nthe last glaciation maximum (LGM) and the Daniglacial and the\nGotiglacial moraine systems to the middle Pleistocene (Mo¨rner and Sylwan,\n1989). The fourth (outermost) moraine system, termed the “Initioglacial”\nby Caldenius (1932), is still poorly constrained in age, but is thought to be\nbetween 1.1 Ma and 2.3 Ma in age (Meglioli, 1992; Mercer, 1969; Mo¨rner\nand Sylwan, 1989; Singer et al., 2004). Coronato et al. (2004) and Rabassa\net al. (2000; 2005) have produced seminal reviews of glaciations in South\nAmerica. These authors have argued from a synthesis of records that the\noldest known Patagonian glaciations took place between approximately 7\nand 5 Ma but moraine systems from these glaciations are not preserved and\ntheir occurrence is inferred mainly on stratigraphic and sedimentological\ngrounds. Rabassa et al. (2005) suggest a minimum of eight glaciations\noccurred in the Middle-Late Pliocene (Oxygen Isotopic Stages 54-82). The\n“Great Patagonian Glaciation” developed between 1.168 and 1.016 Ma\n(OIS 30-34; Early Pleistocene). After the Great Patagonian Glaciation,\n14-16 cold (glacial\/stadial) events alternated with corresponding warm\n176\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nFigure 1. Location map showing the area covered by the Glacial Map of southern South\nAmerica.\n(interglacial\/interstadial) equivalents (Rabassa et al., 2005). They argue\nthat the Last Glacial Maximum occurred between 25,000 and 16,000\ncalendar years ago (OIS 2; Late Pleistocene), and that two readvances (or\nstill stands) took place during the Late Glacial (15,000-10,000 14C years\nBP).\n177\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nNumerous local and regional studies exist within the area covered by the\nformer ice sheets. Studied areas include the Chilean Lake District (e.g.\nPorter, 1981; Bentley, 1997; Andersen et al., 1999; Denton et al., 1999), the\narea around the North Patagonian ice field (Glasser et al., 2004; 2005; 2006;\nGlasser and Jansson, 2005; Turner et al., 2005), the eastern Andes (Strelin\nand Malagnino, 2000; Kaplan et al., 2004; 2005; Douglass et al., 2005; 2006;\nWenzens, 1999), the Magellan Strait\/Fuegan area (Porter et al., 1992;\nClapperton et al., 1995; Coronato, 1995; Coronato et al., 2004; Rabassa\net al., 1990; 2000; Benn and Clapperton, 2000; Bentley et al., 2005) and the\nTorres del Paine area (Marden, 1993; 1997; Marden and Clapperton, 1995).\nThere are also a number of palaeocological studies that indicate the\nenvironmental conditions prevailing during Pleistocene times (e.g. Heusser\nand Rabassa, 1987; Heusser, 1989a;b;c; 1990; 1998; 2003; Markgraf, 1993;\nMoreno, 1997; Bennett et al., 2000; McCulloch et al., 2000; Massaffero and\nBrooks, 2002; Massaffero et al., 2005). From a synthesis of key proxy\nrecords, McCulloch et al. (2000) concluded that there was a sudden rise in\ntemperature that initiated deglaciation of the last Patagonian Ice Sheet\nsychronously over 16◦ of latitude at 14,600-14,300 14C yr BP (17,500-17,150\ncal. yr). There was a second step of warming in the Chilean Lake District\nat 13,000-12,700 14C yr BP (15,650-15,350 cal. yr), which saw temperatures\nrise to close to modern values. A third warming step, particularly clear in\nsouthern Chile, occurred c. 10,000 14C yr BP (11,400 cal. yr). Following\nthe initial warming, there was a lagged response in precipitation as the\nwesterlies, after a delay of c. 1600 yr, migrated from their northern glacial\nlocation to their present latitude, which was attained by 12,300 14C yr BP\n(14,300 cal. yr) (McCulloch et al., 2000).\nA number of dating techniques have been applied to the Patagonian\nmoraine systems and their associated glacigenic deposits, including\nradiocarbon (14C) dating of moraines, peat bogs and lacustrine deposits\n(e.g. Mercer, 1965; 1968; 1976; Aniya, 1995; Denton et al., 1999; Hajdas\net al., 2003; McCulloch et al., 2005), cosmogenic isotope dating (Kaplan\net al., 2004; 2005; 2007; Fogwill and Kubik, 2005; McCulloch et al., 2005;\nDouglass et al., 2006), optically stimulated luminescence (OSL) dating\n(Winchester et al., 2005; Glasser et al., 2006), and 40Ar\/39Ar and K-Ar\ndating of lava flows interbedded with glacigenic and glaciofluvial deposits\n(Singer et al., 2004). Numerical ice-sheet modelling experiments have also\nsignificantly increased our understanding of the extent and dimensions of\nthe former ice sheets and their interaction with climate (e.g. Hulton et al.,\n1994; 2002; Sugden et al., 2002; Hubbard et al., 2005). However, despite\nthese advances in our understanding of the form and chronology of\n178\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nPatagonian glaciations, no-one has ever attempted to map the landforms\nacross the entire bed of the former ice sheets. Here we present a map of\nglacial geomorphological features on an ice-sheet wide scale using remotely\nsensed images.\n2. Mapped Area\nThe Glacial Map of southern South America covers in detail the glacial\ngeomorphology of South America between latitudes 38◦S and 56◦S. Two\nmajor ice masses (the North and South Patagonian Icefields) and numerous\nsnow- and ice-capped volcanoes and mountain icefields currently exist in\nthe region. The North Patagonian Icefield (47◦ 00’S, 73◦ 39’W) is some 120\nkm long and 40-60 km wide, capping the Andean Cordillera between\naltitudes of 700-2,500 m a.s.l. (Figure 1). The icefield covers some 3,953\nkm2 (Rivera et al., 2007). Annual precipitation on the western side of the\nicefield increases from 3,700 mm at sea level to an estimated maximum of\n6,700 mm before decreasing sharply on the eastern side (Escobar et al.,\n1992). The South Patagonian Icefield covers an area of c. 13,000 km2\n(Aniya, 1999) and runs north-south for 360 km between 48◦ 50’S and 51◦\n30’S, with a mean width of 40 km. The South Patagonian Icefield also has\nsteep climatic gradients between the maritime west side and continental\neast side. Smaller mountain icefields, glacier-capped volcanoes and isolated\ncirque glaciers also exist in many places along the north-south spine of the\nAndes, as well as in the very southern part of the study area in the\nCordillera Darwin.\n3. Methods\n3.1 Image Interpretation\nThe Glacial Map of southern South America consists of glacial\ngeomorphological features including terminal moraines, trimlines, meltwater\nchannels, sandar, alluvial fans, glacial lineations and empty cirques,\ntogether with other related landforms such as deltas and shorelines. The\nmap also shows non-glacial topographic features such as lakes, plateaux,\n179\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nrivers and volcanoes. Features were mapped from Landsat 7 ETM+ scenes\n(30 m spatial resolution), pan-sharpened Landsat 7 scenes and ASTER (15\nm spatial resolution) satellite images in ArcMap GIS software. We\ninterpreted the entire area covered by former Patagonian Ice Sheets using\n33 Landsat 7 ETM+ and pan-sharpened Landsat 7 scenes and 167\nindividual ASTER images.\nSatellite images were overlaid on a Digital Elevation Model (DEM) based\non 90 m cell size Shuttle Radar Topographic Mission (SRTM) data to\nprovide topographic context and to aid landform identification in areas of\ncomplex terrain.\n3.2 Map compilation\nThe criteria used in landform identification and mapping for The Glacial\nMap of southern South America are shown in Table 1. Satellite image\ninterpretation was performed using multiple band combinations and\nstandard image enhancement procedures (contrast stretching and histogram\nequalization) to improve the landform signal strength (Jansson and Glasser,\n2005; Smith and Wise, 2007). Multiple images were used for the mapping in\nareas where cloud cover was present. Mapping was carried out at 1:50,000\nscale and landforms were manually digitized into vector layers by visual\ninterpretation of landforms in ESRI ArcGIS (cf. Clark, 1997). The map was\nread into Adobe Illustrator CS3 from ArcGIS for final illustrative editing.\n4. Mapped glacial landforms\nA full list of mapped landforms and their significance is provided in Table\n1. Here we describe the most commonly occurring glacial landforms on The\nGlacial Map of southern South America and provide an overview of their\ndistribution within the mapped area.\nTerminal moraines: Large moraine complexes are present to both the west\nand east of the Andes throughout the mapped area. Sometimes these\nconsist of multiple moraine sets and associated glacial lineations, e.g. in the\nareas occupied by the large eastern former outlet glaciers (Figure 2). Large\narcuate moraines mark the existence of former piedmont glacier lobes on\n180\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nthe western side of the Andes e.g. in the Chilean Lake District (Andersen\net al., 1999; Denton et al., 1999). The glaciers eroded deep basins here and\ntheir terminal moraines now impound the lakes that give their name to the\nChilean Lake District. The terminal moraines are generally complex\nfeatures with multiple ridges and crests (e.g. at Lago Llanquihue, Lago\nRupanco and Lago Ranco). On the eastern side of the Andes at this\nlatitude, the outlet glaciers were more restricted in extent. The maximum\nextent of these glaciers is marked by cross-valley moraines composed\ngenerally of single ridges. Here these eastern terminal moraines are smaller\nand less distinct that their western counterparts but further south, to the\neast of the North and South Patagonian Icefields, there are again very large\nand well-developed terminal moraine complexes. In the very south of the\nmapped area are also large moraine complexes e.g. in Seno Skyring, Seno\nOtway, Estrecho Magallenes and Baha Inu´til. Finally, throughout the\nmapped area are many small moraines close to contemporary ice margins.\nThese represent late Holocene, “Little Ice Age” and Twentieth Century\nglacier recession (Glasser et al., 2005).\n70°50'0\"W71°0'0\"W71°10'0\"W\n46°20'0\"S\n46°30'0\"S\n46°40'0\"S\nLegend\nMoraines\nSandur\nMeltwater channels\nLakes\nPlateau edge\nGlacial lake \nshoreline 0 5 10\nL. Buenos \nAires\nkilometres\nFigure 2. Landsat subscene (left panel) and interpretation (right panel) showing moraine com-\nplexes formed by LGM outlet glaciers to the east of the North Patagonian Icefield. Note the\nextensive sandur development between individual moraine crests. Green colour is vegetation.\n181\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nTrimlines: Trimlines (sub-horizontal lines on valley sides separating areas\nof non-vegetated and vegetated land or areas covered by different types of\nvegetation) are developed close to the snouts of many contemporary\nglaciers throughout the study area (Glasser et al., 2005). In many places,\nthey merge down-glacier with lateral and terminal moraines, marking\nrecent (post “Little Ice Age”) glacier recession (Figure 3). These trimlines\nare most apparent around the snouts of the small glaciers that occur in the\narea between the North Patagonian Icefield and the Chilean Lake District\n(Figures 3 and 4). Trimlines are also developed around the snouts of the\neastern outlet glaciers of both the North and South Patagonian Icefields.\nMeltwater channels: Meltwater channels occur throughout the study area\nat a variety of spatial scales. Close to the contemporary glaciers are small\nmeltwater channels that mark recent recession of these glaciers. Further\nfrom the contemporary glaciers, meltwater channels are associated with\nlarge terminal moraine complexes, for example those that formed around\nthe margins of the former outlet glaciers on the eastern side of the North\nand South Patagonian Icefields (Figure 2). Lateral and marginal meltwater\nchannels are also common features along the lateral margins of the former\noutlet glaciers (e.g. the former outlet glaciers in the Magellan Strait and\nSeno Otway). Here the channels are sub-parallel to the former glacier\nmargins, often merging down-glacier into moraine complexes (Benn and\nClapperton, 2000).\nSandur: Glacial outwash plains are closely associated with moraine ridges,\nand are extremely useful in determining former ice frontal positions (Figure\n2). They are especially common east of the Andes, although there are also\nlarge examples west of the Andes for example in front of the moraine\ncomplex at Laguna San Rafael. In areas of contemporary glacierisation\nsandar still contain active braided rivers, whilst in currently non-glacierised\nareas they form large sediment accumulations on valley floors. Prominent\nterraces and breaks of slope are marked on the sandar where they are\npresent.\nGlacial lineations: Glacial lineations are present throughout the mapped\narea. They are formed in solid bedrock as streamlined bedrock landforms\nand in drift (Figure 4). West and south of the main Andean watershed the\nlineations are bedrock features, whilst east of the watershed they are\npredominantly drift features. The glacial lineations are predominantly\nfound at lower elevations, for example on valley floors (e.g. Clapperton,\n1989). In many places they occur in discrete corridors, for example to the\n182\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\n72°10 ' 0\"W72°15 ' 0\"W72°20 ' 0\"W72°25 ' 0\"W72°30' 0\"W\n47°20'0\"S\n47°30'0\"S\n47°40'0\"S\n47°50'0\"S\nM. San \nLorenzo\nLegend\nGlaciers\nGlacier debris\nTrimlines\nMoraines\nSandur\nGlacial lineations\nEmpty cirque\nAlluvial fan\nLakes\nRivers\n0 5 10 kilometres\nFigure 3. Landsat subscene (left panel) and interpretation (right panel) showing recent glacier\nchanges in the area around Monte San Lorenzo. Glacier recession and thinning is shown by the\nmoraines and trimlines developed around the contemporary glaciers. In the top centre of the\nimage is a moraine and sandur complex and in the lower right of the image are glacial lineations.\nThese features are presumed to be LGM in age. Isolated cirques also occur.\neast of the North Patagonian Icefield, where the glacial lineations indicate\nthat ice discharge was concentrated into large, fast-flowing, topographically\ndetermined outlet glaciers (Glasser and Jansson, 2005). There is a similar\nsituation in the Fuegan Andes where glacial lineations aligned NW to SE\nindicate sustained and vigorous ice flow towards the SE through Seno\nAlmirantazgo towards Lago Fagnano.\nEmpty cirques: Glacial cirques are common in the mountainous regions\nthroughout the mapped area. Cirques are particularly well-developed in the\nAndes in the Northern and Central sectors in the area between the North\nPatagonian Icefield and the Chilean Lake District (Figure 3). Here cirques\nare developed on both the eastern and western flanks of the Andes. Cirques\nface generally east or south-east on the eastern flank of the Andes and west\nor south-west on the western flank of the Andes, although there is\nconsiderable local variation because of the influence of topography (e.g.\nLjungner, 1948). Further south, there are concentrations of cirques in the\narea to the west of the South Patagonian Icefield. In the extreme southern\npart of South America south-facing cirques are developed on the mountains\n183\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nthat flank Seno Almirantazgo and Lago Fagnano.\n0 4 kilometres\n70°48 '0\"W70°52 '0\"W70°56 '0\"W\n52°40 '0\" S\n52°44 '0\"S\n52°48 '0\"S\nLe eg nd\nMoraines\nSandur\nGlacial lineation\nLakes\nSeno\nOtway\nFigure 4. Landsat subscene (left panel) and interpretation (right panel) showing the glacial\ngeomorphology of the area around Laguna Cabeza del Mar (to the east of Seno Otway in\nsouthern Patagonia). At least two sets of glacial lineations can be traced to ice margins in\nthe north east of the image. The ice margins are marked by moraines, sandar and meltwater\nchannels.\n5. Conclusions\nIn this paper we have presented a new map of the glacial geomorphology of\nthe whole of southern South America (The Glacial Map of southern South\nAmerica) between latitudes 38◦S and 56◦S, approximately the area covered\nby the former Patagonian Ice Sheets. Features presented on the map\ninclude moraines, trimlines, meltwater channels, sandar, glacial lineations\nand cirques, together with other related landforms and topographic features\nsuch as lakes, shorelines, deltas, plateaux, rivers and volcanoes. From the\ndistribution of landforms we draw the following conclusions.\n1. There are large contrasts between the eastern and western sides of the\nformer ice sheets. To the east the landscape is dominated by large\n184\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nmoraine systems and associated sandar, whilst to the west there is a\nlandscape dominated by fjords and ice-scoured bedrock.\n2. Moraines and associated sandar typically mark the former extent of\noutlet glaciers of the Patagonian Ice Sheets. The largest moraines\nsystems are those developed in the central and southern sectors of the\nmapped area to the east of the Andes around Lago Buenos Aires,\nLago Argentino and Lago Viedma, but there are also large moraines\npresent in the Fuegan Andes around Bahia Inutil and the Magellan\nStrait.\n3. Trimlines are developed close to the snouts of many contemporary\nglaciers throughout the study area. In many places, they merge\ndown-glacier with lateral and terminal moraines, marking recent (post\n“Little Ice Age”) glacier recession. These trimlines are most apparent\naround the snouts of the small glaciers that occur in the area between\nthe North Patagonian Icefield and the Chilean Lake District but\ntrimlines are also developed around the snouts of the eastern outlet\nglaciers of both the North and South Patagonian Icefields.\n4. Meltwater channels occur throughout the study area at a variety of\nsizes. They are often associated with large terminal moraine\ncomplexes, for example those around the margins of the former outlet\nglaciers on the eastern side of the North and South Patagonian\nIcefields. Lateral and marginal meltwater channels are also common\nfeatures along the margins of the former outlet glaciers (e.g. in the\nMagellan Strait and Seno Otway).\n5. Glacial lineations are developed in many areas of the bed of the\nformer ice sheets. These glacial lineations indicate that in these areas\nthe ice sheets were largely warm-based. The distribution of glacial\nlineations also indicates that ice discharge from the former ice sheets\nwas concentrated into large, fast-flowing, topographically determined\noutlet glaciers. This is especially the case to the east of the Andes.\n6. Cirques are found in the mountainous regions throughout the study\narea on both the eastern and western flanks of the Andes. Cirques\nface generally east or south-east on the eastern flank of the Andes and\nwest or south-west on the western flank of the Andes, although there\nis considerable local variation because of the influence of topography.\n185\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nSoftware\nAll mapping for The Glacial Map of southern South America was\nconducted in ESRI ArcGIS software. Vector layers were stored as ArcGIS\nShapefiles. Final map compilation was completed in Adobe Illustrator CS3.\nAcknowledgements\nThe Glacial Map of southern South America described in this paper was\ncompiled between July 2006 and February 2007 whilst NFG was supported\nby a Leverhulme Trust Research Fellowship. We thank the journal referees\nMike Sigouin, David Sugden and Tim Fisher for their helpful comments on\nthe map and text.\nTable 1 (following page) The criteria used to identify the landforms included in the Glacial Map\nof southern South America.\n186\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nL\na\nn\nd\nfo\nrm\n\/\nfe\na\ntu\nre\nId\ne\nn\nti\nfi\nca\nti\no\nn\ncr\nit\ne\nri\na\nP\no\nss\nib\nle\nid\ne\nn\nti\nfi\nca\nti\no\nn\ne\nrr\no\nrs\nS\nig\nn\nifi\nca\nn\nce\nM\no\nrp\nh\no\nlo\ng\ny\nC\no\nlo\nu\nr\/\nst\nru\nct\nu\nre\n\/\nte\nx\ntu\nre\nC\non\nte\nm\np\nor\nar\ny\ngl\nac\nie\nrs\nan\nd\ngl\nac\nie\nr\nd\neb\nri\ns\nB\nar\ne\nic\ne,\nsn\now\nan\nd\nd\ne-\nb\nri\ns.\nS\nu\nrf\nac\ne\nst\nru\nct\nu\nre\ns\n(e\n.g\n.\ncr\nev\nas\nse\ns,\nfo\nli\na-\nti\non\n)\nar\ne\nco\nm\nm\non\n.\nS\nn\now\nan\nd\nic\ne\nap\np\nea\nr\nw\nh\nit\ne\nto\nli\ngh\nt\nb\nlu\ne.\nS\nu\nrf\nac\ne\nsm\no\not\nh\nto\nro\nu\ngh\n.\nD\neb\nri\ns\nap\np\nea\nrs\nas\ngr\ney\nto\nb\nla\nck\nin\nco\nlo\nu\nr.\nM\nin\nor\nov\ner\n-e\nst\nim\nat\ne\nin\ngl\nac\nie\nr\nex\nte\nn\nt\np\nos\nsi\nb\nle\nw\nh\ner\ne\nco\nn\nfu\nse\nd\nw\nit\nh\nsn\now\nco\nve\nr.\nF\no\nci\nfo\nr\nic\ne\nd\nis\nch\nar\nge\nfr\nom\nth\ne\nco\nn\nte\nm\np\nor\nar\ny\nic\nefi\nel\nd\ns.\nIc\ne-\nsc\nou\nre\nd\nb\ned\nro\nck\nW\nid\nes\np\nre\nad\nex\np\nos\nu\nre\ns\nof\nb\nar\ne\nor\nli\ngh\ntl\ny\nve\nge\n-\nta\nte\nd\nb\ned\nro\nck\n.\nN\nu\nm\ner\n-\nou\ns\nsm\nal\nl\nla\nke\nb\nas\nin\ns\nan\nd\nop\nen\njo\nin\nts\nv\nis\nib\nle\n.\nG\nre\ny\nto\nli\ngh\nt\np\nin\nk\nw\nh\nen\nve\nge\nta\nti\non\nco\nve\nr\nis\np\nre\nse\nn\nt.\nB\ned\nro\nck\nst\nru\nc-\ntu\nre\ns\nan\nd\nfa\nu\nlt\ns\nof\nte\nn\np\nre\nse\nn\nt.\nU\np\n-\np\ner\nsu\nrf\nac\ne\nof\nte\nn\nh\nas\na\nro\nu\ngh\nan\nd\nir\nre\ngu\nla\nr\nte\nx\ntu\nre\n.\nP\nos\nsi\nb\nle\nu\nn\nd\ner\n-e\nst\nim\nat\ne\nw\nh\ner\ne\nb\ned\nro\nck\nob\nsc\nu\nre\nd\nb\ny\nve\nge\nta\nti\non\nco\nve\nr.\nE\nv\nid\nen\nce\nfo\nr\nex\nte\nn\nsi\nve\nar\nea\ns\nof\nfo\nrm\ner\ngl\nac\nie\nr\nic\ne\nat\nit\ns\np\nre\nss\nu\nre\n-\nm\nel\nti\nn\ng\np\noi\nn\nt.\nT\nri\nm\nli\nn\nes\nS\nu\nb\n-h\nor\niz\non\nta\nl\nli\nn\nes\non\nva\nll\ney\nsi\nd\nes\nse\np\nar\nat\nin\ng\nar\nea\ns\nof\nn\non\n-v\neg\net\nat\ned\nan\nd\nve\nge\nta\nte\nd\nla\nn\nd\nor\nar\nea\ns\nco\nve\nre\nd\nb\ny\nd\niff\ner\n-\nen\nt\nty\np\nes\nof\nve\nge\nta\nti\non\n.\nS\nh\nar\np\nal\nti\ntu\nd\nin\nal\nch\nan\nge\nin\nsu\nrf\nac\ne\nco\nlo\nu\nr\nan\nd\nte\nx\ntu\nre\nd\nu\ne\nto\nch\nan\nge\nin\nve\nge\nta\nti\non\nco\nve\nr.\nP\nos\nsi\nb\nle\n,\nb\nu\nt\nu\nn\nli\nke\nly\n,\nco\nn\nfu\nsi\non\nw\nit\nh\not\nh\ner\nsu\nb\n-\nh\nor\niz\non\nta\nl\nor\nh\nor\niz\non\nta\nl\nfe\nat\nu\nre\ns\nsu\nch\nas\ngl\nac\nia\nl\nla\nke\nsh\nor\nel\nin\nes\n.\nF\nor\nm\ner\nve\nrt\nic\nal\nd\nim\nen\n-\nsi\non\ns\nof\ngl\nac\nie\nrs\n.\nP\nos\n-\nsi\nb\nle\nen\ngl\nac\nia\nl\nth\ner\nm\nal\nb\nou\nn\nd\nar\ny.\nG\nla\nci\nal\nli\nn\nea\nti\non\ns\nP\nar\nal\nle\nl\nfe\nat\nu\nre\ns\nin\nd\nic\nat\nin\ng\nic\ne-\nfl\now\nd\nir\nec\nti\non\n.\nF\nor\nm\ned\nin\nb\ned\nro\nck\nb\ny\ngl\nac\nia\nl\ner\nos\nio\nn\nor\nb\ny\nse\nd\nim\nen\nt\nac\ncu\nm\nu\nla\nti\non\n.\nIn\nb\ned\nro\nck\n,\nch\nan\nge\nin\nsu\nrf\nac\ne\nst\nru\nct\nu\nre\nco\nm\np\nar\ned\nto\nsu\nrr\nou\nn\nd\nin\ng\nte\nrr\nai\nn\n.\nIn\nd\neb\nri\ns,\nd\niff\ner\nen\nt\nco\nlo\nu\nr\nco\nm\np\nar\ned\nto\nsu\nrr\nou\nn\nd\nin\ng\nte\nrr\nai\nn\nd\nu\ne\nto\nch\nan\nge\nin\nve\nge\nta\nti\non\nco\nve\nr.\nP\nos\nsi\nb\nle\nu\nn\nd\ner\n-e\nst\nim\nat\ne\nin\nar\nea\ns\nof\nth\nin\nd\neb\nri\ns\nco\nve\nr.\nB\ned\nro\nck\nla\nn\nd\nfo\nrm\ns\nm\nay\nb\ne\nco\nn\nfu\nse\nd\nw\nit\nh\nb\ned\nro\nck\nst\nru\nct\nu\nre\ns\nin\nce\nrt\nai\nn\nli\nth\nol\nog\nie\ns.\nS\nh\now\nic\ne-\nfl\now\nd\nir\nec\nti\non\nan\nd\nm\nay\nin\nd\nic\nat\ne\nh\nig\nh\nfo\nrm\ner\nic\ne\nve\nlo\nci\nti\nes\n,\nw\nh\nen\nh\nig\nh\nly\nat\nte\nn\nu\n-\nat\ned\n.\nM\nor\nai\nn\nes\nan\nd\nm\nor\nai\nn\ne\nco\nm\np\nle\nx\nes\nP\nro\nm\nin\nen\nt\ncr\nos\ns-\nva\nll\ney\nsi\nn\ngl\ne\nor\nm\nu\nlt\nip\nle\nri\nd\nge\ns\nw\nit\nh\np\nos\nit\niv\ne\nre\nli\nef\n.\nL\nin\nea\nr,\ncu\nrv\ned\n,\nsi\nn\nu\nou\ns\nor\nsa\nw\n-t\no\not\nh\ned\nin\np\nla\nn\n.\nM\nay\no\ncc\nu\nr\nas\nsi\nn\ngl\ne\nm\nor\nai\nn\nes\nor\nin\nm\nor\ne\nco\nm\np\nli\nca\nte\nd\nm\nor\nai\nn\ne\nsy\nst\nem\ns.\nO\nf-\nte\nn\nas\nso\nci\nat\ned\nw\nit\nh\not\nh\ner\nic\ne-\nm\nar\ngi\nn\nal\nfe\na-\ntu\nre\ns\nsu\nch\nas\nm\nel\ntw\nat\ner\nch\nan\nn\nel\ns,\nic\ne-\nco\nn\nta\nct\nla\nn\nd\nfo\nrm\ns\nan\nd\nsa\nn\nd\nar\n.\nS\nh\nad\now\nin\ng\nd\nu\ne\nto\nch\nan\nge\nin\nh\nei\ngh\nt\nor\nre\nla\nti\nve\nre\nli\nef\n.\nC\nh\nan\nge\nin\nco\nlo\nu\nr\nb\nec\nau\nse\nof\nd\niff\ner\nen\nt\nso\nil\nan\nd\nve\nge\n-\nta\nti\non\nco\nve\nr\nco\nm\np\nar\ned\nto\nsu\nrr\nou\nn\nd\n-\nin\ng\nte\nrr\nai\nn\n.\nP\nos\nsi\nb\nle\n,\nb\nu\nt\nu\nn\nli\nke\nly\n,\nco\nn\nfu\nsi\non\nw\nit\nh\ntr\nim\nli\nn\nes\nw\nh\ner\ne\nm\nor\nai\nn\nes\nh\nav\ne\nlo\nw\nre\nla\nti\nve\nh\nei\ngh\nt.\nP\nos\nsi\nb\nle\nco\nn\nfu\nsi\non\nw\nit\nh\nsh\nor\nel\nin\nes\nar\nou\nn\nd\nla\nke\nm\nar\ngi\nn\ns\nan\nd\nin\nco\nas\nta\nl\nar\nea\ns.\nP\nos\nsi\nb\nle\nco\nn\nfu\nsi\non\nw\nit\nh\nla\nn\nd\nsl\nip\nm\nat\ner\nia\nl\nb\nen\nea\nth\nvo\nlc\nan\nic\np\nla\nte\nau\nx\n.\nM\nor\nai\nn\nes\nm\nar\nk\nth\ne\nfo\nr-\nm\ner\nte\nrm\nin\nal\np\nos\nit\nio\nn\nof\ngl\nac\nie\nrs\n.\n187\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nS\nan\nd\nu\nr\/\nfl\nu\nv\nia\nl\nse\nd\ni-\nm\nen\nt\nV\nal\nle\ny\nfl\no\nor\nac\ncu\nm\nu\nla\n-\nti\non\ns\nof\nse\nd\nim\nen\nt,\nco\nm\n-\nm\non\nly\nd\nis\nse\nct\ned\nb\ny\na\nb\nra\nid\ned\nst\nre\nam\np\nat\n-\nte\nrn\n.\nF\nla\nt,\nm\nai\nn\nly\nli\ngh\nt\nre\nd\nar\nea\ns\nw\nit\nh\nm\ned\niu\nm\ngr\ney\nw\nh\ner\ne\nth\ner\ne\nis\nth\nin\nve\nge\nta\nti\non\nco\nve\nr.\nE\nro\nsi\non\nal\nsc\nar\ns\nan\nd\nsh\nar\np\nb\nou\nn\nd\nar\nie\ns\nw\nit\nh\nsu\nr-\nro\nu\nn\nd\nin\ng\nte\nrr\nai\nn\n.\nP\nos\nsi\nb\nle\n,\nb\nu\nt\nu\nn\nli\nke\nly\n,\nco\nn\nfu\nsi\non\nw\nit\nh\nd\nel\nta\ns\nor\nic\ne-\nco\nn\nta\nct\nd\nep\nos\nit\ns.\nM\nar\nk\ns\nm\na\njo\nr\nd\nra\nin\nag\ne\nro\nu\nte\ns\nfr\nom\nco\nn\nte\nm\np\no-\nra\nry\ngl\nac\nie\nrs\nan\nd\not\nh\ner\ngl\nac\nie\nr-\nfe\nd\nst\nre\nam\ns.\nT\ner\nra\nce\ned\nge\nin\nsa\nn\nd\nu\nr\nB\nre\nak\nof\nsl\nop\ne\nin\nsa\nn\n-\nd\nu\nr\nd\nep\nos\nit\ns.\nH\nig\nh\n-\nle\nve\nl\nte\nrr\nac\nes\nm\nay\nb\ne\ngr\nad\ned\nto\nsa\nm\ne\nel\nev\na-\nti\non\nas\nm\nor\nai\nn\nes\n.\nT\ner\nra\nce\ned\nge\ns\nh\nav\ne\nsh\nar\np\nb\nou\nn\nd\n-\nar\nie\ns.\nO\nb\nv\nio\nu\ns\nb\nre\nak\nof\nsl\nop\ne\nw\nit\nh\nsu\nrr\nou\nn\nd\nin\ng\nte\nrr\nai\nn\n.\nP\nos\nsi\nb\nle\n,\nb\nu\nt\nu\nn\nli\nke\nly\n,\nco\nn\nfu\nsi\non\nw\nit\nh\nsh\nor\nel\nin\nes\nn\nea\nr\nla\nke\ns.\nIn\nd\niv\nid\nu\nal\nte\nrr\nac\nes\nin\nd\nic\nat\ne\nd\now\nn\n-c\nu\ntt\nin\ng\nan\nd\nag\ngr\nad\nat\nio\nn\nal\nev\nen\nts\n.\nD\nel\nta\nor\nic\ne-\nco\nn\nta\nct\nd\nep\nos\nit\ns\nF\nla\nt-\nto\np\np\ned\nse\nd\nim\nen\nt\nac\ncu\nm\nu\nla\nti\non\ns\nab\nov\ne\nth\ne\np\nre\nse\nn\nt\nd\nay\nva\nll\ney\nfl\no\nor\n,\nco\nm\nm\non\nly\nw\nit\nh\na\nst\nee\np\nd\nel\nta\nfr\non\nt.\nH\nom\nog\nen\neo\nu\ns\nsu\nrf\nac\ne\nte\nx\ntu\nre\nw\nit\nh\nfl\nat\nu\np\np\ner\nsu\nrf\nac\nes\n,\ner\nos\nio\nn\nal\nsc\nar\ns\nan\nd\nsh\nar\np\nb\nou\nn\nd\nar\nie\ns\nw\nit\nh\nsu\nr-\nro\nu\nn\nd\nin\ng\nte\nrr\nai\nn\n.\nP\nos\nsi\nb\nle\n,\nb\nu\nt\nu\nn\nli\nke\nly\n,\nco\nn\nfu\nsi\non\nw\nit\nh\nsa\nn\nd\nu\nr\nor\nal\nlu\nv\nia\nl\nfa\nn\ns.\nS\ned\nim\nen\nts\nd\nep\nos\nit\ned\nb\ny\nm\nel\ntw\nat\ner\nst\nre\nam\ns\nd\nra\nin\nin\ng\ntr\nib\nu\nta\nry\nva\nll\ney\ns\non\nto\n\/a\nga\nin\nst\ngl\nac\nie\nr\nic\ne\nin\nm\nai\nn\nva\nll\ney\ns.\nIn\nd\nic\nat\nes\nth\nic\nk\nn\nes\ns\nan\nd\nex\nte\nn\nt\nof\nic\ne\nin\nth\ne\nm\nai\nn\nva\nll\ney\n.\nS\nh\now\ns\nfo\nrm\ner\ngl\nac\nia\nl\nla\nke\nle\nve\nls\n.\nA\nll\nu\nv\nia\nl\nfa\nn\ns\nS\nu\nb\n-h\nor\niz\non\nta\nl\nfa\nn\ns\non\nva\nll\ney\nsi\nd\nes\n.\nT\ny\np\ni-\nca\nll\ny\nfe\nd\nb\ny\na\nm\nel\ntw\na-\nte\nr\nch\nan\nn\nel\nor\nst\nre\nam\n.\nF\nan\nsh\nap\ned\nac\ncu\nm\nu\nla\nti\non\nw\nit\nh\nsh\nar\np\nb\nou\nn\nd\nar\ny\nw\nit\nh\nte\nrr\nai\nn\nd\nu\ne\nto\nch\nan\nge\nin\nsu\nrr\nou\nn\nd\nin\ng\nve\nge\nta\nti\non\nco\nve\nr.\nP\nat\nte\nrn\nof\nb\nra\nid\ned\nst\nre\nam\ns\non\nu\np\np\ner\nsu\nrf\nac\ne.\nP\nos\nsi\nb\nle\nto\nm\nis\nin\nte\nrp\nre\nt\nas\nfo\nss\nil\nd\nel\nta\nor\nic\ne-\nco\nn\nta\nct\nd\nep\nos\nit\n.\nR\new\nor\nk\nin\ng\nof\nu\nn\nco\nn\n-\nso\nli\nd\nat\ned\nm\nat\ner\nia\nl\nb\ny\nco\nn\nte\nm\np\nor\nar\ny\nm\nel\nt-\nw\nat\ner\nch\nan\nn\nel\ns\nan\nd\nst\nre\nam\ns.\nV\nol\nca\nn\no\nes\n\/c\nin\nd\ner\nco\nn\nes\nIs\nol\nat\ned\nco\nn\nic\nal\np\nea\nk\ns\nas\nso\nci\nat\ned\nw\nit\nh\nfo\nrm\ner\nor\nco\nn\nte\nm\np\nor\nar\ny\nvo\nl-\nca\nn\nis\nm\n.\nV\nol\nca\nn\no\nes\nri\nse\nsh\nar\np\nly\nab\nov\ne\nsu\nr-\nro\nu\nn\nd\nin\ng\nte\nrr\nai\nn\n,\nar\ne\nsn\now\n-\nor\nic\ne-\nca\np\np\ned\nan\nd\nco\nn\nta\nin\nop\nen\nsu\nrf\nac\ne\ncr\nat\ner\ns.\nF\nla\nn\nk\ns\nm\nay\nsh\now\nev\nid\nen\nce\nof\nla\nva\nfl\now\ns\nw\nit\nh\nsh\nar\np\nb\nou\nn\nd\nar\nie\ns\nw\nit\nh\nsu\nrr\nou\nn\nd\nin\ng\nte\nrr\nai\nn\n.\nP\nos\nsi\nb\nle\n,\nb\nu\nt\nu\nn\nli\nke\nly\n,\nco\nn\nfu\nsi\non\nw\nit\nh\nn\non\n-\nvo\nlc\nan\nic\nm\nou\nn\nta\nin\ns.\nIn\nd\nic\nat\nes\nfo\nrm\ner\nor\nco\nn\nte\nm\np\nor\nar\ny\nvo\nlc\nan\n-\nis\nm\n.\nS\nh\nor\nel\nin\nes\nB\nre\nak\ns\nof\nsl\nop\ne\nru\nn\n-\nn\nin\ng\np\nar\nal\nle\nl\nor\nsu\nb\n-\np\nar\nal\nle\nl\nto\nco\nas\ntl\nin\ne\nin\nco\nas\nta\nl\nar\nea\ns\n(m\nar\nin\ne\nsh\nor\nel\nin\nes\n)\nor\nar\nou\nn\nd\nla\nke\ns\n(l\nak\ne\nsh\nor\nel\nin\nes\n).\nS\nh\nad\now\nin\ng\nd\nu\ne\nto\nch\nan\nge\nin\nh\nei\ngh\nt\nor\nre\nla\nti\nve\nre\nli\nef\n.\nC\nh\nan\nge\nin\nco\nlo\nu\nr\nif\nfo\nrm\ner\nsh\nor\nel\nin\nes\nar\ne\nve\nge\nta\nte\nd\n.\nM\nan\ny\nsh\nor\nel\nin\nes\nm\nir\nro\nr\nth\ne\nsh\nap\ne\nof\nex\nis\nti\nn\ng\nco\nas\ntl\nin\ne\nor\nla\nke\nm\nar\n-\ngi\nn\ns.\nP\nos\nsi\nb\nle\nco\nn\nfu\nsi\non\nw\nit\nh\nm\nor\nai\nn\nes\n,\nes\np\nec\nia\nll\ny\nar\nou\nn\nd\nm\na\njo\nr\nla\nke\ns\nw\nh\ner\ne\nb\not\nh\nsh\nor\nel\nin\nes\nan\nd\nm\nor\nai\nn\nes\nm\nay\nb\ne\np\nre\nse\nn\nt.\nIn\nd\nic\nat\nes\nfo\nrm\ner\nla\nke\nor\nse\na\nle\nve\nls\n.\nS\nom\ne\nla\nke\nsh\nor\nel\nin\nes\nin\nd\nic\nat\ne\nth\ne\np\nre\nse\nn\nce\nof\nfo\nrm\ner\nic\ne-\nd\nam\nm\ned\nla\nke\ns.\n188\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nG\nla\nci\nal\nla\nke\nou\ntb\nu\nrs\nt\nfl\no\no\nd\n(G\nL\nO\nF\n)\ntr\nac\nk\ns\nP\nro\nm\nin\nen\nt\nac\ncu\nm\nu\n-\nla\nti\non\ns\nof\nsa\nn\nd\nan\nd\ngr\nav\nel\n,\nof\nte\nn\non\nst\nee\np\nsl\nop\nes\nan\nd\nlo\nca\nte\nd\nb\nel\now\nco\nn\nte\nm\np\nor\nar\ny\ngl\nac\nie\nrs\nor\nb\nre\nac\nh\ned\nm\nor\nai\nn\nes\n.\nS\ned\nim\nen\nt\nac\ncu\nm\nu\nla\nti\non\nw\nit\nh\nsh\nar\np\nb\nou\nn\nd\nar\ny\nw\nit\nh\nte\nrr\nai\nn\nd\nu\ne\nto\nch\nan\nge\nin\nsu\nrr\nou\nn\nd\nin\ng\nve\nge\nta\nti\non\nco\nve\nr.\nO\nft\nen\nlo\nca\nte\nd\nb\nel\now\na\nb\nre\nac\nh\ned\nm\nor\nai\nn\ne\nor\nd\nra\nin\ned\nla\nke\n.\nP\nos\nsi\nb\nle\n,\nb\nu\nt\nu\nn\nli\nke\nly\n,\nco\nn\nfu\nsi\non\nw\nit\nh\nsa\nn\nd\nu\nr\nor\nal\nlu\nv\nia\nl\nfa\nn\ns.\nC\nat\nas\ntr\nop\nh\nic\nfa\nil\nu\nre\nof\nm\nor\nai\nn\ne-\nd\nam\nm\ned\nor\ngl\nac\nie\nr-\nd\nam\nm\ned\nla\nke\ns.\nC\nir\nq\nu\nes\nL\nar\nge\nam\np\nh\nit\nh\nea\ntr\ne-\nsh\nap\ned\nh\nol\nlo\nw\ns\non\nm\nou\nn\nta\nin\nfl\nan\nk\ns\nor\nin\nci\nse\nd\nin\nto\np\nla\nte\nau\ned\nge\ns.\nS\nh\nar\np\nb\nou\nn\nd\nar\nie\ns\nw\nit\nh\nsu\nrr\nou\nn\nd\n-\nin\ng\nte\nrr\nai\nn\n,\nin\ncl\nu\nd\nin\ng\ncl\niff\ns.\nP\nos\nsi\nb\nle\n,\nb\nu\nt\nu\nn\nli\nke\nly\n,\nco\nn\nfu\nsi\non\nw\nit\nh\nm\nas\ns-\nm\nov\nem\nen\nt\nor\nla\nn\nd\nsl\nip\nsc\nar\ns\nes\np\nec\nia\nll\ny\nb\nen\nea\nth\nvo\nlc\nan\nic\np\nla\nte\nau\nx\n.\nIn\nd\nic\nat\nes\np\nre\nse\nn\nce\nof\nlo\nca\nli\nse\nd\nor\nre\nst\nri\nct\ned\nm\nou\nn\nta\nin\ngl\nac\nia\nti\non\ns.\nM\nel\ntw\nat\ner\nch\nan\nn\nel\ns\nL\nin\nea\nr\nfe\nat\nu\nre\ns\nw\nit\nh\nab\nru\np\nt\nin\nce\np\nti\non\nan\nd\nte\nrm\nin\nat\nio\nn\n.\nO\nft\nen\nco\nn\nta\nin\nn\no\nco\nn\nte\nm\np\no-\nra\nry\nd\nra\nin\nag\ne.\nC\nh\nan\n-\nn\nel\ns\nm\nay\nfo\nll\now\nor\ncu\nt\nac\nro\nss\nlo\nca\nl\nsl\nop\ne\nd\nir\nec\n-\nti\non\n.\nW\nel\nl-\nd\nefi\nn\ned\nch\nan\nn\nel\ned\nge\ns\nan\nd\nsh\nar\np\nb\nou\nn\nd\nar\nie\ns\nw\nit\nh\nsu\nrr\nou\nn\nd\nin\ng\nte\nrr\nai\nn\n.\nS\nh\nad\now\nin\ng\nd\nu\ne\nto\nch\nan\nge\nin\nh\nei\ngh\nt\nor\nre\nla\nti\nve\nre\nli\nef\n.\nC\nh\nan\nn\nel\nfl\no\nor\ns\nm\nay\nb\ne\nd\niff\ner\nen\nt\nin\nco\nlo\nu\nr\nto\nsu\nrr\nou\nn\nd\nin\ng\nla\nn\nd\n.\nP\nos\nsi\nb\nle\n,\nb\nu\nt\nu\nn\nli\nke\nly\n,\nco\nn\nfu\nsi\non\nw\nit\nh\nco\nn\nte\nm\np\no-\nra\nry\nd\nra\nin\nag\ne\nro\nu\nte\ns.\nIn\nd\nic\nat\nes\nla\nrg\ne\nvo\nl-\nu\nm\nes\nof\nm\nel\ntw\nat\ner\np\nro\nd\nu\nct\nio\nn\n.\nC\nh\nan\nn\nel\ns\nm\nay\nin\nd\nic\nat\ne\np\nos\nit\nio\nn\nof\nfo\nrm\ner\nic\ne\nm\nar\ngi\nn\n,\nes\np\nec\nia\nll\ny\nw\nh\nen\nv\nie\nw\ned\nin\nas\nso\nci\nat\nio\nn\nw\nit\nh\nm\nor\nai\nn\nes\nan\nd\nsa\nn\nd\nar\n.\nL\nak\nes\nL\nar\nge\nfr\nes\nh\nw\nat\ner\nb\no\nd\n-\nie\ns\nw\nit\nh\nin\nen\ncl\nos\ned\nb\nas\nin\ns.\nL\nak\nes\nap\np\nea\nr\nas\nb\nlu\ne,\nb\nla\nck\nor\not\nh\ner\nd\nar\nk\nco\nlo\nu\nrs\nd\nu\ne\nto\nh\nig\nh\nre\n-\nfl\nec\nta\nn\nce\n.\nS\nh\nar\np\nb\nou\nn\nd\nar\nie\ns\nw\nit\nh\nsu\nrr\nou\nn\nd\nin\ng\nte\nrr\nai\nn\n.\nV\nar\nie\nty\nof\nsh\nap\nes\np\nos\nsi\nb\nle\n.\nA\nre\nas\nin\nsh\nad\now\nw\nit\nh\nin\nre\ngi\non\ns\nof\nh\nig\nh\nre\nla\nti\nve\nre\n-\nli\nef\nor\ncl\nou\nd\nsh\nad\now\ns\nm\nay\nb\ne\nm\nis\nta\nke\nn\nfo\nr\nla\nke\ns.\nL\nak\nes\nin\nd\nic\nat\ne\nim\n-\np\ned\ned\nd\nra\nin\nag\ne.\nH\nig\nh\nfr\neq\nu\nen\ncy\nof\nla\nke\ns\nm\nay\nin\nd\nic\nat\ne\np\nre\nse\nn\nce\nof\nro\nck\nb\nas\nin\ns\nfo\nrm\ned\nb\ny\ngl\nac\nia\nl\nov\ner\n-d\nee\np\nen\nin\ng.\nP\nla\nte\nau\ned\nge\ns\nB\nre\nak\nof\nsl\nop\ne\nar\nou\nn\nd\np\nla\nte\nau\ned\nge\ns;\np\nar\nti\nc-\nu\nla\nrl\ny\nco\nm\nm\non\nar\nou\nn\nd\nb\nas\nal\np\nla\nte\nau\nx\n.\nP\nla\nte\nau\ned\nge\ns\nh\nav\ne\nsh\nar\np\nb\nou\nn\nd\n-\nar\nie\ns.\nO\nb\nv\nio\nu\ns\nb\nre\nak\nof\nsl\nop\ne\nw\nit\nh\nsu\nrr\nou\nn\nd\nin\ng\nte\nrr\nai\nn\n.\nIn\nd\nic\nat\nes\nsc\nar\np\nre\ntr\nea\nt?\nD\nri\nft\nli\nm\nit\nS\nu\nb\n-h\nor\niz\non\nta\nl\nor\nge\nn\n-\ntl\ny\nsl\nop\nin\ng\nli\nn\nes\non\nva\nll\ney\nsi\nd\nes\nse\np\nar\nat\nin\ng\nd\niff\ner\nen\nt\nty\np\nes\nof\nd\nri\nft\n,\nor\nse\np\nar\nat\nin\ng\nd\nri\nft\n-\nco\nve\nre\nd\nsl\nop\nes\nfr\nom\nb\ned\nro\nck\n.\nS\nh\nar\np\nve\nrt\nic\nal\nor\nh\nor\niz\non\nta\nl\nch\nan\nge\nin\nsu\nrf\nac\ne\nco\nlo\nu\nr\nan\nd\nte\nx\ntu\nre\nd\nu\ne\nto\nch\nan\nge\nin\nve\nge\nta\nti\non\nco\nve\nr,\nor\nch\nan\nge\nfr\nom\nd\nri\nft\n-c\nov\ner\ned\nsl\nop\nes\nto\nb\ned\nro\nck\n.\nP\nos\nsi\nb\nle\n,\nb\nu\nt\nu\nn\nli\nke\nly\n,\nco\nn\nfu\nsi\non\nw\nit\nh\not\nh\ner\nsu\nb\n-\nh\nor\niz\non\nta\nl\nor\nh\nor\niz\non\nta\nl\nfe\nat\nu\nre\ns\nsu\nch\nas\ngl\nac\nia\nl\nla\nke\nsh\nor\nel\nin\nes\n.\nF\nor\nm\ner\nve\nrt\nic\nal\nan\nd\nh\nor\niz\non\nta\nl\nd\nim\nen\nsi\non\ns\nof\ngl\nac\nie\nrs\n.\n189\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nReferences\nANDERSEN, B. G., DENTON, G. H. and LOWELL, T. V. (1999)\nGlacial geomorphologic maps of Llanquihue drift in the area of the\nsouthern Lake District, Chile, Geografiska Annaler, 81A, 155–166.\nANIYA, M. (1995) Holocene glacial chronology in Patagonia: Tyndall and\nUpsala Glaciers, Arctic, Antarctic and Alpine Research, 27, 311–322.\nANIYA, M. (1999) Recent glacier variations of the Hielos Patagonicos,\nSouth America, and their contribution to sea-level change, Arctic,\nAntarctic and Alpine Research, 31, 165–173.\nBENN, D. and CLAPPERTON, C. M. (2000) Pleistocene glacitectonic\nlandforms and sediments around central Magellan Strait, southernmost\nChile: evidence for fast outlet glaciers with cold-based margins,\nQuaternary Science Reviews, 19, 591–612.\nBENNETT, K. D., HABERLE, S. G. and LUMLEY, S. H. (2000)\nThe Last Glacial-Holocene transition in Southern Chile, Science, 290,\n325–328.\nBENTLEY, M. (1997) Relative and radiocarbon chronology of two former\nglaciers in the Chilean Lake District, Journal of Quaternary Science, 12,\n25–33.\nBENTLEY, M., SUGDEN, D., HULTON, N. and MCCULLOCH,\nR. (2005) The landforms and pattern of deglaciation in the Strait of\nMagellan and Baha Intil, southernmost South America, Geografiska\nAnnaler, 87A, 313–334.\nCALDENIUS, C. C. (1932) Las glaciaciones cuaternarios en la Patagonia\ny Tierra del Fuego, Geografiska Annaler, 14, 1–164 (English summary, p.\n144–157).\nCLAPPERTON, C. M. (1989) Asymmetrical drumlins in Patagonia,\nChile, Sedimentary Geology, 62, 387–398.\nCLAPPERTON, C. M., SUGDEN, D., KAUFMAN, D. S. and\nMCCULLOCH, R. D. (1995) The Last Glaciation in Central Magellan\nStrait, Southernmost Chile, Quaternary Research, 44, 133–148.\nCLARK, C. D. (1997) Reconstructing the evolutionary dynamics of\nformer ice sheets using multi-temporal evidence, remote sensing and GIS,\nQuaternary Science Reviews, 16, 1067–1092.\n190\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nCORONATO, A. M. (1995) The last Pleistocene Glaciation in tributary\nvalleys of the Beagle Channel, Southernmost South America, Quaternary\nof South America and Antarctic Peninsula, 9, 153–171.\nCORONATO, A. M., MARTINEZ, O. and RABASSA, J. (2004)\nGlaciations in Argentine Patagonia, southern South America, In Ehlers,\nJ. and Gibbard, P. L., (eds.) Pleistocene Glaciations: Extent and\nChronology, INQUA Working Group 5, Elsevier, Amsterdam, pp. 49–67.\nDENTON, G., LOWELL, T., HEUSSER, C., SCHLU¨CHTER, C.,\nANDERSEN, B., HEUSSER, L., MORENO, P. and\nMARCHANT, D. R. (1999) Geomorphology, stratigraphy and\nradiocarbon chronology of Llanquihue drift in the area of the Southern\nLake District, Seno Reloncav and Isla de Chiloe´, Chile, Geografiska\nAnnaler, 81A, 167–229.\nDOUGLASS, D. C., SINGER, B. S., KAPLAN, M. R., ACKERT,\nR. P., MICKELSON, D. M. and CAFFEE, M. W. (2005) Evidence\nof early Holocene glacial advances in southern South America from\ncosmogenic surface-exposure dating, Geology, 33, 237–240.\nDOUGLASS, D. C., SINGER, B. S., KAPLAN, M. R.,\nMICKELSON, D. M. and CAFFEE, M. W. (2006) Cosmogenic\nnuclide surface exposure dating of boulders on last-glacial and late-glacial\nmoraines, Lago Buenos Aires, Argentina: Interpretative strategies and\npaleoclimate implications, Quaternary Geochronology, 1, 43–58.\nESCOBAR, F., VIDAL, F., GARI´N C. and NARUSE, R. (1992)\nWater balance in the Patagonian Icefield, In Naruse, R. and Aniya,\nM., (eds.) Glaciological Researches in Patagonia, Japanese Society of\nSnow and Ice, pp. 109–119.\nFOGWILL, C. J. and KUBIK, P. W. (2005) A glacial stage spanning\nthe Antarctic Cold Reversal in Torres del Paine (51◦S), Chile, based on\npreliminary cosmogenic exposure ages, Geografiska Annaler, 87A,\n403–408.\nGLASSER, N. F., HARRISON, S., IVY-OCHS, S., DULLER, G.\nA. T. and KUBIK, P. (2006) Evidence from the Rio Bayo valley on the\nextent of the North Patagonian Icefield during the Late\nPleistocene-Holocene transition, Quaternary Research, 65, 70–77.\n191\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nGLASSER, N. F., HARRISON, S., WINCHESTER, V. and ANIYA,\nM. (2004) Late Pleistocene and Holocene palaeoclimate and glacier\nfluctuations in Patagonia, Global and Planetary Change, 43, 79–101.\nGLASSER, N. F. and JANSSON, K. N. (2005) Fast-flowing outlet\nglaciers of the Last Glacial Maximum Patagonian Icefield, Quaternary\nResearch, 63, 206–211.\nGLASSER, N. F., JANSSON, K. N., HARRISON, S. and\nKLEMAN, J. (2008) The glacial geomorphology and Pleistocene history\nof South America between 38◦S and 56◦S, Quaternary Science Reviews,\n27(3-4), 365–390.\nGLASSER, N. F., JANSSON, K. N., HARRISON, S. and RIVERA,\nA. (2005) Geomorphological evidence for variations of the North\nPatagonian Icefield during the Holocene, Geomorphology, 71, 263–277.\nHAJDAS, I., BONANI, G., MORENO, P. and ARIZTEGUI, D.\n(2003) Precise radiocarbon dating of Late-Glacial cooling in mid-latitude\nSouth America, Quaternary Research, 59, 70–78.\nHEUSSER, C. (1989a) Climate and chronology of Antarctica and\nadjacent South America over the past 30,000 yr, Palaeogeography,\nPalaeoclimatology, Palaeoecology, 76, 31–37.\nHEUSSER, C. (1989b) Late Quaternary vegetation and climate of\nsouthern Tierra del Fuego, Quaternary Research, 31, 396–406.\nHEUSSER, C. (1989c) Southern westerlies during the last glacial\nmaximum, Quaternary Research, 31, 423–425.\nHEUSSER, C. (1990) Ice age vegetation and climate of subtropical Chile,\nPalaeogeography, Palaeoclimatology, Palaeoecology, 80, 107–127.\nHEUSSER, C. (1998) Deglacial palaeoclimate of the American sector of\nthe Southern Ocean: Late Glacial-Holocene records from the latitude of\nCanal Beagle (55◦S), Argentine Tierra del Fuego, Palaeogeography,\nPalaeoclimatology, Palaeoecology, 141, 277–301.\nHEUSSER, C. (2003) Ice Age Southern Andes. A chronicle of\npalaeocological events, In Rose, J., (ed.) Developments in Quaternary\nScience, 3, Elsevier, Amsterdam, p. 240.\nHEUSSER, C. and RABASSA, J. (1987) Cold climatic episode of\nYounger Dryas age in Tierra del Fuego, Nature, 328, 609–611.\n192\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nHUBBARD, A., HEIN, A. S., KAPLAN, M. R., HULTON, N. R. J.\nand GLASSER, N. F. (2005) A modelling reconstruction of the late\nglacial maximum ice sheet and its deglaciation in the vicinity of the\nNorthern Patagonian Icefield, South America, Geografiska Annaler, 87A,\n375–391.\nHULTON, N. R. J., PURVES, R. S., MCCULLOCH, R. D.,\nSUGDEN, D. E. and BENTLEY, M. J. (2002) The Last Glacial\nMaximum and deglaciation in southern South America, Quaternary\nScience Reviews, 21, 233–241.\nHULTON, N. R. J., SUGDEN, D. E., PAYNE, A. J. and\nCLAPPERTON, C. M. (1994) Glacier modelling and the climate of\nPatagonia during the last glacial maximum, Quaternary Research, 42,\n1–19.\nJANSSON, K. N. and GLASSER, N. F. (2005) Using Landsat 7\nETM+ imagery and Digital Terrain Models for mapping glacial\nlineaments on former ice sheet beds, International Journal of Remote\nSensing, 26, 3931–3941.\nKAPLAN, M. R., ACKERT, R. P., SINGER, B. S., DOUGLASS,\nD. C. and KURZ, M. D. (2004) Cosmogenic nuclide chronology of\nmillenial-scale glacial advances during O-isotope Stage 2 in Patagonia,\nBulletin of the Geological Society of America, 116, 308–321.\nKAPLAN, M. R., CORONATO, A. M., HULTON, N. R. J.,\nRABASSA, J. O., KUBIK, P. W. and FREEMAN, S. P. H. T.\n(2007) Cosmogenic nuclide measurements in southernmost South America\nand implications for landscape change, Geomorphology, 87, 284–301.\nKAPLAN, M. R., DOUGLASS, D. C., SINGER, B. S., ACKERT,\nR. P. and CAFFEE, M. W. (2005) Cosmogenic nuclide chronology of\npre-last glacial maximum moraines at Lago Buenos Aire, 46◦S,\nArgentina, Quaternary Research, 63, 301–315.\nLJUNGNER, E. (1948) East-west balance of the Quaternary ice caps in\nPatagonia and Scandinavia, Bulletin of the Geological Institute,\nUniversity of Uppsala, 33, 12–96.\nMARDEN, C. J. (1993) Lateglacial and Holocene variations of the Grey\nGlacier, an outlet of the South Patagonian Icefield, Scottish Geographical\nMagazine, 109, 27–31.\n193\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nMARDEN, C. J. (1997) Late-glacial fluctuations of South Patagonian\nicefield, Torres del Paine National Park, southern Chile, Quaternary\nInternational, 38\/39, 61–68.\nMARDEN, C. J. and CLAPPERTON, C. M. (1995) Fluctuations of\nthe Southern Patagonian Icefield during the last glaciation and the\nHolocene, Journal of Quaternary Science, 10, 197–209.\nMARKGRAF, V. (1993) Paleoenvironments and paleoclimates in Tierra\ndel Fuego and southernmost Patagonia, South America,\nPalaeogeography, Palaeoclimatology, Palaeoecology, 102, 53–68.\nMASSAFFERO, J. and BROOKS, S. J. (2002) Response of\nchironomids to Late Quaternary environmental change in the Taitao\nPeninsula, southern Chile, Journal of Quaternary Science, 17, 101–111.\nMASSAFFERO, J., BROOKS, S. J. and HABERLE, S. G. (2005)\nThe dynamics of chironomid assemblages and vegetation during the Late\nQuaternary at Laguna Facil, Chonos Archipelago, southern Chile,\nQuaternary Science Reviews, 24, 2510–2522.\nMCCULLOCH, R. D., BENTLEY, M. J., PURVES, R. S.,\nSUGDEN, D. E., HULTON, N. R. J. and CLAPPERTON, C. M.\n(2000) Climatic inferences from glacial and palaeoecological evidence at\nthe last glacial termination, southern South America, Journal of\nQuaternary Science, 15, 409–417.\nMCCULLOCH, R. D., FOGWILL, C. J., SUGDEN, D.,\nBENTLEY, M. and KUBIK, P. (2005) Chronology of the Last\nGlaciation in Central Strait of Magellan and Baha Intil, Southernmost\nSouth America, Geografiska Annaler, 87A(2), 289–312.\nMEGLIOLI, A. (1992) Glacial Geology of Southernmost Patagonia, the\nStrait of Magellan and northern Tierra del Fuego, unpublished PhD\nThesis, Lehigh University, Bethlehem, USA.\nMERCER, J. H. (1965) Glacier variations in Southern Patagonia,\nGeographical Review, 55, 390–413.\nMERCER, J. H. (1968) Variations of some Patagonian glaciers since the\nLate-Glacial, American Journal of Science, 266, 91–109.\nMERCER, J. H. (1969) Glaciation in Southern Argentina more than two\nmillion years ago, Science, 164, 823–825.\n194\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nMERCER, J. H. (1976) Glacial history of southernmost South America,\nQuaternary Research, 6, 125–166.\nMORENO, P. (1997) Vegetation and climate near lago Llanquihue in the\nChilean lake District between 20,200 and 9,500 14C yr BP, Journal of\nQuaternary Science, 12, 485–500.\nMO¨RNER, N. A. and SYLWAN, C. (1989) Magnetostratigraphy of the\nPatagonian moraine sequence at Lago Buenos Aires, Journal of South\nAmerican Earth Sciences, 2, 385–389.\nPORTER, S. C. (1981) Pleistocene glaciation in the southern Lake\nDistrict of Chile, Quaternary Research, 16, 263–292.\nPORTER, S. C., CLAPPERTON, C. M. and SUGDEN, D. E.\n(1992) Chronology and dynamics of deglaciation along and near the\nStrait of Magellan, southernmost South America, Sveriges Geologiska\nUnderso¨kning, Series C 81, 233–239.\nRABASSA, J., CORONATO, A. M., BUJALESKY, G.,\nROIG JUNENT, F., BORROMEI, A. and QUATROCCHIO, M.\n(2000) Quaternary of Tierra del Fuego, Southernmost South America: an\nupdated review, Quaternary International, 68-71, 217–240.\nRABASSA, J., CORONATO, A. M. and SALEMME, M. (2005)\nChronology of the Late Cenozoic Patagonian glaciations and their\ncorrelation with biostratigraphic units of the Pampean region\n(Argentina), Journal of South American Earth Sciences, 20, 81–103.\nRABASSA, J., HEUSSER, C. and RUTTER, N. (1990) Late-Glacial\nand Holocene of Argentine Tierra del Fuego, Quaternary of South\nAmerica and Antarctic Peninsula, 7, 327–351.\nRIVERA, A., BENHAM, T., CASASSA, G., BAMBER, J. and\nDOWDESWELL, J. A. (2007) Ice elevation and areal changes of\nglaciers from the Northern Patagonia Icefield, Chile, Global and\nPlanetary Change, 59 (1-4), 126–137.\nSINGER, B. S., ACKERT, R. P. and GUILLOU, H. (2004) 40Ar\/39Ar\nand K-Ar chronology of Pleistocene glaciations in Patagonia, Geological\nSociety of America Bulletin, 116, 434–450.\nSMITH, M. J. and WISE, S. M. (2007) Problems of bias in mapping\nlinear landforms from satellite imagery, International Journal of Applied\nEarth Observation and Geoinformation, 9, 65–78.\n195\nJournal of Maps, 2008, 175-196 Glasser, N.F. & Jansson, K.N.\nSTRELIN, J. A. and MALAGNINO, E. C. (2000) Late-Glacial history\nof Lago Argentino, Argentina, and age of the Puerto Bandera Moraines,\nQuaternary Research, 54, 339–347.\nSUGDEN, D. E., HULTON, N. R. J. and PURVES, R. S. (2002)\nModelling the inception of the Patagonian ice sheet, Quaternary\nInternational, 95-96, 55–64.\nTURNER, K. J., FOGWILL, C. J., MCCULLOCH, R. D. and\nSUGDEN, D. E. (2005) Deglaciation of the eastern flank of the North\nPatagonian Icefield and associated continental-scale lake diversions,\nGeografiska Annaler, 87A, 363–374.\nWENZENS, G. (1999) Fluctuations of outlet and valley glaciers in the\nSouthern Andes (Argentina) during the past 13,000 years, Quaternary\nResearch, 51, 238–247.\nWINCHESTER, V., HARRISON, S. and BAILEY, R. (2005) A 2.5\nkyr luminescence date for a terminal moraine in the Leones valley,\nsouthern Chile, Journal of Glaciology, 51, 186–188.\n196\n"}