{"doi":"10.5194\/tc-5-259-2011","coreId":"52431","oai":"oai:nora.nerc.ac.uk:14116","identifiers":["oai:nora.nerc.ac.uk:14116","10.5194\/tc-5-259-2011"],"title":"Ice-stream response to ocean tides and the form of the basal sliding law","authors":["Gudmundsson, G.H."],"enrichments":{"references":[{"id":716862,"title":"A numerical study of glacier advance over deforming till,","authors":[],"date":"2010","doi":null,"raw":null,"cites":null},{"id":723470,"title":"A.: Basal mechanics of ice streams: Insights from the stick-slip motion of Whillans Ice Stream, West Antarctica,","authors":[],"date":"2009","doi":"10.1029\/2008JF001035","raw":null,"cites":null},{"id":710939,"title":"Analysis of GPS data from an Antarctic ice stream, in: Observing our Changing Earth, edited by:","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":719248,"title":"Creep and fracture of Ice,","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":711834,"title":"Creep and relaxation of nonlinear viscoelastic materials,","authors":[],"date":"1976","doi":null,"raw":null,"cites":null},{"id":720086,"title":"Elastic and Inelastic Stress Analysis,","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":713881,"title":"Flexure of a floating ice tongue,","authors":[],"date":"1969","doi":null,"raw":null,"cites":null},{"id":710347,"title":"Flow of the Ross Ice Shelf, Antarctica, is modulated by the ocean tide,","authors":[],"date":"2010","doi":null,"raw":null,"cites":null},{"id":713158,"title":"Fortnightly variations in the flow velocity of Rutford Ice Stream,","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":721308,"title":"Glacier flexure and the position of groundin lines: Measurements by tilmeter on","authors":[],"date":"1984","doi":null,"raw":null,"cites":null},{"id":717680,"title":"Ice flow modulated by tides at up to annual periods at Rutford Ice Stream,","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":708711,"title":"Ice stream D flow speed is strongly modulated by the tide beneath the Ross Ice Shelf,","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":713733,"title":"Ice-flow velocities on Rutford Ice Stream, West Antarctica, are stable over decadal timescales,","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":714820,"title":"Interactions between ice and ocean observed with phase-sensitive radar near an Antarctic ice shelf grounding line,","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":715607,"title":"Non-linear responses of Rutford Ice Stream, Antarctica, to semi-diurnal and diurnal tidal forcing,","authors":[],"date":"2010","doi":null,"raw":null,"cites":null},{"id":716035,"title":"Nonlinear interaction between ocean tides and the Larsen C Ice Shelf system,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":716418,"title":"Ocean tides in the Weddell Sea: new observations on the Filchner-Ronne and Larsen C ice shelves and model validation,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":709924,"title":"Properties of ice,","authors":[],"date":"1961","doi":null,"raw":null,"cites":null},{"id":720906,"title":"Re´sultats expe´rimentaux sur la dynamique da la glace et leurs correlations avec le mouvement et la pe´trographie des glaciers.,","authors":[],"date":"1958","doi":null,"raw":null,"cites":null},{"id":720499,"title":"Results of preliminary experiments on the plasticity of ice crystals,","authors":[],"date":"1954","doi":null,"raw":null,"cites":null},{"id":718850,"title":"Seismic Exploration in cold regions,","authors":[],"date":"1972","doi":null,"raw":null,"cites":null},{"id":715177,"title":"Sensitivity of 21st century sea level to ocean-induced thinning","authors":[],"date":"2010","doi":null,"raw":null,"cites":null},{"id":722989,"title":"Simultaneous teleseismic and geodetic observations of the stick-slip motion of an Antarctic ice stream,","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":719707,"title":"Stick-slip behavior of ice streams: modeling investigations,","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":712726,"title":"The creep of polycrystalline ice,","authors":[],"date":"1955","doi":null,"raw":null,"cites":null},{"id":721675,"title":"The location of the grounding zone of Evans Ice Stream, Antarctica, investigated using SAR interferometry and modelling,","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":714255,"title":"Theoretical glaciology; material science of ice and the mechanics of glaciers and ice sheets,","authors":[],"date":"1983","doi":null,"raw":null,"cites":null},{"id":710824,"title":"Theory of viscoelasticity,","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":718093,"title":"Tidal bending of glaciers: a linear viscoelastic approach,","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":722582,"title":"Tidal flexure at ice shelf margins,","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":716913,"title":"Tidal flexure of Jakobshavns Glacier, West Greenland,","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":708291,"title":"Tidal influence on Rutford Ice Stream, West Antarctica: observations of surface flow and basal processes from closely-spaced GPS and passive seismic stations,","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":709135,"title":"Tidally controlled stick-slip discharge of a West Antartic Ice Stream,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":709538,"title":"Tidally driven stick-slip motion in the mouth of Whillans Ice","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":711414,"title":"Tide-induced lateral movement of","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":722147,"title":"Tide-induced perturbations of glacier velocities,","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":713316,"title":"Tides and the flow of Rutford Ice Stream,","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":718497,"title":"Tides in the Weddell Sea, in: Ocean, Ice, and Atmosphere: Interactions at the Antarctic Continental Margin, edited by","authors":[],"date":"2011","doi":null,"raw":null,"cites":null},{"id":712328,"title":"Tides on Filchner-Ronne Ice Shelf from ERS radar altimetry,","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":717319,"title":"Viscoelastic fluid relation for the deformation of ice,","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":714579,"title":"Viscoelastic properites of ice,","authors":[],"date":"1956","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011","abstract":"The response of ice streams to ocean tides is investigated. Numerical modelling experiments are conducted using a two-dimensional flow-line model of coupled ice-stream and ice-shelf flow. The model includes all components of the equilibrium equations, and uses a non-linear viscoelastic constitutive equation for ice. Basal sliding is simulated with a Weertman type sliding law where basal sliding is proportional to some power of the basal shear stress. The response of ice-streams to tidal forcing is found to be profoundly affected by mechanical conditions at the bed. For a non-linear sliding law, a non-linear interaction between the two main semi-diurnal tidal constituents (M2 and S2) can give rise to a significant perturbation in ice-stream flow at the lunisolar synodic fortnightly (MSf) tidal period of 14.76 days. For a linear sliding law, in contrast, no such modulation in flow at the MSf frequency is found. For vertical ocean tides of the type observed on Filchner-Ronne Ice Shelf (FRIS), the amplitude of the horizontal modulation in ice-stream flow at the MSf frequency resulting from a non-linear interaction between the S2 and M2 tidal constitutes can be larger than the direct response at the S2 and the M2 frequencies. In comparison the non-linear interaction between K1 and O1 tidal components is weak. As a consequence, modelled ice-stream response to mixed oceanic tides of the type found on FRIS is stronger at the MSf period of 14.76 days than at both the semi-diurnal and diurnal frequencies, while at the same time almost absent at the similar Mf period of 13.66 days. The model results compare favourably with measurements of tidally induced flow variations on Rutford Ice Stream (RIS), West Antarctica. On RIS a strong tidal response is found at the MSf frequency with a smaller response at the semi-diurnal and diurnal frequencies, and almost no response at the Mf frequency. A non-linear viscous sliding law appears to have the potential to fully explain these observations.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/52431.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/14116\/1\/tc-5-259-2011.pdf","pdfHashValue":"8ca250476f08ef25ac3e5bc3cb61a9dc4ba58d7b","publisher":"Copernicus","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:14116<\/identifier><datestamp>\n      2012-11-22T12:19:31Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533230<\/setSpec><setSpec>\n      7375626A656374733D533135<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/14116\/<\/dc:relation><dc:title>\n        Ice-stream response to ocean tides and the form of the basal sliding law<\/dc:title><dc:creator>\n        Gudmundsson, G.H.<\/dc:creator><dc:subject>\n        Marine Sciences<\/dc:subject><dc:subject>\n        Glaciology<\/dc:subject><dc:description>\n        The response of ice streams to ocean tides is investigated. Numerical modelling experiments are conducted using a two-dimensional flow-line model of coupled ice-stream and ice-shelf flow. The model includes all components of the equilibrium equations, and uses a non-linear viscoelastic constitutive equation for ice. Basal sliding is simulated with a Weertman type sliding law where basal sliding is proportional to some power of the basal shear stress. The response of ice-streams to tidal forcing is found to be profoundly affected by mechanical conditions at the bed. For a non-linear sliding law, a non-linear interaction between the two main semi-diurnal tidal constituents (M2 and S2) can give rise to a significant perturbation in ice-stream flow at the lunisolar synodic fortnightly (MSf) tidal period of 14.76 days. For a linear sliding law, in contrast, no such modulation in flow at the MSf frequency is found. For vertical ocean tides of the type observed on Filchner-Ronne Ice Shelf (FRIS), the amplitude of the horizontal modulation in ice-stream flow at the MSf frequency resulting from a non-linear interaction between the S2 and M2 tidal constitutes can be larger than the direct response at the S2 and the M2 frequencies. In comparison the non-linear interaction between K1 and O1 tidal components is weak. As a consequence, modelled ice-stream response to mixed oceanic tides of the type found on FRIS is stronger at the MSf period of 14.76 days than at both the semi-diurnal and diurnal frequencies, while at the same time almost absent at the similar Mf period of 13.66 days. The model results compare favourably with measurements of tidally induced flow variations on Rutford Ice Stream (RIS), West Antarctica. On RIS a strong tidal response is found at the MSf frequency with a smaller response at the semi-diurnal and diurnal frequencies, and almost no response at the Mf frequency. A non-linear viscous sliding law appears to have the potential to fully explain these observations.\\ud\n<\/dc:description><dc:publisher>\n        Copernicus<\/dc:publisher><dc:date>\n        2011<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by<\/dc:rights><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/14116\/1\/tc-5-259-2011.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Gudmundsson, G.H..  2011  Ice-stream response to ocean tides and the form of the basal sliding law.   The Cryosphere, 5 (1). 259-270.  https:\/\/doi.org\/10.5194\/tc-5-259-2011 <https:\/\/doi.org\/10.5194\/tc-5-259-2011>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.the-cryosphere.net\/5\/259\/2011\/tc-5-259-2011.html<\/dc:relation><dc:relation>\n        10.5194\/tc-5-259-2011<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/14116\/","http:\/\/www.the-cryosphere.net\/5\/259\/2011\/tc-5-259-2011.html","10.5194\/tc-5-259-2011"],"year":2011,"topics":["Marine Sciences","Glaciology"],"subject":["Publication - Article","PeerReviewed"],"fullText":"The Cryosphere, 5, 259–270, 2011\nwww.the-cryosphere.net\/5\/259\/2011\/\ndoi:10.5194\/tc-5-259-2011\n© Author(s) 2011. CC Attribution 3.0 License.\nThe Cryosphere\nIce-stream response to ocean tides and the form of the basal sliding\nlaw\nG. H. Gudmundsson\nBritish Antarctic Survey, High Cross, Madingley Rd., Cambridge CB3 0ET, UK\nReceived: 15 November 2010 – Published in The Cryosphere Discuss.: 8 December 2010\nRevised: 24 March 2011 – Accepted: 24 March 2011 – Published: 29 March 2011\nAbstract. The response of ice streams to ocean tides is inves-\ntigated. Numerical modelling experiments are conducted us-\ning a two-dimensional flow-line model of coupled ice-stream\nand ice-shelf flow. The model includes all components of\nthe equilibrium equations, and uses a non-linear viscoelastic\nconstitutive equation for ice. Basal sliding is simulated with\na Weertman type sliding law where basal sliding is propor-\ntional to some power of the basal shear stress. The response\nof ice-streams to tidal forcing is found to be profoundly af-\nfected by mechanical conditions at the bed. For a non-linear\nsliding law, a non-linear interaction between the two main\nsemi-diurnal tidal constituents (M2 and S2) can give rise to\na significant perturbation in ice-stream flow at the lunisolar\nsynodic fortnightly (MSf) tidal period of 14.76 days. For a\nlinear sliding law, in contrast, no such modulation in flow\nat the MSf frequency is found. For vertical ocean tides of\nthe type observed on Filchner-Ronne Ice Shelf (FRIS), the\namplitude of the horizontal modulation in ice-stream flow\nat the MSf frequency resulting from a non-linear interaction\nbetween the S2 and M2 tidal constitutes can be larger than\nthe direct response at the S2 and the M2 frequencies. In\ncomparison the non-linear interaction between K1 and O1\ntidal components is weak. As a consequence, modelled ice-\nstream response to mixed oceanic tides of the type found on\nFRIS is stronger at the MSf period of 14.76 days than at both\nthe semi-diurnal and diurnal frequencies, while at the same\ntime almost absent at the similar Mf period of 13.66 days.\nThe model results compare favourably with measurements of\ntidally induced flow variations on Rutford Ice Stream (RIS),\nWest Antarctica. On RIS a strong tidal response is found\nat the MSf frequency with a smaller response at the semi-\ndiurnal and diurnal frequencies, and almost no response at\nthe Mf frequency. A non-linear viscous sliding law appears\nto have the potential to fully explain these observations.\nCorrespondence to: G. H. Gudmundsson\n(ghg@bas.ac.uk)\n1 Introduction\nObservations on a number of ice streams have shown their\nflow to react sensitively to ocean tides (Anandakrishnan\net al., 2003; Bindschadler et al., 2003a,b; Gudmundsson,\n2006; Murray et al., 2007; Wiens et al., 2008). In some in-\nstances, tidally induced variations in horizontal speed have\nbeen detected tens of kilometres upstream from the ground-\ning line causing a periodic variation in flow speeds of up to\n20%, depending on location (Gudmundsson, 2006). These\nvariations are therefore neither small nor limited to the zone\nof elastic flexure around the grounding line. Significant vari-\nations in horizontal speed due to tidal action have also been\nobserved downstream of the grounding line on floating ice\nshelves (Doake et al., 2002; Brunt et al., 2010; King et al.,\n2011a).\nThese observations are interesting and intriguing for a\nnumber of reasons. They demonstrate that changes in\nstresses downstream of the grounding line can have a sig-\nnificant and immediate effect on the large-scale flow regime\nof active ice streams. They also challenge our ability to the-\noretically characterise ice-stream dynamics and have the po-\ntential to provide an insight into the mechanical interaction\nbetween ocean, ice shelves, and ice streams. Previous mod-\nelling work of tide-induced lateral movement on ice streams\nhave invoked specific assumptions about till rheology (e.g.\nBindschadler et al., 2003a; Gudmundsson, 2007; Winberry\net al., 2009; Sergienko et al., 2009; King et al., 2010) and\nice-stream response to tides can be thought of as a natural ex-\nperiment providing insight into the mechanics of ice-stream\nflow.\nRutford Ice Stream (RIS), West Antarctica, is an example\nof an ice stream where tides are known to significantly af-\nfect flow speeds. A puzzling aspect of the tidal response of\nRIS is the fact that the largest tidal modulation takes place\nover long tidal periods. (Long period tides are defined as\nhaving periods longer than those of any diurnal tides, i.e.\nperiods significantly larger than one day.) The presence of\nPublished by Copernicus Publications on behalf of the European Geosciences Union.\n260 G. H. Gudmundsson: Tides and ice stream flow\na long-period tidally modulated ice-stream flow is intrigu-\ning because long-periodic ocean tidal amplitudes are small\nin comparison with the main semi-diurnal (S2 and M2) and\nthe main diurnal components (K1 and O1). For example, a\ntidal analysis of a 55-day GPS record obtained about 20 km\ndownstream of the RIS grounding line shows vertical ampli-\ntudes of MSf and Mf to be statistically insignificant, and no\nlarger than few cm at the most, and the amplitudes of the S2,\nM2, K1, and O1 all to be on the order of a meter. Neverthe-\nless, the response in ice-stream flow is stronger at the MSf\nperiod of 14.76 days than at any of the semi-diurnal and di-\nurnal periods (Gudmundsson, 2006). A linear system, when\nforced over a given range of frequencies, will only produce a\nresponse at those same frequencies. RIS responds strongly at\nfrequencies absent in the forcing, a clear evidence for some\nsort of a non-linear system response.\nVertical motion of a floating ice shelf is generally a faith-\nful representation of the response of the ocean free-surface\nheight to tide. The only exception to this is the region in the\nvicinity of the grounding line where stresses within the ice\ncan support some of the weight of the ice column. Here the\nmain focus is not on this vertical aspect of the ice motion,\nbut on the horizontal flow response to tide of the grounded\nice upstream from the grounding line.\nThis study is an extension of a previous modelling ef-\nfort (Gudmundsson, 2007) suggesting that the observed long-\nperiod tidally induced variations in flow on RIS are indica-\ntive of non-linear basal processes. The modelling work in\nGudmundsson (2007) was done using a simple conceptual\nmodel of the interaction between ocean tides and ice stream\nflow. On the basis of that modelling work, it was concluded\nthat a non-linear basal boundary condition of the type com-\nmonly used in glaciological modelling work, has the poten-\ntial to produce the type of non-linear response observed on\nRIS. This study extends and complements earlier modelling\nefforts by including a number of processes not included pre-\nviously. The ice is modelled as a non-linear visco-elastic\nmedium and the effects of all the components of the equi-\nlibrium equations are included in the numerical model. In\ncontrast, in Gudmundsson (2007), the contribution of ice\ndeformation to ice-stream flow was ignored, and the basal-\nstress perturbation was not calculated directly but rather\nparametrised in terms of the ocean tidal amplitude. Here the\nbasal-stress perturbation is calculated from first principles,\ni.e. by solving the field equations describing the conserva-\ntion of mass and momentum for given rheological models of\nice and subglacial till.\n2 Data\nAlthough the main focus of this study is on investigating\nthe general role of basal control on ice-stream response to\noceanic tides, and not on reproducing the exact response\ncurves from any one particular ice stream, data collected\n−20 −10 0 10 20 30 40 50\n−0.4\n−0.3\n−0.2\n−0.1\n0\n0.1\n0.2\n0.3\n0.4\n0.5\nday of year 2004\n(m\n)\n \n \n \nR−20\nR+00\nR+20\nR+40\nFig. 1. Linearly detrended in-line displacements on Rutford Ice\nStream, West Antarctica. Displacements are shown at locations\nalong the medial line at a distance of 20 km downstream of the\ngrounding line (R–20), at the grounding line (R+00), and at dis-\ntances of 20 and 40 km upstream from the grounding line (R+20\nand R+40, respectively). The displacement curves shown are based\non a tidal fit to the original measured data.\non RIS is most pertinent to this modelling study. There-\nfore, some of the observational data from RIS are shown\nin Figs. 1 and 2. A more detailed discussion of these data,\nand other similar data sets from the same ice stream, are\nfound in Gudmundsson (2006, 2007); Murray et al. (2007);\nAdalgeirsdo´ttir et al. (2008); Dach et al. (2009); King et al.\n(2010).\nFigure 1 shows linearly detrended displacements curves\nfrom RIS. The displacements are along the mean flow direc-\ntion at each site. In Fig. 2 calculated long-periodic (longer\nthan than one day) tidal modulations in flow speeds are de-\npicted for the same sites as in Figure 1. As seen the in Fig. 1\nthere is a prominent long-periodic modulation found in the\ndisplacement curves from RIS.\nAs is evident from a simple inspection of the data shown\nin Fig. 1, and as quantified in a more detailed tidal analy-\nsis (Gudmundsson, 2006), the long-period amplitudes at all\nsites are larger than any of the semi-diurnal and the diur-\nnal tidal amplitudes. As an example, a tidal analysis of a\nfurther 71 day long GPS record collected 73 km upstream\nfrom the grounding line in the period from December 2005\nto mid February 2006 shows the MSf tidal amplitude to be\nseveral times larger than any of the other tidal constituents.\nIn that record, the MSf amplitude was estimated to be 4.7\ntimes larger than that of the similarly period Mf tide (The\nperiod of the MSf tide is 14.76 days, and that of the Mf tide\n13.66 days). Other GPS record from RIS give similar results\n(Murray et al., 2007; King et al., 2010). At all sites shown\nin Fig. 1, the MSf tidal amplitudes are on the order of a few\ndecimetres, with amplitudes decreasing upstream from the\ngrounding line.\nThe Cryosphere, 5, 259–270, 2011 www.the-cryosphere.net\/5\/259\/2011\/\nG. H. Gudmundsson: Tides and ice stream flow 261\n−20 −10 0 10 20 30 40 50\n0.85\n0.9\n0.95\n1\n1.05\n1.1\n1.15\n1.2\n1.25\n \n(m\n\/da\ny)\nday of year 2004\n \n \nR−20\nR+00\nR+20\nR+40\nFig. 2. Long-periodic tidal modulation in surface speeds on Rutford\nIce Stream, West Antarctica. The velocities were calculated from\nthe tidal fit to surface displacements shown in Fig. 1, including only\nthe long-period tidal constituents.\nThe long-period tidal signal arrives at slightly different\ntimes at different locations (see Fig. 2). In Gudmundsson\n(2006) an order-of-magnitude estimate of the phase velocity\nof 1 m s−1 is given. A more detailed analysis of the same\ndata set indicates that although this estimate of phase veloc-\nity is correct within an order of magnitude, the actual prop-\nagation speed could be anywhere between 0.2 to 1 m\/s. The\nconsiderable errors in this estimate are mainly due to the lim-\nited length of available temporal coinciding records of only\nabout 50 days. Estimating the phase shifts is confounded by\nthe fact that the signal is dispersive and phase shifts not in-\ndependent of the tidal period. Consequently, an estimate of\npropagation speed based on cross correlation of displacement\ncurves from different sites does not give the same result as a\ncalculation derived from relative phase shift estimates for in-\ndividual tidal components at different sites. The estimate of\n0.2 to 1 m s−1 is based on an analysis of the phase relation-\nship of the MSf tide at four different sites along the medial\nline spaced 10 km apart.\nAdalgeirsdo´ttir et al. (2008) give an estimate of 10± 4\nm s−1 for the phase velocity based on data collected on RIS\nat sites approximately 3 km apart. The difference between\nthe estimate by Adalgeirsdo´ttir et al. (2008) of 10± 4 m s−1\nand the 0.2 to 1 m s−1 given above, appears too large to be\ndue to methodological differences only, and the source for\nthe discrepancy between these estimates is unclear.\nApart from these tidally induced variations in flow, there\nappears to be no significant temporal changes in the flow\nof RIS (Gudmundsson and Jenkins, 2009). There also ap-\npears to be no clear temporal pattern in basal seismicity re-\nlated to either tidal forcing or to the long-period variation\nin flow (H. Pritchard, personal communication, 2011). How-\never, there are conflicting reports on the relationship between\ntides and seismicity on RIS. Adalgeirsdo´ttir et al. (2008)\nFig. 3. Schematic showing an ice stream flowing into the ocean\nand forming an ice shelf. The pressure from the ocean acting on\nthe ice is depicted as red arrows. Tides cause temporal changes in\nthe oceanic forces and can lead to changes in ice-stream flow. Note\nthat the figure is only a schematic and that in model runs the actual\ndetailed model geometry is not as shown. Information on model\ngeometry for each numerical experiment is given in the text.\nconcluded that “there is no simple relationship between the\nocean tide and the velocity and basal seismicity of the ice\nstream”. On the other hand Murray et al. (2007) writes that\n“The ice stream has two-weekly cycles in downstream flow\nand basal seismicity”. Somewhat confusingly, Murray et al.\n(2007) gives the source of the two-weekly cycle in seismicity\nas Adalgeirsdo´ttir et al. (2008).\n3 Model\nThe model setup is shown schematically in Fig. 3. The nu-\nmerical model is a two-dimensional full Stokes flow-line\nmodel of ice-stream\/ice-shelf flow. The numerical calcu-\nlations were performed with the commercial finite element\nanalysis software MSC.Marc (MARC, 2010).\nThe field equations are\nDρ\nDt\n+ρvq,q = 0 (1)\nσij,j +fi = 0 (2)\nσij −σji = 0 (3)\nrepresenting the conservation of mass, linear momentum,\nand angular momentum, respectively, for a slowly moving\nmedium. In the above listed equations, D\/Dt denotes the ma-\nterial time derivative, vi are the components of the velocity\nvector, σij are the components of the Cauchy stress tensor,\nand fi are the components of the gravity force per volume.\nAll terms of the equations listed above are included in the\nnumerical model.\n3.1 Ice rheology\nOver tidal time scales ice behaves as a visco-elastic medium\n(Jellinek and Brill, 1956; Morland and Spring, 1981). Linear\nwww.the-cryosphere.net\/5\/259\/2011\/ The Cryosphere, 5, 259–270, 2011\n262 G. H. Gudmundsson: Tides and ice stream flow\nelastic models have been used to describe ice rheology over\ntidal periods, but the limitations of this approach have been\npointed out by Reeh (2003). In his study of tidal flexure,\nReeh (2003) used a linear visco-elastic four-element Burgers\nmodel to describe the rheology of ice. As a part of this study\nboth a non-linear four-element Burgers model, an extension\nof the Reeh (2003) model to non-linear viscous rheology, and\na non-linear two-element Maxwell model were used.\nAs explained in more detail in Appendix A, it was found\nthat the parameters of the two-element Maxwell model could\nbe selected in such a way as to closely mimic the rheological\nbehaviour of the four-element Burgers model over all times\nscales of interest in this study. Using parameter values sug-\ngested by Reeh (2003), the only significant differences be-\ntween these two models are for loading periods shorter than\nabout 100 s. As there is no appreciable tidal loading at such\nshort periods, all the modelling work presented here is based\non the simpler two-element Maxwell model. In comparison\nto the use of the Burgers model, the Maxwell model allowed\nthe selection of longer time steps and resulted in shorter com-\nputational times.\nFor the non-linear Maxwell rheological model the devia-\ntoric stresses, τij , and the deviatoric strains, eij , are related\nthrough\ne˙ij = 12G\n∇\nτ ij +Aτn−1τij , (4)\nwhere G is the bulk modulus of the Maxwell model, A is\na rate factor, and n the stress exponent (Christensen, 1982).\nThe deviatoric strains and deviatoric stresses are defined as\neij = \u000fij − 13δij \u000fpp, (5)\nand\nτij = σij − 13δijσpp, (6)\nrespectively, where \u000fij are the strains and σij the stresses.\nThe effective stress τ is defined as\nτ =√τpqτqp\/2,\ni.e. as the square root of the negative of the second invariant\nof the deviatoric stress tensor. The superscript ∇ denotes the\nupper convected time derivative, i.e.\n∇\nτ = ∂tτ+v ·∇τ−(∇v)T ·τ−τ ·∇v, (7)\nis the upper-convected time derivative of the deviatoric stress\ntensor τ , where v is the velocity.\nEquation (4) can also be written on the form\nτ+λ∇τ = 2ηe˙ (8)\nwhere\nλ= η\nG\n, (9)\nand\nη= τ\n1−n\n2A\n, (10)\nwhere λ is the effective relaxation time, and η the effective\nviscosity. These are referred to as “effective” quantities be-\ncause for n 6= 1 both λ and η are not material proprieties but\ndepend on the state of stress. For loading periods long in\ncomparison to the relaxation time λ, the constitutive relations\nis the usual Glen-Steinemann constitutive law (Steinemann,\n1954, 1958; Glen, 1955) commonly used in large-scale mod-\nelling of ice masses (see Eq. 4).\nAs is common in the treatment of viscoelastic materials\n(Shames and Cozzarelli, 1997) ice is considered elastic under\nhydrostatic pressure, i.e.\nσkk = 3K\u000fkk, (11)\nwhere K is the shear modulus of the Maxwell model.\nIn a number of glaciological studies of tidally induced de-\nformation, ice rheology has been approximated using linear\nelastic constitutive equations where τij = 2Geij and σii =\n3K\u000fii (e.g. Holdsworth, 1969; Lingle et al., 1981; Stephen-\nson, 1984; Vaughan, 1995; Sykes et al., 2009). For a vis-\ncoelastic material such as the upper convected Maxwell\nmodel given by Eqs. (4) and (11), one can define an effec-\ntive shear modulus Ge through τij = 2Geeij , and an effec-\ntive bulk modulus Ke, through σii = 3Ke\u000fii . However, these\neffective parameters will, in general, be dependent on time.\nUnder oscillating loading, for example, the effective shear\nand bulk modulus of a viscoelastic material are functions of\nthe loading period. Furthermore, for any viscoelastic mate-\nrial that responds purely elastically to hydrostatic pressure,\nthe corresponding effective Poisson’s ratio is also time de-\npendent and approaches 0.5 for slowly varying loads.\nBecause ice is viscoelastic over tidal periods, studies us-\ning linear elastic models describing tidal deformation of ice\nuse effective parameters that are not independent of the load-\ning period. It is therefore somewhat difficult to use values\nderived from such studies to constrain a visco-elastic model\nof rheology. For that reason the rheological values used here\nare primarily based on Reeh (2003), which appears to be the\nmost in-depth modelling study of visco-elastic behaviour of\nlarge ice masses done to date.\nAs shown in Appendix A, a Maxwell model with a Young\nmodulus E = 4.8GPa and a Poisson’s ratio µ= 0.41 gives\nthe same response to tidal loading periods as the Burgers\nmodel used by Reeh (2003). In this study, values for Young\nmodulus ranging from 1 to 5 GPa, and Poisson’s ratios be-\ntween 0.4 to 0.5 were used. None of the results presented\ndepend critically on the particular numerical values used for\nthese rheological parameters. Note that the Young’s modulus\nof ice at loading frequencies of hours and days is consider-\nably smaller than the dynamical Young’s modulus of about\n10 GPa derived from the propagation of sound waves (Schul-\nson and Duval, 2009). Although not directly comparable, the\nThe Cryosphere, 5, 259–270, 2011 www.the-cryosphere.net\/5\/259\/2011\/\nG. H. Gudmundsson: Tides and ice stream flow 263\nvalues of the Young modulus used here are not dissimilar to\nthose suggested by Vaughan (1995) of E = 0.88GPa, from\nan elastic analysis of tidal flexure on Rutford Ice Stream, and\nof E = 1.1GPa by Sykes et al. (2009) from a similar type\nof analysis done on Evans Ice Stream. The range of val-\nues of the Poisson’s ratio used here also compares favourably\nwith those estimated by Jenkins et al. (2006) from observa-\ntion of vertical ice deformation over tidal periods on Rutford\nIce Stream.\n3.2 Basal boundary condition\nUpstream from the grounding line, and along the ice-bed in-\nterface, a power-law type sliding law of the form\nvb= c|tb|m−1tb, (12)\nis used, where tb is the basal traction\ntb= σ nˆ−(nˆT ·σ nˆ)nˆ, (13)\nwith nˆ being a unit normal vector to the bed pointing into the\nice, and vb is the basal sliding velocity\nvb= v−(nˆT ·v)nˆ. (14)\nThe sliding law (12) is commonly used in glaciology (Cuf-\nfey and Paterson, 2010) and often referred to as Weertman\nsliding law. It has two adjustable parameters c and m. The\nparameter c is referred to as the basal slipperiness. The\nbasal slipperiness can, in general, be expected to be func-\ntion of various other quantities such was basal water pres-\nsure and small-scale basal topography, etc., and therefore to\nbe a function of location. In most flow modelling work to\ndate the basal slipperiness is tuned, sometimes using formal\ninverse methods, to mach measurements of velocity and ge-\nometry. The other free parameter of the sliding law is the\nstress exponent m. Despite the value of the stress exponent m\ndemonstrably having a decisive effect on the results of tran-\nsient modelling work on large ice masses (e.g. Joughin et al.,\n2010), and despite decades of intense efforts at putting some\nconstraints on its possible range, no consensus has emerged\non either realistic values for m or on the general applicability\nof Weertman sliding law in the context of large-scale ice-flow\nmodelling work. Values ranging from 1 to infinity are com-\nmonly used in flow modelling (Cuffey and Paterson, 2010).\nBasal motion was simulated in the model by introducing\na deformable layer of till. The till was modelled as vis-\ncous medium using a flow law of the same form as Glen-\nSteinemann constitutive law. This approach of introducing\nbasal motion has been used in numerous numerical stud-\nies, and a recent example for this approach with detailed de-\nscription can be found in Leysinger Vieli and Gudmundsson\n(2010).\n3.3 Boundary condition along the ice-ocean interface\nDownstream of the grounding line the ice is subjected to\noceanic pressure (pw) acting normal to the surface given by\npw = ρwg(S(t)−z), (15)\nwhere ρw is the specific density of ocean water, g is the grav-\nity acceleration. The variable S stands for the vertical posi-\ntion of the ocean surface, which, because of tidal action, is a\nfunction of time. A coordinate system with the z axis point-\ning vertically upwards is used.\nThe mechanical boundary condition along the ice-ocean\ninterface is\n(σ nˆ) · nˆ=pw, (16)\nwhere σ is the stress tensor within the ice. The condition\n(16) was implemented as a linear elastic spring, where the\npressure (p) acting normal to the ice is given by\np= k(z+z0), (17)\nwhere k is the spring constant, z0 the spring offset, and\nz the vertical position of the ice-ocean interface. Setting\nk =−ρwg and z0 =−S(t) gives Eq. (15). Using this ap-\nproach, the ocean pressure acting on the ice is not specified\ndirectly as a boundary condition. Only the dependency of the\nocean pressure on the geometry, as given by (17), is specified.\nBoth the pressure p and the vertical position of the ice-ocean\ninterface are solved for as a part of the solution procedure.\nThe ocean pressure always acts normal to the ice-ocean in-\nterface.\nPerturbations in stresses at the grounding line due to\nocean tides are broadly caused by two different mechanism,\n(a) bending stresses (Holdsworth, 1969), and (b) an overall\nchange in horizontal stress as the height of the ocean water\ncolumn changes (e.g. Thomas, 2007). The first mechanism,\ni.e. flexure, only acts if a glacier has a floating tongue. Ver-\ntical deformation around the grounding line is primarily due\nto bending stresses, and beam theory, which ignores overall\nchanges in horizontal stress, has successfully been used to\nanalyse measurements of tidal flexure (e.g. Reeh, 2003). In\nthe model used here the ocean pressure is at each location\nalong the ice-ocean interface given as a function of water\ndepth, and these two different processes are not separated in\nthe treatment of the boundary, but both are included.\n3.4 Finite element discretisation\nIn all calculations an eight-node isoparametric quadrilateral\nplane-strain element was used. The element uses biquadratic\ninterpolating functions for position and displacement with\nstrains varying linearly within the element. The size of the\nelements varied within the model domain, but typical dimen-\nsion were 1000 m in the horizontal and 250 m in the verti-\ncal. The calculations followed in a Lagrangian frame, i.e. the\nwww.the-cryosphere.net\/5\/259\/2011\/ The Cryosphere, 5, 259–270, 2011\n264 G. H. Gudmundsson: Tides and ice stream flow\n18 20 22 24 26 28 30 32 34\n−0.3\n−0.25\n−0.2\n−0.15\n−0.1\n−0.05\n0\n0.05\n0.1\n0.15\n0.2\ntime (days)\nde\ntre\nnd\ned\n d\nisp\nla\nce\nm\nen\nt (m\n)\n \n \nm=3\nm=1\nocean tide\nFig. 4. The effects the stress exponent m on modelled ice-stream\nresponse to tides. Linearly-detrended surface displacements 11 km\nupstream from the grounding line are shown for m= 3 (red curve)\nand m= 1 (blue curve). In the figure the ocean tide used to force\nthe model is shown as a black curve (scaled down by a factor of 60\nand shifted for visualisation purposes).\nnodal positions moved with the flow of the medium. Auto-\nmated remeshing was used to limit element distortion. How-\never, in most model runs calculations ended before the need\nof remeshing.\n4 Results\nThe numerical model was used to calculate the tidal response\nof an idealised ice stream to ocean tides. Model calculations\nwere performed using ice-stream geometries based on that of\nRIS and for tidal amplitudes typical for that region of Ronne\nIce Shelf. In line with the generic character of the modelling\nexercise, the geometry of RIS along the medial line was not\nreplicated in exact detail. However, average thickness and\nslope were based on the RIS geometry (details given below).\nFig. 4 shows modelled ice stream response at a distance\n11 km upstream from the grounding line. The figure illus-\ntrates the effect that changing the value of m from 1 to 3\nhas on modelled tidal response (red and blue curves shown\nin Fig. 4). The only differences between these two runs are\nthe values of the stress exponent m and the mean basal slip-\nperiness c. The tidal forcing, model geometry, and ice rhe-\nology are in both cases identical. The basal slipperiness was\nchanged as m was changed to ensure that the surface velocity\nwas similar in both cases, or about 1 m\/d.\nThe domain of the finite-element model used in produc-\ning the data shown in Fig. 4 extended 50 km upstream and\n20 km downstream from the grounding line, respectively. A\nuniform ice thickness of 1800 m was used with a zero sur-\nface slope downstream of the grounding line and a surface\nslope of 0.0014 upstream of the grounding line. The rheolog-\n20 25 30 35 40 45\n−0.1\n−0.05\n0\n0.05\n0.1\ntime (days)\nde\ntre\nnd\ned\n d\nisp\nla\nce\nm\nen\nt (m\n)\n \n \n11 km\n21 km\n31 km\nFig. 5. Linearly detrended horizontal surface displacement. The\nmodel was forced with ocean tides using only the S2 and the M2\ntidal components, each with an amplitude of 2 m. The domain of the\nfinite-element model extended 120 km upstream and 50 km down-\nstream from the grounding line, respectively. The geometry of the\nmodel was based on a thickness profile running along the medial\nline of Rutford Ice Stream. At the grounding line ice thickness was\n1708 m. The average surface slope was 0.003 upstream and 0.001\ndownstream of the grounding line. For the ice values of the rheo-\nlogical parameters were: A= 10−12d−1kPa−3, n= 3, E = 1GPa,\nν = 0.45. For the till: m= 3 and a value of rate factor that gave\na surface velocity of about 1md−1. Ice and ocean densities were\nρ= 917kgm−3 and ρw = 1030kgm−3, respectively.\nical behaviour of ice was described by a non-linear Maxwell\nmodel (see Eq. 11). The model has four adjustable param-\neters: The Young modulus E, the Poisson’s ratio ν, a rate\nfactor A and a stress exponent n. The rate factor of the ice\nwas set at 4.5×10−12a−1kPa−3 which corresponds to a tem-\nperature of about −20 degrees Celsius. The Young modulus\nE and the Poisson’s ratio ν were 1GPa and 0.45, respec-\ntively. The thickness of the till layer was set at 250 m and\nthe rate factor of the till was tuned to give a surface velocity\nof about 1md−1 upstream from the grounding line. Ice and\nocean densities were ρ = 917kgm−3 and ρw = 1030kgm−3,\nrespectively.\nAs Fig. 4 shows, no long-period tidal modulation in ice\nstream flow is generated for m= 1. On the other hand, for\nm= 3 not only is there a long-period variation in flow, the\namplitude of the long-period tidal modulation upstream from\nthe grounding line is several times larger than the modulation\nat the semi-diurnal and diurnal periods. The amplitude of the\nfortnightly period in Fig. 4 is about 30 cm, or of the same\norder of magnitude as measured variability in ice-flow at that\nperiod on RIS (see Fig. 1).\nThe Cryosphere, 5, 259–270, 2011 www.the-cryosphere.net\/5\/259\/2011\/\nG. H. Gudmundsson: Tides and ice stream flow 265\n20 25 30 35 40 45\n−0.03\n−0.02\n−0.01\n0\n0.01\n0.02\n0.03\n0.04\ntime (days)\nde\ntre\nnd\ned\n d\nisp\nla\nce\nm\nen\nt (m\n)\n \n \n11 km\n21 km\n31 km\nFig. 6. Linearly detrended horizontal surface displacement. The\nmodel was forced with ocean tides using only the O1 and the K1\ntidal components, each with an amplitude of 2 m. Apart from the\ndifference in ocean tidal forcing, all parameters are identical to\nthose used in Fig. (5).\nFigure 5 shows modelled ice-stream response to ocean\ntidal forcing when forced with the two main semi-diurnal\ntidal components S2 and M2 only. Hence, in this run the\nmodel was not subjected to any long-periodic forcing. Re-\nsponse is shown for m= 3 at three different sites at distances\nof 11, 21, and 31 km upstream from the grounding line, re-\nspectively. The model parameters are slightly different from\nthose used in 4 and are listed in the figure caption of Fig. 5.\nAs seen Fig. 5, despite no forcing at long tidal periods,\nthe strongest response, as measured by the amplitude of the\ndetrended horizontal surface displacement, is at the MSf fre-\nquency. The MSf frequency is the difference between M2\nand S2 frequencies, and the response at the MSf frequency\nis a nonlinear contribution of the forcing by the M2 and S2\ntidal constituents.\nClose inspection of the displacement curves in Fig. 5 re-\nveals that they are phase shifted with respect to each other.\nThe phase is a consequence of the visco-elastic rheology of\nice. Calculating the cross correlation between the displace-\nment curves to determine the phase speed gives a phase speed\nof 0.25 m s−1 which is comparable to the observed phase\nspeeds on RIS of 0.2 to 1.0 m s−1. The modelled phase speed\nis expected to depend on the parameter values of the rheo-\nlogical model and a detailed sensitivity study has not been\nperformed.\nForcing the same model with the diurnal tidal components\nK1 and O1 only, results in a rather complicated looking re-\nsponse were the long period tidal components are mostly ab-\nsent (see Fig. 6). The difference between the O1 and the K1\nfrequency is the Mf frequency. The results shown in Fig. 6 in-\ndicate that the strength of the non-linear interaction between\n24 26 28 30 32 34 36\n0\n0.5\n1\n1.5\n2\ntime (days)\nu\n (m\n\/d)\nocean tide (scaled and shifted vertically)\nm=3\nm=1\nsurface speed 11 km upstream from grounding line\nFig. 7. Surface velocity 11 km upstream from the grounding line for\nm= 1 (red curve) and m= 3 (blue curve). The ocean tidal ampli-\ntude is shown for comparison (black curve) and is scaled by a factor\nof 20 and shifted for display purposes. Model geometry, rheologi-\ncal parameter values, and oceanic forcing are all identical to those\nused in Fig. 4 and are described in text.\nK1 and O1 is not sufficient to produce a sizable Mf tidal\nmodulation in flow. Note that despite the large differences\nbetween the results shown in Figs. 5 and Fig. 6, the model\nsetup, i.e. rheological parameters and geometry, are in both\ncases identical. The difference in response is entirely due to\nthe different oceanic forcing applied.\nA feature of the non-linearity of the tidal response is to\ncause a mean shift in surface velocities. An example of this\neffect is given in Fig. 7 showing the horizontal component\nof the surface velocity vector as a function of time for both\nm= 1 and m= 3. For m= 1 the perturbation in velocity is\nsymmetrical around the mean velocity. For m= 3 the per-\nturbation is, on the other hand, asymmetrical. As a conse-\nquence, for m 6= 1 the mean velocity is shifted, and there is a\nnet contribution to forward motion through the tidal action.\nIn the particular modelling experiment shown in Fig. 7 tidal\nforcing causes about 5% increase in mean speed for m= 3.\nFigure 8 shows the dependency of the tidal response to the\nvalue of the stress exponent m. Shown in the figure are de-\ntrended horizontal displacement curves 30 km upstream from\nthe grounding line as a function of time for different values of\nm. In each run, the basal slipperiness was adjusted to ensure\nthat the surface velocities was at this site was 1 m\/d irrespec-\ntively of the value of m. Clearly visible in the figure is how\nthe amplitude of the fortnightly MSf horizontal tide increases\nwith increasing m. As discussed above, for m= 1 there is\nno corresponding response at the MSf frequency. The am-\nplitude of the semidiurnal tide, which in Fig. 8 can be seen\nsuperimposed on the longer period MSf tide, also increases\nmarkedly with m. Calculated phase shifts are not indepen-\ndent of m, i.e. positions of the the maxima and minima in\ndetrended displacement for different m values do not align\nwww.the-cryosphere.net\/5\/259\/2011\/ The Cryosphere, 5, 259–270, 2011\n266 G. H. Gudmundsson: Tides and ice stream flow\n60 65 70 75 80\n−0.2\n−0.1\n0\n0.1\ntime (days)\nde\ntre\nnd\ned\n d\nisp\nla\nce\nm\nen\nt (m\n)\n \n \nm=2\nm=4\nm=6\nm=10\nTide\nFig. 8. Detrended displacements 30 km upstream from the ground-\ning line as a function of time for a number of different m values\n(coloured curves). Model geometry and rheological parameter val-\nues other than those of the till are all identical to those used in Fig. 4\nand are described in text. The black curve is the tidal amplitude\nscaled by a factor of 100. Tidal forcing is applied at the S2 and the\nM2 frequencies only and each tidal constituent has an amplitude of\n2 m.\nvertically. This effect can be seen for both the long-period\nMSf tide, where the maximum in detrended displacement is\nreached about two days earlier for m= 10 than for m= 2,\nand the in the semidurnal variation (see Fig. 8).\n5 Discussion\nModelled tidal modulation in ice stream flow is strongly sen-\nsitive to the parameters of the sliding law. For example, sim-\nply changing the value of the stress exponent from m= 1\nto m= 3 gives rise to a long-period response in ice stream\nflow that is absent for m= 1 (see Fig. 4). Strong tidal mod-\nulation in ice-stream flow at long-tidal periods can be gener-\nated from the action of the semi-diurnal and diurnal oceanic\ntidal components alone, provided the relationship between\nbasal stress and basal motion is non-linear (Fig. 5). The\nlong-period response requires a non-linear mechanism. In\nthe model the source of this non-linearity is the basal sliding\nlaw (for m 6= 1).\nThe qualitative difference in model response when forced\nwith the S2\/M2 tides (see Fig. 5), as compared to the re-\nsponse when forced with the K1\/O1 tides (see Fig. 6), in-\ndicates that the model response to semi-diurnal loading pe-\nriods is different from the response to diurnal loading peri-\nods. The viscoelastic rheology model introduces an addi-\ntional timescale, i.e. the Maxwell time scale which is the ra-\ntio of the Young modulus and the (effective) viscosity (see\nEq. 9). The presence of this time scale allows for a differ-\nent types of model response to these two different types of\ntidal forcing. If no such additional timescale were involved,\nthe model would not distinguish between forcing at semi-\ndiurnal and diurnal time scales, and the non-linear interac-\ntion between O1 and K1 would be similar to that between S2\nand M2.\nOne of the consequences of the different strengths of the\nnon-linear interaction between the S2\/M2 pair and the O1\/K1\npair, is that the long-periodic response is primarily concen-\ntrated at the MSf frequency. In comparison, the response at\nthe Mf frequency is small. In qualitative terms this is in good\nagreement with observations from RIS where the horizontal\nMSf tidal amplitude is several times larger than the Mf tidal\namplitude (King et al., 2010).\nAlthough an exact comparison with data from RIS is not\njustified for a two-dimensional flow-line model, the modelled\ntidal response using a viscous sliding law with a exponent of\nm= 3 shares all the main characteristics of observed tidal\nmodulation of RIS. A full parameter study has still to be per-\nformed. However, a value of m= 1 can be excluded.\nNote that the modelled temporal flow variability is not due\nto any corresponding temporal changes in the model param-\neters. All modelling parameters are kept constant and do not\nchange in space or time. In particular, although basal stresses\nand basal motion varies in space and time, the parameters of\nthe sliding law do not. In nature one can expect the basal\nslipperiness to vary across the bed, and possibly also in rela-\ntion to tides. In modelling terms, prescribing such a variation\nposes no difficulties. However, although such variability in\nbasal slipperiness can be expected to modify the modelled\nresponse, and introducing such a variability might be useful\nas a part of a model-optimisation study, no such variability is\nrequired to reproduce the general characteristics of the tidal\nresponse observed on RIS.\nThe model produces no clear long-term tidal response\nwhen forced with diurnal tides only. This raises the pos-\nsibility that the difference between observed tidal response\non RIS and on some of the Siple Coast ice streams, such\nas the Bindschadler Ice Stream (e.g. Anandakrishnan et al.,\n2003), is primarily related to differences in forcing rather\nthan differences in basal conditions. Ross Sea tides are pre-\ndominantly diurnal with K1 and O1 amplitudes of about\n0.5 m or less, and semi-diurnal amplitudes of less than 0.1 m\n(MacAyeal, 1984). The tides on Ronne-Filchner Ice Shelf are\nmixed diurnal and semi-diurnal tides with M2, S2, K1 and\nO1 amplitudes of around 1 m (Robertson et al., 1998; Fricker\nand Padman, 2002; King et al., 2011b). Hence, in compar-\nison to RIS, the Siple Coast ice streams are subjected to at\nleast ten times smaller semi-diurnal forcing. For these differ-\nent types of ocean forcing, the modelled response would be\ndifferent (compare Fig. 5 and Fig. 6) and yet in both cases\nsimilar to the observations, i.e. largest response is concen-\ntrated at long-periodic tides on RIS with little or no response\nat long-periods for Siple Coast ice streams.\nThe numerical model used here supports conclusions\nbased on the previous modelling approach of Gudmundsson\n(2007), and gives added confidence in the applicability of\nThe Cryosphere, 5, 259–270, 2011 www.the-cryosphere.net\/5\/259\/2011\/\nG. H. Gudmundsson: Tides and ice stream flow 267\nthat model to quantify effects of ocean tides on ice-stream\nflow as done by King et al. (2010). Modelled MSf ampli-\ntudes in ice stream flow are, for example, for both models\nalmost identical, and both models produce a similar shift\nin mean surface velocity. However, there are a number of\nimportant differences between the visco-elastic full Stokes\nmodel presented here and the simple conceptual model of\nGudmundsson (2007). Here, the basal perturbation in stress\nis calculated and is a model output, whereas in Gudmundsson\n(2007) the basal perturbation at each measurement site was\nan unknown model parameter that was estimated from the\nobserved temporal variation in flow. Due to its simplicity, the\nmodel of Gudmundsson (2007) can be described as “an edu-\ncated guess” of the effects of ocean tides on ice-stream flow.\nIn the model presented here, the full set of the momentum\nequations are solved for a non-linear visco-elastic rheology\nwithout resorting to any simplifying modelling assumptions\nregarding the stress state.\nFor both the conceptual model presented in Gudmundsson\n(2007), and the model presented here, predicted ice-stream\nresponse to ocean tides does not scale linearly with the am-\nplitude of the tides, unless for m= 1 and n= 1. These are\nbasic characteristics of any non-linear model. Murray et al.\n(2007) discuss the fact that the velocity on RIS appears not\nto be “simply” related to tidal height, and state that the this\nobservation invalidates the Gudmundsson (2007) model. Al-\nthough the exact meaning of the word “simply” as used in\nthis context by Murray et al. (2007) is not fully clear, both\nthe argument and the conclusion are incorrect. In fact, a fur-\nther analysis of the data presented in Murray et al. (2007)\ndone by King et al. (2010) showed that the model of Gud-\nmundsson (2007) could be used to reproduce that data set\nusing “strikingly similar” parameter values to those of Gud-\nmundsson (2007).\n6 Conclusions and outlook\nApplying ocean tides to a model of a coupled ice-stream\/ice-\nshelf flow can give rise to tide-induced horizontal movement\nof the ice-stream that is strongest at frequencies not presented\nin the forcing, provided a non-linear function is used to de-\nscribe the relationship between basal motion and tangential\nbasal stresses. Forcing the model with semi-diurnal tides\nonly, can cause a strong fortnightly response in horizontal\ndisplacement upstream of the grounding line. This model\nresponse bears strong similarities to observations made on\nRutford Ice Stream (RIS).\nUsing a Weertman type basal sliding law with moderately\nlarge stress exponent (i.e. within the range from 2 to 10)\nthe numerical model is found to replicate all main qualita-\ntive features of the observed tidal motion of RIS, such as the\ngenesis of long-period tidal modulation in flow in response\nto diurnal and semi-diurnal tides. The model also explains\nwhy the long-period response is concentrated at the MSf pe-\nriod of 14.76 days and almost absent at the similar Mf period\nof 13.66 days. Furthermore, when compared with data from\nRIS the model gives realistic order-of-magnitudes for am-\nplitudes and phases of tidal constituents. Forcing the model\nwith the O1\/K1 diurnal tides only results in a fairly com-\nplicated tidal response that is mostly devoid of long-period\ncomponents.\nThe phase relationship between the tidal response and the\nocean tide is dependent on the parameters of the rheologi-\ncal model and on distance from the grounding line. Lowest\nspeed is not observed at high tide and highest speed not at\nlow tide, as might be expected if the change in horizontal\npressure due to the varying height of the water column was\nthe primary variable affecting the flow. The phase relation-\nship is complicated, and in the model runs presented above\nhighest forward speed occurs at different times depending on\nlocation. Sufficient distance downstream of the grounding\nline highest horizontal speed occurs approximately at high-\nest rate of rising ocean tide.\nThere are a number of important issues not fully resolved\nhere that warrant further modelling efforts. Of interest is\nthe prospect of conducting a fully three-dimensional study\nof tidal modulation in flow. Such a study would constitute\na much stronger test on the validity of the mechanism pro-\nposed here for the generation of tidal motion on ice streams,\nand deliver firmer constrains on the basal boundary condi-\ntion.\nAppendix A\nVisco-elastic rheology models\nThe constitutive equations of linear viscoelastic materials un-\nder multiaxial stress can be written as\nP dτij =Qddij , (A1)\nand\nP vσii =QK\u000fii (A2)\nwhere τij and dij are the deviatoric stresses and strains, re-\nspectively, and σii and \u000fii (summation implied) are the vol-\numetric stresses and strains (Shames and Cozzarelli, 1997).\nP d , Qd , P v , and Qv are differential time operators specific\nto a particular rheological model.\nThe Maxwell model is a two-element model where a\nspring element and a viscous dashpot element are connected\nin series. A two-element model where a spring element and\nviscous dashpot element are connected in parallel is referred\nto as the Kelvin model. The Burgers model is a four-element\nmodel where a Maxwell and a Kelvin model are connected\nin series.\nThe Burgers model (Shames and Cozzarelli, 1997) is de-\nfined by\nτij +p1τ˙ij +p2τ¨ij = q1d˙ij +q2d¨ij (A3)\nwww.the-cryosphere.net\/5\/259\/2011\/ The Cryosphere, 5, 259–270, 2011\n268 G. H. Gudmundsson: Tides and ice stream flow\n10−3 10−2 10−1 100 101\n109\n1010\nperiod of oscilation (day)\n|G*\n| (G\npa\n)\n \n \nBurgers\nMaxwell\nFig. A1. The complex shear moduli of the Burgers and Maxwell\nmodels. The parameters of the Burgers model are based on values\nsuggested by Reeh (2003). Using Eqs. A12 and A13 the parameters\nof the Maxwell model are set such that the complex shear moduli of\nthe Maxwell model is equal to that of the Burgers model for loading\nperiods larger than about few minutes.\nand\nσii = 3K\u000fii, (A4)\nwhere\npd1 =\nηM\nGK\n+ η\nM\nGM\n+ η\nK\nGK\n(A5)\npd2 =\nηKηM\nGMGM\n(A6)\nqd1 = 2ηM (A7)\nqd2 =\n2ηKηM\nGK\n(A8)\nHere ηK and ηM are the viscosities of the Kelvin and the\nMaxwell parts of the Burgers model, respectively, while GK\nand GM are the corresponding shear moduli. The parame-\nter K is the bulk modulus. The volumetric deformation is\nassumed to be elastic.\nFor oscillatory deviatoric strain dij = d◦ij eiwt , and devia-\ntoric stresses τij = τ ∗ij eiwt , the complex shear modulus of the\nBurgers model, defined as GˆB = τ ∗ij\/(2d◦ij ), is given by\nG?Burgers =\niq1w−q2w2\n2(1+ ip1w−p2w2) (A9)\nThe complex bulk modulus, K?, of the model is independent\nof frequency, i.e. K?=K .\nAs is typically the situation for visco-elastic bodies (Find-\nley et al., 1976), the Poisson’s ratio (defined as the negative\nof the ratio between lateral and axial strain under uniaxial\nstressing), for the Burgers model is a function of the loading\nfrequency,\nν(w)= 3K−2G\n?\n6K+2G? . (A10)\nThe Poisson’s ratio (ν) is, therefore, not a material parameter\nand, in general, time dependent. For w→+∞, ν→ (3K−\nR)\/(6K+R), and for w= 0 we find ν = 1\/2 corresponding\nto an incompressible material. Similarly, the Young modulus\n(E) of a visco-elastic body is also not a material parameter,\nbut depends on the loading period.\nThe Burgers model is one of the simplest rheological mod-\nels possible that can represent instantaneous elastic strain,\ndelayed elastic response (primary creep), and steady-state\nviscous deformation (secondary creep). The instantaneous\nelastic response of the model is determined by the bulk mod-\nulus K and the shear modulus GM . The model parameters\nGK and ηK determine the delayed elastic response, and ηM\nthe steady-state viscous deformation.\nValues for the instantaneous shear and bulk moduli are\nlisted by Ro¨thlisberger (1972). The temperature dependency\nof that data was analysed by Hutter (1983). Following Reeh\n(2003), here the values GM = 3.5GPa and K = 8.9GPa are\nadapted. These values correspond to an instantaneous Young\nmodule E = 9.3GPa and an instantaneous Poisson’s ratio\nν = 0.33. Using results by Brill and Camp (1961) from\nstudies of primary creep, and further following Reeh (2003),\ngives GK = 3.3GPa and ηK = 600GPas. These values imply\na retardation time of Kelvin element of the four-element fluid\nof only a few minutes, and suggest that the simpler Maxwell\nmodel may well be an equally good approximation to ice rhe-\nology over tidal time periods of hours and longer.\nThe complex shear modulus (Gˆ) of the Maxwell model is\nG?Maxwell =\n2iηw\n1+ iwη\/G (A11)\nwhere η and G are the material parameters of the model (not\nto be confused with ηM and GM which are the material pa-\nrameters of the Maxwell part of the Burgers model).\nWe want Maxwell to reproduce Burgers over periods of in-\nterest. This is done selecting an effective G of the Maxwell\nmodel such that the complex shear modulus of the Maxwell\nmodel is a good approximation to the complex shear mod-\nulus of the Burgers model for tidal frequencies. One way\nof achieving this goal is by ignoring the delayed elastic re-\nsponse of the Burgers model and setting the parameters of\nthe Maxwell model to\nG= G\nK\n1+GK\/GM+ηK\/ηM . (A12)\nand\nη= ηM . (A13)\nEquations (A12) and (A13) give the relationship between\nthe values of the Burgers model and that of a Maxwell model\nthat reproduces the Burgers model for loading periods large\nin comparison to the retardation time of the Burgers model.\nAs shown in Fig. A1, using these values, the Maxwell model\nThe Cryosphere, 5, 259–270, 2011 www.the-cryosphere.net\/5\/259\/2011\/\nG. H. Gudmundsson: Tides and ice stream flow 269\nclosely reproduces the behaviour of the more complex Burg-\ners model over all frequencies larger than about 0.05 per\nday. The shear modulus of the (effective) Maxwell model\nis 1.7GPa and the instantaneous Poisson’s ratio ν= 0.41 im-\nplying a instantaneous Young modulus of 4.8GPa.\nAcknowledgements. I thank K. Makinson and M. King for valuable\ndiscussions. I also thank M. Truffer and an anonymous reviewer\nfor very helpful and insightful reviews. Previous version of this\npaper benefited significantly from a number of suggestions made\nby D. G. Vaughan. This work was partly supported by the NERC\nGEF grant 711.\nEdited by: I. M. Howat\nReferences\nAdalgeirsdo´ttir, T., Murray, T., Smith, A., King, M., Makinson,\nK., Nicholls, K., and Behar., A.: Tidal influence on Rutford Ice\nStream, West Antarctica: observations of surface flow and basal\nprocesses from closely-spaced GPS and passive seismic stations,\nJ. Glaciol., 54, 715–714, 2008.\nAnandakrishnan, S., Voigt, D. E., Alley, R. B., and King, M. A.:\nIce stream D flow speed is strongly modulated by the tide be-\nneath the Ross Ice Shelf, Geophys. Res. Lett., 30, doi:doi:10.\n1029\/2002GL016329, 2003.\nBindschadler, R. A., King, M. A., Alley, R. B., Anandakrishnan, S.,\nand Padman, L.: Tidally controlled stick-slip discharge of a West\nAntartic Ice Stream, Science, 301, 1087–1089, 2003a.\nBindschadler, R. A., Vornberger, P. L., King, M. A., and Padman,\nL.: Tidally driven stick-slip motion in the mouth of Whillans Ice\nStream, Antarctica, Ann. Glaciol., 36, 263–272, 2003b.\nBrill, R. and Camp, P. R.: Properties of ice, Res. Rep. 68, SIPRE,\n1961.\nBrunt, K. M., King, M. A., Fricker, H. A., and MacAyeal, D. R.:\nFlow of the Ross Ice Shelf, Antarctica, is modulated by the ocean\ntide, J. Glaciol., 56, 157–161, 2010.\nChristensen, R. M.: Theory of viscoelasticity, Academic Press,\n2 Edn., 1982.\nCuffey, K. and Paterson, W. S. B.: The Physics of Glaciers, Elsevier,\n4 Edn., 2010.\nDach, R., Beutler, G., and Gudmundsson, G. H.: Analysis of GPS\ndata from an Antarctic ice stream, in: Observing our Changing\nEarth, edited by: Sideris, M. G., vol. 133, Part 3 of International\nAssociation of Geodesy Symposia, 569–579, Springer-Verlag,\nBerlin Heidelberg, doi:10.1007\/978-3-540-85426-567, 2009.\nDoake, C., Corr, H., Nicholls, K., Gaffikin, A., Jenkins, A.,\nBertiger, W., and King, M.: Tide-induced lateral move-\nment of Brunt Ice Shelf, Antarctica, Geophys. Res. Lett., 29,\ndoi:10.1029\/2001GL014606, 2002.\nFindley, W. N., Lai, J. S., and Onaran, K.: Creep and relaxation of\nnonlinear viscoelastic materials, Dover Publications, Inc, New\nYork, 1976.\nFricker, H. A. and Padman, L.: Tides on Filchner-Ronne Ice\nShelf from ERS radar altimetry, Geophys. Res. Lett., 29,\ndoi:10.1029\/2001GL014175, 2002.\nGlen, J. W.: The creep of polycrystalline ice, Proceedings of the\nRoyal Society of London, Ser A, 228, 519–538, 1955.\nGudmundsson, G. H.: Fortnightly variations in the flow ve-\nlocity of Rutford Ice Stream, West Antarctica, Nature,\n444, 1063–1064, doi:10.1038\/nature05430, http:\/\/dx.doi.org\/10.\n1038\/nature05430, 2006.\nGudmundsson, G. H.: Tides and the flow of Rutford\nIce Stream, West Antarctica, J. Geophys. Res., 112,\ndoi:10.1029\/2006JF000731, 2007.\nGudmundsson, G. H. and Jenkins, A.: Ice-flow velocities on\nRutford Ice Stream, West Antarctica, are stable over decadal\ntimescales, J. Glaciol., 55, 339–344, 2009.\nHoldsworth, G.: Flexure of a floating ice tongue, J. Glaciol., 8,\n385–397, 1969.\nHutter, K.: Theoretical glaciology; material science of ice and the\nmechanics of glaciers and ice sheets, D. Reidel Publishing Com-\npany\/Tokyo, Terra Scientific Publishing Company, 1983.\nJellinek, H. H. G. and Brill, R.: Viscoelastic properites of ice, J.\nAppl. Phys., 27, 1198–1209, doi:10.1063\/1.1722231, 1956.\nJenkins, A., Corr, H., Nicholls, K., Stewart, C., and Doake, C.: In-\nteractions between ice and ocean observed with phase-sensitive\nradar near an Antarctic ice shelf grounding line, J. Glaciol. , 52,\n325–346, 2006.\nJoughin, I., Smith, B. E., and Holland, D. M.: Sensitiv-\nity of 21st century sea level to ocean-induced thinning of\nPine Island Glacier, Antarctica, Geophys. Res. Lett., 37,\ndoi:10.1029\/2010GL044819, 2010.\nKing, M. A., Murray, T., and Smith, A. M.: Non-linear responses of\nRutford Ice Stream, Antarctica, to semi-diurnal and diurnal tidal\nforcing, J. Glaciol., 56, 167–176, 2010.\nKing, M. A., Makinson, K., and Gudmundsson, G. H.: Nonlinear\ninteraction between ocean tides and the Larsen C Ice Shelf sys-\ntem, Geophys. Res. Lett., doi:10.1029\/2011GL046680, in press,\n2011a.\nKing, M. A., Padman, L., Nicholls, K., Clarke, P. J., Gudmunds-\nson, G. H., Kulessa, B., and Shepherd, A.: Ocean tides in\nthe Weddell Sea: new observations on the Filchner-Ronne and\nLarsen C ice shelves and model validation, J. Geophys. Res.,\ndoi:10.1029\/2011JC006949, in press., 2011b.\nLeysinger Vieli, G. J.-M. C. and Gudmundsson, G. H.: A numerical\nstudy of glacier advance over deforming till, The Cryosphere, 4,\n359–372, doi:10.5194\/tc-4-359-2010, 2010.\nLingle, C. S., Hughes, T. J., and Kollmeyer, R. C.: Tidal flexure\nof Jakobshavns Glacier, West Greenland, J. Geophys. Res., 86,\n3960–3968, 1981.\nMacAyeal, D. R.: Numerical simulations of the Ross Sea tides, J.\nGeophys. Res., 89, 607–615, 1984.\nMARC: MARC User’s Manual, MSC.Software Corporation, 2\nMacArthur Place, Santa Ana, CA 92707, 2010b edn., 2010.\nMorland, W. L. and Spring, U.: Viscoelastic fluid relation for the\ndeformation of ice, Cold Regions Science and Technology, 4,\n255–268, 1981.\nMurray, T., Smith, A. M., King, M. A., and Weedon, G. P.:\nIce flow modulated by tides at up to annual periods at Rut-\nford Ice Stream, West Antarctica, Geophys. Res. Lett., 34,\ndoi:10.1029\/2007GL031207, 2007.\nReeh, N.: Tidal bending of glaciers: a linear viscoelastic approach,\nAnn. Glaciol., 37, 83–89, 2003.\nRobertson, R. A., Padman, L., and Egber, G. D.: Tides in the Wed-\ndell Sea, in: Ocean, Ice, and Atmosphere: Interactions at the\nAntarctic Continental Margin, edited by Jacobs, S. S. and Weiss,\nwww.the-cryosphere.net\/5\/259\/2011\/ The Cryosphere, 5, 259–270, 2011\n270 G. H. Gudmundsson: Tides and ice stream flow\nR. F., vol. 75 of Antarctic Research Series, 341–369, American\nGeophysical Union, 1998.\nRo¨thlisberger, H.: Seismic Exploration in cold regions, Cold Re-\ngions Science and Engineering Monograph, II-A2a, 153 pp,\n1972.\nSchulson, E. M. and Duval, P.: Creep and fracture of Ice, Cam-\nbridge University Press, Cambridge CB2 8RU, UK, 2009.\nSergienko, O. V., MacAyeal, D. R., and Bindschadler, R. A.:\nStick-slip behavior of ice streams: modeling investigations, Ann.\nGlaciol., 50, 87–94, 2009.\nShames, I. H. and Cozzarelli, F. A.: Elastic and Inelastic Stress\nAnalysis, Taylor & Francis, 1997.\nSteinemann, S.: Results of preliminary experiments on the plastic-\nity of ice crystals, J. Glaciol. , 2, 404–413, 1954.\nSteinemann, S.: Re´sultats expe´rimentaux sur la dynamique da la\nglace et leurs correlations avec le mouvement et la pe´trographie\ndes glaciers., International Association of Scientific Hydrology,\n47, 184–198, 1958.\nStephenson, S. N.: Glacier flexure and the position of groundin\nlines: Measurements by tilmeter on Rutford Ice Stream Antarc-\ntica, Ann. Glaciol., 5, 165–169, 1984.\nSykes, H. J., Murray, T., and Luckman, A.: The location of the\ngrounding zone of Evans Ice Stream, Antarctica, investigated us-\ning SAR interferometry and modelling, Ann. Glaciol., 50, 35–40,\n2009.\nThomas, R. H.: Tide-induced perturbations of glacier\nvelocities, Glob. Planet. Change, 59, 217–224,\ndoi:10.1016\/j.gloplacha.2006.11.017, 2007.\nVaughan, D. G.: Tidal flexure at ice shelf margins, J. Geophys. Res.,\n100, 6213–6224, 1995.\nWiens, D. A., Anandakrishnan, S., Winberry, J., and King,\nM.: Simultaneous teleseismic and geodetic observations of\nthe stick-slip motion of an Antarctic ice stream, Nature,\ndoi:10.1038\/nature06990, 2008.\nWinberry, J. P., Anandakrishnan, S., Alley, R. B., Bindschadler,\nR. A., and King, M. A.: Basal mechanics of ice streams: Insights\nfrom the stick-slip motion of Whillans Ice Stream, West Antarc-\ntica, J. Geophys. Res.-Earth, 114, doi:10.1029\/2008JF001035,\n2009.\nThe Cryosphere, 5, 259–270, 2011 www.the-cryosphere.net\/5\/259\/2011\/\n"}