{"doi":"10.1191\/0309132502ph392pr","coreId":"66763","oai":"oai:dro.dur.ac.uk.OAI2:199","identifiers":["oai:dro.dur.ac.uk.OAI2:199","10.1191\/0309132502ph392pr"],"title":"Qualitative methods : the new orthodoxy?","authors":["Crang,  M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-10","abstract":"It is an interesting moment to write Progress in Human Geography’s first report on qualitative methods. In one sense, it suggests these methods have, at long last, arrived and been accepted as established approaches. That this is an overdue recognition needs little emphasizing when surveying the number of articles drawing upon, at least in part, qualitative material. However, a less encouraging omen is the recent column in the UK Economic and Social Research Council’s Social Sciences, penned by the chief executive (Marshall, 2001). In it he asserts: ‘British universities and colleges are not producing quantitatively competent social scientists in sufficient numbers.’ Although he does not mention what ‘non-quantitative’ research is doing, he discusses a series of remedial measures - such as compulsory training in statistics, prioritized awards for quantitative PhD projects, tied studentships and specialist research centres. To paraphrase Spike Milligan’s comment on army training, the attitude appears to be - if someone dies when you hang them, keep hanging them until they get used to it. It is already feeding through into new postgraduate Research Training Guidelines. The problem we are told is acute, though the evidence presented is scant and, moreover, ironically seems to consist of unanalysed, qualitative reports from meetings with civil servants: ‘Failure to [remedy the shortage] is likely to result in Britain falling behind the rest of Europe, both in the provision of talented quantitative social researchers, and the ability to design public policy on a reliable evidence base.’ It seems to imply that qualitative research has not only arrived but gone too far. Within geography, the last decade has undoubtedly seen an expansion in qualitative work both in terms of the types of work and the topics addressed. So in this first report I want to spend some time looking at the range of topics, then beginning to look at the range of methods that might be covered. I want to suggest that we have moved from a period when papers were prefaced with legitimations of qualitative work to a time when we are seeing debates within qualitative methods over establishing orthodox approaches and standards. I want to conclude this report by pointing towards some gaps","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66763.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/199\/1\/199.pdf","pdfHashValue":"a9f00f011ff3e211ed8dbc1a4af7cf9cd21edf9d","publisher":"Hodder Arnold","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:199<\/identifier><datestamp>\n      2014-07-30T12:53:21Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Qualitative methods : the new orthodoxy?<\/dc:title><dc:creator>\n        Crang,  M.<\/dc:creator><dc:description>\n        It is an interesting moment to write Progress in Human Geography’s first report on qualitative methods. In one sense, it suggests these methods have, at long last, arrived and been accepted as established approaches. That this is an overdue recognition needs little emphasizing when surveying the number of articles drawing upon, at least in part, qualitative material. However, a less encouraging omen is the recent column in the UK Economic and Social Research Council’s Social Sciences, penned by the chief executive (Marshall, 2001). In it he asserts: ‘British universities and colleges are not producing quantitatively competent social scientists in sufficient numbers.’ Although he does not mention what ‘non-quantitative’ research is doing, he discusses a series of remedial measures - such as compulsory training in statistics, prioritized awards for quantitative PhD projects, tied studentships and specialist research centres. To paraphrase Spike Milligan’s comment on army training, the attitude appears to be - if someone dies when you hang them, keep hanging them until they get used to it. It is already feeding through into new postgraduate Research Training Guidelines. The problem we are told is acute, though the evidence presented is scant and, moreover, ironically seems to consist of unanalysed, qualitative reports from meetings with civil servants: ‘Failure to [remedy the shortage] is likely to result in Britain falling behind the rest of Europe, both in the provision of talented quantitative social researchers, and the ability to design public policy on a reliable evidence base.’ It seems to imply that qualitative research has not only arrived but gone too far. Within geography, the last decade has undoubtedly seen an expansion in qualitative work both in terms of the types of work and the topics addressed. So in this first report I want to spend some time looking at the range of topics, then beginning to look at the range of methods that might be covered. I want to suggest that we have moved from a period when papers were prefaced with legitimations of qualitative work to a time when we are seeing debates within qualitative methods over establishing orthodox approaches and standards. I want to conclude this report by pointing towards some gaps.<\/dc:description><dc:subject>\n        Qualitative methods<\/dc:subject><dc:subject>\n         Human geography<\/dc:subject><dc:subject>\n         Methodology.<\/dc:subject><dc:publisher>\n        Hodder Arnold<\/dc:publisher><dc:source>\n        Progress in human geography, 2002, Vol.26(5), pp.647-655 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2002-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:199<\/dc:identifier><dc:identifier>\n        issn:0309-1325<\/dc:identifier><dc:identifier>\n        issn: 1477-0288<\/dc:identifier><dc:identifier>\n        doi:10.1191\/0309132502ph392pr<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/199\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1191\/0309132502ph392pr<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/199\/1\/199.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0309-1325","issn: 1477-0288"," 1477-0288","issn:0309-1325"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2002,"topics":["Qualitative methods","Human geography","Methodology."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n07 April 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nCrang, M. (2002) ’Qualitative methods : the new orthodoxy ?’, Progress in human geography., 26 (5). pp.\n647-655.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1191\/0309132502ph392pr\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Qualitative Methods: the new orthodoxy? \n \nMike Crang, University of Durham \n \nIt is an interesting moment to write Progress in Human Geography’s first report on \nqualitative methods. In one sense it suggests these methods have, at long last, arrived and \nbeen accepted as established approaches. That this is an overdue recognition needs little \nemphasising when surveying the number of articles drawing upon, at least in part, \nqualitative material. However, a less encouraging omen is the recent column in  the UK \nEconomic and Social research Councils ‘Social Sciences news’, penned by the chief \nexecutive (Marshall 2001). In it he asserts: ‘British universities and colleges are not \nproducing quantitatively competent social scientists in sufficient numbers’. Although he \ndoes not mention what ‘non-quantitative’ research is doing, he discusses a series of \nremedial measures - such as compulsory training in statistics, prioritised awards for \nquantitative PhD projects, tied studentships and specialist research centres. To paraphrase \nSpike Milligan’s comment on army training, the attitude appears to be if someone dies \nwhen you hang them, keep hanging them until they get used to it. It is already feeding \nthrough into new postgraduate Research Training Guidelines. The problem we are told is \nacute, though the evidence presented is scant and ironically seems to be unanalysed, \nqualitative reports from meetings with civil servants, moreover: \n‘Failure to [remedy the shortage] is likely to result in Britain falling behind \nthe rest of Europe, both in the provision of talented quantitative social \nresearchers, and the ability to design public policy on a reliable evidence \nbase.’ \n1 \nIt seems to imply that qualitative research has not only arrived but gone too far.  \n \nWithin geography, the last decade has undoubtedly seen an expansion in qualitative work \nboth in terms of the types of work and the topics addressed. So in this first report I want \nto spend some time looking at the range of topics then beginning to look at the range of \nmethods that might be covered. I want to suggest that we have moved from a period \nwhen papers were prefaced with legitimations of qualitative work, to a time when we are \nseeing debates within qualitative methods over establishing orthodox approaches and \nstandards. I want to conclude this report by pointing towards some gaps, which I hope to \ncomment on further in later reports.  \n \nNew Wine, Old Bottles: changing fields using qualitative methods \n \nQualitative approaches have long had a strong association with cultural and social and \nfeminist geographies, in part as a reaction to quantified social geography. In terms of \ngeographies of gender, feminist critiques of masculinist sciences were picked up and an \nethical argument about rapport and empathy amplified the concern with qualitative \napproaches. This also worked the other way to label qualitative work with a feminised \nlanguage of ‘softness’ as oppose to hard science. The debate though has moved on from \nover-quick assumptions that qualitative work was intrinsically more feminist or \ncommitted, to considering its weaknesses and strengths in a more balanced fashion. The \nambiguous relationship of feminism and qualitative methods can be illustrated by the \nwork of Townsend where Women’s Voices from the Rainforest (1995), and Atlas of \nWomen and Men in India (Raju et al. 2000) both aim to represent women’s experience, \nbut used qualitative and quantitative evidence respectively as a way of gaining attention. \nQualitative research has also had to wrestle with the argument that simply listening to, \ngiving voice to and representing the silenced is not enough (though even achieving that \nmuch can be difficult, see Wilton 1999). As the saying goes, if representation were the \nsame as power, the world would be run by semi-clad, thin, young women. There has also \nbeen ongoing debate not just on the politics and ethics of field work but also the \nacademic institutions of knowledge production and who benefits from the work (Sidaway \n2000). \n \nSo rather than studying the subaltern increasing attention has been given to how \nqualitative studies of elites can inform understandings in an unequal world. Thus recent \neconomic geography has broken the equation of big processes being necessarily studied \nusing big datasets to address global processes through the social situations where \neconomic processes happen. This has often been framed through one of two approaches. \nFirst, a broadly realist ontology that distinguishes between extensive empirical \ngeneralisations about patterns and intensive analyses of causal processes. For instance, \nBeaverstock and Boardwell (2000:281) recount how official data dominated  work on \nglobalisation in the 80s, sectoral survey work in the early nineties, whereas their \ninterviews in the ‘global driver sector’ of banking reveal the movement of personnel as \ninvestment in and deployment of knowledge networks. Similarly Ley’s (1999) work on \n‘entrepreneurs’ and business immigrants to Canada dissected tax records, to show that \nthese immigrants actually had a very low rate of economic activity and his interviews \nrevealed personal agendas at odds with official rationales of fostering new \nentrepreneurial networks. The second, related approach, a consideration of the difference \n3 \ngeography makes, looks at the embedding of economic activities or the culture of firms \nthrough qualitative methods, generally interviews, to study the deployment of tacit or \nlocal knowledges even in global activities (e.g. Agnes 2000, McDowell 1998, Oinas \n1999). Qualitative approaches have enabled the study of, and emphasised the importance \nof, seeing economic activity as a set of lived practices, assumptions and codes of \nbehaviour.  \n \n \nMethodological reflections - between self-criticism and growing confidence: \n \nJohnston has (2000) has recently argued that spatial analysis is in danger of being written \nout of disciplinary textbooks, pointing to the small space accorded quantitative methods \nin general introductory texts. However, that is not true of ‘comprehensive’ \nmethodological texts where some of qualitative approaches are just beginning to \npermeate the undergraduate curriculum, as witnessed by the incorporation of qualitative \nmethods chapters in recent works, but it hardly seems overwhelming. For instance, \nFlowerdew & Martin (1997) include four chapters (out of sixteen) covering participant \nobservation, interviews and interpreting qualitative sources. Kitchin & Tate’s (2000) \nslightly lower level methods text covers ethnography, observation and interviewing - \nthough parametric tests alone get twice the pages given for all forms of qualitative \nfieldwork - but this text is remarkable for including two chapters on qualitative \ninterpretation including one on computer based approaches (using NUD*ist). We might \nperhaps characterise this as establishing a presence though hardly dominance. However,  \nwe are beyond simply championing or justifying qualitative methods and there has been \nself-reflection and criticism. In the next sub-sections I want to reflect on current re-\nevaluations of the most common method (the semi-structured interview) and then reflect \non the where some alternative approaches - principally group work and ethnographies - \nare currently developing. \n \nRe-evaluating Semi-structured  interviews: \nJust as it is appearing in textbooks, there has been a re-examination of the staple semi-\nstructured interview. In terms of the context of research, Elwood & Martin (2000) discuss \nhow the physical location of interviews affects discussion and Valentine (1999) addresses \nthe changes in who says what when interviewing couples in households. Meanwhile the \ncorporate interview is also being re-examined, in response to challenges such as \nCochrane’s (1998:2123) as to whether it is really ‘enough simply to buy a tape recorder, \ninvest in a suit and tie or a smart dress, write some letters, prepare a semi-structured \nquestionnaire and seek out some research subjects’. Herod (1999) assesses how \ninterviews with foreign elites confuse often taken-for-granted notions of who is the \ninsider and outsider, and notions of ‘authentic’ knowledge in cross-cultural qualitative \nstudies. An equally mixed up set of social relations and positions are outlined by \nBeaverstock & Boardman (2000) suggesting issues of commonality may also be \nprominent for researcher and interviewee in situations where travelling researchers \ninterview transnational elites. This theme of insiders and outsiders also appears in \nMullings (1999) problematising the methodological slippage between seeing informants \nas representatives of communities or as actors within corporations. Cochrane (1998) \nreflects on how interview based studies often claim an authority from relaying \nsupposedly privileged and previously hidden knowledge, and thus undermining the \n5 \nreliability of informants is not generally the aim. Hughes (1999) thus suggests we need a \nmore nuanced and critical interpretation of the self-reporting, partially remembered \nnature of corporate interviewee’s accounts of their practices - emphasising that even \nrelatively powerful actors do not have perfect access to information, even should they \nwish to share it. Particularly refreshing in all this work is the pluralising of assumptions \nabout the range of positionalities and relationships where gender, ethnicity, nationality \nand status interact.  \n \nGroup interviews and Ethnography: \nGroup interviews have emerged as an alternative approach to economic issues when \nlooking at consumers (eg Holbrook & Jackson 1996; Miller, et al. 1998). Drawing upon \nlong established market research traditions (though Burgess (1999) also points out \ntraditions derived from therapeutic practice), the use of focus groups has boomed. In this \nfield then the boundaries of academia and commerce blur in a very reflexive system, and \npositionalities and commonalities between academia and business researchers are being \ndestabilised. Thus at a time when many are studying soft capitalism and knowledge \neconomies, Leslie (1999) points out Saatchi advertising has taken on board geographical \nnotions that consumption practice is inflected by where it occurs - to such an extent it \nmarkets a ‘proprietary’ technique of  ‘Anthropological Search’. If the research methods \nseem increasingly connected then Thornton (2000) offers a fascinating account of  the \ninversions and reflexivity needed to conduct an ethnography of the advertising industry.  \n \nIt is surprising that there is such an apparent concentration in geography on interview \nbased methods of research instead of traditional ‘immersive’ ethnography. The two need \nnot be entirely distinct of course, since ethnography can combine both long term \nobservation and repeated interviews (e.g. Beazley 1998). However, in this journal, \nHerbert (2000) recently noted the sparsity of research based on extensive periods of \nparticipant observation - suggesting around 3-5% of journal articles derived from this sort \nof work. Herbert suggests scepticism about the merits of ethnography may be the \nexplanation of this weak presence. He points out this relative absence is limiting studies \nsince this is one of the approaches in qualitative work that can address the non-discursive \nand study what people do as well as what they say. Alternatively, the reliance on \ninterviews may be, as McDowell (1998), hints as a least bad option in circumstances \nwhen other forms of access to research settings are denied. It is certainly true that subtle \ninterpretation of interview material, rather than participatory access, have been used to \nreveal how specific locales enable and sustain identity formation and reproduction \n(Woods 1998; Pain et al. 2000).  I am myself perhaps more inclined to flag up the \npractical difficulties of conducting participant observation not just in terms of gaining \nparticipatory access to field sites but also securing funded periods of absence from home \nto undertake ethnographic research. The latter means getting funding from bodies that \nincreasingly want a clear set of predicted outcomes rather than an evolving programme. \nShurmer-Smith (1998) gives an excellent illustration of these issues in her recent research \nin India describing  a project that had to be fitted in one semester while securing a local \nschool place for her son. Meanwhile she had to justify how the research itself evolved in \nways far from the original proposal into a study of elite formation in situ. As an account \nof working through multiple positions and conflicting demands this is a great case study.  \n \nA different set of dilemmas and directions can be traced in DeLyser’s (1999) work on the \n7 \npreserved ‘ghost town’ of Bodie. She notes that geographical approaches to landscape \nhave tended towards the archival and semiotic, whereas she followed popular practices of \nlandscape interpretation by working as a member of staff alongside the town’s staff of \ninterpreters for ten summers. DeLyser’s account comes from the position of a worker, \nlooking at the practices that produce the portrayal of a mythified landscape. Her work \nresonates with my own experiences with historic reenactors. Here too there were \nreflexivities between ethnography and a group that were themselves making an \n‘ethnographic representation’ of a fictive historical community (Crang 2000). This raises \nquestions of how we recount a situation of closeness to informants and what writing \nstrategies convey co-presence and similarity of academic and participant. On the other \nhand, her ethnography of identity and tourism prompts Kneafsey (2000) to reflect on both \nthe surprising resonances, and lack thereof, of her cultural identity in Ireland and Brittany \nrespectively, where expected commonalities with respondents at her field site in the \nformer were uneasy at best, while in her ‘foreign’ site, respondents’ assumption of \ncommonalities with her were unanticipated. These studies make clear that ethnography, \nidentity politics and tourism all invent notions of culture as objects of interest and thus \nshare aspects of poetics and, occasionally, practice.  \n \nStill there remain difficulties in producing ethnographies on mobile and transnationally \nconnected cultures - though some interesting studies of mobile and transient communities \nare appearing  (e.g. Jaquemet 1999, Murphy 2001). Some recent migration studies have \nshown the potential of qualitative research in examining non-elite but globalised \nprocesses, from Lawson’s (2000) study of poor people’s transnational connections in \nQuito, to Willis and Yeoh (1998) on the gender relationships in transnational households, \nto Ifekwunigwe’s (1999) careful tracing of the senses of diasporic belonging. \nAlternatively, O’Reilly’s (2000) ethnography of a British expatriate community on the \nCosta del Sol is an example of a classic local community study reframed for transnational \ngroups. \n \nTrustworthy Stories: plausibility, rigour and reliability in qualitative work \n \nThere has been continued work not just on the conduct of research but its reporting. Thus \nRevill & Seymour (2000) discuss the possibilities for seeing interviews as producing \nstories. Certainly notions of biographical narrative as shaping self-identity for informants \nhave been important (e.g. Vereni 2000) and recent work continues to show the vital role \nof thinking through similar auto-biographical stories for researchers (e.g. Fielding 2000). \nNotably of late the potential of reflexivity for underwriting good research as come under \nrenewed scrutiny. Reflexivity has become something of a shibboleth -- no one will brag \nabout being unreflexive -- but it has been critiqued for implying the eventual goal of a \nfully known social situation, when claiming to know even our own motives is difficult \nenough (Rose 1997). Rather than aspiring to such transparent knowledge Bennett’s \n(2000) reflexive account offers a dramaturgical version of interviews conducted while \ndoing participant observation among farming households. Her account points out that as \nan anticipated (or desired) audience, the reader is implicated in fieldwork, and goes on to \nlook at the inter-subjective anxieties so often buried in accounts of ‘good research’, the \ncontingencies, and the strains of relating the imperfectly performing ‘me’ to muddled and \nalways partial senses of a true ‘I’, let alone understanding ‘them’ -- the respondents. \nRather Bennett suggests the fragile nature of any understanding. The view of dialogues \n9 \ninvolving the ‘citation’, explicit or not, of others terms and concepts, the anticipation of \nroles and the clashing of speech genres has also been stressed as a way of understanding \ncorporate interviews by Oinas (1999). We do need to question the all too common \nassumption that there is one researcher, with an unchanging and knowable identity, and \none project, with a singular unwavering aim.  \n \nThese accounts of the situated production of knowledge suggest that the informant quote, \nor even the full transcript is poorly served by being taken as ‘data’. Leslie (1999) points \nout how researchers’ concerns over maintaining the validity and reliability of qualitative \nwork in business research have entailed resisting the evidential ‘mining’ of responses for \nthe ready quote and pushing for more codified approaches. In geography, there has also \nbeen debate about ways of ensuring the rigour and evidential quality of qualitative work, \nset in motion by Baxter & Eyles’s (1997) critique of the lack of methodological \ntransparency in published papers based on interviews. They endorse Lincoln and Guba’s \ninfluential set of categories --  of credibility of the account (glossed as authenticated \nrepresentation), the transferability of the material (intelligibility to the audience), the \ndependability of the interpretation (whether it is idiosyncratic or partial) and finally its \nconfirmability (say through personal reflection, audit processes, opportunities for \ninformants to reply). Their call was responded to by Bailey et al. (1999) who \nacknowledge the issue of audit and transparency, to allow capricious interpretations to be \nchallenged,  but worry over the loss of idiosyncrasy and creative insight. Meanwhile \nWinchester (1999) casts doubt on the popular response of using the triangulation of \ndifferent methods - worrying the complementarity may be illusory rather than real, and \nmore fundamentally, raising concerns that rigour is being equated with an empirical \nrealist, objectivist generalisability (page 63). Certainly the burgeoning use of software \npackages to help with interpretation is often promoted under this rubric (for summaries \nsee Crang et al. 1997, Hinchliffe et al 1997). It seems to me these debates are touching \nupon unresolved arguments where qualitative interpretation has very often got an \nevidential realist flavour - that for all the reflexive arguments over positionality, the \nanalysis leans towards ‘verificational realism’ (Rennie 1998). The transcripts are \nevidence, against which theories can be tested and drawn. And yet this sits awkwardly \nwith some of the more intersubjective, dialogic ethnographic approaches outlined above, \nwhere the emphasis is on the speech act not the written account, and language as doing \nrather than representing (Laurier 1999). \n \nGaps in the literature. \n \nI want to close this report by highlighting a few noteworthy omissions from current \napproaches. Most strikingly amongst this current work we can note the concentration \nremains strongly on the verbal. Some good work is now emerging on the visual, most \nsignificantly Gillian Roses’s (2001) text which, for someone who teaches practicals on \nvisual media where students ask ‘is there a textbook?’, is very helpful. It is a good text \nwith a finely angled argument balanced with a degree of catholicism about methods that \nadds to some recent texts outside geography (Emmison & Smith 2000, Van Leeuwen & \nJewitt 2001). It does not branch out into ethnographic films, but new texts by Banks \n(2001, Banks and Morphy 1999), Russell (1999)  and Pink (2001) offer a good mix of \nillustrative material and guidance on that topic. Alternately Hopkins’ (1998) offers a \ntemplate for structured interpretation of visual sources, such as promotional material, \n11 \nwhile Becker (2000) provides an exemplary study of using photography as part of \nethnographic fieldwork. \n \nHowever, what does seem underplayed in the literature are approaches and methods that \ntake up the recent growth in interest in non-cognitive, embodied and haptic experiences. \nInterests in different ways of knowing and producing knowledge about the world do not \ncome through that strongly. The opening up to different methods and approaches from \n(semi-structured) interviews is something I hope to focus upon a little more next year. \n \n \nReferences: \n \nAgnes, P. 2000: The “end of geography” in financial services? Local embeddedness and \nterritorialisation in the interest rate swaps industry. Economic Geography 76, \n347-66. \nBailey, C., White, C. and Pain R., 1999: Evaluating qualitative research, dealing with \nthe tensions between ‘science’ and ‘creativity’. Area 31, 169-83. \nBanks, M. 2001: Visual methods in social research. London, Sage. \nBanks, M. and Morphy, H., editors, 1999: Rethinking visual anthropology. Harvard: \nYale University Press. \nBaxter, J. and Eyles, J. 1997: Evaluating qualitative research in social geography: \nestablishing ‘rigour’ in interview analysis. Transactions, Institute of British \nGeographers 22, 505-25. \nBeaverstock, J. and Boardwell, J. 2000: Negotiating globalization, transnational \ncorporations and global city financial centres in transient migration studies. \nApplied Geography 20, 277-304 \nBeazley, H. 1998: Subcultures of resistance: street children’s conception and use of \nspace in Indonesia. Malaysian Journal of Tropical Geography 29, 11-22. \nBecker, K. 2000: Picturing a field: relationships between visual culture and photographic \npractice in a fieldwork setting. In Anttonen, P., editor, Folklore, heritage politics \nand ethnic diversity. Botkyrka, Sweden: Multicultural Centre, 100-21. \nBennett, K. 2000: Inter\/viewing and Inter\/subjectivities: powerful performances. In \nHughes, A. Morris, C. and  Seymour, S., editors, Ethnography and Rural \nResearch. Cheltenham: Countryside and Community Press, 120-35. \nBurgess, J. 1999: The genesis of in-depth discussion groups: a response to Liz Bondi. \nProfessional Geographer 51, 458-60. \nCochrane, A. 1998: Illusions of power: interviewing local elites, Environment & \nPlanning A 30, 2121-32. \nCrang, M. 2000: Playing nymphs and swains in a pastoral idyll. In Hughes, A. Morris, \nC. and  Seymour, S., editors, Ethnography and rural research. Cheltenham: \nCountryside and Community Press, 158-78. \nCrang, M., Hinchliffe, S., Hudson, A. and Reimer, S. 1997: ‘Software for qualitative \nresearch: 1 prospectus and overview’  Environment & Planning A 29, 771-787. \nDeLyser, D. 1999: Authenticity on the ground: engaging the past in a California ghost \ntown. Annals, Asociation of American Geographers 89, 602-32. \nElwood, S. and Martin, D. 2000: “Placing” interviews: location and scales of power in \nqualitative research. Professional Geographer 52, 649-57. \n13 \nEmmison, M. and Smith, P. 2000: Researching the visual : images, objects, contexts \nand interactions in social and cultural inquiry. London: Sage.\nFielding, S. 2000: The importance of being Shaun: self-reflection and ethnography. In \nHughes, A. Morris, C. and  Seymour, S., editors, Ethnography and rural \nresearch. Cheltenham: Countryside and Community Press, 66-80. \nFlowerdew, R. and Martin, D., editors, 1997: Methods in human geography. London: \nLongman. \nHerbert, S. 2000: For ethnography. Progress in Human Geography 24, 550-68. \nHerod, A. 1999: Reflections on interviewing foreign elites: praxis, positionality, validity \nand the cult of the insider. Geoforum 30, 313-27. \nHinchliffe, S., Hudson A., Crang M. and Reimer, S. 1997: Software for qualitative \nresearch: 2 some thoughts on aiding analysis’ Environment & Planning A 29, \n1109-1124. \nHolbrook, B. and Jackson, P. 1996: Shopping around: focus group research in North \nLondon. Area 28, 136-42. \nHopkins J. 1998: Signs of the post-rural: marketing myths of a symbolic countryside. \nGeografiska Annaler 80 B, 65-81. \nHughes, A. 1999: Constructing economic geographies from corporate interviews: \ninsights from a cross-country comparison of retailer-supplier relationships. \nGeoforum 30, 363-74. \nIfekwunigwe, J. 1999: Scattered belongings: cultural paradoxes of “race”, nation and \ngender.  London: Routledge. \nJacquemet, M. 1999: From the Atlas to the Alps: chronicle of a Moroccan migration. In \nHolston, J., editor, Cities and citizenship. Durham, NC: Duke University Press, \n242-53. \nJohnston, R. 2000: On disciplinary history and textbooks: or where has spatial analysis \ngone? Australian Geographical Studies 38, 125-37. \nKitchin, R. and Tate, N. 2000: Conducting research into human geography: theory, \nmethodology & practice. London: Prentice Hall. \nKneafsey, M. 2000: Changing roles and constructing identities: ethnography in the \nCeltic periphery. In Hughes, A. Morris, C. and  Seymour, S., editors, \nEthnography and rural research. Cheltenham: Countryside and Community \nPress, 52-65. \nLaurier, E. 1999: Geographies of talk: ‘Max left a message for you’. Area 31, 36-45 \nLawson, V. 2000: Arguments within geographies of movement: the theoretical potential \nof migrants’ stories. Progress in Human Geography 24, 173-89. \nLeslie, D. 1999: Consumer subjectivity, space and advertising research. Environment & \nPlanning A 31, 1443-57. \nLey, D. 1999: Myths and meanings of immigration in the metropolis. Canadian \nGeographer 43, 2-18. \nMarshall, G. 2001: Addressing a problem of capacity. Social Sciences 47, 1-2. \nMcDowell, L. 1998: Elites in the city of London: some methodological considerations. \nEnvironment & Planning A 30, 2133-46. \nMiller, D, Jackson, P., Thrift, N., Holbrook, B. and Rowlands, M. 1998: Shopping, \nplace and identity. London: Routledge. \nMullings, B. 1999: Insider or outsider, both or neither: some dilemmas of interviewing in \na cross-cultural setting. Geoforum 30, 337-50. \nMurphy, L. 2001: Exploring social Interactions of backpackers. Annals of Tourism \n15 \nResearch 28, 50-67. \nO’Reilly, K. 2000: The British on the Costa Del Sol: transnational identities and local \ncommunities. London: Routledge.  \nOinas, P. 1999: Voices and silences: the problem of access to embeddedness. Geoforum \n30, 351-361. \nPain, R., Mowl, G. and Talbot, C. 2000: Difference and the negotiation of ‘old age’ \nEnvironment & Planning D: Society & Space 18, 377-93. \nPink, S. 2001: Doing visual ethnography : images, media and representation in \nresearch. London: Sage. \nRaju, S. Atkins, P., Townsend J., and Kumar, N. 2000: Atlas of women and men in \nIndia. London: International Books. \nRevill, G. and Seymour, S. 2001: Telling stories: story telling as a textual strategy. In \nHughes, A. Morris, C. and  Seymour, S., editors, Ethnography and rural \nresearch. Cheltenham: Countryside and Community Press, 136-57. \nRennie, D. 1998: Grounded theory methodology: the pressing need for  a coherent logic \nof justification. Theory & Psychology 8, 101-19. \nRose, G. 1997: Situating knowledges: positionality, reflexivities and other tactics. \nProgress in Human Geography 21, 305-20 \nRose, G. 2001: Visual methodologies. London: Sage. \nRussell, C. 1999: Experimental ethnography: the work of film in the age of video. \nDurham: Duke University Press. \nShurmer-Smith, P. 1998: Becoming a memsahib: working with the Indian \nAdministrative Service. Environment & Planning A 30, 2163-79. \nSidaway, J. 2000: Recontextualising positionality: geographical research and academic \nfields of power. Antipode 32, 260-70. \nThornton, S. 2000: An academic Alice in adland: ethnography and the commercial \nworld. Critical Quarterly 41, 57-68. \nTownsend, J. 1995: Women's voices from the rainforest. London: Routledge. \nValentine, G. 1999: Doing Household Research: interviewing couples together and \napart. Area 31, 67-74. \nVan Leeuwen, T. and Jewitt, C., editors, 2001: Handbook of visual analysis. London: \nSage. \nVereni, P. 2000: Os Ellen Makedonia: autobiography, memory and national identity in \nwestern Greek Macedonia. In Cowan, J., editor, Macedonia and the politics of  \nidentity and difference. London: Pluto Press, 47-67. \nWilton, R. 1999: Qualitative health research: negotiating life with HIV\/AIDS. \nProfessional Geographer 51, 254-64. \nWinchester, H. 1999: Interviews and questionnaires as mixed methods in population \ngeography: the case of lone fathers in Newcastle, Australia. Professional \nGeographer 51, 60-7. \nWoods, M. 1998: Rethinking elites: networks, spaces and local politics. Environment & \nPlanning A 30, 2101-20. \nWillis, K. and Yeoh, B. 1998: The social sustainability of Singapore's regionalisation \ndrive. Third World Planning Review 20, 203-221.  \n \n17 \n"}