{"doi":"10.1186\/1741-7007-5-20","coreId":"65748","oai":"oai:dro.dur.ac.uk.OAI2:4913","identifiers":["oai:dro.dur.ac.uk.OAI2:4913","10.1186\/1741-7007-5-20"],"title":"Primate brain architecture and selection in relation to sex.","authors":["Lindenfors, P.","Nunn, C. L.","Barton, R. A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-05-01","abstract":"Background: Social and competitive demands often differ between the sexes in mammals. These differing demands should be expected to produce variation in the relative sizes of various brain structures. Sexual selection on males can be predicted to influence brain components handling sensory-motor skills that are important for physical competition or neural pathways involving\\ud\naggression. Conversely, because female fitness is more closely linked to ecological factors and social interactions that enable better acquisition of resources, social selection on females should select for brain components important for navigating social networks. Sexual and social selection acting on one sex could produce sexual dimorphism in brain structures, which would result in larger\\ud\nspecies averages for those same brain structures. Alternatively, sex-specific selection pressures could produce correlated effects in the other sex, resulting in larger brain structures for both males and females of a species. Data are presently unavailable for the sex-specific sizes of brain structures for anthropoid primates, but under either scenario, the effects of sexual and social selection should leave a detectable signal in average sizes of brain structures for different species.\\ud\n\\ud\nResults: The degree of male intra-sexual selection was positively correlated with several structures involved in autonomic functions and sensory-motor skills, and in pathways relating to aggression and aggression control. The degree of male intra-sexual selection was not correlated\\ud\nwith relative neocortex size, which instead was significantly positively correlated with female social\\ud\ngroup size, but negatively correlated with male group size.\\ud\n\\ud\nConclusion: Sexual selection on males and social selection on females have exerted different effects on primate brain architecture. Species with a higher degree of male intra-sexual selection carry a neural signature of an evolutionary history centered on physical conflicts, but no traces of increased demands on sociocognitive tasks. Conversely, female sociality is indicated to have driven\\ud\nthe evolution of socio-cognitive skills. Primate brain architecture is therefore likely to be a product of ecological and species-specific social factors as well as different sex-specific selection pressures. Our results also highlight the need for acquisition and analysis of sex-specific brain components in mammals","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65748.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4913\/1\/4913.pdf","pdfHashValue":"c85e34b02c9219cfc0f19cb003391c70bc02fe93","publisher":"BioMed Central","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4913<\/identifier><datestamp>\n      2011-09-09T13:53:39Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Primate brain architecture and selection in relation to sex.<\/dc:title><dc:creator>\n        Lindenfors, P.<\/dc:creator><dc:creator>\n        Nunn, C. L.<\/dc:creator><dc:creator>\n        Barton, R. A.<\/dc:creator><dc:description>\n        Background: Social and competitive demands often differ between the sexes in mammals. These differing demands should be expected to produce variation in the relative sizes of various brain structures. Sexual selection on males can be predicted to influence brain components handling sensory-motor skills that are important for physical competition or neural pathways involving\\ud\naggression. Conversely, because female fitness is more closely linked to ecological factors and social interactions that enable better acquisition of resources, social selection on females should select for brain components important for navigating social networks. Sexual and social selection acting on one sex could produce sexual dimorphism in brain structures, which would result in larger\\ud\nspecies averages for those same brain structures. Alternatively, sex-specific selection pressures could produce correlated effects in the other sex, resulting in larger brain structures for both males and females of a species. Data are presently unavailable for the sex-specific sizes of brain structures for anthropoid primates, but under either scenario, the effects of sexual and social selection should leave a detectable signal in average sizes of brain structures for different species.\\ud\n\\ud\nResults: The degree of male intra-sexual selection was positively correlated with several structures involved in autonomic functions and sensory-motor skills, and in pathways relating to aggression and aggression control. The degree of male intra-sexual selection was not correlated\\ud\nwith relative neocortex size, which instead was significantly positively correlated with female social\\ud\ngroup size, but negatively correlated with male group size.\\ud\n\\ud\nConclusion: Sexual selection on males and social selection on females have exerted different effects on primate brain architecture. Species with a higher degree of male intra-sexual selection carry a neural signature of an evolutionary history centered on physical conflicts, but no traces of increased demands on sociocognitive tasks. Conversely, female sociality is indicated to have driven\\ud\nthe evolution of socio-cognitive skills. Primate brain architecture is therefore likely to be a product of ecological and species-specific social factors as well as different sex-specific selection pressures. Our results also highlight the need for acquisition and analysis of sex-specific brain components in mammals.<\/dc:description><dc:publisher>\n        BioMed Central<\/dc:publisher><dc:source>\n        BMC biology, 2007, Vol.5(20) [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-05-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4913<\/dc:identifier><dc:identifier>\n        issn:1741-7007<\/dc:identifier><dc:identifier>\n        doi:10.1186\/1741-7007-5-20<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4913\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1186\/1741-7007-5-20<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4913\/1\/4913.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["1741-7007","issn:1741-7007"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n02 February 2009\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nLindenfors, P. and Nunn, C. L. and Barton, R. A. (2007) ’Primate brain architecture and selection in relation\nto sex.’, BMC biology., 5 (20).\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1186\/1741-7007-5-20\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n02 February 2009\nVersion of attached file:\nPublished\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nLindenfors, P. and Nunn, C. L. and Barton, R. A. (2007) 'Primate brain architecture and selection in relation\nto sex.', BMC Biology, 5 (20),\nFurther information on publishers website:\nhttp:\/\/dx.doi.org\/10.1186\/1741-7007-5-20\nBioMed Central\nPage 1 of 9\n(page number not for citation purposes)\nBMC Biology\nOpen AccessResearch article\nPrimate brain architecture and selection in relation to sex\nPatrik Lindenfors*1,5, Charles L Nunn2,3 and Robert A Barton4\nAddress: 1Department of Zoology, Stockholm University, S-106 91 Stockholm, Sweden, 2Max Planck Institute for Evolutionary Anthropology, \n04103 Leipzig, Germany, 3Department of Integrative Biology, University of California, Berkeley, CA 94720-3140, USA, 4Evolutionary \nAnthropology Research Group, Durham University, Durham DH1 3HN, UK and 5PO Box 194 23, 202 KNH, Nairobi, Kenya\nEmail: Patrik Lindenfors* - Patrik.Lindenfors@zoologi.su.se; Charles L Nunn - nunn@eva.mpg.de; Robert A Barton - R.A.Barton@durham.ac.uk\n* Corresponding author    \nAbstract\nBackground: Social and competitive demands often differ between the sexes in mammals. These\ndiffering demands should be expected to produce variation in the relative sizes of various brain\nstructures. Sexual selection on males can be predicted to influence brain components handling\nsensory-motor skills that are important for physical competition or neural pathways involving\naggression. Conversely, because female fitness is more closely linked to ecological factors and social\ninteractions that enable better acquisition of resources, social selection on females should select\nfor brain components important for navigating social networks. Sexual and social selection acting\non one sex could produce sexual dimorphism in brain structures, which would result in larger\nspecies averages for those same brain structures. Alternatively, sex-specific selection pressures\ncould produce correlated effects in the other sex, resulting in larger brain structures for both males\nand females of a species. Data are presently unavailable for the sex-specific sizes of brain structures\nfor anthropoid primates, but under either scenario, the effects of sexual and social selection should\nleave a detectable signal in average sizes of brain structures for different species.\nResults: The degree of male intra-sexual selection was positively correlated with several\nstructures involved in autonomic functions and sensory-motor skills, and in pathways relating to\naggression and aggression control. The degree of male intra-sexual selection was not correlated\nwith relative neocortex size, which instead was significantly positively correlated with female social\ngroup size, but negatively correlated with male group size.\nConclusion: Sexual selection on males and social selection on females have exerted different\neffects on primate brain architecture. Species with a higher degree of male intra-sexual selection\ncarry a neural signature of an evolutionary history centered on physical conflicts, but no traces of\nincreased demands on sociocognitive tasks. Conversely, female sociality is indicated to have driven\nthe evolution of socio-cognitive skills. Primate brain architecture is therefore likely to be a product\nof ecological and species-specific social factors as well as different sex-specific selection pressures.\nOur results also highlight the need for acquisition and analysis of sex-specific brain components in\nmammals.\nPublished: 10 May 2007\nBMC Biology 2007, 5:20 doi:10.1186\/1741-7007-5-20\nReceived: 11 December 2006\nAccepted: 10 May 2007\nThis article is available from: http:\/\/www.biomedcentral.com\/1741-7007\/5\/20\n© 2007 Lindenfors et al; licensee BioMed Central Ltd. \nThis is an Open Access article distributed under the terms of the Creative Commons Attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), \nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.\nBMC Biology 2007, 5:20 http:\/\/www.biomedcentral.com\/1741-7007\/5\/20\nPage 2 of 9\n(page number not for citation purposes)\nBackground\nPrimate brain architecture has been shown to correlate\nwith both ecological [1-3] and social [4-9] factors. Social\nand competitive demands often differ between the sexes,\nhowever, which should leave predictable marks in the rel-\native sizes of key brain structures [4,8-11]. The aim of this\npaper was to investigate the relationship between selec-\ntion in relation to sex and the evolution of brain architec-\nture in primates, and to draw attention to this largely\nneglected aspect of mammalian brain evolution.\nSelection in relation to sex occurs whenever any geneti-\ncally influenced morphological trait or behavior increases\nthe fitness of one sex, but not the other. One well-known\ninstance of this process in mammals is male-male compe-\ntition for sexual access to females, which has resulted in a\ndiverse array of characters important for males in conflict\nsituations [12,13]. In primates, for example, this type of\nmale intra-sexual selection has been shown to result in\nsexual size dimorphism in traits important for male com-\nbat, such as canine teeth [14,15] and body mass [16,17].\nWe used phylogenetic comparative methods to investigate\nwhether two types of selection in relation to sex-intra-sex-\nual selection on males through male-male physical com-\npetition and social selection in females-have had\npredictable effects on species-typical brain structures in\nprimates. To be successful in male-male physical compe-\ntition, a primate male in a polygynous species not only\nneeds to be large and have imposing canines, but also to\ndisplay, control and use his weapons and size effectively.\nNo matter what their physical equipment might be, males\nwithout such abilities should self-evidently be less able to\nsucceed in competitive situations. A male can potentially\nbe proficient in the use of his assets through quick, agile\nand skillful movements, thus gaining an edge on his\nopponent physically, or he can use intelligence to outwit\nthe competition, thus decreasing the amount of direct\nphysical conflict necessary. The former strategy involves\nphysical movements, while the latter involves cognitive\nprocesses intended at avoiding such movements.\nFrom this reasoning, we derived four, not mutually exclu-\nsive, hypotheses involving male intra-sexual selection. (i)\nIf physical combat is important, the effects of sexual selec-\ntion on brain architecture should mainly act on brain\nregions with roles in motor skills and the coordination\nbetween sensory and motor information [10], whereas\n(ii) if non-combat social skills are important, we would\nexpect to see effects of sexual selection on brain regions\nwith more general integrative and associative functions,\nsuch as the neocortex [4-9]. (iii) It may also be the case\nthat larger male body mass, resulting from male intra-sex-\nual selection, puts increasing demands on the parts of the\nbrain that handle autonomic nervous activity. (iv) Finally,\nselection due to increased demands from competitive sit-\nuations would also be expected to influence structures\nthat relate to aggression, threat, fear and aggression con-\ntrol.\nWe investigated four predictions derived from these\nhypotheses. These are all subject to the caveat that brain\nfunctions are often distributed between many separate\nstructures; selection for a specific function will therefore\ntend to change several functionally connected brain struc-\ntures simultaneously [18,19]. (1) We expected sexual\nselection for better motor skills [10] to influence compo-\nnents within almost all parts of the brain that function in\nsensory-motor activities. These range from the motor cor-\ntex and other cortical areas in the neocortex that initiate\nvoluntary motor activities, through the mesencephalon\nand diencephalon, to the cerebellum in which fine adjust-\nments of movements are made, and further through the\nmedulla oblongata and pons. (2) In contrast, if males are\nmore commonly in need of strategic cognitive abilities\nwhen competing, this should mainly, if not exclusively, be\nreflected in the relative size of the telencephalon through\nan increased neocortex volume [20]. (3) If effects of sexual\nselection are limited to effects that are caused simply by\nthe need to control a larger body, then this should pro-\nduce relatively larger brain components involved in auto-\nnomic nervous activity, primarily the hypothalamus and\nthe medulla. (4) Structures involved in facilitating aggres-\nsive behavior (the central gray region in the mesen-\ncephalon, the hypothalamus, and amygdala) are expected\nto be larger in more sexually selected species; in contrast,\nstructures relating to controlling aggression (such as the\nseptum) should be smaller, although this last expectation\nis not straightforward as it could as well be argued that\nmore aggressive species also need to better control this\naggression.\nWe also investigated a hypothesis related to the drivers of\nfemale reproductive success. In comparison with males,\nfemale reproductive success is more closely linked to eco-\nlogical factors, including the acquisition and defense of\nresources and protection from predators [21-23]. That\ncauses and consequences of sociality should be consid-\nered independently for the two sexes is also indicated by\nobservations that separate dominance hierarchies are\noften maintained for males and females in primate groups\n[24], and that primate social groups simply tend to have\nmore females than males [25,26]. Although males also\nform alliances in primates [27-29], the conditions favor-\ning these alliances tend to be more restrictive both within\nand across species [30,31]. Thus, cooperation is likely to\nbe more important for females and also more closely tied\nto ecological demands than in males. In terms of social\nselection, we therefore focused on one key prediction\n(prediction 5): we expected that brain components\nBMC Biology 2007, 5:20 http:\/\/www.biomedcentral.com\/1741-7007\/5\/20\nPage 3 of 9\n(page number not for citation purposes)\ninvolved in tasks relating to sociality and cooperation are\nselected for primarily in females [5,11,32], predicting that\nthese brain structures are larger in species characterized by\ngreater female sociality. Such brain centers are primarily,\nbut not exclusively, found in the telencephalon (cere-\nbrum), and within the telencephalon, in the neocortex in\nparticular [33,34].\nIn summary, at least two sex-specific selection factors\nshould leave imprints on how the brain is organized in\ndifferent primate species, producing five predictions. Pre-\ndictions 1–4 involve sexual selection on males for\nincreased sensory-motor coordination, increased size of\nthe areas relating to autonomic functions, cognitive abili-\nties in the context of strategic planning and social net-\nworks, and changes in the structures that relate to\naggression and fear. The fifth and final prediction involves\nsocial selection on females, related to increased cognitive\nabilities in the context of social networks.\nIf social or sexual selection exists, it could have one of two\neffects on sex-specific brain measurements. On the one\nhand, it could select for larger brain structures in both\nsexes; on the other hand, it could lead to sexual dimor-\nphisms. Regarding the first possibility, recent research has\nshown that in anthropoid primates, the degree of sexual\nselection on males is correlated with larger canine size and\ngreater body mass not only in males, but also in females\n[15,17]. Effects on females as a result of selection on\nmales could be due to genetic correlations between the\nsexes in genes determining the character in question [35-\n39], but this is usually expected to be a temporary phe-\nnomenon [36,40,41]. More probable is that selection on\nfemales correlates with intrasexual selection operating in\nmales [40,42], although other mechanisms are also possi-\nble [40].\nAlternatively, if a selection pressure results in sexual\ndimorphisms in brain architecture, this would also result\nin a higher average value for the trait in a species, simply\nbecause the values for one sex would be increased relative\nto the other sex and would therefore increase the mean for\nthat species. We therefore had strong reasons to expect\nthat selection in relation to sex should be clearly detecta-\nble regardless of its specific effects on male and female\nbrains. We emphasize these points because the brain vol-\nume data examined in our study are from unsexed pri-\nmate specimens (Additional files 1 and 2) [43]. The\nresults presented below provide a strong argument for\nobtaining sex-specific measures for more detailed analyses\nwithin and across species.\nResults\nOur first set of analyses concerned the major subdivisions\nof the brain. These tests showed that body mass dimor-\nphism was significantly positively correlated with the rel-\native volumes of the medulla oblongata, mesencephalon\nand diencephalon, and negatively correlated with the rel-\native volumes of the pons and telencephalon (Table 1).\nThe telencephalon may also have been the target of social\nselection differing between the sexes, as indicated by a\nnegative correlation between relative telencephalon vol-\nume and male group size, but a positive correlation with\nfemale group size, whereas correlations in the opposite\ndirection were found in analyses of the diencephalon\n(Table 1). These analyses controlled for total brain vol-\nume (see Methods).\nTo further assess how functional differences between\nmales and females operate on different brain structures,\nwe analyzed specific structures of the telencephalon. The\nresults concerning social selection showed that sociality\nfor both males and females was correlated with different\ncomponents of the telencephalon. Whereas male group\nsize was significantly negatively correlated with the rela-\ntive volumes of the septum, schizocortex and perhaps the\nneocortex (partial regression p = 0.064), female group size\nwas positively correlated with relative neocortex volume\n[32] and negatively correlated with relative hippocampus\nvolume (Table 2). Body mass dimorphism also correlated\nnegatively with the relative sizes of the septum, striatum\nand schizocortex, but positively with the relative size of\nthe amygdala (Table 2). As in the case of the brain compo-\nnents, these analyses also controlled for total brain vol-\nume.\nFor methodological reasons involving a possibly con-\nfounding effect of body mass (see Methods), we re-ran all\nanalyses with female body mass forced into the regression\nmodels (Additional files 3 and 4). These results support\nthe same patterns as those presented above, except that\nthe relative volume of the pons in this scenario was not\nsignificantly correlated with sexual size dimorphism\n(Additional file 3). Although these results are similar to\nthose presented, Variance Inflation Factors (VIFs) indicate\nthat these regression models were unstable (see Methods).\nTo ensure that our results were not due to undue influ-\nences of results concerning the large volume of the neo-\ncortex, we repeated our analyses after removing the\nneocortex volumes from the \"remaining brain volume\"\nvariable used to correct for allometric effects (Additional\nfiles 5 and 6). These results also support the general pat-\nterns presented above, except that the diencephalon was\nno longer significantly correlated with male and female\ngroup sizes, and female group size was positively corre-\nlated with the relative volumes of the septum and striatum\nbut not significantly correlated with that of the hippocam-\npus.\nBMC Biology 2007, 5:20 http:\/\/www.biomedcentral.com\/1741-7007\/5\/20\nPage 4 of 9\n(page number not for citation purposes)\nTable 2: Stepwise multiple regression models: telencephalon components\nTelencephalon components (dependent variables)\nIndependent variables included in the best \nmodeL\nSeptum Striatum Amygdala Schizocortex Hippocampus Neocortex\nTotal brain volume minus the dependent \ncomponent\nb = 0.838 b = 0.947 b = 0.581 b = 0.856 b = 0.812 b = 1.405\nt = 19.986 t = 18.384 t = 8.978 t = 13.085 T = 12.946 t = 21.420\np << 0.001 p << 0.001 p << 0.001 p << 0.001 p << 0.001 p << 0.001\nSexual dimorphism b = -0.212 b = -0.373 b = 0.363 b = -0.542 -- --\nt = -2.892 t = -4.258 t = 3.308 t = -4.731\np = 0.010 p < 0.001 p = 0.004 p < 0.001\nFemale group size -- -- -- -- b = -0.117 b = 1.136\nT = -2.268 t = 3.398\np = 0.036 p = 0.003\nMale group size b = -0.071 -- -- b = -0.188 -- b = -0.058\nt = -3.053 t = -5.191 t = -1.984\np = 0.007 p << 0.001 p = 0.064\nWhole model F(3,17) = 158.25 F(2,18) = 182.92 F(2,18) = 77.256 F(3,17) = 67.947 F(2,18) = 84.643 F(3,17) = 409.79\nR2 = 0.965 R2 = 0.953 R2 = 0.896 R2 = 0.923 R2 = 0.4907 R2 = 0.986\np << 0.001 p << 0.001 p << 0.001 p << 0.001 p << 0.001 p << 0.001\nThe table shows results from separate multiple regression models based on independent contrasts investigating the effects of four independent \nvariables on seven different main components of the primate telencephalon.\nThe models were constructed by sequentially removing variables, keeping those with p ≤ 0.1. Each column contains one best regression model \nrelating to that specific telencephalon component. Numbers to the right of each independent variable are the partial regression coefficients for that \nspecific variable, while the numbers in the bottom row give statistics for the multiple regression models. Dashes indicate variables excluded from \nthe final best models because they had a partial regression p > 0.1.\nTable 1: Stepwise multiple regression models: brain components\nBrain components (dependent variables)\nIndependent variables included in the best model Pons Medulla oblongata Cerebellum Mesencephalon Diencephalon Telencephalon\nTotal brain volume minus the dependent variable b = 1.233 b = 0.734 b = 1.030 b = 0.646 b = 0.841 b = 1.090\nt = 21.016 t = 17.239 t = 22.734 t = 20.520 t = 30.225 t = 28.424\np << 0.001 p << 0.001 p << 0.001 p << 0.001 p << 0.000 p << 0.001\nSexual size dimorphism b = -0.240 b = 0.369 - b = 0.168 b = 0.140 b = -0.182\nt = -2.421 t = 5.093 t = 3.134 t = 3.294 t = -3.227\np = 0.026 p << 0.001 p = 0.006 p = 0.005 p = 0.005\nFemale group size -- -- -- -- b = -0.064 b = 0.119\nt = -2.143 t = 3.259\np = 0.048 p = 0.005\nMale group size -- -- -- -- b = 0.043 b = -0.062\nt = 2.021 t = -2.335\np = 0.060 p = 0.033\nWhole model F(2,18) = 258.21 F(2, 18) = 260.89 F(1,19) = 516.82 F(2,18) = 317.32 F(4,16) = 409.56 F(4,16) = 352.48\nR2 = 0.966 R2 = 0.967 R2 = 0.964 R2 = 0.972 R2 = 0.990 R2 = 0.989\np << 0.001 p << 0.001 p << 0.001 p << 0.001 p << 0.001 p << 0.001\nThe table shows results from separate multiple regression models based on independent contrasts investigating the effects of four independent \nvariables on six different main components of the primate brain.\nThe models were constructed by sequentially removing variables, keeping those with p ≤ 0.1. Each column contains one best regression model \nrelating to that specific brain component. Numbers to the right of each independent variable are the partial regression coefficients for that specific \nvariable, and the numbers in the bottom row give statistics for the multiple regression models. Dashes indicate variables excluded from the final \nbest models because they had a partial regression p > 0.1.\nBMC Biology 2007, 5:20 http:\/\/www.biomedcentral.com\/1741-7007\/5\/20\nPage 5 of 9\n(page number not for citation purposes)\nVariation in female group sizes is larger than variation in\nmale group sizes, which could unduly influence our\nmodel choice in the stepwise regression analyses. The\nlarger variance of female group size could tend to include\nfemale group size in the model first, thereby possibly forc-\ning the correlated measure of male group size out of the\nmodels. For this reason, we checked all results by includ-\ning the group sizes of the two sexes independently in all\nmodels. This produced qualitatively similar results to\nthose presented above; for example, whenever male group\nsize was non-significant when female group size was also\nincluded, it was also non-significant when female group\nsize was not included. Thus, with only the few exceptions\noutlined in the previous two paragraphs, the results pre-\nsented in Tables 1 and 2 remained consistent when run-\nning the analyses with alternative assumptions.\nDiscussion\nOur analyses indicate that selection in relation to sex has\nbeen an important influence on primate brain architec-\nture. The results showed that sexual selection on males has\nacted positively on the relative sizes of the medulla, mes-\nencephalon and diencephalon, but negatively on the pons\nand telencephalon. In the case of social selection, the aver-\nage group size of females was positively correlated with\nthe relative size of the telencephalon. As has already been\nshown elsewhere using the same dataset [32], this latter\neffect is apparently mediated through a positive correla-\ntion between female group size and the relative size of the\nneocortex. This indicates that female sociality is responsi-\nble for the evolutionary change in relative neocortex size\nthat has taken place in haplorhine primates. These results\nalso suggest that social demands on females and compet-\nitive demands on males require skills mainly handled by\ndifferent brain components.\nOur analyses fail to support the hypothesis that sexual\nselection on males has selected for enhanced cognitive\nabilities, based in particular on the negative correlation\nbetween sexual dimorphism and relative telencephalon\nvolume, and the lack of a significant association between\nsexual dimorphism and neocortex volume. Further indi-\ncations that selection on physical combat skills are more\nimportant is that the mesencephalon, diencephalon (con-\ntaining the hypothalamus) and amygdala, all involved in\ngoverning aggressive behaviors, are positively correlated\nwith the degree of sexual selection, whereas the septum,\nwhich has a role in facilitating aggression control, is\ninstead negatively correlated with the degree of sexual\nselection. Moreover, male group size is positively corre-\nlated with the relative volume of the diencephalon (but\nsee Additional file 5) and negatively correlated with rela-\ntive septum size, further strengthening the conclusion that\naggression is an evolutionarily important component of\nmale-male interactions.\nThe main structures of the brain that were positively cor-\nrelated with the degree of male intra-sexual competition\n(the medulla oblongata, mesencephalon and dien-\ncephalon) all contain important motor centers. The same\nis true for the cerebellum and the telencephalon, but the\nformer is not significantly correlated with size dimor-\nphism and the latter even exhibits a negative correlation.\nGiven the distributed nature of the motor centers in the\nbrain, analyses of the main brain structures provides only\nindirect support for the hypothesis that sexual selection\nacts on motor centers; more detailed data on specific brain\nstructures are therefore needed.\nThe medulla oblongata and the diencephalon are impor-\ntant for autonomic nervous system activity. Significant\ncorrelations involving these structures suggest that larger\nbody size resulting from sexual selection has placed\ndemands on brain structures involved in handling a larger\nbody. Thus, while not providing direct support, our\nresults are in line with two hypotheses that deserve further\nscrutiny: that sexual selection selects for (i) brain struc-\ntures important for success in male-male conflict through\nbetter body control, and (ii) better handling of a larger\nbody through increased importance of structures involved\nin autonomic tasks.\nThe effects of social selection are more clear-cut in that\nthey suggest that different strategies used by males and\nfemales have left marks on primate brain architecture,\nwith female social group size positively and male group\nsize negatively correlated with telencephalon size. Thus,\ndemands of male and female sociality differ fundamen-\ntally in skills governed by the telencephalon, and within\nthis region, especially the neocortex. The neocortex is\nimportant for cognitive skills involved in navigating com-\nplex webs of social relationships [44,45]. As stated in the\nBackground, there are several reasons to expect that such\nsocial abilities concern the reproductive success of females\nmore than males. Our results also indicate that the rela-\ntionship between neocortex volume and male group size\nactually may be negative, further highlighting the specifi-\ncally female aspect of handling social relationships in pri-\nmates. More detailed analyses on the relative sizes of\nstructures within the neocortex would be expected to\nreveal that it is these areas that process social information\nthat are positively correlated with female group size.\nAn important question concerns the epigenetic mecha-\nnisms by which species differences in brain architecture\narise during ontogeny, in particular the relative roles of\nearly, genetically guided ontogenetic processes versus later\nprocesses influenced substantially by environmental\ninput and\/or hormones. For example, experimental evi-\ndence indicates that perturbations of sensory inputs cause\nneural reorganization [46,47]. However, regional differ-\nBMC Biology 2007, 5:20 http:\/\/www.biomedcentral.com\/1741-7007\/5\/20\nPage 6 of 9\n(page number not for citation purposes)\nentiation occurs early in ontogeny, prior to and\/or inde-\npendently of neural innervation from the periphery\n[48,49], and mutations that influence architectonics prior\nto innervation by the periphery have been discovered\n[50]. The role of neurogenesis later in mammalian ontog-\neny (e.g. in adults) appears to be relatively minor in pri-\nmates, and restricted to the hippocampus and olfactory\nbulbs [51-53]. Thus, adult neurogenesis is highly unlikely\nto explain species differences in overall brain architecture.\nFinally, many species differences in brain structure size\nfall outside the range of intra-species variation [18,54].\nThus, while earlier, predominantly prenatal processes are\nundoubtedly crucial, species differences, such as those\nanalyzed here, may be somewhat moderated by later\nontogenetic effects.\nFrom our study of unsexed specimens, we cannot deter-\nmine if social and sexual selection have produced sexual\ndimorphisms in brain size, or whether selection acting on\none sex has had correlated effects on the other sex, thus\nproducing larger brains for that species. The results pre-\nsented here therefore emphasize the value of obtaining\nsex-specific data on brain structures. Several authors have\nproposed or tested hypotheses for sexual dimorphism in\nbrain structures [10,11,20,55,56]. Several additional\nhypotheses can be tested. For example, in more social spe-\ncies, females should be expected to have relatively larger\nneocortices than males. Contrary to our results, however,\nthe fact that reported incidences of innovation behavior\nare higher in males than in females across species [57]\ncould be taken to indicate that males have greater cogni-\ntive abilities. It can possibly be argued that female pri-\nmates use their neocortices mainly to navigate social\nwebs, whereas male neocortices are free to perform other\ntasks. On the other hand, as indicated by our results, in\nmore sexually selected species, a suite of other brain struc-\ntures should be larger in males than in females. To inves-\ntigate such sexual dimorphisms, however, sex-specific\nmeasures of brain components are necessary.\nWe have no reason to expect that the patterns presented\nhere apply only to anthropoid primates; similar patterns\nshould be detectable in other mammal clades, provided of\ncourse that sufficient variation in sociality and\/or intra-\nsexual competition exists. It is even possible that these fac-\ntors have driven brain evolution in mammals and thus\nmay explain differences in brain architecture among dif-\nferent mammal orders. This especially concerns the rela-\ntively large neocortex-a hallmark of primates and a trait\nindicated by this study to be a consequence of the high\ndegree of female sociality in primates-but should also\ninvolve other structures.\nConclusion\nThe results presented here indicate that selection in rela-\ntion to sex is an underappreciated force in primate brain\nevolution. Social selection on females and sexual selec-\ntion on males accounts for significant variation in primate\nbrain architecture. Whereas female sociality is tied to\nincreased cognitive abilities, male sociality and sexual\nselection on males is not. Instead, sexual selection on\nmales has favored brain structures involved in aggression,\nsensory motor functions and autonomic functions. This is\nimportant because selection pressures acting on the brain\nhave previously almost exclusively been treated as uni-\nform in males and females. Given available data, how-\never, it is impossible to know whether these effects lead to\ndimorphism or correlated effects in both sexes. Develop-\nment of new datasets that make use of sexed brains will be\nneeded to address this fundamental question.\nMethods\nData on volumes of different brain structures were gath-\nered from the literature [43,58]. The major structures of\nthe brain included in the analyses were the pons, medulla\noblongata (including the reticular formation), cerebellum\n(including the brachium and the nuclei pontis), mesen-\ncephalon (excluding the reticular nucleus), diencephalon\nand telencephalon (cerebrum). To further investigate\nhypotheses regarding different substructures of the telen-\ncephalon, we also used volume information for the sep-\ntum, striatum, amygdala, schizocortex (entorhinal,\nperirhinal and presubicular cortices), hippocampus, and\nneocortex (isocortical grey and underlying white matter).\nAs noted above, information was unavailable for the sexes\nof the animals for the brain measurements.\nWe also gathered data on body mass [59] and group size\n[60] for the species with brain data. Female group size\nserved as a proxy for social complexity [32], whereas sex-\nual size dimorphism was used to measure sexual selection\n[17]. The number of data points limited our choice for\nalternative variables indicating strength of sexual selec-\ntion. Instead, we repeated some of the analyses using\ncanine dimorphism as a proxy for sexual selection, and\nthese analyses produced results similar to those for body\nmass. The fact that more data were available on primate\nbody masses than canine dimensions led us to prefer the\nformer to the latter; thus, body mass dimorphism results\nare presented here. Although data exist for strepsirhine\nprimates, these were not included in the analyses because\nthere is very little variation in both sociality and sexual\nsize dimorphism in the species for which data on the vol-\numes of different brain structures is also available [61-63].\nAll variables were log10-transformed prior to analysis.\nHaplorhine (Old World) primates are generally larger,\nmore dimorphic and live in larger groups than platyrrhine\nBMC Biology 2007, 5:20 http:\/\/www.biomedcentral.com\/1741-7007\/5\/20\nPage 7 of 9\n(page number not for citation purposes)\n(New World) primates. That is, the causal factors we use\nin this study are similar within taxonomic groups, because\nof their shared evolutionary history. For this reason, we\nemployed phylogenetically independent contrasts that\nuse differences between species and taxonomic groups\ninstead of the species' values themselves [64]. This\napproach produces statistics untainted by problems\ncaused by similarity due to common descent. We used\nPurvis' [65] estimate of primate phylogeny, which was cre-\nated using a super-tree technique to combine a large\nnumber of source phylogenies. This phylogeny uses infor-\nmation published to the date of its construction and\nunites knowledge gathered from both molecular and mor-\nphological data. It is therefore based on more informa-\ntion, and covers more species, than any alternative\nphylogeny. Hypothesis testing was performed using the\naforementioned phylogenetically independent contrasts\n[64], as implemented in the computer program PDAP\n[66]. Diagnostic tests showed that branch lengths given in\nPurvis [64] needed no adjustment [67].\nBecause we were interested in investigating the effects of\nmultiple independent variables on different brain compo-\nnents, we analyzed the influence of these variables using\nstepwise multiple regression. To investigate which varia-\nbles were significantly correlated with the dependent var-\niables, we used a backwards-removal procedure with all\nvariables initially included in the model, and then\nsequentially removed variables with significance levels >\n0.1. Because correlations exist between female body mass\nand total brain volumes, between female body mass and\ndimorphism, and between male and female group sizes,\nwe tested whether collinearity rendered our multiple\nregression models unstable by calculating Variance Infla-\ntion Factors (VIFs) [68]. With only one exception, the VIFs\nwere < 10, indicating that collinearity was unlikely to have\na major impact on the stability of the models [68,69]. The\nexception involved female body mass and \"remaining\nbrain volumes,\" which had VIFs> 10, but these analyses\nwere restricted to secondary analyses (Additional files 3\nand 4).\nTo control for allometric effects, we subtracted the volume\nof the brain component under scrutiny from the total\nbrain volume and used this \"remaining brain volume\" as\na covariate in all regression models. Including total brain\nvolume instead of the \"remaining brain volume\" as a cov-\nariate produced results similar to those presented here,\nbut we feel that the measure we used better corrects for\npart-whole correlation problems. The volumes of all\nexamined brain parts were closely correlated to our\n\"remaining brain volume\" measure (p << 0.001; Table 1).\nWe chose \"remaining brain volume\" rather than body\nmass when controlling for allometric effects primarily\nbecause including female body mass and \"remaining\nbrain volume\" together in the regression models almost\nalways gave non-significant partial regression coefficients\nfor female body mass. In addition, brain volume is both\nstatistically and conceptually closer to the brain compo-\nnents under scrutiny than is body mass. To make sure that\nour results were not due to indirect effects of body mass,\nwe double-checked our regression models by forcing\nfemale body mass into the equations (Additional files 3\nand 4). Because the effect of sexual selection on male size\nhas been shown to be a main cause of sexual size dimor-\nphism in haplorhine primates [17], inclusion of male\nbody mass has the unwanted effect of including effects of\nsexual selection in the body mass measure. For this rea-\nson, inclusion of male body mass, or the mixed body\nmasses of Stephan et al. [43], produced results that were\ndifficult to interpret. Although sexual selection also affects\nfemale body mass, these effects are smaller than those on\nmales [17].\nThe telencephalon (cerebrum) is by far the largest sub-\nstructure in the haplorhine primate brain (65–85% of the\ntotal brain volume) and the largest substructure within\nthe telencephalon is by far the neocortex (40–80% of the\ntotal brain volume). Selection pressures affecting the rela-\ntive size of the neocortex could therefore also affect the\nrelative sizes of all other brain components (e.g. if the\nneocortex becomes comparatively larger, the other brain\ncomponents automatically become comparatively\nsmaller). For this reason, we checked our results by repeat-\ning the analyses while excluding the neocortex from the\n\"remaining brain volume\" variable. Results that were sta-\ntistically significant in the first round of analyses but non-\nsignificant when excluding the neocortex volumes (or vice\nversa) have to be judged carefully (Additional files 5 and\n6).\nAuthors' contributions\nPL conceived of the hypotheses and carried out the analy-\nses. PL, CN and RB co- wrote the paper.\nAdditional material\nAdditional File 1\nData on body mass, group size and volumes of major brain components for \nthe primate species analyzed in this study.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1741-\n7007-5-20-S1.doc]\nAdditional File 2\nVolumes of telencephalon structures for the primate species analyzed in \nthis study.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1741-\n7007-5-20-S2.doc]\nBMC Biology 2007, 5:20 http:\/\/www.biomedcentral.com\/1741-7007\/5\/20\nPage 8 of 9\n(page number not for citation purposes)\nAcknowledgements\nWe wish to thank John Gittleman, Robin Dunbar and four anonymous \nreviewers for comments on a previous version of this manuscript. This \nstudy was supported by the Max Planck Society (CN) and NIH grant RO1-\nMH070415-01A1 (CN and RB).\nReferences\n1. Barton RA: Visual specialization and brain evolution in pri-\nmates.  Proc Roy Soc Lond B 1998, 265:1933-1937.\n2. de Winter W, Oxnard CE: Evolutionary radiations and conver-\ngences in the structural organization of mammalian brains.\nNature 2001, 409:710-714.\n3. Fish JL, Lockwood CA: Dietary constraints on encephalization\nin primates.  Am J Phys Anth 2003, 120:171-181.\n4. Deaner RO, Nunn CL, van Schaik CP: Comparative tests of pri-\nmate cognition: Different scaling methods produce different\nresults.  Brain Behav Evol 2000, 55:44-52.\n5. Byrne R, Whiten A: Machiavellian Intelligence Oxford: Oxford Univer-\nsity Press; 1988. \n6. Sawaguchi T, Kudo H: Neocortical development and social\nstructure in primates.  Primates 1990, 31:283-289.\n7. Dunbar RIM: Neocortex size as a constraint of group size in\nprimates.  J Hum Evol 1992, 20:469-493.\n8. Barton RA: Neocortex size and behavioural ecology in pri-\nmates.  Proc Roy Soc Lond, B 1996, 263:173-177.\n9. Kudo H, Dunbar RIM: Neocortex size and social network size\nin primates.  Anim Behav 2001, 62:711-722.\n10. Jacobs LF: Sexual selection and the brain.  Trends Ecol Evol 1996,\n11:A82-A86.\n11. Keverne EB, L. MF, Nevison CM: Primate brain evolution:\ngenetic and functional considerations.  Proc Roy Soc Lond, B 1996,\n262:689-696.\n12. Darwin C: The descent of man and selection in relation to sex London:\nMurray; 1871. \n13. Andersson M: Sexual selection New Jersey: Princeton; 1994. \n14. Plavcan JM, van Schaik CP: Intrasexual competition and canine\ndimorphism in anthropoid primates.  Am J Phys Anth 1992,\n87:461-477.\n15. Thorén S, Lindenfors P, Kappeler PM: Phylogenetic analyses of\ndimorphism in primates: Evidence for stronger selection on\ncanine size than on body size.  Am J Phys Anth 2006, 130:50-59.\n16. Clutton-Brock TH, Harvey PH: Primate ecology and social\norganization.  J Zool, Lond 1977, 183:1-39.\n17. Lindenfors P, Tullberg BS: Phylogenetic analyses of primate size\nevolution: the consequences of sexual selection.  Biol J Linn Soc\n1998, 64:413-447.\n18. Barton RA, Harvey PH: Mosaic evolution of brain structure in\nmammals.  Nature 2000, 405:1055-1058.\n19. Whiting BA, Barton RA: The evolution of the cortico-cerebellar\ncomplex in primates: anatomical connections predict pat-\nterns of correlated evolution.  J Hum Evol 2003, 44:3-10.\n20. Pawlowski B, Lowen CB, Dunbar RIM: Neocortex size, social\nskills and mating success in primates.  Behaviour 1998,\n135:357-368.\n21. Emlen ST, Oring LW: Ecology, sexual selection, and the evolu-\ntion of mating systems.  Science 1977, 197:215-223.\n22. van Schaik CP: The ecology of social relationships amongst\nfemale primates.  In Comparative Socioecology: The Behavioural Ecol-\nogy of Humans and Other Mammals Edited by: Standen V, Foley RA.\nOxford: Blackwell; 1989. \n23. Altmann J: Primate males go where the females are.  Anim\nBehav 1990, 39:193-195.\n24. Smuts BB, Cheney DL, Seyfarth RM, Wrangham RW, Struhsaker TT:\nPrimate societies Chicago: University of Chicago Press; 1987. \n25. Nunn CL: The number of males in primate social groups: a\ncomparative test of the socioecological model.  Behav Ecol\nSociobiol 1999, 46:1-13.\n26. Lindenfors P, Fröberg L, Nunn CL: Females drive primate social\nevolution.  Proc Biol Sci 2004, 271(Suppl 3):S101-3.\n27. Packer C: Reciprocal altruism in Papio anubis.  Nature 1977,\n265:441-443.\n28. Noë R: Alliance formation among male baboons: shopping\nfor profitable partners.  In Coalitions and alliances in humans and\nother animals Edited by: Harcourt AH, de Waal FBM. Oxford: Oxford\nUniversity Press; 1992:285-321. \n29. de Waal FBM: Coalitions as part of reciprocal relations in the\nArnhem chimpanzee colony.  In Coalitions and alliances in humans\nand other animals Edited by: Harcourt AH, de Waal FBM. Oxford:\nOxford University Press; 1992:233-225. \n30. Pandit SA, van Schaik CP: A model for leveling coalitions among\nprimate males: toward a theory of egalitarianism.  Behav Ecol\nSociobiol 2003, 55:.\n31. van Schaik CP, Pandit SA, Vogel ER: A model for within-group\ncoalitionary aggression among males.  Behav Ecol Sociobiol 2004,\n57:101-109.\n32. Lindenfors P: Neocortex evolution in primates: the 'social\nbrain' is for females.  Biol Lett 2005, 1:407-410.\n33. Innocenti GM, Kaas JH: The cortex.  Trends Neurosci 1995,\n18:371-372.\n34. Kaas JH: The evolution of isocortex.  Brain Behav Evol 1995,\n46:187-196.\n35. Maynard Smith J: The evolution of sex.  Cambridge: Cambridge\nUniversity Press; 1978. \n36. Lande R: Sexual dimorphism, sexual selection, and adaptation\nin polygenic characters.  Evolution 1980, 34:292-307.\n37. Lande R, Bradbury JW, Andersson MB: Genetic correlations\nbetween the sexes in the evolution of sexual dimorphism and\nmating preferences.  In Sexual selection: testing the alternatives\nChichester: Johns Wiley & Sons; 1987:83-94. \n38. Lande R, Arnold SJ: The measurement of selection on corre-\nlated characters.  Evolution 1983, 37:1210-1226.\n39. Leutenegger W, Cheverud JM, Jungers WL: Sexual dimorphism in\nprimates: the effects of size.  In Size and scaling in primate biology\nLondon: Plenum Press; 1985:33-50. \n40. Fairbairn DJ: Allometry for sexual size dimorphism: pattern\nand process in the coevolution of body size in males and\nfemales.  Ann Rev Ecol Syst 1997, 28:659-687.\n41. Reeve JP, Fairbairn DJ: Predicting the evolution of sexual size\ndimorphism.  J Evol Biol 2001, 14:244-254.\n42. Lindenfors P: Sexually antagonistic selection on primate size.\nJ Evol Biol 2002, 15:595-607.\nAdditional File 3\nStepwise multiple regression models with forced inclusion of female body \nmass: brain components.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1741-\n7007-5-20-S3.doc]\nAdditional File 4\nStepwise multiple regression models with forced inclusion of female body \nmass: telencephalon components.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1741-\n7007-5-20-S4.doc]\nAdditional File 5\nStepwise multiple regression models without the neocortex: brain compo-\nnents.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1741-\n7007-5-20-S5.doc]\nAdditional File 6\nStepwise multiple regression models without the neocortex: telencephalon \ncomponents.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1741-\n7007-5-20-S6.doc]\nPublish with BioMed Central   and  every \nscientist can read your work free of charge\n\"BioMed Central will be the most significant development for \ndisseminating the results of biomedical research in our lifetime.\"\nSir Paul Nurse, Cancer Research UK\nYour research papers will be:\navailable free of charge to the entire biomedical community\npeer reviewed and published immediately upon acceptance\ncited in PubMed and archived on PubMed Central \nyours — you keep the copyright\nSubmit your manuscript here:\nhttp:\/\/www.biomedcentral.com\/info\/publishing_adv.asp\nBioMedcentral\nBMC Biology 2007, 5:20 http:\/\/www.biomedcentral.com\/1741-7007\/5\/20\nPage 9 of 9\n(page number not for citation purposes)\n43. Stephan H, Frahm H, Baron G: New and revised data on volumes\nof brain structures in insectivores and primates.  Folia Primatol\n1981, 35:1-29.\n44. Dunbar RIM: The social brain hypothesis.  Evol Anth 1998,\n6:178-190.\n45. Adolphs R: The neurobiology of social cognition.  Current Opinion\nNeurobiol 2001, 11:231-239.\n46. Quartz SR, Szenowski TJ: The neural basis of cognitive develop-\nment: A constructivist manifesto.  Behav Brain Sci 1997,\n20:537-559.\n47. Rakic P, Suñer I, Williams RW: A novel cytoarchitectonic area\ninduced experimentally within the primate visual cortex.\nProc Nat Acad Sci USA 1991, 88:2083-2087.\n48. Kennedy HCD: Cortical development: A progressive and\nselective mesh, with or without constructivism.  Behav Brain Sci\n1997, 20:570-571.\n49. Rakic P, Kornack DR: Neocortical expansion and elaboration\nduring primate evolution: a view from neuroembryology.  In\nEvolutionary anatomy of the primate cerebral cortex Edited by: Falk D,\nGibson KR. Cambridge: Cambridge University Press; 2001. \n50. Rakic P: Genetic control of cortical convolutions.  Science 2004,\n303:1983-1984.\n51. van Praag H, Schinder AF, Christie BR, Toni N, Palmer TD, Gage FH:\nFunctional neurogenesis in the adult hippocampus.  Nature\n2002, 415:1030-1034.\n52. Taupin P: Neurogenesis in the adult central nervous system.\nComptes Rendus Biologies 2006, 329:465-475.\n53. Rakic Ps: No more cortical neurons for you.  Science 2006,\n313:928-929.\n54. Striedter GF: Principles of brain evolution.  Cambridge: Cam-\nbridge Univeristy Press; 2004. \n55. Pitnick S, Jones KE, Wilkinson GS: Mating system and brain size\nin bats.  Proc Biol Sci 2006, 273:719-724.\n56. Garamszegi LZ, Eens M, Erritzøe J, Møller AP: Sperm competition\nand sexually size dimorphic brains in birds.  Proc Roy Soc Lond,\nB 2005, 272:159-166.\n57. Reader SM, Laland KN: Primate Innovation: Sex, Age and Social\nRank Differences.  Int J Primatol 2004, 22:787-805.\n58. Matano S, Stephan H, Baron G: Volume comparisons in the cer-\nebellar complex of primates 1. Ventral Pons.  Folia Primatol\n1985, 44:171-181.\n59. Smith RJ, Jungers WL: Body mass in comparative primatology.\nJ Hum Evol 1997, 32:523-559.\n60. Nunn CL, Barton RA: Allometric slopes and independent con-\ntrasts: a comparative test of Kleiber's law in primate ranging\npatterns.  Am Nat 2000, 156:519-533.\n61. Kappeler PM: The evolution of sexual size dimorphism in\nprosimian primates.  Am J Primatol 1990, 21:201-214.\n62. Kappeler PM: Patterns of sexual dimorphism in body weight\namong prosimian primates.  Folia Primatol 1991, 57:132-146.\n63. Kappeler PM, Heymann EW: Nonconvergence in the evolution\nof primate life history and socio-ecology.  Biol J Linn Soc 1996,\n59:297-326.\n64. Felsenstein J: Phylogenies and the comparative method.  Am\nNat 1985, 125:1-15.\n65. Purvis A: A composite estimate of primate phylogeny.  Phil\nTrans Roy Soc Lond, B 1995, 348:405-421.\n66. Garland T Jr, Dickerman AW, Janis CM, Jones JA: Phylogenetic\nanalysis of covariance by computer simulation.  Syst Biol 1993,\n42:265-292.\n67. Garland T Jr, Harvey PH, Ives AR: Procedures for the analysis of\ncomparative data using phylogenetically independent con-\ntrasts.  Syst Biol 1992, 41:18-31.\n68. Quinn GP, Keough MJ: Experimental design and data analysis\nfor biologists.  Cambridge: Cambridge University Press; 2002. \n69. Petraitis PS, Dunham AE, Niewlarowski PH: Inferring multiple\ncausality: the limitataions of path analysis.  Funct Ecol 1996,\n10:421-431.\n"}