{"doi":"10.1017\/S0954102009001795","coreId":"55878","oai":"oai:nora.nerc.ac.uk:11311","identifiers":["oai:nora.nerc.ac.uk:11311","10.1017\/S0954102009001795"],"title":"Soil trampling in an Antarctic Specially Protected Area: tools to assess levels of human impact","authors":["Tejedo, P.","Justel, A.","Benayas, J.","Rico, E.","Convey, Peter","Quesada, A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009","abstract":"Research in extremely delicate environments must be sensitive to the need to minimize impacts caused simply through the presence of research personnel. This study investigates the effectiveness of current advice relating to travel on foot over Antarctic vegetation-free soils. These are based on the concentration of impacts through the creation of properly signed and identified paths. In order to address these impacts, we quantified three factors - resistance to compression, bulk density and free-living terrestrial arthropod abundance - in areas of human activity over five summer field seasons at the Byers Peninsula (Livingston Island, South Shetland Islands). Studies included instances of both experimentally controlled use and natural non-controlled situations. The data demonstrate that a minimum human presence is sufficient to alter both physical and biological characteristics of Byers Peninsula soils, although at the lowest levels of human activity this difference was not significant in comparison with adjacent undisturbed control areas. On the other hand, a limited resilience of physical properties was observed in Antarctic soils, thus it is crucial not to exceed the soil's natural recovery capability","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/55878.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/11311\/1\/download.pdf","pdfHashValue":"5cb7a459525afbcbe8beb50e88e9b139fc81ba37","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:11311<\/identifier><datestamp>\n      2012-11-22T12:13:53Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533139<\/setSpec><setSpec>\n      7375626A656374733D5332<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/11311\/<\/dc:relation><dc:title>\n        Soil trampling in an Antarctic Specially Protected Area: tools to assess levels of human impact<\/dc:title><dc:creator>\n        Tejedo, P.<\/dc:creator><dc:creator>\n        Justel, A.<\/dc:creator><dc:creator>\n        Benayas, J.<\/dc:creator><dc:creator>\n        Rico, E.<\/dc:creator><dc:creator>\n        Convey, Peter<\/dc:creator><dc:creator>\n        Quesada, A.<\/dc:creator><dc:subject>\n        Management<\/dc:subject><dc:subject>\n        Agriculture and Soil Science<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        Research in extremely delicate environments must be sensitive to the need to minimize impacts caused simply through the presence of research personnel. This study investigates the effectiveness of current advice relating to travel on foot over Antarctic vegetation-free soils. These are based on the concentration of impacts through the creation of properly signed and identified paths. In order to address these impacts, we quantified three factors - resistance to compression, bulk density and free-living terrestrial arthropod abundance - in areas of human activity over five summer field seasons at the Byers Peninsula (Livingston Island, South Shetland Islands). Studies included instances of both experimentally controlled use and natural non-controlled situations. The data demonstrate that a minimum human presence is sufficient to alter both physical and biological characteristics of Byers Peninsula soils, although at the lowest levels of human activity this difference was not significant in comparison with adjacent undisturbed control areas. On the other hand, a limited resilience of physical properties was observed in Antarctic soils, thus it is crucial not to exceed the soil's natural recovery capability.<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:date>\n        2009<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/11311\/1\/download.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Tejedo, P.; Justel, A.; Benayas, J.; Rico, E.; Convey, Peter; Quesada, A..  2009  Soil trampling in an Antarctic Specially Protected Area: tools to assess levels of human impact.   Antarctic Science, 21 (3). 229-236.  https:\/\/doi.org\/10.1017\/S0954102009001795 <https:\/\/doi.org\/10.1017\/S0954102009001795>     \n <\/dc:identifier><dc:relation>\n        http:\/\/journals.cambridge.org\/download.php?file=%2FANS%2FANS21_03%2FS0954102009001795a.pdf&code=05aa4366c39504d6d4063bbf512011e1<\/dc:relation><dc:relation>\n        10.1017\/S0954102009001795<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/11311\/","http:\/\/journals.cambridge.org\/download.php?file=%2FANS%2FANS21_03%2FS0954102009001795a.pdf&code=05aa4366c39504d6d4063bbf512011e1","10.1017\/S0954102009001795"],"year":2009,"topics":["Management","Agriculture and Soil Science","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Soil trampling in an Antarctic Specially Protected Area: tools\nto assess levels of human impact\nP. TEJEDO1, A. JUSTEL2, J. BENAYAS3*, E. RICO3, P. CONVEY4 and A. QUESADA5\n1School of Biology, IE University, Segovia, 40003, Spain\n2Departamento de Matema´ticas, Universidad Auto´noma de Madrid, Madrid, 28049, Spain\n3Departamento de Ecologı´a, Universidad Auto´noma de Madrid, Madrid, 28049, Spain\n4British Antarctic Survey, NERC, High Cross, Madingley Road, Cambridge CB3 0ET, UK\n5Departamento de Biologı´a, Universidad Auto´noma de Madrid, Madrid, 28049, Spain\n*Corresponding author: javier.benayas@uam.es\nAbstract: Research in extremely delicate environments must be sensitive to the need to minimize impacts\ncaused simply through the presence of research personnel. This study investigates the effectiveness of\ncurrent advice relating to travel on foot over Antarctic vegetation-free soils. These are based on the\nconcentration of impacts through the creation of properly signed and identified paths. In order to address\nthese impacts, we quantified three factors - resistance to compression, bulk density and free-living\nterrestrial arthropod abundance - in areas of human activity over five summer field seasons at the Byers\nPeninsula (Livingston Island, South Shetland Islands). Studies included instances of both experimentally\ncontrolled use and natural non-controlled situations. The data demonstrate that a minimum human presence\nis sufficient to alter both physical and biological characteristics of Byers Peninsula soils, although at the\nlowest levels of human activity this difference was not significant in comparison with adjacent undisturbed\ncontrol areas. On the other hand, a limited resilience of physical properties was observed in Antarctic soils,\nthus it is crucial not to exceed the soil’s natural recovery capability.\nReceived 7 August 2008, accepted 11 November 2008\nKey words: Antarctica, ASPA, environmental monitoring, recovery capacity, soil degradation,\ntrampling impact\nIntroduction\nAntarctic terrestrial ecosystems are widely recognized as\nbeing fragile in the face of human disturbance. With the\nexception of the ornithogenic soils, Antarctic soils are\ntypically of low organic content, poorly consolidated and\nunstable, while the limited plant communities that develop\non them are predominantly composed of cryptogams\n(bryophytes, lichens, algae and cyanobacteria), which are\nvulnerable to physical damage and disturbance. The\nfragility of Antarctic ecosystems has been recognized\nwithin the Antarctic Treaty by designating protected areas.\nSince 1991 three classes of protected areas have been used,\nAntarctic Specially Protected Area (ASPA), Antarctic\nSpecially Managed Area (ASMA) and Historic Sites and\nMonuments (HSM). ASPAs were created to “protect\noutstanding environmental, scientific, historic, aesthetic or\nwilderness values, any combination of those values, or\nongoing or planned scientific research” (Article 3.1.,\nAnnex V: Protected Area System, Protocol on\nEnvironmental Protection to the Antarctic Treaty 1991).\nThese areas are intended inter alia to be kept largely free\nfrom human interference, in order that future comparisons\nmay be possible with localities that have been affected by\nhuman activities. Access to these areas is possible under\npermits that can only be issued by the appropriate national\nauthorities. In applying for a permit a clear scientific\njustification needs to be given and researchers applying for\naccess must present plans to minimize their impact on\nthese ecosystems, where appropriate backed by a suitable\nenvironmental monitoring programme.\nOne of the most delicate component of these environments\nis the soil surface, which is an essential habitat for terrestrial\nmicrofauna and flora. Approximately 0.34% of the Antarctic\ncontinent is ice-free (Fox & Cooper 1994), and land surfaces\nare easily disturbed by human activities (Campbell et al.\n1993). In some dry areas soils are typically overlain by a\n‘desert pavement’, a thin layer of gravel and coarse sand\nformed by the winnowing out of fine material by wind\nover a long period of time until a measured of stability is\nachieved (Campbell et al. 1998). Disturbance to this desert\npavement will slow the rate of recovery of the soil surface\nafter impacts as all soil processes operate very slowly in\nthe Antarctic environment (Beyer & Bo¨lter 2002). Low\ntemperatures, the general absence of vegetation and the\nlimited soil biota underlie this low resilience (Campbell &\nClaridge 1987).\nThe Scientific Committee onAntarctic Research (SCAR) is\na non-governmental organization whose functions include\nthe initiation, development and coordination of high quality\ninternational scientific research in Antarctica. SCAR and\n229\nAntarctic Science 21 (3), 229–236 (2009) & Antarctic Science Ltd 2009 Printed in the UK doi:10.1017\/S0954102009001795\nthe Council of Managers of National Antarctic Programs\n(COMNAP) have made numerous recommendations on\nenvironment management to Antarctic Treaty Parties, many\nof which have been incorporated into Antarctic Treaty\ninstruments, including the minimization of environmental\ndisturbance during approved operations within ASPAs\n(NSF\/COMNAP\/SCAR 2005). In relation to disturbance\nby human movement, ASPA Management Plans usually\nprovide a single guideline: that pedestrian traffic should be\nkept to the minimum consistent with the objectives of any\npermitted activities and every reasonable effort should be\nmade to minimize trampling effects. More specifically,\nwalking traffic is advised wherever possible to follow\nbedrock or larger rocks, to prevent damage to often moist\nor waterlogged soils and vegetation, and to use and mark\nsuitably any existing paths in order to prevent new and\nunnecessary damage. These guidelines are based on the\n‘precautionary principle’ and the informal field experience\nand advice of scientific staff. However, to date, there are no\nquantitative studies to confirm the exact nature and extent\nof impacts caused by human activity on soils free of ice\nand vegetation. To address this we conducted a series of\nstudies to assess whether the current recommendations,\nbased on the concentration of researchers along established\ntracks, is the most appropriate approach for minimizing the\nimpacts on Antarctic soils.\nWe focused on three variables in order to characterize\nimpacts on the soils: bulk density, resistance to\ncompression and free-living terrestrial arthropod\nabundance. This selection was based primarily on previous\nmonitoring on (Convey et al. 1996, Brady 2001, Jorajuria\n2004, Soil Survey Staff 2006, Benayas et al. 2007).\nQuantifying these three variables integrates important\nphysical and biological features of soils in a simple and\npracticable manner, using standard methodologies and\nwithout generating further significant disturbances to the\nstudy area. Bulk density and resistance to compression are\ntwo variables that describe physical properties of soils.\nBoth are closely related to other fundamental soil\nproperties such as texture, porosity, organic matter content,\naeration and infiltration and percolation of water (Soil\nSurvey Staff 2006). Soil fauna are integral to the\nbreakdown of organic matter in soils, levels of which are\nlow in Byers Peninsula soils, typically between 1 and 1.5%\n(Navas et al. 2006). Most Antarctic terrestrial arthropods\nand smaller soil invertebrates are thought to have\ndetritivorous and\/or microbivorous diets although few\ndetailed autecological studies have been completed\n(Convey 1996, Hogg et al. 2006), and the majority of\nenergy flow in these ecosystems takes place through the\ndecomposition cycle (Davis 1981). Therefore their central\nrole in the cycling of nutrients suggests that they may be\npotentially excellent bioindicators of change processes. The\nprimary aims of this study were to determine the\nrelationships between the three variables and different\nintensities of human impact through trampling, and to use\nthis information to propose appropriate thresholds to\nminimize accumulating damage over time.\nMaterial and methods\nStudy area\nThe study took place in ASPA No 126, Byers Peninsula,\nLivingston Island (ATCM XXV, Measure 1, 2002). This is\nthe largest ice-free area in the South Shetland Islands,\nmaritime Antarctic, being approximately 60 km2 in extent\n(Richard et al. 1994). Much of its area remains snow\ncovered for at least nine months every year, with soils\ndirectly exposed during the short Antarctic summer.\nDuring the summer, the active soil layer at lower altitudes\nis 25–30 cm deep, and soils are frequently saturated with\nmeltwater (Serrano 2002, 2003). At local scale, soil\npatterns are complex, relating to slope, substratum and\nother abiotic factors. These poorly drained soils are\nstrongly influenced by solifluction and cryoturbation\n(Blume et al. 2002). Over the last 50 years, scientific\nresearch has been the principal human activity at Byers\nPeninsula, although in the context of global human activity\nthe level of this remains very low (Bonner & Lewis Smith\n1985). Research activities are typically based around\ntemporary camps. These are most commonly situated in the\nfirst distinct geoecological belt sorrounding the Peninsula,\nwhich consists of open tundra on Holocene raised beaches\nand platforms (Hall & Johnston 1995, Serrano 2001,\n2002). This is exemplified by the LIMNOPOLAR\ntemporary base camp, which is situated at South Beaches\n(Fig. 1). The camp has formed a base for research in the\nFig. 1. Byers Peninsula and LIMNOPOLAR camp location in\nthe South Shetland Islands, Maritime Antarctica.\nP. TEJEDO et al.230\narea since the 2000\/01 summer. Throughout this period a\ndetailed record has been kept of LIMNOPOLAR researcher\nmovements, allowing assessment of the level of\ndisturbance experienced by different areas and the level of\nimpact in consequence of this.\nMethods\nSamples were obtained at three different distances (0, 1 and\n3 m) from the centre of existing paths created by\nresearchers, with three replicates obtained at each position.\nPaths were sign-posted, and the personnel working at the\nByers camp briefed, in order to prevent the dispersion of\nusers from the centre of paths. This protocol permits a\ncomparison of paths with greater transit pressure (0 m)\nwith less impacted areas (1 m) and non-impacted areas\n(3 m, used as controls, with theoretically no trampling\neffects). Researchers followed the instructions, giving\nreasonable discrimination between these three points. The\nrelatively close proximity of the three sampling locations is\nintended to minimize any influences of small scale\ngeomorphological variations. Five samples of resistance to\ncompression were obtained at each point, using only the\nmedian as the data value.\nIn the 2002\/03 summer pilot studies were carried out in\norder to assess the sampling methods, determine natural\nenvironmental patterns, estimate error variability and\nidentify the sampling effort required for resistance to\ncompression and bulk density studies (Tejedo et al. 2005).\nIn the 2003\/04 summer, an experimental zone was\nestablished close to the field camp in an area of pristine\ndry ground. Four lines of 2 m length were created in this\narea in order to then expose them one day to a known\nfrequency of trampling impact: 0 (control, not used), 100,\n300 and 600 foot transits. The three physical and biological\nvariables were measured both in this experimental area and\nalong the network of paths created in the vicinity of the\nfield camp. During the 2005\/06 and 2006\/07 summer\ncampaigns, new experimental areas were created to test a\nhigher level of use. In parallel with these experiments, new\nresistance to compression data were obtained to analyse the\nreplicability of the previous results. In the 2003\/04 summer\nseason, just after snow retreat, first soil recovery data were\nobtained using resistance to compression. In this field\nseason, the measure of resistance to compression was also\nused to compare the impact of researchers with that due to\nsouthern elephant seals (Mirounga leonina, Linn.) on the\nbeaches of Byers Peninsula. In 2005\/06, 2006\/07 and\n2007\/08 summer seasons the measurements were repeated\nto determine the recovery of the impacted areas.\nFor the measurement of the bulk density, surface soil cores\nwere extracted with a metal cylinder (4.2 cm depth, 5.7 cm\ndiameter). These cores were labelled, sealed and stored for a\nmaximum of two months in plastic bags at 4ºC until further\nanalysis. In the laboratory, water content was measured after\nthe samples were dried for 12 hours at 105ºC (Brady 2001).\nBulk density (g cm-3) was calculated as the relation between\nsoil dry mass and the volume occupied by particles and\npores (Blake & Hartge 1986, Soil Survey Staff 2006).\nResistance to compression (kg cm-2) was measured with a\ntubular penetrometer (Jorajuria 2004). Free-living terrestrial\narthropods were obtained from soil samples including the\ntop 8 cm of soil, equating to c. 500 cm3. As most Antarctic\nterrestrial arthropods taxa are limited to the upper 3–5 cm of\nmoss and\/or soil profiles (Tilbrook 1967) the 8 cm cores are\nconsidered to be appropiate to obtain most soil fauna. Each\nsample was broken up by hand onto a wire mesh using\nBerlese funnel traps and a 40 w lamp placed 19 cm over the\nloose sample material for 48 h, and arthropods preserved in\n70% ethanol after extraction (cf. Convey et al. 1996).\nPreserved arthropods were returned to Spain, where faunal\ncounts and identifications were made to genus level.\nPrevious investigations completed on the Byers Peninsula\nhave recorded five groups and 23 species of free-living\nterrestrial arthropods in this area (Usher & Edwards 1986,\nRichard et al. 1994, Block & Stary´ 1996, Convey et al.\n1996), and these were used for reference. Within the\nmaritime Antarctic, the South Shetland Islands are thought\nto harbour one of the greatest diversities of soil invertebrates\n(Hogg & Stevens 2002) and, within South Shetland Islands,\nthe diversity of free-living terrestrial arthropod on the Byers\nPeninsula is the greatest documented (Convey et al. 1996).\nResults and discussion\nExperimental impacts\nPrevious data has provided empirical evidence that even low\nhuman activity in polar regions may cause disturbance to the\nsurface layer of soils (Tejedo et al. 2005). Nevertheless, we\ndid not found statistical evidence that a very low level of\nfoot traffic can generate significant differences in the\nselected measures relative to pristine nearby areas. Working\non McMurdo Dry Valley areas, Campbell et al. (1993)\ndocumented that after as few as 20 foot transits there is a\ndistinct decrease in the number of surface stones along the\nline of the track and an increase in color contrast between\nthe track and the undisturbed surface alongside. These\nauthors noted that changes can become apparent even after\none single transit. Various authors have highlighted the long\nlifetime of indicators of physical disturbance such as\nfootprints in soil and bryophyte vegetation (Smith et al.\n1995). Our own casual observations suggest that visual\nevidence of footprints impressed on dry surfaces can\ndisappear during the course of a single summer, while those\non damp soils can remain visible for years (Quesada et al.\nunpublished data, Byers Peninsula; Convey & Hodgson\nunpublished data, Dufek Massif ASPA management plan).\nOur experimental studies indicated that substantial\nalterations in the soil surface were evident even at the\nHUMAN IMPACT ON ANTARCTIC SOILS 231\nlowest frequency of foot transit (Fig. 2a–d). Bulk density\n(Fig. 2a) increased significantly when use level was higher\nthan 300 footsteps (ANOVA P \u0002 0.002, n ¼ 12), although\nthere was not a significant difference (t-test P \u0002 0.218,\nn0 ¼ n100 ¼ 3) between control (non-impacted) ground and\nthe lowest intensity of impact assayed (100 footstep),\nwhich we consider similar to a classification of occasional\nuse. Comparable data were obtained with respect to\nresistance to compression. The high correlation between\nbulk density (yi) and resistance to compression (ci) was\nsufficient to justify data collection in subsequent sampling\nseasons being restricted to measurement of resistance to\ncompression. The adjusted linear relation shown in Fig. 2b\nfollows the equation\ny^i ¼ 0:0496 ci þ 0:8472, with r2 ¼ 0:89:\nThis has many practical adventages, being easily\nmeasurable in situ, requiring minimum equipment and\nbeing a non-destructive sampling technique.\nHaving selected resistance to compression as an\nappropriate proxy of physical disturbances to the upper\nFig. 2. Validating tools to assess the human impact under experimental conditions. a. Bulk density in 2003\/04 summer season. b. Bulk density\nand resistance to compression in 2003\/04 summer season. c. Resistance to compression in 2005\/06 summer season. d. Collembola\nabundance in 2003\/04 summer season.\nP. TEJEDO et al.232\nlayers of the soil surface, a second and more detailed\nexperimental study was possible in the 2005\/06 summer\nseason, with a greater range of footstep impact frequencies\nand including measurement of researcher body mass. This\nmore detailed experiment (Fig. 2c) demonstrated that the\nmeasurement of resistance to compression (i.e. soil\ncompaction) was more sensitive to footstep frequency than\nto researcher body mass (data not shown). In this\nexperiment, even the lowest experimental impact (100\nsteps) generated a significant detectable effect. Increasing\nwalking impact under these experimental conditions\nidentified an impact threshold at 800 transits, at that point\nthe soil compaction reached the maximum value\nmeasurable by the penetrometer used. In order to examine\nthe generality of these experimental findings, we obtained\ncomparable data from a range of other sites and sampling\nseasons within the Byers Peninsula (Fig. 3). Although the\nabsolute values of resistance to compression at different\nsites were not identical, similar trends were evident,\nindicating that this method for evaluating the trampling\nimpact on soils in Antarctica may be generally applicable.\nTwo higher groups of free-living terrestrial arthropods taxa\nwere recorded, springtails (Collembola) and mites (Acari)\n(Richard et al. 1994). The former represent over 99.5% of\nthe 4209 individuals collected, thus our analyses focused\non this group. Two genera of collembola were present,\nCryptopygus (94.9%) and Friesea (4.6%), and the numbers\nof both were combined for analyses. Impacts of foot traffic\non Collembola abundance are shown in Fig. 2d, with larger\nimpacts being correlated with a decrease in numbers of\nCollembola. The arthropods were not lost from the soil\neven at the highest levels of experimental impact, but their\nabundance was substantially reduced (by 85%), with this\nFig. 3. Resistance to compression measured in different\nexperimental areas during three summer campaigns.\nFig. 4. Springtails (Collembola) abundance registered in tracks used\nby researchers in 2003\/04 summer campaign: a. camp path,\nb. river path, and c. entrance path. Paths were selected from\nresults showed in Tejedo et al. 2005.\nHUMAN IMPACT ON ANTARCTIC SOILS 233\nreduction not being explained by the typical variability due\nto patchy distribution of Antarctic soil invertebrates (Usher\n& Edwards 1986). Our data clearly demonstrate that the\nactivities of researchers in such habitats can generate an\nimmediate impact on the soil surface fauna, consistent with\nthe compression of soils described above. In addition to\nreducing the three-dimensional complexity of the soil\nhabitat used by these invertebrates, compression is likely to\nreduce water availability in soils, known to be a\nfundamentally important control on Antarctic invertebrate\ndistribution (Tilbrook 1967, Kennedy 1993, Block & Stary´\n1996). Water availability has been suggested to underlie\nthe typically clustered distribution of Collembola in\ndifferent habitats of the Byers Peninsula (Richard et al.\n1994). As a consequence of this clustering or aggregating\nbehaviour, the utility of such abundance measurements in\nstudies of human trampling impact is more limited, in\nparticular being most appropriate in comparisons of\nspatially adjacent areas with otherwise comparable\nenvironmental conditions. However, as the native soil\narthropod fauna of both the maritime and continental\nAntarctic regions is taxonomically limited and consists of\nCollembola and Acari (Hogg & Stevens 2002), this tool\ncould be simply adapted to allow application across the\nmajority of Antarctic ice-free areas.\nAssessment of limnopolar expedition impact\nUsing the experimental data as a baseline, we then assessed\nevidence for impacts associated with human movement\naround the Byers Peninsula. Features of paths created by\nresearchers around the camp (Fig. 4a–c) were coincident\nwith the results obtained in experimental areas (Figs 2 &\n3). This observation has important ramifications, as it over-\nrides the typically large complexity of maritime Antarctica\nterrestrial habitats, even at the scale of a few square metres\nor centimetres (Beyer & Bo¨lter 2002), and validates the\nmethodology proposed for monitoring the environmental\nimpact of the researchers’ trampling. Nevertheless, some\ndifferences between experimental areas and true tracks\nwere apparent. Thus, the greatest bulk density values at the\nexperimental site (Fig. 2b), were less than those found in\nnormal Byers paths (1.80 g cm-3). The specific location of\nthis area of maximal compaction was recorded on the\nprincipal path of the base camp, which was also the only\ntrue track where springtails appear to have completely\ndisappeared (Fig. 4a).\nElephant seals create small networks of paths at South\nBeaches of the Byers Peninsula that connect the coast with\ndifferent resting areas in the first geoecological belt. One\ntrack made by a female seal (450–550 kg) was chosen to\ncompare with the impact of researchers on soils. The data\nobtained demonstrated that the movement of elephant seals\ncreates a small increase in the soil’s resistance to\ncompression, comparable with that of a use level of less\nthan 100 footsteps, and a reduction of around 50% in\nCollembola abundance in the centre of the track, again a\nsimilar consequence to that of sporadic human use. These\nobservations can be used to support an assumption that a\ncontrolled level of research activity can be tolerated by\nAntarctic soils, for which significant degradation problems\nare not apparent in vegetation-free areas close to the\ncentres of elephant seal activity.\nAn estimate of the recovery capacity of soils was also\nobtained through the measurement of resistance to\ncompression. Data were obtained from both experimental\nareas and paths close to the base camp, with a focus on the\nmain camp path. Results for this track are shown in Fig. 5,\nwhich is divided in four sections. The data show some\nevidence of recovery from compaction, with resistance to\ncompression tending to decrease over time, particularly\nonce a track was closed in 2006\/07. However, the means of\nthe resistance to compression at 0 and 1 m during the\n2007\/08 summer season were not significantly different\n(t-test P ¼ 0.067, n0 ¼ 3, n1 ¼ 15), and remained\nsignificantly different to that at 3 m (t-test P\u0003 0.0001,\nn0 ¼ 3, n3 ¼ 15). It is likely that more time will be\nnecessary to allow complete recovery. Our data show that\nareas subjected to high human trampling pressure have a\nlower recovery than those occasionally used. The cycle of\nsaturation and drainage of soil, and cryoturbation through\nfreeze-thaw activity, will have a central influence in the\nregeneration of soil structure. These processes generate\nphysical changes in the upper centimetres of compacted\nsoil that decrease resistance to compression towards the\noriginal (non-impacted) values, allowing considerable\nFig. 5. Recovery capacity measured in the main base camp path\nalong six summer seasons. For the centre of the path (0 m) the\nannual evolution is presented. a. Data from 2002\/03 summer\nseason were recorded after two campaigns of intensive use of the\npath. The rest of data were recorded just after snow retreat, b. in\n2003\/04 and 2005\/06 before the track was again used by the\nresearchers, and c. in 2006\/07 and 2007\/08 after the access to the\ntrack was not permitted (it was fenced to analyse natural soil\nrecovery capacity). d. All the collected data at 1 m and 3 m\ndistance to the centre of the path are summarized in two\nbox-plots.\nP. TEJEDO et al.234\nrecovery from trampling effects where use levels are not too\nhigh. To take advantage of the recovery abilities of Antarctic\nsoils does implicitly require the active use of systematic\nmonitoring in order to avoid impacts exceeding their\nrecovery capacity, allowing travel routes to be closed and\nalternatives routes created when impact variables approach\nacceptable limits favouring recovery.\nConclusions\nThe efficacy of methodologies to analyse the impact of\nresearchers on Antarctic soils by trampling has been\ndemonstrated by this study. Future developments of these\nmethodologies should, however, involve expansion to\ninclude other variables such as soil characteristics; water\ncontent, temperature and snow cover duration.\nWe propose that the resistance to compression (i.e.\ncompaction) is an appropriate and effective parameter to\nmeasure degradation due to trampling of the superficial\nlayers of the soil. Additionally, biological data related to\nkey processes (breakdown of organic material and the\ncycling of nutrients) can provide a further level of detail of\nimpacts. Springtails, especially the genus Cryptopygus, are\na primary target organism for such studies on the Byers\nPeninsula, through their large abundances, ability to\ntolerate at least to some extent high use levels, and\nmeasurable response to trampling intensity, although data\ninterpretation can be complicated by their typically\naggregated distribution in the field.\nOur data demonstrate both that whilst a minimum human\npresence is sufficient to generate measurable changes in the\nphysical characteristics of Byers Peninsula soils, a higher\nlevel of use is required to lead to substantial changes. This\nleads us to recommend a refinement of current practice\nrelating to patterns of human movement around areas\nwhere disruption of soil ecosystems is a possibility. A\n‘Dispersion’ strategy is advisable at those vegetation-free\nareas that experience sporadic use (around 100 foot transits\nor less per season), while a ‘concentration’ strategy based\non the creation of properly signed paths is more appropriate\nin ‘sacrificial areas’ such as within the camp area and\nprincipal traffic routes. Strict control of areas visited by\nAntarctic expeditions is necessary in order to prevent\nfuture disturbance, since the unusually low diversity of\nAntarctic soil biota could be highly disrupted by the loss or\ndecline of even a single species that is sensitive to\nenvironmental change.\nAcknowledgements\nThis is a contribution of the LIMNOPOLAR project, and\nalso contributes to the BAS BIOFLAME and SCAR EBA\nresearch programmes. It was supported by the Spanish\nGovernment (REN2000-0435ANT, REN2002-11617-E,\nCGL2004-20451-E and CGL2005\/06549\/02\/01-ANT).\nLogistical support was provided by the UTM (Marine\nTechnology Unit, CSIC) and the Spanish Navy. We thank\nall the members of the LIMNOPOLAR team for data\ncollection, particularly to Antonio Camacho, Carlos\nRochera and David Vela´zquez, and Javier Arcones (IE\nUniversity student) for collaboration in the identification\nwork.\nReferences\nBENAYAS, J., TEJEDO, P., GARCI´A, D. & MUN˜OZ, M. 2007. Perspectivas\nactuales y retos futuros en la gestio´n de las actividades de Uso Pu´blico\nen la Naturaleza. In BOADA, M. & BENAYAS, J., eds. Naturaleza y uso\npu´blico: movilidad, impactos y propuestas. Barcelona: Fundacio´n\nAbertis, 37–48.\nBEYER, L. & BO¨LTER, M. 2002. Geoecology of Antarctic ice-free coastal\nlandscapes. Berlin: Springer, 463 pp.\nBLAKE, G.R. & HARTGE, K.H. 1986. Bulk density. In KLUTE, A., ed. Methods\nof soil analysis. Part 1: Physical and mineralogical methods, 2nd ed.\nMadison, WI: Soil Science Society of America, 363–376.\nBLOCK, W. & STARY´, J. 1996. Oribatid mites (Acari: Oribatida) of the\nmaritime Antarctic and Antarctic Peninsula. Journal of Natural History,\n30, 1059–1067.\nBLUME, H.P., KHUN, D. & BO¨LTER, M. 2002. Soils and landscapes. In\nBEYER, L. & BO¨LTER, M., eds. Geoecology of Antarctic ice free\ncoastal landscapes. Berlin: Springer, 91–114.\nBONNER, W. & LEWIS SMITH, R.I. 1985. SSSI No 6: Byers Peninsula,\nLivingston Island, South Shetland Islands. In BONNER, W.N. & LEWIS\nSMITH, R.I., eds. Conservation areas in the Antarctic. Cambridge:\nSCAR, 147–156.\nBRADY, N. 2001. The nature and properties of soils, 13th ed. Upper Saddle\nRiver, NJ: Prentice Hall, 960 pp.\nCAMPBELL, I.B. & CLARIDGE, G.G.C. 1987. Antarctica: soils, weathering\nprocesses and environment. Amsterdam: Elsevier Science Publishers,\n406 pp.\nCAMPBELL, I.B., BALKS, M.R. & CLARIDGE, G.G.C. 1993. A simple visual\ntechnique for estimating the effect of fieldwork on the terrestrial\nenvironment in ice-free areas of Antarctica. Polar Record, 29, 321–328.\nCAMPBELL, I.B., CLARIDGE, G.G.C., CAMPBELL, D.I. & BALKS, M.R. 1998. The\nsoil environment. Antarctic Research Series, 72, 297–322.\nCONVEY, P. 1996. The influence of environmental characteristics on life\nhistory attributes of Antarctic terrestrial biota. Biological Reviews, 71,\n191–225.\nCONVEY, P., GREENSLADE, P., RICHARD, K.J. & BLOCK, W. 1996. The terrestrial\narthropod fauna of the Byers Peninsula, Livingston Island, South Shetland\nIslands. Polar Biology, 16, 257–259.\nDAVIS, R.C. 1981. Structure and function of two Antarctic terrestrial moss\ncommunities. Ecological Monographs, 5, 125–143.\nFOX, A.J. & COOPER, P.R. 1994. Measured properties of the Antarctic\nIce Sheet derived from the SCAR digital database. Polar Record, 30,\n201–204.\nHALL, C.M. & JOHNSTON, M.E., eds. 1995. Polar tourism: tourism in the\nArctic and Antarctic regions. Chichester: John Wiley, 346 pp.\nHOGG, I.D. & STEVENS, M.I. 2002. Soil fauna of Antarctic coastal landscapes.\nIn BEYER, L. & BO¨LTER, M., eds. Geoecology of Antarctic ice-free coastal\nlandscapes. Berlin: Springer, 265–282.\nHOGG, I.D., CARY, C., CONVEY, P., NEWSHAM, K.K., O’DONNELL, A.G., ADAMS,\nB.J., AISLABIE, J., FRATI, F., STEVENS, M.I. & WALL, D.H. 2006. Biotic\ninteractions in Antarctic terrestrial ecosystems: are they a factor? Soil\nBiology and Biochemistry, 38, 3035–3040.\nJORAJURIA, D. 2004. La resistencia a la penetracio´n como para´metro\nmeca´nico del suelo. In FILGUEIRA, R. & MICUCCI, F., eds. Metodologı´as\nfı´sicas para la evaluacio´n del suelo: penetrometrı´a e infiltrometrı´a.\nEDULP, 43–53.\nHUMAN IMPACT ON ANTARCTIC SOILS 235\nKENNEDY, A.D. 1993. Water as a limiting factor in the Antarctic terrestrial\nenvironment: a biogeographical synthesis. Arctic and Alpine Research,\n25, 308–315.\nNAVAS, A., LO´PEZ-MARTI´NEZ, J., CASAS, J., MACHI´N, J., DURA´N, J.J, SERRANO,\nE., CUCHI, J.A. & MINK, S. 2006. Caracterı´sticas de los suelos sobre\ndiferentes sustratos en las Islas Shetland del Sur. El caso de la Isla\nLivingston. Libro de resu´menes del VII Simposio Espan˜ol de Estudios\nPolares. Granada, 18-20 de septiembre, 226–228.\nNSF\/COMNAP\/SCAR. 2005. Practical biological indicators of human\nimpacts in Antarctica. Bryan, College Station, Texas, 16–18 March\n2005. Workshop Report, vol. 1, 24 pp.\nRICHARD, K.J., CONVEY, P. & BLOCK, W. 1994. The terrestrial arthropod fauna\nof the Byers Peninsula, Livingston Island, South Shetland Islands. Polar\nBiology, 14, 371–379.\nSERRANO, E. 2001. Protected areas and territorial politicy in South Shetland\nIslands (Antarctica). AGE Bulletin, 31, 5–21.\nSERRANO, E. 2002. Ice, mountains, sea and fauna: tourism in South Shetland\nIslands (maritime Antarctic). Revue de Ge´ographie Alpine, 1, 9–24.\nSERRANO, E. 2003. Natural landscape and geoecological belts on ice free\nareas of the maritime Antarctica (South Shetland Island). AGE Bulletin,\n35, 5–32.\nSOIL SURVEY STAFF. 2006. Keys to soil taxonomy, 10th ed. Washington, DC:\nUSDA-Natural Resources Conservation Service, 332 pp.\nSMITH, R.C., BAKER, K.S., FRASER, W.R., HOFFMAN, E.E., KARL, D.M.,\nKLINCK, J.M., QUETIN, L.B., PRE´ZELIN, B.B., ROSS, R.M., TRIVELPIECE,\nW.Z. & VERNET, M. 1995. The Palmer LTR: a long-term\necological research program at palmer Station, Antarctica.\nOceanography, 8, 77–86.\nTEJEDO, P., JUSTEL, A., RICO, E., BENAYAS, J. & QUESADA, A. 2005. Measuring\nimpacts on soils by human activity in an Antarctic Special Protected Area.\nTerra Antarctica Reports, 12, 57–62.\nTILBROOK, P.J. 1967. Arthropod ecology in the maritime Antarctic. Antarctic\nResearch Series, 10, 331–356.\nUSHER, M.B. & EDWARDS, M. 1986. The selection of conservation areas in\nAntarctica: an example using the arthropod fauna of Antarctic islands.\nEnvironmental Conservation, 13, 115–122.\nP. TEJEDO et al.236\n"}