{"doi":"10.1080\/02602930600898569","coreId":"196894","oai":"oai:lra.le.ac.uk:2381\/9105","identifiers":["oai:lra.le.ac.uk:2381\/9105","10.1080\/02602930600898569"],"title":"To cheat or not to cheat? A trial of the JISC Plagiarism Detection Service with biological sciences students","authors":["Badge, Joanne Louise","Cann, Alan James","Scott, Jon"],"enrichments":{"references":[{"id":43675480,"title":"A review of electronic services for plagiarism detection in student submissions,","authors":[],"date":"2000","doi":null,"raw":"CULWIN, F. and LANCASTER, T., 2000. A review of electronic services for plagiarism detection in student submissions, LTSN-ICS 1st Annual Conference 23-25 August KILNER, A., 2004. A national survey into the prevalence of plagiarism. UK: FreshMinds.","cites":null},{"id":43675495,"title":"An exercise to teach bioscience students about plagiarism.","authors":[],"date":"2003","doi":"10.1080\/00219266.2003.9655869","raw":"WILLMOTT, C.J. and HARRISON, T.M., 2003. An exercise to teach bioscience students about plagiarism. Journal of Biological Education, 37(3), 139-140.","cites":null},{"id":43675479,"title":"Factors associated with student plagiarism in a post-1992 university.","authors":[],"date":"2005","doi":"10.1080\/0260293042000264244","raw":"BENNETT, R., 2005. Factors associated with student plagiarism in a post-1992 university. Assessment & Evaluation in Higher Education, 30(2),. 137-162.","cites":null},{"id":43675492,"title":"In Other (People’s) Words: plagiarism by university students—literature and lessons.","authors":[],"date":"2003","doi":"10.1080\/02602930301677","raw":"PARK, C., 2003. In Other (People’s) Words: plagiarism by university students—literature and lessons. Assessment & Evaluation in Higher Education, 28(5), 471-488.","cites":null},{"id":43675481,"title":"Plagiarism and its Treatment in Higher Education.","authors":[],"date":"2002","doi":"10.1080\/0309877022000021748","raw":"LARKHAM, P.J. and MANNS, S., 2002. Plagiarism and its Treatment in Higher Education. Journal of Further and Higher Education, 26(4), 339-349.","cites":null},{"id":43675494,"title":"Plagiarism in U.S. Higher Education: Estimating Internet Plagiarism Rates and Testing a Means of Deterrence. USA: Committee for the Protection of Human Subjects,","authors":[],"date":"2002","doi":null,"raw":"WEINSTEIN, J.W. and DOBKIN, C.E., 2002. Plagiarism in U.S. Higher Education: Estimating Internet Plagiarism Rates and Testing a Means of Deterrence. USA: Committee for the Protection of Human Subjects, University of California, Berkeley, USA.","cites":null},{"id":43675491,"title":"Rebels without a clause: towards an institutional framework for dealing with plagiarism by students.","authors":[],"date":"2004","doi":"10.1080\/0309877042000241760","raw":"PARK, C., 2004. Rebels without a clause: towards an institutional framework for dealing with plagiarism by students. Journal of Further and Higher Education, 28(3), 291-306.","cites":null},{"id":43675493,"title":"The Effectiveness of a Plagiarism Prevention Policy: A Longitudinal Study of Student Views.","authors":[],"date":"2002","doi":null,"raw":"Page 6 of 6 SIMS, R.L., 2002. The Effectiveness of a Plagiarism Prevention Policy: A Longitudinal Study of Student Views. Teaching Business Ethics, 00006(00004), 477-483.","cites":null},{"id":43675490,"title":"Who cheats at university? A selfreport study of dishonest academic behaviours in a sample of Australian university students.","authors":[],"date":"2005","doi":"10.1080\/00049530412331283426","raw":"MARSDEN, H., CARROLL, M. and NEILL, J., 2005. Who cheats at university? A selfreport study of dishonest academic behaviours in a sample of Australian university students. Australian Journal of Psychology, 00057(00001), 1-11.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-08","abstract":"In the UK, there is great concern about the perceived increase in plagiarized work being submitted by students in higher educations. Although there is much debate, the reasons for the perceived change are not completely clear. Here we present the results of a 2-year trial of the JISC Plagiarism Detection Service (PDS) involving hundreds of students. The effectiveness of the service in detecting plagiarized material and in acting as a deterrent are discussed. Although an increased number of cases of plagiarism were detected during the trial, the relative contributions of the electronic detection system and increased staff awareness remain unknown","downloadUrl":"http:\/\/www.informaworld.com\/smpp\/title~db=all~content=g779702379,","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/9105\/1\/BadgeCannScottAEHErevised.pdf","pdfHashValue":"b6326b27949156ef4ded618b932249f1e40eee1d","publisher":"Routledge (Taylor & Francis)","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/9105<\/identifier><datestamp>\n                2016-01-08T12:26:55Z<\/datestamp><setSpec>\n                com_2381_74<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_75<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nTo cheat or not to cheat? A trial of the JISC Plagiarism Detection Service with biological sciences students<\/dc:title><dc:creator>\nBadge, Joanne Louise<\/dc:creator><dc:creator>\nCann, Alan James<\/dc:creator><dc:creator>\nScott, Jon<\/dc:creator><dc:description>\nIn the UK, there is great concern about the perceived increase in plagiarized work being submitted by students in higher educations. Although there is much debate, the reasons for the perceived change are not completely clear. Here we present the results of a 2-year trial of the JISC Plagiarism Detection Service (PDS) involving hundreds of students. The effectiveness of the service in detecting plagiarized material and in acting as a deterrent are discussed. Although an increased number of cases of plagiarism were detected during the trial, the relative contributions of the electronic detection system and increased staff awareness remain unknown.<\/dc:description><dc:date>\n2011-02-23T13:49:57Z<\/dc:date><dc:date>\n2011-02-23T13:49:57Z<\/dc:date><dc:date>\n2007-08<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAssessment & Evaluation in Higher Education, 2007, 32 (4), pp. 433-439<\/dc:identifier><dc:identifier>\n1469-297X (electronic)<\/dc:identifier><dc:identifier>\n0260-2938 (paper)<\/dc:identifier><dc:identifier>\nhttp:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/02602930600898569<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/9105<\/dc:identifier><dc:identifier>\n10.1080\/02602930600898569<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author’s final draft of the paper published as Assessment & Evaluation in Higher Education, 2007, 32 (4), pp. 433-439.  The final published version is available at http:\/\/www.informaworld.com\/smpp\/title~db=all~content=g779702379, Doi: 10.1080\/02602930600898569.<\/dc:rights><dc:publisher>\nRoutledge (Taylor & Francis)<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article"],"fullText":"Page 1 of 6 \nTo Cheat or Not To Cheat? \nA trial of the JISC plagiarism detection service with \nbiological sciences students \nJOANNE L. BADGE*, ALAN J. CANN, JON SCOTT \nSchool of Biological Sciences, University of Leicester, University Road, Leicester, LE1 \n7RH, UK. \njlb34@leicester.ac.uk \n*corresponding author \nAbstract \nIn the UK, there is great concern about the perceived increase in plagiarised work being \nsubmitted by students in higher educations. Although there is much debate, the reasons for \nthe perceived change are not completely clear.  Here we present the results of a two-year \ntrial of the JISC Plagiarism Detection Service (PDS) involving hundreds of students. The \neffectiveness of the service in detecting plagiarised material and in acting as a deterrent are \ndiscussed. Although an increased number of cases of plagiarism were detected during the \ntrial, the relative contributions of the electronic detection system and increased staff \nawareness remain unknown. \nIntroduction \nPlagiarism is said to be on the increase in higher education (Kilner 2004, Park 2003), \nalthough in truth, little data is available to properly support this claim, in particular for UK \nuniversity biology courses. The risk factors for plagiarism are believed to be well known: \nthe vastly increased availability of online information, tempting students to cut and paste \n(with or without subtle rewording), poor training in citation skills, poor supervision, \nacademically weak students, real or perceived pressure of deadlines and a previous history \nof plagiarism. The pressures to plagiarise increase with widening access (mature students, \noutside pressure of part-time work, deadline pressure) (Bennett 2005). As levels of \nawareness of the problem have increased among academic staff, so many have become \nmore assiduous in identifying plagiarism, which has contributed to the rise in the number \nof cases recorded in the School of Biological Sciences at the University of Leicester.  \n \nOne response to this perceived increase has been the use of digital or automatic plagiarism \ndetection methods (Culwin, Lancaster 2000).  Submission of work by electronic means, \nsuch as email and virtual learning environments, has allowed instructors to easily copy and \npaste phrases from student work into search engines like Google to search for close \nmatches. This method can sometimes work but is time consuming, especially if the student \nhas plagiarised from multiple sources, and is a very ‘hit or miss’ approach in terms of \nPage 2 of 6 \nwhich phrases are chosen.  If there was a long lead-time to prepare the piece of work, sites \nthey may have copied from may have been updated and no longer provide a match. \nFurthermore, search engines such as Google cannot be used to detect collusion between \nstudents, or across cohorts of students. The JISC Plagiarism Detection Service \n(http:\/\/submit.ac.uk), based on the Turnitin system (http:\/\/www.turnitin.com), archives \nsource material daily, thus avoiding this problem and will show matches to multiple \nsources in a single report.  \n \nAs in many institutions, in the University of Leicester School of Biological Sciences, \nstudents undergo training through formal lectures and a tutorial exercise to teach them \nabout plagiarism (Willmott, Harrison 2003). In the latter, students are given a paragraph of \ntext from a paper and a selection of paragraphs that range from a direct copy of the \noriginal, quotations including the paragraph, through paraphrasing to complete rewording. \nThey are asked to comment on whether each statement is plagiarism or not and encouraged \nto discuss their results. The Turnitin system is demonstrated to show how matching text \ncan be easily detected. Training is certainly of the utmost importance in avoiding \nplagiarism. The success of this training programme has been indicated by recent surveys of \nstudents, undertaken as part of the year questionnaire feedback, where over 97% of \nstudents indicate that they understand the nature of plagiarism and the School’s policies. \nDespite this, the most frequently encountered claim by the small proportion that attend \ndisciplinary hearings is \"I didn't realise this was plagiarism\". On the other side of the coin, \ndeterrence is also important as the other component of the ‘carrot and stick’ policy that is \nmost likely to minimize the incidence. This has been supported by numerical evidence that \nthe policy of scanning all second and third year coursework seems to have reduced the \nincidence of plagiarism during the current year. \nMethod \nThe JISC Plagiarism Detection Service (JISC PDS) is a nationally organised system that \ncompares submitted text against a database. The database contains information from the \nInternet, which is updated daily by automated web robots, the output from a publisher’s \ndatabase of peer-review journals, and information from essay mills and other cheat sites. \nStudent papers are also checked against one another and against all other papers in the \ndatabase. Papers are never deleted from the database, which therefore can be used for \nchecking for collusion between years as well as within years.  The JISC PDS is a web-\nbased system that can be linked to virtual learning environments (VLEs) such as WebCT \nor Blackboard to provide a seamless submission and review process.  An originality report \nis generated showing the matching text highlighted in colour, with each different source \nshown in a different colour. The highlighted text is hyper-linked to the original source. A \nside-by-side view enables the source and matching text to be compared directly, with \nmatching text highlighted in both the source and the student paper. A percentage score is \ngiven to represent the number of words found that match another source in relation to the \nwhole word count for the student paper. Instructors still need to view each report and \nanalyse the sources used by the student, for example, some may be legitimate quotations \nand often matches to other student papers are where the question has been left in the \nsubmitted documents and are therefore common pieces of text between all papers. \n \n[Original artwork in separate file: Fig1.png] \nFigure 1: Screenshot of JISC PDS Originality report on specially created sample essay. The top panel shows \ninformation about the author, number of words in the student essay and percentage matching score. The \nbottom left frame shows student work with matching text highlighted in colour and surrounded by a box, \nPage 3 of 6 \neach source has a different colour and is numbered. The right frame shows the list of matching sources found \nand their origin in corresponding colours and numbered. \n \n[Original artwork in separate file: Fig2.png] \nFigure 2: Screenshot of JISC Originality report on specially created sample essay showing a direct \ncomparison between student essay in the left hand panel and one of the detected source texts on the right. \n \nThe data used in our preliminary trial of the JISC PDS system in the School of Biological \nSciences at the University of Leicester were mostly undergraduate essays collected during \nthe previous academic year.  Individual pieces of work were anonymized and submitted for \nplagiarism scanning.  This work had already been marked and, in the work of one module, \nthe marker had detected plagiarism.  The JISC PDS found all but one of the cases, \nconfirmed one suspected case and found two further undetected cases.  This pilot study \ndemonstrated that material copied from the web was not time sensitive, since matching text \nfrom archived Internet sites was detected. This encouraged us to attempt a, more extensive \ntrial using data collected directly from students during the second semester of 2004\/2005. \n \nNine module convenors were recruited to use the system on coursework during their \nmodules. Some convenors collected work from more than one module, so a total of 12 \nundergraduate (first, second and third year) and 2 postgraduate modules were involved in \nthe study (plus a final year report). In all, 513 pieces of work were collected from \napproximately 465 students (some students were on multiple modules included in the trial). \nThe majority of the work collected were essays, though the study included some practical \nreports, mini reviews, assessed online discussion board postings, final year projects and \ntutorial essays written under open book conditions live online. \n \nStudent work was collected online through Blackboard. Students completed an online \nsubmission form, including School’s standard agreement statement regarding plagiarism, \nand attached their paper as a word or other text document.  These papers were \nautomatically transferred to the JISC PDS for analysis. Results were viewed and \ninterpreted by the module convenor. Any cases of plagiarism detected were reported as \nusual through the School’s established disciplinary system. \n \nResults for the study were collected by means of a questionnaire for each convenor with \nanswers taken during face-to-face interviews or by email correspondence.  Data from the \nJISC PDS are only available to each instructor and cannot usually be shared. \n \nResults \nIn our initial small-scale trial, the detection rate was 2.06% (n=2 out of 97 submissions \ntested), representing 18% of the total cases of plagiarism detected that year.  In the first \nproper year of use, the detection rate rose to 2.73% (n=14 out of 513 submissions tested), \nrepresenting 40% of the total number of cases detected.  In the second year of use, the both \nthe total number of cases and the detection rate fell to 0.94% (n=10 out of 1060 \nsubmissions tested), representing 71% of the total number of cases detected. These results \nsuggest that the JISC PDS is an effective means of both detecting and deterring plagiarism, \nalthough the difference in the detection rate was not statistically significant in a one-way \nchi-square goodness of fit test. \n \nPage 4 of 6 \nThe JISC PDS does not always detect copying from peer-reviewed subscription journal \narticles.  Most publishers use password protection for their subscription journals, so they \nare not freely available online and therefore hidden from the JISC PDS web robots. \nHowever, the growing database of student work within the JISC PDS can provide a match \nfor copying from such a source: for example, a piece of work conducted in semester two of \n2003\/4 was submitted to the JISC PDS as part of the original trial. The same assignment \nwas repeated in 2004\/5 with a new cohort of students and a match from that work was \nfound to the previous year’s work. Close inspection revealed that both students had copied \nfrom a third source, a review article not accessible to the JISC PDS. \n \nGenerally, plagiarism from second year students consisted predominantly of cutting and \npasting from websites, while third year students were more likely to include unattributed \nsections of peer-reviewed articles available online. \n \nConvenors commented that the JISC PDS appeared to prevent plagiarism. In one module, \nthe convenor had demonstrated the system, showing the coloured matching text and side-\nby-side view in an early lecture in his module. Students were told that this system would \nbe used for all their work. Three timed tutorial essays were written online under open book \nand ‘open computing’ conditions.  This meant that students were faced with being able to \ncopy and paste during the tutorial. However, not a single case of plagiarism was detected \non this module. Similarly, in another module the convenor informed the students that on-\nline submission was being used specifically to enable detection of plagiarism, again, no \npositive cases were identified. \n \nDiscussion \nRecent feedback from the School’s Staff-Student Committee has been very supportive of \nstamping out plagiarism, indeed the student representatives actually felt that punishments \nwere currently too lenient.  Our trial has shown that the JISC PDS is an effective tool for a \nfirst scan for plagiarism of work submitted by biology students.  Indeed, the outcome of \nthis trial was such that School policy has now been changed, with agreement from the \nstudent representatives, to require all work to be submitted electronically and checked for \nplagiarism. Students will be alerted to this policy and given a visual demonstration of the \nJISC PDS as part of their training on plagiarism. \n \nHowever, the JICS PDS system is not without its problems. As indicated above, it \ncurrently does not include peer-reviewed journal articles of relevance to biological \nsciences – though more open source, the growing database of student work, self-archiving \nand poor copyright compliance by authors and others in the electronic environment are \nmaking this of less significance. \n \nThe rates of plagiarism detected in our trial are not as high as might be expected from a \nself-selected group of tutors keen to detect it, nor as high as some literature reports suggest \n(Kilner 2004, Marsden, Carroll et al. 2005, Weinstein, Dobkin 2002).  However, during the \nyear of the trial, disciplinary hearings for plagiarism rose dramatically (from 11 to 35 \ncases).  It is far from clear that all of this increase results directly from the use of the JISC \nPDS since the relative contribution made by increased staff awareness is unknown and the \nproportion of cases detected using the scanning system remained relatively constant \n(2.06% in 2003\/4 and 2.73% in 2004\/5).  What does seem likely is that the continued high \nPage 5 of 6 \nprofile use of the JISC PDS on all coursework during 2005\/2006 has led to a decrease in \nthe proportion of cases detected (0.94%). \n \nIncreased detection of plagiarism due to software scanning raises issues of institutional \nprocedures for dealing with it once detected. Thresholds are difficult to define absolutely – \nwhen does stupidity become cheating? Consistent advice needs to be readily available to \nstaff as to whether an assignment is plagiarised sufficiently to warrant a penalty. Feedback \nto students needs to be timely. Some literature is starting to look at this now (Larkham, \nManns 2002, Park 2004, Sims 2002). The report of the  Plagiarism: prevention, practice \nand policy conference 2004, has this to say: \n \n“There is a clear difference between cheating and plagiarism. The latter is ‘mostly a \nmatter of ignorance. We are too often punishing students for not knowing what we are \nthere to teach them.’ However, plagiarism and the coverage it has received offers us the \nopportunity for us to rethink how we teach. Academic discourse is founded on the use of \nothers' work and \"others' voices\" in one's own work. We need to enable students to \nmarshal legitimately other's work in their own work, one of the key skills that all students \nshould acquire.” http:\/\/www.jisc.ac.uk\/index.cfm?name=plagiarism_conf_news_290604 \n(accessed 29 March 2006) \n \nAlthough we have not detected the high rates of plagiarism reported by other authors, we \nare sufficiently encouraged by our trial of the JISC PDS to incorporate it into our standard \nprocedures for submission of student work. Whether we will be as successful in meeting \nthe challenge of where plagiarism begins and ends and what to do in response to an \nincreasingly diverse student body motivated by many different demands remains to be \nseen. \nAcknowledgements \nWe are grateful to the University of Leicester Fund for Faculty Teaching Initiatives for \nsupporting the work described in this report. \n \nReferences \nBENNETT, R., 2005. Factors associated with student plagiarism in a post-1992 university. \nAssessment & Evaluation in Higher Education, 30(2),. 137-162. \nCULWIN, F. and LANCASTER, T., 2000. A review of electronic services for plagiarism \ndetection in student submissions, LTSN-ICS 1st Annual Conference 23-25 August \n2000 \nKILNER, A., 2004. A national survey into the prevalence of plagiarism. UK: FreshMinds. \nLARKHAM, P.J. and MANNS, S., 2002. Plagiarism and its Treatment in Higher \nEducation. Journal of Further and Higher Education, 26(4), 339-349. \nMARSDEN, H., CARROLL, M. and NEILL, J., 2005. Who cheats at university? A self-\nreport study of dishonest academic behaviours in a sample of Australian university \nstudents. Australian Journal of Psychology, 00057(00001), 1-11. \nPARK, C., 2004. Rebels without a clause: towards an institutional framework for dealing \nwith plagiarism by students. Journal of Further and Higher Education, 28(3), 291-\n306. \nPARK, C., 2003. In Other (People’s) Words: plagiarism by university students—literature \nand lessons. Assessment & Evaluation in Higher Education, 28(5), 471-488. \nPage 6 of 6 \nSIMS, R.L., 2002. The Effectiveness of a Plagiarism Prevention Policy: A Longitudinal \nStudy of Student Views. Teaching Business Ethics, 00006(00004), 477-483. \nWEINSTEIN, J.W. and  DOBKIN, C.E., 2002. Plagiarism in U.S. Higher Education: \nEstimating Internet Plagiarism Rates and Testing a Means of Deterrence. USA: \nCommittee for the Protection of Human Subjects, University of California, \nBerkeley, USA. \nWILLMOTT, C.J. and HARRISON, T.M., 2003.  An exercise to teach bioscience students \nabout plagiarism. Journal of Biological Education, 37(3), 139-140. \n"}