{"doi":"10.1016\/j.jcis.2011.04.027","coreId":"52592","oai":"oai:nora.nerc.ac.uk:14255","identifiers":["oai:nora.nerc.ac.uk:14255","10.1016\/j.jcis.2011.04.027"],"title":"Kinetics of bacterial potentiometric titrations : the effect of equilibration time on buffering capacity of Pantoea agglomerans suspensions","authors":["Kapetas, Leon","Ngwenya, Bryne T.","MacDonald, Alan M.","Elphick, Stephen C."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011","abstract":"Several recent studies have made use of continuous acid–base titration data to describe the surface chemistry of bacterial cells as a basis for accurately modelling metal adsorption to bacteria and other biomaterials of potential industrial importance. These studies do not share a common protocol; rather they titrate in different pH ranges and they use different stability criteria to define equilibration time during titration. In the present study we investigate the kinetics of bacterial titrations and test the effect they have on the derivation of functional group concentrations and acidity constants. We titrated suspensions of Pantoea agglomerans by varying the equilibration time between successive titrant additions until stability of 0.1 or 0.001 mV s−1 was attained. We show that under longer equilibration times, titration results are less reproducible and suspensions exhibit marginally higher buffering. Fluorescence images suggest that cell lysis is not responsible for these effects. Rather, high DOC values and titration reversibility hysterisis after long equilibration times suggest that variability in buffering is due to the presence of bacterial exudates, as demonstrated by titrating supernatants separated from suspensions of different equilibration times. It is recommended that an optimal equilibration time is always determined with variable stability control and preliminary reversibility titration experiments.\\ud\n\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/52592.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/14255\/1\/Kapetas2011_NORA.pdf","pdfHashValue":"497661d1f4f9ae714b571d09cb2d2e9c8388a4b7","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:14255<\/identifier><datestamp>\n      2012-11-22T12:20:06Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/14255\/<\/dc:relation><dc:title>\n        Kinetics of bacterial potentiometric titrations : the effect of equilibration time on buffering capacity of Pantoea agglomerans suspensions<\/dc:title><dc:creator>\n        Kapetas, Leon<\/dc:creator><dc:creator>\n        Ngwenya, Bryne T.<\/dc:creator><dc:creator>\n        MacDonald, Alan M.<\/dc:creator><dc:creator>\n        Elphick, Stephen C.<\/dc:creator><dc:description>\n        Several recent studies have made use of continuous acid–base titration data to describe the surface chemistry of bacterial cells as a basis for accurately modelling metal adsorption to bacteria and other biomaterials of potential industrial importance. These studies do not share a common protocol; rather they titrate in different pH ranges and they use different stability criteria to define equilibration time during titration. In the present study we investigate the kinetics of bacterial titrations and test the effect they have on the derivation of functional group concentrations and acidity constants. We titrated suspensions of Pantoea agglomerans by varying the equilibration time between successive titrant additions until stability of 0.1 or 0.001 mV s−1 was attained. We show that under longer equilibration times, titration results are less reproducible and suspensions exhibit marginally higher buffering. Fluorescence images suggest that cell lysis is not responsible for these effects. Rather, high DOC values and titration reversibility hysterisis after long equilibration times suggest that variability in buffering is due to the presence of bacterial exudates, as demonstrated by titrating supernatants separated from suspensions of different equilibration times. It is recommended that an optimal equilibration time is always determined with variable stability control and preliminary reversibility titration experiments.\\ud\n\\ud\n<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2011<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/14255\/1\/Kapetas2011_NORA.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Kapetas, Leon; Ngwenya, Bryne T.; MacDonald, Alan M.; Elphick, Stephen C..  2011  Kinetics of bacterial potentiometric titrations : the effect of equilibration time on buffering capacity of Pantoea agglomerans suspensions.   Journal of Colloid and Interface Science, 359 (2). 481-486.  https:\/\/doi.org\/10.1016\/j.jcis.2011.04.027 <https:\/\/doi.org\/10.1016\/j.jcis.2011.04.027>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/journal\/00219797<\/dc:relation><dc:relation>\n        10.1016\/j.jcis.2011.04.027<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/14255\/","http:\/\/www.sciencedirect.com\/science\/journal\/00219797","10.1016\/j.jcis.2011.04.027"],"year":2011,"topics":[],"subject":["Publication - Article","PeerReviewed"],"fullText":"Journal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 1\nKinetics of bacterial potentiometric titrations: the effect of equilibration time on 1 \nbuffering capacity of Pantoea agglomerans suspensions 2 \n 3 \nLeon Kapetasa,*, Bryne T. Ngwenyaa, Alan M. Macdonaldb and Stephen C. Elphicka. 4 \na School of Geosciences, Earth Subsurface Research Group, Grant Institute, 5 \nUniversity of Edinburgh, West Mains Road, Edinburgh EH9 3JW, United Kingdom 6 \nb British Geological Survey, Murchison House, West Mains Road, Edinburgh EH9 7 \n3LA, United Kingdom 8 \n*Corresponding author. Tel: +44 (0) 1316508507, +30 6978651161, email: 9 \nlekas11@gmail.com  10 \n 11 \nAbstract 12 \nSeveral recent studies have made use of continuous acid-base titration data to describe 13 \nthe surface chemistry of bacterial cells as a basis for accurately modelling metal 14 \nadsorption to bacteria and other biomaterials of potential industrial importance. These 15 \nstudies do not share a common protocol; rather they titrate in different pH ranges and 16 \nthey use different stability criteria to define equilibration time during titration. In the 17 \npresent study we investigate the kinetics of bacterial titrations and test the effect they 18 \nhave on the derivation of functional group concentrations and acidity constants. We 19 \ntitrated suspensions of Pantoea agglomerans by varying the equilibration time 20 \nbetween successive titrant additions until stability of 0.1 or 0.001 mV s-1 was attained. 21 \nWe show that under longer equilibration times, titration results are less reproducible 22 \nand suspensions exhibit marginally higher buffering. Fluorescence images suggest 23 \nthat cell lysis is not responsible for these effects. Rather, high DOC values and 24 \ntitration reversibility hysterisis after long equilibration times suggest that variability in 25 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 2\nbuffering is due to the presence of bacterial exudates, as demonstrated by titrating 26 \nsupernatants separated from suspensions of different equilibration times. It is 27 \nrecommended that an optimal equilibration time is always determined with variable 28 \nstability control and preliminary reversibility titration experiments.  29 \n 30 \nKeywords: Bacterial titrations; stability criteria; exudate production 31 \n 32 \n1. Introduction 33 \nPotentiometric titrations have become a standard methodology for characterising 34 \nproton exchange between bacterial surfaces and their surrounding solutions. Acidity 35 \nconstants and concentrations of functional groups are derived using Surface 36 \nComplexation (SC) modelling of titration results. These parameters are then used in 37 \nSC models to predict metal adsorption by the cell surfaces [1-9]. A survey of 38 \nexperimental practice shows that there is no standard protocol adopted in all titration 39 \nstudies. For instance, the temperature of titration experiments might vary between 40 \nstudies despite recent evidence of the temperature dependence of titration results [10, 41 \n11]. Similarly, there is no consensus regarding the pH range within which titrations 42 \nshould be carried out. In most studies suspension pH is dropped to a low value 43 \n(between 2.4 and 4) by acidification or acid titration and then by base titration it is 44 \nincreased to approximately 10-11 [1, 2, 7, 12-22]. Fein et al. [23] carried out titrations 45 \nto pH values as low as 2, since proton adsorption can occur at this low pH. However, 46 \nin other studies it was preferred to titrate in both directions by separating the 47 \nsuspension into two equal volumes and starting titration from the immersion pH, for 48 \nfear of denaturizing the cell membrane or promoting cell aggregation under extreme 49 \npH conditions [3, 6]. Borrok et al. [24] suggested that suspension pH values close to 3 50 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 3\ncan cause cell damage, indicated by elevated DOC values at this pH range. Similarly, 51 \nfor pH above 10 significant cell lysis can occur and may interfere with the buffering 52 \nmeasurements [23]. 53 \n 54 \nAnother significant issue is the stability criterion chosen to estimate equilibration time 55 \nfor continuous titrations.  In most studies the equilibration time is controlled by the 56 \nstability criterion of 0.1 mV s-1 [2-4, 8, 14, 16, 17, 20, 25]. In a few studies the 57 \nstability criterion is set at 0.01 mV s-1 [7, 23], while in others it is more strict with 58 \nvalues of 0.1 and 0.15 mV min-1 (0.0017  and 0.0025 mV s-1) [18, 19]. Other studies 59 \nuse pH units when reporting stability criteria at 0.001 pH s-1, approximately 60 \nequivalent to 0.06 mV s-1 [1, 26]. Alternatively, a few studies have dealt with this 61 \nproblem by conducting discontinuous titrations in limited residence time reactors [27, 62 \n28]. This approach has been adapted from mineral surface charge studies [29-31]. 63 \nNevertheless, most studies use the traditional continuous titration approach, which is 64 \nthe focus of this study. 65 \n 66 \nAs yet, there has been no study that has rigorously investigated the amount of time 67 \nrequired to reach equilibrium during bacterial titrations, i.e. investigate if the reaction 68 \nof the surface with the acid\/base proceeds after the stability criterion is met.  Duc et al. 69 \n[32] used oxide mineral surfaces to examine the effect of the acid-base titration speed 70 \non the pH measurements and on the surface charge calculation. They found that when 71 \nthe titration speed was increased, the measured pH value for the same added volume 72 \nof acid increased. They differentiated between “fast” step reactions, attributed to the 73 \nsurface, and “slow” step reactions during titrations. By analogy, our study examines 74 \nthe effect that titration speed can have on bacterial surface proton exchange. Our 75 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 4\nhypothesis tests whether longer equilibration times will lead to further acid\/base 76 \nconsumption due to proton surface adsorption and\/or intracellular 77 \ndiffusion\/consumption. Alternatively, longer times could cause cell lysis and\/or the 78 \nproduction of exudates which might lead to higher buffering capacity than expected 79 \nby the surface chemistry alone. We use a combination of titration results using 80 \ndifferent titration speeds, DOC measurements, titration reversibility and cell viability 81 \nexamination to investigate these hypotheses. 82 \n 83 \n84 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 5\n2. Materials and Methods 85 \n2.1. Bacterial potentiometric titrations 86 \nFresh batches of Pantoea agglomerans (also known as Enterobacter agglomerans 87 \n[33]) cells were cultured and titrated after the method of Tourney et al. [21]. 88 \nPotentiometric titrations were carried out on fresh cell pellets suspended in 50 mL 89 \n0.01M NaClO4 background electrolyte. Before titration, cell pellets were washed three 90 \nadditional times in NaClO4 electrolyte of the same concentration used in the titration 91 \nexperiments. Also, the pH of the cell suspension was adjusted to approximately 4 by 92 \nadding a known amount of standard 0.5 M HNO3 solution. The pH was not reduced 93 \nfurther in order to avoid cell lysis [24] and “acid shock” to the cells [34]. 94 \n 95 \nTitrations were carried out between pH values 4 and 10 in dynamic mode with a 96 \nDL53 Mettler Toledo automatic titrator. Using this automated setting the volume of 97 \nthe successive aliquots of titrant standard 0.5 M NaOH added to the suspension was 98 \nadjustable – it was increased when change of pH was small and it was reduced when 99 \npH shift was large. Titrations were carried out using two different stability criteria: 0.1 100 \nand 0.001 pH min-1 (equivalent to 0.1 and 0.001 mV s-1), set as 0.1 mV in 1 s and 0.06 101 \nmV in 60 s respectively (a criterion of less than 0.06 mV should not be used due to 102 \nmeter precision limitations). The two stability criteria were chosen simply to represent 103 \nthe two extremes commonly used in the literature, as reviewed above. For the short 104 \nequilibration time, a minimum and maximum equilibration time was set at 2 and 5 105 \nminutes respectively, while for the long equilibration time the minimum and 106 \nmaximum time was set at 2 and 12 minutes respectively. The upper time limit was set 107 \nto allow the titration to proceed in case of continuous buffering of the base. It also 108 \nguaranteed that the titrations would be completed within 4 hours, thus avoiding the 109 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 6\npossibility of cell starvation leading to cell death [35]. Reversibility titrations were 110 \nalso conducted at the two equilibration times. Down-pH titrations were carried out 111 \nusing standard 0.5 M HNO3 titrant. 112 \n 113 \n2.2. Titration data modelling 114 \nSurface complexation modelling of titration data was carried out using the 115 \noptimization program FITEQL 4.0 [36]. Titration data were plotted in terms of molar 116 \nconcentration of protons exchanged by the cell surface per gram of  biomass 117 \naccording to Fein et al. [23]: 118 \nbexch mHOHCbCaH \/])[][(][\n              (1) 119 \nwhere Ca and Cb are the concentrations of acid and base (mol L-1) for each titration 120 \nstep, [OH-] and [H+] (mol L-1) are the equilibrium concentrations of OH- and H+ at 121 \nequilibrium and mb is the dry biomass concentration (g L-1). Hence, [H+]exch has units 122 \nof mol g-1. Due to uncertainties with determining the surface potential [23], a non 123 \nelectrostatic model was chosen to derive the concentrations and acidity constants of 124 \nthe functional groups that exchange protons. We describe their deprotonation using a 125 \nnumber of monoprotic discrete acids according to Borrok and Fein [37]: 126 \n  HARAHR     (2) 127 \nwhere R denotes the bacterium where the functional group type, A, is attached. R-A- 128 \nand R-AH represent deprotonated and protonated sites of the functional group 129 \nrespectively. Acidity constants Ki (i= 1, 2, 3…) are calculated using the following 130 \nexpression: 131 \n][\n]][[\nAHR\nHARKi \n\n\n    (3) 132 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 7\nwhere brackets represent the concentrations of the sites at equilibrium and [H+] the 133 \nactivity of protons in solution. Cell surfaces are negatively charged even at low pH 134 \nconditions [23]. Hence, titration data were corrected to account for initial protonation 135 \nstate [21, 23, 38, 39]. This correction vertically shifts the titration curves closer to the 136 \nisoelectric point of most bacteria as determined by electrophoretic mobility 137 \nmeasurements [22, 23, 40]. Models with varying number of functional group types 138 \nwere tested and the quality of fit criterion V(Y) of FITEQL 4.0 was used to select the 139 \nmost suitable model [8]. A value of V(Y) lower than 20 suggests a good model fit. 140 \n 141 \n2.3. Dissolved organic carbon (DOC) measurements 142 \nDOC samples were taken from bacterial suspensions. The sample preparation and 143 \nanalysis technique is detailed in Tourney et al. [41]. Briefly, samples were filtered 144 \ninto ashed glass vials using a 0.22 μm cellulose acetate membrane syringe filters. 145 \nSamples were then frozen until DOC analysis was carried out with a Shimadzu 6000 146 \nTOC\/TDN analyser. The analyser incorporates a high temperature catalytic oxidation 147 \nand non-dispersive infrared detector. External calibration standards prepared from a 148 \nstock solution of 1 g L-1 potassium hydrogen phthalate were run. Blank samples were 149 \nmeasured to correct sample DOC concentrations. The detection limit of the instrument 150 \nis 24 μg L-1, while the observed analytical precision was better than 2% in terms of 151 \nrelative standard deviation.   152 \n 153 \n2.4. Fluorescence Microscopy 154 \nLive\/dead bacteria viability tests were carried out on bacterial suspension samples 155 \ntaken at different pH values. Sample volumes of 1 mL were taken from the titration 156 \nsuspension and centrifuged for 5 minutes in ependorf microtubes. Cells were then 157 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 8\nwashed twice in 0.14 M NaCl solution and resuspended in 1 mL of 0.14 M NaCl. The 158 \nresulting suspension was stained with 3 μL of a 50:50 mixture containing SYTO 9 159 \ngreen-fluorescent nucleic acid stain and Propidium Iodide red-fluorescent nucleic acid 160 \nstain. The suspension was incubated according to the manufacturer’s protocol [42] 161 \nand cells were observed and photographed using a Zeiss Axioplan 2 microscope using 162 \nFITC filter with excitation 485\/20, emission 525\/30 and the Texas Red filter with 163 \nexcitation 560\/25, emission 607\/36. A Photometrics Coolsnap HQ camera was used 164 \nand all hardware was controlled by Metamorph 7.5. Images of live\/dead bacteria for 165 \nevery slide were finally combined using ImageJ (National Institute of Health, USA). 166 \nBacterial counts were carried out using CellC software for quantification of labelled 167 \nbacteria by automated image analysis [43]. This counting technique has a nominal 2% 168 \nerror. Comparisons between manual and CellC counts provided a 5% error in 169 \nestimates, which is consistent with the results of Gorman-Lewis [44].  170 \n 171 \n172 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 9\n3. Results 173 \n3.1. Titrations at varying equilibration times 174 \nTitrations were carried out on cell suspensions of 6, 9 and 12 g L-1 dry mass under 175 \nboth stability criteria. As can be seen in figure 1a, titrations are well reproduced when 176 \nfast equilibration is selected (low stability). On the other hand, figure 1b shows that 177 \nhigh stability leads to larger variation in titration results. Moreover, the titration curve 178 \nfor the 12 g L-1 reveals notably higher buffering capacity than the titration data of 179 \nfigure 1a. Titration of the 12 g L-1 suspension at 0.001 pH min-1 exhibits higher 180 \nbuffering than the two titrations carried out with the same stability criterion, but with 181 \nless biomass. Also, the 9 g L-1 at 0.001 pH min-1 data show a marginally higher 182 \nbuffering capacity than the 6 g L-1 at 0.001 pH min-1 data, though this difference is 183 \nwithin experimental error.  184 \n 185 \nTwo cell suspensions of 12 g L-1 were titrated at 0.1 and 0.001 pH min-1 and their 186 \nsupernatants were titrated under the same criteria respectively. Figure 1c shows the 187 \nnegligible buffering capacity of a bacteria-free electrolyte solution and compares the 188 \nbuffering of the titrated supernatant suspensions. The supernatant titrated at 0.001 pH 189 \nmin-1 shows 2.5 times greater buffering than the one titrated at 0.1 pH min-1. Hence, it 190 \nis suggested that DOC is present in the supernatant and has a variable contribution to 191 \nbuffering depending on the stability criterion used. The concentration of exchanged 192 \nprotons shown in figure 1c is approximated by the concentration of base added to the 193 \nsupernatant solution. This approximation is required since the amount of base and 194 \nacid added during the bacterial titration is not all transferred to the supernatant 195 \nsolution (cells had to be centrifuged and removed) and hence can not be calculated. 196 \nNonetheless, this practically does not affect the calculation of the buffering capacity 197 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 10\nof the supernatant, as it is base concentration that dominates buffering, i.e. the 198 \ndifference in Hexch between pH 4 and 10 is practically equal to the difference in Cb for 199 \nthe same pH range. Note that correcting bacterial titrations for supernatant buffering 200 \ndoes not necessarily improve the quality of the titration results. This is because DOC 201 \ngenerated at high pH was not present for the entire duration of the bacterial titration, 202 \ni.e. no correction is required for the initial times. 203 \n 204 \nFigure 1. Titration curves carried out using the (a) 0.1 pH min-1 and (b) 0.001 pH min-205 \n1 stability criteria, shown in the top and middle figure respectively. Results have been 206 \nnormalised by dry mass and corrected for initial protonation state. The titration curve 207 \nof 12 g L-1 carried out under low stability is plotted in figure 1b to allow comparisons 208 \nof the curve’s shapes and of their buffering capacity. The normalised buffering 209 \ncapacity of electrolyte and supernatant solutions are shown in the bottom figure (c).  210 \n 211 \nThe 0.1 pH min-1 stability criterion was met for all bacterial titration points within the 212 \ntime limits set by the experimental protocol. The 0.001 pH min-1 stability criterion 213 \nwas met in the beginning of the titration until approximately pH 5.5-6. Above this pH 214 \nvalue the time required for equilibration increased and the upper limit of 12 minutes 215 \nwas met before proceeding to new titrant addition, i.e. “equilibrium” was many times 216 \nnot attained under 0.001 pH min-1 criterion at pH values greater than 6. The fact that 217 \nequilibrium was not attained, also points to the production of DOC during the time 218 \ncourse of the titration, as will be shown in section 3.2. DOC in turn leads to the 219 \ndisplacement of the titration curves shown in figure 1b.  220 \n 221 \nA quantitative understanding of the differences between the bacterial titration curves 222 \nis provided by comparing the acidity constants and concentrations of the functional 223 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 11\ngroups of the surface. Table 1a shows the results of the 4 site non electrostatic model 224 \nwhich best described the titration curves. The average values of the acidity constants 225 \nfor both stability criteria are consistent with literature values of studies which made 226 \nuse of a four site non electrostatic model [16, 17, 21, 23, 38]. However, pK1 is higher 227 \nthan those found in literature because titrations did not cover the low pH range. This 228 \nis due to a limitation of the modelling approach, which does not effectively 229 \nextrapolate results outside or near the edge of the pH range of the dataset [45]. There 230 \nis an apparent shift to higher pK values associated with higher uncertainties when the 231 \nstability criterion of 0.001 pH min-1 is used. The buffering capacity in the pH 4-10 232 \nrange is comparable to that of gram negative Pseudomonas putida [46], however is an 233 \norder of magnitude lower than that of Pseudomonas aureofaciens [40]. Moreover, 234 \nthere is an average increase in total buffering capacity by almost 10-4 mol g-1 when 235 \nallowing longer equilibration. The difference in DOC buffering between the two 236 \nsupernatant titration curves (figure 1c) is large enough to account for this increase. 237 \nThe increase in buffering due to the presence of DOC is more notable at high biomass 238 \ntitrations because they last longer (more base consumed). Thus they allow more time 239 \nfor DOC production.  Moreover, the calculated functional group concentrations carry 240 \nhigh uncertainties in both cases, albeit with higher uncertainties in the 0.001 pH min-1 241 \ntitrations.  242 \n 243 \n 244 \n 245 \n 246 \n 247 \n 248 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 12\nStability   \npH min-1 V(Y) pK1 pK2 pK3 pK4 \nT1        \nmol g-1 \nT2        \nmol g-1 \nT3        \nmol g-1 \nT4        \nmol g-1 \nT(total)      \nmol g-1 \n0.1            \nAverage 0.45 4.14 5.71 7.34 9.46 4.02E-04 1.76E-04 2.00E-04 1.73E-04 9.51E-04 \nStd. \nDev.   0.03 0.03 0.05 0.01 1.71E-05 2.16E-05 1.62E-05 3.36E-05 1.13E-05 \n0.001            \nAverage 0.62 4.34 5.68 7.58 9.79 2.79E-04 2.88E-04 2.16E-04 2.53E-04 1.04E-03 \nStd. \nDev.   0.24 0.24 0.19 0.09 4.08E-05 2.23E-05 5.09E-05 8.64E-05 1.24E-04 \n 249 \nParameter pK1 pK2 pK3 pK4 T(total) \np-value 0.30 0.88 0.17 0.03 0.36 \n 250 \nTable 1. Values of acidity constants and site concentrations under the 0.1 pH min-1 251 \nand 0.001 pH min-1 stability criteria (top). Results are averages of the titration curves 252 \nshown in Figure 1. The p-values in table 1 (bottom), derived from student’s t-test, 253 \nexamine statistical differences between estimated parameters shown in table 1 (top). 254 \n 255 \nTitration modelling results for 0.1 and 0.001 pH min-1 stability criteria were analysed 256 \nwith a t-test to examine whether they are statistically different. An F-test on the 257 \nmodelled values (table 1 top) suggested that they possibly have statistically different 258 \nvariances. Therefore, the Welch’s t-test was applied, which is a specific solution of 259 \nthe Student’s t-test for samples with different variances [47]. Table 1 (bottom) shows 260 \nthe results of the t-test in terms of the probability that the mean values under study are 261 \nstatistically similar. At 95% confidence interval, only the pK4 values are statistically 262 \ndifferent between the two experimental protocols. It is apparent in figure 1b that 263 \ndeviation of titration curves carried out under different stability criteria takes place at 264 \nthe high pH range. Not surprisingly, this would be reflected in the values of pK4 265 \nand\/or T4. Individual differences in site concentrations are not examined with the t-266 \ntest since their values carry high uncertainties. Rather, it was preferred to compare the 267 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 13\ntotal site concentrations between the two experimental protocols. As can be seen in 268 \ntable 1 (bottom), the difference in T(total) was not significant.  269 \n 270 \n3.2. DOC results 271 \nDissolved organic carbon (DOC) samples were taken at the initial pH~6.2 conditions 272 \nof the suspension, at near pH 4 after the acidification step and at pH~10 conditions 273 \nafter the termination of the base titration. This was done for 9 g L-1 titration 274 \nsuspensions at both fast and slow titration rates. At the fast titration rate, DOC slightly 275 \nincreased after the acidification of the sample from 2.44 mg L-1 at immersion pH 276 \nconditions (pH~6.2) to 4.62 mg L-1 at pH~4. After the titration of the sample with 277 \nbase, DOC was measured again and was found equal to 4.81 mg L-1 (pH~10). At the 278 \nslow titration rate, DOC was initially measured at 1.82 mg L-1 (pH~ 6.2). After the 279 \nsample was acidified to pH~4, DOC increased to 3.50 mg L-1. DOC increased 280 \nsignificantly to 22.80 mg L-1 after the suspension was slowly titrated with base to 281 \npH~10. It has been shown that DOC levels in P. agglomerans suspensions clearly 282 \nincrease with time, particularly at higher pH conditions [48]. Pokrovsky et al. also 283 \nfound that levels of DOC increased during the course of automatic titrations of 284 \ncyanobacteria Gloeocapsa sp., which did not allow the quantification of surface 285 \nproton adsorption with this method  [28]. The increase in DOC can be attributed either 286 \nto the lysis product of a portion of the titrated cells or to the release of exudates [48]. 287 \nClaessens et al. reported an increase in base neutralisation at pH above 8 during static 288 \nexperiments and suggested that this was related to a metabolic response of Shewanella 289 \nputrefaciens cells releasing organic compounds [13]. On the other hand, Wightman et 290 \nal. showed that DOC does not contribute to proton buffering of B. subtilis surface 291 \ntitrations [49]. In this case, the production of DOC likely explains the variability in 292 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 14\nthe bacterial titration results between figure 1a and 1b, and is responsible for the 293 \nproton buffering by the supernatants. The origin of the DOC measured in suspension 294 \nat high pH after the long titrations (0.001 pH min-1) is investigated below by 295 \nexamining viability of the cells in suspension.   296 \n 297 \n3.3. Cell viability 298 \nFluorescence images of cells used in titrations were taken in order to understand the 299 \neffect that acidic and basic conditions or prolonged titrations can have on cell viability. 300 \nLive and Dead cell counts were carried out for suspensions before acidification, after 301 \nacidification and after completion of the base titration of a 9 g L-1 suspension at 0.001 302 \npH min-1. Glass slides were spotted with suspensions prepared from samples at initial 303 \npH~6.2, pH~4 and pH~10. Five images were taken per slide and more than 1000 cells 304 \nwere counted for every slide in order to obtain a representative idea of cell viability. 305 \nProportion of live\/dead cells was essentially the same at immersion pH~6.2 (88% 306 \nLive, 12% Dead), at pH~4 (86% Live, 14% Dead) after acidification, and at pH~10 307 \n(85% Live, 15% Dead) after titrating with base at 0.001 pH min-1. Percentage 308 \ndifferences are within error associated with the experimental technique and counting 309 \nmethod. Results of this semi-quantitative analysis suggest that cell lysis does not take 310 \nplace during the prolonged duration of the titration carried out within the 4-10 pH 311 \nrange using the 0.001 pH min-1 criterion. Since cell lysis is not the source of DOC, we 312 \nsuggest exudate production as the source. 313 \n 314 \n3.4. Reversibility of titrations 315 \nThe presence of higher DOC concentration increases proton buffering, but might also 316 \naffect the reversibility of titrations. Hence we decided to investigate this possibility. 317 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 15\nReversibility of titrations on 9 g L-1 bacterial suspensions was tested at both fast and 318 \nlow equilibration speed to investigate the potential effect of DOC. Figure 2 presents 319 \nthe acid and base titration curve results for both criteria. Results were corrected for 320 \ninitial protonation state assuming a 3 site non electrostatic model, as acid titrations did 321 \nnot converge under a 4 site model due to significant hysterisis. This difference does 322 \nnot affect buffering capacity of the titrations. While some reversibility hysterisis was 323 \nexhibited during fast equilibration (low stability), the slow equilibration procedure 324 \n(high stability) resulted in significant hysterisis, more pronounced at high pH where 325 \nhigh DOC (exudates) production has been demonstrated. Bacterial titration 326 \nirreversibility has been observed for other species during short equilibration times 327 \n[13], although most studies have not shown such behaviour at either high [50] or low 328 \nstability [2, 15, 25, 49, 51]. Further investigation is required to test whether such 329 \nbehaviour may be strain-dependent in terms of exudates production. Moreover, higher 330 \nbuffering was confirmed in the base titration with longer equilibration time (figure 2). 331 \nBoth observations suggest that a portion of the buffering during long equilibration 332 \ntimes is not related to the exchange of protons from the bacterial surface. Instead, an 333 \ninteraction between protons and released DOC is believed to be taking place. The 334 \nlocalisation of hysterisis to high pH suggests that the exudates contain primarily high 335 \npKa functional groups which do not contribute to solution phase proton buffering at 336 \nlow pH. This suggestion is in agreement with the supernatant titration results, which 337 \nshow greater proton buffering at high pH and convergence of curves from different 338 \ntitration speeds at low pH. 339 \n 340 \nFigure 2. Reversibility of acid-base titrations of 9 g L-1 dry weight cell suspensions 341 \nequilibrated using 0.1 pH min-1 (closed symbols) and 0.001 pH min-1 (open symbols) 342 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 16\nstability criteria. Circle and squares represent base and acid titration data respectively. 343 \nResults were normalised by dry weight to represent the proton exchange capacity per 344 \ngram biomass dry weight. 345 \n 346 \n347 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 17\n4. Discussion and Conclusions  348 \nWhen the stability criterion is set lower at 0.001 pH min-1 to allow more time for 349 \nequilibration, reproducibility of titrations is influenced adversely. The time limit for 350 \nequilibration (12 min) had to be invoked as equilibrium was not attained. High 351 \nstability is not suitable for this biomaterial due to inherent uncertainties related to its 352 \nmetabolic activity. The total site concentration of the fast titrations is lower than the 353 \ntotal concentration of the slower titrations. However, as was shown this difference is 354 \nnot statistically significant. This is because the exudates produced by these bacteria 355 \nhave low buffering capacity (as demonstrated by titration of supernatants), such that 356 \noverall buffering remains dominated by the cell surface. Based on reversibility 357 \nexperiments, exudates contribute to total buffering primarily at high pH with 358 \nmaximum hysterisis around pK3\/pK4 sites. This was also confirmed by titrating the 359 \nsupernatant of cell suspensions separately. Furthermore, significant differences at a 360 \n95% confidence interval are observed only in the values of pK4. This is anticipated 361 \nsince the variability of deprotonation between titrations with different stability criteria 362 \nis more notable at the high pH range (~8-10). 363 \n 364 \nThe titration of the supernatants and the DOC measurements give an insight into the 365 \npossible origin of the observed variability between titrations at varying equilibration 366 \ntimes. When the duration of the titrations is increased, the amount of DOC in the 367 \nsystem increases significantly. The higher DOC values measured in our study suggest 368 \nthat bacteria are metabolically releasing exudates. This inference is supported by the 369 \nfact that cell integrity between pH 4 and 10 is maintained in our experiments, since no 370 \ncell lysis takes place as shown by fluorescent imaging. The differences in cell 371 \nviability between initial, high and low pH are only marginal and within the precision 372 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 18\nof the method. Moreover, the duration of the experiments is sufficiently short to 373 \nexclude the possibility of cell starvation and death. 374 \n 375 \nExudates account for the slight increase in buffering capacity, but also for the lack of 376 \nreproducibility between titrations carried out with the high stability criteria. As the 377 \nexudates react with the titrating acid\/base added, the buffering observed cannot be 378 \nentirely attributed to the consumption of titrant by the cell surface. The larger 379 \nreversibility hysterisis noticed at 0.001 pH min-1 accompanied by increase DOC 380 \nvalues provides additional evidence to this.  381 \n 382 \nWe have tested whether increasing equilibration time during titration increases the 383 \nexchange of protons with the surface. Our results suggest it is preferable to use fast 384 \nequilibrium stability criteria, so that most of the apparent buffering capacity can be 385 \nattributed to the surface reactions. However, this result is not necessarily transferable. 386 \nFuture studies should individually (i) check for the buffering contribution of the 387 \nsupernatant and (ii) examine the reversibility of titrations of each bacterial species 388 \nunder each culture and titration protocol, as titrations might be reversible over a short 389 \ntime scales but not over long periods [15]. It was shown that the selection of stability 390 \ncriterion depends on the demonstration of reversibility; nevertheless, reversibility was 391 \nnot attained during this study under neither stability criteria.  392 \n 393 \nStrictly, the observed irreversibility under both criteria renders problematic the use of 394 \na thermodynamic approach on the titration curves, although the low contribution to 395 \nbuffering by exudates means that the differences are not statistically significant and 396 \nthus only affect precision. This effect became apparent in the quality of surface 397 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 19\ncomplexation modelling results which degraded due to the presence of non cell 398 \nsurface related buffering. This has implications for determining surface sites for 399 \nbacteria that shed DOC to the electrolyte, e.g. EPS-producing ones [21]. Finally, we 400 \nsuggest that small differences in site densities and pKa values reported in bacterial 401 \ntitration studies can, in some situations, be an artefact of different equilibration times. 402 \n 403 \nAcknowledgements 404 \nWe thank the Greek Scholarship Foundation and the School of Geosciences for 405 \nfunding this work. We also thank Stephen Mowbray for DOC analysis and David 406 \nKelly for fluorescence microscopy. 407 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 20\nReferences 408 \n[1] D.M. Borrok, J.B. Fein, J. Colloid Interface Sci. 286 (2005) 110. 409 \n[2] C.J. Daughney, J.B. Fein, N. Yee, Chem. Geol. 144 (1998) 161. 410 \n[3] R.P. Deo, W. Songkasiri, B.E. Rittmann, D.T. Reed, Environ. Sci. Technol. 44 411 \n(2010) 4930. 412 \n[4] J.B. Fein, C.J. Daughney, N. Yee, T.A. Davis, Geochim. Cosmochim. Acta 61 413 \n(1997) 3319. 414 \n[5] D.A. Fowle, J.B. Fein, Geochim. Cosmochim. Acta 63 (1999) 3059. 415 \n[6] V. Guine, L. Spadini, G. Sarret, M. Muris, C. Delolme, J.P. Gaudet, J.M.F. 416 \nMartins, Environ. Sci. Technol. 40 (2006) 1806. 417 \n[7] J.R. Haas, T.J. Dichristina, R. Wade, Chem. Geol. 180 (2001) 33. 418 \n[8] B.T. Ngwenya, I.W. Sutherland, L. Kennedy, Appl. Geochem. 18 (2003) 527. 419 \n[9] H. Seki, A. Suzuki, S. Mitsueda, J. Colloid Interface Sci. 197 (1998) 185. 420 \n[10] D. Gorman-Lewis, J. Colloid Interface Sci. 337 (2009) 390. 421 \n[11] D. Gorman-Lewis, J.B. Fein, M.P. Jensen, Geochim. Cosmochim. Acta 70 422 \n(2006) 4862. 423 \n[12] D.M. Borrok, J.B. Fein, C.F. Kulpa, Environ. Sci. Technol. 38 (2004) 5656. 424 \n[13] J. Claessens, T. Behrends, P. Van Cappellen, Aquat. Sci. 66 (2004) 19. 425 \n[14] C.J. Daughney, X. Châtellier, A. Chan, P. Kenward, D. Fortin, C.A. Suttle, 426 \nD.A. Fowle, Mar. Chem. 91 (2004) 101. 427 \n[15] H.T.M. Heinrich, P.J. Bremer, A.J. McQuillan, C.J. Daughney, Geochim. 428 \nCosmochim. Acta 72 (2008) 4185. 429 \n[16] K.J. Johnson, J.E.S. Szymanowski, D. Borrok, T.Q. Huynh, J.B. Fein, Chem. 430 \nGeol. 239 (2007) 13. 431 \n[17] E.S. Kaulbach, J.E.S. Szymanowski, J.B. Fein, Environ. Sci. Technol. 39 432 \n(2005) 4060. 433 \n[18] A.C.C. Plette, W.H. van Riemsdijk, M.F. Benedetti, A. van der Wal, J. Colloid 434 \nInterface Sci. 173 (1995) 354. 435 \n[19] I. Sokolov, D.S. Smith, G.S. Henderson, Y.A. Gorby, F.G. Ferris, Environ. Sci. 436 \nTechnol. 35 (2001) 341. 437 \n[20] J. Tourney, B.T. Ngwenya, J. Colloid Interface Sci. 348 (2010) 348. 438 \n[21] J. Tourney, B.T. Ngwenya, J.W.F. Mosselmans, L. Tetley, G.L. Cowie, Chem. 439 \nGeol. 247 (2008) 1. 440 \n[22] N. Yee, D.A. Fowle, F.G. Ferris, Geochim. Cosmochim. Acta 68 (2004) 3657. 441 \n[23] J.B. Fein, J.-F. Boily, N. Yee, D. Gorman-Lewis, B.F. Turner, Geochim. 442 \nCosmochim. Acta 69 (2005) 1123. 443 \n[24] D. Borrok, J.B. Fein, M. Tischler, E. O'Loughlin, H. Meyer, M. Liss, K.M. 444 \nKemner, Chem. Geol. 209 (2004) 107. 445 \n[25] C.J. Daughney, J.B. Fein, J. Colloid Interface Sci. 198 (1998) 53. 446 \n[26] D. Borrok, J.B. Fein, C.F. Kulpa, Geochim. Cosmochim. Acta 68 (2004) 3231. 447 \n[27] A. Gélabert, O.S. Pokrovsky, J. Schott, A. Boudou, A. Feurtet-Mazel, J. 448 \nMielczarski, E. Mielczarski, N. Mesmer-Dudons, O. Spalla, Geochim. Cosmochim. 449 \nActa 68 (2004) 4039. 450 \n[28] O.S. Pokrovsky, R.E. Martinez, S.V. Golubev, E.I. Kompantseva, L.S. 451 \nShirokova, Appl. Geochem. 23 (2008) 2574. 452 \n[29] L. Charlet, P. Wersin, W. Stumm, Geochim. Cosmochim. Acta 54 (1990) 453 \n2329. 454 \n[30] O.S. Pokrovsky, J. Schott, Geochim. Cosmochim. Acta 68 (2004) 31. 455 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 21\n[31] O.S. Pokrovsky, J. Schott, F. Thomas, Geochim. Cosmochim. Acta 63 (1999) 456 \n863. 457 \n[32] M. Duc, F. Adekola, G. Lefèvre, M. Fédoroff, J. Colloid Interface Sci. 303 458 \n(2006) 49. 459 \n[33] B.T. Ngwenya, J. Tourney, M. Magennis, L. Kapetas, V. Olive, Desalination 460 \n248 (2009) 344. 461 \n[34] B.R. Ginn, J.B. Fein, Geochim. Cosmochim. Acta 72 (2008) 3939. 462 \n[35] S. Kjelleberg, B.A. Humphrey, K.C. Marshall, Appl. Environ. Microbiol. 46 463 \n(1983) 978. 464 \n[36] A.L. Herbelin, J.C. Westall, Report 99–01 Department of Chemistry Oregon 465 \nState University, Corvallis. (1999). 466 \n[37] D. Borrok, J.B. Fein, Geochim. Cosmochim. Acta 68 (2004) 3043. 467 \n[38] D. Borrok, B.F. Turner, J.B. Fein, Am. J. Sci. 305 (2005) 826. 468 \n[39] J.C. Westall, J.D. Jones, G.D. Turner, J.M. Zachara, Environ. Sci. Technol. 29 469 \n(1995) 951. 470 \n[40] A.G. González, L.S. Shirokova, O.S. Pokrovsky, E.E. Emnova, R.E. Martínez, 471 \nJ.M. Santana-Casiano, M. González-Dávila, G.S. Pokrovski, J. Colloid Interface Sci. 472 \n350 (2010) 305. 473 \n[41] J. Tourney, B.T. Ngwenya, J.W. Fred Mosselmans, M. Magennis, J. Colloid 474 \nInterface Sci. 337 (2009) 381. 475 \n[42] MolecularProbes, (2004). 476 \n[43] J. Selinummi, J. Seppälä, O. Yli-Harja, J.A. Puhakka, BioTechniques 39 (2005) 477 \n859. 478 \n[44] D. Gorman-Lewis, Geochim. Cosmochim. Acta In Press, Accepted 479 \nManuscript (in press). 480 \n[45] S.V. Lalonde, D.S. Smith, G.W. Owttrim, K.O. Konhauser, Geochim. 481 \nCosmochim. Acta 72 (2008) 1257. 482 \n[46] L. Fang, X. Wei, P. Cai, Q. Huang, H. Chen, W. Liang, X. Rong, Bioresour. 483 \nTechnol. 102 (2011) 1137. 484 \n[47] S.S. Qian, CRC Press (2010). 485 \n[48] B.T. Ngwenya, Chemosphere 67 (2007) 1982. 486 \n[49] P.G. Wightman, J.B. Fein, D.J. Wesolowski, T.J. Phelps, P. Bénézeth, D.A. 487 \nPalmer, Geochim. Cosmochim. Acta 65 (2001) 3657. 488 \n[50] C.J. Daughney, D.A. Fowle, D. Fortin, Geochim. Cosmochim. Acta 65 (2001) 489 \n1025. 490 \n[51] P.-G. Burnett, H. Heinrich, D. Peak, P.J. Bremer, A.J. McQuillan, C.J. 491 \nDaughney, Geochim. Cosmochim. Acta 70 (2006) 1914. 492 \n 493 \n 494 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 22\n 495 \nFigure 1. Titration curves carried out using the (a) 0.1 pH min-1 and (b) 0.001 pH min-496 \n1 stability criteria, shown in the top and middle figure respectively. Results have been 497 \nnormalised by dry mass and corrected for initial protonation state. The titration curve 498 \nof 12 g L-1 carried out under low stability is plotted in figure 1b to allow comparisons 499 \nof the curve’s shapes and of their buffering capacity. The normalised buffering 500 \ncapacity of electrolyte and supernatant solutions are shown in the bottom figure (c).  501 \n 502 \nJournal of Colloid and Interface Science, 359:481‐486. (Accepted version March 2011) \n 23\n 503 \nFigure 2. Reversibility of acid-base titrations of 9 g L-1 dry weight cell suspensions 504 \nequilibrated using 0.1 pH min-1 (closed symbols) and 0.001 pH min-1 (open symbols) 505 \nstability criteria. Circle and squares represent base and acid titration data respectively. 506 \nResults were normalised by dry weight to represent the proton exchange capacity per 507 \ngram biomass dry weight. 508 \n 509 \n 510 \n 511 \n"}