{"doi":"10.1017\/S1463423609001121","coreId":"68343","oai":"oai:eprints.lancs.ac.uk:32715","identifiers":["oai:eprints.lancs.ac.uk:32715","10.1017\/S1463423609001121"],"title":"Insights into the impact of clinical encounters gained from personal accounts of living with advanced cancer.","authors":["Reeve, Joanne","Lloyd-Williams, Mari","Payne, Sheila","Dowrick, Christopher"],"enrichments":{"references":[{"id":890073,"title":"Affective disorders in advanced cancer.","authors":[],"date":"2002","doi":null,"raw":"Potash, M. and Breitbart, W. 2002: Affective disorders in advanced cancer. Hematology – oncology clinics of North America 16, 671–700.","cites":null},{"id":886375,"title":"An exploration of the value of the personal doctor–patient relationship in general practice.","authors":[],"date":"2001","doi":null,"raw":"Kearley, K.E., Freeman, G.K. and Heath, A. 2001: An exploration of the value of the personal doctor–patient relationship in general practice. British Journal of General Practice 51, 712–18.","cites":null},{"id":882875,"title":"Biomedicine, holism and general medical practice: responses to the 2004 General Practitioner contract.","authors":[],"date":"2008","doi":null,"raw":"Checkland, K., Harrison, S., McDonald, R. and Grant, S. 2008: Biomedicine, holism and general medical practice: responses to the 2004 General Practitioner contract. Sociology of Health & Illness 30, 788–803.","cites":null},{"id":884270,"title":"Brief structured recall: a more efﬁcient method for studying signiﬁcant therapy events.","authors":[],"date":"1988","doi":null,"raw":"Elliott, R. and Shapiro, D.A. 1988: Brief structured recall: a more efﬁcient method for studying signiﬁcant therapy events. British Journal of Medical Psychology 61, 141–53.","cites":null},{"id":890352,"title":"Contemporary schools of metascience. Volume II. Sweden: Berlingska Boktryckeriet Lund.","authors":[],"date":"1968","doi":null,"raw":"Radnitsky, G. 1968: Contemporary schools of metascience. Volume II. Sweden: Berlingska Boktryckeriet Lund.","cites":null},{"id":891590,"title":"Core assumptions and research opportunities in clinical communication.","authors":[],"date":"2005","doi":null,"raw":"Salmon, P. and Young, B. 2005: Core assumptions and research opportunities in clinical communication. Patient Education and Counselling 58, 225–34.","cites":null},{"id":887637,"title":"Criterion validation of the Edinburgh postnatal depression scale as a screening tool for depression in patients with advanced metastatic cancer.","authors":[],"date":"2000","doi":null,"raw":"Lloyd-Williams, M., Friedman, T. and Rudd, N. 2000: Criterion validation of the Edinburgh postnatal depression scale as a screening tool for depression in patients with advanced metastatic cancer. Journal of Pain and Symptom Management 20, 259–65.","cites":null},{"id":892362,"title":"Depression in palliative care: a pragmatic report from the Expert Working Group of the European Association for Palliative Care. Supportive Care in Cancer 9,","authors":[],"date":"2001","doi":null,"raw":"Stiefel, R., Die, T.M., Berney, A., Olarte, J.M. and Razavi, A. 2001: Depression in palliative care: a pragmatic report from the Expert Working Group of the European Association for Palliative Care. Supportive Care in Cancer 9, 477–88.","cites":null},{"id":882400,"title":"Designing and evaluating complex interventions to improve clinical care.","authors":[],"date":"2007","doi":null,"raw":"Campbell, N.C., Murray, E., Darbyshire, J., Emery, J., Farmer, A., Grifﬁths, F., Guthrie, B., Lester, H., Wilson, P. and Kinmonth, A.L. 2007: Designing and evaluating complex interventions to improve clinical care. British Medical Journal 334, 455–59.","cites":null},{"id":886137,"title":"Developing a consultation quality index (CQI) for use in general practice.","authors":[],"date":"2000","doi":null,"raw":"Howie, J.G.R., Heaney, D.J., Maxwell, M., Walker, J.J. and Freeman, G.K. 2000: Developing a consultation quality index (CQI) for use in general practice. Family Practice 17, 455–61.","cites":null},{"id":881392,"title":"Developing narrative research in supportive and palliative care: the focus on illness narratives.","authors":[],"date":"2008","doi":null,"raw":"Bingley, A., Thomas, C., Brown, J., Reeve, J. and Payne, S. 2008: Developing narrative research in supportive and palliative care: the focus on illness narratives. Palliative Medicine 22, 653–58.","cites":null},{"id":893242,"title":"Diagnosis and management of depression in palliative care.","authors":[],"date":"2000","doi":null,"raw":"Wilson, K., Chochinov, H.M., de Faye, B.J. and Breitbart, W. 2000: Diagnosis and management of depression in palliative care. Ch. 3. In Chochinov, H.M. and Breitbart, W., editors, Handbook of Psychiatry in Palliative Care. Oxford, UK: Oxford University Press, 25–49.","cites":null},{"id":882146,"title":"Doctors’ communication of trust, care and respect in breast cancer: qualitative study.","authors":[],"date":"2004","doi":null,"raw":"Burkitt Wright, E., Holcombe, C. and Salmon, P. 2004: Doctors’ communication of trust, care and respect in breast cancer: qualitative study. British Medical Journal 328, 864–69.","cites":null},{"id":892074,"title":"Doing qualitative research. A practical handbook.","authors":[],"date":"2000","doi":null,"raw":"Silverman, D. 2000: Doing qualitative research. A practical handbook. London, UK: Sage Publications Ltd.","cites":null},{"id":888979,"title":"Eliciting patients’ concerns: an RCT of different approaches by the doctor.","authors":[],"date":"2004","doi":null,"raw":"McLean, M. and Armstrong, D. 2004: Eliciting patients’ concerns: an RCT of different approaches by the doctor. British Journal of General Practice 54, 663–66.","cites":null},{"id":892919,"title":"Emotions, health and illness: the ‘missing link’ in medical sociology?","authors":[],"date":"1996","doi":null,"raw":"Williams, S. and Bendelow, G. 1996: Emotions, health and illness: the ‘missing link’ in medical sociology? Ch. 2. 366 Joanne Reeve et al.","cites":null},{"id":889229,"title":"Empathy and quality of care.","authors":[],"date":"2002","doi":null,"raw":"Mercer, S.W. and Reynolds, W.J. 2002: Empathy and quality of care. British Journal of General Practice 52, S9–13.","cites":null},{"id":888744,"title":"Framing the doctor–patient relationship in chronic illness: a comparative study of general practitioners’ accounts.","authors":[],"date":"2004","doi":null,"raw":"May, C., Allison, G., Chapple, A., Chew-Graham, C., Dixon, C., Gask, L., Graham, R., Rogers, A. and Roland, M. 2004: Framing the doctor–patient relationship in chronic illness: a comparative study of general practitioners’ accounts. Sociology of Health and Illness 26, 135–58.","cites":null},{"id":888437,"title":"Healing dramas and clinical plots. The narrative structure of experience.","authors":[],"date":"1998","doi":null,"raw":"Mattingley, C. 1998: Healing dramas and clinical plots. The narrative structure of experience. Cambridge, UK: Cambridge University Press.","cites":null},{"id":893192,"title":"Health and the sociology of emotions.","authors":[],"date":null,"doi":null,"raw":"Primary Health Care Research & Development 2009; 10: 357–367In James, V. and Gabe, J., editors, Health and the sociology of emotions. Oxford, UK: Blackwell Publishers Ltd, 25–53.","cites":null},{"id":886909,"title":"Illness representations and coping with health threats.","authors":[],"date":"1984","doi":null,"raw":"Leventhal, H., Nerenz, D.R. and Steele, D.J. 1984: Illness representations and coping with health threats. Ch. 9. In: Baum, A., Taylor, S.E. and Singer, J.E., editors, Handbook of psychology and health. Volume IV. Hillsdale, NJ, USA: Erlbaum, 219–52.","cites":null},{"id":883425,"title":"Inﬂuence and context effects on health outcomes: a systematic review.","authors":[],"date":"2001","doi":null,"raw":"Di Blasi, Z., Harkness, E., Ernst, E., Georgiou, A. and Kleijnen, J. 2001: Inﬂuence and context effects on health outcomes: a systematic review. Lancet 357, 757–62.","cites":null},{"id":886655,"title":"InterViews. An introduction to qualitative research interviewing. Thousand Oaks,","authors":[],"date":"1996","doi":null,"raw":"Kvale, S. 1996: InterViews. An introduction to qualitative research interviewing. Thousand Oaks, CA, USA: Sage Publications Inc.","cites":null},{"id":887892,"title":"Key communication skills and how to acquire them.","authors":[],"date":"2002","doi":null,"raw":"Maguire, P. and Pitceathly, C. 2002: Key communication skills and how to acquire them. British Medical Journal 325, 697–700.","cites":null},{"id":883690,"title":"Knowing responsibly: linking ethics, research practice and epistemology.","authors":[],"date":"2002","doi":null,"raw":"Doucet, A. and Mauthner, N. 2002: Knowing responsibly: linking ethics, research practice and epistemology. Ch. 7. In Mauthner, M. and Birch, M.T., editors, Ethics in qualitative research. London, UK: Sage Publications Ltd, 123–45.","cites":null},{"id":880839,"title":"Learning by reﬂection in general practice: a study report.","authors":[],"date":"1995","doi":null,"raw":"Al Sheri, A. 1995: Learning by reﬂection in general practice: a study report. Education for General Practice 7, 237–48.","cites":null},{"id":887160,"title":"Measuring psychiatric disorder in the community: a standardised assessment for use by lay interviewers.","authors":[],"date":"1992","doi":null,"raw":"Lewis, G., Pelosi, A., Araya, R. and Dunn, G. 1992: Measuring psychiatric disorder in the community: a standardised assessment for use by lay interviewers. Psychological Medicine 22, 465–86.","cites":null},{"id":891837,"title":"Medical knowledge: doubt and uncertainty.","authors":[],"date":"1994","doi":null,"raw":"Seale, C. and Pattison, S., editors. 1994: Medical knowledge: doubt and uncertainty. Buckingham, UK: The Open University Press.","cites":null},{"id":881875,"title":"Misunderstandings in prescribing decisions in general practice.","authors":[],"date":"2000","doi":null,"raw":"Britten, N., Stevenson, F., Barry, C., Barber, N. and Bradley, C.P. 2000: Misunderstandings in prescribing decisions in general practice. British Medical Journal 320, 484–88.","cites":null},{"id":892635,"title":"Narrative research methods in palliative care contexts: two case studies.","authors":[],"date":"2008","doi":null,"raw":"Thomas, C., Reeve, J., Bingley, A., Brown, J., Payne, S. and Lynch, T. 2008: Narrative research methods in palliative care contexts: two case studies. Journal of Pain and Symptom Management (in press, available on-line October 2008).","cites":null},{"id":887358,"title":"Narrative research. Reading, analysis and interpretation.","authors":[],"date":"1998","doi":null,"raw":"Lieblich, A., Tuval-Maschiach, R. and Zilber, T. 1998: Narrative research. Reading, analysis and interpretation. CA, USA: Sage Publications Ltd.","cites":null},{"id":886872,"title":"Narrative-based primary care. A practical guide.","authors":[],"date":"2002","doi":null,"raw":"Launer, J. 2002: Narrative-based primary care. A practical guide. Oxon, UK: Radcliffe Medical Press Ltd.","cites":null},{"id":888169,"title":"Phenomenography – a research approach to investigating different understandings of reality.","authors":[],"date":"1986","doi":null,"raw":"Marton, F. 1986: Phenomenography – a research approach to investigating different understandings of reality. Journal of Thought 21, 28–48.","cites":null},{"id":885379,"title":"Policy emergence and policy convergence: the case of ‘scientiﬁc–bureaucratic medicine’ in the United States and United Kingdom.","authors":[],"date":"2002","doi":null,"raw":"Harrison, S., Moran, M. and Wood, B. 2002: Policy emergence and policy convergence: the case of ‘scientiﬁc–bureaucratic medicine’ in the United States and United Kingdom. British Journal of Politics and International Relations 4, 1–24.","cites":null},{"id":889517,"title":"Process and outcome in psychotherapy – noch einmal.","authors":[],"date":"1994","doi":null,"raw":"Orlinsky, D.E., Grawe, K. and Parks, B.K. 1994: Process and outcome in psychotherapy – noch einmal. Ch. 8. In Bergen, A.E. and Garﬁeld, S.L., editors, Handbook of psychotherapy and behavioural change. NY, USA: John Wiley and Sons Inc., 270–376.","cites":null},{"id":885108,"title":"Productive and unproductive depression. Success or failure of a vital process.","authors":[],"date":"1989","doi":null,"raw":"Gut, E. 1989: Productive and unproductive depression. Success or failure of a vital process. London, UK: Routledge.","cites":null},{"id":891073,"title":"Revisiting biographical disruption: exploring individual embodied illness experience in people with terminal cancer.","authors":[],"date":"2009","doi":null,"raw":"Reeve, J., Lloyd-Williams, M., Payne, S. and Dowrick, C. 2009b: Revisiting biographical disruption: exploring individual embodied illness experience in people with terminal cancer. Health (in press).","cites":null},{"id":891333,"title":"Shared decision making and the experience of partnership in primary care.","authors":[],"date":"2006","doi":null,"raw":"Saba, G.W., Wong, S.T., Schillinger, D., Fernandez, A., Somkin, C.P., Wilson, C.C. and Grumbach, K. 2006: Shared decision making and the experience of partnership in primary care. Annals of Family Medicine 4, 54–62.","cites":null},{"id":881630,"title":"The biopsychosocial model 25 years later: principles, practice and scientiﬁc inquiry.","authors":[],"date":"2004","doi":null,"raw":"Borrell-Carrio, F., Suchman, A.L. and Epstein, R.M. 2004: The biopsychosocial model 25 years later: principles, practice and scientiﬁc inquiry. Annals of Family Medicine 2, 576–82.","cites":null},{"id":883955,"title":"The biopsychosocial model of General Practice: rhetoric or reality?","authors":[],"date":"1996","doi":null,"raw":"Dowrick, C., May, C., Richardson, M. and Bundred, P. 1996: The biopsychosocial model of General Practice: rhetoric or reality? British Journal of General Practice 46, 105–107.","cites":null},{"id":881139,"title":"The doctor, his patient, and the illness.","authors":[],"date":"1955","doi":null,"raw":"Balint, M. 1955: The doctor, his patient, and the illness. Lancet 1, 683–88.","cites":null},{"id":893520,"title":"The European Deﬁnition of General Practice\/Family Medicine.","authors":[],"date":"2005","doi":null,"raw":"WONCA Europe. 2005: The European Deﬁnition of General Practice\/Family Medicine. Retrieved 9 March 2009 from http:\/\/www.woncaeurope.org\/Deﬁnition%20GP-FM.htm World Health Organization. 1992: ICD-10 classiﬁcation of mental and behavioural disorders: clinical descriptions and diagnostic guidelines. Geneva, Switzerland: World Health Organization. Impact of clinical encounters 367 Primary Health Care Research & Development 2009; 10: 357–367","cites":null},{"id":883149,"title":"The harmful consequences of elevating the doctor–patient relationship to be a primary goal of the primary care consultation.","authors":[],"date":"2004","doi":null,"raw":"Chew-Graham, C.A., May, C.R. and Roland, M.O. 2004: The harmful consequences of elevating the doctor–patient relationship to be a primary goal of the primary care consultation. Family Practice 21, 229–31.","cites":null},{"id":889796,"title":"The illness experience: state of knowledge and perspectives for research.","authors":[],"date":"2003","doi":null,"raw":"Pierret, J. 2003: The illness experience: state of knowledge and perspectives for research. Sociology of Health and Illness 25, 4–22.","cites":null},{"id":884838,"title":"The journey towards patient centredness.","authors":[],"date":"2004","doi":null,"raw":"Freeman, G., Car, J. and Hill, A. 2004: The journey towards patient centredness. British Journal of General Practice 54, 651–52. Impact of clinical encounters 365 Primary Health Care Research & Development 2009; 10: 357–367Greenhalgh, T. and Hurwitz, B. 1998: Narrative based medicine. Dialogue and discourse in clinical practice. London, UK: BMJ Books.","cites":null},{"id":884541,"title":"The NCRI cancer experiences collaborative: deﬁning self management.","authors":[],"date":"2007","doi":null,"raw":"Foster, C., Brown, J., Killen, M. and Brearley, S. 2007: The NCRI cancer experiences collaborative: deﬁning self management. European Journal of Oncology Nursing 11, 295–97.","cites":null},{"id":890860,"title":"Towards a re-conceptualisation of the management of distress in palliative care patients.","authors":[],"date":"2009","doi":null,"raw":"Reeve, J., Lloyd-Williams, M., Payne, S. and Dowrick, C. 2009a: Towards a re-conceptualisation of the management of distress in palliative care patients. Progress in Palliative Care 17, 51–60.","cites":null},{"id":888720,"title":"Understanding and validity in qualitative research.","authors":[],"date":"2002","doi":null,"raw":"Maxwell, J. 2002: Understanding and validity in qualitative research. Ch. 2. In Huberman, A. and Miles, M., editors, The qualitative researcher’s companion. Thousand Oaks, CA, USA: Sage Publications Ltd, 37–64.","cites":null},{"id":890572,"title":"Understanding distress in people with terminal cancer: the role of the general practitioner, Doctoral thesis.","authors":[],"date":"2006","doi":null,"raw":"Reeve, J. 2006: Understanding distress in people with terminal cancer: the role of the general practitioner, Doctoral thesis. Liverpool, UK: Liverpool University.","cites":null},{"id":885616,"title":"Volume II: on decorum and the physician.","authors":[],"date":"1923","doi":null,"raw":"Hippocrates. 1923: Volume II: on decorum and the physician. London, UK: William Heinemann.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-10","abstract":"Aim To describe the impact of interactions with health care professionals revealed by people’s accounts of living and dying with cancer; to explore reasons for the observed effects; and thus, to consider the implications for practice. Background The importance of practitioner–patient interactions is enshrined within professional values. However, our understanding of how and why the consultation impacts on outcomes remains underdeveloped. Stories recounted by people living and dying with cancer offer important insights into illness experience, including the impact of contact with health services, framed within the context of the wider social setting in which people live their lives. From our recent study of distress in primary palliative care patients, we describe how people’s accounts revealed both therapeutic and noxious effects of such encounters, and discuss reasons for the observed effects. Method A qualitative study with a purposive sample of 19 primary palliative care patients: (8 men, 11 at high risk of depression). In-depth interviews were analysed using the iterative thematic analysis described by Lieblich. Findings Living with cancer can be an exhausting process. Maintaining continuity of everyday life was the norm, and dependent on a dynamic process of balancing threats and supports to people’s emotional well-being. Interactions with health care professionals were therapeutic when they provided emotional, or narrative, support. Threats arose when the patient’s perception of the professional’s account of their illness experience was at odds with the person’s own sense of their core self and what was important to them. Our findings highlight the need for a framework in which clinicians may legitimately utilize different illness models to deliver a personalized, patient-centred assessment of need and care. The work provides testable hypotheses supporting development of understanding of therapeutic impact of the consultation","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68343.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/32715\/1\/download.pdf","pdfHashValue":"12ffb71ac824144df016bc4a8cf52f4f37d9364a","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:32715<\/identifier><datestamp>\n      2018-01-24T02:59:49Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D52:5231<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Insights into the impact of clinical encounters gained from personal accounts of living with advanced cancer.<\/dc:title><dc:creator>\n        Reeve, Joanne<\/dc:creator><dc:creator>\n        Lloyd-Williams, Mari<\/dc:creator><dc:creator>\n        Payne, Sheila<\/dc:creator><dc:creator>\n        Dowrick, Christopher<\/dc:creator><dc:subject>\n        R Medicine (General)<\/dc:subject><dc:description>\n        Aim To describe the impact of interactions with health care professionals revealed by people’s accounts of living and dying with cancer; to explore reasons for the observed effects; and thus, to consider the implications for practice. Background The importance of practitioner–patient interactions is enshrined within professional values. However, our understanding of how and why the consultation impacts on outcomes remains underdeveloped. Stories recounted by people living and dying with cancer offer important insights into illness experience, including the impact of contact with health services, framed within the context of the wider social setting in which people live their lives. From our recent study of distress in primary palliative care patients, we describe how people’s accounts revealed both therapeutic and noxious effects of such encounters, and discuss reasons for the observed effects. Method A qualitative study with a purposive sample of 19 primary palliative care patients: (8 men, 11 at high risk of depression). In-depth interviews were analysed using the iterative thematic analysis described by Lieblich. Findings Living with cancer can be an exhausting process. Maintaining continuity of everyday life was the norm, and dependent on a dynamic process of balancing threats and supports to people’s emotional well-being. Interactions with health care professionals were therapeutic when they provided emotional, or narrative, support. Threats arose when the patient’s perception of the professional’s account of their illness experience was at odds with the person’s own sense of their core self and what was important to them. Our findings highlight the need for a framework in which clinicians may legitimately utilize different illness models to deliver a personalized, patient-centred assessment of need and care. The work provides testable hypotheses supporting development of understanding of therapeutic impact of the consultation.<\/dc:description><dc:date>\n        2009-10<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/32715\/1\/download.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S1463423609001121<\/dc:relation><dc:identifier>\n        Reeve, Joanne and Lloyd-Williams, Mari and Payne, Sheila and Dowrick, Christopher (2009) Insights into the impact of clinical encounters gained from personal accounts of living with advanced cancer. Primary Health Care Research and Development, 10 (4). pp. 357-367. ISSN 1463-4236<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/32715\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S1463423609001121","http:\/\/eprints.lancs.ac.uk\/32715\/"],"year":2009,"topics":["R Medicine (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Insights into the impact of clinical encounters\ngained from personal accounts of living with\nadvanced cancer\nJoanne Reeve1, Mari Lloyd-Williams2, Sheila Payne3 and Christopher Dowrick4\n1Division of Primary Care, University of Liverpool (at time of the research); current appointment: NIHR School for\nPrimary Care Research, University of Manchester, Manchester, UK\n2Academic Palliative & Supportive Care Research Group, University of Liverpool, Liverpool, UK\n3Institute for Health Research, University of Lancaster, Lancaster, UK\n4Division of Primary Care, University of Liverpool, Liverpool, UK\nAim: To describe the impact of interactions with health care professionals revealed by\npeople’s accounts of living and dying with cancer; to explore reasons for the observed\neffects; and thus, to consider the implications for practice. Background: The impor-\ntance of practitioner–patient interactions is enshrined within professional values.\nHowever, our understanding of how and why the consultation impacts on outcomes\nremains underdeveloped. Stories recounted by people living and dying with cancer\noffer important insights into illness experience, including the impact of contact with\nhealth services, framed within the context of the wider social setting in which people\nlive their lives. From our recent study of distress in primary palliative care patients, we\ndescribe how people’s accounts revealed both therapeutic and noxious effects of such\nencounters, and discuss reasons for the observed effects. Method: A qualitative study\nwith a purposive sample of 19 primary palliative care patients: (8 men, 11 at high risk\nof depression). In-depth interviews were analysed using the iterative thematic analysis\ndescribed by Lieblich. Findings: Living with cancer can be an exhausting process.\nMaintaining continuity of everyday life was the norm, and dependent on a dynamic\nprocess of balancing threats and supports to people’s emotional well-being. Interac-\ntions with health care professionals were therapeutic when they provided emotional,\nor narrative, support. Threats arose when the patient’s perception of the professional’s\naccount of their illness experience was at odds with the person’s own sense of their\ncore self and what was important to them. Our findings highlight the need for a\nframework in which clinicians may legitimately utilize different illness models to\ndeliver a personalized, patient-centred assessment of need and care. The work pro-\nvides testable hypotheses supporting development of understanding of therapeutic\nimpact of the consultation.\nKey words: doctor–patient interactions; illness narratives; palliative care\nReceived: 28 April 2008; accepted: 6 March 2009; first published online 3 June 2009\nIntroduction\nFor many years, models of good primary medical\ncare have emphasized the importance of consulta-\ntion skills and continuing relationships (Chew-\nGraham, May and Ronald, 2004; WONCA Europe,\nCorrespondence to: Dr Joanne Reeve, Post at time of work:\nClinical Research Associate, Division of Primary Care, Uni-\nversity of Liverpool. Current appointment: NIHR Clinical\nLecturer in Primary Care, NIHR School for Primary Care\nResearch, University of Manchester, Williamson Building,\nOxford Road, Manchester M13 9PL, UK. Email: joanne.\nreeve@manchester.ac.uk\nr 2009 Cambridge University Press\nPrimary Health Care Research & Development 2009; 10: 357–367\ndoi:10.1017\/S1463423609001121\n2005). Effective communication skills support\naccurate identification of problems, increased\npatient satisfaction and concordance with treat-\nment (Maguire and Pitceathly, 2002). But the\nconsultation is more than a communication tool\nto aid therapy through the correct exchange of\ninformation. Patient-centeredness, the recogni-\ntion of and response to patient perspectives\nwithin clinical encounters, improves satisfaction\n(Kearley, Freeman and Heath, 2001; McLean and\nArmstrong, 2004) and concordance (Britten et al.,\n2000; Kearley, Freeman and Heath, 2001). The\nconsultation, including the relationship between\npatient and practitioner, is itself part of the\n‘therapy’ (Hippocrates, 1923; Balint, 1955; Di\nBlasi et al., 2001).\nDespite the emphasis placed on the consultation\nwithin professional values, the evidence-base under-\npinning its use remains underdeveloped. Models of\ndoctor–patient communication as a set of skills and\nbehaviours which can be objectively observed (Saba\net al., 2006) and hence taught and learned (Salmon\nand Young, 2005), have guided development of\ntraining programmes. Yet, Saba et al. (2006) warned\nthat whilst communication can ‘look good’ if\nassessed by whether doctors utilize these skills, it\nmay still not ‘feel good’ for either patient or doctor.\nA purely skills-focused model for understanding\nand teaching consultation skills may be inadequate\nto support good clinical care (Burkitt Wright,\nHolcombe and Salmon, 2004; Salmon and Young,\n2005; Saba et al., 2006). Patient-centeredness,\nalthough valued, is not evident in many everyday\nconsultations (Freeman, Car and Hill, 2004). The\nspecific impact of ‘therapeutic relationships’ on\npatient outcomes is still not known (Di Blasi\net al., 2001). The evidence-gap perhaps arises\nsince these core values and attitudes within clin-\nical disciplines are often the hardest to define in a\nway which can be measured (Howie et al., 2000).\nMuch research into health care interactions\nfocuses on studying processes within the con-\nsultation itself. However, a consultation is a par-\nticular social interaction which occurs within the\nwider context of people’s lives; health services\nform part of the cultural context in which people\nexperience illness (Pierret, 2003). We increasingly\nrecognize the importance of learning about illness\nby listening to the stories of people who are\nexperiencing it (Greenhalgh and Hurwitz, 1998;\nLauner, 2002; Bingley et al., 2008; Thomas et al.,\n2008). These accounts have the potential to offer\ninsights into the nature and impact of interactions\nwith health care providers and settings.\nWe recently completed a study looking at the\ndisruptive impact of illness and associated distress\nthrough an analysis of the accounts told by people\nwith terminal cancer. A key finding was that most\npeople were able to successfully continue to live\ntheir everyday lives despite the significant threats\nposed by their cancer and other life events. The\nprocesses underpinning this self-management\n(Foster et al., 2007) of illness in the context of\neveryday life are summarized within the Self-\nIntegrity Model (SIM), illustrated in Figure 1\n(Reeve et al., 2009a). Continuity of daily life\n(biographical flow in Figure 1) was dependent on\nmanaging the impacts of potentially disruptive life\nevents, including terminal illness, on the ‘core-self’\n– defined as that which mattered most to people.\nThreats caused distress; including depressed mood,\nanxiety, frustration and tiredness. Maintaining\ncontinuity depended on mobilizing sufficient\nresources to balance the threats and resulting dis-\ntress. These included narrative support (creating\nand finding meaning in events) and emotional\nsupport (actions and circumstances which brought\ncomfort). Occasionally, supports were over-\nwhelmed; physical, mental and emotional exhaus-\ntion resulted in biographical fracture associated\nwith major depression (Figure 1).\nAlthough not a primary focus of the study,\npeople’s accounts of living and dying with cancer\ncommonly included references to encounters with\nhealth care professionals, especially doctors.\nThese accounts offer valuable insights into the\nimpact of interactions with professionals as\nviewed from the context of people’s everyday\nlives, rather than focusing on what occurs within\nthe consultation itself. The aim of this paper is,\ntherefore, to describe the impact of interactions\nas told by participants in this study, and to explore\nthe reasons for the observed effects.\nMethods\nOur sample consisted of 19 adult patients with\nterminal cancer living in Merseyside, UK, all of\nwhom were aware of their diagnosis. Purposive\nsampling (Silverman, 2000) selected patients from\nprimary care practices, considering age, sex, disease\n358 Joanne Reeve et al.\nPrimary Health Care Research & Development 2009; 10: 357–367\ntype, socioeconomic group and risk status on\nthe Edinburgh Depression Scale (EDS) (Lloyd-\nWilliams, Friedman and Rudd, 2000). Table 1\nsummarises the participants.\nData collection was by semi-structured inter-\nview, exploring people’s experiences before and\nsince cancer diagnosis. Most participants focused\non the time since their terminal diagnosis, thereby\ndescribing events that had happened in the pre-\nvious weeks and months. The interview schedule\nasked people how they were feeling and how that\nhad changed over time, prompting people to\nreflect on things that made them feel worse or\nbetter. There were no specific questions about\ninteractions with health professionals but, where\nappropriate, people were prompted to reflect on\nhow well others, including medical staff, under-\nstood the way they were feeling. All interviews\ntook place in individuals’ own homes, lasting\n30–150min. All were conducted by JR, who was\nintroduced to participants via the study informa-\ntion leaflet as a local general practitioner (GP)\ninterested in understanding people’s experiences\nand feelings associated with their cancer. Interviews\nwere recorded and subsequently transcribed\nverbatim. In two cases, the recording equipment\nfailed; fieldnotes covering issues from the non-\nrecorded conversations were made within one\nhour of the end of the interview.\nAll authors contributed to the initial analysis\nand coding: to confirm that common areas of text\nwere being identified as important, and to discuss\nthe interpretation of emerging ideas. JR led the\ndetailed analysis of subsequent transcripts, pre-\nparing analysis reports, which were discussed\nregularly amongst all the authors to check inter-\nnal consistency and confirmability, and external\nrelevance to existing literature.\nWe adopted Marton’s (1986) phenomeno-\ngraphic approach, which seeks to understand why\npeople experience phenomena differently; adap-\nted to include the holistic-form and holistic-\ncontent analytical methods described by Lieblich,\nTuval-Maschiach and Zilber (1998). Holistic-form\nanalysis considers the overall structure of illness\nnarrative, and was used to categorize accounts\ninto those with a continuous narrative thread\n(biographical flow, see Figure 1) and those with\nevidence of significant disruption (biographical\nfracture) (Reeve et al., 2009b). Holistic-content\nBIOGRAPHICAL FLOW: EMOTIONAL EQUILIBRIUM \nCORE \nSELF \nBALANCES THREATS\nTO CORE SELF \nPositive emotional \neffects \nNegative emotional \neffects\nBIOGRAPHICAL \nFRACTURE \nEmotional\/reflexive responses\nFigure 1 The Self-Integrity Model\nImpact of clinical encounters 359\nPrimary Health Care Research & Development 2009; 10: 357–367\nanalysis identifies and explains differences\nbetween categorical groups using an iterative,\nthematic focus on narrative content within each\ncategory. Initial coding was supported by the use\nof NVIVO version 11; codes and quotes were\nthen imported into Excel spreadsheets, allowing\ncomparisons within and between biographical\ncategories. As key themes emerged from the data\n(see Box 1), summary accounts were constructed\nfor each participant describing the identified\ncontent for each sub-theme. Analysis of these\naccounts revealed encounters with health pro-\nfessionals as examples of both threats and bal-\nances. It is these encounters that we report in this\npaper. Further details of the analysis are available\nin Reeve (2006), and from the authors.\nThe processes of sampling, data collection and\nanalysis continued until the emerging analysis\ndemonstrated coherence: that the analytical\nmodel was adequate to explain the full range of\nthe data set identified, within the constraints of\nthe research question and theoretical perspectives\n(Radnitsky, 1968; Kvale, 1996). We used Max-\nwell’s (2002) criteria for quality of knowledge\nproduction to assess the trustworthiness of our\nanalysis; including three criteria of methodologi-\ncal rigour (descriptive validity, interpretive\nvalidity and theoretical validity) and two of utility\n(generalizability and evaluative validity).\nTable 1 Showing participant characteristics\nReferencea Age range (years) Sex Tumourb EDSc score Lives alone Attends hospice\nAlbert 80s M Resp 6 N N\nRon 60s M Haemat 10 N N\nHelen 60s F GIT 16* Y N\nNora 60s F Resp 16* Y N\nMarjorie 60s F Resp 20* N Y\nJenny 70s F Resp 17* N Y\nMary$ 60s F Resp 18* Y N\nLinda 50s F Breast 17* N N\nPeter 60s M Urol 12 Y N\nJim 80s M GIT 12 Y N\nPat 60s F Resp 12 N N\nBob 40s M Resp 5 N N\nRuth 70s F GIT 7 Y N\nStuart 40s M Soft tissue ** N Y\nJoyce 80s F Breast ** N Y\nJohn 60s M Urol ** N Y\nAngela 40s F Gynae 6 N N\nMark 40s M Resp 16* N Y\nJoan 50s F Breast ** N Y\na Names given are pseudonyms.\nb GIT5gastrointestinal tract; Resp5 respiratory; Urol5urological; Haemat5haematological.\nc EDS5Edinburgh Depression Scale.\n*5high risk scores; **selected as high risk\/expressing distress by MLW.\n$ had confirmed ICD depression at time of interview.\nM5male, F5 female; N5no, Y5yes.\nBox 1 Key themes arising from the\niterative analysis\nTheme Sub themes\nCore self Being & doing\nCompetence\nFamily\nThreats Threats to:\nPhysical integrity\nPersonal integrity\nIntegrity of worldview\nResult of threats Emotional response\nReflective response\nBalances Emotional\nReflective\n360 Joanne Reeve et al.\nPrimary Health Care Research & Development 2009; 10: 357–367\nThe case studies and quotations offered in this\naccount have been selected as the best means to\nillustrate the stated themes within the constraint\nof a publication. They are representative of con-\ncepts reflected across the complete data set.\nEthical approval was granted by the Liverpool\nResearch Ethics Committee.\nResults\nAlthough all participants were receiving ongoing\nhealth care, descriptions of encounters with\nhealth care professionals – mainly doctors –\nformed only a small part of the data set gathered.\nPeople’s experiences and efforts in living with\nadvanced illness predominantly focused on\naspects of their lives outside of their health care.\nHowever, there were several examples of both\npositive and negative impacts of these encounters\non people’s stories. We describe these effects\nbefore discussing the possible reasons for them,\ndrawing on the SIM described in Figure 1.\nTherapeutic interactions: narrative and\nempathy\nRelationships were identified as a significant\nsource of support, providing opportunities for\npeople to talk and reflect, as well as emotional\ncomfort.\nIllness and dying posed significant threats to\npeople’s sense of who they were, and the nature\nof the world around them. Existential reflections\non questions such as ‘why me?’ (Helen), or ‘why\nnot someone else,’ were common.\nJim: Well the only simple way I can describe\n[it is] to say, I look at somebody that I know\nis not of the best, and I say, well, why did it\nhave to happen to me?\nMany sought meaning based on their pre-existing\nassumptions and values and their faith; occa-\nsionally doctors provided an alternative account\nor narrative support (Box 2).\nAccounts revealed the importance of these\nbeing ‘shared narratives’: a shared experience\nwith health care professionals that went beyond a\nnarrative (cognitive) construction of events to\ninclude a non-cognitive (emotional) form of\nsupport. People described the emotional support\nfrom contact with health care professionals in\nterms of being made to feel cared for, or special,\ngaining a sense of warmth or trust (Box 3).\nNon-therapeutic (noxious) interactions:\nincongruent accounts\nOther interactions were less supportive, the\neffect being more than simply dissatisfaction with\na ‘sub-optimal’ service, but revealing a noxious\nimpact on people’s efforts to maintain bio-\ngraphical flow.\nPeter was a 62-year-old man with metastatic\nprostate cancer, who lived alone and whose entire\ninterview-narrative was underpinned by his account\nof being a fell-walker. Although no longer able to\npartake in the sport, his sense of ‘being’ a fell-walker,\nand of having that recognized, was a crucial\nBox 2 Explanation and meaning identi-\nfied within interactions with health pro-\nfessionals\nJenny: ‘I’ll tell you what does worry me. I\nwent to the doctors. It sounds funny. And I\nsaid, ‘‘I think I’m getting Alzheimer’s.\nBecause my concentration’s not the same.\nAnd I’ll go into a room for somethingyand\nforget what I’ve gone in fory And she said,\n‘‘No It’s stress. Don’t you realize you’re under\nan awful lot of stress?’’ JR: ‘How did you feel\nwhen she said it was stress?’ Jenny: ‘I felt\nbetter!’\nMark: ‘The counsellor told [me I was\ndepressed. She] turned round and said,\n‘‘You’ve been referred to me because\napparently you’ve been depressed.’’ ’ JR: ‘Did\nyou agree? Did you think you were\ndepressed?’ Mark: ‘Yes. I thought. I knew I\nwasn’t right. I thought it’s not right thisy I\nwas talking to my Doctor and he told me\nabout the counsellor. And I thought – yeah, I\nsee where you’re coming from.’ JR: ‘And how\ndid you feel when [the counsellor] suggested\nthat maybe you were depressed?’ Mark:\n‘yHow did I feel? I felt depressed! [laugh]\nNo I felt elated! Not elated – that’s wrong.\nI felt a bit happier – it was depression and it\nwas getting sorted. Does that sound Irish?’\nImpact of clinical encounters 361\nPrimary Health Care Research & Development 2009; 10: 357–367\naspect of his sense of who he was. Peter described\na conversation, which took place with his oncol-\nogist where he had described his delight at his\nimproved mobility following the start of his\nZomitor injections.\nPeter: I mentioned to [my doctor] that I had\nwalked down to [place]. ‘Yes I know you\nwere a fit man,’ he said, ‘but unfortunately\nwhat you have likes bones.’ Do you know\nDr X? He was coldy He didn’t seem con-\ncerned about what I want to do or what I\nhad done. He just [gestures] out of the way,\nthat’s gone.\nPeter was clearly distressed by his doctor’s\nresponse; distress, which persisted until he died.\nThere was no indication of an unrealistic percep-\ntion that Peter thought he might fell-run again;\nonly a desire to be recognized as a fell-runner and\nhave others value his achievement. His physician’s\nfocus was only on the physical impact of the dis-\nease. It is this incongruence in perspective that was\nrevealed as the cause for Peter’s distress.\nAnother participant, Joyce, spoke of the delay\nin diagnosing her with spinal cord compression\nfrom metastatic disease. However, she was not\nconcerned with the threat to her physical health\nfrom the delayed diagnosis. Instead, she described\nher dismay at her doctor’s failure to acknowledge\nher as a competent and active woman, by\nacknowledging that her symptoms were sig-\nnificant because they were unusual for her.\nJoyce: I saw three doctors four times. And by\nthe last time I saw them, I could hardly\nwalkyMy own doctor let me down terribly I\nthink. When he knows I was a fit womany I\nwalked in on [my husband’s arm] and a stick.\nSurely to God he could have seen there was\nsomething radically wrong there. When I went\nin I didn’t sit down, I fell downy But it\nrankles with me terribly. It hurts me terribly.\nOther examples of threats were perhaps less\nstark, but nonetheless evident. Ruth visited her GP\nshortly after she had been told she had metastatic\ndisease. She felt she was managing well, but was\nsurprised when her GP offered her antidepressants.\nShe describes a sense of anxiety from her percep-\ntion of a mismatch in assessed need.\nRuth: Yes, [my GP] really was keen on the\nantidepressants. Maybe he’d had experience\nwith people with cancer who had gone really\ndown in the dumps and he was doing his best\nto sort of bring them back up to a bit of\nhappinessyJR: Were you surprised when he\nasked you [whether you needed antidepres-\nsants]? Ruth: Yes, I was actually. Because I\ndidn’t think I looked depressed. I may have\nBox 3 Emotional support from doctor–\npatient interactions\nMary: ‘It does help to talk about it with\nsomebody like you [to JR]. I’m a firm believer\nin talking to your doctors and counsellorsy\nBecause it, you feel so alone, with cancer.’\nHelen: ‘It’s very important to know that\nsomeone that’s in there is interested in mey\nAnd [my surgeon] – he’s absolutely wonderful\nthat man. He’s brilliant. When he sees you, his\nface lights up. And he goes, ‘‘I can’t get over\nyou. You look so well. You look wonderful.’’ ’\nJenny: ‘There’s just something about [the\nhospice] that makes you feel greaty They’ve\ngot a nice attitudey[They’re] so caringyYou\ndon’t want sympathy, you want a bit of\nunderstanding. Sympathy makes you more\nupset and cry. But a little bit of understanding\ngoes a long way.’\nJim: ‘I must say it’s quite a relaxed clinic with\nDr X. There seem to be two nurse\npractitionersyand they have established shall\nI say a sort of personal contact with you. And\nthey’re both experienced young ladies and\nthey really do take care of you. It makes a\nworld of difference, makes a world of\ndifference.’\nRuth: ‘In the [chest hospital] I didn’t find that\nyou got any different treatment because you\nhad canceryYou were just another body\nthere. There wasn’t that warmth there. But in\n[the oncology hospital] oh, the care is\nwonderful. The attitude of people towards\nyou. Not sympathy or namby-pamby\ntreatment. But just so nice. You feel like a\nVIP actuallyy And you were just so special\nto them. You felt you were the only one there\nthat had cancer.’\n362 Joanne Reeve et al.\nPrimary Health Care Research & Development 2009; 10: 357–367\nlooked worried though, possibly. Because\noften people say to me, ‘It may never happen.’\nYou know. But that’s my normal look. And\nmaybe that’s how I looked to him. I don’t\nknow. But I was surprised at the depression\nand I came home a few times from there\nthinking, ‘I’m not depressed.’ And I was tell-\ning myself, you know I must look really mis-\nerable when I go. And I always made sure\nthen that I smiled when I went in! [laughs] I\nalways, as soon as I saw him I’d give him a\nbig smile!\nAlthough more surprised than distressed by her\ndoctors’ repsonse, the disruptive effect is evident\nin Ruth’s ongoing reflections on the interaction,\nsuggesting a continuing need for reassurance that\nit was her doctor, and not herself, who had mis-\ninterpreted the situation.\nMary did not describe a problematic consultation\nwith her doctor. Her experiences instead revealed a\npotential threat, which might arise from the mis-\nmatch between a biomedical and personal assess-\nment of experience and need. Mary was the only\nparticipant who met ICD-10 criteria for depression\n(World Health Organization, 1992) on the day of\nher interview, as assessed using the revised Clinical\nInterview Schedule (Lewis et al., 1992) immediately\nafterwards. Yet she described herself as a strong\nwoman who had successfully dealt with a lifetime of\ndifficult situations. Whilst she was managing to cope\nwith her illness (lung cancer), she described it as a\ndifficult and draining process. When asked how she\ndealt with the way she was feeling, she replied:\nMary: I accept [the way I feel] and I try to\nfind an answer for myself. And deal with\nity I ask myself questions and if the answer\nis not what I’m looking for then it just brings\non a little bit of depression doesn’t it?.. It’s\nnot depression. It’s a quiet mode of deep\nthinking.\nIn contrast to the biomedical perspective, Mary\nviewed depression as part of ‘coping,’ and there-\nfore an integral part of her core-self.\nDiscussion\nCurrent research and clinical guidelines are con-\ncerned with the reported under detection and\ntreatment of depression in the terminally ill;\nresulting in a call for proactive screening and\npharmacological intervention (Wilson et al., 2000;\nStiefel et al., 2001; Potash and Breitbart, 2002).\nGuidance would highlight the need for Mary to\nbe informed of her diagnosis and recommended\ntreatment. Yet, we know that Ruth described\nbeing both surprised and slightly anxious when\noffered an unexpected diagnosis of depression.\nWe can speculate as to what the impact might\nhave been on Mary had someone told her she was\nsuffering from a disease, depression. Such a\ndiagnosis would have been incongruent with her\nmore productive (Gut, 1989) account of her\ndepression, which supported her sense of herself\n(her core-self) as a strong and competent woman.\nA pathological diagnosis could have threatened\nthis sense of self, leading to noxious, rather than\nthe intended therapeutic, effects. We know that\nPeter experienced significant distress when his\ndoctor’s disease-focused account conflicted with\nPeter’s own sense of who he was and what was\nimportant to him. Our analysis raises concerns\nabout the potential for a similarly negative impact\non Mary.\nThe SIM offers a framework by which the\nobserved effects of interactions with doctors may\nbe explained in terms of their impact on the\nperson’s core-self (what matters most to them)\nand their efforts to continue to live their life,\nmaintaining biographical flow. We have described\nexamples of both positive and negative impacts\narising from interactions with doctors. Therapeutic\neffects came from narrative support: offering\nexplanations, opportunities to talk (Leventhal,\nNerenz and Steele, 1984), and perhaps supporting\nthe maintenance or restoration of narrative as\ndescribed by Greenhalgh and Hurwitz (1998),\nMattingley (1998), Launer (2002) and others. But\nparticipants also described the value of emotional\nsupport through empathy, reassurance and\nwarmth. This emphasis on emotional experiences\nof illness, rather than just a narrative account of\nfinding meaning, resonates with models of clinical\npractice which emphasize the importance of the\nrelationship between patient and practitioner\n(Orlinsky, Grawe and Parks, 1994; Mercer\nand Reynolds, 2002; Burkitt Wright, Holcombe\nand Salmon, 2004). Both cognitive\/narrative, and\nemotional aspects of care are valued by patients\n(Di Blasi et al., 2001).\nImpact of clinical encounters 363\nPrimary Health Care Research & Development 2009; 10: 357–367\nNoxious effects were observed, arising when\nthere was incongruence between the patient’s\nperception of the professional’s account of illness\nand their own internal sense of themselves. May\net al. (2004) have previously highlighted concerns\nabout incongruence between doctors’ and\npatients’ accounts of sickness, arguing that future\ndevelopment of successful models of primary care\ncommunication and practice must tackle the dif-\nferences in biomedical and lay approaches to\nunderstanding illness experience. Our findings\nsuggest the need to look not only at differences in\nconceptual understanding of the illness itself, but\nto look more widely at how professional accounts\nsupport or undermine an individual’s sense of\nthemselves and the world, and hence their efforts\nto continue living their everyday lives, maintain-\ning biographical flow.\nHarrison, Moran and Wood (2002) have argued\nthat current models of quality in clinical practice\nemphasize the use of objective, externally vali-\ndated accounts of disease. This so-called scienti-\nfic–bureaucratic model of medical care promotes\nthe use of rigorously developed diagnostic tools,\nand guidelines or protocols of care in order to\ndeliver the best quality of care to patients. Models\nof quality of care value scientific knowledge\nabove other accounts given its origins in a scien-\ntific epistemology (Seale and Pattison, 1994). The\nmodel of doctor–patient interaction promoted by\nthis approach mirrors that of the ‘mining’ meta-\nphor seen in qualitative research methodology\n(Kvale, 1996). The doctor’s task is regarded as\nbeing to interpret the patient’s story to reveal the\npresence or absence of objective disease, and thus\ninstigate protocols of care.\nYet illness is recognized to be more than the\npresence or absence of disease. Other models of\ncare exist, including that of narrative medicine\n(Greenhalgh and Hurwitz, 1998; Mattingley, 1998;\nLauner, 2002) and the patient-centred, biopsycho-\nsocial model of clinical practice (Borrell-Carrio,\nSuchman and Epstein, 2004). Whilst valued\nwithin the profession, at least at a rhetorical level\n(Dowrick et al., 1996; Checkland et al., 2008), these\nalternative accounts are not reflected in current\nmeasures of quality of practice. Indeed, there is\nevidence that the emphasis on scientific–bureau-\ncratic medicine is moving practice further towards\na disease-centred, rather than a person-centred,\nfocus of care (Checkland et al., 2008).\nOur study provides evidence raising concerns that\nfailure to adequately acknowledge the individual\nwithin the interaction, that is the consultation, could\nresult not just in ‘consumer dissatisfaction,’ but in\na harmful effect resulting from the threat to an\nindividual’s core sense of what matters to them. It\nhighlights the importance of viewing the consulta-\ntion as more than a technical process of identifying\na ‘true’ diagnosis, but a social interaction with\npotential consequences for the individual beyond\nthe identification and selection of an evidence-\nbased intervention.\nStudy limitations\nAlthough our study met Maxwell’s (2002) quality\ncriteria for methodological rigour (Reeve, 2006),\nthis was a small study using a deliberately select\nsample. Generalizability of our findings, therefore,\nstems from our contribution to development of\ntheory (Doucet and Mauthner, 2002). Yet, it could\nbe questioned whether we have offered anything\nnew over and above, for example, the importance of\npersonal meaning described in the narrative medi-\ncine literature (Greenhalgh and Hurwitz, 1998;\nMattingley, 1998; Launer, 2002). We suggest that\nour findings also emphasize the emotional effects of\ninteractions and the need to understand their\nimpact on an embodied, emotional self (Williams\nand Bendelow, 1996). In addition, whilst the nar-\nrative literature focuses on the consultation itself,\nour work highlights the need to understand the\nconsultation as one element in a broader social\nsetting.\nGiven the interest in doctor–patient interac-\ntions, the impact of using a GP interviewer on\nwhat and how experience was reported must be\nconsidered. Yet people spontaneously revealed\nexamples of both positive and negative interac-\ntions, with no evidence of inhibition in doing so.\nSome participants did not appear to consciously\nacknowledge JR as a GP. Indeed, although Mary\ninitially described finding it easier to talk to JR\nbecause she was a doctor, she subsequently\nreferred to JR as ‘sweetheart,’ described speaking\nto her ‘woman to woman,’ and described speaking\nto her ‘not as a doctor now, but as a friend.’\nPerhaps the most significant limitation comes in\nknowing whether the findings can contribute to\nmeaningful change in practice. We need further\nempirical testing of the ideas emerging from this\n364 Joanne Reeve et al.\nPrimary Health Care Research & Development 2009; 10: 357–367\nstudy to establish their validity, and especially\nutility, in the care of patients.\nFuture research\nThe emotional and narrative impacts of the\nconsultation, including the impact of conceptual\nmodels of illness, may have important effects\non outcomes. The SIM may offer a theoretical\nframework within which to explain, and further\ndevelop understanding of, the therapeutic and\nnon-therapeutic nature of doctor–patient inter-\nactions. We propose that the consultation be\nviewed as a complex-intervention (Campbell\net al., 2007), and that future research focus on the\nnature and impact of this ‘therapeutic tool’ in\nsupporting living with illness, including bio-\ngraphical flow and self-management (Foster et al.,\n2007) of daily life.\nOur findings highlight the importance of the\npractitioner–patient encounter as an important\narea for future research within palliative and\nsupportive care. Research questions arising\ninclude whether congruence between doctor and\npatients’ conceptual models promotes therapeutic\ninteractions; this could be tested by detailed\nqualitative studies of consultations utilizing the\ntape-assisted recall approach (Elliott and Shapiro,\n1988). Educational approaches using reflective\nlearning (Al Sheri, 1995) could be used to assess\nclinicians’ conceptual models for understanding\npatient illness experience and their impact on\nconsultations, and hence the self-management of\nillness experience as part of on-going daily life.\nOur findings suggest the need for a framework in\nwhich clinicians may legitimately utilize different\nillness models to deliver a personalized, patient-\ncentred assessment of need and care. Whilst further\nexploratory work would strengthen the ideas pre-\nsented in this paper, we propose this should focus\non developing models of care which support both\npatient and practitioner in the process of co-\nconstructing an individualized account of illness:\none that supports, but certainly doesn’t undermine,\nindividuals’ on-going efforts to live their lives.\nAcknowledgements\nJoanne Reeve was funded by a Primary Care\nResearcher Development Award from the National\nCoordinating Centre for Research Capacity\nDevelopment (Department of Health, UK).\nReferences\nAl Sheri, A. 1995: Learning by reflection in general practice:\na study report. Education for General Practice 7, 237–48.\nBalint, M. 1955: The doctor, his patient, and the illness. Lancet\n1, 683–88.\nBingley, A., Thomas, C., Brown, J., Reeve, J. and Payne, S.\n2008: Developing narrative research in supportive and\npalliative care: the focus on illness narratives. Palliative\nMedicine 22, 653–58.\nBorrell-Carrio, F., Suchman, A.L. and Epstein, R.M. 2004: The\nbiopsychosocial model 25 years later: principles, practice\nand scientific inquiry. Annals of Family Medicine 2, 576–82.\nBritten, N., Stevenson, F., Barry, C., Barber, N. and Bradley,\nC.P. 2000: Misunderstandings in prescribing decisions in\ngeneral practice. British Medical Journal 320, 484–88.\nBurkitt Wright, E., Holcombe, C. and Salmon, P. 2004:\nDoctors’ communication of trust, care and respect in\nbreast cancer: qualitative study. British Medical Journal\n328, 864–69.\nCampbell, N.C., Murray, E., Darbyshire, J., Emery, J., Farmer,\nA., Griffiths, F., Guthrie, B., Lester, H., Wilson, P. and\nKinmonth, A.L. 2007: Designing and evaluating complex\ninterventions to improve clinical care. British Medical\nJournal 334, 455–59.\nCheckland, K., Harrison, S., McDonald, R. andGrant, S. 2008:\nBiomedicine, holism and general medical practice:\nresponses to the 2004 General Practitioner contract.\nSociology of Health & Illness 30, 788–803.\nChew-Graham, C.A., May, C.R. and Roland, M.O. 2004: The\nharmful consequences of elevating the doctor–patient\nrelationship to be a primary goal of the primary care\nconsultation. Family Practice 21, 229–31.\nDi Blasi, Z., Harkness, E., Ernst, E., Georgiou, A. and\nKleijnen, J. 2001: Influence and context effects on health\noutcomes: a systematic review. Lancet 357, 757–62.\nDoucet, A. and Mauthner, N. 2002: Knowing responsibly:\nlinking ethics, research practice and epistemology. Ch. 7. In\nMauthner, M. and Birch, M.T., editors, Ethics in qualitative\nresearch. London, UK: Sage Publications Ltd, 123–45.\nDowrick, C., May, C., Richardson, M. and Bundred, P. 1996:\nThe biopsychosocial model of General Practice: rhetoric or\nreality? British Journal of General Practice 46, 105–107.\nElliott, R. and Shapiro, D.A. 1988: Brief structured recall: a\nmore efficient method for studying significant therapy\nevents. British Journal of Medical Psychology 61, 141–53.\nFoster, C., Brown, J., Killen, M. and Brearley, S. 2007: The NCRI\ncancer experiences collaborative: defining self management.\nEuropean Journal of Oncology Nursing 11, 295–97.\nFreeman, G., Car, J. and Hill, A. 2004: The journey towards\npatient centredness. British Journal of General Practice 54,\n651–52.\nImpact of clinical encounters 365\nPrimary Health Care Research & Development 2009; 10: 357–367\nGreenhalgh, T. and Hurwitz, B. 1998: Narrative based\nmedicine. Dialogue and discourse in clinical practice.\nLondon, UK: BMJ Books.\nGut, E. 1989: Productive and unproductive depression. Success\nor failure of a vital process. London, UK: Routledge.\nHarrison, S., Moran, M. and Wood, B. 2002: Policy emergence\nand policy convergence: the case of ‘scientific–bureaucratic\nmedicine’ in the United States and United Kingdom. British\nJournal of Politics and International Relations 4, 1–24.\nHippocrates. 1923: Volume II: on decorum and the physician.\nLondon, UK: William Heinemann.\nHowie, J.G.R., Heaney, D.J., Maxwell, M., Walker, J.J. and\nFreeman, G.K. 2000: Developing a consultation quality\nindex (CQI) for use in general practice. Family Practice 17,\n455–61.\nKearley, K.E., Freeman, G.K. and Heath, A. 2001: An\nexploration of the value of the personal doctor–patient\nrelationship in general practice. British Journal of General\nPractice 51, 712–18.\nKvale, S. 1996: InterViews. An introduction to qualitative\nresearch interviewing. Thousand Oaks, CA, USA: Sage\nPublications Inc.\nLauner, J. 2002: Narrative-based primary care. A practical\nguide. Oxon, UK: Radcliffe Medical Press Ltd.\nLeventhal, H., Nerenz, D.R. and Steele, D.J. 1984: Illness\nrepresentations and coping with health threats. Ch. 9. In:\nBaum, A., Taylor, S.E. and Singer, J.E., editors, Handbook\nof psychology and health. Volume IV. Hillsdale, NJ, USA:\nErlbaum, 219–52.\nLewis, G., Pelosi, A., Araya, R. and Dunn, G. 1992: Measuring\npsychiatric disorder in the community: a standardised\nassessment for use by lay interviewers. Psychological\nMedicine 22, 465–86.\nLieblich, A., Tuval-Maschiach, R. and Zilber, T. 1998:\nNarrative research. Reading, analysis and interpretation.\nCA, USA: Sage Publications Ltd.\nLloyd-Williams, M., Friedman, T. and Rudd, N. 2000:\nCriterion validation of the Edinburgh postnatal\ndepression scale as a screening tool for depression in\npatients with advanced metastatic cancer. Journal of Pain\nand Symptom Management 20, 259–65.\nMaguire, P. and Pitceathly, C. 2002: Key communication skills\nand how to acquire them. British Medical Journal 325,\n697–700.\nMarton, F. 1986: Phenomenography – a research approach to\ninvestigating different understandings of reality. Journal of\nThought 21, 28–48.\nMattingley, C. 1998: Healing dramas and clinical plots. The\nnarrative structure of experience. Cambridge, UK:\nCambridge University Press.\nMaxwell, J. 2002: Understanding and validity in qualitative\nresearch. Ch. 2. In Huberman, A. and Miles, M., editors,\nThe qualitative researcher’s companion. Thousand Oaks,\nCA, USA: Sage Publications Ltd, 37–64.\nMay, C., Allison, G., Chapple, A., Chew-Graham, C., Dixon,\nC., Gask, L., Graham, R., Rogers, A. and Roland, M. 2004:\nFraming the doctor–patient relationship in chronic illness:\na comparative study of general practitioners’ accounts.\nSociology of Health and Illness 26, 135–58.\nMcLean, M. and Armstrong, D. 2004: Eliciting patients’\nconcerns: an RCT of different approaches by the doctor.\nBritish Journal of General Practice 54, 663–66.\nMercer, S.W. and Reynolds, W.J. 2002: Empathy and quality of\ncare. British Journal of General Practice 52, S9–13.\nOrlinsky, D.E., Grawe, K. and Parks, B.K. 1994: Process\nand outcome in psychotherapy – noch einmal. Ch. 8. In\nBergen, A.E. and Garfield, S.L., editors, Handbook of\npsychotherapy and behavioural change. NY, USA: John\nWiley and Sons Inc., 270–376.\nPierret, J. 2003: The illness experience: state of knowledge and\nperspectives for research. Sociology of Health and Illness\n25, 4–22.\nPotash, M. and Breitbart, W. 2002: Affective disorders in\nadvanced cancer. Hematology – oncology clinics of North\nAmerica 16, 671–700.\nRadnitsky, G. 1968: Contemporary schools of metascience.\nVolume II. Sweden: Berlingska Boktryckeriet Lund.\nReeve, J. 2006: Understanding distress in people with terminal\ncancer: the role of the general practitioner, Doctoral thesis.\nLiverpool, UK: Liverpool University.\nReeve, J., Lloyd-Williams, M., Payne, S. and Dowrick, C.\n2009a: Towards a re-conceptualisation of the management\nof distress in palliative care patients. Progress in Palliative\nCare 17, 51–60.\nReeve, J., Lloyd-Williams, M., Payne, S. and Dowrick, C.\n2009b: Revisiting biographical disruption: exploring\nindividual embodied illness experience in people with\nterminal cancer. Health (in press).\nSaba, G.W., Wong, S.T., Schillinger, D., Fernandez, A.,\nSomkin, C.P., Wilson, C.C. and Grumbach, K. 2006:\nShared decision making and the experience of\npartnership in primary care. Annals of Family Medicine\n4, 54–62.\nSalmon, P. and Young, B. 2005: Core assumptions and research\nopportunities in clinical communication. Patient Education\nand Counselling 58, 225–34.\nSeale, C. and Pattison, S., editors. 1994: Medical knowledge:\ndoubt and uncertainty. Buckingham, UK: The Open\nUniversity Press.\nSilverman, D. 2000: Doing qualitative research. A practical\nhandbook. London, UK: Sage Publications Ltd.\nStiefel, R., Die, T.M., Berney, A., Olarte, J.M. and Razavi, A.\n2001: Depression in palliative care: a pragmatic report\nfrom the Expert Working Group of the European\nAssociation for Palliative Care. Supportive Care in\nCancer 9, 477–88.\nThomas, C., Reeve, J., Bingley, A., Brown, J., Payne, S. and\nLynch, T. 2008: Narrative research methods in palliative care\ncontexts: two case studies. Journal of Pain and Symptom\nManagement (in press, available on-line October 2008).\nWilliams, S. and Bendelow, G. 1996: Emotions, health and\nillness: the ‘missing link’ in medical sociology? Ch. 2.\n366 Joanne Reeve et al.\nPrimary Health Care Research & Development 2009; 10: 357–367\nIn James, V. and Gabe, J., editors, Health and the sociology\nof emotions. Oxford, UK: Blackwell Publishers Ltd, 25–53.\nWilson, K., Chochinov, H.M., de Faye, B.J. and Breitbart, W.\n2000: Diagnosis and management of depression in\npalliative care. Ch. 3. In Chochinov, H.M. and Breitbart,\nW., editors, Handbook of Psychiatry in Palliative Care.\nOxford, UK: Oxford University Press, 25–49.\nWONCA Europe. 2005: The European Definition of General\nPractice\/Family Medicine. Retrieved 9 March 2009 from\nhttp:\/\/www.woncaeurope.org\/Definition%20GP-FM.htm\nWorld Health Organization. 1992: ICD-10 classification of\nmental and behavioural disorders: clinical descriptions and\ndiagnostic guidelines. Geneva, Switzerland: World Health\nOrganization.\nImpact of clinical encounters 367\nPrimary Health Care Research & Development 2009; 10: 357–367\n"}