{"doi":"10.1016\/j.jastp.2008.04.023","coreId":"69189","oai":"oai:eprints.lancs.ac.uk:28035","identifiers":["oai:eprints.lancs.ac.uk:28035","10.1016\/j.jastp.2008.04.023"],"title":"The superdense plasma sheet in the magnetosphere during high-speed-stream-driven storms: Plasma transport timescales","authors":["Denton, M.H.","Borovsky, J.E."],"enrichments":{"references":[{"id":962228,"title":"A Statistical Look at Plasmaspheric Drainage Plumes.","authors":[],"date":"2008","doi":null,"raw":"Borovsky, J.E., Denton, M.H., 2008. A Statistical Look at Plasmaspheric Drainage Plumes. Journal of Geophysical Research, in press, doi:10.1029\/2007JA012994.","cites":null},{"id":969561,"title":"as seen at geosynchronous orbit.","authors":[],"date":"1998","doi":"10.1029\/98gl00514","raw":"Thomsen, M.F., Borovsky, J.E., McComas, D.J., Elphic, R.C., Maurice, S., 1998a. Magnetospheric response to the CME passage of January 10–11, 1997, as seen at geosynchronous orbit. Geophysical Research Letters 25, 2545.","cites":null},{"id":964633,"title":"Cold-dense plasma sheet and hot-dense ions in the inner-magnetosphere.","authors":[],"date":"2002","doi":null,"raw":"Fujimoto, M., Mukai, T., Kokubun, S., 2002. Cold-dense plasma sheet and hot-dense ions in the inner-magnetosphere. Advances in Space Research 30, 2279.","cites":null},{"id":970685,"title":"Corotating solar wind streams and recurrent geomagnetic activity: a review.","authors":[],"date":"2006","doi":"10.1029\/2006JA011745","raw":"Tsurutani, B.T., et al., 2006. Corotating solar wind streams and recurrent geomagnetic activity: a review. Journal of Geophysical Research. 111, A07S01, doi:10.1029\/2005JA011273.","cites":null},{"id":970021,"title":"Delivery of cold, dense plasma sheet material into the near-Earth region.","authors":[],"date":"2003","doi":"10.1029\/2002JA009544","raw":"Thomsen, M.F., Borovsky, J.E., Skoug, R.M., Smith, C.W., 2003. Delivery of cold, dense plasma sheet material into the near-Earth region. Journal of Geophysical Research 108, 1151.","cites":null},{"id":966973,"title":"Dominant role of the asymmetric ring current in producing stormtime Dst*.","authors":[],"date":"2001","doi":null,"raw":"Liemohn, M.W., Kozyra, J.U., Thomsen, M.F., Roeder, J.L., Lu, G., Borovsky, J.E., Cayton, T.E., 2001. Dominant role of the asymmetric ring current in producing stormtime Dst*. Journal of Geophysical Research 106,10883.","cites":null},{"id":963821,"title":"Geomagnetic storms driven by ICME- and CIR-dominated solar wind.","authors":[],"date":"2006","doi":null,"raw":"Denton, M.H., Borovsky, J.E., Skoug, R.M., Thomsen, M.F., Lavraud, B., Henderson, M.G., McPherron, R.L., Zhang, J.C., Liemohn, M.W., 2006. Geomagnetic storms driven by ICME- and CIR-dominated solar wind. Journal of Geophysical Research 111, A07S07.","cites":null},{"id":965611,"title":"High speed solar wind streams and geospace interactions.","authors":[],"date":"2007","doi":null,"raw":"Kavanagh, A., Denton, M.H., 2007. High speed solar wind streams and geospace interactions. Astronomy and Geophysics 48, 6.24–6.26.","cites":null},{"id":967942,"title":"Increase of the tail plasma content during the northward interplanetary magnetic ﬁeld intervals: case studies.","authors":[],"date":"2002","doi":null,"raw":"Nishino, M.N., Terasawa, T., Hoshino, M., 2002. Increase of the tail plasma content during the northward interplanetary magnetic ﬁeld intervals: case studies. Journal of Geophysical Research 107, 1261.","cites":null},{"id":16669123,"title":"Magnetosphere preconditioning under northward IMF: evidence from the study of coronal mass ejection and corotating","authors":[],"date":"2006","doi":null,"raw":"Lavraud, B., Thomsen, M.F., Borovsky, J.E., Denton, M.H., Pulkkinen, T.I., 2006. Magnetosphere preconditioning under northward IMF: evidence from the study of coronal mass ejection and corotating ARTICLE IN PRESS M.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–1058 1057interaction region geoeffectiveness. Journal of Geophysical Research 111, A09208.","cites":null},{"id":966702,"title":"Magnetosphere preconditioning under northward IMF: evidence from the study of coronal mass ejection and corotating interaction region geoeffectiveness.","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":961672,"title":"Magnetospheric plasma analyzer for spacecraft with constrained resources.","authors":[],"date":"1993","doi":null,"raw":"Bame, S.J., McComas, D.J., Thomsen, M.F., Barraclough, B.L., Elphic, R.C., Glore, J.P., Gosling, J.T., Chavez, J.C., Evans, E.P., Wymer, F.J., 1993. Magnetospheric plasma analyzer for spacecraft with constrained resources. Review of Scientiﬁc Instruments 64, 1026.","cites":null},{"id":965112,"title":"Monitoring the polar rain over a solar cycle: a polar rain index.","authors":[],"date":"1990","doi":null,"raw":"Gussenhoven, M.S., Madden, D., 1990. Monitoring the polar rain over a solar cycle: a polar rain index. Journal of Geophysical Research 95, 10399.","cites":null},{"id":964403,"title":"Multi-point observations of cold-dense plasma sheet and its relation with tail-LLBL.","authors":[],"date":"2000","doi":null,"raw":"Fujimoto, M., Mukai, T., Matsuoka, A., Saito, Y., Hayakawa, H., Kokubun, S., Lepping, R.P., 2000. Multi-point observations of cold-dense plasma sheet and its relation with tail-LLBL. Advances in Space Research 25, 1607.","cites":null},{"id":967228,"title":"Particle precipitation during ICME-driven and CIR-driven geomagnetic storms.","authors":[],"date":"2008","doi":null,"raw":"Longden, N., Denton, M.H., Honary, F., 2008. Particle precipitation during ICME-driven and CIR-driven geomagnetic storms. Journal of Geophysical Research 113, A06205, doi:10.1029\/2007JA012752.","cites":null},{"id":965387,"title":"Potential waves for relativistic electron scattering and stochastic acceleration during magnetic storms.","authors":[],"date":"1998","doi":null,"raw":"Horne, R.B., Thorne, R.M., 1998. Potential waves for relativistic electron scattering and stochastic acceleration during magnetic storms. Geophysical Research Letters 25, 3011.","cites":null},{"id":968695,"title":"Relativistic electron pitch-angle scattering by electromagnetic ion cyclotron waves during geomagnetic storms.","authors":[],"date":"2003","doi":null,"raw":"Summers, D., Thorne, R.M., 2003. Relativistic electron pitch-angle scattering by electromagnetic ion cyclotron waves during geomagnetic storms. Journal of Geophysical Research 108, 1143.","cites":null},{"id":966134,"title":"Ring current energy input and decay.","authors":[],"date":"2003","doi":null,"raw":"Kozyra, J.U., Liemohn, M.W., 2003. Ring current energy input and decay. Space Science Reviews 109, 105.","cites":null},{"id":964152,"title":"Simulation study on fundamental properties of the storm-time ring current.","authors":[],"date":"2000","doi":null,"raw":"Ebihara, Y., Ejiri, M., 2000. Simulation study on fundamental properties of the storm-time ring current. Journal of Geophysical Research 105, 15843.","cites":null},{"id":970916,"title":"Solar source of the interplanetary sector structure.","authors":[],"date":"1967","doi":"10.1007\/BF00151368","raw":"Wilcox, J.M., Ness, N.F., 1967. Solar source of the interplanetary sector structure. Solar Physics 1, 437.","cites":null},{"id":968974,"title":"Solar wind control of density and temperature in the nearEarth plasma sheet: WIND\/GEOTAIL collaboration.","authors":[],"date":"1997","doi":null,"raw":"Terasawa, T., Fujimoto, M., Mukai, t., Shinohara, I., Saito, Y., Yamamoto, T., Machida, S., Kokubun, S., Lazarus, A.J., Steinberg, J.T., Lepping, R.P., 1997. Solar wind control of density and temperature in the nearEarth plasma sheet: WIND\/GEOTAIL collaboration. Geophysical Research Letters 24, 935.","cites":null},{"id":965851,"title":"Solar wind spatial scales in and comparisons of hourly wind and ACE plasma and magnetic ﬁeld data.","authors":[],"date":"2005","doi":null,"raw":"King, J.H., Papitashvili, N.E., 2005. Solar wind spatial scales in and comparisons of hourly wind and ACE plasma and magnetic ﬁeld data.","cites":null},{"id":967695,"title":"Statistical analysis of relativistic electron energies for cyclotron resonance with EMIC waves observed on CRRES.","authors":[],"date":"2003","doi":null,"raw":"Meredith, N.P., Thorne, R.M., Horne, R.B., Summers, D., Fraser, B.J., Anderson, R.R., 2003. Statistical analysis of relativistic electron energies for cyclotron resonance with EMIC waves observed on CRRES. Journal of Geophysical Research 108, 1250.","cites":null},{"id":963226,"title":"storm.","authors":[],"date":"1998","doi":null,"raw":"Borovsky, J.E., Thomsen, M.F., McComas, D.J., Cayton, T.E., Knipp, D.J., 1998b. Magnetospheric dynamics and mass ﬂow during the November 1993 storm. Journal of Geophysical Research 103, 26373.","cites":null},{"id":966388,"title":"Superposed epoch analysis of dense plasma access to geosynchronous orbit.","authors":[],"date":"2005","doi":null,"raw":"Lavraud, B., Denton, M.H., Thomsen, M.F., Borovsky, J.E., Friedel, R.H.W., 2005. Superposed epoch analysis of dense plasma access to geosynchronous orbit. Annales de Geophysique 23, 2519.","cites":null},{"id":963790,"title":"Superposed epoch analysis of highspeed-stream effects at geosynchronous orbit: hot plasma, cold plasma, and the solar wind.","authors":[],"date":"2008","doi":null,"raw":"Denton, M.H., Borovsky, J.E., 2008. Superposed epoch analysis of highspeed-stream effects at geosynchronous orbit: hot plasma, cold plasma, and the solar wind. Journal of Geophysical Research, in press, doi:10.1029\/2007JA012998.","cites":null},{"id":962489,"title":"The ‘‘calm before the storm’’ in CIR\/ magnetosphere interactions: occurrence statistics, solar-wind statistics, and magnetospheric preconditioning.","authors":[],"date":"2006","doi":null,"raw":"Borovsky, J.E., Steinberg, J.T., 2006. The ‘‘calm before the storm’’ in CIR\/ magnetosphere interactions: occurrence statistics, solar-wind statistics, and magnetospheric preconditioning. Journal of Geophysical Research 111, A07S10.","cites":null},{"id":961942,"title":"The differences between CME-driven storms and CIR-driven storms.","authors":[],"date":"2006","doi":null,"raw":"Borovsky, J.E., Denton, M.H., 2006. The differences between CME-driven storms and CIR-driven storms. Journal of Geophysical Research 111, A07S08.","cites":null},{"id":963051,"title":"The driving of the plasma sheet by the solar wind.","authors":[],"date":"1998","doi":null,"raw":"Borovsky, J.E., Thomsen, M.F., Elphic, R.C., 1998a. The driving of the plasma sheet by the solar wind. Journal of Geophysical Research 103, 17617.","cites":null},{"id":969729,"title":"The magnetospheric trough. In: Horwitz,","authors":[],"date":"1998","doi":"10.1029\/98gl00514","raw":"Thomsen, M.F., McComas, D.J., Borovsky, J.E., Elphic, R.C., 1998b. The magnetospheric trough. In: Horwitz, J.L., Gallagher, D.L., Peterson, W.K. (Eds.), Geospace Mass Transport and Energy Flow: Results fro the International Solar-Terrestrial Physics Program. American Geophysical Union, Washington, DC, p. 355.","cites":null},{"id":968457,"title":"The relationship between recurring cosmic ray depressions and corotating solar wind streams at","authors":[],"date":"1996","doi":null,"raw":"Richardson, I.G., Wibberenz, G., Cane, H.V., 1996. The relationship between recurring cosmic ray depressions and corotating solar wind streams at 1AU: IMP 8 and Helios 1 and 2 anticoincidence guard rate observations. Journal of Geophysical Research 101, 13483.","cites":null},{"id":967456,"title":"The solar wind and geomagnetic activity as a function of time relative to corotating interaction regions. In: Tsurutani,","authors":[],"date":"2006","doi":null,"raw":"McPherron, R.L., Weygand, J., 2006. The solar wind and geomagnetic activity as a function of time relative to corotating interaction regions. In: Tsurutani, B., McPherron, R., Gonzalez, W., Lu, G., Sobral, J.H.A., Gopalswamy, N. (Eds.), Recurrent Magnetic Storms. American Geophysical Union, Washington, DC, p. 125.","cites":null},{"id":964867,"title":"The structure of the plasma sheet under northward","authors":[],"date":"2005","doi":null,"raw":"Fujimoto, M., Mukai, T., Kokubun, S., 2005. The structure of the plasma sheet under northward IMF. In: Hoshino, M., Omura, Y., Lanzerotti, L.J. (Eds.), Frontiers in Magnetospheric Plasma Physics. Elsevier, Amsterdam, p. 19.","cites":null},{"id":962777,"title":"The superdense plasma sheet: plasmaspheric origin, solar-wind origin, or ionospheric origin?","authors":[],"date":"1997","doi":null,"raw":"Borovsky, J.E., Thomsen, M.F., McComas, D.J., 1997. The superdense plasma sheet: plasmaspheric origin, solar-wind origin, or ionospheric origin? Journal of Geophysical Research 102, 22089.","cites":null},{"id":963489,"title":"The transport of plasma sheet material from the distant tail to geosynchronous orbit.","authors":[],"date":"1998","doi":null,"raw":"Borovsky, J.E., Thomsen, M.F., Elphic, R.C., Cayton, T.E., McComas, D.J., 1998c. The transport of plasma sheet material from the distant tail to geosynchronous orbit. Journal of Geophysical Research 103, 20297.","cites":null},{"id":969264,"title":"Why Kp is such a good measure of magnetospheric convection.","authors":[],"date":"2004","doi":"10.1029\/2004SW000089","raw":"Thomsen, M.F., 2004. Why Kp is such a good measure of magnetospheric convection. Space Weather 2, S11004.","cites":null},{"id":968186,"title":"Wind observations of mixed magnetosheath-plasma sheet ions deep inside the magnetosphere.","authors":[],"date":"2000","doi":null,"raw":"Phan, T.D., Lin, R.P., Fuselier, S.A., Fujimoto, M., 2000. Wind observations of mixed magnetosheath-plasma sheet ions deep inside the magnetosphere. Journal of Geophysical Research 105, 5497.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69189.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/28035\/1\/art_969.pdf","pdfHashValue":"f3ae7fbcef39e39723ba1f8c5592c25fdb28027b","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:28035<\/identifier><datestamp>\n      2018-01-24T02:51:56Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The superdense plasma sheet in the magnetosphere during high-speed-stream-driven storms: Plasma transport timescales<\/dc:title><dc:creator>\n        Denton, M.H.<\/dc:creator><dc:creator>\n        Borovsky, J.E.<\/dc:creator><dc:date>\n        2009<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/28035\/1\/art_969.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.jastp.2008.04.023<\/dc:relation><dc:identifier>\n        Denton, M.H. and Borovsky, J.E. (2009) The superdense plasma sheet in the magnetosphere during high-speed-stream-driven storms: Plasma transport timescales. Journal of Atmospheric and Solar-Terrestrial Physics, 71. pp. 1045-1058. ISSN 1364-6826<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/28035\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.jastp.2008.04.023","http:\/\/eprints.lancs.ac.uk\/28035\/"],"year":2009,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"ARTICLE IN PRESSContents lists available at ScienceDirectJournal of\nAtmospheric and Solar-Terrestrial Physics\nJournal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–10581364-68\ndoi:10.1\n\u0002 Cor\nE-mjournal homepage: www.elsevier.com\/locate\/jastpThe superdense plasma sheet in the magnetosphere during\nhigh-speed-stream-driven storms: Plasma transport timescalesMichael H. Denton a,\u0002, Joseph E. Borovsky b\na Department of Communication Systems, Lancaster University, Lancaster, UK\nb Space Science and Applications, Los Alamos National Laboratory, Los Alamos, USAa r t i c l e i n f o\nArticle history:Accepted 18 April 2008\nThe superdense plasma sheet in the Earth’s magnetosphere is studied via a superposition\nof multispacecraft data collected during 124 high-speed-stream-driven storms. The storm\nAvailable online 18 May 2008\nKeywords:\nPlasma sheet\nSolar wind\/magnetosphere interactions\nCorotating streams\nMagnetosphere: Inner26\/$ - see front matter & 2008 Elsevier Ltd\n016\/j.jastp.2008.04.023\nresponding author. Tel.: +441524510544.\nail address: m.denton@lancaster.ac.uk (M.Ha b s t r a c t\nonsets tend to occur after the passage of the IMF sector reversal and before the passage of\nthe stream interface, and the storms continue on for days during the passage of the high-\nspeed stream. The superdense phase of the plasma sheet is found to be a common feature\nof high-speed-stream-driven storms, commencing before the onset of the storm and\npersisting for about 1 day into the storm. A separate phenomenon, the extra-hot phase of\nthe plasma sheet, commences at storm onset and persists for several days during the\nstorm. The superdense plasma sheet originates from the high-density compressed slow\nand fast solar wind of the corotating interaction region on the leading edge of the high-\nspeed stream. Tracking the motion of this dense plasma into and through the magneto-\nsphere, plasma transport times are estimated. Transport from the nightside of the dipole to\nthe dayside requires about 10h. The occurrences of both the superdense plasma sheet and\nthe extra-hot plasma sheet have broad implications for the physics of geomagnetic storms.\n& 2008 Elsevier Ltd. All rights reserved.1. Introduction\nThe superdense plasma sheet was first noticed in the\nanalysis of magnetotail and geosynchronous-orbit plasma\ndata (Borovsky et al., 1997). It was found that at times the\nEarth’s plasma-sheet density was anomalously high and\nthat those ‘‘superdense’’ intervals were statistically dis-\ntinct from the standard range of plasma-sheet densities. It\nwas later learned that the superdense plasma sheet has its\norigin in anomalously high-density solar wind (Borovsky\net al., 1998a), with the additional constraint that south-\nward IMF is necessary for the dense solar-wind plasma to\nenter the magnetosphere (Thomsen et al., 1998a).\nThe ‘‘superdense’’ plasma sheet was defined in those\nearly studies as a hot plasma-sheet plasma, to be. All rights reserved.\n. Denton).contrasted with later studies of the ‘‘cool dense plasma\nsheet’’ which fills the outer magnetosphere during ex-\ntended periods of northward IMF (e.g. Fujimoto et al.,\n2000, 2002, 2005; Phan et al., 2000; Nishino et al., 2002)\nand then is subsequently transported into the inner\nmagnetosphere when geomagnetic activity commences\n(cf. Thomsen et al., 2003; Lavraud et al., 2005), particularly\nduring high-speed-stream-driven storms preceded by\ncalms (Borovsky and Steinberg, 2006; Lavraud et al., 2006).\nIn the superposed epoch studies of Denton and\nBorovsky (2008) the superdense plasma sheet is clearly\nseen during high-speed-stream-driven storms. Further,\nthe superposed-epoch studies show that an anomalously\nhot (‘‘extra-hot’’) plasma sheet is also a feature of high-\nspeed-stream-driven storms (Denton et al., 2006; Denton\nand Borovsky, 2008).\nIn Fig. 1 the superdense plasma sheet and the extra-hot\nplasma sheet associated with high-speed-stream-driven\nstorms can be seen. The plot is a superposition of\nARTICLE IN PRESS\nFig. 1. In the top panel, for 124 high-speed-stream-driven storms the superposed-epoch average of the nightside (21–3 LT) hot-ion density (black) and\nhot-electron density (grey) is plotted as a function of the time from onset of storm. In the bottom panel, for 124 high-speed-stream-driven storms the\nsuperposed-epoch average of the hot ion temperature (black) and hot-electron temperature (grey) is plotted as a function of the time from onset of storm.\nThe superdense phase of the plasma sheet is indicated in the top panel and the extra-hot phase of the plasma sheet is indicated in the bottom panel.\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–10581046measurements taken by multiple satellites during 124\nstorms, with the zero epoch being the onset of storm\nlevels of convection (see Section 2 for details of the\ndata, the storms, and the superposition). In the top panel\nof Fig. 1 the hot-ion (0.1–45keV: black line) and hot-\nelectron (0.03–45keV: grey line) densities measured at\ngeosynchronous orbit in the nightside sector from 21 to\n3 LT are plotted. The superposed average (mean) density\nclearly shows a superdense phase that starts prior to\nstorm onset and lasts about 1 day. In the bottom panel of\nFig. 1 the ion (black) and electron (grey) temperatures are\nplotted in the 21–3 LT nightside sector. The superposed\naverage temperature shows an extra-hot plasma sheet\nthat has a rapid onset at about storm onset and that\npersists for several days.\nIn this report the superdense plasma sheet during\nhigh-speed-stream-driven storms is studied in detail\nusing superposed-epoch data analysis of solar-wind and\nmagnetospheric measurements. It will be shown that thesuperdense plasma sheet is a common occurrence during\nthe buildup and early phase of a high-speed-stream\ndriven storm. It is associated with the passage of a\ncorotating interaction region (CIR) at the leading edge of a\nhigh-speed stream, with the extra-dense magnetospheric\nplasma having its origin in the high density of the\ncompressed solar-wind plasma of the CIR. It will be\nshown that the extra-hot plasma sheet commences when\nthe storm commences and persists for days while the\nstorm ensues. Timing the onset of the superdense plasma\nsheet at various locations in the magnetosphere will\nprovide measurements of magnetospheric-convection\ntimescales.\nThe superdense plasma sheet can be important for\ngeomagnetic-storm physics. Its high density provides\nextra thermal energy with which to drive plasma waves\nin the magnetosphere that may be important for radia-\ntion-belt physics (Horne and Thorne, 1998; Summers and\nThorne, 2003; Meredith et al., 2003). Its high pressure is\nARTICLE IN PRESS\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–1058 1047associated with a diamagnetic distortion of the outer\ndipole (Borovsky et al., 1998b). And its high thermal-\nenergy content might lead to stronger proton and diffuse-\nelectron aurora, altering the properties of the stormtime\nionosphere. The extra-hot plasma sheet is important for\nspacecraft charging during high-speed-stream-driven\nstorms (Denton et al., 2006).\nThis manuscript is organized as follows. In Section 2\nthe event selection and data-analysis techniques are\nexplained. In Section 3 the properties of the superdense\nplasma sheet are explored and the relation of the super-\ndense plasma sheet to the properties of the solar wind is\nexamined. Section 4 contains observations of the super-\ndense plasma sheet used to measure mass-transport\ntimescales within the magnetosphere. In Section 5 the\nonset of the extra-hot plasma sheet is explored in relation\nto the chronology of the solar wind and the geomagnetic\nstorm. In Section 6 issues associated with the arrival of the\nsuperdense plasma sheet and the arrival of the extra-hot\nplasma sheet are discussed. The findings of this study are\nsummarized in Section 7.\n2. Data sets and event selection\nAs noted by Borovsky et al. (1998b): ‘‘in the near-Earth\nmagnetotail, the gradient- and curvature-drift effects\ndiffer for plasma-sheet ions and plasma-sheet electrons\ny as a result, the plasma sheet of the tail separates into\nan ion plasma sheet and an electron plasma sheet near the\nEarth, and the two plasma sheets have very different\nevolutions’’. At geosynchronous orbit, the ion and electron\nplasma sheets are not exactly co-located and they need\nnot have the same number density. At geosynchronous\norbit there are low-density populations of cool ions and\nelectrons that can ensure charge neutrality.\nThe ion and electron plasma sheets in the dipolar\nmagnetosphere are analysed using the multispacecraft\nMPA instruments (Bame et al., 1993), located on-board Los\nAlamos National Laboratory satellites in circular geosyn-\nchronous orbits (6.6RE) at the geographic equator. The\nMPA instruments measure three-dimensional ion and\nelectron distribution functions every 86 s over the energy\nrange \u00021eV to 45keV. Each distribution function is\nacquired in 10 s. Note that the ion temperatures measured\nby MPA are underestimates, owing to the fact that the ion\nplasma sheet contains a significant amount of ions withTable 1\nTypical chronology of a recurring-high-speed-stream cycle and the resulting ge\nThe solar wind at earth Stage of geomagnetic activity\nRarefaction\nSlow wind Calm occurs \u000270% of time\nCIR starts Calm ends\nCompressed slow wind (westward flow)\nSector reversal in compressed slow wind Geomagnetic activity rises\nCompressed slow wind with southward IMF Storm onset\nStream interface (flow reversal)\nCompressed fast wind (eastward flow) Storm levels\nCIR ends\nFast wind Activity slowly declinesenergies above the 45-keV limit of the detector (Borovsky\net al., 1998c). The 1-min OMNI database (King and\nPapitashvili, 2005) is used to obtain the properties of the\nsolar-wind plasma and the IMF at the magnetopause.\nRecurring high-speed-streams make excellent candi-\ndates for superposed-epoch studies (e.g. McPherron and\nWeygand, 2006; Denton et al., 2006; Denton and\nBorovsky, 2008; Longden et al., 2008) because there is a\nrepeating sequence of solar-wind types that pass the Earth\n(cf. Fig. 1 of Richardson et al., 1996): fast wind, rarefaction,\nslow wind, onset of CIR, compressed slow wind (westward\nflow), sector reversal within the compressed slow wind,\nstream interface, compressed fast wind (eastward flow),\nend of CIR, and again fast wind, rarefaction, etc. This\nrepeating sequence is listed in the first column of Table 1.\nThe collection of high-speed-stream-driven storms\nused for the present study (1993–2006) is the set of 124\nrecurring storms used for the Denton and Borovsky (2008)\nsuperposed epoch study. The storms were found by using\nthe McPherron list of solar-wind stream interfaces (Robert\nMcPherron, private communication, 2007; McPherron and\nWeygand, 2006), with additions based on the same\ncriteria, and then examining temporal plots of the Kp\nindex to identify storms following the stream interfaces.\nThe Kp index is used in preference to the Dst index since\nhigh-speed-stream-driven storms typically have poor Dst\nsignatures (e.g. Kavanagh and Denton, 2007) Then, for\neach storm in the collection, the onset time of convection\n(storm onset) is determined as the first drop in Midnight\nBoundary Index (MBI) (Gussenhoven and Madden, 1990)\nof40.51 latitude following the stream interface. MBI is an\nexcellent indicator of magnetospheric convection, as is Kp\n(Thomsen, 2004), but MBI has higher time resolution than\nthe 3-h Kp index. The storm onset times were determined\nto about 30-min accuracy.\n3. Properties of the superdense plasma sheet and\nrelation to the solar wind\nIn Fig. 2 superposed measurements from the magneto-\nsphere and the solar wind are shown. The zero epoch of\nthe plots is convection reaching storm levels. In the top\npanel of Fig. 2 the superposed average of the solar-wind\nspeed is shown. At the initiation of the plot the solar wind\nspeed is low (slow solar wind) and at the termination of\nthe plot the solar-wind speed is high (fast solar wind).omagnetic activity and the behaviour of the Earth’s plasma sheet\nSuperdense status Extra-hot status\nOrdinary density Ordinary temperature\nSuperdense starts\nExtra-hot plasma sheet commences\nSuperdense reaches dayside\nSuperdense ceases\nOrdinary density Extra-hot persists\nARTICLE IN PRESS\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–10581048Between the slow wind and the fast wind is a CIR where\nthe fast wind overtaking the slow wind forms a broad\nregion of compressed plasma. The CIR is a region of\nenhanced pressure and density that spans the compressedslow wind, the compressed fast wind, and the stream\ninterface in between the two.\nIn the second panel of Fig. 2 the y-component (ecliptic)\nof the solar-wind flow velocity is plotted. Owing to the\ncollision of fast and slow wind along an oblique front,\nthere are east–west perturbations to the solar-wind radial\noutflow in the CIR. The compressed slow wind is\ncharacterized by a westward flow with density, tempera-\nture, and magnetic-field strength elevated above the\npreceding slow solar wind. The stream interface is marked\nby a reversal in the east–west flow direction: it is the\ninterface between compressed slow wind and compressed\nfast wind. Following the stream interface the compressed\nfast wind is characterized by an eastward flow with a\ntemperature and field strength further elevated from the\ncompressed-slow-wind values but a density that is\ndecreased from the compressed-slow-wind values. In the\nsuperposed-epoch-averaged data of the second panel\nof Fig. 2, the stream interface occurs at an epoch time\nt ¼ +3h.\nIn the third panel of Fig. 2 the superposed-epoch\naverage of the solar-wind density is plotted as the black\ncurve for the 124 storms. Note the enhanced density of the\nsolar wind before and after the stream interface. This\nenhanced density is associated with the compression of\nthe solar-wind plasma in the CIR; the earlier portion of the\ndense solar wind is compressed slow wind and the latter\nportion is compressed fast wind. A Gaussian fit to the\nenhanced density is plotted as the grey curve in the third\npanel (see Eq. (1), Section 4 for details of the fit). The full\nwidth of the Gaussian fit is 30h. This width is consistent\nwith the width of the high-density solar-wind perturba-\ntions seen in the superposed-epoch study of McPherron\nand Weygand (2006), where the zero time of that\nsuperposition was chosen to be the solar-wind stream\ninterface.\nIn the fourth panel of Fig. 2 the superposed average of\nthe IMF component Bz (GSM) is plotted. Prior to the storm\nBz is predominantly northward (positive) and during the\nstorm Bz is predominantly southward (negative). A sector\nreversal typically lies several hours upstream of the\nstream interface (Wilcox and Ness, 1967). In the fourth\npanel, the superposed average would place the sector\nreversal at t ¼ \u00034h. Note that the Russell–McPherron\neffect prior to the sector reversal tends to produce a calm\nbefore the storm (Borovsky and Steinberg, 2006), if there\nis going to be a storm.\nIn the fifth panel of Fig. 2 the superposed average of\nthe Kp index is plotted. Prior to the storm onset theFig. 2. For a superposition of measurements from 124 high-speed-\nstream-driven storms, several quantities are plotted as a function of the\ntime since storm onset. In the top panel the solar-wind speed is plotted,\nin the second panel the y-component of the solar-wind velocity is\nplotted, in the third panel the density of the solar-wind plasma is\nplotted, in the fourth panel the z-component (GSM coordinates) of the\nsolar-wind magnetic field is plotted, in the fifth panel the Kp index of\ngeomagnetic activity is plotted, and in the bottom panel the density of\nthe ion and electron plasma sheet on the nightside of the dipole (20–3 LT\nat geosynchronous orbit) is plotted. Gaussian fits to the solar-wind\ndensity and to the ion and electron plasma-sheet densities are shown in\npanels 3 and 6.\nARTICLE IN PRESS\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–1058 1049superposed average of the geomagnetic activity is modest\nand during the storm it is significantly higher.\nIn the bottom panel of Fig. 2 the density of the hot ions\nand the hot electrons averaged on the nightside of the\nmagnetosphere from 20 to 3 LT is shown. The ion density\nis plotted as the solid black curve and the electron density\nis plotted as the solid grey curve. Prior to the storm the ion\nand electron densities are at normal levels; during the\nfirst day of the storm they are elevated to higher levels;\nand then later in the storm (the storms persist for several\ndays; Denton and Borovsky, 2008) the plasma-sheet\ndensity returns to normal levels. Gaussian fits to the\nenhanced plasma sheet density are shown as the black\n(ion) and grey (electron) dashed curves in the bottom\npanel of Fig. 2. The full widths of the Gaussian fits are\n32.6 h for the superdense ion plasma sheet and 26.2 h for\nthe superdense electron plasma sheet. These values are\nindicators of the duration of a superdense plasma sheet in\nthe nightside dipolar magnetosphere.\nA comparison of the third and sixth panels of Fig. 2\ndemonstrates the relationship between the high-density\nsolar wind and the superdense plasma sheet. The dura-\ntions of the high-density solar wind (\u000230h) and super-Fig. 3. In the top panel the superdense ion plasma sheet on the dayside (9–15\n(20–3 LT). In the bottom panel the superdense electron plasma sheet on the day\nthe nightside (20–3LT). All densities are the superposed-epoch averages of 124\ncurves.dense ion (\u000233h) and electron (\u000226h) plasma sheets\nare similar, with the superdense plasma sheet appearing\nsubsequent to the high-density solar wind. This is\nconsistent with the findings of statistical comparisons\nof solar-wind and magnetospheric measurements (e.g.\nTerasawa et al., 1997; Borovsky et al., 1998a).\nIn Fig. 3 the superdense plasma sheet on the dayside of\nthe Earth is compared with the superdense plasma sheet\non the nightside. The top panel plots the hot-ion density\nin the 20–3 LT sector of geosynchronous orbit (black solid\ncurve) and in the 9–15 LT sector (grey solid curve);\nGaussian fits to these densities are shown as the dashed\ncurves. In the bottom panel of Fig. 3 the hot-electron\ndensity in the 20–3 LT sector of geosynchronous orbit\n(black solid curve) and in the 9–15 LT sector (grey solid\ncurve), with Gaussian fits to these densities shown as the\ndashed curves. As can be seen, the superdense phase is\nweaker and arrives later on the dayside as compared with\nthe nightside. The superdense plasma sheet is particularly\nweak for electrons on the dayside (see also Section 3.2 of\nBorovsky et al., 1998b): plasma-sheet electrons are known\nto suffer strong losses in moving from the nightside to the\ndayside (Thomsen et al., 1998b).LT) is compared with the superdense ion plasma sheet on the nightside\nside (9–15 LT) is compared with the superdense electron plasma sheet on\nhigh-speed-stream-driven storms. Gaussian fits are plotted as the dashed\nARTICLE IN PRESS\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–10581050In the first column of Table 1 the chronology of the\npassage of the CIR over the Earth is listed (cf. Fig. 1 of\nRichardson et al., 1996). In the second column of Table 1\nthe resulting reaction of the Earth in terms of geomagnetic\nactivity is listed (cf. Table 1 of Borovsky and Steinberg,\n2006). As noted in the table, geomagnetic calms occur\nprior to about 70% of high-speed-stream-driven storms.\nTable 1 notes that storm levels of activity are reached\napproximately when the stream interface passes the\nEarth: the second and fifth panels of Fig. 2 indicate that\non average storm levels of activity are reached a few hours\nprior to the passage of the stream interface.Fig. 4. From the superposed-epoch-averages of the ion density (top panel) and\nfast rises in the density are plotted at the various local times. These fast rises in d\nplasma sheet. The mean epoch time of the fast rise is also labelled. Note: the choi4. Transport times in the magnetosphere\nTo study mass-transport timescales within the magne-\ntosphere, the movement of the superdense plasma sheet\nfrom the nightside to the dayside is timed in the\nsuperposed-epoch averages. Timing is analysed separately\nfor the ion plasma sheet and the electron plasma sheet.\nTwo methods are used. The first method looks at the\ntiming at various locations of a fast rise in the density of\nthe plasma sheet (similar to the single event analysed in\nBorovsky et al., 1998b mid-points of the fast rises at\nvarious local times are used to determine the timing). Theelectron density (bottom panel) measured at geosynchronous orbit, the\nensity represent the transition to superdense plasma sheet from ordinary\nce of symbols and line colour to help distinguish between each local time.\nARTICLE IN PRESS\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–1058 1051second method looks at the time shifts between Gaussian\nfits to the plasma-sheet density at various local times.\nIn the two panels of Fig. 4, the fast rises in the ion\ndensity (top panel) and electron density (bottom panel) at\nvarious local times are plotted. These fast rises in the\nnumber density represent the onset of the superdense\nplasma sheet at the various local-time locations around\nthe Earth. Each curve is the average of a local-time sector\nthat is 3 h wide. The various curves are labelled according\nto (a) the central local time of the 3-h-wide sector and\n(b) the mean epoch time of the fast rise. Note that the\nvertical and horizontal scales are the same for the two\nplots in Fig. 4. Two clear local-time trends can be seen in\nboth plots in Fig. 4: (1) the superdense plasma sheet is less\ndense on the dayside than it is on the nightside and (2) the\nsuperdense plasma sheet appears first on the nightside\nand then later on the dayside. Measuring the fast rise in\nthe solar-wind density at Earth (not shown) yields a time\nof \u00036.5 h. In the superposed averages, there is no rise in\nthe hot-electron density seen in the 12 and 15 LT sectors.\nEarly in high-speed-stream-driven storms these two local-\ntime sectors tend to be filled with broad plasmaspheric\ndrainage plumes (Borovsky and Denton, 2008; Denton\nand Borovsky, 2008) and it is known that the electron\nplasma sheet and the plasmasphere rarely interpenetrate\n(cf. Thomsen et al., 1998b).Fig. 5. The transport times for ions and electrons from local midnight to othe\nmethods used: the fast-rise method (a and b) and the Gaussian-fit method\nmeasurements for the 124 high-speed-stream-driven storms.In panels a and b of Fig. 5, the transport timescales for\nthe movement of the superdense plasma sheet around the\nEarth is summarized. Each temporal value marked in the\nsketch is the delay in time at which the superdense\nplasma sheet arrives at that location relative to the time it\narrived at local midnight. The temporal values marked in\npanel a of Fig. 5 are obtained from the top panel of Fig. 4\nand the values marked in panel b of Fig. 5 are obtained\nfrom the bottom panel of Fig. 4.\nIn panel a and b of Fig. 6 the delay in rise times from\nthe fast rise in the solar-wind density at Earth are shown.\n(The rise in the solar-wind density occurred at epoch time\nt ¼ \u00036.5 h.) Panel a pertains to the arrival of the super-\ndense ion plasma sheet relative to the rise in solar-wind\ndensity and panel b pertains to the arrival of the super-\ndense electron plasma sheet relative to the rise in the\nsolar-wind density.\nThe second method used to look at the timing of\nplasma transport is to compare Gaussian fits to the\nenhanced density of the plasma sheet at various local\ntimes and to the solar-wind density. Gaussian fits (cf.\npanels c and f of Fig. 2) of the density n as a function of\nepoch time t of the form\nn ¼ C1 þ C2 exp \u0003\nt \u0003 C3\nC4\n\u0002 \u00032\" #\nþ C5t (1)r local times around geosynchronous orbit are summarized for the two\n(c and d). Both methods use the superposed-epoch-averaged density\nARTICLE IN PRESS\nFig. 6. The transport times for ions and electrons from the solar wind (at Earth) to the various local times around geosynchronous orbit are summarized\nfor the two methods used: the fast-rise method (a and b) and the Gaussian-fit method (c and d). Both methods use the superposed-epoch-averaged\ndensity measurements for the 124 high-speed-stream-driven storms.\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–10581052are made, where C1, C2, C3, C4, and C5 are constants that are\ndetermined by a least-squares method. The constants of\ninterest are C2 (the amplitude of the density perturbation),\nC3 (the epoch time upon which the Gaussian fit is\ncentred), and C4 (the halfwidth of the Gaussian). C1 is\nthe average density of the plasma sheet before and after\nthe superdense plasma sheet and the term C5t in\nexpression (1) allows for a change in plasma sheet density\nbefore and after the superdense phase. The fits are\nperformed over the time range from \u000336 to +48h. The\nrelevant parameters for Gaussian fits to the solar wind\ndensity, to the hot-ion density at various local times at\ngeosynchronous orbit, and to the hot-electron density at\nvarious local times at geosynchronous orbit (where\navailable) are collected into Table 2.\nIn panels c and d of Figs. 5 and 6 the centre times of the\nGaussian fits are used to examine the transport times\nwithin (Fig. 5) and into and through (Fig. 6) the magneto-\nsphere. In Fig. 5 the times in the sketches are the centre\ntimes of the various Gaussian fits relative to the centre\ntime at local midnight and in Fig. 6 the times in the\nsketches are the centre times of the various Gaussian fits\nrelative to the centre time of the Gaussian fit to the solar-\nwind density.\nComparing panels a and b of Fig. 5 with panels c and d\nof Fig. 5, one can see that the two methods (tracking thefast rise in density and comparing the centres of the\nGaussian fits) yield similar values for the plasma-trans-\nport times around the Earth. The hot ions and hot\nelectrons appear first at midnight and then take 10h or\nless to reach the dayside. Electron transport to the dayside\nis chiefly along the dawnside. Ion transport to the dayside\nappears to be via both the dawn and dusk sectors. This\ndawn and dusk ion transport is consistent with the\nfindings of Denton and Borovsky (2008) that ion flows\nduring high-speed-stream-driven storms are sunward at\nabout 6km\/s in both the dawn and dusk sectors of\ngeosynchronous orbit. At 6 km\/s, transport from midnight\nto noon along the circle of geosynchronous orbit would\nrequire (1.31\u0004105 km)\/(6 km\/s) \u00026h. This 6-h estimate is\nconsistent with the values found in the present study.\nNote that the transport-time values arrived at in the\npresent study are considerably larger than values esti-\nmated using traces of (Volland-Stern) ionospheric-con-\nvection patterns (Borovsky et al., 1998c), which yielded\n4.2 h or less from transport from the magnetotail to the\ndayside neutral line, meaning less than 4.2h for transport\nfrom midnight geosynchronous to noon geosynchronous.\nComparing panels a and b of Fig. 6 with panels c and d\nof Fig. 6, one finds that the fast-rise method obtains a\nquicker estimate of the timescale for solar wind plasma to\nenter the magnetosphere and reach midnight (about 2h)\nARTICLE IN PRESS\nFig. 7. The transport times into and through the magnetosphere\nobtained by Borovsky et al. (1998a) using cross-correlation methods on\ndensity measurements is summarized. The ‘‘2 h’’ label represents the\ncentre of the magnetotail plasma sheet at X ¼ \u000320RE.\nTable 2\nParameters for Gaussian fits to the solar-wind density and the hot-ion density and hot-electron density at various local-time locations around\ngeosynchronous orbit (where available)\nFunction fit Gaussian amplitude\n(cm\u00033)\nGaussian fullwidth\n(h)\nCenter of Gaussian\n(h)\nTime from solar\nwind (h)\nTime from local\nmidnight (h)\nSolar wind\nnsw 6.5 34.2 -2.7 0\nIon plasma sheet\nni 0 LT 0.43 35.2 3.1 5.9 0\nni 3 LT 0.49 29.2 5.8 8.6 2.7\nni 6 LT 0.55 24.7 8.0 10.7 4.9\nni 9 LT 0.35 22.6 12.1 14.8 9.0\nni 12 LT 0.23 19.3 13.0 15.8 9.9\nni 15 LT 0.29 20.0 9.1 11.8 5.9\nni 18 LT 0.46 21.6 6.5 9.2 3.4\nni 21 LT 0.45 29.9 3.7 6.5 0.6\nElectron plasma sheet\nne 0 LT 0.57 30.8 6.0 8.7 0\nne 3 LT 0.69 30.1 6.9 9.6 0.9\nne 6 LT 0.71 25.6 8.6 11.3 2.6\nne 9 LT 0.44 24.8 11.3 14.0 5.3\nne 12 LT 0.12 15.7 14.6 17.3 8.6\nne 15 LT\nne 18 LT 0.34 11.8 5.7 8.5 \u00030.2\nne 21 LT 0.73 16.7 5.9 8.6 \u00030.1\nThe fits are over epoch time \u000348 to +48h.\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–1058 1053than does the Gaussian-fit method (about 6–8.5 h). The\nauthors feel that the fast-rise method is a more direct\nmethod for measuring plasma-transport times.\nIn Fig. 7 a sketch summarizing transport times from\nBorovsky et al. (1998b) is presented. Those transport times\nwere obtained by cross correlating solar-wind density\nwith magnetospheric hot-ion density, varying the time lag\nbetween the solar-wind measurements and the magneto-\nspheric measurements, and taking the time lag that yields\nthe largest linear correlation coefficient to be the trans-\nport time. The Borovsky et al. (1998a) data sets had a\nmixture of non-storm and storm times and a mixture of\nordinary plasma sheet and superdense plasma sheet, with\nthe predominance of data for non-storm and ordinary\nplasma sheet. As can be seen by comparing Fig. 7 with\nFig. 6, the transport-time values of Borovsky et al. (1998a),\nparticular those for solar wind to midnight geosynchro-\nnous and from solar wind to noon geosynchronous, are in\nthe middle of the spread in values obtained in the present\nstudy.\nThe timing of the onset and end of the superdense\nplasma sheet relative to the chronologies of the solar wind\nand the storm is summarized in the two panels of Fig. 8.\nThe top panel pertains to the results of the fast-rise\nmethod and the bottom panel pertains to the results of\nthe Gaussian-fit method. The values plotted in the top\npanel come from Fig. 4 and the values plotted in the\nbottom panel come from Table 2. In the top panel the solid\ngreen curve plots the onset time of the superdense ion\nplasma sheet as a function of the local time at geosyn-\nchronous orbit. The solid blue curve is the arrival time of\nthe superdense electron plasma sheet as a function of\nlocal time. Various times in the storm and the solar windare marked with the horizontal dashed lines. In particular,\nthe time of the fast rise in the solar-wind density is\nmarked with a red dashed line. In the top panel the\nappearance of the superdense plasma sheet first at\nmidnight and then at later times around the dipole is\nARTICLE IN PRESS\nFig. 8. The timing of the superdense plasma sheet and the extra-hot plasma sheet are summarized and compared with storm and solar-wind timing. In\nthe top panel the arrival times of the superdense ion (green) and superdense electron (red) plasma sheets and the extra-hot ion (purple) and extra-hot\nelectron (brown) plasma sheets are plotted as functions of local time. In the bottom panel the initiation, centre, and decline of the superdense ion plasma\nsheet (green curves) and the superdense electron plasma sheet (blue curves) are plotted as functions of local time. The values plotted in the top panel\ncome from Figs. 4 and 9; the values plotted in the bottom panel come from Table 2. In both panels various solar wind and storm characteristic times are\nindicated by the vertical dashed lines.\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–10581054clearly seen. This first appearance in the magnetosphere is\nafter the appearance in the solar wind (red dashed line).\nThe appearance of the superdense plasma sheet at\nmidnight is about the time of passage of the IMF sectorreversal in the solar wind; perhaps not coincidentally, this\npassage signals the onset of geomagnetic activity.\nIn the plot in the bottom panel of Fig. 8 the onset\nand disappearance of the superdense plasma sheet is\nARTICLE IN PRESS\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–1058 1055examined using the Gaussian fits to the enhanced density\n(see Table 2). This plot spans more epoch time than the plot\nin the top panel. The three solid green curves mark the\narrival, centre, and departure of the ion plasma sheet as\ndetermined by the centre time and halfwidths of the\nGaussian fits to the ion density at the various local times.\nLikewise, the three solid blue curves mark the arrival, centre,\nand departure of the electron plasma sheet as determined\nby the centre time and halfwidths of the Gaussian fits to the\nelectron density at the various local times. The three\nhorizontal red dashed lines in the bottom panel are the\narrival, centre, and departure of the high-density solar wind\nas determined from the centre time and halfwidths of theFig. 9. From the superposed-epoch-averages of the ion temperature (top panel\norbit, the fast rises in the temperatures are plotted at the various local times. Th\nsheet from plasma sheet with normal temperatures. The mean epoch time of th\nhelp distinguish between each local time.Gaussian fit to the solar-wind density. The bottom panel of\nFig. 8 also shows that the superdense plasma sheet appears\nat local midnight after it appears in the solar wind and that\nthe superdense plasma sheet spreads to other local times\nafter its appearance at midnight. And as can be seen, the\ndecline of the superdense plasma sheet also occurs after the\ndecline in the solar-wind density.\n5. Arrival of the extra-hot plasma sheet\nAs demonstrated in the top panel of Fig. 1, the ion and\nelectron plasma sheets have a superdense phase that lasts\nfor about 1 day early in a high-speed-stream-driven) and electron temperature (bottom panel) measured at geosynchronous\nese fast rises in temperature represent the transition to extra-hot plasma\ne fast rise is also labelled. Note: the choice of symbols and line colour to\nARTICLE IN PRESS\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–10581056storm. And as demonstrated in the bottom panel of\nFig. 1, the ion and electron plasma sheets have an extra-\nhot phase that lasts for several days during a high-speed-\nstream-driven storm.\nThe extra-hot electron plasma sheet is the cause of the\nhigh levels of spacecraft charging measured during high-\nspeed-stream-driven storms (Borovsky et al., 1998b;\nDenton et al., 2006). Note that the extra-hot ion plasma\nsheet provides a poor fuel for the ring current; gradient-\nand curvature-drift effects prevent the extra-hot ions from\nconvecting deep into the dipole where their pressure can\nbe amplified (e.g. Ebihara and Ejiri, 2000; Liemohn et al.,\n2001; Kozyra and Liemohn, 2003). The extra-hot nature of\nthe plasma sheet probably contributes to the fact that\nhigh-speed-stream-driven storms tend to have poor Dst\nsignatures (Borovsky and Denton, 2006; see also McPher-\nron and Weygand, 2006; Tsurutani et al., 2006).\nIn Fig. 9 the rapid transition to the extra-hot phase is\nexamined in the various 3-h-wide local-time sectors. The\ntop panel of Fig. 9 plots the transitions for the ion plasma\nsheet and the bottom panel plots the transitions for the\nelectron plasma sheet. The various curves are labelled\naccording to (a) the central local time of the sector and\n(b) the mean epoch time of the ramp. The horizontal axes\nare the same for the two plots, but the vertical axes differ:\nthe ions are much hotter (cf. Fig. 1). Both panels show the\ntrend that the extra-hot plasma sheet first appears on the\nnightside and then later appears on the dayside. As can be\nseen by comparing the two panels of Fig. 9, the transition\nto the extra-hot plasma sheet is globally more rapid for the\nelectrons, with only about a 2.5-h spread in arrival time for\nall local times. The transition to the extra-hot phase for the\nions takes about 7.5h from nightside to dayside.\nThe top panel of Fig. 8 demonstrates that the arrival of\nthe extra-hot phase is not simultaneous with the arrival of\nthe superdense phase. Here, the first appearance of the\nextra-hot ion plasma sheet (red) and extra-hot electron\nplasma sheet (purple) are plotted along with the first\nappearance of the superdense ion plasma sheet (green)\nand the superdense electron plasma sheet (brown), all as\nfunctions of local time. At the various local times, the\narrival times of superdense and the arrival times of extra-\nhot are not simultaneous. The values for these four curves\nin Fig. 8 come from Figs. 4 and 9. As can be seen, on the\nnightside of the Earth the superdense phase precedes the\nextra-hot phase. Note also that the arrival times of ion and\nelectron superdense are not simultaneous (see also\nBorovsky et al., 1997) and that the arrival times of ion\nand electron extra-hot are not simultaneous.\n6. Discussion\nIn this section, the timing of the onset of the superdense\nplasma sheet (Section 6.1) and the timing of the onset of the\nextra-hot plasma sheet (Section 6.2) are discussed.\n6.1. On the entry of superdense plasma into the\nmagnetosphere\nIn the analysis of the superposed-epoch averaged solar-\nwind and magnetospheric data using rise-time and Gaus-sian-fit methods, the transport-time values from the solar\nwind to geosynchronous midnight vary considerably, from\n2 to 8.5h (see Fig. 6). The Borovsky et al. (1998a) study,\nusing cross-correlation methods, obtained 4h for the solar\nwind to geosynchronous midnight transport (see Fig. 7).\nThese transport times represent the time lag between a\nchange in the solar-wind density and a change in the\nmagnetospheric (midnight) density. If another factor acts to\ncontrol the entry of solar-wind plasma into the magneto-\nsphere (such as whether or not the IMF is southward) then\na simple density of the solar wind comparison with the\ndensity in the magnetosphere is insufficient to measure the\ntransport time. A more-sophisticated analysis in future\nlooking at solar-wind density, magnetospheric density, and\nthe IMF should be performed to investigate the regulation\nand the transport times.\n6.2. On the rapid transition to the extra-hot plasma sheet\nOne might guess that the rapid transition to the extra-\nhot plasma sheet might be associated with a slow-solar-\nwind to fast-solar-wind transition at perhaps the stream\ninterface. This simple association is not the case. As can be\nseen in Fig. 8, the rapid transition to extra-hot plasma\nsheet occurs in the magnetosphere prior to the arrival of\nthe stream interface, at least as seen in superposed-epoch\naverages. The arrival of the extra-hot plasma sheet is more\nassociated with the onset of storm levels of magneto-\nspheric convection. At this time (epoch time ¼ 0h) the\nsolar-wind velocity is still quite low (see top panel of\nFig. 2). The extra-hot phase persists as the solar-wind\nvelocity increases and persists for days as the high-speed\nstream continues to drive activity. To ensure that the\narrival of the extra-hot plasma sheet is indeed prior to the\npassage of the stream interface a future study of the extra-\nhot plasma sheet in high-speed-stream-driven storms\nshould be performed with the zero of superposed epoch\nchosen to the solar-wind stream interface.\n7. Summary\nIn this report the superdense plasma sheet and the\nextra-hot plasma sheet were studied during high-speed-\nstream-driven storms using a superposed-epoch analysis\nof solar wind and magnetospheric measurements. The\nbasic findings of this study are the following:(1) The onset of the superdense plasma sheet in the\nmagnetosphere is prior to storm onset. The superdense\nplasma sheet first appears about the time of passage\nof the sector reversal.(2) The superdense plasma sheet arrives on the nightside\nfirst, later at dawn and dusk, and finally it arrives on the\ndayside. The transport of the ion plasma sheet from\nmidnight to the dayside appears to be via both the\ndawn and dusk sectors; the transport of the electron\nplasma sheet from midnight to the dayside appears\nto be via the dawn sector.(3) The superdense ion plasma sheet and the superdense\nelectron plasma sheet do not commence simultaneously.\nARTICLE IN PRESS\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–1058 1057At some local times the superdense ions arrive first, at\nother local times the superdense electrons arrive first.(4) The superdense plasma sheet lasts for about a day and a\nhalf. The superdense plasma sheet is a feature of the\nearly phase of a high-speed-stream-driven storm.(5) The origin of the superdense plasma sheet appears to be\nthe compressed slow and fast wind of the CIR. The onset\nand termination of the superdense plasma sheet in the\nmagnetosphere both lag the onset and termination of\nthe high-density plasma of the solar wind.(6) The extra-hot plasma sheet commences approximately\nat storm onset. This commencement is prior to the\npassage of the stream interface, which is the nominal\ninterface between slow and fast wind. Hence the\nextra-hot plasma sheet arrives prior to what is\ncommonly defined as fast wind.(7) The extra-hot ion plasma sheet and the extra-hot\nelectron plasma sheet do not commence simulta-\nneously. At some local times the extra-hot ions arrive\nfirst, at other local times the extra-hot electrons\narrive first.(8) The extra-hot plasma sheet lasts for several days during\na high-speed-stream-driven storm. The extra-hot\nphase persists, on average, for at least 4 days after\nthe onset of each storm.(9) Measured plasma-transport timescales in the mag-\nnetosphere are 7–10h for plasma to travel from the\nnightside to the dayside. These transport times agree\napproximately with plasma flow velocity measure-\nments at geosynchronous orbit. These transport\ntimes are considerably longer than transport times\ninferred from an ionospheric convection model.(10) Values obtained for the timescale for solar-wind\nplasma to enter the magnetosphere and reach geosyn-\nchronous orbit vary from 2 to 8.5h. Different methods\non the hot ions and hot electrons yield different values.\nThe timescale is ambiguous in this study.A summary of the chronology of the storm, the super-\ndense plasma sheet, and the extra-hot plasma sheet is the\nfollowing (see also Table 1). Storm onset occurs in the\ncompressed slow wind a few hours after the sector\nreversal passes the Earth and prior to the passage of the\nstream interface. The storm then persists for days. The\nsuperdense plasma sheet appears in the magnetosphere\nprior to storm onset and persists for about 1 day into the\nstorm. The extra-hot plasma sheet commences with storm\nonset and persists for several days during the storm.\nThe superdense plasma sheet may be important for\ndriving magnetospheric plasma waves, for distorting the\nouter dipole, and for producing strong proton and diffuse-\nelectron aurora. The extra-hot plasma sheet is important\nfor high levels of spacecraft charging and may be\nimportant for limiting the Dst perturbation of high-\nspeed-stream-driven storms.Acknowledgements\nWe wish to thank Bob McPherron for providing the\ninitial list of stream interfaces and Michelle Thomsen forhelpful discussions. JEB wishes to thank the Department\nof Communication Systems at Lancaster University for\ntheir hospitality. This research was supported by the NASA\nTargeted Research and Technology Program, by the NSF\nNational Space Weather Program, and by the Los Alamos\nNational Laboratory LDRD Program.\nReferences\nBame, S.J., McComas, D.J., Thomsen, M.F., Barraclough, B.L., Elphic, R.C.,\nGlore, J.P., Gosling, J.T., Chavez, J.C., Evans, E.P., Wymer, F.J., 1993.\nMagnetospheric plasma analyzer for spacecraft with constrained\nresources. Review of Scientific Instruments 64, 1026.\nBorovsky, J.E., Denton, M.H., 2006. The differences between CME-driven\nstorms and CIR-driven storms. Journal of Geophysical Research 111,\nA07S08.\nBorovsky, J.E., Denton, M.H., 2008. A Statistical Look at Plasmaspheric\nDrainage Plumes. Journal of Geophysical Research, in press,\ndoi:10.1029\/2007JA012994.\nBorovsky, J.E., Steinberg, J.T., 2006. The ‘‘calm before the storm’’ in CIR\/\nmagnetosphere interactions: occurrence statistics, solar-wind statis-\ntics, and magnetospheric preconditioning. Journal of Geophysical\nResearch 111, A07S10.\nBorovsky, J.E., Thomsen, M.F., McComas, D.J., 1997. The superdense\nplasma sheet: plasmaspheric origin, solar-wind origin, or iono-\nspheric origin? Journal of Geophysical Research 102, 22089.\nBorovsky, J.E., Thomsen, M.F., Elphic, R.C., 1998a. The driving of the\nplasma sheet by the solar wind. Journal of Geophysical Research 103,\n17617.\nBorovsky, J.E., Thomsen, M.F., McComas, D.J., Cayton, T.E., Knipp, D.J.,\n1998b. Magnetospheric dynamics and mass flow during the\nNovember 1993 storm. Journal of Geophysical Research 103, 26373.\nBorovsky, J.E., Thomsen, M.F., Elphic, R.C., Cayton, T.E., McComas, D.J.,\n1998c. The transport of plasma sheet material from the distant tail to\ngeosynchronous orbit. Journal of Geophysical Research 103, 20297.\nDenton, M.H., Borovsky, J.E., 2008. Superposed epoch analysis of high-\nspeed-stream effects at geosynchronous orbit: hot plasma, cold\nplasma, and the solar wind. Journal of Geophysical Research, in press,\ndoi:10.1029\/2007JA012998.\nDenton, M.H., Borovsky, J.E., Skoug, R.M., Thomsen, M.F., Lavraud, B.,\nHenderson, M.G., McPherron, R.L., Zhang, J.C., Liemohn, M.W., 2006.\nGeomagnetic storms driven by ICME- and CIR-dominated solar wind.\nJournal of Geophysical Research 111, A07S07.\nEbihara, Y., Ejiri, M., 2000. Simulation study on fundamental properties\nof the storm-time ring current. Journal of Geophysical Research 105,\n15843.\nFujimoto, M., Mukai, T., Matsuoka, A., Saito, Y., Hayakawa, H., Kokubun, S.,\nLepping, R.P., 2000. Multi-point observations of cold-dense plasma\nsheet and its relation with tail-LLBL. Advances in Space Research 25,\n1607.\nFujimoto, M., Mukai, T., Kokubun, S., 2002. Cold-dense plasma sheet and\nhot-dense ions in the inner-magnetosphere. Advances in Space\nResearch 30, 2279.\nFujimoto, M., Mukai, T., Kokubun, S., 2005. The structure of the plasma\nsheet under northward IMF. In: Hoshino, M., Omura, Y., Lanzerotti,\nL.J. (Eds.), Frontiers in Magnetospheric Plasma Physics. Elsevier,\nAmsterdam, p. 19.\nGussenhoven, M.S., Madden, D., 1990. Monitoring the polar rain over a\nsolar cycle: a polar rain index. Journal of Geophysical Research 95,\n10399.\nHorne, R.B., Thorne, R.M., 1998. Potential waves for relativistic electron\nscattering and stochastic acceleration during magnetic storms.\nGeophysical Research Letters 25, 3011.\nKavanagh, A., Denton, M.H., 2007. High speed solar wind streams and\ngeospace interactions. Astronomy and Geophysics 48, 6.24–6.26.\nKing, J.H., Papitashvili, N.E., 2005. Solar wind spatial scales in and\ncomparisons of hourly wind and ACE plasma and magnetic field data.\nJournal of Geophysical Research 110, 2104.\nKozyra, J.U., Liemohn, M.W., 2003. Ring current energy input and decay.\nSpace Science Reviews 109, 105.\nLavraud, B., Denton, M.H., Thomsen, M.F., Borovsky, J.E., Friedel, R.H.W.,\n2005. Superposed epoch analysis of dense plasma access to\ngeosynchronous orbit. Annales de Geophysique 23, 2519.\nLavraud, B., Thomsen, M.F., Borovsky, J.E., Denton, M.H., Pulkkinen, T.I.,\n2006. Magnetosphere preconditioning under northward IMF: evi-\ndence from the study of coronal mass ejection and corotating\nARTICLE IN PRESS\nM.H. Denton, J.E. Borovsky \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1045–10581058interaction region geoeffectiveness. Journal of Geophysical Research\n111, A09208.\nLiemohn, M.W., Kozyra, J.U., Thomsen, M.F., Roeder, J.L., Lu, G., Borovsky,\nJ.E., Cayton, T.E., 2001. Dominant role of the asymmetric ring current in\nproducing stormtime Dst*. Journal of Geophysical Research 106, 10883.\nLongden, N., Denton, M.H., Honary, F., 2008. Particle precipitation during\nICME-driven and CIR-driven geomagnetic storms. Journal of Geo-\nphysical Research 113, A06205, doi:10.1029\/2007JA012752.\nMcPherron, R.L., Weygand, J., 2006. The solar wind and geomagnetic\nactivity as a function of time relative to corotating interaction\nregions. In: Tsurutani, B., McPherron, R., Gonzalez, W., Lu, G., Sobral,\nJ.H.A., Gopalswamy, N. (Eds.), Recurrent Magnetic Storms. American\nGeophysical Union, Washington, DC, p. 125.\nMeredith, N.P., Thorne, R.M., Horne, R.B., Summers, D., Fraser, B.J.,\nAnderson, R.R., 2003. Statistical analysis of relativistic electron\nenergies for cyclotron resonance with EMIC waves observed on\nCRRES. Journal of Geophysical Research 108, 1250.\nNishino, M.N., Terasawa, T., Hoshino, M., 2002. Increase of the tail plasma\ncontent during the northward interplanetary magnetic field inter-\nvals: case studies. Journal of Geophysical Research 107, 1261.\nPhan, T.D., Lin, R.P., Fuselier, S.A., Fujimoto, M., 2000. Wind observations\nof mixed magnetosheath-plasma sheet ions deep inside the\nmagnetosphere. Journal of Geophysical Research 105, 5497.\nRichardson, I.G., Wibberenz, G., Cane, H.V., 1996. The relationship\nbetween recurring cosmic ray depressions and corotating solar wind\nstreams at 1AU: IMP 8 and Helios 1 and 2 anticoincidence guard rate\nobservations. Journal of Geophysical Research 101, 13483.Summers, D., Thorne, R.M., 2003. Relativistic electron pitch-angle\nscattering by electromagnetic ion cyclotron waves during geomag-\nnetic storms. Journal of Geophysical Research 108, 1143.\nTerasawa, T., Fujimoto, M., Mukai, t., Shinohara, I., Saito, Y., Yamamoto, T.,\nMachida, S., Kokubun, S., Lazarus, A.J., Steinberg, J.T., Lepping, R.P.,\n1997. Solar wind control of density and temperature in the near-\nEarth plasma sheet: WIND\/GEOTAIL collaboration. Geophysical\nResearch Letters 24, 935.\nThomsen, M.F., 2004. Why Kp is such a good measure of magnetospheric\nconvection. Space Weather 2, S11004.\nThomsen, M.F., Borovsky, J.E., McComas, D.J., Elphic, R.C., Maurice, S.,\n1998a. Magnetospheric response to the CME passage of January\n10–11, 1997, as seen at geosynchronous orbit. Geophysical Research\nLetters 25, 2545.\nThomsen, M.F., McComas, D.J., Borovsky, J.E., Elphic, R.C., 1998b. The\nmagnetospheric trough. In: Horwitz, J.L., Gallagher, D.L., Peterson,\nW.K. (Eds.), Geospace Mass Transport and Energy Flow: Results fro\nthe International Solar-Terrestrial Physics Program. American Geo-\nphysical Union, Washington, DC, p. 355.\nThomsen, M.F., Borovsky, J.E., Skoug, R.M., Smith, C.W., 2003. Delivery of\ncold, dense plasma sheet material into the near-Earth region. Journal\nof Geophysical Research 108, 1151.\nTsurutani, B.T., et al., 2006. Corotating solar wind streams and recurrent\ngeomagnetic activity: a review. Journal of Geophysical Research. 111,\nA07S01, doi:10.1029\/2005JA011273.\nWilcox, J.M., Ness, N.F., 1967. Solar source of the interplanetary sector\nstructure. Solar Physics 1, 437.\n"}