{"doi":"10.1007\/s10291-008-0090-3","coreId":"69548","oai":"oai:eprints.lancs.ac.uk:26212","identifiers":["oai:eprints.lancs.ac.uk:26212","10.1007\/s10291-008-0090-3"],"title":"GPS scintillation over the European arctic during the November 2004 storms","authors":["Meggs, Robert W.","Mitchell, Cathryn N.","Honary, Farideh"],"enrichments":{"references":[{"id":1014686,"title":"Commercial ionospheric scintillation monitoring receiver development and test results. In:","authors":[],"date":"1996","doi":null,"raw":"Phys Chem Earth (A) 26(6–8):613–621 Van Dierendonck AJ, Hua Q, Fenton P, John K (1996) Commercial ionospheric scintillation monitoring receiver development and test results. In: Proceedings annual technical meeting of the Institute of Navigation pp 573–582 Yeh KC, Liu CH (1982) Radio wave scintillations in the ionosphere.","cites":null},{"id":1014029,"title":"Development and use of a GPS ionospheric scintillation monitor.","authors":[],"date":"2001","doi":"10.1109\/36.921409","raw":"Beach TL, Kintner PM (2001) Development and use of a GPS ionospheric scintillation monitor. IEEE Trans Geosci Remote Sens 39(5): 918–928 Blewitt G (1990) An automatic editing algorithm for GPS data.","cites":null},{"id":1014358,"title":"Modelling the effects of ionospheric scintillation on GPS\/ satellite-based augmentation system availability. Radio Sci 38(1):1001, doi:10.1029\/2000RS002604 Crane, Robert K","authors":[],"date":"2003","doi":null,"raw":"Geophys Res Lett 17(3):199–202 Conker RS, Bakry El-Arini M, Christopher J. Hegarty, Hsiao T (2003) Modelling the effects of ionospheric scintillation on GPS\/ satellite-based augmentation system availability. Radio Sci 38(1):1001, doi:10.1029\/2000RS002604 Crane, Robert K (1977) Ionospheric scintillation. Proceedings of the IEEE 65(2): 180–199 Doherty PH, Delay SH, Valladares CE, Klobuchar JA (2000) Ionospheric scintillation effects in the equatorial and auroral regions. In: Proceedings ION GPS, 19–22 September 2000, Salt Lake City Forte B(2005) Optimum detrending of raw GPS data for scintillation measurements at auroral latitudes. J Atmos Solar-Terrestrial Phys 67(12):1100–1109 Gau Y, Li Z (1999) Cycle-slip detection and ambiguity resolution algorithms for dual frequency GPS data processing. Mar Geod 22(4):169–181 Humphreys TE, Psiaki ML, Ledvina BM, Kintner PM (2005) Performance of GPS carrier tracking loops during ionospheric scintillations. Proceedings International Ionospheric Effects Symposium 3–5 May 2005, Alexandria Kaplan ED (ed) (1996) Understanding GPS: principles and applications, 1st edn. Artech House, Boston, pp 247–251, ISBN Ledvina BM, Kintner PM, Makela JJ (2004) Temporal properties of intense GPS L1 amplitude scintillations at midlatitudes. Radio Science 39, RS1S18, doi:10.1029\/2002RS002832 Materassi M, Mitchell CN (2006) Wavelet analysis of GPS amplitude scintillation, a case study. Radio Science (in press) Mitchell CN, Spencer PSJ (2003) A three-dimensional time-dependent algorithm for ionospheric imaging using GPS. Ann Geophys 46(4):687–696 Mitchell CN, Alfonsi L, De Francesci G, Lester M, Romano V (2005) GPS TEC and scintillation measurements from the polar ionosphere during the October 2003 storm. Geophys Res Lett 32, L12S03, doi:10.1029\/2004GL021644 Morrissey TN, Shallberg KW, Van Dierendonck AJ, Nicholson MJ (2004) GPS receiver performance characterization under realistic ionospheric phase scintillation environments. Radio Sci 39 RS1S20, doi:10.1029\/2002RS002838, 2004 Skone S, Knudsen K, de Jong M (2001) Limitations in GPS receiver tracking performance under ionospheric scintillation conditions.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-03-05","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69548.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/26212\/1\/art_947.pdf","pdfHashValue":"3acb824e959d249cf39b6fbd78009343c7fd9da8","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:26212<\/identifier><datestamp>\n      2018-01-24T02:47:44Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        GPS scintillation over the European arctic during the November 2004 storms<\/dc:title><dc:creator>\n        Meggs, Robert W.<\/dc:creator><dc:creator>\n        Mitchell, Cathryn N.<\/dc:creator><dc:creator>\n        Honary, Farideh<\/dc:creator><dc:date>\n        2008-03-05<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/26212\/1\/art_947.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s10291-008-0090-3<\/dc:relation><dc:identifier>\n        Meggs, Robert W. and Mitchell, Cathryn N. and Honary, Farideh (2008) GPS scintillation over the European arctic during the November 2004 storms. GPS Solutions, 12 (4). pp. 281-287. ISSN 1080-5370<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/26212\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1007\/s10291-008-0090-3","http:\/\/eprints.lancs.ac.uk\/26212\/"],"year":2008,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"ORIGINAL ARTICLE\nGPS scintillation over the European Arctic during the November\n2004 storms\nRobert W. Meggs Æ Cathryn N. Mitchell Æ\nFarideh Honary\nReceived: 20 April 2007 \/ Accepted: 15 February 2008 \/ Published online: 5 March 2008\n\u0001 Springer-Verlag 2008\nAbstract Small-scale irregularities in the background\nelectron density of the ionosphere can cause rapid fluctu-\nations in the amplitude and phase of radio signals passing\nthrough it. These rapid fluctuations are known as scintil-\nlation and can cause a Global Positioning System (GPS)\nreceiver to lose lock on a signal. This could compromise\nthe integrity of a safety of life system based on GPS,\noperating in auroral regions. In this paper, the relationship\nbetween the loss of lock on GPS signals and ionospheric\nscintillation in auroral regions is explored. The period from\n8 to 14 November 2004 is selected for this study, as it\nincludes both geomagnetically quiet and disturbed condi-\ntions. Phase and amplitude scintillation are measured by\nGPS receivers located at three sites in Northern Scandi-\nnavia, and correlated with losses of signal lock in receivers\nat varying distances from the scintillation receivers. Local\nmulti-path effects are screened out by rejection of low-\nelevation data from the analysis. The results indicate that\nlosses of lock are more closely related to rapid fluctuations\nin the phase rather than the amplitude of the received\nsignal. This supports the idea, suggested by Humphreys\net al. (2005) (performance of GPS carrier tracking loops\nduring ionospheric scintillations. Proceedings Internationsl\nIonospheric Effects Symposium 3–5 May 2005), that a\nwide loop bandwidth may be preferred for receivers\noperating at auroral latitudes. Evidence from the Imaging\nRiometer for Ionospheric Studies (IRIS) appears to suggest\nthat, for this particular storm, precipitation of particles in\nthe D\/E regions may be the mechanism that drives the rapid\nphase fluctuations in the signal.\nKeywords Ionosphere \u0001 Scintillation \u0001 GPS\nIntroduction\nGlobal Navigation Satellite Systems (GNSS) such as the\nGlobal Positioning System (GPS), utilise the time taken for\nL-band signals transmitted by satellites to arrive at a\nreceiver. Using this time measurement and knowledge of\nthe signal velocity and the satellite-to-receiver path\nlengths, a position solution can be computed. A portion of\nthe signal path passes through the ionosphere, which is the\nionised region of the Earth’s upper atmosphere. The chief\neffect of the ionosphere, as far as the GNSS signals are\nconcerned, is to impose an unknown frequency-dependent\ntime delay upon the signal together with an equal and\nopposite carrier phase advance (Kaplan 1996). Hence an\nunknown error, proportional to the line integral of iono-\nspheric electron concentration, affects the final position\nsolution. In order to solve for this error, GPS satellites\ntransmit on two carrier frequencies. However, not all GPS\nreceivers are able to receive both carrier frequencies, and\nthus the error remains unknown for these users.\nThe electron concentration is highly variable exhibiting\nboth spatial and temporal dependencies of varying scales,\nand thus the position error due to the ionosphere also\nvaries. A GNSS receiver can only continue to measure the\npath length to a given satellite, provided it remains ‘locked’\nto that satellite. Thus, not only the accuracy of the position\nsolution can be degraded by the ionospheric delay, but the\nintegrity (i.e. availability) can also be compromised by\nR. W. Meggs (&) \u0001 C. N. Mitchell\nDepartment of Electronic and Electrical Engineering,\nUniversity of Bath, Bath BA1 7AY, UK\ne-mail: r.w.meggs@bath.ac.uk\nF. Honary\nLancaster University, Lancaster LA1 4WA, UK\n123\nGPS Solut (2008) 12:281–287\nDOI 10.1007\/s10291-008-0090-3\nrapid variations in the signal phase and amplitude. This is\nclearly unacceptable in a safety-of-life application such as\nan aircraft landing system. The focus of this work is the\nionospheric contribution to the rapid fluctuations in phase\nand amplitude, known as scintillation, in the auroral\nregions (around 67\u0002 N). These are sometimes due to\nirregularities in the electron density caused by particle\nprecipitation along with the geomagnetic field lines in\nauroral or arctic regions.\nThe phenomenon of ionospheric scintillation has been\nknown since late 1940s (Crane 1977), and following the\nlaunch of Sputnik 1 in 1957 ionospheric scintillations\nbegan to be observed using radio transmissions from arti-\nficial satellites. A considerable body of literature\naccumulated over the next 25 years, much of which is\nreviewed by Yeh and Liu (1982). In 1978, launches of the\nfirst GPS satellites began, and continuously transmitted\nranging signals with global coverage became available in\nthe early 1980s. This led to more opportunities to observe\nthe ionosphere. Further, as GPS became fully operational\nin the mid 1990s, the need arose to examine and, if pos-\nsible, quantify ionospheric scintillation effects on the GPS\nnavigation solution.\nVarious mechanisms that cause GPS receivers to lose\nlock can be identified. For example, the bandwidth of the\nreceiver tracking loop, local multipath conditions and the\npropagation characteristics of the Earth’s atmosphere can\nall affect a receiver’s ability to remain locked to the signals\nfrom the GPS satellites. The performance of GPS receiver\ntracking loops under ionospheric storm conditions has been\nexamined by Skone et al. (2001), for both codeless and\nsemi-codeless receivers. They reported that, for the most\nsevere of the high-latitude storms they examined, the\ntracking performance of the codeless receiver was signifi-\ncantly degraded, although the effect on the L1 tracking\nperformance for both types of receiver was negligible.\nBeach and Kintner (2001) describe the development of a\nGPS ionospheric scintillation monitor based on a com-\nmercially available GPS development system. Their\nreceiver is modified to measure signal strength at a sample\nrate of 50 samples per second. Conker et al. (2003) used\nmodels to estimate the instantaneous availability of single-\nfrequency GPS aircraft navigation, in both scintillation and\nnon-scintillation scenarios, over the continental United\nStates. They reported increased likelihood of loss of lock\nunder scintillation conditions, particularly in the equatorial\nregions over South America and in the polar region to the\nnorth of Canada. Ledvina et al. (2004) have shown that L-\nband scintillations can form even at mid-latitudes during\nthe main phase of a geomagnetic storm and have suggested\nthat they can also be related to velocity shear and density\ngradients within the ionosphere. GPS receiver performance\nwith respect to phase scintillation has been investigated by\nMorrissey et al. (2004). GPS scintillation over the Euro-\npean high Arctic during the ionospheric storm of October\n2003 has been examined by Mitchell et al. (2005), who\nused a GPS phase and amplitude scintillation receiver\nlocated at Ny-A˚lesund, Svalbard, Norway. The work pre-\nsented here is concerned with identifying receiver losses of\nlock that are likely to be caused by phase and amplitude\nscintillation as the signal passes through the ionosphere.\nMethod\nIn the summer 2004, three Novatel GSV4004 phase and\namplitude scintillation measuring receivers were deployed\nin Northern Scandinavia and a continuous stream of phase\nand amplitude scintillation data has since been available for\nanalysis. The scintillation receivers are each fitted with a\nhigh-precision oven-controlled oscillator, enabling them to\nsample the code and carrier phase path lengths on the L1\nand L2 carrier frequencies at a rate of 50 Hz (Van Diere-\nndonck et al. 1996). The sites chosen for the remote\nreceivers are the three mainland European Incoherent\nScatter Radar (EISCAT) sites (see Fig. 1), located at\nTromsø (69.6\u0002N 19.2\u0002E geodetic, 66.107\u0002N 103.366\u0002E\ngeomagnetic), Kiruna (67.9\u0002N 20.4\u0002E geodetic, 64.279\u0002N\n102.846\u0002E geomagnetic) and Sodankyla¨ (67.4\u0002N 26.6\u0002E\ngeodetic, 63.424\u0002N 107.249\u0002E geomagnetic). The scintil-\nlation receivers were all networked to enable routine data\ncollection at Bath.\nFour GPS receivers of the International GPS Service\n(IGS) network located in the region of the EISCAT sites\nwere also selected for this study, giving a range of base-\nlines of between 12 and 410 km to the scintillation\nreceivers. The IGS receivers selected were: ‘trom’, ‘tro1’,\n‘kiru’ and ‘soda’, and observation data for these receivers\nwas obtained in ‘RINEX’ format by FTP download from\n \n 10oE\n \n 15oE\n  20oE\n  \n25oE   30\noE   \n35oE\n \n 65oN\n \n 66oN\n \n 67oN\n \n 68oN\n \n 69oN\n \n 70oN\n \n 71oN\n \n 72oN\nTromso\nKiruna\nSodankyla\n197 km\n268 km\n390 km\nFig. 1 Map showing locations of scintillation receivers\n282 GPS Solut (2008) 12:281–287\n123\nthe Scripps Orbit and Permanent Array Center (SOPAC)\narchive at http:\/\/www.sopac.ucsd.edu.\nLosses of signal lock on all satellite to receiver paths\nand on both the L1 and L2 frequencies were then identified.\nThe RINEX format does not indicate loss-of-lock explic-\nitly, so phase-lock losses must be inferred from the\nobservation data by post processing. Several approaches to\nthis problem have been described in the literature (Blewitt\n1990; Gau and Li 1999). However, in this case, a simple\napproach was taken. Here, a time series of the geometry-\nfree (L4) carrier phase combination was formed (Skone\net al. 2001), i.e.\nL4 ¼ U1\n154\n\u0002 U2\n120\n\u0001 \u0002\nc\n10:23\nð1Þ\nwhere \/1 is the phase path on the L1 frequency, \/2 is the\nphase path on the L2 frequency, and c is the velocity of\nlight. Then, the local gradient is computed in a 10-point\nwindow based on a running median and compared to a\nthreshold value to determine the time indices of the cycle-\nslips.\nA difficulty arises in that, at low elevation angles,\nscintillation effects could be confused with local multipath.\nAn elevation mask of 35\u0002 was therefore used to reduce\nmultipath effects. The choice of a suitable cut-off angle\nmust balance the need to screen out the multipath effects\nwhilst not discarding too much of data that may be iono-\nspherically affected. A further discussion on scintillation\nand multipath can be found in Van Dierendonck et al.\n(1996).\nIn this study, we have focussed on the ionospheric storm\nperiod of November 2004, since a disturbed ionosphere is\nmore likely to produce the small-scale irregularities that\nlead to scintillation (Doherty et al. 2000). The cycle-slips in\nthe IGS receivers were counted over periods of 1, 2, 3, 4, 6\nand 8 h. These were then correlated with the maximum\nphase (sigma–phi) and amplitude (S4) scintillation mea-\nsured by the scintillation receivers at the EISCAT sites.\nThe scintillation indices, sigma–phi and S4, are defined in\nterms of the standard deviation of the signal phase or signal\npower, usually measured over 1 min (Forte 2005). Two\nsets of measurements were made: one set for short base-\nlines (in the order of 10–20 km) the other set for long\nbaselines (in the order of 200–400 km). In this way it is\nhoped to be able to estimate the temporal and spatial dis-\ntribution of the scintillation effects.\nResults\nIn this section, the results for 8 days covering the actual\nstorm, that is from 7 to 14 November 2004 inclusive, are\npresented. During this period, the Kp index in the daytime\nwas around 2, but reached a maximum of about eight\nbetween 8 and 11 November. The Kp index is obtained\nfrom a number of mid-latitude magnetometer stations, and\nquantifies geomagnetic activity on a scale from 0 (low) to 9\n(high). In Fig. 2, the upper plot shows the 3-hourly Kp\nindices (obtained from the World Data Centre,\nhttp:\/\/www.wdc.rl.ac.uk) over the period of interest. The\nlower plot shows the number of cycle-slips recorded every\nhour at the ‘soda’ IGS receiver, subject to a 35\u0002 elevation\nmask. A 12 h moving average of the number of cycle-slips\nper hour was computed and has been plotted on the cycle-\nslip count. It can be clearly seen that the number of cycle-\nslips increases with the intensity of the storm. Up to 16\ncycle-slips were recorded every hour (on all receiver to\nsatellite paths) for each of the IGS receivers. The hourly\ncycle-slip counts for all the IGS receivers were compared\nagainst the Kp indices, and were found to vary in a similar\nmanner. This gives confidence that the cycle-slips that we\nhave counted here are indeed driven by disturbances on the\nionospheric propagation path and not due to local causes.\nThe DST index, which is an index of geomagnetic activity\nobtained from magnetometer stations near the equator, has\nalso been plotted on the upper plot as a further indicator of\nactivity during the storm period.\nThe number of cycle-slips on all receiver-to-satellite\npaths, and both GPS carrier frequencies, were then counted\nfor each of the five IGS receivers. These counts were made\nover time windows of 1, 2, 3, 4, 6 and 8 h. The phase and\namplitude scintillation indices, sigma–phi and S4, were\nmeasured by the three scintillation receivers at the Tromsø,\nKiruna and Sodankyla¨ sites, and their maximum values\nwere binned over the same time windows as the cycle-slip\ncounts. In this work, we are interested in how the number\nof cycle-slips correlates with scintillation on various\n07\/11 08\/11 09\/11 10\/11 11\/11 12\/11 13\/11 14\/11 15\/11\n0\n3\n6\n9\nK\np \nin\nde\nx\nDate\n3−hourly Kp and daily DST (storm) indices − Nov. 2004 storm\n−300\n−200\n−100\n0\nD\nST\n in\nde\nx\n07\/11 08\/11 09\/11 10\/11 11\/11 12\/11 13\/11 14\/11 15\/11\n0\n5\n10\n15\nDate\nco\nu\nn\nt\nNumber of cycle slips per hour − soda\nFig. 2 Geomagnetic conditions and cycle-slip count for the period of\n7–15 November 2004. The upper plot shows the 3-hourly Kp and\ndaily DST indices. The lower plot shows the number of cycle-slips\nper hour, with a 12 h moving average\nGPS Solut (2008) 12:281–287 283\n123\nbaselines. First, we will consider short baselines of about\n10–20 km. The baselines of interest are shown in Table 1.\nFor each time window and each baseline, a time series\nof the number of cycle-slips in the IGS receiver data was\nformed and compared with a similar time series of maxi-\nmum sigma–phi. In every case, a visual examination\nrevealed that there appeared to be a correlation between the\nnumber of cycle-slips and sigma–phi on all timescales\ngreater than 1 h. To quantify the relationship between\ncycle-slips and sigma–phi, the correlation coefficients were\ncomputed. Figure 3 (left side) shows the correlation coef-\nficients for each baseline. For all the short baselines, the\ncorrelation coefficient can be seen to range from between\n0.45 and 0.5 in the 1 h window, to between 0.7 and 0.8 in\nthe 8 h window. For the 3 h time window and above, the\ncorrelation index increases more gradually than is the case\nfor the shorter time windows. This suggests that, for short\nbaselines, high values of sigma–phi measured at one\nlocation may be a good indication that a receiver at another\nlocation will lose lock on the GPS signal. The indication\nwould be improved by taking the number of cycle-slips\nover the preceding 3 to 8 h. Also, it can be seen that ‘trom’\nand ‘tro1’ are very closely correlated throughout. This is to\nbe expected as these two IGS receivers are of the same\ntype, and are very close to each other (about 200 m apart).\nThe correlation between number of cycle-slips and\namplitude scintillation (S4) was also computed, and the\ncorrelation coefficients plotted in Fig. 3 (right side). Here,\nlittle correlation is observed between the number of cycle-\nslips and the S4 index measured at the nearby scintillation\nreceiver, in all time windows.\nWe will now consider the cycle-slip\/scintillation corre-\nlations on baselines in the order of 200–400 km. The six\nbaselines considered are listed in Table 2. Since the cor-\nrelation between ‘trom’ and ‘tro1’ was found to be very\nclose in the short baseline case, and they are separated by\nabout 200 m, it is convenient to regard these as one\nreceiver.\nHere we again use the number of cycle-slips over peri-\nods of 1, 2, 3, 4, 6 and 8 h, then find the maximum sigma–\nphi and S4 in each of those periods. Time-series plots for\nthe cycle-slip counts and the max sigma–phi were com-\npared in the same way as for the short baselines. Again, a\ngood correlation with the number of cycle-slips was\napparent at all timescales in the sigma–phi data, particu-\nlarly at 3 h or more where the correlation coefficients range\nfrom over 0.5 to about 0.85. As expected, the correlation\nwith S4 was less good, ranging from almost zero to just less\nthan 0.4 at all time scales. Quantifying these relationships,\nwe obtain the two plots in Fig. 4. The left-hand plot shows\nthe correlation with sigma–phi, which is quite good at 3 h\nand greater. Below 3 h the correlation drops off to between\n0.4 and 0.5. The best correlation appears to be associated\nwith the shortest baselines, i.e. Kiruna to trom\/tro1\n(210 km), so there would appear to be an underlying cor-\nrelation between the baseline length and the cycle-slip\/\nsigma–phi correlation. In the right-hand plot, the cycle-slip\ncounts show little correlation with S4 (amplitude scintil-\nlation). This is probably due the lack of any large values of\namplitude scintillation.\nThe spatial correlation of the number of cycle-slips with\nscintillation clearly depends on the size of the disturbing\nstructures. Maps of vertical TEC, corrected for satellite and\nreceiver biases, were constructed for each hour using the\nMIDAS algorithm Mitchell and Spencer (2003). An\nexample is presented in Fig. 5, which shows the vertical\nTEC at 02.00 UT on 8 November 2004.\nIn Fig. 6, the upper plots show data from four beams of\nthe Imaging Riometer for Ionospheric Studies (IRIS), sit-\nuated at Kilpisja¨rvi, Finland (69.05\u0002N 20.79\u0002E geodetic,\n65.853\u0002N 104.301\u0002E geomagnetic). IRIS uses a phased-\narray antenna with 49 beams to measure absorption at\n38.2 MHz. The beams that are directed over Tromsø to the\nwest are beams 9, 16, 23 and 24, all of which show similar\nTable 1 Short baselines\nBaseline Length\n(km)\nTromso-trom\/tro1 14\nKiruna-kiru 22\nSodankyla-soda 12\n1 2 3 4 6 8\n0\n0.2\n0.4\n0.6\n0.8\n1\nsigma−phi vs. cycle−slip count\nTime window − hours\nCo\nrre\nla\ntio\nn \nin\nde\nx \n− \nR\n1 2 3 4 6 8\n0\n0.2\n0.4\n0.6\n0.8\n1\nS4 vs. cycle−slip count\nTime window − hours\nCo\nrre\nla\ntio\nn \nin\nde\nx \n− \nR Tro − trom (14 km)\nTro − tro1 (14 km)\nKir − kiru (22 km)\nSod − soda (12 km)\nFig. 3 Short baseline\ncorrelation of the number of\ncycle-slips in the GIS receivers\nwith sigma–phi (left) and S4\n(right) measured by the\nscintillation receivers at the\nEISCAT sites\n284 GPS Solut (2008) 12:281–287\n123\npatterns. In the lower plot the sigma–phi scintillation index\nhas been binned by the hour for the same day (8 Novem-\nber). It can be seen that the absorption of the 38.2 MHz\nsignal approximately coincides with peaks of GPS phase\nscintillation. This suggests that, in the November 2004\nstorm, the scintillation mechanism is driven by the pre-\ncipitation of particles that have passed through the F-region\nand into the D- and E-regions. This is in contrast to the\nOctober 2003 storm, described by Mitchell et al. (2005), in\nwhich the scintillation was driven by polar convection\nbringing plasma from the dayside over North America over\nthe pole to the European night side. It is also interesting to\nnote that only beam 24 displays evidence of scintillation\nbetween 20.00 and 22.00 UT. This is due to the fact that\nCassiopeia, an intense celestial radio source, is within the\nfield of view of this beam and therefore amplitude scin-\ntillation can be observed.\nSummary and conclusions\nAn investigation into the relationship between loss of sig-\nnal lock on GNSS receivers located in Northern\nScandinavia and ionospheric scintillation during the\nNovember 2004 storm has been presented in this paper.\nPhase and amplitude scintillations were measured at three\nsites in Northern Scandinavia. Four fixed GPS receivers\nlocated near to each of the scintillation receivers were\nselected from the IGS network. The observation data for\nthe IGS receivers were obtained from the SOPAC archive\nfor a period from 7 to 14 November 2004. Losses of phase\nlock (‘cycle-slips’) were then identified in the observation\ndata for these receivers and correlated with phase and\namplitude scintillation over a range of timescales and\nbaselines.\nIt was found that the number of cycle-slips noted in the\nIGS receivers correlated quite well with sigma–phi mea-\nsured by the scintillation receivers up to about 20 km\naway. This is particularly true for timescales in the range of\n3–8 h, in which correlations in the range of 0.6–0.8 were\nnoted. Similarly, on long baselines (200–400 km) the\ncorrelation was good in the 3 to 8 h range (about 0.5–0.85),\nthough more variable than in the case of the short base-\nlines. This suggests that sigma–phi may be a good predictor\nfor loss of lock in receivers within a radius of about 20–\n100 km of a scintillation measuring receiver.\nThe correlation with amplitude scintillation (S4) was\nfound to be low at all timescales and on all baselines. This\nwas probably due to the very low values of S4 typically\nobserved at auroral latitudes; a view supported by Doherty\net al. (2000) and Humphreys et al. (2005). However, it\nshould be remembered that S4 is usually calculated over\n1 min (Forte 2005). Short but deep fades of less than 1 min\nduration have nevertheless been observed in the auroral\nTable 2 Long baselines\nBaseline Length\n(km)\nTromsø–kiru 205\nTromsø–soda 379\nKiruna–trom\/tro1 210\nKiruna–soda 257\nSodankyla–trom\/tro1 405\nSodankyla–kiru 247\n1 2 3 4 6 80\n0.2\n0.4\n0.6\n0.8\n1\nsigma−phi vs. cycle−slip count\nTime window − hours\nCo\nrre\nla\ntio\nn \nin\nde\nx \n− \nR\n1 2 3 4 6 80\n0.2\n0.4\n0.6\n0.8\n1\nS4 vs. cycle−slip count\nTime window − hours\nCo\nrre\nla\ntio\nn \nin\nde\nx \n− \nR\nTro − kiru (205 km)\nTro − soda (379 km)\nKir − trom (210 km)\nKir − tro1 (210 km)\nKir − soda (257 km)\nSod − trom (405 km)\nSod − tro1 (405 km)\nSod − kiru (247 km)\nFig. 4 Long baseline\ncorrelation of the number of\ncycle-slips in the GIS receivers\nwith sigma–phi (left) and S4\n(right) measured by the\nscintillation receivers at the\nEISCAT sites\nFig. 5 Example of a vertical TEC map for 8 November 2004\n02.00 UT\nGPS Solut (2008) 12:281–287 285\n123\nregion. Such fades, whilst not significantly increasing the\nmeasured S4 index, may nevertheless cause a receiver to\nlose lock. A case study of a short (sub-minute) but deep\nfade has been presented by Materassi and Mitchell (2006),\nwho used wavelet techniques in their analysis.\nOur data show that phase scintillation was much more\nprevalent than amplitude scintillation during the November\n2004 storm. Humphreys et al. (2005) argue that a narrow\npassband in the receiver tracking loop (say, of about 3–\n5 Hz) would be unable to maintain signal lock in the\npresence of these rapid phase variations, and that a higher\nbandwidth receiver would probably perform better at high\nlatitudes. Our data confirm that this is the case, and it\nwould be interesting to find the optimal bandwidth for high\nlatitudes with a more comprehensive study in the future.\nAbsorption data at 38.2 MHz were also obtained for 8\nNovember from the IRIS riometer at Kilpisja¨rvi, Finland. It\nwas found that the variations in absorption approximately\ncoincided with the variations in maximum phase scintil-\nlation, leading to the conjecture that the scintillation\nmechanism in this storm was driven by precipitation of\nparticles at D- and E-region altitudes (80–100 km).\nAcknowledgments This work is funded by the UK Engineering and\nPhysical Sciences Research Council (EPSRC). We are grateful to the\nInternational GNSS Service (IGS) for the use of GPS data. We also\nwish to thank the EISCAT Scientific Association for their support.\nEISCAT is an International Association supported by Finland (SA),\nFrance (CNRS), Germany (MPG), Japan (NIPR), Norway (NFR),\nSweden (NFR) and the United Kingdom (PPARC). The riometer data\noriginated from the Imaging Riometer for Ionospheric Studies (IRIS),\n00:00 03:00 06:00 09:00 12:00 15:00 18:00 21:00 00:00\n0\n2\n4\n6\nAbsorption (beam 9) 8−Nov−2004\nKilpisjarvi, Finland (69.05N, 20.79E)\nTime (hours) UTC\ndB\n a\nt 3\n8.\n2 \nM\nH\nz\n00:00 03:00 06:00 09:00 12:00 15:00 18:00 21:00 00:00\n0\n2\n4\n6\nAbsorption (beam 16) 8−Nov−2004\nKilpisjarvi, Finland (69.05N, 20.79E)\nTime (hours) UTC\ndB\n a\nt 3\n8.\n2 \nM\nH\nz\n00:00 03:00 06:00 09:00 12:00 15:00 18:00 21:00 00:00\n0\n2\n4\n6\nAbsorption (beam 23) 8−Nov−2004\nKilpisjarvi, Finland (69.05N, 20.79E)\nTime (hours) UTC\ndB\n a\nt 3\n8.\n2 \nM\nH\nz\n00:00 03:00 06:00 09:00 12:00 15:00 18:00 21:00 00:00\n0\n2\n4\n6\nAbsorption (beam 24) 8−Nov−2004\nKilpisjarvi, Finland (69.05N, 20.79E)\nTime (hours) UTC\ndB\n a\nt 3\n8.\n2 \nM\nH\nz\n00:00 03:00 06:00 09:00 12:00 15:00 18:00 21:00 00:00\n0\n1\n2\n3\nMaximum hourly phase scintillation 8−Nov−2004\nTromso, Norway (69.59N, 19.23E)\nTime (hours) UTC\nra\ndi\nan\ns\nFig. 6 Absorption at 38.2 MHz\nmeasured by the ’IRIS’ riometer\nat Kilpisjarvi, Finland (upper),\nand hourly maximum phase\nscintillation measured at\nTromsø (lower)\n286 GPS Solut (2008) 12:281–287\n123\noperated by the Department of Communications Systems at Lancaster\nUniversity (UK) in collaboration with the Sodankyla¨ Geophysical\nObservatory, and funded by the Particle Physics and Astronomy\nResearch Council (PPARC).\nReferences\nBeach TL, Kintner PM (2001) Development and use of a GPS\nionospheric scintillation monitor. IEEE Trans Geosci Remote\nSens 39(5): 918–928\nBlewitt G (1990) An automatic editing algorithm for GPS data.\nGeophys Res Lett 17(3):199–202\nConker RS, Bakry El-Arini M, Christopher J. Hegarty, Hsiao T\n(2003) Modelling the effects of ionospheric scintillation on GPS\/\nsatellite-based augmentation system availability. Radio Sci\n38(1):1001, doi:10.1029\/2000RS002604\nCrane, Robert K (1977) Ionospheric scintillation. Proceedings of the\nIEEE 65(2): 180–199\nDoherty PH, Delay SH, Valladares CE, Klobuchar JA (2000)\nIonospheric scintillation effects in the equatorial and auroral\nregions. In: Proceedings ION GPS, 19–22 September 2000, Salt\nLake City\nForte B(2005) Optimum detrending of raw GPS data for scintillation\nmeasurements at auroral latitudes. J Atmos Solar-Terrestrial\nPhys 67(12):1100–1109\nGau Y, Li Z (1999) Cycle-slip detection and ambiguity resolution\nalgorithms for dual frequency GPS data processing. Mar Geod\n22(4):169–181\nHumphreys TE, Psiaki ML, Ledvina BM, Kintner PM (2005)\nPerformance of GPS carrier tracking loops during ionospheric\nscintillations. Proceedings International Ionospheric Effects\nSymposium 3–5 May 2005, Alexandria\nKaplan ED (ed) (1996) Understanding GPS: principles and applica-\ntions, 1st edn. Artech House, Boston, pp 247–251, ISBN\n0890067937\nLedvina BM, Kintner PM, Makela JJ (2004) Temporal properties of\nintense GPS L1 amplitude scintillations at midlatitudes. Radio\nScience 39, RS1S18, doi:10.1029\/2002RS002832\nMaterassi M, Mitchell CN (2006) Wavelet analysis of GPS amplitude\nscintillation, a case study. Radio Science (in press)\nMitchell CN, Spencer PSJ (2003) A three-dimensional time-depen-\ndent algorithm for ionospheric imaging using GPS. Ann\nGeophys 46(4):687–696\nMitchell CN, Alfonsi L, De Francesci G, Lester M, Romano V (2005)\nGPS TEC and scintillation measurements from the polar\nionosphere during the October 2003 storm. Geophys Res Lett\n32, L12S03, doi:10.1029\/2004GL021644\nMorrissey TN, Shallberg KW, Van Dierendonck AJ, Nicholson MJ\n(2004) GPS receiver performance characterization under realistic\nionospheric phase scintillation environments. Radio Sci 39\nRS1S20, doi:10.1029\/2002RS002838, 2004\nSkone S, Knudsen K, de Jong M (2001) Limitations in GPS receiver\ntracking performance under ionospheric scintillation conditions.\nPhys Chem Earth (A) 26(6–8):613–621\nVan Dierendonck AJ, Hua Q, Fenton P, John K (1996) Commercial\nionospheric scintillation monitoring receiver development and\ntest results. In: Proceedings annual technical meeting of the\nInstitute of Navigation pp 573–582\nYeh KC, Liu CH (1982) Radio wave scintillations in the ionosphere.\nProceedings of the IEEE 70(4): 324–360\nAuthor Biography\nRobert Meggs gained his BSc\ndegree in Mathematics in 1996,\nby distance learning with the\nOpen University. Whilst study-\ning for his BSc, he worked in a\nvariety of UK-based engineer-\ning industries, mainly in the\ndefence sector. He then went on\nto study Electronics and Com-\nmunications Engineering at the\nUniversity of Bath, from where\nhe received his Master’s degree\nin 2001. This was followed in\n2005 by the award of his Doc-\ntorate by the University of Bath for his work on mapping ionospheric\ntotal electron content (TEC) using GNSS signals. He has since\nworked on loss of receiver lock due to ionospheric scintillation in the\nauroral regions, and has developed a real-time TEC mapping process\nfor the UK using near real-time GPS data. His current research\ninterests lie in the application of location-based technologies.\nGPS Solut (2008) 12:281–287 287\n123\n"}