{"doi":"10.1007\/s00421-010-1471-1","coreId":"52409","oai":"oai:eprints.lincoln.ac.uk:3540","identifiers":["oai:eprints.lincoln.ac.uk:3540","10.1007\/s00421-010-1471-1"],"title":"Effects of upper-limb exercise on lower-limb cutaneous\\ud\nmicrovascular function in post-surgical varicose-vein patients","authors":["Klonizakis, Markos","Tew, G. A.","Michaels, J. A.","Saxton, J. M."],"enrichments":{"references":[{"id":694995,"title":"A review of microvascular measurements in wound healing.","authors":[],"date":"2006","doi":"10.1177\/1534734606292492","raw":"Iabichella ML, Melillo E, Mosti G (2006) A review of microvascular measurements in wound healing. Int J Low Extrem Wounds 5: 181-199.","cites":null},{"id":696608,"title":"Effects of exercise training and detraining on cutaneous microvascular function in man: the regulatory role of endothelium-dependent dilation in skin vasculature.","authors":[],"date":"2005","doi":"10.1007\/s00421-004-1176-4","raw":"Wang JS (2005) Effects of exercise training and detraining on cutaneous microvascular function in man: the regulatory role of endothelium-dependent dilation in skin vasculature. Eur J Appl Physiol 93: 429-434.","cites":null},{"id":695208,"title":"Effects of posture and venous insufficiency on endothelial-dependent and -independent cutaneous vasodilation in the perimalleolar region.","authors":[],"date":"2003","doi":"10.1053\/ejvs.2002.1953","raw":"Klonizakis M, Yeung JM, Nash JR, Lingam K, Manning G, Donnelly R (2003) Effects of posture and venous insufficiency on endothelial-dependent and -independent cutaneous vasodilation in the perimalleolar region. Eur J Vasc Endovasc Surg 26: 100-104.","cites":null},{"id":696387,"title":"Limb-specific and cross-transfer effects of armcrank exercise training in patients with symptomatic peripheral arterial disease.","authors":[],"date":"2009","doi":"10.1042\/CS20080688","raw":"Tew GA, Nawaz S, Zwierska I, Saxton JM (2009) Limb-specific and cross-transfer effects of armcrank exercise training in patients with symptomatic peripheral arterial disease. Clin Sci 117: 405-413.","cites":null},{"id":696165,"title":"Risk factors for chronic ulceration in patients with varicose veins: a case control study.","authors":[],"date":"2009","doi":"10.1016\/j.jvs.2009.02.237","raw":"Robertson L, Lee AJ, Gallagher K, Carmichael SJ, Evans CJ, McKinstry BH, Fraser SC, Allan PL, Weller D, Ruckley CV, Fowkes FG (2009) Risk factors for chronic ulceration in patients with varicose veins: a case control study. J Vasc Surg 49: 1490-1498.","cites":null},{"id":695692,"title":"Saxton (2009b) Exercise training improves cutaneous microvascular endothelial function in post-surgical varicose vein patients.","authors":[],"date":null,"doi":"10.1016\/j.mvr.2009.03.002","raw":"Klonizakis M, Tew GA, Michaels JA, Saxton (2009b) Exercise training improves cutaneous microvascular endothelial function in post-surgical varicose vein patients. Microvasc Res 78: 67-70.","cites":null},{"id":695425,"title":"Saxton JM (2009a) Impaired microvascular endothelial function is restored by acute lower-limb exercise in post-surgical varicose vein patients.","authors":[],"date":null,"doi":"10.1016\/j.mvr.2008.09.009","raw":"Klonizakis M, Tew GA, Michaels JA, Saxton JM (2009a) Impaired microvascular endothelial function is restored by acute lower-limb exercise in post-surgical varicose vein patients. Microvasc Res 77: 158–162.","cites":null},{"id":695941,"title":"Significance of limb trauma as an initiating factor in chronic leg ulceration.","authors":[],"date":"2008","doi":"10.1258\/phleb.2007.007024","raw":"Kulkarni SR, Gohel MS, Whyman MR, Poskitt KR (2008) Significance of limb trauma as an initiating factor in chronic leg ulceration. Phlebology 23: 130-136.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-08-10","abstract":"Regular walking exercise attenuates lower-limb\\ud\ncutaneous microvascular endothelial dysfunction in postsurgical\\ud\nvaricose-vein patients. This study assessed the\\ud\neffects of upper-limb exercise training on lower-limb cutaneous\\ud\nmicrovascular function in this patient group. Six\\ud\npost-surgical (4–5 weeks) varicose-vein patients completed\\ud\nan 8-week arm-crank exercise training programme.\\ud\nChanges in cutaneous microvascular function of the lower\\ud\nleg were assessed using laser Doppler Xowmetry\\ud\nand iontophoretic administration of endothelial-dependent\\ud\nand -independent agonists [acetylcholine (ACh) and sodium\\ud\nnitroprusside (SNP), respectively]. At 8 weeks, median\\ud\nlower-limb cutaneous vasodilator responsives to ACh and\\ud\nSNP remained unchanged relative to baseline (e.g. 6 mC:\\ud\n37 (interquartile range 24–63) vs. 40 (20–71) PU and 35\\ud\n(23–48) vs. 38 (21–64) PU, respectively for the supine\\ud\nposition). Upper-limb exercise appears ineffective for\\ud\nimproving lower-limb cutaneous microvascular function in\\ud\npost-surgical varicose-vein patients. Therefore, limb speci-\\ud\nficity appears an important factor in optimal exercise\\ud\nprescription for these patients","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/52409.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/3540\/1\/EJAP_short_communication.doc","pdfHashValue":"67229e4a3861438bf03daeb089a1e7b7d5867a30","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:3540<\/identifier><datestamp>\n      2013-03-13T08:49:36Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F41:6A6163735F41333030<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/3540\/<\/dc:relation><dc:title>\n        Effects of upper-limb exercise on lower-limb cutaneous\\ud\nmicrovascular function in post-surgical varicose-vein patients<\/dc:title><dc:creator>\n        Klonizakis, Markos<\/dc:creator><dc:creator>\n        Tew, G. A.<\/dc:creator><dc:creator>\n        Michaels, J. A.<\/dc:creator><dc:creator>\n        Saxton, J. M.<\/dc:creator><dc:subject>\n        A300 Clinical Medicine<\/dc:subject><dc:description>\n        Regular walking exercise attenuates lower-limb\\ud\ncutaneous microvascular endothelial dysfunction in postsurgical\\ud\nvaricose-vein patients. This study assessed the\\ud\neffects of upper-limb exercise training on lower-limb cutaneous\\ud\nmicrovascular function in this patient group. Six\\ud\npost-surgical (4–5 weeks) varicose-vein patients completed\\ud\nan 8-week arm-crank exercise training programme.\\ud\nChanges in cutaneous microvascular function of the lower\\ud\nleg were assessed using laser Doppler Xowmetry\\ud\nand iontophoretic administration of endothelial-dependent\\ud\nand -independent agonists [acetylcholine (ACh) and sodium\\ud\nnitroprusside (SNP), respectively]. At 8 weeks, median\\ud\nlower-limb cutaneous vasodilator responsives to ACh and\\ud\nSNP remained unchanged relative to baseline (e.g. 6 mC:\\ud\n37 (interquartile range 24–63) vs. 40 (20–71) PU and 35\\ud\n(23–48) vs. 38 (21–64) PU, respectively for the supine\\ud\nposition). Upper-limb exercise appears ineffective for\\ud\nimproving lower-limb cutaneous microvascular function in\\ud\npost-surgical varicose-vein patients. Therefore, limb speci-\\ud\nficity appears an important factor in optimal exercise\\ud\nprescription for these patients.<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2010-08-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/msword<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc<\/dc:rights><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/3540\/1\/EJAP_short_communication.doc<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/3540\/2\/EJAP_short_communication.pdf<\/dc:identifier><dc:identifier>\n          Klonizakis, Markos and Tew, G. A. and Michaels, J. A. and Saxton, J. M.  (2010) Effects of upper-limb exercise on lower-limb cutaneous microvascular function in post-surgical varicose-vein patients.  European Journal of Applied Physiolology, 109  (6).   pp. 1221-1224.  ISSN 1439-6319  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s00421-010-1471-1<\/dc:relation><dc:relation>\n        10.1007\/s00421-010-1471-1<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/3540\/","http:\/\/dx.doi.org\/10.1007\/s00421-010-1471-1","10.1007\/s00421-010-1471-1"],"year":2010,"topics":["A300 Clinical Medicine"],"subject":["Article","PeerReviewed"],"fullText":"Short communication \n \nEffects of upper-limb exercise on lower-limb cutaneous microvascular function in post-surgical \nvaricose-vein patients \n \nMarkos Klonizakis*, Garry A. Tew†, Jonathan A. Michaels*, John M. Saxton†\n \n*Sheffield Vascular Institute, Northern General Hospital, Sheffield, UK  \n†The Centre for Sport and Exercise Science, Sheffield Hallam University, Sheffield, UK \n \nCorresponding author: Dr John M. Saxton, Reader in Clinical Exercise Physiology. The Centre for \nSport and Exercise Science, Collegiate Crescent Campus, Sheffield Hallam University, Sheffield, \nUnited Kingdom, S10 2BP. FAX: +44 (0114) 225 4341. Telephone: +44 (0114) 225 4414. E-mail: \nj.m.saxton@shu.ac.uk\n \nKey words: Skin blood flow; upper-limb exercise; venous disease; laser Doppler flowmetry \n \nShort Title: Upper-limb exercise and skin microvascular function \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n1 \n \nAbstract \nRegular walking exercise attenuates lower-limb cutaneous microvascular endothelial dysfunction in \npost-surgical varicose-vein patients. This study assessed the effects of upper-limb exercise training on \nlower-limb cutaneous microvascular function in this patient group. Six post-surgical (4-5 weeks) \nvaricose-vein patients completed an 8-week arm-crank exercise training programme. Changes in \ncutaneous microvascular function of the lower leg were assessed using laser Doppler flowmetry and \niontophoretic administration of endothelial-dependent and -independent agonists (acetylcholine [ACh] \nand sodium nitroprusside [SNP], respectively). At eight weeks, median lower-limb cutaneous \nvasodilator responsives to ACh and SNP remained unchanged relative to baseline (e.g. 6 mC: 37 \n(interquartile range, 24-63) vs 40 (20-71) PU and 35 (23-48) vs 38 (21-64) PU respectively for the \nsupine position). Upper-limb exercise appears ineffective for improving lower-limb cutaneous \nmicrovascular function in post-surgical varicose-vein patients. Therefore, limb specificity appears an \nimportant factor in optimal exercise prescription for these patients. \n \nIntroduction \nChronic venous disease is a common cause of lower-limb ulceration (Iabichella et al. 2006). Several \nfactors might affect tissue viability and susceptibility to ulceration, but the structural and functional \nintegrity of the microcirculation to maintain blood flow, tissue oxygenation, and nutrient delivery \nmight be particularly important (Iabichella et al. 2006). Indeed, microcirculatory impairment is \ninvolved in all the hypotheses on ulcer pathophysiology (Iabichella et al. 2006), the trophic tissue \ndamage caused by vein insufficiency is preceded by the development of microvascular abnormalities \n(Iabichella et al. 2006), and skin microvascular abnormalities are a risk factor for chronic ulceration in \npatients with varicose veins but no history of venous ulcer (Robertson et al. 2009). Therefore, \nassessment of cutaneous microvascular function in patients with mild-to-moderate venous disease \nmight be useful for identifying those at high risk of venous ulceration. It might also be useful for \nassessing ulcer risk in patients who have recently had varicose-vein surgery, given that approximately \n20% of patients with spontaneous ulcers have previously had varicose-vein surgery (Kulkarni et al. \n2008).   \n In recent years, we studied lower-limb cutaneous microvascular function in patients being \ntreated for lower-limb varicosities (Klonizakis et al. 2003, 2009a) using laser Doppler flowmetry \n2 \n \ncombined with incremental-dose iontophoretic administration of endothelial-dependent (acetylcholine \n[ACh]) and -independent (sodium nitroprusside [SNP]) vasodilators. A key finding was that varicose-\nvein patients had microvascular endothelial dysfunction (reduced ACh-responsiveness) compared to \nage-matched healthy controls (Klonizakis et al. 2003), which persisted after venous surgery (Klonizakis \net al. 2009a). Therefore, it appears important to identify strategies to improve cutaneous microvascular \nendothelial function in post-surgical varicose-vein patients.  \n We recently investigated the effects of aerobic exercise training (brisk walking) on lower-limb \ncutaneous microvascular function in this patient group. We found that both acute (Klonizakis et al. \n2009a) and chronic (Klonizakis et al. 2009b) walking exercise improved microvascular endothelial \nfunction (ACh-responsiveness), an adaptation that might be clinically meaningful with respect to risk \nof venous ulceration. As it was unclear if this adaptation can be induced by other modes of exercise, we \ninvestigated the effects of upper-limb exercise training (arm-cranking) on lower-limb cutaneous \nmicrovascular function in post-surgical varicose-vein patients. This exploratory study has practical \nimplications because many of these patients have difficulty walking. We hypothesised that arm-\ncranking might be a useful alternative for improving lower-limb microvascular function in post-\nsurgical varicose-vein patients, given that it has been shown to improve lower-limb haemodynamics in \npatients with intermittent claudication (Tew et al. 2009). \n \nMethods \nWith Local Research Ethics Committee approval, six patients who had recently (within 4-5 weeks) \nreceived ligation and stripping of the great saphenous vein (for isolated venous incompetence) were \nrecruited from the Sheffield Vascular Institute at the Northern General Hospital, Sheffield, UK. \nPatients with skin changes of the gaiter area (between the ankle and proximal calf), diabetes, \ncardiovascular disease, or those who were taking vasodilatory therapy were excluded from \nparticipation. Those who were non-ambulatory were also excluded. This research was carried out in \naccordance with the Declaration of Helsinki of the World Medical Association, and all volunteers \nprovided written informed consent. No residual refluxing segments were reported post-operatively. \nDemographic data are shown in Table 1.  \n Outcome measures were assessed at baseline and 8 weeks. Cutaneous microvascular \nvasodilator function of the gaiter area was assessed in the supine and standing positions using laser \n3 \n \nDoppler flowmetry combined with incremental-dose iontophoretic administration of ACh and SNP, as \ndescribed in detail previously (Klonizakis et al. 2009a; Klonizakis et al. 2009b). After this, patients \ncompleted an incremental arm-cranking test to maximum exercise tolerance using an electronically-\nbraked cycle ergometer (Lode Excalibur Sport) positioned specifically for arm cranking. Patients were \nasked to maintain a cadence of 50 rev·min-1. Following a 2-min warm-up against no resistance (0 W), \nthe work rate was increased by 7 W·min-1.  \n Patients attended twice weekly arm-crank exercise training sessions for 8 weeks, with each \nsession comprising 10 × 2-min bouts of exercise at 60-70% of peak work rate, separated by 2 min rest \n(Tew et al. 2009). The intensity of exercise was progressed gradually throughout the 8-week \nprogramme so that it remained “somewhat hard”. The prescribed intensity, frequency, and duration of \nexercise were the same as described previously (Tew et al. 2009; Klonizakis et al. 2009b). \n Wilcoxon signed-rank tests were used to detect changes in outcome measures with statistical \nsignificance set at P ≤ 0.05. Data are presented as median (interquartile range). \n \nResults \nCompliance to the twice weekly exercise sessions was 100% and there were no drop-outs or exercise-\nrelated complications. The % predicted maximum heart rate towards the end of each training session \nwas 74% (66-81%). Peak arm-crank work rate increased from 56 W (36-70 W) at baseline to 71 W \n(60-77 W) at 8 weeks (P < 0.001). At 8 weeks, baseline flux values and flux responses to ACh and \nSNP were unchanged in both body positions (Table 2; P > 0.05). There was also no effect of posture on \ncutaneous microvascular function (P > 0.05). \n \nDiscussion  \nThe purpose of this study was to assess the effects of upper-limb exercise training on lower-limb \ncutaneous microvascular function in post-surgical varicose-vein patients. We observed that skin blood \nflow responses to ACh and SNP were unchanged after 8 weeks of exercise training, despite an \nimprovement in fitness (peak work rate). Therefore, our data suggest that upper-limb exercise (at least \nin the form of moderate-intensity arm-cranking) does not improve lower-limb microvascular function \nin post-surgical varicose-vein patients. \n4 \n \n The pre-training peak responses to ACh (Table 2) were similar to those observed previously \nfor this patient group (45-48 PU) (Klonizakis et al. 2009a) and lower than those observed for age-\nmatched healthy controls (63-96 PU) (Klonizakis et al. 2009a), suggesting that the patients had \nmicrovascular endothelial dysfunction at baseline. In contrast to lower-limb exercise training \n(Klonizakis et al. 2009b), upper-limb exercise training was ineffective for attenuating lower-limb \ncutaneous microvascular endothelial dysfunction in post-surgical varicose-vein patients. Previous \nstudies have reported improvements in ACh-responsiveness of the forearm skin microvessels after \nlower-limb aerobic exercise training (Wang 2005; Hodges et al. in press). Therefore, the available \nevidence suggests that lower-limb aerobic exercise can improve upper-limb cutaneous microvascular \nendothelial function, but not vice versa. This is probably because arm-cranking activates a smaller \nmuscle mass than cycling or treadmill exercise, and therefore provides a relatively small cardiovascular \nchallenge. Exercise training-induced changes in skin microvascular function are thought to be the result \nof exercise engaging thermoregulatory mechanisms (Hodges et al. in press). With this in mind, lower-\nlimb aerobic exercise probably induces significant thermoregulatory responses and changes in leg skin \nblood flow, whereas arm-cranking probably does not. We cannot exclude the possibility that a more \nintensive training regime would have induced favourable lower-limb microvascular adaptations; \nhowever, we believe that such a regime would have been poorly tolerated, given that our patients were \nolder and untrained. \n There are two main implications for clinical practice from our recent series of investigations. \nFirstly, vascular surgeons need to recognise that microvascular abnormalities often persist after \nvaricose-vein surgery. Therefore, additional steps need to be implemented post-surgically to reduce a \npatients' risk of future venous ulceration. Secondly, upper-limb exercise cannot be considered as \nalternative to the effects of supervised walking in the improvement of microvascular dysfunction and \nthus limitation in mobilisation may be a bad prognostic factor in patients with chronic venous \ninsufficiency even after varicose-vein surgery.  \n Limitations to this study include the small sample size and the fact that, despite careful probe \npositioning, it is likely our microvascular measures were taken from different areas of skin pre- and \npost-training. Our power calculation, which was based on previous data (Klonizakis et al. 2009b), \nsuggested that we needed 6 patients to identify a 20-PU change in the peak response to ACh with an \naverage standard deviation of 17.3 PU and β = 80%. We accept that this is a small sample size, but \n5 \n \nbelieve it is sufficient for an exploratory study. As there were no trends for altered microvascular \nresponses, we are confident that our interpretation of the findings is not confounded by the small \nsample size. \n In summary, our results suggest that upper-limb exercise training does not improve lower-\nlimb skin microvascular function in post-surgical varicose-vein patients. Therefore, it appears that \nexercise modality and limb-specificity are important factors in optimal exercise prescription for this \npatient group. Future research is needed to identify the mechanisms by which cutaneous microvascular \nendothelial function is improved after lower-limb aerobic exercise training, as well as to explore the \nfeasibility of more wide-spread exercise rehabilitation in the clinical setting for venous disease patients. \n \nReferences \nHodges GJ, Sharp L, Stephenson C, Patwala AY, George KP, Goldspink DF, Cable TN (in press) The \neffect of 48 weeks of aerobic exercise training on cutaneous vasodilator function in post-menopausal \nfemales. Eur J Appl Physiol. \n \nIabichella ML, Melillo E, Mosti G (2006) A review of microvascular measurements in wound healing. \nInt J Low Extrem Wounds 5: 181-199. \n \nKlonizakis M, Yeung JM, Nash JR, Lingam K, Manning G, Donnelly R (2003) Effects of posture and \nvenous insufficiency on endothelial-dependent and -independent cutaneous vasodilation in the \nperimalleolar region. Eur J Vasc Endovasc Surg 26: 100-104. \n \nKlonizakis M, Tew GA, Michaels JA, Saxton JM (2009a) Impaired microvascular endothelial function \nis restored by acute lower-limb exercise in post-surgical varicose vein patients. Microvasc Res 77: \n158–162. \n \nKlonizakis M, Tew GA, Michaels JA, Saxton (2009b) Exercise training improves cutaneous \nmicrovascular endothelial function in post-surgical varicose vein patients. Microvasc Res 78: 67-70. \n \nKulkarni SR, Gohel MS, Whyman MR, Poskitt KR (2008) Significance of limb trauma as an initiating \nfactor in chronic leg ulceration. Phlebology 23: 130-136. \n  \n \nRobertson L, Lee AJ, Gallagher K, Carmichael SJ, Evans CJ, McKinstry BH, Fraser SC, Allan PL, \nWeller D, Ruckley CV, Fowkes FG (2009) Risk factors for chronic ulceration in patients with varicose \nveins: a case control study. J Vasc Surg 49: 1490-1498. \n \nTew GA, Nawaz S, Zwierska I, Saxton JM (2009) Limb-specific and cross-transfer effects of arm-\ncrank exercise training in patients with symptomatic peripheral arterial disease. Clin Sci 117: 405-413. \nWang JS (2005) Effects of exercise training and detraining on cutaneous microvascular function in \nman: the regulatory role of endothelium-dependent dilation in skin vasculature. Eur J Appl Physiol 93: \n429-434. \n \n \n \n \n \n \n \n \n6 \n \n \n \n \n \n \n \n \n \nTable 1 Patient demographics \nSex 5 female, 1 male \nAge (years) 57 (39-72) \nBody mass (kg) 73.4  (67.0-82.5 \nStature (cm) 163.2 (161.2-180.3) \nBody mass index (kg·m-2) 26.0 (24.8-27.6) \nSystolic blood pressure (mmHg) 134 (124-140) \nDiastolic blood pressure (mmHg) 83 (77-86) \nData are presented as median (interquartile range). \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n7 \n \n \n \n \n \n \n \n \n \nTable 2 Cutaneous flux responses to ACh and SNP \n Arm-crank exercise group Age-matched healthy controls* \nVariable Baseline 8 weeks Baseline \nACh supine     \nBasal flux (PU) 8 (6-10) 6 (3-8) 7 (5-9) \n2 mC (PU) 12 (10-23) 9 (6-24) 12 (7-20) \n3 mC (PU) 16 (11-35) 21 (11-41) 19 (12-41) \n4 mC (PU) 31 (9-49) 35 (13-61) 43 (19-52) \n6 mC (PU) 37 (24-63) 40 (20-71) 53 (32-76) \nPK%BL (%) 648 (342-1294) 883 (598-1069) 691 (433-1076) \n     \nACh standing     \nBasal flux (PU) 6 (5-8) 9 (4-12) 6 (5-8) \n2 mC (PU) 15 (8-24) 10 (4-20) 13 (7-23) \n3 mC (PU) 18 (9-42) 12 (6-43) 28 (13-44) \n4 mC (PU) 32 (15-51) 22 (12-66) 57 (33-71) \n6 mC (PU) 49 (17-80) 43 (18-94) 65 (56-118) \nPK%BL (%) 800 (311-1490) 698 (287-1093) 996 (460-1847) \n     \nSNP supine     \nBasal flux (PU) 10 (7-15) 8 (5-11) 3 (2-5) \n2 mC (PU) 11 (8-16) 10 (7-38) 6 (3-10) \n3 mC (PU) 17 (7-37) 21 (12-43) 14 (8-20) \n4 mC (PU) 28 (9-61) 32 (16-46) 20 (16-29) \n6 mC (PU) 35 (23-48) 38 (21-64) 28 (18-35) \nPK%BL (%) 306 (126-453) 408 (157-695) 736 (418-1290) \n     \nSNP standing     \nBasal flux (PU) 9 (7-12) 11 (5-15) 4 (2-5) \n2 mC (PU) 12 (8-20) 16 (7-21) 5 (3-10) \n3 mC (PU) 14 (8-20) 17 (8-28) 7 (4-15) \n4 mC (PU) 19 (15-24) 21 (14-32) 13 (7-16) \n6 mC (PU) 27 (15-46) 29 (13-51) 19 (12-33) \nPK%BL (%) 181 (50-386) 207 (67-417) 513 (364-616) \nData are presented as median values with the inter-quartile range in parentheses. \n8 \n \nPK%BL, percentage increase between peak and baseline \n*Data from Klonizakis et al. (2009a) \n \n9 \n \n"}