{"doi":"10.1029\/2005JF000309","coreId":"65817","oai":"oai:dro.dur.ac.uk.OAI2:4602","identifiers":["oai:dro.dur.ac.uk.OAI2:4602","10.1029\/2005JF000309"],"title":"Draping or overriding : the effect of horizontal stress gradients on internal layer architecture in ice sheets.","authors":["Hindmarsh,  R. C. A.","Leysinger Vieli,  G. J.-M. C.","Raymond,  M. J.","Gudmundsson,  G. H."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-06-01","abstract":"Internal isochronic layers in ice sheets sensed by radar show two characteristic relationships to the basal topography: Either they override it, with layers above the crests of rises lying essentially flat, or they drape over it, with the layers following rises and falls in basal topography. A mechanical theory is presented which shows that overriding is the expected behavior when topographic wavelengths are comparable with or less than the ice thickness, while draping occurs at longer wavelengths. This is shown with analytical perturbation solutions for Newtonian fluids, numerical perturbation solutions for nonlinear fluids, and finite element solutions for nonlinear fluids and large-amplitude variations. Bed variation from topography and changes in the basal boundary condition are considered, for fixed bed and sliding beds, as well as three-dimensional flows and thermomechanically coupled flows. In all cases, the dominant effect on draping\/overriding is the wavelength of the topography or variation in basal boundary conditions. Results of these full mechanical system calculations are compared with those from the shallow ice approximation and the longitudinal stress approximation. Some calculations are carried out for zero accumulation, where the age of the ice and therefore isochrone geometry is not defined. It is shown that there is a close relationship between isochrones and streamlines, and that they behave similarly when bed wavelength divided by the ice thickness is small compared with the ratio of ice velocity and accumulation rate, which is a useful approximation. Numerical comparisons of isochrones and streamlines show them to be virtually coincident","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65817.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4602\/1\/4602.pdf","pdfHashValue":"9ce88da2283c96478938952f4a333c7e0bb74145","publisher":"American Geophysical Union","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4602<\/identifier><datestamp>\n      2011-09-07T11:05:15Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Draping or overriding : the effect of horizontal stress gradients on internal layer architecture in ice sheets.<\/dc:title><dc:creator>\n        Hindmarsh,  R. C. A.<\/dc:creator><dc:creator>\n        Leysinger Vieli,  G. J.-M. C.<\/dc:creator><dc:creator>\n        Raymond,  M. J.<\/dc:creator><dc:creator>\n        Gudmundsson,  G. H.<\/dc:creator><dc:description>\n        Internal isochronic layers in ice sheets sensed by radar show two characteristic relationships to the basal topography: Either they override it, with layers above the crests of rises lying essentially flat, or they drape over it, with the layers following rises and falls in basal topography. A mechanical theory is presented which shows that overriding is the expected behavior when topographic wavelengths are comparable with or less than the ice thickness, while draping occurs at longer wavelengths. This is shown with analytical perturbation solutions for Newtonian fluids, numerical perturbation solutions for nonlinear fluids, and finite element solutions for nonlinear fluids and large-amplitude variations. Bed variation from topography and changes in the basal boundary condition are considered, for fixed bed and sliding beds, as well as three-dimensional flows and thermomechanically coupled flows. In all cases, the dominant effect on draping\/overriding is the wavelength of the topography or variation in basal boundary conditions. Results of these full mechanical system calculations are compared with those from the shallow ice approximation and the longitudinal stress approximation. Some calculations are carried out for zero accumulation, where the age of the ice and therefore isochrone geometry is not defined. It is shown that there is a close relationship between isochrones and streamlines, and that they behave similarly when bed wavelength divided by the ice thickness is small compared with the ratio of ice velocity and accumulation rate, which is a useful approximation. Numerical comparisons of isochrones and streamlines show them to be virtually coincident. <\/dc:description><dc:subject>\n        Ice-sheet mechanics<\/dc:subject><dc:subject>\n         Isochrons<\/dc:subject><dc:subject>\n         Radar layer.<\/dc:subject><dc:publisher>\n        American Geophysical Union<\/dc:publisher><dc:source>\n        Journal of geophysical research : earth surface, 2006, Vol.111, pp.F02018 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-06-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4602<\/dc:identifier><dc:identifier>\n        issn:0148-0227<\/dc:identifier><dc:identifier>\n        doi:10.1029\/2005JF000309<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4602\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1029\/2005JF000309<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4602\/1\/4602.pdf<\/dc:identifier><dc:rights>\n        © 2006 American Geophysical Union. Hindmarsh, R. C. A. and Leysinger Vieli, G. J.-M. C. and Raymond, M. J. and\\ud\nGudmundsson, G. H., (2006), 'Draping or overriding : the effect of horizontal stress gradients\\ud\non internal layer architecture in ice sheets.', Journal of geophysical research : earth surface.,\\ud\n111, F02018, 10.1029\/2005JF000309 (DOI). To view the published open abstract, go to http:\/\/dx.doi.org and enter the DOI.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0148-0227","0148-0227"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Ice-sheet mechanics","Isochrons","Radar layer."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n23 March 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nHindmarsh, R. C. A. and Leysinger Vieli, G. J.-M. C. and Raymond, M. J. and Gudmundsson, G. H. (2006)\n’Draping or overriding : the effect of horizontal stress gradients on internal layer architecture in ice sheets.’,\nJournal of geophysical research : earth surface., 111 . F02018.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1029\/2005JF000309\nPublisher’s copyright statement:\n2006 American Geophysical Union. Hindmarsh, R. C. A. and Leysinger Vieli, G. J.-M. C. and Raymond, M. J. and\nGudmundsson, G. H., (2006), ’Draping or overriding : the effect of horizontal stress gradients on internal layer\narchitecture in ice sheets.’, Journal of geophysical research : earth surface., 111, F02018, 10.1029\/2005JF000309 (DOI).\nTo view the published open abstract, go to http:\/\/dx.doi.org and enter the DOI.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n23 March 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nPublished version \n \nCitation for published item: \nHindmarsh, R. C. A. and Leysinger Vieli, G. J.-M. C. and Raymond, M. J. and \nGudmundsson, G. H. (2006) 'Draping or overriding : the effect of horizontal stress gradients \non internal layer architecture in ice sheets.', Journal of geophysical research : earth surface., \n111, F02018. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1029\/2005JF000309 \n \nPublisher’s copyright statement: \n© 2006 American Geophysical Union. \n \nAdditional information: \nHindmarsh, R. C. A. and Leysinger Vieli, G. J.-M. C. and Raymond, M. J. and \nGudmundsson, G. H., (2006), 'Draping or overriding : the effect of horizontal stress gradients \non internal layer architecture in ice sheets.', Journal of geophysical research : earth surface., \n111, F02018, 10.1029\/2005JF000309 (DOI). To view the published open abstract, go to \nhttp:\/\/dx.doi.org and enter the DOI. \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDraping or overriding: The effect of horizontal\nstress gradients on internal layer architecture\nin ice sheets\nRichard C. A. Hindmarsh,1 Gwendolyn J.-M. C. Leysinger Vieli,2 Me´lanie J. Raymond,3\nand G. Hilmar Gudmundsson1\nReceived 29 March 2005; revised 30 October 2005; accepted 26 January 2006; published 16 June 2006.\n[1] Internal isochronic layers in ice sheets sensed by radar show two characteristic\nrelationships to the basal topography: Either they override it, with layers above the crests\nof rises lying essentially flat, or they drape over it, with the layers following rises and\nfalls in basal topography. A mechanical theory is presented which shows that overriding is\nthe expected behavior when topographic wavelengths are comparable with or less than\nthe ice thickness, while draping occurs at longer wavelengths. This is shown with\nanalytical perturbation solutions for Newtonian fluids, numerical perturbation solutions for\nnonlinear fluids, and finite element solutions for nonlinear fluids and large-amplitude\nvariations. Bed variation from topography and changes in the basal boundary condition are\nconsidered, for fixed bed and sliding beds, as well as three-dimensional flows and\nthermomechanically coupled flows. In all cases, the dominant effect on draping\/overriding\nis the wavelength of the topography or variation in basal boundary conditions. Results\nof these full mechanical system calculations are compared with those from the shallow ice\napproximation and the longitudinal stress approximation. Some calculations are carried\nout for zero accumulation, where the age of the ice and therefore isochrone geometry is\nnot defined. It is shown that there is a close relationship between isochrones and\nstreamlines, and that they behave similarly when bed wavelength divided by the ice\nthickness is small compared with the ratio of ice velocity and accumulation rate, which is a\nuseful approximation. Numerical comparisons of isochrones and streamlines show them to\nbe virtually coincident.\nCitation: Hindmarsh, R. C. A., G. J.-M. C. Leysinger Vieli, M. J. Raymond, and G. H. Gudmundsson (2006), Draping or overriding:\nThe effect of horizontal stress gradients on internal layer architecture in ice sheets, J. Geophys. Res., 111, F02018,\ndoi:10.1029\/2005JF000309.\n1. Introduction\n[2] Radar-echo sounding of cold ice sheets shows the\npresence of layers at depth, which are believed to represent\nformer surfaces of the ice sheet. This paper is predicated on\nthe basis that this is true. The layers arise when snowfall\nevents containing material with unusual electric properties,\nparticularly unusual ion concentrations, is deposited on the\nice surface [e.g., Hempel et al., 2000]. A typical source for\nthese anomalous materials is volcanic eruptions. Near the\nsurface of the ice sheet, isochronic layers are generally flat,\nwith occasional synclines and anticlines. In general, these\nnear-surface features are believed to be caused by spatial\nvariations in the accumulation rate of snow, with synclines\nfor example being associated with increased accumulation\nrate. At depth, isochronic layers are much more irregular.\nSometimes they drape over and are subparallel to the bed,\nwhile at other times they override it, lying almost flat over\nthe most extreme topography. More rarely, they dip toward\nand outcrop at the bed, showing not only that basal melting\nhas occurred, but that there is spatial variation in the amount\nof basal melting. This can either be due to variation in the\ngeothermal heat flux or to variations in the frictional heating\nnear or at the base of the ice sheet, attributable to unusual,\nand therefore interesting, dynamical features.\n[3] To exemplify some of these statements, Figure 1\nshows an example from near Lake Vostok. The ice flows\noutward from Ridge B. Three areas are circled: (zone a) a\nwide depression, (zone b) an area with mountains of\nconstant maximum elevation, and (zone c) an area contain-\ning one or two mountains with much greater elevation than\ntheir neighbors. It is intuitively obvious that solitary moun-\ntains will disturb layers around them. In this paper we are\nconcerned with the contrast between zones a and b in\nFigure 1. In the former, the lines drape the depression,\nwhile in the latter the lines override the depressions. While\nspatial variation in the accumulation rate is believed to be\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 111, F02018, doi:10.1029\/2005JF000309, 2006\n1British Antarctic Survey, Cambridge, UK.\n2Bristol Glaciology Centre, School of Geographical Sciences, Uni-\nversity of Bristol, Bristol, UK.\n3Laboratory of Hydraulics, Hydrology and Glaciology, Eidgenossische\nTechnische Hochschule (VAW ETH), Zurich, Switzerland.\nCopyright 2006 by the American Geophysical Union.\n0148-0227\/06\/2005JF000309$09.00\nF02018 1 of 17\nthe dominant source of undulations in isochronic layers,\nnearer the bed mechanical effects are expected to play a role\nat least as significant as that of basal melting. The purpose of\nthis paper is to investigate howmechanical effects affect layer\narchitecture. This paper does not investigate small-scale\nstructures such as folds or thrusts. Surprisingly little work\nhas been done on how glacier mechanics affects isochrone\narchitecture. A classic paper is by Weertman [1976], who\nlooks at how changes in the basal boundary from frozen to\nsliding can lead to dips in isochrones. This can be called the\n‘‘Weertman effect,’’ and the opposite transition, the ‘‘reverse\nWeertman effect.’’ Another paper is by Pattyn [2002], who\nlooks at the effect of topography on isochrone architecture\nusing the longitudinal stress approximation.\n[4] Following Gudmundsson [2003], one can immediately\nanticipate that two factors will have a dominating effect: the\nwavelength of the undulations and the slip ratio (the ratio of\nthe sliding velocity to the difference in velocity between ice\nsurface and bed). These effects are investigated in this paper\nusing flows on infinite sections. The benefit of this config-\nuration is that it isolates other influences, allowing us to\nfocus on the effects of mechanics, but it creates complica-\ntions with regards to the role the vertical velocity plays in\ndeveloping isochrones, since this velocity arises to accom-\nmodate mass influx at the upper surface and efflux at the\nlower surface. Fortunately, in the limiting case of no\naccumulation\/no melting, it turns out (and is shown here)\nthat isochrones can be identified with streamlines (in plane\nflow). This remains a good approximation provided that the\nproduct of the ratios of accumulation rate to horizontal\nvelocity and wavelength of bedrock roughness to ice\nthickness remains small.\n[5] We use three different techniques to compute the flow\ndown infinite sections. First, we use the analytical theory\ndeveloped by Gudmundsson [2003], applicable to fluids\nwith a linear rheology, to exemplify the basic effects. This\nassumes that the amplitude of bed perturbations is ‘‘small’’;\nthat is, the amplitude of the bed perturbations is a small\nfraction (<10%) of the ice thickness. Second, we use a\nsemianalytical perturbation theory developed by Hindmarsh\n[2004], which deals with nonlinear rheologies and nonsmall\naccumulation rates to generalize the examples to more\nrealistic cases. This theory also only treats ‘‘small’’ pertur-\nbations in the bedrock. Both perturbation theories can deal\nwith three-dimensional flows. Finally, plane-flow finite\nelement calculations consider nonlinear rheologies where\nthe bedrock perturbation amplitudes are not small. In the\nformulation of the finite element approach it is assumed that\nthe accumulation rate is zero, but some useful results which\nshow how nonzero accumulation rates affect isochrone\narchitecture can be obtained and can be shown to be decent\napproximations.\n[6] One use of isochronic data is the investigation of the\nspatial variation of accumulation rate. This remains a large\ncomputational problem, acutely so in inverse mode, and the\nuse of vertically integrated approximations such as the\nshallow ice approximation (SIA) remains essential. In\nparticular, ‘‘stream-tube’’ approximations are useful, where\nthe ice upper and lower surface geometry are given together\nwith the accumulation rate, and mean velocity fields are\ncomputed from mass balance, using the SIA and continuity\nto compute the distribution of horizontal and vertical\nvelocity with depth. This procedure has many attractions;\nrather than tuning a model to give an approximation to the\ntopography, one automatically uses the correct topography,\nand comparison of layer architecture with data is consider-\nably facilitated. One factor of crucial importance is how\npredictions of layer architecture made by the SIA and the\nfull system of balance equations differ. This allows the\ndetermination of whether discrepancies between vertically\nintegrated models and data can be attributed to the use of\nsimplified mechanical models. Motivated by this, we pres-\nent extensive series of results where steady geometries of\nice flows are computed using the full system of equations,\nand isochrone architectures for this particular ice surface\ngeometry are computed for both the full system and for the\nSIA. While the SIA steady geometry could and often would\nbe different, the comparisons we make are more useful for\nthe reasons outlined above.\n[7] The results of all three modes of analysis show that as\nexpected, wavelength is the dominant effect. Isochrones\ndrape around basal topography at long wavelength, while at\nshort wavelength, isochrones override basal topography. In\nthis paper, a long wave has wavelength much greater than\nthe ice thickness, while a short wave has wavelength less\nthan or approximately equal to the ice thickness.\n[8] The paper plan is as follows: the governing equations,\ntheir scalings and linearizations are presented briefly in\nFigure 1. Radargram showing draping over long-wavelength troughs and overriding of short\nwavelength features. Layers drape over the wide trough (zone a), but override the closely spaced\nmountains (zone b). Single mountains disturb layers whatever their horizontal dimension (zone c).\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n2 of 17\nF02018\nsections 2 and 3. The relationship between streamlines and\nisochrones is discussed in section 4. Solutions to the\ngoverning equations are presented in section 5, and the\nresults are summarized in the final section. Three appendi-\nces present technical details of the formulation and solution\nof the equations.\n2. Stokes Equations\n[9] A classic glaciological configuration of flow down the\ninfinite plane is used, and cyclic (repeated) boundary con-\nditions are applied to force variation at the desired wave-\nlength, either by variations in the bed topography or the\nbasal slipperiness. The setup of flow down an infinite plane\nis illustrated in Figure 2. Dimensional quantities are repre-\nsented by a tilde and nondimensional quantities without a\ntilde. Fourier transforms are represented by a caret. The\ncoordinates are (~x;~y;~z), where ~z is perpendicular to the base\nplane and ~x is in the zeroth-order flow direction. The ~z\ndirection is called ‘‘vertical’’ and the ~r = (~x;~y) plane\n‘‘horizontal’’. The upper and lower surfaces are given by\n~z = ~s(~r;~t), ~z = ~b(~r;~t) respectively, the thickness of the ice is\ngiven by ~H(~r;~t) = ~s(~r;~t) \u0001 ~b(~r;~t) and ~T represents time.\nSubscripts (s), (b) indicate evaluation at the surface or base,\nrespectively. The operators rH, rH\u0003 , represent the horizon-\ntal gradient and divergence, respectively.\n[10] The three-dimensional velocity field is conveniently\nrepresented by the vertical velocity ~w and the horizontal\nvelocity vector ~u = (~ux, ~uy), and we also use ~v = (~ux, ~uy, ~w).\nThe governing equations, which apply to all ~r are\n#\nH \u0003 ~uþ @~z~w ¼ 0 ~b \u0006 ~z \u0006 ~s; ð1Þ\n#\u0003 ~Sþ ~r~g ¼ 0 ~b \u0006 ~z \u0006 ~s; ð2Þ\n~S sð Þ \u0003 n sð Þ ¼ 0 ~z ¼ ~s; ð3Þ\nv bð Þ ¼ 0; no slip\nsee equation 6ð Þð Þn bð Þ \u0003 v bð Þ ¼ ~m; sliding\n9=\n; ~z ¼ ~b; ð4Þ\nHere (1) expresses conservation of mass in the ice; (2)\ndescribes conservation of momentum in the ice, and (3) and\n(4) are momentum equation boundary conditions, where ~S\nis the stress tensor, ~r is the density of ice, ~g = ~g(e, 0, \u00011) is\nthe gravitational acceleration vector and n is the outward\nnormal vector at the indicated surface. The horizontal\ncomponent of gravity e~g is functionally equivalent to a\nslope of e. The constitutive relations comprise (1) a\nnonlinear viscous relationship within the ice,\n~e ¼ ~Ac ~tj jn\u00011~t; ð5Þ\nwhere ~e is the strain rate tensor, ~t is a second invariant of\nthe deviator stress tensor ~T, n is the Glen index and ~Ac is a\nrate factor; and (2) an isotropic sliding relation of the form\n~uk bð Þ ¼ ~As ~T t bð Þ\n\u0004\u0004 \u0004\u0004‘\u00011 ~T t bð Þ=~pne ; ð6Þ\nwhere ~uk(b) is the sliding velocity, ~T t (b) is the basal tangential\ntraction, ‘ is the sliding index, ~As is the sliding rate factor, ~pe =\n\u0001~Tn \u0001 ~pw is the effective pressure, ~Tn is the normal traction,\n~pw is the subglacial water pressure and v is a further index.\n[11] The heat equations are given by\n@~t~qþ ~v \u0003 r~q ¼ ~k\n#2~qþ\n~D\n~r~c\n~b ~r;~tð Þ \u0006 ~z \u0006 ~s ~r;~tð Þ; ð7Þ\n~q sð Þ \u0001 ~qs ¼ 0 ~z ¼ ~s ~r;~tð Þ; ð8Þ\n~Ki\n#~q bð Þ \u0003 n bð Þ ¼ \u0001~QG ~z ¼ ~b ~r;~tð Þ: ð9Þ\nEquations (7)–(9) represent conservation of heat in the ice,\nwhere ~q is the temperature in the ice, ~qs is the prescribed\nsurface temperature, ~k is the thermal diffusivity of ice, ~c is\nthe specific heat capacity, ~D =\n1\n2\ntrace(~t \u0003 ~e) is the\ndissipation, ~T is the deviatoric stress and ~Ki is the thermal\nconductivity of ice and ~QG is the geothermal heat flux.\nWhen modeling the flow of heat, only cases where the bed\nis below melting point (i.e., no sliding) are considered.\n[12] The assumption of quasiuniform flow states that such\na flow ~v(QU), where superscript (QU) indicates a quasiuni-\nform flow, is given by\n~v QUð Þ ¼ ~v QUð Þ~x ; 0;~v QUð Þ~z\n\u0005 \u0006\n#\u0003 ~v QUð Þ ¼ 0;\nwhere ~v(QU) is treated as being independent of ~r, but @~x~v~x\n(QU)\nmay be nonzero. Essentially, it is being assumed that over\none wavelength @~x~v~x\n(QU) is sufficiently small that the ~r\nindependence of ~v(QU) is a valid assumption. This assump-\ntion is applied to the base flow about which linearization is\nperformed.\n[13] The upper and lower surface kinematical conditions\nare\n@~t~sþ ~u sð Þ\u0003r~s ¼ ~w sð Þ þ ~a;\n~u bð Þ\u0003r~b ¼ ~w bð Þ þ ~m;\n9=\n;; ð10Þ\nFigure 2. Illustration of the problem set-up and coordinate\nsystem.\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n3 of 17\nF02018\nwhere a, m are the surface accumulation and basal melting\nrespectively. The age equation is simply the advection\nequation for the age ~X with a source term,\n@~t ~X þ ~v \u0003 r ~X ¼ 1; ð11Þ\nwith boundary conditions\n~X ¼ 0;~v \u0003 n bð Þ < 0: ð12Þ\n3. Scaling, Mapping, Linearizations, and\nSolution Methods\n3.1. Scaling\n[14] The main function of dimensional analysis as used in\nthis paper is to reduce the number of free parameters. In the\nrelated analysis of Raymond and Gudmundsson [2005],\nthere are two free parameters, the slip ratio and the mean\nslope e. In some cases here, we also consider nonzero\naccumulation, which is a third free parameter. Other param-\neters (e.g., ice thickness) are shown by the dimensional\nanalysis not to be truly independent parameters. The results\nof Raymond and Gudmundsson [2005] suggest that slope is\nless important than slip ratio, and for reasons of space slope\nand accumulation rate are not investigated systematically.\n[15] This paper deals with many distinct but closely\nrelated quantities, and the notation follows a fairly strict\nsystem. A superscript with parentheses containing 0 or 1\nrefers to the perturbation order in the linearization parameter\nm introduced below in (14). Superscripts without parenthe-\nses always occur at the rightmost end of the superscript\nchain, and are exponents. Subscripts without parentheses\noccur at the leftmost end of the subscript chain. These can\nrefer to tensor or vector components, or to other quantities,\nwhich will be clear from the context. Parenthetic subscripts\nare either (s) or (b), and refer to evaluation of the quantity at\nthe surface and base, respectively. Note that the subscripts\nwithout parentheses on ~A refer to deformation model and\nnot position of evaluation. For example, txz(b)\n(1)2 is the\ndimensionless first-order horizontal plane shear stress in\nthe x-direction, raised to the power 2, evaluated at the base.\n[16] The variables are nondimensionalized as follows.\nThicknesses H, elevations z, s, b and horizontal positions r =\n(x, y) are scaled by ~H*, (asterisk subscripts imply a scale\nmagnitude). Dimensionless field quantities within the ice are\nexpressed in a normalized vertical coordinate z defined by\n0 \u0006 z ¼ ~H\u00011 ~z\u0001 ~b\u0007 \b ¼ H\u00011 z\u0001 bð Þ \u0006 1: ð13Þ\nHindmarsh and Hutter [1988] and Hindmarsh [1999] write\nout the associated differential transforms. In physical units\nthe operators rH\u0003,rH act in the (~r;~z) coordinate system,\nwhile in the dimensionless system they act in the (r, z)\nsystem. Pressure and stresses are scaled by e~r~g ~H*, where ~g =j~gj is the acceleration due to gravity. In dimensionless form,\nthe gravity vector g has components (e, 0,\u00011) where e2\u000b 1.\nThe velocity scale ~v* is chosen so as to set the horizontal\nvelocity ux for the rheologically equivalent but uniform-\nbedded cases equal to unity. Specifically, for the linearization\nstudies, this means that ux(s)\n(0) = 1. The accumulation rate a,\nmelting ratem and the velocity v are scaled by ~v*, the flux has\nscale given by ~q* = ~v*\n~H* and time is scaled by\n~t* =\n~H* \/~v*.\nThese scalings imply ~Ac* = ~v*\/(\n~H* ~t*\nn), ~As* = ~v*\/~t*\n(‘\u0001v).\n3.2. Linearization for Small-Amplitude Perturbations\n[17] We employ linearization techniques to increase the\nrange of situations that can be investigated: in this study,\nthree dimensional flows and thermomechanical coupling.\nThese studies involve far less computational effort than the\nfinite element computations discussed below. The lineariza-\ntions do assume ‘‘small’’ topography, i.e., topographic\namplitudes less than 10% of the ice thickness, which is an\nideal that is fairly frequently achieved under ice sheets.\nFinite (i.e., with no restriction to smallness) amplitudes are\nconsidered in the next section.\n[18] Linearizations involve a basic flow about which\nsmall perturbations are permitted. In this case, the basic\nflow is a uniform shearing flow along the infinite plane. As\nwell as internal shearing, sliding over the bed is permitted.\nFurthermore, we consider the flow of heat within the ice,\nwarmed at the bed by geothermal heating and moving\nthrough the ice by advection and conduction. Even though\nthe flow is uniform, this assumption can be relaxed slightly\nto include quasiuniform flows, whereby a nonzero accumu-\nlation rate is considered, on the understanding that it is\nsufficiently small not to increase flow speeds over one\nwavelength. This accumulation rate advects both cold and\ntracers (e.g., age markers) downward.\n[19] Specifically, in certain of the results discussed below,\nthe relevant field variables are subsequently linearized with\na small parameter m about a base case solution (steady\nuniform flow down the infinite plane), for example,\nH ¼ H 0ð Þ þ mH 1ð Þ r; tð Þ v ¼ v 0ð Þ þ mv 1ð Þ r; z; tð Þ; ð14Þ\netc. These are used to derive a set of zeroth- and first-order\nequations expressing conservation of mass and momentum.\nA Fourier transform in the horizontal plane is then applied\nto the first-order equations, and the first-order fields can be\nexpressed as plane waves,\nH 1ð Þ ¼ < H^ 1ð Þ exp lt \u0001 ik \u0003 rð Þ\t \n\nv 1ð Þ ¼ < v^ 1ð Þ zð Þ exp lt \u0001 ik \u0003 rð Þ\t \n\n9=\n;; ð15Þ\netc., where < represents the real part. In particular, H^ (1) =\ns^(1) \u0001 b^(1). In (15), l is the eigenvalue, the wave numbers\nare given by k = (kx, ky) and the caret indicates the Fourier\ncoefficient of the transform over the r-plane only. The\nscaling is constructed to ensure that H(0) and as many more\nas possible of the other zeroth-order quantities are unity.\nDetails are given by Hindmarsh [2004]. In addition, the\ncase of a Newtonian rheology is also considered, where\nanalytical solutions exist [Gudmundsson, 2003].\n3.3. Finite Element Solution for Finite\nAmplitude Perturbations\n[20] In addition, finite element solutions of the full Stokes\nequations in plane flow are computed using the MARC\nsoftware package [Leysinger Vieli and Gudmundsson, 2004;\nRaymond and Gudmundsson, 2005]. These permit nonsmall\nvariations in the basal properties, which is particularly\nnecessary for the variations in basal slipperiness considered\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n4 of 17\nF02018\nhere. These are computed for repeated flow sections with\ncyclic boundary conditions. No accumulation or basal\nmelting were specified, implying that the assumption of\nquasiuniform flow is not needed. This leads to difficulties\nwith the usual Glen rheology at small amplitudes, as the ice\nbecomes very viscous near the upper, traction-free, surface\nowing to the low stresses and strain rates. These difficulties\nare discussed by Raymond and Gudmundsson [2005], but\nwe only consider large amplitudes, where strain rates at the\nsurface are large, and these difficulties do not need to be\nconsidered. We report results for steady state flows only.\n4. Relationship Between Isochrones and\nStreamlines\n[21] Where there is no recharge (accumulation or basal\nmelting), there is no meaningful solution to the age equation.\nIn particular, to interpret the finite element solutions, it is\nnecessary to consider the relationship between isochrones\nand streamlines, which are easily computed. In this section\nthe relationship between the two is examined and it is shown\nthat streamline geometry gives useful information about\nisochrone geometry in plane flow. Streamlines are flow\ntrajectories. In general, they are not coincident with iso-\nchrones. Intuitively, one would expect them to be related, and\nwe show here that in plane flow, under certain auxiliary\nconditions, isochrones and flow lines track each other. For\nexample, over short distances, if a streamline dips, the\nisochrone dips in a similar way.\n[22] More specifically, the two lines are approximately\ncoincident in a particular sense, and it is shown below that\nthe horizontal gradient of age following a streamline is\nsmaller than horizontal gradients of age following other\nlines (apart from the isochrones), for example, the elevation\nz or the normalized elevation z. This is the strongest\nstatement that can be made; if streamlines and isochrones\nwere coincident, this horizontal gradient would be zero. In\ncases where there is no accumulation rate, one result of this\nsection is that the streamlines are the limiting isochrone\ngeometry for very small accumulation rates.\n[23] To show this, it is convenient to write the partial flux\nq in terms of the overall flux using a shape function [e.g.,\nReeh and Paterson, 1988], w(x, z)\nqx x; zð Þ ¼ w x; zð ÞQx xð Þ\nw x; 0ð Þ \r 0\nw x; 1ð Þ \r 1\n9=\n;: ð16Þ\nThe steady state age equation in z-coordinates can then be\nwritten\nz@xQx \u0001 @xðwQxÞ \u0001 zða\u0001 mÞ \u0001 m\nH\n@zX þ Qx\nH\nu@xX ¼ 1: ð17Þ\nFor the next demonstration it is convenient to use the shape\nfactor as the coordinate system. A further coordinate system\nusing \u0003w = w(x, z) as the vertical coordinate can then be\ndefined,\nXw xw; \u0003wð Þ ¼ X x; zð Þ\nxw ¼ x; \u0003w ¼ w x; zð Þ\n9=\n;: ð18Þ\nMathematically, \u0003w is an independent variable while w is a\ndependent variable, but numerically they are equal. We are\nsimply using a new vertical coordinate as it allows us to\nexplore the relationship between streamlines and isochrones.\nThis coordinate system is not used in numerical calculations.\nThis assumes that w increases monotonically with z, which is\nequivalent to assuming that there are no reverse (circulatory)\nflows. Differential equations can be transformed in (xw, \u0003w)-\ncoordinates, using the following differential transforms:\n@X\n@x\n@X\n@z\n2\n664\n3\n775 ¼\n1\n@w\n@x\n0\n@w\n@z\n2\n664\n3\n775\n@Xw\n@xw\n@Xw\n@\u0003w\n2\n664\n3\n775: ð19Þ\nThere is an important distinction between\n@X\n@x\n, which is the\nhorizontal gradient of the age X on a line of constant\nz (normalized elevation) and\n@X\n@xw\n, which is the horizontal\ngradient of the age X on a line of constant w. Substitution of\n(18) and (19) into (17) gives\n\u0004u\nz@xQx \u0001 \u0003w@xQx \u0001 Qx@xw\u0001 zða\u0001 mÞ \u0001 m\nH\n@\u0003wXw\nþ Qx\nH\n\u0004u @xwXw þ @xw@\u0003wXwð Þ ¼ 1; ð20Þ\nwhere\n\u0004u x; \u0003wð Þ ¼ u x; zð Þ ¼ @w x; zð Þ\n@z\n:\nEquation (20) simplifies immediately to\nQx\nH\n\u0004u@xwXw þ \u0004u\nz@xQx \u0001 \u0003w@xQx \u0001 z a\u0001 mð Þ \u0001 m\nH\n@\u0003wXw ¼ 1;\nand then to\nQx\nH\n@xwXw \u0001\n\u0003w a\u0001 mð Þ þ m\nH\n@wXw ¼ 1\n\u0004u\n; ð21Þ\nwhich is the steady state age equation in (xw, \u0003w)-coordinates.\n[24] Since ice is entering from the top of the glacier, both\nterms on the left-hand side must contribute to the balance,\nwhile the right-hand side is O(1) by construction.\nThis implies that @w Xw = O(1\/a). (For simplicity, we ignore\nthe boundary layer at the bottom where \u0004u = O(a), @w Xw =\nO(1\/a2); the existence of this layer does not affect the\nfollowing argument.)\n[25] Compare (21)with the same equation in z-coordinates,\nQx\nH\n@xX \u0001 w a\u0001 mð Þ þ @xwQx þ m\nH\n@zX ¼ 1u :\nAgain, @z X = O(1\/a). Furthermore, over short range Lx, the\nterm @xw will be order O(1\/Lx), and if Lx < 1\/a\nQx\nH\n@xX \u0001 @xwQx\nH\n@zX \u000f 0;\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n5 of 17\nF02018\nimplying both terms on the left-hand side are O 1\naLx\n\u0011 \u0012\nand\nin particular that\n@xX ¼ O 1\naLx\n\u0011 \u0012\n:\nHowever, in (xw, \u0003w)-coordinates, there are no terms in the\nage equation (21) of O 1\naLx\n\u0011 \u0012\n. The vertical advection term\nand the source term are O(1). The horizontal advection term\ncan be safely written as\n@xwX ¼ O 1ð Þ; ð22Þ\nshowing that it is much smoother than @xX.\n[26] Finally, we must deal with the fact that lines of\nconstant w are not exactly streamlines, even in steady flow.\nThese are given by contours of qx. It can be readily seen that\n@xQx = O(a) and that\n@xqx ¼ w@xQx þ Q@xw ¼ wO að Þ þ O 1=Lxð Þ; ð23Þ\nmeaning that for length scales Lx < 1\/a variations in w with\nhorizontal position make the lead order contribution to the\nhorizontal gradient of the partial flux qx and thus to\nstreamline variation. Lines of constant w therefore corre-\nspond to streamlines over these short length scales.\n[27] The equivalence of lines of constant w with stream-\nlines over short distances (equation (23)) and the fact that\nthe horizontal gradient of the age is very much smaller when\nconsidered along lines of constant w are the basis of the\nstatement that isochrones track streamlines over distances\nshorter than 1\/a. This distance is measured in ice sheet\nthicknesses. If a is 0.01 (i.e., the accumulation is one\nhundredth of the ice velocity), then the distance is 100 ice\nsheet thicknesses. Another way of looking at this is to say\nthat streamlines are the limiting geometry of isochrones as\nthe accumulation rate tends to zero.\n[28] A further useful observation is that a feature of the\nisothermal shallow ice approximation is that w (z) is a uniform\nfunction. Thus, for the isothermal SIAwith constant slip ratio,\nthe property of tracking a streamline also implies tracking a\nconstant normalized elevation. This happens overwavelengths\nthat are ]O(1\/a), but are still sufficiently long that the SIA\nremains valid.\n5. Solutions\n5.1. Analytical Perturbation Solutions for Newtonian\nRheology\n[29] Our first question is whether we can relate simply\nisochrone geometry to wavelength. A feature common to all\nthree types of analysis is comparing the results to those\nobtained with the SIA, which is the mechanical approxima-\ntion most commonly used in large-scale ice sheet modeling,\nFigure 3. Comparison of streamlines from full system (solid line), longitudinal stress approximation\n(small circles) and SIA (dotted line), from analytical solutions for Newtonian rheology. The longitudinal\nstress approximation isochrones almost overlie the full system. All cases are for a bed perturbation\namplitude of 0.1. Streamlines closely correspond to isochrones (see Figure 9). (a, c) Comparisons for the\nindicated wavelength. (d) Isochrone deflection, normalized by ice thickness of the full-system isochrones\nfrom the SIA isochrones as a function of elevation and wavelength.\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n6 of 17\nF02018\nespecially of isochrones and other tracers. Note from the\nimmediately preceding discussion that this involves looking\nat the deflection from a constant normalized elevation in\ncases where the material properties of the ice and bed are\nuniform. Here we consider a simple Newtonian material.\nand look at isochrone deflection from the SIA.\n[30] The analytic perturbation solution of Gudmundsson\n[2003] (full system) and Hindmarsh [2004] (longitudinal\nstress approximation) can be used to demonstrate the basic\neffects of wavelength on streamline geometry and thus on\nisochrone architecture. The solutions have a free surface\nwhich responds to perturbations in the basal topography\nand, where sliding is occurring, in the slipperiness. The\nsolutions apply to a linear rheology with zero accumulation\nand melting.\n[31] The shallow ice approximation predicts velocity\nshape functions to be independent of wavelength, meaning\nthat flow lines are maintained at the same normalized\ncoordinate provided the rate factor distribution does not\nchange with horizontal position. To order O(aLx) this is also\ntrue for isochrones. Amoremathematical discussion of shape\nfunctions and how they are used is given in Appendix C.\n[32] Figure 3 demonstrates the effects of non-SIA stresses\non isochrone elevation by using the Gudmundsson [2003]\nsolution in equation (A14). Also shown are isochrones\ncomputed using the longitudinal stress approximation\n(LSA) of Blatter [1995], using the analytical solution for\na Newtonian rheology [Hindmarsh, 2004, Appendix C], as\nwell as SIA isochrones. As explained above, the full-system\n(FS) geometry is used for all cases; this only introduces a\nsmall error as the transfer of basal topography to surface\ntopography is very similar for all the cases. The figure\nclearly shows that at relatively short wavelengths, FS\nisochrones override while SIA isochrones drape, but at long\nwavelengths, as expected, the SIA and FS isochrones are\ncoincident. More surprising is the degree to which the LSA\napproximation isochrones are virtually coincident with the\nFS isochrones over a broad range of wavelengths.\n5.2. Numerical Solutions for Finite\nAmplitude Perturbations\n[33] Having obtained some rather straightforward results\nfor a Newtonian fluid, our next question is to ask whether\nthey hold for a material with a more complicated rheology.\nIn partial answer, we introduce a Glen (power law) rheol-\nogy, sliding at the bed with, in certain cases, spatial\nvariation in the bed slipperiness.\n[34] Details of these finite element calculations are given in\nAppendix B. Since there is no surface mass exchange, ages\nand therefore isochrones are not meaningfully defined. How-\never, as shown in section 4 and Figure 9 in section 5.3.1,\nstreamlines and isochrones are virtually coincident over\nshort wavelengths. Thus we present results for streamlines\nin this section, but they also apply to isochrones. Cyclic\nboundary conditions are applied at the upstream and down-\nstream ends.\nFigure 4. Calculation showing effect of bed perturbations on full system finite amplitude calculations of\nstreamlines\/isochrones. Ice is fixed to the bed. Solid lines are full-system (FS) isochrones, dash-dotted\nlines are shallow-ice approximation (SIA) isochrones, and dotted lines and shading are contours of\nhorizontal velocity. Bed perturbation amplitude is 0.2. Four plots are for indicated wavelengths, in units\nof ice thickness. Overriding of FS isochrones occurs for short wavelengths; draping occurs at long\nwavelengths. SIA isochrones always show draping.\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n7 of 17\nF02018\n5.2.1. Perturbation to Basal Topography, No Sliding\n[35] In these calculations we repeat the perturbation anal-\nysis carried out for a linear rheology, using a nonlinear\nrheology. Figure 4 shows FS and SIA streamlines for flows\nwith fixed beds, at different wavelengths. The bed topogra-\nphy is undulating. The FS solution shows overriding at short\nwavelengths and draping at longwavelengths. The horizontal\nvelocity contouring shows that the flow stagnates in hollows\nat short wavelengths, which leads to the overriding.\n5.2.2. Perturbation to Basal Topography,\nConstant Sliding\n[36] We now consider the effect of sliding on layer\ngeometry. Figure 5 shows FS and SIA streamlines for flows\nwith sliding at the beds with constant mean slip ratio Co = 10,\nat different wavelengths. The bed topography is undulating.\nAs with the fixed bed, the FS solution shows overriding at\nshort wavelengths and draping at long wavelengths.\n5.2.3. Flat Bed, Sinusoidal Slipperiness Variation\n[37] A further means of basal forcing is horizontal vari-\nation in the basal slipperiness, which affects the vertical\ndistribution of flux. Figure 6 shows FS and SIA streamlines\nfor flows with sliding at the beds with sinusoidally varying\nslipperiness and mean slip ratio Co = 10, amplitude 0.2. In\nthis case the FS and SIA streamlines are virtually coinci-\ndent. At long wavelength there is a marked surface re-\nsponse, and the upper streamlines track the upper surface.\n5.2.4. Flat Bed, On-Off Sliding\n[38] This calculation is aimed at investigating the Weert-\nman effect [Weertman, 1976] at no-slip\/slip boundaries.\nFigure 7 shows FS and SIA streamlines for flows with sliding\nat the beds in the middle section and a fixed bed at the edges.\nWhere the bed is sliding, the mean slip ratio is Co = 10. The\nbed is flat. Again, there is a strong surface response at long\nwavelength, but here the FS and SIA streamlines are rather\ndifferent, especially toward the base of the glacier.\n5.2.5. Amplitude Effects: Perturbation to Basal\nTopography, No Sliding\n[39] By construction analyses using linearization methods\nassume that amplitude of response is directly proportional to\nforcing. In these ‘‘finite amplitude’’ calculations we inves-\ntigate this assumption. Figure 8 shows the effect of bed\ntopography amplitude on isochrone architecture for flow\nwith a fixed bed. At greater amplitude the FS solution\nshows that overriding is more marked, both for the short\nwavelength case and the longer wavelength case. It seems\nthat as the amplitude increases, the thickness of the stagnant\nzone increases, which explains this behavior. Similar\neffects for very short wavelength flows were noted by\nGudmundsson [1997].\n5.3. Numerical Perturbation Solutions for\nNonlinear Rheologies\n[40] Perturbation solutions for nonlinear rheologies are\ncomputed numerically using the methodology described by\nHindmarsh [2004]. Isothermal and thermomechanically\ncoupled cases are presented. Extensions to this theory are\npresented in Appendix A, which considers thermal coupling\nand the perturbed age equation. Isothermal results are\nFigure 5. Calculation showing effect of bed perturbations on full system finite amplitude calculations of\nstreamlines\/isochrones. Ice is sliding over bed with mean slip ratio Co of 10. See Figure 4 caption for\nmeaning of different lines. Overriding of FS isochrones occurs for short wavelengths; draping occurs at\nlong wavelengths. SIA isochrones always show draping.\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n8 of 17\nF02018\npresented in a dimensionless system, with one consistent set\nof units roughly corresponding to an ice-mass with ~Ac = 5 \u0010\n10\u000124Pa\u00013.s, ~a = 0.1m.a\u00011, ~r = 917kg.m\u00013, ~g = 9.81m.s\u00012,\n~H = 2000m. The parameters as specified create an upper\nsurface velocity of roughly 5 \u0010 102 m.a\u00011. The Glen index\nn = 3. The thermally coupled results are presented in\nphysical units.\n[41] Also discussed are isochrones computed using the\nlongitudinal stress approximation of Blatter [1995], using\nthe perturbation method of Hindmarsh [2004]. The reduced\nset of equations used here corresponds to model LMLa in\nthat paper.\n[42] Various cases repeating the studies for fixed bed and\nsliding with varying bed topography were made (not\nshown), which gave similar results. Some computations\nwere carried out at very high slip ratio, but the same basic\npattern of overriding at short wavelengths was still main-\ntained. Amplitude effects are an intrinsically nonlinear\nphenomenon which cannot be investigated by linearized\ntechniques.\n5.3.1. Relationship Between Streamlines\nand Isochrones\n[43] First, we wish to demonstrate the validity of the\nanalysis presented in section 4 concerned with the relation-\nship between streamlines and isochrones. Figure 9 demon-\nstrates the close relationship between isochrones and\nstreamlines for FS plane flow. This correspondence under-\nlies the applicability of the finite element streamline calcu-\nlations to understanding isochrone behavior. Superimposed\non the FS isochrones are markers indicating the longitudinal\nstress approximation. These are virtually coincident, show-\ning that the longitudinal stress approximation gives remark-\nably accurate isochrones.\n5.3.2. Three-Dimensional Effects\n[44] Although it is not usually apparent in radargrams,\nbedrock topography is three-dimensional and the transverse\nvariation is expected to affect radar line geometry. Figure 9\nalso shows steady isochrones for three-dimensional flows.\nFour different configurations are shown, indicated in the\ncaption, with (Figure 9a) and (Figure 9c) having infinite\ntransverse wavelengths, and (Figures 9b and 9b) unit\ntransverse wavelengths. The shorter of the two wavelengths\nLx, Ly determines whether overriding or draping occurs.\nSuperimposed on the FS isochrones are markers indicating\nthe longitudinal stress approximation. Again, these are\nvirtually coincident with the FS solution.\n5.3.3. Thermomechanical Coupling\n[45] Finally, the question arises as to whether additional\nphysical processes will affect the geometry of radar lines.\nFigure 10 shows steady isochrones for a thermomechani-\ncally coupled flow. In such flows there are four free\ndimensionless parameters corresponding to slope, surface\ntemperature, geothermal heat flux and accumulation rate.\nPresenting the results in a dimensionless system overcom-\nplicates matters unnecessarily for the simple demonstration\nrequired here. The base flow is 2500 m thick, with surface\nFigure 6. Calculation showing effect of sliding perturbations on full-system finite amplitude\ncalculations of streamlines\/isochrones. Ice is sliding over bed with mean slip ratio Co of 10, but with\nsinusoidally varying slipperiness with amplitude 0.2. Bed is flat. See Figure 4 caption for meaning of\ndifferent lines. Isochrone geometry is mainly determined by surface response, which is stronger at long\nwavelengths. SIA isochrones correspond to FS isochrones.\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n9 of 17\nF02018\ntemperature \u000136.125\fC, slope 0.0025, accumulation rate\n0.1 m yr\u00011 and geothermal heat flux 50 mW m\u00012. In the\nbase flow, the basal temperature was computed to be\n\u00011.6\fC.\n[46] Cases with wavelength 0.4 times the ice thickness\nand 4 times the ice thickness are shown. The usual pattern is\ndemonstrated, with isochrones tending to override at shorter\nwavelengths and drape at longer wavelengths. Some intri-\ncate temperature perturbations induced by the presence of\nbasal topography do not apparently affect the dominance of\nmechanical effects. As before, the longitudinal stress ap-\nproximation is remarkably accurate.\n5.3.4. Parameter Studies\n[47] We have focused on the effects of wavelength on\nradar layer geometry. Gudmundsson [2003] shows that two\nfurther relevant parameters are slope and slip ratio. Sum-\nmaries of calculations varying these two parameters are\npresented here.\n[48] Figure 11 shows some extended parameter studies.\nFigure 11a is a similar diagram to 3 d, showing deflection\nfrom the SIA prediction as a function of elevation and\nwavelength. As wavelength gets shorter, the point of maxi-\nmumdeflectionmoves downward, but at wavelengths shorter\nthan one ice sheet thickness, the longitudinal stress approx-\nimation becomes poor. At longer wavelengths, rather greater\nthan the ice thickness, the LSA is excellent. The deflection\npattern for sliding shows a more complex dependence on\nwavelength, and the point of maximum deflection is higher\nthan in the case of no slip. However, the difference between\nsliding and no sliding is less than that caused by wavelength.\n[49] Figure 11b shows the effect of slope and wavelength\non maximum deflection. Wavelength has the dominant\neffect, and where slope becomes comparably important it\nis at longer wavelengths where the deflection is lower.\n[50] Figure 11c shows the effect of slip ratio and wave-\nlength on maximum deflection. Again, wavelength has the\ndominant effect, although the maximum deflection is sen-\nsitive to slip ratios where this value is around 1.\n[51] Figure 11d shows, in more detail, for the case of a\nfixed bed, the dependence of the maximum deflection on\nthe two orthogonal wavelengths. This figure supports the\nstatement made above that the shorter of the wavelengths\ndetermines the deflection.\n6. Conclusions and Discussion\n[52] 1. Isochrones track streamlines for sufficiently short\nwavelengths ~Lx \u000b ~H ~ux\n~a\nin dimensional units or Lx < O(1\/a)\nin dimensionless units, where the wavelength has been\nscaled by the ice thickness. Since the accumulation rate a\nis scaled relative to the horizontal velocity, and can thus be\n\u000b1, this effect can happen over quite long wavelengths.\n[53] 2. Analytical, semianalytical and numerical solutions\nall show same features. At short wavelengths streamlines\nand isochrones override basal topography, while at longer\nFigure 7. Calculation showing effect of sliding perturbations on full-system finite amplitude\ncalculations of streamlines\/isochrones. Ice is sliding over bed in middle and is fixed at edges. Bed is\nflat. See Figure 4 caption for meaning of different lines. Isochrone geometry shows Weertman effect\n(dipping at no-slip\/slip boundary and reverse Weertman effect (rising at slip\/no-slip boundary). FS shows\nsmoother response than SIA, and effect is weak at short wavelengths.\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n10 of 17\nF02018\nFigure 8. Calculation showing effect of bed perturbations on full system finite amplitude calculations of\nstreamlines\/isochrones, showing the effect of amplitude on isochrone geometry. Ice is fixed to bed. See\nFigure 4 caption for meaning of different lines. Overriding of FS isochrones occurs for short\nwavelengths; draping occurs at long wavelengths. Overriding is more marked for greater amplitudes.\nResults are compared for two different wavelengths (L = 1, 5) and two different amplitudes (0.1, 0.2).\nDotted line is horizontal velocity.\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n11 of 17\nF02018\nFigure 9. Computed isochrones for plane flow, using a perturbation method, full-system nonlinear\nrheology (solid line). Also indicated are isochrones computed using longitudinal stress approximation\n(circled line nearly coincident with full-system lines). Background contouring is the horizontal velocity.\n(a, c) Flow is plane, and the dash-dotted line is streamline. Isochrones and streamlines are coincident in\nFigure 9c and mostly coincident in Figure 9a. (b, d) Influence of three-dimensional bed topography on\nisochrone architecture using a perturbation method is shown. The horizontal wavelength is indicated,\ntransverse wavelength is 1; amplitude of transverse perturbation is the same as that of longitudinal\nperturbation. Dashed lines are SIA isochrones. Comparison of Figures 9c and 9d shows that isochrone\ndeflection is dominated by shorter of the two wavelengths, while Figures 9a and 9b show that the\naddition of a comparable transverse wavelength does not significantly affect architecture.\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n12 of 17\nF02018\nFigure 10. Influence of thermally dependent ice viscosity on isochrone architecture using a perturbation\nmethod, nonlinear rheology. (a, b) Longitudinal wavelength indicated, for indicated wavelength. Also\nindicated are isochrones computed using longitudinal stress approximation (dots nearly coincident with\nfull-system lines). Dash-dotted lines are SIA streamlines. (c, d) Temperature perturbation in \fC.\nQualitatively, the results are as for the isothermal cases, showing that the complex thermal structure\nseems to be markedly less important than mechanical effects.\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n13 of 17\nF02018\nwavelength, they track or drape the basal and surface\ntopography.\n[54] 3. Streamlines have constant normalized elevation\nfor flows satisfying the SIA. Isochrones show the same\nbehavior over short wavelengths.\n[55] 4. The flow style, overriding or draping, is deter-\nmined by the direction of the shorter of the two wavelengths\ncharacterizing any two-dimensional surface. Thus overrid-\ning can occur at long wavelengths in radar lines following\nthe flow direction, but in such a case one should suspect the\npresence of short-wavelength topography orthogonal to the\nsection.\n[56] 5. Flow by sliding does not alter these conclusions.\n[57] 6. Thermal coupling does not alter these conclusions.\n[58] 7. Isochrones computed using the longitudinal stress\napproximation correspond remarkably well to the full-sys-\ntem solutions for the small-amplitude cases considered here.\nComparison of finite amplitude LSA and FS solutions is\nneeded to assess the general validity of this behavior.\n6.1. Discussion: Overriding, Draping, and the\nDegree of Surface Transfer\n[59] We have seen that wavelength has the strongest\nsignal: At long wavelengths, the isochrones drape, while\nat short wavelengths they override. It is known that the\ntransfer of the basal signal to the surface is wavelength\ndependent [Gudmundsson, 2003], with strong transfer at\nlong wavelength, and extremely limited transfer at short\nwavelengths. It is likely that the weak transfer at short\nwavelengths and the observations of isochrone overriding\nare essentially the same phenomenon.\n[60] Gudmundsson [2003] also points out that transfer is\nmuch stronger when the slip ratio is high for intermediate\nwavelengths (5 to 10 ice thicknesses). By the argument\npresented above, this would imply that the deflection from\nthe SIA isochrones would be smaller when sliding is\noccurring at these wavelengths. This proposition is consis-\ntent with Figures 11a and 11c as well Figures 4c and 5c.\n6.2. Discussion: Is There a Traction Signal?\n[61] Given that glacier mechanics is dominated by two\nparameters, wavelength\/aspect ratio and slip ratio\/traction\nnumber [e.g.,Gudmundsson, 2003], it is somewhat surpris-\ning that the wavelength signal is so much more obvious than\nthe traction signal.\n[62] There are hints that the slip ratio affects the deviation\nof FS solutions from SIA solutions. Comparison of\nFigures 4a and 5a shows that at short wavelength the mean\ndifference between FS and SIA is greater when sliding is\noccurring, though the degree of overriding (measured by\nthe flatness of the streamline) is greater for no slip.\n[63] Taking into account this observation as well as the\nresults shown in Figure 11c, one can say that there is a weak\ntraction\/slip ratio signal in layer architecture. The use of this\nFigure 11. Studies of deviation from SIA prediction as a function of slope, slip ratio and wavelength\ncomputed using a perturbation method, full-system nonlinear rheology. (a) Isochrone deflection of the\nfull-system isochrones from the SIA isochrones as a function of elevation and wavelength for no slip\n(solid line and background coloring), sliding with slip ratio 10 (dashed line), and longitudinal stress\napproximation, no slip (dotted line). (b) Maximum deflection as a function of longitudinal wavelength Lx\nand slope e. (c) Maximum deflection as a function of Lx and slip ratio C. (e) Maximum deflection as a\nfunction of Lx and transverse wavelength h Ly.\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n14 of 17\nF02018\nto invert for the slip ratio from radar lines, where one of the\nwavelength components is unknown, would appear to be\nrather difficult.\n6.3. Discussion: Why is the LSA So Good?\n[64] A second surprise is how good the LSA is. Theory\nsuggests that it is valid down to wavelengths with dimen-\nsion equal to a few ice sheet thicknesses, but the calcula-\ntions in this paper show that this is a conservative error\nestimate, and that the LSA gives good approximations down\nto wavelengths of one ice thickness.\n[65] Apparently, the LSA manages to capture the stagna-\ntion in hollows, which allows the LSA to be able to\nrepresent overriding. This in turn means that LSA predic-\ntions are good in the upper part of the ice, at least for steady\nstate. One should not expect the LSA to be good near the\nbase of the ice sheet at short wavelength, but it is here where\nquite often radar layer observations cannot be made.\nAppendix A: Linearization of the Governing\nEquations\nA1. Momentum Balance\n[66] The linearized stress equations are given by\nequations (A1) to (A9) in the work by Hindmarsh [2004]\nwith the exception that the first-order viscosity given by\nHindmarsh’s [2004] equation (A6) is now given by\nh^ 1ð Þ ¼ 1\u0001 n\nn\nh 0ð Þ\ne 0ð Þ2\ne 0ð Þxz e^\n1ð Þ\nxz þ\n1\n2\ne 0ð Þxx e^\n1ð Þ\nxx \u0001 e^ 1ð Þzz\n\u0005 \u0006\u0011 \u0012\nþ h 0ð Þ\nB0 q 0ð Þ\n\u0005 \u0006\nB q 0ð Þ\n\u0005 \u0006 ;\nðA1Þ\nwhere the difference between the isothermal and present\ntreatments is the second term on the right-hand side.\nA2. Age Equation\n[67] In scaled form, the steady age equation (11) is given\nby\nz\n#\u0003Q\u0001 #\u0003q\u0001 z a\u0001 mð Þ \u0001 m\nH\n@zX þ u\u0003rHX ¼ 1; ðA2Þ\nwhere\nq ¼\nZ z\n0\nudz0;Q ¼\nZ 1\n0\nudz0; ðA3Þ\nThis can be readily seen from equation (37) of Hindmarsh,\n[1999]. In steady state, one can use\n#\u0003Q \r a\u0001 mð Þ\nto write this as\nu\u0003rHX \u0001\n#\u0003qþ m\nH\n@zX ¼ 1: ðA4Þ\n[68] Linearization of the age equation (A4) gives at zeroth\norder\na 0ð Þ \u0001 m 0ð Þ\u0007 \bW 0ð Þ zð Þ þ m 0ð Þ\nH 0ð Þ\n@X 0ð Þ\n@z\n¼ 1; ðA5Þ\nw 0ð Þ zð Þ ¼ q 0ð Þx =Q 0ð Þx ; ðA6Þ\nand at first order the steady perturbation equation is\nu 0ð Þ\u0003rHX 1ð Þ \u0001\n#\u0003q 0ð Þ þ m\nH 0ð Þ\n@X 1ð Þ\n@z\nþ u 1ð Þ\u0003 #HX 0ð Þ\nþ\n#\u0003q 0ð Þ þ m\nH 0ð Þ2\n@X 0ð Þ\n@z\nH 1ð Þ \u0001\n#\u0003q 1ð Þ\nH 0ð Þ\n@X 0ð Þ\n@z\n¼ 0; ðA7Þ\nwhich simplifies to\nikxu\n0ð Þ\nx X^\n1ð Þ þ\n#\u0003q 0ð Þ þ m\nH 0ð Þ\n@X^ 1ð Þ\n@z\n¼ i\nkxq\n1ð Þ\nx þ kyq 1ð Þy\n\u0005 \u0006\nH 0ð Þ\n\u0003 @X\n0ð Þ\n@z\nþ\n#\u0003q 0ð Þ þ m\nH 0ð Þ2\n@X 0ð Þ\n@z\nH^ 1ð Þ; ðA8Þ\nand since we can also write\n#\u0003q 0ð Þ ¼ a\u0001 mð ÞW 0ð Þ zð Þ;\nthe first-order steady age equation can also be written as\nikxu\n0ð Þ\nx X^\n1ð Þ þ a\n0ð Þ \u0001 m 0ð Þ\u0007 \bW 0ð Þ zð Þ þ m 0ð Þ\nH 0ð Þ\n@X^ 1ð Þ\n@z\n¼ i k \u0003 q^\n1ð Þ\nH 0ð Þ\n@X 0ð Þ\n@z\nþ H^\n1ð Þ\nH 0ð Þ\n; ðA9Þ\nwhere the zeroth-order solution has been used to simplify\nthe last term on the right-hand side.\n[69] The deviation of an isochrone with normalized\nelevation zi(x) is given by\n@zX\n0ð Þz^ 1ð Þi ¼ \u0001X^ 1ð Þ: ðA10Þ\nWith zero accumulation and melting, the Fourier-trans-\nformed ageing equation (A8) becomes\nikxu\n0ð Þ\nx X^\n1ð Þ ¼ i\nkxq^\n1ð Þ\nx þ kyq^ 1ð Þy\n\u0005 \u0006\nH 0ð Þ\n@X 0ð Þ\n@z\nþ H^\n1ð Þ\nH 0ð Þ\n; ðA11Þ\nyielding this solution for the first-order age perturbation,\nX^ 1ð Þ ¼\nq^ 1ð Þx þ kykx q^ 1ð Þy\n\u0005 \u0006\nu\n0ð Þ\nx H 0ð Þ\n@X 0ð Þ\n@z\n\u0001 iH^\n1ð Þ\nkxu\n0ð Þ\nx H 0ð Þ\n; ðA12Þ\nand use of equation (A10) gives the isochrone deflection as\nz^1 ¼ \u0001\nq^ 1ð Þx þ kykx q^ 1ð Þy\n\u0005 \u0006\nu\n0ð Þ\nx H 0ð Þ\nþ iH^\n1ð Þ\nkxu\n0ð Þ\nx\n@X 0ð Þ\n@z H\n0ð Þ\n: ðA13Þ\nSince\n@X 0ð Þ\n@z ¼ O(1\/a), the last equation can be written\nz^1 ¼ \u0001\nq^ 1ð Þx þ kykx q^ 1ð Þy\n\u0005 \u0006\nu\n0ð Þ\nx H 0ð Þ\nþ O aLxð Þ; ðA14Þ\nand the previous results about isochrones tracking stream-\nlines are immediately obtained. The flux gradient can be\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n15 of 17\nF02018\nrelated to terms in the Gudmundsson [2003] full-system\nsolution and the Hindmarsh [2004] longitudinal stress\ncorrection solution by the expression\n\u0001ikxq^ 1ð Þx ¼ \u0001w^ 1ð Þ \u0001 ikxðzH^ 1ð Þ þ b^ 1ð ÞÞ:\nA3. Heat Equation\n[70] In scaled form, the heat equation (7) is\n@tqþ u\u0003rqþ z\n#\u0003Q\u0001 #\u0003q\u0001 a\u0001 mð Þz\u0001 m\nH\n@zq\n¼ b\nH2\n@2z qþ b @x þ\n@x~Z\nH\n@z\n\u0011 \u00122\nqþ b @y þ @y\n~Z\nH\n@z\n\u0011 \u00122\nqþ cT\u0003e;\nðA15Þ\nwhich is equivalent to that given by Hindmarsh [1999,\nequation (36)], apart from the horizontal conduction terms\n(second and third terms on right-hand side), which follow\nsimply from the differential transforms for the normalized\ncoordinate. The parameters are given by\nb ¼ k\n~H*~v*\n;c ¼ e~r~g\n~H*\n~r~c\n: ðA16Þ\nLinearization and Fourier transformation of the scaled heat\nequation leads to\nlq^ 1ð Þ ¼ ikxu 0ð Þx q^ 1ð Þ þ\nw 0ð Þða\u0001 mÞ þ m\nH 0ð Þ\n@zq^ 1ð Þþ\nb\nH 0ð Þ2\n@2z q^\n1ð Þ \u0001 b kj j2q^ 1ð Þ þ b kj j2 @zq\n0ð Þ\nH 0ð Þ\n~b 1ð Þ\u0001\nw 0ð Þ a\u0001 mð Þ þ m\u0001 z kj j2b\nH 0ð Þ2\n@zq 0ð Þ þ 2 b\nH 0ð Þ3\n@2z q\n0ð Þ\n !\nH^ 1ð Þ\nþ i zk\n^\u0003Q 1ð Þ \u0001 k ^\u0003q 1ð Þ\nH 0ð Þ\n@zq 0ð Þ þ cT 0ð Þ\u0003~e 1ð Þ þ c~T 1ð Þ\u0003e 0ð Þ; ðA17Þ\nwith\nT 0ð Þ\u0003e^ 1ð Þ ¼ 2t 0ð Þxz e^ 1ð Þxz þ t 0ð Þxx e^ 1ð Þxx \u0001 e^ 1ð Þzz\n\u0005 \u0006\nðA18Þ\nT^ 1ð Þ \u0003 e 0ð Þ ¼ 2e 0ð Þxz t^ 1ð Þxz þ e 0ð Þxx t^ 1ð Þxx \u0001 t^ 1ð Þzz\n\u0005 \u0006\n: ðA19Þ\nAppendix B: Implementation of Sliding in the\nFinite Element Calculations\n[71] A commercial finite element (FE) program (MARC)\nhas been used to calculate the steady state geometry and its\nflow field of an inclined ice mass flowing over a perturbed\nbed. The program solves the full Stokes equations. The flow\nfield of this full-system (FS) model is then compared with\nthe flow field obtained from the shallow ice approximation\n(SIA) model for the steady state geometry and the boundary\nconditions as obtained and used in the FS model. For a full\ndescription of the calculations the reader is referred to\nRaymond and Gudmundsson [2005].\n[72] In this appendix all quantities are taken to be\ndimensional. The model geometry comprises a 2-D plane\nflow model, inclined at 3\f. Steady state surface geometry\nwas computed by evolving the surface geometry to a steady\nstate. The numerical calculations never suggested that there\nwas more than one steady configuration. Four different sets\nof experiments with varying amplitudes (0.1, 0.2) and\nwavelengths were computed for the following configura-\ntions: (1) undulating bed, comprising (set a) ice frozen to\nbed and (set b) ice mass sliding over bed with a constant\nsliding factor (Co = 10), and (2) flat bed, comprising (set c)\nsinusoidal perturbation in slipperiness and (set d) step\nchange in sliding behavior (no sliding-sliding-no sliding).\n[73] These results are compared with the flow field for the\nSIA model. This is not exactly the SIA model, as the surface\ngeometry used is the one computed using the FS velocity\nfield. However, the transfers of bed to surface for FS and SIA\nare rather similar [Gudmundsson, 2003; Raymond and\nGudmundsson, 2005], so this does not significantly distort\nthe results. The fluxes of the two models are compared by\nusing a flux normalized with the FS surface flux. In steady\nstate this is constant for plane flow. Therefore the normalized\nflux for the SIA model is obtained by integrating the velocity\nshape function over depth and for the FSmodel by integrating\nthe FS velocity over depth and dividing it by its surface flux.\n[74] To account for sliding at the glacier base, a relation\nbetween sliding velocity vb and basal shear traction tb is\nassumed,\nux bð Þ ¼ C xð Þtn0xz bð Þ; ðB1Þ\nwhere C(x) is the slip ratio and n0 a parameter to be specified\nLliboutry, 1968, 1979]. This relation for sliding is\nimplemented in the numerical model by adding a thin soft\nlayer at the glacier base [Schweizer and Iken, 1992; Vieli et\nal., 2000] with a flow law corresponding to equation (5) and\nwith flow parameters n0 and A0. Since the layer is thin, we\ncan assume that within this layer, the shallow ice\napproximation holds.\ne ¼ A0 tj jn0\u00011T:\n[75] In the FS model the rate factor A or A0 is used as an\ninput parameter. For the basal layer an A0(x) is calculated to\ncorrespond to the slip ratio C(x). From equation (B1) we\nknow that the C(x) is proportional to vb. For an ice slab with\nthickness h, with an underlying thin soft layer of thickness d\nand slope angle e the analytical solution of the basal\nvelocity vb at the ice interface in the shallow ice approxi-\nmation [Hutter, 1983] is\nux bð Þ ¼\nZ d\n0\n2A0tn\n0\nxzdz; ðB2Þ\nwhere the basal shear traction is given by\ntxz ¼ rg hþ d \u0001 zð Þ sin e: ðB3Þ\nThe basal velocity of the ice is then given by computing the\nintegral of equation (B2),\nux bð Þ ¼\nZ d\n0\n2A0 rg sin eð Þn0 hþ d \u0001 zð Þn0dz\n¼ 2A\n0\nn0 þ 1 rg sin eð Þ\nn0\nhþ dð Þ n0þ1ð Þ\u0001h n0þ1ð Þ\n\u0005 \u0006\n;\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n16 of 17\nF02018\nand using (B1) to obtain C(x). For the case of the thin soft\nbasal layer the flow exponent is chosen to be n0 = 1.\n[76] In the model experiments the mean slip ratio Co is\ngiven and used to calculate the rate factor A0. A sliding\nconstant A00o is defined by\nA00o ¼ Co\nn0 þ 1\n2\n1\nho þ dð Þ n0þ1ð Þ\u0001h n\n0þ1ð Þ\no\n: ðB4Þ\nThis value of A00o is used in the constant sliding experiments\n(section 5.2.2). It is also used in the definition of the\nsinusoidally varying sliding (section 5.2.3),\nA0 xð Þ ¼ A00o 1þ g cos kxxð Þð Þ; ðB5Þ\nwhere g is the amplitude of the perturbation. It is also used\nin the on-off sliding\nA0 xð Þ ¼ A00o 0 \u0006 x < L=3; 2L=3 \u0006 x < L ðB6Þ\nA0 xð Þ ¼ 0 L=3 \u0006 x < 2L=3: ðB7Þ\nFor the cases of constant slipperiness and sinusoidally\nvarying slipperiness, the mean slip ratio C0 = 10, while for\nthe cases of on\/off sliding, the slip ratio alternated between\n0 and 1.\n[77] The computational grid comprised (61 \u0010 31) nodes\n(fixed bed) (section 5.2.1). For the sliding cases extra nodes\nwere used to represent the thin deforming layer, which was\n2\/30th the thickness of the ice sheet for constant sliding with\na (61 \u0010 33) grid (x5.2.2), and for the spatially variable\nsliding a (61 \u0010 32) grid with a layer thickness of 1\/30\n(sections 5.2.3 and 5.2.4).\nAppendix C: SIA Shape Functions\n[78] As described by Paterson [1994, p. 251], where flow\nis by internal deformation only, the velocity at depth H(1-z),\ncan be written in terms of the mean velocity as\nux x; zð Þ ¼ \u0005u nþ 2\nnþ 1 1\u0001 1\u0001 zð Þ\nnþ1\n\u0005 \u0006\nðC1Þ\n¼ \u0005u xð Þu Dð Þ zð Þ; ðC2Þ\nwhere\nu Dð Þ zð Þ ¼ nþ 2\nnþ 1 1\u0001 1\u0001 zð Þ\nnþ1\n\u0005 \u0006\nðC3Þ\nis the shape function of the horizontal velocity with depth\nand is the mean velocity.\n[79] The flux of the SIA model can be calculated by\nmultiplying the surface flux from the FS model with the\nshape function of the flux with depth w(D)(z)\nw Dð Þ zð Þ ¼\nZ z\n0\nu Dð Þ zð Þdz0 ðC4Þ\n¼ nþ 2ð Þzþ 1\u0001 zð Þ\nnþ2\u00011\nnþ 1 : ðC5Þ\nFor pure basal sliding,\nu Sð Þ zð Þ ¼ 1;w Sð Þ zð Þ ¼ z; ðC6Þ\nwhile for combinations of internal deformation and basal\nsliding,\nu zð Þ ¼ 1\n1þ C u\nDð Þ zð Þ þ C\n1þ C u\nSð Þ zð Þ ðC7Þ\nw zð Þ ¼ 1\n1þ C w\nDð Þ zð Þ þ C\n1þ C w\nSð Þ zð Þ: ðC8Þ\n[80] Acknowledgment. This work was supported by NERC grant\nNER\/A\/S\/2001\/01011 ‘‘Calculation of ice accumulation rates in Antarctica\nover the last glacial cycle.’’\nReferences\nBlatter, H. (1995), Velocity and stress-fields in grounded glaciers: A simple\nalgorithm for including deviatoric stress gradients, J Glaciol., 41(138),\n333–344.\nGudmundsson, G. H. (1997), Basal flow characteristics of a non-linear flow\nsliding frictionless over strongly undulating bedrock, J. Glaciol., 42(143),\n80–89.\nGudmundsson, G. H. (2003), Transmission of basal variability to a glacier\nsurface, J. Geophys. Res., 108(B5), 2253, doi:10.1029\/2002JB002107.\nHempel, L., F. Thyssen, N. Gundestrup, H. B. Clausen, and H. Miller\n(2000), A comparison of radio-echo sounding data and electrical conduc-\ntivity of the GRIP ice core, J. Glaciol., 46(154), 369–374.\nHindmarsh, R. C. A. (1999), On the numerical computation of temperature\nin an ice-sheet, J. Glaciol., 45(151), 568–574.\nHindmarsh, R. C. A. (2004), A numerical comparison of approximations to\nthe Stokes equations used in ice-sheet and glacier modeling, J. Geophys.\nRes., 109, F01012, doi:10.1029\/2003JF000065.\nHindmarsh, R. C. A., and K. Hutter (1988), Numerical fixed domain map-\nping solution of free surface flows coupled with an evolving interior field,\nInt. J. Numer. Anal. Methods Geomech., 12, 437–459.\nHutter, K. (1983), Theoretical Glaciology, D. Riedel, Norwell, Mass.\nLeysinger Vieli, G. J.-M. C., and G.H. Gudmundsson (2004), On estimating\nlength fluctuations of glaciers, J. Geophys. Res., 109, F01007,\ndoi:10.1029\/2003JF000027.\nLliboutry, L. A. (1968), General theory of subglacial cavitation and sliding\nof temperate glaciers, J. Glaciol., 7(49), 21–58.\nLliboutry, L. A. (1979), Local friction laws for glaciers: A critical review\nand new openings, J. Glaciol., 23(89), 67–95.\nPaterson, W. S. B. (1994), Physics of Glaciers, third ed., Elsevier, New\nYork.\nPattyn, F. (2002), Ice-flow characteristics over a rough bedrock: Implica-\ntions for ice-core interpretation, Polar Meteorol. Glaciol., 16, 42–52.\nRaymond, M. J., and G. H. Gudmundsson (2005), On the relationship\nbetween surface and basal properties on glaciers, ice sheets, and ice\nstreams, J. Geophys. Res., 110, B08411, doi:10.1029\/2005JB003681.\nReeh, N., and W. Paterson (1988), Application of a flow model to the ice-\ndivide region of Devon Island ice cap, Canada, J. Glaciol., 34(116), 55–\n63.\nSchweizer, J., and A. Iken (1992), The role of bed separation and friction in\nsliding over an undeformable bed, J. Glaciol., 38(128), 77–92.\nVieli, A., M. Funk, and H. Blatter (2000), Tidewater glaciers: Frontal flow\nacceleration and basal sliding, Ann. Glaciol., 31, 217–221.\nWeertman, J. (1976), Sliding–no sliding zone effect and age determination\nof ice cores, Quat. Res., 6, 203–207.\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\nG. H. Gudmundsson and R. C. A. Hindmarsh, British Antarctic Survey,\nHigh Cross, Madingley Road, Cambridge CB3 0ET, UK. (ghg@bas.ac.uk;\nrcah@bas.ac.uk))\nG. J.-M. C. Leysinger Vieli, Bristol Glaciology Center, School of\nGeographical Sciences, University of Bristol, Bristol BS8 1SS, UK.\n(g.leysinger-vieli@bristol.ac.uk)\nM. J. Raymond, Laboratory of Hydraulics, Hydrology and Glaciology,\nEidgenossische Technische Hochschule (VAW ETH), CH-8092, Zurich,\nSwitzerland. (melanie.raymond@ethz.ch)\nF02018 HINDMARSH ET AL.: RADAR LAYER ARCHITECTURE\n17 of 17\nF02018\n"}