{"doi":"10.1103\/PhysRevLett.101.196803","coreId":"69949","oai":"oai:eprints.lancs.ac.uk:19751","identifiers":["oai:eprints.lancs.ac.uk:19751","10.1103\/PhysRevLett.101.196803"],"title":"Adsorbate-limited conductivity of graphene","authors":["Robinson, John P.","Schomerus, Henning","Oroszlany, Laszlo","Falko, Vladimir I."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-11-05","abstract":"We present a theory of electronic transport in graphene in the presence of randomly placed adsorbates. Our analysis predicts a marked asymmetry of the conductivity about the Dirac point, as well as a negative weak-localization magnetoresistivity. In the region of strong scattering, renormalization group corrections drive the system further towards insulating behavior. These results explain key features of recent experiments, and are validated by numerical transport computations","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69949.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/19751\/1\/pdfpreprint.pdf","pdfHashValue":"759828a732b389695cd4fea41f127b34c89ffbdc","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:19751<\/identifier><datestamp>\n      2018-01-24T02:33:20Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Adsorbate-limited conductivity of graphene<\/dc:title><dc:creator>\n        Robinson, John P.<\/dc:creator><dc:creator>\n        Schomerus, Henning<\/dc:creator><dc:creator>\n        Oroszlany, Laszlo<\/dc:creator><dc:creator>\n        Falko, Vladimir I.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We present a theory of electronic transport in graphene in the presence of randomly placed adsorbates. Our analysis predicts a marked asymmetry of the conductivity about the Dirac point, as well as a negative weak-localization magnetoresistivity. In the region of strong scattering, renormalization group corrections drive the system further towards insulating behavior. These results explain key features of recent experiments, and are validated by numerical transport computations.<\/dc:description><dc:date>\n        2008-11-05<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/19751\/7\/PhysRevLett.101.196803.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevLett.101.196803<\/dc:relation><dc:identifier>\n        Robinson, John P. and Schomerus, Henning and Oroszlany, Laszlo and Falko, Vladimir I. (2008) Adsorbate-limited conductivity of graphene. Physical Review Letters, 101 (19). ISSN 1079-7114<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/19751\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1103\/PhysRevLett.101.196803","http:\/\/eprints.lancs.ac.uk\/19751\/"],"year":2008,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"Adsorbate-limited conductivity of graphene\nJohn P. Robinson, Henning Schomerus, La´szlo´ Oroszla´ny, and Vladimir I. Fal’ko\nDepartment of Physics, Lancaster University, Lancaster, LA1 4YB, United Kingdom\n(Dated: November 5, 2008)\nWe present a theory of electronic transport in graphene in the presence of randomly placed adsor-\nbates. Our analysis predicts a marked asymmetry of the conductivity about the Dirac point, as well\nas a negative weak-localization magnetoresistivity. In the region of strong scattering, renormaliza-\ntion group corrections drive the system further towards insulating behavior. These results explain\nkey features of recent experiments, and are validated by numerical transport computations.\nPACS numbers: 73.63.-b, 72.10.Bg, 73.63.Bd, 81.05.Uw\nGraphene (the two-dimensional allotrope of carbon [1])\noffers a chemically stable platform to host various chemi-\ncal adsorbates [2–7]. Their presence strongly affects elec-\ntronic transport, making graphene based devices suit-\nable for chemical sensoring. A key observation in exper-\niments on chemically functionalized samples is a marked\nasymmetry of the conductivity as a function of a back\ngate voltage, which is used to steer the system across\nthe charge neutrality point (the Dirac point, which sep-\narates the valence band from the conduction band). The\nconductivity becomes symmetric only when the sample\nis annealed by a strong bias current which dislodges the\nadsorbates.\nIn this paper we provide a theory, supported by numer-\nical simulations, that explains this experimental feature.\nOur model is based on the tight-binding description of\nelectrons in graphene [8]. Chemisorbed molecules are in-\ncorporated into this description as laterally attached ad-\nditional sites, where the onsite and coupling energies are\nextracted from the band structure of a graphene sheet\nwith regularly placed adsorbates. Each type of adsor-\nbate introduces a characteristic local energy dependent\nscattering potential in the graphene, and suppresses the\nconductivity on one side of the Dirac point, with only a\nweak effect on the other. For example, adsorbed H+\nyields almost insulating behavior in n-type graphene,\nwhile in p-type structures the conductivity is close to\nthat of clean material. For OH− the role of the bands\nis reversed. When combined with scattering from a ran-\ndom Coulomb potential [9, 10], the resulting conductivity\ntraces (shown in Fig. 1) are consistent with the findings\nin experiments [5, 6]. For a small adsorbate concentra-\ntion, these conclusions can be drawn from kinetic theory.\nFor larger concentrations, we implement a recently pro-\nposed renormalization group (RG) analysis [12, 13] to\naccount for systematic quantum corrections to the con-\nductivity resulting from multi-adsorbate scattering. Our\npredictions are in good quantitative agreement with the\nresults of the numerical transport computations.\nIn a graphene sheet, the carbon atoms are held to-\ngether via sp2-hybridized covalent bonds, while the elec-\ntronic transport takes place by hopping along pi orbitals\nwhich can participate in covalent bonding with adsor-\n 0\n 0.01\n 0.02\n   \nσ \nn\nlβ\n\/[\n2\ne\n2\n\/h\n]\n \nH\n+(a)\n0\n1\n2\n5\n10\n20\n50\nx =\n 0\n 0.01\n 0.02\n-0.005 0 0.005\nσ \nn\nlβ\n\/[\n2\ne\n2\n\/h\n]\nne\nOH\n–(b) 0\n5\n10\n20\n50\n100\nFIG. 1: (Color online) Conductivity of graphene in the pres-\nence of adsorbates (concentration ni) and Coulomb impurities\n(concentration nl) as a function of charge carrier concentra-\ntion ne (carrier density ne\/Ac with Ac = 3\n√\n3a2\/4 the area\nper carbon atom), for various ratios ni\/nl = (β\/2pi)x where\nthe dimensionless parameter β ' 1 characterizes the scatter-\ning strength of the Coulomb impurities [9–11]. (a) H+, (b)\nOH−, with parameters from first-principle computations (the\ninsets illustrate sample segments). The results are based on\nEq. (7).\nbates. The electrons in the pi-band of graphene with ad-\nditional adsorbed atoms can be described using a tight-\nbinding Hamiltonian\nH = −γ\n∑\n〈l,m〉\nc†l cm +\n∑\nn\nHn, (1a)\nHn = εid†ndn + γi(c†αndn + cαnd†n). (1b)\n2The first term of Eq. (1a) corresponds to the Hamilto-\nnian of clean graphene, where cl are annihilation opera-\ntors on sites of the honeycomb lattice, and the nearest-\nneighbor coupling strength γ = 2~vD\/3a (with bond\nlength a = 1.42 A˚) determines the Fermi velocity vD at\nthe Dirac point. Each adsorbed molecule contributes a\nterm of the form (1b), where dn is the annihilation oper-\nator on the adsorbate site and αn is the host position on\nthe honeycomb lattice. The adsorbate density is param-\neterized by ni\/Ac, where ni is the adsorbate-to-carbon\nratio, and Ac = 3\n√\n3a2\/4 is the area per carbon atom in\ngraphene.\nThe model Hamiltonian (1) can be justified by first-\nprinciple calculations. Here we consider the adsorbates\nH+ and OH−, chosen because of the presence of ambi-\nent water in many experiments, and which also can be\nselectively driven towards the graphene via electric fields\n[3]. Using the SIESTA algorithm [14], we find that H+\nis described by εi = 0.66 γ, γi = 2.2 γ, while for OH−\nεi = −2.9 γ, γi = 2.3 γ. These energies are comparable\nto the graphene hopping energy γ = 2.6 eV, which neces-\nsitates the nonperturbative approaches employed in this\npaper. Our DFT calculations also confirm that the ad-\nsorbates form covalent bonds to well-defined host sites.\nIn the fully relaxed configuration, both adsorbates are\naligned in the vertical direction of the graphene sheet\n(for illustration, see insets of Fig. 1). Other energy scales\n(such as shifts of the graphene onsite energies and next-\nto-nearest neighbor couplings) are small and can be safely\nneglected [15, 16].\nThe main building block of our analytical considera-\ntions is the derivation of the scattering amplitude due to\nindividual adsorbates, which enters the collision term of\nkinetic theory and also features as input into the renor-\nmalization group analysis that captures quantum correc-\ntions due to multiple scattering.\nIn the first step we self-consistently eliminate the ad-\nsorbate sites from the Hamiltonian (1) via a decimation\nprocedure. The electron wavefunction can be written as\n|Ψ〉 = ∑l ψl |l〉 + ∑n φn |n〉ad ≡ |ψ〉 ⊕ |φ〉, where the\namplitudes ψl and states |l〉 refer to the carbon sites,\nwhile φn and |n〉ad refer to the adsorbate sites. We\nnow project the Schro¨dinger equation onto an adsorbate\nsite, 〈n|ad (ε − H) |Ψ〉 = 0 and find that the amplitude\nφn = ψαnγi\/(ε− εi) on the adsorbate is related to the\namplitude of its host carbon site. The amplitudes φn\nhence can be eliminated, which results in the reduced\nHamiltonian\nH˜ = −γ\n∑\n〈l,m〉\nc†l cm +\n∑\nn\nV c†αncαn , V =\nγ2i\nε− εi , (2)\nwhere the energy-dependent effective potential V corre-\nsponds to the self-energy which an adsorbate induces for\nelectrons in graphene.\nWhile the effective potential V displays a distinct res-\nonant energy dependence, the analysis of the resulting\nconductivity properties requires combining this with the\nspecific energetics of the graphene sample, and in partic-\nular, with the existence of the conical point at which the\ndensity of states drops to zero. We therefore now turn to\nthe analysis for the Green’s function G = (ε−H+ i0+)−1\nof the system.\nFor a single, well isolated adsorbate, the Green’s func-\ntion can be obtained exactly over the entire energy range\nby utilizing the T -matrix representation\nG = G0 + G0T G0, T ≡ (1− V c†αcαG0)−1V c†αcα, (3)\nwhere G0 is the Green’s function of the clean graphitic\nsystem and T characterizes the scattering strength [17].\nExpanding T in powers of V G0, and utilizing the trans-\nlational and crystalline symmetries of graphene (so that\n〈n|G0|n〉 ≡ g0 for all n), the resulting series for G can be\nresummed yielding\nT = t0(ε)c†αcα, t0(ε) =\nγ2i\nε− εi − γ2i g0(ε)\n. (4)\nIn the latter expression, t0(ε) describes resonant scat-\ntering of electrons in graphene from an adsorbate level\nrenormalized by hybridization with states in the pi-band.\nThis hybridization always shifts the effective resonance\nlevel towards the Dirac point, which can be understood\nas a consequence of level repulsion which pushes addi-\ntional states towards the region with the lowest density\nof states. The real part of γ2i g0(\u000f) [with Re g0(ε) =\n−Re g0(−ε) ≈ (Ac\/2pi~2v2D)ε ln(|ε|\/∆), and ∆ a high-\nenergy cut-off] gives a formal description of this sys-\ntematic shift, while the imaginary part [with Im g0 =\n−piν0(ε), and ν0(ε) the density of states per carbon atom]\nindicates a decrease of the resonance width near the Dirac\npoint.\nIgnoring (for the moment) the effects of phase-coherent\nmultiple scattering off the adsorbates, the conductivity of\na disordered sample with a finite adsorbate concentration\nni can now be obtained in kinetic transport theory. Due\nto C6 rotational symmetry of graphene, the conductivity\nis isotropic. Using the scattering rate obtained from (4),\nτ−1k =\n(\n2pi\n~\n)\nni|t0(εk)|2ν0(εk), (5)\nwhere εk is the graphene dispersion relation, we find the\nconductivity of graphene in presence of the adsorbates,\nσ =\n(\ngse\n2\nh\n)\n~2\nAcni|t0(εF)|2\n〈vk〉εF\n〈v−1k 〉εF\n, (6)\nwhere 〈. . .〉εF denotes integration along the Fermi line,\nvk ≡ |∇kεk|\/~, and gs = 2 accounts for spin degeneracy.\nMotivated by recent experimental findings for selec-\ntively adsorbed H+ and OH− [3], we show in Fig. 2 the\ncorresponding dependence of the conductivity in Eq. (6)\n30\n0.1\n0.2\n0.3\n0.4\n   \nσ\n \nn\ni\/[\n2e\n2 \/h\n]\n \nrenormalization group\n(a) H+kinetic theory\nni=0.001\n0.02\n0.05\n0.1\n  \n  \n  \n  \n  \n   \n \n \ntransport computations\nkinetic theory\nni=0.001\n0.02\n0.05\n0.1\n0\n0.2\n0.4\n0.6\n0.8\n1\n-0.5 0 0.5\nσ\n \nn\ni\/[\n2e\n2 \/h\n]\nεF\/γ\n(b) OH–\n  \n  \n  \n  \n  \n  \n-0.5 0 0.5\n \nεF\/γ\n 0  7\n 0\n0.03\nln(L\/a)\nα0\nβ⊥\nβz,γ⊥\nγz\nFIG. 2: (Color online) Conductivity of graphene in the pres-\nence of adsorbates of variable concentration ni. (a) H\n+, (b)\nOH−. The dashed thick curve is the prediction (6) of kinetic\ntransport theory with energy-dependent T -matrix (4). The\nsolid curves in the left panels show the expected quantum\ncorrections based on the renormalization group analysis [Eqs.\n(10)]. In the right panels, the solid curves show the results of\nnumerical transport computations. The inset in the left panel\nof (b) shows the RG flow (10) of the dimensionless scattering\nparameters for OH− at ε = −0.15γ and ni = 0.01.\non the Fermi energy (thick dashed curve). A key fea-\nture is the marked asymmetry of the conductivity about\nthe Dirac point caused by the energy dependence of the\nT matrix (4). For H+, over a range of energies in the\nconduction band the conductivity is small, while it rises\nlinearly as one moves into the valence band, or far into\nthe conduction band. For OH− the role of the bands is\nreversed.\nIn actual devices, adsorbate scattering is supplemented\nby scattering off localized charges. These contribute to\nthe scattering rate a term τ−1l = nlβγ\n2\/(~|ε|), where nl\nis the number of localized charges per carbon atom, and\nβ ' 1 is a dimensionless numerical factor [9, 10]. For en-\nergies in the linear part of the clean graphene dispersion\nrelation, the resulting conductivity can be written in the\nform\nσ =\n2pi\n√\n3\nnlβ\ngse\n2\nh\n(\nx|t0(ne)\/γ|2 + n−1e\n)−1\n, (7)\nwhere x = (2pi\/β)(ni\/nl) characterizes the relative\namount of the two types of disorder, and ne =\ngsε\n2\nF\/(2\n√\n3piγ2) is the number of charge carriers per car-\nbon atom. Figure 1 shows the charge carrier dependence\nof the conductivity for various values of x. For x = 0 the\nconductivity shows the symmetric linear charge-carrier\ndependence characteristic for charged impurity scatter-\ning. For an increasing adsorbate concentration, the\nconductivity develops the marked asymmetry discussed\nabove, while the Coulomb scattering only dominates very\nclose to the Dirac point, where it results in an additional\ndip.\nDifferent types of disorder can also be discriminated\nvia mesoscopic corrections to the conductivity, which\noriginate in phase-coherent multiple scattering. In gen-\neral, disorder in graphene can be characterized in terms\nof five dimensionless parameters Γ = {α0, β⊥, βz, γ⊥, γz},\nwhich classify the breaking of the symmetries of the hon-\neycomb lattice [18]. Three of these parameters describe\nintravalley scattering preserving the C6v symmetry (α0),\nthe C3v symmetry (γz), or no point symmetry (γ⊥),\nrespectively. Analogously, intervalley scattering is de-\nscribed by the parameters βz and β⊥. In terms of these\nparameters, the conductivity of graphene in kinetic the-\nory takes the form\nσ =\ngse\n2\n~pi2\n(\nα0\n2\n+ β⊥ + γ⊥ +\n3\n2\nβz +\n3\n2\nγz\n)−1\n. (8)\nThe scattering potential for adsorbates is such that\nα0 = γz = β⊥\/2 =\nAcni|t0(εF)|2\n2pi〈vk〉εF\/〈v−1k 〉εF\n, βz = γ⊥ = 0.\n(9)\nThis puts chemically functionalized graphene into the so-\ncalled orthogonal symmetry class, for which one expects\na negative weak-localization magnetoresistance [18], as\nwell as strong Anderson localization when the adsorbate\nconcentration increases [12].\nThese corrections to kinetic theory can be studied sys-\ntematically via a renormalization group analysis [19],\nwhich provides effective scattering parameters Γ˜ that re-\nplace the bare values in Eq. (8). For disorder represen-\ntative of the symmetries in graphene, the flow equations\nwere derived in Ref. [12]. An equivalent formulation in\nterms of the parameters Γ given above can be found in\nRef. [13], and takes the form\nα˙0 = 2α0(α0 + β⊥ + γ⊥ + βz + γz) + β⊥βz + 2γ⊥γz,\n˙β⊥ = 4(α0βz + β⊥γ⊥ + βzγz),\nβ˙z = 2(α0β⊥ − βzα0 + β⊥γz + βzγz),\n˙γ⊥ = 4α0γz + β2⊥ + β\n2\nz ,\nγ˙z = 2γz(−α0 − β⊥ + βz + γ⊥ − γz) + 2α0γ⊥ + β⊥βz,\nε˙ = ε(1 + α0 + β⊥ + γ⊥ + βz + γz), (10)\nwhere X˙ ≡ dX\/d ln(L\/a) and L is a running length.\nThis RG flow is integrated using the bare parameters Γ\nand ε = εF as initial conditions and terminated when ε\nreaches a high-energy cutoff εc. We here implement this\nprocedure for the energy-dependent initial conditions (9).\nA typical solution of the flow equations as a function of\nln(L\/a) is shown in the inset in Fig. 2(b) (left panel).\nThe dominance of β⊥ over γz and γ⊥ demonstrates that\n4chemically functionalized graphene stays in the orthogo-\nnal symmetry class when the adsorbate concentration is\nincreased. As shown by the curves in the left panels of\nFig. 2, over the whole energy range and for both types of\nadsorbates (H+ and OH−) the renormalization leads to\na suppression of the conductivity and drives the system\ntowards insulating behavior.\nIn order to verify these expectations we carried out nu-\nmerical transport computations, which are directly based\non the model Hamiltonian (1). The conductivity σ is ob-\ntained by finite-size scaling of the Landauer conductance\nG = σW\/L of graphene ribbons with respect to width (in\nthe range 50 < W\/\n√\n3a < 100) and length (in an adap-\ntively chosen range that avoids the onset of Anderson\nlocalization [20]). For each geometry the conductance\nis computed in an efficient recursive Green’s functions\nalgorithm [21], and averaged over 104 disorder realiza-\ntions. The resulting dependence of the conductivity on\nthe Fermi energy (right panels of Fig. 2) is in good agree-\nment with the expectations based on the RG analysis\n(left panels of Fig. 2). In particular, the numerical re-\nsults clearly confirm the suppression of the conductivity\ndue to quantum corrections.\nIn summary, we have presented a theory of electronic\ntransport for graphene in the presence of chemisorbed\nmolecules. We find that each type of adsorbate results\nin a characteristic Fermi-energy dependence of the con-\nductivity, which is asymmetric about the charge neu-\ntrality point and distinguishes p- and n-type transport.\nIn a range of energies, the conductivity is strongly sup-\npressed, which could be used to increase the on-off ratio\nin graphene-based field-effect transistors. These effects\nare further enhanced by quantum corrections driving the\nsystem towards the localized state at higher adsorbate\nconcentrations. In experiments, the adsorbate concen-\ntration can be increased by variable deposition times,\nor by driving adsorbates to the sample using top gates\n[3, 5, 6], while the localization effects can be probed via\nmagnetoresistivity experiments on graphene flakes at low\ntemperatures [22].\nWe wish to thank Tim Echtermeyer for providing us\nwith experimental data supporting the conclusions of\nthis work, and gratefully acknowledge discussions with\nI. Aleiner, C. Lambert, A. Mirlin, and E. McCann. This\nwork was supported by the European Commission, Marie\nCurie Excellence Grant MEXT-CT-2005-023778, and by\nthe EPSRC.\n[1] A. H. Castro Neto, F. Guinea, N. M. R. Peres, K. S.\nNovoselov, and A. K. Geim, arXiv:0709.1163 (2007).\n[2] F. Schedin, A. K. Geim, S. V. Morozov, D. Jiang, E. H.\nHill, P. Blake, and K. S. Novoselov, Nature Materials 6,\n652 (2007).\n[3] T. J. Echtermeyer, M. C. Lemme, M. Baus, B. N.\nSzafranek, A. K. Geim, and H. Kurz, IEEE Electron De-\nvice Letters 29, 952 (2008).\n[4] K. I. Bolotin, K. J. Sikes, Z. Jiang, M. Klima, G. Fuden-\nberg, J. Hone, P. Kim, and H. L. Stormer, Solid State\nCommunications 146, 351 (2008).\n[5] Z. Chen, Y. Lin, M. J. Rooks, and P. Avouris, Physica E\n40, 228 (2007).\n[6] M. C. Lemme, T. J. Echtermeyer, M. Baus, and H. Kurz,\nIEEE Electron Device Letters 28, 282 (2007).\n[7] J. H. Chen, C. Jang, M. S. Fuhrer, E. D. Williams, and\nM. Ishigami, Nature Physics 4, 377 (2008).\n[8] R. Saito, G. Dresselhaus, and M. S. Dresselhaus, Physical\nproperties of carbon nanotubes (Imperial College Press,\nLondon, 1998).\n[9] K. Nomura and A. H. MacDonald, Phys. Rev. Lett. 98,\n076602 (2007); V. V. Cheianov and V. I. Fal’ko, Phys.\nRev. Lett. 97, 226801 (2006).\n[10] E. H. Hwang, S. Adam and S. Das Sarma, Phys. Rev.\nLett. 98, 186806 (2007).\n[11] The limit |ne| = 0.005 of the range plotted in Fig. 1\ncorresponds to a charge-carrier density |ne|\/Ac = 1.9 ×\n1013 cm−2 and a Fermi energy |εF| = 0.165 γ.\n[12] I. L. Aleiner and K. B. Efetov, Phys. Rev. Lett. 97,\n236801 (2006); M. S. Foster and I. L. Aleiner, Phys. Rev.\nB 77, 195413 (2008).\n[13] P. M. Ostrovsky, I. V. Gornyi, and A. D. Mirlin, Phys.\nRev. B 74, 235443 (2006).\n[14] J. M. Soler, E. Artacho, J. D. Gale, A. Garc´ıa, J. Jun-\nquera, P. Ordejo´n, and D. Sa´nchez-Portal, J. Phys.: Con-\ndens. Matter 14, 2745 (2002).\n[15] L. Jeloaica and V. Sidis, Chem. Phys. Lett 300, 157\n(1999).\n[16] We also ignore effects of adsorbate-induced magnetism\nsuch as studied, e.g., in D. W. Boukhvalov, M. I. Kat-\nsnelson, and A. I. Lichtenstein, Phys. Rev. B 77, 035427\n(2008); B. Uchoa, V. N. Kotov, N. M. R. Peres, and A.\nH. Castro Neto, Phys. Rev. Lett. 101, 026805 (2008).\n[17] For static impurities see, e.g., Yu. V. Skrypnyk and V.\nM. Loktev, Phys. Rev. B 73, 241402(R) (2006).\n[18] E. McCann, K. Kechedzhi, Vladimir I. Fal’ko, H.\nSuzuura, T. Ando, and B. L. Altshuler, Phys. Rev. Lett.\n97, 146805 (2006).\n[19] A. W. W. Ludwig, M. P. A. Fisher, R. Shankar, and G.\nGrinstein, Phys. Rev. B 50, 7526 (1994).\n[20] J. P. Robinson and H. Schomerus, unpublished.\n[21] J. P. Robinson and H. Schomerus, Phys. Rev. B 76,\n115430 (2007).\n[22] F. V. Tikhonenko, D. W. Horsell, R. V. Gorbachev, and\nA. K. Savchenko, Phys. Rev. Lett. 100, 056802 (2008).\n"}