{"doi":"10.1111\/j.1748-5991.2007.00004.x","coreId":"206320","oai":"oai:eprints.lse.ac.uk:14845","identifiers":["oai:eprints.lse.ac.uk:14845","10.1111\/j.1748-5991.2007.00004.x"],"title":"From government to governance: external influences on business risk management","authors":["Hutter, Bridget M.","Jones, Clive J"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-03","abstract":"The influence of external organizations and pressures on business risk management practices has hitherto been examined through the influence of state regulatory regimes on businesses. This article concentrates on key socio-legal concerns about the influence of the law in social and economic life. We know that the sources of regulation and risk management are diversifying beyond the state. What we do not have is much empirically informed research about the range of sources influencing the business world and in particular the weighting of influence exercised by them. In this paper we explore the understandings regulatory actors have of the different external pressures on business risk management through an empirical study of the understandings of those in the food retail sector about the management of food safety and food hygiene risks. A broader objective is to throw some further light onto the debate about regulation within and beyond the state","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/206320.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/14845\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Hutter%2C%20B_From%20government%20to%20governance_Hutter_From%20government%20to%20governance_2015.pdf","pdfHashValue":"8670198fddbe89d90bd9cf0e914e35989bd996ca","publisher":"Wiley-Blackwell Publishing Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:14845<\/identifier><datestamp>\n      2015-02-20T12:29:42Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D534F<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F38<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/14845\/<\/dc:relation><dc:title>\n        From government to governance: external influences on business risk management<\/dc:title><dc:creator>\n        Hutter, Bridget M.<\/dc:creator><dc:creator>\n        Jones, Clive J<\/dc:creator><dc:subject>\n        JZ International relations<\/dc:subject><dc:subject>\n        HD61 Risk Management<\/dc:subject><dc:subject>\n        K Law (General)<\/dc:subject><dc:description>\n        The influence of external organizations and pressures on business risk management practices has hitherto been examined through the influence of state regulatory regimes on businesses. This article concentrates on key socio-legal concerns about the influence of the law in social and economic life. We know that the sources of regulation and risk management are diversifying beyond the state. What we do not have is much empirically informed research about the range of sources influencing the business world and in particular the weighting of influence exercised by them. In this paper we explore the understandings regulatory actors have of the different external pressures on business risk management through an empirical study of the understandings of those in the food retail sector about the management of food safety and food hygiene risks. A broader objective is to throw some further light onto the debate about regulation within and beyond the state.<\/dc:description><dc:publisher>\n        Wiley-Blackwell Publishing Ltd<\/dc:publisher><dc:date>\n        2007-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/14845\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Hutter%2C%20B_From%20government%20to%20governance_Hutter_From%20government%20to%20governance_2015.pdf<\/dc:identifier><dc:identifier>\n          Hutter, Bridget M. and Jones, Clive J  (2007) From government to governance: external influences on business risk management.  Regulation and Governance, 1 (1).  pp. 27-45.  ISSN 1748-5991     <\/dc:identifier><dc:relation>\n        http:\/\/www.blackwellpublishing.com\/journal.asp?ref=1748-5983&site=1<\/dc:relation><dc:relation>\n        10.1111\/j.1748-5991.2007.00004.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/14845\/","http:\/\/www.blackwellpublishing.com\/journal.asp?ref=1748-5983&site=1","10.1111\/j.1748-5991.2007.00004.x"],"year":2007,"topics":["JZ International relations","HD61 Risk Management","K Law (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nBridget M. Hutter and Clive J. Jones \nFrom government to governance: external \ninfluences on business risk management \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nHutter, Bridget M. and Jones, Clive J (2007) From government to governance: external \ninfluences on business risk management. Regulation and Governance, 1 (1). pp. 27-45. ISSN \n1748-5991  \n \nDOI: 10.1111\/j.1748-5991.2007.00004.x  \n \n© 2007 The Authors © Journal compilation © Blackwell Publishing Asia Pty Ltd \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/14845\/ \n \nAvailable in LSE Research Online: February 2015 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \n1 \n \n \nFrom Government to Governance: \nExternal Influences on Business Risk Management \nProfessor Bridget M. Hutter and Mr. Clive J. Jones1 \nAbstract \nThe influence of external organizations and pressures on business \nrisk management practices has hitherto been examined through the \ninfluence of state regulatory regimes on businesses. This literature \nconcentrates on key socio-legal concerns about the influence of the \nlaw in social and economic life. We know that the sources of \nregulation and risk management are diversifying beyond the state. \nWhat we do not have is much empirically informed research about \nthe range of sources influencing the business world and in particular \nthe weighting of influence exercised by them. In this paper we will \nexplore the understandings regulatory actors have of the different \nexternal pressures upon business risk management through an \nempirical study of the understandings of those in the food retail \nsector about the management of food safety and food hygiene risks. \nA broader objective is to throw some further light onto the debate \nabout regulation within and beyond the state. \n \nKey Words: Governance, Risk Management, Regulation, Food safety, \nNon State Actors \n \n \n2 \nIntroduction \n \nOne aim of many modern regulatory regimes is to influence the risk \nmanagement practices of organizations.  The objective is to get \norganizations to prioritise risk management practices high relative to \nother organizational objectives. Regulation2 is part of a structuring \nprocess which helps constitute order in economic life (Ayres and \nBraithwaite, 1992).  It aims to shape motives and preferences and \npenetrate business organizations’ objectives and practices (Shearing, \n1993).   \n \nResearch has focused on the way in which state regulatory regimes \nimpact on business organizations.  The literature identifies a number \nof factors which influence the impact of regulatory law on businesses \nand indicates that state influence through law is a necessary but not \nsufficient influence upon business risk management (Gunningham \nand Kagan 2005; Hutter 2001). There is increasing acknowledgement \nthat regulatory space is occupied by the state and a variety of non-\nstate players, and that there is a move to outsource public \nmanagement functions (Hancher and Moran 1989; Hutter, 2006; \nOsborne and Gaebler 1992; Scott 2001). This is central to \ndiscussions of the move from government to governance.  \n \nConcerns about the limits of state activities led in the late 1980s and \nearly 1990s to debates about a crisis in state regulation. This \nprompted policy discussions which advocated a regulatory mix in \nwhich the state harnesses sources of regulation beyond the state \n(Ayres and Braithwaite, 1992; Gunningham and Grabosky, 1998).  \nThis was also seen as a means of empowering different participants \nin the regulatory process in order to maximize the promotion and \nachievement of risk management. A series of studies have \nhighlighted the importance of focusing on the interplay of economic, \n3 \npolitical and social forces in understanding corporate regulatory \nfactors. Also relevant is their interaction with the internal \norganization of a business and the views and behaviours of its \nmanagement and employees.3  \n \nThis paper addresses a neglected issue in all of these discussions in \nits consideration of how well these academic discussions resonate \nwith the regulatory knowledge of those subject to regulation.  Do \nthey recognize regulation beyond the state? If so, which external \ninfluences are in play?  How important are they in relation to state \nregulatory influences?  And what is the nature of their influence? \n \nThe research we draw on focuses on the ways in which businesses in \nthe food sector in the UK understand and manage food safety and \nfood hygiene risks. Data were collected in two phases from \nbusinesses in south-east England and Scotland. The first phase \ninvolved consultations with 49 experts related to the food industry.4 \nDiscussions, which lasted on average an hour,  were broad-ranging \nand offered a variety of perspectives on the state of food safety and \nfood hygiene in the retail and catering sectors in the UK. The second \nphase comprised a questionnaire survey which was structured \naccording to business type; notably the food retail and catering \nsectors and the size of business.5 A total of 204 individuals across 31 \nbusinesses responded to the survey6. \n \nExternal influences on business risk management: economic \nand civil \n \nAnalytically we can identify two sources of regulation which are \nautonomous and independent from the state, namely the economic \nsector and civil society (Hutter, 2006). The economic sphere includes \n4 \na broad range of profit motivated organizations and activities \nembracing, for example, finance and industry. These include industry \nor trade organizations and companies themselves. There are also \nimportant hybrid forms of self-regulation, for example, enforced self-\nregulation which involves a mix of state and corporate regulatory \nefforts (Braithwaite 1982; Coglianese and Lazer, 2003). Some \nmarket participants sell risk management products and risk \nmanagement advice, for example, insurance companies and \nconsultancies. Others may exercise influence through their \ninvestment or consumer choices.  \n \nThe term civil society embraces a fairly broad range of actors and \norganizations. Accordingly the range of sources of regulation in the \ncivil sector is diverse. Perhaps the best-known regulatory sources in \nthis sector are NGOs, a category which itself includes a diverse range \nof organizations which may operate at the local, national or \ninternational levels (Hutter and O’Mahony, 2004). Also important in \nthe civil sector are standards organizations which produce standards \nabout product quality, quality assurance, and risk management \n(Brunsson & Jacobsson 2000) and professional organizations which \nhave long played a very important regulatory role in regulating entry \nconditions to the professions and laying down standards of conduct. \n  \nThese organizations may influence regulation and business risk \nmanagement in a variety of ways. The distinction drawn by Hood et \nal (2001) between the context and content of regulation is helpful \nhere. The context of regulation refers to ‘the backdrop of regulation’ \nand the content to ‘regulatory objectives, the way regulatory \nresponsibilities are organized, and operating styles’ (2001: 28). In \nthe case of businesses one might use similar distinctions to identify \nthose having a background and indirect influence from those who \nhave a much more direct influence on business risk management \n5 \npractices. NGOs, for example, may be both part of the context and \ncontent of regulation; they may exert normative background \npressure or in some cases they may be formally incorporated in \nbusiness risk management and corporate social responsibility \ninitiatives. \n \nLet us now turn our attention to how these issues work out in \npractice in one particular area of risk management, namely that of \nfood safety and food hygiene.  \n \nManagement of food safety and food hygiene risks \n \nThis management is designed to minimise the risk of food borne \nillnesses and we should be in no doubt that the risks here are \nconsiderable.  In 2000 over 5 million people in the UK and 76 million \nin the US suffered food poisoning (Adak et al, 2002).  A proportion of \nthese were admitted to hospital and a small number died.  It is \nthought that the trends in food borne disease and death are \nimproving and undoubtedly risk management within the food \nindustry is crucial to this (Adak et al, 2002).  \n  \nIn this section of the paper we present data from the research with \nrespect to the regulated’s knowledge of external influences upon food \nsafety and food hygiene practices in the  food retail sector in the UK.  \nThroughout this section we will highlight any significant variations \nbetween respondents, we are in no way suggesting in this paper that \nthere are homogenous views in this sector, far from it, the variations \nare important. \n \n6 \nState regulators \nState regulatory arrangements for food retailers and catering outlets \nin the UK are organized on a national and local basis. In very general \nterms central government sets food safety policy through the Food \nStandards Agency (FSA) and local government implements this policy \nthrough their individual Environmental Health Departments. The \nofficers of these departments monitor compliance with the minimum \nstandards required by government legislation, promoting guidance \nand best practice on higher standards. Enforcement action may be \ntaken against businesses which are non-compliant with minimum \nlegal requirements.  \n \nFood safety is often the responsibility of local government \nEnvironmental Health Officers (EHOs) and food standards the \nresponsibility of local government Trading Standards Officers (TSOs). \nThe exception to this arrangement is in London and Scotland where \nboth food safety and food standards are the remit of EHOs and they \nmay have the title of Food Safety Officer. EHOs do not only inspect \nfood production, catering and retail premises on matters of food \nsafety they perform additional duties such as housing standards, \npollution control, health safety and welfare and noise control \n(Hampton 2005).  \n \nThe FSA is a policy making body with responsibility for guidelines, \nstandards and codes of practice. It does have an enforcement arm, \nthe Meat Hygiene Service (MHS) whose activities are independent of \nand parallel to those of EHOs and as such are outside the boundaries \nof this research. Each of the home nations of the UK, except England, \nhas a devolved branch of the FSA. The FSA inspects and audits the \nenvironmental health departments of local authorities.   \n \n7 \nThe FSA was borne out of a crisis in food regulation in 1980s and \n1990s.  A series of food controversies, including BSE, e-coli and \nsalmonella, shook confidence in the system of food regulation in \nBritain.  A number of problems were held responsible, among them \nfragmented and conflicting responsibilities for food safety in Britain.  \nThis led the government to follow the recommendations of the James \nReport (1997) and establish a non-ministerial department to \nundertake responsibilities previously held by multiple government \ndepartments and to oversee local authority enforcement. A key \nobjective was to restore consumer confidence in the safety of food.  \nDuring the course of this research there was no evidence that the \ncrises of the 1980s and 1990s were material to the thinking of our \nexperts or the managers we surveyed: none referred to these crises.  \nWhile there were differences in opinion concerning the state of food \nsafety and food hygiene in Britain today no one indicated that they \nconsidered it in a state of crisis. \n \nThose we met in the first phase of the research differed widely in \ntheir views about how much would be known about the state-based \nregulatory systems set up in the late 1990s. Some considered state \nregulatory arrangements to remain confusing and they expected that \nwe would encounter a great deal of uncertainty in business especially \namongst micro, small and medium-sized enterprises (SMEs), \nparticularly about the role of the FSA.7   It is notable that it was only \nin the first phase that any particular note was made of the influence \nof the European Union.  Possibly the EU did not feature in the second \nphase as EU legislation tends to be incorporated into national \nlegislative regimes.  \n \nIn the second phase of the research managers of food businesses \nwere asked about a range of matters, for example, their \nunderstandings of food safety and food hygiene risks, their sources of \n8 \ninformation about these risks, business controls to manage risks and, \nthe subject of this paper, external influences on their risk \nmanagement sources. These included a very general question about \nthe extent to which their consideration of food safety and food \nhygiene risks is influenced by sources external to the business. Table \n1 details the aggregate responses we received. In the rest of the \npaper we will consider these alongside the other interview and survey \ndata we collected. \n \nThe survey found that state regulatory agencies were, alongside \nconsumers, the most important external influence on food businesses \nand of these, EHOs were held to have the most influence (see Table \n1). The strength of the influence is revealed in the constancy of the \nfindings across different groups:  68% of managers and 67% of \nmicro and small business managers claim EHOs are a strong \ninfluence when they are considering food safety and food hygiene \nrisks with only 2% of managers and no micro or small business \nmanagers claiming EHOs are of no influence. \n \nInsert Table 1 here. \n \nRespondents were able to give detailed answers about EHOs. The \npoint of contact in each business varied.  In many businesses \nmanagers were not present during an EHO visit and in large \norganizations the visit was often ‘handled’ by a specialist from head \noffice or a more senior manager. This is not the case with micro and \nsmall businesses where the manager has direct and personal contact \nwith the EHO. This may in part explain the additional finding that \nmicro and small businesses tended to claim better quality \nrelationships with EHOs than most medium and large size \nbusinesses.8 This said one of the surprising findings of the survey is \nthat with one exception (1 out of 15 respondents) none of the micro \n9 \nsize catering businesses proactively sought advice from EHOs. This is \nespecially surprising as EHOs emerged as an important source of \ninformation for other food businesses. Two-thirds of the businesses \nwe surveyed actively seek advice from the EHO. Inspection appears \nto be an important educative channel and it may be that micro \nbusinesses find these visits especially helpful – thus the perception \nthat they have a good relationship – yet they may simultaneously \nlack the confidence to actively ask EHOs for advice in the way larger \nbusinesses do.   \n \nWe also questioned respondents about TSOs. They are clearly of \ninfluence (62%) on our food businesses but not as strong an \ninfluence as EHOs (91%). Knowledge about TSOs was patchier than \nwas evident in the case of EHOs. For example when asked about \nTSOs 52% of micro and small businesses indicated a response of ‘Not \napplicable’ or ‘Don’t know’ compared to 10% who did not or could not \nrespond on the subject of EHOs. Little patterning was evident \naccording to the size of business or whether the business was a retail \nor catering business. TSOs received almost no spontaneous mention \nelsewhere in the survey where they were mentioned by less than 2% \nof respondents. This would suggest that an awareness exists of \ntrading standards matters but managers, directors and owners have \nhad little experience of direct contact with a TSO9.   \n \nFood Standards Agency \n \nDuring the first phase of research the role of the FSA was, as one \nmight expect from this group of experts, well known but there was a \ngreat deal of uncertainty about how well known the FSA would be \nwithin the food industry. Yet in our second phase survey the FSA was \nranked as the third most important external influence on food retail \n10 \nand catering businesses. This ranking did vary between businesses. \nThose with a detailed knowledge of the FSA tended to be at the \nhighest levels within businesses, that is within ‘head office’ specialist \nfunctions and similarly specialist functions within trade associations.  \n \nConfusion did exist about the division of responsibility and functions \nof state regulators. A sizeable minority of respondents did not realize \nthat the EHO is an employee of the local council. Several specific \nreferences in the research were made to non-specific state bodies \nsuch as, ‘the government’ (7 references), ‘the authorities’ (2 \nreferences) or ‘the council’ (6 references).  \n \nNon-state regulators \n \nThe growth of non-state actors in regulation and risk management \npractices was very well understood by our experts who in addition to \nstate regulators and supranational institutions, identified a variety of \nnon-state sources of regulation. In the economic category they cited \ntrade organizations, commercial consultants, the insurance industry, \nlawyers, private standards and self-regulation\/best practice. In the \ncivil category they noted professional associations, scientists, \nadvocacy and pressure groups, external accreditation agencies,  \nassurance schemes, consumer NGOs, the public and the media.   \n \nThe second phase of data collection questioned respondents about a \nvariety of sources of non-state influence.  As we can see from Table \n1 the most influential of these groups are consumers who, along with \nEHOs, exert the greatest influence over respondents’ food safety and \nfood hygiene management.  \n \n11 \nConsumers \n \nOur first-phase interviews did not identify consumers as having such \nimportant potential in the regulatory system and did not indicate how \nwidespread and strong an influence they would be amongst the \nbusiness managers interviewed in the second phase of the research. \nFor many businesses consumers were either as influential or almost \nas influential as EHOs.  \n \nMost managers in the sample sense a general public awareness of \nfood safety and food hygiene risks. This is well illustrated by Table 2 \nbelow which shows how managers responded to a question about \ntheir understandings of consumer concerns. In two companies 100% \nof managers thought that consumers rated food safety and food \nhygiene issues as ‘Very important’.  Overall  ‘Price’ (value for money) \nwas cited as the second highest concern of consumers. A senior risk \nmanager from a large branded licensed catering chain commented \nthat his business had ‘over complied on GM regulations due to \nconsumer demand’. \n \nInsert Table 2 here. \nThe media  \n \nThe media is often considered one of the most influential opinion \nformers but in this research their comparative strength of influence \nwas not widely recognized.  During the period of study it was known \nthat some businesses in the sample had first-hand experience of \ndirect media attention. But specific details were difficult to obtain \nthrough the survey. Respondents were more prepared to discuss the \nmore diffuse effects of the media where the influence is more \ngeneric: either the food industry or a food product becomes the \n12 \nsubject of media attention and all businesses are influenced.  A small \ngroup of individual managers across the sampled businesses \ncriticized the media for creating ‘food scares’. Another group of \nmangers was clearly (possibly unwittingly) ‘part’ of the food scare in \nthat they would cite risk matters, of often complex and disputed risk, \nwhich were receiving extensive press coverage at the time of study.10 \nThere was also concern that adverse publicity for any part of the \nindustry had a contaminating effect on others: \n \nWhen bad practices are shown on TV I think people think that \nall catering businesses are run the same.  Not right!   \n(Manager– contract catering business) \n \nInsurance companies \n \nInsurance companies are thought by some commentators to have a \npotentially important regulatory role (Ericson et al. 2003). Yet very \nfew of those we interviewed and surveyed in our research regarded \ninsurance companies as a significant influence on their management \nof food safety and food hygiene. \n \nOur experts thought it unlikely that insurance companies would \nfigure prominently as an influence on food safety and hygiene \nstandards but there was a suspicion amongst these experts that their \ninfluence may be increasing. A degree of scepticism about the ability \nof insurance companies to play a credible role in the food sector was \nalso expressed, comments ranging from a view that insurance \ncompanies are not very good at quantifying risk, with others being \nespecially concerned about moral hazard problems – ‘Insurance is \nthe enemy of the good as it is designed to average out loss resulting \n13 \nin the good not being rewarded and the bad not being punished’ \n(interview respondent).  \n \nSome 60% of managers of micro\/small businesses compared to 50% \nof medium and large companies11 claimed to have insurance cover \nfor food hygiene and food safety incidents. Conversely, micro and \nsmall business managers (30%) view insurance companies as much \nless influential than did managers of medium and large businesses \n(50%). 20% of all managers received information on food hygiene \nand food safety from their insurance company but only one business \n(a micro\/small business) reported ever having been inspected by an \ninsurance company.  \n \nOur survey found that 15% of managers in medium- and large-size \nbusinesses regarded insurance companies as having a ‘strong \ninfluence’ with the medium and large catering businesses being more \ninclined to regard them as strongly influential (20%) than the retail \nonly businesses (8%).  \n \nLawyers \n \nThe relevance of lawyers to risk management was not well \nunderstood by our survey respondents. Lawyers were considered to \nhave the least influence of all the external actors we asked about in \nthe survey. A slight difference in influence does emerge between the \ncatering and retail sectors with the former responding that lawyers \nhave greater influence than was the case with the retail sector. \nInterestingly almost 90% of managers of micro\/small businesses did \nnot answer this question. \n \n14 \nOnly two experts from phase 1 spontaneously referred to legal \ninfluence upon food safety. This was less a comment specifically \nregarding lawyers as individuals and more a comment on how the \nlegal system in its broadest sense was perceived to operate. A \ndirector of a catering company commented that their risk \nmanagement approach had a bias towards viewing risk from a legal \nperspective in an attempt to avoid litigation possibly relating to their \nbusiness operations in the United States. A senior risk manager from \nthe headquarters of a large licensed catering chain commented on \nthe rise in claims from customers who had ‘fallen over in the car park \nafter leaving our establishments’. He considered this an example \n‘compensation culture’. Surprisingly, given the debates about the UK \nbeing riddled with a ‘compensation culture’ his was the only explicit \nmention of this phenomenon in phase 1 and phase 2 of the research. \nRegardless of accuracy we expected these claims to be reflected in \nour findings but it was far from the case. \n \nPressure groups\/NGOs  \n \nPressure groups, especially NGOs, are perhaps one of the most well \nknown regulatory sources in the civil sector. They are especially \nimportant for their information-gathering work and for their \nexploitation of publicity as a way of influencing business behaviour \n(Braithwaite and Drahos 2000; Hutter and O'Mahony 2004). Yet they \ndid not figure prominently in our research. \n \nPhase 1 data revealed very different views of NGOs. A senior risk \nmanager from a licensed catering chain commented that the Better \nRegulation Task Force and Food Standards Agency ‘even out the \ninfluence of the National Consumer Council (NCC) and other (pro-\nconsumer) lobbyists’. A contrasting comment came from a director of \n15 \na large food retailer who mentioned that as part of developing their \nCorporate Social Responsibility scheme they were working with a \nteam of academics and consumer-friendly NGOs.  \n  \nOne director in phase 2 suggested that his employees would not \nknow what a pressure group or NGO was and this is to some extent \nborne out by our data. Overall 40% of our sample was unable to \nanswer questions about NGOs with 86% of respondents in one large \nUK restaurant chain and 83% from a large UK takeaway chain being \nunable to answer at all. Generally, 31% of respondents attributed \nNGOs ‘no influence’ with just 5% indicating a strong influence. \n \nPrivate consultancy firms  \n \nManagement and other more specialist consultancies focusing on \nselling risk management and regulatory compliance advice, cover a \nrange of risk management domains. Many such organizations exist, \ntheir trade being to sell advice which will assist businesses \nunderstand state regulations and guidance, ensure that they have \ncompliance systems in place and even offer advice on how \nbusinesses should relate to regulators especially in registering their \nbusinesses with regulators, licensing processes, complaints \nprocedures or legal actions.   \n \nIn our research views about consultancy firms were mixed. Two large \nprivate consultancies specialising in the food industry were widely \nknown and highly regarded for their provision of a range of technical, \nbusiness, scientific, regulatory and legal services relating to risk. \nThese were mentioned by senior policy makers and directors in \nphases 1 and 2 as providing research, policy and operations support \nto many businesses in the sector. However, knowledge of these two \n16 \nconsultancies was dependent upon level of seniority in the staff \nhierarchy, not a single manager mentioned consultancy, only those \nat directorial level.   \n \nOther consultancies mentioned by respondents were typically small \nconsultancies run by former state regulators or former technical \nemployees of large food companies. These were used for advice and \ninspection. The most direct evidence of influence came from a \ncatering chain where the scores from consultancy audits influenced \nthe calculation of the remuneration of the board of directors. Not a \nsingle micro or small business in either the retail or catering sectors \nrepresented in the sample used a consultancy as their main source of \ninformation about food safety and hygiene risks.  \n \nNot all consultancies were viewed positively and some received a \ngreat deal of criticism from all of the sectors represented. They were \nseen to be exploiting the confusion of micro firms and SMEs relating \nto HACCP12 – ‘consultants are making a killing out of HACCP, just \npulling stuff off the net and then selling it’ (interview respondent). \nBut there was more than moral indignation, some expressed concern \nthat there is ‘over-implementation of risk management practices due \nto the advice of commercial consultants’. This very much chimes with \nevidence that consultancy firms may be a source of what has come \nto be referred to as regulatory creep (BRTF 2004). \n \nTrade associations \n \nTrade associations are a prominent form of economic self-regulation \nwhere businesses voluntarily join schemes involved in establishing \nand maintaining codes of practice (Gunningham 1995; Rees 1997). \nThey may thus play an important risk management role for their \n17 \nmembers. For example, they may have an educative, training role \nand liaise with government over the best ways to achieve the \nrequired standards.  They may issue their own codes to this end such \nas the British Hospitality Association Fitness for Purpose voluntary \ncode relating to accommodation and catering standards in the \nhospitality sector. Trade associations may play a direct regulatory \nrole where they run their own self-policing schemes. Such food \nassurance schemes include standard setting and inspection and in \nsome cases may embrace food safety and food hygiene matters. But \nmany food businesses may not belong to an association. This is \nparticularly acute in the catering sector where one of our participants \nestimated that perhaps only one-third of all businesses belong to an \nassociation, compared to retail businesses where over 90% are \nthought to belong to a trade association.  \n \nIn our survey only senior staff – at director level or above – working \nfor large organizations were aware of their firm’s membership in \ntrade associations such as the British Retail Consortium, Institute of \nGrocery Distribution, the Food and Drink Federation and Association \nof Convenience Stores. No branch manager in any of the businesses \nsurveyed was aware of their firm’s membership of trade associations. \nSome directors thought they were members of trade associations but \nwere unsure of which ones. A senior risk manager from a large group \nof licensed catering chains commented that the majority (75%) of \ntheir food suppliers meet a type of ‘private’ standard developed by a \ntrade association, the British Retail Consortium Higher standard.13 \nAmongst the larger food retailers and catering businesses this \nstandard is thought to be widely used and valued.  Of the micro, \nsmall- or medium-sized businesses only one indicated membership of \ntwo trade associations.  \n \n18 \n5% of managers for medium and large businesses indicated that a \ntrade association made checks on food safety and food hygiene on \ntheir premises. A similar figure indicated that a trade association \nprovided information on food safety and food hygiene to them and \n2% indicated this information was provided to their staff. None of \nthese managers named or described these trade associations. It is \nthought that confusion exists with categories of organization – some \nmanagers may believe that a commercial consultancy is a trade \norganization. Similarly, some managers who mentioned using the \nservices of a commercial consultancy may in fact be the clients of the \ncommercial arm of a trade association. The line between the two is \noften unclear. \n \nWhen considering food safety and food hygiene risks directors of \nlarge retail businesses were moderately more influenced by an \n‘industry association’ than the directors of large catering business \nalthough in both sectors the influence is not ‘strong’. \n \nSome participants were very supportive of self-regulatory schemes \nsuch as the Red Tractor launched in the UK in June 2000 by Assured \nFood Standards which was created by the National Farmers Union \n(NFU) with government backing (Meat and Livestock Commission). \nOther participants preferred greater clarity about whether or not \nthere is a regulatory requirement upon them or not i.e. a legal \nrequirement to comply. There was a view that if schemes such as \nthese are to have any chance of success then strong enforcement is \nnecessary. \n \nSeveral references were made by managers to what we believe are \nin-house schemes or proprietary standards which do not appear to \nhave been created by trade associations or state regulators. Such \nschemes and standards have either been developed internally within \n19 \nbusinesses or have been introduced with the assistance of paid \nexternal technical or business consultants. These schemes and \nstandards were referred to in passing by several of the managers \nusing an acronym: all of whom worked for the large businesses in the \nsample. Adherence to these schemes and standards appeared to be \nmandatory for those working within the business.  Large \nsupermarkets and caterers are another potential source of regulation, \nnot just with respect to their own branches but also with respect to \nthe supply chain. There was a very definitive view amongst some of \nour respondents that in the case of large national companies and \nfranchises, corporate risk management systems for food safety and \nfood hygiene take precedence over all others, the state included.14 \nDiscussion \nTwo strong messages can be drawn from the research: first that \nstate regulation remains a key influence on business risk \nmanagement practices; second that respondents readily understood \nthat there are other non-state external influences on their risk \nmanagement practices. \n \nManagers’ knowledge of EHOs, the local authority regulators, was \nmost widespread and most sophisticated. This is not entirely \nsurprising as they are in most contact with the industry at floor level \nand their remit directly relates to the food safety and food hygiene \nrisks we asked about. TSOs do not work directly to this remit but the \nsurvey responses do not seem to have such a nuanced reason for \ntheir ignorance – the indications are that they have less knowledge of \ntrading standards. Knowledge of the nationally-based FSA is high at \nsenior management and policy levels of large businesses but less so \nat junior management level. Overall, however, knowledge of the FSA \namongst businesses was much higher than our expert group \nanticipated it would be. \n20 \n \nThe influence of non-state bodies was best understood by our senior \nexperts and policy makers who spontaneously referred to a wide \nrange of such influences. Our survey revealed knowledge of these \ninfluences and also presented us with some surprising results. For \nexample, the role of consumers as an important influence on \nbusiness risk management practices was not flagged up by our \nexperts yet in our survey consumers were cited as one of the \nstrongest influences on risk management. Indeed, not only did \nconsumers figure highly as an influence they were also deemed to \nrank food safety and food hygiene as the most important consumer \nconcern. \n \nTurning to influences beyond the state, the influence of the media \nwas deemed to be well below the influence of consumers and state \nofficials.  The other main sources of civil power, NGOs, surprisingly, \nwere not well understood as an influence despite their role in \nopposing GM foods and promoting organic produce. Campaigns on \nthese issues were running at the time of the research so we had \nexpected a greater knowledge of NGOs and their regulatory role. \nAnother surprise is the fairly low influence attributed to lawyers. \nGiven the prominent debate about the compensation culture we were \nsurprised that respondents rarely mentioned the possibility of \ncompensation claims or civil actions.  Likewise insurance companies \nalso appeared to have a much less influential role than attributed by \nsome commentators.  \n \nConsultancy firms appeared to have influence and, in fact, the \npotential for substantial influence in some areas of the industry. The \nnature of this influence is controversial and an important topic in its \nown right. Trade associations are also potentially important especially \nas an area of industry self-regulation, but their influence is obviously \n21 \nconfined to their membership and the food industry is one where \nthere are significant numbers of businesses which do not fall within \nthe remit of these associations. \n \nSo consumers and EHOs were deemed to exercise a direct influence \nover food safety and food hygiene risk management practices; \nprivate consultancy firms and trade associations sometimes had a \ndirect influence, depending on the size of the business; the media \nand NGOs were more indirect background influences; and lawyers \nand insurance companies played a negligible role, with the latter \neven being described as a negative influence. Let’s consider now how \nthese findings compare with other studies. \n \nThe general levels of knowledge about the overall state regulatory \nsystem echoes the findings of other studies, although knoweldge of \nEHOs appear to be higher than those found by studies of other \nregulators. Genn (1993) found great variation in levels of regulatory \nknowledge, with confusion about regulators highest on the smaller \nsites she visited. She also found little evidence of the regulated in \nsmaller businesses being prepared to debate with inspectors, rather \nlike the micro and small businesses in this study. In larger companies \nthere is a greater readiness to use regulators as a resource. In \nHutter’s (2001) study of a national railway company the social \ndimensions of regulatory knowledge and understanding were striking \nwith senior personnel having a much greater understanding of the \nregulatory system than those lower down the hierarchy. This of \ncourse very much accords with our findings. \n \nThe literature on the impact of state regulators reveals a variable \nimpact.  The overwhelming majority of railway employees \ninterviewed in Hutter’s 2001 study thought that the state regulator \nwas very important in bringing about higher standards of health and \n22 \nsafety in the industry.  Likewise Gunningham, Kagan and Thornton \n(2003) conclude that regulation is key in shaping corporate \nbehaviour. This contrasts with earlier studies by Gricar (1983) and \nClay (1984) on OSHA (Occupational Safety and Health \nAdministration) inspectors in the United States. Most studies argue \nfor the necessity of maintaining some kind of outside policing of \nbusiness risk management primarily to ensure that risk management \nobjectives are established and maintained on a firm’s agenda and to \nestablish  ‘credible enforcement’ (Gray and Scholz 1991; \nGunningham and Grabosky 1998; Hutter 2001). \n \nThe influence of non-state actors on business risk management is not \nwell researched and much of the work that does exist is speculative.   \nThere is some work in the environmental field about the potential \nimportance of consumer preferences in influencing corporate \nenvironmental policies. Grabosky (1994), for example, argues that \npreferential buying or consumer boycotts may have the capacity to \ninfluence business environmental behaviour more than state \nregulation. But there is no corresponding research in the area of food \nsafety and food hygiene. A study in the UK found consumers regard \nfood safety as highly important but that they have few concerns \nabout it as they generally agree that standards in the UK are very \nhigh (IGD 1998). \n \nThere is work on the increasing importance of trade and industry \norganizations and the international standards organizations (Cashore, \net al. 2004; Eisner 2004; Ronit and Schneider 1999). Private \nstandards such as those promulgated by trade associations are \nincreasingly important in the global food system. Fulponi (2006) \nargues that such standards have become an important governance \ntool for major retailers and also that they are increasingly more \nstringent than those of government.  Their importance in the food \n23 \nchain is regarded as especially important (Henson and Hooker 2001). \nLikewise Holleran et al. (1999) see the potential incentives for food \nbusinesses to adopt these standards. These include satisfying \ncustomer requirements and helping to meet legislative demands.  \nTrade associations may play an important role in making and \ncommunicating standards. Research in the environmental field \nsuggests that they have a significant regulatory influence over \nenvironmental performance, particularly in a co-ordinating capacity \n(Bailey and Rupp 2004). \n \nThe role of broader social concerns in influencing business has been \ndiscussed.  The notion of the ‘social licence to operate’ (Gunningham, \nKagan and Thornton 2003) is possibly most forceful here. An \nimportant component in ‘the social licence to operate’ is the role of \ncivil society and non-governmental organizations (Gunningham, \nKagan and Thornton. 2003). These groups undertake an important \nmonitoring role and their views, alongside those of the local \ncommunity, are an important influence on business practices. \nGunningham, Kagan and Thornton (2003: 153-4) also found less \nevidence than anticipated regarding the influence of NGO activity \nover pulp manufacturers, although they did accord local community \nactivists an important role in influencing corporate behaviour.  \n \nNGOs often gain their influence through their use of the media and \nhere they are deemed to have had some success, a prominent \nexample being the Nestlé baby milk case when negative media \ncampaigning led to consumer boycotts of its products (Hutter and \nO'Mahony 2004). Generally, the role of the media as a regulatory \nforce is deliberated as a theoretical possibility rather than empirical \nactuality. Fisse and Braithwaite (1983) discussed how corporate \ndeviance might be controlled by the use of adverse publicity since it \ntargeted the desire of businesses to protect their reputations. Mason \n24 \nand Mason (1992) also examined the mass media as a means of \nenhancing taxpayer compliance, arguing that this may be a means of \npersuasion for moral compliance and the promotion of civic virtue. \nThe media plays an important informational role which can influence \ndemand for products such as food (Baron 2005; Swinnen et al. \n2005).  Some regard this as a positive influence. Lang and Hallman \n(2005) for example, refer to the media as ‘a watchdog of the public \ninterest’. Others regard the media as a source of social amplification \n(Kunreuther 2002; Pidgeon et al. 2003) although there is \ndisagreement about how serious this is. Frewer et al (2002) argue \nthat the effects of such amplification of food incidents may be short-\nlived and may move according to changing levels of media reporting. \nWakefield and Elliott (2003) found that newspapers though a major \nsource of environmental information were also inconsistent and \nunreliable and thus were not trusted by the public, especially by \nthose with access to other information networks. \n \nThree of the economic non-state influences we have discussed have \nattracted little research interest, most especially empirical interest. \nThere is very little research on the role of lawyers in business risk \nmanagement decisions. There appears to be no compelling evidence \nthat liability laws do have influence on food businesses. While some \nauthors (Holleran et al. 1999) contend that these laws are a potential \nincentive to food safety others disagree. Buzby and Frenzen (1999), \nfor example, referring to the United States where civil litigation is \nrelatively well used, argue that product liability systems for food are \nweak and thus offer weak incentives with respect to promoting food \nsafety.  Henson and Caswell (1999) feel that the main influence in \nthe UK is indirect, namely that the ‘due diligence’ concept in UK \nproduct liability law is a strong incentive for the use of third party \ncertification and the adoption of private standards. They also argue \nthat ‘ex post liability’ is of secondary importance in the UK. \n25 \n \nInsurance cover for the food industry is active in two main areas: \ngeneral liability and product recall. The former is the most common \nand given the low level of litigation incurs relatively little cost. The \nlatter is a relatively new form of insurance for an event which has the \npotential to be very costly in both monetary and reputational terms. \nIt is for this reason that Skees et al. (2001: 100) believe that \ninsurance has great potential as an alternative to regulation. But the \nconclusion of their article is that this has not yet been realized. There \nis some evidence in the environmental sector that financial \ninstitutions such as insurance companies take account of \nenvironmental performance in making decisions about business \n(Grabosky 1994; Eisner 2004) but again opinions differ. \nGunningham, Kagan and Thornton (2003), for instance, found that \nfinancial institutions were a weak influence in the environmental area \nthey researched, namely pulp manufacturing. \n \nVariability \n \nAn important objective of the research was to map out variability \nbetween businesses. Our findings do reflect the literature where the \nsize of a business is main criterion explaining variability; this is \nidentified, for example, as a key indicator of regulatory capacity. Our \ndiscussions with experts in the food sector revealed that many of \nthem believed risk to be strongly related to size, with effort \nproportionate to the size of the business. Some reflected upon the \nability of small businesses to manage risks – ‘Smaller businesses \nexpect inspectors to manage risks for them’. This said there was \nvocal minority who argued that such statements should not be too \nsweeping and examples of large companies suffering serious and \nhigh profile risk management problems were cited. \n26 \n \nLike other studies our SMEs generally had lower levels of knowledge \nof regulatory laws and state regulatory systems (BRTF 1999; \nFairman & Yapp, 2004; FSA 2001; Gunningham, 2002; Henson and \nHeasman 1998; Vickers et al. 2005). They also appeared to rely on \nstate regulatory systems for education and advice. One reason for \nSME reliance on state systems is that many small businesses have \nless contact with non-state sources which provide information and \nadvice. They are not members of trade or business associations \nwhich may provide updates or even training on food safety and food \nhygiene matters nor do they use consultancies (Fairman and Yapp \n2004; Genn 1993).  This of course contrasts with large businesses \nwhich have greater regulatory capacity of their own and more likely \nto belong to associations, employ consultancies and take out \ninsurance cover. Indeed in the case of large retailers and caterers \nthey may even become a source of regulation for other parts of the \nfood chain as they impose standards which are sometimes in excess \nof state regulatory requirements. \n \nA second factor which may be relevant in any variability between \nbusinesses is business type. The food industry comprises two main \nareas, namely, hospitality (catering) and retail. It is estimated that \nthere are approximately 102,537 grocery retail outlets providing \n1,184,000 jobs in the UK (DEFRA 2005) and 262,948 caterers \n(hotels, cafés and restaurants) providing 1,394,000 jobs (DEFRA \n2005; BRTF 2000). The large majority are small businesses (Fairman \nand Yapp, 2004). \n \nMany of those we spoke to in the research drew a clear distinction \nbetween the retailing and hospitality sectors. Retailing was seen to \nbe concerned with distributing rather than manufacturing products. \nThe hospitality sector was identified as ‘the biggest challenge’ partly \n27 \nbecause of the high turnover of staff, the handling of cooked and \nuncooked food together and changing menus being a source of new \nrisks. A further risk factor associated with the hospitality sector is \nthat: \nCatering is demand-led whereas food manufacturing is planned \nover a long period therefore HACCP sometimes goes out of the \nwindow as customers need to be served. Time pressures lead \nto corners being cut.  \nAnother participant commented that ‘the hospitality sector is a very \nfragmented sector, they don’t tend to gel as a sector’.   \n \nThis accords with an IGD (1998) finding that food consumers are \nmost likely to question restaurant rather than retail hygiene \nstandards and MORI data that the British are especially anxious \nabout the risk of contracting food poisoning in restaurants. The \nextent to which retailers were regarded as risky partly depended \nupon the type of food they sold, for example, whether it is fresh or \npre-packaged. Also deemed relevant was whether or not they were \nsmall independent retailers or part of a broader company or \nfranchise. \n \nConclusion \n  \nThese research data indicate that the move from government to \ngovernance is understood by those in business to the extent that \nthey are well aware that there are multiple external influences on \ntheir internal risk management practices.  These influences organize \nto shape the motives and preferences of business and thus affect \ntheir internal workings. The exception would be one of the most \npotent of the influences discerned in this research namely \nconsumers. There are examples of consumers organizing, for \n28 \nexample, in campaigns for organic or fair trade produce, against GM \nfoods or against particular firms but generally food safety and food \nhygiene are not the subject of such campaigns.  Our sample was \nreferring to the crucial importance of maintaining business \nreputations and their belief that maintaining high food safety and \nfood hygiene standards is crucial to this. Whether or not this is an \naccurate perception is irrelevant. The important fact here is that this \nis what our managers believed and acted upon. Food retailing and \nhospitality are fiercely competitive sectors: consumers have a good \nchoice of retail and hospitality outlets and can easily switch their \npreferences.  Product differentiation is key to the industry and \nmillions of pounds are spent on this each year.   \n \nStrictly speaking consumers exercising their preferences en masse \nand without organization, would fall outside of most definitions of \nregulation, although the finding does indicate the power that \norganized consumer action could have.  What this influence does add \nweight to the contention that social, economic and state influences all \nserve to influence the internal workings of business. It also suggests \nthat there are domain effects to be considered. Gunningham, Kagan \nand Thornton (2003: 137ff) accord environmental controls a key role \nin increasing performance world-wide and in the case of the paper \nand pulp industry argues that this has led to convergence across \ndifferent jurisdictions.  Our research focused on the UK only so \ncannot comment on the contention of international convergence.  But \nwe can say that there is not evidence of convergence within the UK.  \nVariations did appear according to the size of the business, its type \nand where it was located. These differences may suggest that the \ndomain effect is significant and worth exploring. This suggestion is \nstrengthened by the contrasting findings for the importance of NGOs \nand activists, who were found to be more influential by Gunningham, \nKagan and Thornton than in this research on food.  \n29 \n \nClearly the interaction between the state, economy and civil society \nis complex and may be greater than the effect of the sum parts. \nThese influences do also seem to work differentially according to the \nsocial structure of the business. In the case we have discussed there \nare few formal ‘joined up’ connections between the state and non- \nstate systems.  There are, however, some ways in which regulatory \nactors do acknowledge and indirectly co-opt other regulatory players.  \nNotable here are EHOs, some of whom ‘name and shame’ those with \npoor food safety and food hygiene practices; publicly rate or \ncertificate premises with high standards; or certificate individuals \nwho have been trained in food safety and food hygiene.  Such \ninformation plays to other potential regulatory forces and directly to \nconsumers.  The complexities and dynamics involved are well \nillustrated by this case.  The state, represented by EHOs, produces \ninformation which may be deployed by the media, consumers and \nother groups; thus they potentially influence the social reputational \nstanding of a business; and thus influence its commercial\/economic \nposition.  \n \nWe should not automatically assume that all external forces have a \npositive influence on risk management practices. Certainly, \nconsultancies have been implicated in regulatory creep. Likewise the \ninfluence of insurance companies can be problematic and deserves \ngreater scrutiny.  The background influences are variable according \nto topicality and size of business. The ways in which factors play out \nand interact are not well understood.  The academic literature does \nsuggest that each of the background influences has the potential to \nbe a direct influence but as yet we need a great deal more evidence \nof this and how it might be realized and the conditions under which \neach influence is likely to be helpful.  \n \n30 \nWe do know that businesses are subject to a complexity of pressures \non their risk management practices. Some are external to their \norganization and others are within their organizational boundaries. \nIndeed different pressures may be in tension. The nature of these \ninteractions is not well understood and the next step is to explore \nthis further. This paper draws on research undertaken with the food \nindustry. Our next step is to compare this with another risk \nregulation domain to better understand how the various external \ninfluences on business risk management might work across different \nareas. \n \nReferences \n \nAdak, G. K., S. M. Long, (2002) \"Trends in indigenous foodborne \ndisease and deaths, England and Wales: 1992 to 2000.\" Gut 51, 832-\n841 \n \nAyres, I. and Braithwaite, J. (1992) Responsive regulation. New York: \nOxford University Press. \n \nBailey, I. and Rupp, S. (2004) The evolving role of business \nassociations in negotiated environmental agreements: the case of \nUnited Kingdom climate change agreements. Occasional Paper - \nClimate Policy Research. University of Plymouth: Department of \nGeography. \n \nBaron, D. P. (2005) ‘Competing for the public through the news \nmedia’, Journal of Economics & Management Strategy 14 (2): 339-\n376. \n \n31 \nBlack, J. (2002) Critical reflections on regulation. CARR Discussion \nPaper 4. London: London School of Economics and Political Science.  \n \nBraithwaite, J. (1982) ‘Enforced self-regulation: A new strategy for \ncorporate crime control‘, Michigan Law Review 80: 1466-1507. \n \nBraithwaite, J. and Drahos, P. (2000) Global business regulation. \nCambridge: Cambridge University Press. \n \nBRTF (Better Regulation Task Force) (1999) Regulation and small \nfirms: a progress report. London: Better Regulation Task Force, \nCabinet Office Publications & Publicity Team. http:\/\/www.brc.gov.uk\/ \n \nBRTF (2000) Tackling the impact of increasing regulation - A case \nstudy of hotels and restaurants. London: Better Regulation Task \nForce, Cabinet Office Publications & Publicity Team.  \n \nBRTF (2004) Avoiding regulatory creep. London: Better Regulation \nTask Force, Cabinet Office Publications & Publicity Team. \n \nBrunsson, N. and Jacobsson, B. (eds.) (2000) A world of standards. \nNew York: Oxford University Press. \n \nBuzby, J.C. and Frenzen, P.D. (1999) ‘Food safety and product \nliability’, Food Policy 24 (6): 637-651. \n \nCashore, B., Auld, D. and Newsom, G. (2004) Governing through \nmarkets: Forest certification and the emergence of non-state \nauthority. New Haven: Yale University Press. \n \n32 \nClay, T.R. (1984) Combating cancer in the workplace: \nImplementation of the California Occupational Carcinogens Control \nAct. Irvine: University of California. \n \nCoglianese, C. and Lazer, D. (2003) ‘Management-based regulation: \nprescribing private management to achieve public goals’, Law & \nSociety Review 37 (4): 691-730  \n \nDEFRA (Department for Environment, Food and Rural Affairs) (2005) \n‘Agriculture in the United Kingdom 2005’, Norwich: Department for \nEnvironment, Food and Rural Affairs. \n \nDTI (Department of Trade and Industry) (2006) Small Business \nService. London: Department of Trade and Industry. \nhttp:\/\/www.sbs.gov.uk\/sbsgov\/action\/layer?topicId=7000000237 \n \nEisner, M.A. (2004) ‘Corporate environmentalism, regulatory reform, \nand industry self-regulation: toward genuine regulatory reinvention \nin the United States‘, Governance 17 (2): 145-167. \n \nEricson, R.V., Doyle, A. and Barry, D. (2003) Insurance as \ngovernance. Toronto: University of Toronto Press. \n \nEuropean Commission (1996) Commission recommendation of 3 April \n1996 concerning the definition of small and medium-sized enterprises \n(96\/280\/EC). Official Journal no. L 107. Brussels: Commission of the \nEuropean Communities. \nhttp:\/\/Europa.Eu.Int\/ISPO\/Ecommerce\/Sme\/Smedef_EN.Doc \n \nFairman, R and Yapp, C. (2004) ‘Compliance with food safety \nlegislation in small and micro-businesses: enforcement as a external \nmotivator’, Journal of Environmental Health Research 3 (2): 44-48. \n33 \n \nFisse, B. and Braithwaite, J. (1983) The impact of publicity on \ncorporate offenders. Albany: State University of New York Press. \n \nFrewer, L.J., Miles, S. and Marsh, R. (2002) ‘The media and \ngenetically modified foods: evidence in support of social amplification \nof risk‘, Risk Analysis 22 (4): 701. \n \nFSA (Food Standards Agency) (2001) Task Force on the burdens of \nfood regulations on small food businesses. London: Food Standards \nAgency. \n \nFulponi, L. (2006) ‘Private voluntary standards in the food system: \nthe perspective of major food retailers in OECD countries‘, Food \nPolicy 31 (1): 1-13. \n \nGenn, H. (1993) ‘Business responses to the regulation of health and \nsafety in England‘, Law and Policy 15: 219. \n \nGrabosky, P. (1994) ‘Green markets: environmental regulation by \nthe private sector‘, Law & Policy 16 (4): 419-448. \n \nGray, W.B. and Scholz, J.T. (1991) ‘Analyzing the equity and \nefficiency of OSHA enforcement’, Law & Policy 13 (3): 185-214. \n \nGricar, B. (1983) ‘A preliminary theory of compliance with OSHA \nregulation’, Research in Corporate Social Performance and Policy 5: \n121-141. \n \nGunningham, N. (1995) ‘Enforcement, self-regulation, and the \nchemical industry: assessing responsible care’, Law & Policy 17 (1): \n57-109. \n34 \n \nGunningham, N. (2002) ‘Regulating small and medium sized \nenterprises’, Journal of Environmental Law 14 (1): 3-32. \n \nGunningham, N. and Grabosky, P. (1998) Smart regulation designing \nenvironmental policy. Oxford: Oxford University Press. \n \nGunningham, N. and Rees, J. (1997) ‘Industry self-regulation: an \ninstitutional perspective’, Law & Policy 19(4): 363-414. \n \nGunningham, N. and Kagan, R.A. (2005) ‘Regulation and business \nbehaviour’, Law & Policy 27 (2). \n \nGunningham, N., Kagan, R.A. and Thornton, D. (2003) Shades of \ngreen: business, regulation, and environment. Stanford, CA: \nStanford University Press. \n \nHampton, P. (2005) Reducing administrative burdens: effective \ninspection and enforcement – Hampton Review Final Report. London: \nHM Treasury. www.hm-treasury.gov.uk\/hampton \n \nHancher, L. and Moran, M. (1989) Capitalism, culture and regulation. \nOxford: Clarendon. \n \nHenson, S. and Caswell, J. (1999) ‘Food safety regulation: an \noverview of contemporary issues’, Food Policy 24 (6): 589-603. \n \nHenson, S. and Hooker, N.H. (2001) ‘Private sector management of \nfood safety: public regulation and the role of private controls’, \nInternational Food and Agribusiness Management Review 4(1). \n \n35 \nHenson, S.J. and Heasman, M. (1998) ‘Food safety regulations and \nthe firm: understanding the process of compliance’, Food Policy 23 \n(1): 9-24. \n \nHolleran, E., Bredahl, M.E. and Zaibet, L. (1999) ‘Private incentives \nfor adopting food safety and quality assurance’, Food Policy 24 (6): \n669-683. \n \nHood, C., Rothstein, H and Baldwin, R. (2001) The government of \nrisk. Oxford: Oxford University Press. \n \nHutter, B.M. (1988) The reasonable arm of the law? The law \nenforcement procedures of environmental health officers. Oxford: \nClarendon Press. \n \nHutter, B.M. (2001) Regulation and risk: occupational health and \nsafety on the railways. New York: Oxford University Press. \n \nHutter, B.M. (2006) ‘The role of non state actors in regulation’, in F. \nSchuppert (ed.), Contributions to governance. Berlin: Nomos. See \nalso http:\/\/www.lse.ac.uk\/collections\/CARR\/pdf\/Disspaper37.pdf \n \nHutter, B. and O’Mahony, J. (2004) Business regulation: reviewing \nthe regulatory potential of civil society organisations. CARR \nDiscussion paper DP26. London: London School of Economics and \nPolitical Science. \nhttp:\/\/www.lse.ac.uk\/collections\/CARR\/pdf\/DissPaper26.pdf \n \nIGD (Institute of Grocery Distribution) (1998) Consumer attitudes to \nBritish meat and fresh produce. The Food Project Report series. \nWatford: Institute of Grocery Distribution. \n \n36 \nJames, P. (1997) Food Standards Agency: an Interim Proposal, \nRowett research Institute Aberdeen \n \nKunreuther, H. (2002) ‘Risk analysis and risk management in an \nuncertain world’, Risk Analysis 22 (4): 655-664. \n \nLang, J.T. and Hallman, W.K. (2005) ‘Who does the public trust? The \ncase of genetically modified food in the United States’, Risk Analysis \n25: 1241 \n \nMason, L. and Mason, R. (1992) ‘A moral appeal for taxpayer \ncompliance: the case for a mass media campaign’, Law & Policy 14 \n(4): 381-399. \n \nOsborne, D. and Gaebler, T. (1992) Reinventing government: how \nthe entrepreneurial spirit is transforming the public sector. Reading, \nMA: Addison-Wesley. \n \nParker, C. (2002) The open corporation: effective self-regulation and \ndemocracy. Cambridge: Cambridge University Press. \n \nPidgeon, N., Kasperson, R.E. and Slovic, P. (eds) (2003) The social \namplification of risk. Cambridge: Cambridge University Press. \n \nRees, J. (1997) ‘Development of communitarian regulation in the \nchemical industry’, Law & Policy 19 (4): 177. \n \nRonit, K. and Schneider, V. (1999) ‘Global governance through \nprivate organizations’, Governance 12 (3): 243-266. \n \nScott, C. (2001) ‘Analysing regulatory space: fragmented resources \nand institutional design’, Public Law (summer): 283-305. \n37 \n \nShearing, C. (1993) ‘A constitutive conception of regulation’ in P. \nGrabosky and J. Braithwaite (eds), Business regulation and \nAustralia’s future. Canberra: Australian Institute of Criminology. \n \n \nSkees, J. R., Botts, A. and Zeuli, K.A. (2001) ‘The potential for \nproduct recall insurance to improve food safety’, International Food \nand Agribusiness Management Review 4: 99 - 111. \n \nSwinnen, J.F.M., McCluskey, J. and Francken, N. (2005) ‘Food safety, \nthe media, and the information market’, Agricultural Economics 32 \n(1): 175-188. \n \nWakefield, S.E.L. and Elliott, S.J. (2003) ‘Constructing the news: the \nrole of local newspapers in environmental risk communication’, \nProfessional Geographer 55: 216. \n \nVickers, I., Philip, J., Smallbone, D and Baldock, R. (2005) \n‘Understanding small firm responses to regulation’, Policy Studies 26 \n(2): 149-169 \n \n \n \n \n \n \nTable 1: The range of influences upon managers when \nconsidering food safety and food hygiene risks based on the \nstatistical mean of all questionnaires (completed) by managers. \n \n38 \n \nSource of \ninfluence – \nranked by level of \ninfluence \n \nInfluence \n \nInfluence index \n(Mean values of \nquestionnaires) \n \n \nEHO \n \n \nMost influence \n1.35 \n \nConsumers \n \n \n1.36 \n \nFSA \n \n1.74 \n \nTSO \n \n1.90 \n \nMedia \n \n2.46 \n \nInsurance \n \n2.85 \n \nLawyers \n \n3.19 \n \nPressure group\/NGO \n \nLeast influence 3.23 \n \nTable 2: The range of perception importance to consumers by \nmanagers when considering a range of food attributes commonly \n39 \nrelated to risk based on the statistical mean of all questionnaires \n(completed) by managers. \n \nConsumer concerns \n \nManagers \nunderstandings of \nrelative \nimportance of \nconsumer \nconcerns \n \n \nImportance \nindex \n(Mean values \nof \nquestionnaires) \n \nFood safety and \nhygiene \n \n \nMost important \n1.1 \n \nPrice (value for money) \n \n \n1.65 \n \nLabelling & product \ndescription \n \n2.2 \n \nBSE \n \n2.35 \n \nFood additives \n \n2.4 \n40 \n \nGM (Genetic \nModification) \/ Use of \npesticides to grow food \n \n2.55 \/ 2.55 \n \n \n                                                 \n1\n  Bridget Hutter is Professor of Risk Regulation and Director of the \nESRC Centre for Risk and Regulation at the LSE and Clive Jones is \nResearch Assistant and Project Manager, CARR.  We would like to \nthank the anonymous referees for their very helpful comments, Attila \nSzanto for his excellent research help and the Michael Peacock Trust \nfor their generous sponsorship of this study. \n \n2 Regulation has a multiplicity of meanings (see Black 2002). In this \npaper we see regulation as a means of managing risks so we focus \non organizational responses to the risks generated by business \nactivities and we consider responses originating within and beyond \nthe state. \n \n3 Gunningham, Kagan and Thornton (2003) use the concepts of \ngovernmental, social and economic ‘licences to operate’ as ways of \nunderstanding variations in environmental performance amongst \nbusinesses. See also Braithwaite and Drahos 2000; Hutter 2001; \nParker 2002. \n \n4 This included meetings with 8 central government policy-makers; \n25 regulators from central and local government; 8 Trade \nassociations representatives; 11  retail and producer business \nleaders; and 4 representatives from consumer groups.   \n \n5 Company size definitions: Large firm: over 250 employees; medium \nfirm: 50 - 249 employees; small firm: 10 - 49 employees; micro-firm \n(including sole trader):  0 - 9 employees. Source: European \nCommission (1996) and DTI (2006). The food retail\/grocery sector \nwas segmented into supermarket, convenience store and specialist \nretailer. The catering\/hospitality sector was segmented into \nrestaurant, take-away and contract catering. \n \n6 7 large companies and 22 SMEs participated in the research.  1 \nperson per SME was interviewed and on average 7 per large \ncompany. \n \n41 \n                                                                                                                                              \n7 The research did not take for granted that state legislation is \nfamiliar to everyone working in this industry. Rather it problematized \nthis issue aiming to discover the extent of knowledge about different \nregulatory systems (state and non-state). \n \n8 Not a single business in the entire sample claimed to have a bad \nrelationship with an EHO.  \n \n9Business managers working in Greater London would not have \ncontact with a dedicated TSO; here the tasks of EHO and TSO are \ncombined.  \n \n10  Chief among these were GMO in the food chain, BSE, epidemics \nand ‘chemicals’. In the latter stages of data collection this referred to \nbanned contamination by dyes from the Sudan family of red\/brown \nfood colorants which were found in several manufacturers of branded \nand supermarket private label products. \nhttp:\/\/www.food.gov.uk\/safereating\/sudani\/sudanitimeline FSA 2005  \n \n11  Some 33% of directors\/senior managers responded with ‘don’t \nknow’. \n \n12 HACCP (Hazard Analysis Critical Control Point) is an internationally \nrecognized and recommended system of food safety management \nfocusing on identifying the ‘critical points’ in food safety problems (or \n‘hazards’) and taking pre-emptive measures. \nhttp:\/\/www.food.gov.uk\/foodindustry\/hygiene\/ \n \n13 This is one of a series of standards now referred to as the ‘BRC \nGlobal Standard – Food’. This publication has now become an \ninternational mark of excellence. Certification to the Standard verifies \ntechnical competence and aids manufacturers, brand owners and \nretailers fulfilment of legal obligations. It also safeguards the \nconsumer.’ http:\/\/www.brc.org.uk\/standards\/about_food.htm 2006 \n \n14 The impact of these standards on other parts of the food supply \nchain was not within the remit of this study but it should be noted \nthat the regulatory powers of supermarkets over producers is a point \nof some controversy in Britain. \n"}