{"doi":"10.1093\/cww","coreId":"197537","oai":"oai:lra.le.ac.uk:2381\/9788","identifiers":["oai:lra.le.ac.uk:2381\/9788","10.1093\/cww"],"title":"Recovering Women: History, Trauma, and Gender in Michèle Roberts’s In the Red Kitchen","authors":["Parker, Emma"],"enrichments":{"references":[{"id":43713332,"title":"Autobiographical Study.”","authors":[],"date":"1925","doi":"10.1037\/e417472005-503","raw":"---. “An Autobiographical Study.” 1925. Standard Edition 20:1-74.","cites":null},{"id":43713323,"title":"Christianity, and History: An Interview with Michèle Roberts.” Atlantis:","authors":[],"date":"2003","doi":null,"raw":"Bastsida Rodriguez, Patricia. “On Women, Christianity, and History: An Interview with Michèle Roberts.” Atlantis: Revista de la Asociacion Espanola de Estudios Anglo-Norteamericanos 25 (June 2003): 93-108.","cites":null},{"id":43713334,"title":"During Mother’s Absence: The Fiction of Michèle Roberts.” British Women Writing Fiction. Ed. Abby H.P. Werlock. Tuscalosa: U of Alabama P,","authors":[],"date":"2000","doi":null,"raw":"Hanson, Clare. “During Mother’s Absence: The Fiction of Michèle Roberts.” British Women Writing Fiction. Ed. Abby H.P. Werlock. Tuscalosa: U of Alabama P, 2000. 229-47.","cites":null},{"id":43713343,"title":"Feminism and Cultural Memory: An Introduction.” Signs 28.1 (Autumn","authors":[],"date":"2002","doi":"10.1086\/340890","raw":"Hirsch, Marianne and Valerie Smith. “Feminism and Cultural Memory: An Introduction.” Signs 28.1 (Autumn 2002): 1-19. Irigaray, Luce. An Ethics of Sexual Difference. Trans. Carolyn Burke and Gillian C.","cites":null},{"id":43713350,"title":"Food, Sex and God: On Inspiration and Writing.","authors":[],"date":"1998","doi":null,"raw":"Roberts, Michèle. Food, Sex and God: On Inspiration and Writing. London: Virago, 1998.","cites":null},{"id":43713353,"title":"Hystories: Hysterical Epidemics and Modern Culture.","authors":[],"date":"1997","doi":"10.2307\/2568242","raw":"Showalter, Elaine. Hystories: Hysterical Epidemics and Modern Culture. London: Picador, 1997.","cites":null},{"id":43713333,"title":"In Between Locations: Space, Time and the Female Subject","authors":[],"date":"2006","doi":"10.1177\/1464700106061452","raw":"Gamble, Sarah. “In Between Locations: Space, Time and the Female Subject in Michele Roberts’s In the Red Kitchen.” Feminist Theory 7.1 (2006): 7-26.","cites":null},{"id":43713339,"title":"Lewis. Father-Daughter Incest.","authors":[],"date":"1981","doi":"10.1007\/978-1-4615-2820-3_50","raw":"Herman, Judith Lewis. Father-Daughter Incest. Cambridge, Mass.: Harvard UP, 1981.","cites":null},{"id":43713346,"title":"Michèle Roberts.” Contemporary British and Irish Fiction: An Introduction Through Interviews.","authors":[],"date":"2005","doi":null,"raw":"Newman, Jenny. “Michèle Roberts.” Contemporary British and Irish Fiction: An Introduction Through Interviews. Sharon Monteith, Jenny Newman, Pat Wheeler. London: Arnold, 2005. 119-34.","cites":null},{"id":43713351,"title":"My Father’s House.” Fathers: Reflections by Daughters.","authors":[],"date":"1983","doi":null,"raw":"---. “Outside My Father’s House.” Fathers: Reflections by Daughters. Ed. Ursula Owen. London: Virago, 1983. 103-12.","cites":null},{"id":43713325,"title":"Not Outside the Range: One Feminist Perspective on Psychic Trauma.” Trauma: Explorations in Memory. Ed. Cathy Caruth. Baltimore: Johns Hopkins UP,","authors":[],"date":"1995","doi":null,"raw":"Brown, Laura S. “Not Outside the Range: One Feminist Perspective on Psychic Trauma.” Trauma: Explorations in Memory. Ed. Cathy Caruth. Baltimore: Johns Hopkins UP, 1995. 100-112.","cites":null},{"id":43713356,"title":"Phantasmagoria: Spirit Visions, Metaphors and Media into the Twenty-First Century.","authors":[],"date":"2006","doi":"10.1111\/j.1468-5922.2007.00693_7.x","raw":"Warner, Marina. Phantasmagoria: Spirit Visions, Metaphors and Media into the Twenty-First Century. Oxford: Oxford UP, 2006.","cites":null},{"id":43713324,"title":"Radical Spirits: Spiritualism and Women’s Rights","authors":[],"date":"1989","doi":"10.2307\/25143537","raw":"Braude, Ann. Radical Spirits: Spiritualism and Women’s Rights in Nineteenth century America. Boston: Beacon Press, 1989.","cites":null},{"id":43713338,"title":"Shattered Subjects: Trauma and Testimony on Women’s Life Writing.","authors":[],"date":"1999","doi":"10.2307\/464475","raw":"Henke, Suzette A. Shattered Subjects: Trauma and Testimony on Women’s Life Writing. London: Macmillan, 1999.","cites":null},{"id":43713352,"title":"Spiritualism and Depth Psychology in Michèle Roberts’s Victorian Novel.” Rereading Victorian Fiction.","authors":[],"date":"2002","doi":"10.1057\/9780230371149_14","raw":"Rowland, Susan. “Women, Spiritualism and Depth Psychology in Michèle Roberts’s Victorian Novel.” Rereading Victorian Fiction. Ed. Alice Jenkins and Juliet John. London: Palgrave, 2002. 201-14.","cites":null},{"id":43713329,"title":"Testimony: Crises of Witnessing in Literature, Psychoanalysis and History.","authors":[],"date":"1992","doi":"10.1525\/lal.1992.4.1.02a00050","raw":"Felman, Shoshana and Dori Laub. Testimony: Crises of Witnessing in Literature, Psychoanalysis and History. London: Routledge, 1992.","cites":null},{"id":43713330,"title":"The Aetiology of Hysteria.” 1896.","authors":[],"date":null,"doi":"10.1037\/e417472005-101","raw":"Freud, Sigmund. “The Aetiology of Hysteria.” 1896. The Standard Edition of the Complete Psychological Works of Sigmund Freud. Trans. and ed. James Strachey. Vol. 3. London: Hogarth, 1953-74. 189-221.","cites":null},{"id":43713345,"title":"The Assault on Truth: Freud and Child Sexual Abuse.","authors":[],"date":"1984","doi":null,"raw":"Masson. Jeffrey. The Assault on Truth: Freud and Child Sexual Abuse. 1984. London: Fontana, 1992.","cites":null},{"id":43713349,"title":"The Darkened Room: Women, Power, and Spiritualism in Late Victorian England. Chicago: U of Chicago P,","authors":[],"date":"1989","doi":"10.2307\/25130282","raw":"Owen, Alex. The Darkened Room: Women, Power, and Spiritualism in Late Victorian England. Chicago: U of Chicago P, 1989.","cites":null},{"id":43713354,"title":"The Female Malady: Women,","authors":[],"date":"1987","doi":"10.2307\/1862832","raw":"---. The Female Malady: Women, Madness and English Culture, 1830-1980. London: Virago, 1987.","cites":null},{"id":43713328,"title":"The Memory Wars: Freud’s Legacy in Dispute. London: Granta,","authors":[],"date":"1997","doi":null,"raw":"Crews, Frederick, et al. The Memory Wars: Freud’s Legacy in Dispute. London: Granta, 1997. Falcus, Sarah. “Michèle Roberts: Histories and Herstories in In the Red Kitchen, Fair Exchange and The Looking Glass.” Metafiction and Metahistory in Contemporary Women’s Writing. Ed. Ann Heilmann and Mark Llewellyn.","cites":null},{"id":43713347,"title":"The Other World: Spiritualism and Psychical Research in England,","authors":[],"date":"1985","doi":"10.1017\/s0022046900044134","raw":"Oppenheim, Janet. The Other World: Spiritualism and Psychical Research in England, 1850-1914. Cambridge: Cambridge UP, 1985.","cites":null},{"id":43713322,"title":"The Trial of Woman: Feminism and the Occult Sciences in Victorian Literature and Society.","authors":[],"date":"1992","doi":"10.5860\/choice.30-0739","raw":"Works Cited Basham, Diana. The Trial of Woman: Feminism and the Occult Sciences in Victorian Literature and Society. New York: New York UP, 1992.","cites":null},{"id":43713344,"title":"The Victorian Woman Question in Contemporary Feminist Fiction London:","authors":[],"date":"2005","doi":"10.1057\/9780230503571_1","raw":"King, Jeanette. The Victorian Woman Question in Contemporary Feminist Fiction London: Palgrave Macmillan, 2005.","cites":null},{"id":43713341,"title":"Trauma and Recovery: The Aftermath of Violence - From Domestic Abuse to Political Terror.","authors":[],"date":"1992","doi":"10.1007\/s12646-011-0080-3","raw":"Herman, Judith. Trauma and Recovery: The Aftermath of Violence - From Domestic Abuse to Political Terror. New York: Basic Books, 1992. Hirsch, Marianne. “Marked By Memory: Feminist Reflections on Trauma and Transmission.” Extremities: Trauma, Testimony, Community. Ed. Nancy K.","cites":null},{"id":43713355,"title":"Trauma and Survival in Contemporary Literature. Charlottesville: U of Virginia P,","authors":[],"date":"2002","doi":null,"raw":"Vickroy, Laurie. Trauma and Survival in Contemporary Literature. Charlottesville: U of Virginia P, 2002.","cites":null},{"id":43713327,"title":"Unclaimed Experience: Trauma, Narrative, and History.","authors":[],"date":"1996","doi":"10.2307\/3200758","raw":"Caruth, Cathy. Unclaimed Experience: Trauma, Narrative, and History. Baltimore: Johns Hopkins UP, 1996.","cites":null},{"id":43713357,"title":"Visions and Re-Visions: Women and Time in Michèle Roberts’s In the Red Kitchen.” Women: A Cultural Review 15.2 (Autumn","authors":[],"date":"2004","doi":"10.1080\/0957404042000234033","raw":"White, Rosie. “Visions and Re-Visions: Women and Time in Michèle Roberts’s In the Red Kitchen.” Women: A Cultural Review 15.2 (Autumn 2004): 180-91.","cites":null}],"documentType":{"type":0.6666666667}},"contributors":[],"datePublished":"2008-12","abstract":"This is a pre-copy-editing, author-produced PDF of an article accepted for publication in Contemporary Women's Writing following peer review. The definitive publisher-authenticated version Contemporary Women's Writing, 2008, 2 (2), pp. 111-130 is available online at: http:\/\/cww.oxfordjournals.org\/.Michèle Roberts, author of twelve novels (as well as three volumes of poetry, two short story collections and a memoir) and currently Professor of Creative Writing at the University of East Anglia, has stated that much of her fiction is concerned with rescuing women “or other ‘lost voices’, people who’ve been written out of history” (Newman 121). Her fifth novel, In the Red Kitchen (1990) - recently republished as Delusion (2008) - is a historical novel that reflects Roberts’s prevailing concerns: the damaging impact of patriarchy, the social and psychological facets of female oppression, the enduring effect of childhood fears and desires, the workings of the unconscious, and the importance of imagination. Like all her work, In the Red Kitchen reimagines the lives of women by rewriting patriarchal narratives, but it also marks the beginning of her focus on historical figures, a shift that entails a questioning of history itself. Various critics have discussed Roberts’s treatment of history in relation to this novel. This essay builds on existing criticism by proposing that In the Red Kitchen not only constructs counter-histories that contest a dominant version of the past but also explores how cultural memory is retrieved and transmitted. Further, I show that Roberts underlines connections between the personal and the political by paralleling problems encountered in the recovery of women’s history with the difficulties faced by her female protagonists as they struggle to recover, and recover from, their own painful pasts.  [Taken from the introduction]Peer-reviewedPost-prin","downloadUrl":"http:\/\/hdl.handle.net\/2381\/9788","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/9788\/1\/%5b03%5d%20Recovering%20Women%20Aug%202008.pdf","pdfHashValue":"5d58fc0704f5a08b80eb52b671bc7562a1586b87","publisher":"Oxford University Press","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/9788<\/identifier><datestamp>\n                2011-10-28T01:01:37Z<\/datestamp><setSpec>\n                com_2381_849<\/setSpec><setSpec>\n                com_2381_9548<\/setSpec><setSpec>\n                col_2381_9371<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nRecovering Women: History, Trauma, and Gender in Michèle Roberts’s In the Red Kitchen<\/dc:title><dc:creator>\nParker, Emma<\/dc:creator><dc:description>\nThis is a pre-copy-editing, author-produced PDF of an article accepted for publication in Contemporary Women's Writing following peer review. The definitive publisher-authenticated version Contemporary Women's Writing, 2008, 2 (2), pp. 111-130 is available online at: http:\/\/cww.oxfordjournals.org\/.<\/dc:description><dc:description>\nMichèle Roberts, author of twelve novels (as well as three volumes of poetry, two short story collections and a memoir) and currently Professor of Creative Writing at the University of East Anglia, has stated that much of her fiction is concerned with rescuing women “or other ‘lost voices’, people who’ve been written out of history” (Newman 121). Her fifth novel, In the Red Kitchen (1990) - recently republished as Delusion (2008) - is a historical novel that reflects Roberts’s prevailing concerns: the damaging impact of patriarchy, the social and psychological facets of female oppression, the enduring effect of childhood fears and desires, the workings of the unconscious, and the importance of imagination. Like all her work, In the Red Kitchen reimagines the lives of women by rewriting patriarchal narratives, but it also marks the beginning of her focus on historical figures, a shift that entails a questioning of history itself. Various critics have discussed Roberts’s treatment of history in relation to this novel. This essay builds on existing criticism by proposing that In the Red Kitchen not only constructs counter-histories that contest a dominant version of the past but also explores how cultural memory is retrieved and transmitted. Further, I show that Roberts underlines connections between the personal and the political by paralleling problems encountered in the recovery of women’s history with the difficulties faced by her female protagonists as they struggle to recover, and recover from, their own painful pasts.  [Taken from the introduction]<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPost-print<\/dc:description><dc:date>\n2011-10-27T12:06:26Z<\/dc:date><dc:date>\n2011-10-27T12:06:26Z<\/dc:date><dc:date>\n2008-12<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nContemporary Women's Writing, 2008, 2 (2), pp. 111-130<\/dc:identifier><dc:identifier>\n1754-1476<\/dc:identifier><dc:identifier>\nhttp:\/\/cww.oxfordjournals.org\/content\/2\/2.toc<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/9788<\/dc:identifier><dc:identifier>\n10.1093\/cww\/vpn015<\/dc:identifier><dc:identifier>\n1754-1484<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\n© 2008, the author. Deposited with reference to the publisher’s archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nOxford University Press<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["1754-1484","issn:1754-1484","1754-1476","issn:1754-1476"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article"],"fullText":"Recovering Women: History, Trauma and Gender in Michèle Roberts’s In the \nRed Kitchen \n \nMichèle Roberts, author of twelve novels (as well as three volumes of poetry, two \nshort story collections and a memoir) and currently Professor of Creative Writing at \nthe University of East Anglia, has stated that much of her fiction is concerned with \nrescuing women “or other ‘lost voices’, people who’ve been written out of history” \n(Newman 121). Her fifth novel, In the Red Kitchen (1990) - recently republished as \nDelusion (2008) - is a historical novel that reflects Roberts’s prevailing concerns: the \ndamaging impact of patriarchy, the social and psychological facets of female \noppression, the enduring effect of childhood fears and desires, the workings of the \nunconscious, and the importance of imagination. Like all her work, In the Red Kitchen \nreimagines the lives of women by rewriting patriarchal narratives, but it also marks \nthe beginning of her focus on historical figures, a shift that entails a questioning of \nhistory itself. Various critics have discussed Roberts’s treatment of history in relation \nto this novel.1\nReading the novel as a trauma narrative, I propose that the central characters \nare each haunted by a past they are unable to acknowledge consciously and that the \nspirits and specters that appear to them are symptoms of psychic distress. Marianne \n  This essay builds on existing criticism by proposing that In the Red \nKitchen not only constructs counter-histories that contest a dominant version of the \npast but also explores how cultural memory is retrieved and transmitted. Further, I \nshow that Roberts underlines connections between the personal and the political by \nparalleling problems encountered in the recovery of women’s history with the \ndifficulties faced by her female protagonists as they struggle to recover, and recover \nfrom, their own painful pasts.  \n 2 \nHirsch notes that “much of the work on trauma and memory has been resistant to \ngender differentiation and has not been overtly informed by feminist thinking” \n(“Marked”  77).2 Published when trauma was emerging as a concept in literary and \ncultural studies, In the Red Kitchen anticipates and addresses this critical lacuna by \npresenting patriarchy as source of trauma for women and by asserting a specifically \nfeminist mode of recovering the past on both an individual and collective level.3\n \n By \nexploring the part that the unconscious and the imagination play in retrieving a past \nthat is unavailable, the novel bears out Roberts’s belief that “memory and the \nimagination are crucially linked inside some kind of ‘inner space’” (Food 125). As In \nthe Red Kitchen demonstrates, this belief enables women to become the agents as well \nas the subjects of history, ensuring their survival in both personal and historical \ncontexts. \nThe Phallusy of History \nIn the Red Kitchen interweaves the lives of three central protagonists: Hat, an ancient \nEgyptian princess (based on the female pharaoh Hatshepsut), Flora Milk, a Victorian \nmedium (modeled on Florence Cook), and Hattie King, a cookery book writer living \nin late twentieth-century London. Although famous, few details are known about the \ntwo women who inspired Roberts’s historical characters, their exceptional lives \nhaving been either unrecorded or erased from public record. Hat anticipates \nobliteration from history when she dreams that details of her life, recorded on her \ntomb, are defaced, leaving her, like her historical counterpart, “unwritten. Written out. \nWritten off” (133). In her influential study of Victorian spiritualism, The Darkened \nRoom (published the year before Roberts’s novel), Alex Owen notes that a similar fate \nbefell spiritualists like Cook: “women have been virtually written out of a movement \n 3 \nin which they originally held a revered and privileged place” (Introduction, n.p.). \nFurther, what is known of Cook comes from male observers: journalists reporting her \nséances or scientists investigating spiritualism, most notably William Crookes, who \nrecorded a series of experiments undertaken to ascertain the validity of the medium’s \npowers following allegations of fraud (and which form the basis of Roberts’s \nimaginative reconstruction of Florence Cook’s life). Indicating that the record of \nfemale lives has been overlooked or controlled by male custodians of the past, at the \nend of the novel Flora’s autobiography lies unread in a box sealed by “masking tape” \n(138), whisked away from Hattie’s inquisitive eyes by a  male relative. However, by \ncreating a series of first person narrators, Roberts allows those hidden by history to \nspeak, producing a woman-centred “her-story” that refutes the “phallusy” of history, a \nfallacious version of the past that supports a patriarchal order in the present.  \nAt the same time, the novel is skeptical about the possibility of offering an \naccurate account of the past. “Truth,” it suggests, is a grand narrative defended by \npatriarchal institutions, namely, science and religion. As a scientist, William Preston, \nFlora’s patron, styles himself as a “seeker after truth” (95) and Minny, his wife, \nconsults “Reverend Butler’s little book” in order to ascertain “the great truths of \neternity” (4). Likewise, Sister Julian chastises Hattie for “making up stories” at school \n(135), and her insistence that she learn “a regard for the truth” indicates a binary \nopposition between truth and fiction that the novel deconstructs (136).  \nIn addition, Roberts’s postmodern narrative employs multiple voices to stress \nthe indeterminacy of historical truth and uses unreliable narration to question the \nauthority of history. For example, Minny calls Flora an “angel” (34), while Rosina, \nFlora’s sister, condemns her as a monster (1). While the views of the higher classes \nhave traditionally been privileged by history, the authority that accompanies Minny’s \n 4 \nstatus as a bourgeois lady is undermined by discrepancies between her letters and \nFlora’s narrative: Minny is convinced that she is “aiding” her protégé (69), but Flora \ncomplains that she “suffers” from Minny’s philanthropy (60), and Minny’s belief that \nFlora “has no secrets” is contradicted by Flora’s affair with her husband (66). It is \nironic that Minny wishes to protect Flora from “unscrupulous persons only too ready \nto be in close proximity to a young, beautiful and innocent girl” because such a threat \nis posed by her supposedly respectable, middle-class husband. Although Minny \npresents herself as a devoted wife and mother, her own respectability is called into \nquestion by suggestions that she is guilty of adultery and infanticide. Like her \npatronizing treatment of Flora, the inconsistencies in Minny’s account of the séance \nbetray her  snobbery:  she claims to experience “that divine feeling which unites \nwomen’s hearts across the barriers of class and creed” (52), but moments later shrinks \nfrom Mrs. Milk’s face,  which is “so very red and coarse” (52). The fallibility of \nMinny’s memory is another factor that makes her narrative unreliable: although she \ninsists that her account of the séance is “exact,” “sober and factual” (47), she later \nadmits that she cannot recall the names of two women in attendance (50). \nFlora and Rosina are equally unreliable narrators. While Rosina claims to tell \nthe “truth” when she denounces her sister as a fraud (1), the revelation that Flora \nblocked her career as a medium and stole her lover suggests that her defamatory \nremarks are motivated by a desire for revenge. If Rosina’s version of events is shaped \nby self-interest, Flora’s is shaped by a lack of self-awareness: she insists that she does \nnot weep at her father’s funeral but, tasting salt, suddenly realizes, “I am crying” (2). \nBecause the multiple narratives have to be read in relation to each other, Roberts \nillustrates that history is constructed rather than recorded, and always subject to \ninterpretation.  \n 5 \nBy fictionalizing historical figures, the novel also blurs the boundary between \nhistory and fiction, pointing to the creative processes at work in all accounts of the \npast. The fictional status of history is further suggested by Hattie’s first cookery book, \nLeaves from a Convent Kitchen Garden, as the nuns’ recipes it records - “kidneys in \nred wine, brains in butter, liver in Calvados with apples and cream” (12) - contrast her \nmemory of eating “bones and gristle and fat, sour greens, soapy carrots” at her \nconvent school (11). Reflecting the conservatism of the heritage industry, Hattie’s \nbook is a success because it hits “just the right note of nostalgic chic” (12). Like The \nCountry Diary of an Edwardian Lady, a bestseller throughout the 1980s, it \nromanticizes a putative pre-feminist past, harking back to an era when the traditional \nstructures of gender and class were still firmly in place. Hattie’s book thus highlights \nhow the past is constructed to serve the status quo. \n \nSpiritualism and Subversion \nRoberts’s concern with the recovery of lost voices is reflected in the novel’s use of \nspiritualism: the Victorian movement founded on the belief that the spirits of the dead \ncommunicate with the living through mediums. In her portrayal of Flora Milk, \nRoberts echoes and extends established views of the function and significance of \nnineteenth-century mediumship. Several critics have proposed that spiritualism \nappealed to spirited women, and offered those dissatisfied with the limits of their \ngender role a means of escape and empowerment.4  As the “Author’s Note” makes \nclear, Roberts draws on the work of Alex Owen, one of the first feminist critics to \nsuggest that spiritualism provided women with a covert means of “circumventing \nrigid nineteenth-century class and gender norms” (4).  \n 6 \n  Roberts’s novel complements Owen’s historical analysis of spiritualism in a \nnumber of ways. The qualities that Flora requires to be a medium, receptivity and \npassivity, epitomize normative femininity: “I am open, and I am empty” (63); “I am a \nhollow stick the spirits blow messages down” (92). Indeed, Minny’s comparison of \nFlora to an “angel” evokes the Victorian model of womanhood (34), Coventry \nPatmore’s “Angel of the House.” Yet, spiritualism, which brings fame and fortune, \nalso permits Flora independence, enabling her to resist (at least initially, at least \npartially) the conventional female identities that she abhors: “I don’t want to be a wife \nor a mother” (76). Spiritualism likewise fulfils Flora’s “ardent longings for a better \nlife” (67). Refusing to become a “dogsbody and drudge” (32), she dreams of wearing \n“ballgowns with real bustles” (28), and her powers as a medium make her “worthy of \nthe respect one gives a lady” (81). Spiritualism thus enables Flora to transgress her \ngender role and class position.   \nWhereas Janet Oppenheim views Victorian spiritualism as a response to the \ndecline of religion in the face of science, an attempt to counter a Victorian crisis of \nfaith (111), Pamela Thurschwell proposes that psychic phenomena such as \nmediumship helped to spawn psychoanalysis. She quotes Adam Philips to elaborate  \non the relationship between the two: “sexuality and the unconscious were the new, \nscientifically prestigious words for the occult, of that which is beyond our capacity for \nknowledge, for the weird, unaccountable effects people have on each other. In \npsychoanalysis, the supernatural returns as the erotic” (Thurschwell 118). Similarly, \nRoberts suggests that spiritualism enabled the covert expression of female desire. Like \nmany Victorian mediums, Flora is young, pretty, and adored by her audience. Minny \ncomments that Mr. Andrews’s conduct is “governed more by admiration for the \nyoung medium’s lovely person than by reverence for my description of the sacred \n 7 \nmessages she imparted” (81) and, confirming Rosina’s assertion that Flora is loved by \n“the ladies as much as the gentlemen” (1), Minny is not immune to Flora’s “maidenly \ncharms” (48). Illustrating that séances “oozed sexuality” and authorized otherwise \nimpermissible acts of physical intimacy (Owen 218), Minny searches Flora before a \nperformance, paying particular attention to her “underclothes” and admiring her \n“form” which, she confesses, gives her “no small pleasure” (48). Minny describes \nherself as Flora’s “affectionate” patroness, calling her “My darling,” and convinces \nherself that their private séances produce an “intimacy” (65). Thus, In the Red Kitchen \nprecedes by nine years Sarah Waters’s neo-Victorian bestseller Affinity (1999), which \nalso underlines the opportunities spiritualism presented for the covert staging of same-\nsex desire. \nA sexual subtext is equally palpable in Flora’s relationship with William. \nFlora finds William “handsome” and notes his “full red lips” (60). Despite this \nattraction, there is a suggestion that, having been denounced as a fraud, she implicitly \noffers herself to him sexually in return for the testimonial that she requires to save her \nreputation. However, because sexual purity is integral to the ideal of Victorian \nwomanhood and respectability is a crucial component of her professional status, \nFlora’s sexual advances can only be made obliquely. Flora offers to submit herself to \nscientific tests, to William’s “penetrating” gaze and “probing” questions, asserting \nthat she “will do anything” to prove her powers (62, emphasis added). William’s eyes \nflicker over her “mouth,” “throat” and “breast” and Flora trembles with “excitement” \nas he holds her hand (63). Taboo desire is expressed through body language: “I run \nmy tongue over my lips, to moisten them” (63). \n  Owen proposes that spirit materialization allowed for a remarkably explicit \nenactment of the forbidden and that spirits were given permission to behave in ways \n 8 \nthat would have been unacceptable in adult women (216). Reflecting this, Hattie, the \nspirit that Flora manifests, performs a provocative dance, exposes herself and then has \nsex with William: “Hattie is shameless,” Flora comments, “because she is a spirit” \n(122). Like Owen, who contends that “spiritualist practice bought to light the hidden \nand repressed components of the psyche,” revealing “the subversive otherness of the \nunconscious” (204; 226), Roberts presents Hattie as Flora’s double, the “Other” who \nembodies the repressed or socially unacceptable aspects of the self. In a state of semi-\nconsciousness, Flora projects what is forbidden (female desire) onto a persona: “Flora \nwould never do what Hattie does. Flora is a good girl” (123). Thus, Flora \nsimultaneously endorses and subverts Victorian ideas about female sexuality.  \n \nSpiritualism and Trauma  \nHowever, unlike Owen, Roberts suggests that spiritualism signifies unconscious pain \nas well as protest. While In the Red Kitchen points to the medium’s potential for \ntransgression, echoing the Hungarian psychoanalyst Sándor Ferenczi, it also presents \nsupernatural voices and visions as symptoms of trauma, specifically the trauma of \nchild abuse.5\n Shoshana Felman defines trauma as an overwhelming experience that \ncannot be fully apprehended or processed. Traumatic occurrences are those that “have \n Ferenczi believed that in the struggle to avoid sexual violence an abused \nchild could develop an acute sensitivity, learning to read other people’s minds like a \nmedium (Masson 184). As Thurschwell explains, in Ferenczi’s view, childhood \nsexual trauma can thus initiate clairvoyant or telepathic hypersensitivity (146). Just as \nRoberts’s representation of spiritualism anticipates that of Waters, so it also precedes \n(by fifteen years) Hilary Mantel’s critically acclaimed novel Beyond Black (2005), \nwhich likewise explores the relationship between mediumship and sexual trauma.  \n 9 \nnot settled into understanding or remembrance, acts that cannot be constructed as \nknowledge nor assimilated into full cognition, events in excess of our frames of \nreference” (Felman and Laub 5). Because trauma is, in Cathy Caruth’s terms, \n“unclaimed experience” (10), it cannot be referenced in any straightforward way. \nAlthough never stated directly, Flora’s narrative suggests that she has been sexually \nabused by her father: “that lap in the exhausted armchair can sometimes be safely \nclimbed into. Power over those hands, that lap, that kissing mouth, it comes and goes” \n(18, emphasis added). However, repressing painful memories of the past, Flora \ncontinues to adore her father, whom she describes as “my dear one” (3). Flora admits \nthat her childhood memories are incomplete, especially those that evoke pain, and \nrepression is indicated not only by her delayed acknowledgement of tears at the \nfuneral but also by the fact that she cannot recall details of the distressing episode \nwhen, as a child, she was punished for being naughty by being shut in a cupboard, and \nsubsequently forgotten:  “Only after a long time did someone come and let me out, \none of the neighbours I think it was, I don’t remember” (2).  \n Flora’s trauma is compounded by the revelation that her father never wanted \nher to be born and encouraged her mother to induce a miscarriage. While Flora \nreceives this upsetting news at her father’s funeral, it is not revealed until later in the \nnarrative due to repression: “terror wants to be wax plugging my ears” (125). In the \nmoment when the news is first delivered, Flora focuses on a worm destroyed by a \nthrush, symbolizing her mother’s attempt to abort her pregnancy: “one dart of the \nsharp beak and the bloodied broken body is tossed onto the bright green grass” (2). \nThe phallic beak also suggests sexual assault, like other disturbing images that \npervade the funeral scene, articulating Flora’s unconscious memories of incest: “Ivy \nsnakes everywhere, grasping strongly at stone crosses, hairy suckers reaching down \n 10 \nthrough fissures in granite slabs to claw at the rotting bodies beneath” (3). The \nunspeakability of trauma is symbolised by the “harsh black mesh” of the funeral veil \nthat “stretches tightly across” her mouth (2). \nHaunting and possession are metaphors commonly invoked to describe the \neffect of trauma. Laurie Vickroy suggests that, for a traumatised subject, “the past \nlingers unresolved” (12), and Caruth asserts that “to be traumatized is precisely to be \npossessed by an image or event” (5). Flora compares mediumship to “possession” \n(91), although the novel suggests that she is possessed not by spirits but her own \ntraumatic past. Reflecting that trauma, Flora finds communicating with the spirits \npainful: “It hurts. It frightens me” (92). The onset of Flora’s visions at her father’s \nfuneral and the appearance of spirits a week later, on his birthday, indicate that he is \nthe cause of her pain (76). Further implying that Flora’s psychic powers are related to \nher father, she feels his spirit hovering behind her the first time that she uses a ouija \nboard (45). Although Flora claims to mourn her father, she also feels “bile rising” at \nhis funeral (2), and later states that Hattie “keeps the secret, that Flora is angry” (128). \nThus, the spirits that Flora conjures up represent the return of the repressed, a \nmanifestation of her unspeakable rage and pain. \nTrauma is also suggested by the locations in which Flora manifests spirits. She \nconducts séances at the same kitchen table from which her mother repeatedly jumped, \ntrying to terminate her pregnancy, and conjures up Hattie from a cupboard, enabling \nFlora to disappear. That the desire for invisibility is a common response to terror is \ndemonstrated by her childhood response to maternal disapproval: she wants to \n“vanish, to disappear” (130).  Further, Flora unconsciously projects the painful \nknowledge that her mother tried to abort her pregnancy onto Rosalie, William and \nMinny’s dead daughter, who, speaking through Flora, announces, “Mother, you \n 11 \nsmothered me” (94). Flora is haunted by Rosalie because she represents her own \nunprocessed grief: “the wailing surrounds me as though the miserable baby were in \nthe room” (90-91). \n \nThe Repetition of the Past \nCaruth argues that one symptom of trauma is “the unwitting enactment of an event \nthat one cannot simply leave behind” (2). As trauma that has not been integrated into \nconscious knowledge returns, demanding recognition, repetition denotes psychic \ndistress. During performances that feature full-form materialization Flora returns to \nthe same “cabinet” in which she was locked as a child (48). The sense of paralysis \nfundamental to traumatic experience is recreated when, in order to discount trickery, \nshe is tied up. Moreover, Flora’s incestuous relationship with her father is restaged in \nher liaison with William, who notes that he is old enough to be her father and assumes \na paternal role: “I certainly should not like either of my daughters to be in your \npredicament” (62). When William forces himself on Hattie, Flora’s spirit guide, she \nresists, insisting “I’m a good girl daddy” (122). Judith Herman notes that an abused \ngirl often prefers to believe that abuse is not taking place and, to keep the abuse secret \nfrom herself, develops dissociative states (Trauma 43; 102). In an attempt to protect \nherself from pain and helplessness, Flora enters a trance-like state and splits herself in \ntwo, creating Hattie: “William puts his fingers inside Hattie, while Flora lies \nunconscious on the sofa next door…. Flora knows nothing” (122-23). Flora \nunconsciously invents Hattie to “comfort and sustain me, hold me… hold me up and \nhold my pain” (131).  \nAt La Salpetrière (a fictional reconstruction of Charcot’s clinic at La \nSalpêtrière), the relationship between male doctors and “their darlings” (128), the \n 12 \nfemale patients, mirrors that between father and daughter: Flora undresses and dances \nfor the doctors “just like she dances for her daddy” (127). Flora later marries George, \na man who resembles her father, and when George dies Flora expresses her fury for \nher father by destroying her wedding photographs: “My grief eased itself a little \nthrough jabbing at grey shiny cardboard, ripping my mouth in two, crushing George’s \nface between my hands” (139). Repetition occurs not just in Flora’s own life but also \nbetween generations of women in her family. Like her mother before her, Flora is \nforced to marry a man who resents her because she is pregnant, and her daughter \ngrows up feeling inadequately nurtured by a mother who never wanted her to be born. \nSubsequently, Lily, like Flora, is “angry about the past” (141). Repetition thus \nindicates that those who do not understand the past are condemned to repeat it. \nRather than indicating an ahistorical view of a universal patriarchy, parallels \nbetween protagonists located in different times and places underline the persistence of \nthe past in the present. Just as the absence of chapters merges the multiple narratives \ninto one, various factors connect the women: Flora’s spirit guide is an ancient \nEgyptian princess, and Hattie writes a cookery book inspired by the Tutankhamun \nexhibition catalogue; at points, both women wear a “turban” that makes them \nresemble Hat (57; 96); while Hat is a princess, Sister Julian describes Hattie as a \n“spoilt little princess” (135). Hattie not only lives in the house that was formerly \ninhabited by Flora and works in the Hannibal Dining Rooms, where Flora meets Mr. \nPotson, but the two women also “become” ancient Egyptian royals, employing \nfantasy \/ phantasy to feel empowered. Like Hat, who declares herself a man in order \nto take the throne, as a child Hattie wishes to be an ancient Egyptian “king” (135). \nHattie’s association of power with men evokes the Conservative Prime Minister \nMargaret Thatcher, whose masculine image was satirized in the television show \n 13 \nSpitting Image, which depicted her wearing a pin-striped suit and smoking a cigar. \nSuch links point to the enduring power of patriarchy, regardless of its socio-\nhistorically specific forms.  \nParallels between Flora and Hattie likewise point to the persistence of \npatriarchy. Both women perform roles devised by men: Flora mimes the role of \nhysteric at La Salpetrière – “I copy some of the gestures of the girls in the white \nnightdress in the photographs” (127) – and, working as a prostitute, Hattie discovers \nthat she is a good “actress” who “could be the degraded angel, the ever-welcoming \nmother, the tart with the heart of gold, the severe nanny, whatever the men required” \n(14). Illustrating that patriarchy punishes those who defy the norms of gender, when \nthey refuse to conform to a male-defined feminine ideal, both women are accused of \nmonstrosity: Rosina condemns Flora as a “monster in silk skirts” (1), and Hattie’s \nlover accuses her of being a “feminine monster” (103).  \nThe most significant connection between the three main protagonists, and one \nthat underlines the continuing power of male hegemony, is their status as victims of \nsexual abuse. Like Flora, both Hat and Hattie are traumatised by a painful past that \nproduces unconscious symptoms of distress. Hat, the ancient Egyptian princess, \nbecomes her father’s lover and then his wife. Although she does not repress \nknowledge of this incestuous relationship, Hat cannot “claim” it in a psychoanalytic \nsense because she is unable to conceive it as abuse. This is partly because, as Jack \nGoody explains, there was no taboo against father-daughter incest amongst pharaohs \nin ancient Egypt (129). Also, Hat realizes that knowledge is linked to language – \nwriting makes scribes “wise” (24) – and that language is man-made: writing is a male \npreserve, and Hat’s father dons the guise of Thoth, the god of writing. Thus, \n 14 \npatriarchal systems of language and knowledge prevent Hat from acknowledging her \nabuse.  \nAlthough Hat is unable to acknowledge her abuse and ostensibly rejoices in a \nrelationship that brings power and status, her narrative nonetheless intimates trauma. \nShe compares her sexual initiation to death and expresses terror despite her assertion \nthat she does not feel afraid: when her father appears dressed as Thoth, she focuses on \nhis “sharp bird claws” and a “harsh jutting beak” (72), just as Flora concentrates on \nthe “sharp beak” of a bird as it destroys a worm at her father’s funeral (2). In addition, \nHat’s narrative contains gaps created by what is unspeakable: “No. I can’t say it. I \ncan’t bear to say it” (133). A reference to “nightmares” likewise indicates \nunconscious distress (133). Further, the “O” (146) that Hat becomes when she is \nerased from history invokes Breuer’s patient Anna O. (Bertha Pappenheim), whose \ncase history he published with Freud in Studies on Hysteria. Breuer’s analysis of \nAnna O. led Freud to argue in “The Aetiology of Hysteria,” an essay outlining his \nseduction theory, that hysteria was caused by childhood sexual trauma.6\nHattie, the contemporary protagonist, expresses a sense of vulnerability that \nsuggests trauma early on in her narrative: “I know that the deep dark pit waits just in \nfront of my feet; I have fallen into it often enough” (27). However, having repressed \nmemories of sexual abuse by her uncle, she cannot confront the past: “I never let \nmyself think of my aunt and uncle” (26); “Mine has been a history of breakages, of \nlosses. I want to forget all that” (101). Although Hattie is abused by her uncle, rather \nthan her father, he embodies both roles, like Charles Redburn in the nineteenth-\ncentury strand of the narrative:  Redburn professes “paternal” feelings for Flora and \nadopts an “avuncular” tone in his letters to her (67). Hattie is further traumatized by a \nmiscarriage, and, as her response to this tragedy demonstrates, repression functions as \n  \n 15 \na self-protective strategy: “it’s not only other people who would prefer me not \nmention it. I myself don’t want to have to feel it” (88). As a cook, she uses food as “a \ndrug to dull memory and pain” and, as painting over old wallpaper in the house that \nshe is renovating symbolizes, she works hard to make the past “disappear” (87; 26). \nLike Flora, Hattie is unconsciously compelled to repeat the pattern of abuse and falls \ninto prostitution without being fully aware of her actions: “I didn’t admit to myself \nwhat I was up to” (14). Her inability to name the act of prostitution underlines the \nunspeakability of trauma: “I didn’t call it prostitution. I simply charged men for sex” \n(14). Likewise, having been taught that incest is a sin “too wicked to mention” (87), \nas a child Hattie is unable to tell a priest about her abuse because she “couldn’t get the \nwords out” (137).  \nHattie exhibits a range of traumatic symptoms: she never loses sight of the \ndoor, sleeps with a knife under her pillow, and has recurrent nightmares about a \nburglar with “wobbly hands” (72), “who tiptoes upstairs in slippered feet and \nwhispers to me to hush” (40), or waits “under my bed in the dark” (135). Towards the \nend of the narrative, her aversion to answering the phone is explained as another \nresponse to trauma: abused by her uncle in the dark, Hattie “tried to pretend that he \nwas just a voice, like on the telephone” (136). Her passion for cookery and DIY can \nalso be read as signs of psychic distress. Vickroy observes that an attempt to create \nand maintain a sense of agency and order is a common strategy of protagonists in \ntrauma fiction (24). Cookery endows Hattie with a sense of agency and transformative \npowers – cooking, her hands “destroy, repair, create” (137) - and composing recipes \n“I unmade and remade the world” (87). Similarly, renovating her house reflects a \ndesire to rebuild her life and impose order on chaos: “I want to create a pattern out of \nthe disorder of this house” (101).  \n 16 \nWhile Hattie, like Flora, claims psychic powers, a “capacity for telepathy” \n(39), the ghostly figures that she hears and sees around her house can also be read as \nsymptoms of trauma. Ferenczi proposes that for the sexually abused subject, who \nbecomes hypersensitive to paranormal phenomena, hallucinations are “an illusionary \nworking through of real events” (Thurschwell 147). Likewise, Caruth states that, \nalthough repressed, trauma “continues to make an appearance,” often in the “delayed, \nuncontrolled repetitive appearance of hallucinations and other intrusive phenomena” \n(11).  Despite Hattie’s attempt to push away the past, it “leaps back …in flashes” (17) \nand, like the sight of the old house standing “strongly” beneath the surface of the new, \nthese apparitions represent “an insistent memory that will keep breaking through” \n(54). Hattie admits “feeling haunted” (40), but refuses to “believe in ghosts” (40), \nsuggesting that she is haunted not by the dead but by her own history. For example, \nHattie’s vision of a young girl, blue with “unspoken and unspeakable rage” (103), \nholding her breath in the dark as the bedroom door opens and a man prepares to enter, \nis an unacknowledged memory of childhood: “A haunting I held at arm’s length like a \nphotograph that I wanted to destroy” (104).  \nSeveral critics propose that Hat, Flora and Hattie connect and communicate \nacross the boundaries of time and space.7 However, while Flora appears to see Hat \nand Hattie appears to see Flora, the novel calls the veracity of these visions into \nquestion, contradicting what seems apparent and generating a sense of \nepistemological uncertainty. The figure that Hattie encounters in the basement and \nformer kitchen may resemble Flora, but she also represents both Hattie’s unborn baby \nand Hattie’s younger self. Like Flora, who has her first vision of Hat in the cemetery \nthat resembles an “Ancient Egyptian city” and later manifests an Egyptian princess \n(116), Hattie’s unconscious is shaped by her surroundings: it produces a figure \n 17 \ndressed in Victorian clothes because she represents the past, and Hattie lives in a \nVictorian house. The first time that Hattie sees the young woman in the basement that \nis suddenly “brightly lit” by “red flames” (56), she seems to be witnessing Flora as \nshe makes contact with the spirit world using the ouija board. However, words uttered \nby the figure that Hattie observes suggest that she represents herself: “It’s you, she \nstammered: it’s you” (57). Further, this vision echoes Hattie’s first, in which she sees \na giantess cooking in a “cavernous underground kitchen” (11), a figure with whom \nHattie identifies: “I…dreamed I was the big woman in the warm red kitchen \nunderground” (16). Indicating that this figure also represents a longed-for child, \nHattie later attributes her vision to pregnancy: “My desire for a daughter getting the \nbetter of me” (57).  \nThe second vision, which occurs after Hattie’s miscarriage, is a symptom of \nmourning.  Hattie enters the basement “angry” and full of “hate” (104), feelings that \ncommonly accompany grief, and shortly before the figure appears, wishes that she \ndrove a chariot like Elijah’s, “with knives and flames on the wheels” (88). While this \nwish expresses fury, the reference to Elijah, a biblical character who raised the dead, \nalso communicates her desire to restore her child, which she does unconsciously \nthrough the vision. Although the pieces of “broken type” with which the young girl \nplays suggest Flora (105), who plays with type as a child, they also evoke Hattie’s \nbaby, who is described as “broken” (73), and Hattie herself, whose history is one of \n“breakages” (101). Further, the figure identifies herself as “Hattie,” and expresses the \nfeelings of hatred that consume Hattie after her miscarriage, through the words that \nshe spells out:  “HATTIE. HATE. I” (105). The age of the girl, who is “ten years old \nor so” (104), suggests that it cannot be Flora because she sees Hattie - “Finding my \nface looking into hers, she dropped her bits of type, put a hand up to shield herself” \n 18 \n(105) - whereas Flora does not “see” Hat(tie) until after her father’s death when she is \nsixteen (32). As Hattie is eight when she tries to tell the chaplain about her abuse, the \nage of the girl who appears in the basement further suggests that she represents \nHattie’s younger self.  \nThe third appearance of the girl once more articulates the sorrow that stems \nfrom both incest and miscarriage. Hattie follows the sound of sobbing to the \nbasement, where she finds a girl locked in a cupboard. While the cupboard suggests \nFlora, who was locked in a cupboard as a child, it also evokes Hattie who attempted to \ntell a priest about her incestuous relationship with her uncle in a confessional that was \n“like a little cupboard” (137). Although the distraught girl’s “sodden blue rag” further \nsuggests Flora (119), who bathes herself in a blue light that “washes me out, replaces \nme” (120), it likewise points to Hattie, who holds “pale blue” rosary beads during \nconfession (137). Hattie even remarks that she feels the girl’s pain “as keenly as \nthough it were my own” (118). As cupboards and ovens are conflated in Hattie’s first \nvision, which occurs in the “cupboard-like, oven-like confessional” (11), and as Hattie \ncompares the “oven” to a “womb” (thinking of Mary, she states, “Christ leapt in her \nwomb as the bread leapt in the oven” [12]), the image of the girl in the cupboard \nsuggests her unborn child. The subject of Hattie’s initial vision - a giantess cooking an \n“omelette” in an “underground kitchen” (11) - also suggests fertility through an \nallusion to eggs. Hattie’s vision of the girl in the cupboard thus represents an \nunconscious attempt to restore the longed-for daughter lost through miscarriage. As \nHattie states, “I wanted her to be mine” (119).  \nAll three protagonists face psychological annihilation, making them, in \nSuzette Henke’s terms, shattered subjects. The sequence of words that signals Hat’s \nerasure from history implies psychological breakdown:  \n 19 \n KING HAT \nHAT KING \nHATTIE KING \nHATTIE NOT KING \nHATTIE NOTHING \nHATTIE NOT \nHATTIE \nHAT \nHA \nH \nO (146) \nAs a symbol of circularity (indicative of the traumatised subject’s compulsion to \nrepeat the past) and the vagina (often referred to as a “hole” and perceived in terms of \nabsence and negation by Freud), “O” implicitly links Hat’s breakdown to sexual \ntrauma. Similarly, Flora is “shattered” by the spirits that visit her - “I break up into \nlittle pieces” (92) - and Hattie’s history of “breakages” leaves her in “bits” (101). Like \nthe image of broken type, the fragmented structure of the three narratives, which \nconstantly interrupt each other, reflects the fragmentation of the self that results from \ntrauma. \n \nRecovery: Remembering and Healing  \nIn spite of the shattering effects of trauma, memory offers a route to recovery. Trauma \ntheorists propose that the pain of the past must be relived - that is, remembered - to be \nrelieved. As Dori Laub states, “One has to know one’s buried truth in order to be able \nto live one’s life” (Felman and Laub 63). Unable to claim her trauma, peace eludes \n 20 \nHat: “I am a spirit condemned to roam for ever through the dark, never to find a \nresting place” (133). Flora forces herself to recall the painful events at La Salpetrière, \nwhere she is betrayed by William: “I will force myself to write down what happened. \nI will go back in there, and remember” (120). However, her capacity to confront \ndistressing experiences is limited. When Flora is reminded that her father wanted “to \nget rid of the baby” (125), she attempts to avoid the painful knowledge that he willed \nher destruction by covering her face with a cloth, “So that I can make myself go \naway” (126).  Further, as the image of her ripped mouth on the wedding photograph \nthat she destroys indicates, repression prevails, leaving Flora unable to articulate the \ntruth about her incestuous relationship with her father: “I put all my pain and grief \ninto the wall, sealing it up hard and smooth as ice, and I leave it there” (131). Thus, \nFlora lives through, but never learns to live with, trauma. Consequently, at the end of \nher life, she still “hurts” and feels full of “sorrow” (141). Likewise, both Hat and \nFlora are reduced to “nothing” (4; 146). \nHowever, as her name indicates (Hattie King: the reverse of King Hat), \nRoberts’s most modern protagonist turns the tragic fate of her historical predecessors \naround. Encouraged by her lover “to confront the pain of loss” (103), Hattie begins \nthe process of healing when she releases the sobbing girl from the kitchen cupboard, \nsymbolizing the end of repression. Following this scene, Hattie prepares to confront \nthe pain of her past directly: “Inside me was my childhood, alive and demanding, the \nlittle girl I’d been frightened of giving space to because of what she made me \nremember. Now it was time to remember” (119). Illustrating that “remembering \ninvolves re-membering” (Roberts, Food 125), Hattie dismembers and re-members her \nuncle. Her fantasy of feeding her abuser’s dismembered limbs to the fire in the \nkitchen range allows Hattie to both destroy and redeem him: “My task is to purify \n 21 \nhim. I have to burn him, to burn off the monstrous bits he doesn’t need, the growths \nthat disfigure him: his second pair of hands, his second mouth and tongue, his second \npenis” (137). Reflecting her own sense of renewal, Hattie’s uncle emerges from the \nfire “newborn” (137), and the theme of rebirth is echoed in the revelation that Hattie \nis pregnant again. This desire for renewal is shared by Hat and Flora before her. When \nHat’s father dies, she reflects on the process of mummification: “My father’s body \nwill have been made whole again…His body will be made anew” (37). Similarly, \ncomparing death to sleep at her father’s funeral, Flora comments, “he will rise again, \nhis body will be glorious and new” (3). However, whereas Hat and Flora locate \nchange in the future, Hattie enacts change in the present, breaking the disempowering \npatterns of the past. \n \nRepetition and Change  \nLike their relationship with the father, the characters’ attitude to the figure of the \nmother establishes a pattern of repetition and change, which points to women’s \nprogressive emancipation from patriarchy. In Father-Daughter Incest, Herman argues \nthat incest occurs most commonly in families where a patriarchal conception of \ngender, which privileges men over women, prevails: abusive fathers are “perfect \npatriarchs” and male superiority is unquestioned (71). Underlining that trauma is \ngendered, Roberts likewise presents incest as the product of patriarchy, which \nencourages daughters to idolize the father and denigrate the mother. For example, \nfathers are repeatedly conceived as gods: Hat believes that, after death, her father will \n“join the gods and become one of them” (35), and the first time that they have sex he \npresents himself as a god; at La Salpetrière, Flora declares that Dr Charcot, a paternal \nfigure, is “God” (125); Hattie, who is taught by the church to conceive God as her \n 22 \n“real Father” (86), compares her uncle (and adoptive father) to Christ: “He is the \nbody, he is the blood” (137).  \nIn contrast to the special bond that Hat and Flora share with their fathers, \nwhich develops out of a desire for the power that he represents, mother-daughter \nrelations are characterized by hostility.8\nHerman points out that abused daughters turn to fathers for love because they \nfeel “deprived of maternal affection” (Father 80). Hat and Hattie grow up motherless, \nand Flora is not only the product of an unwanted pregnancy but also feels neglected \nby a mother who is overwhelmed by domestic duties. The absence of maternal \nnurturance is also reflected in Minny’s letters to her mother, which continually look \nforward to a “long-deferred visit” (146). In interview, Roberts has discussed \nadolescence and mother-daughter alienation in terms of trauma (Newman 127), \nevoking what Irigaray terms women’s state of déréliction: the sense of abandonment \nthat results when the female subject moves from the Imaginary, a psychic realm \nassociated with the mother, to the Symbolic, the patriarchal order dominated by the \nLaw of the Father (Irigaray 67-69). As Clare Hanson notes, Roberts’s writing is \ndriven by a quest for the lost mother, a quest that has both personal and political \n Hat repudiates her mother, denying the part \nthat she played in her birth: “It was my Father in his divine form who begot and \nbirthed me; his earthly queen being merely the vessel for his power” (54). Just as Hat \nhas her father’s lover (a potential step-mother) assassinated, so Flora wishes her \nmother, a rival for her father’s affection, “dead” (128). Likewise, she imagines that \nWilliam, a surrogate father-figure, wants to be rid of Minny, who expresses \n“maternal” feelings for Flora (145): “Mincing Minny. Daddy would like to get rid of \nher but can’t say so” (128). Similarly, Hattie expresses antagonistic feelings when she \nblames her mother for her miscarriage.  \n 23 \nsignificance (230-31). While both Hat and Flora flirt with and dance seductively for \ntheir fathers, the novel suggests that the daughter’s incestuous desire for the father \nmasks a more profound but taboo longing for the mother and maternal nurturance. Hat \ndescribes her father in maternal terms - “it is my father who carries me close to his \nheart, who bears me on his lap, who nurses me on the milk of his wisdom, who \nnourishes me with his great learning” (53). Moreover, when Hat’s father dies, his \nbody is embalmed and wrapped in linen, thereby transforming her daddy into a \nmummy. Flora’s surnames - first “Milk” then “Cotter” (evoking a baby’s cot) - \nsuggest a similar desire for maternal nurturance, and Flora’s fantasy about being her \nfather’s “sword” (that is, penis) suggests an unconscious desire to be reunited with her \nmother: “One night she dreams that thus she can go where he goes: into the warm \nsweet mother” (128). Indicating that attention from the father offers “compensation” \nfor what is lacking in her relationship with her mother (Herman, Father 83), cuddling \nher father, Flora focuses on “How far away Mother is” (30). Flora’s desire for \nmaternal nurturance finds unconscious expression in the plea that she “channels” from \nRosalie, “Mother me” (95), and in later life Flora admits that she fears the loss of her \nmother: “Mother is old. Flora is frightened she will die” (127).  \nWhile Hat and Flora repudiate the mother, Hattie restores the mother-daughter \nbond that is, according to Herman, essential to healing in the context of incest (Father \n145). In contrast to Flora, Hattie longs for a daughter. However, her connection with a \nwoman in a supermarket demonstrates that a potentially empowering mother-daughter \nbond need not be biological. Standing in front of the cleaning products, unable to \nremember what she came to buy, a woman offers Hattie some advice about furniture \npolish: “That’s the one you want, love. Not this one. That’s beeswax, see? Much \nbetter. That’s what my daughter-in-law always says, you can’t beat beeswax” (89). \n 24 \nThe value of the maternal bond is indicated by the fact that Hattie later uses the polish \n(which is not only recommended by a maternal figure but also evokes, through its \nreference to bees, matriarchy) to restore a “deeply scratched” table that reflects her \ndamaged sense of self: “Some of the scratches disappeared” (90). As Roberts has \nstated that the house represents the maternal body in her fiction, Hattie’s journey from \nhomelessness to home also reflects her symbolic acceptance of the mother (Bastida \nRodriguez 99). Hat, Flora and Hattie all face literal and metaphorical homelessness \nbut overcome the threat of exile with varying degrees of success. Hat ends up \nhomeless: “I have lost the carved and painted house that sheltered my remains” (133). \nFlora saves enough money to buy her house, but it remains an unheimlich \n(uncanny\/unhomely) space haunted by spirits. Hattie, however, finds a place of safety \nand makes herself a home in the house that she restores with her lover and in which \nthey prepare to welcome their new baby. \n \nTestimony \nHattie’s recovery rests not only on the rejection of patriarchy, implicit in her \naffirmation of the mother-daughter bond, but also on her ability to testify. Trauma \ntheorists assert that testimony plays a vital role in the therapeutic process: to “know” \none’s story, it is necessary to “tell” one’s story (Felman and Laub 78). As Vickroy \npoints out, testimony is particularly important in relation to crimes like incest that are \noften either unwitnessed or denied (6). Hat never manages to translate traumatic \nexperience into language, and the result is catastrophic. As Laub states, the “loss of \nthe capacity to be a witness to oneself and thus to witness from the inside is perhaps \nthe true meaning of annihilation, for when one’s history is abolished, one’s identity \nceases to exist as well” (Felman and Laub 82). Hence Hat becomes “NOTHING” \n 25 \n(146). Just as Flora employs body language to express taboo desires, like a hysteric, \nshe expresses trauma through a corporeal discourse - “Since I may not speak… I must \nlet my body shape words for me. My body full of knowledge….I must act my \nmeaning through my body” (127) - but her case history is recorded by male doctors. \nConsequently, she never approaches recovery. Towards the end of her life Flora \nbegins an autobiography, but she writes to restore the men that she has loved and lost \nrather than to heal herself: “to pick up my poor son’s shattered body and mend it, to \nhold my husband in my arms and heal him” (141). Thus, Flora does not find writing \ntherapeutic: “I only get as far as feeling my sorrow all over again” (141). In contrast, \nHattie records her memories in her diary, which she keeps because “I want to give \nmyself a history” (17). Her diary bears witness to traumatic events of the past and \nfunctions as a form of “scriptotherapy” (Henke 78).  \nTestimony enables restitution partly because it makes trauma real. Ancient \nEgyptian Hat realizes that “words cut into the stone walls of the tomb, signifying real \nthings like bread and beer, are real things themselves, more real than the bread and \nbeer, for they remain forever and make the bread and beer endure forever too” (24). \nHowever, without the words to construct a testimony, she is unable to realize her \ntrauma. In contrast, recording her miscarriage in her diary makes Hattie’s trauma real:  \n“Why write it down here? To make it real. To make the memory of this time real; \nshould it pass” (86). While In the Red Kitchen thus suggests that, if women do not \nwish their lives to be mis-read, they must write their own (hi)stories, Roberts also \nindicates that reading those (hi)stories is a duty that must be shared by all. Illustrating \nthat testimony requires a witness, that “only when the survivor knows he is being \nheard, will he stop to hear - and listen to - himself” (Felman and Laub 71), Hattie’s \ndiary entries address a figure called “you” who is first her lover and then her unborn \n 26 \nbaby (73; 139). As “you” also implicitly addresses the reader, Roberts implies that \nrecovery of the past cannot be a private enterprise and must be a collective rather than \nan individual responsibility. \n \nPast and Present  \nLike many historical novels, In the Red Kitchen employs the past to comment \non the present. Published at a time when the silence on incest was being broken,9 the \nnovel contributes to debates about the veracity of women’s memories of childhood \nsexual trauma and the relationship between fantasy, reality and truth that emerged in \nthe 1980s, the decade that gave rise to the “memory wars.”10\nDuring the 1980s, Alice Miller, whom Roberts identifies as an influence \n(Food 80), and Jeffrey Masson both published high-profile critiques of Freud’s \nrenunciation of the seduction theory, arguing that when he shifted his focus from \nactual incidents of childhood sexual abuse to fantasies or memories of fantasies driven \nby the infant’s unconscious sexual drives (the Oedipal complex), Freud betrayed “not \nonly his female patients but history as well” (Thurschwell 5). Feminist critics have \nmade similar points about Freud’s treatment of Dora (Ida Bauer). As Elaine Showalter \nnotes, after turning away from the seduction theory, Freud’s earlier sensitivity to \nfemale experience was sacrificed for the sake of his emerging psychoanalytic system \n(Female 158). By attributing Dora’s hysteria to an incestuous desire for the father, the \nanalyst overlooked the social factors contributing to her illness, that is, patriarchy. \nSpecifically, Freud failed to take seriously Dora’s sexual exploitation at the hands of \nher father, who had handed her over to his friend, Herr K., in exchange for tacit \npermission to continue his affair with Herr K’s wife. \n   \n 27 \nIn Roberts’s novel, Minny’s narrative underscores the importance of situating \nhysteria in its social context. Prior to the publication of Freud’s seduction theory, \nVictorian doctors, like the ancient Egyptians - “the first to propose that the flight of \nthe uterus from its normal position was the root of female disorders” (Fell 3) - \nconsidered the cause of hysteria to be physiological. As William demonstrates, this \nmeant that social determinants of illness were overlooked. While William treats \nMinny for a nervous disorder, prescribing the rest cure, the text indicates that she is \nsuffering from post-natal depression, caused by the overwhelmingly oppressive role \nof wife and mother. Minny is the victim of a relentless round of childbearing, which \nleaves her with an unshakeable sense of “lethargy and depression” that  - echoing \nestablished feminist views of hysteria as proto-feminist protest - only eases on holiday \nwhen she hardly sees her “little monsters” (109; 20).11\nMoreover, Flora’s experience, like her name, echoes that of Dora, indicating \nthat views of hysteria that both preceded and succeeded Freud’s seduction theory led \nwomen’s account of sexual trauma to be dismissed as delusion, a theme underscored \nby the novel’s new title. Owen illustrates that Victorian medical men associated \nspiritualism with hysteria (149), and, reflecting this, William plans “to compare the \nphysiology of persons endowed with mediumistic gifts with that of those afflicted \nwith hysterical illnesses, having some intuition that the two conditions may, at certain \n The unspeakability of Minny’s \nsuffering points to trauma - “words cannot express what I endured; it is better \nperhaps, to draw a veil over [it]” (109) - and trauma that is repressed erupts in \n“terrifying nightmares” (111). Despite her veiled protest, by submitting Minny to the \nrest cure, William’s “care” ensures her continuing disempowerment:  “total bed rest in \na darkened room” and “copious quantities of warm milk” leave Minny diminished (as \nher name indicates), passive and infantilized (131).  \n 28 \npoints, overlap” (112). He also covers up his affair with Flora by taking her to \nCharcot’s Parisian clinic, where her “wild and fanciful disclosures” are dismissed as \n“Delloosyon” (129). Minny echoes her husband’s view that hysterics are “deranged” \nand rejects Flora’s allegations of murder and sexual misconduct as “examples of the \ndangers of an uncontrolled imagination” (143-44). Like Flora, Hattie is accused of \n“exaggeration, of faking, of hysteria” after her miscarriage (88). By paralleling the \n1890s with the 1980s, Roberts implicitly compares the Victorian view that hysterics \nsuffered delusions with the later contention that women who recover memories of \nchildhood sexual abuse are subject to False Memory Syndrome.12\n Further, like trauma theorists, Roberts questions what constitutes historical \ntruth. Laub notes that traumatic memories may not correlate directly with historical \nfacts but argues that this does not compromise the truth of those memories (Felman \nand Laub 62). Similarly, while Roberts acknowledges that memory, like history, is \nalways “a series of fictions” (Food 124), In the Red Kitchen also suggests that fiction \nhas as great a claim to truth as fact. Hattie’s second cookery book, a collection of \nrecipes for meals that she imagines Colette sharing with female friends, points to the \ncrucial role that imagination plays in recovering the truth of an unavailable past. \nAlthough this book does not do “quite so well” as Leaves from a Convent Kitchen \nGarden (12), indicating the dominant order’s preference for fact over fiction, it \nsuggests that creative reconstructions of the past are as authentic and legitimate as \nofficial historical records. Published by “a feminist house” (12), Hattie’s book thus \noffers a woman-centred model of history that affirms an alternative mode of historical \ntruth. \n \n \n \nConclusion \n 29 \nReflecting on rumours of an affair excited by the collaboration between \nFlorence Cook and William Crookes, Owen states that the “finite details of this \nepisode will probably never be known” (230).  In the Red Kitchen attempts to recover \nunrecorded aspects of the past - principally women’s lives - by reading the silences \nand subtexts in history.  In so doing, Roberts not only challenges patriarchal versions \nof the past that support the socio-political structures of the present, but also asserts a \nnew form of historical memory, one akin to that acknowledged by trauma studies in \nits affirmation of the imagination and the unconscious as means of retrieving a past \nthat lies out of reach. Further, by paralleling the recovery of history with recovery \nfrom trauma induced by male hegemony, In the Red Kitchen stresses that, in terms of \nboth women’s history and women’s health, the end of patriarchy is essential to female \nsurvival.  \n \n \n \n \n                                                 \n1 Susan Rowland demonstrates that the novel is in dialogue with various Victorian discourses and \nJeanette King discusses the text in the context of the recent fashion for neo-Victorian fiction. Rosie \nWhite (181), Sarah Gamble (7), and Sarah Falcus (141) all draw on Kristeva’s theory of “Women’s \nTime” to argue that In the Red Kitchen challenges the linearity of history. \n2 See also Hirsch and Smith.. \n3 The work of Judith Herman and Laura S. Brown is an exception here. As Brown notes, a feminist \nanalysis of sexual violence against women challenges a definition of trauma based on male experience \nand draws attention to traumatic events through which “the dominant culture and its forms and \ninstitutions are expressed and perpetuated” (102). I am grateful to Victoria Stewart for drawing this \nessay to my attention. \n4 Ann Braude and Diana Basham also offer feminist studies of spiritualism. Marina Warner touches on \ngender issues in Phantasmagoria, although she, like Pamela Thurschwell, is more interested in \nconnections between spiritualism and mediums of communication: the telegraph, the telephone and \nphotography. \n5 Once Freud’s closest professional friend, a rift developed between the two when Ferenczi reclaimed \nFreud’s seduction theory in the 1930s. Whereas Freud abandoned his theory that neurosis is caused by \nchildhood sexual trauma after the publication of “The Aetiology of Hysteria,” asserting in “An \nAutobiographical Study” that accounts of abuse were “fantasies” that patients “made up”  (34), \nFerenczi believed that the assaults uncovered in therapy had actually taken place.  \n6 Breuer disagreed with Freud’s seduction theory but Herman’s observation that, once recovered, \nBertha Pappenheim devoted her life to, amongst other things, campaigning against the sexual \n 30 \n                                                                                                                                            \nexploitation of women and children seems to support Freud’s assessment  of the cause of her illness \n(Trauma 19).  \n7 See, for example, White (183-85), Gamble (12-13), and Falcus (143).  \n8 Roberts discusses the pain caused by her own unconsciously incestuous attachment to her father in \nher essay “Outside My Father’s House.”   \n9 Judith Herman’s book Father-Daughter Incest, the first feminist analysis of the subject, was \npublished in 1981. In Britain, Child Line, a telephone support service for abused children was founded \nin 1986, and the Cleveland child sexual abuse scandal bought the subject of incest to even greater \npublic prominence in 1987.   \n10 See Frederick Crews, The Memory Wars (1997). \n11 See Elaine Showalter, The Female Malady (147; 60-61).   \n12 For an example of the argument against the validity of recovered memory, see Elaine Showalter’s \nHystories. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 31 \n                                                                                                                                            \n \n \n \n \n \n \nWorks Cited \n \nBasham, Diana. The Trial of Woman: Feminism and the Occult Sciences in Victorian  \n Literature and Society. New York: New York UP, 1992. \nBastsida Rodriguez, Patricia. “On Women, Christianity, and History: An Interview  \nwith Michèle Roberts.” Atlantis: Revista de la Asociacion Espanola de \nEstudios Anglo-Norteamericanos 25 (June 2003): 93-108.  \nBraude, Ann. Radical Spirits: Spiritualism and Women’s Rights in Nineteenth century  \n America. Boston: Beacon Press, 1989. \nBrown, Laura S. “Not Outside the Range: One Feminist Perspective on Psychic  \nTrauma.” Trauma: Explorations in Memory. Ed. Cathy Caruth. Baltimore: \nJohns Hopkins UP, 1995. 100-112. \nCaruth, Cathy. Unclaimed Experience: Trauma, Narrative, and History. Baltimore:  \n Johns Hopkins UP, 1996. \nCrews, Frederick, et al. The Memory Wars: Freud’s Legacy in Dispute. London:  \n Granta, 1997. \nFalcus, Sarah. “Michèle Roberts: Histories and Herstories in In the Red Kitchen,  \nFair Exchange and The Looking Glass.” Metafiction and Metahistory in \nContemporary Women’s Writing. Ed. Ann Heilmann and Mark Llewellyn. \nLondon: Palgrave, 2007. 133-46. \nFell, Alison, ed. Serious Hysterics. London: Serpent’s Tail, 1992. \nFelman, Shoshana and Dori Laub. Testimony: Crises of Witnessing in Literature,  \n 32 \n                                                                                                                                            \n Psychoanalysis and History. London: Routledge, 1992. \nFreud, Sigmund. “The Aetiology of Hysteria.” 1896. The Standard Edition of the  \nComplete Psychological Works of Sigmund Freud. Trans. and ed. James \nStrachey. Vol. 3. London: Hogarth, 1953-74. 189-221. \n---. “An Autobiographical Study.” 1925. Standard Edition 20:1-74. \nGamble, Sarah. “In Between Locations: Space, Time and the Female Subject in  \n Michele Roberts’s In the Red Kitchen.” Feminist Theory 7.1 (2006): 7-26. \nGoody, Jack. “The Labyrinth of Kinship.” New Left Review 36 (November-December  \n 2005): 127-39. \nHanson, Clare. “During Mother’s Absence: The Fiction of Michèle Roberts.” British  \nWomen Writing Fiction. Ed. Abby H.P. Werlock. Tuscalosa: U of Alabama P, \n2000. 229-47. \nHenke, Suzette A. Shattered Subjects: Trauma and Testimony on Women’s Life  \n Writing. London: Macmillan, 1999. \nHerman, Judith Lewis. Father-Daughter Incest. Cambridge, Mass.: Harvard  \n UP, 1981. \nHerman, Judith. Trauma and Recovery: The Aftermath of Violence - From  \n Domestic Abuse to Political Terror. New York: Basic Books, 1992. \nHirsch, Marianne. “Marked By Memory: Feminist Reflections on Trauma and  \nTransmission.” Extremities: Trauma, Testimony, Community. Ed. Nancy K. \nMiller and Jason Tougaw. Urbana: Illinois UP, 2002. 71-91. \nHirsch, Marianne and Valerie Smith. “Feminism and Cultural Memory: An  \n Introduction.” Signs 28.1 (Autumn 2002): 1-19. \nIrigaray, Luce. An Ethics of Sexual Difference. Trans. Carolyn Burke and Gillian C.  \n Gill. Ithaca, New York: Cornell UP, 1993. \n 33 \n                                                                                                                                            \nKing, Jeanette. The Victorian Woman Question in Contemporary Feminist Fiction  \n London: Palgrave Macmillan, 2005. \nMasson. Jeffrey. The Assault on Truth: Freud and Child Sexual Abuse. 1984. London:  \n Fontana, 1992. \nNewman, Jenny. “Michèle Roberts.” Contemporary British and Irish Fiction: An  \nIntroduction Through Interviews. Sharon Monteith, Jenny Newman, Pat \nWheeler. London: Arnold, 2005. 119-34. \nOppenheim, Janet. The Other World: Spiritualism and Psychical Research in  \n England, 1850-1914. Cambridge: Cambridge UP, 1985. \nOwen, Alex. The Darkened Room: Women, Power, and Spiritualism in Late  \n Victorian England. Chicago: U of Chicago P, 1989. \nRoberts, Michèle. Food, Sex and God: On Inspiration and Writing. London: Virago,  \n 1998.  \n---. In the Red Kitchen. London: Vintage, 1990. \n---. “Outside My Father’s House.” Fathers: Reflections by Daughters. Ed. Ursula  \n Owen. London: Virago, 1983. 103-12. \nRowland, Susan. “Women, Spiritualism and Depth Psychology in Michèle  \nRoberts’s Victorian Novel.” Rereading Victorian Fiction. Ed. Alice Jenkins \nand Juliet John. London: Palgrave, 2002. 201-14.  \nShowalter, Elaine. Hystories: Hysterical Epidemics and Modern Culture. London:  \n Picador, 1997. \n---. The Female Malady: Women, Madness and English Culture, 1830-1980. London:  \n Virago, 1987. \nThurschwell, Pamela. Literature, Technology and Magical Thinking, 1880-1920.  \n Cambridge: Cambridge UP, 2001. \n 34 \n                                                                                                                                            \nVickroy, Laurie. Trauma and Survival in Contemporary Literature. Charlottesville:  \n U of Virginia P, 2002. \nWarner, Marina. Phantasmagoria: Spirit Visions, Metaphors and Media into the  \n Twenty-First Century. Oxford: Oxford UP, 2006. \nWhite, Rosie. “Visions and Re-Visions: Women and Time in Michèle Roberts’s In the  \n Red Kitchen.” Women: A Cultural Review 15.2 (Autumn 2004): 180-91. \n \n"}