{"doi":"10.1109\/JSAC.2003.819983","coreId":"102594","oai":"oai:epubs.surrey.ac.uk:2082","identifiers":["oai:epubs.surrey.ac.uk:2082","10.1109\/JSAC.2003.819983"],"title":"Providing Differentiated Service to TCP Flows Over Bandwidth on Demand Geostationary Satellite Networks","authors":["Karaliopoulos, Merkourios","Tafazolli, Rahim","Evans, Barry G"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-02","abstract":"The elasticity of transmission control protocol (TCP) traffic complicates attempts to provide performance guarantees to TCP flows. The existence of different types of networks and environments on the connections’ paths only aggravates this problem. In this paper, simulation is the primary means for investigating the specific problem in the context of bandwidth on demand (BoD) geostationary satellite networks. Proposed transport-layer options and mechanisms for TCP performance enhancement, studied in the single connection case or without taking into account the media access control (MAC)-shared nature of the satellite link, are evaluated within a BoD-aware satellite simulation environment. Available capabilities at MAC layer, enabling the provision of differentiated service to TCP flows, are demonstrated and the conditions under which they perform efficiently are investigated. The BoD scheduling algorithm and the policy regarding spare capacity distribution\\ud\nare two MAC-layer mechanisms that appear to be complementary\\ud\nin this context; the former is effective at high levels\\ud\nof traffic load, whereas the latter drives the differentiation at low traffic load. When coupled with transport layer mechanisms they can form distinct bearer services over the satellite network that increase the differentiation robustness against the TCP bias against\\ud\nconnections with long round-trip times. We also explore the use of analytical, fixed-point methods to predict the performance at transport level and link level. The applicability of the approach is mainly limited by the lack of analytical models accounting for prioritization mechanisms at the MAC layer and the nonuniform distribution\\ud\nof traffic load among satellite terminals","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Institute of Electrical and Electronics Engineers","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2082<\/identifier><datestamp>\n      2017-10-31T14:04:10Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:63637372<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2082\/<\/dc:relation><dc:title>\n        Providing Differentiated Service to TCP Flows Over Bandwidth on Demand Geostationary Satellite Networks<\/dc:title><dc:creator>\n        Karaliopoulos, Merkourios<\/dc:creator><dc:creator>\n        Tafazolli, Rahim<\/dc:creator><dc:creator>\n        Evans, Barry G<\/dc:creator><dc:description>\n        The elasticity of transmission control protocol (TCP) traffic complicates attempts to provide performance guarantees to TCP flows. The existence of different types of networks and environments on the connections’ paths only aggravates this problem. In this paper, simulation is the primary means for investigating the specific problem in the context of bandwidth on demand (BoD) geostationary satellite networks. Proposed transport-layer options and mechanisms for TCP performance enhancement, studied in the single connection case or without taking into account the media access control (MAC)-shared nature of the satellite link, are evaluated within a BoD-aware satellite simulation environment. Available capabilities at MAC layer, enabling the provision of differentiated service to TCP flows, are demonstrated and the conditions under which they perform efficiently are investigated. The BoD scheduling algorithm and the policy regarding spare capacity distribution\\ud\nare two MAC-layer mechanisms that appear to be complementary\\ud\nin this context; the former is effective at high levels\\ud\nof traffic load, whereas the latter drives the differentiation at low traffic load. When coupled with transport layer mechanisms they can form distinct bearer services over the satellite network that increase the differentiation robustness against the TCP bias against\\ud\nconnections with long round-trip times. We also explore the use of analytical, fixed-point methods to predict the performance at transport level and link level. The applicability of the approach is mainly limited by the lack of analytical models accounting for prioritization mechanisms at the MAC layer and the nonuniform distribution\\ud\nof traffic load among satellite terminals.<\/dc:description><dc:publisher>\n        Institute of Electrical and Electronics Engineers<\/dc:publisher><dc:date>\n        2004-02<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2082\/1\/SRF002800.pdf<\/dc:identifier><dc:identifier>\n          Karaliopoulos, Merkourios, Tafazolli, Rahim and Evans, Barry G  (2004) Providing Differentiated Service to TCP Flows Over Bandwidth on Demand Geostationary Satellite Networks   IEEE Journal on Selected Areas in Communications, 22 (2).  pp. 333-347.      <\/dc:identifier><dc:relation>\n        http:\/\/ieeexplore.ieee.org\/xpls\/abs_all.jsp?arnumber=1264079&tag=1<\/dc:relation><dc:relation>\n        10.1109\/JSAC.2003.819983<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2082\/","http:\/\/ieeexplore.ieee.org\/xpls\/abs_all.jsp?arnumber=1264079&tag=1","10.1109\/JSAC.2003.819983"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 22, NO. 2, FEBRUARY 2004 333\nProviding Differentiated Service to TCP Flows Over\nBandwidth on Demand Geostationary\nSatellite Networks\nMerkourios Karaliopoulos, Student Member, IEEE, Rahim Tafazolli, Member, IEEE, and\nBarry G. Evans, Senior Member, IEEE\nAbstract—The elasticity of transmission control protocol (TCP)\ntraffic complicates attempts to provide performance guarantees to\nTCP flows. The existence of different types of networks and envi-\nronments on the connections’ paths only aggravates this problem.\nIn this paper, simulation is the primary means for investigating\nthe specific problem in the context of bandwidth on demand (BoD)\ngeostationary satellite networks. Proposed transport-layer options\nand mechanisms for TCP performance enhancement, studied in\nthe single connection case or without taking into account the media\naccess control (MAC)-shared nature of the satellite link, are eval-\nuated within a BoD-aware satellite simulation environment. Avail-\nable capabilities at MAC layer, enabling the provision of differen-\ntiated service to TCP flows, are demonstrated and the conditions\nunder which they perform efficiently are investigated. The BoD\nscheduling algorithm and the policy regarding spare capacity dis-\ntribution are two MAC-layer mechanisms that appear to be com-\nplementary in this context; the former is effective at high levels\nof traffic load, whereas the latter drives the differentiation at low\ntraffic load. When coupled with transport layer mechanisms they\ncan form distinct bearer services over the satellite network that in-\ncrease the differentiation robustness against the TCP bias against\nconnections with long round-trip times. We also explore the use\nof analytical, fixed-point methods to predict the performance at\ntransport level and link level. The applicability of the approach is\nmainly limited by the lack of analytical models accounting for pri-\noritization mechanisms at the MAC layer and the nonuniform dis-\ntribution of traffic load among satellite terminals.\nIndex Terms—Bandwidth on demand (BoD), fixed point, geosyn-\nchronous earth orbit (GEO) satellite networks, media access con-\ntrol (MAC), split connections, transmission control protocol (TCP).\nI. INTRODUCTION\nTHE DOMINANCE of the Internet protocol (IP) within datanetworks seems today to be clearer than ever before. The\nexpectations in the late 1980s\/early 1990s that asynchronous\ntransfer mode (ATM) would be the future network protocol\nhave not materialized. Internet applications constitute the over-\nwhelming majority of data applications running over wired data\nnetworks; at the same time the penetration of IP in wireless net-\nworks is increasing, embracing different access technologies.\nBroadband satellite networks have been advertised as a\nsignificant part of the future global network infrastructure.\nManuscript received December 15, 2002; revised July 1, 2003 and September\n20, 2003. This work was supported in part by the Hellenic State Scholarships\nFoundation (I.K.Y).\nThe authors are with the Centre for Communication Systems Research,\nUniversity of Surrey, Guildford, Surrey GU2 7XH, U.K. (e-mail: M.Kara\nliopoulos@surrey.ac.uk; R.Tafazolli@surrey.ac.uk; B.Evans@surrey.ac.uk).\nDigital Object Identifier 10.1109\/JSAC.2003.819983\nWith significant advantages related to their inherent broadcast\ncapabilities, they embody a promising platform for the provision\nof medium and high bit rates to end-users. Three different\ntransport technologies have been proposed in the last decade for\nthese systems. ATM was central to the majority of initial system\nproposals, given the speculations for a future, all-ATM network\nat that time and the desire to achieve close integration with the\ncore terrestrial networks. On the contrary, the second family of\nsystems originates from the broadcasting community: digital\nbroadcasting systems making use of the MPEG-2 transport\nservices, with or without a satellite return channel, emerged as\na promising alternative for the implementation of broadband\nsatellite networks, one of their main advantages being the\navailability of standards (for example, see [1]). However, in the\nlight of the established IP dominance in terrestrial networks,\nnative-IP broadband satellite networks become more and more\nattractive, since they allow easier integration with the terrestrial\nnetwork infrastructure. Such systems have been the subject of a\nnumber of European projects and the “raison d’être” of the ETSI\nBroadband Satellite Multimedia (BSM) working group [2].\nThis paper investigates one of the issues arising in the afore-\nmentioned systems: the interaction of the most popular Internet\ntransport protocol, transmission control protocol (TCP), with\nbandwidth on demand (BoD) mechanisms envisaged for these\nnetworks. It is organized as follows. A brief review of TCP and\nBoD is given in Section II. The problem is then stated and pos-\nsible analytical approaches that might be of use in addressing it\nare reviewed in Section III. Their main assumptions and weak-\nnesses are highlighted before the formulation of the problem\nin fixed-point terms is presented. In Section IV, we describe\nthe system under consideration and the simulation methodology\nadopted for its study. Different options available at transport and\nMAC\/BoD level, capable of providing differentiated service to\nTCP flows, are demonstrated in Section V. One contribution\nof this work is the evaluation of proposed TCP modifications\nwithin a BoD-shared satellite environment. The actual perfor-\nmance gain obtained with these modifications is found to be less\nsignificant or even nonexistent, in comparison with results re-\nported for the single TCP connection case or for multiple TCP\nconnections, when BoD mechanisms are not taken into consid-\neration. The system load range over which these options per-\nform efficiently, as well as the “dynamic range” of the provided\ndifferentiation, are investigated. In parallel, the potential of the\nfixed-point approach to predict performance is discussed and\nits predictions—where the method is applicable—are compared\nagainst simulation results. Section VI concludes our study.\n0733-8716\/04$20.00 © 2004 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \n334 IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 22, NO. 2, FEBRUARY 2004\nII. TCP AND BoD\nA. Transmission Control Protocol (TCP)\nTCP is the protocol supporting the most popular Internet\napplications, the ones responsible for the overwhelming ma-\njority of Internet traffic. TCP performs dynamic window-based\nflow control, assisted by the feedback carried in ACK packets.\nUnder no congestion\/loss, TCP can open its window more\nquickly, exponentially, during slow-start and less aggressively\nduring congestion avoidance. The window value together with\nthe round-trip time (RTT) experienced by the connection, i.e.,\nthe time elapsing between the transmission of a packet and\nits successful acknowledgment, dictate the actual connection\nrate. The maximum TCP send window value poses an upper\nlimit to the amount of data that TCP can have “in-flight” with a\npending acknowledgment. Its value is dictated by the receiver\nbuffer availability (receive window) or may be set by the\napplication running on top of TCP. The RTT is a control signal\nfor TCP rate. Its decrease\/increase is interpreted in respective\nincrease\/decrease of the TCP rate. When congestion occurs at\nthe network, TCP may also experience packet loss. Duplicate\nacknowledgment or TCP retransmission timer timeouts are\ninterpreted as congestion alarms. In these cases, TCP performs\nerror recovery functions [3] and reduces its rate taking action\nthat differs from implementation to implementation (for\nexample, see [4] and [5]).\nTCP experiences difficulties over paths featuring high prop-\nagation delays, particularly when these paths involve wireless,\nerror-prone links. Given that this is almost always the case with\nsatellite links (networks), considerable effort has been devoted\nin the last decade to the enhancement of TCP performance in\nsuch environments. The majority of the respective proposals are\nrelated to modifications of the end hosts’ protocol stacks: the\nsender and\/or, to a lesser extent, the receiver implementation.\nTheir main drawback is that the TCP sender cannot infer on its\nown whether the loss of a packet is due to congestion or corrup-\ntion and act accordingly; it rather reduces its rate even when this\nis not necessary. Solutions involving network elements have,\ntherefore, been proposed and can be broadly classified into two\ncategories: In the first category, the network element—a router\nor a gateway at the border of wired and wireless network—may\nprovide explicit feedback to the sender regarding the reason for a\npacket loss. In the second category, these intermediate elements\nmay perform local error recovery functions or introduce other\nfeatures, of varying visibility to the end hosts, which attempt to\nhide the impact of errors from the sender. For a comprehensive\nsummary of these proposals the reader is referred to [6] and the\nreferences therein.\nB. Satellite MAC Protocols and Bandwidth on Demand\nSatellite MAC-layer protocols have been the subject of re-\nsearch for more than forty years. From the fixed assignment\nprotocols of mid and late1960s to the basic random access and\ncombined reservation\/random access protocols of the 1970s (see\nfor example [7]–[9]) and the integrated voice and data proto-\ncols of the 1980s (for example, see [10]), MAC protocols have\nbeen continuously evolving adapting to the terrestrial network\ntechnologies and the corresponding traffic pattern characteris-\ntics. The more recent emergence of multiservice networks led\nto multiclass protocols featuring a broader range of traffic han-\ndling capabilities in order to support most efficiently the in-\ncreasing variety of these networks’ applications. In fact, the\nenvisaged resource allocation mechanisms at MAC level are,\nto a large extent, independent of the overlaying network pro-\ntocol: the standard capacity allocation mechanisms, formally\ndescribed within the digital video broadcasting–return channel\nvia satellite (DVB-RCS) standard [1] for example, may be used\nfor the support of both the ATM-based and IP-based quality-of-\nservice (QoS) frameworks ([11], [12]).\nWith broadband satellite systems also targeting residential\nusers, BoD mechanisms are deemed necessary to accommodate\nthe burstiness of TCP\/IP traffic in a resource-friendly manner.\nResources (e.g., time slots) may be allocated per-request, be\nreserved for variable time intervals or be accessed in random\naccess mode. Spare, nonreserved capacity, may be distributed\nto terminals via free capacity allocation (FCA) mechanisms.\nThe resource assignments are scheduled by a controller (sched-\nuler) residing either on-board the satellite or at the ground. The\nscheduler may exercise different disciplines, consider priorities\namongst traffic classes or\/and even rely on traffic prediction for\nallocating resources. For a comparative review of satellite MAC\nprotocols, the interested reader is referred to [13].\nC. TCP and BoD Interaction\nLittle literature has been found on the interaction of TCP\nand BoD. The interaction of TCP with BoD mechanisms in the\ncontext of DVB-RCS networks is discussed in [14] and [15],\nusing simplistic approximations for the resource allocation pro-\ncedures described in the standard [1]. The authors in [14] con-\nsider a single TCP connection, while they model the volume-\nbased dynamic capacity (VBDC) allocation and FCA modes of\nDVB-RCS are modeled as independent processes: return link\nslots become available to the terminal either deterministically\n(periodically) or following some authoritative distribution (ex-\nponential or uniform). In [15], it is the BoD-related delay (ac-\ncess delay) that is independently modeled: the access delays re-\nlated to different DVB-RCS capacity allocation modes are one\nof the inputs to the simulation, i.e., chosen a priori irrespective\nof the link capacity and the number of connections that share\nthe link.\nA TCP-aware MAC implementation is proposed in [16]. The\nfundamental requirement in this approach is that the DAMA\nController, located either at the network control center (NCC)\nor on-board the satellite, can read protocol headers deeper in the\nMAC frame payload and predict capacity demand by different\nterminals following the per-connection TCP segment-ACK\npacket exchange. The main disadvantage of the scheme is that\nit increases the BoD controller complexity and raises additional\nconcerns about its scalability, on top of the security related\n(i.e., compatibility with IPsec) objections.\nIt is anticipated that an actual BoD simulation environment\nis required for a more elaborate study of the TCP performance\nover BoD satellite networks; this is what we have attempted to\nprovide in Sections IV and V. We demonstrate that the MAC\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \nKARALIOPOULOS et al.: PROVIDING DIFFERENTIATED SERVICE TO TCP FLOWS OVER BoD GEOSTATIONARY SATELLITE NETWORKS 335\nlayer provides enough flexibility for the support of qualitative\nservice differentiation for TCP flows over these networks via\nrather simple mechanisms that do not necessitate per-flow state\nat the MAC layer and\/or the overhead of estimation\/prediction\nrelated to [16]. But before proceeding with the simulation study,\nwe briefly review analytical approaches to the study of TCP\/IP\nnetworks and outline an analytical method for the study of TCP\nperformance over satellite networks. We discuss its main limi-\ntations in addressing the service differentiation problem in the\ncontext of BoD networks, advocating, in the same time, the sim-\nulation approach taken in the rest of this paper.\nIII. ANALYTICAL TREATMENT\nAnalytical approaches are always favored in performance\namalysis particularly when they are accompanied by neat,\nsimple-to-use formulas. Such formulas have been invoked\nextensively in problems related to telecommunication network\nanalysis and, more generally, resource management. The di-\nmensioning of telephone networks has relied heavily on the use\nof Erlang and Engset formulas; their extensions for multiuser,\nmultiservice networks, as well as the broad use of the effective\nbandwidth concept in the study of ATM networks, advocate\nfurther the value of these approaches.\nTCP traffic, however, does not lend itself to these analytical\nmethods. The lack of an inherent rate due to the adaptive nature\nof TCP, renders techniques that have been heavily used in the\ncontext of telephone and ATM network analysis inappropriate.\nIn the processor sharing (PS)-based models introduced in\n[17]–[19], classical queueing theory was invoked in order to\nstudy the interaction of adaptive TCP\/IP flows with the net-\nwork. The common drawback of these flow-level models is that\nthey cannot provide results for the packet-level dynamics of the\ntraffic (expressed as buffer queues, losses etc.). The most at-\ntractive property of PS-based models is their insensitivity prop-\nerty: the model outcome is not dependent on the actual distri-\nbution of connection arrivals or transferred file sizes but only\non their mean. This allows generalizing solutions derived under\nMarkovian theory to the more realistic cases of power-tail dis-\ntributions reported in literature for TCP traffic features (see for\nexample [20] and references therein).\nThe processor sharing-based models are an abstraction of the\nTCP-controlled resource sharing and ignore the actual details of\nthe protocol. On the contrary, fixed-point methods feature sepa-\nrate, explicit models for the TCP source and the resource (net-\nwork links, buffers) that are coupled with eachother: the TCP\nsend rate is an explicit function of the loss and delay experienced\nby the connection in the network nodes and links [21]–[23],\nwhich are in turn a function of the TCP send rates. Classical\nqueueing models such as the M\/D\/1\/K [24], the M\/M\/1\/K model\n[25] and some variation of it in [26], earlier proposed in [27],\nas well as active queue management (AQM) models [28], [29]\nhave been proposed for modeling the resource.\nThese formulas for the TCP send rate already introduce some\ninaccuracy: all three models ignore aspects of TCP congestion\ncontrol such as the fast retransmit algorithm and the fast re-\ncovery phase, while [21], [22] do not consider the slow-start\nphase at all. Likewise, the resource models in [24]–[27] fall back\non the Poisson assumption, this time at packet-level, in order to\ntake advantage of well-known queueing models. However, the\npacket arrival process for TCP\/IP traffic is largely different than\na point Poisson process, even at high aggregation levels [30].\nA. Fixed-Point Approximation\nIn the following, we outline a fixed-point method for pre-\ndicting TCP performance in geostationary satellite networks.\nIn doing so, we adopt the vector representation introduced by\nRoughan et al. in [24]. We generalize their formulation to cater\nfor networks including asymmetric, MAC-shared links and con-\nsider its application to the case of BoD satellite networks.\n1) Generic Formulation: Let be the set of network links\nand the set of routes (paths) of the TCP connections, cor-\nresponding to subsets of . If and are the cardinal-\nities of the two sets, i.e., and , then two\nrouting matrices and can be defined, one for\nthe forward path of the connection and one for the reverse (ACK\npackets path). Their elements equal unity when the link\nis included in the forward\/reverse connection path ,\nrespectively, , and 0, otherwise\n(1)\nLet also denote the capacities of the network links\nand the one-way propagation delays, related to them.\nThen, the vector of the RTTs of the paths can be\nwritten as\n(2)\nare the queueing delays at the output buffers of the\nlinks and is the component of the total path delay that\nis related to the link propagation delays.\nIf is the number of connections sharing the same path\nthe average window sizes (at path level) and the\nTCP maximum segment size and the ACK packet size, respec-\ntively, in path , the total send rate in the forward and the reverse\npath are given by\n(3)\n(4)\nThe notations and , where and are vectors, denote\nelement-wise multiplication\/division, respectively. The vector\nis defined in (9), is the maximum TCP send window\n(see Section II-A), while accounts for the reverse path load\nreduction due to delayed ACKs, .\nyields the mean send-rate of the\nconnections on path in segments\/s, according to any of the\nformulas in [21]–[23].\nThe offered load upon the network queues1 is then written\n(5)\n1In each network node there is one-to-one correspondence between queues\nand output links.\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \n336 IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 22, NO. 2, FEBRUARY 2004\nwhere the elements of the matrices are given\nby\nif\notherwise\n(6)\nIn (6), yields the position of the queue (link) within\npath and is the aggregate loss probability due to both con-\ngestion and link errors over the respective link.\nThe assumption is that\nin other words, there is no TCP data loss at the sender parts of\nthe connections at the end hosts, whose queues are the first ones\non the connections’ paths.\nWhat is then needed is to develop efficient resource models,\ni.e., models for the actual packet loss or delay that are experi-\nenced at the buffers of the different links. In general, losses and\ndelays may incur at any link on the connection’s path\n(7)\nand\n(8)\nwhere and are functions (formulae) yielding the delay\/loss\nsuffered at each link of capacity , when load is offered to\nit. The term is the loss probability related to link errors. In\norder to make the analysis feasible, the assumption of indepen-\ndent losses at each link is invoked, so that, if is the vector of\nsize whose components are all equal to 1, the path losses ex-\nperienced by the TCP senders on the connection paths may be\nwritten\n(9)\nThe TCP send rate is then dictated by the queueing losses\nand the link errors encountered in each link on the\nconnection path and the limitations set by the buffer availability\nat the TCP receiver peer or the application .\nThe medium access controlled links need particular attention\nin order to be accommodated in this framework: with regard\nto queueing delay\/loss they can be regarded as the distributed\nequivalent of a single conventional multiplexer, i.e., as a single\ndistributed switch. On the contrary, with regard to link errors a\nshared link corresponds to many point-to-point links due to the\nphysical separation of the sender-receiver pairs.\nOne way to expand the described vector representation so\nthat it can accommodate MAC controlled links is to slightly\nmodify (6), (8), and (9). For the MAC-shared link , (8) may\nbe rewritten as\n(10)\nwhile under realistically small loss rates\n(11)\nand the factors accounting for the successive traffic thinning on\nits path are written as shown in the equation at the bottom of the\npage. In other words, the link error probabilities at the shared\nlink are separated from the link congestion losses and are added\nat connection (i.e., path) level as separate terms. These adapta-\ntions are applicable when there is a single MAC-shared link on\nthe connections’ paths or, equivalently, when other MAC-shared\nlinks (e.g., Ethernet network at the TCP server\/client side) do\nnot introduce link errors.\n2) Application to Bottleneck BoD-Shared Satellite Net-\nworks: We consider now our problem as a special case of this\ngeneric formulation. We assume that the bottleneck link is the\nshared satellite link, neglecting the delays and losses incurred\nat the other links; the control signal for TCP in our context is\nthe delay experienced at the MAC level of the shared satellite\nlink. In comparison with the generic problem formulation\n(12)\n(13)\nwhere is the index of the shared satellite uplink and is the\nKronecker delta.\nReplacing index with sat, (7) yields\n(14)\ni.e., we derive an equation of the form for .\nThe missing component is the function that\nrelates the MAC access delay at the shared satellite link\nof bandwidth , to the offered load to the link . In this\ncontext, the most relevant analytical study we are aware of is\nthe analysis provided in [31] for a member of the combined\nfree\/demand assignment multiple access (CFDAMA) protocol\nfamily, the one with preassigned request slots. The system\nconsidered therein combines the two resource allocation mech-\nanisms that are considered subsequently in our simulations\n(Section IV), i.e., demand and free assignment. Nevertheless,\ncertain assumptions of the analysis question its applicability.\nif\nif\notherwise\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \nKARALIOPOULOS et al.: PROVIDING DIFFERENTIATED SERVICE TO TCP FLOWS OVER BoD GEOSTATIONARY SATELLITE NETWORKS 337\n0 0.2 0.4 0.6 0.8 10\n0.1\n0.2\n0.3\n0.4\n0.5\nNormalized throughput\nFr\nam\ne \nde\nla\ny \n(s)\n___  simulation\ntheory\nnT = 0.012\nnT = 0.025\nnT = 0.047\nnT = 0.095\n \n \nFig. 1. Comparison of the analytical approximation in [31] against simulation\nresults for the MAC frame delay under Poisson traffic and variable normalized\nterminal population.\nFirst of all, the analysis is provided for Poisson traffic. Second,\nthe request allocation period is higher than the one-hop delay\n(for the case of on-board BoD controller), setting a lower\nbound to the resource allocation period. Third, the analysis\nonly addresses the case of load equally distributed among the\nterminals sharing the link. Fourth, it is a no-loss model, i.e., the\nMAC buffering space is assumed infinite.\nWe first examine whether this CFDAMA analysis can be ap-\nplied to the system considered in the subsequent simulations\n(see Section IV). In other words, we apply Poisson traffic to our\nBoD system and compare the MAC delays with the ones pro-\nvided by the respective analysis. The number of terminals con-\nsidered is small enough, so that we can take advantage of the\ngeometrical approximation provided in [31] for small number\nof terminals. Fig. 1 depicts the mean frame delays predicted\nby the analysis and the ones obtained by simulation, when the\nsimulated BoD system is exposed to Poisson traffic. Results are\nshown for various values of the normalized terminal population\n[31]\n(15)\nwhere is the number of terminals sharing the link, is the\nslot size (duration), and RTD the round-trip delay related to\nthe BoD procedure (including propagation and processing de-\nlays). The agreement between the geometric approximation and\nthe simulation results is tighter at moderate and high loads, al-\nthough the former yields pessimistic predictions about the ex-\npected frame delay close to the saturation area.\nIn subsequent comparisons of simulation results against\nfixed-point based predictions in Section V-A, we will use the\ngeometric approximation as the basis for the BoD induced\ndelay. Given the aforementioned limitations of the method in\naddressing the service differentiation mechanisms targeted in\nthis work, we subsequently resort to simulation as the primary\nmeans for our study.\nIV. SIMULATION SETUP AND METHODOLOGY\nFor our simulations, we have chosen ns2 [33], a discrete event\nsimulator dedicated to the research of IP networks and proto-\ncols, widely used within the Internet community. We extended\nthe basic satellite code of ns2 with BoD features [34] whilst, at\nthe same time, we were able to take advantage of the built-in\npacket-level simulator functionality.\nA. Simulator Parameters and Assumptions\nThe BoD scheme under consideration within this paper draws\nheavily on the procedure described in [35] and some termi-\nnology is adopted from it. Periodically, and as long as new\npackets arrive at their queues, the BoD entities, physically lo-\ncated in satellite terminals and serving one or more data flows,\nsubmit requests to a BoD controller residing on-board the satel-\nlite. The controller takes requests into consideration, builds the\nburst time plan (BTP) and broadcasts it to the BoD entities. Both\nfunctions are repeated with a period equal to an integer number\nof time-division multiple-access (TDMA) frames (resource\nallocation period). Requests may be submitted in preassigned\nslots, piggybacked on data slots, or compete in random access\nmanner (i.e., slotted\/unslotted Aloha). Within the context of this\nstudy, we consider only the first option. The BTP corresponding\nto requests submitted within a certain allocation period is acti-\nvated by the entities after an integer number of resource allo-\ncation periods (system response time), allowing for the propaga-\ntion and processing delays at the terminals and the Controller.\nRequests that cannot be satisfied in the corresponding allocation\nperiod are stored and served with priority in the next resource\nallocation period. Spare capacity (free slots) is distributed prior-\nitizing entities that have not submitted a request in the respective\nresource allocation period on a round-robin basis.\nThe algorithms for estimating the requests are borrowed from\n[35]. If are the queued packets at the terminal queue at the\nbeginning of the th resource allocation period, then the request\nsubmitted to the BoD controller is for slots shown in (16),\nat the bottom of the page. In (16), denotes the smallest\npositive integer, including zero, that is greater than are\nthe number of slots per frame allocated to the BoD entity for the\nnext frames, and is the estimate of the owed slots by\nthe controller to the entity, because in one or more of the pre-\nvious resource allocation periods, the controller assigned fewer\nor even none of the slots requested. Apparently, . In\n(16)\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \n338 IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 22, NO. 2, FEBRUARY 2004\nFig. 2. Evolution of BoD procedure with time and example exchange of messages between BoD controller and BoD entity \u0000n = 4; L = 5.\neffect, the process resembles the VBDC allocation mode, as de-\nfined in [1].\nAn example of the BoD scheme operation is provided in\nFig. 2. The snapshot shows the estimated requests, the assign-\nments of the controller, and the queue size at the beginning\nof the resource allocation periods; denote the number of\nnew frames that arrive at the entity queue within the ( )th\nresource allocation period. In this example, the link is lightly\nloaded so that the BoD controller can satisfy the requests\nof the entity, namely , and there is spare\ncapacity that is assigned to the entity in FCA mode.\nIn our simulations, we mainly consider terminals with low\ntraffic aggregation. A variable number of TCP connections com-\npete for the link bandwidth. Connections are subject to BoD\nmechanisms in both the forward and reverse direction (ACK\npackets), i.e., we consider a mesh system architecture without\nnotion of forward and return link. In the majority of simulations,\nthere is one-to-one correspondence between TCP connections\nand BoD entities, namely each entity serves the TCP sender and\nTCP receiver parts of two unidirectional TCP connections. Fur-\nther simulation results with more connections per BoD entity are\nprovided in Section V-E. Simulations were run for satellite link\ncapacities of 512\/1024\/2048 kb\/s yielding 32\/64\/128 16 kb\/s\nslots per frame, respectively, for frame duration equal to 24 ms.\nThe resource allocation period was set to 96 ms (four frames).\nTCP segments are fragmented implicitly [36] at the link-layer\ninto 48-byte payload data frames. We select moderate values for\nthe maximum TCP window size and let the link buffer be large\nenough to handle the incoming TCP bursts, in effect avoiding\nlosses at the link buffers. In short, we are concerned with a loss-\nless system. In such a system, TCP adapts to the delays occur-\nring at the MAC queues within the satellite network.\nWe have chosen the TCP NewReno [5] variant for our simu-\nlation experiments. Since no losses occur, this choice does not\naffect obtained results; most of the available TCP implementa-\ntions (e.g., Reno, NewReno, SACK) differ in the way they treat\nlosses and suggest different action during the fast retransmit\/fast\nrecovery phase. The granularity of the TCP timer is 100 ms and\nthe timestamps option is activated for all simulations. The de-\nfault value for the maximum TCP send window (hereafter de-\nnoted as rwnd) is 8 kB. Further values, when used, are explic-\nitly stated. The satellite links are considered error-free. This as-\nsumption and the impact of link errors in general are discussed\nfurther in Section V-E.\nB. Approach-Performance Metrics\nAs a metric for end user satisfaction, we adopt the mean\nTCP connection throughput, in line with the metrics considered\nin [18] within the broader context of elastic traffic.2 Whereas\nreal-time services like packet voice, audio or video streams in-\ntroduce packet-level requirements, provision of better than best-\neffort service to TCP flows is mostly related to the provision of\nsome minimum rate to the flow. This is the case for the most\npopular applications running on top of TCP (Web browsing, the\nincreasingly popular peer-to-peer applications, FTP).\nConnections are initiated with a random phasing and are run\nfor time intervals of 60–100 s. The connection throughput is\nmeasured and averaged after the first quarter of the connec-\ntion time has elapsed. At the system level, we mainly plot the\nachieved utilization of the satellite link. Each point in the graphs\nis the same average of 10–20 simulation runs.\nV. RESULTS AND DISCUSSION\nA. Transport Layer Differentiation\nThe TCP includes a number of variables. By solely selecting\nappropriate values for these variables it is already possible to\nprovide advantage to some connections over others. Likewise,\ndifferentiated performance can be obtained if TCP options that\nenhance the protocol performance, such as those described in\n[6] and—in a more generic context—in [38], are selectively ac-\ntivated for a subset of competing connections.\n1) TCP Receive Window: An exhaustive enumeration of all\npossible variables and options that could provide transport layer\nservice differentiation is certainly not possible within the space\n2The focus of the study is subsequently on persistent connections. For non-\npersistent, short-lived TCP connections, the impact of the slow-start phase of\nthe TCP connection becomes important. We discuss some of the slow-start im-\nplications in [37].\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \nKARALIOPOULOS et al.: PROVIDING DIFFERENTIATED SERVICE TO TCP FLOWS OVER BoD GEOSTATIONARY SATELLITE NETWORKS 339\nlimitations of this paper. Instead, we focus our attention on one\nof the settings at TCP level that can have a significant impact\non the protocol performance, the receive window (rwnd). There\nare two good reasons for doing so.\nFirst, it is interesting to evaluate the performance gain\nachieved via increasing rwnd in BoD-shared satellite networks,\nsince it is widely suggested as one of the necessary protocol\nmodifications\/adaptations for enhancing TCP performance\nover satellite links. Second, its impact can be captured by\nthe available analytical TCP models [21]–[23] allowing us\nto test the predictions of the analytical method presented in\nSection III-A. On the contrary, these models cannot cater for\nthe microscopic details of the wide variety of options that have\nbeen proposed for TCP.\n2) Split-TCP Connections: The second transport-layer\nmechanism we investigate is the split-TCP mechanism. A\nproxy at the border between the terrestrial and the satellite net-\nwork intercepts the connection set-up (SYN) and termination\n(FIN) packets and initiates another TCP connection over the\nsatellite link, creating the respective state. When the other end\nof the satellite connection is another gateway, a third connection\nhas to be setup for the last portion of the connection, from the\nsecond gateway to the end user. The split-TCP mechanism\nis only one of the potential features of TCP performance en-\nhancing proxies (TCPPEPs). These solutions are viewed with\nskepticism within the IETF community, since their deployment\nwithin the Internet may contrast on a number of occasions\nwith the end-to-end design principle dominating the latter\n[39]. Concerns regarding reliability and security aspects of\nTCPPEPs [40] have not prevented the satellite operators from\ndeploying these mechanisms and explore countermeasures for\ntheir inefficiencies [41].\nThe advantages of split connections have been reported in\nnumerous studies: split-TCP yields a performance gain that in-\ncreases with errors over the satellite link and level of congestion\nat the terrestrial portion of the end-to-end connection, at the ex-\npense of increased buffering requirements at the gateway nodes,\nhosting the TCPPEP [42]. Nevertheless, the split-TCP mecha-\nnism has been mostly studied in the context of a single TCP\nconnection. Few are the studies that considered more than one\nconnection and even fewer those that evaluated the mechanism\nwithin a MAC-shared satellite environment.\n3) Simulation Results and Comparison With Analysis: To\nallow the fixed-point method to account for the split-TCP mech-\nanism, the elements of the new routing matrices ,\nand can be defined as\n(17)\nwhere is the index of the satellite link and the elements and\nare replaced by the respective values in the satellite por-\ntion of the connection. The assumption behind this modification\nis that the satellite component of the connection determines the\nactual connection throughput. In general, its validity is depen-\ndent on the relative values of the actual throughputs achieved\nby the individual connection components—hence, on all those\nfactors affecting the throughput (RTT, delay\/losses, enabled op-\ntions in each of the connection components). It holds as far as\n0 10 20 30 4020\n40\n60\n80\n100\n120\nend-to-end TCP connections\nTh\nro\nug\nhp\nut\n (k\nb\/s\n)\n ___  simulation\n theory\n   \n512kb\/s link\n1024kb\/s link\n 8kB\n16kB\n32kB\n64kB\nFig. 3. Throughputs achieved by end-to-end connections for different rwnd\nvalues and comparison with the predictions of the fixed-point method.\n0 10 20 30 4020\n40\n60\n80\n100\n120\nsplit TCP connections\nTh\nro\nug\nhp\nut\n (k\nb\/s\n)\n512kb\/s link\n1024kb\/s link\n 8kB\n16kB\n32kB\n64kB\n ___  simulation\n theory\nFig. 4. Throughputs achieved by split TCP connections for different rwnd\nvalues of the satellite component of the connection and comparison with the\npredictions of the fixed-point method.\nthe throughput of the terrestrial component of the split connec-\ntion is at least such that it does not let the satellite component\nstarve [42].\nThe throughputs achieved by variable numbers of end-to-end\nand split connections are shown in Figs. 3 and 4, respectively.\nSplit connections are more aggressive for the same rwnd values\nand saturate the link more quickly. Given our assumption for\nan error-free satellite link and the fact that the RTTs of the ter-\nrestrial portions of the connections are assumed to be small for\nthese runs ( ms), the performance enhancement should be\nregarded as a lower bound on the gain that can be achieved over\nend-to-end connections. However, the impact of rwnd is similar\nin both cases: as rwnd increases the link utilization reaches its\nupper limit (saturation area) in the presence of fewer connec-\ntions (Figs. 5 and 6) and then the throughput obtained by them\nis the same, irrespective of the rwnd value. In general, perfor-\nmance enhancement may be achieved as far as there is some\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \n340 IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 22, NO. 2, FEBRUARY 2004\n5 10 15 20 25 30 35 40\n0.6\n0.65\n0.7\n0.75\n0.8\n0.85\n0.9\n0.95\n1\n1.05\nend-to-end TCP connections\nLi\nnk\n u\ntil\nis\nat\nio\nn\n8kB\n16kB\n32kB\n64kB\n ___  simulation\n theory\nFig. 5. Link utilization for different rwnd values of the end-to-end TCP\nconnections and comparison with the fixed-point method predictions.\n5 10 15 20 25 30 35 400.65\n0.7\n0.75\n0.8\n0.85\n0.9\n0.95\n1\n1.05\nsplit TCP connections\nLi\nnk\n u\ntil\nis\nat\nio\nn\n 8kB\n16kB\n32kB\n64kB\n ___  simulation\n theory\nFig. 6. Link utilization for different rwnd values of the satellite components\nof the split TCP the connections and comparison with the fixed-point method\npredictions.\nspare capacity, not utilized by the connections because they are\nrwnd-limited. One may introduce the notion of the path effective\nbandwidth product, as the product of the path round-trip delay\ntimes the bandwidth available to a single connection given the\npresence of other connections sharing the link. As long as this\nis higher than the individual connection rwnd, performance im-\nprovement is possible via rwnd increase. Otherwise, the connec-\ntions are capacity-limited; when this is the case, increase of the\nrwnd value only leads to accumulation of TCP segments into the\nlink buffers of the satellite gateway, i.e., buffering is transferred\nfrom end hosts to the network.\nEven worse, increase of the rwnd value does not determin-\nistically increase the mean connection throughput, even when\nthere is spare capacity to take advantage of. For higher values\nof rwnd, connections may experience timeouts with a severe im-\npact on the individual connection throughput and the utilization\n(e.g., for rwnd equal to 32\/64 kB in Figs. 3–6).\n0 5 10 15 202\n3\n4\n5\n6\n7\n8\n9\n10\n11\nend-to-end TCP connections per transport layer class\nTh\nro\nug\nhp\nut\n (%\n of\n lin\nk c\nap\nac\nity\n)\n rwnd 32kB\nrwnd 16kB\nrwnd 8kB  \nFig. 7. Throughput of two classes of end-to-end TCP connections—\ndifferentiation option: rwnd, equal number of connections per class.\nFigs. 3–6 also compare the predictions made by the fixed-\npoint method against simulation results. The analysis clearly\noverestimates the achieved throughput and the subsequently\nachieved link utilization for low number of connections. In\nhigher load values, the agreement is closer. The noticed deviation\nis mainly due to the burstiness of the TCP traffic. The delay\nvalues dictated by the solution of the fixed-point equations cor-\nrespond to higher values of utilization under the more uniform\nPoisson traffic, for which the MAC resource model is derived.\nOn the contrary, TCP segments arrive in bursts; the link remains\nunderutilized over some intervals, while it is saturated over\nothers, resulting in increase of the average access delay.\n4) Competing End-to-End and Split Connections: In exper-\nimenting with the rwnd parameter, we separated the connections\nsharing the link into two transport-layer classes with regard to\nthe rwnd setting. The rwnd value for the one class was set to\n8 kB, whereas the rwnd for the second was set to 16 kB and\n32 kB in two different experiment sets. Fig. 7 suggests that the\nhigher rwnd provides a relative advantage that becomes max-\nimum at medium-to-high loads, where the available resource is\nless than what the connections can attain within the limitations\nof their rwnd, but decreases rapidly when the link becomes satu-\nrated. Moreover, at these load levels doubling the rwnd from 16\nto 32 kB does not benefit the split connections, since the addi-\ntional in-flight data are accumulated at the MAC buffers. Note\nthat increase of rwnd for end-to-end connections also implies\nhigher congestion risk at the terrestrial links traversed by the\nconnections.\nWith the split-TCP mechanism we followed a different ap-\nproach. We considered two cases, each one featuring a fixed\nnumber of competing connections corresponding to different\nlevels of system load: in the first, a 1.024 Mb\/s link BoD-shared\nlink is subject to the load generated by 16 connections, whereas\nin the second, the link was driven to saturation by a mix of 32\nconnections. Within each one of the two mixes we varied the\nproportion of each type of connections (end-to-end versus split)\nfor different rwnd settings for the satellite component of the\nconnection.\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \nKARALIOPOULOS et al.: PROVIDING DIFFERENTIATED SERVICE TO TCP FLOWS OVER BoD GEOSTATIONARY SATELLITE NETWORKS 341\n0 5 10 15 20 25 302\n3\n4\n5\n6\n7\n8\n9\n10\n11\nend-to-end TCP connections\nTh\nro\nug\nhp\nut\n (%\n of\n lin\nk c\nap\nac\nity\n)   \n___  rwnd  8kB\nrwnd 32kB\n16 conns\/split\n28 conns\/split\n28 conns\/end–to–end\n16 conns\/end–to–end\nFig. 8. Throughput of end-to-end and split connections versus number of\nend-to-end connections in the mix—the rwnd refers to the satellite component\nof the split connections.\nIn both cases, split connections achieve better performance\nand in both cases the throughput achieved—in absolute num-\nbers—from all connections increases with decrease of the por-\ntion of split connections in the mix (Fig. 8). The lag in perfor-\nmance for end-to-end connections is larger at low load, since\nsplit connections make better use of free capacity as well, and\nincreases with higher rwnd values of the satellite component of\nthe connection. For higher load, when spare capacity is almost\nextinct and the connections rely only on their requests to obtain\ncapacity, the performance lag is less but clear. In this case, the\nperformance gain is only due to the inherent dynamics of split\nconnections (smaller loop). Again, these results can be regarded\nas a lower bound on the achievable performance enhancement.\nThe gain of the split approach is higher if link errors are met or\nthe terrestrial portions of connections become longer.\nB. MAC-Layer Differentiation\n1) Priority Scheduling: Prioritization of traffic may also\ntake place at the MAC\/BoD level. The satellite link differs\nfrom a conventional time-multiplexing link in that packets are\ndistributed over the terminal queues rather than being buffered\nat a single point. Multiplexing still takes place–over the air this\ntime–and access to the medium is arbitrated by the scheduler\n(BoD controller), whose function resembles that of schedulers\nused in wired networks.\nIn our paper, we experimented with two types of schedulers:\na first-come first-served (FCFS) scheduler, which treats all re-\nquests in the same, best effort (BE) manner and a priority-aware\nscheduler. The latter discriminates between two MAC classes\nand serves requests of the nonpriority class only when and if all\nrequests of the priority class have been satisfied. Among con-\nnections of the same class, slots are distributed on a round-robin\nbasis.\n2) FCA Policy: A second way to allow for different treat-\nment of connections at the access level is related to the policy\nimposed on the distribution of the spare capacity. An example\n0 5 10 15 20\n1\n2\n3\n4\n5\n6\n7\n8\nend-to-end TCP connections per MAC class\nTh\nro\nug\nhp\nut\n (%\n of\n lin\nk c\nap\nac\nity\n)\nx   no FCA for BE\no   FCA for BE\npriority\nbest effort\nFig. 9. Mean throughputs of MAC priority and MAC best effort connections\nunder the two policies regarding the free capacity distribution—equal number\nof connections per MAC class.\nof such a policy, which is investigated further in our study, is to\nmake spare capacity available only to the MAC priority class.\nFig. 9 plots the average connection throughput when the link\nis shared among equal numbers of end-to-end BE and priority\n(prio) connections in two scenarios: in the first one, free capacity\nis made available to both BE and priority connections, whereas\nin the second only to the latter. It is illustrative regarding the dif-\nferentiation space of the two MAC-level mechanisms, i.e., the\npriority scheduling and the FCA policy. The FCA policy dom-\ninates at low loads: when BE connections have access to spare\ncapacity, the priorities of the scheduler actually have no effect\nand the two classes of connections obtain the same performance.\nOn the contrary, restriction of spare capacity to priority flows\nonly, has a dramatic effect. BE flows are hard-limited to the ca-\npacity corresponding to their actual requests, whereas priority\nconnections, having the exclusive privilege to spare capacity,\nincrease their advantage over the former. At higher loads, we\nface the opposite situation. It is the scheduling mechanism that\nprovides service differentiation to the flows, whereas the impact\nof FCA policy fades out together with spare capacity as such.\nThe nonavailability of free capacity to BE flows penalizes the\nsystem utilization at low loads. On the contrary, the impact be-\ncomes negligible for higher loads, where the amount of spare\ncapacity is reduced and the capacity allocation is performed al-\nmost exclusively on the basis of capacity requests.\n3) The Impact of Movable Boundary: The introduction of\na boundary can function as an additional regulator on the ser-\nvice differentiation offered to different traffic classes. The (mov-\nable) boundary concept was introduced in the context of the hy-\nbrid multiplexers [43], multiplexing circuit-switched voice with\npacket-switched data. It has been adopted in MAC protocols\n(see for example [10]) for integrated voice\/data services with\nsimilar benefits: It leads to better service for data and higher re-\nsource utilization without affecting the service offered to voice.\nIntroducing a movable boundary for hard-limiting the ca-\npacity that is made available to the MAC-priority connections,\none may leverage the performance gap between the two MAC\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \n342 IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 22, NO. 2, FEBRUARY 2004\n60 70 80 90 1001.5\n2\n2.5\n3\n3.5\n4\nPercentage (%) of frame capacity available to MAC priority class\nTh\nro\nug\nhp\nut\n (%\n of\n lin\nk c\nap\nac\nity\n)\n       no FCA for BE\n___  FCA for BE\no     16 \/ 16 mix\nx      24 \/ 8 mix\n \n  \npriority\nbest-effort\nFig. 10. Mean throughputs of MAC priority and MAC best effort connections\nversus the movable boundary position—32 TCP connections, two different\nmixes of connections per MAC class (16 and 24 split, respectively).\nclasses. Fig. 10 shows the impact of boundary under two\ndifferent connection mixes that drive the link in saturation. This\nimpact is much more dramatic for the 24\/8 mix (24 priority\nversus 8 best effort connections) rather than the uniform 16\/16\nmix. In the first case, it is even possible to cancel the advantage\nof priority connections due to their privileged treatment by\nthe BoD scheduler, if a low enough value is chosen for the\nboundary. In general, the impact of the boundary is not only a\nfunction of the number of TCP connections sharing the link but\nalso of the proportion of each MAC class in the connection mix.\nC. Combined Transport-MAC Layer Differentiation\nIt should be now clear that both the transport and MAC layers\ninclude knobs that can be tuned in order to favor some connec-\ntions over others, in essence providing qualitatively better ser-\nvice to the former. Even more significantly, the available op-\ntions provide enough flexibility, in that differentiation can be\nprovided over the full range of system load, using different ca-\npabilities each time.\nThe satellite network can build a variety of radio bearers\n(transfer capabilities), equal in size to the Cartesian product\nof the available tuning knobs at the two layers. Coordination\nbetween the layers is dependent on the available interlayer\nprocedures of the radio interface. There are “heavier” radio inter-\nfaces, like the standardized third-generation systems, featuring\nwell-defined primitives between the radio resource allocation\nlayer and the layers\/sublayers of the radio interface [44]. In\n“lighter,” less connection-oriented interfaces, the necessary\ninformation may be carried on the packet headers in line with\nthe proposed IP QoS frameworks. In both cases, appropriate\nmapping rules are required at the data and control plane.\nFigs. 11 and 12 demonstrate possible bearers that may be\ngenerated on the basis of the available options at the MAC and\nthe transport layer. In Fig. 11, we plot the throughputs obtained\nwhen split connections are mapped to the MAC priority class\n(split-prio) and end-to-end connections are mapped to the MAC\nbest effort class (e2e-BE). The connections of the first MAC\n0 5 10 15 20\n0\n2\n4\n6\n8\n10\n12\nTCP connections per class\nTh\nro\nug\nhp\nut\n (%\n of\n lin\nk c\nap\nac\nity\n)\no  FCA for BE\nx  no FCA for BE\nsplit–priority\ne2e best–effort\nFig. 11. Average throughput of two connection classes under the two policies\nregarding free capacity distribution—split (end-to-end) connections mapped to\nMAC priority (best effort) class.\n0 5 10 15 200\n2\n4\n6\n8\n10\n12\nTCP connections per class\nTh\nro\nug\nhp\nut\n (%\n of\n lin\nk c\nap\nac\nity\n)\no   FCA for BE\nx   no FCA for BE\ne2e priority\nsplit best–effort\nFig. 12. Average throughput of two connection classes under the two policies\nregarding free capacity distribution—split (end-to-end) connections mapped to\nMAC best effort (priority) class.\nclass achieve consistently better performance thanks to the split\nmechanism at low loads and the MAC prioritization at higher\nloads. The performance gap increases when the MAC priority\nclass monopolizes the spare capacity but only over the range of\nload where the latter is available.\nIn Fig. 12, the mapping of transport-upon MAC-classes is\nreversed, i.e., split connections are mapped to the MAC BE\nclass (split-BE), whereas end-to-end connections are treated\nwith priority from the BoD scheduler (e2e-prio). This scenario\nmay be seen as a demonstration of what could be the relative\nperformance achieved by the connections if the MAC layer\nadheres strictly to the layering principle and does not take\ninto account the decisions at the transport layer. The curves\ndemonstrate once again the load areas dominated by each\ndifferentiation mechanism. The split connections enjoy better\nperformance at low loads, as far as spare capacity is available\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \nKARALIOPOULOS et al.: PROVIDING DIFFERENTIATED SERVICE TO TCP FLOWS OVER BoD GEOSTATIONARY SATELLITE NETWORKS 343\n60 70 80 90 100\n1.5\n2\n2.5\n3\n3.5\n4\nPercentage (%) of frame available to MAC priority connections\nTh\nro\nug\nhp\nut\n (%\n of\n lin\nk c\nap\nac\nity\n)\n___  FCA for BE\n        no FCA for BE\n  \nsplit–prio\ne2e–prio\nsplit–BE\ne2e–BE\nFig. 13. Variation of the average throughput of the four combined transport\/\nMAC-layer connection classes with the boundary position under the two\npolicies regarding free capacity distribution—saturated link, no spare capacity.\nto them. The combination of the split mechanism with spare\ncapacity availability effectively cancels the prioritization\ndecisions at the MAC layer. Only for higher load, where\nthe scheduling discipline impact becomes important, can the\ne2e-prio connections achieve higher throughput. When free\ncapacity is not available to split-BE, e2e-prio connections\nprevail over the former throughout the load range (number\nof connections). In this case, the throughput of the split-BE\nconnections is upper-limited by the capacity made available to\nthem via requests. The trend in their performance is similar to\nthe one of e2e-BE connections in Fig. 11; however, the absolute\nthroughput values are slightly higher.\nThe potential of these combinations to lead to separate,\ndistinguishable service levels is investigated in Figs. 13 and\n14. TCP connections that share the link are equally distributed\namong the four classes, each one corresponding to a certain\ntransport\/MAC class combination (i.e., split-prio, split-BE,\ne2e-prio and e2e-BE). Two scenarios are investigated: in the\nfirst scenario, the link is saturated (no spare capacity), whereas\nin the second scenario, the link is lightly loaded. Different\nvalues of the boundary and the two possible policies regarding\nthe distribution of spare capacity are considered.\nIn the first case, the TCP connections—predictably—obtain\nthe best performance when they are split and, on top of this, are\nprioritized by the BoD scheduler. There is a performance im-\nprovement that reaches 10%, while the available frame capacity,\ncontrolled by the boundary varies from 60% to 100% (Fig. 13).\nEnd-to-end priority connections follow, confirming that at high\nload the scheduling discipline is the decisive factor in service\ndifferentiation. On the other hand, both types of BE connections\nare restricted to lower portions of the capacity, their percentage\nbeing reduced while priority connections are allowed to access a\nbigger portion of the total MAC frame. Nevertheless, split con-\nnections maintain their advantage over end-to-end connections,\nallowing four distinct service levels to be provided.\nIn the second case, split-prio connections still achieve the best\nperformance but now the relative weights of the FCA policy and\n60 70 80 90 100\n3\n3.5\n4\n4.5\n5\n5.5\n6\n6.5\nPercentage (%) of frame available to MAC priority connections\nTh\nro\nug\nhp\nut\n (%\n of\n lin\nk c\nap\nac\nity\n)\nsplit–prio, no FCA for BE\nsplit–prio, FCA for BE\nsplit–BE, FCA for BE\ne2e–prio, no FCA for BE\ne2e–prio, FCA for BE\ne2e–BE, FCA for BE\nsplit–BE, no FCA for BE\ne2e–BE, no FCA for BE\nFig. 14. Variation of the average throughput of the four combined transport\/\nMAC connection classes with the boundary position under the two policies\nregarding free capacity distribution—lightly loaded link.\nTABLE I\nFACTORS AND LEVELS FOR THE STUDY OF SERVICE DIFFERENTIATION\nMECHANISMS AS A 2 TEN FACTORIAL DESIGN\nthe split transport mechanism are different (Fig. 14). Split-BE\nconnections outperform e2e-prio connections, as long as spare\ncapacity is available to them; the latter exhibit no advantage over\ne2e-BE connections under the same condition (i.e., availability\nof spare capacity to BE connections). The four distinct service\nlevels when MAC BE connections are restricted from spare ca-\npacity are reduced to two when this restriction is removed (split\nversus BE). The boundary impact is negligible since both the\nlink load and the proportion of priority connections in the con-\nnection mix (50%) are low enough.\nD. Allocation of Variation Analysis\nThe allocation of variation technique [45] provides an alter-\nnative, more formal demonstration of the weight of each mecha-\nnism on the TCP performance. In this context, we may consider\nan experimental design investigating the impact of three cate-\ngorical variables or factors on the performance of the to-be-pri-\noritized flows: the transport-level mechanism, the MAC sched-\nuling discipline, and the policy regarding the spare capacity.\nThere are two alternatives (levels) for each one of the three\nfactors (Table I). Assuming an additive model for the experi-\nment analysis and the measured TCP throughput as the response\nvariable of the experiment, the observed responses\n, corresponding to experiments with all eight possible\ncombinations of factor levels, can be expressed as\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \n344 IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 22, NO. 2, FEBRUARY 2004\nTABLE II\nEFFECTS AND VARIATION EXPLAINED IN THE STUDY OF SERVICE\nDIFFERENTIATION MECHANISMS (SATURATED 512 kb\/s LINK)\nFactor Effect Percentage \nof variation \nConfidence \ninterval \nA -125.86 1.55 (-133.1, -118.61) \nB -1000.02 97.99 (-1007.27, -992.78) \nC -8.24 0.006 (-15.48, -0.99) \nAB 49.46 0.239 (42.21, 56.69) \nAC -0.17 0.000 (-7.42, 7.06) \nBC 0.88 0.000 (-6.37, 8.12) \nABC -3.22 0.001 (-10.47, 4.02) \nwhere is the grand mean of all observed responses and\n, are the effects of the three prioritization mechanisms\n(A, B, C—Table I) under one of the two alternatives available\nfor each. The term accounts for the first-order interac-\ntion between factors and at levels and , respectively,\nis the effect of the second-order interaction between\nfactors , and Z at levels , and , respectively, and\nis the error term computed for a single experiment on the basis\nof the experiment replications (i.e., simulation runs) performed\nfor it. For each graph point (given number of TCP connections\nloading the link), we come up with a three-factor full-factorial\nanalysis experiment with ten replications.\nTable II lists the estimated percentage of variation explained\nby each considered experiment factor under link saturation con-\nditions (high load), as well as the variation explained by their in-\nteractions. It also provides the confidence intervals for these ef-\nfects. The weight of the MAC prioritization mechanism at these\nloads is evident by simple inspection of columns 2 and 3: it is re-\nsponsible for 98% of the variation with regard to the grand mean\n[measured in this context in kilobytes per second (kB\/s)], with\na narrow enough confidence interval. The split mechanism has a\nclear but much less significant impact, whereas the FCA policy\ndoes not have any. Both its percentage of variation score and the\nzero-inclusive confidence intervals of the first-order interaction\neffects confirm its minimum impact at high loads (as\nexpected and discussed already in Section V-B).\nE. Additional Considerations\n1) Aggregation: Higher levels of TCP connection multi-\nplexing at the BoD entities let the same number of connections\nobtain higher throughput (Fig. 15) and utilize the link more\nefficiently (Fig. 16). From the system point of view, the link\nis saturated with fewer connections under higher aggregation\nlevels. The free capacity of the system is now shared among\nfewer terminals (more accurately: BoD entities) and that\nreduces the probability that spare capacity is assigned to a\nterminal that might not need it. The relative benefit from the\nconnection multiplexing at the BoD entity level decreases as\nthe link approaches the saturation area: there the capability of\nthe entities to grab and use the spare capacity does not matter\nany more, since there is no spare capacity left.\n2) Link Errors: All the results shown so far have been de-\nrived under the assumption of error-free links. In general, the\nvalidity of this assumption is strongly related to the satellite\nenvironment under consideration and the respective physical\nlayer design. Regarding the latter, the trend has always been\n0 5 10 15 20 25\n1.5\n2\n2.5\n3\nTCP connections per BoD entity\nTh\nro\nug\nhp\nut\n (%\n of\n lin\nk c\nap\nac\nity\n)\n32 conns\n40 conns\n48 conns\n60 conns\nFig. 15. Average connection throughput variation versus number of TCP\nconnections per BoD entity for fixed total connection number.\n0 5 10 15 20 25\n0.8\n0.85\n0.9\n0.95\n1\n1.05\nTCP connections per BoD entity\nLi\nnk\n u\ntil\nis\nat\nio\nn\n32 conns\n40 conns\n48 conns\n60 conns\nFig. 16. Link utilization variation versus number of TCP connections per BoD\nentity for fixed total connection number.\nto “overdimension” the link, i.e., to add all the required redun-\ndancy so that an error-free link is emulated. Physical layer im-\nplementations providing bit-error rates (BERs) as low as 10\nafter decoding are available for fixed broadband satellite net-\nworks. Such error rates do not have an impact on individual\nTCP connections, even when files of several megabyte (MB)\nare transferred.\nLink errors could well cancel the aforementioned differenti-\nation mechanisms. In the ideal—but also strictly theoretical—\ncase of uniform link losses, differentiation is still feasible; split\nconnections increase their relative advantage over end-to-end\nconnections, at least at moderate error rates [42]. This is not\nthe case though in the more realistic case of uncorrelated er-\nrors at the different transmitter-receiver paths over the satel-\nlite link, where connections might achieve performance that\nhas little to do with the desired one, as reflected in its map-\nping and treatment at transport and\/or MAC layer. Error con-\ntrol techniques become mandatory if the service differentiation\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \nKARALIOPOULOS et al.: PROVIDING DIFFERENTIATED SERVICE TO TCP FLOWS OVER BoD GEOSTATIONARY SATELLITE NETWORKS 345\n4 6 8 10 12 14 16\n0\n5\n10\n15\n20\nend-to-end TCP connections\n– – – prio, 200ms \n–––\n BE, 10ms RTT o  FCA for BE x no FCA for BE    \n4 6 8 10 12 14 16\n0\n10\n20\n30\nend–to–end TCP connections\nTh\nro\nug\nhp\nut\n (%\n of\n lin\nk c\nap\nac\nity\n)\nFig. 17. Mean connection throughput for the two MAC-layer classes under\nnonuniform RTTs—the TCP bias against longer RTTs cancels the impact of\nthe MAC scheduling mechanism (top); split connections preserve the intended\ndifferentiation (below).\nis to be preserved. Adaptive FEC [46] or\/and ARQ [36], may\npreserve the existing or introduce a further level of differenti-\nation in the connection treatment, at the expense of additional\ndata redundancy and signaling overheads. Combination of con-\nnectionless link-layer protocols and the split-connection mech-\nanism into the same bearer can provide performance enhance-\nment even over highly loaded BoD satellite links [42].\nIf the problem were approached only from the system point\nof view, then some form of pure channel-dependent scheduling\nwould maximize the link utilization. Any attempt to respect the\nclass hierarchy over the satellite link requires more complex\nscheduling algorithms than the simpler “give slots according to\nthe channel quality” approach and introduces a tradeoff with re-\nspect to the resource utilization and the network capability to\npreserve the qualitative differentiation among service classes.\n3) Different Propagation Delays in the Terrestrial Net-\nwork: The inherent bias of TCP against connections with\nlonger RTTs is another factor that may cancel the service dif-\nferentiation mechanisms of the network. In Fig. 17, end-to-end\nconnections that are treated as best effort at the MAC-level\noutperform at low load those treated with priority but exhibiting\n200 ms higher RTTs over the terrestrial network, as long as\nthey are allowed access to spare capacity. In [47], alternative\nwindow increase mechanisms that can alleviate this inherent\nbias are discussed; appropriate scheduling algorithms may also\nserve the same purpose. In the satellite network, the splitting\nmechanism can constitute yet another way to address this bias.\nBy splitting the to-be-prioritized connections, the advantage of\nthe best effort connections with regard to their small RTT is\ncancelled. The former obtain performance at least as good as\nthe latter at low loads, whereas they clearly outperform them\nat higher loads. In fact, the split connections can decouple the\noverall TCP performance from the TCP parameters (e.g., rwnd)\nof the terrestrial portion of the connection as well as its RTT\nand the congestion level met at the rest of the network.\nHowever, the differentiation objective can be served better at\nlow loads by the FCA policy. If the shorter-RTT flows do not\nhave access to spare link capacity, the desired differentiation can\nbe preserved under light load, irrespective of the treatment of the\nconnections at the transport layer.\nVI. SUMMARY AND CONCLUSION\nIn the last decade, the study of IP networks has attracted\ntremendous interest and several new approaches, considering\nthe flow control problem from zero basis, have been presented.\nThe investigation of the flow control problem within an opti-\nmization framework has led to various proposals about the “op-\ntimal” way to perform flow control, often with reference to po-\ntential charging schemes (see, for example, [48], [49], and ref-\nerences therein).\nDespite the impact of these studies and considering the\ncurrent popularity of TCP, it should be taken for granted that\nTCP will remain the main flow control protocol within Internet,\nat least in the short-term future. From an IP point of view,\nbroadband satellite networks will be yet another heterogeneous\ndomain over which TCP\/IP has to be efficiently supported, in\nagreement with the adopted IP QoS framework, however hard\nor soft this is.\nThe first contribution of this paper is the demonstration in a\nsimulated BoD environment of possible mechanisms available\nat transport and MAC layers to provide differentiated service to\nTCP flows. The BoD scheduling algorithm and the policy re-\ngarding spare capacity distribution are two MAC-layer mech-\nanisms that dominate at different traffic load areas: the former\nis effective at high levels of traffic load whereas the latter has\nan impact at low traffic load. Their combination with trans-\nport-level mechanisms and options provide the satellite operator\nwith adequate flexibility in designing radio bearer services over\nthe satellite network.\nA second contribution of this paper is the evaluation of the\nactual gain achieved with proposed TCP options and modifica-\ntions in a MAC-shared satellite environment. This gain is always\nsignificantly less than the one estimated in studies addressing a\nsingle TCP connection or multiple TCP connections, when the\nimpact of the MAC layer is not considered. Additional measures\nfor maintaining the service differentiation in the case of link er-\nrors were discussed and the potential of the split-TCP mech-\nanism to alleviate the bias against TCP connections with long\nRTTs was outlined.\nThe problem was also addressed within a fixed-point frame-\nwork. We have generalized formulation available in literature\nto cater for asymmetry and MAC-shared links, two common\nfeatures of satellite networks. In the case of the infinite MAC\nbuffer system, it was possible to derive a fixed-point solution\nfor the delay experienced at MAC level. The applicability of the\nmethod to our study of differentiation mechanisms is mainly\nlimited by the lack of analytical models that account for the\nMAC prioritization mechanisms and the nonuniform distribu-\ntion of traffic load among satellite terminals.\nIn this paper, we have shown how the level of differentiated\nservice depends on the system load and where the available\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \n346 IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 22, NO. 2, FEBRUARY 2004\nmechanisms succeed or fail in fulfilling this objective. How-\never, the provision of absolute, quantitative QoS guarantees is\nultimately dependent on whether the number of connections\nsharing the link can be controlled, implying some form of access\ncontrol in the network. The ideas proposed in [50]–[52] might\nbe the starting point for the introduction of additional functions\ninto the entry points of the satellite network, if such QoS guar-\nantees are to be provided to TCP connections.\nACKNOWLEDGMENT\nThe authors would like to thank the anonymous reviewers for\ntheir helpful comments and suggestions. They are also grateful\nto L. Wood and K. Narenthiran for their comments on earlier\nversions of this work.\nREFERENCES\n[1] Digital Video Broadcasting (DVB), Nov. 2002. Interaction channel for\nsatellite distribution systems.\n[2] H. Skinnemoen and H. Tork, “Standardization activities within broad-\nband satellite multimedia,” in Proc. IEEE ICC 2002, vol. 5, New York,\nNY, 2002, pp. 3010–3014.\n[3] W. R. Stevens, TCP\/IP Illustrated, Volume 1: The Protocols. Reading,\nMA: Addison-Wesley, 1994, ch. 21.\n[4] S. Floyd, M. Mathis, J. Mahdavi, and R. Povolsky, An extension to the\nselective acknowledgment (SACK) option for TCP, IETF, RFC 2883\n(Proposed Standard), July 2000.\n[5] S. Floyd and T. Henderson, The NewReno modification to TCP’s fast\nrecovery mechanism, IETF, RFC 2582 (Experimental), Apr. 1999.\n[6] M. Allman et al., Ongoing TCP research related to satellites, IETF, RFC\n2760 (Informational), Feb. 2000.\n[7] L. G. Roberts, “Dynamic allocation of satellite capacity through packet\nreservation,” in Proc. AFIPS Conf., National Computer Conf., 1973, pp.\n711–716.\n[8] L. Kleinrock and S. Lam, “Packet switching in a slotted satellite\nchannel,” in Proc. AFIPS Conf., National Computer Conf., 1973, pp.\n703–710.\n[9] W. Crowther et al., “A system for broadcast communication: Reserva-\ntion aloha,” in Proc. Int. Sys. Sci. Conf., Jan. 1973, pp. 371–374.\n[10] J. E. Wieselthier and A. Ephremides, “Fixed- and movable-boundary\nchannel-access schemes for integrated voice\/data in wireless networks,”\nIEEE Trans. Commun., vol. 43, pp. 64–74, Jan. 1995.\n[11] A. Hung, M. J. Montpetit, and G. Kesidis, “A framework for ATM\nover satellite,” presented at the IEEE GLOBECOM’96, London, U.K.,\n1996.\n[12] C. Rosenberg, “Broadband satellite systems: A network perspective,”\npresented at the IEEE GLOBECOM 2000, San Francisco, CA, Nov.\n2000. Tutorial.\n[13] H. Peyravi, “Medium access control performance in satellite communi-\ncations,” IEEE Commun. Mag., pp. 62–71, 1999.\n[14] J. Neale and A. Mohsen, “Impact of CF-DAMA on TCP via satellite per-\nformance,” in Proc. IEEE GLOBECOM 2001, San Antonio, TX, Nov.\n2001, pp. 2687–2691.\n[15] M. Sooriyabandara and G. Fairhurst, “Dynamics of TCP over BoD satel-\nlite networks,” Int. J. Satell. Commun. Networking, vol. 21, pp. 427–449,\nJuly 2003.\n[16] D. Connors, “Response initiated multiple access protocol,” in Proc.\nIEEE GLOBECOM 2000, San Francisco, CA, 2000, pp. 1124–1129.\n[17] D. P. Heyman, T. V. Lakshman, and A. L. Neidhardt, “A new method\nfor analyzing feedback-based protocols with applications to engineering\nweb traffic over the Internet,” ACM Sigmetrics Performance Evaluation\nRev., vol. 25, no. 1, pp. 24–38, 1997.\n[18] A. Berger and Y. Kogan, “Dimensioning bandwidth for elastic traffic in\nhigh-speed data networks,” IEEE\/ACM Trans. Networking, vol. 8, pp.\n643–654, Oct. 2000.\n[19] K. Lindberger, “Balancing quality of service, pricing and utilization in\nmultiservice networks with stream and elastic traffic,” presented at the\n16th Int. Teletraffic Congress, Edinburgh, U.K., 1999.\n[20] A. Feldmann. (1998, Dec.) Characteristics of TCP Connection Arrivals.\n[Online]. Available: http:\/\/www.research.att.com\/~anja\/feldmann\/\npapers.html\n[21] J. Padhye, V. Firoiu, D. Towsley, and J. Kurose, “Modeling TCP\nthroughput: A simple model and its empirical validation,” presented at\nthe ACM SIGCOMM 1998, Vancouver, BC, Canada, 1998.\n[22] M. Mathis, J. Semke, J. Mahdavi, and T. Ott, “The macroscopic behavior\nof the TCP congestion avoidance algorithm,” Comput. Commun. Rev.,\nvol. 27, no. 3, pp. 67–82, July 1997.\n[23] N. Cardwell, S. Savage, and T. Anderson, “Modeling TCP latency,” in\nProc. IEEE INFOCOM, Seattle, WA, Mar. 2000, pp. 1742–1751.\n[24] M. Roughan, A. Erramilli, and D. Veitch, “Network performance for\nTCP networks. Part I: Persistent sources,” presented at the 17th Int. Tele-\ntraffic Congress, Salvador, Brazil, 2001.\n[25] C. Casetti and M. Meo, “An analytical framework for the performance\nevaluation of TCP Reno connections,” Comput. Networks, vol. 37, pp.\n669–682, 2001.\n[26] R. J. Gibbens et al., “Fixed-point models for the end-to-end performance\nanalysis of IP networks,” presented at the 13th ITC Specialist Seminar:\nIP Traffic Measurement, Modeling, and Management, Monterey, CA,\n2000.\n[27] M. May, J. C. Bolot, A. Jean-Marie, and C. Diot, “Simple performance\nmodels of differentiated services schemes for the Internet,” in Proc.\nIEEE INFOCOM 1999, New York, NY, Mar. 1999, pp. 1385–1394.\n[28] A. Misra, T. Ott, and J. Baras, “Predicting bottleneck bandwidth sharing\nby generalized TCP flows,” Comput. Networks, vol. 40, pp. 557–576,\nOct. 2002.\n[29] T. Bu and D. Towsley, “Fixed-Point approximation for TCP behavior in\nan AQM network,” presented at the ACM SIGMETRICS 2001, Cam-\nbridge, MA, June 2001.\n[30] W. Leland, M. Taqqu, W. Willinger, and D. Wilson, “On the self-similar\nnature of ethernet traffic (extended version),” IEEE\/ACM Trans. Net-\nworking, vol. 2, pp. 1–15, Feb. 1994.\n[31] T. Le-Ngoc and S. Krishnamurthy, “Performance of combined\nfree\/demand assignment multiple-access schemes in satellite commu-\nnications,” Int. J. Satell. Commun., vol. 14, pp. 11–21, 1996.\n[32] T. Le-Ngoc and J. I. Mohammed, “Combined free\/demand assignment\nmultiple-access (CFDAMA) protocols for packet satellite communica-\ntions,” Proc. 2nd IEEE Int. Conf. Univ. Pers. Communications (ICUPC),\npp. 824–828, 1993.\n[33] The ns manual [Online]. Available: http:\/\/www.isi.edu\/nsnam\/ns\/doc\n[34] M. Karaliopoulos, R. Tafazolli, and B. Evans, “An ns-derived GEO\nsatellite network simulator: Features, capabilities, results,” in Proc. IEE\nSeminar Simulation Modeling Satellite Systems, London, U.K., 2002,\npp. 6\/1–6\/6.\n[35] G. Açar, “End-to-end resource management in geostationary satellite\nnetworks,” Ph.D. dissertation, Dept. Elect. Electron. Eng., Imperial\nColl., London, U.K., 2001.\n[36] G. Fairhurst and L. Wood, Advice to link designers on link automatic\nrepeat request (ARQ), IETF, RFC 3366 (BCP), Aug. 2002.\n[37] M. Karaliopoulos, R. Tafazolli, and B. Evans, “On the interaction of\nTCP with BoD in GEO broadband satellite networks,” in Proc. IEEE\nGLOBECOM 2002, Taipei, Taiwan, 2002, pp. 2945–2949.\n[38] V. Jacobson, R. Braden, and D. Borman, TCP extensions for high per-\nformance, IETF, RFC 1323, May 1992.\n[39] J. H. Saltzer, D. P. Reed, and D. D. Clark, “End-to-end arguments in\nsystem design,” ACM Trans. Comput. Syst., pp. 277–288, 1984.\n[40] J. Border et al., Performance enhancing proxies intended to mitigate\nlink-related degradations, IETF, RFC 3135, June 2001.\n[41] Y. Zhang, Internetworking and Computing Over Satellite Networks.\nNorwell, MA: Kluwer, 2003.\n[42] M. Karaliopoulos, R. Tafazolli, and B. Evans, “TCP performance on\nsplit connection GEO satellite links,” presented at the 19th ICSSC and\nExhibit, Toulouse, France, 2001.\n[43] K. Kummerle, “Multiplexor performance for integrated line- and packet\nswitched traffic,” in Proc. ICCC, Sweden, 1974, pp. 508–515.\n[44] Universal Mobile Telecommunications System (UMTS), June 2002.\nInterlayer procedures in connected mode, 3GPP TS 25.303, ver. 5.1.0,\nRel. 5.\n[45] R. Jain, The Art of Computer Systems Performance Analysis. New\nYork: Wiley, 1991, ch. 16–23.\n[46] N. Celandroni, F. Davoli, and E. Ferro, “Static and dynamic resource\nallocation in a multi-service satellite network with fading,” Int. J. Satell.\nCommun. Networking, vol. 21, pp. 469–487, July 2003.\n[47] S. Floyd, “Connections with multiple congested gateways in packet-\nswitched networks, Part 1: One-way traffic,” ACM Comput. Commun.\nRev., vol. 21, no. 5, pp. 30–47, 1991.\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \nKARALIOPOULOS et al.: PROVIDING DIFFERENTIATED SERVICE TO TCP FLOWS OVER BoD GEOSTATIONARY SATELLITE NETWORKS 347\n[48] F. Kelly, “Mathematical modeling of the Internet (extended version),”\npresented at the 4th Int. Congr. Industrial and Applied Mathematics, Ed-\ninburgh, U.K., 1999.\n[49] S. Low and D. E. Lapsley, “Optimization flow control I: Basic algorithm\nand convergence,” IEEE\/ACM Trans. Networking, vol. 7, pp. 861–874,\n1999.\n[50] R. Mortier, I. Pratt, C. Clark, and S. Crosby, “Implicit admission con-\ntrol,” IEEE J. Select. Areas Commun., vol. 18, pp. 2629–2639, Dec.\n2000.\n[51] A. Kumar, “Nonintrusive TCP connection admission control for\nbandwidth management of an Internet link,” IEEE Commun. Mag., pp.\n160–167, 2000.\n[52] L. Massoulie and J. Roberts, “Arguments in favor of admission control\nfor TCP flows,” in Proc. 16th Int. Teletraffic Congress, Edinburgh, U.K.,\n1999, pp. 33–44.\nMerkourios Karaliopoulos (S’99) was born in\nThessaloniki, Greece, in 1975. He received the\nDiploma degree in electrical and computer engi-\nneering from Aristotle University of Thessaloniki,\nin 1998. In October 1999, he joined the Centre\nfor Communication Systems Research (CCSR),\nUniversity of Surrey, U.K., where he is working\ntoward the Ph.D. degree in the area of broadband\nsatellite networks.\nHis main research interests are in the area of\nmobile and wireless data networking and radio\nresource management. He is currently employed by CCSR as a Research\nAssistant in the Mobile Communications Research Group. During the last\nthree years, he has been working for two European Commision projects, the\nIST SATIN (Satellite UMTS IP-based Network) and the IST MoDiS (Mobile\nDigital Broadcasting Satellite) projects and has participated in the European\nCOST Action 272 (packet-oriented delivery over satellite).\nMr. Karaliopoulos is a Student Member of the Institution of Electrical Engi-\nneers (IEE) and a member of the Technical Chamber of Greece.\nRahim Tafazolli (M’89) is a Professor of satellite\nand terrestrial mobile communications and Head\nof the Mobile Communications Research Group\nwith the Centre for Communication Systems Re-\nsearch (CCSR), School of Electronics and Physical\nSciences, University of Surrey, Surrey, U.K.\nHis research activities focus on optimization\ntechniques for mobile multimedia networks, mainly\non advanced resource management, mobility\nmanagement, and medium access control. He has\npublished more than 300 research papers in refereed\njournals, international conferences, and as invited speaker. He currently has\nmore than 15 patents in the field of mobile communications. He is an advisor\nand consultant to a number of mobile companies.\nProf. Tafazolli is a member of the Institution of Electrical Engineers\n(IEE) Committee on the U.K. Regulations on “Information Technology &\nTelecommunications,” a Member of the EU Wireless Strategy Initiative (WSI)\nThink-Tank group, Chairman of “New Technologies” group of Wireless World\nResearch Forum (WWRF), and Academic Coordinator of the U.K. Mobile\nVirtual Centre of Excellence (VCE). He is the Founder and the past Chairman\nof International Conference on “3G Mobile Technologies.”\nBarry G. Evans (M’86–SM’98) received the B.Sc.\nand Ph.D. degrees in electrical engineering and\nmicrowave systems from the University of Leeds,\nLeeds, U.K., in 1965 and 1968, respectively.\nFrom 1969 to 1983, he was a British Telecom\nLecturer-Reader in telecommunications systems at\nthe University of Essex, Essex, U.K. In 1983, he\nwas appointed to the Alec Harley Reeves Chair of\nInformation Systems Engineering, University of\nSurrey, Surrey, U.K., and in 1990, he became the\nfirst Director of Postgraduate Centre for Satellite\nEngineering Research, which he built up to about 150 researchers and a\nspin-off company, Surrey Satellite Technology Ltd., Surrey. Since 1996, he\nhas been Director of the new Centre for Communication Systems Research,\nSurrey, which is now 120 researchers strong and is Pro-Vice Chancellor for\nresearch and enterprise since 2001. He is the author of three books and over\n400 technical papers.\nProf. Evans is a Fellow of the Royal Academy of Engineering, U.K., a Fellow\nof the Institution of Electrical Engineers (IEE), and a senior member of the\nAmerican Institute of Aeronautics and Astronautics (AIAA). He is Editor of the\nInternational Journal of Satellite Communications. He has been Technical Ad-\nvisor to the D.G. of OFTEL, a Member of the U.K. Foresight and MoD research\ncommittees, and an Advisor to the EU on framework and R&D programs.\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 20,2010 at 09:15:04 UTC from IEEE Xplore.  Restrictions apply. \n"}