{"doi":"10.1371\/journal.pmed.1001053","coreId":"220335","oai":"oai:eprints.lse.ac.uk:37706","identifiers":["oai:eprints.lse.ac.uk:37706","10.1371\/journal.pmed.1001053"],"title":"Risk factors for severe outcomes following 2009 influenza A (H1N1) infection: a global pooled analysis","authors":["Peiris, J. S. Malik","Van Kerkhove, Maria D.","Vandemaele, Katelijn A. H.","Shinde, Vivek","Jaramillo-Gutierrez, Giovanna","Koukounari, Artemis","Donnelly, Christl A.","Carlino, Luis O.","Owen, Rhonda","Paterson, Beverly","Pelletier, Louise","Vachon, Julie","Gonzalez, Claudia","Hongjie, Yu","Zijian, Feng","Chuang, Shuk Kwan","Au, Albert","Buda, Silke","Krause, Gerard","Haas, Walter","Bonmarin, Isabelle","Taniguichi, Kiyosu","Nakajima, Kensuke","Shobayashi, Tokuaki","Takayama, Yoshihiro","Sunagawa, Tomi","Heraud, Jean Michel","Orelle, Arnaud","Palacios, Ethel","van der Sande, Marianne A. B.","Wielders, C. C. H. Lieke","Hunt, Darren","Cutter, Jeffrey","Lee, Vernon J.","Thomas, Juno","Santa-Olalla, Patricia","Sierra-Moros, Maria J.","Hanshaoworakul, Wanna","Ungchusak, Kumnuan","Pebody, Richard","Jain, Seema","Mounts, Anthony W."],"enrichments":{"references":[{"id":17292350,"title":"16) Surveillance de la grippe A (H1N1) 2009 en France: outils et me ´thodes.","authors":[],"date":"2009","doi":null,"raw":"Institut de Veille Sanitaire (2009 December 16) Surveillance de la grippe A (H1N1) 2009 en France: outils et me ´thodes. Available: http:\/\/www.invs.sante. fr\/surveillance\/grippe_dossier\/docs_professionnels\/methodo_surveillance_-grippe_161209.pdf. Accessed 19 May 2011.","cites":null},{"id":17292310,"title":"25) Swine influenza: statement by WHO DirectorGeneral, Dr Margaret Chan. Available: http:\/\/www.who.int\/mediacentre\/ Risk Factors for H1N1pdm Severity PLoS","authors":[],"date":"2009","doi":null,"raw":"Chan M (2009 April 25) Swine influenza: statement by WHO DirectorGeneral, Dr Margaret Chan. Available: http:\/\/www.who.int\/mediacentre\/ Risk Factors for H1N1pdm Severity PLoS Medicine | www.plosmedicine.org 9 July 2011 | Volume 8 | Issue 7 | e1001053news\/statements\/2009\/h1n1_20090425\/en\/index.html. Accessed 21 January 21 2010.","cites":null},{"id":17292365,"title":"A review on the Hong Kong influenza surveillance system.","authors":[],"date":"2000","doi":"10.5353\/th_b4693579","raw":"Kong WM (2000) A review on the Hong Kong influenza surveillance system. Public Health Epidemiology Bull 9.","cites":null},{"id":17292428,"title":"An epidemiological study of 1348 cases of pandemic H1N1 influenza admitted to Singapore hospitals from July to","authors":[],"date":"2010","doi":null,"raw":"Subramony H, Lai FY, Ang LW, Cutter J, Lim PL, et al. (2010) An epidemiological study of 1348 cases of pandemic H1N1 influenza admitted to Singapore hospitals from July to September 2009. Ann Acad Med Singapore 39: 283–290. Risk Factors for H1N1pdm Severity PLoS Medicine | www.plosmedicine.org 11 July 2011 | Volume 8 | Issue 7 | e1001053Editors’ Summary Background. In April 2009, a new strain of influenza A H1N1 was first identified in Mexico and the United States and subsequently spread around the world. In June 2009, the World Health Organization (WHO) declared a pandemic alert phase 6, which continued until August 2010. Throughout the pandemic, WHO and member states gathered information to characterize the patterns of risk associated with the new influenza A H1N1 virus infection and to assess the clinical picture. Although risk factors for severe disease following seasonal influenza infection have been well documented in many countries (for example, pregnancy; chronic medical conditions such as pulmonary, cardiovascular, renal, hepatic, neuromuscular, hematologic, and metabolic disorders; some cognitive conditions; and immunodeficiency), risk factors for severe disease following infection early in the 2009 H1N1 pandemic were largely unknown. Why Was This Study Done? Many countries have recently reported data on the association between severe H1N1 influenza and a variety of underlying risk factors, but because these data are presented in different formats, making direct comparisons across countries is difficult, with no clear consensus for some conditions. Therefore, to assess the frequency and distribution of known and new potential risk factors for severe H1N1 infection, this study was conducted to collect data (from 1 April 2009 to 1 January 2010) from surveillance programs of the Ministries of Health or National Public Health Institutes in 19 countries_Argentina, Australia, Canada, Chile, China, France, Germany, Hong Kong (special administrative region), Japan, Madagascar, Mexico, the Netherlands, New Zealand, Singapore, South Africa, Spain, Thailand, the United States, and the United Kingdom. What Did the Researchers Do and Find? As part of routine surveillance, countries were asked to provide risk factor data on laboratory-confirmed H1N1 in patients who were admitted to hospital, admitted to the intensive care unit (ICU), or had died because of their infection, using a standardized format. The researchers grouped potential risk conditions into four categories: age, chronic medical illnesses, pregnancy (by trimester), and other conditions that were not previously considered as risk conditions for severe influenza outcomes, such as obesity. For each risk factor (except pregnancy), the researchers calculated the percentage of each group of patients using the total number of cases reported in each severity category (hospitalization, admission to ICU, and death). To evaluate the risk associated with pregnancy, the researchers used the ratio of pregnant women to all women of childbearing age (age 15–49 years) at each level of severity to describe the differences between levels. The researchers were able to collect data on approximately 70,000 patients requiring hospitalization, 9,700 patients admitted to the ICU, and 2,500 patients who died from H1N1 infection. The proportion of patients with H1N1 with one or more reported chronic conditions increased with severity—the median was 31.1% of hospitalized patients,","cites":null},{"id":17292422,"title":"Arizona—Supplemental influenza summary","authors":[],"date":"2010","doi":null,"raw":"Arizona Department of Health Services (2010) Arizona—Supplemental influenza summary MMWR Week 9 (2\/28\/10–3\/6\/10). Phoenix (Arizona): Arizona Department of Health Services.","cites":null},{"id":17292424,"title":"Australian Government Department of Health and Aging","authors":[],"date":"2010","doi":null,"raw":"Australian Government Department of Health and Aging (2010) Australian influenza surveillance report no. 8, 2010. Available: http:\/\/www.healthemergency.gov.au\/internet\/healthemergency\/publishing.nsf\/Content\/ EB136394E79CA5E2CA2576A50010783A\/$File\/ozflu-no8-2010.pdf. Accessed 19 May 2011.","cites":null},{"id":17292316,"title":"Barno A","authors":[],"date":"1959","doi":null,"raw":"Freeman DW, Barno A (1959) Deaths from Asian influenza associated with pregnancy. Am J Obstet Gynecol 78: 1172–1175.","cites":null},{"id":17292347,"title":"Bestrijding van de nieuwe influenza A (H1N1). II. Epidemiologie en niet-medicamenteuze maatregelen. Ned Tijdschr Geneeskd 153: A771.","authors":[],"date":"2009","doi":null,"raw":"van der Sande MAB, van der Hoek W, Hooiveld M, Donker GA, van Steenbergen JE, et al. (2009) Bestrijding van de nieuwe influenza A (H1N1). II. Epidemiologie en niet-medicamenteuze maatregelen. Ned Tijdschr Geneeskd 153: A771.","cites":null},{"id":17292364,"title":"Canadian pandemic H1N1 cases: a description of the changing epidemiology of hospitalizations and deaths in the first and second waves.","authors":[],"date":"2011","doi":"10.1503\/cmaj.100746","raw":"Helferty M, Vachon J, Tarasuk J, Rodin R, Spika J, et al. (2011) Canadian pandemic H1N1 cases: a description of the changing epidemiology of hospitalizations and deaths in the first and second waves. CMAJ. In press.","cites":null},{"id":17292323,"title":"Characteristics of pandemic influenza A (H1N1) infection in patients presenting to a university hospital in Riyadh,","authors":[],"date":"2010","doi":null,"raw":"BinSaeed A (2010) Characteristics of pandemic influenza A (H1N1) infection in patients presenting to a university hospital in Riyadh, Saudi Arabia. Ann Saudi Med 30: 59–62.","cites":null},{"id":17292417,"title":"Clinical features, risk factors, and complications among pediatric patients with pandemic influenza A (H1N1). Clin Pediatr (Phila)","authors":[],"date":"2010","doi":"10.1177\/0009922810368558","raw":"Plessa E, Diakakis P, Gardelis J, Thirios A, Koletsi P, et al. (2010) Clinical features, risk factors, and complications among pediatric patients with pandemic influenza A (H1N1). Clin Pediatr (Phila) 49: 777–781.","cites":null},{"id":17292371,"title":"Comparative age distribution of influenza morbidity and mortality during seasonal influenza epidemics and the 2009 H1N1 pandemic.","authors":[],"date":"2010","doi":"10.1186\/1471-2334-10-162","raw":"Lemaitre M, Carrat F (2010) Comparative age distribution of influenza morbidity and mortality during seasonal influenza epidemics and the 2009 H1N1 pandemic. BMC Infect Dis 10: 162.","cites":null},{"id":17292332,"title":"Correlates of severe disease in patients with","authors":[],"date":"2010","doi":"10.1503\/cmaj.091884","raw":"Zarychanski R, Stuart TL, Kumar A, Doucette S, Elliott L, et al. (2010) Correlates of severe disease in patients with 2009 pandemic influenza (H1N1) virus infection. CMAJ 182: 257–264.","cites":null},{"id":17292368,"title":"Covariate heterogeneity in meta-analysis: criteria for deciding between meta-regression and individual patient data.","authors":[],"date":"2007","doi":"10.1002\/sim.2768","raw":"Simmonds MC, Higgins JP (2007) Covariate heterogeneity in meta-analysis: criteria for deciding between meta-regression and individual patient data. Stat Med 26: 2982–2999.","cites":null},{"id":17292320,"title":"Critical care services and 2009 H1N1 influenza in Australia and New Zealand.","authors":[],"date":"2009","doi":"10.1056\/nejmoa0908481","raw":"The ANZIC Influenza Investigators (2009) Critical care services and 2009 H1N1 influenza in Australia and New Zealand. N Engl J Med 361: 1925–1934. Available: http:\/\/www.nejm.org\/doi\/full\/10.1056\/NEJMoa0908481#t=artiarticle. Accessed 19 May 2011.","cites":null},{"id":17292381,"title":"Critically ill patients with 2009 influenza A(H1N1) infection in Canada.","authors":[],"date":"2009","doi":"10.1001\/jama.2009.1496","raw":"Kumar A, Zarychanski R, Pinto R, Cook DJ, Marshall J, et al. (2009) Critically ill patients with 2009 influenza A(H1N1) infection in Canada. JAMA 302: 1872–1879.","cites":null},{"id":17292346,"title":"De nieuwe influenza A(H1N1)-epidemie in Nederland. Epidemiologische gegevens over de periode 30 april–14 augustus 2009. Ned Tijdschr Geneeskd 153: A969.","authors":[],"date":"2009","doi":null,"raw":"Vriend HJ, Hahne ´ SJM, Donker T, Meijer A, Timen A, et al. (2009) De nieuwe influenza A(H1N1)-epidemie in Nederland. Epidemiologische gegevens over de periode 30 april–14 augustus 2009. Ned Tijdschr Geneeskd 153: A969.","cites":null},{"id":17292306,"title":"Disease Control and Prevention","authors":[],"date":"2009","doi":"10.1016\/j.cvdpc.2008.11.002","raw":"Centers for Disease Control and Prevention (2009) Update: swine influenza A (H1N1) infections—California and Texas, April 2009 MMWR Morb Mortal Wkly Rep 58: 435–437. Available: http:\/\/www.cdc.gov\/mmwr\/preview\/ mmwrhtml\/mm5816a7.htm. Accessed 22 January 2010.","cites":null},{"id":17292361,"title":"Effectiveness of oseltamivir on disease progression and viral RNA shedding in patients with mild pandemic","authors":[],"date":"2010","doi":"10.1136\/bmj.c4779","raw":"Yu H, Liao Q, Yuan Y, Zhou L, Xiang N, et al. (2010) Effectiveness of oseltamivir on disease progression and viral RNA shedding in patients with mild pandemic 2009 influenza A H1N1: opportunistic retrospective study of medical charts in China. BMJ 341: c4779.","cites":null},{"id":17292408,"title":"Emerging infections and pregnancy.","authors":[],"date":"2006","doi":"10.3201\/eid1211.060152","raw":"Jamieson D, Theiler R, Rasmussen S (2006) Emerging infections and pregnancy. Emerg Infect Dis 12: 1638–1643.","cites":null},{"id":17292370,"title":"epidemic intelligence team at InVS (2009) Epidemiology of fatal cases associated with pandemic H1N1 influenza 2009. Euro Surveill 14: pii: 19309. Risk Factors for","authors":[],"date":"2011","doi":null,"raw":"Vaillant L, La Ruche G, Tarantola A, Barboza P, epidemic intelligence team at InVS (2009) Epidemiology of fatal cases associated with pandemic H1N1 influenza 2009. Euro Surveill 14: pii: 19309. Risk Factors for H1N1pdm Severity PLoS Medicine | www.plosmedicine.org 10 July 2011 | Volume 8 | Issue 7 | e100105355. Bettinger JA, Sauve ´ LJ, Scheifele DW, Moore D, Vaudry W, et al. (2010) Pandemic influenza in Canadian children: A summary of hospitalized pediatric cases. Vaccine 28: 3180–3184.","cites":null},{"id":17292372,"title":"Epidemiological characteristics and low case fatality rate of pandemic (H1N1)","authors":[],"date":"2009","doi":"10.1371\/currents.rrn1139","raw":"Kamigaki T, Oshitani H (2009) Epidemiological characteristics and low case fatality rate of pandemic (H1N1) 2009 in Japan. PLoS Curr 1: RRN1139.","cites":null},{"id":17292339,"title":"Epidemiology of influenza A(H1N1)v virus infection","authors":[],"date":"2010","doi":null,"raw":"Shimada T, Gu Y, Kamiya H, Komiya N, Odaira F, et al. (2010) Epidemiology of influenza A(H1N1)v virus infection in Japan, May–June 2009. Euro Surveill 14: pii: 19244. Available: http:\/\/www.eurosurveillance.org\/ViewArticle.aspx?ArticleId=19244. Accessed 19 May 2011.","cites":null},{"id":17292328,"title":"Factors associated with death or hospitalization due to pandemic 2009 influenza A(H1N1) infection in California.","authors":[],"date":"2009","doi":"10.1001\/jama.2009.1583","raw":"Louie JK, Acosta M, Winter K, Jean C, Gavali S, et al. (2009) Factors associated with death or hospitalization due to pandemic 2009 influenza A(H1N1) infection in California. JAMA 302: 1896–1902.","cites":null},{"id":17292377,"title":"Factors associated with mortality after an asthma admission: A national United Kingdom database analysis.","authors":[],"date":"2007","doi":"10.1016\/j.rmed.2007.03.006","raw":"Watson L, Turk F, James P, Holgate ST (2007) Factors associated with mortality after an asthma admission: A national United Kingdom database analysis. Respir Med 101: 1659–1664.","cites":null},{"id":17292373,"title":"Flahault A","authors":[],"date":"2010","doi":"10.1038\/sj.ph.1900782","raw":"Hanslik T, Boelle P, Flahault A (2010) Preliminary estimation of risk factors for admission to intensive care units and for death in patients infected with A(H1N1)2009 influenza virus, France, 2009–2010. PLoS Curr 2: RRN1150.","cites":null},{"id":17292313,"title":"for Immunization and Respiratory Diseases","authors":[],"date":"2009","doi":null,"raw":"National Center for Immunization and Respiratory Diseases (2009) Use of influenza A (H1N1) 2009 monovalent vaccine. Recommendations of the Advisory Committee on Immunization Practices (ACIP), 2009. MMWR Recomm Rep 58(RR-10): 1–8.","cites":null},{"id":17292358,"title":"Garcı ´a M, Limia Sa ´nchez A, Andre ´s Prado J, Pacho ´n del Amo I, et al.","authors":[],"date":"2010","doi":null,"raw":"Santa-Olalla Peralta P, Cortes Garcı ´a M, Limia Sa ´nchez A, Andre ´s Prado J, Pacho ´n del Amo I, et al. (2010) Critically ill patients with 2009 pandemic influenza A (H1N1) infection in Spain: factors associated with death, April 2009–January 2010. Rev Esp Salud Publica 84: 547–568.","cites":null},{"id":17292414,"title":"Gripe A pande ´mica en una unidad de cuidados intensivos: experiencia en Espan ˜a y Latinoame ´rica (Grupo Espan ˜ol de Trabajo de Gripe A Grave\/Sociedad Espan ˜ola de Medicina Intensiva, Crı ´tica y Unidades Coronarias).","authors":[],"date":"2010","doi":"10.1016\/j.medin.2009.12.005","raw":"Rodrı ´guez A, Socı ´as L, Guerrero J, Figueira J, Gonza ´lez N, et al. (2010) Gripe A pande ´mica en una unidad de cuidados intensivos: experiencia en Espan ˜a y Latinoame ´rica (Grupo Espan ˜ol de Trabajo de Gripe A Grave\/Sociedad Espan ˜ola de Medicina Intensiva, Crı ´tica y Unidades Coronarias). Med Intensiva 34: 87–94.","cites":null},{"id":17292334,"title":"Hospitalised adult patients with pandemic (H1N1) 2009 influenza in","authors":[],"date":"2010","doi":null,"raw":"Denholm J, Gordon C, Johnson P, Hewagama S, Stuart R, et al. (2010) Hospitalised adult patients with pandemic (H1N1) 2009 influenza in Melbourne, Australia. MJA 192: 84–86.","cites":null},{"id":17292352,"title":"Hospitalized patients with","authors":[],"date":"2009","doi":null,"raw":"Jain S, Kamimoto L, Bramley AM, Schmitz AM, Benoit SR, et al. (2009) Hospitalized patients with 2009 H1N1 influenza in the United States, April– June 2009. N Engl J Med 361: 1935–1944.","cites":null},{"id":17292351,"title":"Hospitalized patients with 2009 pandemic influenza A (H1N1) virus infection in the United States—September–October","authors":[],"date":"2011","doi":"10.1093\/cid\/ciq021","raw":"Skarbinski J, Jain S, Bramley A, Lee EJ, Huang J, et al. (2011) Hospitalized patients with 2009 pandemic influenza A (H1N1) virus infection in the United States—September–October 2009. Clin Infect Dis 52(Suppl 1): S50–S59.","cites":null},{"id":17292315,"title":"Impact of influenza exposure on rates of hospital admissions and physician visits because of respiratory illness among pregnant women.","authors":[],"date":"2007","doi":"10.1503\/cmaj.061435","raw":"Dodd L, McNeil SA, Fell DB, Allen VM, Coombs A, et al. (2007) Impact of influenza exposure on rates of hospital admissions and physician visits because of respiratory illness among pregnant women. CMAJ 176: 463–468.","cites":null},{"id":17292318,"title":"Impact of influenza on acute cardiopulmonary hospitalizations in pregnant women.","authors":[],"date":"1998","doi":"10.1093\/oxfordjournals.aje.a009587","raw":"Neuzil KM, Reed GW, Mitche EF, Simonsen L, Griffin MR (1998) Impact of influenza on acute cardiopulmonary hospitalizations in pregnant women. Am J Epidemiol 148: 1094–1102.","cites":null},{"id":17292375,"title":"Incidence of 2009 pandemic influenza A H1N1 infection in England: a crosssectional serological study.","authors":[],"date":"2010","doi":"10.1016\/s0140-6736(09)62126-7","raw":"Miller E, Hoschler K, Hardelid P, Stanford E, Andrews N, et al. (2010) Incidence of 2009 pandemic influenza A H1N1 infection in England: a crosssectional serological study. Lancet 375: 1100–1108.","cites":null},{"id":17292317,"title":"Influenza occurring in pregnant women.","authors":[],"date":"1919","doi":"10.1001\/jama.1919.02610140008002","raw":"Harris JW (1919) Influenza occurring in pregnant women. JAMA 72: 978–980.","cites":null},{"id":17292380,"title":"influenza virus infection during pregnancy in the USA.","authors":[],"date":"2009","doi":null,"raw":"Jamieson DJ, Honein MA, Rasmussen SA, Williams JL, Swerdlow DL, et al. (2009) H1N1 2009 influenza virus infection during pregnancy in the USA. Lancet 374: 451–458.","cites":null},{"id":17292412,"title":"Intensive care adult patients with severe respiratory failure caused by Influenza A (H1N1)v in Spain.","authors":[],"date":"2009","doi":"10.1186\/cc8044","raw":"Rello J, Rodrı ´guez A, Iban ˜ez P, Socias L, Cebrian J, et al. (2009) Intensive care adult patients with severe respiratory failure caused by Influenza A (H1N1)v in Spain. Crit Care 13: R148.","cites":null},{"id":17292386,"title":"Interim report on pandemic H1N1 influenza virus infections in South Africa,","authors":[],"date":"2009","doi":null,"raw":"Archer B, Cohen C, Naidoo D, Thomas J, Makunga C, et al. (2009) Interim report on pandemic H1N1 influenza virus infections in South Africa, April to October 2009: epidemiology and factors associated with fatal cases. Euro Surveill 14: pii: 19369.","cites":null},{"id":17292348,"title":"Jaarrapportage surveillance respiratoire infectieziekten","authors":[],"date":"2010","doi":null,"raw":"Dijkstra F, van ’t Klooster TM, Brandsema P, van Gageldonk-Lafeber AB, Meijer A, et al. (2010) Jaarrapportage surveillance respiratoire infectieziekten","cites":null},{"id":17292356,"title":"Limia Sa ´nchez A, Cortes Garcı ´a","authors":[],"date":"2010","doi":null,"raw":"Sierra Moros MJ, Va ´zquez Torres M, Santa-Olalla Peralta P, Limia Sa ´nchez A, Cortes Garcı ´a M, et al. (2010) Epidemiological surveillance activities during the 2009 influenza pandemic in Spain. Lessons learnt one year after. Rev Esp Salud Publica 84: 463–480.","cites":null},{"id":17292419,"title":"Morbid obesity as a risk factor for hospitalization and death due to 2009 pandemic influenza A(H1N1) disease.","authors":[],"date":"2010","doi":"10.1371\/journal.pone.0009694","raw":"Morgan O, Bramley A, Fowlkes A, Freedman D, Taylor TH, et al. (2010) Morbid obesity as a risk factor for hospitalization and death due to 2009 pandemic influenza A(H1N1) disease. PLoS ONE 5: e9694. doi:9610.1371\/ journal.pone.0009694.","cites":null},{"id":17292322,"title":"Mortality from pandemic A\/H1N1 2009 influenza in England: public health surveillance study.","authors":[],"date":"2009","doi":"10.1136\/bmj.b5213","raw":"Donaldson LJ, Rutter PD, Ellis BM, Greaves FEC, Mytton OT, et al. (2009) Mortality from pandemic A\/H1N1 2009 influenza in England: public health surveillance study. BMJ 339: b5213.","cites":null},{"id":17292314,"title":"National seasonal influenza vaccination survey in Europe,","authors":[],"date":"2008","doi":"10.2807\/1560-7917.es2014.19.16.20780","raw":"Mereckiene J, Cotter S, Nicoll A, Levy-Bruhl D, Ferro A, et al. (2008) National seasonal influenza vaccination survey in Europe, 2008. Euro Surveill 13: pii:","cites":null},{"id":17292425,"title":"Ninety years on: what we still need to learn from ‘‘Black","authors":[],"date":"2008","doi":null,"raw":"Wilson N, Baker M (2008) Ninety years on: what we still need to learn from ‘‘Black November’’ 1918 about pandemic influenza. N Z Med J 121: 136–138.","cites":null},{"id":17292311,"title":"Organization (2010) Evolution of a pandemic: A(H1N1)","authors":[],"date":"2009","doi":"10.1136\/bmj.b2425","raw":"World Health Organization (2010) Evolution of a pandemic: A(H1N1) 2009, April 2009–March 2010. Geneva: World Health Organization.","cites":null},{"id":17292355,"title":"Outbreak of pandemic influenza A (H1N1-2009) in Singapore,","authors":[],"date":"2010","doi":null,"raw":"Cutter J, Ang LW, Lai FY, Subramony H, Ma S, et al. (2010) Outbreak of pandemic influenza A (H1N1-2009) in Singapore, May to September 2009. Ann Acad Med Singapore 39: 273–282.","cites":null},{"id":17292396,"title":"Pandemic","authors":[],"date":"2010","doi":null,"raw":"Siston AM, Rasmussen SA, Honein MA, Fry AM, Seib K, et al. (2010) Pandemic 2009 influenza A(H1N1) virus illness among pregnant women in the United States. JAMA 303: 1517–1525.","cites":null},{"id":17292369,"title":"Pandemic influenza A (H1N1) 2009 and mortality in the United Kingdom: risk factors for death,","authors":[],"date":"2010","doi":null,"raw":"Pebody RG, McLean E, Zhao H, Cleary P, Bracebridge S, et al. (2010) Pandemic influenza A (H1N1) 2009 and mortality in the United Kingdom: risk factors for death, April 2009 to March 2010. Euro Surveill 15: pii: 19571.","cites":null},{"id":17292426,"title":"Pandemic influenza preparedness and vulnerable populations in tribal communities.","authors":[],"date":"2009","doi":"10.2105\/ajph.2008.157453","raw":"Groom AV, Jim C, Laroque M, Mason C, McLaughlin J, et al. (2009) Pandemic influenza preparedness and vulnerable populations in tribal communities. Am J Public Health 99(Suppl 2): S271–S278.","cites":null},{"id":17292410,"title":"Pneumonia in pregnancy.","authors":[],"date":"2005","doi":"10.1097\/01.ccm.0000182483.24836.66","raw":"Goodnight W, Soper D (2005) Pneumonia in pregnancy. Crit Care Med 33: S390–S397.","cites":null},{"id":17292366,"title":"Population Division (2009) World population prospects: the 2008 revision population database.","authors":[],"date":null,"doi":"10.1111\/j.1728-4457.2010.00368.x","raw":"United Nations Population Division (2009) World population prospects: the 2008 revision population database. http:\/\/esa.un.org\/unpd\/wpp\/unpp\/panel_ population.htm.","cites":null},{"id":17292367,"title":"Quantifying heterogeneity in a meta-analysis.","authors":[],"date":"2002","doi":"10.1002\/sim.1186","raw":"Higgins J, Thompson SG (2002) Quantifying heterogeneity in a meta-analysis. Stat Med 21: 1539–1558.","cites":null},{"id":17292349,"title":"Rijksinstituut voor Volksgezondheid en Milieu,","authors":[],"date":"2010","doi":"10.1021\/es500629f","raw":"Bilthoven: Rijksinstituut voor Volksgezondheid en Milieu, 2010. RIVM RIVM-briefrapportnummer: 210231006. Available: http:\/\/www.rivm.nl\/bibliotheek\/rapporten\/210231006.pdf. Accessed 19 May 2011.","cites":null},{"id":17292357,"title":"Risk factors for disease severity among hospitalised patients with 2009 pandemic influenza A (H1N1) in Spain, April–December","authors":[],"date":"2010","doi":null,"raw":"Santa-Olalla Peralta P, Cortes-Garcia M, Vicente-Herrero M, CastrilloVillamandos C, Arias-Bohigas P, et al. (2010) Risk factors for disease severity among hospitalised patients with 2009 pandemic influenza A (H1N1) in Spain, April–December 2009. Euro Surveill 15: pii: 19667.","cites":null},{"id":17292362,"title":"Risk factors for severe illness with 2009 pandemic influenza A(H1N1) virus infection in China.","authors":[],"date":"2011","doi":"10.1093\/cid\/ciq144","raw":"Yu H, Feng Z, Ujeki TM, Liao Q, Zhou L, et al. (2011) Risk factors for severe illness with 2009 pandemic influenza A(H1N1) virus infection in China. Clin Infect Dis 52: 457–465.","cites":null},{"id":17292363,"title":"Risk of severe outcomes among patients admitted to hospital with pandemic (H1N1) influenza.","authors":[],"date":"2010","doi":"10.1503\/cmaj.091823","raw":"Campbell A, Rodin R, Kropp R, Mao Y, Hong Z, et al. (2010) Risk of severe outcomes among patients admitted to hospital with pandemic (H1N1) influenza. CMAJ 182: 349–355.","cites":null},{"id":17292354,"title":"Sentinel surveillance system for early outbreak detection in Madagascar.","authors":[],"date":"2010","doi":"10.1186\/1471-2458-10-31","raw":"Randrianasolo L, Raoelina Y, Ratsitorahina M, Ravolomanana L, Andriamandimby S, et al. (2010) Sentinel surveillance system for early outbreak detection in Madagascar. BMC Public Health 10: 31.","cites":null},{"id":17292335,"title":"Severe, critical and fatal cases of 2009 H1N1 influenza in China.","authors":[],"date":"2010","doi":"10.1016\/j.jinf.2010.07.010","raw":"Yang P, Deng Y, Pang X, Shi W, Li X, et al. (2010) Severe, critical and fatal cases of 2009 H1N1 influenza in China. J Infect 61: 277–283. doi: 10.1016\/ j.jinf.2010.07.010.","cites":null},{"id":17292384,"title":"severity of 2009 pandemic influenza A (H1N1) virus infection in pregnant women.","authors":[],"date":"2010","doi":"10.1097\/aog.0b013e3181d57947","raw":"Creanga AA, Johnson TF, Graitcer SB, Hartman LK, Al-Samarrai T, et al. (2010) severity of 2009 pandemic influenza A (H1N1) virus infection in pregnant women. Obstet Gynecol 115: 717–726.","cites":null},{"id":17292353,"title":"SourcesofUKflu data: influenza surveillance in the United Kingdom. Available: http:\/\/www.hpa.org.uk\/webw\/HPAweb& HPAwebStandard\/HPAweb_C\/1195733821514?p=1191942171484.","authors":[],"date":"2010","doi":null,"raw":"UKHealthProtection Agency (2010) SourcesofUKflu data: influenza surveillance in the United Kingdom. Available: http:\/\/www.hpa.org.uk\/webw\/HPAweb& HPAwebStandard\/HPAweb_C\/1195733821514?p=1191942171484. Accessed 19 May 2011.","cites":null},{"id":17292324,"title":"Streptococcus pneumoniae coinfection is correlated with the severity of H1N1 pandemic influenza.","authors":[],"date":"2009","doi":"10.1371\/journal.pone.0008540","raw":"Palacios G, Hornig M, Cisterna D, Savji N, Bussetti A, et al. (2009) Streptococcus pneumoniae coinfection is correlated with the severity of H1N1 pandemic influenza. PLoS ONE 4: e8540. doi:10.1371\/journal.pone.0008540.","cites":null},{"id":17292359,"title":"Surveillance for the 2009 pandemic influenza A (H1N1) virus and seasonal influenza viruses - New Zealand,","authors":[],"date":"2009","doi":null,"raw":"Huang QS, Bandaranayake D, Lopez LD, Pirie R, Peacey M, et al. (2009) Surveillance for the 2009 pandemic influenza A (H1N1) virus and seasonal influenza viruses - New Zealand, 2009. MMWR Morb Mortal Wkly Rep 58: 918–921.","cites":null},{"id":17292342,"title":"Surveillance of hospitalisations for","authors":[],"date":"2010","doi":null,"raw":"van ’t Klooster T, Wielders C, Donker T, Isken L, Meijer A, et al. (2010) Surveillance of hospitalisations for 2009 pandemic influenza A(H1N1) in the Netherlands, 5 June–31 December 2009. Euro Surveill 15: pii: 19461.","cites":null},{"id":17292333,"title":"Surveillance of the first 205 confirmed hospitalised cases of pandemic","authors":[],"date":"2009","doi":null,"raw":"Cullen G, Martin J, O’Donnell J, Boland M, Canny M, et al. (2009) Surveillance of the first 205 confirmed hospitalised cases of pandemic H1N1 influenza in Ireland, 28 April–3 October 2009. Euro Surveill 14: pii: 19389.","cites":null},{"id":17292385,"title":"The ANZIC Influenza Investigators and Australasian Maternity Outcomes Surveillance System","authors":[],"date":"2010","doi":"10.1136\/bmj.c1279","raw":"The ANZIC Influenza Investigators and Australasian Maternity Outcomes Surveillance System (2010) Critical illness due to2009 A\/H1N1 influenza in pregnant and postpartum women: population based cohort study. BMJ 340: c1279. doi:1210.1136\/bmj.c1279.","cites":null},{"id":17292331,"title":"The first 100 hospitalized severe complicated influenza cases caused by 2009 pandemic influenza A (H1N1) in Taiwan. Taiwan Epidemiology Bulletin.","authors":[],"date":"2009","doi":null,"raw":"Chien Y, Su C, Tsai H, Huang S, Chuang J, et al. (2009) The first 100 hospitalized severe complicated influenza cases caused by 2009 pandemic influenza A (H1N1) in Taiwan. Taiwan Epidemiology Bulletin. Available: http:\/\/teb.cdc.gov.tw\/public\/Attachment\/23552_25-10-%E8%8B%B12-692-","cites":null},{"id":17292341,"title":"The first wave of pandemic influenza (H1N1) 2009 in Germany: from initiation to acceleration.","authors":[],"date":"2010","doi":"10.1186\/1471-2334-10-155","raw":"Poggensee G, Gilsdorf A, Buda S, Eckmanns T, Claus H, et al. (2010) The first wave of pandemic influenza (H1N1) 2009 in Germany: from initiation to acceleration. BMC Infect Dis 10: 155. doi:110.1186\/1471-2334-1110-1155.","cites":null},{"id":17292374,"title":"The infection attack rate and severity of 2009 pandemic H1N1 influenza in Hong Kong.","authors":[],"date":"2010","doi":null,"raw":"Wu JT, Ma ES, Lee CK, Chu DK, Ho PL, et al. (2010) The infection attack rate and severity of 2009 pandemic H1N1 influenza in Hong Kong. Clin Infect Dis 51: 1184–1191.","cites":null},{"id":17292376,"title":"The New York City Swine Flu Investigation Team,","authors":[],"date":"2009","doi":"10.1371\/journal.pmed.1000207","raw":"Presanis AM, De Angelis D, The New York City Swine Flu Investigation Team, Hagy A, Reed C, et al. (2009) The severity of pandemic H1N1 influenza in the United States, from April to July 2009: a Bayesian analysis. PLoS Med 6: e1000207. doi:10.1371\/journal.pmed.1000207.","cites":null},{"id":17292427,"title":"Updating the accounts: global mortality of the 1918–1920 ‘‘Spanish’’ influenza pandemic.","authors":[],"date":"2002","doi":"10.1353\/bhm.2002.0022","raw":"Johnson NP, Mueller J (2002) Updating the accounts: global mortality of the 1918–1920 ‘‘Spanish’’ influenza pandemic. Bull Hist Med 76: 105–115.","cites":null},{"id":17292307,"title":"World Health Organization","authors":[],"date":"2009","doi":"10.2471\/blt.09.04","raw":"World Health Organization (2009) Swine influenza—update 3. Available: http:\/\/ www.who.int\/csr\/don\/2009_04_27\/en\/index.html. Accessed 22 January 2010.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011","abstract":"Background\\ud\n\\ud\nSince the start of the 2009 influenza A pandemic (H1N1pdm), the World Health Organization and its member states have gathered information to characterize the clinical severity of H1N1pdm infection and to assist policy makers to determine risk groups for targeted control measures.\\ud\n\\ud\nMethods and Findings\\ud\n\\ud\nData were collected on approximately 70,000 laboratory-confirmed hospitalized H1N1pdm patients, 9,700 patients admitted to intensive care units (ICUs), and 2,500 deaths reported between 1 April 2009 and 1 January 2010 from 19 countries or administrative regions—Argentina, Australia, Canada, Chile, China, France, Germany, Hong Kong SAR, Japan, Madagascar, Mexico, the Netherlands, New Zealand, Singapore, South Africa, Spain, Thailand, the United States, and the United Kingdom—to characterize and compare the distribution of risk factors among H1N1pdm patients at three levels of severity: hospitalizations, ICU admissions, and deaths. The median age of patients increased with severity of disease. The highest per capita risk of hospitalization was among patients <5 y and 5–14 y (relative risk [RR] = 3.3 and 3.2, respectively, compared to the general population), whereas the highest risk of death per capita was in the age groups 50–64 y and ≥65 y (RR = 1.5 and 1.6, respectively, compared to the general population). Similarly, the ratio of H1N1pdm deaths to hospitalizations increased with age and was the highest in the ≥65-y-old age group, indicating that while infection rates have been observed to be very low in the oldest age group, risk of death in those over the age of 64 y who became infected was higher than in younger groups. The proportion of H1N1pdm patients with one or more reported chronic conditions increased with severity (median = 31.1%, 52.3%, and 61.8% of hospitalized, ICU-admitted, and fatal H1N1pdm cases, respectively). With the exception of the risk factors asthma, pregnancy, and obesity, the proportion of patients with each risk factor increased with severity level. For all levels of severity, pregnant women in their third trimester consistently accounted for the majority of the total of pregnant women. Our findings suggest that morbid obesity might be a risk factor for ICU admission and fatal outcome (RR = 36.3).\\ud\n\\ud\nConclusions\\ud\n\\ud\nOur results demonstrate that risk factors for severe H1N1pdm infection are similar to those for seasonal influenza, with some notable differences, such as younger age groups and obesity, and reinforce the need to identify and protect groups at highest risk of severe outcomes","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/220335.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/37706\/1\/Risk_factors_for_severe_outcomes_following_2009_influenza_A_%28H1N1%29_infection_a_global_pooled_analysis%28lsero%29.pdf","pdfHashValue":"6abccb885ae336c060736e7c66f9e2bf72455dd7","publisher":"Public Library of Science","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:37706<\/identifier><datestamp>\n      2017-10-20T15:42:15Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5354<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/37706\/<\/dc:relation><dc:title>\n        Risk factors for severe outcomes following 2009 influenza A (H1N1) infection: a global pooled analysis<\/dc:title><dc:creator>\n        Peiris, J. S. Malik<\/dc:creator><dc:creator>\n        Van Kerkhove, Maria D.<\/dc:creator><dc:creator>\n        Vandemaele, Katelijn A. H.<\/dc:creator><dc:creator>\n        Shinde, Vivek<\/dc:creator><dc:creator>\n        Jaramillo-Gutierrez, Giovanna<\/dc:creator><dc:creator>\n        Koukounari, Artemis<\/dc:creator><dc:creator>\n        Donnelly, Christl A.<\/dc:creator><dc:creator>\n        Carlino, Luis O.<\/dc:creator><dc:creator>\n        Owen, Rhonda<\/dc:creator><dc:creator>\n        Paterson, Beverly<\/dc:creator><dc:creator>\n        Pelletier, Louise<\/dc:creator><dc:creator>\n        Vachon, Julie<\/dc:creator><dc:creator>\n        Gonzalez, Claudia<\/dc:creator><dc:creator>\n        Hongjie, Yu<\/dc:creator><dc:creator>\n        Zijian, Feng<\/dc:creator><dc:creator>\n        Chuang, Shuk Kwan<\/dc:creator><dc:creator>\n        Au, Albert<\/dc:creator><dc:creator>\n        Buda, Silke<\/dc:creator><dc:creator>\n        Krause, Gerard<\/dc:creator><dc:creator>\n        Haas, Walter<\/dc:creator><dc:creator>\n        Bonmarin, Isabelle<\/dc:creator><dc:creator>\n        Taniguichi, Kiyosu<\/dc:creator><dc:creator>\n        Nakajima, Kensuke<\/dc:creator><dc:creator>\n        Shobayashi, Tokuaki<\/dc:creator><dc:creator>\n        Takayama, Yoshihiro<\/dc:creator><dc:creator>\n        Sunagawa, Tomi<\/dc:creator><dc:creator>\n        Heraud, Jean Michel<\/dc:creator><dc:creator>\n        Orelle, Arnaud<\/dc:creator><dc:creator>\n        Palacios, Ethel<\/dc:creator><dc:creator>\n        van der Sande, Marianne A. B.<\/dc:creator><dc:creator>\n        Wielders, C. C. H. Lieke<\/dc:creator><dc:creator>\n        Hunt, Darren<\/dc:creator><dc:creator>\n        Cutter, Jeffrey<\/dc:creator><dc:creator>\n        Lee, Vernon J.<\/dc:creator><dc:creator>\n        Thomas, Juno<\/dc:creator><dc:creator>\n        Santa-Olalla, Patricia<\/dc:creator><dc:creator>\n        Sierra-Moros, Maria J.<\/dc:creator><dc:creator>\n        Hanshaoworakul, Wanna<\/dc:creator><dc:creator>\n        Ungchusak, Kumnuan<\/dc:creator><dc:creator>\n        Pebody, Richard<\/dc:creator><dc:creator>\n        Jain, Seema<\/dc:creator><dc:creator>\n        Mounts, Anthony W.<\/dc:creator><dc:subject>\n        RA Public aspects of medicine<\/dc:subject><dc:description>\n        Background\\ud\n\\ud\nSince the start of the 2009 influenza A pandemic (H1N1pdm), the World Health Organization and its member states have gathered information to characterize the clinical severity of H1N1pdm infection and to assist policy makers to determine risk groups for targeted control measures.\\ud\n\\ud\nMethods and Findings\\ud\n\\ud\nData were collected on approximately 70,000 laboratory-confirmed hospitalized H1N1pdm patients, 9,700 patients admitted to intensive care units (ICUs), and 2,500 deaths reported between 1 April 2009 and 1 January 2010 from 19 countries or administrative regions—Argentina, Australia, Canada, Chile, China, France, Germany, Hong Kong SAR, Japan, Madagascar, Mexico, the Netherlands, New Zealand, Singapore, South Africa, Spain, Thailand, the United States, and the United Kingdom—to characterize and compare the distribution of risk factors among H1N1pdm patients at three levels of severity: hospitalizations, ICU admissions, and deaths. The median age of patients increased with severity of disease. The highest per capita risk of hospitalization was among patients <5 y and 5–14 y (relative risk [RR] = 3.3 and 3.2, respectively, compared to the general population), whereas the highest risk of death per capita was in the age groups 50–64 y and ≥65 y (RR = 1.5 and 1.6, respectively, compared to the general population). Similarly, the ratio of H1N1pdm deaths to hospitalizations increased with age and was the highest in the ≥65-y-old age group, indicating that while infection rates have been observed to be very low in the oldest age group, risk of death in those over the age of 64 y who became infected was higher than in younger groups. The proportion of H1N1pdm patients with one or more reported chronic conditions increased with severity (median = 31.1%, 52.3%, and 61.8% of hospitalized, ICU-admitted, and fatal H1N1pdm cases, respectively). With the exception of the risk factors asthma, pregnancy, and obesity, the proportion of patients with each risk factor increased with severity level. For all levels of severity, pregnant women in their third trimester consistently accounted for the majority of the total of pregnant women. Our findings suggest that morbid obesity might be a risk factor for ICU admission and fatal outcome (RR = 36.3).\\ud\n\\ud\nConclusions\\ud\n\\ud\nOur results demonstrate that risk factors for severe H1N1pdm infection are similar to those for seasonal influenza, with some notable differences, such as younger age groups and obesity, and reinforce the need to identify and protect groups at highest risk of severe outcomes.<\/dc:description><dc:publisher>\n        Public Library of Science<\/dc:publisher><dc:date>\n        2011<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/37706\/1\/Risk_factors_for_severe_outcomes_following_2009_influenza_A_%28H1N1%29_infection_a_global_pooled_analysis%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Peiris, J. S. Malik and Van Kerkhove, Maria D. and Vandemaele, Katelijn A. H. and Shinde, Vivek and Jaramillo-Gutierrez, Giovanna and Koukounari, Artemis and Donnelly, Christl A. and Carlino, Luis O. and Owen, Rhonda and Paterson, Beverly and Pelletier, Louise and Vachon, Julie and Gonzalez, Claudia and Hongjie, Yu and Zijian, Feng and Chuang, Shuk Kwan and Au, Albert and Buda, Silke and Krause, Gerard and Haas, Walter and Bonmarin, Isabelle and Taniguichi, Kiyosu and Nakajima, Kensuke and Shobayashi, Tokuaki and Takayama, Yoshihiro and Sunagawa, Tomi and Heraud, Jean Michel and Orelle, Arnaud and Palacios, Ethel and van der Sande, Marianne A. B. and Wielders, C. C. H. Lieke and Hunt, Darren and Cutter, Jeffrey and Lee, Vernon J. and Thomas, Juno and Santa-Olalla, Patricia and Sierra-Moros, Maria J. and Hanshaoworakul, Wanna and Ungchusak, Kumnuan and Pebody, Richard and Jain, Seema and Mounts, Anthony W.  (2011) Risk factors for severe outcomes following 2009 influenza A (H1N1) infection: a global pooled analysis.  PLoS Medicine, 8 (7).   ISSN 1549-1277     <\/dc:identifier><dc:relation>\n        http:\/\/www.plosmedicine.org\/home.action;jsessionid=C2026E0B1AF98AF8B19EBAFD85E9E679.ambra01<\/dc:relation><dc:relation>\n        10.1371\/journal.pmed.1001053<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/37706\/","http:\/\/www.plosmedicine.org\/home.action;jsessionid=C2026E0B1AF98AF8B19EBAFD85E9E679.ambra01","10.1371\/journal.pmed.1001053"],"year":2011,"topics":["RA Public aspects of medicine"],"subject":["Article","PeerReviewed"],"fullText":"  \n \n \n \n \n \n \n \n \n \n \n \n \n \nJ. S. Malik Peiris, Maria D. Van Kerkhove, Katelijn A. H. \nVandemaele, Vivek Shinde, Giovanna Jaramillo-Gutierrez, \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nArtemis Koukounari, Christl A. Donnelly, Luis O. Carlino, \nRhonda Owen, Beverly Paterson, Louise Pelletier, Julie \nVachon, Claudia Gonzalez, Yu Hongjie, Feng Zijian, Shuk \nKwan Chuang, Albert Au, Silke Buda, Gerard Krause, \nWalter Haas, Isabelle Bonmarin, Kiyosu Taniguichi, \nKensuke Nakajima, Tokauki Shobayashi, Yoshihiro \nTakayama, Tomi Sunagawa, Jean Michael Heraud, Arnaud \nOrelle, Ethel Palacios, Marianne A. B. van der Sande, C. C. \nH. Lieke Wielders, C. C. H. Darren Hunt, Jeffrey Cutter, \nVernon J. Lee, Juno Thomas, Patricia Santa-Olalla, maria \nJ. Sierra-Moros, Wanna Hanshaoworakul, Kumnuan \nUngchusak, Richard Pebody, Seema Jain, Seema and \nAnthony W. Mounts \n \nRisk factors for severe outcomes following \n2009 influenza A (H1N1) infection: a global \npooled analysis \n \nArticle (Accepted version) \n(Refereed) \n \n \n \n  \nOriginal citation: \nPeiris, J. S. Malik and Van Kerkhove, Maria D. and Vandemaele, Katelijn A. H. and Shinde, \nVivek and Jaramillo-Gutierrez, Giovanna and Koukounari, Artemis and Donnelly, Christl A. and \nCarlino, Luis O. and Owen, Rhonda and Paterson, Beverly and Pelletier, Louise and Vachon, \nJulie and Gonzalez, Claudia and Hongjie, Yu and Zijian, Feng and Chuang, Shuk Kwan and Au, \nAlbert and Buda, Silke and Krause, Gerard and Haas, Walter and Bonmarin, Isabelle and \nTaniguichi, Kiyosu and Nakajima, Kensuke and Shobayashi, Tokuaki and Takayama, Yoshihiro \nand Sunagawa, Tomi and Heraud, Jean Michel and Orelle, Arnaud and Palacios, Ethel and van \nder Sande, Marianne A. B. and Wielders, C. C. H. Lieke and Hunt, Darren and Cutter, Jeffrey \nand Lee, Vernon J. and Thomas, Juno and Santa-Olalla, Patricia and Sierra-Moros, Maria J. and \nHanshaoworakul, Wanna and Ungchusak, Kumnuan and Pebody, Richard and Jain, Seema and \nMounts, Anthony W. (2011) Risk factors for severe outcomes following 2009 influenza A (H1N1) \ninfection: a global pooled analysis. PLoS medicine, 8 (7). ISSN 1549-1277  \nDOI: 10.1371\/journal.pmed.1001053 \n \nThis is an open-access article, free of all copyright, and may be freely reproduced, distributed, \ntransmitted, modified, built upon, or otherwise used by anyone for any lawful purpose. The work \nis made available under the Creative Commons CC0 public domain dedication. Public Library of \nScience \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/37706\/ \nAvailable in LSE Research Online: August 2011 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n \nRisk Factors for Severe Outcomes following 2009\nInfluenza A (H1N1) Infection: A Global Pooled Analysis\nMaria D. Van Kerkhove1,2, Katelijn A. H. Vandemaele1, Vivek Shinde1, Giovanna Jaramillo-Gutierrez1,\nArtemis Koukounari2, Christl A. Donnelly2, Luis O. Carlino3, Rhonda Owen4, Beverly Paterson4, Louise\nPelletier5, Julie Vachon5, Claudia Gonzalez6, Yu Hongjie7, Feng Zijian7, Shuk Kwan Chuang8, Albert Au8,\nSilke Buda9, Gerard Krause9, Walter Haas9, Isabelle Bonmarin10, Kiyosu Taniguichi11, Kensuke\nNakajima12, Tokuaki Shobayashi12, Yoshihiro Takayama12, Tomi Sunagawa11, Jean Michel Heraud13,\nArnaud Orelle13, Ethel Palacios14, Marianne A. B. van der Sande15, C. C. H. Lieke Wielders15, Darren\nHunt16, Jeffrey Cutter17, Vernon J. Lee18,19, Juno Thomas20, Patricia Santa-Olalla21, Maria J. Sierra-\nMoros21, Wanna Hanshaoworakul22, Kumnuan Ungchusak22, Richard Pebody23, Seema Jain24,\nAnthony W. Mounts1*, on behalf of the WHO Working Group for Risk Factors for Severe H1N1pdm\nInfection\n1Global Influenza Programme, World Health Organization, 2Medical Research Council Centre for Outbreak Analysis and Modelling, Department of Infectious Disease\nEpidemiology, Imperial College London, London, United Kingdom, 3Ministerio de Salud de la Nacio´n, Buenos Aires, Argentina, 4 Influenza Surveillance Section,\nSurveillance Branch, Office of Health Protection, Department of Health and Ageing, Woden, Australia, 5 Influenza Surveillance Section, Public Health Agency of Canada,\nOntario, Canada, 6Departamento de Epidemiologı´a, Divisio´n de Planificacio´n Sanitaria, Ministerio de Salud de Chile, Santiago, Chile, 7Office for Disease Control and\nEmergency Response, Chinese Center for Disease Control and Prevention Beijing, China, 8 Surveillance and Epidemiology Branch, Centre for Health Protection, Centre for\nHealth Protection of Department of Health, Hong Kong, 9Department for Infectious Disease Epidemiology, Robert Koch Institute, Berlin, Germany, 10De´partement des\nMaladies Infectieuses, Institut de Veille, Sanitaire, Saint-Maurice Cedex, France, 11 Infectious Disease Surveillance Center, National Institute of Infectious Diseases, Tokyo,\nJapan, 12Ministry of Health, Labour and Welfare, Tokyo, Japan, 13 Virology Unit, Institut Pasteur from Madagascar, Antananarivo, Madagascar, 14Directorate General of\nEpidemiology, Mexico City, Mexico, 15 Epidemiology and Surveillance Unit, Centre for Infectious Disease Control, National Institute for Public Health and the Environment,\nBilthoven, the Netherlands, 16New Zealand Ministry of Health, Wellington, New Zealand, 17Communicable Diseases Division at the Ministry of Health, Singapore,\n18 Biodefence Centre, Ministry of Defence, Singapore, 19Department of Epidemiology and Public Health, Yong Loo Lin School of Medicine, National University of\nSingapore, Singapore, 20 Epidemiology and Surveillance Unit, Respiratory Virus Unit, National Institute for Communicable Diseases, National Health Laboratory Service,\nJohannesburg, South Africa, 21Coordinating Centre for Health Alerts and Emergencies, Direccio´n General de Salud Pu´blica y Sanidad Exterior Ministerio de Sanidad y\nPolı´tica Social, Madrid, Spain, 22Department of Disease Control, Ministry of Public Health, Nonthaburi, Thailand, 23Health Protection Agency, London, United Kingdom,\n24 Epidemiology and Prevention Branch, Influenza Division, Centers for Disease Control and Prevention, Atlanta, Georgia, United States of America\nAbstract\nBackground: Since the start of the 2009 influenza A pandemic (H1N1pdm), the World Health Organization and its member\nstates have gathered information to characterize the clinical severity of H1N1pdm infection and to assist policy makers to\ndetermine risk groups for targeted control measures.\nMethods and Findings: Data were collected on approximately 70,000 laboratory-confirmed hospitalized H1N1pdm\npatients, 9,700 patients admitted to intensive care units (ICUs), and 2,500 deaths reported between 1 April 2009 and 1\nJanuary 2010 from 19 countries or administrative regions—Argentina, Australia, Canada, Chile, China, France, Germany,\nHong Kong SAR, Japan, Madagascar, Mexico, the Netherlands, New Zealand, Singapore, South Africa, Spain, Thailand, the\nUnited States, and the United Kingdom—to characterize and compare the distribution of risk factors among H1N1pdm\npatients at three levels of severity: hospitalizations, ICU admissions, and deaths. The median age of patients increased with\nseverity of disease. The highest per capita risk of hospitalization was among patients,5 y and 5–14 y (relative risk [RR] = 3.3\nand 3.2, respectively, compared to the general population), whereas the highest risk of death per capita was in the age\ngroups 50–64 y and $65 y (RR = 1.5 and 1.6, respectively, compared to the general population). Similarly, the ratio of\nH1N1pdm deaths to hospitalizations increased with age and was the highest in the $65-y-old age group, indicating that\nwhile infection rates have been observed to be very low in the oldest age group, risk of death in those over the age of 64 y\nwho became infected was higher than in younger groups. The proportion of H1N1pdm patients with one or more reported\nchronic conditions increased with severity (median = 31.1%, 52.3%, and 61.8% of hospitalized, ICU-admitted, and fatal\nH1N1pdm cases, respectively). With the exception of the risk factors asthma, pregnancy, and obesity, the proportion of\npatients with each risk factor increased with severity level. For all levels of severity, pregnant women in their third trimester\nconsistently accounted for the majority of the total of pregnant women. Our findings suggest that morbid obesity might be\na risk factor for ICU admission and fatal outcome (RR = 36.3).\nConclusions: Our results demonstrate that risk factors for severe H1N1pdm infection are similar to those for seasonal\ninfluenza, with some notable differences, such as younger age groups and obesity, and reinforce the need to identify and\nprotect groups at highest risk of severe outcomes.\nPlease see later in the article for the Editors’ Summary.\nPLoS Medicine | www.plosmedicine.org 1 July 2011 | Volume 8 | Issue 7 | e1001053\nCitation: Van Kerkhove MD, Vandemaele KAH, Shinde V, Jaramillo-Gutierrez G, Koukounari A, et al. (2011) Risk Factors for Severe Outcomes following 2009\nInfluenza A (H1N1) Infection: A Global Pooled Analysis. PLoS Med 8(7): e1001053. doi:10.1371\/journal.pmed.1001053\nAcademic Editor: J. S. Malik Peiris, The University of Hong Kong, Hong Kong\nReceived October 27, 2010; Accepted May 18, 2011; Published July 5, 2011\nThis is an open-access article, free of all copyright, and may be freely reproduced, distributed, transmitted, modified, built upon, or otherwise used by anyone for\nany lawful purpose. The work is made available under the Creative Commons CC0 public domain dedication.\nFunding: MDVK, CAD, and AK acknowledge funding from the Medical Research Council UK and the Bill and Melinda Gates Foundation (MDVK) for funding. No\nfunding bodies had any role in study design, data collection and analysis, decision to publish, or preparation of the manuscript.\nCompeting Interests: CG worked for the Ministry of Health of Chile from 1997 to August 2010, in the Department of Epidemiology. CG has been involved in the\nprocess of preparing and developing the National Pandemic Plan since 2002. During the pandemic CG was in charge of the coordination of the Executive\nCommittee for outbreaks and health emergencies in Chile. This committee was responsible for making decisions and implementing measures for prevention and\ncontrol. Also, until August 2010, CG participated in the implementation of IHR 2005 in Chile. During the pandemic, the Pan American Health Organization (PAHO)\nprovided funds to the Ministry of Health and the Institute of Public Health for studies and improvement of epidemiological surveillance. CG was not responsible\nfor managing these resources. PAHO also delivered primers and other supplies for the laboratory diagnosis of influenza (RT-PCR). They provided computers for\ninfluenza sentinel centers for improving the opportunity of reporting, which also included the development of a web application for online notification. CG was a\nmember of the Review Committee on the Functioning of the International Health Regulations (2005) and on Pandemic Influenza A (H1N1), 2009, between April\n2010 and April 2011. The result of the work of this committee was submitted to the World Health Assembly in May 2011. In December 2010 (29 November to 15\nDecember) CG was part of a mission to assess the health sector response to pandemic influenza A (H1N1) in Mexico. This mission was requested by the Ministry of\nHealth of Mexico to PAHO. Other mission members were Dr. Jarbas Barbosa (Brazil), Dr. Hande Harmanci (WHO), Dr. Juan Pablo Sarmiento (Colombia), Dr. Ronald\nSt. John (Canada). For this work CG received airfare and per diem supplemented by the standards of PAHO. CG has been invited to present the Chilean experience\nduring the influenza pandemic 2009 in various national and international conferences. CG currently works at the Universidad del Desarrollo (Santiago, Chile) as a\nteacher and researcher; also at EPI-Sur Consultants, an institution dedicated to providing advisory services and consulting in the field of international health for\nagencies, governments, and NGOs. EPI-Sur Consultants have worked for PAHO in the field of infectious diseases (not on influenza). VJL has received unrelated\nresearch funding from GlaxoSmithKline. JT received a travel grant from the Centers for Disease Control and Prevention (via an Influenza Cooperative Agreement\nGrant) to attend the ‘‘Options for the Control of Influenza VII’’ conference in Hong Kong, 3–7 September 2010, to present a poster entitled ‘‘Fatal pandemic\ninfluenza A(H1N1)2009 infections in HIV-infected persons, South Africa.’’ All other authors have declared that no competing interests exist.\nAbbreviations: BMI, body mass index; CI, confidence interval; ICU, intensive care unit; IQR, interquartile range; OR, odds ratio; RR, relative risk; TB, tuberculosis;\nWHO, World Health Organization\n* E-mail: mountsa@who.int\nRisk Factors for H1N1pdm Severity\nPLoS Medicine | www.plosmedicine.org 2 July 2011 | Volume 8 | Issue 7 | e1001053\nIntroduction\nIn late April 2009, a novel strain of influenza A H1N1 was\nidentified in Mexico and the United States. This virus quickly\nspread globally, and on June 11, 2009, the World Health\nOrganization (WHO) declared a pandemic alert phase 6,\nindicating that the first influenza pandemic of the 21st century\nhad begun [1–3]. Many Northern hemisphere temperate countries\nexperienced their first wave of infection during the spring and\nsummer months of 2009, followed by an early 2009 fall influenza\nseason. Southern hemisphere temperate countries experienced the\nfirst wave of infection during their winter of 2009, and at the time\nof writing are finishing their winter 2010 season. By the end of\n2009, the peak of the local influenza epidemic had passed in most\ncountries around the world [4].\nSince the start of the pandemic, WHO and member states have\nbeen gathering information to characterize the clinical picture and\npatterns of risk associated with the 2009 pandemic influenza A\nH1N1 (H1N1pdm) virus infection to assist public health policy\nmakers in targeting of vaccination strategies, antiviral use, and\nother control measures. Risk factors for severe disease following\nseasonal influenza infection have been well documented in many\ncountries, and include chronic medical conditions such as\npulmonary, cardiovascular, renal, hepatic, neuromuscular, hema-\ntologic, and metabolic disorders, some cognitive conditions, and\nimmunodeficiency [5–7]. The risk associated with seasonal\ninfluenza during pregnancy is less well documented but in\nprevious pandemics, pregnant women were identified as being at\nincreased risk of adverse outcomes, and many countries include\nhealthy pregnant women among the seasonal influenza high risk\ngroups as well [8–11]. However, early in the 2009 H1N1\npandemic, risk factors for severe disease following infection were\nlargely unknown. Following a series of teleconferences organized\nby WHO with clinicians treating H1N1pdm patients around the\nworld, it appeared that the most common risk factors for severe\nH1N1pdm disease were similar to those for seasonal influenza\ninfection; however, several new factors (e.g., obesity and\ntuberculosis [TB]) were also observed with high frequency in\nsome countries. It was also noted that members of indigenous\/\naboriginal communities in some countries appeared to be\noverrepresented among severe cases [12].\nWhile many countries have recently reported data on the\nassociation between severe H1N1pdm influenza and the presence\nof a variety of underlying risk factors (e.g., [13–26]), these data are\npresented in different formats, making direct comparisons across\ncountries difficult, and no clear consensus has emerged for some\nconditions. This paper presents data from approximately 70,000\nlab-confirmed hospitalized and 2,500 fatal cases of H1N1pdm\ninfection in 19 countries or administrative regions—Argentina,\nAustralia, Canada, Chile, China, France, Germany, Hong Kong\nSAR, Japan, Madagascar, Mexico, the Netherlands, New\nZealand, Singapore, South Africa, Spain, Thailand, the United\nStates, and the United Kingdom—in order to characterize and\ncompare the distribution of underlying risk factors among\nH1N1pdm confirmed patients who were hospitalized, admitted\nto an intensive care unit (ICU), or died, and to assess the frequency\nand distribution of known and new potential risk factors for severe\nH1N1pdm infection.\nMethods\nThis study compares data primarily obtained from surveillance\nprograms of the Ministries of Health or National Public Health\nInstitutes of 19 countries or administrative regions covering the\nperiod 1 April 2009 to 1 January 2010. Countries were asked to\nprovide risk factor data on laboratory-confirmed cases using a\nstandardized format for this analysis. The data were collected in\nthe course of routine surveillance, methods of which varied from\ncountry to country [27–49], and were reported anonymously and\nas aggregate data; hence, no ethics approval was required. It\nshould be noted that considerable effort was put into negotiating\npermission for these data to be presented in these formats. As\nmany countries would not be willing to have their country-specific\ndata published in direct comparisons with others, we are taking the\napproach of publishing data from a wide range of countries and\nshowing the variability observed, so that results from specific\nstudies can be compared with the international results reported\nhere.\nPotential risk factors were grouped into four categories: age,\nchronic medical illnesses, pregnancy (by trimester), and ‘‘other,’’\nwhich included conditions that were not previously considered as\nrisk factors for severe influenza outcomes, such as obesity,\nmembership in a vulnerable social or ethnic group, and TB.\nDetails of the standardized format and definitions of each of the\nconditions are provided in Text S1.\nRisk factor information was collected separately for three levels\nof severity of illness in laboratory-confirmed patients: hospitaliza-\ntions, admissions to ICU, and fatalities by country. Details of the\navailable data from countries by risk factor and severity level are\nprovided in Text S1. For each risk factor, except for pregnancy,\nthe percentage of patients who were hospitalized, were admitted to\nICU, and died was calculated using the total number of cases\nreported in each severity category. To evaluate the risk associated\nwith pregnancy, the ratio of pregnant women to all women of\nchildbearing age (age 15–49 y) in each level of severity was used to\ndescribe the differences between levels. The overall median and\ninterquartile ranges (IQRs) were calculated for each risk factor\nusing all available data. In addition, where available, countries\nprovided baseline comparison data for prevalence of the risk factor\nin the general population (details and sources provided in Text\nS1). Data on age were provided by age groups (,5, 5–14, 15–24,\n25–49, 50–64, and $65 y).\nRisk of Severe Disease\nWhere data were available, we calculated the risk for severe\nH1N1pdm outcomes (hospitalization, admission to ICU, and\ndeath) compared to the prevalence of risk factors in the general\npopulation (relative risk [RR] of hospitalization [RRhosp], RR of\nICU admission [RRICU], and RR of death [RRdeath]) by country.\nSee Text S1 for more information and formulae.\nFor pregnancy, we first calculated the proportion of women of\nchildbearing age who were pregnant in each severity category by\ndividing the number of pregnant women in that category by the\nnumber of women of childbearing age in that category. As\nindividual case data were not available, we calculated the number\nof fertile women in each level of severity using the numbers of\npatients in each level of severity in the age range between 15 and\n49 y multiplied by the percentage for that severity level that was\nfemale. Unless provided by the country, the point prevalence of\npregnant women in the general population (the denominator of\nthe RR calculation) was calculated using crude birth rate and 2010\nUnited Nations population estimates [50] to derive the annual\nnumber of pregnancies, multiplied by 40\/52 and without adjusting\nfor seasonality of pregnancies, abortions, miscarriages, early\ndeliveries, or multiple births. We also calculated the country-\nspecific odds ratios (ORs) and 95% confidence intervals (CIs) for\ndeath given hospitalization separately for each risk factor (i.e., the\nodds of death given hospitalization and a specific risk factor),\nthereby comparing the odds of death in one group (e.g., among\nRisk Factors for H1N1pdm Severity\nPLoS Medicine | www.plosmedicine.org 3 July 2011 | Volume 8 | Issue 7 | e1001053\nhospitalized patients with asthma) with the odds of death in all\nother hospitalized patients combined (e.g., among hospitalized\npatients without asthma) (individual country ORs not shown). We\nthen used the I2 statistic to quantify the percentage of variation\nacross countries that is due to true underlying heterogeneity in the\nORs rather than chance variability [51]. The I2 statistics for all\nexamined risk factors indicated that there was substantial true\nunderlying variation between ORs from different countries. We\nundertook meta-analyses with and without random effects in\nparallel to describe the distribution of the OR estimates across the\ncountries for which data were available for analysis. As expected,\ngiven the heterogeneity observed between countries, the random\neffects meta-analysis yielded wider CIs. We conservatively report\nthe pooled estimates from the random effects meta-analysis to\ndescribe the distribution of the OR estimates across the countries\nfor which data were available for analysis. Underlying the random\neffects approach is the assumption that, although the individual\ncountries give rise to different OR estimates, these estimates arise\nfrom a distribution with a central value, the estimate of which is\nreferred to as the ‘‘pooled OR,’’ and normally distributed\nvariability around this value. However, because of the limited\nnumber of countries in each analysis, the number of random\neffects is too small for diagnostics such as quantile–quantile plots to\ndemonstrate whether the assumption of a normal distribution is\nvalid.\nFinally, with a meta-analysis of data from such diverse countries\nas those included in this study, reasons for heterogeneity were\nsought through exploratory meta-regression analyses. However,\nbecause of the limited number of countries included in the meta-\nregression models, and with country being the unit of analysis, the\nmeta-regression results were not considered to be robust and so are\nnot presented or discussed further [52].\nAll meta-analyses and meta-regression techniques were per-\nformed using Stata version 10 (StataCorp).\nResults\nData were collected on approximately 70,000 patients requiring\nhospitalization, 9,700 patients admitted to ICU, and 2,500\nfatalities from 19 countries and administrative regions across the\nAmericas, Asia, Europe, and Africa.\nAge and Gender\nApproximately half of all patients included in this analysis in\neach level of severity were female (49.8%, 47.0%, and 44.7% of all\nhospitalized, ICU-admitted, and fatal H1N1pdm cases, respec-\ntively). This proportion did not vary significantly by country\n(Table 1). Age was associated with increased risk of poor outcome,\nas indicated by several different parameters. The median age of\npatients increased with increasing levels of severity (Table 1).\nAmong hospitalized patients, the median age within each country\nranged from 7 y in Japan to 38 y in Spain, with a median reported\nvalue among all countries that provided data (n = 14) of 19 y (IQR\n14.8–27.5); among patients admitted to ICU, the median age\nwithin each country ranged from 28 y in China to 49.5 y in Hong\nKong SAR, with a median value among all countries that\nprovided data (n = 9) of 42 y (IQR 35.0–45.0); and among fatal\ncases, median age within each country ranged from 30 y in China\nto 56 y in Hong Kong SAR, with a median value among all\ncountries that provided data (n = 13) of 46 y (IQR 37.0–42.0).\nWhen the age distribution of the proportion of patients in each\nlevel of severity was compared to the distribution in the general\npopulation, the RR was highest in the age groups ,5 y and\n5–14 y (RRhosp = 3.3 and 3.2, respectively) but the RR of death\nwas highest in the age groups 50–64 y and $65 y (RRdeath = 1.6\nand 1.7, respectively) (Figure 1). The ratio of H1N1pdm deaths to\nhospitalizations increased with age and was the highest in the\n$65-y-old age group in all countries for which data were available\n(Figure 2).\nChronic Illness\nThe proportion of H1N1pdm patients with at least one chronic\nmedical condition generally increased with severity (median\namong all countries that provided data was 31.1% [n = 14],\n52.3% [n = 10], and 61.8% [n = 16] of hospitalized, ICU-admitted,\nand fatal H1N1pdm cases, respectively (Table 1). This pattern was\nobserved for most countries (individual country data not shown).\nFor nearly every individual risk factor under study, the prevalence\nincreased significantly with severity level. Chronic respiratory\nconditions excluding asthma (median = 10.3%, 17.2%, and\n20.4%, respectively) and asthma (median = 17.6%, 9.8%, and\n5.3%, respectively) were the risk factors most often reported\namong severe cases, followed closely by diabetes (median = 9.0%,\n13.6%, and 14.4%, respectively) and chronic cardiac conditions\n(median = 7.1%, 10.9%, and 12.1%, respectively). The pooled OR\nfor death given hospitalization was significantly above one for each\nrisk factor listed, with the exception of asthma, and was highest for\nchronic liver disease and immunocompromised patients (Figure 3).\nThe risk of severe disease due to H1N1 infection, including\nhospitalization and death, was elevated for every chronic condition\nfor which data were available (Table 1). Notably, the RR for fatal\ndisease due to H1N1pdm infection was elevated for asthma\n(median RRdeath = 1.7 [IQR 1.5–2.1]) and not markedly different\nfrom the RR associated with hospitalizations (median RRhosp = 1.8\n[IQR 1.2–2.6]). Data on chronic illness rates in the general\npopulation were not available from enough countries to permit an\nassessment of the relative magnitude of risk associated with various\nconditions with certainty.\nPregnancy\nThe proportions of women of childbearing age who were\nhospitalized with H1N1 and were pregnant as part of all\nhospitalizations (median of all country data = 17.4% [IQR 13.5–\n30.2]), who were admitted to ICU (median of all country\ndata = 15.0% [IQR 9.4–24.2]), and who died (median of all\ncountry data = 6.9% [0.0–9.1]) varied within each country.\nPregnant women in their third trimester consistently accounted\nfor more than half of all pregnant women among hospitalized,\nICU-admitted, and fatal cases. However, with the exception of\nChina, Thailand, and the US, the proportion of pregnant women\ndecreased with increasing level of severity, and the pooled OR for\ndeath given hospitalization during pregnancy was below 1 (pooled\nOR = 0.6, 95% CI 0.2–2.5).\nPregnant women with H1N1pdm infection were at higher risk\nof hospitalization than women of childbearing age in the general\npopulation without H1N1pdm infection, with an unadjusted RR\nof hospitalization ranging from 3.5 in Germany to 25.3 in France\n(median RRhosp = 6.8, n = 10 countries). The unadjusted RR of\ndeath, while elevated compared to non-pregnant women in more\nthan half of countries, was generally lower than that for\nhospitalization, with a median RRdeath of 1.9 (n = 11 countries).\nFour areas (Japan, the Netherlands, Hong Kong SAR, and\nSingapore) had a RRdeath of zero.\nOther Risk Factors\nThe proportion of patients with obesity (body mass index [BMI]\n$30 or clinically judged as obese) increased with increasing\ndisease severity and represented a median of 6%, 11.3%, and\nRisk Factors for H1N1pdm Severity\nPLoS Medicine | www.plosmedicine.org 4 July 2011 | Volume 8 | Issue 7 | e1001053\n12.0% of all hospitalized, ICU-admitted, and fatal H1N1pdm\ncases, respectively, and this pattern was also observed for morbid\nobesity (BMI .40), with 3.0%, 5.0%, and 15.2%, respectively\n(Table 1). However, this pattern was not consistently reported in\neach country. For example, France, Thailand, and China\nobserved similar proportions of obese patients among ICU-\nadmitted and fatal cases, while Hong Kong SAR reported a lower\nprevalence of obesity among fatal cases than among ICU\nadmissions. Using data from all countries, the pooled OR for\ndeath given hospitalization for obesity (BMI $30 or clinically\njudged as obese) was 2.9 (95% CI 1.3–6.6; Figure 3). Compared to\nthe general population in the two countries for which data were\navailable, the risk of death associated with morbid obesity was\nincreased (mean RRdeath = 36.3 [IQR 22.4–50.1], n = 2).\nCanada, Australia, and New Zealand reported significant\ndisparities in the burden of severe H1N1pdm disease across\ndifferent ethnic groups. In these three countries, indigenous\npopulation groups were overrepresented among severe H1N1pdm\ncases requiring hospitalization and among fatal cases. In contrast,\nin Thailand and Mexico, minority groups were underrepresented\namong severe H1N1pdm cases. Taken together, the unadjusted\nmedian RR of hospitalization for H1N1pdm patients among\nminority groups was 1.0 (IQR 0.2–3.7) and the median RR of\ndeath was 2.4 (IQR 1.2–3.8). TB data were reported from three\ncountries, and the incidence increased slightly with level of\nseverity. The disease was reported in a median of 1.7%, 1.3%, and\n2.6% of hospitalized, ICU-admitted, and fatal H1N1pdm cases,\nrespectively. We were not specifically able to evaluate HIV\nTable 1. Risk factors by severity level for select countries and risk of severe disease.\nRisk Factora Severity Level\nb RR of Severe Disease (IQR)c\nnd\nHospitalized\nCases nd\nICU-Admitted\nCases nd Fatal Cases nd RRhosp n\nd RRdeath\nAge 14 19.0 (14.8–27.5) 9 42.0 (35.0–45.0) 13 46.0 (37.0–52.0) —e —e\nGender (percent female) 12 49.8 (46.2–51.5) 11 47.0 (41.9–50.5) 14 44.7 (41.5–48.7) 12 1.0 (0.8–1.1) 14 0.8 (0.7–1.0)\nChronic medical illness\nRespiratory disease 12 10.3 (5.0–21.7) 11 17.2 (10.5–29.9) 16 20.4 (9.3–29.5) 5 3.3 (2.0–5.8) 8 7.8 (4.9–26.6)\nAsthma 11 17.6 (10.0–20.4) 9 9.8 (5.6–14.3) 15 5.3 (4.0–10.6) 3 1.8 (1.2–2.6) 6 1.7 (1.5–2.1)\nDiabetes 14 9.0 (3.5–12.6) 12 13.6 (9.3–17.3) 17 14.4 (13.0–18.0) 7 0.9 (0.5–1.7) 10 4.0 (3.1–6.9)\nCardiac disease 12 7.1 (3.7–10.9) 11 10.9 (8.8–15.0) 15 12.1 (10.0–16.4) 6 2.0 (1.5–2.2) 8 9.2 (5.4–10.7)\nRenal disease 13 4.0 (2.0–5.1) 11 6.3 (3.5–8.4) 16 7.1 (5.0–8.1) 2 4.4 (4.2–4.5) 3 22.7 (21.0–25.4)\nLiver disease 9 1.1 (0.3–2.0) 9 2.4 (0.9–5.0) 12 4.9 (2.7–6.0) 3 5.7 (3.2–15.7) 4 17.4 (11.6–28.0)\nNeurological disease 11 4.0 (2.5–7.5) 11 7.0 (3.5–9.5) 14 13.9 (5.5–18.4) 2 1.1 (0.9–1.3) 3 13.1 (8.4–32.4)\nImmune compromised 13 5.0 (2.0–7.2) 11 6.7 (3.2–18.4) 15 12.5 (7.9–18.4) 2 24.3 (16.1–32.6) 4 27.7 (14.0–66.5)\nCases with $1 chronic\nmedical illnesses\n14 31.1 (19.0–47.1) 10 52.3 (41.1–58.7) 16 61.8 (48.5–67.9) NA NA\nPregnancyf\nFirst trimester 7 2.0 (1.0–3.5) 6 2.0 (1.5–2.5) 5 0.9 (0.0–2.5)\nSecond trimester 7 7.0 (3.9–9.3) 7 5.0 (1.7–6.2) 5 2.5 (0.0–14.1)\nThird trimester 7 9.5 (7.6–21.3) 8 8.0 (4.0–14.6) 6 16.9 (5.1–32.0)\nUnknown trimester 8 6.0 (1.9–9.3) 6 2.8 (1.7–3.2) 7 0.0 (0.0–2.1)\nTotal (any trimester) 10 17.4 (13.5–30.2) 9 15.0 (9.4–24.2) 11 6.9 (0.0–9.1) 10 6.8 (4.5–12.3) 11 1.9 (0.0–2.6)\nObesity\nBMI $30 or clinically obese 11 6.0 (1.5–7.5) 8 11.3 (7.9–15.8) 13 12.0 (10.0–21.0) 6 0.6 (0.2–1.8) 7 1.5 (0.9–2.8)\nBMI = 30–40 3 7.0 (4.4–16.0) 3 10.0 (6.9–18.5) 4 15.8 (7.7–25.2) NA NA\nBMI .40 5 3.0 (1.4–11.5) 5 5.0 (3.4–16.4) 6 15.2 (4.0–30.8) 2 15.0 (9.5–20.4) 2 36.3 (22.4–50.1)\nBMI not measured but\njudged clinically obese\n8 4.3 (1.8–13.3) 4 4.4 (3.4–5.3) 8 7.8 (3.8–17.3) NA NA\nVulnerable social\/\nethnic group\n4 5.2 (2.3–10.6) 4 5.0 (1.5–10.7) 4 10.1 (5.3–18.5) 4 1.0 (0.2–3.7) 4 2.4 (1.2–3.8)\nTB 2 1.7 (0.9–1.8) 2 1.3 (1.0–1.6) 4 2.6 (0.8–5.9) NA NA\naSee Text S1 for definitions of risk factors.\nbAll data given as median percent (IQR), except for age, which is median (in years) (IQR).\ncRRhosp is the unadjusted RR of hospitalization among H1N1pdm patients with the risk factor compared to the risk of hospitalization among H1N1pdm patients without\nthe risk factor, and RRdeath is the unadjusted RR of death among H1N1pdm patients with the risk factor compared to the risk of death among H1N1pdm patients\nwithout the risk factor; range of RR provided if $2 countries provided data.\ndThe number of countries providing data for cell directly to the right; the full list of countries that provided data for each risk factor is provided in Text S1.\neRRhosp and RRdeath calculated by age group and shown in Figure 1.\nfDenominator is women of childbearing age in each level of severity.\nNA, not assessed.\ndoi:10.1371\/journal.pmed.1001053.t001\nRisk Factors for H1N1pdm Severity\nPLoS Medicine | www.plosmedicine.org 5 July 2011 | Volume 8 | Issue 7 | e1001053\nFigure 1. Relative risk of hospitalization, ICU admission, and death by age group compared to the general population. Countries\nincluded in hospitalization (A) and mortality (C) RRs: Japan, Hong Kong SAR, China, Singapore, Thailand, Chile, Germany, the Netherlands, Spain, New\nZealand, Canada, US, Madagascar (hospitalizations only), and France (deaths only). Countries included in ICU admission RR (B): Japan, Hong Kong SAR,\nChina, Singapore, Canada, Spain, the Netherlands, US, New Zealand, and South Africa. Dark line represents pooled RR; shaded lines are individual\ncountry RR.\ndoi:10.1371\/journal.pmed.1001053.g001\nRisk Factors for H1N1pdm Severity\nPLoS Medicine | www.plosmedicine.org 6 July 2011 | Volume 8 | Issue 7 | e1001053\nincidence because of a paucity of data on HIV in H1N1pdm\npatients.\nDiscussion\nOur analysis represents to our knowledge the first comprehen-\nsive assessment of the frequency and distribution of risk factors for\nsevere H1N1pdm infection from a global perspective, with data\nfrom approximately 70,000 patients requiring hospitalization,\n9,700 patients admitted to ICU, and 2,500 fatalities from 19\ncountries and administrative regions around the world. Consistent\nwith other published data, our results reaffirm that the age\ndistribution of severe H1N1pdm cases significantly differs from\nthat of seasonal influenza [53–56]. The highest rates of\nhospitalization per capita were in children ,15 y, but the highest\nrates of mortality per capita were in persons over 64 y. The low\napparent attack rate in the oldest age group, evidenced by low\nrates of hospitalization, and the high odds associated with age in\nthe fatal group compared to hospitalized cases seems to indicate\nthat although older adults may have a lower risk of infection, they\nhave a significantly higher risk of death if they are infected [54,57–\n61]. It is likely that increasing prevalence of chronic risk conditions\nin the oldest age group contributes to this effect, but our data do\nnot allow for quantification of this association.\nOur results demonstrate that in a significant portion of severe\nand fatal cases, patients had preexisting chronic illness, and that\nthe presence of chronic illness increased the likelihood of death. It\nwas notable, however, that approximately 2\/3 of hospitalized\ncases and 40% of fatal cases did not have any identified preexisting\nchronic illness. It is unknown how many of these cases had other\nrisk factors, such as pregnancy, obesity, and substance abuse\n(including smoking and alcohol), for which we had insufficient\ninformation in this study. These figures are also dependent on the\ncompleteness of available data for recorded risk factors. As with\nseasonal influenza, the most common underlying chronic\nconditions among hospitalized patients were respiratory disease,\nasthma, cardiac disease, and diabetes. Interestingly, we found that\nalthough asthma was frequently associated with both hospitaliza-\ntion and death in most countries, with an increased RR for both,\nthe OR for death given hospitalization suggested that a higher\nproportion of hospitalized cases survived compared to patients\nwith other conditions. This may represent the occurrence of\nmanageable influenza-induced exacerbations of asthma prompting\nadmission that do not progress to viral pneumonia or other fatal\ncomplications, and may also reflect the fact that asthma tends to\noccur in younger age groups [62].\nEarly data suggested that pregnancy might be an important risk\nfactor for severe disease with H1N1pdm [21,25,63,64]. Our\nanalysis is consistent with these reports and more recent studies\n[47,65], which found an overall trend that pregnant women,\nmainly in their third trimester, have a higher incidence of\nhospitalization than the general population. Several published\nstudies have also shown that pregnancy is associated with a higher\nrisk of ICU admission and fatal outcome [54,58,66,67]. In our\nanalysis, the risk associated with pregnancy was elevated for both\nhospitalization and fatality compared to women of childbearing\nage, though the latter association was not consistently observed in\nevery country. As with asthma, the proportion of pregnant women\nFigure 2. Ratio of confirmed H1N1pdm deaths to hospitalizations for selected countries. Countries included in figure: Spain, Singapore,\nChina, Hong Kong SAR, Canada, the Netherlands, Thailand, Chile, Germany, Japan, US, and New Zealand. Bars represent maximum country ratio.\ndoi:10.1371\/journal.pmed.1001053.g002\nRisk Factors for H1N1pdm Severity\nPLoS Medicine | www.plosmedicine.org 7 July 2011 | Volume 8 | Issue 7 | e1001053\ngenerally decreased with severity level for most of the countries.\nOur results suggest that pregnant women with H1N1pdm are\napproximately seven times more likely to be hospitalized and two\ntimes more likely to die than non-pregnant women with\nH1N1pdm. The greater risk for hospitalization than for death\nwith H1N1pdm influenza infection during pregnancy may have\nresulted from a lower threshold for admitting infected pregnant\nwomen to hospital and\/or a more aggressive approach to antiviral\nor other treatment for pregnant women. In addition, the\noccurrence of non-respiratory complications of pregnancy, such\nas hypertension, pre-eclampsia, and premature labor, provoked by\nH1N1pdm infection may have increased the risk of hospitalization\nwhile not resulting in death [68]. This would be consistent with\npublished reports of case series of pregnant patients that list\ncomplications of pregnancy as a common cause of admission\n[63,69,70]. The dataset did not allow us to adjust for underlying\nconditions in pregnant women, and thus to distinguish between\nrisks for healthy pregnant women, and pregnant women with\nunderlying medical conditions; however, we believe that the results\nsupport an approach of early intervention with pregnant women\nwho develop influenza.\nEarly in the 2009 pandemic, clinicians from the US reported a\nsurprisingly high prevalence of morbid obesity, a risk factor not\npreviously associated with severe outcomes for seasonal influenza\ninfection, in patients with severe complications of H1N1pdm\ninfection [71]. Subsequent studies in several countries, including\nthe US, Mexico, Canada, Spain, Greece, France, Australia, and\nNew Zealand, reported high proportions of obesity among ICU\nadmissions and fatal cases [13,20,58,64,72–77]. Our results\nprovide supportive evidence that obesity may be a risk factor for\nsevere disease, as seen in the increasing proportion of morbidly\nobese patients with severity level and the associated elevated OR.\nOur findings also suggest that morbidly obese patients with\nH1N1pdm are more likely to die if hospitalized; however, the\nresults in our analysis were not consistent across all countries. The\nassociation between obesity (or morbid obesity) and severe\noutcomes may reflect direct causation (e.g., due to greater\nrespiratory strain of infection on obese individuals), causation\nthrough other known risk factors (e.g., obesity causes diabetes and\nheart disease, which pose an increased risk for severe outcome\n[36]), or a noncausal association, if some other factor (e.g., genetic\nor dietary) caused both morbid obesity and increased risk of severe\noutcome. Unfortunately, our dataset did not allow us to distinguish\namong these nonexclusive alternatives.\nIndigenous populations and ethnic minorities have been\nreported to experience a disproportionately high burden of severe\nH1N1pdm infection, particularly in the Americas [14,21,23,36,\n64,75,78–80] and the Australasia-Pacific region [43,80–82],\nsimilar to reports during the 1918 influenza pandemic [83–85].\nOur analysis of Australian, New Zealand, and Canadian data\nconcur with these published reports, and while compelling, were\nnot universal. Neither Thailand nor Mexico observed a signifi-\ncantly increased burden of severe H1N1pdm disease among\nindigenous or minority populations. Our data are not sufficient to\nexplain the observed differences in the reported risk of severe\ndisease among minority groups, but several hypotheses have been\nproposed, including a higher prevalence of chronic medical\nconditions known to increase risk of severe influenza, delayed or\nreduced access to healthcare, cultural differences in healthcare-\nseeking behavior and approaches to health, potential differences in\nFigure 3. Pooled odds ratio and 95% CIs of risk of death given hospitalization for selected countries. See Text S1 for countries included\nin the pooled risk factor ORs.\ndoi:10.1371\/journal.pmed.1001053.g003\nRisk Factors for H1N1pdm Severity\nPLoS Medicine | www.plosmedicine.org 8 July 2011 | Volume 8 | Issue 7 | e1001053\ngenetic susceptibility, and social inequalities [23,78,80]. More\nresearch is needed to better understand and quantify the increased\nrisk of severe H1N1pdm disease among these groups. However, an\nimperfect understanding of the mechanisms of health disparities\nrelated to severe H1N1pdm disease should not impede the public\nhealth community in undertaking actions to mitigate this risk by\ndisseminating appropriate public information, targeting outreach\nand prevention programs, and involving at-risk population groups\nin pandemic planning.\nOur analysis has a number of limitations, not least of which is the\nwide differences in surveillance systems, case management policies,\nand antiviral use in the countries studied. The criteria and\nindications for hospital and ICU admission for certain conditions\n(e.g., pregnancy and asthma) and by age (e.g., pediatric patients)\nvaried significantly by country, and may have been somewhat\ndependent on capacity for admission, which likely varied over time.\nRisk factors are also dependent on the completeness and quality of\ndata on risk factors reported and classification of death in the\nabsence of complete testing. These variables could lead to a bias in\nthe estimate of these conditions among severe cases and could make\ndirect comparisons across countries difficult. Second, our data do\nnot consider multiple risk factors for individual H1N1pdm patients.\nA lack of individual-level data on underlying medical conditions of\nH1N1pdm patients precludes our ability to sufficiently control for\nconfounding and therefore identify the independent contribution of\nindividual risk factors for severe disease and death. The differences\nobserved in risk factors for hospitalization and death among\nH1N1pdm patients compared to among seasonal influenza patients,\nand the wide range of RR values between countries may be\nexplained by differences in age structure in the general population.\nSeveral studies have identified important differences in the\nproportions of underlying conditions by age among hospitalized\nand fatal cases, including, but not limited to, the UK [15,53], the\nUS [36], Canada [47], and Singapore [39,86].\nA third limitation is related to our imperfect calculation of the\npoint prevalence of pregnancy among women of childbearing age in\nthe general population. However, we believe that our findings of the\nrange of RR values for hospitalization and death is valid, but may be\nvery slightly inflated because of undercounting in the denominator.\nThe inflationary effect of undercounting is likely greatest for\npregnant women in the first trimester, as we didn’t adjust for\ncommon first trimester events such as miscarriages or abortions, and\nin this group there is likely substantial undercounting in the\nnumerator as well because of women not knowing they are pregnant\nin that period. Fourth, the data used in our analysis relied on\nhospital records, which were not standardized, and were likely to be\nincomplete or vary in quality between hospitals or countries. This\nposes a problem in the direct comparativeness between settings.\nDespite these limitations, this analysis is the first to our\nknowledge to compare risk factors across a variety of countries\nusing data from a very large number of patients, and we found a\ngreat deal of consistency for much of the data. Clearly, cardiac\ndisease, chronic respiratory disease, and diabetes are important\nrisk factors for severe disease that will be especially relevant for\ncountries with high rates of these illnesses. We provide evidence to\nsupport the concern regarding obesity, particularly morbid\nobesity, as a risk factor, though this needs more study. We found\nlarge between-country variations for some important risk factors,\nmost notably pregnancy, and the reasons for these differences need\nmore study. There is evidence to suggest that the differences\nobserved for pregnancy might represent differences in case\nmanagement practices, and we believe that the available evidence\nsupports vaccination and early intervention for pregnant women.\nOur study reinforces the need to identify and target high-risk\ngroups for interventions, such as immunization, information, early\nmedical advice, and use of antiviral medications. Experience with\nthe 2009 H1N1 pandemic and the differences observed between\ncountries have highlighted the need for country-specific surveil-\nlance data and global standardization of case definitions and data\ncollection, and the usefulness of data sharing to aid policy makers\nin critical decision making for global influenza epidemics.\nSupporting Information\nText S1 Supplemental data and analysis.\n(PDF)\nAcknowledgments\nAll the listed authors are members of the WHO Working Group for Risk\nFactors for Severe H1N1pdm Infection. The authors would like to recognize\nthe hard work of all the individuals—including general practitioners, nurses,\nand other healthcare workers; municipal health centers, hospitals, virology\nlaboratories, and reference labs; and the Ministries of Health—who provided\ncare to H1N1pdm patients, provided data and information, and kept the\npublic informed. The authors would like to specifically acknowledge Anna\nBramley, MPH, from the Influenza Division at the Centers for Disease\nControl and Prevention, who managed and analyzed the US data; Marta\nCortes-Garcı´a, MD, MPH, from the Coordinating Centre for Health Alerts\nand Emergencies, who collected and managed the Spanish data; the\nRegional Surveillance and Alert Teams from the Autonomous Communities\nin Spain; Liao Qiaohong and Feng Luzhao from China Centers for Disease\nControl and Huai Yang from the China–U.S. Collaborative Program on\nEmerging and Re-Emerging Infectious Diseases, Beijing, China; Tessa van’t\nKlooster and Tjibbe Donker from the Epidemiology and Surveillance Unit,\nand Leslie Isken from the Preparedness and Response Unit, for severe acute\nrespiratory infection surveillance coordination at the Centre for Infectious\nDisease Control, National Institute for Public Health and the Environment\n(RIVM), Bilthoven, the Netherlands; and Cheryl Cohen from the National\nInstitute for Communicable Diseases, South Africa. The authors also wish to\nacknowledge the six restructured and six private hospitals in Singapore that\nprovided reports of laboratory-confirmed hospitalized H1N1pdm cases.\nFinally, the authors would also like to thank Matthew Lim and Lyn\nFinelli for their review of the manuscript.\nAuthor Contributions\nConceived and designed the experiments: AWM MDVK KAHV VS GJG.\nAnalyzed the data: MDVK KAHV VS GJG AWM CAD AK. Wrote the\npaper: MDVK KAHV VS GJG AWM. ICMJE criteria for authorship\nread and met: MDVK KAHV VS GJG LOC RO LP JV CG YH FZ SKC\nAA SB GK WH IB KT KN TS YT TS JMH AO EP MABV LW DH JC\nVJL JT PSO MJS WH JKU RP SJ AWM CAD AK. Agree with the\nmanuscript’s results and conclusions: MDVK KAHV VS GJG LOC RO\nLP JV CG YH FZ SKC AA SB GK WH IB KT KN TS YT TS JMH AO\nEP MABV LW DH JC VJL JT PSO MJS WH JKU RP SJ AWM CAD\nAK. Wrote the first draft of the paper: MDVK KAHV VS GJG AWM.\nReviewed and edited several versions of the manuscript: LOC RO LP JV\nCG YH FZ SKC AA SB GK WH IB KT KN TS YT TS JMH AO EP\nMABV LW DH JC VJL JT PSO MJS WH JKU RP SJ.\nReferences\n1. Centers for Disease Control and Prevention (2009) Update: swine influenza A\n(H1N1) infections—California and Texas, April 2009 MMWR Morb Mortal\nWkly Rep 58: 435–437. Available: http:\/\/www.cdc.gov\/mmwr\/preview\/\nmmwrhtml\/mm5816a7.htm. Accessed 22 January 2010.\n2. World Health Organization (2009) Swine influenza—update 3. Available: http:\/\/\nwww.who.int\/csr\/don\/2009_04_27\/en\/index.html. Accessed 22 January 2010.\n3. Chan M (2009 April 25) Swine influenza: statement by WHO Director-\nGeneral, Dr Margaret Chan. Available: http:\/\/www.who.int\/mediacentre\/\nRisk Factors for H1N1pdm Severity\nPLoS Medicine | www.plosmedicine.org 9 July 2011 | Volume 8 | Issue 7 | e1001053\nnews\/statements\/2009\/h1n1_20090425\/en\/index.html. Accessed 21 January\n21 2010.\n4. World Health Organization (2010) Evolution of a pandemic: A(H1N1) 2009,\nApril 2009–March 2010. Geneva: World Health Organization.\n5. National Center for Immunization and Respiratory Diseases (2009) Use of\ninfluenza A (H1N1) 2009 monovalent vaccine. Recommendations of the\nAdvisory Committee on Immunization Practices (ACIP), 2009. MMWR\nRecomm Rep 58(RR-10): 1–8.\n6. Fiore A, Shay D, Broder K, Uyeki T, Mootrey G, et al. (2009) Prevention and\ncontrol of influenza, recommendations of the Advisory Committee on\nImmunization Practices (ACIP), 2008. MMWR Recomm Rep 57(RR-7): 1–60.\n7. Mereckiene J, Cotter S, Nicoll A, Levy-Bruhl D, Ferro A, et al. (2008) National\nseasonal influenza vaccination survey in Europe, 2008. Euro Surveill 13: pii:\n19017.\n8. Dodd L, McNeil SA, Fell DB, Allen VM, Coombs A, et al. (2007) Impact of\ninfluenza exposure on rates of hospital admissions and physician visits because of\nrespiratory illness among pregnant women. CMAJ 176: 463–468.\n9. Freeman DW, Barno A (1959) Deaths from Asian influenza associated with\npregnancy. Am J Obstet Gynecol 78: 1172–1175.\n10. Harris JW (1919) Influenza occurring in pregnant women. JAMA 72: 978–980.\n11. Neuzil KM, Reed GW, Mitche EF, Simonsen L, Griffin MR (1998) Impact of\ninfluenza on acute cardiopulmonary hospitalizations in pregnant women.\nAm J Epidemiol 148: 1094–1102.\n12. World Health Organization (2009) Clinical features of severe cases of pandemic\ninfluenza. Pandemic (H1N1) 2009 briefing note 13. Available: http:\/\/www.who.\nint\/csr\/disease\/swineflu\/notes\/h1n1_clinical_features_20091016\/en\/index.\nhtml. Accessed 19 May 2011.\n13. The ANZIC Influenza Investigators (2009) Critical care services and 2009\nH1N1 influenza in Australia and New Zealand. N Engl J Med 361: 1925–1934.\nAvailable: http:\/\/www.nejm.org\/doi\/full\/10.1056\/NEJMoa0908481#t = arti-\narticle. Accessed 19 May 2011.\n14. Centers for Disease Control and Prevention (2009) Deaths related to 2009\npandemic influenza A (H1N1) among American Indian\/Alaska Natives—12\nstates, 2009. MMWR Morb Mortal Weekly Rep 58: 1341–1344.\n15. Donaldson LJ, Rutter PD, Ellis BM, Greaves FEC, Mytton OT, et al. (2009)\nMortality from pandemic A\/H1N1 2009 influenza in England: public health\nsurveillance study. BMJ 339: b5213.\n16. BinSaeed A (2010) Characteristics of pandemic influenza A (H1N1) infection in\npatients presenting to a university hospital in Riyadh, Saudi Arabia. Ann Saudi\nMed 30: 59–62.\n17. Centers for Disease Control and Prevention (2009) Novel influenza A (H1N1)\nvirus infections in three pregnant women—United States, April–May 2009.\nMMWR Morb Mortal Weekly Rep 58: 497–500.\n18. Centers for Disease Control and Prevention (2009) Hospitalized patients with\nnovel influenza A (H1N1) virus infection—California, April–May, 2009.\nMMWR Morb Mortal Weekly Rep 58: 536–541.\n19. Palacios G, Hornig M, Cisterna D, Savji N, Bussetti A, et al. (2009)\nStreptococcus pneumoniae coinfection is correlated with the severity of H1N1\npandemic influenza. PLoS ONE 4: e8540. doi:10.1371\/journal.pone.0008540.\n20. Fuhrman C, Bonmarin I, Paty A, Duport N, Chiron E, et al. (2010) Severe\nhospitalised 2009 pandemic influenza A(H1N1) cases in France, 1 July–15\nNovember 2009. Euro Surveill 15: pii: 19463. Available: http:\/\/www.\neurosurveillance.org\/ViewArticle.aspx?ArticleId = 19463. Accessed 19 May\n2011.\n21. Louie JK, Acosta M, Winter K, Jean C, Gavali S, et al. (2009) Factors associated\nwith death or hospitalization due to pandemic 2009 influenza A(H1N1) infection\nin California. JAMA 302: 1896–1902.\n22. Chien Y, Su C, Tsai H, Huang S, Chuang J, et al. (2009) The first 100\nhospitalized severe complicated influenza cases caused by 2009 pandemic\ninfluenza A (H1N1) in Taiwan. Taiwan Epidemiology Bulletin. Available:\nhttp:\/\/teb.cdc.gov.tw\/public\/Attachment\/23552_25-10-%E8%8B%B12-692-\n707.pdf. Accessed 19 May 2011.\n23. Zarychanski R, Stuart TL, Kumar A, Doucette S, Elliott L, et al. (2010)\nCorrelates of severe disease in patients with 2009 pandemic influenza (H1N1)\nvirus infection. CMAJ 182: 257–264.\n24. Cullen G, Martin J, O’Donnell J, Boland M, Canny M, et al. (2009) Surveillance\nof the first 205 confirmed hospitalised cases of pandemic H1N1 influenza in\nIreland, 28 April–3 October 2009. Euro Surveill 14: pii: 19389.\n25. Denholm J, Gordon C, Johnson P, Hewagama S, Stuart R, et al. (2010)\nHospitalised adult patients with pandemic (H1N1) 2009 influenza in Melbourne,\nAustralia. MJA 192: 84–86.\n26. Yang P, Deng Y, Pang X, Shi W, Li X, et al. (2010) Severe, critical and fatal\ncases of 2009 H1N1 influenza in China. J Infect 61: 277–283. doi: 10.1016\/\nj.jinf.2010.07.010.\n27. Shimada T, Gu Y, Kamiya H, Komiya N, Odaira F, et al. (2010) Epidemiology\nof influenza A(H1N1)v virus infection in Japan, May–June 2009. Euro Surveill\n14: pii: 19244. Available: http:\/\/www.eurosurveillance.org\/ViewArticle.as-\npx?ArticleId = 19244. Accessed 19 May 2011.\n28. Poggensee G, Gilsdorf A, Buda S, Eckmanns T, Claus H, et al. (2010) The first\nwave of pandemic influenza (H1N1) 2009 in Germany: from initiation to\nacceleration. BMC Infect Dis 10: 155. doi:110.1186\/1471-2334-1110-1155.\n29. van ’t Klooster T, Wielders C, Donker T, Isken L, Meijer A, et al. (2010)\nSurveillance of hospitalisations for 2009 pandemic influenza A(H1N1) in the\nNetherlands, 5 June–31 December 2009. Euro Surveill 15: pii: 19461.\n30. Hahne´ S, Donker T, Meijer A, Timen A, van Steenbergen J, et al. (2009)\nEpidemiology and control of influenza A(H1N1)v in the Netherlands: the first\n115 cases. Euro Surveill 14: pii: 19267. Available: http:\/\/www.eurosurveillance.\norg\/ViewArticle.aspx?ArticleId = 19267. Accessed 19 May 2011.\n31. Vriend HJ, Hahne´ SJM, Donker T, Meijer A, Timen A, et al. (2009) De nieuwe\ninfluenza A(H1N1)-epidemie in Nederland. Epidemiologische gegevens over de\nperiode 30 april–14 augustus 2009. Ned Tijdschr Geneeskd 153: A969.\n32. van der Sande MAB, van der Hoek W, Hooiveld M, Donker GA, van\nSteenbergen JE, et al. (2009) Bestrijding van de nieuwe influenza A (H1N1). II.\nEpidemiologie en niet-medicamenteuze maatregelen. Ned Tijdschr Geneeskd\n153: A771.\n33. Dijkstra F, van ’t Klooster TM, Brandsema P, van Gageldonk-Lafeber AB,\nMeijer A, et al. (2010) Jaarrapportage surveillance respiratoire infectieziekten\n2009. Bilthoven: Rijksinstituut voor Volksgezondheid en Milieu, 2010. RIVM\nRIVM-briefrapportnummer: 210231006. Available: http:\/\/www.rivm.nl\/bib-\nliotheek\/rapporten\/210231006.pdf. Accessed 19 May 2011.\n34. Institut de Veille Sanitaire (2009 December 16) Surveillance de la grippe A\n(H1N1) 2009 en France: outils et me´thodes. Available: http:\/\/www.invs.sante.\nfr\/surveillance\/grippe_dossier\/docs_professionnels\/methodo_surveillance_-\ngrippe_161209.pdf. Accessed 19 May 2011.\n35. Skarbinski J, Jain S, Bramley A, Lee EJ, Huang J, et al. (2011) Hospitalized\npatients with 2009 pandemic influenza A (H1N1) virus infection in the United\nStates—September–October 2009. Clin Infect Dis 52(Suppl 1): S50–S59.\n36. Jain S, Kamimoto L, Bramley AM, Schmitz AM, Benoit SR, et al. (2009)\nHospitalized patients with 2009 H1N1 influenza in the United States, April–\nJune 2009. N Engl J Med 361: 1935–1944.\n37. UK Health Protection Agency (2010) Sources of UK flu data: influenza surveillance\nin the United Kingdom. Available: http:\/\/www.hpa.org.uk\/webw\/HPAweb&\nHPAwebStandard\/HPAweb_C\/1195733821514?p = 1191942171484. Accessed\n19 May 2011.\n38. Randrianasolo L, Raoelina Y, Ratsitorahina M, Ravolomanana L,\nAndriamandimby S, et al. (2010) Sentinel surveillance system for early outbreak\ndetection in Madagascar. BMC Public Health 10: 31.\n39. Cutter J, Ang LW, Lai FY, Subramony H, Ma S, et al. (2010) Outbreak of\npandemic influenza A (H1N1-2009) in Singapore, May to September 2009. Ann\nAcad Med Singapore 39: 273–282.\n40. Sierra Moros MJ, Va´zquez Torres M, Santa-Olalla Peralta P, Limia Sa´nchez A,\nCortes Garcı´a M, et al. (2010) Epidemiological surveillance activities during the\n2009 influenza pandemic in Spain. Lessons learnt one year after. Rev Esp Salud\nPublica 84: 463–480.\n41. Santa-Olalla Peralta P, Cortes-Garcia M, Vicente-Herrero M, Castrillo-\nVillamandos C, Arias-Bohigas P, et al. (2010) Risk factors for disease severity\namong hospitalised patients with 2009 pandemic influenza A (H1N1) in Spain,\nApril–December 2009. Euro Surveill 15: pii: 19667.\n42. Santa-Olalla Peralta P, Cortes Garcı´a M, Limia Sa´nchez A, Andre´s Prado J,\nPacho´n del Amo I, et al. (2010) Critically ill patients with 2009 pandemic\ninfluenza A (H1N1) infection in Spain: factors associated with death, April\n2009–January 2010. Rev Esp Salud Publica 84: 547–568.\n43. Baker MG, Wilson N, Huang QS, Paine S, Lopez L, et al. (2009) Pandemic\ninfluenza A(H1N1)v in New Zealand: the experience from April to August 2009.\nEuro Surveill 14: pii: 19319.\n44. Huang QS, Bandaranayake D, Lopez LD, Pirie R, Peacey M, et al. (2009)\nSurveillance for the 2009 pandemic influenza A (H1N1) virus and seasonal\ninfluenza viruses - New Zealand, 2009. MMWR Morb Mortal Wkly Rep 58:\n918–921.\n45. Yu H, Liao Q, Yuan Y, Zhou L, Xiang N, et al. (2010) Effectiveness of\noseltamivir on disease progression and viral RNA shedding in patients with mild\npandemic 2009 influenza A H1N1: opportunistic retrospective study of medical\ncharts in China. BMJ 341: c4779.\n46. Yu H, Feng Z, Ujeki TM, Liao Q, Zhou L, et al. (2011) Risk factors for severe\nillness with 2009 pandemic influenza A(H1N1) virus infection in China. Clin\nInfect Dis 52: 457–465.\n47. Campbell A, Rodin R, Kropp R, Mao Y, Hong Z, et al. (2010) Risk of severe\noutcomes among patients admitted to hospital with pandemic (H1N1) influenza.\nCMAJ 182: 349–355.\n48. Helferty M, Vachon J, Tarasuk J, Rodin R, Spika J, et al. (2011) Canadian\npandemic H1N1 cases: a description of the changing epidemiology of\nhospitalizations and deaths in the first and second waves. CMAJ. In press.\n49. Kong WM (2000) A review on the Hong Kong influenza surveillance system.\nPublic Health Epidemiology Bull 9.\n50. United Nations Population Division (2009) World population prospects: the\n2008 revision population database. http:\/\/esa.un.org\/unpd\/wpp\/unpp\/panel_\npopulation.htm.\n51. Higgins J, Thompson SG (2002) Quantifying heterogeneity in a meta-analysis.\nStat Med 21: 1539–1558.\n52. Simmonds MC, Higgins JP (2007) Covariate heterogeneity in meta-analysis:\ncriteria for deciding between meta-regression and individual patient data. Stat\nMed 26: 2982–2999.\n53. Pebody RG, McLean E, Zhao H, Cleary P, Bracebridge S, et al. (2010)\nPandemic influenza A (H1N1) 2009 and mortality in the United Kingdom: risk\nfactors for death, April 2009 to March 2010. Euro Surveill 15: pii: 19571.\n54. Vaillant L, La Ruche G, Tarantola A, Barboza P, epidemic intelligence team at\nInVS (2009) Epidemiology of fatal cases associated with pandemic H1N1\ninfluenza 2009. Euro Surveill 14: pii: 19309.\nRisk Factors for H1N1pdm Severity\nPLoS Medicine | www.plosmedicine.org 10 July 2011 | Volume 8 | Issue 7 | e1001053\n55. Bettinger JA, Sauve´ LJ, Scheifele DW, Moore D, Vaudry W, et al. (2010)\nPandemic influenza in Canadian children: A summary of hospitalized pediatric\ncases. Vaccine 28: 3180–3184.\n56. Lemaitre M, Carrat F (2010) Comparative age distribution of influenza\nmorbidity and mortality during seasonal influenza epidemics and the 2009\nH1N1 pandemic. BMC Infect Dis 10: 162.\n57. Kamigaki T, Oshitani H (2009) Epidemiological characteristics and low case\nfatality rate of pandemic (H1N1) 2009 in Japan. PLoS Curr 1: RRN1139.\n58. Hanslik T, Boelle P, Flahault A (2010) Preliminary estimation of risk factors for\nadmission to intensive care units and for death in patients infected with\nA(H1N1)2009 influenza virus, France, 2009–2010. PLoS Curr 2: RRN1150.\n59. Wu JT, Ma ES, Lee CK, Chu DK, Ho PL, et al. (2010) The infection attack rate\nand severity of 2009 pandemic H1N1 influenza in Hong Kong. Clin Infect Dis\n51: 1184–1191.\n60. Miller E, Hoschler K, Hardelid P, Stanford E, Andrews N, et al. (2010)\nIncidence of 2009 pandemic influenza A H1N1 infection in England: a cross-\nsectional serological study. Lancet 375: 1100–1108.\n61. Presanis AM, De Angelis D, The New York City Swine Flu Investigation Team,\nHagy A, Reed C, et al. (2009) The severity of pandemic H1N1 influenza in the\nUnited States, from April to July 2009: a Bayesian analysis. PLoS Med 6:\ne1000207. doi:10.1371\/journal.pmed.1000207.\n62. Watson L, Turk F, James P, Holgate ST (2007) Factors associated with mortality\nafter an asthma admission: A national United Kingdom database analysis.\nRespir Med 101: 1659–1664.\n63. Jamieson DJ, Honein MA, Rasmussen SA, Williams JL, Swerdlow DL, et al.\n(2009) H1N1 2009 influenza virus infection during pregnancy in the USA.\nLancet 374: 451–458.\n64. Kumar A, Zarychanski R, Pinto R, Cook DJ, Marshall J, et al. (2009) Critically\nill patients with 2009 influenza A(H1N1) infection in Canada. JAMA 302:\n1872–1879.\n65. Creanga AA, Johnson TF, Graitcer SB, Hartman LK, Al-Samarrai T, et al.\n(2010) severity of 2009 pandemic influenza A (H1N1) virus infection in pregnant\nwomen. Obstet Gynecol 115: 717–726.\n66. The ANZIC Influenza Investigators and Australasian Maternity Outcomes\nSurveillance System (2010) Critical illness due to2009 A\/H1N1 influenza in\npregnant and postpartum women: population based cohort study. BMJ 340:\nc1279. doi:1210.1136\/bmj.c1279.\n67. Archer B, Cohen C, Naidoo D, Thomas J, Makunga C, et al. (2009) Interim\nreport on pandemic H1N1 influenza virus infections in South Africa, April to\nOctober 2009: epidemiology and factors associated with fatal cases. Euro\nSurveill 14: pii: 19369.\n68. Siston AM, Rasmussen SA, Honein MA, Fry AM, Seib K, et al. (2010)\nPandemic 2009 influenza A(H1N1) virus illness among pregnant women in the\nUnited States. JAMA 303: 1517–1525.\n69. Jamieson D, Theiler R, Rasmussen S (2006) Emerging infections and pregnancy.\nEmerg Infect Dis 12: 1638–1643.\n70. Goodnight W, Soper D (2005) Pneumonia in pregnancy. Crit Care Med 33:\nS390–S397.\n71. Centers for Disease Control and Prevention (2009) Intensive-care patients with\nsevere novel influenza A (H1N1) virus infection—Michigan, June 2009. MMWR\nMorb Mortal Weekly Rep 58: 749–752.\n72. Dominguez-Cherit G, Lapinsky SE, Macias AE, Pinto R, Espinosa-Perez L,\net al. (2009) Critically ill patients with 2009 influenza A(H1N1) in Mexico.\nJAMA 302: 1880–1887.\n73. Rello J, Rodrı´guez A, Iban˜ez P, Socias L, Cebrian J, et al. (2009) Intensive care\nadult patients with severe respiratory failure caused by Influenza A (H1N1)v in\nSpain. Crit Care 13: R148.\n74. Rodrı´guez A, Socı´as L, Guerrero J, Figueira J, Gonza´lez N, et al. (2010) Gripe A\npande´mica en una unidad de cuidados intensivos: experiencia en Espan˜a y\nLatinoame´rica (Grupo Espan˜ol de Trabajo de Gripe A Grave\/Sociedad\nEspan˜ola de Medicina Intensiva, Crı´tica y Unidades Coronarias). Med Intensiva\n34: 87–94.\n75. Centers for Disease Control and Prevention (2009) Patients hospitalized with\n2009 pandemic influenza A (H1N1)—New York City, May 2009. MMWR\nMorb Mortal Weekly Rep 58: 1436–1440.\n76. Plessa E, Diakakis P, Gardelis J, Thirios A, Koletsi P, et al. (2010) Clinical\nfeatures, risk factors, and complications among pediatric patients with pandemic\ninfluenza A (H1N1). Clin Pediatr (Phila) 49: 777–781.\n77. Morgan O, Bramley A, Fowlkes A, Freedman D, Taylor TH, et al. (2010)\nMorbid obesity as a risk factor for hospitalization and death due to 2009\npandemic influenza A(H1N1) disease. PLoS ONE 5: e9694. doi:9610.1371\/\njournal.pone.0009694.\n78. Arizona Department of Health Services (2010) Arizona—Supplemental\ninfluenza summary MMWR Week 9 (2\/28\/10–3\/6\/10). Phoenix (Arizona):\nArizona Department of Health Services.\n79. Fundac¸a˜o Nacional de Sau´de (2009) Sau´de indı´gena—informe te´cnico sobre\ninfluenza A H1N1. Influenza A (H1N1) em populac¸o˜es indı´genas do Brasil.\nInforme Te´cnico nu06\/2009. Available: http:\/\/www.funasa.gov.br\/internet\/\ndesai\/arquivos\/informeTecnicoInfluenzaA_6.pdf. Accessed 30 May 2011.\n80. La Ruche G, Tarantola A, Barboza P, Vaillant L, Gueguen J, et al. (2009) The\n2009 pandemic H1N1 influenza and indigenous populations of the Americas\nand the Pacific. Euro Surveill 14: pii: 19366.\n81. Australian Government Department of Health and Aging (2010) Australian\ninfluenza surveillance report no. 8, 2010. Available: http:\/\/www.healthemer-\ngency.gov.au\/internet\/healthemergency\/publ ishing.nsf\/Content\/\nEB136394E79CA5E2CA2576A50010783A\/$File\/ozflu-no8-2010.pdf. Ac-\ncessed 19 May 2011.\n82. Webb SA, Pettila V, Seppelt I, Bellomo R, Bailey M, et al. (2009) Critical care\nservices and 2009 H1N1 influenza in Australia and New Zealand. N Engl J Med\n361: 1925–1934.\n83. Wilson N, Baker M (2008) Ninety years on: what we still need to learn from\n‘‘Black November’’ 1918 about pandemic influenza. N Z Med J 121: 136–138.\n84. Groom AV, Jim C, Laroque M, Mason C, McLaughlin J, et al. (2009) Pandemic\ninfluenza preparedness and vulnerable populations in tribal communities.\nAm J Public Health 99(Suppl 2): S271–S278.\n85. Johnson NP, Mueller J (2002) Updating the accounts: global mortality of the\n1918–1920 ‘‘Spanish’’ influenza pandemic. Bull Hist Med 76: 105–115.\n86. Subramony H, Lai FY, Ang LW, Cutter J, Lim PL, et al. (2010) An\nepidemiological study of 1348 cases of pandemic H1N1 influenza admitted to\nSingapore hospitals from July to September 2009. Ann Acad Med Singapore 39:\n283–290.\nRisk Factors for H1N1pdm Severity\nPLoS Medicine | www.plosmedicine.org 11 July 2011 | Volume 8 | Issue 7 | e1001053\nEditors’ Summary\nBackground. In April 2009, a new strain of influenza A\nH1N1 was first identified in Mexico and the United States and\nsubsequently spread around the world. In June 2009, the\nWorld Health Organization (WHO) declared a pandemic alert\nphase 6, which continued until August 2010. Throughout the\npandemic, WHO and member states gathered information to\ncharacterize the patterns of risk associated with the new\ninfluenza A H1N1 virus infection and to assess the clinical\npicture. Although risk factors for severe disease following\nseasonal influenza infection have been well documented in\nmany countries (for example, pregnancy; chronic medical\nconditions such as pulmonary, cardiovascular, renal, hepatic,\nneuromuscular, hematologic, and metabolic disorders; some\ncognitive conditions; and immunodeficiency), risk factors for\nsevere disease following infection early in the 2009 H1N1\npandemic were largely unknown.\nWhy Was This Study Done? Many countries have recently\nreported data on the association between severe H1N1\ninfluenza and a variety of underlying risk factors, but because\nthese data are presented in different formats, making direct\ncomparisons across countries is difficult, with no clear\nconsensus for some conditions. Therefore, to assess the\nfrequency and distribution of known and new potential risk\nfactors for severe H1N1 infection, this study was conducted\nto collect data (from 1 April 2009 to 1 January 2010) from\nsurveillance programs of the Ministries of Health or National\nPublic Health Institutes in 19 countries_Argentina, Australia,\nCanada, Chile, China, France, Germany, Hong Kong (special\nadministrative region), Japan, Madagascar, Mexico, the\nNetherlands, New Zealand, Singapore, South Africa, Spain,\nThailand, the United States, and the United Kingdom.\nWhat Did the Researchers Do and Find? As part of\nroutine surveillance, countries were asked to provide risk\nfactor data on laboratory-confirmed H1N1 in patients who\nwere admitted to hospital, admitted to the intensive care\nunit (ICU), or had died because of their infection, using a\nstandardized format. The researchers grouped potential risk\nconditions into four categories: age, chronic medical\nillnesses, pregnancy (by trimester), and other conditions\nthat were not previously considered as risk conditions for\nsevere influenza outcomes, such as obesity. For each risk\nfactor (except pregnancy), the researchers calculated the\npercentage of each group of patients using the total number\nof cases reported in each severity category (hospitalization,\nadmission to ICU, and death). To evaluate the risk associated\nwith pregnancy, the researchers used the ratio of pregnant\nwomen to all women of childbearing age (age 15–49 years)\nat each level of severity to describe the differences between\nlevels.\nThe researchers were able to collect data on approximately\n70,000 patients requiring hospitalization, 9,700 patients\nadmitted to the ICU, and 2,500 patients who died from\nH1N1 infection. The proportion of patients with H1N1 with\none or more reported chronic conditions increased with\nseverity—the median was 31.1% of hospitalized patients,\n52.3% of patients admitted to the ICU, and 61.8% of patients\nwho died. For all levels of severity, pregnant women in their\nthird trimester consistently accounted for the majority of the\ntotal of pregnant women. The proportion of patients with\nobesity increased with increasing disease severity—median\nof 6% of hospitalized patients, 11.3% of patients admitted to\nthe ICU, and 12.0% of all deaths from H1N1.\nWhat Do These Findings Mean? These findings show\nthat risk factors for severe H1N1 infection are similar to those\nfor seasonal influenza, with some notable differences: a\nsubstantial proportion of people with severe and fatal cases\nof H1N1 had pre-existing chronic illness, which indicates that\nthe presence of chronic illness increases the likelihood of\ndeath. Cardiac disease, chronic respiratory disease, and\ndiabetes are important risk factors for severe disease that\nwill be especially relevant for countries with high rates of\nthese illnesses. Approximately 2\/3 of hospitalized people and\n40% of people who died from H1N1 infection did not have\nany identified pre-existing chronic illness, but this study was\nnot able to comprehensively assess how many of these cases\nhad other risk factors, such as pregnancy, obesity, smoking,\nand alcohol misuse. Because of large differences between\ncountries, the role of risk factors such as obesity and\npregnancy need further study—although there is sufficient\nevidence to support vaccination and early intervention for\npregnant women. Overall, the findings of this study reinforce\nthe need to identify and target high-risk groups for\ninterventions such as immunization, early medical advice,\nand use of antiviral medications.\nAdditional Information. Please access these Web sites via\nthe online version of this summary at http:\/\/dx.doi.org\/10.\n1371\/journal.pmed.1001053.\nN WHO provides a Global Alert and Response (GAR) with\nupdates on a number of influenza-related topics\nN The US Centers for Disease Control and Prevention\nprovides information on risk factors and H1N1\nRisk Factors for H1N1pdm Severity\nPLoS Medicine | www.plosmedicine.org 12 July 2011 | Volume 8 | Issue 7 | e1001053\n"}