{"doi":"10.1107\/S0909049502021155","coreId":"195508","oai":"oai:lra.le.ac.uk:2381\/7603","identifiers":["oai:lra.le.ac.uk:2381\/7603","10.1107\/S0909049502021155"],"title":"Multiple-electron excitation in X-ray absorption: a screened model of the core-hole-photoelectron potential","authors":["Roy, Mervyn","Gurman, Steve J."],"enrichments":{"references":[{"id":44699923,"title":"10, 120±124 Roy and Gurman  Multiple-electron excitation in X-ray absorption 123 research papers 124","authors":[],"date":"2003","doi":"10.1107\/s0909049502021155","raw":"J. Synchrotron Rad. (2003). 10, 120±124 Roy and Gurman  Multiple-electron excitation in X-ray absorption 123 research papers 124 Received 15 March 2002  Accepted 13 November 2002 J. Synchrotron Rad. (2003). 10, 120±124 Chou, S. H., Rehr, J. J., Stern, E. A. & Davidson, E. R. (1987). Phys. Rev. B, 35, 2604±2614.","cites":null},{"id":44699964,"title":"Editor. Synchrotron Radiation and Biophysics.","authors":[],"date":"1990","doi":"10.1007\/978-3-642-71490-0_18","raw":"Hasnain, S. S. (1990). Editor. Synchrotron Radiation and Biophysics. Chichester: Ellis Horwood.","cites":null},{"id":44699922,"title":"EXCURV98: Computer Program for EXAFS Data Analysis. CLRC Daresbury Laboratory, Daresbury,","authors":[],"date":"1998","doi":null,"raw":"Binsted, N. (1998). EXCURV98: Computer Program for EXAFS Data Analysis. CLRC Daresbury Laboratory, Daresbury, Warrington WA4 4AD, UK. (http:\/\/srs.dl.ac.uk\/xrs\/Computing\/Programs\/excurv97\/e61.htm.) Carlson, T. A., Nestor, C. W., Tucker, T. C. & Malick, F. B. (1968). Phys. Rev. 169, 27±36.","cites":null},{"id":44699966,"title":"Numerical Recipes, The Art of Scienti®c Computing.","authors":[],"date":"1992","doi":"10.2307\/1269484","raw":"Press, W. H., Flannery, B. P., Teukolsky, S. A. & Vetterling, W. T. (1992). Numerical Recipes, The Art of Scienti®c Computing. Cambridge University Press.","cites":null},{"id":44699924,"title":"Tables of Integrals, Series and Products.","authors":[],"date":"1965","doi":null,"raw":"Gradsteyn, I. S. & Ryzhik, I. M. (1965). Tables of Integrals, Series and Products. New York\/London: Academic Press.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-03","abstract":"The probability of secondary electron shake-off in X-ray absorption is calculated using a model form for the time- and energy-dependent core-hole-photoelectron potential, screened by the single plasmon pole dielectric function of the surrounding material. The resultant excitation probabilities are related to the energy-dependent intrinsic loss function in EXAFS data analysis and compared with experiment. Reasonable agreement is obtained close to the absorption edge although the calculation is less accurate at higher photon energies. The theory described allows the losses to be calculated with little computational effort, making the method suitable for routine EXAFS data analysis","downloadUrl":"http:\/\/scripts.iucr.org\/cgi-bin\/paper?S0909049502021155.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7603\/3\/jsyncrad-10-120-2003.pdf","pdfHashValue":"e730c0c9f34afbebd5c9509d96d5ef6639d83d17","publisher":"International Union of Crystallography","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7603<\/identifier><datestamp>\n                2016-03-10T14:00:48Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nMultiple-electron excitation in X-ray absorption: a screened model of the core-hole-photoelectron potential<\/dc:title><dc:creator>\nRoy, Mervyn<\/dc:creator><dc:creator>\nGurman, Steve J.<\/dc:creator><dc:description>\nThe probability of secondary electron shake-off in X-ray absorption is calculated using a model form for the time- and energy-dependent core-hole-photoelectron potential, screened by the single plasmon pole dielectric function of the surrounding material. The resultant excitation probabilities are related to the energy-dependent intrinsic loss function in EXAFS data analysis and compared with experiment. Reasonable agreement is obtained close to the absorption edge although the calculation is less accurate at higher photon energies. The theory described allows the losses to be calculated with little computational effort, making the method suitable for routine EXAFS data analysis.<\/dc:description><dc:date>\n2010-03-02T13:45:42Z<\/dc:date><dc:date>\n2010-03-02T13:45:42Z<\/dc:date><dc:date>\n2003-03<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nJournal of Synchrotron Radiation, 2003, 10 (2), pp. 120-124.<\/dc:identifier><dc:identifier>\n0909-0495<\/dc:identifier><dc:identifier>\nhttp:\/\/scripts.iucr.org\/cgi-bin\/paper?S0909049502021155<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7603<\/dc:identifier><dc:identifier>\n10.1107\/S0909049502021155<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nCondensed Matter Physics<\/dc:relation><dc:rights>\nThis is an authorised electronic reprint of the paper published as Journal of Synchrotron Radiation, 2003, 10 (2), pp. 120-124.  This paper is available from http:\/\/scripts.iucr.org\/cgi-bin\/paper?S0909049502021155.  Doi: 10.1107\/S0909049502021155<\/dc:rights><dc:publisher>\nInternational Union of Crystallography<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0909-0495","0909-0495"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Condensed Matter Physics"],"year":2003,"topics":[],"subject":["Article"],"fullText":"electronic reprint\nJournal of\nSynchrotron\nRadiation\nISSN 0909-0495\nMultiple-electron excitation in X-ray absorption: a screened model of\nthe core-hole–photoelectron potential\nMervyn Roy and S. J. Gurman\nCopyright © International Union of Crystallography\nAuthor(s) of this paper may load this reprint on their own web site provided that this cover page is retained. Republication of this article or its\nstorage in electronic databases or the like is not permitted without prior permission in writing from the IUCr.\nJ. Synchrotron Rad. (2003). 10, 120–124 Roy and Gurman \u000f Multiple-electron excitation in X-ray absorption\nresearch papers\n120 # 2003 International Union of Crystallography \u000f Printed in Great Britain ± all rights reserved J. Synchrotron Rad. (2003). 10, 120±124\nMultiple-electron excitation in X-ray\nabsorption: a screened model of the\ncore-hole±photoelectron potential\nMervyn Roy* and S. J. Gurman\nDepartment of Physics and Astronomy, University of Leicester,\nUniversity Road, Leicester, England. E-mail: mr6@le.ac.uk\nThe probability of secondary electron shake-off in X-ray absorption\nis calculated using a model form for the time- and energy-dependent\ncore-hole±photoelectron potential, screened by the single plasmon\npole dielectric function of the surrounding material. The resultant\nexcitation probabilities are related to the energy-dependent intrinsic\nloss function in EXAFS data analysis and compared with experiment.\nReasonable agreement is obtained close to the absorption edge\nalthough the calculation is less accurate at higher photon energies.\nThe theory described allows the losses to be calculated with little\ncomputational effort, making the method suitable for routine\nEXAFS data analysis.\nKeywords: EXAFS amplitudes; EXAFS data analysis; secondary\nelectron shake-off; screened core hole.\n1. Introduction\nX-ray absorption theory is usually given in purely one-electron terms.\nThis gives very good results for the X-ray absorption coef®cient\n(Gurman, 1983) and reasonable results for the extended X-ray\nabsorption ®ne structure (EXAFS) except for the amplitude. In a\nsingle-electron formalism, Coulomb interactions between the created\nphotoelectron and the bystander electrons are neglected. These\ninteractions can give rise to multiple electron excitations which\nremove photoelectrons from the elastic-scattering channel, hence\nreducing the primary-channel EXAFS (Rehr et al., 1978). In EXAFS\ndata analysis, excitations at the absorbing atom (intrinsic losses) are\nusually accounted for by multiplying the single-electron result by a\nconstant loss factor, s2o, while the losses at the scattering atoms\n(extrinsic losses) are included by introducing an imaginary part to the\nscattering potential. A constant value for the intrinsic loss factor is,\nhowever, a poor approximation, especially close to the X-ray\nabsorption edge. In this paper we investigate the energy dependence\nof s2o.\nIn a previous paper (Roy et al., 2001) we extended the time-\ndependent perturbation theory of Thomas (1984) to describe the\nenergy dependence of the intrinsic losses for all atoms using a simple\ngeneric model. In this formalism, however, the strength of the core-\nhole±photoelectron potential was not given explicitly, but had to be\nincluded by normalizing the results to experiment or theory (Roy &\nGurman, 1997) in the high-energy limit. In the present paper we\nattempt to rectify this problem by using a model form for this\npotential, screened by the energy- and frequency-dependent dielec-\ntric function. We know that the previous form of the theory gives a\ngood description of the EXAFS losses. In this paper we attempt to\nobtain an equally good description without the inclusion of any\n`®ddle factors'. The aim is to describe the inherently dif®cult problem\nof multiple electron excitations in terms of a physically intuitive\ntheory, following such authors as Gadzuk & Sunjic (1972), Noguera &\nSpanjaard (1981) and Vatai (1988). The form of the theory described\nis simple enough to be easily programmable and can be evaluated\nsuf®ciently quickly to be of use in routine data analysis. It is found to\ngive reasonable agreement with experiment for rare-gas atoms.\nIn the present paper (as in the previous work) we calculate only\nshake-off transition probabilities. The shake-up, or bound-to-bound,\ntransitions are much less probable than excitations into the conti-\nnuum (Carlson et al., 1968; Hasnain, 1990) and are usually ignored for\nEXAFS data-analysis purposes (Hayes & Boyce, 1982). Also, shake-\nup transitions typically involve only the weakly bound initial states.\nThe energies of these bound-to-bound transitions will therefore tend\nto be small, and the photoelectron energy will not differ from that of\nthe elastically scattered primary photoelectron by more than a few\neV. Thus, experimentally, the two contributions to the EXAFS signal\ntend not to be resolved and, in practice, the shake-up channels cause\nno diminution to the measured EXAFS signal.\nThe calculation of the EXAFS intrinsic loss factor is identical to\nthat of the probability of multiple-electron excitation, a problem\nwhich has been studied by many authors. Most of these calculations,\nhowever, are complicated and computationally intensive (e.g. Chang\n& Poe, 1975; Carter & Kelly, 1977) and are therefore unsuited for\nEXAFS data-analysis purposes. Recently, work has been done on a\nfull description of EXAFS losses including the intrinsic and extrinsic\nlosses and the interference (Hedin, 1989) between these terms (e.g.\nFujikawa et al., 2000; Natoli, 1995; Newville et al., 1993; Tyson et al.,\n1992); however, again we are unaware of any of these methods\ncurrently being used for routine EXAFS data analysis. At present\nmost EXAFS data-analysis programs use the Hedin±Lundqvist\nexchange and correlation potential to model inelastic effects.\nEmpirically, this potential includes all the losses to the EXAFS\namplitude (Roy & Gurman, 2001) although it was designed to model\nonly the extrinsic losses. The absolute accuracy of the Hedin±\nLundqvist potential is therefore uncertain (Tyson, 1991).\n2. Theory\nIn the standard EXAFS problem a photon of frequency ! is absorbed\nby an atom. The photon excites an electron from a given initial state,\n’i, into a continuum state of energy !ÿ j!ij. Following the photo-\nionization, the resulting core-hole±photoelectron system acts as a\nperturbation on the other, passive, electrons in the absorbing atom.\nWe approximate this time-dependent perturbation with a screened\nmodel potential and use ®rst-order time-dependent perturbation\ntheory to calculate the probability of exciting each of the secondary\nelectrons.\nThe temporal variation of the potential arises because the photo-\nelectron takes a ®nite time to leave the atom, the time depending on\nthe size of the atom and the speed of the photoelectron. In the same\nway as in the previous paper (Roy et al., 2001), following Gadzuk &\nSunjic (1975) or Thomas (1984), we approximate the unscreened\ntime- and position-dependent perturbation V\u0085r; t\u0086 as a product of\ntime-dependent and position-dependent parts,\nV\u0085r; t\u0086 \u0088 V\u0085r\u0086 f \u0085t\u0086; \u00851\u0086\nwhere we assume\nf \u0085t\u0086 \u0088 \u00891 ÿ exp\u0085ÿt=to\u0086\u008a\u0002\u0085t\u0086: \u00852\u0086\nWith this form of the potential the passive electrons see the full core-\nhole potential, V\u0085r\u0086, as t !1 when the photoelectron has left the\natom. In equation (2) the characteristic time, to = Rc=v, where Rc is a\ncharacteristic distance of the atom and represents the size of the\norbital of passive electrons. v is the speed of the photoelectron, which,\nfollowing Thomas (1984), we have assumed to be time independent.\nelectronic reprint\nFinally, \u0002\u0085t\u0086 is the Heaviside step function which ensures that the\nperturbation is switched on at t = 0 when the photoelectron is created.\nThomas (1984) treats Rc as an adjustable parameter. We, however,\ntake Rc to be the mean radius of each atomic orbital, arguing that the\nmajority of the interaction between the passive electron and the\nphotoelectron will take place within this radius. We set Rc from the\nbinding energy of each orbital, using the relation for hydrogenic\nwavefunctions, Rc = no=\u00852Eo\u00861=2, where Eo is the binding energy and\nno is the principle quantum number of each orbital.\nThe unscreened core hole can be described by a simple coulomb\n1=r potential. However, using this potential for the core hole gives\nvalues for the probabilities which are much too large. The 1=r\nperturbation is too strong: the majority of passive electrons will not\nsee a bare core hole because of the screening effects of the other\npassive electrons. This screening will, in general, be energy depen-\ndent. We can model the screening using the single plasmon pole\ndielectric function of Hedin & Lundqvist (1969). This energy-\ndependent dielectric function will reduce the magnitude of the hole\npotential seen by the passive electrons. It will also introduce some\nmany-body effects into our single-electron theory.\nTo screen the time-dependent potential we must ®rst write it in\nFourier transform,\nV\u0085q; !\u0086 \u0088 4\u0019\niq2\n1\n!\nÿ 1\n!ÿ itÿ1o\n\u0012 \u0013\n: \u00853\u0086\nThe screened time-dependent perturbation is then given by\nV\u0085r; t\u0086 \u0088 1\u00852\u0019\u00864\nZ\ndq d! exp iq \u0001 r\u0085 \u0086 exp i!t\u0085 \u0086V\u0085q; !\u0086\"ÿ1\u0085q; !\u0086; \u00854\u0086\nwhere \"ÿ1\u0085q; !\u0086 is the causal single plasmon pole dielectric function,\n\"ÿ1\u0085q; !\u0086 \u0088 1 \u0087 !\n2\np\n2\u0085!ÿ i\u0011\u0086\n1\n!ÿ !q ÿ i\u0011\n\u0087 1\n!\u0087 !q ÿ i\u0011\n !\n; \u00855\u0086\n!p is the appropriate plasma frequency and !q is the q-dependent\nplasmon excitation energy.\nUsing the above results we can calculate the probability of a\nmultiple-electron excitation following the creation of the core-hole±\nphotoelectron system. As discussed in the previous work (Roy et al.,\n2001), time-dependent perturbation theory gives the probability\namplitude of a passive electron being excited from an atomic orbital,\nj’oi, into an excited state, j ni, as\nano \u0088\nZ 1\no\nexp i\u0085!no \u0087 i\u00110\u0086t\n\u0002 \u0003h njV\u0085r; t\u0086j’oi dt; \u00856\u0086\nwhere the convergence factor exp\u0085ÿ\u00110t\u0086 corresponds physically to the\n®nite core-hole lifetime. Substituting result (4) for V\u0085r; t\u0086 and inte-\ngrating over time we obtain the probability amplitude as\nano \u0088  n\nZ\ndq exp\u0085iq \u0001 r\u0086\n!no\u00852\u0019\u00864\nZ\nd!\n!V\u0085q; !\u0086\"ÿ1\u0085q; !\u0086\n!no \u0087 !\u0087 i\u00110\n\f\f\f\f\n\f\f\f\f’o\n\u001c \u001d\n: \u00857\u0086\nThe ! integral above may be performed using contour integration by\nclosing contours in the lower half plane. All the poles in V\u0085q; !\u0086 and\n\"ÿ1\u0085q; !\u0086 must lie in the upper half plane so that V\u0085r; t\u0086 is zero for\nt< 0. We therefore simply pick up a contribution from the pole at\n! = ÿ!no ÿ i\u00110 to obtain\nan \u0088\ni\n\u00852\u00193\u0086  n\nZ\ndq exp\u0085iq \u0001 r\u0086V\u0085q;ÿ!no\u0086\"ÿ1\u0085q;ÿ!no\u0086\n\f\f\f\f\n\f\f\f\f’lo\n\u001c \u001d\n: \u00858\u0086\nWe de®ne a slightly simpler form for !q to that normally used (Hedin\n& Lundqvist, 1969) so that we may evaluate the q-integrals analyti-\ncally. We choose\n!2q \u0088 !2p \u0087 q4=4; \u00859\u0086\nwhich exhibits the correct high and low q limits and should therefore\ngive a good approximation to the true excitation frequencies. As we\nare dealing with atoms and not a free-electron gas we make use of the\nlocal density approximation to write the plasma frequency !p in\nterms of the radially varying atomic charge density.\nThen, using this approximate form for !q and taking the in®nite-\nsimals in \"ÿ1\u0085q; !\u0086 to zero we can integrate equation (8) directly using\na result from Gradsteyn & Ryzhik (1965),\nan \u0088\nitÿ1o\n!no\u0085!no \u0087 itÿ1o \u0086\n n\n!2no ÿ !2p\u0085r\u0086 f \u0085r; !no\u0086\nr \u0089!2no ÿ !2p\u0085r\u0086\u008a\n\f\f\f\f\f\n\f\f\f\f\f’o\n* +\n; \u008510\u0086\nwhere\nf \u0085r; !no\u0086 \u0088 12 exp\u0085ÿbr\u0086 \u0087 12 cos\u0085br\u0086 !no>!p\u0085r\u0086\n\u0088 exp ÿbr=21=2ÿ \u0001 cos\u0085br=21=2\u0086 !no<!p\u0085r\u0086; \u008511\u0086\nand\nb4 \u0088 j!2no ÿ !2pj: \u008512\u0086\nThere are weak divergences in the r-integrand for both !no>!p and\n!no<!p of the form j!2no ÿ !2p\u0085r\u0086j1=4. However, the integrals are\neasily evaluated numerically using a standard Romberg integration\nroutine (Press et al., 1992).\nAt this point we concentrate on the secondary electron shake-off\nand ignore the possibility of bound-to-bound transitions. We can then\ncalculate the probability of exciting any of the secondary electrons\ninto any continuum state following the absorption of a photon in the\nsame way as in Roy et al. (2001). We ®nd\nPT\u0085!\u0086 \u0088\n1\n2\u0019\nX\ni\n\u0016io\u0085!\u0086\n\u0016o\u0085!\u0086\nX\nno;lo\nn\u0085no;lo\u0086\nZ kmax\no\nk2tÿ2o\n!2ko\u0085!2ko \u0087 tÿ2o \u0086\n\u0002\nZ\nRlo \u0085k; r\u0086 ’lo \u0085r\u0086\n!2ko ÿ !2p\u0085r\u0086 f \u0085r; k\u0086\nr \u0089!2ko ÿ !2p\u0085r\u0086\u008a\n\" #\nr dr\n\f\f\f\f\f\n\f\f\f\f\f\n2\ndk; \u008513\u0086\nwhere the angular parts of the spatial integral have been evaluated to\ngive \u000elnlo . ’lo is a bound atomic orbital while Rlo \u0085k; r\u0086 is the photo-\nelectron ®nal state. In numerical work we take the initial states from\ntables by Clementi & Roetti (1974) while the photoelectron ®nal state\nmay be easily calculated from the SchroÈ dinger equation in the\nHartree approximation using a standard Runge±Kutta routine.\nA photon incident on an atom may excite electrons from any\noccupied core state, ’i, provided that !> j!ij. To compare directly\nwith experiment, we have therefore weighted the probability of\nexciting a secondary electron given that the photoelectron is from\nstate ’i with the probability that the photon is absorbed by the\nelectron in state ’i. Thus \u0016\ni\no is the contribution to the total atomic\nabsorption coef®cient, \u0016o, from all electrons in the initial state ’i.\nIn EXAFS experiments, where the initial photoelectron state is\nknown, the\nP\ni \u0016\ni\no=\u0016o term in the equation above may be removed to\ngive P\u0085!\u0086, the contribution to the secondary excitation probability\nfrom a given edge. Only those photoelectrons which do not excite\npassive electrons into the continuum contribute to the EXAFS signal,\nthus the amplitude reduction factor is simply the probability that\nnone of the secondary electrons are excited,\ns2o\u0085!\u0086 \u0088 1 ÿ P\u0085!\u0086: \u008514\u0086\nJ. Synchrotron Rad. (2003). 10, 120±124 Roy and Gurman \u000f Multiple-electron excitation in X-ray absorption 121\nresearch papers\nelectronic reprint\nresearch papers\n122 Roy and Gurman \u000f Multiple-electron excitation in X-ray absorption J. Synchrotron Rad. (2003). 10, 120±124\n3. Results\nIn this section we calculate the secondary electron excitation prob-\nabilities using equation (13) and compare with experimental data for\nthe neon L edge and argon K edge. We also examine the energy-\ndependent amplitude reduction factor and calculate an example\nEXAFS spectrum for copper. We choose these systems primarily\nbecause of the availability of experimental data, but also to demon-\nstrate the ¯exibility of the method: the secondary excitation prob-\nabilities may be easily calculated for any absorption edge of any\nelement.\n3.1. Secondary electron excitation probabilities\nFig. 1 compares calculated and measured shake-off probabilities\nfor neon following an L-edge photoionization. The magnitudes of the\ncalculated results agree fairly well with the experimental data over\nthe whole of the energy range investigated, certainly to the level of\nscatter in the various experimental results. The calculated result for\nthe neon L edge matches the data well at low energies and appears to\nexhibit the correct energy dependence up to a photon energy of\n\u0018300 eV. The theoretical result has not, however, reached its sudden\nlimit even by 700 eVabove threshold but gives shake-off probabilities\nwhich are still rising with energy. This could be due to a fault in\nour model dielectric function. With the simpli®ed single plasmon\npole, LDA, dielectric function [equation (5)] it is possible that we\nare under-screening the core hole at high primary photoelectron\nenergies.\nFig. 2 shows the shake-off probabilities against photon energy\nfollowing an argon K-edge photoionization. The experimental results\n(points with error bars) have been measured by Armen et al. (1985)\nwhile the dotted line is reproduced from Roy et al. (2001). The\ncalculated result, using the screened core hole, gives a reasonable\napproximation to the measured data although the energy dependence\nis not as good as for the neon L edge. Again, the calculated excitation\nprobabilities are still rising at high photoelectron energies where we\nmight have expected them to have reached their sudden limit. Over\nthe whole of the energy range investigated the screened core hole\nresult is not as good as the simple Thomas approximation result from\nthe previous paper. However, the screened core hole result appears\nto better match the energy dependence of the experimental data at\nlow energies, up to about 70 eV above the edge.\n3.2. Amplitude reduction factor\nFrom equation (14) we can calculate the energy-dependent\namplitude reduction factor. To obtain the total loss factor for the\nEXAFS amplitude we must also account for extrinsic losses to the\nphotoelectron beam at the scattering atom and in the medium in\nbetween the central and scattering atoms. We do this by multiplying\nby a mean-free-path term, exp\u0089ÿ2\u0085r1 ÿ ro\u0086VPI=k\u008a, where r1 is the\ndistance to the scattering atom, ro is the muf®n tin radius of the\ncentral atom and VPI is the magnitude of a constant imaginary\npotential, usually taken to be 4 eV.\nOnce we have obtained the total loss factor we can compare\nEXAFS amplitudes using the screened core hole amplitude reduction\nfactor with those found experimentally and those calculated using the\nstandard Hedin & Lundqvist (1969) exchange and correlation\npotential used in most current EXAFS data-analysis programs [e.g.\nEXCURV98 (Binsted, 1998)]. This comparison is shown in Figs. 3 and\n4 for copper.\nThe Daresbury program EXCURV98 was used to calculate an\nEXAFS spectrum for Cu foil with both the Hedin±Lundqvist (solid\nline) and the X\u000b potentials. We used only the ®rst shell of scattering\natoms in order to obtain an unambiguous value for the distances used\nin the mean-free-path term. The re®ned ®t gave a nearest-neighbour\ndistance of r1 = 2.541 \u0006 0.006 AÊ , a ®rst-shell coordination number of\nn1 = 11.3 \u0006 1.5, a Fermi energy of Ef = ÿ13.2 \u0006 0.8 eV and a Debye±\nWaller factor of a1 = 0.016 \u0006 0.002 AÊ 2. These parameters were then\nused as input to calculate the spectra using the real X\u000b potential\nwhich includes no losses.\nFig. 3 shows a direct comparison between loss factors calculated\nusing the screened core hole and those given by the Hedin±Lundqvist\npotential. To obtain the data points we have ratioed the peak heights\nof the EXAFS spectra calculated with the Hedin±Lundqvist potential\nto the equivalent peak heights of the spectra calculated with the X\u000b\npotential. The solid line shows the result for the loss factor calculated\nFigure 1\nThe probability of secondary electron excitation as a function of photon\nenergy following the creation of a photoelectron from the L shell in neon. The\nsolid line shows the result calculated using equation (13). The points are\nexperimental data: diamonds from Bartlett et al. (1992), crosses from Samson\net al. (1992), open squares with error bars from Holland et al. (1979), crosses\nwith error bars from Wight & Van der Viel (1976) and triangles with error bars\nfrom Carlson et al. (1968).\nFigure 2\nThe probability of secondary electron excitation as a function of photon\nenergy for the argon K-edge. The points are experimental data from Armen et\nal. (1985). The solid line shows the result calculated using a screened core hole\npotential [equation (13)] while the dashed line is reproduced from Roy et al.\n(2001).\nelectronic reprint\nusing the screened core hole and multiplied by the appropriate mean-\nfree-path term to describe the losses outside of the central muf®n tin.\nWithin the range of an EXAFS spectra the model energy-depen-\ndence calculation gives reasonable agreement with the losses\nobtained using the Hedin±Lundqvist potential, at least to the \u000610%\nlevel required by EXAFS calculations. The energy dependence of the\ntotal calculated loss factor is unphysical at small k because of the\nconstant value for VPI used in the mean-free-path term. This\ncompletely kills the EXAFS as k ! 0. To model the mean-free-path\nterm more accurately we need an energy-dependent VPI , the simplest\nform being one which simply cuts off at the binding energy of the\nmost weakly bound state. Below this energy, no inelastic scattering is\npossible and thus we obtain no losses to the EXAFS.\nIn Fig. 4 we compare calculated EXAFS spectra for copper metal.\nTo obtain the solid curve we multiply the X\u000b EXAFS spectra with the\ncalculated energy-dependent loss factor and by a mean-free-path\nterm, with the values of the parameters as given above. The dashed\nline is the best-®t curve to the experimental data (dotted line) ®tted\nusing EXCURV98 with the Hedin±Lundqvist potential and including\nonly a single shell of scattering atoms. The two methods of calculation\nappear to agree fairly well, although the agreement with experiment\nis poor because we have ®tted using only a single shell of scattering\natoms to provide an unambiguous description of the mean-free-path\nterm. The loss factor calculated using a screened core hole is certainly\nmore accurate than the constant s2o and VPI loss factors used\nhistorically.\n4. Conclusion\nIn this paper we have used time-dependent perturbation theory and a\nmodel core-hole±photoelectron potential, V\u0085r\u0086, to obtain results for\nthe secondary electron shake-off probabilities as a function of photon\nenergy above the X-ray absorption edge.\nWe found the results to agree reasonably well with experiment.\nThe energy dependence of the shake-off probabilities is, however, not\nquite correct. The dielectric function used appears to underestimate\nthe screening at high photoelectron energies, leading to secondary\nelectron excitation probabilities which are too large in this energy\nregion.\nThe magnitudes obtained are, however, generally within the\nexperimental error over the region of energy of interest in EXAFS.\nUsing this method to generate an energy-dependent loss factor for\nEXAFS calculations would appear to give results almost as good as\nthose obtained with the Hedin±Lundqvist potential; the advantage\nbeing that data-analysis programs using only real scattering potentials\nare relatively simple to write and maintain compared with those\nwhich use complex scattering potentials, especially when multiple\nscattering must be taken into account. The Dirac±Hara exchange\npotential is known to give better phase shifts for EXAFS purposes\nthan the real part of the Hedin±Lundqvist potential (Chou et al.,\n1987). Using this real scattering potential and an energy-dependent\nloss factor such as that described here we would expect to obtain\ngood EXAFS spectra without the complications of the complex\nphase-shift approach.\nThe calculation using a screened core hole is not as accurate as the\nresults obtained with the time-dependent model discussed in the\nprevious paper (Roy et al., 2001). The current method, however, has\nthe advantage that it does not include `®ddle factors'. It may point the\nway to a more accurate but still physically intuitive description of the\nloss factors, possibly using a more accurate form of the dielectric\nfunction.\nReferences\nArmen, G. B., Aberg, T., Karim, Kh. R., Levin, J. C., Crasemann, B., Brown,\nG. S., Chen, M. H. & Ice, G. E. (1985). Phys. Rev. Lett. 54, 182±185.\nBartlett, R. J., Walsh, P. J., He, Z. X., Chung, Y., Lee, E. M. & Samson, J. A. R.\n(1992). Phys. Rev. A, 46, 5574±5579.\nBinsted, N. (1998). EXCURV98: Computer Program for EXAFS Data\nAnalysis. CLRC Daresbury Laboratory, Daresbury, Warrington WA4\n4AD, UK. (http:\/\/srs.dl.ac.uk\/xrs\/Computing\/Programs\/excurv97\/e61.htm.)\nCarlson, T. A., Nestor, C. W., Tucker, T. C. & Malick, F. B. (1968). Phys. Rev.\n169, 27±36.\nCarter, S. L. & Kelly, H. P. (1977). Phys. Rev. A, 16, 1525±1534.\nChang, T. N. & Poe, R. T. (1975). Phys. Rev. A, 12, 1432±1439.\nJ. Synchrotron Rad. (2003). 10, 120±124 Roy and Gurman \u000f Multiple-electron excitation in X-ray absorption 123\nresearch papers\nFigure 4\nk3-weighted EXAFS spectra for copper foil. The solid curve shows the spectra\nobtained using the real X\u000b potential in EXCURV98 multiplied by the loss\nfactors calculated using a screened core hole. The dashed curve shows the\nresult calculated with the Daresbury program EXCURV98 using the Hedin±\nLundqvist exchange potential. The dotted line shows the experimental data\nfor comparison.\nFigure 3\nEXAFS loss factors for copper. The points are obtained by ratioing the\nEXAFS peak heights calculated using the Hedin±Lundqvist potential, which\nempirically includes all the losses, and the X\u000b potential, which includes none.\nThe solid line is the loss factor calculated using the screened core hole model.\nelectronic reprint\nresearch papers\n124 Received 15 March 2002 \u000f Accepted 13 November 2002 J. Synchrotron Rad. (2003). 10, 120±124\nChou, S. H., Rehr, J. J., Stern, E. A. & Davidson, E. R. (1987). Phys. Rev. B, 35,\n2604±2614.\nClementi, E. & Roetti, C. (1974). Atom. Data Nucl. Data Tables, 14, 177±\n478.\nFujikawa, T., Hatada, K. & Hedin, L. (2000). Phys. Rev. B, 62, 5387±5398.\nGadzuk, J. W. & Sunjic, M. (1975). Phys. Rev. B, 12, 524±530.\nGradsteyn, I. S. & Ryzhik, I. M. (1965). Tables of Integrals, Series and\nProducts. New York\/London: Academic Press.\nGurman, S. J. (1983). J. Phys. C, 16, 2987±3000.\nHasnain, S. S. (1990). Editor. Synchrotron Radiation and Biophysics.\nChichester: Ellis Horwood.\nHayes, T. M. & Boyce, J. B. (1982) Solid State Phys. 37, 173±351.\nHedin, L. (1989). Physica B, 158, 344±346.\nHedin, L. & Lundqvist, S. (1969). Solid State Phys. 23, 2±181.\nHolland, D. M. P., Codling, K., West, J. B. & Marr, G. V. (1979). J. Phys. B, 12,\n2465±2484.\nNatoli, C. R. (1995). Physica B, 209, 5±10.\nNewville, M., Livins, P. & Yacoby, Y. (1993). Phys. Rev. B, 43, 14126±14131.\nNoguera, C. & Spanjaard, D. (1981). J. Phys. F, 11, 1133±1149.\nPress, W. H., Flannery, B. P., Teukolsky, S. A. & Vetterling, W. T. (1992).\nNumerical Recipes, The Art of Scienti®c Computing. Cambridge University\nPress.\nRehr, J. J., Stern, E. A., Martin, R. L. & Davidson, E. A. (1978). Phys. Rev. B,\n17, 560±565.\nRoy, M. & Gurman, S. J. (1997). J. Phys. IV, C2 151±152.\nRoy, M. & Gurman, S. J. (2001). J. Synchrotron Rad. 8, 1095±1102.\nRoy, M., Lindsay, J. D., Louch, S. & Gurman, S. J. (2001). J. Synchrotron Rad. 8,\n1103±1108.\nSamson, J. A. R., Bartlett, R. J. & He, Z. X. (1992). Phys. Rev. A, 46, 7277±\n7280.\nThomas, T. D. (1984). Phys. Rev. Lett. 52, 417±420.\nTyson, T. A. (1991). PhD thesis, Stanford University, USA.\nTyson, T. A., Hodgson, K. O., Natoli, C. R. & Benfatto, M. (1992). Phys. Rev.\nB, 42, 5997±6019.\nVatai, E. (1988). Phys. Rev. A, 38, 3777±3780.\nWight, G. R. & Van der Viel, M. J. (1976). J. Phys. B, 9, 1319±1327.\nelectronic reprint\n"}