{"doi":"10.1080\/14650041003717517","coreId":"65120","oai":"oai:dro.dur.ac.uk.OAI2:6843","identifiers":["oai:dro.dur.ac.uk.OAI2:6843","10.1080\/14650041003717517"],"title":"Thinking territory historically.","authors":["Elden, Stuart"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-10-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65120.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6843\/1\/6843.pdf","pdfHashValue":"f50512d119e1c99ff6074a2e18f023d780c7dbfe","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6843<\/identifier><datestamp>\n      2012-06-20T14:21:28Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Thinking territory historically.<\/dc:title><dc:creator>\n        Elden, Stuart<\/dc:creator><dc:publisher>\n        Routledge<\/dc:publisher><dc:source>\n        Geopolitics, 2010, Vol.15(4), pp.757-761 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6843<\/dc:identifier><dc:identifier>\n        issn:1465-0045<\/dc:identifier><dc:identifier>\n        issn: 1557-3028<\/dc:identifier><dc:identifier>\n        doi:10.1080\/14650041003717517 <\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6843\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1080\/14650041003717517 <\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6843\/1\/6843.pdf<\/dc:identifier><dc:rights>\n        This is an electronic version of an article published in Elden, Stuart (2010) 'Thinking territory historically.', Geopolitics., 15 (4). pp. 757-761. Geopolitics is available online at: http:\/\/www.informaworld.com\/10.1080\/14650041003717517 with the open URL of your article.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1557-3028","1465-0045","issn:1465-0045"," 1557-3028"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n24 November 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nElden, Stuart (2010) ’Thinking territory historically.’, Geopolitics., 15 (4). pp. 757-761.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1080\/14650041003717517\nPublisher’s copyright statement:\nThis is an electronic version of an article published in Elden, Stuart (2010) ’Thinking territory historically.’,\nGeopolitics., 15 (4). pp. 757-761. Geopolitics is available online at:\nhttp:\/\/www.informaworld.com\/10.1080\/14650041003717517 with the open URL of your article.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n 1 \nThinking Territory Historically \n \nIt is somewhat ironic, given the paucity of conceptual work on territory, that one of the key pieces that does \ntheorise the term should so often be seen as warning us away from it.\n1\n It should, of course, go without \nsaying that territory itself is not a trap. Rather, it is certain ways of thinking about territory, particularly \nthose largely uncritical assumptions of International Relations and International Political Economy, that is \nthe problem. Those assumptions, which Agnew skilfully unpicked, actually require more, not less, work on \nterritory. We need to investigate not simply the implications of thinking within this trap—how it constrains \nour thinking, and hamstrings our potential for critique—but how it is produced. What we do when we \naccept the territorial trap is to buy-into a state-centred narrative that naturalises and normalises this way of \nthinking.\n2\n \n \nWhat do we mean when we talk of territory? There seem to be two dominant definitions in the literature. \nOne sees a territory as a bounded space, a container, under the control of a group of people, nowadays \nusually a state. The other sees a territory as an outcome of territoriality, a human behaviour or strategy. \nThese two definitions are, of course, not mutually exclusive.\n3\n Both are mentioned, en passant, in Agnew‘s \narticle. Yet neither definition really addresses the kinds of questions that Agnew is asking us to consider. \nHow did boundaries get drawn? Why should the space that they enclose be thought of as exclusive and \nlimited? Why are boundaries seen as dividing one polity from another, and therefore domestic from foreign \npolitics? Why do certain groups claim a monopoly of power within those lines, and how do they continue \nto hold this, and then later receive a legal basis for those claims? Why do those that wish to challenge this \nsituation—self-determination movements, for instance—not want a different system but their own stake \nwithin it? Why, today, are boundaries largely seen as fixed? In the argument being made here, territory \nmust be conceived as an historically and geographically specific form of political organization and political \nthought. It simply cannot be taken for granted, nor approached through the notion of territoriality, which \nlacks the historical and geographical specificity of territory, both as a practice and a form. \n \nIn a piece published the year after ‗The Territorial Trap‘, but much less well-known, Agnew provided an \ninteresting gloss on this argument.\n4\n He was critical of two key assumptions that shaped debates in the mid \n1990s: the idea that social science had neglected space; and that there was a ‗geographical turn‘ taking \nplace. Rather than being ‗spaceless‘, he suggested, social science had long been filled with geographical \nterms and assumptions. One of these, of course, was the territorial trap. But, he argued, the reason that this \nthinking had become static and unable to cope with dynamics, change and transition was that ―social \nscience has been too geographical and not sufficiently historical, in the sense that geographical assumptions \nhave trapped consideration of social and political-economic processes in geographical structures and \ncontainers that defy historical change‖.5 \n \nOne way out of the territorial trap, then, is a historical investigation of how it came about. Agnew makes \nthe importance of this clear in the piece, but it has tended to be underplayed in those analyses that have \ncome in its wake.\n6\n While such a historical investigation could be done by tracing the ways that IR and IPE \nscholars have assumed things about, rather than thought about, territory, the way I am trying to pursue it is \nto trace the emergence of the term within Western political thought. This is generally done within the early \nmodern period—Hobbes, Locke, Westphalia, etc.—that is seen as the time of the birth of territorial states \nand the international system. As I have argued elsewhere, at this time, the linkage between territory and \nsovereignty can be found most clearly articulated in the work of Leibniz.\n7\n But it is important to realise that \nthe particular histories of specific territorial states postdates the articulation of the idea, which was worked \nthrough in inchoate form some time earlier. \n \nAlthough the word ‗territory‘ regularly appears in translations of Thucydides, Aristotle, Caesar and Tacitus, \nthe Greek khora (in its unstressed sense of land, rather than the philosophical sense it has in Plato‘s \nTimaeus) or the Latin terra invoke a rather different set of possibilities. For those relatively rare \ninvocations in classical Latin of the term territorium, in Cicero, for instance, this was the land belonging to \na town or other community. It was understood as a possession, of relatively small scale, rather than as an \nobject of political rule. It is only in the mid-fourteenth century, with the rediscovery of Roman law in the \nItalian city-states, that the notion of territorium became explicitly tied to that of jurisdiction. The actions of \nan individual merchant, for instance, were bound by the laws of the place he was in, rather than by who he \n 2 \nwas. This was a crucial shift from the personality of law to the territoriality of law.\n8\n This idea was of great \nbenefit to the secular political theorists who were trying to articulate the scope of political rule in \nopposition to the universalising aspirations of the Pope. Ruling on his own involvement in internal French \npolitics, Pope Innocent III in 1202 had declared that ―the king recognised no superior in temporal matters‖.9 \nWhile Innocent was trying to stress that he still had supremacy in spiritual matters, he was outlining a \nmodel that the secular theorists would soon adopt. Jurists on behalf of the King then articulated his power \nin terms parallel with that of the Holy Roman Emperor—within his kingdom, the King had the same \npowers as the Emperor in his Empire.\n10\n Fusing these two ideas together meant that the king was claiming a \nsupremacy of temporal power within his kingdom—a spatial extent of power, a power which would later \nbecome theorised as sovereignty. The Emperor, the King or later the city-state held supremacy within their \nborders. Theirs was a geographically restricted power, but within those areas they held the ultimate control.  \n \nAs Agnew hints in ‗The Territorial Trap‘, this is still some way from a modern state system of clearly \ndemarcated territories. The production of that system was worked out, both in the Europe where these ideas \nemerged and in divisions of the colonised world, over the next several centuries. While the idea that the \nruler had a monopoly of power within those boundaries became widely accepted, what those limits were \nwas not yet fixed. Kingdoms, empires, and, later, states, could conquer land through war or acquire it \nthrough purchase, or be punished by its loss in punitive peace settlements. It was not until the early \ntwentieth century that international conferences attempted to cement the territorial boundaries of states, \nbeginning in Western Europe with the 1925 Locarno Treaties, and then codified in the United Nations \nCharter.\n11\n Thus the international legal notion of territorial integrity brings together two distinct ideas—\nterritorial sovereignty and territorial preservation. These terms have separate histories and their fusion was \nan attempt to create a stability in the post-World War II world. Today, with notions of humanitarian \nintervention and contingent sovereignty, they are being separated again. Boundaries may remain fixed, and \nconsiderable efforts may be undertaken to preserve existing territorial settlements—witness the efforts in \nIraq and Afghanistan to prevent their breakup—yet the sovereignty within them is held to be dependent on \nfollowing particular codes of behaviour.\n12\n If the latter explains the beginning of the wars launched by the \nUSA and its allies; the former partially accounts for their continued presence in those states. \n \nThis kind of historical approach, of which these overview points merely hint at the complexity, would seem \nanother way to approach the challenges Agnew laid down fifteen years ago. Territory, both as a concept \nand as a political reality, requires much more work and analysis if we are to understand its contemporary \nlimits and its historical and geographical conditions of possibility and specificity. Territory needs to be seen \nin relation to, but also in distinction from, two other terms, which themselves deserve careful analysis: land \nand terrain.\n13\n Territory as a political question is not simply political-economic or political-strategic, but \nrelates to developments in the law and the history of techniques such as land-surveying and cartography. \nTerritory is, to borrow Foucault‘s term, a political technology. Territory also needs to be seen in relation to \nthe category of ‗space‘, the history of which is now, post-Lefebvre, widely accepted. Territory is, clearly, \nnot the only form of state space, much less political space. But it remains an important one. It is precisely \nbecause territory is a limited, historically specific, and non-exclusive way of spatial ordering, that it needs \nto be interrogated more thoroughly. All too often, and clearly contrary to Agnew‘s intent, the territorial trap \nhas been avoided by being ignored, not by being critically interrogated. Rather we should ask how \nparticular territorial settlements are produced, and how states operate in ways that normalise and perpetuate \nthis spatial order of things. And, more generally, why have we become inured to this sense of territory as \nsomething politically fixed and conceptually static? This kind of historical conceptual examination of the \nstate of territory might enable us to move beyond ‗the territorial trap‘ rather than simply avoid it, because it \nmay help us to see how that trap was produced. \n \n 3 \nNotes \n \n1\n  John Agnew, ―The Territorial Trap: The Geographical Assumptions of International Relations \nTheory‖, Review of International Political Economy, Vol 1, 1994, pp. 53-80. \n2\n  This is an argument that Neil Brenner and I have made at length in ―Henri Lefebvre on State, \nSpace and Territory‖, International Political Sociology, Vol 3, 2009, forthcoming.  \n3\n  The best work on territory, to my mind, remains Jean Gottmann, The Significance of Territory, \nCharlottesville: University Press of Virginia, 1973. I have also learned a great deal from two \nunfortunately untranslated books: Paul Alliès, L’invention du territoire, Grenoble: Presses \nUniversitaires de Grenoble, 1980; and Claude Raffestin, Pour une géographie du pouvoir, Paris: \nLibraires Techniques, 1980. The key work on territoriality is Robert D. Sack, Human \nTerritoriality: Its Theory and History, Cambridge: Cambridge University Press, 1986. \n4\n  John Agnew, ―The Hidden Geographies of Social Science and the Myth of the ‗Geographical \nTurn‘‖, Environment and Planning D: Society and Space, Vol 13, 1995, pp. 379-80. \n5\n  Agnew, ―The Hidden Geographies of Social Science and the Myth of the ‗Geographical Turn‘‖, p. \n379 \n6\n  See Agnew, ―The Territorial Trap‖, p. 54. This is also highlighted in Reid-Henry‘s introduction to \nthis section. Of recent studies, Rhys Jones,  Peoples\/States\/Territories: The Political Geographies \nof British State Transformation, Oxford, Blackwell, 2007 is much more successful than, for \nexample, Saskia Sassen, Territory, Authority, Rights: From Medieval to Global Assemblages, \nPrinceton: Princeton University Press, 2006. See also Agnew‘s own Globalization and \nSovereignty, Lanham: Rowman and Littlefield, 2009; and  Alexander B. Murphy, ―The Sovereign \nState System as Political-Territorial Ideal: Historical and Contemporary Considerations‖, in \nThomas Biersteker and Cynthia Weber (eds.), State Sovereignty as a Social Construct, \nCambridge: Cambridge University Press, 1996, pp. 81-120.. \n7\n  See Stuart Elden, ―Missing the Point: Globalisation, Deterritorialisation and the Space of the \nWorld‖, Transactions of the Institute of British Geographers, Vol 30, 2005, pp. 8-19. \n8\n  ‗Territoriality‘ here, of course, means a condition of territory, rather than the more active \nconnotation that has increasingly replaced that older meaning. The key figure here is Bartolus of \nSaxoferrato. On his work see, particularly, Francesco Maiolo, Medieval Sovereignty: Marsilius of \nPadua and Bartolus of Saxoferrato, Delft: Eburon, 2007. \n9\n  Innocent III, ―Per Venerabilem‖, in D. Carl Mirbt (ed.), Quellen zur Geschichte des Papsttums \nund des Römanischen Katholizismus, Tübingen: J.C.B. Mohr, Vierte Auflage, 1924, pp. 175-7; \ntranslated in Brian Tierney, The Crisis of Church and State 1050-1300, Toronto: University of \nToronto Press, 1988, pp. 136-8. \n10\n  See, for instance the anonymous texts in R.W. Dyson (ed.), Quaestio de Potestate Papae (Rex \nPacificus)\/An Enquiry into the Power of the Pope: A Critical Edition and Translation, Lewiston: \nEdwin Mellon, 1999; and ―A Dispute between a Priest and a Knight‖, Latin and English text, \nedited and translated by Norma N. Erickson, Proceedings of the American Philosophical Society, \nVol 111 No 5, 1967, pp. 288-309. \n11\n  Useful works on these changes include Sharon Korman, The Right of Conquest: The Acquisition of \nTerritory by Force in International Law and Practice, Oxford: Clarendon Press, 1996; and Mark \nW. Zacher, ―The Territorial Integrity Norm: International Boundaries and the Use of Force,‖ \nInternational Organization Vol 55, 2001, pp. 215–30. A terrific recent book on some of the issues \nthat this creates is Linda M. Bishai, Forgetting Ourselves: Secession and the (Im)possibility of \nTerritorial Identity, Lanham: Lexington Books, 2004. \n12\n  This argument is made at much greater length in Stuart Elden, Terror and Territory: The Spatial \nExtent of Sovereignty, Minneapolis: University of Minnesota Press, 2009. \n13\n  See Stuart Elden, ―Land, Terrain, Territory‖, Progress in Human Geography, forthcoming. This is \nan article which develops a conceptual framework for the historical study I am currently \nundertaking. \n"}