{"doi":"10.1016\/j.polgeo.2005.05.001","coreId":"66551","oai":"oai:dro.dur.ac.uk.OAI2:1204","identifiers":["oai:dro.dur.ac.uk.OAI2:1204","10.1016\/j.polgeo.2005.05.001"],"title":"New spaces of citizenship? Rethinking gendered participation and empowerment in South Africa.","authors":["McEwan,  C."],"enrichments":{"references":[],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2005-11-01","abstract":"This paper draws on empirical research in South Africa to explore questions about the exclusionary nature of citizenship, the problems and possibilities of participatory citizenship and its potential reconceptualisation through the lens of gender. The paper examines some of the major debates and policies in South Africa around issues of citizenship, participation and gender and explores why the discursive accommodation of gender equity by the South African government is not fully realised in its attempts to construct substantive and participatory citizenship. It explores some of the emergent spaces of radical citizenship that marginalized groups and black women, in particular, are shaping in response. Findings suggest that whilst there are possibilities for creating alternative, more radical citizenship spaces, these can also be problematic and exclusionary. The paper draws on recent feminist writing to examine the possibilities for rethinking citizenship as an ethical, non-instrumental social status, distinct from both political participation and economic independence. This reframing of citizenship moves beyond notions of ‘impasse’ or ‘hollowness’, challenges the public\/private distinction that still frames many debates about citizenship and considers the emancipatory potential of gendered subjectivity. The paper argues that citizenship is shaped by differing social, political and cultural contexts and this brings into sharp focus the problematic assumption of the universal applicability of western concepts and theories","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66551.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1204\/1\/1204.pdf","pdfHashValue":"fcaa8ee3835019babdb369df3df2bd42cc4689b8","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1204<\/identifier><datestamp>\n      2016-06-14T13:33:06Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        New spaces of citizenship? Rethinking gendered participation and empowerment in South Africa.<\/dc:title><dc:creator>\n        McEwan,  C.<\/dc:creator><dc:description>\n        This paper draws on empirical research in South Africa to explore questions about the exclusionary nature of citizenship, the problems and possibilities of participatory citizenship and its potential reconceptualisation through the lens of gender. The paper examines some of the major debates and policies in South Africa around issues of citizenship, participation and gender and explores why the discursive accommodation of gender equity by the South African government is not fully realised in its attempts to construct substantive and participatory citizenship. It explores some of the emergent spaces of radical citizenship that marginalized groups and black women, in particular, are shaping in response. Findings suggest that whilst there are possibilities for creating alternative, more radical citizenship spaces, these can also be problematic and exclusionary. The paper draws on recent feminist writing to examine the possibilities for rethinking citizenship as an ethical, non-instrumental social status, distinct from both political participation and economic independence. This reframing of citizenship moves beyond notions of ‘impasse’ or ‘hollowness’, challenges the public\/private distinction that still frames many debates about citizenship and considers the emancipatory potential of gendered subjectivity. The paper argues that citizenship is shaped by differing social, political and cultural contexts and this brings into sharp focus the problematic assumption of the universal applicability of western concepts and theories.<\/dc:description><dc:subject>\n        Citizenship<\/dc:subject><dc:subject>\n         Participation<\/dc:subject><dc:subject>\n         Gender<\/dc:subject><dc:subject>\n         Exclusion<\/dc:subject><dc:subject>\n         Empowerment<\/dc:subject><dc:subject>\n         South Africa.<\/dc:subject><dc:publisher>\n        Elsevier<\/dc:publisher><dc:source>\n        Political geography, 2005, Vol.24(8), pp.969-991 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1204<\/dc:identifier><dc:identifier>\n        issn:0962-6298<\/dc:identifier><dc:identifier>\n        doi:10.1016\/j.polgeo.2005.05.001<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1204\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1016\/j.polgeo.2005.05.001<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1204\/1\/1204.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0962-6298","0962-6298"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Citizenship","Participation","Gender","Exclusion","Empowerment","South Africa."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n02 April 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nMcEwan, C. (2005) ’New spaces of citizenship ? rethinking gendered participation and empowerment in South\nAfrica.’, Political geography., 24 (8). pp. 969-991.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1016\/j.polgeo.2005.05.001\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n 01 April 2008 \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n \nMcEwan, C. (2005) 'New spaces of citizenship ? rethinking gendered participation and \nempowerment in South Africa.' , Political geography., 24 (8), pp. 969-991. \n \nThe attached paper is the final author-created version of the above publication, and \nincorporates referee comments.  \n \nThe definitive version is available at: \n \nhttp:\/\/dx.doi.org\/10.1016\/j.polgeo.2005.05.001 \nNew Spaces of Citizenship  Political Geography \n \n \n \n \nNEW SPACES OF CITIZENSHIP? RETHINKING GENDERED PARTICIPATION \nAND EMPOWERMENT IN SOUTH AFRICA \n \n \nCheryl McEwan \nDepartment of Geography \nUniversity of Durham \nScience Site \nSouth Road \nDurham DH1 3LE \nTel: 0191 3341941 \nFax: 0191 3341801 \nEmail: cheryl.mcewan@durham.ac.uk \n \n \nACKNOWLEDGEMENTS \nI would like to thank Ash Amin, Jane Pollard and three anonymous referees for their \ngenerous and constructive comments on a draft of this paper – the usual disclaimers \napply. The research upon which this paper is based was funded by ESRC \n(R000223286).\n 1\nNew Spaces of Citizenship  Political Geography \nABSTRACT \nThis paper draws on empirical research in South Africa to explore questions about the \nexclusionary nature of citizenship, the problems and possibilities of participatory \ncitizenship and its potential reconceptualisation through the lens of gender. The paper \nexamines some of the major debates and policies in South Africa around issues of \ncitizenship, participation and gender and explores why the discursive accommodation \nof gender equity by the South African government is not fully realised in its attempts \nto construct substantive and participatory citizenship. It explores some of the \nemergent spaces of radical citizenship that marginalized groups and black women, in \nparticular, are shaping in response. Findings suggest that whilst there are possibilities \nfor creating alternative, more radical citizenship spaces, these can also be problematic \nand exclusionary. The paper draws on recent feminist writing to examine the \npossibilities for rethinking citizenship as an ethical, non-instrumental social status, \ndistinct from both political participation and economic independence. This reframing \nof citizenship moves beyond notions of ‘impasse’ or ‘hollowness’, challenges the \npublic\/private distinction that still frames many debates about citizenship and \nconsiders the emancipatory potential of gendered subjectivity. The paper argues that \ncitizenship is shaped by differing social, political and cultural contexts and this brings \ninto sharp focus the problematic assumption of the universal applicability of western \nconcepts and theories. \n \nKEY WORDS \nCitizenship, participation, gender, exclusion, empowerment, South Africa \n 2\nNew Spaces of Citizenship  Political Geography \nINTRODUCTION \nIn the realm of governance there is increasing interest in the nature and significance \nof citizenship and how this might inform the widening of political space and \nenhancing public involvement in decision-making (Otzen 1999; Fung and Wright \n2001; Gaventa 2002a). This has resulted in some cases in new patterns of democratic \npractice, the positing of participatory alternatives to expert-driven processes (Fischer \n2000) and a proliferation of actors and political spaces in which citizen participation \ntakes place. In addition, recent years have witnessed the increasing coalescence of \ndevelopmental concerns with human rights issues, particularly around rights-based \napproaches to development (Ferguson 1999; Mathie and Cunningham 2003; Munro \n1996). In turn, this has brought citizenship into development thinking and refocuses \nattention on participation as a fundamental human and citizenship right (Hausermann \n1998; Jones and Gaventa 2002; Meer and Sever 2004). New spaces of participation, \nformed through opening (sometimes through legislation) new political and policy \nspaces for citizen involvement in governance, have become the “new development \nblueprints” (Cornwall 2002a: 1; Botes and van Rensburg 2000). Global institutions, \nincluding the World Bank, have embraced citizen ‘participation’ and ‘empowerment’ \nas a panacea for addressing inequalities (Wolfensohn 1996) or, as some would argue, \nto foster ‘good’ governance and the spread of neo-liberalism (Duffield 2002).  \nWhilst governments, global institutions and development agencies are \nenthusiastically embracing citizenship, increasingly within western political and \ncultural theory questions are asked about the usefulness of citizenship: who owns, \ndefines and confers it, who partakes of its status and agency and who should. At the \n 3\nNew Spaces of Citizenship  Political Geography \ncore of many of these debates is an apparently unresolved impasse: “the inevitable \nexclusiveness of citizenship, which distinguishes those who have it from those who \ndon’t” (Patton and Caserio 2000:1). In addressing this issue, many theorists seek to \nrehabilitate the idea of citizenship, to extend, reshape and reclaim it (for example, \nBrown forthcoming; Nancy 1991; Castells 2000; Honig 1998; Miller 1998a 1998b; \nRimke 2000; Shapiro 2000). However, others argue that these attempts continue to \neffect exclusions and question if citizenship can ever be properly rehabilitated, has \nany significance beyond symbolism and is, in effect, a “hollow” concept (Heater \n1999). Paradoxically, while there is increasing scepticism about citizenship within \nwestern theory, its perceived centrality to ideas about development and social justice \nmakes a critical understanding of how ideas of citizenship are produced and \ncontested, and with what effects, of particular importance. \nWhat is striking about many of these debates is that despite sustained feminist \ncritiques from a variety of different perspectives (see, for example, de Beauvoir 1952; \nHonig 1992; Lister 1995 1997a 1997b; Pateman 1989; Phillips 1991; Young 1990; \nYuval-Davis 1997), dominant conceptualisations of citizenship still rest largely on an \nabstract, universal and western-centric notion of the individual and are consequently \nunable to recognize either the political relevance of gender or of non-western \nperspectives and experiences. They reduce questions of citizenship to either political \ncitizenship (in terms of an instrumental notion of political participation) or social \ncitizenship (in terms of an instrumental notion of economic independence) \n(Prokhovnik 1998). This paper attempts to counter this western-centricity and the \nabsence of gender, particularly from debates that seek to bring citizenship into \n 4\nNew Spaces of Citizenship  Political Geography \ndevelopment, and to propose a non-instrumental feminist conception through a \ndiscussion of contemporary citizenship issues in South Africa. It attempts to theorize \nwhat citizenship means in the context of post-apartheid South Africa and to those \nmost often marginalized, namely black1 women, exploring questions about the \nexclusionary nature of citizenship and its potential rethinking through the lens of \ngender. \nThe paper draws on in-depth interviews conducted over a nine-month period \nwith civil society organisations and in peri-urban and rural communities in the \nWestern Cape and KwaZulu-Natal.2  It is divided into three sections. First, it \nexamines some of the major debates and policies in South Africa around issues of \ncitizenship, participation and gender, focusing particularly on the failure to fully \nrealise gender equity in substantive and participatory citizenship. Second, it explores \nemergent spaces of radical citizenship that marginalized groups and black women, in \nparticular, are shaping in response to their exclusion from formal spaces of \nparticipation. Third, drawing on recent feminist writing, it examines the possibilities \nfor rethinking citizenship as an ethical, non-instrumental social status, distinct from \nboth political participation and economic independence. This feminist \nconceptualisation allows us to think beyond notions of ‘impasse’ or ‘hollowness’, to \nrethink the public\/private distinction that still frames many debates about citizenship \nand to consider the emancipatory potential of gendered subjectivity as it relates to \nboth men and women. Taking account of understandings and experiences of \ncitizenship in the South African context reveals that citizenship is shaped by differing \n 5\nNew Spaces of Citizenship  Political Geography \nsocial, political and cultural contexts and this brings into sharp focus the problematic \nassumption of the universal applicability of western concepts and theories. \n \nGENDER AND CITIZENSHIP IN SOUTH AFRICA: OFFICIALIZING \nSTRATEGIES AND SPACES OF INVITATION \nThe transition to democracy in South Africa does not mark the endpoint of political \nstruggle, of contestations over the meanings of citizenship, or the eradication of social \nand economic inequalities, including those of gender (Hassim, 1999). As with other \npost-independent states, the struggle for women lies in the (im)possibilities of \ntranslating de jure equality into de facto equality, and of translating state level \ncommitment to gender equality into tangible outcomes at local and individual levels. \nInternational feminist debates suggest that citizenship must encompass more than \nformal political rights, acknowledging that universal inclusion does not exist because \nin reality citizenship is based on power exercised through social, economic and \npolitical structures that perpetuate the exclusion of certain social groups (such as \nwomen and poor people). Lister (1997) argues that civil and political rights are a \nnecessary, if not sufficient, precondition for full and equal citizenship for women, \nwhich need to be buttressed by social rights to weaken the effect of inequalities of \npower in the private sphere. Similarly, Jones (1994) argues that definitions of \ncitizenship need to be broadened beyond formal participation in voting to include \nactions practised by people of specific identities in particular locales. In other words, \nindividuals have agency in the construction and contestation of their citizenship, \nrather than being passive recipients of a pre-determined concept. These \n 6\nNew Spaces of Citizenship  Political Geography \nreformulations offer a valuable starting point from which to consider citizenship in \nSouth Africa. \nSouth African activists recognized that processes of democratic \ntransformation had the potential to create radically different relationships between the \nstate and its citizens than those that had evolved in other post-independence\/post-\nrevolutionary countries (Seidman 1999). Converting this potential into actuality is \nessential in constructing a gender equitable democracy, but questions remain \nconcerning the effectiveness of mainstreaming gender equity (Manicom 2001), how \nconcepts of citizenship are being deployed and how people at grassroots level \nunderstand and experience citizenship. There seem to be both interconnections and \ndisjunctures between state level definitions of participatory citizenship and local level \nunderstandings, experiences and contestations. Questions of how and where \ncitizenship is articulated and women’s political activities take place, and how the state \nhas attempted to create spaces for participatory citizenship, are of significance.  \n \nLegislating for Citizen Participation \nDiscourses of citizenship in South Africa have drawn increasingly on notions of \nparticipation, focusing on “opening up”, “widening”, “broadening” and “extending” \nopportunities for citizens to participate and of “deepening” democratic practice. \nRhetoric is replete with “policy spaces”, “political spaces” or “arenas”, “inclusion” \nand “exclusion” (Cornwall 2002a: 2). Central to these notions is an idea of \nempowerment, which involves: \n 7\nNew Spaces of Citizenship  Political Geography \nmoving out of constrained places and isolated spaces, widening the scope for \naction and multiplying potential sites for engagement, and about growing in \nan organic, self-realizing way – in confidence, in capacity, in wellbeing. \n(ibid.: 2) \nNotions of participation and empowerment, however, can be emptied of radical \noutcomes through appropriation and co-optation. Within mainstream development, \nfor example, empowerment has come to mean the relocation of the poor within the \nprevailing order: “bringing them in, finding them a place, lending them opportunities, \nempowering them, inviting them to participate” (ibid.: 3). Clearly, significant \nconstraints limit empowerment in a context arising from decades of oppression and \npoor economic development for the majority of the population. Of concern is whether \nthe South African government’s enthusiasm for empowerment is designed to bring \nabout social and gender justice or as an instrument for managed intervention and \n‘good governance’. \n In practice, because power relations between people are not addressed, \nparticipation all too often involves only the voices of the vocal few and poor people \nand women, in particular, tend to lose out, being marginalized and overlooked in \n‘participatory’ processes (Shah 1998; Guijt and Kaul Mosse 1995; Cooke and Kothari \n2001; Cornwall 2003; McEwan 2003). Moreover, as has happened with \nmainstreaming gender in development (Goetz 1994), the adoption of participatory \napproaches by powerful international institutions and governments could submerge \nthe more radical dimensions of participatory practice (Cornwall 2003). Radical \ndefinitions of participation as a platform for citizenship not only emphasize \n 8\nNew Spaces of Citizenship  Political Geography \ncommunity involvement in the processes of local development, but also demand that \nsocial development lead to substantive empowerment of community members in \nterms of rights, power, agency and voice. This perceived connection between \ncitizenship, social development and substantive empowerment has been central to \nattempts to reshape citizenship in South Africa but, since prevailing power relations \nare left largely untouched, specific groups remain excluded from participation and \nthus disempowered. \nLike many others, the South African government has attempted to create new \nspaces of participation within its broader vision for socio-economic development by \ndevolving state power to localities through legislation that also requires citizen \nparticipation in local governance (McEwan 2003). This includes the Local \nGovernment Act (2000), which seeks to facilitate the role of local government in \nrectifying social and economic imbalances and community participation in local \ngovernment matters. This creates what might be termed officialized spaces (Bourdieu \n1977), or what Lefebvre (1991) has termed spaces of invitation, by requiring local \ngovernance structures to consult with local community structures through meetings \nand other forums at all stages of decision making in local development planning. It \nalso includes legislation on integrated development planning (IDP), which states that \nprinciples of public participation have: \n[T]o be institutionalized in order to ensure that all residents of the country \nhave an equal right to participate. (Department of Provincial and Local \nGovernment 2001: 9, original emphasis). \n 9\nNew Spaces of Citizenship  Political Geography \nThe impossibility of direct participation of the majority of residents in developmental \nlocal governance processes is recognized; legislation demands that clear rules and \nprocedures are established specifying who is to participate, on behalf of whom, on \nwhich issue, through which organizational mechanism and to what effect (‘structured \nparticipation’). Particular emphasis is placed on the role of civil society organisations \nto facilitate effective structured participation and on accommodating diversity, in \nterms of participation styles and cultures, encouraging the involvement of \n“disadvantaged or marginalized groups” and “gender equity” (ibid.: 10).  \nThe restructured state thus contains elements of direct democratic \nparticipation and elements of deliberative democratic processes. It still requires some \ndelegation to elected officials, but also requires a narrowing of the gap between those \nofficials and the people they are meant to represent and a more radical \nreconfiguration of relationships and responsibilities. In this sense, therefore, it has the \npotential to open up new possibilities for voice, influence and responsiveness, in \naddition to accountability. Of significance, however, is whether citizen participation \nis envisaged as occurring only within the spaces created by legislation, where citizens \nare invited to participate by agents and bodies within formal government. It could be \nargued that underlying the creation of these new spaces for citizen participation is the \nnotion of ‘good governance’, purportedly brought about by decentralization and \nadding another layer of local institutions to already complex local institutional \nlandscapes. Thus South African government’s enthusiasm for participatory \ncitizenship cannot be separated from external discourses, which are sometimes far \nfrom emancipatory in their intention. Is citizenship participation in South Africa, \n 10\nNew Spaces of Citizenship  Political Geography \ntherefore, at risk of becoming an “officializing strategy” (Bourdieu 1977) used to \ndomesticate participation and deflect attention away from other forms of political \naction, and what might gendered effects of this be?  \n \nExclusions and Non-Participatory Spaces \nCitizen participation requires increasing control over and access to resources and \nregulative institutions in society on the part of individuals and groups hitherto \nexcluded from such control. Participation should be an end in itself in deepening \nSouth Africa’s democracy and empowering its citizens. However, evidence suggests \nthat translating policy into meaningful and effective participation at the local level for \nall groups is proving difficult. Legislation is problematic because it is less concerned \nwith the lot of the poor, per se, but with creating more inclusive democratic \ninstitutions and providing the preconditions for fair and inclusive governance, from \nwhich the poor are assumed to benefit (Kehler 2000; FCR 2000; McEwan 2003). As \ndiscussed, it also places emphasis on civil society, but South Africa is generally \ncharacterized by a lack of strong civil society structures that can represent the \ninterests of the majority of community members as well as an apparent lack of \ncapacity amongst citizens to respond meaningfully to complex matters of governance \n(CORE 1998; Liebenberg 1999). In addition, the conception of civil society is not \nnecessarily radical since it is a terrain seen to include social movements, political \nparties and capital; it is thus a site of intense struggle encompassing both those who \nbenefited from apartheid and those who would benefit from substantive \n 11\nNew Spaces of Citizenship  Political Geography \ndemocratization. South African civil society is thus both dynamic and potentially \ncreative but simultaneously deeply divided, with vested interests and exclusions. \nRestructuring assumes that through civil society organizations citizens \nbecome part of the state and less decision-making is delegated to elected \nrepresentatives, but it is unclear how this will actually enable the empowerment of \npoorer and more marginalized people. As Lefebvre (1991) has argued, simply \ncreating these new spaces might not be enough to empower citizens or bring about \ngreater participation in decision-making and resource distribution. One example is the \nCommunity Development Co-operative (CDC) in Gugulethu, Cape Town, a \ncommunity-based organisation formed in 1997 to foster local development by \ninvolving local people and private businesses to generate employment and improved \nhousing and infrastructure. Through their involvement in consultation with CDC, \nlocal women have helped prioritise some development projects, including improved \nhousing and sanitation provision. However, locals do not have direct membership of \nCDC and the Board is made up of councillors and business people (interview with Ms \nNdema, General Manager, 24.1.01). Thus already marginalised residents are at risk of \nexclusion from participation in CDC projects and development in Gugulethu; the \nextent to which residents are setting the agenda for development projects is \nnegligible. Similar problems exist in other township initiatives around Cape Town \nwith surveys revealing a lack of capacity within community leadership regarding \nrules and procedures of local governance, conflict within communities around \nparticipation, the continued exclusion of young people and women, and the failure of \n 12\nNew Spaces of Citizenship  Political Geography \ncommunity representatives to communicate with local residents (Solomon 2000; \nMcEwan 2003).  \nEvidence from Durban is more positive. The Cato Manor Development \nAssociation, for example, consulted regularly with area committees to decide on \nprojects and was based on concepts of ‘bottom-up’ participatory planning and \ninclusive governance (interview with Mxolisi, LED Officer, 20\/6\/01)3; the Warwick \nAvenue\/Grey Street urban renewal project is based on notions of urban citizenship \nand attempts to involve representatives of all groups using the area, including women \ntraders (interview with Richard Dobson, Project Leader, 5\/5\/01; see also Grest 2002; \nMaharaj 1999). However, these new spaces of participation are still situated within \nexisting relations of power and patronage, with traditional lines of authority (mainly \nthrough male elders) still having pre-eminence within communities (Ballard et al. \n2004). How people perceive these spaces and how rules of engagement within them \nshape the nature of participation are also important. One question concerns the extent \nthat institutions modelled on social forms traditionally dominated by male, literate, \nolder elites (as many are in South Africa) can be expected to work for people whose \npoverty and marginalization might have more to do with relations within households \nand communities than their position in wider society (McEwan 2000). In-depth \ninterviews with Xhosa women in the Western Cape, for example, reveal that on the \nwhole they remain excluded from community forums and local council meetings by \ncultural norms and that they perceive these spaces to be male-dominated. They lack \nthe confidence to speak publicly and do not have conviction that their concerns will \nbe taken seriously (Kehler 2000).4 Similar perceptions are also found more broadly \n 13\nNew Spaces of Citizenship  Political Geography \namongst young people of both genders in black communities. There are particular \nlimitations, therefore, on the kinds of participation that can be mobilized in these \nspaces. \nSpaces of invitation made available by the powerful are often discursively \nbounded to permit limited citizen agency (Lefebvre 1991). It is apparent in South \nAfrican communities that spaces purporting to amplify marginalized voices are often \nfilled with gatekeepers, who speak for but not with those whom they represent. \nGovernment can use community-based institutions to shift provisioning burdens onto \nlocal people and dominant groups within communities can use them to reinforce \nexisting power relations; devolving control to ‘the community’ can undermine \nexisting rights of more marginal actors (Agarwal 1997). In South Africa the ways in \nwhich newly created structures connect with existing institutions, either ‘traditional’ \ngovernance structures or local associations, are significant in reproducing existing \nrelations of exclusion that further marginalize groups such as women and young \npeople (Friedman 1993; Roodt 1996). As one respondent put it: \nWomen are expected to keep quiet in meetings. We end up with football \npitches instead of crèches (XM, Khayelitsha, 8.2.01) \nIn addition, community organizations might allow excluded minorities to mobilize \naround their rights but they also produce social forms that have little connection with \nhow people organize or perceive themselves and their common interests (Cornwall \n2000). \nParticipation and citizenship are mediated by existing power relations in \nhouseholds, communities and between groups and citizenship is structured, practised \n 14\nNew Spaces of Citizenship  Political Geography \nand experienced at multiple scales and in diverse spaces. Despite efforts to construct \ninclusive citizenship, therefore, an impasse remains in the prevalence of exclusions \nwithin South African citizenship. Interviews reveal that entrenched gender relations \nensure that black women remain amongst the most marginalized in terms of poverty, \naccess to resources and participation in decision-making at all levels from formal \ngovernance to the household. One respondent argues: \nWe are never asked for our opinion on what should be done…we are not \nasked for the things that we think are important (ZM, Khayelitsha, 9.2.01) \nEven the poorest women are aware of their Constitutional rights to equality, but \nquestions of how to attain this are still met largely with responses ranging from not \nknowing to wry amusement at its apparent impossibility. Therefore, despite its \nsymbolic importance in a post-liberation context, citizenship for many people in \nSouth Africa could be considered in practice a meaningless concept. This is of some \nconcern because relations between citizens and the institutions affecting their lives \nare at risk of becoming shrouded in a crisis of legitimacy, with citizens expressing \ndisillusionment with government and concern over a lack of responsiveness to the \nneeds of the poor (Narayan et al. 2000; McEwan 2003). The 48% turn out at only the \nsecond free local elections in South Africa in 2000 (Local Government Transformer \n2001) suggests that alienation at this level is an issue of immediate concern.  \n \nRadicalizing Spaces of Invitation? \nDespite exclusions in officialized spaces of citizenship, possibilities exist for a more \nsubstantive citizenship to emerge. Foucault’s (1986) notion of the ‘strategic \n 15\nNew Spaces of Citizenship  Political Geography \nreversibility’ of power relations suggests that these are always already sites of \nresistance and contain the productive possibilities for subversion, appropriation and \nreconstitution; spaces of invitation produced by the South African state are also \ninhabited by people with alternative ideas, with potential for expanding the agency of \nthose invited to participate and a different kind of participation than that envisaged. \nOfficialized spaces are often characterized by patterns of interaction becoming \ningrained and unquestioned; hegemonic practices are literally embodied in particular \nplaces. Rules of the game can be reproduced within committees or through \nconsultation, limiting the agency and involvement of people without status or \nconfidence. The reluctance of black women to voice their concerns at public meetings \nis a clear example of how culturally-defined patterns of interaction go unchallenged \nand become embedded in social space, effectively silencing certain groups and \ndenying them the possibilities of full participation. However, some approaches seek \nexplicitly to disrupt this spatial ordering, creating new spaces in which old rules of \nthe game can be challenged and marginalized voices might be heard.  \n There is evidence of this disruption of spatial ordering by activist groups, \nparticularly women’s groups, throughout South Africa. This sometimes involves \nholding meetings in alternative spaces outside of male-dominated and\/or urban \nspaces. For example, in 2001 the Commission on Gender Equality hosted a National \nGender Summit to evaluate and assess its progress in promoting gender equality. In \npreparation, each province conducted pre-summit consultation workshops through \nwhich specific provincial gender issues could be identified and fed into the national \nprocess. However, in response to demands from various women’s organisations, the \n 16\nNew Spaces of Citizenship  Political Geography \nWestern Cape workshop5 was relocated from Cape Town to a community hall in \nZweletemba township outside the rural provincial town of Worcester. Members of \nvarious organisations, including Women on Farms Project, Treatment Action \nCampaign, Centre for Rural Legal Studies and South African Domestic Worker’s \nUnion, argued that this was a more enabling environment in which to discuss matters \naffecting their members.6 Unsettling spatial ordering also involves disrupting patterns \nof interaction within those spaces. For example, several Council-community meetings \nin Cape Town’s townships were interrupted by requests for inclusivity of language \nand translation from English into isiXhosa and Afrikaans. Community meetings in \nboth Western Cape and KwaZulu-Natal open with traditional African greetings, the \nsinging of resistance or liberation songs, toyi-toyiing and prayers. In these ways, \nparticipants assert their presence within spaces of invitation. \nDespite this more radical potential, on the whole it would seem that invited \nspaces of citizenship in South Africa remain problematic in effecting substantive \nparticipation and empowerment. Certainly, new spaces have been activated for \nparticipation of marginalized groups and disability rights, AIDS activism and \nwomen’s groups have been very successful in organizing from the margins to affect \nmainstream policies and institutions (see, for example, Geffen 2001). In some \nmetropolitan areas, such as eThekwini (which includes Durban), there has been a \nconcerted effort by city officials to make IDP participatory and empowering within \nlocal communities. However, evidence in other cities suggests that citizen \nparticipation and empowerment have been largely recast within a market idiom, \nreflecting the impacts of broader processes within international development whereby \n 17\nNew Spaces of Citizenship  Political Geography \nparticipatory citizenship has become an entirely functional and inherently political \nactivity (Cornwall 2002a).  \nIn Cape Town, for example, while the UniCity government is attempting to \nmake community participation a meaningful process, many officials are critical of \nhow the process of engaging communities is practised (FCR, 2000). Some believe \nthat public participation is mostly implemented when local government is required to \nbudget for the forthcoming financial year: \nLast year with the IDP the whole year went by with no meeting, and all of a \nsudden when it came to the budgets there were meetings. (ibid., 22) \nOthers question the commitment to community participation, as envisaged in IDP \nlegislation:  \nOur participation is around particular projects. There is not yet a system – and \nthere seems to be no intention of starting an IDP process – to get community \norganisation to start thinking on a broader basis. (ibid., 22) \nIn one case, IDP sessions in 2000 were poorly attended because the community had \nbeen involved previously, but trust was lost through lack of feedback (ibid., 25). It \nseems that the importance of facilitating community participation is recognised by \nofficials, but is often only undertaken according to legal requirements relating to \nbudgetary processes and accountability and not due to a true commitment to ensure \nparticipation (ibid., 40).  \nHow legislation concerning participatory citizenship is interpreted and \nimplemented at local level is clearly important. Spaces of invitation can be radicalised \n 18\nNew Spaces of Citizenship  Political Geography \nby those wishing to disrupt embedded rules and procedures within them. However, it \nseems that there is a danger in all cases that participation as it has been constructed in \nrecent legislation might become a ‘political technology’ (Foucault 1991), used to \nmanage and control projects and processes, framing the possibilities of popular \nengagement and disciplining subjects and having particular consequences for the \nparticipation of women. In conjunction with these political technologies is the danger \nof rendering illegitimate alternative spaces of citizenship. However, these spaces do \nappear and have some potency in terms of the claiming of citizenship by those who \nshape them.  \n \nEMERGENT SPACES OF ALTERNATIVE AND RADICAL CITIZENSHIP \nThere are distinctions between the spaces of invited or induced participation created \nby governments or government bodies, which might be more about passive \nparticipation and tokenism, and potentially radical spaces at the margins or those \nspaces that people carve out for themselves. There are also distinctions between \npeople’s own perceptions of participative spaces and mainstream versions that might \nsimply be seen as maintaining dominance through incorporation (see Rahman 1995; \nWhite 1996). In response to the institutionalization of notions of empowerment and \ncitizenship in South Africa, alternative spaces of participation are being shaped by \ngroups, organisations and activists that have particular consequences for the nature of \nempowerment and practise of citizenship. \nWhile post-apartheid South Africa has witnessed a radical reconfiguration of \nthe spaces between citizens and institutions that affect their lives, countervailing \n 19\nNew Spaces of Citizenship  Political Geography \ndiscourses continue to fuel more radical forms of empowerment and social action, \nmostly removed from the officializing strategies that might negate other forms of \npolitical action. In contrast to much writing on citizenship participation, one radical \nbody of thought sees it as most effective as collective action within arenas separate \nfrom or against the state (Dryzek 1996; Schönwälder 1997), thus avoiding \nassimilation or co-optation, bureaucratic obstacles and politically motivated \nresistances from within civil society. Feminist theorists have also demonstrated how \nmarginalized groups might occupy existing spaces, create new ones, or revalorize \nnegatively conceived spaces (Price-Chalita 1994) and how marginality itself can be a \nsite of “radical possibility” or “space of resistance” (hooks 1990 341 343). There is, \nof course, a long tradition of this in South Africa and, although the post-apartheid \ncontext has increased the need for civil society groups to work with the state, recent \nyears have seen the emergence of alternative spaces for citizen action. As Lefebvre \n(1991) points out, however, officialized and alternative spaces are not separable. \nWhat happens in one impinges on what happens in the other. Thus, the apparent \nfailure of the South African government to fashion enough spaces for substantive \ncitizenship is creating possibilities for the emergence of spaces of more radical \ncitizenship elsewhere. \nSuch spaces emerge organically out of common interests and concerns \n(Cornwall 2002a), coming into being as a result of popular mobilization, such as \naround identity-based issues, or individuals joining together in common aims, often \narticulated around citizenship rights. These are sites of radical possibility: spaces are \nconstituted by the individuals themselves and are often transient, where durability is \n 20\nNew Spaces of Citizenship  Political Geography \ndependent on people wanting to participate in them. Recent occupations of state- and \nprivately-owned land by South Africa’s homeless people are examples of this kind of \ncitizenship space.7 Water and electricity disconnections, evictions and the seizure of \nproperty have also met with spontaneous country-wide resistance. These struggles are \nbecoming progressively more organized, with strong local, national, and international \nnetworks forming between communities, labour, women’s, youth, environmentalist, \nand other social movements. These are potentially radical and enabling spaces \nbecause the people themselves have chosen to be part of them and are responsible for \ntheir existence.  \nTransient and organic citizenship spaces might also be spaces of resistance, \nbringing together diverse groups of people around particular issues and facilitating \nmore radical kinds of participation. Women’s activist groups are a particularly good \nexample of this in South Africa, bringing together diverse groups of women from \nacross the political, class and ethnic spectrum around specific issues such as \nemployment and housing rights or domestic and sexual violence. These “spaces of \nappearance” (Arendt 1958) are often formed in opposition to existing institutions and \nwithin which the multiplicity of opinions, positions and interests might continually \ndisrupt the possibility of consensus in a “field of agonistic engagement” (Amin \n2004).8 The radical possibilities of these spaces are created by there being enough \nspace between people for them to argue different positions, thus generating political \nfreedom and meaningful realisation of citizenship. They are also “action spaces” \n(Berberton, Blake and Kotze 1998) through which poor people resist, challenge \nconditions and create alternatives.  \n 21\nNew Spaces of Citizenship  Political Geography \nParadoxically, alternative citizenship spaces are rarely inclusive and often rely \non oppositional processes of identity formation for the creation of a common purpose. \nFor example, South African women’s activist groups have proliferated to articulate \nclaims to full citizenship rights and to resist violence and oppression, but they \nexclude men by implication. As Attwood and May (1998) argue, many South African \nmen, especially young blacks, are marginalized through unemployment, social \ninstitutions and the absence of alternative opportunities; their voices and their gender \nissues and concerns are often absent. Their participation as citizens is often equally as \nproblematic as poor women and may be worse because they are not targeted in \ngender sensitive participatory schemes or by NGOs. Therefore, the creation of \nidentity-based participatory spaces might allow marginalized people to organize, but \nthey might also deepen the exclusion of other groups or minorities.  \nAs spaces of appearance, alternative spaces of citizenship lend visibility to \nidentities and interests that are given shape by collective political action; they are, \ntherefore, important spaces for the exercise of citizenship and realization of rights. \nHowever, as Cornwall (2002a) argues, these spaces are increasingly being de-\nlegitimized by governments and development organizations because they do not fit \nwith their preferred channels for citizen voice. They exist outside spaces of invitation \nand thus are deemed threatening and\/or irrelevant. Furthermore, radical intervention \nmight allow for short-term gains - the familiar ‘weapons-of-the-weak’ argument - but \nparticipation in a deliberative process requires longer term engagement. Citizens \nrequire sufficient knowledge to be able to play by the rules, to articulate a position \nand to define a view; participation depends upon the prospect of being listened to and \n 22\nNew Spaces of Citizenship  Political Geography \ntaken seriously. Without these prerequisites, alternative spaces of citizen participation \nand action are limited in what they can achieve. The duration of participation is \nimportant and there are marked contrasts between continuous participation and the \nfleeting democratic moments of elections and social movements that mobilize \ncitizens for a particular purpose and then recede or disappear (Fung and Wright \n2001). \n \nREFRAMING CITIZENSHIP: IDENTITY AND GENDERED SUBJECTIVITY IN \nPUBLIC AND PRIVATE ARENAS \nWhat is missing from the reconfiguration of state and citizen relations in South Africa \nis an understanding of citizenship as an identity and both citizenship and participation \nas situated practices. How people see themselves as citizens and act upon this and \nhow this relates to their understanding of themselves in other aspects of their lives is \nparticularly significant (Werbner and Yuval-Davis 1999; Isin and Wood 1999; Voet \n1998). Thinking about citizenship in this way allows a shift from western-centric \ndiscourses that frame understandings around very particular forms of participation in \nvery specific spaces to considering what citizenship might mean for people in places \nlike South Africa.  \nAs Mouffe (1992 1995 1996) has consistently argued, an individual’s sense of \nidentity and sense of citizenship mutually shape each other. This is borne out clearly \nin South Africa, where interviews reveal that different senses of citizenship are often \nproduced by gendered cultural identities. Dominant discourses around maleness in \nisiXhosa- and isiZulu-speaking communities emphasize formal political capabilities \n 23\nNew Spaces of Citizenship  Political Geography \nand obligations; dominant discourses around femaleness promote the idea that formal \npolitical engagement is neither socially acceptable nor within female capabilities. The \npublic silencing of women such that they are largely passive observers in formal \nspaces of citizen participation is a spatialized construction of identity since the same \nwomen are often very active participants in less formal political spaces, such as street \nand area committees, savings and housing associations and other community groups. \nIdentity is clearly important in radical articulations of citizenship, but equally \npeople’s sense of citizenship can also work to shape their understanding and practice \nof their identity. For example, a woman who understands citizenship as an active \nform of practice and a status that entitles her to advocate for her understanding of her \nrights might work to assert her needs and priorities as a woman in the political sphere \n(Voet 1998; Lister 1997a). In South Africa, positionalities such as domestic worker, \nsex worker, farm worker make the entangled nature of citizenship and identity most \nclear. They are political identities that signify consciousness and group and individual \naction for change around particular conditions. Though some people may understand \nthemselves as citizens but choose not to be active or hold subject positions that inhibit \nan active sense of citizenship, others are conscious of the exclusions produced by the \nsocial construction of their identity and may promote citizenship action for change \n(Jackson 1999; Seidman 1999; McEwan 2000). As a member of the Sex Worker \nEducation and Advocacy Taskforce argues: \nThe decision to become a sex worker is an economic one, but women who \nhave no other choice and do this to feed their families are criminalised by law \n 24\nNew Spaces of Citizenship  Political Geography \nand society. This is unfair. I fight to have this seen as a labour and family \nissue, not a crime (MF, Ceres 5.7.01).  \nInterviews with many black women reveal that their idea of citizenship does \nnot derive primarily from a localized sense of community but from communities of \ninterest. Significant issues identified by respondents include rights to housing and \nemployment, and freedom from violence for them and their children. They mobilize \nwithin their communities around these issues, particularly through public protest, \ngrassroots organisations and self-help groups. Citizenship for these women is also \nculturally defined by familial and communal attachments. Interviews reveal that very \noften their understandings of citizenship are about community and familial roles and \nobligations and it is seen not as simply a relationship with the state, but as a \nrelationship with other people. Although many women are aware of their individual \nrights, they articulate their obligations to their children and the rights of their family \nas more important. The need for access to paid employment, for example, is \narticulated in terms of both an obligation to provide for children and grandchildren \nand the rights of the family to access basic provisions. As one respondent put it: \nGiving women the right to work. This is what we must have. If a woman \ncannot work then how can she be a mother? I have a child and three \ngrandchildren here. I am over 60 but I must be able to work. Who will feed \nthe family otherwise? (AM, Durban 19.6.01)  \nOne might question, then, whether western conceptions of individual rights are \nalways appropriate in South Africa where, for many people: \n 25\nNew Spaces of Citizenship  Political Geography \ncommunity ties and relationships are a better way of expressing their position \nin the world than individual identity. (Meer and Sever 2004: 19; see also \nBulbeck 1998) \nUbuntu, the spiritual foundation of African societies, embodies a worldview in which \n“a person is a person through other persons” (Shutte 1993: 46). Interviews reveal that \nthis notion of selfhood gives rise to a relational understanding of claims and \nobligations as generated through, and embedded within, significant social \nrelationships of the acknowledged community. \nThere is a tension, therefore, between formal constructions of citizenship, \noften based on group and individual rights, and indigenous notions of self-hood. \nHowever, the construction of the connective self is often intimately linked to \npatriarchal social relations; connectiveness is gender-asymmetrical: \nMen, as much as women, are defined by the roles, relationships and \n‘ideologies of belonging’ of their acknowledged communities and reproduce \nthem in their aspirations and behaviour in the public domain. (Kabeer 2002: \n28).  \nIn practice, respondents define their citizenship through activism in community and \nwomen’s groups, explaining their activities in terms of the failure of men to provide \nfor them and of local government to provide adequate resources. Thus they perceive a \nrequirement to take their needs into more formal political arenas. In addition, they \nhave culturally inscribed roles within communities and households, which shape their \ncitizenship practice. Men in the same communities, on the other hand, tend to explain \ncitizenship action in terms of engagement with local government over community \n 26\nNew Spaces of Citizenship  Political Geography \nneeds and state government via traditional leaders. For some feminist theorists (e.g. \nJones, 1994), participation in community politics can be a locus for women’s \nempowerment. Indeed, involvement in community politics in some Latin American \ncountries led to women’s engagement with more formal political activity (Alvarez, \n1990; Jaquette, 1989; Jelin, 1990). However, confining women’s political activity to \ncommunity politics can also be disempowering if this lacks involvement with the \nstate. \nThe current problem for poorer women in South Africa is that while they are \nactive in community-based structures, they still appear largely divorced from \nstructures of governance at the local level. This is partly because of the patriarchal \nnature of both structures of governance and community politics (Robinson 1995; \nGAP\/FCR 1998; Cole and Parnell 2000; McEwan 2003). Women are still unable to \naccess power over resources and decision-making that would make their citizenship \nsubstantive and meaningful. However, this is not uncontested and women continue to \nmobilize in opposition to patriarchal power relations at both national and local levels, \narticulating their demands and empowering themselves around community and youth \nissues, most notably in basic-needs, anti-crime and peace organizations. Moreover, as \nButler (1990) argues, everyday social and cultural practices transform and re-create \ngender relations. Private patriarchies (residing beyond formal law in households, in \nparticular) might prove a hindrance to women’s citizenship but homes and \ncommunities are also places where contestations over citizenship might be more \neffective than state policies in transforming patriarchies. This raises the possibilities \n 27\nNew Spaces of Citizenship  Political Geography \nof reframing citizenship through gendered subjectivity to incorporate new spaces of \ncitizenship practice. \n  \nGendered Subjectivity and Social Justice \nA significant aspect of inclusions and exclusions of citizenship in South Africa is the \nlegacy of colonialism and apartheid and the multiple oppressions that marginalized \ngroups face. While race is no longer the principal line of exclusion defining relations \nbetween individuals and the state, the value systems upon which societies were \nstructured during colonial and apartheid periods remain, to some extent, \ninstitutionalized. Fraser (1997) uses the phrase ‘bivalent collectivity’ to refer to the \neconomic and cultural forms of injustice and disadvantage that interlock, legitimize \nand maintain each other. Despite being interrelated: \ndifferent forms of disadvantage have their own distinct logics and strategic \nresponses. (Kabeer 2000: 86). \nWhere disadvantage is largely economic, people are likely to mobilize around their \ninterests and formulate demands in terms of redistribution. Where disadvantage is \nlargely based on value systems, mobilization is more likely to be around questions of \nidentity and demands formulated in terms of recognition.  \nIn South Africa, this produces a further tension: the logic of addressing \neconomic disadvantage and of calls for redistribution is egalitarian, while the logic of \naddressing identity-based disadvantage and of demands for recognition is diversity. \nThis tension is particularly problematic for those bivalent collectivities, like black \nwomen, disadvantaged by the interlocking dynamics of both resources and valuation. \nIn the light of this, Young’s (1990) notion of social justice has particular pertinence \n 28\nNew Spaces of Citizenship  Political Geography \nin South African citizenship, especially within gender activism. Social justice is \nunderstood in terms of freedom from oppression (constraints on self-development) \nand domination (constraints of self-determination) and enables a conceptualization of \njustice that refers to both redistribution and the development of individual capacities \nand group rights. It requires not only the eradication of differences that construct \nrelations of power, but the creation of institutions that promote and respect group \ndifferences without oppression. Significantly, a great deal of citizenship action in \nSouth Africa, especially by black women, is motivated by the pursuit of social justice. \n Linked to this notion of citizenship as social justice is a requirement to rethink \nthe public\/private distinction to accommodate the idea of citizenship as also practised \nin the private realm. Citizenship should be a “multi-tier concept” that breaks apart the \nassociation of the domestic with the private and the political with the public and is \nrelevant to all aspects of life from the home to the state and international agency \n(Yuval-Davis 1997: 13; see also Fraser 1992). This is, of course, not a new argument; \ncentral to feminist writing about citizenship in the private domain are the exclusions \nproduced through the application of a restrictive notion of ‘the political’, built on a \nrigid separation of public and private spheres. Of significance to this is the long-\ndebated problem that defining citizenship through political participation in formal \npublic spaces serves to occlude other forms of participation (such as community \nwork, traditional meetings and street and area committees) as legitimate expressions \nof citizenship. In essence it excludes people who cannot participate in public affairs \nfrom the accolade of citizenship (Lister 1997a). Drawing a boundary around the \npublic sphere in defining citizenship also raises the problem of how people can \n 29\nNew Spaces of Citizenship  Political Geography \nlegitimately define and demand rights related to issues and actions that take place \nwithin private spaces, such as the home, where citizens may act upon personal ideas \nand notions of morality (McEwan 2000).  \nLister (1997a: 28) distinguishes “political citizenship” from “personal \npolitics” (see also Narayan, 1997), arguing that although the two are dialectically \ninterrelated, “not all politics necessarily counts as citizenship”. She refers to \nPhillips’s (1993) distinction between campaigning in public for men to do their share \nof housework and simply sorting out the division of labour in one’s own home: \nIn the case of the former we are acting as citizens, in the case of the latter, \nwhich is nevertheless significant for citizenship, we are not…(Lister 1997a: \n28) \nProkhovnik (1998) states another side of the argument - that citizenship and public \npolitics should not be conflated, nor should political agency be considered a \nrequirement for full citizenship. She suggests that: \nIt is not that women need to be liberated from the private realm, in order to \ntake part in the public realm as equal citizens, but that women – and men – \nalready undertake responsibilities of citizenship in both the public and the \nprivate realms. (ibid.: 84) \nEvidence from both township and rural communities in South Africa suggests that \nmany women who do not, or are unable to participate in formal structures do \nparticipate in informal networks and forms of decision-making. This also suggests a \nwidening of the spaces in which citizenship can take place since it embraces \nhouseholds and communities. Thus, citizenship ‘in practice’ means more than \n 30\nNew Spaces of Citizenship  Political Geography \nadvocacy, lobbying, campaigning and awareness-raising in civil society \norganisations. Collective struggles can allow women to influence institutions such as \nthe household, market and state and these struggles take place through women’s \norganising in both formal and informal spaces. In the light of this, there is a need to \ntake account of the diverse ways in which South Africans engage in ethically-\ngrounded activities on the basis of their different genders, ethnic and cultural \nbackgrounds in both public and private spheres that characterize their citizenship. Of \nutmost importance is how people themselves view their position and their \ncontribution to the groups to which they belong. As discussed, many black women \nunderstand their citizenship not simply as culturally-prescribed but as ethically-\ngrounded in their perceived household and community roles and their responsibilities \ntowards other community members, women and children. They mobilize to claim \ntheir rights and practise their citizenship around these understandings. \n This feminist conception aims not to make citizenship gender-neutral, but to \ntake account of what citizenship might mean to differently situated women (and \nmen). Citizenship is not simply about political participation but involves ethically-\ngrounded activities undertaken by women, in the private as well as public realms, that \nare relevant to their lives. There is clearly a need to overcome the suppression of \nwomen’s gendered subjectivity in the public realm and to allow for a notion of \ncitizenship that recognizes more fully that women make different choices, but this \ninvolves a broader concept of citizenship than just the ‘political’. Citizens are made \nthrough both status and practice (Prokhovnik 1998); in other words, a social status \n 31\nNew Spaces of Citizenship  Political Geography \n(which black women in South Africa have yet fully to be accorded), and one based on \nthe recognition of the practices in which women as well as men engage.  \nEmphasis on participation and citizenship also necessitates the broadening out \nof what constitutes the ‘political’; politics become as much about what is struggled \nover and by whom as about the conduct of local politics (Amin 2004). As Squires \n(1999) argues, to concentrate on formal political participation alone as evidence of \nactive citizenship is to reproduce masculine assumptions that have worked to erase \nthe significance of women’s informal political participation. Women are political \nactors if ‘political’ is held to include all power-structured relations from the \ninterpersonal to the international. Adopting this broader notion makes it evident that \nwomen have long been political actors and as such are critical in the construction and \nmaintenance of participatory democracy and meaningful citizenship in South Africa. \nThis also addresses gendered subjectivity for men as well as women; it necessarily \nadvocates a reconstructed public\/private distinction that is not dualistic and is a \nnotion of citizenship that is “at once intimate and political” (Prokhovnik 1998: 97). \nMoreover, it should encourage institutions (including those involved in governance \nand development) to see marginalized women as valuable sources of information with \nthe potential for agency in policy-making. Such a reframing, I suggest, is critical in \nSouth Africa, where discursive emphasis is placed on participation and substantive \ncitizenship and where there is a particular urgency in making this real. \n \nCONCLUSIONS  \n 32\nNew Spaces of Citizenship  Political Geography \nConventional perspectives on social and political participation see it as defined by \nexternal agencies; citizens in this sense are simply voters or beneficiaries of \ndevelopment projects. This paper has argued that shifting emphasis to citizen \npractices extends participation to autonomous forms of action through which citizens \ncreate their own opportunities and terms of engagement. As Cornwall (2002a) argues, \nthis not only bridges the gap between social and political participation but offers new \nways of configuring the space between and what it means to be a citizen. Enhancing \nparticipation creates new kinds of spaces between, within and beyond the realms of \nstate and civil society and has potential to enhance equality. Discerning what happens \nin these spaces requires knowledge of what happens in practice, who participates, on \nwhat basis, on behalf of whom, with what resources and to what effect.  \n This kind of approach is useful in understanding the disjuncture in South \nAfrica and elsewhere between de jure and de facto, public and private citizenship. It \nhelps explain why women’s citizenship, despite legislative and constitutional \nguarantees, is mediated and diminished by entrenched power relations. It also \nrefocuses attention on the “actual spaces” in which citizenship is expressed, which the \nabstract nature of citizenship leads many writers to neglect (Brown 1995 cited in Isin \nand Wood 1999: 88). This paper has argued that citizenship is a status and practice \nthat is likely to differ across the spaces in which people’s lives are played out (see \nalso Jones and Gaventa 2002); households and communities are as much part of the \nrealm of citizenship as more formal political spaces and women see their participation \nin these spaces as a realisation of their citizenship status. Enhancing participative \ncitizenship requires more than inviting or inducing people to participate or simply \n 33\nNew Spaces of Citizenship  Political Geography \ncollecting voices. It requires that people have access to information around which to \nmobilize to claim or assert their rights, creating spaces for involvement and building \ncapacities for political engagement. Thus, understanding how citizenship is played \nout in practice, for different people, in different contexts, in the different areas of their \nlives, requires learning from citizens themselves and their own understandings, \nexperiences and strategies for change (Jones and Gaventa 2002). Moreover, \ncitizenship is shaped by differing social, political and cultural contexts, which bring \ninto sharp focus the universal applicability of western concepts and theories.  \nA feminist conceptualisation of citizenship as ethically-grounded action in all \nspheres of life, not simply as public participation, perhaps has broader relevance in \nallowing us to think beyond notions of ‘impasse’ or ‘hollowness’ that inflect much of \ncontemporary western theory (which rarely, if ever, takes account of understandings \nor experiences of citizenship in post-colonial or post-liberation contexts, where it is \nhard won, valued and continually reshaped in ways that are perhaps more meaningful \nand innovative that in the west). It also rethinks the public\/private distinction that still \nframes many debates about citizenship and considers the emancipatory potential of \ngendered subjectivity as it relates to both men and women. This has the potential to \nbring the voices of people marginalized by relations of power to often abstract \ndebates about citizenship, both in terms of understanding meanings of citizenship and \nits spatiality. Finally, evidence from South Africa suggests that the impasse in \ncitizenship is not simply articulated around the citizen\/non-citizen binary. While \nprevailing power relations ensure that certain groups, including many black women, \nremain excluded from certain types of participation and thus remain disempowered \n 34\nNew Spaces of Citizenship  Political Geography \n(Staeheli 1994; McEwan 2003), recognition of gendered subjectivity opens the way \nto an acknowledgment of the diversity of citizenship practices (Prokhovnik 1998) and \na more inclusive, non-instrumental and non-dualistic conception of citizenship. \n 35\nNew Spaces of Citizenship  Political Geography \nREFERENCES \nAgarwal, B. (1997) Re-sounding the alert – gender, resources and community action. \nWorld Development 25, 9, 1373-80. \nAlvarez, S. (1990), Engendering Democracy in Brazil. Princeton University Press, \nPrinceton. \nAmin, A. (2004) Regions unbound: towards a new politics of place. Geografiska \nAnnaler 86B, 1, 33-44. \nArendt, H. (1958) The Human Condition. University Of Chicago Press, Chicago. \nAttwood, H. and May, J. (1998) Kicking down doors and lighting fires: The South \nAfrican PPA. In Holland, J. and Blackburn, J. (eds.) Whose Voice? \nParticipatory Research and Policy Change. Intermediate Technology \nPublications, London, pp. 119-130. \nBallard, R., Bonnin, D., Robinson, J. and Xaba, T. (2004) Development and new \nforms of democracy in Durban. Paper presented at Democracy in Durban: \nWorkshop, Open University, 30 July. \n 36\nNew Spaces of Citizenship  Political Geography \nBerberton, C., Blake, M. and Kotze, H. (1998) Creating Action Space: The Challenge \nof Poverty and Democracy in South Africa. David Phillip, Idasa. \nBotes, L. and van Rensburg, D. (2000) Community participation in development: \nnine plagues and twelve commandments. Community Development Journal 35, \n1, 41-58. \nBourdieu, P. (1977) Outline of a Theory of Practice. Cambridge University Press, \nCambridge. \nBrown, M. (forthcoming) Replacing Citizenship: AIDS Activism and Radical \nDemocracy. Guilford, New York. \nBulbeck, C. (1998) Re-Orienting Western Feminisms: Women’s Diversity in a \nPostcolonial World. CUP, Cambridge, \nButler, J. (1990), Gender Trouble: Feminism and the Subversion of Identity. \nRoutledge, London. \nCastells, M. (2000) The Information Age: Economy, Society, and Culture, 2nd edition. \nBlackwell, Oxford. \n 37\nNew Spaces of Citizenship  Political Geography \nCole, J. and Parnell, S. (2000), A Report on Poverty, Gender and Integrated \nDevelopment Planning in South African Municipal Practice. Department of \nProvincial Local Government, Cape Town. \nCooke, B. and Kothari, U. (eds.) (2001) Participation: The New Tyranny. Zed Books, \nLondon. \nCORE (1998) Civil Society and Governance: The Case of South Africa. Unpublished \nmanuscript. \nCornwall, A. (2000) Making a difference? Gender and participatory development. \nIDS Discussion Paper 138. IDS, University of Sussex. \nCornwall, A. (2002a) Making spaces, changing places: situating participation in \ndevelopment. IDS Working Paper 170. IDS, University of Sussex. \nCornwall, A. (2002b) Locating citizen participation. IDS Bulletin 33, 2, 49-58. \nCornwall, A. (2003) Whose voices? Whose choices? Reflections of gender and \nparticipatory development. World Development 31, 8, 1325-42. \nDe Beauvoir, S. (1952) The Second Sex trans. H.M. Parshley. Vintage Books, New \nYork. \n 38\nNew Spaces of Citizenship  Political Geography \nDepartment of Provincial and Local Government (2001) IDP Guide Pack: Overview. \nDPLG, Pretoria. \nDevelopment Research Centre (DRC) on Citizenship, Participation and \nAccountability. South Africa DRC partners \nhttp:\/\/www2.ids.ac.uk\/drccitizen\/partners\/soguwc.htm accessed 18\/06\/03. \nDryzek, J. (1996) Political inclusion and the dynamics of democratization. American \nPolitical Science Review 90, 3, 475-87. \nDuffield, M. (2002) Social reconstruction and the radicalisation of development: Aid \nas a relation of global liberal governance. Development and Change 33, 5, \n1049-71. \nFerguson, C. (1999) Global Social Policy Principles: Human Rights and Social \nJustice. DfID, London. \nFischer, F. (2000) Citizens, Experts and the Environment. The Politics of Local \nKnowledge. Duke University Press, Durham. \n 39\nNew Spaces of Citizenship  Political Geography \nFoundation for Contemporary Research (FCR) (2000) Review: Signs of \nTransformation in IDP Implementation – CAPE Town and Tygerberg \nMunicipalities. FCR, Cape Town. \nFoucault, M. (1991) Governmentality. In  Burchell, G., Gordon, C. and  Miller, P. \n(eds.) The Foucault Effect: Studies in Governmentality. University of Chicago \nPress, Chicago. \nFoucault, M. (1986) Of other spaces. Diacritics – A Review of Contemporary \nCriticism 16, 1, 22-7. \nFraser, N. (1992) Rethinking the public sphere: a contribution to the critique of \nactually existing democracy. In Calhoun, C, (ed.) Habermas and the Public \nSphere MIT Press, Cambridge MA., pp.109-42 \nFraser, N. (1997) Justice Interruptus: Critical Reflections on the Post-Socialist \nCondition. Routledge, New York. \nFriedman, S. (1993) The elusive ‘community’: the dynamics of negotiated \ndevelopment. Cape Town: Centre for Policy Studies, Social Contract Series, No. 28, \nCape Town. \n 40\nNew Spaces of Citizenship  Political Geography \n \nFung, A. and Wright, E. (2001) Deepening democracy: innovations in empowered \nlocal governance. Politics and Society 29, 1, 5-41. \nGender Advocacy Programme and the Foundation for Contemporary Research (1998) \nLocal Government and Gender: A Reality Check. Survey of Selected \nMunicipalities in the Western Cape, GAP\/FCR, Cape Town. \nGaventa, J. (2002a) Towards participatory governance. Currents 28, 29-35. \nGaventa, J. (2002b) Exploring citizenship, participation and accountability. IDS \nBulletin 33, 2, 1-11. \nGeffen, N. (2001) Applying human rights to the HIV\/AIDS crisis. Human Rights \nDialogue 2, 6, 13-4. \nGrest, J. (2002) Urban citizenship and legitimate governance: the case of the greater \nWarwick Avenue and Grey Street urban renewal project, Durban, \nTransformation 48, 38-58. \n 41\nNew Spaces of Citizenship  Political Geography \nGoetz, A-M. (1994) From feminist knowledge to data for development: the \nbureaucratic management of information on women and development. IDS \nBulletin 25, 27-36. \nGuijt, I. and Kaul Shah, M. (1998) Waking up to power, conflict and process. In Guijt \nI. and Kaul Shah, M. (eds.) The Myth of Community: Gender Issues in \nParticipatory Development. Intermediate Technology Publications, London, \npp.1-23. \nHassim, S. (1999) From presence to power: women’s citizenship in a new \ndemocracy. Agenda 40, 6-17. \nHausermann, J. (1998) A Human Rights Approach to Development. Rights and \nHumanity, London. \nHeater, D. (1999) What is Citizenship? Polity Press, Cambridge. \nHemson, D. (2000) Civic structures and unfulfilled desires: Cato Manor and the new \norder. Urban Forum 11, 1, 133-48. \n 42\nNew Spaces of Citizenship  Political Geography \nHonig, B. (1992) Towards an agonistic feminism: Hannah Arendt and the politics of \nidentity. In Butler, J. and Scott, J (eds.) Feminists Theorise the Political. \nRoutledge, London, pp.215-35. \nHonig, B. (1998) Immigrant America: how foreignness solves democracy’s problems. \nSocial Text 56, 16\/3, 2-28. \nhooks, b. (1990) Yearning. Race, Gender and Cultural Politics. South End Press, \nCambridge MA. \nIsin, E. and Wood, P. (1999) Citizenship and Identity. Sage, London. \nJackson, C. (1999) Social exclusion and gender: does one size fit all? European \nJournal of Social Research 11, 1, 125-46. \nJaquette, J. (1989) The Women’s Movement in Latin America. Unwin Hyman, \nLondon. \nJelin, E. (1990) Women and Social Change in Latin America. Zed, London. \nJones, E. and Gaventa, J. (2002) Concepts of Citizenship: A Review. IDS \nDevelopment Bibliography 19. IDS, University of Sussex \n 43\nNew Spaces of Citizenship  Political Geography \nJones, K. B. (1994) Identity, Action, and Locale: Thinking about Citizenship, Civic \nAction, and Feminism. Social Politics 1, 1, 4-29.  \nKabeer, N. (2002) Citizenship and the boundaries of the acknowledged community: \nidentity, affiliation and exclusion. IDS Working Paper 171. IDS, University of \nSussex. \nKabeer, N. (2000) Social exclusion, poverty and discrimination: towards an analytical \nframework. IDS Bulletin 31, 4, 83-97. \nKehler, J. (2000) Community participation in the process of Integrated Planning \nDevelopment (IDP). Evaluating realities and community perceptions in areas \non the Western and Eastern Cape. Nadel Research Report No 15. \nNadel\/Austrian Development Cooperation, Cape Town. \nLefebvre, H. (1991) The Production of Space. Verso, London. \nLiebenberg, L. (1999) The IDP Experience: An Analysis of Two Western Cape \nProcesses. Foundation for Contemporary Research, Cape Town.                                  \nLister, R. (1995) Dilemmas in engendering citizenship. Economy and Society 24, 1, \n1-40. \n 44\nNew Spaces of Citizenship  Political Geography \nLister, R. (1997a) Citizenship: Feminist Perspectives. Macmillan, Basingstoke. \nLister, R. (1997b) Citizenship: towards a feminist synthesis. Feminist Review 57, 28-\n48. \nLocal Government Transformer (2001) Feb\/March 7, 1, p.1 \nMaharaj, B. (1999) The integrated community apartheid could not destroy: the \nWarwick Avenue Triangle in Durban. Journal of Southern African Studies 25, \n2, 249-66. \nManicom, L. (2001) ‘Globalising ‘gender’ in – or as – governance? Questioning the \nterms of local translations’. Agenda 48, 6-21. \nMathie, A. and Cunningham, G. (2003) From clients to citizens: Asset-based \nCommunity Development as a strategy for community-driven development. \nDevelopment in Practice 13, 5, 474-86. \nMcEwan, C. (2000) Engendering citizenship: gendered spaces of democracy in South \nAfrica. Political Geography 19, 5, 627-651. \nMcEwan, C. (2003) ‘Bringing government to the people’: Women, local governance \nand community participation in South Africa. Geoforum 34, 4, 469-482. \n 45\nNew Spaces of Citizenship  Political Geography \nMeer, S. and Sever, C. (2004) Gender and citizenship. Overview Report. University of \nSussex, BRIDGE\/IDS. \nMiller, T. (1998a) Exchange-value citizenship. Social Text 56, 3, 43-8. \nMiller, T. (1998b) Technologies of Truth: Cultural Citizenship and the Popular \nMedia. University of Minnesota Press, Minneapolis. \nMosse, D. (1995) Authority, gender and knowledge: theoretical reflections of \nParticipatory Rural Appraisal. KRIBP Working Paper 2. Centre for \nDevelopment Studies, Swansea. \nMouffe, C. (1992) Democratic citizenship and the political community. In Mouffe, C. \n(ed.) Dimensions of Radical Democracy: Pluralism, Citizenship, Community \nVerso, London, pp.225-39. \nMouffe, C. (1995) Democratic politics and the question of identity. In Rajchman, J. \n(ed.) The Identity in Question. Routledge, New York, pp.33-46. \nMouffe, C. (1996) Radical democracy or liberal democracy? In Trend, D. (ed.) \nRadical Democracy: Identity, Citizenship and the State. Routledge, London, \npp.19-26. \n 46\nNew Spaces of Citizenship  Political Geography \nMunro, W. (1996) Re-forming the post-apartheid state? Citizenship and rural \ndevelopment in contemporary South Africa. Transformation 30, 1-29. \nNancy, J-L. (1991) The Inoperative Community trans. Connor, P et al. University of \nMinnesota Press, Minneapolis. \nNarayan, U. (1997) Towards a feminist vision of citizenship: rethinking the \nimplications of dignity, political participation, and nationality. In Shanley, M.L. \nand Narayan, U. (eds.), Reconstructing Political Theory. Polity, Cambridge, \npp.48-67. \nNarayan, D., Chambers, R. and Shah, M. (2000) Crying Out for Change. The World \nBank, Washington DC. \nOtzen, U., Hoecker, U., Menzel, B., Pfeiffer, S., Poerksen, H. and Weik, V.  (1999) \nIntegrated Development Planning. A New Task for Local Government in South \nAfrica. Participatory planning for socio-economic development in two \nmunicipalities in Mpumalanga. GTZ, Braamfontein. \nPateman, C. (1989) The Disorder of Women. Polity Press, Cambridge. \n 47\nNew Spaces of Citizenship  Political Geography \nPatton, C. and Caserio, R.L. (2000) Introduction. Citizenship 2000. Cultural Studies \n14, 1, 1-14. \nPhillips, A. (1991) Engendering Democracy. Polity Press, Cambridge. \nPhillips, A. (1993) Democracy and Difference. Polity Press, Cambridge. \nPopke, E.J. (2000) Violence and memory in the reconstruction of South Africa’s Cato \nManor. Growth and Change 31, 2, 235-54. \nProkhovnik, R. (1998) Public and private citizenship: from gender invisibility to \ngender inclusiveness. Feminist Review 60, 84-104. \nPrice-Chalita, P. (1994) Spatial metaphor and the politics of empowerment: mapping \na place for feminism and postmodernism in geography. Antipode 26, 3, 236-54. \nRahman, M. (1995) People’s Self-Development: Perspectives of Participatory Action \nResearch. Zed Books, London. \nRimke, H. (2000) Governing citizens through self-help literature. Cultural Studies 14, \n1, 61-78. \nRobinson, J. (1995), Act of omission: gender and local government in the transition. \nAgenda 26, 7-18. \n 48\nNew Spaces of Citizenship  Political Geography \nRoodt, M. (1996) Participatory development: a jargon concept? In Coetzee, J.K. and \nGraaff, J. (eds.) Reconstruction, Development and People. Thomson, Johannesburg. \nSeidman, G, (1999) Gendered citizenship: South Africa’s democratic transition and \nthe construction of a gendered state. Gender and Society 13, 3, 287-307. \nSchönwälder, G. (1997) New democratic spaces at the grassroots? Popular \nparticipation in Latin American local governments. Development and Change \n28, 753-70. \nShapiro, M. (2000) National times and other times: re-thinking citizenship. Cultural \nStudies 14, 1, 79-98. \nShutte, A. (1993) Philosophy for Africa. UCT Press, Rondebosch. \nSolomon, S. (2000) Community Partnership in Cape Town’s UniCity. In Lyons, M., \nSmuts, C., Stephens, A. (eds.) Integrating Participation: Participatory \nDevelopment in Post-Apartheid South Africa. South Bank University, London, \npp.40-44. \nStaeheli, L. (1994) Restructuring citizenship in Pueblo, Colorado. Environment and \nPlanning A 26, 849-871. \n 49\nNew Spaces of Citizenship  Political Geography \nSquires, J. (1999) Gender in Political Theory. Polity, Cambridge. \nVoet, R. (1998) Feminism and Citizenship. Sage, London. \nWerbner, P. and Yuval- Davis, N. (1999) Women and the new discourse of \ncitizenship. In Werbner, P. and Yuval-Davis, N. (eds.) Women, Citizenship and \nDifference. Zed Books, London, pp.1-38. \nWhite, S. (1996) Depoliticising development: the uses and abuses of participation. \nDevelopment in Practice 6, 1, 6-15. \nWolfensohn, J. (1996) Foreword. In The World Bank Participation Sourcebook \nhttp:\/\/www.worldbank.org\/wbi\/sourcebook\/sbhome.htm.  \nYoung, I. (1990) Justice and the Politics of Difference. Princeton University Press, \nPrinceton. \nYuval-Davis, N. (1997) Women, citizenship and difference. Feminist Review 57, 4-\n27. \n  \n \n \n 50\nNew Spaces of Citizenship  Political Geography \n 51\n                                                                                                                                           \nFOOTNOTES \n1 I use the term ‘black’ as inclusive of all women of colour, whilst being mindful of \nthe sensitivities associated with such terminology. \n2  This research was concerned with gendered spaces of democracy in South Africa \nand was conducted January-September 2001. 98 semi-structured in-depth interviews \nand 5 focus groups were conducted with women in Khayelitsha\/Ceres (Western \nCape) and Durban\/Cato Manor (KwaZulu-Natal). 13 interviews were conducted with \nrepresentatives of community-based partnerships, NGOs, CBOs and women’s \norganisations. \n3  See Hemson (2000) and Popke (2000) on the redevelopment of Cato Manor. The \nDevelopment Association was wound up in 2003 with the restructuring of local \ngovernance and transfer of functions to eThekwini Municipality. \n4  These interviews are discussed in greater depth in McEwan 2003.  \n \n5  Held on 5th July 2001, Unobuntu Multi-Purpose Centre. \n6  Empowering of black delegates was demonstrated when another [white] delegate \nrequested a shortened meeting because of no heating (Worcester is a mountain town \nand this was a cold winter’s day). One activist angrily responded: “This is luxury. We \nhave to live in conditions worse than this. At least we have walls. We meet to discuss \nserious issues and you should put up with it”. \n7  From July 2001 into 2002, for example, thousands of homeless people from the \ninformal settlements of Khayelitsha occupied vacant council lots in response to \nflooding and Council threats of eviction and severing water supplies for non-payment \nof rates. Housing constitutes a priority need in Khayelitsha but there has been no real \nNew Spaces of Citizenship  Political Geography \n 52\n                                                                                                                                           \nstrategy and little co-ordination of activities. The ‘land grabs’ were precipitated by \npeople who had waited 15 years for housing provision. \n 8  Agonistic democracy is culturally specific and might be undesirable in post-conflict \ncontexts like South Africa. From my experience in women’s meetings it works well \nin facilitating participation and agency. \n"}