{"doi":"10.1177\/146499340600700203","coreId":"65704","oai":"oai:dro.dur.ac.uk.OAI2:5042","identifiers":["oai:dro.dur.ac.uk.OAI2:5042","10.1177\/146499340600700203"],"title":"Market institutions and urban food supply in West and Southern Africa : a review.","authors":["Porter, G","Lyon, F.","Potts, D."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-04-01","abstract":"As the urban share of Africa's population increases, the importance of understanding how food supply is shaped by market institutions has grown. However, this topic has received little attention from policy makers and researchers despite the implications of market institutions and regulatory systems for livelihoods and poverty. This paper reviews the existing literature on market intermediaries, access to selling spaces, finance for traders and sources of information on prices and supplies. The gaps in research are identified and a set of key research issues in this crucial, yet under-researched, area are articulated","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65704.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5042\/1\/5042.pdf","pdfHashValue":"ad37f6978cba8d11aaae1391d66cf78ff47b1bb8","publisher":"Sage UK","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5042<\/identifier><datestamp>\n      2011-09-14T15:24:04Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Market institutions and urban food supply in West and Southern Africa : a review.<\/dc:title><dc:creator>\n        Porter, G<\/dc:creator><dc:creator>\n        Lyon, F.<\/dc:creator><dc:creator>\n        Potts, D.<\/dc:creator><dc:description>\n        As the urban share of Africa's population increases, the importance of understanding how food supply is shaped by market institutions has grown. However, this topic has received little attention from policy makers and researchers despite the implications of market institutions and regulatory systems for livelihoods and poverty. This paper reviews the existing literature on market intermediaries, access to selling spaces, finance for traders and sources of information on prices and supplies. The gaps in research are identified and a set of key research issues in this crucial, yet under-researched, area are articulated. <\/dc:description><dc:subject>\n        Markets<\/dc:subject><dc:subject>\n         Institutions<\/dc:subject><dc:subject>\n         Food<\/dc:subject><dc:subject>\n         Traders<\/dc:subject><dc:subject>\n         Africa<\/dc:subject><dc:subject>\n         Urbanization.<\/dc:subject><dc:publisher>\n        Sage UK<\/dc:publisher><dc:source>\n        Progress in development studies, 2007, Vol.7(2), pp.115-134 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5042<\/dc:identifier><dc:identifier>\n        issn:1464-9934<\/dc:identifier><dc:identifier>\n        issn: 1477-027X<\/dc:identifier><dc:identifier>\n        doi:10.1177\/146499340600700203<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5042\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1177\/146499340600700203<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5042\/1\/5042.pdf<\/dc:identifier><dc:rights>\n        The final definitive version of this article has been published in the journal Progress in Development Studies 7\/2 2007 © SAGE Publications Ltd by SAGE Publications Ltd at the Progress in Development Studies page: http:\/\/pdj.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1464-9934","issn: 1477-027X","1464-9934"," 1477-027x"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Markets","Institutions","Food","Traders","Africa","Urbanization."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n04 November 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nPorter, G and Lyon, F. and Potts, D. (2007) ’Market institutions and urban food supply in West and\nSouthern Africa : a review.’, Progress in development studies., 7 (2). pp. 115-134.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1177\/146499340600700203\nPublisher’s copyright statement:\nThe final definitive version of this article has been published in the journal Progress in Development Studies 7\/2 2007\nSAGE Publications Ltd by SAGE Publications Ltd at the Progress in Development Studies page:\nhttp:\/\/pdj.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n04 November 2008\nVersion of attached file:\nAccepted\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nPorter, G and Lyon, F. and Potts, D. (2007) 'Market institutions and urban food supply in West and Southern\nAfrica : a review.', Progress in development studies., 7 (2), pp.\u0000115-134.\nFurther information on publishers website:\nhttp:\/\/dx.doi.org\/10.1177\/146499340600700203\nPublishers copyright statement:\nThe final definitive version of this article has been published in the journal Progress in Development Studies\n7\/2 2007 © SAGE Publications Ltd by SAGE Publications Ltd at the Progress in Development Studies page:\nhttp:\/\/pdj.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\u0000\u0000\n \n \nMarket institutions and urban food supply in West and Southern Africa: a \nreview \n \nGina Porter, Fergus Lyon and Deborah Potts  \n \n \nDr Gina Porter \nDepartment of Anthropology \nUniversity of Durham  \n43 Old Elvet \nDurham DH1 3HN \nr.e.porter@durham.ac.uk  \n \nDr Fergus Lyon  \nCentre for Enterprise and Economic Development Research \nMiddlesex University \nThe Burroughs \nLondon NW4 4BT \nf.lyon@mdx.ac.uk \n \nDr Deborah Potts \nDepartment of Geography \nKings College, London \nNorfolk Building \nSurrey Street \nStrand Campus \nLondon WC2R 2LS \ndebby.potts@kcl.ac.uk  \n 1\n \nMarket institutions and urban food supply in West and Southern \nAfrica: a review \n \nKey words: Markets, institutions, food, traders, Africa, urbanization \n \nAbstract \nAs the urban share of Africa’s population increases, the importance of understanding how \nfood supply is shaped by market institutions has grown. However, this topic has received \nlittle attention from policy makers and researchers despite the implications of market \ninstitutions and regulatory systems for livelihoods and poverty. This paper reviews the \nexisting literature on market intermediaries, access to selling spaces, finance for traders and \nsources of information on prices and supplies. The gaps in research are identified and a set of \nkey research issues in this crucial, yet under-researched, area are articulated. \n \n \nIntroduction \nDespite rapid urbanisation and increasing levels of urban poverty, urban food systems are \nrarely adequately considered in recent African urban development studies. As Ellis and \nSumberg (1998) stress, the analytical and policy importance of rural-urban interactions for \nurban food supply cannot be underestimated: there is a dangerous tendency to downplay or to \nneglect these interactions in determining access to food and welfare by the urban poor.  \nMoreover, as Dorward et al. (2003) point out,  recent work on livelihoods and poverty \nreduction has generally failed to generate studies on the critical role of urban food market \ninstitutions, although work abounds with analysis of the impact on urban livelihoods of \nincreases in the cost of basic foods under structural adjustment.  The lack of attention to \nmarkets is even more surprising in the context of the rapid liberalisation of markets in sub-\nSaharan Africa over the last 20 years. The exception has been the detailed analysis and \ndebates about maize markets in southern African countries. \n \nOur focus in this paper is on the mechanics of urban food supply systems, with particular \nreference to West and southern Africa.  We draw on a diverse range of recent studies from \nthe past 15 years and situate these in the context of earlier work on market institutions in \nAfrica. While there has been a growing interest in financial and labour markets, there has \nbeen less attention given to produce markets.  We explore the roles of intermediaries linking \nproducers with urban consumers, paying particular attention to the functioning of formal and \ninformal market institutions within countries, and to small and medium-scale actors in urban \nfood trade There is a wide range of highly complex formal and informal institutions that \nshape Africa's food marketing systems: different types of associations and self-imposed rules, \nin addition to national legal systems that affect how trade is done.  We need to know more \nabout how these formal and informal regulatory systems operate, if we are to improve access \nto markets and thus enhance urban food supplies, and also secure income and livelihoods.   \nOur aim in the paper is to pick out some of the key questions which have yet to be addressed \nby researchers in this crucial, yet under-researched, area.   \n \nThis review of literature draws on material coming from a diverse range of theoretical \nperspectives including anthropology (on how culture, social structures and social networks \nshape organisational forms), economic sociology and economics (on economic institutions, \ntransaction costs and how economic activity is embedded in social relations). Most of the \n 2\nmaterial on market institutions included in the review shares a common emphasis on situating \nthe analysis of urban food supply in a social and cultural context as well as its economic \nsetting.  The neglect of research into produce market institutions is symptomatic of the \nemphasis on overly economistic views of development, such as prioritising liberalisation. \nSuch approaches have been underpinned by assumptions that economic institutions will \nautomatically appear and market economies will be structured along the lines of European or \nNorth American capitalism.  \n \nMore nuanced perspectives have come from New Institutional Economics with their attention \nto formal and informal market institutions including the ‘rules of the game’ defining the \nincentives and sanctions affecting people’s behaviour and transaction costs (North, 1990; \nDorward et al., 2003:323; Dorward et al. 2005). These can be formal organisations of \nregulations or less formal institutions, such as networks of trust, norms of reciprocity etc. \n \nHowever, the attention to institutions has not led to greater understanding of how poor people \nbuild livelihoods, but rather institutions are used as an explanation of why the forms of \nliberalisation promoted by multilateral agencies and donors have failed (Chang, 2005). \nFurthermore, within these approaches there are also assumptions that institutions will \nautomatically appear to reduce transaction costs (Granovetter, 1994). In this paper we review \nmaterial that shows how institutions are deeply embedded in social and political practices, \nand may continue due to path dependency even when they appear inefficient and other forms \nof  introduced institutions do not develop, as they fail to build on the existing social and \ncultural context (Hodgson, 1988; Granovetter, 1985). \n \nFollowing a preliminary review of power relations along commodity chains and attitudes to \ntraders in Africa, we consider trader access to selling spaces in markets, to credit and to \ninformation on prices and supplies.  We explore the factors that allow access, the factors that \nexclude access, and the implications of these for urban poverty, the security of urban \nlivelihoods, and the security of urban food supply.  Our focus here is principally on market \nintermediaries, rather than the role of government in market regulation, although this is \ndiscussed in relation to southern Africa due to its continued significance in the crucial maize \nmarket. There is insufficient space to examine the role of transporters, porters, security agents \nand others who make a livelihood from the marketing system: these will be the subject of \nseparate papers.   As our review illustrates, although there is certainly evidence of trader \nprofiteering from a range of countries, traders can be key players in improving the marketing \nsystems that supply urban consumers and can create new markets for rural producers.   \n \nOur regional and country focus \nAlthough we aim to provide a broad overview of the current state of knowledge, we draw in \nparticular from literature covering three diverse countries, Nigeria, Ghana and Zambia, where \nwe have recent field experience. Among these countries Nigeria, which has the largest urban \npopulation in Africa, has an especially rich historical marketing literature up to the 1980s, but \nhas been less well-served since. This older material provides useful pertinent background to \nunderstanding current broad conditions (for example Anthonio, 1968; Jones, 1968; Thodey, \n1968, Olayemi, 1974; Mortimore, 1979; Delgado, 1986), including gender and ethnic \ncomponents to marketing, commodity chains and trader-state relations and past experience \nwith market interventions.  More recent material on Nigeria comes mainly from studies of \nurban and peri-urban horticulture in Enugu (Onah et al., 1998) and Kano (Olofin et al., 1998), \nwhich include very brief reviews of marketing.  Subsequently, Ghana became the focus of \n 3\nmuch donor-supported research in West Africa and consequently is the subject of a \nsubstantial proportion of recent literature for the region, as discussed below.   \n \nThere is rather less food marketing material available for much of southern Africa, beyond \nthe attention to the broad, economic functioning of maize markets, as noted earlier.  In \nZambia attention to this topic is increasing, perhaps in part because urban poverty has \nbecome so severe that deurbanization has been a feature for the last two decades, possibly \nuniquely in sub-Saharan Africa (Potts, 2005). An important reason for neglect of food \nmarketing in southern Africa lies in the difference in the colonial experience between that \nregion and western Africa, with important ramifications through to the present day. African \nmarketing in southern African countries like Zambia was actively, and institutionally, \nundermined in order to protect large-scale European farmers from competition. West African \ncountries like Nigeria and Ghana, by contrast, retained vigorous traditional periodic market \nsystems which interlinked vast regions: these are well documented and remain crucial to \ncurrent patterns of urban food supply. \n \nMuch marketing material available for southern and eastern Africa has a specifically rural \nfocus (for example, Ponte's Tanzanian study, 2002) or is restricted to issues such as \nsmallholder outgrowing schemes (e.g. Stringfellow, 1996, for Zambia, Govereh et al., 1999 \non eastern and southern Africa).  Fafchamps and Minten (1999), however, provide interesting \nstudies on relationships and traders in Madagascar and work on the supply of urban markets \nin Dar as Salaam by Bryceson (1987, 1992, 1993), Briggs (1991), and on Harare by Mosley \n(1987), Horn (1994), Drakakis-Smith and Kivell (1990) and Smith (1989) is also notable.   \n \nAs with Nigeria, a body of work exists on urban agriculture in southern African cities and \nthis frequently contains consideration of  the extent to which crops are marketed within the \ncity (e.g. Chimbowu and Gumbo (1993), Mbiba (1995, 2000), Mlozi (1996), Drescher \n(1997), Rakodi (1985) and Sanyal (1985)). However, while the role of urban agriculture in \nproviding food for urban people has increased very significantly in the 1980s and 1990s \nalthough exact figures on the contribution in individual African cities are hard to find, the \nmain thrust of the research is either on its contribution to urban household's livelihoods in \nterms of self-provisioning and the generation of some possible sales income, or on its impact \non the urban physical environment (eg see Bowyer-Bower and Smith 1997).  The exact \nnature of trading and marketing arrangements are rarely the main consideration. \n \nIn line with the focus within its region, most of the recent literature on agricultural marketing \nin Zambia concentrates on maize, the main food crop (e.g. Chizuni, 1994; Mwanaumo et al., \n1997; Seshamani, 1998; Pletcher, 2000; Mwiinga et al., 2002; Nijhoff et al., 2002; Nijhoff et \nal., 2003, Oygard et al., 2003), though Moll and Dietvorst’s (1999) work on cattle marketing \nin Western Province over 30 years provides a rare perspective on private trading activities \nand highlights the ‘continuous search for the demarcation of the roles of government and \nprivate sector in society’ (p. 201).  These themes are also present in a recent study by \nMacmillan (2005) of the role of the Susman Brothers in various commercial activities in \nZambia, including the provision of beef to urban markets. An important theme in the maize \nmarket literature is food security.  Some of the work ignores the urban component, while \nsome considers it solely in terms of the distortions in market pricing of maize brought about \nby government interventions,  One reason is that, prior to neo-liberal interventions, these \nwere usually seen as being in the unwarranted interests of the urban population. Although \nprivate traders operate in urban food supply systems in Zambia, their detailed activities \nappear to be almost wholly unrecorded, because of the preoccupation with government \n 4\ninterventions (and the marginalisation of private traders which has been partly their cause and \npartly their consequence).  Consequently there is a major knowledge gap to be filled.  \n \nPower relations along commodity chains and within urban food markets \nAn understanding of the activities and power relations exercised by traders and others along \nthe market chain and within urban food markets is important for a full appreciation of the \ncomplexity of African marketing systems and is essential before detailed policy \nrecommendations can be made which might cause adjustments within commodity chains.  A \nnotable contribution to this field comes from Guyer (1997) on Ibadan's food supply \nhinterland, and research on crop 'filieres', i.e. sequences of relationships\/channels along \nwhich food moves through urban provisioning systems (e.g. Bernstein, 1996, for South \nAfrican maize; Mather and Greenberg, 2003, for citrus fruit in South Africa; Love, 2001, for \nEthiopia's coffee).  These studies incorporate detailed attention to the activities of urban (as \nwell as rural) traders and the power relationships which shape the marketing system.   \nHowever, Smith (1998) argues that such food systems studies tend to focus on globalisation \nand to underplay the specific role of urbanisation within both global and local trends.  \n \nResearch on vegetable production on the Jos Plateau, Nigeria demonstrates the complexity of \nnetworks among producers and different kinds of traders, with chain and associated credit \nsystems extending through Jos to the major urban markets of southern Nigeria, supported by \nlandlord relationships which are built over long periods (Porter et al., 2003).  The entrenched \nbut flexible and evolving nature of the landlord system is evident from the extensive \nhistorical literature on this topic in West Africa but the way it is being adapted to current \ncircumstances needs examination. \n \nJackson et al. (2003) suggest that commodity chains are subject to a proliferation of diverse \nand inconsistent definitions, and note the importance of historical depth to commodity chain \nanalysis and the need for improved handling of regulation issues.  Use of the term network is \npreferred by some authors because it more explicitly captures ‘the complexity of actors and \nmulti-stranded exchange relationships’ (Hughes, 2000; Hughes, 2001:391). Hughes’ study of \nthe Kenyan cut flower industry (2001) provides a useful example of the way the concept can \nbe utilised to examine regulatory roles and impacts on labour conditions and other practices.  \n \nA brief note at this point about women traders’ roles in commodity chains is appropriate.  \nDespite women’s seeming lack of power in many African contexts, the central role of women \nin food trade, as the foundation of urbanization in West Africa, has to be acknowledged. This \nis widely recognised in the academic literature (e.g. Onyemelukwe, 1970; Sudarkasa, 1973; \nTrager, 1981a, 1981b; Clark, 1994; Dennis and Peprah, 1995; House-Midamba and Ekechi \n(eds), 1995; Grieco, 1996; Sheldon (ed.), 1996; Levin et al., 1999; Wan, 2001; Izugbara, \n2004; Nigerian Marketing Network 2005).  The role of food trade, in women's livelihoods in \nsouthern Africa is much less culturally and historically rooted.  Nonetheless, much of the \nwork relating to urban food supplies and marketing in southern and eastern Africa (e.g. \nBryceson's Tanzanian studies; Jose Smith's (1989) and Nancy Horn's (1994) work on Harare) \nspecifically considers women's important roles in food trade.  Other studies on women's \nincreasing involvement in informal economic activities in southern and eastern Africa are \nquite common (e.g. on Chawama, one of Lusaka's low-income settlements, see Moser 1997; \non Harare, Brand 1986, Osirim 1994, Mupedziswa and Gumbo 1998; on Kinshasa, Iyenda \n2003; on Nairobi, Nelson 1997; on South Africa, Preston-Whyte and Rogerson 1991). \nHowever, these studies do not look at food traders specifically, although the significance of \nraw and cooked food trading and vending for women is always an element in these works.  \n 5\nOverall, it is clear that the significance of women in food trading in cities is well established \nin southern as well as West Africa, although details on their roles within that sector are less \ndocumented.  However, in both regions it must be noted that women, albeit crucial to urban \nfood supply, mostly occupy the least lucrative niches.  \n \nTraders, cartels and market manipulation \nTraders are often accused by politicians and the media of operating cartels, but anecdotal \nevidence and our own field experience in West Africa (Lyon, 1999, 2000, 2001; Porter, 1990, \n1994, 1995, 2001) suggests that, although monopolistic control can be exerted, it tends to be \nconfined to specific parts of the marketing chain. Traders obviously provide a crucial service \nand they are often investing their capital in a high-risk environment where, arguably, returns \nshould be commensurate with the risks involved. This is, of course, even more true of farmers \nthemselves, and evidently a balance needs to be struck between the conflicting interests of the \nproducer and the trader which allows both to profit if food marketing is to develop and be \nimproved.     \nThe positive contribution of traders in providing an essential service to urban consumers has \nnot been adequately analysed as there has been long-standing antipathy among many policy \nmakers in post-independence Africa to small-scale trading, in particular, as evidenced by the \ninnumerable cases of harassment reported in the African press and by the derogatory terms \noften used to describe traders and their trading activities.  The antagonisms experienced by \npetty traders in Zimbabwe’s cities in mid-2005 were by no means unique (although their \ninformality, rather than their pricing practices, was the primary cause of this particular \nattack). Dennis (1987) in Nigeria and Clark (1994) in Ghana also refer to numerous incidents \nin the 1980s when soldiers went into markets and beat women traders to force them to sell \ntheir goods at lower prices  In these cases the government attacks were focussed mainly on \ntraders who were selling to the public, rather than those buying from producers, so the issues \n(as perceived by the governments involved) were related to trading at the end of the \ncommodity chain but there is plenty of suspicion and harassment of traders at every point \nalong such chains in many African countries.   \nIn part this antipathy can be explained by the disorganised nature of informal trade and the \ndifficulties this presents for regulators in areas such as hoarding, unfair pricing and even city \ntraffic flow. Yet, given the constraints so often described in studies of marketing (Smith and \nLuttrel, 1994; Porter, 1994; Lyon, 2001), the ability of Nigerian traders to move produce \nfrom millions of disparate farms to millions of consumers in Nigeria and internationally is \nastonishing, even if it is not working optimally for livelihoods of the poor or wider economic \ngrowth (Guyer and Hansen, 2001: 199). Within these difficult conditions traders have built \nup the skills and capital necessary to perform these services.  \n \nThe contribution of traders is more specifically recognised by policy makers when \ngovernment involvement in food and other crop trading has been 'rolled back' and it has been \nfound that private traders have not filled the ensuing vacuum in a geographically equitable \nfashion, even when this was entirely predictable according to the logic of the market in \ncountries with very poor transport infrastructure.  This has been a major issue in Zambia \nsince the food trade was finally properly liberalised in the 1990s (Republic of Zambia, 2001; \nSeshamani, 1998).  Similar problems have arisen in Malawi (Harrigan, 1991, 2003; Dorward \nand Kydd 2004).  Harrigan (2003:860) concludes that despite market liberalization, “product \nand factor markets remain fragmented and unreliable…Private traders face transport, credit, \nstorage, and information constraints with scale-related barriers, meaning that trade is \n 6\ndominated by petty traders”.  Dorward and Kydd (2004) emphasise that the marked growth in \npetty trade in Malawi in recent years is mainly a response to declining traditional sources of \nincome, rather than the result of growing local consumer markets.  This point is also stressed \nby Peters (2005:341), who observes that after 15 years of operation, private traders remain \n‘overwhelmingly small-scale and opportunistic’.  In the current context of uncertainty and \nrisk, they can hardly operate otherwise. The complex arguments in the literature about maize \nmarkets and food security in southern Africa are usefully and succinctly summarised in \nSARPN\/ODI\/FNRPAN (2006). \n \nAccessing selling spaces in markets: the role of market associations \nMarket associations are found throughout Africa and play a key role in the control of key \nmarket spaces in urban areas. While they are well established and powerful in West Africa, \nwithin southern African countries such as Zambia, food trader associations currently play a \nsmall role (le Clus and Mwale, 2004).  These organisational forms are used to regulate \nmarkets and settle disputes but their power can also be used to control prices and supplies \nfrom rural areas when they are able to act as cartels. While this has been found in some West \nAfrican markets, its occurrence is not widespread (Smith and Luttrel, 1994; Lyon, 2000a). \nHowever, there is likely to be considerable difference between markets and within markets \ndepending on the commodity.   \n \nIn Nigerian urban markets, Anyanwu and Jukes (1991) observe the way small traders may \nthemselves choose relegation to sites outside the main market in order to avoid payment of \nmarket dues.  Similar practices were found in Lusaka in the main Soweto market, although \nthis could also occur because the traders felt that they gained better access to passing \ncustomers in this way.  Okali et al. (2001:46-7), however, also record rural producers in \nsouth-eastern Nigeria experiencing difficulties in accessing urban markets: “rural \nrespondents complained that the market unions in the city do not allow the rural farmer to \nsell his products directly to consumers…. even if the rural farmer transports his farm \nproduce to the urban centre, he is forced to sell to the foodstuff unions in the urban market or \nelse members of the union will frustrate the rural farmer’s efforts to sell his produce.  \nUnderstandably, this results in a substantial loss in potential income for the farmer who is \nforced to sell to the urban market unions at a much lower than the retail price”.  \nUnfortunately, their study is a general examination of urban-rural linkages and delves little \nfurther into marketing issues beyond this broad accusation: the rural perception recorded \nneeds further exploration and analysis.  Adubi (1996: vi, 23), like Okali, takes a \nconventionally negative view of the associations in his work on Lagos’s food marketing \nsystem.  He suggests that their role is ‘domineering’ (p.23) because buying and selling cannot \nbe carried out in wholesale or retail markets there without being a registered member of a \nmarket association.   \n \nA few studies conducted elsewhere are more positive.  Ayodele Ariyo et al. (2001) in their \nstudy of rural and urban grain traders in the Kano region observe that all 30 urban traders \nthey interviewed belonged to two traders’ associations, one of which served as a link between \ntraders and government, and existed principally to negotiate taxes, market infrastructure and \nsecurity, whereas the other was a commodity-based association aimed at promoting \ncooperation between local and stranger traders. These latter associations facilitated \ndissemination of information on supply, demand and prices and also aided business \ntransactions and grain deliveries.  The grain traders’ association was said to provide benefits \nof market information, security of stores, links with traders and ‘a peaceful atmosphere in \nwhich to conduct their business’ (p.23).  Similar conclusions were reached by Lyon (2003b) \n 7\nwith regard to vegetable traders in Ghana and in a series of studies undertaken by the \nNigerian Marketing Network (2005). Onah et al (1998) provide a rare example of two \nvegetable producer\/trader associations (in a peri-urban area of Enugu) collaborating to avoid \nglut in local markets by selling vegetables on alternate days (a similar practice occurs in the \nAnloga region of southern Ghana.)  The extent to which such collaboration through \nproducer\/trader associations occurs in practice across sub-Saharan Africa is unclear. \n \nIn cases examined in detail in Ghana, the accusations of widespread excessive control by \ntrader associations have not been supported by detailed studies (Amanoo, 1975; Lyon, \n2003b). There is only evidence of control of certain commodities, in a small number of \nmarkets at particular times of the year. This control is reported by Brocklesby and Ega (2001) \nand Ejembi et al. (2000) to be based on the support of local governments, as associations \nmake tax-raising easier and create opportunities for corruption.  Data are required on the \nmargins being received by traders on a daily basis. As prices vary from day to day, margins \nalso vary considerably, especially for perishable crops. Traders therefore make their (usually \nmodest) profits on the ‘windfall days’ (Alexander and Alexander, 1991; Lyon, 2003b). \nMeasuring margins requires detailed analysis of daily price data.  It can provide important \nperspectives on the working of urban markets. \n \nSimilar work on trader associations in southern Africa, rather than individual traders or \nsectors, is much rarer.  A recent study in Bulawayo, Zimbabwe, discussed the emergence of a \nnew informal traders' association in that city in the mid-1990s and its attempts to liaise with \nthe local city authorities to improve the traders' situation.  The provision of shelter and an end \nto police harassment were their main objectives (Clark, 2000).  Although their success was \nrelatively limited at the time of the study, the institution was very new so this was not \nsurprising.  Significant work has been done by Tripp in Tanzania on the gradual \nformalization of parts of the informal sector in Dar es Salaam since economic liberalization \nand the political interaction there between sectors of informal workers and the government \n(Tripp, 1997).  However, while these studies include food traders, they do not specifically \nfocus on that sector.   \n \nControl of market space is a key issue.  We need to know more about the current extent to \nwhich access to market space is controlled in Africa, and how it is done.  What are the \nconsequences for individual trader and producer-trader types?  Who is currently excluded and \nwith what consequences? We also know remarkably little about regulation and the role of the \nstate. To what extent does central and local government currently regulate access to market \nspace across Africa, and with what consequences? \n \nAccess to information on prices and supplies \nProducers and traders require a range of different types of marketing information (Shepherd, \n1997). In addition to prices and supplies, information is required on alternative channels, \nquality, means of payment and financing. Due to their location and lack of networks, farmers \nmay have less access to such information. As Galtier and Egg (1998) point out, in a Malian \ncontext, farmers need information on such matters as wholesalers demand, storage techniques \nfor grain and forecasts of price levels  \n \nTraders may be in a better position than farmers to get price information and studies in Benue \nState, Nigeria, found that prices in markets were reasonably integrated (NRI, 1995, quoted in \nBrocklesby and Ega, 2001). However, Gabre-Madhin (2001) estimated that the opportunity \ncost of labour time spent searching for a trading partner, and the opportunity cost of holding \n 8\ncapital fixed during that search, represented one-fifth of all marketing costs for Ethiopian \ngrain traders.  \n \nOf key importance are traders’ personal networks that are used to obtain marketing \ninformation and access to credit from other traders. Access to information is likely to be \ndifferent for different types of producers depending on the size of production, distance from \nmarkets and their own networks.   Ayodele Ariyo et al. (2001) found in their study of urban- \nand rural-based grain traders in the Kano region (all Hausa men) that the 30 rural traders \nrelied more on farmers than any other information source, whereas their urban sample (30 \ntraders again) also obtained information from  other traders.  Radio and government bulletins \nwere information sources for very few of the traders they interviewed, though reasons why \nthese are not utilised are not indicated in the study. \n \nThe importance of personalised links has been observed in several studies, most notably the \ndetailed studies of Trager (1981a), and are reported throughout West Africa (Holtzman et al., \n1988; Lyon, 2000). A useful broad review of the literature on social networks and personal \nnetworks in African informal economies is provided by Meagher (2005). From a livelihoods \napproach it is important to note who is included or excluded from networks, and how \ninclusion is shaped by factors such as gender, ethnicity, wealth and age.  Thus, even where \nprice information is available, the poorest group of traders may still sell in a less profitable \nbut more accessible market, due to poor transport availability. Cultural constraints on \nmobility may also limit women's ability to take advantage of information about more \nprofitable markets (Porter, 1995, re north-east Nigeria).  We have little comparable \ninformation for southern African conditions but hypothesise that many of the features of \nWest African urban market systems will be evident to some degree there. \n \nTraders’ associations are also a potential forum for sharing market information and their role \nin this respect has been observed in some detail in West Africa (Smith and Luttrel, 1994 in \nNigeria; Lyon, 2003 in Ghana; the Nigerian Marketing Network 2005). Specialist brokers of \ninformation on other parties are reported amongst grain traders in Ethiopia and these \nindividuals significantly increase the total economic welfare by enabling a more efficient \nallocation of search effort by traders (Gabre-Madhin, 2001). In Zambia, such food trader \nassociations are lacking (le Clus and Mwale, 2004). \n \nThere is a strong argument for governments to be involved in supplying information, since \nthe private sector rarely finds it cost effective to do so.  Galtier and Egg (1998) found that \nattempts to provide market information services in Mali have not been successful.  A \nsubsequent review by Dembele et al. (2000) is more positive about the successes of the \nMalian Cereal Market Information System (created in 1989) and suggests that marketing \nmargins have been reduced along major trading routes as a result of improved access to \nmarket information and increased competition, though price volatility remained a ‘serious \nchallenge’ (p.2).  USAID-financed solar powered radio-modems have contributed to the \nsuccess achieved by allowing provision of up-to-date market information to remote areas, \nparticularly to local radio stations.  The system of data generation and diffusion is now \ndecentralised, and linked to the Malian Chambers of Agriculture, which has cut costs \nsubstantially. \n \nIn Zambia, there is an Agricultural Marketing Information Centre, which was established by \nMAFF in 1993 (Mwanaumo, 1999) and set up a weekly Market Bulletin and then a monthly \nProvincial Market Bulletin to report wholesale and retail prices of staple grains, tubers, \n 9\nvegetables and agricultural inputs.  However, as both Mwanaumo (1999) and Nijhoff et al. \n(2003) note, existing commitment to the centre is weak and production of data is sporadic.  \nMinistry staff assigned to the centre are frequently transferred elsewhere after training and \nthus extra donor resources are required to keep the centre functioning.  Chomba et al. (2002) \nreport that very few localised (i.e. non-mobile) traders felt that MACO had anything to offer \nthem; and most traders knew little about the service it did provide.  In Malawi, Dorward and \nKydd (2004) similarly emphasise the inadequacy of market information systems with \nparticular reference to maize, the dominant staple food, while also suggesting that over-\ndependence on maize resulted in a failure to develop marketing and information systems for \nother crops such as roots and millet. Poor and costly information services, they argue, lead to \nhigh risks of transaction failure for buyers and sellers and the consequent need for high risk \npremiums and margins to make market trading profitable.    \n \nA review by Shepherd (1997) of marketing information systems from 53 other countries have \nfound that there were major limitations of public sector managed marketing information \nsystems. Difficulties in ensuring quality come about because prices move rapidly from day to \nday and within the day (especially for perishable crops), producers may not understand the \ndifferences between urban and farm gate prices, and prices vary according to the grades of \nproduce (Galtier and Egg, 1998; Lyon et al., 1998; Poole et al., 1999; Shepherd, 1997). Low \nquality information can be a greater threat to farmers’ livelihoods than no information as it \nmay encourage people to enter unprofitable trading activities and exacerbate poverty.  \n \nFurther constraints to public sector marketing information systems include the difficulty of \nactually collecting prices from traders. Difficulties arise because of lack of resources and \nmotivation, the time of day the price collectors are willing to work, the suspicion of traders \nand the need to find the price by bargaining. The process of bargaining can be complicated \nand involve negotiating not only over the price and quality but also the amount given as gifts \nto customers (Lyon et al., 1998).  \n \nRadio broadcasts of prices have often not had the expected impact in Ghana (Lyon, 2000b), \nas farmers do not trust the quality of the information and it is out of date by the time it is \nbroadcast. Furthermore, even if prices are correct at time of broadcast, by the time remote \nfarmers have reached market they are likely to have changed. Moreover, there are likely to be \ngendered patterns of access to radio information (Chapman et al., 2003). Asante et al. (1997) \nnoted that (mostly male) farmers in central Ghana do use radio price reports but in a study in \ncoastal Ghana few women farmer-traders were found to have access to a working radio \n(Porter, 1999). The lack of trust in government bodies is a major obstacle. This can be \novercome through encouraging local independent community radio, although this may \nrequire changes in existing legislation (Chapman et al., 2003).  In Zambia, the recent \nmarketing information survey makes clear that both small scale farmers and traders believe \nthat radio is a very efficient way of disseminating information, but they are keen that the \nprogrammes should be in the evening when they have time to listen (Chomba et al., 2002).   \n \nThe use of telephones can benefit all parts of the marketing chain although the difficulty of \nhaving land lines to rural areas has been prohibitive to date.  However, mobile telephones \nhave already massively changed the landscape of communication for the middle classes in \nmany African cities and in countries like Bangladesh are now also a vital means of \ncommunication for many rural dwellers (James, 2000).  By 2002 the Village Phones \nprogramme had 9,400 phones across Bangladesh (mostly one per village) (Hawkey, 2002).  \n \n 10\nThe phoneshop and telecentre concepts could well be set to transform market information \nsystems in Africa over the next decade (Rathgeber and Adera, 2000).  One review of the \nNigerian economy suggests that ‘the biggest change has been the private-sector revolution in \nGSM mobile telephones’ (Financial Times, Nigeria survey, June 10, 2003,p.1). It had reached \n1 million subscribers by February 2003 (ibid. p. 3).  The challenge will be to ensure that such \nsystems are able to provide benefits to the urban and rural poor, not simply the middle \nclasses.   The fact that the GSM network in Nigeria is already serving roadside mobile booths \nlooks very positive.  More recently, a Senegalese company has started collecting data from 10 \nmarkets per day and is getting this information on line within seconds.  Another project at \nMakuleke, South Africa, is testing cell phone technology that gives small farmers access to \nnational market information: farmers can reportedly access the information on a web-based \ntrading platform via Internet-enabled phones or can request prices and trade via SMS or text \nmessage. Nonetheless, whether such projects will be sustainable when farmers’ free air time \nruns out, remains to be seen (Mobile Africa 2005).  There may also be gender implications \nwhich need consideration in policy formulation since evidence to date suggests women often \nhave more difficulty gaining access to telecommunication benefits (Graham, 1998; Schreiner, \n1999). \n \nWe need to know much more about the role of personal networks versus government \nnetworks for information gathering in Africa.  There are a number of donor-supported \nprogrammes now focussing on market information provision which appear to expect \nmarketers and trading intermediaries to utilise their services. These seem to underestimate the \ncrucial importance of quality and timeliness of information.  By contrast, in this era of mobile \nphones one-to-one personal relations based on trust appear to have critical significance for \ndisseminating accurate, up-to-date information with detailed reference to product quality etc. \nWe need to know to what extent mobile telephones are used already along different \ncomponents of the food marketing chain in Africa.  What are the barriers? What is the future \npotential? \n \nTraders’ access to finance \nThe problem of access to credit and high cost of credit for farmers and small-scale traders has \nbeen widely reported across West Africa for many decades (Vigo, 1965). There is research in \nNigeria which suggests that, in a marketing context, many potential borrowers fall between \ntwo stools: too large for informal lenders and too small for the formal lenders (Nissanke and \nAryeetey, 1998).  This is a common problem among small and medium enterprises which \nneeds further investigation in a marketing context.  A USAID study (2001:13) notes that \nNigerian banks have not developed the marketing, appraisal or supervision capacity that \nwould allow them to lend to small clients: this is probably a common deficiency across \nAfrica.  Moreover, the problem with small business lending is not physical absence of \ncollateral, but its official invisibility (i.e. legal absence) associated with lack of property \nregistration (itself caused by the complexity and high cost of registration procedures). Interest \ncharged in the informal credit market for SMEs reportedly reaches 100% or even more, but \nhas the advantages of greater flexibility in loan terms, needs little if any documentation, and \nhas low transaction costs for the entrepreneur.   \n \nMicro-credit programmes are growing in number across sub-Saharan Africa, but food traders, \nmany of whom are women, are often considered too risky by such programmes. NGO micro-\nfinance projects have been promoted as a way forward but there appears to be growing \nscepticism about their capacity and there have been recent calls for the formal financial sector \n 11\n(banks, credit unions and finance companies) to play a greater role in providing financial \nservices to the rural poor (Havers, 2001; Gamser, 2001).   \n \nIn Ghana, where rural banks were set up specifically to aid farmers in the mid-1970s, there \nhave been some positive examples of assistance to small traders. Nikoi (1996) provides an \ninteresting case of a scheme which helped women traders with transport. Yet most banks \nhave unfortunately increasingly focussed on the safer option of lending to salaried workers \n(Nikoi, 1996; Porter, 2002).  USAID (2001:22) reports several Nigerian credit unions \ndeveloping relationships with private women’s savings clubs which collect from their \nmembers on a daily basis and see the credit unions as a safe repository for the savings.  These \narrangements may allow women to establish a successful repayment history through \nparticipating in solidarity loans from the credit union.  The USAID report (ibid: 23) suggests \nthat if the credit unions could be strengthened through consolidation and economic \nintegration, they could become more efficient and thus more profitable than most are \ncurrently.  They are reported to need updated accounting systems, and stronger controls, \npolicies and procedures.  \n \nThe difficulties for women in obtaining formal credit are particularly pertinent in the trading \nsector in West Africa.  These difficulties are linked to their low social status and lack of \ncollateral.  Grieco et al. (1996:33) note that lack of access to capital among women traders in \nGhana has consequences for the size of load generally transported and the frequency of trips \nmade (a point not commonly recognised in the marketing and transport literature).    \n \nInformal savings and credit associations are thus often the only solution to obtaining business \nfinance for many - particularly women.  These include,  notably, ROSCAs: rotational saving \nand credit associations where each participant takes a turn in receiving a lump sum (Ardener \nand Burman, 1995).  However, there are often problems associated with defaulting collectors.  \nIn Ghana, Aryeetey and Aryeetey (1996) and Jones et al (1997) observe a lack of faith in \ninformal group saving systems (susu), especially in rural periodic markets.  As a consequence \nof defaults, susu associations now barely operate in some villages (Porter and Lyon, 2006).  \n \nWork by Ayodele Ariyo et al (2001) in the Kano metropolitan area of Nigeria suggests that, \nas might be expected, rural grain traders have less access to diverse sources of capital – \nnotably institutional or formal loans from the government, banks and private companies - to \nexpand their activities than their urban counterparts.  According to a 1996 survey, urban and \nperi-urban horticulturalists round Kano in the 1990s could only obtain government-sponsored \ncredit if they belonged to a farmers' association and this policy had excluded at least 90% of \nthe farmers they surveyed (Orchard et al., 1998; Olofin et al., 1998).  This has been a \nwidespread reason for farmers forming groups in Ghana: they commonly exist only until the \ncredit has been disbursed (Porter and Lyon, 2006.) \n \nInformal financing systems such as credit from suppliers, money lenders or rotating credit \nsystems, can be important but may be very expensive. Evidence of this was reported on the \nJos Plateau where trader credit was particularly significant as a component of urban \ntrader\/farmer interactions though also evident, to a rather lesser extent, in rural trader\/farmer \ninteractions (Porter 2001).  This is also reportedly the case in the Kano metropolitan region \n(Ayodele Ariyo et al., 2001), in Southern Nigeria (Trager 1981a), and in several studies in \nGhana (Lyon, 2000a; Clark, 1994). This source of financing is vital to keep trade moving \nalthough it can be used exploitatively if individuals become tied into debt relations over many \nyears (Watts 1987; Clough 1981, 1985; Bhaduri 1986).  Fafchamps (2001) notes that in \n 12\nBenin and Malawi advances by traders to farmers were of short duration, often only one to \ntwo weeks, and were given principally in order to secure future deliveries, not to exploit \nfarmers’ need for cash to finance agricultural production.     \n \nThere appears to be much less published material specifically on the credit issue in southern \nAfrica than in West Africa.  In Zambia, government intervention in credit markets (as in \nother areas of the Zambian agriculture and food marketing sector) is strongly in evidence.  \nJayne et al. (2003) report government selection of local agents to receive donor programme \nfertilizer on credit ‘according to procedures that consistently lack transparency’ (p. 298) and \nfocused on political patronage objectives.  Agents were supposed to provide ‘resource poor’ \nfarmers on credit and recover these loans at the end of the season through maize purchases.  \nApparently the so-called agents were ‘local elites or their proxies’ and the loan default rate \nwas extremely high. The general agricultural policy literature for Zambia does make clear \nthat fertiliser or other inputs were given on 'credit' pre-liberalization but that the political \neconomy of this transfer was such that recipients did not expect to 'repay'.  There is a slippage \ntherefore between discussion of subsidies and credit in some of the literature.   \n \nA strong criticism of the Chiluba government in the later 1990s was a tendency to intervene \nin the fertiliser market, in particular, for some smallholders in a rather similar way, i.e. \nwithout cost recovery.  There is a strong tension in the literature between the view that this \nprevented private traders operating properly in the fertiliser market (e.g. Farrington and \nSaasa, 2002; Jayne et al., 1999) and the view, based on empirical evidence of falling access to \ninputs and maize output across the country, that this was a necessary, if unfortunate, \nintervention to ameliorate smallholder food insecurity.  According to Copestake (1998), the \nintervention made a significant transitory contribution to rural social security in the aftermath \nof severe drought.  Without this continued government-sponsored credit, he argues, there \nwould have been a sharp fall in availability of fertiliser among smallholder farmers after \n1994, and maize production would have been significantly lower.  \n \nOfficial documentation on Zambia's Agricultural Commercialization Programme (ACP) \nnotes that although localised micro-finance systems along the ROSCA model have occurred, \nno successful agricultural finance model has emerged yet to serve Zambian smallholders \n(Republic of Zambia 2001: 31).  This clearly remains a major policy issue in that country.  \nFarrington and Saasa (2002) note that fertiliser supply (for which one can also read 'credit') \nremains the most confusing issue in agricultural privatization in Zambia.  The one exception \nis the provision of credit to out-grower schemes in products like tobacco, cotton and flowers, \nwhich have thrived along the line-of-rail in the 1990s, with 10,000 involved in horticultural \nschemes alone by 2002 (Farrington and Saasa 2002).  However evidently these are not \nrelevant to the domestic food market.  In 2000, 82% of the 118,000 agricultural households \nwho received formal loans did so through out-grower arrangements (CSO 2000, cited in \nGiovanucci 2001).  \n \nThere are also clearly major problems with bringing the large banks into the rural credit \npicture in Zambia as there are in West Africa.  One of three components of the six-year \nEconomic Expansion in Outlying Areas (EEOA) programme was a Credit Guarantee Fund \nwhich hoped to facilitate this.  However the completion report on the programme reported \nthat, despite strenuous efforts on the part of EEOA officials, this initiative had to be \nabandoned.  The main problems were that the banks were simply not interested in providing \ncredit to small-scale entrepreneurs in rural areas and were not prepared to carry the risk \ninvolved, even though the programme would have carried a significant proportion of the risk.  \n 13\nIn the end the EEOA shifted their focus to various small-scale rural savings schemes, along \nthe ROSCA model, and a micro-finance initiative which, after a shaky start, appeared to be \non a sounder footing by 2002 (RWA, 2003).  \n \nMalawi, like Zambia, now faces serious rural credit problems.  However, pre-liberalization, \nthe Smallholder Agricultural Credit Authority in Malawi “maintained for many years an \noutstanding repayment record on farmer lending” (Dorward and Kydd 2004: 352), in marked \ncontrast to the loan defaults prevailing in Zambia in that period.  An increasing tendency to \ntop-down co-ordination, relying on state and party power, rather than giving positive \nincentives reportedly eventually helped undermine the system. Today borrower opportunism \nand default is widespread (ibid: 354). \n \nFurther work is required on current patterns of credit provision in the urban food supply chain \nand the potential for extending and improving that provision. Such research needs to be \nguided by an awareness of current debates, for Dorward et al. (2003:325) observe that there is \nan inherent contradiction in donors' strong emphasis on competitive markets and \nsimultaneous calls for support for bottom-up non-market organisations, including micro-\nfinance groups, which are not part of a competitive market structure.  They argue that there is \na need for policy analysis to catch up with praxis and integrate these alternative institutional \narrangements into an overall conceptual framework.  This may be a particular imperative in \nthe low density economic activity context of countries like Zambia and Malawi. We need to \nknow what credit provision is available to key trader types along the urban food supply chain \nin different parts of sub-Saharan Africa.   What proportion at each level comes from formal \nas opposed to informal sources? What interest rates are applied by the different sectors, with \nwhat implications?  To what extent have microfinance schemes assisted in credit provision \namong the various trader groups?  How can credit provision be improved? Can informal \nsystems be improved to benefit the poor?  \n \nConclusion \nThis paper has reviewed a range of literature and identified both the progress in \nunderstanding marketing institutions and the gaps in knowledge concerning marketing \ninstitutions for urban food supply. Through identifying a range of literature that has taken \ninstitutionalist approaches and examining the social, cultural and political context in which \neconomic action takes place, a number of generalisations and common themes can be \nidentified. \n \nThe issue of access to markets for the poor is a central part of the ‘pro-poor growth’ agenda \n(DFID, 2004). This review has shown there is a history of literature on access to markets, \nmarketing chains and how this is related to networks and power relations. The literature on \nthe social embeddedness and cultural context of institutions is particularly fruitful, especially \nwith regard to understanding the gender relations and roles in marketing chains. Such \nresearch and understanding is much more commonly available for West, rather than southern \nAfrican countries, however.  In southern Africa, the focus is more usually on the economics \nand politics of staple grain production and marketing. \n \nTraders, as we have emphasised, can do a remarkable job in supplying Africa’s cities, \nsometimes in a context of strong media and government hostility.  Existing market \ninstitutions may appear to give preferential treatment to traders but it is these institutions that \nallow trade to occur in sub-optimal circumstances where the state cannot regulate or deliver. \nHowever, there is some uncertainty in the literature concerning the extent to which their \n 14\npowers can be used to damage the livelihoods of rural producers and urban consumers. The \nevidence suggests that this may occur in a small number of places and at particular times \nrequiring policies of more informed, well-targeted regulation.   \n \nAccess to information on prices and supplies is a crucial issue with regard to allowing access \nto markets for different actors and this can have major transaction costs for those involved. \nAlthough there has been a history of attempts to introduce market information systems, a \nreview of evaluations of these schemes shows that they have limited use as traders have often \nfelt that the quality and timeliness of data provided are too poor to be of much use.  \nPersonalised relationships based on trust are reported by a wide number of studies to be the \nmajor source of information and the revolution in telecommunications is having rapid impact \non  the amount, sources and quality of information becoming available to some traders \n(although further excluding those without access to mobile phones).  Similarly, personal \nrelationships are found to underpin many of the financial markets used by traders as they are \ncommonly unable to access loans from formal sources. \n \nHowever, the strongest theme to emerge from this review is that of knowledge gaps, \nespecially (but not only) in southern Africa. This disconcerting shortage of specific \nknowledge and understanding of formal and informal marketing institutions and their impact \non today’s urban food systems suggests that policy makers are mostly working in a vacuum \nin which interventions can only be based on guess-work, prejudice or political goals.  \nMapping of current market interactions along individual commodity chains is needed, both \nthrough to urban areas, and within urban markets, taking into account the nature of power \nrelationships which shape the system.  This should include consideration of both ethnicity \nand gender. In particular, research needs to identify the relatively rare occurrences of cartel \nbehaviour. Such work is essential to the accurate assessment of market institutions currently \nin place.   Finally, Kydd et al. (2004) make an interesting suggestion regarding the need for \naction research into institutional innovation. Trying out innovative institutional arrangements \nsuch as trader information groups, then carefully monitoring their impact, could well prove a \nvery effective means to achieving a deeper understanding of how institutional innovations \nwork out in practice.  A concerted research effort incorporating a range of innovative \napproaches of this kind will be essential if sounder policy formulation is to be achieved. \n \nReferences \n \nAdubi, A. (1996) Food marketing systems in Lagos FAO Programme “Food supply and \ndistribution to cities” Food into Cities Collection EC\/04- \nAlexander, J. and Alexander, P. (1991)  What's a fair price? Price-setting and trading \npartnerships in Javanese markets,  Man 26, 439-512.   \nAmanoo, E. (1975) Internal marketing systems for basic food stuffs, and government \ninvolvement in the Central Region of Ghana (1970-1973), I.S.S. Occasional Papers \nNo 50, Institute of Social Studies, The Hague, Netherlands. \nAnthonio, Q.B.O. (1968) The marketing of staple foodstuffs in Nigeria: a study of pricing \nefficiency.  University of London, doctoral thesis. \nAnyanwu, R.C. and Jukes, D.J.  (1991) Food systems and food control in Nigeria.  Food \npolicy 16,2, 112-126. \nArdener, S. and Burman, S. (eds) (1995) Money-go-rounds: women's use of rotating savings \nand credit associations.  Oxford: Berg.  \nAryeetey, E. and Aryeetey, E. (1996) Operation, utilisation and change in rotating susu \nsavings in Ghana.  Accra: ISSER, University of Ghana, Technical Publication no. 59. \n 15\nAsante, E.O., Bruce, P.A. and Appiah, F. (1997) Effective agricultural marketing system in \nGhana: main report.  Report prepared for the Ministry of Food and Agriculture.  \nAccra, December 1997. \nAyodele Ariyo, J. Voh, J.P. and Ahmed, B. (2001) Long-term change in food provisioning \nand marketing in the Kano region, 1960-2000.  Drylands Research Working Paper 34.   \nBernstein, H. (1996) The political economy of the maize filiere [South Africa]. Journal of \nPeasant Studies, 23(2\/3). \nBhaduri, A. (1986) Forced commerce and agrarian growth. World Development 14,2, 267-\n72. \nBowyer-Bower, T. and Smith, D. (1997) The Needs of the Urban Poor Versus Environmental \nConservation: Conflict in Urban Africa. DfID; Research Report # R5946 to ESCOR  \nBrand, V. (1986) One dollar workplaces: a study of informal sector activities in Magaba, \nHarare. Journal of Social Development in Africa. 1(2): p. 53-74. \nBriggs, J. (1991) The peri-urban zone of Dar-es-Salaam: recent trends and changes in \nagricultural land use. Trans. of the Institute of British Geographers, 16, 319-331. \nBrocklesby, M. A. and  Ega. L. (2001) Towards a Livelihood Strategy for Benue State: Issues \nand Recommendations Draft Report prepared for DFID Nigeria, May 2001. \nBryceson, D. (1987) A century of food supply in Dar es Salaam: from sumptuous suppers for \nthe Sultan to maize meal for a million. in: Guyer, Jane, (ed). Feeding African cities. \nManchester: Manchester UP.  \nBryceson, D. (1992) Urban bias revisited: staple food pricing in Tanzania. European Journal \nof Development Research 4(2): p. 82-106. \nBryceson, D. (1993) Liberalizing Tanzania's food trade: the public and private faces of urban \nmarketing policy 1939-88. London: James Currey, Tanzania: Mkuki na Nyota; United \nStates and Canada: Heinemann. \nChang, H-J (2005) Understanding the relationship between institutions and economic \ndevelopment – some theoretical issues.  Paper presented to the WIDER jubilee \nconference, 17-18 June 2005, Helsinki. \nChapman, R., Blench, R., Kranjac-Berisavljevic and Zakariah, A., (2003) The Power of \nRadio, Id 21 Society and Economy. \nChimbowu, A., Gumbo, D. (1993) Urban agricultural research in East and southern Africa II: \nrecord, capacities and opportunities. Ottawa: IDRC, Cities Feeding People. (Series \nReport; 4). \nChizuni, J. M. (1994) Food policies and food security in Zambia. Nordic Journal of African \nStudies, 3(1): 46-52. \nChomba, G, Mbozi, G, Mundia, D., Simpamba, M., Mwiinga, B., Donovan, C., and \nMushingwani, S. (2002) Improving the transfer and use of agricultural market I-\ninformation in Zambia:  A user needs assessment, Food Security Research Project \nWorking Paper No. 6, Lusaka, Zambia (Downloadable at: \nhttp:\/\/www.aec.msu.edu\/agecon\/fs2\/zambia\/index.htm) \nClark, G. (1994) Onions are my husband: survival and accumulation by West African Market \nWomen. Chicago and London: University of Chicago Press. \nClark, J. (2000) Participation for positive change: a case study of intra-city relationships in \nBulawayo [unpublished paper www.sit.edu\/publications\/docs\/ops03csbulawayo\/pdf] \nClough, P. (1981) Farmers and traders in Hausaland. Development and Change 12, 273-92.  \nClough, P.  (1985) The social relations of grain marketing in Northern Nigeria. Review of \nAfrican Political Economy 34, 16-35. \nCopestake, J. (1998) Business development, social security or patronage? Zambia's \nagricultural credit management programme. Centre for Development Studies, \n 16\nUniversity of Bath, Working Paper. Available at \nhttp:\/\/www.bath.ac.uk\/~hssjgc\/james.html \nDfID (2004) Making agricultural markets work for the poor.  Working paper for the \nRenewable Natural Resources and Agriculture team, DFID Policy Division. \nSeptember 2004.   \nDelgado, C.L. 1986 A variance components approach to food grain market integration in \nnorthern Nigeria.  American Journal of Agricultural Economics 68,4, 970-79. \nDembele, N.N., Tefft, J.F. and Staatz, J.M.  (2000) Mali’s market information system: \ninnovative evolution in support of a dynamic private sector.  Policy Synthesis for \nCooperating USAID offices and country missions, no. 56, December 2000.   \nDennis, C.  (1987) Women and the state in Nigeria: the case of the Federal Military \nGovernment 1984-85.  In H. Afshar (ed.), Women, state and ideology: studies from \nAfrica and Asia.  London: Macmillan, pp. 13-27. \nDennis, C. and Peprah, E. (1995) Coping with transition: Techiman market, Ghana.  Gender \nand Development 3,3, 43-8. \nDevereux, S. (2001) Food security information systems.  In S. Devereux and S. Maxwell \n(eds) Food security in sub-Saharan Africa, Chapter 8.  London: ITDG Publishing. \nDittoh, S. (1994) Market integration: the case of dry season vegetables in Nigeria.  In S.Breth \n(ed) Issues in African rural  development, 2. African rural science research network, \nWinrock International. \nDorward, A. and Kydd, J. (2004) The Malawi 2002 food crisis: the rural development \nchallenge. J. of Modern African Studies 42,3: 343-361.  \nDorward, A., Kydd, J., Morrison, J., and Pouton, C. (2002) 'Institutions for Markets' or \nMarkets as Institutions:  Theory, Praxis and Policy in Institutional Development, draft \nworking paper, Imperial College of Science, Technology and Medicine, Imperial \nCollege, Wye. \nDorward, A., Poole,N., Morrison, J., Kydd, J. and Urey, I. (2003) Markets, institutions and \ntechnology: missing links in livelihood analysis.  Development Policy Review 21, 3, \n319-332. \nDorward, A., Kydd, J., Morrison, J. and Poulton, C. (2005) Institutions, markets and \neconomic co-ordination: linking development policy to theory and praxis.  \nDevelopment and Change 36,1:1-25. \nDrakakis-Smith, D. and Kivell,P.T. (1990b)  Urban food distribution and household \nconsumption: a study of Harare. In: Findlay, Allan, Paddison, R., Dawson, J. A., \nEdited by. Retailing environments in developing countries. London: Routledge: 156-\n80.  \nDrescher, Axel W. (1997) Urban Agriculture In The Seasonal Tropics Of Central Southern \nAfrica. A Case Study Of Lusaka\/Zambia, Canada's Office of Urban Agriculture: \nUrban Agriculture Notes, City Farmer www.cityfarmer.org\/axelB.html#axel \n Ejembi, E.P. Ayoola, J.B., Achamber, N.I., Ogwuche,A.I., Liman, A.N. and Abu, G. A. \n(2001) Agricultural commodity marketing in Benue State: a pilot study. Report for \nUniversity of Agriculture, Makurdi. IFPREB. \nEkechi, F.  (1995) Gender and Economic Power: The Case of Igbo Market Women of Eastern \nNigeria, in House-Midamba, B. and Ekechi, F. (eds) African market women and \neconomic power: the role of women in African economic development. London: \nGreenwood Press. \nEllis, F. and Sumberg, J. (1998) Food production, urban areas and policy responses. World \nDevelopment, 26(2): 213-25. \nFafchamps, M. (2001) Traders and agricultural markets in Benin and Malawi.  Centre for the \nstudy of African economies, research summary 2001, 36-39. \n 17\nFafchamps, M. and Minten, Y. (1999) Relationships and traders in Madagascar. Journal of \nDevelopment Studies 35(6), 1-35. \nFarrington, J. and Saasa, O. (2002) Drivers for change in Zambian agriculture: defining what \nshapes the policy environment. London and Lusaka, Report to DFID, Contract \nDCP\/ZAM\/019\/2002, December 2002. \nFinancial Times (2003) Special Report: Nigeria. June 10th 2003.  \nGabre-Madhin, E. Z. (2001) Market Institutions, Transaction Costs, and Social Capital in the \nEthiopian Grain Market. Research Report 124 International Food Policy Research \nInstitute Washington, D.C. \nGaltier, F. and Egg, J. (1998) From Price Reporting systems to variable geometry oriented \nmarket information services. Paper presented at the 57th EAAE Seminar, \nWageningen, 23-26 Sept \nGamser, M. (2001) Crossfire.  Small enterprise development 12, 3, 4-6. \nGiovannucci, D., Sterns, P., Eustrom, M. and Haantuba, H. (2001) The Impact of Improved \nGrades and Standards For Agricultural Products in Zambia. East Lansing, MI: \nMichigan State University and United States Agency for International Development, \nPFID-F&V Report No. 3. \nGraham, S. (1998).  Conceptualizing space, place and information technology. Progress in \nHuman Geography 22 (2), 165-185. \nGranovetter, M.  (1985) ‘Economic Action and Social Structure: The Problem of \nEmbeddedness’, American Journal of Sociology 91(3) pp 481-510. \nGranovetter, M. (1994), Business groups,  in The Handbook of Economic Sociology, N. J. \nSmelser and R. Swedburg, eds. Princetown, New Jersey: Princetown University Press, \n454-75. \nGrieco, M., Apt, N. and Turner, J. (1996). At Christmas and on rainy days: transport, travel \nand the female traders of Accra.  Aldershot: Avebury. \nGuyer, J.I. (1997).  An African niche economy: farming to feed Ibadan 1968-88.  Edinburgh: \nEdinburgh University Press.  \nGuyer, J. and Hansen, K. Tranberg (2001) Introduction: markets in Africa in a new era.  \nAfrica 71, 2: 197-201. \nHarrigan, J. (1991) Malawi, in Mosley, P., Harrigan, J. and Toye, J. (eds) Aid and Power : the \nWorld Bank and Policy-Based Lending. Volume 2. Routledge, London: 201-269. \nHarrigan, J. (2003) U-turns and full circles: two decades of agricultural reform in Malawi \n1981-2000.  World Development 31,5: 847-863.  \nHartwick, E. (1998) Geographies of consumption: a commodity-chain approach.  \nEnvironment and Planning D: Society and Space, 16, 423-437.  \nHavers, M. (2001) From the chair. Small Enterprise Development 12, 3, 2-3. \nHawkey, S. (2002) Mobile phones can improve the lives of rural poor people.  Appropriate \nTechnology 29,2, 48-49. \nHodgson, G. 1988 Economics and institutions: a manifesto for a modern institutional \neconomics. Cambridge: Polity Press. \nHoltzman, J. et al. (1988) Operational Guidelines for Rapid Appraisal of Agricultural \nMarketing Systems. Washington: Abt Associates Inc. \nHorn, N. (1994) Cultivating customers: market women in Harare, Zimbabwe. Boulder: Lynne \nRienner.  \nHouse-Midamba, B. and Ekechi, F. (eds) (1995) African market women and economic \npower: the role of women in African economic development. London: Greenwood \nPress. \nHughes, A. (2000) Retailers, knowledges and changing commodity networks: the case of the \ncut flower trade.  Geoforum 31, 175-190. \n 18\nHughes, A. (2001) Global commodity networks, ethical trade and governmentality: \norganizing business responsibility in the Kenyan cut flower industry.  Area 26, 390-\n406.   \nIyenda, G. (2002) Urban poverty and households' livelihoods: sociological study of strategies \nfor development of Congolese cities [PhD dissertation]. London: Royal Holloway \nLondon.  \nIzugbara, C. Otutubikey (2004) Gendered micro-lending schemes and sustainable women’s \nempowerment in Nigeria. Community Development Journal 39, 1, 72-84. \nJackson, P., Russell, P. and Ward, N. (2003) Commodity chains: a chaotic conception.  \nRGS\/IBG annual conference, London, 3 September 2003. \nJames, Jeffrey (2000) Pro-poor modes of technical integration into the global economy.  \nDevelopment and Change 31, 765-783.  \nJayne, T.S., J. Govereh, M. Wanzala and M. Demeke (2003) Fertiliser market development: a \ncomparative analysis of Ethiopia, Kenya and Zambia.  Food Policy 28,4, 293-316. \nJones, W.O. (1968) The structure of staple food marketing in Nigeria as revealed by price \nanalysis.  Food Research Institute studies, 8, 95-123. \nKydd, J., Dorward, A. Morrison, J. and Cadisch, G. (2004) Agricultural development and \npro-poor economic growth in sub-Saharan Africa: potential and policy.  Oxford \nDevelopment Studies 32,1: 37-57. \nle Clus, K. and Mwale, J. (2004) Development plan for the Zambian maize market, ZAMTIE \nin conjunction with the Ministry of Agriculture and Co-operatives and Zambian \nNational Farmers' Union, Lusaka. \nLevin, C. E., Ruel, M.T,, Morris, S.,  Maxwell, D.G., Armar-Klemesu, M. and Ahiadeke, C. \n(1999) Working women in an urban setting: traders, vendors and food security in \nAccra.  World Development 27,11: 1977-1991. \nLove, R. (2001) The Ethiopian coffee filiere and its institutions: cui bono? Review of African \nPolitical Economy 88, 225-240. \nLyon, F. (1999) Group Enterprises, Co-operatives and Associations. Their Functioning and \nSustainability in Rural Ghana. Report prepared for Department for International \nDevelopment, Crop Post Harvest Programme. \nLyon, F. (2000a) Trust, networks and norms: The creation of social capital in agricultural \neconomies in Ghana.  World Development 28, 4, pp.663-682 \nLyon, F. (2000b) Trust and power in farmer-trader relations: A study of small-scale vegetable \nproduction and marketing systems in Ghana. Unpublished PhD Dissertation, \nUniversity of Durham, UK. \nLyon, F. (2001) Urban marketing of vegetables on the Jos Plateau.  Appendix 5 in G Porter: \nRural access issues and the supply of urban food markets in Nigeria: Focus on market \naccess for small holder vegetable production on the Jos Plateau. Final Technical \nReport to DFID, May 2001.  \nLyon, F. (2003) Community groups and livelihoods in remote rural areas of Ghana: how \nsmall-scale farmers sustain collective action.  Community Development Journal 38,4: \n323-331. \nLyon, F., Awiti-Kuffour, S. and Warburton, H.  (1998), Post harvest operations and \nmarketing of tomatoes, in Analysis of Post Harvest and Marketing Systems of Yams \nand Tomatoes in Ghana, C. Henkes and F. Afful, eds. Accra: GTZ\/FAO, 126-67. \nMacmillan, H. (2005) An African Trading Empire: the Story of Susman Brothers & \nWulfsohn, 1901 – 2005. : I. B. Tauris. \nMather, C. and Greenberg, S. (2003) Market Liberalisation in Post-Apartheid South Africa: \nthe Restructuring of Citrus Exports after 'Deregulation'. Journal of Southern African \nStudies. 2003; 29(2): 333 - 353.  \n 19\nMbiba, B. (1995) Urban agriculture in Zimbabwe: implications for urban management, urban \neconomy, the environment, poverty and gender. Aldershot: Avebury. \nMbiba, B. (2000) Urban agriculture in Harare: between suspicion and repression. in Bakker, \nN., Dubbeling, M., Günder, S., Sabel-Koschella, U., de Zeeuw, H., (eds). Growing \ncities, growing food: urban agriculture on the policy agenda: a reader on urban \nagriculture. Feldafing: Deutsche Stiftung für international Entwicklung (DSE), Food \nand Agriculture Development Centre \nMeagher, K. (2005) Social capital or analytical liability? Social networks and African \ninformal economies. Global networks 5, 3: 217-238.  \nMlozi, M. (1996) Urban agriculture in Dar: its contribution to solving the economic crisis and \nthe damage it does to the environment. Development Southern Africa. 13(1): 47-65. \nMobile Africa (2005) Hi-tech cell phones help Africans trade crops.  \n(http:\/\/www.mobileafrica.net\/news-africa.php?id=494 05\/07\/2005,last accessed \n17\/08\/05.  \nMoll, H.A.J. and Dietvorst, D.C.E. (1999) Cattle marketing in Zambia, 1965-1995: policies, \ninstitutions and cattle owners in Western Province.  In van der Laan et al. (eds) \nAgricultural marketing in tropical Africa.  Aldershot: Ashgate.  \nMortimore, M. J. (1979) The supply of urban foodstuffs in northern Nigeria.  In J.T Coppock \n(ed.) Agriculture and food supply in developing countries.  Paper presented at the \nIGU meeting, Dept of Geography, University of Edinburgh. \nMoser, C., Holland, J. (1997) Household responses to poverty and vulnerability Volume 4: \nconfronting crisis in Chawama, Lusaka. Nairobi: UNCHS (Habitat), UMP Technical \nCooperation Division (Urban management programme Policy Paper; 24).  \nMosley, P. (1987) The development of food supplies to Salisbury (Harare). In Guyer, J. (ed.) \nFeeding African Cities: studies in regional history. Manchester: Manchester \nUniversity Press for the International African Institute, 203-224. \nMupedziswa, R., Gumbo, P. (1998)  Structural Adjustment and Women Informal Sector \nTrades in Harare, Zimbabwe. Uppsala: Nordiska Afrikainstitutet, Research Report no. \n106.  \nMwanaumo, A. et al.. (1997) A spatial analysis of maize marketing policy reforms in \nZambia. American J. of Ag. Ecs. 779(2). \nMwanaumo, A. (1999) Agricultural marketing policy reforms in Zambia.  Workshop on \nagricultural transformation in Africa, Nairobi, Kenya, June 27-30, 1999.  \nMwiinga, B., Nijhoff, J.J. Jayne, T.S., Tembo, G. and Shaffer, J.  (2002) The role of mugaiwa \nin promoting household food security: why it matters who gets access to government \nmaize imports, Policy Synthesis no. 5, Food Security Research Project - Zambia \n[www.aec.msu.edu\/agecon\/fs2\/zambia\/index.htm] \nNelson, N. (1997) How men and women got by and still get by, only not so well: the gender \ndivision of labour in a Nairobi shanty-town. in: Gugler, J., (ed). Cities in the \nDeveloping World. Oxford: OUP. \nNigerian Marketing Network (2005)   Investigations on building a food marketing policy \nevidence base in Nigeria.  Briefing report,  November 2005. \nwww.dur.ac.uk\/nigerian.marketing \nNijhoff, J.J., Tembo, G., Shaffer, J., Jayne, T.S. and Shawa, J. (2003) How will the proposed \ncrop marketing authority affect food market performance in Zambia: an ex ante \nassessment to guide government deliberation.  Working Paper no. 7, Food Security \nResearch Project, Lusaka, Zambia.   June 2003. \nNijhoff, J.J., Jayne, T.S., Mwiinga, B. and Shaffer, J. (2003) Markets need predictable \ngovernment actions to function effectively: the case of importing maize in times of \n 20\ndeficit, Policy Synthesis no. 6, Food Security Research Project - Zambia, MACO, \nACF, MSU. [www.aec.msu.edu\/agecon\/fs2\/zambia\/index.htm] \nNikoi, G. (1996).  The experiences of rural banks in enterprise credit: Akuapem rural bank \ncase study, in E. Aryeetey (ed.) Small enterprise credit in West Africa.  Accra: the \nBritish Council\/ISSER. \nNissanke, M. and Aryeetey, E. (1998) Financial Integration and Development: Liberalisation \nand reform in Sub Saharan Africa. Routledge Studies in Development  Economics 11. \nNorth, D. C. (1990), Institutions, Institutional Change and Economic Performance. \nCambridge: Cambridge University Press. \nNRI (1995) Nigeria Benue State Baseline Information and Renewable Natural Resources \nBriefing Study. Unpublished report prepared for ODA by NRI Chatham April 1995 \nOkali, D., Okpara, E. and Olawoye, J. (2001) The case of Aba and its region, southeastern \nNigeria.  IIED working paper series on rural-urban interactions and livelihood \nstrategies, Working Paper 4, October 2001. \nOlayemi, J.K. (1974) Food marketing and distribution in Nigeria: problems and prospects.  \nIbadan, NISER. \nOlofin, E., Fereday, N.  Ibrahim, A.T. Shehu, A.T., Adamu, M.A. and Orchard, J.E. (1998) \nAssessment of horticultural farming systems used by resource-poor groups in urgan \nand peri-urban environments in Kano, Nigeria.  NRI, June 1998.  \nOnah, N., Lamboll, R. Udeh, E. and Orchard, J. (1998) Assessment of horticultural farming \nsystems used by resource-poor groups in urban and peri-urban environments in \nEnugu, Nigeria.  NRI, Greenwich, June 1998. \nOnyemelukwe, J. O. C. (1970) Aspects of Staple Foods Trade in Onitsha Market.  Nigerian \nGeographical Journal 12,2, 121-39. \nOrchard, J., Fereday, N.,  Lamboll, R. and Schippers, R. (1998) Assessment of horticultural \nfarming systems used by resource-poor groups in urban and peri-urban environments \nin sub-Saharan Africa.  NRI Greenwich, June 1998.  \nOsirim, M. J. (1994) Women, work and public policy: structural adjustment and the informal \nsector in Zimbabwe. Kalipeni, E., (ed). Population growth and environmental \ndegradation in southern Africa. Boulder & London: Lynne Rienner.  \nOygard, R., Garcia, R., Guttormsen, A.G. Kachule, R., Manaumo, A., Mwanawina, I. \nSjaastad, E. and Wik, M. (2003) The maze of maize: improving input and output \nmarket access for poor smallholders in Southern African Region, the experience of \nZambia and Malawi.  Agricultural university of Norway, Dept of economics and \nresource management, report no. 26.    \nPeters, P.E. (2006) Rural income and poverty in a time of radical change in Malawi.  J. of \nDevelopment Studies 42,2: 322-345.  \nPletcher, J. (2000) The politics of liberalizing Zambia’s maize markets.  World Development \n28,1, 129-42. \nPonte, S. (2002) Farmers and markets in Tanzania. Oxford: James Currey. \nPoole, N. et al. (1999) Overcoming Informational Imperfections: Closer Market \nCoordination. Mimeo Wye College, University of London \nPorter, G. (1990) Retailing in northern Nigeria: patterns of continuity and change. In A.M. \nFindlay et al. Retailing environments in developing countries. London: Routledge.  \nPorter, G. (1994) Food marketing and urban food supply on the Jos Plateau, Nigeria: A \ncomparison of large and small producer strategies under \"SAP\", Journal of \nDeveloping Areas 29, 91-110. \nPorter, G. (1995) The impact of road construction on women's trade in rural Nigeria, Journal \nof Transport Geography 3,1, 3-14. \n 21\nPorter, G. (1999) Final technical report: Access to market opportunities in Ghana’s off-road \ncommunities.  Report to the UK Department for International Development, May \n1999. \nPorter, G. (2001) Rural access issues and the supply of urban food markets in Nigeria: focus \non market access for smallholder vegetable producers on the Jos Plateau. Final \nTechnical Report to the UK Department for International Development, May 2001. \nPorter, G. (2002) Living in a walking world: rural mobility and social equity issues in sub-\nSaharan Africa. World Development 30,2: 285-300.  \nPorter, G, Harris, F., Lyon, F., Dung, J. and Adepetu, A.A. (2003) Markets, ethnicity and \nenvironment in a vulnerable landscape: the case of small-scale vegetable production \non the Jos Plateau, Nigeria, 1991-2001.  Geographical Journal 169, 4, 370-381. \nPorter, G. and Lyon, F. (2006) Groups as a means or an end? Discourses around social capital \nand the promotion of cooperation in Ghana.  Society and Space 24: 249-262. \nPotts, D. (2005) Counter-urbanisation on the Zambian Copperbelt?  Interpretations and \nImplications.  Urban Studies 42,4, 583-609. \nPreston-Whyte, E. and Rogerson, C. (eds), (1991) South Africa's informal economy. Cape \nTown: OUP \nRakodi, C. (1985) Self-reliance or survival?: Food production in African cities with particular \nreference to Zambia. African Urban Studies, 21: 53-63. \nRammohan, K.T. and Sundaresan, R. (2003) Socially embedding the commodity chain: an \nexercise in relation to coir yarn spinning in southern India.  World Development 31,5, \n903-923. \nRathgeber, E. and Ofwona Adera, E.  (eds) (2000)  Gender and the information revolution in \nAfrica.  IDRC Ottowa. \nRepublic of Zambia (2001) MAFF  Agricultural Commercialisation Programme 2002-2005, \nMAFF, Lusaka.  \nRWA Ltd (2003) Economic expansion in outlying areas, Programme completion report.  \nRipon, January 2003  \nSanyal, B. (1985) Urban Agriculture: Who Cultivates and Why? A Case Study \nof Lusaka, Zambia. Food and Nutrition Bulletin 3\/7:15-24 \nSARPN; ODI; FANRPAN (2006) Reforming maize markets and regional food security.  \nCivil Society and Regional Food Security, Policy Brief no. 6; March 13.  \nSchreiner, H. (1999).  Rural women, development, and telecommunications: a pilot \nprogramme in South Africa.  Gender and Development 7 (2), 64-70. \nSeshamani, V. (1998) The impact of market liberalisation on food security in Zambia.  Food \nPolicy 23,6, 539-551. \nSheldon, K., (ed). (1996) Courtyards, markets, city streets: urban women in Africa. Boulder: \nWestview Press. \nShepherd, A. (1997) Market Information Sytems. AGS Bulletin. Rome, FAO \nSmith, D.W. (1998) Urban food systems and the poor in developing countries.  Transactions \nof the Institute of British Geographers, 23, 207-219.  \nSmith, H. M. and Luttrell, M.E. (1994) Cartels in an \"Nth-Best\" world: the wholesale \nfoodstuff trade in Ibadan, Nigeria. World Development 22,3, 323-35. \nSmith, J. (1989) The transport and marketing of horticultural crops by communal farmers into \nHarare. Geographical Journal of Zimbabwe. 20: p. 1-13. \nStringfellow, R. (1996) Smallholder outgrower schemes in Zambia. UK Natural Resources \nInstitute. \nStringfellow, R., Coulter, J., Hussain, A., Lucey, T. and McKone, C. (1997) Improving the \naccess of small holders to agricultural services in Sub-Saharan Africa.  Small \nEnterprise Development 8, 3, 35-41. \n 22\n 23\nSudarkasa, N. (1973) Where women work: a study of Yoruba women in the marketplace and \nin the home.  Anthropological Papers, No 53. University of Michigan Ann Arbor, \nMichigan. \nTallontire, A. C. Dolan, S. Smith, S. Barrientos. (2005) Reaching the marginalised? Gender \nvalue chains and ethical trade in African horticulture.  Development in Practice 15,3 \n& 4, 559-571. \nTechnoserve (1998) Inventory Credit. Draft report. \nThodey, A.R. (1968) Marketing of staple food in Western Nigeria.  Stanford Research \nInstitute, Menlo Park, California. (3 vols) \nTrager, L. (1981a) Customers and creditors: variations in economic personalism in a Nigerian \nmarketing system.  Ethnology 20,2, 133-46. \nTrager, L. (1981b) Yoruba market organisation: a regional analysis.  African Urban Studies \n10, 43-58. \nTripp, A. M. (1997) Changing the rules: the politics of liberalization and the urban informal \neconomy in Tanzania. Berkeley: University of California Press \nUSAID (2001) A draft national policy on small and medium enterprise development  in \nNigeria.  October 2001, Abuja. \nVigo, A.H.S. (1965) A survey of agricultural credit in the northern region of Nigeria.  \nKaduna: northern Nigeria Ministry of Agriculture. \nWan, M. Y. (2001) Secrets of success: uncertainty, profits and prosperity in the Gari \neconomy of Ibadan, 1992-94.  Africa 71, 2, 225-252. \nWatts, M. (1987) Brittle trade: a political economy of food supply in Kano.  In Feeding \nAfrican Cities: Studies in Regional Social History, I Guyer (ed) Manchester:  \nManchester University Press, 55-111. \nWorld Bank (2003) Zambia: the challenges of competitiveness and diversification.  Private \nSector Unit, Africa Region, report 25388-ZA, January 10, 2003. \n \n \nAcknowledgement \nThis research was funded by the UK Department for International Development \n(DFID). However, the UK Department for International Development can accept no \nresponsibility for any information provided or views expressed. \n \n \n"}