{"doi":"10.1007\/s11097-010-9169-8","coreId":"67600","oai":"oai:eprints.lancs.ac.uk:35452","identifiers":["oai:eprints.lancs.ac.uk:35452","10.1007\/s11097-010-9169-8"],"title":"Indian cognitivism and the phenomenology of conceptualization","authors":["Kasturirangan, Rajesh","Guha, Nirmalya","Ram-Prasad, Chakravarthi"],"enrichments":{"references":[{"id":788905,"title":"Action in perception.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":785534,"title":"Aspects of the Theory of Syntax,","authors":[],"date":"1965","doi":null,"raw":null,"cites":null},{"id":785279,"title":"Bhatī of Prabhakara Misra with the juvimala of Mahamahopadhyaya Salikanatha Misra. Banaras, Chowkhamba Sanskrit Series Office.","authors":[],"date":"1929","doi":null,"raw":null,"cites":null},{"id":789462,"title":"Cambridge: Harvard University Press.[Reference to Peirce’s papers will be designated CP followed by volume and paragraph number.].","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":788341,"title":"Categorization of Natural Objects.&quot;","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":785824,"title":"Cognitive linguistics: An introduction,","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":784975,"title":"Grounded Cognition.&quot; Annual Review of","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":786574,"title":"How we reason,","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":788620,"title":"Husserl on the apodictic evidence of ideal laws.&quot; Theoria","authors":[],"date":"1954","doi":null,"raw":null,"cites":null},{"id":787443,"title":"Inference to the Best Explanation.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":786835,"title":"Judgment under uncertainty: Heuristics and biases.","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":785957,"title":"Meltzoff","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":789587,"title":"Mental reality,","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":787144,"title":"Philosophy in the flesh : the embodied mind and its challenge to Western thought.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":788090,"title":"Psychologism in logic: Husserl's critique.&quot;","authors":[],"date":"1976","doi":null,"raw":null,"cites":null},{"id":786265,"title":"The Cambridge handbook of thinking and reasoning, Cambridge Univ Pr.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":789149,"title":"The collected papers of","authors":[],"date":"1931","doi":null,"raw":null,"cites":null},{"id":787773,"title":"The Navya-nyāya doctrine of negation: the semantics and ontology of negative statements in Navy-ayāya philosophy,","authors":[],"date":"1968","doi":null,"raw":null,"cites":null},{"id":785040,"title":"The Origin of Concepts.","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":787478,"title":"Vision : a computational investigation into the human representation and processing of visual information.","authors":[],"date":"1982","doi":null,"raw":null,"cites":null}],"documentType":{"type":null}},"contributors":[],"datePublished":"2011","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35452<\/identifier><datestamp>\n      2018-01-24T03:07:59Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Indian cognitivism and the phenomenology of conceptualization<\/dc:title><dc:creator>\n        Kasturirangan, Rajesh<\/dc:creator><dc:creator>\n        Guha, Nirmalya<\/dc:creator><dc:creator>\n        Ram-Prasad, Chakravarthi<\/dc:creator><dc:date>\n        2011<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s11097-010-9169-8<\/dc:relation><dc:identifier>\n        Kasturirangan, Rajesh and Guha, Nirmalya and Ram-Prasad, Chakravarthi (2011) Indian cognitivism and the phenomenology of conceptualization. Phenomenology and the Cognitive Sciences, 10 (2). pp. 277-296. ISSN 1572-8676<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35452\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1007\/s11097-010-9169-8","http:\/\/eprints.lancs.ac.uk\/35452\/"],"year":2011,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"1 \n \n                                                           \nIndian Cognitivism and the Phenomenology of Conceptualization \nRajesh Kasturirangan, Nirmalya Guha and Chakravarthi Ram-Prasad1 \nAbstract. We perform conceptual acts throughout our daily lives; we are always judging others, guessing \ntheir intentions, agreeing or opposing their views and so on. These conceptual acts have phenomenological \nas well as formal richness. This paper attempts to correct the imbalance between the phenomenal and \nformal approaches to conceptualization by claiming that we need to shift from the usual dichotomies of \ncognitive science and epistemology such as the formal\/empirical and the rationalist\/empiricist divides– to a \nview of conceptualization grounded in the Indian philosophical notion of ‘valid cognition’. \nMethodologically, our paper is an attempt at cross-cultural philosophy and cognitive science; ontologically, \nit is an attempt at marrying the phenomenal and the formal.  \n1. Introduction: Indian Cognitivism.  We perform conceptual acts throughout our daily lives; \nwe are always judging others, guessing their intentions, agreeing or opposing their views and so \non. These conceptual acts have both phenomenological as well as formal richness. On the \nphenomenal side, there is an experiential quality to judging, agreeing and denying of a “center-\nsurround” nature, i.e., a core phenomenal feeling of what it is like to judge, agree and deny \nsurrounded by the emotional residue of judging, agreeing and denying. On the formal side, \nresearch in cognitive science has uncovered a complex computational structure behind ordinary \nthinking and reasoning (Kahneman, Slovic et al. 1982; Holyoak and Morrison 2005; Johnson-\nLaird 2006; Tenenbaum, Griffiths et al. 2006). Partly because research into the computational \ncomplexities of conceptualization has yielded so many unexpected insights, research in cognitive \nscience has highlighted the formal side of conceptualization to the detriment of the phenomenal. \nCognitive scientists ask why children are so easily able to generalize from one instance of seeing \na dog to other instances of seeing a dog (as a dog). They have shown almost no interest in asking \nwhat it is like for a child to generalize from seeing one dog as a dog to seeing other dogs as dogs. \nThis paper attempts to correct the imbalance between the phenomenal and formal approaches to \nconceptualization by making the radical claim that in order to integrate phenomenality and \nformality, we need to shift from the usual dichotomies– formal\/empirical, rationalist\/empiricist – \nto a view of conceptualization grounded in the Indian philosophical notion of ‘valid cognition’. \nMethodologically, our paper is an attempt at cross-cultural philosophy and cognitive science; \nontologically, it is an attempt at marrying the phenomenal and the formal.  \nConcepts have been a central topic throughout the history of investigation into mental \nphenomena. In the west the nature and origin of concepts and conceptual structure has been \nintensely debated ever since Plato (speaking through the mouth of Socrates) declared that \nconcepts like JUSTICE cannot be learnt through sensory experience and must inhere in the soul. \nPhilosophers both East and West have debated the key issues related to concepts such as the \nnature of meaning, the relation between language and thought, the relation between cognition \nand perception. These philosophical arguments been greatly augmented by the application of \nexperimental and theoretical tools. Without the logical and mathematical tools developed by \nFrege, Russell and others, we would still be in a fog over how logical relations can be computed \nin a physical system (though deep puzzles still remain, especially about the ability of \ncomputational systems to carry meaning). Similarly, without Eleanor Rosch’s work on \n \n1 Kasturirangan: National Institute for Advanced Studies, Bangalore; Guha: Indian Institute of Technology, Kanpur; \nRam-Prasad, Lancaster University. [Equal Weight] \n2 \n \ncategorization (Mervis and Rosch 1981) we would be stuck with classical categories. Even more \nimportantly, these computational and empirical investigations greatly expanded our \nunderstanding of the scope, nature and complexity of conceptual structure. Three discoveries \nstand out from this period of theorizing about the mind: \n(1) Conceptual Structure is complex. Classical philosophers greatly underestimated the \ncomplexity of structure underlying even the simplest of conceptual phenomena. Consider the \nfollowing pair of statements: \n1. They have a Bose system in their house \n2. There is a snake in the house! \nThe interaction between speaker intention, the semantics of IN and our common sense \nunderstanding of the world is such that we conceptualize the two statements quite differently. \nHow we do it has become a matter of great interest. \n(2) Conceptual Structure is automatic and unconscious. Like perception and language, most of \nconceptual processing is below the radar screen; it happens automatically and without any \nconscious input or interference. Once again, if we take the two statements in (a) above as \nindicators, we effortlessly combine the words in the sentence along with our encyclopedic \nknowledge of the world into an understanding of the speakers intentions, all of which happens \nunconsciously. \n(3) Conceptual Structure is Pervasive.  A child picks up a cup from a table and immediately \nknows that the cup is no longer on the table. She also knows (even if she doesn’t always obey the \nrule) that if the cup is tilted, the water will spill out. These are ways of acting in the world, and \nyet they are also conceptual, in that these acts can be evaluated as being right or wrong. \nSimilarly, a driver approaches a red light at night and if it is Bangalore he proceeds without \nstopping while if it is Stockholm he stops and waits until it turns green. In both of the above \ncases, we see conceptualization reaching outwards via the senses and upwards towards social \nnorms and rules of behavior. \nThe first two of these maxims has a methodological consequence: if you want to study \nthe mind, do not rely too much on introspective reports or purely philosophical formulations. The \nmove away from introspection and philosophical speculation in the study of the mind is now \nuniversally accepted in the mind sciences and even to some extent in the philosophy of mind. \nThe ubiquity of conceptualization is more controversial and has invited two very differing \nresponses: one from the rationalist camp, which denies any genuine similarity between \nseemingly conceptual phenomena across mental faculties and the empiricist response, which says \nthat we need to have a ‘cognitive commitment’ (Evans and Green 2006) towards theories that cut \nacross mental faculties. While we believe in the cognitive commitment, we also believe that the \nempiricists have not adequately addressed their rationalist critics; and that once those critiques \nare taken seriously, we have to abandon the rationalist-empiricist axis altogether.  Our claim is \nthat conceptualization can usefully be seen through the Indian philosophical notion of ‘valid \ncognition,’ which plays a central role in all theories of Indian epistemology. We claim that a \ntheory of conceptualization based on valid cognitions is geared towards satisfying the cognitive \n3 \n \ncommitment, since it naturally cuts across mental faculties. Further, a theory of \nconceptualization based on valid cognitions is phenomenologically rich - it is not biased in favor \nof formal models. While Indian philosophy has many competing accounts of valid cognitions, all \nof them have the advantage of being experiential and inferential at the same time. Since valid \ncognition-based accounts package inferential and experiential features into a coherent whole, \nthey point to an expanded role of phenomenology in the cognitive sciences, a role that goes well \nbeyond the usual topics of perception and action into relatively less explored territories of \nconceptualization and reasoning.   \nIn our Indian philosophical approach, there is no intrinsic need to think that we have to \nchoose between two different aetiologies for conceptualization, namely innate mappings on to \nformal truths or representations of environmental input; in short between nativism and \nempiricism. Instead, we study a situation where mappings between reasoning structures depend \non intrinsic features of those structures; yet, those mappings exist only because of the \nembeddedness of the subject in her environment. For the first reason, this is not psychologism - \nthe contingent tying of systematic reasoning to the vagaries of the subject's environmentally-\naffected states. The second reason shows why humans work in a way impossible for computers \nas we currently understand them. Looking in particular at what some Indian philosophers -the \nAdvaitins- argue is an independent instrument for attaining knowledge, – arthāpatti or \n‘postulation’ as it is normally translated – we seek to demonstrate the quite general claim that \nIndian approaches to concepts and knowledge is ‘cognitivist’. The goal of this paper then is \ntwofold: \n(a) Recontextualize the debate about nature of conceptualization using Arthāpatti as a case \nstudy. \n(b) Expand the scope of phenomenological inquiry in the cognitive sciences by stressing the \nexperiential basis of valid cognitions.  \nOur desire to situate theories of conceptualization in the framework of valid cognitions is \nnot a purely theoretical exercise; we believe that the divorce between the formal and the \nphenomenal has led to flawed account of conceptualization that have deleterious consequences \nfor cognitive science, AI and any other field where formal methods have dominated the study of \nembedded systems. We believe that there are significant elements of Indian philosophy that can \ncontribute to a cognitive theory of conceptualization, i.e., the manner in which concepts are \nentertained by individual subjects. Indian philosophers were well aware of the distinction \nbetween - what we would now call - psychological and abstract accounts of concepts. Classical \nIndian debates generally tended to use lexical concepts as examples, although the atomicity and \nconstruction of concepts was as much an issue there as in contemporary times. Similarly, while \nthere was a broad debate between taking concepts to be abstracta (the Nyāya school) and as \nmental particulars (most Buddhists schools), with intermediate positions, none of the main \npositions, including Nyāya, denies that the entertainment of concepts - conceptualization - e.g., \nin specific concept-deploying perceptions (savikalpika pratyak\u001fa) - involves cognitions. We \nhope to remain neutral on the ontology of concepts, focusing instead on the key point that \n‘conceptualization’, namely, specific instances of entertaining concepts, is cognitive - and by \n‘cognitive’, we mean occurring in specific episodes of that central term of art in India \n4 \n \nphilosophy, jñāna, translated as ‘cognition’. For sake of brevity, we have narrowed our \npresentation of Indian philosophical ideas to one particular school, Advaita, although we use \narguments from another school, Nyaya, since Advaita and many other schools accept much of \nthe general theory of cognition originating in the Nyaya school. Before we turn to the Indian \nnotion of cognition and its relationship to concepts, let us look at a brief sketch of the problems \nwith concepts in contemporary cognitive scientific discussions. \n \n 2. Between Form and Experience. Most of us are used to walking to a table, picking up a cup \nof tea and then drinking the tea at leisure. Without any explicit effort, we know that once we pick \nup the cup of tea, it is no longer on the table and that when we drink the tea, it is no longer in the \ncup. At the other end of the spectrum, we know, equally effortlessly, that a cup is a kitchen \nutensil and kitchen utensils are home furnishings. The first kind of effortless thought is about the \nconcrete structure of the world, while the second kind of effortless thought is about abstract \nconcepts and their relationship. We are equally good at both, but it has proven almost impossible \nto design computer systems that have effortless common sense. To the extent scientists and \nengineers have managed to replicate common sense in computational models, they have had to \nbuild massively complex systems. The standard explanation is that human behavior and \nexperience are deceptively simple, that ordinary activity is grounded in the dynamics of billions \nof neurons acting in concert. There is surely something right about behavior emerging from \nlarge, complex networks but one also wonders whether the emphasis on complexity stems from a \nmetaphysical rather than a mechanical problem. What if our difficulty in engineering computers \nthat behave like humans has more to do with unstated philosophical assumptions about the \nrelationship between the body, self and world?  \nConsider the English preposition ON. Cognitive scientists believe that the meaning of \nON is stored in the mind of every English speaker. However each time ON is used (for example, \nin the sentence “The cup is ON the table”) it refers to a particular cup’s relationship with a \nparticular table, both of which are out in the world. There are deep differences between the \nstructure of the semantics of ON and the structure of the entities in the world referred to by ON. \nON is abstract and schematic, in that ON can be used in an infinite variety of situations \n(cups on table, tables on carpets, carpets on floors etc), while the world is particular and fully \nformed (each cup and table has a particular shape and size and location). Further, the semantics \nof ON is highly sensitive to context. Consider the three statements below: \nThe pot is on the floor.  \nThe dancer is on the floor. \nThe drunk is on the floor. \nThe meaning of ON in these three cases is rather different: in the first, it is about the \nlocation of the pot; in the second it is about a dancer who was somewhere else appearing on the \nstage, and in the third, it is a description of a person’s state. These are clearly related notions of \nON, but the dominant theories of conceptualization in the cognitive sciences cannot model the \ncontext sensitivity of conceptualization, while maintaining the compositional structure of our \n5 \n \ncognitions. Rationalist theories are good at modeling compositionality, while empiricist theories \nhandle context sensitivity better, but no theory seems to combine the two into one framework. \nWe briefly summarize the shortcomings of some of the major theories of conceptualization \nbelow and point out their struggle with the rationalist-empiricist axis.  \n2A. Concepts as Definitions. Perhaps the oldest theory of conceptualization is that the meaning \nof a concept is given by necessary and sufficient conditions. For example, we could define the \nconcept BACHELOR as “unmarried man”. Unfortunately, outside mathematics and certain areas \nof science, definitions don’t work. Is the Pope a bachelor? Perhaps we could solve the problem \nby redefining BACHELOR as “a man who remains unmarried despite the social license to \nmarry.” Then what about the Medieval Popes, like the Borgias, whose children inherited their \nproperty? The definitional account runs quickly into three insuperable problems:  \n-Necessary and sufficient conditions are hard to find. \n-Concepts have prototypical and not so prototypical examples, while definitions do not \ndistinguish between one exemplar of a concept and another. For example, a penguin seems less \nprototypical of the concept BIRD than a sparrow. Why? \n-Definitions use concepts that themselves require definitions; if a bachelor is an unmarried man, \nwhat does ‘unmarried’ mean? How do we avoid infinite regress? \n2B. Concepts as Prototypes. The definitional theory of concepts was much influenced by \nmathematical and scientific concepts. However, most ordinary human concepts are used for day-\nto-day categorization; acts that happen automatically and without any conscious deliberation. An \nearly hominid would have needed to classify an animal as predator or prey very quickly. A snap \ncategorization is in order to tell the motor system to hunt or to flee.  Prototypes allow us to \nclassify a stimulus quickly and to convey the results of that classification to the motor system. \nResearch by Eleanor Rosch and others (Mervis and Rosch 1981) argues for a basic level of \ncategorization where processing and categorization happens automatically and quickly, faster \nthan at any other level. Unfortunately, prototype theory does not handle compositionality well. \nConsider the concepts PET, FISH and PETFISH. As concepts, PET and FISH clearly combine to \ngive PETFISH. In what way is a prototype for PETFISH a combination of prototypes for PET \nand FISH? \n2C. Concepts as Theories. Perhaps, concepts are proto-theories that ‘explain’ the data, i.e., the \nobjects represented by that concept (Gopnik and Meltzoff 1997). As more data arrives, \nconceptual change occurs. A child might start with thinking that any transparent drinkable liquid \nis water, later figure out that gin and water are different substances and eventually learn that \nwater is individuated by the chemical H2O. There are two problems with the theory-theory: \nIt does not handle metaphorical uses of a concept, which are quite common. For example, how \ncan the theory-theory explain “my soup is too watery?” \nTheories are too ‘stable’ to handle context sensitivity. Suppose you are in the middle of the \ndesert and you notice a pool of dark, brackish liquid. That liquid will not qualify as water if you \nare thirsty, but is perfectly fine if you need something to hose off the dirt caked on your car.  \n2D. Embodied Conceptualization. Cognitive linguists have tried the hardest to reconcile the \nformal and the experiential aspects of cognition; consequently, our presentation of the \nshortcomings of the embodied approach to conceptualization is the most detailed of the four \ntheories of conceptualization we consider. Metaphor theorists like to point out that our \nconceptualization of abstract concepts often comes from concrete sources such as space, time, \nand the structure of the body – for example, note that we refer to political leaders as “heads of \nstate”. Take spatial concepts for example. As cognitive linguists have shown, space is an \nimportant source of semantic intuitions (Lakoff and Johnson 1999). Furthermore, spatial \nconcepts have been formalized in many ways in modern mathematics. The particular manner in \nwhich linguistic concepts are schematic can often be described by simple topological relations \nbetween a Figure object (usually smaller, more likely to move) and a Ground  \n \n \n \n \n \nFigure \nGround \nIN  Figure\nGround\nON\n \n \n \n6 \n \n \nGround\nFigure\nAROUND\n \n \n \n \n \nobject (usually larger and more static) such as containment (encoded by IN), contact (encoded by \nON), and encirclement (encoded by AROUND). Figure 1 above shows some of the topological \nrelations encoded by spatial prepositions in English. Since these prepositions make reference to \nobjects whose relationship with each other is geometric, it is natural to assume that any \nmathematical theory that formalizes the relationship between topology and geometry will have \nsomething to say about the relationship between spatial concepts and their objects. Of course, not \nall concepts are spatial, but as research in cognitive linguistics has demonstrated, spatial \nrepresentations inform our conceptualization of non-spatial domains such as politics (Lakoff and \nJohnson 1999). Nevertheless, while embodiment oriented explanations of concept representation \nhave yielded crucial insights, they cannot be the final story. \nFigure \nFROM \nGround\nFigure \nTO\nGround \nFigure 1: Topological Relations between a Figure object and a Ground object encoded \nby IN, ON, AROUND, TO and FROM\n7 \n \nThe first problem with the embodied view of the mind is that the body is not a well \ndefined object. If, by body, you mean the surface skin, musculature, skeleton and the organs (i.e., \nthe visible external and internal body) then it is hard to see how that notion of body constitutes \nsome of the essential features of conceptualization – like the fact that concepts are abstract. In \nwhat way is justice embodied in the muscles? Principles like fairness or equality might be \ntransparently present in our experience, but how are they in our body? An embodied cognitivist \nmight respond that our experience is conditioned by the kinds of bodies we have, that our notions \nof justice are influenced by the fact that we experience other people having bodies similar to ours \nand therefore needs and rights similar to ours. However, there is a slip betwixt cup and lip. How \ndo we go from other people having bodies similar to ours to having rights similar to ours? \nHaving a similar body licenses an inference about similarity of rights but only if we presuppose \nthe existence of a being enjoying those rights. After all, we do not feel any need to grant \nmanikins rights.  \nThis brings us to the second objection to embodied cognitivism, which is, when do we \nmake projections from embodied experience and when do we not? Take a typical example, one \noften used in illustrations of embodiment in conceptualization; the metaphor that LOVE IS A \nJOURNEY. It is true that we use that metaphor all the time, but we also know where to stop \nmaking the analogy. You might take a journey from Bangalore by train, get off at Madikeri, take \na taxi and go to your hotel. Similarly, you might be in love and break up after all while. But you \ndo not take a taxi and go to a hotel or anything that might be an analogical counterpart in the \nLOVE frame. How do you know when to stop making the analogy? Where does that innate sense \nthat metaphors only go so far come from?  \nSocial norms about what counts as an appropriate analogy clearly have a place here; \nchildren are unceasingly learning what kind of match matters socially:  With collections, the \nchild discovers that to project the count-matching idea of ‘size’ onto collections, with priority \nover other ideas, is successful in two important senses.  First, it is socially rewarded by adults.  \nSecond, it gives manipulative power over collections, physically and socially.  You can fit the \nstones into a count-matched set of holes, or trade them for a matched set of coins.  The \nphenomenology of counting includes the phenomena of matching by various criteria such as \nsolidity, precision and rightness. However, learning to match using socially relevant criteria is \nnot enough. Is it logically possible for such criteria to make an impact, without a cognitive \nprinciple able to recognize and apply abstract criteria, depending on the context?  In a corporate \nsetting, we must be able to ignore body size when figuring out the social hierarchy (your boss \nmight be short and skinny. In a vote — where numbers dominate, by definition — do we count \nnoses, or share certificates?  The schemata (for objects or social relationships) signify less than \nthe process of forming them, and the moment-to-moment choice among them.  In the absence of \na universally valid set of abstractions for all problems, there must be a gamut of ways to cognize.  \nTo base a foundational theory on only one such way – the embodied inputs - is an error. \nGrounded cognition theories (Barsalou, Kyle Simmons et al. 2003; Barsalou 2008) recognize \nthat concepts can be grounded in modal (but non-bodily) representations via the means of \nsimulation. These theories differ from classical theories primarily in emphasizing that the \nrepresentations underlying human conceptual systems are not amodal as claimed by the classical \ntheorists. Like us, grounded cognition theorists blur the rationalist-empiricist divide by accepting \na genetic basis for seemingly empiricist capacities like mental imagery and simulation. Our \n8 \n \napproach is compatible with grounded cognition, though we are agnostic as to whether concepts \nare represented in modal or amodal form. Since our account of conceptualization is at the level \nof human competence (see section 5), we do not make claims about the underlying \nrepresentations (see Marr (1982) for an account of the difference between the competence level \nand the representational level of explanation). For example, we are open to the possibility that \ndifferent modal representations of space are constrained by the same abstract geometric \nprinciples as it is that our notions of geometry come from the integration of spatial \nrepresentations across modes.    \nEmbodiment - and groundedness in general- are a part of the human (animal) condition \nbut not the whole of it. The problem with all the four accounts of conceptualization summarized \nin this section is that they are constantly grappling with the rationalist-empiricist axis, one pole \nof which denies experience and the other which denies any innate structure. Unfortunately, \nconceptualization has both! The key fact needing explanation is the capacity of an organism to \nrespond appropriately to environmental stimuli without being determined by those stimuli. \nAppropriate responses require that organisms be embedded, while the creativity of the response \nrequires that the mapping from input to output depend on structures internal to the organism. \nParadoxically, what seems strictly internal to the organism is deeply embedded in the world. This \nis where Indian theories of conceptualization based on valid cognitions might be helpful to \nmodern cognitive science. As we will see in the next section, the logical structure and the \nembodied structure of being human are enfolded within our experience. This enfolding can be \nanalyzed using the techniques of Indian reasoning. In section 4, we will look at arthāpatti, which \nis a technique of reasoning, or an instrument for attaining knowledge, according to some Indian \nschools. As organisms that occupy space and place, we know that we do not occupy two places \nat one time. ‘Postulation’ (arthāpatti) helps us understand how ‘X not being in place p’ (in some \nway) necessarily implies that ‘X is in place q’ without it being a formal consequence of the \naxiomatization of space. Indian philosophy can help us address an important question in the \nstudy of conceptualization: how can we study conceptual structure without reducing \nconceptualization to ‘pure formalization’ or to ‘pure embodiment?’ The notion of ‘valid \ncognition’, within which the analysis of postulation is located, is innocent of the knowledge of \nthe formal-empirical axis. It thereby offers a different way of going about looking at how \nconcepts work. In the next section, we elucidate the basic structure of valid cognition and then \nshow how it can be used to negotiate around the axis between between rationalism and \nempiricism.  \n3. Valid Cognitions. In order to get at the way in which ‘valid cognition’ (pramā) combines \nepistemological and phenomenological features, let us first look at some broad features of the \nconcept of cognition (jñāna or, less commonly, dhī). To start with, we will look at the \ndescription of cognition by the school of Nyāya, because its general analysis is widely accepted \nby most of the other Indian schools. This in turn will lead us to the next section, on a particular \nmeans of securing knowledge, according to the Advaitins, in which the deployment of concepts \nis likewise seen to involve both formal and empirical elements.  \nAccording to the Nyāya school, a cognition is something that a subject-self (ātman) \npossesses, and is intentional, in that it is always ‘with object’ (savi\u001fayaka); such that  cognitions \ncan be distinguished by their taking different things (object-as-thing (viśe\u001fa)) as their objects \n9 \n \n(object-as-that-which-is-related-to (artha)(Dravid 1996; chapter 4, verse 4). In its developed \nform, Nyāya even holds that intentionality is a uniquely constitutive feature \n(svarūpasa\u001fbandha) of cognition – describing consciousness quite generally in terms of its \ncapacity to take other things as object (parata\u001f-prakāśa, other-illuminating) (Ram-Prasad \n2007). \nAccording to the Naiyāyika, fresh cognitions – as opposed to memory – are divided into \ntwo categories, valid (pramā) and invalid (apramā). A valid cognition is a non-accidentally true \ncognition, generated through a prescribed epistemic instrument. The epistemic instruments are \nour sense organs and different forms of reasoning. Perception is what we directly have through \nour sense organs. One particular form of inference (called anumāna) is another dominant \ninstrument for gaining knowledge: we may form a hypothesis of the form, ‘all the cases of x are \ncases of y’ (e.g., ‘all the cases of being cordate are cases of being renate’), on the basis of \nperceptual experience. Such a ‘hypothetical’ cognition is the cognition of pervasion (vyāpti) of \nthe state-of-being-cordate by the state-of-being-renate. When we combine this with a perceptual \ncognition, ‘this is a case of x’, we get another cognition, i.e., ‘this is a case of y’ (e.g., when we \nfind a cordate, we infer that it is renate too). Such a cognition is hypothetico-deductive (anumiti) \nand what we mean by the term ‘inference’ in this article is the hypothetico-deductive inference \nthat is formed in the aforementioned manner.  Then, according to the Naiyāyikas and other \nschools, there is testimony (śabda) as another instrument for gaining knowledge. When a person \nof trust (their trustworthiness itself determined criterially), who knows that, ‘a is b’, tells us that, \n‘a is b’, we cognize that a has the property of being b. This testimonial cognition is actually a \ncombination of two cognitions rooted in experience; the cognition of the semantic relationship \nbetween words and meanings and the auditory cognition of the sentence, ‘a is b’. A cognition is \nvalid when it is true and is caused by epistemic instruments.  \n Doubt, illusion and error are standard examples of invalid cognitions. We need not go \ninto the elaboration within the Nyāya theory of the ways in which cognitions are invalid; suffice \nit to say that the general category consists in cognitions which somehow deviate from things as \nthey are and usually result in judgements that are false. Nyāya is concerned primarily with the \nepistemological implications of cognition, and the tradition has not paid much attention to the \nnature of cognitions that are not about in\/validity. They draw upon a commonsense intuition that \nsome sorts of cognitive states are constitutively intentional, in occurring because of an objective \ntrigger: ‘perceiving, inferring, knowing, doubting, wondering, guessing, remembering, \ndreaming’, in Matilal’s rendering of the standard Nyāya list (Matilal 1968). In effect, this \napproach to cognition is remarkably like a ‘centre-surround’ view, in that the core is made up of \ncognitions (strictly speaking) that are primarily related to objects and have intentional content, \nsurrounded by cognitions (broadly speaking) that are secondarily related to objects and are states \nthat the subject undergoes without primary intentionality. \nComparative philosophy has grappled with how alien this focus on human experience \neven at the heart of epistemology in India must seem to the 20th century Western analytic \ntradition. The centrality of cognitions to epistemology in Indian philosophy is crucial to our \nargument. It is true that from the perspective of the anti-psychologism of Frege and Husserl, \nIndian discussions of reasoning can seem ‘psychologistic’. But at least since the mid-20th \ncentury, there have been specific concerns about this form of anti-psychologism within Western \n10 \n \nphilosophical traditions themselves (Kusch). One important point is that Husserl’s anti-\npsychologism, at any rate, turned on an absolute conception of logical truths as ideal (with the \nconcomitant fear that looking at the logic of human reasoning will condemn such study to the \nrelativism of people’s individual psychologies). But the sciences themselves are about the ‘real \nrather than the ideal’ (Naess 1954), and so logic concerns the factual in a way that Husserl’s anti-\npsychologism cannot see. Even more relevant to the modern Indian concern about the problem \n‘psychologism’ causes for Indian theories of valid cognition is the central argument of Jack \nMeiland’s (1976) defense of Husserl’s original opponent, Benno Erdmann. (It is by no means \nnecessary to think that Erdmann’s specific views are comparable to Indian theories.) The anti-\npsychological argument is that if logic is about mental states, judgments and other psychological \nentities, then they would have content, whereas logical laws should have no such real content. \nThis seems to apply to Indian theories of valid cognition. Meiland’s response is that even if the \nlaws of logic are not about actual human reasoning (and the psychology in which it is \nembedded), they are still true for human beings precisely because of their psychology; to put it \nanother way, the laws of logic are part of human competence (Chomsky 1965). The law of non-\ncontradiction is not stated just with reference to human beings; but ‘it is true for human beings \nby virtue of their nature’ (Meiland 1976). It is, therefore, not particularly necessary to worry \nabout Indian theories of valid cognition being ‘psychologistic’. \nIn fact, as the first section indicates, contemporary mind sciences have struggled with the \nconsequences of taking human reality to turn on the polarity between the formal\/objective and \nthe empirical\/subjective. Problems in the understanding of cognition are as often created as they \nare solved by searching for purely formal features of reasoning and then trying to apply them to \nenvironmental inputs. As has been amply recognized in recent decades, this split between the \ncontingent empirical input from the environment and the formal structures of logical reasoning \nmakes for an effective third-personal account of human cognition, but leaves out the \nphenomenology of the first-person perspective. Apart from issues in the study of consciousness, \nthis lacuna has also created problems in the programme of capturing human reasoning \ncomputationally. Our claim is that, by treating cognitions as the focus of the analysis of actual \nhuman reasoning – cognition, seen as the phenomenology of structured human embeddedness in \nits environment – Indian philosophy offers a more sustainable unit of analysis. \nThe relevant unit here is the notion of a valid cognition. A valid cognition is one which is \nboth true by virtue of some mapping of reality, and attained through evidentially sound \nprocedures in accordance with the proper function of epistemic instruments. How truth is \nsecured, what those procedures are, how their functioning is monitored, by whom or what, and in \nwhat the attainment of validity consists are all matters of debate. But the point to note here is that \nthe concept of a valid cognition is a combination of what are three different issues in western \nthought: truth (satya), as a mapping of some feature of reality; valid cognition (pramā), as some \nvirtuous quality regarding that reality, possessed by a subject; and phenomenality (prakāśa), as \nsomething that the subject undergoes (i.e., as something it is like for the subject). A valid \ncognition therefore is neither formal nor empirical. It is not formal, in that its content is specific \nto the subject, even if a description of that content can function as a template for other \nindexically-adjusted contentful subjective states. It is embedded in the phenomenological \nspecifity of the subject. But it is not empirical as such in non-perceptual cases. As our analysis of \na class of conceptual mappings to epistemologically consistent conclusions – the mode of \n11 \n \ngaining knowledge called arthāpatti or postulation – will show, valid cognitions, even when they \nare phenomenological by definition, can also derive their epistemic status from within the mental \nspace of the subject and not from environmental inputs. \nIn this essay, what we want to consider is how, regardless of how the Indian thinkers \nanatomize valid cognitions, these valid cognitions are both phenomenological and \nepistemological. In particular, we want to look at how certain valid cognitions are held to attain \nvalidity through the deployment of conceptual reasoning. For it is here that the notion that \nconcepts can be non-empirical, non-formal and phenomenal is explored; a notion that sounds \nimpossibly hybrid from the conventional western analytic viewpoint, but might offer a plausible \nway forward for contemporary challenges recognized in the mind sciences. We want to look at a \nparticular Advaitic instrument called arthāpatti or postulation which brings out clearly how \nconceptuality and phenomenality are two sides of the same thing.  \n4. Postulation. The Advaita school of classical Indian thought claims that there is a specific, \nindependent epistemic instrument called arthāpatti, commonly translated as ‘postulation’. We \nare not here concerned with the debate with the Nyaya school as to whether postulation is a \ndistinct epistemological mode separate from anumāna, commonly translated as a specific type of \n‘inference’. Anumāna is the specific mode of reasoning wherein, based on prior knowledge of \ncorrelations – like ‘where there is smoke, there is fire’, the perception of smoke on the mountain \nleads to the hypothetico-deductive conclusion, ‘there is fire on the mountain’. In order to indicate \nthis specific and limited idea of inference in classical Indian thought, we will use the italics \ninference in this essay. We believe that our general arguments for the phenomenological nature \nof conceptual activity, and the structuring of concepts through the human embeddedness in the \nworld can work with an analysis of anumāna as well (if Nyaya is right that arthāpatti is actually \na form of anumāna). However, we find the Advaitic notion of arthāpatti (postulation) \nparticularly helpful and clear in helping us demonstrate our argument; and so we will continue to \nfocus on it without prejudice to the debate on whether postulation can be re-read as a particular \nform of inference.  Note, however, that arthāpatti is also inference in the general sense but the \ncontrast is with inference in the specific sense of anumāna. Postulation covers conceptualizations \ncommon in ordinary discourse. Consider reasoning in the form of these statements: \n1. Devadatta is not at home.  \n2. He must be somewhere else. \nHuman beings make this kind of statements all the time; they are part of the automatic \nbookkeeping we do with the furniture of the human world. These automatic conceptual leaps are \nin some sense the counterpart of metaphors in the domain of reasoning. Just as in the process of \nunderstanding we make a cognitive mapping from love as an emotion to love as a journey, we \nalso make cognitive mappings from one conceptualization about the state of the world to another \nconceptualization about the state of the world that is not directly connected with the first.  \nAt first glance, arthāpatti resembles abduction (Peirce 1931; Lipton 2000). To see why \nthis is not so, let us first look at how induction and abduction differ in direction, before going on \nto arthāpatti and abduction. Let us consider the following pair: \n12 \n \n                                                           \n(a) All balls in this particular random sample are red; all balls in this particular random sample \nare taken from this urn; therefore, all balls in this urn are red. \n \n(b) All balls in this urn are red; all balls in this particular random sample are red; therefore, all \nballs in this particular random sample are taken from this urn.  \n \n(a) is an inductive reasoning while (b) is abductive. In the Indian framework both can be \ntranslated into the language of inference (anumiti). The schematic representation of an inference \nis: z is a case of y, since z is a case of x; and this is based on the pervasion (between x and y) \nwhich should be stated as: any case of x is a case of y. Now the above inductive reasoning will \ndefinitely fit into the schematic representation of the statement of pervasion. The Indian version \nof the above inductive inference would look like the following:  \n \n(a’) Any case of ‘(a ball’s) being a member of a particular population from which a random \nsample has been drawn’ is a case of ‘being red’.2 \n \n(a’) has been rightly hypothesized because (i) each ball of the random sample is red, and \n(ii) each has been taken from that particular population. (i) and (ii) are ‘observational sentences’ \nthat serve as the empirical basis for (a’). The Indian logician would say that one can validly \nconclude (a’) since one has seen that each ball randomly taken from the urn is red (sahacāra-\ndarśana), and no ball taken from the urn is non-red (vyabhicāra-adarśana). (a’) is a statement of \npervasion for the Indian logician. Inductive generalization takes place thus. Any hypothesization \nof pervasion must have some observational ground that has been supported by real data. Now the \nabductive inference (b) too can be translated into the Indian inferential language. It is the \nfollowing: \n \n(b’) This is a case of ‘drawing a random sample only from a particular population’, since it is a \ncase of ‘having only red balls both in the random sample and in the particular population’.  \n \nHere too a pervasion is involved, and it is stated in the following proposition: \n \n \n2 For the Indian logician, the relation of pervasion holds between two properties (dharma). For example, they would \nsay that ‘cordate-ness  pervades renate-ness’  in order to express the following meaning: ‘any case of being a renate \nis a case of being a cordate’, or simply ‘all renates are cordates’. This ‘case of’ talk is the closest to the Sanskrit \nproperty-based formulation.    \n13 \n \n(b’’)  Any case of ‘having only red balls both in a random sample and in a particular population’ \nis a case of ‘drawing the random sample from the particular population’. \n \n(b’’)  has an observational basis. Normally abduction or inference to the best explanation \nis understood thus: If E is an inference to the best explanation of a set of events O according to a \ntheory T, then (i) O must be a consequence of E according to T, and (ii) T and E must be \nconsistent. Here T is nothing but an observation-based hypothesis that is our statement of \npervasion. We may see how this is different from postulation. Here is a case of postulation: A \ncase of not-being-here-while-existing must be a case of being-somewhere-else; otherwise it is \ninexplicable. But we cannot say that: A case of ‘having only red balls both in a random sample \nand in a particular population’ must be a case of ‘drawing the random sample from the particular \npopulation’, otherwise it is inexplicable. Suppose unknown to us, there are two urns each of \nwhich has a billion red balls, and we are aware of the existence of the first one only while the \nrandom sample is actually drawn from the second urn. This case does not involve inconsistency; \nhence the question of ‘inconsistency otherwise’ does not even arise here. The apprehension of \npervasion (vyāptigraha) happens through inductive reasoning while abductive inference is a full-\nfledged inference in the sense of anumāna. Pervasion is part of the body of an inference. \nInference understood in the specific sense of anumāna and arthāpatti (postulation) are \nepistemologically different since the former is preceded by observation and the latter takes place \nthrough the process of ‘inexplicability otherwise’ without depending on observation – a process \nthat is crucial to our argument about the phenomenological aspect of conceptualization.  \nThe sense of ‘inexplicability’ is an intuition. We intuitively know which propositions are \nconsistent and which ones are not. We cannot explain why we cannot accept the following \nproposition: Something is both red and green. We can just say that it is not explicable. The idea \nof explicability is so basic that other epistemic ideas are defined in terms of it.   First of all, \npostulation is not perception; for it does not involve any sensual representation of any object, i.e., \nnothing ‘appears’ in a postulation, whereas a pot appears in the perceptual cognition about that \npot. Postulation is not inference; for inference is an epistemic method that operates on the basis \nof the experience of the coexistence of two entities, and postulation is not based on any \nobservation of coexistence of any sort. On the basis of observation (if not directly our own, then \nthrough authoritative testimony – which is another instrument to secure valid cognition) we form \na hypothesis, ‘all cases of x are cases of y’, and come across a case of x. Then we may \ninferentially conclude that, ‘this is a case of y’. Prior to inferring fire from smoke we must \nobserve that any locus of smoke is a locus of fire. And this observation of the coexistence is \nalways partial. We cannot see all the instances of smoke; for if we see all of those to have fire, \nthen there would be no room for inference. Our cognition that any locus of smoke is a locus of \nfire would be perceptual in that case. This partial observation is always threatened by an \n‘inductive leap’. But postulation does not tolerate anything partial. Even an incorrect (but doubt-\nfree) postulation gives us a feeling that it is complete, i.e., nothing else is to be known about it, \nwhereas inference always leaves us with the feeling that some empirical data could invalidate it. \nWe call this completeness ‘procedural closure’, since, as an epistemic process, postulation is \ncomplete in itself and allows no further procedure once the conclusion has been reached.  \n14 \n \nA rationalist could argue that postulation is analytic; that going from Devadatta-is-not-\nhere to Devadatta-is-somewhere-else is like going from Fido-is-a-dog to Fido-is-an-animal. But \npostulation is non-analytic since the meaning of ‘Devadatta is somewhere else’ is not in any way \ncontained in the meaning of ‘Devadatta is not at home’. Instead, the concept of not-at-home is \n‘cognitively mapped’ onto the concept of being-somewhere-else. The cognitive mapping \nbetween concepts is constitutive of the epistemic life of a human being, and shared by all human \nepistemic systems. Postulation is the utilization of these mappings. The Advaitins actually draw \non an earlier version of the idea, from the Mīmā\u001fsā school: according to the Mīmāmsaka Śabara \n(Chinnaswami Shastri 1929), postulation happens when the perception of an entity is a particular \nsituation (call it loosely a ‘scenario’) is inexplicable otherwise than through a conclusion. In \norder to get rid of the feeling of inexplicability in explaining it in any other way, another scenario \nis invoked. This assumption is postulation. Let us return to the stock example: from seeing that \nDevadatta, who is alive, is not at home, one postulates that Devadatta is somewhere else. This \npattern is further elaborated as follows:  \nDevadatta is alive. Without being out, it is not possible for Devadatta to be absent from home. So \nthe text says: being-out is the only explanation for X’s absence at home when X is alive. The \nphrase ‘otherwise inexplicable’ means: if being-out is denied, X’s absence-at-home will be \ninexplicable. \nIn cognitive science terms, postulation is an automatic ‘projection’ of an explanatory \nhypothesis on to the explanandum which is driven by a tacit understanding of the nature of the \nworld we live in. A world where beings can vanish for a while and emerge back from the ether is \nnot a world where postulation of the form, ‘X that exists and is not here must be somewhere else’ \nwill work. The phenomenological structure of human epistemic systems would simply be \nconstituted differently.  In this sense, postulation is both grounded in the particular world we live \nin and the bodies we inhabit; and yet at the same time, the reasoning sequences that come about \nthrough postulation are non-defeasible on the basis of perceptual inputs.  \n \n5. A Cognitive View of Postulation. The Advaitic theory of postulation is best seen as a theory \nabout human competence (Chomsky 1965), i.e, a theory that lays bare the abstract structure of \nthe domain under investigation. Competence-based accounts have been important whenever we \nare faced with a licensing question, i.e., “what licenses the occurrence of phenomenon X?” Just \nas one can ask of the person studying concept learning in children “what licenses (in the child’s \nmind) the generalization of a concept from one instance to other instances?” we can also ask \n“what licenses a postulation from one cognitive state (Devadatta-is-not-at-home) to another \n(Devadatta-must-be-somewhere-else)?” as: \n \nA postulation is licensed whenever the explanandum is ‘otherwise inexplicable’ \n \n15 \n \nWhile our account of postulation is a competence account, we are neutral about the \nunderlying theory of concept possession; we are not committed to representational or any other \naccount of concepts. For example, we are agnostic as to whether: \n• The transformation of ‘Devadatta is not here’ into ‘Devadatta is somewhere else’ is a \ncomputational transformation of internal representations with the contents ‘Devadatta is \nnot here’ and ‘Devadatta is somewhere else’ respectively. \n• ‘Devadatta is not here’ and ‘Devadatta is somewhere else’ are metaphorical projections \nfrom our embodied experience of Devadatta.  \nOur minimal assumption – consistent with the general ‘valid cognition’ framework - is: \nConceptualizations such as ‘Devadatta is not here’ are systematically about the state of \nDevadatta not being there, i.e., that that the structure of the world has a conceptual correlate, and \nthe correlate changes when the world changes. For example, if it turns out that the person who \nwe thought was Devadatta was really Ramadatta, then the cognition ‘Devadatta is not here’ is \nreplaced by ‘Ramadatta is not here.’ The conceptualization has to be true; our assumption is \ncompatible with seeing a rope as a snake as long as the snake becomes a garland when the rope \nbecomes a lasso. \nNote how the ‘otherwise inexplicability’ scenario automatically leads to non-defeasibility within \nthe current conceptual repertoire of postulation; e.g., a child who believes in the tooth fairy is \nunlikely to use the presence (or absence) of teeth and presents to disbelieve in the existence of a \ntooth fairy. If perception could give rise to an explanation, then the phenomenon at hand would \nnot be otherwise inexplicable. Inexplicability, for us, is a phenomenological rather than \nepistemological criterion. A child who concludes that her tooth was taken by the tooth fairy (and \nis certain that the tooth fairy will gift her something in return) is postulating an (otherwise \ninexplicable) explanation for her missing tooth. Conceptual change does occur, there is a \nmoment of sad awakening when children realize that the tooth fairy was one of their parents, but \nconceptual change (Carey 2009) is not based on proximal evidence, it is change in the very \naxioms of the epistemic system. While Naiyayikas, agreeing with ‘theory-theorists’ (Gopnik and \nMeltzoff 1997) might argue that the shift in axioms (from the tooth fairy to doting mother as the \nunderlying explanation for the missing tooth) is an example of inductive inference, Advaitins \nwill disagree, saying that no amount of inference can justify the shift. Whether one agrees with \nthe Advaitin or the Naiyayika, cognitive scientists who work on conceptual change will benefit \nfrom understanding the debate between the two.  \nThese feelings of certainty and inexplicability are constitutive of our experience of the \nworld, or what is a better description, the world-in-cognition. As we conceive various aspects of \nthe world, our conceptualizations come with various experiences; one second, it feels like we are \ncertain about something, the next minute we are not so sure. These fleeting judgments are \nconstitutive of our experience, as much as perception or action.  To use a gestalt analogy, \nconceptual judgments are the ground of experience, the figure of which might be a particular \nconceptualization such as ‘Devadatta is somewhere else’. It is this cognitive certainty (rather \nthan veridicality) and inexplicability about the outcome of postulation that interests us, and we \nthink is the central cognitive science question as well. Here, we are in line with the majority of \n16 \n \ncognitive scientists, who think that experiential judgments are the core data for the field. For \nexample, while a prescriptive grammarian might wag her finger at various uses of language \n(judging “it is me” instead of “it is I” as wrong), generative linguists use grammaticality \njudgments by the man on the street as the data for their theories of grammar. Similarly, we think \nthat judgments of certainty and inexplicability should lie at the heart of a phenomenologically \nrich theory of conceptualization.  \nSince postulation simultaneously exhibits deductive and phenomenological features, the \nargument that there is something like what it is to have the conceptualization ‘Devadatta is not \nhere’ and ‘Devadatta is somewhere else’ makes postulation a striking and productive notion to \nexplore within the broad cognitive scientific idea of the phenomenology of conceptualization. \nPhenomenologically, postulation is the means through which our embeddedness in the world is \nexpressed in the experience of moving from one to another concept (from Devadatta-is-not-at-\nhome to Devadatta-is-somewhere-else). On the one hand, postulation is the means through which \nwe experience ourselves as reasonably capable beings-in-the-world. On the other hand, the \nstructure of postulation is encoded in the form of an automatic, mostly unconscious competence. \nClassical Indian approaches to cognition, and the Advaitic notion of postulation, render that \ndistinction moot. In turn, the Indian approaches to cognition suggest a more phenomenologically \ngrounded theory of conceptualization.  \n6. The Phenomenology of Conceptualization. Conceptualization is one of the most heavily \nresearched topics in the cognitive sciences. While there are many research programs that study \naspects of conceptualization, from the origins and development of concepts (Carey 2009) to the \nstructure of thinking and reasoning (Holyoak and Morrison 2005) there is almost no work in \ncognitive science on the phenomenology of conceptualization. There are many reasons for the \nabsence of phenomenological investigations of conceptualization. First, studies of thinking have \noften concentrated on evaluating human reasoning relative to norms of reason. For example, \nmuch research has investigated ‘common mistakes’ of reasoning, such as our ability to calculate \nprobabilities correctly (Johnson-Laird 2006). Similarly, influential studies (Kahneman, Slovic et \nal. 1982) have shown systemic biases in human reasoning away from a normative. Here, the \nimportant variable is the difference between actual behavior and the norm, not the felt quality of \nthe actual behavior. \nSecondly, conceptualization is seen as an unconscious process, developing automatically \nin children and deployed without any conscious control. Here, the main questions are “How do \nchildren generalize a concept from one instance to other, novel instances? How do they learn to \ndo so without any negative feedback?” The experiential quality of conceptualization is irrelevant \nwhen investigating these questions. Finally, scholars who might be inclined to look at the \nphenomenology of conceptualization – such as embodied cognitivists - have mostly concentrated \non perception and action and have not paid much attention to conceptualization (Varela, \nThompson et al. 1991; Noe 2004; Thompson 2007). Even cognitive linguists have not paid much \nattention to conceptual experience apart from the claim that conceptualization is somehow \ngrounded in bodily experience (Lakoff and Johnson 1999; Evans and Green 2006).  \nBut conceptualization is not just grounded in experience, it is a form of experience. \nDespite their aversion to incorporating experience in their theories of conceptualization, \n17 \n \ncognitive scientists are well aware of the centrality of conceptual experience. Generative \nlinguists base their theories of language on grammaticality judgments by native speakers. \nGrammaticality is an experiential judgment: part of what it is like to hear language (rather than \nnoise or music) is that the sound stream is experienced as grammatical. Similarly, the use of \nmetaphor has a different feel than the use of direct speech; suppose someone from a pre-modern \nculture asks: what is an airplane, we might answer “oh, it is a machine that flies like a bird.” The \nuse of analogy here is an experientially salient act of comparison. We are mostly forgetful of \nconceptual experience because it is the ground of experience. Only when it becomes ‘figural’ are \nwe reminded of its absence; just as three-year old infants stare longer at situations that violate \ncausality or conservation of mass, we go about our daily lives unmindful of conceptual \nexperience. Conceptualization, in the sense of evaluation of truth, value, acceptability etc is \ninvolved throughout our daily lives, when we are eating food, driving to work, saying your \nprayers, making phone calls, all of which are highly ritualized and strongly constrained, where \nmost of the time things work as we expect them to. The world is “deeply regular”.   \nIt is these deep regularities of the world-in-cognition that allow us to conclude Devadatta \nis somewhere else when we find out he is not at home. Certainty and otherwise-inexplicablity are \npart of our experience of postulation; we feel certain about our conclusion that Devadatta is \nsomewhere else and we are baffled if we do not find him in his usual hangouts, until we are told \nthat he was hiding away in his bedroom, writing. Bafflement, certainty, inexplicability, curiosity; \nthese are all part of what it feels like to think. These feelings lie at the intersection of the \nphenomenal and the cognitive. When we experience the world as ‘humming along’ we are \nunifying the functional and the phenomenal characteristics of postulation; it is this experience \nthat tells us that we are postulating explanations for structures that are otherwise inexplicable. \nOtherwise, we would be experiencing bafflement or frustration. The cognitive-functional \noperations of our minds are coupled to the world via the means of experience. These feelings \npartly constitute our experience of the world-in-cognition, i.e., a world in which we act, mostly \nsuccessfully, but sometimes erroneously. As adults, we tacitly assume that the world is \nmanageable, that ordinary cognitive challenges can be addressed fluently, without any explicit \neffort, i.e., through a mechanism that must be like postulation. Of course, we are not always \nsuccessful; a full inventory of the experience of conceptualization will surely reveal \nphenomenologically salient evaluations of the ways in which things fail. Nevertheless, arthāpatti \nencodes something central in our cognitive lives, the experience of fulfillment of our daily \ncognitive needs along with the functional apparatus that goes towards meeting those needs.  \nThere have been strands of thought in Western philosophy where it has been argued that \nphenomenality is not limited to sensations or emotions alone, but can also apply to more abstract \nentities like beliefs or thoughts in general. In the phenomenological tradition, Dan Zahavi has in \nrecent years made the case that there should not be a division between intentionality (as in \nthoughts) and phenomenality, arguing that this goes back to Husserl (Zahavi 2004). Zahavi also \nrightly points to the development of this argument independently in analytic philosophy, most \nnotably by Galen Strawson (1994), who has said that cognitive content has the qualitative \ncharacter of experience. While we do not expect our position to be consistent with or endorsed \nby such philosophers, we want to say that a roughly similar position is found across classical \nIndian thought, in the focus on cognition (jñāna) as the unit of analysis. Furthermore, we explore \nthe particular aspect of Indian thought wherein the deployment of concepts in cognition is both a \n18 \n \nphenomenal and epistemological (and therefore intentional) process. The broad similarity \nbetween the general Indian approach and contemporary acknowledgement of the phenomenality \nof thought shows that there is sufficient mutual translatablity for cross-cultural conceptual \nanalysis to be possible. At the same time, some of the methodological features of the Indian \ndebates show that contemporary research on the issue can benefit from what is specific to those \ndebates. The Indian theorists, by recognizing that conceptualization – as conceptual cognition \n(savikalpika pratyak\u001fa) – is something we undergo, have given us an opportunity to develop a \nqualitatively richer theory of mind and experience.  \n \n      \nReferences \nBarsalou, L. W. (2008). \"Grounded Cognition.\" Annual Review of Psychology 59: 617-645. \nBarsalou, L. W., W. Kyle Simmons, et al. (2003). \"Grounding conceptual knowledge in \nmodality-specific systems.\" Trends in cognitive sciences 7(2): 84-91. \nCarey, S. (2009). The Origin of Concepts. New York, Oxford University Press. \nChinnaswami Shastri, P. A., Ed. (1929). B\u001fhatī of Prabhakara Misra with the \u001fjuvimala of \nMahamahopadhyaya Salikanatha Misra. Banaras, Chowkhamba Sanskrit Series Office. \nChomsky, N. (1965). Aspects of the Theory of Syntax, MIT press. \nDravid, N. S. (1996). Nyāyakusumānjali of Udayanācārya. Delhi, Indian Council of \nPhilosophical Research. \nEvans, V. and M. C. Green (2006). Cognitive linguistics: An introduction, Edinburgh University \nPress. \nGopnik, A. and A. N. Meltzoff (1997). Words, Thoughts, and Theories, MIT Press, 55 Hayward \nStreet, Cambridge, MA 02142; phone: 617-253-5643 ($30, plus shipping). \nHolyoak, K. J. and R. G. Morrison (2005). The Cambridge handbook of thinking and reasoning, \nCambridge Univ Pr. \nJohnson-Laird, P. N. (2006). How we reason, Oxford University Press, USA. \nKahneman, D., P. Slovic, et al. (1982). Judgment under uncertainty: Heuristics and biases. \nCambridge, UK, Cambridge University Press. \nKusch, M. \"Psychologism.\" from http:\/\/plato.stanford.edu\/entries\/psychologism\/. \nLakoff, G. and M. Johnson (1999). Philosophy in the flesh : the embodied mind and its challenge \nto Western thought. New York, Basic Books. \nLipton, P. (2000). Inference to the Best Explanation. A Companion to the Philosophy of Science \n(WH Newton-Smith ed.), Oxford: Blackwell Publishers Ltd. \nMarr, D. (1982). Vision : a computational investigation into the human representation and \nprocessing of visual information. San Francisco, W.H. Freeman. \nMatilal, B. K. (1968). The Navya-nyāya doctrine of negation: the semantics and ontology of \nnegative statements in Navy-ayāya philosophy, Harvard University Press. \nMeiland, J. W. (1976). \"Psychologism in logic: Husserl's critique.\" Inquiry 19(1): 325–339-325–\n339. \nMervis, C. B. and E. Rosch (1981). \"Categorization of Natural Objects.\" Annual Review of \nPsychology 32(1): 89-115. \n19 \n \nNaess, A. (1954). \"Husserl on the apodictic evidence of ideal laws.\" Theoria 20(1-3): 53–63-53–\n63. \nNoe, A. (2004). Action in perception. Cambridge, Mass., M.I.T. Press. \nPeirce, C. S. (1931). 1966. The collected papers of Charles S. Peirce, 8 vols., C. Hartshorne, P. \nWeiss, and AW Burks, Cambridge: Harvard University Press.[Reference to Peirce’s \npapers will be designated CP followed by volume and paragraph number.]. \nRam-Prasad, C. (2007). Indian philosophy and the consequences of knowledge: themes in ethics, \nmetaphysics and soteriology, Ashgate Pub Co. \nStrawson, G. (1994). Mental reality, The MIT Press. \nTenenbaum, J. B., T. L. Griffiths, et al. (2006). \"Theory-based Bayesian models of inductive \nlearning and reasoning.\" Trends in cognitive sciences 10(7): 309-318. \nThompson, E. (2007). Mind in life. Cambridge MA, Harvard University Press. \nVarela, F. J., E. Thompson, et al. (1991). The embodied mind : cognitive science and human \nexperience. Cambridge, Mass., MIT Press. \nZahavi, D. (2004). \"Intentionality and phenomenality: A phenomenological take on the hard \nproblem.\" The Problem of Consciousness: New Essays in Phenomenological Philosophy \nof Mind. Canadian Journal of Philosophy, Supplementary Volume. \n \n \n"}