{"doi":"10.1179\/174367610X12804792635387","coreId":"140506","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5230","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5230","10.1179\/174367610X12804792635387"],"title":"Measuring the strength of brittle materials by depth-of-penetration testing","authors":["Hazell, P. J."],"enrichments":{"references":[{"id":37941721,"title":"A new definition of ballistic efficiency of brittle materials based on the use of thick backing plates’, in ‘Impact loading and dynamic behaviour of materials’,","authors":[],"date":null,"doi":null,"raw":"Z. Rosenberg, Y. Yeshurun, S. J. Bless and K. Okajima: ‘A new definition of ballistic efficiency of brittle materials based on the use of thick backing plates’, in ‘Impact loading and dynamic behaviour of materials’, (ed. C. Y. Chiem et al.), 491–498; 1988, Oberursel, DGM Informationsgesellschaft mbH.","cites":null},{"id":37941732,"title":"A note on the behind armour effects from perforated alumina\/aluminium targets.","authors":[],"date":"1998","doi":"10.1016\/s0734-743x(98)00014-1","raw":"P.J. Hazell, N.A. Fellows, J.G. Hetherington: A note on the behind armour effects from perforated alumina\/aluminium targets. Int J of Impact Engng 1998;21:589-95.","cites":null},{"id":37941742,"title":"A study of fragmentation in the ballistic impact of ceramics.","authors":[],"date":null,"doi":"10.1016\/0734-743x(94)90122-2","raw":"R. L. Woodward, W. A. Gooch Jr., R. G.  O'Donnell, W. J. Perciballi, B. J. Baxter, S. D. Pattie: A study of fragmentation in the ballistic impact of ceramics. Int. J. Impact Engng 1994;15 (5): 605-618.","cites":null},{"id":37941739,"title":"An overview of ballistic testing methods of ceramic materials.","authors":[],"date":"2002","doi":null,"raw":"M. J. Normandia, W. A. Gooch: An overview of ballistic testing methods of ceramic materials.  In: McCauley JW, Crowson A, Gooch Jr. WA, Rajendran AM, Bless SJ, Logan KV, Normandia M, Wax S, editors, Ceramic Armor Materials by Design, Ceramic Transactions, Vol.134, 2002 p.113-38.","cites":null},{"id":37941752,"title":"Bishnoi: A ceramic armor material database.","authors":[],"date":"1999","doi":null,"raw":"T. J. Holmquist, A. M. Rajendran,  D. W. Templeton, K. D.  Bishnoi: A ceramic armor material database. Report No. 13754, US TankAutomotive Research, Development and Engineering Center. 1999.","cites":null},{"id":37941726,"title":"BJ: Ballistic evaluation of ceramics: Influence of test conditions.","authors":[],"date":null,"doi":"10.1016\/s0734-743x(05)80024-7","raw":"R.L. Woodward, B.J. Baxter BJ: Ballistic evaluation of ceramics: Influence of test conditions. Int J of Impact Engng 1994;15(2):119-124.","cites":null},{"id":37941737,"title":"Comparative analysis of oblique impact on ceramic composite systems,","authors":[],"date":"2001","doi":"10.1016\/s0734-743x(01)00102-6","raw":"V. Hohler, K. Weber, R. Tham, B. James, A. Barker, I. Pickup: Comparative analysis of oblique impact on ceramic composite systems, Int J of Impact Engnng 2001; 26:333-344. Advances in Applied Ceramics 109 (8) pp. 504-510 (2010)","cites":null},{"id":37941738,"title":"Depth of penetration testing.","authors":[],"date":"2002","doi":"10.3403\/30164915","raw":"B. James: Depth of penetration testing. In: McCauley JW, Crowson A, Gooch Jr. WA, Rajendran AM, Bless SJ, Logan KV, Normandia M, Wax S, editors, Ceramic Armor Materials by Design, Ceramic Transactions, Vol.134, 2002, p. 165-72.","cites":null},{"id":37941733,"title":"Effect of room-temperature hardness and toughness on the ballistic performance of SiC-based ceramics. Ceram Sci Eng Proc","authors":[],"date":"2005","doi":"10.1002\/9780470291276.ch16","raw":"D. Ray, R. Flinders, A. Anderson, R. Cutler: Effect of room-temperature hardness and toughness on the ballistic performance of SiC-based ceramics. Ceram Sci Eng Proc 2005; 26 [7]:131-42.","cites":null},{"id":37941754,"title":"Failure phenomenology of confined ceramic targets and impacting rods.","authors":[],"date":null,"doi":"10.1016\/0734-743x(90)90002-d","raw":"D. A. Shockey, A.H. Marchand, S.R. Skaggs, G.E. Cort, M.W. Burkett, R. Parker: Failure phenomenology of confined ceramic targets and impacting rods. Int. J. Impact Engng. 1990; 9 (3): 263-275.","cites":null},{"id":37941750,"title":"Grady: Spall strength of condensed matter,","authors":[],"date":"1998","doi":"10.1016\/0022-5096(88)90015-4","raw":"D. E. Grady: Spall strength of condensed matter, J. Mech. Phys. Solids 1998; 36(3): 353-384.","cites":null},{"id":37941748,"title":"Hardness of Metals,","authors":[],"date":"1936","doi":null,"raw":"F. C. Lea: Hardness of Metals, (Charles Griffin and Company, Limited, 1936), p. 4.","cites":null},{"id":37941760,"title":"High-speed photography of the penetration of face-covered glass blocks”. Military Vehicle Technology MSc Course,","authors":[],"date":"1999","doi":null,"raw":"A. Prengal: “High-speed photography of the penetration of face-covered glass blocks”. Military Vehicle Technology MSc Course, Royal Military College of Science, Shrivenham, July 1999.  Advances in Applied Ceramics 109 (8) pp. 504-510 (2010)","cites":null},{"id":37941740,"title":"Historical review of high strain rate and shock properties of ceramics relevant to their application in armour.","authors":[],"date":null,"doi":"10.1179\/174367609x422180","raw":"S.M. Walley. Historical review of high strain rate and shock properties of ceramics relevant to their application in armour. Advances in Applied Ceramics DOI 10.1179\/174367609X422180.","cites":null},{"id":37941735,"title":"Jr.: The influence of experimental design on depth-of-penetration (DOP) test results and derived ballistic efficiencies,","authors":[],"date":"1997","doi":"10.1016\/s0734-743x(97)00010-9","raw":"R. R. Franzen, D. L. Orphal, C. E. Anderson Jr.: The influence of experimental design on depth-of-penetration (DOP) test results and derived ballistic efficiencies,  Int. J. Impact Engng 1997; 19 (8): 727-","cites":null},{"id":37941730,"title":"Krestan: Transparent armour materials.","authors":[],"date":"2008","doi":"10.1016\/j.jeurceramsoc.2007.09.036","raw":"R. Klement, S. Rolc, R. Mikulikova, J. Krestan: Transparent armour materials. Journal of the European Ceramic Society 2008; 28(5):1091-","cites":null},{"id":37941758,"title":"Modeling prestressed ceramic and its effect on ballistic performance,","authors":[],"date":null,"doi":"10.1016\/j.ijimpeng.2003.11.002","raw":"T. J. Holmquist, G. R. Johnson: Modeling prestressed ceramic and its effect on ballistic performance, International Journal of Impact Engineering, 2005; 31 (2): 113-127.","cites":null},{"id":37941731,"title":"Moutinho: The design of mosaic armour: the influence of tile-size on the ballistic performance.","authors":[],"date":"2008","doi":"10.1016\/j.matdes.2008.03.003","raw":"P.J. Hazell, C. Roberson, M. Moutinho: The design of mosaic armour: the influence of tile-size on the ballistic performance. Materials and Design, Vol. 29, (8), pp. 1497-1503 (2008)","cites":null},{"id":37941729,"title":"Resistance of silicon carbide to penetration by a tungsten carbide cored projectile, in Ceramic Armor and Armor Systems, Ceramic Transactions","authors":[],"date":"2003","doi":"10.1002\/9781118406793.ch14","raw":"C. Roberson, P.J. Hazell. Resistance of silicon carbide to penetration by a tungsten carbide cored projectile, in Ceramic Armor and Armor Systems, Ceramic Transactions 2003; 151: 165-174, E. Medvedovski (ed), The American Ceramic Society.","cites":null},{"id":37941744,"title":"Response of silicon carbide to high velocity impact.","authors":[],"date":"2002","doi":"10.1063\/1.1468903","raw":"T. J. Holmquist, G. R. Johnson: Response of silicon carbide to high velocity impact. Journal of Applied Physics 2002; 91 (9): 5858-5866.","cites":null},{"id":37941734,"title":"Royal-Timmons: Ballistic performance of confined 99.5%-Al203 ceramic tiles.","authors":[],"date":"1997","doi":"10.1016\/s0734-743x(97)00006-7","raw":"C.E. Anderson Jr, S.A. Royal-Timmons: Ballistic performance of confined 99.5%-Al203 ceramic tiles. Int J Impact Engng 1997; 19(8):703-713.","cites":null},{"id":37941765,"title":"Shattered ceramic and their effectiveness as armour”. No 1 Defence Technology (MSc) Course, Royal Military College of Science,","authors":[],"date":"1997","doi":null,"raw":"M. Hallas:  “Shattered ceramic and their effectiveness as armour”. No 1 Defence Technology (MSc) Course, Royal Military College of Science, Shrivenham, July 1997. Advances in Applied Ceramics 109 (8) pp. 504-510 (2010) TABLES","cites":null},{"id":37941762,"title":"Some observations on the strength of failed ceramic,","authors":[],"date":null,"doi":"10.1002\/9780470291276.ch1","raw":"G. R. Johnson, T. J. Holmquist: Some observations on the strength of failed ceramic, Ceramic Engineering and Science Proceedings 26 (7), pp. 3-10.","cites":null},{"id":37941746,"title":"The ballistic properties of tool steel as a potential improvised armour plate","authors":[],"date":null,"doi":"10.1016\/s0734-743x(97)83210-1","raw":"M. R. Edwards, A. Mathewson: The ballistic properties of tool steel as a potential improvised armour plate Int. J. Impact Engng 1997;19 (4):297-","cites":null},{"id":37941736,"title":"The influence of material properties of alumina on ballistic performance”.","authors":[],"date":"1995","doi":null,"raw":"B. James: “The influence of material properties of alumina on ballistic performance”. In the proceedings of the 15th International Symposium on Ballistics, 21-24 May 1995, Jerusalem, Israel, pp. 3-9; ISBN 0-961-8156-0-4.","cites":null},{"id":37941741,"title":"Tsaliah: “More on the thick-backing screening technique for ceramic tiles against AP projectiles”.","authors":[],"date":"1990","doi":null,"raw":"Z. Rosenberg, Y. Yesherun, J. Tsaliah:  “More on the thick-backing screening technique for ceramic tiles against AP projectiles”. Proc. 12th lnt. Symp. on Ballistics, ADPA, San Antonio, TX, U.S.A., pp. 197-201 (1990).","cites":null},{"id":37941756,"title":"Wilkins: The importance of material properties in ceramic armour,","authors":[],"date":"1969","doi":null,"raw":"C. F. Cline,  M. L. Wilkins: The importance of material properties in ceramic armour, Proceedings of the Ceramic Armour Technology Symposium, USA, pp. 13–18, January (1969).","cites":null},{"id":37941724,"title":"Yeshurun: The relationship between ballistic efficiency and compressive strength of ceramic tiles,","authors":[],"date":null,"doi":"10.1016\/0734-743x(88)90035-8","raw":"Z. Rosenberg, Y Yeshurun: The relationship between ballistic efficiency and compressive strength of ceramic tiles, Int. J. Impact Engng 1988;7 (3):357-62.","cites":null}],"documentType":{"type":0.6666666667}},"contributors":[],"datePublished":"2010-12-31T00:00:00Z","abstract":"Based on an energy conservation model, the strength offered by a number of\nbrittle materials has been calculated from depth-of-penetration (DOP) test\nresults. Each material was completely penetrated by a tungsten carbide cored\nprojectile of known kinetic energy and the residual penetration into a ductile\naluminium alloy backing material was measured. The energy transferred to the\ntile by the projectile has been calculated and has been shown to vary linearly\nwith the tile thickness. From the energy transferred to the armour tile, the\nmean resisting stress that was offered to the penetrator was calculated and for\nthe materials tested, scaled with the material hardness. This work shows that\nfor DOP testing, where the projectile remains intact, the measured DOP is merely\na facet of the ceramic’s hardness and not its true ballistic performance. The\npossibility of using this method to measure the strength of damaged ceramic is\nalso discuss","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140506.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1179\/174367610X12804792635387","pdfHashValue":"d8e387ccfd7b68721a540974d46e34ba3966d2ad","publisher":"Maney Publishing","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5230<\/identifier><datestamp>2011-09-20T11:13:02Z<\/datestamp><setSpec>hdl_1826_13<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Measuring the strength of brittle materials by depth-of-penetration testing<\/dc:title><dc:creator>Hazell, P. J.<\/dc:creator><dc:subject>depth-of-penetration testing<\/dc:subject><dc:subject>penetration mechanisms<\/dc:subject><dc:subject>ceramic armour<\/dc:subject><dc:subject>modelling<\/dc:subject><dc:subject>hardness<\/dc:subject><dc:subject>strength.<\/dc:subject><dc:description>Based on an energy conservation model, the strength offered by a number of\nbrittle materials has been calculated from depth-of-penetration (DOP) test\nresults. Each material was completely penetrated by a tungsten carbide cored\nprojectile of known kinetic energy and the residual penetration into a ductile\naluminium alloy backing material was measured. The energy transferred to the\ntile by the projectile has been calculated and has been shown to vary linearly\nwith the tile thickness. From the energy transferred to the armour tile, the\nmean resisting stress that was offered to the penetrator was calculated and for\nthe materials tested, scaled with the material hardness. This work shows that\nfor DOP testing, where the projectile remains intact, the measured DOP is merely\na facet of the ceramic’s hardness and not its true ballistic performance. The\npossibility of using this method to measure the strength of damaged ceramic is\nalso discusse<\/dc:description><dc:publisher>Maney Publishing<\/dc:publisher><dc:date>2011-09-08T10:19:54Z<\/dc:date><dc:date>2011-09-08T10:19:54Z<\/dc:date><dc:date>2010-12-31T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>1743-6753<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1179\/174367610X12804792635387<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5230<\/dc:identifier><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1743-6753","1743-6753"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["depth-of-penetration testing","penetration mechanisms","ceramic armour","modelling","hardness","strength."],"subject":["Article"],"fullText":"Advances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 1 \nMEASURING THE STRENGTH OF BRITTLE MATERIALS BY DEPTH-\nOF-PENETRATION TESTING \n \nPaul J Hazell* \n \nCranfield Defence and Security, Cranfield University, DA-CMT, Shrivenham, Swindon, \nWiltshire, SN6 8LA, UK. \n \n \nABSTRACT \n \nBased on an energy-conservation model, the strength offered by a number of brittle \nmaterials has been calculated from depth-of-penetration (DOP) test results. Each \nmaterial was completely penetrated by a tungsten carbide-cored projectile of known \nkinetic energy and the residual penetration into a ductile aluminium alloy backing \nmaterial was measured. The energy transferred to the tile by the projectile has been \ncalculated and has been shown to vary linearly with the tile thickness.  From the \nenergy transferred to the armour tile, the mean resisting stress that was offered to \nthe penetrator was calculated and for the materials tested, scaled with the material \nhardness. This work shows that for DOP testing, where the projectile remains intact, \nthe measured DOP is merely a facet of the ceramic’s hardness and not its true \nballistic performance. The possibility of using this method to measure the strength \nof damaged ceramic is also discussed. \n \nKeywords: Depth-of-penetration testing; Penetration mechanisms; Mean resisting \nstress; Ceramic armour; Modelling; Hardness; Strength; Comminuted ceramic. \n \n* Email: p.j.hazell@cranfield.ac.uk; Tel: +44 (0) 1793 785731\nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 2 \nINTRODUCTION \n \nDepth-of-penetration testing is achieved by attaching an armour tile to a \nductile backing material and firing at the target, recording the resulting depth-of-\npenetration (DOP) and comparing that value to a value of penetration depth \nachieved without the armour tile in place [1,2]. The depth-of-penetration technique \nwas originally developed by Rosenberg and his colleagues [1] as a method to \nsuppress the tensile stresses in the ceramic tile that would otherwise be present \nwhen a thin backing was used. Over the past 20 years there have been numerous \nstudies that have used this technique in the study of the response of the target \nmaterial that have been subjected to impact by small-arms bullets [3-8] and rods [9-\n12]. The advantage of this method is that it is relatively cheap to establish \nperformance criteria for the armour tile in question however its disadvantage is that \nthe semi-infinite backing is not representative of an armour system and therefore its \nvalue is in assessing comparative tile performance. These performance criteria are \nderived from the measured reduction in penetration and the mass of material \nrequired to reduce the penetration depth. Good reviews of the various approaches \nare provided by James [13], Normandia and Gooch [14] and Walley [15]. \nUsing this technique, Rosenberg and Yeshurun [1] observed a linear \ncorrelation between the ballistic efficiency of a ceramic and a normalised strength \nparameter. This strength parameter was defined as the average of the dynamic and \nstatic yield strengths of the ceramic divided by the density of the tile. In this work, \ntwo calibres of similar steel-cored projectiles were used and it was noted that the \nballistic efficiency was not sensitive to the projectile’s dimensions. Work by \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 3 \nWoodward and Baxter [3] included the study of the penetration of high quality \n99.5% alumina tiles backed with semi-infinite metal plates by both sharp and blunt \ntungsten alloy and hard steel projectiles. Using three different backing plate \nmaterials they showed that merit ratings which quantify the performance of the \nceramic against the impacting projectile, are a function of the projectile type and of \nthe backing material. They pointed out that this test method is a measure of two \nparameters: (1) the ability of the ceramic to destroy the projectile tip and; (2) the \nability to defeat the penetrator by velocity reduction and erosive mass loss. Their \nresults were also in keeping with the observations of Rosenberg et al. [16] who \nshowed that the measured ballistic efficiencies were affected by the test conditions. \nFurther work by Woodward et al. [17] showed that during depth-of-penetration \ntesting of a confined ceramic-faced target (AD 85), the calculated mean resisting \nstress could not be reconciled with the hardness of the material. In this case the \nmean resisting stress was calculated from a consideration of the conservation of \nenergy during penetration. Nevertheless, they also found that for a confined glass \ntarget, their value of mean resisting stress was similar to the hardness of the \nmaterial. However, both of these targets were tested with the impact side confined \nby a 6.35 mm 2024 T351 aluminium-alloy plate bolted to a steel surround and it is \nwell known that confinement can significantly enhance the performance of a \nceramic armour due to a ceramic’s propensity to pressure harden [e.g.,18]. \nA quantifiable measure of the mean resistance during penetration of a target \ntile is important as it provides a measure of the ballistic performance of the \nmaterial. In particular for a ceramic material, this value will include a contribution \nof the strength offered by the comminuted \/ damage materials as well as the strength \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 4 \nof the intact material offered to the projectile during penetration. This value is \nimportant for the validation of analytical models where the measurement of the \nstrength of the damaged material is still not possible.  \nIn this work, a model has been developed based on [17] to calculate the \nmean resisting stress offered by a brittle tile to a penetrating projectile. Further, the \nperformance of several unconfined materials subjected to complete penetration by a \nhard tungsten carbide-cored projectile has been evaluated in an attempt to quantify \nthe resistance offered by each material.  \n \nEXPERIMENTAL SET-UP \n \nMaterials used \nFor the backing material used in these DOP experiments, a common \nengineering aluminium alloy Al 6082 T651 was chosen (YS = 240 MPa). The test \nbacking-plates were 100 × 100 mm pieces cut from a single 25 mm thick plate. For \neach tile of specific thickness (ts), a single bullet was fired at the target and the \nresidual penetration (pr) into the aluminium alloy was measured (see Fig. 1); at least \nthree experiments were done for each material. \n \nFig 1: DOP technique for assessing each sample’s ballistic performance; (a) without target \nsample in place and, (b) with target sample in place. \n \nEight brittle materials were tested in this study: Sintox FA (a sintered  \nalumina – 95% content) manufactured by Morgan Matroc Ltd; ALOTEC - 96SB (a \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 5 \nsintered alumina – 96% content) manufactured by CeramTec-ETEC GmbH; AD995 \n(a sintered alumina -- 99.5% content) manufactured by CoorsTek; a sintered silicon \ncarbide manufactured by Morgan AM&T (PS5000); a common-off-the-shelf \nFloatglass; Borofloat™ manufactured by SCHOTT Technical Glass Solutions \nGmbH and finally; two glass ceramics (LZ1 and MAS-6). All tiles were 100 mm × \n100 mm in areal size except for the thinnest Sintox FA, 96SB and PS5000 targets. \nThese were 50 × 50 mm in size but were confined by like-material tiles at each edge \nto provide an effective 100 mm × 100 mm geometry. \nThe elastic properties of the materials were established ultrasonically using \nPanametrics’ 5MHz longitudinal and shear-wave probes with the pulse-echo \nmethod. The hardness values (HV0.5 \/ HV2.0) were calculated from a series of \nmicro-hardness tests using an Indentec HWDM7.  The properties of the materials \nused in this experimental programme are presented in Table 1. All of the ceramic \nmaterials were tested according to HV2.0; the two glasses were tested to HV0.5 due \nto the difficulty in establishing an impression at higher loads. \nEach tile was glued to the aluminium alloy-backing block using Araldite \n2015. This was applied to the mating surfaces and then the ceramic and aluminium \nblock were pushed together and twisted \/ oscillated until an even thin adhesive line \nhad been achieved with no gaps or obvious air inclusions. This was done to achieve \na consistent contact between the ceramic and the aluminium for all samples tested. \nTable 1: Properties of the materials tested (in order of hardness). \n \n \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 6 \nImpact testing \nThe range set up was one of a fixed test barrel mounted ten metres from the \ntarget. Bullet velocity was measured using the normal light-screen arrangement. \nThe test ammunition was 7.62 mm × 51 mm NATO FFV ammunition that \ngenerated a mean bullet velocity of 935 m\/s. This bullet consists of a tungsten \ncarbide core (composition by percentage weight C 5.2, W 82.6, Co 10.5, Fe 0.41) \n[20] of hardness 1550 [HV0.3], mounted in a low carbon steel jacket with gilding \nmetal, on an aluminium cup. The measured hardness values of the steel jacket were \n184 [HV0.3] at the base and 220 [HV0.3] at the tip. The measurement of the masses \nof the core and the bullet were 5.90 g and 8.23 g respectively. Key dimensions of \nthe core are shown below in Fig. 2. \n \nFig. 2: Key dimensions of the WC-Co FFV core; all dimensions are in mm. \n \nAfter testing the aluminium alloy blocks were either sectioned or X-rayed to \nestablish the residual penetration.  \n \nRESULTS AND DISCUSSION \n \nThe ballistic model \nThe kinetic energy of the projectile can be broken down as follows: \n \ncupjcp EEEKE ++=         (1) \n \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 7 \nwhere Ec, Ej, Ecup represent the kinetic energy of the three constituent parts of the \nprojectile – namely: the core, jacket and aluminium cup respectively. The kinetic \nenergy of the cup (mass = 0.3 g) is a tiny proportion of the total kinetic energy and \ntherefore is subsequently ignored. \nFig. 3 shows a typical post-mortem X-ray of the cavity formed during \npenetration of the aluminium alloy by the bullet. Here the velocity of impact was \n1088 m\/s. There are a few things to point out here. Firstly, during penetration of the \nfirst 25 mm of aluminium alloy, the jacket is stripped away enabling the core to \npenetrate into the aluminium alloy; the penetration channel that is formed is \napproximately the same diameter as the core (5.59 mm). Secondly, radial expansion \nin the aluminium alloy occurs – probably during the jacket-stripping process. \nThirdly and finally, the core of the projectile is seen to remain intact. \n \nFig. 3: Penetration of the FFV core into the aluminium alloy plates. \n \nIt is assumed that all the kinetic energy of the projectile (KEp) is given up in \npenetrating aluminium alloy plate. Consequently, the significant energy \ncontributions required to penetrate the aluminium alloy is made up of several major \nparts as given by the following energy balance consisting of three variables that \ndepend on the amount of kinetic energy in the projectile, KEp. \n \nal\np\nal\nr\njacket\nsp EEEKE ++=       (2) \n \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 8 \nwhere jacketsE  and \nal\nrE  are the energy required to separate the jacket from the core \nand the energy required to cause radial expansion of the aluminium alloy during the \njacket-stripping process respectively. alpE  is the energy required by the remaining \ncore to penetrate a distance pr into the plate. It is assumed that alrE  represent small \ncontributions of the total kinetic energy of the bullet due to the small volume of \ncavity expansion that follows in the aluminium. The energy required to strip the \njacket is also deemed to be small quantity (see later). \nWhen a target sample is adhered to the face of the aluminium (see Fig. 1b), \nthe kinetic energy of the projectile is given up in penetrating both the target sample \nand the aluminium alloy according to the following equation: \n \nal\np\nal\nr\njacket\ns\nsample\npp EEEEKE +++=      (3) \n \nwhere samplepE  represents the energy dissipated by the sample. Again, \njacket\nsE  and \nal\nrE  represent small contributions of the total kinetic energy of the bullet and are \nconsequently ignored. Therefore, the energy dissipated by the sample, samplepE , can \nbe calculated from \nal\npp\nsample\np EKEE −=        (4). \n \nFor a sample of thickness tc, the mean resisting force, Fr , can be calculated \nby \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 9 \n⎥⎥⎦\n⎤\n⎢⎢⎣\n⎡=\nc\nsample\np\nr t\nE\nF         (5) \n \nTherefore, ignoring frictional effects applied to the periphery of the \nprojectile core and assuming a constant areal contact, the mean resisting stress can \nbe calculated by dividing the mean resisting force by the projected area offered by \nthe core: \n2\n4\nd\nFr\nr πσ =         (6) \n \nThis is analogous to the measurement of hardness using a conical indentor \n[21] and is assumed to represent the average value of strength for the tile during \npenetration. \n \nStripping the jacket \nIn order to get an estimate of the amount of energy required to strip the \njacket from the cores during penetration ( )jacketsE , the jacket was stripped by \npressing a bullet into a conically-shaped die using an Instron 4206 universal testing \nmachine. The die possessed an angle of 45º from the vertical axis and was made \nfrom high strength steel (EN 24). The tip (c.a. 5 mm) of the bullet jacket was \nremoved prior to the pressing trial to aid in the stripping process.  Fig. 4 shows the \n7.62 mm bullet uses in these experimental trials showing the jacket before and after \nthe stripping process (prior to tip removal); the core and the aluminium cup are also \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 10 \nshown. The jacket stripped in an almost symmetrical fashion with the formation of \n5 petals. \nFig 4: 7.62 mm bullet, core, stripped jacket and cup. \n \nFig 5: Compression of the bullet into a conically-shaped die: Load-displacement and \ncumulative energy-displacement. \n \nFig. 5 shows a typical force-displacement curve; also shown is a calculation \nof the cumulative energy expended during the compression process calculated by \nintegrating the area under the force-displacement curve. There are three points to \nnote. Firstly, at A, there is a rapid rise in the measured load. It is believed that \nresistance is offered by the radially expanding neck of the jacket as it pressed into \nthe die until at B, fracture occurs and the jacket is torn in 5 separate locations. This \nprocess occurs for c.a. 6-7 mm; the load measured at the platens reduces as the tears \nin the thin steel jacket allow for the bullet to continue onward. Eventually at C, the \ncurled-up tears are themselves compressed by the platens denoted by an increase in \nmeasured force. This ordinarily would not occur when a bullet penetrates a ceramic-\nfaced target and therefore from this point forward, the data was ignored. From our \ntests we would estimate that the energy required to strip a jacket from the bullet is \nof the order of 50 J – 100 J. This represents 1%-2% of the bullet’s initial kinetic \nenergy and therefore is deemed to be negligible. Nevertheless, it should be noted \nthat this approach can only give a rough estimate of the energy stripped from the \njacket during penetration as it fails to take into account strain-rate and inertial \neffects. \n \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 11 \nTherefore Equation (3) can be rewritten as \n \n  alpp EKE =        (7) \n \nPenetration into the aluminium alloy \nA series of firings were conducted into the aluminium alloy used in this \nexperimental programme. No ceramic \/ glass targets were adhered to the aluminium \nin this case. The purpose of this was to establish a calibration line from which the \nenergy expended in penetrating a depth pal could be derived. As can be seen from \nFig. 6, the depth varies linearly with the kinetic energy of the bullet over the \nkinetic-energy range of interest according to: \nBKEAp pal +⋅=       (8) \nwhere the measured constants A and B were 0.0147 and 5.0469 respectively. \n \nFig 6: Depth-of-penetration into the aluminium alloy (6082-T651) plate with varying bullet \nkinetic energy. \n \nPenetration of the glass and ceramic-faced aluminium targets \nFig. 7 shows the calculated transfer of energy from the projectile to two of \nthe sample materials where the tile thickness was varied (Sintox FA and \nBorofloat™). For each sample, a linear increase in energy absorbed is seen. Here, \nthe gradient of the line approximates the average resisting force applied by the \nceramic \/ glass and is constant for the increasing thickness. \n \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 12 \nFig 7: Energy dissipated by the tiles with increasing thickness. \n \nIt was noted in certain instances that, despite the core appearing to be intact, \npost-mortem analysis revealed that it was fractured. Nevertheless, where fracturing \nof the core or tip occurred, the energy consumed by the generation of fracture \nsurfaces was assumed to be minimal and consideration of this energy required can \nbe pursued by using the work of Grady [22]. In this work, fracture surface energy \nper unit volume, Γ, required to create fragments of size s in a brittle material can be \napproximated by \n \nsc\nKc\n2\n0\n23\nρ=Γ        (9) \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 13 \nwhere Kc is the fracture toughness, ρ is the density and s is the fragment size. If the \nbody is broken into fragments of size s, a fracture surface area per unit volume \nequal to 6 \/ s is created. co is the bulk wave speed calculated from \n \nρ\nKc =0        (10) \n \nwhere K is the bulk modulus of the material and for a similar material has been \nmeasured to be 364 GPa [23]. Even with conservative estimates of the fracture \ntoughness for the WC-Co core being 10 MPa√m, and breaking down the core into \nfragments of 1 mm, the fracture surface energy dissipated in this process is very \nsmall (< 1 J).  \n Fig. 8 shows the average resisting stress for each of the samples tested as a \nfunction of the thickness of the tile. There are variations in the PS 5000 and AD995 \nresults which may be down to defects within the ceramics. On the most part, the \nmean resisting stress was constant regardless of the thickness of the tile. This result \nis somewhat surprising as stress-wave effects would ordinarily be expected to \ndamage the material ahead of the penetrator thereby reducing the average strength \nas the thickness is increased. Consequently the near-constant value of mean \nresisting stress (or strength) seen here suggest that damage to the material during \npenetration is either relatively small ahead of the penetrator or the inertial \nconfinement offered by the surrounding tile material restricts fractured material \ndilation. This is in keeping with the observations of Shockey et al. [24] who \nobserved that the strength of compacted comminuted ceramic recovered from a \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 14 \npenetration cavity after high-velocity rod penetration was comparable to that of un-\nimpacted material. \nThe higher-resisting-stress materials (PS5000, AD995 and 96SB) fractured \nthe core tip at relatively low thicknesses and consequently a trend was not \nestablished for these materials. Nevertheless, the resisting stress that is offered by \nthese ceramics was still quantifiable for the given thickness.  \n \nFig 8:  Average resisting stress offered by the ceramic materials. \n \nBelow in Fig. 9, we have plotted the average resisting stress as a function of \nthe  hardness of the ceramic. The central 1:1 dashed line indicates the case where \nthe average resisting stress is equal to the measured hardness values of the \nmaterials. It can be seen that the calculated strength results lie very close to this 1:1 \nline. This suggests that in the DOP configuration, and where the core remains fully \nintact, the test will not measure the true ballistic properties of the target material in \nquestion. For a ceramic, this is all the more crucial as the true ballistic properties of \nthe material are not defined by one single parameter such as hardness [11,25]. \n However, Woodward et al [17] noticed that for a confined AD 85 sample the \nmean resisting stress offered by the AD 85 sample was far higher than hardness \nvalue measured for this sample (8.8 GPa).  Their targets were tested using a \nconfined set-up with a 6.35-mm 2024 T351 aluminium alloy cover plate bolted to a \nsteel surround and consequently the experimental set-up is somewhat different to \nthis work. This excessively high value of resisting stress appears to contradict the \nresults presented here. The reason for this is not clear but it may be due to the fact \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 15 \nthat Woodward et al. relied on a single data point for the aluminium calibration and \ndid not take into account the energy absorbed by the front cover plate. More likely \nis that these results may point to the possibility that the presence of Woodward’s \ncover-plate significantly increased the penetration-resistance of the AD 85. It is \nknown that adding confinement to ceramics increases its ballistic performance as \ndoes pre-stress and this is largely due to the pressure dependency of ceramic \n[24,26]. On the other hand for a similarly confined glass target, Woodward et al. \nshowed that the mean resisting stress was approximately the same as the measured \nhardness value for they glass. They noted that it was surprising that the resisting \nstress offered to the projectile was similar to its hardness as fracture would have \nreduced its strength. Consequently, it would have fallen below the 1:1 trend line if \nthe glass was not confined. This work indicates that this is the case for unconfined \ntargets. Indeed, analysis of Prengal’s results [27], who used the same ammunition as \nthis work,  showed that the introduction of 2-mm thick aluminium cover plate to a \nsoda-lime glass target led to a 20% reduction in depth-of-penetration of a mild steel \nwitness plate. This would have resulted in a higher mean resisting stress. \n However, it should also be noted that most of the data presented below in \nFigure 9 sits very close to the 1:1 line. The penetrator will be penetrating through \nfractured material whereas a hardness test will predominately inelastically deform \nthe sample. Therefore, it appears that the effect of a reduction in material strength \ndue to fracturing ahead of the penetrator is relatively small in this experimental set-\nup. This is most likely due to inertial confinement offered by the (still) intact \nsurrounding material combined with possible pressure-related strengthening effects \nof the fractured \/ comminuted material (e.g., see [28]). \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 16 \n  \nFig 9: Calculated resisting stress as plotted against the measured hardness values. \n \n \nComparison with data for shattered ceramic \n \nHallas [29] has conducted depth-of-penetration studies using a ceramic-\nfaced aluminium alloy. The ceramic used was Sintox FA; 7018 aluminium alloy \nwas used as the backing plate. Uniquely Hallas tested shattered and powdered \nceramic in attempt to elucidate the effect of a damage state on penetration. An intact \nceramic was also tested.  \nA calibration curve for a similar aluminium alloy was established in an \nattempt to evaluate whether Hallas’ data could be used to establish the strength of \ncomminuted material. Consequently firings into a 1318B alloy (very similar to \n7018) were carried out resulting in a linear calibration according to Equation 9 \nwhere the measured constants A and B were 0.0112 and 2.4478 respectively. \nUnfortunately, individual velocities for each experiment were not recorded \nby Hallas nevertheless, based on the average bullet velocity from this experimental \nprogramme (935 m\/s) it was possible to calculate the mean resisting stress for each \nof Hallas’s samples. These were (a) a 6 mm intact Sintox FA tile; (b) 6 mm tiles \nshattered by a 5 g of PE4 explosive; (c) 9 mm of compressed 80 μm alumina \npowder (compressed under a pressure of 40 MPa using an iso-static press) and; (d) \n37.5 mm of compressed 80 μm alumina powder. The powder used was mostly \nspherical in shape. The reported results and calculated mean resisting stress based \non the method presented above are presented in Table 2. \n \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 17 \nTable 2: Hallas’ DOP results showing the calculated resisting stress using the technique \npresented above. \n \nHallas noticed that the shattered tiles had been broken into particle sizes of between \n10-20 microns whilst maintaining inter-granular coupling. Consequently, these \nresult do point to the fact that when the ceramic is shattered or even powdered (i.e., \nheavily comminuted), it retains significant strength during penetration \n(approximately 10%). Given that these experiments were carried out without a \ncover-plate in place, the bulk of the shattered\/ powdered material would have most \nlikely moved \/ flowed during penetration and therefore the strength values listed \nabove represent a lower bound to the actual strength of the broken material in a \nceramic penetration experiment. Consequently, this adds weight to the evidence that \nrelatively little strength reduction occurs purely due to crack propagation when the \ndamaged material is inertially confined. \n \nCONCLUSIONS \n \nIn this paper it has been shown that it is possible to estimate a value of the \nmean resisting stress offered to a projectile that is penetrating the target in a rigid \nfashion. It was notable that different ceramics offered different resisting stress and \nalthough this is somewhat intuitive, we have been able to quantify the value for a \nseries of materials for the first time. Notably, it was shown that in the depth-of-\npenetration experimental configuration, the values of the mean resisting stresses \nappeared to correlate with the hardness of the materials.  This perhaps is intuitive as \nin this experimental configuration we are essentially replicating a loading condition \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 18 \nthat is similar in to a dynamic hardness experiment. Therefore, under such \nconditions, where the core is not destroyed, the intrinsic ballistic properties of the \ntile will not be measured. Such ballistic properties should only be interpreted where \nthe core of the bullet has been fractured and fragmented. \nThe calculated mean resisting stresses also appeared to remain constant over \nincreasing thickness of tile. Consequently, these results indicate that where the core \nremains intact, the effect of a reduction in material strength due to fracturing ahead \nof the penetrator is relatively small. This is most likely due to inertial confinement \noffered by the (still) intact surrounding material combined with possible pressure-\nrelated strengthening effects of the fractured \/ comminuted material. Finally, it has \nbeen shown that the strength of unconfined broken \/ comminuted ceramic is \nsignificant during penetration and, for the first time under these loading conditions, \nhas been quantified. \n  \nACKNOWLEDGEMENT \n \nThe author particularly wish to thank Morgan AM & T and ETEC for providing \nfree samples for this study. In particular I would like to thank Mr Colin Roberson \n(Advance Defence Materials Ltd), Mr Andrew Duncan (CeramTec), Dr Chris \nSpacie (Morgan AM&T) and Prof Ian Horsfall (Cranfield) who were instrumental \nin supplying the samples for this research. I would also like to acknowledge Mr \nDave Miller and Mr Andrew Roberts for their technical support as well as Dr \nGareth Appleby-Thomas for his help. Finally, I acknowledge two students who \nhave worked on similar projects: A K Choudary and S Sapre and whose results \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 19 \nwere instructional for the way forward. Both contributed their work during the \nproject phase of an Explosive Ordnance Engineering MSc course at Cranfield \nUniversity. \n \nREFERENCES \n \n1. Z. Rosenberg, Y. Yeshurun, S. J. Bless and K. Okajima: ‘A new \ndefinition of ballistic efficiency of brittle materials based on the use of \nthick backing plates’, in ‘Impact loading and dynamic behaviour of \nmaterials’, (ed. C. Y. Chiem et al.), 491–498; 1988, Oberursel, DGM \nInformationsgesellschaft mbH. \n2. Z. Rosenberg, Y Yeshurun: The relationship between ballistic efficiency \nand compressive strength of ceramic tiles, Int. J. Impact Engng 1988;7 \n(3):357-62. \n3. R.L. Woodward, B.J. Baxter BJ: Ballistic evaluation of ceramics: \nInfluence of test conditions. Int J of Impact Engng 1994;15(2):119-124. \n4. C. Roberson, P.J. Hazell. Resistance of silicon carbide to penetration by \na tungsten carbide cored projectile, in Ceramic Armor and Armor \nSystems, Ceramic Transactions 2003; 151: 165-174, E. Medvedovski \n(ed), The American Ceramic Society. \n5. R. Klement, S. Rolc, R. Mikulikova, J. Krestan: Transparent armour \nmaterials. Journal of the European Ceramic Society 2008; 28(5):1091-\n1095. \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 20 \n6. P.J. Hazell, C. Roberson, M. Moutinho: The design of mosaic armour: \nthe influence of tile-size on the ballistic performance. Materials and \nDesign, Vol. 29, (8), pp. 1497-1503 (2008) \n7. P.J. Hazell, N.A. Fellows, J.G. Hetherington: A note on the behind \narmour effects from perforated alumina\/aluminium targets. Int J of \nImpact Engng 1998;21:589-95. \n8. D. Ray, R. Flinders, A. Anderson, R. Cutler: Effect of room-temperature \nhardness and toughness on the ballistic performance of SiC-based \nceramics. Ceram Sci Eng Proc 2005; 26 [7]:131-42. \n9. C.E. Anderson Jr, S.A. Royal-Timmons: Ballistic performance of \nconfined 99.5%-Al203 ceramic tiles. Int J Impact Engng 1997; \n19(8):703-713. \n10. R. R. Franzen, D. L. Orphal, C. E. Anderson Jr.: The influence of \nexperimental design on depth-of-penetration (DOP) test results and \nderived ballistic efficiencies,  Int. J. Impact Engng 1997; 19 (8): 727-\n737. \n11. B. James: “The influence of material properties of alumina on ballistic \nperformance”. In the proceedings of the 15th International Symposium \non Ballistics, 21-24 May 1995, Jerusalem, Israel, pp. 3-9; ISBN 0-961-\n8156-0-4. \n12. V. Hohler, K. Weber, R. Tham, B. James, A. Barker, I. Pickup: \nComparative analysis of oblique impact on ceramic composite systems, \nInt J of Impact Engnng 2001; 26:333-344. \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 21 \n13. B. James: Depth of penetration testing. In: McCauley JW, Crowson A, \nGooch Jr. WA, Rajendran AM, Bless SJ, Logan KV, Normandia M, \nWax S, editors, Ceramic Armor Materials by Design, Ceramic \nTransactions, Vol.134, 2002, p. 165-72. \n14. M. J. Normandia, W. A. Gooch: An overview of ballistic testing \nmethods of ceramic materials.  In: McCauley JW, Crowson A, Gooch Jr. \nWA, Rajendran AM, Bless SJ, Logan KV, Normandia M, Wax S, \neditors, Ceramic Armor Materials by Design, Ceramic Transactions, \nVol.134, 2002 p.113-38. \n15. S.M. Walley. Historical review of high strain rate and shock properties \nof ceramics relevant to their application in armour. Advances in Applied \nCeramics DOI 10.1179\/174367609X422180. \n16. Z. Rosenberg, Y. Yesherun, J. Tsaliah:  “More on the thick-backing \nscreening technique for ceramic tiles against AP projectiles”. Proc. 12th \nlnt. Symp. on Ballistics, ADPA, San Antonio, TX, U.S.A., pp. 197-201 \n(1990). \n17. R. L. Woodward, W. A. Gooch Jr., R. G.  O'Donnell, W. J. Perciballi, B. \nJ. Baxter, S. D. Pattie: A study of fragmentation in the ballistic impact of \nceramics. Int. J. Impact Engng 1994;15 (5): 605-618. \n18. T. J. Holmquist, G. R. Johnson: Response of silicon carbide to high \nvelocity impact. Journal of Applied Physics 2002; 91 (9): 5858-5866. \n19. www.matweb.com \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 22 \n20. M. R. Edwards, A. Mathewson: The ballistic properties of tool steel as a \npotential improvised armour plate Int. J. Impact Engng 1997;19 (4):297-\n309. \n21. F. C. Lea: Hardness of Metals, (Charles Griffin and Company, Limited, \n1936), p. 4. \n22. D. E. Grady: Spall strength of condensed matter, J. Mech. Phys. Solids \n1998; 36(3): 353-384. \n23. T. J. Holmquist, A. M. Rajendran,  D. W. Templeton, K. D.  Bishnoi: A \nceramic armor material database. Report No. 13754, US Tank-\nAutomotive Research, Development and Engineering Center. 1999. \n24. D. A. Shockey, A.H. Marchand, S.R. Skaggs, G.E. Cort, M.W. Burkett, \nR. Parker: Failure phenomenology of confined ceramic targets and \nimpacting rods. Int. J. Impact Engng. 1990; 9 (3): 263-275. \n25. C. F. Cline,  M. L. Wilkins: The importance of material properties in \nceramic armour, Proceedings of the Ceramic Armour Technology \nSymposium, USA, pp. 13–18, January (1969). \n26. T. J. Holmquist, G. R. Johnson: Modeling prestressed ceramic and its \neffect on ballistic performance, International Journal of Impact \nEngineering, 2005; 31 (2): 113-127. \n27. A. Prengal: “High-speed photography of the penetration of face-covered \nglass blocks”. Military Vehicle Technology MSc Course, Royal Military \nCollege of Science, Shrivenham, July 1999.  \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 23 \n28. G. R. Johnson, T. J. Holmquist: Some observations on the strength of \nfailed ceramic, Ceramic Engineering and Science Proceedings 26 (7), \npp. 3-10. \n29. M. Hallas:  “Shattered ceramic and their effectiveness as armour”. No 1 \nDefence Technology (MSc) Course, Royal Military College of Science, \nShrivenham, July 1997. \n \n \n \n \n \n \n \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 24 \nTABLES \n \nTable 1: Properties of the materials tested (in order of hardness). \nMaterial ρ0 (g\/cc) \nCl \n(mm\/μs)\nCs \n(mm\/μs)\nE \n(GPa) ν \nYield \nStrength \n(MPa) \nHardness \n(GPa) \nAl 6082-T651 2.70 6.41 3.19 73 0.34 240 [19] 1.1 \nAl 1318B (7017) 2.78 6.27 3.11 72 0.34 460 [12] 1.5 \nFloatglass 2.44 5.80 3.46 72 0.22 - 5.0 \nBorofloat™ 2.20 5.58 3.41 62 0.20 - 5.1 \nGlass ceramic 1 \n(LZ1) 2.33 6.58 4.08 92 0.19 - 6.4 \nGlass ceramic 2 \n(MAS-6) 2.68 6.95 3.96 106 0.26 - 6.6 \nSintox FA 3.73 10.09 5.93 321 0.24 - 11.0 \nALOTEC 96SB 3.75 10.15 6.02 334 0.23 - 13.3 \nAD995 3.90 10.65 6.26 378 0.24 - 14.9 \nPS 5000 3.15 12.07 7.63 427 0.16 - 24.3 \n \n \nTable 2: Hallas’ DOP results showing the calculated resisting stress using the technique \npresented above. \nType DOP into 7018 alloy (mm) \nCalculated resisting stress \n(GPa) \n6-mm Sintox FA tile \n(intact) 21 13.1 \n6-mm Sintox FA tile \n(shattered) 34 5.2 \n9-mm compressed \npowder 40 1.1 \n37.5-mm compressed \npowder 25 1.7 \n \n \n \n \nAdvances in Applied Ceramics 109 (8) pp. 504-510 (2010) \n 25 \nLIST OF FIGURE CAPTIONS \n \n \nFig 1: DOP technique for assessing each sample’s ballistic performance; (a) without \ntarget sample in place and, (b) with target sample in place. \nFig. 2: Key dimensions of the WC-Co FFV core; all dimensions are in mm. \nFig. 3: Penetration of the FFV core into the aluminium alloy plates. \nFig 4: 7.62-mm bullet, core, stripped jacket and cup. \nFig 5: Compression of the bullet into a conically-shaped die: Load-displacement \nand cumulative energy-displacement. \nFig 6: Depth-of-penetration into the aluminium alloy (6082-T651) plate with \nvarying bullet kinetic energy. \nFig 7: Energy dissipated by the tiles with increasing thickness. \nFig 8:  Average resisting stress offered by the ceramic materials. \nFig 9: Calculated resisting stress as plotted against the measured hardness values. \n \n\n\n\n\n\n\n\n\n\n"}