{"doi":"10.1080\/0968776980060103","coreId":"14307","oai":"oai:generic.eprints.org:255\/core5","identifiers":["oai:generic.eprints.org:255\/core5","10.1080\/0968776980060103"],"title":"Structuring institutions to exploit learning technologies: A cybernetic model","authors":["Liber, Oleg"],"enrichments":{"references":[{"id":200196,"title":"Design for a Brain,","authors":[],"date":"1960","doi":"10.5962\/bhl.title.6969","raw":"Ashby, W.R. (1960), Design for a Brain, London: Chapman & Hall. Beer, S. (1981), Brain of the Firm, Chichester: John Wiley.","cites":null},{"id":200200,"title":"Images of Organization,","authors":[],"date":"1986","doi":"10.1177\/017084068800900113","raw":"Morgan, G. (1986), Images of Organization, Beverley Hills, CA: Sage.","cites":null},{"id":200199,"title":"Letter to The Times Higher,","authors":[],"date":"1997","doi":null,"raw":"Liber, O. (1997), Letter to The Times Higher, 1 August, 13.","cites":null},{"id":200198,"title":"Managing resource-based learning'","authors":[],"date":"1994","doi":null,"raw":"Liber, O. (1994), 'Managing resource-based learning' in Foot, H. C. et al (eds), Group and Interactive Learning, Southampton: Computational Mechanics, 183-8.","cites":null},{"id":200197,"title":"The Viable System Model,","authors":[],"date":"1989","doi":"10.1016\/0377-2217(90)90368-l","raw":"Espejo, R. and Harnden, R. (eds) (1989), The Viable System Model, Chichester: John Wiley.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1998","abstract":"The adoption of learning technologies has not fulfilled expectation in any sector of education. Arguably, it is the structure of educational institutions which is the main obstacle. Schools, colleges and universities were designed to allow the delivery of education by the few to the many at a time when the key technology was the printed page, and many of the organizational instruments that facilitated this are still with us today: timetables, classrooms, syllabuses and so on. These permit a particular style of education to take place, but result in a system where the complexity of learning needs is ignored New technologies can provide new organizational devices that recognize this complexity. These require careful design and imply a significant restructuring of institutional organization. This paper addresses how the tools provided by management cybernetics, in particular Stafford Beer's Viable System Model, allow the analysis of structural mechanisms and how they impact on organizational complexity. It describes how these tools can be used to redesign educational organizations, including identifying key points where technologies can be used to create structures that permit a more flexible exploitation of the opportunities offered by learning technologies. The current JTAP project Toolkit for the Management of Learning is offered as an example of a set of software tools that emerge from such a cybernetic analysis","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14307.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/255\/1\/ALT_J_Vol6_No1_1998_Structuring%20institutions%20to%20ex.pdf","pdfHashValue":"84bc9363b87574ace6e11d5c04e3224da1dfd934","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:255<\/identifier><datestamp>\n      2011-04-04T09:20:42Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/255\/<\/dc:relation><dc:title>\n        Structuring institutions to exploit learning technologies: A cybernetic model<\/dc:title><dc:creator>\n        Liber, Oleg<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        The adoption of learning technologies has not fulfilled expectation in any sector of education. Arguably, it is the structure of educational institutions which is the main obstacle. Schools, colleges and universities were designed to allow the delivery of education by the few to the many at a time when the key technology was the printed page, and many of the organizational instruments that facilitated this are still with us today: timetables, classrooms, syllabuses and so on. These permit a particular style of education to take place, but result in a system where the complexity of learning needs is ignored New technologies can provide new organizational devices that recognize this complexity. These require careful design and imply a significant restructuring of institutional organization. This paper addresses how the tools provided by management cybernetics, in particular Stafford Beer's Viable System Model, allow the analysis of structural mechanisms and how they impact on organizational complexity. It describes how these tools can be used to redesign educational organizations, including identifying key points where technologies can be used to create structures that permit a more flexible exploitation of the opportunities offered by learning technologies. The current JTAP project Toolkit for the Management of Learning is offered as an example of a set of software tools that emerge from such a cybernetic analysis.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        1998<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/255\/1\/ALT_J_Vol6_No1_1998_Structuring%20institutions%20to%20ex.pdf<\/dc:identifier><dc:identifier>\n          Liber, Oleg  (1998) Structuring institutions to exploit learning technologies: A cybernetic model.  Association for Learning Technology Journal, 6 (1).  pp. 13-18.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776980060103<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/255\/","10.1080\/0968776980060103"],"year":1998,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Structuring institutions to exploit learning\ntechnologies: a cybernetic model\nOleg Liber\nInformation Services, University of Wales, Bangor\nThe adoption of learning technologies has not fulfilled expectation in any sector of education. Arguably,\nit is the structure of educational institutions which is the main obstacle. Schools, colleges and universities\nwere designed to allow the delivery of education by the few to the many at a time when the key\ntechnology was the printed page, and many of the organizational instruments that facilitated this are still\nwith us today: timetables, classrooms, syllabuses and so on. These permit a particular style of education\nto take place, but result in a system where the complexity of learning needs is ignored New technologies\ncan provide new organizational devices that recognize this complexity. These require careful design and\nimply a significant restructuring of institutional organization. This paper addresses how the tools\nprovided by management cybernetics, in particular Stafford Beer's Viable System Model, allow the\nanalysis of structural mechanisms and how they impact on organizational complexity. It describes how\nthese tools can be used to redesign educational organizations, including identifying key points where\ntechnologies can be used to create structures that permit a more flexible exploitation of the\nopportunities offered by learning technologies. The current JTAP project Toolkit for the Management of\nLearning is offered as an example of a set of software tools that emerge from such a cybernetic analysis.\nIntroduction\nEducational management is looking to Communication and Information Technologies\n(C&IT) to make education cheaper and maybe even more effective (e.g. Dealing, 1997).\nBut despite over two decades of computer-based learning, and despite the still considerable\nfaith in the future possibilities of C&IT, so far there is no evidence that this promise is\nanywhere near being realized. The reasons for this may be insufficient machines of\nadequate capability, a lack of training, inadequate networking and poor software.\nHowever, I believe that there is a more fundamental reason for its failure to make a\nsignificant impact: that the way education and its institutions are structured actively gets in\nthe way of learning technology becoming effective. I suggest that the role of educational\ninstitutions is to connect learners with teachers, and that the teacher's purpose is to\ntransform the world-views of the students. Rather than transmitters of knowledge, they are\nsystems for managing learning conversations. Current forms of organization manage\nlearning conversations in a particular way, which is inimical to the best use of learning\ntechnologies. C&IT offers an alternative way of managing learning, but which cannot be\nlayered on top of existing organizational structures.\n13\nO\/eg Liber Structuring institutions to exploit learning technologies a cybernetic model\nOrganizations as interlocking communication loops\nThere are many ways of describing organizations (see Morgan, 1986). Beer's Viable System\nModel (VSM) describes them as being like a nervous system (Beer, 1981), and has\nelaborated a sophisticated cybernetic model. There is not the space to describe it fully here,\nbut the key concept in this description is that the role of management is to manage\ncomplexity, following Ashby's Law of Requisite Variety (Ashby, 1956).\nFigure I:The simple\nViable System Model\nManagement\nVariety (E) »Variety(O) » Variety(M)\nFigure 1 is a simple version of the VSM, showing how the key problem for management is\nthe management of variety (the measure of complexity used in cybernetics). Because the\norganization's environment is far more complex than its operations, which in turn are far\nmore complex than its management, these complexities need to managed. They either need\nto be attenuated, or the low variety side needs to be amplified by creating more options.\nHow variety management is done determines the nature and range of its outputs. The full\nmodel provides a way of modelling organizations that identifies particular communication\nloops, and helps with diagnosis of problems and design of new structures. The VSM has\nbeen used widely in business and other organizations(see Espejo and Harnden, 1989);\napplying it to the organization of education provides valuable insights.\nEducational organizations\nFor the purpose of this paper, I make a number of presuppositions which need to be made\nexplicit. They are made from a constructivist viewpoint, embodying a particular view of\nlearning.\nFirst, it is necessary to establish what an educational institution is: what it does, and who\nthe actors and other stakeholders are. This has been widely discussed elsewhere;\nnevertheless, here are my presuppositions:\n(1) Educational institutions exist to enable specific transformations in students' world-\nviews, which we call learning.\n(2) The people who effect this transformation are the students themselves.\n14\nALT-J Volume 6 Number I\n(3) Teachers create the context and conditions that permit them to do (2).\n(4) Managers create the context and conditions that permit teachers to do (3).\nThis is a three-level model with students as the 'workers' and teachers as their 'managers',\nand then a further level of management. Another layer might be the sector management\n(e.g. HE funding councils). I do not agree with currently fashionable view of the student as\ncustomer (see Liber, 1997).\nBecause the world of knowledge is so complex, almost all institutions have to reduce its\ncomplexity to make it manageable. This is done by reducing knowledge to a number of\ncategories or subjects (mathematics, psychology, history, etc.) which are embodied in\nschools or departments.\nThe second source of complexity is that of prospective students, which is also reduced\nthrough categorizing students into available subjects, with entry requirements geared to\nmanage this low-complexity model. In schools, students' complexity is also reduced by\nstreaming. For example, a thousand students in a school are typically reduced by age-\ngrouping to five age archetypes, and by 'ability' grouping into six or seven ability\narchetypes. One thousand students are reduced to thirty or so archetypes.\nSubject departments then take their subject with all its complexity, and reduce it to a set of\ncourses, each with a curriculum, a lecture programme, reading lists and so on, with\nperformance measured by assignments and examinations. Students are restricted as to\nwhich courses can be done in which order, and timetables enable the whole to take place.\nFigure 2 shows how this is represented using the VSM.\nKnowledge\npotential\ntudents\nTimetable\nCurricula\nManagement\nfigure 2: Institutional\nmanagement of\ncomplexity\nI am not criticizing establishments for doing this; rather, I wish simply to state that this is\nall to do with necessary management of complexity and not with learning per se. However,\nthere is a price to be paid. Knowledge is broken up into a certain number of one hour (or\nso) chunks, whether or not this suits the subject matter. Students, no matter their unique\nskills, knowledge, aptitudes and interests, follow an identical curricular diet. Trans-\ndisciplinary work is difficult to sustain; despite the good intentions of modular systems,\ntimetabling and other structures make it practically impossible.\nThe person who has to deal with the lost complexity is the teacher, who within the\nconstraints described has to manage the complexity of the students in their charge. Within\n15\nO\/eg Liber Structuring institutions to exploit learning technologies: a cybernetic model\ntheir classroom organization, the approach they use determines how complexity is\nmanaged. Once again, they have to manage the complexity of the knowledge domain for\ntheir course, and the complexity of the students in their charge. If they teach formally, then\nthey reduce the complexity of the knowledge domain to their utterances, perhaps amplified\nby reading lists, and by limited discussion. Formal teaching also ignores the students'\ncomplexity, treating them all as if they were identical. Tutorials ameliorate this, but there is\nlittle (ever less) time for it. Figure 3 shows a simple model of the formal classroom.\nFigure 3:The formal\nteaching approach\nr\n\\ knowledge\n\\ \/\nLi\/\nLecture \\\ncontent N\nReading Lists\nclass\n\/ Tutorial\nteacher\nGroups\nTools for managing complexity\nBecause this has been the way of managing education for a long time, it has become\naccepted as the 'normal' organizational form. Subject distinctions have been around a long\ntime, and seem to be the natural way of organizing knowledge; and to learn them we need\nsyllabuses, do we not? And we could not let anyone study any part of any subject, at any\ntime, at any level, to any depth, could we?\nThings can be different. The Oxford tutorial model, for example, recognizes individuality;\nresearch degrees can permit trans-disciplinary work; but these approaches are expensive.\nResource-based learning can also address individuality, but puts severe demands on\nteachers to collect, organize and manage learning resources. It also requires thafteachers\nget to know their students rather well, and find out their needs, interests, aptitudes and\nlearning styles. Resource-based learning schemes have been used in schools for many years\n(see, for example, Liber, 1994), and have permitted classrooms to be de-streamed. In recent\nyears, resource-based learning has gained its followers in higher education; in this case this\nis mainly due to the promise of Computer-Assisted Learning (CAL).\nThe problem, then, of the resource-based approach is the requirement for the teacher to\nmanage two sources of complexity: the resource base and the student group. The Toolkit\nfor the Management of Learning (TOOMOL) is a project funded by the Joint Information\nSystems Council Technology Application Programme (JTAP), and is developing tools that\nhelp with these problems. It provides a computer-based tool that allows teachers easily to\nbuild a database of resources, which they can structure according to the courses they teach.\nIn a similar way, it allows them to build student profiles containing information about their\nbackgrounds and previous learning. These then allow the teacher to establish the kinds of\n16\nALT-J Volume 6 Number I\nresources that may meet individual students' needs, and to deliver them directly to the\nstudents or over the Internet. Students also have a similar tool, which contains their\ndeveloping profiles for each module or course, along with the resources that have been\nsuggested to them by their teachers.\nThe resources may be texts in books in libraries, pages on the World Wide Web, CAL\npackages, lecture programmes, electronic discussion groups, or other students involved in\nsimilar work. The tool will launch appropriate software for any of these: connect to the\nLibrary, or launch a Web browser, a CAL package, or an email or conferencing client.\nAlthough TOOMOL encourages teachers to adopt a resource-based approach by making\nits management much easier, the constraints of institutional organization remain.\nHowever, once a resource-based approach becomes dominant, constraints can begin to be\nlifted. When lectures become unusual and special events, instead of the main form of\neducational contact, timetabling becomes a less central problem. As students begin to\ndevelop learning profiles which can be made accessible to the teaching staff, guidance\nbecomes tractable, and allows individual, trans-disciplinary courses to be designed, and\ncan make the lifelong learning experience coherent. The need for strict subject-based\norganization is reduced, and allows teachers to operate in a more independent way, making\nalliances with others across the institution. Of course, mechanisms to ensure quality need\nto be put in place, but these do not have to be so departmentally based.\nAt the next level, if a resource-based approach is adopted more widely, there is no reason\nwhy students should not study at several universities, not only taking different modules at\ndifferent places, but having tutors from different universities for a single course.\nAll of this can be made possible by using technology for what it is good at: helping to manage\ncomplexity. To achieve this level of inter-working using existing management approaches and\nmechanisms is impossible, and as long as these predominate, the true potential of\ntechnologies for learning will not be released. But if technology is used to substitute these\nmanagement mechanisms, then the individuality of learners can be respected, and then-\ncreativity unleashed. The challenge for education is to make the transformation.\nUnfortunately the signs are not good. At the next level of educational organization, national\ngovernment, mechanisms seem to be being put in place that make this impossible. In schools,\nthe National Curriculum defines what is 'proper' learning in each subject at every age, enshrin-\ning the destruction of complexity in law. Similar moves are being discussed for higher\neducation. The Teaching Quality Assessment process (TQA) encourages convergence between\ndepartments in different universities, reducing diversity. The Research Assessment Exercise\nencourages 'safe' research at the centre of the subject domain, whereas the real challenge for\nresearch is at the edges of a discipline, where it rubs up against another. Central educational\nmanagement needs to recognize that it must devise tools that ensure quality while promoting\ndiversity, creativity, and risk-taking, and recognizing that sometimes this may go wrong.\nConclusion\nI have used principles from Beer's VSM to argue that the way education has traditionally\nbeen (and is still) organized is concerned with the reduction of the complexity of\nknowledge and the learner group to make the problem of education tractable. New\n17\nOleg Liber Structuring institutions to exploit learning technologies a cybernetic model\ncommunication and information technologies provide new tools for organizing education\nthat can permit much more flexibility both in individual learning and in the structure of\npermissible courses. Further, they can allow much greater co-operation between\neducational institutions, and facilitate the much vaunted learning society and lifelong\nlearning. Unfortunately, existing modes of organization, in the classroom, in the\ninstitution and in the education system as a whole, are actively preventing these\npossibilities from taking place. Redesign of these structures is needed if the promise of new\nlearning technologies is to be realized, along with the development of new technological\ntools for the management of learning.\nReferences\nAshby, W.R. (1960), Design for a Brain, London: Chapman & Hall.\nBeer, S. (1981), Brain of the Firm, Chichester: John Wiley.\nDearing, R. et al (1997), Higher Education in the Learning Society, Report of the National\nCommittee of Inquiry into Higher Education. London: NCIHE Publications (HMSO),\nJuly.\nEspejo, R. and Harnden, R. (eds) (1989), The Viable System Model, Chichester: John\nWiley.\nLiber, O. (1994), 'Managing resource-based learning' in Foot, H. C. et al (eds), Group and\nInteractive Learning, Southampton: Computational Mechanics, 183-8.\nLiber, O. (1997), Letter to The Times Higher, 1 August, 13.\nMorgan, G. (1986), Images of Organization, Beverley Hills, CA: Sage.\n18\n"}