{"doi":"10.1101\/gr.801103","coreId":"193576","oai":"oai:lra.le.ac.uk:2381\/2025","identifiers":["oai:lra.le.ac.uk:2381\/2025","10.1101\/gr.801103"],"title":"DASH-2: flexible, low-cost, and high-throughput SNP genotyping by dynamic allele-specific hybridization on membrane arrays","authors":["Jobs, M.","Howell, W. M.","Strömqvist, L.","Mayr, T.","Brookes, Anthony J."],"enrichments":{"references":[{"id":44674199,"title":"29, 2003; accepted in revised form","authors":[],"date":null,"doi":"10.3390\/resources3010215","raw":"Received January 29, 2003; accepted in revised form February 26, 2003. Jobs et al.","cites":null},{"id":44674192,"title":"Creating arrays by centrifugation.","authors":[],"date":"2002","doi":null,"raw":"Jobs, M., Howell, W.M., and Brookes, A.J. 2002. Creating arrays by centrifugation. Biotechniques 32: 1322–1324, 1326, 1329.","cites":null},{"id":44674190,"title":"DNA sequence variants in the G -, A -, - and -globin genes of man.","authors":[],"date":"1979","doi":"10.1016\/0092-8674(79)90348-9","raw":"Jeffreys, A.J. 1979. DNA sequence variants in the G -, A -, - and -globin genes of man. Cell 18: 1–10.","cites":null},{"id":44674189,"title":"Dynamic allele-specific hybridization. A new method for scoring single nucleotide polymorphisms.","authors":[],"date":"1999","doi":null,"raw":"Howell, W.M., Jobs, M., Gyllensten, U., and Brookes, A.J. 1999. Dynamic allele-specific hybridization. A new method for scoring single nucleotide polymorphisms. Nat. Biotechnol. 17: 87–88.","cites":null},{"id":44674186,"title":"HGVbase: A human sequence variation database emphasizing data quality and a broad spectrum of data sources.","authors":[],"date":"2002","doi":"10.1093\/nar\/30.1.387","raw":"Fredman, D., Siegfried, M., Yuan, Y.P., Bork, P., Lehvaslaiho, H., and Brookes, A.J. 2002. HGVbase: A human sequence variation database emphasizing data quality and a broad spectrum of data sources. Nucleic Acids Res. 30: 387–391.","cites":null},{"id":44674196,"title":"High-throughput parallel analysis of hundreds of patient samples for more than 100 mutations in multiple disease genes.","authors":[],"date":"1997","doi":"10.1093\/hmg\/6.3.337","raw":"Shuber, A.P., Michalowsky, L.A., Nass, G.S., Skoletsky, J., Hire, L.M., Kotsopoulos, S.K., Phipps, M.F., Barberio, D.M., and Klinger, K.W. 1997. High-throughput parallel analysis of hundreds of patient samples for more than 100 mutations in multiple disease genes. Hum. Mol. Genet. 6: 337–347.","cites":null},{"id":44674187,"title":"iFRET: An improved fluorescence system for DNA-melting analysis.","authors":[],"date":"2002","doi":"10.1101\/gr.297202","raw":"Howell, W.M., Jobs, M., and Brookes, A.J. 2002. iFRET: An improved fluorescence system for DNA-melting analysis. Genome Res. 12: 1401–1407.","cites":null},{"id":44674198,"title":"Large-scale identification, mapping, and genotyping of single-nucleotide polymorphisms in the human genome.","authors":[],"date":"1998","doi":null,"raw":"Wang, D.G., Fan, J.B., Siao, C.J., Berno, A., Young, P., Sapolsky, R., Ghandour, G., Perkins, N., Winchester, E., Spencer, J., et al. 1998. Large-scale identification, mapping, and genotyping of single-nucleotide polymorphisms in the human genome. Science 280: 1077–1082. WEB SITE REFERENCES www.biorobotic.com; suppliers of lab-robotic equipment. www.genetix.com; suppliers of lab-robotic equipment. www.dynametrix-ltd.com; supplies and supports SNP genotyping by Dynamic Allele-Specific Hybridization—DASH.","cites":null},{"id":44674197,"title":"Progress in high-throughput SNP genotyping methods.","authors":[],"date":"2002","doi":"10.1038\/sj.tpj.6500094","raw":"Tsuchihashi, Z. and Dracopoli, N.C. 2002. Progress in high-throughput SNP genotyping methods. Pharmacogenomics J. 2: 103–110.","cites":null},{"id":44674200,"title":"Published by genome.cshlp.orgDownloaded from 10.1101\/gr.801103Access the most recent version at doi:","authors":[],"date":"2015","doi":null,"raw":"924 Genome Research www.genome.org Cold Spring Harbor Laboratory Press on November 27, 2015 - Published by genome.cshlp.orgDownloaded from 10.1101\/gr.801103Access the most recent version at doi: 2003 13: 916-924 Genome Res.","cites":null},{"id":44674193,"title":"Real-time fluorescence genotyping of factor V Leiden during rapid-cycle PCR.","authors":[],"date":"1997","doi":null,"raw":"Lay, M.J. and Wittwer, C.T. 1997. Real-time fluorescence genotyping of factor V Leiden during rapid-cycle PCR. Clin. Chem. 43: 2262–2267.","cites":null},{"id":44674195,"title":"Robust and accurate single nucleotide polymorphism genotyping by dynamic allele-specific hybridization (DASH): Design criteria and assay validation.","authors":[],"date":"2001","doi":"10.1101\/gr.150201","raw":"Prince, J.A., Feuk, L., Howell, W.M., Jobs, M., Emahazion, T., Blennow, K., and Brookes, A.J. 2001. Robust and accurate single nucleotide polymorphism genotyping by dynamic allele-specific hybridization (DASH): Design criteria and assay validation. Genome Res. 11: 152–162.","cites":null},{"id":44674194,"title":"Solid phase DNA minisequencing by an enzymatic luminometric inorganic pyrophosphate detection assay.","authors":[],"date":"1993","doi":"10.1006\/abio.1993.1024","raw":"Nyren, P., Pettersson, B., and Uhlen, M. 1993. Solid phase DNA minisequencing by an enzymatic luminometric inorganic pyrophosphate detection assay. Anal. Biochem. 208: 171–175.","cites":null},{"id":44674185,"title":"The essence of SNPs.","authors":[],"date":"1999","doi":"10.1016\/s0378-1119(99)00219-x","raw":"Brookes, A.J. 1999. The essence of SNPs. Gene 234: 177–186.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003","abstract":"Genotyping technologies need to be continually improved in terms of their flexibility, cost-efficiency, and throughput, to push forward genome variation analysis. To this end, we have leveraged the inherent simplicity of dynamic allele-specific hybridization (DASH) and coupled it to recent innovations of centrifugal arrays and iFRET. We have thereby created a new genotyping platform we term DASH-2, which we demonstrate and evaluate in this report. The system is highly flexible in many ways (any plate format, PCR multiplexing, serial and parallel array processing, spectral-multiplexing of hybridization probes), thus supporting a wide range of application scales and objectives. Precision is demonstrated to be in the range 99.8–100%, and assay costs are 0.05 USD or less per genotype assignment. DASH-2 thus provides a powerful new alternative for genotyping practice, which can be used without the need for expensive robotics support","downloadUrl":"http:\/\/creativecommons.org\/licenses\/by-nc\/4.0\/).","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/2025\/1\/Genome%20Res.-2003-Jobs-916-24.pdf","pdfHashValue":"728fe07768dc77ffc4244522f0534fe7ccb9ad4c","publisher":"Cold Spring Harbor Laboratory Press","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/2025<\/identifier><datestamp>\n                2015-11-28T03:21:05Z<\/datestamp><setSpec>\n                com_2381_93<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_95<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nDASH-2: flexible, low-cost, and high-throughput SNP genotyping by dynamic allele-specific hybridization on membrane arrays<\/dc:title><dc:creator>\nJobs, M.<\/dc:creator><dc:creator>\nHowell, W. M.<\/dc:creator><dc:creator>\nStrömqvist, L.<\/dc:creator><dc:creator>\nMayr, T.<\/dc:creator><dc:creator>\nBrookes, Anthony J.<\/dc:creator><dc:description>\nGenotyping technologies need to be continually improved in terms of their flexibility, cost-efficiency, and throughput, to push forward genome variation analysis. To this end, we have leveraged the inherent simplicity of dynamic allele-specific hybridization (DASH) and coupled it to recent innovations of centrifugal arrays and iFRET. We have thereby created a new genotyping platform we term DASH-2, which we demonstrate and evaluate in this report. The system is highly flexible in many ways (any plate format, PCR multiplexing, serial and parallel array processing, spectral-multiplexing of hybridization probes), thus supporting a wide range of application scales and objectives. Precision is demonstrated to be in the range 99.8–100%, and assay costs are 0.05 USD or less per genotype assignment. DASH-2 thus provides a powerful new alternative for genotyping practice, which can be used without the need for expensive robotics support.<\/dc:description><dc:date>\n2009-12-08T16:12:36Z<\/dc:date><dc:date>\n2009-12-08T16:12:36Z<\/dc:date><dc:date>\n2003<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nGenome Research, 2003, 13 (5), pp.916-924<\/dc:identifier><dc:identifier>\n1088-9051<\/dc:identifier><dc:identifier>\nhttp:\/\/genome.cshlp.org\/content\/13\/5\/916<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/2025<\/dc:identifier><dc:identifier>\n10.1101\/gr.801103<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:rights>\nCopyright © 2003 by Cold Spring Harbor Laboratory Press  Creative Commons CC-BY-NC License (Attribution-NonCommercial 4.0 International License,\\ud\n http:\/\/creativecommons.org\/licenses\/by-nc\/4.0\/).<\/dc:rights><dc:publisher>\nCold Spring Harbor Laboratory Press<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1088-9051","1088-9051"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007"],"year":2003,"topics":[],"subject":["Article"],"fullText":"DASH-2: Flexible, Low-Cost, and High-Throughput\nSNP Genotyping by Dynamic Allele-Specific\nHybridization on Membrane Arrays\nMagnus Jobs,1 W. Mathias Howell,1 Linda Strömqvist, Torsten Mayr, and\nAnthony J. Brookes2\nCenter for Genomics and Bioinformatics, Karolinska Institute, Berzelius va¨g 35, S-171 77 Stockholm, Sweden\nGenotyping technologies need to be continually improved in terms of their flexibility, cost-efficiency, and\nthroughput, to push forward genome variation analysis. To this end, we have leveraged the inherent simplicity\nof dynamic allele-specific hybridization (DASH) and coupled it to recent innovations of centrifugal arrays and\niFRET. We have thereby created a new genotyping platform we term DASH-2, which we demonstrate and\nevaluate in this report. The system is highly flexible in many ways (any plate format, PCR multiplexing, serial\nand parallel array processing, spectral-multiplexing of hybridization probes), thus supporting a wide range of\napplication scales and objectives. Precision is demonstrated to be in the range 99.8–100%, and assay costs are\n0.05 USD or less per genotype assignment. DASH-2 thus provides a powerful new alternative for genotyping\npractice, which can be used without the need for expensive robotics support.\nAs the Human Genome Project moves forward, of major im-\nportance will be analysis of single nucleotide polymorphism\n(SNP) (Brookes 1999), the most abundant and simple form of\nDNA variation. Meaningful exploration of SNPs in most set-\ntings demands large-scale experimentation, and many groups\nare working towards adequately powered genotyping tech-\nnologies to make this possible. Innovative designs involving\nenzymes for allele-specific cleavage, ligation, or polymeriza-\ntion, in conjunction with advanced implementations, have\nbeen brought forward in often fairly successful attempts to\naccurately score genotypes (Tsuchihashi and Dracopoli 2002).\nHighly effective systems have also been fashioned around the\nstraightforward principle of DNA hybridization (Lay and\nWittwer 1997;Wang et al. 1998; Howell et al. 1999). However,\nassay costs still remain high (typically at least tens of cents per\nassigned genotype), and throughputs limited (creating mil-\nlions of genotypes remains daunting for most systems). Argu-\nably, the highly sophisticated and\/or multistep reaction\nchemistries of many of these procedures may be imposing\nfundamental limitations on how cheap, flexible, or prolific\nthey can be made to be. Because of this, we chose to explore\na genotyping strategy that emphasizes simplicity, namely Dy-\nnamic Allele-Specific Hybridization (DASH).\nThe core reaction principal of DASH is real-time (dy-\nnamic) tracking of allele-specific differences in the process of\nDNA denaturation. To achieve this, an oligonucleotide probe\nis first hybridized to the target DNA—a necessary component\nof essentially all genotyping methods. The target DNA com-\nprises one strand of a PCR product immobilized onto a solid\nsurface, and a single probe is used that is complementary to\none of the target alleles. Probe hybridization is performed at\nlow temperature so that it goes to completion regardless of\nwhich target allele(s) are present. After probe annealing, there\nfollows a standard heating step wherein probe-target denatur-\nation is followed dynamically. This reveals the precise melting\ntemperature (Tm) at which the probe most rapidly falls off of\nthe target. The observed Tms are reproducible, and they dis-\ncriminate between probe-matched and probe-mismatched\ntargets by as much as 4–15°C across all SNPs yet tested. Ho-\nmozygous samples give single Tm outputs, while heterozy-\ngotes show two zones of rapid melting. Thus, from this simple\nreaction process, one can unambiguously score known alleles\npresent in the assayed target DNAs. Previously, this assay con-\ncept was shown to be very precise (>99.9% accurate), and\nimproved design principals were recently reported that over-\ncome problematic secondary structures that may exist in\nsome target molecules (Prince et al. 2001). Our experience\nshows that by instigating a basic pipeline around the pub-\nlished “first-generation DASH” procedure (Howell et al. 1999)\n(96-well single-plex sample processing, manual pipetting, in-\ntercalating dye fluorescence signals) it is trivial, with just a few\nstaff to create several hundred thousand genotypes per year,\nacross many hundred different SNPs, at a reagent cost of ∼50\ncents per assigned genotype.\nLooking to the future of genome variation analysis, there\nremains an unmet need for highly flexible single-user tech-\nnologies that can produce millions of genotypes per year at a\nper assignment cost of a few cents or less. With this goal in\nmind, we have combined several recent technology innova-\ntions with the basic DASH concept, to create a new genotyp-\ning platform we refer to as “second generation DASH”, or\nDASH-2. The system is based upon “macro-arrays” on mem-\nbranes (Jobs et al. 2002), and it uses “iFRET” (Howell et al.\n2002) to produce strong fluorescence signals that may be\nspectrally multiplexed for increased throughput. PCRs are op-\ntionally multiplexed and small volume, keeping costs at an\nabsolute minimum, and these reactions may be accessed from\nany plate format or density. DASH-2 is therefore extremely\nflexible in all respects, very cheap to execute, and suitable for\nultrahigh-throughput application. The various components\nof DASH-2 have now been thoroughly tested, and the find-\nings of those studies are reported here.\n1These authors contributed equally.\n2Corresponding author.\nE-MAIL Anthony.Brookes@cgb.ki.se; FAX 46 8 324826.\nArticle and publication are at http:www.genome.org\/cgi\/doi\/10.1101\/\ngr.801103.\nMethods\n916 Genome Research 13:916–924 ©2003 by Cold Spring Harbor Laboratory Press ISSN 1088-9051\/03 $5.00; www.genome.org\nwww.genome.org\n Cold Spring Harbor Laboratory Press on November 27, 2015 - Published by genome.cshlp.orgDownloaded from \nRESULTS\nDASH-2 Concept\nFigure 1 presents a schematic overview of the complete\nDASH-2 procedure. The architecture of DASH-2 was designed\nto (1) exploit the proven benefits of DASH (simplicity and\nrobustness), (2) allow for maximal flexibility of experimental\nscale (number of samples assayed) and heterogeneity (number\nof SNPs tested), and (3) provide many options for multiplex-\ning and small-volume processing (to keep costs low). By cou-\npling DASH-2 to liquid handling and arraying robotics, ultra-\nhigh-throughput genotyping may be achieved. When such\nrobotics infrastructure is not available, the DASH-2 procedure\nnevertheless still supports medium-high-throughput studies\nthat may be performed completely manually. As presented\nbelow, the individual components of the method were first\nevaluated separately. Once optimized, these steps were used\nin combination to execute various real-world trials of DASH-2\nto meaningfully evaluate its functionality. This development\nwork was undertaken exclusively upon real human SNPs (IDs\nfrom the Human Genome Variation Database: HGVbase\n(Fredman et al. 2002) representing the full spectrum of pos-\nsible allelic base alternatives.\nPCR Considerations\nThe effectiveness of DASH-2 will depend upon how well PCRs\ncan be set up quickly, in low volume, and multiplexed. We\nemploy pipetting robotics to prepare PCR plates of dried-\ndown DNA samples in standardized arrangements, in advance\nof running DASH assays. Small volume aliquots of complete\nPCR-mix are added to these at run time, and sample rehydra-\ntion then occurs as PCR begins. Testing this system for 1–2-µL\nreactions in 1536-well plates and 2–4-µL reactions in 384-well\nplates showed it to perform just as well as when using DNA in\nsolution. However, smaller volume amplifications suffer from\nexcessive sample evaporation. Testing alternative plate de-\nsigns and plastics, plus various sealing systems, suggested that\nmuch of the water loss was occurring through the vessel walls\n(data not shown). We empirically determined that polypro-\npylene 384-well plates (ABgene), and 1536-well polypropyl-\nene plates (Greiner bio-one), closed with “Thermo-Seal” foils\n(VWR international), substantially limited this volume reduc-\ntion, whether using dry-block or water-based thermocycling\ndevices.\nRegarding PCR multiplexing, DASH deliberately employs\nshort PCR products of about 50–70 bp (as part of a secondary\nstructure avoidance strategy; Prince et al. 2001) and these\nshould be easier to multiplex than fragments of several hun-\ndred bp in length. To test routine multiplex PCR in practice,\nwe tried 49 duplex PCRs, 12 triplex PCRs, 4 tetraplex PCRs,\nand 1 hexaplex PCR, assembled from among 74, 9, 8, and 6\nSNPs, respectively, combining primer sets known to work at\nequivalent PCR annealing temperatures. Assay success or fail-\nure was determined by analyzing most of the resulting PCR\nproducts by first-generation DASH (Howell et al. 1999). Cred-\nible melting curves, suitable for genotype assignment, were\nseen for 78\/97 (80%) of the duplexes, 31\/33 (94%) of the\ntriplexes, 13\/16 (81%) of the tetraplexes, and 6\/6 (100%) of\nthe hexaplexes, indicating that routine PCR multiplexing on\nthese levels is quite effective.\nArray Creation\nDASH-2 is based upon macro-arrays of PCR products (one\nstrand, 5\u0001-biotinylated) anchored onto streptavidin-coated\nmembranes. For highest throughput application, robotic ar-\nraying devices may be used to transfer multiple plates of PCR\nproducts onto a single membrane, arranging the transferred\nDNA sets in a staggered manner, such as in 3\u0002 3, 4\u0002 4, or\n5\u0002 5 high-density grids derived from 384-well formatted\nstarting plates. Standard arraying operations such as these can\nbe performed by any of a range of robotics platforms, and we\nhave found the Microgrid II by BioRobotics (www.biorobotic.\ncom) and the Qbot by Genetix (www.genetix.com) to perform\nequally well and highly robustly (data not shown). Alterna-\ntively, to create DASH-2 arrays from any starting plate with-\nout the use of robotics, one could a centrifugation approach\n(Jobs et al. 2002). That is, after PCR, a membrane is clamped\nabove an opened PCR plate and the samples are centrifuged\nonto the array surface where they bind. To evaluate the prac-\nticality of this more novel approach to array creation, we at-\ntempted to transfer, by centrifugation, 0.5–5.0-µL volumes of\na PCR product (5\u0001-biotinylated on one strand), from portions\nof 384- and 1536-well microtiter plates onto a streptavidin-\ncoated membrane. After alkali removal of the unbound\nstrand, we assessed the DNA transfer by hybridization with a\nfluorescently labeled probe complementary to the bound\nstrand (Fig. 2). For the 384-well plate, 5-µL volumes consis-\ntently transferred perfectly, creating evenly filled features.\nSmaller volumes yielded features that were progressively\nweaker in the center, with 0.5-µL volumes forming incom-\nplete circular arcs. For the 1536-well plate, due to the smaller\ncross-sectional area of the wells, features became less than\nperfect only at sub-1-µL volumes. Fortunately, these feature-\nshape differences are unimportant for DASH-2 analysis, be-\ncause the sum rather than the pattern of the measured pixel\nintensities within each feature area are interpreted as they\nchange with time. Thus, up to the highest density and lowest\nvolume PCR reactions typically used by researchers today, we\nfound the centrifugal membrane array concept to be fully\ncompatible with the needs of DASH-2, offering high-\nthroughput potential without the use of robotics for array\ncreation.\nExecuting DASH-2 on Arrays\nHaving established practicalities for PCR and array creation,\nwe proceeded towards a full DASH-2 experiment. The signal\ngeneration mechanism was to be iFRET (Howell et al. 2002),\nwhich has previously shown to give particularly strong and\nunambiguous DASH signals. The iFRET chemistry entails uti-\nlizing a DNA-intercalating dye as a fluorescence resonance\nenergy transfer (FRET) donor, plus a probe-bound fluorophore\nas a FRET acceptor. To be able to implement this on a mem-\nbrane surface, issues of membrane auto-fluorescence first had\nto be addressed. Testing a range of membranes showed that\nautofluorescence was commonly high enough to be trouble-\nsome, and charged membranes had the additional complica-\ntion that they interacted with the SYBR Green I dye used in\niFRET, emitting strong background fluorescence (data not\nshown). By trial and error, we established that streptavidin\ncoated inert polypropylene membranes could provide ad-\nequate target DNA binding and low autofluorescence in the\nDASH-2 procedure.\nTo conduct an initial DASH-2 experiment, 192 different\ngenomic DNA samples (amplified for SNP000008200 [A\/T] in\nsingle-plex PCRs) were prepared as eightfold replica arrange-\nments of 2-µL volume in a 1536-well PCR plate. PCR products\nwere centrifugally transferred from this plate to a binding\nmembrane, and this was alkali rinsed and probed with a single\nDASH-2: SNP Genotyping on Membrane Arrays\nGenome Research 917\nwww.genome.org\n Cold Spring Harbor Laboratory Press on November 27, 2015 - Published by genome.cshlp.orgDownloaded from \niFRET probe for one of the target alleles. The membrane was\nthen subjected to the heating phase of the DASH-2 procedure,\nand for each feature the probe–target melting curves were so\ndetermined (Fig. 3). Precisely equivalent denaturation profiles\nwere seen across all eight replicas for each sample, showing\nuniformity of the DASH-2 system. Peak denaturation rates\nFigure 1 (Legend on facing page)\nJobs et al.\n918 Genome Research\nwww.genome.org\n Cold Spring Harbor Laboratory Press on November 27, 2015 - Published by genome.cshlp.orgDownloaded from \nindicated unambiguous sample-specific melting temperatures\n(Tms), correlating to one of three expected genotype patterns\npreviously seen when scoring this marker upon a first-\ngeneration DASH (Howell et al. 1999) system run with iFRET\nprobes. Comparing the derived genotype calls for these 192\nsamples with known data derived by first-generation DASH,\nrestriction digestion of PCR products (Jeffreys 1979), and Py-\nrosequencing (Nyren et al. 1993) studies indicated 100% cor-\nrect genotype calls.\nMultiplexing\nMultiplexing is concerned with obtaining more results for\nlittle or no increased cost or effort, and there are several non-\nmutually exclusive ways this could be built into DASH-2. This\ncan be viewed as “multiplexing of multiplexing”. PCR multi-\nplexing is one obvious possibility, as discussed above. Other\nstraightforward options would be parallel processing of plates\nwhen creating arrays, and conducting parallel buffer treat-\nments of membrane arrays.\nAspects of the array structure and the membrane probing\ncan also be designed to bring benefits of multiplexing. These\nwould include (1) “spectral-multiplexing”; mixtures of iFRET\nprobes with distinct emission spectra could be used in a single\nprobing to extract more than one result per array feature car-\nrying a multiplexed PCR target, (2) “intrafeature multiplex-\ning”; complete sets of genotypes could be extracted from\nhighly multiplexed PCR products by serial probing of mem-\nbranes, and (3) “interfeature multiplexing”; multiple different\ntarget loci placed at different feature positions, could be ex-\ntracted by hybridizing with a cocktail of many different\nprobes. These various options were explored.\nBinding Capacity and Multiplexed Signal Quality\nShould the membrane binding capacity or the signal quality\nin the presence of additional targets be nominal, then it\nwould not be possible to derive reliable results from signifi-\ncantly PCR-multiplexed targets, either by using spectrally\nmultiplexing probes or by serial probing. To explore these\nissues, various amounts of a 5\u0001-biotinylated oligonucleotide\ncarrying a 6-carboxy-X-rhodamine (ROX) label were centri-\nfuged as 3-µL aliquots from a 1536-well plate onto a DASH-2\nmembrane. By simply measuring membrane-bound ROX\nfluorescence signals after rinsing the membrane, we found\nthat for even up to 10 pmole (10–20-fold excess over a PCR\nproduct), the transferred DNA had not exceeded the mem-\nbranes binding capacity. Next, to evaluate the practical rel-\nevance of this large binding capacity, we modeled a multi-\nplexed target in a DASH-2 experiment by creating array fea-\ntures from 0.35 pmole (weak PCR equivalent) of synthetic\noligonucleotides representing the two single-allele (homozy-\ngous) DNA targets (SNP000574314[A\/C]). At the same time, a\ntitration series of features equivalent to these two mock geno-\ntypes were made, also including in the transfer 0.35–2.9\npmole of another target oligonucleotide (SNP000574319[C\/\nG]), so imposing competition (for binding and subsequent\nprobe hybridization) equivalent to as much as an 8-plex PCR.\nInterrogating the membrane by DASH-2 for SNP000574314\nyielded clear melting curves with no noticeable difference in\nabsolute fluorescence intensities between any of the features\n(see Fig. 4A). These results indicate that the iFRET-based\nDASH-2 system provides sufficient target DNA binding capac-\nity, absolute signal strength, and nonconfounding effects\nfrom coimmobilized targets, to support genotyping of at least\n∼8-plex PCR products.\nSpectral Multiplexing\nTo explore the utility of spectrally multiplexed probes, duplex\nPCRs were performed for SNPs with high frequency alleles\n(SNP000574304[A\/G] and SNP000003618[C\/G]) upon 16 dif-\nferent genomic DNAs. Samples were transferred into three\nreplica sections of a 1536-well plate, and a membrane array\nwas created by centrifugation. The triplicate membrane por-\ntions were probed with either an equimolar mixture of two\niFRET probes (one for each amplified marker), or separately\nwith either one of the two probes. The probes carried different\ndetection dyes, namely ROX and Bodipy TMR, which differ\nconsiderably in their emission spectra. A dynamic tempera-\nture ramp was applied, and the two marker-specific fluores-\ncence signals were separately tracked by employing two band-\npass optical filters. For Bodipy TMR fluorescence, the filter\nhad a maximum at 560 nm with a 20-nm bandwith, and for\nthe ROX filter the specifications were 630 and 30 nm. Figure\n4B illustrates the data generated by this experiment. The ob-\nserved genotype counts for the two markers were very differ-\nent, 5:9:2 versus 1:8:7 (homozygotes matching the probe:het-\nerozygotes:homozygotes mismatched to the probe), proving\nthat each SNPs data was not corrupted by signals from the\nother assay. This, plus the near identity of the derived melting\ncurves for the single-plex probings versus duplex-probings\nwith spectral resolution, demonstrates that spectral duplexing\nof iFRET probes works well for DASH-2 analysis.\nFigure 1 DASH-2 schematic. DASH-2 examines products from optionally multiplexed, small-volume PCRs, performed in any density or format\nof plate (A). PCR products are transferred to membranes to create “macro-arrays” by specific capture of one strand on the membrane surface. In\nthe absence of robotics, this is conveniently achieved by centrifugation (B). Using robotics (not illustrated), would allow staggered subarraying of\nmany different plates onto a single membrane to achieve ultrahigh-throughput. Alkali rinsing (to remove PCR reagents and make targets single\nstranded) and saturation hybridization with allele-specific probe(s) entails immersion in buffer trays or enlisting special washing platforms, and\nmore than one target per array feature may be interrogated in parallel by using differentially labeled (“spectrally multiplexed”) probes (C).\nAlternatively, probe cocktails could be employed to extract different assay (SNP) results from different features (not illustrated). Fluorescence signals\nare generated by means of iFRET (Howell et al. 2002). This entails using an allele-specific probe that is end-labeled with an acceptor-fluorophore,\nplus double-strand specific fluorescence dye to act as fluorescence donor (D). Dynamic tracking of probe-target denaturation is achieved by\nheating the membrane array in a controlled manner while monitoring fluorescence signal changes via a CCD camera (D). If using a spectrally\nmultiplexed set of iFRET probes, the target-specific signals are separately visualized by imaging the array through appropriate optical filters on a\nrotating wheel (D). As Tms specific for different probe-target combinations are reached, the iFRET signals rapidly disappear. These transitions are\nplotted as the negative derivative of fluorescence versus temperature (E), and thereby the target DNA alleles are revealed as peaks at high (probe\nmatched) and low (probe mismatched) temperatures. Heterozygous targets show two peaks of melting behavior. Serial processing of the\nmembrane is also possible, and thus additional sets of data may be extracted from array features by rerunning the DASH-2 procedure from the\nalkali rinse onwards, using extra sets of iFRET probes (F). Abbreviations: T1–4, target PCR products for different SNPs; P1–4, probes specific for\nsingle alleles of targets T1–4; lines marked as \u00011 and \u00012, distinct iFRET emission wavelengths from different fluorophores on probes (red and blue\nrespectively); green circles indicate SYBR Green I dye molecules that transfer energy (star shapes) to the probe fluorophores, as per iFRET chemistry,\nonly when the probe is bound to the target.\nDASH-2: SNP Genotyping on Membrane Arrays\nGenome Research 919\nwww.genome.org\n Cold Spring Harbor Laboratory Press on November 27, 2015 - Published by genome.cshlp.orgDownloaded from \nIntrafeature Multiplexing\nExperiments were performed to establish how many times\nmembranes could be reprobed to serially extract genotypes\nfrom individual features. Ten replica DASH-2 membranes\ncontaining single-plex PCR products for SNP000015168[A\/T]\nwere prepared. One membrane was processed to extract avail-\nable genotypes, while nine were held back. One of the nine\nmembranes plus the already processed membrane were then\nprocessed together through the DASH-2 procedure. By recy-\ncling in this way seven more times, each time adding one\nmore virgin membrane to the processed set, a series of mem-\nbranes were generated that had been serially processed be-\ntween zero and nine times. Finally, all 10 membranes were\nprocessed one last time in parallel. Checks were made after\nthe alkali rinse (i.e., before probing) to make sure that no\nresidual probe (fluorescence) was carried through from earlier\nhybridizations, and the eventual DASH-2 melting curves were\ncompared (Fig. 4C). It was apparent that data quality was\nrelatively unchanged up to five repetitions. Between 5–10\nruns the data quality decreased, although reliable genotypes\ncould still be extracted from the very last run of the experi-\nment. Thus, at least five serial hybridizations may be em-\nployed without loss of assay quality, and this could be used to\nextract multiple genotypes from individual array features car-\nrying multiple target DNAs.\nInterfeature Multiplexing\nFor diagnostic applications (testing many known mutations\nin an individual), or when examining different SNPs across\ndifferent subportions of a PCR plate, it would be useful to be\nable to use a cocktail of iFRET probes such that each would\nautomatically hybridize only to its cognate targets. To assess\nwhether this might work in practice, a membrane was pre-\npared from a 384-well PCR plate, carrying 16 sample DNAs\namplified by single-plex PCRs for 24 different SNPs\n(SNP000007612[C\/G], SNP000834421[C\/T], SNP000782464[A\/G],\nSNP001265242[G\/T], SNP001265241[G\/T], SNP000794409[A\/G],\nSNP000783245[C\/G], SNP000782459[C\/G], SNP000782466[G\/T],\nSNP001251211[A\/C], SNP000080953[A\/G], SNP001259858[A\/T],\nSNP001257116[A\/G], SNP000763322[A\/G], SNP001257107[C\/G],\nSNP000990182[A\/G], SNP000108876[A\/G], SNP000108526[A\/G],\nSNP000108654[G\/T], SNP000108052[A\/G], SNP001159272[A\/T],\nSNP000707079[A\/G], SNP001164148[A\/C], SNP000120603[A\/G]).\nCocktail probing was then attempted. First, the membrane\nwas interrogated via DASH-2 with a probe mixture containing\nprobes for 23 of the 24 assays (one probe omitted as a negative\ncontrol). Second, the membrane was treated with alkali, and\nreprobed with a combination of the 23 SNP specific probes\nplus 231 unrelated probes (for other DASH-2 assays not pres-\nent on the membrane). All probe mixtures contained 0.33\npmole\/µL of each probe. To provide reference controls, the\nDNA samples were also scored for each of these individual\nSNPs by single-plex first-generation DASH using iFRET signal\ngeneration. The melting curves obtained for the 23 and 254\nprobe cocktails were very similar to results produced when\nassaying the SNPs individually (Fig. 4D), and the negative\ncontrols were negative. Specifically, for the 23-plex cocktail,\nthe melting curves were essentially identical to the singly\nprobed assays for all tested SNPs. For the 254-plex cocktail, the\nmelting curves were highly similar to the single probings for\n20 of the SNPs, while three assays had an additional fluores-\ncence component that disappeared (denatured) at very low\ntemperature. High-complexity probe cocktails can therefore\noccasionally generate some crosshybridization between non-\ncognate probe-target pairs, but these duplexes denature early\nin the DASH-2 temperature gradient. Consequently, the ad-\nditional signals do not excessively interfere with the melting\nprofiles observed at the higher temperatures where true\nmarker alleles are normally distinguished. Probe cocktails\nthus work well in DASH-2 analysis, and while the upper com-\nplexity limit is yet to be demonstrated, extrapolation from\npresent results suggests that several thousand probes might be\nable to function together.\nTrial Applications\nTo tie together all the above developments, and evaluate\nthem for cost and precision in a real application, we used\nDASH-2 to analyze 1494 samples. Among these, 44 DNA\nsamples were duplicated on different plates as an internal\ncontrol for genotype calling accuracy, and 42 water controls\nwere also included. The samples were scored for six SNPs\n(SNP000574304[A\/G], SNP000003618[C\/G], SNP000007612[C\/G],\nSNP000015168[A\/T], SNP000063124[C\/T], and SNP000003288[C\/\nT]). The experiment employed three-plex PCRs of 2-µL vol-\nume, performed in 384-well plates. Two sets of four derived\nmembranes (each set carrying the different three-plex PCR\nproducts) were serially probed three times with single iFRET\nprobes for their component SNPs. This compact study of only\neight 384-well plates was thus structured to yield 9216 differ-\nent genotypes (less duplicates and controls).\nResults from this experiment were uniform across all\nplates and assays, and negative controls were all negative. A\ntotal of 45 samples repeatedly failed to provide any, or any-\nthing but weak, melting curve signals, and hence, this was\nassumed to be due to low concentration or degraded DNA\nstocks that were difficult to PCR amplify. Other than these, 25\nsingleton failures were observed, giving a sample dropout rate\nof <0.3%. Genotyping precision was estimated in three ways.\nFigure 2 The quality of membrane array features created by cen-\ntrifugation is shown for different volumes of transfer solution, starting\nfrom 384-well plates (top image) and 1536-well plates (bottom im-\nage).\nJobs et al.\n920 Genome Research\nwww.genome.org\n Cold Spring Harbor Laboratory Press on November 27, 2015 - Published by genome.cshlp.orgDownloaded from \nFirst, Hardy Weinberg Equilibrium was assessed for each\nmarker, and no significant deviations were observed. Second,\nwe compared a number of derived genotypes (329 DNAs\ntyped for two SNPs) to separately determined and triply-\nconfirmed assignments obtained by other methods (first-\ngeneration DASH, restriction digestion of PCR products; Jef-\nfreys 1979; and Pyrosequencing; Nyren et al. 1993). Among\nthese 658 genotypes, >99.8% identical calls were made by the\nDASH-2 system (difference due to a single genotype discrep-\nancy). Third, we examined the results obtained for the 528\ninternal replicates built into the experiment (264 duplicates,\ncomprising 44 samples scored for six SNPs). For these we\nfound that the calls agreed in 100% of the cases. Thus, the\naccuracy of the DASH-2 system is in the range 99.8–100%,\nmatching the precision established previously for the first-\ngeneration DASH system (Prince et al. 2001).\nDISCUSSION\nBasic DASH chemistry, executed under standard reaction con-\nditions with optimal assay design rules implemented by\n“DFold” software (D. Fredman, M. Jobs, and A.J. Brookes, in\nprep.), has previously been shown to be highly robust and\nable to genotype well in excess of 95% of all real SNP se-\nquences with a precision of over 99.9%. By building new in-\nnovations into this DASH chemistry, and transferring the pro-\ncedure to an array implementation, we have now created the\npowerful and highly flexible “DASH-2” system.\nDASH-2 is based upon the use of macro-arrays of target\nDNAs. This offers a range of advantages, not least (1) target\nDNA processing and probing is reduced to direct immersion\nof membranes in suitable buffer solutions, (2) multiple mem-\nbranes may be parallel-processed during their creation and\ninterrogation, (3) membranes containing multiplexed PCR\nproducts may be serially interrogated many times to extract\nall available genotypes, (4) monitoring of the dynamic assay\nstep (probe-target denaturation) entails simple real-time CCD\nimaging of the full array, and (5) array features of any scale or\ndensity can be processed equivalently. Creating these arrays is\nmade simple by the use of low-cost centrifugation procedures.\nAlternatively, if one wished to employ robotic arraying de-\nvices, throughput could be increased further by condensing\nPCR products from multiple plates onto individual mem-\nbranes in a staggered arrangement, thereby significantly re-\nducing downstream membrane processing effort.\nFor a signal generation system, DASH-2 takes advantage\nof the proven benefits of iFRET. Previous work demonstrated\nthat iFRET eliminates background signals due to target DNA\nsecondary structures. We have now shown that iFRET is ef-\nfective as a way to achieve spectral multiplexing in DASH-2\nanalysis. Our data specifically demonstrate spectral duplex-\ning, but given available dyes and the generality of iFRET, it is\nlikely that up to fourfold spectral multiplexing may be pos-\nsible, particularly if applying mathematical deconvolution of\nsignals.\nFundamentally, the power of DASH-2 emerges from its\nmany and varied uses of multiplexing—a principle that is en-\ndorsed by other notable methods such as the MASDA assay\n(Shuber et al. 1997). DASH-2 multiplexing options include,\n(1) PCR multiplexing, (2) parallel processing of array prepara-\ntion and buffer treatments, (3) use of spectrally multiplexed\nsets of iFRET probes to extract several marker results from\neach array feature, (4) use of probe cocktails to derive results\nfrom features carrying different target loci, and (5) repeated\nprobing to serially extract data from features derived from\nhighly multiplexed PCRs. This “multiplexing of multiplex-\ning” underpins the methods flexibility, enables high-\nthroughput application, and helps to keep genotyping costs\nvery low. The fact that the method only requires a single\nend-labeled fluorescent iFRET probe also ensures cost effi-\nciency. By way of example, in the final experiment we report,\nthe plastic-ware plus enzyme plus reagent cost for the full set\nof 9216 genotypes was only 460 USD. That equates to only\n0.05 USD per genotype. Minimal further multiplexing, PCR\nFigure 3 DASH-2 melting curves are shown for all possible genotypes for marker SNP000008200[A\/T]. Eight replicates of each genotype\ngenerated by the DASH-2 system (right) are compared to results produced by the first-generation DASH platform (left). The df\/dT scale is arbitrary\nand platform dependent.\nDASH-2: SNP Genotyping on Membrane Arrays\nGenome Research 921\nwww.genome.org\n Cold Spring Harbor Laboratory Press on November 27, 2015 - Published by genome.cshlp.orgDownloaded from \nFigure 4 (Legend on facing page)\nJobs et al.\n922 Genome Research\nwww.genome.org\n Cold Spring Harbor Laboratory Press on November 27, 2015 - Published by genome.cshlp.orgDownloaded from \nvolume reduction, and the use of 1536-well plates (or roboti-\ncized subgridding) would easily bring this cost down several\nfold to ∼0.01–0.02 USD per genotype—at least an order of\nmagnitude cheaper than most other fully reported systems.\nTo help the research community avail itself of DASH\ngenotyping, suggested assay designs (PCR primer and hybrid-\nization probe sequences) are being assembled, via “DFold”\nsoftware (D. Fredman, M. Jobs, and A.J. Brookes, in prep.), for\nall known human SNPs represented in the public HGVbase\nhuman polymorphism database (Fredman et al. 2002). These\ndesigns will be presented as part of the records in that data-\nbase. An experimentally validated list of proven cSNPs (vari-\nants that alter amino acid sequences) plus DASH assay re-\nagents is also being constructed, built upon all available en-\ntries in that database. In terms of practical assistance, novel\nSNP assay design help and quality-controlled validated kits of\nDASH reagents may be obtained from a dedicated DASH-\nsupport company (DynaMetrix, www.dynametrix-ltd.com).\nThese components may be used with first-generation DASH\n(Howell et al. 1999) protocols for low-medium-throughput\nstudies (several thousand genotypes per week per assay de-\nvice) or with the multiplexed DASH-2 protocols presented\nhere for high-throughput applications (one million or more\ngenotypes per week per assay device).\nIn conclusion, DASH-2 provides a powerful new alterna-\ntive for genotyping practice. It is flexible and cheap enough\nfor all to use, and it does not require expensive robotics or\nassay devices to be purchased. These benefits stem directly\nfrom the elemental simplicity of the underlying DASH reac-\ntion concept, which perhaps also has potential for expression\narray analyses, (re)sequencing, and DNA fingerprinting. We\nadditionally envisage further implementation improvements\ntowards DASH-3 (e.g., nano-scale and microbead versions)\nthat could bring even faster and cheaper genotyping possi-\nbilities in the relatively near future.\nMETHODS\nPCR\nPolymerase Chain Reacion (PCR) primers for DASH-2 assays\nwere designed using the DFold software (DynaMetrix Ltd, UK:\nD. Fredman, M. Jobs, and A.J. Brookes, in prep.). All PCR re-\naction mixes were scaled from the following basic protocol. A\n1-µL reaction contained 0.15 pmole 5\u0001-biotinylated primer,\n0.75 pmole of nonlabeled primer, 0.03 units AmpliTaq Gold®\nDNA polymerase (PE Corp.), 1\u0002 AmpliTaq Gold® Buffer, 3\nmM MgCl2, 5% Dimethylsulphoxide, and 0.2 mM of each\ndNTP. Genomic DNA ranged from 1 ng down to 0.25 ng per\nreaction and never less, thereby negating any risk of stochas-\ntic preferential amplification of one allele due to low target\ncopy number. Thermal-cycling consisted of an initial 10-min\nactivation step of 94°C for 10 min, followed by 40 cycles of\n94°C for 15 sec and an assay-specific annealing temperature\nfor 30 sec. PCRs were performed in 1–5-µL volumes in 384-\nwell polypropylene plates (ABgene) or 1–2-µL volumes in the\n1536-well polypropylene plates (Greiner bio-one). The 384-\nwell plates were heat-sealed using the Easy-Peel heat sealing\nfoil (ABgene) and the 1536-well plates were sealed with\nThermo-seal heat sealing foil (VWR international). Thermal\ncycling was performed on a 384 MultiBlock System (Thermo-\nHybaid) or in a water bath-based thermal cycling unit devel-\noped in-house. For multiplex PCR, primer combinations were\ndone such as to maintain the same reagent concentrations as\nfor regular PCR, and thermal cycling was performed as de-\nscribed above.\nTransfer and Binding to Membrane\nSample transfer from a microtiter plate to a membrane was\naccomplished via centrifugation as previously described (Jobs\net al. 2002). In brief, a streptavidin-coated polypropylene\nmembrane (DynaMetrix Ltd, UK) was prewet in HEN buffer\n(0.1 M HEPES, 10 mM EDTA, 50 mMNaCl, pH 7.5) and placed\non top of the open wells of a microtiter plate (384 wells or\n1536 wells). A compression pad (HB-TD-SFOAM, Hybaid) was\nthen placed on top of the membrane, and the arrangement\nwas pressed together in a clamping device. The device was\nthen placed in a microtiter plate centrifuge (B4i Jouan, Inc)\nand centrifuged at 1500 rpm (rotor s20) for 30 sec. The device\nwas left at room temperature for 30 min (to allow the bio-\ntinylated PCR products to bind to the strepatividin-coated\nmembrane). Finally, the clamping device was inverted and\nbriefly centrifuged to return the remaining fluid back into the\nmicrotiter plate wells.\nProbe Hybridization\nMembranes were submerged in a 0.1 M NaOH bath for 2 min\nto remove nonbiotinylated PCR product strands. They were\nthen rinsed once in HEN for neutralization, and placed sepa-\nrately on 8 \u0002 12-cm glass plates (slightly larger than the\nmembrane). A 1.5-mL HEN solution containing 0.5 pmole\/µL\nof the appropriate oligonucleotide probe was added onto each\nmembrane, and a second glass plate was placed on top to form\na hybridization chamber. The individually sandwiched mem-\nbranes were heated to 85°C on a flat PCR block (PCR express,\nThermo Hybaid) and air cooled to room temperature. A final\nrinsing in HEN was then applied to remove excess probe.\nDASH-2 Analysis\nMembranes, carrying the bound probe-target duplexes, were\nsoaked for 30 min in 0.5\u0002 HE buffer (0.1 M HEPES, 10 mM\nEDTA, pH 8.0) containing a 1:10,000 dilution of supplied\nstock SYBR Green I dye (Molecular Probes). They were then\nindividually sandwiched between two glass plates and placed\ninto a DASH-2 genotyping device (DynaMetrix Ltd). The de-\nvice consisted of a dark box, a heating platform, a light source,\nFigure 4 Experiments into aspects of DASH-2 multiplexing are illustrated. Different genotypes are distinguished by line style, with equivalent\ngenotypes per panel using the same line style. For each image the df\/dT scale is in platform-dependent arbitrary units. (A) Robustness of signal\nstrength and quality when multiplexing the PCR were demonstrated by modeling the presence of competing target molecules. The stated ratios\nindicated the amount of true target versus other DNAs coimmobilized within an array feature and assayed for the true target by DASH-2. (B) The\nviability of spectrally multiplexing iFRET probes is shown by these example genotypes, produced by DASH-2 analysis of a duplexed PCR. Targets\nwere SNP000574304 and SNP000003618, and the matching probes were P1 (carrying Bodipy TMR: 560nm emission) and P2 (carrying ROX:\n630nm emission), respectively. The probe combinations used for DASH-2 analysis are shown in each cell. The same DNA samples are assayed in\nthe top and bottom cells. The left two cells were imaged through a 560-nm filter, while the right two cells were imaged through a 630-nm filter.\n(C) The potential for serial interrogation of membranes was established by comparing DASH-2 melting curves from replica arrayed samples after\nprobing for the number of times indicated in the corner of each cell. (D) The extent to which probe cocktails may be used to examine different\nmarkers at different feature positions was explored by assaying arrayed single-plex PCRs for 24 SNPs (two examples shown, as left and right columns\nof cells); probe complexities are as indicated. Most markers suffered only a minimal loss of data quality regardless of the probe cocktail complexity\n(left column example), while three SNPs acquired extra early-melting fluorescence when interrogated by the 254-probe mixture (right column\nexample).\nDASH-2: SNP Genotyping on Membrane Arrays\nGenome Research 923\nwww.genome.org\n Cold Spring Harbor Laboratory Press on November 27, 2015 - Published by genome.cshlp.orgDownloaded from \nand a CCD camera with appropriate optical filters. Fluores-\ncence values were collected as the membrane assembly was\nheated from 35–85°C (with a heating rate of 2–3°C\/min) by\nimaging every 0.5°C.\nGenotype Calling\nMelting curves were generated for each array feature by pur-\npose built software (DynaMetrix Ltd). Denaturation events\nwere most readily visualized by analysis of a plot of the nega-\ntive derivative of the fluorescence versus temperature profile.\nPresence of a single high-temperature peak indicated the\nsample was homozygous for the allele complementary to the\nallele present in the oligonucleotide probe. A single low-\ntemperature peak indicated homozygosity for the alternative\nallele. A curve with peaks at both temperatures indicated that\nthe sample was heterozygous.\nACKNOWLEDGMENTS\nWe gratefully acknowledge the Swedish Research Council &\nCarl Tryggers Foundation for Scientific Research for funding\nthat helped with aspects of our research undertakings, and we\nthank the Karolinska Institute Center for Genomics and Bio-\ninformatics and Pharmacia Corporation for provision of en-\nabling infrastructure. General technical assistance by various\nmembers of our laboratory is appreciated, and in particular,\nwe thank David Fredman, Daniel Pederson, Johan Klingberg,\nand Mark Reimers for innovative software contributions.\nThe publication costs of this article were defrayed in part\nby payment of page charges. This article must therefore be\nhereby marked “advertisement” in accordance with 18 USC\nsection 1734 solely to indicate this fact.\nREFERENCES\nBrookes, A.J. 1999. The essence of SNPs. Gene 234: 177–186.\nFredman, D., Siegfried, M., Yuan, Y.P., Bork, P., Lehvaslaiho, H., and\nBrookes, A.J. 2002. HGVbase: A human sequence variation\ndatabase emphasizing data quality and a broad spectrum of data\nsources. Nucleic Acids Res. 30: 387–391.\nHowell, W.M., Jobs, M., and Brookes, A.J. 2002. iFRET: An improved\nfluorescence system for DNA-melting analysis. Genome Res.\n12: 1401–1407.\nHowell, W.M., Jobs, M., Gyllensten, U., and Brookes, A.J. 1999.\nDynamic allele-specific hybridization. A new method for scoring\nsingle nucleotide polymorphisms. Nat. Biotechnol. 17: 87–88.\nJeffreys, A.J. 1979. DNA sequence variants in the G \u0002-, A \u0002-, \u0003- and\n\u0004-globin genes of man. Cell 18: 1–10.\nJobs, M., Howell, W.M., and Brookes, A.J. 2002. Creating arrays by\ncentrifugation. Biotechniques 32: 1322–1324, 1326, 1329.\nLay, M.J. and Wittwer, C.T. 1997. Real-time fluorescence genotyping\nof factor V Leiden during rapid-cycle PCR. Clin. Chem.\n43: 2262–2267.\nNyren, P., Pettersson, B., and Uhlen, M. 1993. Solid phase DNA\nminisequencing by an enzymatic luminometric inorganic\npyrophosphate detection assay. Anal. Biochem. 208: 171–175.\nPrince, J.A., Feuk, L., Howell, W.M., Jobs, M., Emahazion, T.,\nBlennow, K., and Brookes, A.J. 2001. Robust and accurate single\nnucleotide polymorphism genotyping by dynamic allele-specific\nhybridization (DASH): Design criteria and assay validation.\nGenome Res. 11: 152–162.\nShuber, A.P., Michalowsky, L.A., Nass, G.S., Skoletsky, J., Hire, L.M.,\nKotsopoulos, S.K., Phipps, M.F., Barberio, D.M., and Klinger,\nK.W. 1997. High-throughput parallel analysis of hundreds of\npatient samples for more than 100 mutations in multiple disease\ngenes. Hum. Mol. Genet. 6: 337–347.\nTsuchihashi, Z. and Dracopoli, N.C. 2002. Progress in\nhigh-throughput SNP genotyping methods. Pharmacogenomics J.\n2: 103–110.\nWang, D.G., Fan, J.B., Siao, C.J., Berno, A., Young, P., Sapolsky, R.,\nGhandour, G., Perkins, N., Winchester, E., Spencer, J., et al.\n1998. Large-scale identification, mapping, and genotyping of\nsingle-nucleotide polymorphisms in the human genome. Science\n280: 1077–1082.\nWEB SITE REFERENCES\nwww.biorobotic.com; suppliers of lab-robotic equipment.\nwww.genetix.com; suppliers of lab-robotic equipment.\nwww.dynametrix-ltd.com; supplies and supports SNP genotyping by\nDynamic Allele-Specific Hybridization—DASH.\nReceived January 29, 2003; accepted in revised form February 26, 2003.\nJobs et al.\n924 Genome Research\nwww.genome.org\n Cold Spring Harbor Laboratory Press on November 27, 2015 - Published by genome.cshlp.orgDownloaded from \n 10.1101\/gr.801103Access the most recent version at doi:\n2003 13: 916-924 Genome Res. \n  \nMagnus Jobs, W. Mathias Howell, Linda Strömqvist, et al. \n  \nby Dynamic Allele-Specific Hybridization on Membrane Arrays\nDASH-2: Flexible, Low-Cost, and High-Throughput SNP Genotyping\n  \nReferences\n  \n http:\/\/genome.cshlp.org\/content\/13\/5\/916.full.html#ref-list-1\nThis article cites 12 articles, 6 of which can be accessed free at:\n  \nLicense\nCommons \nCreative\n  \n http:\/\/creativecommons.org\/licenses\/by-nc\/3.0\/.described at \na Creative Commons License (Attribution-NonCommercial 3.0 Unported License), as \n). After six months, it is available underhttp:\/\/genome.cshlp.org\/site\/misc\/terms.xhtml\nfirst six months after the full-issue publication date (see \nThis article is distributed exclusively by Cold Spring Harbor Laboratory Press for the\nService\nEmail Alerting\n  \n click here.top right corner of the article or \nReceive free email alerts when new articles cite this article - sign up in the box at the\n http:\/\/genome.cshlp.org\/subscriptions\ngo to: Genome Research To subscribe to \nCold Spring Harbor Laboratory Press\n Cold Spring Harbor Laboratory Press on November 27, 2015 - Published by genome.cshlp.orgDownloaded from \n"}