{"doi":"10.1029\/2006WR004936","coreId":"66542","oai":"oai:dro.dur.ac.uk.OAI2:1238","identifiers":["oai:dro.dur.ac.uk.OAI2:1238","10.1029\/2006WR004936"],"title":"Emergence of coherent flow structures over a gravel surface : a numerical experiment.","authors":["Hardy, R. J.","Lane, S. N.","Ferguson, R. I.","Parsons, D. R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-03-16","abstract":"Gravel bed rivers have complex, porous, and irregular surfaces, characterized by a range of morphological forms. These topographical structures determine the flow structures that develop over the river bed, primarily by the shedding of vortices in the downstream wake of protruding clasts. Previous research into these flow structures has come from experimental studies, which have used either flow visualization or single-point measurements techniques. Here we present a numerical experiment where large-eddy simulation (LES) is used to study the generation, evolution, and destruction of these flow structures over a naturally water worked gravel surface. The numerical simulations reported in this paper show that there are two distinct scales of boundary influence upon the shallow flow and emphasize that the measured flow variability at any one point in a natural river will contain both locally derived and upstream-inherited flow structures, according to the range of scales of bed topography present","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66542.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1238\/1\/1238.pdf","pdfHashValue":"65f01de3be5aae7934e0e0e473fdd3e5d30ede51","publisher":"American Geophysical Union","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1238<\/identifier><datestamp>\n      2016-08-05T12:56:28Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Emergence of coherent flow structures over a gravel surface : a numerical experiment.<\/dc:title><dc:creator>\n        Hardy, R. J.<\/dc:creator><dc:creator>\n        Lane, S. N.<\/dc:creator><dc:creator>\n        Ferguson, R. I.<\/dc:creator><dc:creator>\n        Parsons, D. R.<\/dc:creator><dc:description>\n        Gravel bed rivers have complex, porous, and irregular surfaces, characterized by a range of morphological forms. These topographical structures determine the flow structures that develop over the river bed, primarily by the shedding of vortices in the downstream wake of protruding clasts. Previous research into these flow structures has come from experimental studies, which have used either flow visualization or single-point measurements techniques. Here we present a numerical experiment where large-eddy simulation (LES) is used to study the generation, evolution, and destruction of these flow structures over a naturally water worked gravel surface. The numerical simulations reported in this paper show that there are two distinct scales of boundary influence upon the shallow flow and emphasize that the measured flow variability at any one point in a natural river will contain both locally derived and upstream-inherited flow structures, according to the range of scales of bed topography present.<\/dc:description><dc:subject>\n        Coherent flow structures<\/dc:subject><dc:subject>\n         Gravel bed rivers.<\/dc:subject><dc:publisher>\n        American Geophysical Union<\/dc:publisher><dc:source>\n        Water resources research, 2007, Vol.43(3), pp.W03422 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-03-16<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1238<\/dc:identifier><dc:identifier>\n        issn:0043-1397<\/dc:identifier><dc:identifier>\n        doi:10.1029\/2006WR004936<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1238\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1029\/2006WR004936<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1238\/1\/1238.pdf<\/dc:identifier><dc:rights>\n        © 2007 American Geophysical Union.\\ud\nHardy, R. J. and Lane, S. N. and Ferguson, R. I. and Parsons, D. R., (2007), 'Emergence of coherent flow structures over a gravel surface: a numerical experiment, Water resources research, 43, W03422, 10.1029\/2006WR004936 (DOI). To view the published open abstract, go to http:\/\/dx.doi.org and enter the DOI.\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0043-1397","issn:0043-1397"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Coherent flow structures","Gravel bed rivers."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n25 March 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nHardy, R. J. and Lane, S. N. and Ferguson, R. I. and Parsons, D. R. (2007) ’Emergence of coherent flow\nstructures over a gravel surface : a numerical experiment.’, Water resources research., 43 . W03422.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1029\/2006WR004936\nPublisher’s copyright statement:\n2007 American Geophysical Union. Hardy, R. J. and Lane, S. N. and Ferguson, R. I. and Parsons, D. R., (2007),\n’Emergence of coherent flow structures over a gravel surface: a numerical experiment, Water resources research, 43,\nW03422, 10.1029\/2006WR004936 (DOI). To view the published open abstract, go to http:\/\/dx.doi.org and enter the\nDOI.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n25 March 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nPublished version \n \nCitation for published item: \nHardy, R. J. and Lane, S. N. and Ferguson, R. I. and Parsons, D. R. (2007) 'Emergence of \ncoherent flow structures over a gravel surface : a numerical experiment.', Water resources \nresearch., 43 . W03422. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1029\/2006WR004936 \n \nPublisher’s copyright statement: \n© 2007 American Geophysical Union. \n \nAdditional information: \nHardy, R. J. and Lane, S. N. and Ferguson, R. I. and Parsons, D. R. (2007), 'Emergence of \ncoherent flow structures over a gravel surface : a numerical experiment‘,Water resources \nresearch, 43, W03422, 10.1029\/2006WR004936 (DOI). To view the published open \nabstract, go to http:\/\/dx.doi.org and enter the DOI. \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nEmergence of coherent flow structures over a gravel surface:\nA numerical experiment\nRichard J. Hardy,1 Stuart N. Lane,1 Robert I. Ferguson,1 and Daniel R. Parsons2\nReceived 1 February 2006; revised 21 October 2006; accepted 2 November 2006; published 16 March 2007.\n[1] Gravel bed rivers have complex, porous, and irregular surfaces, characterized by a\nrange of morphological forms. These topographical structures determine the flow\nstructures that develop over the river bed, primarily by the shedding of vortices in the\ndownstream wake of protruding clasts. Previous research into these flow structures has\ncome from experimental studies, which have used either flow visualization or single-point\nmeasurements techniques. Here we present a numerical experiment where large-eddy\nsimulation (LES) is used to study the generation, evolution, and destruction of these flow\nstructures over a naturally water worked gravel surface. The numerical simulations\nreported in this paper show that there are two distinct scales of boundary influence upon\nthe shallow flow and emphasize that the measured flow variability at any one point in a\nnatural river will contain both locally derived and upstream-inherited flow structures,\naccording to the range of scales of bed topography present.\nCitation: Hardy, R. J., S. N. Lane, R. I. Ferguson, and D. R. Parsons (2007), Emergence of coherent flow structures over a gravel\nsurface: A numerical experiment, Water Resour. Res., 43, W03422, doi:10.1029\/2006WR004936.\n1. Introduction\n[2] Flow in gravel bed rivers is usually very shallow in\nrelation to the height of the roughness elements forming the\nbed. The relative submergence (ratio of mean flow depth, d,\nto typical roughness height, ks) seldom exceeds 10–20 in\nflood conditions, and can be less than 5 in normal flows. In\nsuch shallow flows the detailed microtopography of the bed\nexerts a significant effect on the flow [Wiberg and Smith,\n1991; Dinehart, 1992]. An average velocity profile may be\napproximately logarithmic at d\/ks \u0001 10, but will have\nsubstantial local variation near the bed. These near-bed\nfeatures relate in the first place to the wakes of individual\nobstacle clasts, and jets between such clasts, and as such\nwould not be expected to extend much above the tops of the\nobstacles. Yet, field measurements and laboratory visuali-\nzation suggest that shallow flows over gravel beds contain\ncoherent macroturbulent structures, often described as con-\nsisting of full depth ‘‘wedges’’ of alternately slower- and\nfaster-than-average flow [Falco, 1977; Roy et al., 2004].\nThe origin of these macroturbulent phenomena, and their\nrelationship to the ensemble of individual roughness ele-\nments forming the bed, is not well understood.\n[3] In this paper we approach this problem in a novel way\nusing large-eddy simulation (LES). Most computational\nfluid dynamics (CFD) applications to natural gravel bed\nrivers have represented the channel geometry using bound-\nary fitted coordinates and simulated the time average flow\nusing a turbulence closure scheme to represent the effect of\nturbulent stresses introduced through Reynolds averaging.\nSeveral of the authors of such applications of CFD have\ncommented on the ambiguity of whether the bed micro-\ntopography should be represented physically as part of the\nchannel geometry or parametrically through an exaggerated\nvalue of the roughness height in a log law representation of\nflow in the cells adjacent to the bed [Hodskinson and\nFerguson, 1998; Sinha et al., 1998; Gessler et al., 1999;\nNicholas and Smith, 1999; Bradbrook et al., 2000; Booker\net al., 2001; Ferguson et al., 2003]. Here we take advantage\nof a recently developed alternative approach to CFD sim-\nulation of rivers with irregular beds where detailed bed\ngeometry is represented explicitly through a porosity algo-\nrithm approach [Lane et al., 2002; Lane et al., 2004; Hardy\net al., 2005]. Because the grid is geometrically rectangular,\nit is possible to represent the larger scales of turbulence\nexplicitly using LES (see Keylock et al. [2005] for a\nsummary of fluvial applications). Here we apply the tech-\nnique to a shallow flow over a digital elevation model\n(DEM) based on a natural gravel bed river. The results show\nthat the method works for this natural situation; more\nimportantly, they contain macroturbulent features that\nresemble those inferred from field measurements and labo-\nratory visualization. The LES results give high spatial\nresolution in three dimensions through time, in a way that\nis currently difficult to match by laboratory measurements\nand impossible to match in the field using currently avail-\nable technology. The methodology is therefore seen as\nhaving considerable potential for elucidating flow structures\nin shallow streams.\n[4] Previous studies of the generation of flow structures\nin depth-limited boundary flows have principally concen-\ntrated on well sorted beds composed of homogenous par-\nticles [Grass, 1971; Grass et al., 1991; Krogstad et al.,\n1992]. In these studies, a skimming flow develops, where\nthe momentum exchange mechanism shows strong similar-\nities with bursting processes over smooth surfaces [Smith,\n1996; Grass and Mansour-Tehrani, 1996]. There have been\n1Department of Geography, University of Durham, Durham, UK.\n2School of Earth and Environment, University of Leeds, Leeds, UK.\nCopyright 2007 by the American Geophysical Union.\n0043-1397\/07\/2006WR004936$09.00\nW03422\nWATER RESOURCES RESEARCH, VOL. 43, W03422, doi:10.1029\/2006WR004936, 2007\nClick\nHere\nfor\nFull\nArticle\n1 of 14\nfar fewer studies of turbulence in flows over rough natural\ngravel surfaces. In this environment, the flow structures\nwhich occur in the downstream wake of protruding clasts\nand\/or bed forms, result in the shedding of vortices from the\nlee of protruding objects [Robert et al., 1993; Kirkbride,\n1993; Buffin-Be´langer and Roy, 1998]. These vortices scale,\nin the near bed region, with respect to grain size [Clifford et\nal., 1992; Clifford and French, 1993]. As with flow over\nsmooth beds, larger structures may be created by the\ncoalescence and amalgamation of numerous smaller-scale\nstructures [Head and Bandyopadhyay, 1981, Smith et al.,\n1991]. They take the form of high- and low-speed wedges\nand develop in the outer layer of the flow [Falco, 1977;\nKirkbride and Ferguson, 1995; Ferguson et al., 1996; Roy\net al., 2004].\n[5] These depth scale (or macroturbulent) eddies are\nclosely linked to the bursting phenomenon in boundary\nlayers [Grishanin, 1990; Yalin, 1992]. The fluid ejections\/\nsweeps have a quasi-cyclic pattern and are not just restricted\nto the near bed region, but influence the entire flow field\nirrespective of bed roughness [Grass, 1971; Talmon et al.,\n1986; Shen and Lemmin, 1999]. The ejected low-momentum\nfluid moves through the entire flow depth up to the water\nsurface, while high-momentum fluid moves from the\nwater surface toward the bed [Grass et al., 1991]. This\ngives rise to rolling structures [e.g., Klaven, 1966; Klaven\nand Kopaliani, 1973; Imamoto and Ishigaki, 1986a, 1986b].\nThere is a general consensus as to the pattern of the bursting\nphenomenon in the near bed region [Nezu and Nakagawa,\n1993]. However, opinion differs about the ordered depth\nscale motions in open channel flows [Shvidchenko and\nPender, 2001]. Observations have reported streamwise\nspacing length scales of between 2 and 7 times the water\ndepth (d) for these bursting events [Sumer and Deigaard,\n1981; Nezu and Nakagawa, 1993; Best, 1993; Nikora and\nGoring, 1999; Sechet and Le Guennec, 1999; Shvidchenko\nand Pender, 2001]. Furthermore, Yalin [1992] argues that\nthe depth scale eddies are neither permanent nor do they\noriginate in their full size (d), but are generated near the\nbed as a result of a burst and then grow until the size\nbecomes nearly equal to d. They are then destroyed,\npromoting a generation of new eddies and causing a cycle\nof positive feedback. The complete cycle occurs over a\ndistance of 6 d [Shvidchenko and Pender, 2001], although\nthe definition of d over these complex surfaces is difficult. It\nalso remains unclear as to why high- and low-speed regions\nexist alternately in the streamwise and spanwise direction in\nturbulent flow [Nychas et al., 1973; Falco, 1977; Kirkbride\nand Ferguson, 1995; Ferguson et al., 1996; Buffin-Belanger\net al., 2000; Roy and Buffin-Belanger, 2000]. Some authors\nhave explained this in terms of the bursting phenomenon\n[Yalin, 1992; Nezu and Nakagawa, 1993]. Others have\nexplained the sequence of high- and low-speed regions by\nthe downstream motion of large-scale turbulent eddies\n[Shvidchenko and Pender, 2001].\n[6] Given the above, it is clear that a full understanding of\nthe cause and regularity of macroturbulent fluctuation in\nshallow flows over gravel beds does not exist. Process\ninformation derived from data collected from laboratory\nexperiments and field studies provides contradictory evi-\ndence. Some studies have been interpreted as showing low-\nfrequency velocity fluctuations corresponding to a spatial\nscale of the order of the flow depth [Komori et al., 1982;\nGrinvald and Nikora, 1988; Clifford et al., 1992; Lapointe,\n1992; Nezu and Nakagawa, 1993; Robert et al., 1993; Roy\net al., 1996; Cellino and Graf, 1999; Shen and Lemmin,\n1999]. Other authors do not detect any regular period in\nturbulent fluctuations [Grinvald, 1974; Nikora and Smart,\n1997], which suggests coherent structures are randomly\ndistributed in time and space [Nychas et al., 1973; Smith,\n1996; Nikora and Goring, 1999]. Studies of turbulent\nstructures in gravel bed rivers in the field are limited\nbecause of the challenges of instrumentation [Roy et al.,\n1996]. This has considerable significance if a high-\nresolution (individual particle) understanding of sediment\ntransport is to be developed in such an environment as a\ncomplete understanding of the driving forces is required.\n2. Methodology\n2.1. Numerical Simulation of Flow Over Complex\nMicrotopography\n[7] The incorporation of complex microtopographies\n(individual particles) within a CFD scheme has been prob-\nlematic to date as the representation of large-scale topo-\ngraphic features has required the application of boundary\nfitted coordinates (BFCs), which involve mesh deformation\nin the Cartesian space (though not in the computational\nspace). Mesh deformation may increase the numerical\ndiffusion in a CFD model application and lead to uncer-\ntainties as to whether observed changes in process repre-\nsentation are due to topographic effects or grid adjustment\neffects. Moreover, the mesh distortion increases as the\nresolution of spatial discretization increases as the topo-\ngraphic information becomes more complex. Second, the\nsubgrid-scale topography (e.g., grain surface morphology,\ngrain interactions) within the CFD scheme has traditionally\nbeen represented using a roughness parameter which repre-\nsents the frictional retardation of the flow in the cell\ntouching the bed. Most commonly, the representation of\ntopographic variability involves specification of a friction\nheight (zo) in some sort of wall function and the multipli-\ncation upward of the equivalent sand grain roughness. In a\n3-D modeling framework, this assumes that the topographic\nvariability that is not included in the model geometry is\nrepresented as a subgrid-scale effect through this upscaling.\nThere is debate over which grain parameter to upscale and\nby how much. For instance, field investigations suggest that\nzo should, including upscaling, take a value of about 0.1 D84\n[Whiting and Dietrich, 1990; Wiberg and Smith, 1991] or\nwhen specified as ks, (where ks = 30 zo) 3.5 D84 or 6.8 D50\n[Hey, 1979; Bray, 1982], which has been derived from\neither fitting the log law to a single velocity profile or from\ncross-sectional average mean velocities. These estimates of\nroughness height may be problematic for 3-D CFD appli-\ncations where the wall function is only applied to the\nboundary cells, not full (or even part) of the flow profile.\nFurthermore, it has been shown that the multiplication of\nroughness length represents a measure of total flow resis-\ntance that incorporates contributions from both individual\ngrains and larger bed forms [Wiberg and Smith, 1991;\nClifford et al., 1992].\n[8] These uncertainties aside, the wall function approach\nis associated with a number of problems in 3-D CFD\n2 of 14\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES W03422\napplications. These include (1) the multiplier of roughness\nlength will need to be spatially variable and scale depen-\ndent, in relation to both mesh resolution and the topographic\ncontent of the data set used to describe the surface,\n(2) reduced numerical stability and solution accuracy for\nflows characterized by high relative roughness [e.g.,Nicholas\nand Smith, 1999] because of the existence of an upper limit\nof ks for a given near-bed cell thickness [Nicholas, 2001],\nand (3) the basic problem of setting the reference height of\nthe bed in a numerical mesh: normally, it is assumed\nimplicitly that the effective bed surface in mass conservation\nterms is the same as the bed surface sampled during field\nsurvey.\n[9] An alternative approach has recently been developed\nfor incorporating complex river bed topographies into\nregular structured meshes, without the need to use boundary\nfitted coordinates [Lane et al., 2002, 2004; Hardy et al.,\n2005]. It uses a porosity method based upon the work of\nOlsen and Stokseth [1995] and involves the use of a regular\nstructured grid in which all control volumes are orthogonal\nin both computational and Cartesian space, with the bed\ntopography specified using cell porosities (P). This\napproach has been successfully validated using digital\nparticle image velocimetry (DPIV) as applied to an irregular\narrangement of cuboidal roughness elements [Hardy et al.,\n2005] and for the case of time-averaged flow over rough\ngravel beds [Lane et al., 2004]. The development of this\nmethod has allowed an understanding of the way in which a\ncomplex gravel bed surface interacts with the associated\nflow field and provides the opportunity for understanding\nthe interaction between gravel bed topography and the\nassociated 3-D flow field.\n2.2. Large-Eddy Simulation\n[10] In this paper, we couple the porosity bed form\nrepresentation method to large-eddy simulation (LES) in\norder to study time-dependent flow structures over a gravel\nsurface. Modeling flows over complex topography is prob-\nlematic [Patel, 1998] and only recently have attempts been\nmade to model such flows using LES [Ciofalo and Collins,\n1992; Lee, 2002]. Recent applications of LES to fluvial\nproblems include flow at a parallel channel confluence\n[Bradbrook et al., 2000]; flow and sediment transport over\nboth two and three dimensional bed ripples [Zedler and\nStreet, 2001]; and flow over surface-mounted transverse ribs\n[Cui et al., 2003].\n[11] LES calculates the properties of all eddies larger\nthan the filter size and models those smaller than this scale\nby a subgrid-scale (SGS) turbulence transport model\n[Gullbrand and Chow, 2003]. There are several theoretical\nsummaries of the principles of LES [Lesieur and Me´tais,\n1996; Lesieur et al., 1997; Rodi et al., 1997; Sagaut, 1998;\nMeneveau and Katz, 2000; Piomelli and Balaras, 2000;\nFro¨hlich and Rodi, 2002; Moin, 2002; Keylock et al.,\n2005]. Central to LES is one core principle: the grid size\nthat is resolved is sufficient to represent the scales of time-\ndependent features present in the flow. This means that\nmesh design issues are crucial. The porosity algorithm\ndescribed above is important: it maintains a constant mesh\nsize in space and so allows simulation of time-dependent\nflow structures using LES.\n[12] There are two important factors which need consid-\neration in the construction of a LES scheme: (1) the choice\nof filter and (2) the subgrid-scale model (SGS). In LES a\nlength scale is required to determine a filter size. This is\noften taken to be equal to the grid size employed in the\nsolution of the equations: then eddies larger than the filter\nscale are solved directly; and the effects of eddies less than\nthe filter scale are modeled using a subgrid-scale treatment.\nA series of appropriate filters were initially defined by\nLeonard [1974]. Since then, the box (top hat) filter has\nbeen the most common choice [Deardorff, 1970a; Clark et\nal., 1979; Silveira Neto et al., 1991], although Gaussian\nfilters [Vreman et al., 1994] and spectral cutoff filters\n[Ha¨rtel and Kleiser, 1998] have also been used. It has been\nsuggested that the choice of filter makes little difference to\nthe solution [Ha¨rtel, 1996; Ha¨rtel and Kleiser, 1997] and\nthe choice of the SGS is more important.\n[13] SGS models represent the exchange of energy\nbetween the grid and subgrid scales. In turbulent flows\nenergy transfer is typically from the larger to the smaller\neddies (energy cascade) although this process may not be\ncontinuous especially where eddies impinge upon either a\nsolid surface or in shear layers. Here an inverse transfer of\nenergy between scales is possible and is important for the\ngrowth of turbulence in wall-bounded flows [Piomelli et al.,\n1990]. Therefore an ideal SGS model should be able to\ncapture both the forward and inverse energy transfers. This\nhas proven to be a major stumbling block for the develop-\nment of SGS models. Indeed, there are several SGS models\nthat can be applied and a considerable amount of literature\non the problem.\n[14] The original SGS model, from which most schemes\nhave evolved, is the Smagorinsky SGS model [Smagorinsky,\n1963]. This is an eddy viscosity model which is abso-\nlutely dissipative: it only accounts for energy transfer\nfrom large to small eddies. This model was initially adopted\nby Deardorff [1970a, 1970b] to study turbulent channel\nflow and the planetary boundary layer. It has proved to be\nparticularly popular in a range of literatures [Bedford and\nBabajimopoulos, 1980; Moin and Kim, 1982; Cai and\nSteyn, 1996] although the scheme has been criticized as\nbeing over reliant on the Smagorinsky constant, Cs. The\nvalue for Cs has been obtained theoretically from the\nKolmogorov constant Ck; the constant in the Kolmogorov\nenergy cascade of turbulence from large to small scales.\nConstant values range from 0.17 [Schumann, 1991] to 0.1\nfor turbulent channel flow [Deardorff, 1970a; Moin and\nKim, 1982] and have been shown to be both a function of\ntime and space that varies between 0.07 and 0.24 [Rogallo\nand Moin, 1984]. Thus Cs varies with the type of flow as\ndifferent processes contribute to the value of Cs [Canuto\nand Cheng, 1997]. With these limitations in mind, several\nalternate SGS models have been proposed.\n[15] One of the simpler alternatives is the scale similarity\nmodel [e.g., Bardina et al., 1980] which is based on the\nassumption that the most important unresolved eddies are\nthose of a size just smaller than the filter size. Here a double\nfilter is implemented which has the advantage that it is\npotentially possible for backscatter effects to be mimicked\nat the subgrid scales. However, the scale similarity model\ndoes not dissipate sufficient energy and is therefore often\nemployed in combination with the Smagorinsky model. It is\nalso possible to define a spectral eddy viscosity [e.g.,\nChollet and Lesieur, 1981] (see Lesieur et al. [1999] for a\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES\n3 of 14\nW03422\ncomplete review]) where the effective eddy viscosity is\nobtained as a function of the cutoff wave number by\nassuming a spectrum with a slope of \u00025\/3 and a cutoff at\nthe boundary between the resolved and unresolved scales.\n[16] Another development in SGS modeling has been\ndynamic methods, where a second ‘‘test’’ filter is employed\nto evaluate Cs as a function of both time and space\n[Germano et al., 1991; Germano, 1992; Meneveau and\nKatz, 1999]. This approach uses the smallest scales of the\nresolved turbulence to provide information about the local\nvalue for the SGS model coefficient through a dynamic\nSmagorinsky coefficient (Cd). The Germano approach\nrelates the resolved turbulent stresses to the subgrid and\nsubtest-scale stresses where the coefficient is moved outside\nof the filtering operation and locally chosen, thus minimiz-\ning the residual error. Since the original methodology there\nhave been several modifications. One of the most significant\nwas that of Lilly [1992] who introduced a least squares\ntechnique to evaluate Cd to give a local dynamic model.\nHowever, there are some important theoretical and practical\ndifficulties with the original dynamic model formulation.\nThese have been addressed with the development of\nenhanced dynamic SGS modeling. By moving the coeffi-\ncient outside of the filter, the relation between neighboring\nvalues for the coefficient is eliminated. This leads to too\nmuch variability in the coefficient field, including the\nproduction of negative eddy viscosities. Potentially this\nallows the possibility of representing an inverse energy\ntransfer, but it tends to destabilize the numerical solution\nas regions of negative viscosity persist and grow. It is\npossible to deal with this by ‘‘clipping’’ negative values\nto positive [Zang et al., 1993] and\/or assuming at least one\nhomogeneous direction in the flow and averaging the\ncoefficient over this direction to generate a more smoothly\nvarying field for Cd [Moin et al., 1991].\n[17] Another method of incorporating the inverse energy\ncascade is to add a stochastic term into the SGS modeling\n[Mason and Thomson, 1992]. However, if the backscatter is\nmodeled as noise which is not temporally autocorrelated,\nthere is an implicit scale separation between the smallest\nresolved eddies and the eddies just smaller than the filter\nsize [Ghosal et al., 1995]. Stochastic representation of the\ninverse cascade within the framework of dynamic localiza-\ntion has been developed by introducing an eddy force at\nboth the grid and test filter scale, which was modeled as a\nzero-centered white noise process [Carati et al., 1995]. To\nprevent the global minimization becoming a stochastic\nproblem, the errors resulting from using modeled as\nopposed to known values for Cs were averaged over the\npossible realizations of the noise for a particular velocity\nfield. This removed any effect due to mean behavior, but\nretained an effect upon the flow energy. However, these\napproaches are computationally demanding.\n[18] In order to reduce computational demands, several\ndevelopments have occurred. These include an approxima-\ntion to the integral required in the dynamic localization\nmethod based on time extrapolation [Piomelli and Liu,\n1995] as well as ensemble averaging to determine the effect\nof small scales on the modeled flow [Meneveau et al.,\n1996]. This approach defines the temporal averaging: A\ntimescale based on the smallest resolved eddies calculated\nfrom a Lagrangian trajectory of fluid packets. The defined\naveraging is sufficiently flexible to allow a shorter time\nframe for averaging in regions of high strain and to permit\nless weight to be attached to values representing backscatter.\nFurthermore, the simulation of eddy structures showed that\nthe use of Lagrangian averaging reduced the dissipation for\nejection events, giving more realistic results than standard\naveraging [Meneveau et al., 1996]. Moreover, a scale-\ndependent dynamic subgrid-scale model has been devel-\noped which unlike the traditional dynamic model does not\nrely on the assumption that the model coefficient is scale\ninvariant [Porte´-Agel et al., 2000]. This approach is based\non introducing a secondary test filter that, in addition to the\ntraditional test filter, is used to determine both the coeffi-\ncient and how it changes across scales [Porte´-Agel et al.,\n2000]. Validation experiments of the new model, looking at\nvelocity spectra from simulations of an atmospheric bound-\nary layer, show that the model improves the predictions of\nspectral slopes at different heights from the ground as in the\nnear-surface region, the traditional Smagorinsky model is\ntoo dissipative and traditional dynamic models are not\ndissipative enough [Porte´-Agel et al., 2000].\n[19] Finally, another approach for subgrid-scale models\nhas been to optimize the scales that are available in the LES.\nThis has been called both ‘‘inverse modeling’’ [Geurts,\n1997] and ‘‘approximate deconvolution’’ [Domaradzki\nand Saiki, 1997; Domaradzki and Loh, 1999; Stolz and\nAdams, 1999; Stolz et al., 2001]. Hughes et al. [1998,\n2001a, 2001b] and Collis [2001] have demonstrated a\nvariational multiscale method where better LES results are\nobtained if the solved equations are split into small- and\nlarge-scale representations and only the shear stresses\nextracted at the smaller and unresolved scales are modeled.\n[20] The above review demonstrates the range of devel-\nopments in LES from the original Smagorinsky model. It is\nacknowledged that the original Smagorinsky model has\nlimitations and considerable improvements have been made,\nespecially in terms of dynamic modeling procedures. This\npaper is the first that uses a LES approach to study flow\nover and around individual gravel particles to gain insight\ninto process representation at the river bed. Thus we begin\nwith an application of a standard Smagorinsky model within\nthe porosity algorithm framework to see if the approach\nproduces physically realistic results, and prior to the appli-\ncation of a more complex formulation.\n2.3. Experimental Design: Laboratory Data Collection\n[21] The experimental setup used for model development\nwas the same as used by Lane et al. [2004]. It is based upon\nwater worked gravels in a 0.30 m wide and 8.0 m long\ntilting flume. A bulk sample of sediment from the River\nAffric, Scotland was placed in the flume (D50 = 0.020 m;\nD84 = 0.069 m, max length scale 0.056 m) and water\nworked until a stable bed (no sediment transport) with a\nrealistic structure was obtained. Once the gravels had been\nwater worked, the surface morphology was measured using\ntwo media digital photogrammetry (see Butler et al. [2002]\nfor full explanation). The experimental setup allowed gen-\neration of DEMs at a spacing of 0.001 m. These DEMs have\nbeen subject to intensive data quality tests, in terms of point\nprecision and accuracy and surface precision and accuracy\n[e.g., Butler et al., 1998, 2001, 2002]. The topography\n(Figure 1) had a mean surface error of 0.0008 m and the\nstandard deviation of error was ±0.0017 m.\n4 of 14\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES W03422\n2.4. Application of Numerical Model\n[22] We used a 0.70 m long and 0.20 m wide section of\nriver bed gravels to define the bed geometry. The compu-\ntational domain was regular in the x (downstream), y (cross\nstream) and z (vertical) directions, with a grid resolution of\n0.002 m. In the vertical, to allow inclusion of topography\ndata using the porosity treatment, the maximum extent of\nthe domain was set at 0.06 m. Thus the computational grid\ncomprised 350 \u0003 110 \u0003 30 = 115 500 cells. With a depth\naverage inlet velocity of 0.24 m s\u00021 the flow has a Reynolds\nnumber of approximately 11 000 and a Froude number of\n0.31. This is a very shallow flow (d\/D50 \u0004 3, d\/D84 \u0004 1)\ncorresponding to a low discharge in the prototype river. A\nRANS simulation of flow over this surface has been\nvalidated for a flume experiment with a mean flow depth\nof 0.24 m against velocity profiles collected with a NorTek\nacoustic Doppler velocimeter (ADV) measuring at 0.010 m\nintervals above the bed at the planform locations [Lane et\nal., 2004]. We needed to reduce the flow depth to a\nmaximum 0.06 m for computational reasons in this study,\nwhich precluded validation of the scheme used. Further,\nLane et al. [2004] also show that the ADV measuring\nvolume is too coarse in relation to model resolution: it\ncommonly contains 5 \u0003 4 \u0003 4 grid cells which means that it\ndoes not resolve local flow gradients fully. Instead, we\nundertake a higher level validation (see below) by exploring\nhow model predictions compare with our general under-\nstanding of shallow flows over gravel beds obtained from\nflume and field studies.\n[23] In this study, we began by obtaining a steady state\nsolution using a RNG two-equation k-e turbulence model as\nthe initial condition for an unsteady simulation with the LES\nmodel. In this application the full non linear, filtered Navier\nStokes equations are solved. Here, a cutoff point is defined\nin the spectrum of turbulent scales based on the grid\ndimensions, in this case 0.002 m. Eddies capable of being\nresolved by the computational grid are allowed to evolve\naccording to the Navier-Stokes equations and a turbulence\nmodel [Smagorinsky, 1963] is only employed to represent\nthe effects of turbulence at subgrid scales (SGS). The\nNavier-Stokes equations are averaged over the cell volume\n[Schumann, 1975] and, as with Reynolds averaging, pro-\nduce unknown stresses related to SGS motion. These\nstresses (tij) are given by\ntij ¼ \u00022rntSij ð1Þ\nwhere r is the fluid density, nt is the eddy viscosity and Sij is\nthe local mean strain rate:\nSij ¼ 0:5 @ui\n@xj\nþ @uj\n@xi\n\u0001 \u0002\nð2Þ\nwhere ui is the component of velocity in the direction xi.\nThe eddy viscosity is determined using a mixing length\nrelationship:\nnt ¼ l2 2Sij @ui\n@xj\n\u0001 \u00021\n2\nð3Þ\nThe mixing length, l, is the characteristic length of\nunresolved eddies, defined as\nl ¼ min Csh;k:dwallð Þ ð4Þ\nwhere Cs is the Smagorinsky constant, k is the von Karman\nconstant (taken as 0.4), dwall is the normal distance to the\nnearest wall, and h is the representative mesh interval:\nh ¼\nffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffi\ndx2 þ dy2 þ dz2\n3\nr\nð5Þ\nFigure 1. Digital elevation model of the flume bed used in this study. The scale represents the\ntopographic height in the DEM.\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES\n5 of 14\nW03422\nwhich simplifies to\nh ¼\nffiffiffiffiffiffiffi\ndx2\np\nas dx2 \n dy2 \n dz2 ð6Þ\nwhere dx, dy, dz are the local mesh dimensions in the three\ncoordinate directions. This eddy viscosity model is isotropic\nand implicitly assumes the SGS turbulence is in equilibrium\nwith the large eddies at the scale at which it is applied and\nadjusts itself instantaneously to changes of the large-scale\nvelocity gradients.\n2.5. Boundary Conditions\n[24] Boundary conditions needed to be specified at the\nupstream inlet, downstream outlet, sidewalls and free sur-\nface. For the steady state solution the upstream inlet is\ncalculated from the experimentally acquired ADV data and\nthe downstream outlet is specified as a fully developed flow\nprofile with the hydrostatic pressure set at the surface at the\ndownstream outlet. For the LES simulation cyclic boundary\nconditions were applied, implying that the domain is infi-\nnitely long. At the sidewall, no-slip conditions were applied.\nAt the free surface, we use a method applied by Bradbrook\net al. [2000]. This uses a symmetry plane at the surface\nacross which all normal resolutes are set to zero. To\nrepresent the effects of water surface variation, nonzero\npressure terms on the symmetry plane are introduced to the\nmomentum equations, commonly referred to as a rigid lid\ntreatment. This allows for the effects of both water surface\nsuperelevation and depression with respect to the plane in\nterms of the momentum equations. However, if the mass\nconservation equations are not corrected, it will lead to\nunder estimation of velocities in zones of water surface\ndepression and over estimation of velocities in zones of\nwater surface superelevation. To deal with this, we intro-\nduce an effective surface cell thickness (DZsij) into the\ncontinuity equation, which scales the equivalent cell face\narea in the cross-stream and downstream directions accord-\ning to the pressure (Psij) on the symmetry plane at cell (i, j)\nDZsij ¼ Psij \u0002 rghcijrghcij\n\u0001 \u0002\nþDZij ð7Þ\nwhere hcij is the elevation of the surface grid cell at location\n(i, j). Bradbrook et al. [2000] show that this yields a stable\napproximation of free surface elevation provided spatial\ngradients of water surface are not too great, and normally\nnot greater than DZij. This is evaluated with each\napplication of the model.\n[25] A finite volume method is used to discretize the\nequations, and in this case a Cartesian mesh is applied. The\ninterpolation scheme used is hybrid upwind where upwind\ndifferences are used in high convection areas (Peclet\nnumber > 2) and central differences where diffusion dom-\ninates (Peclet number < 2). Use of the Peclet number\nguarantees that in situations where diffusion dominates, a\nhigher-order solution is used which reduces the tendency for\nnumerical diffusion. This method is also stable and as the\naim is to investigate periodic aspects of the flow, this\napproach is important in order to avoid the introduction of\nspurious oscillations in the solution which can occur\nwith some higher-order numerical schemes. Coupling of\nthe pressure and momentum equations is achieved using\nSIMPLEST, a variation on the SIMPLE algorithm of\nPantankar and Spalding [1972].\n3. Results\n[26] We interpret model output in four stages. Initially,\nvisual analyses of the numerical results are presented. This\nis followed by analyzing the results in terms of correlation\nin the downstream (u0) and vertical (w0) velocity deviations\nin order to match classical approaches to interpreting field\nand flume data. Next, the results are analyzed in terms of\nquadrant analysis. Quadrant analysis has previously been\nused to discriminate boundary layer turbulent events by\nexamining the instantaneous deviations of velocity from the\nmean values [e.g., Lu and Willmarth, 1973; Bogard and\nTiederman, 1986; Bennett and Best, 1995]. For this reason,\nit is the focus of the analysis in this paper. Applying the\nstandard definition of Lu and Willmarth [1973], four quad-\nrants can be defined around a zero mean: (1) quadrant 1\ndescribes outward interactions (positive u component, posi-\ntive w component), (2) quadrant 2 describes ejections (neg-\native u component, positive w component), (3) quadrant 3\ndescribes inward interactions (negative u component, neg-\native w component, and (4) quadrant 4 describing inrush\nevents (positive u component, negative w component. In a\nturbulent boundary layer, quadrant two (ejection) and quad-\nrant four (sweep) events are dominant. Finally the energy\nspectra for the downstream velocity component are calcu-\nlated at 0.2 and 0.8 z\/h for two profiles located at 0.21 and\n0.61 x\/l. The limitation of the Smagorinsky SGS model is\nthat it is too dissipative [Mason and Thomson, 1992]. The\ndissipation characteristics of the model have a direct impact\non the turbulent kinetic energy of the resolved velocity field,\nwhich in turn affects the shape of the mean velocity profile\n[Porte´-Agel et al., 2000]. In order to assess the model’s\nperformance the energy spectra are calculated to assess the\ndecay at high wave numbers.\n3.1. Flow Visualization\n[27] Figure 2 shows a series of velocity magnitude (the\nresolved components of u, v, and w) plots in plan view\n(x y slices), 0.036 m from the bed. Each image is spaced 1\nsecond apart. The images show a strongly streaky pattern,\nwith areas of fast flow around large particles (A in Figure 2a)\nand wakes in the lee of such particles (e.g., B in Figure 2a).\nIn region A (Figure 2a) a region of high flow velocity\narising from flow separation around a large protruding\nparticle can be observed. This appears to be quasi stationary,\nits core being present in all of the images covering the 10 s\nperiod. The structure of this feature has similar character-\nistics to the horseshoe vortex observed in classic fluid\nmechanics. In region B there is a relatively stable region\ncomprising a low-momentum recirculation cell (i.e., a wake)\nwith possibly an arch vortex similar to that identified by\nHunt et al. [1978]. Typically these features would have been\npredicted by the application of a RANS turbulence closure\nmodel [e.g., Lane et al., 2004], although time averaged\nturbulence models (e.g., the two equation k-e model) are\npoor at predicting separation lengths [Hardy et al., 2005].\nHowever, region C marked on Figure 2b comprises a region\nof flapping, downstream from the object. This region is\ndownstream of the high topography (Figure 3) and in a zone\nof deeper flow. Here time-dependent flow structures evolve\n6 of 14\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES W03422\nand complex flapping of structures can be easily observed.\nThis is considered further in terms of time series analysis\nbelow.\n[28] Figure 3 shows a series of w (vertical) component\nvelocity plots for the centre line. In Figures 3a–3d, upward\nflow can be observed as the flow interacts with the first\nlarge clast (x\/l = 0.27) and shows similarities to classical\njunction vortex flow. Downstream from this object, the flow\nis periodic. For example, in the deepening section of the\nflow (x\/l = 0.8) oscillation between upward and downward\nflow can be observed. This oscillation extends throughout\nthe flow depth and, as such, appears to be very similar to the\nfluid wedges which have previously been observed in\ngravel bed rivers. In qualitative terms, these results are\nencouraging.\n3.2. Time Series of Fluctuating Velocities\n[29] Figure 4 shows example time series of the vertical\ncomponent for a 5 s period for a zone of flow shallowing\n(i.e., the stoss of a particle, Figures 4a and 4b) and a zone of\nflow deepening (i.e., as in the lee of a particle, Figures 4c\nand 4d). These plots show clear quasiperiodicity in the\nFigure 2. Plan view of the velocity magnitude at a horizontal slice 0.036 cm above the bed through\ntime. The white regions are zones of pebbles blocked out of the numerical domain by the porosity\nalgorithm. Figure 2a is 100 s into the simulation.\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES\n7 of 14\nW03422\nturbulence signal. From x\/l = 0.21 to x\/l = 0.27, the flow\nshallows, and the result is a reduction in the magnitude of\nvertical velocity fluctuations at all heights within the flow,\ncoupled to slight stretching of the wavelengths. At x\/l = 0.21\n(Figure 4a), flow which is closer to the surface (z\/h = 0.8)\nleads flows at the bed. By x\/l = 0.27, this lead is diminished,\nand the fluctuations are more synchronous as well as being\nof smaller magnitude. This probably reflects the growing\ninfluence of the bed as the flow shallows, with resistance\nhaving a greater effect closer to the bed, and fluctuations in\nvelocity from upstream traveling more slowly at the bed. As\nthe bed shallows, the effects of resistance are more strongly\nfelt throughout the flow, and the fluctuations are more\nsynchronous, and reduced in magnitude. As the flow deep-\nens (Figures 4c and 4d), the fluctuations are more variable\nin terms of magnitude and timescale and, as a result, appear\nto be less organized.\n[30] The level of organization is greater as the flow starts\nto deepen (x\/l = 0.50, Figure 4c) than when it becomes\ndeeper (x\/l = 0.61, Figure 4d), with flow at the bed weakly\nleading flow at the surface. As the flow enters the deeper\nzone, the reverse of flow shallowing occurs, with the\nmagnitude of fluctuations increasing and their time (and\nlength scales) decreasing. However, these changes are\nconsiderably less coherent than in the flow shallowing zone.\nThis is associated with large-scale separation downstream\nfrom the region of very shallow flow (i.e., high bed\nelevations) such that flow recirculation effects (including\neddy shedding) are superimposed upon the effects of bed\nresistance on flow structures. At elevations z\/h = 0.4 and\nz\/h = 0.6, the increase in magnitude of fluctuations is\ngreater and the compression is greater. This is probably\nthe zone of maximum influence from the eddy shedding\nprocess. The eddy shedding results in highly irregular,\nvariable magnitude and quite complex flow. In time-aver-\naged measurements or models, this would correspond to the\nzone of maximum turbulent stresses where the main flow\nconnects with the separation zone.\n[31] Figure 5 plots the correlation between downstream\n(u0) and vertical (w0) velocity deviations against distance for\nthe complete time series down the centre line of the model\nsimulations for four elevations above the bed. This has a\nnotable pattern: up to x\/l = 0.21, the strength of correlation\nincreases with elevation above the bed. At x\/l = 0.27, the\ncorrelations have similar values, in the range \u00020.28 to\n\u00020.36. Between x\/l = 0.27 and x\/l = 0.61, the patterns are\nreversed, with very strong negative correlations near the\nbed, and much weaker correlations higher in the flow. This\npattern reverses once more at x\/l = 0.61, with the exception\nof the results at x\/l = 0.70.\n3.3. Quadrant Analysis\n[32] Figure 6 shows how these correlations are linked to\nchanges in the percentage of time found in each quadrant.\nAs expected in a turbulent boundary layer, quadrant two\n(ejection) and quadrant four (sweep) events are dominant.\nClose to the bed (z\/h = 0.2, Figure 6a) and until x\/l = 0.27,\nthe distribution of events is relatively similar, with quadrant\ntwo (ejection) and four (sweep) events weakly dominant.\nFrom x\/l = 0.21, the percentage of quadrant two (ejection)\nand four (sweep) events increases, with them becoming\nstrongly dominant from x\/l = 0.46, initially in quadrant 2\n(ejection), and later in quadrant 4 (sweeps). As with the time\nseries, there is a switch back at x\/l = 0.61, with the exception\nof data at x\/l = 0.70. This is mirrored, but to a lesser degree,\nat z\/h = 0.4 (Figure 6b). Higher in the flow (at z\/h = 0.6 and\nz\/h = 0.8, Figures 6c and 6d) the percentage of events in\neach quadrant is, in relative terms, more constant, with\nquadrant two (ejection) and four (sweep) events weakly\ndominant throughout. Thus the correlation patterns shown\nin Figure 5 are related to a near-bed strengthening in the\ncontribution of sweeps and ejections in shallowing flows: as\nFigure 3. Vertical slice of the vertical velocity component down the midline. The white regions are\nzones of pebbles blocked out of the numerical domain by the porosity algorithm. Figure 3a is 200 s into\nthe simulation.\n8 of 14\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES W03422\nthe flow shallows, ejection events become dominant at the\nbed. Once the shallowest parts of the flow are reached, there\nis a transition from ejection events to sweep events becom-\ning dominant. As the flow deepens the dominance of\nejections and sweeps is reduced, except for localized points\nwhere individual clasts are found, and where ejections and\nsweeps are more dominant at the bed.\n3.4. Spectral Analysis\n[33] Finally we consider energy spectra. It has been\nshown that the traditional Smagorinsky model is too dissi-\npative [Mason and Thomson, 1992]. In LES, the dissipation\ncharacteristics of the model have a direct impact on the\nturbulent kinetic energy of the resolved field, which in turn\naffects the shape of the mean velocity profile. There is\nevidence that the streamwise velocity spectra will follow a\nKolmogorov k\u00025\/3 dependence [Soulsby, 1981] and devia-\ntion from this criterion may be used to identify the scale at\nwhich the scheme becomes too dissipative.\n[34] The two profiles which have been identified are\nlocated at 0.21 and 0.6 x\/l for the vertical heights of\n0.2 and 0.8 z\/h. The power spectral density graphs are\nshown in Figure 7. The spectral signals show classical\ncharacteristics with higher power at lower frequencies.\nFigure 4. Time series of instantaneous vertical velocities (w0) for x\/l = (a) 0.21, (b) 0.27, (c) 0.50, and\n(d) 0.61. Pluses represent the flow at z\/h = 0.2, circles represent flow at z\/h = 0.4, diamonds represent\nflow at z\/h = 0.6, and no marker indicates flow at z\/h = 0.8.\nFigure 5. Correlations of the vertical and downstream\ninstantaneous flow velocities for the whole time series.\nPluses represent flow at z\/h = 0.2, circles represent flow at\nz\/h = 0.4, diamonds represent flow at z\/h = 0.6, and stars\nrepresent flow at z\/h = 0.8.\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES\n9 of 14\nW03422\nMoreover, all four profiles are similar. In assessing the\nperformance of the Smagorinsky scheme it is clear\n(Figures 7a–7d) that the spectra decays significantly faster\nthan the \u00025\/3 gradient for frequencies greater than 2 Hz.\nThis implies that the model dissipates kinetic energy at an\nexcessive rate at these higher frequencies [Porte´-Agel et al.,\n2000]. The excessive dissipation of turbulent kinetic energy\nis greater in the shallowing zone, as would be expected, due\nto the shear flow as it moves over a protrusion. The standard\nSmaogorinsky scheme is under performing at these higher\nfrequencies, as has been demonstrated in different environ-\nmental applications and requires improving to a scale-\ndependent dynamic model [Porte´-Agel et al., 2000]. This\nexplains the relatively smooth nature of the time series in\nFigure 4 as compared with much nosier time series com-\nmonly measured in the field and laboratory studies [e.g.,\nClifford and French, 1993; Ferguson et al., 1996; Nikora\nand Smart, 1997; Roy et al., 1996; Buffin-Be´langer et al.,\n2000]. However, the macroscale (<1 Hz) variability\ndescribed within this study is likely to be relatively unaf-\nfected by this process showing that the longer timescale\nfluctuations probably do have meaning.\n4. Discussion\n[35] This paper has presented a methodology which\nenables the inclusion of complex topography within a\nCartesian framework, which in turn has allowed the appli-\ncation of large-eddy simulation over a gravel surface. The\napplication of LES has allowed time-dependent flow struc-\ntures to be calculated interacting with a range of topographic\nscales from individual particles to micro topographic forms\nin the bed surface. Classical fluvial hydraulic structures such\nas arch vortices [Hunt et al., 1978], in addition to regions of\nmomentum exchange in the downstream wake of protruding\nclasts, have been detected and visualized which are similar\nto structures that have been previously measured in the field\n[cf. Robert et al., 1993; Kirkbride, 1993; Buffin-Be´langer\nand Roy, 1998]. These features have previously been\nspeculated from field-based measurements to exist in gravel\nbed rivers, although the hypotheses have come from several\nat-a-point measurements rather than studying the whole\nflow field as a continuum. This methodology has provided\na technique for both the quantification and visualization of\nthe complex flow structures formed by the interaction\nbetween form and flow.\n[36] The numerical simulations reported in this paper\nhave shown the importance of the localized topographic\ngradient on the generation of flow structures. There appears\nto be a difference in processes operating, and therefore the\nshape of the flow structures, between regions of flow\nshallowing and deepening. As the flow shallows, the effects\nof individual clasts are more strongly felt throughout the\nflow, where turbulent fluctuations are more synchronous\nFigure 6. Cumulative percentage of events found in each quadrant downstream. (a). Quadrant events at\n0.2 z\/h. (b) Quadrant events at 0.4 z\/h. (c) Quadrant events at 0.6 z\/h. (d) Quadrant events at 0.8 z\/h.\n10 of 14\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES W03422\nand reduced in magnitude. In addition, as the flow shallows,\nejection events become dominant at the bed. These struc-\ntures then evolve until they become nearly the equal to the\nflow depth, showing a similarity to those observed by Yalin\n[1992]. Once the shallowest part of the flow is reached,\nthere is a transition from ejection events to sweep events\nbecoming dominant. Finally, in shallowing zones structures\nare coherent as there is limited spatial scale (mainly vertical)\nfor processes such as large-scale separation or flow recir-\nculation (including eddy shedding) to occur and the effect of\nindividual clasts upon flow structures is dominant, generat-\ning flow structures similar to those observed previously [cf.\nKomori et al., 1982; Grinvald and Nikora, 1988; Clifford et\nal., 1992; Lapointe, 1992, Nezu and Nakagawa, 1993;\nRobert et al., 1993; Roy et al., 1996; Cellino and Graf,\n1999; Shen and Lemmin, 1999].\n[37] As the flow deepens the fluctuations are more variable\nin terms of magnitude and timescale and, as a result, appear\nto be less organized. This agrees with others who do not\ndetect any regular period in turbulent fluctuations [e.g.,\nGrinvald, 1974; Nikora and Smart, 1997] suggesting coher-\nent structures are randomly distributed in time and space\n[Nychas et al., 1973; Smith, 1996;Nikora and Goring, 1999].\nMoreover, as the flow deepens the dominance of ejections\nand sweeps is reduced, except for localized points where\nindividual clasts are found. As the flow enters a deeper zone,\nthere is a reverse of the processes observed in regions of flow\nshallowing, with the magnitude of turbulent fluctuations\nincreasing and their time (and length scales) decreasing.\n[38] In summary, there are two distinct scales of boundary\ninfluence upon the shallow flow studied here. The first,\nlarger, scale is associated with clusters of particles which\ncreate undulations in the bed surface. This leads to water\ndepth variation which in turn results in changes in the time\nand length scales and magnitudes of the associated turbu-\nlence. The second scale relates to especially large or isolated\nclasts which result in similar processes, but over a smaller\nlength scale. This emphasizes that the measured flow\nvariability at any one point in a natural river will contain\nboth locally derived flow structures and structures inherited\nfrom upstream, according to the range of scales of topog-\nraphy present.\n[39] The LES results give high spatial resolution in three\ndimensions, in a way that is currently difficult to match by\nlaboratory measurements and impossible to match in the\nfield using currently available technology. The methodology\nFigure 7. Streamwise velocity spectra for a shallowing region (0.21 x\/l) and deepening zone (0.61 x\/l).\nThe slope of \u00025\/3 is shown. (a) Streamwise velocity spectra at 0.21 x\/l at height 0.8 z\/h. (b) Streamwise\nvelocity spectra at 0.21 x\/l at height 0.2 z\/h. (c) Streamwise velocity spectra at 0.61 x\/l at height 0.8 z\/h.\n(d) Streamwise velocity spectra at 0.61 x\/l at height 0.2 z\/h.\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES\n11 of 14\nW03422\nis therefore seen as having considerable potential for eluci-\ndating flow structures in shallow streams and opens up\nexciting possibilities for exploring this effect and using it to\ndevelop new methods for parameterizing shear stress in\nsediment transport models. Ongoing research into this\nproblem is addressing the SGS model where the introduc-\ntion of a scale-dependent dynamic subgrid-scale model\n[e.g., Porte´-Agel et al., 2000] is being considered. This\napproach is both stable and robust and shows improved\ndissipative properties leading to more realistic spectra and\nmean velocity profiles being calculated [Porte´-Agel et al.,\n2000]. This approach seems to be able to resolve eddy\nstructure more accurately, which will be advantageous to\nthose studies that consider the detailed interaction between\nturbulent flows and sediment transport.\n[40] Acknowledgments. R.J.H. was funded by NERC grant GR3\/\n9715 (awarded to S.N.L. and R.I.F.) and NERC fellowship NER\/J\/S\/2002\/\n00663. We are grateful to the Associate Editor Fernando Porte´-Agel and\nthree anonymous referees for providing helpful comments that have led to\nsignificant improvements in this manuscript.\nReferences\nBardina, J., J. H. Ferziger, and W. C. Reynolds (1980), Improved subgrid\nmodels for large eddy simulation, AIAA J., 80, 1357.\nBedford, K., and C. Babajimopoulos (1980) Verifying lake models with\nspectral statistics, J. Hydraul. Div. Am. Soc. Civ. Eng., 106, 21–38.\nBennett, S. J., and J. L. Best (1995), Mean flow and turbulence structure\nover fixed, two-dimensional dunes: implications for sediment transport\nand dune stability, Sedimentology, 42, 491–513.\nBest, J. L. (1993), On the interactions between turbulent flow, sediment\ntransport and bedform development: Some considerations from recent\nexperiment research, in Turbulence: Perspectives on Flow and Sediment\nTransport, edited by N. J. Clifford, J. R. French, and J. Hardisty, pp. 61–92,\nJohn Wiley, Hoboken, N. J.\nBogard, D. G., and W. G. Tiederman (1986), Burst detection with single-\npoint velocity measurement, J. Fluid Mech., 162, 113–135.\nBooker, D. J., D. A. Sear, and A. J. Payne (2001), Modelling three-\ndimensional flow structures and patterns of boundary shear stress in a\nnatural pool-riffle sequence, Earth Surf. Processes Landforms, 26, 553–576.\nBradbrook, K. F., S. N. Lane, K. S. Richards, P. M. Biron, and A. G. Roy\n(2000), Large-eddy simulation of periodic flow characteristics at river\nchannel confluences, J. Hydraul. Res., 38, 207–215.\nBray, D. I. (1982), Flow resistance in gravel-bed rivers, in Gravel-Bed\nRivers, edited by R. D. Hey, J. C. Bathurst, and C. R. Thorne,\npp. 109–133, John Wiley, Hoboken, N. J.\nBuffin-Be´langer, T., and A. G. Roy (1998), Effects of a pebble cluster on\nthe turbulent structure of a depth-limited flow in a gravel-bed river,\nGeomorphology, 25, 249–267.\nBuffin-Be´langer, T., A. G. Roy, and A. D. Kirkbride (2000), On large scale\nflow structures in a gravel bed river, Geomorphology, 32, 417–435.\nButler, J. B., S. N. Lane, and J. H. Chandler (1998), Assessment of DEM\nquality for characterising surface roughness using close range digital\nphotogrammetry, Photogramm. Rec., 16, 271–291.\nButler, J. B., S. N. Lane, and J. H. Chandler (2001), Application of two-\ndimensional fractal analysis to the characterisation of gravel-bed river\nsurface structure, Math. Geol., 33, 301–330.\nButler, J. B., S. N. Lane, J. H. Chandler, and K. Porfiri (2002), Through-\nwater close-range digital photogrammetry in flume and field environ-\nments, Photogramm. Rec., 17, 419–439.\nCai, X.-M., and D. G. Steyn (1996), The von Karman constant determined\nby large eddy simulation, Boundary Layer Meteorol., 78, 143–164.\nCanuto, V. M., and Y. Cheng (1997), Determination of the Smagorinsky–\nLilly constant Cs, Phys. Fluids, 9, 1368–1378.\nCarati, D., S. Ghosal, and P. Moin (1995), On the representation of back-\nscatter in dynamic localization models, Phys. Fluids, 7, 606–616.\nCellino, M., and W. H. Graf (1999), Sediment-laden flow in open-channels\nunder noncapacity and capacity conditions, J. Hydraul. Eng., 125, 455–\n462.\nChollet, J. P., and M. Lesieur (1981), Parameterization of small scales of\nthree-dimensional isotropic turbulence utilizing spectral closures,\nJ. Atmos. Sci., 38, 2747–2757.\nCiofalo, M., and M. W. Collins (1992), Large-eddy simulation of turbulent\nflow and heat transfer in plane and rib-roughened channels, Int. J. Numer.\nMethods Fluids, 15, 453–489.\nClark, R. A., J. H. Ferziger, and W. C. Reynolds (1979), Evaluation of\nsubgrid models using an accurately simulated turbulent flow, J. Fluid\nMech., 91, 1–16.\nClifford, N. J., and J. R. French (1993), Monitoring and analysis of turbu-\nlence in geophysical boundaries: Some analytical and conceptual issues,\nin Turbulence: Perspectives on Flow and Sediment Transport, edited by\nN. J. Clifford, J. R. French, and J. Hardisty, pp. 93–120, John Wiley,\nHoboken, N. J.\nClifford, N. J., A. Robert, and K. S. Richards (1992), Estimation of flow\nresistance in gravel-bedded rivers: A physical explanation of the multi-\nplier of roughness length, Earth Surf. Processes Landforms, 17, 111–\n126.\nCollis, S. S. (2001), Monitoring unresolved scales in multiscale turbulence\nmodeling, Phys. Fluids, 13, 1800–1806.\nCui, J., V. C. Patel, and C.-L. Lin (2003), Large-eddy simulation of turbu-\nlent flow in a channel with rib roughness, Int. J. Heat Fluid Flow, 24,\n372–388.\nDeardorff, J. W. (1970a), A numerical study of three-dimensional turbulent\nchannel flow at large Reynolds number, J. Fluid Mech., 41, 453–480.\nDeardorff, J. W. (1970b), A three-dimensional numerical investigation of\nthe idealized planetary boundary layer, Geophys. Fluid Dyn., 1, 377–\n410.\nDinehart, R. L. (1992), Evolution of coarse gravel bed forms: Field mea-\nsurements at flood stage, Water Resour. Res., 28, 2667–2689.\nDomaradzki, J. A., and K.-C. Loh (1999), The subgrid-scale estimation in\nthe physical space representation, Phys. Fluids, 11, 2330–2342.\nDomaradzki, J. A., and E. M. Saiki (1997), A subgrid-scale model based on\nthe estimation of unresolved scales of turbulence, Phys. Fluids, 9, 2148–\n2164.\nFalco, R. E. (1977), Coherent motions in the outer region of a turbulent\nboundary layers, Phys. Fluids, 20, 124–132.\nFerguson, R. I., A. D. Kirkbride, and A. G. Roy (1996), Scales of turbulent\ncoherent flow structures in gravel bedded river, in Coherent Flow Struc-\ntures in Open Channels, edited by P. J. Ashworth et al., pp. 165–184,\nJohn Wiley, Hoboken, N. J.\nFerguson, R. I., D. R. Parsons, S. N. Lane, and R. J. Hardy (2003), Flow in\nmeander bends with recirculation at the inner bank, Water Resour. Res.,\n39(11), 1322, doi:10.1029\/2003WR001965.\nFro¨hlich, J., and W. Rodi (2002), Introduction to large eddy simulation for\nturbulent flows, in Closure Strategies for Turbulent and Transitional\nFlows, edited by B. E. Launder and N. D. Sandham, pp. 267–298,\nCambridge Univ. Press, New York.\nGermano, M. (1992), Turbulence: The filtering approach, J. Fluid Mech.,\n238, 325–336.\nGermano, M., U. Piomelli, P. Moin, and W. H. Cabot (1991), A dynamic\nsubgrid-scale eddy viscosity model, Phys. Fluids A, 3, 1760–1765.\nGessler, D., B. Hall, M. Spasojevic, F. Holly, H. Pourtaheri, and N. Raphelt\n(1999), Application of 3D mobile bed, hydrodynamic model, J. Hydraul.\nEng., 125, 737–749.\nGeurts, B. J. (1997), Inverse modeling for large-eddy simulation, Phys.\nFluids, 9, 3585–3587.\nGhosal, S., T. S. Lund, P. Moin, and K. Akselvoll (1995), A dynamic\nlocalization model for large-eddy simulation of turbulent flows, J. Fluid\nMech., 286, 229–255.\nGrass, A. J. (1971), Structural features of turbulent flow over smooth and\nrough boundaries, J. Fluid Mech., 50, 233–255.\nGrass, A. J., and M. Mansour-Tehrani (1996), Generalized scaling of\ncoherent bursting structures in the near-wall region of turbulent flow\nover smooth and rough boundaries, in Coherent Flow Structures in\nOpen Channels, edited by P. J. Ashworth et al., pp. 41–62, John Wiley,\nHoboken, N. J.\nGrass, A. J., R. J. Stuart, and M. Mansour-Tehrani (1991), Vortical struc-\ntures and coherent motion in turbulent flow over smooth and rough\nboundaries, Philos. Tran. R. Soc., Ser. A, 336, 35–65.\nGrinvald, D. I. (1974), Turbulence of Open-Channel Flows (in Russian),\nGidrometeoizdat, St. Petersburg, Russia.\nGrinvald, D. I., and V. I. Nikora (1988), River Turbulence (in Russian),\nGidrometeoizdat, St. Petersburg, Russia.\nGrishanin, K. V. (1990), Fundamentals of the Dynamics of Alluvial Flows\n(in Russian), Transport, Moscow.\nGullbrand, J., and F. K. Chow (2003), The effect of numerical errors and\nturbulence models in large-eddy simulation of channel flow, with and\nwithout explicit filtering, J. Fluid Mech., 495, 323–341.\n12 of 14\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES W03422\nHardy, R. J., S. N. Lane, M. R. Lawless, J. L. Best, L. Elliott, and D. B\nIngham (2005), Development and testing of a numerical code for treat-\nment of complex river channel topography in three-dimensional CFD\nmodels with structured grids, J. Hydraul. Res., 43, 468–480.\nHa¨rtel, C. (1996), Turbulent flows: Direct numerical simulation and large-\neddy simulation, in Handbook of Computational Fluid Mechanics, edited\nby R. Peyret, pp. 283–338, Elsevier, New York.\nHa¨rtel, C., and L. Kleiser (1997), Galilean invariance and filtering depen-\ndence of near-wall grid-scale\/subgrid-scale interactions in large-eddy\nsimulation, Phys. Fluids A, 9, 473–475.\nHa¨rtel, C., and L. Kleiser (1998), Analysis and modelling of subgridscale\nmotions in near-wall turbulence, J. Fluid Mech., 356, 327–352.\nHead, M. R., and P. Bandyopadhyay (1981), New aspects of turbulent\nboundary layer structure, J. Fluid Mech., 107, 297–338.\nHey, R. D. (1979), Flow resistance in gravel-bed rivers, J. Hydraul. Div.\nAm. Soc. Civ. Eng., 105, 365–379.\nHodskinson, A., and R. I. Ferguson (1998), Numerical modelling of sepa-\nrated flow in river bends: Model testing and experimental investigation\nof geometric controls on the extent of flow separation at the concave\nbank, Hydrol. Processes, 12, 1323–1338.\nHughes, T. J. R., G. R. Feijoo, L. Mazzei, and J. B. Quincy (1998),\nThe variational multiscale method—A paradigm for computational\nmechanics, Comput. Methods Appl. Mech., 166, 3–4.\nHughes, T. J. R., L. Mazzei, A. A. Oberai, and A. A. Wray (2001a), The\nmultiscale formulation of large eddy simulation: Decay of homogeneous\nisotropic turbulence, Phys. Fluids, 13, 505–512.\nHughes, T. J. R., A. A. Oberai, and L. Mazzei (2001b), Large eddy simula-\ntions of turbulent channel flow by the variational multiscale method,\nPhys. Fluids, 13, 1784–1799.\nHunt, J. C. R., C. J. Abell, J. A. Peterka, and H. Woo (1978), Kinematic\nstudies of the flow around free or surface mounted obstacles: Applying\ntopology to flow visualization, J. Fluid Mech., 86, 179–200.\nImamoto, H., and T. Ishigaki (1986a), The three dimensional structure of\nturbulent shear flow in an open channel, paper presented at Fifth Congress\nof the Asian and Pacific Regional Division of the International Associa-\ntion for Hydraulic Research, Seoul.\nImamoto, H., and T. Ishigaki (1986b), Visualization of longitudinal\neddies in an open channel flow, in Flow Visualization IV: Proceedings\nof the Fourth International Symposium on Flow Visualization, edited\nby C. Veret, pp. 333–337, Taylor and Francis, Philadelphia, Pa.\nKeylock, C. J., R. J. Hardy, D. R. Parsons, R. I. Ferguson, S. N. Lane, and\nK. S. Richards (2005), The theoretical foundations and potential for\nlarge-eddy simulation (LES) in fluvial geomorphic and sedimentological\nresearch, Earth Sci. Rev., 71, 271–304.\nKirkbride, A. D. (1993), Observations of the influence of bed roughness on\nturbulence structure in depth-limited flows over gravel beds, in Turbu-\nlence: Perspectives on Flow and Sediment Transport, edited by N. J.\nClifford, J. R. French, and J. Hardisty, pp. 185–196, John Wiley,\nHoboken, N. J.\nKirkbride, A. D., and R. I. Ferguson (1995), Turbulent flow structures in a\ngravel-bed river: Markov chain analysis of the fluctuating velocity pro-\nfile, Earth Surf. Processes Landforms, 20, 721–733.\nKlaven, A. B. (1966), Investigation of the flow turbulent structure (in\nRussian), Trans. State Hydrol. Inst., 136, 65–76.\nKlaven, A. B., and Z. D. Kopaliani (1973), Laboratory investigations of the\nkinematic structure of turbulent flow over a rough bed (in Russian),\nTrans. State Hydrol. Inst., 209, 67–90.\nKomori, S., H. Ueda, F. Ogino, and T. Mizushina (1982), Turbulence\nstructure and transport mechanism at the free surface in an open channel\nflow, Int. J. Heat Mass Transfer, 25, 513–521.\nKrogstad, P. A˚., R. A. Antonia, and W. B. Browne (1992), Comparison\nbetween rough and smooth-wall turbulent boundary layers, J. Fluid\nMech., 245, 599–617.\nLane, S. N., R. J. Hardy, L. Elliott, and D. B. Ingham (2002), High resolu-\ntion numerical modelling of three-dimensional flows over complex river\nbed topography, Hydrol. Processes, 16, 2261–2272.\nLane, S. N., R. J. Hardy, L. Elliott, and D. B. Ingham (2004), Numerical\nmodelling of flow processes over gravelly surfaces using structured grids\nand a numerical porosity treatment, Water Resour. Res., 40, W01302,\ndoi:10.1029\/2002WR001934.\nLapointe, M. (1992), Burst-like sediment suspension events in a sand bed\nriver, Earth Surf. Processes Landforms, 17, 253–270.\nLee, C. (2002), Large-eddy simulation of rough wall turbulent boundary\nlayers, AIAA J., 40, 2127–2130.\nLeonard, A. (1974), Energy cascade in large-eddy simulations of turbulent\nfluid flows, Adv. Geophys., Ser. A, 18, 237–248.\nLesieur, M., and O. Me´tais (1996), New trends in large-eddy simulations of\nturbulence, Annu. Rev. Fluid Mech., 28, 45–82.\nLesieur, M., P. Comte, E. Lamballais, O. Me´tais, and G. Silvestrini\n(1997), Large-eddy simulations of shear flows, J. Eng. Math., 32,\n195–215.\nLesieur, M., P. Comte, Y. Dubief, E. Lamballais, O. Me´tais, and S. Ossia\n(1999), From two-point closures of isotropic turbulence to LES of shear\nflows, Flow Turbul. Combust., 63, 247–267.\nLilly, D. K. (1992), A proposed modification of the Germano subgrid-scale\nclosure method, Phys. Fluids A, 4, 633–635.\nLu, S. S., and W. W. Willmart (1973), Measurements of structure of\nReynolds stress in a turbulent boundary layer, J. Fluid Mech., 60,\n481–511.\nMason, P. J., and D. Thomson (1992), Stochastic backscatter in large eddy\nsimulations of boundary layers, J. Fluid Mech., 242, 51–78.\nMeneveau, C., and J. Katz (1999), Dynamic testing of subgrid models in\nlarge eddy simulation based on the Germano identity, Phys. Fluids, 11,\n245–247.\nMeneveau, C., and J. Katz (2000), Scale-invariance and turbulence models\nfor large-eddy simulation, Annu. Rev. Fluid Mech., 32, 1–32.\nMeneveau, C., T. S. Lund, and W. H. Cabot (1996), A Lagrangian dynamic\nsubgrid-scale model of turbulence, J. Fluid Mech., 319, 353–385.\nMoin, P. (2002), Advances in large eddy simulation methodology for com-\nplex flows, Int. J. Heat Fluid Flow, 23, 710–720.\nMoin, P., and J. Kim (1982), Numerical investigation of turbulent channel\nflow, J. Fluid Mech., 118, 341–377.\nMoin, P., K. Squires, W. Cabot, and S. Lee (1991), A dynamic subgridscale\nmodel for compressible turbulence and scalar transport, Phys. Fluids A,\n3, 1766–1771.\nNezu, I., and H. Nakagawa (1993), Turbulence in Open Channel Flows,\nA. A. Balkema, Brookfield, Vt.\nNicholas, A. P. (2001), Computational fluid-dynamics modelling of bound-\nary roughness in gravel-bed rivers: An investigation of the effects of\nrandom variability in bed elevation, Earth Surf. Processes Landforms,\n26, 345–362.\nNicholas, A. P., and G. H. S. Smith (1999), Numerical simulation of three-\ndimensional flow hydraulics in a braided channel, Hydrol. Processes, 13,\n913–929.\nNikora, V. I., and G. Goring (1999), On the relationship between Kolmogorov’s\nand generalized structure functions in the inertial subrange of developed\nturbulence, J. Phys. A Math. Gen., 32, 4963–4969.\nNikora, V. I., and G. M. Smart (1997), Turbulence characteristics of New\nZealand gravel-bed rivers, J. Hydraul. Eng., 123, 764–773.\nNychas, S. G., H. C. Hershey, and R. S. Brodkey (1973), A visual study of\nturbulent shear flow, J. Fluid Mech., 61, 513–540.\nOlsen, N. R. B., and S. Stokseth (1995), Three-dimensional numerical\nmodelling of water flow in a river with large bed roughness, J. Hydraul.\nRes., 33, 571–581.\nPatankar, S. V., and D. B. Spalding (1972), A calculation procedure for\nheat, mass and momentum transport in three-dimensional parabolic\nflows, Int. J. Heat Mass Transfer, 15, 1787–1806.\nPatel, V. C. (1998), Perspective: Flow at high Reynolds number and over\nrough surfaces—Achilles heel of CFD, J. Fluids Eng., 120, 434–444.\nPiomelli, U., and E. Balaras (2000), Wall-layer models for large-eddy\nsimulations, Annu. Rev. Fluid Mech., 34, 349–374.\nPiomelli, U., and J. Liu (1995), Large-eddy simulation of rotating channel\nflows using a localized dynamic model, Phys. Fluids, 7, 839–848.\nPiomelli, U., T. A. Zang, C. G. Speziale, and M. Y. Hussaini (1990), On the\nlarge-eddy simulation of transitional wall bounded flows, Phys. Fluids A,\n2, 257–265.\nPorte´-Agel, F., C. Menevveau, and M. B. Parlange (2000), A scale-\ndependent dynamic model for large-eddy simulation: Application to a\nneutral atmospheric boundary layer, J. Fluid Mech., 415, 261–284.\nRobert, A., A. G. Roy, and B. De Serres (1993), Space-time correlations\nof velocity measurements at a roughness transition in a gravel-bed\nriver, in Turbulence: Perspectives on Flow and Sediment Transport,\nedited by N. J. Clifford, J. R. French, and J. Hardisty, pp. 165–184,\nJohn Wiley, Hoboken, N. J.\nRodi, W., J. H. Ferziger, M. Breuer, and M. Pourquie (1997), Status of\nlarge eddy simulation: Results of a workshop, J. Fluids Eng., 119, 248–\n262.\nRogallo, R. S., and P. Moin (1984), Numerical simulation of turbulent\nflows, Annu. Rev. Fluid Mech., 16, 99–137.\nRoy, A. G., and T. Buffin-Belanger (2000), Advances in the study of\nturbulent flow structures in gravel-bed rivers, in Gravel-Bed Rivers V,\nedited by M. P. Mosley, pp. 375–404, N. Z. Hydrol. Soc., Wellington.\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES\n13 of 14\nW03422\nRoy, A. G., T. Buffin-Belanger, and S. Deland (1996), Scales of turbulent\ncoherent structures in a gravel-bed river, in Coherent Flow Structures in\nOpen Channels, edited by P. J. Ashworth et al., pp. 147–156, John\nWiley, Hoboken, N. J.\nRoy, A. G., T. Buffin-Belanger, H. Lamarre, and A. D. Kirkbride (2004),\nSize, shape and dynamics of large-scale turbulent flow structures in a\ngravel-bed river, J. Fluid Mech., 500, 1–27.\nSagaut, P. (1998), Large Eddy Simulation for Incompressible Flows,\nSpringer, New York.\nSchumann, U. (1975), Subgrid scale model for finite difference simulations\nof turbulent flows in plane channels and annuli, J. Comput. Phys., 18,\n376–404.\nSchumann, U. (1991), Direct and large eddy simulation of turbulence—\nSummary of the state-of-the-art 1991, in Introduction to the Modeling of\nTurbulence, Von Karman Inst., Rhode Saint Gene`se, Brussels.\nSechet, P., and B. Le Guennec (1999), Bursting phenomenon and incipient\nmotion of solid particles in bed-load transport, J. Hydraul. Res., 37,\n683–696.\nShen, C., and U. Lemmin (1999), Application of an acoustic particle flux\nprofiler in particle-laden open-channel flow, J. Hydraul. Res., 37, 407–\n419.\nShvidchenko, A., and G. Pender (2001), Macroturbulent structure of\nopen-channel flow over gravely beds, Water Resour. Res., 37, 709–\n719.\nSilveira Neto, A., D. Grand, O. Me´tais, and M. Lesieur (1991), Large eddy\nsimulation of the turbulent flow in the downstream region of a backward-\nfacing step, Phys. Rev. Lett., 66, 2320–2323.\nSinha, S. K., F. Sotiropoulos, and A. J. Odgaard (1998), Three-dimensional\nnumerical model for flow through natural rivers, J. Hydraul. Eng., 124,\n13–24.\nSmagorinsky, J. (1963), General circulation experiments with the primi-\ntive equations. Part I: The basic experiment, Mon. Weather Rev., 91,\n99–167.\nSmith, C. R. (1996), Coherent flow structures in smooth-wall turbulent\nboundary layers: Facts, mechanisms and speculation, in Coherent Flow\nStructures in Open Channels, edited by P. J. Ashworth et al., pp. 1–40,\nJohn Wiley, Hoboken, N. J.\nSmith, C. R., J. D. A. Walker, A. H. Haidari, and U. Sobrun (1991), On the\ndynamics of near-wall turbulence, Philos. Trans. R. Soc. London, Ser. A,\n336, 131–175.\nSoulsby, R. L. (1981), Selecting record length and digitization rate for near\nbed turbulence measurements, J. Phys. Oceanogr., 10, 208–219.\nStolz, S., and N. A. Adams (1999), An approximate deconvolution proce-\ndure for large-eddy simulation, Phys. Fluids, 11, 1699–1701.\nStolz, S., N. A. Adams, and L. Kleiser (2001), An approximate deconvolu-\ntion model for large eddy simulation with application to incompressible\nwall-bounded flows, Phys. Fluids, 13, 997–1015.\nSumer, B. M., and R. Deigaard (1981), Particle motions near the bottom in\nturbulent flow in an open channel, part 2, J. Fluid Mech., 109, 311–337.\nTalmon, A. M., J. M. G. Kunen, and G. Oooms (1986), Simultaneous flow\nvisualisation and Reynolds stress measurement in a turbulent boundary\nlayer, J. Fluid Mech., 63, 459–478.\nVreman, B., B. Geurts, and H. Kuerten (1994), Realizability conditions for\nthe turbulent stress tensor in large eddy simulation, J. Fluid Mech., 278,\n351–362.\nWhiting, P. J., and W. E. Dietrich (1990), Boundary shear stress and rough-\nness of mobile alluvial beds, J. Hydraul. Eng., 116, 1495–1511.\nWiberg, P. L., and J. D. Smith (1991), Velocity distribution and bed rough-\nness in high gradient streams, Water Resour. Res., 27, 825–838.\nYalin, M. S. (1992), River Mechanics, 219 pp., Elsevier, New York.\nZang, Y., R. L. Street, and J. R. Koseff (1993), A dynamic mixed subgrid-\nscale model and its application to turbulent recirculating flows, Phys.\nFluids A, 5, 3186–3196.\nZedler, E. A., and R. L. Street (2001), Large-eddy simulation of sediment\ntransport: Currents over ripples, J. Hydraul. Eng., 127, 444–452.\n\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\nR. I. Ferguson, R. J. Hardy, and S. N. Lane, Department of Geography,\nUniversity of Durham, Science Site, South Road, Durham DH1 3LE, UK.\n(r.j.hardy@durham.ac.uk)\nD. R. Parsons, School of Earth and Environment, University of Leeds,\nWoodhouse Lane, Leeds LS2 9JT, UK.\n14 of 14\nW03422 HARDY ET AL.: EMERGENCE OF COHERENT FLOW STRUCTURES W03422\n"}