{"doi":"10.1093\/fs","coreId":"15280","oai":"oai:dro.dur.ac.uk.OAI2:7920","identifiers":["oai:dro.dur.ac.uk.OAI2:7920","10.1093\/fs"],"title":"Difference, cognition, and causality : Maurice Scève’s 'Délie' and Charles de Bovelles’s 'Ars Oppositorum'.","authors":["Banks,  Kathryn"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-04-01","abstract":"This article juxtaposes two very different texts, Charles de Bovelles's Ars oppositorum (1511) and Maurice Scève's Délie (1544), examples of Latin prose philosophy and vernacular love lyric respectively. It is not a study of sources: it considers the literary text, like the Latin prose, as an instrument for thinking with. Furthermore, I suggest that contrasting conceptual possibilities arise from generic differences, so that the study of two divergent genres illuminates a variety of related conceptions of difference. I trace a shared interest in the respective roles of cognition and causality in establishing differences, but also a divergence concerning the value of difference, in particular for the human subject. Thus, in the Délie, I focus upon images of illuminating, looking, perceiving, and disintegrating. Both texts suggest that cognition is crucial to the establishment of differences, so that it even seems to usurp the function of natural causality. However, in the Délie the je suffers from difference — both difference within the self and difference from the divine — whereas in the Ars difference can be thought of as a violation but more often is perceived in Trinitarian terms, so that the human subject achieves a privileged sort of self-difference resembling that of the divine. \\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15280.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7920\/1\/7920.pdf","pdfHashValue":"a2d22d030ad0877cf6e06af772fc7ef927ae5ed1","publisher":"Oxford University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7920<\/identifier><datestamp>\n      2017-06-01T09:13:30Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Difference, cognition, and causality : Maurice Scève’s 'Délie' and Charles de Bovelles’s 'Ars Oppositorum'.<\/dc:title><dc:creator>\n        Banks,  Kathryn<\/dc:creator><dc:description>\n        This article juxtaposes two very different texts, Charles de Bovelles's Ars oppositorum (1511) and Maurice Scève's Délie (1544), examples of Latin prose philosophy and vernacular love lyric respectively. It is not a study of sources: it considers the literary text, like the Latin prose, as an instrument for thinking with. Furthermore, I suggest that contrasting conceptual possibilities arise from generic differences, so that the study of two divergent genres illuminates a variety of related conceptions of difference. I trace a shared interest in the respective roles of cognition and causality in establishing differences, but also a divergence concerning the value of difference, in particular for the human subject. Thus, in the Délie, I focus upon images of illuminating, looking, perceiving, and disintegrating. Both texts suggest that cognition is crucial to the establishment of differences, so that it even seems to usurp the function of natural causality. However, in the Délie the je suffers from difference — both difference within the self and difference from the divine — whereas in the Ars difference can be thought of as a violation but more often is perceived in Trinitarian terms, so that the human subject achieves a privileged sort of self-difference resembling that of the divine. \\ud\n<\/dc:description><dc:publisher>\n        Oxford University Press<\/dc:publisher><dc:source>\n        French studies, 2010, Vol.64(2), pp.139-149 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7920<\/dc:identifier><dc:identifier>\n        issn:0016-1128<\/dc:identifier><dc:identifier>\n        issn: 1468-2931<\/dc:identifier><dc:identifier>\n        doi:10.1093\/fs\/knq008<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7920\/<\/dc:identifier><dc:identifier>\n        https:\/\/doi.org\/10.1093\/fs\/knq008<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7920\/1\/7920.pdf<\/dc:identifier><dc:rights>\n        This is a pre-copy-editing author-produced PDF of an article accepted for publication in French Studies following peer review. The definitive publisher-authenticated version, Banks, Kathryn (2010) 'Difference, Cognition, and Causality: Maurice Scève’s 'Délie' and Charles de Bovelles’s 'Ars Oppositorum'.', French studies., 64(2): 139-149 is available online at: https:\/\/doi.org\/10.1093\/fs\/knq008 <\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1468-2931","issn:0016-1128","0016-1128"," 1468-2931"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n01 April 2011\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBanks, Kathryn (2010) ’Difference, cognition, and causality : Maurice Scves ’Dlie’ and Charles de Bovelless\n’Ars Oppositorum’.’, French studies., LXIV (2). pp. 139-149.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1093\/fs\/knq008\nPublisher’s copyright statement:\nThis is a pre-copy-editing author-produced PDF of an article accepted for publication in French studies following peer\nreview. The definitive publisher-authenticated version, Banks, Kathryn (2010) ’Difference, Cognition, and Causality:\nMaurice Scves ’Dlie’ and Charles de Bovelless ’Ars Oppositorum’.’, French studies., LXIV (2). pp. 139-149 is available\nonline at: http:\/\/dx.doi.org\/10.1093\/fs\/knq008\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n 1 \nDifference, Cognition, and Causality: Maurice Scève’s Délie  \nand Charles de Bovelles’s Ars Oppositorum \n \nBoth Maurice Scève’s Délie (1544) and Charles de Bovelles’s Ars \nOppositorum (1511), explore various kinds of difference, as well as the  \nrelationship between difference, identity and similarity. The Ars \nOppositorum is a work of prose philosophy in Latin which offers a very \nunusual version of the Aristotelian square of opposites: it is a discussion of \nhow opposites can be used to produce knowledge.\n1\n By contrast, the Délie is \na collection of love lyric influenced by Petrarchism. Despite these \ndifferences of genre, as I have shown elsewhere, the Délie and the Ars share \nan interest in the function of various kinds of difference both within and \nbetween pairs of opposite terms;\n \nin particular, both texts undermine \nantithetical difference by confusing it with other kinds of difference, thus \n                                                 \n1\n On the Ars Oppositorum, see Maurice de Gandillac, ‘L’Art bovilien des opposés’, in Charles de Bovelles \nen son cinquième centenaire 1479-1979: Actes du colloque international tenu à Noyon les 14-15-16 \nseptembre 1979, ed. by Jean-Claude Margolin (Paris: Guy Trédaniel, Éditions de la Maisnie, 1982), pp. \n157-70; Joseph M. Victor, Charles de Bovelles 1479-1553: An Intellectual Biography (Geneva: Droz, \n1978), pp. 73-87; and Jean-Claude Margolin, ‘Sur L’Art des opposés de Bovelles’, in Logique et Littérature \nà la Renaissance: Actes du Colloque de la Baume-les-Aix, Université de Provence, 16-18 septembre 1991, \neds Marie-Luce Demonay-Launay and André Tournon (Paris: Champion, 1994), pp. 5-16. \n 2 \nchallenging the categorisation of differences which was so central to \nAristotelian logic.\n2\n Furthermore, I will argue in this essay that both texts are \nalso interested in the relation of ‘opposition’ (or difference) to causality and \nto cognition, to the natural and to the human. Both writers explore the role of \nthe human subject in establishing difference, and suggest that human \ncognition may be very powerful, so that it even seems to usurp the function \nof natural causality. However, ultimately Scève and Bovelles diverge in their \nassessment of the value of difference, both in general and for the human \nsubject in particular. I shall focus in this essay upon Scève’s ‘jealous sun’ \ndizains in which, I have argued elsewhere, the beloved lady alters relations \nof difference within the cosmos.\n3\n \nMy aim in reading a poetic text alongside a theoretical one is not to \nconstruct a univocal account of Renaissance conceptions of difference, or to \n                                                 \n2\n See my article ‘Opposites and Identities: Maurice Scève’s Délie and Charles de Bovelles’s Ars \nOppositorum’. On antiperistasis in Scève and Bovelles, see Stephen Murphy, ‘Bovelles. Scève. Bruno. \nAntiperistasis’, Allegorica 14 (1993), pp. 39-52. Other discussions of Scève in the context of Bovelles’s \nthought are Jacqueline Risset, L’Anagramme du désir: Sur la Délie de Maurice Scève (Paris, Fourbis, \n1995), pp. 91-100; Doranne Fenoaltea, “Si haulte Architecture”: The Design of Scève’s Délie (Kentucky: \nFrench Forum, 1982), pp. 84-92. \n3\n ‘Opposites and Identities’. \n 3 \nconsider philosophy as a source for poetry;\n4\n instead, I will locate not only \nthe similarities but also the divergences between the Délie and the Ars. \nIndeed the generic differences between the two texts mean that they may \nhave provided contrasting conceptual possibilities: thus they illuminate \ndifferent possible ways of thinking about opposition and sameness in early \nsixteenth-century France. Some differences arise from the simple fact that, \nwhile love lyric explores particular terms which it often places in opposition \nto one another, the Ars Oppositorum sets out to analyse the principle of \nopposition. More specifically for the concerns of this essay, Bovelles, in \ncommon with much sixteenth-century prose philosophy, tends to refer to \n‘man’ Ŕ or the human intellectus (understanding \/ perception) Ŕ in the \nabstract singular; by contrast, love lyric depicts both the subjective \nexperience of a ie and also the desired tu or elle; as I will discuss, this \ndivergence between the Ars and the Délie is central to their contrasting \nperceptions of difference in the human subject. \n \n \n                                                 \n4\n Cf Hans Staub’s reading of the Délie in the context of the thought of Nicholas of Cusa, an important \ninfluence upon Bovelles: Le Curieux Désir: Scève et Peletier du Mans, poètes de la connaissance (Geneva: \nDroz, 1967). \n 4 \ni) Cognition and Causality: The Intellectus And Nature In The Ars \nOppositorum \n \nBoth Scève and Bovelles are deeply interested in the role of the human in \nrelation to opposition. Two key questions emerge in relation to this. Firstly, \nwhat role does human perception or understanding play in opposition? That \nis, what effects does the human gaze or the human mind exert upon \nopposition? And, secondly, how are human subjects affected by opposition? \nIn other words, are human beings subject to opposition?  \n Bovelles states in his first chapter that oppositions can stem either \nfrom nature or reason: his first subheading states (using a spatial image \ntypical of Bovelles’s writing) that ‘we call opposites things placed facing \neach other, turned towards one another, separated by the distance of either a \nnatural or a rational line’.5 Opposites include, for Bovelles, all things \nplaced in relation to one another ‘either by nature or by \nunderstanding\/perception (the intellectus)’ (p. 36). Oppositions of substance \n(substantia) and \/ or the thing (res) stem from nature, whereas oppositions of \n                                                 \n5\n ‘Opposita dicuntur contra se posita, in alterutrum conversa, interstite aut naturali aut rationali dyametro \ndistantia’: ed. by Pierre Magnard, (Paris: Librairie Philosophique J. Vrin, 1984), p. 36. I refer throughout to \nMagnard’s edition; translations into English are my own, although I have consulted Magnard’s French \ntranslation. All italics are my own. \n 5 \nreasoning (ratio) stem from the intellectus.\n6\n Bovelles’s first chapter \nemphasises at some length that the intellectus cannot alter the nature or \nsubstance of things Ŕ it cannot divide them or put them together; the \nintellectus cannot ‘create’ or ‘engender’ anything. Instead the human \nintellectus adds rationes (‘reasonings’) to things, producing conceptions \nwhich stem from the mind rather than simply from nature.\n7\n Therefore, the \nprocess of human reasoning embedded in Bovelles’s square of opposites Ŕ \nwhile described as creative\n8\n Ŕ seems to be one of cognition rather than \ngenuine creation.  \n                                                 \n6\n Bovelles also discusses the intellectus in the Liber de Intellectu and the De Sapiente in particular (both \npublished together with the Ars in 1511). I restrict myself here to the Ars Oppositorum, where the \nintellectus is discussed in its relation to opposition.  \n7\n ‘For the intellectus cannot change the nature or substance of things, nor can it divide them or put them \ntogether … the intellectus creates nothing and engenders nothing … The intellectus has, however, although \nsterile and infertile as far as substance is concerned, some force and fertility of its own, by which it can be \ncalled creator of rationes (reasonings); it adds, you see, to the things themselves its own rationes, which it \nderives, contains and grasps. The conception which is in the human intellectus is the fruit and offspring of \nthe human intellectus and the mind’s own work, not the work of nature alone’: ‘Nam intellectus rerum \nnaturam et substantiam immutare non potest, neque enim illas dividit aut componit … intellectus … nil \ncreat gignitque nichil … Habet tamen intellectus licet substantia sterilis atque infecundus propriam aliquam \nvim et fecunditatem, qua rationum opifex dicitur; proprias quippe rebus ipsis addit rationes, illas haurit, \ncontinet et complectitur. Is enim conceptus qui humano inest intellectui fecunditas est et partus humani \nintellectus ac peculiare mentis opus, non opus simplicis nature’ (pp. 44-6). \n8\n It produces ‘a productive development of discourse’: ‘fecunda quedam orationis propagatio’ (p. 32). \n 6 \nHowever, later in the Ars (especially in chapters 4 and 7), Bovelles \nsuggests that opposites are not natural. Although Bovelles stated in the first \nchapter that opposites can be ‘rational’ or natural, in the fourth chapter he \nsays that in nature all things are in relations of identity to themselves rather \nthan relations of opposition to other things; indeed the fourth chapter is \nentitled ‘That all things have been made by nature in identity, and none in \nopposition’.9 Furthermore, Bovelles tends to write as if the production of \noppositions might even affect nature. Whereas things in nature are ‘in their \nown place’ and never move from it, relations of opposition force things into \nplaces which are not their own (like earth into the place of fire and vice \nversa), and put different things into the same place (pp. 58-60).  \nChapter 7 aligns opposition with the intellectus by contradistinction to \nnature: all oppositions result from the intellectus rather than from nature, and \n‘the intellect is the opposition of the entirety of nature’.10 The intellectus is \npresented as a domain in which all things are opposed, by contrast with the \n                                                 \n9\n ‘Quod omnia a natura in identitate sint facta, in oppositione nulla’ (p. 58). \n10\n ‘Si a natura nulla est oppositio, superest ut omnis oppositio sit ab intellectu’ (heading of first subsection, \np. 80); ‘intellectus est totius nature oppositio, natura vero omnium identitas’ (heading of second subsection, \np. 80). \n 7 \ndomain of nature in which all things are separated and identical.\n11\n The \nintellectus is a ‘judge’ (iudex) of all things and of their oppositions and \ndifferences. Moreover, the domains of the intellectus and nature are not \nentirely independent. The judging by the intellectus is necessary to nature.\n12\n \nThe intellectus is represented as a sun (p. 88) or a light which illuminates \nnature (p. 84);\n13\n without this ‘light’, nature would be in a state of ‘chaos’, \n‘confusion’ and ‘mixity’ (p. 84).14 The introduction by the intellectus of \nopposition thus seems to affect nature.  \n                                                 \n11\n See in particular the subsection heading ‘Omnia in mundo sunt separate et eadem, coniuncta vero sunt, et \nopposite in intellectu’ (p. 82) \n12\n See also Bovelles’s De Sapiente, as well as Pierre Magnard’s ‘L’Idéal du sage dans le De Sapiente de \nCharles de Bovelles’, in Charles de Bovelles en son cinquième centenaire 1479-1979: Actes du colloque \ninternational tenu à Noyon les 14-15-16 septembre 1979, ed. by Jean-Claude Margolin (Paris: Guy \nTrédaniel, Éditions de la Maisnie, 1982), pp. 101-8. \n13\n On solar imagery in Bovelles’s De Sapiente, see Cesare Vasoli, ‘Thèmes solaires du De Sapiente’, in \nCharles de Bovelles en son cinquième centenaire 1479-1979: Actes du colloque international tenu à Noyon \nles 14-15-16 septembre 1979, ed. by Jean-Claude Margolin (Paris: Guy Trédaniel, Éditions de la Maisnie, \n1982), pp. 109-28. \n14\n Bovelles does not explain clearly how this depiction of nature as confusion fits with his representation of \nopposition as a mixing of things which is be contrasted with the separation or non-mixing of things in \nnature: see in particular, pp. 80-1. Bovelles’s spatial metaphors are often deeply complex. The notion of a \nlight dividing Chaos recalls God but Bovelles has earlier made it clear that he does not mean the divine \nintellectus, which in any case ‘is nature itself’ (p. 45).  \n 8 \nFurthermore, although Bovelles repeatedly says that opposition is \nimpossible in nature and exists only in the intellectus, the intellectus’s \nopposition of things is repeatedly presented as if it had a strong and violent \neffect upon nature. Both chapters 4 and 7 emphasise that opposition is a \nviolence Ŕ or a force (vis) Ŕ inflicted upon things, and that it acts against \nnature (pp. 58-60, 80-2). The terms violentum \/ violenta and contra naturam \n\/ nature contraria are repeated. Nature does not permit opposition, and does \nnot permit earth and fire to swap places, and yet in some sense the intellectus \ndoes bring things into places other than their natural ones, as if it could \nreorder space and the cosmic hierarchy: ‘with just as much rest and peace as \nfire remains high, with this much immobility and peace earth is at rest \nimmobile below. And with as much quarrel and difficulty fire is maintained \nbelow, as with force and discord the earth is at rest above. Identity, \ntherefore, and the peace of both elements, is that fire be high and earth be \nlow. On the other hand, the quarrel and discord of both is that fire be placed \nand positioned below and earth above.’15  \n                                                 \n15\n ‘quanta quiete et pace ignis sursum immobilis perseverat, tanta immobilitate et pace terra deorsum \nquiescit immobilis. Et quanta lite atque difficultate ignis continetur in immo, tanta vi et discordia terra \nquiescit in summo. Identitas igitur est et utriusque pax elementi: ignem esse in summon et terram in immo. \nUtriusque vero lis et discordia ignem in immo et terram in summo sisti et collocari’ (p. 58). \n 9 \nThere is a strong sense of the power exerted by the human intellectus \nupon the world: Bovelles tends to write as if cognition really could affect \nnature, as if cognition could almost be causality. Perhaps one might even \nread his emphasis that the intellectus ‘creates nothing and engenders \nnothing’ as betraying doubts concerning the absolute separation of cognition \nand causality.\n16\n There is a rather uncertain relation between cognition and \nchange, between the intellectus and nature; there is a sense that cognition \nand creativity might overlap in function.  \n \n \nii) Cognition And Causality: The Lady’s Gaze And The Je In The Délie \n \nBovelles presents human understanding or perception (the intellectus) as a \nlight which violently introduces difference into the world, which puts things \ninto unnatural places and different things into the same place, and which \nreverses the cosmic hierarchy. This provides some startling comparisons and \ncontrasts with Scève’s ‘jealous sun’ dizains. I have argued in a previous \narticle that Scève represents his lady as a bright light who, through her \n                                                 \n16\n In the second ‘circle’ of Le Fèvre de La Boderie’s Encyclie, the teacher-Muse corrects the secrétaire’s \nmistake in confusing cognition and natural change, and lists the differences between them.  \n 10 \nbrightness, first, introduces difference into the sun, making it different from \nitself, and, secondly, alters the relations of difference between the day and \nnight, so that both seem to co-exist in the same place, or to occupy the place \nof the other.\n17\n Importantly for my comparison with Bovelles’s intellectus-\nlight, it is the lady’s status as light which brings about this introduction and \nmodification of difference, and which thus alters nature. Indeed, although \nthe ‘jealous sun’ topos and related images are common in Petrarch’s poetry \nand in sixteenth-century French love lyric, the Délie places a particular \nemphasis upon light in this context, whereas, for example, Du Bellay Ŕ in his \nOlive, published five years after the Délie Ŕ evokes the heat of the sun and \nits benefits for nature.\n18\n  \nFurthermore, the light of the lady can also be thought of as a site of \nperception or cognition. It may be her eyes which are suns: they are ‘deux \nSoleils’ (D269).19 Indeed there is a strong sense of similarity between the \neye and the sun both within the Délie and in other contemporary texts. It was \n                                                 \n17\n ‘Opposites and Identities’.  \n18\n ‘J’ay veu, Amour, (et tes beaulx traictz dorez \/ M’en soient tesmoings,) suyvant ma souvereine, \/ Naistre \nles fleurs de l’infertile arene \/ Apres ses pas dignes d’estre adorez: \/ Phebus honteux ses cheveulx honorez \/ \nCacher, alors que les vents par la plaine \/ Eparpilloient de leur souëfve halaine \/ Ceulx là qui sont de fin or \ncolorez’: L’Olive, ed. E. Caldarini (Geneva: Droz, 1974); first published in 1549, s. XVII. \n19\n Throughout this essay I cite Gérard Defaux’s edition of the Délie (Geneva: Droz, 2004). \n 11 \ncommonplace to refer to the sun as an eye, and also to the eye as a light; thus \nScève refers to the sun as the ‘Œil du monde’ (D303) and to the eye as a \n‘lumiere’ (D7, D13). The eye was widely believed to cast light during the \nprocess of vision.\n20\n In Leone Ebreo’s Dialoghi d’amore, the ‘grand bréviaire \ndu platonisme lyonnais’ and an important intertext for the Délie,21 Philon \nexplains at length that both the eye and the sun both illuminate and see (as \ndo the human intellect and the divine intellect): \n \nComme l’entendement humain est comparé à l’intellect divin, pource que l’un et l’autre \nvoid et illumine, et comme l’œil est comparé au Soleil, à voir et illuminer egalement, et \naussi comme l’œil se compare à l’entendement humain en deux choses (asavoir, illuminer \net voir): aussi le Soleil, pource qu’il void et illumine les choses, ressemble le divin \nintellect.\n22\n  \n \n                                                 \n20\n See David C. Lindberg, Theories of Vision from Al-Kindi to Kepler (Chicago and London: The \nUniversity of Chicago Press, 1976). \n21\n Verdun-L. Saulnier, Maurice Scève (ca. 1500-1560) (Geneva \/ Paris: Slatkine, 1981), first published in \n1948-9, vol. I, pp. 209, 249; T. Anthony Perry, Erotic Spirituality: The Integrative Tradition from Leone \nEbreo to John Donne (University, Ala.: The University of Alabama Press, 1980), pp. 35-52; Kathryn \nBanks, ‘The Cosmic, the Human, and the Divine: The Role of Poetic Images in Guillaume de Saluste Du \nBartas’s Sepmaine and Maurice Scève’s Délie’ (unpublished doctoral thesis, University of Cambridge, \n2005), pp. 108-68. \n22\n Dialogues d’Amour, ed. by T. Anthony Perry, transl. by Pontus de Tyard (Chapel Hill: The University of \nNorth Carolina Press, 1974); translation first published in 1551, p. 168. \n 12 \nSimilarly, for the French philosophical poet Isaac Habert, the process of \nlight being cast by the eye was sufficiently similar to that of light being cast \nby the sun to allow examples from one process to account for something \nabout the other: to explain why one sometimes perceives three suns or \nmoons, Habert says that the sun is reflected in a wet cloud because its rays \nare sent back to it just as are the rays from our eyes when we look at a river \nor mirror.\n23\n Bovelles himself develops a lengthy analogy between the \ncelestial bodies and the human faculties, in which the sun Ŕ an ‘eye’ Ŕ \ncorresponds to man or to human reason.\n24\n Thus one could argue that in the \nDélie the powerful lady Ŕ who introduces difference to the world Ŕ is not \nonly a light but also a gaze; thus Scève’s description of his lady-light recalls \nBovelles’s description of the perception of the intellectus more generally.  \n However, whereas Bovelles refers to the human intellectus, in the \nDélie there are of course two human loci (if indeed ‘human’ is an accurate \ndescription of the cosmic and divinised lady-light). Moreover, the human \ngaze of the je is much less empowered than that of the lady. Like the sun,\n25\n \n                                                 \n23\n Les Trois Livres des meteores (Paris: J. Richier, 1585), ff. 19v-20r. \n24\n Vasoli, ‘Thèmes solaires’, p. 114-6. \n25\n ‘Opposites and Identities’.  \n 13 \nthe je is subjected to darkness by the lady.\n26\n In addition, his perception or \nunderstanding is frequently violated precisely by her more powerful gaze. \nThe lady undermines his gaze: ‘Les yeulx, desquelz la clarté tant me nuyt, \/ \nQu’elle esblouyt ma veue entierement’ (D386); ‘Par ton regard … \/ Tu \nm’esblouis … la veue (D115). She obscures not only his gaze but also his \ncognition in the form of pensée, sens, and congnoissance:\n27\n \n \nCe bas Soleil, qui au plus hault fait honte, \nNous a daingné de sa rare lumiere, \nQuand sa blancheur, qui l’yvoire surmonte, \nA esclercy le brouillas de Fourviere: \nEt s’arrestant l’une, et l’aultre riviere, \nSi grand’ clarté s’est icy demonstrée, \nQue quand mes yeulx l’ont soubdain rencontrée, \nIlz m’ont perdu au bien, qui seul me nuict. \n   Car son cler iour serenant la Contrée,  \nEn ma pensée a mys l’obscure nuit (D128) \n                                                 \n26\n Other contemporary poets also imply that the je and the sun are similarly challenged by their encounter \nwith the lady, but often suggest that the je survives his encounter with the lady where the sun failed to do \nso: see, for example, sonnet IX of Jacques Peletier Du Mans’s Amour des Amours, ed. by Jean-Charles \nMonferran (Paris: Société des Textes Français Modernes, 1996), pp. 29-30; sonnet XI of the Premier Livre \ndes Sonnets pour Hélène, in Ronsard’s Amours, ed. by Françoise Joukovsky (Paris: Gallimard, 1974), \np. 286. \n27\n See also D7, D51, D92, D269, D354 \n 14 \n \nAu recevoir l’aigu de tes esclairs  \nTu m’offuscas et sens, et congnoissance (D80) \n \nThus, while one ‘human’ light or gaze exerts an effect upon nature, another \nsite of human perception Ŕ the je Ŕ has his light or gaze undermined by the \nsame gaze which affects the natural world.\n28\n \n \n \niii) Difference And The Human Subject In The Délie  \n \nFurthermore, the je also suffers a sort of ‘confusion’ or ‘mixing’ or \n‘division’. Images of melting and burning are familiar from other Petrarchist \npoetry but Scève is often particularly insistent upon developing these images \nof self-disintegration. For example, in D373, his eye dissolves and melts into \ntears, which become a river which freezes him and in so doing Ŕ somewhat \n                                                 \n28\n Other implications of this are discussed in my ‘The Cosmic, the Human, and the Divine: The Role of \nPoetic Images in Guillaume de Saluste Du Bartas’s Sepmaine and Maurice Scève’s Délie’ (unpublished \ndoctoral thesis, University of Cambridge, 2005), Part II, and my book under preparation, Cosmos and \nImage in the French Renaissance. \n 15 \nparadoxically Ŕ ‘me confond’, that is to say, ‘mixes’ and metamorphoses \nhim.\n29\n \n \nA son aspect mon œil reveremment \nS’incline bas, tant le Cœur la revere, \nEt l’ayme, et craint trop perseveramment \nEn sa rigueur benignement severe. \n   Car en l’ardeur si fort il persevere, \nQu’il se dissoult, et tout en pleurs se fond, \nPleurs restagnantz en un grand lac profound, \nDont descent puis ce ruisseau argentin, \nQui me congele, et ainsi me confond \nTout transformé en sel Agringentin (D373) \n \nHis eye also ‘dissolves’ in D200, and, in D13, his body is reduced to cinders \nwhich the wind threatens to scatter. In several dizains, the lady-sun ‘melts’ \nthe je:  \n \nComme gelée au monter du Soleil, \nMon ame sens, qui toute se distille \nAu rencontrer le rayant de son œil (D290) \n \nJe me deffis à si belle rencontre, \nComme rouse au lever du Soleil (D223) \n                                                 \n29\n Gérard Defaux explains that this verb comes from the Latin confundo. He provides the following \npossible meanings for it: mêler, brouiller, render méconnaissable, métamorphoser (vol. II, p. 407). \n 16 \n \nComme neige au Soleil, je me fondz (D118) \n \n Thus, in the Délie, the human subject is subjected by the lady-sun to a \nsort of fragmentation or division of the self, and a sort of mixing of himself. \nThis recalls some of the terms used to describe the effects of the intellectus-\nsun upon nature in Bovelles’s Ars. Opposition brings about a divisio in \nnature. In addition, although paradoxically nature is presented in chapter 7 as \nmixed unless illuminated by the intellectus, elsewhere we are told that nature \ncan remain ‘unmixed’ only because it is involved in identity rather than \nopposition (which, as we have seen, is produced by the intellectus).\n30\n In \nother words, the opposition introduced by the intellectus-light brings with it \nboth mixing and division. Thus in both the Délie and the Ars, a human light \n(the lady or the intellectus) inflict not only opposition but also, by the same \ntoken, mixing and division. However, in the Ars Oppositorum, terms like \n‘mixing’ and ‘division’ apply to what occurs in some sense to nature: they \nare associated with the discussions of cosmic things being in their own place \nor an unnatural place. By contrast, in the Délie, although the sun is subjected \nto complex relations of difference, terms suggesting division and mixing \nrefer to the effects of a perception or gaze not so much upon nature as upon \n                                                 \n30\n Pp. 66, 76. See n. 13.  \n 17 \nthe poetic subject. Furthermore, division and mixing describe the state of the \npoetic subject within himself rather than in his relations to other terms.  \n \niv) Difference in the Ars Oppositorum: Violence, the Trinity, and the \nHuman Subject \nThe ‘division’ and ‘mixing’ of the je may have its positive aspects (for \nexample, ‘si belle rencontre’, D223 quoted above), but it is often presented \nin quite anguished terms. Like the sun, the je has his light darkened, and is \nsubjected to difference. Furthermore, while the lady’s infliction of difference \nmay make the sun ‘jealous’, she has a particularly negative impact upon the \nhuman subject, who melts and is burnt and so on.  By contrast, in the Ars \nOppositorum the human subject has a more privileged experience of \ndifference. The human soul does experience a sort of separation from itself \nbut this is expressed in very positive terms. Bovelles writes that the \nsubstance of the human soul Ŕ in common with divine and angelic \nsubstances alone Ŕ can experience true wisdom or sapientia.31 This sapientia \ninvolves separation (discretio) of the human soul from itself but this is \nthought of as multiplication or development (propagatio), which contrasts \nwith Scève’s trickling or blowing away. This process in the Ars is \n                                                 \n31\n pp. 46-8. See also De Sapiente and ‘L’Idéal du sage’. \n 18 \nundeniably positive: not only is it something shared with the divine but it \nalso involves gaining knowledge of the self; by contrast, as we have seen, \nthe je in the Délie laments the undermining of his gaze or understanding, in \nother words, of his ability to know. Furthermore, although the human \nintellectus is in some sense divided, Bovelles states that it is the only \nsublunary ‘thing’ which is indivisible and unitary: ‘it is evident … that under \nthe heavens only the human intellectus is indivisible, truly one and \nimmortal.’32 The intellectus as described by Bovelles thus has a radically \ndifferent experience of selfhood and knowledge from that of the human \nsubject in the Délie. \nFernand Hallyn, in his discussion of  Bovelles’s De Sapiente (On the \nWise Man) Ŕ which was published with the Ars in 1511 and which further \nexplores Bovelles’s notion of human sapientia Ŕ, suggests that the \nmultiplication of Bovelles’s human subject points to a gap inherent in \nrepresentation and resemblance, that is, to the gap of difference, which, \naccording to Hallyn, the metaphysics, the aesthetics, and the art of \nBovelles’s period were all striving to suppress.33 Hallyn’s analysis makes \n                                                 \n32\n ‘Manifestum est … sub celis solus humanus intellectus esse impartibilis vere unus atque immortalis’ \n(p. 82). \n33\n ‘Le Microcosme ou l’incomplétude de la représentation’, in Romanica Gandensia XVII (1980), pp. 183-\n92. \n 19 \nuse of Freud, and is informed by modern theories of subjectivity. Indeed, for \nthe modern reader familiar with psychoanalysis, it may be easier to accept \nHallyn’s notion of representation than Bovelles’s alignment of self-\nknowledge with self-unity: in Lacan’s famous mirror-stage, it is by \nperceiving oneself that one becomes subject to fragmentation and loses \none’s infant wholeness. However, Bovelles’s own writing does not point to \nthis psychoanalytic conception of the human subject: if this conception is \nindeed suppressed, then the suppression seems very effective. Hallyn \nobserves that Bovelles’s multiplication of the human subject as ‘homo-\nhomo-homo’ constitutes a ‘chain’ which could be infinitely extended, like \nany chain of signifiers; its triple nature is, Hallyn suggests, arbitrary. \nHowever, as far as Bovelles is concerned, the human soul takes the form of a \ncircle rather than a chain (p. 185); moreover, the tripling of the ‘homo’ is far \nfrom arbitrary, since it bestows upon man the Trinitarian number and \ntherefore supports Bovelles’s suggestion that difference within the human \nintellectus resembles that within the divine. \nFor Bovelles, then, the human subject Ŕ or rather the human soul Ŕ \ncan achieve a privileged sort of self-difference, a ‘separation’ from the self \nwhich is shared only with the divine, and which sounds rather different from \nthe divisio imposed upon nature by the intellectus and opposition. Indeed, \n 20 \nthe divisio of nature is, as we have seen, sometimes painted in implicitly \nnegative terms as a violence or force inflicted upon things. However, these \nnegative terms are not distributed evenly throughout the Ars, and ultimately \neven the opposition within nature Ŕ while it cannot constitute the privileged \nsapientia of the human subject Ŕ does not seem to be conceived as negative. \nIndeed it is often described using the language of the Trinity. Thus in the \nopening chapter, Bovelles explains that the two extremes of an opposition Ŕ \nthe monad and the dyad Ŕ ‘engender’ a third term, the triad; this \n‘engendering’ of a third term clearly recalls the production of the Holy Spirit \nby the Father and the Son. This sort of language returns repeatedly. For \nexample, in the medium point there is a trace of the creativity of the divine \nTrinity (p.40), and in the three circles which represent the extremes and the \nmiddle term, one can perceive the mystery of the Trinity (p. 51). Although \nchapters 4, 6 and 7 in particular emphasise the violence of opposition, the \nfinal chapters return to emphasising the circles, the triad, and the middle \nterm, which can be described using Trinitarian language.  \nThus, while the dyad of opposites might imply violence, this violence \nis apparently redeemed by the triad which is much more positively \nconceived. As a result, while difference occasionally appears violent and \nnegative, in the case of the human soul it resembles Trinitarian difference, \n 21 \nand even in other cases it implicitly bears some resemblance to it. If all \nthings cannot be quite so definitively created ‘in the image of God’ (Genesis \n26-7) as man was, they nonetheless seem to bear some trace of his image.\n34\n   \n \n*** \n \nThus the argument that Bovelles suppresses negative conceptions of \ndifference is difficult to ground in Bovelles’s own writing. However, another \nearly sixteenth-century text Ŕ the Délie Ŕ shares some of Bovelles’s \napprehensions of difference and yet ultimately construes them with more \nnegative implications. Like the Ars Oppositorum, the Délie plays with non-\nbinary models of difference; however, ultimately these non-binary models \nimply a less positive experience of difference, particularly for the human \nsubject. Both the Ars and the Délie suggest that a powerful light or gaze \nmight function to create differences. However, in Bovelles’s Ars both the \ndivine and the human can have a privileged relation to difference and to \nknowledge. By contrast, this sapientia seems to be an impossibility for the je \nin the Délie: he perceives the power of a cognitive and creative ‘light’ in the \n                                                 \n34\n This is a particular inflection of the notion that the cosmos and individual cosmic phenomena constitute \nimages of God, an idea which justified the project of natural theology, that is the attempt to know God by \nstudying the natural world.  \n 22 \nfigure of the lady, yet he suffers from this gaze rather than being similarly \nempowered. Scève may lack Bovelles’s confidence in the positive nature of \ndifference because of love lyric’s depiction of the beloved with the traits of \nthe divine. Indeed, in his De Sapiente Bovelles makes it clear that the \nmovement of human cognition cannot be dissociated from the downward \nmovement of the divine, which is a gift from God to man.\n35\n The ie in the \nDélie relates not to God but rather to a lady who, in accordance with love \nlyric’s divinisation of the beloved, has usurped God’s place and yet is \ncruel:\n36\n whereas the human subject in the Ars has a positive experience of \ndifference because of his relationship with the angelic and the divine, the \ndivinity of the Délie inflicts difference rather than redeeming it.\n37\n  \n                                                 \n35\n ‘Le mouvement anagogique de la raison ne saurait cependant être disjoint du mouvement condescendant \nde la lumière divine’ (‘L’Idéal du sage’, p. 108).  \n36\n In particular, whereas in the Délie the lady is the desired sun, in the De Sapiente God is the sun ‘vers \nlequel tend par nécessité tout désir ou savoir’ (Vasoli, ‘Thèmes solaires’, p. 118).  \n37\n My doctoral thesis discusses, from a different angle, the relationship between Scève’s depiction of the \nlady in the Délie and contemporary depictions of God; it also discusses the link between this and the \nsuffering of the je. See ‘The Cosmic, the Human, and the Divine’, Part II.  \n"}