{"doi":"10.1007\/978-90-481-8840-6","coreId":"65138","oai":"oai:dro.dur.ac.uk.OAI2:6790","identifiers":["oai:dro.dur.ac.uk.OAI2:6790","10.1007\/978-90-481-8840-6"],"title":"Fairness in international trade : the case of economic partnership agreements.","authors":["Moore,  G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":["Moore,  G."],"datePublished":"2010-05-01","abstract":"This book arises out of papers delivered at the World Congress of the International Society of Business, Economics and Ethics (ISBEE) held in Cape Town in 2008. There are two sections. First, a number of key papers provide an insight into global business, wealth creation and welfare issues with particular reference to the African continent - appropriate for a Congress that was based in South Africa and drew wide participation from African scholars. Second, it provides the output from a global research project on \"Fairness in International Trade\" which ran over the two years prior to the Congress. This project drew together the work of scholars in five regions across the globe and is the first time that such a global perspective has been attempted.\\ud\n\\ud\nThis book is aimed at academics working in the area of international trade or development economics particularly those who have an interest in the ethical dimensions of trade. It will also be of interest to students of development economics and business ethics particularly at Masters and Doctoral level","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65138.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6790\/1\/6790.pdf","pdfHashValue":"6e0260f000376c905a413a46632f48648b114717","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6790<\/identifier><datestamp>\n      2010-05-14T09:35:45Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Fairness in international trade : the case of economic partnership agreements. <\/dc:title><dc:creator>\n        Moore,  G.<\/dc:creator><dc:description>\n        This book arises out of papers delivered at the World Congress of the International Society of Business, Economics and Ethics (ISBEE) held in Cape Town in 2008. There are two sections. First, a number of key papers provide an insight into global business, wealth creation and welfare issues with particular reference to the African continent - appropriate for a Congress that was based in South Africa and drew wide participation from African scholars. Second, it provides the output from a global research project on \"Fairness in International Trade\" which ran over the two years prior to the Congress. This project drew together the work of scholars in five regions across the globe and is the first time that such a global perspective has been attempted.\\ud\n\\ud\nThis book is aimed at academics working in the area of international trade or development economics particularly those who have an interest in the ethical dimensions of trade. It will also be of interest to students of development economics and business ethics particularly at Masters and Doctoral level. <\/dc:description><dc:subject>\n        Africa<\/dc:subject><dc:subject>\n         African Continent<\/dc:subject><dc:subject>\n         Business ethics<\/dc:subject><dc:subject>\n         Common Good<\/dc:subject><dc:subject>\n         Developing countries<\/dc:subject><dc:subject>\n         Developing economies<\/dc:subject><dc:subject>\n         Development economics<\/dc:subject><dc:subject>\n         Doha<\/dc:subject><dc:subject>\n         Doha Round<\/dc:subject><dc:subject>\n         Economics<\/dc:subject><dc:subject>\n         Emerging economies<\/dc:subject><dc:subject>\n         Ethics<\/dc:subject><dc:subject>\n         Fairness<\/dc:subject><dc:subject>\n         Global business<\/dc:subject><dc:subject>\n         Globalisation<\/dc:subject><dc:subject>\n         International trade<\/dc:subject><dc:subject>\n         WTO<\/dc:subject><dc:subject>\n         Wealth<\/dc:subject><dc:publisher>\n        Springer<\/dc:publisher><dc:source>\n        Moore,  G. (Eds.). (2010). Fairness in international trade. Netherlands: Springer, pp. 195-216, International Society of Business, Economics, and Ethics(1)<\/dc:source><dc:contributor>\n        Moore,  G.<\/dc:contributor><dc:date>\n        2010-05-01<\/dc:date><dc:type>\n        Book chapter<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6790<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6790\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1007\/978-90-481-8840-6<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6790\/1\/6790.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Africa","African Continent","Business ethics","Common Good","Developing countries","Developing economies","Development economics","Doha","Doha Round","Economics","Emerging economies","Ethics","Fairness","Global business","Globalisation","International trade","WTO","Wealth"],"subject":["Book chapter","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n14 May 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nMoore, G. (2010) ’Fairness in international trade : the case of economic partnership agreements.’, in Fairness\nin international trade. Netherlands: Springer, pp. 195-216. International Society of Business, Economics, and\nEthics. (1).\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1007\/978-90-481-8840-6\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nFairness in International Trade:  \nthe case of Economic Partnership Agreements \n \nGeoff Moore \nDurham Business School, Durham University, U.K. \n \nAbstract \n \nThis chapter begins by setting out the background to international trade relations between the \nEuropean Commission and developing countries before turning to look at Economic \nPartnership Agreements (EPAs) themselves in more detail and the effects that have been \npredicted on the developing countries if EPAs were to be introduced in the way envisaged. \nThe chapter then comments briefly on a “Stop EPAs” campaign that has been run by NGOs \nfor a number of years, before presenting and commenting on the current position showing \nwhich EPAs have been signed. The literature on fairness in international trade is then \nreviewed and, to some extent, extended and applied to the case of EPAs. Conclusions which, \nas might be predicted, are somewhat tentative, but do raise some new issues are then drawn. \n \n \nIntroduction \n \n“Any attempt to define fairness in global trade relations should teach humility.” \nBrown & Stern (2007: 316) \n \nThere are, perhaps, three reasons why humility is both required and will be learned from \nstudying fairness in international trade. The first is due to the inherent complexity of \ninternational trade relations, which makes any attempt to grasp them difficult and the danger \nof over-simplification rife. The second is that, if it were possible to adequately summarise \neven a particular aspect of such relations, the application of fairness principles is by no means \nstraightforward. While there have been numerous attempts to apply such principles, so that in \none sense the ground is well-trodden, the judgements that emerge do not necessarily bring the \nkind of clarity that might be desired – in other words, judgments that such and such a practice \nis unfair and should be changed, or otherwise, are few and far between. Brown & Stern, cited \nabove, continue: “even if we could transcend the self-serving bias inherent in the judgment of \nall interested parties, there is still no conclusive and incontrovertible way of assessing \nfairness” (2007: 316). And this leads to the third reason why humility will be required and \nlearned, which is that fairness judgements on particular aspects of international trade \nrelations, even if they were to be clear and unequivocal, may not lead to any change by those \ndeemed to have infringed fairness towards those who are on the receiving end of such acts. \nHumility is involved in finding that one‟s work may lead to nothing substantive by way of \nchange „on the ground‟ – where it really matters. \n \nDespite these three reasons, any one of which might seem to be enough to persuade one not \nto embark on this particular journey, this chapter sets out to explore the case of Economic \nPartnership Agreements (EPAs). These are bilateral trade agreements between the European \nCommission (EC) and various groupings of African, Caribbean and Pacific (ACP) countries, \nwhich have been the subject of intense negotiations leading up to and beyond the deadline of \n31\nst\n December 2007 by which all such agreements were due to be set in place. The case of \n 2 \nEPAs, therefore, provides both a timely and an excellent test case for exploring the fairness \nor otherwise of trade relations between developed and developing countries. \n \nThe chapter begins by setting out the background to international trade relations between the \nEC and developing countries before turning to look at EPAs themselves in more detail and \nthe effects that have been predicted on the developing countries if EPAs were to be \nintroduced in the way envisaged, together with a number of associated issues related to the \nintroduction of EPAs. The chapter then comments briefly on a “Stop EPAs” campaign that \nhas been run by NGOs for a number of years, before presenting and commenting on the \ncurrent position showing which EPAs have been signed. The literature on fairness in \ninternational trade is then reviewed and, to some extent, extended and applied to the case of \nEPAs. Conclusions which, as might already be predicted, are somewhat tentative, but do raise \nsome new issues are then drawn. \n \n \nThe background to EU-ACP international trade relations \n \nWhen the European Communities, as they were originally known, were founded in 1957 by \nthe Treaty of Rome they rapidly established preferential relations with the ACP countries that \nhad recently gained independence from their former colonial masters (Lang 2006: 1). From \n1975 until 2001 trade relations between what became the European Union (EU) and the ACP \ncountries were governed by the four Lomé Conventions. These represented a form of the \nEU‟s Generalized System of Preferences (GSP) which “put ACP countries at the top of the \npyramid of preferences granted by the EU to developing countries” (Ochieng 2007: 367). \nThese have provided ACP countries with “a very favourable trade regime, a substantial aid \nbudget, and a set of joint institutions” which has meant that “ACP exporters have generally \nenjoyed a tax advantage over some of their competitors when selling products facing tariffs \ninto the European market” (Stevens 2006: 442). These trade relations have been non-\nreciprocal in the sense that ACP countries have not been required to assume corresponding \nobligations to allow tax advantages to imports originating in EU countries (Ochieng 2007: \n367).\n1\n  \n \nHowever, such non-reciprocal arrangements have become increasingly open to challenge in \nthe World Trade Organisation (WTO) because they were seen to discriminate against other \ndeveloping countries (Powell 2007: 8). There is, therefore, immediately an issue of fairness \nbetween one set of developing countries and another set, as well as the possibility that such \nother developing countries might mount a legal challenge based on the General Agreement \non Tariffs and Trade (GATT) Article XXIV (see further below). Indeed Peter Mandelson, the \nformer European Commissioner for Trade since 2004, has claimed that “other developing \ncountries are watching these final stages of our negotiations [over EPAs] like hawks” \n(Mandelson 2007), precisely to ensure fair treatment between all parties and the end of \npreferential treatment to ACPs. Despite this, there are a number of “special and differential \n                                                 \n1\n Such preferential treatment is allowable under what is known as the “Enabling Clause”, but is officially the \n“Decision on differential and more favourable treatment, reciprocity and fuller participation of developing \ncountries” that was adopted by the General Agreement on Tariffs and Trade (GATT) in 1979. The Enabling \nClause provides the legal basis for the World Trade Organisation‟s (WTO) GSP by which developed countries \noffer non-reciprocal preferential treatment (e.g. zero or low duties on imports) to products which originate in \ndeveloping countries. Preference-giving countries can unilaterally decide which countries and which products to \ninclude. See www.wto.org\/english\/tratop_e\/devel_e\/dev_special_differential_provisions_e.htm, accessed \n12\/12\/08. \n 3 \ntreatment” (SDT) provisions, most notably the notion of non-reciprocity, that are enshrined in \nGATT articles and the Enabling Clause (Ochieng 2007: 391 and see Ochieng 2007: 367 and \nFootnote 1) which might allow more flexibility. \n \nThe successor to the Lomé Conventions between the EU and ACP countries was the Cotonou \nAgreement which was signed in 2000 for a period of 20 years. This Agreement “aims to \npromote economic growth and development as well as the smooth and gradual integration of \nACP states into the world economy” (Borrmann & Busse 2007: 403). Although a 20 year \nAgreement, from a trade perspective the time period is shorter because of the WTO-\ncompatibility issue identified above. Thus, at the WTO Doha conference in November 2001 a \ntemporary waiver was granted giving a deadline by which WTO-compatible reciprocal trade \nagreements had to be signed of 31\nst\n December 2007. It has been the prospect of the end of \nthis temporary waiver that has led to the negotiation of the EPAs which are the subject of this \nchapter.  \n \nThe Cotonou Agreement placed these new arrangements under the jurisdiction of GATT \nArticle XXIV whereas previously under the Lomé Conventions the arrangements were under \nthe jurisdiction of the Enabling Clause. Article XXIV governs Free Trade Agreements \n(FTAs) between states or groupings of states, and includes the requirement that FTAs must \neliminate tariff barriers on “substantially all trade” (SAT) within a “reasonable length of \ntime” (see Lang 2006, Ochieng 2007, Powell 2007). Article XXIV defines the time period \nstating that it should exceed 10 years only in exceptional cases, such exceptions requiring \nspecific justification. The exact definition of “substantially all trade”, however, is not \nprovided for within the Article but is usually taken to mean a minimum of 80% (Busse & \nGrossmann 2007: 808) allowing flexibility both over which 20% is omitted and whether this \nis divided equally. Lang (2006: 12-13), however, states that the EU has traditionally argued \nthat liberalisation should extend to 90% of existing trade, but that this might be split unevenly \nso that, for example, the EU could accept full liberalisation of 100% with ACP countries \ncommitting to 80%. We will return to both these issues – of how much liberalisation and over \nwhat period – when considering EPAs in more detail below. \n \nDespite the requirement to negotiate revised and reciprocal trade agreements, the Cotonou \nAgreement, as noted above, is more broadly based and includes specific provisions for \ndevelopment strategies and priority for the objective of poverty reduction, and a special focus \non the Millennium Development Goals.\n2\n There is also a provision for a transitional period of \nup to at least 12 years on the new trade agreements, apparently in contradiction of the 10 year \nmaximum under Article XXIV,\n3\n although the U.K.‟s Department for International \nDevelopment (DFID) suggests such periods may be as much as 25 years.\n4\n  Both Powell \n(2007: 8) and Ochieng (2007: 382-3) draw attention to the objective of EPAs within the \nCotonou Agreement as follows: “Economic and trade cooperation shall aim at fostering the \nsmooth and gradual integration of the ACP states into the world economy, with due regard \n                                                 \n2\n See \nhttp:\/\/ec.europa.eu\/development\/geographical\/cotonouintro_en.cfm?CFID=2311138&CFTOKEN=de5549ec566\ne53bc-44BE1EAC-BCAD-6AE3-85FE869240E498A7&jsessionid=243062fb88384a375d62, accessed \n12\/12\/08. \n3\n See \nhttp:\/\/ec.europa.eu\/development\/geographical\/cotonouintro_en.cfm?CFID=2311138&CFTOKEN=de5549ec566\ne53bc-44BE1EAC-BCAD-6AE3-85FE869240E498A7&jsessionid=243062fb88384a375d62, accessed \n12\/12\/08. \n4\n See, www.dfid.gov.uk\/aboutdfid\/organisation\/economic-partnership-agreements.asp, accessed 12\/12\/08. \n 4 \nfor their political choices and development priorities, thereby promoting sustainable \ndevelopment and contributing to poverty eradication in the ACP countries”. \n \nThis leads us on to consider two other aspects of the context within which EPAs have been \nnegotiated. The first is the WTO itself which has become the subject of bitter dispute and \nanti-globalization protests such as those at Seattle (Elsig 2007: 75). While providing, as we \nhave seen, the overall legal context within which trade agreements such as FTAs are to be \nnegotiated by those countries which have chosen to become WTO members (such that GATT \nArticle XXIV, for example, forms part of WTO Law – Ochieng 2007: 365), there remains a \ndispute over whether the WTO is a trade rather than development organisation, and so \nwhether it should or should not “be burdened by broad development concerns of which it has \nno comparative institutional advantage” (Ochieng 2007: 383). Not surprisingly the EU takes \na pro-trade stance in which trade liberalisation, greater integration of the world economy, the \nincreasing role of the market and a correspondingly diminishing role of the state all form key \nelements. However, “ACP countries and a number of scholars object to this conception of the \nobjects and purposes of both EPAs and the WTO” (ibid.: 384, and see also Griffith & Powell \n2007: 7-11).  \n \nThe Doha Development Round of the WTO which began in 2001, was suspended in July \n2006 and resumed in February 2007, had, as its name suggests, a fundamental focus on the \nneeds of developing countries and has foundered on the issues of market access and \nagricultural subsidies (IDC 2007: 10). Negotiations may, however, now be moving towards \nsome form of resolution.\n5\n  The point in relation to EPAs, however, is that their WTO-\ncompatibility, while not in dispute in itself and, indeed, part of the Cotonou Agreement (Lang \n2006: 2), is subject to disagreement over what precisely such compatibility entails. Ochieng, \nfor example, argues that the EU takes a literal (textual) approach to the interpretation of WTO \nlaws, an approach described as “legally problematic and relatively developmentally \nrestrictive compared to the ACP‟s teleological approach to interpretation – a holistic \nexamination involving textual, contextual and case law analyses of specific WTO \nAgreements, and assessment of the objects and purposes of the WTO” (Ochieng 2007: 364). \nThus, not only are specific issues such as GATT Article XXIV open to renegotiation (Lang \n2006), but the purpose of the WTO itself continues to be the subject of contention. \n \nThe final contextual issue that we need to take account of is the economic situation and trade \nobjectives of the ACP countries. In 1976, just after the first Lomé Convention was \nintroduced, the ACP states accounted for 6.7% of the EU market, while by 2005 it accounted \nfor only 3% (see Borrmann & Busse 2007: 403). ACP‟s trade with the rest of the world has \nalso fallen over the same period (Ochieng 2007: 377-8). In addition, about 68% of total ACP \nexports to the EU consists of agricultural goods and raw materials, with ten products \naccounting for some 74% of this (Borrmann & Busse 2007: 404). This is, of course, despite \nthe trade preferences that the ACP countries have enjoyed over many decades. Thus, while \ntrade with the EU continues to be important to ACP countries, there is evidence that it is in \ndecline, at least proportionately, and that primary commodities continue to form a substantial \npart with little apparent progression to added value processed goods. Additional preferences \non market access are, therefore, unlikely to benefit ACP countries in the future (ibid.: 404). \n \nPerhaps associated with the decline in international trade, the African countries within the \nACP have long held the view that regional integration leading eventually to full continental \n                                                 \n5\n See http:\/\/www.wto.org\/english\/tratop_e\/dda_e\/dda_e.htm, accessed 12\/12\/08. \n 5 \nintegration is a desirable objective (see Powell 2007: 18-23). Thus, there have been various \nregional groupings involving more than 20 economic co-operation arrangements and, while \nthe success of these groupings is not proven and their considerable overlapping membership \nremain problematic (Powell 2007: 22, Stevens 2006: 445), the vision of regional integration \nremains and has recently been reinforced by the establishment of the African Union \n(succeeding the Organisation of African Unity) and the founding of the New Partnership for \nAfrica‟s Development (NEPAD) (Powell 2007: 23).  \n \nAssociated with this, the negotiations between the EC and ACP countries have been \nconducted not on a country-by-country basis, but between the EC and six regional groupings \n– four in Africa and one each in the Caribbean and Pacific. The groupings and countries \nwithin each group are shown in Appendix 1. Within each of these groupings it will be noted \nthat there is a mixture of Least Developed Countries (LDCs) and others generally known as \ndeveloping countries. While the United Nations maintains a precise definition and listing of \nthe 50 LDCs in the world,\n6\n no official definition and listing of developing countries exists. In \nrelation to EPAs the fact that each grouping contains a mixture is important, for under WTO \nrules developed countries can give non-reciprocal access to only two groups – either to LDCs \nonly or to all developing countries.\n7\n Thus, it would be possible to negotiate different \nagreements with the two different types of countries within a regional grouping but \npotentially problematic to negotiate one overall regional agreement – a point to which we will \nreturn. \n \nGiven that negotiations were always likely, and have proven, to be problematic, one \nobvious question has to do with the fall-back position should such negotiations fail. Here, a \nfurther reason for difficulties associated with combinations of LDC and other developing \ncountries within one regional grouping emerges. For LDCs a system known as “Everything \nBut Arms” (EBA) exists. This was adopted by the EC in February 2001, granting duty-free \naccess to imports of all products from all LDCs without any quantitative restrictions, except \nto arms and munitions. The EBA Regulation foresees that the special arrangements for \nLDCs should be maintained for an unlimited period of time and not be subject to the \nperiodic renewal of the EC‟s scheme of generalised preferences.8   \nHowever, for non-LDCs a more restrictive GSP+ scheme, approved in June 2005, exists. To \nqualify for this a large number of good governance and economic conventions have to be \nimplemented, which most ACP countries have not ratified,\n9\n and even then “this would mean \nless-favourable access to the EU market than the one granted under … the Cotonou \nAgreement and thus a decline in their export earnings from the EU market” (Busse & \nGrossman 2007: 788). For this reason non-LDCs have been keener to sign up to EPAs than \ntheir LDC regional partners which have less to lose – a source of tension within some of the \nregional groups (see Borrmann & Busse 2007: 408). An illustration of the effects on non-\nLDCs is given in Ross (2007) citing the case of a Ghanaian pineapple producer with a \nturnover around $50 million supplying to the U.K. supermarket chain Marks and Spencer. \nOnce the tariff-free status is removed, the juice products would become immediately \nunviable. If prices with European supermarkets could not be renegotiated, the company \n                                                 \n6\n See www.un.org\/special-rep\/ohrlls\/ldc\/list.htm, accessed 12\/12\/08. \n7\n See, for example, www.dfid.gov.uk\/aboutdfid\/organisation\/economic-partnership-agreements.asp, accessed \n12\/12\/08. \n8\n See http:\/\/ec.europa.eu\/trade\/issues\/global\/gsp\/eba\/index_en.htm, accessed 12\/12\/08. \n9\n See www.dfid.gov.uk\/aboutdfid\/organisation\/economic-partnership-agreements-myths.asp, accessed 12\/12\/08. \n 6 \nmight be forced to consider relocating – presumably to a LDC where the tariff-free status \nwould remain. \n \n \nEconomic Partnership Agreements and their predicted effects and associated issues \n \nWith this as background, we are now in a position to look in more detail at EPAs themselves, \ntheir predicted effects and a number of associated issues. Given the requirement to have new \ntrade agreements in place by the end of 2007, negotiations started in September 2002 but, as \nmight be expected from the discussion above, have not progressed smoothly. This is despite \nthe fact that, at least according to DFID, EPAs “are intended to be instruments for \ndevelopment, as opposed to standard trade agreements” with the aim being that ACPs \n“gradually build their capacity to compete in world markets”.10  This was expected to be a \nthree-stage process first with regional integration within ACP regions, then with integration \nwith the EU so that the EU market is slowly opened up, and finally integration as a whole \nwith the world economy. At first sight, therefore, EPAs seem to be simple replacements for \nthe WTO-incompatible agreements and to be beneficial to ACP countries, preserving the \npreferential treatment that has long been afforded to these countries and leading to regional \nand world integration.  \n \nWhat, then, are the concerns that have meant that EPAs have become the subject of such \nconcern within ACP countries themselves and have led to a campaign by various NGOs \nagainst the EC? The main point of concern, as we noted above, is that these new agreements \nmust be reciprocal if they are to be WTO-compatible, and this therefore involves liberalising \nsubstantially all trade and within a reasonable period. But, while such liberalisation has been \nthe main source of concern, there have been a number of other associated issues. All in all, \nwe can identify five such issues. \n \nThe first is the effects of EPAs on regional integration which, as we saw above, is a key \nobjective particularly of African countries. There is a potentially negative effect on African \nregional integration with regional groups splintering between those countries which are \nwilling to liberalise and those which are not (Stevens 2006: 446). This could cause regional \nrealignments and, because of the possibility of differential liberalisation schedules, make \nregional partners reluctant to open their borders to trade with each other – making smuggling \nacross borders a possibility (ibid.: 451). Powell (2007: 5-6) cites United Nations research \nestimating that West African countries would experience net trade diversion amounting to \nUS$365 million of which US$35.6 million represents foregone exports from the Economic \nCommunity of West African States (ECOWAS) to the rest of the region. Stevens concludes, \n“All in all, the outlook for EPAs to support regional integration is not good” (2006: 455). \n \nThe second issue is an associated argument against EPAs put forward by Borrmann & Busse \n(2007). Their concern is with the quality of institutions and in particular market entry \nregulations for starting a business, the efficiency of the tax system and labour market \nregulation (Borrmann & Busse 2007: 406). Where these are in place and not excessive there \nis a positive relationship between trade liberalisation and growth, whereas the opposite is true \nwhere the institutional arrangements are poor. Analysing the ACP countries on this basis they \nfind that there is limited concern in the Caribbean and Pacific countries due to the stage of \n                                                 \n10\n See www.dfid.gov.uk\/aboutdfid\/organisation\/economic-partnership-agreements.asp, accessed 12\/12\/08. \n 7 \ninstitutional development already achieved. For the four African regions, however, the story \nis very different: “the large majority of African countries [33 out of 46]11 … are not likely to \nbenefit from an increase in trade due to EPAs” (ibid.: 407). Hence, they argue that “reform of \nthe institutional frameworks should be an important topic on the EPA agenda” (ibid.: 407), \nbut are not convinced that even then, and even with appropriate aid assistance, sufficient time \nexists for such reforms to be introduced – a further point in relation to the “within a \nreasonable length of time” issue noted above. Borrmann & Busse (2007: 414) also note that \nlarger or more powerful countries with good institutions may then force weaker countries into \nEPAs when the effects on the weaker countries may be for them to suffer rather than benefit. \nThe alternative is the undermining of regional integration if they opt out of the EPA process – \nas we have already noted above. \n \nThe third issue, which follows from the first two, is the trade and fiscal impact of EPAs. As \nmight be expected, various assessments of such effects have been made. Lang (2006: 13) \ncompares the impact of EPAs under three scenarios – full reciprocal liberalisation; \nasymmetrical liberalisation (EU 100%, ACP 80%, SAT = 90%) under the EU‟s classic \ninterpretation; and a larger degree of asymmetry (EU 100%, ACP 60%, SAT = 80%). The \nmost favourable, of course, is the last scenario and only here does GDP increase for ACP \ncountries though there are still fiscal losses due to reduced tariff income. The effect of \nreciprocity on the consequent reduction in revenues from tariffs is illustrated by the case of \nZambia which would lose $15.8m per year – the equivalent of its annual HIV\/Aids budget \n(Bunting 2007). \n \nBusse & Grossmann (2007) look specifically at the trade and fiscal impact on West African \ncountries. While the detailed results that they present are beyond the scope of this chapter, \ntheir conclusions are instructive. Assuming complete tariff liberalisation, trade creation \nwould exceed trade diversion in all West African countries, with total imports from EU \ncountries also increasing in all countries (ibid.: 795). The effect on government revenues, \nhowever, is a decline of between 4% and 9% in most West African countries, although Cape \nVerde and Gambia would be more seriously affected (ibid.: 808). Since full liberalisation is \nunlikely the actual effects would be smaller, but nonetheless Busse & Grossman conclude \nthat since “tariff revenue is a significant source of financing government expenditures in most \nof the West African countries … the most urgent task … will be to take measures to offset the \ndecline…” (ibid.: 809), though they note the difficulties inherent in replacing this funding \nwith domestic taxation. “To sum up”, they say, “negotiations on EPAs pose a major \nchallenge to West African countries. While there is little doubt that West African countries \nwould benefit from improved or more secure access to EU markets, it is not clear whether it \nis in the interest of West African countries to eliminate customs duties for almost all EU \nproducts by 2020” and they call for the well-designed opening up of domestic markets “with \nspecific attention given to country specifics and capabilities” (ibid.: 809). This echoes the call \nby Borrmann & Busse (2007: 414) for a high degree of flexibility in the EPA process if pro-\ndevelopment outcomes are to be achieved. \n \nAnderson & van der Mensbrugghe (2007) studied the specific case of Uganda. They compare \nfull mutual liberalisation (including the removal of developed countries‟ agricultural \nsubsidies) with two alternative scenarios. The first is a multilateral partial reform under the \nWTO‟s Doha round and the second is under EPAs. Again, the details of the findings need not \nconcern us, but the conclusions are that “Uganda is not likely to gain a lot – and may even \n                                                 \n11\n Countries included in the analysis differ very slightly from those in Appendix 1. \n 8 \nlose very slightly – from further reducing its tariffs, and likewise from the EU waiving the \nremaining tariffs on imports from Uganda and other ACP countries” (ibid.: 548). They stress \nthat this does not mean that there is no need for Uganda and its ACP partners to undertake \nfurther trade reform, but again it seems that the conditions need to be right for Uganda to \nbenefit significantly from trade liberalisation. \n \nMore anecdotal evidence from NGOs indicates the actual effects of rapid trade liberalisation \n„on the ground‟. A Traidcraft report showed that Jamaica‟s dairy market liberalisation \n“decimated small farmers, left local milk production with barely a tenth of the market, and \nled to the EU supplying two-thirds of the island‟s milk powder”, while a “Christian Aid \nassessment of tomato liberalisation in Senegal showed that the local price halved, while \nimports of EU paste increased twenty-fold” (Cobham & Powell: 2007). These may be \nanecdotal but the effects on actual people in ACP countries reminds us that statistics \nultimately mean people and communities. \n \nThis collection of evidence then, albeit based mainly and necessarily on a forecasting of the \neffects, indicates that ACP countries are unlikely to benefit directly from EPAs. Nor should \nthis surprise us, given the evidence that exists generally on trade liberalisation. Ochieng \n(2007: 377-8) summarises this well: \n \n “The relationship between trade and growth has been shown to be complex, if not \nambiguous … there is little evidence that trade liberalization is correlated with \neconomic growth, poverty reduction, or economic development. Whilst no country \nhas developed successfully by turning its back on international trade, none has \ndeveloped by simply liberalizing its trade. The critical balance lies in each country \nadopting its own trade and investment policies and strategies, in line with its \ndevelopment needs … [A]nalysis of trade, economic growth and poverty reduction \nneeds to go beyond trade liberalization to include inter alia: the relationships between \ntrade and inequality, trade and employment, bargaining power in global production \nchains and the distribution of gains from trade, the effects of trends in, and variability \nof terms of trade on poverty, the effects of primary commodity dependence, and the \nrelationship between export and import instability and vulnerability.” \n \nAgain the evidence in favour of the flexibility of individual countries to determine their own \ndevelopment needs is clear. \n \nThis brings us to the fourth issue of concern and one which is also related to the issue of \nflexibility. This is that the EC has attempted to include what are known as the “Singapore \nIssues” on the agenda within the negotiations on EPAs. These relate to investment, \ncompetition, government procurement and services, and the EC‟s position is that these should \nalso be subject to negotiation within EPAs apparently “in order to achieve ACP development \nobjectives” (Griffith & Powell 2007: 8). ACP countries, by contrast, have generally indicated \nthat they do not wish these issues to be part of EPAs negotiations and, apart from services, \nthese issues remain outside the ambit of the WTO. Within the Cotonou Agreement there is \nonly an agreement to discuss co-operation not to agree binding rules (ibid.: 8-9). Again, there \nseems to be a lack of flexibility here on the EC‟s part, and an unwillingness to allow ACP \ncountries the flexibility to negotiate on these issues at their choice and speed. This is exactly \nthe concern of the U.K.‟s International Development Committee which has expressed its \n 9 \nview that the EU is abusing its position on this issue (IDC 2007: 14), and DFID in the U.K. is \nsimilarly concerned.\n12\n \n \nThe fifth and final issue is to do with aid. Given that there are, as already noted above, a \nseries of supply side constraints such as poor infrastructure, weak production capacity and \nlow levels of human resources (Powell 2007: 4) that need to be addressed in any case to \nenable development in ACP countries, together with the adjustment costs that EPAs \nthemselves would entail, aid has always been a part of the negotiations (Griffiths & Powell \n2007: 19). The core funding for supply side issues comes from the European Development \nFund (EDF) but there is evidence that the tenth EDF, from which such funds would come, is \nboth under-funded and will suffer a delayed start in 2010 leaving a two year gap between it \nand the ninth EDF (Powell 2007: 45). The EU has also promised further aid targeted \nspecifically as “aid for trade”, planned to reach €2 billion by 2010.13  However, the issue of \ncontention has been the extent to which such aid is being made conditional on signing EPAs. \nNot surprisingly, the two sides differ – DFID is explicit in stating that the EC‟s position is \nthat “aid for trade is not conditional on EPAs”,14 while those reporting the ACP position are \nequally unequivocal in stating that, “aid is clearly being offered on condition of commitments \nmade in EPAs” (Powell 2007: 45). \n \nWhatever the rights and wrongs of this particular issue, there remains the fact that \nnegotiations over EPAs have become highly contentious and politicised. The effects on \nregional integration, the need for reform in institutional frameworks, the estimated direct \ntrade and fiscal effects of EPAs, together with the introduction or otherwise of the Singapore \nissues and the amount and conditionality of aid, all make for a complex situation where any \nassessments of fairness or unfairness are clearly not straightforward. However, NGOs have \ntraditionally seen their role as cutting through the complexities and running campaigns to \nhighlight what they perceive to be gross injustices. Before turning to issues of fairness, a brief \nlook at the campaign against EPAs is worthwhile. \n \n \nThe “Stop EPAs” campaign \n \nOnce negotiations on EPAs had begun in September 2002 African organisations became \nconcerned at the potential effects of these new agreements and contacted European charities \nto help. In 2004, after two years of detailed analysis, the “Stop EPAs” campaign was born \n(Traidcraft 2008). Since then an orchestrated campaign involving many organisations linked \nto the Trade Justice Movement (TJM),\n15\n has attempted at the very least to ensure that „fair‟ \nEPAs were negotiated or that alternatives such as EBAs and GSP+ were introduced to allow \nmore time for the negotiations over EPAs themselves. It is not clear that the campaign ever \nhad the objective or thought that it might actually “stop EPAs” from occurring, but in the \nnature of NGOs and campaigning a snappy title is more important than accuracy. Similarly, \nthe content of some of the campaigning material expresses the enormous complexity of the \nissue in rather more bite-sized language. A briefing for U.K. MP‟s by the TJM issued in \nSeptember 2007, for example, stated that “If [EPAs] are not changed dramatically in the next \n                                                 \n12\n See www.dfid.gov.uk\/aboutdfid\/organisation\/economic-partnership-agreements-myths.asp, accessed \n12\/12\/08. \n13\n See http:\/\/europa.eu\/scadplus\/leg\/en\/lvb\/r13002.htm, accessed 12\/12\/08. \n14\n See www.dfid.gov.uk\/aboutdfid\/organisation\/economic-partnership-agreements-myths.asp, accessed \n12\/12\/08. \n15\n See http:\/\/www.tjm.org.uk, accessed 12\/12\/08. \n 10 \nfew months, they will threaten the futures of up to 750 million people” – quite what “threaten \nthe futures” means in practice is far from clear.  \n \nThis is not to say that the campaign has not had the intellectual weight behind it that such \ncampaigns deserve – two extensive reports (Griffiths & Powell 2007, Powell 2007) have \nalready been cited from above. One of these reports had as its focus not so much the content \nof the EPA negotiations but the manner in which they have been conducted – an approach \nthat is described as “undermining partnership” (Griffiths & Powell 2007: 13). The claim is \nthat in the dismissive approach to ACP proposals, the disregard for ACP institutions and \nprocesses, the forcing of negotiation on the Singapore issues, the manipulation of the \nprospect of aid, the threat of loss of market access, the refusal to consider alternatives, the \nexclusion of dissenting voices and the imposition of deadlines before development, the EC‟s \nconduct has been far from exemplary. This is an interesting and unusual „process‟ report \nwhich ends by placing the onus on EU states “to rein in the [European] Commission and \ninsist upon a fundamentally different approach, based on non-reciprocity” (ibid.: 31). The \nissue of process is one that we will return to below. \n \n \nEPAs – the current situation \n \nThe situation with regard to which EPAs had been signed was, of course, changing rapidly as \nthe 31\nst\n December 2007 deadline came and passed. The position as of the date of writing in \nDecember 2008 (one year after the supposed deadline), is shown in Appendix 2 where it may \nbe seen that 35 countries in total out of 76 (46%) have signed EPAs. Of these, however, only \n9 out of 39 (23%) are LDCs, whereas 26 out of 37 (70%) non-LDCs have signed. Given the \noption for LDCs to use EBA, making essentially no difference to their previous position \nunder the Cotonou Agreement, it is not surprising that many have opted not to sign. Equally \npredictable is the number of non-LDCs which have signed given that their alternative GSP+ \ngives less favourable access to the EU market and would thus lead to a decline in their export \nearnings. In terms of regional groupings, only the Caribbean has signed in its entirety, but \ngiven the presence of only one LDC (Haiti) in a group of 15 countries this is equally not \nsurprising. \n \nAs noted in Appendix 2, the regional groupings that have signed EPAs are slightly different \nfrom the original groupings with which the EC was negotiating. Thus, seven EPAs have been \nsigned in total.\n16\n Of these, only one – the Caribbean EPA – is considered to be a full or \ncomprehensive EPA by the EC. The Caribbean EPA includes not just provisions for trade in \ngoods, which were, of course, essential to comply with WTO rules, but services, investment, \ncompetition and public procurement aspects – in other words the contentious “Singapore” \nissues. The remaining six EPAs are regarded as “interim” in that they focus on goods only, \nbut mostly include clauses to allow negotiations to continue on these other areas.\n17\n These \n                                                 \n16\n The seven are: West Africa (Ghana, Ivory Coast); Central African Economic and Monetary Community \n(Cameroon); East African Community (Burundi, Kenya, Rwanda, Tanzania and Uganda); East and Southern \nAfrica (Comoros, Madagascar, Mauritius, Seychelles and Zimbabwe); Southern African Development \nCommunity (Botswana, Lesotho, Mozambique, Namibia and Swaziland); Caribbean (all countries – see \nAppendix 1); Pacific (Fiji and Papua New Guinea), www.dfid.gov.uk\/aboutdfid\/organisation\/epas-progress-\nupdate.asp, accessed 12\/12\/08. \n17\n See www.dfid.gov.uk\/aboutdfid\/organisation\/epas-progress-update.asp, accessed 12\/12\/08. An alternative \nweb-site for regular up-dates can be found at www.acp-eu-trade.org. See also \nhttp:\/\/ec.europa.eu\/trade\/issues\/bilateral\/regions\/acp\/regneg_en.htm. \n \n 11 \nInterim EPAs (IEPAs) have only been initialled rather than signed – an important difference \nsince although the negotiations have come to a conclusion there is still a formal ratification \nprocess to be undertaken. \n \nIn a recent assessment of the legal texts of the EPAs that have been signed or initialled \n(Oxfam 2008), it is claimed that these are not development friendly. While the actual impact \non those countries which have not signed EPAs at present has been small (ibid.: 8), the \nprojected effects of EPAs themselves are generally felt to be against the interests of ACP \ncountries. The liberalisation of goods is higher than Europe originally proposed, at between \n67% and 83% of trade, although the timescales vary between 0 and 25 years (ibid.: 14). \nRegional disintegration is predicted (ibid.: 17), and ACP countries will be left worse off \nfinancially with a need for significant aid to upgrade basic infrastructure (ibid.: 19). The \nconclusion is that the initialled EPA deals “fail the „development test‟. Far from restructuring \neconomic relationships to stimulate development, they risk locking ACP countries into \ncurrent patterns of inequality and marginalisation, and further bias the multilateral trading \nsystem against the interests of developing countries” (ibid.: 34). While much of this is \nfamiliar from the earlier discussions, it is of note that Oxfam calls for “renegotiation of any \naspect of the initialled EPAs … to reduce the deals to the minimum needed for WTO \ncompliance” (ibid.: 38). Despite the 31st December 2007 deadline, the initialling process \nseems to have bought time with the WTO, and may now allow the opportunity for further \nnegotiations. \n \n \nAssessing fairness in international trade \n \nAs noted at the outset, the inherent complexity of the situation described above rules out any \nsimplistic application of fairness principles. So, we begin by looking at fairness principles \nthemselves to see what light might be shed by such a review, before turning to their \napplication. And while fairness has, of course, been the subject of much philosophical debate \nin general, it has also been the subject of discussion specifically in relation to international \ntrade (Brown & Stern 2007, Davidson et al. 2006, de Jasay 2006, Franck 1995, Maseland & \nde Vaal 2002; 2003, Narliker 2006, Ochieng 2007, Suranovic 2000). Much of this originates \nin the economics literature, from which three points are worth noting immediately. The first \nis that economists frequently “dismiss notions of rights, justice and fairness as, at best, \nmuddled, and more likely welfare worsening” and that the most characteristic normative \nmethod adopted by economists is “straightforward individualistic utilitarian \nconsequentialism” (Davidson et al. 2006: 989). This „free market‟ position, of course, lends \nstrong support to trade liberalisation and opposes protectionism in all its forms. And \nprotectionism is the second point worthy of note, for „fair trade‟ is often contrasted with „free \ntrade‟ to denote protectionism which seeks to mitigate the effects of international competitors \non domestic industries (see, for example, Bhagwati 1995, Maseland & de Vaal 2002, Howse \n& Trebilcock 1996). This understanding of fair trade gives rise to the view that fair traders \nare “charlatans (protectionists masquerading as moralists)” (Howse & Trebilcock 1996: 61). \n \nHowever, while we can dismiss this particular use of the term fairness, it is clear that issues \nof fairness do play “a non-trivial role in the politics of trade policy” (Davidson et al. 2006: \n990) so that questions such as, “Is it fair for all countries to be held to the same set of \nstandards when these countries are at different levels of economic development?”, or “What \n                                                                                                                                                        \n \n 12 \nare fair responses to the imminent changes in world trading patterns?” (Suranovic 2000: 283), \nor of direct relevance to this chapter, “Are EPAs fair?”, are entirely legitimate. And the third \npoint to note stems from this. As Franck (1995) has observed, for any discourse on fairness to \ntake place, two preconditions must exist. The first is moderate scarcity: “Discussion about \nfairness … is most likely to be productive when the allocation of rights and duties occurs in \ncircumstances which make allocation both necessary and possible. This circumstance … John \nRawls has aptly called a condition of „moderate scarcity‟” (ibid.: 9). The second precondition \nis community: “It is only in community that the bedrock of shared values and developed \nprinciples necessary to any assessment of fairness is found” (ibid.: 10). And in Franck‟s view \n“we are witnessing the dawn of a new era, defined both by moderate scarcity and by an \nemerging sense of global community” (ibid.: 11). In other words, the preconditions are now \nmet and the time is right for substantive discussion about fairness in international trade. \n \nWith this as background, we can turn to fairness principles themselves. And we find, not \nsurprisingly, that these divide into the conventional distinction between procedural and \ndistributive fairness – although „justice‟ is often used instead of fairness, a point to which we \nwill return. That fairness has two dimensions – the process by which outcomes are derived \nand the outcomes themselves – is, of course, a common-place, but it is worth exploring some \nof the nuances that emerge within this distinction.  \n \nOn the procedural side, Suranovic (2000), amongst the seven fairness principles that he \nderives,\n18\n gives four that relate to procedural fairness. These are non-discrimination fairness \n(where, if one group is allowed to take some action, then all other groups deemed to be equal \nshould be similarly allowed – ibid.: 288); Golden Rule fairness (based on Kant‟s categorical \nimperative, where an agent should take some action which has an effect on another only if \nthat agent is willing to have another agent take a comparable action with the identical effect \non himself  – ibid.: 291); and positive and negative reciprocity fairness (where agents \nexchange either positive „you scratch my back and I‟ll scratch yours‟, or negative „tit for tat‟ \nactions – ibid.: 295, 299). Brown & Stern (2007: 299-302) also discuss reciprocity noting \nthat, understood as “rough equivalence”, it remains an important criterion for negotiations in \ninternational trade. \n \nMaseland & de Vaal (2002) make a distinction of fairness along deontological versus \nconsequentialist grounds, the latter of which we will return to under distributive fairness, but \nthe former of which is worth noting now. Essentially it is to do with the “conditions under \nwhich trade, and the production of traded goods, should minimally take place” (ibid.: 254). In \na later paper they refer to this as “principle” fairness (Maseland & de Vaal 2003) and identify \nit as being trade conducted in compliance with designated basic prohibitions such as the \nabsence of child labour or environmentally harmful production methods. They note that, \nwhile free trade can lead to the absence of such conditions, for instance because it raises \nincomes, it lacks a self-regulating mechanism to ensure such conditions are met. It therefore \nseems appropriate to categorise it here, under procedural fairness, because of the procedural \nrequirements to enforce such compliance and because the overall outcome that follows may \nnot necessarily be efficient – a distributive matter. \n \nLegitimacy fairness is another way of describing procedural fairness (Franck 1995: 7-8, \nNarlikar 2006: 1007-8), a point that Elsig (2007: 81) using the term “input legitimacy” makes \n                                                 \n18\n Suranovic (2000) divides these seven into two categories: equality fairness and reciprocity fairness. I will \ncover six of the seven here, the seventh being privacy fairness – “an agent should be free to take any action \nwhich has effects only on himself” (ibid.: 301) \n 13 \nin relation to the WTO, and to which we will also return. Meanwhile, Brown & Stern refer to \n“equality of opportunity” as a procedural issue noting, however, that they do not advance it as \na high moral principle but merely an “instrumental criterion to be valued for its \nconsequences, namely that it facilitates the reaching of inter-governmental agreements that \nprotect and enhance the mutually advantageous trading system” (2007: 295). This \nrelationship between the two forms of fairness is also something to which we will need to \nreturn. \n \nOn the distributive side many of the authors already cited note the importance of outcomes \nfor fairness assessments (Brown & Stern 2007, Maseland & de Vaal 2002; 2003, Narlikar \n2006, Ochieng 2007, Suranovic 2000) and it is in relation to this discussion that economists \nrefer to the concepts of welfare efficiency and Pareto optimality: \n \n “For many economists – borrowing from welfare theory – a practically acceptable \ncriterion of fairness would be that the trade negotiations result in a more efficient \nglobal economy. Greater efficiency is defined as a movement towards Pareto \noptimality and, in the context of international trade, such a state would be reached \nwhen no country can be made better off without some other country being made \nworse off” (Brown & Stern 2007: 296). \n \nAn alternative expression of this is to refer to “maximum benefit fairness” (Suranovic 2000: \n302-4), in which the utilitarian rhetorical device of “the greatest good for the greatest \nnumber” is, in effect, applied irrespective of the consequences for affected minorities. \n \nHowever, another distributional principle that is included in the literature is perhaps best \ntermed “poverty alleviation fairness” (Maseland & de Vaal 2003) and is one in which \n“beneficial consequences for the poorest groups in the world” (Maseland & de Vaal 2002: \n256) are to be taken into account. As Maseland & de Vaal note, this concept draws on \nRawlsian thinking and attempts to combine Pareto optimality with the idea that “the only \ninequality a rational individual would accept is the minimum inequality necessary to improve \nthe situation of the least well off in society” (ibid.: 256). Franck refers to this as the \n„maximin‟ principle (1995: 18-19) and notes that it is a neo-egalitarian principle of \ndistributive fairness. In relation to the fairness of EPAs this will clearly be an important \nconcept, but is also one that acknowledges the “unequal starting positions” (Maseland & de \nVaal 2003) of different countries. While a Nozickian approach would ignore such \ninequalities, it would seem to be very much to the point that they be included in any \nconsideration of the fairness of international trade. This is not to argue for a socialist \nredistribution of input factors (even were that to be possible), but for negative consequences \nof inequalities to be at least taken into account (see Maseland & de Vaal 2002: 255-6). \n \nAn attempt at resolving the terminological issue that we noted above between fairness and \njustice is made by de Jasay (2006). He argues, in effect, that justice refers to procedural \nissues, while fairness refers to outcomes. On this basis (one that is by no means universal) he \nis able to argue that trade made fair by regulation violates freedom of contract and as such is \nan injustice (ibid.: 175-6). In other words, fair is not, or is not necessarily, just (and vice-\nversa). While we do not particularly need to follow the terminology here, the point is \nimportant – that procedural and distributive fairness do not necessarily follow one another \nwith one leading automatically to the other, but are different aspects of fairness which may \nnot coincide (Franck 1995: 22). Franck makes the further point that they may not even pull in \n 14 \nthe same direction, since distributive fairness is likely to lead to change, whereas procedural \nfairness tends towards stability (ibid.: 7).  \n \nHowever, it is often the case that both forms of fairness are needed if true fairness is to result \n– Elsig (2007), for example, refers to the need to balance what he calls input and output \nlegitimacy in the WTO. Stiglitz & Charlton‟s set of principles (cited in Brown & Stern 2007: \n312-3), in relation to the Doha Development round of the WTO, provide a further example. It \nis clear that the first two are to do with distributive fairness while the last two are procedural \nin nature: \n \n1. Any agreement should be assessed in terms of its impact on development; items with \na negative effect on development should not be on the agenda; \n2. Any agreement should be fair (i.e. that the outcome should provide a larger share of \naggregate benefits to the poorer countries); \n3. Any agreement should be fairly arrived at; \n4. Any agreement should be limited in scope (i.e. preventing unwarranted intrusions into \nnational sovereignty). \n \nWhile this completes a brief summary of fairness principles as covered in the relevant \nliterature, there is one further and important area that we need to consider before we turn to \nan assessment of the fairness of EPAs. In some ways this takes us back to one of the two \npreconditions that Franck identified – that it is “only in community that the bedrock of shared \nvalues and developed principles necessary to any assessment of fairness is found” (Franck \n1995: 10). The question that this raises is really an Aristotelian one, and so differs from the \nEnlightenment concepts of fairness discussed so far, and over which perhaps limited \nagreement can be reached.  \n \nThe Aristotelian question is always to do with what makes for the flourishing of life as a \nwhole both individually and in community. It therefore asks questions of purpose and \nrelationship and is, in that sense, essentially teleological. Modern work on virtue ethics, as it \nis known (MacIntyre 2007), and as applied at the level of business organisations rather than \ntrade per se (Moore & Beadle 2006, Moore 2009) focuses on such a teleological approach \nand encourages the pursuit of excellence rather than the “levelling tendency” that \ndeontological ethics has been charged with (Koehn 1995: 537). In terms of something \nessentially practical like the negotiation of EPAs this will encourage us to ask what the \npurpose of such agreements are, how they support and benefit community both within \ndeveloping countries and between developing and developed countries, and what excellence \nmeans in this context. It is probably apparent that questions such as these take us beyond the \nconventional approaches to ethics via the fairness discourse, but also that they have \nsomething in common with the teleological approach to interpretation of WTO laws taken by \nACP countries, as noted above. \n \n \nAn assessment of the fairness of EPAs \n \nFrom all that has been said above, it will come as no surprise that the fairness assessments \nthat can be made are somewhat tentative. But the reasons for such tentativeness will be \nbecome clearer as we proceed, so we begin by considering issues of procedural fairness. The \nmost extensive consideration of this is given in Griffith & Powell (2007), covered above in \nthe “Stop EPAs” section. In “undermining partnership” through the eight procedural issues \n 15 \nthat were identified, in all of which the EC was regarded as being at fault, procedural fairness \nseems to have been compromised by the EC. That, at first sight, might seem a straightforward \nand incontrovertible judgment. \n \nHowever, in considering WTO negotiations in general (of which EPAs can be viewed in this \ncontext as a separate but inter-related part), the situation becomes less clear-cut. Narlikar \n(2006: 1009) argues that the WTO has, in general, paid limited homage to the fairness \ndiscourse but “particularly its distributive justice component”. In other words, the WTO, \nwhere it has included fairness considerations, has focused on procedural fairness, and has \ndone so partly because any notion of redistributive justice through global trade has sat \nuneasily with “more liberal trade principles” and “with the national interests of already \ninstitutionalised countries” (Ochieng 2007: 389). Narlikar reinforces this point: “even if \nprovisions in the WTO on distributional fairness are few, … its dedication to fair process, \norder and legitimacy is borne out in its rules of non-discrimination and reciprocity” (2006: \n1009). The concerns of the EC in ensuring that EPAs were WTO-compatible, and awareness \nof the procedural unfairness associated with the fact that such non-reciprocal agreements \ndiscriminated against non-ACP states, are further evidence of this approach. \n \nOchieng notes that even by the early 1990s “developing countries had been forced to change \ntack, toning down on the notion of fairness of outcomes and moving towards accommodating \nthe fairness of process concept (even whilst complaining that WTO processes were not fair to \nthem)” (Ochieng 2007: 389, emphasis in original). It seems, therefore, that developing \ncountries might have been better prepared for negotiating on EPAs, having accepted that this \nwould be the focus of the EC in such negotiations. Being better prepared might have helped \nthe ACP countries to negotiate more forcefully and within the reasonable time periods laid \ndown in the Cotonou Agreement. \n \nAccepting that ACP countries might have expected the EC to focus on procedural issues does \nnot, however, mean that they would or should have abandoned their interest in distributive \nfairness. Narlikar (2006: 1028), indeed, suggests that developing countries generally have had \nsome success in maintaining a focus on distributive fairness and that this may lead to the \nreintroduction of the fairness-as-equity discourse into the WTO, with the Doha Development \nAgenda as an indicator of this. Elsig, however, recognises the link between the two forms of \nfairness arguing that “the input side should not be neglected as the belief in fair processes \npotentially increases the rate of compliance with negotiated treaties, thus increasing output \nlegitimacy” (2007: 89). \n \nHowever, allowing for the continuing asymmetries in the WTO and the continuing \ncomplaints of the developing countries over equity of process (Narlikar 2006: 1024-5), and \ntherefore their likely extension into negotiations over EPAs, it seems probable that procedural \nfairness has been compromised during the process. The attempt (and success with the \nCaribbean grouping) to bring the Singapore issues onto the agenda, and the attempt to \nintroduce conditionality on aid strengthens the suspicion that EPAs have not been fairly \nnegotiated. \n \nWhat, then, of distributive fairness? While, of course, the judgment in this case has to be \ntentative until actual outcomes are known, the evidence cited above in relation to the likely \nnegative impact on regional integration especially in Africa; on the timing of the introduction \nof EPAs in relation to the poor institutional quality which is likely to mean, again, that \nAfrican countries are not in a position to benefit from trade liberalisation; and the more \n 16 \ngeneral trade and fiscal effects, all suggest that the distributive outcomes will not benefit \nACP countries.  \n \nThe counter argument to this, however, is the potential distributive unfairness that non-ACP, \nnon-LDC countries have been experiencing (following the procedural unfairness noted \nabove) – and hence the reason that they have been watching the EPA negotiations “like \nhawks” (Mandelson 2007, cited above) and might mount a legal challenge under Article \nXXIV. The EU countries, and on their behalf the EC, have, they would argue, been \nnegotiating on EPAs in order to ensure that a WTO-compatible legal basis on which \ncontinuing preferential treatment of ACP countries could be provided. It is not their fault, \nthey can argue, that the WTO requires reciprocity on substantially all trade within a \nreasonable period. In addition, the extended time periods (at least 10 years and possibly up to \n25 – see above) allowable within EPAs for SAT to be realised would, the EU states might \nwell argue, give both sufficient time and incentive to resolve the institutional development \nand other issues.  \n \nThat it is in both the developing and developed countries‟ interests ultimately to make \nsignificant progress on trade liberalisation is something both sides can probably agree on. \nThat EPAs are necessary in this is something developing countries, with the exception of the \nCaribbean grouping, are clearly more reluctant to agree on. That EPAs are likely to lead to \nappropriate and substantive development, and therefore to distributive fairness, is something \nthat the two sides are, again with the possible exception of the Caribbean grouping, at odds \nover and only time will tell which side is right. \n \nWithin this debate, however, the issues of community and purpose, the Aristotelian questions, \nseem rarely to get asked, with sides being taken and personal advantage being sought. This \ntakes us back to the different interpretations of WTO laws discussed in the background \nsection above. Here, it would seem that the ACP‟s teleological approach is the more \nappropriate. The ACP states see the WTO as developmentally oriented while the EC and \nother developed countries see it as solely a trade organisation. Although not explicit, it could \nbe argued that the ACP countries see the “dawn of a new era” characterised by “an emerging \nsense of global community” (Franck 1995: 11, cited above), and would argue for notions of \nexcellence in international trade to emerge. Such excellence might well include the flexibility \nnecessary to recognise the different starting positions and speed of development that \ndeveloping countries in general, and LDCs in particular, are capable of, and to design \nprocesses that would allow such flexibility – a key point of concern noted on a number of \noccasions above. To achieve this flexibility, while still enabling regional integration, is \nobviously no simple task, but one that excellent trade negotiations and outcomes ought to \nseek. \n \nPerhaps, a more genuine attempt by the EC to take a developing country perspective, to seek \nto realise the purpose of EPAs and the Doha Development Round more generally as to do \nwith sustainable development as we try to learn to live together on one earth, and to effect \nthat through more community-minded initiatives that extend, if necessary, to other non-ACP \ncountries, might have led not only to a process that was more acceptable to ACP countries \nbut one in which the outcomes are more likely to be developmentally good. The opportunity \nfor further negotiations may yet lead to such an outcome. \n \n \nConclusion \n 17 \n \nI indicated at the outset that the conclusions that could be drawn would necessarily be \nsomewhat tentative. It is difficult to be conclusive in such a fast-moving and complex area. \nHowever, while the evidence is generally against the EC and, behind it, the EU states, it does \nseem that both „sides‟ may have lessons to learn from EPAs over both the process of \nnegotiating and the outcomes that are sought, even though the actual outcomes may in some \ncases be many years away from being realised. The existing conceptualisations of fairness, \nbased on Enlightenment principles, provide a basic mechanism by which such fairness claims \ncan be examined, but they do not take sufficient account of the purposive and community \naspects of international trade negotiations. Perhaps here, as EPAs continue to be negotiated \nand these agreements are implemented, there is a chance for something developmentally \nbeneficial to emerge. This will require the EC to focus more on distributive fairness, and \naccept the changes that will necessarily accompany this, rather than rely upon the stability \nthat arises from procedural fairness considerations. \n \nWithin this, there is a potential knock-on effect on the WTO itself. As Ochieng concludes, \n“development-oriented EPAs will require not only innovations in their design and scope but \nalso innovative interpretation of existing WTO rules or innovations to some of the existing \nWTO rules, most notably, Article XXIV and a wide array of other SDT provisions” (2007: \n395). Hence, one of the benefits of EPAs may be to challenge the WTO and the EU‟s \nconservative interpretation of its purpose, and lead to international trade that is, indeed, not \njust procedurally fair in its negotiation and distributively fair in its implementation, but also \ngenuinely develops the global community.\n 18 \nAppendix 1 \nACP Countries by regional groupings \n \n \n  ECOWAS CEMAC ESA SADC Caribbean Pacific \n1 \n \nBenin Cameroon Burundi Angola \nAntigua & \nBarbuda \nCook Is. \n2 Burkina Faso \nCentral African \nRepublic \nComoros Botswana Bahamas \nFed. \nMicron. \n3 \n \nCape Verde Chad Djibouti Lesotho Barbados Fiji \n4 Gambia \nCongo \n(Brazzaville) \nEritrea Mozambique Belize Kiribati \n5 Ghana \nCongo (Dem. \nRep.- \nKinshasa) \nEthiopia Namibia Dominica Marshall Is. \n6 Guinea \nEquatorial \nGuinea \nKenya Swaziland \nDominican \nRep. \nNauru \n7 \nGuinea-\nBissau \nGabon Malawi Tanzania Grenada Niue \n8 Ivory Coast \nSao Tome & \nPrincipe \nMauritius South Africa Guyana Palau \n9 \n \nLiberia  Madagascar  Haiti \nPapua New \nGuinea \n10 \n \nMali  Rwanda  Jamaica Samoa \n11 \n \nMauritania  Seychelles  \nSt. Kitts & \nNevis  \nSolomon Is. \n12 \n \nNiger  Sudan  St Lucia Tonga \n13 \nNigeria \n \n Uganda  \nSt Vincent & \nthe \nGrenadines \nTuvalu \n14 \n \nSenegal  Zambia  Surinam Vanuatu \n15 Sierra Leone  Zimbabwe  \nTrinidad & \nTobago \n \n16 \n \nTogo      \nNo. \nLDCs \n13 5 11 4 1 5 \n  \nNote:  Countries in italics are Least Developed Countries (LDCs) – 39 out of a total of 76. \n \nSources: http:\/\/ec.europa.eu\/trade\/issues\/bilateral\/regions\/acp\/plcg_en.htm, accessed 12\/12\/08 \nwww.dfid.gov.uk\/aboutdfid\/organisation\/epas-progress-update.asp, accessed \n12\/12\/08, and Lang 2006: 36-38. \n \nKey \nECOWAS Economic Community of West African States \nCEMAC Economic and Monetary Community of Central Africa \nESA  Eastern and Southern Africa \n 19 \nSADC  Southern African Development Community\n 20 \nAppendix 2 \n \nSignatories to Economic Partnership Agreements \n \n \n  ECOWAS CEMAC ESA SADC Caribbean Pacific \n1 \n \nGhana Cameroon Burundi Botswana \nAntigua & \nBarbuda \nFiji \n2 Ivory Coast  Comoros Lesotho Bahamas \nPapua New \nGuinea \n3 \n \n  Kenya Mozambique Barbados  \n4   \nMauritius \n \nNamibia Belize  \n5   \nMadagascar \n \nSwaziland Dominica  \n6   Rwanda Tanzania \nDominican \nRep. \n \n7   \nSeychelles \n \n \nGrenada \n \n \n8   Uganda  \nGuyana \n \n \n9 \n \n  Zimbabwe  Haiti  \n10 \n \n    Jamaica  \n11 \n \n    \nSt Kitts & \nNevis \n \n12 \n \n    St Lucia  \n13     \nSt Vincent & \nthe \nGrenadines \n \n14 \n \n    Surinam  \n15     \nTrinidad & \nTobago \n \n16 \n \n      \nNo. LDCs \n \n0 0 5 3 1 0 \n  \nNote:  Countries in italics are Least Developed Countries (LDCs). Only 9 from a possible \n39 LDCs have signed EPAs; for non-LDCs the number is 26 from 37. \n \nSource: http:\/\/ec.europa.eu\/trade\/issues\/bilateral\/regions\/acp\/regneg_en.htm, accessed \n12\/12\/08. The web-site gives slightly different groupings from those shown in \nAppendix 1. For ease of comparison, the same groupings are maintained.  \n. \n 21 \nReferences \n \nAnderson, K. & D. van der Mensbrugghe (2007). Effects of multilateral and preferential trade \npolicy reform in Africa: the case of Uganda. Journal of International Trade & Economic \nDevelopment, 16(4), 529-550. \n \nBhagwati, J. (1995). Trade liberalisation and „Fair Trade‟ demands: addressing the \nenvironmental and labour standards issues. World Economy, 18(6), 745-759. \n \nBorrmann, A. & M. Busse 2007. The institutional challenge of the ACP \/ EU Economic \nPartnership Agreements. Development Policy Review, 25(4), 403-416. \n \nBrown, A.G. & R.M. Stern 2007. Concepts of Fairness in the Global Trading System. Pacific \nEconomic Review, 12(3), 293-318. \n \nBunting, M. 2007. The EU is bullying the world‟s poor to rush into a dubious deal on trade. \nThe Guardian, 19\/11\/07. \n \nBusse, M. & H. Grossmann 2007. The trade and fiscal impact of EU \/ ACP Economic \nPartnership Agreements on West African countries. Journal of Development Studies, 43(5), \n787-811. \n \nCobham, A. & S. Powell 2007. The EU is trying to trick developing countries into poor trade \ndeals. The Guardian, 8\/11\/07. \n \nDavidson, C., S. Matusz & D. Nelson 2006. Fairness and the political economy of trade. \nWorld Economy, 29(8), 989-1004. \n \nDe Jasay, A. 2006. When fair is not just and just is not fair. The Independent Review, 11(2), \n165-176. \n \nElsig, M. 2007. The World Trade Organization‟s legitimacy crisis: what does the beast look \nlike? Journal of World Trade, 41(1), 75-98. \n \nFranck, T. 1995. Fairness in International Law and Institutions. Oxford: Clarendon Press. \n \nGriffith, M. & S. Powell 2007. Partnership under pressure. An assessment of the European \nCommission’s conduct in the EPA negotiations. London: ActionAid, CAFOD, Christian Aid, \nTearfund, Traidcraft Exchange. \n \nHowse, R. & M. Trebilcock 1996. The Fair Trade – Free Trade debate: trade, labour and the \nenvironment. International Review of Law and Economics, 16(1), 61-79. \n \nIDC 2007. EU Development and Trade Policies: an update, International Development \nCommittee, London: House of Commons. \n \nKoehn, D. 1995. A role for virtue ethics in the analysis of business practice. Business Ethics \nQuarterly, 5(3), 533-539. \n \n 22 \nLang, R. 2006. Renegotiating GATT Article XXIV – a priority for African countries engaged \nin North-South trade agreements, Work in Progress No. 33, Africa Trade Policy Centre, \nEconomic Commission for Africa. \n \nMacIntyre, A. 2007 [1981]. After Virtue, 3rd ed. London: Duckworth. \n \nMandelson, P. 2007. Comments by Peter Mandelson to the European Parliament \nDevelopment Committee on EPAs, Doha trade talks, Brussels, 5 November, \nhttp:\/\/ec.europa.eu\/commission_barroso\/mandelson\/speeches_articles\/sppm177_en.htm, \naccessed 12\/12\/08. \n \nMaseland, R. & A. de Vaal 2002. How fair is Fair Trade? De Economist, 150, 251-272. \n \nMaseland, R. & A. de Vaal 2003. Fairness in International Trade. Paper presented \nat the International Conference “Managing on the Edge” , Nijmegen, University of \nNijmegen. \n \nMoore, G.: 2009, „Virtue ethics and business organizations‟. In J. Smith (ed.) Normative \nTheory and Business. Lanham MD: Rowman and Littlefield. \n \nMoore, G. & R. Beadle 2006. In search of organizational virtue in business: agents, goods, \npractices, institutions and environments. Organization Studies 27(3), 369-389. \n \nNarlikar, A. 2006. Fairness in international trade negotiations: developing countries in the \nGATT and WTO. World Economy, 29(8), 1005-1029. \n \nOchieng, C. 2007. The EU-ACP Economic Partnership Agreements and the „Development \nQuestion‟: constraints and opportunities posed by Article XXIV and Special and Differential \nTreatment provisions of the WTO. Journal of International Economic Law, 10(2), 363-395. \n \nOxfam 2008. Partnership or Power Play? How Europe should bring development into its \ntrade deals with African, Caribbean and Pacific countries. Oxford: Oxfam International. \n \nPowell, S. 2007. Economic Partnership Agreements: building or shattering African regional \nintegration? London: EcoNews Africa, Seatini, Traidcraft Exchange. \n \nRoss, W. 2007. Africans wary of Europe‟s trade offer, BBC News, 8\/12\/07, \nhttp:\/\/news.bbc.co.uk\/1\/hi\/world\/africa\/7134407.stm, accessed 10\/12\/07. \n \nStevens, C. 2006. The EU, Africa and Economic Partnership Agreements: unintended \nconsequences of policy leverage. Journal of Modern African Studies, 44(3), 441-458. \n \nSuranovic, S. M. 2000. A positive analysis of fairness with applications to international trade. \nWorld Economy, 23(3), 283-307. \n \nTraidcraft 2008. Economic Partnership Agreements; the fight for trade justice goes on. The \nMagazine, Spring 2008, Traidcraft: Gateshead, 10-11. \n"}