{"doi":"10.1016\/S1003-6326(10)60629-2","coreId":"196587","oai":"oai:lra.le.ac.uk:2381\/8776","identifiers":["oai:lra.le.ac.uk:2381\/8776","10.1016\/S1003-6326(10)60629-2"],"title":"A Review on Steel Thixoforming","authors":["Rassili, Ahmed","Atkinson, Helen V."],"enrichments":{"references":[{"id":44779083,"title":"0745694A1, Method and apparatus of shaping semisolid metals, UBE Industries,","authors":[],"date":"1996","doi":null,"raw":"European Patent 0745694A1, Method and apparatus of shaping semisolid metals, UBE Industries, 1996.","cites":null},{"id":44779082,"title":"Cast Metals Research,","authors":[],"date":"2004","doi":"10.1179\/ijc.2004.17.3.129","raw":"PAHLEVANI F, NILI-AHMADABADI M. [J]. Int. J. Cast Metals Research, 2004, 17, 157-61.","cites":null},{"id":44779081,"title":"CIRP Annals-Manufacturing Technology,","authors":[],"date":"2005","doi":"10.1016\/s0007-8506(07)60097-3","raw":"HIRT G, SHIMAHARA H, SEIDL I, KUTHE F, ABEL D, SCHONBOHM A. [J]. CIRP Annals-Manufacturing Technology, 2005, 54, 257-60.","cites":null},{"id":44779080,"title":"European patent No. 0305375 Thixotropic RASSILI Ahmed, et al\/Trans.","authors":[],"date":"2010","doi":null,"raw":"KIRKWOOD D H. [P]. European patent No. 0305375 Thixotropic RASSILI Ahmed, et al\/Trans. Nonferrous Met. Soc. China XX (2010) sYYY materials, 1988.","cites":null},{"id":44779085,"title":"Improvement of Materials and Tools for Thixoforming of Steels’.","authors":[],"date":"2004","doi":null,"raw":". ’Improvement of Materials and Tools for Thixoforming of Steels’. Proc. 8th Int. Conf. on Semi-Solid Processing of Alloys and Composites S2P, September 2004, Cyprus, published on CD-ROM.","cites":null},{"id":44779086,"title":"In fact this paper has been referenced incorrectly on Web of Science and should have as authors RASSILI,","authors":[],"date":null,"doi":null,"raw":"AHMED R., MARC, R., REGIS, B. (In fact this paper has been referenced incorrectly on Web of Science and should have as authors RASSILI, A., ROBELET, M., BIGOT, R.,) [C]. op. cit. [13] 213-8.","cites":null},{"id":44779089,"title":"Material Wissenschaft und Werkstofftechnik,","authors":[],"date":"2006","doi":"10.1002\/mawe.200600997","raw":"MUNSTERMANN S, TELLE R. [J]. Material Wissenschaft und Werkstofftechnik, 2006, 37, 324-8.","cites":null},{"id":44779084,"title":"Modelling Semi-Solid Processing, Shaker Verlag Aachen,","authors":[],"date":"2008","doi":null,"raw":"ATKINSON H V. [B] (Ed.), Modelling Semi-Solid Processing, Shaker Verlag Aachen, 2008.","cites":null},{"id":44779090,"title":"RASSILI A [C].","authors":[],"date":"2010","doi":"10.1007\/s12289-010-0889-7","raw":"ATKINSON H V, RASSILI A [C]. Proc. 13th ESAFORM Conference April 7-9, 2010, Brescia, Italy, publ. Springer on CD-ROM.","cites":null},{"id":44779087,"title":"RASSILI Ahmed, et al\/Trans. Nonferrous Met. Soc. China XX","authors":[],"date":"2010","doi":null,"raw":"SCHONBOHM A, GASPER R, ABEL D. [C]. op. cit.[27]734-7. RASSILI Ahmed, et al\/Trans. Nonferrous Met. Soc. China XX (2010) sYYY","cites":null},{"id":44779088,"title":"Thesis, « la robustesse du procédés de thixoformage des aciers »,","authors":[],"date":"2009","doi":null,"raw":"PIERRET J C, PhD Thesis, « la robustesse du procédés de thixoformage des aciers », Editions University of Liège, 2009.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-09-29","abstract":"Steel is a particularly challenging material to semi-solid process because of the high temperatures involved and the potential for surface oxidation. Here the experience of semi-solid processing will be reviewed and the current situation in relation to commercial application assessed. The review will include discussion of the range of potential steel materials which are amenable to thixoformingn and identification of suitable steels; modelling of die fill and rheological properties of semi solid steel; technology considerations for industrialisation; die development and the properties of thixoformed products","downloadUrl":"http:\/\/www.elsevier.com,","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/8776\/1\/S2P2010A%20Review%20on%20Steel%20Thixoforming_ARHVA%20%282%29.pdf","pdfHashValue":"0c28de3465d9f01fe77065ab4e9f11b6d1a24d18","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/8776<\/identifier><datestamp>\n                2015-12-14T16:45:36Z<\/datestamp><setSpec>\n                com_2381_171<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_835<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nA Review on Steel Thixoforming<\/dc:title><dc:creator>\nRassili, Ahmed<\/dc:creator><dc:creator>\nAtkinson, Helen V.<\/dc:creator><dc:subject>\nSteel<\/dc:subject><dc:subject>\nThixoforming<\/dc:subject><dc:subject>\nsemi-solid<\/dc:subject><dc:subject>\nindustrialisation<\/dc:subject><dc:description>\nSteel is a particularly challenging material to semi-solid process because of the high temperatures involved and the potential for surface oxidation. Here the experience of semi-solid processing will be reviewed and the current situation in relation to commercial application assessed. The review will include discussion of the range of potential steel materials which are amenable to thixoformingn and identification of suitable steels; modelling of die fill and rheological properties of semi solid steel; technology considerations for industrialisation; die development and the properties of thixoformed products.<\/dc:description><dc:date>\n2010-11-15T13:22:46Z<\/dc:date><dc:date>\n2010-11-15T13:22:46Z<\/dc:date><dc:date>\n2010-09-29<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nTransactions of Nonferrous Metals Society of China, 2010, 20 (s3), pp. s1048-s1054<\/dc:identifier><dc:identifier>\n1003-6326<\/dc:identifier><dc:identifier>\nhttp:\/\/www.sciencedirect.com\/science\/article\/pii\/S1003632610606292<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/8776<\/dc:identifier><dc:identifier>\n10.1016\/S1003-6326(10)60629-2<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author’s final draft of the paper published as Transactions of Nonferrous Metals Society of China, 2010, 20 (s3), pp. s1048-s1054.  The final published version is available at http:\/\/www.elsevier.com, Doi: 10.1016\/S1003-6326(10)60629-2.<\/dc:rights><dc:publisher>\nElsevier<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1003-6326","1003-6326"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Steel","Thixoforming","semi-solid","industrialisation"],"subject":["Article"],"fullText":"  \n \n \nA Review on Steel Thixoforming \n \nRASSILI Ahmed, ATKINSON Helen \n \nThixo Unit, University of Liege, Sart Tilman, B-4000 Liege, Belgium \nDepartment of Engineering, University of Leicester, University Rd., Leicester, UK  \n                                                                                                  \n \nAbstract：Steel is a particularly challenging material to semi-solid process because of the high temperatures involved and the \npotential for surface oxidation. Here the experience of semi-solid processing will be reviewed and the current situation in relation to \ncommercial application assessed. The review will include discussion of the range of potential steel materials which are amenable to \nthixoformingn and identification of suitable steels; modelling of die fill and rheological properties of semi solid steel; technology \nconsiderations for industrialisation; die development and the properties of thixoformed products. \n \nKeywords: Steel; Thixoforming; semi-solid; industrialisation \n                                                                                                              \n \n \n1 Introduction \n \nFor successful thixoforming [1], the microstructure in \nthe semi-solid state must consist of spheroids of solid in \na liquid matrix. The material then behaves thixotropically \ni.e. when it is sheared it flows but when allowed to stand \nit thickens again. This microstructure may not be \nnecessarily be present in the raw material but could be \nobtained after re-heating. The thixoforming process is \nbaptized Thixoforging when the solid fraction is high and \nthixocasting when the solid fraction is low. The Flemings \ngroup experimented at the pilot plant scale with \nrheocasting (i.e. forming in the semi-solid state direct \nfrom the cooling liquid metal rather than having an \nintermediate solidification step). They formed a series of \nsteels including AISI 304 and 440C [2] but found that \noxide inclusions tended to lead to variable mechanical \nproperties. Aluminium casting alloys and magnesium \nalloys proved highly amenable to the process and in the \n1980s there was extensive effort on the industrialisation \nof the thixo-processes for light alloys, with the more \nchallenging high temperature alloys moving into the \nbackground. \nIn the early 1990s, a group based in Sheffield, UK, led \nby Kirkwood, Sellars and Kapranos, revived interest with \na consortium of UK based companies including Rolls \nRoyce. The Sheffield equipment used a vertically \nupwards acting ram within a vacuum chamber (to avoid \noxidation of the slug during heating) and a graphite die. \nSuch a die would not be suitable for long production runs \nbut was relatively cheap in comparison with tool steel \ndies and therefore suitable for an experimental \nprogramme. The Sheffield group saw the potential of \nceramic dies for thixoforming high temperature alloys \nand patented this idea [3]. The Sheffield work compared \nresults from spray formed materials [4] (a relatively \nexpensive process) with the RAP (Recrystallisation and \nPartial Melting) process [5] which simply involved \nmaterial in the conventionally cast and heavily deformed \nstate for T15, M2 and H13 tool steels and 440C stainless \nsteel, with encouraging results. The consortium then \nfocussed on M2 tool steel for extensive trials [6, 7], \npartly because it has a reasonably large thixoforming \nwindow (~150˚C) in comparison with stainless alloys, \nand partly because its high alloy content leads to a \nrelatively low solidus. \nAt the end of this consortium project in the early 1990s \nthe main difficulty was that there was no commercial \nmanufacturer of equipment for steel thixoforming and \ncompanies were not willing to take the risk on the \ndevelopmental stage. \nIn parallel with the Sheffield work, the Thixoforming \nIBF in Germany led by Kopp and Hirt was also aiming to \nthixoform steels. It became clear that without the facility \nto shroud the billet during heating, the build-up of oxide \non the surface prohibited successful processing. A major \ncollaborative project on thixoforming was initiated at \nRWTH Aachen and issues such as die longevity started \nRASSILI Ahmed, et al\/Trans. Nonferrous Met. Soc. China XX (2010) \n \nsYYY \nto be explored. Work at Aachen [8] showed that, when \nthixoforming M2, the stresses induced in the die tool \nsteel were several times the yield strength and therefore \nceramic inserts were necessary. Meyer and Bleck (also at \nAachen) [9] showed Differential Thermal Analysis (DTA) \nresults for M2 and compared with the calculated results \nfrom a thermodynamic prediction package, techniques \nwhich become powerful in enabling amenable steels to \nbe identified and characterised. At a 1997 conference, \nwork was also presented highlighting that commercial \nwrought high speed steel bar could be thixoformed \nwithout any special treatment [10]. As we have \nprogressed into the 2000s, major EU consortia \n(‘THIXOCOMP’, ‘Adapted Steel Parts’ and COST 541 \n‘THIXOSTEEL’ and SFB289 have aimed to overcome \nthe major barriers to exploitation).  \n \nFig. 1. Thixoforming of steels, conception and realization \ndiagram \nThe themes in this review paper are inspired by the \nabove mentioned consortia achievements which are \nmainly routes to thixoformable starting materials and \nidentification of suitable steels; modelling of die fill and \nrheological properties of semi solid steel; technology \nconsiderations for industrialisation; die development and \nthe properties of thixoformed products. The link between \nthe different themes is summarised in Fig. 1. Some \nconcluding remarks will then be given. \n \n2 Routes to thixoformable steels and \nidentification of suitable grades \n \nAs identified above [2], the Flemings group used \nrheocasting to obtain thixotropic material. However, this \nrequires the facilities to melt steel and hold it in the \nliquid state; many university laboratories have not had \nfacilities on this scale available. Rheo-routes are \npreferable as there is an energy saving relative to the \nroutes where there is an intermediate solidification step; \nthis saving is particularly crucial for a high melting \ntemperature such as steel. Routes where molten steel has \nbeen treated include the following. A group based in \nSeoul has produced stainless steel billets by Magneto \nHydrodynamic (MHD) stirring and shown excellent \nmicrostructures [11]. The University of Science and \nTechnology in Beijing has also electromagnetically \nstirred and then rheorolled spring and stainless steels \n[12]. Strip obtained showed good mechanical properties. \nAt CRM in Liege in Belgium they have developed a \nspecially designed hollow jet nozzle for continuous \ncasting which allows powder injection and a low \nsuperheat to be combined to obtain a globular structure \nin the core of a continuously cast steel billet [13].  \nVarious workers [14-17] are investigating the use of a \ncooling slope (similar to the New Rheocasting-NRC- \nprocess or the work of Haga and co-workers [18, 19]) \nwith some success.  Vibratory casting has also been \nused [20], including to obtain functionally graded \nmaterial based on hydroxyapatite and 316L stainless \nsteel [21]. \nThere has been interest in whether steel can be \nthixoformed in the standard state in which it is received \nfrom a steel supplier. Bulte and Bleck [22] compared the \nmicrostructure after quenching from the semisolid state \nfor 100Cr6 rolled bar, laboratory cast billet and \nlaboratory cast billet with liquid core reduction. They \nfound no significant difference and therefore suggest \nprimary as-cast billet can be used. Omar and co-workers \n[23, 24] have demonstrated that the high performance \nsteel HP9\/4\/30, which is very difficult to form by other \nroutes, can be successfully thixoformed in the \nas-supplied state. Note that in the as-supplied state the \nmaterial is already recrystallised and therefore this route \ndoes not fit with the ‘classical’ solid state routes of RAP \nand SIMA (Strain Induced Melt Activated). \nThe original approach to identifying suitable steels \ninvolved examining the phase diagram. This showed that \nlow alloy, low carbon steels had narrow solidus-liquidus \nranges and therefore process control was likely to be \nRASSILI Ahmed, et al\/Trans. Nonferrous Met. Soc. China XX (2010) \n \nsYYY \ndifficult. Work therefore focussed on high alloy, high \ncarbon compositions, which also tend to be the \ncompositions which are the most difficult to work by \nconventional means. \nAs mentioned in the Introduction, the approach of \ncombining experimental results from Differential \nThermal Analysis (DTA) alongside thermodynamic \nprediction was then developed.  \nKazakov [25] identified parameters for the liquid \nfraction versus temperature curve for alloys to be \nsuitable for thixoforming. These have been adapted for \nsteels [26]: \n• The solidus and liquidus temperatures, TS and TL, \nwhich must be as low as possible; \n• The temperature at 50% liquid, T50%, which must be as \nlow as possible; \n• The melting interval, TL-TS, which must be as large as \npossible; \n• The semi-melting interval, T50%-TS, which is of \ninterest as it approximates to the thixoforming \nwindow; \n• The slope at 10 and 50% liquid, (df\/dT)10% and \n(df\/dT)50%, which must be as low as possible to ensure \na small sensitivity of liquid fraction to temperature. \nFigure 2 shows the measurement curves for a \nconventional C38 steel grade and a steel where the \ncomposition has been modified specifically for \nthixoforming [27].  \nThe modified alloys have a lower soliduus temperature \nand a wider process temperature range [28]. However, \nthe effect on resulting mechanical properties must also be \ncarefully weighed. \n0\n0.25\n0.5\n0.75\n1\n1350 1450 1550\nTemperature (°C)\nLi\nqu\nid\n f\nra\nct\nio\nn\nC38\nC38 Asco modif1\nC38 Asco modif2\n \nFig. 2. Liquid fraction behavior vs. temperature, comparison \nbetween classical C38 steel grade and modified one. \n \nPuttgen and Bleck [29] have carried out extensive DTA \nexperiments, showing that the cold work tool steel \nX210CrW12 and the tool steel HS 6-5-3 have a wide \nsemi-solid area (due to the dissolution of different \ncarbides) but a range of other steels have much narrower \nsemi-solid regimes. The bearing steel 100Cr6 is also \nhighly suitable. This steel and X210CrW12 have \ntherefore been extensively investigated in terms of the \nphase formation during processing [30]. Figure 3 \nsummarises liquid fraction behaviours of the investigated \nsteels. Hallstedt et al. [31] have also used \nthermodynamic prediction, suggesting that important \ncriteria are the slope at 50% liquid and the temperature \nranges between 40% liquid and 60% for thixocasting and \n20% and 40% for thixoforging.  \n \nFig.3. Liquid fraction behavior vs. temperature for different \nsteels using DTA at a heating rate of 10°C\/min [29] \n \n                       \nFoundation item: University of Liège, Belgium and EU COST 541 “ThixoSteel” \nCorresponding author: RASSILI Ahmed; Tel: +32-4-3615951; E-mail: a.rassili@ulg.ac.be \nRASSILI Ahmed, et al\/Trans. Nonferrous Met. Soc. China XX (2010) \n \nsYYY \n \nLi et al. [32] have identified how the inverse peritectic \nreaction can lead to spheroidisation in stainless steels in \nthe semi-solid state. They argue that spheroidisation will \nalways occur in an alloy with a peritectic reaction \nindependent of the morphology in the solid state. They \nhave named this phenomenon Inverse Peritectic Induced \nSpheroidisation (IPIS). \n \n3 Modelling of Die Fill and Rheological \nProperty of Semi-Solid Steels. \n \nModelling of semi-solid processing has been reviewed \nby Atkinson [33, 34]. The high temperatures involved \nwith steels make the experiments particularly \nchallenging. Modigell et al. [35] have developed a high \ntemperature Couette rheometer to analyse flow \nproperties up to 1500˚C and have characterised \nX210CrW12. Cezard et al. [36] have derived input \nparameters for their finite element simulation using \nForge 2 software from successive comparisons of the \nsimulated load-displacement curves with experimental \nones for compression tests on steel semi-solid at different \ntemperatures. The constitutive equation is based on the \nmicro-macro approach. Omar et al. [37] have also \nobtained viscosity-shear rate relationships from \nload-displacement curves. Hot compression is used to \nobtain flow stress curves but only around the solidus \ntemperature [38]. Shimahara et al. [39] have designed a \nspecial cylinder sample with a shell to avoid the problem \nof collapse of the sample during hot compression as \nliquid develops. At temperatures just below and just \nabove the solidus, Solek et al. [40] and Kang et al. [41] \nhave carried out experiments with a Gleeble simulator to \ncharacterise rheological properties. \nAt present modelling of die fill is not well developed \nbecause of the difficulties with obtaining experimental \nparameters but the principles should be similar to those \nfor modelling semi-solid die fill in general [33]. \nHowever, modeling can still be very helpful with \nidentifying where defects are likely occurring and \nadjustments which should then be made to the \nthixoforging parameters. Figure 4 shows such an \nexample. \n \nFig. 4. Material flow modelling (left) and real part (right) \nshowing defects around the central air intake hole. The \nmodelling led to adjustments in the process and successful \ncomponent production [42]. \n \n4 Technology Considerations for \nIndustrialisation \n \nThe industrial development of steel thixoforming must \nbe accompanied by knowledge and control of the various \nparameters for the process: the identification of the steel \ngrades; the homogeneous high-temperature heating of \nthe slug before deformation; conception or re-conception \nof the part to adapt it to the process; the parameters for \nforming including ram velocity profile, hold time and \npressure at the end of the stroke, die temperature, die \nmaterial. The handling system is also important; it allows \nthe slug to be transferred, in the semi-solid state, between \nthe heating zone and the tooling and to evacuate the \nthixoformed part so as to ensure the quality heat \ntreatment of the part. All these aspects contribute to \nachieving a cost for the finished part which is \ncompetitive with more conventional processes [43]. \nIndustrial developments include: non-contact \ntemperature measurement during heating [44]; the use of \nfuzzy logic to control the heating [45]; optimising the \ninduction coil geometry [46]; prediction of thermal \nlosses during transport and after insertion into the die \n[47]; a device on the hydraulic press to counteract the \ndecrease of the punch speed in the final stages of the \nstroke [48, 49]; automated handling and industrial vision \nsystems [28, 50, 51]. \n \n4.1 Induction heating \n \nThe slug induction heating is one of the essential \noperations of the thixoforming process [52]; the \ntemperature distribution through the slug just before \nforming must be as homogeneous as possible to enable a \nuniform distribution of liquid fraction through the slug \nRASSILI Ahmed, et al\/Trans. Nonferrous Met. Soc. China XX (2010) \n \nsYYY \nvolume. In addition, the heating schedule must be such \nthat, whilst achieving the above requirements the time to \ntemperature is as short as possible. The heating operation \nregulates the process productivity. To ensure a \ncomparable productivity to other hot forming processes, \nwith induction heating it is necessary to heat slugs on a \ncarousel. During the induction heating operation, the slug \nwill be protected from oxidation by an inert gas \natmosphere e.g. argon. \n \n4.2 Transfer and handling systems \n \nRobots are necessary to achieve reproducibility of \ntransfer and handling operations. A first robot has to \nlocate the slug in the heating zone and then transfer the \nsemi-solid slug to the forming zone. A second robot \ntransfers the part towards the evacuation or heat \ntreatment zones. This second robot can also clean the \ntool active zone and carry out lubrication of the tool. \nAlternative handling systems give also good process \nreliability but are less accurate than robots. \n \n4.3 Press and forming equipment \n \nA thixoforming press must be able to be operated under \neither load or displacement control. The press will be \neither hydraulic or a screw mechanical press. For \noperation in the semi-solid state, the movements must be \nfast and as much as possible constant on the main axis to \nobtain high speed deformation of the semi-solid metal in \ntools. A hydraulic press presents some advantages with \nthe possibility to use some slides or pistons and with a \nvery large surface table. \n \n4.5 Control of manufacturing \n \nQuality control includes inspection of: dimensions, \ngeometry, visual defects, magnetic-particle inspection, \nmetallographic structure and hardness. The parameters \nmust be adapted to customer specifications but also \ninteract with the process e.g. dimensions affect \nre-heating and hence reproducibility.  \n \n5 Tools and forming dies \n \nThixoforming of steels presents a particularly severe \nrequirement on die properties. The process is \ncharacterised by high temperatures, temperature \ngradients, pressures and considerable stresses. This \nprocess requires materials with high-temperature \ncorrosion and thermal shock resistance under load to \nmeet performance and durability requirements. Forming \nsemi-solid steel requires special dies which must be able \nto withstand repeated contact from material forming at \ntemperatures of around 1250°C. Thixoforming steel dies \nshould have high temperature mechanical strength, wear, \nfatigue, creep, shock, corrosion and oxidation resistance \nproperties.  One of the greatest challenges in \nthixoforming of steel is developing a die to meet these \nrequirements. Recent research has investigated a wide \nrange of high temperature coatings, bulk ceramics and \nsurface laser processing techniques in order to prolong \nthe life of the die during steel thixoforming. Cycles \nproducing hundreds of parts have been achieved in \npractice using ceramic die materials. For the \nindustrialisation of the process, dies for thixoforming of \nsteel alloys need to be capable of producing closer to a \nhundred thousand or more production cycles. A series of \ndifferent potential solutions have been investigated \nincluding: oxide PVD coatings on TZM (a Mo-based \nalloy) [53]; PACVD alumina films on hot working steel \n[54]; ceramic inserts (Si3N4, ZrSiO4) in a hot working \nsteel shrink ring [55]. \nIn the SFB289 project [56], three types of materials \nhave been compared: thin film PVD and PACVD; \nthermally sprayed thick coatings and bulk ceramic \nmaterials. The results showed that the behaviour was \nsensitive to the stresses at the surface of the die and \ntherefore the die should be made of different materials in \ndifferent positions.  \nGas pressure sintered Si3N4 is an effective die material \nfor low die temperatures (300-400˚C) because of its high \nstrength and outstanding thermal shock resistance [57]. \nAt higher temperatures (1200˚C) high pu rity dense \nalumina is needed [57]. Bobzin et al. [58] examined the \nmost effective form of alumina coating, showing that \nusing the reactive pulsed PVD process it was possible to \nstabilize gamma-alumina on steel substrates and obtain \nexcellent performance for thixoforging X210CrW12 and \n100Cr6. Behrens et al [59] proposed a bulk Si3N4 \nceramic die which shows a good resistance to semi-solid \nRASSILI Ahmed, et al\/Trans. Nonferrous Met. Soc. China XX (2010) \n \nsYYY \nsteel corrosion and allows interesting surface finishing of \nthe thixoformed parts. Unfortunately sintered ceramic \ntools did not show a good mechanical resistance. \nLaser glazing of tool steels has been investigated [60] \nbut the beneficial surface layer did not persist at the \ntemperatures involved for thixoforming steels. Birol [61, \n62] has investigated the performance of nickel-based \nIN617 and of a CrNiCo alloy as die materials but with \nlimited success. He also showed that an increase in the \ndie bulk temperature from 450˚C to 550˚C gives a very \nfavourable effect from a thermal fatigue point of view \n[63]. \nPuttgen et al. [64] have investigated the thermal shock \nloading on coated samples, indicating a clear dependence \non the base material. The combination of Ni alloy 2.4631 \nand HVOF gave the best results. \nA self-heating ceramic tool (sintered alumina with a \nheating coil) has been successfully developed by \nMuenstermann et al. [65] for thixoextrusion of \nX210CrW12. Almost isothermal processing can be \nachieved. \n \n6 Post-forming heat treatment and parts \nproperties \n \nThe main steels used allow the required metallurgical \nstructures and mechanical properties to be consistently \nobtained with controlled cooling from the thixoforged \nstate or a heat treatment after the forming operation [66]. \nMetallographic analysis, hardness measurements and \nfatigue and tensile testing have been carried out on \nas-thixoformed parts and post heat-treated parts and \nusing different steel grades. \nThe microstructure of the thixoformed parts is very \nsensitive to the process parameters. As these parameters \nare coupled together, a clear view on the impact of each \nparameter is very difficult to determine. Nevertheless, an \nimprovement of the part quality is clearly observed with \nadaptation of the composition of the steel grade and with \nheat treatment or controlled cooling after thixoforming.  \nThe pre and post treatment of the thixoformed parts in \nterms of heating conditions and controlled cooling has a \ngreat influence on the final microstructure and the \nproperties of the parts and their homogenization.  \nPuttgen et al. [67] have summarised the experience of \nvarious workers in thixoforming finished parts including \na catalogue of the defects and giving suggestions for how \nto avoid them. Runs with hundreds of parts in them have \nbeen produced with various alloys but reproducibility has \ntended to be poor. They conclude that efforts are still \nneeded to produce defect-free components in serial \nproduction at competitive costs. Solid-liquid segregation, \nin particular, causes major variations in carbon content \nthrough a component and thus inhomogeneous \nmechanical properties. Parts with great hardness and \nwear resistance can be produced [68-70] but there is a \ntendency to brittleness [71]. There is clearly further work \nto be done on optimising heat treatment [72]. The effects \nof post treatment on defects improvement have been \nreported also by Rassili et al. [66]. \nIn this field there is still a large need for research to set a \ncomplete processing map that leads to better \nunderstanding of all the steel thixoforming process \nparameters and their possible impact on the part \nmicrostructure and thus its mechanical properties. \n \n7 Conclusions \n \nSemi-solid processing of steel is a very active area for \nresearch and development. Parts have been successfully \nmade (see Figure 5) [73]. \nHowever, the main challenges now are with die \nprotection from degradation and with industrialisation. \nConsiderable progress has been made [74]. \n \nFig. 5. Parts made in the European Project ‘Adapted Steel \nParts’ by a collaboration of IFUM (Hannover), University of \nLiege and Ascometal. \n \nReferences \n \n[1] SPENCER D B, MEHRABIAN R, FLEMINGS M C. [J]. Metall. \nTrans., 1972, 3, 1925-32. \n[2] YOUNG K P, RIEK R G, FLEMINGS M C. [J]. Metals Technology, \n1979, 6, 130-7. \n[3] KIRKWOOD D H. [P]. European patent No. 0305375 Thixotropic \nRASSILI Ahmed, et al\/Trans. Nonferrous Met. Soc. China XX (2010) \n \nsYYY \nmaterials, 1988. \n[4] LEATHAM A, OGILVY A, CHESNEY P, WOOD J V. [J]. Metals \nand Mater., 1989, 5, 140-3. \n[5] BOYED L E, KIRKWOOD D H, SELLARS C M. [C]. Proc. 2nd \nWorld Basque Congress on New Structural Materials, Spain, 285-95, \n1988 (Publ. Vitoria Gasteiz). \n[6] KAPRANOS P, KIRKWOOD D H, SELLARS C M. [J]. Proc. Instn. \nMech. Engrs. Part B: J. of Engineering Manufacture, 1993, 207,  \n1-8. \n[7] KAPRANOS P, GIBSON R C, KIRKWOOD D H, HAYES P J, \nSELLARS C M. [J]. Mater. Sci. & Technol., 1996, 12, 274-8. \n[8] PRANGE R, NEUSCHUTZ D. [C]. Proc. 5th Int. Conf. Semi-Solid \nProcessing of Alloys and Composites, BHASIN A K, MOORE J J, \nYOUNG K P, MIDSON S, (Eds.), publ. Colorado School of Mines, \n653-60, 1998. \n[9] MEYER S, BLECK W. [C]. op. cit. [8] 361-9. \n[10] CABEZA M M, VERDEJA J I, PERO-SANZ J A, PLAZA D. [C]. \nProc. 30th Annual Technical Meeting of the International \nMetallographic Society, Seattle, WA, Publ. ASM International, 425-8, \n1997. \n[11] KIM K B, LEE H I, MOON H K. [C]. op. cit. [8] 415-22. \n[12] SONG R, KANG Y, ZHAO A. [J]. J. Mater. Process. Technol., 2008, \n198, 291-9. \n[13] WALMAG G, NAVEAU P, RASSILI A, SINNAEVE M. [C]. Proc. \n10th Int. Conf. Semi-Solid Processing of Alloys and Composites, \nHirt, G., Rassili, A., Buhrig-Polaczek, A. (Eds.), publ. Trans Tech \nPublications Ltd., Solid State Phenomena, 2008, 141-143, 415-20. \n[14] SEIDL I, KOPP R. [J]. Steel Res. Int., 2004, 75, 545-51. \n[15] HIRT G, SHIMAHARA H, SEIDL I, KUTHE F, ABEL D, \nSCHONBOHM A. [J]. CIRP Annals-Manufacturing Technology, \n2005, 54, 257-60. \n[16] RAMADAN M, TAKITA M, NOMURA H, EL-BAGOURY N. [P]. \nMater. Sci. & Engng. A, 2006, 430, 285-91. \n[17] PAHLEVANI F, NILI-AHMADABADI M. [J]. Int. J. Cast Metals \nResearch, 2004, 17, 157-61. \n[18] European Patent 0745694A1, Method and apparatus of shaping \nsemisolid metals, UBE Industries, 1996. \n[19] HAGA T, KOUDA T, MOTOYAMA H, INOUE N, SUZUKI S. [C]. \nProc. ICAA7, Aluminium Alloys: Their Physical and Mechanical \nProperties, Vol. 1, 1998, 327-32. \n[20] MILOSTEAN D C, IOAN I. [J]. Metalurgia International, 2008, 13, \n49-54. \n[21] RUYS A J, KERDIC J A, SORRELL C C. [J]. J. Mater. Sci., 1996, \n31b, 4347-55. \n[22] BULTE R, BLECK W. [J]. Steel Res. Int., 2004, 75, 588-92. \n[23] OMAR M Z, ATKINSON H V, PALMIERE E J, HOWE A A, \nKAPRANOS P. [J]. Steel Res. Int., 2004, 75, 552-60. \n[24] OMAR M Z, PALMIERE E J, HOWE A A, ATKINSON H V, \nKAPRANOS P. [J]. Mater. Sci. Engng. A, 2005, 395, 53-61. \n[25] KAZAKOV A A. [J]. Adv. Mater. Process., 2000, 3, 31-4. \n[26] FRAIPONT C, LECOMTE-BECKERS J. [C]. op. cit. [13] 523-7. \n[27] LECOMTE-BECKERS J, RASSILI A, ROBELET M, PONCIN C, \nKOEUNE R. [C]. Proc. 9th Int Conf. Semi-Solid Processing of \nAlloys and Composites, Kang, C.G., Kim, S.K., Lee, S.Y. (ed.), publ. \nTrans Tech Publications, Solid State Phenomena, 2006, 116-117, \n54-7. \n[28] ROBELET M, RASSILI A, FISCHER D. [C]. op. cit. [27] 712-6. \n[29] PUTTGEN W, BLECK W. [J]. Steel Res. Int., 2004, 75, 531-6. \n[30] PUTTGEN W, HALLSTEDT B, BLECK W, UGGOWITZER P J. [J]. \nActa Mater., 2007, 55, 1033-42. \n[31] HALLSTEDT B, BALTICHEV E, SHIMAHARA H, NEUSCHUTZ \nD. [J]. ISIJ International, 2006, 46, 1852-7. \n[32] LI J Y, SUGIYAMA S, YANAGIMOTO J, CHEN Y L, FAN G W. [J]. \nJ. Mater. Process. Technol., 2008, 208, 165-70. \n[33] ATKINSON H V. [J]. Prog. Mater. Sci., 2005, 50, 341-412. \n[34] ATKINSON H V. [B] (Ed.), Modelling Semi-Solid Processing, \nShaker Verlag Aachen, 2008. \n[35] MODIGELL M, PAPE L, MAIER H R. [C]. op. cit.[27] 606-9. \n[36] CEZARD P, FAVIER V, BIGOT R. [C]. Proc. 10th ESAFORM Conf., \nAIP Conf. Proc. ,2007, 907, 1149-54. \n[37] OMAR M Z, ATKINSON H V, PALMIERE E J, HOWE A A, \nKAPRANOS P. [C]. op. cit. [27] 677-80. \n[38] LI J Y, SUGIYAMA S, YANAGIMOTO J. [J]. J. Mater. Process. \nTechnol., 2005, 161, 393-406. \n[39] SHIMAHARA H, BAADJOU R, KOPP R, HIRT G. [C]. op. cit. [27] \n189-92. \n[40] SOLEK K P, MITURA Z, KARBOWNICZEK M, KAPRANOS P, \nKUZIAK R, DUTKIEWICZ J. [C]. op. cit. [13] 325-30. \n[41] KANG Y L, SONG R B, LI J G, ZHAO A M. [C]. Proc. 5th Pacific \nRim Int. Conf. on Advanced Materials and Processing, Materials \nScience Forum, Parts 1-5, 2005, 475-479, 2579-82. \n[42] RASSILI A, ADAM L, FISCHER D, ROBELET M, DEMURGER J, \nCUCATTO A, KLEMM H, WALKIN B, KARLSSON M, FLUß A. \n[C]. ’Improvement of Materials and Tools for Thixoforming of \nSteels’. Proc. 8th Int. Conf. on Semi-Solid Processing of Alloys and \nComposites S2P, September 2004, Cyprus, published on CD-ROM. \n[43] AHMED R., MARC, R., REGIS, B. (In fact this paper has been \nreferenced incorrectly on Web of Science and should have as authors \nRASSILI, A., ROBELET, M., BIGOT, R.,) [C]. op. cit. [13] 213-8. \n[44] SCHONBOHM A, GASPER R, ABEL D. [C]. op. cit.[27]734-7. \nRASSILI Ahmed, et al\/Trans. Nonferrous Met. Soc. China XX (2010) \n \nsYYY \n[45] BEHRENS B A, FISCHER D, RASSILI A. [C]. op. cit.[13]121-6. \n[46] RASSILI A, ROBELET M, FISCHER D. [C]. op. cit. [27]717-20. \n[47] BAADJOU R, KNAUF F, HIRT G. [C]. op. cit. [13] 37-42. \n[48] CEZARD P, BIGOT R, BECKER E, MATHIEU S, PIERRET J C, \nRASSILI A. [C]. op. cit. [36] 1155-60. \n[49] PIERRET J C, PhD Thesis, « la robustesse du procédés de \nthixoformage des aciers », Editions University of Liège, 2009. \n[50] KUTHE F, SCHONBOHM A, ABEL D, KOPP R. [J]. Steel Res. Int., \n2004, 75, 593-600. \n[51] SIEGERT K, MESSMER G. [J]. op. cit. [50] 601-6.  \n[52] ABDELFATTAH S, ROBELET M, RASSILI A, BOBADILLA M. \n[C]. Proc. 6th Int. Conf. Semi-Solid Processing of Alloys and \nComposites, Chiarmetta G L, Rosso M (Eds.), Turin, Italy, \nSeptember 27-29, 2000, publ. Edimet Spa, Brescia, pp. 283-8. \n[53] LUGSCHEIDER E, HORNIG T, KOPP R, KALLWEIT J, MOLLER \nT. [J]. Adv. Engng. Mats., 2001, 3, 998-1001. \n[54] KURAPOV D, SCHNEIDER J M. [J]. op. cit. [50] 577-80. \n[55] BEHRENS B A, HALLER B, FISCHER D. [J]. op. cit. [50]561-8. \n[56] KOPP R, SHIMAHARA H, SCHNEIDER J M, KURAPOV D, \nTELLE R, MUNSTERMANN S, LUGSCHNEIDER E, BOBZIN K, \nMAES M. [J]. op. cit. [50] 569-76. \n[57] MUNSTERMANN S, TELLE R. [J]. Material Wissenschaft und \nWerkstofftechnik, 2006, 37, 324-8. \n[58] BOBZIN K, LUGSCHEIDER E, MAES M, IMMICH P. [C]. op. cit. \n[27] 704-7.  \n[59] BEHRENS B A, FISCHER D, HALLER B, RASSILI A, PIERRET J \nC, KLEMM H, STUDINSKI A, WALKIN B, KARLSSON M, \nROBELET M, NATALE L, ALPINI F. [J]. Solid State Phenom., \n2006, 116-117, 686-689. \n[60] BRABAZON D, NAHER S, BIGGS P. [C]. op. cit. [13] 255-60.  \n[61] BIROL Y. [J]. Ironmaking & Steelmaking, 2009, 36, 555-60. \n[62] BIROL Y. [J]. Steel Res. Int., 2009, 80, 165-71.  \n[63] BIROL Y. [J]. Steel Res. Int., 2009, 80, 588-92. \n[64] PUTTGEN W, PANT M, BLECK W, SEIDL I, RABITSCH R, \nTESTANI C. [J]. Steel Res. Int., 2006, 77, 342-8. \n[65] MUENSTERMANN S, UIBEL K, TONNESEN T, TELLE R. [J]. J. \nMater. Process. Technol., 2009, 209, 3640-9. \n[66] RASSILI, A, PIERRET J C, VANEETVELD G, CEZARD P, BIGOT \nR, ROBELET M. [C]. Proc. 10th Int. Conf. Semi-Solid Processing of \nAlloys and Composites, HIRT G., RASSILI A., \nBUHRIG-POLACZEK A. (editors), publ. Trans Tech Publications \nLtd., Solid State Phenomena, 2008, 141-143, 689-694. \n[67] PUTTGEN W, BLECK W, HIRT G, SHIMAHARA H. [J]. Adv. \nEngng. Mats., 2007, 9, 231-245. \n[68] UHLENHAUT D I, KRADOLFER J, PUTTGEN W, LOFFLER J F, \nUGGOWITZER P J. [J]. Acta Materialia, 2006, 54, 2727-34. \n[69] DZIALLACH S, PUETTGEN W, BLECK W. [C]. op.cit.[13] \n695-700. \n[70] MUNSTERMANN S, TELLE R. [J]. op. cit. [62] 171-6. \n[71] OMAR M Z, ATKINSON H V, KAPRANOS P, JAHARAH A G. [C]. \nop. cit. [36] 1185-90. \n[72] RASSILI A, PIERRET J C, VANEETVELD G, CEZARD P, BIGOT \nR, ROBELET M. [C]. op. cit. [13] 689-94. \n[73] ATKINSON H V, RASSILI A [C]. Proc. 13th ESAFORM \nConference April 7-9, 2010, Brescia, Italy, publ. Springer on \nCD-ROM. \n[74] ATKINSON H V, RASSILI A, Thixoforming Steel, publ. Shaker \nVerlag, Aachen, 2010. \n \n \n"}