{"doi":"10.1016\/j.ijinfomgt.2005.04.005","coreId":"140213","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/2687","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/2687","10.1016\/j.ijinfomgt.2005.04.005"],"title":"Products and services in cyberspace","authors":["Peppard, Joe","Rylander, Anna"],"enrichments":{"references":[{"id":37971556,"title":"Blown to Bits: How the New Economics of Information Transform Strategy,","authors":[],"date":"2000","doi":"10.1002\/asi.1127","raw":"Evans, P and Wurster, TS (2000), Blown to Bits: How the New Economics of Information Transform Strategy, Harvard Business School Press, Boston.","cites":null},{"id":37971555,"title":"Building digital brands’,","authors":[],"date":"2000","doi":null,"raw":"Datal, S, Landesberg, H. and Zeisser, M. (2000), ‘Building digital brands’, McKinsey Quarterly, No. 2, pp. 42-51.","cites":null},{"id":37971562,"title":"Consumer behavior in web-based commerce: an empirical study’,","authors":[],"date":"2002","doi":null,"raw":"Koufaris, M, Kambil, A and LaBarbera, PA (2002) ‘Consumer behavior in web-based commerce: an empirical study’, International Journal of Electronic Commerce, Vol. 6, No. 2, pp. 115-138.","cites":null},{"id":37971566,"title":"Consumer choice process for experience goods: an econometric model and analysis’,","authors":[],"date":"1999","doi":"10.2307\/3152083","raw":"Neelamegham, R and Jain, D (1999), ‘Consumer choice process for experience goods: an econometric model and analysis’, Journal of Marketing Research, vol. XXXVI, pp. 373 – 386 Peterson, R Balasubramanian, S and Bronnenberg, B (1997), ‘Exploring the implications of the Internet for Marketing’, Journal of the Academy of Marketing Science, Vol. 25, pp. 329-346.","cites":null},{"id":37971552,"title":"Consumer purchasing on the Internet: processes and prospects’,","authors":[],"date":"1998","doi":"10.1016\/s0263-2373(98)00036-x","raw":"Butler, P and Peppard, J (1998), ’Consumer purchasing on the Internet: processes and prospects’, European Management Journal, Vol. 16, No. 5, pp. 600-610.","cites":null},{"id":37971550,"title":"Increasing Returns and Path Dependence in the Economy,","authors":[],"date":"1994","doi":"10.2307\/2554641","raw":"Arthur, B (1994), Increasing Returns and Path Dependence in the Economy, University of Michigan Press, Ann Arbor.","cites":null},{"id":37971572,"title":"Information Rules: A Strategic Guide to the Network Economy,","authors":[],"date":"1999","doi":"10.2307\/1183273","raw":"Shapiro, C and Varian, HR (1999), Information Rules: A Strategic Guide to the Network Economy, Harvard Business School Press, Boston, MA.","cites":null},{"id":37971563,"title":"Initial trust, perceived risk, and the adoption of Internet banking’,","authors":[],"date":"2000","doi":"10.1145\/1007965.1007970","raw":"Kim, K and Prabhakar, B (2000), ‘Initial trust, perceived risk, and the adoption of Internet banking’, in Proceedings of 21 st International Conference on Information Systems, December 10-13 th, Brisbane, Australia, pp. 537-543.","cites":null},{"id":37971553,"title":"Internet retailing: dislocation, dislocation, dislocation’, Working Paper,","authors":[],"date":"2003","doi":null,"raw":"Butler, P (2003), ‘Internet retailing: dislocation, dislocation, dislocation’, Working Paper, University of Dublin, Trinity College, Dublin.","cites":null},{"id":37971551,"title":"Managing service organizations: does having a “thing” make a difference?’","authors":[],"date":"2002","doi":"10.1177\/014920630202800309","raw":"Bowen, J and Ford, RC (2002), ‘Managing service organizations: does having a “thing” make a difference?’ Journal of Management, Vol. 28, No. 3, pp. 447-469.","cites":null},{"id":37971573,"title":"Measuring factors that influence the success of Internet commerce’,","authors":[],"date":"2002","doi":"10.1287\/isre.13.2.187.87","raw":"Torkzadeh, G and Dhillon, G (2002) ‘Measuring factors that influence the success of Internet commerce’, Information Systems Research, Vol. 13, No. 2, pp. 187-204. Pre-publication version International Journal of Information Management, Vol 25, 2005, pp. 335-345.","cites":null},{"id":37971557,"title":"Re-engineering work: Don’t automate, obliterate’,","authors":[],"date":"1990","doi":null,"raw":"Hammer, M (1990), ‘Re-engineering work: Don’t automate, obliterate’, Harvard Business Review, July-August, pp. 104-112.","cites":null},{"id":37971570,"title":"Redefining industry structure for the information age’,","authors":[],"date":"1998","doi":"10.1002\/(sici)1097-0266(199804)19:4<357::aid-smj987>3.0.co;2-x","raw":"Sampler, J (1998), ‘Redefining industry structure for the information age’, Strategic Management Journal, vol. 19, pp. 343-355.","cites":null},{"id":37971571,"title":"Service Operations Management, Prentice-Hall, Englewood Cliffs,","authors":[],"date":"1995","doi":null,"raw":"Schmenner, RW (1995), Service Operations Management, Prentice-Hall, Englewood Cliffs, New Jersey.","cites":null},{"id":37971567,"title":"Strategy and the Internet’,","authors":[],"date":"2001","doi":null,"raw":"Porter, ME (2001), ‘Strategy and the Internet’, Harvard Business Review, March, pp. 63-78.","cites":null},{"id":37971559,"title":"Surfing among the sharks: how to gain trust","authors":[],"date":"2000","doi":null,"raw":"Jarvenpaa, S and Grazioli, S (2000), ‘Surfing among the sharks: how to gain trust in cyberspace’, ed. DA Marchand, TH Davenport and T Dickson, Mastering Information Management, Pearson, London, pp. 197-201.","cites":null},{"id":37971568,"title":"Technology in services: rethinking strategic focus’,","authors":[],"date":"1990","doi":null,"raw":"Quinn, JB, Doorley, TL and Paquette, PC (1990), ‘Technology in services: rethinking strategic focus’, Sloan Management Review, Winter, pp. 79-87.","cites":null},{"id":37971560,"title":"The development of initial trust in an online company by new customers’,","authors":[],"date":"2004","doi":"10.1016\/j.im.2003.08.004","raw":"Koufaris, M and Hampton-Sosa, W (2004) ‘The development of initial trust in an online company by new customers’, Information & Management, Vol. 41, pp. 377-397.","cites":null},{"id":37971565,"title":"The impact of initial consumer trust on intention to transact with a web-site: a trust building model’,","authors":[],"date":"2002","doi":"10.1016\/s0963-8687(02)00020-3","raw":"McKnight, DH, Choudhury V and Kacmar C (2002) ‘The impact of initial consumer trust on intention to transact with a web-site: a trust building model’, Journal of Strategic Information Systems, Vol. 11, No. 3\/4,  pp. 297-324.","cites":null},{"id":37971558,"title":"The impact of the Internet on a television-based society’,","authors":[],"date":"2000","doi":"10.1016\/s0160-791x(00)00008-7","raw":"Havick, J (2000), ‘The impact of the Internet on a television-based society’, Technology in Society, vol. 22, pp. 273-287. Pre-publication version International Journal of Information Management, Vol 25, 2005, pp. 335-345.","cites":null},{"id":37971554,"title":"The Internet Galaxy: Reflections on the Internet, Business, and Society,","authors":[],"date":"2001","doi":"10.2307\/40252194","raw":"Castells, M (2001), The Internet Galaxy: Reflections on the Internet, Business, and Society, Oxford University Press, Oxford.","cites":null},{"id":37971564,"title":"The Language of Space,","authors":[],"date":"2001","doi":"10.4324\/9780080509969","raw":"Lawson, B (2001), The Language of Space, Architectural Press, UK.","cites":null},{"id":37971569,"title":"The Media Equation: How People Treat Computers, Television and New Media Like Real People and Places,","authors":[],"date":"1996","doi":"10.1016\/s0898-1221(97)82929-x","raw":"Reeves, B and Nass, C (1996), The Media Equation: How People Treat Computers, Television and New Media Like Real People and Places,  CSLI Publications, Cambridge, USA.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-08-01T00:00:00Z","abstract":"In the physical world, products and services are traditionally distinguished\nfrom each other on the basis of tangibility and intangibility; indeed, services\nare often described as intangible products. In the virtual world of the fixed\nand mobile Internet, however, this distinction is no longer appropriate: both\nproducts and services become intangible. This is essentially because the\nInternet is not merely a technology but represents an entirely new medium for\nconducting business, a fact that was overlooked by many of the early entrants\ninto this space. This medium is defined by information and fundamentally\ndifferent from the physical space where business has traditionally been\ntransacted. Consequently, the concept of products and services requires study.\nIn this paper we focus on business-to-consumer (B2C) markets and explore\nconsumer products and services in cyberspace, distinguishing them along a number\nof dimensions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140213.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.ijinfomgt.2005.04.005","pdfHashValue":"602ccd02fdb4129fded2d36884f63db0e95835ad","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/2687<\/identifier><datestamp>2011-10-17T12:45:39Z<\/datestamp><setSpec>hdl_1826_28<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Products and services in cyberspace<\/dc:title><dc:creator>Peppard, Joe<\/dc:creator><dc:creator>Rylander, Anna<\/dc:creator><dc:subject>Internet<\/dc:subject><dc:subject>Online strategy<\/dc:subject><dc:subject>Information products<\/dc:subject><dc:subject>Physical information products<\/dc:subject><dc:subject>Digitally mediated services<\/dc:subject><dc:subject>Ecommerce<\/dc:subject><dc:description>In the physical world, products and services are traditionally distinguished\nfrom each other on the basis of tangibility and intangibility; indeed, services\nare often described as intangible products. In the virtual world of the fixed\nand mobile Internet, however, this distinction is no longer appropriate: both\nproducts and services become intangible. This is essentially because the\nInternet is not merely a technology but represents an entirely new medium for\nconducting business, a fact that was overlooked by many of the early entrants\ninto this space. This medium is defined by information and fundamentally\ndifferent from the physical space where business has traditionally been\ntransacted. Consequently, the concept of products and services requires study.\nIn this paper we focus on business-to-consumer (B2C) markets and explore\nconsumer products and services in cyberspace, distinguishing them along a number\nof dimensions.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-06-16T23:01:44Z<\/dc:date><dc:date>2011-06-16T23:01:44Z<\/dc:date><dc:date>2005-08-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Joe Peppard and Anna Rylander, Products and services in cyberspace, International Journal of Information Management, Vol. 25(4), Aug 2005, p.335-345.<\/dc:identifier><dc:identifier>0268-4012<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.ijinfomgt.2005.04.005<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/2687<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0268-4012","issn:0268-4012"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Internet","Online strategy","Information products","Physical information products","Digitally mediated services","Ecommerce"],"subject":["Article"],"fullText":" Products and Services in Cyberspace \n \nProducts and Services in Cyberspace \n \n \n \nJoe Peppard, \nCranfield School of Management, \nCranfield, \nBedfordshire MK43 0AL \nUnited Kingdom. \nPhone: +44 1234 754421 \nEmail: j.peppard@cranfield.ac.uk \n \n \nAnna Rylander, \nRoyal Institute of Technology, \nKTH Syd, Marinens väg 30, \n136 40 Haninge, \nSweden. \nPhone: +46 8 790 48 29 \ne-mail: anna.rylander@syd.kth.se \n \n \n \n \n \n \n \n \n \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  1 \n Products and Services in Cyberspace \n Products and Services in Cyberspace \n \n \nAbstract \nIn the physical world, products and services are traditionally distinguished from each other \non the basis of tangibility and intangibility; indeed, services are often described as intangible \nproducts. In the virtual world of the fixed and mobile Internet, however, this distinction is no \nlonger appropriate: both products and services become intangible. This is essentially \nbecause the Internet is not merely a technology but represents an entirely new medium for \nconducting business, a fact that was overlooked by many of the early entrants into this space. \nThis medium is defined by information and fundamentally different from the physical space \nwhere business has traditionally been transacted. Consequently, the concept of products and \nservices requires study. In this paper we focus on business-to-consumer (B2C) markets and \nexplore consumer products and services in cyberspace, distinguishing them along a number \nof dimensions. \nKeywords \nInternet, Online strategy, Information products, Physical information products, Digitally \nmediated services \nIntroduction \nThe commercialisation of the Internet has seen it being deployed for corporate \ncommunications, for facilitating trading activities, for distributing digital content, for the \nprovision of a wide range of services, and as a platform for collaboration. While many \norganizations have migrated products and services from the physical world to the virtual \nworld, or created new and innovative offerings to take advantage of the capabilities of the \ntechnology, lessons from these early forays clearly indicate that it is not an electronic \nreplication of the physical world (Butler and Peppard, 1998; Evans and Wurster, 2000; \nJarvenpaa and Grazioli, 2000). Indeed, more than a mere a technology, the Internet represents \nan entirely new medium for conducting business. Not only does it have different attributes \nthan the physical world but within this virtual space much of what is taken for granted in day-\nto-day commercial activities and decision-making processes are absent. In B2C (business-to-\nconsumer) markets, the focus of this paper, consumer behaviour is also different (Butler and \nPeppard, 1998). \nIn the physical world, products and services are generally distinguished from each other on \nthe basis of tangibility – products are portrayed as tangible, i.e. can be touched, while \nservices are seen as being intangible, i.e. cannot be touched (c.f. Slack et al., 2001). Services \nhave been described as “intangible products” (Heizer and Render, 1999, p. 13) and are \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  2 \n Products and Services in Cyberspace \ngenerally not precisely defined, but defined based on what they are not rather than what they \nare (c.f. Schmenner, 1995). While many products today have a service component, or \nprovisioning of a service has a physical aspect, with the advent of the Internet, both products \nand services become intangible. Couple this with the Internet as a medium and we are faced \nwith an entirely new environment and set of circumstances not only for conducting business \nbut also for managing operations. If companies are going to be successful with their online \nstrategies analysis would suggest that it is crucial for them to understand the characteristics of \ngoods and services in the virtual world as well as the behaviour of consumers when they \nmove online (Butler and Peppard, 1998; Koufaris et al., 2002).  \nIndeed, the distinction between products and services has guided theory and practice in \noperations management. A recent study identified differences that related to measurements \nused to assess effectiveness and efficiency, differences in production strategies and \ndifferences in production process between organizations producing tangible goods and \nintangible services (Bowen and Ford, 2002). Whether there are any differences when \noperating in the virtual world has yet to be addressed in the literature. But before such a task \ncan be undertaken it is necessary to understand this virtual world as well as the nature and \nbehaviour of products and services in this environment. The objective of this paper is to \nexplore products and services in cyberspace in order to develop a categorisation that is more \nappropriate in guiding management action. \nThe paper first investigates the Internet as media, drawing out a number of pertinent \nimplications. It then examines some of the fundamental attributes of information products \nand digitally mediated services. A categorisation of the different types of digital content is \ndeveloped and comparisons made across a number of dimensions. The paper concludes with \nsome implications. \nThe Internet as Media \nIn “going on the net”, what many organizations have failed to consider is that the Internet is \nan entirely new medium for conducting business and that the implications of this must be \nconsidered. This medium is an information-defined space. Apart for having no physical \nmanifestation, its shape, look, topology and context are all defined by information.  It also \nexhibits a number of distinct features that differentiate it from physical space. Issues of \ngeography and location are no longer important for the production and distribution of \ninformation (Butler, 2003). It provides individuals and organizations with the capability to \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  3 \n Products and Services in Cyberspace \ncontrol the production, storage and dissemination of information (Havick, 2000). The \nconstraints of space, all too present in the physical world, cease to be relevant.  It is perhaps \nthe absence of physical and tangible artefacts in this information-defined space that have the \nmost serious implications for consumer behaviour. These artefacts provide the clues that are \ncrucial for humans in their decision-making processes, and their absence has implications for \ntrust, for building brands, and for establishing customer relationships.  \nFor example, one of the principal reasons that many pure-play Internet banks failed was due \nto the lack of trust that existed between the online venture and customers.  Confidentiality \nand security are key components of trust (Dayal et al., 2000; Kim and Prabhakar, 2000; \nTorkzadeh and Dhillon, 2002). In the physical world of banking, physical cues like large \nimposing branches and knowledge of the person managing your account all contribute to the \ncreation of trust. On the Internet such cues are absent, which has resulted in people being \nreluctant to deposit their money with such virtual institutions. Contrast this with the relative \nsuccess of on-line brokerages, where an “intelligent” customer base, trading process, and the \ndematerialization of the product over many years, made them more suited to new pure-play \nstart-ups. Researchers in consumer behaviour have found that consumers recognise \ndifferences in size and reputations among Internet stores and that these influence their \nassessment of the store trustworthiness, their perception of risk, and their willingness to shop \nwith a particular store (Koufaris and Hampton-Sosa, 2004; McKnight et al., 2002). A \ncustomer who believes that there is a physical store behind a website is more likely to trust \nthe site on first encounter (Jarvenpaa and Grazioli, 2000). \nPhysical spaces form important constituent parts of what we might call “settings”, to which a \nset of social norms instructing us how to behave are attached. For example, when a person \nenters a library (or an office, a theatre, a church…) he has never been in before, he generally \nrecognises it as a library and behaves and interacts with other people accordingly (Lawson, \n2001). Such norms of behaviour are still largely absent in the virtual world.  On the flip side, \nthe technology cannot interpret many of the clues, both verbal and non-verbal, given off by a \nhuman, as might occur in physical settings. Consider, for example, the reaction of a customer \nwhen he sees an unexpectedly high price for a piece of furniture. In the physical world the \nsalesperson can adjust his approach, make another suggestion or offer a “better deal”.  \nNevertheless, people's interactions with computers and new media are fundamentally social \nand natural, i.e. we expect media to obey a wide range of social and natural rules. These \nrules are derived from the physical world of interpersonal interaction. Reeves and Nass \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  4 \n Products and Services in Cyberspace \n(1996) have conducted research on social responses to communication technologies for over \n10 years and coined the term “the media equation”, meaning media equals real life, to \nillustrate this relationship. The media equation is counterintuitive; we may know \nintellectually that computers do not have feelings, that a computer programme is neither \nfriendly nor hostile, does not have a gender, that a ball thrown at us on a screen will not hit us \nand so forth, still we treat them as if they do. According to the media equation all humans \nautomatically and unconsciously respond socially and naturally to media. The implications \nfor developers of online products and services are numerous. For example, the same rules of \npoliteness apply for web solutions as in real life, something often overseen by web-site \ndevelopers. Furthermore, people will assign a personality to characters on a web site or \npossibly an entire solution, based a number of simple rules that we use in everyday life. \nWords and pictures in media are symbolic representations of “things” such as images, ideas \nand facts that are not actually present. When this information is mediated we often assume \nthat people only think about who sent the information and why, and what it means. However, \nresearch shows that this view can assume too much – when a picture threatens, we don’t \nthink about who created it, what they intended and what it all means; we often think only \nabout what we should do (Reeves and Nass 1996). Put simply, humans have not evolved to \naccommodate twentieth century technology. The human brain evolved in a world in which \nonly humans exhibited rich social behaviour, and a world in which all perceived objects were \nphysical objects – anything that seemed to be a ‘real’ person or place was ‘real’.  \nThe media equation is particularly relevant for information mediated via the Internet as the \nInternet is an interactive space permitting two-way communication, something that was not \npossible with older technologies such as electronic data interchange (EDI). This creates an \nenvironment of immediacy and presence – just consider the impact of instant messaging \n(IM). The Internet defines a new communications environment, what Castells (2001) refers to \nas “the Internet Galaxy” with its own logic and its own language. Profoundly, he notes that \nwith the Internet, communication is usually embedded in social practice, “not isolated in \nsome kind of imaginary world.” And because communication is the essence of human \nactivity, all domains of social life are being modified by the pervasive uses of the Internet.   \nIt is within this medium that organizations are increasingly operating. While the strategic \nimplications of the Internet have been addressed (Evans and Wurster, 2000; Porter, 2001; \nSampler, 1998) the nature of products and services in this medium issues have not received \nthe same treatment. For example, the operations function is traditionally responsible for \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  5 \n Products and Services in Cyberspace \nproducing and delivering products and services, however guidance and best practice are \npremised on activities existing in the physical world, with the distinction between products \nand services guiding decision making. In the remainder of the paper we explore products and \nservices in cyberspace. \nThe Concept of Products and Services in Cyberspace \nProducts and services made available using the Internet will be defined and shaped by \ninformation. This information can be information already available in the organization (e.g. \npricing or product availability) or new information, whether created within the organization \nitself (e.g. richer descriptions of products or digitization of services) or imported from an \nexternal source (e.g. complementary information that can be integrated with internal \ninformation to create a new offering or information provided by a customer to co-create a \nproduct).  \nInformation products are products that may currently exist in a physical form, but can be \ndigitised and distributed electronically. Included are text, images, sounds, video, software, \netc. Such products are essentially knowledge that has been made explicit and turned into \ninformation that has been formalised, for example, books, newspapers, music, a baseball \nscore, stock prices or a web site. They may also represent the intellectual endeavours of the \nstaff of an organization, such as with research, where new knowledge, created within an \norganization, is offered for sale. Information products can also be information assets that \nhave been packaged to appeal to a certain audience or market, for example stock prices for \nprivate investors.  \nApart from innovative services (see below), some traditional services are also mediated by \nthe new medium – what we refer to as digitally mediated services. This continues the \nevolution that has been occurring in service industries as organizations attempt to automate \naspects of the service delivery process to reduce cost and increase quality and consistency of \nthe service as well as improve both convenience and availability of the service (Quinn et al., \n1990). Many online services are information-mediated versions of services that exist off-line. \nAmazon.com provides a book purchasing service. Expedia.com is an online travel agent. \nTesco.com is an online grocer. However, books purchased on Amazon.com or \nBarnsandnoble.com are delivered to the customer by courier or post (although e-books can be \ndistributed electronically). These sites provide the mechanisms to bring together buyers and \nsellers and then transact business; it is this process that is mediated by an information-defined \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  6 \n Products and Services in Cyberspace \nenvironment. Online banks provide customers with services on-line that allows them, among \nother things, to undertake transactions and check balances via the Internet.  \nThe Internet also supports innovative service designs. For example, Salesforce.com delivers \nsales force automation (SFA) functionality over the Net. For a monthly fee, small and \nmedium sized firms in particular, can avail of functionality that would probably be \nprohibitively expensive for them using tradition delivery mechanisms. Person-to-person \nauctions such as eBay.com, or spread-betting operations like Betaq.com, are not \ncommercially viable in the physical world. Location-based services look set to be a key \noffering for mobile devices. In Tokyo, for example, J-Phone’s J-Navi service lets users enter \na phone number, address or landmark, and then searches the area within 500 meters. This \nmakes it possible to find the subway station nearest to a particular shop, or a particular kind \nof restaurant within walking distance of a particular office building; a map to these locations \ncan also be provided. \nBoth digital information products and digitally mediated services have increased in \nimportance over the last few years and are set to do so even more in the future. However, \nthere is a gap in the theory addressing the development, management and marketing of such \nproducts and services. Digital offerings are neither pure products, nor pure services in the \nstrict meaning of the terms. They constitute a category of their own as they have a different \nset of characteristics and therefore need to be managed accordingly. In addition, \nappropriating value from digital information products and digitally mediated services \ndemands different strategies than in the physical world. \nInformation Products, Digital Information Products and Digitally \nMediated Services \nTable 1 compares products and services in the physical and virtual worlds across a number of \ndimensions. Grönroos (1990) has summarised the most commonly mentioned characteristics \nof services and physical products found in the literature and we have used these in our \nanalysis. We have added two additional categories of information products to the table to \nillustrate the differences between physical and digital information products. By traditional \ninformation products we include those with a physical dimensions, for example books, CDs \nor research reports available in the form of a physical document. With digital information \nproducts, content has been digitised and thus can be sold and distributed on-line. Examples \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  7 \n Products and Services in Cyberspace \nare electronic books, music in the form of MP3 files, news, games, software, or the research \nreports sold on-line by companies.  \nNote, however, that today there are few “pure” products or services as companies selling \nproducts often try to enhance the value of their products by offering add-on services, and \ncompanies selling service often try to “productify” their services to make the value to the \ncustomer more concrete. This trend is illustrated by the rise of “solutions” as an attempt to \nprofile a complex mix of physical product(s), service(s) and information product(s). Many \nphysical products today often include an information product as a “wrap around” to enhance \nthe solution to customers. For example, Slendertone, with its FLEX MAX toning product that \nexercises the muscles of the abdomen, offers a mentor service – an on-line personalised \nmotivational and advice programme designed to help users of their products achieve diet and \nfitness goals (www.slendertone.com). With traditional and digital information products, the \nsame content can be found in both physical and digital form. The purpose of Table 1, \nhowever, is to illustrate the differences between the different categories of offerings. \n \n \nAttributes \n \nPhysical products Services  \nprovided in \nphysical world \nPhysical \ninformation \nproducts \nDigital \ninformation \nproducts \nDigitally mediated \nservices \nLevel of \nabstraction \nConcrete Abstract Concrete Both a concrete \nand abstract \ndimension.  \nAbstract, but with \na concrete \ndimension because \nof representation \nin medium \nLevel of \nheterogeneity \nHomogenous (all \nproducts the same) \nHeterogeneous (all \nservices unique) \nHomogenous Depends on the \nlevel of \ninteractivity and \npersonalisation \nCan be both, \ndepending on level \nof interactivity and \nsophistication \nComplexity of \nvalue chain \nProduction and \ndistribution \nseparated from \nconsumption \nProduction, \ndistribution and \nconsumption are \nparallel processes \nProduction and \ndistribution \nseparated from \nconsumption \nCombination. A \ndigital information \nproduct is to some \nextent separated \nfrom production, \nbut the final output \nwill sometimes be \nco-created with the \nconsumer (in the \ncase of interactive \nproducts). \nDistribution can be \neither separate or \nsimultaneous with \nconsumption \nProduction is at \nleast partly \nseparate from \nconsumption – and \ncan be entirely \nseparate \n(depending on \nlevel of \ninteractivity). \nDistribution and \nconsumption are \nparallel processes. \nObject or process An object An activity or \nprocess \nAn object Combination. Can \nbe an object, but \npredominantly a \nprocess  \nAn activity or \nprocess.  \n \nTABLE 1. Differences between physical and digital products, services and information \nproducts. \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  8 \n Products and Services in Cyberspace \n \n \n \nAttributes \n \nPhysical products Services  \nprovided in \nphysical world \nPhysical \ninformation \nproducts \nDigital \ninformation \nproducts \nDigitally mediated \nservices \nPoint of value \ncreation \nReal value* is \ncreated during \nproduction \nReal value is \ncreated in the \ninteraction \nbetween buyer and \nseller \nReal value is \ncreated during \nproduction \nReal value is \ncreated partly \nduring production, \npartly on \nconsumption \n(experience) – i.e. \nin the interaction \nbetween the \nproduct and the \nconsumer \nReal value is \ncreated partly \nduring production, \npartly on \nconsumption \n(experience) – i.e. \nin the interaction \nbetween the \nservice and the \nconsumer \nRole of customer \nin production \nCustomer does not \n(normally) take \npart in production. \n[If a product is \ncustomised it is \nmore of a service] \nCustomer is part \nof production \nprocess \nCustomer does not \n(normally) take \npart in production \nCustomer may or \nmay not be part of \nthe production \nprocess, depending \non the level of \ninteractivity \nCustomer may or \nmay not be part of \nthe production \nprocess, depending \non the level of \ninteractivity \nAbility to store Can be stored Cannot be stored Can be stored The “base” \nproduct (e.g. \nsoftware) can be \nstored, but not the \n“end” product \n(experience), \nparticularly if \ninteractive. \nService capability \ncan be stored, \nalthough not the \n“end” service if \nco-created by the \ncustomer.  \nOwnership Transfer of \nownership on \npurchase \nNo transfer of \nownership \nComplex issue. \nOwnership of \nobject is \ntransferred, but not \nnecessarily of \ncontent, depending \non intellectual \nproperty \narrangements. \nGenerally \nownership of \ncontent is \nexpanded rather \nthan transferred \n(see body of \npaper) \nComplex issue \n(depends on \nintellectual \nproperty \narrangements). \nGenerally \nownership of \ncontent is \nexpanded rather \nthan transferred \n(see body of \npaper) \nNo transfer of \nownership of \nservice but certain \n“rights” may be \nconferred \n* We have used Grönroos’ framework as a point of departure for this table, therefore we also use his vocabulary. Please note \nthat what he refers to as “real value” is the point when value can be realised through sales – i.e. value is expressed from the \nsellers perspective. One can also argue that real value is only created when the product or service is consumed – i.e. value is \nexpressed from the customers’ perspective. \nTABLE 1 CONTD. Differences between physical and digital products, services and information \nproducts. \n \nThis table illustrates the major shift that the Internet, means for the development, \nmanagement and commercialisation of digital information products and digitally mediated \nservices.  Using the dimensions of this table, we can see that physical information products \nhave much in common with physical products as they are constrained by their physical \npresentation, whereas the characteristics of digital information products are different. In fact, \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  9 \n Products and Services in Cyberspace \nin many respects – and in particular if they are interactive – digital information products have \nmore in common with services than with physical information products. Their interactive \ncapability, together with the elimination of the costs and problems associated with physical \ndistribution and the impact of network externalities, open up a multitude of new opportunities \nfor organizations to exploit information through new digital offerings. On the other hand, \ndigitally mediated services have several features in common with traditional products, not \npresent with traditional services available in the physical world. Face-to-face interaction with \nthe customer, so often critical for services in the physical world, is not possible for digitally \nmediated services. However, service capability can be stored and better controlled, thus \npromising more consistent quality of services while also removing the constraints of time and \nplace.  \nThis analysis illustrates why the practice of simply moving traditional information products \nto the Internet will so often fail – physical information products and digital information \nproducts have fundamentally different characteristics. In fact, producers of digital \ninformation products have more to learn from providers of traditional services than from \nproviders of traditional information products. Worth highlighting is that many on-line \nservices are generally more demanding of the customer than their physical world counterpart. \nWhile the customer can be more or less passive in the physical world, he is now required to \nbecome more involved in the provision of the service.  The service is thus co-created and this \nhas implications for customer value.  \nAs some services move online, significant assumptions are made about the customer, \nincluding their knowledge-base. Consider the purchasing of airline tickets. If a customer uses \na travel agency in the physical world to purchase a seat, the agent will usually ensure that she \nunderstands the travel requirements of the customer and combines that knowledge with her \nknowledge of airline travel. For example, that a return ticket is cheaper than a single ticket or \nthat a Saturday night stay usually reduces the cost of a ticket. Some travel agents will also \nbook “back-to-back tickets” for midweek travel, which can reduce the cost of tickets – many \ntravellers are unaware of this. Travel websites will usually permit a customer to book single \ntickets to and from a particular destination; in the physical world, the agent would point out \nthat it is cheaper to buy a return ticket. \nInformation products, like services in the physical world, are also experience goods (Peterson \net al., 1997), that is, the customer has to experience the product in order to value it. How do \nyou know the value of the newspaper until you have read it? Or whether you like a piece of \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  10 \n Products and Services in Cyberspace \nmusic until you have listened to it? Or the usefulness of report until you have read it? \nTherefore consumer choice decisions are influenced by emotional expectations rather than \ncognitive product attributes. Informational inputs such as critics reviews, word-of-mouth and \nadvertising, as well as latent product interest, are also important determinants of consumer \nchoice (Neelamegham and Jain, 1999). The lack of tangible cues for the customer to assess \nthe quality of the information product of course poses particular problems for their marketing \n– especially given the emphasis of quality over quantity.  A way around this problem is to \ndistribute samples or previews of parts of the information product for free. Building a brand \nand reputation, which provide some sort of guarantee that the content will have a certain \nquality or profile, also becomes a critical activity.  \nDigital information products and digitally mediated services are non-rivalous; that is, one \nperson’s consumption does not diminish the amount available to others. Reading a report, for \nexample, does not mean that the information it contains is now not available to others. In \nfact, any number of people can read the same report at the same time. And, unlike traditional \nphysical assets, it does not depreciate through usage. This is why the issue of transfer of \nownership becomes complex, with intellectual property (IP) rights requiring consideration. \nThe seller of an information product still retains the valuable information, no matter how \nmany people it is sold to. However, by becoming widely available its value may reduce; \nscarcity often means that a higher price can be extracted for particular information. On the \nother hand, the opposite situation may also hold true, it is only when an information product \nhas become widely known (e.g. a book or a movie), or there is a sufficient number of other \ncompatible information products available on the market, that the information product \nreaches a critical mass and thus has a greater value to the users (e.g. Napster or MS \nwindows). This is the network effect, and it can be particularly powerful for digital \ninformation products because of their ease of distribution (Arthur, 1994).  \nConclusion \nIn this paper we have suggested that in developing an online strategy, organizations must \nconsider the Internet as a medium and evaluate the implications of this business environment \nfor products and services as well as its impact on consumer behaviour. Taking most existing \nproducts and services and moving them directly to the Net without this consideration is likely \nmean that online strategies are sub-optimal.  \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  11 \n Products and Services in Cyberspace \nAs with any new technology, we are often constrained in our thinking of new applications by \nthe previous technologies that have dominated our society. Over a decade ago, in introducing \nthe concept of reengineering to the world, Hammer (1990) advised against “paving the cow \npath” with technology – in short, overlaying traditional work processes and practices with \ntechnology. He exhorted organizations to seek out innovative opportunities to deploy \ntechnologies by redesigning work processes and that this would lead to significant \nperformance improvement. An argument of similar sentiment can be expressed for this \nmedium.  \nIn this paper, we have demonstrated that the nature of products and services changes in \nvirtual environments. The difference between products and services becomes increasingly \nblurred as products take on characteristics of physical world services and visa versa, and both \ntake on an entirely new set of common characteristics, different from those of the physical \nworld. As the differing characteristics of products and services have guided operations \ndecisions, it is important to now consider the impact of cyberspace on the theory and practice \non their design, delivery and management. Given that the new space is defined by \ninformation, it may be that in the future the disciplines of operations management and \ninformation systems will move closer together. \nReferences \nArthur, B (1994), Increasing Returns and Path Dependence in the Economy, University of \nMichigan Press, Ann Arbor. \nBowen, J and Ford, RC (2002), ‘Managing service organizations: does having a “thing” make \na difference?’ Journal of Management, Vol. 28, No. 3, pp. 447-469. \nButler, P and Peppard, J (1998), ’Consumer purchasing on the Internet: processes and \nprospects’, European Management Journal, Vol. 16, No. 5, pp. 600-610. \nButler, P (2003), ‘Internet retailing: dislocation, dislocation, dislocation’, Working Paper, \nUniversity of Dublin, Trinity College, Dublin.  \nCastells, M (2001), The Internet Galaxy: Reflections on the Internet, Business, and Society, \nOxford University Press, Oxford. \nDatal, S, Landesberg, H. and Zeisser, M. (2000), ‘Building digital brands’, McKinsey \nQuarterly, No. 2, pp. 42-51. \nEvans, P and Wurster, TS (2000), Blown to Bits: How the New Economics of Information \nTransform Strategy, Harvard Business School Press, Boston. \nGrönroos, C (1990), Service Management, ISL Förlag, Göteborg, Sweden. \nHammer, M (1990), ‘Re-engineering work: Don’t automate, obliterate’, Harvard Business \nReview, July-August, pp. 104-112. \nHavick, J (2000), ‘The impact of the Internet on a television-based society’, Technology in \nSociety, vol. 22, pp. 273-287. \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  12 \n Products and Services in Cyberspace \nHeizer, J. and Render B (1999), Operations Management (Fifth Edition), Prentice-Hall, New \nJersey. \nJarvenpaa, S and Grazioli, S (2000), ‘Surfing among the sharks: how to gain trust in \ncyberspace’, ed. DA Marchand, TH Davenport and T Dickson, Mastering Information \nManagement, Pearson, London, pp. 197-201. \nKoufaris, M and Hampton-Sosa, W (2004) ‘The development of initial trust in an online \ncompany by new customers’, Information & Management, Vol. 41, pp. 377-397. \nKoufaris, M, Kambil, A and LaBarbera, PA (2002) ‘Consumer behavior in web-based \ncommerce: an empirical study’, International Journal of Electronic Commerce, Vol. \n6, No. 2, pp. 115-138. \nKim, K and Prabhakar, B (2000), ‘Initial trust, perceived risk, and the adoption of Internet \nbanking’, in Proceedings of 21st International Conference on Information Systems, \nDecember 10-13th, Brisbane, Australia, pp. 537-543. \nLawson, B (2001), The Language of Space, Architectural Press, UK. \nMcKnight, DH, Choudhury V and Kacmar C (2002) ‘The impact of initial consumer trust on \nintention to transact with a web-site: a trust building model’, Journal of Strategic \nInformation Systems, Vol. 11, No. 3\/4,  pp. 297-324. \nNeelamegham, R and Jain, D (1999), ‘Consumer choice process for experience goods: an \neconometric model and analysis’, Journal of Marketing Research, vol. XXXVI, pp. \n373 – 386 \nPeterson, R Balasubramanian, S and Bronnenberg, B (1997), ‘Exploring the implications of \nthe Internet for Marketing’, Journal of the Academy of Marketing Science, Vol. 25, \npp. 329-346. \nPorter, ME (2001), ‘Strategy and the Internet’, Harvard Business Review, March, pp. 63-78. \nQuinn, JB, Doorley, TL and Paquette, PC (1990), ‘Technology in services: rethinking \nstrategic focus’, Sloan Management Review, Winter, pp. 79-87. \nReeves, B and Nass, C (1996), The Media Equation: How People Treat Computers, \nTelevision and New Media Like Real People and Places, CSLI Publications, \nCambridge, USA. \nSampler, J (1998), ‘Redefining industry structure for the information age’, Strategic \nManagement Journal, vol. 19, pp. 343-355. \nSchmenner, RW (1995), Service Operations Management, Prentice-Hall, Englewood Cliffs, \nNew Jersey. \nShapiro, C and Varian, HR (1999), Information Rules: A Strategic Guide to the Network \nEconomy, Harvard Business School Press, Boston, MA. \nSlack, N, Chambers, S and Johnson, R (2001), Operations Management, 3rd Edition, Pearson \nEducation Limited, Harlow, England. \nTorkzadeh, G and Dhillon, G (2002) ‘Measuring factors that influence the success of Internet \ncommerce’, Information Systems Research, Vol. 13, No. 2, pp. 187-204. \nPre-publication version \nInternational Journal of Information Management, Vol 25, 2005, pp. 335-345. \n  13 \n"}