{"doi":"10.1177\/008124639802800304","coreId":"199381","oai":"oai:eprints.lse.ac.uk:2888","identifiers":["oai:eprints.lse.ac.uk:2888","10.1177\/008124639802800304"],"title":"Perceptions of HIV\/AIDS on a Johannesburg gold mine","authors":["Macheke, Cecil","Campbell, Catherine"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1998-09","abstract":"Semi-structured interviews were conducted with 40 mine-workers on a Johannesburg gold mine, focusing on workers’ perceptions of health, HIV\/AIDS and sexuality. The paper seeks to highlight a range of factors which might predispose mine-workers to high-risk sexual behaviour, despite the fact that they had all attended HIV-education programmes. These factors are presented within a framework that views the process of sexual decision-making as a debating process - in which competing facts and beliefs are weighed up against one another - within the context of a range of normative and social parameters. Firstly attention is given to a number of pre-existing perceptions and doubts which may blunt the force of the facts that HIV educational messages seek to impart to this particular group of people. These include a lack of perceived urgency regarding the treatment of sexually transmitted diseases (STD’s), a commitment to ‘flesh-to-flesh’ sex , a dislike of condoms, and faith in the ability of traditional healers to cure a range of STD’s and possibly also HIV\/AIDS. Secondly attention is given to the normative context of sexuality, and in particular the way in which norms of masculinity predispose people to high-risk sexual behaviour. Finally the paper focuses on some aspects of social and occupational life on the mines as the context within which sexual relationships are conducted. These include the phenomenon of single sex hostels, an acceptance of high levels of disease and accidents as the norm, and the use of alcohol. The paper concludes with a discussion of the challenges these findings pose for a peer education programme which is shortly to be implemented in the mining context","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/199381.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/2888\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Campbell%2C%20C_Perceptions%20of%20HIV%20AIDS_Campbell_Perceptions%20of%20HIVAIDS_2014.pdf","pdfHashValue":"bd9b5ed36a4480ae48b27c83569932af840514f3","publisher":"Psychological Society of South Africa (PsySSA)","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:2888<\/identifier><datestamp>\n      2016-06-20T11:19:29Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5053<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D504253<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/2888\/<\/dc:relation><dc:title>\n        Perceptions of HIV\/AIDS on a Johannesburg gold mine<\/dc:title><dc:creator>\n        Macheke, Cecil<\/dc:creator><dc:creator>\n        Campbell, Catherine<\/dc:creator><dc:subject>\n        HT Communities. Classes. Races<\/dc:subject><dc:subject>\n        RA0421 Public health. Hygiene. Preventive Medicine<\/dc:subject><dc:description>\n        Semi-structured interviews were conducted with 40 mine-workers on a Johannesburg gold mine, focusing on workers’ perceptions of health, HIV\/AIDS and sexuality. The paper seeks to highlight a range of factors which might predispose mine-workers to high-risk sexual behaviour, despite the fact that they had all attended HIV-education programmes. These factors are presented within a framework that views the process of sexual decision-making as a debating process - in which competing facts and beliefs are weighed up against one another - within the context of a range of normative and social parameters. Firstly attention is given to a number of pre-existing perceptions and doubts which may blunt the force of the facts that HIV educational messages seek to impart to this particular group of people. These include a lack of perceived urgency regarding the treatment of sexually transmitted diseases (STD’s), a commitment to ‘flesh-to-flesh’ sex , a dislike of condoms, and faith in the ability of traditional healers to cure a range of STD’s and possibly also HIV\/AIDS. Secondly attention is given to the normative context of sexuality, and in particular the way in which norms of masculinity predispose people to high-risk sexual behaviour. Finally the paper focuses on some aspects of social and occupational life on the mines as the context within which sexual relationships are conducted. These include the phenomenon of single sex hostels, an acceptance of high levels of disease and accidents as the norm, and the use of alcohol. The paper concludes with a discussion of the challenges these findings pose for a peer education programme which is shortly to be implemented in the mining context.<\/dc:description><dc:publisher>\n        Psychological Society of South Africa (PsySSA)<\/dc:publisher><dc:date>\n        1998-09<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/2888\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Campbell%2C%20C_Perceptions%20of%20HIV%20AIDS_Campbell_Perceptions%20of%20HIVAIDS_2014.pdf<\/dc:identifier><dc:identifier>\n          Macheke, Cecil and Campbell, Catherine  (1998) Perceptions of HIV\/AIDS on a Johannesburg gold mine.  South African Journal of Psychology, 28 (3).  pp. 146-153.  ISSN 0081-2463     <\/dc:identifier><dc:relation>\n        http:\/\/sap.sagepub.com\/<\/dc:relation><dc:relation>\n        10.1177\/008124639802800304<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/2888\/","http:\/\/sap.sagepub.com\/","10.1177\/008124639802800304"],"year":1998,"topics":["HT Communities. Classes. Races","RA0421 Public health. Hygiene. Preventive Medicine"],"subject":["Article","PeerReviewed"],"fullText":"  \nCecil Macheke, Catherine Campbell \nPerceptions of HIV\/AIDS on a \nJohannesburg gold mine \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nMacheke, Cecil and Campbell, Catherine (1998) Perceptions of HIV\/AIDS on a Johannesburg \ngold mine. South African Journal of Psychology, 28 (3). pp. 146-153. ISSN 0081-2463  \n \nDOI: 10.1177\/008124639802800304 \n \n© 1998 Psychological Society of South Africa \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/2888\/ \n \nAvailable in LSE Research Online: May 2014 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \nPERCEPTIONS OF HIV\/AIDS ON A JOHANNESBURG GOLD MINE \n \nCecil Macheke, Epidemiology Research Unit, P O Box 30606, Braamfontein, 2017. \nCatherine Campbell, Social Psychology, London School of Economics and Political Science, \nHoughton Street, London, WC2A 2AE.* \n \n*Please address correspondence to the 2nd author (c.campbell@lse.ac.uk) \nAbstract \n \nSemi-structured interviews were conducted with 40 mine-workers on a Johannesburg gold \nmine, focusing on workers’ perceptions of health, HIV\/AIDS and sexuality. The paper seeks \nto highlight a range of factors which might predispose mine-workers to high-risk sexual \nbehaviour, despite the fact that they had all attended HIV-education programmes. These \nfactors are presented within a framework that views the process of sexual decision-making as \na debating process - in which competing facts and beliefs are weighed up against one another \n- within the context of a range of normative and social parameters. Firstly attention is given \nto a number of pre-existing perceptions and doubts which may blunt the force of the facts that \nHIV educational messages seek to impart to this particular group of people. These include a \nlack of perceived urgency regarding the treatment of sexually transmitted diseases (STD’s), a \ncommitment to ‘flesh-to-flesh’ sex , a dislike of condoms, and faith in the ability of \ntraditional healers to cure a range of STD’s and possibly also HIV\/AIDS.  Secondly attention \nis given to the normative context of sexuality, and in particular the way in which norms of \nmasculinity predispose people to high-risk sexual behaviour. Finally the paper focuses on \nsome aspects of social and occupational life on the mines as the context within which sexual \nrelationships are conducted. These include the phenomenon of single sex hostels, an \nacceptance of high levels of disease and accidents as the norm, and the use of alcohol. The \npaper concludes with a discussion of the challenges these findings pose for a peer education \nprogramme which is shortly to be implemented in the mining context. \n \n \nIntroduction \n \nWhy do people often continue to have unsafe sex with multiple partners even when they have \nattended health education programmes and are in possession of correct factual knowledge \nabout the causes of HIV\/AIDS and methods of prevention? This paper reports on an \ninterview-based investigation of gold mine-workers’ knowledge of HIV\/AIDS, in an attempt \nto illustrate why knowledge of health risks is such a weak determinant of health-related \nsexual behaviour in the mining context. Research findings are presented within a framework \nthat views the process of sexual decision-making as a debating process - in which competing \nfacts and beliefs are weighed up against one another - within the context of a range of \nnormative and social parameters. \n \nLevels of HIV\/AIDS in South African are on the increase. The only available statistics on the \nnation-wide prevalence of HIV infection are for women attending ante-natal clinics \n(Epidemiological Comments, 1996). While little recent published data exist regarding the \nincidence or prevalence of HIV\/AIDS amongst mine workers, a range of informal estimates \nhave put the figure at between 15% and 25% of all mineworkers. Given the lack of a vaccine \nor an affordable cure for HIV disease, current thinking on the gold mines seems to favour two \nmajor strategies regarding the prevention of HIV\/AIDS transmission. The first is the \naggressive detection and treatment of associated diseases, in particular sexually transmitted \ndiseases (STDs). The second is the promotion of HIV\/AIDS awareness through education \ncampaigns designed to give people information about HIV\/AIDS, linked to the distribution of \ncondoms. Mine management has devoted considerable energy and resources to HIV\/AIDS \neducation, but Crisp (1996) comments that while such programmes have succeeded in \nincreasing peoples’ knowledge about HIV\/AIDS, such education programmes have not been \nas successful as hoped in bringing about HIV-preventive behaviour change. \n \nPoor correlations between knowledge about HIV\/AIDS and ‘safe’ sexual behaviour are well \ndocumented in the social scientific literature (see Campbell and Williams 1996 for a review \nof South African findings, and Gillies 1996 for a more international perspective). Such \nresearch findings pose a particular challenge for health educators, namely that of developing \ninnovative health educational programmes which attempt not simply to provide information \nabout health risks in the interests of increasing peoples’ factual knowledge about HIV\/AIDS, \nbut also to provide the context for the collective renegotiation of group norms of sexual \nbehaviour. Such programmes have been successful in certain sub-Saharan African contexts \n(Dube and Wilson 1996; Wilson and Lavelle 1993) and a number of initiatives are currently \nunderway to explore the possibility of adapting such  alternative approaches for the South \nAfrican mining context (Williams and Campbell, 1996). This paper will explore some of the \nreasons for the poor correlation between mineworkers’ knowledge about HIV\/AIDS and their \nsexual behaviour drawing on a recent pilot study into mineworkers’ perceptions of health and \nHIV\/AIDS, in the interests of arguing why such alternative programmes need to replace more \ntraditional information-based programmes as a matter of urgency. \n  \nMethod \n \nThere have been numerous calls for more qualitative research into the social context of \nHIV\/AIDS and sexuality both internationally (e.g. Gillies 1996) and in the context of sub-\nSaharan African (e.g. Scott and Mercer, 1994). In the spirit of such calls, the current study \n(part of the Epidemiology Research Unit’s Perceptions of Health Project) took the form of \nsemi-structured in-depth interviews with 40 mine workers, conducted over a two-month \nperiod in early 1995.  Interviews were conducted at a mine clinic in the Johannesburg area. \nAs agreed with informants, the mine will not be named in the interests of confidentiality and \nanonymity. \n \nInformants \n \nInformants were recruited from the waiting room of a first aid clinic attended by people with \nminor ailments e.g. colds, minor injuries (more serious cases attend the mine hospital) and by \nhealthy workers returning from home leave, who are required to undergo routine medical \ncheck-ups prior to returning to work. Workers are continually leaving and arriving on the \nmines at a fairly steady rate throughout the course of each month of the year. Taking this into \naccount, we believe that our informants are adequately representative of the workforce on a \ntypical gold mine in the Johannesburg area. \nInitially informants were approached by the clinic supervisor as they sat in the clinic waiting \narea. The supervisor introduced them to the interviewers. Between 20 and 30 minutes were \nspent prior to the start of the interview negotiating the interview conditions with the \ninformants. Informants were told that the ERU was an independent research body, with a \nmanagement committee consisting of representatives of universities, doctors, trade unions \nand mine management. They were told that participation in the interview would not result in \nany direct reward to them as individuals, but that the aim of the study was to generate \nknowledge about mine workers’ perceptions of health and illness - an area which had been \nunder-researched in the past. The principles of anonymity and confidentiality were outlined. \nAs agreed with informants they would be identified only by number (informant 1 ... \ninformant 40) in the reports, and the mine on which they worked would not be identified. \nInformants were then given the opportunity to ask questions about the study. Thereafter \nformal permission to be interviewed was requested. At this stage approximately 5 workers \ndeclined to be interviewed, and 40 agreed. A consent form was signed. At the end of each \ninterview, informants were asked for feedback. While several complained that the interview \nhad been too long, every informant said he was pleased that he had participated, and had \nfound the interview a positive experience. \n \nThe age range of informants was 22 to 49 years (mean age 33.8 years, median age 33 years). \nOf the 40 informants who were interviewed, 1 lived in a nearby township, 2 in more distant \ntownships, and 37 were migrants coming from Lesotho (13), KwaZulu-Natal (10), the former \nTranskei (13) and Botswana (1). Thirty-one of the informants were married with children. \nInformants’ home languages included Zulu (10), Xhosa (12), Sotho (16) and Tswana (2). \n \nInterviews \n \nThe interviews were on average 3.5 hours long (excluding hourly breaks for refreshments and \nshort walks), and were conducted in informants’ home languages by a multilingual interview \nteam. Interviews were tape recorded, and later transcribed and translated into English. The \nadvantages of in-depth qualitative research on relatively small samples are well-documented \nin the social science literature when the intention is to generate information about complex \nsocial dynamics which cannot be accessed using quantitative survey questionnaires (Miles \nand Huberman, 1994). An open-ended semi-structured questionnaire was constructed as the \nmost appropriate method for locating miners’ understandings of their health, of HIV\/AIDS \nand of their sexuality within the broader context of their everyday life experiences. The \nquestionnaire had two sections. The first part aimed to elicit general background information \nabout informants’ working, social and sexual lives. The second part focused more specifically \non informants’ understandings of specific health-related issues: in particular HIV\/AIDS, \ntuberculosis and sexually transmitted diseases. (See Campbell and Williams, 1995, for a full \ncopy of the interview protocol.) \n \nData analysis \n \nInterview analysis took place in two phases. The first phase consisted of examining \ninformants’ responses to three simple factual questions about HIV\/AIDS. The first concerned \nwhether or not HIV\/AIDS existed. This question was asked against the background of \ninformal reports that because many mine workers had never seen anyone with full-blown \nAIDS, they were skeptical about the existence of the disease. The second question regarded \nhow one could protect oneself against HIV\/AIDS, and the third concerned whether or not \ninformants used condoms in casual sexual encounters. Percentages were calculated reflecting \nthe proportion of informants who were in possession of correct factual knowledge about HIV, \nand the proportion of informants who said that they used condoms in sexual encounters other \nthan those with their wives or primary partners.  \n \nInformants reported that they had been taught about HIV\/AIDS through their mine’s AIDS \nAwareness Education Programme which they must attend when they come back to the mine \nat the start of each new annual contract. Those who had presented at the mine clinic with \nSTD’s had also been counselled about HIV. The radio and the media were cited as two \nadditional sources of information. \n \nNinety percent of our informants believed that HIV\/AIDS existed (as opposed to the other \n10% who said they were skeptical since they had never seen anyone with HIV\/AIDS). \nEighty-five percent said that condoms were the best means of avoiding HIV transmission - \nbut only one-third of these said they had ever used a condom in a casual sexual encounter. \n \nThe second phase of interview analysis took the form of an interpretative thematic analysis, \ninvolving the detailed reading and re-reading of the interviews in order to generate \nexplanations of why it is that some mineworkers continue to knowingly engage in potentially \nlife-threatening sexual behaviour. This analysis was conducted by the first author, in on-\ngoing consultation with the second author (both had been members of the project’s interview \nteam). This stage of analysis pointed to three broad groupings of factors that might be said to \nmediate the relationship between AIDS-related knowledge and sexual behaviour: (i) \ncompeting beliefs that may serve to contradict the information that health education \nprogrammes seek to impart; (ii) the normative context of sexuality; and (iii) the social context \nof sexuality in the mining  context. Each of these themes will be dealt with in turn. \n \nWe suggest that each of these factors need to be taken account of in generating explanations \nas to why mineworkers continue to engage in unsafe sexual behaviour, despite their \npossession of factual knowledge about the dangers of such behaviour. Knowledge about \nHIV\/AIDS is more complex than a series of ‘facts’ of the kind which information-based \nhealth education programmes seek to impart (e.g. ‘HIV\/AIDS is an incurable disease’, \n‘condoms serve as an important means of HIV-prevention’). We will illustrate the way in \nwhich such facts are located within the framework of a complex and detailed web of ideas \nconcerning health in general, sexuality, traditional values and healing systems - as well as a \nset of social conditions which shape and constrain peoples’ sexual choices. The acquisition of \nnew knowledge is not a seamless process, with new information neatly taking the place of \npre-existing or non-existent information. The process of human thinking takes the form of a \ncomplex debate (which is both conducted intra-personally within a particular individual, as \nwell as inter-personally within his\/her social groupings) in which an often complex range of \nideas are weighed up against one another in a process of on-going debate and negotiation,  \nand where the conclusions of these debates are influenced by peoples’ concrete social and \nmaterial conditions (Billig 1987\/1996). \n \nCompeting beliefs that may contradict HIV education messages \n \nFactual knowledge about HIV\/AIDS: doubts and uncertainties. \n \nLooking closely at our interview data it seems that while informants were often in possession \nof the basic facts about HIV, which they had internalised through information-based \nprogrammes, these facts were embedded within a range of doubts, qualifications, \ncontradictions and uncertainties. We would argue these doubts and uncertainties might serve \nto blunt the factual messages imparted by information-based health education programmes. \nHealth education messages are not simply passively accepted by miners but must compete \nwith alternative beliefs, experiences and logics which may be more compelling than the \ninformation the health educator seeks to impart. \n \nIn some cases miners were actively skeptical of the educational information.  As we have \nalready said, ten percent of informants said they did not believe that HIV\/AIDS existed at all. \nAs one man commented: \n \nAccording to lectures we receive at the mine school, AIDS starts by being a small black sore. \nHowever  I have had several such sores and have seen other people with such sores as well - and \nto my surprise, the medical doctors don’t say that I have AIDS ... this whole claim about AIDS is \nimplausible. \n \nAmongst those who did believe that HIV existed,  several commented that they were not sure \nthat the problem existed in South Africa. \n \nInformant: My understanding is that HIV\/AIDS happens overseas, but we have never had it here. \n \nInformant: I am not sure about whether we have HIV\/AIDS here in South Africa but I hear from \ndoctors that HIV\/AIDS exists in other countries. \n  \nSeveral people said they had never seen anyone with HIV\/AIDS. \n \nInformant: Well I have heard that HIV exists through the radio and the mine’s programmes which \nwe attend when we come back from leave, but I have never seen anyone with it. \n \nOne mine worker commented that this lack of first-hand interaction with persons with AIDS \nmight be one of the reasons for skepticism amongst certain of his peers about its existence, \nand he suggested that this lack of first-hand contact was one of the reasons why miners did \nnot change their sexual behaviour despite the threat of the disease: \n \nIf someone that was personally known to people could die of AIDS, this would provide a good \nexample to motivate men to change their behaviour. \n \nIt must be remembered that these interviews were conducted at the relatively early stages of \nthe HIV\/AIDS epidemic in South Africa. First-hand contact with HIV\/AIDS sufferers will no \ndoubt increase as the epidemic progresses. However we would like to make the more general \npoint that health education messages may be received with skepticism if they do not resonate \nwith the first-hand life experience of members of the target audience (Stockdale, 1995). \nHealth educational interventions are most likely to be successful when members of the target \naudience are integrally involved in their design. One of the reasons for this is that members of \ntarget audiences will be the most familiar with local beliefs and norms which might seek to \ncontradict HIV-prevention messages. \n \nThe following sections focus on informants’ comments about condoms and STD’s. These \nprovide further illustration of the way in which health education messages are inserted into a \nbroader set of beliefs and experiences about health - which may often serve at worst to \ncontradict or at best to blunt the impact of the information health educators seek to impart. \n \nPerceptions of condoms \n \nWhile 85% of our informants cited condom usage as the means of protecting oneself against \nHIV\/AIDS, two-thirds of these commented that they had never used a condom in a casual \nsexual encounter. The explanation most frequently offered was that (a) condoms made sexual \nintercourse ‘unnatural’, and (b) that they took away the pleasure from sex. Against the \nbackground of these two arguments ‘flesh-on-flesh’ sex was preferable. \n \nInterviewer: What about condoms? Informant: (laughs) I have not tried them before. Interviewer: \nWhy not? Informant: They say you feel like you are making love to the condom rather than  \nenjoying the woman. \n \nSome men commented that they were too shy to use condoms because of their unfamiliarity. \nInterviews revealed a number of misconceptions about condoms which might be related to \ntheir low usage by miners. For example one informant said that he had never used condoms \nbecause he believed it would be inconvenient for him to use a condom if he was sleeping \nwith a woman for the whole night because it would get tedious for him to keep having to get \nup to wash the condom after each ejaculation. Another said he avoided condoms because he \nhad been told that they were cold and uncomfortable. Several informants also commented \nthat condoms could get stuck inside a woman. \n \nInformant: I think condom is wasting my time. Interviewer: Have you ever tried one? Informant: \nYes I tried it once, but even before I could ejaculate, this woman ran away and I ended up \nejaculating in this condom. Later she said that she had been scared that once I had ejaculated, the \ncondom would be left inside her. \n There was also the perception that women did not like men to use condoms with them \nbecause that implied that the man did not trust her and regarded her as a prostitute. \n \nInformant: If you suggest condoms to some of women around the mines they reply: ‘You don’t \nbelieve that I am clean, you think that I have diseases, and that I am a prostitute’. Some men avoid \nsuggesting condom use because they are afraid of angering the woman. \n \nThe importance of ‘flesh-on-flesh’ sex for health \n \nAnother reason for informants’ reluctance of use condoms related to their belief that regular \nsex is necessary for good health, and that only flesh-on-flesh sexual contact can satisfy male \nsexual needs (see Campbell, 1997, for an extended discussion of this point). They commented \nthat the build-up of sperm could lead to mental problems, such as mental confusion, violence \nand bad-temperedness. It could also lead to physical problems such as pimples and high \nblood pressure. A man who had remained celibate for too long might a be unable to control \nhis desire for sex when he encountered a CSW in the street, even if he did not have a condom \nwith him. \n \nInterviewer: Do people worry about AIDS on the mines? Informant: It does scare  them but it is \ndifficult for a man to stay without a woman for a long time, it is a risk that men take to go and see \nwomen. \n \nInterviewer: Is it possible for a man to live without sex? Informant: I don’t think a man could \nsurvive without sex for very long. \n Informants differed in their estimates of how long a man could stay without sex without \nsuffering physical and emotional consequences. Such estimates varied from one year  to less \nthan a week (for example one person said he visited a commercial sex worker every day). \n \nPerceptions of sexually transmitted diseases \n \nCertain of informants’ perceptions of STD’s could also serve as potential obstacles to HIV-\npreventive behaviour. Not one informant appeared to be aware of the way in which STD’s \nincreased one’s risk of HIV infection. No one appeared to regard STD’s as particulary \nserious. For some, the success of STD treatments they had undergone at the mine hospital \nand clinics has had an somewhat unintended consequences insofar as they commented that \nsince ‘the drop’ (a colloquial term for an STD) could easily be cured by biomedical doctors \nwithin a week of undergoing treatment, it was not very serious. \n \nInformant: When we advise each other in the hostel we usually say that if you are with a woman \non Mondays and you get the drop, you should make sure that you see a doctor by Thursday to \nmake sure that it is cured before seeing her again. After getting cured people simply go back to the \nsexual behaviour they were doing before and get sick again and again. \n \nA number of articles have referred to myths about STD’s which may serve as obstacles to \nHIV-preventive behaviour (e.g. Hickson and Mokhobo, 1992). Thus for example a number of \npeople claimed that one of the causes of  the drop was sleeping with women who use birth \ncontrol pills. These pills would leave ‘dirt’ inside the woman - which would then get into the \nmale during sexual intercourse. This dirt could also enter a man from a woman who had \nrecently taken some sort of traditional medication in the interests of purging or cleansing the \nblood. \n \nInformant: The drop is not a disease as such. It has to do with using the pill. It is the result of the \ndirt that comes from a person who is using the pill. If this dirt stays in you for a long time it \ndevelops into a disease. \n  \nInformant: You get the drop by sleeping with a woman who has drunk a potassium permanganate \nmixture to cleanse herself.  All the dirt gets transferred from her into yourself. \n \nFor many informants, traditional healers were considered the most skilled in dealing with this \ndirt. Several informants said they would go to a biomedical doctor for instant pain relief, and \nthereafter consult a traditional healer who was the most skilled at removing ‘the dirt’ inside \nthe person - the root cause of the malady. \n \nInterviewer: What help can traditional healers give with this problem? Informant:  The traditional \nhealers can give you pitsa (medicine brewed in a pot) to drink because aside from the observable \nsymptoms of the drop, its root cause are the eggs it has made inside your body. The medical \ndoctors’ injections can help with the external symptoms, but cannot kill the eggs inside.It is only  \nthe traditional healers’ medicine is able to kill what is inside. \n \nTraditional healers and STD’s \n \nInformants consult a wide range of healers without any tension or sense of contradiction. \nThese include practioners of western biomedicine, including hospitals, clinics, pharmacies \nand general practitioners in private practice, and traditional healers, including sangomas \n(diviners), inyangas (herbalists) and umProfiti (faith healers) (see Abdool-Karrim, Ziqubu-\nPage and Arendse 1994) \n \nMost informants said they made use of both doctors and traditional healers for the treatment \nof sexually transmitted diseases. They said they would first go to a biomedical doctor, who \nwould give them an injection which took away the pain and ‘put the disease to sleep’. \nHowever, biomedical treatment did not kill the ‘eggs’ that were the root cause of the \nproblem. After this, they would visit a traditional healer who would administer an enema and \nother herbs which would, as one informant said,  “go inside of the person and take out the \ndisease” and also generally purge the patient in the process. \n \nInformant: The doctor’s role is that he will give you instant relief with his injection. Thereafter the \ninyanga’s procedure must take place over a longer period. Firstly you have to vomit after taking \nthe emetic, then the healer will administer an enema, then you will take a steaming session to \nproduce excessive sweat, and finally the healer will make incisions in your pubic area. All this \nprocess is some kind of cleansing of your reproductive system, and this gets rid of the ‘eggs’ that \nhave caused the problem. \n \nSome informants told us that a person could go to a traditional healer and get preventive \nmedicines, which would then ‘block’ these diseases (particularly STDs) from entering the \nperson. Such treatment would make the use of condoms unnecessary. \n \nInterviewer: How do you prevent getting an STD? Informant: Before you sleep with a woman, \nyou must drink manganese. This ‘makgonatsohle’ will kill any dirt from the woman that might \nhave caused a disease. \n \nA particular problem for health educationalists on the mines is that many workers believe that \nas soon as they learn that they are HIV positive they will simply have to consult their \ntraditional healers who claim to have a cure for AIDS. The patients say that the traditional \nhealers will then treat them with muti to ‘cleanse’ the blood and flush the virus out of the \nsystem. \n \nNormative context of sexuality: the role of masculinity on the mines \n \nMuch has been written about the central role of macho masculinity in the social identities of \nmigrant mine workers (e.g. Moodie, 1995). Campbell (1997) comments that notions of \nmasculinity play a key role in the way in which mine workers, often a great distance from \ntheir families and primary support networks, cope with the harsh physical demands of \nunderground work under what miners perceive to be constant risk of injury or death. \nInformants in the current study spoke at length of the physical and emotional demands of life \non the mines, and explained their ability to deal with these hardships in terms of the fact that \nthey were ‘men’, where masculinity involved physical strength, fearlessness in the face of \ndanger and the necessity of undergoing difficult work without complaining in order to earn \nmoney to support one’s family in the rural area. Also associated with this masculine identity, \nwhich serves as such a source of comfort and strength to mine workers, is the ability to father \nchildren and the notion of an irrepressible sex drive. \n \nInformant: You cannot call yourself a man if there is no woman involved \n \nInformant: To be a man you do not only have to send money home. The thing is to be able to \nmake children will prove that you are a man. If you cannot make a child then you are like a child \n \nWhen an informant was asked why people risked their lives by not using condoms, he replied \nthus:  \n \nInformant: We do not think the same. Like I mentioned that others want flesh to flesh, others say \nthey do not want to throw away their sperms. \n \nAgainst the background of a culture in which the notion of masculinity plays a central role, \nand where the fathering of children serves as a key component of this masculinity, the \nimportance of not “wasting sperm” in condoms appeared to have important symbolic \nsignificance - even though making a child would not be a miners’ primary objective when \nhaving casual sex. \n \nSocial context of sexuality on the mines \n \nWorking and living conditions on the gold mines have been described as physically \nunhealthy (Leon, Davies, Salamon and Davies, 1995) and psychologically stressful (Molapo, \n1995). In our interviews a number of features of life on the mines emerged as relevant in our \nattempt to understand why many mineworkers continue to practice unsafe sexual behaviour, \ndespite knowledge of the risks of HIV\/AIDS. \n Single sex hostels \n \nThe majority of mine workers live in single sex hostels, which tend to be all-male \nenvironments, with women not being allowed inside the compound. Informants said that they \nwere often lonely for female company and intimacy. Two responses to this situation were \nmentioned. Some men said that they preferred to abstain from casual sex, waiting until they \ncould visit their regular wife or girlfriend in their rural area of origin. However they \nemphasised that given the need for regular sex to stay healthy this was a less than ideal \noption. Another option was to find a regular girlfriend in the township near the mine. \nHowever informants commented that finding regular girlfriends in the townships was \nproblematic insofar as such women would expect some form of material support particularly \nin the form of money and presents, and such demands would compete with the demands of \nsupporting a family in the rural areas. \n \nInterviewer: When you say a township girlfriend would destabilise you, what do you mean? \nInformant: Most of the time people of the opposite sex are concerned with getting money from \nmen - and in that situation I would no longer be able to support my family back home. \n \nAnother problem was the question of the miner’s personal safety in the townships. Several \nreferred to the dangers of being mugged in the townships, or of being tricked into going home \nwith women whose brothers or neighbours might then rob and stab them. Such problems \nmean that many miners, particularly those who have no friends or relatives in the townships, \nare wary of venturing into the townships. Against this background, some informants found it \nmost convenient to have sexual relationships with the commercial sex workers who operated \nin the vicinity of the mines and hostels. \n  \nJochelson, Mothibeli and Leger (1991) comment that homosexual relationships do occur in \nsingle-sex hostels. Such relationships are often particularly low-risk as far as HIV\/AIDS is \nconcerned, with men preferring inter-crural sex involving thigh contact rather than anal \npenetration (Moodie, 1994). Such relationships tend to be fairly stable, taking place between \nolder and younger men and often imitating patterns of heterosexual relating (e.g. with the \nolder man giving the younger man money, and the younger man performing domestic \nservices such as cooking and washing). Moodie  comments that such relationships are less \ncommon that they used to be. In our sample, informants commented that while homosexual \nrelationships did occur in the hostels, these were relatively uncommon. However another \nrecent study (Campbell, in preparation) suggests that these relationships might be coming \nback into vogue in the hostels, with some miners arguing that such inter-crural sexual \npractices decrease the chances of STD transmission. \n \nAmongst our informants, masturbation was not regarded as a satisfactory alternative to sexual \nintercourse. \n \nInformant: Most of the younger miners, therefore, use the services offered by CSWs. Interviewer: \nWhat is it about the contact with a woman that makes sex so important - why for example is \nmasturbation not a satisfactory alternative? Informant: It is important because with a woman there \nis something you feel. I do not know how to put it (laughs). But when you masturbate you just \ninhale all the air. \n \nThus, for many, sex with commercial sex workers in the vicinity of the mines was preferable \nto other options, such as having a township girlfriend or masturbating. \n \nAcceptance of high levels of disease and accidents as the norm \n \nSocial and occupational life on the mines is often unhealthy and dangerous. Work-related \naccidents and injuries are not uncommon e.g. based on the average fatality and reportable \ninjury rates published by the South African Chamber of Mines for the 10-year period 1984 to \n1993, an underground worker has a 2.9% chance of being killed in a work-related accident \nand a 42% chance of suffering a reportable injury in a 20-year working life (Chamber of \nMines, 1993). Levels of diseases such as tuberculosis are high e.g. on one group of mines the \nannual incidence of tuberculosis remained steady at about 600 per 100 000 between 1990 and \n1992, but almost doubled to 1 000 per 100 000 in 1994 (Churchyard, 1996). One informant \ncommented that under such circumstances it is not suprising that peoples’ main motivation is \nthe pursuit of pleasure - in a context where every time they go underground to work they \nmight not come back alive or they might come back with a permanent disability which would \nmake them unemployable. \n \nMost rural and traditional African societies are organised along patrilineal lines. Being a man \nin such societies means taking important decisions for the household and the community, \nbeing in charge and there is a certain degree of authority and respect that goes with that. \nInformants commented that in the context of the mines such dignity and authority is taken \naway from them. \n Informant: The way we are treated here is not nice. No one cares, no one gives a damn about you. \nYou are treated like a goat, a cow in a kraal, you are left there in the hostels at night and then let \nout in the morning to go to the fields to work. \n \nPeople referred to strenuous working conditions, involving extreme heat and danger during a \nshift that can last up to eight hours and forty five minutes. Work often takes place in \nextremely confined spaces and miners may have to squat for many hours in order to drill \nholes in rocks prior to blasting. All this time they are subjected to a combination of heat, \nnoise and humidity which may cause discomfort, anxiety and fear (Molapo, 1995). The stress \nof this environment is exacerbaated by the constant fear of accidents. Most of our informants \nhad either been involved in accidents, or witnessed their colleagues involved in underground \naccidents.  \n \nInformant: The accidents are terrifying and horrible. Big rocks fall down, crushing peoples’ waists and \nskulls. At times they lose their legs, hands, fingers and so forth. I have seen an incident in which my co-\nworker tried to pick something up and a big iron rod fell down and cut off his leg. In my hostel room \nthere is someone who has lost his feet. He is now a scrap, he has been thrown to the surface. (i.e. he has \nbeen given an easier job above the ground). Interviewer: How do people cope with the fear of accidents? \nInformant: There is no way to cope with this. We all have to work, and we are all suffering. \nThese conditions, both underground and in the compound, make these men not to be \nmotivated by life. Under such conditions, the potential danger of unsafe sexual practices, \nwhich might lead to a disease (HIV) that might take a number of years to manifest itself, may \nappear minor compared to the dangers of day-to-day working life in a context where high \nlevels of disease and accident are the norm of peoples’ day-to-day lives. \n \nUse of alcohol \n \nSome informants said there was inadequate provision for spare time leisure activities.  When \nasked why miners did not use the sporting facilities that the mine provides for its workers, \nmost of the informants said by the time they got off the shift they were too tired and thirsty to \ndo anything that required  physical exertion. Some go and prepare for the next shift while \nothers go and drink at the compound bar. The role of alcohol in the transmission of sexually \ntransmitted diseases has been documented in a number of contexts (e.g. MacQueen 1996), \nand evidence from our interviews suggested that the gold mines are no exception to this rule. \nOur informants told us that most miners usually go to commercial sex workers after they \nhave been drinking. Many commercial sex encounters are negotiated in miners’ bars, where \nwomen might also have been drinking (Campbell, in preparation). One informant who had \nquit drinking said that he always used to go and drink and thereafter pursue women for sex. \nHe said that this was a common practice amongst his colleagues. \n \nInterviewer: Do you have sexual relationships on the mines? Informant: I had them before I \nlessened my drinking patterns. I used to consume lots of liquor and thereafter pursue women ... I \nwas under my friends’ influence. On pay day, they would organise for a spree of drinking and \nwomanising. \n \nInterviewer: Do your colleagues visit commercial sex workers a lot? Informant: It is even \nhappening as we are sitting here this afternoon. We could go now and I could show you what is \nhappening there ... Just behind the compound there is a store called X, men meet sex workers \nthere and then they go to the veld lawns behind the store. Those women hang around there waiting \nfor that. \n \nAccording to our informants, loneliness, stress and boredom drive a lot of miners into \ndrinking and seeking temporary solace from these casual encounters with sex workers. \nDrinking is seen by most miners as the only form of entertainment available to them. As one \nperson said of the bar: “it is the only place where people can come together and be happy”. \n  \nConclusion \n \nIn this paper we have suggested that while all of our mine-worker informants had attended \ntraditional information-based HIV\/AIDS education programmes, and while their knowledge \nof the basic facts about HIV\/AIDS appeared to be fairly accurate, this factual knowledge was \nembedded within a range of potentially contradictory beliefs, which are weighed up against \nthe incoming health educational information within a range of normative and social \nconstraints. The challenge remains for HIV\/AIDS educators on the gold mines to design and \nimplement health educational interventions which seek not only to transmit facts about \nHIV\/AIDS, but to do so in a way that takes account of the beliefs, norms and contexts within \nwhich these facts will be embedded, and in the light of which the new facts that educators \nseek to impart will be debated and evaluated. \n \nCurrently a peer education programme is being planned in the Carletonville gold mining \ncommunity which attempts to address some of the limitations of the information-based \nprogrammes which dominated the early stages of HIV\/AIDS education on the gold mines \n(Crisp 1996, Macheke 1996). This programme is part of a broader HIV\/AIDS management \nprogramme which will attempt to involve all the key players in the mining community - \nincluding representatives of mining management, trade unions and the communities around \nthe mines.  \n \nThe proposed programme will use the model developed by Wilson and colleagues at the \nUniversity of Zimbabwe (Dube and Wilson, 1996), which has been implemented in a range \nof contexts in Zimbabwe, Zambia and Mozambique. The aim of the peer education approach \nis to work with HIV vulnerable, low-income single women and men in contexts conducive to \nrapid HIV transmission, including men separated from primary partners, men who visit bars \nand men seeking STD care, a profile which almost perfectly matches the situation at South \nAfrican mines. Between 1993 and 1994, their projects reached an estimated 10 million people \nand have distributed about 30 million condoms at a very low cost. The aim of such programs \nis to to move away from the old-fashioned focus on providing factual information to \nindividuals in the hope that they will make different behavioural choices, based on the model \nof rational decision-making. This alternative approach views behaviour not as the result of \nindividual decisions, but as the function of peer-group related social norms and practices \nwhich can only be changed at the collective level through their collective renegotiation. \n \nIn the local mining context, peer education will involve training community members (in this \ncase mineworkers, as well as members of the formal and informal communities surrounding \nthe mines, including squatter camps and townships) in participatory education and condom \ndistribution skills (Dube and Wilson, 1996). Such peer educators then go back into their \ncommunities and work at generating discussion about HIV\/AIDS, sexuality and condoms in a \nrange of formal and informal settings. Such discussion is generated in a way that encourages \npeople to actively participate in the debate and discussion of such issues - so as to maximise \nthe likelihood that new information might be internalised in a way that is not contradicted by \nexisting  beliefs, norms and social constraints. The method of peer education is based on two \nkey assumptions: firstly, that people are most likely to change their behaviour if they perceive \nthat liked and trusted peers are changing theirs, and secondly that it is only through active \nparticipation by target audience members that educational interventions are likely to succeed. \nRather than simply transmitting factual information, the programme aims to provide the \ncontext within which members of target audiences can discuss the educators’ informational \ninput within the context of existing beliefs, norms and contextual constraints - and work \ntogether to accomodate new knowledge in a way that is consistent with existing perceptions \nof health, disease and sexuality, and in a way that takes account of the way in which existing \nnorms and social conditions shape these perceptions. \n \nAn important prerequisite for the success of such a programme will be that mine management \nshould be seen by the workers to be sincere in their efforts towards curbing the AIDS \nepidemic. Informants in the current study expressed the suspicion that management never did \nthings which benefitted workers in the long run. Every effort needs to be made to counter this \npreconception through the full involvement of worker representatives in the planning and \nexecution of HIV awareness and behaviour change programmes. Workers should not see \nthese programmes as management dominated. Involvement of worker representatives will be \na start of a important process of trust building. In addition to this, worker involvement would \nincrease the likelihood that factual information about HIV\/AIDS was delivered in a way that \ntook account of some of the sexual health related beliefs, norms and practices outlined above \n(see Evian et al, 1992 who emphasise the importance of full participation of target audience \nmembers in the development of educational materials). \n \nEducational strategies need to be backed up by attempts to change the contexts in which \npeoples’ sexual lives are conducted. In the interests of addressing the issues of loneliness and \nboredom which make drinking and commercial sex attractive options for mine workers a \nrange of long term strategies need to be initiated as soon as possible. The trade unions have \nlong called for an increase in the availability of family housing for mine workers, as well as \nimproved working conditions. However these are long-term goals, and the HIV epidemic is \ndeveloping more rapidly than they are likely to be achieved. In the short term, there needs to \nbe greater provision of visiting wives centres where miners’ wives can visit them, particularly \nwives who live some distance from the mines. Miner representatives might also work towards \npromoting participation in more extra-mural activities which might occupy miners more and \nreduce the idling time which many people spend drinking at the bar. Sporting programmes \nmight be encouraged more than they are at present and a sporting culture might be developed \nwhich portrays sports as a form of relaxation and stress relief. \n \nThe data outlined above highlight the key role that traditional healers play in the \nconceptualisation and treatment of STD’s among mine workers, and traditional healers need \nto be integrally involved in HIV-prevention plans. Furthermore, education and awareness \ncampaigns need to target not only mine workers, but also their sexual partners, taking full \naccount of the array of social relationships that miners engage in - ranging from more \nestablished long-term girlfriends to more casual commercial sex in the townships and squatter \ncamps around the mines. \n \nMaximising participation in educational programs and the formation of support groups is also \nessential. In relation to mine workers in particular, support groups should be encouraged - \nespecially in the hostel context, where miners frequently have informal opportunities to \ndiscuss issues around health and sexual behaviour with their peers, so that they can set \nexamples for one another in the development of alternative health-promoting practices and \nbeliefs. As Molapo (1995) has observed, it is crucial that at all stages of such programmes, \nworkers’ cultural explanations and perceptions of illness, disease and well-being are taken \ninto consideration as it is these explanations and perceptions which will determine the \ncompliance with and effectiveness of health-promotion campaigns. We hope that in this \npaper we have begun to illustrate the way in which some of these explanations and \nperceptions, as well as workers’ sexual practices, are shaped and constrained by working and \nliving conditions on the mines. \n \nAcknowledgements \nThis research was conducted as part of the Perceptions of Health Project of the Epidemiology \nResearch Unit  (ERU) which conducts research into the health and safety of mineworkers. \nParticular thanks to Professor Brian Williams, ERU Director, who set up the Project, \nconducted many of the interviews reported on in this paper, and contributed to discussion of \nvarious points. Ms Nokuzola Mqoqi, Mr Phampang Manoto, Mr Oupa Raymond Matsi and \nMr Sello Molefe assisted with the development of the interview protocol and interview \nprocess. \n \nReferences \n \nAbdool-Karrim, S., Ziqubu-Page, T. and Arendse, R. (1994) Bridging the gap: potential for a \nhealth care partnership between African traditional healers and biomedical personnel \nin South Africa. Pinelands: Publications of the Medical Association of South Africa. \nBillig, M (1987\/1996) Arguing and thinking. Cambridge: Cambridge University Press. \nCampbell, C (1997) Migrancy, masculine identities and AIDS: the psycho-social context of \nHIV transmission on the South African gold mines. Social science and medicine. 45 \n(2), pp. 273-283. \nCampbell, C (in preparation) Selling sex in the time of AIDS: identity, sexuality and \ncommercial sex workers on the South African gold mines. \nCampbell, C. and Williams, B. (1995) Mineworkers’ perceptions of health and illness: a pilot \nstudy. Epidemiology Research Unit Report Series, No 32. Epidemiology Research Unit. \nJohannesburg. \nCampbell, C. and Williams, B. (1996) Academic research and HIV\/AIDS in South Africa. \nSouth African Medical Journal, 86 (1), 55-60, January. \nChamber of Mines (1993)  Statistical Tables 1993. Chamber  of Mines, Johannesburg.  \nChurchyard, G (1996) Of soil and seed: HIV related TB on the Mines. In Campbell, C and \nWilliams, B (Eds) HIV\/AIDS Management in South Africa: Priorities for the Mining \nIndustry. Johannesburg: ERU. \nCrisp, J. (1996) AIDS programmes  in the mining industry: an overview. In: Williams, B. and \nCampbell, C. (Eds) HIV\/AIDS management in South Africa: priorities for the mining \nindustry. Johannesburg: Epidemiology Research Unit. \nDube, N. and Wilson, D. (1995) Peer education programmes among HIV-vulnerable \ncommunities in Southern Africa. In: Williams, B. and Campbell, C. (Eds). HIV\/AIDS \nmanagement in South Africa: priorities for the mining industry. Epidemiology Research \nUnit. Johannesburg. \nDunbar Moodie, T. (1994) Going for gold: men, mines and migration. Witwatersrand \nUniversity Press. Johannesburg. \nEpidemiological Comments (1996) Sixth national survey of women attending antinatal \nclinics of the public health services in the Republic of South Africa. Epidemiological \nComments, 23, 3-17. \nEvian, C, Ijsselmuiden, C, Padayachee, G and Hurwitz, H (1990) Qualitative evaluation of an \nAIDS health education poster: a rapid assessment method for health education \nmaterials. South African Medical Journal, 78 (9), 517-520. \nGillies, P (1996) The contribution of social and behavioural science to HIV\/AIDS prevention. \nIn Mann, J and Tarantola, D (Eds) AIDS in the world II: global dimensions, social roots \nand responses. Oxford: Oxford University Press. \nHickson, J and Mokhobo, D (1992) Combating AIDS in Africa: cultural barriers to effective \nprevention and treatment. Journal of multicultural counselling and development, 20 (1), \n11-22. \nJochelson, K., Mothibeli, M. and Leger, J-P. (1991) Human immunodeficiency virus and \nmigrant labour in South Africa. International Journal of Health Services, 21 (1), 157-\n173. \nKustner, H. (1994) The relationship between the growth rate of the pool of HIV infections \nand the incidence of full-blown AIDS, South Africa, 1990-1993. Epidemiological \nComments, 21, 239-243. \nLeon, The Hon R., Davies, A., Salamon, M. and Davies, J. (1995) Commission of inquiry into \nsafety and health in the mining industry. Department of Mineral and Energy Affairs, \nPretoria. \nMacheke, C. (1996) AIDS awareness programmes on the mines: a postal survey. In: \nCampbell, C and Williams, B (Eds) HIV\/AIDS management in South Africa: priorities \nfor the mining industry. Johannesburg: Epidemiology Research Unit. \nMacQueen, K. (1996) Alcohol consumption, brothel attendance and condom use. Medical \nanthropology quarterly, 10 (3), 402-423. \nMiles, M and Huberman, A (1994) Qualitative data analysis: an expanded sourcebook. \nLondon: Sage. \nMolapo, M.  (1995) Job stress, health and perceptions of migrant mineworkers. In: Crush, J. \nand James, W. (Eds) Crossing boundaries: mine migrancy in a democratic South \nAfrica. Creda,  Cape Town. pp.  88-100. \nDunbar Moodie, T. (1994) Going for gold: men, mines and migration. Witwatersrand \nUniversity Press. Johannesburg. \nScott, S. and Mercer, M. (1994) Understanding cultural obstacles to HIV\/AIDS prevention in \nAfrica. AIDS education and prevention, 8, 81-89. \nStockdale, J. (1995) The self and media messages: match or mismatch? In: Markova, I. and \nFarr, R. (Eds) Representations of health, illness and handicap. Harwood. UK. \nWilliams, B. and Campbell, C. (1996) Mines, migrancy and HIV in South Africa - managing \nthe epidemic. South African Medical Journal, 86, 1249-1251. \nWilliams, B and Campbell, C (1997) Is the epidemic of HIV in South Africa slowing down? \nPaper presented to 18th African Health Sciences Congress, Cape Town, 14-18 April \n1997. \nWilson D and Lavelle S. (1993) AIDS prevention in South Africa. A perspective from other \nAfrican countries. South African Medical Journal,  83,  668–674. \n \n \n \n \n"}