{"doi":"10.1007\/s00780-007-0038-4","coreId":"93685","oai":"oai:eprints.lse.ac.uk:4821","identifiers":["oai:eprints.lse.ac.uk:4821","10.1007\/s00780-007-0038-4"],"title":"Insider trading in an equilibrium model with default: a passage from reduced-form to structural modelling","authors":["Campi, Luciano","Çetin, Umut"],"enrichments":{"references":[{"id":17308612,"title":"Continuous auctions and insider trading: uniqueness and risk aversion.","authors":[],"date":"2003","doi":"10.1007\/s007800200078","raw":"Cho, K.-H. (2003): Continuous auctions and insider trading: uniqueness and risk aversion. Finance and Stochastics, 7, pp. 47{71.","cites":null},{"id":17308621,"title":"Credit risk: drawing the analogy.","authors":[],"date":"1992","doi":null,"raw":"Jarrow, R. and Turnbull, S. (1992): Credit risk: drawing the analogy. Risk Magazine, 5(9).","cites":null},{"id":17308607,"title":"Credit Risk: Modeling, Valuation and Hedging, Springer-Verlag:","authors":[],"date":"2002","doi":"10.1007\/978-3-662-04821-4","raw":"Bielecki, T. and Rutkowski, M. (2002): Credit Risk: Modeling, Valuation and Hedging, Springer-Verlag: New York.","cites":null},{"id":17308614,"title":"Credit Risk: Pricing, Measurement and Pricing,","authors":[],"date":"2003","doi":"10.1007\/s00712-003-0038-6","raw":"Du±e, D. and Singleton, K. (2003): Credit Risk: Pricing, Measurement and Pricing, Princeton University Press.","cites":null},{"id":17308605,"title":"Default risk insurance and incomplete markets.","authors":[],"date":"1995","doi":"10.1111\/j.1467-9965.1995.tb00064.x","raw":"Artzner, P. and Delbaen, F. (1995): Default risk insurance and incomplete markets. Mathematical Finance, 5, 187{195.","cites":null},{"id":17308628,"title":"Di®usions, Markov processes and Martingales.","authors":[],"date":"2000","doi":"10.1017\/cbo9781107590120.005","raw":"Rogers, L.C.G. and Williams, D. (2000): Di®usions, Markov processes and Martingales. Vol. 2. Cambridge University Press, Cambridge.","cites":null},{"id":17308619,"title":"How much of the corporate-treasury yield spread is due to credit risk? Working Paper,","authors":[],"date":"2003","doi":"10.2139\/ssrn.307360","raw":"Huang, J. and Huang, M. (2003): How much of the corporate-treasury yield spread is due to credit risk? Working Paper, Cornell University, Ithaca. http:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract id=307360 (2003)","cites":null},{"id":17308606,"title":"Insider trading in continuous time.","authors":[],"date":"1992","doi":"10.1093\/rfs\/5.3.387","raw":"Back, K. (1992): Insider trading in continuous time. The Review of Financial Studies, 5(3), pp. 387{409.","cites":null},{"id":17308611,"title":"Modeling credit risk with partial information.","authors":[],"date":"2004","doi":null,"raw":"C »etin, U., Jarrow, R., Protter, Ph. and Y³ld³r³m, Y. (2004): Modeling credit risk with partial information. Annals of Applied Probability, 14(3), pp. 1167{1178.","cites":null},{"id":17308615,"title":"Modeling term structure of defaultable bonds.","authors":[],"date":"1999","doi":"10.1093\/rfs\/12.4.687","raw":"Du±e, D. and Singleton, K. (1999): Modeling term structure of defaultable bonds. Review of Financial Studies, 12, pp. 687{720.","cites":null},{"id":17308626,"title":"On Cox processes and credit risky securities.","authors":[],"date":"1998","doi":"10.1007\/bf01531332","raw":"Lando, D. (1998): On Cox processes and credit risky securities. Review of Derivatives Research, 2, pp. 99{120.","cites":null},{"id":17308627,"title":"On the pricing of corporate debt: risk structure of interest rates.","authors":[],"date":"1974","doi":"10.1111\/j.1540-6261.1974.tb03058.x","raw":"Merton, R. (1974): On the pricing of corporate debt: risk structure of interest rates. The Journal of Finance, 29, pp. 449{470.","cites":null},{"id":17308623,"title":"Pricing options on ¯nancial securities subject to credit risk.","authors":[],"date":"1995","doi":"10.2307\/2329239","raw":"Jarrow, R. and Turnbull, S. (1995): Pricing options on ¯nancial securities subject to credit risk. The Journal of Finance, 50, pp. 53{86.12","cites":null},{"id":17308616,"title":"Recursive valuation of defaultable securities and the timin of resolution of uncertainty.","authors":[],"date":"1996","doi":"10.1214\/aoap\/1035463324","raw":"Du±e, D., Schroder, M. and Skiadas, C. (1996): Recursive valuation of defaultable securities and the timin of resolution of uncertainty. Annals of Applied Probability, 6, pp. 1075{1090.","cites":null},{"id":17308624,"title":"Semi-Martingales et Grossissement d'une Filtration.","authors":[],"date":"1980","doi":"10.1007\/bfb0093543","raw":"Jeulin, Th. (1980): Semi-Martingales et Grossissement d'une Filtration. Lecture Notes in Mathematics 833, Springer, Berlin.","cites":null},{"id":17308620,"title":"Structural versus reduced form models: a new information based perspective.","authors":[],"date":"2004","doi":null,"raw":"Jarrow, R and Protter, Ph. (2004): Structural versus reduced form models: a new information based perspective. Journal of Investment Management, 2(2), pp. 1{10.","cites":null},{"id":17308613,"title":"Term structure of credit spreads with incomplete accounting information.","authors":[],"date":"2001","doi":"10.1111\/1468-0262.00208","raw":"Du±e, D. and Lando, D. (2001): Term structure of credit spreads with incomplete accounting information. Econometrica, 69, pp. 633{664.","cites":null},{"id":17308609,"title":"The pricing of options and corporate liabilities.","authors":[],"date":"1973","doi":"10.1086\/260062","raw":"Black, F. and Scholes, M. (1973): The pricing of options and corporate liabilities. Journal of Political Economy, 81, pp. 637{654.","cites":null},{"id":17308618,"title":"The Slope of the Credit Yield Curve for SpeculativeGrade Issuers,","authors":[],"date":"1999","doi":"10.1111\/0022-1082.00170","raw":"Helwege, J. and Turner, C. (1999): The Slope of the Credit Yield Curve for SpeculativeGrade Issuers, Journal of Finance, 54, pp. 1869{1884.","cites":null},{"id":17308625,"title":"Three essays on contingent claims pricing.","authors":[],"date":"1994","doi":"10.2139\/ssrn.906146","raw":"Lando, D. (1994): Three essays on contingent claims pricing. Ph. D. Thesis, Cornell University.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-10","abstract":"We study an equilibrium model for the pricing of a defaultable zero coupon bond issued by a firm in the framework of Back [2]. The market consists of a risk- neutral informed agent, noise traders and a market maker who sets the price using the total order. When the insider does not trade, the default time possesses a default intensity in market's view as in reduced-form credit risk models. However, we show that, in the equilibrium, the modelling becomes structural in the sense that the default time becomes the first time that some continuous observation process falls below a certain barrier. Interestingly, the firm value is still not observable. We also establish the no expected trade theorem that the insider's trades are inconspicuous","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/93685.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/4821\/1\/Insider_trading_in_an_equilibrium_model_%28LSERO_version%29.pdf","pdfHashValue":"350a7ea146efbb641e9661cab77bd08b62b6b6a6","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:4821<\/identifier><datestamp>\n      2010-10-01T08:53:48Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5354<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/4821\/<\/dc:relation><dc:title>\n        Insider trading in an equilibrium model with default: a passage from reduced-form to structural modelling<\/dc:title><dc:creator>\n        Campi, Luciano<\/dc:creator><dc:creator>\n        Çetin, Umut<\/dc:creator><dc:subject>\n        QA Mathematics<\/dc:subject><dc:description>\n        We study an equilibrium model for the pricing of a defaultable zero coupon bond issued by a firm in the framework of Back [2]. The market consists of a risk- neutral informed agent, noise traders and a market maker who sets the price using the total order. When the insider does not trade, the default time possesses a default intensity in market's view as in reduced-form credit risk models. However, we show that, in the equilibrium, the modelling becomes structural in the sense that the default time becomes the first time that some continuous observation process falls below a certain barrier. Interestingly, the firm value is still not observable. We also establish the no expected trade theorem that the insider's trades are inconspicuous.<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2007-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/4821\/1\/Insider_trading_in_an_equilibrium_model_%28LSERO_version%29.pdf<\/dc:identifier><dc:identifier>\n          Campi, Luciano and Çetin, Umut  (2007) Insider trading in an equilibrium model with default: a passage from reduced-form to structural modelling.  Finance and Stochastics, 11 (4).  pp. 591-602.  ISSN 0949-2984     <\/dc:identifier><dc:relation>\n        http:\/\/www.springer.com\/math\/quantitative+finance\/journal\/780<\/dc:relation><dc:relation>\n        10.1007\/s00780-007-0038-4<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/4821\/","http:\/\/www.springer.com\/math\/quantitative+finance\/journal\/780","10.1007\/s00780-007-0038-4"],"year":2007,"topics":["QA Mathematics"],"subject":["Article","PeerReviewed"],"fullText":"  \nUmut Çetin and Luciano Campi \nInsider trading in an equilibrium model with \ndefault: a passage from reduced-form to \nstructural modelling \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nCampi, Luciano and Çetin, Umut (2007) Insider trading in an equilibrium model with default: a \npassage from reduced-form to structural modelling. Finance and stochastics, 11 (4). pp. 591-\n602. ISSN 0949-2984 \n \nDOI: 10.1007\/s00780-007-0038-4\n \n© 2007 Springer\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/4821\/\n \nAvailable in LSE Research Online: September 2010 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \nNoname manuscript No.\n(will be inserted by the editor)\nInsider trading in an equilibrium model with default: a\npassage from reduced-form to structural modelling\nLuciano Campi · Umut C¸etin\nthe date of receipt and acceptance should be inserted later\nAbstract We study an equilibrium model for the pricing of a defaultable zero coupon\nbond issued by a firm in the framework of Back [2]. The market consists of a risk-\nneutral informed agent, noise traders and a market maker who sets the price using\nthe total order. When the insider does not trade, the default time possesses a default\nintensity in market’s view as in reduced-form credit risk models. However, we show\nthat, in the equilibrium, the modelling becomes structural in the sense that the default\ntime becomes the first time that some continuous observation process falls below a\ncertain barrier. Interestingly, the firm value is still not observable. We also establish\nthe no expected trade theorem that the insider’s trades are inconspicuous.\nKeywords Default · structural models · reduced-form models · equilibrium · insider\ntrading · Bessel bridge\nMathematics Subject Classification (2000) 93E11 · 93E20\nJEL Classification D82 · G12\n1 Introduction\nIn the valuation of credit derivatives the key issue is the calculation of the probabilities\nassociated to the default event for which the product is written. There are essentially\ntwo approaches in the literature to model the default probabilities: structural approach\nand reduced-form approach. The structural approach dates back to Black and Scholes\n[4] and Merton [19] while the reduced-form models originated with Jarrow and Turnbull\n[14]. As argued by Jarrow and Protter [13] the difference between these two approaches\nlies on the amount of information available to the modeler. Structural models assume\nthe modeler has the same information as the manager of the firm and, thus, has the\nL. Campi\nCEREMADE, Universite´ Paris Dauphine, Place du Mare´chal de Lattre de Tassigny, 75775\nParis Cedex 16, E-mail: campi [campi@ceremade.dauphine.fr\nU. C¸etin\nLondon School of Economics, Department of Statistics, Houghton Street, London WC2A 2AE,\nE-mail: u.cetin@lse.ac.uk\n2continuous knowledge of the firm’s assets and liabilities. In these models the default\ntime is modelled to be the first time that the firm’s value falls below a certain barrier.\nConsequently, this approach might come up with a model, e.g. if the firm value is\nassumed to be continuous, where the default time is predictable to the modeler. This\nfeature of the model makes the yield spreads on the defaultable bonds approach to zero\nvery quickly as one gets close to maturity. However, such behavior in the yield spreads\nis not common in practice (see, e.g. [11]).\nIn contrast the reduced-form models in general take the default time as exogenous\nand model the information available to the modeler. The modeler does not have the\nfull information that the manager of the firm possesses but only a subset generated\nby the default process and several other related state variables. This approach was\noriginated by Jarrow and Turnbull [14] and there has been a considerable literature\non these models since then. In this respect one can mention the works of Jarrow and\nTurnbull [15], Artzner and Delbaen [1], Duffie, et al. [10], Lando ([17], [18]) and Duffie\nand Singleton [9] to name a few. The common characteristic of these models is that\nthere exists a default arrival intensity as a function of state variables and the default\nprocess. This aspect of reduced form modelling excludes such abnormal behavior of\nyield spreads as observed in the structural models. The existence of the default intensity\nimplies that, in mathematical terms, the default time is a totally inaccessible stopping\ntime1. Consequently, the default time cannot be anticipated by the market and comes\nas a total surprise.\nAlthough they seem conceptually different, one may pass from a structural model\nto a reduced form model. One can do this by assuming that the market’s information\nset is that of the manager plus some noise as in Duffie and Lando [7], or restricting\nthe information set of the market by assuming that the market only knows whether\nthe firm is in financial distress or not as in C¸etin, et al. [5]. The common feature of\nthe both models is that they start with a structural model to define the default time,\nhowever, they are still able to come up with default intensities although the firm value\nis assumed to be continuous. We will not elaborate further on the differences of these\ntwo model but refer the reader to the recent works by Bielecki and Rutkowski [3],\nDuffie and Singleton [8] and Jarrow and Protter [13].\nIn the model of Duffie and Lando [7] the market has imperfect information about the\ndefault event due to the noisy and infrequent accounting data. Duffie and Lando assume\nthat managers\/owners, who have the perfect information about firm value, is precluded\nfrom trading in order to avoid complex equilibrium problems involving asymmetric\ninformation. In this paper we address such asymmetric information problem in a market\nfor a defaultable bond. We suppose that the default time is exogenously given to the\nmarket. However, there is one trader, that we call insider, who has an extra information\nabout the default time. The other two market participants are the noise traders who\ntrade for liquidity reasons and the market maker who clears the market given the total\ndemand. The insider is assumed to know the default time. The default event is obviously\npredictable to the insider as is the case in the structural models with continuous firm\nvalue, but it is totally inaccessible to the market maker when the insider doesn’t trade,\nand it has an intensity, as in reduced form credit risk models. The market maker\nchooses a pricing rule and the insider chooses a trading strategy where the cumulative\n1 Default intensity could exist in a structural model if the firm value is allowed to jump,\nsee, e.g., Huang and Huang [12]; hence, the essential difference between the structural and the\nreduced form models is the level of the information available to the market.\n3demand of the noise traders is modelled by a Brownian motion. The equilibrium is\ndefined similar to that in Back [2]. We show that in the equilibrium the insider’s trades\ncannot be seen in the market and the default time becomes the first time that the\ncontinuous total order process falls below a certain barrier. Consequently, the model\nbecomes structural although the firm value is still not observable. We also show that\nthe equilibrium total order process is a Brownian motion in its own filtration, hence the\ninsider’s trades are inconspicuous, but a 3-dimensional Bessel bridge of length τ in the\ninsider’s view, where τ is the default time (see Theorem 3.6 for the precise statement).\nThe outline of the paper is as follows. Section 2 introduces the model. Section 3 solves\nthe equilibrium pricing rule and the demand for the defaultable bond while Section 4\nconcludes.\n2 The model\nA company issues a bond that pays 1 unit of a currency at time 1 unless it defaults be-\nfore that time. We suppose that the defaultable bond’s recovery rate is 0 for simplicity.\nThe company’s default time is modelled by a random time τ defined on a probability\nspace (Ω,F ,P). The equilibrium framework of our model follows closely that of Back\n[2]. We refer the reader to Back [2] for motivation and details that are not explained\nin what follows. We suppose the default time is given by\nτ := inf{t > 0 : Zt = −1}, (2.1)\nwhere Z is a standard Brownian motion with Z0 = 0. It is well-known that\nP[τ > 1|Zt] = 1[τ>t]F (t, Zt),\nwhere\nF (t, y) :=\n∫ ∞\n1−t\ny + 1√\n2pix3\ne−\n(y+1)2\n2x dx. (2.2)\nWe may view Z as the value of the firm under a risk-neutral measure and −1 can be\nconsidered as default barrier. More general forms for the firm’s value process can be\nchosen. However, we retain this Brownian assumption for the firm’s value process for\ntransparency of our results.\nThree types of agents act in this market:\n1. The noise traders: as in Back’s model [2], they can only observe their own cumu-\nlative demands and whether the default has happened or not. Their cumulative\ndemand is modelled by a standard Brownian motion B, with B0 = 0, whose com-\npleted natural filtration is denoted by FB = (FBt )t≥0 and independent of Z.\n2. The informed trader: apart from observing continuously in time the defaultable\nbond prices, the insider knows the default time, τ . We denote FI her filtration and\nassume that she is risk-neutral, so that her objective is to maximize her expected\nprofit.\n3. The market maker: the market maker observes the total order of the noise traders\nand the insider and sets the price of the risky asset to clear the market.\nWe further suppose Z0 is known to the market maker and the insider at time 0.\n4Insider’s objective. As in Back’s model [2], insider’s trading strategies, denoted with θ,\nwill be assumed to be absolutely continuous for optimality reasons so that dθt = αtdt,\nwhere α is an FI -adapted process such that ∫ 10 |αt|dt <∞.\nBeing risk-neutral, the insider has the objective to maximize her expected wealth\nat time 1. We suppose the default-free interest rate equals 0. Note that the value of\nthe zero-coupon bond to the insider equals 1[τ>1] all the time. Using this insight and\nfollowing the arguments leading to the wealth process of the insider in Back [2], we\nfind that\nW θ1 =\n∫ 1\n0\n(1[τ>1] − St)αtdt, (2.3)\nwhere St denotes the market price of the defaultable bond at time t, which is assigned\nby the market-maker. We will give the precise definition of admissible strategies for\nthe insider after explaining what a pricing rule is in this framework.\nMarket maker’s objective. The market maker sets the price of the defaultable bond\nusing his information set, which consists of two parts. The first component is the\ntotal order of the noise traders and the insider, which is denoted with Y and has the\ndecomposition\nY = Y θ = Bτ + θτ ,\nwhere θ is the position of the insider in the defaultable bond so that the total demand\nright before the insider starts trading at time 0 equals 0. Note that we stop the market\nat time τ so that there is no trading in the defaultable bond once the default has\noccurred. We denote the minimal right continuous and complete filtration generated\nby Y θ with FY , where we suppress the dependency on θ in the notation. The second\npart of the market maker’s information comes from the observation of the default\nevent, i.e. the market maker also observes whether the default has happened or not.\nIn mathematical terminology, this makes τ a stopping time in his filtration. Therefore,\nthe market maker’s information is modelled by the filtration FM = (FMt )0≤t≤1 where\nFMt := FYt ∨ σ(τ ∧ t).\nLetDt = 1[τ>t] denote the indicator function of no-default by time t. The modelling\nidea, as borrowed from Back [2], is that the market maker assigns the price looking at\nthe current total order and whether the default has happened. Thus, St denoting the\nmarket price of the bond at time t, we expect\nSt = DtH(t, Yt),\nwhere H : [0, 1] × R 7→ R is the pricing rule of the market maker. This justifies the\nfollowing definition:\nDefinition 2.1 A measurable function H : [0, 1]× R 7→ R is a pricing rule if\n1. H ∈ C1,2([0, 1)× R) and H(1, ·) ≡ 12;\n2. E[D1H(1, B1)] <∞ and E[\n∫ 1\n0 DtH(t, Bt)\n2dt] <∞;\n3. y 7→ H(t, y) is strictly increasing for every t ∈ [0, 1).\nMoreover, let θ be a trading strategy of the insider. Given θ, a pricing rule H is\nsaid to be rational if it satisfies\nDtH(t, Yt) = E[1[τ>1]|FMt ], t ∈ [0, 1]. (2.4)\n2 Note that these two conditions ensure that (H(t, Yt))t∈[0,1] is a semimartingale.\n5Remark 2.2 Since the insider observes the price and the pricing rule is monotone over\n[0,1) and B is continuous, the insider’s filtration, FI , is generated by B and τ . Since B\nand τ are independent, B is also an FI -Brownian motion. Thus, the total order Y is\nthe sum of a FI -Brownian motion and an absolutely continuous FI -adapted process.\nNow, a classical result in optimal filtering implies all FY -martingales are continuous\n(see e.g. Corollary 8.10 in Sect. VI.8 of Rogers and Williams [20]).\nWe are now able to give the definitions of admissible trading strategies for the\ninsider, and equilibrium in this setting:\nDefinition 2.3 An insider’s admissible trading strategy is an FI -adapted process θ\nsuch that\n1. dθt = αtdt for α an FI -adapted process with E\n∫ 1\n0 |αt|dt <∞,\n2. the corresponding total order Y θ is (in its own filtration) a Markov process given\nτ ,\n3. for every pricing rule H, one has\nE\n[∫ 1\n0\nDtH(Y\nθ\nt , t)\n2dt\n]\n<∞.\nThe set of all admissible strategies is denoted with A.\nThe condition 3 above is set to rule out doubling strategies. For a more detailed\ndiscussion of this condition, we refer the reader to Back [2].\nDefinition 2.4 A pair (H∗, θ∗) is said to form an equilibrium if H∗ is a pricing rule,\nθ∗ ∈ A, and the following conditions are satisfied:\n1. Market efficiency condition: given θ∗, H∗ is a rational pricing rule.\n2. Insider optimality condition: given H∗, θ∗ solves the insider optimization problem:\nW θ\n∗\n1 = sup\nθ∈A\nE[W θ1 |FI0 ].\n3 Equilibrium\nIn this section, we will look for the existence of an equilibrium as defined in Definition\n2.4. We’ll first address the optimality condition for the insider. Throughout this section,\nwe will use the standard notation [[0, τ ]] := {(ω, t) ∈ [0, 1]×Ω : τ(ω) ≥ t}. This is clearly\na measurable subset of (Ω × [0, 1],F ⊗ B([0, 1]), dPdt).\n3.1 Optimality conditions for the insider’s problem\nLet us fix a pricing rule H. Using (2.3) and noting that lims↑tH(s, Ys) = H(t, Yt) for\nall t ∈ (0, 1), the insider’s problem becomes\nsup\nα∈A\nE\n[∫ 1−\n0\n{\n1[τ>1] −Dt−H(t, Yt)\n}\nαtdt\n∣∣∣∣∣FI0\n]\n(3.1)\n6For a given strategy α, let us write for t < 1\nJ(t, Yt,1[τ>1]) = ess supα(t)∈A(t,α)E\n[∫ 1∧τ\nt∧τ\n1[u<1]\n{\n1[τ>1] −H(u, Yu)\n}\nα\n(t)\nu du\n∣∣∣∣∣FIt\n]\n,\nwhere A(t, α) = {α(t) ∈ A : α(t)u = αu, 0 ≤ u ≤ t}, t ≥ 0, and define\nJ(1, Y1,1[τ>1]) := lim\nt↑1\nJ(t, Yt,1[τ>1]).\nNote that we are in a similar situation as in Back [2] (see also [6]). Using the arguments\ntherein, the solution to (3.1) exists if the following system has a solution:\n∂\n∂y\nJ(t ∧ τ, y,1[τ>1]) + 1[τ>1] −H(t ∧ τ, y) = 0, for t < 1, (3.2)\n∂\n∂t\nJ(t ∧ τ, y,1[τ>1]) +\n1\n2\n∂2\n∂y2\nJ(t ∧ τ, y,1[τ>1]) = 0, for t < 1. (3.3)\nThis implies that for any total order process Y , associated to an admissible strategy\nof the insider, H satisfies\n∂\n∂t\nH(t, Yt) +\n1\n2\n∂2\n∂y2\nH(t, Yt) = 0, t ∈ [[0, τ ]] ∩ [0, 1). (3.4)\nAlthough the dependency of J on 1[τ>1] is obvious, we’ll suppress this dependency in\nthe notation as long as no confusion arises.\nLemma 3.1 (Theorem 2, Back [2]) If a pricing rule H verifies equation (3.4), then\nthere exist a function J satisfying the system given by (3.2) and (3.3). Moreover, one\nhas\nJ(τ ∧ 1, Yτ∧1) ≥ 0, (3.5)\nfor all admissible Y and the equality holds if and only if Y satisfies limt↑1H(τ ∧\nt, Yτ∧t) = 1[τ>1].\nProof Keeping in mind that τ ∧ 1 ∈ FI0 , we refer to Back [2] (Theorem 2, p. 396) or\nCho [6] (Lemmas 4, 5, p. 56).\nIn the sequel, a rational pricing rule H will be given. We will investigate what\nproperties an admissible insider strategy should satisfy in order to be optimal.\nProposition 3.2 Let H be a rational pricing rule and assume limt↑1H(τ ∧t, Yτ∧t) =\n1[τ>1]. The following are equivalent:\n1. H satisfies (3.4).\n2. Inconspicuous insider trade theorem holds, i.e. E[αt|FMt ] = 0 dPdt-a.e. on [[0, τ ]].\n3. Y stopped at τ is a Brownian motion for the market maker, more precisely there\nexists an FM -Brownian motion BM such that Yt∧τ = BMt∧τ for every t ∈ [0, 1].\n7Proof First, we prove that 1 and 2 are equivalent. Itoˆ’s formula applied to DtH(t, Yt)\ngives, for t < 1,\ndDtH(t, Yt) = Dt−\n{\n∂\n∂t\nH(t, Yt) +\n1\n2\n∂2\n∂y2\nH(t, Yt)\n}\ndt\n+Dt−\n∂\n∂y\nH(t, Yt)dYt +H(t, Yt)dDt.\nTherefore, letting H−(t, Yt) = lims↑tH(s, Ys) and ∂∂tH−(t, Yt) := lims↑t\n∂\n∂tH(s, Ys),\nand defining ∂\n2\n∂y2\nH−(t, Yt) and ∂∂yH−(t, Yt) analogously, we have the following decom-\nposition for DtH(t, Yt) on the whole interval [0, 1]:\ndDtH(t, Yt) = Dt−\n{\n∂\n∂t\nH−(t, Yt) +\n1\n2\n∂2\n∂y2\nH−(t, Yt)\n}\ndt+Dt−\n∂\n∂y\nH−(t, Yt)dYt\n+1[t=1]D1−(1−H−(1, Y1)) +H−(t, Yt)dDt\n+ {H(t, Yt)−H−(t, Yt)} (Dt −Dt−)\n= Dt−\n{\n∂\n∂t\nH−(t, Yt) +\n1\n2\n∂2\n∂y2\nH−(t, Yt)\n}\ndt+Dt−\n∂\n∂y\nH−(t, Yt)dYt\n+H−(t, Yt)dDt + 1[t=1]D1(1−H−(1, Y1)). (3.6)\nBy standard filtering arguments it is not difficult to see that\nYt = B\nM\nt +\n∫ t\n0\nα̂udu, t ∈ [0, 1], (3.7)\nfor an FM -Brownian motion BM and α̂t := E[αt|FMt ], t ∈ [0, 1]. To see this, consider\nthe process\nNt := E\n[∫ t\n0\nαsds\n∣∣∣∣FMt ]− ∫ t\n0\nα̂sds.\nN is clearly an FM -martingale. As a consequence, we have that\nYt = E[Yt|FMt ] = E[Bt|FMt ] +Nt +\n∫ t\n0\nα̂sds.\nNow, we observe that Mt := E[Bt|FMt ] is an FM -martingale which follows from that\nB is an FI -Brownian motion and FM ⊂ FI . Moreover, 〈Y 〉t = t. Thus, the continuous\nmartingale M + N having 〈M + N〉t = 〈Y 〉t = t is an FM -Brownian motion and we\nget (3.7).\nUsing this result, we can rewrite the decomposition of DtH(t, Yt) as follows\ndDtH(t, Yt) = Dt−\n{\n∂\n∂t\nH−(t, Yt) + α̂t\n∂\n∂y\nH−(t, Yt) +\n1\n2\n∂2\n∂y2\nH−(t, Yt)\n}\ndt\n+Dt−\n∂\n∂y\nH−(t, Yt)dBMt\n+H−(t, Yt)dDt + 1[t=1]D1(1−H−(1, Y1)).\nUnder the assumption limt↑1H(τ∧t, Yτ∧t) = 1[τ>1], the last term in the above decom-\nposition of DtH(t, Yt) vanishes. Also note that\n∫ t\n0 H−(s, Ys)dDs = −H−(τ, Yτ )1[τ≤t],\n8which equals, for t < 1,−H(τ, Yτ )1[τ≤t]. Observe that for u ∈ [t, 1), H(τ∧u, Yτ∧u)1[τ≤t] =\nH(τ, Yτ )1[τ≤t]. Thus,\n1[τ≤t] lim\nu↑1\nH(τ ∧ u, Yτ∧u) = 1[τ≤t]H(τ, Yτ ).\nHowever, by hypotheses, limu↑1H(τ∧u, Yτ∧u) = 1[τ>1],which in turn impliesH(τ, Yτ )1[τ≤t] =\n0 for t < 1. Taking limits we have H−(τ, Yτ )1[τ≤1] = 0, as well. Therefore,\ndDtH(t, Yt) = Dt−\n{\n∂\n∂t\nH−(t, Yt) + α̂t\n∂\n∂y\nH−(t, Yt) +\n1\n2\n∂2\n∂y2\nH−(t, Yt)\n}\ndt\n+Dt−\n∂\n∂y\nH−(t, Yt)dBMt . (3.8)\nSince H is rational, the process DtH(t, Yt) must be an FM -martingale. Of course, this\nis the case if and only if the finite variation part in the above decomposition vanishes,\ni.e., for t < 1,\n∂H\n∂t\n(t, Yt) + α̂t\n∂H\n∂y\n(t, Yt) +\n1\n2\n∂2H\n∂y2\n(t, Yt) = 0 on [τ ≥ t].\nThis proves that 1 and 2 are equivalent since H is strictly increasing in the second\nvariable. It remains to show that 2 and 3 are equivalent. For this, it suffices to observe\nthat, in view of (3.7),\n∫ t\n0 α̂sds = 0 dPdt-a.e. on [[0, τ ]] if and only if Yt∧τ = B\nM\nt∧τ for\nall t ∈ [0, 1].\nThe next lemma gives a necessary and sufficient condition for an admissible strategy\nto be optimal given a rational pricing rule H.\nLemma 3.3 Given a rational pricing rule H, θ∗ ∈ A is an optimal insider strategy if\nand only if it satisfies the following two properties:\n1. E[α∗t |FMt ] = 0 dPdt-a.e. on [[0, τ ]], where α∗t = dθ\n∗\ndt ;\n2. the corresponding optimal total order Y ∗ satisfies limt↑1H(τ ∧ t, Y ∗τ∧t) = 1[τ>1].\nProof Let H be a rational pricing rule. Suppose θ∗ is a corresponding optimal strategy\nof the insider. HJB equations ((3.2) and (3.3)) require that H satisfies equation (3.4),\nand by Lemma 3.1 there exists a function J satisfying the system given by (3.2) and\n(3.3).\nAn application of Itoˆ’s formula for t < 1 gives, on the event [t < τ ] ∈ FI0 ,\nJ(τ ∧ 1, Yτ∧1) = J(t, y)−\n∫ τ∧1\nt\n(1[τ>1] − Su)αudu−\n∫ τ∧1\nt\n(1[τ>1] − Su)dBu.\nNow, condition 3 of Definition 2.3 implies\n∫ s\nt (1[τ>1] − Su)dBu, t ≤ s ≤ 1, is an FI -\nmartingale so that\nE\n[∫ τ∧1\nt\n(1[τ>1] − Su)αudu\n∣∣∣∣∣FIt\n]\n= J(t, Yt)− E[J(τ ∧ 1, Yτ∧1)|FIt ].\nThe expected future wealth reaches its maximum when E[J(τ ∧ 1, Yτ∧1)|FIt ] reaches\nits minimum. In view of Lemma 3.1, E[J(τ ∧ 1, Yτ∧1)|FIt ] attains its minimum at\n9Y ∗τ∧1 if and only if limt↑1H(τ ∧ t, Y ∗τ∧t) = 1[τ>1]. Thus, by Proposition 3.2, α∗ is\ninconspicuous, i.e. E[α∗t |FMt ] = 0 dPdt-a.e. on [[0, τ ]].\nTo complete the proof it remains to show that if α∗ satisfies 1 and 2 then it is\noptimal given H. Again by Proposition 3.2 one has that H solves (3.4). By Lemma 3.1\nα∗ is optimal if and only if limt↑1H(τ ∧ t, Y ∗τ∧t) = 1[τ>1], Y ∗ being the total order\nassociated to α∗. This equality is satisfied thanks to property 2.\n3.2 The equilibrium and its interpretation\nThe following lemma is essential in the characterization of the equilibrium.\nLemma 3.4 The couple (H∗, θ∗) is an equilibrium if and only if the following two\nconditions hold:\n1. H∗ solves (3.4),\n2. Y ∗ is an FM -Brownian motion stopped at τ such that limt↑1H(τ ∧ t, Yτ∧t) =\n1[τ>1].\nProof We prove first that if (H∗, θ∗) satisfies 1 and 2 then it is an equilibrium, i.e. H∗\nis rational and θ∗ is an optimizer. Condition 2 implies that α̂∗t = 0 on [t ≤ τ ] (use\nProposition 3.2). Moreover, decomposition (3.8) together with Condition 1 gives that\nDtH(t, Yt) is an FM -martingale, which implies that H∗ is rational.\nMoreover, given H∗ satisfying the conditions in 1 and 2, θ∗ with the associated\ntotal order process Y ∗ satisfying the conditions in 2 is optimal. Indeed, the optimality\nof θ∗ is a straightforward consequence of Lemma 3.3.\nTo finish, it remains to show that if (H∗, θ∗) is an equilibrium then it satisfies\n1 and 2. This comes from a combination of Proposition 3.2 and Lemma 3.3. Indeed,\nθ∗ optimal given H∗ implies that the inconspicuous trade theorem holds and that\nlimt↑1H(τ ∧ t, Yτ∧t) = 1[τ>1]. so that, by Proposition 3.2, H∗ has to satisfy (3.4) and\nY ∗ is an FM -Brownian motion stopped at τ .\nBefore we show the existence of an equilibrium, we present the following technical\nresult.\nLemma 3.5 On the probability space (Ω,F ,P) equipped with the filtration FI = FB ∨\nσ(τ), there exists a unique strong solution to the SDE\ndYt = dBt +\n{\n1\n1 + Yt\n− 1 + Yt\nτ − t\n}\n1[t≤τ ]dt , (3.9)\nwith Y0 = 0.\nProof The result follows as soon as one observes that conditioned on [τ = `], 1 + Y is\na 3-dimensional Bessel bridge of length ` starting at 1 at time 0 and ending at 0 at\ntime `, and that τ is independent of B. ¤\nThe following theorem is the main result of our paper. It gives the existence and\na characterization of the equilibrium. Moreover, it shows that in the equilibrium the\ndefault time τ is a hitting time of the equilibrium total order process Y ∗ so that the\nmodelling changes to structural.\n10\nTheorem 3.6 There exists an equilibrium (H∗, θ∗) such that\nH∗(t, y) = F (t, y),\nfor t < 1 and H∗(1, ·) ≡ 1 where F is as defined in (2.2) and the equilibrium total\norder Y ∗ solves\ndYt = dBt +\n{\n1\n1 + Yt\n− 1 + Yt\nτ − t\n}\n1[t≤τ ]dt . (3.10)\nTherefore, given τ = `, 1 + Y is a 3-dimensional Bessel bridge of length ` starting at\n1 at time 0 and ending at 0 at time `.\nMoreover, one has τ = inf{t > 0 : Y ∗t = −1}. As a consequence, τ is a predictable\nstopping time under the market maker’s filtration FM .\nProof It is straightforward to show that H∗ is a pricing rule satisfying (3.4). In view\nof Lemma 3.4 it remains to show that the unique strong solution to the SDE in\n(3.10), which exists by Lemma 3.5, is an FM -Brownian motion stopped at τ with\nlimt↑1H∗(τ ∧ t, Yτ∧t) = 1[τ>1]. In order to do so we’ll construct a Brownian motion\nthat is a weak solution to (3.10) by enlargement of filtration techniques. Observe that\nthis is the first time we use the assumption that the default time is given by the first\nhitting of −1 by the firm value, Z. Let G be the filtration generated by FZ and τ ,\nwhere FZ is the usual augmentation of Z. Then it readily follows from Jeulin [16]\n(Lemme 3.25, p. 52) that Z has the following G-decomposition:\ndZt = dβt +\n(\n1\n1 + Zt\n− 1 + Zt\nτ − t\n)\n1[t≤τ ]dt\nwhere β is a G-Brownian motion and so independent of G0 ⊇ σ(τ). Then, due to the\nstrong uniqueness of the solution as established in Lemma 3.5, Y ∗ has the same law as\nZ; thus, Y ∗ is a Brownian motion in its own filtration. The uniqueness of the solution\nimplies also that\nτ = inf{t > 0 : Y ∗t = −1}.\nThus τ is a stopping time with respect to FY ∗ and the filtrations FY ∗ and FM\ncoincide, so that Y ∗ is an FM -Brownian motion, too. To finish the proof it remains to\ncheck limt↑1H∗(τ ∧ t, Y ∗τ∧t) = 1[τ>1]. We leave this simple task to the reader.\nNow we turn to the interpretation of the equilibrium. It is easy to see that in the\nequilibrium described in Theorem 3.6\n1\n1 + Y ∗t\n= E\n[\n1 + Y ∗t\nτ − t\n∣∣∣FMt ] (3.11)\nsince α̂∗ = 0. This is an easy consequence of decomposition (3.10). Thus, conditional\non FMt , 11+Y ∗t is the best approximation in market’s view to the value\nY ∗t +1\nτ−t . Recall\nthat the default will happen when Y ∗ hits −1. Therefore, Y ∗t + 1 can be viewed as\na metric measuring the distance to default. Moreover, τ − t is the time to default if\ndefault has not happened by time t so that one can define the ratio\nY ∗t +1\nτ−t as the true\nspeed of default. Due to the information structure the true speed of default is known\nto the insider. However, the market maker has only an expectation of this speed given\nhis information. In view of (3.11) the market’s expectation for the speed of default\nconditional on FMt is given by 1Y ∗t +1 .\n11\nLooking at (3.10), we see that the insider sells when the market’s expectation of\nthe speed of default is lower than the true speed and buys otherwise. This is quite\nintuitive. Indeed, when the market’s expectation for the imminence of the default is\nlow, the bond is relatively overpriced, so the insider sells to increase her profits.\n4 Conclusions\nWe have analyzed the effects of asymmetric information in defaultable bond pricing. In\nan equilibrium setting a` la Back [2] we have shown that the information asymmetries\ncan change the nature of the modelling completely. We solved for the equilibrium\npricing rule for the market maker, optimal strategy for the insider and equilibrium\ndemand for the defaultable bond. It is shown that it is optimal for the insider to trade\nwithout being seen while driving the total demand to hit a certain level at the default\ntime. The presence of a strategic insider turns the modelling into structural while the\nmodel is reduced-form in the absence of the insider.\nAcknowledgements We would like to thank the referee and the associate editor for many\nvaluable suggestions and also Inga Baadshaug Eidefor for pointing out a mistake in a previous\nversion of this paper.\nReferences\n1. Artzner, P. and Delbaen, F. (1995): Default risk insurance and incomplete markets. Math-\nematical Finance, 5, 187–195.\n2. Back, K. (1992): Insider trading in continuous time. The Review of Financial Studies,\n5(3), pp. 387–409.\n3. Bielecki, T. and Rutkowski, M. (2002): Credit Risk: Modeling, Valuation and Hedging,\nSpringer-Verlag: New York.\n4. Black, F. and Scholes, M. (1973): The pricing of options and corporate liabilities. Journal\nof Political Economy, 81, pp. 637–654.\n5. C¸etin, U., Jarrow, R., Protter, Ph. and Yıldırım, Y. (2004): Modeling credit risk with\npartial information. Annals of Applied Probability, 14(3), pp. 1167–1178.\n6. Cho, K.-H. (2003): Continuous auctions and insider trading: uniqueness and risk aversion.\nFinance and Stochastics, 7, pp. 47–71.\n7. Duffie, D. and Lando, D. (2001): Term structure of credit spreads with incomplete ac-\ncounting information. Econometrica, 69, pp. 633–664.\n8. Duffie, D. and Singleton, K. (2003): Credit Risk: Pricing, Measurement and Pricing,\nPrinceton University Press.\n9. Duffie, D. and Singleton, K. (1999): Modeling term structure of defaultable bonds. Review\nof Financial Studies, 12, pp. 687–720.\n10. Duffie, D., Schroder, M. and Skiadas, C. (1996): Recursive valuation of defaultable se-\ncurities and the timin of resolution of uncertainty. Annals of Applied Probability, 6, pp.\n1075–1090.\n11. Helwege, J. and Turner, C. (1999): The Slope of the Credit Yield Curve for Speculative-\nGrade Issuers, Journal of Finance, 54, pp. 1869–1884.\n12. Huang, J. and Huang, M. (2003): How much of the corporate-treasury yield\nspread is due to credit risk? Working Paper, Cornell University, Ithaca.\nhttp:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract id=307360 (2003)\n13. Jarrow, R and Protter, Ph. (2004): Structural versus reduced form models: a new infor-\nmation based perspective. Journal of Investment Management, 2(2), pp. 1–10.\n14. Jarrow, R. and Turnbull, S. (1992): Credit risk: drawing the analogy. Risk Magazine, 5(9).\n15. Jarrow, R. and Turnbull, S. (1995): Pricing options on financial securities subject to credit\nrisk. The Journal of Finance, 50, pp. 53–86.\n12\n16. Jeulin, Th. (1980): Semi-Martingales et Grossissement d’une Filtration. Lecture Notes in\nMathematics 833, Springer, Berlin.\n17. Lando, D. (1994): Three essays on contingent claims pricing. Ph. D. Thesis, Cornell Uni-\nversity.\n18. Lando, D. (1998): On Cox processes and credit risky securities. Review of Derivatives\nResearch, 2, pp. 99–120.\n19. Merton, R. (1974): On the pricing of corporate debt: risk structure of interest rates. The\nJournal of Finance, 29, pp. 449–470.\n20. Rogers, L.C.G. and Williams, D. (2000): Diffusions, Markov processes and Martingales.\nVol. 2. Cambridge University Press, Cambridge.\n"}