{"doi":"10.1080\/0968776990070306","coreId":"14271","oai":"oai:generic.eprints.org:310\/core5","identifiers":["oai:generic.eprints.org:310\/core5","10.1080\/0968776990070306"],"title":"Peripatetic electronic teachers in higher education","authors":["Squires, David"],"enrichments":{"references":[{"id":1043127,"title":"A scaffolded learning environment supporting learning and design activities',","authors":[],"date":"1997","doi":null,"raw":"Hübscher, R., Puntambekar, S. and Guzdial, M. (1997), 'A scaffolded learning environment supporting learning and design activities', Proceedings of the American Educational Research Association Meeting 1997, http:\/\/guzdial.cc.gatech.edu\/papers\/aera97\/scaffolding.html.","cites":null},{"id":1043134,"title":"A teacher's PET for the millennium',","authors":[],"date":"1999","doi":null,"raw":"Squires, D. (1999), 'A teacher's PET for the millennium', in Tuomi-Kyro, E., Salonen, M., Saarinen, P. and Sinko, M. (eds.), Communications and Networking in Education: Learning in a Networked Society Conference Proceedings, Aulanko-Hameenlinna, Finland, 328-33.","cites":null},{"id":453111,"title":"Collaborative interactions in support of learning: models, metaphors and management',","authors":[],"date":"1998","doi":"10.1007\/978-1-4471-0625-8_4","raw":"Norman, K. (1998), 'Collaborative interactions in support of learning: models, metaphors and management', in Hazemi, R., Hailes, S. and Wilbur, S. (eds.), The Digital University: Reinventing the Academy, London: Springer, 39-53.","cites":null},{"id":1043126,"title":"Collaborative websites to support an Open Authoring Community on the Web',","authors":[],"date":"1998","doi":null,"raw":"Guzdial, M. (1998), 'Collaborative websites to support an Open Authoring Community on the Web', http:\/\/guzdial.cc.gatech.edu\/papers\/CoWeb\/.","cites":null},{"id":1043128,"title":"Deschooling Society, Harmondsworth:","authors":[],"date":"1971","doi":"10.1111\/j.1741-5446.1972.tb00584.x","raw":"Illich, I. D. (1971), Deschooling Society, Harmondsworth: Penguin Books.","cites":null},{"id":1043131,"title":"Humanizing the superhighway',","authors":[],"date":"1996","doi":null,"raw":"McFarlane, M. C. (1996), 'Humanizing the superhighway', Technology and Society, 14 (4), 11-18.","cites":null},{"id":1043125,"title":"Learning technology and usability: a framework for understanding courseware',","authors":[],"date":"1999","doi":"10.1016\/s0953-5438(98)00065-4","raw":"Mayes, J. T. and Fowler, C. J. (1999), 'Learning technology and usability: a framework for understanding courseware', Interacting with Computers, 11 (5), 485-97.","cites":null},{"id":1043130,"title":"Putting teachers and parents in control: Internet content labelling and blocking technologies',","authors":[],"date":"1997","doi":null,"raw":"Martin, D. (1997), 'Putting teachers and parents in control: Internet content labelling and blocking technologies', Proceedings of the National Educational Computing Conference, Seattle, Washington, USA, 281-6.","cites":null},{"id":199234,"title":"Shared spaces',","authors":[],"date":"1996","doi":null,"raw":"Bradley, L., Walker, G. and McGrath, A. (July 1996), 'Shared spaces', British Telecommunications Engineering Journal, 15, http:\/\/vb.labs.bt.com\/msss\/IBTE_SS\/.","cites":null},{"id":199233,"title":"Strategies for mutability in virtual environments',","authors":[],"date":"1997","doi":null,"raw":"Anderson, B. and McGrath, A. (1997), 'Strategies for mutability in virtual environments', Proceedings of Virtual Environments on Internet, WWW, and Networks, National Museum of Photography, Film and Television, Bradford, http:\/\/www.visual.bt.co.uk\/users\/abc\/andersb2\/public\/papers\/SfM.doc.","cites":null},{"id":1043135,"title":"The mirror - reflections on inhabited TV',","authors":[],"date":"1997","doi":"10.1109\/cn.1997.629968","raw":"Walker, G. (April 1997), 'The mirror - reflections on inhabited TV', British Telecommunications Engineering Journal, 16, 29-38, http:\/\/vb.labs.bt.com\/msss\/IBTE_Mirror\/intro.htm.","cites":null},{"id":453112,"title":"The ramblers guide to virtual environments', IEE Colloquium: The 3D Interface for the Information Worker","authors":[],"date":"1998","doi":"10.1049\/ic:19980652","raw":"Platt, P. and Willard, A. (1998), 'The ramblers guide to virtual environments', IEE Colloquium: The 3D Interface for the Information Worker (May 1998), http:\/\/www.hfnet.bt.co.uk\/projects\/IEE_paper\/IEE_paper_vl.htm. Schlager, M., Fusco, J. and Schank. P. (in press), 'Conceptual cornerstones for an on-line community of education professionals', IEEE Technology and Society, http:\/\/www.tappedin.org\/info\/ieee.html.","cites":null},{"id":199235,"title":"Threedimensional Internet developments',","authors":[],"date":"1997","doi":"10.1007\/978-94-011-4918-1_17","raw":"62Aa-j Volume 7 Number 3 Crossley, M., Davies, N. J., Taylor-Hendry, R. J. and McGrath, A. J. (1997), 'Threedimensional Internet developments', British Telecom Technology Journal, 15 (2), 179-93.","cites":null},{"id":1043133,"title":"Using asynchronous conferencing to promote critical thinking: a case study of three implementations in higher education',","authors":[],"date":"1999","doi":"10.1109\/hicss.1999.772807","raw":"Sloffer, S., Duebur, B. and Duffy, T. (1999), 'Using asynchronous conferencing to promote critical thinking: a case study of three implementations in higher education', Proceedings of the Hawaii International Conference on Systems Science, (CD-ROM), Piscataway, NJ: IEEE Computer Society Press.","cites":null},{"id":1043129,"title":"Whither video? - pictorial culture and telepresence',","authors":[],"date":"1997","doi":"10.1007\/978-1-4615-5291-8_7","raw":"Lewis, A. V. and Cosier, G. (1997), 'Whither video? - pictorial culture and telepresence', British Telecom Technology Journal, 15 (4), 64-85.","cites":null},{"id":1043132,"title":"Windows of opportunity in electronic classrooms',","authors":[],"date":"1995","doi":"10.1145\/219717.219725","raw":"Shneiderman, B., Alavi, M., Norman, K. and Borkowski, E. (1995), 'Windows of opportunity in electronic classrooms', Communications of the ACM, 38, 19-24.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1999","abstract":"This paper explores the idea of information and communications technology providing a medium enabling higher education teachers to act as freelance agents. The notion of a ‘Peripatetic Electronic Teacher’ (PET) is introduced to encapsulate this idea. PETs would exist as multiple telepresences (pedagogical, professional, managerial and commercial) in PET‐worlds; global networked environments which support advanced multimedia features. The central defining rationale of a pedagogical presence is described in detail and some implications for the adoption of the PET‐world paradigm are discussed. The ideas described in this paper were developed by the author during a recently completed Short‐Term British Telecom Research Fellowship, based at the BT Adastral Park","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14271.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/310\/1\/ALT_J_Vol7_No3_1999_Peripatetic%20electronic%20teacher.pdf","pdfHashValue":"fb096eb189c2877af5a36db923261fe4e2254cff","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:310<\/identifier><datestamp>\n      2011-04-04T09:16:42Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/310\/<\/dc:relation><dc:title>\n        Peripatetic electronic teachers in higher education<\/dc:title><dc:creator>\n        Squires, David<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        This paper explores the idea of information and communications technology providing a medium enabling higher education teachers to act as freelance agents. The notion of a ‘Peripatetic Electronic Teacher’ (PET) is introduced to encapsulate this idea. PETs would exist as multiple telepresences (pedagogical, professional, managerial and commercial) in PET‐worlds; global networked environments which support advanced multimedia features. The central defining rationale of a pedagogical presence is described in detail and some implications for the adoption of the PET‐world paradigm are discussed. The ideas described in this paper were developed by the author during a recently completed Short‐Term British Telecom Research Fellowship, based at the BT Adastral Park.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        1999<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/310\/1\/ALT_J_Vol7_No3_1999_Peripatetic%20electronic%20teacher.pdf<\/dc:identifier><dc:identifier>\n          Squires, David  (1999) Peripatetic electronic teachers in higher education.  Association for Learning Technology Journal, 7 (3).  pp. 52-63.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776990070306<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/310\/","10.1080\/0968776990070306"],"year":1999,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Peripatetic electronic teachers in\nhigher education\nDavid Squires\nSchool of Education, King's College London, email: david.squires@kcl.ac.uk\nThis paper explores the idea of information and communications technology providing a\nmedium enabling higher education teachers to act as freelance agents. The notion of a\n'Peripatetic Electronic Teacher' (PET) is introduced to encapsulate this idea. PETs\nwould exist as multiple telepresences (pedagogical, professional, managerial and com-\nmercial) in PET-worlds; global networked environments which support advanced multi-\nmedia features. The central defining rationale of a pedagogical presence is described in\ndetail and some implications for the adoption of the PET-world paradigm are discussed.\nThe ideas described in this paper were developed by the author during a recently\ncompleted Short-Term British Telecom Research Fellowship, based at the BT Adastral\nPark.\nIntroduction\nMost people would agree that the role of teachers in higher education will be changed by\nthe advent of modern information and communication technology (ICT). At the very least\nopen and distant learning (ODL) will become an established feature of educational\nprovision rather than a specialist aspect. This is already evident in the increasing use of\nODL in combination with conventional forms of course delivery by universities. More\nradically it is claimed that there will be a fundamental change in the nature of educational\ninstitutions, leading to the notion of virtual university, e.g. the Western Governors\nUniversity (http:\/\/www.wgu.ed). These claims have in common the notion of utilizing the\ndistributed nature of ICT to provide partnerships between teachers and learners that are\nnot defined by either spatial or temporal constraints.\nWhile the concept of a virtual university is radical, there is an implicit assumption that\neducators will still be primarily affiliated to one institution. An even more radical claim is\nthat ICT will break exclusive links between educators and a single institution. Just as future\nlearners may be seen as clients contracting to receive educational provision from a range of\nproviders, educators may be seen as independent workers offering their services to learners on\n52\nALT-J Volume 7 Number 3\ndemand. These educators will not be confined to the classroom, rather they will be electronic\nworkers providing a virtual presence in public spaces, the workplace and the home. A new\ntype of peripatetic electronic teacher (PET) will emerge. Aristotle, the first peripatetic teacher,\nused to walk around the Lyceum as he taught; PETs will surf around the Net as they teach.\nThese changes were foreseen in principle long before the advent of the Web. In 1970 Ivan\nIllich (1971) introduced the idea of a 'learning web' providing global access to learning\nresources and enabling free communication between learners and teachers. A combination\nof the idea of a learning web and the possibilities afforded by ICT leads to the notion of a\nperipatetic electronic teacher. PETs will act as information brokers, providing routes for\nlearners to search networked information systems. They will provide virtual asynchronous\ntutorials for small groups and individuals, act as the teacher in a virtual classroom\nenvironment, manage synchronous virtual seminars, and moderate discussion lists\/bulletin\nboards. On occasion they will provide face-to-face teaching sessions, which will be\nadvertised on the Web. Instead of using 'off-the-shelf curriculum materials PETs will use\nmultimedia authoring systems to design and publish materials, either for general\ncirculation or as bespoke products developed in response to client demand.\nInitial development work on a design specification and prototype for a PET software\nenvironment has been completed through a BT Short-Term Research Fellowship based at\nthe BT Adastral Park. This paper describes this design specification.\nA PET design rationale\nSquires (1999) describes the original design rationale for a PET as an 'Assistant' providing\na seamless interface to a diverse range of design, navigation and communication tools:\n• A peripatetic network-based teacher will need to maintain an overt presence on the\nWeb. At a practical level this involves being able to handle diverse requests from clients,\nadvertise services and communicate with colleagues.\n• Some teachers may wish to combine a Web-based virtual presence with contract\nteaching commitments in diverse locations. These teachers will need to be contactable\nin a variety of locations.\n• Brokering information will require access to state of the art network navigation\nsystems, and possibly the development of navigation tools customized to the needs of\neducation. Navigation tools with different approaches will need to be presented in a\ncoherent and synergistic way.\n• Designing learning materials will require access to a range of complementary\nauthoring environments.\n• Digital publishing will need support - copyright will need to be protected, payments will\nneed to be made and links with software publishing agencies will need to be maintained.\nThis is a utilitarian and functional view which originates from a view of the Internet\/Web as\nprimarily an information and distribution mechanism. However, the 'superhighway' metaphor\nis immature - it is being replaced by the notion of global networks as social places. Schlager,\nFusco and Schank (in press) cite McFarlane (1996) in support of this emerging notion; they\n53\nDavid Squires Peripatetic electronic teachers in higher education\nregard a networked environment as a gathering place, or agora, that 'brings people together,\nencourages participation, and supports creativity, a place that is always growing, adapting,\nand changing in response to new ideas and initiatives'. This leads to a rather different\nperception of the design of a PET Assistant. It is not a well-ordered and comprehensive\ntoolbox that is needed, but rather a flexible virtual space\/environment which allows a PET to\nhave an effective and functional telepresence on the Web. In this sense it is a question of\ndesigning a PET-World, inhabited by PETs and learners, rather than a PET Assistant.\nWith this perspective in mind a design specification for a PET-World has been developed\nbased on the idea of four presence domains:\n• Pedagogical presence where the PET appears as a teacher, playing roles such as\ninstructor, coach, mentor, tutor, scaffolder and expert.\n• Professional presence where the PET appears as a member of the teaching profession,\nplaying roles such as colleague, committee member, trainer and trainee.\n• Commercial presence where the PET appears as a freelance worker available for hire,\nplaying roles such as consultant, personal tutor and publisher.\n• Managerial presence where the PET appears as an administrator, scheduling teaching\ncommitments, validating learners attendance\/achievements and managing course enrol-\nment.\nAll domains are important in realizing a holistic perception of the role and scope of a\nPET-World, and initial design specifications exist for each domain. As PET-Worlds are\ndeveloped other presences may be required. However, the pedagogical domain provides a\ncentral defining rationale and the specification for this domain has been developed to the\ngreatest extent. The remainder of this paper will describe this specification and reflect on\nthe implications of implementing the design.\nPedagogical telepresence\nTeachers communicate with learners through two fundamental channels: exposition and\ndiscourse. Pedagogical presence is defined by the character of exposition to learners and\nthe nature of discourse with learners. From a constructivist perspective exposition is not\nsimply a question of presenting ideas, facts and so on for consumption, i.e. pedagogical\npresence is not simply presentational. Rather it is a question of exposing learners to\nlearning situations which encourage them to develop ideas and concepts in ways which\nmatch their idiosyncratic needs and demands. Thus exposition will be a mix of presenting\nideas and concepts for consideration, setting problems to be solved and organizing\nprojects. An essential aspect of good teaching is feedback and advice based on effective\nassessment. Discourse provides a way of giving this feedback, with the teacher assuming\nroles such as guide, mentor, adviser, moderator, critic, leader and instigator in discussions -\nboth between teacher and learner(s) and between learners (peer group collaboration). In\nthis sense discourse provides opportunities for the teacher to scaffold learners' activities.\nExposition and discourse will remain as defining communication channels for PETs, but\nthe nature and scope of these channels will change, e.g. asynchronous conferencing\n54\nALT-J Volume 7 Number 3\nLearning Theatre\nWeb sue,\nBibliographic sources\nDesien Studio \\ .\nAccess to generic tods and _ \/\nmultimedia authoring packages jf\nLean** Surfer?\nEUetronk Emissary project\nhltp^\/www. upr.org\/em hsary\/\n7** « P E-mail Mentor Progt\nhitpJ\/w ww.tclementor.org\/hp\/\n\/mentations\/ TelemeiOor Center\nhttp:\/\/www.ielementor.org\/\nDtscoarsc Forum\nAsynchrrmtws itrhrttr\nACT\nCSILE\/Knowledge Furum\nWebSMlLE:\nhup-J\/sctury .cc.g3lcch.edu\/\nsmilchtml\ninfo\/\nEmail\nAdvanced Learning\nEnvironment (ALE)\nSynchronous debate\nVUKO conferencing\nFigure I\nsystems are introducing new aspects of discourse between teacher and learner. A\nconsideration of exposition and discourse in a PET-World context suggests a number of\n'learning rooms' within the Pedagogical Presence Domain (see Figure 1):\n• a Learning Theatre in which exposition can take place in an interactive distributed\nmultimedia environment;\n• a Discourse Forum based on access to a range of synchronous, asynchronous and\nhybrid a\/synchronous systems providing opportunities for the PET to scaffold learners'\nactivities;\n• a Virtual Field Centre in which the PET acts as guide and designer of thematically\nconstructed explorations of the Web;\n• a Learning Surgery in which a PET can assume the roles of tutor and mentor to\nrespond to requests for specific help and advice form individuals and small groups;\n• a Design Studio providing a PET with access to a range of design tools to develop\ncurriculum materials;\n• a Resource Centre where a PET is a guide to the selection and retrieval of information.\nLearning theatre\nProviding access to diverse, extensive and high-quality materials to support networked\nlecture presentations is an immediately obvious rationale. Didactic presentations of\n55\nDavid Squires Peripatetic electronic teachers in higher education\nknowledge can be augmented by use of slides, video, animations and simulations - very\nmuch as in an Open University television programme. Basically this rationale rests on the\nidea of a (multimedia) replication of conventional lecture presentations.\nThis is a limited view which does not take account of a constructivist learner-centred focus.\nNorman (1998), in describing the use of multimedia networked classrooms at the\nUniversity of Maryland, observes that the trend has been to 'evolve from presentations to\nexplorations, from passive learning to active engagement and from \"sage on the stage\" to\n\"guide on the side\"' (p. 42). Norman cites Shneiderman, Norman and Borkowski (1995) as\nemphasizing this trend in stating that the electronic classrooms at the university were\noriginally called 'teaching theatres', but with experience were renamed 'learning theatres'.\nThis term is borrowed to describe an area within the Pedagogical Presence Domain.\nA learning theatre will combine the possibilities of hi-fidelity presentation with\nsynchronous interaction, leading to the notion of participative exposition. Learning\ntheatres will be examples of shared spaces as described by Bradley, Walker and McGrath\n(1996). The inhabitants of these spaces will be the teacher(s) and the learners. Interaction\nwill typically be orchestrated by the teacher, but there will be possibilities for learner-\nlearner interaction as well. Emerging virtual reality technologies provide exciting\npossibilities in this context, e.g. systems such as The Mirror have a three-dimensional\nshared space (Walker, 1997) which combines multiple avatar presence with synchronous\ntext-based discourse. Future worlds may include multi-party audio. It is not hard to\nimagine a learning theatre populated by avatars (teacher(s) and learners) with real time\naudio conferencing.\nIdentity\nA conventional classroom provides teachers with a social space in which they can project\ntheir personality and exercise their role as a teacher, i.e. a forum for maintaining a\npedagogical presence. Learning theatres will need to afford PETs similar possibilities.\nPersonal appearance may offer one way of providing a personality affordance. For example,\n'The Mirror included a choice of four avatars with clothing which could be coloured from\nan extensive palette' (Walker, 1997, p.32). A similar approach could be adopted in learning\ntheatres, with PETs offered the facilities to design their own appearance and, if multi-party\naudio is used, their own voice characteristics. If synchronous text based discourse is\nemployed, there may be some merit in presenting text contributions as characteristic\nhandwriting rather than as typed script. Teachers and learners could choose a handwriting\nstyle from a style library. As they typed in text it could automatically be converted into\nscript presented in this style. Another possibility is the availability of a voice to text system\nfor use by the PET.\nLearning theatre management\nWell run classrooms are characterized by diverse practice: whole group presentation, small\ngroup work, individual work and circus activities. Learning theatres will need to offer PETs\nsimilar management affordance. The use of 'auras' (grouping algorithms used to produce\nscaleable worlds) could be relevant in this context. These algorithms have been developed\nto make shared spaces populated by large numbers of avatars technically feasible and\npractically manageable by users. Users are placed in need-to-know groups, enabling the\nsystem to control the amount of information sent to any user. The use of auras could also\n56\nAn-] Volume 7 Number 3\nopen up the possibility of massive participatory exposition, i.e. lessons in which large\nnumbers of students could participate. These could be celebrity lessons given by 'excellent\nPETs'.\nMotivation\nTrials of The Mirror indicate 'the importance of special events and the pulling power of\ncelebrities in maintaining the community' (Walker, 1997, p. 37). The notion of massive\nparticipatory exposition is relevant here. This raises issues of PETs working in teams. PETs\nwould spend most of their time working with 'their' class, but would also act as an\nassociate PET for special events. Of course, there are possibilities for team teaching as well.\nAuthority\nWhat are the new forms of misbehaviour and ill-discipline that will arise in a virtual\nenvironment? Vandalism may take the form of deliberate malicious annotations to\nmaterials presented in open collaborative environments - multimedia graffiti. It may take\nthe form of deleting and\/or changing other peoples' work. Subtle changes may be the most\ninsidious. Another form of ill-discipline may be unacceptable behaviour in open\nenvironments (e.g. MUDs) or the use of unacceptable language (e.g. in discussion groups).\nWill 'flaming' take on a new meaning? Hacking into confidential systems (e.g. learner\nrecords) may be a problem. Virtual discipline will raise a number of software development\nissues, e.g. providing controlled access to the Web, creating 'protected' user groups, and\nallowing censorship through blocking and regulatory systems (Martin, 1997).\nDiscourse forum\nIn conventional educational settings discourse is synchronous: classroom discussion,\nseminar groups, conversations between teachers and learners. While new technology opens\nup possibilities for replicating synchronous discourse (video conferencing, multi-party\naudio, telephone conferencing and text-based chat lines), perhaps the most interesting\ndevelopment is the emergence of asynchronous discourse systems. The fundamental claim\nhere is that asynchronous discourse encourages reflection. Of course, the two forms can be\ncombined to give a\/synchronous discourse systems.\nThe notion of a discourse forum does not have a conventional equivalent, which attempts\nto provide a space defined in terms of a mixture of synchronous and asynchronous debate\nand exchange of information. A number of design issues have emerged in the design and\ndevelopment of systems such as those which would feature in a discourse forum: annotated\ndiscourse, configured discourse, and multimedia discourse.\nAnnotated discourse\nIt is commonly argued that asynchronous discussion fosters reflection leading to more\nthoughtful and considered responses. This begs the issue of how learners can adequately\nrepresent their reflective thinking. One common approach is to provide labelling facilities,\ne.g. as in the Asynchronous Conferencing Tool (ACT) described by Sloffer, Duebur and\nDuffy (1999). In ACT messages can be labelled as hypothesis, important point, evidence,\nand learning issue. In some systems there are reserved labels for teacher use only, e.g. a\nproblem-setting label or a summary label.\n57\nDavid Squires Peripatetic electronic teachers in higher education\nConfigured discourse\nAsynchronous discussions can also be recorded allowing participants to look at the history\nof a discussion. This in turn leads to attempts to represent discourse history. A variety of\ntechniques exist. Discourse history can be represented in terms of argument threads, tasks\nor simply as a temporal record. Each of these approaches has its advantages and\ndisadvantages.\nMultimedia discourse\nA number of systems, e.g. the Collaborative and Multimedia Interactive Learning\nEnvironment (Hiibscher, Puntambekar and Guzdial, 1997), allow multimedia annotations.\nIt is likely that the nature of discourse labels will change to encompass multimedia objects\nin addition to text: voice notes, video, graphics, pointers to URLs, etc.\nVirtual field centre\nProject-based activities involving information and data-gathering, analysis, synthesis and\nreport are commonly advocated as a means of providing authentic learning experiences.\nField-trip-based activities are a common manifestation of a project-based approach - visits\nto natural habitats to explore ecological issues, visits to museums, art galleries, visits to\nforeign countries, etc. In a Web context it is possible to think of virtual field trips: guided\nexplorations of natural habitats which would include simulations, visits to resource centre\nWeb sites, and so on; art trips involving virtual visits to thematically selected exhibitions;\nhistorical trips involving visits to museums; and cultural trips to other countries with an\nemphasis on communication in the local language. The JlSC-funded Virtual Field Course\nProject (http:\/\/www.geog.le.ac.uk\/vfc), featuring collaboration between the University of\nLeicester, Birkbeck College, Oxford Brookes University and City University, provides an\nexample of a development in this area.\nIn a virtual field trip the PET would have two roles: (i) designing and organizing the trip\nand (ii) acting as guide and navigator during the trip.\nNavigation design\nThe design of the trip will involve the identification of relevant sites and proposing a\nroute(s) for learners. Maps, signposts and itineraries all suggest themselves as navigational\ndevices. However, as Platt and Willard (1998) point out, these techniques are not sensitive\nto temporal changes:\nThere are many techniques used in existing virtual environments that aim to reduce this\nrisk of 'getting lost', such as signposts, maps, landmarks and viewpoints. However, these\nare generally set when the environment is originally designed and based on the designer's\nview of what is an interesting part of the world. Crossley et al. (1997) predict that 3D\nvirtual environments will become more organic, being built and updated dynamically,\nwith greater personalisation of the worlds and greater interactivity with objects.\nTherefore, designer-driven navigation aids may not be able to reflect such developments\nin the environment brought about by user interaction or changing information.\nThis is a serious design issue for virtual field trips. In these trips there should be\npossibilities for learners to explore by adapting\/modifying the route(s) so as to foster\nserendipitous learning: they should not be constrained by the designer's original intentions.\nThese adaptations in themselves provide a rich set of educational materials, implying that\n58\nVolume 7 Number 3\nthe virtual field trips should be mutable (Anderson and McGrath, 1997) to reflect changes\nin the range of suitable locations over time and the experiences of previous learners.\nPlatt and Willard (1998) have proposed three techniques that 'would be able to evolve\nalong with the space and the community':\n• The idea for virtual cairns is derived from the piles of stones that hill walkers place to\nmark routes and indicate points of interest. Platt and Willard describe virtual cairns as\nviewpoints that can be set by users rather than the designer. With a viewpoint there is\nan associated object or collection of objects, allowing users 'to see which positions or\nroutes are important to other users, so the whole community contributes to the\nunderstanding of the space'. If the movement of users is monitored virtual cairns could\nbe placed at frequently visited locations. It would be possible to link virtual cairns to\nother resources - video, text, etc. In a virtual field trip the temporal and spatial\nsensitivity of virtual cairns, the implicit collaboration between learners in adding and\nchanging cairns, and the possibilities afforded by multimedia resource links to cairns\nmake them a very attractive design technique.\n• Trails correspond to the routes most frequently taken by users. These can be generated\nby automatically tracking the routes of users and synthesizing the most popular routes.\nThey can be represented graphically in a virtual space. In a virtual field trip some\ndefault routes could be included to act as an introduction for learners.\n• Intelligent tours are based on the idea of storing how people use a space and using this\ninformation to propose the most interesting route. The Information Garden (Crossley,\nDavies, Taylor-Hendry and McGrath, 1997) provides an example of an intelligent tour.\nPlatt and Willard (1998) describe the simplest case.of an intelligent tour as when 'the\nsystem might only be aware of the location of objects or information in the space, and\nmove the user via these locations'. They propose that tracking other people in the environ-\nment and being aware of popular routes and locations, recent changes in objects and\ninformation, and the specific interests of users would make the system more useful. This\nwould allow the creation of 'a tailor-made route for any particular user, ensuring that they\ndiscover any relevant parts of the environment (information or people) whilst moving\nquickly and effectively through the space' (Platt and Willard, 1998). Intelligent tours could\nopen up the possibility of matching virtual field trips to the needs of individual learners.\nLearning surgery\nA significant component of students' total learning experience is access to dedicated\nteaching support on a personal basis. In this context learners have a chance to express their\nown learning difficulties and get help geared to their own needs. Personal teaching in a\nconventional context is typically provided by a tutor working with individuals or small\ngroups. The notion of mentoring, with subject experts offering individual learners advice\nand information, is also relevant in this context. There is a clear role for PETs to act as\ntutors, utilizing networked conferencing systems and email to provide synchronous and\nasynchronous support at a personal level. Tutoring by PETs leads to the idea of a Learning\nSurgery where individual learners can visit a PET for personal assistance. Conferencing\nsystems also open up the possibility of putting learners in contact with expert mentors\nfrom universities, industry and commerce.\n59\nDavid Squires Peripatetic electronic teachers in higher education\nIndividual and small group tutorials\nSynchronous communication, either between a PET and an individual learner or a small\ngroup of learners, offers possibilities of replicating many of the aspects of conventional\npersonal and small group tutorials. Collaborative artefacts, such as interactive whiteboards\nand shared real-time documents and files, will be very important in the short- and medium-\nterm future. On a longer time-scale shared virtual spaces, with participants represented by\navatars, may provide the design rationale for the development of a Learning Surgery in a\nPET-World.\nAsynchronous conferencing systems and email could also be used to conduct personal and\nsmall group tutorials. The advantage here might be an emphasis on reflective thinking.\nThese systems could also provide an 'out of hours' emergency service. For example,\nlearners having trouble with assignments could post a request for an urgent synchronous\nappointment with a PET to discuss the problem. Perhaps a bulletin board system could be\nused which would allow learners to page a PET by using a special code.\nTelementoring\nAn example of how access to networked conferencing tools can facilitate mentoring is\ngiven by work at Georgia Institute of Technology. In an architecture class, students were\nasked to use Co Web (a co-operative Web-based environment) to create two pages for each\nproject they completed: (i) a project description with scanned images of their drawings\n(pin-ups) and (ii) a statement of research questions to which they needed answers in order\nto complete their designs. Guzdial (1998) describes how expert architects acted as mentors\nby using Co Web:\nExpert architects were invited to tour the students' pin-ups and comment on the projects.\nFor each expert architect, a 'tour page' was set up with the architect's name on it. The\narchitect was invited to visit each of the pin-up pages listed on his or her tour, and\ncomment on the pin-ups either directly on the student's page or on the tour page. This\nactivity was perceived as being more successful in supporting the students' learning. The\nexperts wrote a surprising amount of commentary. They sometimes left comments on\nstudents' pin-up pages with particular advice, and sometimes they wrote on the tour\npage with general advice that the expert felt that the group needed. Students took the\nreviews quite seriously and worked to respond to the experts' comments. (Guzdial, 1998)\nDesign studio\nThe open malleable nature of distributed multimedia provides opportunities for PETs to\nact as the designers of multimedia educational materials. In this capacity they will need to\nhave access to a range of multimedia authoring tools. Within the Design Studio it is\npossible to envisage a number of ways of providing access:\n• links to locally stored generic tools (e.g. DTP packages, modelling systems, spreadsheets)\nand authoring packages (e.g. systems such as Authorware Professional, Director, etc.);\n• links to Web sites offering shareware design and development tools;\n• links to the Web sites of commercial vendors of design\/development tools;\n• links to collaborative design and development environments.\n60\nVolume 7 Number 3\nResource centre\nLearners are going to be confronted with ever increasing amounts of information, and an\nexpectation that their work should be characterized by information-rich exploration and\nexpression. They will need help in selecting information and resources. There is a role here\nfor the PET as an information consultant - someone who will point learners in the\ndirection of useful and relevant resources. In this sense PETs will act like librarians.\nAt a simple level this support could just take the form of a catalogue of useful resources\n(Web sites). However, there is a need to customize and personalize support. PETs could\ngive advice on where to search for relevant information and on appropriate search engines\nto use. Perhaps they could engage in collaborative searching, using shared applications.\nIntelligent agents may be very useful in the future. Perhaps the possibility of a mixture of\nPET and intelligent agent support would be a good idea.\nOne design possibility centres on the concept of mirror virtual worlds which 'provide a\nsecond-person experience in which the viewer stands outside the imaginary world, but\ncommunicates with characters or objects inside it' (McLellan, 1996, p. 460). A digitized\nvideo image of the user is generated and superimposed on the virtual world with its objects\nand characters, allowing an interaction between the user and the inhabitants of the virtual\nworld. Lewis and Cosier (1997) refer to a mirror system for virtual conferences which\nmixes real video, avatars, and a pictorial representation of an intelligent agent. In such an\nenvironment a PET could project his or her presence into a virtual resource centre visited\nby avatars representing learners in need of advice about resource and\/or information\nlocation. A learner's avatar and a PET could communicate to establish the information\nneeded and how best to obtain it. On the basis of these decisions an intelligent agent could\nbe configured to effect the search and deliver the results.\nPET-Worlds in higher education\nIs the concept of a PET-World relevant in higher education systems which are being\nmetamorphosed by radically changing attitudes, resource levels and expectations? How\nwould PETs relate to the rapid expansion of higher education, with the implied need to\ncater for significantly increased student numbers from varied cultural and educational\nbackgrounds? Would PETs help to meet demands for improvements in the quality of\nuniversity teaching or would they compromise attempts to improve quality? Would there\nbe possibilities for improving cost-effectiveness and better use of resources?\nThere is clearly a simplistic argument that the adoption of a paradigm based on the\nextensive use of distributed global networked systems will inevitably lead to improved\naccess, making higher education more available to more people in a variety of locations\nunbounded by temporal constraints. However, this is a superficial argument which makes a\nnumber of assumptions. First, there is an assumption that access to the technical infra-\nstructure supporting PET-Worlds will be widespread, if not universal. While information\nand communications technologies are becoming pervasive, it is probable that in the\nforeseeable future some potential students will not have access to appropriate computing\nfacilities. In addition, will all students be able to afford PET fees? Thus the potential to\nimprove access implies significant equity issues.\n61\nDavid Squires Peripatetic electronic teachers in higher education\nWhat mechanisms and funding issues need to be considered to ensure equitable access? In\nsome ways the establishment of the University for Industry and the National Grid for\nLearning presage the type of developments that would be necessary to encourage the\ndevelopment of PET-Worlds. Other funding models may introduce equity problems. For\nexample, if PETs become common it is reasonable to assume that there would be an\nincrease in telecommunications traffic resulting in increased revenue. Increased use of\ninfrastructure will result in more demand for hardware and more demand for better\nconnectivity (extent and speed). In this context infrastructure providers may assume a role\nas a third party broker of educational services, with implications for the price of accessing\nPET services.\nAs access becomes more universal and varied in character, conventional institutions may\nbe placed under threat, e.g. through the widespread development of agencies which broker\nthe services of self-employed educationalists. This is very much the model adopted by the\nwidely quoted University of Phoenix. This could lead to a gradual decline in standards.\nWhat quality-assurance procedures would need to be established to counter any such\ndecline?\nThe university curriculum may be compromised, with only those subjects offered by PETs\nwhich fit easily into the PET-World framework. The prospectuses of existing virtual\nuniversities indicate that this could be a problem, with a very heavy emphasis on vocational\nsubjects such as business studies, nursing and education, to the exclusion of specialized\nacademic subjects such as classics and nuclear physics. Would the widespread adoption of\nthe PET paradigm lead to an expansion in vocational education at.the expense of\nacademic scholarship?\nThe establishment of PET-Worlds implies a large audience for educational materials,\nwhich in turn implies a cost-effective approach to resource provision. In particular the\narguments rehearsed by Mayes and Fowler (1999) for the reuse of students' materials\nbecome very attractive. However, the initial cost of the development of high-quality\ntechnology-based learning materials should not be underestimated. These initial costs will\nneed to feature in any financial models for the development of PET-Worlds.\nClearly this discussion is limited and speculative, based as it is on a design specification and\nlimited prototype development. Nevertheless, it points up some important potential\nadvantages and disadvantages of embarking on the developments of PET-Worlds. While\nthere are potential difficulties and pitfalls the PET paradigm could offer much in helping\nuniversities to cope with a radically changing higher education context.\nReferences\nAnderson, B. and McGrath, A. (1997), 'Strategies for mutability in virtual environments',\nProceedings of Virtual Environments on Internet, WWW, and Networks, National Museum\nof Photography, Film and Television, Bradford,\nhttp:\/\/www.visual.bt.co.uk\/users\/abc\/andersb2\/public\/papers\/SfM.doc.\nBradley, L., Walker, G. and McGrath, A. (July 1996), 'Shared spaces', British Telecom-\nmunications Engineering Journal, 15, http:\/\/vb.labs.bt.com\/msss\/IBTE_SS\/.\n62\nAa-j Volume 7 Number 3\nCrossley, M., Davies, N. J., Taylor-Hendry, R. J. and McGrath, A. J. (1997), 'Three-\ndimensional Internet developments', British Telecom Technology Journal, 15 (2), 179-93.\nMayes, J. T. and Fowler, C. J. (1999), 'Learning technology and usability: a framework for\nunderstanding courseware', Interacting with Computers, 11 (5), 485-97.\nGuzdial, M. (1998), 'Collaborative websites to support an Open Authoring Community on\nthe Web', http:\/\/guzdial.cc.gatech.edu\/papers\/CoWeb\/.\nHübscher, R., Puntambekar, S. and Guzdial, M. (1997), 'A scaffolded learning environ-\nment supporting learning and design activities', Proceedings of the American Educational\nResearch Association Meeting 1997,\nhttp:\/\/guzdial.cc.gatech.edu\/papers\/aera97\/scaffolding.html.\nIllich, I. D. (1971), Deschooling Society, Harmondsworth: Penguin Books.\nLewis, A. V. and Cosier, G. (1997), 'Whither video? - pictorial culture and telepresence',\nBritish Telecom Technology Journal, 15 (4), 64-85.\nMartin, D. (1997), 'Putting teachers and parents in control: Internet content labelling and\nblocking technologies', Proceedings of the National Educational Computing Conference,\nSeattle, Washington, USA, 281-6.\nMcFarlane, M. C. (1996), 'Humanizing the superhighway', Technology and Society, 14 (4),\n11-18.\nNorman, K. (1998), 'Collaborative interactions in support of learning: models, metaphors\nand management', in Hazemi, R., Hailes, S. and Wilbur, S. (eds.), The Digital University:\nReinventing the Academy, London: Springer, 39-53.\nPlatt, P. and Willard, A. (1998), 'The ramblers guide to virtual environments', IEE\nColloquium: The 3D Interface for the Information Worker (May 1998),\nhttp:\/\/www.hfnet.bt.co.uk\/projects\/IEE_paper\/IEE_paper_vl.htm.\nSchlager, M., Fusco, J. and Schank. P. (in press), 'Conceptual cornerstones for an on-line\ncommunity of education professionals', IEEE Technology and Society,\nhttp:\/\/www.tappedin.org\/info\/ieee.html.\nShneiderman, B., Alavi, M., Norman, K. and Borkowski, E. (1995), 'Windows of\nopportunity in electronic classrooms', Communications of the ACM, 38, 19-24.\nSloffer, S., Duebur, B. and Duffy, T. (1999), 'Using asynchronous conferencing to promote\ncritical thinking: a case study of three implementations in higher education', Proceedings of\nthe Hawaii International Conference on Systems Science, (CD-ROM), Piscataway, NJ:\nIEEE Computer Society Press.\nSquires, D. (1999), 'A teacher's PET for the millennium', in Tuomi-Kyro, E., Salonen, M.,\nSaarinen, P. and Sinko, M. (eds.), Communications and Networking in Education: Learning\nin a Networked Society Conference Proceedings, Aulanko-Hameenlinna, Finland, 328-33.\nWalker, G. (April 1997), 'The mirror - reflections on inhabited TV', British Telecom-\nmunications Engineering Journal, 16, 29-38,\nhttp:\/\/vb.labs.bt.com\/msss\/IBTE_Mirror\/intro.htm.\n63\n"}