{"doi":"10.1029\/2007JA012738","coreId":"195728","oai":"oai:lra.le.ac.uk:2381\/7839","identifiers":["oai:lra.le.ac.uk:2381\/7839","10.1029\/2007JA012738"],"title":"Near-Earth substorm features from multiple satellite observations","authors":["Lui, A. T. Y.","Volwerk, M.","Dunlop, M. W.","Alexeev, I. V.","Fazakerley, A. N.","Walsh, A. P.","Lester, M.","Grocott, Adrian","Mouikis, C.","Henderson, M. G.","Kistler, L. M.","Shen, C.","Shi, J. K.","Zhang, T. L.","Rème, H."],"enrichments":{"references":[{"id":44716337,"title":"A case study of magnetotail current sheet disruption and diversion,","authors":[],"date":"1988","doi":"10.1029\/gl015i007p00721","raw":"Lui, A. T. Y., et al. (1988), A case study of magnetotail current sheet disruption and diversion, Geophys. Res. Lett., 15, 721 – 724, doi:10.1029\/GL015i007p00721.","cites":null},{"id":44716336,"title":"A fresh perspective of the substorm current system and its dynamo,","authors":[],"date":"2003","doi":"10.1029\/2003gl017835","raw":"Lui, A. T. Y., and Y. Kamide (2003), A fresh perspective of the substorm current system and its dynamo, Geophys. Res. Lett., 30(18), 1958, doi:10.1029\/2003GL017835.","cites":null},{"id":44716315,"title":"A model of the auroral electrojets,","authors":[],"date":"1964","doi":"10.1029\/jz069i023p04983","raw":"Bostro¨m, R. (1964), A model of the auroral electrojets, J. Geophys. Res., 69, 4983–4999, doi:10.1029\/JZ069i023p04983.","cites":null},{"id":44716329,"title":"A multisatellite case study of the expansion of a substorm current wedge in the near-Earth magnetotail,","authors":[],"date":"1990","doi":"10.1029\/ja095ia06p08009","raw":"Lopez, R. E., and A. T. Y. Lui (1990), A multisatellite case study of the expansion of a substorm current wedge in the near-Earth magnetotail, J. Geophys. Res., 95, 8009–8018, doi:10.1029\/JA095iA06p08009.","cites":null},{"id":44716386,"title":"A multisatellite study of the plasma sheet dynamics at substorm onset,","authors":[],"date":"1984","doi":"10.1029\/gl011i005p00500","raw":"Sauvaud, J. A., et al. (1984), A multisatellite study of the plasma sheet dynamics at substorm onset, J. Geophys. Res., 11, 500–503.","cites":null},{"id":44716332,"title":"A synthesis of magnetospheric substorm models,","authors":[],"date":"1991","doi":"10.1029\/90ja02430","raw":"Lui, A. T. Y. (1991), A synthesis of magnetospheric substorm models, J. Geophys. Res., 96, 1849–1856, doi:10.1029\/90JA02430.","cites":null},{"id":44716371,"title":"AMPTE\/CCE - SCATHA simultaneous observations of substorm-associated magnetic fluctuations,","authors":[],"date":"1998","doi":"10.1029\/97ja03239","raw":"Ohtani, S., et al. (1998), AMPTE\/CCE - SCATHA simultaneous observations of substorm-associated magnetic fluctuations, J. Geophys. Res., 103, 4671–4682, doi:10.1029\/97JA03239.","cites":null},{"id":44716318,"title":"Analysis of multipoint magnetometer data,","authors":[],"date":"1988","doi":"10.1016\/0273-1177(88)90141-x","raw":"Dunlop, M. W., et al. (1988), Analysis of multipoint magnetometer data, Adv. Space Res., 8, 273–277, doi:10.1016\/0273-1177(88)90141-X.","cites":null},{"id":44716392,"title":"Braking of highspeed flows in the near-Earth tail,","authors":[],"date":"1997","doi":"10.1029\/97gl01062","raw":"Shiokawa, K., W. Baumjohann, and G. Haerendel (1997), Braking of highspeed flows in the near-Earth tail, Geophys. Res. Lett., 24, 1179–1182, doi:10.1029\/97GL01062.","cites":null},{"id":44716339,"title":"Conjunction of tail satellites for substorm study: ISTP event of","authors":[],"date":"2000","doi":"10.1029\/1999gl010772","raw":"Lui, A. T. Y., et al. (2000), Conjunction of tail satellites for substorm study: ISTP event of 1997 January 2, Geophys. Res. Lett., 27, 1831–1834, doi:10.1029\/1999GL010772.","cites":null},{"id":44716375,"title":"Consequences of current interruption for plasma sheet dynamics,","authors":[],"date":"2002","doi":"10.1029\/2001ja009000","raw":"Pritchett, P. L., and F. V. Coroniti (2002), Consequences of current interruption for plasma sheet dynamics, J. Geophys. Res., 107(A9), 1254, doi:10.1029\/2001JA009000.","cites":null},{"id":44716333,"title":"Current disruption in the Earth’s magnetosphere: Observations and models,","authors":[],"date":"1996","doi":"10.1029\/96ja00079","raw":"Lui, A. T. Y. (1996), Current disruption in the Earth’s magnetosphere: Observations and models, J. Geophys. Res., 101, 13,067 – 13,088, doi:10.1029\/96JA00079.","cites":null},{"id":44716316,"title":"Detailed analysis of substorm observations using SuperDARN, UVI, ground-based magnetometers, and all-sky imagers,","authors":[],"date":"2003","doi":"10.1029\/2002ja009242","raw":"Bristow, W. A., et al. (2003), Detailed analysis of substorm observations using SuperDARN, UVI, ground-based magnetometers, and all-sky imagers, J. Geophys. Res., 108(A3), 1124, doi:10.1029\/2002JA009242.","cites":null},{"id":44716321,"title":"Disruption, ballooning or auroral avalanche,","authors":[],"date":"1992","doi":null,"raw":"Haerendel, G. (1992), Disruption, ballooning or auroral avalanche, in Proceedings of the First International Conference on Substorms, Kiruna, Sweden, 23–27 March 1992, Eur. Space Agency Spec. Publ., ESA SP335, 417.","cites":null},{"id":44716342,"title":"Earthward flow bursts, auroral streamers, and small expansions,","authors":[],"date":"2001","doi":"10.1029\/2000ja000306","raw":"Nakamura, R., et al. (2001), Earthward flow bursts, auroral streamers, and small expansions, J. Geophys. Res., 106, 10,791–10,802, doi:10.1029\/ 2000JA000306.","cites":null},{"id":44716373,"title":"Effects of the fast plasma sheet flow on the geosynchronous magnetic configuration: Geotail and GOES coordinated study,","authors":[],"date":"2006","doi":"10.1029\/2005ja011383","raw":"Ohtani, S., H. J. Singer, and T. Mukai (2006), Effects of the fast plasma sheet flow on the geosynchronous magnetic configuration: Geotail and GOES coordinated study, J. Geophys. Res., 111, A01204, doi:10.1029\/ 2005JA011383.","cites":null},{"id":44716396,"title":"Electric field measurements on Geotail satellite,","authors":[],"date":"1994","doi":"10.5636\/jgg.46.693","raw":"Tsuruda, K., et al. (1994), Electric field measurements on Geotail satellite, J. Geomagn. Geoelectr., 46, 693–711.","cites":null},{"id":44716320,"title":"Electromagnetics of substorm onsets in the near-geosynchronous plasma sheet,","authors":[],"date":"2000","doi":"10.1029\/1999ja000424","raw":"Erickson, G. M., et al. (2000), Electromagnetics of substorm onsets in the near-geosynchronous plasma sheet, J. Geophys. Res., 105, 25,265– 25,290, doi:10.1029\/1999JA000424.","cites":null},{"id":44716335,"title":"Extraction of source location parameters from observed particle velocity distribution,","authors":[],"date":"2006","doi":"10.1029\/2006gl027922","raw":"Lui, A. T. Y. (2006), Extraction of source location parameters from observed particle velocity distribution, Geophys. Res. Lett., 33, L21108, doi:10.1029\/2006GL027922.","cites":null},{"id":44716377,"title":"First multispacecraft ion measurements in and near the Earth’s magnetosphere with the identical Cluster ion spectrometry (CIS) experiment,","authors":[],"date":"2001","doi":null,"raw":"Re`me, H., et al. (2001), First multispacecraft ion measurements in and near the Earth’s magnetosphere with the identical Cluster ion spectrometry (CIS) experiment, Ann. Geophys., 19, 1303–1354.","cites":null},{"id":44716314,"title":"Flow braking and the substorm current wedge,","authors":[],"date":"1999","doi":"10.1029\/1999ja900173","raw":"Birn, J., et al. (1999), Flow braking and the substorm current wedge, J. Geophys. Res., 104, 19,895–19,903, doi:10.1029\/1999JA900173.","cites":null},{"id":44716402,"title":"GEOTAIL energetic particles and ion composition instrument,","authors":[],"date":"1994","doi":"10.5636\/jgg.46.39","raw":"Williams, D. J., et al. (1994), GEOTAIL energetic particles and ion composition instrument, J. Geomagn. Geoelectr., 46, 39–57.  I. V. Alexeev, A. N. Fazakerley, and A. P. Walsh, Mullard Space Science Laboratory, Holmbury St. Mary, Dorking, Surrey RH5 6NT, UK. M. W. Dunlop, Space Science and Technology Department, RAL, Chilton, Didcot, Oxon OX11 0QX, UK. A. Grocott and M. Lester, Department of Physics and Astronomy, University of Leicester, Leicester, LE1 7RH, UK. M. Henderson, Los Alamos National Laboratory, Los Alamos, NM 87545, USA. L. M. Kistler and C. Mouikis, Space Science Center, University of New Hampshire, Durham, NH 03824, USA. A. T. Y. Lui, Johns Hopkins University Applied Physics Laboratory, Laurel, MD 20723, USA. H. Re`me, CESR\/CNRS, F-31028 Toulouse, France. C. Shen and J. K. Shi, Center for Space Science and Applied Research, Chinese Academy of Sciences, Beijing 10080, China. M. Volwerk and T. L. Zhang, Space Research Institute, Austrian Academy of Sciences, A-8042, Graz, Austria. A07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES","cites":null},{"id":44716325,"title":"Ground-based studies of ionospheric convection associated with substorm expansion,","authors":[],"date":"1994","doi":"10.1029\/94ja01625","raw":"Kamide, Y., et al. (1994), Ground-based studies of ionospheric convection associated with substorm expansion, J. Geophys. Res., 99, 19,451– 19,466, doi:10.1029\/94JA01625.","cites":null},{"id":44716334,"title":"Highlights on how to interpret auroral observation in terms of plasma sheet processes,","authors":[],"date":"2000","doi":null,"raw":"Lui, A. T. Y. (2000), Highlights on how to interpret auroral observation in terms of plasma sheet processes, in Proceedings of 5th International Conference on Substorms, St. Petersburg, Russia, May 16–20, 2000, Eur. Space Agency Spec. Publ., ESA SP 443, 231–234.","cites":null},{"id":44716317,"title":"Kinetic ballooning instability for substorm onset and current disruption observed by AMPTE\/CCE,","authors":[],"date":"1998","doi":"10.2172\/289896","raw":"Cheng, C. Z., and A. T. Y. Lui (1998), Kinetic ballooning instability for substorm onset and current disruption observed by AMPTE\/CCE, Geophys. Res. Lett., 25, 4091–4094, doi:10.1029\/1998GL900093.","cites":null},{"id":44716322,"title":"Location and propagation of the magnetotail current disruption during substorm expansion: Analysis and simulation of an ISEE multi-onset event,","authors":[],"date":"1991","doi":"10.1029\/90gl02789","raw":"Jacquey, C., J. A. Sauvaud, and J. Dandouras (1991), Location and propagation of the magnetotail current disruption during substorm expansion: Analysis and simulation of an ISEE multi-onset event, Geophys. Res.","cites":null},{"id":44716394,"title":"Magnetic field fluctuations during substormassociated dipolarizations in the nightside plasma sheet around","authors":[],"date":"2005","doi":"10.1029\/2004ja010378","raw":"Shiokawa, K., et al. (2005), Magnetic field fluctuations during substormassociated dipolarizations in the nightside plasma sheet around X = 10 RE, J. Geophys. Res., 110, A05212, doi:10.1029\/2004JA010378.","cites":null},{"id":44716398,"title":"Modeling the Earth’s magnetospheric magnetic field confined within a realistic magnetopause,","authors":[],"date":"1995","doi":"10.1029\/94ja03193","raw":"Tsyganenko, N. A. (1995), Modeling the Earth’s magnetospheric magnetic field confined within a realistic magnetopause, J. Geophys. Res., 100, 5599–5612, doi:10.1029\/94JA03193.","cites":null},{"id":44716355,"title":"Motion of the dipolarization front during a flow burst event observed by Cluster,","authors":[],"date":"2002","doi":"10.1029\/2002gl015763","raw":"Nakamura, R., et al. (2002), Motion of the dipolarization front during a flow burst event observed by Cluster, Geophys. Res. Lett., 29(20), 1942, doi:10.1029\/2002GL015763.","cites":null},{"id":44716312,"title":"Multipoint analysis of a bursty bulk flow event on","authors":[],"date":"1996","doi":"10.1029\/95ja02722","raw":"Angelopoulos, V., et al. (1996), Multipoint analysis of a bursty bulk flow event on April 11, 1985, J. Geophys. Res., 101, 4967–4990, doi:10.1029\/ 95JA02722.","cites":null},{"id":44716331,"title":"Multipoint observations of a small substorm,","authors":[],"date":"1990","doi":"10.1029\/ja095ia11p18897","raw":"Lopez, R. E., et al. (1990), Multipoint observations of a small substorm, J. Geophys. Res., 95, 18,897–18,912, doi:10.1029\/JA095iA11p18897.","cites":null},{"id":44716338,"title":"Near-Earth dipolarization: Evidence for a nonMHD process,","authors":[],"date":"1999","doi":"10.1029\/1999gl003620","raw":"Lui, A. T. Y., et al. (1999), Near-Earth dipolarization: Evidence for a nonMHD process, Geophys. Res. Lett., 26, 2905 – 2908, doi:10.1029\/ 1999GL003620.","cites":null},{"id":44716390,"title":"Observation of repeated intense near-Earth reconnection on closed field lines with Cluster, Double Star, and other spacecraf t ,","authors":[],"date":"2007","doi":"10.1029\/2006gl028452","raw":"Sergeev, V., et al. (2007), Observation of repeated intense near-Earth reconnection on closed field lines with Cluster, Double Star, and other spacecraf t , Geophys. Res. Lett . , 34 , L02103, doi:10.1029\/ 2006GL028452.","cites":null},{"id":44716382,"title":"Observations of a detached discrete arc in association with field line resonances,","authors":[],"date":"1991","doi":"10.1029\/91ja00796","raw":"Samson, J. C., et al. (1991), Observations of a detached discrete arc in association with field line resonances, J. Geophys. Res., 96, 15,683– 15,695, doi:10.1029\/91JA00796.","cites":null},{"id":44716384,"title":"Observations of field line resonances, auroral arcs, and auroral vortex structures,","authors":[],"date":"1996","doi":"10.1029\/96ja01086","raw":"Samson, J. C., L. L. Cogger, and Q. Pao (1996), Observations of field line resonances, auroral arcs, and auroral vortex structures, J. Geophys. Res., 101, 17,373–17,383, doi:10.1029\/96JA01086.","cites":null},{"id":44716324,"title":"PEACE: A plasma electron and current exper iment ,","authors":[],"date":"1997","doi":null,"raw":"Johnstone, A. D., et al. (1997), PEACE: A plasma electron and current exper iment , Space Sc i . Rev. , 79 , 351 – 398, doi :10.1023\/ A:1004938001388.","cites":null},{"id":44716379,"title":"Plasma sheet instability related to the westward traveling surge,","authors":[],"date":"1991","doi":"10.1029\/91ja01106","raw":"A07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES 16 of 17 A07S26 Roux, A., et al. (1991), Plasma sheet instability related to the westward traveling surge, J. Geophys. Res., 96, 17,697–17,714, doi:10.1029\/ 91JA01106.","cites":null},{"id":44716326,"title":"Postmidnight convection dynamics during substorm expansion phase,","authors":[],"date":"2006","doi":"10.1029\/2005ja011483","raw":"Liang, J., G. J. Sofko, and H. U. Frey (2006), Postmidnight convection dynamics during substorm expansion phase, J. Geophys. Res., 111, A04205, doi:10.1029\/2005JA011483.","cites":null},{"id":44716357,"title":"Radial expansion of the tail current disruption during substorms: A new approach to substorm onset region,","authors":[],"date":"1992","doi":"10.1029\/91ja02470","raw":"Ohtani, S., K. Takahashi, and C. T. Russell (1992), Radial expansion of the tail current disruption during substorms: A new approach to substorm onset region, J. Geophys. Res., 97, 3129–3136, doi:10.1029\/ 91JA02470.","cites":null},{"id":44716400,"title":"Solitary kinetic Alfve´n waves: A study of the Poynting flux,","authors":[],"date":"1996","doi":"10.1029\/96ja00166","raw":"Volwerk, M., et al. (1996), Solitary kinetic Alfve´n waves: A study of the Poynting flux, J. Geophys. Res., 101, 13,335–13,343, doi:10.1029\/ 96JA00166.","cites":null},{"id":44716356,"title":"Spatial scale of high-speed flows in the plasma sheet observed by Cluster,","authors":[],"date":"2004","doi":"10.1029\/2004gl019558","raw":"Nakamura, R., et al. (2004), Spatial scale of high-speed flows in the plasma sheet observed by Cluster, Geophys. Res. Lett., 31, L09804, doi:10.1029\/ 2004GL019558.","cites":null},{"id":44716341,"title":"Structure and dynamics of magnetic reconnection for substorm onsets with Geotail observations,","authors":[],"date":"1998","doi":"10.1029\/97ja02190","raw":"Nagai, T., et al. (1998), Structure and dynamics of magnetic reconnection for substorm onsets with Geotail observations, J. Geophys. Res., 103, 4419–4440, doi:10.1029\/97JA02190.","cites":null},{"id":44716319,"title":"Substorm theories: United they stand, divided they fall,","authors":[],"date":"1995","doi":"10.1029\/95rg00398","raw":"Erickson, G. M. (1995), Substorm theories: United they stand, divided they fall, Rev. Geophys., 33, 685–692, doi:10.1029\/95RG00398.","cites":null},{"id":44716323,"title":"Tailward propagating cross-tail current disruption and dynamics of near-Earth tail: A multi-point measurement analysis,","authors":[],"date":"1993","doi":"10.1029\/93gl00072","raw":"Jacquey, C., J. A. Sauvaud, J. Dandouras, and A. Korth (1993), Tailward propagating cross-tail current disruption and dynamics of near-Earth tail: A multi-point measurement analysis, Geophys. Res. Lett., 20, 983–986, doi:10.1029\/93GL00072.","cites":null},{"id":44716313,"title":"The Cluster magnetic field investigation: overview of in-flight performance and initial results,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1207-2001","raw":"Balogh, A., et al. (2001), The Cluster magnetic field investigation: overview of in-flight performance and initial results, Ann. Geophys., 19, 1207–1217.","cites":null},{"id":44716311,"title":"The development of the auroral substorm,","authors":[],"date":"1964","doi":"10.1016\/0032-0633(64)90151-5","raw":"Akasofu, S.-I. (1964), The development of the auroral substorm, Planet. Space Sci., 12, 273–282, doi:10.1016\/0032-0633(64)90151-5.","cites":null},{"id":44716340,"title":"The low energy particle (LEP) experiment onboard the GEOTAIL satellite,","authors":[],"date":"1994","doi":"10.5636\/jgg.46.669","raw":"Mukai, T., et al. (1994), The low energy particle (LEP) experiment onboard the GEOTAIL satellite, J. Geomagn. Geoelectr., 46, 669–692.","cites":null},{"id":44716388,"title":"Transition from substorm growth to substorm expansion phase as observed with a radial configuration of ISTP and Cluster spacecraft,","authors":[],"date":"2005","doi":"10.5194\/angeo-23-2183-2005","raw":"Sergeev, V. A., et al. (2005), Transition from substorm growth to substorm expansion phase as observed with a radial configuration of ISTP and Cluster spacecraft, Ann. Geophys., 23, 2183–2198.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-05-16","abstract":"We investigate a substorm on 3 October 2004 during which 11 satellites were located in near-Earth magnetotail (X GSM > −10 R E). Double Star 1 (TC-1), Cluster, and LANL-97 satellites were closely aligned in the dawn-dusk direction (<1 R E apart) for this conjunction. After substorm expansion onset, TC-1 observed plasma sheet thinning at X ≈ −5.5 R E and later detected signature of plasma flow shear that may be associated with an auroral arc. Analysis of the dawn-dusk magnetic perturbations from GOES-10 and Polar suggests that these could be caused by a substorm current system consisting of not only the azimuthal closure of field-aligned currents (the substorm current wedge) but also the meridional closure of field-aligned currents. The temporal sequence of substorm activity (particle injection, current disruption, and dipolarization) revealed by these satellites indicates that the substorm expansion activity was initiated close to the Earth and spread later to further downstream distances. Furthermore, TC-1 and Cluster data show that there is no close relationship between some dipolarizations and Earthward plasma flows in the near-Earth region. The overall development of substorm activity is in agreement with the near-Earth initiation model for substorms. A temporal evolution of the magnetic field reconfiguration and plasma boundary motion during this substorm is constructed from these observations","downloadUrl":"http:\/\/www.agu.org\/pubs\/crossref\/2008\/2007JA012738.shtml.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7839\/3\/Near-Earth%20substorm%20features%20....pdf","pdfHashValue":"362a7dc9df7fdd8d79c3aaa808686fe660d0181c","publisher":"American Geophysical Union (AGU)","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7839<\/identifier><datestamp>\n                2015-12-14T17:33:02Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nNear-Earth substorm features from multiple satellite observations<\/dc:title><dc:creator>\nLui, A. T. Y.<\/dc:creator><dc:creator>\nVolwerk, M.<\/dc:creator><dc:creator>\nDunlop, M. W.<\/dc:creator><dc:creator>\nAlexeev, I. V.<\/dc:creator><dc:creator>\nFazakerley, A. N.<\/dc:creator><dc:creator>\nWalsh, A. P.<\/dc:creator><dc:creator>\nLester, M.<\/dc:creator><dc:creator>\nGrocott, Adrian<\/dc:creator><dc:creator>\nMouikis, C.<\/dc:creator><dc:creator>\nHenderson, M. G.<\/dc:creator><dc:creator>\nKistler, L. M.<\/dc:creator><dc:creator>\nShen, C.<\/dc:creator><dc:creator>\nShi, J. K.<\/dc:creator><dc:creator>\nZhang, T. L.<\/dc:creator><dc:creator>\nRème, H.<\/dc:creator><dc:description>\nWe investigate a substorm on 3 October 2004 during which 11 satellites were located in near-Earth magnetotail (X GSM > −10 R E). Double Star 1 (TC-1), Cluster, and LANL-97 satellites were closely aligned in the dawn-dusk direction (<1 R E apart) for this conjunction. After substorm expansion onset, TC-1 observed plasma sheet thinning at X ≈ −5.5 R E and later detected signature of plasma flow shear that may be associated with an auroral arc. Analysis of the dawn-dusk magnetic perturbations from GOES-10 and Polar suggests that these could be caused by a substorm current system consisting of not only the azimuthal closure of field-aligned currents (the substorm current wedge) but also the meridional closure of field-aligned currents. The temporal sequence of substorm activity (particle injection, current disruption, and dipolarization) revealed by these satellites indicates that the substorm expansion activity was initiated close to the Earth and spread later to further downstream distances. Furthermore, TC-1 and Cluster data show that there is no close relationship between some dipolarizations and Earthward plasma flows in the near-Earth region. The overall development of substorm activity is in agreement with the near-Earth initiation model for substorms. A temporal evolution of the magnetic field reconfiguration and plasma boundary motion during this substorm is constructed from these observations.<\/dc:description><dc:date>\n2010-04-27T14:46:10Z<\/dc:date><dc:date>\n2010-04-27T14:46:10Z<\/dc:date><dc:date>\n2008-05-16<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nJournal of Geophysical Research, 2008, 113, A07S26.<\/dc:identifier><dc:identifier>\n0148-0227<\/dc:identifier><dc:identifier>\nhttp:\/\/onlinelibrary.wiley.com\/doi\/10.1029\/2007JA012738\/abstract<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7839<\/dc:identifier><dc:identifier>\n10.1029\/2007JA012738<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRadio and Space Plasma Physics<\/dc:relation><dc:rights>\nThis paper was published as Journal of Geophysical Research, 2008, 113, A07S26.  Copyright 2008 American Geophysical Union.  It is also available from http:\/\/www.agu.org\/pubs\/crossref\/2008\/2007JA012738.shtml.  Doi: 10.1029\/2007JA012738<\/dc:rights><dc:publisher>\nAmerican Geophysical Union (AGU)<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0148-0227","0148-0227"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Radio and Space Plasma Physics"],"year":2008,"topics":[],"subject":["Article"],"fullText":"Near-Earth substorm features from multiple satellite observations\nA. T. Y. Lui,1 M. Volwerk,2,3 M. W. Dunlop,4 I. V. Alexeev,5 A. N. Fazakerley,5\nA. P. Walsh,5 M. Lester,6 A. Grocott,6 C. Mouikis,7 M. G. Henderson,8 L. M. Kistler,7\nC. Shen,9 J. K. Shi,9 T. L. Zhang,2 and H. Re`me10\nReceived 19 August 2007; revised 3 January 2008; accepted 7 February 2008; published 16 May 2008.\n[1] We investigate a substorm on 3 October 2004 during which 11 satellites were located\nin near-Earth magnetotail (XGSM > \u000110 RE). Double Star 1 (TC-1), Cluster, and LANL-97\nsatellites were closely aligned in the dawn-dusk direction (<1 RE apart) for this\nconjunction. After substorm expansion onset, TC-1 observed plasma sheet thinning at X \u0002\n\u00015.5 RE and later detected signature of plasma flow shear that may be associated with an\nauroral arc. Analysis of the dawn-dusk magnetic perturbations from GOES-10 and\nPolar suggests that these could be caused by a substorm current system consisting of not\nonly the azimuthal closure of field-aligned currents (the substorm current wedge) but also\nthe meridional closure of field-aligned currents. The temporal sequence of substorm\nactivity (particle injection, current disruption, and dipolarization) revealed by these\nsatellites indicates that the substorm expansion activity was initiated close to the Earth and\nspread later to further downstream distances. Furthermore, TC-1 and Cluster data show\nthat there is no close relationship between some dipolarizations and Earthward plasma\nflows in the near-Earth region. The overall development of substorm activity is in\nagreement with the near-Earth initiation model for substorms. A temporal evolution of the\nmagnetic field reconfiguration and plasma boundary motion during this substorm is\nconstructed from these observations.\nCitation: Lui, A. T. Y., et al. (2008), Near-Earth substorm features from multiple satellite observations, J. Geophys. Res., 113,\nA07S26, doi:10.1029\/2007JA012738.\n1. Introduction\n[2] The physical process responsible for the substorm\nexpansion onsets [Akasofu, 1964] has puzzled space scien-\ntists for more than 4 decades. There are two main contem-\nporary substorm models. One calls for the occurrence of\nmagnetic reconnection at a downstream distance of \u000320 RE\nin the magnetotail. The resulting earthward directed plasma\njet impinges on the magnetic field in the inner magneto-\nsphere to form an eastward inertial current in the neutral\nsheet and lead to the substorm current wedge [Haerendel,\n1992; Shiokawa et al., 1997; Nagai et al., 1998; Birn et al.,\n1999; Nakamura et al., 2001, 2002]. The other invokes a\nplasma process different from magnetic reconnection in the\nnear-Earth region that allows the cross-tail current to be\ndisrupted, giving rise to the substorm current wedge.\nMagnetic reconnection may occur further down the magne-\ntotail as current disruption spreads further downstream [e.g.,\nLui, 1991, 1996; Roux et al., 1991; Erickson, 1995; Cheng\nand Lui, 1998; Erickson et al., 2000; Bristow et al., 2003].\nCurrent disruption can also generate meridional closure\ncurrents [Lui and Kamide, 2003]. The former and latter\nmodels are referred to as the midtail initiation and the near-\nEarth initiation, respectively.\n[3] The transition region in which the tail-like magnetic\nfield configuration changes to the dipolar magnetic field\nconfiguration bears significance to both models. In the\nmidtail initiation model, the transition region is where the\nbraking of a plasma jet leads to an eastward inertial current\nand drives the substorm current wedge initially. In the near-\nEarth initiation model, the transition region is the site where\nthe substorm onset process occurs. One major deficiency\ncontributing to this substorm controversy is the scarcity of\nfull-suite plasma measurements in the transition region to\nexamine the plasma dynamics there due to the fact that very\nfew satellites traverse the region. This difficulty in examin-\ning substorm behavior in the region is compounded by the\nspatial localization of these disturbances. Earthward directed\nplasma jets are expected to be rather narrow in the dawn-\ndusk direction [e.g., Angelopoulos et al., 1996; Nakamura\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 113, A07S26, doi:10.1029\/2007JA012738, 2008\nClick\nHere\nfor\nFull\nArticle\n1Johns Hopkins University Applied Physics Laboratory, Laurel,\nMaryland, USA.\n2Space Research Institute, Austrian Academy of Sciences, Graz,\nAustria.\n3Max Planck Institute for Extraterrestrial Physics, Garching, Germany.\n4Space Science and Technology Department, RAL, Didcot, UK.\n5Mullard Space Science Laboratory, Dorking, UK.\n6Department of Physics and Astronomy, University of Leicester,\nLeicester, UK.\n7Space Science Center, University of New Hampshire, Durham, New\nHampshire, USA.\n8Los Alamos National Laboratory, Los Alamos, New Mexico, USA.\n9Center for Space Science and Applied Research, Chinese Academy of\nSciences, Beijing, China.\n10CESR\/CNRS, Toulouse, France.\nCopyright 2008 by the American Geophysical Union.\n0148-0227\/08\/2007JA012738$09.00\nA07S26 1 of 17\net al., 2004]. Current disruptions are also observed to occur\nin very spatially limited regions [e.g., Lui et al., 1988; Lopez\nand Lui, 1990; Ohtani et al., 1998]. The advent of the\nDouble Star Program has contributed significantly by pro-\nviding valuable measurements in the transition region.\nFurther relief to this deficiency in observations is expected\nfrom the recently launched NASA mission THEMIS (Time\nHistory of Events and Macroscale Interactions during Sub-\nstorms). Its primary target is to resolve this substorm\ncontroversy by examining the propagation direction of\nsubstorm disturbances in the magnetotail with five satellites,\nthree of which are placed with apogee near the transition\nregion.\n[4] Prior to the availability of data from the Double Star\nProgram and the THEMIS mission to address the location of\nsubstorm onset process, there were occasions in which\nvaluable information about time development of substorm\nphenomena could be extracted from fortuitous satellite\nconjunctions [e.g., Lui et al., 2000, 2007; Sergeev et al.,\n2005, 2007]. In this paper, we present analysis of a sub-\nstorm event during which 11 satellites were in close\nproximity with each other in the near-Earth magnetotail.\nThe results shed considerable light on the substorm dynam-\nics in the near-Earth magnetotail that can be used to\ndifferentiate the two models.\n2. Observations\n2.1. Ground-Based Observations\n[5] The ground magnetic activity related to substorms on\n3 October 2004 is exemplified by the AU\/AL indices shown\nin Figure 1a. Several noticeable enhancements in these\nindices occurred during that day. The shaded region high-\nlights the time interval when favorable satellite conjunction\noccurred. The substorm expansion onset for this conjunc-\ntion event was at \u00031048 UT, with the peak disturbance of\nthe AL index reached at \u00031119 UT. The occurrence of\nrepeated substorm activity from \u00030500 UT onward for the\nday is expected since data from the Wind satellite (not\nshown) indicate that the interplanetary magnetic field be-\ncame southward at \u00030339 UT and remained mostly south-\nward for \u000314 h. Figure 1b shows magnetograms from\nseveral magnetic stations at the auroral latitudes. The\ntriangle underneath each trace marks the magnetic local\nmidnight for that station. The substorm activity seen in the\nAU\/AL indices was registered by the CMO (College)\nstation that was in the early postmidnight magnetic local\ntime (MLT) at substorm expansion onset (1048 UT). Most\nof the other late postmidnight stations (e.g., BLC and PBQ)\ndid not detect significant magnetic perturbations, with the\nnotable exception of FCC that observed rather continuous\nbut weak magnetic activity. In addition to these magnetic\nstations in the northern hemisphere, similar magnetic activ-\nity with onset at 1048 UTwas recorded at Dumont d’Uroille\nstation in the southern hemisphere.\n2.2. Distribution of Satellites in the Magnetosphere\n[6] The projections of satellite locations on the XY- and\nXZ-planes of the Geocentric Solar Magnetospheric (GSM)\ncoordinate system in the nightside magnetosphere during\nthis interval are indicated in Figure 2. There were 11 satel-\nlites altogether, eight in the premidnight MLT (four Cluster\nsatellites, two Double Star satellites, Polar, and the Los\nAlamos satellite LANL-97), one near the midnight meridian\n(LANL-91), and two in the postmidnight MLT (GOES-10\nand Geotail). In particular, three premidnight satellites had\nnearly the same YGSM-coordinate value (<1 RE difference),\ni.e., the YGSM values at 1048 UT for Cluster (SAMBA: C3),\nDouble Star 1 (also known as TC-1), and LANL-97 are 4.6,\n5.3, and 5.0 RE, respectively. The coordinate system adop-\nted throughout this study is GSM unless stated otherwise.\n2.3. Geosynchronous Particle Observations\n[7] Energetic proton fluxes from the Los Alamos geo-\nsynchronous satellites on that day are shown in Figure 3.\nTwo satellites (LANL-91, LANL-97) were in the night\nsector at \u00031048 UT and observed substorm injections at\nabout the same time. These particle injections were preced-\ned by gradual decreases and, in some energy channels,\ndropouts of particle fluxes. This evolution in particle fluxes\nis a typical preinjection behavior signaling plasma sheet\nthinning at these locations prior to substorm injection. One\nmay notice that smaller injections can be seen in some\nenergy channels just before the \u00031048 UT injection, espe-\ncially evident in the LANL-91 data. These small injections\ncorrespond well to the weaker magnetic disturbances on the\nground prior to the 1048 UT substorm expansion onset as\nindicated by the CMO magnetogram and the AL index in\nFigure 1.\n2.4. TC-1 Observations\n[8] The plasma and magnetic field measurements from\nTC-1 are given in Figure 4. In each plasma flow panel, the\nsolid trace gives the plasma flow component perpendicular\nto the magnetic field whereas the dotted trace gives the total\nplasma flow component. The fact that the dotted traces are\noften not noticeable in most of the interval indicates that the\nplasma flows were mostly perpendicular to the magnetic\nfield in this inner region. There were very weak plasma\nflows perpendicular to the magnetic field at TC-1 during the\nearly part of this time interval. TC-1 entered the tail lobe\nshortly after substorm onset. This transition was indicated\nby the absence of plasma electrons based on the data from\nthe Plasma Electrons and Current Experiment (PEACE)\n[Johnstone et al., 1997]. There were frequent occurrences\nof cold ion beams in the tail lobe based on data from the\nCluster Ion Spectrometry experiment (CIS) [Re`me et al.,\n2001].\n[9] A strong plasma flow burst occurred around\n\u00031110 UT after TC-1 observed the recovery of the plasma\ndensity to a level similar to that before 1050 UT. This\nplasma flow burst was accompanied by nearly simultaneous\nmagnetic perturbations, which will be examined in more\ndetail later. The Bz component was close to zero before\nsubstorm onset but increased significantly starting at\n\u00031048 UT. After the reentry of TC-1 into the hot plasma\nsheet at \u00031110 UT during substorm expansion, the Bz\ncomponent showed significant variability, similar to field\nfluctuations in current disruptions associated with dipolari-\nzation reported previously [e.g., Lui et al., 1988]. Therefore,\ncurrent disruption phenomenon occurred at the TC-1 loca-\ntion. However, it is unclear whether or not the substorm\nonset was caused by current disruption at TC-1 or the\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n2 of 17\nA07S26\ndisturbance at TC-1 was propagated from elsewhere or\ngenerated locally.\n[10] A more expanded timescale for TC-1 data is provided\nin Figure 5. The dotted and solid traces in the velocity\npanels have the same meaning as that in Figure 4. The\nplasma flow burst at \u00031109–1111 UT (shaded region) had a\nshear flow signature and was located at the interface\nbetween the cold and hot plasmas in the plasma sheet\nboundary layer. All three components of the plasma flow\nwere negative first and then turned positive. In the midst of\nthe shear flow was a significant plasma flow component\nalong the magnetic field. A detailed examination of the\nvelocity distribution function shows a fast ion beam with a\ncrescent-shaped distribution in the velocity space. This\nshape can originate from an ion population with a fast bulk\nflow parallel to the magnetic field moving to a stronger\nmagnetic field region, causing it to spread in the pitch angle\nspace by the conservation of the first adiabatic invariant\n[see, e.g., Lui, 2006]. The observed feature differs from the\nidea of plasma flow braking in that plasma flow perpendic-\nular to the magnetic field is considered in flow braking\ninstead.\n[11] The flow shear nature is illustrated more clearly in\nFigure 6 by transforming the plasma flows into a cylindrical\ncoordinate system with radial (Vr) and azimuthal (Vphi)\ncomponents. The radial axis points to the Earth and the\nazimuthal axis points westward. In this coordinate system,\nthe shear flows during \u00031109–1111 UT are seen to be\nmainly in the azimuthal direction, like what is anticipated\nfrom plasma flows associated with an auroral arc, e.g., by\nmagnetic field line resonance [Samson et al., 1991]. One\nmay also notice that several increases in the Bz component\nand the elevation angle (Blat) of the magnetic field\n(Figure 6c), marked by vertical dotted lines, were not\nassociated with any appreciable earthward plasma flow\n(Vr). In fact, two of these were associated with antiearth-\nward plasma flow instead. Since these increases were not\nclearly accompanied by appreciable earthward plasma\nflows, they are unlikely to be related to magnetic flux\npileup from plasma flow braking.\n[12] The presence of field-aligned current (FAC) at TC-1\nis indicated by the procedure described by Volwerk et al.\n[1996]. The sequence of vectors in Figure 6e shows the\ntemporal evolution of the residual magnetic field vector\nperpendicular to the mean magnetic field obtained from a\nFigure 1. (a) The AU (upper trace) and AL (lower trace) indices on 2004 October 3; (b) the ground\nmagnetic activity in terms of the north-south component from magnetic stations LRV, NAQ, PBQ, FCC,\nBLC, and CMO.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n3 of 17\nA07S26\nlow-pass filter. The mean field is pointing out of the paper.\nA clockwise rotation of the vectors indicates a FAC anti-\nparallel to the mean magnetic field. For this event, there was\na clockwise rotation at \u00031106:30 UT, followed by an\nanticlockwise rotation in 1107–1108 UT coincident with\nthe large increases in the Bz component and the elevation\nangle. This sequence indicates first a weak FAC antiparallel\nto the magnetic field (earthward from the magnetosphere to\nthe ionosphere since TC-1 was in the southern hemisphere)\nfollowed by a stronger FAC parallel to the magnetic field\n(tailward from the ionosphere to the magnetosphere).\nAfterward, clockwise rotations were seen within the interval\nof \u00031109–1114 UT, with the exception at \u00031110:30 UT\nwhere the vectors indicate a brief encounter of a thin current\nsheet with the current directed earthward. Overall, the FAC\npattern is quite complicated at TC-1.\nFigure 2. Projections on the (a) XY-plane and (b) XZ-plane of satellite locations during the conjunction\ninterval. The length of the trace associated with each satellite symbol represents the distance traveled by\nthe satellite in an 1-h interval after 1045 UT on 3 October 2004.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n4 of 17\nA07S26\n2.5. Cluster Observations\n[13] Measurements from the Cluster satellite SAMBA\nduring this interval are shown in Figure 7. Since data from\nSAMBA are quite representative of data from the other\nthree Cluster satellites, only SAMBA data are shown here\nfor clarity. There was a data gap for plasma measurements\nin the early part of this interval. Fortunately, magnetic field\ndata are available on all four satellites. The measured\nplasma parameters at Cluster had quite similar values and\ntrends as that seen at TC-1. There was a flow burst detected\nat \u00031120 UT by Cluster and the flow magnitude was larger\nthan that at TC-1. Associated with this flow burst were\nsignificant magnetic disturbances just like that at TC-1.\n[14] An expanded timescale plot surrounding the plasma\nflow burst interval is shown in Figure 8. The data show that\nthe earthward-duskward flow burst was detected at \u00031120–\n1121 UT. It occurred later and lasted longer than that at TC-\n1 and had no shear flow signature. The time delay is\nprobably due to Cluster being located further downstream\nthan TC-1 relative to the substorm disturbance region,\nleading to a time delay for the substorm disturbance reach-\ning Cluster later than TC-1. There was a significant plasma\nflow along the magnetic field when plasma flow was\nobserved at Cluster. A significant increase in the Bz com-\nponent occurred at \u00031122 UT, marked by the vertical dotted\nline. The perpendicular x-component of plasma flow ac-\ncompanying this Bz increase was weak (Vx < 100 km\/s),\npreceded by several reversals in the y-component of plasma\nflow at moderate magnitudes. Therefore, similar to the\nsituation at TC-1, this Bz increase is unlikely to be caused\nby the magnetic flux pileup process.\nFigure 3. The intensities of energetic protons (50–315 keV in five energy channels) at several LANL\ngeosynchronous satellites. The triangle underneath the LANL-97 and LANL-91 panels marks the\nmidnight local time for that satellite.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n5 of 17\nA07S26\n[15] Figure 8e shows the current densities deduced by the\nCurlometer technique using magnetic field data from all\nfour satellites [Dunlop et al., 1988]. The current density\nperpendicular to the magnetic field and the FAC density are\nshown separately by the solid and dotted traces, respectively.\nAt the onset of Bz increase, which is probably related to\ncurrent disruption subsequent to the one at substorm onset\n(note that multiple current disruption sites and onsets are\nenvisioned in the current disruption model for substorms),\nthe FAC is antiparallel to the magnetic field, corresponding\nto a current from the ionosphere to the magnetosphere. This\ncurrent direction is consistent with Cluster being located at\nthe western portion of the substorm current wedge when\ndipolarization reaches the Cluster location and in agreement\nwith the premidnight location of Cluster.\n2.6. Comparison Between Cluster and TC-1\nObservations\n[16] A comparison of the increases in the Bz components\nbetween TC-1 and the Cluster satellite is given in Figure 9,\nFigure 4. Plasma and magnetic field observations at TC-1.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n6 of 17\nA07S26\nwhich also shows the separation distances between the four\nCluster satellites in the XY- and YZ-planes. A distinct\nincrease in the Bz component was seen by TC-1 at\n\u00031048 UT. The plot shows that TC-1 detected the increase\n\u00031.5 min before the Cluster satellite. An operational defi-\nnition for dipolarization used here is a significant increase\nof Bz exceeding its variation prior to detection of sub-\nstorm activity at the satellite. The gradual Bz increase at\nCluster in the interval \u00031046–1049 UT is therefore not\nconsidered to be dipolarization because its variability was\nwithin the Bz values well before the substorm onset (e.g.,\n1035–1042 UT). Since TC-1 was earthward of Cluster, this\ntime sequence suggests that the substorm activity was\ninitiated closer to the Earth than the Cluster location. The\nonset time being earlier at TC-1 is unlikely caused by\nsubstorm activity spreading dawnward from the premidnight\nto midnight hours because both Los Alamos satellites\ndetected substorm injections nearly simultaneously. In fact,\nFigure 5. An enlarged timescale of observations at TC-1 to show the presence of plasma flow shear,\nflow burst along the magnetic field, and several magnetic field dipolarizations.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n7 of 17\nA07S26\nLANL-97 was furthest away from the midnight meridian\nthan both TC-1 and Cluster. This indicates that there was not\nmuch time delay in substorm disturbance from the near-\nmidnight MLT of LANL-91 to the premidnight MLT of\nLANL-97 and that the delay in Cluster is not due to local\ntime spreading of substorm disturbance.\n[17] Detailed timing analysis of the Bz increase among the\nfour Cluster satellites with the high-time resolution data\nindicates that C1 (RUMBA) and C4 (TANGO) lagged\nslightly behind C2 (SALSA) and C3. From their relative\npositions, one can conclude that the time delay for C1 is due\nto expansion in the positive Zgsm direction and the delay for\nC4 is due to tailward expansion along the Xgsm axis. Since\nthe satellites were north of the equatorial plane and the\nobserved Bx component was positive, the Zgsm expansion is\nconsistent with the Bz increase propagating away from the\nequatorial plane. The tailward Xgsm expansion is consistent\nwith the Bz increase propagating tailward, in agreement with\nthe increase in the Bz being observed earlier at TC-1.\n[18] It may be noted that the Bz component for TC-1 and\nCluster satellites was negative at the start of the interval\nshown. This is due to two factors. The first factor is the\nproximity of the satellites to the Earth that makes the\nmagnetic field orientation affected appreciably by\nFigure 6. (a–d) Plasma flow and magnetic field data from TC-1 to show the signature of flow shear and\nthe lack of association between dipolarization and earthward plasma flow; (e) vectors showing the\nresidual magnetic field perpendicular to the mean magnetic field direction to examine the field-aligned\ncurrents.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n8 of 17\nA07S26\nthe Earth’s dipole field. The second factor is the necking\ndown of the near-Earth plasma sheet during substorm\ngrowth and early expansion phases, causing the magnetic\nfield orientation dipping southward for satellites located\ntailward of the location where the plasma sheet is thinnest.\nHowever, the transient sharp decrease in the Bz component\nat TC-1 near \u00031041 UT cannot be explained by these two\nfactors and may be related to a late response of the previous\nsubstorm activity that started at about 0959 UT (see\nFigure 1).\n2.7. Geotail Observations\n[19] Geotail data during this period are given in Figure 10.\nGeotail was in the central plasma sheet at the start of the\nFigure 7. Plasma and magnetic field observations at the Cluster satellite (only C3 data shown). Plasma\nparameters are from CIS\/HIA [Re`me et al., 2001]. The magnetic field measurements are from FGM\n[Balogh et al., 2001].\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n9 of 17\nA07S26\ninterval. During the interval of \u00031035–1155 UT, the\nplasma density became low from plasma sheet thinning,\nindicative of plasma sheet boundary entry accompanied by a\nslight decrease in the magnetic field elevation angle. There\nwas a small increase in number density during \u00031107–\n1130 UT, corresponding to the time interval when the Bx\ncomponent was depressed in comparison with values at\nother times. The anisotropy of 67 keV energetic ions (which\nis a sensitive indicator of plasma flow) and the plasma flow\nwere small and mainly perpendicular to the magnetic field.\nA small but noticeable increase in the Vx component to\n>100 km\/s was observed late in the substorm recovery\nphase at \u00031157 UT. It was accompanied by a significant\nincrease in number density and noticeable decreases in the\nBx and Bz components indicative of reentry to the central\nplasma sheet. However, the recovered central plasma sheet\nFigure 8. An enlarged timescale of observations at Cluster satellite (only C3 data shown) to show the\noccurrence of a significant magnetic field dipolarization.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n10 of 17\nA07S26\nwas at a lower temperature than before expansion onset,\nindicated also by the low level of energetic ion flux.\n2.8. GOES-10 Observations\n[20] The magnetic field data from GOES-10 and Polar are\nshown in Figures 11a–11d. GOES-10, located at postmid-\nnight MLT, detected noticeable increases in the elevation\nangle of the magnetic field (Figure 11a) and the Bz compo-\nnent (Figure 11d) starting at \u00031044 UT. Further increases in\nthese field quantities occurred at \u00031053 UT, marked by the\nvertical dotted line, and was accompanied by a sharp\ndecrease in the Bx component. These changes indicate\nGOES-10 encountering an energetic particle population in\nassociation with dipolarization. A positive By perturbation\nwas associated with this encounter, suggesting that this\nmagnetic perturbation arises from crossing a pair of current\nsheets as GOES-10 encountered the energetic particle\npopulation. The sign of the By perturbation is indicative\nof the outer sheet carrying FAC down to the ionosphere and\nthe inner sheet carrying FAC up to the magnetosphere, as\nillustrated in Figure 12a. The current direction in the outer\ncurrent layer is consistent with the current direction for the\neastern portion of the substorm current wedge while the\ncurrent direction in the inner current layer is consistent with\nthe direction for a meridional closure of FAC. The existence\nof meridional closures of FAC associated with dipolariza-\ntion is also demonstrated recently by M. Volwerk et al.\n(Magnetotail dipolarization and associated current systems\nobserved by Cluster and Double Star, submitted to Journal\nof Geophysical Research, 2008) from the analysis of a\nsubstorm event with data from the Cluster and TC-1\nsatellites.\n2.9. Polar Observations\n[21] Polar magnetic field panels in Figures 11e–11g\nshow the difference between the observed magnetic field\nand the field values from the IGRF95 plus the magnetic\nfield model of Tsyganenko [1995]. The Bx component\nwithout subtraction of the magnetic field from the model\nwas positive, indicating that Polar was north of the\nequatorial plane (see also Figure 2b). There was an\noverall gradual increase in the Bz component relative to\nthe field model starting at \u00031038 UT. However, there\nwas no sharp decrease in the Bx component similar to the\nGOES-10 data that may be used as an indication for the\narrival of an energetic particle population. Nevertheless, if\none considers the decrease in the Bx component starting\nat \u00031049 UT as due to a more gradual effect from the\narrival of an energetic particle population, then the By\nperturbation was negative. Similar to the interpretation\ngiven for GOES-10, this change can be due to an\nencounter of a pair of current sheets, except that the\ncurrent directions are opposite, i.e., the outer current layer\nhas FAC directed from the ionosphere to the magneto-\nFigure 9. Comparison between TC-1 and Cluster measurements on the increase in the Bz component\nthat occurred nearly simultaneously with the substorm injections at the geosynchronous altitude. The\nrelative locations of the four Cluster satellites are also shown.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n11 of 17\nA07S26\nsphere (see Figure 12a). This current direction is consis-\ntent with the western portion of the substorm current\nwedge. The inner current layer is then a part of the\nmeridional closure of FAC at this western portion.\n2.10. Substorm Reconfiguration in the Near-Earth\nMagnetotail\n[22] One may construct the time evolution of magnetic\nfield configuration and plasma sheet boundary motion\nFigure 10. Geotail data from the Energetic particle and Ion Composition (EPIC) instrument [Williams\net al., 1994], Low Energy Particle (LEP) experiment [Mukai et al., 1994], Electric Field (EFD)\nexperiment [Tsuruda et al., 1994], and magnetic field (MGF) instrument for the substorm interval. The\nlabels T, Du, S, Da in the 67 keV ion anisotropy panel indicate tailward, duskward, sunward, and\ndawnward ion motions, respectively. The magnetic field elevation angle (Blat) is given in the bottom\npanel by the dashed trace.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n12 of 17\nA07S26\nduring this substorm based on the collective observations of\nthese satellites. Figure 12b shows schematic diagrams to\nillustrate this temporal development in four stages. The\nsatellite locations are not precise and only used to represent\ntheir positions relative to the plasma sheet boundary. Also,\nthey are not all in the same meridian plane. The arrows at\nGT, CL, and T1 denote the magnetic field orientations at\nthese locations. During the substorm growth phase\n(Figure 12b, top left), the plasma sheet boundary layer\n(PSBL) reaches TC-1 location but not Cluster location\ndue to plasma sheet thinning in the transition region. The\nmagnetic field elevation angles at both Cluster and TC-1 are\nFigure 11. Magnetic field measurements from GOES-10 and Polar satellites. The By perturbations from\nthese satellites suggest encountering of a pair of field-aligned current sheets. The directions of field-\naligned currents in the outer layers at postmidnight and premidnight local times are consistent with the\ndirections of field-aligned currents for the substorm current wedge.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n13 of 17\nA07S26\nslightly negative. Geotail approaches the PSBL during this\nphase. At substorm expansion onset (Figure 12b, top right),\nsubstorm injection reaches the geosynchronous altitude. The\nmagnetic field elevation angles at both TC-1 and Cluster\nincrease but that at Cluster remains negative. A slight\nincrease in magnetic field elevation angle occurs also at\nGeotail. Shortly after substorm onset (Figure 12b, bottom\nleft), plasma sheet thinning causes TC-1 to exit the PSBL\nwhile Cluster remains in the tail lobe. GOES-10 and Polar\ndetect the substorm current system consisting of both\nazimuthal closure (substorm current wedge system) and\nmeridional closure of FACs. Geotail remains in the low-\ndensity PSBL. Well into the substorm expansion phase\n(Figure 12b, bottom right), plasma sheet expansion reaches\nTC-1 and Cluster. A slight plasma sheet expansion indicated\nby a slight increase in the plasma density occurs at Geotail.\nGeotail reenters the central plasma sheet only in the late\nsubstorm recovery phase.\n3. Summary and Discussion\n3.1. Unique Multipoint Near-Earth Substorm\nObservations\n[23] We have examined one substorm event on 3 October\n2004 with conjunction of eleven satellites in the near-Earth\nmagnetotail (XGSM > \u000110 RE). In terms of usable data for\nanalysis, the conjunction consists of ten satellites, namely,\nfour Cluster satellites, one Double Star satellite, two\nLos Alamos geosynchronous satellites, Polar, GOES-10,\nand Geotail. This opportunity offers an excellent chance\nto examine closely the temporal sequence of substorm\nFigure 12. (a) A schematic diagram to illustrate the magnetic perturbations associated with a pair of\ncurrent sheets in the dawn and dusk portions of the near-Earth magnetotail. The solid arrows indicate the\nmagnetic perturbations. The circles with embedded dots and crosses represent field-aligned currents\nflowing out and into the plane, respectively. The size of the circles represents the current strength. The\ndotted arrow associated with each pair of current sheets indicates the path of the current sheets across the\nsatellite. (b) Schematic diagrams to illustrate the temporal evolution of the magnetic field configuration\nand plasma sheet boundary motion during this substorm projected on the XZ-plane. The satellite symbols\nPO, GT, CL, GO, and T1 denote Polar, Geotail, Cluster, GOES-10, and TC-1, respectively.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n14 of 17\nA07S26\ndisturbances in the near-Earth magnetotail and the relation-\nship between plasma flow bursts and magnetic field changes\nnear the transition region of magnetic field configuration\nfrom dipole to tail-like. To our knowledge, this report is the\nfirst example with so many satellites in the near-Earth\nnightside magnetosphere (XGSM > \u000110 RE) for a substorm\nstudy. The abundance of multipoint measurements from this\nfortuitous situation allows less ambiguity in determining the\nnear-Earth substorm features.\n3.2. Plasma Flow Shear in the Near-Earth Magnetotail\n[24] TC-1 observed a plasma flow shear signature during\nthis substorm interval. The plasma flow shear appears to be\nin the azimuthal direction. This plasma flow shear may be\nrelated to plasma flows (convection) being primarily tan-\ngential to an auroral arc as indicated by ground observations\nreported previously [e.g., Samson et al., 1996; Bristow et\nal., 2003]. An accelerated earthward ion beam along the\nmagnetic field occurred at the reversal of the plasma flow\nwithin this flow shear. Such substorm features in the near-\nEarth magnetosphere (XGSM > \u00016 RE) have never been\nreported before.\n3.3. Meridional Closure Current System\n[25] The dawn-dusk magnetic perturbations observed at\nGOES-10 and Polar are consistent with the coexistence of\nboth current types discussed by Bostro¨m [1964] for the\nsubstorm current system, i.e., the type 1 current system\ncommonly known as the substorm current wedge (azimuthal\nclosure of field-aligned currents) as well as the type 2\ncurrent system (meridional closure of field-aligned cur-\nrents). The existence of the type 2 current system in substorms\nhas been revealed by other satellite observations [Lopez et al.,\n1990; Volwerk et al., submitted reference, 2008], ground\nmagnetic observations [Kamide et al., 1994], SuperDarn con-\nvection observations [Liang et al., 2006], and particle simula-\ntion [Pritchett and Coroniti, 2002]. The dynamo associated\nwith the type 2 current system has also been discussed in\nterms of a plasma instability that can produce both type 1 and\ntype 2 current systems during substorms [Lui and Kamide,\n2003]. One unique aspect of the dawn-dusk magnetic\nperturbations reported here are the simultaneous observa-\ntions at both the dusk and dawn portions of the substorm\nactivity region. Such simultaneous observations in the\nmagnetosphere have not been reported before.\n3.4. Evidence of the Near-Earth Initiation Model\n[26] Analysis of observations in this event indicates that\nthis substorm was initiated close to the Earth, as sug-\ngested by the near-Earth initiation model for substorms.\nThis conclusion comes from the following consideration.\nSubstorm disturbances were observed nearly simulta-\nneously at the geosynchronous altitude over a wide local\ntime sector that covers the locations of TC-1 and Cluster\nsatellites. The substorm activity at TC-1 located earthward\nof Cluster and at nearly the same YGSM coordinate as\nCluster (<1 RE apart) observed the substorm activity\n(current disruption and dipolarization) earlier than Cluster\nby \u00031.5 min. This temporal sequence and the lack of\nearthward plasma flow associated with dipolarization\nstrongly indicate that the substorm disturbance was initi-\nated near the geosynchronous altitude and subsequently\nspread to further downstream distances, unconnected to\nplasma flow braking.\n[27] This result is consistent with some previous findings\nthat indicate dipolarization in the near-Earth magnetotail is\ncaused by a non-MHD process and is unrelated to magnetic\nflux pileup [e.g., Lui et al., 1999; Shiokawa et al., 2005;\nOhtani et al., 2006]. For this issue, it is important to note\nthat magnetic flux is carried by plasma flow in the MHD\napproach. This condition is the result of the frozen-in\ncondition in the MHD formulation. Therefore, if there is\nno plasma flow entering into a region, then there is no\nmagnetic flux carried into that region. For example, if\nplasma flow brakes before reaching that region, there will\nnot be any increase in magnetic flux there. In fact, if\ndipolarization occurs over a broad region in the magneto-\nsphere and plasma flows only occur in some narrow\nchannels, then the dipolarization cannot be accounted for\nby plasma flows from these narrow channels bringing\nmagnetic flux into the broad dipolarization region of the\nmagnetosphere. On the other hand, the current disruption\nmodel separates field disturbance from plasma flow since\ncurrent disruption is a non-MHD process. Therefore, dipo-\nlarization will propagate through the medium by waves.\nPlasma flow generally does not coincide with the wave\nvelocity. As a result, dipolarization does not necessarily link\nwith plasma flow occurrence even though current disruption\ncan lead to force imbalance and generate plasma flow.\n3.5. Inference From High-Latitude Magnetotail\nObservations\n[28] High-latitude magnetotail observations have been\nmodeled previously to infer the onset location of current\ndisruption and its subsequent tailward propagation during\nsubstorms [Jacquey et al., 1991, 1993; Ohtani et al., 1992].\nBoth Cluster and TC-1 were in the high-latitude magnetotail\nat the substorm onset time. The approach used in these\nprevious studies of high-latitude magnetotail can be applied\nto this event. At Cluster location, the Bx component started\nto decrease at 1048 UT, i.e., about 1.5 min before the onset\nof the Bz increase at Cluster. Since there was no significant\ndecrease of solar wind dynamic pressure at that time from\nthe Wind observation (with the solar wind propagation time\ntaken into account), the Bx decrease indicates that the\nenergy release related to current disruption started at\n1048 UT. The Bz increase indicates that the current disrup-\ntion front reached the downstream distance of the Cluster\nlocation about 1.5 min later. At TC-1, the dipolarization (Bz\nincrease) onset coincided with the substorm onset observed\nfrom the ground at 1048 UT. No decrease of Bx was\nobserved at TC-1 due to its exit to the tail lobe such that\nthe decrease in Bx from current reduction was masked by\nthe increase in Bx from entry to the tail lobe. This plasma\nsheet thinning is probably related to the associated inductive\nelectric field at substorms [e.g., Sauvaud et al., 1984]. The\nspatial separation between TC-1 and Cluster together with\nthe time delay of dipolarization onsets between these\nlocations gives a tailward propagation speed of dipolariza-\ntion at \u0003300 km\/s. This estimate is in very good agreement\nwith the speed inferred from previous studies [Jacquey et\nal., 1991, 1993; Ohtani et al., 1992].\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n15 of 17\nA07S26\n3.6. Other Potential Deficiencies in the Midtail\nInitiation Model\n[29] There is another relevant observation related to the\ndistinction between the midtail initiation model and the\nnear-Earth initiation model. From a summary of the ICS-5\nsession on the interpretation of auroral observations in terms\nof plasma sheet dynamics, Lui [2000] pointed out several\nsubstorm features that are difficult to explain by the midtail\ninitiation model. In particular, it is well known that multiple\nparallel auroral arcs are often seen from ground all-sky or\nTV cameras prior to a substorm onset and the breakup arc is\ntypically the most equatorward one. These detailed ground-\nbased observations with high spatial and intensity resolu-\ntions indicate that the parallel arcs poleward of the breakup\narc are undisturbed prior to onset. This poses the following\nproblem for the midtail initiation model. If the onset arc\nwere due to intrusion of plasma flow from the midtail, how\ncould the plasma flow skip disturbing the parallel auroral\narcs poleward of the onset arc since auroral arcs are\nrecognized to be on magnetic field lines close to the near-\nEarth region well earthward of the midtail region?\n[30] Another noteworthy point is that for the midtail\ninitiation model, substorm expansion in local time is mainly\nassociated with a dawn-dusk extension of the midtail\nmagnetic reconnection region. Under this scenario, dipola-\nrization in any local time would be associated with signif-\nicant earthward plasma flow and less significant azimuthal\nplasma flow. The TC-1 observation, however, shows the\nopposite characteristics, i.e., significant azimuthal plasma\nflow and almost negligible earthward plasma flow.\n[31] Acknowledgments. This work was supported in part by the NSF\ngrant ATM-0630912 and NASA grants NNG04G128G and NNX07AQ50G\nto the Johns Hopkins University Applied Physics Laboratory. ML and AG\nare supported by STFC grant PP\/E000983. We are grateful to the Interna-\ntional Space Science Institute in Bern, Switzerland, and its staff for their\nhospitality and financial support for the workshop.\n[32] Zuyin Pu thanks Christian Jacquey and another reviewer for their\nassistance in evaluating this paper.\nReferences\nAkasofu, S.-I. (1964), The development of the auroral substorm, Planet.\nSpace Sci., 12, 273–282, doi:10.1016\/0032-0633(64)90151-5.\nAngelopoulos, V., et al. (1996), Multipoint analysis of a bursty bulk flow\nevent on April 11, 1985, J. Geophys. Res., 101, 4967–4990, doi:10.1029\/\n95JA02722.\nBalogh, A., et al. (2001), The Cluster magnetic field investigation: over-\nview of in-flight performance and initial results, Ann. Geophys., 19,\n1207–1217.\nBirn, J., et al. (1999), Flow braking and the substorm current wedge,\nJ. Geophys. Res., 104, 19,895–19,903, doi:10.1029\/1999JA900173.\nBostro¨m, R. (1964), A model of the auroral electrojets, J. Geophys. Res.,\n69, 4983–4999, doi:10.1029\/JZ069i023p04983.\nBristow, W. A., et al. (2003), Detailed analysis of substorm observations\nusing SuperDARN, UVI, ground-based magnetometers, and all-sky im-\nagers, J. Geophys. Res., 108(A3), 1124, doi:10.1029\/2002JA009242.\nCheng, C. Z., and A. T. Y. Lui (1998), Kinetic ballooning instability\nfor substorm onset and current disruption observed by AMPTE\/CCE,\nGeophys. Res. Lett., 25, 4091–4094, doi:10.1029\/1998GL900093.\nDunlop, M. W., et al. (1988), Analysis of multipoint magnetometer data,\nAdv. Space Res., 8, 273–277, doi:10.1016\/0273-1177(88)90141-X.\nErickson, G. M. (1995), Substorm theories: United they stand, divided they\nfall, Rev. Geophys., 33, 685–692, doi:10.1029\/95RG00398.\nErickson, G. M., et al. (2000), Electromagnetics of substorm onsets in the\nnear-geosynchronous plasma sheet, J. Geophys. Res., 105, 25,265–\n25,290, doi:10.1029\/1999JA000424.\nHaerendel, G. (1992), Disruption, ballooning or auroral avalanche, in Pro-\nceedings of the First International Conference on Substorms, Kiruna,\nSweden, 23–27 March 1992, Eur. Space Agency Spec. Publ., ESA SP-\n335, 417.\nJacquey, C., J. A. Sauvaud, and J. Dandouras (1991), Location and propa-\ngation of the magnetotail current disruption during substorm expansion:\nAnalysis and simulation of an ISEE multi-onset event, Geophys. Res.\nLett., 18, 389–392, doi:10.1029\/90GL02789.\nJacquey, C., J. A. Sauvaud, J. Dandouras, and A. Korth (1993), Tailward\npropagating cross-tail current disruption and dynamics of near-Earth tail:\nA multi-point measurement analysis, Geophys. Res. Lett., 20, 983–986,\ndoi:10.1029\/93GL00072.\nJohnstone, A. D., et al. (1997), PEACE: A plasma electron and current\nexper iment , Space Sc i . Rev. , 79 , 351 – 398, doi :10.1023\/\nA:1004938001388.\nKamide, Y., et al. (1994), Ground-based studies of ionospheric convection\nassociated with substorm expansion, J. Geophys. Res., 99, 19,451–\n19,466, doi:10.1029\/94JA01625.\nLiang, J., G. J. Sofko, and H. U. Frey (2006), Postmidnight convection\ndynamics during substorm expansion phase, J. Geophys. Res., 111,\nA04205, doi:10.1029\/2005JA011483.\nLopez, R. E., and A. T. Y. Lui (1990), A multisatellite case study of the\nexpansion of a substorm current wedge in the near-Earth magnetotail,\nJ. Geophys. Res., 95, 8009–8018, doi:10.1029\/JA095iA06p08009.\nLopez, R. E., et al. (1990), Multipoint observations of a small substorm,\nJ. Geophys. Res., 95, 18,897–18,912, doi:10.1029\/JA095iA11p18897.\nLui, A. T. Y. (1991), A synthesis of magnetospheric substorm models,\nJ. Geophys. Res., 96, 1849–1856, doi:10.1029\/90JA02430.\nLui, A. T. Y. (1996), Current disruption in the Earth’s magnetosphere:\nObservations and models, J. Geophys. Res., 101, 13,067 – 13,088,\ndoi:10.1029\/96JA00079.\nLui, A. T. Y. (2000), Highlights on how to interpret auroral observation in\nterms of plasma sheet processes, in Proceedings of 5th International\nConference on Substorms, St. Petersburg, Russia, May 16–20, 2000,\nEur. Space Agency Spec. Publ., ESA SP 443, 231–234.\nLui, A. T. Y. (2006), Extraction of source location parameters from ob-\nserved particle velocity distribution, Geophys. Res. Lett., 33, L21108,\ndoi:10.1029\/2006GL027922.\nLui, A. T. Y., and Y. Kamide (2003), A fresh perspective of the substorm\ncurrent system and its dynamo, Geophys. Res. Lett., 30(18), 1958,\ndoi:10.1029\/2003GL017835.\nLui, A. T. Y., et al. (1988), A case study of magnetotail current sheet\ndisruption and diversion, Geophys. Res. Lett., 15, 721 – 724,\ndoi:10.1029\/GL015i007p00721.\nLui, A. T. Y., et al. (1999), Near-Earth dipolarization: Evidence for a non-\nMHD process, Geophys. Res. Lett., 26, 2905 – 2908, doi:10.1029\/\n1999GL003620.\nLui, A. T. Y., et al. (2000), Conjunction of tail satellites for substorm study:\nISTP event of 1997 January 2, Geophys. Res. Lett., 27, 1831–1834,\ndoi:10.1029\/1999GL010772.\nLui, A. T. Y., et al. (2007), Prelude to THEMIS tail conjunction, Ann.\nGeophys., 25, 1001–1009.\nMukai, T., et al. (1994), The low energy particle (LEP) experiment onboard\nthe GEOTAIL satellite, J. Geomagn. Geoelectr., 46, 669–692.\nNagai, T., et al. (1998), Structure and dynamics of magnetic reconnection\nfor substorm onsets with Geotail observations, J. Geophys. Res., 103,\n4419–4440, doi:10.1029\/97JA02190.\nNakamura, R., et al. (2001), Earthward flow bursts, auroral streamers, and\nsmall expansions, J. Geophys. Res., 106, 10,791–10,802, doi:10.1029\/\n2000JA000306.\nNakamura, R., et al. (2002), Motion of the dipolarization front during a\nflow burst event observed by Cluster, Geophys. Res. Lett., 29(20), 1942,\ndoi:10.1029\/2002GL015763.\nNakamura, R., et al. (2004), Spatial scale of high-speed flows in the plasma\nsheet observed by Cluster, Geophys. Res. Lett., 31, L09804, doi:10.1029\/\n2004GL019558.\nOhtani, S., K. Takahashi, and C. T. Russell (1992), Radial expansion of\nthe tail current disruption during substorms: A new approach to sub-\nstorm onset region, J. Geophys. Res., 97, 3129–3136, doi:10.1029\/\n91JA02470.\nOhtani, S., et al. (1998), AMPTE\/CCE - SCATHA simultaneous observa-\ntions of substorm-associated magnetic fluctuations, J. Geophys. Res.,\n103, 4671–4682, doi:10.1029\/97JA03239.\nOhtani, S., H. J. Singer, and T. Mukai (2006), Effects of the fast plasma\nsheet flow on the geosynchronous magnetic configuration: Geotail and\nGOES coordinated study, J. Geophys. Res., 111, A01204, doi:10.1029\/\n2005JA011383.\nPritchett, P. L., and F. V. Coroniti (2002), Consequences of current inter-\nruption for plasma sheet dynamics, J. Geophys. Res., 107(A9), 1254,\ndoi:10.1029\/2001JA009000.\nRe`me, H., et al. (2001), First multispacecraft ion measurements in and near\nthe Earth’s magnetosphere with the identical Cluster ion spectrometry\n(CIS) experiment, Ann. Geophys., 19, 1303–1354.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n16 of 17\nA07S26\nRoux, A., et al. (1991), Plasma sheet instability related to the westward\ntraveling surge, J. Geophys. Res., 96, 17,697–17,714, doi:10.1029\/\n91JA01106.\nSamson, J. C., et al. (1991), Observations of a detached discrete arc in\nassociation with field line resonances, J. Geophys. Res., 96, 15,683–\n15,695, doi:10.1029\/91JA00796.\nSamson, J. C., L. L. Cogger, and Q. Pao (1996), Observations of field line\nresonances, auroral arcs, and auroral vortex structures, J. Geophys. Res.,\n101, 17,373–17,383, doi:10.1029\/96JA01086.\nSauvaud, J. A., et al. (1984), A multisatellite study of the plasma sheet\ndynamics at substorm onset, J. Geophys. Res., 11, 500–503.\nSergeev, V. A., et al. (2005), Transition from substorm growth to substorm\nexpansion phase as observed with a radial configuration of ISTP and\nCluster spacecraft, Ann. Geophys., 23, 2183–2198.\nSergeev, V., et al. (2007), Observation of repeated intense near-Earth re-\nconnection on closed field lines with Cluster, Double Star, and other\nspacecraf t , Geophys. Res. Lett . , 34 , L02103, doi:10.1029\/\n2006GL028452.\nShiokawa, K., W. Baumjohann, and G. Haerendel (1997), Braking of high-\nspeed flows in the near-Earth tail, Geophys. Res. Lett., 24, 1179–1182,\ndoi:10.1029\/97GL01062.\nShiokawa, K., et al. (2005), Magnetic field fluctuations during substorm-\nassociated dipolarizations in the nightside plasma sheet around X = \u000110\nRE, J. Geophys. Res., 110, A05212, doi:10.1029\/2004JA010378.\nTsuruda, K., et al. (1994), Electric field measurements on Geotail satellite,\nJ. Geomagn. Geoelectr., 46, 693–711.\nTsyganenko, N. A. (1995), Modeling the Earth’s magnetospheric magnetic\nfield confined within a realistic magnetopause, J. Geophys. Res., 100,\n5599–5612, doi:10.1029\/94JA03193.\nVolwerk, M., et al. (1996), Solitary kinetic Alfve´n waves: A study of the\nPoynting flux, J. Geophys. Res., 101, 13,335–13,343, doi:10.1029\/\n96JA00166.\nWilliams, D. J., et al. (1994), GEOTAIL energetic particles and ion com-\nposition instrument, J. Geomagn. Geoelectr., 46, 39–57.\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\nI. V. Alexeev, A. N. Fazakerley, and A. P. Walsh, Mullard Space Science\nLaboratory, Holmbury St. Mary, Dorking, Surrey RH5 6NT, UK.\nM. W. Dunlop, Space Science and Technology Department, RAL,\nChilton, Didcot, Oxon OX11 0QX, UK.\nA. Grocott and M. Lester, Department of Physics and Astronomy,\nUniversity of Leicester, Leicester, LE1 7RH, UK.\nM. Henderson, Los Alamos National Laboratory, Los Alamos, NM\n87545, USA.\nL. M. Kistler and C. Mouikis, Space Science Center, University of New\nHampshire, Durham, NH 03824, USA.\nA. T. Y. Lui, Johns Hopkins University Applied Physics Laboratory,\nLaurel, MD 20723, USA.\nH. Re`me, CESR\/CNRS, F-31028 Toulouse, France.\nC. Shen and J. K. Shi, Center for Space Science and Applied Research,\nChinese Academy of Sciences, Beijing 10080, China.\nM. Volwerk and T. L. Zhang, Space Research Institute, Austrian\nAcademy of Sciences, A-8042, Graz, Austria.\nA07S26 LUI ET AL.: NEAR-EARTH SUBSTORM FEATURES\n17 of 17\nA07S26\n"}