{"doi":"10.1080\/0968776980060115","coreId":"14297","oai":"oai:generic.eprints.org:267\/core5","identifiers":["oai:generic.eprints.org:267\/core5","10.1080\/0968776980060115"],"title":"Coleridge: A computer tool for assisting musical reflection and self‐explanation","authors":["Cook, John","Morgan, Nigel"],"enrichments":{"references":[{"id":1043223,"title":"Coleridge: a computer tool for assisting musical reflection and self-explanation","authors":[],"date":"1995","doi":"10.1080\/0968776980060115","raw":"107John Cook and Nigel Morgan Coleridge: a computer tool for assisting musical reflection and self-explanation Morgan, N. and Tolonen, P. (1995), Symbolic Composer Professional (software application for Apple Macintosh computers), Amsterdam: Tonality Systems.","cites":null},{"id":1043220,"title":"Eliciting self-explanations improves understanding',","authors":[],"date":"1994","doi":"10.1207\/s15516709cog1803_3","raw":"Chi, M., de Leeuw, N., Chiu, M.-H. and LaVancher, C. (1994), 'Eliciting self-explanations improves understanding', Cognitive Science, 18, 439-77.","cites":null},{"id":1043221,"title":"Mentoring, metacognition and music: an analysis of the interactions used to support creative reflection' in","authors":[],"date":"1997","doi":null,"raw":"Cook, J. (1997), 'Mentoring, metacognition and music: an analysis of the interactions used to support creative reflection' in Du Boulay, B. and Mizoguchi, R. (eds), Artificial Intelligence in Education: Knowledge and Media in Learning Systems. Proceedings of AI-ED 97 World Conference on Artificial Intelligence in Education, Kobe, Japan, Amsterdam: IOS Press, 271-8.","cites":null},{"id":199885,"title":"Metacognition, executive control, self-regulation, and other mysterious mechanisms'","authors":[],"date":"1987","doi":null,"raw":"Brown, A. (1987), 'Metacognition, executive control, self-regulation, and other mysterious mechanisms' in Weinert, F. and Kluwe, R. (eds), Metacognition, Motivation, and Understanding, Hillsdale, NJ: Lawrence Erlbaum, 65-116.","cites":null},{"id":1043224,"title":"The Musical Mind: The Cognitive Psychology of Music,","authors":[],"date":"1985","doi":"10.2307\/1578337","raw":"Sloboda, J. (1985), The Musical Mind: The Cognitive Psychology of Music, Oxford: OUR","cites":null},{"id":1043222,"title":"Thinking in Education,","authors":[],"date":"1991","doi":"10.1017\/cbo9780511840272","raw":"Lipman, M. (1991), Thinking in Education, Cambridge: CUP.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1998","abstract":"This paper examines some of the problems involved when learning how to compose music. A prototype computer‐based music tool called Coleridge is described. Coleridge was used in a study that investigated the dialogues that took place when a mentor attempted to encourage creative reflection in students. Results of dialogue analysis suggested that because learners seem unable to make accurate predictions about how a musical phrase will sound, there is a real need for a computer‐based learning assistant. Finally, the paper reports on how these findings were used to motivate the design of a mentor's assistant in a new version of Coleridge","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14297.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/267\/1\/ALT_J_Vol6_No1_1998_Coleridge_%20A%20computer%20tool%20for.pdf","pdfHashValue":"64ced8b3811f18a6d2a3977a8bfca22e88997b2e","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:267<\/identifier><datestamp>\n      2011-04-04T09:19:41Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/267\/<\/dc:relation><dc:title>\n        Coleridge: A computer tool for assisting musical reflection and self‐explanation<\/dc:title><dc:creator>\n        Cook, John<\/dc:creator><dc:creator>\n        Morgan, Nigel<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        This paper examines some of the problems involved when learning how to compose music. A prototype computer‐based music tool called Coleridge is described. Coleridge was used in a study that investigated the dialogues that took place when a mentor attempted to encourage creative reflection in students. Results of dialogue analysis suggested that because learners seem unable to make accurate predictions about how a musical phrase will sound, there is a real need for a computer‐based learning assistant. Finally, the paper reports on how these findings were used to motivate the design of a mentor's assistant in a new version of Coleridge.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        1998<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/267\/1\/ALT_J_Vol6_No1_1998_Coleridge_%20A%20computer%20tool%20for.pdf<\/dc:identifier><dc:identifier>\n          Cook, John and Morgan, Nigel  (1998) Coleridge: A computer tool for assisting musical reflection and self‐explanation.  Association for Learning Technology Journal, 6 (1).  pp. 102-108.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776980060115<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/267\/","10.1080\/0968776980060115"],"year":1998,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Coleridge: a computer tool for assisting musical\nreflection and self-explanation\nJohn Cook* and Nigel Morgan**\n*University Centre for Complementary LearningThames Valley University\n**Department of Music, Bretton Hall University College\nThis paper examines some of the problems involved when learning how to compose music. A prototype\ncomputer-based music tool called Coleridge is described. Coleridge was used in a study that investigated\nthe dialogues that took place when a mentor attempted to encourage creative reflection in students.\nResults of dialogue analysis suggested that because learners seem unable to make accurate predictions\nabout how a musical phrase will sound, there is a real need for a computer-based learning assistant.\nFinally, the paper reports on how these findings were used to motivate the design of a mentor's assistant\nin a new version of Coleridge.\nIntroduction\nSince the mid-1980s, there has been a movement away from knowledge supplied by the\nteacher and towards talking, reflecting and explaining as ways to learn. An example of this\nchange in focus is provided by the self-explanation work of Chi et al (1994) who describe\nan approach to talking science rather than hearing science. According to Chi and co-\nworkers, generating explanations to oneself (self-explanations) facilitates the integration of\nnew information into existing knowledge. Reflecting about one's own learning is the same\nas thinking about learning or metacognition. Metacognition can be defined as the\nunderstanding of knowledge, an understanding that can be reflected in either effective use\nor overt description of the knowledge in question (Brown, 1987). This definition of\nmetacognition requires of a learner both internalized thinking about learning (that is,\nreflection), and externalized communication, through language or action, that indicates an\nunderstanding of knowledge (that is, a self-explanation). In the work described in this\npaper the overall pedagogical goal is to encourage creative reflection in learners. Creative\nreflection is defined as the ability of a learner to imagine musical opportunities in novel\nsituations, and then to make accurate predictions (verbally) about these opportunities. To\nsucceed at creative reflection there should be a correspondence between what a learner\npredicts will happen and what actually happens. An example would be a learner first\nwriting a musical phrase using musical notation, then predicting verbally how that phrase\nwill sound, playing the phrase back on a piano, and finally evaluating if the prediction was\n102\nALT-J Vo\/ume 6 Number I\naccurate or not. Very little work has been done on how computers can be used to support\ntalking, reflecting and explaining in the creative subject-area of musical composition. The\nrest of this paper addresses this issue.\nThe problem of learning how to compose music\nThis section examines two aspects of the problem of thinking about how to compose\nmusic.\n1. There is thinking that reflects upon creative intention and execution (creative thinking).\n2. There is thinking in the monitoring of intention and execution (critical thinking) that\nreflects upon philosophical areas (meaning, experience, possibilities, aesthetic relation-\nships).\nCreative thinking in music composition has been challenged by the widespread use of\nsequencers (software recorders of performance data). These enable musical material to be\nassembled layer by layer. A playing, listening, editing process ensues, relieving the\ncomposer of the need to memorize and internalize successively imagined vertical position-\ning of musical material. Traditionally, however, the craft of music composition has always\nrequired the development of memory, reflection, critical review and analysis, all skills that\nfocus on the higher-order patterning of musical material.\nIt is the perception of the authors of this paper that the current training of composers in\nhigher education seems now beleaguered by a very contemporary problem: how to\nencourage and promote creative reflection in a culture where technology appears to\nprovide a side-step for the disciplines of higher-order thinking. We also see musical\nformalism (Landy, 1997) itself being challenged by a more direct relationship with sound\nmaking, design and control. This puts the creation of performance directly in the hands of\nthe composer; eschewing any need for the written musical score from which formal\nabstractions and the glue of syntax can be identified and reflected upon.\nCritical thinking in the act of music composition is usually embedded in the further\nreflection (monitoring) after execution. It must deal with judgement, enable self-\ncorrection, and be sensitive to context. The strong element of intuitive action present in the\nprocess of composition (Sloboda, 1986) is invariably followed or accompanied by a\nmonitoring activity. This focuses on either the sound itself being replayed in real time or on\na formalism that becomes apparent from a kind of fast visual scanning in which the\ncomposer imagines rather than physically hears the music happen.\nIf we examine one aspect of critical thinking, we find that in music, meaning (for example)\nhas to be built up successively. Centuries of composers' hand-written sketches show how\nthey accrue representations of musical meaning using strategies that act on musical ideas\nin a cumulative and evolving fashion, and play with ambiguity, while keeping resolutions\non decision-making on hold for long as possible. This is elegantly demonstrated in the\nsketchbooks of Beethoven and Stravinsky.\nFor the poet (and the reader), however, meaning is established almost instantaneously, as\nthe words hit the page. And, as thinking in a creative writing class is perpetually bound to\nreading, speaking and writing (Lipman, 1991), the student writer becomes practised in\n103\nJohn Cook and Nigel Morgan Coleridge: a computer tool for assisting musical reflection and self-explanation\nengaging in both descriptive dialogues, reflective thinking and explanation. The meaning\nof words is normally associated with usage; rarely can a word have meaning on its own.\nThe same is true for any musical parameter, for example the single note. But, an aggregate\nof notes, like a syntactical arrangement of words, can be said to have meaning by virtue of\ncausal and contextual relationships. Regrettably, musicians are rarely trained to talk,\nreflect upon or explain such views of meaning without resorting to the formidable tools of\nmusical analysis that are usually devoid of philosophical content.\nPrototype of Coleridge\nThe system developed for and used in the study described below was a prototype called\nColeridge (see Figure 1 for an annotated screen shot).\nFile Edit Eual Windows Folders\nColeridge transposition window\nTransposition-I {...attern:Transposition;>\nI; use this device to generate^* sequence of your chosen\nI; pattern occuring at different pitch positions. By\ncreating a list of transposition numbers in relation\nitlon (Talne 0) a irasical phrase or section\n• he pr<\n| ;; hasic material\n(aale material '(a i )!))•\n(•axe note-length '(1\/16))\n(male dynamics '(96 64 72 84))\n(male tonality (activate-tonality (chromatic c 5)))\n(dei-tempo •**\n; Here's an example. Compile and Play tUDI.\n(male my-study-vith\n'(0 -7 -12 -2 0 -2 0 5 12 7 -5 0))\nCompiles a\n. phrase ready for\nplayback\nMusical\npattern as a list\nList of\ntransposition\nvalues; nov replace the values in the example ffith your ovn\nPhrase\nplayback\ncontrol\npalette\nFigure I: Annotated screen-shot of prototype Coleridge system used in the study.\nThe prototype Coleridge was designed to provide a single-step, fast-action playback of\nmusical ideas. This would, we predicted, enable descriptive talk (that is, verbal\nrepresentations of meaning) as well as reflective thought (self-monitoring) and explanation\n(accurate predictions plus more self-monitoring) to take place.\nColeridge was implemented in a Common Lisp-based music composition language called\nSymbolic Composer (Morgan and Tolonen, 1995). The prototype version of Coleridge was\na constrained environment in that it dealt with only one small aspect of musical\n104\nALT-] Volume 6 Number I\ncomposition (the transformation of a musical pattern into a phrase or section). The\ntechnique used in Coleridge for transposing an initial pattern (for example, C C# F# G) is\nsimply to use a transposition number (which represent semi-tone steps, i.e. pitch trans-\nposition). By creating a list of transposition numbers in relation to a base position (value\n0), a musical phrase or section may be produced. Zero will just simply give a repetition of\nthe pattern (C C# F# G), -7 gives a transposed-down repetition of the pattern (in this\nexample FF\/BC).\nStudy of musical reflecting and explaining\nThe study took place in November 1996 using the prototype Coleridge described above.\nThe study involved individual students discussing with a teacher-mentor (one of the\nauthors of this paper) their attempts at creative reflection. The aim of the study was to\nanswer the following research question: what are the interactive means by which a music-\ncomposition teacher stimulates creative reflection? For full details of the study and the\ndialogue analysis approach, which was based on goal hierarchies and updated speech-act\ntheory, readers are encouraged to consult Cook (1997). Briefly, interactions were captured\non video and transcriptions of the sessions were then analysed for occurrences of subgoals\nthat relate to creative reflection. Scores for each subgoal were then generated.\nResults from the analysis showed that students did not seem able to make accurate\npredictions, in spite of mentor support and a computer tool design to assist this process.\nStudents did make some attempts at making a prediction, but only one out of four learners\nmet with success in terms of accuracy. Other results showed that some internalized\nreflection in the form of self-monitoring took place.\nThe dialogue analysis approach recognized two self-monitoring subgoals. Monitoring-\nevaluate was dialogue that involved some evaluative comment by the learner about the\nmatch between a prediction and an outcome. Monitoring-diagnose was an attempt by the\nlearner to diagnose why something did or did not work. This finding is encouraging in that\nmentoring and Coleridge seemed to promote the monitoring effect, which we would claim\nis the first step towards creative reflection, and in particular the ability to make accurate\npredictions. If the students in the study had been allowed to take a second session, we\nwould estimate that the score for making an accurate prediction would increase. The ability\nto make an accurate prediction is clearly difficult and may require repeated practice and\nguidance. However, in a post-experimental interview the mentor did point out that\n'meeting this learning need may be a task that a human may have trouble providing\njustification for in the UK's busy curriculum'. It is therefore claimed that there is a real\nlearning need for a computer-based mentor's assistant for Coleridge.\nA solution: the mentor's assistant\nThis section describes the changes made to Coleridge (the new version is shown in Figure\n2) in an attempt to act on the findings of the study described above. From a learner's\nperspective, Coleridge has been designed to assist independent practice in creative\nreflection. For the mentor, the computer tool is intended to be used as an assistant that\npromotes in learners the self-monitoring effect.\nTo enhance practice at creative reflection, Coleridge now offers student and mentor\nI OS\nJohn Cook ond Nigel Morgan Coleridge: a computer tool for assisting musical reflection and self-explanation\nFile Edit Lisp Tools Windows\nMentor's Assistant\nEnter list\n[Click to play]\nEnter a list\nliTupe list hirtl\nTransform-1 repeat\nTransform-2 transpose\nTransfnrm-3 dynamic\nfigure 2: Coleridge with new interface and increased functionality.\nopportunities to develop cumulative transformations (that is, several alterations) and\nparametric additions (for example, add some dynamics) to an initial phrase. Thus, if the\nlearner clicks on the Enter list button shown in Figure 2, a dialogue box appears asking the\nlearner to enter a list and to Return it (top-right of Figure 2). Only this, the first dialogue\nbox, remains on the screen (learners are being encouraged to memorize the changes they\nmake to a phrase). A good starting point would be to enter five zeros, return it, then to use\nthe Click to play button to hear the start-up motive (C C# F# G) repeated five times. This\nflat phrase can be developed by selecting the Transform-1 pop-up menu.\nThe learner is then presented with a list of what we call modifying processors. Modifying\nprocessors are the parameters available to a composer. The learner can select from eight\nmodifying processors: dynamics, repeat, transposition, making pauses, hocketing, making\nvariants (shuffle, reverse, rotate), octave displacements, and changing rhythm. In Figure 2,\nthe learner has selected 'repeat', and will have been asked by a dialogue box to enter a\nrepeat list. Repeat works as follows: 4 repeats the whole motive, 3 repeats only the first\nthree notes leaving a pause for the fourth note, and so on down to 0 which leaves a pause\nwhere the four notes should have been played. Coleridge will then prompt the learner to\npredict verbally (to themselves or to another student) how the phrase will sound when it is\n106\nALT-] Volume 6 Number I\nplayed back. By using the Click to play button, the learner can then hear what the musical\nphrase sounds like with the first transformation applied.\nA few seconds after playback, Coleridge will prompt the learner verbally to self-monitor\ntheir attempts at creative reflection (a message - Was that what you expected? - is\ndisplayed). If the Transform-2 pop-up menu is then selected, the learner will be offered the\nsame list of eight modifying processors. The big difference here is that once a selection is\nmade and data is entered via a dialogue box, the modification processor acts on the output\nfrom Transform-1 (i.e. it is a parametric addition). For example, in Figure 2 the learner has'\nselected to transpose the output from modifying process Transform-1 (that is, repeat). The\noutput from Transform-2 can then be used as an input to Transform-3 to build up a phrase\nthat makes use of three different modifying processes. Each time learners input a data list\nfor a modifying process, they are encouraged to make a verbal prediction, and, following\nplayback, verbally to self-monitor.\nThese three modification processes (Transform 1, 2 and 3) produce an engaging musical\nresult, and one much closer to the composing of a musical phrase as might be part of the\nexperience of a composer. Furthermore, we claim that with the addition of these modifiers\nand prompts for verbal predictions and self-monitoring, Coleridge has become a powerful\nand useful tool for student and mentor alike to progress talking, reflecting and explaining.\nFuture work\nFuture work will examine how to introduce some level of interaction with a collection of\nphilosophical strands (Lipman, 1991), for example relating (music) to experience, art and\ncraft, and aesthetical relationships. This should further promote the development of\ncreative and critical thinking, and hence support directly the challenging aspects of\nmentoring.\nAcknowledgements\nThanks to Michael Baker and Theresa Kinnison for their help with this paper.\nReferences\nBrown, A. (1987), 'Metacognition, executive control, self-regulation, and other mysterious\nmechanisms' in Weinert, F. and Kluwe, R. (eds), Metacognition, Motivation, and Under-\nstanding, Hillsdale, NJ: Lawrence Erlbaum, 65-116.\nChi, M., de Leeuw, N., Chiu, M.-H. and LaVancher, C. (1994), 'Eliciting self-explanations\nimproves understanding', Cognitive Science, 18, 439-77.\nCook, J. (1997), 'Mentoring, metacognition and music: an analysis of the interactions used\nto support creative reflection' in Du Boulay, B. and Mizoguchi, R. (eds), Artificial\nIntelligence in Education: Knowledge and Media in Learning Systems. Proceedings of AI-ED\n97 World Conference on Artificial Intelligence in Education, Kobe, Japan, Amsterdam: IOS\nPress, 271-8.\nLandy, L. (1997), 'Editorial', Organised Sound, 2 (1), 1-3.\nLipman, M. (1991), Thinking in Education, Cambridge: CUP.\n107\nJohn Cook and Nigel Morgan Coleridge: a computer tool for assisting musical reflection and self-explanation\nMorgan, N. and Tolonen, P. (1995), Symbolic Composer Professional (software application\nfor Apple Macintosh computers), Amsterdam: Tonality Systems.\nSloboda, J. (1985), The Musical Mind: The Cognitive Psychology of Music, Oxford: OUR\n108\n"}