{"doi":"10.1080\/0968776000080306","coreId":"14252","oai":"oai:generic.eprints.org:341\/core5","identifiers":["oai:generic.eprints.org:341\/core5","10.1080\/0968776000080306"],"title":"Teaching new media composition studies in a lifelong learning context","authors":["Jameson, Jill","Squires, David"],"enrichments":{"references":[{"id":198641,"title":"Adaptive Navigational Tools for Educational Hypermedia, Computer Assisted Learning:","authors":[],"date":"1992","doi":"10.1007\/3-540-55578-1_99","raw":"de la Passardiere, B. and Dufresne, A. (1992), Adaptive Navigational Tools for Educational Hypermedia, Computer Assisted Learning: Proceedings of the 4th International Conference, ICCAL '92, Wolfville, Novia Scotia, Canada, Berlin\/Heidelberg: SpringerVerlag.","cites":null},{"id":452668,"title":"An account of writing as creative design',","authors":[],"date":"1996","doi":null,"raw":"Sharpies, M. (1996), 'An account of writing as creative design', in C. M. Levy, and S. Ransdell (eds.), The Science of Writing: Theories, Methods, Individual Differences, and Applications, Mahwah, New Jersey: Lawrence Erlbaum Associates Inc.","cites":null},{"id":198637,"title":"Aporia: Webs, passages, getting lost, and learning to go on',","authors":[],"date":"1997","doi":null,"raw":"Burbules, N. C. (1997), 'Aporia: Webs, passages, getting lost, and learning to go on', Philosophy of Education.","cites":null},{"id":1043037,"title":"Authors of knowledge: patterns of hypermedia design',","authors":[],"date":"1993","doi":null,"raw":"Lehrer, R. (1993), 'Authors of knowledge: patterns of hypermedia design', in S. P. Lajoie and S. J. Derry (eds.), Computers as Cognitive Tools, Hillsdale, New Jersey: Lawrence Erlbaum Associates, Inc., 197-227.","cites":null},{"id":452671,"title":"Can multimedia support constructivist learning?',","authors":[],"date":"1997","doi":null,"raw":"Squires, D. (1997), 'Can multimedia support constructivist learning?', Teaching Review, 4 (2), 10-17.","cites":null},{"id":198644,"title":"Cognitive Models for Structuring Hypermedia and Implications for Learning from the World-Wide Web,","authors":[],"date":"1995","doi":null,"raw":"Eklund, J. (1995), Cognitive Models for Structuring Hypermedia and Implications for Learning from the World-Wide Web, AusWeb95, Australia, Southern Cross University.","cites":null},{"id":452665,"title":"Hypermedia in education - monitoring the development of hypermedia documents',","authors":[],"date":"1995","doi":null,"raw":"Pohl, M., Prenner, P. and Purgathofer, P. (1995), 'Hypermedia in education - monitoring the development of hypermedia documents', The Journal of the British Psychological Society's Special Group for the Teaching of Psychology, 4 (2), 142-52.","cites":null},{"id":1043036,"title":"Hypertext 2.0: The Convergence of Contemporary Critical Theory and Technology,","authors":[],"date":"1997","doi":"10.2307\/1347143","raw":"Landow, G. P. (1997), Hypertext 2.0: The Convergence of Contemporary Critical Theory and Technology, Baltimore, Maryland: The John Hopkins University Press.","cites":null},{"id":198640,"title":"Hypertext: an introduction and survey',","authors":[],"date":"1987","doi":"10.1109\/mc.1987.1663693","raw":"Conklin, J. (1987), 'Hypertext: an introduction and survey', Computer 20 (9), 17-41.","cites":null},{"id":452667,"title":"Learning technologies and the lifelong learner: armament or disarmament?',","authors":[],"date":"1999","doi":"10.3402\/rlt.v7i1.11242","raw":"Seale, J. (1999), 'Learning technologies and the lifelong learner: armament or disarmament?', ALT J, 7 (2), 61-7.","cites":null},{"id":452664,"title":"Man's Rage for Chaos: Biology, Behaviour and the Arts,","authors":[],"date":"1967","doi":null,"raw":"Peckham, M. (1967), Man's Rage for Chaos: Biology, Behaviour and the Arts, New York: Schocken.","cites":null},{"id":1043039,"title":"Multimedia and Hypertext: The Internet and Beyond,","authors":[],"date":"1995","doi":"10.1007\/978-3-322-86834-3_4","raw":"54ALT-] Volume 8 Number 3 Nielsen, J. (1995), Multimedia and Hypertext: The Internet and Beyond, London: AP Professional\/Academic Press, Inc.","cites":null},{"id":452670,"title":"New literacies in theory and practice: what are the implications for language in education?',","authors":[],"date":"1998","doi":"10.1016\/s0898-5898(99)80103-x","raw":"Street, B. (1998), 'New literacies in theory and practice: what are the implications for language in education?', Linguistics and Education, 10 (1), 1-24.","cites":null},{"id":452669,"title":"Non Parametric Statistics for the Behavioural Sciences (second edition),","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":1881077,"title":"Non Parametric Statistics for the Behavioural Sciences (second edition), Singapore:","authors":[],"date":"1988","doi":null,"raw":"Seigal, S. and Castellan, N. I, Jr. (1988), Non Parametric Statistics for the Behavioural Sciences (second edition), Singapore: McGraw-Hill Book Co.","cites":null},{"id":198642,"title":"On the Line,","authors":[],"date":"1983","doi":null,"raw":"Deleuze, G. and Guattarri, F. (1983), On the Line, New York: Semiotexte.","cites":null},{"id":452877,"title":"Organising information in mosaic: a classroom experiment',","authors":[],"date":"1994","doi":"10.1016\/0169-7552(95)00111-5","raw":"Wray, R. E. I., Chong, R., Phillips, J., Rogers, S., Walsh, W. and Laird, J. (1994), 'Organising information in mosaic: a classroom experiment', SDG\/IT 94.","cites":null},{"id":452666,"title":"Partners in cognition: extending human intelligence with intelligent technologies',","authors":[],"date":"1991","doi":"10.3102\/0013189x020003002","raw":"Salomon, G., Perkins, D. N. and Globerson, T. (1991), 'Partners in cognition: extending human intelligence with intelligent technologies', Educational Researcher, 20 (3), 2-9.","cites":null},{"id":198645,"title":"Play, Shepton Mallet: Fontana\/Open Books Original,","authors":[],"date":"1982","doi":null,"raw":"Garvey, C. (1982), Play, Shepton Mallet: Fontana\/Open Books Original, Open Books Publishing Ltd.","cites":null},{"id":1043035,"title":"Popular fallacies about hypertext',","authors":[],"date":"1989","doi":"10.1007\/978-3-642-75945-1_3","raw":"Landow, G. P. (1989), 'Popular fallacies about hypertext', in D. H. Jonassen and H. Mandl (eds.), Designing Hypermedia for Learning, Berlin: Springer-Verlag, 39-60.","cites":null},{"id":1043034,"title":"Reading Images: The Grammar of Visual Design,","authors":[],"date":"1996","doi":"10.1075\/fol.3.2.15vel","raw":"Kress, G. and van Leeuwen, T. (1996) Reading Images: The Grammar of Visual Design, London: Routledge.","cites":null},{"id":1043038,"title":"Signposts for conceptual orientation: some requirements for learning from hypertext',","authors":[],"date":"1990","doi":"10.1007\/978-3-642-75945-1_13","raw":"Mayes, T., Kibby, M. and Anderson, T. (1990), 'Signposts for conceptual orientation: some requirements for learning from hypertext', in R. MacAleese and C. Green (eds.), Hypertext: State of the Art, Oxford, Intellect Limited, 121-9.","cites":null},{"id":452673,"title":"Students as hypermedia authors: themes emerging from a qualitative study',","authors":[],"date":"1992","doi":null,"raw":"Turner, S. V., and Dipinto, V. M. (1992), 'Students as hypermedia authors: themes emerging from a qualitative study', Journal of Research in Computer Education, 25, 187-99.","cites":null},{"id":1043031,"title":"Students as multimedia composers',","authors":[],"date":"1994","doi":"10.1016\/0360-1315(94)90019-1","raw":"Hay, K. E., Guzdial, M., Jackson, S., Boyle, R. A. and Soloway, E. (1994), 'Students as multimedia composers', Computers in Education 23 (4), 301-17.","cites":null},{"id":1881041,"title":"Teaching new media composition studies in a lifelong learning context DfEE","authors":[],"date":"1999","doi":"10.3402\/rlt.v8i3.12004","raw":"S3Jill Jameson and David Squires Teaching new media composition studies in a lifelong learning context DfEE (1999), Learning to Succeed: A New Framework for Post-16 Learning, London: The Stationery Office Dubowski, Y. and Orion, N. (1998), Evaluating the Educational Potential of Multimedia Authoring within the Framework of an Earth Science Curriculum - A Case Study, National Association of Research in Science Teaching (NARST), San Diego, Weizmann Institute of Science, Rehovoth, Israel.","cites":null},{"id":198639,"title":"The Act of Writing: A Media Theory Approach,","authors":[],"date":"1995","doi":null,"raw":"Chandler, D. (1995), The Act of Writing: A Media Theory Approach, Aberystwyth: University of Wales, Aberystwyth.","cites":null},{"id":1043033,"title":"The Design of Guided Learner-adaptable Scaffolding in Interactive Learning Environments,","authors":[],"date":"1998","doi":"10.1145\/274644.274672","raw":"Jackson, S. L., Krajcik, J. and Soloway, E. (1998), The Design of Guided Learner-adaptable Scaffolding in Interactive Learning Environments, CHI98, Ann Arbor, MI 48109, USA, College of Engineering, School of Education, School of Information, University of Michigan.","cites":null},{"id":1043030,"title":"The foundations and assumptions of technologyenhanced student-centred learning environments',","authors":[],"date":"1997","doi":null,"raw":"Hannafin, M. J. and Land, S. M. (1997), 'The foundations and assumptions of technologyenhanced student-centred learning environments', Instructional Science, 25, 167-202.","cites":null},{"id":452876,"title":"The Invention List:","authors":[],"date":"1999","doi":null,"raw":"Ulmer, G. (1999), The Invention List: Website for Newsgroup University of Florida, http: \/\/web.elf.edu\/~gulmer\/.","cites":null},{"id":1881039,"title":"The Learning Age,","authors":[],"date":"1998","doi":null,"raw":"DfEE (1998), The Learning Age, London: DfEE.","cites":null},{"id":198643,"title":"The Learning Age, London: DfEE. S3 Jill Jameson and David Squires Teaching new media composition studies in a lifelong learning context DfEE","authors":[],"date":"1998","doi":"10.3402\/rlt.v8i3.12004","raw":null,"cites":null},{"id":198636,"title":"The Psychology of Written Composition,","authors":[],"date":"1987","doi":"10.2307\/327270","raw":"Bereiter, C. and Scardamalia, M. (1987), The Psychology of Written Composition, New Jersey: Lawrence Erlbaum Associates Inc.","cites":null},{"id":198638,"title":"The rhetoric of hypertext',","authors":[],"date":"1990","doi":null,"raw":"Carlson, P. A. (1990), 'The rhetoric of hypertext', Hypermedia, 2 (2), 109-31.","cites":null},{"id":1043032,"title":"The Skills Agenda: Issues for Post-16 Providers, FEDA Comments Series, London: Further Education Development Agency","authors":[],"date":"2000","doi":null,"raw":"Hughes, M. and Mager, C. (2000), The Skills Agenda: Issues for Post-16 Providers, FEDA Comments Series, London: Further Education Development Agency (FEDA) Publications.","cites":null},{"id":452672,"title":"Word Perfect: Literacy in the Computer Age, Pittsburgh Series in Composition, Literacy","authors":[],"date":"1992","doi":"10.1177\/027046769301300424","raw":"Tuman, M. C. (1992), Word Perfect: Literacy in the Computer Age, Pittsburgh Series in Composition, Literacy and Culture, D. Bartholomae and J. Ferguson Carr (eds.), Pittsburgh, Pa: University of Pittsburgh Press Turner, S. T. and Dipinto, V. M. (1997), 'Peer collaboration in a hypermedia learning environment', Journal of Research on Computing in Education, 28 (5).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2000","abstract":"Governmental proposals for lifelong learning, and the role of Information and Learning Technologies\/Information Communication Technologies (ILT\/ICT) in this, idealistically proclaim that ILT\/ICT empowers learners. A number of important governmental funding initiatives have recently been extended to the development of ILT in further education, which provides a particularly appropriate environment for lifelong learning. Yet little emphasis is given to more problematic research findings that students may be ‘disarmed’ in the process of learning to use technology. In the current global shift towards new forms of multimedia literacy, it is important to recognize human diversity by carrying out research focusing on the actual problems students face in adapting to Web‐based technology as a new authoring medium. A case study into multimedia creative composition carried out with FE students in 1996–9 found that students tend to experience a problematic but potentially useful period of ‘creative mess’ when authoring in multimedia, and that ‘scaffolding’ strategies can be useful in overcoming this. Such strategies can empower students to derive benefits from multimedia composition if close attention is given to the setting up of the learning environment: a teachers’ model for supporting novice hypermedia authors in further education is proposed, to assist teachers to understand and support the learning processes students may undergo in dynamic composition using new media technology","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14252.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/341\/1\/ALT_J_Vol8_No3_2000_Teaching%20new%20media%20composition.pdf","pdfHashValue":"65b1e7c50a88102f3edcb70d1f33805c920d8ebb","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:341<\/identifier><datestamp>\n      2011-04-04T09:14:30Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/341\/<\/dc:relation><dc:title>\n        Teaching new media composition studies in a lifelong learning context<\/dc:title><dc:creator>\n        Jameson, Jill<\/dc:creator><dc:creator>\n        Squires, David<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Governmental proposals for lifelong learning, and the role of Information and Learning Technologies\/Information Communication Technologies (ILT\/ICT) in this, idealistically proclaim that ILT\/ICT empowers learners. A number of important governmental funding initiatives have recently been extended to the development of ILT in further education, which provides a particularly appropriate environment for lifelong learning. Yet little emphasis is given to more problematic research findings that students may be ‘disarmed’ in the process of learning to use technology. In the current global shift towards new forms of multimedia literacy, it is important to recognize human diversity by carrying out research focusing on the actual problems students face in adapting to Web‐based technology as a new authoring medium. A case study into multimedia creative composition carried out with FE students in 1996–9 found that students tend to experience a problematic but potentially useful period of ‘creative mess’ when authoring in multimedia, and that ‘scaffolding’ strategies can be useful in overcoming this. Such strategies can empower students to derive benefits from multimedia composition if close attention is given to the setting up of the learning environment: a teachers’ model for supporting novice hypermedia authors in further education is proposed, to assist teachers to understand and support the learning processes students may undergo in dynamic composition using new media technology.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2000<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/341\/1\/ALT_J_Vol8_No3_2000_Teaching%20new%20media%20composition.pdf<\/dc:identifier><dc:identifier>\n          Jameson, Jill and Squires, David  (2000) Teaching new media composition studies in a lifelong learning context.  Association for Learning Technology Journal, 8 (3).  pp. 41-55.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776000080306<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/341\/","10.1080\/0968776000080306"],"year":2000,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Teaching new media composition studies in a\nlifelong learning context\nJill Jameson* and David Squires**\n*University of Greenwich, email:j.jameson@gre.oc.uk\n**King's College London\nGovernmental proposals for lifelong learning, and the role of Information and Learning\nTechnologies\/Information Communication Technologies (ILT\/ICT) in this,\nidealistically proclaim that ILT\/ICT empowers learners. A number of important\ngovernmental funding initiatives have recently been extended to the development of ILT\nin further education, which provides a particularly appropriate environment for lifelong\nlearning. Yet little emphasis is given to more problematic research findings that students\nmay be 'disarmed' in the process of learning to use technology. In the current global shift\ntowards new forms of multimedia literacy, it is important to recognize human diversity by\ncarrying out research focusing on the actual problems students face in adapting to Web-\nbased technology as a new authoring medium. A case study into multimedia creative\ncomposition carried out with FE students in 1996-9 found that students tend to\nexperience a problematic but potentially useful period of 'creative mess' when authoring\nin multimedia, and that 'scaffolding' strategies can be useful in overcoming this. Such\nstrategies can empower students to derive benefits from multimedia composition if close\nattention is given to the setting up of the learning environment: a teachers' model for\nsupporting novice hypermedia authors in further education is proposed, to assist teachers\nto understand and support the learning processes students may undergo in dynamic\ncomposition using new media technology.\nIntroduction\nThe government 'spin' on lifelong learning, as expressed in the Green Paper, The Learning\nAge (DfEE, 1998), and taken forward in the White Paper, Learning to Succeed (DfEE,\n1999), emphasizes knowledge acquisition, skills development and student-centred flexible\neducation and training. The aim of the government, as expressed in the summary\ndocument, Education and Training Development Agenda 2000-2001, is to 'help develop a\n\"learning society\" in which everyone, in whatever circumstances, routinely expects to learn\nand upgrade skills throughout life' (DfEE, 1998). Central to this idealistic notion is the\n41\nJill Jameson and David Squires Teaching new media composition studies in a lifelong learning context\nview that continuous updating in ICT skills will play a vital part in the self-empowerment\nof individual learners. In support of this vision the government is funding ventures such as\nthe Information and Communication Technologies (ICT) Learning Centres initiative - 'a\nnew programme designed to help bridge the gap between those in society who have access\nto ICT and those who do not' (DfEE, 1999). Community Access to Lifelong Learning is a\nparallel New Opportunities Fund programme which is designed to encourage adult\nlearning. It focuses on improving access to learning opportunities through the use of ICT.\nIn further education (FE), ICT ventures similar to the ICT Learning Centres initiative have\nrecently been established. The visionary potential encompassed in an evolved conception\nof Information and Learning Technology (ILT, the 'L' attempting with arguable\neffectiveness to include 'Communication' in a broader holistic agenda of 'Learning') had\ninitially been well expressed in such documents as the Higginson Report (Higginson, 1996).\nThis formative report outlined the need for continuous updating in ILT skills, and the\npotential for ILT\/ICT to improve and extend access to learning and teaching in FE colleges\nin a lifelong learning context. Perhaps partly influenced by this work, government policy\non ILT for further education has developed markedly in the past few years, culminating in\nan announcement by David Blunkett in December 1998 of a £74 million three-year\ngovernment investment in ILT in FE. The 'National Learning Network' (NLN), the overall\nterm for the range of actions comprising this initiative, will be enhanced by the £100\nmillion that the Further Education Funding Council (FEFC) estimates colleges already\nspend annually on ILT. Together these two sums will support improvements to ILT\nincluding those in hardware and connectivity, staff and learning materials development\nand more effective learning, teaching and management of IT usage. A particularly\nformative time for ILT\/ICT in further education is therefore now occurring, in which a\nnational government development agenda is strongly laid out, and colleges have been\nasked to respond to government-allocated funds with an action plan for progressing ILT\ninitiatives.\nICT skills and lifelong learning in an FE context\nAlthough general further education colleges routinely offer a wide mix of both academic\nand vocational courses, there is a continuing tendency in FE to emphasize practical\nvocational skills in a learning environment rich with potential for the development of\nlearning technology usage. However, there are problematic issues in the practical\nimplementation of ILT\/ICT in FE. There seems to be an assumption in some policy\ninitiatives that through training and updating students in ICT skills, 'creative, enterprising\nscholars' (Hughes and Mager, 2000) will somehow emerge automatically. This assumption\nwould imply that if, for example, we teach people how to use the Web, they will become the\nself-empowered knowledge-workers of tomorrow. Yet little or no emphasis in official\ngovernment publications on lifelong learning is given to more problematic research\nfindings such as those by Seale (1999), who argues that both the 'armament' and\n'disarmament' of students is involved in learning to use technology, and that\n'disarmament' through the use of learning technologies may place obstacles in the way of\nlifelong learning.\nRecent perceptions of a multimedia-sponsored global shift towards the 'visualization of\nliteracy' (Kress and van Leeuwen, 1996) highlight issues of armament and disarmament.\n42\nALT-] Volume 8 Number 3\nNew graphical and Web-based multimedia computing, as Tuman (1992) notes with\nconcern, mark 'the beginning of a new form of literacy'. Street (1998) teases out such\ndawning concepts of one new form of literacy, suggesting a richer plurality can be\ndiscovered. While pointing out that 'new literacies' are formative in shaping children's\nrelationship with their environment, Street argues, echoing Bakhtin (Street, 1998), that\neducators should challenge the 'centripetal' forces of an assumed hegemony of language.\nThrough greater awareness of the variations of human diversity, both researchers and\nteachers can promote the 'heteroglossic character' of a recognition of 'multiple meanings'\nin a 'centrifugal . . . multi-languagedness' embracing the 'discourse varieties and com-\nmunicative practices that elude . . . centralising tendencies' (1998). In Street's eloquent\nchallenge to centralist assumptions that all uses of ILT\/ICT for lifelong learning are\nautomatically and transparently beneficial for everyone, there is, therefore, an emphasis on\nthe benefits of particular, situated, 'heteroglossic' educational research closely focusing on\npotentially problematic, actual 'multi-languagedness' in practice.\nApplying Street's idea of 'heteroglossia' to student multimedia authoring emphasizes, then,\nthe local nature of practical exercises giving opportunities for student composition\ndevelopment. Multimedia composition is a useful skill for students to come to terms with\nin adapting to Web-based technology as a polymedial 'writing' vehicle appropriate to the\ntwenty-first century. Updating in Web-based production skills enables students to\nunderstand this medium: it is important to ensure that students actively become part of the\nnew 'electracy' - to use Ulmer's term for the literate use of digital technologies (Ulmer,\n1999, p.l). Such participation can harness students' potential to use ILT\/ICT for the\npurpose of lifelong learning, and is particularly appropriate for returners to learning in\nFE.\nHowever, FE learners new to multimedia composition may be faced with a significantly\ndisempowering experience in the form of a period of conceptual confusion in varying ways\nin the process of authoring compositions. 'Disorientation' or the feeling of being 'lost in\nhyperspace' has already been much explored in the literature on hypertext\/multimedia (for\nexample, in Conklin, 1987). Nielsen (1995) is amongst those who tested the 'feeling lost'\nphenomenon, finding that, even with a small document, users became 'lost in hyperspace'\nand were 'often confused' about their location within the hypertext. What has been less\nexplored, however, is the emergence of this phenomenon in FE student hypermedia\ncomposition in relation to 'new' media and literary studies. This paper reports on an FE\ncase study which highlights ways in which in the process of multimedia authoring, students\ncan be 'armed' to derive specific benefits if close attention is given to the setting up of the\nlearning environment and the authoring task itself.\nA study of multimedia composition\nAn exploratory case study on student multimedia composition was carried out in an FE\ncollege in 1996-9. The study built on student hypermedia\/multimedia composition\nresearch done by Hay, Guzdial, Jackson, Boyle, and Soloway (1994); Lehrer (1993); Pohl,\nPrenner and Pergothafer (1995); Turner and Dipinto (1992); Dubowski and Orion (1998);\nand research by Wray, Chong, Phillips, Rogers, Walsh and Laird (1994). Research by\nBereiter and Scardamalia (1987), the ideas of Sharpies on writing as creative design (1996),\n43\nJill Jameson and David Squires Teaching new media composition studies in a lifelong learning context\nand the 'Planner-Discoverer' authoring continuum identified by Chandler (1995) were also\nconsidered in the study.\nThe 'cases' in the study were the creative compositions produced by a small group of\nstudents who took part in multimedia production sessions in 1996\/7 using the application\nHyperStudio. The study centred on the creative hypermedia composition work of four\nAccess to HE mature FE students: Pearl, Laura, Tracey and Irene. They completed several\nphases of a hypermedia authoring project focusing on the generation of creative\ncompositions. The five main compositions completed during the project were analysed\nusing an eclectic methodology featuring quantitative as well as qualitative features.\nQuantitative investigations\nIn the multiple-case design of the case study research, a statistical application of\nnonparametric tests, appropriate for the behavioural sciences in view of their usefulness\nwith small samples (Siegel and Castellan, 1988), was carried out to measure four successive\nphases of student composition in a 'quasi-experimental process' of repeated measures.\nThis kind of intensive work with small numbers, appropriate for investigative case\nstudy research in a new area, means that the quantitative results of the study were tentat-\nive findings that serendipitously emerged as part of the case study process.\nAlthough usefully replicated in the qualitative case-by-case analysis, the quantitative\nresults need to be tested experimentally with larger numbers for greater statistical accuracy.\nTherefore the results reported below are for the purposes of indicating areas for future\ninvestigation.\nThe Friedman Test was applied to the average numbers of hypermedia links per screen in\nstudent compositions at each 'stage' for each composition, comparing the performance of\neach participant to find out whether there were significant differences between the ranks at\nthe measurement points of these 'stages'. The Friedman Test revealed a p<.028 level of\nsignificance, indicating that in narrative-type compositions there was a significant\ndifference in the numbers of links per screen over the time-phases.\nPage's L Trend Test was then applied to students' work at four stages of composition in a\nvariety of ways to see if the increasing number of links per screens across participants'\nwork could be regarded as a significant trend, as opposed to just a difference at each\nmeasurement point. This revealed no significant trend for an increasing number of links\nper screen across case study participants (see Table 1).\nFrom a further examination of the ranking across the four 'conditions', however, it was\nevident that the scores for 'conditions' two and three indicated that participants seemed to\nhave been in a transitional stage of composition in these time-phases in which there was a\ndegree of unresolved 'mess'. One could broadly regard this as a process in which the links\nwere still being sorted out, and therefore numbers of links per screen might go up and\ndown haphazardly. Page's L Trend Test was hence again applied, the 'conditions' two and\nthree for all compositions being treated as a 'middle phase' together, the average of both\nrepresenting this 'middle'. This gave three 'conditions': (1) beginning - Stage 1; (2) middle\n- Stages 2 and 3; and (3) end - Final Stage, 4 (see Table 2).\nPage's L Trend Test applied again in a merged treatment for greater accuracy to these three\n'conditions' gave a significance level of p<.01 (see Table 3) for the compositions, revealing\n44\nAir-J Volume 8 Number 3\nPage's L - links\/screens\nNH links to screens\nFH links to screens\nN W links to screens\nIS links to screens\nRanking totals ( )\nL = 109.78\nCondition 1\n2.33 (1)\n1.33(1)\n1.33(1)\n0.67 (2)\n(5)\nCondition 2\n2.71 (2)\n1.5 (2)\n1.5 (3)\n1.5(1)\n(8)\nCondition 3\n4.6 (3)\n1.83 (3.5)\n1.36(3)\n2.07 (3)\n(11.5)\nCondition 4\n13.57(4)\n1.83(3.5)\n4.13(4)\n6.58 (4)\n(15.5)\nJust outside the level of significance I = 111 p<.05.\nTable I: Page's L Trend Test no. of links per screen.\n(Abbreviations NH= 'Nursery House'; FH= 'Fairy House; NW= 'New Woods'; \/S= 'Ilia and the Statue'are for the\nnames of students' compositions. links\/Screens = the average number of hypertext links per screen created by\nstudents in each of the four stages of composing.The stages are treated as experimental conditions in a repeated\nmeasures process).\nPage's L - links\/screens Condition I Condition 2 Condition 3\n(Stage I) (Ave Stages 2\/3) (Final)\nNH links to screens 2.33 ( I) 3.66 (2) 13.57 (3)\nFH links to screens 1-33(1) 1.67 (2) 1.83 (3)\nN W links to screens 1.33 ( I) 1.43 (2) 4.13 (3)\nIS links to screens 0.67(1) 1.25 (2) 6.58(3)\nRanking totals ( ) (4) (8) (12)\nL = 56\nLevel of significance p = <.001.\nTable 2: Page's LTrendTest no. of links\/screen with conditions 213 merged.\na significant trend of increasing numbers of links to screens from the start of the\ncomposition process, through the confusion of the middle phase, to the final composition.\nThis indicated that although participants might go through a period of 'mess' in the middle\nphase of composition, the average numbers of links per screen created during this period\nwould still be higher than in the first phase, and would be superseded again by the numbers\nof links per screen in the final composition phase.\nAlthough Friedman's Test had revealed that the composition scores were significantly\ndifferent at each phase, this did not emerge as a significant trend using Page's L Trend Test\nif the four conditions were treated separately, but it clearly did if conditions two and three\nwere measured together. There was thus a significant trend for the numbers of links per\nscreen to increase across the phases, but this was only apparent if the middle phases were\ntreated together as one condition. An identifiable period of 'creative mess' in the middle\nphases therefore seemed to occur in which the number of links per screen might go up or\ndown haphazardly. This finally resolved itself into final compositions that were\nsimultaneously more complex and more coherent, with a higher number of links to screens\nthan at the start of the composition process.\n45\nJill Jameson and David Squires Teaching new media composition studies in a lifelong learning context\nPage's L - links\/screens Condition I Condition 2 Condition 3\n(Stage I) (Ave Stages 2\/3) (Final)\nNH links to screens\nFHNW links to screens\nIS links to screens\nRanking totals ( )\n1 = 4 2\n2.33 (1)\n1.33(1)\n0.67(1)\n(3)\n3.66 (2)\n1.43 (2)\n1.25 (2)\n(6)\n13.57(3)\n4.13(3)\n6.58 (3)\n(9)\nLevel of significance p = <.O I.\nTable 3: Page's L Test no. links\/screen: conditions 2\/3 merged, FH\/NW.\nFollowing the resolution of the period of students' confusion, an increase in the number of\nlinks across compositions in successive drafts indicated a growth in aptitude in the\nformation of links, and in students' understanding of the rhetorical and content\nappropriacy of linking. Over a period of several weeks, the numbers of links shot up in\nsuccessive stages in all compositions (for example from 14 to 19 to 46 to 95 in Nursery\nHouse, from 18 to 23 in the case of Adventure Game, from 20 to 88 in Pop Quiz, and in the\ncase of New Woods from 4 to 9 to 15 to 33) (see Figure 1). As the links increased in number,\nso the structural complexity of all of the compositions developed. From an initially simple\nstructure of only three screens with two links, Ilia and the Statue, for example, becomes a\nmore intricately structured work with twelve screens and seventy-nine links. The dominant\npattern is that compositions increased in the number of links, and in their scores for the\nthree variables of 'originality', fluency and complexity, in a rise that peaks in the final\nphase (see Figure 1).\nQualitative investigations\nA particular issue relating to this period of conceptual confusion, or phase of 'creative\nmess', was described in the interviews by students as the state of being 'lost' in the\ncomposition. All students noted this in different ways - Laura stated, 'I got lost all the\ntime', while Pearl said, 'You get to a point where you need to have something to refer to\nand know exactly what's going where... because I did have that problem, where I'd link up\nmore than one page to one button.' One particular student was emotionally affected by\nthese feelings of confusion in multimedia authoring:\nI: I work better on paper, you know, because I'm nearly forty. I've been working on\npaper for much longer than I've been working on computers.... I'd get a card, I'd make\na card and then it would be gone. [Note: this refers to the 'cards' or multimedia screens\nconstructed by students using HyperStudio] And I wouldn't know where it had gone to\nand . . . and I couldn't get it back, and stuff like this, you know.... I just felt like crying\nsometimes... didn't know where things had kept disappearing to.\nR: Now that's what I'm talking about. When people kind of get lost in this new\nenvironment. And s o . . . did you express to anybody what was happening then?\nI: I spoke to Tracey about it. And I find - 1 think she's got the kind of brain that takes\nthis sort of thing in a lot better - a lot quicker than I do. So speaking to her helped.\n46\nALT-J Volume 8 Number 3\nTracey's Nursery House:\nStages in Composition\nLaura's Fairy House:\nStages in Composition\nfill gd\n*\nsago 1 stage 2\nStage 1 Stag. 2 Stag* 3 Stage 4\nIrene's Adventure House & Pop Quiz:\nScores for the\nvariables, screens\nand links\nacross all main\ncompositions in\nthe final study\nFigure I: Scores for the variables, links and screens across all compositions.\nR: So how did she help?\nI: Well I just talked about what I was trying to achieve. And then we talked through it\n. . . then she'd say, 'Oh well, it sounds like you should maybe try to do it like this.' And so\nwe could talk it out and work out a good way to do it and then she got really interested\nin my ideas. And she wanted to help me to do mine, so we're kind of going to - 1 think\nwe're going to get together and expand it together.\nInterview with Irene, student, 21 July\n47\nJill Jameson and David Squires Teaching new media composition studies in a lifelong learning context\nIn a student multimedia composition environment, the period of disorientation in working\none's way through multimedia may be a necessary part of the learning experience. Coming\nto terms with multimedia authoring can be a process of progressive self-empowerment, as\nstudents gradually adjust to the difficulties of the environment, and begin to understand\nhow to work with it. Mayes, Kibby and Anderson (1990) note about hypertext that '[u]nder\ncertain conditions (not all) disorientation in conceptual space may be regarded as a\nnecessary prerequisite for depth of learning... 'getting lost' may be regarded as a desirable\nor even necessary part of the process of structuring'.\nResults\nResearch on student creative composition in multimedia has been relatively rare in view of\nthe short history of computer-based hypermedia applications suitable for student\nproduction work. Examining students' work in a series of four repeated measures of\ncomposition stages, a critical finding of the study was the existence of a period of 'creative\nmess' in the authoring process, during which students need help to progress. This\ndisorientating phase seemed to occur between the second and third stages of dynamic\ncomposition, in which the numbers of links created by students tend to go up or down\nhaphazardly, compositions students were creating did not show an orderly progression in\ndevelopment and students could not fully envisage the shape of them.\nThe period of time varied according to students' capabilities, and was regarded by some\nstudents as a time of disorder in which they felt lost and depressed. The period was\nresolved as students sorted out the 'mess', deleting unnecessary screens and filling in\nmissing links. The result, in narrative compositions, was a more elaborate, organized final\nwork in which the numbers of links per screen were likely to be significantly higher than in\nany previous phase. In a case study involving intensive work with small numbers of\nstudents, these tentative statistical indications of a period of conceptual confusion were\nborne out by the qualitative analysis, in which students themselves suggested that a period\nof confusion had been resolved during the composing process.\nThis phase was therefore something students needed to overcome in order to progress with\nmultimedia, but was also potentially productive for student authoring - a challenging but\nultimately desirable phase for learners, as it seems to require them to expand their\nexpressive capabilities to encompass the complexities of the medium. From this process, a\nbeneficial 'cognitive residue' (Salomon et al, 1991) in expressive, creative design and\nproblem-solving capability may result from the 'student-technology' partnership.\nAppropriate learning tools and techniques could usefully support messy exploration in\nhypermedia composition, since the results of this case study indicate that the period of\n'creative mess' is both necessary and productive in enabling learners to expand their\nunderstanding of the hypermedia environment. Methods to assist the learner in working\nthrough this period, rather than to eliminate it, are required, since the findings of the study\nindicate that the elimination of this state would reduce the conceptual development\nundertaken in students' progression through the stages.\nScaffolding strategies to overcome confusion and disorientation\nTo overcome the confusion and disorientation students face during the period of 'creative\nmess', they need to engage with the process of composition in ways which call for the kind\n48\nALT-] Volume 8 Number 3\nof 'knowledge transforming' strategies outlined by Bereiter and Scardamalia (1987). A\nnumber of the strategies undertaken by learners can be interpreted as scaffolding help of a\nvariety of kinds. The zone of proximal development described by Vygotsky (1978) is related\nto the concept of scaffolding, in that this crucial zone is the difference between the actual\nlevel of mental development in the learner and the potential level of development when\nthey are helped with guidance or through collaboration with more advanced learners -\n'what is in the zone of proximal development today will be the actual developmental level\ntomorrow'. Therefore, this concept of the 'zone of proximal development' led Vygotsky to\npropose that 'the only \"good learning\" is that which is in advance of development'\n(Vygotsky, 1978).\nIn terms of multimedia composition, the zone of 'creative mess' or aporia is a similar\nconcept, directly related to hypermedia, of a precariously widened out potentiality for\nlearning on the part of the student, who ventures into such messy exploration at the risk of\nconfusion and further disorientation. The use of 'scaffolding' techniques is therefore crucial\nto assist the learner in this exploration, without minimizing its effectiveness. The concept of\n'scaffolding' from tutors is an established methodology described by a number of researchers,\nbut building 'fadeable scaffolding' into educational software is a new methodology for the\n'learner-centred design' (LCD) of software that researchers Jackson, Krajcik and Soloway\n(1998) developed in the idea of 'Guided Learner-Adaptable Scaffolding' (GLAS). In this\napproach to software design, Jackson et al. note that 'the learner will... be in control of the\nchanging and fading of scaffolding... The goal is for the student, with the software's help, to\nbe able to take on some of the responsibility for his or her learning' (Jackson et al, 1998).\nJackson et al. differentiate between three different types of scaffolding: supportive\nscaffolding or 'support for doing the task'; reflective scaffolding, or 'support for thinking\nabout the task'; and intrinsic scaffolding, or 'supports that change the task, by reducing the\ncomplexity of the task and focussing the learner's attention (for example, training wheels\non a bicycle . . .) or by providing mechanisms for visualizing or thinking about a concept\n(for example, maps and models for visualization)' (Jackson et al., 1998). These three basic\ntypes of scaffolding were used by the learners in this case study in different ways. In terms\nof software support as a form of scaffolding, the only scaffolding software support was\nfrom the HyperStudio storyboard. Since HyperStudio is not a tutoring program directing\nthe interactions of learners, but an open application for authoring in hypermedia, the\n'fading' of scaffolding support was in all cases under the learner's control.\nTutor and student peer support\nA supportive 'scaffolding' strategy used by students to help them sort out the confusion\nand difficulty of using HyperStudio was help from another person. Such help included the\nregular support given by the HyperStudio tutor, in all composition sessions, but it also\nincluded 'scaffolding' help from a more capable peer - in this case, Tracey, a self-appointed\n'student expert' in the sense defined by Turner and Dipinto (1997). These researchers found\nthat amongst the vital elements in enabling a successful student multimedia collaborative\nculture was the work undertaken by 'student experts', who 'were responsible for teaching\ntheir classmates how to do these things and for troubleshooting any problems' (Turner and\nDipinto, 1997). Tracey provided important supportive and intrinsic scaffolding, students\nexpressing that her help had been invaluable in enabling them to come to terms with the\ndifficulty of the hypermedia task.\n49\nJill Jameson and David Squires Teaching new media composition studies in a lifelong learning context\nThe tutor provided supportive, reflective and intrinsic scaffolding to the students. In\nhelping them carry out the task on a session-by-session basis, his support was crucial, and\nhe worked one-to-one with the students to enable them to create their compositions. In\nterms of reflective planning, the tutor talked through with the students their composition\nplans, queried their ideas and helped them evaluate their work continuously. As regards\nintrinsic scaffolding, he reduced the complexity of the task on request, for example, to\nmodify composition tasks. He also explained the idea of the concept map and encouraged\nstudents to visualize their work through this means.\nStoryboarding, diary-keeping and interview participation\nThe HyperStudio storyboard was the first, and main, 'scaffolding' strategy frequently used\nby students to orientate themselves in the process of composing hypermedia, even though\nit only provides a limited linear overview. They used this device mainly for supportive\nscaffolding, as it was not sophisticated enough to provide much reflective or intrinsic\nscaffolding.\nDiary completion and participation in interviews were both a means of reflective\nscaffolding. In the former case, students were encouraged to keep a diary on a weekly basis,\nto enable them to reflect on their work. In the latter case, the interview formed a summative\nevaluation and 'debriefing' from the project, in which students were encouraged in\ndiscussion with the researcher to analyse their work retrospectively in a final critique.\nPaper-based concept mapping\nThe concept mapping strategy was used by learners for both reflective and intrinsic\nscaffolding: as a reflective scaffolding tool for planning the structuring of compositions,\nand to some extent as an intrinsic scaffolding tool, though students expressed that they did\nnot need it after a certain point, voluntarily 'fading' it. Doing a paper-based concept map\nmay therefore be a useful reflective and intrinsic planning tool to help students orientate\nthemselves, though even without a concept map students may emerge from the tangled\nconfusion of their work into greater clarity, particularly if given 'scaffolding' help by\nanother person.\nOnce the period of initial confusion in using hypermedia is over, students may develop a\ncapability of 'seeing' the work with a 'mental map', and are unlikely to need a concept map\nagain for a composition with a manageable number of screens. Students in the study\nregarded the paper-based concept maps as a useful initial planning device, a 'beginning\nkind of thing', but were reluctant to revise them, seeing the updating process as irrelevant\nafter the intermediate composition stages. The concept mapping exercise was therefore\nsuccessful as a preliminary intervention in the case of three of the students in the research,\nthough they chose voluntarily to 'fade' the use of this support over time. The conclusions\nof Pohl, Prenner and Purgathofer (1995) that 'inexperienced authors of hypermedia\nsystems need special support to create non-hierarchical relationships and an adequate\nlayout in their hypermedia document' and that 'the process of map construction helps\nlearners to organise and structure their knowledge' were therefore to some extent replicated\nin the current study.\nThe use of dynamic online concept maps, automatically annotated by the hypermedia\nenvironment, would have been, arguably, easier for students. However, the conceptual\nchallenge of a mapping task generated from and by the students themselves would not\n50\nALT-] Volume 8 Number 3\nhave been achieved in this short-term project, and for this reason an automated mapping\nenvironment was not given to the students, this 'omission design' to avoid the multimedia\n'passivity trap' (Squires, 1997) being intended particularly to encourage the students to\ndevelop their own goals and to manage their own learning from the composition task.\nPaper-based concept mapping was found to be deficient in modelling the actual activities\nstudents undergo in hypermedia composition, but was useful to 'kickstart' the students\ninto deeper levels of composition. Potentially useful as an initial planning tool for hyper-\nmedia composition, paper-based concept maps may focus students on creating a\ncomprehensible linking structure and help them overcome problems of being 'lost in\nhyperspace'. They can only be used, however, after students have developed some basic\nunderstanding and skill in hypermedia composition, and students' apparent reluctance to\nreview and edit maps may need to be overcome. The use of concept maps can therefore be\nan initial enabling and empowering device to help learners cope with a difficult\ncomposition process in which navigation is particularly testing.\nTeaching model for teachers to support novice composers\nA model for use by teachers of novice hypermedia composition was developed from the\ncase study, to indicate the stages in composition, and the factors that may be involved in\nteaching creative hypermedia authoring to novices (see Figure 2). This model depicts a\nsimplification of the processes and strategies in the study, to outline for teachers the\ndeveloping stages learners may undergo. In the centre of the model, the requirements for\nan effective hypermedia composition teaching environment are indicated. From this central\nblock of text, four arrows radiate out, indicating that these elements are appropriate at all\nstages in composition, although some of them are particularly relevant to different stages.\nThe relevance of these elements is demonstrated using a simple numbering scheme for the\nstages of composition. Around the circumference of the diagram, the four stages students\nin the study went through are displayed, indicating developing levels of maturity in\ncomposition, and the characteristics applying to each stage. The dominant aspects of the\nstages are summed up in statements arranged in a circular fashion around the central block\nof text. These are: (1) learning hypermedia skills; (2) zone of creative mess; (3) expanding\nlinks and screens; and (4) compacting, reflecting, evaluating. These statements sum up the\nprocess of composition observed and evaluated in the study. The model is put forward to\nassist teachers to understand some of the processes learners may undergo in composing\nhypermedia, indicating that a balance of cognitive strategies, discovery processes, physical\nand socio-cultural factors may be involved in the effective developmental evolution of\nnovice authoring in hypermedia composition.\nSpecifically, the results of this study are directed at those interested in developing\nmultimedia authoring, encouraging colleges to develop new media composition studies as\npart of their institutional ILT\/ICT teaching and training programmes. A unique\nopportunity currently exists in FE to maximize the benefits of a continuing governmental\nfocus on relatively greater investment in the sector: practical developments in expanding\ncollege conceptions of 'English and Communications' as a field of study to incorporate\nmore substantial elements of new media teaching are necessary and should be achieved\nwith careful attention to the learning environment set up for students.\n51\nModel for\nSupporting\nNo\\ice\nHypermedia\nComposers\n1 Stoi^ 1 C»mp oiition\nFbvtxy • itiltd\nConpUnty - rafri\n1Mb -buk\nJhwiu • aaiUnumbtr\nStmettn • itapli lint*\ntin\nStage 5\nCompositions\nand beyond\n1 j 1 Stage 2 Compolition\n1 1 ^ : ~^_^ •Oripnav\nO\nScreem •\n\"*\"• bit dcrtntivt\nViiniSid\nnrtnc\n• MqwrknniUl\nReflection\nReader feedback\nSununative evaluation\n'Cognitive residue' of\nimproved composing\nskills & learner\nempowerment\nH»«muiia b u t m l b n\nDLic«v«]T in 'tnttim mctt\nI\n 3 I ScJfcUln.h.lp t. i . . .b> 'nun'\nBuic SldlLi in Writing IT ui4 Deficit\nEnrklui Icuninc •nvir*nmcnt\nOwn imtinticn, c*Enitim *ppr«nticefhJp\nL E X P ^\nV-• £\nt\ne—\nnun float\nCompUxiiy -man\n-ndoctd\nArtrAav • combjnitktn li\nid' tlemaitf\ni\n1\nex\nI\nFigure 2: Teacher's mode\/ for supporting novice hypermedia composers.\nALT-] Volume 8 Number 3\nThe current drive to use ILT in further education to improve students' capabilities for lifelong\nlearning and to develop in learners 'innovation, self-reliance and creativity' is assisted by\nexamining in detail problematic issues in the actual accomplishment of specific tasks such as\nmultimedia authoring. The case study reported in this paper has concentrated on one particular\nproblematic issue of student 'disarmament' in the use of ILT\/ICT, proposing a solution\ndeveloped through case study research. The tentative statistical results of this intensive case\nstudy research with a small number of adult FE students could be tested experimentally in\nwork involving larger numbers. There is also a need for further more general detailed research\nwork with students in the classroom across the range of ILT\/ICT activities and skills in further\neducation, to take forward a more real understanding of the actual problems learners face in\nusing ILT\/ICT productively and creatively in the twenty-first century.\nThe particular applicability of this study to the further education sector and the concept of\nlifelong learning relates to the fact that these novice student authors were adult returners to\nlearning with specific requirements for support. More confident and experienced students\nat more advanced levels of higher education arguably may not require the careful\nconstruction of a learning environment with the multiple supportive features outlined here\nto foster a developing sense of self-empowerment in the process of multimedia authoring.\nIn terms of improving access to lifelong learning through the use of ILT\/ICT in further\neducation, however, it is particularly relevant to examine and implement such ways of\nremoving barriers to learning.\nAcknowledgements\nWe would like to acknowledge the following for their help and support in this project:\nLaura, Tracey, Pearl, Irene, Bernie, the Media and Learning Resources staff in the College,\nthe Staff Development Co-ordinator, and Bob Challis.\nReferences\nBereiter, C. and Scardamalia, M. (1987), The Psychology of Written Composition, New\nJersey: Lawrence Erlbaum Associates Inc.\nBurbules, N. C. (1997), 'Aporia: Webs, passages, getting lost, and learning to go on',\nPhilosophy of Education.\nCarlson, P. A. (1990), 'The rhetoric of hypertext', Hypermedia, 2 (2), 109-31.\nChandler, D. (1995), The Act of Writing: A Media Theory Approach, Aberystwyth:\nUniversity of Wales, Aberystwyth.\nConklin, J. (1987), 'Hypertext: an introduction and survey', Computer 20 (9), 17-41.\nde la Passardiere, B. and Dufresne, A. (1992), Adaptive Navigational Tools for Educational\nHypermedia, Computer Assisted Learning: Proceedings of the 4th International\nConference, ICCAL '92, Wolfville, Novia Scotia, Canada, Berlin\/Heidelberg: Springer-\nVerlag.\nDeleuze, G. and Guattarri, F. (1983), On the Line, New York: Semiotexte.\nDfEE (1998), The Learning Age, London: DfEE.\nS3\nJill Jameson and David Squires Teaching new media composition studies in a lifelong learning context\nDfEE (1999), Learning to Succeed: A New Framework for Post-16 Learning, London: The\nStationery Office\nDubowski, Y. and Orion, N. (1998), Evaluating the Educational Potential of Multimedia\nAuthoring within the Framework of an Earth Science Curriculum - A Case Study, National\nAssociation of Research in Science Teaching (NARST), San Diego, Weizmann Institute of\nScience, Rehovoth, Israel.\nEklund, J. (1995), Cognitive Models for Structuring Hypermedia and Implications for\nLearning from the World-Wide Web, AusWeb95, Australia, Southern Cross University.\nGadamer, H. G. (1975), Truth and Method, New York: Seabury Press.\nGarvey, C. (1982), Play, Shepton Mallet: Fontana\/Open Books Original, Open Books\nPublishing Ltd.\nHannafin, M. J. and Land, S. M. (1997), 'The foundations and assumptions of technology-\nenhanced student-centred learning environments', Instructional Science, 25, 167-202.\nHay, K. E., Guzdial, M., Jackson, S., Boyle, R. A. and Soloway, E. (1994), 'Students as\nmultimedia composers', Computers in Education 23 (4), 301-17.\nHigginson, G. (1996), Report of the Learning Technology Committee, Further Education\nFunding Council.\nHughes, M. and Mager, C. (2000), The Skills Agenda: Issues for Post-16 Providers, FEDA\nComments Series, London: Further Education Development Agency (FEDA)\nPublications.\nJackson, S. L., Krajcik, J. and Soloway, E. (1998), The Design of Guided Learner-adaptable\nScaffolding in Interactive Learning Environments, CHI98, Ann Arbor, MI 48109, USA,\nCollege of Engineering, School of Education, School of Information, University of\nMichigan.\nJonassen, D. H. and Grabinger, R. S. (1989), Problems and Issues in Designing\nHypertext\/Hypermedia for Learning, NATO Advanced Research Workshop on Designing\nHypermedia for Learning, Rottenburg\/Neckar: Springer-Verlag.\nKress, G. and van Leeuwen, T. (1996) Reading Images: The Grammar of Visual Design,\nLondon: Routledge.\nLandow, G. P. (1989), 'Popular fallacies about hypertext', in D. H. Jonassen and H. Mandl\n(eds.), Designing Hypermedia for Learning, Berlin: Springer-Verlag, 39-60.\nLandow, G. P. (1997), Hypertext 2.0: The Convergence of Contemporary Critical Theory\nand Technology, Baltimore, Maryland: The John Hopkins University Press.\nLehrer, R. (1993), 'Authors of knowledge: patterns of hypermedia design', in S. P. Lajoie\nand S. J. Derry (eds.), Computers as Cognitive Tools, Hillsdale, New Jersey: Lawrence\nErlbaum Associates, Inc., 197-227.\nMayes, T., Kibby, M. and Anderson, T. (1990), 'Signposts for conceptual orientation: some\nrequirements for learning from hypertext', in R. MacAleese and C. Green (eds.),\nHypertext: State of the Art, Oxford, Intellect Limited, 121-9.\n54\nALT-] Volume 8 Number 3\nNielsen, J. (1995), Multimedia and Hypertext: The Internet and Beyond, London: AP\nProfessional\/Academic Press, Inc.\nPeckham, M. (1967), Man's Rage for Chaos: Biology, Behaviour and the Arts, New York:\nSchocken.\nPlato (1956), Meno. Protagoras and Meno, B. Radice. Harmondsworth: Penguin Books\nLtd.\nPohl, M., Prenner, P. and Purgathofer, P. (1995), 'Hypermedia in education - monitoring\nthe development of hypermedia documents', The Journal of the British Psychological\nSociety's Special Group for the Teaching of Psychology, 4 (2), 142-52.\nSalomon, G., Perkins, D. N. and Globerson, T. (1991), 'Partners in cognition: extending\nhuman intelligence with intelligent technologies', Educational Researcher, 20 (3), 2-9.\nSeale, J. (1999), 'Learning technologies and the lifelong learner: armament or\ndisarmament?', ALT J, 7 (2), 61-7.\nSharpies, M. (1996), 'An account of writing as creative design', in C. M. Levy, and S.\nRansdell (eds.), The Science of Writing: Theories, Methods, Individual Differences, and\nApplications, Mahwah, New Jersey: Lawrence Erlbaum Associates Inc.\nSeigal, S. and Castellan, N. I , Jr. (1988), Non Parametric Statistics for the Behavioural\nSciences (second edition), Singapore: McGraw-Hill Book Co.\nStreet, B. (1998), 'New literacies in theory and practice: what are the implications for\nlanguage in education?', Linguistics and Education, 10 (1), 1-24.\nSquires, D. (1997), 'Can multimedia support constructivist learning?', Teaching Review, 4\n(2), 10-17.\nTuman, M. C. (1992), Word Perfect: Literacy in the Computer Age, Pittsburgh Series in\nComposition, Literacy and Culture, D. Bartholomae and J. Ferguson Carr (eds.),\nPittsburgh, Pa: University of Pittsburgh Press\nTurner, S. T. and Dipinto, V. M. (1997), 'Peer collaboration in a hypermedia learning\nenvironment', Journal of Research on Computing in Education, 28 (5).\nTurner, S. V., and Dipinto, V. M. (1992), 'Students as hypermedia authors: themes\nemerging from a qualitative study', Journal of Research in Computer Education, 25, 187-99.\nUlmer, G. (1999), The Invention List: Website for Newsgroup University of Florida,\nhttp: \/\/web.elf.edu\/~gulmer\/.\nVygotsky, L. S. (1978), Mind in Society: The Development of Higher Psychological\nProcesses, Cambridge, Mass.: Harvard University Press.\nWray, R. E. I., Chong, R., Phillips, J., Rogers, S., Walsh, W. and Laird, J. (1994),\n'Organising information in mosaic: a classroom experiment', SDG\/IT 94.\n55\n"}