{"doi":"10.1039\/b502641e","coreId":"102221","oai":"oai:epubs.surrey.ac.uk:1674","identifiers":["oai:epubs.surrey.ac.uk:1674","10.1039\/b502641e"],"title":"Synthesis and characterisation of the perovskite-related cuprate phases YSr2Cu2MO7+y (M=Co, Fe) for potential use as solid oxide fuel cell cathode materials","authors":["Sansom, Jonathan","Kendrick, Emma","Rudge-Pickard, Hazel","Islam, Saiful","Wright, Adrian","Slater, Peter"],"enrichments":{"references":[],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2005-04-12","abstract":"<p>In this paper we report the synthesis and characterisation of the perovskite cuprate phases YSr2Cu2MO7+y (M=Co, Fe) to examine their potential for use as cathode materials in Solid Oxide Fuel Cells (SOFC). Both samples showed conductivities of approx. 10 Scm-1 at 900C and were also shown to be stable at this temperature in N2. For YSr2Cu2FeO7+x, semiconducting behaviour was observed up to about 550C, with a decrease in conductivity at higher temperatures, attributed to oxygen loss reducing the charge carrier concentration. In the case of YSr2Cu2CoO7+y, semiconducting behaviour was observed over the range of temperatures studied, although a small but significant steep increase in conductivity was observed above 800C.  High temperature X-ray diffraction studies of this particular phase showed that this increase in conductivity coincided with an orthorhombic-tetragonal structural transition, accompanied by a significant reduction in cell volume. In addition to measurements in air, conductivities were also measured with varying p(O2) (0.2-10-5 atm.) at 900C, and this data showed significant hysteresis between measurements on reducing and re-oxidising, suggesting poor oxide ion transport, poor oxygen surface exchange kinetics, or significant structural changes on varying p(O2). Chemical compatibility studies of these phases with SOFC electrolytes at temperatures between 900 and 1000C showed reaction in all cases. In the case of CeO2 based electrolytes, the reaction led to the formation of the \"fluorite-block\" phases, (Y\/Ce)2Sr2Cu3-xMxO9+y (M=Co, Fe), and samples of these were subsequently prepared and the conductivities measured. Similar hysteresis between conductivity measurements on reducing and re-oxidising were also observed for these samples.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1674<\/identifier><datestamp>\n      2017-10-31T14:02:43Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6368656D6963616C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1674\/<\/dc:relation><dc:title>\n        Synthesis and characterisation of the perovskite-related cuprate phases YSr2Cu2MO7+y (M=Co, Fe) for potential use as solid oxide fuel cell cathode materials<\/dc:title><dc:creator>\n        Sansom, Jonathan<\/dc:creator><dc:creator>\n        Kendrick, Emma<\/dc:creator><dc:creator>\n        Rudge-Pickard, Hazel<\/dc:creator><dc:creator>\n        Islam, Saiful<\/dc:creator><dc:creator>\n        Wright, Adrian<\/dc:creator><dc:creator>\n        Slater, Peter<\/dc:creator><dc:description>\n        <p>In this paper we report the synthesis and characterisation of the perovskite cuprate phases YSr2Cu2MO7+y (M=Co, Fe) to examine their potential for use as cathode materials in Solid Oxide Fuel Cells (SOFC). Both samples showed conductivities of approx. 10 Scm-1 at 900C and were also shown to be stable at this temperature in N2. For YSr2Cu2FeO7+x, semiconducting behaviour was observed up to about 550C, with a decrease in conductivity at higher temperatures, attributed to oxygen loss reducing the charge carrier concentration. In the case of YSr2Cu2CoO7+y, semiconducting behaviour was observed over the range of temperatures studied, although a small but significant steep increase in conductivity was observed above 800C.  High temperature X-ray diffraction studies of this particular phase showed that this increase in conductivity coincided with an orthorhombic-tetragonal structural transition, accompanied by a significant reduction in cell volume. In addition to measurements in air, conductivities were also measured with varying p(O2) (0.2-10-5 atm.) at 900C, and this data showed significant hysteresis between measurements on reducing and re-oxidising, suggesting poor oxide ion transport, poor oxygen surface exchange kinetics, or significant structural changes on varying p(O2). Chemical compatibility studies of these phases with SOFC electrolytes at temperatures between 900 and 1000C showed reaction in all cases. In the case of CeO2 based electrolytes, the reaction led to the formation of the \"fluorite-block\" phases, (Y\/Ce)2Sr2Cu3-xMxO9+y (M=Co, Fe), and samples of these were subsequently prepared and the conductivities measured. Similar hysteresis between conductivity measurements on reducing and re-oxidising were also observed for these samples.<\/p><\/dc:description><dc:date>\n        2005-04-12<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1674\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Sansom, Jonathan, Kendrick, Emma, Rudge-Pickard, Hazel, Islam, Saiful, Wright, Adrian and Slater, Peter  (2005) Synthesis and characterisation of the perovskite-related cuprate phases YSr2Cu2MO7+y (M=Co, Fe) for potential use as solid oxide fuel cell cathode materials   J. Mater. Chem..       <\/dc:identifier><dc:relation>\n        DOI: 10.1039\/b502641e<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1674\/","DOI: 10.1039\/b502641e"],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Synthesis and characterisation of the perovskite-related cuprate phases YSr2Cu2MO7+y \n(M=Co, Fe) for potential use as solid oxide fuel cell cathode materials \n \nJ.E.H. Sansom1, E. Kendrick1, H.A. Rudge-Pickard1, M.S. Islam1, A.J. Wright2, and P.R. \nSlater1 \n \n1Chemistry, SBMS, University of Surrey, Guildford, Surrey. GU2 7XH, UK \n \n2School of Chemistry, University of Birmingham, Birmingham. B15 2TT, UK \n \n \nCorrespondance to: \n \nDr. P.R. Slater \nChemistry, SBMS, University of Surrey, Guildford, Surrey. GU2 7XH. UK \n \nTel. +44 (0)1483 686847 \nFax. +44 (0)1483 686851 \n \ne-mail: p.slater@surrey.ac.uk \n 2 \nAbstract \n \nIn this paper we report the synthesis and characterisation of the perovskite cuprate phases \nYSr2Cu2MO7+y (M=Co, Fe) to examine their potential for use as cathode materials in \nSolid Oxide Fuel Cells (SOFC). Both samples showed conductivities of ≈10 Scm-1 at \n900°C and were also shown to be stable at this temperature in N2. For YSr2Cu2FeO7+x, \nsemiconducting behaviour was observed up to ≈550°C, with a decrease in conductivity at \nhigher temperatures, attributed to oxygen loss reducing the charge carrier concentration. \nIn the case of YSr2Cu2CoO7+y, semiconducting behaviour was observed over the range of \ntemperatures studied, although a small but significant steep increase in conductivity was \nobserved above 800°C.  High temperature X-ray diffraction studies of this particular \nphase showed that this increase in conductivity coincided with an orthorhombic-\ntetragonal structural transition, accompanied by a significant reduction in cell volume. In \naddition to measurements in air, conductivities were also measured with varying p(O2) \n(0.2-10-5 atm.) at 900°C, and this data showed significant hysteresis between \nmeasurements on reducing and re-oxidising, suggesting poor oxide ion transport, poor \noxygen surface exchange kinetics, or significant structural changes on varying p(O2). \nChemical compatibility studies of these phases with SOFC electrolytes at temperatures \nbetween 900 and 1000°C showed reaction in all cases. In the case of CeO2 based \nelectrolytes, the reaction led to the formation of the \"fluorite-block\" phases, \n(Y\/Ce)2Sr2Cu3-xMxO9+y (M=Co, Fe), and samples of these were subsequently prepared \nand the conductivities measured. Similar hysteresis between conductivity measurements \non reducing and re-oxidising were also observed for these samples. \n \n \nKeywords: Cuprate, perovskite, cathode, X-ray diffraction, conductivity, solid oxide fuel \ncell \n 3 \nIntroduction \n \nWith the growing concerns over dwindling fuel reserves, and increasing greenhouse gas \nemissions, there is a steadily increasing interest in more efficient means of energy \ngeneration. One of the technologies being investigated with vigour is the fuel cell, which \nprovides a means for directly converting chemical energy within a fuel to electrical \nenergy. There are a number of different types of fuel cells, depending on the electrolyte \nemployed and the temperature of operation. Solid oxide fuel cells are all solid state \nsystems which operate at elevated temperatures (500-1000°C), and are attracting \nconsiderable interest for stationary power generation, particularly due to their potential \nfor utilising a wide range of fuels. The current favoured materials for the electrolyte \n(yttria stablised zirconia, YSZ), the anode (a Ni\/YSZ cermet) and the cathode (La1-\nxSrxMnO3) all have some operating problems. In the case of the cathode, La1-xSrxMnO3 \nshows low levels of oxide ion conductivity, hence although O2 can be reduced to O2- at \nthe surface of the cathode, these oxide ions cannot easily migrate through the cathode to \nthe electrolyte. Hence the surface area of reaction is essentially limited to the three phase \nboundaries between the cathode, electrolyte, and oxygen gas. It is with a view to solving \nsome of these problems that our research has concentrated on alternative materials, and in \nthis paper we present an investigation of some cuprate phases related to high temperature \nsuperconducting systems for possible use as SOFC cathodes.  \nPrior research in this area by Fletcher et al. has investigated the use of YBa2Cu3O7-y, a \nsuperconductor below 93K, as a possible cathode material for SOFCs [1]. However, the \nresults showed that the material experienced a number of problems. At raised \ntemperatures (>900oC) there was significant degradation of the structure including \n 4 \ndecomposition and a reaction with YSZ. There was also electrochemical decomposition \nat fairly low current densities (20 mAcm-2) [1]. This compound has two copper sites, one \nsite (Cu2) associated with the superconducting CuO2 layers, and a second site (Cu1) \nwhich links these layers along the c direction (figure 1). The main stability problem is \nlocated at the Cu1 site. In the fully oxidised material, y ≈ 0, this Cu atom is in square \nplanar coordination. If the material is reduced at high temperatures in an inert atmosphere \n(such as Ar or N2) oxygen is lost reducing this Cu to Cu1+ with linear coordination. \nFurther reduction at higher temperatures leads then to decomposition of the sample. In \norder to minimise or remove this instability, the Cu at the Cu1 site can be either partially \nor completely replaced by other cations, ranging from Al, Ga, to transition metals, and \neven oxyanions (SO42-, BO33-). Co-substitution of Sr for Ba has the effect of improving \nthe thermal stability. Phases of the form YSr2Cu3-xMxO7-y (M=Ga, Al, Co, Fe, S, P, B) [2-\n9] can thus be prepared, two examples being YSr2Cu2CoO7+y and YSr2Cu2FeO7+y. \nPrevious structural work on the  Fe containing system, YSr2Cu2FeO7+y, has shown that \nalthough Fe exhibits a preference for substitution onto the Cu1 site, this is not complete \nand a small amount of Fe does enter the Cu2 site. In addition this material also contains \noxygen excess, y≈0.4-0.5, as prepared, with this “excess” oxygen going into normally \nunoccupied positions around the Fe in the Cu1 sites, raising the coordination for some of \nthe Fe atoms from 4 to 5\/6 coordination (figure 2) [3]. Recent reports have suggested that \nannealing at high temperature under N2 can lead to a redistribution of Fe, so that all the \nFe occupies the Cu1 site [10]. Such samples are then superconducting after subsequent \nlow temperature oxidation. \n 5 \nIn the case of YSr2Cu2CoO7+y previous structural studies have shown that y≈0, and all the \nCo is located on the Cu1 site with tetrahedral coordination, leading to cooperative oxygen \nordering and an expanded √2a x √2b x 2c cell (figure 3) [4,5]. \nAlthough these phases have been known for several years, studies of their high \ntemperature conductivity have been lacking. In a previous paper, we reported preliminary \nconductivity studies of these phases [11], and in this paper we expand this work with \ndetailed studies of the evolution of their structures and conductivities with temperature \nand p(O2), in order to evaluate their potential as SOFC cathode materials. \nIn addition to measuring the conductivity characteristics of these materials, chemical \ncompatibility of these phases with SOFC electrolyte materials has also been investigated. \nFollowing results of these compatibility studies, the conductivities of the \"fluorite- block\" \nphases Y1.5Ce0.5Sr2Cu2.5M0.5O9+y (M=Co, Fe) have also been investigated and are \nreported here. \n \nExperimental \n \nHigh purity Y2O3, SrCO3, CuO, Fe2O3, Co3O4 were used to prepare the samples \nYSr2Cu2MO7+y (M=Co, Fe). The starting materials were ground in the stoichiometric \nratios and heated to 1000°C for 16 hours. The powders were then reground and reheated \nunder the same conditions. Sample purity was examined using X-ray diffraction (Seifert \nXRD3003TT diffractometer). High temperature X-ray diffraction data were collected on \na Siemens D5005 diffractometer  with an Anton  Parr HTK 1200 heating stage. \n 6 \nThermal expansion measurements were performed using a Linseis L76 dilatometer \n(heating rate 5°C\/min  to 900°C) \nOxygen contents were determined by thermogravimetric analysis (reduction \n(5%H2\/95%N2) at 950°C) using a Stanton Redcroft STA 780 thermal analyser. The \nmethod was also used to investigate oxygen loss within the samples on heating between \n25 and 900°C (heating rate 10°C\/min, held at 900°C for 20 min) in both air and N2. \nConductivity measurements were made using the standard four probe d.c. technique. \nSintered pellets were prepared by pressing at 6000 kg cm-2 and sintering at 1000°C for 16 \nhours. Densities of 80-84% of the theoretical were obtained using these conditions. \nConductivity measurements were then taken in air as a function of temperature (25-\n900°C). Measurements of the conductivity versus oxygen partial pressure (measured via \na YSZ sensor) were made at a temperature of 900°C. For these measurements, the \nconductivities were initially taken in moving from oxidising to reducing conditions, \nwhere nitrogen was allowed to pass into the system. In this case the change in p(O2) \nproceeds quite rapidly (0.2-10-5 atm. in about 1 hour). The sample was then held under a \nN2 atmosphere for at least 15 hours, in order for the system under test to reach \nequilibration, prior to any measurements being taken in the reverse direction (from \nreducing to oxidising). The N2 flow was then turned off, and oxygen was allowed to leak \nback into the system naturally. This typically took a period of approximately 24 hours, \nwith measurements made over this time. Sample purity before and after measurement \nwas confirmed using X-ray diffraction.  \nThe chemical compatability of the phases YSr2Cu2MO7+y (M=Co, Fe) with potential solid \noxide fuel cell electrolytes was examined by grinding together the sample and electrolyte \n 7 \nin a 1:1 by mass ratio and heating at temperatures between 900 and 1000°C for 1-3 \nweeks. A range of potential solid oxide fuel cell electrolytes were examined to include \nyttria stabilised zirconia Y0.15Zr0.85O1.925 (YSZ), gadolinia doped ceria Gd0.1Ce0.9O1.95 \n(CGO), La0.9Sr0.1Ga0.8Mg0.2O2.85, and Apatite-type La9.33(Si\/Ge)6O26. \n \nResults and Discussion \n \nX-ray diffraction showed the successful synthesis of single phase samples of both \nYSr2Cu2FeO7+y and YSr2Cu2CoO7+y. The oxygen contents determined from TGA studies \nwere 7.42(4) for YSr2Cu2FeO7+y and 7.03(4) for YSr2Cu2CoO7+y consistent with previous \nstudies of these phases [3-5]. In the case of YSr2Cu2CoO7+y,  no measureable oxygen loss \nwas observed in air or N2 between 25 and 900ºC. In contrast, YSr2Cu2FeO7+y showed \nsignificant oxygen loss, with the oxygen content in air decreasing to 7.19(4) at 900ºC, \nwhile heating in N2 resulted in a greater mass loss to 7.03(4) at 900ºC. \n \nConductivity studies \n \nThe conductivities of both samples showed a decrease with decreasing oxygen partial \npressure, indicating that these materials are p-type conductors. The data showed \nsignificant hysteresis between measurements on reducing and then re-oxidising (figure \n4). This hysteresis suggests slow equilibration between the sample and the atmosphere, \nwhich is indicative of poor oxide ion transport, poor oxygen surface exchange kinetics, or \nsignificant structural changes on varying p(O2).  \n 8 \nThe poor equilibration meant that it was not possible to calculate accurate gradients for \nthe plots of log σ vs log p(O2) to relate to defect equations. Attempts were made to \nprepare more porous pellets by sintering at lower temperatures (900ºC) in order to \nimprove the equilibration, however such samples proved to be very brittle in nature, \nmaking measurement very difficult.  \nAlthough the poor equilibration meant that detailed conductivity versus p(O2) data could \nnot be interpreted, an average gradient could, however, be determined from the two end \npoints (0.2, ≈10-5 atm.) of the graph, since at these two data points the samples were well \nequilibrated. From these points, it was clear that the p(O2) dependence of the conductivity \nof YSr2Cu2FeO7+x was much greater than that of YSr2Cu2CoO7+y, with approximate \ngradients of 0.37 and 0.08 respectively. The origin of this increased p(O2) dependence \ncould be related to two factors. Firstly TGA data indicates that there is a large change in \noxygen stoichiometry in YSr2Cu2FeO7+y on changing from air to N2, with oxygen \ncontents of 7.19(4) and 7.03(4) in air and N2 respectively at 900ºC. This significant \ndecrease in oxygen content would lead to a significant decrease in the number of charge \ncarriers, and corresponding decrease in conductivity. In contrast negligible change in \noxygen content was observed for YSr2Cu2CoO7+y. A second factor influencing the p(O2) \ndependance could be a redistribution of Fe over the two Cu sites under N2, with an \nincrease in Fe occupancy of the Cu1 site and consequent decrease in the occupancy at the \nCu2 site, as suggested previously in the literature [10]. If redistribution of Fe over the two \nCu sites is occurring under the experimental conditions employed, then this could also \nhelp to explain the large hysteresis observed between conductivity data on reducing and \nre-oxidising, since such a redistribution of Fe is likely to be a slow process. \n 9 \nThe variation of the conductivity with temperature in air was also examined for both \nsamples. This data showed some interesting variations (figure 5). Firstly the conductivity \nof YSr2Cu2FeO7+y shows semiconducting behaviour up to ≈550°C, before a gradual \ndecrease in conductivity is observed as the temperature is raised (σ550°C= 35 Scm-1, \nσ900°C= 6 Scm-1). This decrease in conductivity at higher temperatures can be related to \noxygen loss reducing the number of charge carriers (from TGA studies, the oxygen \ncontents in air at 25ºC and 900ºC are 7.42(4) and 7.19(4) respectively). The oxygen \nexcess and consequent variable valency for YSr2Cu2FeO7+y explains why the room \ntemperature conductivity is significantly higher than for the nominally oxygen \nstoichiometric YSr2Cu2CoO7+y.  \nIn order to investigate the evolution of structure with temperature, X-ray diffraction data \nwere collected up to 950ºC, and cell parameters were refined (figure 6). The data showed \nno change in cell symmetry over the range of temperatures employed, with the cell being \ntetragonal over the full range. However, it is clear from the data that the variation of cell \nparameters with temperature is non-linear, especially for the a,b parameters, which can be \nattributed to the observed oxygen loss on heating to high temperature. This non-linear \nthermal expansion was also shown from dilatometry studies (figure 7), with the thermal \nexpansion coefficient increasing from 13.0 x 10-6 K-1 to 17.3 x 10-6 K-1 between 400 and \n900ºC. The thermal expansion coefficient at high temperatures is significantly higher \nthan those of fuel cell electrolyte materials such as YSZ (≈10.5 x 10-6 K-1), which \nrepresents an additional problem with employing this material in SOFC applications. \nIn the case of YSr2Cu2CoO7+y, the variation in conductivity with temperature was \nparticularly interesting. Here the sample showed semiconducting behaviour for the whole \n 10 \ntemperature range examined. However, a small but significant step increase in the \nconductivity was observed above 800°C. In order to investigate this further, high \ntemperature XRD data were collected as for YSr2Cu2FeO7+y, and cell parameters refined \n(figure 8). Whereas there was no change in cell symmetry from 25-950ºC for \nYSr2Cu2FeO7+y, the data for YSr2Cu2CoO7+y showed a clear change in symmetry from \northorhombic to tetragonal at high temperature. The transition occurs at a similar \ntemperature to that observed for the increase in conductivity from the conductivity data. \nAccompanying the transition is a significant reduction in the c axis length, and overall \nreduction in cell volume. The unit cell contraction at the phase transition was confirmed \nfrom dilatometry (figure 9). Above the phase transition the thermal expansion coefficient \nwas      ≈13.0 x 10-6 K-1, while below it is ≈12.3 x 10-6 K-1. These values are closer to that \nof YSZ than for YSr2Cu2FeO7+x, although the phase change and accompanying volume \ncontraction would potentially cause problems in applications as SOFC cathodes, e.g. it \nmay result in delamination of the cathode layer.  \nAs regards the effect of this structural transition on the conductivity, it is possible that the \nsignificant contraction along c could be accompanied by a redistribution of charge \nbetween the Cu and Co sites. Such a redistribution of charge could then account for the \nobserved small but significant step increase in conductivity. Further detailed studies by \nneutron diffraction are required to investigate this transition in more detail. \n \nChemical compatibility studies \n \n 11 \nChemical compatibility studies were performed between these samples and potential \nSOFC electrolytes, since in SOFC operation, any reaction may lead to potential problems \nat the interface between the electrolyte and electrode. Initial studies were carried out at \n900ºC, and these were then repeated at a temperature of 1000ºC. In all cases, the studies \nshowed significant reaction, which would be likely to cause problems in the use of these \nmaterials as SOFC cathodes. In the case of YSZ, reaction gave rise to the formation of  \nSrZrO3 impurity after heating for a period of 1 week at 900ºC. Since SrZrO3 is \nelectrically insulating, the formation of this phase at the interface between electrolyte and \ncathode would present a major problem. It therefore seems as if these materials are not \nsuitable for use with YSZ electrolytes at high temperatures (900ºC or above). It may be \npossible to use these materials with YSZ electrolytes at lower temperatures, although \nheating for a short time at elevated temperatures is likely to be required to ensure bonding \nto the electrolyte. \nIn the case of the perovskite-type electrolyte La0.9Sr0.1Ga0.8Mg0.2O2.85, there was no \nobvious reaction with the cuprate materials after heating for 1 week at 900ºC. Significant \nreaction was only observed when the mixtures were heated for two weeks at 1000ºC. \nUnder such conditions, the XRD data suggested the formation of mixed perovskite phase \nimpurities, (La\/Sr)(Cu\/M)O3-y (M=Co, Fe, Ga), and Y2Cu2O5. \nImpurity phases were also formed on heating the cuprate phases with apatite-type \nmaterials, La9.33(Si\/Ge)6O26. In these cases heating at 1000ºC suggested the formation of \n(La\/Sr)2CuO4-y, as well as other unidentified phases. In addition, the XRD peaks for the \napatite electrolyte were shown to shift slightly to lower angles, suggesting incorporation \nof Co, Fe into the apatite structure. Previous studies of apatite electrolytes have shown \n 12 \nthat Fe and Co can substitute onto the Si site in such phases leading to an expansion of \nthe unit cell [12, 13]. \nIn the case of CeO2 based electrolytes (CGO), there was no obvious reaction at 900ºC, \nalthough at higher temperatures, 1000ºC, reaction gave rise to the formation of the \n\"fluorite block\" phases (Y\/Ce)2Sr2Cu3-xMxO9+y (M=Co, Fe). As these phases are likely to \nbe conducting, this reaction with CeO2 based electrolytes may be less of a problem \ncompared to the products formed with the other electrolytes examined. In order to \nconfirm the conducting nature of these phases, the preparation of two samples \nY1.5Ce0.5Sr2Cu2FeO9+y and Y1.5Ce0.5Sr2Cu2CoO9+y was attempted, although initial \nattempts to prepare such phases resulted in small impurities. As a result, phases with \nlower Co, Fe content, (Y\/Ce)2Sr2Cu2.5M0.5O9+y (M=Co, Fe), were prepared, and were \nshown to be single phase, with cell parameters of a=b=3.823(2), c=28.34(2) Å (M=Co) \nand a=b=3.813(5), c=28.40(3) Å (M=Fe). The conductivities of these samples were then \nexamined  with varying temperature and p(O2).  \nThese conductivity data are shown in figures 10 and 11. The low temperature \nconductivities were significantly higher than observed for either YSr2Cu2CoO7+y or \nYSr2Cu2FeO7+y (figure 9). This can be explained by the replacement of Y3+ by a \n(Y1.5Ce0.5O2)2.5+ unit, the lower charge for the latter giving rise to oxidation of the CuO2 \nplanes and an increase in conductivity. As for the YSr2Cu2MO7+y samples, significant \nhysteresis between conductivity data on reducing and re-oxidising was observed (figure \n11). In addition both samples showed a large average gradient of conductivity versus \np(O2), 0.33 for M=Co, and 0.44 for M=Fe. Further high temperature studies are required \nto look into these features in more detail. Nevertheless the high conductivities observed \n 13 \nfor these phases may suggest that the reactivity between YSr2Cu2MO7+y and CeO2 based \nelectrolytes is not as large a problem as for the other electrolytes. \n  \nConclusions \nIn conclusion the cuprate systems, YSr2Cu2MO7+y (M=Co, Fe), have been investigated as \npossible cathode materials for SOFCs, with the data suggesting significant problems with \nthese materials for such applications. The examination of the conductivity with varying \np(O2) shows significant hysteresis between the data obtained on reducing and that \nobtained on re-oxidising. This suggests that the samples show slow oxygen \ntransport\/surface exchange or significant structural changes on varying p(O2). In addition \nto the observed hysteresis, the samples show significant reactivity with a range of SOFC \nelectrolyte materials at elevated temperatures. However, in some cases (e.g. CeO2 based \nelectrolytes) the reaction products showed good conductivities, which may indicate this \nto be less of a problem. \nThe variation of conductivities with temperature showed some interesting features, in \nparticular for YSr2Cu2CoO7+y, for which an increase in conductivity above 800ºC was \nattributed to an orthorhombic-tetragonal phase transition, accompanied by a reduction in \ncell volume. \n \nAcknowledgements \n \nWe would like to thank EPSRC and Merck Ltd for funding \n \n 14 \nReferences \n \n1. J.G. Fletcher, J.T.S. Irvine, A.R. West, J.A. Labrinca, J.R. Frade, F.M.B. Marques; \nMater. Res. Bull. 29 (1994) 1175. \n2. P.R. Slater and C. Greaves; Physica C 180 (1991) 299. \n3. T. Den and T. Kobayashi; Physica C 196 (1992) 141. \n4. G. Roth, P. Adelmann, G. Heger, R. Knitter, T. Wolf; J. Phys. 1 (1991) 721. \n5. S.A. Sunshine, L.F. Schneemeyer, T. Siegrist, D.C. Douglas, J.V. Waszczak, R.J. \nCava, E.M. Gyorgy, D.W. Murphy; Chem. Mater. 1 (1989) 331. \n6. L.E. Moran, R. Rojas, M.A. Alario-Franco; J. Mater. Chem. 6 (1996) 1517. \n7. P.R. Slater and C. Greaves; Physica C 215 (1993) 191. \n8. P.R. Slater, C. Greaves, M. Slaski, C.M. Muirhead; Physica C 208 (1993) 193. \n9. J.Q. Li, W.J. Zhu, Z.X. Zhao, D.L. Yin; Solid State Commun. 85 (1993) 739. \n10. J. Shimoyama, K. Otzschi, T. Himouchi, K. Kishio, Physica C 341 (2000) 563. \n11. J.E.H. Sansom, H.A. Rudge-Pickard, G. Smith, P.R. Slater, M.S. Islam; Solid State \nIonics 175 (2004) 99. \n12. J. McFarlane, S. Barth, M. Swaffer, J.E.H. Sansom, P.R. Slater, Ionics 8 (2002) 149. \n13. A.L. Shaula, V.V. Kharton, M.V. Patrakeev, J.C. Waerenborgh, D.P. Rojas, N.P. \nVyshatko, E.V. Tsipis, A.A. Yaremchenko, F.M.B. Marques; Mater. Res. Bull. 39, \n(2004) 763. \n \n 15 \nFigure captions \n \nFigure 1. The structure of YBa2Cu3O7-x \nFigure 2. The structure of YSr2Cu2FeO7+y \nFigure 3. The structure of YSr2Cu2CoO7 \nFigure 4. Plot of log σ vs log p(O2) at 900°C for (a) YSr2Cu2CoO7+y , (b) YSr2Cu2FeO7+y \nFigure 5. Plot of log σ\n \n vs 1\/T for (a) YSr2Cu2FeO7+y, (b) YSr2Cu2CoO7+y \nFigure 6a. Plot of cell parameters vs temperature for YSr2Cu2FeO7+y \nFigure 6b. Plot of cell volume vs temperature for YSr2Cu2FeO7+y (connecting lines drawn \nas a guide to the eye). \nFigure 7. Plot of thermal expansion of YSr2Cu2FeO7+y \nFigure 8a. Plot of cell parameters vs temperature for YSr2Cu2CoO7+y \nFigure 8b. Plot of cell volume vs temperature for YSr2Cu2CoO7+y \nFigure 9. Plot of thermal expansion of YSr2Cu2CoO7+y \nFigure 10. Plot of log σ vs log p(O2) at 900°C for (a) Y1.5Ce0.5Sr2Cu2.5Co0.5O9+y , (b) \nY1.5Ce0.5Sr2Cu2.5Fe0.5O9+y \nFigure 11. Plot of log σ\n \nvs 1\/T for (a) Y1.5Ce0.5Sr2Cu2.5Co0.5O9+y , (b) \nY1.5Ce0.5Sr2Cu2.5Fe0.5O9+y \n \n \n \n \n \n 16 \n \n \n \n \n \n   \n \n \n \n \nFigure 1. The structure of YBa2Cu3O7-x  \nCu1 \nCu2 \nY \nBa \n 17 \n \n \n \nFigure 2. The structure of YSr2Cu2FeO7+y\nCu\/Fe1 \nCu\/Fe2 \nY \nSr \nPartially occupied O sites \n 18 \n  \n  \n \n \n \nFigure 3. The structure of YSr2Cu2CoO7 \n \nCu \nCo \nSr \nY \n 19 \n-0.8\n-0.4\n0\n0.4\n0.8\n1.2\n-5.5 -4.5 -3.5 -2.5 -1.5 -0.5\nlog (p (O2) \/ atm)\nlo\ng \n \n( σσ σσ\n \n\/ S\n \ncm\n-\n1 )\nReducing\nOxidising\nReducing\nOxidising\n(a)\n(b)\n \n \nFigure 4. Plot of log σ vs log p(O2) at 900°C for (a) YSr2Cu2CoO7+y , (b) YSr2Cu2FeO7+y \n 20 \n \nFigure 5. Plot of log σ\n \n vs 1\/T for (a) YSr2Cu2FeO7+y, (b) YSr2Cu2CoO7+y \n0.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\n1.6\n1.8\n0.0005 0.0015 0.0025 0.0035\n1\/T (K)\nLo\ng \n( σσ σσ\n \n\/ S\n \ncm\n-\n1 )\n(a)\n(b)\n 21 \nFigure 6a. Plot of cell parameters vs temperature for YSr2Cu2FeO7+y \n \nFigure 6b. Plot of cell volume vs temperature for YSr2Cu2FeO7+y \n166\n167\n168\n169\n170\n171\n172\n173\n174\n175\n176\n0 200 400 600 800 1000\nTemp (ºC)\nCe\nll \nVo\nlu\nm\ne \n(Å\n3 )\n3.83\n3.84\n3.85\n3.86\n3.87\n3.88\n3.89\n0 200 400 600 800 1000\nTemp (ºC)\nLa\ntti\nce\n \nPa\nra\nm\ne\nte\nr \na\n \n(Å\n)\n11.35\n11.4\n11.45\n11.5\n11.55\n11.6\n11.65\nLa\ntti\nce\n \nPa\nra\nm\ne\nte\nr \nc \n(Å\n)\na\nc\n 22 \n0\n20\n40\n60\n80\n100\n120\n140\n160\n100 300 500 700 900\nTemperature \/ oC\nδδ δδ\n \nLe\nn\ngt\nh \n\/ µµ µµ\nm\n \n \nFigure 7. Plot of thermal expansion of YSr2Cu2FeO7+y \n 23 \nFigure 8a. Plot of cell parameters vs temperature for YSr2Cu2CoO7+y \n \n \nFigure 8b. Plot of cell volume vs temperature for YSr2Cu2CoO7+y \n \n \n5.4\n5.42\n5.44\n5.46\n5.48\n5.5\n5.52\n5.54\n0 200 400 600 800 1000\nTemp (°C)\nLa\ntti\nce\n \npa\nra\nm\ne\nte\nr \na\n,\nb \n(Å\n)\n22.75\n22.8\n22.85\n22.9\n22.95\n23\n23.05\n23.1\n23.15\nLa\ntti\nce\n \npa\nra\nm\nte\nr \nc \n(Å\n)\nb\na\nc\n670\n675\n680\n685\n690\n695\n700\n705\n0 200 400 600 800 1000\nTemp (ºC)\nCe\nll V\no\nl (Å\n3 )\n 24 \n0\n10\n20\n30\n40\n50\n60\n70\n80\n100 200 300 400 500 600 700 800 900\nTemperature \/ oC\nδδ δδ\n \nLe\nn\ngt\nh \n\/ µµ µµ\nm\n \n \nFigure 9. Plot of thermal expansion of YSr2Cu2CoO7+y \n 25 \n \n-1\n-0.5\n0\n0.5\n1\n-5 -4 -3 -2 -1 0\nlog p (O2) \/ atm\nlo\ng \nσσ σσ\n \n\/ S\n \ncm\n-\n1\n(a)\nReducing\nOxidising\n(b)\n \n \nFigure 10. Plot of log σ vs log p(O2) at 900°C for (a) Y1.5Ce0.5Sr2Cu2.5Co0.5O9+y , (b) \nY1.5Ce0.5Sr2Cu2.5Fe0.5O9+y \n \n 26 \n0.7\n0.9\n1.1\n1.3\n1.5\n1.7\n1.9\n0.0008 0.0013 0.0018 0.0023\n1 \/ T (K)\nLo\ng \n( σ\n \/\n \nσ\n \/\n \nσ\n \/\n \nσ\n \/\n S\n \nc\nm\n-\n1 )\n(a)\n(b)\n \n \nFigure 11. Plot of log σ\n \nvs 1\/T for (a) Y1.5Ce0.5Sr2Cu2.5Co0.5O9+y , (b) \nY1.5Ce0.5Sr2Cu2.5Fe0.5O9+y \n \n 27 \n \n"}