{"doi":"10.1111\/j.1420-9101.2008.01600.x","coreId":"63384","oai":"oai:nora.nerc.ac.uk:7872","identifiers":["oai:nora.nerc.ac.uk:7872","10.1111\/j.1420-9101.2008.01600.x"],"title":"Macroevolutionary patterns in the origin of mutualisms involving ants","authors":["Oliver, T.H.","Leather, S.R.","Cook, J.M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":"Ants are a diverse and abundant insect group that form mutualistic associations with a number of different organisms from fungi to insects and plants. Here we use a phylogenetic approach to identify ecological factors that explain macroevolutionary trends in the mutualism between ants and honeydew-producing Homoptera. We also consider association between ant-Homoptera, ant-fungi and ant-plant mutualisms. Homoptera-tending ants are more likely to be forest dwelling, polygynous, ecologically dominant and arboreal nesting with large colonies of 10^4 – 10^5 individuals. Mutualistic ants (including those that garden fungi and inhabit ant-plants) are found in under half of the formicid subfamilies. At the genus level, however, we find a negative association between ant-Homoptera and ant-fungi mutualisms, while there is a positive association between ant-Homoptera and ant-plant mutualisms. We suggest that species can only specialise in multiple mutualisms simultaneously when there is no trade-off in requirements from the different partners and no redundancy of rewards","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/63384.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/7872\/1\/N007872PP.pdf","pdfHashValue":"6ef2ea1ddfa03a6cd69ace8c6ea3447cd78d345b","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:7872<\/identifier><datestamp>\n      2012-11-22T12:04:42Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D5335<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/7872\/<\/dc:relation><dc:title>\n        Macroevolutionary patterns in the origin of mutualisms involving ants<\/dc:title><dc:creator>\n        Oliver, T.H.<\/dc:creator><dc:creator>\n        Leather, S.R.<\/dc:creator><dc:creator>\n        Cook, J.M.<\/dc:creator><dc:subject>\n        Biology and Microbiology<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        Ants are a diverse and abundant insect group that form mutualistic associations with a number of different organisms from fungi to insects and plants. Here we use a phylogenetic approach to identify ecological factors that explain macroevolutionary trends in the mutualism between ants and honeydew-producing Homoptera. We also consider association between ant-Homoptera, ant-fungi and ant-plant mutualisms. Homoptera-tending ants are more likely to be forest dwelling, polygynous, ecologically dominant and arboreal nesting with large colonies of 10^4 – 10^5 individuals. Mutualistic ants (including those that garden fungi and inhabit ant-plants) are found in under half of the formicid subfamilies. At the genus level, however, we find a negative association between ant-Homoptera and ant-fungi mutualisms, while there is a positive association between ant-Homoptera and ant-plant mutualisms. We suggest that species can only specialise in multiple mutualisms simultaneously when there is no trade-off in requirements from the different partners and no redundancy of rewards.<\/dc:description><dc:date>\n        2008<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/7872\/1\/N007872PP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Oliver, T.H.; Leather, S.R.; Cook, J.M..  2008  Macroevolutionary patterns in the origin of mutualisms involving ants.   Journal of Evolutionary Biology,  21 (6). 1597-1608.  https:\/\/doi.org\/10.1111\/j.1420-9101.2008.01600.x <https:\/\/doi.org\/10.1111\/j.1420-9101.2008.01600.x>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www3.interscience.wiley.com\/journal\/121392618\/abstract<\/dc:relation><dc:relation>\n        10.1111\/j.1420-9101.2008.01600.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/7872\/","http:\/\/www3.interscience.wiley.com\/journal\/121392618\/abstract","10.1111\/j.1420-9101.2008.01600.x"],"year":2008,"topics":["Biology and Microbiology","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \n \n \nArticle (refereed) \n \n \n \nOliver, T.H.; Leather, S.R.; Cook, J.M.. 2008 \nMacroevolutionary patterns in the origin of mutualisms \ninvolving ants. Journal of Evolutionary Biology, 21 (6). \n1597-1608. 10.1111\/j.1420-9101.2008.01600.x\n \n \n \n \n© 2008 \n \nThis version available http:\/\/nora.nerc.ac.uk\/7872\/  \n \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the journal \narticle, incorporating any revisions agreed during the peer review \nprocess. Some differences between this and the publisher’s version \nremain. You are advised to consult the publisher’s version if you wish \nto cite from this article. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnora@ceh.ac.uk\n \n \n \nThe NERC and CEH  trade marks and logos (‘the Trademarks’) are registered trademarks of NERC in the UK and \nother countries, and may not be used without the prior written consent of the Trademark owner. \n  - 1 - \n \nMacroevolutionary patterns in the origin of mutualisms 1 \ninvolving ants 2 \n 3 \nThomas H Oliver1§, Simon R Leather1 , James M Cook2 4 \n1 Centre for Ecology and Hydrology, Biological Records Centre, Maclean Building, 5 \nBenson Lane, Crowmarsh Gifford, Wallingford, Oxfordshire, OX10 8BB, UK. 6 \n2 Division of Biology, Imperial College, Silwood Park, Buckhurst Rd, Ascot, SL5 7PY, 7 \nUK. 8 \n3 School of Biological Sciences, University of Reading, RG6 6AS, UK. 9 \n 10 \n§Corresponding author 11 \nTom Oliver  12 \nTelephone:  00 44 207 5942534 13 \n 14 \nEmail addresses: 15 \nTHO: toliver@ceh.ac.uk 16 \nJMC: james.cook@reading.ac.uk 17 \nSRL: s.leather@ic.ac.uk 18 \nRunning title: Macroevolutionary patterns in ant mutualisms 19 \n 20 \n 21 \n 22 \n 23 \n  - 2 - \n \nAbstract 1 \n 2 \nAnts are a diverse and abundant insect group that form mutualistic associations with a 3 \nnumber of different organisms from fungi to insects and plants. Here we use a 4 \nphylogenetic approach to identify ecological factors that explain macroevolutionary 5 \ntrends in the mutualism between ants and honeydew-producing Homoptera. We also 6 \nconsider association between ant-Homoptera, ant-fungi and ant-plant mutualisms. 7 \nHomoptera-tending ants are more likely to be forest dwelling, polygynous, ecologically 8 \ndominant and arboreal nesting with large colonies of 104 – 105 individuals. Mutualistic 9 \nants (including those that garden fungi and inhabit ant-plants) are found in under half of 10 \nthe formicid subfamilies. At the genus level, however, we find a negative association 11 \nbetween ant-Homoptera and ant-fungi mutualisms, while there is a positive association 12 \nbetween ant-Homoptera and ant-plant mutualisms. We suggest that species can only 13 \nspecialise in multiple mutualisms simultaneously when there is no trade-off in 14 \nrequirements from the different partners and no redundancy of rewards. 15 \n 16 \n 17 \nKeywords: mutualism, Formicidae, Homoptera, myrmecophiles, species interactions, 18 \ndominant ants, coevolution. 19 \n 20 \n 21 \n 22 \n 23 \n 24 \n  - 3 - \n \nIntroduction 1 \nMutualisms are common, fundamental interactions shaping species’ communities and, 2 \nthrough coevolutionary adaptation, even changing species themselves (Herre et al., 3 \n1999). Within a family that contains mixtures of mutualistic and non-mutualistic 4 \nspecies we can identify ecological factors that are associated with mutualism. These 5 \nfactors may be preadaptations that predispose a lineage to mutualism or they may be the 6 \nselective consequences of mutualistic coevolution. Mutualisms are not always stable 7 \nover evolutionary time and may be lost and gained repeatedly (Sachs & Simms, 2006). 8 \nIf a clade is involved in several different types of mutualism, these mutualisms may be 9 \npositively or negatively associated or show no association at all. 10 \n      The ants (Family: Formicidae) engage in a broad range of mutualistic interactions 11 \nwith many different organisms including plants, insects and fungi (Hölldobler & 12 \nWilson, 1990). This diversity of mutualistic interaction may reflect the widespread 13 \nabundance and ecological dominance of ants. Alternatively, perhaps they are ideal 14 \nmutualistic partners because, compared with solitary living species, ant colonies are 15 \nable to provide a more efficient, non-localised defence for vulnerable species. Not all 16 \nants are involved in mutualisms, however. By comparing the ecology of mutualistic 17 \nversus non-mutualistic ant taxa, we are able to characterise ecological traits that are 18 \nassociated with mutualism. This allows insight into the origin of these mutualisms and 19 \ncan also lead to speculation over how mutualisms can shape species. In this study we 20 \nfocus primarily on the mutualism between ants and Homoptera (aphids, scales etc.). We 21 \nconsider how various ecological traits correlate with the occurrence of this mutualism 22 \nin ant genera. In addition, we compare how the ant- Homoptera mutualism is associated 23 \nwith mutualisms between ants and other organisms. 24 \n      Many ants are well known to tend Homoptera for their sugary ‘honeydew’; a 25 \n  - 4 - \n \nprocess known as trophobiosis. In addition, ants also visit lycaenid butterfly larvae and 1 \nthe extrafloral nectaries of some plants to collect sugary secretions. These excretions\/ 2 \nsecretions contain a variety of amino acids and carbohydrates which ant colonies use to 3 \nfuel foraging activity and feed developing brood.  In return ants provide a wide range of 4 \nbenefits to their partners including protection from predators and parasites (Jones, 5 \n1929, Stadler & Dixon, 2005), shelter (Way, 1963), transport (Collins & Leather, 2002) 6 \nand reduction of pathogen contamination (Fokkema et al., 1983, Way, 1954). The 7 \nmutualism between ants and Homoptera is economically important because Homoptera 8 \nare major agricultural pests worldwide and ants are ecologically dominant organisms 9 \nhaving widespread impacts on the community structure (Wimp & Whitham, 2001) and 10 \nnutrient cycling of ecosystems (Folgarait, 1998). There is broad diversity in the degree 11 \nof association between aphids and ants. For example, one aphid species may often be 12 \ntended by ants while a congener is not (Stadler & Dixon, 2005). Also, different aphids 13 \nsharing the same host plant may differ in their degree of trophobiosis with ants 14 \n(Bristow, 1991). A wide range of explanations have been suggested for the variation in 15 \ntrophobiosis in ant-aphid interactions; however, it is useful to distinguish between 16 \nfactors that promote variation in trophobiosis within species (i.e. across populations) 17 \nand those that cause differences between species. Within a single aphid species there 18 \nmay be spatial and temporal variation in the degree of ant tending. Similarly, there will 19 \nbe differences between ant colonies in their investment in Homoptera. This variation 20 \nacross populations is characteristic of facultative mutualisms where both partners can 21 \nsurvive alone and do not exclusively require interspecific association. Obligate 22 \nmutualisms, in contrast, always find the two partner species in association. The 23 \nmajority of ant-aphid and ant-lycaenid relationships are thought to be facultative 24 \n(Bristow, 1991, Pierce et al., 2002).  25 \n  - 5 - \n \n      Population level variation in trophobiosis between ants and aphids can be  1 \nsatisfactorily explained by two hypotheses. One is that, although relationships may be 2 \nmutually beneficial, ants and aphids are limited in their ability to encounter one 3 \nanother. Ants are not omnipresent and their colony territories do not encompass the 4 \nentire landscape. Similarly, there is no evidence that alate aphid dispersal is directed to 5 \npatches with ants, even though apterous aphid dispersal may be limited by ant 6 \nsemiochemicals (Oliver et al., 2007b). The second explanation is context dependent 7 \nfitness, whereby the costs and benefits of an interspecific association depend on a 8 \nmultitude of biotic and abiotic factors which vary in time and space (Cushman & 9 \nWhitham, 1989). Thus, the net effect of an interaction on each partner may change in 10 \nmagnitude and even sign (Bronstein, 1994, Thompson, 1994). For example, in cases 11 \nwhere costs exceed benefits, aphids will profit from leaving the association with ants. 12 \nThis can be achieved through selection for traits that prevent ant tending e.g. 13 \nsequestering plant toxins in honeydew (Buckley, 1987). If the interaction frequently 14 \nfluctuates between mutualism and parasitism then natural selection can optimise 15 \nbenefits by evolving phenotypically plastic traits that facilitate association only when 16 \nconditions are favourable e.g. increasing honeydew quality in the presence of ants (Yao 17 \n& Akimoto, 2002). A wide variety of ecological factors have been proposed to account 18 \nfor population level variation in ant-aphid interactions including local species 19 \ncomposition and abundance of ants (Horvitz & Douglas, 1984, Oliver et al., 2007a) or 20 \naphids (including competing mutualistic species) (Addicott, 1978); seasonal change in 21 \nant nutritional requirements (Sudd & Sudd, 1983); presence of alternative sugar sources 22 \n(Offenberg, 2001) and host plant quality (Cushman, 1991, Auclair, 1963).  23 \n      Variation in trophobiosis between ant and aphid species, however, can encompass 24 \nadditional explanations. For example, morphological differences between ant species 25 \n  - 6 - \n \nin the development of the proventriculus can affect their ability to gather large 1 \nquantities of honeydew in the crop and thus affect suitability for trophobiosis 2 \n(Davidson et al., 2004). Factors, such as morphological change, operate on 3 \nevolutionary timescales and can shape species level variation. Evolution of third-party 4 \nantagonists can also disrupt mutualisms (Sachs & Simms, 2006). For example, 5 \nspecialised parasitoids may arise which are able to subvert ant defences and because of 6 \nthe enemy free space they find there, develop specially to exploit ant attended aphids 7 \n(Völkl 1992). Furthermore, mutualistic aphids may find themselves in competition with 8 \nother aphids which are attractive to ants (Addicott, 1978, Cushman & Addicott, 1989, 9 \nCushman & Whitham, 1989). Dynamic indirect coevolution (mediated through the ant 10 \nmutualist) may ensue, in order to ‘win’ the attention of ants.  11 \n      Generally, past attention has focused on aphids, with attempts to predict factors that 12 \nexplain their asscociation with ants. Reduced alternative defences, such as cornicles 13 \nreleasing waxy secretions and saltatorial legs for escape, have been hypothesised to 14 \ncharacterise ant attended aphid species, although evidence is equivocal (Bristow, 15 \n1991). Bottom-up effects of the type of host plant may go some way towards explaining 16 \nvariation, with certain plant families (e.g Anacardaceae, 100%) supporting 17 \nconsiderably higher proportions of ant-tended aphids than others (e.g. Fagaceae, 2%) 18 \n(Bristow, 1991). Association with ants could also potentially be limited by aphid 19 \nphylogenetic contraints; however this does not appear to be the case (Bristow, 1991). 20 \nIndeed, there is evidence that association with ants is a highly labile trait that has 21 \nevolved and been lost multiple times in aphids (Shingleton & Stern, 2003). Feeding 22 \nlocation has been shown to predict some variation in ant attendance (Shingleton et al., 23 \n2005). The most comprehensive analysis to date identifies feeding on woody plant 24 \nparts, non- mobile aphids, non- alate adults and aggregated colonies as traits that are 25 \n  - 7 - \n \nsignificantly associated with ant attendance (Stadler et al., 2003).  1 \n      In comparison, there has been little attention given to factors that explain variation 2 \nbetween ant species in their association with aphids. Indeed, it is not even known 3 \nroughly what percentage of ants practice aphid tending. Only one study to date (ant 4 \nproventriculus development (Davidson et al., 2004)), links an ant trait to interspecific 5 \nassociation with trophobionts. The current study addresses this paucity of knowledge 6 \nby identifying several ecological factors that are characteristic of homopteran-tending 7 \nants. We specifically test three a priori hypotheses, two of which have been suggested 8 \nby previous researchers: 9 \n 10 \na) Ecologically dominant and polygynous ants are more likely to monopolise 11 \nresources and thus form close associations with sugar-producing insects  12 \n(Blüthgen et al., 2004, Fiedler, 1991, Eastwood & Fraser, 1999, Davidson, 13 \n1998).  14 \nb) Ant- Homoptera, ant- lycaenid and ant- extrafloral nectary plant mutualisms 15 \nwill be positively associated. Ant species that visit Homoptera and lycaenids 16 \nappear to be a subset of those that visit extrafloral nectaries (Blüthgen et al., 17 \n2004, Fiedler, 2001). Liquid-feeding adaptations in ants may create 18 \nopportunities to engage in all three mutualisms simultaneously. 19 \nc) Fungus gardening will be negatively correlated with trophobiosis because there 20 \nis a trade-off preventing specialisation in two very different types of mutualism. 21 \nIn contrast, there will be a positive association with domatia- bearing plants as 22 \nthese have similar requirements to Homoptera (protection), yet provide 23 \ndifferent rewards. 24 \n  - 8 - \n \nMaterials and methods 1 \nData collection and analysis 2 \nData on the ecological traits of 139 ant genera were collated from primary literature 3 \nsources. The genera selected (139 of a possible 288 extant described genera (Moreau et 4 \nal., 2006)) were those used by Moreau et al. (2006) in a large scale molecular 5 \nphylogeny of the Formicidae. Binary ecological traits (see Table 1) were scored as 6 \npositive if at least one species in the genus showed the trait. A similar approach has 7 \nbeen used by Koh (2004) to model extinction risk in tropical butterflies. An obvious 8 \ncaveat with this approach is that, by chance, large genera are more likely to contain 9 \nspecies with the trait. The sampling effort devoted to a genus may also have a similar 10 \neffect, with the trait more likely to be found for well studied genera. To overcome this, 11 \nwe have included the log number of species in each genus and log sampling effort 12 \n(number of hits on ISI Web of Knowledge) as explanatory variables to account for 13 \nvariation caused by these effects.  14 \n      Most phylogenetic comparative analyses are usually conducted with species-level 15 \ndata, although genus-level data have also been used (Koh et al., 2004). In this case, the 16 \nvery large number of species in the Formicidae (~10,000) (Hölldobler & Wilson, 1990) 17 \nand limited knowledge of many of these species makes any large scale analysis at the 18 \nspecies level impossible. However, although there may exist polymorphism of a trait 19 \nwithin a genus, such polymorphisms at the tips of a phylogenetic tree are a problem for 20 \nany comparative analysis; species are assumed to have a certain trait yet in reality there 21 \nmay be intraspecific variation within the trait. Thus the question is not necessarily 22 \nwhether data is collected at genus level or species level, but rather are the proposed 23 \ntraits truly representive enough of the taxa? Although trait polymorphism within 24 \nterminal taxa may present problems in the reconstruction of ancestral nodes and related 25 \n  - 9 - \n \ncomparative methods that use such an approach e.g. phylogenetically independent 1 \ncontrasts (Felsenstein, 1985), comparative methods that do not rely on ancestral state 2 \nreconstruction, but rather use a correlation matrix to weight non-independence, should 3 \nbe suitable to model such traits. Despite this, for the majority of traits we have tested if 4 \na trait is scored as a positive for a genera then it is likely that most species share the trait. 5 \nThe two traits most likely to have higher degrees of polymorphism within genera are 6 \npolygyny and invasiveness. 7 \n 8 \n      To account for autocorrelation from phylogenetic non-independence we used 9 \ngeneralised estimating equations (GEE), which are similar to the GLS (generalised 10 \nleast squares) approach (Grafen, 1989), except that non-normal errors in response 11 \nvariables can be modelled (Paradis & Claude, 2002). They are suitable for data with 12 \ndiscrete response variables, through the specification of binomial, rather then Gaussian, 13 \nerror structures, and also allow the exploration of interaction effects between 14 \nexplanatory variables (Paradis, 2006, Paradis & Claude, 2002). We tested interaction 15 \neffects chosen only from a priori hypotheses (see Table 2).  16 \n      For GEEs, a phylogeny is required to produce a correlation matrix derived from the 17 \ndistances between terminal taxa in a tree, which is then used to weight variances in a 18 \ngeneralised modelling framework. We used a recent phylogeny of ants resolved to the 19 \ngenus level by Moreau et al. (2006). GEEs were carried out using the ‘compar.gee’ 20 \nfunction in the ‘ape’ package (Paradis et al., 2004) of the program ‘R 2.6.1’ (Ihaka & 21 \nGentleman, 1996, R.Development.Core.Team, 2007). The binary response variable 22 \nwas the occurrence of homopteran tending (trophobiosis) in the genus and thus 23 \nbinomial, rather than Gaussian, errors were specified with either logit or 24 \ncomplementary log-log links, depending on whichever minimised residual variance. 25 \n  - 10 - \n \nComputational iterations often diverged when both species count and sampling effort 1 \nwere included as blocking explanatory variables as these two are highly correlated 2 \n(Pearson’s product moment correlation: t = 8.61, d.f. = 145, p < 0.001). Therefore, only 3 \nsampling effort was included. After testing each potential trait singly for an association 4 \nwith trophobiosis (Table 1), pairwise interactions were tested (Table 2), again with 5 \nsampling effort as a blocking factor.   6 \n 7 \n      In addition to the GEE analysis, we also carried out an additional binary logistic 8 \nregression analysis that does not account for relatedness between taxa. This analysis 9 \nindicates association between ant traits, independent of shared evolutionary history 10 \nbetween taxa, i.e. it simply asks: which traits best describe ant genera that tend aphids? 11 \nIf we then want to ask whether this association implies some kind of causal linkage 12 \nbetween the traits rather than simply association through shared evolutionary history, 13 \nwe can then refer to the GEE analysis that takes phylogenetic non-independence of taxa 14 \ninto account. For the non-phylogenetic comparative analysis, binary logistic 15 \nregressions specified with binomial errors were carried out with sampling effort and 16 \nspecies count as additional explanatory variables.  17 \n      Comparisons of the proportion of ant genera that are nomadic and\/or tend 18 \nHomoptera, and a similar comparison between dominance and trophobiosis were 19 \ncarried out using a binomial test calculating a Chi-squared statistic. The same test was 20 \nused for the comparison between small and large dominant ants for the proportions of 21 \ngenera with certain other ecological traits (Table 5). 22 \n 23 \n 24 \n 25 \n  - 11 - \n \nResults  1 \nTaxonomic distribution 2 \nThirty seven percent of ant genera contained species that engage in trophobiosis with 3 \nHomoptera. The taxonomic distribution was uneven with certain subfamilies more 4 \nlikely to contain mutualistic ant species (deviance = 52.195, d.f. = 18,119, p < 0.001) 5 \n(Fig. 1). At the subfamily level there is a positive association between ant-trophobiont, 6 \nant fungi and ant-plant mutualisms (trophobiont-fungi: dev = 5.99, d.f. = 1,17, p = 7 \n0.014; trophobiont-plant: dev. = 4.11, d.f. = 1,17, p = 0.043; plant-fungi: dev. = 9.84, 8 \nd.f. = 1,17, p = 0.002). Ant-fungi mutualisms always occur in subfamilies that also have 9 \nmutualisms with plants and trophobiotic insects. For fungi, however, this positive 10 \nassociation does not carry down to genus level and the trend becomes reversed (see 11 \nnext section). Over half of ant subfamilies do not engage in any known mutualisms with 12 \nHomoptera, fungi or domatia bearing plants. 13 \nEcological correlates of trophobiosis with Homoptera 14 \nWithout controlling for phylogenetic non-independence there were a number of 15 \necological traits significantly associated with trophobiosis (Table 3). 16 \nHomopteran-tending ants are more likely to be dominant, polygynous, arboreal nesters 17 \nwith large colonies of 104-105 workers. Furthermore, invasive ants and ants that are 18 \nfound in disturbed habitats are more likely to be trophobiotic. There was a positive 19 \nassociation between trophobiosis mutualisms and mutualisms between ants and 20 \ndomatia-bearing plants. Ninety four percent of the ant genera with species that live in 21 \nplant domatia also contain trophobiotic species. In addition, ant-trophobiont and 22 \nant-plant mutualisms also co-occur at species level. For example most Crematogaster 23 \nspecies that inhabit domatia of the ant-plant Macaranga keep scale insects 24 \n(Homoptera) inside the plant chambers (Heckroth et al., 1998).  25 \n  - 12 - \n \n      1 \nUsing the GEE method to account for phylogenetic non-independence, many of these 2 \nsignificant associations drop out (Table 4). This suggests a shared evolutionary history 3 \nis responsible for the association in many of the cases. In contrast, those traits that are 4 \nstill significant after the GEE analysis are likely to have some causal relationship with 5 \ntrophobiosis because across the whole phylogeny they are repeatedly associated on 6 \nmany occasions. These associated traits include the other ‘trophobiosis-like’ 7 \nmutualisms: feeding at extrafloral nectaries and the tending of lycaenid larvae, and also 8 \nfungus gardening (a negative association). Six ant genera contain species that engage in 9 \nsymbiotic mutualism with fungi. Five of these six genera are attine ants (tribe Attini) 10 \nthat grow nutritional fungi in gardens and do not engage in trophobiotic mutualisms 11 \nwith Homoptera. The sixth genus, Lasius (subfamily Formicinae) is somewhat of an 12 \nexception as only one species shares a mutualism with fungi. Lasius fuliginosus 13 \nassociates with an ascomycete fungi which grows in the walls of its carton nests and 14 \nstrengthens them structurally (Hölldobler & Wilson, 1990). Thus, in this trophobiotic 15 \ngenus there is an isolated occurrence of an ant-fungus mutualism, but it is not one in 16 \nwhich ants derive nutrition from fungi.  17 \n     There was a positive association between dominance of ant genera and trophobiosis 18 \n(Table 4). Sixty seven percent of ant genera with ecologically dominant species contain 19 \nhomoptera-tending species, compared with only 23% of genera without ecological 20 \ndominants. Interestingly, a significant association between nomadism and trophobiosis 21 \nalso emerged from the GEE analysis, whilst the effect was only close to significance in 22 \nthe binary logistic regression. Nomadic ants are less likely to tend Homoptera than 23 \nnon-nomadic genera. As with all comparative analyses, we can infer only association, 24 \nnot the direction of causality (nor whether it is direct or mediated through some other 25 \n  - 13 - \n \ntrait); thus, whether these traits are a cause or consequence of trophobiosis is unknown. 1 \nIn the absence of a species level phylogeny (onto which the origin of traits could be 2 \nmore accurately mapped), one crude method to give a suggestion of the direction of 3 \ncausality is to consider the proportions of genera (e.g. nomadic or trophobiotic) in each 4 \ngroup (e.g. trophobionts or nomadic ants, respectively). For example, if becoming 5 \nnomadic tends to cause ants to relinquish trophobiotic relationships then we would 6 \nexpect the majority of nomadic ants to be non-trophobionts (lack of trophobiosis is 7 \nnecessary for nomadism). In contrast, if not tending Homoptera caused ants to live a 8 \nnomadic lifestyle then we would expect most non-trophobiotic ants to become nomadic 9 \n(nomadism is necessary for non-trophobiosis). Considering the data, we find that a 10 \nsignificantly higher proportion of nomadic ants do not tend Homoptera (10\/13, 77%), 11 \ncompared with only a small minority of non-trophobiotic ants that happen to be 12 \nnomadic (10\/84, 12%) (χ2 = 25.2, d.f. = 1, p < 0.001).This suggests that nomadism is a 13 \nprecursor to the loss of the trophobiosis mutualism, and, thus, that relinquishing 14 \ntrophobiosis is a consequence of being nomadic (but with many exceptions to this rule, 15 \nor reversions from trophobiosis after nomadism has developed, because only 77% 16 \nrather than a 100% of nomadic ant genera do not tend Homoptera). A similar 17 \ncomparison for dominance and trophobiosis traits is less conclusive. Sixty two percent 18 \nof trophobiotic ant genera are dominant, compared with 76% of dominant ants that are 19 \ntrophobiotic, the difference being non-significant (χ2 = 1.69, d.f. = 1, p = 0.193). 20 \n 21 \n      Finally, considering potential interaction effects between ecological factors (Table 22 \n2), there was a significant interaction between ecological dominance and mean ant 23 \nbody size on the occurrence of trophobiosis with Homoptera (Binary log. reg.: Dev = 24 \n6.01, d.f. = 1,128, p = 0.014; GEE: t = 4.29, d.f. = 27.0, p < 0.001). Size had a 25 \n  - 14 - \n \nsignificant effect on the occurrence of trophobiosis only in dominant ant genera. The 1 \ndirection of effect was opposite to that predicted, however: dominant ants tending 2 \nHomoptera are on average much smaller than dominants that do not (mean size 3 \ntrophobionts(± SE) =  4.53±  0.14mm, mean size non-trophobionts = 8.20 ± 1.40mm; 4 \nDev = 6.213, d.f. = 1,35, p = 0.013). Thus dominant ants fall into two distinct groups, 5 \nthose that tend Homoptera and those that do not, and several other ecological factors 6 \nalso differ markedly between these two types of ant. Small, dominant ants that tend 7 \nHomoptera are more likely to be polygynous, invasive and thrive in disturbed habitats. 8 \nFurthermore, they are less likely to be nomadic or have polymorphic workers (Table 4).  9 \n     There was no significant interaction between polygyny and colony size on 10 \ntrophobiosis (Binary log. reg: Dev = 1.817, d.f. = 3, 69, p = 0.61; GEE: t =1.163, d.f. = 11 \n15.7, p = 0.284). Finally, consideration of an interaction effect between arboreal nesting 12 \nand latitude was not applicable as there were no arboreal nesting genera that occurred 13 \nonly in temperate regions. For ants found solely in the tropics, 72 % of genera (18 out of 14 \n25) that tended Homoptera nested in trees. For ants found only in temperate zones, zero 15 \nout of nine genera that tended Homoptera nested in trees. 16 \n 17 \nPhylogeny 18 \nThe presence or absence of trophobiosis with Homoptera can be mapped onto a 19 \nphylogeny of the Formicidae (Fig. 2). With data collated at the genus level however, 20 \nancestral state reconstructions can be inaccurate if there is considerable polymorphism 21 \nfor the trait at the species level. Thus Figure 2 is an accurate reflection of the evolution 22 \nof trophobiosis given the assumption that, if trophobiosis is scored as positive for a 23 \ngenus, then the majority of the species in the genus are trophobionts. If this assumption 24 \nis violated then there may be differences in the evolutionary history of trophobiosis 25 \n  - 15 - \n \nfrom what is shown here. For the trophobiosis trait, we believe that this assumption is 1 \nreasonable. For example, in the recently resolved genus Linepithema, Homoptera 2 \ntending is ubiquitous across all 19 species (Wild, 2007). Also, we have refrained from 3 \nestimating the relative rates of transition between trophobiosis states, although it is 4 \nreasonable to use the phylogeny to calculate the minimum number of state changes. 5 \nUsing the program PAUP (Swofford, 2000) the most parsimonious number of changes 6 \nis an impressive 31. This figure is likely to be highly conservative as the phylogeny is 7 \nresolved only to genus level and there may be many transitions at the species level. 8 \nThere may also be under-reporting in the literature which could lead to trophobiosis 9 \nbeing incorrectly assumed to be absent in poorly sampled genera. This may slightly 10 \ninflate or decrease the number of changes depending on whether it occurs in mutualistic 11 \nor autonomous clades. Regardless, trophobiosis in ants appears to be a highly 12 \nevolutionarily labile trait. 13 \n 14 \nDiscussion  15 \nThe tending of homopteran and lycaenid insects by ants occurs on a broad taxonomic 16 \nscale, with 45% of ant genera containing trophobiotic species. The taxonomic 17 \ndistribution is uneven, however, with certain subfamilies specialising in trophobiosis 18 \n(e.g. the Aenictinae, Aneuritinae and Pseudomyrmicinae and of the larger subfamilies:       19 \nthe Dolichoderinae and Formicinae), while trophobiosis is entirely absent in others (e.g. 20 \nthe Ecitoninae). We have identified a number of ecological traits that are correlated 21 \nwith the occurrence of trophobiosis in ant genera. Thus, species most likely to tend 22 \nHomoptera are ants that are polygynous, dominant in their community, arboreal 23 \nnesting, with large colonies of 104 – 105 individuals, and those that can occupy 24 \ndisturbed habitats. Several ecological factors, such as latitude and worker 25 \n  - 16 - \n \npolymorphism, did not correlate with trophobiosis. This could indicate these factors 1 \nhave little influence on the evolution of trophobiosis. It is also possible however, that 2 \nthey are important, but are simply not detected in a genus level analysis. 3 \n      The association between dominance, polygyny and trophobiosis has been noted by 4 \na number of researchers (Blüthgen et al., 2004, Fiedler, 1991, Eastwood & Fraser, 5 \n1999, Fiedler, 2001, Davidson, 1998). Dominant ant species can monopolise honeydew 6 \nproducing resources by excluding subdominant species. Subdominant and specialised 7 \nants tend to have smaller colonies and as such may be confined to peripheral ecological 8 \nniches where resources are more scarce. Thus a few key Homopteran species 9 \ncolonising certain host plants can contribute to shaping the ant community of an 10 \necosystem (Blüthgen et al., 2004). At this point, however, we are unable to determine 11 \nwhich trait, dominance or trophobiosis, precedes which. Dominant ants may be more 12 \nable to outcompete others to obtain resources, but the converse is also possible whereby 13 \nthe evolution of adaptations to exploit new resources allows ants to become dominant 14 \n(Davidson, 1998). Honeydew is a profitable, renewable source of carbohydrates as well 15 \nas essential amino acids (Völkl  et al., 1999, Fischer & Shingleton, 2001). With access 16 \nto such food, ant colonies may be able to forage wider areas (Stadler & Dixon, 2005) 17 \nand support larger populations of vigorous workers able to outcompete other ants 18 \n(Davidson, 1997). Modification of the proventriculus is one such adaptation that 19 \nfacilitates the trophobiont-ant relationship by allowing large amounts of liquid food to 20 \nbe carried back to the nest. This may allow ants to increase numbers and achieve 21 \ndominance (Davidson et al., 2004). There may also be covariance in some of the 22 \necological traits important in trophobiosis. For example, polygynous ant colonies tend 23 \nto be large and polydomous (Hölldobler & Wilson, 1990); attributes which no doubt 24 \nhelp them to achieve ecological dominance and exclude competitors from sugar 25 \n  - 17 - \n \nproducing resources (Davidson, 1998). Polygyny also breaks down within-colony 1 \nrelatedness and so may also facilitate the formation of ‘unicoloniality’, very large 2 \ncooperative entities of ants that exclude competing species (Davidson, 1998). 3 \nAlternatively, Rosengren et al. (1993) have instead suggested that polygyny may result 4 \nfrom trophobiosis as the relative benefit of long distance dispersal by the female 5 \nreproductive class declines compared with remaining with the native colony in 6 \ncompetion-free, resource rich areas. Our study shows a positive association between 7 \npolygyny and trophobiosis with Homoptera, but this relationship disappears after 8 \naccounting for phylogenetic non-independence using the GEE method. 9 \n      A novel finding in this paper is that dominant ants appear to fall into two categories: 10 \nsmall dominant ants that tend Homoptera and larger dominant ants that do not. A 11 \nnumber of other ecological traits also differ significantly between the two groups 12 \n(Table 5), supporting this grouping of dominant ants on the basis of homopteran 13 \ntending. Small ants may be more able to match worker allocation to resource value and 14 \nallow a continuous, steady flow of resources to the nest. In addition they may provide a 15 \nmore effective, non-localised defence force through increased sensitivity (greater 16 \nnumber of- and more widely dispersed ‘receptors’), followed by pheromone-mediated 17 \nmass recruitment towards targeted threats. Polygyny and polydomy can further aid this 18 \nresource monopolisation (Davidson, 1998) and invasiveness of ants may be an 19 \nemergent trait facilitated by a combination of small size, polygyny and homopteran 20 \ntending (Ness & Bronstein, 2004). Large dominant ants, in contrast, include ants such 21 \nas the Ponerines which tend adopt a more solitary mode of foraging. Also, on average, 22 \nlarge dominants have a greater degree of worker polymorphism which is also 23 \nassociated with nomadic lifestyles. 24 \n      It is noteworthy that trophobiosis was positively associated with invasiveness. This 25 \n  - 18 - \n \ncould be due to traits that covary with trophobiosis, for example dominance. 1 \nRegardless, it highlights that the trophobiotic association with Homoptera is very 2 \nflexible. Invading ants can easily adopt new partners in a novel habitat. It may be that 3 \ngeneral exaptations (preadaptations) of the ant-Homoptera mutualism allow easy 4 \ntransfer to new partners (Mondor & Addicott, 2007) and a dynamic flux in mutualist 5 \nidentity. Partner switching may occur not just with different congeneric species, but 6 \nacross large taxonomic divides, such as the exploitation, by a single ant colony, of 7 \nmany different Homoptera, lycaenid and extrafloral nectar-bearing plant species. This 8 \nmay be especially useful if a partner’s range and abundance is limited and also in novel 9 \nhabitats where a previous partner is absent. Such partner switching may give facultative 10 \nmutualisms an advantage over obligate pairwise mutualisms. Although interactions 11 \nbetween ants and domatia-bearing plants (Beattie, 1985) or fungi (Mueller et al., 2005) 12 \nare often obligate and specialised, those between ants and sugar-producing 13 \ntrophobionts are most often not (Pierce et al., 2002, Bristow, 1991). Rather than some 14 \nkind of clade selection promoting faculative mutualism over pairwise obligate 15 \nspecialisation, however, in ant-Homoptera interactions we predict that facultative 16 \nmutualisms are more prevalent due to the dynamic metapopulation structure of 17 \nHomoptera combined with the by-product nature of rewards. Dynamic 18 \nmetapopulations make reciprocal interactions between the same genotypes less 19 \npersistent thereby reducing partner fidelity. General by-product rewards (honeydew is a 20 \nwaste product for Homoptera and ants, by nature, guard all types of food resource) 21 \nfacilitate easy partner switching. 22 \n 23 \n      Finally, it may be intuitive to expect that close coevolution with a mutualistic 24 \npartner limits the extent to which a species can participate in other coevolutionary 25 \n  - 19 - \n \nrelationships. Strong directional or balancing selection imposed by one coevolutionary 1 \npartner may limit the degree to which a trait can be selected by another partner. We 2 \nfind, however, that trophobiotic ants are able to maintain several mutualisms 3 \nsimultaneously. Species that tend Homoptera are also highly likely to be those which 4 \ntend lycaenids and feed at extrafloral nectaries. Ants provide similar benefits to each of 5 \nthese groups (primarily defence against enemies), and receive similar rewards (sugary 6 \nsecretions). Thus, general adaptations may facilitate all three mutualisms. For example, 7 \neffective resource defence abilities, group recruitment and a modified proventriculus 8 \nallow exploitation of these similar resources. In addition to maintaining mutualisms 9 \nwith trophobionts, ants can also simultaneously engage in mutualisms with 10 \ndomatia-bearing plants. A similar pattern of association has been found for plants with 11 \nextrafloral nectaries: there is a positive association between extrafloral nectary bearing 12 \nplants and ant-tended aphids (Offenberg, 2000). Ants that inhabit plant domatia often 13 \nbring their Homopteran mutualists with them and use plant shelters to farm their herds. 14 \nSimilar to trophobionts, domatia-bearing plants require an effective defence force. By 15 \nmoving mutualistic partners together, ants can achieve this and reap the rewards from 16 \nboth (shelter from plants and food from Homoptera).  17 \n      When requirements from mutualistic partners diverge, however, it appears ants may 18 \nbe required to specialise in one type of mutualism. Ants that garden fungi, for example, 19 \ndo not engage in trophobiotic interactions with Homoptera. Fungi require the gathering 20 \nof growth substrates and maintenance of ideal conditions, Homoptera require a 21 \npatrolling defence. Hoeksema et al. (2000) suggest that there may be allocation 22 \ntrade-offs in mutualisms, where limiting resources are allocated to traits associated with 23 \ndifferent partners. We suggest that foraging time and energy of ants may also be viewed 24 \nas limiting resources, which trade off between potentially mutualistic partners such as 25 \n  - 20 - \n \nfungi and Homoptera. Over evolutionary time this partner choice becomes cemented by 1 \nthe evolution of specialised traits that maximise benefits from a specific partner type, 2 \nbut reduce the ability to exploit other partners. For example, each partner offers a 3 \ndifferent type of food as a reward to ants, that may require different physiological 4 \nadapations to consume and digest. Where fungi can offer non-food rewards however, 5 \n(e.g. as a structural building tool in L. fuliginosus nests), then ants seem to be able to 6 \nadopt both Homoptera and fungi as mutualistic partners. Thus, from these observations 7 \nwe propose as a general hypothesis that species can specialise in multiple types of 8 \nmutualism simultaneously only when there is no redundancy of rewards and no 9 \ntrade-off in requirements (Fig. 3). In cases such as the ant mutualisms with Homoptera, 10 \nlycaenids and extrafloral nectaries there appears to be redundancy of rewards (all offer 11 \nsugary secretions) but no trade off in requirements (all require protection), a somewhat 12 \n‘halfway house’ satisfaction of the above criteria. In these cases we predict that the 13 \nspecies can maintain multiple unspecialised faculative mutualisms but specialised 14 \nobligate relationships will not develop. Conversely, for the other halfway house 15 \npossibility, when there is no redundancy of rewards but there is a trade-off in 16 \nrequirements, we predict that there will be no multiple mutualisms maintained 17 \nwhatsoever. Thus, the trade-off in requirements can be viewed as the most important 18 \ncriterion in determining multiple mutualisms, with redundancy of rewards secondarily 19 \ndetermining whether the mutualisms are facultative or specialised obligate 20 \nrelationships. 21 \nConclusion 22 \nTo summarise, we have identified a number of ecological traits that characterise 23 \nhomopteran tending ants. Trophobiotic ants are more likely to be forest dwelling, 24 \npolygynous, ecologically dominant and arboreal nesting with large colonies of 104 – 25 \n  - 21 - \n \n105 individuals. Some of these associations remain even after accounting for 1 \nphylogenetic non-independence, suggesting causal relationships. For example, it is 2 \nhighly likely that ecological dominance in ants is either responsible for- or a 3 \nconsequence of- the maintenance of trophobiotic mutualism. We are not yet in a 4 \nposition, however, to predict the direction of causality. We have also found that 5 \ndominant ants fall into two distinct groups depending on whether they tend Homoptera, 6 \nand these groups also differ in several related ecological traits, such as invasiveness, 7 \npolygyny and polymorphism. Finally, we observe that ants appear to specialise in 8 \nmultiple mutualisms only when partners offer different types of reward and there is no 9 \ntrade-off in requirements from the ants. We propose this as a general rule that may 10 \ngovern the formation of multiple mutualisms by any species.  11 \n 12 \n 13 \nAcknowledgements  14 \nMany thanks to Corrie Saux Moreau for supplying the ant phylogeny, to 15 \nKonrad Fiedler, Karsten Schonrogge and Tony Dixon for helpful discussion and 16 \nrevision of the manuscript and to Andy Purvis, Andrew Meade and Gavin Thomas for 17 \nassistance with analysis techniques. Also, thanks to anonymous reviewers whose 18 \ncomments led to improvements on earlier versions of the manuscript.  THO was 19 \ngratefully in receipt of a BBSRC studentship. 20 \n 21 \n 22 \n  - 22 - \n \nReferences 1 \nAddicott, J. F. 1978. Competition for mutualists: aphids and ants. Canadian Journal of Zoology 56: 2 \n2093-2096. 3 \nAuclair, J. L. 1963. Aphid feeding and nutrition. Annual Review of Entomology 8: 439-490. 4 \nBeattie, A. J. 1985. The Evolutionary Ecology of Ant-Plant Mutualisms. Cambridge University Press, 5 \nCambridge. 6 \nBlüthgen, N., Stork, N. E. & Fiedler, K. 2004. Bottom-up control and co-occurrence in complex 7 \ncommunities: honeydew and nectar determine a rainforest ant mosaic. Oikos 106: 344-358. 8 \nBristow, C. M. (1991) Why are so few aphids ant- tended? In: Ant- Plant Interactions, (Huxley, C. R. & 9 \nCutler, D. F., eds.). pp. 101-119. Oxford University Press, Oxford. 10 \nBronstein, J. L. 1994. Conditional outcomes in mutualistic interactions. Trends in Ecology and Evolution 11 \n9: 214-217. 12 \nBuckley, R. C. 1987. Interactions involving plants, Homoptera and ants. Annual Review of Ecology and 13 \nSystematics 18: 111-135. 14 \nCollins, C. M. & Leather, S. R. 2002. Ant-mediated dispersal of the black willow aphid Pterocomma 15 \nsalicis L.; does the ant Lasius niger L. judge aphid-host quality? Ecological Entomology 27: 16 \n238-241. 17 \nCushman, J. H. 1991. Host-plant mediation of insect mutualisms: variable outcomes in herbivore-ant 18 \ninteractions. Oikos 61: 138-143. 19 \nCushman, J. H. & Addicott, J. F. 1989. Intra- and interspecific competition for mutualists: ants as a 20 \nlimited and limiting resource for aphids. Oecologia 79: 315-321. 21 \nCushman, J. H. & Whitham, T. G. 1989. Conditional mutualism in a membracid-ant association: 22 \ntemporal, age-specific and density dependent effects. Ecology 70: 1040-1047. 23 \nDavidson, D. W. 1997. The role of resource imbalances in the evolutionary ecology of tropical arboreal 24 \nants. Biological Journal of the Linnean Society 61: 153-181. 25 \nDavidson, D. W. 1998. Resource discovery versus resource domination in ants: a functional mechanism 26 \nfor breaking the trade-off. Ecological Entomology 23: 484-490. 27 \nDavidson, D. W., Cook, S. C. & Snelling, R. 2004. Liquid-feeding performances of ants (Formicidae): 28 \necological and evolutionary implications. Oecologia 139: 255-266. 29 \nEastwood, R. & Fraser, A. 1999. Associations between lycaenid butterflies and ants in Australia. 30 \n  - 23 - \n \nAustralian Journal of Ecology 24: 503-537. 1 \nFelsenstein, J. 1985. Phylogenies and the comparative method. American Naturalist 125: 1-15. 2 \nFiedler, K. 1991. Systematic, evolutionary and ecological implications of myrmecophily within the 3 \nLycaenidae (Insecta: Lepidoptera: Papilioniodae). Bonner Zoologische Monographien 31: 4 \n1-210. 5 \nFiedler, K. 2001. Ants that associate with Lycaeninae butterfly larvae: diversity, ecology and 6 \nbiogeography. Diversity and Distributions 7: 45-60. 7 \nFischer, M. K. & Shingleton, A. W. 2001. Host plant and ants influence the honeydew sugar composition 8 \nof aphids. Functional Ecology 15: 544-550. 9 \nFokkema, N. J., Riphagen, I., Poot, R. J. & deJong, C. 1983. Aphid honeydew, a potential stimulant of 10 \nCochliobolus satirus and Septoria nodorum and the competitive role of saprophytic mycoflora. 11 \nTransaction of the British Mycological Society 81: 355-363. 12 \nFolgarait, P. J. 1998. Ant biodiversity and its relationship to ecosystem functioning: a review. 13 \nBiodiversity and conservation 7: 1221-1244. 14 \nGrafen, A. 1989. The phylogenetic regression. Philosophical Transactions of the Royal Society of 15 \nLondon B 326: 119-156. 16 \nHeckroth, H.-P., Fiala, B., Gullan, P. J., Idris, A. H. J. & Maschwitz, U. 1998. The soft scale (Coccidae) 17 \nassociates of Malaysian ant-plants. Journal of Tropical Ecology 14: 427-443. 18 \nHerre, E. A., Knowlton, N. & Mueller, U. G. 1999. The evolution of mutualisms: exploring the paths 19 \nbetween conflict and cooperation. Trends in Ecology & Evolution 14: 49-53. 20 \nHoeksema, J. D. & Bruna, E. M. 2000. Pursuing the big questions about interspecific mutualism: a 21 \nreview of theoretical approaches. Oecologia 125: 321-330. 22 \nHölldobler, B. & Wilson, E. O. 1990. The Ants. Harvard University Press, Cambridge, Massachussetts. 23 \nHorvitz, C. C. & Douglas, W. S. 1984. Effects of ants and an ant-tended herbivore on seed production of 24 \na neotropical herb. Ecology 65: 1369-1378. 25 \nIhaka, R. & Gentleman, R. 1996. R: A language for data analysis and graphics. Journal of Computational 26 \nand Graphical Statistics 5: 299-314. 27 \nISI ISI Web of Science search engine. Vol. 2006. pp. 28 \nJones, C. R. 1929. Ants and their relation to aphids. Colarado Agricultural Experiment Station. Bulletin. 29 \n341: 5-96. 30 \n  - 24 - \n \nKoh, L. P., Sodhi, N., S. & Brook, B. W. 2004. Ecological correlates of extinction proneness in tropical 1 \nbutterflies. Conservation Biology 18: 1571-1578. 2 \nMcGlynn, T. P. 1999. The worldwide transfer of ants: geographical distribution and ecological 3 \ninvasions. Journal of Biogeography 26: 535-548. 4 \nMondor, E. B. & Addicott, J. F. 2007. Do exaptations facilitate mutualistic associations between invasive 5 \nand native species? Biological Invasions 9: 623-628. 6 \nMoreau, C. S., Bell, C. D., Vila, R., Archibald, B. & Pierce, N. E. 2006. Phylogeny of the ants: 7 \ndiversification in the age of angiosperms. Science 312: 101-104. 8 \nMueller, U. G., Gerardo, N. M., Aanen, D. K., Six, D. L. & Schultz, T. R. 2005. The evolution of 9 \nagriculture in insects. Annual Review of Ecology Evolution and Systematics 36: 563-595. 10 \nNess, J. H. & Bronstein, I. L. 2004. The effects of invasive ants on prospective ant mutualists. Biological 11 \nInvasions 6: 445-461. 12 \nOffenberg, J. 2000. Correlated evolution of the association between aphids and ants and the association 13 \nbetween aphids and plants with extrafloral nectaries. Oikos 91: 146-152. 14 \nOffenberg, J. H. 2001. Balancing between mutualism and exploitation: the symbiotic interaction between 15 \nLasius ants and aphids. Behavioural Ecology and Sociobiology 49: 304-310. 16 \nOliver, T. H., Cook, J. M. & Leather, S. R. 2007a. When are ant-attractant devices a worthwhile 17 \ninvestment? Vicia faba extrafloral nectaries and Lasius niger ants. Population Ecology 49: 18 \n265-273. 19 \nOliver, T. H., Mashanova, A., Leather, S. R., Cook, J. M. & Jansen, V. A. A. 2007b. Ant semiochemicals 20 \nlimit apterous aphid dispersal. Proceedings of the Royal Society B: Biological Sciences 274: 21 \n3127–3131. 22 \nParadis, E. 2006. Analysis of Phylogenetics and Evolution with R. Springer, Baltimore. 23 \nParadis, E. & Claude, J. 2002. Analysis of comparative data using generalised estimating equations. 24 \nJournal of Theoretical Biology 218: 175-185. 25 \nParadis, E., Claude, J. & Strimmer, K. 2004. APE: analyses of phylogenetics and evolution in R 26 \nlanguage. Bioinformatics 20: 289-290. 27 \nPierce, N. E., Braby, M. F., Heath, A., Lohman, D. J., Mathew, J., Rand, D. B. & Travassos, M. A. 2002. 28 \nThe ecology an evolution of ant association in the Lycaenidae (Lepidoptera). Annual Review of 29 \nEntomology 47: 733-771. 30 \n  - 25 - \n \nR.Development.Core.Team (2007) R: A language and environment for statistical computing., 1 \n(Computing, R. F. f. S., ed.). pp., Vienna, Austria. ISBN 3-900051-07-0, URL 2 \nhttp:\/\/www.R-project.org. 3 \nRosengren, R., Sundström, L. & Fortelius, W. (1993) Monogyny and polygyny in Formica ants: the 4 \nresult of alternative dispersal tactics. In: Queen Number and Sociality in Insects, (Keller, L., 5 \ned.). pp. 308-333. Oxford University Press, Oxford. 6 \nSachs, J. L. & Simms, E. L. 2006. Pathways to mutualism breakdown. Trends in Ecology & Evolution 7 \n21: 585-592. 8 \nShingleton, A. W. & Stern, D. L. 2003. Molecular phylogenetic evidence for multiple gains or losses of 9 \nant mutualism within the aphid genus Chaitophorous. Molecular Phylogenetics and Evolution 10 \n26: 26-35. 11 \nShingleton, A. W., Stern, D. L. & Foster, W. A. 2005. The origin of a mutualism: a morphological trait 12 \npromoting the evolution of ant aphid mutualisms. Evolution 59: 921-926. 13 \nSpecies 2000 Database. Annual Checklist 2007., Vol. 2007. pp. 14 \nStadler, B. & Dixon, A. F. G. 2005. Ecology and evolution of aphid- ant interactions. Annual Review of 15 \nEcology and Systematics 36: 345-372. 16 \nStadler, B., Kindlmann, P., Šmilauer, P. & Fiedler, K. 2003. A comparative analysis of morphological 17 \nand ecological characters of European aphids and lycaenids in relation to ant attendance. 18 \nOecologia 135: 422-430. 19 \nSudd, J. H. & Sudd, M. E. 1983. Seasonal changes in the response of wood-ants (Formica lugubris) to 20 \nsucrose baits. Ecological Entomology 10: 89-97. 21 \nSwofford, D. L. (2000) PAUP*. Phylogenetic Analysis Using Parsimony (*and Other Methods), Version 22 \n4. pp. Sinauer Associates, Sunderland, Massachusetts. 23 \nThompson, J. N. 1994. The Coevolutionary Process. University of Chicago Press, Chicago. 24 \nVölkl , W. 1992. Aphids or their parasitoids: Who acutally benefits from ant attendance? Journal of 25 \nAnimal Ecology 61: 272-281. 26 \nVölkl , W., Woodring, J., Fischer, M., Lorenz, M. W. & Hoffman, K. H. 1999. Ant-aphid mutualisms: 27 \nthe impact of honeydew production and honeydew sugar composition on ant preferences. 28 \nOecologia 118: 483. 29 \nWay, M. J. 1954. Studies on the association of the ant Oecophylla longinoda (Latr.) with the scale insect 30 \n  - 26 - \n \nSaissetia zanzibarensis (Williams). Bulletin of Entomological Research 45: 113-134. 1 \nWay, M. J. 1963. Mutualism between ants and honeydew producing Homoptera. Annual Review of 2 \nEntomology 8: 307-343. 3 \nWild, A. (2007) Taxonomic revision of the ant genus Linepithema (Hymenoptera: Formicidae). In: 4 \nEntomology Vol. 126. pp. University of California Press Publications, California. 5 \nWimp, G. M. & Whitham, T. G. 2001. Biodiversity consequences of predation and host plant 6 \nhybridization on an aphid- ant mutualism. Ecology 82: 440-452. 7 \nYao, I. & Akimoto, S. 2002. Flexibility in the composition and concentration of amino acids in 8 \nhoneydew of the drepanosiphid aphid Tuberculatus quercicola. Ecological Entomology 27: 9 \n745-752. 10 \n 11 \n 12 \n 13 \n 14 \n 15 \n 16 \n 17 \n 18 \n 19 \n 20 \n 21 \n 22 \n 23 \n 24 \n 25 \n 26 \n 27 \n  - 27 - \n \nTables \n \nEcological trait  Description \nFactor \ntype \nDominance One or more species in the genus reported to have attained  Binary \n  numerical dominance in their native community   \nPolygyny One or more species reported as polygynous at least 6 months  Binary \n  after colony founding   \nPolymorphic \nworkers One or more species have differentiated worker castes Binary \nInvasiveness \nOne or more species is an 'invasive' or 'tramp' species (McGlynn, \n1999) Binary \nArboreal nesting One or more species of the genus nests in trees Binary \nNomadism One or more species have distinct nomadic phases with frequent daily  Binary \n  colony movement   \nTrophobiosis with  Species of ants in the genus also tend lycaenid caterpillars Binary \nLycaenidae     \nFeed at extrafloral  Species of ants in the genus also feed at extrafloral nectaries Binary \nnectaries     \nLatitude The majority of species in the genus occur in temperate regions,  Categorical\n  tropical or both   \nColony size Average colony size of the genus is small (0-200 workers),  Categorical\n  \nmedium (200-10,000), large (10,000-100,000) or very large \n(100,000+)   \nBody size Mean body size of ants in the genus  Continuous\nHabitat types The number of different habitat types species of the genera occupy Continuous\n   from a list of: forest, grassland, scrub, arid, wetland, disturbed   \nGeographical  The number of different biogeographic realms species of the genus Continuous\nrange  occur in from a list of: Nearctic, Neotropic, Palearctic, Afrotropic,   \n   Oriental, Indomalay, Australasia   \nFungus gardening One or more species grows fungus in gardens within the nest Binary \nAnt-plant  One or more species live in specialised plant domatia (Hölldobler and Binary \nmutualism Wilson, 1990)   \n      \nBlocking factor     \nSubfamily Subfamily of the genus (Moreau et al., 2006) Categorical\nSpecies number Continuous\n \nThe number of species in the genus, obtained from the Species 2000  \ndatabase  \nThe number of hits for the genus on ISI Web of Science (ISI)  ContinuousSampling effort \n search engine  \nTable 1   Methods used for scoring ecological traits. \n \n \n \n \n \n \n \n \n  - 28 - \n \nInteraction effect     Hypothesis           \nArboreal nesting and latitude Both temperate and tropical ants tend Homoptera, yet arboreal nesting species are generally found only in the tropics. \nPolygyny and colony size Polygyny may allow dispersed nests (polydomy), facilitating homopteran tending. Colony size is likely to covary with  \n  polygyny, but very small ant colonies are unlikely to be able to defend homopteran resources, even if polygynous.  \nDominance and body size Ants may need to attain a certain body size before becoming dominant enough to monopolise Homoptera.   \n \nTable 2  Hypotheses for pairwise interaction effects of ant ecological factors on the occurrence of trophobiosis  with Homoptera \n \n \n \n \n \n \n \n \n \n  - 29 - \n \n \nEcological trait  Dev df P Association  \nDominance 8.82 1,133 0.003 positive ** \nPolygyny 7.02 1,93 0.008 positive ** \nPolymorphic workers 1.01 1,114 0.315 none  \nInvasiveness 4.28 1,136 0.039 positive * \nArboreal nesting 10.34 1,130 0.001 positive ** \nNomadism 3.19 1,131 0.074 none     \nTrophobiosis with  85.22 2,135 <0.001 positive *** \nLycaenidae          \nFeeding at extrafloral  74.88 2,135 <0.001 positive *** \nnectaries          \nLatitude 3.02 2,134 0.221 none   \nColony size 4.84 1,92 0.027 large colonies * \nBody size 8.83 1,135 0.003 negative  \n# Habitat types 4.92 1,131 0.027 positive * \n# Geographical \nRealms 0.14 1,135 0.709 none   \nFungus gardening 4.90 1,135 0.027 negative * \nAnt-plant mutualism 12.46 1,135 <0.001 positive *** \n           \nHabitat Dev d.f. P Association  \nForest  0.67 1,130 0.413 none   \nGrassland 0.01 1,130 0.972 none   \nScrub 1.45 1,130 0.228 none   \nDisturbed 5.45 1,130 0.020 positive * \nWetland\/ Heath 2.9 1,130 0.088 none   \nArid 0.56 1,130 0.453 none   \n \nTable 3    Association between ecological traits or habitat types on the occurrence of \ntrophobiosis with Homoptera. \nThe method involved binary logistic regressions with species number in genus and sampling effort as blocking factors. \nAsterisks are significance codes for each ecological trait: *0.01<p<0.05, **0.001<p<0.01, ***p<0.001.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n  - 30 - \n \n \n \n \nEcological trait  t dfP P Association  \nDominance 2.10 27.00 <0.001 positive *** \nPolygyny 1.64 17.54 0.123 none  \nPolymorphic workers 0.25 19.91 0.800 none  \nInvasiveness 1.76 27.11 0.089 none  \nArboreal nesting - - - -  \nNomadism 2.11 21 0.049 negative * \nTrophobiosis with  3.43 21.61 <0.001 positive *** \nLycaenidae          \nFeeding at extrafloral  3.57 21.61 <0.001 positive *** \nnectaries          \nLatitude 0.28 21.61 0.783 none   \nColony size 0.67 17.47 0.516 none  \nBody size 0.04 20.84 0.967 none  \n# Habitat types 0.58 22.12 0.56 none  \n# Geographical \nRealms 1.73 21.61 0.101 none   \nFungus gardening 2.74 21.61 0.014 negative * \nAnt-plant mutualism 1.46 21.61 0.161 none  \n           \nHabitat t dfP P Association  \nForest  0.62 26.42 0.389 none   \nGrassland 0.13 26.42 0.896 none   \nScrub 0.12 26.42 0.909 none   \nDisturbed 1.35 26.42 0.191 none   \nWetland\/ Heath 0.4 26.42 0.695 none   \nArid 0.91 26.42 0.373 none   \n \n \nTable 4    Association between ecological traits or habitat types on the occurrence of \ntrophobiosis with Homoptera, controlling for shared evolutionary history. \nThe method involved phylogenetic generalised estimating equations with sampling effort as a blocking factor. \nPhylogenetic degrees of freedom (dfP) are residual number of degrees of freedom corrected to account for branch \nlength distances, to prevent inflated type I error rates (Paradis, 2006). Asterisks are significance codes for each \necological trait: *0.01<p<0.05, **0.001<p<0.01, ***p<0.001.  \n  - 31 - \n \n \n \n \nCharacteristic Small  \ndominants \nLarge  \ndominants \n \nMean body size: 4.53mm 8.20mm ** \nTend Homoptera?:     Y N * \nPolygynous 86% 36% ** \nInvasive: 48% 0% ** \nDisturbed habitats: 48% 12.5% \nPolymorphic workers: 39% 80% \nNomadic:  6% 38% \n* \n* \n* \n \nTable 5  Characteristics of small dominant and large dominant ants. \nPercentages given are of genera scoring positive for each trait. Asterisks are significance codes for each ecological \ntrait: *0.01<p<0.05, **0.001<p<0.01,***p<0.001.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  - 32 - \n \nFigures \n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\nAn\neu\nret\nina\ne\nPs\neu\ndo\nmy\nrm\nicin\nae\nDo\nlich\nod\neri\nna\ne\nFo\nrm\nicin\nae\nEc\ntat\nom\nmi\nna\ne\nMy\nrm\nicin\nae\nPo\nne\nrin\nae\nAg\nroe\nco\nmy\nrm\nec\nina\ne\nAe\nnic\ntin\nae\nAm\nbly\nop\non\nina\ne\nCe\nrap\nac\nhy\nina\ne\nDo\nryl\nina\ne\nEc\nito\nnin\nae\nHe\nter\nop\non\neri\nna\ne\nLe\npta\nnil\nlin\nae\nLe\npta\nnil\nloi\ndin\nae\nMy\nrm\nec\ncii\nna\ne\nPa\nrap\non\neri\nna\ne\nPr\noc\nera\ntiin\nae\nSubfamily\nPe\nrc\nen\nta\nge\n g\nen\ner\na \nw\nith\n \nm\nut\nua\nlis\ntic\n s\npe\nci\nes\nHomoptera\nFungi\nPlant domatia\n \nFig. 1  Ant subfamilies engaging in different mutualisms \nThe percentage of ant genera that contain mutualistic species in each subfamily. Subfamilies are in order of occurrence \nof trophobiosis with Homoptera, but also included are percentages engaging in mutualisms with plants and fungi.  \n \nFig. 2  Cladogram of the Formicidae showing trophobiosis with Homoptera \n- please see attached PDF. \n \n  - 33 - \n \nprotection\ngrowth \nsubstrates\nfood\nprotection\nfood domatia\nREQUIREMENTS\nREWARDS\nMULTIPLE \nMUTUALISMS?\nA B A C\n \n \nFig. 3 Multiple mutualisms cannot occur if there is a trade-off in requirements and \nredundancy of rewards \nAnts simultaneously maintain specialised mutualisms with Homoptera (A) and domatia bearing plants (B). In contrast, \nthere is a negative correlation between ant- Homoptera (A) and ant –fungi (C) mutualisms. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  - 34 - \n \nFigure Legends \nFig. 1  Ant subfamilies engaging in different mutualisms \nThe percentage of ant genera that contain mutualistic species in each subfamily. Subfamilies are in order of occurrence \nof trophobiosis with Homoptera, but also included are percentages engaging in mutualisms with plants and fungi.  \nFig. 2  Cladogram of the Formicidae showing trophobiosis with Homoptera \nTrophobiosis occuring within a genus is shown in black. The six bottom-most genera are vespoid and sphecoid \noutgroups. \n \nFig. 3  Multiple mutualisms cannot occur if there is a trade-off in requirements and \nredundancy of rewards \nAnts simultaneously maintain specialised mutualisms with Homoptera (A) and domatia bearing plants (B). In contrast, \nthere is a negative correlation between ant- Homoptera (A) and ant –fungi (C) mutualisms. \n \n \n \n \n \n \n \n \n \n \n  - 35 - \n \nTable Legends \nTable 1  Methods used for scoring ecological traits \nTable 2  Hypotheses for pairwise interaction effects of ant ecological factors on the \noccurrence of trophobiosis with Homoptera \nTable 3    Association between ecological traits or habitat types on the occurrence of \ntrophobiosis with Homoptera. \nThe method involved binary logistic regressions with species number in genus and sampling effort as blocking factors. \nAsterisks are significance codes for each ecological trait: *0.01<p<0.05, **0.001<p<0.01, ***p<0.001.  \n \nTable 4    Association between ecological traits or habitat types on the occurrence of \ntrophobiosis with Homoptera, controlling for shared evolutionary history. \nThe method involved phylogenetic generalised estimating equations with sampling effort as a blocking factor. \nPhylogenetic degrees of freedom (dfP) are residual number of degrees of freedom corrected to account for branch \nlength distances, to prevent inflated type I error rates (Paradis, 2006). Asterisks are significance codes for each \necological trait: *0.01<p<0.05, **0.001<p<0.01, ***p<0.001.  \n \nTable 5  Characteristics of small dominant and large dominant ants. \nPercentages given are of genera scoring positive for each trait. Asterisks are significance codes for each ecological \ntrait: *0.01<p<0.05, **0.001<p<0.01,***p<0.001.  \n \n \nPAUP 1\nEu\nte\ntra\nm\nor\niu\nm\nCo\nlo\nbo\nst\nru\nm\na \nVo\nlle\nnh\nov\nia\nPr\nis\nto\nm\nyr\nm\nex\n \nW\nas\nm\nan\nni\na\nM\nyr\nm\nica\n \nM\nyr\nm\nica\nria\n \nM\neg\nal\nom\nyr\nm\nex\nTe\ntra\nm\nor\niu\nm\nCa\nlyp\nto\nm\nyr\nm\nex\n \nTe\nra\nta\nne\nr \nCr\nem\nat\nog\nas\nte\nr\nM\nel\nis\nso\nta\nrs\nus\nR\nho\npa\nlo\nm\nas\ntix\n \nXe\nno\nm\nyr\nm\nex\nPr\noa\ntta\n \nD\nilo\nbo\nco\nnd\nyla\nFo\nrm\nic\nox\nen\nus\nLe\npt\not\nho\nra\nx\nTe\nm\nno\nth\nor\nax\nM\nay\nrie\nlla\n \nSo\nle\nno\nps\nis \nCa\nrd\nio\nco\nnd\nyla\nM\non\nom\nor\niu\nm\nO\nlig\nom\nyr\nm\nex\nCa\nre\nba\nra\nPh\nei\ndo\nlo\nge\nto\nn \nAt\nop\nom\nyr\nm\nex\n \nM\ner\nan\nop\nlu\ns \nLo\nph\nom\nyr\nm\nex\nPo\ndo\nm\nyr\nm\na\nM\net\nap\non\ne \nAp\nha\nen\nog\nas\nte\nr\nG\non\nio\nm\nm\na \nO\nxy\nop\nom\nyr\nm\nex\n \nSt\nen\nam\nm\na\nM\nes\nso\nr \nPo\ngo\nno\nm\nyr\nm\nex\n \nCa\nta\nul\nac\nus\nO\ncy\nm\nyr\nm\nex\nPy\nra\nm\nica\nSt\nru\nm\nig\nen\nys\n \nAp\nte\nro\nst\nig\nm\na \nEu\nrh\nop\nal\not\nhr\nix\nCy\nph\nom\nyr\nm\nex\nAt\nta\nTr\nac\nhy\nm\nyr\nm\nex\n \nSe\nric\nom\nyr\nm\nex\nCe\nph\nal\not\nes\nPr\noc\nry\npt\noc\ner\nus\nPh\nei\ndo\nle\nTr\nan\nop\nel\nta\nCa\nta\ngl\nyp\nhi\ns\nPr\nof\nor\nm\nica\nPo\nlye\nrg\nus\nFo\nrm\nic\na\nO\nec\nop\nhy\nlla\n \nSt\nig\nm\nac\nro\ns\nO\npi\nst\nho\nps\nis\nPo\nlyr\nha\nch\nis \nCa\nm\npo\nno\ntu\ns \nM\nyr\nm\not\ner\nas\n \nAn\nop\nlo\nle\npi\ns\nEu\npr\nen\nol\nep\nis \nAc\nro\npy\nga\n \nM\nyr\nm\nec\nor\nhy\nnc\nhu\ns \nM\nel\nop\nho\nru\ns\nPr\nol\nas\niu\ns\nN\not\non\nch\nus\n \nPl\nag\nio\nle\npi\ns\nPs\neu\ndo\nla\nsiu\ns \nPr\nen\nol\nep\nis \nM\nyr\nm\nec\noc\nys\ntu\ns \nAc\nan\nth\nom\nyo\nps\n \nLa\nsi\nus\n \nM\nyr\nm\nel\nac\nhi\nst\na\nBr\nac\nhy\nm\nyr\nm\nex\nR\nhy\ntid\nop\non\ner\na\nEc\nta\nto\nm\nm\na\nG\nna\nm\npt\nog\nen\nys\nTy\nph\nlo\nm\nyr\nm\nex\nH\net\ner\nop\non\ner\na \nBo\nth\nrio\nm\nyr\nm\nex\nD\nol\nic\nho\nde\nru\ns \nPa\npy\nriu\ns\nAn\non\nyc\nho\nm\nyr\nm\na\nPh\nilid\nris\n \nO\nch\net\nel\nlu\ns\nIri\ndo\nm\nyr\nm\nex\nFr\nog\nga\ntte\nlla\n \nLi\nne\npi\nth\nem\na \nD\nor\nym\nyr\nm\nex\n \nFo\nre\nliu\ns \nAz\nte\nca\nLe\npt\nom\nyr\nm\nex\n \nTe\nch\nno\nm\nyr\nm\nex\n \nTa\npi\nno\nm\na \nLi\nom\net\nop\num\n \nAn\neu\nre\ntu\ns \nPs\neu\ndo\nm\nyr\nm\nex\nTe\ntra\npo\nne\nra\n \nM\nyr\nm\nec\nia\n \nAe\nni\nct\nus\n \nD\nor\nylu\ns \nN\nom\nam\nyr\nm\nex\n \nEc\nito\nn \nLa\nbi\ndu\ns \nN\nei\nva\nm\nyr\nm\nex\n \nYu\nno\ndo\nry\nlu\ns \nSp\nhi\nnc\nto\nm\nyr\nm\nex\nCe\nra\npa\nch\nys\n \nLe\npt\nan\nillo\nid\nes\n \nPl\nat\nyt\nhy\nre\na \nCr\nyp\nto\npo\nne\nPa\nch\nyc\non\ndy\nla\n \nD\nia\nca\nm\nm\na \nH\nyp\nop\non\ner\na\nD\nin\nop\non\ner\na\nM\nyo\npi\nas\nLe\npt\nog\nen\nys\n \nAn\noc\nhe\ntu\ns \nO\ndo\nnt\nom\nac\nhu\ns \nO\ndo\nnt\nop\non\ner\na \nCe\nnt\nro\nm\nyr\nm\nex\n \nTa\ntu\nrid\nris\n \nPa\nra\npo\nne\nra\nAp\nom\nyr\nm\na\nPr\nio\nno\npe\nlta\nCo\nnc\noc\ntio\n \nO\nny\nch\nom\nyr\nm\nex\n \nM\nyo\npo\npo\nne\nAm\nbl\nyo\npo\nne\n \nAd\net\nom\nyr\nm\na \nM\nys\ntri\num\n \nD\nis\nco\nth\nyr\nea\nPr\noc\ner\nat\niu\nm\nPr\nob\nol\nom\nyr\nm\nex\nPr\not\nan\nilla\nLe\npt\nan\nilla\nCh\nyp\nho\nte\ns\nEv\nag\net\nes\nO\ndo\nnt\nop\nho\nto\nps\nis\nVe\nsp\nul\na\nPh\nila\nnt\nhu\ns \nAp\nis\n"}