{"doi":"10.1080\/0968776930010108","coreId":"14401","oai":"oai:generic.eprints.org:91\/core5","identifiers":["oai:generic.eprints.org:91\/core5","10.1080\/0968776930010108"],"title":"Does interactivity require multimedia? The case of SAKI","authors":["Horwood, Michael"],"enrichments":{"references":[{"id":456566,"title":"CASTE: A system for exhibiting learning strategies and regulating uncertainty',","authors":[],"date":"1973","doi":"10.1016\/s0020-7373(73)80008-2","raw":"Pask, G. and Scott, B.C.E. (1973), 'CASTE: A system for exhibiting learning strategies and regulating uncertainty', International Journal of Man-Machine Studies, 5, 17-52.","cites":null},{"id":456398,"title":"Developing Auto-Instructional Materials,","authors":[],"date":"1986","doi":null,"raw":"Romiszowski, A.J. (1986), Developing Auto-Instructional Materials, London, Kogan Page.","cites":null},{"id":456564,"title":"Developments in conversation theory: Part I',","authors":[],"date":"1980","doi":"10.1016\/s0020-7373(80)80002-2","raw":"Pask, G. (1980), 'Developments in conversation theory: Part I', International Journal of Man-Machine Studies, 13, 357-411.","cites":null},{"id":456399,"title":"Do we really need intelligent teaching systems?',","authors":[],"date":"1988","doi":null,"raw":"Rushby, N.J. (1988), 'Do we really need intelligent teaching systems?', Personnel Management (March).","cites":null},{"id":201975,"title":"Electronic keyboard teaching machines',","authors":[],"date":"1958","doi":null,"raw":"Pask, G. (1958a), 'Electronic keyboard teaching machines', Journal of the National Association for Education and Commerce, July. Reprinted in Glazer, R. and Lumsdaine, A. (eds), Teaching Machines and Programmed Learning, Washington DC, National Education Association, 1, 336-49.","cites":null},{"id":201973,"title":"Expertise in Typewriting,","authors":[],"date":"1984","doi":null,"raw":"Bell, C., ETTI, 26, 4. Gentner, D. (1984), Expertise in Typewriting, Centre for Human Interface Processing, University of California, San Diego, April 1984.","cites":null},{"id":201974,"title":"Instructional Regulation and Control: Cybernetics, Algorithization and Heuristics in Education, Englewood Cliffs NJ,","authors":[],"date":"1976","doi":null,"raw":"Landa, L.N. (1976), Instructional Regulation and Control: Cybernetics, Algorithization and Heuristics in Education, Englewood Cliffs NJ, Educational Technology Publications.","cites":null},{"id":456560,"title":"Research on the design of adaptive teaching systems with a capability for selecting and altering their criteria for adaptation', Reports AF61 (052)-402, Aerospace Medical Research Laboratories.","authors":[],"date":"1958","doi":null,"raw":"Pask, G. (1958b), 'Research on the design of adaptive teaching systems with a capability for selecting and altering their criteria for adaptation', Reports AF61 (052)-402, Aerospace Medical Research Laboratories.","cites":null},{"id":456565,"title":"SAKI: Twenty-five years of adaptive training into the microprocessor era',","authors":[],"date":"1982","doi":"10.1016\/s0020-7373(82)80009-6","raw":"Pask, G. (1982), 'SAKI: Twenty-five years of adaptive training into the microprocessor era', International Journal of Man-Machine Studies, 17, 69-74.","cites":null},{"id":456563,"title":"The Cybernetics of Human Learning and Performance,","authors":[],"date":"1965","doi":"10.2307\/1573672","raw":"Pask, G. (1965b), The Cybernetics of Human Learning and Performance, London, Hutchinson.","cites":null},{"id":456561,"title":"The teaching machine as a control mechanism',","authors":[],"date":"1960","doi":null,"raw":"70ALTJ VOLUME 1 NUMBER 1 Pask, G. (1960), 'The teaching machine as a control mechanism', Transactions of the Society for Instrument Technology, 12, 2 (June).","cites":null},{"id":456562,"title":"The theory and practice of adaptive teaching systems'","authors":[],"date":"1965","doi":null,"raw":"Pask, G. and Lewis, B.N. (1965a), 'The theory and practice of adaptive teaching systems' in Glazer, R. (ed), Teaching Machines and Programmed Learning, Washington DC, National Education Association, vol. II, Data and Directions, pp. 213-66.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1993","abstract":"SAKI is a self‐adaptive touch‐typing tutor with a pedigree dating back to the mid‐1950s. Even in its most recent form it eschews the temptation to present itself with the trimmings now commonly associated with microcomputer products. This paper argues that while the absence of such features may be a limiting factor in the commercial success of the program, SAKI is nevertheless a prime example of the way in which a computer can successfully react to and interact with a user, and indeed one which would actually lose educational value if it were to undergo an interface‐lift","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14401.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/91\/1\/ALT_J_Vol1_No1_1993_Does%20interactivity%20require%20mul.pdf","pdfHashValue":"43436f82c8462f90872c1cf91381d1819cc148bf","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:91<\/identifier><datestamp>\n      2011-04-04T09:30:03Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/91\/<\/dc:relation><dc:title>\n        Does interactivity require multimedia? The case of SAKI<\/dc:title><dc:creator>\n        Horwood, Michael<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        SAKI is a self‐adaptive touch‐typing tutor with a pedigree dating back to the mid‐1950s. Even in its most recent form it eschews the temptation to present itself with the trimmings now commonly associated with microcomputer products. This paper argues that while the absence of such features may be a limiting factor in the commercial success of the program, SAKI is nevertheless a prime example of the way in which a computer can successfully react to and interact with a user, and indeed one which would actually lose educational value if it were to undergo an interface‐lift.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        1993<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/91\/1\/ALT_J_Vol1_No1_1993_Does%20interactivity%20require%20mul.pdf<\/dc:identifier><dc:identifier>\n          Horwood, Michael  (1993) Does interactivity require multimedia? The case of SAKI.  Association for Learning Technology Journal, 1 (1).  pp. 65-71.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776930010108<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/91\/","10.1080\/0968776930010108"],"year":1993,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Does interactivity require multimedia? The case of\nSAKI\nMichael Horwood\nEurotech Training, Oakfield Road, East Wittering, Chichester, West Sussex PO20\n8RP\nAbstract\nSAKI is a self-adaptive touch-typing tutor with a pedigree dating back to the mid-1950s.\nEven in its most recent form it eschews the temptation to present itself with the trimmings\nnow commonly associated with microcomputer products. This paper argues that while\nthe absence of such features may be a limiting factor in the commercial success of the\nprogram, SAKI is nevertheless a prime example of the way in which a computer can\nsuccessfully react to and interact with a user, and indeed one which would actually lose\neducational value if it were to undergo an interface-lift.\nIt should be noted that Eurotech is the official distributor of SAKI\nIntroduction\nLanda (1976) envisages five fundamental categories of instructional systems:\n1. Linear programmes, such as those of programmed learning or page-turning with\nquestion-and-answer sessions for verifying understanding before allowing the learner to\ncontinue.\n2. Intrinsic programmes, where learners are branched to other parts of the programme either\nas a remedial activity or in order to skip a part where they have already demonstrated\nunderstanding.\n65\nMichael Horwood Interactivity and multimedia: the case ofSAKI\n3. Extrinsic programmes, which react to a learner's response pattern over a period of time\nrather than to a single response.\n4. Adaptive programmes, which learn from a learner's response pattern and automatically\nadapt the programme of instruction.\n5. Structure-diagnostic programmes, which not only react to the responses made by the\nstudent, irrespective of whether they are right or wrong, but also make a diagnosis of the\nunderlying reasons for any incorrect responses.\nSAKI (Self-Adaptive Keyboard Instructor) meets the criteria for the adaptive category 4. It is\nan intelligent computer-based training program which uses a fully adaptive conversational\ntutorial mode of instruction, to:\n• teach 10-finger touch-typing to complete beginners as an automatic reflex-skill\n• enable competent typists to build on existing skills and improve accuracy, rhythm\nand speed\n• convert two-finger 'peckers' to competent touch-typists\n• teach touch-typing to certain categories of handicapped persons.\nUsing a complex algorithm, it measures the variations in response rates as well as reacting to\ntyping errors (by simple pattern matching) and speed of typing (by using the computer's\ninternal timing device).\nIt has been developed as a sophisticated MS-DOS version of Gordon Pask's adaptive teaching\nmachine (Pask, 1958a, 1958b, 1960, 1965a, 1982). Its pedigree dates back to the design and\ntesting of such concepts in the late 1950s, and uses Pask's conversational tutorial mode of\ninstruction (Pask, 1980) to learn about individual students. It automatically adapts the\ninstructional process to the student's personal learning style by using error patterns and\nresponse rates as controls. In contrast to other typing tutors which use mechanical repetition,\nSAKI has no pre-set lessons, but uses the controls to concentrate on the areas where the\nlearner is experiencing difficulty.\nThe history of SAKI\nSAKI was first designed in 1955 at System Research (UK) by Gordon Pask, Elizabeth Pask\nand Robin McKinnon-Wood (Pask, 1982). One of the first commercial versions was a\nkeyboard trainer for the Hollerith 12 Keyboard, constructed in 1957 for Solartron Electronic\nGroup UK. The machine was used for keypunch training, using one-depression keystrokes for\nnumerical entry and double-depression for alphabetic characters, punctuation, etc. Solartron is\nsaid to have sold over 200 machines, each one having been hand-built. They took the form of\nelectromechanical devices, using small film sheets with imprinted rows of letters. Each film\nwas inserted in front of a panel of lights where it remained stationary, cueing the typist by a\nrow of lights illuminated in sequence. The 'exercise block' that was literally screwed into the\n66\nALT-J VOLUME 1 NUMBER 1\nmachine was a mate to the film, such that the system knew which letters were being\nilluminated. Each block contained approximately 128 bytes of memory. There were about 40\npairs of exercises and films covering the instructional process.\nThe first fully software-based version of SAKI was developed by System Research in the late\n1970s. This version was sold as a dedicated machine based on the Research Machines 280Z\nmicrocomputer with the alphanumeric characters on the qwerty keyboard blanked off. The\nmachine was purchased by a handful of major organizations concerned with training large\nnumbers of typists. Among the British organizations which used this version were Honeywell\nControl Systems, Scheme Management, and Scottish Gas. In the late 1970s the single training\nstation sold for over £2,500.\nIn 1981, a new design was developed which achieved greater flexibility and adaptability for\nthe individual student, and easier tailoring to different applications and national languages. In\n1986, yet another new version was written in the C programming language, extra features\nadded, and the software tailored to run under MS-DOS. This version - still the current one -\nhas extensive facilities for record keeping, for adjusting the responsiveness of the program,\nand for customizing the exercise material to individual vocabularies and national languages.\nAn adaptive approach to learning sensory-motor skills\nIn order effectively to examine the public reaction to SAKI, it is first necessary to define the\ndifference between touch-typing and keyboard skills. Keyboard skills are little more than\nkeyboard knowledge: in effect an understanding of the keyboard layout, and purpose and\nfunctions of the keys. Touch-typing, on the other hand, is an automatic reflex skill: the user\ntypes at a keyboard without mentally processing the individual characters which make up\nwords, and in some cases complete sentences.\nResearch on typing skills carried out in the course of the development of the original SAKI\nhas been subsequently confirmed (Gentner, 1984). The research has shown that that the skill\nof an expert typist is due to more than finger-speed alone. Overall typing speed can be\nmeasured as a combination of finger speed and lag time between keystrokes, and the primary\ndeterminant of the expert's overall typing speed is a consistently short lag between the typing\nof individual keys. The more expert the typist, the faster the transition from key to key, and as\nthe speed of key transitions increases, typing becomes less sequential. Instead of recognizing\nand typing one character at a time, the expert can mentally process more than one character\nsimultaneously, without being aware of so doing.\nRomiszowski (1986) classifies the various viewpoints on teaching methodology as being\neither 'prescriptive' or 'democratic'. The prescriptive approach supports individualization on\nthe basis of a comparison between the individual student's approach and some ideal model.\nSuch a comparative diagnosis leads to an individual prescription of learning activities for the\nstudent. The democratic (student-centred) approach supports individualization for the student's\nown sake, the course therefore being adapted to his or her needs.\n67 .\nMichael Horwood Interactivity and multimedia: the case of SAKI\nThere is a certain amount of partisan warfare between these two points of view, on\nphilosophical grounds. For some time, however, an alternative to both of them has been under\nconstruction by cyberneticians. Work such as that of Pask (1965b, 1973) suggests that\nmachine-based systems can developed which can learn from the learner, can adapt to the\nlearner's strategy for learning, and can redesign the presentations (on a conversational-tutorial\npattern) in ways superior to those achieved by human tutors. Romiszowski concludes that this\nhas certainly been the case with machines such as the SAKI keyboard trainer for high-speed\nsensory-motor skills.\nIn the case of SAKI, a complex algorithm measures variations in response rates, and uses\nthose control measures to redesign each line of the typing exercises for the learner around his\nor her personal learning curve. Where the learner achieves a predetermined level of accuracy\nand smoothness (this being the consistency of the lag between key depressions), SAKI will\nremove characters) from the current exercise and replace them with characters corresponding\nto the next level of difficulty, accompanied by an appropriate message, such as \"jkl; is\nsmooth\". Any characters which fall below the acceptable limits of accuracy and smoothness\nappear more frequently, together with a message such as \"Difficulty with asdf'. Where the\nlearner's response rates and error patterns fall between the two limits, SAKI repeats the\nexercise in a slightly different combination without changing the level of difficulty.\nReferring to the earlier version of SAKI, with its relative slowness and low level of\nsophistication, Romiszowski (p. 23) nevertheless writes:\nRandomly selected letters appear on screen 1 and the position of each\napproximate key is 'cued* by the lights that appear on the simulated keyboard\non screen 2. [The latest MS-DOS version of SAKI has a screen which is\nhorizontally split into two segments in order to avoid the need for two separate\nscreens.] As practice progresses, the general speed of presentation of data to be\ntyped increases, and the intensity of lights on the simulated keyboard decreases.\nHowever all this happens in function of the error pattern of the trainee. He\/she\ngets longer to respond to letters which give difficulty, gets more intense clues\nand over a longer period of time for these letters and, furthermore, these letters\nbegin to occur at a frequency proportional to their level of difficulty. All this\noccurs in response to a trainee's individual pattern of errors. He\/she gets more\npractice, more time to respond and more help, adjusted on a continuous,\n'on-line' basis by the control algorithm built into-the trainer. This highly\nadaptive learning environment is extremely efficient, leading typical learners to\nachieve first-rate typing skills in only a few hours of drill-and-practice.\nRomiszowski goes on to discuss how similar adaptive computer-based training devices are\nnow fairly common in military training for developing other psychomotor and perceptual\nskills such as radar tracking, missile firing and aircraft gunnery. Military budgets, at least\nduring the time of the Cold War, permitted the release of finance to fund research into such\nsensory-motor training devices.\n. 68\nALTJ VOLUME 1 NUMBER 1\nBell (1990) takes the following line on SAKI:\nThe programme is interesting in that it structures an individual's learning,\npaying due regard to their initial skills, subsequent errors made and speed of\nprogress. SAKI monitors the learners' performance and adjusts exercises to\nprovide a constant challenge but not one so great as to become demotivating. In\ndoing so it clearly draws upon research into learning (particularly that of\nGordon Pask), and into the teaching of typewriting skills.\nRushby (1988) takes a similar positive attitude:\nIronically, one of the oldest and most widely used intelligent CBT packages\nhides its intelligence so successfully that users are deceived by its apparent\nsimplicity [...]\nThe skill of classical touch-typing is well-defined, and so it is possible for SAKI\nto contain an accurate model of the topic that is to be learned. The model of the\nlearner is built and continually adapted by SAKI as the learner works through\nsuccessive exercises. The program then applies its 'intelligence' to devise new\nexercises which build on the learner's strengths and tackle the weaknesses.\nThe result is, at first sight, unexceptional, but after about 20 minutes' use the\nlearner's concentration is intense and the rate at which touch-typing skills are\nacquired is remarkable.\nRushby's article draws attention to the primary dilemma facing a CBT package as\nsophisticated as SAKI, and which brings me to the principal point of this paper, impinging as\nit does on the design of training materials in general and interactive multimedia in particular.\nMultimedia for its own sake?\nThe question is: given that the presentation of a product is vital to its success, should a\ndesigner lower its pedagogical value by changing the the design features in favour of a greater\nacceptability? For example, does one decide on a multi-colour screen presentation, which may\nwell appeal to an audience unskilled or untrained in the fundamental basis of good\ninstructional design, when the use of colour can actually reduce the effectiveness of the\ntraining programme?\nThe size of the evaluation problem is illustrated by an interesting case. A major international\norganization specializing in CBT design and assessment (I am unfortunately obliged to\nwithhold the name) carried out an evaluation of SAKI supposedly under controlled conditions.\nThe evaluation team failed to erase the records SAKI was keeping of every move made, thus\nleaving precise evidence of the assessment procedures which had been followed. The result of\nthe evaluation was that the package was considered unsuitable as a training device for\n69\nMichael Horwood Interactivity and multimedia: the case ofSAKI\ndelivering touch-typing skills. SAKI's records were later examined. They showed that of the\ntwo individuals who carried out the evaluation, one had stayed with the package for less than\nfive minutes, the other for less than two minutes. Neither took a test, nor examined the testing\nfacilities, the customization features or the extensive record-keeping features.\nI bring this case to light in order to illustrate the practical problems associated with marketing\na high-quality training package where all the effort in the design has been concentrated into\nthe instructional process rather than into a striking or trendy user-interface. The bulk of\navailable touch-typing programs are decorated with multi-coloured screens, flashing \"well\ndone, Fred\" messages, and other such distractions from the fundamental job of delivering\ntouch-typing as a psychomotor skill. These are the programs, however, which attract and hold\nthe attention of professional reviewers and evaluators.\nOne thing is certain. Many touch-typing tutors have been designed over the years, some of the\nsimpler ones apparently having been constructed very rapidly and with little real consideration\nof genuine pedagogical value. The longest surviving is still SAKI, after some 35 years. It does\nnot typify an ultra-modern user interface, but nevertheless provides precisely the kind of\nautomatic adaptivity and interactivity which current computer technology aims to achieve.\nIn short, multimedia may be about attractive pictures, colourful screen displays and digitized\nsound, but if in a training package these features detract from the educational value of a\nprogram, they can do more harm than good to the reputation and therefore future prospects of\ninteractive applications. Interactivity does not and should not depend on fancy wrapping.\nReferences\nBell, C., ETTI, 26, 4.\nGentner, D. (1984), Expertise in Typewriting, Centre for Human Interface Processing,\nUniversity of California, San Diego, April 1984.\nLanda, L.N. (1976), Instructional Regulation and Control: Cybernetics, Algorithization and\nHeuristics in Education, Englewood Cliffs NJ, Educational Technology Publications.\nPask, G. (1958a), 'Electronic keyboard teaching machines', Journal of the National\nAssociation for Education and Commerce, July. Reprinted in Glazer, R. and Lumsdaine, A.\n(eds), Teaching Machines and Programmed Learning, Washington DC, National Education\nAssociation, 1, 336-49.\nPask, G. (1958b), 'Research on the design of adaptive teaching systems with a capability for\nselecting and altering their criteria for adaptation', Reports AF61 (052)-402, Aerospace\nMedical Research Laboratories.\n70\nALTJ VOLUME 1 NUMBER 1\nPask, G. (1960), 'The teaching machine as a control mechanism', Transactions of the Society\nfor Instrument Technology, 12, 2 (June).\nPask, G. and Lewis, B.N. (1965a), 'The theory and practice of adaptive teaching systems' in\nGlazer, R. (ed), Teaching Machines and Programmed Learning, Washington DC, National\nEducation Association, vol. II, Data and Directions, pp. 213-66.\nPask, G. (1965b), The Cybernetics of Human Learning and Performance, London,\nHutchinson.\nPask, G. (1980), 'Developments in conversation theory: Part I', International Journal of\nMan-Machine Studies, 13, 357-411.\nPask, G. (1982), 'SAKI: Twenty-five years of adaptive training into the microprocessor era',\nInternational Journal of Man-Machine Studies, 17, 69-74.\nPask, G. and Scott, B.C.E. (1973), 'CASTE: A system for exhibiting learning strategies and\nregulating uncertainty', International Journal of Man-Machine Studies, 5, 17-52.\nRomiszowski, A.J. (1986), Developing Auto-Instructional Materials, London, Kogan Page.\nRushby, N.J. (1988), 'Do we really need intelligent teaching systems?', Personnel\nManagement (March).\n71\n"}