{"doi":"10.1016\/j.atmosenv.2007.03.057","coreId":"140764","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/2647","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/2647","10.1016\/j.atmosenv.2007.03.057"],"title":"Enumerating actinomycetes in compost bioaerosols at source—Use of soil compost\nagar to address plate ‘mask","authors":["Taha, M. P. M.","Drew, Gillian H.","Tamer Vestlund, Asli","Aldred, David","Longhurst, Philip J.","Pollard, Simon J. T."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-07-01T00:00:00Z","abstract":"Actinomycetes are the dominant bacteria isolated from bioaerosols sampled at\ncomposting facilities. Here, a novel method for the isolation of actinomycetes\nis reported, overcoming masking of conventional agar plates, as well as reducing\nanalysis time and costs. Repeatable and reliable actinomycetes growth was best\nachieved using a soil compost media at an incubation temperature of 44 °C and 7\ndays’ incubation. The results are of particular value to waste management\noperators and their advisors undertaking regulatory risk assessments that\nsupport environmental approvals for compost facilit","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140764.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.atmosenv.2007.03.057","pdfHashValue":"498b19308815eada3db890c70d2f1eb02a7a74d6","publisher":null,"rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/2647<\/identifier><datestamp>2014-06-20T11:35:04Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Enumerating actinomycetes in compost bioaerosols at source—Use of soil compost\nagar to address plate ‘mask<\/dc:title><dc:creator>Taha, M. P. M.<\/dc:creator><dc:creator>Drew, Gillian H.<\/dc:creator><dc:creator>Tamer Vestlund, Asli<\/dc:creator><dc:creator>Aldred, David<\/dc:creator><dc:creator>Longhurst, Philip J.<\/dc:creator><dc:creator>Pollard, Simon J. T.<\/dc:creator><dc:subject>Actinomycetes<\/dc:subject><dc:subject>Bioaerosols<\/dc:subject><dc:subject>Compost<\/dc:subject><dc:subject>Enumeration<\/dc:subject><dc:subject>Risk assessment<\/dc:subject><dc:description>Actinomycetes are the dominant bacteria isolated from bioaerosols sampled at\ncomposting facilities. Here, a novel method for the isolation of actinomycetes\nis reported, overcoming masking of conventional agar plates, as well as reducing\nanalysis time and costs. Repeatable and reliable actinomycetes growth was best\nachieved using a soil compost media at an incubation temperature of 44 °C and 7\ndays’ incubation. The results are of particular value to waste management\noperators and their advisors undertaking regulatory risk assessments that\nsupport environmental approvals for compost faciliti<\/dc:description><dc:date>2011-10-11T08:01:32Z<\/dc:date><dc:date>2011-10-11T08:01:32Z<\/dc:date><dc:date>2007-07-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>M.P.M. Taha, G.H. Drew, A. Tamer Vestlund, D. Aldred, P.J. Longhurst and S.J.T Pollard, Enumerating actinomycetes in compost bioaerosols at source—Use of soil compost agar to address plate ‘masking’. Atmospheric Environment, Vol. 41(22), July 2007, Pages 4759-4765<\/dc:identifier><dc:identifier>0004-6981<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.atmosenv.2007.03.057<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/2647<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0004-6981","0004-6981"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Actinomycetes","Bioaerosols","Compost","Enumeration","Risk assessment"],"subject":["Article"],"fullText":"1Atmospheric Environment, Vol. 41(22), July 2007, Pages 4759-47651\nShort communication2\n3\nEnumerating actinomycetes in compost bioaerosols at source – use of soil4\ncompost agar to address plate ‘masking’5\n6\nM.P.M. Taha1, G.H. Drew1, A. Tamer Vestlund1, D. Aldred2, P.J. Longhurst17\nand S.J.T Pollard1*8\n9\n1Centre for Resource Management and Efficiency, Sustainable Systems Department, School10\nof Applied Sciences; and 2Cranfield Health, Cranfield University, Bedfordshire,11\nMK43 0AL, UK12\n13\nAbstract14\nActinomycetes are the dominant bacteria isolated from bioaerosols sampled at composting15\nfacilities. Here, a novel method for the isolation of actinomycetes is reported, overcoming16\nmasking of conventional agar plates, as well as reducing analysis time and costs. Repeatable17\nand reliable actinomycetes growth was best achieved using a soil compost media at an18\nincubation temperature of 44ºC and 7 days’ incubation. The results are of particular value to19\nwaste management operators and their advisors undertaking regulatory risk assessments that20\nsupport environmental approvals for compost facilities.21\n22\nKeywords: actinomycetes, bioaerosols, compost, enumeration, risk assessment23\n24\n*corresponding author Email address:\ns.pollard@cranfield.ac.uk (S.J.T. Pollard)\ntel: +44 (0)1234 754101; fax: +44 (0)1234 751671\n21 Introduction1\nActinomycetes are a heterogeneous group of filamentous bacteria resembling fungi.2\nThey are a major component of bioaerosols emitted from composting facilities (Strom, 1985;3\nLacey, 1997; Niemi et al., 1982; Swan et al., 2003). Mesophilic and thermophilic4\nactinomycetes have growth profiles of 20ºC-50ºC and 30ºC -60ºC, respectively. They grow5\nas branching microorganisms with short chains of spherical spores, 0.7–1.3 µm in diameter.6\nProlonged inhalation of actinomycetes is linked to adverse human health effects (Douwes et7\nal., 2003), including allergic alveolitis and other respiratory responses (Millner, 1982; Lacey8\nand Crook, 1988, Lacey and Dutkiewicz, 1994; Reboux et al., 2001; Herr et al., 2003), in9\nwhich inflammation of the lung is believed to be caused by glycopeptides and protein10\nallergens released from spores, as is the case for ‘farmer’s lung disease’ (Edwards, 1972).11\nActinomycetes concentrations, reported in colony forming units per cubic metre of air12\n(cfu\/m3), are among the micro-organisms that comprise the atmospheric bioaerosol burden13\nemitted from composting facilities (Composting Association, 1999; Taha et al., 2005; 2006).14\nIn the UK, a quantitative estimation of bioaerosol load is expected as part of risk assessments15\nfor composting facilities within 250m of sensitive receptors, prior to the development or16\nextension of such facilities and to inform permitting of Waste Licences (Environment17\nAgency, 2001). Meaningful risk assessments rely on quality source term data (Pollard et al.,18\n2006); particularly at source, so that downwind concentrations may be reliably approximated.19\nIn bioaerosol sampling methods based on the capture of culturable micro-organisms,20\nproblems associated with the identification and quantification of micro-organisms include21\ncolony ‘masking’, where colonies overlap (Chang et al., 1994; Chang et al., 1995; Chen et22\nal., 1998; Kalogerakis et al., 2005). Masking impedes the visual inspection of the media23\nplate and enumeration of individual species, which may lead to colony counting errors.24\nLacey (1997) suggests that the method used to collect samples may influence the growth of25\nother bacteria, and that this problem is particularly associated with isolating actinomycetes26\n3from compost samples. Researchers have also commented that selecting the appropriate1\nmedia for the environment in which the sample is collected may also improve the2\nenumeration results (Balestra and Misaghi, 1997).3\nHere, we introduce an alternative media, soil compost agar, for the improved enumeration4\nof actinomycetes from bioaerosols sampled close to source at two green waste composting5\nfacilities. Source term samples, we have found, are especially prone to masking and yet are6\nmost relevant to estimating the bioaerosol flux from compost facilities and so a reliable7\nenumeration method must be established. We believe that the method proposed here is of8\ntimely importance due to the current regulatory interest in occupational and public exposures9\nto bioaerosol emissions (Swan et al., 2003; Herr et al., 2003).10\n11\n2 Materials and methods12\n2.1 Bioaerosol and compost sampling13\nBioaerosol sampling was performed at two green waste windrow composting facilities,14\nwith capacities of 2000 m3 and 1000 m3 per annum respectively. Air and compost samples15\nwere taken on nine separate occasions between October 2003 and March 2005, covering the16\nwinter, spring and autumn seasons. The samples were taken (i) >15 m upwind of the facility17\nboundary; (ii) within the site; and (iii) at 15, 100 and 200 m downwind of the composting18\nfacility site boundary. Further details and the background context for our bioaerosols studies19\nat these composting facilities have previously been reported (Taha et al., 2005; 2006; 2007).20\nSampling employed medium flow, personal aerosol filter samplers (SKC Universal dust21\nand vapour sampling pump; models SKC Aircheck™ 224-PCXR8 and 224-PCTX8). Pumps22\noperated at 2.0 ± 0.1 l\/min and were fitted with SKC dust sampling IOM (Institute of23\nOccupational Medicine) heads connected using 10 mm i.d. Tygon™ tube. IOM heads were24\nloaded with 25 mm diameter, 0.8 µm MCE (mixed cellulose ester, SKC) filters. The IOM25\nsamplers were attached to a stand, 1.8m above ground, similar to the method used by26\n4Wheeler et al. (2001) and Environment Agency (2007). The sampling time was 30 minutes,1\nreduced to 10 minutes where the expected bioaerosol concentration was high. Two air2\nsamples were taken simultaneously in each case using two samplers, with one pump kept as a3\nstandby, as recommended by the Composting Association (1999). Both samples were treated4\nidentically in further analyses and the collection of simultaneous samples was used to5\nincrease the statistical significance of the results. All pumps were calibrated before use.6\nCompost grab samples (ca. 30 g) were also taken from the windrows associated with7\nbioaerosol release. The grab samples were taken from as close to the area where the air8\nsamples were taken as possible, usually at a depth of 0-10cm into the compost pile, which9\nhad already been shredded and turned so that there was homogenisation of the material. This10\nprocedure was adopted so as to sample the area most closely representing the area where the11\nair samples were collected.12\n13\n2.2 Isolation14\nMicro-organisms were quantified using the plate count analysis steps of the CAMNEA-15\nmethod (Collection of airborne microorganisms on nuclepore filters, estimation and analysis;16\nPalmgren et al., 1986) with subsequent visual enumeration. Filters and compost grab17\nsamples were placed, whilst at the site, into 30 ml vials containing 10 ml 0.05% v\/v Tween-18\n80™ mixed with 0.1% w\/v NaCl to prevent osmosis. Samples were transported at < 4°C and,19\non return to the laboratory, re-suspended by separating the filter from the head and shaking in20\na vial for 2 min. The solution was diluted to a common logarithm order (10-1, 10-2 and 10-3)21\nand inoculated onto both media plates. All equipment was sterilized before use.22\n2.3 Enumeration23\nMedia preparation, inoculation, dilution and sterilization were performed in accordance24\nwith BS 5763: Part 0:1996 (British Standards Institution, 1996). Two media were used: (a)25\nhalf strength nutrient agar (NA) (Oxoid CM3 nutrient agar); 14 g\/l, in ionised water; and (b)26\n5soil compost agar (SCA); a supernatant of 100g loam compost (John Innes™ No.1) with1\n1000ml deionised water was vigorously shaken for 2 min. and centrifuged at 500 rpm for 52\nmin. The SCA agar was prepared using 7g of agar-agar powder with 500ml deionised water,3\nwith no need for pH adjustment. After preparation, both media were autoclaved (121ºC for4\n15 minutes), left to cool to below 47°C and treated with 1% w\/v antifungal cycloheximide,5\ndissolved in 2ml of HPLC grade ethanol. In each case, the agar medium (12ml) was poured6\ninto petri dishes to a depth of ca. 2mm and allowed to cool on a horizontal surface before7\nbeing inoculated with the sample solution as described above. Colonies grown at an8\nincubation temperature of 44°C on both media were enumerated visually after 7 days,9\nemploying the BS 5763 standard (British Standards Institution, 1996).10\n11\n3 Results and discussion12\nActinomycetes were enumerated by estimated count from 76 air samples inoculated on13\nNA plates. However, 60 of these samples showed either full or partial overgrowth of other14\nbacteria (‘masking’) that obscured actinomycetes growth and it was therefore difficult to15\ncount the colonies of actinomycetes (Figure 1). This resulted in these plates being rejected.16\nFrom the 24 compost samples inoculated on NA plates, all showed ‘masking’ by overgrowth17\nof other bacteria (Table 1). Serial dilution of the samples was not able to address this18\nmasking effect that we attribute to a very high bacterial burden in samples taken very close to19\nsource.20\nIn contrast, the SCA plates, incubated at a temperature of 44°C, showed no masking by21\neubacteria or fungi (Table 1), after allowing 7 days for the actinomycetes to grow and22\nsporulate. In each case, the enumeration of actinomycetes colonies was proportionate to the23\ndilution factor applied in constructing the plates, improving the confidence interval limit of24\nthe study. The actinomycetes grown on SCA were easily identified by the white powdery25\ncolour of their spores and spider web-like formation appearing on the colonies (Figure 2). Of26\nthe 13 samples where no actinomycetes were found on the SCA plates, 1 of the NA plates27\n6showed bacteria growth with no actinomycetes, 7 of the NA plates showed no actinomycetes1\nand 5 NA plates showed masking by other bacteria.2\nSeveral media have previously been used for the identification and enumeration of3\nactinomycetes (Table 2). The Composting Association (1999) suggests the use of half-4\nstrength nutrient agar. Most significantly, Crawford et al. (1993), during their experiments5\non plant roots in British soils, secured optimum enumeration using a low nutrient organic6\nmedia and compost extract agar and using this, the overgrowth of media by eubacteria and7\nfungi was dramatically reduced. Curtis and Beuchat (1998) argue that a common problem8\nrelated to quality control of culture media is the non-inhibition and growth of unwanted9\nmicro-organisms on selective media. High colony counts of unwanted micro-organisms may10\nlead to significant colony overlap on the growth media plate, ‘masking’ the growth of the11\nspecies of interest.12\nThe enumeration methodology described here offers substantive methodological13\nimprovements over existing approaches (Composting Association, 1999) and allows a14\nreliable estimation of the actinomycetes load, especially where concentrations are expected to15\nbe high, such as at source. This method has proved useful in achieving consistent results. In16\naddition, it has proven to be cost effective and simple, as well as reducing analysis time. This17\nmethod is also inline with the findings of Griffiths and Stewart (1999), who suggest the18\ntailoring of micro-organism analysis for the application of interest, as it focuses on19\ncomposting. This is because no one single assay is suitable for the study of micro-organisms.20\nThe results presented here are encouraging for the further development of this method.21\nFuture work will include the analysis of the consistency of the extracted compost supernatant,22\nas well as testing batch to batch variation and the use of different types of compost.23\n24\n4 Conclusions25\nA novel method for the enumeration of compost-derived actinomycetes close to source26\nand in bioaerosol samples has been supported by evidence from over 70 air and compost27\n7samples taken over 9 separate sampling days. The method is suited to the enumeration of1\nactinomycetes sampled from green waste compost facilities and significantly reduces the2\nmasking of actinomycetes by other bacteria. It provides substantive improvements over the3\nnutrient agar media (e.g. Nielsen et al., 1997; Würtz and Breum, 1997; and Breum et al.,4\n1997) for source term samples. The method is cost effective, reduces analysis time and5\nproduces replicable results. Its application is particularly significant for practitioners6\nenumerating bioaerosols in support of regulatory risk assessments for the waste management7\nsector.8\n9\nAcknowledgements10\nThis research was supported by the Malaysian Department of Health. MPMT was11\nseconded to Cranfield University through the Malaysian Continuing Professional12\nDevelopment (CPD) Scheme. GHD is an Environment Agency-supported postdoctoral13\nfellow (Science project P1-514). AT is sponsored by an EPSRC doctoral training award. We14\nacknowledge the technical support of Ester Baxter and Professor Naresh Magan of Cranfield15\nUniversity. The opinions expressed are those of the authors’ alone.16\n17\n5 References18\n19\nAndreeva, I.S., Belan, B.D., Borodulin, A.I., Buryak, G.A., Zhukov, V.A., Panchenko, M.V.,20\nPenenko, V.V., Petrishchenko, V.A. and Safatov, S.A., 2001. Variability of the content of21\nlive microorganisms in the atmospheric aerosol in southern regions of western Siberia.22\nDoklady Biological Sciences, 318, 1-6, 530-534.23\nAsan, A., Ilhan, S., Sen, B., Erkara, I.P., Filik, C., Cabuk, A., Demirel, R., Ture, M., Okten,24\nS.S. and Tokur, S., 2004. Airborne fungi and actinomycetes concentrations in the air of25\nEskisehir city (Turkey). Indoor and Built Environment, 13, 63-74.26\n8Balestra, G.M., and Misaghi, I.J., 1997. Increasing the efficiency of the plate counting1\nmethod for estimating bacterial diversity. Journal of Microbiological Methods, 30, 111-2\n117.3\nBreum, N.O., Nielsen, B.H., Nielsen, E.M., Midtgaard, U. and Poulsen, O.M., 1997.4\nDustiness of compostable waste: a methodological approach to quantify the potential of5\nwaste to generate airborne micro-organisms and endotoxin. Waste Management &6\nResearch, 15, 169-187.7\nBritish Standards Institution, 1996. Methods for microbiological examination of food and8\nanimal feeding stuffs — Part 0: General laboratory practices, British Standard BS 5763-9\n0:1996, British Standards Instiution, London, 41 pp.10\nChang, C.W., Hwang, Y.H., Grinshpun, S.A., Macher, J.A. and Willeke, K., 1994.11\nEvaluation of counting error due to colony masking in bioaerosol sampling. Applied and12\nEnvironmental. Microbiology, 60, 10, 3732 – 3738.13\nChang, C.W., Grinshpun, S.A., Willeke, K., Macher, J.A., Donnelly, J., Clark, S. and14\nJuozaitis, A., 1995. Factors affecting microbiological colony count accuracy for15\nbioaerosol sampling and analysis. American Industrial Hygiene Association Journal, 56,16\n10, 979-986.17\nChen, C.C., Yu, T.S., Chang, J.Y., Chang, C.W., Shih, T.S., Hwang, J.S., 1998. A computer18\nsimulation study on bioaerosol colony counting error due to masking effect. Annals of19\nOccupational Hygiene, 41, 7, 501-510.20\nComposting Association, 1999. Standardised protocol for the sampling and enumeration of21\nairborne micro-organisms at composting facilities. ISBN 0 9532546 2 3, 30 pages.22\nCrawford, D.L., Lynch, J.M., Whipps, J.M. and Ousley, M.A., 1993. Isolation and23\ncharacterization of fungal actinomycete antagonists of a fungal root pathogen. Applied24\nand Environmental Microbiology, 59, 11, 3899-390525\nCurtis, G.D.W., Beuchat, L.R., 1998. Quality control of culture media – perspectives and26\nproblems. International Journal of Food Microbiology, 45, 3-6.27\n9Douwes, J., Thorne, P., Pearce, N. and Heederik, D., 2003. Bioaerosol health effects and1\nexposure assessment: progress and prospects. Annals of Occupational Hygiene 47, 3,2\n187-200.3\nDutkiewicz, J., Olenchock, S.A., Krysińska-Traczyk, E., Skórska, C., Sitkowska, J. and4\nPrażmo, Z., 2001. Exposure to airborne microorganisms in fibreboard and chipboard5\nfactories. Annals of Agricultural and Environmental Medicine, 8, 191-199.6\nEdwards, J.H., 1972, The isolation of antigens associated with farmer’s lung. Clinical and7\nExperimental Immunology, 11, 341-3558\nEnvironment Agency, 2001. Agency position on composting and health effects, Bristol.9\nAvailable online at http:\/\/www.environment-agency.gov.uk10\nEnvironment Agency, 2007. Bioaerosols in waste composting: deriving source terms and11\ncharacterising profiles. Science Report, Environment Agency, Bristol, in press.12\nFolmsbee, M.and Strevett, K.A., 1999. Bioaerosol concentration at an outdoor composting13\ncenter. Journal of Air and Waste Management Association, 49, 554-561.14\nGriffiths, W.D. and Stewart, I.W., 1999. Performance of bioaerosol samplers used by the UK15\nbiotechnology industry. Journal of Aerosol Science, 30, 8, 1029-1040.16\nHerr, C.E.W., zur Nieden, A., Jankofsky, M., Stilianakis, N.I., Boedeker, R.-H. and Eikmann17\nT.F., 2003. Effects of bioaerosol polluted outdoor air on airways of residents: a cross18\nsectional study. Occup Environ Med, 60, 336-342.19\nKalogerakis, N., Paschali, D., Lekaditis, V., Pantidou, A., Eleftheriadis, K. And Lazaridis,20\nM., 2005. Indoor air quality – bioaerosol measurements in domestic and office premises.21\nAerosol Science, 36, 751-761.22\nLacey, J. and Dutkiewicz, J., 1976. Methods for examining the microflora of mouldy hay.23\nJournal of Applied Bacteriology, 41, 13-27.24\nLacey, J. and Crook, B., 1988. Fungal and actinomycete spores as pollutants of the workplace25\nand occupational allergens. Annals of Occupational Hygiene, 32, 515-533.26\n10\nLacey, J. and Dutkiewicz, J., 1994. Bioaerosols and occupational lung disease. Journal of1\nAerosol Science, 25, 1371-1404.2\nLacey, J., 1997. Actinomycetes in Compost. Annals of Agricultural and Environmental3\nMedicine, 4, 113-121.4\nLavoie, J. and Alie, R., 1997. Determining the characteristics to be considered from a worker5\nhealth and safety standpoint in household waste sorting and composting plants. Annals of6\nAgricultural and Environmental Medicine, 4, 123-128.7\nMillner, P.D., 1982. Thermophilic and thermotolerance actinomycetes in sewage-sludge8\ncompost. Developments in Industrial Microbiology, 23, 61-80.9\nNielsen, B.H., Wuertz, H. Breum, N.O. and Poulsen, O.M., 1997. Microorganisms and10\nendotoxin in experimentally generated bioaerosols from composting household waste,11\nAnnals of Agricultural and Environmental Medicine, 4, 1, 159-168.12\nNiemi, R.M., Knuth, S. and Lundström, K., 1982. Actinomycetes and Fungi in Surface13\nWaters and in Potable Water. Applied and Environmental Microbiology, 43, 2, 378-388.14\nPalmgren, U., Strom, G., Blomquist, G. and Malmberg, P., 1986. Collection of airborne15\nmicro-organism on nuclepore filters estimation and analysis – CAMNEA method. Journal16\nof Applied Bacteriology, 61, 401-406.17\nPollard, S.J.T., Smith, R., Longhurst, P.J., Eduljee, G. and Hall, D., 2006. Recent18\ndevelopments in the application of risk analysis to waste technologies. Environment19\nInternational, in press.20\nReboux, G., Piarroux, R., Mauny, F., Madroszyk, A., Millon, L., Bardonnet, K. and Dalphin,21\nJ.C., 2001. Role of molds in farmer’s lung disease in Eastern France. American Journal of22\nRespiratory and Critical Care Medicine, 163, 17, 1534-1539.23\nRecer, G.M., Browne, M.L., Horn, E.G., Hill, K.M. and Boehler, W.F., 2001.Ambient air24\nlevels of aspergillus fumigatus and thermophilic actinomycetes in a residential25\nneighborhood near a yard-waste composting facility. Aerobiologia, 17, 99-108.26\n11\nStrom, P.F., 1985. Identification of thermophilic bacteria in solid-waste composting. Applied1\nand Environmental Microbiology, 50, 4, 906-913.2\nSwan, J.R.M., Kelsey, A., Crook, B. and Gilbert, E.J., 2003. Bioaerosol components and3\nhazard to human health, in Occupational and environmental exposure to bioaerosols from4\ncomposts and potential health effects-a critical review of published data, research report5\n130, HSE Books, pp. 15-20.6\nTaha, M.P.M., Pollard, S.J.T., Sarkar, U. and Longhurst, P.J, 2005. Estimating fugitive7\nbioaerosol releases from static compost windrows: feasibility of a portable wind tunnel8\napproach. Waste Management, 25, 445-450.9\nTaha, M.P.M, Drew, G.H., Longhurst, P.J., Smith, R. and Pollard, S.J.T., 2006. Bioaerosol10\nreleases from compost facilities: Evaluating passive and active source terms at a green11\nwaste facility for improved risk assessments. Atmospheric Environment, 40, 1159-1169.12\nTaha, M.P.M, Drew, G.H., Tamer, A., Hewings, G., Jordinson, G., Longhurst, P.J., and13\nPollard, S.J.T., 2007. Improving bioaerosol exposure assessments of composting14\nfacilities – comparative modelling of emissions from different compost ages and15\nprocessing activities. Atmospheric Environment, in press.16\nWheeler, P.A., Stewart, I., Dumitrean, P. and Donovan, B., 2001. Health effects of17\ncomposting: a study of three compost sites and review of past data. R & D Technical18\nReport P1-315\/TR, Environmental Agency, Bristol, UK (2001).19\nWürtz, H. and Breum, N.O., 1997. Exposure to microorganisms during manual sorting of20\nrecyclable paper of different quality. Annals of Agricultural and Environmental Medicine,21\n4, 129-135.22\n23\nFigure captions24\nFig 1. Actinomycetes growth using half strength nutrient media (NA). Plates show clear25\nevidence of masking effect, as individual colonies of actinomycetes are difficult to26\ndistinguish.27\n12\n1\nFig 2. Actinomycetes growth using soil compost agar (SCA). Plates show clear evidence of2\nimproved visual inspection using soil compost agar, as individual colonies of actinomycetes3\nare clearly visible.4\n5\nTable captions6\nTable 1: Actinomycetes growth from compost and air samples for the soil compost agar7\n(SCA) and the half strength nutrient agar (NA) (Samples were taken on 9 separate occasions8\nbetween 26\/10\/2003 and 10\/03\/2005).9\n10\nTable 2: Media used for the identification and enumeration of actinomycetes.11\n12\n13\n14\n13\nTable 1: Enumeration outcome for air and compost samples with actinomycetes growth1\nusing soil compost agar (SCA) and half strength nutrient agar (NA) (samples taken on 92\noccasions between 26\/10\/2003 and 10\/03\/2005).3\nair samples compost samples\nSCA NA SCA NAenumeration outcome\nSamplesa %b Samplesa %b Samplesa %b Samplesa %b\nactinomycetes\nenumeration achieved\n28 37 0 0 23 96 0 0\nactinomycetes\nenumeration achieved\nby estimated count\n33 44 6 8 1 4 0 0\nfull masking 0 0 48 63 0 0 22 92\npartial masking 0 0 12 16 0 0 2 8\nno actinomycetes 13 17 8 11 0 0 0 0\nbacteria, no\nactinomycetes\n1 1 2 3 0 0 0 0\ntotal samples 75 100 76 100 24 100 24 100\naThe number of samples that achieved each enumeration outcome4\nbThe percentage of samples for each media that achieved each enumeration outcome5\n6\nTable 2: Media used for the identification and enumeration of actinomycetes7\nmedium reference\nnutrient Oxoid agar Nielsen et al. (1997), Würtz and Breum (1997)\nand Breum et al. (1997)\nhalf strength nutrient agar Composting Association (1999)\n10% w\/v nutrient agar Nielsen et al. (1997), Würtz and Breum (1997)\nand Breum et al. (1997)\nstarch-casein (CS) agar Folmsbee and Strevett (1999)\nCzapek’s solution agar (CZ) Asan et al. (2004)\nstarch-ammonia medium Andreeva et al. (2001)\nhalf-strength (50%w\/v) nutrient Lacey and Dutkiewicz (1976);\nRecer et al. (2001)\ntryptone soya with casein hydrolysate agar Lacey and Dutkiewicz (1976);\nRecer et al. (2001)\nhalf-strength tryptic soya agar Dutkiewicz et al., (2001)\ntrypticase soya agar Lavoie and Alie (1997)\nlow nutrient organic media and compost extract agar Crawford et al. (1993)\n8\n14\n1\nFig 1. Actinomycetes growth using half strength nutrient media (NA). Plates show clear2\nevidence of masking effect, as individual colonies of actinomycetes are difficult to3\ndistinguish.4\n5\n15\n1\nFig 2. Actinomycetes growth using soil compost agar (SCA). Plates show clear evidence of2\nimproved visual inspection using soil compost agar, as individual colonies of actinomycetes3\nare clearly visible.4\n5\n6\n7\n"}