{"doi":"10.1016\/j.jvolgeores.2009.08.014","coreId":"58310","oai":"oai:nora.nerc.ac.uk:9153","identifiers":["oai:nora.nerc.ac.uk:9153","10.1016\/j.jvolgeores.2009.08.014"],"title":"Modelling the lava dome extruded at Soufriere Hills Volcano, Montserrat, August 2005-May 2006. Part II, rockfall activity and talus deformation","authors":["Hale, A.J.","Calder, E.S.","Loughlin, S.C.","Wadge, G.","Ryan, G.A."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2009","abstract":"During many lava dome-forming eruptions, persistent rockfalls and the concurrent development of a substantial talus apron around the foot of the dome are important aspects of the observed activity. An improved understanding of internal dome structure, including the shape and internal boundaries of the talus apron, is critical for determining when a lava dome is poised for a major collapse and how this collapse might ensue. We consider a period of lava dome growth at the Soufrière Hills Volcano, Montserrat, from August 2005 to May 2006, during which a not, vert, similar 100 × 106 m3 lava dome developed that culminated in a major dome-collapse event on 20 May 2006. We use an axi-symmetrical Finite Element Method model to simulate the growth and evolution of the lava dome, including the development of the talus apron. We first test the generic behaviour of this continuum model, which has core lava and carapace\/talus components. Our model describes the generation rate of talus, including its spatial and temporal variation, as well as its post-generation deformation, which is important for an improved understanding of the internal configuration and structure of the dome. We then use our model to simulate the 2005 to 2006 Soufrière Hills dome growth using measured dome volumes and extrusion rates to drive the model and generate the evolving configuration of the dome core and carapace\/talus domains. The evolution of the model is compared with the observed rockfall seismicity using event counts and seismic energy parameters, which are used here as a measure of rockfall intensity and hence a first-order proxy for volumes. The range of model-derived volume increments of talus aggraded to the talus slope per recorded rockfall event, approximately 3 × 103–13 × 103 m3 per rockfall, is high with respect to estimates based on observed events. From this, it is inferred that some of the volumetric growth of the talus apron (perhaps up to 60–70%) might have occurred in the form of aseismic deformation of the talus, forced by an internal, laterally spreading core. Talus apron growth by this mechanism has not previously been identified, and this suggests that the core, hosting hot gas-rich lava, could have a greater lateral extent than previously considered","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/58310.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/9153\/1\/PaperIIsubmittedPt2.pdf","pdfHashValue":"58ee62402b2b13012dab38e04749595ca15c591c","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:9153<\/identifier><datestamp>\n      2012-11-22T12:07:37Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9153\/<\/dc:relation><dc:title>\n        Modelling the lava dome extruded at Soufriere Hills Volcano, Montserrat, August 2005-May 2006. Part II, rockfall activity and talus deformation<\/dc:title><dc:creator>\n        Hale, A.J.<\/dc:creator><dc:creator>\n        Calder, E.S.<\/dc:creator><dc:creator>\n        Loughlin, S.C.<\/dc:creator><dc:creator>\n        Wadge, G.<\/dc:creator><dc:creator>\n        Ryan, G.A.<\/dc:creator><dc:description>\n        During many lava dome-forming eruptions, persistent rockfalls and the concurrent development of a substantial talus apron around the foot of the dome are important aspects of the observed activity. An improved understanding of internal dome structure, including the shape and internal boundaries of the talus apron, is critical for determining when a lava dome is poised for a major collapse and how this collapse might ensue. We consider a period of lava dome growth at the Soufrière Hills Volcano, Montserrat, from August 2005 to May 2006, during which a not, vert, similar 100 × 106 m3 lava dome developed that culminated in a major dome-collapse event on 20 May 2006. We use an axi-symmetrical Finite Element Method model to simulate the growth and evolution of the lava dome, including the development of the talus apron. We first test the generic behaviour of this continuum model, which has core lava and carapace\/talus components. Our model describes the generation rate of talus, including its spatial and temporal variation, as well as its post-generation deformation, which is important for an improved understanding of the internal configuration and structure of the dome. We then use our model to simulate the 2005 to 2006 Soufrière Hills dome growth using measured dome volumes and extrusion rates to drive the model and generate the evolving configuration of the dome core and carapace\/talus domains. The evolution of the model is compared with the observed rockfall seismicity using event counts and seismic energy parameters, which are used here as a measure of rockfall intensity and hence a first-order proxy for volumes. The range of model-derived volume increments of talus aggraded to the talus slope per recorded rockfall event, approximately 3 × 103–13 × 103 m3 per rockfall, is high with respect to estimates based on observed events. From this, it is inferred that some of the volumetric growth of the talus apron (perhaps up to 60–70%) might have occurred in the form of aseismic deformation of the talus, forced by an internal, laterally spreading core. Talus apron growth by this mechanism has not previously been identified, and this suggests that the core, hosting hot gas-rich lava, could have a greater lateral extent than previously considered.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2009<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9153\/1\/PaperIIsubmittedPt2.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Hale, A.J.; Calder, E.S.; Loughlin, S.C.; Wadge, G.; Ryan, G.A..  2009  Modelling the lava dome extruded at Soufriere Hills Volcano, Montserrat, August 2005-May 2006. Part II, rockfall activity and talus deformation.   Journal of Volcanology and Geothermal Research, 187 (1-2). 69-84.  https:\/\/doi.org\/10.1016\/j.jvolgeores.2009.08.014 <https:\/\/doi.org\/10.1016\/j.jvolgeores.2009.08.014>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/journal\/03770273<\/dc:relation><dc:relation>\n        10.1016\/j.jvolgeores.2009.08.014<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/9153\/","http:\/\/www.sciencedirect.com\/science\/journal\/03770273","10.1016\/j.jvolgeores.2009.08.014"],"year":2009,"topics":[],"subject":["Publication - Article","PeerReviewed"],"fullText":"1Modelling the Lava Dome Extruded at Soufriere Hills Volcano, Montserrat, \nAugust 2005 - May 2006\nPart II: Rockfall Activity and Talus Deformation\nA. J. Hale1\nE. S. Calder2 \nS. C. Loughlin3\nG. Wadge4\nG. A. Ryan5\n1. School of Geosciences, The University of Sydney, NSW 2006, Australia\n2. Centre for Geohazards, Dept. Geology, State University of New York at Buffalo, USA\n3. British Geological Survey, Edinburgh, EH9 3LA, UK\n4. Environmental Systems Science Centre, University of Reading, Reading RG6 6AL, UK\n5. Institute of Earth Science and Engineering, University of Auckland, 1142, New \nZealand\n12th February 2009\nManuscript\nClick here to view linked References\n2Abstract\nDuring many lava dome-forming eruptions, persistent rockfalls and the concurrent development \nof a substantial talus apron around the foot of the dome are important aspects of the observed \nactivity. An improved understanding of internal dome structure, including the shape and internal \nboundaries of the talus apron, is critical for determining when a lava dome is poised for a major \ncollapse and how this collapse might ensue. We consider a period of lava dome growth at the \nSoufrière Hills Volcano, Montserrat, from August 2005 to May 2006, during which a ~100 M m3\nlava dome developed that culminated in a major dome collapse event on 20 May 2006. We use \nan axi-symmetrical Finite Element Method model to simulate the growth and evolution of the \nlava dome, including the development of the talus apron. We first test the generic behaviour of \nthis continuum model, which has core lava and carapace\/talus components. Our model describes \nthe generation rate of talus, including its spatial and temporal variation, as well as its post-\ngeneration deformation, which is important for an improved understanding of the internal \nconfiguration and structure of the dome. We then use our model to simulate the 2005 to 2006 \nSoufriere Hills dome growth using measured dome volumes and extrusion rates to drive the \nmodel and generate the evolving configuration of the dome core and carapace\/talus domains. The \nevolution of the model is compared with the observed rockfall seismicity using event counts and \nseismic energy parameters, which are used here as a measure of rockfall intensity and hence a \nfirst-order proxy for volumes. The range of model-derived volume increments of talus aggraded \nto the talus slope per recorded rockfall event, approximately 3,000 - 13,000 m3 per rockfall, is \nhigh with respect to estimates based on observed events. From this, it is inferred that some of the \nvolumetric growth of the talus apron (perhaps up to 60 - 70%) might have occurred in the form \nof aseismic deformation of the talus, forced by an internal, laterally spreading core.  Talus apron \ngrowth by this mechanism has not previously been identified, and this suggests that the core, \nhosting hot gas-rich lava, could have a greater lateral extent than previously considered.\n31. Introduction\nSilicic lava domes are often surrounded by an apron of talus derived from rockfall activity. Here \nwe simulate the evolution of one dome growth period at Soufrière Hills Volcano (SHV), \nMontserrat using an axi-symmetrical Finite Element Method (FEM) computational model for \ndome growth, comprising of evolving core and carapace\/talus components (Hale, 2008). This \nmodel grows the lava dome endogenously, by adding lava to the core and adjusting the shape of \nthe talus. Lava dome growth has two end-member styles: endogenous (internal swelling) and \nexogenous (growth at the free surface). In a companion paper (Hale et al., in review), we discuss \nthe structure of the SHV lava dome and how it varies from dominantly exogenous and \ndominantly endogenous growth periods. We cannot model purely exogenous lava dome growth \nusing this continuum approach, due to the complexities involved in simulating the extrusion of \nindividual shear-bounded lobes of lava. Hence, by applying our endogenous dome growth model \nand neglecting exogenous growth processes we make the assumption that we are simulating only \nthe large-scale structure rather than the finer-scale surface physical processes, and that this does \nnot greatly influence the overall growth of the dome.  A thorough rationale and justification for \nthis approach is given in Hale et al., (in review). It is clear however, that our model can represent \nmost faithfully, dome growth periods that were characterized predominantly by endogenous \ngrowth. We apply this model to a period of continuous dome growth at SHV between August \n2005 and May 2006, during which time a ~100 Mm3 lava dome developed (Jones et al., 2006, \nLoughlin et al. 2006) and for which the endogenous model is considered reasonable (Hale et al., \nin review). This dome was the first of two major lava domes extruded during Phase III (August \n2005 to April 2007) of the eruption (Ryan et al., in review). Purely endogenous lava dome \ngrowth occurred for several short periods between August 2005 and May 2006 and there were \nsignificant episodes of shear lobe development believed to have included an endogenous \ncomponent (Loughlin et al., in review). Thus, volumetrically, endogenous growth was an \nimportant contribution to the construction of this particularly large dome. Indeed, this pattern \nappears to have also been common in the construction of large domes during Phases I and II. \nThe momentum equations of the dome growth model are formulated in an Eulerian framework \nand use the parallelised finite element-based PDE solver eScript\/Finley (Gross et al., 2007). The \nfree-surfaces of the dome and the core-talus interface are modelled utilising the level-set method, \n4a technique used to trace flow fronts and boundaries without distorting the model space\/mesh \n(Hale et al., 2007). A shear-thinning viscosity relationship for crystal-rich lava presented by \nLavallée et al. (2007) is used and compared with that of lava behaving in a Newtonian manner. \nIn a companion paper (Hale et al., in review) we describe how the internal structure of the \nmodelled dome evolves. Here, we focus on the modelled conversion of carapace to talus, which, \non the real dome would correspond to rockfall activity. This activity is observed and recorded via \nseismic records of individual rockfall events gathered by the Montserrat Volcano Observatory \n(MVO), and we use these data to test the models. \n2. Lava Dome Growth, Rockfalls and Seismicity\nExtrusion rates, dome morphology and growth style varied throughout Phase I of the eruption \n(1995-1998) with average extrusion rates reaching peaks of ~10m3\/s (Watts et al., 2002). During \nPhase II the extrusion rate was steadier and relatively low, rarely exceeding 4m3\/s (Herd et al. \n2005). During Phase III, extrusion rates varied with growth style and dome morphology as in \nPhase I but average extrusion rates up to 15m3\/s were measured (Loughlin et al., 2006). During \nperiods of low extrusion rate, dome growth was dominated by whalebacks (particularly at the \nonset of dome growth in 1995) and spines (Watts et al., 2002). During moderate extrusion rates \nshear lobes dominated and grew for weeks to months; importantly they included both exogenous \nand endogenous growth. Periods of higher extrusion rates suppressed microlite crystal growth \nand resulted in the extrusion of lower viscosity lava (‘pancake lobes’; Watts et al., 2002). \nDome growth can switch abruptly from entirely endogeneous to dominantly exogenous growth \nand a well-documented example of this occurred between October and December 1996 (Hale \nand Wadge, 2008). During this period, a rapidly growing endogenous dome slowed in growth \nconsiderably as its height reached approximately 120 m (Watts et al., 2002,). This was followed \nin mid-November by a directed intrusion into the dome creating a region of uplift over 30 m \nhigh. In mid-December growth style changed to dominantly exogenous and a blocky shear lobe \nwas extruded at between 4 and 6 m3s-1. Then on 25th December 1996 there was a pronounced \n5pulse of activity, heralded by localised surface doming, and a low-viscosity “pancake” lobe \nextruded at a rate of 6 to 9 m3s-1 (Watts et al., 2002).\nSequential and frequent collapses of the SHV lava dome occur as a natural consequence of both \nendogenous and exogenous growth. A continuum of collapse phenomena exists, ranging from \nlava block rockfalls, through small pyroclastic flows, to major dome-collapse events involving as \nmuch as 164 Mm3 of dome material (Herd et al. 2005). Collapse phenomena can be viewed as a \nmass wasting process, the rate of which is forced primarily by internal processes such as active \nintrusion and thrust forces, and gas pressurization. However, external processes such as lava flow \nfront disaggregation as it reaches steep slopes and intense rainfall can also play an important role \n(Calder et al., 2005, Barclay et al. 2006).\nRockfalls are the small volume end-member of collapse phenomena; they occur frequently, with \ncharacteristically between 20-160 rockfalls occurring daily at SHV during periods of active \ndome growth (Calder et al., 2002). They occur along high-angle failure planes on the outer, \nlargely degassed, carapace of the dome and may involve discrete blocks that roll, bounce or slide \ndownhill, or may be significant avalanches. Rockfalls rarely travel far beyond the base of the \ntalus apron 0.5 - 0.8 km from the dome summit. Rockfall activity is known to correlate with \ndirectional and temporal changes in lobe extrusion (Watts et al., 2002), as well as changes in \neruption style and extrusion rate (Calder et al., 2002, 2005; Loughlin et al., 2006). Increased \nrockfall activity also occurs as an immediate result of new batches of magma intruded into the \nbase of the dome and is intimately associated with cyclic crater rim ground deformation (Voight \net al., 1999). Calder et al. (2002) characterised two styles of rockfall generation, active and \npassive. Actively generated rockfalls are those sourced from actively growing areas on the dome \nsurface and involve the disintegration of hot material newly extruded at the dome surface. While \npassively generated rockfalls, occur as isolated events anywhere on the dome surface involving \nlargely degassed, cooler carapace material. These distinctions were made on the basis of a) \nprevious identification of the active growth regions, and b) observed differences in the vigour of \nconvection in the associated ash clouds from the relatively hot or cool source materials \nrespectively.\n6Pyroclastic flows are distinguished from rockfalls by their larger size, longer run-out distances \n(>0.5 km), and greater component of fine material, resulting in appreciable buoyant ash clouds.  \nDeposit volumes are typically in the order of 104-106 m3 for small to medium-sized (1-3 km run \nout) pyroclastic flows (Calder et al., 1999; Cole et al., 2002). Large dome collapses, in excess of \n1 x 106 m3, have occurred on 47 occasions throughout the eruption to date (Calder and Bernstein, \n2007). These collapses commonly occur as retrogressive failures of the dome over an extended \nperiod of time (minutes to hours) and excavate spoon-shaped cavities to depths of 400 m. \nBoth rockfalls and pyroclastic flows at the SHV excite distinctive emergent high frequency \nseismic signals on the MVO seismic network, as the dense, block-rich, material impacts the\nground surface as the flow propagates downslope (Luckett et al., 2002, Calder et al., 2002).  \nRelatively little work has been carried out on the seismic signals of rockfalls and pyroclastic \nflows from any lava dome eruption (Zobin, 2003). Their analysis is particularly complex due to \ntheir source mechanisms involving, a) a transfer of an unknown mass of material at the surface \nand, b) a source footprint which changes size, shape and location with time. For example, the \nduration of the signal produced by these avalanches corresponds to the time the avalanche spends \ntravelling over the ground surface (a function of distance covered and flow velocity) as well as, \nand importantly, the dispersion effects of the seismic signal which are not well constrained. \nSeismic amplitude is determined by a combination of factors, including rockfall mass, height of \ndome (potential energy), slope angle, and the damping behaviour of the unconsolidated substrate \nthat can change with time. Furthermore variations in amplitude can occur as a result of the pulse-\nlike nature of flow generation, due to retrogressive collapse initiation (Loughlin et al, 2002), but \nalso as a result of the pyroclastic flows changing proximity to the geophones as they approach \nand subsequently pass-by the stations (Jolly et al., 2002). Some pyroclastic flows, and most \nrockfalls, are only observed seismically and thus the seismic data, irrespective of its \ncomplexities, provides one of the most important and complete records for the collapse history \nof the dome.  \nRockfall seismicity parameters, such as event duration, maximum amplitude, energy, frequency \ncontent, and repose period are extracted from the continuous seismic data records by task-\nspecific algorithms. In order to compare with the model results, we use both the number of \n7rockfall events per day (referred to as event counts) and the measure of total energy (J\/Kg) as \nfirst-order indicators of the relative volume of material being shed as rockfalls with time. Both \nthese parameters provide a somewhat imperfect account of the accumulating talus volume. For \nexample, rockfall seismic event counts neglect variations in event magnitude, and a reasonable \nestimate is that individual event magnitudes could range over 4 orders of magnitude (101 – 104\nm3), meaning that event counts only provide a time-averaged accumulation rate over the duration \nof the dome-forming period. Rockfall energy or, strictly speaking energy density (J\/Kg), is \ncalculated by the SEISAN program as the sum of the squared amplitudes (measured in ms-1) of \nthe seismic record. This value is the number closest to a total source energy measurement that \ncan obtained for rockfall or pyroclastic flow waveforms, since conventional techniques to \ncalculate source energy for standard earthquakes cannot be applied to this type of rockfall \nseismic signal. Energy density measurements are complicated by time-varying path effects (such \nas the development of a thick talus substrate and changes in the impact of the rockfalls with the \ncrater wall), and vary from station-to-station depending on local path effects as well as proximity \nto a particular rockfall changing during run-out. A thorough analysis of the rockfall seismic data \nis required, but is beyond the scope of this paper. Here, and in the absence of better parameters, \nwe use the event counts and the variation in energy density as first-order proxies for the rockfall \naccumulation with time. Previous work illustrating clear relationships between the rockfall \nseismic data and the nature of observed dome growth and instability (Calder, 2002; Calder et al., \n2005), suggests this approach is valid.\n3. Computational Model, Lava Properties and Model Set-Up\nConceptually we can divide the lava dome into three units; a relatively intact and ductile interior \n(the core), a largely degassed region of intact lava that remains attached to the outer surface of \nthe core (the carapace), and a granular, friction-controlled more distal region (the talus). The \ndisaggregating carapace provides the source of the talus once it becomes critically unstable. \nFollowing Hale (2008) we do not explicitly model the carapace and talus as separate domains, \nbut rather the same region representing solidified degassed lava (Fig. 1). In our model, dome \ngrowth occurs at two timescales: continuous dome expansion, via the addition of new lava into \nthe ductile core interior and relatively instantaneous conversion and readjustment of part of the \n8carapace to talus once it oversteepens, as will be discussed in more detail below. The model \nboundaries, a typical mesh and key terms used in this paper are illustrated in Fig. 1. \nAlthough the rheology of crystal-rich lava is reasonably well understood (Lavallée et al., 2007), \nthe rheology of the talus is not well-constrained, and in reality is likely to vary spatially, with \nburial. For simplicity, we model the deformation of the entire dome (including the talus) as a \nductile fluid. Silicic lava has a low Deborah number (a measure of how fluid a material is given \nthe time-scales modelled or observed) and we assume the same for the talus components, but \nallow the viscosity to vary between the core and carapace\/talus regions. The incremental process \nof the conversion of carapace to talus and carapace\/talus readjustment is treated as a frictional-\ncontrolled granular material with a defined angle of repose. \nA solidus pressure isobar is used to determine where core material turns into carapace\/talus, a \none-way process in this model. This condition is used for two reasons. First, it is well known that \nas magma ascends and the pressure decreases, volatiles can be exsolved promoting \ncrystallisation and solidification (Cashman and Blundy, 2002; Hort, 1998). Intermediate lava, \nsuch as the andesitic lava of Soufrière Hills Volcano, is dominated by degassing-induced \ncrystallisation with cooling being negligible during lava dome emplacement (Sparks et al., \n2000). Therefore the solidus pressure can be used to mark the transition to a solid state \n(Simmons et al. 2005), and we simplify our model by assuming that only degassing-induced \ncrystallisation contributes to the growth of solid lava, i.e. the carapace\/talus, and neglect cooling. \nThe second reason is that a transition to a solid state as described by the solidus pressure is \nrelatively easy to implement computationally (Hale, 2008). \n3.1 Model Formulation\nDuring a single time-step of the model, we first calculate the velocity and pressure fields of the \ndome material, talus and core, and grow the dome accordingly. Next, the extent of the \ncarapace\/talus interface within the dome is re-calculated and the interface updated. The interface \nbetween the carapace\/talus and lava core is identified using knowledge of the existing core \nregion. The updated core region corresponds to where the dome has a pressure greater than or \nequal to the solidus pressure and where the dome material was originally designated as core. The \n9updated carapace\/talus region corresponds to regions where the core has a pressure less than the \nsolidus pressure or where dome material was originally designated as carapace\/talus. This \nprevents talus from being converted back into core material if the pressure becomes greater than \nthe solidus pressure, which does not happen in reality, hence the necessity for tracking this \ninterface. Lastly, the clastic nature of the talus allows readjustments so that it becomes \ngravitationally stable. Hence, clastic material is displaced to rest at the angle of repose, which \nentails the final stage during a model time-step. These sub-steps are repeated continuously to \nallow the lava dome to grow in time. See Hale (2008) for a thorough discussion of this model. \nThe axi-symmetric lava dome grows onto a horizontal base fed by lava from the conduit exit \napplied as a parabolic velocity field.\n3.2 Lava Properties and Model Set-Up\nOur model requires several input parameters including: the viscosity of the lava in the core and \ntalus regions, the extrusion rate or driving pressure, the solidus pressure, the friction angle for the \ntalus, and the shape of the lava dome base (Hale, 2008). We have parameterised the model with \nvalues appropriate for the August 2005 – May 2006 growth period on SHV, but the model is \ngeneric and can be applied to other volcanic systems. Dome growth is assumed to have begun at \n00:00hr on 1st August 2005. Our simulation starts with a small mound of lava above the conduit \nvent corresponding to dome growth at a time of 0.45 days, a simulation start time of 10:48hr on \n1st August 2005, and has a volume of 10,150 cubic metres (0.01% of the final dome volume). \nThe lava dome collapsed on 20th May 2006, 292 days after extrusion began and this corresponds \nto the end of the simulation. Dome growth is assumed to be axi-symmetric in a model space 450 \nm high and 500m in the radial dimension. A first-order element type is used with an element \nspacing of 2.5 metres. We now discuss appropriate values for these parameters and summarise \nthem in Tables 2 and 3. \n3.2.1 Viscosity\nThe lava extruded at SHV contains abundant crystals and bubbles with a crystallinity estimated \nto be between 65% and 95% (Sparks et al., 2000). Lavallée et al. (2007) performed viscosity \nmeasurements on crystal-rich lava, resulting in a singular dependence of viscosity on the strain-\nrate regardless of the geochemistry, the crystal content, and up to 25% bubbles. We use the\n10\nshear-thinning viscosity relationship without yield strength as presented in Lavallée et al. (2007) \nfor crystal-rich lava (Eqn. 1), \n log543.0\/8974993.0log  Tb .                                                                 (1)\nWhere b is the effective viscosity in Pa s, T is the temperature in degrees centigrade (a constant \nvalue of 830ºC is used here (Barclay et al., 1998)), and  is the strain-rate. One limitation with \nthis relationship is that as the strain rate goes to zero, the effective viscosity goes to infinity. \nTherefore, a minimum strain rate cut-off value of 10-5 s-1 is used. This corresponds to a \nmaximum viscosity of 3.4x1012 Pa s. This is reasonable because Caricchi et al. (2007) showed \nthat lava samples behave in a Newtonian manner for strain rates below 10-5 s-1. \n3.2.2 Geometry\nThe approximate height of the vent for SHV lava dome on 1st August 2005 was at 680 m above \nsea level (a.s.l.) (Loughlin et al., 2006) and the dome base is assumed to be a flat horizontal \nplane for our simulations. In reality, the August 2005 – May 2006 SHV lava dome grew within a \nrelatively open crater, with a base which sloped at approximately 12 - 15º to the ENE (Hale et \nal., in review). For simplicity, we assume that the dome was extruded approximately axi-\nsymmetrically, allowing us to model the dome using axi-symmetrical coordinates to significantly \nreduce the computer solving time. Until the lava dome is sufficiently large that its growth starts \nto be influenced by the crater wall, axi-symmetrical growth is considered a reasonable \napproximation.\n3.2.3 Volume \nThe lava dome grew within English’s Crater, which is open to the east-northeast. This means that \npyroclastic flows and talus were constrained by the crater walls in all other directions until the \nsummit of the dome reached a height greater than approximately 960 metres above sea level \n(Wadge, in press). Between 3% and 12% by mass of the dome was converted to pyroclastic flow \ndeposits during August 2005 – May 2006, however we make no explicit account for this in the \nmodel. Mass-loss due to energetic pyroclastic flows may be an important process at later times in \nthe growth of the dome and could be easily implemented into the dome model by adjusting the \n11\ndome free-surface. However, without detailed observations of this process it would be \ninappropriate to introduce this variable into the model at this stage.\n3.2.4 Density\nIn the natural system, the process of talus formation can act to increase the volume of talus with \nrespect to the more compact carapace from which it is sourced. This volume change results in a \ndensity change; however, for simplicity we neglect any density change from core to carapace to \ntalus in our simulation. Furthermore, the rheological properties of the lava dome may vary \nsubstantially within the dome. As the talus wedge gets thicker the more basal parts may increase \nin density and become stronger by pressure-induced tighter packing of clasts. \n3.2.5 Extrusion Rate\nUsing the MVO survey data of the dome volume for the period August 2005 to May 2006 \n(Loughlin et al. 2006; Ryan et al in prep), the volume change with time can be calculated. The \nprocess of talus formation increases the volume of talus compared to compact carapace or core. \nWadge et al. (2008) used a ratio of 0.86:0.54 for core to talus to normalise the resultant volumes, \nbut because we cannot account for separate core-talus volumes throughout this period we do not \napply this here. In Figure 2 a best fit curve for the change in volume of the dome over time is \napplied and the cumulative volumeV (M m3) is approximated as:\nddd tttV\n22536 1020.21076.21073.3   ,                                              (2)\nwhere dt is the time in days. Using this best-fit volume-time relationship, the extrusion rate is \nobtained by taking the gradient, and this is what we use as the input for the model.\n3.2.5 Talus Friction Angle\nThe angle of repose for the lava dome talus can vary spatially from being relatively steep (43 -\n32o) near the carapace-covered core (Fig. 4 in Hale et al., in review), to less steep (<32o) more \ndistally. These values are consistent with talus slope of 30-43.5o degrees measured by AVTIS \nduring 2006 (Wadge et al., 2008). Our model has a fixed value for the talus angle of repose \nthrough the duration of the simulation, but we vary it’s magnitude between 37º and 43.5º in \n12\ndifferent simulations. Conventionally, it is assumed that the slope of the talus is considerably \nlower, approximately 33º, however, this appears not to have been the case at least during the \nperiods measured. During the course of the eruption, the talus angle of repose on different flanks \nof the dome has been observed to vary, and this variation is probably a reflection of how the \ntalus was deposited. For example, during periods of primarily exogenous dome growth, there are \noften numerous energetic rockfalls or pyroclastic flows and the resulting talus slope is lower than \nits critical angle of repose due to the additional kinetic energy associated with these flows (Lube \net al., 2005). However, during periods when dome growth is predominantly endogenous or \nwhere there are fewer energetic rockfalls or pyroclastic flows, the resultant talus slope rests \ncloser to its critical angle of repose.\n3.2.6 Solidus Pressure\nThe solidus temperature is not well constrained at low pressures, but during the growth of the \nlava dome on SHV in early October 1996, Watts et al. (2002) noted that the rubbly carapace was \nonly a few metres thick. This suggests that the solidus pressure can be relatively small. A \ncarapace with a thickness of 10 metres is equivalent to a solidus pressure of approximately 0.34 \nMPa when considering gravity and atmospheric pressure alone. A range of values from 0.2 to 0.6  \nMPa are used (Table 3).\n4. Results\nWe present the result of eight simulations, seven using a shear-thinning viscosity relationship \n(Lavallée et al., 2007), and one using a Newtonian viscosity relationship (Table 3). The solidus \npressure and friction angle are the parameters varied in the simulations because all the other \nmain parameters are relatively well constrained. When using the strain-rate dependent viscosity \nrelationship (Eqn. 1) we apply a strain-rate cut-off value of 10-5 s-1 for the core\/talus \ncorresponding to maximum viscosity of 3.4x1012 Pa s, so that viscosity does not tend to infinity \n(as described in Hale et al., In review). We acknowledge that it may not be appropriate to model \nthe talus as having the same viscosity relationship as the core. In the talus, fine-grained infill and \nincipient cementation may start to develop a cohesive strength. The reduction of porosity by \nrotation, grain deformation and fine grain infill will increase grain contact surface area and hence \n13\nbulk friction coefficients. Thus the internal friction of the talus may increase and to account for \nthis change in bulk system properties we can increase the strength of the talus with respect to the \ncore properties. Therefore, we also simulate dome growth using a shear thinning, strain-rate \ndependent, viscosity relationship (Eqn. 3) with a strain-rate cut-off value of 10-5 corresponding to \nmaximum viscosity of 3.4x1012 for the lava core, while the talus has a viscosity ten to thirty \ntimes higher than the maximum cut-off viscosity used for the core. The range of values for the \nmodels is given in Table 1, while the specific values for simulations are given in Table 2.\nWe first consider a generic model of lava dome growth and talus generation for fixed extrusion \nrates to observe the extent of talus development. Following this, we consider lava dome growth \nat SHV for one particular period of dome growth from August 2005 to May 2006 using the \nobserved volume and hence time-dependent extrusion rate (Fig. 2).\n4.1 Generic Dome Growth Models\nOur generic dome model uses both a shear-thinning viscosity relationship (Lavallée et al., 2007) \nand a constant Newtonian viscosity of 3.4x1012 Pa s. We use a talus angle of repose of 40º, an \nappropriate intermediate value for the observed slope of the talus on Soufrière Hills Volcano \n(Wadge et al., 2008), a conduit radius of 15 metres, a lava density of 2350 kgm-3, and a solidus \npressure of 0.4 MPa, including atmospheric pressure, to model dome growth for four constant \nextrusion rates (2, 4, 6, and 8 m3\/s). These simulations provide a generic understanding of how \nthe talus grows and re-adjusts in the models, as well as how extrusion rate variations influence \nthe rate of talus growth. \n4.1.1: Height and Radius of the Lava Dome\nThe growth of the dome is essentially self-similar, i.e. exhibiting the same maximum height and \nradius, for a given dome volume. However, as shown, the volume of talus adjusted and core \nvolume fraction can vary significantly depending upon the extrusion rate (Fig.3). \n4.1.2: Talus Adjustment Location\n14\nThe first stage of each simulation iteration involves the injection of fresh lava into the dome \ncore, often resulting in the free-surface of the dome resting at angles greater than the angle of \nrepose.  In stage two we adjust the free-surface of the lava dome so that it rests at angles equal to, \nor lower than, the talus angle of repose. We do this by evaluating the free-surface angle over the \nentire dome surface using the level-set field (Hale et al., 2007). Using this information we can \ncalculate a radius, aR , the minimum distance from the centre of the dome, beyond where the \nfree-surface angle exceeds the talus angle of repose, as shown schematically in Figure 4a. \nTherefore, aR is an indication of where the dome was uplifted during the fresh lava injection \nstage to angles beyond the talus angle of repose. From aR to the maximum lateral extent of the \ndome also indicates where talus is primarily adjusted on the dome surface.\nThe ratio, R\nRa , (where R is the maximum lateral extent of the talus) is shown in Figure 5 for \nthe generic simulations.  When 0R\nRa , aR is very small relative to the maximum radial extent \nof the dome and the over-steepened area is very close to the summit. Talus adjustments occur \nover the remaining extent of the talus slope, meaning that the dome shape is approximately \nconical. However, when 1R\nRa , aR is large relative to R , and talus adjustments only occur at \nthe outer extent of the talus slope, meaning that the dome shape will tend to a truncated cone \nwith a convex top as shown schematically in Figure 5c. From Figure 5 the ratio R\nRa changes \nmost when the dome is small, and as the dome grows larger it stabilises. \nBoth model results using a Newtonian and shear thinning viscosity relationship for dome growth \nhave low R\nRa ratios, between approximately 0 and 0.2, suggesting a near-conical shape. There \nappears to be little difference between the R\nRa ratios for the different simulated extrusion rates \nexcept at later times and only for the dome growth model with the lowest extrusion rate. For the \n2 m3s-1 extrusion rate, R\nRa increases as the dome volume increases beyond 20 M m3, suggesting \nthat the dome is departing from being nearly conical to having a flatter, wider top (Fig. 5c). This \n15\nis due to greater lateral spreading of the core due to gravity, which is more pronounced for lower \nextrusion rates, forcing aR to larger radial values. All these results suggest that most of the talus \nadjustments occur over a very large region of the dome surface from close to the summit of the \ndome to the maximum lateral extent of the dome. This is consistent with observations of \nrockfalls at SHV, which are largely sourced from the upper, blocky regions of the dome close to \nor at the summit (Calder et al., 2002).\nThere are several effects that contribute to the scatter in these results. First, to calculate the angle \nof the dome free-surface we must consider a region one element wide that surrounds the zero \nisoline for the level-set which describes the dome free-surface, to ensure that there are elements \nwithin this region that are close to the dome surface (Hale et al., 2007). Second, the finite \nspacing of the mesh means that when the free-surface angle is calculated, the angle is only \ncalculated at nodes on the mesh. This corresponds to only knowing the free-surface angle every \n2.5 metres radially (an interval approximately equal to 0.5% of the total domain). Reducing the \nelement size reduces the degree of scatter, although at the expense of increasing computational \nsolving time without changing the overall model results.\n4.1.3: Talus Readjustments\nOur model also records the volume of carapace\/talus readjusted per second. This volume \ncorresponds to the volume of the model domain occupied by carapace or talus before the angle of \nrepose readjustment sub-step, minus the volume of the domain occupied by carapace or talus \ndirectly following the readjustment sub-step and divided by the time-step duration (Fig. 4a). The \nbest way to conceptualize this volume is that it is analogous to the volumetric additions, or \naggradation of, talus material on the dome flanks by rockfalls (Fig. 4b). That is, during the \ngrowth of the dome, material is forced to angles above its angle of repose, then during the talus \nadjustment sub-step (the equivalent of rockfall activity) this volume is redistributed along the \nflanks of the dome at its angle of repose. Fresh talus material is sourced from the carapace at the \ndome summit, from aRR 0 , while readjustment of existing talus material occurs between aR\nand R . Talus readjustment rates through the history of the generic dome growth are shown in \nFigure 6. The talus readjustment rate scales with the extrusion rate and is approximately \n16\nconstant, with minor fluctuations (~1 m3\/s). It should be noted that the talus volume readjusted \ncan be larger than the input volume because the talus readjusted volume can include existing \ntalus in addition to fresh carapace.\n4.1.4: Carapace Generated\nOur model saves information for the volume of carapace generated per second. This corresponds \nto the volume of the domain that changes from core into carapace\/talus after being displaced into \nregions of the dome that fall below the solidus pressure during each time step, divided by the \nlength of the time-step (Fig. 7). The carapace production rate generally decreases with time (Fig. \n8). Scatter in this result is due, in part, to the way in which aR is calculated, given the finite \nelement spacing as described in section 4.1.2, which affects the location of the carapace-core \ninterface. Also, since the volume is calculated by interpolating the axi-symmetrical area and \nintegrating by 2π this process leads to some degree of rounding error. Lastly, when the dome is \nsmall there are relatively more carapace and talus adjustments because the dome radius is \ngrowing more quickly (Fig. 4 a,b).\nThe rate of generation of carapace approximately scales with the extrusion rate both for a \nNewtonian and shear-thinning viscosity relationship (Fig. 8). Early in the simulation the rate at \nwhich carapace is generated is very close to, or higher than, the rate at which lava is extruded, \nbut over time this value decreases. This is because early on, carapace is generated across the \nwhole surface of the dome, the surface of which is initially changing rapidly, while later it is \nprimarily generated over the summit region as the dome core becomes flanked by a wide apron \nof talus (Hale, 2008). \n4.1.5: Average Carapace Generated and Talus Readjusted\nThe average rates of carapace generated and talus readjusted for the four different extrusion rates \nmodelled over the entire simulation (a final dome volume of 30 million cubic metres) are shown \nin Figure 9. The relationship between both the average carapace generation rate and the talus \nadjusted rate, and the extrusion rate is linear. This relationship is corroborated by various \nobservations that rockfall activity, to a first order, varies with extrusion rate (Calder et al., 2005) \n17\nand that at a larger scale pyroclastic flow is also extrusion rate dependant (Yamamoto et al., \n1993; Uhira et al., 1994). \nFor both Newtonian and shear-thinning viscosity models, the rate of carapace generation is less \nthan the rate of talus readjustment. This is because the rate at which carapace is generated only \nincludes material that converts from core into carapace. While, the rate at which talus is \nreadjusted includes adjustments from pre-existing talus as well as carapace. Further, as the lava \ndome grows, new carapace is confined to the central summit region because the talus layer \nsurrounding the core becomes thicker further from the dome. However, carapace\/talus \nadjustments can occur all over the dome surface. For the Newtonian lava dome model, the time-\naveraged proportion of extruded lava converted to carapace compared to the extrusion rate is \nbetween 80 and 83%, while for the shear-thinning viscosity lava dome model the rate is 68 to \n70% (Table 1). This suggests that the Newtonian lava dome model experiences a larger amount \nof carapace removal from near the summit of the dome, permitting new carapace to form, than \nfor the shear-thinning viscosity model. Another way to view these results is that these \nsimulations suggest that approximately 70 to 83% of the core lava is channelled to the free-\nsurface of the dome to be converted into carapace in what could be considered a largely \nexogenous manner. Because the shear-thinning viscosity model can be expected to favour greater \nlateral spread than the Newtonian viscosity model (i.e. a viscosity drop near the conduit exit \nwhere shear stresses are highest), less lava is channelled vertically and subsequently converted \ninto carapace. Hence the lava dome model with a shear-thinning viscosity relationship behaves \nmore endogenously than for the Newtonian lava dome. \nFor the Newtonian lava dome model, the average rate of talus readjustment is between 98 and \n112%, of the extrusion rate, while for the shear-thinning viscosity lava dome model it is between \n93 and 99%, for the extrusion rates considered (Table 1). This difference between the viscosity \nrelationships means that larger talus readjustments are required for the Newtonian viscosity \nrelationship models and the talus can be considered more mobile. Since, shear-thinning permits \ngreater lateral spread of the core by creating a viscosity drop near the conduit exit, this results in \nfreshly extruded lava preferentially spreading laterally as opposed to forcing larger regions of the \ndome surface to angles beyond its angle of repose.\n18\nAs observed previously, the rate of carapace volume generated, as well as the rate of talus \nvolume readjustment changes as the dome volume increases (Figures 6 and 8). Therefore, \ncalculating the average volume of carapace generated or talus readjusted per second for the entire \nsimulation is an over-simplification of the processes. Although not explicitly shown here, it \nmight be expected that when the dome is small a larger volume of carapace is generated \n(evidenced by increased carapace generation rates) and therefore the lines in Figure 9 would shift \nupwards (as the rates increase for all extrusion rates), while at later times in the growth of the \ndome less carapace is generated and the line in Figure 9 would shift downwards (as the rates \ndecrease for all extrusion rates). This will also be true for the linear relationship between the \nextrusion rate and talus volume readjustment. \n4.1.6: Core Volume Fraction\nFor each time-step the model records the total dome volume, as well as the volume of the dome \noccupied by core and carapace\/talus components for our generic simulations. The total core \nvolume fraction initially increases rapidly, from ~ 0.15 to 0.2 for the Newtonian model, and from \n~0.15 to 0.3 for the shear-thinning viscosity model (Figure 10a,b) and then continues to rise \nslowly. However, the largest increase in core volume fraction within the lava dome occurs for \nsimulations with the lowest extrusion rate; the final core volume fraction varies between 0.23 \nand 0.43 for the Newtonian model, and 0.39 and 0.55 for the shear-thinning viscosity model, for \nthe simulated extrusion rates of 8 m3s-1 and 2 m3s-1, respectively.\nProfiles of the dome surfaces and core-talus interfaces for two, 11.5 million cubic metre volume, \ndomes extruded at rates of 2 m3s-1 and 8 m3s-1, using the shear-thinning viscosity model are \nshown in Fig. 10c. The high extrusion rate (8 m3s-1) profile shows less lateral spreading for the \ncore (black line), than that for a low extrusion rate (2 m3s-1), in which a higher degree of lateral \nspread of the core is evident (grey line). Observe that the total dome volumes and shape \n(constrained by free-surface adjustments) are the same, however the low extrusion rate dome \ndevelops a larger core and hence a larger volume fraction of core for the same total dome \nvolume. Also, note that in the simulation with the highest extrusion rate, lava is channelled \nprimarily vertically towards the free surface, where it can readily be turned into carapace and \n19\ndistributed down the flanks of the dome as talus. This can also be conceptualized as forcing the \nmodel towards behaviour which would be manifest as large-scale exogenous growth. However, \nin reality lava is channelled to the free surface during exogenous dome growth along internal \ndiscontinuities known as shear bands (Hale and Wadge, 2008). Lava dome surfaces and core-\ntalus interfaces for the two viscosity models can also be compared (Figure 10d). Again, for an \n11.5 million cubic metre dome volume, extruded at 8 m3s-1, the shear-thinning viscosity model \n(grey line) experiences significantly more lateral spread of the core than for the Newtonian \nviscosity model (black line). Shear thinning occurs near the conduit exit within the dome, \ncreating a region of lower viscosity and enhancing lateral spreading. These data also explain the \nobserved differences in core volume fraction generated by the two viscosity models (Figure \n10a,b), where the shear-thinning model generates the largest core.\n4.2. Soufrière Hills Volcano Lava Dome: August 2005 to May 2006\nWe now consider a 292-day period of almost continuous dome extrusion at the Soufrière Hills \nVolcano (SHV), which comprises one complete dome growth cycle from its initial extrusion \nwithin an empty crater on 1 August 2005 until its destruction on 20 May 2006. Survey \nobservations of dome volume (Fig. 2) are used to drive the model growth rate and the model \nresults are then compared to the record of rockfall seismic activity. We present results for eight \nsimulations using both shear-thinning and Newtonian viscosity models. The parameter ranges for \nthe models are given in Table 2, while specific simulation values are given in Table 3. A \nthorough discussion on the internal structure of the dome, i.e. the location of the core and talus \nwithin the dome for these parameter values are discussed in more detail in the companion paper \n(Hale et al, in review).\n4.2.1 Carapace Generated\nThe rate of carapace generated is calculated by our model as described in Section 4.1.4 and \nshown in Figure 11a. Except for Simulations 6 and 7, which use a higher viscosity for the talus \nregion, the rate of carapace generation shows some time dependence. The time-dependency of \nthis relationship is due to two competing effects: 1) the volume of lava converted into carapace \nincreases because the rate of lava extrusion increases, and 2) the volume of core converted into \n20\ncarapace decreases at later times because the dome becomes enshrouded with carapace\/talus \nmost predominantly laterally from the dome core, and therefore the core-carapace interface \nmoves away from the free-surface, except near the dome summit. The ratio of carapace \ngenerated to extrusion rate is a measure of the relative rate of development of the carapace \n(Figure 11b), and also shows time dependency through the dome growth history. These results \nare consistent with those observed in Section 4.1.5, such that the volume of carapace generated \nwith time is initially approximately proportional to the extrusion rate, i.e. the percentage of \nintruding mass converted into carapace is initially close to 100%. \nFor simulations with a uniform viscosity relationship (Newtonian or shear-thinning) for the core \nand talus (simulations 1 to 5 and 8), the rate of carapace generation increases to a peak of \napproximately 3 m3s-1 (Fig. 11a). After about 150 to 200 days, the carapace generation rate \ndecreases (Fig. 2). The timing of the peak appears to depend upon the modelled angle of repose \nfor the talus. For Simulations 1 to 3 and 8, which have an angle of repose of 43.5º, the peak falls \nbetween days 160 to 175 (late-January to early February 2006), while for Simulation 4 (with an \nangle of repose of 40º), the peak is close to day 190 (late-February 2006), and for Simulation 5 \n(with an angle of repose of 37º) there is a broad peak maximum close to day 210 (mid-March \ns2006). Following this peak, the volume of carapace generated then decreases, and this is most \nprominent for simulations with higher angles of repose for the talus. Simulations 6 and 7, in \nwhich the talus has a frictional “strength” show rates of carapace generation rising throughout, \nup to about 6 m3s-1, which suggests that lava is preferentially channelled vertically due to the \nsurrounding strength of the talus.\nThe amount of core volume converted into carapace per time-step is initially very high (Figure \n11b), approximately 100%, decreasing later to 10 to 50%. The volume of carapace generated can \nbe greater than the volume of lava extruded during each time step due to talus adjustments \nexposing a larger volume of core than just the newly extruded volume. This suggests that the \nvolume of lava added to the core pushes a progressively smaller amount of core into regions \nbelow the solidus pressure as dome volume increases (Figure 11b, c). The model suggests that \ndome growth should behave more endogenously with time (i.e. a smaller proportion of lava core \nis converted into carapace).  Simulations 6 and 7 show slightly different behaviour, with a core to \n21\ncarapace conversion percentage from 90% falling to 60%. This can be viewed as dome growth \nbecoming primarily endogenous, i.e., less core is converted into carapace and core must be \nspreading laterally within the dome. However, this can still result in talus readjustments (Fig. \n11c), due to the spreading core slowly deforming the free-surface beyond the talus angle of \nrepose prompting readjustments of the talus. \n4.2.2 Talus Readjustments\nResults for the August 2005 – May 2006 dome simulations show that the rates of talus \nreadjustment (Figure 12a) increase as the dome grows and the extrusion rate increases. This is \nconsistent with results in Section 4.1.4. A relatively constant relationship is found when the \nvolume of talus readjusted per second divided by the extrusion rate (equivalent to the volume \nfraction of talus material readjusted relative to the intruded mass) is plotted against time (Figure \n12b). The result of unity, with some degree of scatter, implies that the proportions of extruded \nmaterial and deformed talus by readjustment remain approximately constant throughout the \ndome growth simulation.  \nThe difference between the rate of carapace generated with respect to extrusion rate and the rate \nof talus readjustment with respect to extrusion rate reflects that early on in the growth of the lava \ndome, the carapace generated rate is approximately the same as the talus deformation rate. While \nat later times the dome becomes flat-topped and the core-talus interface moves away from the \nfree surface of the dome at the lateral extent of the dome, permitting core to be converted into \ntalus only in the central summit region (Hale et al., in review). Later in the evolution of the dome \ntherefore, the ratio of talus readjustment to carapace generated increases considerably. This can \nbe viewed as the core volume with respect to the total dome volume increasing with time as \nshown in Hale et al. (in review).\n4.2.3 Comparison to Rockfall Seismicity Data\nA taxonomic view of the relationship of clastic rock generation and movement to lava dome \ngrowth at Soufrière Hills Volcano is shown schematically in Fig.13. The primary division is \n22\nbetween rockfalls generated actively and passively (Calder et al., 2002). The active branch is \ndominated by events that are recorded seismically. The passive branch, on the other hand,\ncomprises mainly smaller magnitude events many of which could be potentially aseismic. Some \nof these can be envisioned as events that are caused by local perturbations of the talus which just \nexceeds the stability threshold while others will be forced internally by endogenous growth. The \nrelationships between the volume of material involved in a rockfall event and the frequency of \noccurrence and energy released are almost certainly non-linear. In Figure 13, we show \nschematically that the two relationships between volume and frequency and energy that are used \nto compare with the model results will themselves depend on the boundaries chosen between \nseismic or aseismic rockfall events and pyroclastic flow events at either end of the collapse \nspectrum. The inflection shown at the rockfall – pyroclastic flow boundary indicates the change \nin mechanical behaviour as the fluidised pyroclastic flow regime develops.\nFigure 14 shows the cumulative number of rockfalls recorded, used as a proxy for the volume of \ntalus material deposited or adjusted, during the August 2005 to May 2006 dome growth period. \nThe curves of simulated cumulative talus readjusted with time are similar to that measured from \nseismic data derived from rockfall activity (Fig.14a) with some notable differences. Figure 14b \nshows the equivalent cumulative volume of carapace generated during the dome growth period\nusing our simulation, which also represents the total volume of talus within the dome. We plot \nthis because the cumulative number of rockfalls multiplied by an assumed volume per rockfall \ncan be used as a first approximation to estimate the total volume of talus within the dome. \nHowever, it is not appropriate to assume that all rockfall seismic signals are sourced from active \nrockfalls generated by unstable carapace. For our simulations the volume of carapace generated \nrepresents a minimum for the volume of talus material adjusting at the dome surface. The \ncumulative volume of talus material readjusted corresponds to the maximum volume of material \nthat is adjusted at the dome surface, including the deformation of new talus (carapace) and the \nreadjustment of pre-existing talus. Compared to the total talus volume within the dome (Fig. 14b) \nthe cumulative volume of carapace\/talus adjusted (Fig. 14a) can be approximately double. \nSimulation 3 used the highest solidus pressure modelled and results show that a larger volume of \ntalus is readjusted (Fig. 14) and that the total volume of carapace generated is higher, compared \n23\nto Simulations 1 and 2 that have a smaller solidus pressure but where all other parameters are \nheld constant. Simulations with a smaller angle of repose (i.e. Simulations 4 and 5) result in a \nlarger amount of talus being generated (Fig. 14b) compared to Simulation 2, which has the \nhighest talus angle of repose. This is because domes with a lower angle of repose require a larger \ntalus volume (i.e. the lateral extent of the dome will extend further) relative to a dome with a \nhigher angle of repose. Our simulation using a Newtonian viscosity model (i.e. Simulation 8) \nproduces a higher volume fraction of talus when compared to the purely shear-thinning viscosity \nmodels, consistent with results in Section 4.1.6. There is less lateral spread of the core due to a \nreduced viscosity near the conduit exit where shear stresses will be highest. Simulations 6 and 7 \nthat have a higher viscosity in the talus region, produce the largest amount of carapace as well as \ntalus readjustment. This is because the higher viscosity in the talus region confines lateral spread \nand forces the extruded lava to be channelled primarily vertically, with the talus essentially \nacting as a buttress.\nThe plateau in rockfall seismicity between days 160 and 200 included two periods of high \nextrusion rate that resulted in the emplacement of ‘pancake lobes’ (Loughlin et al., 2006; in \nreview). These lobes generated very few rockfalls and may have included an endogenous \ncomponent. The rapid change in the seismic data-set at approximately day 200 represents a \nsignificant change in dome growth style and direction, from a rather localized northerly-directed \nshear lobe to a significant shear lobe directed towards the ENE. Extrusion in this direction \n(towards the open, downslope side of the crater), always resulted in more frequent and \nwidespread rockfalls than extrusion in other directions. Likewise, the peak at approximately day \n260 corresponds to development of a ENE-directed shear lobe, and a plateau at ~280 days \nrepresents a period when extrusion rates remained high but there was little obvious surface \nexpression or rockfall activity. This was probably an episode of mainly endogenous dome \ngrowth. The final peak at approximately day 285 represents the extrusion of a megaspine, \nfollowed by endogenous growth (Loughlin et al., in review). \n4.2.4 Rockfall Seismicity Data Complications\nIt should be stressed that the seismic data-set as-is, cannot be expected to provide a complete nor \naccurate history of talus accumulation on the lava dome. The seismic network does not for \n24\nexample, record very small volume\/duration rockfall events that generate signals which are \neither below an energy threshold or shorter than ~2 seconds in duration. Thus, as the dome grows \nlarger, the seismic network is more likely to detect a greater proportion of the rockfall signals \nbecause the distance that the rockfalls cover is longer. Also, a larger and higher dome likely \nresults in more energy being available to transfer to the ground for an equivalent rockfall volume \non a smaller dome. It is also possible that the volume of individual rockfalls could increase as the \ndome increases in size, and this would not be reflected in the rockfall event counts data. \nIn Section 4.1.5, the average rates of carapace generated and talus readjusted for four different \nextrusion rates modelled are illustrated. The result was a linear relationship between average \ncarapace generation rate and talus adjusted rate, against extrusion rate. But rockfall events for \nthis dome growth period do not have a linear relationship to extrusion rate. This was shown by \nLoughlin et al. (2006) who compared the rockfall counts and energy throughout the dome growth \nepisode with extrusion rates and observations.\nOur simulation output data provides complete information regarding the development and \nreadjustment of carapace\/talus no matter how small or seismically undetectable these theoretical \nadjustments may be. A caveat however, is that the time-averaged extrusion rate used as an input, \nprobably neglects short-time scale variations or pluses in magma influx which may be significant \n(Sparks et al., 1998). As a result, care is obviously required when interpreting the seismically \ndetected data to our simulated data in Figure 14. For example, when the extrusion rate is low \n(and in this case the dome volume is small) seismically detected rockfalls as generated by talus \nadjustment are likely to be under-represented. Resolving the volume of talus material deformed \nusing seismically-detected rockfalls is beyond the scope of this paper, but needs to be addressed \nfor a better understanding of talus slope evolution.\n4.2.5 Rockfall Volumes\nComplicating the cumulative record of seismic rockfall signals further are the peaks in activity \nnear days 85 and 115 (Fig. 14) due to brief pulses in magma supply. Ignoring these brief spurts \nin the number of rockfall seismic signals and biases in rockfall detection due to dome volume, \nour simulated cumulative volume of talus readjusted and volume of talus within the dome \n25\nprovide reasonable fits to the seismic data-set. Equating the total number of detected rockfalls to \nthe total volume of talus readjusted suggests that on average each rockfall would have a volume \nof between approximately 7,500 and 13,500 m3 for the simulation parameters considered here. \nAssuming that the total rockfall number equates to the cumulative volume of carapace generated \n(i.e. total volume of talus), the volume per rockfall would have to be between approximately \n3,100 and 7,800 m3. \nDuring an 11-day monitoring period (30th March – 11th April 2006) Wadge et al. (2008) \ncalculated that the total increase in dome volume was approximately 9.0 x106 m3 as measured by \nthe radar instrument AVTIS. During this time period there were approximately 1040 rockfalls \nand 13 pyroclastic flows detected seismically, and thus an average of 96 rockfalls per day. This \nwas a relatively active period in terms of rockfall generation, but this value is average for a \nprimarily exogenous dome growth period (Calder et al., 2002). Assuming dome growth was \naccommodated entirely exogenously during this period (i.e. the growth volume of the talus \napron, occurred solely by aggradation of new material on the surface, and not by internal \ninflation), then an average volume of talus aggraded per rockfall is calculated to be \napproximately 8,700 m3 per rockfall. This value falls within our simulated average volume per \nrockfall for total talus readjustments, although we do not consider the conversion from dense \nrock equivalent to talus density.\n4.2.6 Aseismic Talus Adjustment\nThe average volume per rockfall as measured by Calder et al. (2002) for SHV during dome \ngrowth in 1997 was 2,600±1,000 m3. This figure was obtained using the talus volume of 25 x 106\nm3 for the southern talus apron measured in December 1999 (Sparks et al., 2002). The activity \ncontributing to this accumulated talus apron was confined to two distinct periods, 10 Feb. - 14 \nMay 1997 and 3 Nov. - 26 Dec. 1997.  Dome collapses that occurred during these periods (30, 31 \nMarch, 11 April 1997, 4, 6 November 1997) were estimated to remove 8 x 106 m3 of dome \nmaterial, the remaining volume was divided by 6,070 (the total number of rockfalls that occurred \nin the two periods 10 Feb. - 14 May 1997 and 3 Nov. - 26 Dec. 1997. Growth of the southern \ntalus apron occurred during a period when talus spilled over the rigid crater wall. This barrier \nwould have prevented any lateral movement of the dome core and hence this volume must only \n26\nhave recorded talus volume changes due to rockfalls and pyroclastic flows aggradation, and not \nany outward migration of the talus slope by internal spreading. \nOn average, for our simulations, each rockfall has a volume of 7,500 - 13,500 m3 when \ncalculated as the volume of talus readjusted, or 3,100 - 7,800 m3 when calculated for the \ncumulative volume of carapace generated (equal to the total volume of talus within the dome). \nThese values are considered relatively high based on the measurements explained above of \n2,600±1,000 m3. However, these estimates for individual rockfall volumes were obtained when \ntalus spilled over a rigid crater wall and hence any internal expansion could be ruled out. This \nimplies that an important component of the talus slope growth might occur by internal swelling \nof the core rather than by being deposited directly on the surface of the dome. Hence, our \nsimulated talus readjusted volumes are significant because they suggest that substantial talus \nvolume readjustment could occur either due to large volumes of seismically undetected rockfalls \n(considered unlikely), or aseismic creep due to a laterally spreading core bulldozing the talus.\nWadge et al. (2008) calculated that on average 8,700 m3 per rockfall was aggraded to the talus \nslope during the time period 30th March – 11th April 2006, considerably more than the value of \n2600±1000 m3 per rockfall made by Calder et al. (2002). Assuming that the average volume of \nmaterial shed during rockfalls has not changed with time, this suggests that a significant \nproportion, approximately 70%, of the volume of talus adjusted during dome growth could be \ngenerated from spreading of the core, i.e. aseismic talus adjustment. However, this value is \nunlikely to remain constant over the duration of dome growth. Hence, during the lava dome \ngrowth period considered in this paper it is possible that aseismic deformation of the talus could \nhave occurred due to lateral spread of the core resulting in the large volume of talus per rockfall \nas predicted by our simulation. Also, at later times in the growth history of the dome it is likely \nto be largely pre-existing talus that is modified due to inflation and spreading of the core (i.e. \nendogenous behaviour), by an aseismic process of frictional adjustment between clasts within the \ntalus.\n4.2.7 Rockfall Seismicity Energy Data\n27\nTo directly compare our simulation results (currently in volume form) to the energy proxy data \nfor rockfall seismicity we must convert our simulated data into a pseudo-energy value. We \nachieve this by taking the product of the volume of dome material readjusted and half the \nmaximum height from where the talus readjustments occur ( aR , Fig. 4a). This pseudo-energy \ncan be considered to be proportional to the potential energy for the talus. In Figure 15 the \ncumulative energy as shown by the black circles, plotted with our simulated readjusted talus \npseudo-energy a), and the carapace generated pseudo-energy b). The relationship between \nrockfall kinetic energy and seismic energy density is not yet established but again, will likely \nvary as the dome grows in size. For example, when the dome is small or the run-out constrained, \nthe velocities achieved will tend to be lower than when the slope is longer. Therefore caution \nneeds to be applied when drawing inferences from the comparison between the simulated data \nand the seismic energy data-set.\nThe gradient for cumulative energy data is relatively shallow initially, increase significantly but \nbriefly around day 180, and then in a more sustained way between day 200 and day 250, before \ndecreasing after day 260. Although not shown here, our companion paper Hale et al. (In review) \nshows that the maximum height at which talus readjustments occur increases as dome radius \nincreases, except for when the dome is very large, and talus readjustment can occur lower on the \nflanks of the dome. This means that rockfalls may be sourced from lower locations on the dome \nsurface, and these rockfalls have less potential energy to be converted into kinetic energy. \nHowever the overall decline in seismic energy leading up to 20 May was also documented by \nLoughlin et al (2006) and attributed to the fact that most rockfall activity was on the SW and W \nfaces of the dome where rockfalls were stopped, after a short run-out, by the crater wall \n(Loughlin et al., in review).  A decrease in seismic energy may be a combination of these two \nprocesses.\n5. Discussion and Conclusions\nRockfall seismicity is the best available continuous proxy measurement we have for potentially \ndistinguishing exogenous from endogenous dome growth. That is, the ratio of rockfall volume \nover equivalent-period extruded volume is a measure of the fractionation of the new lava into \n28\nsolid core and clastic talus components and hence could be used to determine the different \ngrowth styles. Rockfall seismicity data could be used to track the relative contributions from \nboth mechanisms provided the seismicity can be better calibrated to the rockfall volume and \ntransport process. However, carapace disintegration and the formation of rockfalls is not as \nsimple as suggested by our model. Our continuum model cannot represent discontinuous or non-\nequilibrium behaviour. For example, the highest average extrusion rates in this dome growth \nepisode were recorded from 10 to 24 February (days 194 - 208) during emplacement of a \npancake lobe characterised by low rockfall counts. Another form of such behaviour was \nmeasured by Wadge et al., (2008) between 5 and 7 April 2006. On 5 April the rockfall seismicity \nrate fell whilst at the same time the summit of the dome was observed to increase its height by \nabout 20 m. After two days of low rockfall seismicity the rate picked up again on 7 April. This \nwas interpreted as a pulse of exogenous lava addition to the summit, perhaps from a new lava \nlobe, which did not result in a renewed high level of rockfalls until the new lava had flowed to \nthe edge of the relatively flat summit region and began another period of “equilibrium” \ndisaggregation to produce the rockfall events. So whilst the model may successfully simulate the \nlong-term pattern it fails to represent the short-term discontinuous, asymmetric and non-\nequilibrium aspects.  \nDespite not modelling the physics associated with exogenous dome growth explicitly, our model \ncan replicate some of the large-scale behaviour associated with exogenous dome growth via a \ncarapace generation mechanism. Exogenous growth is favoured when the viscosity of the talus is \nhigher that that of the core, during higher extrusion rates, when the dome is small or when a large \nvolume of talus surrounds the core. Determining regimes of dome growth is important for \ndetermining the stability of a lava dome. There were minimal precursory signals before the May \n20th 2006 dome collapse event. Some of the models explored here provide a potential mechanical \nexplanation for this. If the core had spread laterally over a layer of talus, which could have acted \nas a weak layer, focused rainfall runoff may have eroded this layer, triggering collapse. Such \nlateral spreading of the core could have been recorded by passive rockfalls originating low on the \ntalus slopes.\n29\nResults for our generic lava dome growth model show that the core has the potential to grow \nlarger when extrusion rates are low (aided by gravitational spreading) compared to domes with \nhigher extrusion rates. This will result in the talus being deformed to a greater degree laterally in \nan aseismic fashion and the production of fewer rockfalls from freshly extruding carapace. \nSeismic data show that, in general, low extrusion rates generate fewer rockfall signals and that \nthe frequency-magnitude curve for rockfalls shifts at higher extrusion rates (Calder et al., 2005). \nFurther, for an upwardly growing dome (i.e. exogenous growth) it is likely that more rockfalls \nwill be generated because this upward motion of lava is likely to generate larger regions of the \ndome surface which are at angles greater than the talus angle of repose (dominantly active \nrockfalls). While a dome with a wide core is likely to have a flatter central region and hence a \nsmaller area with angles close to or greater than the talus angle of repose meaning an inflating \n(endogenous) dome is more likely to generate dominantly passive rockfalls.\nThe most novel result to come from this work is the prediction of the degree of internal \ndeformation that might occur at the core-talus boundary and how we might test our results. \nUnfortunately, the 2005-2006 dome no longer exists. But at SHV there are a few other pieces of \nobservational evidence that we can use to better understand whether the core-talus interface can \nevolve as suggested in some of our models The location of core remnants after the 2003 dome \ncollapse at distances of about 200 m from the conduit exit indicate that the core must have \nextended at least as far as that. Earlier, partially-collapsed domes at SHV show massive jointed \nlava in the core but no real evidence of a pronounced bulge of core lava at lower levels with \nevidence of overriding of talus. But of course this is exactly the part of the dome that gets \ndestroyed most readily in major collapses, so absence of evidence in this case cannot be taken as \nevidence of absence.\nImproved accounting of the rockfall process using integrated seismicity and radar survey type \ntechniques such as AVTIS or LIDAR (Wadge et al., 2008) could provide observational evidence \nfor or against the process of core spreading. More accurate estimates of individual rockfall \nvolumes together with a better understanding of talus packing during burial is needed. \nPhenomena such as the initiation of a band of minor passive rockfalls from lower down on the \ntalus could indicate the surface effects of lateral spread as suggested by our model. However, \n30\nlocal passive rockfalls forced by the internal deformation may mask any surrounding surface \ntopographic expression and\/or rockfalls from higher on the dome may do likewise. The shape \nand rate of such surface deformations should help to infer source mechanisms, for example \nbetween lateral\/downslope spread and upward intrusion of a shear-bounded body. \n  \nDuring exogenous dome growth, lava is channelled to the free-surface, which can result in talus \nbeing almost entirely derived from rockfalls at the dome surface. This energetic process can \nresult in the talus resting at below its critical angle of repose due to a kinematic component \n(Lube et al., 2005). However, during endogenous inflation of the core, the adjustment of the talus \nis much more gradual, meaning that talus adjustments are likely to be relatively small and the \nslope will depart minimally from the critical angle of repose. \nAcknowledgments. Support is gratefully acknowledged from the Australian Research \nCouncil Discovery grant DP0771377 and AJH also acknowledges a University of Queensland \nEarly Career Research Grant. ESC acknowledges NSF funding (Grant Number 0809543) as well \nas a UB2020 Scholars grant. SCL publishes with permission of the Executive Director of BGS \n(NERC). Thanks to the continued efforts of scientists and staff at the Montserrat Volcano \nObservatory without which this work would not have been possible. GW is supported by NERC \ngrant NE\/E015093\/1.\nReferences:\nBarclay, J., M. J. Rutherford & M. R. Carroll, 1998. Experimental phase equilibria constraints on \npre-eruptive storage conditions of the Soufriere Hills magma, Geophys. Res. Lett., 25, 3437 -\n3440.\nCalder, E. S., Luckett, R., Sparks, R. S. J., & Voight, B., 2002, The eruption of Soufriere Hills \nVolcano, Montserrat from 1995 to 1999. Geological Society, London Memoir, 21, 173–190.\n31\nCalder E. S., Cortes J. A., Palma J. L. & Luckett R., 2005. Probabilistic analysis of rockfall \nfrequencies during an andesite lava dome eruption: The Soufriere Hills Volcano, Montserrat, \nGeophysical Research Letters, 32, L16309\nCalder, E.S. and Bernstein, M., 2007. Dome Collapse Inventory, 1996-2008. MVO Open File \nReport OFR06-09\nGross, L.,. Bourgouin L, Hale A. J., & Mühlhaus H.-B., 2007. Interface Modeling in \nIncompressible Media using Level Sets in Escript, Physics Earth Planet. Int., 163, 23–34\nHale, A. J., Calder, E. S., Loughlin, S., & Wadge, G.,. Modelling the Lava Dome Extruded at \nSoufriere Hills Volcano, Montserrat, August 2005 - May 2006. Part I: Dome Shape and Internal \nStructure. (submitted)\nHale, A. J., 2008. Lava Dome Growth and Evolution with an Independently Deformable Talus. \nGeophysical Journal International. 174, 391–417\nHale, A. J. & Wadge, G., 2008. The transition from endogenous to exogenous growth of lava \ndomes with the development of shear bands. Journal of Volcanology and Geothermal Research, \n171, 237–257.\nHale, A. J., Bourgouin L., & Mühlhaus H.-B. 2007. Using the level set method to model \nendogenous lava dome growth, J. Geophys. Res., 112, B03213 doi:10.1029\/2006JB004445.\nJolly, A. D., Thompton, G. & Norton, G. E., 2002. Locating pyroclastic flows on Soufriere Hills \nVolcano, Montserrat, West Indies, using amplitude signals from high dynamic range \ninstruments. Journal of Volcanology and Geothermal Research. 118, 299 - 317.\nJones, L. D. (2006), Monitoring landslides in hazardous terrain using terrestrial LiDAR: an \nexample from Montserrat. , Quarterly Journal of Engineering Geology and Hydrology, 39, 371-\n373.\n32\nLavallée, Y., Hess, K.-U., Cordonnier, B. & Dingwell, D. B., 2007. Non-Newtonian rheological \nlaw for highly crystalline dome lavas. Geology, 35 843 – 846\nLoughlin, S. C., Calder, E. S., Clarke, A., Cole. P. D., Luckett, R., Mangan, M. T., Pyle, D. M., \nSparks, R. S. J., Voight, B. & Watts R. B. 2002. Pyroclastic flows and surges generated by the \n25 June 1997 dome collapse, Soufriere Hills Volcano, Montserrat. Geological Society Memoir \n21, 191-209.\nLoughlin, S. V., Christopher, T., Luckett, R., Jone, L., Baptie, B., 2007. Large volume dome \ncollapse at the Soufrière Hills Volcano, Montserrat, 20 May 2006.  Geophysical Research \nAbstracts. 9, 11090.\nLoughlin, S. V., Baptie, B, Christopher, T., Ryan, G., Luckett, R., Hards, V., Jones, L., Fournier, \nN., Bass, V., Syers, T., Ruzie, L., Higgings, M., Williams, P & Williams, D., 2006. Report to the \nScientific Advisory Committee Montserrat, August 2006. MVO Open File Report 06\/07.\nLoughlin, S. C., Luckett, R., Christopher, T., Jones, L., Ryan, G., Druitt, T., Baptie, B., Carn, S., \nHards, V. 2009. Unprecedented gas release from a large volume and rapid dome collapse at \nSoufriere Hills Volcano, Montserrat on 20 May 2006. Journal of Volcanology and Geothermal \nResearch. In prep.\nLuckett, R., Baptie, B. & Neuberg, J., 2002. The relationship between degassing and rockfall \nsignals at Soufriere Hills Volcano, Montserrat. Geol. Soc. London, Memoir, 21, 595-602.\nLube, G., Huppert, H. E., Sparks, R. S. J., & Freundt, A., 2005. Collapse of two-dimensional \ngranular columns. Physical Review E. 72, 041301.\nRyan, G. A., Loughlin, S. C., James, M. R., Jones, L. D., Calder, E. S., Christopher T., Strutt, M.\nH. & Wadge , G.  ( in prep.). Growth of the lava dome and magma extrusion at Soufriere Hills \nVolcano, Montserrat, West Indies: 2005-2008. \n33\nSimmonds, J., Elsworth D.& Voight B. 2005. Classification and idealized limit-equilibrium \nanalyses of dome collapses at Soufrière Hills volcano, Montserrat, during growth of the first lava \ndome: November 1995–March 1998. J. Volc. Geotherm. Res., 139, 241–258.\nSparks, R. S. J., Young, S. R., Barclay, J., Calder, E. S., Cole, P., Darroux, B., Davies, M. A., \nDruitt, T. H., Harford, C., Herd, R.,  James, M., Lejeune, A. M., Loughlin, S., Norton, G.,\nSkerrit, G., Stasiuk, M. V., Stevens, N. S., Toothill, J., Wadge, G., & Watts, R. 1998. Magma \nproduction and growth of the lava dome of the Soufriere Hills Volcano, Montserrat, West Indies: \nNovember 1995 to December 1997. Geophysical Research Letters. 25,  3421 - 3424\nSparks, R. S. J., M. D. Murphy, A. M. Lejeune, R. B. Watts, J. Barclay & S. R. Young, 2000. \nControl on the emplacement of the andesitic lava dome of the Soufrière Hills Volcano, \nMontserrat by degassing-induced crystallisation. Terra Nova, 12, 14 - 20.\nSparks, R. S. J. & Young, S. R., 2002. The eruption of Soufrière Hills Volcano, Montserrat \n(1995 - 1999): overview of scientific results.  Geological Society, London Memoir, 21, 45 - 69.\nUhira et al., 1994. K. Uhira, H. Yamasato & M. Takeo , Source mechanism of seismic waves \nexcited by pyroclastic flows observed at Unzen volcano, Japan. J. Geophys. Res. 99 (1994), \n17757–17773.\nUi, T., Matsuwo, N., Sumita, M. & Fujinawa, A., (1999). Generation of black and ash flows \nduring the 1990 – 1995 eruption of Unzen Volcano, Japan. Journal of Volcanology and \nGeothermal Research. 89. 123 – 137.\nVoight, B., 2000. Structural stability of andesite volcanoes and lava domes. Phil. Trans. Royal \nSoc. Lon. A, 358, 1663–1703\nWadge, G., 2008. Assessing the pyroclastic flow hazards at Soufriere Hills Volcano, Montserrat. \nIn: Advances in Volcanology: the Legacy of G. P. L. Walker, Geol. Soc. London (in press).\n34\nWadge G, Macfarlane D. G., Robertson D. A. Hale, A. J., et al. 2005. AVTIS: A novel \nmillimetre-wave ground based instrument for volcano remote sensing. Journal of Volcanology \nand Geothermal Research. 146, 307-318.\nWadge, G., MacFarlane, D. G., Odbert, H. M., James, M. P., Hole, J. K., Ryan, G., Bass, V., De \nAngelis, S., Pinkerton, H., Robertson, D. A. & Loughlin, S. C., 2008. Lava dome growth and \nmass wasting measured by a time series of ground-based radar and seismicity observations. \nJournal of Geophysical Research, 113, B08210, doi.1029\/2007JB005466.\nWadge, G., Ryan, G. & Calder, E. S. (2008b).  Clastic and core lava components of a silicic lava \ndome. Geology (submitted).\nWatts, R. B., R. A. Herd, R. S. J. Sparks & S. R. Young, 2002. Growth patterns and \nemplacement of the andesitic lava dome at Soufrière Hills Volcano, Montserrat, Geological \nSociety, London Memoir, 21, 115 - 152.\nYamamoto, T., Takarada, S. & Suto, S., 1993. Pyroclastic flows from the 1991 eruption of \nUnzen volcano, Japan. Bull. Volcanol. 55, 166–175. \nZobin, V.M., 2003. Introduction to Volcanic Seismology:  Developments in volcanology 6, \nElsevier.\n35\nFigure Captions\nFigure 1: a) Boundary conditions used in the model. The model domain has an axis of symmetry \nabout r = 0 and this allows us to only model a 2D slice, reducing computing solving time. The \nbase of the domain has the boundary conditions of no-slip (as shown by the fixed triangle \nsymbol), the axis of symmetry at r = 0 permits flow only in the z-direction (shown by the triangle \non rollers), while the boundaries away from r = 0 and z = 0 are open and allow matter to flow \nin\/out of the domain. Magma is introduced into the model domain through a conduit with radius \na. The free-surface of the dome and the core-talus interface are described by level-sets. b) shows \na typical mesh (grey lines) and the surfaces for the core-talus interface and free-surface (both \nblack). Image c) shows profiles of a simulated lava dome (free-surface shown as grey lines and \ncore-talus interface shown as black lines) at 5 different times. The region below the core-talus \ninterface (black line) is the dome core. The black dots correspond to the point at which the free-\nsurface departs from the talus angle of repose and the grey shaded region can be classified as \ncarapace in our model, while the non-shaded region between the core-talus (black line) interface \nand dome free-surface (grey line) is identified as talus. \nFigure 2: Surveyed dome volume data with time (crosses) and, on the secondary y-axis, the \nextrusion rate interpolated from the surveyed volume data (filled circles). Also shown are best-fit \ncurves to the dome volume data (continuous line) and the extrusion rate curve derived from the \nbest-fit curve for the volume (dashed line).  \nFigure 3: Radius and height for the generic lava dome model for a Newtonian viscosity (a and c), \nand for a shear-thinning viscosity model (b and d). There is negligible difference in dome height \nand radius between these different viscosity relationships when plotted against dome volume. \nAlso, due to the common free-surface constraint for the talus readjustment, the dome shape is \nself-similar for these simulations.\nFigure 4: a) Schematic of the lava dome model (a 270° rotated axi-symmetrical model with cut-\naway) during the talus readjustment sub-step. Following the injection of new lava into the core, \nthe free-surface angle is calculated. The distance aR corresponds to the minimum radius where \n36\nthe dome surface is at an angle greater than the angle of repose. The free-surface of the talus is \ntherefore adjusted to its angle of repose during the talus free surface adjustment sub-step, which \nmay involved the readjustment of material from aRr 0 . Also shown is the talus readjustment \nvolume, or talus source volume, shaded as grey. This corresponds to the volume of \ncarapace\/talus adjusted downslope so that the talus rests at angles below its angle of repose. b) \nSchematic showing the rockfall source volume (corresponding to a volume of over-steepened \nmaterial close to the summit), analogous to the talus source volume as shown in (a). The \naggraded talus is distributed along the flanks of the dome.\nFigure 5: Variation of  R\nRa for the generic dome models as they grow, using a) the Newtonian , \nand b) the shear-thinning viscosity relationships. The key corresponds to the extrusion rates \napplied for each of the four model runs. (c) shows a cartoon of how the dome shape may change \ndepending upon the ratio, R\nRa .  When 0R\nRa , aR is very small the dome shape is \napproximately conical. When 1R\nRa , aR is large relative to R , and the dome shape will tend to \na truncated cone with a convex top. \nFigure 6: Rate of talus readjusted for a Newtonian viscosity model (a), and a shear thinning \n(Lavallée et al., 2007) viscosity model (b). The key corresponds to the extrusion rate applied for \neach of the 4 model runs. Results are smoothed with a 100 time-step running average.\nFigure 7: Schematic of the lava dome model showing the volume of new carapace generated \nfrom core. Carapace\/talus is generated when core material moves into regions of the dome that \nare at a pressure below the solidus pressure, as shown by the dashed line.\nFigure 8: Rate of carapace generated for the duration of the generic lava dome simulations with a \nNewtonian viscosity model, (a), and a shear thinning viscosity model (b). The key corresponds to \nthe extrusion rate applied for each of the 4 model runs. Results are smoothed with a 100 time-\nstep running average.\n37\nFigure 9: Average rates of carapace generated and talus readjusted at four extrusion rates for a \nNewtonian viscosity model (a) and a shear-thinning viscosity model (b). Note that the carapace \ngeneration rate is systematically lower than the talus readjustment rate since the latter includes \nmaterial already within the talus apron that continues to deform.\nFigure 10: Cumulative core volume fraction plotted against total dome volume for a Newtonian \nviscosity model (a), and a shear-thinning viscosity model (b). c) Profiles of lava dome free-\nsurfaces and core-talus interfaces for a dome volume of 11.5 million cubic metres using a shear \nthinning viscosity model. Black lines are for the simulation with an extrusion rate of 8 m3s-1 , \nwhile the grey lines are for the simulation with an extrusion rate of 2 m3s-1. d) the same profiles \nusing shear thinning viscosity model (grey lines) and a Newtonian viscosity model (black lines) \nfor a simulation with an extrusion rate of 8 m3s-1.\nFigure 11: Simulated rate of carapace generated for the 292 days of growth of the August 2005 –\nMay 2006 lava dome at SHV (a), and the ratio of this parameter with the extrusion rate (b), for \neight different simulations with parameters sets as described in Table 3. c) Illustrates the \nproportion of core converted into carapace that is subsequently available to generate talus \n(therefore comparable to seismic rockfall data), and the proportion of core which simply spreads \ninto regions of the dome, where pressure remains above the solidus pressure (and thus remain as \ncore).  \nFigure 12: Simulated rate of talus adjusted for the 292 days of growth of the August 2005 – May \n2006 lava dome at SHV (a), and the ratio of this parameter with the extrusion rate (b), for eight \ndifferent simulations with parameters sets as described in Table 3. \nFigure 13: A schematic taxonomy of rockfall events likely to occur at silicic lava domes. RF and \nPF stand for rockfall and pyroclastic flow events. The two schematic plots show possible \nrelationships between number of events (left) and energy of individual events (right) against \nvolume of rockfall event.\n38\nFigure 14: a) Simulated cumulative volume of talus readjusted compared to the cumulative \nnumber of rockfalls as measured by the seismic network during this dome growth period and . b) \nshows the simulated cumulative volume of carapace generated during the dome growth period, \nwhich represents the total volume of talus within the lava dome generated from gravitational \ncollapse of the carapace, compared to the cumulative number of rockfalls measured during this \ndome growth (black circles).\nFigure 15: a) Simulated cumulative proxy-energy for the volume of talus readjusted compared to \nthe cumulative energy proxy for rockfalls as measured by the seismic network during this dome \ngrowth period. b) shows the simulated cumulative proxy-energy of carapace generated during the \ndome growth period, compared to the cumulative energy proxy for rockfalls measured during \nthis dome growth (black circles).\n39\nTables:\nTable 1: Percentage of dome material extruded converted into carapace or readjusted talus.\nViscosity model 2 m3\/s 4 m3\/s 6 m3\/s 8 m3\/s\nCarapace \ngenerated\nNewtonian 80% 83% 81% 83%\nCarapace \ngenerated\nShear-thinning 68% 70% 69% 68%\nTalus \nreadjustment\nNewtonian 98% 107% 112% 110%\nTalus \nreadjustment\nShear-thinning 99% 93% 95% 97%\nTable 2: Parameters used in simulations.\nParameter Range Value used Reference\n (Friction angle) 33 – 43.5º 37 – 43.5º Wadge et al. (2008)\n (Density – core and \ntalus)\n2350 kg m3\nar (Conduit radius) 15 m\nsP (Solidus pressure) 0.2 M Pa - 15 M Pa 0.2 MPa – 0.6 MPa \nT (Temperature) 830±10ºC in \nmagma chamber\n830ºC Barclay et al., (1998)\nTable 3: Simulations modelled.\nSimulation Viscosity model Friction \nangle\nSolidus pressure\n1 Shear-thinning viscosity relationship (Lavallée et \nal., 2007) with strain-rate cut-off of 10-5 s-1.\n43.5º 0.2MPa\n2 Shear-thinning viscosity relationship (Lavallée et \nal., 2007) with strain-rate cut-off of 10-5 s-1.\n43.5º 0.4MPa\n3 Shear-thinning viscosity relationship (Lavallée et \nal., 2007) with strain-rate cut-off of 10-5 s-1.\n43.5º 0.6MPa\n4 Shear-thinning viscosity relationship (Lavallée et \nal., 2007) with strain-rate cut-off of 10-5 s-1.\n40.0º 0.4MPa\n5 Shear-thinning viscosity relationship (Lavallée et \nal., 2007) with strain-rate cut-off of 10-5 s-1.\n37.0º 0.4MPa\n6 Shear-thinning viscosity relationship (Lavallée et \nal., 2007) with strain-rate cut-off of 10-5 s-1 for the \ncore, and a viscosity of 3.4x1013 Pa s for the talus. \n43.5º 0.4MPa\n7 Shear-thinning viscosity relationship (Lavallée et \nal., 2007) with strain-rate cut-off of 10-5 s-1for the \ncore, and a viscosity of 1014 Pa s for the talus. \n43.5º 0.4MPa\n8 Newtonian viscosity relationship, 3.4x1012 Pa s. 43.5º 0.4MPa\nFigure 1: \n \na) \n \nb)       c) \n  \nFigure 1\nClick here to download Figure: Fig1.pdf\nFigure 2\nClick here to download high resolution image\nFigure 3: \nNewtonian viscosity model          Shear-thinning viscosity model \n  \na)        b) \n  \nc)        d) \n  \n0\n50\n100\n150\n200\n250\n300\n350\n400\n0 5 10 15 20 25 30\nVolume (Mega cubic metres)\nR\na\nd\niu\ns\n (\nm\ne\ntr\ne\ns\n)\n2 cubic m\/s\n4 cubic m\/s\n6 cubic m\/s\n8 cubic m\/s\n0\n50\n100\n150\n200\n250\n300\n350\n400\n0 5 10 15 20 25 30\nVolume (Mega cubic metres)\nR\na\nd\niu\ns\n (\nm\ne\ntr\ne\ns\n)\n2 cubic m\/s\n4 cubic m\/s\n6 cubic m\/s\n8 cubic m\/s\n0\n50\n100\n150\n200\n250\n300\n0 10 20 30\nVolume (Mega cubic metres)\nH\ne\nig\nh\nt \n(m\ne\ntr\ne\ns\n)\n2 cubic m\/s\n4 cubic m\/s\n6 cubic m\/s\n8 cubic m\/s\n0\n50\n100\n150\n200\n250\n300\n0 5 10 15 20 25 30\nVolume (Mega cubic metres)\nH\ne\nig\nh\nt \n(m\ne\ntr\ne\ns\n)\n2 cubic m\/s\n4 cubic m\/s\n6 cubic m\/s\n8 cubic m\/s\nFigure 3\nClick here to download Figure: fig3.pdf\nTalus \nreadjusted\nvolume\nTalus free surface before adjustment\nCoreTalus\nTalus free surface \nafter adjustment \nsub-step\nθ\nRa\nHa\nR\nFigure 4a\nClick here to download Figure: Fig4a_TalusAdj.pdf\nRockfall \nsource\nvolume\nCoreTalus\nDome free \nsurface\nCarapace\nOver-steepened \nsummit material\nAggraded talus\nFigure 4b\nClick here to download Figure: Fig4b_RockfallVol.pdf\nFigure 5: \nNewtonian viscosity model               Shear-thinning viscosity model \n  \na)       b) \n \nc) \n  \n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\n0 5 10 15 20 25 30\nVolume (Mega cubic metres)\nR\na\n\/R\n2 cubic m\/s\n4 cubic m\/s\n6 cubic m\/s\n8 cubic m\/s\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\n0 5 10 15 20 25 30\nVolume (Mega cubic metres)\nR\na\n\/R\n2 cubic m\/s\n4 cubic m\/s\n6 cubic m\/s\n8 cubic m\/s\nFigure 5\nClick here to download Figure: Fig5.pdf\nFigure 6: \nNewtonian viscosity model          Shear-thinning viscosity model \n  \na)                b) \n  \n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n0 5 10 15 20 25 30\nVolume (Mega cubic metres)\nT\na\nlu\ns\n r\ne\na\nd\nju\ns\nte\nd\n (\nc\nu\nb\nic\n m\ne\ntr\ne\ns\n\/s\ne\nc\no\nn\nd\n)\n2 cubic m\/s 4 cubic m\/s\n6 cubic m\/s 8 cubic m\/s\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n0 5 10 15 20 25 30\nVolume (Mega cubic metres)\nT\na\nlu\ns\n r\ne\na\nd\nju\ns\nte\nd\n (\nc\nu\nb\nic\n m\ne\ntr\ne\ns\n\/s\ne\nc\no\nn\nd\n)\n2 cubic m\/s\n4 cubic m\/s\n6 cubic m\/s\n8 cubic m\/s\nFigure 6\nClick here to download Figure: Fig6.pdf\nNew carapace\nvolume\nSolidus pressure isobar\nCore\nTalus\nCarapace\nFigure 7\nClick here to download Figure: Fig7_CoreVol.pdf\nFigure 8: \nNewtonian viscosity model         Shear-thinning viscosity model \n  \na)               b)  \n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n0 5 10 15 20 25 30\nVolume (Mega cubic metres)\nC\na\nra\np\na\nc\ne\n g\ne\nn\ne\nra\nte\nd\n (\nc\nu\nb\nic\n \nm\ne\ntr\ne\ns\n\/s\ne\nc\no\nn\nd\n)\n2 cubic m\/s\n4 cubic m\/s\n6 cubic m\/s\n8 cubic m\/s\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n0 5 10 15 20 25 30\nVolume (Mega cubic metres)\nC\na\nra\np\na\nc\ne\n g\ne\nn\ne\nra\nte\nd\n (\nc\nu\nb\nic\n m\ne\ntr\ne\ns\n p\ne\nr \ns\ne\nc\no\nn\nd\n)\n2 cubic m\/s\n4 cubic m\/s\n6 cubic m\/s\n8 cubic m\/s\nFigure 8\nClick here to download Figure: fig8.pdf\nFigure 9: \nNewtonian viscosity model        Shear-thinning viscosity model \n  \na)            b) \n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n0 2 4 6 8 10\nExtrusion rate (cubic metres\/sec)\nA\nv\ne\nra\ng\ne\n c\na\nra\np\na\nc\ne\n g\ne\nn\ne\nra\nte\nd\n o\nr \nta\nlu\ns\n \nd\ne\nfo\nrm\ne\nd\n (\nc\nu\nb\nic\n m\ne\ntr\ne\ns\n p\ne\nr \ns\ne\nc\no\nn\nd\n) Average talus\ndeformed\nAverage carapace\ngenerated\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n0 2 4 6 8 10\nExtrusion rate (cubic metres\/sec)\nA\nv\ne\nra\ng\ne\n c\na\nra\np\na\nc\ne\n g\ne\nn\ne\nra\nte\nd\n o\nr \nta\nlu\ns\n \nd\ne\nfo\nrm\ne\nd\n (\nc\nu\nb\nic\n m\ne\ntr\ne\ns\n p\ne\nr \ns\ne\nc\no\nn\nd\n)\nAverage talus\ndeformed\nAverage carapace\ngenerated\nFigure 9\nClick here to download Figure: Fig9.pdf\nFigure 10:         \n  \na) Newtonian viscosity model    b) Shear-thinning viscosity model \n \nc)       d)  \n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\n0 5 10 15 20 25 30\nVolume (Mega cubic metres)\nC\no\nre\n v\no\nlu\nm\ne\n f\nra\nc\nti\no\nn\n \n2 cubic m\/s\n4 cubic m\/s\n6 cubic m\/s\n8 cubic m\/s\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\n0 5 10 15 20 25 30\nVolume (Mega cubic metres)\nC\no\nre\n v\no\nlu\nm\ne\n f\nra\nc\nti\no\nn\n2 cubic m\/s\n4 cubic m\/s\n6 cubic m\/s\n8 cubic m\/s\nFigure 10\nClick here to download Figure: Fig10.pdf\nFigure 11: \na)                                           \n \nb) \n0\n1\n2\n3\n4\n5\n6\n7\n0 50 100 150 200 250 300\nTime (days)\nC\na\nra\np\na\nc\ne\n g\ne\nn\ne\nra\nte\nd\n (\nc\nu\nb\nic\n m\ne\ntr\ne\ns\n\/s\ne\nc\no\nn\nd\n)\nSimulation 1\nSimulation 2\nSimulation 3\nSimulation 4\nSimulation 5\nSimulation 6\nSimulation 7\nSimulation 8\n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\n1.6\n1.8\n2\n0 50 100 150 200 250 300\nTime (days)\nC\na\nra\np\na\nc\ne\n g\ne\nn\ne\nra\nte\nd\n d\niv\nid\ne\nd\n b\ny\n e\nx\ntr\nu\ns\nio\nn\n \nra\nte\nSimulation 1\nSimulation 2\nSimulation 3\nSimulation 4\nSimulation 5\nSimulation 6\nSimulation 7\nSimulation 8\nFigure 11 a and b\nClick here to download Figure: fig11_a&b.pdf\nTalus originating \nFrom rockfalls\nSolidus pressure isobar\nTalus Core\nTalus readjusting \nfrom core\nspreading\nPrevious \ncore-talus \ninterface\nNew \ncore-talus \ninterface\nFigure 11 c\nClick here to download Figure: Fig11c_Seismic_vs_Aseismic.pdf\nFigure 12: \n  \na) \n \nb)  \n0\n2\n4\n6\n8\n10\n12\n14\n0 50 100 150 200 250 300\nTime (days)\nT\na\nlu\ns\n d\ne\nfo\nrm\ne\nd\n (\nc\nu\nb\nic\n m\ne\ntr\ne\ns\n\/s\ne\nc\no\nn\nd\n)\nSimulation 1\nSimulation 2\nSimulation 3\nSimulation 4\nSimulation 5\nSimulation 6\nSimulation 7\nSimulation 8\n0\n0.5\n1\n1.5\n2\n2.5\n3\n0 50 100 150 200 250 300\nTime (days)\nT\na\nlu\ns\n d\ne\nfo\nrm\ne\nd\n d\nii\nv\nid\ne\nd\n b\ny\n e\nx\ntr\nu\ns\nio\nn\n r\na\nte\nSimulation 1\nSimulation 2\nSimulation 3\nSimulation 4\nSimulation 5\nSimulation 6\nSimulation 7\nSimulation 8\nFigure 12\nClick here to download Figure: Figures12.pdf\nFigure 13\nClick here to download high resolution image\nFigure 14: \n \na) \n \nb)  \n0\n20\n40\n60\n80\n100\n120\n0 50 100 150 200 250 300\nTime (days)\nC\nu\nm\nu\nla\ntv\ne\n t\na\nlu\ns\n v\no\nlu\nm\ne\n r\ne\na\nd\nju\ns\nte\nd\n (\nM\ne\ng\na\n \nc\nu\nb\nic\n m\ne\ntr\ne\ns\n)\n0\n1000\n2000\n3000\n4000\n5000\n6000\n7000\n8000\n9000\n10000\nC\nu\nm\nu\nla\nti\nv\ne\n n\nu\nm\nb\ne\nr \no\nf \nro\nc\nk\nfa\nll\ns\nSimulation 1\nSimulation 2\nSimulation 3\nSimulation 4\nSimulation 5\nSimulation 6\nSimulation 7\nSimulation 8\nCumulative rockfall data\n0\n10\n20\n30\n40\n50\n60\n0 50 100 150 200 250 300\nTime (days)\nC\nu\nm\nu\nil\na\nti\nv\ne\n c\na\nra\np\na\nc\ne\n g\ne\nn\ne\nra\nte\nd\n (\nM\ne\ng\na\n \nc\nu\nb\nic\n m\ne\ntr\ne\ns\n)\n0\n1000\n2000\n3000\n4000\n5000\n6000\n7000\n8000\n9000\nC\nu\nm\nu\nla\nti\nv\ne\n n\nu\nm\nb\ne\nr \no\nf \nro\nc\nk\nfa\nll\ns\nSimulation 1\nSimulation 2\nSimulation 3\nSimulation 4\nSimulation 5\nSimulation 6\nSimulation 7\nSimulation 8\nCumulative rockfall data\nFigure 14\nClick here to download Figure: Figures14.pdf\nFigure 15: \n \na) \n \nb)  \n0\n2000\n4000\n6000\n8000\n10000\n12000\n0 50 100 150 200 250 300\nTime (days)\nC\nu\nm\nu\nla\nti\nv\ne\n p\nro\nx\ny\n e\nn\ne\nrg\ny\n f\no\nr \nta\nlu\ns\n \nre\na\nd\nju\ns\ntm\ne\nn\nt \n(M\ne\ng\na\n c\nu\nb\nic\n m\ne\ntr\ne\ns\n x\n H\na\n)\n0\n1\n2\n3\n4\n5\n6\nC\nu\nm\nu\nla\nti\nv\ne\n s\ne\nis\nm\nic\n e\nn\ne\nrg\ny\n (\nm\nJ\n\/k\ng\n)\nSimulation 1\nSimulation 2\nSimulation 3\nSimulation 4\nSimulation 5\nSimulation 6\nSimulation 7\nSimulation 8\nCumulative seismic energy proxy\n0\n1000\n2000\n3000\n4000\n5000\n6000\n7000\n0 50 100 150 200 250 300\nTime (days)\nC\nu\nm\nu\nla\nti\nv\ne\np\nro\nx\ny\n e\nn\ne\nrg\ny\n f\no\nr \nc\na\nra\np\na\nc\ne\n \ng\ne\nn\ne\nra\nte\nd\n (\nM\ne\ng\na\n c\nu\nb\nic\n m\ne\ntr\ne\ns\n x\n H\na\n)\n0\n1\n2\n3\n4\n5\n6\nC\nu\nm\nu\nla\nti\nv\ne\n s\ne\nis\nm\nic\n e\nn\ne\nrg\ny\n (\nm\nJ\n\/k\ng\n)\nSimulation 1\nSimulation 2\nSimulation 3\nSimulation 4\nSimulation 5\nSimulation 6\nSimulation 7\nSimulation 8\nCumulative seismic energy proxy\nFigure 15\nClick here to download Figure: Figures_15.pdf\n"}