{"doi":"10.5194\/angeo-25-689-2007","coreId":"71098","oai":"oai:eprints.lancs.ac.uk:6710","identifiers":["oai:eprints.lancs.ac.uk:6710","10.5194\/angeo-25-689-2007"],"title":"On the location and structure of the artificial 630-nm airglow patch over Sura facility","authors":["Grach, S. M.","Kosch, M. J.","Yashnov, V. A.","Sergeev, E. N.","Atroshenko, M. A.","Kotov, P. V."],"enrichments":{"references":[{"id":16385584,"title":"A model of enhanced airglow excited by RF radiation,","authors":[],"date":"1974","doi":"10.1029\/rs009i011p01005","raw":"Haslett, S. C. and Megill, L. R.: A model of enhanced airglow excited by RF radiation, Radio Sci., 9, 1005–1020, 1974.","cites":null},{"id":16385547,"title":"Acceleration of Electrons in the Ionosphere Under the Action of Intense Radio Wave Near Electron Cyclotron Harmonics,","authors":[],"date":"1992","doi":"10.1016\/0021-9169(92)90021-c","raw":"Dimant, Ya. S., Gurevich, A. V., and Zybin, K. P.: Acceleration of Electrons in the Ionosphere Under the Action of Intense Radio Wave Near Electron Cyclotron Harmonics, J. Atmos. Terr. Phys., 54, 435–436, 1992. Djuth, F. T., Pedersen, T. R., Gerken, E. A., Bernhardt, P. A., Selcher, C. A., Bristow, W. A., and Kosch, M. J.: Ionospheric Modiﬁcation at Twice the Electron Cyclotron Frequency, Phys.","cites":null},{"id":16385533,"title":"Airglow Enhancements Associated With Plasma Cavities Formed During Ionospheric Heating Experiments,","authors":[],"date":null,"doi":"10.1029\/ja094ia07p09071","raw":"Bernhardt, P. A., Tepley, C. A., and Duncan, L. M.: Airglow Enhancements Associated With Plasma Cavities Formed During Ionospheric Heating Experiments, J. Geophys. Res., 94, 9071– 9092, 1989a.","cites":null},{"id":16385574,"title":"Artiﬁcial ionospheric glow caused by short-term effect of highpower RF radiation,","authors":[],"date":"1999","doi":"10.1007\/bf02677582","raw":"Gumerov, R. I., Kapkov, V. B., Komrakov, G. P., and Nasyrov, A. M.: Artiﬁcial ionospheric glow caused by short-term effect of highpower RF radiation, Radiophys. Quantum Electron, 42, 463–465, 1999.","cites":null},{"id":16385596,"title":"Artiﬁcial optical emission at HAARP for pump frequencies near third and second electron gyro-harmonic,","authors":[],"date":"2005","doi":"10.5194\/angeo-23-1585-2005","raw":"Kosch, M. J., Pedersen, T., Hughes, J., Marshall, R., Gerken, E., Senior, A., Sentman, D., McCarric, M., and Djuth, F. T.: Artiﬁcial optical emission at HAARP for pump frequencies near third and second electron gyro-harmonic, Ann. Geophys., 23, 1585–1592, 2005, http:\/\/www.ann-geophys.net\/23\/1585\/2005\/.","cites":null},{"id":16385590,"title":"Density depletions at the 10-m scale induced by the Arecibo heater,","authors":[],"date":"1995","doi":"10.1029\/95ja00063","raw":"Kelley, M. C., Arce, T. L., Salowey, J., Sulzer, M., Armstrong, W. T., Carter, M., and Duncan, L.: Density depletions at the 10-m scale induced by the Arecibo heater, J. Geophys. Res., 100, 17367–17376, 1995.","cites":null},{"id":16385626,"title":"Development stage,","authors":[],"date":"1999","doi":null,"raw":"Part I. Development stage, Radiophys. Quantum Electron., Engl. Transl., 42, 544–556, 1999.","cites":null},{"id":16385528,"title":"Effects of stimulated scattering for an electromagnetic pulse incident on a plasma layer,","authors":[],"date":"1974","doi":null,"raw":"Al’ber, Ya. I., Krotova, Z. N., Mityakov, N. A., et al.: Effects of stimulated scattering for an electromagnetic pulse incident on a plasma layer, Sov. Phys. JETP, 39, 275–277, 1974.","cites":null},{"id":16385560,"title":"Electromagnetic radiation from artiﬁcial ionospheric plasma turbulence,","authors":[],"date":"1985","doi":"10.1007\/bf01034946","raw":"Grach, S. M.: Electromagnetic radiation from artiﬁcial ionospheric plasma turbulence, Radiophys. Quantum Electron., 28, 470–477, 1985.","cites":null},{"id":16385562,"title":"Electron acceleration and additional ionization at the parametric plasma heating,","authors":[],"date":"1986","doi":"10.1007\/bf01041384","raw":"Grach, S. M., Mityakov, N. A., and Trakhtengertz, V. Yu., Electron acceleration and additional ionization at the parametric plasma heating, Fizika plazmy, 12, 693–702, 1986, in Russian, (Sov.","cites":null},{"id":16385588,"title":"Electron acceleration by cylindrical upper hybrid oscillations trapped in density irregularities in the ionosphere,","authors":[],"date":"2003","doi":"10.1063\/1.1578637","raw":"Istomin, Ya. N. and Leyser, T. B.: Electron acceleration by cylindrical upper hybrid oscillations trapped in density irregularities in the ionosphere, Phys. Plasmas, 10, 2962–2970, 2003.","cites":null},{"id":16385531,"title":"Evolution of subkilometer scale ionospheric irregularities generated by high-power HF waves,","authors":[],"date":"1997","doi":"10.1029\/96ja03340","raw":"Basu, S., Costa, E., Livingston, R. C., Groves, K. M., Carlson, H. C., Chaturvedi, P. K., and Stubbe, P.: Evolution of subkilometer scale ionospheric irregularities generated by high-power HF waves, J. Geophys. Res., 102, 7469–7476, 1997.","cites":null},{"id":16385539,"title":"Excitation of artiﬁcial airglow by high power radio waves from the “Sura” ionospheric heating facility,","authors":[],"date":"1991","doi":"10.1029\/91gl01847","raw":"Bernhardt, P. A., Scales, W. A., Grach, S. M., Karashtin, A. N., Kotik, D. S., and Polyakov, S. V.: Excitation of artiﬁcial airglow by high power radio waves from the “Sura” ionospheric heating facility, Geophys. Res. Lett., 18, 1477–1480, 1991.","cites":null},{"id":16385597,"title":"Excitation of oscillating two stream instability by upper hybrid pump in ionospheric heating experiments at Tromsø,","authors":[],"date":"1997","doi":"10.1029\/97gl03054","raw":"Kuo, S., Lee, M., and Kossey, P.: Excitation of oscillating two stream instability by upper hybrid pump in ionospheric heating experiments at Tromsø, Geophys. Res. Lett., 24, 2969–2972, 1997.","cites":null},{"id":16385551,"title":"Excitation of strong Langmuir turbulence in plasmas near critical density: Aplication to HF heating of the ionosphere,","authors":[],"date":"1990","doi":"10.1029\/ja095ia12p21221","raw":"DuBois, D. F., Rose, A. H., and Russel, D.: Excitation of strong Langmuir turbulence in plasmas near critical density: Aplication to HF heating of the ionosphere, J. Geophys. Res., 95, 21221– 21272, 1990.","cites":null},{"id":16385604,"title":"First observation of HF heater produced airglow at the High Frequency Active Auroral Research Program facility: Thermal excitation and spatial structuring,","authors":[],"date":"2001","doi":"10.1029\/2000rs002399","raw":"Pedersen, T. R. and Carlson, H. C.: First observation of HF heater produced airglow at the High Frequency Active Auroral Research Program facility: Thermal excitation and spatial structuring, Radio Sci., 36, 1013–1026, 2001.","cites":null},{"id":16385580,"title":"First Tomographic estimate of volume distribution of HF-pump enhanced airglow emission.","authors":[],"date":"2001","doi":"10.1029\/2000ja900167","raw":"Gustavsson, B., Sergienko, T., Rietveld, M. T., Honary, F., Steen, ˚ A, Br¨ andsr¨ om, B. U. E., Leyser, T. B., Aruliah, A. L., Aso, T., Ejiri, M., and Marple, S.: First Tomographic estimate of volume distribution of HF-pump enhanced airglow emission. J. Geophys. Res., 106, 29105–29123, 2001.","cites":null},{"id":16385536,"title":"Grach et al.: On the location and structure...","authors":[],"date":"2007","doi":null,"raw":"Ann. Geophys., 25, 689–700, 2007 www.ann-geophys.net\/25\/689\/2007\/S. M. Grach et al.: On the location and structure... 699 Bernhardt P. A., Duncan, L. M., and Tepley, C. A.: Heater-induced cavities as optical tracers of plasma drifts, J. Geophys. Res., 94, 7003–7010, 1989b.","cites":null},{"id":16385600,"title":"H.C.: Reinterpretationofthe6300Aairglow enhancements observed in ionosphere heating experiments based on analysis of Plattevile, Colorado data,","authors":[],"date":"1996","doi":"10.1029\/95ja02760","raw":"Mantas, G.P.andCarlson, H.C.: Reinterpretationofthe6300Aairglow enhancements observed in ionosphere heating experiments based on analysis of Plattevile, Colorado data, J. Geophys. Res., 101, 195–209, 1996.","cites":null},{"id":16385595,"title":"High-latitude pump induced optical emissions for frequencies coose to www.ann-geophys.net\/25\/689\/2007\/ Ann.","authors":[],"date":null,"doi":null,"raw":"Kosch, M. J., Rietveld, M. T., Kavanagh, A. J., Davis, C., Yeoman, T. K., Honary, F., and T. Hagfors: High-latitude pump induced optical emissions for frequencies coose to www.ann-geophys.net\/25\/689\/2007\/ Ann. Geophys., 25, 689–700, 2007700 S. M. Grach et al.: On the location and structure... third electron gyro-harmonic, Geophys. Res. Lett., 29, 2112, doi:10.1029\/2002GL015744, 2002b.","cites":null},{"id":16385592,"title":"Highlatitude HF-induced airglow displaced equatorwards of the pump beam,","authors":[],"date":"2000","doi":"10.1029\/2000gl003754","raw":"Kosch, M. J., Rietveld, M. T., Hagfors, T., and Leyser, T. B.: Highlatitude HF-induced airglow displaced equatorwards of the pump beam, Geophys. Res. Lett., 27, 2817–2820, 2000.","cites":null},{"id":16385549,"title":"Imaging HF-induced large-scale irregularities above HAARP,","authors":[],"date":"2006","doi":"10.1029\/2005gl024536","raw":"Djuth, F. T., Reinisch, B. W., Kitrosser, D. F., Elder, J. H., Lee, S. A., and Sales, G. S.: Imaging HF-induced large-scale irregularities above HAARP, Geophys. Res. Lett., 33, L04107, doi:10.1029\/2005GL024536, 2006.","cites":null},{"id":16385654,"title":"Impact of vibrational excitation on ionoswpheric parameters and artiﬁcial airglow during HF heating in the F-region,","authors":[],"date":"2004","doi":"10.1029\/2003ja010316","raw":"Vlasov M. N., Kelley M. C., and Gerken, E.: Impact of vibrational excitation on ionoswpheric parameters and artiﬁcial airglow during HF heating in the F-region, J. Geophys, Res., 109, A093004, doi:10.1029\/2003JA010316, 2004.","cites":null},{"id":16385525,"title":"Ionospheric emission caused by an intense radio wave,","authors":[],"date":"1978","doi":null,"raw":"G., Milikh, G. M., and Shlyuger, I. S.: Ionospheric emission caused by an intense radio wave, Sov. J. Plasma Phys., 4, 721– 726, 1978.","cites":null},{"id":16385578,"title":"Magnetic zenith effect in ionospheric modiﬁcation,","authors":[],"date":"2002","doi":"10.1016\/s0375-9601(02)01450-0","raw":"Gurevich, A. V., Zybin, K. P., Carlson, H. C., and Pedersen, T.: Magnetic zenith effect in ionospheric modiﬁcation, Phys. Lett., A305, 264–274, 2002.","cites":null},{"id":16385606,"title":"Magnetic zenith enhancement of HF radio-induced airglow production at HAARP,","authors":[],"date":"2003","doi":"10.1029\/2002gl016096","raw":"Pedersen, T. R., McCarric, M., Gerken, E., Selcher, C., Sentman, D., Carlson, H. C., and Gurevich, A. V.: Magnetic zenith enhancement of HF radio-induced airglow production at HAARP, Geophys. Res. Lett., 30, doi:10\/1029\/2002GL016096, 2003.","cites":null},{"id":16385576,"title":"Multiple acceleration of in the region of high-power radio-wave reﬂection in the ionosphere,","authors":[],"date":"1985","doi":"10.1016\/0021-9169(85)90023-6","raw":"Gurevich, A. V., Dimant, Ya. S., Milikh, G. M., and Vas’kov, V. V.: Multiple acceleration of in the region of high-power radio-wave reﬂection in the ionosphere, J. Atmos. Terr. Phys., 47, 1057– 1070, 1985.","cites":null},{"id":16385544,"title":"Observation of ﬂuxes of suprathermal electrons accelerated by HF excited instabilities,","authors":[],"date":null,"doi":"10.1016\/0021-9169(82)90020-4","raw":"Carlson, H. C., Wickwar, V. B., and Mantas, G. P.: Observation of ﬂuxes of suprathermal electrons accelerated by HF excited instabilities, J. Atmos. Terr. Phys., 44, 1089–1100, 1982.","cites":null},{"id":16385565,"title":"On frequency dependence of probe wave abnormal attenuation prohile modifying the ionosphere by powerful radio emission,","authors":[],"date":"1998","doi":null,"raw":"Grach, S. M., Komrakov, G. P., Shvarts, M. M., and Yurishchev, M. A.: On frequency dependence of probe wave abnormal attenuation prohile modifying the ionosphere by powerful radio emission, Izv.VUZov – Radioﬁzika, 41, 966–977, 1998, in Russian (Radiophys. Quantum Electron., Engl. Transl., 41, no. 8, 1998).","cites":null},{"id":16385568,"title":"On kinetic effects in the ionospheric F-region modiﬁed by powerful radio waves,","authors":[],"date":"1999","doi":"10.1007\/bf02677563","raw":"Grach, S. M.: On kinetic effects in the ionospheric F-region modiﬁed by powerful radio waves, Radiophys. Quantum Electron., Engl. Transl., 42, 572–588, 1999.","cites":null},{"id":16385601,"title":"On the electron distribution function in the F region and airglow enhancements during HF modiﬁcation experiments,","authors":[],"date":"2000","doi":"10.1029\/2000gl000075","raw":"Mishin, E. V., Carlson, H. C., and Hagfors, T.: On the electron distribution function in the F region and airglow enhancements during HF modiﬁcation experiments, Geophys. Res. Lett., 27, 2857–2860, 2000.","cites":null},{"id":16385636,"title":"On the morphology of SEE spectral features in a wide pump wave frequency range,","authors":[],"date":"2006","doi":"10.1016\/j.asr.2005.02.046","raw":"Sergeev, E. N., Frolov, V. L., Grach, S. M., and Kotov, P.V.: On the morphology of SEE spectral features in a wide pump wave frequency range, Adv. Space Res., 38, 2518–2536, doi:10.1016\/j.asr.2005.02.046, 2006.","cites":null},{"id":16385602,"title":"On the onset of HF-induced airglow at HAARP.","authors":[],"date":"2004","doi":"10.1029\/2003ja010205","raw":"Mishin, E. V., Burke, W. J., and Pedersen, T.: On the onset of HF-induced airglow at HAARP. J. Geophys. Res. 109, A02305, doi:10.1029\/2003JA010205, 2004.","cites":null},{"id":16385542,"title":"Optical remote sensing of the thermosphere with HF pumped artiﬁcial airglow,","authors":[],"date":"2000","doi":"10.1029\/1999ja000366","raw":"Bernhardt, P. A., Wong, M., Huba, J. D., Fejer, B. G., Wagner, L. S., Goldstein, J. A., Selcher, C. A., Folov, V. L., and Sergeev, E. N.: Optical remote sensing of the thermosphere with HF pumped artiﬁcial airglow, J. Geophys. Res., 105, 10657–10671, 2000.","cites":null},{"id":16385612,"title":"Parametric instabilities and ionospheric modiﬁcations,","authors":[],"date":"1974","doi":"10.1029\/ja079i010p01478","raw":"Perkins, F. W., Oberman, C. R., and Valeo, E. J.: Parametric instabilities and ionospheric modiﬁcations, J. Geophys. Res., 79, 1478–1483, 1974.","cites":null},{"id":16385586,"title":"Parametric interaction of selflocalized upper hybrid states in quantized plasma density irregularities,","authors":[],"date":"1998","doi":"10.1063\/1.872661","raw":"Istomin, Y. N. and Leyser, T. B.: Parametric interaction of selflocalized upper hybrid states in quantized plasma density irregularities, Phys. Plasmas, 5, 921–931, 1998.","cites":null},{"id":16385644,"title":"Radio tomography and scintillation studies of ionospheric electron density modiﬁcation caused by a powerful HF-wave and magnetic zenith effect at mid-latitudes,","authors":[],"date":"2004","doi":"10.1016\/j.physleta.2004.03.055","raw":"Tereshchenko, E. D., Khudukon, B. Z., Gurevich, A. V., Zybin, K. P., Frolov, V. L., Myasnikov, E. N., Muravieva, N. V., and Carlson, H. C.: Radio tomography and scintillation studies of ionospheric electron density modiﬁcation caused by a powerful HF-wave and magnetic zenith effect at mid-latitudes, Phys. Lett., A325, 381–388, 2004.","cites":null},{"id":16385648,"title":"Resonance instability of smallscale plasma perturbations,","authors":[],"date":"1977","doi":null,"raw":"Vas’kov, V. V. and Gurevich, A. V.: Resonance instability of smallscale plasma perturbations, Sov. Phys. J. Exp. Theor. Phys., 46, 487–494, 1977.","cites":null},{"id":16385651,"title":"Samofokusirovochnaya i resonansnaya neustoichvost’ v F-oblasti v ionosfere, in: “Teplovye nelinienye effekty v plazme”, 81–138, Gorky,","authors":[],"date":"1979","doi":null,"raw":"Vas’kov, V. V. and Gurevich, A. V.: Samofokusirovochnaya i resonansnaya neustoichvost’ v F-oblasti v ionosfere, in: “Teplovye nelinienye effekty v plazme”, 81–138, Gorky, 1979, (in Russian) (Self-focusing and resonant instability in the ionospheric Fregion, in: “Thermal nonlinear phenomena in a plasma”), 1979.","cites":null},{"id":16385598,"title":"Simultaneous measurements of high frequency pump-enhanced airglow and ionospheric temperatures in auroral latitudes, Adv. Polar Upper Atmos.","authors":[],"date":"2000","doi":null,"raw":"Leyser, T. B., Gustavsson, B., Br¨ andstr¨ om, B. U., et al.: Simultaneous measurements of high frequency pump-enhanced airglow and ionospheric temperatures in auroral latitudes, Adv. Polar Upper Atmos. Res., 14, 1–11, 2000.","cites":null},{"id":16385571,"title":"Simultaneous observations of the 557.7 nm airglow and stimulated electromagnetic emission during HF pumping of the ionosphere with diagnostic schedule: ﬁrst results,","authors":[],"date":"2004","doi":"10.1016\/j.asr.2003.08.070","raw":"Grach, S. M., Sergeev, E. N., Nasyrov, A. M., Gumerov, R. I., Shaimukhametov, R. R., Nasyrov, I. A., and Komrakov, G. P.: Simultaneous observations of the 557.7 nm airglow and stimulated electromagnetic emission during HF pumping of the ionosphere with diagnostic schedule: ﬁrst results, Adv. Space Res., 34, 2422–2427, 2004.","cites":null},{"id":16385640,"title":"Six days of thermosphric-ionospheric weather over the northern hemisphere in late","authors":[],"date":"1981","doi":"10.1029\/2001ja001113","raw":"Strickland. D. J., Craven, J. D., and Daniell Jr., R. E.: Six days of thermosphric-ionospheric weather over the northern hemisphere in late September 1981, J. Geophys. Res., A106, 30291–30306, 2001.","cites":null},{"id":16385603,"title":"Spatial Spectrum of Artiﬁcial Ionospheric Irregularities Induced by Powerful HF Radiowaves.","authors":[],"date":"2001","doi":null,"raw":"Myasnikov, E. N., Muravjeva, N. V., Sergeev, E. N., Frolov, V. L., Nasyrov, A. M., Nasyrov, I. A., Beley, V. S., Koloskov, A. V., Yampolsky, Yu. M., and Groves, K. M.: Spatial Spectrum of Artiﬁcial Ionospheric Irregularities Induced by Powerful HF Radiowaves. Radiophys. Quantum Electron, 44, 833–846, 2001.","cites":null},{"id":16385553,"title":"Spectral features of stimulated electromagnetic emissions, measured in the 4.3–9.5MHz pump wave frequency range,","authors":[],"date":"2001","doi":"10.1029\/2001gl013251","raw":"Frolov, V. L., Sergeev, E. N., Ermakova, E. N., Komrakov, G. P., and Stubbe, P.: Spectral features of stimulated electromagnetic emissions, measured in the 4.3–9.5MHz pump wave frequency range, Geophys. Res. Lett., 28, 3103–3106, 2001.","cites":null},{"id":16385599,"title":"Stimulated electromagnetic emissions by high frequency electromagnetic pumping of the ionospheric plasma,","authors":[],"date":"2001","doi":null,"raw":"Leyser, T. B.: Stimulated electromagnetic emissions by high frequency electromagnetic pumping of the ionospheric plasma, Space Sci. Rev., 98, 223–328, 2001.","cites":null},{"id":16385555,"title":"Study of large-scale irregularities generated in the ionospheric F-region by high-power HF waves,","authors":[],"date":"2000","doi":"10.1007\/bf02677173","raw":"M., Nasyrov, I. A., and Groves, K. M.: Study of large-scale irregularities generated in the ionospheric F-region by high-power HF waves, Izv. vuzov. Radioﬁzika, 43, no 6, 497–519, 2000 (Radiophys. Quantum Electron., Engl. Transl. 43, no. 6, 2000.) Grach, S. M., Karashtin, A. N., Mityakov, N. A., Rapoport, V. O., and Trakhtengertz, V. Yu.: Parametric interaction between electromagnetic radiation and ionospheric plasma, Radiophys. Quantum Electron., Engl. Transl., 20, 1254–1259, 1977.","cites":null},{"id":16385630,"title":"Study of the excitation conditions and characteristics of ionospheric plasma turbulence at the development stage of the ponderomotive parametric instability,","authors":[],"date":"2004","doi":"10.1023\/b:raqe.0000036564.99398.83","raw":"Sergeev, E. N., Grach, S. M., and Kotov, P. V.: Study of the excitation conditions and characteristics of ionospheric plasma turbulence at the development stage of the ponderomotive parametric instability, Radiophys. Quantum Electron, 47, 185–204, 2004.","cites":null},{"id":16385582,"title":"The electron energy distribution during HF pumping, a picture painted with all colors,","authors":[],"date":"2005","doi":"10.5194\/angeo-23-1747-2005","raw":"Gustavson, B., Sergienko. T., Kosch, M. J., Rietveld M. T., Br¨ andsr¨ om, B. U. E., Leyser, T. B., Isham B., Gallop, P., Aso, T., Ejiri, M., Grydeland, T., Steen, A., LaHoz, C., Kalia, K., Jussia, J., and Holma, H.: The electron energy distribution during HF pumping, a picture painted with all colors, Ann. Geophys., 23, 1747–1754, 2005, http:\/\/www.ann-geophys.net\/23\/1747\/2005\/.","cites":null},{"id":16385622,"title":"The heating of the high latitude ionosphere by high power radio waves, Physics reports, 179, 79–209,","authors":[],"date":"1989","doi":"10.1016\/0370-1573(89)90005-7","raw":"Robinson, T. R.: The heating of the high latitude ionosphere by high power radio waves, Physics reports, 179, 79–209, 1989. Sergeev, E. N. Grach, S. M., Komrakov, G. P., Frolov, V. L., Stubbe, P., Thid´ e, B., Leyser, T., and Carozzi, T.: Inﬂuence of smallscale irregularities on characteristics of the overshoot effect in the temporal evolution of stimulated electromagnetic emission.","cites":null},{"id":16385594,"title":"The high-latitude artiﬁcial aurora","authors":[],"date":"1999","doi":"10.1007\/s005850000285","raw":"Kosch, M. J., Rietveld, M. T., Yeoman, T. K., Cierpka, K., and Hagfors, T.: The high-latitude artiﬁcial aurora of 21 February 1999: An analysis, Advances Polar Upper Atmos. Res., 16, 1– 12, 2002a.","cites":null},{"id":16385708,"title":"Theory of electron acceleration during parametric instabilities,","authors":[],"date":"1974","doi":"10.1103\/physrevlett.32.754","raw":"Weinstock, J. and Bezzerides, B.: Theory of electron acceleration during parametric instabilities, Phys. Rev. Lett., 32, 754–748, 1974.","cites":null},{"id":16385558,"title":"Thermal parametric turbulence in a plasma,","authors":[],"date":"1981","doi":"10.1016\/0167-2789(81)90063-4","raw":"Grach, S. M., Mityakov, N. A., Rapoport, V. O., and Trakhtengertz, V. Yu.: Thermal parametric turbulence in a plasma, Physica, 2D, 102–106, 1981.","cites":null},{"id":16385616,"title":"Thermal self-focusing of electromagnetic waves in plasmas,","authors":[],"date":"1974","doi":"10.1103\/physrevlett.32.1234","raw":"Perkins, F. W. and Valeo, E. J.: Thermal self-focusing of electromagnetic waves in plasmas, Phys. Rev. Lett., 32, 1234–1237, 1974. Rietveld, M. T., Kosch, M. J., Blagoveshchenskaya, N. F., Kornienko, V.A., LeyserT.B., andYeomanT. K.: Ionosphericelectron heating, optical emission, and striation induced by poewrful HF radi0 waves at high latitudes: Aspect angle dependence, J.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-03","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71098.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/6710\/1\/art_854.pdf","pdfHashValue":"0c8a32d5ee19e6fb2c69aa673f2ec5e745108859","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:6710<\/identifier><datestamp>\n      2018-01-24T03:16:01Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5431<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        On the location and structure of the artificial 630-nm airglow patch over Sura facility<\/dc:title><dc:creator>\n        Grach, S. M.<\/dc:creator><dc:creator>\n        Kosch, M. J.<\/dc:creator><dc:creator>\n        Yashnov, V. A.<\/dc:creator><dc:creator>\n        Sergeev, E. N.<\/dc:creator><dc:creator>\n        Atroshenko, M. A.<\/dc:creator><dc:creator>\n        Kotov, P. V.<\/dc:creator><dc:subject>\n        T Technology (General)<\/dc:subject><dc:date>\n        2007-03<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/6710\/1\/art_854.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-25-689-2007<\/dc:relation><dc:identifier>\n        Grach, S. M. and Kosch, M. J. and Yashnov, V. A. and Sergeev, E. N. and Atroshenko, M. A. and Kotov, P. V. (2007) On the location and structure of the artificial 630-nm airglow patch over Sura facility. Annales Geophysicae, 25 (3). pp. 689-700. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/6710\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-25-689-2007","http:\/\/eprints.lancs.ac.uk\/6710\/"],"year":2007,"topics":["T Technology (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Ann. Geophys., 25, 689–700, 2007\nwww.ann-geophys.net\/25\/689\/2007\/\n© European Geosciences Union 2007\nAnnales\nGeophysicae\nOn the location and structure of the artificial 630-nm airglow patch\nover Sura facility\nS. M. Grach1,2, M. J. Kosch3,4,5, V. A. Yashnov1, E. N. Sergeev2, M. A. Atroshenko1, and P. V. Kotov1,2\n1Radiophysics Faculty, State University of Nizhny Novgorod, Russia\n2Radiophysical Research Institute, Nizhny Novgorod, Russia\n3Communication Systems, Lancaster University, Lancaster LA1 4WA, UK\n4Honorary Research Fellow, University of Kwazulu-Natal, Durban 4001, South Africa\n5Currently at Space Vehicles Directorate, Air Force Research Laboratory, Hanscom Air Force Base, MA, USA\nReceived: 13 September 2006 – Revised: 2 February 2007 – Accepted: 15 February 2007 – Published: 29 March 2007\nAbstract. Results are presented of the artificial optical emis-\nsion of the atomic oxygen red line (the radiation of level\nO(1D) with a wavelength of 630 nm) from the HF-pumped\nionosphere, obtained in September 2004 at the SURA heat-\ning facility situated near Nizhny Novgorod, Russia. For ver-\ntical pumping the airglow patch was increasingly displaced\nto the north, up to 7–8◦, with increasing reflection altitude.\nFor large brightness of the emission, the airglow patch started\nto develop at the northern edge of the pump beam and later\nexpanded to the south. These effects are attributed to the\nprecipitation of supra-thermal electrons from the pump wave\nupper hybrid resonance altitude to lower altitudes where ex-\ncitation of the O(1D) level is more effective due to the larger\ndensity of atomic oxygen, and the O(1D) lifetime is shorter.\nFor a pump beam inclination of 12◦ to the south, the opti-\ncal spot was displaced by 4–5◦ to the south relative to the\nstraight-line projection of the pump beam onto the sky. This\nexceeds that expected from the ray tracing and may be re-\nlated, most probably, to the so-called “magnetic zenith” ef-\nfect. In addition, mid-scale (1–10 km) magnetic field-aligned\nstructures were observed in the pumped volume of the iono-\nsphere. The east-west motions of the airglow patches are also\nanalyzed.\nKeywords. Ionosphere (Active experiments; Wave-particle\ninteractions)\n1 Introduction\nA powerful O-polarized HF radio wave injected into the\nionospheric F-region from the ground excites HF plasma\nwaves near and slightly below its reflection point. These\nwaves heat the plasma (a 250–300% enhancement of the\nelectron temperature can be achieved) and accelerate elec-\nCorrespondence to: S. M. Grach\n(sg@nirfi.sci-nnov.ru)\ntrons up to energies of 5–30 eV (Carlson et al., 1982; Leyser\net al., 2000). Recently, Gustavson et al. (2005) found some\nevidence of electron acceleration up to 60 eV. The plasma\nheating and electron acceleration cause an airglow enhance-\nment due to excitation of the neutrals by electron impact\n(Haslett and Megill, 1974). The brightest optical emission\nis the red line of atomic oxygen (the radiation of level O(1D)\nwith a wavelength of 630 nm and has an excitation threshold\nenergy of 1.96 eV). The other emissions from atomic oxygen\nand molecular nitrogen (O and N2) at wavelengths 557.7 nm\n[level O(1S)], 844.6 nm [level O(3p3P)] and 427.8 nm [level\nN+2 (B26−u )] have larger excitation thresholds (4.17, 10.99,\n18 eV, respectively) and smaller excitation cross sections;\nsee, e.g. Gustavson et al. (2005). The artificial airglow\nhas been studied since early 1970s at different ionospheric\nheating facilities, such as Arecibo (Puerto-Rico), Platteville\n(Boulder, Colorado), EISCAT (Tromsø, Norway), SURA\n(Nizhniy Novgorod, Russia), HAARP and HIPAS (Alaska).\nObservations of the artificial airglow are used to study\nthe electron acceleration by HF pump-driven electrostatic\nplasma waves, as well as for mapping of the ionosphere\n(Haslett and Megill, 1974; Bernhardt et al., 1989a,b; Leyser\net al., 2000; Bernhardt et al., 1991, 2000; Pedersen and Carl-\nson, 2001; Gustavson et al., 2001, 2005; Gumerov et al.,\n1999; Grach et al., 2004; Kosch et al., 2002a, 2005). Map-\nping of the pumped volume with CCD cameras is used for re-\nmote sensing of the large-scale irregularities of both natural\nand HF-pump driven origin. Velocities of their drift motion,\nas well as diffusion coefficients and the lifetime of the O(1D)\nquenching can be determined from an analysis of the artifi-\ncial airglow images (Bernhardt et al., 1989b; Leyser et al.,\n2000; Bernhardt et al., 2000; Pedersen and Carlson, 2001).\nRecently, the so-called magnetic zenith effect (MZE), a sig-\nnificant enhancement of the airglow intensity accompanied\nby a dramatic increase in the electron temperature during\npumping along the geomagnetic field line direction, was dis-\ncovered with the use of optical observations at the HAARP\nPublished by Copernicus GmbH on behalf of the European Geosciences Union.\n690 S. M. Grach et al.: On the location and structure...\nand EISCAT facilities (Kosch et al., 2000; Gurevich et al.,\n2002; Pedersen et al., 2003; Rietveld et al., 2003). In some\nexperiments mid-scale (∼1 km) magnetic field-aligned struc-\ntures in the HF pumped ionosphere are seen in the optical\nimages (see, e.g. Djuth et al., 2005). Such structures were\nalso obtained by different radio methods and in-situ measure-\nments (Basu et al., 1997; Kelley et al., 1995; Frolov et al.,\n2001; Myasnikov et al., 2001; Djuth et al., 2006). The ex-\nistence of such structures is supported by theoretical predic-\ntions (e.g. Perkins and Valeo, 1974; Vas’kov and Gurevich,\n1979; Gurevich et al., 2002).\nTwo candidates for the electron acceleration are Langmuir\nwaves and upper hybrid turbulence. Langmuir waves ap-\npear due to the ponderomotive parametric instabilities near\nthe pump wave reflection point z0, at which fpe(zr)=f0,\nand propagate mainly along the magnetic field (Al’ber et\nal., 1974; Perkins et al., 1974; DuBois et al., 1990). Up-\nper hybrid waves initially appear due to the thermal paramet-\nric instability, mainly across the magnetic field, a few kilo-\nmeters below zr near the upper hybrid (UH) resonance alti-\ntude zUH, at which fpe(zUH)=[f 20 −f 2ce(zUH)]1\/2, where fpe\nand fce are the local ionospheric electron plasma and elec-\ntron cyclotron frequencies, respectively (Grach et al., 1977;\nVas’kov and Gurevich, 1977; Robinson, 1989). During the\ndeveloped stage of the thermal parametric instability, the up-\nper hybrid waves essentially broaden their spatial and an-\ngular spectrum (Grach et al., 1981) and excite, as a pump,\ndaughter upper hybrid, Langmuir, and lower hybrid waves\nunder different ponderomotive nonlinear processes (Grach,\n1981; Kuo et al., 1997; Istomin and Leyser, 1998; Mishin\net al., 2004). The question of which candidate dominates\nis under long-standing theoretical discussion (Weistock and\nBezzerides, 1974; Gurevich et al., 1985; Grach et al., 1986;\nDimant et al., 1992; Grach, 1999; Gurevich et al., 2002; Is-\ntomin and Leyser, 2003) but still remains to be resolved. Re-\ncent experimental achievements demonstrated that for long\n(&10 s), pumping electron acceleration is linked to the upper\nhybrid turbulence while short (&10 ms) pump pulses provide\nan effective acceleration by Langmuir waves (Gumerov et al.,\n1999; Gustavson et al., 2001; Kosch et al., 2002b; Grach\net al., 2004; Gustavson et al., 2005). Notice that Mishin et\nal. (2004) have shown that lower hybrid waves can efficiently\naccelerate electrons during HF heating, although to lesser en-\nergies than Langmuir waves.\nBelow we report new results on the mapping of the iono-\nspheric pumped volume in the oxygen red line (630 nm) ob-\ntained at the SURA heating facility. These experiments were\naimed at studying the MZE for mid-latitude conditions: at\nthe SURA facility the magnetic field elevation angle (71.5◦)\nis less than at EISCAT and HAARP (77.2◦ and 75◦, respec-\ntively), therefore conditions for the MZE must be different at\nthe SURA facility (Gurevich et al., 2005). Some evidence of\nthe MZE at the SURA facility has been obtained by radio-\ntomography from satellites (Tereshchenko et al., 2004). In\nour experiments we have found new evidence of the MZE. In\naddition, we were able to resolve mid-scale magnetic field-\naligned structures in the pumped volume; analyzed east-west\nmotions of the airglow patches; and we observed a north-\nward displacement of the airglow patch with increasing pump\nwave reflection height for vertical pumping. A comparison\nof the optical patch positions along the north-south merid-\nian with ray tracing of the pump wave reveals which elec-\ntrostatic waves were responsible for the electron acceleration\nand therefore for the artificial optical emissions.\n2 Experimental data\nThe experiment was carried out in September 2004 at the\nSURA radio facility near Nizhny Novgorod, Russia (geo-\ngraphical coordinates 56.13◦ N, 46.10◦ E, geomagnetic field\ndeclination and inclination are ≈10.0◦ east and ≈71.5◦,\nrespectively). According to the ionospheric conditions,\non 14 September the SURA facility was operated at fre-\nquencies close to the fourth electron gyroharmonic (5.275–\n5.345 MHz). On the other days of the campaign (15, 17 and\n18 September) SURA was operated at the lowest available\nfrequency of transmitters, f0=4.3 MHz. At this frequency\nthe effective radiated power is ≈150 MW. The HF beam\nwidth at the Sura facility is ≈12◦ when pointing in the verti-\ncal direction and by about 1–2◦ wider for beam dip angles of\n12◦ and 16◦, which were used in the experiment. A square\nwave pump modulation of 2 min on, 2 min off, with a period\nclose to the radiative lifetime of O(1D) (107 s), was used.\nOptical imaging was performed using a Peltier-cooled\nfront-illuminated bare CCD camera with 16-bit slow-scan\nread-out (SBIG ST9E). In addition to cooling, the images\nwere binned down to 256×256 pixels, in order to increase\nsensitivity and reduce noise. A f=50 mm F0.7 lens, giving\na ≈13◦ field of view was used. Using the stars, the cam-\nera look direction was adjusted to be parallel to the pump\nbeam. The relatively small field of view gives a spatial\nresolution of ≈0.5 km in the F-layer, suitable for imaging\nsmall-scale structures. For the entire campaign, a 630-nm\nfilter was used with 27-s integration and 3-s housekeeping\ntime, giving a 30-s cycle. Calibration of the images into\nRayleighs was performed by using the same imager to view\nthe reflected output of a known lamp. Optical observations\nof the HF pumped ionosphere were accompanied by record-\ning the spectra of the Stimulated Electromagnetic Emissions\n(SEE), a secondary radiation from the ionospheric pumped\nvolume (Leyser, 2001), with a HP3585 spectrum analyzer.\nAn ionosonde co-located with SURA made soundings every\n10 min. However, some of the ionograms obtained during\nSURA operations could not be analyzed because of strong\nanomalous absorption of the ionosonde signal during HF\npumping.\nOn 14 and 15 September the HF beam was pointed in the\nvertical direction. On 14 September the pump frequency\nchanged every 4 min (from cycle to cycle) by 10 kHz near\nAnn. Geophys., 25, 689–700, 2007 www.ann-geophys.net\/25\/689\/2007\/\nS. M. Grach et al.: On the location and structure... 691\n4th electron gyroharmonic. As estimated by the Broad Up-\nshifted Maximum feature’s position in the SEE spectra (for\ndetails see, e.g. Leyser, 2001), the interaction between the\npump wave and plasma occurred near 260–270 km altitude.\nWeak red line airglow with a maximum intensity of ∼5 R\nagainst a decreasing background was obtained around 21:21–\n21:45 LT. Neither the structure of the images nor the average\nairglow intensity showed a clear dependence on the pump\nwave frequency.\nOn 15 September the experiment lasted from 21:10 LT\ntill 23:24 LT with the pump wave frequency fixed at\nf0=4.3 MHz. The data are presented in Figs. 1–3. Figure 1\n(top panel) shows the time sequence of 630-nm airglow in-\ntensity, spatially averaged over the imager field of view, in\nRayleighs. The data have been background subtracted; the\nintensity is measured relative to a minimum background in-\ntensity obtained at 23:02 LT. The square wave represents the\nHF pump wave on\/off cycles. A decrease in the background\nbrightness for 21:10–23:00 LT is due to decreasing sunlight\nafter sunset.\nThe lower panel of Fig. 1 shows the real reflection height\nof the HF pump wave, derived from ionograms vs. time. It\nshould be noted that the accuracy of such a derivation is quite\nlow due to strong natural F-spread. For the ionogram analysis\nwe used the lower border of the reflected ionosonde signal,\nthe upper border would have given altitudes by about 30 km\nhigher. However, the presence of the reflected HF pump\nwave signal (f0<fO F2) corresponded to critical frequencies\nfO F2 derived from the lower border. The presence of strong\nF-spread provides evidence for the existence of strong, large-\nscale irregularities of plasma density in the upper ionosphere.\nA correlation between pump wave on\/off time and air-\nglow intensity increase\/decrease is clearly seen in the upper\npanel of Fig. 1 during the interval 21:10–23:10 LT. The air-\nglow intensity grows during each “pump on” interval (2 min),\ndecreases during the “pump-off” intervals, somewhat faster\nduring the first minute of no pumping. During the inter-\nval 21:10–21:25 LT, the average intensity of artificial air-\nglow was ∼15 R above the background. Later, during the\ninterval 21:30–21:40 LT, it increased up to 25 R, then notice-\nably decreased (up to ∼10 R) after 21:44 LT, and further de-\ncreased down to ∼5 R after 22:12 LT. The reason for the in-\ntensity minimum at 22:20–22:24 LT is discussed later. After\n23:08 LT the artificial airglow disappeared, together with a\ndramatic decrease in the SEE intensity, despite that the iono-\nspheric plasma was still overdense according to ionograms,\nand the reflection of the pump wave was still observed.\nA set of false color airglow patch images during one pump\ncycle (21:26:00–21:30:00 LT) is presented in Fig. 2. The end\ntime of each 27-s integration is shown in the images. North\nand east are at the bottom and right of each image, respec-\ntively. The white circle corresponds to the straight-line pro-\njection of the 12◦ wide HF pump beam onto the sky, the black\narrow shows the direction of the geomagnetic field projection\nonto the image (inclination ≈10◦ east). When processing\n0\n15\n30\n45\nR\nay\nle\nig\nhs\n21:20 21:40 22:00 22:20 22:40 23:00 23:20\n260\n280\n300\n320\n340\nLT\nR\nef\nle\nct\nio\nn \nal\ntit\nud\ne,\n k\nm\nFigure 1 for the paper by Grach et al. “On the location and structure…”\nFig. 1. The average intensity of the 630-nm airglow above the back-\nground (top panel). The bars show the pump wave on\/off cycle. The\nbottom panel shows the reflection altitudes of the O-polarized pump\nwave at 4.3 MHz vs. time during the experiment as determined from\nthe ionograms.\nthe images, we removed bright stars with a 7×7 median fil-\nter, subtracted a dark image (with the end time 21:25:55 LT,\njust before pump turn on) and performed a running averag-\ning over 11 pixels, both in the vertical and horizontal direc-\ntions to remove pixel noise. The maximum airglow intensity\nduring this cycle was obtained before the pump switched off\n(21:27:55 LT) and achieved 42 R (maximum without averag-\ning pixels = 58 R). The airglow patch started to appear as a\ndouble patch: the brighter western portion appeared at the\nnorthern edge of the HF beam and expanded later mainly\nto the south towards the the beam center, along the mag-\nnetic field line. The eastern part of the patch appears near\nthe center of the HF beam in the south-north direction and\nlater expands without any displacement. Later, both parts of\nthe patch overlap, which leads to an apparent southwestward\nexpansion of the whole patch. During the pump-off phase\nthe patch does not exhibit any noticeable displacement as it\nfades. Such a southward spread along the magnetic field,\nbut without a double patch structure and therefore apparent\nsouthwestward expansion, was observed only during 4 pump\ncycles corresponding to a large brightness at the center of the\npatch &37–50 R (21:26–21:40 LT). In other pump cycles the\nposition of the patches did not vary visibly.\nOn the other hand, perceptible displacements of the op-\ntical patch position over the sequence of images through\ntime were observed. This is illustrated by Fig. 3, which\nshows a sequence of images obtained during the last 27 s\nof each pump-on cycle. Here the same image processing\nwas performed, but the dark images come from integration\ntimes just before the corresponding “on” intervals. During\n21:10–21:20 LT the patch occupied the central part of the HF\nbeam projection onto the image. Later, at 21:26–21:40 LT,\nwww.ann-geophys.net\/25\/689\/2007\/ Ann. Geophys., 25, 689–700, 2007\n692 S. M. Grach et al.: On the location and structure...\nFigure 2 for the paper by Grach et al. “On the location and structure…”\nFig. 2. A sequence of images showing the development and decay of the 630-nm artificial airglow patch during one HF pumping cycle\nobtained at 21:26–21:30 LT on 15 September 2004. The integration time is 27 s, the end time of the integration is shown in the panels. The\nimages are background subtracted and calibrated into Rayleighs. The background image was recorded at 21:25:55 LT. North and east are at\nthe bottom and right of each image. The white circle is a mapping of the 12◦ wide HF pump beam. The black arrows show the direction of\nthe geomagnetic field projection.\nsimultaneously with an increase of the airglow brightness\n(Fig. 1), the patch displaces to the north, and the maxi-\nmum brightness was observed at ≈5◦ from the center of\nthe HF beam. At the same time the patch displaced to the\neast by approximately 1◦ every 4 min, which corresponds\nto a horizontal velocity of ≈20 m\/s at an altitude of 280–\n300 km. At 21:46–22:06 LT, when the 630-nm airglow in-\ntensity decreases, the northward displacement decreased by\n≈1◦, and the patch did not move noticeably. During this\ntime, some optical structures approximately parallel to geo-\nmagnetic field projection are seen in the images. Such struc-\ntures are seen also from time to time in the earlier and later\nimages (e.g. images from 21:23:55 LT and 21:55:55 LT in\nFig. 2). During 22:10–22:20 LT, the airglow patch displaced\nto the north by ≈4◦, the brightest area displaced from 3–4◦\nto 7–8◦ to the north from the center of the HF beam pro-\njection concurrent with westward drifting of the patch. The\nbehavior of subsequent airglow patches looks like successive\neast-west drifting of 2 blobs, in which the 630-nm airglow\nis excited by the HF pump, with the same angular velocity\nof 0.63◦ per 4 min (linear velocity ≈13 m\/s at 280–300 km),\nbut with different positions in the south-north direction. The\nfirst patch with the brightest area at &7–8◦ to the north from\nthe beam center existed at 22:22–22:36 LT; the second patch\nat ≈4–6◦ to the north existed from 22:42 till 23:08 LT. Later,\nthe artificial 630-nm airglow was not excited. This is con-\nsistent with a successive motion of the airglow clouds across\nthe ionospheric heated volume reported by Bernhardt et al.\n(2000).\nThree points are noted. First, a noticeable decrease in\nthe average artificial airglow intensity in Fig. 1 at 22:22–\n22:30 LT is due to the fact that about a half of the air-\nglow patch is outside the imager field of view. Second,\nthe median filter removed only the brightest stars, but the\nweaker ones, appearing about 5–10 R brighter than the back-\nground, remain in the images (see images taken from 22:23\ntill 23:08 LT). It is seen from these images that the artifi-\ncial airglow patches drift across the imager field of view with\nthe same apparent velocity (0.63◦ per 4 min) as the stars.\nSuch westward drift also can be seen at 21:10–21:20 and\n21:54–22:20 LT, respectively. Third, in some images (e.g.\n21:23:55 LT) two connected airglow patches can be seen.\nThis becomes clear when comparing the images with pre-\nvious\/subsequent images.\nThe SEE spectra recorded were typical for f0=4.3 MHz,\nthe frequency being situated well between the 3rd and\n4th electron cyclotron harmonics and contained prominent\nDownshifted Maximum, Broad Continuum, and Broad Up-\nshifted Structure spectral features (Frolov et al., 2001;\nSergeev et al., 2006). Such type of the SEE spectra are classi-\nfied as a “strong emission” (Sergeev et al., 2006) and charac-\nterize well developed upper hybrid turbulence. The intensity\nof all features decreased slightly with time till 23:08 LT, af-\nter which the intensity rapidly dropped. No clear correlation\nbetween the SEE and airglow brightness or patch positions\nwas obtained.\nOn 17 and 18 September the HF pump beam was inclined\nto the south of vertical. Unfortunately, the time and quality of\nthe optical measurements were limited by clouds and lasted\nonly 20 min on both nights. Even during these intervals the\nsky was covered by a thin cloud layer. The best images ob-\ntained are presented in Fig. 4. On 18 September, when the\npump beam zenith angle was 16◦, the 630-nm airglow patch\nwith a brightness .20 R was located in the center of the HF\nbeam. On 17 September, the HF beam was pointed 12◦ south\nfrom vertical. In this case, the airglow patch with a brightness\nAnn. Geophys., 25, 689–700, 2007 www.ann-geophys.net\/25\/689\/2007\/\nS. M. Grach et al.: On the location and structure... 693\nFig. 3. A collection of images of artificial airglow patches obtained on 15 September 2005. Each panel corresponds to the integration over\nthe last 27 s of a 2-min “pump-on” cycle. The end times of each integration (+5 s) are shown in the panels. The calibration, white circles\nand arrows are the same as in Fig. 2. North and east are at the bottom and right of each image.\nwww.ann-geophys.net\/25\/689\/2007\/ Ann. Geophys., 25, 689–700, 2007\n694 S. M. Grach et al.: On the location and structure...\nFigure 4 for the paper by Grach et al. “On the location and structure…”\nFig. 4. Images of artificial airglow obtained on 17 September 2004, for an HF beam zenith angle of 12◦ S (left panel) and on 18 September\n2004, for an HF beam zenith angle of 16◦ S (right panel). North and east are at the bottom and right of each image.\n∼20 R was clearly shifted to th south from the straight-line\nprojection of the pump beam by &4◦. For this experiment,\nit is impossible to determine an angular size and position of\nthe southern boundary of the airglow patch, since it extends\nbeyond the imager field of view.\n3 Discussion\nDuring 14–18 September 2004 we ran a campaign to study\nthe artificial airglow at 630 nm (the radiation of level O(1D)\nof the atomic oxygen). The airglow appears due to electron\nacceleration by pump-driven plasma waves and excitation of\nthe neutrals by collisions with the accelerated electrons. The\nexperimental data obtained contributes to the knowledge of\nthe behavior of the pumped volume in the ionosphere. The\noptical data provides spatial resolution beyond anything a\nradar can achieve.\n3.1 Variations of the airglow intensity\nThe airglow intensity and angular size of the airglow patch\nvaried during the 2.5 h of experiments on 15 September over\nrather wide limits: from 5 to 25 R averaged across the im-\nager’s field of view, and from 15 to 50 R maximum brightness\nin the center of the patch. Similar values of the intensity were\nobserved at the SURA facility in 1993 and 1995 by Bern-\nhardt et al. (2000). In the earlier experiments of 1990 during\nsolar maximum, intensities up to &200 R were observed. In-\ntensities of similar order (20–100 R) have been observed at\nthe Arecibo, EISCAT and HAARP facilities (e.g. Bernhardt\net al., 1989a,b; Kosch et al., 2002a; Pedersen and Carlson,\n2001). The variations of the brightness do not show any clear\ncorrelation with pump power (for the cases where the power\nexceeds the threshold power for airglow excitation) or with\nthe pump wave freque cy, except for the cases of pumping\nnear multiple electron gyrofrequencies, f0∼nfce, n=2, 3, 4,\netc. In the latter case a decrease in the brightness was ob-\ntained for n=3, 4 (Bernhardt et al., 2000; Kosch et al., 2002b)\nand an increase for n=2 (Kosch et al., 2005). In our ex-\nperiments near the 4th gyroharmonic on 14 September only\nvery weak airglow was obtained. On 15 September a no-\nticeable growth of the brightness (from ∼30 R to ∼50 R) oc-\ncurred, together with an increase in the reflection altitude at\n≈21:30 LT, but later (at about 21:45 LT and about 22:10 LT)\nreductions in the brightness does not seem to coincide with\nany other phenomena. The variations of the airglow intensity\ncan be influenced by changes in the background population\nof suprathermal electrons with energies of 0.5−1 eV. Ac-\ncording to theoretical studies by Grach et al. (1986); Grach\n(1999) the efficiency of acceleration strongly depends on the\npresence and “initial” background of such electrons. This\ncomes about because pump-driven plasma waves do not ac-\ncelerate thermal electrons effectively. The population of the\n“initial” suprathermal electrons in the HF-pumped volume\nof the ionosphere is quite numerous during the daytime but\ndecreases dramatically at nighttime (see, e.g. Sergeev et al.,\n2004) when optical observations become possible.\nGrach et al. (1998) reported that under near-identical iono-\nspheric background conditions (close to local midnight, al-\ntitude, critical frequency and scale length of the F-region),\nand the same pump frequency and power, opposite results\nwere obtained by multi-frequency Doppler sounding of the\npumped volume, while on 30 June 1989 a well-defined de-\npletion of ionospheric plasma from the pump wave upper\nhybrid altitude was observed near midnight and attributed to\nthe plasma heating; an increase in the plasma density related\nto additional ionization by accelerated electrons occurred on\n28–29 August 1990. A weak enhancement of geomagnetic\nAnn. Geophys., 25, 689–700, 2007 www.ann-geophys.net\/25\/689\/2007\/\nS. M. Grach et al.: On the location and structure... 695\nactivity two days before the latter case was the only differ-\nence found. This difference arguably may have contributed\nto an enhanced background of suprathermal electrons.\nIn addition, geomagnetic activity reduces the O\/N2 neu-\ntral composition in the F-layer through Joule heating. Varia-\ntions in the O\/N2 ratio up to an order of magnitude are pos-\nsible (Strickland et al., 2001). The vibrational states of N2\nare strong absorbers of pump-accelerated electrons (Mishin\net al., 2000; Vlasov et al., 2004), but results in no N2 optical\nemissions. Hence, any significant geomagnetic activity up to\na couple of days prior to an artificial airglow experiment sig-\nnificantly reduces the possibility of producing pump-induced\noptical emissions. The small airglow intensity on 14 Septem-\nber is possibly due to this effect under the prevailing geo-\nphysical conditions (Kp=5+). On 15, 17 and 18 September\ngeophysical conditions were much quieter, namely Kp=2, 3\nand 0, respectively, and the artificial airglow intensity was\ncorrespondingly higher.\nWe suppose that the variations of airglow intensity on\n15 September appear to be due to small variations of the\nsuprathermal electron density background, which are very\ndifficult to investigate.\n3.2 Regular northward displacement of the airglow patch\nAs was pointed in Sect. 2, a regular displacement of the 630-\nnm airglow patch to the north by several degrees from the\ncenter from the pump beam straight-line projection was ob-\nserved whilst pumping into the local zenith on 15 September\n2004. The displacement appeared during the fourth pump\ncycle (21:22–21:26 LT), when the western part of the double-\npatch was shifted by ≈5◦ to the north, and existed during all\nsubsequent cycles. The displacement appeared simultane-\nously with an increase in the pump wave reflection altitude\nfrom 260 km to 280–300 km. The magnitude of the displace-\nment was ≈3–5◦ during 21:28–22:16 LT, then increased to\n≈7–8◦, again simultanously with an increase in the reflec-\ntion altitude up to∼340 km, then decreased to 4–5◦, together\nwith a decrease in the reflection altitude down to 310 km.\nTwo possible explanations appear likely. First, the north-\nward shift of the heated volume may be due to refraction of\nthe O-polarized HF beam according to its group propagation\npath. Second, precipitation of accelerated electrons along\nthe geomagnetic field from a higher situated acceleration re-\ngion to lower altitudes where excitation of the O(1D) level is\nmore effective due to the larger density of atomic oxygen. In\nthis case the northward inclination of the geomagnetic field\nwould provide the patch displacement.\nTo examine these possibilities, we performed a ray tracing\nfor the prevailing ionospheric conditions obtained from iono-\ngrams during the experiment, and compared it to the optical\npatch positions. We note again that the accuracy of the iono-\ngram inversion is low due to strong natural F-spread. The\nresults of the raytracing in the magnetic meridian plane are\npresented in Figs. 5a, b. The solid lines show the paths of\nthe central ray and edge rays (±6◦ from the center) of the\nHF pump beam in the magnetic meridian plane, calculated\nunder the assumption of a horizontally uniform ionosphere,\nfor ionograms obtained at 21:09 LT (panel a) and 22:49 LT\n(panel b), respectively. Note that there was a systematic shift\nin the SURA antenna pattern to the south by ≈2◦ for tech-\nnical reasons (Yu. V. Tokarev and A. N. Karashtin, private\ncommunication). The dotted lines show the straight-line pro-\njection of the HF beam onto the sky, the dashed lines corre-\nspond to the imager field of view, horizontal lines show the\nHF beam reflection altitude zr, where fpe(zr)=f0, the up-\nper hybrid altitude zUH, where fpe(zUH)=[f 20 −f 2ce(zUH)]1\/2,\nand the arrows show the geomagnetic field direction. The\nschematic blobs in the panels correspond to the airglow\npatches obtained at 21:11:55 LT (panel a) and 22:47:55 LT\n(panel b), respectively. When drawing the airglow blobs\nwe assumed an altitude range of 225–275 km. The airglow\nblob position in the south-north direction are shown in ac-\ncordance with the images, and include the area where the\nairglow brightness exceeds the average. In panel (a), where\nzr≈260 km, the patch is situated approximately in the cen-\nter of the HF beam at the upper hybrid resonance altitude.\nAt the reflection altitude, the center of the patch is shifted\nby ≈10 km (2◦) to the south from the central ray due to re-\nfraction of the beam near reflection. The deviation is small\n(almost straight-line propagation) on the southern edge of\nthe beam; it is ≈10 km in the central part and ≈20 km on\nthe northern edge of the beam at the reflection altitude. In\npanel (b), where the ionospheric reflection altitude is much\nhigher, the deviation increases by ≈2 times. The projection\nof the optical patch onto the reflection altitude zr is slightly\n(by ≈6 km or 1◦) shifted to the north from the HF beam\ncentral ray, while the northward shift at zUH is much larger,\ni.e. ≈20 km or 4◦. At first glance this shows that the wave-\nplasma processes occur near the reflection point, namely ex-\ncitation of Langmuir waves or cavitons under parametric de-\ncay or oscillating two-stream instability (DuBois et al., 1990)\nprovide sufficient acceleration of electrons (Gurevich et al.,\n1985), which excites the oxygen atoms in the immediate\nvicinity.\nHowever, it is now commonly accepted that the optical\nemission source has a maximum at altitudes below zr, zUH,\nthe altitude of the plasma wave excitation and, therefore,\nelectron acceleration, when zr, zUH&270–300 km. Model\ncalculations for the Arecibo heating facility (geographical\ncoordinates 18.48◦ N, 66.67◦ W, geomagnetic field inclina-\ntion 49◦) by Bernhardt et al. (1989a), performed for the\nsource altitude of suprathermal electrons from 300 to 400 km\nfound that the red line airglow should come from the 270-\nto 280-km altitude, while for a source at 250 km the ac-\ncelerated electrons produce the excited states of the neu-\ntral atomic oxygen locally. Using multi-station observations,\nGustavson et al. (2001) found the maximum optical emis-\nsion to be 5–25 km below the pump wave reflection altitude.\nwww.ann-geophys.net\/25\/689\/2007\/ Ann. Geophys., 25, 689–700, 2007\n696 S. M. Grach et al.: On the location and structure...\nMid-latitude altitude estimates by triangulation Haslett and\nMegill (1974) show that the optical emission was limited\nin height to 280±15 km, although the pump wave reflection\nheight could be up to 30 km higher. Kosch et al. (2002a)\nestimated the altitude of the airglow generation to be &200–\n220 km, while the reflection and upper hybrid altitudes were\n30–50 km higher. Using this information, we place schemat-\nically the airglow blob at 225–270 km altitude. Additional\narguments for the placement of the blob below the interac-\ntion region are stated in Sects. 3.3 and 3.4. The downward\nshift of the optical emission source from the pump-plasma in-\nteraction altitude (either reflection or upper hybrid altitudes)\nis conditioned by precipitation of the accelerated electrons\nalong the geomagnetic field to lower altitudes with a higher\ndensity of atomic oxygen.\nIf we project the optical blob along the geomagnetic field\nline in panel (b) of Fig. 5, it will coincide approximately\nwith the central part of the HF beam at the upper hybrid res-\nonance altitude zUH. On the other hand, a magnetic field-\naligned projection of the central part of the HF beam, which\nintersects with the reflection level, down to the altitude of\nthe schematic blob, will be shifted by 10–40 km (2–10◦) fur-\nther to the north from the center of the visible patch position.\nThe same is true qualitatively for other pump cycles with a\nnorthward displacement of the patch. Therefore, if we as-\nsume the airglow to be generated mainly at the 240–270 km\naltitude, we can conclude that electron acceleration occurs\nmainly near zUH, the upper hybrid resonance of the pump\nwave. For the ionogram inversion we used the lower bound-\nary of the ionogram trace. This gives the least northward de-\nviation of the ray group path. Any other choice of the trace\ngives larger ray deviation, a larger northward shift of the re-\nflection point and, therefore, a larger northward shift of the\nairglow patch, if we assume that electrons precipitate from\nthe reflection altitude. Similar joint analysis of ray tracing\nand the closest images for other pump cycles led to the same\nconclusion. Finally, the SEE temporal evolution and station-\nary spectra measured during the experiment were typical for\nones related to upper hybrid turbulence (Sergeev et al., 1999,\n2006).\nA northward elongation and northward displacement of\nthe airglow patch center by ≈30 km from the source of the\naccelerated electrons was observed at the Arecibo facility\nand attributed to an acceleration region from a higher alti-\ntude (Bernhardt et al., 1989b). The magnetic field inclination\nangle is larger at the SURA facility (71.5◦) than at Arecibo\n(49◦). This will give larger displacements at Arecibo, than at\nSURA, while our experiments show similar values. This im-\nplies that the vertical displacement is less at Arecibo than\nSURA. A northward displacement of the airglow patch at\nmid-latitudes was noted by Adeishvili et al. (1978). How-\never, they did not present any detailed analysis of the data\nand attributed the displacements to the group propagation of\nthe pump wave (our first option), which is hardly correct, ac-\ncording to our consideration.\n3.3 Temporal evolution of the airglow patches\nThe positions of the optical patches did not vary spatially,\nneither during the growth (“pump-on”) nor during the decay\n(“pump-off”) phases for the majority of the pump cycles (30\nout of 34 in total). However, during 4 cycles, from 21:26 LT\nto 21:40 LT, with the largest brightness in the center of the\npatch (Figs. 1, 3), the airglow patch started to appear at the\nnorthern edge of the HF beam and subsequently expanded\nmainly to the south, towards the center of the beam (see\nFig. 2). This phenomenon can be attributed to deeper pen-\netration of the precipitating suprathermal electrons to lower\natmosphere layers, down to 220–230 km. Indeed, a station-\nary distribution of the suprathermal electrons through all al-\ntitudes below the source (z∼225−300 km) must be formed\nduring the time τ∼1\/δ(ε)ν(ε)∼10–15 s after the pump is\nswitched on (Gurevich et al., 1985). Here δ(ε) is the part\nof the electron energy lost by one collision, ν(ε) is the elec-\ntron collision frequency, and ε is the electron energy. Ac-\ncording to Sergeev et al. (1999), the characteristic time of\nthe source (i.e. accelerating HF plasma waves) development\nis faster than τ for the pump cycle used, but the image ex-\nposure time used is longer than τ . Therefore, already during\nthe first image after the pump is switched on, the airglow\ngeneration should occur under a stationary distribution of\nsuprathermal electrons. The larger (by 10–30 R) brightness\nobtained during these 4 cycles definitely indicates the pres-\nence of a larger density of suprathermal electrons in these\ncycles. Since the northward displacement is attributed to the\ndownward precipitation of the fast electrons from the source\nalong the geomagnetic field line, the appearance of the patch\nin the first image at ≈5–6◦ from the center of the HF beam\n(upper left panel of Fig. 2), and by ≈2–3◦ after 2 min of\npumping, means that the airglow registered in the first image\nshould occur 10–20 km below that in the central part of the\nlast image during the “pump-on” cycle. According to Gus-\ntavson et al. (2001), Fig. 8, the lifetime of the excited O(1D)\n(including quenching by molecular oxygen O2 and nitrogen\n(N2), ambient electrons and atomic oxygen (O)) is about 30 s\nat ∼ 220–230 km altitude, increasing with the altitude. This\nmeans that the airglow should appear faster at lower alti-\ntudes, (i.e. further to the north), while later, when approach-\ning the steady state, the maximum brightness should cor-\nrespond to the maximum density of the excited O(1D), i.e.\nhigher altitudes (250–270 km) and, therefore, smaller north-\nward displacements. During the relaxation phase (“pump\noff” time), the brightness should decrease, together with the\nmaximum density of the excited O(1D), i.e. at the same al-\ntitudes ∼(250–270) km, and, therefore, without any visible\ndisplacement of the patch. During the cycles with smaller\nbrightness, the density of the accelerated suprathermal elec-\ntrons at the low altitudes∼220–230 km is, most probably, not\nsufficient to produce any visible effect for the camera used in\nour experiment. This issue can be better resolved by using\nan imager capable of higher temporal resolution.\nAnn. Geophys., 25, 689–700, 2007 www.ann-geophys.net\/25\/689\/2007\/\nS. M. Grach et al.: On the location and structure... 697\nFigure 5 for the paper by Grach et al. “On the location and structure…”\n(a) (b)\nFig. 5. Ray tracing for the pump wave with f0=4.3 MHz in the magnetic meridian plane for ionograms, obtained at 21:09 LT (a) and 22:48\n(b). Dashed and dotted lines show the imager field of view and the pump beam borders, respectively. Magnetic field direction is shown\nby arrows, schematic blobs in the panels correspond to the airglow patches obtained at 21:11:55 LT (panel a) and 22:47:55 LT (panel b),\nrespectively.\n3.4 Mid-scale field-aligned structures in the patches\nIn some images in Fig. 3, structures approximately parallel\nto the geomagnetic field line projection are seen. They look\nlike 0.2–1◦ wide strips, 10–20% brighter than neighbouring\nareas with an angular length of about 3–4◦ along the mag-\nnetic field projection onto the horizontal plane, and can be\nseen ∼1.5 min after “pump on” until ∼1 min after “pump\noff” (see Fig. 2). Similar structures were observed in optical\nobservations by Djuth et al. (2005) at HAARP and Sentman\n(private communications) at HIPAS. The field-aligned opti-\ncal enhancements exist due to the enhanced density of the\nO(1D), and therefore inhomogeneities also exist in the spatial\ndistribution of suprathermal electrons. According to our data,\nthe scales of the inhomogeneities across and along the geo-\nmagnetic field can be estimated as l⊥∼[z\/ tan(0.2–1)◦]∼1–\n10 km and l‖∼z\/[tan(3–4)◦ cos(71.5◦)]∼40–50 km, respec-\ntively, where z is the altitude of the airglow generation, and\nthe angle 71.5◦ corresponds to the geomagnetic field decli-\nnation. According to Vas’kov and Gurevich (1979); Gure-\nvich et al. (2005), inhomogeneities (depletions) of plasma\ndensity with such “mid-range” scale sizes1 appear due to\nself-focusing of the pump wave: the HF waves focus inside\nthe depletions, giving an increase in the pump wave power\ndensity and an enhanced level of the HF plasma waves, en-\nhanced plasma heating, and, therefore, further plasma expul-\nsion from the depletions, etc. The depletions are stretched\nsince plasma diffusion and thermal conductivity across the\nmagnetic field are strongly suppressed. In view of the above,\nmore effective electron acceleration, as well as precipitation\nof the energetic electrons along the geomagnetic field line,\nshould also occur inside the depletions.\n1\n“Small-scale” irregularities, or striations, usually mean\nstretched depletions with l⊥∼0.5–50 m.\n3.5 East-west variations of the patch positions\nLarge-scale irregularities (l⊥&10 km) of both natural and\nheater-induced origin should also provide focusing of the HF\nwaves in the underdense plasma and guide the HF beam.\nHence, the airglow patches follow the motion of the large-\nscale irregularities. By using airglow images we can follow\nthe development of such large-scale structures and the inter-\nnal motions of the irregularities in the pumped volume of the\nionosphere (Bernhardt et al., 1989a,b).\nThe reasons for the regular northward displacement of the\nairglow patches and southward expansion of the patches dur-\ning pumping were discussed above. The east-west motion\nof the airglow patches have been discussed in several papers\n(Bernhardt et al., 1989a,b, 2000; Kosch et al., 2000, 2002a).\nAccording to Bernhardt et al. (1989a), the typical plasma\nvelocities obtained from both radar and optical observations\nabove the Arecibo heating facility, in January and February\nof 1987, were westward with speeds of about 20 m\/s. Usu-\nally the zonal plasma drift did not vary more than ±30 m\/s\nabout this value. At the Arecibo facility the star background\nmoves westward with a speed of 20 m\/s due to the Earth’s\nrotation. In some observations, however, an eastward drift\nwith speeds up to 60 m\/s were obtained. Bernhardt et al.\n(2000) reported the eastward drift of the airglow patches ob-\ntained on 21 March 1993 above the SURA facility with a lin-\near velocity∼70 m\/s, increasing up to 120 m\/s during 2 min.\nUnfortunately, data on drift velocities during other phases of\nthe experiment were not shown in Bernhardt et al. (2000).\nKosch et al. (2000, 2002a) found no zonal drift motion of the\nairglow patches above the EISCAT heater. On 15 Septem-\nber 2004, during several time intervals, namely 21:10–21:20,\n21:54–22:20, 22:22–22:36 and 22:42–23:08 LT, the position\nof the airglow patches drift to the west with the angular ve-\nlocity of ≈0.63◦ per 4 min (linear velocity ≈13 m\/s at 280–\n300 km), i.e. together with star motion across the imager field\nof view due to the Earth’s rotation. During 22:10–22:20 LT\nwww.ann-geophys.net\/25\/689\/2007\/ Ann. Geophys., 25, 689–700, 2007\n698 S. M. Grach et al.: On the location and structure...\nthe westward drift was accompanied by a northward dis-\nplacement. On the contrary, during 21:26–21:40 LT, an east-\nward displacement of the patches by ≈1◦ every 4 min was\nobserved (between successive “pump on” cycles), which cor-\nresponds to a linear velocity of≈20 m\/s. However, east-west\ndisplacements were not observed for all 2-min “pump-on”\ntimes. As a result, we can state that in most cases the large-\nscale plasma structures (in which airglow patches are excited\nduring the pumping cycles) exhibit westward drift, with the\nsame speed as the celestial sphere (star background). This\ncan be easily understood if the large-scale structures do not\nrotate together with the Earth.\n3.6 Inclined pumping\nOur experiments with the HF beam inclined to the south were\naimed to check for the presence of the magnetic zenith effect,\nobtained at the HAARP and EISCAT facilities (Kosch et al.,\n2000; Gurevich et al., 2002; Pedersen et al., 2003; Rietveld\net al., 2003), at lower latitudes under SURA facility condi-\ntions. The amount of data obtained was limited by the clouds.\nFor the successful pump cycles, for both zenith angles of the\nHF beam (12◦ and 16◦, +2◦ southward systematic techni-\ncal shift) the maximum brightness within the airglow patches\nwas observed at the same angle, namely 18◦–19◦ south of\nvertical, i.e. practically straight along the magnetic field line\ndirection. Ray tracing performed for the ionograms obtained\non 17 September shows that the central ray of the HF beam\nis displaced to the south, compared to the straight projection,\nby ∼1◦ at the upper hybrid resonance altitude, and by ∼2◦\nat the maximum altitude of the ray path, i.e. less than the\ndisplacement of the patch’s brightest area. Unfortunately, it\nwas impossible to perform ray tracing for 18 September due\nto strong natural F-spread. To estimate the position of the\npatch and the HF beam path, we used the ionograms from\n17 September. The patch’s brightest area appeared slightly\nshifted to the north in comparison to the central ray cross-\ning the upper hybrid resonance altitude. Detailed study of\nthe airglow patch structure for the inclined pumping requires\nfurther experiments. The appearance of large-scale struc-\ntures in the magnetic field line direction was obtained by\nTereshchenko et al. (2004), using satellite tomography meth-\nods which they claimed to be consistent with the theory of\nthe magnetic zenith effect (Gurevich et al., 2002, 2005).\n4 Conclusions\nObservations of the HF-induced 630-nm airglow performed\nat the SURA facility in September 2004 have shown the fol-\nlowing.\n1. A northward displacement of the airglow patch occurs,\nincreasing with the increase of the pump wave reflection\naltitude. The position of the patch can be explained con-\nsistently, if we assume that the electrons, responsible for\nthe O(1D) excitation, are accelerated near the upper hy-\nbrid altitude of the pump wave and then precipitate at\naltitudes of 240–270 km.\n2. For pump cycles with the largest emission brightness\nin the center of the patch, the airglow started to ap-\npear at the northern part of the HF beam and expanded\nlater, mainly to the south, towards the center of the\nbeam. This can be attributed to a deeper penetration of\nthe precipitating suprathermal electrons to lower atmo-\nsphere layers, down to altitudes of 220–230 km, where\nthe lifetime of the excited O(1D) decreases noticeably\n(till about 30 s) in comparison with the radiative life-\ntime.\n3. For some cycles, structures approximately parallel to\nthe geomagnetic field projection, corresponding to inho-\nmogeneities (depletions) of plasma density, with scales\nof 1–10 km across and 40–50 km along the geomagnetic\nfield, are seen in the images.\n4. In most cases, the large-scale plasma structures within\nthe airglow patches (>10 km) exhibited a westward drift\nwith the same speed as the coelosphere (star back-\nground). However, a slightly faster eastward drift\n(∼20 m\/s) occurred during ∼15 min, together with an\nincrease in the reflection altitude.\n5. For 12◦ S and 16◦ S zenith angles of the HF beam, the\nmaximum brightness within the airglow patches was ob-\nserved to be practically straight along the magnetic field\nline, namely 18–19◦ to the south of vertical.\nAcknowledgements. The work was supported by INTAS grant\nno. 03-51-5583, RFBR grants no. 06-02-17334 and 04-02-17544.\nThe authors are grateful to M. Grill for technical support of the op-\ntical equipment and to G. P. Komrakov for support with operating\nSURA facilty.\nTopical Editor M. Pinnock thanks E. Mishin and another referee\nfor their help in evaluating this paper.\nReferences\nAdeishvili, T. G., Gurevich, A. V., Lyakhov, S. B., Managadze, G.\nG., Milikh, G. M., and Shlyuger, I. S.: Ionospheric emission\ncaused by an intense radio wave, Sov. J. Plasma Phys., 4, 721–\n726, 1978.\nAl’ber, Ya. I., Krotova, Z. N., Mityakov, N. A., et al.: Effects of\nstimulated scattering for an electromagnetic pulse incident on a\nplasma layer, Sov. Phys. JETP, 39, 275–277, 1974.\nBasu, S., Costa, E., Livingston, R. C., Groves, K. M., Carlson, H.\nC., Chaturvedi, P. K., and Stubbe, P.: Evolution of subkilome-\nter scale ionospheric irregularities generated by high-power HF\nwaves, J. Geophys. Res., 102, 7469–7476, 1997.\nBernhardt, P. A., Tepley, C. A., and Duncan, L. M.: Airglow En-\nhancements Associated With Plasma Cavities Formed During\nIonospheric Heating Experiments, J. Geophys. Res., 94, 9071–\n9092, 1989a.\nAnn. Geophys., 25, 689–700, 2007 www.ann-geophys.net\/25\/689\/2007\/\nS. M. Grach et al.: On the location and structure... 699\nBernhardt P. A., Duncan, L. M., and Tepley, C. A.: Heater-induced\ncavities as optical tracers of plasma drifts, J. Geophys. Res., 94,\n7003–7010, 1989b.\nBernhardt, P. A., Scales, W. A., Grach, S. M., Karashtin, A. N.,\nKotik, D. S., and Polyakov, S. V.: Excitation of artificial airglow\nby high power radio waves from the “Sura” ionospheric heating\nfacility, Geophys. Res. Lett., 18, 1477–1480, 1991.\nBernhardt, P. A., Wong, M., Huba, J. D., Fejer, B. G., Wagner, L.\nS., Goldstein, J. A., Selcher, C. A., Folov, V. L., and Sergeev, E.\nN.: Optical remote sensing of the thermosphere with HF pumped\nartificial airglow, J. Geophys. Res., 105, 10 657–10 671, 2000.\nCarlson, H. C., Wickwar, V. B., and Mantas, G. P.: Observation of\nfluxes of suprathermal electrons accelerated by HF excited insta-\nbilities, J. Atmos. Terr. Phys., 44, 1089–1100, 1982.\nDimant, Ya. S., Gurevich, A. V., and Zybin, K. P.: Acceleration of\nElectrons in the Ionosphere Under the Action of Intense Radio\nWave Near Electron Cyclotron Harmonics, J. Atmos. Terr. Phys.,\n54, 435–436, 1992.\nDjuth, F. T., Pedersen, T. R., Gerken, E. A., Bernhardt, P. A.,\nSelcher, C. A., Bristow, W. A., and Kosch, M. J.: Ionospheric\nModification at Twice the Electron Cyclotron Frequency, Phys.\nRev. Lett., 94, 125 001, doi:10.1103\/PhysRevLett.91.12501,\n2005.\nDjuth, F. T., Reinisch, B. W., Kitrosser, D. F., Elder, J. H., Lee,\nS. A., and Sales, G. S.: Imaging HF-induced large-scale ir-\nregularities above HAARP, Geophys. Res. Lett., 33, L04107,\ndoi:10.1029\/2005GL024536, 2006.\nDuBois, D. F., Rose, A. H., and Russel, D.: Excitation of strong\nLangmuir turbulence in plasmas near critical density: Aplication\nto HF heating of the ionosphere, J. Geophys. Res., 95, 21 221–\n21 272, 1990.\nFrolov, V. L., Sergeev, E. N., Ermakova, E. N., Komrakov, G. P.,\nand Stubbe, P.: Spectral features of stimulated electromagnetic\nemissions, measured in the 4.3–9.5 MHz pump wave frequency\nrange, Geophys. Res. Lett., 28, 3103–3106, 2001.\nFrolov, V. L., Chugurin, V. V., Komrakov, G. P., Mityakov, N. A.,\nMyasnikov, E. N., Rapoport, V. O., Sergeev, E. N., Uryadov, V.\nP., Vybornov, F. I., Ivanov, V. A., Shumaev, V. V., Nasyrov, A.\nM., Nasyrov, I. A., and Groves, K. M.: Study of large-scale ir-\nregularities generated in the ionospheric F-region by high-power\nHF waves, Izv. vuzov. Radiofizika, 43, no 6, 497–519, 2000 (Ra-\ndiophys. Quantum Electron., Engl. Transl. 43, no. 6, 2000.)\nGrach, S. M., Karashtin, A. N., Mityakov, N. A., Rapoport, V. O.,\nand Trakhtengertz, V. Yu.: Parametric interaction between elec-\ntromagnetic radiation and ionospheric plasma, Radiophys. Quan-\ntum Electron., Engl. Transl., 20, 1254–1259, 1977.\nGrach, S. M., Mityakov, N. A., Rapoport, V. O., and Trakhtengertz,\nV. Yu.: Thermal parametric turbulence in a plasma, Physica, 2D,\n102–106, 1981.\nGrach, S. M.: Electromagnetic radiation from artificial ionospheric\nplasma turbulence, Radiophys. Quantum Electron., 28, 470–477,\n1985.\nGrach, S. M., Mityakov, N. A., and Trakhtengertz, V. Yu., Electron\nacceleration and additional ionization at the parametric plasma\nheating, Fizika plazmy, 12, 693–702, 1986, in Russian, (Sov.\nPlasma Phys., Engl. Transl., 12, no. 6, 1986).\nGrach, S. M., Komrakov, G. P., Shvarts, M. M., and Yurishchev, M.\nA.: On frequency dependence of probe wave abnormal attenu-\nation prohile modifying the ionosphere by powerful radio emis-\nsion, Izv.VUZov – Radiofizika, 41, 966–977, 1998, in Russian\n(Radiophys. Quantum Electron., Engl. Transl., 41, no. 8, 1998).\nGrach, S. M.: On kinetic effects in the ionospheric F-region mod-\nified by powerful radio waves, Radiophys. Quantum Electron.,\nEngl. Transl., 42, 572–588, 1999.\nGrach, S. M., Sergeev, E. N., Nasyrov, A. M., Gumerov, R. I.,\nShaimukhametov, R. R., Nasyrov, I. A., and Komrakov, G. P.:\nSimultaneous observations of the 557.7 nm airglow and stimu-\nlated electromagnetic emission during HF pumping of the iono-\nsphere with diagnostic schedule: first results, Adv. Space Res.,\n34, 2422–2427, 2004.\nGumerov, R. I., Kapkov, V. B., Komrakov, G. P., and Nasyrov,\nA. M.: Artificial ionospheric glow caused by short-term effect\nof highpower RF radiation, Radiophys. Quantum Electron, 42,\n463–465, 1999.\nGurevich, A. V., Dimant, Ya. S., Milikh, G. M., and Vas’kov, V. V.:\nMultiple acceleration of in the region of high-power radio-wave\nreflection in the ionosphere, J. Atmos. Terr. Phys., 47, 1057–\n1070, 1985.\nGurevich, A. V., Zybin, K. P., Carlson, H. C., and Pedersen, T.:\nMagnetic zenith effect in ionospheric modification, Phys. Lett.,\nA305, 264–274, 2002.\nGurevich, A. V., Zybin, K. P., and Carlson, H. C.: Magnetic-Zenith\nEffect, Radiophys. Quantum Electron., Engl. Transl., 48, 686–\n699, 2005.\nGustavsson, B., Sergienko, T., Rietveld, M. T., Honary, F., Steen,\nA˚, Bra¨ndsro¨m, B. U. E., Leyser, T. B., Aruliah, A. L., Aso, T.,\nEjiri, M., and Marple, S.: First Tomographic estimate of volume\ndistribution of HF-pump enhanced airglow emission. J. Geophys.\nRes., 106, 29 105–29 123, 2001.\nGustavson, B., Sergienko. T., Kosch, M. J., Rietveld M. T.,\nBra¨ndsro¨m, B. U. E., Leyser, T. B., Isham B., Gallop, P., Aso, T.,\nEjiri, M., Grydeland, T., Steen, A., LaHoz, C., Kalia, K., Jus-\nsia, J., and Holma, H.: The electron energy distribution during\nHF pumping, a picture painted with all colors, Ann. Geophys.,\n23, 1747–1754, 2005,\nhttp:\/\/www.ann-geophys.net\/23\/1747\/2005\/.\nHaslett, S. C. and Megill, L. R.: A model of enhanced airglow ex-\ncited by RF radiation, Radio Sci., 9, 1005–1020, 1974.\nIstomin, Y. N. and Leyser, T. B.: Parametric interaction of self-\nlocalized upper hybrid states in quantized plasma density irregu-\nlarities, Phys. Plasmas, 5, 921–931, 1998.\nIstomin, Ya. N. and Leyser, T. B.: Electron acceleration by cylin-\ndrical upper hybrid oscillations trapped in density irregularities\nin the ionosphere, Phys. Plasmas, 10, 2962–2970, 2003.\nKelley, M. C., Arce, T. L., Salowey, J., Sulzer, M., Armstrong, W.\nT., Carter, M., and Duncan, L.: Density depletions at the 10-\nm scale induced by the Arecibo heater, J. Geophys. Res., 100,\n17 367–17 376, 1995.\nKosch, M. J., Rietveld, M. T., Hagfors, T., and Leyser, T. B.: High-\nlatitude HF-induced airglow displaced equatorwards of the pump\nbeam, Geophys. Res. Lett., 27, 2817–2820, 2000.\nKosch, M. J., Rietveld, M. T., Yeoman, T. K., Cierpka, K., and\nHagfors, T.: The high-latitude artificial aurora of 21 February\n1999: An analysis, Advances Polar Upper Atmos. Res., 16, 1–\n12, 2002a.\nKosch, M. J., Rietveld, M. T., Kavanagh, A. J., Davis, C.,\nYeoman, T. K., Honary, F., and T. Hagfors: High-latitude\npump induced optical emissions for frequencies coose to\nwww.ann-geophys.net\/25\/689\/2007\/ Ann. Geophys., 25, 689–700, 2007\n700 S. M. Grach et al.: On the location and structure...\nthird electron gyro-harmonic, Geophys. Res. Lett., 29, 2112,\ndoi:10.1029\/2002GL015744, 2002b.\nKosch, M. J., Pedersen, T., Hughes, J., Marshall, R., Gerken, E., Se-\nnior, A., Sentman, D., McCarric, M., and Djuth, F. T.: Artificial\noptical emission at HAARP for pump frequencies near third and\nsecond electron gyro-harmonic, Ann. Geophys., 23, 1585–1592,\n2005,\nhttp:\/\/www.ann-geophys.net\/23\/1585\/2005\/.\nKuo, S., Lee, M., and Kossey, P.: Excitation of oscillating two\nstream instability by upper hybrid pump in ionospheric heat-\ning experiments at Tromsø, Geophys. Res. Lett., 24, 2969–2972,\n1997.\nLeyser, T. B., Gustavsson, B., Bra¨ndstro¨m, B. U., et al.: Simulta-\nneous measurements of high frequency pump-enhanced airglow\nand ionospheric temperatures in auroral latitudes, Adv. Polar Up-\nper Atmos. Res., 14, 1–11, 2000.\nLeyser, T. B.: Stimulated electromagnetic emissions by high fre-\nquency electromagnetic pumping of the ionospheric plasma,\nSpace Sci. Rev., 98, 223–328, 2001.\nMantas, G. P. and Carlson, H. C.: Reinterpretation of the 6300 A air-\nglow enhancements observed in ionosphere heating experiments\nbased on analysis of Plattevile, Colorado data, J. Geophys. Res.,\n101, 195–209, 1996.\nMishin, E. V., Carlson, H. C., and Hagfors, T.: On the electron\ndistribution function in the F region and airglow enhancements\nduring HF modification experiments, Geophys. Res. Lett., 27,\n2857–2860, 2000.\nMishin, E. V., Burke, W. J., and Pedersen, T.: On the onset of\nHF-induced airglow at HAARP. J. Geophys. Res. 109, A02305,\ndoi:10.1029\/2003JA010205, 2004.\nMyasnikov, E. N., Muravjeva, N. V., Sergeev, E. N., Frolov, V. L.,\nNasyrov, A. M., Nasyrov, I. A., Beley, V. S., Koloskov, A. V.,\nYampolsky, Yu. M., and Groves, K. M.: Spatial Spectrum of Ar-\ntificial Ionospheric Irregularities Induced by Powerful HF Ra-\ndiowaves. Radiophys. Quantum Electron, 44, 833–846, 2001.\nPedersen, T. R. and Carlson, H. C.: First observation of HF heater\nproduced airglow at the High Frequency Active Auroral Re-\nsearch Program facility: Thermal excitation and spatial structur-\ning, Radio Sci., 36, 1013–1026, 2001.\nPedersen, T. R., McCarric, M., Gerken, E., Selcher, C., Sentman,\nD., Carlson, H. C., and Gurevich, A. V.: Magnetic zenith en-\nhancement of HF radio-induced airglow production at HAARP,\nGeophys. Res. Lett., 30, doi:10\/1029\/2002GL016096, 2003.\nPerkins, F. W., Oberman, C. R., and Valeo, E. J.: Parametric in-\nstabilities and ionospheric modifications, J. Geophys. Res., 79,\n1478–1483, 1974.\nPerkins, F. W. and Valeo, E. J.: Thermal self-focusing of electro-\nmagnetic waves in plasmas, Phys. Rev. Lett., 32, 1234–1237,\n1974.\nRietveld, M. T., Kosch, M. J., Blagoveshchenskaya, N. F., Ko-\nrnienko, V. A., Leyser T. B., and Yeoman T. K.: Ionospheric elec-\ntron heating, optical emission, and striation induced by poewrful\nHF radi0 waves at high latitudes: Aspect angle dependence, J.\nGeophys. Res., 108, 1141, doi:10.1029\/2002JA009543, 2003.\nRobinson, T. R.: The heating of the high latitude ionosphere by high\npower radio waves, Physics reports, 179, 79–209, 1989.\nSergeev, E. N. Grach, S. M., Komrakov, G. P., Frolov, V. L., Stubbe,\nP., Thide´, B., Leyser, T., and Carozzi, T.: Influence of small-\nscale irregularities on characteristics of the overshoot effect in\nthe temporal evolution of stimulated electromagnetic emission.\nPart I. Development stage, Radiophys. Quantum Electron., Engl.\nTransl., 42, 544–556, 1999.\nSergeev, E. N., Grach, S. M., and Kotov, P. V.: Study of the excita-\ntion conditions and characteristics of ionospheric plasma turbu-\nlence at the development stage of the ponderomotive parametric\ninstability, Radiophys. Quantum Electron, 47, 185–204, 2004.\nSergeev, E. N., Frolov, V. L., Grach, S. M., and Kotov, P.V.:\nOn the morphology of SEE spectral features in a wide pump\nwave frequency range, Adv. Space Res., 38, 2518–2536,\ndoi:10.1016\/j.asr.2005.02.046, 2006.\nStrickland. D. J., Craven, J. D., and Daniell Jr., R. E.: Six days of\nthermosphric-ionospheric weather over the northern hemisphere\nin late September 1981, J. Geophys. Res., A106, 30 291–30 306,\n2001.\nTereshchenko, E. D., Khudukon, B. Z., Gurevich, A. V., Zybin,\nK. P., Frolov, V. L., Myasnikov, E. N., Muravieva, N. V., and\nCarlson, H. C.: Radio tomography and scintillation studies of\nionospheric electron density modification caused by a powerful\nHF-wave and magnetic zenith effect at mid-latitudes, Phys. Lett.,\nA325, 381–388, 2004.\nVas’kov, V. V. and Gurevich, A. V.: Resonance instability of\nsmallscale plasma perturbations, Sov. Phys. J. Exp. Theor. Phys.,\n46, 487–494, 1977.\nVas’kov, V. V. and Gurevich, A. V.: Samofokusirovochnaya i reso-\nnansnaya neustoichvost’ v F-oblasti v ionosfere, in: “Teplovye\nnelinienye effekty v plazme”, 81–138, Gorky, 1979, (in Rus-\nsian) (Self-focusing and resonant instability in the ionospheric F-\nregion, in: “Thermal nonlinear phenomena in a plasma”), 1979.\nVlasov M. N., Kelley M. C., and Gerken, E.: Impact of vibrational\nexcitation on ionoswpheric parameters and artificial airglow dur-\ning HF heating in the F-region, J. Geophys, Res., 109, A093004,\ndoi:10.1029\/2003JA010316, 2004.\nWeinstock, J. and Bezzerides, B.: Theory of electron acceleration\nduring parametric instabilities, Phys. Rev. Lett., 32, 754–748,\n1974.\nAnn. Geophys., 25, 689–700, 2007 www.ann-geophys.net\/25\/689\/2007\/\n"}