{"doi":"10.1128\/AAC.01392-07","coreId":"102490","oai":"oai:epubs.surrey.ac.uk:1952","identifiers":["oai:epubs.surrey.ac.uk:1952","10.1128\/AAC.01392-07"],"title":"Drug-regulated expression of Plasmodium falciparum P-glycoprotein hornologue 1: a putative role for nuclear receptors","authors":["Johnson, DJ","Owen, A","Plant, N","Bray, PG","Ward, SA"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-04-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER SOC MICROBIOLOGY","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1952<\/identifier><datestamp>\n      2017-10-31T14:03:46Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:62696F736369656E6365735F6D65646963696E65:62696F5F6D6F6C6563<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1952\/<\/dc:relation><dc:title>\n        Drug-regulated expression of Plasmodium falciparum P-glycoprotein hornologue 1: a putative role for nuclear receptors<\/dc:title><dc:creator>\n        Johnson, DJ<\/dc:creator><dc:creator>\n        Owen, A<\/dc:creator><dc:creator>\n        Plant, N<\/dc:creator><dc:creator>\n        Bray, PG<\/dc:creator><dc:creator>\n        Ward, SA<\/dc:creator><dc:publisher>\n        AMER SOC MICROBIOLOGY<\/dc:publisher><dc:date>\n        2008-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1952\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Johnson, DJ, Owen, A, Plant, N, Bray, PG and Ward, SA  (2008) Drug-regulated expression of Plasmodium falciparum P-glycoprotein hornologue 1: a putative role for nuclear receptors   ANTIMICROBIAL AGENTS AND CHEMOTHERAPY, 52 (4).  pp. 1438-1445.      <\/dc:identifier><dc:relation>\n        10.1128\/AAC.01392-07<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1952\/","10.1128\/AAC.01392-07"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Page 1 of 26 \nDrug-regulated gene expression of Plasmodium falciparum P-glycoprotein \nhomologue 1: a putative role for nuclear receptors \n \nDavid J. Johnson*, Andrew Owen1, Nick Plant2, Patrick G. Bray and Stephen A. \nWard \n \nMolecular and Biochemical Parasitology, Liverpool School of Tropical Medicine, \nPembroke Place, Liverpool, Merseyside, L3 5QA, UK. 1Department of Pharmacology \nand Therapeutics, 70 Pembroke Place, University of Liverpool, Liverpool, L69 3GF, \nUK. 2Molecular Toxicology Group, School of Biomedical and Molecular Sciences, \nUniversity of Surrey, Guildford, Surrey GU2 7XH, UK. \n \n*To whom correspondence should be addressed: E-mail: david.johnson@liv.ac.uk, \nTel.: +44-151-705-3151; Fax: +44-151-705-3371 \n \n \nRunning Title: Pgh1 expression and CQ-susceptibility \n \nKey Words: Malaria; Phenobarbitone; PfMDR1; Multi-drug resistance; Nuclear \nreceptors; gene expression\nPage 2 of 26 \nABSTRACT \nAcquired resistance to therapeutic agents is a major clinical concern in the \nprevention\/treatment of malaria.  The parasite has developed resistance to specific \ndrugs through two mechanisms: mutations in target proteins such as dihyfdrofolate \nreductase and bc1 complex for antifolates and nathoquiniones respectively and \nalterations in parasite transporter molecules such as p-glycoprotein homologue 1 \n(Pgh1) and PfCRT.  Alterations in the expression of Pgh1 have been associated with \nmodified susceptibility to a range of unrelated drugs.  The molecular mechanism(s) \nthat are responsible for this phenotype are unknown.  We have shown previously (25) \nthat the anticonvulsant phenobarbitone (PB) can induce reduced susceptibility to \nchloroquine (CQ) in Plasmodium falciparum, and in the current study we provide the \nfirst evidence for a molecular mechanism underlying this phenomenon.  We \ndemonstrate that pre-treatment with PB can elicit decreased susceptibility to CQ in \nboth CQ-resistant and CQ-sensitive parasite lines, and that this is associated with \nincreased expression of the drug transporter Pgh1, but not PfCRT a gene product \ncorrelated with overt CQ resistance.  Furthermore we have investigated the proximal \npromoter regions from both pfmdr1 and pfcrt, and identified a number of putative \nbinding sites for nuclear receptors with sequence similarities to regions known to be \nactivated by phenobarbitone in mammals.  Whole genome analysis has revealed a \nputative nuclear receptor gene, providing the first evidence that nuclear-receptor \nmediated responses to drug exposure may be a mechanism of gene regulation in \nPlasmodium falciparum. \nPage 3 of 26 \nINTRODUCTION \n Malaria remains one of the largest global health problems with between 1-2 \nmillion deaths each year mostly in young African children. One of the greatest \nchallenges facing Africa and the rest of the world in the fight against malaria is drug \nresistance, a problem that has reduced our armoury of effective drugs to a critically \nsmall number.  Chloroquine (CQ), the most widely used anti-malarial drug for many \ndecades is now essentially useless with resistance being reported in all malaria \nendemic regions; indeed, it has been reported that CQ resistance (CQR) is a major \nfactor behind the increasing burden of malaria worldwide (10).  Recent studies have \nimplicated two genes in antimalarial drug resistance, pfcrt, which has been shown to \nconfer resistance to CQ as well as a range of diverse structurally unrelated \nantimalarials (7, 8, 17, 21) and pfmdr1 which has been shown as a modulator of CQR \nand the basis of resistance to the quinoline methanols and related structures (28, 29, \n34, 52). \n The pfcrt gene is highly polymorphic showing sequence variation at 15 \npositions; interestingly a lysine to threonine substitution at codon 76 (K76T) is \npresent in all CQR isolates identified to date.  Independent genetic experiments have \nconfirmed the importance of mutations and in particular the K76T mutation in pfcrt as \nbeing responsible for the verapamil sensitive element of the CQ resistance phenotype \n(21, 43).  Furthermore, genetic manipulation of the expression level of PfCRT in a \nCQR parasite was shown to correlate with an increased susceptibility to CQ, \npresumably due to a reduced transport of drug through PfCRT (49).  Despite this \ncorrelation between PfCRT expression level and antimalarial drug susceptibility no \nevidence of altered expression of PfCRT has been identified in field isolates of P. \nfalciparum (5). \nPage 4 of 26 \n The P. falciparum P-glycoprotein homologue protein (Pgh1) encoded for by \npfmdr1 was identified over a decade before pfcrt (20).  Like pfcrt, there are a number \nof mutations in pfmdr1 that have been associated with multi-drug resistance (8).  \nHowever, despite these earlier correlations with CQR, recent genetic studies have \nshown that these mutations exert a greater influence on parasite susceptibility to a \nrange of other antimalarials including mefloquine, halofantrine and artemisinin than \nthey do for CQ susceptibility (34, 41, 42). \n The multi-drug resistant phenotype in mammalian tumour cells involves the \namplification of MDR genes and subsequent over expression of P-glycoprotein (3, 6).  \nStudies in P. falciparum focused on this phenomenon and noted a correlation between \npfmdr1 expression and CQR (8).  However, a number of further studies failed to \ncorroborate this observation and since then it has been conclusively demonstrated that \npfmdr1 copy number and expression of Pgh1 is more tightly associated with \nresistance to mefloquine than it is to CQR in field isolates and drug pressured \nlaboratory lines (8, 27, 30, 31). \n The molecular processes that govern the changes in pfmdr1 and pfcrt \nexpression described above are poorly understood with little known about the role of \npromoters, terminators and transcription factors in the regulation of gene expression.  \nP. falciparum promoters appear to conform to the classical eukaryotic bipartite \nstructure consisting of a proximal promoter regulated by upstream enhancer elements \n(cis-acting elements)(15), yet a classical regulatory motif, which can be identified in \nmultiple unrelated genes, has yet to be identified (24).  In stark contrast is the wealth \nof information available about the role of transcription factors and promoters in gene \nregulation in mammals:  One such example is the regulation of Phase I and II drug \nmetabolizing enzymes and drug transporters by members of the nuclear receptor \nPage 5 of 26 \nsuper-family, such as PXR and CAR, and their role in modulating drug resistance \npatterns in mammals (19, 22).  The nuclear receptor superfamily comprises 48 \nmembers in man, and acts within a hierarchical structure to co-ordinate body \nresponses to a wide range of therapeutics, including antivirals, antifungals and \nantibiotics, are ligands for these receptors (1, 54) . \n P. falciparum is known to possess orthologues for several nuclear receptor \ntarget genes, including CYPs, Pgp and MRP and previous work in our laboratory has \nshown that pre-treatment of parasite cultures with phenobarbitone, a potent inducer of \nCYPs and Pgp, resulted in a decreased susceptibility to CQ (26).  However, at the \ntime of the initial observation the molecular processes that regulate drug induced \nchanges in gene expression were unknown.  We propose a novel system of nuclear \nreceptor inducible gene regulation based on the extensively characterized human \nsystem that includes drug activation of nuclear receptors, subsequent translocation to \nthe nucleus, resulting in the increased rate of transcription mediated by RNA \npolymerases and subsequent increase in transporter protein levels.  \n \nPage 6 of 26 \nMATERIALS AND METHODS \nP. falciparum Strains  \nK1 (Thailand), a parasite isolate with a classical CQR phenotype and genotype \nwas kindly donated by Professor D. Walliker (University of Edinburgh) and was \ncloned twice by the method of limiting dilution (37) to give the CQR clone, K1H6\/2.  \nK1HF and K1AM are halofantrine and amantadine resistant parasite lines \nrespectively, selected from the CQR isolate K1H6\/2 (17, 36).  Parasites were \nmaintained in continuous culture.  Cultures contained a 2% suspension of O+ \nerythrocytes in RPMI 1640 (R8758) medium supplemented with 10% pooled human \nAB serum, 25 mM HEPES (pH 7.4), and 20 µM gentamicin sulphate (48). \n \nPre-treatment with phenobarbitone  \nSyncronized ring-stage cultures of P. falciparum parasites were exposed to \n0.1µM of phenobarbitone (PB) for a total period of 48h.  Parasites were washed twice \nwith drug free RPMI 1640 medium to remove traces of PB and samples were \nprocessed for in vitro drug susceptibility testing.  To determine the effect of PB \ntreatment on protein expression trophozoite stage parasites were exposed to 0.1µM of \nphenobarbitone (PB) for a total period of 48h and processed as described below. \n \nIn vitro drug susceptibility assays \n The effect of PB pre-treatment on CQ sensitivity in the absence of presence of \n5µM verapamil was determined from the incorporation of [3H]-hypoxanthine into \nparasite nucleic acids (4).  IC50 values were calculated for each assay using the four \nparameter logistic method (Grafit program, Erithacus software; Surrey, UK). \n \nPage 7 of 26 \nAnalysis of Pgh1 and PfCRT expression. \nSuspensions of trophozoite parasites at 10-15% parasitaemia were isolated using \nsaponin lysis, washed twice in ice cold PBS to remove cell debris and haemoglobin \nand re-suspended in ice cold PBS.  A series of liquid nitrogen freeze\/thaw cycles was \nperformed to ensure sufficient cell lysis.  The protein content of each sample was \ndetermined by the modified Bradford Assay (BIORAD, UK).  In order to normalise \nfor loading each sample was diluted appropriately with PBS to give the same protein \nconcentration before an equal volume of 2X SDS-PAGE loading buffer (125mM Tris-\nCl pH 6.8; 4% (w\/v) SDS; 20% (v\/v) glycerol; 10% (w\/v) 2-mercaptoethanol; 0.02% \n(w\/v) bromophenol blue) was added.  The samples were mixed vigorously with the \n2X SDS-PAGE loading buffer and boiled at 60°C for 15min.  Equal amounts of \nparasite protein from control and drug treated cultures were loaded onto a 4-15% \ngradient SDS-polyacrylamide gel and electroblotted onto PVDF membrane.  Protein \nexpression was assessed by immunoblotting using antibodies raised against either the \nC-terminus of PfCRT or the N-terminus of Pgh1 which were controlled for loading \nusing α-HSP70 antibodies.  Immunoreactive bands were visualised by Enhanced \nChemiluminescence (ECL; Pharmacia Biotech, UK) and analysed by densitometry \nusing the GeneTools software (Syngene, UK). \nPage 8 of 26 \nRESULTS \nIn vitro sensitivity testing \nPre-treatment with PB resulted in a decreased susceptibility to CQ in all \nparasite lines tested (figure 1).  Interestingly, the two drug-selected parasites, K1AM \nand K1HF, also exhibited a decreased susceptibility to CQ and had a partial return of \nthe VP-sensitive CQR phenotype (figure 1).  This observation is unique and \nunexpected considering that the drug-selected parasite lines had lost the VP-sensitive \nCQR phenotype on selection for resistance to AM and HF respectively (17).  The \nobservation that pre-treatment with PB results in an increased resistance to CQ \nconfirm the observation of Ndifor et al., (25, 26). \n \nEffect of phenobarbitone on Pgh1 and PfCRT expression. \nPre-treatment with PB resulted in a marked increase in the expression of Pgh1, \nthe protein product of pfmdr1, in all parasite lines tested (figure 2A and 2B).  Pgh1 \nexpression was most pronounced in the halofantrine-resistant line, K1HF compared to \nthe control K1H6\/2 and the amantadine-resistant line, K1AM; Semi-quantitative \nmeasurements indicate a 6.4-fold vs 4.7-fold vs 5.4-fold increases in Pgh1 expression \nrespectively.  However, PB treatment had no effect on the protein expression level of \nPfCRT in the lines tested (figure 2D and 2E). \n \nIn silico search for transcription factors in 5’ UTR of pfmdr1 and pfcrt \n Approximately 5kb of putative proximal promoter from pfmdr1 and pfcrt was \nexamined for putative transcription factor binding sites using the MatInspector \nsoftware (32). The MatInspector search matrix included transcription factors from \nvertebrates, insects, plants, fungi, nematodes and bacteria.  This approach, utilising a \nPage 9 of 26 \nmatrix and core similarity of 0.75 identified 1975 and 1798 putative transcription \nfactor binding sites in the proximal promoter of pfmdr1 and pfcrt respectively with a \nlarge percentage of these hits corresponding to regulators of cell cycle and the control \nof gene expression.  A manual filter was then applied to the data set, limiting hits to \nthose transcription factors known to be involved in the regulation of mammalian \nmulti-drug resistance genes (MDR), multi-resistance proteins (MRP) and cytochrome \nP450 enzymes:  From this more refined analysis 8 and 10 putative transcription factor \nbinding sites were identified in the pfmdr1 and pfcrt proximal promoter regions \nrespectively.  Figure 3 depicts the position of these transcription factors relative to the \ntranscription start site and the start codon of the gene.  Tables 1 and 2 show the \nconsensus nucleotide binding sequences identified by MatInspector, the transcription \nfactor commonly associated with binding at that site, plus details of the exact \nsequence identified and its similarity to the consensus.  \n Preliminary analysis of the predicted parasite proteome using NuReBaSe - \nNUclear REceptor dataBASE (http:\/\/www.ens-\nlyon.fr\/LBMC\/laudet\/nurebase\/nurebase.html) revealed a number of putative proteins \nwith between 20 - 36% amino acid identity to PPARg, RXR, RAR, mineralcorticoid \nreceptor (MR) and hepatic nuclear factor 4 (HNF4a on chromosomes 2, 3, 4, 10, 11, \n12 and 13. \nPage 10 of 26 \nDISCUSSION \nThe observation that the potent anticonvulsant phenobarbitone produces a shift \nin the susceptibility of P. falciparum parasites to CQ was first noted by Ndifor et al., \n(26).  The parasite lines chosen for this study were the parental K1H6\/2 and the two \ndrug selected isolates, K1AM and K1HF (17).  All three parasite lines have \npreviously been extensively characterised both phenotypically and genotypically with \nthe major difference between them being the acquisition of the novel S163R mutation \nin PfCRT and the return to CQ-sensitivity coupled with a loss of the VP-sensitive \ncomponent in the K1AM and K1HF lines (17, 36).  However, pre-treatment of the \nparasites with 0.1µM PB had little effect on parasite viability and each isolate \ncontinued to grow in 0.1µM PB at similar proliferation rates compared to control \nparasite cultures (data not shown), yet in vitro sensitivity testing for CQ-susceptibility \nshowed that all parasite isolates exhibited a marked decrease in the susceptibility to \nCQ following PB pre-treatment (figure 1). Furthermore the K1AM and K1HF lines \ndisplayed phenotypic characteristics of CQR including the return of a partial VP-\nsensitive component of CQR (figure 1). This observation is made more interesting \nsince the K1AM and K1HF parasites had been previously shown to have lost the VP-\nsensitive component of CQR upon selection with amantadine or halofantrine- a trait \ntypically associated with CQS parasite lines (7, 17, 21, 36, 43). \nSince the incubation time was insufficient to elicit a genotypic change in the \nparasite, the unique pattern of changes in CQ-susceptibility produced by PB treatment \nsuggest an adaptive response to PB.  It is well known that PB induces the expression \nof CYPs and ABC transporter proteins in mammals via nuclear receptor dependent \nmechanisms (13, 14, 16, 19, 38-40, 46, 53).  The changes in CQ-susceptibility \nobserved after PB treatment could feasibly be controlled by an increased metabolism \nPage 11 of 26 \nof CQ by CYPs, a hypothesis originally put forward by Ndifor et al., (25, 26).  \nHowever, it has been shown that CQ is not metabolised by malarial parasites (33, 47).  \nWe propose an alternate explanation, in keeping with the known effects of PB in other \nsystems, that PB influences CQ-susceptibility levels by regulating the expression of \ndrug transporter genes such as pfmdr1 and pfcrt, reducing the intracellular availability \nof CQ due to increased intracellular drug clearance.  Such a hypothesis is supported \nby the similarity of Pgh1 with mammalian Pgp’s, with Pgh1 a likely evolutionary \nantecedent of these mammalian proteins.  \nWestern blot analysis after treatment of parasites with PB resulted in a marked \nincrease in the expression of the P. falciparum ABC transporter, Pgh1 compared to \nthe un-treated controls in all parasite lines tested (figure 2).  PB had the most \npronounced effect on Pgh1 expression in the parent clone, K1H6\/2 and the \nhalofantrine resistant isolate, K1HF with all lines showing at least a 3-fold increase in \nprotein expression (figure 2).  Interestingly PB treatment had no effect on the \nexpression of PfCRT with all parasite lines showing similar protein levels.  This \nobservation strongly implicates the increased expression of Pgh1 in K1H6\/2, K1AM \nand K1HF as being responsible for the decreased CQ-susceptibility and suggests a \nmolecular link between these phenotypes. \nThe increased expression of Pgh1 by PB in P. falciparum could be rationalised \nbased on the accepted mechanisms for xenobiotic–mediated increases in drug \ntransporter expression seen in mammals under the influence of the same chemicals; \nthe activation of ligand activated transcription factors such as members of the nuclear \nreceptor superfamily (14, 19, 45, 51).  In mammals, this occurs via two distinct \nmechanisms.  First, ligands such as pregnenalone 16α carbonitrile (PCN) are able to \nbind to the ligand binding domain of the pregnane X receptor (PXR), which triggers \nPage 12 of 26 \ndissociation from cytosolic chaperones and nuclear translocation of the receptor \nresulting in transactivation of target genes (44).  Second, PB elicits phosphorylation of \nthe constitutive androstane receptor (CAR) via a signal transduction mechanism \ninitiated at the cell membrane, which results in activation of the receptor with the \nsame result (35)(figure 4).  Importantly, many mammalian nuclear receptors bind to \nsimilar response elements.  For example PXR and CAR mediate induction of CYP3A \n(53), CYP2B6 (9) and ABCB1 (2) via the same ER-6, DR-4 and PBREM motifs and \nan ER 8 mediates induction of ABCC2 by PXR, CAR and FXR (18). With this in \nmind, we have utilised a bioinformatic approach to screen the 3’ regulatory regions of \nparasite transporter genes for putative nuclear receptor response elements. \nThe pfmdr1 promoter sequence contains a total of two ligand-activated \ntranscription factor (LA-TF) binding motifs that could conceivably be activated and \nincrease the expression of Pgh1, these being the barbiturate-inducible element (Barbie \nbox) and the PXR\/RXR response element. It should be noted that there is unlikely to \nbe direct orthologues for PXR and CAR in plasmodium, as current evidence suggests \nthat these two nuclear receptors diverged from a single ancestral gene at some point \nafter the aves\/mammalian split (310 Million years ago).  It is instead likely that the \nnuclear receptor concerned is an antecedent of the chicken CXR, with potentially a \nmore generalized role in the response to xenobiotics in these organisms. Such a \nhypothesis is consistent with the promiscuity of mammalian drug response systems, \nwith PB able to activate either the Barbie box (via ligand binding to the constitutive \nandrostane receptor) the PXR\/RXR motif (via ligand binding to PXR), both of which \ncan result in the increased transcription and translation of mammalian Pgp (50, 53).  \nSimilarly, once ligand binding has occurred, CAR can bind to the PXR DNA binding \ndomain and vice versa (53). \nPage 13 of 26 \nThe experiments contained herein suggest the involvement of LA-TF’s in the \nregulation of Pgh1 expression, and hence the PB-mediated CQ-resistance of \nP.falciparum.  To date no LA-TFs have been identified in P. falciparum, but evidence \ndoes exist to suggest that primitive organisms may express members of the nuclear \nreceptor superfamily: In C. elegans, a number of NR homologues have been \nidentified, including NHR-8, which appears to share several characteristics with PXR \nand CAR (23).  NHR-8 is thought to function as a ‘xenobiotic sensor’ regulating the \ngene expression of C. elegans CYPs and the Pgp homologue, pgp-3; indeed, it has \nbeen suggested as the direct antecedent of chicken CXR, and hence mammalian \nPXR\/CAR (12).  Interestingly, Lindblom postulate that CQ could be a ligand for \nNHR-8 resulting in changes in CYP or pgp-3 expression that results in a decreased \nsusceptibility of C.elegans to CQ (23).  In fact a recent study by Gunasekera et al., \n(11) showed that the P. falciparum genome has the capacity to respond to external \nstimuli by identifying a number of loci that had altered gene expression after exposure \nto CQ including the pfmdr1 locus:  These findings corroborate the observations \npresented in this study and highlights the diversity of the LA-TF superfamily across \nspecies. Our proteome scan for putative nuclear receptors support such a hypothesis, \nidentifying seven putative nuclear receptors, including potential orthologues for \nPPAR and the ubiquitous heterodimer partner RXR. \nThis study provides the first evidence of a malarial parasite drug-inducible \nsystem of gene expression that is closely related to the mechanism used in a range of \nevolutionary diverse classes, including mammalia, aves and chromadorea.  Despite \nthese strong similarities there are a number of components of the system that have not \nbeen identified in the malaria parasite and in order to validate this system these need \nto be identified and characterised (figure 4).  However, we propose that the induction \nPage 14 of 26 \nof Pgh1 observed after PB treatment is a direct cellular response to the drug in an \nattempt by the parasite to remove the drug thereby preventing toxicity.  The fact that \nthe increased expression of Pgh1 was associated with an increased resistance to CQ \nfurther adds support for the role of this protein in conferring reduced parasite \nsusceptibility to this important antimalarial.  Furthermore a preliminary analysis of the \npredicted parasite proteome using NuReBaSe - NUclear REceptor dataBASE \n(http:\/\/www.ens-lyon.fr\/LBMC\/laudet\/nurebase\/nurebase.html) revealed a number of \nputative proteins with between 20 - 36% amino acid identity to PPARg, RXR, RAR, \nmineralcorticoid receptor (MR) and hepatic nuclear factor 4 (HNF4a on chromosomes \n2, 3, 4, 10, 11, 12 and 13.  Cloning and functional characterisation of these proteins \nwith respect to PB–responsive induction of Pgh1 is now warranted and will provide \nfurther insight into the gene regulation mechanisms adopted by the parasite. \n \nACKNOWLEDGEMENTS \nDJJ and SAW are supported by grants from the BBSRC, MRC and Wellcome Trust.  \nAO is supported by funding from UK Department of Health Biomedical Research \nCentre for Microbial Diseases, Monument Trust, AstraZeneca and Merck.  NJP is \nsupported by funding from the BBSRC. \nPage 15 of 26 \nREFERENCES \n1. Bookout, A. L., Y. Jeong, M. Downes, R. T. Yu, R. M. Evans, and D. J. \nMangelsdorf. 2006. Anatomical profiling of nuclear receptor expression \nreveals a hierarchical transcriptional network. Cell 126:789-99. \n2. Burk, O., K. A. Arnold, A. Geick, H. Tegude, and M. Eichelbaum. 2005. \nA role for constitutive androstane receptor in the regulation of human \nintestinal MDR1 expression. Biol Chem 386:503-13. \n3. Cowman, A. F. 1991. The P-glycoprotein homologues of Plasmodium \nfalciparum: Are they involved in chloroquine resistance? Parasitol Today \n7:70-6. \n4. Desjardins, R. E., C. J. Canfield, J. D. Haynes, and J. D. Chulay. 1979. \nQuantitative assessment of antimalarial activity in vitro by a semiautomated \nmicrodilution technique. Antimicrob Agents Chemother 16:710-8. \n5. Durrand, V., A. Berry, R. Sem, P. Glaziou, J. Beaudou, and T. Fandeur. \n2004. Variations in the sequence and expression of the Plasmodium \nfalciparum chloroquine resistance transporter (Pfcrt) and their relationship to \nchloroquine resistance in vitro. Mol Biochem Parasitol 136:273-85. \n6. Endicott, J. A., and V. Ling. 1989. The biochemistry of P-glycoprotein-\nmediated multidrug resistance. Annu Rev Biochem 58:137-71. \n7. Fidock, D. A., T. Nomura, A. K. Talley, R. A. Cooper, S. M. Dzekunov, \nM. T. Ferdig, L. M. Ursos, A. B. Sidhu, B. Naude, K. W. Deitsch, X. Z. Su, \nJ. C. Wootton, P. D. Roepe, and T. E. Wellems. 2000. Mutations in the P. \nfalciparum digestive vacuole transmembrane protein PfCRT and evidence for \ntheir role in chloroquine resistance. Mol Cell 6:861-71. \n8. Foote, S. J., J. K. Thompson, A. F. Cowman, and D. J. Kemp. 1989. \nAmplification of the multidrug resistance gene in some chloroquine-resistant \nisolates of P. falciparum. Cell 57:921-30. \n9. Goodwin, B., L. B. Moore, C. M. Stoltz, D. D. McKee, and S. A. Kliewer. \n2001. Regulation of the human CYP2B6 gene by the nuclear pregnane X \nreceptor. Mol Pharmacol 60:427-31. \n10. Greenwood, B. 2002. The molecular epidemiology of malaria. Trop Med Int \nHealth 7:1012-21. \n11. Gunasekera, A. M., S. Patankar, J. Schug, G. Eisen, and D. F. Wirth. \n2003. Drug-induced alterations in gene expression of the asexual blood forms \nof Plasmodium falciparum. Mol Microbiol 50:1229-39. \n12. Handschin, C., M. Podvinec, and U. A. Meyer. 2000. CXR, a chicken \nxenobiotic-sensing orphan nuclear receptor, is related to both mammalian \npregnane X receptor (PXR) and constitutive androstane receptor (CAR). Proc \nNatl Acad Sci U S A 97:10769-74. \n13. Honkakoski, P., R. Moore, K. A. Washburn, and M. Negishi. 1998. \nActivation by diverse xenochemicals of the 51-base pair phenobarbital-\nresponsive enhancer module in the CYP2B10 gene. Mol Pharmacol 53:597-\n601. \n14. Honkakoski, P., I. Zelko, T. Sueyoshi, and M. Negishi. 1998. The nuclear \norphan receptor CAR-retinoid X receptor heterodimer activates the \nphenobarbital-responsive enhancer module of the CYP2B gene. Mol Cell Biol \n18:5652-8. \n15. Horrocks, P., K. Dechering, and M. Lanzer. 1998. Control of gene \nexpression in Plasmodium falciparum. Mol Biochem Parasitol 95:171-81. \nPage 16 of 26 \n16. Jigorel, E., M. Le Vee, C. Boursier-Neyret, Y. Parmentier, and O. Fardel. \n2006. Differential regulation of sinusoidal and canalicular hepatic drug \ntransporter expression by xenobiotics activating drug-sensing receptors in \nprimary human hepatocytes. Drug Metab Dispos 34:1756-63. \n17. Johnson, D. J., D. A. Fidock, M. Mungthin, V. Lakshmanan, A. B. Sidhu, \nP. G. Bray, and S. A. Ward. 2004. Evidence for a central role for PfCRT in \nconferring Plasmodium falciparum resistance to diverse antimalarial agents. \nMol Cell 15:867-77. \n18. Kast, H. R., B. Goodwin, P. T. Tarr, S. A. Jones, A. M. Anisfeld, C. M. \nStoltz, P. Tontonoz, S. Kliewer, T. M. Willson, and P. A. Edwards. 2002. \nRegulation of multidrug resistance-associated protein 2 (ABCC2) by the \nnuclear receptors pregnane X receptor, farnesoid X-activated receptor, and \nconstitutive androstane receptor. J Biol Chem 277:2908-15. \n19. Kodama, S., and M. Negishi. 2006. Phenobarbital confers its diverse effects \nby activating the orphan nuclear receptor car. Drug Metab Rev 38:75-87. \n20. Krogstad, D. J., I. Y. Gluzman, D. E. Kyle, A. M. Oduola, S. K. Martin, \nW. K. Milhous, and P. H. Schlesinger. 1987. Efflux of chloroquine from \nPlasmodium falciparum: mechanism of chloroquine resistance. Science \n238:1283-5. \n21. Lakshmanan, V., P. G. Bray, D. Verdier-Pinard, D. J. Johnson, P. \nHorrocks, R. A. Muhle, G. E. Alakpa, R. H. Hughes, S. A. Ward, D. J. \nKrogstad, A. B. Sidhu, and D. A. Fidock. 2005. A critical role for PfCRT \nK76T in Plasmodium falciparum verapamil-reversible chloroquine resistance. \nEmbo J 24:2294-305. \n22. Lehmann, J. M., D. D. McKee, M. A. Watson, T. M. Willson, J. T. Moore, \nand S. A. Kliewer. 1998. The human orphan nuclear receptor PXR is \nactivated by compounds that regulate CYP3A4 gene expression and cause \ndrug interactions. J Clin Invest 102:1016-23. \n23. Lindblom, T. H., G. J. Pierce, and A. E. Sluder. 2001. A C. elegans orphan \nnuclear receptor contributes to xenobiotic resistance. Curr Biol 11:864-8. \n24. Myrick, A., A. Munasinghe, S. Patankar, and D. F. Wirth. 2003. Mapping \nof the Plasmodium falciparum multidrug resistance gene 5'-upstream region, \nand evidence of induction of transcript levels by antimalarial drugs in \nchloroquine sensitive parasites. Mol Microbiol 49:671-83. \n25. Ndifor, A. M., R. E. Howells, P. G. Bray, J. L. Ngu, and S. A. Ward. 1993. \nEnhancement of drug susceptibility in Plasmodium falciparum in vitro and \nPlasmodium berghei in vivo by mixed-function oxidase inhibitors. Antimicrob \nAgents Chemother 37:1318-23. \n26. Ndifor, A. M., S. A. Ward, and R. E. Howells. 1990. Cytochrome P-450 \nactivity in malarial parasites and its possible relationship to chloroquine \nresistance. Mol Biochem Parasitol 41:251-7. \n27. Nelson, A. L., A. Purfield, P. McDaniel, N. Uthaimongkol, N. Buathong, S. \nSriwichai, R. S. Miller, C. Wongsrichanalai, and S. R. Meshnick. 2005. \npfmdr1 genotyping and in vivo mefloquine resistance on the Thai-Myanmar \nborder. Am J Trop Med Hyg 72:586-92. \n28. Peel, S. A. 2001. The ABC transporter genes of Plasmodium falciparum and \ndrug resistance. Drug Resist Updat 4:66-74. \n29. Peel, S. A., P. Bright, B. Yount, J. Handy, and R. S. Baric. 1994. A strong \nassociation between mefloquine and halofantrine resistance and amplification, \nPage 17 of 26 \noverexpression, and mutation in the P-glycoprotein gene homolog (pfmdr) of \nPlasmodium falciparum in vitro. Am J Trop Med Hyg 51:648-58. \n30. Price, R. N., C. Cassar, A. Brockman, M. Duraisingh, M. van Vugt, N. J. \nWhite, F. Nosten, and S. Krishna. 1999. The pfmdr1 gene is associated with \na multidrug-resistant phenotype in Plasmodium falciparum from the western \nborder of Thailand. Antimicrob Agents Chemother 43:2943-9. \n31. Price, R. N., A. C. Uhlemann, A. Brockman, R. McGready, E. Ashley, L. \nPhaipun, R. Patel, K. Laing, S. Looareesuwan, N. J. White, F. Nosten, and \nS. Krishna. 2004. Mefloquine resistance in Plasmodium falciparum and \nincreased pfmdr1 gene copy number. Lancet 364:438-47. \n32. Quandt, K., K. Frech, H. Karas, E. Wingender, and T. Werner. 1995. \nMatInd and MatInspector: new fast and versatile tools for detection of \nconsensus matches in nucleotide sequence data. Nucleic Acids Res 23:4878-\n84. \n33. Rabinovich, S. A., I. M. Kulikovskaya, E. V. Maksakovskaya, T. V. \nChekhonadskikh, T. G. Pankova, and R. I. Salganik. 1987. Suppression of \nthe chloroquine resistance of Plasmodium berghei by treatment of infected \nmice with a microsomal monooxygenase inhibitor. Bull World Health Organ \n65:387-9. \n34. Reed, M. B., K. J. Saliba, S. R. Caruana, K. Kirk, and A. F. Cowman. \n2000. Pgh1 modulates sensitivity and resistance to multiple antimalarials in \nPlasmodium falciparum. Nature 403:906-9. \n35. Rencurel, F., A. Stenhouse, S. A. Hawley, T. Friedberg, D. G. Hardie, C. \nSutherland, and C. R. Wolf. 2005. AMP-activated protein kinase mediates \nphenobarbital induction of CYP2B gene expression in hepatocytes and a \nnewly derived human hepatoma cell line. J Biol Chem 280:4367-73. \n36. Ritchie, G. Y., M. Mungthin, J. E. Green, P. G. Bray, S. R. Hawley, and S. \nA. Ward. 1996. In vitro selection of halofantrine resistance in Plasmodium \nfalciparum is not associated with increased expression of Pgh1. Mol Biochem \nParasitol 83:35-46. \n37. Rosario, V. 1981. Cloning of naturally occurring mixed infections of malaria \nparasites. Science 212:1037-8. \n38. Salphati, L., and L. Z. Benet. 1998. Modulation of P-glycoprotein expression \nby cytochrome P450 3A inducers in male and female rat livers. Biochem \nPharmacol 55:387-95. \n39. Schuetz, E. G., W. T. Beck, and J. D. Schuetz. 1996. Modulators and \nsubstrates of P-glycoprotein and cytochrome P4503A coordinately up-regulate \nthese proteins in human colon carcinoma cells. Mol Pharmacol 49:311-8. \n40. Schuetz, E. G., A. H. Schinkel, M. V. Relling, and J. D. Schuetz. 1996. P-\nglycoprotein: a major determinant of rifampicin-inducible expression of \ncytochrome P4503A in mice and humans. Proc Natl Acad Sci U S A 93:4001-\n5. \n41. Sidhu, A. B., A. C. Uhlemann, S. G. Valderramos, J. C. Valderramos, S. \nKrishna, and D. A. Fidock. 2006. Decreasing pfmdr1 copy number in \nplasmodium falciparum malaria heightens susceptibility to mefloquine, \nlumefantrine, halofantrine, quinine, and artemisinin. J Infect Dis 194:528-35. \n42. Sidhu, A. B., S. G. Valderramos, and D. A. Fidock. 2005. pfmdr1 mutations \ncontribute to quinine resistance and enhance mefloquine and artemisinin \nsensitivity in Plasmodium falciparum. Mol Microbiol 57:913-26. \nPage 18 of 26 \n43. Sidhu, A. B., D. Verdier-Pinard, and D. A. Fidock. 2002. Chloroquine \nresistance in Plasmodium falciparum malaria parasites conferred by pfcrt \nmutations. Science 298:210-3. \n44. Squires, E. J., T. Sueyoshi, and M. Negishi. 2004. Cytoplasmic localization \nof pregnane X receptor and ligand-dependent nuclear translocation in mouse \nliver. J Biol Chem 279:49307-14. \n45. Staudinger, J. L., A. Madan, K. M. Carol, and A. Parkinson. 2003. \nRegulation of drug transporter gene expression by nuclear receptors. Drug \nMetab Dispos 31:523-7. \n46. Sueyoshi, T., and M. Negishi. 2001. Phenobarbital response elements of \ncytochrome P450 genes and nuclear receptors. Annu Rev Pharmacol Toxicol \n41:123-43. \n47. Surolia, N., G. Karthikeyan, and G. Padmanaban. 1993. Involvement of \ncytochrome P-450 in conferring chloroquine resistance to the malarial \nparasite, Plasmodium falciparum. Biochem Biophys Res Commun 197:562-9. \n48. Trager, W., and J. B. Jensen. 1976. Human malaria parasites in continuous \nculture. Science 193:673-5. \n49. Waller, K. L., R. A. Muhle, L. M. Ursos, P. Horrocks, D. Verdier-Pinard, \nA. B. Sidhu, H. Fujioka, P. D. Roepe, and D. A. Fidock. 2003. Chloroquine \nresistance modulated in vitro by expression levels of the Plasmodium \nfalciparum chloroquine resistance transporter. J Biol Chem 278:33593-601. \n50. Wang, H., S. Faucette, T. Sueyoshi, R. Moore, S. Ferguson, M. Negishi, \nand E. L. LeCluyse. 2003. A novel distal enhancer module regulated by \npregnane X receptor\/constitutive androstane receptor is essential for the \nmaximal induction of CYP2B6 gene expression. J Biol Chem 278:14146-52. \n51. Willson, T. M., and S. A. Kliewer. 2002. PXR, CAR and drug metabolism. \nNat Rev Drug Discov 1:259-66. \n52. Wilson, C. M., A. E. Serrano, A. Wasley, M. P. Bogenschutz, A. H. \nShankar, and D. F. Wirth. 1989. Amplification of a gene related to \nmammalian mdr genes in drug-resistant Plasmodium falciparum. Science \n244:1184-6. \n53. Xie, W., J. L. Barwick, C. M. Simon, A. M. Pierce, S. Safe, B. Blumberg, \nP. S. Guzelian, and R. M. Evans. 2000. Reciprocal activation of xenobiotic \nresponse genes by nuclear receptors SXR\/PXR and CAR. Genes Dev \n14:3014-23. \n54. Zhang, Z., P. E. Burch, A. J. Cooney, R. B. Lanz, F. A. Pereira, J. Wu, R. \nA. Gibbs, G. Weinstock, and D. A. Wheeler. 2004. Genomic analysis of the \nnuclear receptor family: new insights into structure, regulation, and evolution \nfrom the rat genome. Genome Res 14:580-90. \n \n \nPage 19 of 26 \nFIGURE LEGENDS \nFigure 1 Effect of pre-treatment with phenobarbitone on CQ-susceptibility in the CQ-\nresistant K1H6\/2 isolate and the CQS isolates K1AM and K1HF.  Representative \ndose\/response graph of the K1H6\/2 (a), K1AM (b) and K1HF (c) isolates to \nchloroquine in the absence and presence of 5 µM verapamil at 1% haematocrit and \n1% parasitaemia after pre-treatment for 48h with 0.1µM phenobarbitone (PB).  Data \nis presented as means ± SEM, where n=3. \n \nFigure 2 Effect of pre-treatment with phenobarbitone on expression of Pgh1 and \nPfCRT.  Densitometric analysis of Western blots enabled the expression levels of \nPgh1 and PfCRT to be determined in un-treated controls (A, D) and PB treated \nsamples (B, E) respectively.  Equal amounts of protein for each isolate were separated \non a 4-15% gradient gel and the protein detected using antibodies raised against Pgh1 \n(~ 160 kDa), PfCRT (~ 44 kDa) and HSP-70 (~ 70 kDa).  Bands were visualised by \nECL and quantified by densitometry using the GeneTools software (Syngene, UK).  \nRatio of Pgh1\/HSP-70 and PfCRT\/HSP-70 was used as an indicator of changes in \nexpression of Pgh1 and PfCRT after treatment compared to controls (C, F).  Data is \npresented as means ± SEM, where n=3.  Statistical significance (represented by **) \ncompared to untreated controls, where p<0.05. \n \nFigure 3 Schematic representation of the location of putative transcription factor \nbinding sites, predicted transcription start sites (arrow) and putative TATAA boxes in \nthe 5’ promoter sequences of pfmdr1 and pfcrt as identified by interrogation of the \nMatInspector database (32).  Abbreviations used are; BARBIE, barbiturate inducible \nelement; PRE, progesterone receptor binding site; RAR, related orphan receptor \nalpha2; PXR\/RXR, pregnane X receptor\/retinoic acid receptor half-site; CAR\/RXR, \nconstitutive androstane receptor\/retinoic acid receptor half-site; AhR, aryl \nhydrocarbon receptor; GRE, glucocorticoid receptor; PPAR\/RXR, peroxisome \nproliferators activated receptor\/retinoic acid receptor half-site. \n \nFigure 4 Proposed hypothesis for the inducible regulation of gene expression by \nphenobarbitone (PB) in P. falciparum.  (A) The molecular and cellular effects of PB \nin humans have been extensively characterised.  PB enters the cell and activates the \nPage 20 of 26 \nconstitutive androstane receptor (CAR) resulting in dephosphorylation of CAR which \nsubsequently translocates to the nucleus. CAR heterodimerizes with RXR in the \nnucleus with the resulting complex interacting directly with the phenobarbitone \nresponse element (PBRE) in the promoter resulting in transactivation of the gene.  In \nhumans this activation can result in the increased expression of drug transporters such \nas MDR1, MRP1 and BCRP.  (B) Proposed model for PB regulation of gene \nexpression in malarial parasites.  PB enters the parasite and activates nuclear receptor \n1 presumably through dephosphorylation of the protein.  The activated NR1 \ntranslocates to the nucleus forming a dimer with NR2 which subsequently binds to the \nPBRE resulting in an increased turnover of RNA polymerase and transcription of the \ngene.  The changes in Pgh1 observed after PB treatment suggest that pfmdr1 is a \ntarget for PB regulated gene expression with an additional candidate being the P. \nfalciparum multi-resistance protein 1 gene, pfmrp1. \nPage 21 of 26 \nTable 1 Distribution of transcription factor binding sites in the promoters of \npfmdr1 and pfcrt \n \n1Consensus binding sequence indicates the core nucleotides (uppercase and red) and \nthe possibilities for nucleotide matches at other positions of the TF motif, where \nY=pyrimidine (C&T), R= purine (A&G), W= weak (A&T), S= strong (G&C), K= \nketo (T&G) and N= any nucleotide.  Abbreviations: PPAR\/RXR, peroxisome \nproliferators activated receptor\/retinoic acid receptor half-site; AhR, aryl hydrocarbon \nreceptor; RAR, related orphan receptor a-2; PXR\/RXR, pregnane X receptor\/retinoic \nacid receptor half-site; CAR\/RXR, constitutive androstane receptor\/retinoic acid \nreceptor half-site. \nTranscription factor (TF) Consensus TF binding sequence1 pfmdr1 pfcrt\nCellular & viral TATA box elements nnstATAAAwrnnnnnn + +\nBarbiturate inducible element atnnAAAGcngrngg + +\nProgesterone receptor binding site nnrgnacnnknTGTTCTnn + +\nPPAR\/RXR heterodimers cwrawctTAGGnCAAAGGTCAn - +\nAhR nuclear translocator homodimers nnnnnCACGTGnn - +\nGlucocorticoid receptor nngGTACAannTGTYCTnn - +\nRAR-orphan receptor α-2 nwawnnAGGTCAnnnnn + +\nPXR halfsite\/RXR receptor nnTGAACTynn + -\nCAR\/RXR heterodimer binding site nnTGAACTynn + -\nPage 22 of 26 \nTable 2 DNA sequence and matrix similarity of transcription factors identified in pfmdr1 and pfcrt \n1\n Core similarity is the match against the nucleotides representing the core motif of the TF, where 1= 100% identity \n2\n Matrix similarity is the overall similarity to the TF binding motif, where 1= 100% identity \n3\n Actual DNA sequence from either the pfmdr1 or pfcrt promoter with the nucleotides in red representing critical residues for binding \n \nTranscription factor (TF) Core Similarity1 Matrix Similarity2 DNA sequence3\nBarbiturate inducible element 1 0.90 atgaAAAGgaaaaggg\nBarbiturate inducible element 1 0.88 ttaaAAAGttgaaag\nBarbiturate inducible element 1 0.89 atggAAAGgagagga\nProgesterone receptor binding site 1 0.88 cttatccgaatTGTTcttc\nProgesterone receptor binding site 1 0.90 tacgcaaaactTGTTctta\nPXR halfsite\/RXR receptor 1 0.98 gtTGAActtgt\nRAR-orphan receptor a-2 1 0.93 agtaagaGGTCaagagg\nBarbiturate inducible element 1 0.897 aaaaAAAGcagatga\nBarbiturate inducible element 1 0.88 tttcAAAGcttgaag\nBarbiturate inducible element 1 0.88 aggaAAAGgaaaagg\nGlucocorticoid receptor 0.93 0.89 gttttacatattGTCCtga\nProgesterone receptor binding site 1 0.89 tatcatcatttTGTTcttg\nAhR nuclear translocator homodimers 1 0.90 ttagcaaCGTGtt\nPPAR\/RXR heterodimers 1 0.74 aaaaaagatgcaaaagatcaa\nPPAR\/RXR heterodimers 1 0.75 caaaatgatgatAAAGatcaa\nRAR-orphan receptor a-2 0.75 0.832 ataattgGGTAaattgt\npfmdr1\npfcrt\nPage 23 of 26 \nFIGURES \nFIGURE 1 \n \nPage 24 of 26 \n \n \nPage 25 of 26 \nFIGURE 3 \npfmdr1TATAA\n-1646-6300\nBARBIE\nRAR\nPRE\nPXR\/RXR\nCAR\/RXR\nBARBIE\nRAR\nPRE\npfcrtTATAA\n-1140-5870\nGRE\nAhR\nPPAR\/RXR\nPage 26 of 26 \nFIGURE 4 \n \n"}