{"doi":"10.1103\/PhysRevC.76.054605","coreId":"100960","oai":"oai:epubs.surrey.ac.uk:361","identifiers":["oai:epubs.surrey.ac.uk:361","10.1103\/PhysRevC.76.054605"],"title":"Decay studies for states in (9)Be up to 11 MeV: Insights into the n+(8)Be and alpha+(5)He cluster structure","authors":["Brown, TAD","Papka, P","Fulton, BR","Watson, DL","Fox, SP","Groombridge, D","Freer, M","Clarke, NM","Ashwood, NI","Curtis, N","Ziman, V","McEwan, P","Ahmed, S","Catford, WN","Mahboub, D","Timis, CN","Baldwin, TD","Weisser, DC"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-11-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER PHYSICAL SOC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:361<\/identifier><datestamp>\n      2017-10-31T13:57:56Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/361\/<\/dc:relation><dc:title>\n        Decay studies for states in (9)Be up to 11 MeV: Insights into the n+(8)Be and alpha+(5)He cluster structure<\/dc:title><dc:creator>\n        Brown, TAD<\/dc:creator><dc:creator>\n        Papka, P<\/dc:creator><dc:creator>\n        Fulton, BR<\/dc:creator><dc:creator>\n        Watson, DL<\/dc:creator><dc:creator>\n        Fox, SP<\/dc:creator><dc:creator>\n        Groombridge, D<\/dc:creator><dc:creator>\n        Freer, M<\/dc:creator><dc:creator>\n        Clarke, NM<\/dc:creator><dc:creator>\n        Ashwood, NI<\/dc:creator><dc:creator>\n        Curtis, N<\/dc:creator><dc:creator>\n        Ziman, V<\/dc:creator><dc:creator>\n        McEwan, P<\/dc:creator><dc:creator>\n        Ahmed, S<\/dc:creator><dc:creator>\n        Catford, WN<\/dc:creator><dc:creator>\n        Mahboub, D<\/dc:creator><dc:creator>\n        Timis, CN<\/dc:creator><dc:creator>\n        Baldwin, TD<\/dc:creator><dc:creator>\n        Weisser, DC<\/dc:creator><dc:publisher>\n        AMER PHYSICAL SOC<\/dc:publisher><dc:date>\n        2007-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/361\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Brown, TAD, Papka, P, Fulton, BR, Watson, DL, Fox, SP, Groombridge, D, Freer, M, Clarke, NM, Ashwood, NI, Curtis, N, Ziman, V, McEwan, P, Ahmed, S, Catford, WN, Mahboub, D, Timis, CN, Baldwin, TD and Weisser, DC  (2007) Decay studies for states in (9)Be up to 11 MeV: Insights into the n+(8)Be and alpha+(5)He cluster structure   PHYSICAL REVIEW C, 76 (5), ARTN 0.       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevC.76.054605<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/361\/","10.1103\/PhysRevC.76.054605"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"PHYSICAL REVIEW C 76, 054605 (2007)\nDecay studies for states in 9Be up to 11 MeV: Insights into the n + 8Be and\nα + 5He cluster structure\nT. A. D. Brown,* P. Papka,† B. R. Fulton, D. L. Watson, S. P. Fox, and D. Groombridge\nDepartment of Physics, University of York, York YO10 5DD, United Kingdom\nM. Freer, N. M. Clarke, N. I. Ashwood, N. Curtis, V. Ziman, P. McEwan, and S. Ahmed\nSchool of Physics and Astronomy, University of Birmingham, Birmingham B15 2TT, United Kingdom\nW. N. Catford, D. Mahboub, C. N. Timis, and T. D. Baldwin\nSchool of Electronics and Physical Sciences, University of Surrey, Guildford GU2 7XH, United Kingdom\nD. C. Weisser\nDepartment of Nuclear Physics, Australian National University, Canberra, ACT 0200, Australia\n(Received 6 November 2006; revised manuscript received 25 September 2007; published 20 November 2007)\nAn experiment was performed to study the 9Be(6Li,6Li)9Be∗ → α + α + n reaction. This experiment was\ndesigned to study the breakup of 9Be in an attempt to quantify the breakup yield for each of the decay channels\n(n + 8Beg.s, n + 8Be2+ , and α + 5Heg.s) from the low-lying states. The results suggest that the population of states\nin 9Be from 1.68 to 11.28 MeV can be identified. Branching ratios for each of the breakup channels have been\nestimated for these states. These results are compared with earlier experiments and with theoretical predictions.\nThey confirm the theoretical claim that the n + 8Be2+ and α + 5Heg.s channels increase in importance at higher\nexcitation energies.\nDOI: 10.1103\/PhysRevC.76.054605 PACS number(s): 25.60.Gc, 26.50.+x, 21.60.Gx\nI. INTRODUCTION\nDue to the Borromean structure of 9Be the breakup of this\nnucleus can, in principle, occur directly to two α particles\nand a neutron or via one of two unstable intermediate nuclei:\n8Be and 5He. These two nuclei have lifetimes of 10−16 and\n10−21 s, respectively, and have broad resonance states such as\nthe first excited state in 8Be at 3.04 MeV (\u0002 \u0003 1.5 MeV) and\nthe 5Heg.s. (\u0002 \u0003 0.6 MeV).\nFigure 1 illustrates the states in 9Be up to Ex = 11 MeV as\nderived from proton-scattering measurements made by Dixit\net al. [1]. Previous measurements of the breakup of 9Be have\nmostly been concerned with breakup via those states below\nEx = 12 MeV [2–8]. Given the available excitation energy,\nfour channels can be identified as the principal breakup paths:\n9Be∗ → 8Beg.s + n → α + α + n (1)\n9Be∗ → 8Be2+ + n → α + α + n (2)\n9Be∗ → 5Heg.s. + α → α + n + α (3)\n9Be∗ → α + α + n. (4)\nThe breakup of 9Be via the 8Beg.s has been quantified for\nmany of the low-lying excited states in 9Be [4,5]. However,\nthe amount of the breakup yield going via the 8Be2+ state and\nthe 5Heg.s. remains uncertain. There is experimental evidence\nthat suggests that a considerable amount of yield will go via\n*Present address: CENPA, Box 354290, University of Washington,\nSeattle, WA 98195, U.S.A.\n†Present address: iThemba LABS, P.O. Box 722, Somerset West\n7129 , South Africa.\none of these two breakup channels for the states just above\nbreakup threshold (those below Ex = 4.0 MeV), although it\nhas not been possible to distinguish between the kinematics\nof these two channels [8–10]. There has also been evidence of\nbreakup via the 5Heg.s. for the higher states in 9Be although\nlittle quantitative information has been provided [9,11,12]. The\ncontribution of the direct breakup channel has largely been\nignored. However, due to the large width of the first excited\nstate in 8Be (\u0002 \u0003 1.5 MeV), breakup via the 8Be2+ state has\nbeen considered a variant of direct breakup in the past [2].\nThe breakup of a nucleus into particular channels is\ncorrelated with the strength of the cluster configurations in the\nwave function for each state. There have been many theoretical\nmodels used to describe clustering in the 9Be nucleus,\nincluding AMD models, which illustrate a cluster substructure\nin the model wave functions [13]. Recent fully microscopic\ncluster model calculations have also been carried out assuming\nn + 8Beg.s, n + 8Be2+ , and α+ 5He configurations [14,15].\nThese suggest that the latter components become dominant for\nhigher excitation energies. However, it should be noted that the\nobserved branching ratios for the different reaction channels\nwill generally be governed by the presence of Coulomb and\ncentrifugal barriers. Neither of these considerations favor\nbreakup via α+ 5He for those states in 9Be just above breakup\nthreshold.\nThe inverse of 9Be breakup, the three-body formation (ααn)\nof 9Be, may have significant astrophysical repercussions. The\nreaction is believed to be one of the key reactions that bridges\nthe mass number gap at A = 5 and A = 8 in the neutron\nand α-particle-rich environment produced by a core collapse\nsupernova explosion [16,17]. Previous calculations of the rate\n0556-2813\/2007\/76(5)\/054605(8) 054605-1 ©2007 The American Physical Society\nT. A. D. BROWN et al. PHYSICAL REVIEW C 76, 054605 (2007)\nFIG. 1. The low-lying excited states in 9Be derived from proton-\nscattering measurements made by Dixit et al. [1]. The states at 2.429\nand 6.380 MeV are part of the ground-state rotational band.\nof this reaction, including the most recent [7,18], have assumed\nthe ααn reaction proceeds entirely through the 8Beg.s. for the\nastrophysically relevant states in 9Be below 4 MeV. The short\nlifetimes of the 8Be2+ state and the 5Heg.s. suggest that the\nsequential capture of a neutron or an α particle is very unlikely.\nThe formalism used to derive the ααn rate by Grigorenko\nand Zhukov [19] also suggests that any broad intermediate\nresonances will have little effect on the ααn rate. However,\nanother recent theoretical calculation of the ααn rate has\nsuggested that at temperatures above 3 × 109 K the 5Heg.s.\nchannel becomes significant for the formation of 9Be [20]. This\nresult, along with the qualitative breakup data discussed above,\nsuggests the necessity of acquiring quantitative branching ratio\ndata for the low-lying states in 9Be.\nThis article presents the results of an experiment designed to\nstudy the breakup of 9Be and provide a quantitative description\nof the channel branching ratios for the low-lying states.\nII. EXPERIMENTAL DETAILS\nThe experiment was performed using the 14UD pelletron\ntandem accelerator at the Australian National University\nduring April 2003. The experiment was designed to study\nthe inelastic scattering of 6Li nuclei from a 9Be target and the\nsubsequent breakup of the excited 9Be nuclei. The detection\ntechnique for this experiment required that the 6Li recoils\nwere detected and identified. By also detecting and identifying\nthe two corresponding α particles for each breakup event,\nit is possible to reconstruct the missing momentum of the\nundetected neutron. The reaction kinematics are then fully\ndefined, allowing the complete reconstruction of the breakup\nevents and identification of the states in 9Be that were\npopulated.\nA 6Li beam at Elab = 60 MeV was focused onto a 9Be\ntarget (256 µg\/cm2). Data were taken for approximately\n92 h with a beam current of between Ibeam = 2 and 5 enA. For\nthe purposes of detecting the α particles arising from breakup,\nfour position-sensitive silicon strip detectors (PSSSDs) were\n9\n(5 x 5 cm)\n(5 x 5 cm)\nα60o\n30 34\n62\nBe Target  \n(256 2g\/cmµ\n6\n)\nTarget − Detector \nView along beam axis\n  10 cmDistance ~\no\nα\n6\nLi beam\no\nLi recoil\nSilicon Quadrant Detector\nPSSSD \no\n@ 60 MeV\nFIG. 2. Experimental setup.\nused. Each detector has a thickness of l \u0003 500 µm and is\ncomposed of sixteen 50-mm-long resistive strips 3 mm wide.\nThe PSSSDs typically have an energy resolution of δE \u0003\n0.2 MeV and a position uncertainty of \u0004x \u0003 ±0.5 mm along\na strip. As shown in Fig. 2, a pair of detector telescopes were\nused to detect and identify recoil 6Li nuclei. Each consisted of\nof a silicon quadrant detector (l \u0003 65µm) mounted in front of\na PSSSD. The position of the detectors relative to the target\nare indicated in Fig. 2 and were chosen based on efficiency\nresults obtained from Monte Carlo simulations.\nIII. ANALYSIS AND RESULTS\nA. SIMSORT\nFor the purposes of gaining a better interpretation of the\nexperimental results, a Monte Carlo program, SIMSORT [21],\nwas written to simulate the breakup reaction and the detector\nresponse. SIMSORT permits the user to define the exact nature\nof the breakup: the excited state populated in 9Be and whether\nbreakup occurs via the 8Beg.s, the 8Be2+ state, or the 5Heg.s..\nThe code contains the details of the different excited states\nin 9Be up to Ex = 11.28 MeV. An anisotropic distribution,\ndetermined from the spin of the initial and final states, is\nused for each of the breakup stages [22]. The scattering\ndistribution used for the 6Li recoils was derived from the\nexperimental results (θ was reconstructed using the strip\nposition information from the PSSSDs in the two telescopes).\nIn addition to the physics governing the breakup, the energy\nloss and straggling in the target is also included along with\ndetails of the detector setup, i.e., threshold detection energies,\nthe expected energy and position resolution for the PSSSDs,\net cetera. For the sake of consistency with the analysis of the\nreal data, SIMSORT uses an identical data sort process.\nB. 8Beg.s events\nFigure 3 illustrates an E-\u0004E spectrum plotted from data\ntaken from both detector telescopes. Three principle loci can\nbe easily identified on the spectrum: one corresponding to\nscattered 9Be, another corresponding to scattered 6Li, and a\n054605-2\nDECAY STUDIES FOR STATES IN 9Be UP TO 11 . . . PHYSICAL REVIEW C 76, 054605 (2007)\nFIG. 3. (Color online) E-\u0004E spectrum reconstructed from data\ntaken from both telescopes.\nthird arising from α particles. There is also evidence of loci\ncorresponding to protons and deuterons at low energy.\nThe spectrum in Fig. 4 shows the relative energy for two\nparticles detected in coincidence with the 6Li nuclei identified\nin Fig. 3. The relative energy has been reconstructed assuming\nthe two detected particles were α particles and by imposing a\ntotal energy gate consistent with 9Be breakup. Events where\ntwo particles hit adjacent strips were rejected, because it is\npossible for a particle hitting the narrow gap between two\nstrips to induce charge on both strips.\nThree principle features can be identified from the spectrum\nin Fig. 4. A peak with an Erel \u0003 0.092 MeV (Q value of 8Be\nbreakup) can be observed, corresponding to events that break\nup via the 8Beg.s.. A broad peak at Erel \u0003 2.8 MeV can also be\nidentified. This corresponds to the energy of the first excited\nstate (2+) in 8Be and identifies events that breakup via this\nstate. However, the large relative energy between the two α\nparticles suggests that the events could also correspond to\nbreakup via 5He. The third feature in the spectrum, the peak\nlying at Erel \u0003 0.6 MeV, does not correspond to an energy state\nin 8Be. In the past, events in this peak have been attributed to\neither breakup via the tail of the broad 2+ state in 8Be (\u0002 \u0003\n1.5 MeV) or breakup via the 5Heg.s. [8,10]. Ashwood et al. [10]\nwere able to reproduce this feature using a decay phase-space\ncalculation for both breakup via the 8Be2+ state and breakup\nvia the 5Heg.s..\n Relative Energy (MeV)α-α\n0 1 2 3 4 5\nN\no.\n o\nf E\nve\nnt\ns\n0\n5000\n10000\n15000\n20000\n25000\nFIG. 4. α-α relative energy spectrum for events with 57 MeV\n< ETOT < 60 MeV.\nTotal Energy (MeV)\n56 58 60 62\nN\no \n.o\nf E\nve\nnt\ns\n0\n1000\n2000\n3000\n4000\n58.4 MeV\nFIG. 5. Total energy spectrum for real 8Beg.s. events (solid line)\nand simulated 8Beg.s. events (dashed line).\nThe total final state kinetic energy (total energy) of the\nreaction was calculated from\nETOT = Eα1 + Eα2 + En + E6Li, (5)\nwhere the energy and momentum of the undetected neutron\nare reconstructed from the detected 6Li and the two α particles.\nFigure 5 illustrates a total energy spectrum reconstructed\nfor real 8Beg.s. events and a simulated spectrum generated\nfrom SIMSORT. Both spectra have been corrected for energy\nloss in the target Eloss ∼ 0.1 MeV. Given the beam energy\n(Elab = 60 MeV) and the Q value of the breakup of 9Be\n(Q = −1.57 MeV), the total energy of genuine 9Be breakup\nevents should be reconstructed around ETOT \u0003 58.4 MeV.\nThis is demonstrated in Fig. 5. The α particles detected at\nlow energy and large angles, arising from the energy loss and\nstraggling in the target, make the dominant contribution toward\nthe experimental resolution.\nFigure 6 shows a 9Be excitation energy spectrum re-\nconstructed for the 8Beg.s. events identified in Fig. 4. A\nbest fit of the state line shapes to the spectrum suggests\nstrong contributions from the states at Ex = 2.43, 3.05, and\n4.70 MeV. The broad state (\u0002 \u0003 1.0 MeV) at 2.78 MeV\ndoes not make significant contribution to the fit. A fitting\nroutine was used such that the peak centroids were fixed\nBe Excitation Energy (MeV)9\n0 1 2 3 4 5 6\nN\no.\n o\nf E\nve\nnt\ns\n0\n50\n100\n150\n200\n250\n300\n350\n400\n450\nFIG. 6. 9Be excitation energy spectrum for 8Beg.s. events with\n57 MeV < ETOT < 60 MeV. Gaussian line shapes have been used to\nfit the spectrum for the states at Ex = 1.68, 2.43, and 3.05 MeV. Due\nto their large intrinsic width, Lorentzian line shapes were used for the\nstates at Ex = 4.70 and 5.59 MeV.\n054605-3\nT. A. D. BROWN et al. PHYSICAL REVIEW C 76, 054605 (2007)\nby the energy of the known states between Ex = 1 and\n6 MeV, and the peak widths were constrained by the state\nintrinsic widths and the experimental resolution (obtained from\nFig. 9). To remove the effect on the experimental resolution\nfrom low-energy α particles, the excitation energy was derived\nfrom the detected 6Li recoil energy and angle. However, the\nbroad width (\u0002 = 0.632 MeV) assigned to the narrow state at\nEx = 2.43 MeV indicates that the experimental resolution is\nstill poor. The dominant factors in this case are 6Li energy loss\nand straggling in the target and the silicon quadrant detectors.\nThe experimental spectrum in Fig. 5 suggests that there\nmay also be a background component to the 9Be excitation\nenergy spectrum. By gating on ETOT values away from the peak\nregion, it can be shown that such a component is approximately\nflat and small relative to the number of events in Fig. 6. If a\nlinear background component is introduced into the fitting\nroutine it has little effect on the position and width of the\npeaks.\nThe discrepancies between the fitted profile and the\nmeasured spectrum arise from the fact that, although the\nproton-scattering measurements of Dixit et al. [1] simply\nprobe the excitation of the states, the data in this measurment\nreflect both the state population and the subsequent selection\nof one of the possible decay modes. Because the Coulomb\nand centrifugal barriers differ for each decay channel and,\nmoreover, are energy dependent, imposing a decay channel\nselection will affect the shape as well as the apparent position\nof the peak resulting from a given state.\nC. Neutron transfer events\nEvents corresponding to the neutron transfer reaction\n9Be(6Li, 7Li∗)8Be∗ −→ 6Li + 2α + n (6)\nwere rejected in the data sort process. This reaction has an\nidentical Q value to 9Be breakup and it was thought that\nit may be contaminating the breakup events of interest. The\nneutron transfer events were identified by reconstructing the\nexcitation energy of the parent 7Li nucleus. This is plotted\nin Fig. 7, and shows there is strong population of the fourth\nexcited state in 7Li (5\/2−) at 7.5 MeV, the first state above\nthe neutron emission threshold at 7.2 MeV. The events that\nfall into this peak have been rejected when reconstructing 9Be\nevents. However, these contaminating events constitute only\napproximately 10% of the data and have little effect on the\nshape and the features of the spectra.\nD. Breakup events with a large α-α relative energy\nFigure 8 shows the 9Be excitation energy spectrum for\nevents identified in Fig. 4 with an α-αErel > 0.2 MeV. This\nspectrum illustrates the population of states possibly as high\nas Ex = 11 MeV, although it is difficult to resolve individual\nstates. As before, by deconvoluting the narrow peak just above\nEx = 2 MeV and the broad peak centered at Ex \u0003 6.5 MeV,\nit is possible to identify the contributing states.\nFigure 9 shows the 9Be excitation energy spectrum for\nevents residing in (a) the peak with α-αErel \u0003 0.6 MeV and (b)\nLi Excitation Energy (MeV)7\n0 2 4 6 8 10 12 14\nN\no.\n o\nf E\nve\nnt\ns\n0\n100\n200\n300\n400\n500\n600\nFIG. 7. 7Li excitation energy specrum for 8Beg.s. events with\n57 MeV < ETOT < 60 MeV.\nthe peak with α-αErel \u0003 2.8 MeV. It can be seen from Fig. 9(a)\nthat these events break up mostly via the state at Ex = 2.43\nMeV. The line shapes fitted to the spectrum indicate there\nis also a contribution from the state at Ex = 3.05 MeV. The\nwidths for the line shapes obtained in this fit were used to fix\nthe width of the line shapes used in Fig. 6. The spectrum in\nFig. 9(b) indicates that these events populate only those states\nin 9Be above Ex = 4.0 MeV. Strong contributions can be seen\nfrom the states at Ex = 6.38 and 6.76 MeV. Lorentzian line\nshapes have been used to fit the spectrum for all these broad\n(\u0002 > 1.0 MeV) states.\nThe quality of the fit to the spectrum in Fig. 9(b) is again\naffected by the distortion of the states associated with feeding\nto the 8Be2+ state\/5Heg.s., but also possibly by the presence of\nother states in the 4- to 12-MeV region [23].\nThe issue of whether these events break up via the\n5Heg.s. or the 8Be2+ state was resolved by analyzing the\nα-n relative energy. The detected breakup α particles were\nrandomly labeled α1 and α2 in the data sort process. Figure 10\nillustrates a series of spectra where the α1-n relative energy\nhas been plotted against the α2-n relative energy. These spectra\nhave been reconstructed for regions of excitation energy\ncorresponding to the known states in 9Be between Ex = 2.43\nand 11.28 MeV. The Q value for 5He breakup is Q \u0003 0.9 MeV\n(\u0002 \u0003 0.65 MeV), and therefore the presence of 5Heg.s. events\nin the spectra should be indicated by event concentrations\naround Erel = 0.9 MeV on one axis and around a relatively\nBe Excitation Energy (MeV)9\n0 5 10 15 20\nN\no.\n o\nf E\nve\nnt\ns\n0\n2000\n4000\n6000\n8000\nFIG. 8. 9Be excitation energy spectrum for 9Be breakup events\nwith α-αErel > 0.2 MeV.\n054605-4\nDECAY STUDIES FOR STATES IN 9Be UP TO 11 . . . PHYSICAL REVIEW C 76, 054605 (2007)\nBe Excitation Energy (MeV)9\n0 5 10 15 20\nN\no.\n o\nf E\nve\nnt\ns\n0\n200\n400\n600\n800\n1000\n1200\n1400\n1600\n1800 (b)\n0 1 2 3 4 5\nN\no.\n o\nf E\nve\nnt\ns\n0\n500\n1000\n1500\n2000\n2500\n3000\n3500\n4000\n4500 (a)\nFIG. 9. 9Be excitation energy spectrum for (a) break-up events\nwith 0.2 MeV < α-αErel < 1.0 MeV and (b) breakup events with\n2.5 MeV < α-αErel < 3.5 MeV. Gaussian line shapes were used for\nthe fit in (a) and Lorentzian line shapes were used for the fit in (b).\nhigher energy on the other axis. The α particle originating from\nthe 5He should have a smaller relative energy with the neutron\nthan the other α particle (originating from the first stage of the\nbreakup), assuming there is enough available energy for the\nfirst emitted α particle.\nEvent concentrations in Fig. 10 around 0.9 MeV suggest\nthat there is evidence for breakup via 5He for states at Ex =\n6.38 and 6.76 MeV, although it is not clear whether such\nfeatures can be identified from the other spectra. By using 1D\nprojections of the α-n relative energy spectra it is possible to\ndistinguish events associated with breakup via the 8Be2+ and\n5Heg.s. for all those states above Ex = 4.0 MeV.\nE. Breakup path for states in 9Be above 4.0 MeV\nA plot of the α1-n relative energy for an energy region\nconsistent with the 6.38-MeV state is given in Fig. 11. Two\nspectrum profiles are shown corresponding to genuine and\nsimulated events. 8Beg.s. events have not been included in\neither of the spectra, and events with α2-nErel < 2.0 MeV\nhave also been rejected for the purposes of enhancing features\nassociated with 8Be2+ and 5Heg.s. events.\nThe simulated spectrum was generated for events assuming\na 5Heg.s. breakup path. This spectrum is a good match to\nthe experimental profile, suggesting that most of the events\nin this excitation energy region breakup via the 5Heg.s..\nFigure 12 shows a simulated spectrum for events assuming\na 8Be2+ breakup path.\n0.2\n0.4\n0.6\n0.8  = 2.4xE\n0 0.5 1\n1\n = 2.8xE\n0 0.5 1 1.5\n1\n = 3.0xE\n0 1 2 3\n1\n2\n3  = 4.7xE\n1 2 3 4\n1\n2\n3\n4\n = 5.6xE\n1 2 3 4\n1\n2\n3\n4\n = 6.4xE\n1 2 3 4 5\n1\n2\n3\n4\n5  = 6.75xE\n2 4 6 8\n2\n4\n6\n8\n = 11.3xE\n (MeV)rel-n E1α\n \n(M\neV\n)\nre\nl\n-\nn\n E\n2\nα\nFIG. 10. (Color online) 2D α-n relative energy spectra for 9Be\nexcitation energies above 2.3 MeV. Events have been selected for\neach spectrum by gating on an excitation energy region of 0.2 MeV\ncentered on the value given in each plot. 8Beg.s. events have been\nremoved.\nFor the states at high energy it is possible to reproduce\nthe α-n relative energy spectra by simulating events for either\none type of breakup path or the other, or by mixing the two\ntypes of events and weighting each channel appropriately. The\nproportion of breakup yield associated for each breakup path\ncan now be determined. The number of events going via the\n8Beg.s. can be easily obtained from an α-α relative energy\nspectrum.\nF. Breakup path for the 2.43-MeV state\nThe identification of the breakup path for states in 9Be with\nan Ex < 4.0 MeV, i.e., those states that are more likely to be\nimportant in an astrophysical environment, is more difficult.\nAlthough it is trivial to identify 8Beg.s. events, at low excitation\nenergy the α-n relative energy for 5Heg.s. and 8Be2+ events is\nvery difficult to distinguish. This problem is especially acute\n054605-5\nT. A. D. BROWN et al. PHYSICAL REVIEW C 76, 054605 (2007)\n-n Relative Energy (MeV)1α\n0 1 2 3 4 5\nN\no.\n o\nf E\nve\nnt\ns\n0\n10\n20\n30\n40\n50\nFIG. 11. α1-n relative energy spectrum for simulated (dashed\nline) and real (solid line) data events. The simulated events have been\ngenerated assuming breakup via the 5Heg.s.. Both spectra have been\nreconstructed for 6.3 MeV < 9Be Ex < 6.5 MeV and α2-n Erel >\n2.0 MeV.\nfor the excitation energy region around the state at Ex =\n2.43 MeV.\nPrevious attempts to distinguish between these channels\nhave not been successful [3,8,10]. Recently we have shown\nthat by looking instead at the angular correlation, a separation\nis possible [22]. This work confirmed the small (6%) branching\nratio to the n + 8Beg.s. channel and showed that the remaining\ndecay was primarily to the 8Be2+ channel.\nG. Breakup path for the other states below Ex = 4.0 MeV\nFor the energy region around the states at Ex = 2.78 and\n3.05 MeV, there are very few breakup events associated with\neither of these states. The poor statistics means that it is very\ndifficult to use any of the previous methods to distinguish\nthe 8Be2+ and 5Heg.s. breakup channels. Figure 13 illustrates\nthe α-α relative energy spectrum for breakup events with\nan excitation energy consistent with the 3.05-MeV state. To\navoid being overwhelmed with events from the state at Ex =\n2.43 MeV, an additional gate has been imposed excluding\n6Li events consistent with a kinematic locus defined by the\n2.43-MeV state.\n-n Relative Energy (MeV)1α\n0 1 2 3 4 5\nN\no.\n o\nf E\nve\nnt\ns\n0\n10\n20\n30\n40\nFIG. 12. Simulated α1-n relative energy spectrum for 8Be2\n+\nevents with 6.3 MeV < 9Be Ex < 6.5 MeV and α2-nErel >\n2.0 MeV.\nThe small number of events that lie above Erel = 0.2 MeV\nin Fig. 13 are suspected to be events associated with the 8Be2+\nand\/or 5Heg.s. breakup channels. Using this data it is possible\nto establish an upper limit on the breakup yield for the 8Be2+\nand 5Heg.s. channels.\nH. Results\nTable I lists the estimated branching ratio and corresponding\ndetection efficiency for states in 9Be up to Ex = 11.28 MeV.\nFor the states above Ex = 2.43 MeV, the events have been\nselected by gating on energy regions of 0.2 MeV approxi-\nmately centered on each state. To overcome the problem of\npoor statistics around the state at Ex = 11.28 MeV, an energy\nwindow of 0.4 MeV was used for this case. A branching ratio\nvalue has not been estimated for the state at 5.59 MeV. This\nstate’s event contribution is very small, and the number of\nevents in the energy region around this state are dominated by\nthe adjacent states. Given the large amount of overlap between\nthe states at Ex = 6.38 and 6.76 MeV, a combined branching\nratio has been quoted for both of these states.\nThe detection efficiencies have been determined using\nSIMSORT for the angular range covered by the detectors. The\nabsolute efficiency values given in Table I were determined\nusing isotropic center-of-mass breakup distributions. Although\nthese values are different if an anisotropy is used, their\nvalue relative to one another for a given breakup path\n(which ultimately determines the branching ratio) is relatively\ninsensitive to this change.\nTABLE I.\n9Be state\/\u0004Ex BCa \u0006(%)b BR (%)c\n1.684 MeV 8Beg.s. 0.5 100\n8Be2+ 2.8 0\n2.429 MeV 8Beg.s. 3.5 6 ± 1\n8Be2+ 2.5 94 ± 2\n5Heg.s. 2.7 <5\n2.780 MeVd 8Beg.s. 3.4 32 ± 15\n(2.7–2.9) 8Be2+ 2.5 < 69\n5Heg.s. 2.7 < 67\n3.049 MeVd 8Beg.s. 3.4 46 ± 20\n(2.95–3.15) 8Be2+ 2.5 < 55\n5Heg.s. 2.6 < 54\n4.704 MeV 8Beg.s. 3.3 16 ± 2\n(4.6–4.8) 8Be2+ 1.8 43 ± 20\n5Heg.s. 1.9 41 ± 20\n6.380 \/ 6.760\nMeV\n8Beg.s. 3.2 4 ± 1\n(6.3–6.85) 8Be2+ 1.5 7 ± 3\n5Heg.s. 1.1 89 ± 35\n11.280 MeV 8Beg.s. 3.2 3 ± 1\n(11.1–11.5) 8Be2+ 1.1 21 ± 8\n5Heg.s. 0.2 76 ± 30\naBreakup channel.\nbDetection efficiency.\ncBranching ratio corrected for detection efficiency.\ndMost events associated with the 2.43-MeV state have been removed.\n054605-6\nDECAY STUDIES FOR STATES IN 9Be UP TO 11 . . . PHYSICAL REVIEW C 76, 054605 (2007)\n Relative Energy (MeV)α-α\n0 0.2 0.4 0.6 0.8 1 1.2 1.4\nN\no.\n o\nf E\nve\nnt\ns\n0\n100\n200\n300\n400\n500\nFIG. 13. α-α relative energy spectrum for 9Be breakup events\nwith 2.95 < 9Be Ex < 3.15 MeV. Most events associated with the\n2.43-MeV state have been removed.\nErrors have been estimated for each branching ratio, and are\nprimarily based on the effect of overlapping adjacent states and\nour ability to distinguish the kinematic features associated with\nthe different channels.\nIV. DISCUSSION AND CONCLUSIONS\nGenuine 9Be breakup events have been identified and\nexcitation energy spectra have been reconstructed illustrating\nthe population of low-lying states in 9Be. The branching ratio\nof each breakup path has been estimated for states in 9Be up\nto Ex = 11.28 MeV.\nThe branching ratios calculated for Ex > 4.0 MeV have\nconfirmed that the 5Heg.s. breakup channel plays a significant\nrole as we move to higher energy and confirms the observations\nof breakup via 5Heg.s. made by Prezado [9], Soic´ [12], and\nNyman [11]. The values given for feeding to the 8Beg.s. are\nbroadly consistent with the values determined by Cocke and\nChristensen [5]. The large 5Heg.s. branching ratio for the energy\nregion corresponding to the states at Ex = 6.38 and 6.76 MeV\nis due to the 6.38-MeV membership of the ground-state (g.s.)\nrotational band. The 9Beg.s. is predicted to have a 5He +α\nstructure [14].\nThe branching ratio results obtained from the 2.43-MeV\nstate are discussed in Ref. [22]. For the other two states\njust above breakup threshold (Ex = 2.78 and 3.05 MeV),\nit has been shown that between 30 and 50% of events\npopulating these states decay to 8Beg.s., leaving the remaining\nevents to decay either via the 8Be2+ state or via the 5Heg.s..\nUnfortunately, there were not enough data to identify the\nrelative contributions for these two breakup channels. The\nbranching ratio estimate for the 3.05-MeV state to the 8Beg.s.\nseems small compared to the value given by Christensen and\nCocke (87 ± 13%), although not unreasonable. The method\nused to remove contaminating events from the state at Ex =\n2.43 MeV was only partially successful. The large uncertainty\ngiven for the 8Beg.s. branching ratio reflects this outcome.\nThe branching ratio estimate for the 2.78-MeV state to\n8Be2+\/5Heg.s. is consistent with Prezado’s remark [9] that a\nconsiderable contribution of the breakup does not go via the\n8Beg.s. for this state.\nThe present results compare favorably with theoretical pre-\ndictions as well as other experimental results. Descouvemont\n[15] calculated reduced widths for the three different channels\nusing a microscopic three-cluster model of 9Be for states with\na spin of up to 9\/2. The reduced width and the branching ratio\nfor a given channel are related by an unknown penetrability,\nthe calculation of which is not trivial for broad intermediate\nstates such as the 8Be2+ state and the 5Heg.s.. However, it can\nbe shown that the branching ratios do reproduce the theoretical\ntrend of these reduced widths.\nThe astrophysical implications of these new branching\nratios are unclear. For the astrophysically relevant states, with\nthe exception of the 2.43-MeV state, this work provides only\nupper limits for the 5Heg.s and the 8Be2+ channels. Although it\nis clear that a significant portion of the breakup yield for these\nstates does not go via the 8Beg.s., this may have little effect\non the ααn rate. Buchmann et al. [20] derived the population\ndensity for the three intermediate states over a temperature\nrange applicable to the site for the ααn reaction in a supernova.\nThe results indicate that the 8Be2+ state will not contribute\nsignificantly to the ααn rate.\nACKNOWLEDGMENTS\nT. A. D. Brown wishes to thank the EPSRC for the financial\nassistance received during the period this work was carried\nout. The authors are grateful for the technical and operations\nsupport provided by the staff at ANU.\n[1] S. Dixit et al., Phys. Rev. C 43, 1758 (1991).\n[2] D. Bodansky, S. F. Eccles, and I. Halpern, Phys. Rev. 108, 1019\n(1957).\n[3] J. Mo¨sner, G. Schmidt, and S. Schintlmeister, Nucl. Phys. 64,\n169 (1965).\n[4] P. R. Christensen and C. L. Cocke, Nucl. Phys. 89, 656\n(1966).\n[5] C. L. Cocke and P. R. Christensen, Nucl. Phys. A111, 623\n(1968).\n[6] H. Utsunomiya, Y. Yonezawa, H. Akimune, T. Yamagata,\nM. Ohta, M. Fujishiro, H. Toyokawa, and H. Ohgaki, Phys.\nRev. C 63, 018801 (2000).\n[7] K. Sumiyoshi, S. Goko, and T. Kajino, Nucl. Phys. A709, 467\n(2002).\n[8] B. R. Fulton et al., Phys. Rev. C 70, 047602 (2004).\n[9] Y. Prezado et al., Phys. Lett. B618, 43 (2005).\n[10] N. Ashwood et al., Phys. Rev. C 72, 024314 (2005).\n[11] G. Nyman et al., Nucl. Phys. A510, 189 (1990).\n[12] N. Soic´ et al., Europhys. Lett. 41, 489 (1998).\n[13] Y. Kanada-En’yo, H. Horiuchi, and A. Ono, Phys. Rev. C 52,\n628 (1995).\n[14] K. Arai, P. Descouvemont, D. Baye, and W. N. Catford, Phys.\nRev. C 68, 014310 (2003).\n[15] P. Descouvemont, Eur. Phys. J. A 12, 413 (2001).\n054605-7\nT. A. D. BROWN et al. PHYSICAL REVIEW C 76, 054605 (2007)\n[16] S. E. Woosley and R. S. Hoffman, Astrophys. J. 395, 202 (1992).\n[17] S. E. Woosley, J. R. Wilson, G. J. Mathews, R. D. Hoffman, and\nB. S. Meyer, Astrophys. J. 433, 229 (1994).\n[18] C. Angulo et al., Nucl. Phys. A656, 3 (1999).\n[19] L. V. Grigorenko and M. V. Zhukov, Phys. Rev. C 72, 015803\n(2005).\n[20] L. Buchmann, E. Gete, J. C. Chow, J. D. King,\nand D. F. Measday, Phys. Rev. C 63, 034303\n(2001).\n[21] P. Papka, SIMSORT (unpublished).\n[22] P. Papka et al., Phys. Rev. C 75, 045803 (2007).\n[23] F. Ajzenberg-Selove, Nucl. Phys. A490, 1 (1988).\n054605-8\n"}