{"doi":"10.1068\/a4338","coreId":"65155","oai":"oai:dro.dur.ac.uk.OAI2:6744","identifiers":["oai:dro.dur.ac.uk.OAI2:6744","10.1068\/a4338"],"title":"On (not) forgetting families : family spaces and spacings in Birzeit, Palestine.","authors":["Harker, C."],"enrichments":{"references":[],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2010-11-01","abstract":"This paper is a response to Valentine’s (2008) recent suggestion that the family is an absent presence within Geography. Persuaded by her argument, I explore other disciplinary approaches to theorizing families, and in particular how discursive appropriations of ‘the family’ and theories of family practices can enlarge our understandings of what families are and how they are done. I then argue that geographers can contribute to such studies by exploring the spaces and spacings that co-constitute family subjectivities. I put these ideas to work in the context of Birzeit, Palestine, where I argue particular family spaces and spacings offer more nuanced understandings of this place, which challenge limited discursive constructions of the ‘Arab family’ and the ‘Western family. I situate these theoretical maneuvers within broader geographies of intimacies, while arguing that there is still a great deal of work to be done to further spatialize our understandings of families","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65155.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6744\/1\/6744.pdf","pdfHashValue":"a545fab2b8c17842f056173b1bcab9015ec2ead4","publisher":"Pion","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6744<\/identifier><datestamp>\n      2012-01-17T16:32:17Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        On (not) forgetting families : family spaces and spacings in Birzeit, Palestine.<\/dc:title><dc:creator>\n        Harker, C.<\/dc:creator><dc:description>\n        This paper is a response to Valentine’s (2008) recent suggestion that the family is an absent presence within Geography. Persuaded by her argument, I explore other disciplinary approaches to theorizing families, and in particular how discursive appropriations of ‘the family’ and theories of family practices can enlarge our understandings of what families are and how they are done. I then argue that geographers can contribute to such studies by exploring the spaces and spacings that co-constitute family subjectivities. I put these ideas to work in the context of Birzeit, Palestine, where I argue particular family spaces and spacings offer more nuanced understandings of this place, which challenge limited discursive constructions of the ‘Arab family’ and the ‘Western family. I situate these theoretical maneuvers within broader geographies of intimacies, while arguing that there is still a great deal of work to be done to further spatialize our understandings of families.<\/dc:description><dc:publisher>\n        Pion<\/dc:publisher><dc:source>\n        Environment and planning A, 2010, Vol.42(11), pp.2624-2639 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6744<\/dc:identifier><dc:identifier>\n        issn:0308-518X<\/dc:identifier><dc:identifier>\n        issn: 1472-3409<\/dc:identifier><dc:identifier>\n        doi:10.1068\/a4338<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6744\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1068\/a4338<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6744\/1\/6744.pdf<\/dc:identifier><dc:rights>\n        C. Harker 2010. The definitive, peer-reviewed and edited version of this article is published in Environment and planning A, 42, 11, 2624–2639, 2010, 10.1068\/a4338<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0308-518x"," 1472-3409","issn:0308-518X","issn: 1472-3409"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n17 November 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nHarker, C. (2010) ’On (not) forgetting families : family spaces and spacings in Birzeit, Palestine.’,\nEnvironment and planning A., 42 (11). pp. 2624-2639.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1068\/a4338\nPublisher’s copyright statement:\nC. Harker 2010. The definitive, peer-reviewed and edited version of this article is published in Environment and\nplanning A, 42, 11, 26242639, 2010, 10.1068\/a4338\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nForthcoming, Environment and Planning A \n 1 \nOn (not) forgetting families: family spaces and spacings \nin Birzeit, Palestine. \nDr. Christopher Harker \nDepartment of Geography \nUniversity of Durham \nScience Laboratories, South Road, Durham \nDH1 3LE, UK  \ncgharker@gmail.com \nAbstract \nThis paper is a response to Valentine‟s (2008) recent suggestion that the family is an \nabsent presence within Geography. Persuaded by her argument, I explore other \ndisciplinary approaches to theorizing families, and in particular how discursive \nappropriations of „the family‟ and theories of family practices can enlarge our \nunderstandings of what families are and how they are done. I then argue that geographers \ncan contribute to such studies by exploring the spaces and spacings that co-constitute \nfamily subjectivities. I put these ideas to work in the context of Birzeit, Palestine, where I \nargue particular family spaces and spacings offer more nuanced understandings of this \nplace, which challenge limited discursive constructions of the „Arab family‟ and the \n„Western family. I situate these theoretical maneuvers within broader geographies of \nintimacies, while arguing that there is still a great deal of work to be done to further \nspatialize our understandings of families. \nForthcoming, Environment and Planning A \n 2 \nIntroduction \nKadeen: This is my younger brother here. \n \n[Pause to say hi]. \n \nKadeen: You were asking about my older brother?\n1\n \n \nMy recently completed research project in Birzeit, Palestine was initially conceived, even \nafter my first visit to the „field‟, as an investigation into different homes and mobilities. \nHowever, when I began my main period of field research, it quickly became apparent \nduring my participation observant and interviews that I needed, in some way, to reckon \nwith the concept of family too. People living in Birzeit constantly talked about their \nfamilies in relation to home spaces, and often the different mobilities that they enacted \nrevolved around living with or visiting family members. For instance, Khaled, a twenty-\nyear-old student, suggested he would only build a home when he wanted to get married \nand start a family. Haifa, a woman in her eighties, lived in Birzeit for roughly six months \nevery year. During the other six months, normally in the winter, she traveled between and \nstayed with her adult children‟s families in America and Canada. As my interview \ntranscripts – „[Pause to say hi]‟ – indicate to me now, by passing over family too quickly, \n                                                 \n1\n In this paper I draw on eleven months of ethnographic research (participant observation and interviews) \nconducted between 2005 and 2007 in the village of Birzeit, just north of Ramallah in the centre of the West \nBank. All participants have been given pseudonyms. Given the discussion of this paper, it is also important \nto state that due to social norms in this context, a great deal of my participation observation and many of \nthe interviews were conducted with men. Therefore a masculine perspective inflects the account of intimate \nrelations that I have produced here. \nForthcoming, Environment and Planning A \n 3 \nI was bracketing out a great deal. And as Valentine (2008) has recently noted, it was not \nthe first time a geographer has done this. \n \nIn this paper I want to think more carefully about the relationships between different \nspaces and families. I will argue that focusing specifically on interconnected family \nspaces (contexts, timings, relations, flows) and spacings (the processes through which \nfamily spaces emerge) nuances both understandings of how various geographies emerge \nthrough practice, and how families are inherently spatial. This argument is put to work in \nthe context of particular family discourses and practices in Birzeit, Palestine. I explore \nhow the resultant spaces and spacings offer a more complex understanding of the \nrelationships between Palestine, Palestinians and the Israeli Occupation rooted in \neveryday lives. I also argue that these analytic insights about family and families in \nPalestine can contribute to broader efforts to emphasize the collective and interrelated \nspaces of subjectivity. \nFamilies and geographies \nGiven the importance of families to the geographies I was interested in, I wonder now \nwhy it took me so long to recognize the role that these families played. Perhaps this \ninitial oversight could be explained by a lack of preparation on my part. Johnson‟s (2006: \n92) survey data suggests that over 50% of people in the central West Bank living in \napartments or attached dwellings share these residences with relatives (c.f. over 90% in \nsouthern West Bank and 80% in Gaza). She also points out that this data is consistent \nwith a previously conducted statistical analysis (in 1992), in which an average of 75% of \nhouseholds in multihousehold buildings across the West Bank and Gaza share the space \nForthcoming, Environment and Planning A \n 4 \nonly with relatives. These statistics demonstrate that there is a great deal of overlap \nbetween living spaces and family spaces in Palestine. Other researchers have also noted \nthe important role played by Palestinian families in processes of urbanization (Taraki \n2008), education (Rosenfeld 2004) and migration (Hilal 2006). \n \nHowever, while a lack of preparation for research is (perhaps) a common phenomenon, I \nthink in this instance there was another reason why it took me some time to grasp the \nimportance of family. As Valentine (2008: 2098) has recently suggested, the family as an \nobject of study remains something of an „absent presence‟ within the discipline of \ngeography. Simply put, families and family spaces have by and large not been the focus \nof much critical geographical attention in and of themselves\n2\n. They are usually in the \nbackground, playing a supporting role to a whole host of other geographies. To give two \nexamples: this is the case in feminist work on social reproduction and care that Valentine \n(Ibid: 2100-1) cites, and in non-feminist economic geographies where the family is \naggregated to household level income (e.g. Leinbach et al 1992, Moran et al 1996). Other \nsocial sciences such as Anthropology and Sociology have, by contrast, explored the \nconcept and practices of family extensively.  \n \nIn this paper I want to mine some of this extra-disciplinary scholarship for resources that \nhelp theorize some of the family practices and spaces I encountered in Birzeit. In taking \n                                                 \n2\n There are a few exceptions to this general tendency, and I cite most of them at different points in this \nessay. One study I do not cite elsewhere is Duncan & Smith‟s (2002) use of the national census to map \ndifferent family formations in the UK, which they quantify through the activities of partnering and \nparenting. Significantly, the heterosexual couple\/dependent housewife is the norm through\/against which \nthese measures are established. Their method is useful because it disrupts national and regionally based \nassumptions about family formations in favour of more situated local differences, although their system of \nmeasurement reinforces more „conventional‟ definitions of family. \nForthcoming, Environment and Planning A \n 5 \nan approach that explicitly chooses to continue working with concepts of family, I depart \nfrom Nash (2005) and Valentine (2008), who have both sought to broaden debates about \ncollective subjectivities and more-than-individual forms of engagement through concepts \nof geographies of „relatedness‟ and „intimacy‟ respectively. Both these arguments move \naway from focusing on family because of long-held suspicions about the power \nheteronormative family idea(l)s wield within contemporary social formations and \ndiscourses (see also Puar 2007), and their ability to homogenize and delegitimize \nmorally, socially and legally a wide variety of other intimate relations. Nash and \nValentine‟s interventions depart from normative scriptings of kin relations and destabilize \nhierarchies of belonging through recognizing and proliferating other forms of material, \nsocial and affective dis\/connection. While I am highly sympathetic to the political \nimpetus of such a maneuver, I think there is also a great deal to be gained from pausing, \nto more fully understand how family spaces and spacings are created, maintained, \nnegotiated and altered. Morgan (1996) suggests that proliferating forms of intimacy and \nindividualism over the past fifty years within the (implicitly) minority world contexts that \nform the backdrop of Nash and Valentine‟s arguments, have (perhaps counter intuitively) \nensured the resurgence of family as an important social concept, albeit one that is \npracticed in increasingly differentiated ways (see also Strathern 2005). As I will argue, in \nthe majority world\n3\n context in which I am working, families are one of the key ways in \nwhich people deal with highly uneven topologies of power, primarily life under \noccupation. Furthermore, I will argue that there are various moments of intersection and \n                                                 \n3\n In this essay I use the term majority world to refer to what is otherwise known as the Global South, where \nthe numerical majority of the world‟s population lives, and the minority world to what is otherwise known \nas Global North. Recognizing the limitations of these terms, I use them provisionally to indicate differential \npositionings in more extensive („global‟) topologies of power (see Nagar 2009). \nForthcoming, Environment and Planning A \n 6 \nfracture, where families in Birzeit trouble any easy and clear-cut separation between \nminority and majority worlds, even as they inhabit the spaces created by this distinction. \nWhile the work that has been done on families in other academic disciplines is extensive, \nthere is still a great deal of scope for more spatially attentive approaches. My attempt \nhere to begin unpacking some of the spatial „work‟ that family does, is therefore intended \nas a(nother) step in opening up some of the specific spaces and spacings that are both \nimplicated in and fundamental to families and family practices. Having thus argued for a \nmore sustained exploration of families, I nevertheless think that my approach, and \ngeographies of families more generally, can still contribute to the broader scholarly \nprojects that Nash (2005) and Valentine (2008) seek to advance. \n \nThe remainder of the paper will proceed in two parts. The first part builds on Valentine‟s \n(2008) summary of family focused work, in which she traces how feminist geographies \nof social reproduction, sociologists of risk, and geographies of caring (particularly \nchildcare) have all begun, implicitly or explicitly, to think through family spacings and \npractices. My aim is not to recapitulate her work but rather extend it by thinking about \nhow we might begin to theorize family. Therefore, I briefly examine some of the (often \ninterconnected) ways in which social scientists in disciplines other than geography have \nthought about families and „the family‟. This section explores how „the family‟ is \nproduced as a discursive object, how different families are practiced, and the connections \nbetween such practices and discourses. The second section of the paper puts these \nunderstandings of family to work in the context of my research in Palestine. This \napproach allows me to understand some of the family spaces and spacings I encountered \nForthcoming, Environment and Planning A \n 7 \nin Birzeit, and to argue for greater consideration of such spacings within theorizations of \nfamily. I also explore how working with a very particular set of intimate geographies can \nbroaden our understandings of living in Palestine, including the ways in which some \nfamily practices connect and shatter majority and minority worlds, and are means of both \nliterally and figuratively „getting by‟ (Allen 2008) the Israeli Occupation. \nDiscourses of ‘the family’ \nDiscussing geographies of sexuality, Valentine (2008: 2099) suggests that little work has \nbeen done on familial and other types of personal relationships by scholars working in \nthis area precisely because „a critique of traditional patriarchal and hetero-normative \nmodels of „the family‟ (e.g. Bell 1991; Bell and Binnie 2000) … has been a foundation \nof, and inspiration for, much feminist and queer writing within the discipline‟. „The \nfamily‟ in this case refers to a discursive production, or set of productions that establish a \nparticular set of norms about what families are and how they should be done. Examples \ninclude what Ong (1999: 143) terms „family romances‟, „the collective and unconscious \nimages of family order that underlie public politics‟ in Asia, which inform a whole series \nof intimate and governmental relations. Gillis‟ (1996: xv) phrase, the „imagined family \nwe live by‟, also emphasizes that such discursive norms are not only ongoing and \nconstantly reaffirmed achievements, but also extremely and extensively productive. \nFoucault (1978: 100), referring obliquely to Europe during the 18\nth\n and 19\nth\n century, \nsuggests that „the family organization, precisely to the extent that it was insular and \nheteromorphous with respect to the other power mechanisms, was used to support the \ngreat “maneuvers” employed for the Malthusian control of birthrate, for the populationist \nincitements, for the medicalization of sex and the psychiatrization of its nongenital \nForthcoming, Environment and Planning A \n 8 \nforms‟. Donzelot (1979) builds on Foucault‟s method to define the family „not as a point \nof departure, as a manifest reality, but as a moving resultant, an uncertain form whose \nintelligibility can only come from studying the system of relations it maintains within the \nsociopolitical level‟ (Ibid: xxv). Other work on productions of the family as discursive \nnorm has tended to focus on the national scale (Farrell 1999, Tadmor 2001), including \ngeographical studies of the ways family discourses emerge in relation to the nation vis-a-\nvis heteronormativity (Puar 2007, Oswin 2010), law and legal process (Martin \nforthcoming) and domestic and foreign policies (Cowen & Gilbert 2007). \n \nAcademic scholarship, as a set of discursive formations, has also produced „the family‟. \nOf particular interest in the context of my own research, Sherif-Trask (2006) has \nsuggested families in the Middle East are often homogenized through scholarly \ndiscourses of the „Arab‟, „Islamic‟ and\/or „Oriental‟ family, terms that are frequently used \ninterchangeably. These terms not only essentialize different Islamic or Arab contexts, but \nalso foreground culture or religion, and only culture and religion, as the conceptual lenses \nthrough which families are envisioned. Sherif-Trask argues that this staging can \nimplicitly lead to cultural\/religious determinism, which when juxtaposed with „Western‟ \nfamily studies and their focus on agency, functions as a form of Orientalist othering. \nNoting that there has been significant research on family planning and demography - both \nvenues for\/of biopolitical power – but little else, she opines that broader Orientalist \nframings of the Middle East may also promote the assumption that families in the Middle \nEast have been „understood‟ (since they are „static‟, „eternal‟, see Said 1978). Hence she \nForthcoming, Environment and Planning A \n 9 \nconcludes that if there is a scholarly field of study specifically about Middle Eastern \nfamilies, it is still in its infancy (although see Johnson & Joseph 2009). \n \nJoseph‟s (1993, 1999a, 1999b) work provides an exception to this more general critique. \nShe has written extensively about the ways in which a particularly powerful family norm \nis established in Lebanon, which she terms „patriarchal connectivity‟. This concept \nsignifies the ways in which age and gender are the basis for kinship mobilization, law, \nand forms of social understanding that create patriarchal privilege. The spatial context for \nJoseph‟s argument is important. She argues that „[i]n both scholarly research and popular \nculture, the centrality of family in the Arab world has been so axiomatic that there has \nbeen relatively little problematizing of the psychodynamics of family life‟ (1999a: 9). \nWhile she is interested in the cleavage between family discourses and family practices, \nshe also negotiates the interrelated problems of universal ideas of family that are \nimplicitly Western and ethnocentric, and the cultural relativist approaches that extend \nfrom and contribute to Orientalist processes of division. Patriarchal connectivity may be a \nconcept that travels, but it changes as it does so, and acquires specific meaning in the \nlives (and hence practices) of particular working class families (Joseph 1993) and \nbrother-sister relationships (Joseph 1999b) in Camp Trad, Lebanon. \n \nOne of the strengths of Joseph‟s ethnographic based approach, as with other \nethnographies of relatedness (for an overview see Franklin & McKinnon 2001; Carsten \n2000, 2004; Parkin & Stone 2004, and within geography Nash 2005, Power 2008) is that \nit is able to show how family normative discourses are sometimes extended, sometimes \nForthcoming, Environment and Planning A \n 10 \ndisrupted through particular sets of material practices. Joseph‟s work is notable for \nexploring how normative family discourses are themselves re\/produced through sets of \npractices in addition to discursive statements (to the extent that these can be \ndisentangled)\n4\n.  \nFamily practices \nJoseph‟s work and many other recent kinship studies overlap with recent sociological \napproaches to studying families. Within this literature, Morgan‟s (1996, 1999) work on \nfamily practices has been important. Morgan (1999:16) suggests that we need to think \nabout family as an adjective or a verb rather than a noun - something that is continually \ndone - and so he uses the term family practices. The addition of the term „practices‟ \ncaptures the dynamic, active ways in which families continually perform themselves, in \ndifferent social contexts. He suggests that exploring practices allows researchers to \njettison preconceived notions of what families are, and instead look at the everyday, \nsituated, routine (and I might add ritualistic) ways in which different families are done \ndifferently. While this method doesn‟t seek to establish how family norms are produced \n(at least as outlined in Morgan 1996, 1999), it nevertheless recognizes that family \npractices are situated in and take place through more temporally and spatially extensive \nsocial discourses around the family. Morgan‟s approach not only establishes family as an \nimportant practice to study in its own right (and not simply as a derivative of processes \nsuch as immigration, home-making, gender relations), but also responds to the ways in \n                                                 \n4\n Ong‟s (1999) work on transnational Asian migrant families also focuses on this, although it is significant \nthat many scholars who have subsequently built on this work focus on experiences of transnationalism \nrather than family practices (although see Waters 2002). \nForthcoming, Environment and Planning A \n 11 \nwhich the term family has endured and is still meaningful as a description of quite \ndifferent ways in which kinship relations are done.  \n \nMorgan‟s concept of family practices has been embraced, extended and specified in \nstudies of working at home (Seymour 2007), sibling practices (Edwards et al 2006), and \ndisplay, or the ways in which practices of family are not only done, but to different \nextents are required to be recognized (made meaningful) as family practices by others \nand the families themselves (Finch 2007). Geographers have also begun to use this work \nto think about the ways in which young people come out as a member of a family and a \nprocess that families experience to a certain extent collectively (Valentine et al 2003), \nand the production of particular transnational migrant spaces by families (Waters 2002). \nThese approaches focus on families in their various heterogeneous contexts rather than \n„the family‟, which by its nature as discursive norm seeks singularity. However, many of \nthese studies do recognize the pervasiveness of discursive norms about family, while \nseeking to hold these norms in tension with more varied sets of practices.  \n \nAnthropological and Sociological studies offer a means of theorizing families as dynamic \nmaterial and affective social formations that emerge from intersecting discursive \nformations and situated practices. It is clear that space is very important in many of these \nstudies, although usually this is implicitly so. Family discourses and practices not only \nvary across space, but are themselves inherently spatializing. I therefore use the terms \nfamily spaces - the formations, relations and flows that manifest and are manifested by \nfamilies - and family spacings - the processes through which family spaces emerge – to \nForthcoming, Environment and Planning A \n 12 \nforeground the importance of space in discursively infused practices of family. These \nterms (family spaces and spacings) are heuristic, analytically separating things that are \nthoroughly and inextricably intertwined. In the following section I put them to work and \ndevelop them in the context of Palestine, and particularly my own ethnographic research \nin Birzeit. \nFamily spaces in Birzeit \n„The family‟ in Birzeit, and Palestine more broadly (Johnson 2006), is discursively \nfabricated in two interrelated ways. The first way is as ‘a’ila, the nuclear or „small‟ \nfamily (or what kinship studies refers to as lineal descent group), discursively produced \nas father, mother and children (always plural). The second way is as hamula, the \nextended or „big‟ family (kinship studies: „a patronymic group often made up of several \npatrilineages‟ (Johnson 2006: 62)), discursively produced as countless cousins, aunts and \nuncles. These understandings, used and reproduced by people I met in the village, have \nan extensive lineage that shapes their meaning in this particular context. Kimmerling and \nMigdal (2003) suggest that powerful landowning families (hamula) dominated economic \nand social life in the Levant during the Ottoman era. After the nakba in 1948, the \nJordanian and Egyptian administrations that controlled the West Bank and Gaza Strip \nrespectively, reinforced and reinvigorated hamula identification in an attempt to \ndelegitimize and weaken nascent Palestinian nationalism. This practice was continued \nand intensified by Israel after 1967, when Israel occupied the West Bank and Gaza Strip \n(Kanaaneh 2002, Hilal 2006, Gordon 2008). The Israeli Occupation also tied this system \nof (attempted) control to specific spaces – villages – through the creation of Village \nLeagues in 1978, which offered the male heads of particular families (hamula) „truncated \nForthcoming, Environment and Planning A \n 13 \nleadership roles‟  (Gordon 2008:112). However, these efforts to promote a hamula-based \nmodel of colonial spatial governance that suppressed nationalist sentiment were largely \nunsuccessful, and were formally abandoned in 1987 when the first intifada (uprising) \nbegan and Palestinian national identity superseded local-based affiliations. In the wake of \nthe first intifada, the discursive construction of family as hamula remained a key issue, \nparticularly at the Oslo negotiations.  \n \nIn discussing the modalities of return, a key definitional problem cropped up \nwhich remains unresolved to this day, that is, what constitutes a „family‟? Israel, \nfor example, insisted that „family‟ implies a nuclear-type family, and for the \npurpose of family unification the children must be below the age of 16, whereas \nthe Palestinian negotiators stressed that according to Arab culture and practice, a \nfamily encompasses immediate and extended members. It is clear that each \ndefinition impacts the number and category of displaced family members, if and \nwhen they are allowed to return home. (Zureik 2001: 219). \n \nThe definition of what constitutes a (Palestinian) family continues to have a profound \nimpact on Palestinian mobility regimes, particularly since the discontinuation of the \nfamily reunification process at the start of the second intifada (Abu Zahra 2006, 2007). \nThe fragmentation of Palestinian spaces in the Occupied Territories since the Oslo \nAccords (1993), which intensified after the beginning of the second intifada (2000), has \nalso increasingly enforced new forms of local practice and localism (Johnson 2006: 54). \nThis spatial fragmentation, coupled with increasingly ineffective governance by the \nForthcoming, Environment and Planning A \n 14 \nPalestinian Authority and increasingly acute economic deprivation, leads Hilal (2006) to \nsuggest that the Palestinian family has acquired a new importance as one of the main \nsocio-economic support systems in the Occupied Territories at the present time.  \n \nThere are also a series of tensions emerging between discourses of the „modern‟ family \n(‘a’ila ) where less children are seen as an economic advantage, and desires for a large \nnumber of children that fit within a broader demographic-nationalist discourse of \nPalestinians outnumbering Jewish Israelis within the borders of Mandatory Palestine \n(Kanaaneh 2002). Ideas around familial modernity in similar contexts are intimately \nintertwined with state policies and more extensive transnational ideas and practices of \nconsumerism (Kanaaneh 2002, Ghannam 2002). However, in the context of the Occupied \nTerritories where the Palestinian Authority only has a limited ability to govern - what \nWeizman (2007: 155) terms „prosthetic sovereignty‟ – consumption of education, \nconsumer goods and „lifestyle‟ practices plays a much more prominent role in articulating \nmodernity (Taraki 2008). This is particularly the case in the Ramallah region, due to both \nits „liberal‟ history (Taraki & Giacaman 2006) and the post-Oslo influx of both \nPalestinian returnees and foreign companies and NGOs to the increasingly de facto \n„capital‟ city (Taraki 2008). This influx has been augmented by internal migration within \nthe West Bank towards Ramallah, and continued emigration to other countries (Hilal \n2006), something I discuss more fully in the context of Birzeit later in this section. \n \nThese temporally and spatially more extensive discursive fabrications provide a context \nfor understanding contemporary discourses, practices and spaces of family in Birzeit. The \nForthcoming, Environment and Planning A \n 15 \nlocal village historian, Anis, told me that since 1730, Birzeit was comprised of four \nhamula, although at an unspecified later date, divisions within the biggest hama’il created \nsix in total. This discourse of Birzeit families is tied directly to space, and in particular, \nthe Old City. The Old City is an area of town that is considered the centre of Birzeit. All \nthree churches, the municipal buildings, the UNRWA girls‟ school, the old Birzeit \nUniversity campus adjoin it, and the largest mosque is also nearby. The Old City itself \nmainly consists of a series of two storey stone houses, some of which were first built in \n1600 according to Anis. Members of each hamula built adjoining houses, to form a hosh \nor courtyard, which in most cases had one entrance creating a shared and exclusive space \nfor those particular residents. Thus, the hamula is quite literally written into the space of \nthe Palestinian built environment. Many of these buildings in the Old City are now \ndeserted, although some have been renovated and\/or sold to refugee families and rented \nto students. Despite the fact that in many cases these properties have been unoccupied for \ntwo generations, a number of younger males who I befriended during my research took \nme to the Old City to show me their family home. Hence while unoccupied, these family \nspaces were nevertheless still vital for making present and future claims to territory, \nbelonging and identity (see Harker 2009a). \n \nAlthough many of the village residents no longer live in the Old City, many extended \nfamilies remain in close spatial proximity to one another. While this is in many cases \nthrough single-family homes built adjacently to one another, there are also a number of \napartments or attached dwellings that house many relatives from one family. Anis, for \ninstance, lives with his wife and five children on the top floor of a four-storey building, \nForthcoming, Environment and Planning A \n 16 \nwhich is jointly owned by Anis and his three brothers. Each brother owns a floor in the \nbuilding\n5\n. While such buildings allow extended families to live together, the single-\nfamily apartments also indicate the increasing importance of the ‘a’ila (see Johnson \n2006: 94). In other words, the (discourse of the) „small‟ family has become increasingly \nimportant precisely because of the changing ways in which house and home are \nmaterialized and practiced. While this claim is the product of contemporary narrations of \nhistory by people I talked to in Birzeit, Doumani (2003) has argued in the context of mid \n19\nth\n century Cairo that historically, ‘a’ila may have been more prevalent than other types \nof family formation due to short life spans, high infant and child mortality, and \ndislocations caused by the state. While I was not able to trace the shifting relations and \nspaces dis\/connecting ‘a’ila and hamula in Birzeit over time, I am able to say something \nabout how these relations inform contemporary imaginaries and how they were manifest \nat the time of my research. In particular I want to focus on how these interconnected \ndiscourses of family played out in summer 2006. \n \nBirzeit, like many of the other villages that surround Ramallah, is partly constituted by \n„villagers‟ living in other countries (Kartveit 2005, Hilal 2006). Some of these people \nhave been displaced, many have emigrated and can be considered diaspora, and others \ncirculate between Birzeit and other spaces. Haifa, the eighty-year-old woman I mentioned \nearlier who lives in Canada and the US for six months each year, is an example of the \nlatter type of villager. Hanna, a man in his sixties, grew up in Birzeit but was studying \n                                                 \n5\n The widespread building of houses and apartments by male „heads‟ of family (‘a’ila) for their sons in \nBirzeit is one form of family spacing that indicates Joseph‟s (1993) concept of „patriarchal connectivity‟ \nhas a great deal of analytical purchase in this context. However, the primary empirical focus of my research \non homes and mobilities prevents me from making this claim more concretely and confidently. \nForthcoming, Environment and Planning A \n 17 \nabroad in 1967, and therefore never received a West Bank ID\n6\n. He lived in a Western \nnation\n7\n for long enough to acquire a Western passport and at the time of my research \nspent three months at a time living in Birzeit on a tourist visa. He would then move, with \nhis wife and two young children, to another Arab nation for three months. This was \nfollowed by another three months in Birzeit and then three months in Europe. A twenty \nsomething male who introduced himself to me as Charlie, but was called Khaldun by at \nleast one older male relative, lived in Chicago and visited Birzeit for three months every \nsummer with his younger brother and sister, mother and father. These types of movement \nwere common, as was the suggestion that half of the village lived „outside‟ (i.e. \nelsewhere). While there were a number of visitors\/returnees in Birzeit during my first \nvisit to Birzeit in summer 2005, the flows of people and things to the village were \nparticularly large in 2006 because of the Birzeit Society convention. The Birzeit Society, \na diaspora organization based in the US (with one chapter in Canada) holds biennial \nconventions, usually in US cities. However, in 2006, the event was held in Amman and \nBirzeit (one week in each place). Hilal (2006: 193) suggests that Palestinian diaspora \nassociations „are formed to keep alive traditions that in some cases have been abandoned \nin the home communities‟. While this may be true to some extent, the Birzeit Society also \nmaintained active socio-economic links with the village, providing scholarships to Birzeit \nUniversity and funds for municipal purchases (a fire engine and water meters), in \naddition to the practice of visiting in the summer.  \nSpacing families in Birzeit  \n                                                 \n6\n Palestinians who want to live in the West Bank must have an ID. These are issued by Israel, which \ncontrols the Palestinian population register. Very few Palestinians born outside the West Bank are granted \nsuch IDs. See Makdisi (2008). \n7\n I use this deliberately vague term to protect „Hanna‟s‟ confidentiality.  \nForthcoming, Environment and Planning A \n 18 \nWhile there are many ways in which family is practiced in Birzeit, I argue that the \nsometimes occasional and intermittent, sometimes more extensive flows of people, things \nand knowledge across transnational spaces are particularly important in this place. In \nwhat follows I focus on one particular example to illustrate some of the family spaces and \nspacings that make Birzeit a distinctively transnational place. In this regard Birzeit is \nsimilar to many Palestinian towns and villages, particularly in the Ramallah region \n(Kartveit 2005, Taraki 2008). There has been a great deal of emigration from the \nOccupied Territories, much of which is motivated by the hardships of living under the \nIsraeli Occupation, including inter alia physical and social insecurity, movement \nrestrictions, high rates of unemployment and economic suffocation (Hilal 2006). \nHowever, as Hilal (2006) notes, destination, class, education, age and gender do produce \ndifferential geographies of Palestinian emigration. The context of the Occupied \nTerritories is also very different from the links between transnational mobility and place \nthat emerge in spaces of Palestinian refuge, for example Shatila refugee camp in Lebanon \n(Peteet 2005). Thus, working closely within and through particular family practices that \nemerged in Birzeit both demands and promotes attentiveness to the heterogeneity of \nPalestinian space, within (Taraki & Giacaman 2006) and beyond the West Bank (Peteet \n2005). This heterogeneous rendering of Palestinian space, while commonly found in \nanthropological studies, is rare in geographical scholarship, particularly geopolitical work \n(Harker forthcoming). \n \nKadeen Rahal, a young man in his late 20s, grew up in Birzeit. After secondary school he \ndid an undergraduate degree in the US, and in summer 2006, had just completed his first \nForthcoming, Environment and Planning A \n 19 \nyear in medical school, also in the US. He returned to Birzeit that summer for a two-\nmonth holiday. His older brother, who was „visiting‟ Birzeit that summer, also lived in \nthe US. His parents and two younger siblings lived in Birzeit throughout the year. \nKadeen‟s mobility abroad to study, enabled by an American passport, is a consequence of \na series of family practices extending back three generations.  \n \nI got it [a US passport] from my dad. See my grandma was born over there. She \nwas born in Memphis, Tennessee in 1917. See my great grandpa, he migrated to \nthe US around 1900. He went there and worked for fourteen years I think, for \ntwenty years, and I think he came back with fourteen thousand dollars. That was a \nlot of money at that time. So my grandma was born over there. She had the \ncitizenship, she gave it to my dad, and he gave it to us.\n8\n \n \nKadeen‟s movement is not just the function of his great grandfather‟s emigration to the \nUS, but also his grandmother and father‟s ability to transfer their citizenship status to \nhim. While passports function as one of the technologies that allow states to control \nmovement through the production of individualized non\/citizen subjects (Torpey 2000), \nKadeen‟s passport can also be thought of as a family technology, that facilitates a \ncontinued family spacing that stretches across three generations and between different \nparts of the US and Palestine. I argue that the passport is therefore a constitutive part of \nthis particular family. It is not possible to think about the Rahal family without reference \nto this particular material-semiotic object. This understanding of family builds on Nash‟s \n                                                 \n8\n My interview with Kadeen was conducted in English, outside a local restaurant in Birzeit on 15th July \n2006. \nForthcoming, Environment and Planning A \n 20 \n(2005: 459) argument for „understandings of relationality that expand the meaning of the \nsocial to include objects, entities, institutions, and technologies of all kinds in complex \nnetworks and in continuous processes of co-emergence‟ (see also Sheller 2004). \n \nKadeen told me that he intends to stay in the US for a few years after receiving his degree \nto specialize and save money. He then intends to return to Birzeit to live and get married. \nIn this regard, Kadeen‟s movement fits within broader patterns of Palestinian migration. \n„The general motive for most Palestinians in crossing borders has not been to change \ntheir lifestyle, customs or identity, but rather to improve their life chances‟ (Hilal \n2006:190). Hilal (2006: 195-6) goes on to suggest that Palestinian emigration is a \n„household enterprise‟. While, as I have suggested, the house and the family map on to \neach other very closely in the Occupied Territories, the role Kadeen‟s generationally-\nextended family (i.e. his great-grandfather whom he never lived with) played in his \nmigration lead me to insist on thinking Palestinian emigration as family, rather than \nhousehold, enterprise.   \n \nKadeen‟s distributed and circulating family spacing is manifested in his everyday life in \nthe US. \n  \nMe: Do you ever see any of your family [in the US]? \nKadeen: Yeah, I see them. I have some relatives in Columbus actually. I see them, \nsometimes every week, ten days, two weeks. I‟ve been twice to Cleveland in the \nlast year. \nForthcoming, Environment and Planning A \n 21 \nMe: Do you have family there? \nKadeen: Family no. Just some friends from here. \nMe: So that must be nice having family and friends. \nKadeen: Yes, it‟s always nice having somebody close to you, you know.  \n \nIn the moment quoted above, Kadeen chooses to interpret (my use of) the word „family‟ \nas referring to hamula. While the English word family was used, even in Arabic, despite \nthe linguistic distinction between ‘a’ila and hamula, these forms of relatedness bleed in \nto one another (Johnson 2006: 94). Familial relations are also intertwined with other \nforms of intimate relations, in this case, Kadeen‟s relations with his friends. This slippage \nbetween family and friends is captured by the concept of qaraba, or closeness, prevalent \nin a number of Palestinian and other Arab contexts (see Johnson 2006: 76-7, Ghannem \n2002). The use of „the vocabulary of kinship to establish [broader] social relationships \nand social worlds‟ (Johnson 2006: 77) was certainly a feature of everyday life in Birzeit. \nOne spatial manifestation of a social world that circulates through both Palestine and the \nUS, combining familial and non-familial relations, is Kadeen‟s living space in the US9. \n \nMe: Do you mind me asking who your roommates are? \nKadeen: No, that‟s fine. Last year I lived with my, a classmate mate of mine who \nwent to school with me here. \nMe: Here in Birzeit? \n                                                 \n9\n Significantly, materializations of homes are one of the ways in which family and friends do remain \ndistinct social categories in Birzeit itself. \nForthcoming, Environment and Planning A \n 22 \nKadeen: No, in Ramallah. So we were classmates, and he did his undergrad over \nthere, so we lived together. And his younger brother was a freshman, so he came \nover, he joined us. So now the older brother graduated and he found a job in \nFlorida, so he‟s moving over there, so it‟s going to be me and the younger brother. \nMe: So are they from here? \nKadeen: They‟re from Ramallah yeah. \n \nI argued earlier that families in Birzeit are frequently imagined and practiced as closely \nproximate. While Kadeen is not able to maintain this close spatial proximity with his \n‘a’ila for most of the year, he is nevertheless maintains close proximity with relatives \n(hamula) and friends while in the US. His summer visit to Birzeit is another way of \npracticing proximity, albeit over a shorter period of time than most other families. While \nhe cited the economic benefits of working in the United States after graduating („they pay \nbetter over there‟) and the difficulties of traveling between Palestine and the US („it was a \nhassle‟) as reasons for not visiting more, his situation was far from unusual when \ncompared with other Birzeitis who live „outside‟ Palestine for part or all of the year. Both \nof these reasons for not visiting more also gesture towards the broader context of the \nIsraeli Occupation, and the impacts it has on restricting movement into, out from and \nwithin the West Bank (Makdisi 2008, Harker 2009b) and de-developing the Palestinian \neconomy (Roy 2007, Gordon 2008). Thus, Kadeen‟s family spacings „inside‟, „outside‟ \n(the Occupied Territories), and between those spaces, are also in part co-constituted by \nthe Israeli Occupation. \nForthcoming, Environment and Planning A \n 23 \nHow an American model home was built in Palestine \nThe Rahal home, Kadeen‟s primary family space in Birzeit, is also a product of \ncirculation between Palestine and the US. \n \nKadeen: You know we built our house, we got the map from the US, based on the \nmodel homes. So we got the platform of the house from there. Then we had an \narchitect over here who took charge. So basically it‟s an American style house, \nbut it‟s made out of rocks not wood. So we have four bedrooms, one master, three \nbedrooms. We have two and a half, three bathrooms. We have a living room, \ndinning room, a visitors‟ room and a kitchen.  \nMe: So you got the architect from Palestine but the plan from the States? \nKadeen: Yeah, the floor plan. \nMe: Was it you dad that built the house? \nKadeen: Yeah.  \nMe: Do you know where he got the plan from? \nKadeen: Yeah, do you know in the US they have these books for the model \nhomes? \nMe: Oh, do they? \nKadeen: Yes. We got it from there. \nMe: Is it literally a book that tells you how to build the house? \nKadeen: It tells you the platform for the house, the different measurements. \nMe: Do you know what it was like adapting, presumably that was suppose to be \nfor wooden building? \nForthcoming, Environment and Planning A \n 24 \nKadeen: I„m sure it was a hassle, but the architect did a good job. \n \nKadeen‟s family (‘a’ila) live in an American model home in Birzeit. The house is a \nmaterial embodiment of way in which the Rahal family has been practiced across and \nthrough particular transnational spaces. The house is not simply a space of family (i.e. a \nspace where the Rahal family live, eat, sleep, etc), but also a family spacing, emerging \nfrom the circulation of particular family subjects and knowledges between the Birzeit and \nthe US, and constitutive of the Rahal family. While the house, like many others in \nBirzeit, is a form of conspicuous consumption and demonstration of being modern that \ndraws on knowledges of a particular (US\/Western) elsewhere (Taraki 2008), it is also \nimportant to note that the house was built not from wood but stone. Stone is historically \nthe most commonly used building material in Palestine, and many Birzeit residents \nfrequently expressed concerns about living in a wooden house. As Kadeen noted, „I feel \nhomes are safer over here [in Palestine]. They‟re not as easy to break through as the \nhomes over there [in the US]… The wood is easier to burn, but stones don‟t [burn]‟. The \nRahal family home is one example of how „“imported” items are assembled into a social \nfield that has its own logic‟ (Taraki 2008: 63). Hence the Rahal family home, a distinctly \ntransnational family space and spacing, fits within what Taraki (2008:75) identifies as a \nnew urban middle class ethos in and around Ramallah.  \n \nThe new ethos of the urban middle class in Palestine entails the elaboration and \namplification of new, modern concepts of the ideal home and community, \ndomestic life, parenting, and selfhood. These are exemplified by the “villa,” \nForthcoming, Environment and Planning A \n 25 \nsuburbanization, the conversion of the home into a learning and entertainment \ncenter, parents‟ commitment to the instruction of children in the arts of \ndistinction, self-improvement through fitness and the arts, only to name a few. \n \nWhile a modern ethos is being articulated and negotiated in many contemporary Arab \ncities (see for example McMurray 2001, Ghannam 2002, Deeb 2006), the emergence of \nthis ethos in the centre of the West Bank is also quite distinct. Investment in living spaces \nas a form of conspicuous consumption has become one of the key avenues for this \nprocess in the Ramallah area, because the Israeli Occupation has blocked off many other \navenues for social and spatial advancement (Hilal 2006, Taraki 2008).  \n \nThe Rahal family‟s transnational spacing offers at least two further analytical insights. \nFirstly, the mobilities of Kadeen‟s family pose significant challenges to bounded \ndiscursive constructions of the „Arab family‟ and also, simultaneously, the „Western \nfamily‟ (Sherif-Trask 2006). The flows of people, objects and knowledges that constitute \nand are embodied by the Rahal family, do not easily fit within the spaces of the majority \nworld to which Palestine and Palestinians are usually assigned. The Rahal family‟s \nAmerican model home built in Palestine, highlights the connections that exist between \nthe US and Palestine, or more broadly minority and majority worlds. This family space \nand spacing challenges the division of worlds into categories of minority and majority (or \nglobal North and South). As a counter point to this spacing, there are also a whole range \nof shatter zones, where minority and majority worlds are cleaved apart and disconnected. \nSuch cleavages are also revealed by particular family spacings, such as the earlier \nForthcoming, Environment and Planning A \n 26 \nexample of Hanna, a man born in Birzeit, but forced to leave the village every three \nmonths because he didn‟t have a West Bank ID.   \n \nSecondly, the spacings and spaces of the Rahal family can enliven our understanding of \nthis particular place. Palestine has become a place that is known in very specific ways, \nprimarily through occupation, violence and death (Kelly 2008, Harker 2009a, Harker \nforthcoming). However, as Allen (2008: 457) points out, the routinized violence of the \nIsraeli Occupation does not control processes of Palestinian subjectification. \n \nThe kind of agency expressed by most Palestinians was neither military resistance \nto occupation… nor organized resistance to the prevailing political power of the \nPA or social norms of nationalism. The kind of agency entailed in practices \nwhereby people manage, get by, and adapt was simply “getting used to it.”  \n \nIn this context, getting by includes practices of education (Rosenberg 2004, Harker \n2009b), urbanization (Taraki 2008, Harker 2009a), different forms of mobility \n(Hammami 2004, 2006, Hilal 2006, Harker 2009b) and in\/security (El Haddad 2008). \nOften these forms of getting by are not simply enabled by family, but are themselves \nfamily practices and spacings. Kadeen‟s migration and education are intended to produce \na better future in Birzeit, and can be viewed as a way of dealing with the economic \ndeprivation in Palestine, caused in large part by the Israeli Occupation. This ability to get \nby the Occupation emerges, in part, from Kadeen‟s enrollment in a series of family \nForthcoming, Environment and Planning A \n 27 \nspaces and spacings, including his passport, which I have argued is a family technology, \nand a family-home space that circulates between Palestine and the US. \n \nMore broadly, this case study is one example of a spatial story about Palestinian lives and \nthe ways in which they „go on‟ under conditions of occupation. Such accounts form a \ncounterpoint to discussions around „bare life‟ (Agamben 1998, 2005), and the \ndangerously reductive power of tying similar analyses, repeatedly, to particular spaces \n(Robinson 2003). These „ordinary‟ Palestinian spaces (Stewart 2007) are valuable \nbecause they are not reducible to the Israeli Occupation, even though they can only be \nunderstood in relation to the „extraordinary‟ (Kelly 2008). While many aspects of \nKadeen‟s life are interwoven with practices of occupation, other aspects such as the \nmigration of his great-grandfather to the US – a key moment in the Rahal family‟s \ntransnational spacing – exceed the occupation both temporally and causally. Focusing on \nfamilies allows for a more nuanced account of Palestinian spaces and spacings, in which \nPalestinians themselves are, to paraphrase Mahmoud Darwish (2002), more than just \nheroes or victims. These geographies also foreground moments of spatial connection and \nintimacy that are opposed to the punitive, bellicose and distanced relations that emerge \nfrom contemporary Oriental discourses (Gregory 2004). \nConclusion \nAttending to family spaces and spacings in Birzeit has been vitally important for me as I \nseek to understand some of the dynamic social relations that perform home (Harker \n2009a), im\/mobility (Harker 2009b) and place in this context. In the context of this paper, \nthere are two broader points that I would like to draw out in conclusion. Firstly, I would \nForthcoming, Environment and Planning A \n 28 \nlike to reiterate that working with family has been important when trying to understand \nmany of the geographies I encountered in Birzeit, including the large number of people \nvisiting in the summer, or the different types of houses in the Old City and in other parts \nof town (e.g. Rahal family home). Working with families in Birzeit afforded me a \nparticular way of understanding Palestinian transnational migration and broader \nprocesses of urbanization in the Ramallah region. Studying specific family practices has \nalso moved the focus of my analysis beyond the space of the nation, which characterizes \nmany existing geographical studies of family (Puar 2007, Cowen & Gilbert 2007, Martin \nforthcoming), towards geographies that are both more local and transnational. \n \nI argued that the family is discursively constructed in Birzeit as ‘a’ila and hamula, and \nthese discursive constructions emerge from discourses that are more extensive in both \ntime and space. However, despite their long history, these ideas of family are \nnevertheless a very contemporary (re)production, revivified in the face of extreme forms \nof socio-economic security created in the main by the Israeli Occupation (Hilal 2006), but \ncrucially, not reducible to this context. These forms of relatedness are also spatially \nproduced, by living in closely proximate dwellings. However, in practice these normative \nforms and spaces of relatedness are disrupted in a number of different ways. For example, \nsome of the nuclear families I met in Birzeit, including the one I lived with and the family \nof my translator, consisted of only a mother and her children. While the imprisonment of \nmen by the Israeli Occupation Forces can often be a common cause of fatherless families \nin Palestine (Rosenfeld 2004), in both of the cases mentioned above heart disease claimed \nthe fathers‟ lives. \nForthcoming, Environment and Planning A \n 29 \n \nSimilarly, there were many examples of how actual family spaces did not conform to \nbroader norms. For instance, while Anis lives in a four-floor building that is co-owned \nwith his three brothers, the rest of the apartment building remains uninhabited. While \neach brother intended to live on one floor, two of his siblings live in Jordan because they \ndon‟t have West Bank IDs. His other brother lives in Birzeit, but in a high-rise building \ncalled the Spanish Apartments. The Spanish Apartments is a multistory building \ninhabited mainly by young couples with children: ‘a’ila who are not part of the same \nhamula. The Spanish Apartments is an example of a family space, or set of family spaces, \nthat differs from the more commonly and extensively produced familial spatial relations \nin Palestine (see Harker forthcoming).  \n \nSecondly, the ways of doing family that I have discussed in this paper, regardless of the \nextent to which they conform to or diverge from the interconnected discursive norms of \n‘a’ila and hamula performed in closely proximate spaces, are significantly different from \nthe practices that emerge in minority world studies of intimacy and relatedness, which \ntend to focus on recombinant families, new reproductive technologies and queer families \n(Strathern 2005; Franklin & McKinnon 2001; Carsten 2000, 2004; Parkin & Stone 2004). \nIn the previous section, I suggested some of the family spacings explored in this paper \nboth challenged a minority-majority division of space, and helped to illustrate how such a \ncleavage is produced. I think it is possible to argue, as Sherif-Trask (2006) has, that \nacademic studies of family are another means through which such the majority-minority \ndivision is produced. It is therefore important to situate the different foci of different \nForthcoming, Environment and Planning A \n 30 \nfamily studies within transnational power topologies of scholarship. While doing this can \nfacilitate critique of Western theorizing, I think it may also be productive to explore how \nthese different analytical foci travel, and how they themselves are changed in the course \nof such an analytical maneuver (Robinson 2003). For instance, the language of „families \nof choice‟, used most frequently to discuss same-sex intimacies in minority world \ncontexts (e.g. Weeks et al 2001), has very different implications when transferred to \nPalestine, and the social and economic inequalities that exist there largely as a result of \ncolonial occupation. Likewise, the role Palestinian family spaces and spacings play in \nhelping people „get by‟ could be further explored in minority and other majority world \ncontexts.  \n \nWhile analyzing nuclear families carries with it the danger of reaffirming or naturalizing \nparticularly powerful (and thus pervasive) discursive norms around intimate relations, the \npervasiveness and power of these relations, and their intersections with a range of more \nor less non\/normative family practices provide a reason why it is important to not simply \noverlook or forget such families. At the same time, the ways in which many of the \nfamilies I encountered in my research spill beyond the borders of these norms contributes \nto efforts by scholars such as Nash (2005) and Valentine (2008) to think further about \ndifferent spatial subjectivities that exceed the individual. Putting this into practice by \nworking with families has not been easy. During my field research I largely conducted \ninterviews with individuals, which are then reproduced here and certainly colour my \naccount. While the traces of family remain in my transcripts, they are nevertheless \nbracketed, as in the excerpt „[Pause to say hi]‟. Conducting research with families also \nForthcoming, Environment and Planning A \n 31 \npresents challenges with regards to confidentiality, access and negotiating power \nrelations that are worthy of article length examination themselves (see Pratt forthcoming). \nI would hope that these are challenges that can be embraced if geographers are to further \nexplore the vital and vibrant roles played by family spaces and spacings. \nAcknowledgements \nIn writing this paper, I benefited considerably from comments made by Molly Kraft, \nLauren Martin, Natalie Oswin, audiences at McGill & Concordia Universities, and three \nanonymous referees. \nReferences \nAbu Zahra, Nadia 2006. Why People Stay, Why People Resist. In The Global and the \nIntimate, G. Pratt & V. Rosner (eds.) Women's Studies Quarterly 34: 242-249.  \nAbu Zahra, Nadia. 2007. Population Control for Resource Appropriation. In War, \nCitizenship, Territory. D. Cowen & E Gilbert (eds.). Aldershot: Ashgate. pp. 303-\n326. \nAgamben, Giorgio. 1998. Homo Sacer. Stanford: University of Stanford Press.  \nAgamben, Giorgio. 2005. State of Exception. Chicago: University of Chicago Press. \nAllen, Lori. 2008. Getting by the occupation: how violence became normal during the \nSecond Palestinian Intifada. Cultural Anthropology 23: 453–487. \nCarsten, Janet. 2000.  Cultures of relatedness. Cambridge: Cambridge University Press. \nCarsten, Janet. 2004. After kinship. Cambridge: Cambridge University Press. \nCowen, Deborah & Gilbert, Emily. 2007. Citizenship in the “Homeland”: families at war. \nIn D. Cowen & E. Gilbert (eds.) War, Citizenship, Territory. London: Routledge. \nForthcoming, Environment and Planning A \n 32 \nDarwish, Mahmoud. 2002. An incurable malady: hope. Speech before the IPW \ndelegation in Ramallah. Reprinted in Al-Ahram Weekly 4-10\nth\n April 2002. \nAvailable at http:\/\/weekly.ahram.org.eg\/2002\/580\/cu1.htm (21 January 2010). \nDeeb, Lara. 2006. An enchanted modern: gender and public piety in Shi„i Lebanon. \nPrinceton, NJ: Princeton University Press. \nDoumani, Beshara. 2003. Introduction. In B. Doumani (ed.) Family History in the Middle \nEast: Household, Property, and Gender. New York: SUNY Press. pp1-19. \nDuncan, Simon & Smith, Duncan. 2002. Geographies of family formations: spatial \ndifferences and gender cultures in Britain. Transactions of the Institute of British \nGeographers 27: 471-493. \nEdwards, Rosalind., Hadfield, Lucy., Helen, Lucey. & Mauthner, Melanie. 2006. Sibling \nidentity and relationships. London: Routledge. \nEl Haddad, Laila. 2008. Land of the cursed. Gaza Mom \nhttp:\/\/www.gazamom.com\/2008\/07\/land-of-the-cursed\/ (27th April 2010). \nFarrell, Betty. 1999. Family: the making of an idea, an institution, and a controversy in \nAmerican culture. Boulder: Westview Press. \nFinch, Janet. 2007. Displaying families. Sociology 41: 65-81. \nFoucault, Michel. 1978. The History of Sexuality, Vol. 1. London: Penguin. \nFoucault, Michel. 2008. The Birth of Biopolitics. New York: Palgrave Macmillan. \nFranklin, Sarah & McKinnon, Susan. 2001. Introduction. In S. Franklin & S. McKinnon \n(eds.) Relative values: reconfiguring kinship studies. Durham, N.C.: Duke \nUniversity Press. \nForthcoming, Environment and Planning A \n 33 \nGhannem, Farha. 2002. Remaking the modern: space, relocation and the politics of \nidentity in global Cairo. Berkeley, CA.: University of California Press. \nGillis, John. 1996. A world of their own making: myth, ritual and the quest for family \nvalues. Cambridge, MA: Harvard University Press. \nGordon, Neve. 2008. Israel’s Occupation. Berkeley: University of California Press. \nGregory, Derek. 2004. The Colonial Present. Oxford: Blackwell. \nHammami, Rema. 2004. On the importance of thugs: the moral economy of a checkpoint. \nMiddle East Report 231: 26-34. \nHammami, Rema. 2006. Human agency at the frontiers of global inequality: an \nethnography of hope in extreme places. Inaugural address as 2005\/2006 holder of \nthe Prince Claus Chair, Utrecht University April 20th 2006, available at \nhttp:\/\/www.uu.nl\/uupublish\/content\/InauguralHammamiApril2006.pdf \nHarker, Christopher. 2009a. Spacing Palestine through the home. Transactions of the \nInstitute of British Geographers 34 (3): 320-332. \nHarker, Christopher. 2009b. Student im\/mobility in Birzeit, Palestine. Mobilities 4: 11-\n36. \nHarker, Christopher. Forthcoming. Geopolitics and family practices in Palestine. \nGeoforum forthcoming \nHilal, Jamil. 2006. Emigration, conservatism and class formation in West Bank and Gaza \nStrip communities. In L. Taraki (ed). Living Palestine: family survival, resistance \nand mobility under occupation. New York: Syracuse University Press. pp. 185-\n230. \nForthcoming, Environment and Planning A \n 34 \nJohnson, Penny. 2006. Living together in a nation in fragments. In L. Taraki (ed). Living \nPalestine: family survival, resistance and mobility under occupation. New York: \nSyracuse University Press. pp. 51-102. \nJohnson, Penny & Joseph, Suad (eds.). 2009. War and transnational Arab families. \nSpecial issue of Journal of Middle East Women's Studies 5 (3): 1-174. \nJoseph, Suad. 1993. Connectivity and patriarchy among urban working-class Arab \nfamilies in Lebanon. Ethos 21: 452-482. \nJoseph, Suad. 1999a. Introduction. In S. Joseph (ed.) Intimate selving in Arab Families. \nNew York: Syracuse University Press. pp. 1-20 \nJoseph, Suad. 1999b. Brother-sister relationships. In S. Joseph (ed.) Intimate selving in \nArab Families. New York: Syracuse University Press. pp. 113-140. \nKartveit, Bard Helge. 2005. “In the US I‟m an Arab Terrorist, Here I‟m an American \nPunk”. Birzeit, Palestine: The Lower Jordan River Basin Programme \nPublications. \nKanaaneh, Rhoda. 2002. Birthing the nation: strategies of Palestinian women in Israel. \nBerkeley, CA: University of California Press. \nKelly, Tobias. 2008. The attractions of accountancy: living an ordinary life during the \nSecond Palestinian Intifada. Ethnography 9: 351-376. \nLeinbach, Thomas, Watkins, John & Bowen, John. 1992. Employment Behavior and the \nFamily in Indonesian Transmigration. Annals of the Association of American \nGeographers 82: 23-47.  \nMakdisi, Saree. 2008. Palestine inside out: an everyday occupation. London: Norton. \nForthcoming, Environment and Planning A \n 35 \nMartin, Lauren. forthcoming. The Geopolitics of Vulnerability: Legal Figurations of \nMigrant Families in U.S. Immigrant Family Detention Policy. Gender, Place and \nCulture: forthcoming. \nMcMurray, David. 2001. In and out of Morocco: smuggling and migration in a frontier \nboomtown. Minneapolis: University of Minnesota Press. \nMoran, Waren., Blunden, Greg. & Bradly, Adrian. 1996. Empowering Family Farms \nthrough Cooperatives and Producer Marketing Boards. Economic Geography 72: \n161-177.  \nMorgan, David. 1996. Family connections: an introduction to family studies. Cambridge: \nPolity Press. \nMorgan, David. 1999. Risk and family practices: accounting for change and fluidity in \nfamily life. In E. Silva & C. Smart (eds.) The new family? London: Sage. pp.13-\n30. \nNagar, Richa. 2009.  South, the. In D. Gregory, R. Johnston, G. Pratt, M. Watts & S. \nWhatmore (eds.) The dictionary of human geography, 5\nth\n edition. Oxford: Wiley-\nBlackwell. \nNash, Catherine. 2005. Geographies of relatedness. Transactions of the Institute of \nBritish Geographers 30: 449–462. \nOng, Aihwa. 1999. Flexible citizenship: the cultural logics of transnationality. Durham: \nDuke University Press. \nOswin, Natalie. 2010. Sexual tensions in modernizing Singapore: the postcolonial and the \nintimate. Environment and Planning D: Society and Space 28: 128-141. \nForthcoming, Environment and Planning A \n 36 \nParkin, Robert & Stone, Linda (eds.) 2004. Kinship and family: an anthropological \nreader. Oxford: Wiley-Blackwell. \nPeteet, Julie. 2005. Landscape of hope and despair: Palestinian refugee camps. \nPhiladelphia, PA.: University of Pennsylvania Press. \nPower, Emma. 2008. Furry families: making a human-dog family through home. Social \n& Cultural Geography 9: 535-555. \nPratt, Geraldine. Forthcoming. Going and Coming: Filipino-Canadian Youths‟ Narratives \nof Transnational Lives. Children‟s Geographies: forthcoming. \nPuar, Jasbir. 2007. Terrorist assemblages. Durham, N.C.: Duke University Press. \nRobinson, Jenny. 2003. Postcolonizing geography: tactics and pitfalls. Singapore Journal \nof Tropical Geography 24: 273-289. \nRosenfeld, Maya. 2004. Confronting the occupation: work, education and political \nactivism of Palestinian families in a refugee camp. Stanford, CA: Stanford \nUniversity Press. \nRoy, Sara. 2007: Failing Peace: Gaza and the Palestinian-Israeli conflict. Ann Arbor: \nPluto Press. \nSaid, Edward. 1978. Orientalism. London: Penguin. \nSeymour, Julie. 2007. Treating the hotel like a home: the contribution of studying the \nsingle location home\/workplace. Sociology 41: 1097-1114. \nSheller, Mimi. 2004. Automotive emotions: feeling the car. Theory, Culture & Society \n21: 221-242. \nForthcoming, Environment and Planning A \n 37 \nSherif-Trask, Bahira. 2006. Chapter 13: Families in the Islamic Middle-East. In B. \nIngoldsby & S. Smith (eds.) Families in Global and Multicultural Perspective (2\nnd\n \ned). London: Sage. \nStewart, Kathleen. 2007. Ordinary Affects. Durham, N.C.: Duke University Press. \nStrathern, Marilyn. 2005. Kinship, Law and the Unexpected. Cambridge: University of \nCambridge Press. \nTadmor, Naomi. 2001. Family and friends in eighteenth-century England: household, \nkinship and patronage. Cambridge: Cambridge University Press. \nTaraki, Lisa. 2008. Urban modernity on the periphery: a new middle class reinvents the \nPalestinian city. Social Text 26: 61-81. \nTaraki, Lisa & Giacaman, Rita. 2006. Modernity aborted and reborn: ways of being \nurban in Palestine. In L. Taraki (ed.) Living Palestine: family survival, resistance \nand mobility under occupation. New York: Syracuse University Press. \nTorpey, John. 2000. The invention of the passport: surveillance, citizenship and the state. \nCambridge: Cambridge University Press. \nValentine, Gill. 2008. „The ties that bind: towards geographies of intimacies‟. Geography \nCompass 2: 2097–2110. \nValentine, Gill., Skelton, Tracey. & Butler, Ruth. 2003. Coming out and outcomes: \nnegotiating lesbian and gay identities with, and in, the family. Environment and \nPlanning D: Society and Space 21: 479-499. \nWaters, Johanna. 2002. Flexible families? „Astronaut‟ households and the experiences of \nlone mothers in Vancouver, British Columbia. Social & Cultural Geography 3: \n117-134. \nForthcoming, Environment and Planning A \n 38 \nWeeks, Jeffrey., Heaphy, Brian. & Donovan, Catherine. 2001. Same sex intimacies: \nfamilies of choice and other life experiments. London: Routledge. \nWeizman, Eyal. 2007. Hollow land: Israel‟s architecture of occupation. London: Verso. \n"}