{"doi":"10.1109\/IIT.2002.1258023","coreId":"101818","oai":"oai:epubs.surrey.ac.uk:1251","identifiers":["oai:epubs.surrey.ac.uk:1251","10.1109\/IIT.2002.1258023"],"title":"Boron Bromide as a Source Precursor for Low Energy Applications","authors":["Gwilliam, R"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-01-01","abstract":"<p>The use of boron tri-bromide as a source precursor for low energy boron implantation is studied in this work. Details of gas delivery system, beam purity and running performance have been investigated for a 75keV molecular implant to give an equivalent boron energy of 5keV. The behavior of the Br during thermal processing is compared to that of F derived from a BF2 implant and is seen to be less mobile during post implant rapid thermal annealing with implications to gate oxide performance.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1251<\/identifier><datestamp>\n      2017-10-31T14:01:14Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:696F6E5F6265616D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1251\/<\/dc:relation><dc:title>\n        Boron Bromide as a Source Precursor for Low Energy Applications<\/dc:title><dc:creator>\n        Gwilliam, R<\/dc:creator><dc:description>\n        <p>The use of boron tri-bromide as a source precursor for low energy boron implantation is studied in this work. Details of gas delivery system, beam purity and running performance have been investigated for a 75keV molecular implant to give an equivalent boron energy of 5keV. The behavior of the Br during thermal processing is compared to that of F derived from a BF2 implant and is seen to be less mobile during post implant rapid thermal annealing with implications to gate oxide performance.<\/p><\/dc:description><dc:date>\n        2002-01-01<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1251\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Gwilliam, R  (2002) Boron Bromide as a Source Precursor for Low Energy Applications  In: SCS 2003. International Symposium on Signals, Circuits and Systems. Proceedings (Cat. No.03EX720).     <\/dc:identifier><dc:relation>\n        10.1109\/IIT.2002.1258023<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1251\/","10.1109\/IIT.2002.1258023"],"year":2002,"topics":[],"subject":["Conference or Workshop Item","NonPeerReviewed"],"fullText":"Boron Bromide as a Source Precursor for Low \nEnergy Applications  \n \n \nR. Gwilliam  \nSurrey Ion Beam Centre \nAdvanced Technology Institute  \nSchool of Electronics and Physical Sciences  \nUniversity of Surrey  \nGuildford, Surrey, UK.  \nr.gwilliam@surrey.ac.uk  \n \n \nAbstract—The use of boron tri-bromide as a source precursor for \nlow energy boron implantation is studied in this work. Details of \ngas delivery system, beam purity and running performance have \nbeen investigated for a 75keV molecular implant to give an \nequivalent boron energy of 5keV. The behavior of the Br during \nthermal processing is compared to that of F derived from a BF2 \nimplant and is seen to be less mobile during post implant rapid \nthermal annealing with implications to gate oxide performance.  \nKeywords-boron bromide; shallow junctions; doping;  \nI.  INTRODUCTION \nThe requirement for shallow junctions has seen the drive by \nequipment manufacturers to continually advance the lower \nenergy operation window of implant tools over the last decade. \nThis comes not without compromise, as the transport of high \nbeam currents at low energies is beleaguered with problems \ncaused by space charge issues resulting in beam blow up. \nLower implant energies can be achieved with respectable \ncurrents however, if the majority of the transport of the beam is \nperformed at higher energies with the final energy being as a \nresult of a deceleration close to the target. This technique is \nhowever subject to energy contamination from ions becoming \nneutralized by a charge exchange process before entering the \nfinal deceleration field, resulting in dopant tails from the higher \nenergy neutralized B. This can be particularly prevalent where \nphotorisist out gassing may compromise the vacuum levels. \nOne technique that has been used for many years is to \nimplant the halide BF2+ where, the energy is split between the \nF and the B resulting in a shallower B profile than would be \nachieved by a comparable B+ implant at the same energy.  As \ndevice dimensions have been reduced, F, due to its mobility \nduring thermal processing, has been identified as a cause of \nfailure in the very thin gate oxides currently used. Previously, \nthere have been several studies on the effects of halogens co-\nimplanted with B [1-5] which have provided useful information \non the implant defects and diffusion of B and the resulting \nelectrical performance. In this work, BBr3 is investigated for its \npracticality for use, as an alternate precursor for machines \nunable to access the very low energies currently required for \nshallow junction formation and on the diffusion behavior of Br \nduring rapid thermal annealing.  \nII. EXPERIMENTAL \nA. Source Precurser Delivery \n The BBr3, which is a liquid at room temperature, was \nattached to the ion source using a dedicated gas supply line \nattached to standard laboratory glass file. Delivery to the \nsource was controlled with a precision needle valve operated \nremotely. A parallel Ar support gas was also available via the \nstandard gas delivery system to both initiate source start up and \nto stabilize the plasma. An argon plasma was also run after \nclosure of the BBr3 supply to clean the source prior shut down. \nThe BF2 implants were performed using the standard mass \nflow controlled toxic gas delivery system with a BF3 precursor, \nagain with a parallel Ar support gas. \n  \nB. Implantation and Measurement \n4” <100> P doped CZ n-type Si was implanted at an energy \nof 75keV to a dose of 2x1014 ions cm-2 with comparable \nimplants of BF2+ performed at an energy of 22keV into a \nsecond set of samples. All the implants were performed on a \n200kV Danfysik DF1090 ion implanter which uses a \nCHORDIS ion source that was run in cold gas mode, details of \nwhich can be found in [6]. Molecular implants at these energies \ngive an equivalent B implant energy of ~5keV which has a \nprojected range of 20nm in silicon. Following implantation, \nsamples were annealed at 10500C for 10 seconds in an AG610 \nrapid thermal annealer under a flowing N2 ambient with a ramp \nrate of 500C s-1. SIMS analysis was performed on the as-\nimplanted and the annealed samples to investigate the atomic \nprofile of the B, Br and F. The analysis was performed on a \nCameca 4F using O2+ primary ion bombardment at 10keV with \npositive secondary ion detection to optimize the sensitivity to \nboron. Good sensitivity to fluorine may also be achieved under \nthese conditions. 7.5keV Cs+ primary ion bombardment and \nnegative secondary ion detection was used to optimize the \nFunded by UK Engineering and Physical Sciences Research Council\n    - 395 -   0-7803-7155-0\/02\/$10.00 © 2002 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:13 from IEEE Xplore.  Restrictions apply. \nsensitivity to bromine. The depth scales were determined by \nmeasuring the sputter crater depths by interference microscopy \nwith an accuracy of 10nm. \n \nIII. RESULTS  \nFig. 1 shows the expected mass distribution of the BBr2 \nimplant derived from the natural abundance of the isotopes.  \nFig. 2 shows a portion of the actual mass scan taken from the \nmachine relative to the desired ion species. The resolution of \nthe mass scan is compromised as the mass resolving slits on the \nmachine were set at a maximum for full beam transport. The \noverall shape of the scan is however as predicted. With the \nmajor peak being from the molecule constructed of \nBr79Br81B11+ isotopes which was the chosen implantation \nspecies The BF2+ implants were performed using the major \npeak not described here. Fig. 3 shows the implanted Br profiles \nalong with the B profile taken during the same SIMS \nmeasurement run. The B profile was derived from the 28Si11B \nion obtained under the Cs+ sputter conditions. This is not \noptimum for the measurement of B, but gives a useful guide as \nto the relative positions of the Br and B. As can be seen from \nthe measurement, the levels of 79Br and 81Br are very similar \nindicating that the ion species was primarily composed of \n79Br81Br plus a boron isotope as expected. \nFig. 4 shows the profiles for the sample following the \n10500C 10 second anneal. The Br profiles, while broader than \nthe as implanted profiles, do not show significant redistribution \ncompared to that observed for a comparable BF2 implant \nprocessed under the same annealing conditions as shown in \nFig. 5 and 6. The F signal is not quantified and is shown only \nas a count rate. As can be seen from the annealed sample when \ncompared to the as implanted sample, the F is highly mobile \nand has redistributed decorating the damage giving a double \nhump profile along with diffusion to the surface. This is \npreviously widely documented in the literature. \n75 keV 2e14 BBr2 \n1.0E+00\n1.0E+01\n1.0E+02\n1.0E+03\n1.0E+04\n1.0E+05\n1.0E+06\n0 0.05 0.1 0.15 0.2\nDepth [microns]\nIn\nte\nns\nity\n [c\n\/s\n]\n28Si11B [c\/s]\n79Br [c\/s]\n81Br [c\/s]\nFigure 3 SIMS profile of the B and Br isotopes following implantation. \nThe values are relative as no calibration standard was used \nFigure 4 SIMS profile of the B and Br isotopes following implantation \nand annealing. Note B position relative to Br \nFigure 2. Actual isotope abundance for BBr2 \nFigure 1 Predicted mass scan from natural isotope abundance \n75keV 2e14 BBr2 Annealed 1050C\/10seconds\n1.0E+00\n1.0E+01\n1.0E+02\n1.0E+03\n1.0E+04\n1.0E+05\n1.0E+06\n0 0.05 0.1 0.15 0.2\nDepth [microns]\nIn\nte\nns\nity\n [c\n\/s\n]\n28Si11B [c\/s]\n79Br [c\/s]\n81Br [c\/s]\n    - 396 -   0-7803-7155-0\/02\/$10.00 © 2002 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:13 from IEEE Xplore.  Restrictions apply. \nFig. 7 and Fig. 8 show the boron profiles for the as-\nimplanted and annealed samples respectively with the profiles \nbeing taken using an O2+ primary ion beam and calibrated \nagainst a standard for absolute quantification. The as-implanted \nprofile shape is consistent with that expected from a 5keV B+ \nimplant into damaged\/amorphous material with little evidence \nof channeling and is certainly sharper than that observed for the \nBF2 implant as might be expected.  Both 10B and 11B was \nprofiled to ascertain the exact implanted isotopes for the BBr2 \nimplant. As can be seen there are significant quantities of 10B \npresent in the implant indicating that the implant consisted \nmore than one molecular configuration.   \n \nIV. DISCUSSION AND CONCLUSIONS  \nBBr2 implants have been successfully performed on a \nDanfsik 1090 research implanter using a CHORDIS ion source \nwith only minor modifications to the standard gas delivery \nsystem. There was ample vapor pressure at room temperature \nto enable running of the source without the need for heating of \nthe precursor. However, as is often experienced with bromides \nand given the complexity of the CHORDIS ion source design, \nwhich has large internal surface areas, the precursor was found \nto give large memory effects. This manifests itself in wetting of \nthe internal components from moisture absorption making \nfuture pumping of the source difficult following source \nexchange. This was still evident even after running an Ar \nplasma under high discharge conditions for up to 1 hour prior \nto source removal. This of course would seriously compromise \nits use in a production facility.  \nThe boron profiles achieved were consistent with an \nimplant of 5keV B+ into disordered material with very little \nFigure 8 Absolute boron concentration for BBr2 implantation after \nimplantation and annealing.. junction depth has extended some 100nm. \n \nFigure7 Absolute boron concentration for BBr2 implantation after \nimplantation \n75keV BBr2 Implant\n1.0E+16\n1.0E+17\n1.0E+18\n1.0E+19\n1.0E+20\n1.0E+21\n0 0.05 0.1 0.15 0.2\nDepth [microns]\nC\non\nce\nnt\nra\ntio\nn \n[A\nto\nm\n\/c\nm\n3]\n10B [Atom\/cm3]\n11B [Atom\/cm3]\n22.5keV BF2 annealed\n1.0E+16\n1.0E+17\n1.0E+18\n1.0E+19\n1.0E+20\n1.0E+21\n0 0.05 0.1 0.15 0.2\nDepth [microns]\nC\non\nce\nnt\nra\ntio\nn \n[A\nto\nm\n\/c\nm\n3]\n1.0E+00\n1.0E+01\n1.0E+02\n1.0E+03\n1.0E+04\n1.0E+05\n1.0E+06\nIn\nte\nns\nity\n [c\n\/s\n]\n11B [Atom\/cm3]\n10B [c\/s]\n19F [c\/s]\n75keV BBr2 Annealed 1050\/10s\n1.0E+16\n1.0E+17\n1.0E+18\n1.0E+19\n1.0E+20\n1.0E+21\n0 0.05 0.1 0.15 0.2\nDepth [microns]\nC\non\nce\nnt\nra\ntio\nn \n[A\nto\nm\n\/c\nm\n3]\n10B [Atom\/cm3]\n11B [Atom\/cm3]\nFigure 6 Boron and fluorine distribution following annealing at 10500C \nfor 10 seconds. Note redistribution of the fluorine to the surface, peak \nand end of range damage \nFigure 5 Boron  and Fluorine distribution for as implanted 22.5keV BF2 \nimplant following implantation. Boron concentration is calibrated while \nfluorine is relative \n22.5 keV BF2\n1.0E+16\n1.0E+17\n1.0E+18\n1.0E+19\n1.0E+20\n1.0E+21\n0 0.05 0.1 0.15 0.2\nDepth [microns]\nC\non\nce\nnt\nra\ntio\nn \n[A\nto\nm\n\/c\nm\n3]\n1.0E+00\n1.0E+01\n1.0E+02\n1.0E+03\n1.0E+04\n1.0E+05\n1.0E+06\nIn\nte\nns\nity\n [c\n\/s\n]\n11B [Atom\/cm3]\n10B [c\/s]\n19F [c\/s]\n    - 397 -   0-7803-7155-0\/02\/$10.00 © 2002 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:13 from IEEE Xplore.  Restrictions apply. \nevidence of channeling and somewhat sharper than those \nachieved for a BF2 implant. This is to be expected given that \nthe bromine has a significantly higher mass than the F and \nwould introduce lattice damage at a much higher rate.  \nInterestingly, the Br has completely different diffusion \nbehavior than the F with little evidence of major redistribution \nbeing observed unlike that seen for the F in the BF2 case. This \nin itself could prove useful when the deleterious effects of the F \non oxides is considered, as there seems to be no migration to \nthe surface and the Br will be less reactive than the F. \nAs was seen from the SIMS data, significant 10B was also \nimplanted with what was believed to be the 79Br81Br11B \nmolecule. As the adjacent isotope to the 79Br81Br11B molecule \nis 79Br81Br10B this may have led to the contamination due to the \nresolving slits being at their most open. However, the mass \nresolution of the tool is such that we would expect an adjacent \nisotope to be two orders down under these running conditions. \nIt may be that the contamination emanated for a combination of \nreasons such as H contamination possibly as a result of \nmoisture gettered by the bromide and beam instabilities during \nthe implant.    \n \nREFERENCES \n \n[1] H. Muller, H. Ryssel and K. Schmid. J. Appl. Phs. 43, 2006 1972 \n[2] D.G. Beanland. Solid State Electronics 21, 537, 1978 \n[3] D.F. Downey, J.W. Chow, E. Ishida and K.S. Jones. Appl. Phys. Lett. \n52, 1263 1998 \n[4] L.S. Robertson et al. The effect of impurities on diffusion and activation \nof ion implanted boron in silicon. Mat. Res. Soc. Symp. Vol. 610. \nB5.8.1 2000. \n[5] S. Winston et al. Evaluation of the B activation and depth distribution \nusing BBr2 implants. Presented IIT2002. To be published. \n[6] . R. Keller, P. Spadtke and F. Nohmayer. Proceedings of International \nIon Engineering Congress., Kyoto, Institute of Electrical Engineers of \nJapan, Tokyo,  p. 25 1983 \n \n    - 398 -   0-7803-7155-0\/02\/$10.00 © 2002 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:13 from IEEE Xplore.  Restrictions apply. \n"}