{"doi":"10.1029\/2005JA011436","coreId":"69185","oai":"oai:eprints.lancs.ac.uk:28041","identifiers":["oai:eprints.lancs.ac.uk:28041","10.1029\/2005JA011436"],"title":"Geomagnetic storms driven by ICME- and CIR-dominated solar wind.","authors":["Denton, Michael H.","Borovsky, Joseph E.","Skoug, R. M.","Thomsen, M. F.","Lavraud, B.","Henderson, M. G.","McPherron, R. L.","Zhang, J. C.","Liemohn, M. W."],"enrichments":{"references":[{"id":16668297,"title":"A new source of suprathermal O + near the dayside polar cap boundary,","authors":[],"date":"1985","doi":null,"raw":"Lockwood, M., J. H. Waite Jr., T. E. Moore, J. F. E. Johnson, and C. R. Chappell (1985), A new source of suprathermal O + near the dayside polar cap boundary, J. Geophys. Res., 90, 4099–4116.","cites":null},{"id":966815,"title":"A new source of suprathermal O+ near the dayside polar cap boundary,","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":972556,"title":"A statistical study of the geoeffectiveness of magnetic clouds during high solar activity years,","authors":[],"date":"2004","doi":null,"raw":"Zhang, J.-C., M. W. Liemohn, J. U. Kozyra, B. J. Lynch, and T. H. Zurbuchen (2004), A statistical study of the geoeffectiveness of magnetic clouds during high solar activity years, J. Geophys. Res., 109, A09101, doi:10.1029\/2004JA010410.","cites":null},{"id":965349,"title":"An overview of the early","authors":[],"date":"1998","doi":null,"raw":"Knipp, D. J., et al. (1998), An overview of the early November 1993 geomagnetic storm, J. Geophys. Res., 103, 26,197.","cites":null},{"id":972811,"title":"Atmospheric, Oceanic and Space Sciences Department,","authors":[],"date":null,"doi":null,"raw":"Thomsen, MS D466 Los Alamos National Laboratory, Los Alamos, NM 87545, USA. (jborovsky@lanl.gov; mghenderson@lanl.gov; lavraud@lanl. gov; rskoug@lanl.gov; mthomsen@lanl.gov) M. H. Denton, School of Physics and Astronomy, University of Southampton, Southampton, SO17 1BJ, UK. (mdenton@phys.soton.ac.uk) M. W. Liemohn and J. C. Zhang, Atmospheric, Oceanic and Space Sciences Department, University of Michigan, 2455 Hayward Street, Ann Arbor, MI 48109, USA. (liemohn@umich.edu; jichunz@engin. umich.edu) R. L. McPherron, Institute of Geophysics and Planetary Physics, University of California, Los Angeles, Los Angeles, CA 90095, USA. (mcpherron@igpp.ucla.edu) A07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS 12 of 12 A07S07","cites":null},{"id":961932,"title":"Bulk plasma properties at geosynchronous orbit,","authors":[],"date":"2005","doi":null,"raw":"Denton, M. H., M. F. Thomsen, H. Korth, S. Lynch, J. C. Zhang, and M. W. Liemohn (2005), Bulk plasma properties at geosynchronous orbit, J. Geophys. Res., 110, A07223, doi:10.1029\/2004JA010861.","cites":null},{"id":969140,"title":"Calculation of moments from measurements by the Los Alamos magnetospheric plasma analyzer,","authors":[],"date":"1999","doi":null,"raw":"Thomsen, M. F., E. Noveroske, J. E. Borovsky, and D. J. McComas (1999), Calculation of moments from measurements by the Los Alamos magnetospheric plasma analyzer, LA Rep. LA-13566-MS, Los Alamos Natl. Lab., Los Alamos, N. M.","cites":null},{"id":967798,"title":"Change of energetic ion composition in the plasma sheet during substorms,","authors":[],"date":"2000","doi":null,"raw":"Nose ´, M., S. Ohtani, A. T. Y. Liu, S. P. Christon, R. W. McEntire, D. J. Williams, T. Mukai, Y. Saito, and K. Yumoto (2000), Change of energetic ion composition in the plasma sheet during substorms, J. Geophys. Res., 105, 23,277–23,286.","cites":null},{"id":961108,"title":"Cliver","authors":[],"date":"1994","doi":null,"raw":"Crooker, N. U., and E. W. Cliver (1994), Postmodern view of M-regions, J. Geophys. Res., 99, 23,383–23,390.","cites":null},{"id":16668250,"title":"Clu ´a de Gonzalez","authors":[],"date":"2002","doi":null,"raw":"Gonzalez, W. D., B. T. Tsurutani, and A. L. Clu ´a de Gonzalez (2002), Geomagnetic storms contrasted during solar maximum and solar minimum, Adv. Space Res., 30, 2301–2304.","cites":null},{"id":963218,"title":"Clu´a de Gonzalez","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":966306,"title":"Comparison of plasma sheet ion composition with the IMF and solar wind,","authors":[],"date":"1988","doi":null,"raw":"Lennartsson, W. (1988), Comparison of plasma sheet ion composition with the IMF and solar wind, Adv. Space. Res., 8, 135–138.","cites":null},{"id":966542,"title":"Computational analysis of the near-Earth magnetospheric current system during two-phase decay storms,","authors":[],"date":"2001","doi":null,"raw":"Liemohn, M. W., J. U. Kozyra, C. R. Clauer, and A. J. Ridley (2001), Computational analysis of the near-Earth magnetospheric current system during two-phase decay storms, J. Geophys. Res., 106, 29,531–29,542.","cites":null},{"id":963770,"title":"Coronal streamers in the solar wind at 1","authors":[],"date":"1981","doi":"10.1029\/JA086iA07p05438","raw":"Gosling, J. T., G. Borrini, J. R. Asbridge, S. J. Bame, W. C. Feldman, and R. T. Hansen (1981), Coronal streamers in the solar wind at 1 AU, J. Geophys. Res., 86, 5438–5448.","cites":null},{"id":972242,"title":"Correlations of magnetospheric ion composition with geomagnetic and solar activity,","authors":[],"date":"1982","doi":null,"raw":"Young, D. T., H. Balsiger, and J. Geiss (1982), Correlations of magnetospheric ion composition with geomagnetic and solar activity, J. Geophys. Res., 87, 9077–9096.","cites":null},{"id":965091,"title":"Current understanding of magnetic storms:","authors":[],"date":"1998","doi":"10.1029\/1999JA900019","raw":"Kamide, Y., et al. (1998), Current understanding of magnetic storms: Storm-substorm relationships, J. Geophys. Res., 103, 17,705–17,728.","cites":null},{"id":969778,"title":"Delivery of cold, dense plasma sheet material into the near-Earth region,","authors":[],"date":"2003","doi":null,"raw":"Thomsen, M. F., J. E. Borovsky, R. M. Skoug, and C. W. Smith (2003), Delivery of cold, dense plasma sheet material into the near-Earth region, J. Geophys. Res., 108(A4), 1151, doi:10.1029\/2002JA009544.","cites":null},{"id":964370,"title":"Distributions of He+ at middle and equatorial latitudes during solar maximum,","authors":[],"date":"1990","doi":"10.1029\/JA095iA07p10313","raw":"Heelis, R. A., W. B. Hanson, and G. J. Bailey (1990), Distributions of He+ at middle and equatorial latitudes during solar maximum, J. Geophys. Res., 95, 10,313–10,320.","cites":null},{"id":971460,"title":"Geoactivity in response to CIR\/CME events - A synoptic view,","authors":[],"date":"1999","doi":null,"raw":"Wilken, B., Q.-G. Zong, G. D. Reeves, T. Doke, and T. Yamamoto (1999), Geoactivity in response to CIR\/CME events - A synoptic view, Phys. Chem. Earth C, 24(1–3), 113–117.","cites":null},{"id":972730,"title":"Geotail observations of energetic ion species and magnetic field in plasmoid-like structures in the course of an isolated substorm event,","authors":[],"date":"1997","doi":null,"raw":"A07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS 11 of 12 A07S07Zong, Q.-G., et al. (1997), Geotail observations of energetic ion species and magnetic field in plasmoid-like structures in the course of an isolated substorm event, J. Geophys. Res., 102, 11,409–11,428.                        J. E. Borovsky, M. G. Henderson, B. Lavraud, R. M. Skoug, and M. F.","cites":null},{"id":960865,"title":"Interplanetary coronal mass ejections in the near-Earth solar wind during 1996–2002,","authors":[],"date":"2003","doi":null,"raw":"Cane, H. V., and I. V. Richardson (2003), Interplanetary coronal mass ejections in the near-Earth solar wind during 1996–2002, J. Geophys. Res., 108(A4), 1156, doi:10.1029\/2002JA009817.","cites":null},{"id":970050,"title":"Interplanetary origin of geomagnetic activity in the declining phase of the solar cycle,","authors":[],"date":"1995","doi":null,"raw":"Tsurutani, B. T., W. D. Gonzalez, A. L. C. Gonzalez, F. Tang, J. K. Arballo, and M. Okada (1995), Interplanetary origin of geomagnetic activity in the declining phase of the solar cycle, J. Geophys. Res., 100, 21,717–21,733.","cites":null},{"id":962210,"title":"Interplanetary sources of space weather disturbances in","authors":[],"date":"2005","doi":null,"raw":"Dmitriev, A. V., N. B. Crosby, and J.-K. Chao (2005), Interplanetary sources of space weather disturbances in 1997 to 2000, Space Weather, 3, S03001, doi:10.1029\/2004SW000104.","cites":null},{"id":962795,"title":"Ion composition variations in the inner magnetosphere: Individual and collective storm effects in","authors":[],"date":"2001","doi":"10.1029\/2000JA900173","raw":"Fu, S. Y., B. Wilken, Q. G. Zong, and Z. Y. Pu (2001), Ion composition variations in the inner magnetosphere: Individual and collective storm effects in 1991, J. Geophys. Res., 106, 29,683–29,704.","cites":null},{"id":964847,"title":"Kinetic model of the ring current-atmosphere interactions,","authors":[],"date":"1997","doi":"10.1029\/96JA03699","raw":"Jordanova, V. K., J. U. Kozyra, A. F. Nagy, and G. V. Khazanov (1997), Kinetic model of the ring current-atmosphere interactions, J. Geophys. Res., 102, 14,279–14,291.","cites":null},{"id":971986,"title":"Long term (solar cycle) and seasonal variations of upflowing ionospheric ion events at DE 1 altitudes,","authors":[],"date":"1985","doi":null,"raw":"Yau, A. W., P. H. Beckworth, W. K. Peterson, and E. G. Shelley (1985), Long term (solar cycle) and seasonal variations of upflowing ionospheric ion events at DE 1 altitudes, J. Geophys. Res., 90, 6395– 6407.","cites":null},{"id":970377,"title":"Long term and solar cycle variation of the ring current,","authors":[],"date":"1996","doi":null,"raw":"Vennerstrøm, X., and X. Friis-Christensen (1996), Long term and solar cycle variation of the ring current, J. Geophys. Res., 101, 24,735.","cites":null},{"id":960361,"title":"Magnetospheric plasma analyzer for spacecraft with constrained resources,","authors":[],"date":"1993","doi":null,"raw":"Bame, S. J., D. J. McComas, M. F. Thomsen, B. L. Barraclough, R. C. Elphic, J. P. Glore, J. C. Chavez, E. P. Evans, and F. J. Wymer (1993), Magnetospheric plasma analyzer for spacecraft with constrained resources, Rev. Sci. Instrum., 64, 1026–1033.","cites":null},{"id":967582,"title":"Magnetospheric plasma analyzer: Initial three-spacecraft observations from geosynchronous orbit,","authors":[],"date":"1993","doi":null,"raw":"McComas, D. J., S. J. Bame, B. L. Barraclough, J. R. Donart, R. C. Elphic, J. T. Gosling, M. B. Moldwin, K. R. Moore, and M. F. Thomsen (1993), Magnetospheric plasma analyzer: Initial three-spacecraft observations from geosynchronous orbit, J. Geophys. Res., 98, 13,453–13,465.","cites":null},{"id":967312,"title":"Milling (2004), Correlations between ULF wave power, solar wind speed, and relativistic electron flux in the magnetosphere: Solar cycle dependence,","authors":[],"date":null,"doi":null,"raw":"Mann, I. R., T. P. O’Brien, and D. K. Milling (2004), Correlations between ULF wave power, solar wind speed, and relativistic electron flux in the magnetosphere: Solar cycle dependence, J. Atmos. Sol. Terr. Phys., 66, 187.","cites":null},{"id":961643,"title":"Modelling the high altitude electron temperature: A modified thermal conductivity,","authors":[],"date":"2001","doi":null,"raw":"Denton, M. H., and G. J. Bailey (2001), Modelling the high altitude electron temperature: A modified thermal conductivity, Dyn. Atmos. Oceans, 34, 365–381.","cites":null},{"id":967833,"title":"Modulation of trapped energetic electrons at 6.6 Re by the direction of the magnetic field,","authors":[],"date":"1976","doi":null,"raw":"Paulikas, G. A., and J. B. Blake (1976), Modulation of trapped energetic electrons at 6.6 Re by the direction of the magnetic field, Geophys. Res. Lett., 3, 277–280.","cites":null},{"id":968091,"title":"Observations of interaction regions and co-rotating shocks between one and five AU: Pioneer 10 and 11,","authors":[],"date":"1976","doi":null,"raw":"Smith, E. J., and J. H. Wolf (1976), Observations of interaction regions and co-rotating shocks between one and five AU: Pioneer 10 and 11, Geophys. Res. Lett., 3, 137–140.","cites":null},{"id":965821,"title":"Plasma sheet access to geosynchronous orbit,","authors":[],"date":"1999","doi":null,"raw":"Korth, H., M. F. Thomsen, J. E. Borovsky, and D. J. McComas (1999), Plasma sheet access to geosynchronous orbit, J. Geophys. Res., 104, 25,047–25,061.","cites":null},{"id":965569,"title":"Plasma sheet access to geosynchronous orbit: Generalization to numerical field models,","authors":[],"date":"2001","doi":null,"raw":"Korth, H., and M. F. Thomsen (2001), Plasma sheet access to geosynchronous orbit: Generalization to numerical field models, J. Geophys. Res., 106, 29,655–29,667.","cites":null},{"id":962488,"title":"Plasma sheet access to the inner magnetosphere,","authors":[],"date":"2001","doi":null,"raw":"Friedel, R. H. W., H. Korth, M. G. Henderson, M. F. Thomsen, and J. D. Scudder (2001), Plasma sheet access to the inner magnetosphere, J. Geophys. Res., 106, 5845–5858.","cites":null},{"id":971708,"title":"Probability factors governing ESD effects in geosynchronous orbit,","authors":[],"date":"1996","doi":null,"raw":"Wrenn, G. L., and R. J. K. Smith (1996), Probability factors governing ESD effects in geosynchronous orbit, IEEE Trans. Nucl. Sci., 43, 2783.","cites":null},{"id":964115,"title":"Ring current development during the great geomagnetic storm of February","authors":[],"date":"1988","doi":"10.1029\/JA093iA12p14343","raw":"Hamilton, D. C., G. Gloeckler, F. M. Ipavich, W. Studemann, B. Wilken, and G. Kremser (1988), Ring current development during the great geomagnetic storm of February 1986, J. Geophys. Res., 93, 14,343–14,355.","cites":null},{"id":964613,"title":"Sizes and locations on coronal mass ejections: SMM observations from","authors":[],"date":"1993","doi":"10.1029\/93JA00157","raw":"Hundhausen, A. J. (1993), Sizes and locations on coronal mass ejections: SMM observations from 1980 and 1984–1989, J. Geophys. Res., 98, 13,177–13,200.","cites":null},{"id":970678,"title":"Solar activity variations in the composition of the low latitude ionosphere,","authors":[],"date":"1997","doi":null,"raw":"West, K. H., R. A. Heelis, and F. J. Rich (1997), Solar activity variations in the composition of the low latitude ionosphere, J. Geophys. Res., 102, 295–302.","cites":null},{"id":968329,"title":"Solar wind control of density and temperature in the near-Earth plasma sheet: WIND\/GEOTAIL collaboration,","authors":[],"date":"1997","doi":null,"raw":"Terasawa, T., et al. (1997), Solar wind control of density and temperature in the near-Earth plasma sheet: WIND\/GEOTAIL collaboration, Geophys. Res. Lett., 24, 935.","cites":null},{"id":963468,"title":"Solar wind stream interfaces,","authors":[],"date":"1978","doi":"10.1029\/JA083iA04p01401","raw":"Gosling, J. T., J. R. Asbridge, S. J. Bame, and W. C. Feldman (1978), Solar wind stream interfaces, J. Geophys. Res., 83, 1401–1412.","cites":null},{"id":971205,"title":"Substorm activity on","authors":[],"date":"1998","doi":null,"raw":"Wilken, B., Q.-G. Zong, T. Doke, T. Mukai, T. Yamamoto, G. D. Reeves, K. Maezawa, S. Kokubun, and S. Ullaland (1998), Substorm activity on January 11, 1994: Geotail observations in the distant tail during the leading phase of a corotating interaction region, J. Geophys. Res., 103, 17,671–17,689.","cites":null},{"id":966039,"title":"Superposed epoch analysis of cold, dense plasma sheet access to geosynchronous orbit,","authors":[],"date":"2005","doi":null,"raw":"Lavraud, B., M. H. Denton, M. F. Thomsen, J. E. Borovsky, and R. H. Friedel (2005), Superposed epoch analysis of cold, dense plasma sheet access to geosynchronous orbit, Ann. Geophys., 23,1 – 1 1 .","cites":null},{"id":963052,"title":"The charging of spacecraft surfaces,","authors":[],"date":"1981","doi":"10.1029\/RG019i004p00577","raw":"Garrett, H. B. (1981), The charging of spacecraft surfaces, Rev. Geophys., 19, 577.","cites":null},{"id":960455,"title":"The differences between CMEdriven storms and CIR-driven storms,","authors":[],"date":"2006","doi":null,"raw":"Borovsky, J. E., and M. H. Denton (2006), The differences between CMEdriven storms and CIR-driven storms, J. Geophys. Res., doi:10.1029\/ 2005JA011447, in press.","cites":null},{"id":967077,"title":"The propagation of coronal mass ejection transients,","authors":[],"date":"1986","doi":null,"raw":"MacQueen, R. M., A. J. Hundhausen, and C. W. Conover (1986), The propagation of coronal mass ejection transients, J. Geophys. Res., 91, 31–38.","cites":null},{"id":960719,"title":"The transport of plasma sheet material from the distant tail to geosynchronous orbit,","authors":[],"date":"1998","doi":null,"raw":"Borovsky, J. E., M. F. Thomsen, R. C. Elphic, T. E. Cayton, and D. J. McComas (1998), The transport of plasma sheet material from the distant tail to geosynchronous orbit, J. Geophys. Res., 103, 20,297–20,331.","cites":null},{"id":969477,"title":"Two-satellite observations of substorm injections at geosynchronous orbit,","authors":[],"date":"2001","doi":null,"raw":"Thomsen, M. F., J. Birn, J. E. Borovsky, K. Morzinski, D. J. McComas, and G. D. Reeves (2001), Two-satellite observations of substorm injections at geosynchronous orbit, J. Geophys. Res., 106, 8405–8416.","cites":null},{"id":968899,"title":"Variability of the ring current source population,","authors":[],"date":"1998","doi":null,"raw":"Thomsen, M. F., J. E. Borovsky, D. J. McComas, and M. R. Collier (1998), Variability of the ring current source population, Geophys. Res. Lett., 25, 3481–3484.","cites":null},{"id":961344,"title":"Variations of the ion composition during an intense magnetic storm and their consequences,","authors":[],"date":"1999","doi":null,"raw":"Daglis, I. A., G. Kasotakis, E. T. Sarris, Y. Kamide, and B. Wilken (1999), Variations of the ion composition during an intense magnetic storm and their consequences, Phys. Chem. Earth, 24, 229–232.","cites":null},{"id":968600,"title":"Why Kp is such a good measure of magnetospheric convection,","authors":[],"date":"2004","doi":null,"raw":"Thomsen, M. F. (2004), Why Kp is such a good measure of magnetospheric convection, Space Weather, 2, S11004, doi:10.1029\/2004SW000089.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006","abstract":"The interaction of the solar wind and the Earth's magnetosphere is complex and the phenomenology of the interaction is very different for solar wind dominated by interplanetary coronal mass ejections (ICMEs) compared to solar wind dominated by corotating interaction regions (CIRs). We perform a superposed epoch study of the effects of ICME- and CIR-dominated solar wind upon the storm-time plasma at geosynchronous orbit using data from the magnetospheric plasma analyzer (MPA) instruments on board seven Los Alamos National Laboratory (LANL) satellites. Using 78 ICME events and 32 CIR events, we examine the electron and ion plasma sheets that are formed during each type of solar wind driver, at energy-per-charge between ∼0.1 and 45 keV\/q. The results demonstrate that CIR events produce a more significant modulation in the plasma sheet temperature than ICME events, whilst ICME events produce a more significant modulation in the plasma sheet density than CIR events. We attribute these differences to the average speed in the solar wind and a combination of the density of the solar wind and the ionospheric component of the plasma sheet, respectively. We also show that for CIR events, the magnitude of the spacecraft potential is, on average, significantly greater than during ICME-events, with consequent effects upon the performance of instrumentation within this environment","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69185.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/28041\/1\/art_780.pdf","pdfHashValue":"31c7a7a4ebf736ebd6a9b5d7b4e0b2ef6ca41b44","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:28041<\/identifier><datestamp>\n      2018-01-24T02:52:01Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Geomagnetic storms driven by ICME- and CIR-dominated solar wind.<\/dc:title><dc:creator>\n        Denton, Michael H.<\/dc:creator><dc:creator>\n        Borovsky, Joseph E.<\/dc:creator><dc:creator>\n        Skoug, R. M.<\/dc:creator><dc:creator>\n        Thomsen, M. F.<\/dc:creator><dc:creator>\n        Lavraud, B.<\/dc:creator><dc:creator>\n        Henderson, M. G.<\/dc:creator><dc:creator>\n        McPherron, R. L.<\/dc:creator><dc:creator>\n        Zhang, J. C.<\/dc:creator><dc:creator>\n        Liemohn, M. W.<\/dc:creator><dc:description>\n        The interaction of the solar wind and the Earth's magnetosphere is complex and the phenomenology of the interaction is very different for solar wind dominated by interplanetary coronal mass ejections (ICMEs) compared to solar wind dominated by corotating interaction regions (CIRs). We perform a superposed epoch study of the effects of ICME- and CIR-dominated solar wind upon the storm-time plasma at geosynchronous orbit using data from the magnetospheric plasma analyzer (MPA) instruments on board seven Los Alamos National Laboratory (LANL) satellites. Using 78 ICME events and 32 CIR events, we examine the electron and ion plasma sheets that are formed during each type of solar wind driver, at energy-per-charge between ∼0.1 and 45 keV\/q. The results demonstrate that CIR events produce a more significant modulation in the plasma sheet temperature than ICME events, whilst ICME events produce a more significant modulation in the plasma sheet density than CIR events. We attribute these differences to the average speed in the solar wind and a combination of the density of the solar wind and the ionospheric component of the plasma sheet, respectively. We also show that for CIR events, the magnitude of the spacecraft potential is, on average, significantly greater than during ICME-events, with consequent effects upon the performance of instrumentation within this environment.<\/dc:description><dc:date>\n        2006<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/28041\/1\/art_780.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2005JA011436<\/dc:relation><dc:identifier>\n        Denton, Michael H. and Borovsky, Joseph E. and Skoug, R. M. and Thomsen, M. F. and Lavraud, B. and Henderson, M. G. and McPherron, R. L. and Zhang, J. C. and Liemohn, M. W. (2006) Geomagnetic storms driven by ICME- and CIR-dominated solar wind. Journal of Geophysical Research, 111 (A07S07). pp. 1-12. ISSN 0148-0227<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/28041\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/2005JA011436","http:\/\/eprints.lancs.ac.uk\/28041\/"],"year":2006,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"Geomagnetic storms driven by ICME- and CIR-dominated solar wind\nM. H. Denton,1,2 J. E. Borovsky,1 R. M. Skoug,1 M. F. Thomsen,1 B. Lavraud,1\nM. G. Henderson,1 R. L. McPherron,3 J. C. Zhang,4 and M. W. Liemohn4\nReceived 19 September 2005; revised 17 November 2005; accepted 7 February 2006; published 18 May 2006.\n[1] The interaction of the solar wind and the Earth’s magnetosphere is complex and the\nphenomenology of the interaction is very different for solar wind dominated by\ninterplanetary coronal mass ejections (ICMEs) compared to solar wind dominated by\ncorotating interaction regions (CIRs). We perform a superposed epoch study of the\neffects of ICME- and CIR-dominated solar wind upon the storm-time plasma at\ngeosynchronous orbit using data from the magnetospheric plasma analyzer (MPA)\ninstruments on board seven Los Alamos National Laboratory (LANL) satellites. Using\n78 ICME events and 32 CIR events, we examine the electron and ion plasma sheets that\nare formed during each type of solar wind driver, at energy-per-charge between \u00010.1 and\n45 keV\/q. The results demonstrate that CIR events produce a more significant\nmodulation in the plasma sheet temperature than ICME events, whilst ICME events\nproduce a more significant modulation in the plasma sheet density than CIR events. We\nattribute these differences to the average speed in the solar wind and a combination of\nthe density of the solar wind and the ionospheric component of the plasma sheet,\nrespectively. We also show that for CIR events, the magnitude of the spacecraft potential\nis, on average, significantly greater than during ICME-events, with consequent effects\nupon the performance of instrumentation within this environment.\nCitation: Denton, M. H., J. E. Borovsky, R. M. Skoug, M. F. Thomsen, B. Lavraud, M. G. Henderson, R. L. McPherron, J. C. Zhang,\nand M. W. Liemohn (2006), Geomagnetic storms driven by ICME- and CIR-dominated solar wind, J. Geophys. Res., 111, A07S07,\ndoi:10.1029\/2005JA011436.\n1. Introduction\n[2] The outflow of plasma from the sun, generally known\nas the solar wind, induces significant effects within the\nEarth’s magnetosphere when the two interact. The charac-\nteristics of the solar wind are highly variable, and in this\nreport we focus on two specific types of disturbance in the\nsolar wind and subsequent effects in the inner magneto-\nsphere. Coronal mass ejections (CMEs) occur when mate-\nrial is catastrophically ejected from the sun, and these events\nare typically most numerous close to the sunspot maximum\n[e.g., MacQueen et al., 1986; Hundhausen, 1993, and\nreferences therein]. In contrast, corotating interaction\nregions (CIRs) are large-scale structures in the heliosphere\nwhich occur predominantly during the declining phase of\nthe solar cycle. CIRs occur in response to the interaction of\nfast and slow solar winds and, since they are related to the\nfast solar wind arising from coronal holes, they may recur\nwith a \u000127 day period [e.g., Smith and Wolf, 1976; Gosling\net al., 1978, 1981; Crooker and Cliver, 1994; Tsurutani et\nal., 1995, and references therein].\n[3] With regard to the magnetosphere, previous studies\nhave highlighted the broad magnetospheric effects of CMEs\nand CIRs [e.g., Kamide et al., 1998; Wilken et al., 1999;\nGonzalez et al., 2002, and references therein], whilst the\neffects of CMEs and CIRs in the region of low-Earth orbit\nhave also been the subject of recent investigation [e.g.,\nDmitriev et al., 2005]. A recent report by Borovsky and\nDenton [2006] contains a review of the differences between\nCME- and CIR-dominated solar wind and examines the\nrespective signatures of each in a number of regions,\nincluding the solar wind, the magnetosphere, and the auroral\nzone.\n[4] The temporal and spatial evolution of geomagnetic\nstorms has been the subject of intense experimental and\ntheoretical study even prior to the space age and numerous\nstudies of the storm process are present in the literature. A\nrecent study by Denton et al. [2005] contains a superposed\nepoch study of 283 geomagnetic storms between 1991 and\n2001. The authors show that the hot electron (\u00010.03–\n45 keV) and hot ion (\u00010.1–45 keV) densities and temper-\natures in the plasma sheet are strongly correlated with the\nphase of a geomagnetic storm and also that significant\ntemporal and spatial changes occur in the plasma in the\nperiods before and after minimum storm Dst. In the current\nstudy the aim is to analyze the structure and temporal\nevolution of plasma at geosynchronous orbit during storms\ninduced by solar wind dominated by material from CMEs\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 111, A07S07, doi:10.1029\/2005JA011436, 2006\n1Space Science and Applications (ISR-1), Los Alamos National\nLaboratory, Los Alamos, New Mexico, USA.\n2Now at School of Physics and Astronomy, University of Southampton,\nSouthampton, UK.\n3Institute of Geophysics and Planetary Physics, University of\nCalifornia, Los Angeles, Los Angeles, California, USA.\n4Atmospheric, Oceanic and Space Sciences Department, University of\nMichigan, Ann Arbor, Michigan, USA.\nCopyright 2006 by the American Geophysical Union.\n0148-0227\/06\/2005JA011436$09.00\nA07S07 1 of 12\n(usually termed interplanetary coronal mass ejections\n(ICMEs)) and compare these data with periods when the\nsolar wind is dominated by CIRs, the goal being to\ndetermine how the magnetosphere responds to each type\nof driver. We use data from seven magnetospheric plasma\nanalyzer (MPA) instruments on board Los Alamos National\nLaboratory (LANL) satellites in geosynchronous orbit to\nachieve this aim. LANL\/MPA data are analyzed for a set of\n78 ICME-dominated solar wind events and compared with\ndata from a set of 32 CIR-dominated solar wind events,\nusing a superposed epoch technique. Specifically, and as an\nextension of the Denton et al. [2005] study, we perform a\nsuperposed epoch analysis of LANL\/MPA geosynchronous\ndata from ICME- and CIR-dominated solar wind intervals\nto determine the storm time and local time variation of the\nion and electron density and temperature for each type of\nsolar wind driver.\n[5] Geosynchronous orbit is an ideal location from which\nto study plasma sheet access to the inner magnetosphere\nand LANL\/MPA data have been used extensively to study\nthe region and its structure and temporal evolution [e.g.,\nThomsen et al., 1998, 2001, 2003; Borovsky et al., 1998;\nKorth et al., 1999; Friedel et al., 2001; Korth and Thomsen,\n2001; Denton et al., 2005; Lavraud et al., 2005]. Geosyn-\nchronous orbit typically lies within the nightside plasma\nsheet over a range of local time that is wider for stronger\nconvection [e.g., Korth et al., 1999]. Since the plasma sheet\nis known to be a significant source of the ring current, the\nobserved differences in the properties of the plasma sheet\ninjected to the inner magnetosphere during ICME and CIR\nevents are useful to determine the character, composition\nand strength of the subsequent ring current. Such informa-\ntion is also likely to assist in providing realistic boundary\nconditions for physics-based ring current models which use\ngeosynchronous data as an input [e.g., Jordanova et al.,\n1997; Liemohn et al., 2001].\n2. Instrumentation\n[6] Data for this study are provided by the MPA instru-\nments flown by LANL on seven satellites located in\ngeosynchronous orbit. The MPA instrument is an electro-\nstatic analyzer which measures the three-dimensional\nenergy-per-charge distributions of ions and electrons at\nenergies \u00011–45 keV\/q at a time cadence of one ten-second\nsnapshot every 86 s. For this study we use the spin-averaged\nmoments computed from the full distributions which pro-\nvide density and temperature measurements for the elec-\ntrons and ions [Thomsen et al., 1998].\n[7] Typically, the moments of the particle distribution for\nthe hot electrons in the energy range \u00010.03–45 keVand the\nhot protons in the energy range \u00010.1–45 keVare calculated\nunder the assumption that the entire ion population consists\nof protons. A full description of the LANL\/MPA instrument\nmay be found in the work of Bame et al. [1993] and\nMcComas et al. [1993].\n3. Data Selection and Analysis\n[8] Initially, two subsets of the entire LANL\/MPA dataset\nare examined using a superposed epoch analysis technique\nthat is equivalent to that employed by Denton et al. [2005].\nFirst, the list of ICME events (1996–2002) from Cane and\nRichardson [2003] is studied, and the time interval during\nwhich each ICME occurred is noted. Then the Dst index is\nexamined and the zero epoch of each event is set to the time\nof the first clear minimum that occurs in the index following\nthe ICME arrival at the magnetopause (this time must occur\nat least one hour following the ICME start time). Events are\nrejected when either (1) a subsequent event occurs within\nthe 72 hours after the initial event, or (2) no clear minimum\nin Dst occurs in the period following the ICME arrival,\nindicating possibly disturbed conditions within the magne-\ntosphere when the ICME arrived. We neglect effects due to\nthe structure within the ICME itself [e.g., Zhang et al.,\n2004]. The aim of rejecting such events is to only use\n‘‘clean’’ storms in the subsequent analysis, rather than\nevents where the nature of the storm may be masked by\nan already disturbed magnetosphere. Application of these\ncriteria provides a list of the times of minimum Dst\nfollowing the impact of ICME-dominated solar wind on\nthe magnetosphere between 1996 and 2002, a total of 78\nevents, hereafter referred to as Group A events.\n[9] To obtain a list of CIR-dominated solar wind events,\nsolar wind data taken by the WIND spacecraft between\n1994 to 2002 are analyzed and a number of stream inter-\nfaces identified, based upon their typical signatures in the\nsolar wind (see references in section 1), specifically, (1) the\nsolar wind velocity changes from less than 350 km s\u00021 to\nmore than 550 km s\u00021, (2) the solar wind density peaks\nslowly and drops suddenly at the interface, (3) the total\nmagnetic field attains a maximum, and (4) the azimuthal\nflow angle of the solar wind plasma changes from west of\nthe Sun to east of the Sun, with the interface at the zero\ncrossing of angle. The Dst index is then examined and the\nzero epoch for each event is set to the time of the first clear\nminimum in Dst following the CIR arrival at the magneto-\npause (at least one hour after the identification of a CIR at\nthe orbit of the WIND spacecraft). Again, events are\nrejected when either (1) a subsequent event occurs within\nthe 72 hours after the initial event or, (2) no clear minimum\nin Dst occurs in the period following the CIR arrival. These\ncriteria provide a list of the times of minimum Dst following\nthe arrival of CIR-dominated solar wind at the magneto-\nsphere, a total of 32 events, subsequently referred to as\nGroup C events.\n[10] The Dst index is chosen to order the storms even\nthough ICME-dominated solar wind generally causes a\nlarger signature in Dst compared to CIR-dominated solar\nwind. Our primary interest is the nature of the storm\ninduced by different types of solar wind and the effects\nupon the plasma sheet population, and subsequent ring\ncurrent. The minimum Dst for each storm gives a conve-\nnient way to perform a superposed epoch analysis, partic-\nularly since the Dst index is influenced by the ring current\nstrength. Also, it should be noted that by analyzing data\nfrom a full day before the minimum Dst to two and a half\ndays after minimum Dst, we are sure to encompass the\neffects of the ICME or CIR. To compare between storms of\nsimilar size, a further subset of the Group A events is\ndefined where the minimum storm Dst for each storm is\n>\u0002100, a total of 45 events subsequently referred to as\nGroup B events. The average Dst of Group B events is very\nsimilar to the Group C events allowing investigation of the\nA07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS\n2 of 12\nA07S07\neffects of ICME- and CIR-driven storms, irrespective of\nstorm size. The nature of the analysis is biased against\nperiods when the magnetosphere is already in a disturbed\nstate, as measured by Dst. Since we are primarily interested\nin the effects of storms upon a quiet magnetosphere, we do\nnot consider such bias significant.\n[11] For all groups we bin the LANL\/MPA data using the\nsame method described by Denton et al. [2005]. In that\nstudy, the LANL\/MPA data were analyzed to provide the\naverage hot electron and hot ion density, as a function of\nepoch time, for 283 storms between 1990 and 2001. In the\ncurrent study, we take LANL\/MPA measurements of hot\nelectron and hot ion temperature and density and bin each\nmeasurement into one of 24 local-time bins and 96 epoch-\ntime bins covering the 24 hours before the zero epoch and\nthe 72 hours after. Magnetosheath and boundary layer\nintervals are removed by restricting the analysis to data\npoints where the hot ion density is less than 3 cm\u00023 and the\nperpendicular ion temperature exceeds 2000 eV. The mean\nof the values in each bin is calculated noting that each bin\nmust have at least five counts or it is considered empty and\nplotted grey. Data are plotted from one day before the zero\nepoch to two and a half days after, the period when data\ncoverage is greatest. The mean Kp and Dst indices are\ncalculated during this period by taking the appropriate Kp\nand Dst for every data point and averaging the results as a\nfunction of epoch time (with the Kp index converted to a\ndecimal value). In this way we produce plots of the mean\ntemperature and density following a ICME- or CIR-driven\nstorm, along with the mean Kp and Dst during these\nintervals. These indices are used as a proxy for the magne-\ntospheric convection strength, and the ring current strength,\nrespectively.\n4. Results\n[12] Figure 1 shows the distribution of the ICME and CIR\nevents and the corresponding minimum Dst for each event.\nAs can be seen, most of the CIR events occurred close to\nsolar minimum (\u00011996) and during the declining phase of\nthe solar cycle. In contrast, the number of ICME events, and\ntheir strength, increased towards solar maximum (\u00012001).\nOn average, the ICME events have a greater signature in the\nDst index than the CIR events.\n[13] Figure 2 shows the mean Kp and Dst indices for\nGroups A, B, and C, between 1994 and 2002, as a function\nof epoch time and local time. Kp values greater than 3\u0001 are\ncolored dark grey. The averaged Dst profiles of the three\ngroups are very similar in shape, displaying a sharp fall to\nminimum Dst, followed by a recovery period lasting at least\n24 hours. Figure 2 also indicates that while a stronger ring\ncurrent is likely during ICME-driven storms, the Kp index\nremains elevated for much longer following the main phase\nof the CIR-driven storms. Since Kp is primarily a measure\nof the magnetospheric convection strength [e.g., Thomsen,\n2004], this demonstrates that following the main phase of\nthe CIR-driven storms, the convection is elevated for a\nlonger period. This, in turn, implies a longer period of\ndelivery of plasma sheet material to the inner magneto-\nsphere for the CIR storms than for the ICME storms.\n[14] For the Group A events shown in Figure 2a there is a\nclear storm-like Dst signature, with an average minimum\nDst at zero epoch of \u000286.54 and an average Kp at zero\nepoch of \u00015\u0001. In contrast the average Dst and Kp values at\nzero epoch for the Group B events in Figure 2b are \u000255.58\nand \u00014\u0001, respectively. The averaged Dst and Kp for the\nGroup C events shown in Figure 2c are \u000258.93 and \u00014+,\nrespectively. It should be noted that the averaged Dst\nprofiles in Figure 2b and 2c are very similar. Thus when\nanalyzing the data, we are able to compare the differences\nbetween ICME and CIR storms of a similar size, as\nmeasured by Dst.\n[15] Figure 3 shows the averaged hot ion and hot electron\ndensities for Group A, B, and C events, as a function of\nepoch time and local time. Bins colored grey indicate a lack\nof data, and bins colored white indicate values greater than\nthe maximum on the color bar. A fall in the Dst index is\ntypically accompanied by the plasma sheet moving inward\nof geosynchronous orbit, with the greatest increase in the\nion and electron densities occurring during the main phase\nof the storm at, or close to, minimum Dst. The hot ion\ndensity in Figure 3a shows a significant increase around 12\nhours prior to minimum Dst. The density increase occurs\ninitially close to local midnight and then spreads in local\ntime, until densities are increased at all local times. The\ndensity is maximized close to minimum Dst and then\ndecreases over the next \u00012 days to approximately prestorm\nlevels. Figure 3c shows that when the largest events are\nexcluded, the hot ion density follows the same trend as\nshown in Figure 3a, but the density at minimum Dst is\nlower. Figure 3e shows the mean hot ion density of the\nGroup C events. The density behavior during these events\nappears quite different from that during the ICME events,\neven though the averaged Dst profile is very similar\n(compare Figure 3c with Figure 3e). The enhanced density\nevident in the Group C events is primarily restricted to the\ntime prior to, and at, Dst minimum, and this enhancement\ndoes not spread as much in local time as during the ICME\nevents. The density at local noon is largely unchanged\nduring the storm. As with the ICME events, the period of\nFigure 1. The distribution of ICME events and CIR events\nused in this study. Most CIR events occur in the declining\nphase of the solar cycle while ICMEs are most probable\nclose to solar maximum. ICME events typically produce a\ngreater signature in Dst.\nA07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS\n3 of 12\nA07S07\nminimum Dst for CIR storms, is approximately the time of\nhighest ion density, but the density returns to pre-storm\nlevels within \u000124 hours. This is much quicker than for the\nICME events, even though the decay in Dst is similar for\nboth the ICME and CIR events (see Figure 2).\n[16] With regard to the electrons, the density trends in a\nsimilar way as for the ions. Figure 3b shows that the average\nhot electron density for the Group A events peaks close to\nminimum Dst, and the peak is centered close to dawn. The\ninitial increase in density prior to the storm also appears to\nbe offset from local midnight towards the postmidnight\nsector. Electron density remains enhanced for at least 48\nhours following minimum Dst. As shown by Korth et al.\n[1999], there is typically no increase in hot electron density\nbetween \u00011200 and 1800 LT, no matter how strong the\nconvection strength. Therefore the increase in electron\ndensity during these storms is constrained to the region\nbetween dusk and the prenoon sector. Comparing Figure 3b\nwith Figure 3d, which shows the Group B events, we see\nthat the strength of the storms appears to be related to\nthe subsequent hot electron density at geosynchronous orbit\n- the larger the storm (as measured by Dst) the greater\nthe density [Thomsen et al., 1998; Denton et al., 2005].\nFigure 3f shows the averaged hot electron density for the\nGroup C events. Clearly, although the Group B and\nGroup C storms have a very similar Dst profile, the\nchanges in electron density during the storm are signifi-\ncantly different. The electron density returns to prestorm\nlevels much faster during the CIR events than during the\nICME-driven storms. This is despite the indication from\nthe Kp index that the convection remains enhanced for the\nCIR-driven storms much longer than during both sets of\nICME-driven storms.\n[17] Results from the superposed analysis for the hot ion\nand hot electron temperatures are shown in Figure 4 for\nGroup A, B, and C events, as a function of epoch time and\nlocal time. The temperatures are calculated by taking the\naverage of twice the perpendicular temperature plus the\nparallel temperature. Figure 4a shows the hot ion tempera-\nture for the Group A events. Two prominent features are\nnoticeable. First, the temperature during the main phase of\nthe storm is typically lower at dawn than it is at dusk, a\nresult that is true during quiet and disturbed times [Korth et\nal., 1999] and largely due to the different drift paths that the\nions may take through the system. (The higher-energy\nfraction of the ions which proceed toward the dawnside\nare preferentially lost due to particle precipitation). Second,\nwith regard to the changes in ion temperature during the\nstorm, it appears that the temperature in the afternoon sector\nis slightly increased close to minimum Dst (to \u00019000 eV).\nIn contrast, in the dawn sector the temperature appears to\nfall during the main phase and reach a minimum around\nzero epoch (\u00014000 eV).\n[18] Comparing Figure 4a with Figure 4c which show the\nion temperatures for the Group A and Group B events, it is\nevident that the size of storm may play some role in\nmodulating the temperature of the plasma sheet, with a\nslightly higher temperature in the afternoon sector for the\nstorms with a smaller Dst signature. The hot ion temperature\nexceeds 10,000 eV close to noon for the smaller ICME\nstorms, whereas the temperature is \u00019000 eV for the larger\nICME storms. The temperature during the Group C events,\nFigure 2. The mean Dst and Kp indices for the three data\nsets used in the study; (a) Group A - all 78 ICME events, (b)\nGroup B - the 45 ICME events with minimum Dst > \u0002100,\nand (c) Group C - the 32 CIR events, as a function of epoch\ntime and local time. Kp values greater than 3 are colored\ndark grey.\nA07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS\n4 of 12\nA07S07\nshown in Figure 4e is much higher than during the ICME\nstorms. This result is even clearer for the electrons, with\nthe temperature for the Group A and B storms, shown in\nFigure 4b and 4d, remaining elevated for less time than for\nthe Group C storms shown in Figure 4f. We discuss\npossible reasons for this observation in section 5.\n[19] In Figure 5 the measured spacecraft charging for\nICME-driven and CIR-driven geomagnetic disturbances is\nexamined. For some time it has been known that CIR-driven\nstorms are more effective at producing relativistic electrons\nin the outer radiation belts than are ICME-driven storms\n[e.g., Paulikas and Blake, 1976; Mann et al., 2004].\nConsistent with this, the occurrence frequency of internal-\ncharging anomalies on geosynchronous spacecraft peaks\nduring the declining phase of the solar cycle [Wrenn and\nSmith, 1996]. Although CIR-driven storms can produce\nstrong spacecraft charging [e.g., Knipp et al., 1998], the\noccurrence frequency of spacecraft anomalies attributed to\nspacecraft surface charging peaks at solar maximum [Wrenn\nand Smith, 1996]. To further differentiate between the\nICME events which produce the largest signature in Dst,\nwe define a new group of events, Group D, which consists\nof the ICME events where the minimum Dst < \u0002100. In\nFigure 5 the spacecraft-charging voltages produced by\nFigure 3. The hot ion and hot electron densities for the three data sets used in the study; (a) and\n(b) Group A - all 78 ICME events, (c) and (d) Group B - 45 ICME events with minimum Dst > \u0002100,\nand (e) and (f) Group C - 32 CIR events, as a function of epoch time and local time.\nA07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS\n5 of 12\nA07S07\nICMEs and CIRs at geosynchronous orbit can be compared.\nFigures 5a, 5b, and 5d pertain to ICME events and Figure 5c\npertains to CIR events. Clearly, the levels of spacecraft\ncharging during CIR events are higher than the levels for\nICMEs, even for ICMEs that drive very strong storms\n(Figure 5d). Note that the measurements in Figure 5 include\neclipse and noneclipse intervals; the relationship between\nhot plasmas and spacecraft charging differs dramatically for\neclipse and noneclipse times. (The Earth’s shadow falls on\ngeosynchronous orbit for an interval of about ±0.5 hours of\nlocal time around local midnight near the equinoxes). In\nFigure 6 the eclipse intervals are removed and spacecraft-\ncharging in noneclipse times can be examined. Again,\nFigures 6a, 6b, and 6d pertain to ICME events and\nFigure 6c pertains to CIR events. The levels of spacecraft\ncharging during CIR events are statistically much higher\nthan the levels for ICMEs, even for ICMEs that drive strong\nstorms (Figure 6d). As can be seen in both Figure 5 and\nFigure 6, the duration of the charging (days for CIR events,\nseveral hours for ICMEs) is longer for CIR events and the\nlocal-time width of the charging region on the nightside is\ngreater for CIR events. It is well known that spacecraft-\ncharging voltages are correlated with the temperature of the\nambient electrons [e.g.,Garrett, 1981; Thomsen et al., 1999];\nknowing this, Figures 5 and 6 are consistent with Figure 4\nwhich shows that the electron temperatures throughout the\nFigure 4. The hot ion and hot electron temperatures for the three data sets used in the study; (a) and (b)\nGroup A - all 78 ICME events, (c) and (d) Group B - 45 ICME events with minimum Dst > \u0002100, and (e)\nand (f) Group C - 32 CIR events, as a function of epoch time and local time.\nA07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS\n6 of 12\nA07S07\nnightside are much higher, and remain elevated for longer,\nduring CIR events than for ICME events.\n5. Discussion\n[20] Previous studies have well-documented the differ-\nences between ICME- and CIR-dominated solar wind (see\nreferences in section 1). The effects of each type of solar\nwind when it impinges upon the Earth’s magnetosphere\nhave been examined by numerous authors. Data from the\nGeotail spacecraft have been presented by Wilken et al.\n[1999] and show the broad response of the magnetosphere\nto ICME and CIR storms during the first half of 1994.\nStudies by Zong et al. [1997] and Wilken et al. [1998]\nhighlight the response of the ion composition in the\nmagnetotail in response to an isolated substorm and the\nleading phase of a CIR, respectively. A recent study by\nBorovsky and Denton [2006] includes a review of the\ndifferences that exist between ICME and CIR events by\ntabulating their character and their effects in a number of\nregions, including the solar wind, the magnetosphere and\nthe auroral zone.\n[21] Further investigation of the characteristics of ICME-\nand CIR-driven geomagnetic storms is particularly timely in\nview of the conclusion of Kamide et al. [1998] that ICMEs\nand CIRs ‘‘are found to be the primary phenomena respon-\nsible for the main phase of the geomagnetic storm.’’ The\nwork presented in the current study is specifically focused\non the differences between ICME and CIR events in the\ninner magnetosphere. By separating the effects of storms\ncaused by these different solar wind conditions, analysis of\nLANL\/MPA data indicates that the nature of the plasma at\ngeosynchronous orbit can be very different when ICME- or\nCIR-dominated solar wind interacts with the Earth’s mag-\nnetosphere. A particular point to note is that the hot ion and\nhot electron densities for ICME-driven storms are typically\nmuch greater than for CIR-driven storms, especially after\nthe time of minimum Dst. The electron and ion density at\nthe time of minimum Dst appears to be directly related to the\nmagnitude of the Dst, with higher densities during the larger\nstorms. In addition, despite periods where the convection\nremains at a more elevated level during the CIR events, the\ndensity following the main phase of the storm is typically\nmuch lower for the CIR events compared with the\nICME events. The reason for this is likely related to the\ndifferent nature of the plasma sheet formed under ICME-\nand CIR-dominated solar wind conditions. It is clear that the\nplasma sheet density is directly related to the size of the\nstorm, when driven by an ICME. What is also clear is that\nCIR events coincide with a plasma sheet that has a signif-\nicantly lower density than that measured during ICME\nevents, even when the storms, as measured by Dst, are\nequivalent in size. Since the density of the plasma sheet is\nstrongly coupled with the density of the ambient solar wind\nFigure 5. The averaged (negative) spacecraft potential for (a) Group A - all 78 ICME events, (b) Group\nB - 45 ICME events with minimum Dst > \u0002100, (c) Group C - 32 CIR events, and (d) Group D - 33\nICME storms with minimum Dst < \u0002100 -, as a function of epoch time and local time. The magnitude of\nthe spacecraft potential is much greater for the CIR events, compared with ICME events.\nA07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS\n7 of 12\nA07S07\n[e.g., Terasawa et al., 1997; Borovsky et al., 1998], and\nsince density in ICMEs is typically greater than that in\nCIRs, it is logical that CIR-driven storms should have a\nlesser density signature in the geosynchronous data, than\nICME-driven storms. In addition, the ionospheric compo-\nnent of the plasma sheet, as measured at geosynchronous\norbit, is very much enhanced at solar maximum [e.g.,\nDenton et al., 2005]. During the extended period of en-\nhanced convection during CIR events the plasma sheet\nwhich is injected to the inner magnetosphere via geosyn-\nchronous orbit has a density up to a factor of 2 lower than\nduring the ICME events.\n[22] The solar wind speed is also directly related to the\ntemperature of the plasma sheet [Borovsky et al., 1998],\nwith a higher temperature plasma sheet being formed under\nconditions of high solar wind speed. Since CIR-dominated\nsolar wind is directly associated with high speed solar wind,\nit is also logical that CIR-driven storms should have a\nhigher temperature signature in the geosynchronous data\nthan ICME-driven storms.\n[23] As shown in Figure 1, ICME- and CIR-driven storms\ntend to occur during different parts of the solar cycle.\nComparison of the plasma sheet properties during the two\nkinds of storm is therefore complicated by the role of the\nionosphere. Large changes in composition between solar\nmaximum and solar minimum are known to occur in the\nionosphere [e.g., Heelis et al., 1990; West et al., 1997;\nDenton and Bailey, 2001], and such compositional changes\nmay be reflected in the inner magnetosphere and plasma\nsheet composition [e.g., Young et al., 1982; Lockwood et\nal., 1985; Yau et al., 1985; Lennartsson, 1988; Daglis et al.,\n1999; Nose´ et al., 2000; Fu et al., 2001; Denton et al.,\n2005]. Although the LANL\/MPA instrument is a simple E\/q\nanalyzer, and the production moments are calculated under\nthe assumption that all ions are protons, Denton et al.\n[2005] outlined a method by which, under certain circum-\nstances, the oxygen and hydrogen ion densities may be\ninferred. To investigate the composition of the plasma at\ngeosynchronous orbit for ICME- and CIR-driven storms,\nthe averaged inferred O+ and H+ densities are calculated\nbetween 2300 and 0200 LT as a function of epoch time,\nusing the same method as described by Denton et al. [2005].\nWe do not repeat the description of that method here, simply\nnoting that the method is only considered valid when: (1)\nthe hot plasma sheet population measured by LANL\/MPA is\nmuch denser than the population of cold plasma from the\nplasmasphere and, (2) the contribution of higher-energy\npopulations is negligible. These conditions are typically\nsatisfied in the region close to local midnight, when a fresh\nplasma sheet population is present. Since the events studied\nare storm periods, it is likely that the plasma is freshly\ninjected from the tail and it is assumed that the conditions\ndescribed above are met.\n[24] Figure 7 shows the inferred O+ and H+ densities, and\ntheir ratio, averaged between 2300 and 0200 LT as a\nfunction of epoch time for Group A, B, and C events.\nFigure 6. Same as Figure 5 except we remove all times when the spacecraft is in the Earth’s shadow.\nThe magnitude of the potential is much greater for the CIR events, compared with ICME events, and the\nelevated spacecraft potential lasts for a longer time.\nA07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS\n8 of 12\nA07S07\nThere is some evidence of an increase in the H+ component\nof the plasma sheet, for all types of storm, which begins\nduring the main phase, around 12 to 16 hours prior to the\nminimum storm Dst. The inferred H+ density then appears\nto fall slightly toward minimum Dst, and remains fairly\nstatic during the recovery phase. The maximum density is\nbetween 0.6 and 0.8 cm\u00023, while the minimum density is\naround 0.3 cm\u00023. There appears to be little difference in the\nH+ density between Group A and Group B events, with the\nH+ density in both groups slightly higher on average than\nduring the Group C events.\n[25] The inferred O+ density appears to vary significantly\nmore than the H+ density through the storms, a result in\nagreement with the storm-time ion composition behavior\nnoted by Denton et al. [2005]. In addition, the increase in\nO+ density is greatest for the Group A events than for the\nGroup B and Group C events, indicating more heavy-ion\ncontent in the plasma sheet for larger storms driven by\nICMEs. The O+\/H+ density ratio also shows this feature,\nsuggesting that for the Group A events, the O+ density and\nH+ densities may be comparable during the main phase of\nthe storm. The O+ density appears to be lowest for the\nGroup C events, indicating that ICME-driven storms are\noxygen-rich, whilst CIR storms are oxygen-poor. Although\nthese results are inferred from a technique that has yet to\nbe validated with other independent measurements, they\nare in agreement with other studies of the storm-time and\nsolar cycle variation of ion composition and ring current\ncomposition [e.g., Young et al., 1982; Yau et al.,. 1985;\nVennerstrøm and Friis-Christensen, 1996; Nose´ et al.,\n2000; Hamilton et al., 1988] which indicate solar cycle\nand geomagnetic activity variations in ionospheric outflow\nand subsequent plasma sheet composition. Denton et al.\n[2005] have recently shown a clear factor of two variation\nin the hot electron density at geosynchronous orbit over a\nsolar cycle. Since the solar wind composition is fairly\nconstant over a solar cycle, it can be assumed that either\n(1) the solar cycle variation in the ionosphere is respon-\nsible for this behavior, or (2) the ICME and CIR storms\noperate differently in uplifting O+ from the ionosphere and\ndelivering it to the plasma sheet. ICMEs typically occur\nclose to solar maximum, when outflow of the heavier ions\n(e.g., He+ and O+) is maximized. CIRs typically occur\nclose to solar minimum, when outflow of the heavier ions\nis minimized. Thus, the initial O+ and H+ densities prior to\nthe storm are likely determined by the phase of the solar\nFigure 7. The averaged inferred H+ and O+ densities and their ratio, as a function of storm time, for\nGroup A, Group B, and Group C events, between 2300 and 0200 LT.\nA07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS\n9 of 12\nA07S07\ncycle [Denton et al., 2005]. Superimposed on this behavior\nis a storm time change in the density of each ion, that\nappears to be greater for the O+ ions than the H+ ions, and\nis greatest during the largest ICME-driven storms.\n6. Conclusions and Summary\n[26] The analyses detailed above show that there are\nsignificant differences in the geosynchronous plasma envi-\nronment during ICME-driven storms when compared with\nCIR-driven storms. The averaged hot electron and hot ion\ndensities increase significantly during the main phase of\nboth types of storm, but the increase is greater for ICME\nevents than for CIR events, even when the size of the storm,\nas measured by the Dst index, is roughly equivalent.\nFurther, we find that the hot electron and hot ion\ntemperatures are enhanced during both types of storm, but\nare more enhanced, and for longer, during CIR events\nthan ICME events. We find ICMEs play a greater role\nin regulating the plasma sheet density, whilst CIRs play a\ngreater role regulating the plasma sheet temperature.\nOther significant features of ICME- and CIR-driven storms,\nas observed at geosynchronous orbit are highlighted in\nTable 1.\n[27] To summarize, we note the following:\n[28] 1. The density of a significant source population for\nthe ring current, the electron and ion plasma sheet, is likely\nto be more enhanced for ICME events than for CIR events,\n[29] 2. The temperature of the plasma sheet is, on\naverage, significantly elevated for a longer time during\nCIR events than during ICME events,\n[30] 3. Inferred density measurements indicate ICME\nstorms are rich in O+ compared to CIR storms. The O+\nfraction is greater for the larger storms,\n[31] 4. The magnitude of spacecraft potential is, on\naverage, significantly elevated for a longer time during\nCIR events than during ICME events - CIR events create\nTable 1. A Summary of the Effects of ICME- and CIR-Dominated Solar Wind Detected in the Plasma at Geosynchronous Orbit\nICME Storms CIR Storms\nSolar wind conditions Ejecta from sun produce an\nisolated peak in the solar\nwind density which can last\nhours or days.\nInteraction of fast and slow\nsolar wind. High solar wind\nspeed which declines slowly\n(hours or days).\nMagnetospheric convection Isolated period of elevated\nconvection returning to low\nlevels usually over a period\nof hours.\nExtended period of enhanced\nconvection which can\nlast days.\nPlasma sheet ion density\n(\u00011–45 keV)\nInitial density enhancement\nclose to local midnight.\nDensity peaks close to\nminimum Dst and highest\nbetween midnight and\ndawn. Plasma sheet density\nregularly in excess of 1.2 cm\u00023.\nDensity remains\nelevated for upwards of 24 hours.\nInitial density enhancement\nclose to local midnight.\nDensity peaks close to\nminimum Dst and highest\nbetween midnight and dawn.\nPlasma sheet density\noccasionally in excess of 1.2 cm\u00023.\nDensity remains\nelevated for less than\n24 hours.\nPlasma sheet ion temperature\n(\u00011–45 keV)\nTemperature weakly\ncorrelated with storm\nactivity, with slight increase\nclose to local noon near\nminimum Dst.\nTemperature increase during\nstorm between local noon\nand midnight. Temperature\nremains elevated for days.\nPlasma sheet electron density\n(\u00011–45 keV)\nInitial density enhancement\nin post-midnight region.\nDensity peaks close to\nminimum Dst and highest\nbetween midnight and\ndawn. Plasma sheet density\nregularly in excess of 1.4 cm\u00023.\nInitial density enhancement\nin post-midnight region.\nDensity peaks close to\nminimum Dst and highest\nbetween midnight and dawn.\nPlasma sheet density\noccasionally in excess of\n1.4 cm\u00023.\nPlasma sheet electron temperature\n(\u00011–45 keV)\nTemperature correlated\nwith storm phase.\nTemperature increase\nduring main phase close to\nlocal midnight.\nTemperature quickly\nreturns to pre-storm levels\nduring recovery phase.\nTemperature increase during\nstorm, with maximum \u00013000 eV\nclose to local midnight.\nTemperature remains\nelevated for days.\nPlasma sheet composition Evidence for enriched O+,\nand to a lesser extent, H+ density,\nduring main phase\nof storm - likely solar cycle related.\nSlight enhancement in O+\nduring main phase.\nSpacecraft potential Elevated during storm. Highly elevated in\nmagnitude. Effects last days.\nA07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS\n10 of 12\nA07S07\na dangerous charging environment for a longer time period\nthan ICME events.\n[32] Acknowledgments. The authors would like to thank the World\nData Centre C1 at RAL, UK for the Dst and Kp data, and all members of\nthe WIND team for access to the solar wind data. M. H. Denton wishes to\nthank P. H. Janzen for many helpful discussions. The work at Los Alamos\nwas performed under the auspices of the U.S. Department of Energy, with\npartial support from the NASA Living With a Star program.\n[33] Shadia Rifai Habbal thanks Edward J. Smith and another referee\nfor their assistance in evaluating this paper.\nReferences\nBame, S. J., D. J. McComas, M. F. Thomsen, B. L. Barraclough, R. C.\nElphic, J. P. Glore, J. C. Chavez, E. P. Evans, and F. J. Wymer (1993),\nMagnetospheric plasma analyzer for spacecraft with constrained re-\nsources, Rev. Sci. Instrum., 64, 1026–1033.\nBorovsky, J. E., and M. H. Denton (2006), The differences between CME-\ndriven storms and CIR-driven storms, J. Geophys. Res., doi:10.1029\/\n2005JA011447, in press.\nBorovsky, J. E., M. F. Thomsen, R. C. Elphic, T. E. Cayton, and D. J.\nMcComas (1998), The transport of plasma sheet material from the distant\ntail to geosynchronous orbit, J. Geophys. Res., 103, 20,297–20,331.\nCane, H. V., and I. V. Richardson (2003), Interplanetary coronal mass\nejections in the near-Earth solar wind during 1996–2002, J. Geophys.\nRes., 108(A4), 1156, doi:10.1029\/2002JA009817.\nCrooker, N. U., and E. W. Cliver (1994), Postmodern view of M-regions,\nJ. Geophys. Res., 99, 23,383–23,390.\nDaglis, I. A., G. Kasotakis, E. T. Sarris, Y. Kamide, and B. Wilken (1999),\nVariations of the ion composition during an intense magnetic storm and\ntheir consequences, Phys. Chem. Earth, 24, 229–232.\nDenton, M. H., and G. J. Bailey (2001), Modelling the high altitude elec-\ntron temperature: A modified thermal conductivity, Dyn. Atmos. Oceans,\n34, 365–381.\nDenton, M. H., M. F. Thomsen, H. Korth, S. Lynch, J. C. Zhang, and M. W.\nLiemohn (2005), Bulk plasma properties at geosynchronous orbit,\nJ. Geophys. Res., 110, A07223, doi:10.1029\/2004JA010861.\nDmitriev, A. V., N. B. Crosby, and J.-K. Chao (2005), Interplanetary\nsources of space weather disturbances in 1997 to 2000, Space Weather,\n3, S03001, doi:10.1029\/2004SW000104.\nFriedel, R. H. W., H. Korth, M. G. Henderson, M. F. Thomsen, and J. D.\nScudder (2001), Plasma sheet access to the inner magnetosphere, J. Geo-\nphys. Res., 106, 5845–5858.\nFu, S. Y., B. Wilken, Q. G. Zong, and Z. Y. Pu (2001), Ion composition\nvariations in the inner magnetosphere: Individual and collective storm\neffects in 1991, J. Geophys. Res., 106, 29,683–29,704.\nGarrett, H. B. (1981), The charging of spacecraft surfaces, Rev. Geophys.,\n19, 577.\nGonzalez, W. D., B. T. Tsurutani, and A. L. Clu´a de Gonzalez (2002),\nGeomagnetic storms contrasted during solar maximum and solar mini-\nmum, Adv. Space Res., 30, 2301–2304.\nGosling, J. T., J. R. Asbridge, S. J. Bame, and W. C. Feldman (1978), Solar\nwind stream interfaces, J. Geophys. Res., 83, 1401–1412.\nGosling, J. T., G. Borrini, J. R. Asbridge, S. J. Bame, W. C. Feldman, and\nR. T. Hansen (1981), Coronal streamers in the solar wind at 1 AU,\nJ. Geophys. Res., 86, 5438–5448.\nHamilton, D. C., G. Gloeckler, F. M. Ipavich, W. Studemann, B. Wilken,\nand G. Kremser (1988), Ring current development during the great geo-\nmagnetic storm of February 1986, J. Geophys. Res., 93, 14,343–14,355.\nHeelis, R. A., W. B. Hanson, and G. J. Bailey (1990), Distributions of He+\nat middle and equatorial latitudes during solar maximum, J. Geophys.\nRes., 95, 10,313–10,320.\nHundhausen, A. J. (1993), Sizes and locations on coronal mass ejections:\nSMM observations from 1980 and 1984–1989, J. Geophys. Res., 98,\n13,177–13,200.\nJordanova, V. K., J. U. Kozyra, A. F. Nagy, and G. V. Khazanov (1997),\nKinetic model of the ring current-atmosphere interactions, J. Geophys.\nRes., 102, 14,279–14,291.\nKamide, Y., et al. (1998), Current understanding of magnetic storms:\nStorm-substorm relationships, J. Geophys. Res., 103, 17,705–17,728.\nKnipp, D. J., et al. (1998), An overview of the early November 1993\ngeomagnetic storm, J. Geophys. Res., 103, 26,197.\nKorth, H., and M. F. Thomsen (2001), Plasma sheet access to geosynchro-\nnous orbit: Generalization to numerical field models, J. Geophys. Res.,\n106, 29,655–29,667.\nKorth, H., M. F. Thomsen, J. E. Borovsky, and D. J. McComas (1999),\nPlasma sheet access to geosynchronous orbit, J. Geophys. Res., 104,\n25,047–25,061.\nLavraud, B., M. H. Denton, M. F. Thomsen, J. E. Borovsky, and R. H.\nFriedel (2005), Superposed epoch analysis of cold, dense plasma sheet\naccess to geosynchronous orbit, Ann. Geophys., 23, 1–11.\nLennartsson, W. (1988), Comparison of plasma sheet ion composition with\nthe IMF and solar wind, Adv. Space. Res., 8, 135–138.\nLiemohn, M. W., J. U. Kozyra, C. R. Clauer, and A. J. Ridley (2001),\nComputational analysis of the near-Earth magnetospheric current system\nduring two-phase decay storms, J. Geophys. Res., 106, 29,531–29,542.\nLockwood, M., J. H. Waite Jr., T. E. Moore, J. F. E. Johnson, and C. R.\nChappell (1985), A new source of suprathermal O+ near the dayside polar\ncap boundary, J. Geophys. Res., 90, 4099–4116.\nMacQueen, R. M., A. J. Hundhausen, and C. W. Conover (1986), The\npropagation of coronal mass ejection transients, J. Geophys. Res., 91,\n31–38.\nMann, I. R., T. P. O’Brien, and D. K. Milling (2004), Correlations between\nULF wave power, solar wind speed, and relativistic electron flux in the\nmagnetosphere: Solar cycle dependence, J. Atmos. Sol. Terr. Phys., 66,\n187.\nMcComas, D. J., S. J. Bame, B. L. Barraclough, J. R. Donart, R. C. Elphic,\nJ. T. Gosling, M. B. Moldwin, K. R. Moore, and M. F. Thomsen (1993),\nMagnetospheric plasma analyzer: Initial three-spacecraft observations\nfrom geosynchronous orbit, J. Geophys. Res., 98, 13,453–13,465.\nNose´, M., S. Ohtani, A. T. Y. Liu, S. P. Christon, R. W. McEntire, D. J.\nWilliams, T. Mukai, Y. Saito, and K. Yumoto (2000), Change of energetic\nion composition in the plasma sheet during substorms, J. Geophys. Res.,\n105, 23,277–23,286.\nPaulikas, G. A., and J. B. Blake (1976), Modulation of trapped energetic\nelectrons at 6.6 Re by the direction of the magnetic field, Geophys. Res.\nLett., 3, 277–280.\nSmith, E. J., and J. H. Wolf (1976), Observations of interaction regions and\nco-rotating shocks between one and five AU: Pioneer 10 and 11, Geo-\nphys. Res. Lett., 3, 137–140.\nTerasawa, T., et al. (1997), Solar wind control of density and temperature in\nthe near-Earth plasma sheet: WIND\/GEOTAIL collaboration, Geophys.\nRes. Lett., 24, 935.\nThomsen, M. F. (2004), Why Kp is such a good measure of magnetospheric\nconvection, Space Weather, 2, S11004, doi:10.1029\/2004SW000089.\nThomsen, M. F., J. E. Borovsky, D. J. McComas, and M. R. Collier (1998),\nVariability of the ring current source population, Geophys. Res. Lett., 25,\n3481–3484.\nThomsen, M. F., E. Noveroske, J. E. Borovsky, and D. J. McComas (1999),\nCalculation of moments from measurements by the Los Alamos magne-\ntospheric plasma analyzer, LA Rep. LA-13566-MS, Los Alamos Natl.\nLab., Los Alamos, N. M.\nThomsen, M. F., J. Birn, J. E. Borovsky, K. Morzinski, D. J. McComas, and\nG. D. Reeves (2001), Two-satellite observations of substorm injections at\ngeosynchronous orbit, J. Geophys. Res., 106, 8405–8416.\nThomsen, M. F., J. E. Borovsky, R. M. Skoug, and C. W. Smith (2003),\nDelivery of cold, dense plasma sheet material into the near-Earth region,\nJ. Geophys. Res., 108(A4), 1151, doi:10.1029\/2002JA009544.\nTsurutani, B. T., W. D. Gonzalez, A. L. C. Gonzalez, F. Tang, J. K. Arballo,\nand M. Okada (1995), Interplanetary origin of geomagnetic activity in the\ndeclining phase of the solar cycle, J. Geophys. Res., 100, 21,717–21,733.\nVennerstrøm, X., and X. Friis-Christensen (1996), Long term and solar\ncycle variation of the ring current, J. Geophys. Res., 101, 24,735.\nWest, K. H., R. A. Heelis, and F. J. Rich (1997), Solar activity variations in\nthe composition of the low latitude ionosphere, J. Geophys. Res., 102,\n295–302.\nWilken, B., Q.-G. Zong, T. Doke, T. Mukai, T. Yamamoto, G. D. Reeves,\nK. Maezawa, S. Kokubun, and S. Ullaland (1998), Substorm activity on\nJanuary 11, 1994: Geotail observations in the distant tail during the\nleading phase of a corotating interaction region, J. Geophys. Res., 103,\n17,671–17,689.\nWilken, B., Q.-G. Zong, G. D. Reeves, T. Doke, and T. Yamamoto (1999),\nGeoactivity in response to CIR\/CME events - A synoptic view, Phys.\nChem. Earth C, 24(1–3), 113–117.\nWrenn, G. L., and R. J. K. Smith (1996), Probability factors governing\nESD effects in geosynchronous orbit, IEEE Trans. Nucl. Sci., 43,\n2783.\nYau, A. W., P. H. Beckworth, W. K. Peterson, and E. G. Shelley (1985),\nLong term (solar cycle) and seasonal variations of upflowing iono-\nspheric ion events at DE 1 altitudes, J. Geophys. Res., 90, 6395–\n6407.\nYoung, D. T., H. Balsiger, and J. Geiss (1982), Correlations of magneto-\nspheric ion composition with geomagnetic and solar activity, J. Geophys.\nRes., 87, 9077–9096.\nZhang, J.-C., M. W. Liemohn, J. U. Kozyra, B. J. Lynch, and T. H.\nZurbuchen (2004), A statistical study of the geoeffectiveness of mag-\nnetic clouds during high solar activity years, J. Geophys. Res., 109,\nA09101, doi:10.1029\/2004JA010410.\nA07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS\n11 of 12\nA07S07\nZong, Q.-G., et al. (1997), Geotail observations of energetic ion species and\nmagnetic field in plasmoid-like structures in the course of an isolated\nsubstorm event, J. Geophys. Res., 102, 11,409–11,428.\n\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\nJ. E. Borovsky, M. G. Henderson, B. Lavraud, R. M. Skoug, and M. F.\nThomsen, MS D466 Los Alamos National Laboratory, Los Alamos, NM\n87545, USA. (jborovsky@lanl.gov; mghenderson@lanl.gov; lavraud@lanl.\ngov; rskoug@lanl.gov; mthomsen@lanl.gov)\nM. H. Denton, School of Physics and Astronomy, University of\nSouthampton, Southampton, SO17 1BJ, UK. (mdenton@phys.soton.ac.uk)\nM. W. Liemohn and J. C. Zhang, Atmospheric, Oceanic and Space\nSciences Department, University of Michigan, 2455 Hayward Street,\nAnn Arbor, MI 48109, USA. (liemohn@umich.edu; jichunz@engin.\numich.edu)\nR. L. McPherron, Institute of Geophysics and Planetary Physics,\nUniversity of California, Los Angeles, Los Angeles, CA 90095, USA.\n(mcpherron@igpp.ucla.edu)\nA07S07 DENTON ET AL.: ICME- AND CIR-DRIVEN GEOMAGNETIC STORMS\n12 of 12\nA07S07\n"}