{"doi":"10.1007\/s00221-005-0248-y","coreId":"54761","oai":"oai:eprints.lincoln.ac.uk:2425","identifiers":["oai:eprints.lincoln.ac.uk:2425","10.1007\/s00221-005-0248-y"],"title":"Longer fixation duration while viewing face images","authors":["Guo, Kun","Mahmoodi, Sasan","Robertson, Robert","Young, Malcolm"],"enrichments":{"references":[{"id":1022447,"title":"Expertise for cars and birds recruits brain areas involved in face recognition.","authors":[],"date":"2000","doi":null,"raw":"Gauthier I, Skudlarski P, Gore JC, Anderson AW (2000) Expertise for cars and birds recruits brain areas involved in face recognition. Nat Neurosci 3: 191-197 Gauthier I, Tarr MJ, Anderson AW, Skudlarski P, Gore JC (1999) Activation of the middle fusiform ‘face area’ increases with expertise in recognizing novel objects. Nat Neurosci 2: 568–573 Guo K, Benson PJ (1998) Involuntary eye movements in response to first- and second-order motion. Neuroreport 9:3543-3548 Guo K, Robertson RG, Mahmoodi S, Tadmor Y, Young MP (2003) How do monkeys view faces? – A study of eye movements. Exp Brain Res 150:363-374 Haig ND (1984) The effect of feature displacement on face recognition. Perception 13:505-512.","cites":null},{"id":1023825,"title":"Functional neuroanatomy of face and object processing. A positron emission tomography study. Brain 115: 15-36 Simoncelli EP, Olshausen BA (2001) Natural image statistics and neural representation. Annu Rev Neurosci 24: 1193-1216 Tanaka K","authors":[],"date":"1992","doi":null,"raw":"Cerebral Cortex 2: 375-388 Sergent J, Otha S, MacDonald B (1992) Functional neuroanatomy of face and object processing. A positron emission tomography study. Brain 115: 15-36 Simoncelli EP, Olshausen BA (2001) Natural image statistics and neural representation. Annu Rev Neurosci 24: 1193-1216 Tanaka K (1997) Mechanisms of visual object recognition: monkey and human studies. Curr Opin Neurobio 7: 523-529 Tarr MJ, Cheng YD (2003) Learning to see faces and objects. Trends Cognit Sci 7: 23-30 Tsao DY, Freiwald WA, Knutsen TA, Mandeville JB, Tootell RB (2003) Faces and objects in macaque cerebral cortex. Nat Neurosci 6: 989-995 Turati C, Simion F, Milani I, Umiltà C (2002) Newborns' preference for faces: what is crucial? Dev Psychol 38: 875-882 van Diepen  PMJ (1995) Chronometry of foveal information extraction during scene perception. In Findlay JM, Walker R, Kentridge RW (eds) Eye Movement Research: Mechanisms, Processes and Applications. Elsevier, North-Holland, pp 349-362 Valentine T (1988) Upside-down faces: a review of the effects of inversion upon face recognition. Br J Psychol 79: 471-491 Yamane S, Kaji S, Kawano K (1988) What facial features activate face neurons in the inferotemporal cortex of the monkey? Exp Brain Res 73:209-214 Yarbus A (1967) Eye movements and vision. Plenum, New York Yin RK (1969) Looking at upside-down faces. J Exp Psychol 81: 41-45 Young MP, Yamane S (1992) Sparse population coding of faces in inferior temporal cortex. Science 256:1327-1331 Legends","cites":null},{"id":1022665,"title":"Human gaze control during real-world scene perception.","authors":[],"date":"2003","doi":"10.1016\/j.tics.2003.09.006","raw":"Henderson JM (2003) Human gaze control during real-world scene perception.","cites":null},{"id":1023150,"title":"N170 or N1? Spatialtemporal differences between object and face processing using ERPs. Cerebr Cortex 14: 132-142 Jacobs AM","authors":[],"date":"2004","doi":"10.1093\/cercor\/bhg111","raw":"Vision Res 38:1295–1302 Itier RJ, Taylor MJ (2004) N170 or N1? Spatialtemporal differences between object and face processing using ERPs. Cerebr Cortex 14: 132-142 Jacobs AM (1986) Eye-movement control in visual search: How direct is visual span control? Percept Psychophys 39:47–58 Johnson MH, Morton J (1991) Biology and Cognitive Development: The Case of Face Recognition, Blackwell Kreyszig E (1999) Advanced Engineering Mathematics. John Wiley, New York Krieger G, Rentschler I, Hauske G, Schill K, Zetzsche C (2000) Object and scene analysis by saccadic eye-movements: an investigation with higher-order statistics.","cites":null},{"id":1022220,"title":"Res 76:181-189 Fellous JM","authors":[],"date":"1997","doi":null,"raw":"Behav Brain Res 76:181-189 Fellous JM (1997) Gender discrimination and prediction on the basis of facial metric information. Vision Res 37:1961-1973 Field DJ (1987) Relations between the statistics of natural images and the response properties of cortical cells. J Opt Soc Am A 4: 2379-2394.","cites":null},{"id":1021994,"title":"Social stimuli and social rewards in primate learning and cognition. Behav Process 42: 159-175 Andrew RJ","authors":[],"date":"1998","doi":"10.1016\/S0376-6357(97)00074-0","raw":"Anderson JR (1998) Social stimuli and social rewards in primate learning and cognition.  Behav Process 42: 159-175 Andrew RJ (1963) Evolution of facial expressions. Science 142: 1034-1041 Andrews TJ, Coppola DM (1999) Idiosyncratic characteristics of saccadic eye movements when viewing different visual environments. Vision Res 39:2947-2953 Bentin S, Allison T, Puce A, Perez E, McCarthy G (1996) Electrophysiological studies of face perception in humans. J Cogn Neurosci 8: 551-565 Biederman I (1987) Recognition-by-components: a theory of human image understanding. Psychol Rev 94:115-147 Bruce V, Young A (1998) In the eye of the beholder. Oxford University, New York Burton AM, Bruce V, Dench N (1993) What’s the difference between men and women? Evidence from facial measurement. Perception 22:153-176 Cootes TF, Taylor CJ, Cooper DH, Graham J (1992) Training Models of Shapes From Sets of Examples. Proceedings of British Machine Vision Conference: 9-18 Cootes TF, Taylor CJ (1992) Active Shape Models, ‘Smart Snakes’. Proceedings of British Machine Vision Conference: 266-275 Einhäuser W, König P (2003) Does luminance-contrast contribute to a saliency map for overt visual attention? Eur J Neurosci 17: 1089-1097 Emery NJ (2000) The eyes have it: the neuroethology, function and evolution of social gaze. Neurosci Biobehav Rev 24: 581-604 Epelboim J, Steinman R, Kowler E, Edwards M, Pizlo Z, Erkelens C, Collewijn H (1995) The function of visual search and memory in sequential looking tasks. Vision Res 35:3401–3422 Farah MJ (1996) Is face recognition ‘special’? Evidence from neuropsychology.","cites":null},{"id":1023598,"title":"Stimulus processing during eye fixation.","authors":[],"date":"1981","doi":"10.1037\/\/0096-1523.7.3.611","raw":"Phys Rev Lett 73: 814-817 Salthouse TA, Ellis CL, Diener DC, Somberg BL (1981) Stimulus processing during eye fixation. J Exp Psychol Hum Percept Perform 73:611-623 Sergent J, Signoret JL (1992) Varieties of functional deficits in prosopagnosia.","cites":null},{"id":1023364,"title":"The many faces of configural processing. Trends Cognit Sci 6:255-260","authors":[],"date":"2002","doi":"10.1016\/S1364-6613(02)01903-4","raw":"Spat Vis 13: 201-214 Maurer D, Le Grand R, Mondloch CJ (2002) The many faces of configural processing.  Trends Cognit Sci 6:255-260 McCarthy G, Puce A, Gore JC, Allison T (1997) Face-specific processing in the human fusiform gyrus. J Cognit Neurosci 9:605–610 Mendelson MJ, Haith MM, Goldman-Rakic PS (1982) Face scanning and responsiveness to social cues in infant rhesus monkeys. Dev Psychol 18: 222-228 Moffit K (1980) Evaluation of fixation duration in visual search. Percept Psychophys 274:370-372 Moscovitch M, Winocur G, Behrmann M (1997) What is special about face recognition? Nineteen experiments on a person with visual object agnosia and dyslexia but normal face recognition. J Cognit Neurosci 9: 555-604 Parkhurst D, Law K, Niebur E (2002) Modeling the role of salience in the allocation of overt visual attention. Vision Res 42:107-123 Parkhurst DJ, Niebur E (2003) Scene content selected by active vision. Spat Vis 16:125-154 Parr LA, Winslow JT, Hopkins WD (2000) Recognizing facial cues: individual discrimination by chimpanzees (pan troglodytes) and rhesus monkeys (macaca mulatta). J Comp Psychol 114: 1-14 Perrett DI, May KA, Yoshikawa S (1994) Facial shape and judgements of female attractiveness. Nature 368:239-242 Pollatsek A, Rayner K, Balota DA (1986) Inferences about eye movement control from the perceptual span in reading. Percept Psychophys 40:123–130 Reinagel P, Zador AM (1999) Natural scene statistics at the centre of gaze. Network Comput Neural Syst 10: 341-350 Rosenfeld SA, Van Hoesen GW (1979) Face recognition in the rhesus monkey. Neuropsychologia 17: 503-509 Rossion B, Gauthier I (2002) How does the brain process upright and inverted faces? Behav Cognit Neurosci Rev 1: 63-75 Rousselet GA, Mace MJ, Fabre-Thorpe M (2004) Spatiotemporal analyses of the N170 for human faces, animal faces and objects in natural scenes. Neuroreport 15: 2607-2611 Ruderman DL, Bialek W (1994) Statistics of natural images: scaling in the woods.","cites":null},{"id":1022920,"title":"Trends Cognit Sci 7:498-504 Henderson JM, Hollingworth A","authors":[],"date":"1999","doi":null,"raw":"Trends Cognit Sci 7:498-504 Henderson JM, Hollingworth A (1999) High-level scene perception. Annu Rev Psychol 50:243-271 Henderson JM, Weeks PA, Hollingworth A (1999) Effects of semantic consistency on eye movements during scene viewing. J Exp Psychol Hum Percept Perform 25: 210-228 Hooge IThC, Erkelens CJ (1998) Adjustment of fixation duration in visual search.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-05","abstract":"The spatio-temporal properties of saccadic eye movements can be influenced by the cognitive demand and the characteristics of the observed scene. Probably due to its crucial role in social communication, it is argued that face perception may involve different cognitive processes compared with non-face object or scene perception. In this study, we investigated whether and how face and natural scene images can influence the patterns of visuomotor activity. We recorded monkeys’ saccadic eye movements as they freely viewed monkey face and natural scene images. The face and natural scene images attracted similar number of fixations, but viewing of faces was accompanied by longer fixations compared with natural scenes. These longer fixations were dependent on the context of facial features. The duration of fixations directed at facial contours decreased when the face images were scrambled, and increased at the later stage of normal face viewing. The results suggest that face and natural scene images can generate different patterns of visuomotor activity. The extra fixation duration on faces may be correlated with the detailed analysis of facial features","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/54761.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2425\/1\/EBR_2006.pdf","pdfHashValue":"7965130b2935a17d12906dc8d21d7195baf2491f","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2425<\/identifier><datestamp>\n      2013-03-13T08:37:24Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F43:6A6163735F43383030<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F43:6A6163735F43383530<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F43:6A6163735F43383330<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2425\/<\/dc:relation><dc:title>\n        Longer fixation duration while viewing face images<\/dc:title><dc:creator>\n        Guo, Kun<\/dc:creator><dc:creator>\n        Mahmoodi, Sasan<\/dc:creator><dc:creator>\n        Robertson, Robert<\/dc:creator><dc:creator>\n        Young, Malcolm<\/dc:creator><dc:subject>\n        C800 Psychology<\/dc:subject><dc:subject>\n        C850 Cognitive Psychology<\/dc:subject><dc:subject>\n        C830 Experimental Psychology<\/dc:subject><dc:description>\n        The spatio-temporal properties of saccadic eye movements can be influenced by the cognitive demand and the characteristics of the observed scene. Probably due to its crucial role in social communication, it is argued that face perception may involve different cognitive processes compared with non-face object or scene perception. In this study, we investigated whether and how face and natural scene images can influence the patterns of visuomotor activity. We recorded monkeys’ saccadic eye movements as they freely viewed monkey face and natural scene images. The face and natural scene images attracted similar number of fixations, but viewing of faces was accompanied by longer fixations compared with natural scenes. These longer fixations were dependent on the context of facial features. The duration of fixations directed at facial contours decreased when the face images were scrambled, and increased at the later stage of normal face viewing. The results suggest that face and natural scene images can generate different patterns of visuomotor activity. The extra fixation duration on faces may be correlated with the detailed analysis of facial features.<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2006-05<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2425\/1\/EBR_2006.pdf<\/dc:identifier><dc:identifier>\n          Guo, Kun and Mahmoodi, Sasan and Robertson, Robert and Young, Malcolm  (2006) Longer fixation duration while viewing face images.  Experimental Brain Research, 171  (1).   pp. 91-98.  ISSN 0014-4819  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s00221-005-0248-y<\/dc:relation><dc:relation>\n        10.1007\/s00221-005-0248-y<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2425\/","http:\/\/dx.doi.org\/10.1007\/s00221-005-0248-y","10.1007\/s00221-005-0248-y"],"year":2006,"topics":["C800 Psychology","C850 Cognitive Psychology","C830 Experimental Psychology"],"subject":["Article","PeerReviewed"],"fullText":"  \n \nLonger fixation duration while viewing face images  \n \nKun Guo 1,2, Sasan Mahmoodi 1, Robert G. Robertson 1 and Malcolm P. Young 1\n1Department of Psychology, University of Newcastle, Newcastle upon Tyne, NE2 \n4HH, UK 2Department of Psychology, University of Lincoln, Lincoln LN6 7TS, UK \n \n \nCorresponding author: \nDr. Kun Guo \n \nDepartment of Psychology, University of Lincoln  \nBrayford Pool, Lincoln, LN6 7TS, UK  \nEmail address: kguo@lincoln.ac.uk \nTel: +44-(0)1522-886294 \nFax: +44-(0)1522-886026 \n \nAcknowledgements \n This work is supported by Wellcome Trust, HFSPO and EU FP5.  \n \n 1\n  \nAbstract \n The spatio-temporal properties of saccadic eye movements can be influenced \nby the cognitive demand and the characteristics of the observed scene. Probably due \nto its crucial role in social communication, it is argued that face perception may \ninvolve different cognitive processes compared with non-face object or scene \nperception. In this study, we investigated whether and how face and natural scene \nimages can influence the patterns of visuomotor activity. We recorded monkeys’ \nsaccadic eye movements as they freely viewed monkey face and natural scene images. \nThe face and natural scene images attracted similar number of fixations, but viewing \nof faces was accompanied by longer fixations compared with natural scenes. These \nlonger fixations were dependent on the context of facial features. The duration of \nfixations directed at facial contours decreased when the face images were scrambled, \nand increased at the later stage of normal face viewing. The results suggest that face \nand natural scene images can generate different patterns of visuomotor activity. The \nextra fixation duration on faces may be correlated with the detailed analysis of facial \nfeatures. \n  \nKeywords: Eye movement – Face image – Natural scene – Monkey  \n 2\n  \nIntroduction \nVisual exploration of a complex scene involves a series of saccades and \nfixations, which can shift our attention between specific objects or informative \nfeatures within the scene and make detailed analysis and identification of the scene \n(Biederman 1987; Henderson and Hollingworth 1999). There are two important \naspects of eye movements while studying gaze control during the scene perception, \nwhere fixations tend to be directed (fixation position) and how long they typically \nremain there (fixation duration) (Henderson 2003). Although human saccadic eye \nmovements show a variety of stereotypic patterns while inspecting visual scenes \n(Yarbus 1967), the frequency and size of saccades can be modulated by the cognitive \ndemand and characteristics of the observed scene (Salthouse et al. 1981; Jacobs 1986; \nPollatsek et al. 1986; Epelboim et al. 1995; Hooge and Erkelens 1998; Andrews and \nCoppola 1999). For example, longer fixations are normally associated with difficult \nwords in reading task (Pollatsek et al. 1986) and decreased discriminability of target \nin visual search task (Jacobs 1986; Hooge and Erkelens 1998); and natural scenes \ngenerate shorter fixations and larger saccades compared with simple pattern images in \nfree viewing task (Andrews and Coppola 1999).  \nAs faces can provide visual information about an individual’s gender, age and \nfamiliarity, and their expressions offer significant cues to intention and mental state \n(Bruce and Young 1998; Emery 2000), the ability to recognize these cues and to \nrespond accordingly plays an important role in the social life of higher primates \n(Andrew 1963; Anderson 1998). It is argued that face perception is involved in a \nunique cognitive process compared with non-face object or scene perception. For \nexample, psychophysical studies have observed detrimental recognition performance \nfor inverted faces rather than non-face objects or scenes (face inversion effect) (e.g. \n 3\n  \nYin, 1969; Valentine 1988; Rossion and Gauthier 2002), a visual preference for face-\nlike stimuli in human neonates (Johnson and Morton 1991; see also Turati et al. \n2002), and selective impairments of face and object recognition in neurological \npatients (prosopagnosia and visual agnosia) (e.g. Sergent and Signoret 1992; Farah \n1996; Moscovitch et al. 1997). Recordings of human event-related potentials showed \na different topography to face (including human and animal faces) and non-face \nobject or scene stimuli in the N170 time window (e.g. Bentin et al. 1996; Itier and \nTaylor 2004; Rousselet et al. 2004). Elecrtophysiology and brain imaging studies \nfurther suggested a distinct neuroanatomical region in cerebral cortex associated with \nthe cortical processing of faces (face-selective neurons in monkey inferotemporal \ncortex, fusiform face area in human cortex) (e.g. Sergent et al. 1992; McCarthy et al. \n1997; Tanaka 1997; Tsao et al. 2003). However, this view is recently challenged by \nsome brain imaging studies suggesting that faces are processed by a domain-general \nsystem for fine-grained, exemplar-level object perception but probably at different \nlevel of recognition or different degree of perceptual expertise (Gauthier et al. 1999, \n2000; Tarr and Cheng 2003). \nIt is not clear, however, whether inspection of face and non-face scenes, which \nhave different image characteristics and may involve different cognitive processes \n(i.e. different cortical processes, different level of recognition or different degree of \nperceptual expertise), can influence the patterns of visuomotor activity. To examine \nthis issue, we compared monkeys’ saccadic eye movements when they freely viewed \nface and natural scene images. Familiar scenes sampled from monkeys’ daily \nenvironment were also used to examine potential influence of the familiarity of \nnatural scene images. This exploratory project is not only important to increase our \nunderstanding of the relation between the category of real world stimuli and the \n 4\n  \norganisation of goal-directed eye movements in non-human primates, but also for \ncomparison with findings from humans, as the behaviour and neurophysiology of \nmonkeys comprises the most significant model for the advancement of research into \nhuman brain function. We observed that the face images tended to generate longer \nfixations compared with the natural scene images, and these longer fixations were \nassociated with the context of facial features. \n \nMethods \nSubjects \nThree male adult rhesus monkeys (Macaca mulatta, 4.5-6.0 kg) were trained \nto fixate a small fixation point (FP) for several seconds in a dimming fixation \ndetection task. To make eye movement recordings, a scleral eye coil and head \nrestraint were implanted under aseptic conditions (Guo and Benson 1998). All \nprocedures complied with the “Principles of laboratory animal care” (NIH publication \nno. 86-23, revised 1985) and UK Home Office regulations.  \nStimuli and apparatus \nDigitized gray scale images were presented through a VSG 2\/3 graphics \nsystem (Cambridge Research Systems) and displayed on a high frequency non-\ninterlaced gamma-corrected color monitor (6.0 cd\/m2 background luminance, 110 Hz \nframe rate, Sony GDM-F500T9) with the resolution of 1024 × 768 pixels. At a \nviewing distance of 57cm the monitor subtended a visual angle of 40 × 30°.   \nFour different classes of images were used as stimuli (see examples in Fig. 1A \nand 2A): (1) 20 neutral monkey (Macaca mulatta) face images, (2) 20 natural scene \nimages (including buildings, landscape, trees and plants etc.), (3) 15 familiar natural \nscene images which were taken from monkeys’ daily environment, (4) 10 scrambled \n 5\n  \nmonkey face images. The scrambled images were generated by dividing each \ncomplete face image into a 4 × 4 matrix and randomly rearranging the parts (Guo et \nal. 2003). By doing so, most of the local facial features (eyes, nose and mouth) were \nkept intact and recognizable, but the global structure of the face was disrupted. All \nimages were in sharp focus at all depths of field, and were gamma-corrected and \ndisplayed once in a random order at the center of the screen with a resolution of 512 × \n512 pixels (20 × 20°). \nDuring the experiments the monkey sat in a primate chair with head \nrestrained, and viewed the display binocularly. To calibrate eye movement signals, a \nsmall red FP (0.2° diameter, 7.8 cd\/m2 luminance) was displayed randomly at one of \ntwenty-five positions (5 × 5 matrix) across the monitor. The distance between \nadjacent FP positions was 5°. The monkey was trained to follow the FP and maintain \nfixation for 1 s. After the calibration procedure, the trial was started with a FP \ndisplayed on the center of monitor. If the monkey maintained fixation for 500 ms, the \nFP disappeared and an image was presented for 20 s. During the presentation, the \nmonkeys passively viewed the images. No reinforcement was given during this \nprocedure, neither were the animals trained on any other task with these stimuli, \nwhich could have potentially affected the structure of their behavior. It was \nconsidered that with their lack of training, and in the absence of instrumental \nresponding, their behavior should be as natural as possible.  \nEye movement recordings and analysis \n Horizontal and vertical eye positions were measured using an 18-inch cubic \nscleral search coil assembly with 6 min arc sensitivity (CNC Engineering). Eye \nmovement signals were amplified and sampled at 500 Hz through CED1401 plus \ndigital interface (Cambridge Electronic Design). The software developed in Matlab \n 6\n  \ncomputed horizontal and vertical eye displacement signals as a function of time to \ndetermine eye velocity and position. Fixation locations and durations were then \nextracted from the raw eye tracking data using velocity (less than 0.2° eye \ndisplacement at a velocity of less than 20°\/s) and duration (greater than 50 ms) criteria \n(Guo et al. 2003).  \n As the main experimental design comprised three levels of image category \n(faces vs natural scenes vs familiar scenes), one-way repeated analysis of variance \n(ANOVA) was carried out after pooling the data from three monkeys. Appropriate \npost hoc testing of differences between levels of image category (Tukey’s least \nsignificant procedure) was also carried out following detection of significant overall \nvariable ratios.  \n \nResults \nThe gray scale face and natural scene images appeared equally salient to the \nmonkeys. No difference was observed in the number of fixations across the image \ncategories (ANOVA, F(2,162)=0.5, p=0.61; Fig. 1B). During the entire 20-second \npresentation, three monkeys made 24.73 ± 1.51 (Mean ± SEM), 24.82 ± 1.69 and \n22.82 ± 1.58 fixations across the face, familiar scene and natural scene images.  \nThe fixation durations were influenced by the image categories. Although \nfrequency distribution analysis showed that the monkeys made frequent short \nfixations (peak around 200 ms) while viewing the images (Guo et al. 2003), the faces \ntended to generate longer fixations (ANOVA, F(2,3975)=35.7, p=4.29E-16; post-hoc \ntest, face vs familiar scene: p=7.91E-13, face vs natural scene: p=1.71E-11; Fig. 1C). \nIn contrast, the familiar scenes and natural scenes had indistinguishable fixation \ndurations (post-hoc test, p=0.66). The mean fixation durations were 317 ± 8 (Mean ± \n 7\n  \nSEM), 249 ± 5 and 253 ± 5 ms for face, familiar scene and natural scene images. The \nconclusion also holds for the median fixation durations which are less sensitive for the \nskewed distributions of fixation durations (e.g. Fig. 3B in Guo et al., 2003). The \nmedian fixation durations were 222, 205 and 200 ms for face, familiar scene and \nnatural scene images. \nInspection of the natural scene is accompanied by a series of fixations directed \ntowards important and informative scene regions. Recent studies observed higher \nlocal luminance contrast and lower local two-point correlation for fixated scene \npatches than un-fixated patches (Reinagel and Zador 1999; Krieger et al. 2000; \nParkhurst and Niebur 2003), suggesting that local image statistics, such as luminance \ncontrast, is a major contributor to the saliency map for overt attention (Parkhurst et al. \n2002). To examine whether the differences in fixation durations for the three classes \nof images were due to the differences in the physical properties and statistics of those \nfixated image regions, we calculated local luminance contrasts around individual \nfixations in different images. The local contrast is a measure of variability of the \nintensity within an image patch, and is defined as the standard deviation of the \nluminance within a square image divided by the mean intensity of the whole image \n(Reinagel and Zador 1999; Einhäuser and König 2003). The size of the square region \nwas chosen to be 2° × 2° (±1° around the fixation) which roughly covers the spatial \nscale of the size of the fovea. While the average fixation duration in the face images \nwas longer than that in the familiar scenes (Fig. 1C), the average local contrast around \nthe fixations in the face images (0.2568 ± 0.0034) was not significantly different from \nthat in the familiar scenes (0.2539 ± 0.0038; t-test, p>0.05; Fig. 2). However, the \naverage local contrast around the fixations in the natural scene images (0.3512 ± \n0.0061) was higher than that in the face and familiar scene images (ANOVA, \n 8\n  \nF(2,3975)=157.11, P=2.63E-66). This is due to the physical properties of the natural \nscene images, as the average local contrast from random samples in the natural scenes \n(25 samples per image) was also proportionally higher than that in the face and \nfamiliar scene images (ANOVA, F(2,1372)=113.02, p=3.67E-46; Fig. 2). \nFor individual fixations sampled while viewing face, familiar scene and \nnatural scene images, we further plotted its duration against its local contrast (Fig. 3). \nIn agreement with previous study of human subjects (Einhäuser and König 2003), \nover all images and all subjects, we found no correlation between local contrast and \nfixation duration (r = 0.00005, 0.0007 and 0.0002 for face, familiar scene and natural \nscene images). This holds also true for the local contrasts calculated using smaller (1° \n× 1°) or larger (3° × 3°) spatial scale around the fixations (r<0.001 for all images). \nThis analysis shows that the local luminance contrast was unlikely related to the \ndifferences in the fixation durations while viewing face, familiar scene and natural \nscene images.  \nAs the measurement of local contrast is insensitive to the spatial organization \nof intensities within an image patch, we also employed two-point correlation function, \nwhich calculates the correlation between the point at the centre of each fixation and a \npoint within local neighbourhood of the fixation (±1° around the fixation in this \nstudy), to quantify the correlation in intensity between pairs of pixels in the image \npatch (Reinagel and Zador 1999). The mean and covariance of correlation matrices \nover the fixations within individual face, familiar scene and natural scene images \nwere calculated and further averaged over each class of the images and subjects \n(Cootes and Taylor 1992; Cootes et al. 1992). Figure 4 shows the mean of correlations \nfor each class of images. In general, correlation is a function of distance between \n 9\n  \nimage points (pixels). The local image structures around the fixations in the natural \nscene images seemed to be less correlated than that in the face images. \nTo further quantify the variations of correlations for each class of images, \neigenvalues and eigenvectors of the covariance matrix were computed to analyse \nprinciple components of our correlation data over each class (Kreyszig 1999). The \nMahalanobis (weighted) distance between the mean of each class and the mean of \nother classes were finally calculated to determine whether different classes were \noverlapped with each other or separated from each other (Cootes and Taylor 1992; \nCootes et al. 1992). Figure 5 shows the distribution of our data for these three classes \nof images by considering first two important modes (components) of variations. The \ndistribution function was assumed as a multidimensional Gaussian function whose \nvariances correspond to the eigenvalues of the covariance of the correlation data. \nThese Gaussian functions were considered in a feature space obtained by applying \nHotelling transform to our data (Cootes and Taylor 1992; Cootes et al. 1992; Kreyszig \n1999). This analysis shows a clear difference in spatial correlations between fixations \nsampled from the face and natural scene images. The local image structures are more \nspatially correlated in the face images. However, this difference in local spatial \ncorrelations between the face and natural scene images is unlikely related to the \ndifference in fixation durations while viewing the face and natural scene images. \nCompared with the face images, the correlations between nearby pixels were weak in \nthe natural scene images, indicating a rich structure on small spatial scale in the \nnatural scene images. Therefore the natural scene images are statistically less \nredundant (Field 1987; Ruderman and Bialek 1994; Simoncelli and Olshausen 2001), \nand consequently should attract longer fixation durations for the purpose of foveal \nanalysis rather than shorter fixation durations as we observed in the recording. \n 10\n  \nHowever, the relationship between fixation duration and local spatial structure of the \nstimulus may well be task dependent. For example, the natural scene image could \nattract longer fixation durations in a search task compared with the free viewing task \nwe employed in this experiment. Nevertheless, our observation suggests that the \nfixation duration is dependent upon not only simple local properties like contrast and \nspatial correlation, but also some complex features like informativeness. \nWhile viewing the faces, the monkeys’ fixation was mainly directed to the \nprincipal local facial features, even with the scrambled faces (see examples in Fig. 1A \nand 6A) (Guo et al. 2003). To investigate whether the longer fixations on facial \nfeatures are dependent upon their spatial configurations, we compared the durations of \nfixations on eyes, nose, mouth and facial contours (including hairlines) within normal \nand scrambled face images (Fig. 6A). While the fixations on eyes, nose and mouth \nhad the same durations between normal and scrambled faces (paired t-test, p>0.05), \nthe mean duration of fixations on facial contours of normal faces (302 ± 12 ms) was \nlonger than that of scrambled faces (282 ± 20 ms) (paired t-test, p=0.03). \nWe further compared the durations of each of the first seven fixations on the \neyes and facial contours within normal face images (this number was chosen as it \nrepresented the maximum number of fixations within the region for some images, Fig. \n6B). While the fixation durations on the eyes were the same with changing fixation \nsequence (ANOVA, F(6,268)=0.85, p=0.53), the duration of fixations on the facial \ncontours increased gradually at the later stage of fixation (ANOVA, F(6,214)=3.75, \np=0.001). There was no significant change of the fixation durations on the same \nregions within scrambled faces with increasing fixation sequence (ANOVA, eyes: \nF(6,98)=1.25, p=0.29; facial contours: F(6,115)=0.67, p=0.68). \n \n 11\n  \nDiscussion \n In the present study, we compared the patterns of saccadic eye movements \nwhile monkeys freely viewed face and natural scene images (including familiar and \nnovel natural scenes). The face and natural scene images appeared equally salient to \nthe monkeys. They attracted similar number of fixations during the image \npresentation. However, viewing of the faces was accompanied by longer fixations \ncompared with the natural scenes. This difference in fixation durations across \ndifferent classes of images is unlikely to be related to the differences in local physical \nproperties and statistics of these images which was demonstrated by the analysis of \nlocal luminance contrast (standard deviation of intensity in a fixation patch, Fig. 2, 3) \nand local two-point correlation function (intensity of the fixated point and nearby \npoints, Fig. 4, 5) across the different classes of images. Comparison between familiar \nand novel natural scenes showed that these two classes of natural images attracted \nsimilar amount of fixation durations (Fig. 1). Because our familiar scenes were \n‘artificial’ man-made scenes sampled from monkeys’ daily environment, and novel \nnatural scenes included both ‘artificial’ scenes (i.e. buildings) and ‘natural’ scenes \n(i.e. plants), it is difficult to exclude the potential influence of the ‘naturalness’ of \nscenes on fixation duration without further detailed examination with large sample \nsize. However, as our analysis also revealed that the fixation durations sampled from \nnovel ‘natural’ scenes (253 ± 7 ms) were not significantly different from those \nsampled from novel ‘artificial’ scenes (248 ± 11 ms) (t-test, p=0.61), it is unlikely that \nthe potential interaction between familiarity and ‘naturalness’ of the tested scenes \ncould fully account for our observation of difference in fixation durations between \nface and natural scene images.  \n 12\n  \nDetailed examination of facial configurations further revealed that the longer \nfixations on facial contours appeared to be dependent upon the arrangement of these \ncontours into a coherent and recognizable object, namely a face. The duration of the \nfixations on the same facial contours in the scrambled face images were significantly \nshorter (Fig. 6). These results suggest that face and natural scene images may generate \ndifferent patterns of visuomotor activity. The extra fixation duration on faces may be \ncorrelated with the detailed analysis of facial features. \nOculomotor strategies are closely linked with the cognitive demand (Epelboim \net al. 1995), and the fixation duration has been correlated with the amount of \ninformation being processed during foveal analysis (Moffit 1980). Longer fixations \nare usually associated with extra cognitive demand and\/or display complexity \n(Salthouse et al. 1981; Jacobs 1986; Hooge and Erkelens 1998). For example, \nindividual fixation durations are longer during scene memorization than search \n(Henderson et al. 1999), or when the image at fixation is reduced by contrast or \npartially obscured by a noise mask (van Diepen 1995). \nOne of the major differences between face and natural scene images is that \nfaces have inherent social significance. They are behaviorally relevant visual stimuli \nfor primates, which provide essential information about an individual’s gender, age, \nfamiliarity, intention and mental state (e.g. Bruce and Young 1998; Emery 2000). \nWhen viewing a complex scene containing faces, the highest portion of human \nfixations is directed to the faces (Yarbus 1967). The local facial features, such as eyes, \nare not just simple geometric patterns or objects. They also contain significant social \ncommunicative signals. Like human, monkeys are also heavily reliant on facial \nsignals for social communication. Based on facial cues alone, they are readily able to \nrespond appropriately to the expressions of other individuals (Mendelson et al. 1982), \n 13\n  \nto recognize and discriminate the faces of familiar and unfamiliar individuals \n(Rosenfeld and van Hoesen 1979; Parr et al. 2000). Their visual system also appears \nto be tuned to the informative facial features (Guo et al. 2003). They showed a \npreferential interest, high density of fixations and longer fixation durations, to the \nmajor local facial features while viewing faces. As local image complexity around the \nfixations is unlikely account for the differences in fixation durations between the face \nand natural scene images (Fig. 2, 3, 4, 5), the extra duration of fixations for the faces \nmay be correlated with the extra cognitive demand (i.e. “configural process”) which \ninvolves detailed analysis of local facial features and perceiving relations among the \nfacial features, and therefore maybe important for acquisition and processing of facial \ncues, such as identity, expression and gaze direction (Maurer et al. 2002). As we only \ntested neural face images in a free viewing task in this experiment, in the future study \nit will be interesting to systematically manipulate social relevance over controlled sets \nof face images and\/or cognitive demand, and to investigate the relations among social \nperception, cognitive demand and patterns of saccadic eye movements.  \nInterestingly, the disruption of facial configuration (i.e. scrambled faces) \nseems only affect the number of fixations (Guo et al. 2003) rather than the duration of \nfixations on the faces (Fig. 6). The fixations on major local facial features, such as \neyes, nose and mouth, had the same durations between normal and scrambled faces, \nonly fixations on facial contours slightly decreased for scrambled faces. \nFacial cues, such as identity, gender and attractiveness, are sensitive to the \nmanipulation of metric properties of a face (Burton et al. 1993; Perrett et al. 1994; \nFellous 1997). Humans can detect variations in facial metric information as small as \none minute of visual angle, a value close to the limits of acuity (Haig 1984). Previous \nstudies suggest that this facial metric information is explicitly encoded in the brain \n 14\n  \nand may be used for face perception and discrimination (Yamane et al. 1988; Young \nand Yamane 1992). Indeed, the responses of face-selective neurons in anterior \ninferotemporal cortex of macaques are correlated with dimensions relating the hairline \nto other facial points, especially the eyes, in face discrimination tasks (Young and \nYamane 1992). In our study, the observed monkeys’ fixations on facial contours may \nbe correlated with the analysis of the properties of facial dimensions, and this process \nmay require extra fixation time. While in the scrambled faces, due to the lack of \ninformation about the facial dimensions, the fixations to these features may just \nprovide less sophisticated local information (i.e. local contrast and local contour). \n \nReferences \nAnderson JR (1998) Social stimuli and social rewards in primate learning and \ncognition.  Behav Process 42: 159-175 \n \nAndrew RJ (1963) Evolution of facial expressions. Science 142: 1034-1041 \n \nAndrews TJ, Coppola DM (1999) Idiosyncratic characteristics of saccadic eye \nmovements when viewing different visual environments. Vision Res 39:2947-2953 \n \nBentin S, Allison T, Puce A, Perez E, McCarthy G (1996) Electrophysiological \nstudies of face perception in humans. J Cogn Neurosci 8: 551-565 \n \nBiederman I (1987) Recognition-by-components: a theory of human image \nunderstanding. Psychol Rev 94:115-147 \n \nBruce V, Young A (1998) In the eye of the beholder. Oxford University, New York \n \n 15\n  \nBurton AM, Bruce V, Dench N (1993) What’s the difference between men and \nwomen? Evidence from facial measurement. Perception 22:153-176 \n \nCootes TF, Taylor CJ, Cooper DH, Graham J (1992) Training Models of Shapes From \nSets of Examples. Proceedings of British Machine Vision Conference: 9-18 \n \nCootes TF, Taylor CJ (1992) Active Shape Models, ‘Smart Snakes’. Proceedings of \nBritish Machine Vision Conference: 266-275 \n \nEinhäuser W, König P (2003) Does luminance-contrast contribute to a saliency map \nfor overt visual attention? Eur J Neurosci 17: 1089-1097 \n \nEmery NJ (2000) The eyes have it: the neuroethology, function and evolution of \nsocial gaze. Neurosci Biobehav Rev 24: 581-604 \n \nEpelboim J, Steinman R, Kowler E, Edwards M, Pizlo Z, Erkelens C, Collewijn H \n(1995) The function of visual search and memory in sequential looking tasks. Vision \nRes 35:3401–3422 \n \nFarah MJ (1996) Is face recognition ‘special’? Evidence from neuropsychology. \nBehav Brain Res 76:181-189 \n \nFellous JM (1997) Gender discrimination and prediction on the basis of facial metric \ninformation. Vision Res 37:1961-1973 \n \nField DJ (1987) Relations between the statistics of natural images and the response \nproperties of cortical cells. J Opt Soc Am A 4: 2379-2394. \n \nGauthier I, Skudlarski P, Gore JC, Anderson AW (2000) Expertise for cars and birds \nrecruits brain areas involved in face recognition. Nat Neurosci 3: 191-197 \n \n 16\n  \nGauthier I, Tarr MJ, Anderson AW, Skudlarski P, Gore JC (1999) Activation of the \nmiddle fusiform ‘face area’ increases with expertise in recognizing novel objects. Nat \nNeurosci 2: 568–573 \n \nGuo K, Benson PJ (1998) Involuntary eye movements in response to first- and \nsecond-order motion. Neuroreport 9:3543-3548 \n \nGuo K, Robertson RG, Mahmoodi S, Tadmor Y, Young MP (2003) How do monkeys \nview faces? – A study of eye movements. Exp Brain Res 150:363-374 \n \nHaig ND (1984) The effect of feature displacement on face recognition. Perception \n13:505-512. \n \nHenderson JM (2003) Human gaze control during real-world scene perception. \nTrends Cognit Sci 7:498-504 \n \nHenderson JM, Hollingworth A (1999) High-level scene perception. Annu Rev \nPsychol 50:243-271 \n \nHenderson JM, Weeks PA, Hollingworth A (1999) Effects of semantic consistency on \neye movements during scene viewing. J Exp Psychol Hum Percept Perform 25: 210-\n228 \n \nHooge IThC, Erkelens CJ (1998) Adjustment of fixation duration in visual search. \nVision Res 38:1295–1302 \n \nItier RJ, Taylor MJ (2004) N170 or N1? Spatialtemporal differences between object \nand face processing using ERPs. Cerebr Cortex 14: 132-142 \n \nJacobs AM (1986) Eye-movement control in visual search: How direct is visual span \ncontrol? Percept Psychophys 39:47–58 \n \n 17\n  \nJohnson MH, Morton J (1991) Biology and Cognitive Development: The Case of \nFace Recognition, Blackwell \n  \nKreyszig E (1999) Advanced Engineering Mathematics. John Wiley, New York \n \nKrieger G, Rentschler I, Hauske G, Schill K, Zetzsche C (2000) Object and scene \nanalysis by saccadic eye-movements: an investigation with higher-order statistics. \nSpat Vis 13: 201-214 \n \nMaurer D, Le Grand R, Mondloch CJ (2002) The many faces of configural \nprocessing.  Trends Cognit Sci 6:255-260 \n \nMcCarthy G, Puce A, Gore JC, Allison T (1997) Face-specific processing in the \nhuman fusiform gyrus. J Cognit Neurosci 9:605–610 \n \nMendelson MJ, Haith MM, Goldman-Rakic PS (1982) Face scanning and \nresponsiveness to social cues in infant rhesus monkeys. Dev Psychol 18: 222-228 \n \nMoffit K (1980) Evaluation of fixation duration in visual search. Percept Psychophys \n274:370-372 \n \nMoscovitch M, Winocur G, Behrmann M (1997) What is special about face \nrecognition? Nineteen experiments on a person with visual object agnosia and \ndyslexia but normal face recognition. J Cognit Neurosci 9: 555-604 \n \nParkhurst D, Law K, Niebur E (2002) Modeling the role of salience in the allocation \nof overt visual attention. Vision Res 42:107-123 \n \nParkhurst DJ, Niebur E (2003) Scene content selected by active vision. Spat Vis \n16:125-154 \n \n 18\n  \nParr LA, Winslow JT, Hopkins WD (2000) Recognizing facial cues: individual \ndiscrimination by chimpanzees (pan troglodytes) and rhesus monkeys (macaca \nmulatta). J Comp Psychol 114: 1-14 \n \nPerrett DI, May KA, Yoshikawa S (1994) Facial shape and judgements of female \nattractiveness. Nature 368:239-242 \n \nPollatsek A, Rayner K, Balota DA (1986) Inferences about eye movement control \nfrom the perceptual span in reading. Percept Psychophys 40:123–130 \n \nReinagel P, Zador AM (1999) Natural scene statistics at the centre of gaze. Network \nComput Neural Syst 10: 341-350 \n \nRosenfeld SA, Van Hoesen GW (1979) Face recognition in the rhesus monkey. \nNeuropsychologia 17: 503-509 \n \nRossion B, Gauthier I (2002) How does the brain process upright and inverted faces? \nBehav Cognit Neurosci Rev 1: 63-75 \n \nRousselet GA, Mace MJ, Fabre-Thorpe M (2004) Spatiotemporal analyses of the \nN170 for human faces, animal faces and objects in natural scenes. Neuroreport 15: \n2607-2611 \n \nRuderman DL, Bialek W (1994) Statistics of natural images: scaling in the woods. \nPhys Rev Lett 73: 814-817 \n \nSalthouse TA, Ellis CL, Diener DC, Somberg BL (1981) Stimulus processing during \neye fixation. J Exp Psychol Hum Percept Perform 73:611-623  \n \nSergent J, Signoret JL (1992) Varieties of functional deficits in prosopagnosia. \nCerebral Cortex 2: 375-388 \n 19\n  \n \nSergent J, Otha S, MacDonald B (1992) Functional neuroanatomy of face and object \nprocessing. A positron emission tomography study. Brain 115: 15-36 \n \nSimoncelli EP, Olshausen BA (2001) Natural image statistics and neural \nrepresentation. Annu Rev Neurosci 24: 1193-1216 \n \nTanaka K (1997) Mechanisms of visual object recognition: monkey and human \nstudies. Curr Opin Neurobio 7: 523-529 \n \nTarr MJ, Cheng YD (2003) Learning to see faces and objects. Trends Cognit Sci 7: \n23-30 \n \nTsao DY, Freiwald WA, Knutsen TA, Mandeville JB, Tootell RB (2003) Faces and \nobjects in macaque cerebral cortex. Nat Neurosci 6: 989-995 \n \nTurati C, Simion F, Milani I, Umiltà C (2002) Newborns' preference for faces: what is \ncrucial? Dev Psychol 38: 875-882 \n \nvan Diepen  PMJ (1995) Chronometry of foveal information extraction during scene \nperception. In Findlay JM, Walker R, Kentridge RW (eds) Eye Movement Research: \nMechanisms, Processes and Applications. Elsevier, North-Holland, pp 349-362  \n  \nValentine T (1988) Upside-down faces: a review of the effects of inversion upon face \nrecognition. Br J Psychol 79: 471-491 \n \nYamane S, Kaji S, Kawano K (1988) What facial features activate face neurons in the \ninferotemporal cortex of the monkey? Exp Brain Res 73:209-214 \n \nYarbus A (1967) Eye movements and vision. Plenum, New York \n \nYin RK (1969) Looking at upside-down faces. J Exp Psychol 81: 41-45 \n \n 20\n  \nYoung MP, Yamane S (1992) Sparse population coding of faces in inferior temporal \ncortex. Science 256:1327-1331 \n \n \nLegends \nFigure 1. (A) Examples of static gray scale face, familiar scene and natural scene \nimages used in the recording. The white dots within the images indicate the position \nof each fixation sampled during the image presentation. (B and C) Number of \nfixations (B) and fixation duration (C) measured while viewing face, familiar scene \nand natural scene images. Error bars mean standard error of mean. \n \nFigure 2. The average local contrast around the fixations while viewing face, familiar \nscene and natural scene images (left white columns), and the average local contrast \nfrom random samples in face, familiar scene and natural scene images (25 samples \nper image, left grey columns). Error bars mean standard error of mean. \n \nFigure 3. Dependence of fixation duration on local luminance contrast in face, \nfamiliar scene and natural scene images. \n \nFigure 4. The mean of correlations over two-degree image patches around the \nfixations in face (left), familiar scene (middle) and natural scene images (right). In the \nfar right side of the figure, a scale is presented to indicate the brightness with the \ncorresponding correlation values. \n \nFigure 5. Two dimensional Gaussian functions in feature space corresponding to face, \nfamiliar scene and natural scene images. The two axes correspond to the two most \n 21\n  \nimportant variations in the covariance matrix, and the units of the axes indicate \nstandard deviations of modes. \n \nFigure 6. (A) Comparison of the durations of fixations on facial contours, eyes, nose \nand mouth region within normal and scrambled face images. Error bars indicate \nstandard error of the mean. The top graphs are examples of normal and scrambled \nface images used in the experiment. (B) The change of the fixation durations with \nincreasing fixation sequence at the eyes and facial contours within normal face \nimages. \n 22\n  \nFigure 1 \n \n \n \n \n \n \n \n \n \n                     A                                                            \n    \n \n                     B                                              C   \n0\n5\n10\n15\n20\n25\n30\nNu\nm\nbe\nr \nof\n fi\nxa\ntio\nns\nFace Familiar\nscene\nNatural\nscene\n0\n50\n100\n150\n200\n250\n300\n350\nFi\nxa\ntio\nn \ndu\nra\ntio\nn \n(m\ns)\nFace Familiar\nscene\nNatural\nscene\n \n \n \n \n 23\n  \nFigure 2. \n \n \n \n \n \n \n \n \n \n \n \n0\n0.1\n0.2\n0.3\n0.4\nLo\nca\nl c\non\ntr\nas\nt\nFixation\nRandom sample\nFace Natural\nscene\nFamiliar\nscene\n 24\n  \n \nFigure 3 \n \n \n \n \n \n \n \n \n \n    \nFace \n0\n300\n600\n900\n1200\n1500\n0 0.2 0.4 0.6 0.8\nContrast\nFi\nxa\ntio\nn \ndu\nra\ntio\nn \n(m\ns)\n  \nFamiliar scene \n0 0.2 0.4 0.6 0.8\nContrast\nNatural scene \n0 0.2 0.4 0.6 0.8\nContrast\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 25\n  \nFigure 4 \n \n \n \n \n  Face             Familiar Scene                 Natural Scene  \n \n \n \n1°\n-1°Di\nst\nan\nce\n to\n fi\nxa\ntio\nn \nce\nnt\nre\n \n-1° -1°1°\nDistance to fixation centre \n1\n0\n-1°1° 1°\n \n \n \n \n \n \n \n \n 26\n  \nFigure 5 \n \n \n \n \nNatural Scene \n-30 +30\n13\n-13\n22\n-22\n21-5 -7 \nFamiliar Scene\nFace Image \n1st component \n2nd component  \n \n \n \n \n \n \n \n \n 27\n  \nFigure 6 \n \n \n \n \n \n   A \n            \n B \n0\n80\n160\n240\n320\nFi\nxa\ntio\nn \ndu\nra\ntio\nn \n(m\ns)\nNormal faces\nScrambled faces\nFacial\ncontours Eye Nose Mouth  \n \n0\n100\n200\n300\n400\n0 1 2 3 4 5 6 7\nFixation sequence\nFi\nxa\ntio\nn \ndu\nra\ntio\nn \n(m\ns)\nEyes\nFacial contours\n \n \n \n \n \n \n \n \n \n \n 28\n"}