{"doi":"10.1080\/0968776960040304","coreId":"14331","oai":"oai:generic.eprints.org:219\/core5","identifiers":["oai:generic.eprints.org:219\/core5","10.1080\/0968776960040304"],"title":"Effecting institutional change: The impact of some strategic issues on the integratiye use of IT in teaching and learning","authors":["McCartan, Audrey","Hare, Catherine"],"enrichments":{"references":[{"id":200797,"title":"A Framework for the Development of Core IT Skills for University Staffs,","authors":[],"date":"1994","doi":null,"raw":"Hodgson, M., McCartan, A. and Hare, C. (1994), A Framework for the Development of Core IT Skills for University Staffs, CVCP\/USDU Publications.","cites":null},{"id":200796,"title":"Education Funding Council","authors":[],"date":"1996","doi":"10.1080\/0309877980220305","raw":"FEFC (Further Education Funding Council) (1996), Report of the Learning and Technology Committee (Higginson Report).","cites":null},{"id":200798,"title":"Enabling learning through technology: some institutional perspectives',","authors":[],"date":"1994","doi":"10.3402\/rlt.v3i1.9599","raw":"McCartan, A., Watson, B., Lewins, J. and Hodgson, M. (1994), 'Enabling learning through technology: some institutional perspectives', Alt-J, 3 (1), 92-7.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1996","abstract":"This paper addresses the effective implementation of change through the identification of issues associated with three key institutional areas which, together, will ensure the effective'integration of multimedia technologies into teaching and learning. These are the need for a firm commitment of support at the institutional level, the development of an institutional strategy, with related staff‐development policies and programmes, and provision for students and academic staff to. acquire enabling IT skills through resource‐based learning as a means to maximize the benefits to be gained from the use of these new technologies. The essential conditions which ensure effective implementation ‐ communication between all stake‐holders, leadership by senior managers, responsive central services and a mixture of funding arrangements ‐ are discusse","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14331.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/219\/1\/ALT_J_Vol4_No3_1996_Effecting%20institutional%20change.pdf","pdfHashValue":"8a5cb0b58cb485fccd99aa17ad2bae21c4be402d","publisher":"Universit of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:219<\/identifier><datestamp>\n      2011-04-04T09:22:51Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/219\/<\/dc:relation><dc:title>\n        Effecting institutional change: The impact of some strategic issues on the integratiye use of IT in teaching and learning<\/dc:title><dc:creator>\n        McCartan, Audrey<\/dc:creator><dc:creator>\n        Hare, Catherine<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        This paper addresses the effective implementation of change through the identification of issues associated with three key institutional areas which, together, will ensure the effective'integration of multimedia technologies into teaching and learning. These are the need for a firm commitment of support at the institutional level, the development of an institutional strategy, with related staff‐development policies and programmes, and provision for students and academic staff to. acquire enabling IT skills through resource‐based learning as a means to maximize the benefits to be gained from the use of these new technologies. The essential conditions which ensure effective implementation ‐ communication between all stake‐holders, leadership by senior managers, responsive central services and a mixture of funding arrangements ‐ are discussed<\/dc:description><dc:publisher>\n        Universit of Wales Press<\/dc:publisher><dc:date>\n        1996<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/219\/1\/ALT_J_Vol4_No3_1996_Effecting%20institutional%20change.pdf<\/dc:identifier><dc:identifier>\n          McCartan, Audrey and Hare, Catherine  (1996) Effecting institutional change: The impact of some strategic issues on the integratiye use of IT in teaching and learning.  Association for Learning Technology Journal, 4 (3).  pp. 21-28.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776960040304<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/219\/","10.1080\/0968776960040304"],"year":1996,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Effecting institutional change:\nthe impact of some strategic issues on the integratiye use of\nIT in teaching and learning\nAudrey McCartan* and Catherine Hare**\n*University of Durham and **University of Northumbria at Newcastle\nThis paper addresses the effective implementation of change through the identification of issues\nassociated with three key institutional areas which, together, will ensure the effective'integration of\nmultimedia technologies into teaching and learning. These are the need for a firm commitment of\nsupport at the institutional level, the development of an institutional strategy, with related staff-\ndevelopment policies and programmes, and provision for students and academic staff to. acquire\nenabling IT skills through resource-based learning as a means to maximize the benefits to be gained\nfrom the use of these new technologies. The essential conditions which ensure effective implementation\n- communication between all stake-holders, leadership by senior managers, responsive central services\nand a mixture of funding arrangements -r are discussed\nThe changing higher-education environment\nAn increasing number of multimedia-type products are being developed for the higher-\neducation market. This development is gathering pace as the Teaching and Learning\nTechnology Programme (TLTP) projects deliver their courseware. TLTP arid the Fund\nfor the Development of Teaching and Learning (HEFCE Circular 29\/95) are initiatives\nthrough which the integration of multimedia, technologies- into hjgherreducatiofi\ninstitutions has been actively promoted through the allocation of nationally administered\nfunding.\nIn a rapidly changing higher-education environment, there is an emphasis on widening\naccess for both school-leavers and. mature students, modularization of course structures\nand diversification of course content, increasing costs and the diminishing unit of\nresource. In a speech to the CVCP, the Minister for Higher Education (11 -December\n1995) stated that 'new methods, of teaching, especially the growing potential of\ninformation technology,, offer scope for further improvements in productivity'. The\nFunding Councils have indicated a number of areas where they believe the\n (use of\ntechnology can have substantial benefits. The. intention is to help institutions respond\n. . ^, . _\nAudrey McCartan and Catherine Hare Effecting institutional change: the impact of some strategic issues on the use of IT\neffectively to this changing environment while continuing to promote and maintain\nquality provision within a context of public accountability. The considerable increases in\ncomputer power and functionality which have been developing during the same time, the\nintroduction of distributed systems, networks, and the increased availability of\ncomputers, have contributed to a growing awareness and use of the new technologies in\nthe management, delivery and assessment of teaching and learning.\nIt is apparent that, at the present time, many academic staff are not poised to make\neffective use of multimedia products in academic courses, nor are students equipped to\nexploit computer-mediated learning materials. Experience at both national and local\nlevels suggests that the availability of multimedia learning-support materials alone is not\nsufficient to ensure their widespread use (McCartan et al, 1994). The popularity of the\nrecent programme of regional workshops, which were conducted within the delivery of\nthe TLTP project IT in Teaching and Learning: A Staff Development Pack, demonstrated\nthe need for staff development programmes in the uses of IT in all aspects of curriculum\ndesign and assessment. The importance of staff development was underlined again\nrecently in the Higginson Report (FEFC, 1996) which recommended a sector-wide\ninitiative to enhance the professional skills of staff in the further-education sector, and to\nalert them to the opportunities presented for more effective teaching and learning using\nmodern technologies. Some examples of the development of institutional teaching and\nlearning strategies incorporating the integrative use of IT and the implementation of\nspecific programmes designed to improve the IT skills-base and to promote the\nintegrative use of IT in teaching and learning were demonstrated and discussed at a forum\nin 1994 (McCartan and Hare, 1994). The most successful developments which actively\nsupport learning included a partnership between academic staff, on the one hand, and\ncentral services on the other, both focusing on the use of IT as a mass teaching, learning\nand information storage and retrieval medium.\nIn this paper the significance of the impact of the institutional context on the existing gap\nbetween the aims and objectives of current developmental projects, and the ability and\nreadiness of staff and students to capitalize on their benefits, is examined through the\nidentification and analysis of some critical institutional and strategic factors. These\nprovide the framework which determines the development and implementation of\ninstitutional models of IT training and development.\nDevelopment of the institutional models\nThe need for institutional support to encourage the integration of new technology into the\nacademic curriculum was apparent from the report of the Information Technology\nTraining Initiative (ITTI) funded Skills Levels Project (Hodgson et al, 1994). Sixteen\nuniversities had participated actively in the project for which representative members of\neach institution's senior officers, academic and other staff had formed a working party to\nundertake an internal consultation exercise. The membership and remit of the group was\ndetermined by the priorities of each institution within the broad aims of the project. The\noutcomes could be used, therefore, as much to further institutional development as to\ncontribute to the identification of trends across the consortium. There were strong\nindications from the participating universities, the associated programme of regional\nAn-j Volume 4 Number 3\nworkshops and from the sales of the report, that the project had proved to be both relevant\nin its focus on individual institutional situations and timely in its consideration of the\ndevelopment needs of all staff in respect of the integrative use of IT in their job functions.\nThe TLTP project Core IT Skills for Teaching and Learning in Higher Education: Tools\nfor the Development of a National Framework (Hodgson et at, 1995) has applied similar\nmethodological procedures to assess the impact of key institutional factors on the\nformulation and implementation of teaching and learning policy. About 30 institutions\nhave been included in the nation-wide consultation process through the collection of\nextensive experiential data. Detailed institutional information has been gathered from\nnine universities, selected to be representative of the whole sector, with a number of 'old'\nand 'new' universities, and including a number which had expressed a wish to join the\nconsortium as a means of benefiting their own development.\nA working group was formed in each institution consisting of a wide range of staff\nrepresenting different functions and including senior officers. Given institutional\ndiversity, it was not considered appropriate to ask institutions to return the information\nin strict questionnaire format. Documentation was provided which indicated the areas in\nwhich responses were considered to be most helpful (see Figure 1), but institutions were\nfree to add headings they considered relevant to their own exercise. Contact was\nmaintained throughout with the project team, and progress monitored. Some additional\nvisits, reviews and some telephone interviews were all arranged as a result of particular\ncircumstances. The procedure proved to be both responsive and flexible to changes which\noccurred in the institutions during the course of the consultation exercise. This has meant\nthat the information gathering has taken place over an extended period, and in some\ncases the original completion has had to be updated in the light of subsequent events.\nThe involvement of the project over a period of two years with each participating\ninstitution has demonstrated the significant impact of change as a function of various\nexternal and internal pressures. No institution was left untouched. Participation in the\nproject's activities has prompted institutional responses to situations which have been\naddressed through bringing together a range of professional expertise, which would\notherwise be channelled through a number of different and, perhaps, mutually exclusive\nreporting routes within the university. A result in one institution is a new student IT-skills\ninitiative which aims to increase the provision of IT-skills training for students in the\nuniversity by encouraging departments, or groups of departments, to introduce subject-\noriented IT-skills modules. Another university used the collection of the institutional\ninformation as an opportunity to enhance communications between staff with disparate\nresponsibilities, and to urge forward an institutional approach to the development of\nteaching and learning and IT strategies. The project team provided feedback through\ncustomized workshops delivered locally to the university on its responses in relation to its\ndeclared priorities. The result of the compilation of all the institutional information is a\nchronicle of the complexities and interconnectedness of organizational change, and the\nevolution of institutional structures. The information has been developed into a series of\ninstitutional models which describe the patterns of structures in place in the mix of\nhigher-education institutions covered by the project. These illustrate the dynamic\nrelationship between institutional culture and strategies for change and development, and\nthe key areas of implementation for the integrative use of IT in teaching and learning.\n23\nAudrey MoCartan and Catherine Hare Effecting institutional change: the impact of some strategic issues on the use of IT\nAllocation of resources in the institution\nFunding of academic departments\/sections\nFunding of IT, library and other services\nIT Services\nSections involved\nFunctions\nIT strategies\nManagement\nMonitoring of policies\nTeaching and Learning\nPolicies\nManagement\nMonitoring of policies\nRelationship between IT and Teaching and Learning\nLinks\nExternally funded projects\nIT and developments in teaching and learning\nStaff Development Function\nInstitutional policy\nManagement\nMonitoring of policies\nFunding\nIT Training\nAcademic staff\nOther staff\nStudents\nFuture Developments\nfigure I: Institutional information\nInstitutional models to support the integrative use of IT in teaching\nand learning\nThe models do not relate to any single institution, but rather bring together the\ncharacteristics which have been identified in a number of universities of similar types.\nThey focus on the key factors relating to IT in teaching and learning, presenting the inter-\nrelationship between the centre, the executive framework and the support services of the\ninstitution in an attempt to assess the most effective arrangement for integrating IT in\nteaching and learning. There are basically three models (illustrated in Figure 2).\nI . Traditional 'passive' model - :\nAs the name suggests, this model is characteristic of the traditional universities typified by\nstrong central services, e.g. IT services and staff development, funded by top-slicing and\noperating independently. In addition to the top-slicing, other funding allocations are\nnormally on a formula basis. .\nAlongside the central services, and running in parallel, is the committee structure. The\ncommittees of which the most important will be chaired by Pro Vice Chancellors, Deans\nof Faculty or senior professional staff, are a well-established mechanism for policy and\nstrategy development. However, in practice there is evidence that they are now more a\nvehicle for implementation, with policy and strategy being developed by small groups of\nsenior staff. Their composition will.vary either by a process of election or rotation\nresulting in a lack of continuity which can hamper, sustained development in an area such\nas the integration of IT into teaching and learning which is often characterized by extreme\npolarization of views as to its merits and benefits.\nBoth the central services and committees dispense their 'service' or authority to the users\n24\nVolume 4 Number 3\nI. Traditional \"Passive\" 2. \"Active\"\nTop-Slicing\nto support central_\nservices\nCENTRAL\nDepts\/\nindividualsj\nTeaching &\nLearning\nCommittee\nn\" Service 7T\\\nCommittees Departments\nV ' T\n3. Modern \"Proactive\"\nStrong links between\nIT and Teaching and Learning\nSenior Manager responsible for\nIT and\/or Teaching and Learning\nStaff or student user\nl ine of communication\nfigure 2: Institutional models to support the integrative use of IT in teaching and learning\nacting as one-way, top-down conduits for institutional policies and strategies which tend\nto be rather weak. There is no single individual at a senior position in the centre whose\nprime and constant responsibility is IT and\/or teaching and learning.\nThis model in the past provided reasonable technical infrastructure (that is, from\nComputer Board monies) together with development funding. However, nowadays the\nharsh reality is a major reduction in funding combined with the introduction of devolved\nbudgets and associated devolved responsibilities. This has resulted in central services\nrefusing to take on additional services unless they get paid to do so. The departments\nindividually make choices about how they support IT in teaching and learning in terms of\nequipment, staff development and student IT-skills programmes. They often duplicate\nactivity with initiatives repeating work already undertaken and evaluated in other\ndepartments. This is particularly true in the case of documentation which could be\neffectively and efficiently co-ordinated at the centre. There are, however, pockets of\nactivity led by enthusiasts often with funding from institutional initiatives. But their best\nefforts do not get a chance to propagate because of the rigidity of the system, the absence\nof effective communication channels, and the lack of a champion at a senior level. Despite\nsome users being well served for specific applications, there is no recognition of the\ndeveloping importance of IT in teaching and learning because there is no single focus at\nthe institutional level, and no forum for discussion and exchange of ideas. The\ncommunication is all from the top down, with only a relatively small number of people\n25\nAudrey McCartan and Catherine Hare Effecting institutional change: the impact of some strategic issues on the use of IT\ninvolved. The rigidity of the structure, which in the past was a strength when change was\na rare phenomenon, now has become a weakness in providing an appropriate\nenvironment for the integration of IT in teaching and learning which, because of its\npervasive nature, needs to cut across what remain parallel and independent activities.\n2. 'Active' model\nThis model, with its three sub-models which have either committees, departments or a\ngroup of senior staff at the second level of management, can be found in both traditional\nand new universities. Central services remain relatively strong but participate actively in\nserving the needs of their users. In each of the sub-models there is effective and efficient\ntwo-way communication with the users, and a direct feedback loop to a senior individual\nwhose prime responsibility is IT and\/or teaching and learning.\nIn this model, devolved funding is the norm, and results in devolved structures and\nresponsibilities which work together effectively to maximize the benefits and efficiency\ngains from the funding arrangement. It is likely that departments will buy into central\nservices which might include access to the network, provision of training and\/or training\nmaterials for staff and\/or students. The committee structure may in some cases retain an\nimportant role, but the structure will allow for the bringing together of the teaching,\ninformation and technology issues because of more opportunities for communication and\nexchange of ideas between and across levels of management. The whole culture and\ncommunication infrastructure actively involves more people across the different levels,\nthus providing a robust framework with in-built flexibility.\nThe greatest strength of this model is the senior individual who embraces technical\nexpertise with an understanding of its implications for the management of all aspects of\nthe university's business, together with the vision to fulfil the developmental needs of all\nstaff in respect of the integrative use of IT in their job functions. This feature can,\nhowever, also be the greatest weakness of this model, particularly in the new universities\nwhere senior staff are in promoted and therefore semi-permanent posts and may not have\nthe mix of knowledge, skills and vision required. In the traditional universities there is\nalso a potential weakness but for a very different reason: the senior individual will hold\nthe post only for a fixed term of office, which is good if the person lacks vision but poor if\nthe person has vision and moves on. There is another potential weakness in this model\nwhere resources at the centre are not adequate to maintain and consolidate the central\nservices. This situation is especially prevalent in the new universities which are still\nstriving to catch up in terms of IT infrastructure without any additional funding to\ncompensate them for the Computer Board monies from which the traditional universities\nbenefited in the past.\n3. Modern 'proactive' model\nThis model to date seems to appear only in the new universities. There is an additional fund-\ning element to top-slicing and formulae: bid funding. Central services are no longer large and\ntend to be integrated. They also operate on a service model supported by service-level agree-\nments. Devolved budgeting and responsibilities are very much the norm, with some buying in\nof external services, including training and documentation. The committee structure is very\nweak, with management being implemented via a hierarchy of management groups\ncomposed in the majority of academics who have been promoted to management posts.\n26\nALT-] Volume 4 Number 3\nThe institutional policies play a key role of informing, directing and providing a\nmonitoring device and\/or performance measures for all developments. They hold together\nwhat is a very distributed and therefore potentially fragile structure. The departments\/\nschools become key nodes implementing institutional policies, often by the appointment\nof academic staff to some responsibilities for IT in teaching and learning, including staff\ndevelopment, and also for taking feedback from the consumers\/users. The system is thus\nresponsive to user-need. There will be strong departmental projects, including participa-\ntion in ITTI and TLTP projects. The central services act as the hub of the network, but\ncommunication can break down as neither the hub nor the nodes want to invest their\nresources, which are often limited, in maintaining the links, and the nodes in some cases\nmay even choose to buy in services from outside rather than pay into central provision.\nA recognition of the importance of the strong linking of IT into teaching and learning is a\nsignificant feature of this model. This is predicated on strong networking between all\nstaffs. The impetus for change, however, also needs a strong and enthusiastic individual at\nthe top who ideally has responsibility for both IT and teaching and learning. A key focus\nis the provision of a range of proactive, integrated services, providing expertise and\nsupport to underpin the implementation.\nThe proactive model thus involves the greatest number of people with communication top\ndown, bottom up and across the levels. It is the model which applies to a greater number\nof institutions than the other two models. The approach adopted by\" each university\ndepends very much, however, on the institutional context, and progress will be\ndetermined by the strength of the imperative to integrate IT into teaching and learning.\nThe progression from model to model does not need to be incremental. It is possible to\nleapfrog a stage. The impetus\/movement for change comes when IT is linked into\nteaching and learning, and this is reflected in the institutional policies and strategies.\nEffective implementation of change\nInstitutional change is a continual evolutionary process, especially in the use of IT where\ninstitutions are urged to exploit its use in the management, delivery and assessment of\nteaching and learning. The different models have shown varied responses to the integrat-\nive use of IT in teaching and learning. The most recent manifestation of this imperative\ncan been seen in the Teaching Quality Assessment (TQA) exercise which both explicitly\nand implicitly makes requirements on teaching departments in terms of IT management\nand integration issues. This imperative to integrate will be interpreted in different ways\ndepending on the particular institutional context. The evidence, as highlighted in the\ndetailed expositions of the passive, active and proactive models from the consortium\ninstitutions, which represent varied traditions, missions and executive frameworks, shows\nthe need to fulfil the following essential conditions to ensure effective implementation:\n• communication between all stake-holders (all personnel and students);\n• a senior manager in charge of IT and\/or teaching and learning;\n• responsive central services;\n• a mixture of funding arrangements.\n27\nAudrey McCortan and Catherine Hare Effecting institutional change: the innpact of some strategic issues on the use of IT\nReferences\nFEFC (Further Education Funding Council) (1996), Report of the Learning and\nTechnology Committee (Higginson Report).\nHodgson, M., McCartan, A. and Hare, C. (1994), A Framework for the Development of\nCore IT Skills for University Staffs, CVCP\/USDU Publications.\nHodgson, M., McCartan, A., Clayphan, R., Hare, C , and Jezierski, G. (1995), Teaching\nand Learning in Higher Education: The Integrative Use of IT within the Institutional\nContext, University of Durham.\nMcCartan, A., Watson, B., Lewins, J. and Hodgson, M. (1994), 'Enabling learning\nthrough technology: some institutional perspectives', Alt-J, 3 (1), 92-7.\nMcCartan, A. and Hare, C. (eds.) (1994), Enabling Technologies for Teaching and\nLearning: National Perspectives and Futures, Oxford: CTISS Publications.\n28\n"}