{"doi":"10.1080\/09583150802585769","coreId":"138589","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3099","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3099","10.1080\/09583150802585769"],"title":"Physiological manipulation and formulation of the biocontrol yeast Pichia anomala for control of Penicillium verrucosum and ochratoxin A contamination of moist grain.","authors":["Mokiou, Stella","Magan, Naresh"],"enrichments":{"references":[{"id":38065967,"title":"Conservation of yeasts by dehydration.","authors":[],"date":"1987","doi":"10.1007\/bfb0004428","raw":"Beker MJ, Rapoport AI. 1987. Conservation of yeasts by dehydration. Advances in Biochemichal Engineering and Biotechnology 35:127-171.15 Björnberg A, Schnürer J. 1993. Inhibition of the growth of grain-storage moulds in vitro by the yeast Pichia anomala (Hansen) Kurtzman. Canadian Journal of Microbiology 39: 623-628.","cites":null},{"id":38065982,"title":"Control of blue mould of apples by preharvest application of Candida sake grown on media with modified water activity.","authors":[],"date":"1998","doi":"10.1094\/phyto.1998.88.9.960","raw":"Teixido, N, Vinas I, Usall J, Magan N. 1998. Control of blue mould of apples by preharvest application of Candida sake grown on media with modified water activity. Phytopathology 88: 960-964.","cites":null},{"id":38065965,"title":"Development of a population based threshold model of conidial germination for analysing the effects of physiological manipulation on the stress tolerance and infectivity of insect pathogenic fungi.","authors":[],"date":"2006","doi":"10.1111\/j.1462-2920.2006.01055.x","raw":"Andersen M, Magan N, Mead A, Chandler D. 2006. Development of a population based threshold model of conidial germination for analysing the effects of physiological manipulation on the stress tolerance and infectivity of insect pathogenic fungi. Environmental Microbiology 8:1625-1634.","cites":null},{"id":38065977,"title":"Drying of Epicoccum nigrum conidia for obtaining a shelf-life stable biological product against brown rot disease.","authors":[],"date":"2003","doi":"10.1046\/j.1365-2672.2003.01860.x","raw":"Larena I, De Cal A, Linan M, Melgarejo P. 2003. Drying of Epicoccum nigrum conidia for obtaining a shelf-life stable biological product against brown rot disease. Journal of Applied Microbiology 94: 508-514.16 Magan, N. (2001). Physiological approaches to improving ecological fitness of biocontrol agents. Chapter 9 in Fungal Biocontrol Agents: Progress, Problems and Potential, eds. T.Butt, C.Jackson & N.Magan. Cabi BioSciences. Pp.239-252.","cites":null},{"id":38065978,"title":"Ecophysiology of biocontrol agents for improved competence in the phyllosphere.","authors":[],"date":"2006","doi":"10.1079\/9781845930615.0149","raw":"Magan N. 2006. Ecophysiology of biocontrol agents for improved competence in the phyllosphere. In Microbial Ecology of Aerial Plant Surfaces, eds. M.J. Bailey, A.K. Lilley, T.M. Timms-Wilson and P.T.N. Spencer-Phillips. CABI International, Wallingford, U.K., pp. 150-164.","cites":null},{"id":38065971,"title":"Effect of drying on conidial viability of Penicillium frequentans, a biological control agent against peach brown rot disease caused by Monilinia spp.1.","authors":[],"date":"2006","doi":"10.1080\/09583150500335897","raw":"Guijarro B, Larena I, Melgarejo P, De Cal A. 2006. Effect of drying on conidial viability of Penicillium frequentans, a biological control agent against peach brown rot disease caused by Monilinia spp.1. Biocontrol Science and Technology 16: 257-269.","cites":null},{"id":38065974,"title":"Efficacy of commercial formulation of two biofungicides for control of blue mold and gray mold of apples in cold storage.","authors":[],"date":"1997","doi":"10.1016\/s0261-2194(97)00048-3","raw":"Janisiewicz WJ, Jeffers, SN. 1997. Efficacy of commercial formulation of two biofungicides for control of blue mold and gray mold of apples in cold storage. Crop Protection 16: 629-633.","cites":null},{"id":38065970,"title":"Efficacy of the biocontrol yeast Pichia anolmala during long term storage of moist feed grain under different oxygen and carbon dioxide regimens.","authors":[],"date":"2002","doi":"10.1016\/s1567-1356(02)00091-0","raw":"Druverfors U, Jonsson N, Boysen ME, Schnürer J. 2002. Efficacy of the biocontrol yeast Pichia anolmala during long term storage of moist feed grain under different oxygen and carbon dioxide regimens. FEMS Yeast Research 2: 389-394.","cites":null},{"id":38065973,"title":"Evaluation of the stain viablue for the rapid estimation of viable yeast cells.","authors":[],"date":"1988","doi":"10.1111\/j.1472-765x.1988.tb01220.x","raw":"Hutcheson TC, McKay T, Farr L, Seddon B. 1988. Evaluation of the stain viablue for the rapid estimation of viable yeast cells. Letters in Applied Microbiology 6: 85-88.","cites":null},{"id":38065984,"title":"Influence of trehalose and moisture content on survival of Lactobacillus salivarius subjected to freeze-drying and storage.","authors":[],"date":"2004","doi":"10.1016\/s0032-9592(03)00222-x","raw":"Mycological Research 108: 1337-1345.17 Zayed G, Roos YH. 2004. Influence of trehalose and moisture content on survival of Lactobacillus salivarius subjected to freeze-drying and storage. Proceedings of Biochemistry 39: 1081–1086.18","cites":null},{"id":38065964,"title":"Liquid formulation of postharvest biocontrol agent Candida sake CPA-1 in isotonic solutions.","authors":[],"date":"2003","doi":"10.1094\/phyto.2003.93.4.436","raw":"Abadias M, Usall J, Teixido N, Vinas I. 2003. Liquid formulation of postharvest biocontrol agent Candida sake CPA-1 in isotonic solutions. Phytopathology 93: 436–442.","cites":null},{"id":38065972,"title":"Manipulation of intracellular glycerol and erythritol enhances germination of conidia at low water availability.","authors":[],"date":"1995","doi":"10.1099\/13500872-141-5-1109","raw":"Hallsworth JE, Magan N. 1995. Manipulation of intracellular glycerol and erythritol enhances germination of conidia at low water availability. Microbiology 141: 1109-1115.","cites":null},{"id":38065966,"title":"Mechanism of viability loss during fluidised bed drying of baker’s yeast.","authors":[],"date":"1997","doi":"10.1016\/s0963-9969(97)00072-0","raw":"Bayrock D, Ingledew WM. 1997. Mechanism of viability loss during fluidised bed drying of baker’s yeast. Food Research International 30:417-425.","cites":null},{"id":38065979,"title":"Mycotoxins in food: detection","authors":[],"date":"2004","doi":"10.1201\/9781439823361","raw":"Magan N, Olsen M. 2004. Mycotoxins in food: detection and control. Woodhead, Oxford. U.K. Mokiou S, Magan N. 2002. Ecophysiological manipulation of the fermentation process improves viability of the biocontrol yeast Pichia anomala. Biocontrol of Fungal and Bacterial Plant Pathogens, IOBC wprs Bulletin 25: 395-398.","cites":null},{"id":38065981,"title":"Optimisation and comparison of liquid and dry formulations of the biocontrol yeast Pichia anomala J121.","authors":[],"date":"2007","doi":"10.1007\/s00253-006-0552-x","raw":"Melin P, Hakansson S, Schnürer J. 2007. Optimisation and comparison of liquid and dry formulations of the biocontrol yeast Pichia anomala J121. Applied Microbiology and Biotechnology 73: 1008-1016.","cites":null},{"id":38065969,"title":"Stabilization of dry phospholipids bilayers and proteins by sugar.","authors":[],"date":"1987","doi":null,"raw":"Crowe JH, Crowe LM, Carpenter JF, Winstrom CA. 1987. Stabilization of dry phospholipids bilayers and proteins by sugar. Biochemical Journal 242: 1-10.","cites":null},{"id":38065980,"title":"Survival of the biocontrol yeast Pichia anolmala after long term storage in liquid formulations and different temperatures, assessed by flow cytometry.","authors":[],"date":"2006","doi":"10.1111\/j.1365-2672.2005.02778.x","raw":"Melin P, Hakansson S, Eberhard TH, Schnurer J. 2006. Survival of the biocontrol yeast Pichia anolmala after long term storage in liquid formulations and different temperatures, assessed by flow cytometry. Journal of Applied Microbiology 100: 264-271.","cites":null},{"id":38065983,"title":"The effect of water activity, modifying solute and culture age on Metarhizium anisopliae blastospore production, quality and germinability.","authors":[],"date":"2004","doi":null,"raw":"Ypsilos IK, Magan N. 2004. The effect of water activity, modifying solute and culture age on Metarhizium anisopliae blastospore production, quality and germinability.","cites":null},{"id":38065968,"title":"Water, temperature and gas composition interactions affect growth and ochratoxin A production by isolates of Penicillium verrucosum on wheat grain.","authors":[],"date":"2005","doi":"10.1111\/j.1365-2672.2005.02695.x","raw":"Cairns-Fuller V, Aldred D, Magan N. 2005. Water, temperature and gas composition interactions affect growth and ochratoxin A production by isolates of Penicillium verrucosum on wheat grain. Journal of Applied Microbiology 99:1215-1221.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2008","abstract":"The major hurdle in the production of commercial biocontrol agents (BCAs) has been the lack of production of appropriate formulations. Of particular importance is the conservation of viability and ecological competence after application. With this in mind studies were conducted to develop formulations of P. anomala which would have these attributes. Cells were grown in molasses-based medium modified with proline to different water availability levels (0.98 and 0.96) which significantly increased (up to 50%) the content of trehalose and arabitol in the yeast cells during liquid broth fermentation. The use of isotonic solutions for harvesting the yeast cells further increased the endogenous content of these compatible solutes as well as glycerol. Fluidised bed drying of cells at 30-80°C was carried out for 10 and 20 min and showed that viability was significantly decreased at 70-80°C. A temperature of 50°C for 20 min was found to be best for viability (70%) and moisture content of <10%. Several additives for conservation of viability showed that cotton seed flour+skimmed milk was the best treatment when dried at 50°C. The biocontrol efficacy of formulated P. anomala cells was tested in laboratory scale studies and this showed that they inhibited growth of Penicillium verrucosum and reduce ochratoxin A production in moist wheat grain under some combinations of water availability. Physiologically modified formulated yeast cells with increased levels of trehalose and arabitol gave similar efficacy as fresh cells. This suggests that ecophysiological manipulation of such BCAs can result in improved ecological competence of such formulations and effective biocontrol","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138589.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1080\/09583150802585769","pdfHashValue":"e617dc0e57eec88c7eba38b2dc8c3d5335be6fc6","publisher":"Taylor and Francis","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3099<\/identifier><datestamp>2010-02-03T15:09:09Z<\/datestamp><setSpec>hdl_1826_2005<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Physiological manipulation and formulation of the biocontrol yeast Pichia anomala for control of Penicillium verrucosum and ochratoxin A contamination of moist grain.<\/dc:title><dc:creator>Mokiou, Stella<\/dc:creator><dc:creator>Magan, Naresh<\/dc:creator><dc:subject>yeast cell quality<\/dc:subject><dc:subject>formulations<\/dc:subject><dc:subject>sugar alcohols<\/dc:subject><dc:subject>fluidised bed drying<\/dc:subject><dc:subject>spoilage fungi<\/dc:subject><dc:subject>ochratoxin<\/dc:subject><dc:subject>stored grain<\/dc:subject><dc:description>The major hurdle in the production of commercial biocontrol agents (BCAs) has been the lack of production of appropriate formulations. Of particular importance is the conservation of viability and ecological competence after application. With this in mind studies were conducted to develop formulations of P. anomala which would have these attributes. Cells were grown in molasses-based medium modified with proline to different water availability levels (0.98 and 0.96) which significantly increased (up to 50%) the content of trehalose and arabitol in the yeast cells during liquid broth fermentation. The use of isotonic solutions for harvesting the yeast cells further increased the endogenous content of these compatible solutes as well as glycerol. Fluidised bed drying of cells at 30-80°C was carried out for 10 and 20 min and showed that viability was significantly decreased at 70-80°C. A temperature of 50°C for 20 min was found to be best for viability (70%) and moisture content of <10%. Several additives for conservation of viability showed that cotton seed flour+skimmed milk was the best treatment when dried at 50°C. The biocontrol efficacy of formulated P. anomala cells was tested in laboratory scale studies and this showed that they inhibited growth of Penicillium verrucosum and reduce ochratoxin A production in moist wheat grain under some combinations of water availability. Physiologically modified formulated yeast cells with increased levels of trehalose and arabitol gave similar efficacy as fresh cells. This suggests that ecophysiological manipulation of such BCAs can result in improved ecological competence of such formulations and effective biocontrol.<\/dc:description><dc:publisher>Taylor and Francis<\/dc:publisher><dc:date>2009-01-23T11:49:04Z<\/dc:date><dc:date>2009-01-23T11:49:04Z<\/dc:date><dc:date>2008<\/dc:date><dc:type>Postprint<\/dc:type><dc:identifier>Stella Mokiou, Naresh Magan, Physiological manipulation and formulation of the biocontrol yeast Pichia anomala for control of Penicillium verrucosum and ochratoxin A contamination of moist grain. Biocontrol Science and Technology, Volume 18, Issue 10, 2008, pp 1063-1073<\/dc:identifier><dc:identifier>0958-3157<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1080\/09583150802585769<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/3099<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0958-3157","0958-3157"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["yeast cell quality","formulations","sugar alcohols","fluidised bed drying","spoilage fungi","ochratoxin","stored grain"],"subject":["Postprint"],"fullText":"1Biocontrol Science and Technology, Vol. 18, No. 10, 2008, pp1063-1073.\nDOI: 10.1080\/09583150802585769\nPhysiological manipulation and formulation of the biocontrol yeast Pichia anomala for\ncontrol of Penicillium verrucosum and ochratoxin A contamination of moist grain\nStella Mokiou* and Naresh Magan\nApplied Mycology Group, Cranfield Health, Cranfield University, Bedford MK43 0AL, U.K.\nAddress for correspondence: Prof. N. Magan, Applied Mycology Group, Cranfield Health,\nCranfield University, Bedford MK43 0AL, U.K. Tel: +44 1234 758303; Fax: +44 1234\n758370; E-mail: n.magan@cranfield.ac.uk\nKey words: yeast cell quality, formulations, sugar alcohols, fluidised bed drying, spoilage\nfungi, ochratoxin, stored grain\n* Present address: NAGREF, Thessaloniki, Greece\n2Abstract\nThe major hurdle in the production of commercial biocontrol agents (BCAs) has been the lack\nof production of appropriate formulations. Of particular importance is the conservation of\nviability and ecological competence after application. With this in mind studies were\nconducted to develop formulations of P. anomala which would have these attributes. Cells\nwere grown in molasses-based medium modified with proline to different water availability\nlevels (0.98 and 0.96) which significantly increased (up to 50%) the content of trehalose and\narabitol in the yeast cells during liquid broth fermentation. The use of isotonic solutions for\nharvesting the yeast cells further increased the endogenous content of these compatible\nsolutes as well as glycerol. Fluidised bed drying of cells at 30-80oC was carried out for 10 and\n20 mins and showed that viability was significantly decreased at 70-80oC. A temperature of\n50oC for 20 mins was found to be best for viability (70%) and moisture content of <10%.\nSeveral additives for conservation of viability showed that cotton seed flour+skimmed milk\nwas the best treatment when dried at 50oC. The biocontrol efficacy of formulated P. anomala\ncells was tested in laboratory scale studies and this showed that they inhibited growth of\nPenicillium verrucosum and reduce ochratoxin A production in moist wheat grain under some\ncombinations of water availability. Physiologically modified formulated yeast cells with\nincreased levels of trehalose and arabitol gave similar efficacy as fresh cells. This suggests\nthat ecophysiological manipulation of such BCAs can result in improved ecological\ncompetence of such formulations and effective biocontrol.\n3Introduction\nFor animal feed, airtight storage of the cereal grain in silos is an alternative energy-saving\nmethod compared to high temperature drying of temperate cereals. However, temporal\nfluctuation of carbon dioxide and oxygen levels do occur and this eventually leads to heavy\nmould growth and poor quality animal feed grain. Pichia anomala has been frequently\nisolated from airtight-stored grains and Björnberg & Schnürer (1993) first showed that strain\nJ121 effectively reduced growth of Penicillium roqueforti in vitro in a dose-dependent\nmanner. P. anomala was also shown to reduce ochratoxin A (OTA) accumulation in co-\nculture with Penicillium verrucosum.\nThe major obstacle in the commercialisation of biocontrol agents (BCA) products is the\ndevelopment of a shelf-life-stable formulated product that retains efficacy similar to those of\nfresh BCA cells (Janisiewicz & Jeffers, 1997; Magan, 2006). BCAs are living organisms and\ntheir economic production process, formulation, distribution and application are of great\nimportance and require special considerations. Drying microorganisms enables preservation\nof the inoculum over a long period of time, maintaining high viability, and does not require\ncool temperatures during storage and distribution.\nMagan (2001; 2006) has demonstrated that it is possible to utilise physiological stress\nconditions to enable a significant increase in the endogenous synthesis of compatible solutes\nsuch as trehalose and low molecular weight sugar alcohols (erythritol or glycerol). This was\nshown to result in improved viability especially under water stress conditions for yeast BCAs\nsuch as Candida sake (Teixido et al., 1998) and filamentous fungi (Magan, 2001; 2006). This\ncan produce characterised BCA inocula which have a better ecological competence,\nespecially in the phyllosphere.\n4Recent studies have furthermore shown that the use of isotonic solutions for harvesting of\nsuch characterised BCAs can result in a significant increase in retention of trehalose and sugar\nalcohols in yeast cells and spores (Abadias et al., 2003; Ypsilos and Magan, 2004). The\nquestion is whether these aspects can be combined to develop appropriate formulations which\ncan conserve these improved ecophysiological quality.\nFluidised bed-drying has been extensively used to manufacture active dry yeast on a large\nscale (Bayrock & Ingledew, 1997). Hallsworth & Magan (1995) showed that elevated\nconcentrations of the dissacharide trehalose, in response to osmotic stress, in conidia of\nentomopathogenic fungi prolonged shelf-life. Mokiou & Magan (2002) showed that P.\nanomala cells intracelularly accumulated trehalose when exposed to water stress by addition\nof proline and NaCl to molasses-based media. Formulations of other biocontrol agents (e.g.\nCandida sake, Penicillium oxalicum, Penicillium frequentans, Epicoccum nigrum, Pantoea\nagglomerans) have also been examined using fluidised bed drying (Larena et al., 2003,\nGuijarro et al., 2006; Magan 2006). Recently, Melin et al. (2006) compared different\nformulations and showed that some liquid formulations containing exogenously supplied\ncommercial trehalose were effective for long term storage of Pichia anomala and control of\nP. roqueforti in moist sealed feed grain.\nOchratoxin A (OTA) is a class 2b carcinogen for which EU legislation exists in a range of\nfood raw materials and products including cereals (Magan & Olsen, 2004). The origin of\nOTA in cool and temperate climates is generally attributed to P. verrucosum, whereas in\nwarm temperate and tropical zones it is now commonly associated with A. ochraceus and the\nblack aspergilli. Recent studies have identified the water and temperature requirements for\n5growth and OTA production by P. verrucosum (Cairns-Fuller et al., 2005). There is interest in\nminimising the contamination of such toxins in the food and feed chains. However, few if any\nstudies have been carried out under different steady state intermediate moisture conditions to\nexamine whether ochratoxin A can be effectively controlled using formulations of BCAs\nduring post-harvest storage.\nThe objectives of this study were to (a) produce characterised P. anomala cells in liquid broth\nculture with elevated compatible solutes for stress tolerance, (b) evaluate the addition of\ndifferent additives to these treatments prior to fluidised-bed drying on protection of cell\nviability and (c) to test the best formulations in controlling P. verrucosum and OTA in moist\ngrain at intermediate water availability conditions.\nMaterials and methods\nMicroorganism, fermentation media and extraction of polyols and sugars\nThe microorganism used in this study was Pichia anomala (strain J121). This was kindly\nsupplied by Prof. J. Schnürer, Agricultural University, Uppsala, Sweden. Cane molasses-\nbased medium made of cane molasses 40 gl-1 and urea 1.2 gl-1 was used as the basic medium.\nMolasses was kindly supplied by UdL-IRTA, Lleida, Spain; pH 6.1\/aw 0.993-0.996.\nModification of media water activity (aw, 0.98 and 0.96) was made by the addition of proline.\nExtraction of sugar alcohols (mannitol, arabitol, glycerol and arabitol) and sugars (trehalose,\nglucose) was done as detailed in Ypsilos and Magan (2004). The yeast pellets were washed in\nHPLC grade water or isotonic solutions and centrifuged to remove any residual liquid\nmedium. Between 50-100 mg of fresh weight of the yeast cells were extracted. One millilitre\nof HPLC grade water was added and samples were sonicated with a 4 mm sonicator probe for\n2 min at an amplitude of 26 lm (Soniprep 150; Sanyo, Loughborough, UK). After immersion\n6in a boiling water bath for 5 min, the samples were left to cool, and an adequate volume of\nacetonitrile (ACN) was added to each sample to obtain the same ratio of ACN : water as the\nmobile phase (40 : 60). The Eppendorf tubes were centrifuged for 10 min at 1150 g and the\nsupernatant was filtered through a 0.22 μm filter into HPLC vials sealed with plastic septa.\nSugars and sugar alcohols were analysed and quantified by HPLC using a Hamilton HC-75\nCa2+ column (Anachem Ltd, Luton, UK) and a Gilson refractive index detector (Anachem),\nspecifically for sugar:polyol separation. The mobile phase used was a mixture of 40:60\ndegassed ACN:water. The peak areas were integrated and compared with calibration curves\nconstructed with standards of 100–800 ppm of each solute analysed. The sugars analysed\nwere trehalose and glucose and the sugar alcohols were glycerol, erythritol, arabitol and\nmannitol. The results were expressed as milligrams of intracellular component accumulated\nper gram of fresh weight P. anomala cells.\nFluidised bed-drying of the treatments\nInitial studies were carried out with fresh cells. Thus, 100 ml of the chosen molasses based\ntreatment containing proline to modify aw to 0.98 and 0.96 were used in 250 ml conical flasks.\nThese were inoculated with 1ml aliquot of 106 P. anomala cells ml`-1 and were cultured with\nagitation on a rotatory shaker (150rpm) at 25oC. After 48 h of incubation subsamples of each\nconical flask were distributed in 50ml sterile Centrifuge tubes and centrifuged immediately\nfor 15 min at 3300 rpm in a MSE Centaur 2 (Norwich, U.K.) centrifuge. The supernatant was\ndiscarded and yeast cells were washed twice in 50 mls of sterile water. The wet pastes were\nplaced on filter paper to remove excess water before placing in the four tubes of the fluidised\nbed dryer 350S (Burkard Manufacturing Co. Ltd, Hertfordshire, UK) and dried for 10 and 20\nmins at 30-80oC. The final moisture content was determined by oven drying at 80oC\novernight.\n7P. anomala cells were grown in the proline modified molasses-based medium at 0.98 and\n0.96 aw in shake cultures, harvested and washed twice in HPLC grade water or in NaCl (0.98\nor 0.96 aw isotonic solutions) and centrifuged. Carriers [corn meal (CM), cottonseed flour\n(CSF), and wheat starch (WS)] were added in a proportion 1:1 (w\/w, P. anomala cells\/carrier)\nand adjuvants (skimmed milk for CSF and WS and glycerol for CM) at 10% (w\/w). The\npastes were extruded through a 1 ml syringe and then the mixtures (2 g) placed in each of four\ntubes of the fluidised bed-dryer 350s and dried at 50oC for 20 mins. Viability was assessed\nusing a viablue stain (Hutchenson et al., 1998) which was shown to give a good correlation\nbetween cell viability and staining (r2=0.99). All experiments were carried out twice with four\nreplicates per treatment.\nControl of P. verrucosum and ochratoxin contamination\nIrradiated wheat grain with retained germinative capacity was used in this study (Cairns et al.,\n2005). This was modified by the addition of Sterile Distilled Water (SDW) to achieve 0.96\nand 0.93 aw levels. Inoculation of the grain was done so as to achieve a final concentration of\n103 P. verrucosum (strain OTA11) and 1x105 CFUs g-1 grain of P. anomala. The biocontrol\nyeast and the mycotoxigenic species were inoculated individually or in co-cultures. Grain was\nstored in Petri dishes (15 g; 12 replicates per treatment) and three replicates destructively\nsampled after 1, 10, 20, 30 days at 25oC. Treatments were placed in plastic boxes with\nisotonic glycerol solutions to maintain the required atmospheric relative humidity at 25oC. At\neach sampling time, three replicate 1g samples of grain were removed and placed in empty,\nsterile Universal bottles. 9 ml of diluent (SDW+tween 20+ 0.01% agar) was added and shaken\nfor 2 mins. A serial dilution series was performed and 0.1 ml plated at appropriate dilutions\nand spread plated on Nutrient Yeast Dextrose Agar (NYDA) modified to 0.93 aw with PEG\n8200. Growth of the biocontrol agent and P. verrucosum was recorded as CFU g-1.The rest of\nthe sample was used for extraction and OTA analyses. The experiments were all carried out\ntwice.\nOchratoxin A (OTA) extraction and quantification\nExtraction was by shaking treatments containing the solvent methanol for 24 hrs. Samples\nwere subsequently filtered through Whatman No1 paper placed inside a filter funnel\ncontaining 1 g of celite agent. 1 ml aliquots of the methanol extract were placed in a 1.5ml\nplastic Eppendorf tubes and centrifuged in a bench top microcentrifuge (Beckman Lite, Ser\n98E 4000, Beckman Inc. Columbia, U.S.A.) at 13000 rpm for 10 minutes. The pellet\nproduced was discarded and the supernatant put into 1ml amber HPLC vials (Fisher) and\nstored at -20ºC until processed. OTA contents were measured using High Performance Liquid\nChromatography (HPLC). An HPLC (Waters 600E System controller) with a fluorescence\ndetector (Waters 470) and an auto-sampler (Waters 712 WISP) were used (Cairns-Fuller et\nal., 2005). Under these experimental conditions, a fluorescence detection limit of 1-1.2 μg ml-\n1 OTA was possible.\nStatistical analysis\nData were analysed using Genstat software (Genstat 5th edition). Analysis of Variance\n(ANOVA Table) was used to compare different treatments. Percentage data was LOGIT\ntransformed prior to statistical analysis. Statistical significance was judged at the P<0.05\nlevel. When the analysis was statistically significant the LSDs of the means were used to\ncompare the latter.\n9Results\nIntracellular sugar and polyol accumulation in P. anomala cells grown in molasses media\nharvested in water and in isotonic solutions\nFigure 1a shows the comparison of unmodified and modification of aw of molasses medium\nby addition of proline imposed water stress on P. anomala cells at 0.98 and 0.96 aw. This\nshows the change in accumulation\/synthesis of sugars and sugar alcohols. In the unmodified\nmolasses media, trehalose was found to be the predominant intracellular compatible solute\nfollowed by arabitol. In the proline\/0.98 aw treatment, a significantly increased (P=0.05)\nintracellular accumulation of both trehalose and arabitol was found when compared with the\nunmodified treatment (0.996 aw). Cells from the proline 0.96 aw treatment accumulated high\namounts of glycerol, trehalose and arabitol. Figure 1b shows that when harvesting the yeast\ncells in isotonic solutions of NaCl then the amounts of the desiccant protectant trehalose, and\nkey compatible solutes such as glycerol and arabitol were significantly (P=0.05) increased,\noften to twice the amounts accumulated when water was used to harvest the yeast cells. One\nof the best treatments (0.98 aw) with the highest accumulated endogenous reserves was used\nfor fluidised bed drying experiments to identify the best temperature and time required for\noptimising conservation of viability.\nFluidised bed drying of P. anomala cells with use of several additives and isotonic solutions\nFigure 2a shows the effect of temperature and time of fluidised bed drying on the fresh P.\nanomala yeast cells from the optimised proline (0.98 aw) treatment. This shows that viability\nof the cells decreased significantly at 70-80oC in both 10 and 20 mins fluidised bed drying\nregimes. The effect of these fluidised bed drying treatments on the actual moisture content of\nthe yeast cells at the different temperatures showed that 40-80oC and 20 mins gave the lowest\n10\nmoisture content levels. Based on these studies it was decided to use 50oC and 20 mins as the\nstandard fluidised bed treatment as it gave good viability and a moisture content of <10%.\nFigure 3 shows the effect of the addition of additives to the optimised proline (0.98 aw)\ntreatment used as carriers (100% or 1:1 w\/w) including corn meal (CM), cottonseed flour\n(CSF), and wheat starch (WS) alone or with adjuvants (10% skimmed milk for CSF and WS\nand glycerol for CM) on P. anomala cell viability after drying for 20 mins. Viability of P.\nanomala formulation treatments significantly differed from the control treatment\n(unformulated cells). Of all the treatments evaluated, CSF:1+10%SM (w\/w, additives\/fresh\ncells) resulted in significantly (P=0.05) increased final cell viability. Addition of several\nadjuvants to carriers resulted in increased or similar cell viability. The final cell moisture\ncontent of the CSF:1+10%SM treatment was 4.3% (data not shown). Washing yeast cells with\na NaCl isotonic solution (osmoprotection) prior to drying resulted in retention of the highest\nintracellular accumulation of endogenous solutes.\nControl of P. verrucosum and Ochratoxin A production in moist grain\nThe effect of P. anomala on P. verrucosum population growth on wheat grain (0.93 aw water\nactivity) at 25oC over 30 days is shown on Figure 4a. The changes in populations of P.\nverrucosum over the 30 day period showed that there were significant (P<0.05) interactions\nbetween different treatments used; wheat grain, aw and time. The main treatments and\ninteraction between two factors were also statistically significant. P. verrucosum alone\nreached 4.5 x 106 CFUs g-1 at 0.93 aw after 30 days starting from 1 x 103 CFUs g-1 one day\nafter inoculation. When co-cultured with P. anomala, it reached a level of 3.2-3.75 x 105\nCFUs g-1 with no statistical differences between the different treatments. However, there were\nstatistical differences between treatments after 10 days. Figure 4b shows the increase in\n11\npopulations of P. anomala cells over the same 30 day storage period. There was an increase in\npopulations over time with all treatments reaching log108 CFUs g-1 grain.\nFigure 5 shows the impact of these treatments on OTA accumulation. There was a three-way\nsignificant (P<0.05) interaction between the different treatments used; wheat grain, aw and\ntime. One and two-way interactions were also significant. OTA contamination significantly\nincreased after 30 days in all treatments. When P. verrucosum was present alone, OTA\naccumulated after 30 days reaching 28700 µg kg-1. Co-culture with P. anomala resulted in a\nsignificant decrease in OTA contamination of the grain with treatments A, B and D.\nDiscussion\nThis study was carried out to examine the production of physiologically characterised P.\nanomala cells, the use of isotonic solutions for optimised harvesting, the best temperature and\ntime for fluidised bed drying of the best cell treatments and the formulated yeasts with\nadditives and carriers for controlling spoilage and OTA production in moist grain.\nThis has demonstrated that although P. anomala is an osmotolerant yeast it is possible to\nphysiologically stress the cells to enhance the endogenous accumulation of useful compatible\nsolute accumulation when grown in a molasses medium, which is cheap and readily available.\nThis was particularly demonstrated when proline was used to modify the aw level of the\nmedium to 0.98 aw. The significant increase in trehalose under the water stress treatments was\nan important result as this is a key compound which can be beneficial during subsequent\ndrying and formulation. Since trehalose is a very expensive compound to add exogenously,\nthe natural biosynthesis shown here is very beneficial for subsequent processing.\n12\nThe increase in synthesis of the disaccharide trehalose is important as it acts as a membrane-\nprotecting agent for yeast cells during environmental stress conditions such as heat treatment,\ndehydration and freezing (Zayed & Roos, 2004). Synthesis and accumulation of trehalose by\nyeast cells correlates with increased survival following dehydration or freezing (Beker &\nRapoport, 1987). The proposed mechanism of desiccation protection by trehalose is known as\nthe “water replacement hypothesis”, whereby trehalose replace water molecules in the\nmembranes and form hydrogen bonds with the phospholipids, thus preventing collapse of the\nmembrane upon water removal (Crowe et al., 1987).\nThe use of isotonic solutions is a very interesting finding. In most cases biocontrol agents are\nharvested in water regardless of the liquid or solid medium used for production. The present\nstudy has shown how important the harvesting process can be where the aim is optimisation\nof BCA inoculum quality and viability. This confirms previous studies with the\nentomopathogen Metarhizium anisopliae where isotonic solutions significantly enhanced\nretention of sugar alcohols such as erythritol and mannitol. This resulted in increased\ngermination of blastospores, even under water stress conditions (0.96 aw; Ypsilos and Magan,\n2004). Isotonic harvesting was also found to be an effective treatment for the biocontrol yeast\nCandida sake for control of post-harvest fungal pathogens of pome fruits (Abadias et al.,\n2003).\nFluidised bed drying has been successfully used for the production of formulations of C. sake\nand Epicoccum nigrum (Abadias et al., 2003; Larena et al., 2003). Indeed with E. nigrum, it\nwas found that fluidised bed drying gave 100% viability of spores for up to 90 days. In\ncontrast, freeze drying required the use of additives. In contrast, spray drying resulted in only\n10% viability. Recent work with P. anomala compared vacuum, fluidised bed, freeze and\n13\nliquid formulations and effects on storage viability over periods of 1 year (Melin et al., 2007).\nThis study suggested that freeze dried cells could be stored at up to 30oC for 1 year with\nminimal loss of viability while other techniques required <10oC to conserve viability. They\nused exogenous trehalose to enhance viability during formulation. The present study\nconcentrated on the use of stress physiology as a method of enhancing endogenous synthesis\nof trehalose and other beneficial sugar alcohols. Our study also suggests that the provision of\nadditives during fluidised bed drying is important to maximise final formulations. Studies of\nour best treatments suggest that viability under ambient conditions can be conserved for up to\n6 months (unpublished data). We believe that maintaining a final moisture content of <10% of\nthe formulated product is critical to conserving viability. The key criterion is the ability of the\nformulated product to give efficacy similar to or better than that provided by freshly harvested\ncells.\nIn the present study P. anomala cells reduced populations of P. verrucosum, based on CFU\ncounts, although after 30 days there were no significant differences between treatments during\nco-culture in wheat. However, some differences were observed after 10 days probably due to\nbetter yeast colonisation and growth on wheat during the early stages in the storage\nexperiments. A decrease in mould populations coincided with a decrease in OTA production.\nOsmoprotected fluidised bed dried cells reduced OTA production. The isotonic solution itself\nhad an influence on OTA production but had no differential influence on fungal populations.\nThis study has also shown that formulation additives had no adverse effect on mould growth\nand OTA production. Our studies did not involve storage under airtight or microaerophilic\nenvironmental conditions where this yeast has been previously shown to be very effective\nagainst the spoilage fungus P. roqueforti (Björnberg and Schnürer, 1993; Druverfors et al.,\n14\n2002). However, the laboratory storage experiments suggests that even under normal oxygen\nconditions the yeast formulations are able to provide control of OTA production.\nFor effective use in controlling the growth and mycotoxin production by spoilage fungi it is\nessential that potential BCAs can tolerate a wide range of environmental factors, particularly\nintermediate moisture conditions. The approach presented here can be used to develop\necologically competent BCA candidates such that the potential for success fan be improved.\nThis could provide opportunities for wider implemention of such approaches for minimising\nmycotoxin contamination of food and feed by utlilizing this ecophysiological strategy.\nACKNOWLEDGEMENTS\nWe are very grateful to Prof. J. Schnürer for the P. anomala J121 strain. Stella Mokiou is also\ngrateful to the Konstantinos Lazaridis and Alexander Onassis foundations for support.\nREFERENCES\nAbadias M, Usall J, Teixido N, Vinas I. 2003. Liquid formulation of postharvest biocontrol\nagent Candida sake CPA-1 in isotonic solutions. Phytopathology 93: 436–442.\nAndersen M, Magan N, Mead A, Chandler D. 2006. Development of a population\nbased threshold model of conidial germination for analysing the effects of\nphysiological manipulation on the stress tolerance and infectivity of insect pathogenic\nfungi. Environmental Microbiology 8:1625-1634.\nBayrock D, Ingledew WM. 1997. Mechanism of viability loss during fluidised bed\ndrying of baker’s yeast. Food Research International 30:417-425.\nBeker MJ, Rapoport AI. 1987. Conservation of yeasts by dehydration. Advances in\nBiochemichal Engineering and Biotechnology 35:127-171.\n15\nBjörnberg A, Schnürer J. 1993. Inhibition of the growth of grain-storage moulds in vitro by\nthe yeast Pichia anomala (Hansen) Kurtzman. Canadian Journal of Microbiology 39:\n623-628.\nCairns-Fuller V, Aldred D, Magan N. 2005. Water, temperature and gas composition\ninteractions affect growth and ochratoxin A production by isolates of Penicillium\nverrucosum on wheat grain. Journal of Applied Microbiology 99:1215-1221.\nCrowe JH, Crowe LM, Carpenter JF, Winstrom CA. 1987. Stabilization of dry\nphospholipids bilayers and proteins by sugar. Biochemical Journal 242: 1-10.\nDruverfors U, Jonsson N, Boysen ME, Schnürer J. 2002. Efficacy of the biocontrol yeast\nPichia anolmala during long term storage of moist feed grain under different oxygen\nand carbon dioxide regimens. FEMS Yeast Research 2: 389-394.\nGuijarro B, Larena I, Melgarejo P, De Cal A. 2006. Effect of drying on conidial viability of\nPenicillium frequentans, a biological control agent against peach brown rot disease\ncaused by Monilinia spp.1. Biocontrol Science and Technology 16: 257-269.\nHallsworth JE, Magan N. 1995. Manipulation of intracellular glycerol and erythritol\nenhances germination of conidia at low water availability. Microbiology 141: 1109-\n1115.\nHutcheson TC, McKay T, Farr L, Seddon B. 1988. Evaluation of the stain viablue for the\nrapid estimation of viable yeast cells. Letters in Applied Microbiology 6: 85-88.\nJanisiewicz WJ, Jeffers, SN. 1997. Efficacy of commercial formulation of two\nbiofungicides for control of blue mold and gray mold of apples in cold storage. Crop\nProtection 16: 629-633.\nLarena I, De Cal A, Linan M, Melgarejo P. 2003. Drying of Epicoccum nigrum conidia for\nobtaining a shelf-life stable biological product against brown rot disease. Journal of\nApplied Microbiology 94: 508-514.\n16\nMagan, N. (2001). Physiological approaches to improving ecological fitness of biocontrol\nagents. Chapter 9 in Fungal Biocontrol Agents: Progress, Problems and Potential, eds.\nT.Butt, C.Jackson & N.Magan. Cabi BioSciences. Pp.239-252.\nMagan N. 2006. Ecophysiology of biocontrol agents for improved competence in the\nphyllosphere. In Microbial Ecology of Aerial Plant Surfaces, eds. M.J. Bailey, A.K.\nLilley, T.M. Timms-Wilson and P.T.N. Spencer-Phillips. CABI International,\nWallingford, U.K., pp. 150-164.\nMagan N, Olsen M. 2004. Mycotoxins in food: detection and control. Woodhead, Oxford.\nU.K.\nMokiou S, Magan N. 2002. Ecophysiological manipulation of the fermentation process\nimproves viability of the biocontrol yeast Pichia anomala. Biocontrol of Fungal and\nBacterial Plant Pathogens, IOBC wprs Bulletin 25: 395-398.\nMelin P, Hakansson S, Eberhard TH, Schnurer J. 2006. Survival of the biocontrol\nyeast Pichia anolmala after long term storage in liquid formulations and different\ntemperatures, assessed by flow cytometry. Journal of Applied Microbiology 100:\n264-271.\nMelin P, Hakansson S, Schnürer J. 2007. Optimisation and comparison of liquid and dry\nformulations of the biocontrol yeast Pichia anomala J121. Applied Microbiology and\nBiotechnology 73: 1008-1016.\nTeixido, N, Vinas I, Usall J, Magan N. 1998. Control of blue mould of apples by preharvest\napplication of Candida sake grown on media with modified water activity.\nPhytopathology 88: 960-964.\nYpsilos IK, Magan N. 2004. The effect of water activity, modifying solute and culture\nage on Metarhizium anisopliae blastospore production, quality and germinability.\nMycological Research 108: 1337-1345.\n17\nZayed G, Roos YH. 2004. Influence of trehalose and moisture content on survival of\nLactobacillus salivarius subjected to freeze-drying and storage. Proceedings of\nBiochemistry 39: 1081–1086.\n18\nFigure 1. Comparison of endogenous sugar alcohols and sugar reserves in Pichia anomola\ncells after growth on an unmodified molasses-based medium and that modified with proline to\n0.98 and 0.96 aw at 25oC for 48 hrs. (a) cells harvested in water and (b) cells harvested with\nisotonic NaCl solutions. Bars indicate standard error of the means.\n19\nFigure 2. Effect of temperature and time on (a) cell viability and (b) moisture content of\nPichia anomola cells dried in the fluidised bed dryer. Cells were grown on a molasses-based\nmedium modified to 0.98 aw with proline at 25oC for 48 hrs. Bars indicate standard error of\nthe means.\n20\nFigure 3. Effect of different additives used as carriers (100% or 1:1 w\/w) such as corn meal\n(CM), cottonseed flour (CSF), and wheat starch (WS) alone or with adjuvants (10% skimmed\nmilk for CSF and WS and glycerol for CM) on P. anomala cell viability after drying at 50oC\nfor 20 mins using a fluidized bed-dryer. Control is untreated P.anomala cells. Different letters\nindicate statistical differences (P<0.05) between means.\n21\nFigure 4. Temporal changes in populations of (a) P. verrucosum and (b) P. anomala in stored\nwheat grain treatments over a 30 day period. Different letters indicate significant differences\n(P=0.05). Treatments were: P. verrucosum alone (Pv, control) or P. anomala (Pa, control)\nunmodified fresh cells alone; (A), P. anomala fresh cells grown on modified proline medium\nwashed with NaCl isotonic solution; (B), P. anomala unmodified cells dried as cottonseed\nflour: 1 + 10% skimmed milk formulation; (C), P. anomala proline modified cells dried as\ncottonseed flour:1+10% skimmed milk formulation washed with water; (D), P. anomala\nproline modified cells dried as cottonseed flour: 1 + 10% skimmed milk formulation washed\nwith NaCl isotonic solution. A, B, C, D treatments were co-cultures with P. verrucosum.\nDifferent letters indicate statistical (P<0.05) differences between means.\n22\nFigure 5. Effect of different treatments on ochratoxin A (OTA; μg kg-1) in co-cultures on\nwheat grain [0.93 aw] at 25oC for up to 30 days. Different treatments were P. verrucosum\nalone (control), P. anomala unmodified fresh cells alone; (A), P. anomala proline modified\nfresh cells washed with NaCl isotonic solution; (B), P. anomala unmodified cells dried as\ncottonseed flour: 1 + 10% skimmed milk formulation; (C), P. anomala proline modified cells\ndried as cottonseed flour:1+10% skimmed milk formulation washed with water; (D), P.\nanomala proline modified cells dried as cottonseed flour: 1 + 10% skimmed milk formulation\nwashed with NaCl isotonic solution. A, B, C, D treatments were co-cultures with P.\nverrucosum. Different letters indicate statistical (P=0.05) differences between means.\n"}