{"doi":"10.1111\/j.1474-919X.2007.00691.x","coreId":"63928","oai":"oai:nora.nerc.ac.uk:1351","identifiers":["oai:nora.nerc.ac.uk:1351","10.1111\/j.1474-919X.2007.00691.x"],"title":"Habitat selection by Marsh Tits Poecile palutris in the UK","authors":["Hinsley, Shelley A.","Carpenter, Jane E.","Broughton, Richard K.","Bellamy, Paul E.","Rothery, Peter","Amar, Arjun","Hewson, Chris M.","Gosler, Andrew G"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"The Marsh Tit Poecile palustris is a small, hole-nesting woodland passerine whose national population in the UK has declined by more than 50% in the last 25 years. To investigate possible causes for the species long-term decline, we examined habitat selection by Marsh Tits at three scales. For individual foraging birds, winter time budgets and foraging behaviour, recorded using instantaneous sampling, differed little between Marsh and Blue Tits Cyanistes caeruleus, but Marsh Tits spent more time in the understorey and more time lower down in both the woodland canopy and the understorey. At the scale of breeding territories, the characteristics (numbers by size class, vegetation density, species richness) of trees and shrubs were compared using 100 × 10-m sample transects of ten territories in each of four woods. The characteristics of the trees differed significantly between woods whilst those of the shrubs did not, suggesting that the characteristics of shrubs were more important in territory selection by Marsh Tits than were those of trees. Furthermore, in one of the four woods (Wytham Woods, Oxfordshire), Marsh Tits were largely absent from areas with dense tree canopy, but poor shrub cover. On a national scale, using data from 157 of the woodlands surveyed by the RSPB\/BTO Repeat Woodland Bird Survey, Marsh Tit abundance in 2003\/04 was found to be positively related to vegetation cover at heights corresponding to the shrub layer, especially at 2–4 m. These relationships were not apparent in data for the same woods for the 1980s, but shrub cover had increased substantially by 2003\/04 and Marsh Tit abundance had increased in woods with the most cover in 2003\/04. Thus, factors damaging the shrub layer, such as overgrazing by deer, shading out by canopy closure and managed clearance of shrub cover, may reduce the suitability of woodland for Marsh Tits. Habitat use by a closely related species, Willow Tit Poecile montanus, is also discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/63928.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/1351\/2\/001351HinsleyIbis_MT07_accepted.pdf","pdfHashValue":"b661a2a4551ec0b7adb2512393155de820384d2d","publisher":"Blackwell","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:1351<\/identifier><datestamp>\n      2016-11-24T13:23:05Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533236<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/1351\/<\/dc:relation><dc:title>\n        Habitat selection by Marsh Tits Poecile palutris in the UK<\/dc:title><dc:creator>\n        Hinsley, Shelley A.<\/dc:creator><dc:creator>\n        Carpenter, Jane E.<\/dc:creator><dc:creator>\n        Broughton, Richard K.<\/dc:creator><dc:creator>\n        Bellamy, Paul E.<\/dc:creator><dc:creator>\n        Rothery, Peter<\/dc:creator><dc:creator>\n        Amar, Arjun<\/dc:creator><dc:creator>\n        Hewson, Chris M.<\/dc:creator><dc:creator>\n        Gosler, Andrew G<\/dc:creator><dc:subject>\n        Zoology<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        The Marsh Tit Poecile palustris is a small, hole-nesting woodland passerine whose national population in the UK has declined by more than 50% in the last 25 years. To investigate possible causes for the species long-term decline, we examined habitat selection by Marsh Tits at three scales. For individual foraging birds, winter time budgets and foraging behaviour, recorded using instantaneous sampling, differed little between Marsh and Blue Tits Cyanistes caeruleus, but Marsh Tits spent more time in the understorey and more time lower down in both the woodland canopy and the understorey. At the scale of breeding territories, the characteristics (numbers by size class, vegetation density, species richness) of trees and shrubs were compared using 100 × 10-m sample transects of ten territories in each of four woods. The characteristics of the trees differed significantly between woods whilst those of the shrubs did not, suggesting that the characteristics of shrubs were more important in territory selection by Marsh Tits than were those of trees. Furthermore, in one of the four woods (Wytham Woods, Oxfordshire), Marsh Tits were largely absent from areas with dense tree canopy, but poor shrub cover. On a national scale, using data from 157 of the woodlands surveyed by the RSPB\/BTO Repeat Woodland Bird Survey, Marsh Tit abundance in 2003\/04 was found to be positively related to vegetation cover at heights corresponding to the shrub layer, especially at 2–4 m. These relationships were not apparent in data for the same woods for the 1980s, but shrub cover had increased substantially by 2003\/04 and Marsh Tit abundance had increased in woods with the most cover in 2003\/04. Thus, factors damaging the shrub layer, such as overgrazing by deer, shading out by canopy closure and managed clearance of shrub cover, may reduce the suitability of woodland for Marsh Tits. Habitat use by a closely related species, Willow Tit Poecile montanus, is also discussed.<\/dc:description><dc:publisher>\n        Blackwell<\/dc:publisher><dc:date>\n        2007<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/1351\/2\/001351HinsleyIbis_MT07_accepted.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Hinsley, Shelley A.; Carpenter, Jane E.; Broughton, Richard K.; Bellamy, Paul E.; Rothery, Peter; Amar, Arjun; Hewson, Chris M.; Gosler, Andrew G.  2007  Habitat selection by Marsh Tits Poecile palutris in the UK.   Ibis, 149 (Supple). 224-233.  https:\/\/doi.org\/10.1111\/j.1474-919X.2007.00691.x <https:\/\/doi.org\/10.1111\/j.1474-919X.2007.00691.x>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.blackwell-synergy.com\/doi\/abs\/10.1111\/j.1474-919X.2007.00691.x<\/dc:relation><dc:relation>\n        doi:10.1111\/j.1474-919X.2007.00691.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/1351\/","http:\/\/www.blackwell-synergy.com\/doi\/abs\/10.1111\/j.1474-919X.2007.00691.x","doi:10.1111\/j.1474-919X.2007.00691.x"],"year":2007,"topics":["Zoology","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \n \n \n \n \nWOODLAND BIRDS PROCEEDINGS\nHabitat selection by Marsh Tits Poecile palustris in the UK \n \n \nSHELLEY A. HINSLEY,*1 JANE E. CARPENTER,1,2 RICHARD K. BROUGHTON,1 PAUL E. \nBELLAMY,1 PETER ROTHERY,1 ARJUN AMAR,†3 CHRIS M. HEWSON4 & ANDREW G. \nGOSLER2 \n \n \n1Centre for Ecology and Hydrology, Monks Wood, Abbots Ripton, Huntingdon, Cambridgeshire \nPE28 2LS, UK \n2Edward Grey Institute of Field Ornithology, Department of Zoology, South Parks Road, University \nof Oxford, Oxford OX1 3PS, UK \n3Royal Society for the Protection of Birds, The Lodge, Sandy, Bedfordshire SG19 2DL, UK \n4British Trust for Ornithology, The Nunnery, Thetford, Norfolk IP24 2 PU \n \n \n \n \n \n \n \nRunning head: Habitat selection by Marsh Tits \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n*Corresponding author. \nE-mail: sahi@ceh.ac.uk \n \n†Current address: RSPB Scotland, Dunedin House, \n25 Ravelston Terrace, Edinburgh, EH4 3TP, UK.\n \n \nThe Marsh Tit Poecile palustris is a small, hole-nesting woodland passerine whose national \npopulation in the UK has declined by more than 50% in the last 25 years. To investigate possible \ncauses for the species long-term decline, we examined habitat selection by Marsh Tits at three \nscales. For individual foraging birds, winter time budgets and foraging behaviour, recorded using \ninstantaneous sampling, differed little between Marsh and Blue Tits Cyanistes caeruleus, but Marsh \nTits spent more time in the understorey and more time lower down in both the woodland canopy \nand understorey. At the scale of breeding territories, the characteristics (numbers by size class, \nvegetation density, species richness) of trees and shrubs were compared using 100 x 10 m sample \ntransects of ten territories in each of four woods. The characteristics of the trees differed \nsignificantly between woods whilst those of the shrubs did not, suggesting that the characteristics of \nshrubs were more important in territory selection by Marsh Tits than were those of trees. \nFurthermore, in one of the four woods (Wytham Woods, Oxfordshire), Marsh Tits were largely \nabsent from areas with dense tree canopy, but poor shrub cover. On a national scale, using data \nfrom 157 of the woodlands surveyed by the RSPB\/BTO Repeat Woodland Bird Survey, Marsh Tit \nabundance in 2003\/04 was found to be positively related to vegetation cover at heights \ncorresponding to the shrub layer, especially at 2-4 m. These relationships were not apparent in data \nfor the same woods for the 1980s, but shrub cover had increased substantially by 2003\/04 and \nMarsh Tit abundance had increased in woods with the most cover in 2003\/04. Thus factors \ndamaging the shrub layer, such as over-grazing by deer, shading out by canopy closure and \nmanaged clearance of shrub cover, may reduce the suitability of woodland for Marsh Tits. Habitat \nuse by a closely related species, Willow Tit Poecile montanus, is also discussed.   \n \nThe Marsh Tit Poecile palustris is a small (body mass c. 10 g), hole nesting parid largely confined \nto mature deciduous woodland (Perrins 1979, Cramp & Perrins 1993). In the UK, unlike the more \nfamiliar and widespread Great Tit Parus  major and Blue Tit Cyanistes  caeruleus, it does not breed \nin secondary habitats such as gardens and hedgerows. Pairs are sedentary and maintain large, year-\nround territories, probably as a consequence of their habit of storing food. When breeding, mean \nterritory size is c. 4-5.5 ha (Broughton et al. 2006); winter ranges are larger, but based on the \nlocation of the breeding territory (Broughton, unpubl. data). Marsh Tits in the UK have undergone a \npopulation decline of more than 50% in the last 30 years and were added to the Red List of Birds of \nConservation Concern in 2002 (Gregory et al. 2002 & 2003). More recently this trend has changed \nto show an increase of 33% from 1994-2005 (Eaton et al. 2006). Reasons for the decline are \nunknown, but may include changes in woodland structure, increased woodland fragmentation and \nisolation, changes in predator pressure and increased competition from other parids, especially Blue \nTits, whose populations have increased (Perrins 2003, Siriwardena 2006). Factors affecting the \nstructure of woodland include deer grazing\/browsing, changes in management and natural processes \nassociated with maturation and canopy closure (Fuller 2001, Fuller et al. 2005). \nThe ecology and behaviour of British Marsh Tits Poecile palustris dresseri, were reported in a \nnumber of largely descriptive studies in the late 1940s and the 1950s (e.g. Southern & Morley 1950, \nHinde 1952, Morley 1953, Gibb 1954, Snow 1954), but there has been little work on the species in \nthe UK over the last 50 years. This is probably due, at least in part, to the species reluctance to use \nnest boxes, its naturally low population density compared to Great and Blue Tits and its \nconfinement to mature woodland. Several of these early studies (Colquhoun & Morley 1943, \nHartley 1953, Gibb 1954, Betts 1955, Bevan 1959) noted that Marsh Tits tended to forage in the \nmid-layers of woodland, i.e. the shrub layer and the lower parts of trees, and also on the seeds of \nherbaceous plants. Although the earlier work identified the foraging niche of the British Marsh Tit \nas intermediate in height between that of the Blue Tit (in the top canopy) and the Great Tit (lower \ndown and on the ground) (Lack, 1971), much has changed in British woodland, in terms of both \nhabitat characteristics (Smith & Gilbert 2001) and bird populations (Fuller 1995, Mead 2000, Fuller \net al. 2005), since the 1950s. Given this, and the long-term decline in the UK national Marsh Tit \npopulation, it is timely to re-examine the species habitat requirements and how this relates to habitat \nuse by other tits. In this paper, we present evidence for the importance of the shrub layer for Marsh \nTits at three spatial scales: (i) at the level of the individual foraging bird, (ii) on the scale of whole \nterritories in several different woods, and (iii) across woodland at a national scale. \n \nMETHODS \nIndividual foraging behaviour \nThe foraging behaviour and locations of Marsh Tits and Blue Tits were recorded in Monks Wood in \nthe winter of 2004\/05 as part of a larger study of the comparative foraging behaviour of these two \nspecies (Carpenter et al. unpubl. data). Monks Wood comprises 157 ha of mixed deciduous \nwoodland in Cambridgeshire in eastern England (52º 24´ N, 0º 14´ W). The main tree species in \norder of abundance are Common Ash Fraxinus excelsior, English Oak Quercus robur and Field \nMaple Acer campestre, and the main shrub species are hawthorn Crataegus spp., Common Hazel \nCorylus avellana, Blackthorn Prunus spinosa and Honeysuckle Lonicera periclymenum. For more \ndetails see Hinsley et al. (2002) and Gardiner and Sparks (2005).  \nBird locations and behaviour were recorded using an instantaneous sampling technique (e.g. \nAltmann 1974, Martin & Bateson 1993); the results are presented using the first observation only of \neach bird following detection. Location was recorded as either “canopy” or “understorey” and then \nvertical location and behaviour were assigned as follows: \nVertical location: i) top third, ii) middle third, iii) lower third, iv) ground.  \nBehaviour: i) foraging, ii) vigilance, iii) flight, iv) maintenance (e.g. preening, scratching), v) \ncommunication (e.g. calling, singing). \nFor foraging birds, the following activities were recorded: i) gleaning (rapid, repeated pecking) \nfrom trunks\/branches\/twigs, ii) gleaning from leaves, iii) searching without pecking, iv) foraging \nwhilst hanging upside down, v) handling\/eating food, vi) caching food. \nDifferences between the foraging locations and foraging behaviour of the two species were \ninvestigated using chi-square tests (untransformed data).  \n \nTerritory characteristics across woods \nThe habitat structure of Marsh Tit breeding territories was investigated in five woods, Wytham \nWoods in Oxfordshire (51º 46’N, 01º 20’W), Monks Wood in Cambridgeshire, Swanton Novers in \nNorfolk (52º 51’, 0º 59’E), Roudsea Wood in Cumbria (54º 14’N, 03º 02’W) and Treswell Wood in \nNottinghamshire (53º 18’N, 0º51’W). These five woods were selected because their Marsh Tit \npopulations were already colour-ringed or because colour-ringing of Marsh Tits could be \nincorporated into existing studies of other species or bird communities. Thus the locations of Marsh \nTit breeding territories were determined during February to June using observations of individually \ncolour-ringed birds (Broughton et al. 2006). Insufficient observations were obtained to define \naccurately territory boundaries, but the core area of each pair’s breeding activity was identified.  \nFor ten territories in each wood (except Treswell Wood where there were only three Marsh \nTit territories in 2005), a 100 x 10 m transect was positioned in the centre of the core area. All the \ntrees and shrubs within this transect were counted, separately for each species, using three size \ncategories (referred to as small, medium and large) defined by diameter at breast height (dbh) for \ntrees and by height for shrubs as follows: \nTrees: i) small: dbh < 10 cm, ii) medium: dbh 10-30 cm, iii) large: dbh > 30 cm. \nShrubs: i) small: height < 2 m, ii) medium: height 2-4 m, iii) large: height > 4 m. \nIn addition, tree canopy density and shrub layer density were estimated using three 25 m radius \nsample circles located along each transect with their centres at 0, 50 and 100 m. Thus the edges of \nthe circles touched, but did not overlap. For the tree canopy and the shrub layer separately, and for \neach circle separately, the proportion of the circle attributable to each of five density scores was \nestimated. The five scores were 0, 1, 2, 3, and 4 where 0 was no tree canopy or shrub cover and 4 \nwas dense, continuous cover (Hinsley et al. 1995, Hinsley et al. 2002). To obtain a single density \nindex for each of the tree canopy and the shrub layer in each circle, the scores were multiplied by \ntheir proportions and the results summed. Thus for shrubs or trees in a sample circle with the \nfollowing hypothetical scores and proportions: 0 = 0.10, 1 = 0.20, 2 = 0.00, 3 = 0.55, 4 = 0.15, the \noverall shrub or tree density index would be: 0 + 0.20 + 0 + 1.65 + 0.60 = 2.45. Other data \nconcerning standing and fallen dead wood and species composition and percentage cover of the \nfield layer were collected, but are not reported here.  \nDue to the small sample size for Treswell Wood (three territories) compared to the other four \nsites (ten territories each), it was omitted from the final analysis, but preliminary investigation \nindicated that including Treswell did not alter the conclusions of the analysis. \nIf the shrub layer within woodland constitutes the prime habitat of Marsh Tits, then we might \nexpect that shrub characteristics within territories would be more crucial, and hence more critically \nselected and less variable, than those of the trees. We have therefore examined the variability of the \nshrub and tree characteristics of territories both within and between woods. Numbers of small, \nmedium, large and large + medium trees and shrubs (the category of large + medium being used to \nrepresent the total amount of tree\/shrub likely to be important for Marsh Tits) and tree and shrub \ndensity indices and species richness were compared across woods using one-way analysis of \nvariance (ANOVA). Variation between woods (VB) in the characteristics of the trees and shrubs, \nrelative to the variation between territories within woods (VW), was measured using the intraclass \ncorrelation, i.e. rI = VB\/(VB + VW), expressed as a percentage (Sokal & Rohlf 1981). This coefficient \nmeasures the similarity between individuals (i.e. territories) within groups (i.e. woods), relative to \nthe similarity between groups. A value of 100% would indicate that all the variance in the data was \nbetween woods, and hence that variance between territories within woods was zero.  \nIdeally, we would have liked to compare habitat characteristics within Marsh Tit territories \nwith those in parts of the woods not used by Marsh Tits. However, Marsh Tits may be absent from \nhabitat for reasons unrelated to suitability. For example, territories may remain vacant, or be \nvacated by single or widowed birds, if there are insufficient individuals to occupy all suitable space, \nand reoccupation of suitable habitat may be delayed by isolation effects. Despite these difficulties, \nsome areas of Wytham Woods were thought by the resident research team to be generally devoid of \nMarsh Tits and therefore data were collected for six additional transects in these areas, separating \ntransects by distances similar to those between territories. Territory and unoccupied area transects \nwere compared using two-sample t-tests.  \n \nHabitat characteristics at a national scale \nThe Royal Society for the Protection of Birds (RSPB) and the British Trust for Ornithology (BTO) \nRepeat Woodland Bird Survey (RWBS) investigated trends in the breeding bird populations of \nBritish broadleaved and mixed woodland (Amar et al. 2006). Changes in bird populations since the \n1980s (and for some sites since the 1960s and 1970s) were determined by repeat surveys in 2003 \nand 2004 and possible reasons for changes in bird abundance were investigated using a range of \nhabitat and landscape data. A total of 406 sites were resurveyed. Of these, 153 had originally been \nsurveyed by the BTO using territory mapping methods and 253 by the RSPB using point counts. \nWhen resurveyed, the same methodology as in the original survey was used for each site i.e. \nterritory mapping for BTO sites and point counts for RSPB sites. Full details are given in Amar et \nal. (2006).  \nThe RWBS collected a large number of habitat variables, and some data were also available \nfrom the earlier surveys. To avoid a general “data mining” approach, and to investigate the \nhypothesis that the shrub layer within woodland is an important component of Marsh Tit habitat, \nhabitat variables thought to most strongly represent the shrub layer were selected a priori. In \naddition, to examine the importance of shrubs versus trees, a variable describing tree canopy cover \nwas also selected. Thus the following five variables were used, i) percentage vegetation cover at \n0.5-2 m, ii) percentage vegetation cover at 2-4 m, iii) percentage vegetation cover at 4-10 m, iv) \nhorizontal visibility, and v) percentage tree canopy cover. All these variables were collected for \nmost sites resurveyed in 2003\/04, but habitat data from the original surveys in the 1980s were only \navailable for RSPB sites. The analysis used the 157 RSPB and 60 BTO sites at which Marsh Tits \nwere recorded in either, or both, of the 1980s and 2003\/04 surveys.  \nEach RSPB site was visited twice and five minute counts were made at a number of randomly \nselected points – usually 10 in each site, but occasionally more. For each site, Marsh Tit abundance \nwas expressed as the mean of the maximum count for each point. BTO sites were recorded using \nterritory mapping using data from a total of four visits in both the 1980s and 2003\/04. Marsh Tit \nabundance was expressed as the number of territories per hectare. Habitat variables were averaged \nacross measurements made in a 25 m radius circle centred on each point count location (RSPB \nsites), or across 10 points randomly distributed across the mapped area (BTO sites). Tree canopy \ncover was measured as percentage cover using a sighting frame focussing only on vegetation cover \nabove 10 m. Measurements were averaged across four 5 m radius plots evenly spaced within the 25 \nm circles. Percentage vegetation cover in each of the three height bands was assessed for the whole \nof each 25 m circle. Horizontal visibility was estimated using the mean number of 10 cm sections of \na 2.4 m pole placed at the centre of each 25 m radius circle which were at least 50% visible when \nviewed from four points, one in each cardinal direction (i.e. N, S, E and W), located 12.5 m from \nthe centre of the 25 m circle. Essentially, the same habitat measurements were made at both RSPB \nand BTO sites in 2003\/04. Full details are given in Amar et al. (2006). \nScatterplots with lowess lines to indicate trends were used initially to examine the relationships \nbetween Marsh Tit abundance and each of the vegetation variables in both survey periods for the \nRSPB sites and in 2003\/04 for the BTO sites. The relationships were then tested and compared \nbetween survey periods after allowing for the effect of regional locality on Marsh Tit abundance \n(Amar et al. 2006). The statistical analysis used a general linear model (Minitab Release 13) with \nregion (South Wales, Wales, West Midlands, East Midlands, South East and East) and survey \nperiod (1980s & 2003\/4) as factors and vegetation cover as a covariate, and included a vegetation \nby survey period interaction effect. \n \nRESULTS \nIndividual foraging behaviour \nBoth Marsh Tits and Blue Tits spent most of their time either foraging or being vigilant, 86% and \n84% of records respectively being attributable to these two activities (Table 1). There were no \nsignificant differences between the two species in their overall time budgets. Foraging behaviour \nwas also similar, the only significant difference being that Blue Tits spent more time feeding whilst \nhanging upside down than did Marsh Tits (χ21 = 7.38, P = 0.007) (Table 1). Marsh Tits spent more \ntime handling\/eating food items, which were usually seeds, but the difference was not quite \nsignificant (χ21 = 3.24, P = 0.072). If average handling\/eating times were greater for seeds than for \ninvertebrates, as seems likely, then Marsh Tits may have been eating more seeds than Blue Tits, but \nthis was not tested. \nMarsh Tits spent more time foraging in the understorey (60% of observations, n = 119) than did \nBlue Tits (44% of observations, n = 128) (χ21 = 6.25, P = 0.012), and hence concomitantly less time \nin the tree canopy (40%), than did Blue Tits (56 %). When foraging in the canopy, Marsh Tits spent \nless time in the top third than did Blue Tits (Table 2), but the difference was not significant (χ21 = \n2.82, P = 0.093). When foraging in the understorey, Marsh Tits again spent less time in the top third \nthan did Blue Tits (Table 2) and this difference was significant (χ21 = 5.83, P = 0.016). Thus, \noverall, Marsh Tits spent more time foraging in the understorey and more time foraging lower down \nin shrubs than did Blue Tits.   \n \nTerritory characteristics across woods \nCharacteristics (numbers by size class, vegetation density and species richness) of the trees and \nshrubs in Marsh Tit territories in the five study woods are summarised in Table 3. Overall, with the \nmain exception of small trees and small shrubs, the characteristics of the trees varied significantly \nbetween woods whereas those of the shrubs did not (Table 3). Shrub species richness varied \nsignificantly, but the difference was less marked for shrubs (F3,36 = 3.04, P = 0.041) than for trees \n(F3,36 = 11.56, P < 0.001). Again with the exception of small trees and small shrubs, the intraclass \ncorrelation coefficients showed that the amount of variation in the characteristics of the trees due to \ndifferences between woods (as opposed to differences between transects within woods) was usually \naround 50%, whereas for shrubs the value was essentially zero or only a few percent. Thus the \ncharacteristics of the shrub layer within Marsh Tit territories were similar between woods, whereas \nthose of the trees varied substantially, implying more critical selection of shrubs than trees. The \ndifference in the results for small trees and shrubs is considered in the discussion. \nIn Wytham Woods, the main difference between areas occupied by Marsh Tits and those \napparently not used was a lack of shrub cover in the unoccupied areas (Fig. 1). Occupied areas had \nmore shrubs (t12  = 3.52, P = 0.004) and a larger shrub density index  (t12  = 5.93, P  = 0.004) than \ndid unoccupied areas, but the numbers of trees did not differ (t10  = -1.30, P  = 0.224). However, \nunoccupied areas had a larger tree canopy density index (t10  = -4.48, P  = 0.002), suggesting that \nthe lack of shrubs was at least in part due to a lack of light beneath the tree canopy.  \n \nHabitat characteristics at a national scale, using RWBS data \nFor the original survey in the 1980s, no relationships between Marsh Tit abundance and any of the \nfour vegetation variables (the fifth variable, horizontal visibility, was not available for the 1980s) \nwere apparent for the RSPB sites. However, in 2003\/04, after accounting for the effect of region, \nMarsh Tit abundance at RSPB sites increased with increasing cover in all three of the height bands, \nthe strongest relationship being with cover at 2-4 m (Fig. 2, Table 4). The relationships with cover \nat 0-2 m and 4-10 m are not shown because they were similar to that for 2-4 m (Fig. 2) with the \nregression lines crossing at c. 25% vegetation cover. Marsh Tit abundance was also significantly \nrelated to horizontal visibility, but in this case the relationship was negative, i.e. after accounting for \nthe effect of region, abundance increased with decreasing visibility (Fig. 3, Table 4) which was \nconsistent with the results for the height bands. There was no relationship with tree canopy cover. \nFor all three height bands, the differences in the slopes of the relationships between the original \n1980s survey and the resurvey in 2003\/04 were significant, and remained so after accounting for the \neffect of regional locality (Table 4). However, there were no differences between survey periods in \nthe vertical elevations of the lines. In 2003\/04, the evidence for an effect of vegetation cover on \nMarsh Tit abundance was strongest for a height of 2-4 m (P = 0.009, Table 4), and cover at this \nheight should correspond well with the location of the shrub layer. However, the individual \nrelationship between abundance and horizontal visibility was stronger (P = 0.002, Table 4), and in a \nmodel using both variables, horizontal visibility remained significant (F1,149 = 4.82, P = 0.03) after \naccounting for the effect of cover at 2-4 m, whereas the reverse was not true (cover at 2-4 m, after \nhorizontal visibility, F1,149 = 2.06, P = 0.15). In contrast to these results for the RSPB sites, for the \nBTO sites in 2003\/04, there were no relationships between Marsh Tit abundance and any of the five \nvegetation variables. \n \nDISCUSSION \nAt all three scales, from individual foraging behaviour to the nationally distributed RWBS \nwoodlands, the shrub layer was found to be important for Marsh Tits. Although the details of \nforaging behaviour were largely similar between Marsh and Blue Tits, foraging location differed \n(Tables 1 & 2). As found in earlier studies (Colquhoun & Morley 1943, Hartley 1953, Gibb 1954, \nBetts 1955, Bevan 1959), Marsh Tits spent more time foraging in the understorey. When examining \ntree and shrub parameters within territories, the similarity across woods of shrub characteristics, \ncompared to the variation between woods in those of the trees (Table 3), suggested that either \nshrubs were intrinsically less variable or that Marsh Tits were more selective about the shrub layer \nthan about the tree canopy. The former seems unlikely, and the results from Wytham Woods concur \nwith this. The areas of Wytham which lack a well developed shrub layer also lack Marsh Tits (Fig. \n1), but are occupied by Great and Blue Tits (A. Gosler, pers. com.). The numbers of small trees and \nsmall shrubs did not follow the general pattern shown by the other parameters, probably because \nthese size classes are not important in habitat selection by Marsh Tits. Many of the shrubs in the \nsmall category were single stems about one metre tall with little leaf cover. Small trees up to 10 cm \ndbh were more substantial and often several meters or more tall. However, in Monks Wood, it has \nbeen noted that areas less favoured by Marsh Tits are those dominated by stands of young trees \n(Broughton et al. 2006). This is discussed further below in the context of the habitat structure \napparently selected by Marsh Tits.   \nThe variables used in the analysis of the RWBS data were not specifically identified as the \nshrub layer, but vegetation at these heights, and especially that at 2-4 m where the strongest \nrelationship with Marsh Tit abundance at RSPB sites was found (Fig. 2, Table 4), should \ncorrespond to the shrub layer. The negative relationship between Marsh Tit abundance and \nhorizontal visibility (Fig. 3) was also consistent with the hypothesis that Marsh Tits favour a well \ndeveloped shrub layer. However, it is more difficult to explain why there was no relationship \nbetween Marsh Tit abundance and vegetation cover in the original surveys of the RSPB sites in the \n1980s. It is possible that these woodlands have become more suitable for Marsh Tits as they have \nmatured over the c. 20 years between the two survey periods, allowing Marsh Tits to increase in the \nmost suitable sites. Despite the long-term national decline in the UK Marsh Tit population, the \nRWBS analysis found that, for the RSPB sites used here, the species had increased by 27% \n(Hewson et al. this volume). Shrub cover, overall, in these woods had also increased substantially \n(Amar et al. 2006). The fact that the two regression lines cross, coupled with the 27% increase in \nMarsh Tits at these sites, suggested that woods with more cover had become more favourable for \nMarsh Tits, and that the suitability of those with less cover had either not changed or declined a \nlittle. There was no indication of a difference in elevation between the two regression lines (Fig. 2) \nwhich also suggested that the increase in Marsh Tit abundance had occurred in sites with more \ncover and not across all sites in general. If, as discussed below, Marsh Tit use of the shrub layer \nreduces competition with Great Tits and Blue Tits, then an overall increase in woodland shrub cover \nmight buffer Marsh Tits against the effects of competition from these other species whose national \npopulations have increased. Such an effect might have contributed to the increase in Marsh Tits in \nthe RSPB sites recorded in 2003\/04, and perhaps also to the recent increase in the national Marsh \nTit population (Eaton et al. 2006). \nA difference in response across sites was also apparent in the lack of any relationships between \nMarsh Tit abundance and the vegetation variables for the BTO sites in 2003\/04. Overall, the BTO \nsites tended to be smaller than those of the RSPB; over 30% of BTO sites were less than 20 ha, \nwhereas less than 10% of RSPB sites occurred in this size category (Amar et al. 2006). The RSPB \nsites tended to be large, mature woodland blocks, set in more wooded landscapes, and also had a \ngreater representation in Scotland and the west. In contrast, the BTO sites were located in \nlandscapes more dominated by intensive agriculture and urban\/suburban development, 46% of sites \nbeing in the east and south east compared to 33% of RSPB sites (Amar et al. 2006). Marsh Tits are \nknown to be sensitive to woodland area (Hinsley et al. 1996) and landscape-scale structure can \naffect local extinction\/colonisation characteristics and species composition within woodlands \n(Bellamy et al. 2003, Bennett et al. 2004). Overall, BTO sites had more shrub cover than those of \nthe RSPB (e.g. BTO sites: mean cover at 2-4 m  = 30 ± 12%, RSPB sites: 24 ± 16%), but Marsh Tit \nabundance at BTO sites showed an overall decrease of 27% between the two survey periods, \ncompared to the 27% increase at RSPB sites. This also suggests that factors in addition to shrub \ncover may contribute to habitat suitability. More BTO sites may have been sub-optimal for Marsh \nTits, at both local and landscape scales, and did not benefit from any positive effects of woodland \nmaturation and\/or increasing shrub cover.  \nIn the literature (e.g. Perrins 1979, Cramp & Perrins 1993), Marsh Tit habitat is generally \ndescribed as mature woodland, and the results reported here are consistent with this. Furthermore, \nthese results suggest that the structure favoured by Marsh Tits comprises a tall tree canopy with a \nwell developed shrub layer beneath it. In Wytham Woods, Marsh Tits also breed in areas of ancient \nhazel coppice where the shrub layer is unusually tall and, with the exception of a low density of \nlarge, mature oaks, forms much of the top canopy. Such a structure is broadly similar to that of \nscrub and raises the question of why a species that favours the shrub layer in woodland should be \nabsent from structurally similar secondary habitats such as scrub and hedgerows.  \nThe Willow Tit Poecile montanus is a closely related species with which Marsh Tit has \nfrequently been confused; indeed the two were not recognised, or accepted, as separate species in \nthe UK until the early 1900s (Kleinschmidt 1898, Simson 1966). Willow Tits in the UK have \ndeclined by more than 50% over the last 25 years and were added to the Red List of Birds of \nConservation Concern in 2002 (Gregory et al. 2003). In the UK, they are generally thought of as \nwoodland birds, but with a preference for wet, scrubby habitat (Perrins 1979, Cramp & Perrins, \n1993) and recent work by the RSPB (Lewis et al., this volume) has identified mature scrub, \nincluding derelict industrial sites and hedgerows, as the species current strongholds. Unlike all other \nBritish tits (except Crested Tit Lophophanes cristatus which in the UK occurs only in a restricted \narea of Scotland) Willow Tits excavate their own nest holes and can utilise relatively small diameter \nstems for the purpose (Lewis, pers. com.). This ability may allow them to occupy scrub where the \nother species of tit are limited by the lack of nest holes. Within woodland, Willow Tits may in turn \nbe limited by usurpation of their nest sites by other tits (Maxwell 2002, Lewis et al. this volume, but \nalso see Siriwardena 2004). Marsh Tits reduce competition with Blue and Great Tits by \nconcentrating their activity in the shrub layer, between Blue Tits in the top canopy and Great Tits \nlower down (Lack 1971), and may reduce competition for nest holes when necessary by nesting low \ndown (Siriwardena 2006). In Wytham Woods, where the population density of Great and Blue Tits \nis relatively high (c. 2.4 x higher than in Monks Wood, Carpenter et al. unpubl. data), most Marsh \nTits nest within a metre of the ground. Similarly, at Roudsea Wood, ten out of ten nest sites found \nwhen determining core areas of territories were within one metre of the ground. In Monks Wood, \nMarsh Tits use holes across a range of heights from ground level to c. 10 m, but they are often low \n(mean in 2004 = 3 m, n = 30; Broughton unpubl. data). Most of the nests are in Common Ash and \nthis, as the dominant tree species in Monks Wood, appears to offer good numbers of suitable holes \nfrom ground level upwards. Common Ash also tends to have a relatively thin canopy and hence \nmay be favourable for the maintenance of a good shrub layer.  \nGiven the importance of the shrub layer to Marsh Tits, the reasons for the species national \npopulation decline may be linked to changes in woodland shrubs. Although woodland maturation \nmay favour the development of a good quality shrub layer, this may be dependent, at least in part, \non tree species composition, density and management. The development of a dense canopy, as may \noccur in species such as Common Beech Fagus sylvatica and Sycamore Acer pseudoplantanus, may \nshade out the shrub layer. Similarly, shrub layer growth and replacement may be damaged by \nexcessive deer grazing (Fuller 2001, Perrins & Overall 2001) and management practices which \nclear the ground beneath the tree canopy. As food storers, seeds may be important for Marsh Tits \nand, as suggested by the observations of foraging behaviour, particularly so in winter. Thus \nherbaceous, seed-bearing plants may also be important, but are equally, or more, vulnerable to the \nsame factors likely to damage the shrub layer. It has been noted elsewhere (Perrins 1979) that the \ncommon English names of Marsh and Willow Tit seem rather inappropriate, and probably arose due \nto the confusion between the identities of the two species. Currently in the UK, the primary habitat \nof the Marsh Tit appears to be mature woodland shrub whilst that of the Willow Tit is mature scrub.  \n \nWe would like to thank English Nature for permission to work in Monks Wood, Roudsea Wood, \nSwanton Novers and Treswell Wood, with particular thanks to Phil Grice, Ash Murray, Chris \nGardiner and Rob Petley-Jones, and to Nigel Fisher, Conservator of Wytham Woods. We would \nalso like to thank Robert Baker, Simon Butler, Laura Daniels, Chris du Feu and the South \nNottinghamshire Ringing Group, Jim Fowler, Alex Lewis, Ken Smith and staff and students of the \nEGI, University of Oxford, for colour-ringing and\/or recording Marsh Tits, and for assistance with \nhabitat recording, and Alistair Dawson for Fig. 1. Special thanks also to Jim Fowler for \naccommodation and hospitality. Finally, thanks to two referees for improving the manuscript and \nespecially for the suggestion that increasing shrub abundance might reduce competition from other \ntits. \n \nREFERENCES \n \nAltmann, J. 1974. Observational study of behaviour; sampling methods. Behav. 49: 227-265. \nAmar, A., Hewson, C.M., Thewlis, R.M., Smith, K.W., Fuller, R.J., Lindsell, J.A., Conway, G., \nButler, S. & MacDonald, M. 2006. What’s happening to our woodland birds? Long-term \nchanges in the populations of woodland birds. RSPB Research Report no. 19 and BTO \nResearch Report no. 169. Sandy, RSPB. \nBellamy, P.E., Rothery, P. & Hinsley, S.A. 2003. Synchrony of woodland bird populations: the \neffect of landscape structure. Ecography 26: 338-348. \nBennett, A.F., Hinsley, S.A., Bellamy, P.E., Swetnam, R.D. & MacNally, R. 2004. Do regional \ngradients in land-use influence richness, composition and turnover of bird assemblages in \nsmall woods? Biol.  Cons. 119: 191-206. \nBetts, M.M. 1955. The food of titmice in oak woodland. J. Anim. Ecol. 24: 282-323. \nBevan, G. 1959. The feeding sites of birds in dense oakwood. London Nat. 38: 64-73. \nBroughton, R. K., Hinsley, S.A., Bellamy, P.E., Hill, R.A. & Rothery, P. 2006. Marsh Tit \nPeocile palustris territories in a British broadleaved wood. Ibis 148: 744-752. \nColquhoun, M.K. & Morley, A. 1943. Vertical zonation in woodland bird communities. J. Anim. \nEcol. 12: 73-81. \nCramp, S. & Perrins, C.M. (eds) 1993. The Birds of the Western Palearctic. Vol. 7: Flycatchers \nto Shrikes. Oxford: Oxford University Press. \nEaton, M.A., Ausden, M., Burton, N., Grice, P.V., Hearn, R.D., Hewson, C.M., Hilton, G.M., \nNoble, D.G., Ratcliffe, N. & Rehfisch, M.M. 2006. The state of the UK’s birds 2005. \nSandy, Bedfordshire: RSPB, BTO, WWT, CCW, EN, EHS, and SNH. \nFuller, R.J. 1995. Bird Life of Woodland and Forest. Cambridge: Cambridge University Press. \nFuller, R.J. 2001. Responses of woodland birds to increasing numbers of deer: a review of \nevidence and mechanisms. Forestry 74: 289-298. \nFuller, R.J., Noble, D.G., Smith, K.W. & Vanhinsberg, D. 2005. Recent declines in populations \nof woodland birds in Britain: a review of possible causes. Brit. Birds 98: 116-143. \nGardiner, C. & Sparks, T.H. (eds) 2005. Ten years of change: woodland research at Monks \nWood NNR, 1993-2003. Proceedings of the 50th Anniversary Symposium. English Nature \nResearch Report 613. Peterborough: English Nature. \nGibb, J. 1954. Feeding ecology of tits, with notes on Treecreeper and Goldcrest. Ibis 96: 513-543. \nGregory, R.D., Wilkinson, N.I., Noble, D.G., Robinson, J.A., Brown, A.F., Hughes, J., Procter, \nD.A., Gibbons, D.W. & Galbraith, C.A. 2002. The population status of birds in the United \nKingdom, Channel Islands and Isle of Man: an analysis of conservation concern 2002-2007. \nBrit. Birds 95: 410-450. \nGregory, R.D., Eaton, M.A., Noble, D.G., Robinson, J.A., Parsons, M., Baker, H., Austin, G. \n& Hilton, G.M. 2003. The State of the UK’s Birds 2002. Sandy: The RSPB, BTO, WWT \nand JNCC. \nHartley, P.H.T. 1953. An ecological study of the feeding habits of the English titmice. J. Anim. \nEcol. 22: 261-288. \nHewson, C. & Amar, A. 2006. Recent changes in British woodland bird populations. Ibis, this \nvolume. \nHinde, R.A. 1952. The behaviour of the Great Tit (Parus major) and some related species. Behav. \nSuppl. 2: 1-201. \nHinsley, S.A., Bellamy, P.E., Newton, I. & Sparks, T.H. 1995. Habitat and landscape factors \ninfluencing the presence of individual breeding bird species in woodland fragments. J. Avian \nBiol. 26: 94-104. \nHinsley, S.A., Bellamy, P.E., Newton, I. & Sparks, T.H. 1996. Influences of population size and \nwoodland area on bird species distributions in small woods. Oecologia 105: 100-106. \nHinsley, S.A., Hill, R.A., Gaveau, D.L.A. & Bellamy, P.E. 2002. Quantifying woodland structure \nand habitat quality for birds using airborne laser scanning. Funct. Ecol. 16: 851-857. \nKleinschmidt, O. 1898. Weitere Notizen über Sumpfmeisen. Orn. Monatsber. 6: 33-36. \nLack, D. 1971. Ecological Isolation in Birds. Oxford and Edinburgh: Blackwell Scientific \nPublications. \nLewis, A. 2006. Diagnosing the causes of the decline of British Willow Tits. Ibis, this volume. \nMaxwell, J. 2002. Nest-site competition with blue tits and great tits as a possible cause of declines \nin willow tit numbers: observations in the Clyde area. Glasgow Naturalist 24: 47-50. \nMartin, P. & Bateson, P. 1993. Measuring Behaviour. 2nd Edition. Cambridge: Cambridge \nUniversity Press. \nMead, C. 2000. The State of the Nations Birds. Suffolk: Whittet Books Ltd. \nMorley, A. 1953. Field observations on the biology of the Marsh Tit. Brit. Birds 46: 233-238, 273-\n287, 332-346. \nPerrins, C.M. 1979. British Tits. London: Collins. \nPerrins, C. 2003. The status of Marsh and Willow Tits in the UK. Brit. Birds 96: 418-426. \nPerrins, C.M. & Overall, R. 2001. Effect of increasing numbers of deer on bird populations in \nWytham Woods, central England. Forestry 74: 299-309. \nSimson, C. 1966. A Bird Overhead. London: Witherby. \nSiriwardena, G.M. 2004. Possible roles of habitat, competition and avian nest predation in the \ndecline of the Willow Tit Parus montanus in Britain. Bird Study 51: 193-202. \nSiriwardena, G.M. 2006. Avian nest predation, competition and the decline of British Marsh Tits \nParus palustris. Ibis 148: 255-265 \nSmith, G. & Gilbert, J. 2001. National Inventory of Woodland and Trees – England. Edinburgh: \nForestry Commission. \nSnow, D.W. 1954. The habitats of Eurasian tits (Parus spp.). Ibis 96: 565-585. \nSokal, R.R. & Rohlf, F.J. 1981. Biometry. 2nd Edition. New York: W.H. Freeman and Company.  \nSouthern, H.N. & Morley, A. 1950. Marsh-Tit territories over six years. Brit. Birds \n 43: 33-47.\nTable 1. Comparison of overall time budgets and foraging behaviour of Marsh Tits and Blue Tits in \nwinter in Monks Wood in 2004\/05.  \n \n \n \n________________________________________________________________________________ \n Overall time budget, % of records Foraging behaviour, % of records \n      \nActivity Marsh Tit Blue Tit Behaviour Marsh Tit Blue Tit \n (n = 119) (n = 128) (n =79) (n = 91) \n________________________________________________________________________________ \n \nForaging 65 69 Gleaning branches 32 38 \n \nVigilance 23 16 Handling\/eating 27 16 \n \nFlight 9 11 Searching, without pecking 22 17 \n \nMaintenance 2 3 Gleaning leaves 8 7 \n \nCalling 1 1 Hanging feeding 6 22 \n \n   Caching\/retrieving 5 0 \n________________________________________________________________________________ \n \n \nTable 2. Comparison of foraging locations within trees and shrubs of Marsh Tits and \nBlue Tits in winter in Monks Wood in 2004\/05.   \n \n \n \n \n___________________________________________________________________ \n In canopy, % of records In understorey, % of records \n      \nLocation Marsh Tit Blue Tit Marsh Tit Blue Tit \n (n = 46) (n = 70) (n = 71) (n = 53) \n___________________________________________________________________ \n \nTop third 38 53 42 64 \n \nMiddle third 39 30 39 28 \n \nBottom third 17 10 13 8 \n \nGround (beneath 6 7 6 0 \n \ntree or shrub) \n___________________________________________________________________\n   \n \n \n \nTable 3. Comparison of the characteristics, and source of variation, of trees and shrubs in Marsh Tit territories in five different woods. Data \n \nare shown for Treswell Wood, but were not included in the analysis due to the small sample size. The P values (one-way ANOVA) refer to differences \nbetween woods in species richness, density indices and numbers of trees and shrubs. The intraclass correlation shows the variance in the data due to \ndifferences between woods (see text for more details).   \n_______________________________________________________________________________________________________________  \n Mean (SD) values per transect (n =10 except for Treswell where n = 3) Intraclass  \n      \n Wytham  Monks Wd Swanton N Roudsea Treswell P correlation, % \n________________________________________________________________________________________________________________ \nTREES \n \nTree species richness 3.4 (1.0) 4.6 (1.0) 5.0 (1.9) 6.9 (1.3) 2.7 (0.6) < 0.001 51 \n \nCanopy density index 1.48  (0.32) 1.81  (0.13) 1.80 (0.40) 1.55 (0.34) 1.73 (0.08) 0.052 16 \n \nNos. of large trees 10.6  (5.4) 6.7  (3.0) 12.1  (6.3) 20.4  (9.7) 17.3  (0.6) < 0.001 40 \n \nNos. of medium trees 10.0  (8.6) 37.7  (15.2) 18.6 (12.8) 33.9 (12.9) 14.3  (2.5) < 0.001 48 \n \nNos. of large + medium 20.6 (12.5) 44.4 (15.1) 30.7 (11.4) 54.3 (10.5) 31.7  (2.5) < 0.001 57 \n \nNos. of small trees 8.2  (10.6) 35.3  (43.0) 34.1  (31.6) 35.5  (30.3) 13.0  (8.0) 0.155 8 \n \nSHRUBS \n \nShrub species richness 3.6 (1.1) 5.1 (1.0) 4.4 (1.9) 5.4 (1.6) 5.7 (1.5) 0.041 17 \n \nShrub density index 1.94 (0.48) 1.89 (0.21) 1.94 (0.61) 2.07 (0.45) 2.47 (0.16) 0.851 0 \n \nNos. of large shrubs 23.7 (16.3) 12.8 (6.0) 14.3 (11.9) 18.2 (17.0) 12.0 (2.7) 0.291 3 \n \nNos. of medium shrubs 10.9 (5.7) 25.1 (7.3) 29.2 (32.4) 23.1 (19.1) 16.7 (4.9) 0.195 6 \n \nNos. of large + medium 34.6 (20.8) 37.9 (10.7) 43.5 (38.0) 41.3 (33.8) 28.7 (3.5) 0.899 0 \n \nNos. of small shrubs 2.8  (1.8) 9.1  (7.1) 63.4  (45.1) 39.9  (31.6) 14.0  (7.6) < 0.001 48 \n________________________________________________________________________________________________________________ \nTable 4. Summary of: a) fitted models of Marsh Tit abundance at 157 RSPB RWBS sites in \n2003\/04 and F-tests for the effects of vegetation cover at different heights and of horizontal \nvisibility after allowing for the effects of regional locality (n = 6) and, b) F-tests for the \ndifferences in the slopes of the relationships between Marsh Tit abundance and vegetation \ncover at different heights in 2003\/04 compared to the original surveys in the 1980s, after \nallowing for the effects of regional locality (for regional locality, P < 0.001 in all models). R2 \nvalues are for the full models including region; data for horizontal visibility were not \navailable for the 1980s. \n \n \n_____________________________________________________________________ \n \n Effect R2 ( %) F P \n_____________________________________________________________________ \n \na) Vegetation cover in 2003\/04 \n \n1. Cover at 0.5 – 2.0 m 16 4.56 0.034 \n \n2. Cover at 2.0 – 4.0 m 18 7.02 0.009 \n \n3. Cover at 4.0 – 10.0 m 16 4.50 0.036 \n \n4. Horizontal visibility 19 9.89 0.002 \n-------------------------------------------------------------------------------------------------------- \nb) Differences in slopes between 1980s and 2003\/04 \n \n1. Cover at 0.5 – 2.0 m 14 10.63 0.001 \n \n2. Cover at 2.0 – 4.0 m 15 12.58  < 0.001 \n \n3. Cover at 4.0 – 10.0 m 15 11.97 0.001 \n_____________________________________________________________________ \n \n \n \n \nFigure 1. Shrub and tree numbers (total number of shrubs ≥ 2 m and total number of trees \nwith dbh ≥10 cm), and shrub and tree canopy density indices in transect samples of Wytham \nWoods, comparing areas occupied by Marsh Tits (unshaded bars, n = 10) with unoccupied \nareas (shaded bars, n = 6). Standard errors of the means shown by vertical bars. \n \n \nFigure 2. Relationship between Marsh Tit abundance and vegetation cover corresponding to \nthe shrub layer in 157 woods recorded by the RSPB during the 1980s (open circles and \ndashed line) and in the same woods by the RWBS in 2003\/04 (crosses and solid line). Lines \nfitted using linear regression. \n \n \nFigure 3. Relation between Marsh Tit abundance and horizontal visibility for 157 woods \nrecorded by the RSPB during the RWBS in 2003\/04. Line fitted using linear regression. \nFig. 1 \n \n \n \n \nSh\nru\nb d\nen\nsit\ny\nCa\nno\npy\n de\nns\nity\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\nD\nen\nsi\nty\n in\nde\nx\nNo\ns. \nof \nsh\nru\nbs\nNo\ns. \nof \ntre\nes\n0\n5\n10\n15\n20\n25\n30\n35\nN\num\nber\nFig. 2 \n \n \n \n706050403020100\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\nVegetation cover at 2-4 m, %\nM\nar\nsh\n T\nit \nab\nun\nda\nnc\ne\n \n \nFig. 3 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n121110987654\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\nHorizontal visibility\nM\nar\nsh\n T\nit \nab\nun\nda\nnc\ne\n \n \n \n \n \n \n \n \n \n"}