{"doi":"10.1016\/j.jastp.2008.09.019","coreId":"69190","oai":"oai:eprints.lancs.ac.uk:28034","identifiers":["oai:eprints.lancs.ac.uk:28034","10.1016\/j.jastp.2008.09.019"],"title":"Introduction to special issue on high speed solar wind streams and geospace interactions (HSS-GI)","authors":["Denton, M.H.","Borovsky, J.E.","Horne, R.B.","McPherron, R.L.","Morley, S.K.","Tsurutani, B.T."],"enrichments":{"references":[{"id":16669706,"title":"A coronal hole and its identiﬁcation as the source of a high velocity solar wind stream.","authors":[],"date":"1973","doi":null,"raw":"Krieger, A.S., Timothy, A.F., Roelof, E.C., 1973. A coronal hole and its identiﬁcation as the source of a high velocity solar wind stream. Sol. Phys. 23, 123.","cites":null},{"id":16669688,"title":"Acceleration of killer electrons.","authors":[],"date":"2007","doi":null,"raw":"Horne, R.B., 2007. Acceleration of killer electrons. Nat. Phys. 3, 590–591.","cites":null},{"id":16669631,"title":"Alfve ´nic turbulence in high speed solar wind streams as a driver for auroral activity.","authors":[],"date":"2009","doi":null,"raw":"D’Amicis, R., Bruno, R., Bavassano, B., 2009. Alfve ´nic turbulence in high speed solar wind streams as a driver for auroral activity. J. Atoms.","cites":null},{"id":16669795,"title":"Chronology of ‘‘killer’’ electrons: solar cycles 22 and 23.","authors":[],"date":"2009","doi":null,"raw":"Wrenn, G.L., 2009. Chronology of ‘‘killer’’ electrons: solar cycles 22 and 23.","cites":null},{"id":16669721,"title":"Coronal mass ejection and stream interaction region characteristics and their potential geomagnetic effectiveness.","authors":[],"date":"1995","doi":null,"raw":"Lindsay, G.M., Russell, C.T., Luhmann, J.G., 1995. Coronal mass ejection and stream interaction region characteristics and their potential geomagnetic effectiveness. J. Geophys. Res. 100, 16999–17013.","cites":null},{"id":16669804,"title":"E-mail address: m.denton@lancaster.ac.uk J.E. Borovsky Space Science and Applications, Los Alamos National Laboratory,","authors":[],"date":"2008","doi":null,"raw":"M.H. Denton Department of Communication Systems, Lancaster University, Lancaster, UK E-mail address: m.denton@lancaster.ac.uk J.E. Borovsky Space Science and Applications, Los Alamos National Laboratory, Los Alamos, NM, USA R.B. Horne British Antarctic Survey, Cambridge, UK R.L. McPherron IGPP, University of California at Los Angeles, Los Angeles, USA S.K. Morley University of Newcastle, Newcastle, Australia B.T. Tsurutani Jet Propulsion Laboratory, California Institute of Technology, Pasadena, CA, USA Available online 11 October 2008 ARTICLE IN PRESS Editorial \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1011–1013 1013","cites":null},{"id":16669625,"title":"Effects of high-speed solar wind on energetic electron activity in the auroral regions","authors":[],"date":"2009","doi":null,"raw":"Birch, M.J., Hargreaves, J.K., Bromage, B.J., Evans, D.S., 2009. Effects of high-speed solar wind on energetic electron activity in the auroral regions July 1–2, 2005. J. Atoms. Sol.-Terr. Phys., this issue, doi: 10.1016\/j.jastp.2009.02.008.","cites":null},{"id":16669777,"title":"Energetics of magnetic storms driven by corotating interaction regions: a study of geoeffectiveness.","authors":[],"date":"2006","doi":null,"raw":"Turner, N.E., Mitchell, E.J., Knipp, D.J., Emery, B.A., 2006. Energetics of magnetic storms driven by corotating interaction regions: a study of geoeffectiveness. In: Tsurutani, B., McPherron, R.L., Gonzalez, W.D., Lu, G., Sobral, J.H.A., Gopalswamy, N. (Eds.), Recurrent Magnetic Storms: Corotating Solar Wind Streams. Geophysical Monograph Series 167, AGU.","cites":null},{"id":16669783,"title":"Geoefﬁciency and energy partitioning in CIR-driven and CME-driven storms.","authors":[],"date":"2009","doi":null,"raw":"Turner, N.E., Cramer, W.D., Earles, S.K., Emery, B.A., 2009. Geoefﬁciency and energy partitioning in CIR-driven and CME-driven storms.","cites":null},{"id":16669696,"title":"High speed solar wind streams and geospace interactions.","authors":[],"date":"2007","doi":null,"raw":"Kavanagh, A.J., Denton, M.H., 2007. High speed solar wind streams and geospace interactions. Astron. Geophys. 48, 6.24–6.26.","cites":null},{"id":16669674,"title":"High speed solar wind streams: a call for key research.","authors":[],"date":"2008","doi":null,"raw":"Denton, M.H., Borovsky, J.E., Horne, R.B., McPherron, R.L., Morley, S.K., Tsurutani, B.T., 2008. High speed solar wind streams: a call for key research. EOS Trans. AGU 89 (7), 62–63.","cites":null},{"id":16669789,"title":"Impact of different energies of precipitating particles on NOx generation in the middle and upper atmosphere during geomagnetic storms.","authors":[],"date":"2009","doi":null,"raw":"Turunen, E., Verronen, P.T., Seppa ¨la ¨, A., Rodger, C.J., Clilverd, M.A., Tamminen, J., Enell, C-F., Ulich, T., 2009. Impact of different energies of precipitating particles on NOx generation in the middle and upper atmosphere during geomagnetic storms. J. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/j.jastp.2008.07.005.","cites":null},{"id":16669771,"title":"Introduction to special section on corotating solar wind streams and recurrent geomagnetic activity.","authors":[],"date":"2006","doi":null,"raw":"Tsurutani, B.T., McPherron, R.L., Gonzalez, W.D., Lu, G., Sobral, J.H.A., Gopalswamy, N., 2006. Introduction to special section on corotating solar wind streams and recurrent geomagnetic activity. J. Geophys. Res. 111, A07S00.","cites":null},{"id":16669755,"title":"Periodic appearance of coronal holes and the related variation of solar wind parameters.","authors":[],"date":"2007","doi":null,"raw":"Temmer, M.B., Vrs ˇnak, Veronig, A.M., 2007. Periodic appearance of coronal holes and the related variation of solar wind parameters. Sol. Phys. 241, 371–383.","cites":null},{"id":16669727,"title":"Poker ﬂat radar observations of the magnetosphere-ionosphere coupling electrodynamics of the earthward penetrating plasma sheet following convection enhancements.","authors":[],"date":"2009","doi":null,"raw":"Lyons, L.R., Zou, S., Heinselman, C.J., Nicolls, M.J., Anderson, P.C., 2009. Poker ﬂat radar observations of the magnetosphere-ionosphere coupling electrodynamics of the earthward penetrating plasma sheet following convection enhancements. J. Atoms. Sol.-Terr. Phys., in press, doi:10.1016\/j.jastp.2008.09.025.","cites":null},{"id":16669711,"title":"Radiation belt electron ﬂux variability during three CIR-driven geomagnetic storms.","authors":[],"date":"2009","doi":null,"raw":"Lam, M.M., Horne, R.B., Meredith, N.P., Glauert, S.A., 2009. Radiation belt electron ﬂux variability during three CIR-driven geomagnetic storms.","cites":null},{"id":16669741,"title":"Radiation Belt Storm Probes: a new mission for space weather forecasting.","authors":[],"date":"2008","doi":null,"raw":"Reeves, G.D., 2008. Radiation Belt Storm Probes: a new mission for space weather forecasting. Space Weather 5, S11002.","cites":null},{"id":16669738,"title":"Recurrent substorm activity during the passage of a corotating interaction region.","authors":[],"date":"2009","doi":null,"raw":"Morley, S.K., Rouillard, A.P., Freeman, M.P., 2009. Recurrent substorm activity during the passage of a corotating interaction region.","cites":null},{"id":16669746,"title":"Relativistic electron losses related to EMIC waves during CIR and CME storms.","authors":[],"date":"2009","doi":null,"raw":"Sandanger, M.I., Søraas, F., Sørbø, M., Aarsnes, K., Oksavik, K., Evans, D.S., 2009. Relativistic electron losses related to EMIC waves during CIR and CME storms. J. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/ j.jastp.2008.07.006.","cites":null},{"id":16669702,"title":"Response of the upper\/middle atmosphere to coronal holes and powerful high-speed solar wind streams in 2003. In: Tsurutani,","authors":[],"date":"2006","doi":null,"raw":"Kozyra, J.U., et al., 2006. Response of the upper\/middle atmosphere to coronal holes and powerful high-speed solar wind streams in 2003. In: Tsurutani, B., McPherron, R.L., Gonzalez, W.D., Lu, G., Sobral, J.H.A., Gopalswamy, N. (Eds.), Recurrent Magnetic Storms: Corotating Solar Wind Streams. Geophysical Monograph Series 167, AGU.","cites":null},{"id":16669753,"title":"Ring current behaviour during corotating interaction region and high speed stream events.","authors":[],"date":"2009","doi":null,"raw":"Sørbø, M., Søraas, F., Sandanger, M.I., Evans, D.S., 2009. Ring current behaviour during corotating interaction region and high speed stream events. J. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/ j.jastp.2008.08.012.","cites":null},{"id":16669692,"title":"Ring current development during high speed streams.","authors":[],"date":"2009","doi":null,"raw":"Jordanova, V.K., Matsui, H., Puhl-Quinn, P.A., Thomsen, M.F., Mursula, K., Holappa, L., 2009. Ring current development during high speed streams. J. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/j.jastp. 2008.09.043.","cites":null},{"id":16669730,"title":"Role of the Russell–McPherron effect in the acceleration of relativistic electrons.","authors":[],"date":"2009","doi":null,"raw":"McPherron, R.L., Baker, D.N., Crooker, N.U., 2009. Role of the Russell–McPherron effect in the acceleration of relativistic electrons. J. Atoms.","cites":null},{"id":16669714,"title":"Rotating solar coronal holes and periodic modulation of the upper atmosphere.","authors":[],"date":"2008","doi":null,"raw":"Lei, J., Thayer, J.P., Forbes, J.M., Sutton, E.K., Nerem, R.S., 2008. Rotating solar coronal holes and periodic modulation of the upper atmosphere. Geophys. Res. Lett. 35, L10109.","cites":null},{"id":16669679,"title":"Solar wind structure sources and periodicities of auroral electron power over three solar cycles.","authors":[],"date":"2009","doi":null,"raw":"Emery, B.A., Richardson, I.G., Evans, D.S., Rich, F.J., 2009. Solar wind structure sources and periodicities of auroral electron power over three solar cycles. J. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/ j.jastp.2008.08.005.","cites":null},{"id":16669733,"title":"Solar–terrestrial coupling evidenced by periodic behavior in geomagnetic indexes and the infrared energy budget of the thermosphere.","authors":[],"date":"2008","doi":null,"raw":"Mlynczak, M.G., Martin-Torres, F.J., Mertens, C.J., Marshall, B.T., Thompson, R.E., Kozyra, J.U., Remsberg, E.E., Gordley, L.L., Russell III, J.M., Woods, T., 2008. Solar–terrestrial coupling evidenced by periodic behavior in geomagnetic indexes and the infrared energy budget of the thermosphere. Geophys. Res. Lett. 35, L05808.","cites":null},{"id":16669765,"title":"The cause of high-intensity longduration continuous AE activity (HILDCAAs): interplanetary Alfve ´n wave trains.","authors":[],"date":"1987","doi":null,"raw":"Tsurutani, B.T., Gonzalez, W.D., 1987. The cause of high-intensity longduration continuous AE activity (HILDCAAs): interplanetary Alfve ´n wave trains. Planet. Space Sci. 35, 405.","cites":null},{"id":16669627,"title":"The differences between CME-driven storms and CIR-driven storms.","authors":[],"date":"2006","doi":null,"raw":"Borovsky, J.E., Denton, M.H., 2006. The differences between CME-driven storms and CIR-driven storms. J. Geophys. Res. 111, A07S08.","cites":null},{"id":16669682,"title":"The nature of auroras during high-intensity longduration continuous AE activity (HILDCAA) events:","authors":[],"date":"2006","doi":null,"raw":"Guarnieri, F.L., 2006. The nature of auroras during high-intensity longduration continuous AE activity (HILDCAA) events: 1998 to 2001. In: Tsurutani, B., McPherron, R.L., Gonzalez, W.D., Lu, G., Sobral, J.H.A., Gopalswamy, N. (Eds.), Recurrent Magnetic Storms: Corotating Solar Wind Streams. Geophysical Monograph Series 167, AGU.","cites":null},{"id":16669749,"title":"The solar wind velocity and its correlation with cosmic-ray variations and with solar and geomagnetic activity.","authors":[],"date":"2009","doi":null,"raw":"ARTICLE IN PRESS Editorial \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1011–1013 1012Snyder, C.W., Neugebauer, M., Rao, U.R.,1963. The solar wind velocity and its correlation with cosmic-ray variations and with solar and geomagnetic activity. J. Geophys. Res. 68, 6361–6370.","cites":null},{"id":16669636,"title":"The superdense plasma sheet in the magnetosphere during high-speed-stream-driven storms: plasma transport timescales.","authors":[],"date":"2009","doi":null,"raw":"Denton, M.H., Borovsky, J.E., 2009. The superdense plasma sheet in the magnetosphere during high-speed-stream-driven storms: plasma transport timescales. J. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/ j.jastp.2008.04.023.","cites":null},{"id":16669760,"title":"Thermospheric density oscillations due to periodic solar wind high-speed streams.","authors":[],"date":"2008","doi":null,"raw":"Thayer, J.P., Lei, J., Forbes, J.M., Sutton, E.K., Nerem, R.S., 2008. Thermospheric density oscillations due to periodic solar wind high-speed streams. J. Geophys. Res. 113, A06307.","cites":null},{"id":16669633,"title":"this issue,","authors":[],"date":null,"doi":null,"raw":"Sol.-Terr. Phys., this issue, doi:10.1016\/j.jastp.2008.05.002.","cites":null},{"id":16669719,"title":"Unravelling the causes of radiation belt enhancements.","authors":[],"date":"2007","doi":null,"raw":"Liemohn, M.W., Chan, A.A., 2007. Unravelling the causes of radiation belt enhancements. EOS Trans. AGU 88 (42), 425–426.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69190.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/28034\/1\/art_968.pdf","pdfHashValue":"1af66b23fd15fbe18473721c02e39b8a219dbcb5","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:28034<\/identifier><datestamp>\n      2018-01-24T02:51:55Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Introduction to special issue on high speed solar wind streams and geospace interactions (HSS-GI)<\/dc:title><dc:creator>\n        Denton, M.H.<\/dc:creator><dc:creator>\n        Borovsky, J.E.<\/dc:creator><dc:creator>\n        Horne, R.B.<\/dc:creator><dc:creator>\n        McPherron, R.L.<\/dc:creator><dc:creator>\n        Morley, S.K.<\/dc:creator><dc:creator>\n        Tsurutani, B.T.<\/dc:creator><dc:date>\n        2009<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/28034\/1\/art_968.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.jastp.2008.09.019<\/dc:relation><dc:identifier>\n        Denton, M.H. and Borovsky, J.E. and Horne, R.B. and McPherron, R.L. and Morley, S.K. and Tsurutani, B.T. (2009) Introduction to special issue on high speed solar wind streams and geospace interactions (HSS-GI). Journal of Atmospheric and Solar-Terrestrial Physics, 71. pp. 1011-1013. ISSN 1364-6826<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/28034\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.jastp.2008.09.019","http:\/\/eprints.lancs.ac.uk\/28034\/"],"year":2009,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"ARTICLE IN PRESSContents lists available at ScienceDirectJournal of\nAtmospheric and Solar-Terrestrial Physics\nJournal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1011–10131364-68\ndoi:10.1journal homepage: www.elsevier.com\/locate\/jastpEditorialIntroduction to Special Issue on high speed solar wind streams\nand geospace interactions (HSS–GI)1. Introduction ejections (CMEs). As a result HSSs are sometimes regardedThis special issue of the Journal of Atmospheric and\nSolar-Terrestrial Physics is devoted to research into high\nspeed solar wind streams (HSSs) and their effects on\nthe region of near-Earth space commonly known as\n‘geospace’. Interest in the effects of HSSs has increased\nduring the last solar cycle and, following the successful\nmeeting focusing on corotating solar wind streams in\nManaus, Brazil (Tsurutani et al., 2006), we recognised the\nneed for further work on the topic, with particular focus\non HSSs and their effects in the inner magnetosphere,\nionosphere, and neutral atmosphere. As a result the High\nSpeed Solar Wind Streams and Geospace Interactions\n(HSS–GI) Workshop was held at Hilltop, St. Martin’s\nCollege in Ambleside, UK, from 2 to 7 September, 2007\n(Kavanagh and Denton, 2007; Denton et al., 2009),\nsponsored by the Department of Communication Systems\nat Lancaster University. The majority of the work pre-\nsented in this special issue was prompted by discussion\nand interaction at the workshop. It is indeed an indication\nof the importance of HSSs that the papers in this issue\ncover the entire region from the Sun and solar wind,\nthrough the magnetosphere, and into the ionosphere,\nthermosphere, and down to the stratosphere. It is hoped\nthat this research will stimulate more understanding,\nappreciation, and research, into these important drivers of\nphysical phenomena within geospace.\n2. High speed solar wind streams—recent progress\nPeriodic HSSs have been known to exist since research\nby Snyder et al. (1963), with the source of such streams\nbeing traced to solar coronal holes by Krieger et al. (1973).\nSince this early work, further links between HSSs and\nrecurrent activity within geospace have been reported by\nnumerous authors, and the relationship between such\nevents and phenomena within the magnetosphere has\nbecome increasingly apparent.\nAs is widely known, HSSs typically produce less\nsignificant deflections in geomagnetic indices such as\nDst than transient phenomena such as coronal mass26\/$ - see front matter & 2009 Elsevier Ltd. All rights reserved.\n016\/j.jastp.2008.09.019as less important drivers of geomagnetic activity. This has\nled to many studies, where event-selection is based solely\non the Dst signature, overlooking HSS-events and hence\nneglecting their significance. At the workshop, this was\nreferred to as ‘the Dst mistake’. Comparisons between\nHSS- and CME-driven events do reveal important differ-\nences in their effects within all regions of geospace (e.g.\nLindsay et al., 1995; Borovsky and Denton, 2006) and\nwhilst CME-events certainly produce the largest geomag-\nnetic storms, HSS-events are particularly important for\nphenomena such as relativistic electron acceleration,\nradiation belt enhancements, and satellite anomalies\n(e.g. Wrenn et al., 2009). In terms of the energy input to\nthe magnetosphere, HSSs are found to input a total-\nenergy-per-event which is similar in magnitude to that\nduring CMEs; indeed the ratio of the energy-deposited-\nin-the-magnetosphere to the energy-input-to-the-magne-\ntosphere appears to be greater for HSSs than for CMEs (e.g.\nTurner et al., 2006, 2009; Kozyra et al., 2006; Guarnieri,\n2006).\nIt is known that HSSs are particularly important for\nacceleration and loss processes in the Earth’s radiation\nbelts and in recent years much interest in the community\nhas focused on determining the principal acceleration and\nloss mechanisms (e.g. Tsurutani et al., 2006; Horne, 2007;\nLiemohn and Chan, 2007; Reeves, 2008). An important\nsource population for the ring current\/radiation belts is\nthe Earth’s plasma sheet and in this issue the timescales\nfor delivery of plasma sheet material to the inner\nmagnetosphere during HSSs are evaluated by Denton\nand Borovsky (2008). Results indicate a super-hot and\nsuper-dense plasma sheet forms at the onset of a HSS-\ndriven storm and is convected Earthwards in a period of a\nfew hours. Energisation of this plasma sheet population\nduring HSSs leads to formation of a enhanced ring current\n(Jordanova et al., 2009; Sørbø et al., 2009), which is\nsubsequently energised leading to enhanced fluxes in the\nradiation belts. Fluxes within the belts may fluctuate\nrapidly during HSSs revealing the balance between\nsources and sinks, and also our ability to reproduce such\nfluctuations using theoretical models (Lam et al., 2009).\nARTICLE IN PRESS\nEditorial \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1011–10131012The derivation of radiation belt radial diffusion coeffi-\ncients during periods of high speed solar wind is discussed\nby Pahud et al. (2009), who also examine the solar wind\nspeed dependence of ULF wave power using ground-based\nmagnetometer data.\nRecently, a number of authors have revealed the\nimportance of a 9-day periodicity in the solar wind speed\nand consequences for the lower atmosphere (e.g. Temmer\net al., 2007; Lei et al., 2008; Mlynczak et al., 2008; Thayer\net al., 2008). In this issue Emery et al. (2009) show that\nthe global electron hemispheric power (a proxy for the\nstrength of auroral activity) also exhibits a 9-day periodi-\ncity. Loss of energetic particles from the magnetosphere\ninto the atmosphere induces detectable changes in the\nEarth’s ionosphere where an decrease\/increase in spectral\nhardness is evident during HSSs (Birch et al., 2009). Such\nenergetic particle precipitation (particularly relativistic\nelectron precipitation during HSSs) may induce the\ngeneration of NOx (odd nitrogen) at lower altitudes, with\npossible subsequent links to ozone depletion in the\nstratosphere (Turunen et al., 2009).\nThe large amplitude Alfve´nic fluctuations, which occur\nduring HSSs have implications for the generation of\nrecurrent substorms (Lyons et al., 2009; Morley et al.,\n2009), HILDCAAs (Tsurutani and Gonzalez, 1987), source\nand loss processes within the radiation belts (Sandanger\net al., 2009), and for resultant auroral activity (D’Amicis\net al., 2009). In addition, superposed-epoch analysis\nindicates the Russell-McPherron effect also plays a role\nin the coupling between the solar wind and the magneto-\nsphere [McPherron et al., 2009]. Whilst it is clear that the\nsouthward-IMF coupling between the solar wind and the\nmagnetosphere during Alfve´nic fluctuations is important,\nit is still not clear whether there is a significant difference\nbetween the driving of the magnetosphere in an on–off\nfashion versus a steady average fashion (Denton et al.,\n2009). In the future we plan to determine whether or not\nsuch on–off driving is important.\nAlthough the papers contained in this special issue\nhighlight the importance of HSSs, and also reveal how\nphysical processes within geospace respond to HSS-\nevents, it is clear that much remains to be discovered\nabout these fascinating phenomena.Acknowledgements\nThe authors would like to thank everyone who helped\nmake the 2007 Ambleside workshop such a successful and\nproductive meeting. Thanks are due to the Faculty of\nScience and Technology, the Photonic Band Gap Research\nGroup, and InfoLab21 at Lancaster University, all of whom\nprovided funding in support of the workshop. Particular\nthanks are due to Jill Greenwood and Joanna Denton for\nassistance in organising the workshop and to our hosts at\nSt. Martin’s College in Ambleside. Portions of this work\nwere performed at JPL, California Institute of Technology,\nunder contract with NASA. The authors also express their\nthanks to Meta Ottevanger, Tim Horscroft, William Lokto,\nand the staff at Elsevier for making this special issue\npossible.References\nBirch, M.J., Hargreaves, J.K., Bromage, B.J., Evans, D.S., 2009. Effects of\nhigh-speed solar wind on energetic electron activity in the auroral\nregions July 1–2, 2005. J. Atoms. Sol.-Terr. Phys., this issue, doi:\n10.1016\/j.jastp.2009.02.008.\nBorovsky, J.E., Denton, M.H., 2006. The differences between CME-driven\nstorms and CIR-driven storms. J. Geophys. Res. 111, A07S08.\nD’Amicis, R., Bruno, R., Bavassano, B., 2009. Alfve´nic turbulence in high\nspeed solar wind streams as a driver for auroral activity. J. Atoms.\nSol.-Terr. Phys., this issue, doi:10.1016\/j.jastp.2008.05.002.\nDenton, M.H., Borovsky, J.E., 2009. The superdense plasma sheet in the\nmagnetosphere during high-speed-stream-driven storms: plasma\ntransport timescales. J. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/\nj.jastp.2008.04.023.\nDenton, M.H., Borovsky, J.E., Horne, R.B., McPherron, R.L., Morley, S.K.,\nTsurutani, B.T., 2008. High speed solar wind streams: a call for key\nresearch. EOS Trans. AGU 89 (7), 62–63.\nEmery, B.A., Richardson, I.G., Evans, D.S., Rich, F.J., 2009. Solar wind\nstructure sources and periodicities of auroral electron power over\nthree solar cycles. J. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/\nj.jastp.2008.08.005.\nGuarnieri, F.L., 2006. The nature of auroras during high-intensity long-\nduration continuous AE activity (HILDCAA) events: 1998 to 2001. In:\nTsurutani, B., McPherron, R.L., Gonzalez, W.D., Lu, G., Sobral, J.H.A.,\nGopalswamy, N. (Eds.), Recurrent Magnetic Storms: Corotating Solar\nWind Streams. Geophysical Monograph Series 167, AGU.\nHorne, R.B., 2007. Acceleration of killer electrons. Nat. Phys. 3, 590–591.\nJordanova, V.K., Matsui, H., Puhl-Quinn, P.A., Thomsen, M.F., Mursula, K.,\nHolappa, L., 2009. Ring current development during high speed\nstreams. J. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/j.jastp.\n2008.09.043.\nKavanagh, A.J., Denton, M.H., 2007. High speed solar wind streams and\ngeospace interactions. Astron. Geophys. 48, 6.24–6.26.\nKozyra, J.U., et al., 2006. Response of the upper\/middle atmosphere to\ncoronal holes and powerful high-speed solar wind streams in\n2003. In: Tsurutani, B., McPherron, R.L., Gonzalez, W.D., Lu, G.,\nSobral, J.H.A., Gopalswamy, N. (Eds.), Recurrent Magnetic\nStorms: Corotating Solar Wind Streams. Geophysical Monograph\nSeries 167, AGU.\nKrieger, A.S., Timothy, A.F., Roelof, E.C., 1973. A coronal hole and its\nidentification as the source of a high velocity solar wind stream. Sol.\nPhys. 23, 123.\nLam, M.M., Horne, R.B., Meredith, N.P., Glauert, S.A., 2009. Radiation belt\nelectron flux variability during three CIR-driven geomagnetic storms.\nJ. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/j.jastp.2008.06.007.\nLei, J., Thayer, J.P., Forbes, J.M., Sutton, E.K., Nerem, R.S., 2008. Rotating\nsolar coronal holes and periodic modulation of the upper atmo-\nsphere. Geophys. Res. Lett. 35, L10109.\nLiemohn, M.W., Chan, A.A., 2007. Unravelling the causes of radiation belt\nenhancements. EOS Trans. AGU 88 (42), 425–426.\nLindsay, G.M., Russell, C.T., Luhmann, J.G., 1995. Coronal mass ejection\nand stream interaction region characteristics and their potential\ngeomagnetic effectiveness. J. Geophys. Res. 100, 16999–17013.\nLyons, L.R., Zou, S., Heinselman, C.J., Nicolls, M.J., Anderson, P.C., 2009.\nPoker flat radar observations of the magnetosphere-ionosphere\ncoupling electrodynamics of the earthward penetrating plasma\nsheet following convection enhancements. J. Atoms. Sol.-Terr. Phys.,\nin press, doi:10.1016\/j.jastp.2008.09.025.\nMcPherron, R.L., Baker, D.N., Crooker, N.U., 2009. Role of the Russell–Mc-\nPherron effect in the acceleration of relativistic electrons. J. Atoms.\nSol.-Terr. Phys., this issue, doi:10.1016\/j.jastp.2008.11.002.\nMlynczak, M.G., Martin-Torres, F.J., Mertens, C.J., Marshall, B.T., Thomp-\nson, R.E., Kozyra, J.U., Remsberg, E.E., Gordley, L.L., Russell III, J.M.,\nWoods, T., 2008. Solar–terrestrial coupling evidenced by periodic\nbehavior in geomagnetic indexes and the infrared energy budget of\nthe thermosphere. Geophys. Res. Lett. 35, L05808.\nMorley, S.K., Rouillard, A.P., Freeman, M.P., 2009. Recurrent substorm\nactivity during the passage of a corotating interaction region.\nJ. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/j.jastp.2008.11.009.\nPahud, D.M., Rae, I.J., Mann, I.R., Murphy, K.R., Amalraj, V., 2009. Ground-\nbased Pc5 ULF wave power: solar wind speed and MLT dependence. J.\nAtoms. Sol.-Terr. Phys., this issue, doi:10.1016\/j.jastp.2008.12.004.\nReeves, G.D., 2008. Radiation Belt Storm Probes: a new mission for space\nweather forecasting. Space Weather 5, S11002.\nSandanger, M.I., Søraas, F., Sørbø, M., Aarsnes, K., Oksavik, K., Evans, D.S.,\n2009. Relativistic electron losses related to EMIC waves during CIR\nand CME storms. J. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/\nj.jastp.2008.07.006.\nARTICLE IN PRESS\nEditorial \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1011–1013 1013Snyder, C.W., Neugebauer, M., Rao, U.R., 1963. The solar wind velocity and\nits correlation with cosmic-ray variations and with solar and\ngeomagnetic activity. J. Geophys. Res. 68, 6361–6370.\nSørbø, M., Søraas, F., Sandanger, M.I., Evans, D.S., 2009. Ring current\nbehaviour during corotating interaction region and high speed\nstream events. J. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/\nj.jastp.2008.08.012.\nTemmer, M.B., Vrsˇnak, Veronig, A.M., 2007. Periodic appearance of\ncoronal holes and the related variation of solar wind parameters. Sol.\nPhys. 241, 371–383.\nThayer, J.P., Lei, J., Forbes, J.M., Sutton, E.K., Nerem, R.S., 2008. Thermo-\nspheric density oscillations due to periodic solar wind high-speed\nstreams. J. Geophys. Res. 113, A06307.\nTsurutani, B.T., Gonzalez, W.D., 1987. The cause of high-intensity long-\nduration continuous AE activity (HILDCAAs): interplanetary Alfve´n\nwave trains. Planet. Space Sci. 35, 405.\nTsurutani, B.T., McPherron, R.L., Gonzalez, W.D., Lu, G., Sobral, J.H.A.,\nGopalswamy, N., 2006. Introduction to special section on corotating\nsolar wind streams and recurrent geomagnetic activity. J. Geophys.\nRes. 111, A07S00.\nTurner, N.E., Mitchell, E.J., Knipp, D.J., Emery, B.A., 2006. Energetics of\nmagnetic storms driven by corotating interaction regions: a study of\ngeoeffectiveness. In: Tsurutani, B., McPherron, R.L., Gonzalez, W.D.,\nLu, G., Sobral, J.H.A., Gopalswamy, N. (Eds.), Recurrent Magnetic\nStorms: Corotating Solar Wind Streams. Geophysical Monograph\nSeries 167, AGU.\nTurner, N.E., Cramer, W.D., Earles, S.K., Emery, B.A., 2009. Geoefficiency\nand energy partitioning in CIR-driven and CME-driven storms.\nJ. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/j.jastp.2009.02.005.\nTurunen, E., Verronen, P.T., Seppa¨la¨, A., Rodger, C.J., Clilverd, M.A.,\nTamminen, J., Enell, C-F., Ulich, T., 2009. Impact of different energies\nof precipitating particles on NOx generation in the middle and upper\natmosphere during geomagnetic storms. J. Atoms. Sol.-Terr. Phys.,\nthis issue, doi:10.1016\/j.jastp.2008.07.005.\nWrenn, G.L., 2009. Chronology of ‘‘killer’’ electrons: solar cycles 22 and 23.\nJ. Atoms. Sol.-Terr. Phys., this issue, doi:10.1016\/j.jastp.2008.08.002.M.H. Denton\nDepartment of Communication Systems,\nLancaster University, Lancaster, UK\nE-mail address: m.denton@lancaster.ac.ukJ.E. Borovsky\nSpace Science and Applications,\nLos Alamos National Laboratory, Los Alamos, NM, USAR.B. Horne\nBritish Antarctic Survey,\nCambridge, UKR.L. McPherron\nIGPP, University of California at Los Angeles,\nLos Angeles, USAS.K. Morley\nUniversity of Newcastle,\nNewcastle, AustraliaB.T. Tsurutani\nJet Propulsion Laboratory,\nCalifornia Institute of Technology, Pasadena, CA, USA\nAvailable online 11 October 2008\n"}