{"doi":"10.1177\/1744935909340189","coreId":"197586","oai":"oai:lra.le.ac.uk:2381\/9837","identifiers":["oai:lra.le.ac.uk:2381\/9837","10.1177\/1744935909340189"],"title":"Invoking spirits in the material world: Spiritualism, surrealism, and spirituality at work","authors":["Corbett, J. Martin"],"enrichments":{"references":[{"id":43715835,"title":"Abyss of Reason: Cultural Movements, Revelations and Betrayals.","authors":[],"date":"1991","doi":null,"raw":"Cottom, D. 1991. Abyss of Reason: Cultural Movements, Revelations and Betrayals. Oxford: Oxford University Press.","cites":null},{"id":43715900,"title":"Alfred Russel Wallace, the origin of man, and spiritualism'.","authors":[],"date":"1974","doi":"10.1086\/351256","raw":"Kottler, M.J. 1974. Alfred Russel Wallace, the origin of man, and spiritualism'. Isis 65: 144-192.","cites":null},{"id":43715852,"title":"All for one: a parable of spirituality and organization.","authors":[],"date":"2003","doi":"10.1177\/135050840293014","raw":"Forray, J. M. and Stork, D. 2003. All for one: a parable of spirituality and organization. Organization 9: 497-509.","cites":null},{"id":43715921,"title":"Alternative spiritualities and the cultural logic of late Capitalism.","authors":[],"date":"2003","doi":"10.1080\/01438300302807","raw":"Possamai, A. 2003. Alternative spiritualities and the cultural logic of late Capitalism. Culture and Religion 4: 31-45.","cites":null},{"id":43715841,"title":"Anatomising Embodiment and Organisation Theory.","authors":[],"date":"2001","doi":"10.1057\/9780333993828","raw":"Dale. K. 2001. Anatomising Embodiment and Organisation Theory. London: Palgrave.","cites":null},{"id":43715847,"title":"Andrew Jackson Davis: prophet of American spiritualism.","authors":[],"date":"2007","doi":"10.2307\/1900318","raw":"Delp, R.W. 2007. Andrew Jackson Davis: prophet of American spiritualism. The Journal of American History 54: 43-56.","cites":null},{"id":43715832,"title":"Automatic Woman: The Representation of Woman in Surrealism. London:","authors":[],"date":"1996","doi":"10.2307\/3685723","raw":"Conley, K. 1996. Automatic Woman: The Representation of Woman in Surrealism. London: University of Nebraska Press.","cites":null},{"id":43715936,"title":"Can you train people to be spiritual?","authors":[],"date":"2000","doi":null,"raw":"Thompson, W.D. 2000. Can you train people to be spiritual? Training and Development 54: 18-19.","cites":null},{"id":43715851,"title":"Capturing the Heart of Leadership: Spirituality and Community in the New American Workplace.","authors":[],"date":"1997","doi":"10.5860\/choice.35-2205","raw":"Fairholm, G. 1997. Capturing the Heart of Leadership: Spirituality and Community in the New American Workplace. Westport, CT: Praeger Books.","cites":null},{"id":43715927,"title":"Conversations on Science, Culture and Time. Ann Arbor:","authors":[],"date":"1995","doi":null,"raw":"Serres, M. with Latour, B. 1995. Conversations on Science, Culture and Time. Ann Arbor: University of Chicago Press.","cites":null},{"id":43715925,"title":"Dali's surrealist activities and the model of scientific experimentation.","authors":[],"date":"2005","doi":null,"raw":"Ruffa, A, 2005. Dali's surrealist activities and the model of scientific experimentation. Papers of Surrealism 4: 1-14.","cites":null},{"id":43715899,"title":"Defining spirit at work: finding common ground.","authors":[],"date":"2004","doi":"10.1108\/09534810410511288","raw":"Kinjerski, V.M. and Skrypnek, B.J. 2004. Defining spirit at work: finding common ground. Journal of Organizational Change Management 17: 26-42.","cites":null},{"id":43715919,"title":"Defining spirituality of work.","authors":[],"date":"2003","doi":null,"raw":"Ottaway, R.N. 2003. Defining spirituality of work. International Journal of Value-based Management 16: 23-35.","cites":null},{"id":43715853,"title":"Discipline and Punish: The Birth of the Prison.","authors":[],"date":"1979","doi":"10.1215\/9780822390169-018","raw":"Foucault, M. 1979. Discipline and Punish: The Birth of the Prison. Harmondsworth: Penguin.","cites":null},{"id":43715849,"title":"Editorial. The Direct Voice: A Magazine Devoted to the Direct Voice and Other Phases of Psychic Phenomena,","authors":[],"date":"1930","doi":null,"raw":"Direct Voice 1930. Editorial. The Direct Voice: A Magazine Devoted to the Direct Voice and Other Phases of Psychic Phenomena, 1: 1-3.","cites":null},{"id":43715823,"title":"Electronic networks and subjectivity’.","authors":[],"date":"1999","doi":"10.1007\/978-1-349-27667-7_9","raw":"Brown, S.D. 1999. ‘Electronic networks and subjectivity’. In Cyberpsychology eds. A. GordoLopez and I. Parker. London: Macmillan.","cites":null},{"id":43715902,"title":"Gendering Emotion in Organizations. Houndmills:","authors":[],"date":"2007","doi":"10.1108\/17542410810849141","raw":"Lewis, P. and Simpson, R. 2007. Gendering Emotion in Organizations. Houndmills: Palgrave MacMillan.","cites":null},{"id":43715932,"title":"Ghostwriting Modernity.","authors":[],"date":"2001","doi":null,"raw":"Sword, H. 2001. Ghostwriting Modernity. Ithaca: Cornell University Press.","cites":null},{"id":43715815,"title":"Habits of the Heart. NewYork: Harper and Row.","authors":[],"date":"1985","doi":"10.1093\/sf\/64.3.802","raw":"Bellah, R. N., Madsen, R., Sullivan, W. M., Swidler, A. and Tipton, S. M. 1985. Habits of the Heart. NewYork: Harper and Row.","cites":null},{"id":43715844,"title":"Harmonious philosophy.","authors":[],"date":null,"doi":null,"raw":"Davis, A.J. 1857b. Harmonious philosophy. In Proceedings of the Free Convention. Boston: Kessington Books.","cites":null},{"id":43715926,"title":"Haunted Media: Electronic Presence from Telegraphy to Television. London:","authors":[],"date":"2000","doi":"10.2307\/2700521","raw":"Sconce, J. 2000. Haunted Media: Electronic Presence from Telegraphy to Television. London: Duke University Press.","cites":null},{"id":43715910,"title":"Hegemonic and marginalised educational utopias in the contemporary western world.","authors":[],"date":"2003","doi":"10.2304\/pfie.2003.1.3.2","raw":"Milojevic, I. 2003. Hegemonic and marginalised educational utopias in the contemporary western world. Policy Futures in Education 1: 440-466 Moxley, R. 2000. Leadership and Spirit: Breathing New Vitality and Energy into Individuals and Organizations. San Francisco: Jossey-Bass.","cites":null},{"id":43715933,"title":"Ideology and Illness. New Yreok:","authors":[],"date":"1970","doi":null,"raw":"Szasz, T. 1970. Ideology and Illness. New Yreok: Anchor Books.","cites":null},{"id":43715897,"title":"Le Livre des Médiums. Paris: Éditions Dervy.","authors":[],"date":null,"doi":null,"raw":"Kardec, A. 1857. Le Livre des Médiums. Paris: Éditions Dervy.","cites":null},{"id":43715937,"title":"Linking emotional intelligence, spirituality and workplace performance: definitions, models and ideas for research.","authors":[],"date":"2002","doi":"10.1108\/02683940210423114","raw":"Tischler, L., Biberman, J. and McKeage, R. 2002. Linking emotional intelligence, spirituality and workplace performance: definitions, models and ideas for research. Journal of Managerial Psychology 17: 203-17.","cites":null},{"id":43715908,"title":"London Dialectical Society 1871. Report on spiritualism: Of the committee of the London Dialectical Society, together with the evidence, oral and written, and a selection from the correspondence.","authors":[],"date":null,"doi":"10.1192\/bjp.17.80.578","raw":"London Dialectical Society 1871. Report on spiritualism: Of the committee of the London Dialectical Society, together with the evidence, oral and written, and a selection from the correspondence. London: J. Burns Publishers.","cites":null},{"id":43715864,"title":"Managing subjectivity and the dialectic of self-consciousness: Hegel and organisation theory.","authors":[],"date":"2001","doi":"10.1177\/135050840184002","raw":"Hancock, P. and Tyler, M. 2001. Managing subjectivity and the dialectic of self-consciousness: Hegel and organisation theory. Organisation 8: 564-586.","cites":null},{"id":43715819,"title":"Manifestoes of Surrealism. Ann Arbor:","authors":[],"date":"1969","doi":"10.3998\/mpub.7558","raw":"Breton, A. 1969. Manifestoes of Surrealism. Ann Arbor: University of Michigan Press.","cites":null},{"id":43715846,"title":"Marx and Engels on spirituality and theosophy.","authors":[],"date":"1992","doi":null,"raw":"de Tollenaere, H.A.O. 1992. Marx and Engels on spirituality and theosophy. Theosophical History 4: 45-49.","cites":null},{"id":43715909,"title":"Modernist Alchemy: Poetry and the Occult.","authors":[],"date":"1995","doi":"10.2307\/3736537","raw":"Materer, T. 1995. Modernist Alchemy: Poetry and the Occult. Ithaca: Cornell Univerity Press.","cites":null},{"id":43715813,"title":"Modernity and Ambivalence. Cambridge:","authors":[],"date":"1991","doi":"10.2307\/2075516","raw":"Bauman, Z. 1991. Modernity and Ambivalence. Cambridge: Cambridge University Press.","cites":null},{"id":43715903,"title":"Modest recording instruments: science, surrealism and visuality.","authors":[],"date":"2004","doi":"10.1111\/j.0141-6790.2004.444_8_8.x","raw":"Lomas, D. 2004. Modest recording instruments: science, surrealism and visuality. Art History 27: 627-650.","cites":null},{"id":43715906,"title":"New Age Capitalism.","authors":[],"date":"2000","doi":"10.2307\/1500198","raw":"Lau, K. 2000. New Age Capitalism. Philadelphia: University of Philadelphia Press.","cites":null},{"id":43715924,"title":"New Traditions","authors":[],"date":"1992","doi":null,"raw":"Renesch, J. 1992. New Traditions in Business: Spirit and Leadership in the 21st Century. San Francisco: Berrett-Koehler Publishers.","cites":null},{"id":43715822,"title":"Nineteenth Century Miracles: Spirits and their","authors":[],"date":null,"doi":"10.1057\/9781137378941.0011","raw":"Britten, E.H. 1884. Nineteenth Century Miracles: Spirits and their Work in Every Country of the Earth. New York: William Britten.","cites":null},{"id":43715830,"title":"Organisation theory as a post-modern science.","authors":[],"date":"2003","doi":null,"raw":"Chia, R. 2003. Organisation theory as a post-modern science. In The Oxford Handbook of Organisation Theory eds. H. Tsoukas and C. Knudsen. Oxford: Oxford University Press.","cites":null},{"id":43715901,"title":"Point-counterpoint: measuring workplace spirituality.","authors":[],"date":"2003","doi":"10.1108\/09534810310484154","raw":"Krahnke, K., Giacalone, R. and Jurkiewicz, C. 2003. Point-counterpoint: measuring workplace spirituality. Journal of Organizational Change Management 16: 396-405.","cites":null},{"id":43715817,"title":"Radical Spirits: Spiritualism and Women's Rights in Nineteenth-Century America.","authors":[],"date":"2001","doi":"10.2307\/25143537","raw":"Braude, A. 2001. Radical Spirits: Spiritualism and Women's Rights in Nineteenth-Century America. Bloomington: Indiana University Press.","cites":null},{"id":43715865,"title":"Reawakening the Spirit in Work: The Power of Dharmic Management. San Francisco:","authors":[],"date":"1993","doi":null,"raw":"Hawley, J. 1993. Reawakening the Spirit in Work: The Power of Dharmic Management. San Francisco: Berrett-Koehler Publishers.","cites":null},{"id":43715947,"title":"Regulating Bodies.","authors":[],"date":"1992","doi":"10.4324\/9780203214183","raw":"Turner, B. 1992. Regulating Bodies. London: Routledge.","cites":null},{"id":43715825,"title":"Signs of the future: critical reflections on the instrumentality of workplace spirituality. Paper presented at SCOS XXV 'Signs of the Future', Faculty of Economics,","authors":[],"date":"2007","doi":null,"raw":"Case, P. and Gosling, J. 2007. Signs of the future: critical reflections on the instrumentality of workplace spirituality. Paper presented at SCOS XXV 'Signs of the Future', Faculty of Economics, University of Ljubljana, Slovenia, 1st -4th July.","cites":null},{"id":43715850,"title":"Software develoment as spiritual metaphor.","authors":[],"date":"2004","doi":"10.1109\/istas.2004.1314327","raw":"Epstein, R.G. 2004. Software develoment as spiritual metaphor. Proceedings of the 2004 International Symposium on Technology and Society, 17-19th June, Massachusetts.","cites":null},{"id":43715848,"title":"Spectres of Marx.","authors":[],"date":"1994","doi":"10.1057\/9780230374812_6","raw":"Derrida, J. 1994. Spectres of Marx. London: Routledge.","cites":null},{"id":43715831,"title":"Spirit at Work: Discovering the Spirituality in Leadership.","authors":[],"date":"1994","doi":"10.1177\/107179199500200218","raw":"Conger, J. 1994. Spirit at Work: Discovering the Spirituality in Leadership. San Francisco: Jossey-Bass.","cites":null},{"id":43715946,"title":"Spirited sexuality: sex, marriage, and Victorian spiritualism.","authors":[],"date":"2003","doi":"10.1017\/s1060150303000044","raw":"Tromp, M. 2003. Spirited sexuality: sex, marriage, and Victorian spiritualism. Victorian Literature and Culture 16: 67-81.","cites":null},{"id":43715863,"title":"Spirits in the material world: spiritualism and identity in the fin de siècle.","authors":[],"date":"2007","doi":"10.1017\/s1060150307051480","raw":"Gomel, E. 2007. Spirits in the material world: spiritualism and identity in the fin de siècle. Victorian Literature and Culture 35: 189-213.","cites":null},{"id":43715929,"title":"Spiritual computing: a convergence of ancient wisdom and modern tools.","authors":[],"date":"2007","doi":null,"raw":"Smith, C.W. 2007. Spiritual computing: a convergence of ancient wisdom and modern tools. Spiritual Computing – The Mindfulness\/Technology Dialogue.","cites":null},{"id":43715904,"title":"Spiritualism and the mid-Victorian crisis of evidence.","authors":[],"date":"2004","doi":"10.1017\/s0018246x04004030","raw":"Lamont, P. 2004. Spiritualism and the mid-Victorian crisis of evidence. The Historical Journal 47: 897-920.","cites":null},{"id":43715824,"title":"Spiritualism in Antebellum America.","authors":[],"date":"1997","doi":"10.2307\/3170167","raw":"Carroll, B.E. 1997. Spiritualism in Antebellum America. Bloomington: Indiana University Press.","cites":null},{"id":43715870,"title":"Spiritualism, Its History, Phenomena and Doctrine.","authors":[],"date":"1910","doi":"10.1017\/s0017816000013031","raw":"Hill, J.A. 1910. Spiritualism, Its History, Phenomena and Doctrine. NewYork: Doran.","cites":null},{"id":43715867,"title":"Spiritualities of Life: New Age Romanticism and Consumptive Capitalism.","authors":[],"date":"2008","doi":"10.1111\/j.1748-0922.2008.00316.x","raw":"Heelas, P. 2008. Spiritualities of Life: New Age Romanticism and Consumptive Capitalism. Oxford: Blackwell.","cites":null},{"id":43715812,"title":"Spirituality at work: a conceptualisation and measure.","authors":[],"date":"2000","doi":"10.1177\/105649260092008","raw":"Ashmos, D.P. and Duchon, D. 2000. Spirituality at work: a conceptualisation and measure. Journal of Management Inquiry 9: 134-45.","cites":null},{"id":43715827,"title":"Spirituality for managers: context and critique.","authors":[],"date":"1999","doi":"10.1108\/09534819910273793","raw":"Cavanagh, G.T. 1999. Spirituality for managers: context and critique. Journal of Organizational Change Management 12: 186-199.","cites":null},{"id":43715816,"title":"Surreal Lives.","authors":[],"date":"1999","doi":null,"raw":"Brandon, R. 1999. Surreal Lives. New York: Grove Press.","cites":null},{"id":43715862,"title":"Surrealism before Freud: dynamic psychiatry's &quot;simple recording instrument''.","authors":[],"date":"1987","doi":"10.2307\/776843","raw":"Gibson, J. 1987. Surrealism before Freud: dynamic psychiatry's &quot;simple recording instrument''. Art Journal 46: 56-60.","cites":null},{"id":43715922,"title":"Taking dictation: collage poetics, pathology, and politics.","authors":[],"date":"1998","doi":"10.1353\/mod.1998.0043","raw":"Rainey, L. 1998. Taking dictation: collage poetics, pathology, and politics. Modernism\/Modernity 5: 123-153.","cites":null},{"id":43715857,"title":"Technologies of the Self: A Seminar with Michel Foucault.","authors":[],"date":"1988","doi":"10.5860\/choice.26-2084","raw":"Foucault, M. 1988. Technologies of the Self: A Seminar with Michel Foucault. London: Tavistock.","cites":null},{"id":43715842,"title":"The artist as revealed in surrealist experiment. This Quarter","authors":[],"date":"1932","doi":null,"raw":"Dalí, S. 1932. The artist as revealed in surrealist experiment. This Quarter September: 197-207.","cites":null},{"id":43715935,"title":"The automatic hand: spiritualism, psychoanalysis, surrealism. Invisible Culture: An Electronic","authors":[],"date":"2004","doi":null,"raw":"Thompson, R.L. 2004. The automatic hand: spiritualism, psychoanalysis, surrealism. Invisible Culture: An Electronic Journal for Visual Culture 7: 1-18.","cites":null},{"id":43715928,"title":"The Body and Social Theory.","authors":[],"date":"1993","doi":"10.4135\/9781473914810","raw":"Shilling, C. 1993. The Body and Social Theory. London: Sage.","cites":null},{"id":43715869,"title":"The Corporate Mystic: A Guidebook for Visionaries with their Feet on the Ground.","authors":[],"date":"1996","doi":null,"raw":"Hendricks, G. and Ludeman, K. 1996. The Corporate Mystic: A Guidebook for Visionaries with their Feet on the Ground. New York: Bantam Books.","cites":null},{"id":43715920,"title":"The Darkened Room: Women, Power, and Spiritualism in Late Victorian England. Pennsylvania:","authors":[],"date":"1990","doi":"10.2307\/25130282","raw":"Owen, A. 1990. The Darkened Room: Women, Power, and Spiritualism in Late Victorian England. Pennsylvania: University of Pennsylvania Press.","cites":null},{"id":43715911,"title":"The discourses of corporate spiritualism and evangelical capitalism.","authors":[],"date":"1999","doi":"10.1177\/0893318999131001","raw":"Nadesan, M. H. 1999. The discourses of corporate spiritualism and evangelical capitalism. Management Communication Quarterly 13: 3-42.","cites":null},{"id":43715814,"title":"The elevation of work: pastoral power and the new age work ethic.","authors":[],"date":"2003","doi":"10.1177\/1350508403010002009","raw":"Bell, E. and Taylor, S. 2003. The elevation of work: pastoral power and the new age work ethic. Organization 10: 329-349.","cites":null},{"id":43715934,"title":"The Ethics of Authenticity.","authors":[],"date":"1991","doi":"10.1177\/019145379502100106","raw":"Taylor, C. 1991. The Ethics of Authenticity. Cambridge, MA: Harvard University Press.","cites":null},{"id":43715872,"title":"The Fox sisters and American spiritualism.","authors":[],"date":"1983","doi":null,"raw":"Isaacs, E. 1983. The Fox sisters and American spiritualism. In The Occult in America: New Historical Perspectives eds. H. Kerr and C.L. Crow. Chicago: University of Illinois Press.","cites":null},{"id":43715833,"title":"The machine in the ghost: spiritualism, technology, and the &quot;direct voice&quot;.","authors":[],"date":"1999","doi":"10.1057\/9780230374812_10","raw":"Connor, S. 1999. The machine in the ghost: spiritualism, technology, and the &quot;direct voice&quot;. In Ghosts: Deconstruction, Psychoanalysis, History eds. P. Buse and A. Stott. Basingstoke: MacMillan.","cites":null},{"id":43715843,"title":"The Magic Staff: An Autobiography of Andrew Jackson Davis.","authors":[],"date":"2003","doi":null,"raw":"Davis, A.J. 1857a. The Magic Staff: An Autobiography of Andrew Jackson Davis. Boston: Kessington Books (reprinted 2003).","cites":null},{"id":43715923,"title":"The Mass Psychology of Fascism. NewYork:","authors":[],"date":"1946","doi":null,"raw":"Reich, W. 1946. The Mass Psychology of Fascism. NewYork: Orgone Institute Press.","cites":null},{"id":43715820,"title":"The mediums enter .","authors":[],"date":"1996","doi":null,"raw":"Breton, A. 1996. The mediums enter . In The Lost Steps ed. A. Breton. Lincoln: University of Nebraska Press.","cites":null},{"id":43715829,"title":"The muse and the electronic invocator'.","authors":[],"date":"2006","doi":null,"raw":"Chesher, C. 2006. 'The muse and the electronic invocator'. In Technologies of Magic: A Cultural Study of Ghosts, Machines and the Uncanny. Eds. J. Potts and E. Scheer. Sydney: Power Publications.","cites":null},{"id":43715866,"title":"The New Age Movement. The Celebration of the the Self and Sacralization of Modernity.","authors":[],"date":"1996","doi":"10.2307\/3711817","raw":"Heelas, P. 1996. The New Age Movement. The Celebration of the the Self and Sacralization of Modernity. Oxford: Blackwell.","cites":null},{"id":43715918,"title":"The Other World. Cambridge:","authors":[],"date":"1985","doi":"10.1017\/s0033291700012216","raw":"Oppenheim, J. 1985. The Other World. Cambridge: Cambridge University Press.","cites":null},{"id":43715907,"title":"The Politics Of Surrealism.","authors":[],"date":"1988","doi":"10.2307\/2162794","raw":"Lewis, H. 1988. The Politics Of Surrealism. New York: Paragon House.","cites":null},{"id":43715912,"title":"The Search for Meaning in the Workplace.","authors":[],"date":"1996","doi":null,"raw":"Naylor, T.H., Willimon, W.H. and Osterberg, R. 1996. The Search for Meaning in the Workplace. Nashville, TN: Abington Press Neck, C. and Milliman, J.F. 1994. Thought self-leadership: finding spiritual fulfillment on organizational life. Journal of Managerial Psychology 9: 9-16.","cites":null},{"id":43715828,"title":"The Soul of a Business: Managing for Profit and the Common Good.","authors":[],"date":"1993","doi":null,"raw":"Chappell, T. 1993. The Soul of a Business: Managing for Profit and the Common Good. New York: Bantam Books.","cites":null},{"id":43715868,"title":"The Spiritual Revolution: Why Religion is Giving Way to Spirituality.","authors":[],"date":"2005","doi":"10.1558\/firn.v1i2.200","raw":"Heelas, P. and Woodhead, L. 2005. The Spiritual Revolution: Why Religion is Giving Way to Spirituality. Oxford: Blackwell.","cites":null},{"id":43715855,"title":"The subject and power'.","authors":[],"date":"1982","doi":"10.1086\/448181","raw":"Foucault, M. 1982. 'The subject and power'. In Michel Foucault: Beyond Structuralism and Hermeneutics eds. H.I. Dreyfus and P. Rabinow. New York: Harvester Wheatsheaf.","cites":null},{"id":43715930,"title":"The virtualization of the organizational subject.","authors":[],"date":"1998","doi":null,"raw":"Sotto, R. 1998. The virtualization of the organizational subject. In Organized Worlds: Explorations in Technology and Organization with Robert Cooper ed. R. Chia. London: Routledge.","cites":null},{"id":43715818,"title":"Tournesol [Sunflower].","authors":[],"date":"1924","doi":null,"raw":"Breton, A. 1924. Tournesol [Sunflower]. In Oeuvres Complêtes, Volume 1. ed. A. Breton. Paris: Gillimard.","cites":null},{"id":43715860,"title":"Toward a science of workplace spirituality.","authors":[],"date":"2003","doi":"10.1108\/09534810310484154","raw":"Giacalone, R.A. and Jurkiewicz, C.L. 2003. Toward a science of workplace spirituality. In Handbook of Workplace Spirituality and Organizational Performance eds. R.A. Giacalone and C.L. Jurkiewicz. New York: M.E.Sharpe Publishing.","cites":null},{"id":43715834,"title":"Towards neuroscientific management?: geometric chronophotography and the thin-slicing of the labouring body.","authors":[],"date":"2008","doi":"10.1177\/1744935908092134","raw":"Corbett, J.M. 2008. Towards neuroscientific management?: geometric chronophotography and the thin-slicing of the labouring body. Management and Organizational History 3: 107-125.","cites":null},{"id":43715931,"title":"Tying the knot: skill, judgement and authority in the 1870s Leipzig spiritist experiments.","authors":[],"date":"2001","doi":"10.1017\/s0007087401004307","raw":"Staubermann, K.B. 2001. Tying the knot: skill, judgement and authority in the 1870s Leipzig spiritist experiments. British Journal for the History of Science 34: 67-79.","cites":null},{"id":43715905,"title":"We Have Never Been Modern.","authors":[],"date":"1993","doi":"10.15750\/chss..33.200908.009","raw":"Latour, B. 1993. We Have Never Been Modern. Cambridge, MA: Harvard University Press.","cites":null},{"id":43715859,"title":"Western Spirituality: Historical Roots, Ecumenical Routes. Santa Fe: Bear and Company.","authors":[],"date":"1981","doi":null,"raw":"Fox, M. 1981. Western Spirituality: Historical Roots, Ecumenical Routes. Santa Fe: Bear and Company.","cites":null},{"id":43715821,"title":"Western Union Telegraph Company, 1851-1901: A Retrospect.","authors":[],"date":"1901","doi":null,"raw":"Brewer, A.R. 1901. Western Union Telegraph Company, 1851-1901: A Retrospect. New York: Western Union Telegraph Company.","cites":null},{"id":43715875,"title":"What is a crypto-utopia and why does it matter?","authors":[],"date":"2002","doi":"10.1111\/j.1467-954x.2002.tb03577.x","raw":"Jaques, R.S. 2002. What is a crypto-utopia and why does it matter? In Utopia and Organisation ed. M. Parker. London: Blackwell Books.","cites":null},{"id":43715845,"title":"William Crookes and the fourth state of matter'","authors":[],"date":"1976","doi":"10.1086\/351544","raw":"De Kosky, R.K. 1976. William Crookes and the fourth state of matter' Isis, 67: 36-60.","cites":null},{"id":43715898,"title":"Women and Spirituality: Voices of Protest and Promise. Houndmills:","authors":[],"date":"1993","doi":"10.1007\/978-1-349-22844-7_2","raw":"King U. 1993. Women and Spirituality: Voices of Protest and Promise. Houndmills: Palgrave Macmillan.","cites":null},{"id":43715826,"title":"Work, Self and Society: After Industrialism. London: Routledge Casey,","authors":[],"date":"1995","doi":"10.4324\/9780203444993","raw":"Casey, C. 1995. Work, Self and Society: After Industrialism. London: Routledge Casey, C. 2002. Critical Analysis of Organizations: Theory, Practice and Revitalization. London: Sage.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2009","abstract":"This paper considers the recent upsurge of interest in workplace spirituality through an analysis of three cultural movements – late nineteenth century spiritualism, early twentieth century surrealism, and late twentieth\/early twenty-first century 'spirituality at work'. These movements share a common interest in harnessing the power of the human spirit in the transformation and 'betterment' of social life. It is argued that these movements have successively adopted and de-radicalised invocations of the spirit world such that the proto-feminism and utopianism of spiritualism and the revolutionary pretensions of surrealism have been usurped by a strongly managerialist discourse of workplace spirituality. The paper ends with a consideration of the implications of these developments for the critical study of spirituality, management and organisation.Peer-reviewedPost-prin","downloadUrl":"http:\/\/hdl.handle.net\/2381\/9837","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/9837\/3\/CORBETT_%20Resubmission%20to%20MOH_re%20formatted.pdf","pdfHashValue":"f9dcda7d4106bf6f35dc9f0c05c33e483cd99518","publisher":"Sage","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/9837<\/identifier><datestamp>\n                2011-11-10T02:01:52Z<\/datestamp><setSpec>\n                com_2381_322<\/setSpec><setSpec>\n                com_2381_9551<\/setSpec><setSpec>\n                col_2381_512<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nInvoking spirits in the material world: Spiritualism, surrealism, and spirituality at work<\/dc:title><dc:creator>\nCorbett, J. Martin<\/dc:creator><dc:subject>\nspirituality<\/dc:subject><dc:subject>\nsurrealism<\/dc:subject><dc:subject>\nspiritualism<\/dc:subject><dc:subject>\ninvocation<\/dc:subject><dc:subject>\ntechnology<\/dc:subject><dc:subject>\nmaterialism<\/dc:subject><dc:description>\nThis paper considers the recent upsurge of interest in workplace spirituality through an analysis of three cultural movements – late nineteenth century spiritualism, early twentieth century surrealism, and late twentieth\/early twenty-first century 'spirituality at work'. These movements share a common interest in harnessing the power of the human spirit in the transformation and 'betterment' of social life. It is argued that these movements have successively adopted and de-radicalised invocations of the spirit world such that the proto-feminism and utopianism of spiritualism and the revolutionary pretensions of surrealism have been usurped by a strongly managerialist discourse of workplace spirituality. The paper ends with a consideration of the implications of these developments for the critical study of spirituality, management and organisation.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPost-print<\/dc:description><dc:date>\n2011-11-09T10:08:40Z<\/dc:date><dc:date>\n2011-11-09T10:08:40Z<\/dc:date><dc:date>\n2009<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nManagement & Organizational History, 2009, 4(4), pp. 339–357.<\/dc:identifier><dc:identifier>\n1744-9359<\/dc:identifier><dc:identifier>\nhttp:\/\/moh.sagepub.com\/<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/9837<\/dc:identifier><dc:identifier>\n10.1177\/1744935909340189<\/dc:identifier><dc:identifier>\n1744-9367<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\n© SAGE 2009. Deposited with reference to the publisher's self-archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nSage<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1744-9367","issn:1744-9359","1744-9359","1744-9367"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["spirituality","surrealism","spiritualism","invocation","technology","materialism"],"subject":["Article"],"fullText":" 1 \nInvoking spirits in the material world: spiritualism, surrealism, and spirituality at work \n \nJ. Martin Corbett         University of Warwick  \n \nAbstract \nThis paper considers the recent upsurge of interest in workplace spirituality through an analysis of \nthree cultural movements – late nineteenth century spiritualism, early twentieth century surrealism, \nand late twentieth\/early twenty-first century 'spirituality at work'. These movements share a \ncommon interest in harnessing the power of the human spirit in the transformation and 'betterment' \nof social life. It is argued that these movements have successively adopted and de-radicalised \ninvocations of the spirit world such that the proto-feminism and utopianism of spiritualism and the \nrevolutionary pretensions of surrealism have been usurped by a strongly managerialist discourse of \nworkplace spirituality. The paper ends with a consideration of the implications of these \ndevelopments for the critical study of spirituality, management and organisation. \n \n------------------------------------------------------------------------------------------------------------------- \nKey words  ●  spirituality  ●  surrealism  ●  spiritualism  ●  invocation  ●  technology  ●  materialism \n------------------------------------------------------------------------------------------------------------------- \n \nIntroduction  \n \nSpiritualism: a cultural movement devoted to communication between living persons and those \nwho had passed to the Other Side, or \"Summerland\". \nSurrealism: a cultural movement devoted to communication between the human spirit and the \nworld beyond the façade of reality.  \nSpirituality at work: a cultural movement devoted to the promotion of spirituality in the \nworkplace. \n \n Since the 1990s there has been a noticeable upsurge in both managerial and scholarly \ninterest in workplace spirituality. Major business corporations such as Apple, Ford and Shell Oil \nhave shown a keen interest in harnessing the power of the spiritual to achieve material gains in \n 2 \nemployee performance, and academic journals regularly publish special issues and individual \npapers on workplace spirituality. However, as Case and Gosling (2007) observe, much of the \ncontemporary literature on spirituality is ahistorical, apolitical, narrowly utilitarian and \ninstrumental, and seemingly more concerned with commodifying spirituality than analysing its \nprovenance or trajectory.  \n This paper attempts to understand workplace spirituality through an analysis of two \ncultural movements – late nineteenth century spiritualism and early twentieth century surrealism \n– which, along with the spirituality at work movement, share a common interest in harnessing the \npower of the human spirit in the transformation and 'betterment' of social life. At first sight it may \nseem preposterous to argue that these three movements have much in common. Spiritualism \nconjures up images of séances, Ouija boards, and ghosts; surrealism is associated with strange \nworks of art and revolution; spirituality at work with new age management ideas and practices. I \ndo not deny their radical differences in terms of organisation, strategy or intellectual pretensions, \nbut their similarities are not merely alliterative. All three are quite literally 'movements' as, in \nlocating themselves in-between the extant social world and a desired future social world, they \neach profess to offer the means for followers to move from the flawed present to a more perfect \nworld. Each share a belief in the important role played by the medium or seer in the invocation of \na power outside ordinary perception and action for assistance or guidance; the key role of non-\nconscious action or automatism in achieving personal enlightenment and the transformation of \nsocial organisation; and an opposition to, and yet fatal fascination with, the established \ninstitutions and technologies of authority.  \n In teasing out such commonalities, I hope to illustrate how the invocation of an \nimmaterial, spiritual world has served as a means to criticise the materiality of the here-and-how \nand to promote social change. I also want to show how the proto-feminism of spiritualism and the \nrevolutionary pretensions of surrealism have been usurped by the managerialist discourse of \nworkplace spirituality in which the medium is the CEO, the perfect future state is the happy \ncorporation, and technology is the new Messiah. The paper ends with a consideration of the \nimplications of these developments for harnessing the power of the spiritual to achieve social \nreform or even radical change within organisations.  \n \n \n 3 \nSpiritualism (c. 1850 – 1920) \n \n Spiritualism probably first came to public attention in 1848 following the well publicised \nexperiences of Kate and Margaret Fox at Hydesville, and later at Rochester, in New York State \n(Isaacs, 1983). The sisters claimed to have been contacted by the spirit of a murdered peddler \nwho communicated to them through a series of audible rapping sounds emanating from a table. \nKate and Margaret were adopted by Quakers and it wasn't long before their experiences inspired \na whole generation of US social reformers who had grown disenchanted with the views held by \nestablished churches on a range of issues including slavery and women's rights (Carroll, 1997). \nThe Fox sisters toured the US showing off their prowess as mediums (between this world and the \nafterlife) through the holding of séances and demonstrations of automatic writing. Within ten \nyears, mediums were performing in theatres throughout the US, and séances were regularly held \nin many middle and upper class households. In 1852, spiritualism took root in Europe as a \nnumber of American mediums crossed the Atlantic to hold public séances. It would seem that \nwithin a year séances in the UK became extremely popular household activities, with table –\nturning and levitation, along with automatic writing, vying for the most popular means through \nwhich spirits communicated with the living (Britten, 1884). On both sides of the Atlantic \nmediums were keen to prove their psychic abilities, and it wasn't long before spiritualism \nattracted the serious, and highly skeptical, attention of the scientific community. \n In 1851, the Fox sisters were examined by medical physicians from the University of \nBuffalo who concluded that the 'Rochester rappings' were simply the cracking of the girls' toe \njoints against a table. In Paris, table-turning and rappings were investigated by Count Agenor de \nGasparin who concluded (in an 1854 monograph entitled 'Des tables tournantes') that the \nphenomena were caused by some physical force of the human body. However, other scientists \ntook such phenomena more seriously and urged their colleagues to undertake a thorough and \nsystematic investigation of the power of the medium. Some of the most eminent names in late \nnineteenth century science – the chemist William Crookes; the physiologists Jules-Etienne \nMarey, Wilhem Wundt, and Gustav Fechner; the naturalist Alfred Russell Wallace; the \npsychologist William James; and the physicist, Karl Zollner,– rallied to the call, and armed \nthemselves with the latest technologies and scientific instruments in their efforts to observe and \nmeasure the unseen spiritual forces emanating from spiritual mediums (see Kottler, 1974; De \n 4 \nKosky, 1976; Staubermann, 2001; and Lamont, 2004). Unlike the mediums invocation of spirits, \nthese scientists invoked the power of natural laws, technical measurement and scientific \nexperimentation to establish the 'truth'. \n However, numerous problems confronted the experimental scientific study of \nmediumship. First, by the 1860s, a number of fraudulent mediums had been exposed. How could \nscientists be sure that they hadn't been deceived by sleight of hand? In the aftermath of Karl \nZollner's experiments on the medium Harold Slade at Leipzig University, a heated debate ensued \nbetween Wundt, Fechner and Zollner concerning the nature and validity of scientific authority. \nWundt argued that Slade, rather than Zollner, was actually in control of the experiment. He \nargued further that the ability to reduce the experimenter to the role of passive spectator, whilst \ngiving the illusion that the experimenter's authority was maintained, was one of the key \npsychological skills of a medium (Oppenheim, 1985). Later experiments on mediums employed \nelaborate technical props to protect against such influences. Mediums were often tied and gagged \nunder the blaze of bright lights in bare rooms, intimately searched, photographed from a variety \nof angles, and required to comply absolutely with the orders of the skeptical experimenters in \nrooms within which the medium had never previously been present. Often complex measuring \ndevices were attached to the mediums' arms to measure pulse rate and bodily movement. If a \ntable was used this too would be festooned with measuring devices. Nevertheless, some \nspiritualist phenomena occurred which could not be ascribed to trickery or suggestion by those \npresent. In 1871, a report by a committee appointed by the London Dialectical Society concluded \nthat \"motion may be produced in solid bodies without material contact, by some hitherto \nunrecognised force operating within an undefined distance from the human organism and beyond \nthe range of muscular action\" and that \"this force is frequently directed by intelligence\" (p. 8). In \n1882, the Society for Psychical Research was established in Cambridge, England, to continue the \nscientific study of psychic and spiritual phenomena. The Society still flourishes today and \nresearchers continue to employ sophisticated technological apparatus (e.g. Faraday cages) in their \nsearch for a material basis of spirit. Popular interest in spiritualism would still seem to be fairly \nwidespread. Ouija automatic writing boards – which work through the movement of a miniature \ntable on wheels, a planchette, across a board – remain popular with over seven million unit sales \nin the US since 1980.  \n 5 \n When reading the history of the Spiritualist movement it is easy to overlook its social \nreformist agenda and philosophy. The historian Robert Delp (2007) suggests that two strands of \nspiritualism co-existed in the US in the second half of the nineteenth century. 'Phenomenal \nspiritualism' was the strand centred around public séances and performances of table-turning and \nautomatic writing; the other was 'philosophical spiritualism' which concerned itself more with \nestablishing a firm philosophical understanding and strategic utilisation of such phenomena. A \nkey figure in the development of philosophical spiritualism was Andrew Jackson Davis (1826- \n1910) whose most famous, and best-selling, work - The Principles of Nature, Her Divine \nRevelations and a Voice to Mankind - was apparently dictated to him by the spirits of Galen and \nEmanuel Swedenborg whilst he was in a trance (Davis, 1857a). This highly influential book \noutlined the three core beliefs shared by philosophical spiritualists. These were: \na. Humans can communicate with spirits; \nb. Spirits are 'more advanced' than humans and can progress through successively higher \nspheres of knowledge and perfection (with 'Summerland' being the sixth and highest \nplane);  \nc. Spirits are capable of providing knowledge about moral and ethical issues and can \nactively contribute to the betterment of human society. \n According to Delp (2007), Davis saw no antagonism between these beliefs and the \ntransformation of society championed by abolitionists, feminists, vegetarians, peace devotees, \nand child protection campaigners, and he regularly toured the reformist conference circuit with \nsuch campaigners. Davis made the links explicit in his presentation to the 1857 Free Convention \nheld in Vermont when he told delegates: \n\"Spiritualism is a broad and glorious triumphant archway leading in all directions into \nfreedom, and a universal enjoyment of a heaven in the world\" (1857b: 147). \nIndeed, spiritualist journals and magazines in the US gave much attention to social reform, with \narticles criticising social injustices and inequities appearing regularly in the pages of Herald of \nProgress, Sunflower, Spirit Messenger, Banner of Light, and Carrier Dove. The utopian socialist \nwritings of Charles Fourier and Robert Owen were also heavily influenced by spiritualist beliefs. \nMarx and Engels, on the other hand, were far less impressed (de Tollenaere, 1992) although, \nmore recently, scholars have argued that nineteenth century spiritualism sowed the seed of radical \nchange through its promotion of \"rebellion against death and rebellion against authority\" (Braude, \n 6 \n2001: 2). Sword (2001) has also shown that many nineteenth century spiritualist texts embodied \nthe experimental ideas of the radical and avant-garde. \n \n \nSurrealism (c. 1920 – 1966) \n \n The term 'surrealism' was first coined by Guillaume Appolinaire in 1917 for the \nprogramme notes for the avant-garde ballet, Parade (Twaine, 1967), but was to reach greater \npublic awareness seven years later with the publication of André Breton's First Manifesto of \nSurrealism. In this work, surrealism is defined as the liberation of the human spirit through the \ndestruction of bourgeois capitalist society. Breton had trained in medicine and psychiatry, and \nwas heavily influenced by the ideas of Sigmund Freud on the unconscious. After serving as a \npsychoanalyst in the treatment of shell-shocked troops during the First World War, Breton \nreturned to Paris and became involved with the dada movement. However, it wasn't long before \nhis interests turned to the spiritualist writings of Frederic Myers (co-founder of the Society for \nPsychical Research) and the psychologist Theodore Flournoy, and particularly to the practice of \nautomatic writing. This led him to argue that such practices may offer a better means of bringing \nabout social change and spiritual liberation than the Dadaist's artist subversions of cultural values.  \n In 1922-3, Breton held regular séances and sessions of automatic writing, referring to \nthem as experiments in 'psychic automatism'. A photograph taken by Man Ray entitled Waking \nDream Séance, published in the magazine La Revolution Surrealiste in December 1924, captures \none such experiment. The day before this picture was taken, one of the participants, Robert \nDesnos, entered into a trance and became convinced he was possessed by the spirit of Rrose \nSelavy (Duchamp's alter ego) who channelled her voice through his inert body. During yet \nanother séance, several members of the surrealist group were discovered inside a wardrobe in the \nmidst of a collective suicide attempt (Brandon, 1999). We also know from Breton's own writings \nthat the group held experiments during which they attempted to converse with the dead in an \neffort to prophesize the future (Breton, 1996). \n Despite such activities, Breton and the surrealists were keen to distance themselves from \nthe revival of spiritualist beliefs and practices occasioned by the death and horror of World War \nOne. Yet, as Thompson (2004) argues \"like spiritualist automatism, psychic automatism \n 7 \nfunctioned as a technique for producing creatively fertile psychic dissociation and communion \nwith a kind of force that seemed radically other. No longer authors, no longer the originators of \ndiscourse, Surrealist practitioners envisioned themselves as conduits for a kind of magical \ndictation, as modest recording instruments\" (p.6-7). If, for spiritualists, the radical other-world of \nthe spirits was exterior to the human body and mind (in 'Summerland'); for surrealists, this radical \nother-world was an interior force located deep in the unconscious. The surrealists celebrated the \nunconscious – and particularly unconscious desire - as a liberating force, as an escape from the \nalienating pressures of the rational world. The rationality of western culture, confessed Breton, \n\"clearly seems to me to be hostile to any intellectual or moral advancement\" (Breton 1969:6). \nThe objective of surrealism was therefore less of a fusion of the spiritual and the material than a \ndeliberate confusion of the unconventional and subjective world of the unconscious with the \ndeadening logic and rationality of the real material world. Breton offered his own definition of \nsurrealism as \"pure psychic automatism, which has the aim of expressing, whether verbally, in \nwriting, or in some other manner, the actual functioning of thought freed from any control of the \nreason and any aesthetic or moral preoccupation\" (ibid: 34).  \n Heavily influenced by Freud, surrealism was not interested in curing hysteria through free \ntechniques of free association, but in liberating the creative forces locked inside the unconscious \nin the creation of a material 'Summerland'. But, just as spiritualism was eventually reduced to \npopular vaudeville entertainment, by the time of Breton's death in 1966 surrealist imagery was \nstarting to adorn the walls of museums and art galleries, and feature in corporate advertising \ncampaigns. \n \n \nSpirituality at work (c. 1987 - present) \n \n Beginning around the late 1980s in the US, the Spirituality at Work movement (SAW) \nencapsulates a number of recent developments in management and business thinking, including \nspirit at work, spirituality of work, spiritual computing, and spiritual leadership – all of which \nhave websites, literature, conferences, and training courses associated with them (see Cavanagh, \n1999, for an overview). An indication of the popularity of this movement can be gleaned from a \nsimple internet search using the term 'spirituality at work' which identified 12,400,000 sources at \n 8 \nthe time of writing. Although, as Kinjerski and Skrypnek (2004) have noted, proponents of SAW \nare loathe to offer clear definitions of spirituality, those who do suggest a strong resonance with \nthe aims of surrealism; with SAW offering a means to \"encourage the creator and artist in every \nperson. It will be actively involved, as every artist is, in making the unconscious conscious – not \nfor an elite but for the people\" (Fox, 1981: 11). More recently, work spirituality has been defined \nas \" a source of energy empowering and transforming the life of daily work…It is beyond the \nrational and is creating a new order\" (Ottaway, 2003: 34). \n SAW has its roots in so-called 'new age' thinking which rose to prominence in the late \n1960s and which, in common with spiritualism and surrealism, was critical of the dominance of \norganised religion and scientific rationality in everyday Western cultural life (Heelas, 1996). \nFrom 'new age' spiritism, SAW inherited the belief that all life is interconnected and that divine \nbeings (or one divine Being) exist(s) who can guide humanity to a clearer understanding of the \nspiritual foundations of life and thereby achieve 'inner transformation'. Many 'new age' \nmovements have channellers (people able to tap into this spiritual foundation) who, at least on the \nsurface, have much in common with the mediums and seers of the spiritualist movement. The \nequivalent within SAW is the enlightened spiritual leader who can guide and help others to \nachieve self-transformation at work (e.g. Renesch, 1992; Chappell, 1993; Hawley, 1993; Conger, \n1994; and Hendricks and Ludeman, 1996).  \n What is most striking about SAW is that, despite its critique of existing business practices \nin terms of their lack of compassion or 'soul', it does not offer any means by which the work \nsituation can be improved or transformed (Ottaway, 2003). Instead, the focus is upon the need for \nspiritual guidance and leadership. John Renesch (1992), an early advocate for, and leading light \nin, the SAW movement, argues that the disappearance of the village and the tribe in Western \nculture has left a spiritual 'hole' which can only be filled by the business corporation. \nConsequently, he maintains that corporate leadership should introduce and develop 'tribal rituals' \nto enhance the sense of spirit amongst corporate members. So, although spirituality is beyond the \nrational logic required in business, it is deep within the person and can be channelled by \ncorporate leaders to achieve the desired end. The assumption would seem to be that work can \nfulfill our spiritual needs just so long as the CEO invokes the 'corporate good' to channel our \nspiritual energies in the direction of creativity, personal growth, trust, and organisational \ncommitment (see, for example, Fairholm, 1997 and Moxley, 2000).  \n 9 \n \n \nMovement between the movements \n \n How are we to make sense of the recuperation of spirituality by the very institutions its \nproponents rallied against? The spiritualist movement encouraged wide social participation and, \nin resisting domination by any one individual or elite, tended to be democratic in orientation. As \nfor the surrealists, Cottom (1991) suggests that despite their professed sympathies for the masses, \nthey defined themselves as a superior and authoritarian few. The contemporary SAW movement \nrestricts its cadre to corporate leaders. In short, the valorisation of the (feminine) body in \nspiritualism and surrealism has given way to the valorisation of the (male) head.  \n So how are to we account for this movement between the movements? We now turn to \nconsider this de-radicalisation of spirituality in relation to three broader cultural discourses, \nnamely;  \nVirilisation – the process whereby qualities associated with the 'feminine' are appropriated and \nre-cast in 'masculine' terms; \nMaterialisation – the process whereby the true existence of anything is judged on its visible \nmaterial existence; \nSubjectivisation – the process whereby 'forms of spirituality which resource unique subjectivities \nand treat them as primary sources of signification' (Heelas and Woodhead, 2005: 78) are \nfavoured and reinforced. \n \nVirilisation of spirit The long-established cultural equation of spirituality with female sexuality \nwas reinforced by the popularity of the nineteenth century séance in which conventional sexual \netiquette was often upset by the flirtatious behaviour of the medium (Owen, 1990). At a séance, \n\"the boundary between the spiritual and the flesh of the medium became indistinct, and, by virtue \nof this slippage, one could not demarcate the medium's identity, locate her accountability or \nintention, or distinguish the Victorian woman from the unfettered spirit\" (Tromp, 2003: 69). \nHence female mediums were a dangerous liminal creature residing between fluid boundaries of \nidentity, agency, and responsibility. They became ontological hybrids, contradictions, \"physical \ncategory errors\" (Brown, 1999: 147). But, as Sotto (1998) observes, such hybridity is untenable \n 10 \nwithin a culture steeped in the Enlightenment view of the individual exercising a personal, \nsovereign power which makes them responsible as individuals for their engagement with the \nworld. Bauman (1991) argues that modernity's quest for order is a war against such ambivalence \nand uncertainty. The logic of such a war insists that the medium must undergo a process of \n'purification' (Latour, 1993) in order to return her to a more stable, and less threatening, category: \nwhether it be fraudster or hysteric. \n Yet it was this very hybridity or category crisis that surrealists were eager to exploit in \ntheir war against such 'purification'. Breton wrote, \"everything leads us to believe there exists a \ncertain point in the mind where life and death, real and the imaginary, the past and the future, the \ncommunicable and the incommunicable, the high and the low, cease to be perceived as \ncontradictory\" (cited in Lewis (1988: 82). It is clear from even the most cursory glance at \nsurrealist art that the hybrid, sexualised female body plays a key role in the surrealist's efforts to \nawaken this 'point in the mind' and to enhance erotic motivation towards a material \ntransformation of society. \n\"Eroticism, the 'great nocturnal beast of desire', as Breton called it in the Ode to Charles \nFourier, was the model for that tension which mobilized the whole being towards an \nunknown end. Love was exalted as the archetypal Surrealist art because it brought about the \nseemingly impossible fusion of the self with the other, because it was at once a perpetual \nchallenge to the prevalent life-denying equation between the good and the useful, the \nhighest manifestation of the pleasure principle, and the experience best able to assuage \nman's [sic] thirst for the absolute\" (Matthews, 1977: 145-6). \nWhilst noting the sexism and homophobia of some surrealist writing and art, Conley (1996) \nargues that the surrealist muse, inspired by the figure of the female spiritualist medium, was the \npowerful and creative female figure at once marvellous and threatening – a figure she terms \n'Automatic Woman'. \"The connection between Automatic Woman, as exterior object of desire, \nand the unconscious, from which automatic writing springs, thus creates Breton's surrealist ideal, \nthe fusion of subject and object\" (p. 10). However, as we shall see in the next section of this \npaper, this ideal was to prove beyond the surrealists' reach. \n When we turn to the writings of the SAW movement, it is noticeable that hybridity and \neroticism are completely absent. The female medium and the Automatic Woman are displaced by \na distinctly masculine notion of the leader. \"Being empowered by a leader who is strong and \n 11 \nvirtuous, trustworthy and supportive, is a spiritual experience\" proclaim Kanungo and Mendonca \n(1994: 183). For SAW, the problem – the lack of meaning in everyday routine work and the \n'separation\/alienation from oneself' (Naylor et al 1996: 59) – is resolved through increased \naffective commitment to work and employer. The 'purification' here is a return to an invocation of \nspirituality as a 'call for work', as doing 'god's work', a return to the age-old religious work ethic \nshared by the Christian (Naylor et al, op.cit.), Hindu (Menon, 1997), and Islamic churches \n(Yousef, 2000). In this reading, the utopian yearnings of spiritualists and surrealists are reduced \nto a vision of enhanced organisational performance, and the spiritual corporate leader comes to \nepitomise the Christian church's metaphorical figure of the 'good shepherd' , and assume pastoral \npower over his (rarely, her) flock (see Nadesan, 1999). With the declining power of the Church in \nmodern society, Foucault (1982) suggests, it is \"no longer a question of leading people to their \nsalvation in the next world, but rather ensuring it in this world\" (p. 215). The unconscious and \nspiritual life of the employee is awakened not to achieve social change or enlightenment, but to \nrender it manageable (and therefore more productive) through the application of 'technologies of \nthe self' such as examination, confession, guidance and correction (Foucault, 1988).  \n To achieve this secular Capitalist version of 'Summerland', spiritual leaders seek to unlock \nthe power of the unconscious in the service of the organisation – a process that has been an \nessential aspect of labour process management thinking since at least the nineteenth century (see \nCorbett, 2008). The twist in SAW thinking is the valorisation of the head, both in terms of \nleadership and as the human body part most readily associated with the culturally-coded \n'masculine' traits of reason and control. It is not the leader-as-medium who goes into a trance to \nlet the unconscious free, but the other gatherers within the séance\/corporation. As Reich (1946) \nhas observed \"if the psychic energies of the average mass of people watching a football game or a \nmusical comedy could be diverted into the rational channels of a freedom movement, they would \nbe invincible\" (p. 28). However, the freedom being offered by SAW would seem to be freedom \nfrom alienation through the expedient of possession by the spirited corporation through the \nmediumship of the charismatic leader – a definition of freedom which resonates strongly with \nthat promoted by both the School of Fascist Mysticism, established in Milan in 1930 by Arnoldo \nMussolini (Rainey, 1998), and the Al Qaeda terrorist network (Forray and Stork, 2002). Indeed, \nas Nadesan (1999: 35) observes, although SAW discourses claim to elevate the power of the \nindividual \"they have authoritarian tendencies, particularly when backed by the power of the \n 12 \nhigh-ranking CEO who sees himself or herself as either a spiritual 'guru' or 'magnetic preacher' \n(see Bellah et al., 1985: 237)\". Nadesan argues further that SAW discourse \"is particularly \ninclined to minimise external obligations and social or personal extraorganisational commitment \nbecause of its exclusive focus on the core, authentic self and on individual and organisational \nactualisation\" (p. 35). Such a tendency may have a particularly strong impact on female \nemployees who tend to spend more extraorganisational time with family and community than \ntheir male counterparts (King, 1993).  \n \nMaterialisation of spirit Despite denigrating positivism and the aesthetics of materialism, all \nthree movements found themselves unable to shake off their powerful hold, and particularly the \nhold of science and its attendant technologies. A number of writers have suggested linkages \nbetween the rise of spiritualism and technological innovation. For example, Connor (1999) notes \nthat the progress of spiritualism through the nineteenth and into the twentieth centuries can be \nseen in terms of its twinning or ghosting the development of communication technologies, and \nespecially the invention of the electric telegraph in the 1830s. At the very time the Fox sisters \nwere rapping their toes in Rochester, the city's leading citizens, inspired by the local newspaper \neditor and venture capitalist, Henry O'Reilly, were purchasing the monopoly rights to the use of \nthe electric telegraph throughout the Western corridor of the US (actions which would lead to the \nformation of the Western Union Telegraph Company three years later (Brewer, 1901)). The \ntechnology of automatic writing developed rapidly in the following decades. \"There appeared a \nseries of machines, as if to embody in material terms the linkage between automatic writing and \ncontemporary technology, machines which ranged from relatively simple devices that translated \ntable movements into the letters of the alphabet to more elaborate contrivances that performed the \nsame task but whose design more fully bespoke the contemporary fascination with the marvels of \nengineering\" (Rainey, 1998: 127). How ironic, Rainey suggests, that the hope of an after-life \noffered by such automatic writing was thus communicated by machines \"in the silent syntax of \nadvancing capital\" (p. 129). Writing in 1857, Kardec observed that \"mediums are simply \nelectrical machines that transmit telegraphic dispatches from one point that is far away to another \nwhich is located on earth\" (1857: 289). In short, the medium was being transformed into a \nmachine at the same time as the machine gained a voice.  \n \n 13 \n The subsequent technological inventions of the telephone (1860) and phonograph (1877) \nmade the seemingly miraculous notion of voices coming from another place and from the dead an \nincreasingly familiar experience towards the end of the century, and many mediums changed \ntheir means of spiritual communication from somatic tapping to a more telematic use of voice. \nParadoxically this served to diminish the authority of the medium. Spirit messages no longer \nneeded complex interpretation but could be easily understood by all. An editorial in the \nspiritualist magazine, Direct Voice (1930) suggested that such a shift was not without its merits. \n\"We are told that some day it will be possible for us to communicate without the alternative \nof a human medium, but until that time arrives we have no alternative to use the best means \nat our disposal. But even with the best mediums it is inevitable that whatever is received \nthrough them, whether it be automatic writing, clairvoyance, trance, or direct voice, must \nbe colored to a greater or lesser degree by the personality of the medium who is the channel \nfor such communication\" (p.2). \n The authority of the medium, which had posed an almost insurmountable challenge to the \nauthority of earlier scientific researchers such as Zollner and Wundt, was slowly but perceptibly \nbeing challenged by the very technologies she twinned. Technologies were becoming the arbiters \nof truth as people more readily accepted the 'fact' that spirits may talk through or possess \nmachines than the ambivalence of the hybridity of the medium. When spiritualists talked of the \n'natural supernatural' spirit world they did not challenge the basis of scientific knowledge, but \nstrengthened its authority by pleading that the supernatural be studied scientifically.  \n The surrealists were also keen to harness the power of scientific experimentation and \ntechnology in their work (see Ruffa, 2005). Breton in particular was keen on automatic writing as \nit represented \"the ultimate attempt of discourse to purify itself from the corporeal presence of the \nsubject\" (ibid: 204). Partly as a reaction to any possible confusion between spiritual and psychic \nautomatism, Conley (1996) suggests that the surrealists sought to maintain a degree of emotional \ndetachment in their experiments in an effort to achieve what Breton termed 'rigorous objectivity' \n(Lomas, 2004). This effectively substituted the corpus of the automatic text for the body (corps), \nand aligned the female as Automatic Woman with a mechanical, non-sentient process. The \nfemale, thus coded as an object of desire and dread, acts merely a trigger to an understanding and \nliberation of the unconscious; but it was technologies such as the planchette and the typewriter, as \n 14 \nwell as technologies of graphical recording, which made the immaterial unconscious visible and \nknowable (see Gibson, 1987).  \n\"All night long a few surrealists would gather round the big table used for experiments, \ntheir eyes protected and masked by thin though opaque mechanical slats on which the \nblinding curve of the convulsive graph would appear intermittently in fleeting luminous \nsignals, a delicate nickel apparatus like an astrolabe being fixed in their necks and fitted \nwith animal membranes to record by interpenetration the apparition of each fresh poetic \nstreak, their bodies being bound to their chairs by an ingenious system of straps, so that \nthey could only move a hand in a certain way and the sinuous line was allowed to inscribe \nthe appropriate white cylinders\" (Dalí, 1932: 200). \n Lomas (2004) argues that the early surrealists, and especially Breton, were impressed \nwith the graphical method pioneered by the physiologist Jules-Etienne Marey precisely because it \nenabled a direct access to that which was previously hidden. Just as Marey described his \nmechanical graphical recording devices as a means by which the body writes itself automatically \n(Corbett, 2008), Breton defined thought as \"the white curve on a black ground\" (1924). Yet, by \nthe time he wrote his second surrealist manifesto in 1930, Breton professed disquiet with the \ndisappearance of the artist-subject. In his first Manifesto he had argued that psychic automatism \n\"constantly and vigorously opposes any effort to retouch or correct\" (1969: 24), yet, six years \nlater, he would write: \"[i]f the depths of our mind contain within it strange forces capable of \naugmenting those on the surface, or of waging a victorious battle against them, there is every \nreason to seize them, then, if need be, to submit them the control of our reason\" (1969: 10). Thus, \nThompson (2006) argues: \"while automatism initially provided Surrealism with a method of \n'liberating' both textuality and subjectivity, it ultimately eluded the surrealist's control, thus \nproving profoundly dangerous for artists and writers who were attempting to stamp their names \nupon a new creative movement\" (p. 9). The violent loss of authorial control was specifically \nfigured as devirilising by surrealists, Thompson opines, and this led to the projection of such a \nthreat onto women's bodies within the surrealist's automatic texts. This is perhaps most notable in \nBreton and Soupault's \"Soluble Fish\" (1924) where the narrator's search for an understanding of \nthe 'Automatic Woman' is finally only achievable through the medium of her dead body. \"In lieu \nof such mastery over automatic textuality, it seems the surrealists settle for mastery over women's \nbodies and psyches\" (Thompson, ibid; 9). \n 15 \n The spiritualist J. Arthur Hill argued that the aim of the spiritualist movement was \"to \nretain our scientific gains, but extend our vision beyond the material\" (1910: 298). The SAW \nmovement shares this aim and sees no antagonism between spirituality and materiality (see, for \nexample, Giacalone and Jurkiewicz, 2003). Indeed, many SAW writers seek to 'scientifically' \nmeasure spirituality (e.g. Krahnke, Giacalone and Jurkiewicz, 2003) and its behavioural \nconsequences at work (see, for example, Ashmos and Duchon, 2000, and Tischler, Biberman and \nMcKeage, 2002). For example, Thompson (2000) opines that \"in some cases (referring to \nresearch studies), the more spirited companies outperformed the others by 400-500%, in terms of \nnet earnings, return-on-investment and shareholder value\" (p. 19). The logic here is plain: if your \nemployees are 'empowered' to put their heart and soul into work, they will be more creative, more \ncommitted, and more motivated.  \n The attempted 'fusion' of spirit and matter in SAW discourse is perhaps best illustrated by \nthe growing interest among the SAW movement in 'spiritual computing' – a term which \"does not \nyet refer to specific applications, but more broadly to the new potential of computing to gain \naccess to – and act upon – spiritual substrata of one’s mind\" (Smith, 2007: 2). Members of the \ncomputer-supported spiritual development (CSSD) movement, along with researchers at \nSpiricomp (a business venture established after a series of meetings between Bill Gates and the \nDalai Lama) now hold up the computer as the ideal medium for accessing spiritual experience as \nwell as to decision-making processes in which individuals make choices informed by spiritual \nexperience (see also Epstein, 2004).  \n \nSubjectivisation of spirit In his sociological analysis of religion Taylor (1991: 26) identifies a \n'massive subjective turn of modern culture'. He argues that people, particularly in Western \nculture, are turning towards a subjective notion of spirituality and away from one based on \norganised religion. Taylor primarily applies his 'subjectivisation thesis' to trends since the Second \nWorld War but it would seem that the seeds of such a 'turn' were sown, or certainly nurtured, by \nthe spiritualist and surrealist movements. These seeds have taken root and flourished in the SAW \nmovement. As Bell and Taylor (2003: 344) argue \"whereas the Protestant ethic embodied a \ntranscendent philosophy and portrayed economics as in the service of god, the current [SAW] \ndiscourse embodies an immanent philosophy wherein work is seen as an activity through which \npersonal growth can be achieved\". \n 16 \n In common with nineteenth century philosophical spiritualism and twentieth century \nsurrealism, the 'new age' movement which inspired SAW began as an explicitly counter-cultural \nmovement. The 'new age' movement of the 1960s and 1970s sought alternative life-styles and \nmeans of expression for people who were trapped in ritualised conformity to an authoritarian \nculture. However, as Heelas (2008) has shown, by the early 1980s much of this thinking became \npsychologised with a far stronger emphasis being placed on self-transformation than social \ntransformation. The modern-day 'new age' movement has continued this process of \nsubjectivisation with a particular strong emphasis on health and well-being. Alternative life-styles \nremain on the 'new age' agenda but these are seen as a means of enriching ones own personal life \nto help cope with the pressures of mainstream society rather than to promote alternative ways of \nliving. Indeed, some commentators argue that spirituality today has become deradicalised to such \nan extent that it has become little more than a consumer product (e.g. Lau, 2000 and Possamai, \n2003).  \n Whilst the counter-cultural aspects of 'new age' thinking have been largely ignored within \nthe SAW movement, the notion of self-transformation has become an integral part of its \ndiscourse. This de-radicalisation of spirituality resonates with a shift in post-Taylorist \nmanagement control strategies towards what Casey (1995:138) calls the 'corporate colonisation \nof the self'. She is referring here to cultural interventions by powerful organisational elites into \neveryday organisational behaviour which are designed to shape the formation and development \nof employee subjectivities (see Foucault, 1979; Turner, 1992; Shilling, 1993; and Dale, 2001). \nThese interventions attempt to ensure that “employees are, at the very least, guided in their inter-\nsubjective relations and, as such, in how they [mis]recognise themselves in relation to other[s]” \n(Hancock and Tyler, 2001: 579). \n \n \nConclusion: mediums, technologies and the invocation of truth \n \n The development of the spiritualist, surrealist and spirituality at work movements over the \npast 160 years may be seen as one in which the social reformist, proto-feminism of the Victorian \nspiritualists offering up an alternative way of perceiving and acting in the world, slowly gave way \nto the surrealist's fascination and dread of the female, and thereto a substitution of the spiritual \n 17 \nbusiness guru for the dangerous hybrid of the medium. The development also represents a shift \naway from a discourse of utopianism and social reform towards what Jacques (2002) terms \ncrypto-utopia - a discourse within which utopian ideals reside but are concealed. While crypto-\nutopianism purports to communicate the truth about the future, Milojevic (2003) argues, \"such \nrealistic futures also subtly promote implicit assumptions about the nature of future society (high \ntech, globalised) and impose these views on other future discourses. All other discourses about \nthe future are made to adjust to and negotiate with these, arguably, most-likely futures (p. 446).  \n The movements of spiritualism, surrealism and spirituality at work all have a message (of \nmaterial and\/or spiritual salvation from the here-and-now) communicated or channelled through a \nmedium, entranced artist, or business guru. All three movements have been forced to confront the \ndeeply ambivalent nature of the communication between the immaterial world of the other and \nthe fleshy human self in this ventriloquial process, but in attempting to cancel out the divide \nbetween matter and spirit, masculine and feminine, science and belief, and instrument and actant, \nthey have replicated the dichotomous structure of science in their own discourses. 'Spirit' has \nbecome subsumed under 'matter'.  \n So does this mean that spirituality is incapable of informing any reformist or radical \nagenda for social and organisational change? Is Casey's (2002: 191) belief that such \"efforts of \nsoul-searching, spirituality and sensual re-enchantments are efforts towards freedom\" overly \noptimistic? In truth, all three of the cultural movements discussed here represent effort towards \nfreedom, and yet the progressive materialisation, virilisation and subjectivisation of spirituality \noutlined above would seem to offer little support for her optimism.  \n The virilisation of spirituality can perhaps best be seen in the context of the increasing \ncolonisation of emotion and spirituality in modern organisations by the masculine (see Lewis and \nSimpson, 2007), whilst the haunting of technology by the uncanny world of communication with \nspirits, gods, ghosts, and associated otherworldly phenomena may represent the male fantasy of \ndisembodiment which Sconce (2000) argues have long been associated with modern technologies \nsuch as electricity, telegraphy, radio and television. Although the systems of belief called \nspirituality, magic, and science\/technology are often seen as incompatible they share similar \naspirations and methods. \"Each aspires to extend perception and action beyond ordinary limits, \nand all share similar habits and procedures of ritual and power\" (Chesher, 2006: 125). Certainly, \nspiritualism, surrealism, and SAW share with science\/technology the practice of invocation – the \n 18 \ncall to a power outside ordinary perception and action for assistance or guidance. Mediums \ninvoke spirits, the artist invokes the muse, and the business leader invoke the spirit of the \ncorporation (often through myths and stories of dead corporate founders and past corporate \nachievements) to encourage a perception of work as \"a magical tool to develop, enrich and \nnourish our lives\" (Neck and Milliman, 1994: 10).  \n Invocation is a key mechanism whereby social power reveals and sustains itself, for, as \nChesher (op. cit.) argues, the invocatory act calls on a higher authority accessible only by virtue \nof the invocator's special position. The brief history of spirituality offered in this paper reveals \nhow the invocations of the spirit medium in the late nineteenth century were subject to intense \nscientific experimentation in order that spirit had to prove its existence by \"sordidly material \nphenomena. Within the scientific episteme, these phenomena were the only evidence for the \nindependent existence of the spirit; indeed, they created the spirit\"(Gomel, 2007: 203). The \nsurrealist's fascination with science and technology led them down a similar path, whilst \nproponents of SAW have knowingly embraced materiality in arguing that employee self-\nactualisation is an exploitable corporate asset. In this view, the corporation becomes a spiritual \nentity which derives its life-force from its employees. Employee demotivation and lack of the \n'right spirit' is not a sign of poor organisation or management but a sign of employee \ninauthenticity in need of therapeutic intervention. The complex assemblage of technologies, \ntechniques and hierarchies we call the 'corporation' has become its own invocator.  \n If our ideas of social reality are indeed haunted by the things we exclude, as Derrida \n(1994) maintains, this paper suggests that technologies, and particularly media technologies, \ncontinue to remain shrouded in spiritual mystique which is exploited by both the surrealist and \nSAW movements, but either ignored or demystified within organisation studies. Materer (1995) \nhas observed that spiritualism has been repressed in scholarly accounts of modernity. Sconce \n(2000) takes this argument further and opines that the postmodern turn in social science is a \nlogical outgrowth of the technicisation of spirit such that \"postmodern theory is in itself simply \nanother in a long series of occult fantasies inspired by electronic media\" (p. 170). Perhaps, then, \nif Casey's hopes for a re-spiritualisation within organisations are to be come to fruition, we need \nto consider our own techniques of invocation. The persistence of invocation across the \nsupposedly incommensurable domains of spiritualism, surrealism, religion, magic, science and \ntechnology reveals continuities with the past and the rupturing of seemingly impenetrable \n 19 \nboundaries between different knowledge and belief systems. Serres (1995) sees hope in the \ndevelopment of \"techniques of rapprochement\" (p. 48) with pre-modern ideas, and if post-\nmodernism can shake off its 'occult fantasies', it may become a vehicle for the invocation of \nvoices expressing \"tacit and often times unrepresentable forms of knowledge that modern \nepistemologies inevitably depend on yet conveniently overlook or gloss over in the process of \nknowledge creation\" (Chia, 2003: 127). \n \n \nReferences \n \nAshmos, D.P. and Duchon, D. 2000. Spirituality at work: a conceptualisation and measure. \nJournal of Management Inquiry 9: 134-45. \nBauman, Z. 1991. Modernity and Ambivalence. Cambridge: Cambridge University Press. \nBell, E. and Taylor, S. 2003. The elevation of work: pastoral power and the new age work \nethic. Organization 10: 329-349. \nBellah, R. N., Madsen, R., Sullivan, W. M., Swidler, A. and Tipton, S. M. 1985. Habits of the \nHeart. NewYork: Harper and Row. \nBrandon, R. 1999. Surreal Lives. New York: Grove Press. \nBraude, A. 2001. Radical Spirits: Spiritualism and Women's Rights in Nineteenth-Century \nAmerica. Bloomington: Indiana University Press. \nBreton, A. 1924. Tournesol [Sunflower]. In Oeuvres Complêtes, Volume 1. ed. A. Breton. \nParis: Gillimard. \nBreton, A. 1969. Manifestoes of Surrealism. Ann Arbor: University of Michigan Press. \nBreton, A. 1996.  The mediums enter . In The Lost Steps  ed. A. Breton. Lincoln: University of \nNebraska Press. \nBrewer, A.R. 1901. Western Union Telegraph Company, 1851-1901: A Retrospect. New York: \nWestern Union Telegraph Company. \nBritten, E.H. 1884. Nineteenth Century Miracles: Spirits and their Work in Every Country of \nthe Earth. New York: William Britten. \nBrown, S.D. 1999. ‘Electronic networks and subjectivity’. In Cyberpsychology eds. A. Gordo-\nLopez and I. Parker. London: Macmillan.  \n 20 \nCarroll, B.E. 1997. Spiritualism in Antebellum America. Bloomington: Indiana University \nPress. \nCase, P. and Gosling, J. 2007. Signs of the future: critical reflections on the instrumentality of \nworkplace spirituality. Paper presented at SCOS XXV 'Signs of the Future', Faculty of \nEconomics, University of Ljubljana, Slovenia, 1st -4th  July. \nCasey, C. 1995. Work, Self and Society: After Industrialism. London: Routledge \nCasey, C. 2002. Critical Analysis of Organizations: Theory, Practice and Revitalization. \nLondon: Sage. \nCavanagh, G.T. 1999. Spirituality for managers: context and critique. Journal of \nOrganizational Change Management  12: 186-199. \nChappell, T. 1993. The Soul of a Business: Managing for Profit and the Common Good. New \nYork: Bantam Books. \nChesher, C. 2006. 'The muse and the electronic invocator'. In  Technologies of Magic: A \nCultural Study of Ghosts, Machines and the Uncanny. Eds. J. Potts and E. Scheer. \nSydney: Power Publications. \nChia, R. 2003. Organisation theory as a post-modern science. In  The Oxford Handbook of \nOrganisation Theory eds. H. Tsoukas and C. Knudsen. Oxford: Oxford University \nPress. \nConger, J. 1994. Spirit at Work: Discovering the Spirituality in Leadership. San Francisco: \nJossey-Bass. \nConley, K. 1996. Automatic Woman: The Representation of Woman in Surrealism. London: \nUniversity of Nebraska Press. \nConnor, S. 1999. The machine in the ghost: spiritualism, technology, and the \"direct voice\". In  \nGhosts: Deconstruction, Psychoanalysis, History eds. P. Buse and A. Stott. \nBasingstoke: MacMillan. \nCorbett, J.M. 2008. Towards neuroscientific management?: geometric chronophotography and \nthe thin-slicing of the labouring body. Management and Organizational History 3:  \n107-125. \nCottom, D. 1991. Abyss of Reason: Cultural Movements, Revelations and Betrayals. Oxford: \nOxford University Press. \nDale. K. 2001. Anatomising Embodiment and Organisation Theory. London: Palgrave. \n 21 \nDalí, S. 1932. The artist as revealed in surrealist experiment. This Quarter  September:  197-\n207. \nDavis, A.J. 1857a. The Magic Staff: An Autobiography of Andrew Jackson Davis. Boston: \nKessington Books (reprinted 2003). \nDavis, A.J.  1857b. Harmonious philosophy. In  Proceedings of the Free Convention. Boston: \nKessington Books. \nDe Kosky, R.K. 1976. William Crookes and the fourth state of matter' Isis, 67:  36-60. \nde Tollenaere, H.A.O. 1992. Marx and Engels on spirituality and theosophy. Theosophical \nHistory  4:  45-49. \nDelp, R.W. 2007. Andrew Jackson Davis: prophet of American spiritualism. The Journal of \nAmerican History  54: 43-56. \nDerrida, J. 1994. Spectres of Marx. London: Routledge. \nDirect Voice 1930. Editorial. The Direct Voice: A Magazine Devoted to the Direct Voice and \nOther Phases of Psychic Phenomena, 1: 1-3. \nEpstein, R.G. 2004. Software develoment as spiritual metaphor. Proceedings of the 2004 \nInternational Symposium on Technology and Society, 17-19th June, Massachusetts. \nFairholm, G. 1997. Capturing the Heart of Leadership: Spirituality and Community in the New \nAmerican Workplace. Westport, CT: Praeger Books. \nForray, J. M. and Stork, D. 2003. All for one: a parable of spirituality and organization. \nOrganization  9: 497-509. \nFoucault, M. 1979. Discipline and Punish: The Birth of the Prison. Harmondsworth: Penguin. \nFoucault, M. 1982. 'The subject and power'. In  Michel Foucault: Beyond Structuralism and \nHermeneutics  eds. H.I. Dreyfus and P. Rabinow. New York: Harvester Wheatsheaf. \nFoucault, M. 1988. Technologies of the Self: A Seminar with Michel Foucault. London: \nTavistock. \nFox, M. 1981. Western Spirituality: Historical Roots, Ecumenical Routes. Santa Fe: Bear and \nCompany. \nGiacalone, R.A. and Jurkiewicz, C.L. 2003. Toward a science of workplace spirituality. In  \nHandbook of Workplace Spirituality and Organizational Performance eds. R.A. \nGiacalone and C.L. Jurkiewicz.  New York: M.E.Sharpe Publishing. \n 22 \nGibson, J. 1987. Surrealism before Freud: dynamic psychiatry's \"simple recording instrument''. \nArt Journal  46: 56-60. \nGomel, E. 2007. Spirits in the material world: spiritualism and identity in the fin de siècle. \nVictorian Literature and Culture  35: 189-213. \nHancock, P. and Tyler, M. 2001. Managing subjectivity and the dialectic of self-consciousness: \nHegel and organisation theory.  Organisation  8: 564-586. \nHawley, J. 1993. Reawakening the Spirit in Work: The Power of Dharmic Management. San \nFrancisco: Berrett-Koehler Publishers. \nHeelas, P. 1996. The New Age Movement. The Celebration of the the Self and Sacralization of \nModernity. Oxford: Blackwell. \nHeelas, P. 2008. Spiritualities of Life: New Age Romanticism and Consumptive Capitalism. \nOxford: Blackwell. \nHeelas, P. and Woodhead, L. 2005. The Spiritual Revolution: Why Religion is Giving Way to \nSpirituality. Oxford: Blackwell. \nHendricks, G. and Ludeman, K. 1996. The Corporate Mystic: A Guidebook for Visionaries \nwith their Feet on the Ground. New York: Bantam Books. \nHill, J.A. 1910. Spiritualism, Its History, Phenomena and Doctrine. NewYork: Doran. \nIsaacs, E. 1983. The Fox sisters and American spiritualism. In  The Occult in America: New \nHistorical Perspectives eds. H. Kerr and C.L. Crow. Chicago: University of Illinois \nPress. \nJaques, R.S. 2002. What is a crypto-utopia and why does it matter? In Utopia and \nOrganisation  ed. M. Parker. London: Blackwell Books. \nKardec, A. 1857. Le Livre des Médiums. Paris: Éditions Dervy. \nKing U. 1993. Women and Spirituality: Voices of Protest and Promise. Houndmills: Palgrave \nMacmillan. \nKinjerski, V.M. and Skrypnek, B.J. 2004. Defining spirit at work: finding common ground. \nJournal of Organizational Change Management  17:  26-42. \nKottler, M.J. 1974. Alfred Russel Wallace, the origin of man, and spiritualism'. Isis  65: 144-\n192. \nKrahnke, K., Giacalone, R. and Jurkiewicz, C. 2003. Point-counterpoint: measuring workplace \nspirituality. Journal of Organizational Change Management  16: 396-405. \n 23 \nLewis, P. and Simpson, R. 2007. Gendering Emotion in Organizations. Houndmills: Palgrave \nMacMillan. \nLomas, D. 2004. Modest recording instruments: science, surrealism and visuality. Art History  \n27: 627-650. \nLamont, P. 2004. Spiritualism and the mid-Victorian crisis of evidence. The Historical Journal  \n47: 897-920. \nLatour, B. 1993. We Have Never Been Modern. Cambridge, MA: Harvard University Press. \nLau, K. 2000. New Age Capitalism. Philadelphia: University of Philadelphia Press. \nLewis, H. 1988. The Politics Of Surrealism. New York: Paragon House. \nLondon Dialectical Society 1871. Report on spiritualism: Of the committee of the London \nDialectical Society, together with the evidence, oral and written, and a selection from \nthe correspondence. London: J. Burns Publishers. \nMaterer, T. 1995. Modernist Alchemy: Poetry and the Occult. Ithaca: Cornell Univerity Press. \nMenon, J.K. 1997. Srimad Bhagavad Gita. Kodungalloor, India: Devi Books. \nMilojevic, I. 2003. Hegemonic and marginalised educational utopias in the contemporary \nwestern world. Policy Futures in Education  1: 440-466 \nMoxley, R. 2000. Leadership and Spirit: Breathing New Vitality and Energy into Individuals \nand Organizations. San Francisco: Jossey-Bass. \nNadesan, M. H. 1999. The discourses of corporate spiritualism and evangelical capitalism. \nManagement Communication Quarterly  13: 3-42. \nNaylor, T.H., Willimon, W.H. and Osterberg, R. 1996. The Search for Meaning in the \nWorkplace. Nashville, TN: Abington Press \nNeck, C. and Milliman, J.F. 1994. Thought self-leadership: finding spiritual fulfillment on \norganizational life. Journal of Managerial Psychology  9: 9-16. \nOppenheim, J. 1985. The Other World. Cambridge: Cambridge University Press. \nOttaway, R.N. 2003. Defining spirituality of work. International Journal of Value-based \nManagement  16: 23-35. \nOwen, A. 1990. The Darkened Room: Women, Power, and Spiritualism in Late Victorian \nEngland. Pennsylvania: University of Pennsylvania Press. \nPossamai, A. 2003. Alternative spiritualities and the cultural logic of late Capitalism. Culture \nand Religion  4: 31-45. \n 24 \nRainey, L. 1998. Taking dictation: collage poetics, pathology, and politics. \nModernism\/Modernity  5: 123-153. \nReich, W.  1946. The Mass Psychology of Fascism. NewYork: Orgone Institute Press. \nRenesch, J.  1992. New Traditions in Business: Spirit and Leadership in the 21st Century. San \nFrancisco: Berrett-Koehler Publishers. \nRuffa, A,  2005. Dali's surrealist activities and the model of scientific experimentation. Papers \nof Surrealism  4: 1-14. \nSconce, J.  2000. Haunted Media: Electronic Presence from Telegraphy to Television. London: \nDuke University Press. \nSerres, M. with Latour, B. 1995. Conversations on Science, Culture and Time. Ann Arbor: \nUniversity of Chicago Press. \nShilling, C. 1993. The Body and Social Theory. London: Sage. \nSmith, C.W. 2007. Spiritual computing: a convergence of ancient wisdom and modern tools. \nSpiritual Computing – The Mindfulness\/Technology Dialogue. \n http:\/\/www.spiritualcomputing.com\/sc\/index.html. Accessed April 23rd 2009. \nSotto, R. 1998. The virtualization of the organizational subject. In Organized Worlds: \nExplorations in Technology and Organization with Robert Cooper ed. R. Chia. \nLondon: Routledge. \nStaubermann, K.B. 2001. Tying the knot: skill, judgement and authority in the 1870s Leipzig \nspiritist experiments. British Journal for the History of Science  34:  67-79. \nSword, H. 2001. Ghostwriting Modernity. Ithaca: Cornell University Press. \nSzasz, T. 1970. Ideology and Illness. New Yreok: Anchor Books. \nTaylor, C. 1991. The Ethics of Authenticity. Cambridge, MA: Harvard University Press. \nThompson, R.L. 2004. The automatic hand: spiritualism, psychoanalysis, surrealism. Invisible \nCulture: An Electronic Journal for Visual Culture  7:  1-18.  \nThompson, W.D. 2000. Can you train people to be spiritual? Training and Development  54: \n18-19. \nTischler, L., Biberman, J. and McKeage, R. 2002. Linking emotional intelligence, spirituality \nand workplace performance: definitions, models and ideas for research. Journal of \nManagerial Psychology  17: 203-17. \n 25 \nTromp, M. 2003. Spirited sexuality: sex, marriage, and Victorian spiritualism. Victorian \nLiterature and Culture 16: 67-81. \nTurner, B. 1992. Regulating Bodies. London: Routledge. \nYousef, D. 2000. Organizational commitment as a mediator of relationship between Islamic \nwork ethic and attitudes towards organizational change. Human Relations  53: 513-537. \n \n--------------------------------------------------------------------------------------------------------------------- \nMartin Corbett [martin.corbett@wbs.ac.uk] is Associate Professor of Organisational Behaviour \nat the University of Warwick Business School. His research interests include technophobia, the \ncultural history of the human sensorium, and non-unconscious influences on perception and \ndecision-making. Recent publications include 'What a kerfuffle about a truffle: food and the \nincorporation of identity' in Carl Rhodes and Alison Pullen's edited book Bits of Organization \n(Sydney: Liber\/CBS Press, 2009). \n--------------------------------------------------------------------------------------------------------------------- \n \n"}