{"doi":"10.1029\/2005GL025113","coreId":"64273","oai":"oai:nora.nerc.ac.uk:546","identifiers":["oai:nora.nerc.ac.uk:546","10.1029\/2005GL025113"],"title":"Waves and climate change in the north-east Atlantic","authors":["Wolf, J.","Woolf, D.K."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006","abstract":"Wave height in the North Atlantic has been observed to increase over the last quarter-century, based on monthly-mean data derived from observations. Empirical models have linked a large part of this increase in wave height with the North Atlantic Oscillation. Wave models provide a tool to study impacts of various climate change scenarios and investigate physical explanations of statistical results. In this case we use a wave model of the NE Atlantic. Model tests were carried out, using synthetic wind fields, varying the strength of the prevailing westerly winds and the frequency and intensity of storms, the location of storm tracks and the storm propagation speed. The strength of the westerly winds is most effective at increasing mean and maximum monthly wave height. The frequency, intensity, track and speed of storms have little effect on the mean wave height but intensity, track and speed significantly affect maximum wave height","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/64273.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/546\/1\/Wolf_-_waves_and_climate_change.pdf","pdfHashValue":"4d9483c01a34e086c286de7b27d6b3d1406e4e3e","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:546<\/identifier><datestamp>\n      2013-08-20T13:53:34Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533230<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/546\/<\/dc:relation><dc:title>\n        Waves and climate change in the north-east Atlantic<\/dc:title><dc:creator>\n        Wolf, J.<\/dc:creator><dc:creator>\n        Woolf, D.K.<\/dc:creator><dc:subject>\n        Marine Sciences<\/dc:subject><dc:description>\n        Wave height in the North Atlantic has been observed to increase over the last quarter-century, based on monthly-mean data derived from observations. Empirical models have linked a large part of this increase in wave height with the North Atlantic Oscillation. Wave models provide a tool to study impacts of various climate change scenarios and investigate physical explanations of statistical results. In this case we use a wave model of the NE Atlantic. Model tests were carried out, using synthetic wind fields, varying the strength of the prevailing westerly winds and the frequency and intensity of storms, the location of storm tracks and the storm propagation speed. The strength of the westerly winds is most effective at increasing mean and maximum monthly wave height. The frequency, intensity, track and speed of storms have little effect on the mean wave height but intensity, track and speed significantly affect maximum wave height.<\/dc:description><dc:date>\n        2006<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/546\/1\/Wolf_-_waves_and_climate_change.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Wolf, J.; Woolf, D.K..  2006  Waves and climate change in the north-east Atlantic.   Geophysical Research Letters, 33 (6), L06604.   https:\/\/doi.org\/10.1029\/2005GL025113 <https:\/\/doi.org\/10.1029\/2005GL025113>     \n <\/dc:identifier><dc:relation>\n        doi:10.1029\/2005GL025113<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/546\/","doi:10.1029\/2005GL025113"],"year":2006,"topics":["Marine Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Waves and climate change in the north-east Atlantic\nJudith Wolf1 and David K. Woolf 2\nReceived 2 November 2005; revised 2 February 2006; accepted 6 February 2006; published 18 March 2006.\n[1] Wave height in the North Atlantic has been observed to\nincrease over the last quarter-century, based on monthly-\nmean data derived from observations. Empirical models\nhave linked a large part of this increase in wave height with\nthe North Atlantic Oscillation. Wave models provide a tool\nto study impacts of various climate change scenarios and\ninvestigate physical explanations of statistical results. In this\ncase we use a wave model of the NE Atlantic. Model tests\nwere carried out, using synthetic wind fields, varying the\nstrength of the prevailing westerly winds and the frequency\nand intensity of storms, the location of storm tracks and the\nstorm propagation speed. The strength of the westerly winds\nis most effective at increasing mean and maximum monthly\nwave height. The frequency, intensity, track and speed of\nstorms have little effect on the mean wave height but\nintensity, track and speed significantly affect maximum\nwave height. Citation: Wolf, J., and D. K. Woolf (2006),\nWaves and climate change in the north-east Atlantic, Geophys.\nRes. Lett., 33, L06604, doi:10.1029\/2005GL025113.\n1. Introduction\n[2] Wave height in the North Atlantic, as observed from\nin-situ and altimeter observations, has increased over the\nlast quarter-century [Carter, 1999]. Woolf et al. [2002]\nrelated North Atlantic wave height to the North Atlantic\nOscillation (NAO), a measure of the North Atlantic merid-\nional air pressure gradient and the strength of the prevailing\nwesterly winds, producing a predictive model. The positive\nphase of the NAO corresponds to stronger westerly winds.\nPrediction of future changes in wave height requires under-\nstanding the role of such decadal oscillations and their likely\nfuture evolution, as well as other potential climate change\nmechanisms. In particular we need to understand the mech-\nanism behind the recent increase in wave heights.\n[3] Observational wave data from buoys, ships and\nsatellite altimetry provide a statistical basis for analysing\nvariability but cannot elucidate cause and effect on their\nown. Wave models, once validated, offer the capability of\ninterpreting, interpolating and extrapolating the available\nobservations.\n[4] We use a North East Atlantic (NEA) wave model\n[Wolf et al., 2002; Wolf and Woolf, 2005] to investigate the\neffects of idealised storm conditions, changing the intensity\nand frequency of storms and the strength of the background\nwesterly wind field. First we examine the role of storminess,\nits variability in the historical record and its prediction in\nclimate models. Then we present the wave model, its setup\nand validation and the experiments with synthetic wind\nfields, followed by results and a discussion of the implica-\ntions for the future.\n2. ‘Storminess’ in Climate Models and the\nHistorical Record\n[5] Two possible explanations for the increase in wave\nheight with NAO are (a) an increase in the mean zonal\nwind, increasing the build-up of waves over several days or\n(b) an increase in ‘storminess’ i.e., the frequency and\nintensity of storms [Woolf et al., 2002]. Here we are\ninterested in mid-latitude baroclinic systems rather than\ntropical warm-core hurricanes.\n[6] Studies of changes in storminess over previous cen-\nturies, for example, from windblown sand deposits in the\nOuter Hebrides [Dawson et al., 2004] suggest the most\nsignificant episodes of windstorm deposition pre-date and\npostdate the Medieval Warm Period (ending in about 1400.\nThese may be associated with changes in Icelandic sea ice\nextent [Meeker and Mayewski, 2002]. Lamb [1991] dis-\ncusses storms over the North Sea, British Isles and Europe\ngoing back over the last 500 years, the earlier records\nmostly resulting from associated coastal flooding. Stormi-\nness appears to have varied over decadal and century time-\nscales. Mean sea level fell during the Little Ice Age (16th to\n19th century) apparently coincidental with more frequent\nstorms.\n[7] There have been significant increases in the number\nof severe storms over the UK since the 1950s [Alexander et\nal., 2005], which appear to be related to changes in the\nNAO to a more positive phase. It remains uncertain whether\nthe multi-decadal NAO variability is related to climate\nchange [Tsimplis et al., 2005]. Distinguishing natural from\nanthropogenic variability from observations is difficult.\nClimate models suggest an increase in NAO with increased\ngreenhouse gases but the recent observed increase is beyond\nthe range of the model predictions [Kuzmina et al., 2005].\n[8] There is a common assumption that global warming\nmay lead to increased storminess (http:\/\/meteo.pr.erau.edu\/\nsinclair_cyclones_and_global_warming.php). However the\nevidence is somewhat contradictory. Sinclair and Watterson\n[1999] used the CSIRO General Circulation Model (GCM)\nof the atmosphere to examine changes in the frequency and\nstrength of mid-latitude storms under a doubled CO2\nscenario. The polar regions were found to warm more than\nthe tropics, reducing the equator to pole temperature differ-\nence. Reducing this gradient results in fewer and weaker\nstorms, but there is some evidence of increased winter\ncyclone activity near the downstream end of the principal\nstorm tracks.\n[9] Chang et al. [2002] provided a useful review of storm\ntrack dynamics and found storm tracks exhibit notable\nvariation in intensity on decadal time-scales. It remains to\nGEOPHYSICAL RESEARCH LETTERS, VOL. 33, L06604, doi:10.1029\/2005GL025113, 2006\n1Proudman Oceanographic Laboratory, Liverpool, UK.\n2National Oceanography Centre, Southampton, UK.\nCopyright 2006 by the American Geophysical Union.\n0094-8276\/06\/2005GL025113$05.00\nL06604 1 of 4\nestablish a causal relationship between temporal variability\nof storm track eddies and that of the background flow.\nStorm track predictability is investigated by Compo and\nSardeshmukh [2004]. They find a predictable SST-forced\nstorm track signal exists in many winters, but its strength\nand pattern can change substantially from winter to winter.\n[10] Yin [2005] found a consistent poleward and upward\nshift and intensification of storm tracks in an ensemble of\n21st century climate simulations using 15 coupled climate\nmodels. He refers to recent results observed in reanalysis-\nbased studies showing that there has been a poleward shift\nin the mean latitude of extratropical storms and cyclones\nhave been fewer but more intense in the latter half of the\n20th century but it is difficult to attribute this to greenhouse\ngas effects as yet.\n3. Wave Models\n[11] The wave model setup was described by Wolf et al.\n[2002] and Wolf and Woolf [2005]. The PRO-WAM model\n[Monbaliu et al., 2000] was set up on a 1\u0001 NE Atlantic grid.\nThe NEA model extends from 40\u0001 to 70\u0001N and 25\u0001W to\n15\u0001E. We examine the output at a station west of South Uist\nin the Outer Hebrides, at 57\u0001N, 8\u0001W. An extended model\ncovering the whole North Atlantic was tested to avoid\nomitting any swell energy in boundary conditions for the\nlimited area models but this was found to make less than 5%\ndifference in the significant wave height for the Hebrides\narea, in strong wind events [Wolf and Woolf, 2005]. The\nmost intense weather systems are concentrated in the NE\nAtlantic, so most of the wave generation is captured,\nalthough there may be some occasions where very long\nswell travels from the western Atlantic\n[12] The wind forcing for the NEA model was derived\nfrom the ECMWF ERA-40 reanalysis \u00011.5\u0001 resolution\nglobal model output at 6-hourly time intervals. Altimeter\nand buoy data were used to validate the models. The buoys\nat RARH and K4 provided wave height and period near the\nshelf edge and 3 buoys near South Uist (wave height only)\nwere used. TOPEX\/Poseidon wave heights along tracks 189\nand 44 were most useful as they penetrate into the Sea of the\nHebrides. Particularly large waves were observed in January\n1993 (exceeding 14m on 21 January). Model simulations\nwere carried out for 11, 17 and 21 January to coincide with\naltimeter passes. Detailed results of the validation are given\nin Wolf and Woolf [2005]. The model somewhat under-\nestimates the peak wave height in storm events at K4.\nHowever it can be demonstrated that the ERA-40 winds\nare underestimated compared to NCEP\/NCAR re-analysis\nwinds (http:\/\/www.cdc.noaa.gov\/cdc\/reanalysis\/reanaly-\nsis.shtml) at 2.5\u0001 resolution and this leads to generally\nreduced wave height (Figure 1). Both these models have\nrather coarse spatial resolution, which precludes good\nresolution of the most extreme and intense storm events.\nCaires and Sterl [2003] show that ERA-40 predictions\nunderestimate high values of significant wave height. Bauer\nand Weisse [2000] show that adding statistical wind vari-\nability can increase wave height predictions.\n[13] There is still some uncertainty in the altimeter\ncalibration at very high wind speeds (due to lack of data)\nbut comparison of altimeter wave heights with the K4 buoy\nduring January 1993 validates the altimeter data. Improve-\nment is needed in the atmospheric models used to force the\nwave model, such as the use of higher spatial resolution.\n[14] Agreement between model and observations was\nreasonable (the pattern of observed wave events was repro-\nduced) with discrepancies attributable to the coarse spatial\nand temporal resolution of the wind data. Therefore the\nwave model was considered satisfactory and applied to the\npresent study using idealised wind fields.\n4. Idealised Storm Modelling\n[15] The ERA-40 winds for January 1993 were taken as\nthe basis for a sensitivity study, since this is prototypical of\na positive NAO month. A sequence of depressions passes\nthrough the area from SW to NE during the month. The\nFigure 1. Wave heights implied by ERA-40 versus NCEP\nreanalysis winds near South Uist for January 1993.\nFigure 2. Mean atmospheric conditions for January 1993.\nColoured shading\/contours is wind speed in m\/s, arrows\nindicate direction of flow.\nFigure 3. Idealised storm with maximum wind speed\n10 m\/s.\nL06604 WOLF AND WOOLF: WAVES AND CLIMATE CHANGE IN THE NE ATLANTIC L06604\n2 of 4\nvector average wind field for the month is shown in\nFigure 2, in which the prevailing westerly winds can be\nseen. This field was taken as the background wind field,\nwhich was multiplied by a constant factor (0.5, 1 or 1.5) to\nrepresent different intensities of the westerly winds. On top\nof this was superimposed a sequence of ‘idealised’ storms,\nas in Figure 3, with a fixed radius to maximum winds of\n333km and varying intensity and frequency.\n[16] The standard case consisted of the original back-\nground wind field and a frequency of 6 storms per month\nwith an intensity of 20m\/s (maximum wind speed) translat-\ning to the NE with a translation speed of 50km\/h. The\nrelative strength of the background field and 4 properties of\nthe storms were varied as summarised in Table 1. Although\nsome of these variables may be inter-related in real storms,\nthis simple model allows separation of their effects.\n[17] Several months of synthetic winds were generated,\nwhich were used to force the wave model, from which the\nmean and maximum wave heights for each month were\nderived.\n5. Results\n[18] The sensitivity of the wave height at a point west of\nthe Hebrides (57\u0001N, 8\u0001W), to each single variable, is plotted\nin Figure 4.\n[19] Mean monthly wave heights are most sensitive to the\nrelative strength of the westerlies. The maximum wave\nheight is fairly sensitive to all variables except for the\nfrequency of storms. The largest waves are associated with\na strong background field and intense storms translating\nslowly on a relatively northerly track. Typically the waves\ngrow most in the SE quadrant of the storm where the wind\nspeed is in the same direction as the storm is moving.\n[20] Mean wave direction (generally from SW) is not\nsensitive to these variables except in the case of weak\nwesterlies with the most intense storms, when the mean\nwave direction becomes more zonal. The actual wave\ndirection time series is then dominated by the periodic\nvariation of wave direction from SW to NW associated\nwith the passage of each storm event.\n6. Discussion\n[21] The importance of the background wind field and the\nstorm translation speed can be explained by the importance of\ndynamic fetch, in which the effective wind input is increased if\nthe storm moves at about the same speed as the waves (wave\nheight increases with wind speed, fetch and duration). Waves\ncan also reach their fully-developed state in a steady wind.\nTypical storm translation speeds are larger than the group\nvelocity of all but the longest waves, which explains why in\nour experiments the slowest speed resulted in the highest\nwaves. At normal translation speeds the storm outruns the\nwaves. This tendency is increased for accelerated storm\npassages, as also found in simulations by Bauer et al. [1996].\n[22] The recent increase in wave height is highly corre-\nlated (>0.8) with an increase in the positive phase of the\nNAO [Woolf et al., 2002] for a large area west of the\nHebrides. Wang et al. [2004] assume the relationship will\ncontinue to hold and suggest the occurrence of the positive\nphase of the NAO will be more frequent under global\nwarming. A recent study by Terray et al. [2004] supports\nthis view and indeed suggests that the main change in\nwintertime weather patterns will be a greatly increased\noccupancy of the NAO positive pattern at the expense of\nthe occurrence of the NAO negative pattern.\n[23] On the other hand, Jones et al. [2003] show that the\ninfluence of the NAO has varied significantly over the last\n150–200 years and has been particularly strong recently.\nThe availability of satellite measurements of waves over the\nlast quarter century coincides with a particular phase of the\nNAO. It is still not clear how important the NAO will be in\nthe future and how much it is linked with climate change\n[Tsimplis et al., 2005]. In the absence of any other evidence\nto date their future wave height scenarios are based on\npredictions of the NAO alone.\n[24] Changes in sea ice extent could have an important\nimpact on waves, in changing the fetch over which the wind\nis blowing. Recently Arctic sea ice has been reducing [e.g.,\nRigor and Wallace, 2004] and this can have large implica-\ntions in climate models and on the ocean thermohaline\ncirculation as well as waves.\n7. Conclusions\n[25] A wave model for the NE Atlantic has been used to\nexamine the sensitivity of the sea state to variation in\nTable 1. Features of the Storm Varied in the Experimentsa\nFeature Low Med High\nFrequency (month\u00021) 3 6 9\nIntensity (m s\u00021) 10 15 20\nRelative Strength 0.5 1 1.5\nDirection ENE NE NNE\nSpeed (km h\u00021) 25 50 100\naValues in bold are the ‘‘standard’’ case.\nFigure 4. Effect of (a) storm frequency (b) storm intensity\n(c) relative strength of westerlies (d) storm track and\n(e) storm translation speed on wave height. Red crosses =\nmonthly maximum, blue squares = monthly mean.\nL06604 WOLF AND WOOLF: WAVES AND CLIMATE CHANGE IN THE NE ATLANTIC L06604\n3 of 4\nparameters describing the relative importance of the mean\nwind speed and the characteristics of storm events. The\nintensity, frequency, track and speed of storms has less\neffect on the monthly mean and maximum wave height than\nthe strength of the westerlies. This suggests the recent\nobserved increase in wave height is more likely caused by\nan intensification of the background westerly atmospheric\ncirculation than by a change in storminess.\n[26] Whether wave heights will continue to increase is a\nquestion which remains to be answered. The incidence of\nstorms and the strength of the westerly flow are interrelated\nin ways that need more work to elucidate. The consensus of\nclimate models’ predictions for the NAO suggest it is likely\nto continue in its positive phase which means that wave\nheights are likely to continue to be larger than those\nobserved in the mid-20th century. Further work is needed\nto fully understand the mechanisms controlling the NAO\nand its role in climate change. Our results provide evidence\nof the need for climate change scenario simulations and will\nhelp to interpret these more complex model simulations.\n[27] Acknowledgments. The work described here was (partly)\nsupported by the Tyndall Centre for Climate Research Project ‘‘Towards\na vulnerability assessment of the UK coast’’ [Tsimplis et al., 2005]. Model\nwinds were obtained from the ECMWF ERA-40 reanalysis and NCAR\/\nNCEP reanalysis.\nReferences\nAlexander, L. V., S. F. B. Tett, and T. Jonsson (2005), Recent observed\nchanges in severe storms over the United Kingdom and Iceland,\nGeophys. Res. Lett., 32, L13704, doi:10.1029\/2005GL022371.\nBauer, E., and R. Weisse (2000), Determination of high-frequency wind\nvariability from observations and application to North Atlantic wave\nmodeling, J. Geophys. Res., 105(C11), 26,179–26,190.\nBauer, E., M. Stolley, and H. von Storch (1996), On the response of surface\nwaves to accelerating the wind forcing, Manuscr. 96\/E\/89, 21 pp., GKSS\nRes. Cent., Geesthacht, Germany.\nCaires, S., and A. Sterl (2003), Validation of ocean wind and wave data\nusing triple collocation, J. Geophys. Res., 108(C3), 3098, doi:10.1029\/\n2002JC001491.\nCarter, D. J. T. (1999), Variability and trends in the wave climate of the\nNorth Atlantic: A review, paper presented at 9th ISOPE Conference, Int.\nSoc. of Offshore and Polar Eng., Cupertino, Calif.\nChang, E. K. M., S. Lee, and K. L. Swanson (2002), Storm track dynamics,\nJ. Clim., 15, 2163–2183.\nCompo, G. P., and P. D. Sardeshmukh (2004), Storm Track predictability on\nseasonal and decadal scales, J. Clim., 17, 3701–3720.\nDawson, S., D. E. Smith, J. Jordan, and A. G. Dawson (2004), Late\nHolocene coastal sand movements in the Outer Hebrides, N.W. Scotland,\nMar. Geol., 210, 281–306.\nJones, P. D., T. J. Osborn, and K. R. Briffa (2003), Pressure-based measure-\nments of the North Atlantic Oscillation (NAO): A comparison and an\nassessment of changes in the strength of the NAO and in its influence on\nsurface climate parameters, in The North Atlantic Oscillation: Climatic\nSignificance and Environmental Impact, Geophys. Monogr. Ser., vol. 134,\nedited by J. W. Hurrell et al., pp. 51–62, AGU, Washington, D. C.\nKuzmina, S. I., L. Bengtsson, O. M. Johannessen, H. Drange, L. P.\nBobylev, and M. W. Miles (2005), The North Atlantic Oscillation\nand greenhouse-gas forcing, Geophys. Res. Lett., 32, L04703,\ndoi:10.1029\/2004GL021064.\nLamb, H. H. (1991), Historic Storms of the North Sea, British Isles and\nNorthwest Europe, 204 pp., Cambridge Univ. Press, New York.\nMeeker, L. D., and P. A. Mayewski (2002), A 1400-year high-resolution\nrecord of atmospheric circulation over the North Atlantic and Asia,\nHolocene, 12, 257–266.\nMonbaliu, J., R. Padilla-Hernandes, J. C. Hargreaves, J.-C. Carretero,\nW. Luo, M. Sclavo, and H. Gunther (2000), The spectral wave model,\nWAM, adapted for applications with high spatial resolution, Coastal\nEng., 41(1–3), 41–62.\nRigor, I. G., and J. M. Wallace (2004), Variations in the age of Arctic sea-\nice and summer sea-ice extent, Geophys. Res. Lett., 31, L09401,\ndoi:10.1029\/2004GL019492.\nSinclair, M. R., and I. G. Watterson (1999), Objective assessment of extra-\ntropical weather systems in simulated climates, J. Clim., 12, 3467–3485.\nTerray, L., M.-E. Demory, M. De´que´, G. de Coetlogon, and E. Maisonnave\n(2004), Simulation of late-twenty-first-century changes in wintertime\natmospheric circulation over Europe due to anthropogenic causes,\nJ. Clim., 17, 4630–4635.\nTsimplis, M. N., et al. (2005), Towards a vulnerability assessment of the\nUK and northern European coasts: The role of regional climate variabil-\nity, Philos. Trans. R. Soc., Ser. A, 363, 1329–1358.\nWang, X. L., F. W. Zwiers, and V. R. Swail (2004), North Atlantic Ocean\nwave climate change scenarios for the twenty-first century, J. Clim., 17,\n2368–2383.\nWolf, J., and D. K. Woolf (2005), Waves and climate change in the sea of\nthe Hebrides, paper presented at 15th (2005) ISOPE Conference, Int. Soc.\nof Offshore and Polar Eng., Seoul.\nWolf, J., S. L. Wakelin, and R. A. Flather (2002), Effects of climate change\non wave height at the coast, paper presented at Twelfth (2002) ISOPE\nConference, Int. Soc. of Offshore and Polar Eng., Kitakyushu, Japan.\nWoolf, D. K., P. G. Challenor, and P. D. Cotton (2002), Variability and\npredictability of the North Atlantic wave climate, J. Geophys. Res.,\n107(C10), 3145, doi:10.1029\/2001JC001124.\nYin, J. H. (2005), A consistent poleward shift of the storm tracks in simula-\ntions of 21st century climate, Geophys. Res. Lett., 32, L18701,\ndoi:10.1029\/2005GL023684.\n\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\nJ. Wolf, Proudman Oceanographic Laboratory, 6 Brownlow Street,\nLiverpool L3 5DA, UK. (jaw@pol.ac.uk)\nD. K. Woolf, National Oceanography Centre, Southampton, UK.\nL06604 WOLF AND WOOLF: WAVES AND CLIMATE CHANGE IN THE NE ATLANTIC L06604\n4 of 4\n"}