{"doi":"10.1017\/S0040298210000021","coreId":"67888","oai":"oai:eprints.lancs.ac.uk:34665","identifiers":["oai:eprints.lancs.ac.uk:34665","10.1017\/S0040298210000021"],"title":"Rethinking Russolo.","authors":["Venn, Edward"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-01","abstract":"One of the more telling indicators of Luigi Russolo's (1885–1947) Anglo-American reception is his description in Grove as an ‘Italian inventor, painter and composer’. Within this lurks the devaluation of his composing efforts in comparison to his work as the maker of intonarumori (noise instruments), his authoring of new aesthetic ideas, and his activities as a painter. There is little, perhaps, to argue with in this assessment, for (somewhat ironically) Russolo's music of the future has been consigned irrevocably to the music of the past; Raymond Fearn has suggested that ‘the musical remnants from this period have remained to a large extent in the realm of musical archaeology’. The only material traces available for musical archaeologists are the opening seven bars of the score of Il risveglio di una città (The Awakening of the City; 1913–14): the machines that were to play it were destroyed during the Second World War. The loss of Russolo's compositions has inevitably distorted our understanding of his work and has served to throw attention onto those progressive, and sometimes speculative, theoretical and mechanical aspects of it that have survived in written accounts, at the expense of those elements that are of a more traditional or pragmatic nature. Study of the remaining fragments of Il risveglio di una città, leavened with necessary doses of circumspection and speculation, forms a vital and hitherto under-utilized component to any assessment of Russolo's career","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67888.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/34665\/1\/download4.pdf","pdfHashValue":"e728dbe64fd41eec10a8981dcb7ffef259c9c2ea","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:34665<\/identifier><datestamp>\n      2018-01-24T03:04:02Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4D:4D31<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Rethinking Russolo.<\/dc:title><dc:creator>\n        Venn, Edward<\/dc:creator><dc:subject>\n        M Music<\/dc:subject><dc:description>\n        One of the more telling indicators of Luigi Russolo's (1885–1947) Anglo-American reception is his description in Grove as an ‘Italian inventor, painter and composer’. Within this lurks the devaluation of his composing efforts in comparison to his work as the maker of intonarumori (noise instruments), his authoring of new aesthetic ideas, and his activities as a painter. There is little, perhaps, to argue with in this assessment, for (somewhat ironically) Russolo's music of the future has been consigned irrevocably to the music of the past; Raymond Fearn has suggested that ‘the musical remnants from this period have remained to a large extent in the realm of musical archaeology’. The only material traces available for musical archaeologists are the opening seven bars of the score of Il risveglio di una città (The Awakening of the City; 1913–14): the machines that were to play it were destroyed during the Second World War. The loss of Russolo's compositions has inevitably distorted our understanding of his work and has served to throw attention onto those progressive, and sometimes speculative, theoretical and mechanical aspects of it that have survived in written accounts, at the expense of those elements that are of a more traditional or pragmatic nature. Study of the remaining fragments of Il risveglio di una città, leavened with necessary doses of circumspection and speculation, forms a vital and hitherto under-utilized component to any assessment of Russolo's career.<\/dc:description><dc:date>\n        2010-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/34665\/1\/download4.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0040298210000021<\/dc:relation><dc:identifier>\n        Venn, Edward (2010) Rethinking Russolo. Tempo, 64 (251). pp. 8-16. ISSN 1478-2286<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/34665\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0040298210000021","http:\/\/eprints.lancs.ac.uk\/34665\/"],"year":2010,"topics":["M Music"],"subject":["Journal Article","PeerReviewed"],"fullText":"8 Tempo 64 (251) 8–16 © 2010 Cambridge University Press \ndoi:10.1017\/S0040298210000021 Printed in the United Kingdom\nrethinking russolo\nEdward Venn\nOne of  the more telling indicators of  Luigi Russolo’s (1885–1947) \nAnglo-American reception is his description in Grove as an ‘Italian \ninventor, painter and composer’.1 Within this lurks the devaluation of  \nhis composing efforts in comparison to his work as the maker of  inton-\narumori (noise instruments), his authoring of  new aesthetic ideas, and \nhis activities as a painter.2 There is little, perhaps, to argue with in this \nassessment, for (somewhat ironically) Russolo’s music of  the future has \nbeen consigned irrevocably to the music of  the past; Raymond Fearn has \nsuggested that ‘the musical remnants from this period have remained to \na large extent in the realm of  musical archaeology’.3 The only material \ntraces available for musical archaeologists are the opening seven bars of  \nthe score of  Il risveglio di una città (The Awakening of  the City; 1913–14):4 \nthe machines that were to play it were destroyed during the Second \nWorld War. The loss of  Russolo’s compositions has inevitably distorted \nour understanding of  his work and has served to throw attention onto \nthose progressive, and sometimes speculative, theoretical and mechani-\ncal aspects of  it that have survived in written accounts, at the expense \nof  those elements that are of  a more traditional or pragmatic nature. \nStudy of  the remaining fragments of  Il risveglio di una città, leavened \nwith necessary doses of  circumspection and speculation, forms a vital \nand hitherto under-utilized component to any assessment of  Russolo’s \ncareer. Together, the writings and music provide complementary exam-\nples of  the characteristic tension between the pull of  tradition and the \nexhilarating opportunities of  Futurism in his work. \u0002  \nSuch tensions are present in Russolo’s writings, which, due to the loss \nof  virtually all of  his music, form the foundation on which his reception \nhas been built. For the most part, this reception has followed Russolo’s \nlead in stressing the progressive (often Futurist) elements that in practice \ninvolve the construction and use of  the noise instruments. Nevertheless, \nthe writings do not quite succeed in concealing the debts Russolo owes \nto certain traditional musical values, and the intermingling of  these \nwith his energetic prose reveals more of  his compositional approach \nthan he perhaps intended.\nPh\not\no:\n L\nui\ngi\n R\nus\nso\nlo\n 1  Flora Dennis, ‘Luigi Russolo’, The New Grove Dictionary of  Music and Musicians II ed. Stanley \nSadie (London: Macmillan, 2001), p. 34. Anthony Burton, in The Oxford Companion to Music \ned. Alison Latham, arranged the three professions thus: ‘composer, inventor and painter’ \n(Oxford and New York: Oxford University Press, 2002), p. 1093. \n 2  Russolo was a signatory of  both the ‘Manifesto of  the Futurist Painters’ and ‘The Technical \nManifesto of  Futurist Painters’ (February and April 1910 respectively) and his work was \nincluded in a 1912 exhibition of  Futurist paintings in Paris.\n 3  Raymond Fearn, Review of  Il suono veloce: futurismo e futurismi in musica by Daniele \nLombardi, Music and Letters Vol. 78 No. 4 (November 1997), p. 621.\n 4  The extract was reproduced in 1914 in the magazine Lacerba to illustrate Russolo’s ideas for \nenharmonic notation, and has subsequently been reprinted on numerous occasions, includ-\ning in The Art of  Noises trans. Barclay Brown, pp. 72–3. Flora Dennis lists a further three \nworks by Russolo plus incidental music: none of  this is thought to have survived; ‘Luigi \nRussolo’, p. 35.\nrethinking russolo 9\nThe emphasis on the visionary aspects of  Russolo’s work which \ninforms Barclay Brown’s introduction to his translation of  Russolo’s \nwritings are typical of  the Anglo-American reception.5 Whilst noting \nthat at the time of  writing comparatively few people have actually read \nRussolo’s essays, Brown nevertheless draws attention to the significant \nplace they occupy in 20th-century music.6 The writings include the \n‘first expression’ of  ‘[t]he doctrines of  musique concrète’ and one can find \naesthetic links with ‘such contemporary figures as Pierre Schaeffer and \nJohn Cage’; in modified forms Russolo’s ideas informed the work of  ‘a \nnumber of  movements and individuals’.7 His reputation as an inven-\ntor of  noise machines ‘lingered on in Paris long after his departure’ \nfrom that city, where he had accompanied avant-garde films using his \nrumorarmonio (noise harmonium).8 \nThe writings themselves, and in particular ‘The Art of  Noises: \nFuturist Manifesto’ (1913) share numerous correspondences with \nFilippo Tommaso Marinetti’s ‘The Founding and Manifesto of  \nFuturism’, published in Le Figaro (20 February 1909). These correspond-\nences throw into sharp relief  the blend of  progressive and traditional \nthought in Russolo’s work, and provide a counterbalance to the image \nof  Russolo depicted in Brown’s work. Comparing these two manifestos, \nwe can observe that each invoke a like-minded group of  artists, though \nin both only the author of  the manifesto is a signatory. Secondly, there \nis a strong whiff  of  the skin being sold before the bear is caught: both \nspeak primarily of  art that is to come, rather than describing art that is in \nexistence. Thirdly, and despite claims of  self-renewing originality based \non scientific discovery, the manifestos betray Futurism’s links to the past \nwhilst simultaneously trying to kick over its traces.\nFor all of  Marinetti’s self-aggrandizing and violent rhetoric of  \nrenewal, the Founding Manifesto is rooted in ‘a tangled web of  turn-\nof-the-century political, cultural and philosophical currents’.9 The \ninfluence of  writers such as Proudhon, Bakunin, Sorel and above \nall Nietzsche inform – often in an idiosyncratic and distorted fashion \n– both its prose style and content.10 Italian intellectuals such as Giovanni \nPapini, Giuseppe Prezzolini and Argendo Soffici criticised the Futurists \nfor their ‘lack of  originality’ – though one wonders if  this criticism was \nto some extent directed at Marinetti’s lack either of  acknowledgement \nof  his sources or of  his recognition of  the similar themes articulated by \nhis peers.11\nOn the surface, and in contradistinction to Marinetti’s grounding \nin the intellectual and artistic climate from which his own manifesto \nsprung, Luigi Russolo’s manifesto ‘The Art of  Noises’ (1913), seemed \nto owe little to his background as a painter.12 It is likely that Marinetti’s \nlinking of  technology, machinery and music in an insert into Balilla \nPratella’s ‘Technical Manifesto of  Futurist Music’ (1911), along with \nMarinetti’s example in general, stimulated Russolo’s musical ideas.13 \nThe themes of  Futurist art that can be detected in Marinetti’s manifesto \n 5  Barclay Brown, ‘Introduction’, The Art of  Noises trans. Barclay Brown (New York: Pendragon \nPress, 1986), pp. 1–21.\n 6  Brown, ‘Introduction’, p. 1.\n 7  Ibid.\n 8  Ibid, p. 16.\n 9  Caroline Tisdall and Angelo Bozzolla, Futurism (London: Thames and Hudson, 1977), p. 17.\n 10  Ibid., pp. 18–9.\n 11  Jane Rye, Futurism (London: Studio Vista, 1972), p. 11.\n 12  Although not trained as a musician, Russolo grew up in a musical family; see Rodney J. \nPayton, ‘The Music of  Futurism: Concerts and Polemics’, The Musical Quarterly Vol. 62, No. \n1 ( January 1976), pp. 35–6. Russolo claims that the music that was considered most successful \nwas that that is most unconventional; one wonders if  his claims of  ‘knowing nothing’ were \nsomewhat disingenuous, given his family background, cited in Brown, ‘Introduction’, p. 8.\n 13  See Brown, ‘Introduction’, pp. 2–3 and Payton pp. 31–2.\ntempo10\nrecur in Russolo’s. Above all, one must place one’s faith in the future, \nrather than the past. Instead of  the safety of  tradition, the Futurist is to \nplunge joyfully into the unknown, embracing the machine age, raising \nthe machine to the level of  an artistic object, glorifying speed and dyna-\nmism, exalting violence and conflict, and exploring the relationship of  \nall this to urban life. The goal is a mode of  expression ‘flexible enough to \nexpress the range of  experience open to man in the dawning century of  \nspeed, mobility and unprecedented scientific advance’.14\nThe realization of  this new form of  expression is a central theme \nof  Russolo’s writings. His anticipation of  noise machines (the first of  \nwhich was ready a month after the publication of  the manifesto) genu-\ninely looks towards a musical future that only became commonplace \nfrom the 1940s with the advent of  musique concrète. As with all Futurist \nmanifestos, the past is recognized for its glories, but for Russolo the con-\ncert hall is no longer to be a museum, nor the performer a curator: \nWe futurists have all deeply loved and enjoyed the harmonies of  the great \nmasters. Beethoven and Wagner have stirred our nerves and hearts for many \nyears. Now we have had enough of  them, and we delight much more in combining \nin our thoughts the noise of  trams, of  automobile engines, of  carriages and brawling \ncrowds, than in hearing again the “Eroica” or the “Pastorale”.15 \nThe expansion of  timbral resources – surely the most innovative aspect \nof  Russolo’s work – is to be accompanied by an expansion of  pitch and \nrhythmic material: the octave is to be divided into quartertones (rather \nthan semitones), this division enabling ‘dynamic continuity’;16 rhyth-\nmic counterpoint is to take advantage of  the infinite ‘rhythmic motions \nof  a noise’.17 Russolo’s vision of  music thus encompasses the scientific \nexploration of  sound, the depiction of  urban life, the possibilities of  the \nmachine age and the focus on dynamism that characterizes Futurist art \nin general. In this respect, his work is overtly progressive.\nMore traditional concerns inform the practicalities of  compos-\ning such music, which for Russolo was essentially abstract rather than \nimitative.18 Although many Futurists prized extreme subjectivity, such \nabstraction was by no means uncommon in their art. In paintings such \nas his ‘Iridescent Interpretations’, for example, the artist Giacomo Balla \ndrew on scientific analysis of  light;19 we might assume from this that \nRussolo was interested in a similar artistic response to the scientific \nproperties of  sound. He certainly provides sufficient observations about \nthe nature of  overtones in noise to suggest this is the case.20 On the other \nhand, Russolo also discussed certain organizational principles – indeed, \nhe was at pains to stress the ‘logic’ of  his music – that were of  a more \ntraditional nature, and which also might deserve the epithet abstract.21 \nWhen searching for further evidence that might help pin down what \nRussolo meant by ‘abstraction’, a useful point of  departure might be the \nobservation that Marinetti’s liberation of  sounds from syntax and gram-\nmar was an inspiration for Russolo. A similar divorce of  sound from \n 14  Tisdall and Bozzolla, p. 7.\n 15  Luigi Russolo, ‘The Art of  Noises: Futurist Manifesto’, in The Art of  Noise, p. 25 (original \nemphasis).\n 16  Luigi Russolo, ‘Enharmonic Notation’, in The Art of  Noise, p. 68\n 17  Russolo, ‘The Art of  Noises’, p. 28.\n 18  See Brown, ‘Introduction’, pp. 2 and 13.\n 19  It should be noted that this attracted criticism from other Futurists such as Umberto \nBoccioni, who complained as early as 1907 that Balla’s ‘universe does not throb’. (Cited in \nTisdall and Bozzolla, p. 62.)\n 20  See for instance, ‘Physical Principles and Practical Possibilities’, The Art of  Noises, pp. 37–\n40. If  my inference is true, then we find Russolo once again through his scientific study of  \nsound anticipating subsequent 20th-century developments.\n 21  Russolo, ‘Polemics, Battles, and the First Performances of  the Noise Instruments’, The Art of  \nNoises, p. 31.\nrethinking russolo 11\nimitative associations in Russolo’s music may well stem from Marinetti’s \nexample, but this neither implies nor denies the existence of  a (musical) \ngrammar as an organizational principle.22 Russolo did not in fact discuss \nmusical syntax and grammar as such, save to suggest that noise might \nbe regulated by harmonic and rhythmic means, giving us justifiable \ngrounds for supposing that these elements were decisive in the shaping \nof  his music, and in particular the principle of  ‘dynamic continuity’.23 \nThat pitch is of  vital importance to his art is again apparent from a pas-\nsage in ‘The Orchestra of  Noise Instruments’, in which he discusses \naccuracy of  intonation in the same context as ‘musicality’,24 a somewhat \ntraditional concept and a possible signal that Russolo regards his work \non some level as being evolutionary rather than revolutionary. In this \nlight, we might view Russolo’s ‘emancipation of  timbre’ in the same \nway as Schoenberg’s ‘emancipation of  dissonance’, in that it renews, \nrather than replaces, the musical resources available to the composer.\nGiven the available evidence, the preceding comments and conclu-\nsions might need to be taken with a pinch of  salt. However, it is clear \nthat Russolo’s desire for practicality in both the notation and per-\nformance of  his works meant that he blended old and new musical \nsymbols in his scores (such as the use of  the 5-line stave and traditional \ntime-signatures with certain graphical representations)25 along with \ntraditional terminology.26 A similar pragmatism informs the practice \nof  Futurist composers of  using the intonarumori alongside standard \norchestral instruments. Russolo notes that he added timpani, a sistrum \nand a xylophone to his orchestra of  noise instruments; Pratella com-\nbined conventional and unconventional instruments in his opera Eroe.27 \nNevertheless, here at least Russolo is clear that his preference is for his \nnew instruments on their own.28\nIt is impossible to be sure from the writings if  such compromises \nwere made in the spirit of  introducing gradually the novel aspects of  \nFuturist music, as Russolo would have us believe, or if  they were indica-\ntive of  a compositional aesthetic less radical than one might otherwise \nhave thought.29 Nevertheless, the fact that such compromises exist at all \nshould alert us to the possibility that Russolo’s compositions may also \nhave displayed an underlying pragmatism, if  not conservatism, that \nserved to organize (or even constrain) the musical material. \u0002  \nAlthough it is dangerous to assume that there is necessarily a unity \nbetween a composer’s aesthetic writings and compositional out-\nput, there is evidence in the first seven bars of  Il risveglio that Russolo \n 22  In a similar manner, the absence of  traditional instruments removes particular expressive \nand associative connotations. Alexander Goehr noted how for the Futurists ‘flutes or ket-\ntle drums themselves symbolise a culture’, and ‘traditional instruments were remnants of  \nan ancient civilisation which had to be destroyed’. In this respect, the Futurists provided \nan example for Stravinsky and Varèse. See ‘The Survival of  the Symphony. 4. Licence for \nLicence’, The Listener (10 December 1987): p. 18. With little supporting evidence from \nRussolo’s writings, Brown suggests in his ‘Introduction’ (p. 19) with reference to a review of  \nIl risveglio in the Pall Mall Gazette, that there may well be some formal principles underpin-\nning the music.\n 23  In ‘The Art of  Noises: Futurist Manifesto’, p. 27.\n 24  The Art of  Noises, p. 81.\n 25  See ‘Enharmonic Notation’, p. 67–8.\n 26  The use of  the word ‘theme’ in the article ‘The Orchestra of  Noise Instruments’ may have \nbeen metaphorical, but it may also have signalled that traditional musical methods of  con-\nstruction inform Russolo’s practice, p. 82. \n 27  Russolo, ‘The Orchestra of  Noise Instruments’, p. 82.\n 28  Ibid.\n 29  One might note a similar compromise in the first wave of  Futurist painting, which relied on \nrecent trends (Divisionism and Cubism) for its technical basis.\ntempo12\npractised what he preached. That is to say, these bars provide further \nconfirmation that Russolo is less of  a revolutionary than might be imag-\nined, and this consistency enables the music to be admitted as evidence \nwhen considering Russolo’s output as a whole.\nBefore turning to what we know of  Russolo’s music, what of  the \nmusic that has not survived? Brown omits from his account the direct \ncontact Russolo’s contemporaries had with both the noise instruments \nand the music written for them.30 Stravinsky had met Russolo and heard \nhis music on a trip to Milan in 1915; also present on this occasion were \nDiaghilev and Prokofiev.31 Six years later, three Futurist concerts in Paris \nwere to have ‘a considerable impact […] on Casella, Falla, Honegger, \nMilhaud, Ravel and Stravinsky’,32 and a 1929 demonstration of  the \nrumorarmonio was introduced by Varèse. Accounts of  the 1915 event \nsuggest that, at best, the potential of  the instruments was recognized, \nbut their current state of  development, and the music that was written \nfor them, was considered less impressive.33 \nExample One presents the surviving bars, transcribed into standard \nnotation. (At the start of  each system are the ranges of  each instrument \nas given by Russolo, who claims that these were the ranges employed in \nperformances of  Il risvelgio.)34 Barclay Brown has described these bars as \nfollows: \nThese two pages display the constant use of  drones and glissandos. Although the \nindividual entrances of  the instruments and the presence of  contrary motion in \nthe parts give the impression of  polyphony, the music has a clearly harmonic \nintent. The first of  the two pages seems to be loosely based on a chord interval-\nlically constructed like a dominant seventh with the root of  G.35 \nAll but the last of  these features can be discerned in Ex. 1. The pedal \npoints provided by the ronzatori (low hummer) suggest i–V–VI in E \nminor, though in practice the language is more ambiguous than that. \nThe opening leans first towards an enharmonically-spelt dominant \nseventh on C-natural and then to a half-diminished chord on C-sharp. \nBars three and four combine a sustained perfect fifth on B with mov-\ning material that affirms E as a tonic. The extract ends with a sustained \naugmented chord on C, first anticipated in passing in bar 1. The use of  \nquarter-tones at the very end, in a sort of  written out glissando, falls \nfar short of  the brave new world of  pitch resources described by the \ncomposer.36 Rhythmically, the passage is far more straightforward. The \npedal points establish a regular harmonic rhythm; motion above this \nconforms to a regular simple triple metre. This is true also for the glis-\nsandi that are initiated in the second bar and which become increasingly \nimportant as the extract progresses: the crotchet pulse regulates the \nbeginnings, endings, peaks and troughs of  all of  the glissandi. \n 30  Such omissions are characteristic of  Brown’s Introduction: see John C. G. Waterhouse, \n[Review of  The Art of  Noises], Music & Letters Vol. 69, No. 3 ( Jul., 1988): 414.\n 31  Payton, 28.\n 32  Dennis, 34.\n 33  Waterhouse, 416\n 34  Russolo, ‘The Noise Instruments’, in The Art of  Noise, 77. However, as can be seen in Ex. 1, \nthere are numerous instances of  the work going beyond the notional limits of  the instru-\nments. This fragment was recorded in 1977 using reconstructions of  Russolo’s instruments. \nThe recording itself  is but 30 seconds long; there are also demonstrations of  each of  the \ninstruments. Some issues of  the recording distinguish between the work and the samples of  \nthe intonarumori (for instance, Musica Futurista: The Art of  Noises ); others, such as Futurism \nand Dada Reviewed (LTMCD 01) run all the tracks together, creating a misleading impression \nof  the work and its content.\n 35  Barclay Brown, ‘The Noise Instruments of  Luigi Russolo’, Perspectives of  New Music Vol. 20, \nNo. 1\/2 (Autumn, 1981 – Summer, 1982), 36.\n 36  ‘The Conquest of  Enharmonicism’, The Art of  Noises, pp. 61–66.\nrethinking russolo 13\nIf  pitch and rhythm provide the logic underpinning Russolo’s music, \nwhat organizational principles might we infer from this passage? The \nharmonic language as notated, considered independently from timbre, \nshows an awareness of  contemporary developments in the field, balanc-\ning impressionistic sonorities with weakly-directed tonal motion. This \ntonal motion, coupled with the regularity of  harmonic rhythm and Example 1\ntempo14\nmeasured crotchet pulse, provides a solid, if  routine framework. Giving \nRussolo the benefit of  the doubt, one might assume that this framework \nwas yet another pragmatic device, one that gave musicians unused to \nthe intonarumori something familiar to work with. It is likely, however, \ndespite Russolo’s claim that the noise instruments have amongst the Example 1 continued\nrethinking russolo 15\nnumerous overtones a clearly defined primary pitch,37 that the result-\ning harmonies would have been inaudible, and any notional pragmatic \nfunction that they may have had would have been lost. Certainly, none \nof  the accounts of  Russolo’s concerts discuss the harmonic language, \nand nor can it be heard in reconstructions of  these bars.38 \nAs with Russolo’s relatively simplistic approach to harmony, his use \nof  the intonarumori lacks a deft touch. The impression is that the com-\nposer is over-eager to show off  his creations. Within the first six bars, \nhe deploys all of  his available resources: all but one of  the instruments \ncontributes to the tutti in bar 5, and only the ronzatori do not make \nuse of  their ability to glissando. Clearly, the city is waking quickly! \nUnfortunately, it is likely that the rush to incorporate everything would \nrender indistinct the timbral variety at his disposal. \n A similar argument regarding the inaudibility of  rhythms can be \nmade, for the noise machines set up their own internal rhythms.39 In this \nrespect, the timbre of  the noise instruments serves to mask the musi-\ncally unadventurous material in much the same way the Futurists such \nas Marinetti and Russolo cover their own aesthetic debts to the past in \ntheir otherwise progressive writings. \nThe degree to which these debts are covered can be discerned in \nMark Radice’s analysis of  these bars. Although he doesn’t use the term \n‘dynamic continuity’ in this context, Radice’s sympathetic reading of  the \nwork suggests how Russolo’s expressive goal might have been realized: \nIn traditional Western art music, vertical sonorities are arranged as a progres-\nsion of  chords consisting of  identifiable intervals invariably based upon the \npresumption that the half  step in some way represents the smallest, indivis-\nible sub-atomic particle. Russolo’s conception of  Futurist music eliminates \nsuch “progressions” and substitutes instead a continuous “transformation” of  \nvertical sonorities. \n[…]\nRussolo’s new notation does indeed facilitate correspondingly new musical ideas, \nparticularly insofar as transformations of  vertical sonorities are shown in what \nwe might call analogue fashion. Since Russolo’s time, important compositions \nemploying transformations rather than progressions have appeared – Bartók’s \nMusic for String Instruments, Percussion and Celesta (1936) and Penderecki’s \nThrenody for the Victims of  Hiroshima (1960) are two well-known examples. […] \nUnfortunately, music theory has not kept pace with musical practice, and, as yet, \nthere is no system for discussing vertical sonorities incorporating microtones.40 \n As I have shown, the musical language is not as unorthodox as Radice \nwould have us believe; the glissandi and microtones are essentially sur-\nface decorations and the transformations of  vertical sonorities owe as \nmuch to late-Romantic parsimonious voice-leading as it does to proto-\nBartókian principles (note, for example, the chromatic shifts in bars 1 \nand 2; the augmented chord on C is formed by raising the third and fifth \nof  the ‘tonic’ E minor chord). At this early stage of  its development, \ndynamic continuity seems to have fallen far short of  the Futurist aims \nof  ‘speed, mobility and unprecedented scientific advance’. The reasons \nfor this, I contend, are twofold. Firstly, Russolo’s reliance on traditional \nstructuring principles, whether for pragmatic purposes or not, serves \nto inhibit the musical flow; nor do these principles provide an alterna-\ntive means of  realizing a new form of  musical expression. Secondly, \nRussolo’s use of  traditional devices leaves him open to traditional criti-\ncism, and these bars would suggest that he is not a particularly inspired \ncomposer (hardly a surprising conclusion, given his background).\n 37  ‘The Art of  Noises: Futurist Manifesto’, p. 27.\n 38  See n. 34. \n 39  ‘The Art of  Noises: Futurist Manifesto’, p. 28.\n 40  Mark A. Radice, ‘“Futurismo”: Its Origins, Context, Repertory, and Influence’, The Musical \nQuarterly Vol. 73, No. 1 (1989), pp. 7 and 16.\ntempo16 \u0002  \nOne should perhaps not read too much into these opening bars, for they \nrepresent Russolo’s earliest attempts at deploying the new resources at \nhis disposal. Furthermore, by basing both his notation and his organi-\nzational principles on traditional models, he makes the learning process \neasier for performers schooled in such models. However, the traditional \nbasis of  these bars should also serve to limit readings of  his work that \noveremphasize the progressive aspects. Indeed, throughout his sur-\nviving literary output, and exemplified by Il risveglio, we find Russolo \nbuilding on the past, rather than sweeping it aside with the new as \nthe Founding Manifesto of  Futurism confidently proclaims should be \nthe model. \nNevertheless, if  one is to attempt an evaluation of  Russolo’s musical \ncareer, then these few bars, rescued and reconstituted by musico-archae-\nology, become significant. Russolo’s reception has seldom been based \non a close reading of  his music, and doing so provides interesting par-\nallels with his theoretical and mechanical work, whilst highlighting \ncertain musical weaknesses which compromise his endeavours. In this \nlight, Flora Dennis’s suggestion that Russolo was an inventor first and \ncomposer third has more than a ring of  truth about it; Russolo’s relega-\ntion to an interesting footnote in music history is perhaps deserved. \nbibliography\nBalla, Giacomo; Carrà, Carlo; Marinetti, Filippo Tommaso, Russolo, \nLuigi; Severini, Gino, The Technical Manifesto of  Futurist Painting, \n1910.\nBrown, Barclay, ‘The Noise Instruments of  Luigi Russolo’, Perspectives \nof  New Music Vol. 20, No. 1\/2 (Autumn, 1981 – Summer, 1982), \npp. 31–48.\nBurton, Anthony, ‘Luigi Russolo’ in The Oxford Companion to Music ed. \nAlison Latham (Oxford and New York: Oxford University Press, \n2002), pp. 1093– 4.\nDennis, Flora, ‘Luigi Russolo’ in The New Grove Dictionary of  Music \nand Musicians 2nd edition., Vol. 22 ed. Stanley Sadie (London: \nMacmillan, 2001), pp. 34–5.\nFearn, Raymond, [Review of  Il suono veloce: futurismo e futurismi in musica \nby Daniele Lombardi], Music and Letters Vol 78 No. 4 (November \n1997), pp. 621–622.\nGoehr, Alexander, ‘The Survival of  the Symphony. 4. Licence for \nLicence’, Listener (10 December) pp. 17–20.\nMarinetti, Filippo Tommaso, The Founding and Manifesto of  Futurism, \n1909.\nPayton, Rodney J., ‘The Music of  Futurism: Concerts and Polemics’, \nThe Musical Quarterly Vol. 62, No. 1 ( Jan. 1976), pp. 25–45.\nRadice, Mark A., ‘“Futurismo”: Its Origins, Context, Repertory, and \nInfluence’, The Musical Quarterly Vol. 73, No. 1 (1989), pp. 1–17.\nRussolo, Luigi, The Art of  Noises trans. Barclay Brown (New York: \nPendragon Press, 1986).\nRye, Jane, Futurism (London: Studio Vista, 1972).\nTisdall, Caroline and Bozzolla, Angelo, Futurism (London: Thames and \nHudson, 1977).\nWaterhouse, John C. G., [Review of  The Art of  Noises], Music & Letters \nVol. 69, No. 3 ( July, 1988), pp. 413–416.\n"}