{"doi":"10.1017\/S0017383506000052","coreId":"66171","oai":"oai:dro.dur.ac.uk.OAI2:2720","identifiers":["oai:dro.dur.ac.uk.OAI2:2720","10.1017\/S0017383506000052"],"title":"Ovid, Tristia 1.2 : high drama on the high seas.","authors":["Ingleheart, J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-04","abstract":"In the first poem of Tristia 1, Ovid claims me mare, me uenti, me fera iactat hiems (‘the sea, the winds, the savage winter storm harass me repeatedly’, 1.1.42). This is no mere rhetorical flourish: the immediacy of the present tense becomes apparent in the second poem in the collection, which purports to be the poet's words as he faces a storm at sea. Critics tend to treat this poem as a literary exercise, focusing upon Ovid's exploitation of epic descriptions of the sea as a vast elemental force, subject to the machinations of the gods. In particular, interest has centred upon Ovid's debt to the storms which face Aeneas and Odysseus in Aeneid 1, 3, and 5 and Odyssey 5, as well as the relationship between this poem and Ovid's own version of an ‘epic’ storm in the story of Ceyx and Alcyone at Metamorphoses 11.410–748.\\ud\n\\ud\nHowever, this poem contains much more than the sum of its various epic models: 1.2 is programmatic for the rest of Tristia 1, not least because it can be seen as the first ‘proper’ poem of the collection, given that 1.1 is addressed to Ovid's new book of poetry as he sends it to Rome, and as such, self-consciously stands apart from the rest of the book.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66171.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2720\/1\/2720.pdf","pdfHashValue":"782d5dbdba3af53b04a09ec897629d7aeb7ad15f","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2720<\/identifier><datestamp>\n      2011-08-23T08:56:10Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Ovid, Tristia 1.2 : high drama on the high seas.<\/dc:title><dc:creator>\n        Ingleheart, J.<\/dc:creator><dc:description>\n        In the first poem of Tristia 1, Ovid claims me mare, me uenti, me fera iactat hiems (‘the sea, the winds, the savage winter storm harass me repeatedly’, 1.1.42). This is no mere rhetorical flourish: the immediacy of the present tense becomes apparent in the second poem in the collection, which purports to be the poet's words as he faces a storm at sea. Critics tend to treat this poem as a literary exercise, focusing upon Ovid's exploitation of epic descriptions of the sea as a vast elemental force, subject to the machinations of the gods. In particular, interest has centred upon Ovid's debt to the storms which face Aeneas and Odysseus in Aeneid 1, 3, and 5 and Odyssey 5, as well as the relationship between this poem and Ovid's own version of an ‘epic’ storm in the story of Ceyx and Alcyone at Metamorphoses 11.410–748.\\ud\n\\ud\nHowever, this poem contains much more than the sum of its various epic models: 1.2 is programmatic for the rest of Tristia 1, not least because it can be seen as the first ‘proper’ poem of the collection, given that 1.1 is addressed to Ovid's new book of poetry as he sends it to Rome, and as such, self-consciously stands apart from the rest of the book.\\ud\n<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        Greece & Rome, 2006, Vol.53(1), pp.73-91 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-04<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2720<\/dc:identifier><dc:identifier>\n        issn:0017-3835<\/dc:identifier><dc:identifier>\n        issn: 1477-4550<\/dc:identifier><dc:identifier>\n        doi:10.1017\/S0017383506000052<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2720\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S0017383506000052<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2720\/1\/2720.pdf<\/dc:identifier><dc:rights>\n        This paper has been published in a revised form, subsequent to editorial input by Cambridge University Press, in \"Greece & Rome\" (53: 1 (2006) 73-91), http:\/\/journals.cambridge.org\/action\/displayJournal?jid=GAR. © 2006 The Classical Association<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1477-4550","0017-3835","issn:0017-3835"," 1477-4550"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n26 September 2008\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nIngleheart, J. (2006) ’Ovid, Tristia 1.2 : high drama on the high seas.’, Greece Rome., 53 (1). pp. 73-91.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0017383506000052\nPublisher’s copyright statement:\nThis paper has been published in a revised form, subsequent to editorial input by Cambridge University Press, in\n”Greece Rome” (53: 1 (2006) 73-91), http:\/\/journals.cambridge.org\/action\/displayJournal?jid=GAR. 2006 The\nClassical Association\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n26 September 2008\nVersion of attached file:\nPublished\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nIngleheart, J. (2006) 'Ovid, Tristia 1.2 : high drama on the high seas.', Greece &amp; Rome., 53 (1), pp.\u000073-91.\nFurther information on publisher\u0000s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0017383506000052\nPublisher\u0000s copyright statement:\nThis paper has been published in a revised form, subsequent to editorial input by Cambridge University Press,\nin \"Greece & Rome\" (53: 1 (2006) 73-91), http:\/\/journals.cambridge.org\/action\/displayJournal?jid=GAR. ©\n2006 The Classical Association\nGreece & Rome, Vol. 53, No. 1, © The Classical Association, 2006. All rights reserveddoi: 0.1017\/S001738350600005OVID, TRISTI 1.2\nOVID, TRISTIA 1.2: HIGH DRAMA ON THE\nHIGH SEAS\nBy JENNIFER INGLEHEART\nIn the first poem of Tristia 1, Ovid claims me mare, me uenti, me fera\niactat hiems (‘the sea, the winds, the savage winter storm harass me\nrepeatedly’, 1.1.42).1 This is no mere rhetorical flourish: the imme-\ndiacy of the present tense becomes apparent in the second poem in\nthe collection, which purports to be the poet’s words as he faces a\nstorm at sea. Critics tend to treat this poem as a literary exercise,2\nfocusing upon Ovid’s exploitation of epic descriptions of the sea as a\nvast elemental force, subject to the machinations of the gods. In\nparticular, interest has centred upon Ovid’s debt to the storms which\nface Aeneas and Odysseus in Aeneid 1, 3, and 5 and Odyssey 5, as well\nas the relationship between this poem and Ovid’s own version of an\n‘epic’ storm in the story of Ceyx and Alcyone at Metamorphoses\n11.410–748.3\nHowever, this poem contains much more than the sum of its\nvarious epic models: 1.2 is programmatic for the rest of Tristia 1, not\nleast because it can be seen as the first ‘proper’ poem of the collec-\ntion, given that 1.1 is addressed to Ovid’s new book of poetry as he\nsends it to Rome, and as such, self-consciously stands apart from the\nrest of the book.4 The second poem is more obviously integrated: it is\nthe first of three storm-at-sea poems (1.4 and 1.11 pick up the\ntheme), 1.10 expands upon the picture of Ovid travelling into exile by\nsea, providing an itinerary for the voyage, and 1.11 claims that the\nGreece & Rome, Vol. 53, No. 1, © The Classical Association, 2006. All rights reserved\ndoi: 10.1017\/S0017383506000052\n1 All references are to the Tristia unless specified otherwise. All translations are my own. An\nearlier version of this paper was delivered at the Sub-Faculty Seminar on the Sea in Oxford in\nearly 2002. My thanks are due to Matthew Leigh for the invitation to speak, and to all those\npresent for their stimulating suggestions. I would also like to thank Stephen Heyworth for read-\ning and making helpful comments on earlier drafts. Any errors and infelicities are entirely my\nown responsibility. The AHRB of the British Academy provided financial support during the\nperiod in which the original paper was written; their assistance is gratefully acknowledged.\n2 E.g. ‘Our poet knew the sea and sailing, but not as well as he knew his authors’ (J.-M.\nClaassen, ‘Ovid’s Poetic Pontus’, PLLS 6 [1990], 65–94).\n3 See H. B. Evans, Publica Carmina: Ovid’s Books from Exile (Lincoln and London, 1983),\n34–6, J. Gonzalez-Vazquez, ‘En torno a la retractatio de un pasaje virgiliano en Tristia 1.2’,\nLatomus 52 (1993), 75–83, and P. Hardie, Ovid’s Poetics of Illusion (Cambridge, 2002), 285–6.\n4 See Hor., C. 1.1 and Epist. 1.1, dedicatory opening poems which appear distinct from the\ncollections that they introduce.\nentire book was written on Ovid’s journey, often in stormy weather. In\naddition to storms and seafaring, Tristia 1.2 emphasizes – and, in\nsome cases, introduces for the first time – many of the other thematic\nconcerns that dominate the book, such as the anger of the gods,\nOvid’s wife, mythological parallels for Ovid’s plight, and the necessity\nof reading between the lines in the Tristia. The most important – and\noverlooked – programmatic element in our poem, however, is the\npolitical aspect which recent critical studies have emphasized else-\nwhere in Tristia 1.5 Here too, politics seem to play a large part; these\nare, after all, verses in which the foremost poet of Augustan Rome\ndetails the tribulations of his forced flight from Rome, persistently\nemphasizing that he is journeying into exile. In this paper, I explore\nthe political implications of Tristia 1.2 by examining three important\nelements of the poem: (a) exploitation of the Aeneid and the Odyssey;\n(b) allusions to Ovid’s previous career as a love elegist; and (c) the\npossibility of allegorical readings. We shall see that in Tristia 1.2 there\nare more dangers than those which the poet faces at sea.\n1. Ovid’s epic models\nCritics have identified many similarities between Tristia 1.2 and its\nepic models. In this section, I pinpoint several more debts which Ovid\nowes to Homer and Virgil, but my focus will be upon the way in\nwhich Ovid emphasizes the differences between his journey and those\nfound in his models, stressing the horrors of being an exile under\nAugustus.\nTristia 1.2’s programmatic use of the two epic heroes who most\nfamously wandered the seas as ‘exiles’ in the aftermath of the Trojan\nwar is explicit at lines 5ff. and thereafter features throughout the\nentire poem, which, couched in the form of a prayer to the gods from\nbeginning to end, can be seen as an expanded version of the prayers\nof Aeneas and Odysseus in the midst of the storms that they face. The\npoem opens in medias res, with Ovid praying in a storm:\nDi maris et caeli – quid enim nisi uota supersunt? –\nsoluere quassatae parcite membra ratis,\nneue, precor, magni subscribite Caesaris irae!\n74 OVID, TRISTIA 1.2\n5 See S. E. Hinds, ‘Booking the Return Trip: Ovid and Tristia 1’, PCPhS 31 (1985), 13–32,\nand S. E. Casali, ‘Quaerenti plura legendum: on the Necessity of “Reading More” in Ovid’s Exile\nPoetry’, Ramus 26.1 (1997), 80–112.\nGods of the sea and sky6 – for what remains except prayers? –\nrefrain from loosening the parts of my battered craft,\nand do not, I pray, second the anger of great Caesar!\nAs early as the opening couplet, there is a hint that Ovid sees himself\nas a latter-day Aeneas or Odysseus: soluere . . . membra (2) recalls\nAeneas’ reaction to the storm of Aeneid 1 (soluuntur frigore membra,\nAeneid 1.92), which is itself an adaptation of Odysseus’ reaction to the\nstorm at Odyssey 5.297: . The Virgilian\nphrase suggests Aeneas’ physical fear, and also evokes death: in a\nfamous piece of ring-composition, these words describe the dying\nTurnus at Aeneid 12.951. Here, the transfer of the phrase from the\nman facing the storm to the ship itself expresses Ovid’s fears that the\ncomponents of his ship will literally break up, which would of course\nmean death for the poet.\nThat Augustus is the ultimate cause of Ovid’s fear that he might\nlose his life at sea is hardly in tune with the princeps’ public image as a\nstatesman who, at least after the conclusion of the civil wars, practised\nclemency. Yet the epic parallels introduced at lines 4ff. suggest that\nAugustus is far from merciful:\nsaepe premente deo fert deus alter opem.\nMulciber in Troiam, pro Troia stabat Apollo; 5\naequa Venus Teucris, Pallas iniqua fuit.\noderat Aenean propior Saturnia Turno:\nille tamen Veneris numine tutus erat.\nsaepe ferox cautum petiit Neptunus Ulixem:\neripuit patruo saepe Minerua suo. 10\nOften when one god is oppressive, another brings help.\nMulciber stood against Troy, Apollo for Troy; 5\nVenus was fair to the Teucrians, Pallas unfair.\nSaturnia, closer to Turnus, hated Aeneas:\nhe however was safe thanks to the divine power of Venus.\nOften cruel Neptune attacked prudent Ulysses:\nMinerva often snatched him away from her uncle. 10\nIn particular, when Ovid mentions the enmity felt by Juno and\nNeptune towards Aeneas and Odysseus respectively, the reader recalls\nthat the anger of these gods was responsible for the storms unleashed\nupon these epic heroes.7 irae in line 3 hints that Augustus’ anger too\nOVID, TRISTIA 1.2 75\n6 caelum covers ‘heaven’ as well as ‘the sky’: see J. Henderson, ‘Not Wavering But Frowning:\nOvid as Isopleth (Tristia 1 through 10)’, Ramus 26.2 (1997), 138–71. Ovid thus appeals to all\ndivinities, not just those who have responsibility for the storm.\n7 E.g. Homer, Od. 5.287 and Virgil, Aen. 1.4, 35, 130, and 667–8.\nhas caused the storm of Tristia 1.2, painting him as a vengeful epic\ndeity who implacably persecutes those who offend him.\nHowever, Ovid acknowledges the gap between his own situation\nand the epic exempla of lines 4–10 at lines 11–12:\net nobis aliquod, quamuis distamus ab illis,\nquid uetat irato numen adesse deo?\nAnd for me, although I am different from those famous men,\nwhat prevents some deity being here, despite a god being angry?\nThe primary sense is that Ovid – an elegiac poet of Augustan Rome –\nis no epic hero, but this couplet also invites us to look for further\ndifferences between Ovid and his models. A major difference between\nOvid and Aeneas is that the latter was exiled from his homeland of\nTroy, but found a new home in Italy, as the reference to Turnus in\nline 7 implies. In contrast, Ovid has been exiled from Rome by Aeneas’\ndescendant, Augustus. This is perhaps most clear at lines 85ff.:\nnescioquo uideam positos ut in orbe Tomitas,\nexposco facilem8 per mea uota uiam.\nseu me diligitis, tantos compescite fluctus,\npronaque sint nostrae numina uestra rati;\nseu magis odistis, iussae me aduertite terrae:\nsupplicii pars est in regione mei. 90\nferte – quid hic facio? – rapidi, mea carbasa, uenti!\nAusonios fines cur mea uela uident?9\nnoluit hoc Caesar: quid quem fugat ille tenetis?\naspiciat uultus Pontica terra meos!\nSo I might see the Tomitans situated in I know not what part of the world,\nI demand an easy journey through my prayers.\nIf you love me, check these huge waves,\nand let your divine powers be kindly to my craft;\nif, rather, you hate me, turn me to the ordered land:\npart of my punishment consists of this region. 90\n76 OVID, TRISTIA 1.2\n8 The text of line 86 is disputed: the majority of MSS. contain exilem facio. However, critics\nrightly dispute that this can mean ‘I make slender’: see W. S. Watt, ‘Notes on Ovid’s Poems from\nExile’, ICS 13 (1988), 85–93. Hence the conjectures en celerem facio (Watt, op. cit., 85), uelocem\nfacio (J. Diggle; recorded in J. B. Hall, P. Ovidi Nasonis Tristia [Stuttgart, 1995], 26), and efficio\nfacilem (J. B. Hall, ‘Problems in Ovid’s Tristia’, PCPhS Suppl. 15 [1989], 20–38; facilem appears\nas a variant already in P4). Stephen Heyworth conjectures exposco facilem, which best explains\nthe vulgate, is well paralleled (cf. 1.11.22: [gubernator] exposcit uotis . . . opem), and makes good\nsense.\n9 I follow Hall 1995 (n. 8) in printing uident (the reading of several MSS.), which seems to\nanticipate aspiciat at 94, in preference to FGHPV’s uolunt (preferred by a majority of modern\neditors, and which is arguably picked up by noluit in the next line); the play on sight seems more\npointed than play on will.\nCarry, swift winds, my canvases—what am I doing here?\nWhy do my sails see the borders of Ausonia?\nCaesar did not want this: why do you detain a man he exiles?\nLet the Pontic land see my face!\nThese lines provide an ironic commentary upon Aeneid 3.521ff.,\nwhere the Trojans first catch sight of Italy, and Anchises prays:\n‘di maris et terrae tempestatumque potentes,\nferte uiam uento facilem et spirate secundi.’\n‘Gods of the sea, and the land and with power over storms,\nbring an easy path with the wind and blow favouringly.’\nAt the start of the Ovidian passage, Ovid repeats the prayer of\nAnchises, and lines 91–2 show that his request has been only too\nsuccessful, as the gods have granted winds that have carried Ovid, like\nAnchises, towards Italy. However, Ovid stresses that he has been\nexiled from Italy, in contrast to Anchises and the Trojans, for whom\nItaly is the desired goal. Like Anchises before him (who dies before\nthe Trojans manage to reach their new homeland), Ovid will not\nreach Ausonia (the use of this strongly epic term for Italy seems a\npointed reference to Ovid’s exploitation of Virgil here),10 but he is\nkept away from Italy through the will of Anchises’ descendant,\nAugustus, who has decreed the death of exile for him.11\nAnother major difference between the storm in Tristia 1.2 and\nthose found in Ovid’s epic models can be detected in the simile of\nlines 47–8:\nnec leuius laterum tabulae feriuntur ab undis\nquam graue ballistae moenia pulsat onus.\nNo more lightly are the planks of the hull struck by the waves\nthan when the siege-engine’s heavy burden pounds city walls.\nThis is a striking image of violence, suggesting that the destruction of\nthe ship is imminent, and it is an Ovidian innovation; no such simile\nfeatures in the storm descriptions of Odyssey 5 or Aeneid 1 (although\nOvid had used this image, along with other military similes, in the\nstorm of Metamorphoses 11; cf. Met. 11.507–9). It is instructive to\nOVID, TRISTIA 1.2 77\n10 Ausonia\/ -us occurs seventeen times in the Aeneid, five in Ovid’s Met.; contrast its single\nappearance in both Horace’s Odes and Propertius.\n11 For exile as death in Ovid’s exile poetry, see B. R. Nagle, The Poetics of Exile (Brussels,\n1980), 22–32.\nconsider here the similes for the action of the storm which we do find\nin these poems. Odyssey 5 has two: in the first, Odysseus’ raft is driven\nover the sea by the winds like a ball of thistles at harvest-time (Odyssey\n5.328–30). Then at lines 368–70 we read:\n( )\nAs a strongly-blowing wind will strew a heap of dry chaff,\nand scatter it now in one way and now in another,\nso it [sc. the wave] scattered the long timbers of the ship.\nThese are both similes for the effect of the winds upon Odysseus’ raft,\nand as such are similar in context to Ovid’s simile. However, Homer\nsoftens the violence of the storm by comparing it with scenes of agri-\nculture, the activity of peacetime rather than of war. Ovid’s choice of a\nsimile from siege warfare for the waves beating on the ship seems\npointed in comparison: in the Iliad and Odyssey, such similes remind\nus of the existence of a normal, everyday world, in contrast with the\nheroic, martial world that is primarily the theme of the poems.12\nOvid’s choice of simile may conversely suggest that, in the new epic\nage of Augustus, there is no longer any place for peace.\nViolence is also a feature of the Aeneid’s only simile within descrip-\ntions of storms at sea: at lines 148–56 of the first book, as he calms\nthe tempest, Neptune is likened to a statesman checking a riot. This\nfamous simile evokes Republican disturbances in Rome,13 but the\nfigure of the statesman also suggests Augustus, who had saved Rome\nfrom the political storms of the civil wars. Might Tristia 1.2, where\nAugustus, far from quelling a storm, has stirred one up, therefore\ncause us to re-read the end of the storm in Aeneid 1 in an ironic light?\nCritics have concentrated upon echoes of the Aeneid rather than of\nthe Odyssey in Tristia 1.2; this is perhaps unsurprising, given that Ovid\nowes a noticeable debt to the description of the storm that Aeneas\nfaces in the first book of the Aeneid throughout his ‘epic’ description\nof a storm in this poem, and the Aeneid seems to offer an important\nparallel for Tristia 1 as a whole. When we read the poems of Tristia 1\nthat follow 1.2, our poem seems to start an Ovidian, elegiac ‘re-run’\n78 OVID, TRISTIA 1.2\n12 See Il. 4.452–6 (a battle is compared with the mingling of mountain rivers) or 21.22ff. (the\nTrojans fleeing from Achilles’ murderous onslaught are like small fish fleeing a dolphin).\n13 See S. J. Harrison, ‘Virgil on kingship: the first simile of the Aeneid’, PCPhS 34 (1988),\n55–9.\nof the Aeneid: in this, the first ‘proper’ poem of the collection, Ovid\nfaces an epic storm similar to that faced by Aeneas in the first book of\nthe Aeneid. Then in 1.3, Ovid draws heavily upon Aeneid 2’s depiction\nof Aeneas’ last night in Troy to describe his own departure from\nRome.14 It is no surprise, then, to the reader of the Aeneid that Tristia\n1.4 recalls 1.2 by describing another storm at sea,15 evoking Aeneid\n3.192 ff.,16 which in turn recalls the storm of Aeneid 1.17 When we\ncome to Tristia 1.5, we might therefore expect Ovid to produce a\nversion of Aeneid 4: ‘adulterous’ love in a foreign land with a ‘married’\nwoman. Instead, Ovid disappoints the expectations raised by the\nprogramme hinted at in 1.2, by abandoning Aeneas as a parallel, and\nconcentrating on the similarities and differences between himself and\nOdysseus\/Ulysses, who is by far the more minor parallel in 1.2. Ovid\ndraws up a lengthy list of similarities and differences between himself\nand Odysseus at 1.5.57–84, and when we finally get a love poem in\nTristia 1, in the sixth poem, it is addressed to Ovid’s wife, who is\ncompared with Penelope.18 This casts Ovid as both another Odysseus,\nin his role as her absent husband, and also another Homer, in eulo-\ngizing her:19 the parallel between himself and Aeneas in 1.2 is\neventually shown to be misleading.\nOvid’s ultimate preference for Odysseus over Aeneas as a model in\nTristia 1 is suggestive in several ways. First, it implies that Ovid may,\nlike Odysseus, eventually return home to a peaceful existence with his\nbeloved and faithful wife (in strong contrast with the end of Aeneas’\nexilic wanderings, which bring turmoil to Italy). This may contain\nboth an ironic comment on Augustus’ view of Ovid as the promoter of\nadultery,20 and a hint to the princeps about a suitable resolution to\nOvid’s exile. Secondly, Ovid may also comment upon the end of the\nstorm scene in Odyssey 5, where Athene eventually calms the tempest\n(Od. 5.382–7). At Tristia 1.10.1ff., we learn that Minerva has\nprotected Ovid throughout his voyage; the reference here is not just to\nOVID, TRISTIA 1.2 79\n14 On this, see Evans (n. 3), 37.\n15 E.g. 1.4.5–10 is based upon 1.2.19–22 and 47ff.; 1.4.11ff. recalls 1.2.31–2; 1.4.17ff.\nrepeats the idea of 1.2.87ff.\n16 1.4.3 evokes Aen. 3.211 and 671.\n17 Aen. 3.176 recalls Aen. 1.86, 3.197 evokes 1.118, 3.199 echoes 1.88–9, and 3.200 draws\nupon 1.115: see references ad loc. with R. D. Williams, P. Vergili Maronis Aeneidos Liber Tertius\n(Oxford, 1962).\n18 1.6.22.\n19 1.6.21.\n20 See 2.211–12, where Ovid refers to one of the two charges on which Augustus relegated\nhim, especially at 212: arguor obsceni doctor adulterii (‘I am shown to be the teacher of obscene\nadultery’).\nthe goddess who championed Odysseus, but also to Minerva’s role as\npatron of art;21 as such, she naturally takes the side of poets. Given\nhints in Tristia 1.2 that Venus has also taken up Ovid’s cause (see\nsection 2), Ovid may suggest to Augustus that he has powerful gods –\nthose who are interested in poetry – on his side.\n2. Ovid as elegiac lover\nDespite the very obvious debt that Tristia 1.2 owes to epic models, Ovid\nis also keen to emphasize his credentials as an elegiac poet of love.\nThis is a subversive stance. Augustus notoriously exiled Ovid on duo\ncrimina, carmen et error (‘two charges, a poem and a mistake’, Tristia\n2.207): the carmen was the elegiac Ars amatoria, which outraged the\nspirit – if not the letter – of Augustus’ Leges Juliae de maritandis\nordinibus and de adulteriis coercendis, pro-marriage and anti-adultery\nlegislation of 18 BC, by purporting to teach the men and women of\nRome how to conduct affairs with each other. Given this background,\nOvid would have been wise to steer away as much as possible from\nerotic elegy in his post-exilic verse in order to avoid giving the\nemperor further offence. Let us now explore in some detail Ovid’s\nelegiac provocations.\nLove elegy is evoked as early as the third line, a prayer to the gods\nof sea and sky: neue, precor, magni subscribite Caesaris irae! (‘And do\nnot, I pray, second the anger of great Caesar’). The suggestion that\nthe winds might take Caesar’s side against Ovid recalls the opening of\nPropertius 1.17, where the shipwrecked elegist claims that the winds\nare taking Cynthia’s side against him, because he has run away from\nher (see in particular 1.17.5–6). The Propertian allusion implicitly\nand comically equates Augustus with the angry domina of elegy, who\npunishes her lover, enlisting the help of the weather, for fleeing from\nher – a particularly incongruous image given the predominance of\nepic models for Augustus in this poem,22 and, more importantly, his\nrole in making Ovid flee from Rome.\nAfter his prayer to the gods with responsibility for the weather not\nto aid Augustus, Ovid considers the possibility that the gods may\nrather help him in his plight at lines 4–12 (quoted in section 1).\n80 OVID, TRISTIA 1.2\n21 E.g. Fast. 3.816, where it is implied that she favours poets, and 883–4, where the impres-\nsion is confirmed.\n22 For Augustus equated with the elegiac domina elsewhere in the exile poetry, see Nagle\n(n. 11), 43.\nAlthough these lines primarily locate us in the world of Troy and epic,\nOvid also uses them to hint at his previous guise as a love elegist.\nSince lines 11–12 make it explicit that these exempla are provided as\nparallels for Ovid’s own fate, it is suggestive that each of the gods\nevoked as protectors (Apollo, Venus, Minerva) has strong poetic\nconnections. In particular, Venus, the only deity to feature twice here,\nis not just the patron of the Trojans and the divine mother and\nprotectress of Aeneas, but also Ovid’s champion. The connection\nbetween Venus, goddess of love, and Ovid, her poet, is clear for\nexample from Amores 3.15.1, Ovid’s ‘farewell’ to first-person love\nelegy (Quaere nouum uatem, tenerorum mater amorum; ‘Seek a new\nbard, mother of the tender loves\/ Amores’), from Fasti 4.1ff., where the\npair converse, or from Ars 3.43ff., where Ovid claims that Venus\nordered him to teach women the art of love, and relates her gift of\nmyrtle to him. The idea that Venus might take up the cause of her\npoet to protect him from the anger of Augustus is particularly subver-\nsive, not least because Augustan propaganda stressed Augustus’ claim\non Venus as his ancestress.\nThe most sustained evocation of Ovid’s past as a love elegist in this\npoem is found at lines 75ff., which discuss the reasons for Ovid’s\npresent  voyage. He  starts  by  listing  various  motives  for  seafaring,\nwhich he claims, with an emphatic negative at the start of each\ncouplet, are not the purpose of his own journey:\nnon ego diuitias auidus sine fine parandi\nlatum mutandis mercibus aequor aro,\nnec peto, quas quondam petii studiosus, Athenas,\noppida non Asiae, non loca uisa prius,\nnon ut Alexandri claram delatus ad urbem\ndelicias uideam, Nile iocose, tuas. 80\nIt’s not that, keen to amass riches without limit,\nI plough the wide sea to trade merchandise,\nnor that I seek Athens, which I once sought for study’s purpose,\nnor the cities of Asia, nor places seen before,23\nnor am I brought down to the shining city of Alexander\nin order to see your delights, playful Nile. 80\nOVID, TRISTIA 1.2 81\n23 It is standard to supply mihi to non loca uisa prius and take in apposition to oppida non\nAsiae, given the supposedly autobiographical information elsewhere that Ovid had visited Asia\n(cf. n. 25), and the parallel of having visited Athens before (line 77). However, non loca uisa prius\nmay also refer to the popularity of Asia as a tourist destination, and allude to Tomi, Ovid’s\ncurrent destination, as a place unknown to the majority of Romans.\nThese reasons for setting sail are worth exploring further. A variety of\nliterary sources present greed as one of the primary motivations for\nseafaring,24 and Ovid evokes this topos with the auidus merchant at\n75–6, who seeks wealth sine fine (the phrase humorously suggests both\nthat the merchant seeks ‘limitless wealth’, and ‘continually’ seeks\nwealth). The combination of the man auidus for wealth with the meta-\nphor of ‘ploughing’ the sea (75–6) is found in an earlier Ovidian\npassage, Amores 2.10.33–6:\nquaerat auarus opes et, quae lassarit arando,\naequora periuro naufragus ore bibat.\nat mihi contingat Veneris languescere motu,\ncum moriar, medium soluar et inter opus.\nLet the greedy man seek wealth, and let him drink with lying mouth\nthe waters which he has worn down by ploughing.\nBut may it befall me to swoon in the act of love\nwhen I die, and may I find release in the middle of the act.\nOur passage, then, perhaps suggests that Ovid’s rejection of the life\nand death of a merchant is in favour of a life of, and death in, the act\nof love, marking him out as very much still a love elegist.\nThe next couplet evokes the notion of travel for study and sight-\nseeing, and purports to give us information about voyages that Ovid\nhas previously undertaken: Ovid alleges that he has visited Athens\nfor study (studiosus, 77), and elsewhere claims to have visited Asia, a\ntourist destination for wealthy Romans.25 Despite the supposedly\nautobiographical nature of this couplet, its details and the ordering of\nmaterial recall Propertius 1.6.13ff.:\nat mihi sit tanti doctas cognoscere Athenas\natque Asiae ueteres cernere diuitias,\nut mihi deducta faciat conuicia puppi\nCynthia et insanis ora notet manibus . . .\nBut is it worth so much to me to get to know learned Athens\nand to see the ancient riches of Asia,\nif Cynthia might accuse me when my ship is drawn down\nand mark my face with crazed hands . . .\n82 OVID, TRISTIA 1.2\n24 E.g. Hor., Sat. 1.4.29–32, Tib. 1.3.39–40 and Pliny, N.H. 2.125.\n25 For Ovid’s travels in the East, see Pont. 2.10.21ff., and Fast. 6.423. For the ‘grand tour’ in\nthe East of wealthy young Romans, see Hor., Epist. 1.11.1ff., Cat. 46.6, and Prop. 3.22.\ndoctas . . . Athenas in the Propertian hexameter suggests Athens as a\ndestination for study, and the pentameter’s cernere sightseeing in Asia;\nOvid alludes to this couplet by reflecting its order in lines 77–8. By\nrecalling this passage, Ovid suggests both parallels and differences\nbetween himself and Propertius: Propertius did not journey to the\nEast in order to study or see the sights because he was detained in\nRome by elegiac love;26 Ovid is now travelling East not for either of\nthose reasons, but, in marked contrast with Propertius, his devotion to\nlove elegy – in the form of the offensive Ars amatoria – has caused his\nexilic voyage.\nLines 79–80 imply travel undertaken for a slightly different\npurpose: not so much the pleasures of tourism as those of the flesh.\nAlexandria was a cultured city, but it and Egypt in general had a racy\nreputation in the ancient world.27 Ovid’s choice of vocabulary alludes\nto this: delicias can mean ‘love affairs’ or ‘peccadilloes’,28 and iocosus\nhas sexual overtones.29 Thus Ovid may suggest that he could be going\nto Alexandria as a ‘sex tourist’; something we might expect from the\nauthor of the Ars amatoria.\nHowever, the abundance of negatives in lines 75–80 does not let us\nforget that Ovid’s voyage is not a normal journey of the type any\nRoman might make, but instead, as he stresses at lines 81–2:\nquid faciles opto uentos – quis credere possit? –\nSarmatis est tellus, quam mea uela petunt.\nThe reason why I pray for favouring winds – who could believe it? –\nis the Sarmatian land, which my sails seek.\nThe undesirability of the place to which Ovid is travelling is stressed\nby the parenthetical question at the end of 81, and the contrast with\nlines 75–80 is clear: all of the reasons for undertaking sea voyages\npreviously outlined were at least credible. The goal of Ovid’s journey\nthrough this storm is, however, unbelievable. Sarmatis est tellus is the\nmost definite information that Ovid’s writing has given thus far about\nOVID, TRISTIA 1.2 83\n26 Contrast Prop. 3.21, where he claims that he is going to travel to Athens in order to escape\nlove.\n27 See e.g. Strabo 17.1.16ff., Juv. 15.44–6, and Mart. 4.42.1–4 (where Martial opts for a toy-\nboy from Egypt on the grounds that nequitias tellus scit dare nulla magis; ‘no land knows better\nhow to provide naughtiness’).\n28 See 2.368, Rem. 154 and R. Pichon, Index Verborum Amatoriorum (Paris, 1902 =\nHildesheim, 1966), 125–6.\n29 See 2.422, Met. 3.332, Fast. 5.183, 6.692, and Ib. 263.\nthe location of his exile. Ovid expands upon this in the lines that\nfollow (83–4):\nobligor ut tangam laeui fera litora Ponti;\nquodque sit a patria tam fuga tarda, queror.\nI make vows in order to touch the savage shores of Pontus on the left;\nand I lament that my flight from my fatherland is slow.\nWith the first occurrence of the verb queror in the Tristia at line 84,\nOvid makes a generic point with political overtones: although queror\nmost often refers to erotic lament, the elegists self-consciously employ\nthe verb to emphasize elegy’s supposed origins in funeral lament,30\nand its use here in close conjunction with fuga, a synonym for\n‘exile’,31 stresses the point made at line 72 that exile spells death for\nOvid. Ovid thus restores elegy to its original function by writing\nlaments for his own death.32 This shows the enormous effect that\nAugustus has had upon Ovid’s elegies: by condemning him to the\n‘living death’ of exile, he has changed the course of Ovid’s elegies;\nonce, Ovid’s elegies had lamented his erotic circumstances,33 but now\nhe must mourn his own death.\n3. So when you’re near me, darling, can’t you hear me, S.O.S.?\nAllegory – a frequent feature of verse about the sea and seafaring,\nfrom archaic Greek lyric onwards34 – is a persistent and unsettling\npresence in Tristia 1.2, which causes the reader to question the status\nof the poem: is this, as it purports to be, an autobiographical episode\ntaken from Ovid’s journey east from Rome into exile, or are there\ndeeper and more treacherous currents?\n84 OVID, TRISTIA 1.2\n30 See Am. 1.1.21, 3.9.1–4, and Her. 1.8. See too S. E. Hinds, The Metamorphosis of\nPersephone (Cambridge, 1987), 103–4, R. G. M. Nisbet and M. Hubbard, A Commentary on\nHorace: Odes Book 1 (Oxford, 1970) on Horace, C. 1.33.2, and C. O. Brink, Horace on Poetry:\nArs Poetica (Cambridge, 1971) on Hor. A. P. 75–8.\n31 See 1.1.56, 1.3.50, 3.14.9, 4.10.89–90, Pont. 1.2.128, and Met. 10.232–3. Cf. also Cic.,\nCat. 2.14, Livy 5.53.5, Sen., Med. 948, and TLL 6.1.1465.74ff.\n32 See 1.8.50, 3.3 (passim) and Nagle (n. 11), 22ff.\n33 For queror in Ovid and love poetry more generally, see Pichon (n. 28), 248–9.\n34 See Alcaeus frr. 6 and 208 (following the numeration of D. A. Campbell, Greek Lyric\nVolume I [Cambridge, Mass., 1990]), Archilochus 105 and 106 (following the numeration of\nM. L. West, Iambi et Elegi Graeci [Oxford, 1989–92]) and Nisbet and Hubbard (n. 30), on Hor.,\nC. 1.14.\nUntil we come to the detailed description of the storm at 13ff., the\nopening lines (for which, see section 1) may appear allegorical.\nStorms regularly act as a metaphor for powerful emotions: for\nexample, Ovid had illustrated Althaea’s mental turmoil by using the\nsimile of a boat driven by storm winds at Metamorphoses 8.470–4.35\nMore pertinently, ships are often used as a metaphor for the poetic\n‘craft’;36 Ovid had frequently employed this motif in his Ars amatoria\nto illustrate the progress of his poetry: for example, Ars 1 ends with an\nimage of the safety of Ovid’s ship of poetry, reflecting the accomplish-\nment of the book so far:37\npars superat coepti, pars est exhausta laboris.\nhic teneat nostras ancora iacta rates.\nPart of my undertaking remains, part of my task is finished.\nLet the cast anchor hold my craft here. (Ars amatoria 1.771–2)\nIn contrast with this positive image, the shattered ship as metaphor for\nthe fate of Ovid and his poems is a recurring feature of the exile\npoetry,38 found as early as the first poem of the Tristia:\net mea cumba semel uasta percussa procella\nillum, quo laesa est, horret adire locum.\nAnd my skiff, once struck by a huge squall,\nshrinks from approaching that place, in which it was harmed.\n(Tristia 1.1.85–6)\nThat Ovid’s ship is now ‘battered’ can be read as an ironic comment\non Ovid’s use of this metaphor in the Ars amatoria: in the Ars, Ovid\nhad claimed that his poetic craft was making good progress, but the\nArs, as we learn in Tristia 1.1, was one of the causes of his exile,39 and\nthereafter causes Ovid’s poetic craft to suffer a buffeting. An allegor-\nical interpretation of the storm of 1.2 is also supported by the\nequation of the storm with the anger of Augustus at line 3, since Ovid\nrepeatedly identifies Augustus with Jupiter in the exile poetry,40 and\nportrays his punishment at the hands of the former as akin to Jove’s\nOVID, TRISTIA 1.2 85\n35 See Am. 2.10.9–10 and Sen., Ag. 138–44.\n36 See E. J. Kenney at N. I. Herescu, Ovidiana (Paris, 1958), 205–6.\n37 See Ars 2.9–10, 3.26, 99–100, 500, and 747–8.\n38 See 5.11.13–14, Pont. 2.3.58, and Ibis 17–18 with A. La Penna, Ibis (Florence, 1957), who\ncomplains that the constant use of the metaphor in the exile poetry is exasperating!\n39 As is clear at e.g. 1.1.67–8, and 2.207.\n40 See 1.1.81, K. Scott, ‘Emperor Worship in Ovid’, TAPhA 61 (1930), 43–69, and W. Warde\nFowler, ‘Note on Ovid, Tr. 3.6.8 (Augustus et Juppiter)’, CR 29 (1915), 46–7.\nthunderbolt.41 He thereby equates the princeps with Jupiter Tonans,\nthe weather god responsible for dispensing thunder and lightning –\ncommon elements in descriptions of storms,42 which duly feature here\nat lines 45–6:\nei mihi, quam celeri micuerunt nubila flamma!\nquantus ab aetherio personat axe fragor!\nAlas for me! How the clouds flash with speedy flame!\nWhat a huge crashing resounds from the pole above!\nThe reader may therefore suspect that Ovid here allegorizes his expe-\nrience of exile at Augustus’ hands. However, the hints of allegory in\nOvid’s opening soon appear teasing: at 13ff., we are treated to the\nspectacle of the waters spattering Ovid’s mouth as he speaks, and the\nwind snatching away his words:\nuerba miser frustra non proficienta perdo:\nipsa graues spargunt ora loquentis aquae,\nterribilisque Notus iactat mea dicta, precesque\nad quos mittuntur, non sinit ire deos.\nPoor wretch, I waste in vain words that achieve nothing:\nviolent waters spatter my lips even as I speak,\nand the fearful South wind tosses about my words and does not allow\nmy prayers to arrive at the gods to whom they are sent.\nThis may seem a strong evocation of an actual storm, but it too is\nopen to a metaphorical reading: the reference to wind and water\ncombining to render Ovid’s words pointless may recall Catullus 70,\nthe classic statement on the worthlessness of the words which lovers\nemploy in pursuit of their goals:\nNulli se dicit mulier mea nubere malle\nquam mihi, non si se Iuppiter ipse petat.\ndicit: sed mulier cupido quod dicit amanti,\nin uento et rapida scribere oportet aqua.\nMy woman says that she would prefer to marry no one\nthan me, not if Jupiter himself were to woo her.\nShe says that: but what a woman says to an eager lover,\nshould be written on wind and moving water.\n86 OVID, TRISTIA 1.2\n41 See 1.1.72, 81, and A. Barchiesi, The Poet and the Prince (Berkeley and Los Angeles, 1997),\n42–3.\n42 See Aen. 1.90 and Met. 11.496.\nAny allusion to the untrustworthiness of the words of lovers must\nsurely be felt to be troubling in the context of Tristia 1.2: for, as we\nhave already seen in the second section, Ovid portrays himself as a\nlover in Tristia 1.2, a poem which proclaims his innocence of any guilt\nvis-à-vis his alleged offences against Augustus,43 and moreover\nprotests his devotion to the princeps and his house.44 Ovid may there-\nfore hint that the words of the poem as an entirety have deserved their\nbuffeting from wind and water, since, like the words of lovers, they are\nfar from sincere, and perhaps tell the princeps what he wants to hear,\nin pursuit of Ovid’s own selfish goal: the lessening of Augustus’ anger\nagainst him.\nMetaphors with political implications also seem to play a part in\nOvid’s description of the prospect that faces him at lines 23–4:\nquocumque aspicio, nihil est, nisi pontus et aer,\nfluctibus hic tumidus, nubibus ille minax.\nIn whatever direction I look, there is nothing except sea and the air above,\nthe former swollen with waves, the latter threatening with clouds.\nThe hexameter recalls two scenes in the Aeneid where the hero faces a\nstorm at sea (caelum undique et undique pontus;45 ‘sky everywhere and\neverywhere sea’, 3.193 and maria undique et undique caelum; ‘sea every-\nwhere and everywhere sky’, 5.9), but quocumque aspicio makes Ovid’s\nplight more vivid than that of Aeneas, while acknowledging the\nsubjectivity of his account. The description of the pontus as tumidus\n(24) draws attention to his epic model, since tumidus alludes to the\n‘swollen’ size of epic elsewhere in Latin literature.46 For example,\nOvid had similarly marked the start of the ‘epic’ storm in the Ceyx\nand Alcyone episode at Met. 11.480–1:47\ncum mare sub noctem tumidis albescere coepit\nfluctibus . . .\nWhen the sea, towards night, began to grow white\nwith swollen waves . . .\nOVID, TRISTIA 1.2 87\n43 Cf. 1.2.97ff.\n44 Cf. 1.2.101ff.\n45 G. Luck, P. Ovidius Naso: Tristia Band II: Kommentar (Heidelberg, 1977) on 1.2.23,\nsuggests that Virgil here perhaps draws upon Moschus, Europa 132–3.\n46 See Cat. 95.10, where the epic poet Antimachus is described as tumidus, Met. 1.460\n(tumidum Pythona; ‘swollen Python’, in the first traditionally martial, ‘epic’ episode of the poem),\nand Hor., Epist. 2.2.201 (Horace is not carried tumidis uelis; ‘on swollen sails’).\n47 Cf. Aen. 1.142, where Neptune soothes tumida aequora (‘swollen waters’), marking the end\nof the epic storm, and Fast. 3.595, where Dido’s sister Anna iactatur tumidas . . . per undas (‘is\ntossed through the swollen [i.e. epic] waves’).\nThe elegiac Ovid seems out of his depth in such a setting; this recalls\nPropertius’ rejection of the swollen sea of epic at 3.9.35–6:\nnon ego uelifera tumidum mare findo carina:\ntota sub exiguo flumine nostra mora est.\nI do not cleave the swollen sea with a sail-bearing ship:\nI delay continually in a small stream.\nHowever, Ovid’s brush with the vengeful Augustus, who could be one\nof the angry deities who populate epics (as lines 1–12 point out; see\nsection 1), has led him to the swollen seas usually associated with that\ngenre. Furthermore, a time will soon come when pontus (23) can be\ncapitalized, as the region in which Ovid must spend his exile, where\nhe will face suffering on land, and be forced to bear epic arms.48\nThe description of the aer as nubibus . . . minax can also be read as\na metaphor for Ovid’s clash with Augustus: for aer often stands for the\nheavens (the sphere from which we learn elsewhere in the Tristia that\nAugustus, a vengeful Jupiter, launches thunderbolts at Ovid), and\nnubibus perhaps suggests that Augustus is creating suitable weather\nconditions to launch yet another attack.\nLines 31–2 depict the helmsman losing control of the ship in these\ntroubled waters:\nrector in incerto est, nec quid fugiatue petatue\ninuenit: ambiguis ars stupet ipsa malis.\nThe helmsman is all at sea, and cannot find what he should flee or seek:\nhis very art is stunned among unsettled evils.\nThis is a typical feature of descriptions of storms,49 which Ovid had\nexploited in similar language at Met. 11.492–4:\nipse pauet nec se, qui sit status, ipse fatetur\nscire ratis rector, nec quid iubeatue uetetue:\ntanta mali moles tantoque potentior arte est.\nEven the helmsman is afraid and confesses that he does not know\nthe state of affairs, nor what he should order or forbid:\nso great the weight of misfortunes, and more powerful than his great skill.\n88 OVID, TRISTIA 1.2\n48 See 4.1.71ff.\n49 See 1.4.11–16, 1.11.21–2, Fast. 3.593–4, Aen. 1.115ff. (the helmsman of Orontes’ ship is\nswept into the waves), 3.192ff. (especially 201–2) and 5.8ff. (especially 12ff., where Palinurus is\nreduced to praying to Neptune).\nDespite the conventional nature of this topos, Ovid’s vocabulary is\nsuggestive in the context of his exile. The fact that the helmsman’s ars\nis no use to him in such dangers and stupet surely calls to mind Ovid\nhimself:50 his Ars (amatoria) had led him to the epic storm he now\nfaces, and he himself is stunned at this. Compare the description of\nhis reaction to his punishment at 1.3.11–12:\nnon aliter stupui, quam qui Iouis ignibus ictus\nuiuit et est uitae nescius ipse suae.\nI was dazed like when someone struck by the lightning of Jove\nlives and does not realize that he’s still alive.\nThe failure of the helmsman’s\/Ovid’s ars here is in ironic contrast to\nthe start of the Ars, where Ovid had declared himself the Tiphys . . .\nAmoris (‘the helmsman of Love’, Ars 1.8).\nAn even more political reading of these lines is possible: rector (31)\nmay suggest Augustus as the helmsman of the state. This metaphor\nfor political leadership had been explored at length in Aeneid 5,51 and\nAugustus (along with other leaders) is frequently referred to as rector\n(vel sim.);52 contemporary art also depicts the victor of Actium in this\nrole.53 If we take rector here as an allusion to Augustus and the ship of\nstate, Ovid suggests that the princeps has lost sight of his role in\nguiding Rome; this seems appropriate, given that the first book of the\nTristia was composed in AD 8–9,54 a time of great political unrest in\nRome,55 during which period Pliny (N.H. 7.147–9) suggests that the\nprinceps was driven by his many and various problems to contemplate\nsuicide.\nThis interpretation receives some support at lines 49–50:\nOVID, TRISTIA 1.2 89\n50 For parallels for stupet, cf. 1.4.11–12 and 1.11.21–2. ambiguus (32) points to the ambig-\nuous (or ‘double’) interpretation of words at Met. 7.821, and may hint at such a double reference\nto ars\/Ars (i.e. the Ars amatoria) here.\n51 See A. Feldherr, ‘Ships of State: Aeneid 5 and Augustan Circus Spectacle’, ClAnt 14.2\n(1995), 245–65.\n52 See CIL 12.4333.16 and Manil. 1.916. For gubernator (‘helmsman’) used metaphorically\nof political leaders, see TLL 6.2.2348.37ff.\n53 A cameo of the late 30s BC depicts Octavian as a Neptune-like figure, driving a chariot over\nthe ocean (for slippage between boats and chariots in literary depictions, see e.g. Virgil, Aen.\n5.144ff. and Feldherr [n. 51], 245, n.1 and passim). For more on this, see G. K. Galinsky,\nAugustan Culture (Princeton, 1996), 21–2.\n54 Allegedly during Ovid’s journey into exile (so 1.11.1–2), which can be dated to late AD 8–\nearly AD 9, from the evidence of 1.11.3–4 (Ovid claims that he was in the Adriatic in December;\nan emotive claim, producing pity for the poet forced to sail into relegation from Rome well past\nthe usual sailing season).\n55 See Dio 56.10.1 and Suet., Aug. 34.2, and T. Wiedemann, ‘The Political Background to\nOvid’s Tristia 2’, CQ 25 (1975), 264–71.\nqui uenit hic fluctus, fluctus supereminet omnes:\nposterior nono est undecimoque prior.\nHere comes a wave, that overtops all the waves:\nit is after the ninth wave and before the eleventh.\nLine 49 is an adaptation of the opening of a poem which depicts\nAlcaeus as speaking on board a ship in the midst of a storm:\n. . .\nThis wave comes higher than the one before . . . (fragment 6.1–2)\nOvid’s use of Alcaeus fragment 6 here deserves further consideration.\nFirst, it introduces a close literary parallel of a different type to the\nepic echoes usually privileged in discussions of Tristia 1.2: as far as we\ncan tell, fragment 6 purports to be the poet’s own words as he faces a\nstorm at sea. The reader who notes the allusion cannot fail to recall\nthat Alcaeus was one of the most famous literary exiles before Ovid.56\nSecondly, Ovid’s use of Alcaeus has a strongly political dimension:\nHeraclitus, Hom. Alleg. 5 quotes the first three lines of the fragment as\nan example of allegory, referring to the tyranny of Myrsilus; this inter-\npretation is supported by the occurrence of the word later\nin the fragment (6.27),57 and by the mention of Myrsilus’ name in a\nmarginal comment. The interpretation of Alcaeus fragment 6 as a\npoem about the ‘ship of state’ may further be confirmed by Horace,\nOdes 1.14, which has been seen as a Roman and updated version of\nthe archaic Greek lyric poem.58 Ovid’s adaptation of Alcaeus there-\nfore suggests that the storm of Tristia 1.2 can be read as a political\nallegory. This is supported by the fact that the storm seems to be\ncaused by Augustus’ anger at lines 3 and 108. Such a reading of\nTristia 1.2 is extremely subversive: Ovid suggests not only that the\nship of state faces a storm, but that its ruler, Augustus, has caused this\ntempest.59 It is possible that Ovid thereby introduces a new element\n90 OVID, TRISTIA 1.2\n56 See test. 6, 7, 24 in Campbell (n. 34) and Hor., C. 2.13.27–8, where Alcaeus’ output is\nsummarized thus: dura nauis,\/ dura fugae mala, dura belli (‘the harshness of seafaring\/ the awful\nharshness of exile, the harshness of war’). Alcaeus opposed the tyrants of his homeland (cf. e.g.\ntest. 1 in Campbell [n. 34]); might Ovid’s use of him suggest that Ovid too did this?\n57 See D. A. Campbell, Greek Lyric Poetry (London, 1982), 288.\n58 Cf. Nisbet and Hubbard (n. 30) ad loc. Stephen Heyworth suggests that C. 1.14 simul-\ntaneously invites and resists allegorical interpretation; Ovid may play upon this in 1.2, as I\nsuggest above.\n59 Cf. A. Cucchiarelli, ‘La nave e l’esilio (allegorie dell’ultimo Ovidio)’, MD 38 (1997),\n215–24.\nto the topos; for it is uncertain that the storm of renewed civil strife in\nAlcaeus fragment 6 is actually caused by Myrsilus as ruler of\nMytilene, and it is at any rate hard to see the poet of the Odes writing\na ‘ship of state’ allegory in which Augustus is held responsible for\ndisturbing the status quo.\nAll of these passages, if read as metaphorical rather than literal,\nserve to create the impression that Tristia 1.2 is an allegory which\ndepicts Augustus not as the capable ruler of Rome and patron of\npoets that he was keen to be seen as, but rather as an enemy of art, an\nepic figure whose encounter with Ovid’s elegiac craft has blown it off\ncourse, and indeed who appears to be intent upon destroying Ovid –\nand possibly Rome itself.\nIn conclusion, then, Tristia 1.2 is much more than simply a poem\nabout a storm at sea, complete with epic trappings. Rather, it plays an\nimportant role in establishing politics as a major concern of Tristia 1,\nand, indeed, the letters from exile as a whole.\nOVID, TRISTIA 1.2 91\n"}