{"doi":null,"coreId":"10747","oai":"oai:www.e-space.mmu.ac.uk:2173\/87255","identifiers":["oai:www.e-space.mmu.ac.uk:2173\/87255",null],"title":"Harmonising the process of procuring library management systems: a feasibility study","authors":["Fisher, Shelagh","Delbridge, Rachel","Lambert, Sian"],"enrichments":{"references":[{"id":17790982,"title":"All systems go: the electronic library Part 2","authors":[],"date":"1998","doi":null,"raw":"Duncan, M.  (1998) All systems go: the electronic library Part 2 Managing Information 5 (7) Sept.  p.33-36 Evans, P. (2000) Core functionality spec - Is the time right? Bibliotech Review May 2000  http:\/\/www.biblio-tech.com\/BTR900\/May_2000\/core_specification.html Glogoff, S.  (1994) Reflections on dealing with vendors  American libraries 25 (4) p.313-314 Grant, C.  (1999) Choose wisely: making the library’s money work for the library system in the procurement process  New Library World 100 (1152) p. 302-306.","cites":null},{"id":17790983,"title":"Finding out is what they’re all about: the function of the library systems specification Its News (19) May p.50-52 HM Treasury, Central Unit on Purchasing","authors":[],"date":"1989","doi":null,"raw":"Heseltine, R.  (1989) Finding out is what they’re all about: the function of the library systems specification  Its News (19) May p.50-52 HM Treasury, Central Unit on Purchasing (1991) Specification writing (CUP Guidance No. 30)  http:\/\/porch.ccta.gov.uk\/treasury\/reports.nsf Keene, S.  (1996) LASSI: the Larger Scale Systems Initiative  Information Services and Use 16, 1996 p. 223-226 KPMG (1995) A business analysis of the library systems market in Europe Electronic Library 13 (3) p.209-216 Leeves, J and Russell, R. (1995) Libsys.uk: a directory of library systems in the UK LITC, 1995 Lilley, V.  (1996) Managing procurement  Information Management Report, p.16-19 Muirhead, G. (ed) (1997) Planning and implementing successful systems migrations Library Association Murray, I.R. (1997) Assessing the effects of new generation library systems  31(4) Oct. p.313-327 Murray, R.  (1999) The Digital library jigsaw: fitting the pieces together  Online Information 1999: Proceedings of the 23 rd International Online Information meeting, London 7-9 Dec. 1999, Learned Information. p.175-180 Myhill, M.  (2000) Time for change: a personal insight into library systems implementation: experiences at Exeter University Library.  Program 34(1) p.89-101 Nicholson, D.M. (1987) Choosing a library system  Library Review 56? Sept 1987 p.48-56 Public Record Office (1999) Functional requirements for electronic records management systems: Part 1: Statement of functional requirements Raven, D. (2000)  Library systems marketplace Library Association Record 102(1) p.32-33 Rowley, J.E. (1989) Library systems specifications: what, why and how. IT’s News,46 May p. 38-48 Rowley, J.E. (1994) Making the right choice: strategies and pointers for the selection of library and information systems.  Managing Information 1 (2) p. 26-31 Stowe, M. (1999) To RfP or not to RfP: that is the question Jounal of Library Administration 20 (3\/4) p. 53-74 Wanniger, P.D.  (1990) The sound and the fury of RfP  Library Journal Dec p. 87-89 Wilkinson, F.C. and Thorson, C.C. (1995) The RfP process: rational, educational, necessary – or there ain’t no such thing as a free lunch  Library Acquisitions: practice and theory 19 (2) p.251-268.47","cites":null},{"id":17790981,"title":"The integrated library system: yesterday, today and tomorrow Information UK Outlooks (33), August Boss,","authors":[],"date":"1999","doi":null,"raw":"Akeroyd, J. (1999)  The integrated library system: yesterday, today and tomorrow Information UK Outlooks (33), August Boss, R.W.  (1990) The procurement of library automated systems Library Technology Reports p. 627-657 Clayton, M and Batt, C.  (1992) Managing library automation 2 nd ed.  Ashgate Dawson, D.  (1998) SPECTRUM Profiles: a framework for software  Information 3 (1) Dover, M. (1991)  Issues in the use of library automation, LITC.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2009-12-02T14:27:23Z","abstract":"Full-text of this article is available at http:\/\/www.cerlim.ac.uk\/projects\/harmonise\/harmonise.pdf","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/10747.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/2173\/87255","pdfHashValue":"caa0e0d81aab34b0e0e7b5afd807c4c1ae9a4eec","publisher":"Resource: The Council for Museums, Archives and Libraries","rawRecordXml":"<record><header><identifier>\noai:www.e-space.mmu.ac.uk:2173\/87255<\/identifier><datestamp>2009-12-02T14:27:23Z<\/datestamp><setSpec>hdl_2173_682<\/setSpec><\/header><metadata><oai_dc:dc xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Harmonising the process of procuring library management systems: a feasibility study<\/dc:title><dc:creator>Fisher, Shelagh<\/dc:creator><dc:creator>Delbridge, Rachel<\/dc:creator><dc:creator>Lambert, Sian<\/dc:creator><dc:description>A new library management system is a significant investment for libraries, but the\nprocurement of a system is, for most organisations, an infrequent activity with little\nopportunity for librarians to build on or consolidate their experience. Problems\nencountered by librarians in producing a specification are compounded by new\ndevelopments in technology. The process of specifying the operational requirements of\na system can be problematic, time consuming and expensive for a library. There is no\nstandard guidance available on the format and content of the specification. The\nprocurement process is also difficult for potential system suppliers who, in order to\nsell a system, must respond to specifications which are very variable in terms of\ncontent, format and quality. The aim of this research, therefore, was to determine the\nfeasibility of developing and disseminating a model system specification which could\nbe used to assist and guide libraries in the procurement of library management\nsystems. Forty-one specifications, collected from libraries which had recently acquired\na library management system, were analysed. The results demonstrate that the\nspecifications included the same broad categories of information and requirements,\nwith the majority specifying requirements for all or most of the core modules\n(Cataloguing, Acquisitions, Circulation, Serials). The functional requirements specified\nfor each of the core modules had strong similarities both within and across the sectors\n(public, academic, special). Some ‘additional’ (i.e. non-core) features were required\nwithin the sectors. There was wide variation both between and within sectors in the\nformat, organisation, level of detail and terminology used in the specifications. A\nsurvey of UK system suppliers was also undertaken to determine the collective view\nof suppliers on the role, content, quality and usefulness of the specification as a\nprocurement tool. Suppliers expressed frustration with the tendency for specifications\nproduced by librarians to be dominated by lists of functional requirements which were\npresent in all library management systems on the market today. The Report\nconcludes with recommendations for the development of a plain English guide to new\ntechnological developments and their implications for libraries, the development of an\nannual short course for middle managers currently involved in procurement, and the\ndevelopment of a toolkit of basic functions which can be expected in all library\nmanagement systems. A recommendation for further research on common\nrequirements for computer based management of resources in libraries is also made.<\/dc:description><dc:description>Full-text of this article is available at http:\/\/www.cerlim.ac.uk\/projects\/harmonise\/harmonise.pdf<\/dc:description><dc:publisher>Resource: The Council for Museums, Archives and Libraries<\/dc:publisher><dc:date>2009-12-02T14:27:23Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>1902394569<\/dc:identifier><dc:identifier>1466-2949<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/2173\/87255<\/dc:identifier><dc:language>en<\/dc:language><dc:relation>http:\/\/www.cerlim.ac.uk\/projects\/harmonise\/harmonise.pdf<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/www.cerlim.ac.uk\/projects\/harmonise\/harmonise.pdf"],"year":2009,"topics":[],"subject":["Article"],"fullText":""}