{"doi":"10.1080\/0968776000080301","coreId":"6477","oai":"oai:generic.eprints.org:336\/core5","identifiers":["oai:generic.eprints.org:336\/core5","10.1080\/0968776000080301"],"title":"Editorial","authors":["Jameson, Jill","Conole, Gráinne"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2000","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/6477.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/336\/1\/ALT_J_Vol8_No3_2000_Editorial.pdf","pdfHashValue":"e2a7a138d7bd21d6f5ae4b52c3e5b0adf4efebde","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:336<\/identifier><datestamp>\n      2011-04-04T09:14:46Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/336\/<\/dc:relation><dc:title>\n        Editorial<\/dc:title><dc:creator>\n        Jameson, Jill<\/dc:creator><dc:creator>\n        Conole, Gráinne<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2000<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/336\/1\/ALT_J_Vol8_No3_2000_Editorial.pdf<\/dc:identifier><dc:identifier>\n          Jameson, Jill and Conole, Gráinne  (2000) Editorial.  Association for Learning Technology Journal, 8 (3).  pp. 2-4.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776000080301<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/336\/","10.1080\/0968776000080301"],"year":2000,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Editorial\nThe new dividing line between richness and poverty is not between the haves and the\nhave-nots but between the knows and the don't knows. (Schwab, 1999)\nAt times of major educational change we are reminded of those things of lasting value\nwhich are of formative significance for learning and teaching - those things which\nempower students to gain riches in the form of knowledge, understanding and skill. At the\nthreshold of the twenty-first century it is good to acknowledge, again, that our main job as\neducators, learning technologists and researchers is at all times to encourage and foster\nsuch richness in all of our students. Learning technology has an exceptionally productive\npotential role to play in this empowerment: the role of the Association of Learning\nTechnology in promoting good practice in the use of learning technologies is therefore\nparticularly highlighted at the start of a new century.\nThis special edition of ALT-J in the year 2000 marks a time of major transition in the\nfurther education (FE) sector. Witness the emergence of the national and local Learning\nand Skills Councils, national changes to the Advanced Level curriculum and the new\nemphasis being placed on the transition from further to higher education with the funding\nof further lifelong learning governmental initiatives and growth-inducing new F\/HE\ndevelopments such as the foundation degree. Paramount amongst these changes has been\nrecent formative progress in the establishment and use of learning technologies in FE,\nincluding the National Learning Network (NLN), and major infrastructural, funding and\nstrategic policy improvements in the networking of all FE colleges. The year 2000 marks, in\neffect, the beginning of a new era for IT in FE.\nIt is therefore entirely appropriate at this time to devote a special edition of ALT-J to the\nconsideration of learning technology research developments in FE. So much has been\nhappening so fast in IT in FE - whether interpreted as 'Information and Learning\nTechnology' (ILT) or 'Information and Communications Technology' (ICT) - that we need\nto examine its impact on learning and teaching, and to attempt through critical analysis to\n2\nAlt-] Volume 8 Number 3\ndiscriminate between those things that will prove ultimately to be relatively superficial\nchanges, and those which will have lasting value.\nYet such analysis is not without difficulty, since research in the FE sector is still nascent.\nThe formative work of the Further Education Development Agency (FEDA) in encour-\naging the emergence of the Further Education Research Network (FERN) recognizes the\nresearch potential of FE as the education sector providing for the largest number of UK\nstudents, but with perhaps the least evidence of published research work. Such new\nresearch initiatives have only recently begun to stimulate the growth of a research culture\nembracing critical conceptual analysis. Distinctive features of developmental practitioner-\nled and agency-funded research in FE have been evolving, encouraged by FEDA, to foster\nnew conceptions of the application of research to further education. A debate between\ndifferent strands of research in FE, including action-based, policy-led, and agency-funded\nresearch, has therefore begun to emerge which does not yet embrace shared perceptions of\nthe kind of critical, analytical, independent, peer-reviewed academic research generally\nprevalent in HE.\nTo foster specific learning technology applications resulting from this debate, this special\nedition of ALT-J focuses particularly on research into the use of learning technologies\nacross the three main strands in ILT\/ICT (Information and Learning Technology\/\nInformation and Communications Technology) in FE of national policy, research develop-\nments and case studies. The volume consists of nine papers, and each of the three main\nstrands opens with an invited positioning paper outlining the unique perspectives of a\nnumber of leading staff with particular knowledge of the FE sector. The contributions of\nthese key staff give an invaluable shaping perspective at a time of such major development\nin IT usage in FE, following the allocation in 1998 of £74 million of government funding\nfor a three-year programme of IT infrastructural improvements.\nThe research papers that follow each positioning paper give an outline marking out a new,\ndiverse, as yet mainly uncharted, territory for analytical research into IT in FE. Like the\nmarkers of pioneers into a new conceptual world in learning technology research in further\neducation, they remind us both of our past and of our future potential, embracing both\nthe known and the unknown. In this they remind us that the significant issue of improving\nlearning and teaching through the use of learning technologies is the key factor with which\nto examine critically the major changes currently facing the further education sector.\nJill Jameson, Special Guest Editor,\nLifelong Learning Office, University of Greenwich\nThis is the second in our series of ALT-J special issues: last year's industrial issue reported\non a selection of BT's initiatives and research work. These special issues are valuable in\nthat they help us to position the general research work reported in ALT-J within the wider\ncontext and in particular help us to benchmark and compare activities across sectors. This\nspecial issue on FE highlights the fact that many of the issues around the use and\nintegration of learning technologies are cross-sectorial, despite the considerable cultural\ndifferences between the FE and HE sectors. It is also timely, given the recent move towards\na closer integration of the tertiary sector within the UK (fuelled in part by the desire to\n3\nEditorial\nshare best practice and pool resources) and evidenced in the recent announcement of the\nextension of the remit of the Joint Information Systems Committee (JISC) to cover FE as\nwell as HE. We hope that this issue will act as a snapshot of FE in this transition period,\nwhich will provide a valuable reference point in the light of potential future developments.\nGráinne Conole\n4\n"}