{"doi":"10.1016\/j.chb.2007.03.004","coreId":"197763","oai":"oai:lra.le.ac.uk:2381\/10014","identifiers":["oai:lra.le.ac.uk:2381\/10014","10.1016\/j.chb.2007.03.004"],"title":"Would I lie to you? Self-serving lies and other-oriented lies told across different media","authors":["Whitty, Monica T.","Carville, Siobhan E"],"enrichments":{"references":[{"id":43730596,"title":"(1959\/1997). In The Presentation of Self in Everyday Life. In","authors":[],"date":"1959","doi":null,"raw":"Goffman, E (1959\/1997). In The Presentation of Self in Everyday Life. In C. Lemert & A. Branaman (Eds.). The Goffman Reader. Massachusetts, USA: Blackwell Publishers. New York: Doubleday Anchor. (original work published in 1959) Would I lie 21 Hancock, J., Thom-Santelli, J., & Ritchie, T. (2004). Deception and design: The impact of communication technologies on lying behavior. Proceedings, Conference on Computer Human Interaction, New York, 6 (1), 130-136.","cites":null},{"id":43730600,"title":"Cooperation of liars and truth tellers.","authors":[],"date":"2005","doi":"10.1002\/acp.1050","raw":"Vrij, A. (2005). Cooperation of liars and truth tellers. Applied Cognitive Psychology, 19 (1), 39-50.","cites":null},{"id":43730606,"title":"Cyberspace Romance: The psychology of online relationships.","authors":[],"date":"2006","doi":null,"raw":"Whitty, M. T., & Carr, A. N. (2006). Cyberspace Romance: The psychology of online relationships. Basingstoke: Palgrave Macmillan.","cites":null},{"id":43730601,"title":"Detecting deceit via analysis of verbal and nonverbal behaviour.","authors":[],"date":"2000","doi":"10.1111\/j.1468-2958.2004.tb00723.x","raw":"Vrij, A., Edward, K., Roberts, K. P., & Bull, P. (2000). Detecting deceit via analysis of verbal and nonverbal behaviour. Journal of Nonverbal Behavior, 24 (4), 239-263.","cites":null},{"id":43730593,"title":"Eveyday lies in close and casual relationships.","authors":[],"date":"1998","doi":null,"raw":"De Paulo, B. M., & Kashy, D. A. (1998). Eveyday lies in close and casual relationships. Journal of Personality and Social Psychology, 74 (1), 147-167.","cites":null},{"id":43730602,"title":"Liar, liar! An examination of how open, supportive and honest people are in Chat Rooms.","authors":[],"date":"2002","doi":"10.1016\/s0747-5632(01)00059-0","raw":"Whitty, M. T. (2002). Liar, liar! An examination of how open, supportive and honest people are in Chat Rooms. Computers in Human Behavior, 18 (4), 343-352.","cites":null},{"id":43730592,"title":"Love on the Internet: Involvement and misrepresentation in romantic relationships in cyberspace vs.","authors":[],"date":"2001","doi":"10.1016\/s0747-5632(00)00040-6","raw":"Cornwell, B., & Lundgren, D. C. (2001). Love on the Internet: Involvement and misrepresentation in romantic relationships in cyberspace vs. realspace. Computers in Human Behavior, 17 (2), 197-211.","cites":null},{"id":43730594,"title":"Lying in everyday life.","authors":[],"date":"1996","doi":"10.1037\/\/0022-3514.70.5.979","raw":"DePaulo, B. M., Kashy, D. A., Kirkendol, S. E., Wyer, M. M., & Epstein, J. A. (1996). Lying in everyday life. Journal of Personality and Social Psychology, 70 (5), 979-995.","cites":null},{"id":43730585,"title":"Online deception: Prevalence, motivation and emotion.","authors":[],"date":"2006","doi":"10.1089\/cpb.2006.9.54","raw":"Caspi, A., & Gorsky, P. (2006). Online deception: Prevalence, motivation and emotion. CyberPsychology & Behavior, 9 (1), 54-59.","cites":null},{"id":43730595,"title":"Pathological lying revisited.","authors":[],"date":"2005","doi":null,"raw":"Dike, C. C., Brananoski, M., & Griffith, E. E. H. (2005). Pathological lying revisited. Journal of the America Academy of Psychiatry and the Law Online, 33 (3), 342-349.","cites":null},{"id":43730598,"title":"Reducing social context cues: Electronic mail in organizational communication.","authors":[],"date":"1986","doi":"10.1287\/mnsc.32.11.1492","raw":"Sproull, L., & Kiesler, S. (1986). Reducing social context cues: Electronic mail in organizational communication. Management Science, 32, 1492-1512.","cites":null},{"id":43730607,"title":"Sexual lying among college students in close and casual relationships.","authors":[],"date":"2001","doi":"10.1111\/j.1559-1816.2001.tb00178.x","raw":"Williams, S. S. (2001). Sexual lying among college students in close and casual relationships. Journal of Applied Social Psychology, 31 (11), 2322-2338.","cites":null},{"id":43730586,"title":"Statistical power analysis for the behavioural sciences.","authors":[],"date":"1988","doi":"10.4324\/9780203771587","raw":"Cohen, J. (1988). Statistical power analysis for the behavioural sciences. Hillsdale, NJ: Erlbaum.","cites":null},{"id":43730548,"title":"Storming and Forming a Normative Response to a Deception Revealed Online.","authors":[],"date":"2005","doi":"10.1037\/e416902005-354","raw":"Birchmeier, Z., Joinson, A. N., & Dietz-Uhler, B. (2005). Storming and Forming a Normative Response to a Deception Revealed Online. Social Science Computer Review, 23 (1), 108-121.","cites":null},{"id":43730599,"title":"Types of deception and underlying motivation: What people think.","authors":[],"date":"2005","doi":"10.1177\/0894439304271534","raw":"Utz, S. (2005). Types of deception and underlying motivation: What people think. Social Science Computer Review, 23 (1), 39-48.","cites":null},{"id":43730549,"title":"White lies in interpersonal communication: A taxonomy and preliminary investigation of social motivations.","authors":[],"date":"1984","doi":"10.1080\/10570318409374167","raw":"Camden, C., Motley, M. T., & Wilson, A. (1984). White lies in interpersonal communication: A taxonomy and preliminary investigation of social motivations. Western Journal of Speech Communication, 48, 309-325.","cites":null},{"id":43730597,"title":"Who lies?","authors":[],"date":"1996","doi":"10.1037\/0022-3514.70.5.1037","raw":"Kashy, D. A., & DePaulo, B. M. (1996). Who lies? Journal of Personality and Social Psychology, 70 (5), 1037-1051.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-05","abstract":"This is the author’s version of a work that was accepted for publication in Computers in Human Behavior. Changes resulting from the publishing process, such as editing, corrections, structural formatting, and other quality control mechanisms may not be reflected in this document. Changes may have been made to this work since it was submitted for publication. A definitive version was subsequently published in Computers in Human Behavior, 24(3), 2008, DOI: http:\/\/dx.doi.org\/10.1016\/j.chb.2007.03.004This study set out to investigate the type of media individuals are more likely to tell self-serving and other-oriented lies, and whether this varied according to the target of the lie. One hundred and fifty participants rated on a likert-point scale how likely they would tell a lie. Participants were more likely to tell self-serving lies to people not well-known to them. They were more likely to tell self-serving lies in email, followed by phone, and finally face-to-face. Participants were more likely to tell other-oriented lies to individuals they felt close to and this did not vary according to the type media. Participants were more likely to tell harsh truths to people not well-known to them via email.Peer-reviewedPost-prin","downloadUrl":"http:\/\/hdl.handle.net\/2381\/10014","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/10014\/4\/Would%20I%20lie%20to%20you_Whitty.pdf","pdfHashValue":"4f4c1952d3d4cffe98b066d148fafbe7d7f803f4","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/10014<\/identifier><datestamp>\n                2012-01-17T02:01:53Z<\/datestamp><setSpec>\n                com_2381_304<\/setSpec><setSpec>\n                com_2381_9551<\/setSpec><setSpec>\n                col_2381_399<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nWould I lie to you? Self-serving lies and other-oriented lies told across different media<\/dc:title><dc:creator>\nWhitty, Monica T.<\/dc:creator><dc:creator>\nCarville, Siobhan E<\/dc:creator><dc:subject>\nlies<\/dc:subject><dc:subject>\ndeception<\/dc:subject><dc:subject>\nmedia<\/dc:subject><dc:subject>\ninternet<\/dc:subject><dc:subject>\nother-oriented lie<\/dc:subject><dc:subject>\nself-serving lie<\/dc:subject><dc:subject>\nDECEPTION<\/dc:subject><dc:subject>\nINTERNET<\/dc:subject><dc:subject>\nONLINE<\/dc:subject><dc:description>\nThis is the author’s version of a work that was accepted for publication in Computers in Human Behavior. Changes resulting from the publishing process, such as editing, corrections, structural formatting, and other quality control mechanisms may not be reflected in this document. Changes may have been made to this work since it was submitted for publication. A definitive version was subsequently published in Computers in Human Behavior, 24(3), 2008, DOI: http:\/\/dx.doi.org\/10.1016\/j.chb.2007.03.004<\/dc:description><dc:description>\nThis study set out to investigate the type of media individuals are more likely to tell self-serving and other-oriented lies, and whether this varied according to the target of the lie. One hundred and fifty participants rated on a likert-point scale how likely they would tell a lie. Participants were more likely to tell self-serving lies to people not well-known to them. They were more likely to tell self-serving lies in email, followed by phone, and finally face-to-face. Participants were more likely to tell other-oriented lies to individuals they felt close to and this did not vary according to the type media. Participants were more likely to tell harsh truths to people not well-known to them via email.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPost-print<\/dc:description><dc:date>\n2012-01-16T14:35:12Z<\/dc:date><dc:date>\n2012-01-16T14:35:12Z<\/dc:date><dc:date>\n2007-05<\/dc:date><dc:type>\nJournal Article<\/dc:type><dc:type>\nArticle<\/dc:type><dc:identifier>\nComputers in Human Behavior, 2008, 24 (3), pp.1021-1031.<\/dc:identifier><dc:identifier>\n0747-5632<\/dc:identifier><dc:identifier>\nhttp:\/\/www.journals.elsevier.com\/computers-in-human-behavior\/<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/10014<\/dc:identifier><dc:identifier>\n10.1016\/j.chb.2007.03.004<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nCopyright © 2007 Elsevier Ltd. All rights reserved.<\/dc:rights><dc:publisher>\nElsevier<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0747-5632","issn:0747-5632"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["lies","deception","media","internet","other-oriented lie","self-serving lie","DECEPTION","INTERNET","ONLINE"],"subject":["Journal Article","Article"],"fullText":"Would I lie 1 \nWhitty, M.T. & Carville, S.E. (2008). Would I lie to you? Self-serving \nlies and other-oriented lies told across different media. Computers \nin Human Behavior, 24, 1021-1031. \n \n \nRunning head: WOULD I LIE TO YOU? \n \n \nWould I Lie to You? Self-serving Lies and Other-oriented Lies told across Different \nMedia \n \nMonica T Whitty \n \n& \nSiobhan E Carville \n \n \n \n \n \nWould I lie 2 \nAbstract \nThis study set out to investigate in which type of media individuals are more likely to \ntell self-serving and other-oriented lies, and whether this varied according to the \nrecipient of the lie. One hundred and fifty participants rated on a likert-point scale \nhow likely they would tell a lie. Participants were more likely to tell self-serving lies \nto people not well-known to them. They were more likely to tell self-serving lies in \nemail, followed by phone, and finally face-to-face. Participants were more likely to \ntell other-oriented lies to individuals they felt close to and this did not vary according \nto the type media. Participants were also more likely to tell harsh truths to people not \nwell-known to them via email.  \n \n \nKeywords: lies, deception, media, internet, other-oriented lie, self-serving lie \n \n \nWould I lie 3 \nWould I Lie to You? Self-serving Lies and Other-oriented Lies told across Different \nMedia \n \n \nThe lie is a condition of life -- Nietzsche \n \nPsychologists have been very interested in the types of people who are more \nlikely to lie (Dike, Baranoski, & Griffith, 2005; Kashy & DePaulo, 1996), why people \nlie (Camden, Motley, & Wilson, 1984), the types of lies people tell (DePaulo, Kashy, \nKirkendol, Wyer, & Epstein, 1996), how frequently individuals lie (DePaulo et al., \n1996), to whom they tell their lies to (Williams, 2001), and, more recently, across \nwhich modes of communication individuals are more likely to lie in (Hancock, Thom-\nSantelli, & Ritchie, 2004). In this study we were interested in two types of lies: self-\nserving lies and other oriented lies, told over the phone, email, and face-to-face. \nTheories on Impression Management \nGoffman was interested in the ways people present themselves in their \neveryday face-to-face encounters. In his book The Presentation of Self in Everyday \nLife, Goffman (1959) argued for a dualistic image of the self. He described the self as \nboth a performer and a character. According to Goffman (1959) the ‘self-as-\nperformer’ is not merely a social product, but also has a basic motivational core which \nmotivates us. In contrast, the ‘self-as-character’ represents an individuals’ unique \nhumanity. It is this part of the self which is a social product; that is, performed \noutwardly in social life. The ‘self-as-character’ is one’s inner self. \nGoffman believed that individuals need to present themselves as an acceptable \nperson to others. He stated that “the impressions that the others give tend to be treated \nWould I lie 4 \nas claims and promises they have implicitly made, and claims and promises tend to \nhave a moral character” (Goffman, 1959\/1997, p.21). He argued that individuals can \nbe strategic in their impression formation. In particular, Goffman was interested in \ndistinguishing between expressions ‘given’ (e.g., spoken communication) and \nexpressions ‘given off’ (e.g., nonverbal cues) in a face-to-face interaction. \n Theorists, such as DePaulo et al. (1996), have drawn from Goffman’s theory \nto argue that “many of the lies of everyday life are told to avoid tension and conflict \nand to minimize hurt feelings and ill will” (p.980). To test their claims they carried \nout two diary studies of lying. As predicted they found that lying is a part of daily life. \nImportantly, DePaulo et al. (1996) also found that the lies people told either served \nthe liars’ own self-interests or were told to protect the person they were lying to – \nalthough most lies were self-serving ones. They also found that, in line with \nGoffman’s theory, many of their participants lied to protect themselves from \nembarrassment, disapproval, or conflict rather than for material gain or personal \nadvantage. In addition, they regularly lied to protect the feelings of the targets of the \nlies.  \n1.2 Target of the Lie \nFew theorists have investigated whether lying varies depending on whom the \nlie is being told to. Should we expect that the types of lies told and frequency of \ntelling a lie varies according to the relationship one has with the person one is telling \nthe lie to? Some research has suggested this is the case. For example, DePaulo and \nKashy (1998) found that their participants reported telling fewer lies to people they \nwere close to and would feel uncomfortable when they did lie to these people. In \naddition, they found that relatively more of the lies told to best friends and friends \nwere altruistic rather than self-serving. Drawing again from Goffman’s theory if one \nWould I lie 5 \nis to remain authentic in their friends eyes then one has to present a consistent image \nof the self; hence, it is more risky trying to sustain a credible character to one’s friends \nif one tells them self-serving lies. Moreover, we would expect that individuals want to \nensure that those they care about maintain their dignity and consequently would be \nmore motivated to tell other-oriented lies to individuals one is close to. \n1.3 Lying across Different Mediums \nResearchers have began to investigate deception in cyberspace (e.g., \nBirchmeier, Joinson, & Dietz-Uhler, 2005; Caspi & Gorsky, 2006; Cornwell & \nLungern, 2001; Utz, 2005; Whitty, 2002; Whitty & Carr, 2006). Whitty (2002), for \ninstance, has found that lying is a ubiquitous phenomenon in chat rooms. She found \nthat 28% of male users lied about their gender. Cornwell and Lungern (2001) found \nthat 27.5% of their respondents lied online about their physical attractiveness, 22.5% \nabout their age, 17.5% about their background, and 15% about their interests. Utz \n(2005) found that online attractiveness deception was deemed more severe than \ngender switching and identity concealment. Interestingly, Caspi and Gorsky (2006) \nfound that 84% of their sample experienced enjoyment from telling a lie online. \nResearchers have also been interested in whether individuals are more like to \nlie in one medium more than another. An important study conducted by Hancock et \nal. (2004) suggests this is the case. These researchers examined lying in face-to-face \nsituations, over the phone, via instant messenger, and via email. Participants kept a \ndiary where they had to record their social interactions and lies for a week. They \nfound that the highest proportion of lies occurred on the phone and least in email.  \nHancock et al. (2004) contend that their results do not support theories, such \nas, ‘The Social Distance Hypotheses’ and ‘Media Richness Theory’. ‘Social Distance \nTheory’ argues that because lying makes individuals feel uncomfortable, they will \nWould I lie 6 \nchoose less rich media in order to maintain social distance between themselves and \nthe person they are lying to. In respect to the four types of media Hancock et al. \n(2004) examined, individuals would lie most in email, followed by instant messenger, \nfollowed by phone, and then face-to-face. ‘Media Richness Theory’, in contrast, \nsuggest that because lying is highly equivocal individuals elect to lie more in rich \nmedia, which includes multiple cue systems, immediate feedback, natural language, \nand message personalisation. Hence, this theory would predict that individuals would \nlie in face-to-face situations more, following by phone, instant messenger, and email. \nGiven the results yielded from their study, Hancock and colleagues (2004) \ndeveloped a new theory to explain lying across different media. They suggest that \nresearchers need to consider other dimensions besides richness and distance. In their \nnew ‘Feature Based Theory’, the additional dimensions they include are synchronous, \nrecordless, and distributed (i.e., not copresent) communication. This theory proposes \nthat the more synchronous and distributed, but the less recordable a medium is, the \nmore frequently lying should occur. One lies more in synchronous interactions, \nbecause the majority of lying is spontaneous and hence synchronous communication \nshould present more opportunities to lie. In recorded communication one is aware that \ntheir conservation is potentially kept or stored (e.g., in a saved email) and can be \nreferred to in future conversations; hence, one is less likely to lie if they are aware that \nthere is proof of their lie that can be referred to later. In media where participants are \nnot distributed deception should be constrained to some degree as some lies can be \nimmediately obvious (e.g., it is easier to lie in email saying one is writing a report \nwhen really one is actually playing a computer game). Hence, because telephone \nconversations are distributed, synchronous, and recordless, the most amount of lying \nshould take place in this media, as supported by their results. On the other hand, email \nWould I lie 7 \nis distributed, but not synchronous or recordless and therefore, as supported by their \nstudy, had the lowest rate of deception. \n1.4 Current Study \n This current study extends upon current literature on lying. Based on the above \nevidence, the following hypotheses were developed. \nH1: Individuals will be more likely to tell self-serving lies to individuals not well \n–known to them than they are to tell self-serving lies to individuals close to them.  \nThis first hypothesis is based on Goffman’s theory outlined earlier in this \npaper. Goffman (1959\/1997) discussed in detail the knowledge we have about \nothers and argued that we are more likely to know the ‘inner self’ of people who \nare close to us. Hence, one is much less likely to get caught out telling a self-\nserving lie to individuals not well-known to them. Moreover, individuals are more \nlikely to care about the opinion of people close to them and so if caught out telling \na self-serving they have much more to lose. \nH2: Individuals will be more likely to tell other-oriented lies to individuals close \nto them than they are to tell other-oriented lies to individuals not well-known to \nthem.  \nThis hypothesis is based on DePaulo et al.’s (1996) work which found that \nmany lies are told to protect the feelings of the targets of the lies. If this argument \nis correct, we would expect individuals to tell people that are close to other-\noriented lies given that we would expect that they care more for these individuals \nthan they do for strangers. \nIn addition to testing out these hypotheses we wanted to examine whether \nHancock et al.’s (2004) ‘Feature Based’ theory still holds when we also consider \nWould I lie 8 \nthe type of lie told as well as the target of the lie. To reiterate, his theory predicts \nthat people are more likely to lie in synchronous, distributed, and non-recordable \nmediums. Given this we hypothesized that: \nH3: Individuals are more likely to lie on the phone than in face-to-face settings. \nH4: Individuals are more likely to lie on the phone than in email. \nH5: Individuals are more likely to lie in face-to-face settings than they are in \nemail. \n2. Method \n2.1 Materials \nA survey was constructed for this study. Participants were initially asked to \nprovide information on their gender, age, and employment status. Following from \nthis, participants were expected to respond to twelve hypothetical scenarios. Six of the \nscenarios presented the participant with a ‘self-serving’ lie and six an ‘other-oriented’ \nlie. In six of the scenarios individuals had to imagine telling the lie to either someone \nclose to them and in the other six they had to imagine telling the lie to someone they \ndid not know well. Someone close to them was defined as “a member of your family, \na friend, or a partner”. In the scenarios the participant had to imagine stating the lie in \nface-to-face, phone, and email. In each scenario, participants had to rate the likelihood \nthat they would lie with ‘1’ representing ‘not likely to tell this lie’ and ‘5’ representing \n‘extremely likely to tell this lie’. To give two examples: \n \nYou are having a face-to-face conversation with someone that you are ‘close \nto’ when they invite you to an event. You can think of something else you \nwould rather spend your time doing so you tell them that you can’t make it to \nthe event, even though you can. \nWould I lie 9 \n \nYou receive an email from a person you don’t know well. Within the email they \nask you if you think they look attractive. You don’t think that they are \nattractive but you don’t want to hurt their feelings so you email them back and \ntell them that they are attractive. \n \n2.2 Procedure \n After obtaining the approval of an ethics committee, psychology students \nenrolled in a large university in the UK were invited to participate in the study. \nParticipants initially were provided with a consent form and an information sheet \ndescribing the study and the kind of questions they would be asked. They were \nassured of anonymity and were informed that they could withdraw consent without \npenalty. Those who then wished to participate filled out the survey, which took \napproximately 10 minutes to complete. Participants were given an email and phone \nnumber to contact if they had any further queries about the study. They were also \ngiven the telephone number and an email address of the student counselling service \n(which is a free service to students) in case they experienced any distress from \ncompleting the survey (although we expected they would not). \n2.3 Participants \n The participants were 150 psychology undergraduate students, comprising of \n104 (69%) women and 46 (31%) men. Participants ranged between 18 and 25 years of \nage (M=19.75, SD=1.74). The majority of the sample was either unemployed (51%) \nor employed part-time (47%), with 1% being employed and 1% identifying as a house \nhusband\/wife. \n3. Results \nWould I lie 10 \nPaired t-test were performed to determine if there was a significant difference \nin the likelihood to tell self-serving lies more to people the participants did not know \nwell compared to individuals the participants were close to (see Table 1). As predicted \nin every medium individuals were much more likely to tell self-serving lies to others \nthey did not know well than those close to them. The magnitude of the differences in \nthe means was, according to Cohen (1988), very large. \nTable 1 \nPaired t-tests for Self-serving Lies \nMedia Self-serving lie N t η2 \n Close to \nM \n(SD) \nNot well-known \nM \n(SD) \n   \nPhone 3.13 \n(1.15) \n4.11 \n(0.90) \n150 -11.27*** 0.46 \nFace-to-\nface \n2.69 \n(1.20) \n3.83 \n(1.02) \n150 -11.53*** 0.47 \nEmail 3.56 \n(1.27) \n4.33 \n(0.92) \n150 -7.31*** 0.26 \n* p<.05, two-tailed. ** p<.01, two-tailed. ***p<.001, two-tailed \n \n A repeated measures ANOVA conducted on the likelihood of telling self-\nserving lies to people the participants felt close to across the three media revealed a \nsignificant overall difference, F(2, 148) = 47.15, p < .001 (η2 = .39). Paired t-tests \nwere performed to determine if phone was greater than face-to-face and if face-to-face \nwas greater than email. Participants were more likely to tell self-serving lies to people \nWould I lie 11 \nclose to them on the phone more than there were face-to-face, t(149) = -6.78, p < .001 \n(η2 = 0.24). It was also found that they were more likely to lie in email than in face-to-\nface situations t(149) = -9.66 p < .001 (η2 = 0.38). Finally we checked to see if people \nlied more in email more than the phone and found that they significantly differed, \nt(149) = -5.81, p < .001 (η2 = 0.18). \n A repeated measure ANOVA conducted on the likelihood of telling self-\nserving lies to people the participants did not know well across the three media \nrevealed a significant overall difference, F(2,148) = 38.86, p < .001 (η2 = .34). Paired \nt-tests were performed to determine if phone was greater than face-to-face and if face-\nto-face was greater than email. Participants were more likely to tell self-serving lies to \npeople not well-known to them on the phone more than face-to-face, t(149) =  -5.14, p \n< .001 (η2 = 0.15). It was also found that they were more likely to lie in email than in \nface-to-face, t(149) = -8.84, p < .001 (η2 = 0.34). Finally we checked to see if people \nlied more in email more than the phone and found that they significantly differed, \nt(149) = -4.49, p < .001 (η2 = 0.12). \nPaired t-test were performed to determine if there was a significant difference \nin the likelihood to tell other-oriented lies more to people the participants did not \nknow well compared to individuals the participants were close to (see Table 2). As \npredicted in every medium individuals were much more likely to tell other-oriented \nlies to others they were close to. The magnitude of the differences in the means was, \naccording to Cohen (1988), moderate. A repeated measures ANOVA conducted on \nthe likelihood of telling other-oriented lies to people the participants felt close to \nacross the three media revealed that there were no significant overall differences, F(2, \n148) = 1.10, p > 0.05  (η2 = .02). \nTable 2 \nWould I lie 12 \nPaired t-tests for Other-oriented Lies \nMedia Other-oriented lie N t η2 \n Close to \nM \n(SD) \nNot well-known \nM \n(SD) \n   \nPhone 4.30 \n(0.83) \n4.01 \n(0.93) \n150 3.56*** \n \n0.08 \nFace-to-\nface \n4.28 \n(0.83) \n4.09 \n(0.89) \n150 2.71** 0.05 \nEmail 4.23 \n(0.89) \n3.94 \n(1.03) \n150 3.72*** 0.09 \n* p<.05, two-tailed. ** p<.01, two-tailed. ***p<.001, two-tailed \n \nA repeated measure ANOVA conducted on the likelihood of telling other-\noriented lies to people the participants did not know well across the three media \nrevealed a significant overall difference, F(2,148) = 4.07, p < .05 (η2 = .05). Paired t-\ntests were conducted to determine if phone was greater than face-to-face and if face-\nto-face was greater than email. There was no significant different between lies told on \nthe phone and face-to-face, t(149) = -.39, p > .05 ((η2 = .02). Participants were more \nlikely to tell self-serving lies to people not well-known to them in face-to-face more \nthan email, t(149) = 2.86, p < .05 (η2 = 0.05). Finally we checked to see if people lied \nmore on the phone than email and found that they significantly differed, t(149) = 2.00, \np < .05 (η2 = 0.03). \nWe also compared the likelihood of telling self-serving lies and other oriented \nlies to people our participants felt close to (see Table 3). For each type of media \nWould I lie 13 \nindividuals were far more likely to tell other-oriented lies than self-serving lies. \nFinally we compared the likelihood of telling self-serving lies and other oriented lies \nto people our participants did not know well (see Table 4). This revealed mixed \nresults, with no differences for lies told over the phone, more other-oriented lies told \nface-to-face and more self-serving lies told in email. \n \nTable 3 \nPaired t-tests for Lies told to Close People \nMedia Close to N t η2 \n Self-serving \nM \n(SD) \nOther-oriented \nM \n(SD) \n   \nPhone 3.13 \n(1.15) \n4.30 \n(0.83) \n150 -10.16*** \n \n0.41 \n \nFace-to-\nface \n2.69 \n(1.20) \n4.28 \n(0.83) \n150 -13.61*** 0.55 \n \nEmail 3.56 \n(1.27) \n4.23 \n(0.89) \n150 -5.41*** 0.16 \n* p<.05, two-tailed. ** p<.01, two-tailed. ***p<.001, two-tailed \n \nTable 4 \nPaired t-tests for Lies told to Not Well-known People \nMedia Not well-known N t η2 \n Self-serving \nM \nOther-oriented \nM \n   \nWould I lie 14 \n(SD) (SD) \nPhone 4.11 \n(0.90) \n4.01 \n(0.93) \n150 0.96 0.01 \nFace-to-\nface \n3.83 \n(1.02) \n4.09 \n(0.89) \n150 -2.38* 0.04 \nEmail 4.33 \n(0.92) \n3.94 \n(1.03) \n150 3.49** 0.07 \n* p<.05, two-tailed. ** p<.01, two-tailed. ***p<.001, two-tailed \n \n4. Discussion \nThis study investigated the likelihood for individuals to tell self-serving and \nother-oriented lies across three different types of media, face-to-face, phone, and \nemail. It also examined telling these lies to individuals close to them and individuals \nnot well-known to them. In line with previous researchers, the means elicited in this \nstudy suggested that lying is a part of individuals’ everyday lives. This study also \nsuggests that lying is ubiquitous across all three types of media. \n The results yielded in this study supported our hypotheses. As predicted we \nfound that individuals were much more likely to tell self-serving lies in every media \nto individuals not well-known to them compared to those they felt close to. This, we \nbelieve, is because it is more risky and difficult to get away with telling a self-serving \nlie to individuals who are close to us. Individuals close to us have more information \nabout us and our day-to-day lives. In line with Goffman’s (1959) theory, if one is \ncaught out by a self-serving lie, they are not only going to be judged negatively for the \nlie they told, but their entire character could be brought into question. There can be a \nmore at stake here that just the being caught out for telling a lie. \nWould I lie 15 \n We also found, as predicted, that individuals are more likely to tell other-\noriented lies to people close to them than to people not close to them. Moreover, when \nwe compared the types of lies individuals were more likely to tell someone close to \nthem, we found that individuals were much more likely to tell other-oriented lies than \nself-serving lies. Other-oriented lies are typically told to protect the feelings of the \nrecipient of the lie. Given this, one might feel more compelled to lie to a person close \nto them to protect their feelings rather than saying the truth, which could possibly \ncause them upset or distress. We are perhaps less motivated or concerned to protect \nthe feelings of individuals less close to us. Interestingly enough though, it appeared \nthat overall individuals were more likely to tell an other-oriented lie than a self-\nserving lie. Only in email to individuals not well-known to the person were \nparticipants more likely to tell a self-serving lie. Such a result questions much of the \npsychological literature which has tried to associate negative personality \ncharacteristics with those who are more likely to lie (e.g., Vrij, 2005), given that \nother-oriented lies could be constructed as an act of kindness and perhaps not an \nimmoral act. \n In addition to testing out our hypotheses we intended to examine whether \nHancock’s et al.’s (2004) ‘Feature Based’ theory would be supported when the type of \nlie as well as the recipient of the lie is taken into account. Unfortunately, as shown in \nTable 5, in each instance it was not supported by our data. \nTable 5 \nResults from this Study compared to Theories on Lying \nType of Lie \nRecipient \nFtF Phone Email \nSelf-serving 3 2 1 \nWould I lie 16 \nClose \nSelf-serving \nNot well-known \n3 2 1 \nOther-oriented \nClose \n1 1 1 \nOther-oriented \nNot well-known \n1 1 2 \nLying Predictions    \nFeature Based 2 1 3 \nMedia Richness 1 2 3 \nSocial Distance 3 2 1 \n(1 = highest amount of lying, 3 = the least) \n \n \nFor self-serving lies told to both people close to the participants as well as not \nwell-known, individuals stated they were more likely to tell a lie in email, followed by \nphone, and lastly face-to-face. This result supports the ‘Social Distance’ theory. To \nreiterate, ‘Social Distance’ theory suggests that individuals are more likely to lie in \nmedia where there is maximum space between the recipient and themselves. Theorists \nthat champion this theory argue that this is because lying makes people feel \nuncomfortable and that having distance between the liar and the recipient makes the \nliar more at ease with executing the lie. Self-serving lies are arguably more likely to \nmake the liar feel uncomfortable and apprehensive and so email is not surprisingly the \nideal place to tell such as lie. Email has the extra bonus of being an asynchronous \nform of media, which gives an individual time to think about how they will best tell \nWould I lie 17 \ntheir lie. Phone provides the distance and eliminates some of the non-verbal cues \nwhich might give away the lie (Vrij, Edward, Roberts, & Bull, 2000). \nThe results for which type of media individuals would be more likely to tell an \nother-oriented lie were not so clear cut. Participants believed they would be just as \nlikely to tell an other-oriented to someone close to them in any type of media. Perhaps \nthis is because the purpose of this type of lie is to maintain the integrity of the \nrecipient and one ought to be motivated to do this for someone they cared about in \nany type of media. Arguably, although one does not necessarily want to be caught out \nfor this type of lie, one would feel less anxious about telling a lie of this kind in \ncomparison to a self-serving lie. \nWhen it came to telling an other-oriented lie to individuals not well-known, \nthe participants claimed they would be less likely to say such a lie via email. This is \nan interesting twist. Such a result suggests that individuals would be more likely to \ntell people not well-known to them a truth via email that could potentially hurt their \nfeelings. Researchers have found that individuals can be more uninhibited and \naggressive online (e.g., Sproull & Kiesler, 1986). Ample evidence has been found for \nflaming online, which is aggressive and insulting talk (Whitty & Carr, 2006). It is \nargued that people are more likely to talk aggressively in CMC (computer mediated \ncommunication) than face-to-face because online there is a lack of social presence and \nless contextual cues. This is perhaps why this current study found that individuals \nwere more likely to say a hurtful truth than an other-oriented lie to individuals not \nwell-known to them in email. The social distance, in this particular case, motivates the \nperson to tell unpleasant truths. \nWe need to consider why Hancock et al.’s (2004) ‘Feature Based’ theory was \nnot supported in this study. This study revealed that distance plays a more important \nWould I lie 18 \nrole than Hancock and his colleagues surmised. In developing a model that predicts \nlying behaviour, at least for self-serving lies, it would seem that distance ought to be \ngiven more weight than other features, such as whether the media are recordable or \nnot. The ‘Features Based’ model also contends that individuals are more likely to lie \nin synchronous communication, the argument being that lying is a more spontaneous \nactivity and so one is given greater opportunity to tell a lie in synchronous media. \nHowever, this current study found that if given the opportunity individuals would be \nmore likely to tell self-serving lies in asynchronous communication. Asynchronous \ncommunication and distance also play an important role in predicting whether people \nare more likely to reveal unpleasant truths to others they do not know well. \nThere are some obvious limitations to this study that are worthwhile \nhighlighting. This study considered hypothetical instances of lying and only one \nexample of the two types of lies under investigation. Therefore, it is difficult to \nascertain whether the participants in this study would actually behave in the way they \nbelieve they would typically behave. At the same time, diary studies also have their \nlimitations – getting participants to keep accurate tabs of lies and expecting them to \nrecall each instance of lying can be an arduous task. In saying that, it is important to \ncarry out studies to see if the results revealed in this current study are supported when \nwe measure individuals’ actual behaviours. Additionally, this current study consisted \nof a university population, which makes it difficult to generalise these results to a non-\neducated population. Future research should consider other populations to test the \nclaims made in this paper. Finally, we considered only two types of lies, self-serving \nand other-oriented lies, there might be other types of lies we could have considered. \nIn concluding, this study highlights that when investigating the type of media \nindividuals are more likely to lie we must take into account the type of lie individuals \nWould I lie 19 \ntell as well as the recipient of the lie. This study found that individuals are much more \nlikely to tell self-serving lies to individuals not close to them and other-oriented lies to \nthose that are considered close. The potential impact of a lie probably determines \nwhether one is motivated to tell a lie. This study did reveal that the type of media one \nis communicating in does partly determine if one is likely to tell a lie. For self-serving \nlies, participants preferred the safe distance of email. Participants felt motivated to tell \nan other-oriented lie to people they felt close to across any type of media. However, \nwhen it came to telling harsh truths to people not so well-known participants preferred \nemail.  \n \nWould I lie 20 \nReferences \nBirchmeier, Z., Joinson, A. N., & Dietz-Uhler, B. (2005). Storming and Forming a \nNormative Response to a Deception Revealed Online. Social Science \nComputer Review, 23 (1), 108-121. \nCamden, C., Motley, M. T., & Wilson, A. (1984). White lies in interpersonal \ncommunication: A taxonomy and preliminary investigation of social \nmotivations. Western Journal of Speech Communication, 48, 309-325. \nCaspi, A., & Gorsky, P. (2006). Online deception: Prevalence, motivation and \nemotion. CyberPsychology & Behavior, 9 (1), 54-59. \nCohen, J. (1988). Statistical power analysis for the behavioural sciences. Hillsdale, \nNJ: Erlbaum. \nCornwell, B., & Lundgren, D. C. (2001). Love on the Internet: Involvement and \nmisrepresentation in romantic relationships in cyberspace vs. realspace. \nComputers in Human Behavior, 17 (2), 197-211. \nDe Paulo, B. M., & Kashy, D. A. (1998). Eveyday lies in close and casual \nrelationships. Journal of Personality and Social Psychology, 74 (1), 147-167. \nDePaulo, B. M., Kashy, D. A., Kirkendol, S. E., Wyer, M. M., & Epstein, J. A. \n(1996). Lying in everyday life. Journal of Personality and Social Psychology, \n70 (5), 979-995. \nDike, C. C., Brananoski, M., & Griffith, E. E. H. (2005). Pathological lying revisited. \nJournal of the America Academy of Psychiatry and the Law Online, 33 (3), \n342-349. \nGoffman, E (1959\/1997). In  The Presentation of Self in Everyday Life.  In C. Lemert \n& A. Branaman (Eds.). The Goffman Reader. Massachusetts, USA: Blackwell \nPublishers. New York: Doubleday Anchor. (original work published in 1959) \nWould I lie 21 \nHancock, J., Thom-Santelli, J., & Ritchie, T. (2004). Deception and design: The \nimpact of communication technologies on lying behavior. Proceedings, \nConference on Computer Human Interaction, New York, 6 (1), 130-136. \nKashy, D. A., & DePaulo, B. M. (1996). Who lies? Journal of Personality and Social \nPsychology, 70 (5), 1037-1051. \nSproull, L., & Kiesler, S. (1986). Reducing social context cues: Electronic mail in \norganizational communication. Management Science, 32, 1492-1512. \nUtz, S. (2005). Types of deception and underlying motivation: What people think. \nSocial Science Computer Review, 23 (1), 39-48. \nVrij, A. (2005). Cooperation of liars and truth tellers. Applied Cognitive Psychology, \n19 (1), 39-50. \nVrij, A., Edward, K., Roberts, K. P., & Bull, P. (2000). Detecting deceit via analysis \nof verbal and nonverbal behaviour. Journal of Nonverbal Behavior, 24 (4), \n239-263. \nWhitty, M. T. (2002). Liar, liar! An examination of how open, supportive and honest \npeople are in Chat Rooms. Computers in Human Behavior, 18 (4), 343-352. \nWhitty, M. T., & Carr, A. N. (2006). Cyberspace Romance: The psychology of online \nrelationships. Basingstoke: Palgrave Macmillan.  \nWilliams, S. S. (2001). Sexual lying among college students in close and casual \nrelationships. Journal of Applied Social Psychology, 31 (11), 2322-2338. \n"}