{"doi":"10.1017\/S0018246X06005528","coreId":"213992","oai":"oai:eprints.lse.ac.uk:26966","identifiers":["oai:eprints.lse.ac.uk:26966","10.1017\/S0018246X06005528"],"title":"The 'ghost' of the Anglo-Japanese Alliance: an examination into historical mythmaking","authors":["Best, Antony"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2006-09","abstract":"Even though the argument runs counter to much of the detailed scholarship on the subject, Britain's decision in 1921 to terminate its alliance with Japan is sometimes held in general historical surveys to be a major blunder that helped to pave the way to the Pacific War. The lingering sympathy for the combination with Japan is largely due to an historical myth which has presented the alliance as a particularly close partnership. The roots of the myth lie in the inter-war period when, in order to attack the trend towards internationalism, the political right in Britain manipulated memory of the alliance so that it became an exemplar of ‘old diplomacy’. It was then reinforced after 1945 by post-war memoirs and the ‘declinist’ literature of the 1960s and 1970s. By analysing the origins of this benevolent interpretation of the alliance, this article reveals how quickly and pervasively political discourse can turn history into myth and how the development of myths tells us much about the time in which they were created","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/213992.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/26966\/1\/The%20%27ghost%27%20of%20the%20Anglo-Japanese%20Alliance%28lsero%29.pdf","pdfHashValue":"809a374ba327f270da6ef13764e2986aa7bb8c43","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:26966<\/identifier><datestamp>\n      2012-08-23T13:17:27Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4859<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/26966\/<\/dc:relation><dc:title>\n        The 'ghost' of the Anglo-Japanese Alliance: an examination into historical mythmaking<\/dc:title><dc:creator>\n        Best, Antony<\/dc:creator><dc:subject>\n        DS Asia<\/dc:subject><dc:subject>\n        DA Great Britain<\/dc:subject><dc:description>\n        Even though the argument runs counter to much of the detailed scholarship on the subject, Britain's decision in 1921 to terminate its alliance with Japan is sometimes held in general historical surveys to be a major blunder that helped to pave the way to the Pacific War. The lingering sympathy for the combination with Japan is largely due to an historical myth which has presented the alliance as a particularly close partnership. The roots of the myth lie in the inter-war period when, in order to attack the trend towards internationalism, the political right in Britain manipulated memory of the alliance so that it became an exemplar of ‘old diplomacy’. It was then reinforced after 1945 by post-war memoirs and the ‘declinist’ literature of the 1960s and 1970s. By analysing the origins of this benevolent interpretation of the alliance, this article reveals how quickly and pervasively political discourse can turn history into myth and how the development of myths tells us much about the time in which they were created.<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:date>\n        2006-09<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/26966\/1\/The%20%27ghost%27%20of%20the%20Anglo-Japanese%20Alliance%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Best, Antony  (2006) The 'ghost' of the Anglo-Japanese Alliance: an examination into historical mythmaking.  Historical Journal, 49 (3).  pp. 811-831.  ISSN 0018-246X     <\/dc:identifier><dc:relation>\n        http:\/\/journals.cambridge.org\/action\/displayJournal?jid=HIS<\/dc:relation><dc:relation>\n        10.1017\/S0018246X06005528<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/26966\/","http:\/\/journals.cambridge.org\/action\/displayJournal?jid=HIS","10.1017\/S0018246X06005528"],"year":2006,"topics":["DS Asia","DA Great Britain"],"subject":["Article","PeerReviewed"],"fullText":"  \nAntony Best \nThe 'ghost' of the Anglo-Japanese Alliance: \nan examination into historical mythmaking \n \nArticle (Published version) \n(Refereed) \n \n \nOriginal citation: \nBest, Antony (2006) The 'ghost' of the Anglo-Japanese Alliance: an examination into historical \nmythmaking. Historical journal, 49 (3). pp. 811-831. ISSN 0018-246X  \nDOI: 10.1017\/S0018246X06005528 \n \n© 2006 Cambridge University Press \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/26966\/ \nAvailable in LSE Research Online: August 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \nTHE ‘GHOST’ OF THE\nANGLO- JAPANESE ALLIANCE :\nAN EXAMINATION INTO\nHISTORICAL MYTH-MAKING*\nANTONY BE ST\nLondon School of Economics and Political Science\nA B S T R ACT. Even though the argument runs counter to much of the detailed scholarship on the subject,\nBritain’s decision in 1921 to terminate its alliance with Japan is sometimes held in general historical surveys\nto be a major blunder that helped to pave the way to the Pacific War. The lingering sympathy for the\ncombination with Japan is largely due to an historical myth which has presented the alliance as a par-\nticularly close partnership. The roots of the myth lie in the inter-war period when, in order to attack the trend\ntowards internationalism, the political right in Britain manipulated memory of the alliance so that it became\nan exemplar of ‘old diplomacy ’. It was then reinforced after 1945 by post-war memoirs and the ‘declinist ’\nliterature of the 1960s and 1970s. By analysing the origins of this benevolent interpretation of the alliance,\nthis article reveals how quickly and pervasively political discourse can turn history into myth and how the\ndevelopment of myths tells us much about the time in which they were created.\nI\nThe role of myths in international history is a topic that has generated growing\nattention over the last decade. The stimulus for this development has come from\ntwo directions. First, the rise of cultural history has led to increasing interest in the\ndegree to which our knowledge of the past is shaped by collective memory. This\nperspective characterizes history as an inherently political process in which events\nare open to manipulation by both state and society and are used to serve the cause\nof inculcating and reinforcing national identity.1 Second, in the field of inter-\nnational relations and political science there has been a new focus on the way in\nwhich decision-makers and the media use, and abuse, historical analogies in order\nDepartment of International History, London School of Economics, London WC2A 2AE A.Best@lse.ac.uk\n* I wish to thank the Trustees of the Liddell Hart Centre for Military Archives for permission to\nquote from the Liddell Hart papers and Mr A. J. Maxse for permission to quote from the Leo Maxse\npapers.\n1 For an interesting discussion of this approach, see Jan-Werner Mu¨ller, ‘ Introduction, the power of\nmemory, the memory of power and the power over memory’, in Jan-Werner Mu¨ller, ed., Memory and\npower in post-war Europe (Cambridge, 2002), pp. 1–35.\nThe Historical Journal, 49, 3 (2006), pp. 811–831 f 2006 Cambridge University Press\ndoi:10.1017\/S0018246X06005528 Printed in the United Kingdom\n811\nto justify policy and to simplify the task of interpreting current events. Thus the\nexigencies of contemporary politics mean that historical episodes are turned into\nshorthand cliche´s devoid of their original complexity.2\nHow though are mythical interpretations of history formed? Up to now this\nissue has not been fully addressed. This is largely because the historians working\nin this area have been primarily concerned with the contemporary resonance of\nhistorical myths. Moreover, they have tended to focus on the mythical aspects of\nthe most familiar controversies, such as interpretations of a particular nation’s\nmemory of its role during the Second World War, where the topic is too complex\nto lend itself to detailed analysis. However, to study how myths emerge is im-\nportant, for it is only by understanding their evolution that one can hope to\ndisentangle historical events from the political rhetoric that surrounds them. This\nis clearly a difficult undertaking, especially when the event in question is still a\ncause of controversy, but it is possible to simplify this process by identifying and\nstudying neglected myths that, while born of political dispute, have subsequently\nbred orthodox and relatively uncontroversial interpretations of history. This\narticle looks at one particular example of historical shorthand that has embedded\nitself in our reading of the past – the idea that the Anglo-Japanese alliance\nwas a singularly close relationship and that its abrogation was a short-sighted\nmistake – and reveals its roots in the ideological battles of inter-war Britain.\nIt has long been accepted as a truism in many of the survey studies of British\nimperial and diplomatic history in the twentieth century that the decision made at\nthe Washington conference in 1921 to end the Anglo-Japanese alliance was a\nprofound error of judgement. Thus one finds in works by scholars such as Correlli\nBarnett, Max Beloff, and A. P. Thornton the premise that this reversal of previous\nBritish policy, which came about largely as the result of American and Canadian\npressure, was strategically flawed and compromised imperial defence throughout\nthe inter-war period. It helped therefore to lead to the outbreak of the Second\nWorld War and thus contributed indirectly to the dissolution of the empire.3\nThese historians contend that the termination of the alliance failed on many\nlevels. In regard to relations with Japan, it is held that by getting rid of an alliance\nof twenty years standing Britain turned its back on ‘a useful as well as a loyal ally ’,\nand through this unwise policy ‘quite gratuitously, raised up a new danger ’.4\n2 For the role of analogies in history, see Beatrice Heuser and Cyril Buffet, ‘Conclusions: historical\nmyths and denial of change’, in Beatrice Heuser and Cyril Buffet, eds., Haunted by history : myths in\ninternational relations (Providence, 1998), pp. 259–74.\n3 The explicitly critical works are Correlli Barnett, The collapse of British power (London, 1972),\npp. 250–73; Max Beloff, Imperial sunset, Britain’s liberal empire, 1897–1921 (London, 1969), pp. 330–43; and\nA. P. Thornton, The imperial idea and its enemies : a study of British power (New York, 1966 edn), pp. 191–5,\nbut see also the more subtle account in Wm Roger Louis, British strategy in the Far East, 1919–1939\n(Oxford, 1971), pp. 50–108. For briefer statements, see Peter Bell, Chamberlain, Germany and Japan,\n1933–1934 (Basingstoke, 1996), pp. 3–5; Christopher Hall, Britain, America and international arms control\n(Basingstoke, 1987), p. 30; John Keay, Last post : the end of empire in the Far East (London, 1997), pp. 147–8;\nand C. J. Lowe and M. L. Dockrill, The mirage of British power (2 vols., London, 1972), II, p. 303.\n4 Barnett, The collapse of British power, pp. 252, 273.\n812 A N TON Y B E S T\nThe result was that in the 1930s, when Britain needed peace in east Asia in order\nto concentrate on European events, it found itself ‘confronting a predatory enemy\ninstead of a loyal friend’.5 The end of the alliance is thus said to have created a\nnew strategic menace to the empire, vastly complicating the task of imperial\ndefence. Simultaneously, in terms of relations with the United States, it is argued\nthat Britain gained little compensation for its act of self-sacrifice. At the\nWashington conference the treaty that replaced the alliance as the arbiter of\nstability in east Asia was the purely consultative four-power pact, involving\nBritain, Japan, the United States, and France. In the view of Beloff this\nmeant that Britain substituted an arrangement based ‘on a nice calculation of\nmutual interests and relative capacities ’ for ‘a new system whose function-\ning would principally depend upon the incalculable shifts and whims of the\nAmerican democracy’ : Britain had thus placed its trust and the security of its\neastern possessions in a loose multilateral arrangement that had no guarantee\nof success.6\nIn addition it is argued that Britain, by agreeing to sign the five-power treaty on\nnaval arms limitation that was also negotiated at Washington, gave up the only\nunilateral means it had for controlling Japan – its maritime supremacy. By\nagreeing to this pact, which allowed Japan to possess a fleet that was virtually\ntwo-thirds the size of the Royal Navy and debarred Hong Kong from being\nturned into a naval base, Britain forfeited regional naval superiority to the\nJapanese. The latter therefore became impervious to foreign threats and thus\nwere encouraged in their expansionary ardour.\nFrom this perspective the death of the alliance appears as a tragic act of\ningratitude brought about by momentary weakness, and taken with little thought\nfor its portentous consequences. Moreover, implicit in this argument is the\nhypothesis that, if the alliance had been maintained, Britain could have used its\ninfluence to restrain Japan, and that the Manchurian crisis, the Sino-Japanese\nWar, and the Pacific War need never have come about. It is therefore hardly\nsurprising that, drawing on this consensus, a recent study of British decoloniz-\nation has gone as far as to declare that the lapsing of the alliance was arguably\n‘one of the gravest errors of twentieth-century British diplomacy’.7\nStrangely, however, this view is not one that is reflected in the most detailed\nstudy of the latter phase of the history of the Anglo-Japanese alliance, Ian Nish’s\nAlliance in decline.8 Nish argues that the decision made at Washington to allow the\nalliance to lapse merely constituted the formal burial of a relationship that had\nalready died. Its decline, he observes, had been a long drawn out affair, which\n5 Bell, Chamberlain, Germany and Japan, p. 3. 6 Beloff, Imperial sunset, p. 343.\n7 L. J. Butler, Britain and empire : adjusting to a post-imperial world (London, 2002), p. 24.\n8 Ian Nish, Alliance in decline : a study in Anglo-Japanese relations, 1908–1923 (London, 1972), pp. 391–7.\nFor a recent restatement of his views, see Ian Nish, ‘Echoes of Alliance, 1920–1930’, in Ian Nish and\nYoichi Kibata, eds., The history of Anglo-Japanese relations : the political-diplomatic dimension, 1600–1930\n(Basingstoke, 2000), pp. 256–7. See also Phillips Payson O’Brien, ‘Britain and the end of the Anglo-\nJapanese alliance’, in Phillips Payson O’Brien, ed., The Anglo-Japanese alliance (London, 2004), p. 268.\nT H E GHO S T O F TH E A L L I A N C E 813\n‘had sapped the mutual confidence which must be at the root of any alliance ’.9\nHe also does not see its termination as leading inevitably to Anglo-Japanese\nalienation, arguing instead that ‘ the historian is hard put to it to point out any\nstriking repercussions on relations between the two countries of the death of the\nalliance and its prolonged funeral ’.10 He notes that, if anything, its impact was\n‘more symbolic than real ’ and ‘psychological rather than practical ’.11\nFurthermore, in putting the decision in context, Nish reminds us that at the time\nstatesmen from both Britain and Japan ‘rated the effectiveness of the new four-\npower treaty more highly than we would be inclined to do with the benefit of\nhindsight ’.12 Taking a slightly different approach, John Ferris, a leading authority\non British imperial defence, has reinforced this argument by demonstrating that,\nwhile the ending of the alliance was a blow, it is a mistake to see Britain as\nemerging emasculated from the Washington conference, for it still retained its\nposition as the pre-eminent naval power. It was only when it agreed in 1930 to\nreduce its stock of cruisers and to prolong the naval building holiday for capital\nships that had been agreed at Washington that its maritime position began to\nweaken.13 A recent essay by Erik Goldstein has also helped to put the decision to\nterminate the alliance in context. Goldstein stresses the need to understand\nBritish decision-making from a global rather than simply east Asian perspective,\nand the importance of looking at British suspicions of France and the subsequent\nneed to court the United States.14 Why then is there such a gulf between the views\nof the generalists and those of the specialists? Why do so many historians see the\ntermination of the alliance as a selfish and ultimately self-destructive British act,\nwhile Nish and others accept it as a natural parting of the ways?\nOne explanation for this discrepancy is that those engaged in the broad studies\nof British foreign policy have based their interpretation on a number of unsub-\nstantiated assumptions. They have, for example, presumed that naval limitation\nnecessarily meant an end to British maritime predominance and that American\nreluctance to co-operate with Britain was no different from American hostility.\nMost importantly they have assumed that Japan was always a loyal ally to Britain,\nand have let hindsight blind them to the fact that towards the end the alliance was\ndeeply troubled. But why have historians been content to rest their case on these\nassumptions? The contention of this article is that, consciously or unconsciously,\nthey have been influenced in their writings by a powerful historical myth, which\none can refer to as the ‘ghost ’ of the Anglo-Japanese alliance. This ‘ghost ’ is a\nsympathetic rather than a frightening spectre. It portrays the alliance as a warm\nrelationship in which Japan had acted as a loyal and true friend, and suggests\n9 Nish, Alliance in decline, p. 392. 10 Ibid., p. 391. 11 Ibid., p. 397. 12 Ibid.\n13 John Ferris, ‘ ‘‘ It is our business in the navy to command the seas ’’ : the last decade of British\nmaritime supremacy, 1919–1929’, in Keith Neilson and Gregory C. Kennedy, eds., Far flung lines : studies\nin imperial defence in honour of Donald Mackenzie Schurman (London, 1997), pp. 129–34.\n14 Erik Goldstein, ‘The evolution of British diplomatic strategy for the Washington conference’, in\nErik Goldstein and John Maurer, eds., The Washington conference, 1921–1922: naval rivalry, east Asian\nstability and the road to Pearl Harbor (London, 1994), pp. 4–34.\n814 A N TON Y B E S T\nthat, if not separated prematurely, the allies would have continued to co-operate\nin mutual trust and respect. Thus, having come under the ‘ghost’s ’ influence,\nwhat the general writers describe is not the reality of the alliance and its termin-\nation, but rather a very persistent spectral distortion. In other words what we\nhave here is orthodoxy based on a myth.\nThe prevalence of this received wisdom begs three questions ; when and why\ndid this ‘ghost ’ first appear, and how has it been able to exert its influence even to\nthe present day. These are important questions, for it is only by understanding the\norigins and nature of the myth that one can begin to disentangle the historical\nrecord from its baleful influence. This article argues that the ‘ghost ’ first mani-\nfested itself almost immediately after the alliance’s death. This did not come\nabout due to mere sentimental nostalgia, but reflected the fact that criticism of the\nalliance’s demise became a cause ce´le`bre of the right in British politics, which\nbelieved that the relationship with Japan had been sacrificed in the name of\ninternationalism. Praise for the alliance was therefore implicitly a rejection of the\ntenets of post-war diplomacy and a call for a return to a foreign policy based\non the balance of power and national interest. To argue this case effectively,\nhowever, it was necessary to mythologize the alliance and turn it into an exemplar\nof the certainties of ‘old diplomacy’. The ‘ghost ’ is therefore an obstacle to our\nunderstanding of why the alliance was terminated, but at the same time, like\nother political myths, it tells us much about the period in which its presence was\nfirst felt.\nI I\nThe best place to begin such a study is briefly to provide an interpretation based\non the specialist literature of why and how the alliance ended in 1921–2. The\nstarting point is that the alliance had been renewed in 1911 for ten years : the\nBritish and Japanese governments therefore had to decide in 1921 whether they\nwanted to continue with this treaty relationship. This issue was very delicate for\nBritain, for it was clear that the United States was suspicious of Japanese am-\nbitions in Asia and felt that Japan was using the alliance as a shield under whose\nprotection it could infringe the ‘open door ’ in China. American opposition was\nsomething that could not be ignored, for the British government of David Lloyd\nGeorge wished to build up a spirit of co-operation with Washington, a policy that\nwas also strongly supported by the Meighen administration in Canada and that of\nSmuts in South Africa. Thus in the run-up to the Washington conference con-\nsiderable pressure was exerted on Britain to terminate the alliance.15\nIt is important to note though that Britain had its own reasons for doubting the\nwisdom of continuing the alliance. Japan had entered the Great War in August\n1914 on Britain’s side, but its behaviour during the conflict had not on the whole\n15 Ira Klein, ‘Whitehall, Washington, and the Anglo-Japanese alliance, 1919–1921’, Pacific Historical\nReview, 41 (1972), pp. 460–83; and Nish, Alliance in decline, pp. 324–53.\nT H E GHO S T O F TH E A L L I A N C E 815\nendeared it to its ally. On the positive side Japan had protected the sea-lanes to\nAustralia and New Zealand and allocated destroyers for duty in the\nMediterranean. On the other hand, however, it always insisted on a high price for\nthis support, and on a number of occasions abruptly turned down requests for\nfurther assistance. This was understandable to a degree, as the alliance did not\ncommit it to come to Britain’s aid outside east Asia, but, when added to the way\nin which Japan’s media argued that it had entered the conflict on the wrong side,\nit created a poor impression. Furthermore, its adventurism in China and Siberia,\nthe rise of pan-Asian sentiment, its refusal to hand over a number of Indian\nrevolutionaries, and the presence of Japanese propagandists in Malaya and India\nengendered suspicion of its long-term objectives.16\nThe result of this war record was that the senior officials involved in the day-to-\nday diplomacy towards east Asia, such as the past and present ministers to Peking,\nSir John Jordan and Sir Beilby Alston, the former ambassador to Tokyo,\nSir William Conyngham Greene, and the supervisor of the Far Eastern\nDepartment, Sir Victor Wellesley, who were all too aware of Japan’s machi-\nnations, were opposed to the alliance’s renewal.17 This opposition was reinforced\nby the fact that, with the defeat of Germany and the collapse of Russia into civil\nstrife, the alliance had in any case lost its raison d’eˆtre. Indeed, the irony of the\nsituation was that only one power now posed a potential threat to British interests\nin east Asia, and that was Japan itself.\nOn the other hand, for some, including Lloyd George, the potential Japanese\nthreat constituted a reason in itself to continue the alliance, as the best way to\ncontrol Japan’s ambitions was to keep it close. Only this, it was held, would stop it\nfrom drifting into a future alignment with Germany and Russia.18 Thus the\nforeign secretary, Lord Curzon, observed at a committee of imperial defence\n(CID) meeting in December 1920 that the alliance with the ‘ insidious and\nunscrupulous ’ Japanese was necessary to keep them in order.19 This view was also\nstrongly supported by William Hughes, the prime minister of Australia, who\nemerged somewhat surprisingly, considering the anti-Japanese line he had taken\nat Paris in 1919, as the most ardent proponent for continuing the alliance.\nHughes, however, had his reasons ; he too was concerned for his country’s\nsecurity, but as well as that he also saw renewal of the alliance as a means of\nforcing Japan to respect Australia’s ‘white-only ’ immigration laws.20\n16 Peter Lowe, Britain and Japan, 1911–1915: a study of British Far Eastern policy (London, 1969) ;\nR. J. Popplewell, Intelligence and imperial defence : British intelligence and the defence of the Indian empire,\n1904–1924 (London, 1995) ch. 11 ; Antony Best, British intelligence and the Japanese challenge in Asia,\n1914–1941 (Basingstoke, 2002) ch. 3; and Nish, Alliance in decline, pp. 115–262.\n17 See, for example, CID130-C, ‘Suggestions for an Anglo-Saxon policy in the Far East ’, Alston\nmemorandum, 1 Aug. 1920, London, National Archives (NA) CAB5\/3.\n18 See John Ferris, ‘Armaments and allies : the Anglo-Japanese strategic relationship, 1911–1921’, in\nO’Brien, ed., The Anglo-Japanese alliance, pp. 254–7.\n19 CID 134th meeting, 14 Dec. 1920, NA CAB2\/3.\n20 Sean Brawley, The white peril : foreign relations and Asian immigration to Australasia and North America,\n1919–1978 (Sydney, 1995), pp. 73–4.\n816 A N TON Y B E S T\nFrom the meeting of these two competing views of the alliance there eventually\narose a mutually acceptable compromise, namely that the simple answer to\nAmerican and Canadian criticism was that the treaty should be expanded to\ninclude the United States. Accordingly, at the Imperial Conference in London in\nthe summer of 1921 the delegates agreed that this should become the objective for\nBritain to pursue at the forthcoming gathering in Washington. However, when\nthe Washington conference opened in November 1921 the American secretary of\nstate, Charles Evan Hughes, summarily rejected any such arrangement.21\nBy this time events had proceeded to such a point that it was unthinkable that\nBritain could return to straightforward renewal. This was because at Washington\nthe future of the alliance became inexorably linked to the issue of naval arms\nlimitation. By 1921 the naval arms race that had developed between the United\nStates and Japan had led the Admiralty to call for the construction of new capital\nships, lest Britain be left behind. This was an expenditure that the Treasury could\nill afford and which had the potential to spark an Anglo-American naval com-\npetition that the British were unlikely to win. As a result Britain realized that the\nonly way in which it could avoid involvement in an arms race was if it agreed to\nforego the alliance and thus create an environment in which the United States\nwould agree to naval limitation. This was not an unattractive proposition, for\nwhat was on offer at Washington was a deal that in theory offered Anglo-\nAmerican parity, but in reality allowed Britain to maintain a slight quantitative\nand qualitative advantage over the United States, and a two-power standard in\nrelation to Japan and France.22\nIt can therefore be argued that Britain accepted non-renewal largely because\nthe reasons for maintaining the alliance were not substantial enough to warrant\njeopardizing American goodwill, and because the strategic disadvantages arising\nfrom termination were compensated for by the introduction of naval arms limi-\ntation. Thus in analysing the story of the death of the alliance one cannot say that\nBritain was enthusiastic about continuing its ties with Japan but was cruelly de-\nnied by circumstance from attaining this goal. In fact it only desired to keep its\nlink with Tokyo for the purpose of controlling this otherwise potentially danger-\nous rival, which it had little reason to trust. However, once it became clear that\nthis expedient policy would damage imperial unity, impair relations with\nWashington and possibly lead to a naval arms race, the sacrificing of Japan\nwas inevitable. To argue from hindsight that the end of the alliance was simply\ndictated by Washington and Ottawa, or that it was merely a naive decision\ninfluenced by a nebulous desire to construct an Anglo-American world order, is\ntherefore to miss the point. This was not a rash move by the British government,\nbut one that squarely met the strategic and financial circumstances that faced\nWhitehall in the autumn of 1921.\n21 Nish, Alliance in decline, pp. 368–71.\n22 See Ferris, ‘ ‘‘ It is our business in the navy to command the seas’’ ’, pp. 129–34.\nT H E GHO S T O F TH E A L L I A N C E 817\nContrary to some accounts, opinion in parliament and the media broadly\nagreed to the severing of the alliance with Japan and saw the Washington con-\nference as an unmitigated success.23 In the House of Commons, there was no\ndebate on the issue of the alliance’s future, but on the eve of the gathering\nin Washington a unanimous resolution was passed supporting the conference’s\nobjectives.24 Furthermore the tone of parliamentary questions concerning Japan\nwas generally critical. For example, MPs from the coalition benches often\nexpressed concerns about Japan’s activities in China, while Labour members\nlobbied the government to press for a Japanese withdrawal from eastern Siberia.\nIn the media many voices, including those of the Manchester Guardian and The\nSpectator, argued that military pacts had no place in an international order now\ndefined by the League of Nations and that the alliance should be abrogated in\norder to draw closer to Washington.25 Moreover a notable symbol of Britain’s\nchanging attitude towards Japan was that The Times, which had been one of the\noriginal advocates of an alliance at the turn of the century, now took a strongly\nanti-Japanese stance.26\nIt was not merely internationalism and the desire for Anglo-American soli-\ndarity that led the media in this direction, for a number of journalists were in-\nfluenced by suspicion of Japan and its war record. For example, Henry Wickham\nSteed, the editor of The Times, noted in September 1921 his belief that Japanese\nambitions in Asia were ‘ incompatible with British interests either in the Far East\nor in Asia generally ’.27 Meanwhile, the veteran military correspondent, Charles a`\nCourt Repington, recorded in his diary that ‘ Japan seems to me to have con-\nstantly infringed both the letter and the spirit of her alliance with England, and\nhas been openly aiming at the protectorship of China. ’28 Thus one can conclude\nthat if the government had decided to retain the alliance at the cost of American\nfriendship it would have been running against the broad tide of public opinion.\nIn the years immediately following the Washington conference, anti-Japanese\nsentiment continued to be expressed. In 1923 the British ambassador to Tokyo,\nSir Charles Eliot, observed, while on home leave, that among the politically well-\ninformed the popularity of Japan had much declined since his previous visit three\nyears before.29 Much of this distaste can be attributed to the claims made at this\n23 The claim that the decision was taken in the face of public opinion is in Peter Calvocoressi, Guy\nWint, and R. John Pritchard, Total war : the causes and course of the Second World War (2 vols., London,\n1989), II, p. 47. For a more accurate account, see Inbal Rose, Conservatism and foreign policy during the Lloyd\nGeorge coalition, 1918–1922 (London, 1999), pp. 170–1.\n24 Parliamentary debates, 5th series (Commons), vol. 147, cc. 2093–145 (4 Nov. 1921).\n25 Charles Nelson Spinks, ‘The termination of the Anglo-Japanese alliance’, Pacific Historical Review,\n6 (1937), pp. 321–40, at p. 327.\n26 The history of The Times : the 150th anniversary and beyond, 1912–1948 (2 vols., London, 1952), II,\npp. 612–22.\n27 ‘British policy in the Pacific’, Steed memorandum, 22 Sept. 1921, London, British Library, Steed\npapers, Add. MSS 74156, fo. 187.\n28 C. A`. Court Repington, After the war : a diary (London, 1922), p. 399.\n29 Eliot to Vansittart, 3 July 1923, NA Curzon papers FO800\/155.\n818 A N TON Y B E S T\ntime by the Admiralty that Japan posed a potentially serious threat to British\ninterests. To a substantial degree the Admiralty’s fixation with Japan after 1922\narose from its own budgetary considerations, but in order to strengthen its case\nthe propaganda it directed at the cabinet made biting references to Japanese\nwartime behaviour.30 Thus, in 1924 the first sea lord, Admiral of the Fleet Lord\nBeatty, warned the government that ‘The behaviour of Japan during the late war\nshould not be forgotten’ and that it could not be trusted in the future.31 In March\n1925 Vice-Admiral Sir Roger Keyes followed suit, noting that if the Japanese,\nwho were engaged in ‘a steady and ruthless preparation for war’, were not\nchecked they would ‘ turn Europeans out of China and, in time, Asia ’.32\nThe naval lobby in the House of Commons also voiced hostility. Between 1922\nand 1925 the debates on naval estimates, and in particular those concerned\nwith the construction of a naval base at Singapore, witnessed a number of\nConservative MPs openly criticizing Japan. For example, Sir Frederick Penny,\nthe MP for Kingston-upon-Thames, warned in March 1924 that the Japanese\nhad the same mentality as the Germans, while in March 1925 Carlyon Bellairs,\nthe MP for Maidstone, drew parallels between Japan’s naval expansion and the\nAnglo-German arms race before 1914.33\nThe government, as one might expect, studiously avoided such heated rhetoric.\nIndeed, they went in the opposite direction. In order to reassure Japan about\nSingapore, ministers strenuously denied that the base was being built because of\nsuspicion of that country. To reinforce this argument they began to make senti-\nmental references to the alliance and to laud, in the words of the prime minister,\nStanley Baldwin, the ‘ special bond of an historic and valued relationship’.34\nThus, when the naval estimates for 1925 came up for debate in parliament, both\nthe Lord President of the Council, Lord Balfour, in the Lords, and the First Lord\nof the Admiralty, Sir William Bridgeman, in the Commons, referred to the long\nhistory of British friendship with Japan.35 The alliance therefore became an\nofficial object of nostalgia. Ironically, at the same time a similar interpretation of\nthe past was used by opponents of the Singapore base who contended that its\nconstruction wantonly risked alienating Britain’s formerly ‘scrupulously loyal ’\nally.36 Thus in one of the debates Lloyd George paid testimony to Japan’s assist-\nance during the Great War, noting ‘she was one of our best Allies ; she kept her\nbargain very faithfully with us ; she held those seas for us ; she protected our\n30 On naval policy and Japan in the early 1920s see Christopher M. Bell, The Royal Navy, seapower and\nstrategy between the wars (Basingstoke, 2000), pp. 18–19.\n31 ‘Consequences of suspending work at Singapore’, Beatty note, 28 Apr. 1924, in B. M. Ranft, ed.,\nThe Beatty papers : selections from the private and official correspondence and papers of Admiral of the Fleet Beatty\n(Aldershot, 1993), p. 395.\n32 Keyes to Churchill, 21 Mar. 1925, in Martin Gilbert, ed., Winston S. Churchill, V, Companion, part I\n(London, 1979), p. 443.\n33 Parliamentary debates, 5th series (Commons), vol. 171, c. 1226 (25 Mar. 1924), and vol. 181, c. 2625\n(19 Mar. 1925). 34 Parliamentary debates, 5th series (Commons), vol. 180, c. 1590 (23 Feb. 1925).\n35 Parliamentary debates, 5th series (Lords), vol. 60, c. 386 (4 Mar. 1925), and (Commons), vol. 181,\nc. 2525 (19 Mar. 1925). 36 ‘The Singapore base’, Spectator, 28 Mar. 1925, p. 488.\nT H E GHO S T O F TH E A L L I A N C E 819\ncommerce … when we wanted our ships at home’.37 Both of these efforts to\nsentimentalize were political manoeuvres and did not mean that these figures\nactually questioned the decision to end the alliance. However, by asserting\na benevolent interpretation of the alliance’s history, they began to create\nan environment in which that case could be made.\nI I I\nOne of the few commentators on foreign affairs who openly criticized the decision\nto terminate the alliance was Leo Maxse, the editor of the monthly journal, the\nNational Review. In a number of editorial essays from 1922 onwards, Maxse and\nother contributors to the journal savagely lambasted the Lloyd George govern-\nment for its gross incompetence in allowing the alliance to collapse. In these\nattacks they consistently noted the stability that had existed under the alliance and\npaid tribute to Japan’s resolute friendship. For example, in February 1925 Maxse\nobserved in typically biting prose that :\nGreat Britain had always found the Japanese a singularly loyal ally, and the splendid\nservice they rendered the cause of civilization by coming into the Great War on our\nside should have spared them the humiliation which the emasculates of Downing Street\nallowed the Washington Government to inflict upon them.38\nIt was therefore Maxse and his acolytes who first began to cultivate the idea that\nthe alliance had been some kind of golden age which Britain had foolishly turned\nits back upon.\nIn order to place this attack on British policy in context it is important to note\nthat, first, Maxse was a long-standing admirer of the Japanese and, second, that\nthe National Review was no ordinary journal, but was, along with the Morning Post,\none of the splenetic mouthpieces of the ‘die-hard’ wing of the Conservative party.\nThe assault on the abrogation of the alliance therefore needs to be seen in the\nlight of the ‘die-hard ’ faction’s extreme hostility to many of the ideas that influ-\nenced British thinking on foreign policy in the 1920s. Wedded to the Hobbesian\nidea that international politics was defined by an unrelenting competition be-\ntween states for power, the ‘die-hards ’ dismissed the League of Nations as an\nidealistic, liberal pipe dream that was doomed to failure and also raged against\nthe concepts of naval limitation and disarmament. Indeed, they even went as\nfar as viewing internationalism as a pernicious collectivist creed that was the\nantithesis of British patriotism and which, if unchallenged, had the potential to\n37 Parliamentary debates, 5th series (Commons), vol. 186, c. 1663 (16 July 1925). See also the comment\nby the Labour politician Commander Kenworthy in Parliamentary debates, 5th series (Commons),\nvol. 193, c. 960 (22 Mar. 1926).\n38 ‘Episodes of the Month’, National Review, 84 (Feb. 1925), p. 822. Maxse’s attacks began in the May\n1922 edition. For other commentators see ‘Centurion’, ‘A first-class blunder and its results ’, National\nReview, 85 (May 1925), pp. 382–96, and ‘Diplomaticus’, ‘The choice’, National Review, 85 (Aug. 1925),\npp. 902–10.\n820 A N TON Y B E S T\nsap the nation’s spiritual strength. For them Britain’s national interests could only\nbe defended by a ‘realistic ’ policy of imperial isolation based on strong arma-\nments.39 In addition, they had little time for the ‘Atlanticism’ that permeated\nliberal thought in Britain. For the ‘die-hards ’ the United States was an unreliable\npower and one that posed, due to its financial and economic strength, a potent\nthreat to the future of the empire. Nothing symbolized this better than the\non-going debate about Britain’s war debts, which showed to the right of the\nConservative party the liberal folly of assuming that the Americans would look\nbenevolently on their English cousins.40\nMaxse himself epitomized die-hard views. He had, for example, once rejected\nan offer of membership of the English Speaking Union on the grounds that he\nwould have no truck with ‘all this Anglo-American ‘‘ slobber’’ ’.41 His praise of the\nalliance was thus implicitly not merely an attack on a single misguided decision,\nbut rather part of a general criticism of modern practice and a plea to return to\nthe certainties of the pre-war era. Therefore from the very start the debate about\nthe alliance’s termination contained an ideological element.\nAt first only a few observers supported Maxse’s view that Britain had erred in\nscrapping the alliance, but slowly the chorus of criticism began to grow. The first\nmajor event that brought about a wider reassessment of the alliance’s demise was\nthe seizure by the Chinese nationalist party, the Kuomintang (KMT), of the\nBritish concession at Hankow in central China in January 1927. To some con-\nservatives this humiliation, which came after two years of Chinese provocation,\ndisplayed all too clearly what Britain had lost by sacrificing the alliance in 1921–2.\nAs one observer, Captain Bertram Ramsay, noted in April 1927 ‘ there is no doubt\nwhatever that it [the alliance] would have made all the difference in the present\ndisturbance & might conceivably have prevented it ’.42 Thus, this event led con-\nservatives to lament the loss of an alliance that, they contended, had guaranteed\nregional stability ; a basic matter of strategy that Britain had foolishly neglected\nin 1921.\nFurther reinforcing this tendency was the fact that by 1927 a number of prob-\nlems had come to dog Anglo-American relations. In regard to east Asia it was felt\nthat, although the alliance had been sacrificed for the beaux yeux of the Americans,\nlittle had been gained by such a manoeuvre, for the United States had not\nonce come to Britain’s aid in China. The most controversial area of dispute,\nhowever, was over naval policy. Here two linked issues, Washington’s calls for\na redefinition of the freedom of the seas and its demand for parity in cruiser\nnumbers, threatened the Royal Navy’s global predominance. Accordingly, the\n39 See G. C. Webber, The ideology of the British right, 1918–1939 (London, 1986), pp. 116–17; Markku\nRuotsila, British and American anticommunism before the cold war (London, 2001), pp. 71–4 and 142–52; and\nRose, Conservatism and foreign policy, pp. 56–9. 40 Rose, Conservatism and foreign policy, pp. 107–27.\n41 Maxse to Wrench, 22 July 1919, Chichester, West Sussex Record Office (WSRO), Maxse papers,\n476, fo. 57.\n42 Ramsey to Keyes, 9 Apr. 1927, in Paul G. Halpern, ed., The Keyes papers : selections from the private and\nofficial correspondence of Admiral of the Fleet Baron Keyes of Zeebrugge (2 vols., Aldershot, 1980), II, p. 211.\nT H E GHO S T O F TH E A L L I A N C E 821\nGeneva naval arms limitation conference in the summer of 1927 was a bad-\ntempered affair in which, to British eyes, American bellicosity contrasted with the\ngoodwill of the Japanese delegation.43\nThe newly found sympathy for the alliance went, however, beyond strategic\nconsiderations, for also underlying this reappraisal was an assumption that Britain\nand Japan stood for similar values and approaches to international politics. In\norder to understand this thinking one has first to grasp that the Chinese policy\npursued by the Conservative foreign secretary Sir Austen Chamberlain in 1926–7\nwas deeply unpopular with many in his party.44 Chamberlain’s diplomacy was\nbased upon the idea that Chinese nationalism was a phenomenon that could not\nbe suppressed through the use of force. As such, the best way to protect British\ninterests was to show a willingness to negotiate away the trappings of imperial\nprivilege and to move towards a more equal relationship. This policy appealed to\nliberals, but to the ‘die-hards ’ it smacked of weakness ; to them it proved, as one\nindividual noted succinctly, that Chamberlain ‘has no guts ’.45 The prevailing\nview on the Conservative benches in parliament was that the pretensions of\nChinese nationalism were illegitimate ; Britain, after all, had acquired its privi-\nleges in China as treaty rights. Moreover, China’s recent history, in which it\nhad been torn asunder by civil war and plagued by bad governance and labour\nagitation, hardly suggested that the sacrifice of British treaty rights would\nguarantee future prosperity. Then there was, of course, the most damning\nindictment of all, which was that the KMT in its campaign to reunify China had\nturned for support to the entity that the Conservative party loathed above all\nothers – the Soviet Union.\nThis disdain for revolutionary China led conservatives to contrast it with\nJapan, which stood as the antithesis of Chinese disorder. As a country that had a\nconstitutional monarchy and which put great stress on property, tradition, and\nthe upholding of law and order, Japan possessed values that British conservatives\ncould understand. It also, as the Conservative MP for Norwich, Edward Hilton\nYoung, observed in the House of Commons in February 1927, benefited from\ngood leadership, a concept alien to China – ‘the worst governed country in the\nworld’.46 In addition, Japan respected international treaties, shared the con-\nservative antipathy towards communism, and was itself a victim of China’s call\nfor the end of foreign privileges. Furthermore, in contrast to Chamberlain’s line,\nJapan was represented as standing firm in defiance of Chinese nationalism and\n43 See B. J. C. McKercher, The second Baldwin government and the United States, 1924–1929: attitudes and\ndiplomacy (Cambridge, 1984), ch. 3.\n44 See, for example, Amery to Baldwin, 18 Sept. 1926, Cambridge University Library (CUL),\nBaldwin papers, vol. 115. For commentators in the right-wing media see J. O. P. Bland, ‘Plain truths\nabout China’, English Review, 44 (Feb. 1927), pp. 145–54; and Ernest Remnant, ‘Conciliation or\ncapitulation?’, English Review, 44 (Apr. 1927), pp. 392–400.\n45 King to Maxse, 7 Sept. 1926, WSRO, Maxse papers, 479, fo. 484.\n46 Parliamentary debates, 5th series (Commons), vol. 202, c. 341 (10 Feb. 1927).\n822 A N TON Y B E S T\nas insisting that treaty rights be respected.47 This was, of course, a self-serving\ninterpretation of Japan’s China policy, for its diplomacy was considerably more\ncomplex than this, but it was a convenient image to hold when the object was to\ncriticize Britain’s supposedly supine Foreign Office.48\nContemporary events thus appeared, as far as the right was concerned, to\nconfirm that much had been lost when the alliance had been terminated. Britain\nhad forsaken a like-minded ally only to find itself isolated in a sea of adversity. In\nthis environment the criticism of Japan that had been evident on the right in the\nimmediate wake of the Washington conference was forgotten. Now it was\nMaxse’s interpretation of the alliance that attracted attention, for it presented a\nromantic image of the once stable world that had existed before the storm.\nInfluenced by such thinking, a few Conservative MPs, including former critics\nfrom the naval lobby, went beyond wallowing in nostalgia and began to call\nopenly for a rapprochement with Japan, with whom, as one put it, Britain had\n‘had the happiest alliance for many years ’.49 Some government officials expressed\nsimilar sentiments. For example, in February 1930 a memorandum by the\ngovernor of Hong Kong, Sir Cecil Clementi, warning of Japan’s ambitions in\nChina, led the director of naval intelligence to note forlornly that this was ‘ sad\nreading for one who regrets the surrender of the Anglo-Japanese Alliance mainly\nin deference to American susceptibilities with the resultant decrease in security in\nthe Far East, and what gained?’.50\nI V\nIf the ‘northern expedition ’ sowed the seeds of the conservative reassessment of\nthe alliance, then the troubled course of the Manchurian crisis of 1931–3 was the\ncatalyst that caused it to come into full bloom.51 From the very start of this new\nperiod of turbulence the ‘die-hards ’ took a pro-Japanese stance, claiming, for\nexample, that its aggression within southern Manchuria constituted a legitimate\nact of self-defence in the face of constant provocation.52 These statements of\nsupport were a natural evolution of the views expressed in 1927–8, but what was\ndifferent about this crisis, and led them to be even more fervent, was that on this\noccasion the League of Nations was involved. By appealing to Geneva to mediate\n47 ‘Current comments ’, English Review, 44 (Mar. 1927), pp. 263–5.\n48 See, for example, Harumi Goto-Shibata, Japan and Britain in Shanghai, 1925–1931 (Basingstoke,\n1995).\n49 Looker (C-Essex SE) speech in Parliamentary debates, 5th series (Commons), vol. 211, c. 2356 (14 Dec.\n1927). See also the speech by Bellairs (C-Maidstone) in vol. 210, c. 2174 (24 Nov. 1927), and the PQ\nasked by Howard-Bury (C-Chelmsford) in vol. 211, c. 1836 (12 Dec. 1927).\n50 DNI minute, 18 Feb. 1930, NA ADM1\/8744\/128.\n51 For the international diplomacy of the Manchurian crisis see Christopher Thorne, The limits of\nforeign policy : the West, the League and the Far Eastern crisis of 1931–1933 (London, 1972) ; and Ian Nish, Japan’s\nstruggle with internationalism: Japan, China and the League of Nations, 1931–1933 (London, 1993).\n52 See, for example, Bland to Editor, The Times, 19 Oct. 1931, p. 8, col. C; and ‘Orient’, ‘Practical\npolitics in the far east ’, Empire Review (Apr. 1932), p. 212.\nT H E GHO S T O F TH E A L L I A N C E 823\nthe crisis in September 1931, China raised the dispute on to an entirely different\nlevel, for suddenly a successful solution to the problems in Manchuria became a\nmeasure of whether the League would be able to live up to the hopes that it had\nengendered.\nThe involvement of Geneva heightened support for Japan in ‘die-hard’ circles,\nfor they had never been sympathetic towards the League, seeing it as the ill-\nstarred creation of that naive utopian President Wilson. Moreover, this antipathy\ntowards the League was, of course, reinforced by the fact that the Labour party\nand the detested progressive intellectuals so resolutely put their faith in the idea\nof collective security. Indeed there existed at the time a stifling intellectual\nclimate, particularly in parliament itself, in which criticism of the League was seen\nas heresy.53 Accordingly the crisis represented a chance for the ‘die-hards ’ to\ndemonstrate what they saw as the absurdity of diplomacy centred on the League\nrather than national interest, particularly once the internationalists began to call\nfor sanctions against Japan.\nThe result was that from 1931 onwards a growing number of Conservative MPs\nsought both publicly and privately to defend Japan’s actions, and, moreover, to\nargue that the crisis would never have happened if the alliance had been allowed\nto continue. Indeed it is at this point that one might say that this view became an\nestablished item of conservative dogma, for even those not normally associated\nwith the ‘die-hards ’, including figures such as R. A. Butler and Cuthbert\nHeadlam, now began to repeat it as received wisdom.54 Lamentations for the lost\ndays of the alliance and calls for friendship with Japan were now expressed fairly\nfrequently in debates in both houses of parliament.55 Thus, in May 1934, none\nother than Admiral Keyes, now the newly elected Conservative MP for\nPortsmouth North, observed that the present unsatisfactory conditions had their\nroots in the recent past when Britain had made the ‘deplorable mistake’ of ter-\nminating its alliance with Japan. This was a decision, Keyes claimed dis-\ningenuously, that he had always regretted, for Japan had listened to Britain when\nthe alliance had existed. He ended his peroration by recommending to those in\ngovernment that they should do ‘all in their power to return to the excellent\nunderstanding with Japan which existed in those days ’.56 His colleague Victor\nCazalet, the Conservative MP for Chippenham, enthusiastically agreed, noting\nthat ‘ in the Great War Japan had shown herself as a very loyal ally of this\ncountry ’ and affirming that Britain should accept its dominant role in east Asia.57\n53 See R. Bassett, Democracy and foreign policy : a case history (London, 1952), p. 569.\n54 Butler to Brabourne, 12 Dec. 1935, London, British Library, Asian, Pacific, and African Dept,\nBrabourne papers, MSS.Eur.F97\/20A; and diary entry, 8 Mar. 1936, Durham, County Durham\nRecord Office, Headlam papers, D\/He 32.\n55 For such comments, see Parliamentary debates, 5th series (Commons), vol. 275, c. 2220 (16 Mar.\n1933) ; and Parliamentary debates, 5th series (Lords), vol. 97, cc. 527–42 (3 Apr. 1935), and vol. 102, cc. 22–6\n(20 July 1936). 56 Parliamentary debates, 5th series (Commons), vol. 289, c. 2084 (18 May 1934).\n57 Ibid., c. 2085.\n824 A N TON Y B E S T\nThese views were also echoed in the media, where one of the new adherents to\nthis line was Viscount Rothermere. In editorials in the Daily Mail and in speeches\nmade during a visit to Japan in 1936 he deplored the alliance’s termination and\nlambasted the League enthusiasts whom he saw as poisoning relations with the\nJapanese.58 In addition, the Empire Review, the English Review, the Morning Post, the\nSaturday Review, and the National Review produced a series of articles that lamented\npast errors and called for renewed friendship. For example, in April 1933 Sir\nClement Kinloch-Cooke, the editor of the Empire Review, observed in his monthly\ncolumn that\nAfter much harassing of mind and not a little sympathetic feeling, people are beginning to\nrecall the benefits of the alliance and the generous and unceasing aid given by Japan to this\ncountry during the Great War. They are thinking more of what the alliance stood for than\nof the tricky ways of Geneva, where a great deal is talked about but comparatively little\nachieved.59\nIn a similar vein another passionate plea for better Anglo-Japanese relations,\nwhich was published anonymously in November 1933 in the English Review, in-\ncluded the remarkable assertion that in 1914 ‘ the Japanese were absolutely the\nonly people we could depend upon’.60 A number of studies of contemporary east\nAsia also included similar arguments, most notably those by Malcolm Kennedy, a\nformer Reuters correspondent in Japan, and Ernest Pickering, a former\nConservative MP.61\nThe allusions to the ‘golden age’ of the alliance were not restricted to the\npolitical foot soldiers, for those in the highest reaches of power also expressed such\nsentiments. For example, in September 1933 the chief of the imperial general\nstaff, General Sir Archibald Montgomery-Massingberd, declared that the de-\ncision to end the alliance had been one of ‘ insensate folly ’ which had deprived\nBritain ‘of a valued ally for no compensating gain in the shape of a less jealous\nAmerica’.62 Another significant critic was the chancellor of the exchequer, Neville\nChamberlain, who observed at a meeting of the CID in November 1933 that he\nconsidered the abrogation of the alliance to have been a mistake as ‘ it had\ngradually poisoned our relations with Japan’.63 Accordingly he proposed that\n58 Viscount Rothermere, Warnings and predictions (London, 1939), pp. 180–5, and Spinks, ‘The\ntermination of the Anglo-Japanese alliance’, p. 321.\n59 The Editor, ‘Round the empire’, Empire Review (Apr. 1933), p. 195.\n60 ‘R’, ‘Anglo-Japanese relations’, English Review, 57 (Nov. 1933), pp. 519–25. See also the comments\nby George Sale in the ‘Summary of discussion’ appendix to Lord Lothian, ‘The crisis in the Pacific’,\nInternational Affairs, 14 (Mar.–Apr. 1935), pp. 170–1.\n61 Malcolm Kennedy, The problem of Japan (London, 1935), pp. 64–74; and Ernest H. Pickering,\nJapan’s place in the modern world (London, 1936), pp. 318–19. For a review of this literature, see\nJon Pardoe, ‘British writing on contemporary Japan, 1924–1941: newspapers, books, reviews and\npropaganda’, in Gordon Daniels and Chushichi Tsuzuki, eds., The history of Anglo-Japanese relations,\nV: The social and cultural perspectives, 1600–2000 (Basingstoke, 2002), pp. 281–304.\n62 Montgomery-Massingberd (CIGS) to Hankey (Cabinet Office), 11 Sept. 1933, NA CAB21\/369.\n63 CID 261st meeting, 9 Nov. 1933, NA CAB2\/6.\nT H E GHO S T O F TH E A L L I A N C E 825\nBritain should attempt to restore its former friendship with Japan, a line that he\nwas intermittently to pursue with a marked lack of success for the rest of the\ndecade.\nThe belief that abrogation of the alliance had been a calamitous mistake thus\nrapidly gathered converts and led a sizeable minority to argue that, if Britain\nrevoked its obeisance to Washington and Geneva, a new relationship could be\nbuilt with Japan that would guarantee the security of British interests in the east.\nBut while this argument was frequently voiced by the right and had some support\nwithin the government, it did not become nearly as influential as the calls for\nappeasement of Germany. In part one can attribute this to circumstance, for the\nJapanese threat was clearly not as immediate as that posed by Hitler. In addition,\nhowever, it is important to see that much of the debate about Japan consisted of\nmere rhetorical point-scoring rather than mapping out a real alternative policy.\nIndeed, reading the statements of those who decried the alliance’s demise one is\nstruck by the fact that their words of enthusiasm for Japan were not so much for\nthe country itself, but for what it represented. At heart their arguments were\nexpressions of hostility towards China, the United States, the Soviet Union, and,\nperhaps most of all, the League. Thus Japan was not appreciated for what it\nwas so much as for what it was not. As such the sympathy for Japan was not deep\nand genuine, but rather a symbolic expression of dissatisfaction at the way in\nwhich international politics had evolved since the end of the Great War. It is\ntherefore no accident that the vague talk of reviving the alliance failed to turn\ninto anything more substantial, for real pro-Japanese sentiments existed only\namong a few.\nWhile the lamentations over the alliance’s demise undoubtedly had popular\nappeal, it is also important to note that this view never possessed a monopoly over\nBritish opinion, and that many saw it as a flawed argument. Criticism came from\na number of angles. Some, such as Sir Austen Chamberlain and the cabinet\nsecretary Sir Maurice Hankey, took a realpolitik line. They agreed that the al-\nliance’s demise was regrettable, but from their own experience stated that it was\ninconceivable that Britain could have resisted American and Dominion pressure\nin 1921–2.64 Others rejected the sentimental images of Japan because the latter’s\naggressive trade policy in the early to mid-1930s directly threatened their liveli-\nhood. Thus in areas such as Lancashire conservative opinion began to be at-\ntracted more by ‘yellow peril ’ rhetoric than by stories about the special ties that\nexisted between the ‘ two island empires ’.65\nThe most biting criticism, however, came from liberal publicists, who directly\nattacked the idea that termination had been an error because Japan had proved\n64 See Austen Chamberlain to Howard, 25 Apr. 1927, Birmingham University Library, Austen\nChamberlain papers, AC54\/264; and Hankey to Montgomery-Massingberd, 22 Sept. 1933, and\nHankey to Neville Chamberlain, 30 Oct. 1933, NA CAB21\/369.\n65 Antony Best, ‘Economic appeasement or economic nationalism?: a political perspective on the\nBritish empire, Japan and the rise of intra-Asian trade, 1933–1937’, Journal of Imperial and Commonwealth\nHistory, 30 (2002), pp. 77–101.\n826 A N TON Y B E S T\nitself to be a trustworthy ally in the Great War. In April 1932 Wickham Steed\nargued in the journal Nineteenth Century and After that the alliance had been re-\nmoved for the very good reason that Japan could not be trusted, and described in\ndetail the suspicion of Japanese activities that he had discovered in British\nColumbia in 1921.66 The military correspondent of The Times, Basil Liddell Hart,\ntook a similar view. In March 1935, in a conversation with Major-General\nJohn Dill, he refuted the latter’s assertion that Japan had been a ‘good ally\nto us in the last war ’ asserting that ‘as an ally she wanted to get but not to\ngive ’.67 Unsurprisingly, the pro-American lobby in British politics also rose to\nthe challenge. In the autumn of 1934 Lord Lothian helped to organize a\ncampaign of public speeches and newspaper articles that refuted the claim that\nBritain’s destiny lay in renewed friendship with Japan. Among his supporters\nwere figures such as J. L. Garvin and Lord Astor, the editor and proprietor of\nThe Observer, respectively, and General Smuts, who was on a brief visit to\nLondon.68\nBehind the scenes many in the Foreign Office took the same line. In 1926 Sir\nVictor Wellesley was recorded as stating that the Japanese were ‘basically un-\ntrustworthy and unscrupulous ’ and that ‘If one had nothing else to go by, their\nattitude towards us during the War would be enough. ’69 The minister in Peking,\nSir Miles Lampson, who had been present at the Washington conference, took\nthe same line, noting in typically blunt style that ‘The people who killed the A-J\nAlliance were primarily the Japanese themselves ’, due to ‘ their misdeeds in\nChina’ during the Great War.70 In 1934 Sir John Pratt of the Far Eastern\nDepartment affirmed his belief that proposals for a return to the alliance were\n‘counsels of sentiment and not of wisdom’, and observed that Japan’s behaviour\nduring the alliance had meant that the relationship had become ‘a source\nof embarrassment ’ to Britain.71 The Foreign Office thus acted as a strong\ninstitutional check to the idea that the alliance could be revived. Others in\nWhitehall expressed similar scepticism. When faced in 1930 with Clementi’s\nplea for better relations with Japan, one anonymous member of the War Office\nnoted:\nWhen all the past history of the Alliance is reviewed, can it be seriously supposed that\nJapan will act in a different manner in the future? On the contrary, if it teaches anything,\none is forced to the conclusion that she will use an Entente to increase her own prestige, to\n66 Wickham Steed, ‘British policy in the Pacific’, Nineteenth Century and After, 111 (Apr. 1932),\npp. 396–409.\n67 ‘Talk with Dill ’, Liddell Hart note, 27 Mar. 1935, London, King’s College, Liddell Hart Centre\nfor Military Archives, Liddell Hart papers, file 11\/1935 part 1\/69.\n68 See the speech by General Smuts reported in the Times, 13 Nov. 1934, p. 15, col. F, and Lord\nLothian, ‘The crisis in the Pacific’, International Affairs, 14 (Mar.–Apr. 1935), pp. 170–1.\n69 Casey (London) to Bruce, 15 Apr. 1926, in W. J. Hudson and Jane North, eds., My dear P.M.:\nR. G. Casey’s letters to S. M. Bruce, 1924–1929 (Canberra, 1980), p. 175.\n70 Lampson (Peking) minute, 14 Apr. 1927, NA FO228\/3405.\n71 CP77(34) ‘Situation in the Far East, 1933–1934’, Simon note, 15 Mar. 1934, NA CAB24\/248.\nT H E GHO S T O F TH E A L L I A N C E 827\nobtain facilities that would otherwise be denied her; but when we in our turn ask for her to\ncarry out the spirit of the Entente and render us assistance it will not be forthcoming.72\nThis was a telling dismissal, for it not only refuted the drift towards nostalgia, but\nalso pointed to the potential dangers inherent in a sentimental reading of the past.\nIt is also notable that the first serious attempts to write the history of recent\nevents in east Asia paid little heed to the argument espoused by the right. In 1937\nG. F. Hudson noted in his book, The Far East in world politics, that the alliance had\nlost its raison d’eˆtre with the defeat of Germany and had thus been ‘practically\ninoperative since 1918’.73 Its termination in 1921 was therefore only a simple\nrecognition of the reality of the situation. Moreover, he observed that the prob-\nlem that beset the Washington treaties was not that they had been flawed from\nthe outset, but rather that they had been overtaken by events, namely the rise\nof nationalist China.74 G. E. Hubbard, the expert on east Asian affairs at\nChatham House, took a similar view, observing in his study of contemporary\nBritish policy that the decision to terminate the alliance came about largely\nbecause of the ‘disastrous possibility ’ that Japan might lead Britain into war with\nthe United States.75 The belief that the continuation of the alliance might have\naverted later Japanese aggression was only referred to, rather derisively, in a short\nfootnote.76\nV\nThe battle over the death of the alliance was thus neatly poised in the inter-war\nperiod, and it was a competition defined first and foremost by ideological pref-\nerences. But how did the contested view that the alliance’s death was a disaster\nbecome received wisdom in the post-war period? The answer lies partly in its\noccasional appearance in the memoirs and retrospectives that appeared during\nand after the Second World War. These books, which were written with the\nbenefit of hindsight and for the aggrandizement of their authors’ reputations,\ncriticized many of the decisions made in the inter-war period, and tended to do\nso from a realpolitik rather than an internationalist perspective. Most of them\nfocused entirely on European events, but a few also dealt with the origins of the\nwar in the Pacific. In this field the Washington conference was a ripe target, for\nself-evidently it had not fulfilled its promise to bring peace and stability to east\nAsia. If the decisions at Washington had been misguided, it naturally followed\nthat history might have taken a different path if the alliance had been maintained.\nThus the idea that Britain had paid a heavy price for foolishly discarding its\n72 ‘Note upon Sir Cecil Clementi’s despatch’, unattributed and undated [Feb. 1930?], NA\nWO106\/130. 73 G. F. Hudson, The Far East in world politics (London, 1937), p. 202. 74 Ibid.\n75 G. E. Hubbard, British Far Eastern policy (New York, 1943 edn), p. 33. See also Stephen King-Hall,\nOur own times, 1913–1938: a political and economic survey (London, 1938), p. 226; E. H. Carr, Britain : a study\nof foreign policy from the Versailles treaty to the outbreak of war (London, 1939), p. 58; G. M. Gathorne-Hardy,\nA short history of international affairs, 1920–1939 (London, 1950 edn), pp. 63–5; and Spinks, ‘The termin-\nation of the Anglo-Japanese alliance’, pp. 321–40. 76 Hubbard, British Far Eastern policy, p. 33.\n828 A N TON Y B E S T\nformerly loyal ally was repeated for a new generation. The most notable author to\ninclude this argument was that great generator of historical myths, Winston\nChurchill. In The gathering storm he observed portentously that ‘The annulment\ncaused a profound impression in Japan, and was viewed as the spurning of an\nAsiatic Power by the Western world. Many links were sundered which might\nafterwards have proved of decisive value to peace. ’77 Typically, Churchill\nneglected to mention in this account that he had been one of the alliance’s\nopponents in 1921.78 This interpretation of events was also present in the memoirs\nof the former first sea lord, Lord Chatfield, and those of three figures who had\nserved during their careers at the Tokyo embassy, Sir Robert Craigie, Sir\nThomas Hohler, and Major-General F. S. G. Piggott, and was also hinted at in\nthe memoirs of Lord Vansittart, the permanent under-secretary at the Foreign\nOffice for most of the 1930s.79 The ‘ghost ’ thus continued to exert its grip, and the\nfact that many in the inter-war period had viewed Japan’s record in the Great\nWar with disquiet and had not regretted the end of the alliance was largely\nforgotten except by a few specialists.\nEven more significant was that the original explicitly conservative ideological\nedge to the pro-alliance argument found new adherents in the ‘declinist ’ school of\nBritish historians that emerged in the 1960s and 1970s. The most detailed criti-\ncism of the termination of the alliance appeared in Correlli Barnett’s The collapse of\nBritish power, which was published in 1972. Drawing on the newly released minutes\nof the Imperial Conference of 1921, Barnett noted the grave choice facing Britain\nin 1921, including the difficulties posed by the naval issue, but argued that in the\nend facile pro-American sentiment led Britain to make the wrong decision. In\nmaking his case, he relied heavily on the arguments made at the conference by\nBilly Hughes, whose hard-headed realism he contrasted with the naivety of\nMeighen. He portrayed the decision to allow the treaty with Japan to lapse as a\nbetrayal of Britain’s traditional balance-of-power thinking, which should have\ntaught Lloyd George and his cabinet that they needed to renew the alliance in\norder to contain the United States.80 This clearly echoed the anti-‘Atlanticist ’\nviews of the National Review and the ‘die-hards ’. Indeed, with Barnett’s reference\nto Britain’s ‘grovelling ardour ’ for America, and his characterization of the\nWashington conference as ‘one of the major catastrophes of British history ’, it\nread almost as if Leo Maxse were still with us.81 Barnett was also similar to Maxse\nin that he relied on the ‘ghost ’ of the alliance. He affirmed that Japanese\n77 Winston S. Churchill, The gathering storm (London, 1985 edn), p. 13. For Churchill’s memoirs, see\nDavid Reynolds, In command of history : Churchill fighting and writing the Second World War (London, 2004).\n78 See Churchill memorandum, 4 July 1921, in Martin Gilbert, ed., Winston S. Churchill, III,\nCompanion, part III (London, 1977), p. 1450.\n79 Lord Chatfield, The navy and defence : the autobiography of Admiral of the Fleet, Lord Chatfield, II : It might\nhappen again (London, 1947), p. 88; R. L. Craigie, Behind the Japanese mask (London, 1946), pp. 12–13;\nSir Thomas Hohler, Diplomatic petrel (London, 1942), pp. 71–2; F. S. G. Piggott, Broken thread\n(Aldershot, 1950) passim; and Lord Vansittart, The mist procession (London, 1958), p. 281.\n80 Barnett, The collapse of British power, pp. 250–75. 81 Ibid., pp. 262, 272.\nT H E GHO S T O F TH E A L L I A N C E 829\nassistance had been vital to the British war effort between 1914 and 1918, but\ndid not mention that many, both in the Foreign Office and the Royal Navy, did\nnot believe this to be true. He contended that ‘ the Japanese had always been\nscrupulously loyal ’, but made no mention of the ‘ twenty-one demands ’ or\nJapanese links to Asian revolutionaries.82 The fact that British and Japanese\nattitudes towards the ‘open door ’ in China differed so markedly was referred to\nin passing, but there was no recognition that this fundamental disagreement\nmeant that any future alliance would have been built on the most unsound of\nfoundations.\nBarnett and the other ‘declinist ’ writers were able to make an impact, because\ntheir accounts of the end of the alliance were framed within wide-ranging books\nthat also covered the area of greatest interest to historians, namely the appease-\nment of Germany. Their polemical writings thus reached a larger audience than\nthe more detailed analyses provided by those who specialized in the region. As a\nresult it was the former’s view that came to be adopted, often without its overtly\npolitical connotations, as a historical cliche´ that was regularly aired whenever the\nalliance came up for discussion.\nV I\nThe ‘ghost ’ has thus survived intact until the present day and continues to hinder\nunderstanding of both the nature of the alliance itself and the decisions made at\nthe Washington conference. But by looking carefully at the myth and studying its\nassumptions, it is possible to strip away the sentiment and nostalgia that has\nencumbered our vision. The first part in this process is to realize that the myth\npresupposes that the alliance was something it never really was, close and har-\nmonious. It needs to be understood that this interpretation has its roots not in\nsolid fact but in the fantasyland of Leo Maxse and the ‘die-hards ’, who deliber-\nately created a positive image of the alliance as part of their struggle to resist the\nrise of ‘new diplomacy’ and all of its works. In reality the situation was that even\nbefore 1921 British and Japanese interests in east Asia seriously diverged. Thus the\nend of the alliance did not cause Anglo-Japanese alienation but in fact can be seen\nas symptomatic of the steady erosion of the ties between the two countries. Any\nrenewal of the alliance would most likely have been a fruitless attempt to stop the\nhaemorrhaging. It is also essential to recognize that the problems that eventually\ncompromised the security arrangements agreed at Washington would have pro-\nvided a severe test for any agreement. For example, can it really be argued that\nthe alliance would have better weathered the storms created by the rise of\nChinese nationalism and the arrival of the depression? In addition, it is vital to\nunderstand that in 1921 Britain had little choice but to opt for co-operation with\nthe United States, for only that option provided a realistic chance of settling the\nmany strategic and economic problems that beset the fragile post-Paris order ;\n82 Ibid., p. 251.\n830 A N TON Y B E S T\nthe alliance with Japan provided no practical alternative. This gamble may not\nalways have paid off, but surely America’s intermittent friendship was preferable\nto its permanent hostility.\nWhile the National Review’s interpretation of the alliance may be an obstacle to\nunderstanding the events of 1921, it is though significant on its terms, for this\npolitically charged argument necessarily sheds light on the time in which it was\nmade. The debate over the alliance’s termination illuminates the fact that, while\nhistorians of the vagaries of British foreign policy in the inter-war period have\npaid much attention to matters of strategy and resources, domestic public opinion\nand ideological arguments should not be ignored. What is apparent from the\nbattle over the alliance’s reputation is that after the Great War there was at heart\na profound ambivalence in British society about how to approach international\npolitics. Britain was precariously caught between the certainties of the ‘old dip-\nlomacy’, as symbolized by the alliance, and the promise of the ‘new’, which was\nencapsulated by the League. In the conflict over which way to turn recent history\nbecame one of the battlefields and in that process myths were created that linger\nto this very day. The failure to cohere ideologically in favour of one approach to\nforeign policy was thus arguably for Britain as much a problem as its indecision\nover its strategic priorities.\nThus, as Beatrice Heuser and Cyril Buffet have shown in their recent edited\ncollection on myths in international relations, politically charged interpretations\nof the past create both challenges and opportunities.83 Myths create obstacles to\nresearch because they obscure historical events with a web of rhetoric. In some\ncases, as with the alliance, the initial impulses behind a particular interpretation\nof history can be forgotten, thus allowing what was once a controversial opinion\nto become widely accepted and repeated. This can only be overcome by first\nacknowledging that the myth exists and then by engaging in an excavation to\nallow the original judgements of decision-makers and the informed public to\nemerge untarnished. At the same time, however, the very process of dis-\nentanglement provides an opportunity to study the period in which the myth was\nformed and to come to a clearer understanding of its intellectual and ideological\nroots. In the case of the Anglo-Japanese alliance, its alluring ghost, summoned up\nby the National Review and its ilk, provides a fascinating insight into the inter-war\nyears ; yet for the sake of understanding the events of 1921 its exorcism is long\noverdue.\n83 Heuser and Buffet, eds., Haunted by history, pp. 259–74.\nT H E GHO S T O F TH E A L L I A N C E 831\n"}