{"doi":"10.1017\/S0305000905007014","coreId":"70780","oai":"oai:eprints.lancs.ac.uk:10620","identifiers":["oai:eprints.lancs.ac.uk:10620","10.1017\/S0305000905007014"],"title":"Age- and ability-related differences in young readers’ use of conjunctions.","authors":["Cain, Kate","Patson, Nikole","Andrews, Leanne"],"enrichments":{"references":[{"id":16386448,"title":"A naturalistic study of the production of causal connectives by children.","authors":[],"date":"1985","doi":"10.1017\/s0305000900006280","raw":"McCabe, A. & Peterson, C. (1985). A naturalistic study of the production of causal connectives by children. Journal of Child Language 12, 145–59.","cites":null},{"id":16386436,"title":"British ability scales, handbook and technical manual.","authors":[],"date":"1983","doi":null,"raw":"Elliot, C. (1983). British ability scales, handbook and technical manual. Windsor, England: NFER-Nelson.","cites":null},{"id":16386435,"title":"British picture vocabulary scale – second edition.","authors":[],"date":"1997","doi":null,"raw":"Dunn, L. M., Dunn, L. M., Whetton, C. & Burley, J. (1997). British picture vocabulary scale – second edition. Windsor, England: NFER-Nelson.","cites":null},{"id":16386478,"title":"Children’s problems in text comprehension: an experimental investigation.","authors":[],"date":"1991","doi":"10.2307\/3121399","raw":"Yuill, N. & Oakhill, J. (1991). Children’s problems in text comprehension: an experimental investigation. Cambridge: CUP. CAIN ET AL.","cites":null},{"id":16386467,"title":"Coherence and cohesion in children’s stories. In","authors":[],"date":"1991","doi":"10.1037\/\/0012-1649.27.6.960","raw":"Shapiro, L. R. & Hudson, J. A. (1991). Coherence and cohesion in children’s stories. In J. Costermans & M. Fayol (eds), Processing interclausal relationships: studies in the production and comprehension of text. Mahwah, NJ: Erlbaum.","cites":null},{"id":16386437,"title":"Coherence cues mapping during comprehension. In","authors":[],"date":"1997","doi":null,"raw":"Gernsbacher, M. A. (1997). Coherence cues mapping during comprehension. In J. Costermans & M. Fayol (eds), Processing interclausal relationships: studies in the production and comprehension of text. Mahwah, NJ: Erlbaum.","cites":null},{"id":16386441,"title":"Cohesion in English.","authors":[],"date":"1976","doi":"10.2307\/412795","raw":"Halliday, M. A. K. & Hasan, R. (1976). Cohesion in English. London: Longmans.","cites":null},{"id":16386419,"title":"Complex sentences: acquisition of syntactic connectives and the semantic relations they encode.","authors":[],"date":"1980","doi":"10.1017\/s0305000900002610","raw":"Bloom, L., Lahey, M., Hood, L., Lifter, K. & Fiess, K. (1980). Complex sentences: acquisition of syntactic connectives and the semantic relations they encode. Journal of Child Language 7, 235–61.","cites":null},{"id":16386425,"title":"Conjunctions and the recall of composite sentences.","authors":[],"date":"1988","doi":"10.1016\/0749-596x(88)90057-5","raw":"Caron, J., Micko, H. C. & Thu ¨ring, M. (1988). Conjunctions and the recall of composite sentences. Journal of Memory and Language 27, 309–23.","cites":null},{"id":16386446,"title":"Conjunctions: developmental issues.","authors":[],"date":"1991","doi":"10.1075\/pbns.17.12kai","raw":"Kail, M. & Weissenborn, J. (1991). Conjunctions: developmental issues. In G. Pie ´rautle-Bonniec & M. Dolitsky (eds), Language bases _ discourse bases: some aspects of contemporary French-language psycholinguistics research. Amsterdam: Benjamins.","cites":null},{"id":16386454,"title":"Connectives and narrative text: the role of continuity.","authors":[],"date":"1997","doi":"10.3758\/bf03201114","raw":"Murray, J. D. (1997). Connectives and narrative text: the role of continuity. Memory and Cognition 25, 227–36.","cites":null},{"id":16386443,"title":"Eﬀects of explicitness, clause order, and reversibility on children’s comprehension of causal relationships.","authors":[],"date":"1984","doi":"10.1037\/\/0022-0663.76.3.399","raw":"Irwin, J. W. & Pulver, C. J. (1984). Eﬀects of explicitness, clause order, and reversibility on children’s comprehension of causal relationships. Journal of Educational Psychology 76, 399–407.","cites":null},{"id":16386421,"title":"Readers’ awareness of cohesive relationships during cloze comprehension.","authors":[],"date":"1982","doi":"10.1080\/10862968209547457","raw":"Bridge, C. A. & Winograd, P. N. (1982). Readers’ awareness of cohesive relationships during cloze comprehension. Journal of Reading Behavior 14, 299–312.","cites":null},{"id":16386439,"title":"Readers’ expectations on text comprehension.","authors":[],"date":"1982","doi":"10.1016\/s0166-4115(09)60055-8","raw":"Haberlandt, K. (1982). Readers’ expectations on text comprehension. In J. F. Le Ny & W. Kintsch (eds), Language and comprehension. Amsterdam: North Holland.","cites":null},{"id":16386475,"title":"Reading comprehension diﬃculties in children: the role of language comprehension and working memory skills. Reading and Writing.","authors":[],"date":"1992","doi":"10.1007\/bf01027150","raw":"Stothard, S. E. & Hulme, C. (1992). Reading comprehension diﬃculties in children: the role of language comprehension and working memory skills. Reading and Writing. An Interdisciplinary Journal 4, 245–56.","cites":null},{"id":16386458,"title":"Semantic and pragmatic uses of ‘but’.","authors":[],"date":"1986","doi":"10.1017\/s0305000900006905","raw":"Peterson, C. (1986). Semantic and pragmatic uses of ‘but’. Journal of Child Language 13, 583–90.","cites":null},{"id":16386417,"title":"Test for the reception of grammar.","authors":[],"date":"1982","doi":null,"raw":"Bishop, D. (1982). Test for the reception of grammar. Manchester, England: Chapel Press.","cites":null},{"id":16386423,"title":"Text comprehension and its relation to coherence and cohesion in children’s ﬁctional narratives.","authors":[],"date":"2003","doi":"10.1348\/026151003322277739","raw":"Cain, K. (2003). Text comprehension and its relation to coherence and cohesion in children’s ﬁctional narratives. British Journal of Developmental Psychology 21, 335–51.","cites":null},{"id":16386471,"title":"The acquisition of temporal terms.","authors":[],"date":"1987","doi":"10.1017\/s0305000900010278","raw":"Stevenson, R. J. & Pollitt, C. (1987). The acquisition of temporal terms. Journal of Child Language 14, 533–45.","cites":null},{"id":16386460,"title":"The connective ‘and’: do older children use it less as they learn other connectives?","authors":[],"date":"1987","doi":"10.1017\/s0305000900012988","raw":"Peterson, C. & McCabe, A. (1987). The connective ‘and’: do older children use it less as they learn other connectives? Journal of Child Language 14, 375–81.","cites":null},{"id":16386450,"title":"The development of the cohesive use of adversative conjunctions in discourse.","authors":[],"date":"1983","doi":"10.1080\/01638538309544575","raw":"McClure, E. & Geva, E. (1983). The development of the cohesive use of adversative conjunctions in discourse. Discourse Processes 6, 411–32.","cites":null},{"id":16386444,"title":"The meaning of before and after for preschool children.","authors":[],"date":"1975","doi":"10.1016\/0022-0965(75)90151-4","raw":"Johnson, H. L. (1975). The meaning of before and after for preschool children. Journal of Experimental Child Psychology 19, 88–99.","cites":null},{"id":16386456,"title":"The Neale analysis of reading ability – Revised (NARA-II).","authors":[],"date":"1997","doi":"10.1111\/j.2044-8279.1986.tb03047.x","raw":"Neale, M. D. (1997). The Neale analysis of reading ability – Revised (NARA-II). Windsor UK: NFER-Nelson.","cites":null},{"id":16386452,"title":"The on-line processing of inter-event relationships in narratives. C.P.C.\/Current psychology of cognition 14,","authors":[],"date":"1995","doi":null,"raw":"Mouchon, S., Fayol, M. & Gaonac’h, D. (1995). The on-line processing of inter-event relationships in narratives. C.P.C.\/Current psychology of cognition 14, 171–93.","cites":null},{"id":16386463,"title":"The role of interclausal connectives in narrative structuring: evidence from adults’ interpretation of simple stories.","authors":[],"date":"1991","doi":"10.1080\/01638539109544773","raw":"Segal, E., Duchan, J. & Scott, P. (1991). The role of interclausal connectives in narrative structuring: evidence from adults’ interpretation of simple stories. Discourse Processes 14, 27–54.","cites":null},{"id":16386438,"title":"Use of conjunctions in expository texts by skilled and less skilled readers.","authors":[],"date":"1985","doi":"10.1080\/10862968509547549","raw":"Geva, E. & Ryan, E. B. (1985). Use of conjunctions in expository texts by skilled and less skilled readers. Journal of Reading Behaviour 17, 331–46.","cites":null},{"id":16386415,"title":"Why ﬁve-year-olds cannot understand before and after.","authors":[],"date":"1972","doi":"10.1016\/s0022-5371(72)80022-7","raw":"Amidon, A. & Carey, P. (1972). Why ﬁve-year-olds cannot understand before and after. Journal of Verbal Learning and Verbal Behavior 11, 417–23.","cites":null},{"id":16386427,"title":"Working memory and comprehension of spoken sentences: investigations of children with reading disorder. In","authors":[],"date":"1990","doi":"10.1017\/cbo9780511665547.023","raw":"YOUNG READERS’ USE OF CONJUNCTIONS 891Crain, S., Shankweiler, D., Macaruso, P. & Bar-Shalom, E. (1990). Working memory and comprehension of spoken sentences: investigations of children with reading disorder. In V. Giuseppe & T. Shallice (eds), Neuropsychological impairments of short-term memory. New York, NY : Cambridge University Press.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-11","abstract":"Two studies investigating young readers’ use of conjunctions are reported. In Study One, 145 eight- to ten-year-olds completed one of two narrative cloze tasks in which different types of conjunction were deleted. Performance for additive conjunctions was not affected by age in this study, but older children were more likely to select the target conjunction than were younger children for temporal, causal, and adversative terms. Performance was superior in the cloze task in which they were given a restricted choice of responses (three vs. seven). In Study Two, 35 eight- and nine-year-old good and poor comprehenders completed the three-choice cloze task. The poor comprehenders were less likely to select the target terms in general. Sentence-level comprehension skills did not account for their poor performance. The results indicate that understanding of the semantic relations expressed by conjunctions is still developing long after these terms are used correctly in children’s speech. The findings are discussed in relation to the role of conjunctions in text comprehension","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70780.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/10620\/1\/1.pdf","pdfHashValue":"741ee239d808abc5f20caeb38ab9ce12e0a9141d","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:10620<\/identifier><datestamp>\n      2018-01-24T00:02:18Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D42:4246<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Age- and ability-related differences in young readers’ use of conjunctions.<\/dc:title><dc:creator>\n        Cain, Kate<\/dc:creator><dc:creator>\n        Patson, Nikole<\/dc:creator><dc:creator>\n        Andrews, Leanne<\/dc:creator><dc:subject>\n        BF Psychology<\/dc:subject><dc:description>\n        Two studies investigating young readers’ use of conjunctions are reported. In Study One, 145 eight- to ten-year-olds completed one of two narrative cloze tasks in which different types of conjunction were deleted. Performance for additive conjunctions was not affected by age in this study, but older children were more likely to select the target conjunction than were younger children for temporal, causal, and adversative terms. Performance was superior in the cloze task in which they were given a restricted choice of responses (three vs. seven). In Study Two, 35 eight- and nine-year-old good and poor comprehenders completed the three-choice cloze task. The poor comprehenders were less likely to select the target terms in general. Sentence-level comprehension skills did not account for their poor performance. The results indicate that understanding of the semantic relations expressed by conjunctions is still developing long after these terms are used correctly in children’s speech. The findings are discussed in relation to the role of conjunctions in text comprehension.<\/dc:description><dc:date>\n        2005-11<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0305000905007014<\/dc:relation><dc:identifier>\n        Cain, Kate and Patson, Nikole and Andrews, Leanne (2005) Age- and ability-related differences in young readers’ use of conjunctions. Journal of Child Language, 32 (4). pp. 877-892. ISSN 0305-0009<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/10620\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0305000905007014","http:\/\/eprints.lancs.ac.uk\/10620\/"],"year":2005,"topics":["BF Psychology"],"subject":["Journal Article","PeerReviewed"],"fullText":"Age- and ability-related differences in young\nreaders’ use of conjunctions*\nKATE CAIN\nUniversity of Essex\nNIKOLE PATSON\nUniversity of Michigan\nAND\nLEANNE ANDREWS\nUniversity of Essex\n(Received 1 September 2004. Revised 27 January 2005)\nABSTRACT\nTwo studies investigating young readers’ use of conjunctions are\nreported. In Study One, 145 eight- to ten-year-olds completed one of\ntwo narrative cloze tasks in which different types of conjunction were\ndeleted. Performance for additive conjunctions was not affected by age\nin this study, but older children were more likely to select the target\nconjunction than were younger children for temporal, causal, and\nadversative terms. Performance was superior in the cloze task in which\nthey were given a restricted choice of responses (three vs. seven). In\nStudy Two, 35 eight- and nine-year-old good and poor comprehenders\ncompleted the three-choice cloze task. The poor comprehenders were\nless likely to select the target terms in general. Sentence-level compre-\nhension skills did not account for their poor performance. The results\nindicate that understanding of the semantic relations expressed by\nconjunctions is still developing long after these terms are used correctly\n[*] Study One was supported by British Academy grant no. SG-34207 awarded to the first\nauthor. Study Two was supported by a University of Michigan-Flint Honors Scholar\nProgram Study Abroad Grant, a UM-F Office of Research Undergraduate Research\nGrant, and a UM-F Office of Development Grant awarded to the second author. We\nwould like to record our thanks to the staff and pupils at the following schools in Essex\nfor their co-operation : John Bunyan Junior, John Ray Junior, Millfield Primary, North\nPrimary, to Simon Bignell and Sharon O’Donnell for acting as blind scorers for the\nerror analysis, and to two anonymous reviewers for their helpful comments. Address for\ncorrespondence: Kate Cain, Department of Psychology, University of Essex, Wivenhoe\nPark, Colchester, CO4 3SQ, UK. tel :+44 1206 873533; fax :+44 1206 873598; e-mail :\nkcain@essex.ac.uk\nJ. Child Lang. 32 (2005), 877–892. f 2005 Cambridge University Press\ndoi:10.1017\/S0305000905007014 Printed in the United Kingdom\n877\nin children’s speech. The findings are discussed in relation to the role\nof conjunctions in text comprehension.\nINTRODUCTION\nConjunctions are cohesive devices that indicate the semantic relations\nbetween different propositions and sentences (Halliday & Hasan, 1976). For\nexample, a dependent or causal relation is indicated by the conjunction so :\n‘Sue was late, so she took the bus’. Other types of conjunction may simply\nsignal continuity of two events that are not dependent on one another, e.g.\n‘Sue was going to a party and she was taking the bus’ or the temporal order\nof events, e.g. ‘Sue left the barbecue after it started to rain’. Adult readers\nuse these cues to aid integration of clauses to guide their interpretation of a\ntext’s meaning (Segal, Duchan & Scott, 1991; Gernsbacher, 1997; Murray,\n1997). In this way, conjunctions may help to reduce processing load and be\na useful aid to comprehension.\nChildren use a range of conjunctions that signal different semantic\nrelations in their everyday speech by about 5;0 (Kail & Weisssenborn,\n1991). The sequence of acquisition is fairly stable across languages:\nadditive conjunctions such as and are usually acquired first, followed by\nterms that specifically express temporal, causal or adversative relations,\ne.g. before, because, but (e.g. Bloom, Lahey, Hood, Lifter & Fiess, 1980).\nIn contrast to most other conjunctions, the meaning expressed by and is\nflexible and the term can be used to encode a temporal, causal and\/or\nadversative link between two clauses, as well as an additive one. Nine-\nyear-olds are as likely as three-year-olds to use and in this flexible way\n(Peterson & McCabe, 1987). There are significant improvements between\n3;0–9;0 in the appropriate use of adversative conjunctions, which signal\ncontrast, such as but (Peterson, 1986), but appropriate use of causal con-\njunctions, e.g. because and so, is evident by 5;0 (McCabe & Peterson,\n1985).\nAge-related differences in the comprehension of conjunctions are\napparent after these terms appear (and are used correctly) in children’s\nnatural utterances. In assessments of spoken language comprehension,\n6-year-olds reveal less than perfect understanding of temporal terms such\nas before and after, particularly when the order of mention and order of\noccurrence conflict (Amidon & Carey, 1972; Johnson, 1975, Stevenson &\nPollitt, 1987). In written tests, third-graders are less likely than eighth-\ngraders to encode the causal relation expressed by because (Irwin & Pulver,\n1984) and children’s (grades 4–8) interpretation of the adversative terms\nbut and although differs from that of adults (McClure & Geva, 1983). To\ndate, there have been no systematic comparisons of different age groups’\nunderstanding of conjunctions that specify this range of different relations.\nCAIN ET AL.\n878\nThus, we do not know the extent and nature of any developmental\ndifferences in the comprehension of different types of conjunction.\nConjunctions mark the semantic relations between different propositions\nin a discourse, so it is perhaps not surprising that individual differences in\nreading ability are related to their use and comprehension. Poorer readers\nare less likely to select the appropriate conjunctions in cloze tasks (Bridge &\nWinograd, 1982; Geva & Ryan, 1985) and are less able to answer questions\nthat tap their understanding of causal relations expressed by because\n(Irwin & Pulver, 1984). Poor readers also experience problems in the\ncomprehension of clauses linked by temporal conjunctions, such as before\nand after, particularly when the memory demands are high (Crain,\nShankweiler, Macaruso & Bar-Shalom, 1990). However, our interpretation\nof these findings is limited because the measures of reading ability used in\nthis research confound word-reading skill with text comprehension and\nassessment of grammatical knowledge was not reported. Thus it is not clear\nwhether the poor readers’ impaired performance on these tasks was due\nto a specific problem with their understanding of interclausal relations or\ndifficulties in reading the texts per se.\nWe report two studies investigating age- and ability-related differences\nin young children’s knowledge and use of conjunctions in written texts. In\nboth studies we investigated children’s ability to choose the appropriate\nconjunction in two cloze tasks. The conjunctions comprised the range\nof relations studied in previous work: additive, temporal, causal, and ad-\nversative. The age range (8;0–10;0) was chosen to cover the range included\nin much of the previous research. It also corresponded to the period when\nchildren are introduced to the function and range of conjunctions in written\ncontexts within the National Literacy Strategy Framework for Teaching\nused throughout schools in England.\nSTUDY 1\nThe specific research question addressed was: are age-related differences\napparent in children’s selection of different types of conjunction in a written\ntask? We compared the ability of three age-groups: 7;0–8;0, 8;0–9;0, and\n9;0–10;0, to select the appropriate conjunction in a cloze task. On the basis\nof previous research we predicted no age-differences in the appropriate\nuse of and, but developmental improvements in the use of adversative\nterms were expected (Peterson, 1986; Peterson & McCabe, 1987).\nWe also predicted age-related improvements in the correct selection\nof causal and temporal terms. Although production tasks indicate early\ncompetency in the appropriate use of causal conjunctions (McCabe &\nPeterson, 1985) written language tasks reveal age-related differences (Irwin\n& Pulver, 1984). Similarly, comprehension of temporal conjunctions is still\nYOUNG READERS’ USE OF CONJUNCTIONS\n879\ndeveloping after 5;0 (Amidon & Carey, 1972; Johnson, 1975, Stevenson\n& Pollitt, 1987). Analysis of errors was conducted to identify whether\nincorrect selection followed systematic preferences or random choice by\nthe different age groups.\nParticipants\nThree different age groups participated in this study. There were 43 eight-\nyear-olds (M=8;5, 21 boys, 22 girls), 51 nine-year-olds (M=9;5, 29 boys,\n22 girls), and 51 ten-year-olds (M=10;4, 23 boys, 28 girls).\nMaterials\nTwo narratives were constructed for this task: one narrative was about\ngiraffes and how they acquired their spots and the other was about a starfish\nwho thought he was a star that had fallen out of the sky. The giraffe story\nwas 779 words in length with a Flesch-Kincaid reading grade of 4.5 and\nFlesch reading ease value of 86.9%. The starfish story was slightly longer,\n836 words, with a Flesh-Kincaid grade level=3.9 and Flesch reading ease\nof 88.4%.\nThe narratives presented to children each contained six deleted instances\nof and and three deleted instances each of six other conjunctions: then,\nwhen, and before expressed temporal relations, because and so, expressed\ncausal relations, and but expressed an adversative relation. These items were\nselected after pilot work with adults from stories containing ten deleted\ninstances of and and four instances of each other conjunction. Items for\nwhich at least ten out of twelve adults selected the target response (from the\nchoice of seven: and, then, when, before, because, so, but) were chosen and\nit was ensured that the conjunction types were distributed throughout the\ntext with no more than three items appearing in a single paragraph.\nTwo cloze versions of each story were constructed for use with children.\nIn one cloze version, the target word was replaced with a blank and the\nseven conjunctions that could be inserted were printed at the bottom of\nthe page. In the other version, three choices were provided for each of the\ntarget conjunctions: the target response and two others from the pool of\nconjunctions used in this study. In each story, the target response occurred\nin the first, second, and third position twice for and and once in each\nposition for the six other conjunctions. When used as a distractor, and\nappeared six times (once each for the different conjunctions) and all other\nconjunctions appeared seven times (twice when and was the target, and once\nfor the five other conjunctions). There were two sets of materials : set one\ncomprised the Giraffe story in the choices condition and the Starfish story\nin the blanks version, and set two comprised the Giraffe story in the blanks\ncondition and the Starfish story in the choices condition.\nCAIN ET AL.\n880\nWe predicted main effects of age and conjunction, as stated earlier,\nqualified by an interaction between these two factors. Previous work out-\nlined in the introduction reports comparable use of the additive conjunction\nand within this age range, but developmental improvements in the\ncomprehension and use of other types of conjunction. We also predicted a\nmain effect of task: specifically, poorer performance on the blanks task. The\nblanks version of the cloze task provided a greater range of response options\n(seven) from which to choose than did the choices task (three options). If\nchildren experience difficulties in their use and comprehension of particular\nconjunctions, they should perform more poorly when they have a greater\nnumber of options to choose from and their chance of selecting the correct\nresponse is out of seven rather than three options. The blanks task was\nincluded in this study to allow examination of the errors that children made,\nacross the full range of conjunctions under consideration.\nRESULTS\nInitial inspection of these data indicated that the children found some\nitems particularly hard. Two additional groups of adults (undergraduate\nstudents, N=15 for both) completed the blanks task and the choices task\nfor both stories. These adults’ responses corresponded largely with those\nproduced in the pilot work, with at least 13 adults choosing the target\nconjunction for the following conjunctions: when, before, because and but.\nThere was one instance of so in the starfish story for which five and four\nadults gave a non-target response in the choices and blanks versions,\nrespectively, and one instance of and for which four adults produced a\nnon-target response. These items were excluded from the analysis of the\nchildren’s scores because we were interested in their performance for items\nwhich skilled adult readers found unambiguous. In addition, responses to\n‘then’ were excluded from the analysis because adults found several of these\nitems ambiguous.1\nThe mean proportion of target responses was calculated for the additive\n(and), temporal (when, before), causal (so, because) and adversative (but)\nconjunctions for each story. These data were analysed in a mixed-design\nAnalysis of Variance with the following factors: age group (8;0, 9;0, 10;0)\nand set (A: blanks-giraffe, choices-starfish; B: blanks-starfish, choices-\ngiraffe) varied between-subjects, conjunction type (additive, temporal,\n[1] It proved difficult to construct texts with unambiguous instances of ‘then’ that occurred\nbetween clauses, e.g. ‘Jenny waited until her mother was distracted one afternoon then the\nlittle giraffe ran out into the field to play with her brothers.’ rather than between the\nsubject and verb, e.g. ‘After the old giraffe had watched everyone playing in the sun for a\nfew minutes he then went to find Jenny’s father.’\nYOUNG READERS’ USE OF CONJUNCTIONS\n881\ncausal, adversative) and task (choices, blanks) varied within-subjects. The\nmean data (collapsed over set) are reported in Table 1. For brevity,\nonly significant (p<0.05) effects and interactions are reported. Partial g2 is\nreported as the measure of effect size for all significant effects.\nThe predicted main effects of age group, task, and conjunction were\nall significant. The effect of age group, F(2, 139)=5.78, p<0.01 (partial\ng2=0.074), arose because the older children provided more target responses\nthan the two younger groups (Ms in order of increasing age=64.0%, 67.6%,\n75.4%, respectively). The effect of task, F(1, 139)=232.74, p<0.001 (partial\ng2=0.626), demonstrated that scores were higher in the choices task\n(78.5%) than in the blanks task (59.5%). The effect of conjunction,\nF(3, 417)=91.81, p<0.001 (partial g2=0.398), was due to the production\nof a greater number of target responses for additive (M=82.5%) than\neither temporal (M=58.9%), causal (M=58.5%) or adversative (M=76.0%)\nconjunctions.\nThere were two interactions of theoretical interest. The first, between age\nand conjunction, F(6, 417)=2.16, p<0.05 (partial g2=0.030), is depicted in\nFigure 1. Analysis of Simple Main effects revealed no group differences for\nadditive conjunctions, F(2, 556)<1.0, but significant differences for\ntemporal, F(2, 556)=5.11, p<0.01, causal, F(2, 556)=6.16, p<0.01, and\nadversative, F(2, 556)=5.52, p<0.01, terms. There was also a highly\nsignificant interaction between task and conjunction, F(3, 417)=24.24,\np<0.001 (partial g2=0.149). Analysis of Simple Main effects revealed that\nthe difference in performance for additive conjunctions on the choices and\nblanks tasks did not reach conventional levels of significance (F(1, 556)=\n3.61, p=0.058, Ms=84.7% and 80.7%). Significant advantages for\nperformance in the choices relative to the blanks task were apparent for\nthe three other types of conjunction: temporal, (F(1, 556)=127.92,\np<0.001,Ms=71.7% and 46.8%); causal, F(1, 556)=49.99, p<0.001,Ms=\n72.2% and 45.3%); adversative, F(1, 556)=74.83, p<0.001, Ms=86.0%\nand 67.0%).\nTABLE 1. Study One: mean proportionate scores (and standard deviations)\nby age, group, task and conjunction type\nadditive temporal causal adversative\nYear three blanks 0.792 (0.24) 0.388 (0.27) 0.384 (0.30) 0.589 (0.35)\nchoices 0.830 (0.22) 0.682 (0.24) 0.680 (0.23) 0.783 (0.32)\nYear four blanks 0.829 (0.21) 0.454 (0.31) 0.395 (0.29) 0.667 (0.30)\nchoices 0.826 (0.20) 0.677 (0.24) 0.706 (0.21) 0.856 (0.22)\nYear five blanks 0.793 (0.20) 0.549 (0.29) 0.569 (0.28) 0.669 (0.32)\nchoices 0.884 (0.20) 0.787 (0.22) 0.776 (0.24) 0.860 (0.25)\nCAIN ET AL.\n882\nFinally, there was an unpredicted two-way interaction between set and\nconjunction that was qualified by an unpredicted three-way interaction\nbetween these two factors and task, F(3, 417)=4.92, p<0.01 (g2=0.034).\nAnalysis of Simple Main effects revealed that the source of this interaction\nwas an advantage for the additive conjunctions in the choices task relative to\nthe blanks task for set B (choices giraffe, blanks starfish), F(1, 139)=4.23,\np<0.04 (Ms=90.0% and 82.8%). This advantage was not apparent for\nset A (choices starfish, blanks giraffe), F<1.0 (Ms=79.5% and 78.3%). For\ntemporal, causal and adversative conjunctions performance was significantly\nbetter in the choices task relative to the blanks task, regardless of set, all\nFs (1,139)>9.80, all ps<0.01.\nIncorrect responses\nIn the blanks cloze task, participants had a choice of seven conjunctions,\none of which was correct. The distribution of non-target (hereafter incorrect)\nresponses made by each group was examined by type to determine whether\nthe groups performed differently. For example, a greater number of different\nincorrect choices by younger than by older children could be interpreted as\nmore random selection by the younger group.\nFirst, we examined the data to determine whether children had simply\nresponded with and instead of the correct target conjunction for temporal,\ncausal, and adversative items. This incorrect response made up 43.2% of\nthe eight-year-olds’ errors, and 39.1% and 34.4% of the nine-year-olds’ and\nten-year-olds’ errors, for these categories respectively. Although an age\ntrend was evident, and clearly did not constitute all errors. Consequently,\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\nadditive temporal causal adversative\nyear three\nyear four\nyear five\nFig. 1. Study one : interaction between age group and conjunction (proportionate scores).\nYOUNG READERS’ USE OF CONJUNCTIONS\n883\nthe mean number of different incorrect conjunctions was calculated for\neach age group for each category (additive, temporal, causal, adversative).\nThese means do not take into account the number in each group who\nchose a particular incorrect response, simply how many different incorrect\nresponse types were made.\nAs expected, there were fewer different incorrect items chosen for the\nadditive and adversative target items, because performance was generally\nhigher for these two types of conjunction. Where an incorrect response\nwas given for and the older children selected a greater number of different\nresponses than did the younger groups (Ms by increasing age: 2.2, 2.3,\nand 2.8). For adversatives, the youngest and oldest children selected a\ncomparable number of different incorrect responses (Ms by increasing age:\n2.8, 3.5, and 2.8). Clear age trends were apparent for both temporal and\ncausal conjunctions, with a reduction in the different number of non-target\nresponses selected with increasing age (Ms, temporal : 4.3, 4.4, and 3.7;\ncausal : 4.2, 3.7, and 3.6).\nA similar examination of responses was performed for the choices cloze\ntask. Here, slight age trends in the same direction were apparent for all\ntypes of conjunction with the youngest group obtaining higher mean\nnumber of incorrect response choices (maximum=2) than the older groups.\nMeans in order of increasing age, additive=1.5, 1.0, 0.9; temporal=1.7,\n1.7, 1.4; causal=1.9, 1.6, 1.5; adversative=1.7, 1.5, 1.5. Thus is seems that\nwhere incorrect responses were selected, the younger children were more\nlikely to choose either option than were the older groups.\nSUMMARY AND DISCUSSION\nThe results indicate that eight- to ten-year-olds are poor at selecting\nthe target conjunction, particularly when they are provided with several\npossible options as in the blanks version of our cloze task. Using partial g2\nas the measure of effect size, the task variable accounted for over 60% of\nvariability in the data. The difference in performance in two tasks may\nhave arisen because there was a greater probability of selecting the correct\nresponse by chance in the choices task relative to the blanks task, because\nof the number of response options. The cognitive processing load required\nto compare the different options may also have contributed to poorer\nperformance when seven rather than three options were available.\nPerformance was dependent on conjunction type: each age group’s ability\nto choose the target additive conjunction was similar to that of the adults in\nour pilot work (79% or higher for all age groups). Contrary to expectations,\nperformance on the adversative conjunctions was also good for each age\ngroup, but children’s ability to choose the target temporal and causal\nconjunctions was poor. All groups performed above chance, but only the\nCAIN ET AL.\n884\nnine- to-ten-year-olds achieved performance levels of more than 50%\ncorrect. Thus, even though children are using temporal and causal\nconjunctions correctly in their speech by about 5;0, their comprehension\nof these terms at 10;0 is still incomplete. The effect of age only explained\nabout 7.5% of the variability in scores (partial g2) but the effect of\nconjunction type was sizeable (partial g2=0.398).\nThe unpredicted 3-way interaction between conjunction, task, and set\nindicated that the materials were not perfectly matched. However, the\nsource of the interaction arose because of the pattern of responses to the\nadditive term and, for which performance was uniformly high. In addition,\nthe effect size measure indicated that this interaction did not account for a\nsubstantial proportion of the variance (3.4%). The effects of most interest\nand importance concerning age differences and conjunction type are not\ndiminished by this unpredicted result.\nThe particularly poor performance by the youngest age group on the\ncausal conjunctions concurs with Irwin & Pulver’s (1984) finding that\nGrade 3 children’s comprehension of the terms because and so was poor.\nPerformance on the temporal terms was also poor. Previous research\nhas demonstrated that memory demands affect children’s processing of\nsentences with temporal conjunctions (e.g. Crain et al., 1990). However, in\nthis study the conjunction when, which signals a concurrent action, resulted\nin a comparable number of errors to the conjunction before.\nWe predicted superior performance for the additive conjunction and\nbecause it is acquired early. However, we must consider the fact that\nand serves a variety of pragmatic functions (Peterson & McCabe, 1987). As\nsuch, children could simply have a response bias for and, which would\nlead to superior performance for this conjunction. The examination of\nerrors in the blanks cloze task, where all seven conjunctions were available\nresponses, revealed that children did not routinely insert and for incorrect\nresponses. The high accuracy rate for and reflects better understanding of\nthis conjunction in this study. However, age effects for the use of additive\nconjunctions may occur at an earlier age not represented by this sample.\nThere was considerable variation within each age group for all types of\nconjunction in both tasks. Thus, some factor other than age appears to\nhave a considerable effect on children’s ability to choose the appropriate\nterm to express the relation between two clauses. In study two, we set out\nto explore ability-related differences in relation to use of conjunctions to\ndetermine what accounts for this range in performance.\nSTUDY 2\nOur starting point for Study Two was the body of research demonstrating a\nlink between reading ability and tasks tapping knowledge of conjunctions\nYOUNG READERS’ USE OF CONJUNCTIONS\n885\n(Bridge & Winograd, 1982; Irwin & Pulver, 1984; Geva & Ryan, 1985;\nCrain et al., 1990). A limitation of these studies is that the measures of\nreading ability used confound word reading skill with text comprehen-\nsion. If conjunctions signal the semantic relation between two clauses\nand, therefore, help to structure the mental representation of a text (e.g.\nSegal et al., 1991), we would expect children with text comprehension\nproblems to show impaired ability to select appropriate conjunctions.\nHowever, one possible strategy for completing our cloze tasks was to\nfocus on each sentence individually. Research investigating the association\nbetween text-level and sentence-level comprehension has yielded\ncontradictory findings. Some children with discourse-level comprehension\nproblems demonstrate deficits in syntactic knowledge (Stothard & Hulme,\n1992) whilst others do not (Yuill & Oakhill, 1991). Therefore it was not\nclear whether performance on our cloze task would be related to text\ncomprehension.\nAs an initial test of the hypothesis that use of conjunctions is related to\ncomprehension skill, we gave 111 seven- to nine-year-olds both stories in\nthe ‘choices’ condition and compared their performance with that obtained\non a group-administered measure of listening comprehension. Because\nof the high levels of performance by children in Year 5, we only included\nchildren in Years 3 and 4 in this study. First we replicated the main effect\nof conjunction in Study One: children were more likely to produce the\ntarget conjunction for the additive (M=0.83, S.D.=0.20) than for temporal\n(M=0.65, S.D.=0.22), causal (M=0.65, S.D.=0.21) and adversative terms\n(M=0.78, S.D.=0.26). Of interest, significant correlations with listening\ncomprehension scores were obtained for each type of conjunction: additive,\nr=0.465, temporal, r=0.430, causal r=0.336, adversative, r=0.311, all\nps<0.001. These findings indicated a relation between text comprehension\nand the ability to select the correct conjunction to link two clauses, which\nwe explored further.\nTo overcome the confound between word reading ability and text\ncomprehension noted in previous work, we examined the ability to select\nthe correct conjunctions in groups of children who differed in text com-\nprehension but who were matched for word reading ability and vocabulary\nknowledge. In this way, any group differences that arose simply through\ndifficulty in reading the cloze texts or understanding the individual words\ncould be ruled out.\nMETHOD\nMaterials and procedure\nEach participant saw the two stories in the version of the cloze task that had\nthree choices for each target item. The stories were administered in the\nCAIN ET AL.\n886\nclassroom and were presented in separate sessions, each lasting approxi-\nmately 30 minutes.\nParticipants\nTwo groups of seven- to nine-year-olds participated in this study: 17 skilled\ncomprehenders (9 girls, 8 boys) and 18 less-skilled comprehenders (10 girls,\n8 boys). Participants were recruited from three suburban schools with\nsocially-mixed catchment areas in the East of England. The majority of\nparticipants were from lower middle-class families.\nTwo tests were used to select participants: a listening comprehension\ntest and a receptive vocabulary test. The listening comprehension test was\nmodified from the Neale analysis of reading ability – revised (NARA-II :\nNeale, 1997) to make it suitable for group administration. The first three\nstories from Form 2 were read out to the children, who followed each\nstory in their own booklet. After each story they answered the prescribed\nset of questions, designed to test their memory for and understanding\nof the story. For each question they were required to choose one out of\nthree printed answers: the correct answer and two incorrect responses,\nselected from responses that children had given in previous pilot work.\nResponses were scored as either correct or incorrect and the maximum\npossible score was 20. The receptive vocabulary test was a modified\nversion of the British picture vocabulary scale – second edition (Dunn,\nDunn, Whetton & Burley, 1997). Children were presented with 34 items\nin individual booklets. The experimenter read out the word and the child\nticked the corresponding picture in their booklet. One point was awarded\nfor each correct answer. The reliability of both measures was assessed by\ncalculating Chronbach’s alpha over items. Reliability was acceptable for\nboth tests, listening comprehension a=0.65, receptive vocabulary,\na=0.75.\nWord reading was assessed using a short-form of the British ability\nscales – revised word reading test (BAS – Elliot, 1983). Children had to read\nset A, comprising 18 words. Testing stopped when five consecutive errors\nwere made. An additional assessment of sentence comprehension was\ngiven, a shortened form of the Test for reception of grammar (TROG,\nBishop, 1982) in which children were presented with two items each from\nblocks L, N, O, Q, R, S, and T, blocks which discriminate normally\ndeveloping children in this age group. The maximum possible score was\n14. This measure was included to determine whether group differences on\nthe conjunction task were associated with impoverished syntactic knowledge.\nThe BAS and TROG were administered to children individually.\nThe skilled and less-skilled comprehenders differed significantly on the\nmeasure of listening comprehension but did not differ on any of the other\nYOUNG READERS’ USE OF CONJUNCTIONS\n887\nmeasures (see Table 2 for means). All spoke British English as their first\nlanguage and had no known behavioural or learning difficulties.\nRESULTS\nThe mean proportion of target responses was calculated for the additive\n(and), temporal (when, before), causal (so, because) and adversative (but)\nconjunctions summed over the two stories. These data were analysed in a\nmixed-design Analysis of Variance with skill group (skilled, less-skilled) as\na between-subjects factor and conjunction type (additive, temporal, causal,\nadversative) as a within-subjects factor. Mean proportion correct for each\ntype of conjunction is reported in Table 2.\nThere was a significant effect of skill group, F(1, 33)=8.10, p<0.008\n(partial g2=0.197), because the skilled comprehenders produced more\ncorrect responses than the less-skilled group, and a highly significant\neffect of conjunction type F(3, 99)=14.34, p<0.001 (partial g2=0.303). The\ninteraction between the two factors was not significant, F(3, 99)<1.0.\nError analysis\nThe two non-target responses for each cloze item were chosen during the\nconstruction of the materials to ensure a balance across all items. As a result\nof this procedure some non-target responses made sense, even though they\nwere not considered to be the best choice by adults in the pilot work.\nThe first author and two other adults rated the two non-target responses\nfor each cloze sentence on a three-point scale : ‘makes sense’, ‘not sure’,\n‘does not make sense’. The sentences were presented in a randomized order\nTABLE 2. Means (and standard deviations) for skilled and less-skilled\ncomprehenders on all group matching measures and conjunction task\nSkilled\ncomprehenders\nLess-skilled\ncomprehenders t-test\nAge in months 102.11 (6.43) 102.44 (6.38) t(33)=0.151, ns\nListening comprehension 16.70 (0.98) 12.0 (1.18) t(33)=12.71, p<0.001\nBAS 15.88 (1.83) 14.89 (1.71) t(33)=1.66, p=0.11\nTROG 11.58 (1.32) 11.00 (1.64) t(33)=0.161, ns\nVocabulary 23.23 (3.66) 22.39 (3.20) t(33)=0.729, ns\nAdditive conjunction 0.874 (0.14) 0.739 (0.22)\nTemporal conjunctions 0.725 (0.15) 0.551 (0.20)\nCausal conjunctions 0.703 (0.19) 0.549 (0.16)\nAdversative conjunctions 0.828 (0.15) 0.704 (0.28)\nAge in whole months; listening comprehension (max.=20); BAS (max.=18); TROG\n(max.=14); Vocabulary (max.=34); All conjunctions expressed as mean proportion correct.\nCAIN ET AL.\n888\nin separate two booklets for each story so that the same sentences (with\ndifferent non-target conjunctions) did not appear in the same booklet.\nThere was a high level of agreement (94%) and all ratings were either\n‘makes sense’ or ‘does not make sense’. For each conjunction type, the\npercentage of errors that did not make sense was calculated for all items\nfor which more than 30% of participants in one of the groups did not select\nthe target response (to ensure a sufficient number of data points).\nThere were five instances of and that met the 30% or more error rate\ncriterion. Of these, 63% of the skilled group’s responses and 44% of the\nless-skilled group’s responses were judged not to make sense. There were\nfive instances each of when, before, because, and so where more than 30%\nof one group selected a non-target response. Collated across when and\nbefore, 43% of the skilled group’s responses and 52% of the less-skilled\ngroup’s responses to temporal terms were judged not to make sense.\nCollated over the causal terms, 26% of the skilled group’s responses and\n34% of the less-skilled group’s responses were judged not to make sense.\nOverall performance was better for adversatives than for temporal and\ncausal conjunctions and there were only 3 instances of but where more than\n30% of participants in one of the skill groups selected a non-target response.\nThe percentage of errors judged not to make sense were 17% and 37%\nfor the skilled and less-skilled group, respectively.\nSUMMARY AND DISCUSSION\nBoth groups obtained more correct responses for additive and adversative\nconnectives than for temporal and causal terms. However, the poor\ncomprehender group was generally less able to select the appropriate\nresponse. The analysis of errors suggests that, with the exception of and,\npoor comprehenders were more likely than good comprehenders to choose a\ncompletion that did not make sense in isolation. Thus, even if they were\nfollowing a local sentence processing strategy and treating each sentence\nin isolation, they were poorer at the task. The reverse pattern found for\nthe conjunction and might have arisen because so few incorrect responses\nwere made by the skilled group (27 errors out of 204 responses). Thus, any\ninterpretation of errors to and should be made with care.\nComparisons cannot be made between the different conjunction types,\nbecause for some conjunctions, most non-target choices were judged to\nmake sense by the raters when the sentence was presented in isolation. For\nexample, ‘All of the female giraffes stayed under the trees when\/before\/\nbecause the sun was shining’, in which when was the completion preferred\nby the majority of adults. However, the comparisons between the good and\npoor comprehenders are informative: the poor comprehenders were less\nlikely than the good comprehenders to select the target completions\nYOUNG READERS’ USE OF CONJUNCTIONS\n889\nand when non-target responses were made, the poor comprehenders\nwere less likely to choose a completion that made sense in a local sentence\ncontext.\nGENERAL DISCUSSION\nThese two studies demonstrate that young children’s understanding of\nconjunctions is still developing several years after correct usage has been\nobserved in speech production tasks. One explanation for the time lag\nbetween spoken and written usage is that performance on experimental\ntasks will be limited by metalinguistic abilities, which may develop after\nknowledge of a linguistic structure (Kail & Weisssenborn, 1991).\nPerformance on the cloze task was related to text-level comprehension, as\nwell as age. The current findings extend our knowledge about the factors\nthat limit children’s ability to use conjunctions in written language,\ndemonstrating both age- and ability-related differences across a range of\nconjunctions.\nThe superior performance by the older children may have arisen because\nof their greater experience with this type of written language task and\/or\ntheir more advanced language and comprehension skills. The association\nbetween performance on the task and language comprehension skills\nin Study Two suggests that language competence facilitated the older\nchildren’s ability to select the appropriate response.\nThe performance of the poor comprehenders in Study Two indicates a\ngeneral delay rather than deviance: they were poorer on all types of\nconjunction. Interestingly, there was no evidence that they were adopting\na different strategy to that of the good comprehenders, such as treating\neach sentence in isolation. If they had done so, the two groups should\nhave obtained comparable levels of performance in the error analysis.\nSurprisingly, the poor comprehenders did not obtain lower scores on a\nmeasure of grammatical knowledge. One interpretation is that their\nsentence-level difficulties are selective. However, the measure of\ngrammatical knowledge was modified because of time constraints. A longer,\nmore sensitive, task might have detected subtle grammatical deficits.\nThe current study indicates that children’s age and text comprehension\nskill are related to their selection of interclausal devices in a written cloze\ntask. These findings are supported by previous research investigating chil-\ndren’s selection of conjunctions in oral narrative production tasks, which\nshows that the appropriate use of causal conjunctions is more commonly\nfound in stories that have coherent and causally integrated event structures.\nThe relation between conjunction use and narrative structure is mediated\nby both age and reading comprehension level (Shapiro & Hudson, 1991;\nCain, 2003).\nCAIN ET AL.\n890\nAdults use conjunctions to guide their reading, understanding and\nmemory of the relations between sentences. For example, the presence of a\ncausal or adversative conjunctions leads to faster reading of sentence that\nare causally or adversatively related to a preceding text (Haberlandt, 1982)\nand sentences connected by a causal conjunction are better recalled that\nthose connected by a non-dependent conjunction (Caron, Micko &\nThu¨ring, 1988). The construction of the coherence relations between\nsentences appears to be directly affected by the presence of conjunctions.\nDespite the prevailing view that connectives facilitate comprehension and\nnumerous investigations into connective usage in children’s oral language\nproductions (e.g. Peterson & MacCabe, 1987), there is only one published\nstudy to date that has investigated how connectives might influence chil-\ndren’s real-time processing of text (Mouchon, Fayol & Gaonac’h, 1995).\nIn that study, the presence of the connectives mais (but) and soudain\n(suddenly) resulted in longer reading times for a subsequent statement\nrelative to items for which no connective or apre`s (afterwards) was present,\nfor eight and ten-year-olds. Unfortunately, no measures were taken to\ndetermine whether the presence of a connective facilitated comprehension\nor memory for the text, neither was a range of different types of\nconjunctions investigated in relation to age or reading ability.\nIf children experience difficulty in selecting the appropriate conjunction\nin a self-paced cloze task, they may also be less likely to encode the appro-\npriate semantic relation between two clauses (signalled by a conjunction) as\nthey are reading. If so, their comprehension will suffer because conjunctions\nprovide explicit cues to the dependent relations between events and help to\nestablish structural coherence (Gernsbacher, 1997). The current findings\nare, therefore, of considerable interest, demonstrating both age- and ability-\nrelated differences in the use of these interclausal devices. Further work is\nnow needed to explore whether the presence of conjunctions affects young\nchildren’s comprehension and memory of texts that they read and hear.\nREFERENCES\nAmidon, A. & Carey, P. (1972). Why five-year-olds cannot understand before and after.\nJournal of Verbal Learning and Verbal Behavior 11, 417–23.\nBishop, D. (1982). Test for the reception of grammar. Manchester, England: Chapel Press.\nBloom, L., Lahey, M., Hood, L., Lifter, K. & Fiess, K. (1980). Complex sentences : ac-\nquisition of syntactic connectives and the semantic relations they encode. Journal of Child\nLanguage 7, 235–61.\nBridge, C. A. & Winograd, P. N. (1982). Readers’ awareness of cohesive relationships during\ncloze comprehension. Journal of Reading Behavior 14, 299–312.\nCain, K. (2003). Text comprehension and its relation to coherence and cohesion in children’s\nfictional narratives. British Journal of Developmental Psychology 21, 335–51.\nCaron, J., Micko, H. C. & Thu¨ring, M. (1988). Conjunctions and the recall of composite\nsentences. Journal of Memory and Language 27, 309–23.\nYOUNG READERS’ USE OF CONJUNCTIONS\n891\nCrain, S., Shankweiler, D., Macaruso, P. & Bar-Shalom, E. (1990). Working memory and\ncomprehension of spoken sentences : investigations of children with reading disorder. In\nV. Giuseppe & T. Shallice (eds), Neuropsychological impairments of short-term memory.\nNew York, NY : Cambridge University Press.\nDunn, L. M., Dunn, L. M., Whetton, C. & Burley, J. (1997). British picture vocabulary\nscale – second edition. Windsor, England: NFER-Nelson.\nElliot, C. (1983). British ability scales, handbook and technical manual. Windsor, England:\nNFER-Nelson.\nGernsbacher, M. A. (1997). Coherence cues mapping during comprehension. In\nJ. Costermans & M. Fayol (eds), Processing interclausal relationships : studies in the\nproduction and comprehension of text. Mahwah, NJ: Erlbaum.\nGeva, E. & Ryan, E. B. (1985). Use of conjunctions in expository texts by skilled and less\nskilled readers. Journal of Reading Behaviour 17, 331–46.\nHaberlandt, K. (1982). Readers’ expectations on text comprehension. In J. F. Le Ny & W.\nKintsch (eds), Language and comprehension. Amsterdam: North Holland.\nHalliday, M. A. K. & Hasan, R. (1976). Cohesion in English. London: Longmans.\nIrwin, J. W. & Pulver, C. J. (1984). Effects of explicitness, clause order, and reversibility on\nchildren’s comprehension of causal relationships. Journal of Educational Psychology 76,\n399–407.\nJohnson, H. L. (1975). The meaning of before and after for preschool children. Journal of\nExperimental Child Psychology 19, 88–99.\nKail, M. & Weissenborn, J. (1991). Conjunctions : developmental issues. In G. Pie´raut-\nle-Bonniec & M. Dolitsky (eds), Language bases_ discourse bases : some aspects of\ncontemporary French-language psycholinguistics research. Amsterdam: Benjamins.\nMcCabe, A. & Peterson, C. (1985). A naturalistic study of the production of causal\nconnectives by children. Journal of Child Language 12, 145–59.\nMcClure, E. & Geva, E. (1983). The development of the cohesive use of adversative\nconjunctions in discourse. Discourse Processes 6, 411–32.\nMouchon, S., Fayol, M. & Gaonac’h, D. (1995). The on-line processing of inter-event\nrelationships in narratives. C.P.C.\/Current psychology of cognition 14, 171–93.\nMurray, J. D. (1997). Connectives and narrative text : the role of continuity. Memory and\nCognition 25, 227–36.\nNeale, M. D. (1997). The Neale analysis of reading ability – Revised (NARA-II ). Windsor\nUK: NFER-Nelson.\nPeterson, C. (1986). Semantic and pragmatic uses of ‘but’. Journal of Child Language 13,\n583–90.\nPeterson, C. & McCabe, A. (1987). The connective ‘and’ : do older children use it less as\nthey learn other connectives? Journal of Child Language 14, 375–81.\nSegal, E., Duchan, J. & Scott, P. (1991). The role of interclausal connectives in narrative\nstructuring : evidence from adults’ interpretation of simple stories. Discourse Processes 14,\n27–54.\nShapiro, L. R. & Hudson, J. A. (1991). Coherence and cohesion in children’s stories. In J.\nCostermans & M. Fayol (eds), Processing interclausal relationships : studies in the production\nand comprehension of text. Mahwah, NJ: Erlbaum.\nStevenson, R. J. & Pollitt, C. (1987). The acquisition of temporal terms. Journal of Child\nLanguage 14, 533–45.\nStothard, S. E. & Hulme, C. (1992). Reading comprehension difficulties in children : the role\nof language comprehension and working memory skills. Reading and Writing. An\nInterdisciplinary Journal 4, 245–56.\nYuill, N. & Oakhill, J. (1991). Children’s problems in text comprehension: an experimental\ninvestigation. Cambridge : CUP.\nCAIN ET AL.\n892\n"}