{"doi":"10.1029\/2007JC004679","coreId":"97680","oai":"oai:nora.nerc.ac.uk:5016","identifiers":["oai:nora.nerc.ac.uk:5016","10.1029\/2007JC004679"],"title":"Determining North Atlantic meridional transport variability from pressure on the western boundary: a model investigation.","authors":["Bingham, R. J.","Hughes, C. W."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-09-04","abstract":"In this paper we investigate the possibility of determining North\\ud\nAtlantic meridional transport variability using pressure on the western boundary, focusing on the 42degN latitude of the Halifax WAVE array. We start by\\ud\nreviewing the theoretical foundations of this approach. Next we present results from a model analysis, both statistical and dynamic, that demonstrate\\ud\nthe feasibility of the approach. We consider how well we can quantify the meridional transport variability at 42degN given complete knowledge of bottom pressure across the basin, and to what degree this quantification is degraded by first ignoring the effect of intervening topography, and then by using only bottom pressure on the western boundary. We find that for periods of greater\\ud\nthan one year we can recover more than 90% of the variability of the main\\ud\noverturning cell at 42degN using only the western boundary pressure, provided\\ud\nwe remove the depth-average boundary pressure signal. This signal arises from\\ud\na basin mode of bottom pressure variability, which has power at all timescales,\\ud\nbut that does not in truth have a meridional transport signal associated with\\ud\nit, and from the geostrophic depth-independent compensation of the Ekman\\ud\ntransport. An additional benefit of the removal of the depth-average pressure is that this high-frequency Ekman signal, which is essentially noise as\\ud\nfar as monitoring the MOC for climatically important changes is concerned,\\ud\nis clearly separated from other modes","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/97680.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/5016\/1\/2008_Bingham%2BHughes_JGR_MOC_accepted.pdf","pdfHashValue":"35c2158a7115d82a305ac544c184391836a77674","publisher":"American Geophysical Union","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:5016<\/identifier><datestamp>\n      2012-11-22T11:53:25Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533230<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/5016\/<\/dc:relation><dc:title>\n        Determining North Atlantic meridional transport variability from pressure on the western boundary: a model investigation.<\/dc:title><dc:creator>\n        Bingham, R. J.<\/dc:creator><dc:creator>\n        Hughes, C. W.<\/dc:creator><dc:subject>\n        Marine Sciences<\/dc:subject><dc:description>\n        In this paper we investigate the possibility of determining North\\ud\nAtlantic meridional transport variability using pressure on the western boundary, focusing on the 42degN latitude of the Halifax WAVE array. We start by\\ud\nreviewing the theoretical foundations of this approach. Next we present results from a model analysis, both statistical and dynamic, that demonstrate\\ud\nthe feasibility of the approach. We consider how well we can quantify the meridional transport variability at 42degN given complete knowledge of bottom pressure across the basin, and to what degree this quantification is degraded by first ignoring the effect of intervening topography, and then by using only bottom pressure on the western boundary. We find that for periods of greater\\ud\nthan one year we can recover more than 90% of the variability of the main\\ud\noverturning cell at 42degN using only the western boundary pressure, provided\\ud\nwe remove the depth-average boundary pressure signal. This signal arises from\\ud\na basin mode of bottom pressure variability, which has power at all timescales,\\ud\nbut that does not in truth have a meridional transport signal associated with\\ud\nit, and from the geostrophic depth-independent compensation of the Ekman\\ud\ntransport. An additional benefit of the removal of the depth-average pressure is that this high-frequency Ekman signal, which is essentially noise as\\ud\nfar as monitoring the MOC for climatically important changes is concerned,\\ud\nis clearly separated from other modes.<\/dc:description><dc:publisher>\n        American Geophysical Union<\/dc:publisher><dc:date>\n        2008-09-04<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/5016\/1\/2008_Bingham%2BHughes_JGR_MOC_accepted.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Bingham, R. J.; Hughes, C. W..  2008  Determining North Atlantic meridional transport variability from pressure on the western boundary: a model investigation.   Journal of Geophysical Research, 113 (C9), C09008. 16, pp.  https:\/\/doi.org\/10.1029\/2007JC004679 <https:\/\/doi.org\/10.1029\/2007JC004679>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.agu.org\/journals\/jc\/jc0809\/2007JC004679\/2007JC004679.pdf<\/dc:relation><dc:relation>\n        10.1029\/2007JC004679<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/5016\/","http:\/\/www.agu.org\/journals\/jc\/jc0809\/2007JC004679\/2007JC004679.pdf","10.1029\/2007JC004679"],"year":2008,"topics":["Marine Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"JOURNAL OF GEOPHYSICAL RESEARCH, VOL. ???, XXXX, DOI:10.1029\/,\nDetermining North Atlantic meridional transport\nvariability from pressure on the western boundary: A\nmodel investigation\nR. J. Bingham\nProudman Oceanographic Laboratory, 6 Brownlow St., Liverpool, U.K.\nC. W. Hughes\nProudman Oceanographic Laboratory, 6 Brownlow St., Liverpool, U.K.\nR. J. BINGHAM, Proudman Oceanographic Laboratory, 6 Brownlow St., Liverpool, U.K.\n(rjbi@pol.ac.uk)\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 2 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nAbstract. In this paper we investigate the possibility of determining North\nAtlantic meridional transport variability using pressure on the western bound-\nary, focusing on the 42◦N latitude of the Halifax WAVE array. We start by\nreviewing the theoretical foundations of this approach. Next we present re-\nsults from a model analysis, both statistical and dynamic, that demonstrate\nthe feasibility of the approach. We consider how well we can quantify the merid-\nional transport variability at 42◦N given complete knowledge of bottom pres-\nsure across the basin, and to what degree this quantification is degraded by\nfirst ignoring the effect of intervening topography, and then by using only\nbottom pressure on the western boundary. We find that for periods of greater\nthan one year we can recover more than 90% of the variability of the main\noverturning cell at 42◦N using only the western boundary pressure, provided\nwe remove the depth-average boundary pressure signal. This signal arises from\na basin mode of bottom pressure variability, which has power at all timescales,\nbut that does not in truth have a meridional transport signal associated with\nit, and from the geostrophic depth-independent compensation of the Ekman\ntransport. An additional benefit of the removal of the depth-average pres-\nsure is that this high-frequency Ekman signal, which is essentially noise as\nfar as monitoring the MOC for climatically important changes is concerned,\nis clearly separated from other modes.\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 3\n1. Introduction\nThe North Atlantic meridional overturning circulation (MOC) characterises the process\nwhereby relatively warm water in the upper 1000m or so of the ocean is transported to\nhigh latitudes, where upon it has cooled sufficiently to sink and return towards the equator\nin a cold deep layer. Because the MOC redistributes poleward a significant fraction of\nthe solar energy received at the equator it is believed that the collapse of the MOC could\nhave dramatic consequences for northern hemisphere climate, particularly for Northwest\nEurope [Vellinga and Wood , 2002; Wood et al., 2003]. Even a more gradual slow down, as\npredicted by most climate models [Cubasch et al., 2001] would have a significant impact on\nregional patterns of climate change. For this reason, a large effort is presently underway\nto monitor the Atlantic MOC.\nA comprehensive monitoring array, deployed in 2004, spans almost the entire Atlantic\nbasin at 26◦N, with the objective of providing a daily estimate of the strength of the\nAtlantic MOC. The design of the array is described by Hirschi et al. [2003]. There are good\nreasons to focus on 26◦N. Conveniently, at this latitude the Gulf Stream, which makes up\nthe bulk of the northward transport, flows through the relatively shallow (≈800m) Florida\nStraits, where it can be monitored using voltage across an existing under-sea cable. It\nis believed that 26◦N is near the latitude of maximum meridional heat transport, the\nquantity that is perhaps most directly related to climate variability. Also, 26◦N is close\nto a traditional hydrographic section, therefore hydrographic observations at this latitude\nspan a number of decades, allowing the variability observed by the array to be set in the\ncontext of an existing record, as has already been done by Bryden et al. [2005].\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 4 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nSince its deployment the array has produced a near continuous record of the meridional\ntransport at 26◦N. The results from the first year of observations have recently been\npublished by Cunningham et al. [2007] and Kanzow et al. [2007]. The closure of the\nvarious individually measured components of the transport budget as demonstrated by\nKanzow et al. [2007] validates the ability of the array to determine the transport variability.\nHowever, the large intra-annual variability of several Sv at all depths as reported by\nCunningham et al. [2007] means that slowdowns or trends such as those claimed by Bryden\net al. [2005] are difficult to detect over the short term.\nModelling studies by a number of authors have suggested that changes in the rate of deep\nwater formation at high latitudes, as would be associated with a collapse or slowdown of\nthe MOC, are communicated to lower latitudes by rapidly propagating coastally trapped\nwaves [e.g. Kawase, 1987; Johnson and Marshall , 2002]. These waves leave in their wake\na modified flow to ensure that the supply of water to high latitudes balances the rate\nof deep water production. This suggests that even on short timescales MOC variations\nshould be meridionally coherent. However, recently Bingham et al. [2007] have shown that\ninterannual variability of the meridional transport zonally integrated across the basin at\none latitude may not be representative of the variability at other latitudes. (Henceforth\nwe use meridional transport as shorthand for the meridional volume transport zonally\nintegrated across the basin.)\nSince it is not economically viable to repeat the comprehensive 26◦N effort at a num-\nber of other latitudes to determine the true meridional coherence of the North Atlantic\nmeridional transport, a less costly alternative is desirable. Fortunately, there are theoret-\nical reasons to believe that the strongest manifestation of meridional transport variability\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 5\noccurs on the western boundary. This raises the question of whether the meridional trans-\nport variability could be adequately monitored with an array situated only on the western\nboundary.\nAs a first step towards this, we consider, using an eddy permitting ocean model, to\nwhat extent variations in the Atlantic meridional transport at 42◦N can be determined\nusing only pressure on the western boundary. This particular latitude was chosen since\nit is the latitude of an existing observational campaign by the Proudman Oceanographic\nLaboratory, although not one currently designed to determine meridional transport vari-\nability in the sense described in this paper. We find, in the context of the model, where\nfull knowledge of the western boundary pressure is available, that interannual variations\nof the meridional transport are reliably determined using only pressure on the western\nboundary. Moreover, for reasons described below, the array is, by design, insensitive to\nhigh-frequency variations of the meridional transport, and so acts as a low-pass filter\neliminating the irrelevant short-lived fluctuations of the meridional transport.\nIn the next section we establish the theoretical basis for the relationship between bot-\ntom pressure on the western boundary and MOC variability. Then in section 3 we focus\non 42◦N where our present array is located. We examine the nature of bottom pressure,\nsea-surface height (SSH) and meridional transport variability at this latitude in an ocean\nmodel OCCAM, paying particular attention to the western boundary. Having established\nin a qualitative fashion the clear relationship between western boundary bottom pres-\nsure and the meridional transport, in section 4 we examine the relationship in terms of\ngeostrophic balance and show quantitatively that measurements on the western boundary\nare indeed sufficient to estimate the interannual variability of the meridional transport to\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 6 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\na high degree of accuracy. Finally, in section 5 we discuss the implications of our results\nand draw some conclusions on monitoring the MOC.\n2. Theoretical Basis\nThe theory behind monitoring meridional transport using boundary pressure is at first\nsight quite straightforward. It is based on the dominance of geostrophic balance for large-\nscale flows, and results from a zonal integral of the zonal momentum equation:∫ E\nW\nρ0ut − ρ0fv dx =\n∫ E\nW\n(−px + τxz ) dx, (1)\nwhere x = rλ cosφ, for latitude φ, longitude λ, and distance r from the centre of the\nearth. Here, the integral is at constant depth z from the western boundary x = W (φ, z)\nto the east x = E(φ, z). Nonlinear momentum terms have been neglected, as has lateral\nfriction, but vertical friction is included as the vertical derivative of the zonal stress τx.\nThe acceleration term can be expected to be small on timescales much longer than a\nday; this is confirmed by angular momentum diagnostics [Ponte and Rosen, 1994]. In\naddition, below the surface Ekman layer, the stress term should be small (it may be\nsignificant in a bottom boundary layer, but such a layer will only occupy a small part\nof the zonal integral at a particular depth). Writing the zonal integral of v as T , and\nneglecting acceleration and stress terms reduces (1) to\nρ0fT = pE − pW , (2)\ni.e. the northward transport integrated along a particular depth and latitude line is simply\ngiven by the pressure difference between the end points of the line, divided by the Coriolis\nparameter f and reference density ρ0. Throughout we shall refer to pE and pW as the\neastern and western boundary pressures, respectively. By this we mean that they are the\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 7\nbottom pressure (anomalies) at the eastern-most and western-most points of the ocean\nfloor at a given depth (and latitude). It follows that pE(z) and pW (z) are defined for all\nz ≤ −H, where H is the greatest depth of the ocean at the given latitude. This may mean\nthat in the real ocean either one of pE(z) or pW (z) may be defined well outside what is\nconventional considered to be the boundary region.\nIt may seem overly simplistic to use this equation in the real ocean, where the zonal\nintegral involves passing through a western boundary current in which nonlinear terms and\nperhaps other ageostrophic terms are important. However, while ageostrophic terms may\nbe significant in the along-stream momentum balance of a boundary current, theoretical\ninvestigations generally accept that the cross-stream balance is dominated by geostrophy.\nAlong-steam terms enter the zonal integral when the current is not meridional, but only\nweakly as long as they result from a narrow current, as in this case. Similarly, while eddies\nmay be responsible for significant mass fluxes within density layers of varying thickness,\nthe role of the associated ageostrophic flow in producing transport between two fixed,\nconstant depth surfaces is much smaller. There is good reason to hope that geostrophy\nwill work well in this integral balance.\nSupporting evidence for this concept is found in Hughes and de Cuevas [2001], who\nshowed that there is a rather good balance between wind stress and form stress in zonal\nintegrals at all latitudes within the OCCAM model, confirming similar diagnostics based\non the Southern Ocean in other models [Stevens and Ivchenko, 1997; Gille, 1997]. Form\nstress is defined as the zonal integral\n−\n∫ E\nW\npbHx dx, (3)\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 8 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nwhere pb is bottom pressure and H is ocean depth (with this sign, it represents the\neastward force exerted on the topography by the ocean). Performing the integral along\nthe seafloor, we can write Hx = −zx, so that the form stress becomes\n−\n∫ E\nW\npbHx dx =\n∫ E\nW\npb dz, (4)\nwhere dz is negative on the western side of an ocean basin, as depth increases eastwards,\nand positive on the eastern side as depth decreases. Alternatively, limiting the integral to\na single ocean basin, this can be written as\n−\n∫ E\nW\npbHx dx =\n∫ 0\n−H0\n(pE − pW ) dz. (5)\nComparing with (2), we see that the form stress is simply the depth-integrated northward\ngeostrophic transport, divided by ρ0f . A balance between wind stress and form stress\nin a zonal integral then represents a balance between the northward Ekman flux across\na particular latitude, and a geostrophic return flow. In Fig. 3 of Hughes and de Cuevas\n[2001], this balance is accurate to better than 50,000 Nm−1, equivalent to about 0.5 Sv in\ntransport, for latitudes of 40–50◦N (integrated across both Atlantic and Pacific oceans),\nso we may expect this order of accuracy in depth-integrated transports calculated from\n(2), excluding the Ekman contribution.\nHowever, in this study we are interested not in the balance between Ekman flow and\nreturn flow, but between a shallow and a deep limb of an overturning cell. The calcula-\ntions presented in Section 4 address the accuracy of this balance within OCCAM. It is\nworthwhile first to point out some subtleties in this diagnostic.\nThe domain of integration is sketched schematically in Figure 1, on which we note the\nexpected directions of zonal integral flow above the Mid-Atlantic Ridge. According to (2)\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 9\npressure on the western boundary is lower than at corresponding depths on the east for\ndepths where the flow is northwards, and higher where the flow is southwards. Clearly, for\nthe time mean flow, we need to know pressure both at the east and at the west. However,\nfor variations in the flow, it is not at first obvious whether the associated pressure signal\nwill be at the west or at the east, or a combination of the two. In fact, we expect changes\nin pressure to be stronger at the west than at the east, for the same reason that boundary\ncurrents are stronger on the west than the east.\nThis is a feature of simplified models such as Kawase [1987] and Johnson and Marshall\n[2002], in which changes in overturning are mediated by boundary waves which allow a\ntrapped pressure signal at the western boundary to balance the flow in the boundary\ncurrent, but which radiate into the interior from the eastern boundary leaving only small\npressure signals at the east. More generically, the link between pressure signals and\nboundary currents is demonstrated by Hughes and de Cuevas [2001], who show that the\nprimary large-scale balance in western boundary currents is ρ0βV = J(pb, H), where V\nis the depth-integrated northward flow and β = df\/dy (y = rφ). The Jacobian term is a\nmeasure of the gradient of pressure along depth contours. In fact, integrating over a thin\nstrip A bounded by two depth contours z = −H1 (deeper) and z = −H2 (shallower), and\nby two nearby latitudes separated by a meridional distance δy leads to\n1\nδy\n∫\nA\nJ(pb, H) dA =\n∮\npb∇H · ds = d\ndy\n∫ −H2\n−H1\npb dz, (6)\nwhich, comparing with (2), is the meridional derivative of the contribution of pressure at\nthis boundary to f times the zonal integral of northward transport, integrated over the\ndepth range z = −H1 to z = −H2 (pb being the same as pW on the western continental\nslope).\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 10 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nIn other words, the bottom pressure variations associated with the zonally-integrated\nflow T in (2) are also associated with a depth-integrated flow V above the slope, via\nthe bottom pressure torque. If variations in depth-integrated flow are much larger at\nthe western boundary than the east, then we should expect the corresponding pressure\nchanges to be at the western boundary rather than the east.\nThere is, however, a potential problem with assuming that eastern boundary pressure\nis constant. This results from the possibility of modes of variability in pressure which do\nnot produce changes in either zonally-integrated northward flow, or in depth-integrated\nflow. This is true of any change of the form pb(H) in which the bottom pressure change\nis a function of depth only.\nOne such mode is well-known: at a period of about 5 days, changes in atmospheric\npressure loading of the Atlantic and Pacific occur, but there is insufficient time for mass\nexchange between the ocean basins for the ocean to respond in an inverse barometer\nmanner to these changes, although mass redistribution within each basin can occur. As a\nresult, there are almost uniform basinwide signals in bottom pressure at this period [Ponte,\n1997; Mathers and Woodworth, 2004; Park and Watts , 2006; Stepanov and Hughes , 2006].\nSimilarly, if for any reason the total ocean mass in the Atlantic were to change at longer\nperiods, without any local change in wind stress or density forcing, we would expect a\nbarotropic adjustment process to quickly distribute this mass uniformly over the area of\nthe ocean, resulting in a uniform bottom pressure change.\nChanges like this would result in changes in pressure on the western boundary which\nwould be interpreted using (2) as a net northward flow at all depths, although such a flow\ndoes not in fact occur because there is a compensating pressure change on the eastern\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 11\nboundary. However, there is a good physical reason to ignore variations of this form when\nlooking at the overturning circulation: overturning represents flows in different directions\nat different depths, rather than a uniform direction at all depths. Uniform flows can\noccur, as a result of the flow through Bering Strait, or on shorter time scales to balance\naccumulations of mass in the North Atlantic and Arctic, but monitoring such flows is not\nthe prime objective of this study. Accordingly, we can filter both the depth-integrated\nmeridional transport and the spurious meridional transport due to basin-wide modes by\nconsidering not the full boundary pressure pW , but the residual p\n′\nW = pW − pW , where\npW is the depth-average of pW . This depth-average is simply defined as\npW =\n1\nH\n∫ 0\n−H\npW (z) dz. (7)\nIn removing this depth-average, we are in fact removing a legitimate component of the\noverturning circulation since, even with no net northward flow through a section, there\nmust be a net geostrophic flow to balance the Ekman transport. This is simple to add back\nin if it is desirable to do so (assuming Ekman transport is dominated by that due to surface\nwind stress), since the Ekman component is near the surface, and the missing geostrophic\ncomponent is by definition uniform with depth (irrespective of whether the true dynamical\nresponse to wind stress produces a depth-independent meridional transport). Note that, in\nignoring changes of depth-averaged bottom pressure, we simplify the monitoring problem,\nbecause we now only need to know the difference of pressure between one depth and\nanother. In the case of a vertical sidewall, this could be derived using hydrostatic balance\nfrom density at the sidewall alone. When the sidewall slopes, more information is needed\n(the geostrophic bottom current).\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 12 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nFinally, it is important to consider the influence of topography, such as the Mid-Atlantic\nRidge, away from the ocean boundaries. Equation (2) assumes that no there is no topog-\nraphy intervening between the boundary pressures pW and pE. More generally, we should\nconsider the sum of the zonal integrals over each ocean section at a particular depth,\nand the difference in boundary pressures across each intervening piece of topography then\nenters into the equation. In fact, as the Appendix shows, intervening topography is only\nsignificant at depths which are blocked over a wide range of latitudes, hence the division\nin Figure 1 of levels below the peak of the ridge into “weakly blocked” and “blocked”\ndepths.\nTo summarise: east minus west pressure differences should give a good measure of\nmeridional transport at a given depth. We expect most of the variation of pressure\nalong depth contours to occur on the western boundary, because such variations are\nassociated with strong depth-integrated flows such as occur in western boundary currents.\nVariations in bottom pressure which are constant along depth contours can equally well\noccur at eastern or western boundaries, potentially causing a problem for a monitoring\neffort focused only at the western boundary. A part of this problem can be removed by\nignoring the net northward transport across the section, focusing only on the overturning,\nbut it remains to be seen whether spurious depth-dependent transports remain. Mid-\nocean topography complicates the picture, but only topography which blocks a particular\ndepth over a large range of latitudes to each side of the chosen monitoring section is likely\nto be a problem.\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 13\nWe now proceed to examine how these theoretical ideas play out in the context of\nan eddy-permitting ocean model, to make a realistic estimate of the effect of quantities\nneglected in our analysis.\n3. The nature of OCCAM variability at 42◦N\nThe main results of this paper are based on an analysis of the Ocean Circulation and\nClimate Advanced Modelling project model (OCCAM) run at the National Oceanography\nCentre, Southampton. OCCAM is a global, z-level, free surface model with a rotated grid\nover the North Atlantic, and is forced with NCEP reanalysis products. The model includes\na coupled sea-ice component. The run we are considering (run 202) is at 0.25 degree\nresolution, with 66 vertical levels, and covers the 19-year period 1985-2003, following an\ninitial 4 years of spin-up. Further details of the model formulation can be found in Coward\nand de Cuevas [2005]. The model output is supplied as five day means from which we\ndiagnose bottom pressure and the meridional transport.\nFollowing [Greatbatch, 1994] the bottom pressure anomalies diagnosed from the model\nare corrected by adding a spatial constant at each timestep to ensure the total mass\nanomaly remains zero. This is equivalent to adding a uniform layer of water to the ocean\nat each timestep to ensure ocean mass is conserved. This is necessary because OCCAM\nis a Boussinesq model which conserves volume rather than mass. Consequently, a net\nchange in the density of the fixed ocean volume appears as a net mass change. Because\noceanic mass is conserved potential effects of bottom pressure variations due to actual\nfluxes into and out of the ocean due to, among other things, precipitation\/evaporation,\nriver run-off, ice-melt are not represented. This is not an issue however, since, as described\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 14 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nbelow, uniform bottom pressure variability, as would result from such fluxes, only enters\ninto our analysis as a problem which is easily overcome.\nWe start by examining the nature of the meridional transport variability at 42◦N. The\nzonal-integral calculation is complicated by the rotated North Atlantic grid which deforms\nlines of latitude into arcs of latitude. Interpolating the velocities fields onto a regular lat-\nlon grid to simplify the calculation results in a significant loss of volume conservation, so\ninstead the zonal integral of meridional transport is computed over the faces of the rotated\ntracer grid cells that lie on the required latitude arc. A further complication arises from\nthe fact that the bottom grid cells are of variable depth. To account for this the velocities\nare interpolated to 10m bins in such a way as to preserve the volume conservation of the\nwater column beneath each surface grid cell.\nThe zonally integrated meridional transport (Figure 2a) shows that at 42◦N the merid-\nional transport consists of a northward flowing upper layer between the surface and 1000m,\na southward flowing layer between 1000m to 3000m, and a much weaker northward flowing\nlayer between 3000m to 4800m. In terms of the conventional picture of an upper overturn-\ning cell and a weaker, lower overturning cell the middle layer consists of southward flowing\nparts of both cells with the boundary between them lying at a depth of 2600m. The depth\nof the layer interfaces, particularly between the upper and middle layers, remain almost\nconstant throughout the model integration. The mean northward transport in the up-\nper layer is 16.7Sv, with a standard deviation of 3.1Sv. Subtracting the time-mean from\nthe absolute transport reveals the more complex structure of the anomalous meridional\ntransport (Figures 2b and 2c). There is a clear low-frequency mode of variability, with\nthe transport in the upper layer, after an initial decrease, rising by 3Sv over a period of\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 15\n5 years from 1987. Following this there is a steady decline by a similar amount over the\nremainder of the model integration. These changes in the northward flow are balanced by\ncorresponding changes in the southward flow below. As shown in Bingham et al. [2007],\nthis low-frequency mode is the dominant feature of the meridional transport at latitudes\nnorth of 40N.\nWhile these meridional transport fluctuations generally lie within the layers defined by\nthe absolute meridional transport, the depth of the zero point of the transport fluctuations\nis somewhat lower, with a mean depth of about 1300m, although this depth varies slightly\naccording to the amplitude of the fluctuations. Imposed on top of the inter-annual mode\nof variability is a seasonal cycle with an amplitude between 0.5Sv to 1Sv, and higher fre-\nquency variability of comparable amplitude. Meridional transport variability from 3000m\nto 4800m is of similar, or greater, magnitude than the mean meridional transport but\nis not clearly related to the mean structure of the lower cell. Rather, it is dominated\nby high-frequency variability that is depth-independent. Depths greater than 4800m are\ndefined only for a channel in the far east of the basin (see Figure 6). Here the flow is\nextremely weak, leading to the sharp change in magnitude at 4800m in Figure 2b.\nIt is difficult to say much regarding the realism of the MOC variability over the pe-\nriod studied given the lack of observations. Marsh et al. [2008] find that OCCAM MOC\nstrength at selected WOCE sections in the North Atlantic agree with published observa-\ntions within their, admittedly large, error bars. In addition, the seasonal and intra-annual\nvariability are not unreasonable when compared with the first observations from 26◦N\n[Cunningham et al., 2007; Kanzow et al., 2007]. More generally, Marsh et al. [2008] finds\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 16 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nthat the variability of OCCAM’s sea surface temperature and North Atlantic heat content\ncompares well with satellite and in-situ observations.\nAs described in section 2 we expect there to be a strong relationship between the merid-\nional transport variability as shown in Figure 2 and bottom pressure (bottom pressure)\nvariability at this latitude, particularly on the western boundary. Figure 3 shows that bot-\ntom pressure variability at 42◦N is greatest on the western side of the basin. (Throughout\nthis paper bottom pressure is expresses as an equivalent water thickness h = pb\/gρ0, where\nρ0 is the mean density of seawater and g is acceleration due to gravity.) For the unfiltered\nbottom pressure (black line) the standard deviation on the western boundary is about\n5.5cm. Beyond the shelf this rapidly falls to an average standard deviation of about 1cm\nin the interior.\nA Fast Fourier Transform filtering method is used to partition the variability into high-\n(periods less than 100 days), mid- (periods between 100 and 400 days), and low- (periods\ngreater than 400 days) frequency bands. To avoid Gibbs ringing, the Fourier coefficients\nat the end points of each frequency band are tapered using a cosine bell curve centred on\nthe cut-off point, and whose width is one-fifth the cut-off wavelength. These frequency\nbands, and filtering method, will be used throughout the paper when referring the high-,\nmid-, and low-frequency variability of any quantity.\nHaving thus partitioned the bottom pressure variability we find that the dramatic dif-\nference between the shelf and the interior is primarily due to the characteristics of the\nhigh-frequency variability (red line). For the mid- and low-frequency bottom pressure\nvariability the difference between the shelf and deep ocean, although smaller, is still pro-\nnounced, with both bands having a standard deviation of 2cm on the shelf and an average\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 17\nstandard deviation of 0.5cm in the interior. In all cases there is a small downward trend\nfrom west to east across the basin, with local deviations associated with topography.\nAbove we saw that meridional transport variability at 42◦N has a clear low-frequency\nmode and therefore we now examine more closely the temporal and spatial structure of\nlow-frequency bottom pressure variability across the North Atlantic at 42◦N (see Figure\n4). We have seen how the northward transport in the upper cell occurs in the depth\nrange 0-1300m, and the return flow is in the 1300-3000m depth range. These isobaths\nare marked on the eastern and western slope panels in Figure 4, as is the 340m isobath,\nwhich defines the shelf edge. On the western slope the bottom pressure on the shelf and\nits weaker projection onto the upper slope to 1300m, shows the same low-frequency signal\nas does the meridional transport, but in the opposite sense. Bottom pressure declines\nto a minimum in the mid-1990s and then begins an upward trend over the remainder of\nthe model run. On the lower slope below the 1300m isobath, in the depth range that\ncorresponds to the compensating meridional transport variability in the lower layer, the\nsame low-frequency bottom pressure mode is also seen but with the sign reversed.\nFrom theory, meridional transport variability is determined by the difference between\nbottom pressure in these depth-intervals on the western boundary and the bottom pressure\nvariability in the corresponding depth-intervals on the eastern boundary (ignoring for a\nmoment any intervening topography). Figure 4b shows that apart from on the shelf above\n340m, the bottom pressure signals on the eastern slope in the 340m to 1300m depth range\nand 1300m to 3000m depth range are weak, much weaker than the corresponding bottom\npressure signals on the west. From this we can expect that meridional transport variability\ncan be determined quite accurately using bottom pressure on the western boundary only.\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 18 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nHowever, since at this latitude the Mid-Atlantic Ridge (MAR) intersects the basin in the\n1800m to 3000m range we still need to consider bottom pressure on the flanks of the\nMAR because it will be the pressure difference between eastern slope and eastern flank\nof the MAR together with pressure difference between western slope and western flank\nof the MAR that will determine the true meridional transport in the 1800-3000m depth\nrange. However inspection of Figure 4c shows that bottom pressure variability is almost\nsymmetrical about the peak of the MAR. The consequence of this is that pressure gradient\nfluctuations on one side of the MAR are cancelled by those on the other. Hence, we can\nanticipate that neglecting the MAR will make little difference to our calculation of the\nmeridional transport. And indeed, this is what we find below. Referring to the theory\nprovided in the appendix this is to be expected because the 3000m contour at 42◦N is\nonly “weakly blocked” (see Figure 7).\nFigures 4(e-h) show the low-frequency SSH field across 42◦N from the model for compar-\nison with model bottom pressure. The nature of SSH variability across much of the basin\nis generally quite different from that of bottom pressure, particularly between the western\nshelf and 32W which defines the western flank of the MAR, indicating the importance of\nbaroclinic processes on these timescales in this region. To a lesser extent the same is also\ntrue to the east of 32W. This is because SSH variability reflects both barotropic processes,\nwhich have an equal magnitude in both bottom pressure and SSH, and baroclinic process,\nwhich have a much greater SSH than bottom pressure signature (for instance, for the\nfirst baroclinic mode, which has the greatest baroclinic bottom pressure signature, the\nratio is approximately 0.1 in a flat-bottomed ocean, and less with topography [Rhines ,\n1970]). However, we see that on the eastern and western shelves (above 340m) the bottom\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 19\npressure and SSH are very similar. Strong coupling between bottom pressure and SSH in\nshallow regions appears to be a general feature of ocean models [Vinogradova et al., 2007;\nBingham and Hughes , 2008].\nWe also see how the western slope prevents much of the variability seen in the deep\nocean from being communicated onto the shelf where the timeseries is characteristic of the\ndominant interannual mode of meridional transport variability described above. Moreover,\nthis interannual meridional transport signature is absent on the eastern shelf, with the\nvariability being in general rather weaker than it this on the western shelf, and continuous\nwith the variability in deeper water. A similar difference between the variability on the\neastern and western shelves is also clear in the SSH variability across 42◦N observed from\naltimetry (Figure 5), as is the decoupling of the SSH signal across the western slope, and\nthe lack of such decoupling across the eastern slope, which suggests little interaction of the\neastern signals with topography, and hence small bottom pressure signals on the slope.\nSignificant low-frequency power has also been seen in tide gauge records from along the\nU.S. east coast [Maul and Hanson, 1991; Unal and Ghil , 1995], while, as Hakkinen [2001]\nhas also pointed out, such low-frequency power is lacking in the open ocean.\nThese similarities between observations and the model strongly suggest, as does theory,\nthat the negligible interannual bottom pressure variability on the eastern boundary and\nstrong interannual variability on the western boundary is a realistic feature of the ocean\nand not just a model artefact and support our case that interannual meridional transport\nvariability can be determined using only western boundary observations.\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 20 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\n4. The geostrophic calculation\nHaving established in a qualitative fashion the nature of bottom pressure variability at\n42◦N and its relationship to the meridional transport we now complete a more rigorous test\nof the geostrophic meridional transport calculation. To facilitate a comparison between the\nactual meridional transport, determined from the model velocities in 10m depth-intervals,\nand the meridional transport computed from geostrophy, the boundary pressure at the\nmid-points of the same depth-intervals was calculated. These were then used to determine\nthe geostrophic transport between each pair of points at each level. The topography\nacross 42◦N as it appears in the model is shown in Figure 6, with the points used in the\ngeostrophic calculation shown coloured. In the actual ocean, slopes will almost always be\nfinite so the boundary pressure is also a bottom pressure. However, because the model\nhas insufficient resolution to resolve steep slopes these appear in the model as vertical\nwalls, and so the model boundary pressures are generally not true bottom pressures.\nTo test the hypothesis that the actual meridional transport, T , can be determined with\nadequate accuracy using only pressure on the western boundary we shall examine four\nprimary cases: Tall, the full geostrophic calculation using all east-west pressure differences\nat each depth (that is, using pressure at all of the coloured boundary points in Figure 6);\nTew, the geostrophic calculation using only the pressure difference between the easternmost\nand westernmost boundaries at each depth (that is, using pressure only at the red and\nblue boundary points in Figure 6); Tw, the geostrophic calculation using only the pressure\non the western boundary (that is, using pressure only at the blue boundary points in\nFigure 6); Te, the geostrophic calculation using only the pressure on the eastern boundary\n(that is, using pressure only at the red boundary points in Figure 6). For reasons that will\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 21\nbecome clear we also consider the additional case T ′w, which is the geostrophic calculation\nusing only the pressure on the western boundary but where the depth-average boundary\npressure has been removed. For completeness we also include the analogous case for the\neastern boundary, T ′e.\nBoth correlation and skill are used to asses the performance of the calculations relative\nto the directly computed transport. Unlike correlation, skill, which here is defined as\ns = 1− var(T − T∗)\/var(T ), (8)\nwhere var(X) represents the variance of timeseries X and ∗ signifies all, ew, orw, also\ntakes into account the amplitude of the variability. Clearly, a perfect computation will\nhave a skill of 1, meaning T∗ captures 100% of the variance in the actual timeseries.\nThe results of the geostrophic calculation for the six cases described above are shown in\nthe left-hand column of Figure 8, while the corresponding error fields, defined as T−T∗, are\nshown in the right-hand column. The performance of those cases that include the western\nboundary is assessed in Figure 9 where the correlation and skill scores as a function of\ndepth are shown.\nTall establishes the baseline against which the subsequent approximations can be judged.\nPanels (a) and (g) of Figure 8 show that when all east-west pressure differences are taken\ninto account the meridional transport is generally well determined. It is not perfectly\ndetermined, however, as indicated by the non-zero residual. In the upper few hundred\nmetres the actual meridional transport includes a significant Ekman component not deter-\nmined by geostrophy. Smaller discrepancies are also found below the Ekman layer. These\ndeviations from the actual transport are reflected in the less than perfect correlation and\nskill scores for Tall (red curves in panels (a) and (b) of Figure 9), which range from ef-\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 22 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nfectively zero above 100m and below 4800m, to a maximum correlation of 0.92 and skill\nof 85% at 500m. Above 2500m, the performance of Tall generally follows the strength of\nthe transport variability, while below 2500m the performance is roughly constant with the\ncorrelation and skill scores averaging about 0.9 and 70%, respectively. The performance\nof Tall tends to follow the depth structure of the strength of the transport because where\nthe geostrophic flow is weaker errors due to either the numerics of the calculation or small\ndepartures from geostrophy become more significant and therefore have greater power to\ndiminish the performance measures. If we consider only the interannual component of the\nmeridional transport, then above 3000m the skill of Tall is somewhat improved (panels (c)\nand (d) of Figure 9). Yet, below 3000m it is significantly poorer. Again, this is because\nthe amplitude of the low-frequency variability is small and so noise in the numerics of the\ncalculation becomes significant. This also explains the decrease in skill from 1000m to\n1300m.\nThe first simplification of the geostrophic calculation is to ignore pressure differences\ndue to intervening topography and use only pressure from the most easterly and westerly\nboundaries. It is immediately apparent from panels (b) and (h) of Figure 8 that this\nsimplification does little to hamper the recovery of the large-scale temporal and spatial\nfeatures of the meridional transport. This in agreement with the theory in section 2 and\nthe appendix, and with the Hovmoeller diagrams of bottom pressure shown in Figure 4.\nObviously, Tall and Tew will differ only at depths where there is intervening topography,\nthe first of which lies on the western shelf in the depth range from 100m to 200m (see\nFigure 6). In Figure 8h any error introduced by the neglect of this topography is obscured\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 23\nby the missing Ekman transport. Its effect is clear, however, in the substantially reduced\ncorrelation and skill scores between 200m and 300m in panels (a) and (b) of Figure 9.\nAt greater depths, significant topographic interruptions are formed by the Mid-Atlantic\nRidge, which reaches a minimum depth of 1700m at 42◦N, and, in the western basin,\nthe southern tip of the Grand Banks, which attains a minimum depth of 2500m at this\nlatitude (see Figures 6 and 7). Comparing panels (g) and (h) of Figure 8 we find that\nclear differences between Tall and Tew arise below 2500m, where neglecting the topography\nresults in an additional high-frequency, depth-independent transport error. In panels (a)\nand (b) of Figure 9 we see that below 1700m the performance of Tew starts to decrease\nrelative to Tall, although in absolute terms it remains constant. Then, below about 2700m,\nthe performance of Tew decreases almost linearly, while the performance of Tall remains\nconstant. The fact that the error in Tew starts to grow significantly below 2500m, the\ndepth to which tip of the Grand Banks reaches, suggests that it is this feature rather than\nthe Mid-Atlantic Ridge, whose neglect introduces the largest errors into the geostrophic\ncalculation. The constant performance of Tall below 2500m and the linear decrease in\nperformance of Tew are consistent with a high-frequency, depth-independent pressure dif-\nference between the western boundary and the western flank of the Grand Banks topog-\nraphy resulting in high-frequency depth-independent transport variations between these\ntopographic features which are lost when the pressure on the intervening topography is\nneglected. Because the rest of the flow gets weaker with depth, these transport fluctua-\ntions account for an increasing fraction of the variability with depth, and therefore lead\nto a gradual decrease in performance of Tew.\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 24 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nNext, we consider the case that motivates the present work and has implications for a\npotential future monitoring system: The ability to calculate the meridional transport at\n42◦N using only the western boundary pressure. Confirming our theoretical suspicions, it\nis quite clear from panels (c) and (i) of Figure 8 that using the western boundary pressure\nwe can recover much of the depth and temporal structure and amplitude of the meridional\ntransport at 42◦N. The effect of neglecting pressure on the eastern boundary is seen more\nclearly by comparing the residuals in panels (h) and (i). The additional error introduced\nby this further simplification takes the form of largely depth-independent, high-frequency\ntransport fluctuations. Because of this additional error Tw performs significantly worse\nthan Tall and Tew (see panels (a) and (b) of Figure 9). Peaks in performance are found at\n500m and at 2500m, where transport variability is greatest, but the skill is never greater\nthan 50%, and is generally much lower. However, because the error is generally confined\nto intra-annual to annual periods, the interannual performance of Tw is much better, with\nthe correlation and skill being much closer to that achieved by Tall and Tew (see panels\n(c) and (d) of Figure 9).\nIn contrast to Tw, in panels (d) and (j) of Figure 8 we see that Te bears little resemblance\nto the actual meridional transport, confirming that nearly all the information regarding\nthe interannual meridional transport variability is contained on the western boundary.\nThere is a clear correspondence between Te and the form of the error in Tw. Recalling\nthat the scaling of pressure to obtain Tw and Te differs by a factor of -1, we see that\nthe similarities in panels (d) and (i) must result from similar depth-independent pressure\nsignals on the eastern and western boundaries. This close correspondence, over all but the\nhighest frequencies, is illustrated in Figure 10a, which shows the depth-average pressure\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 25\nfrom each boundary. The correlation between these two timeseries is 0.70, and from our\nearlier discussion, we may suspect a basin-scale bottom pressure mode as being responsible\nthis high correlation. Using pressure from both the eastern and western boundaries when\ncalculating Tew ensures that these depth-averages will largely cancel each other. However,\nusing pressure from one boundary only, as is done for the Tw and Te calculations, results\nin an apparent depth-independent pressure gradient (relative to a zero pressure on the ne-\nglected boundary) and corresponding erroneous depth-independent meridional transport\nsignal.\nThe obvious solution to this problem is to remove the depth-average western boundary\npressure prior to computing the meridional transport. This brings us to case T ′w. Compar-\nison of the residuals for Tw and T\n′\nw (panels (i) and (k) of Figure 8) shows that removing the\ndepth-average pressure does reduce the amplitude of the error in the geostrophic calcula-\ntion of meridional transport using only western boundary pressure. While the correlation\ndoes not change much (because it is dominated by the low-frequency correspondence be-\ntween the timeseries), there is a significant improvement in the skill, particularly in the\ndepth range 1000–2500m. Yet T ′w is still somewhat less successful than either Tall or Tew.\nAgain, these differences arise at primarily at high-frequencies. As a result the interannual\nperformance of T ′w over depths less than 3000m of is not significantly different from Tall\nor Tew (see panels (c) and (d) of Figure 9). Because the basin-scale bottom pressure\nfluctuations have the greatest affect at intra-annual periods removal of the depth-average\nboundary pressure acts to smooth the T ′w timeseries.\nSime et al. [2006] describe how much of the transport in the Ekman layer is compensated\nby an opposing depth-independent geostrophic transport, in what they refer to as the\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 26 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nexternal mode. Figure 10b shows that this balance also holds at 42◦N in OCCAM; the\nmeridional transport in the Ekman layer (blue line), which we have taken to be from the\nsurface to 140m, is largely balanced, by the integral of meridional transport from 140m\nto the bottom (black line; scaled by -1). The correlation between the two timeseries is\n0.76. The Ekman transport is not associated with an east-west pressure gradient. Being\ngeostrophic, however, the depth-integrated compensation of the Ekman transport must\nbe associated with a depth-independent pressure difference across the basin. And, indeed,\nthe transport computed from the depth-integral of the east-west pressure difference and\nthe directly calculated depth-integral transport are correlated at 0.67.\nSo we see that there are two processes leading to depth-independent boundary pressures\nvariations: the first, basin-scale pressure variations, which produce identical changes at\neach boundary, and therefore have no associated transport variability; the second, the\ndepth-independent geostrophic compensation of the Ekman layer transport, which leads\nto relatively small differences in the eastern and western depth-independent pressures.\nWhile the apparent east-west difference caused by neglecting the eastern boundary can\nbe compensated by removing the depth-average pressure from the western boundary, the\ngeostrophic compensations of the Ekman transport cannot be recovered using only the\nwestern boundary pressure.\nIn addition to the depth-independent pressure signal on the eastern boundary there\nis also a seasonally repeating signal (see Figure 8f). This represents a further error in\nthe calculation of meridional transport using only western boundary pressure, which,\ntogether with the missing geostrophic compensation of the Ekman transport, explains\nwhy T ′w, although an improvement over Tw, still does perform as well as Tall or Tew\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 27\nwhen considered over the full frequency spectrum. The residual signal on the eastern\nboundary places a limit on the temporal resolution of the meridional transport calculated\nusing western boundary pressure: only interannual or longer periods may be reliably\ndetermined.\nFrom Figure 2b it is clear that the dominant interannual mode of meridional transport\nvariability can be characterised as consisting of an upper layer above 1300m balanced\nby a deeper layer to a depth of 3000m. For an overall assessment of the geostrophic\ncalculation we therefore compare, for each of the six cases described above, the depth-\nintegrals of T and T∗ over the upper layer interval 100m to 1300m (denoted by U and\nU∗), and the lower layer interval 1300m to 3000m (denoted by L and L∗). The upper\nlayer starts at 100m to exclude the Ekman layer transport which will not be determined\nby the geostrophic calculations. U∗ and L∗ and for each of the four cases that include\nthe western boundary are shown in the left-hand and right-hand columns, respectively,\nof Figure 11. We include both correlation and skill relative to the directly computed\ntransport as measures of performance. However, skill is the more relevant in this context\nand so we shall focus on this in the discussion.\nFocusing first on the upper layer we find that using all pressure differences we can\nrecover 79% of the total variance (panel a). Deviations from the actual transport are con-\ncentrated at the highest frequencies, and so at interannual timescales 92% of the variance\nis recovered. Neglecting intervening topography, which, as described earlier, in this depth\nrange only occurs on the western shelf, reduces the skill of the geostrophic computation\nto 66% (panel b). Comparing the Uall and Uew timeseries we that this reduction in skill\nis due primarily to spurious high-frequencies. These arise because local pressure fluctua-\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 28 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\ntions in the narrow westernmost channel are not balanced when intervening topography\nis ignored. At sub-annual frequencies, however, the skill of Uew is 92%, identical to the\nskill of Uall.\nGiven the spurious pressure gradient and corresponding error in Uew introduced by the\nchannel on the western shelf, when calculating Uw (panel c) we use, within the depth range\nspanned by the channel, the pressure on the edge of the continental slope rather than at\nthe most westerly boundary. (Something that would obviously be done in practice.) This\nadjustment results in a small improvement in the scores compared with using the actual\nwesternmost boundary points. Yet, due to the basin-scale pressure signals described\nabove, the skill of Uw is still only 17%. Because the basin-scale pressure signals have most\npower at annual or shorter periods the low-frequency skill of Uw is much better (79%). As\nbefore, we see that subtracting the depth-average boundary pressure significantly reduces\nthe spurious high-frequency transport signal (panel e), increasing the skill of the western\nboundary calculation to 46% for the full signal and 92% for the interannual signal, identical\nto the skill obtained when using all east-west pressure differences.\nThe pattern for the upper layer calculations is repeated for the lower layer with the\nskill becoming progressively worse as we first neglect intervening topography and then the\npressure on the eastern boundary, and then improving once the depth-average pressure\nis removed from the western boundary. As Figure 8b shows, errors in the geostrophic\ncalculating grow with depth and this is reflected in the slightly lower skill scores for Lall\nand Lew compared with the corresponding upper layer calculations. Given that neglecting\nthe eastern boundary introduces a depth-independent error we might expect the skill of\nLw to be lower than Uw since the lower layer is thicker. Yet, in fact, the skill of Lw is\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 29\nslightly greater. This is because Uw also includes an error due to the upper layer pressure\nsignal described above, which requires balancing by the eastern boundary. This is also\nreflected in the greater skill of L′w relative to U\n′\nw. Note that, surprisingly, the interannual\nskill for L′w is actually a few percent higher than the Lall and Lew cases. A possible\nexplanation for this is that the errors in the geostrophic calculation that persist beyond\nthe annual period have a small non-zero depth average.\n5. Discussion\nThe key result of this study, summarised in Figure 12, is that on timescales longer\nthan one year variations of the North Atlantic meridional transport in the OCCAM ocean\nmodel can accurately be determined from bottom pressure on the western boundary.\nIn the upper layer (100–1300m) at low-frequencies the skill of the meridional transport\ncalculation using only western boundary pressure is 92%, equal to the calculation taking\ninto account all bottom pressure pairs across the basin, and the standard deviation from\nthe directly computed timeseries is 0.29Sv. In the lower layer (1300–3000m) the low-\nfrequency skill is 96%, and the standard deviation from the directly computed timeseries\nis 0.24Sv. These results demonstrate the potential accuracy of a western boundary MOC\nobserving system. The accuracy depends on the fact that low-frequency depth-dependent\nvariations in bottom pressure on the eastern boundary and on the intervening topography\nare either negligible compared with those on the western boundary or compensating,\nand therefore make little contribution to the depth-dependent pressure gradient which\ndetermines the meridional transport.\nIn determining the meridional transport from the western boundary bottom pressure\nwe find it necessary to remove the depth-average bottom pressure. This is due to a basin-\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 30 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nscale bottom pressure variability which has power at all frequencies, including interannual,\nand which makes an almost equal contribution to the depth-independent pressures on the\neastern and western boundaries. Hence, excluding the eastern boundary from the merid-\nional transport calculation, without removing the depth-average bottom pressure from\nthe western boundary, results in an apparent depth-independent pressure difference and\ncorresponding depth-independent meridional transport signal. The inability of a western\nboundary array to determine the depth-independent pressure difference across the basin\nalso means that it could not determine the geostrophic compensation of the surface Ekman\ntransport. Kanzow et al. [2007] shows that this component makes a large contribution to\nthe meridional transport at intra-annual timescales, in agreement with what we find in\nOCCAM. It is likely these large intra-annual fluctuations in the depth-average transport\ndo not play a important role in regulating the Earth’s climate. Therefore, separating\nout the depth-independent transport has the advantage of acting as a low pass filter to\nwhat is essentially noise as far as detecting climatically important changes in the MOC\nis concerned. Of course, the Ekman transport itself and its geostrophic compensation,\nincluding any low-frequency variability that may have significance for heat transport, can\nstill readily be inferred from satellite observations as is done at 26◦N.\nAs with all model results, one can question their realism. While we cannot, of course,\nbe certain that this relationship between western boundary pressure and the meridional\ntransport holds in reality, the differing nature of variability on the eastern and western\nboundaries seen in the model is substantiated by observations of sea-level from altimetry\nand tide-gauges. Often modelling results do not translate to the real ocean because to\nensure stability models are much more viscous than the real ocean. Friction, however, is\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 31\none factor that reduces the validity of the geostrophic relationship on which our results\ndepend, so it can be said that our results hold in spite of, not because of, the high\nviscosity of the model. Thus, the relationship may be even stronger in the much less\nviscous real ocean. That said, we cannot rule out the possibility of qualitative differences\nin the structure and strength of the actual time-dependent circulation that mean the\nrelationship between western boundary pressure and meridional transport variability is\nnot as strong as it is in reality.\nA further potential problem occurs if eddies in the real ocean have a stronger influence\non western boundary pressure than they do in OCCAM. Only in-situ data can answer this\nquestion, but the clear influence of the continental slope suppressing the propagation of\nmid-ocean sea level variability in shallower water, confirmed by altimetry, suggests that\nOCCAM is not unrealistic in this respect.\nFinally, there is the question of whether over longer periods the eastern boundary pres-\nsure remains unimportant. We intend to perform a similar analysis of 100 years of output\nfrom a climate model to address this.\nWhile this study suggests that measurements of western boundary pressure fluctuations\nare sufficient to monitor the interannual variability of the Atlantic meridional transport,\nit does not address the practicalities of making these measurements. With currently-\navailable technology, it is not possible to measure bottom pressure directly to the accuracy\nrequired over interannual timescales, because a combination of sensor drift and datum loss\nbetween deployments degrades the accuracy for long period variations.\nThe most obvious solution is a combination of satellite altimetry to determine the sea\nlevel signal, with density measurements through the water column, permitting a determi-\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 32 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nnation of bottom pressure from hydrostatic balance. The difficulty here is that bottom\npressure variations are a small residual of two large, compensating signals from sea level\nand density, and the required accuracy pushes the limits of satellite altimetry (particularly\ngiven the fine spatial resolution required to distinguish sea level signals in different depths\nof ocean, over a steep slope).\nAlternatively, since we must in any case subtract out the depth-averaged bottom pres-\nsure, we can make use of the fact that we only need to measure the down-slope gradient\nof bottom pressure. For a vertical slope, this only requires density measurements. For\na finite slope, we also need the horizontal pressure gradient at the sea floor, measured\nto an accuracy which depends on the steepness of the slope. Our proposal for the next\niteration of the 42◦N western boundary array maintained by POL is to use near-bottom\ncurrents, determined using high vertical resolution ADCP (Acoustic Doppler Current\nProfiler) measurements, to supply this information via the geostrophic relationship. This\napproach should enable us to distinguish the relevant geostrophic currents from any bot-\ntom boundary layer flow.\nFinally, the strong correlation between sea level and bottom pressure which emerges\nin shallow water highlights the value of tide gauge measurements as a component of the\nmonitoring system. Although tide gauge measurements alone are probably inadequate\nto determine the overturning circulation, their value is strongly boosted by the fact that\nthere are many multidecadal tide gauge records from both eastern and western boundaries\nof the Atlantic, making possible inferences about circulation changes since at least the\nmiddle of the 20th century.\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 33\nAcknowledgments. This study was supported by the UK NERC thematic RAPID\nprogramme, NER\/T\/S\/2002\/00439 and NER\/T\/S\/2002\/00485, and represents a contri-\nbution to the Proudman Oceanographic Laboratory’s “Sea-level, bottom pressure, and\ngeodetic oceanography” Programme. For the OCCAM model data we acknowledge the\nefforts of Andrew Coward and Beverly de Cuevas.\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 34 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nAppendix\nForm stress on mid-ocean topography is subject to the same relationship with depth-\nintegrated flow as that which occurs at the boundary. For topography which acts as a\nsubstantial barrier, such as that separating the regions marked “blocked” in Figure 1, if\nthe topography supports a significant depth-integrated transport above it then it can also\nsupport a significant form stress, meaning that the pressures on the topography make an\nimportant contribution to the zonal integral meridional transport. However, if a depth\ncontour can be found which passes between the east and west sides of the topography\nwithout a large meridional deflection (“weakly blocked” depths in Figure 1, then the\npossible size of the form stress is more constrained.\nConsider the balance of terms within the region depicted in Figure 13), bounded by a\ndepth contour z = −H1 and a latitude line where f = f0. This represents a plan view\nof the topography penetrating into the “weakly blocked” region in Figure 1. From (2)\nand (5), the contribution of pressure differences across the topography to zonal integral\ntransport T is given by\nρf0\n∫ −H2\n−H1\nT dz = −\n∫ b\na\npbHx dx, (9)\nwhere H2 is the depth of the shallowest topography along ab. However, we can also\ncalculate the form stress as an integral of the bottom pressure torque over the enclosed\narea A: ∫\nA\nJ(pb, H) dA =\n∮\npb∇H · ds = −\n∫ b\na\npbHx dx. (10)\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 35\nWe now use J(pb, H) = ρβV = ρ∇ · (fU), where U is the depth-integrated horizontal\nvelocity, together with (9) and (10) to give\nρf0\n∫ −H2\n−H1\nT dz = ρ\n∫\nA\n∇ · (fU) dA. (11)\nNow, assuming there are no mass sources so that ∇ · U = 0, the right hand side of\n(11) is non-zero only when there is a flow into A at a different latitude to the flow out of\nthe area. The largest possible value of this term is then Qδf , where Q is the total flow\ninto (and out of) A, and δf is the maximum difference in f between the northern and\nsouthern limits of A. Given this, together with (11), we see that∫ −H2\n−H1\nT dz < Q\nδf\nf0\n. (12)\nThis tells us that the maximum possible meridional transport integrated over the region\nmarked “weakly blocked” in Figure 1 is a factor δf\/f0 smaller than the depth-integrated\nflow above that section of topography. Adding in the effect of wind stress or mass sources\nsimply results in the reinterpretation of U (and hence Q) as representing the difference\nof the flow from one in Sverdrup balance. Taking as an example f0 at 42\n◦N and δf\ncorresponding to an extension of 5 degrees to the south (or north) gives δf\/f0 = 0.10. In\nthis case, for every sverdrup of meridional transport supported by mid-ocean topography\nin the “weakly blocked” region, there would have to be at least 10 Sv of depth-integrated\nflow above the blocking topography. This factor means that pressure signals at mid-ocean\ntopography are less likely to contribute strongly to the meridional transport at depths\nwhere the topography only blocks a small range of latitudes. However, there is nothing\nin this argument which prevents large pressure signals occurring over the topography, in\nwhich the eastern and western pressures balance producing no net form stress. This is\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 36 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nwhat would happen, for example, in a barotropic flow following f\/H contours across a\nridge.\nThe argument for expecting most of the pressure variation to occur at the western\nrather than the eastern boundary is that depth-integrated currents are much stronger on\nthe west than on the east. The scaling in this Appendix shows that, in order for pressure on\nweakly-blocked topography to contribute significantly to the meridional transport, depth-\nintegrated transports above that topography would have to be ten times stronger than\nabove blocked topography such as the eastern and western boundaries, making weakly-\nblocked regions also unlikely to contribute strongly to the meridional transport.\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 37\nReferences\nBingham, R. J., and C. W. Hughes (2008), The relationship between sea-level and bottom\npressure variability in an eddy permitting ocean model, Geophys. Res. Lett., 35, L03602,\ndoi:10.1029\/2007GL032662.\nBingham, R. J., C. W. Hughes, V. Roussenov, and R. G. Williams (2007), Meridional\ncoherence of the North Atlantic meridional overturning circulation, Geophys. Res. Lett.,\n34, L23606, doi:10.1029\/2007GL031731.\nBryden, H., H. Longworth, and S. Cunningham (2005), Slowing of the Atlantic Overturn-\ning circulation at 25N, Nature, 438, 655–657.\nCoward, A., and B. de Cuevas (2005), The OCCAM 66 Level Model: physics, ini-\ntial conditions and external forcing., Internal report 99, SOC, 58pp, available from\nhttp:\/\/www.noc.soton.ac.uk\/JRD\/OCCAM\/OCCAM-p25k66-run202.pdf.\nCubasch, U., G. A. Meehl, G. J. Boer, R. J. Stouffer, M. Dix, A. Noda, C. A. Senior,\nS. Raper, and K. S. Yap (2001), Projections of future climate change. In, Climate\nChange 2001: The Scientific Basis. Contribution of Working Group I to the Third\nAssessment Report of the Intergovernmental Panel on Climate Change, Houghton, J.\nT. and Y. Ding and D. J. Griggs and M. Noguer and P. J. van der Linden and X.\nDai and K. Maskell and C. A. Johnson (eds.), p. 881 pp, Cambridge University Press,\nCambridge, United Kingdom and New York, NY, USA.\nCunningham, S., et al. (2007), Temporal variability of the atlantic meridional overturning\ncirculation at 26.5n, Science, 317 (5840), 935–938, doi:10.1126\/science.1141304.\nGille, S. T. (1997), The Southern Ocean momentum balance: Evidence for topographic\neffects from numerical model output and altimeter data, J. Phys. Oceanogr., 27, 2219–\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 38 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\n2232.\nGreatbatch, R. (1994), A note on the representation of steric sea-level in models that\nconserve volume rather than mass, J. Geophys. Res., 99, 12,767–12,771.\nHakkinen, S. (2001), Variability in sea surface height: A qualitative measure for the\nmeridional overturning in the North Atlantic, J. Geophys. Res., 106 (C7), 13,837–13,848.\nHirschi, J., J. Baehr, J. Marotzke, J. Stark, S. Cunningham, and J.-O. Beismann (2003),\nA monitoring design for the Atlantic meridional overturning circulation, Geophys. Res.\nLett., 30 (7), 1413, doi:10.1029\/2002GL016776.\nHughes, C. W., and B. A. de Cuevas (2001), Why western boundary currents in realistic\noceans are inviscid: A link between form stress and bottom pressure torques, J. Phys.\nOceanogr., 31, 2871–2885.\nJohnson, H., and D. Marshall (2002), A theory for the surface atlantic response to ther-\nmohaline variability, J. Phys. Oceanogr., 32, 1121–1132.\nKanzow, T., et al. (2007), Observed flow compensation associated with the moc at 26.5n\nin the atlantic, Science, 317 (5840), 938–941, doi:10.1126\/science.1141293.\nKawase, M. (1987), Establishment of deep ocean circulation driven by deep-water pro-\nduction, J. Phys. Oceanogr., 17, 2294–2317.\nMarsh, R., S. A. Josey, B. A. de Cuevas, L. J. Redbourn, and G. D. Quartly (2008),\nMechanisms for recent warming of the North Atlantic: Insights gained with an eddy-\npermitting model, J. Geophys. Res., 113, C04031, doi:10.1029\/2007JC004096.\nMathers, E. L., and P. L. Woodworth (2004), A study of departures from the inverse-\nbarometer response of sea level to air-pressure forcing at a period of 5 days, Q. J. R.\nMeteorol. Soc., 130, 725–738.\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 39\nMaul, G. A., and K. Hanson (1991), Interannual coherence between north Atlantic atmo-\nspheric surface pressure and composite southern U.S.A. sea level, Geophys. Res. Lett.,\n18 (4), 653–656.\nPark, J. H., and D. R. Watts (2006), Near 5-day nonisostatic response of the atlantic\nocean to atmospheric surface pressure deduced from sub-surface and bottom pressure\nmeasurements, Geophys. Res. Lett., 33, L12610, doi:10.1029\/2006GL026304.\nPonte, R. M. (1997), Nonequilibrium response of the global ocean to the 5-day Rossby-\nHaurwitz wave in atmospheric surface pressure, J. Phys. Oceanogr., 27, 2158–2168.\nPonte, R. M., and R. D. Rosen (1994), Oceanic angular momentum and torques in a\ngeneral circulation model, J. Phys. Oceanogr., 24, 1966–1977.\nRhines, P. (1970), Edge-, bottom-, and Rossby-waves in a rotating stratified fluid, Geo-\nphys. Fluid Dyn., 1, 273–302.\nSime, L., D. Stevens, K. Heywood, and K. Oliver (2006), A decomposition of the Atlantic\nmeridional overturning, J. Phys. Oceanogr., 36, 2253–2270.\nStepanov, V. N., and C. W. Hughes (2006), Propagation of signals in basin-sale\nocean bottom pressure from a barotropic model, J. Geophys. Res., 111, C12002, doi:\n10.1029\/2005JC003450.\nStevens, D., and V. Ivchenko (1997), The zonal momentum balance in an eddy resolving\ngeneral circulation model of the Southern Ocean, Q. J. R. Meteorol. Soc., 123, 929–951.\nUnal, Y., and M. Ghil (1995), Interannual and interdecdal oscillation patterns in sea level,\nClim. Dyn., 11, 255–278.\nVellinga, M., and R. A. Wood (2002), Global climatic impacts of a collapse of the Atlantic\nthermohaline circulation, Climatic Change, 54, 251–267.\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 40 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nVinogradova, N. T., R. Ponte, , and D. Stammer (2007), Relation between sea level and\nbottom pressure and the vertical dependence of oceanic variability, Geophys. Res. Lett.,\n34, L03608, doi:10.1029\/2006GL028588.\nWood, R. A., M. Vellinga, and R. Thorpe (2003), Global warming and thermo-\nhaline circulation stability, Phil. Trans. R. Soc. Lond. A, 361, 1961–1975, doi:\n10.1029\/2005GB00210.\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 41\nFigure 1. A schematic section across the North Atlantic basin showing the components of\nthe meridional transport relative to the key topographic features. The layer marked “blocked”\ndefines the depth range for which it is not possible to reach one flank of the topography from the\nother along an isobath, whereas for the “weakly blocked” depth range it is possible.\nFigure 2. (a) The zonally integrated Atlantic meridional transport at 42◦N in OCCAM. (b)\nThe meridional transport with the time-mean removed. (c) Integral over the depth range 100m to\n1000m of the zonally integrated anomalous transport. Red curve shows low-pass filtered version\n(periods greater than 400 days).\nFigure 3. The standard deviation of bottom pressure variability from west to east across the\nAtlantic basin at 42◦N in OCCAM: black, unfiltered; red, periods less 100 days; green, periods\nbetween 100 and 400 days; blue, periods greater than 400 days.\nFigure 4. The low-frequency (periods greater than 400 days) variability of bottom pressure\n(left) and sea level (right) across the Atlantic basin at 42◦N in OCCAM: (a,e) Across the entire\nbasin; (b,f) Across the eastern shelf and continental slope; (c,g) Across the mid-Atlantic ridge;\n(d,h) Across the western shelf and continental slope. Contours correspond to isobaths: 340m\n(dashed); 1300m (solid); 3000m (dotted), except for (c,g) where the dashed line represents the\npeak of the mid-Atlantic ridge at 1700m.\nFigure 5. The low-frequency (periods greater than 400 days) variability of observed sea level\nacross the Atlantic basin at 42◦N: (a) Across the entire basin; (b) Across the eastern shelf and\ncontinental slope; (c) Across the mid-Atlantic ridge; (d) Across the western shelf and continental\nslope. Contours correspond to isobaths: 340m (dashed); 1300m (solid); 3000m (dotted), except\nfor (c) where the dashed line represents the peak of the mid-Atlantic ridge at 1700m.\nD R A F T June 3, 2008, 3:07pm D R A F T\nX - 42 BINGHAM AND HUGHES: THE NORTH ATLANTIC MOC\nFigure 6. The topography across the Atlantic at 42◦N as it appears in OCCAM, with north\ninto the page. The boundary points where pressure is used in the geostrophic calculations of\nthe meridional transport are shown coloured. The most easterly and westerly boundary points\nat a given depth are red and blue, respectively. The easterly flank and westerly flank boundary\npoints on the intervening topography are yellow and cyan, respectively.\nFigure 7. The topography of the North Atlantic basin showing contours at 1300m, the depth\nof the interface between upper and lower layers of the meridional transport variations at 42◦N\n(dashed line) in OCCAM , and at 3000m, the bottom of the lower layer.\nFigure 8. Testing the geostrophic calculation of the Atlantic meridional transport at 42◦N\nin OCCAM. The meridional transport computed using: (a) all pairs of east and west points (b)\nextreme east and west points only (i.e. ignoring intervening topography); (c) western boundary\npoints only; (d) eastern boundary points only; (e) western boundary points with the depth-\naverage boundary pressure removed; (f) eastern boundary points with the depth-average bound-\nary pressure removed;. (g-l) The actual transport minus the computed transports shown in\n(a-f).\nFigure 9. Testing the geostrophic calculation of the Atlantic meridional transport at 42◦N in\nOCCAM: (a) Correlation of the computed transports with the actual transports as a function\nof depth; (b) The skill of the computed transports in accounting for the variance of the actual\ntransports as a function of depth. All east-west pairs (red); extreme east-west points only (green);\nextreme west points with depth-average removed (blue); extreme west points with depth-average\nkept (blue dashed). (c-d) As in (a-b) but with low-pass filtering (retaining periods greater than\n400 days).\nD R A F T June 3, 2008, 3:07pm D R A F T\nBINGHAM AND HUGHES: THE NORTH ATLANTIC MOC X - 43\nFigure 10. (a) The depth-average of bottom pressure, expressed in equivalent millimetres of\nwater thickness, on the eastern boundary (red) and western boundary (blue). (b) The zonally\nintegrated transport from the surface to 140m, which is essentially the Ekman transport (blue).\nThe zonally integrated transport from 140m to the bottom multiplied by -1, representing the\ngeostrophic compensation of the Ekman transport (black). The depth-integral of the east-west\npressure difference scaled by a factor of 1\/ρ0f to obtain the depth-independent geostrophic\ntransport (red). Only a subsection is shown to make clear the high-frequency correspondence\nbetween the timeseries.\nFigure 11. Testing the geostrophic calculation of the Atlantic meridional transport at 42◦N\nin OCCAM. The anomalous transport integrated over 100-1300m using: (a) all pairs of east\nand west points; (b) extreme east and west points only (i.e. ignoring intervening topography);\n(c) western boundary points only; (d) western boundary points only with the depth-average\nboundary pressure removed; (e-h) Repeating (a-d) for the anomalous transport integrated over\n1300-3000m. In each case the total anomalous zonally integrated transport is shown in red.\nLow-pass filtered (periods greater than 400 days) scores are shown in brackets.\nFigure 12. (a) The interannual Atlantic meridional transport variability at 42◦N is OCCAM\nintegrated over 100-1300m calculated directly (red) and determined using bottom pressure on\nthe western boundary (blue). (b) As in (a) but for the 1300-3000m depth range.\nFigure 13. A plan view of the topography penetrating into the “weakly blocked” region in\nFigure 1. The shaded region is bounded by the depth contour H1 and a line of latitude that is\ntangent to the southern tip of the shallower depth contour H2.\nD R A F T June 3, 2008, 3:07pm D R A F T\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}