{"doi":"10.1016\/j.mar.2010.10.002","coreId":"219686","oai":"oai:eprints.lse.ac.uk:36703","identifiers":["oai:eprints.lse.ac.uk:36703","10.1016\/j.mar.2010.10.002"],"title":"Do comprehensive performance measurement systems help or hinder managers' mental model development?","authors":["Hall, Matthew"],"enrichments":{"references":[],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2011-06","abstract":"This study examines whether and how the process of updating and changing mental models (learning) helps to explain how performance measurement systems (PMS) affect individual performance. Although prior studies (e.g., Hall, 2008; Burney and Widener, 2007; Burney et al., 2009) highlight the important role of particular cognitive and motivational mechanisms, such as role clarity and organizational justice, they do not consider how PMS can improve performance by helping individuals to update their mental models and develop learning capabilities. As such, this study investigates relations among comprehensive PMS, two types of learning at the managerial (individual) level (mental model confirmation and mental model building), and managerial performance. Results show that a more comprehensive PMS helps managers to confirm their mental models of business unit operations. In contrast, findings show that a more comprehensive PMS can help managers to build new mental models of business unit operations, but only in specific settings, that is, for managers with a short organizational tenure and\/or from a small-sized strategic business unit. Importantly, results also show that both mental model confirmation and mental model building have positive associations with managerial performance","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/219686.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/36703\/1\/Hall_Do-comprehensive-performance-measurement-systems-help-or-hinder_2011.pdf","pdfHashValue":"99aa351511b42b612f4a0b4e06c984808b2e54aa","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:36703<\/identifier><datestamp>\n      2014-08-01T14:00:39Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D414354<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/36703\/<\/dc:relation><dc:title>\n        Do comprehensive performance measurement systems help or hinder managers' mental model development?<\/dc:title><dc:creator>\n        Hall, Matthew<\/dc:creator><dc:subject>\n        HD28 Management. Industrial Management<\/dc:subject><dc:subject>\n        HF5601 Accounting<\/dc:subject><dc:description>\n        This study examines whether and how the process of updating and changing mental models (learning) helps to explain how performance measurement systems (PMS) affect individual performance. Although prior studies (e.g., Hall, 2008; Burney and Widener, 2007; Burney et al., 2009) highlight the important role of particular cognitive and motivational mechanisms, such as role clarity and organizational justice, they do not consider how PMS can improve performance by helping individuals to update their mental models and develop learning capabilities. As such, this study investigates relations among comprehensive PMS, two types of learning at the managerial (individual) level (mental model confirmation and mental model building), and managerial performance. Results show that a more comprehensive PMS helps managers to confirm their mental models of business unit operations. In contrast, findings show that a more comprehensive PMS can help managers to build new mental models of business unit operations, but only in specific settings, that is, for managers with a short organizational tenure and\/or from a small-sized strategic business unit. Importantly, results also show that both mental model confirmation and mental model building have positive associations with managerial performance.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2011-06<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/36703\/1\/Hall_Do-comprehensive-performance-measurement-systems-help-or-hinder_2011.pdf<\/dc:identifier><dc:identifier>\n          Hall, Matthew  (2011) Do comprehensive performance measurement systems help or hinder managers' mental model development?  Management Accounting Research, 22 (2).  pp. 68-83.  ISSN 1096-1224     <\/dc:identifier><dc:relation>\n        http:\/\/www.journals.elsevier.com\/management-accounting-research<\/dc:relation><dc:relation>\n        10.1016\/j.mar.2010.10.002<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/36703\/","http:\/\/www.journals.elsevier.com\/management-accounting-research","10.1016\/j.mar.2010.10.002"],"year":2011,"topics":["HD28 Management. Industrial Management","HF5601 Accounting"],"subject":["Article","PeerReviewed"],"fullText":"  \nMatthew Hall \nDo comprehensive performance \nmeasurement systems help or hinder \nmanagers' mental model development? \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nHall, Matthew (2011) Do comprehensive performance measurement systems help or hinder \nmanagers' mental model development? Management Accounting Research, 22 (2). pp. 68-83. \nISSN 1096-1224 DOI: 10.1016\/j.mar.2010.10.002 \n \n© 2010 Elsevier Ltd. \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/36703\/ \nAvailable in LSE Research Online: August 2014 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \n 1 \nFull text copy of: \n \nHall, M. 2011. Do comprehensive performance measurement systems help or \nhinder managers’ mental model development? Management Accounting \nResearch, 22, 68-83. \n \n \n \nABSTRACT \n \nThis study examines whether and how the process of updating and changing mental \nmodels (learning) helps to explain how performance measurement systems (PMS) \naffect individual performance. Although prior studies (e.g., Hall, 2008; Burney and \nWidener, 2007; Burney et al., 2009) highlight the important role of particular \ncognitive and motivational mechanisms, such as role clarity and organizational \njustice, they do not consider how PMS can improve performance by helping \nindividuals to update their mental models and develop learning capabilities. As such, \nthis study investigates relations among comprehensive PMS, two types of learning at \nthe managerial (individual) level (mental model confirmation and mental model \nbuilding), and managerial performance. Results show that a more comprehensive \nPMS helps managers to confirm their mental models of business unit operations. In \ncontrast, findings show that a more comprehensive PMS can help managers to build \nnew mental models of business unit operations, but only in specific settings, that is, \nfor managers with a short organizational tenure and\/or from a small-sized strategic \nbusiness unit. Importantly, results also show that both mental model confirmation and \nmental model building have positive associations with managerial performance. \n \n 2 \n1. Introduction \n In the management accounting literature there is growing recognition of the \nimportance of understanding how and why performance measurement systems (PMS) \nrelate to individual and\/or organisational performance. Psychological theories in \nparticular indicate that performance measurement systems affect individual \nperformance through cognitive and motivational mechanisms. Drawing on these \ntheories, Hall (2008) finds that role clarity (cognitive) and psychological \nempowerment (motivational) mediate the relation between comprehensive PMS and \nmanagerial performance. Research by Burney and Widener also shows how attributes \nof PMS (e.g., technical validity, linking measures to strategy) affect individual \nperformance through role conflict (cognitive) and organizational justice (motivation) \n(Burney and Widener, 2007; Burney et al., 2009). These studies highlight the \nimportant role of particular cognitive and motivational mechanisms in understanding \nhow PMS affect individual performance. However, research indicates that an \nimportant way that PMS can improve performance is by helping individuals to update \ntheir mental models and develop learning capabilities (e.g., Kaplan and Norton, 1996; \nChenhall and Morris, 1993; McKinnon and Bruns, 1992). As such, although this \narticle uses the same data set as Hall (2008), its focus is quite different. Hall (2008) \nfocused upon role clarity and psychological empowerment, whereas the incremental \ncontribution of this article emerges by examining how the process of updating and \nchanging mental models (learning) helps to explain the way in which PMS affect \nindividual performance.   \nFollowing from this discussion, I examine the following research question: do \ncomprehensive performance measurement systems (PMS) help or hinder managers’ \nmental model development? Specifically, I investigate how comprehensive PMS \n 3 \nrelate to two types of learning at the managerial (individual) level (mental model \nconfirmation and mental model building), and the subsequent links to managerial \nperformance. Results show that a more comprehensive PMS helps managers to \nconfirm their mental models of business unit operations. In contrast, findings show \nthat a more comprehensive PMS can help managers to build new mental models of \nbusiness unit operations, but only in specific settings, that is, for managers with a \nshort organizational tenure and\/or from a small-sized strategic business unit. \nImportantly, results also show that both mental model confirmation and mental model \nbuilding have positive associations with managerial performance.  \nThe study contributes to the literature in three ways. First, by investigating the \nrole of learning processes at the managerial (individual) level, the study extends prior \nresearch (e.g., Hall (2008), Burney and Widener, 2007, Burney et al., 2009) that has \nexamined how cognitive and motivational mechanisms help to explain links between \nPMS and managerial performance. Furthermore, as it is the actions and thoughts of \nindividuals within firms that are a necessary condition for organizational learning to \noccur (Romme and Dillen, 1997; Vandenbosch and Higgins, 1995), a focus on \nlearning at the individual level also helps to understand the processes involved in \nMCS generating learning at the organizational level more broadly (Chenhall, 2005; \nHenri, 2006; Widener, 2007).  \nSecond, the results contribute to our understanding of the role of MCS in \nfacilitating different types of learning processes. Prior studies tend to view learning as \na single construct (e.g., Henri, 2006; Sprinkle, 2000; Widener, 2007) whereas theories \nof learning generally refer to two different yet related learning processes, for example, \nexploitation and exploration (Gupta, Smith and Shalley, 2006; March, 1991), single- \nand double-loop learning (Argyris and Schon, 1978) and confirming and building \n 4 \nmental models (Festinger, 1957; Flavell, 1963; Norman, 1982; Piaget, 1954). As \ntheorists conceptualize learning along two dimensions, examining multiple \ndimensions of learning can help to advance understanding of how MCS are related to \ndifferent types of learning processes. Furthermore, closer attention to the conceptual \nspecification of constructs can help to reduce ambiguity regarding their meaning, \nwhich, in turn, can result in more rigorous conclusions concerning the relations \nbetween MCS and other constructs, such as learning (c.f., Bisbe, Batista-Foguet and \nChenhall, 2007). \nThird, by exploring how a characteristic of MCS, comprehensive PMS, relates \nto learning, the study responds to calls to investigate how specific attributes of MCS \naffect learning (Otley, 1999; Shields, 1997). This is important as prior research \nprovides a mixed picture, with one line of argument suggesting that MCS can impede \nthe learning process (Argyris, 1977; 1990; Gray, 1990; Hedberg and Jonsson, 1978; \nKloot, 1997; Staw and Boettger, 1990), whereas other arguments indicate that MCS \ncan promote creativity and innovation and thus facilitate learning (Chenhall, 2005; \nHenri, 2006; Kaplan and Norton, 1996b; Neely and Al-Najjar, 2006). This study \nprovides a possible explanation for these conflicting arguments by considering \nspecifically the particular characteristics of MCS that are expected to help or hinder \nthe learning process.  \nThe remainder of the paper is structured in four sections: the next section \nprovides the theoretical framework for the study. The research method, including \nsample selection and variable measurement, is then presented. This is followed by an \nanalysis of the data using partial least squares regression analysis. The final section \ndiscusses the results and implications, outlines the limitations, and suggests avenues \nfor future research. \n 5 \n \n2. Theoretical framework \n \n2.1.Learning and mental model development \n \nIn general, an entity learns if, through the processing of information, the range \nof its potential behaviours is changed (Huber, 1991)1. At the organizational level, \nlearning involves the creation of knowledge through the development of systems that \nacquire, interpret, diffuse and store information (Chenhall, 2005; Henri, 2006; Huber, \n1991). Often, it is these systems that can provide a platform upon which individual \nlearning and discovery can be promoted and developed. Whilst organizational \nlearning is not the aggregate of individual learning (Argyris and Schon, 1978), it is the \nactions and thoughts of individuals within firms that are a necessary condition for \norganizational learning to occur (Romme and Dillen, 1997; Vandenbosch and \nHiggins, 1995). In particular, the learning processes of managers are important as they \nare likely to have a large effect on organizational learning through the interpretation \nof information for others, the setting of agendas, and the establishment of systems for \nsolving problems (Vandenbosch and Higgins, 1995; 1996). \nAn important learning process for managers relates to confirming and \nupdating their mental models of how the organization operates. Mental models are \n                                                 \n1 This definition reflects a cognitive, rather than behavioural, approach to learning. Behaviourists view \nlearning as a change in behaviour or performance (Norman, 1982) where learning is understood as \nmodifying behaviour through an appropriate stimulus-response mechanism (Kazdin, 1975). However, \nlearning does not necessarily equate to observable changes in behaviour. In particular, the separation \nbetween learning and performance can be large, with changes in behaviour being far removed from the \ninformation that produced the change (Vandenbosch and Higgins, 1996). As such, cognitive learning \ntheorists argue that learning represents a change in the potential for behaviours, not necessarily a \nchange in behaviour itself (Friedlander, 1983; Huber, 1991; Lovell 1980). Learning may result in new \nand significant insights that require no immediate behavioural change, as individuals may choose not to \nreconstruct their behaviour but to change their mental models (Friedlander, 1983). Thus, in this study, \nlearning is viewed as a change in the potential behaviour (changed mental models), not a change in \nbehaviour itself. \n 6 \nsubjective, internal representations of systems of relations that can be used to support \nmanagers’ judgements, decisions and explanations (Birnberg, Luft and Shields, 2007; \nMarkman, 1999; Markman and Gentner, 2001). A manager’s mental model of \nbusiness operations relates to assumptions and expectations about how the business \noperates and knowledge of how actions, activities and outcomes are related (Kaplan \nand Norton, 1996a; Lant, Milliken and Batra, 1992; McKinnon and Bruns, 1992; \nMintzberg, 1973; Neely and Al-Najjar, 2006).2 Managers construct mental models of \nbusiness operations from their experiences and from the information that they \nencounter (Vandenbosch and Higgins, 1996). The construction and refinement of \nmanagers’ mental models involves a process whereby they are continually at work \nusing their experience, knowledge and information to scrutinise and test their mental \nmodels of the workings of the organization (Chenhall and Morris, 1993; de-Haas and \nAlgera, 2002; Mintzberg, 1973; Senge, 1990; Vandenbosch and Higgins, 1996). This \nprocess reflects the dynamic nature of mental models and the way that they change \nover time to incorporate new insights and understandings.  \nResearch in cognitive psychology and related studies in organizational settings \nindicate that this learning process can occur in two distinct yet related ways. Under \nthe first approach, termed mental model confirmation, managers receive new \ninformation that fits into their existing mental models of business operations and \nhelps them to confirm what was already held to be true (Flavell, 1963; Piaget, 1954; \nVandenbosch and Higgins, 1996). In this situation, new information and experiences \n                                                 \n2 As mental models are subjective they differ from formal scientific models in three important ways. \nIncomplete: constructing and changing mental models requires mental effort, therefore, mental models \ntend to be incomplete (Krishnan, Luft, and Shields, 2005; Markman and Gentner, 2001). Qualitative: \nindividuals do not estimate exact quantities or perform mathematical simulations, but reason about the \nrelative properties of systems, such as the direction of relations and approximate magnitudes (Krishnan, \nLuft, and Shields,2005; Markman and Gentner,2001). Substitution: mental models often substitute \nmore familiar attributes for the attributes of formal scientific models, as familiar attributes are assessed \nmore naturally and are more readily accessible for decision making (Kahneman and Frederick, 2002; \nKrishnan, Luft and Shields, 2005). \n 7 \nare added to and incorporated within managers’ existing mental models of business \noperations (Friedlander, 1983; Norman, 1982; Vandenbosch and Higgins, 1995). The \nemphasis is on the refinement, correction and extension of existing mental models \nwithin the current set of rules and norms (Argyris and Schon, 1978, Gupta et al., \n2006, March, 1991).  \nUnder the second approach, termed mental model building, managers’ mental \nmodels of business operations are rearranged, redefined and developed in order to \ninterpret and incorporate new and potentially contradictory information (Flavell, \n1963). In this situation, new information and experiences are not meaningful under \nmanagers’ existing cognitive structures such that new mental models of business \noperations are required (Festinger, 1957; Flavell, 1963; Norman, 1982; Piaget, 1954; \nVandenbosch and Higgins, 1995). Under mental model building, existing mental \nmodels are no longer appropriate for a given situation, with a focus on \nexperimentation and the development of new alternatives, rules and norms (Argyris \nand Schon, 1978; Gupta et al., 2006, March, 1991). \nOver time managers engage in both mental model confirmation and mental \nmodel building to ensure successful performance (Gupta et al., 2006; March, 1991). \nMental model confirmation aids managers’ efficiency and productivity by using \nexisting mental models of business operations to identify and solve problems (March, \n1991; Vandenbosch and Higgins, 1995). Mental model building helps promote \nflexibility, creativity and innovation, which is particularly important in helping \nmanagers to deal with uncertain and ambiguous situations (March, 1991; \nVandenbosch and Higgins, 1995). Although both learning processes are important, \nmental model confirmation is the more likely behaviour because mental model \nbuilding is much riskier, involving new ideas, routines and ways of thinking (March, \n 8 \n1991; Quinn, 1980; Vandenbosch and Higgins, 1996). Furthermore, theories of \ncognitive dissonance indicate a tendency for individuals to selectively perceive \nenvironmental cues so as to confirm existing mental models (Festinger, 1957). \n \n2.2. Management control systems and mental model development \n \nThere is much debate in the literature regarding the role for MCS in the \nlearning process. One line of argument suggests that rather than helping managers to \nlearn, MCS impede the learning process (Argyris, 1977; Hedberg and Jonsson, 1978; \nStaw and Boettger, 1990). In contrast, MCS are also claimed to help managers to \nlearn by promoting curiosity and the questioning of existing rationales (Chenhall, \n2005; Henri, 2006; Kaplan and Norton, 1996b).  \nAn issue that has received limited attention in these debates is the \ncharacteristics of MCS that are expected to help or hinder the development of \nmanagers’ mental models. It is likely that some types of information from MCS \nwould be very helpful in confirming and building managers’ mental models of \nbusiness operations, whereas other types of information would not. In particular, more \ncontemporary performance measurement systems seek to provide managers with \nmore extensive feedback about the organization’s operations and performance \n(Burney et al., 2009; Chenhall, 2005; Hall, 2008). For example, systems such as the \nbalanced scorecard aim to provide a broad range of measures, often linked to strategy, \nto help facilitate the learning process. Making a distinction between the types of \nfeedback provided from MCS is important because the nature and quality of the \ninformation that managers receive effects the confirmation and building of managers’ \nmental models (Vandenbosch and Higgins, 1996). In this study the nature and quality \n 9 \nof the information that managers receive from MCS is represented by comprehensive \nPMS (Hall, 2008). A comprehensive PMS is one that provides performance measures \nthat describe important parts of the SBU’s operations and integrates measures with \nstrategy and across the value chain.  \n Below I develop hypotheses linking comprehensive PMS to mental model \nconfirmation and mental model building, and the subsequent links to managerial \nperformance. First, I argue that comprehensive PMS enhances mental model \nconfirmation (H1). Second, due to cognitive dissonance and the selective perception \nof information, I argue that comprehensive PMS is only likely to affect mental model \nbuilding under certain conditions, specifically, for managers with shorter (rather than \nlonger) organizational tenure (H2) and for managers from smaller (rather than larger) \nsized SBUs (H3). Finally, I expect mental model confirmation and mental model \nbuilding to be positively associated with managerial performance (H4, H5). Figure 1 \nprovides an overview of the theoretical model.  \n \n<insert Figure 1 here> \n \n2.3. Comprehensive PMS and mental model confirmation \n \nResearch argues that managers can use feedback from MCS to confirm their \nmental model of the organization’s operations (Chenhall and Morris, 1993; Kaplan \nand Norton, 1996b; McKinnon and Bruns, 1992; Sprinkle, 2000). McKinnon and \nBruns (1992, 206), in their field study of managers’ use of accounting information, \nfound that “as managers review their success as reported in accounting reports, they \nare continuously at work, testing and perfecting their mental model of the relationship \n 10 \nbetween activities and success as measured by the management accounting system”. \nBy describing the operations of the organization more effectively, comprehensive \nPMS can help managers to test and confirm their mental models of how activities, \noperations and performance are related. As PMS become more comprehensive, they \nprovide a wealth of empirical observations about the organization’s operations, and \nsuch observations provide the impetus for the testing and confirmation of managers’ \nmental models (Chenhall and Morris, 1993). Comprehensive PMS, through linking \nmeasures to strategy and the value chain, also provide managers with a better \nunderstanding of the business, which can help to confirm a manager’s mental model \nof business operations (McKinnon and Bruns, 1992). Research also indicates that \nmanagers can use more comprehensive performance information to verify, confirm \nand validate their beliefs about cause-and-effect relations embedded in a firm’s \nstrategy and action plan (Luft and Shields, 2001). In addition, the cause-effect \nlinkages of comprehensive PMS can help managers to clarify and confirm the \nbusiness model of the organization. As comprehensive PMS increase the amount of \ninformation that is reported to managers in the organization (Ullrich and Tuttle, \n2004), this helps managers to test and validate the extent to which their mental model \nis consistent with the reality of the organization (Argyris and Schon, 1978; Huber, \n1991). In summary, as PMS become more comprehensive, they provide more of the \nnecessary feedback and empirical observations to help managers in the process of \nmental model confirmation. This analysis leads to H1: \n \nH1: There is a positive association between comprehensive PMS and mental model \nconfirmation. \n \n 11 \n2.4. Comprehensive PMS and mental model building \n \nIn contrast to the role of comprehensive PMS in mental model confirmation, it \nis likely to be more difficult for comprehensive PMS to help the process of mental \nmodel building. This is because, as noted earlier, individuals have a tendency to \nselectively perceive environmental cues so as to reinforce existing ideas rather than \ndevelop and build new ideas and ways of thinking (Festinger, 1957). This indicates \nthat comprehensive PMS may not be able to help managers build mental models \nbecause cues that can challenge and prompt new ways of thinking are selectively \nperceived, filtered and\/or ignored and thus not taken into consideration by managers \nin their work. In effect, the information from comprehensive PMS that is likely to \nprompt mental model building (e.g., broad range of measures covering important \naspects of operations, links between measures and strategy and across the value chain) \nis ‘provided’ to managers, but not necessarily ‘received’ and incorporated into mental \nmodel building processes. This indicates that, due to managers’ propensity to \nselectively perceive information so as to reinforce existing ideas, even the most \ncomprehensive PMS is unlikely to help the process of mental model building. \nResearch does suggest, however, that managers’ tendency to selectively \nperceive information is not uniform across managers and\/or different organizational \nsettings (e.g., Bayer et al., 1997; Ashford, 1986). As such, there may be situations \nwhere information from comprehensive PMS is not filtered or ignored and thus is able \nto help in the process of mental model building. In particular, I argue that it is likely \nthat comprehensive PMS can help mental model building for managers with shorter \n(rather than longer) organizational tenure and for managers from smaller (rather than \nlarger) sized SBUs. \n 12 \nPrior research indicates that a manager’s propensity to selectively perceive \nenvironmental cues and filter information depends on the length of time a manager \nhas been working in the organization. For example, Ashford (1986) argues that \nmanagers with longer tenures in the organization are more likely to block out \ninformation and not obtain feedback because they feel that as ‘old timers’ they should \n‘know the ropes’. In this setting, extensive information seeking would undermine \ntheir standing as confident and self-assured managers. Similarly, Hambrick and \ncolleagues (Hambrick and Fukutomi, 1991; Finkelstein and Hambrick, 1996) argue \nthat as a manager’s tenure in the organization increases, information becomes more \nfinely filtered and distilled. Finally, Garg (2007) argues that as tenure increases \nmanagers tend to overlook disconfirming evidence and interpret information in ways \nthat inhibit the development of new ways of thinking.  \nThis analysis indicates that the extent to which managers overlook, not notice \nand\/or selectively interpret information (as indicated by organizational tenure) is \nlikely to affect the impact of comprehensive PMS on mental model building. \nConsistent with the above research, managers with longer organizational tenure are \nmore likely to overlook, not notice, and\/or selectively interpret information. Thus, by \nextension, such managers are more likely to overlook, not notice and\/or selectively \ninterpret information from comprehensive PMS such that comprehensive PMS has \nlittle effect on the process of mental model building. In contrast, managers with \nshorter organizational tenure are more likely to notice a wider range of information, to \nnot overlook information, and to be non-selective in interpreting information. Thus, \nby extension, such managers are less likely to overlook, not notice and\/or selectively \ninterpret information from comprehensive PMS such that comprehensive PMS has a \n 13 \ngreater effect on the process of mental model building. This analysis leads to the \nfollowing hypothesis: \n \nH2: Comprehensive PMS has a more positive effect on mental model building among \nmanagers with shorter organizational tenure compared to managers with longer \norganizational tenure.3  \n \n Prior research indicates that the effect of information contained in MCS often \ndepends on how information is used, such as in interactive or diagnostic (Simons, \n1990; Widener, 2007), formal and informal (Chenhall and Morris, 1995), or flexible \nand inflexible (Chenhall, 2003) systems. In particular, although comprehensive PMS \nprovide more information about business operations, it could be used in formal ways \nthat can inhibit managers’ more informal information gathering behaviours that are \nimportant for promoting creativity (Preston, 1986). In this way, more formal use of \ncomprehensive PMS may discourage mental model building by reaffirming old \nrationales for action, stifling innovation and novel interpretations, increasing \nadherence to what is currently defined as correct or successful performance, and \ncamouflaging insights (Argyris, 1977; 1990; Gray, 1990; Hedberg and Jonsson, 1978; \nKloot, 1997; Staw and Boettger, 1990). \nIn particular, MCS in larger firms tend to be used more formally and less \nflexibly, whereas MCS in smaller firms tend to operate more organically and \ninformally (Bruns and Waterhouse, 1975; Khandwalla, 1972; Merchant, 1981). Bruns \nand Waterhouse (1975) found that larger firms were associated with an administrative \n                                                 \n3 Following Gerdin and Greve (2004; 2008), this expectation represents a statement about the form of \nthe moderation, i.e., I expect that the impact of comprehensive PMS on mental model building will be \ndifferent in different subgroups (short vs. long organizational tenure). I expect a monotonic interaction \nbecause for managers with longer organizational tenure, they are likely to ignore information and thus \ncomprehensive PMS would have no effect on mental model building, rather than a negative effect.  \n 14 \nform of control whereas smaller firms were associated with an interpersonal form of \ncontrol. Importantly, administrative control involved more formal operating \nprocedures and rules and a perceived lack of flexibility, whereas interpersonal control \ninvolved more flexibility around interactions and discussions. In addition, Merchant \n(1981) argued that larger organizations have more formal patterns of communication, \nand found that as firms get larger, managers reported having less interpersonal \ninteractions with superiors and subordinates. \nIf larger firms’ MCS are used more formally, this may limit the extent to \nwhich even more comprehensive PMS can help managers to engage in mental model \nbuilding. In contrast, if smaller firms operate MCS in a more flexible and informal \nway, a more comprehensive PMS is more likely to help managers’ build new mental \nmodels. In this way, the ability of comprehensive PMS to help managers think \ncreatively about business operations, to challenge and question assumptions, and to \nbroaden and expand their outlook of business unit, is more difficult in situations \nwhere there are more formal procedures and rules, and less flexibility and interactions \nbetween managers.  \nFollowing this analysis, I argue that in smaller SBUs, it is likely that \ncomprehensive PMS is used in more flexible and informal ways and thus, in this \nsetting, is more likely to help the process of mental model building. In contrast, in \nlarger SBUs, it is likely that information from comprehensive PMS is used in more \nformal and less flexible ways and thus, in this setting, is likely to hinder the mental \nmodel building process. This analysis leads to the following hypothesis: \n \n 15 \nH3: Comprehensive PMS has a more positive effect on mental model building among \nmanagers from smaller sized SBUs compared to managers from larger sized SBUs.4  \n \n2.5. Mental models and managerial performance \n \nManagers who are learning can be expected to perform better than those \nmanagers who are not learning (Chenhall and Morris, 1993). Engagement in the \nlearning process helps managers to develop higher levels of insight into the \norganization’s operations than those managers who have not been learning (Chenhall \nand Morris, 1993). Learning increases a manager’s understanding of connections \nbetween the manager’s actions and outcomes (Lant, Milliken and Batra, 1992), which \nprovides the basis for improved managerial performance. \nBoth mental model confirmation and mental model building are expected to \nhave positive effects on managerial performance. The process of confirming and \nbuilding mental models of business operations can improve the manager’s ability to \nassess the organization and its environment and to respond to a variety of situations \n(Vandenbosch and Higgins, 1995; 1996). Managers who can interpret and understand \nthe state of their organizations and decision environments tend to be more successful \nin manipulating and changing operating situations to their advantage, thus increasing \ntheir performance (Hedberg, 1981). Specifically, mental model confirmation aids \nmanagers’ efficiency and productivity by using existing mental models to identify and \nsolve problems (Vandenbosch and Higgins, 1995), and helps managers to exploit their \n                                                 \n4 Following Gerdin and Greve (2004; 2008), this expectation represents a statement about the form of \nthe moderation, i.e., I expect that the impact of comprehensive PMS on mental model building will be \ndifferent in different subgroups (small vs. large sized SBUs). I expect a non-monotonic interaction \nbecause the effects of comprehensive PMS on mental model building for each sub-group are likely to \nbe opposite, i.e., a positive effect in the small SBU size subgroup and a negative effect in the large \nSBU size subgroup.  \n 16 \nexisting strengths and competencies (March, 1991). Mental model building helps to \npromote flexibility, creativity and innovation, which is particularly important in \nhelping managers to deal with uncertain and ambiguous competitive environments \n(March, 1991; Vandenbosch and Higgins, 1995). The process of challenging \nassumptions and preconceptions about how the business operates can help managers \nto formulate problems and develop a greater number of solutions (Vandenbosch and \nHuff, 1997). Importantly, building mental models helps managers to develop more \nrelevant and improved models of the organization’s operations and thus increases \nperformance (Mintzberg, 1973). Furthermore, mental model building helps managers \nto develop new approaches, procedures and systems to enhance performance (March, \n1991). Based on this discussion, it is expected that both mental model confirmation \nand mental model building will lead to improved managerial performance, resulting in \nH4 and H5. \n \nH4: There is a positive association between mental model confirmation and \nmanagerial performance. \n \nH5: There is a positive association between mental model building and managerial \nperformance. \n \n3. Research Method \n \n3.1. Sample selection and data collection \n \n 17 \nData were collected using a questionnaire administered to SBU managers \nwithin Australian manufacturing organizations.5 A list of 1000 SBU managers of \nAustralian manufacturing firms was obtained from a commercial mailing list \nprovider. Due to cost constraints, 400 managers were selected to form the sampling \nframe for the study. A four-step implementation strategy was used following the \nrecommendation of Dillman (2000); (1) telephone calls to check data accuracy6, (2) a \nquestionnaire package with cover letter, questionnaire and reply paid envelope, (3) a \nreminder postcard (sent two weeks after questionnaire package) and (4) a follow-up \nphone call (made two weeks after the reminder postcard). To encourage completion of \nthe questionnaire, participants were informed that their responses were anonymous, \npromised a summary of the results, and provided with a practitioner article on PMS as \na token incentive (Davila, 2000; Dillman, 2000). \nOf the 369 distributed questionnaires, 83 were received, which provides a \nresponse rate of 22.5%.7 The response rate is similar to those reported in recent \nsurveys of SBU managers in Australian manufacturing organizations (Baines and \nLangfield-Smith, 2003; Gordon and Sohal, 2001; Moores and Yuen, 2001; Samson \nand Terziovski, 1999; Terziovski and Sohal, 2000), and is considered within \nacceptable limits.8 Due to the relatively low response rate, several tests of non-\n                                                 \n5 This paper uses the same data set as Hall (2008).  \n6 The contact details of 31 of the 400 SBU managers could not be confirmed because they had ceased \nemployment with the contact organization, the phone number was disconnected or did not answer, or \nthe organization had ceased operations. As such, the questionnaire was sent to 369 SBU managers. \n7 16 cases contained missing data: 14 cases with one item missing, one case with two items missing, \nand one case with four items missing. Little’s MCAR test revealed that the missing data were missing \ncompletely at random (MCAR) (chi-square=4.424, degrees of freedom=516, p>0.10). As the missing \ndata is MCAR, any imputation method can be used (Hair et al. 1998). As such, the data were replaced \nusing the expectation-maximisation (EM) method in SPSS. The EM approach is an iterative two-stage \nprocess where the E-stage makes the best estimates of the missing data and the M-stage makes \nparameter estimates assuming the missing data are replaced. This occurs in an iterative process until \nthe changes in the estimated parameters are negligible and the missing values are replaced (Hair et al. \n1998; Little and Rubin, 1987). This process resulted in a complete data set of 83 responses. \n8 Baruch (1999) reports an average (standard deviation) response rate for surveys of top managers of \n35.5% (13.3%). As Baruch (1999) recommends, the response rate in this study of 22.5% is within one \nstandard deviation of the average. \n 18 \nresponse bias were conducted. First, the industry representation and SBU size of the \n83 respondents was compared to the original list of 1000 SBUs. A chi-square test \nshows that the proportion of SBUs in each industry category is not significantly \ndifferent between the sample SBUs and original list SBUs (chi-square=5.981, degrees \nof freedom=8, p>0.10). In addition, an independent samples t-test shows that the \nmean sample SBU size (X-bar=336.13) is not significantly different from the mean \noriginal list SBU size (X-bar=566.93) (t=1.400, p>0.10). Second, early respondents \n(first 20%) were compared to late respondents (last 20%), with results (not reported) \nshowing that there are no significant differences for any variables. Finally, the follow-\nup phone calls were used to discuss with approximately 40 non-respondents their \nreason(s) for not completing the questionnaire. These reasons were receiving too \nmany surveys, time pressures, and company policy not to respond to voluntary \nsurveys, which are similar to the reasons for non-response reported in other studies \n(for example, Baines and Langfield-Smith, 2003; Chenhall, 2005; Subramaniam and \nMia, 2003). Together, these tests indicate that there is no significant non-response \nbias in the sample. I also examined the extent of common method bias using \nHarman’s one-factor test on the 25 survey questions used to form the constructs. The \nunrotated factor solution yielded six factors with eigenvalues>1.0. The first factor \nexplained 30% of the total variance. Overall, these results indicate the absence of \nsignificant single-source bias (Podsakov & Organ, 1986; Widener, 2007; Burney et \nal., 2009). \nDemographic information was collected from respondents regarding tenure in \ncurrent position, tenure in company, age, gender, SBU size (number of employees), \nand main manufacturing industry. Table 1 reports the descriptive statistics. The \naverage age of respondents was 46.84 years with an average time of employment in \n 19 \ntheir current position of 5.14 years and in their organization for 10.64 years. Average \nSBU size was 336.13 employees. Eighty-two respondents were male and one was \nfemale. Table 2 reports the manufacturing industry classification of respondents’ \nSBUs.  \n \n<Insert Table 1 here> \n<Insert Table 2 here> \n \n3.2. Variable measurement \n \nThe development of the questionnaire involved a review by three management \naccounting academics with experience in survey design. The questionnaire was also \npilot tested with four SBU managers, who completed the questionnaire and \nparticipated in a brief interview. The review process and the pilot test resulted in \nminor changes to the wording of some items and the layout of the questionnaire. \nMental models: due to the paucity of research examining mental models, new \nscales were developed to measure mental model confirmation and mental model \nbuilding. The items were developed by drawing on descriptions of each construct \nfrom the literature on mental models and learning (Huber, 1991; March, 1991; \nMarkman and Gentner, 2001; Norman, 1982; Vandenbosch and Higgins, 1995). As \nnoted above, three academics and four SBU managers reviewed the items for clarity \nand consistency, with only minor changes to the items from this process. The seven-\nitem scale is shown in Table 3, Panel A. Three items relate to mental model \nconfirmation and address the way in which a manager’s mental model of his\/her \nbusiness unit is confirmed and maintained (MM1-MM3). Four items relate to mental \n 20 \nmodel building and address the way in which a manager’s mental model of his\/her \nbusiness unit is questioned and developed (MM4-MM7). Respondents were asked to \nindicate on a 7-point Likert scale (1 = strongly disagree to 7 = strongly agree) the \nextent to which they agreed or disagreed with each statement. \nAn exploratory factor analysis was used to examine the dimensionality of the \nscale. Two factors are expected to emerge corresponding to the two mental model \ncomponents. The results of the factor analysis of the seven items are shown in \nTable 3, Panel B. Two factors are extracted, with items MM4, MM5 and MM7 \nloading on the first factor, and items MM1 and MM2 loading on the second factor. \nItems MM3 and MM6 load on both factors, therefore, these two items were deleted \nand the factor analysis re-run, with the results reported in Table 3, Panel C. This \nshows that all items load on the appropriate factors. As such, I construct a mental \nmodel confirmation scale, which comprises items MM1 and MM2, and a mental \nmodel building scale, which comprises items MM4, MM5 and MM7. The Cronbach \n(1951) alpha for the mental model confirmation scale is 0.718, which is above \nacceptable limits (Nunnally, 1978). The Cronbach (1951) alpha for the mental model \nbuilding scale is 0.610, which, although below the conventional cut-off of 0.70, is \nabove the limit of 0.60 suggested by Hair et al. (1998) for the development of new \nscales. The reliability and validity of the mental model confirmation and mental \nmodel building scales are further assessed in the PLS measurement model. \nComprehensive performance measurement systems: is measured with the nine-\nitem scale developed by Hall (2008). This scale measures the extent to which a PMS \ndescribes the important parts of the SBU’s operations and integrates measures with \nstrategy and across the value chain. Respondents were asked to indicate a 7-point \nLikert scale (1=not at all to 7=to a great extent) the extent to which each of the nine \n 21 \ncharacteristics was provided by their business unit’s PMS. Results from Hall (2008) \nshow that the comprehensive PMS scale is unidimensional and exhibits satisfactory \nreliability and validity. \nManagerial performance: is measured by a self-rated nine-item scale \ndeveloped by Mahoney, Jerdee and Carroll (1965). This scale was used because it was \nnot possible to obtain supervisor ratings of managers’ performance as respondents are \nanonymous. The scale assesses managerial performance along eight dimensions \nrelated to planning, investigating, coordinating, evaluating, supervising, staffing, \nnegotiating and representing, and also includes an overall assessment of performance. \nRespondents were asked to indicate on a 7-point Likert scale (1=well below average \nto 7=well above average) the extent to which their performance was below average or \nabove average on each item. The Mahoney et al. (1965) scale is frequently used to \nmeasure managerial performance in accounting studies (Chalos and Poon, 2000; \nChong and Chong, 2002; Marginson and Ogden, 2005; Otley and Fakiolas, 2000; \nParker and Kyj, 2006; Wentzel, 2002), with researchers arguing that self-report \nmeasures of performance are valid and tend to exhibit less bias than supervisor ratings \n(Dunk, 1993; Marginson and Ogden, 2005; Parker and Kyj, 2006), and that self-rated \nsubjective measures of subordinate performances are highly correlated with superiors’ \nsubjective ratings of subordinate performance and objective measures of subordinate \nperformance (Furnham and Stringfield, 1994; Heneman, 1974; Venkatraman and \nRamanujam, 1987). The reliability and validity of the scales is also examined in the \nPLS measurement model.9 \n                                                 \n9 Following Bisbe et al. (2007), it is important to analyse whether constructs are reflective or formative. \nIn reflective models, indicators are manifestations of an underlying construct whereas in formative \nmodels indicators are constituent facets of a construct. Table 1 from Bisbe et al. (2007: 801) provides \nguidelines to determine whether indicators are formative or reflective. For this study, I conclude that \nthe constructs (comprehensive PMS, mental model confirmation, mental model building, and \nmanagerial performance) are all reflective because: the indicators are reflections of the construct rather \n 22 \n   <Insert table 3 here> \n \n3.3. Partial Least Squares (PLS) regression \n \nPLS regression analysis is used to analyse the data in this study. PLS is a \nlatent variable modelling technique that incorporates multiple dependent constructs \nand explicitly recognises measurement error (Fornell, 1982) and has been used in a \nnumber of accounting studies (Anderson, Hesford and Young, 2002; Chenhall, 2005; \nIttner, Larcker and Rajan, 1997; Vandenbosch, 1999). PLS is particularly suited to \nthis study because it makes minimal data assumptions and requires relatively small \nsample sizes (Wold, 1985).10  \nPLS comprises a measurement model and a structural model. The measurement \nmodel specifies relations between observed items and latent variables. The structural \nmodel specifies relations between latent constructs. In PLS the measurement and \nstructural models are estimated simultaneously (Barclay, Thompson and Higgins, \n1995). However, the PLS model is typically interpreted in two stages. First, the \nreliability and validity of the measurement and model is assessed. Second, the \nstructural model is assessed (Barclay et al., 1995). This ensures that the constructs’ \nmeasures are reliable and valid before assessing the nature of the relations between \n                                                                                                                                            \nthan defining characteristics of the construct (e.g., for comprehensive PMS, the indicators are not \ndefining characteristics of the construct as dropping one\/some of the indicators would not alter its \nconceptual domain), they are expected to covary (e.g., higher scores on one mental model confirmation \nindicator is expected to relate to higher scores on the other indicators), they have similar content (e.g., \nthe indicators for mental model building all relate to processes of challenging, questioning and \nchanging thinking about business unit operations) and they have the same antecedents and \nconsequences (e.g., higher mental model building is expected to relate positively to all the indicators of \nmanagerial performance).  \n10 Mardia’s (1970) test of multivariate kurtosis revealed that the data are multivariate non-normal (t = \n26.076, p < 0.001). However, unlike covariance-based structural equation modelling techniques such as \nLISREL, PLS does not require normally distributed data. Because PLS is a regression based technique, \nit requires ten cases for the most complex regression (Chin, 1998; Vandenbosch, 1999). In this study, \nthe most complex regression is that with managerial performance as the dependent variable, with three \nindependent variables, suggesting a minimum sample size of 30 cases. \n 23 \nthe constructs (Barclay et al., 1995; Hair et al., 1998; Hulland, 1999). As such, the \nresults from the measurement model are presented first followed by an examination of \nthe relations between the constructs.11 \n \n4. Results \n \n4.1. Measurement model \n \nStatistics from the PLS measurement model are used to examine the \npsychometric properties of the variables. First, the factor loadings for each variable \nare examined. As shown in Table 4 all items load above 0.5 on their respective \nconstructs.12 The reliability of each variable was assessed using Fornell and Larcker’s \n(1981) measure of composite reliability. As shown in Table 5 the composite reliability \nscores for each variable are above 0.70, which demonstrates acceptable reliability \n(Nunnally, 1978). \nCronbach’s (1951) alpha statistics are also provided, with all variables scoring \nabove 0.70, except for the mental model building scale as noted earlier. Convergent \nvalidity of the variables is assessed by examining the average variance extracted \n(AVE) statistics. Table 5 shows that the AVE for each variable is 0.50 and above, \nwhich demonstrates adequate convergent validity (Chin, 1998; Hair et al., 1998). \n                                                 \n11 All PLS models were estimated using PLS Graph Version 3.0. \n12 In the initial PLS model two items from the managerial performance scale had factor loadings below \n0.5 (Hulland, 1999) (item MP7=0.466 and item MP8=0.285). I removed these two items from the scale \nas low item loadings add very little to the explanatory power of the model while potentially biasing the \nestimates of the parameters linking the constructs (Chin, 1998; Hulland, 1999). The reason for the low \nitem loadings is that MP7 and MP8 do not form part of a unidimensional managerial performance scale \n(Barclay et al. 1995). An explanatory factor analysis (oblique rotation) of the managerial performance \nscale shows two factors with eigenvalues greater than one, with items MP1-MP6 and MP9 loading on \nthe first factor, and items MP7 and MP8 loading on a second factor.  \n 24 \nThe AVE statistic is also used to assess discriminant validity by comparing the \nsquare root of the AVE statistics to the correlations among the latent variables (Chin, \n1998). This tests whether a construct shares more variance with its measures than it \nshares with other constructs (Fornell and Larcker, 1981). Table 1 shows that the \nsquare roots of the AVEs (diagonal) are all greater than the respective correlation \nbetween constructs. In addition, Table 4 shows that each item loads higher on the \nconstruct it intends to measure than on any other construct (Chin, 1998, Barclay et al., \n1995). The results of these two tests demonstrate adequate discriminant validity. \nOverall, the results from the PLS measurement model indicate that each construct \nexhibits satisfactory reliability and validity.  \n \n<Insert Table 4 here> \n<Insert Table 5 here> \n \n4.2. Tests of hypotheses \n \nTo examine the relations between the constructs a structural model is estimated \nin PLS. To partially address endogeneity concerns (Chenhall and Moers, 2007), the \nstructural model also includes job tenure as a control variable as managers with longer \ntenure in their current job are likely to have access to more information and have \ndeveloped enhanced learning capabilities. The objective of PLS is to maximise \nvariance explained rather than fit, therefore prediction-orientated measures, such as \nR2, are used to evaluate PLS models (Chin, 1998). PLS produces standardized βs for \neach path coefficient, which are interpreted in the same way as in OLS regression. As \n                                                 \n \n 25 \nPLS makes no distributional assumptions, bootstrapping (1000 samples with \nreplacement) is used to evaluate the statistical significance of each path coefficient \n(Chin, 1998).13 \n \n4.3.Comprehensive PMS, mental model confirmation and mental model building \n \nI first examine relations between comprehensive PMS, mental model \nconfirmation and mental model building. Results from the full sample are reported in \nTable 6 and show a positive association between comprehensive PMS and mental \nmodel confirmation (β=0.431, t=4.548, p<0.01), which supports H1. In contrast, as \nexpected, results show that the association between comprehensive PMS and mental \nmodel building is not statistically significant (β=0.168, t=1.247, p>0.05).  \nAs outlined in H2 and H3, it is expected that the relation between \ncomprehensive PMS and mental model building is affected by organizational tenure \nand SBU size. To examine the effect of organizational tenure on the relation between \ncomprehensive PMS and mental model building, I create two subsamples by splitting \nthe full sample at the median value of the organizational tenure variable (9 years). \nThis creates a ‘short’ organizational tenure subsample (n=42, mean tenure=4.05, \nstdev=2.77) and a ‘long’ organizational tenure subsample (n=41, mean tenure=17.37, \nstdev=6.22). I then re-estimate the structural model in both the ‘short’ and ‘long’ \norganizational tenure subsamples, as shown in Table 7. To test the hypothesis, I \nperform a t-test on the difference in regression coefficients on the comprehensive \nPMS-mental model building path between the two subsamples (Hartmann and Moers, \n1999; Gerdin and Greve, 2004; 2008). Results show that the magnitude of the \n                                                 \n13 Statistical significance is determined using the reported original PLS estimates and bootstrapped \nstandard errors.  \n 26 \nregression coefficient on the comprehensive PMS-mental model building path in the \n‘short’ organizational tenure subsample (β=0.304) is greater than the regression \ncoefficient on the comprehensive PMS-mental model building path in the ‘long’ \norganizational tenure subsample (β=0.193), however, as the difference in coefficients \nis not statistically significant (difference=0.110, t=0.340, d.f.=81, p>0.05, two-tailed \ntest), H2 is not supported.14 15 As further analysis, I also examine whether, in each \nsubgroup, comprehensive PMS helps or hinders mental model building (see Mia and \nChenhall, 1994:9; Hartmann and Moers, 1999: 307). Results show that the effect of \ncomprehensive PMS on mental model building is positive and significant in the \n‘short’ organizational tenure subgroup (β=0.304, t=1.797, p<0.05) but not significant \n                                                 \n14 I follow Eberl (2010) and use the following t-statistic to assess the statistical significance of the \ndifference in coefficients between the two models:  \n \n \n \nDistributed tm+n-2 \n \nwith \n \nPathsample1\/2 original sample estimate for the path coefficient in both subsamples respectively \nM  number of cases in sample 1 \nN  number of cases in sample 2 \ns.e.sample1\/2 standard error of the path coefficient in both subsamples respectively \n \n15 As the group comparison approach can be considered suboptimal for continuous variables (Gerdin \nand Greve, 2008; Henseler and Fassott (2010)), I also construct models to test interaction effects \ndirectly in PLS, using the procedure in Henseler and Fassott (2010) and Chin et al. (2003). Unlike \nmoderated regression analysis used in prior management accounting studies, this procedure involves \nconstructing the interaction term using the products of the indicators of the latent independent variable \nand latent moderator variable, rather than construction of product terms from the latent variables \ndirectly. Thus, the interaction term is comprised of X x M indicators, where X represents the number of \nindicators of the latent independent variable, and M represents the number of indicators of the latent \nmoderator variable. Prior to creating the products of the interaction terms, the indicators of the latent \nindependent and moderator variables are centred. In this study, to test for the interaction effect of \norganizational tenure, I estimate a PLS model with comprehensive PMS, organizational tenure, and \ncomprehensive PMS x organizational tenure interaction as independent variables, and mental model \nbuilding as the dependent variable. Following the procedure above, the interaction term comprises the \nproducts of the indicators of comprehensive PMS (X) and organizational tenure (M), resulting in (X x \nM) 9 x 1=9 indicators for the interaction term. Results from the PLS structural model show that the \npath on the interaction term is positive but not statistically significant (β=0.1891, t=0.887, p>0.05), \nwhich is consistent with the results of the group comparison approach.  \n 27 \nin the ‘long’ organizational tenure subgroup (β=0.193, t=0.790, p>0.05). This \nindicates that comprehensive PMS helps the process of mental model building for \nmanagers with a ‘short’ organizational tenure but has no effect on mental model \nbuilding for managers with a ‘long’ organizational tenure.16  \nTo examine the effect of SBU size on the relation between comprehensive PMS \nand mental model building, I first create two subsamples by splitting the full sample \nat the median value of SBU size (210 employees). This creates a ‘small’ SBU size \nsubsample (n=41, mean size=121.29, stdev=63.15) and a ‘large’ SBU size subsample \n(n=42, mean size=540.20, stdev=620.83). I then re-estimate the structural model in \nboth the ‘small’ and ‘large’ SBU size subsamples, as shown in Table 8. As above, I \ntest the hypothesis using a t-test on the difference in the regression coefficient on the \ncomprehensive PMS-mental model building path between the two subsamples. \nResults show that the magnitude of the regression coefficient on the comprehensive \nPMS-mental model building path in the ‘small’ SBU size subsample (β=0.524) is \ngreater than the regression coefficient on the comprehensive PMS-mental model \nbuilding path in the ‘large’ SBU size subsample (β=-0.219), and that the difference is \nstatistically significant (difference=0.743, t=3.417, d.f.=81, p<0.01, two-tailed test), \nthus supporting H3.17 I examine the monotonicity of this effect using the signs of the \nregression coefficients in the two-subsamples (Hartmann and Moers, 1999: 307). As \n                                                 \n16 I also perform t-tests on the difference in regression coefficients for the other paths in the model, \nwith results showing no statistically significant differences between the short and long organizational \ntenure subgroups: comprehensive PMS-mental model confirmation (difference=0.241, t=1.218, \nd.f.=81, p>0.05, two-tailed test), mental model confirmation-managerial performance \n(difference=0.239, t=1.095, d.f.=81, p>0.05, two-tailed test), and mental model building-managerial \nperformance (difference=0.208, t=0.782, d.f.=81, p>0.05, two-tailed test). \n17 Using the same procedure outlined above, to test for the interaction effect of SBU size, I estimate a \nPLS model with comprehensive PMS, SBU size, and comprehensive PMS x SBU size interaction as \nindependent variables, and mental model building as the dependent variable. The interaction term \ncomprises the products of the indicators of comprehensive PMS (X) and SBU size (M), resulting in (X \nx M) 9 x 1=9 indicators for the interaction term. Results from the PLS structural model show that the \npath on the interaction term is negative and statistically significant (β=-0.550, t=1.995, p<0.05), which \nis consistent with the results of the group comparison approach. \n 28 \nthe sign of the regression coefficient is positive in the ‘small’ SBU size subsample \nand negative in the ‘large’ SBU size subsample, this indicates a non-monotonic \ninteraction. Finally, as above, I examine the statistical significance of the \ncomprehensive PMS-mental model building path in each subsample. Results show \nthat the effect of comprehensive PMS on mental model building is positive and \nsignificant in the ‘small’ SBU size subgroup (β=0.524, t=4.132, p<0.01) and negative \nbut not significant in the ‘large’ SBU size subgroup (β=-0.219, t=-1.225, p>0.05). \nThis indicates that comprehensive PMS helps the process of mental model building \nfor managers in a ‘small’ SBU but has no effect on mental model building for \nmanagers in a ‘large’ SBU.18  \n<Insert Table 6 here> \n <Insert Table 7 here> \n <Insert Table 8 here> \n \n4.4.Mental model confirmation, mental model building and managerial performance \n \nIn relation to the effect of mental models on managerial performance, results \nfrom the full sample in Table 6 show that there is a positive association between \nmental model confirmation and managerial performance (β=0.348, t=3.196, p<0.01) \n(H4), and a positive association between mental model building and managerial \nperformance (β=0.440, t=5.006, p<0.01) (H5).19  \n                                                 \n18 I also perform t-tests on the difference in regression coefficients for the other paths in the model, \nwith results showing no statistically significant differences between the small and large SBU size \nsubgroups: comprehensive PMS-mental model confirmation (difference=0.168, t=0.919, d.f.=81, \np>0.05, two-tailed test), mental model confirmation-managerial performance (difference=0.036, \nt=0.134, d.f.=81, p>0.05, two-tailed test), and mental model building-managerial performance \n(difference=0.153, t=0.553, d.f.=81, p>0.05, two-tailed test). \n19 I also analyse the statistical significance of the indirect effects in the full sample model using a \nbootstrapping procedure. Common techniques used to test for indirect effects include the Sobel test and \nthe three-step procedure of Baron and Kenny (1986). However, recent research in the methodological \nliterature indicates that bootstrapping is often the preferred approach because the more common \ntechniques are only robust under large sample sizes and\/or for data that follows a multivariate normal \ndistribution (see, for example, Preacher and Hayes, 2004; 2008; Mackinnon et al. 2004). Following \n 29 \nThe above analysis supports the expectation that both mental model \nconfirmation and mental model building have independent, positive associations with \nmanagerial performance. In practice, however, managers will be engaged in both \nforms of mental modelling at the same time. Thus, in this setting, it is of interest to \nexamine the managerial performance effects from different levels of mental model \nconfirmation and mental model building. Based on the discussion for H4 and H5, it is \nlikely that highest managerial performance would occur when both mental model \nconfirmation and mental model building are high, and lowest performance would \noccur when mental model confirmation and mental model building are low.  \nFollowing the same procedure as above for testing interaction effects, I estimate \na PLS model with mental model confirmation, mental model building, and mental \nmodel confirmation x mental model building interaction as independent variables, and \nmanagerial performance as the dependent variable.20 Results from the PLS structural \nmodel show that the path on the interaction term is negative and statistically \nsignificant (β=-2.17, t=1.920, p<0.05). To further investigate the nature of the \ninteraction, I used median splits to create ‘low’ and ‘high’ subgroups for both mental \nmodel confirmation and mental model building, and then examine differences in the \nmean managerial performance scores for each of the four subgroups, as shown in \n                                                                                                                                            \nthis, as the sample in this study is relatively small and the data does not follow a multivariate normal \ndistribution, the bootstrapping approach is more appropriate. For each of the 1000 bootstraps, I \nmultiply the estimated coefficients for each direct path to calculate an estimated coefficient for the \nindirect effect (e.g., multiply comprehensive PMS-mental model confirmation path coefficient by the \nmental model confirmation-managerial performance path coefficient for each of the 1000 bootstraps). I \ndetermine statistical significance by rank-ordering the 1000 indirect effect coefficients and examine the \npercentage above (for negative effects)\/below (for positive effects) zero (for a more comprehensive \ndescription of this procedure, see Preacher and Hayes (2008: 883-884), and, for an example in the \naccounting literature, see Hall and Smith (2009)). Results show that the comprehensive PMS-mental \nmodel confirmation-managerial performance path is significant (mean indirect effect=0.160, p=0.003). \nIn contrast, the comprehensive PMS-mental model building-managerial performance path is not \nsignificant (mean indirect effect=0.081, p=0.102). \n20 Following the procedure above, the interaction term comprises the products of the indicators of \nmental model confirmation (X) and mental model building (M), resulting in (X x M) 2 x 3=6 indicators \nfor the interaction term. For the sake of brevity, the full results of the PLS models using interaction \nterms have not been reproduced but are available from the author upon request. \n 30 \nTable 9. As expected, lowest performance occurs where both mental model \nconfirmation and mental model building are low (Cell A), with the mean score in \nCell A significantly lower than the mean scores in all other subgroups (all t>2.644).21 \nContrary to expectations, highest performance occurs where mental model \nconfirmation is low and mental model building is high (Cell C). However, a \ncomparison of the mean scores in Cells B, C and D reveals they are not statistically \ndifferent from each other (all t<2.644). Overall, this analysis indicates that managerial \nperformance is highest where either (or both) mental model confirmation and mental \nmodel building is high (Cells B, C and D), and managerial performance is lowest \nwhen both mental model confirmation and mental model building are low (Cell A). \nThis suggests that for managers with low levels of both mental model confirmation \nand mental model building, performance can be enhanced by developing capabilities \nto engage in further mental model confirmation and further mental model building.22  \n \n<insert Table 9> \n \n5. Discussion \n \n                                                 \n21 Using Dunn’s (Bonferonni) test, the critical t-value for experiment-wide α=0.05 is 2.644 (6 \ncomparisons).  \n22 To ensure the results are robust to the specification of different mediators, I also test a model that \nincludes mental model confirmation and mental model building in the model tested in Hall (2008). \nThat is, I estimate a structural model in PLS with the following variables: comprehensive performance \nmeasurement systems, role clarity, psychological empowerment, mental model confirmation, mental \nmodel building and managerial performance. The results from this model for the mental model variable \npaths are qualitatively similar to those reported in Table 6, i.e., the paths from comprehensive PMS to \nmental model confirmation (β=0.427, t=4.307, p<0.01), mental model confirmation to managerial \nperformance (β=0.233, t=2.449, p<0.01), and mental model building to managerial performance \n(β=0.263, t=3.099, p<0.01) are positive and significant, and the path from comprehensive PMS to \nmental model building is not significant (β=0.169, t=1.351, p>0.05). Further, the results concerning the \nestimated paths between comprehensive PMS, role clarity, psychological empowerment and \nmanagerial performance are qualitatively similar to those reported in Hall (2008). Given space \nlimitations, the full results of this model are not reported, but are available from the author upon \nrequest.  \n 31 \nThis study examined relations among comprehensive PMS, two \n types of learning (mental model confirmation and mental model building), and \nmanagerial performance. Findings indicate that a more comprehensive PMS can help \nmanagers to engage in learning processes related to mental model confirmation. This \nresult points to the way in which a more comprehensive PMS, through describing the \noperations of the business more effectively, provides managers with the necessary \nfeedback to verify and confirm their mental models of business operations.  \nIn contrast, findings show that a more comprehensive PMS can help managers to \nbuild new mental models of business unit operations, but only in specific settings, that \nis, for managers with a short organizational tenure and\/or from a small-sized strategic \nbusiness unit. This finding helps to further our understanding of the tension between \nthose who argue that formal systems, like comprehensive PMS, stifle innovation and \nnew ways of thinking (e.g., Hedberg and Jonsson, 1978; Preston, 1986; Staw and \nBoettger, 1990) and those who argue that BSC-like systems can generate ‘double-\nloop’ learning effects (e.g., Kaplan and Norton, 1996). Although preliminary, the \nfindings indicate that the effect of MCS, like comprehensive PMS, on mental model \nbuilding is neither uniformly constraining or enabling, but depends on particular \ncharacteristics of managers and on how information from MCS is used. This indicates \nthat neither of the above arguments is correct, insofar as MCS can help and hinder the \nlearning process in particular situations. As such, much can be gained from a more \nnuanced and context-specific examination of how particular MCS characteristics can \nhelp or hinder the development of mental models.  \nResults related to mental models and managerial performance indicate that \nboth mental model confirmation and mental model building have strong positive \nassociations with managerial performance. This is consistent with the benefits that \n 32 \nflow from increased mental model confirmation, such as greater exploitation of \nexisting strengths and competencies, and benefits from increased mental model \nbuilding, such as greater flexibility, innovation and creativity (March, 1991; \nVandenbosch and Higgins, 1995). Given the strong effect of both mental model \nconfirmation and mental model building on managerial performance, the study \nindicates that much can be gained from investigating how aspects of MCS may help \nto develop these two types of managers’ learning capabilities.  \nThe results of the study contribute to the literature in several ways. The \nfindings shed light on the process of knowledge generation and learning at the \nmanagerial (individual) level. This contributes to the emerging body of literature that \nexamines how particular cognitive and motivational mechanisms explain the effects \nof PMS on performance (Hall, 2008; Burney and Widener, 2007; Burney et al., 2009), \nas well as research that examines links between MCS and learning processes in \norganizations more broadly (Chenhall, 2005; Henri, 2006; Kloot, 1997; Widener, \n2007). Using theories of learning from cognitive psychology, the study identified two \ndifferent yet related learning processes, mental model confirmation and mental model \nbuilding. By identifying two key dimensions of managers’ learning processes, the \nstudy provides a conceptual advance in our understanding of the effects of MCS on \ndifferent types of learning processes. Such an approach is also consistent with \nrecommendations to pay careful attention to the conceptual specification of constructs \nin theory-based management accounting research (Bisbe, Batista-Foguet and \nChenhall, 2007). The study also responds to calls to investigate how specific attributes \nof MCS affect learning (Otley, 1999; Shields, 1997) by identifying a key element of \nMCS, comprehensive PMS, which facilitates the learning process. \n 33 \nThe study is subject to several limitations. The study presents statistical \nassociations that are consistent with the theory developed in the paper. However, such \nassociations present necessary but not sufficient conditions for proof of causal \nrelationships among the variables in the model. Job tenure was included in the \nanalysis to partially address endogeneity concerns; however, it is possible that there \nare other correlated variables that were omitted from the model. Although several \ntests indicate an absence of non-response bias, the relatively low response rate is a \nlimitation of the study. Finally, there are issues related to variable measurement. \nAlthough managers are considered the best judges of their own performance \n(Brownell, 1995), future research would benefit from confirmation of managers’ \nratings using supervisor ratings, if possible within the research design. The measures \nused for mental model confirmation and mental model building were novel and \nseveral items from the original instrument were discarded due to reliability concerns. \nThus, further research is needed to refine and validate this instrument. Finally, \norganizational tenure and SBU size were used as proxies for the extent to which \nmanagers selectively perceive information and the way that comprehensive PMS are \nused.  Future research would benefit from the use of instruments to measure these \nunderlying constructs more directly.  \nThe study points to several avenues for future research. As the results of the \nstudy show that MCS can affect learning at the managerial level, there is wide scope \nto investigate how other characteristics of MCS, such as different forms of cost \ninformation or different elements of the levers of control framework (Simons, 1995; \nWidener, 2007), relate to mental model confirmation and mental model building. In \nparticular, the strong effect of mental model building on managerial performance \nindicates that much can be gained by examining how elements of MCS may be able to \n 34 \nfacilitate the building of managers’ mental models. Prior research indicates that the \npropensity of managers to learn from information provided by MCS is influenced by \ndifferent types of incentive contracts (Sprinkle, 2000). As such, future research could \ninvestigate how feedback from more contemporary MCS, like comprehensive PMS, is \nrelated to learning processes under different incentive arrangements. A further avenue \nfor future research is to consider how the personal styles and preferences for different \nmanagers may affect the role of MCS in facilitating learning. For example, \ndifferences in learning preferences or cognitive styles are likely to influence whether \nand how managers use MCS in learning processes (Cheng, Luckett and Schulz, 2003; \nChenhall and Morris, 1991). Further research could also examine how other variables, \nsuch as different strategies, levels of uncertainty, and the need for innovation effect \nthe way in which comprehensive PMS relates to mental model building. Finally, this \nstudy examined the relation between MCS and learning processes among SBU \nmanagers from manufacturing firms. Thus, investigation of how MCS help or hinder \nlearning in more knowledge-intensive firms (e.g., Ditillo, 2004) represents a \npromising line of inquiry. \n \nTable 1 \nDescriptive statistics and correlations \n   \nCorrelations       \nVariable Mean Standard \nDeviation \nCPMS MMC MMB MP Job \nTenure \nOrganiza\ntional \ntenure \nAge SBU \nsize \nCPMS 4.657 1.289 0.840        \nMMC 5.175 0.794 0.443** 0.883       \nMMB 5.490 0.805 0.153 0.278* 0.750      \nMP 5.405 0.610 0.322** 0.447** 0.531** 0.707     \nJob Tenure (years) 5.14 5.95 0.123 0.171 -0.072 0.043 -    \nOrganizational tenure (years) 10.64 8.37 0.220* 0.071 -0.152 0.000 0.477** -   \nAge (years) 46.84 8.38 0.180 0.204 0.098 0.069 0.453** 0.371** -  \nSBU size (no. of  employees) 336.13 497.03 0.033 -0.052 0.082 0.025 -0.067 0.180 0.017 - \nn=83 \n*p<0.05, **p<0.01 (two-tailed) \nCPMS – comprehensive performance measurement system, MMC – mental model confirmation, MMB- mental model building, MP – managerial \nperformance \nDiagonal elements are the square roots of the AVE statistics. Off-diagonal elements are the correlations between the variables calculated in SPSS \n \n \n 36 \nTable 2 \nManufacturing industry classification \nANZSICa Manufacturing industry classification Frequency % \n21 – Food, beverage and tobacco 8 9.64 \n22 – Textile, clothing, footwear and leather 3 3.61 \n23 – Wood and paper products 6 7.23 \n24 – Printing, publishing and recorded media 3 3.61 \n25 – Petroleum, coal, chemical and associated products 12 14.46 \n26 – Non-metallic mineral products 4 4.82 \n27 – Metal products 11 13.25 \n28 – Machinery equipment 25 30.12 \n29 – Other 11 13.25 \nTotal sample 83 100 \na ANZSIC – Australia and New Zealand Standard Industrial Classification \n \n \n                                                 \n \n 37 \nTable 3 \nMental model scale items and factor analysis  \n  \nPanel A: Items  \nMental Model Confirmation  \nMy beliefs about the operations of my business unit are regularly confirmed and \nsupported \nMM1 \nMy views about the operating situation of my business unit are often maintained and \nvalidated \nMM2 \nI regularly verify my assumptions about the operations of my business unit MM3 \nMental Model Building  \nI regularly challenge and question my assumptions about the way my business unit \noperates \nMM4 \nI often think creatively about the operations of my business unit MM5 \nI often change and re-orient my thinking about the way my business unit operates MM6 \nI continually broaden and expand my outlook of my business unit MM7 \n  \nPanel B: Factor analysis of all mental model scale items  \nItem Factor loadings \n MMB MMC \nMM1 -0.003 -0.829 \nMM2 0.175 -0.792 \nMM3 0.523 -0.511 \nMM4 0.643 -0.112 \nMM5 0.621 -0.086 \nMM6 0.602 0.471 \nMM7 0.795 -0.042 \n   \nEigenvalue 2.618 1.390 \n% variance explained 37.395% 19.860% \n \nPanel C: factor analysis of mental model items – MM3 and MM6 removed \nItem Factor loadings \n MMB MMC \nMM1 -0.125 -0.930 \nMM2 0.185 -0.818 \nMM4 0.727 0.014 \nMM5 0.692 -0.082 \nMM7 0.818 0.054 \n   \nEigenvalue 2.100 1.189 \n% variance explained 42.00% 23.78% \n   \nn=83   \nMMB – mental model building, MMC – mental model confirmation \n \n \n 38 \nTable 4 \nFactor loadings from PLS measurement model \nItem CPMS MMC MMB MP \nCPMS1 0.919 0.430 0.207 0.319 \nCPMS2 0.777 0.325 0.082 0.238 \nCPMS3 0.837 0.328 0.146 0.303 \nCPMS4 0.802 0.255 0.163 0.200 \nCPMS5 0.904 0.467 0.111 0.241 \nCPMS6 0.852 0.331 0.166 0.313 \nCPMS7 0.860 0.363 0.124 0.251 \nCPMS8 0.738 0.335 0.058 0.251 \nCPMS9 0.851 0.456 0.116 0.251 \nMM1 0.443 0.855 0.143 0.287 \nMM2 0.355 0.909 0.357 0.540 \nMM4 0.112 0.201 0.713 0.372 \nMM5 0.109 0.255 0.751 0.435 \nMM7 0.131 0.206 0.785 0.407 \nMP1 0.261 0.324 0.346 0.652 \nMP2 0.219 0.293 0.309 0.577 \nMP3 0.246 0.262 0.333 0.708 \nMP4 0.185 0.392 0.373 0.718 \nMP5 0.220 0.244 0.435 0.749 \nMP6 0.268 0.424 0.442 0.743 \nMP9 0.167 0.408 0.414 0.782 \nCPMS – comprehensive performance measurement system, MMC – mental model \nconfirmation, MMB – mental model building, MP – managerial performance. \nn=83 \n 39 \nTable 5 \nReliability and average variance extracted (AVE) statistics \nVariable Cronbach Alpha Composite \nReliability \nAVE \nCPMS 0.946 0.955 0.705 \nMMC 0.718 0.876 0.779 \nMMB 0.610 0.794 0.562 \nMP 0.824 0.874 0.500 \nn=83 \nCPMS – comprehensive performance measurement system, MMC – mental model \nconfirmation, MMB – mental model building, MP – managerial performance \n 40 \nTable 6 \nFull sample PLS structural model results: path coefficients, t statistics and R2 \n Independent \nVariables \n    \nDependent \nVariables \nComprehensive \nPMS \nMental \nModel \nConfirmation \nMental \nModel \nBuilding \nJob \ntenure \nR2 \n \nComprehensive -   0.121 0.015 \nPMS  - - (1.325) \nMental Model 0.431   0.115 0.268 \nConfirmation (4.548**) - - (1.378) \nMental Model 0.168   -0.097 0.034 \nBuilding (1.247) - - (1.125) \nManagerial - 0.348 0.440 0.023 0.410 \nPerformance  (3.196**) (5.006**) (0.280) \nn=83 \nEach cell reports the path coefficient (t-value). \n*p<0.05, **p<0.01 – one-tailed tests. \nBlank cells indicate the path was not tested in the PLS model. \n \n \n                                                 \n \n \n 41 \nTable 7 \nShort vs. long organizational tenure PLS structural model results: path coefficients, t statistics and R2 \nPanel A: Short organizational tenure (n=42) \n Independent \nVariables \n    \nDependent \nVariables \nComprehensive \nPMS \nMental Model \nConfirmation \nMental Model \nBuilding \nJob Tenure R2 \n \nComprehensive -   0.214 0.049 PMS  - - (1.637) \nMental Model  0.348 - - 0.047 0.131 Confirmation (1.946)*   (0.365) \nMental Model  0.304 - - -0.234 0.116 Building (1.797)*   (-2.022)* \nManagerial  - 0.199 0.614 0.205 0.529 Performance  (1.405) (5.313)** (1.639) \n \nPanel B: Long organizational tenure (n=41)  \n Independent \nVariables \n    \nDependent \nVariables \nComprehensive \nPMS \nMental Model \nConfirmation \nMental Model \nBuilding \nJob Tenure R2 \n \nComprehensive  -   -0.026 0.001 PMS  - - (0.196) \nMental Model 0.589 - - 0.255 0.404 Confirmation (6.792)**   (2.231)* \nMental Model 0.193 - - 0.054 0.040 Building (0.790)   (0.409) \nManagerial - 0.438 0.406 -0.069 0.429 Performance  (2.574)** (1.653)* (0.435) \n \nEach cell reports the path coefficient (t-value). \n*p<0.05, **p<0.01 – one-tailed tests \nBlank cells indicate the path was not tested in the PLS model. \nTo create sub-samples of short and long organizational tenure, the full sample was split at the median \nnumber of years in the organization of 9 years. \n \n \n \n                                                 \n \n \n \n 42 \nTable 8 \nSmall vs. large business units PLS structural model results: path coefficients, t statistics and R2 \n \nPanel A: Small SBUs (n=41) \n Independent \nVariables \n    \nDependent \nVariables \nComprehensive \nPMS \nMental Model \nConfirmation \nMental Model \nBuilding \nJob Tenure R2 \n \nComprehensive -   0.096 0.009 PMS  - - (0.696) \nMental Model  0.538 - - 0.315 0.421 Confirmation (4.970)**   (2.872)** \nMental Model  0.524 - - -0.028 0.272 Building (4.132)**   (0.265) \nManagerial  - 0.410 0.528 -0.126 0.609 Performance  (2.991)** (4.787)** (1.321) \n \nPanel B: Large SBUs (n=42)  \n Independent \nVariables \n    \nDependent \nVariables \nComprehensive \nPMS \nMental Model \nConfirmation \nMental Model \nBuilding \nJob Tenure R2 \n \nComprehensive  -   0.120 0.014 PMS  - - (0.885) \nMental Model 0.370 - - -0.080 0.136 Confirmation (2.482)**   (-0.719) \nMental Model -0.219 - - -0.191 0.045 Building (-1.225)   (-1.308) \nManagerial - 0.374 0.375 0.237 0.306 Performance  (1.684)* (1.471) (1.170) \n \nEach cell reports the path coefficient (t-value). \n*p<0.05, **p<0.01 – one-tailed tests \nBlank cells indicate the path was not tested in the PLS model. \nTo create sub-samples of small and large SBUs, the full sample was split at the median number of \nemployees in business unit of 210. \n \n                                                 \n \n \n \n 43 \nTable 9 \nTwo-way interaction of mental model confirmation and mental model building-mean scores of \nmanagerial performance \n \n  Mental model confirmation \n  Low High \n \n \nMental \nmodel \nbuilding \nLow \nA \nX=4.942 \nSD=0.439 \nn=31 \nB \nX=5.592 \nSD=0.745 \nn=10 \nHigh \n \nC \nX=5.757 \nSD=0.461 \nn=13 \nD \nX=5.679 \nSD=0.478 \nn=29 \nEach cell reports the mean (standard deviation) managerial performance score \n \n 44 \nFigure 1 \nTheoretical model \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nH5 \nH4 \nH3 \nH2 \nH1 \nComprehensive \nPMS \nMental model \nconfirmation \nMental model \nbuilding \nManagerial \nperformance \nOrganizational \ntenure \nSBU size \n 45 \nReferences \n \nAnderson, S.W., Hesford, J.W., Young, S.M., 2002. Factors influencing the  \nperformance of activity based costing systems: a field of study of ABC model \ndevelopment time in the automobile industry. Accounting, Organizations and \nSociety 27:195-211. \nArgyris, C., 1977. Organizational learning and management information systems. \n Accounting, Organizations and Society 2:113-129. \nArgyris, C., Schon, D., 1978. Organizational learning. Reading: Addison- \n Wesley Publishing Co. \nArgyris, C., 1990. The dilemma of implementing controls: the case of managerial \n accounting. Accounting, Organizations and Society 15:503-511 \nAshford, S.J., 1986. Feedback-seeking in individual adaptation: a resources \nperspective. Academy of Management Journal 29(3), 465-487. \nBaines, A., Langfield-Smith, K. 2003. Antecedents to management accounting \n change: a structural equation approach. Accounting, Organizations and \n Society 28:675-698. \nBarclay, D., Thompson, R., Higgins. C., 1995. The partial least squares (PLS) \n approach to causal modelling: personal computer adoption and use as an \n illustration. Technology Studies 2:285-309 \nBaron, R. M., Kenny, D. A., 1986. The moderator-mediator variable distinction in \nsocial psychological research: Conceptual, strategic and statistical \nconsiderations. Journal of Personality and Social Psychology, 51, 1173-1182. \nBaruch, Y., 1999. Response rate in academic studies – a comparative analysis. \n Human Relations 52:421-438. \nBeyer, J.M., Chattopadhyay, P., George, E., Glick, W.H., Pugliese, D., 1997. The \nSelective Perception of Managers Revisited. The Academy of Management \nJournal, 40(3), 716-737. \nBirnberg, J. G., Luft, J., Shields, M.D., 2007. Psychology theory in management \naccounting research. In: Chapman, C.S, Hopwood, A.G., Shields, M.D.,  \nHandbook of Management Accounting Research, Oxford, Elsevier, 113-135. \nBisbe, J., Batista-Foguet, J., Chenhall, R.H. 2007. Defining management   \naccounting constructs: A methodological note on the risks of conceptual \nmisspecification. Accounting, Organizations and Society 32:789-820.  \nBrownell, P. 1995. Research Methods in Management Accounting. Melbourne: \n  Coopers & Lybrand. \nBruns, W.J., Waterhouse, J.J., 1975. Budgetary control and organization structure.\n Journal of Accounting Research 13:177-203. \nBurney, L.L., Widener, S.K., 2007. Strategic Performance Measurement Systems, \nJob-Relevant Information,  and Managerial Behavioral Responses — Role \nStress and Performance. Behavioral Research in Accounting, 19: 43-69. \nBurney, L.L., Henle, C.A., Widener, S.K., 2009. A path model examining the \nrelations among strategic performance measurement system characteristics, \norganizational justice, and extra- and in-role performance. Accounting, \nOrganizations and Society, 34(3-4): 305-321. \nChalos, P., Poon, M.C., 2000. Participation and performance in capital   \nbudgeting teams. Behavioral Research in Accounting 12:199-229. \nCheng M.M., Luckett, P.F., Schulz, A.K.D., 2003. The effects of cognitive style \n diversity on decision making dyads: an empirical analysis in the context of \n a complex task. Behavioral Research in Accounting 15:39-62. \n 46 \nChenhall, R.H., 2003. Management control systems design within its organizational\n  context: findings from contingency-based research and directions for the \n  future. Accounting, Organizations and Society 28127-168. \nChenhall, R.H., 2005. Integrative strategic performance measurement systems, \nstrategic alignments of manufacturing, learning and strategic outcomes: an \nexploratory study. Accounting, Organizations and Society 30:395-422. \nChenhall, R.H, Moers, F., 2007. The Issue of Endogeneity within Theory-Based, \n Quantitative Management Accounting Research. European Accounting \n  Review 16:173-195. \nChenhall, R.H., Morris, D., 1991. The effect of cognitive style and sponsorship  \nbias on the treatment of opportunity costs in resource allocation decisions.  \nAccounting, Organizations and Society 16:27-46. \nChenhall, R.H., Morris, D., 1993. The role of post completion audits, managerial \nlearning, environmental uncertainty and performance. Behavioral Research in \nAccounting 5:170- 186. \nChenhall, R.H., Morris, D., 1995. Organic decision and communication processes and \nmanagement accounting systems in entrepreneurial and conservative business \norganizations. Omega, International Journal of Management Science,  23(5), \n485–497.  \nChin, W.W., 1998. The partial least squares approach to structural equation  \nmodelling. In: Marcoulides, G.A., Modern Methods for Business Research, \nMahwah, Lawrence Erlbaum, 295-336. \nChin, W.W., Marcolin, B.L., Newsted, P.N., 2003. A partial least squares latent \nvariable modelling approach for measuring interaction effects: results from a \nMonte Carlo simulation study and an electronic-mail emotion\/adoption study. \nInformation Systems Research, 14(2), 189-217. \nChong, V.K., Chong, K.M., 2002. Budget goal commitment and informal effects of \nbudget participation on performance: a structural equation modelling \napproach. Behavioral Research in Accounting 14:65-86. \nCronbach, L.J.,1951. Coefficient alpha and the internal structure of tests. \n Psychometrika: 297-334. \nDavila, T., 2000. An empirical study on the drivers of management control systems’\n  design in new product development. Accounting, Organizations and Society\n  25:383-409. \nDe-Haas, M., Alegra, J.A., 2002. Demonstrating the effect of the strategic dialogue: \nparticipation in designing the management control system. Management \nAccounting Research 13:41-69. \nDillman, D.A., 2000. Mail and Internet Surveys: The Tailored Design Method. New\n  York: John Wiley & Sons. \nDitillo, A., 2004. Dealing with uncertainty in knowledge intensive-firms: the role of \n management control systems as knowledge integration mechanisms. \n Accounting, Organizations and Society 29:401-421. \nDunk, A.S., 1993. The effects of job-related tension on managerial performance in \nparticipative budgetary settings. Accounting, Organizations and Society \n18:575-585. \nEberl, M., 2010. An application of PLS in multi-group analysis: the need for \ndifferentiated corporate-level marketing in the mobile communications \nindustry. In: Esposito Vinzi, V., Chin, W.W., Henseler, J., Wang, H. \nHandbook of partial least squares. Heidelberg: Springer, 487-514. \nFestinger, L., 1957. A cognitive theory of dissonance. Evanston: Row Petersen.  \n 47 \nFinkelstein, S., Hambrick, D.C., 1996. Strategic Leadership: Top Executives and \nTheir Effects on Organizations, West Publishing Company,  Minneapolis.  \nFlavell, J H., 1963. The development psychology of Jean Piaget. New York: D Van\n  Nostrand. \nFornell, C., 1982. A Second Generation of Multivariate Analysis. New York: Praeger. \nFornell, C., Larcker, D.F., 1981. Evaluating structural equation models with \n  unobservable variables and measurement error. Journal of Marketing \n  Research 18:39-50. \nFriedlander, F., 1983. Patterns of individual and organizational learning. Pp. 192- 220 \nin The executive mind, edited by S Srivastva. San Francisco: Jossey-Bass  \nPublishers.  \nFurnham, A., Stringfield, P., 1994. Congruence of self and subordinate ratings of \n managerial practises as a correlate of superior evaluation. Journal of \n Occupational and Organizational Psychology 67:57-67. \nGarg, V.K., 2007. Toward resolving executive leadership paradox in punctuated \nequilibrium model of organization evoluation, working paper. \nGerdin, J., Greve, J., 2004. Forms of contingency fit in management accounting \nresearch—a critical review. Accounting, Organizations and Society 29(3-4), \n303-326. \nGerdin, J., Greve, J., 2008. The appropriateness of statistical methods for testing \ncontingency hypotheses in management accounting research. Accounting, \nOrganizations and Society, 33(7-8), 995-1009. \nGordon, J., Sohal, A.S., 2001. Assessing manufacturing plant competitiveness – an\n  empirical field study. International Journal of Operations and Production \n  Management 21:233-253. \nGray, B., 1990. The enactment of management control systems: a critique of  \nSimons. Accounting, Organizations and Society 15:145-148. \nGupta, A.K., Smith, K.G., Shalley, C.E., 2006. The interplay between exploration  \nand exploitation. Academy of Management Journal 49:693-706. \nHair, J.F., Anderson, R.E., Tatham, R.L., Black, W.C., 1998. Multivariate Data \n  Analysis. Upper Saddle River: Prentice Hall. \nHall, M., 2008. The effect of comprehensive performance measurement systems on \nrole clarity, psychological empowerment and mangerial performance. \nAccounting, Organizations and Society 33(2-3), 141-163. \nHall, M., Smith, D., 2009. Mentoring and turnover intentions in public accounting \nfirms: A research note. Accounting, Organizations and Society, 34(6-7), 695-\n704. \nHambrick, D.C, Fukutomi, G.D.S., 1991. The seasons of a CEO's tenure. The \nAcademy of Management Review 16(4), 719-742. \nHartmann, G.H., Moers, F., 1999. Testing contingency hypotheses in budgetary \nresearch: an evaluation of the use of moderated regression analysis. \nAccounting, Organizations and Society 24(4), 291-315.  \nHedberg, B., Jonsson, S., 1978. Designing semi-confusing information systems for\n  organizations in changing environments. Accounting, Organizations \n  and Society. \nHeneman, H., 1974. Comparisons of self- and superior-rating of managerial \n  performance. Journal of applied Psychology 59:638-642. \nHenri, J., 2006. Management control systems and strategy: a resource-based \n  perspective. Accounting, Organizations and Society 31:529-558. \n 48 \nHenseler, J., Fassott, G., 2010. Testing moderating effects in PLS path models: an \nillustration of available procedures. In: Esposito Vinzi, V., Chin, W.W., \nHenseler, J., Wang, H. Handbook of partial least squares. Heidelberg: \nSpringer, 713-735. \nHuber, G P., 1991. Organizational learning: the contributing process and literatures.\n  Organization Science 2:88-115. \nHulland, J., 1999. Use of partial least squares (PLS) in strategic management \nresearch: a review of four different studies. Strategic Management Journal  \n20:195-204 \nIttner, C.D., Larcker, D.F., Rajan, M.V., 1997. The choice of performance measures\n  in annual bonus contracts. The Accounting Review 72:231-255. \nKahneman, D., Frederick, S., 2002. Representativeness revisited: attribute substitution \nin intuitive judgement. In: Gilovich, T., Griffin, D., Kahneman, D. Heuristics \nand biases: the  psychology of intuitive judgement. Cambridge: Cambridge \nUniversity Press, 713-735. \nKaplan, R.S, Norton, D.P., 1996a. Translating strategy into action: the balanced  \nscorecard. Boston: Harvard Business School Press. \nKaplan, R.S, Norton, D.P., 1996b. Using the balanced scorecard as a strategic \nmanagement system. Harvard Business Review, January-February: 75-85. \nKaplan, R.S, Norton, D.P., 1996c. Strategic learning & the balanced scorecard. \nStrategy & Leadership: 18-24. \nKazdin, A.E., 1975. Behaviour modification in applied settings. Homewood, IL: \n  Dorsey Press. \nKhandwalla, P.N., 1972. The effect of different types of competition on the use  of \nmanagement controls. Journal of Accounting Research: 275-285. \nKloot, L., 1997. Organizational learning and management control systems:  \nresponding to environmental change. Management Accounting Research 8:47-\n73. \nKrishnan, R., Luft, J., Shields, M., 2005. Effects of accounting-method choices on  \nsubjective performance measure weighting: experimental evidence on \nprecision and error covariance. The Accounting Review 80:1163-1192.  \nLant, T.A., Milliken, F.J., Batra, B., 1992. The role of managerial learning and \n  interpretation in strategic persistence and reorientation: an empirical \n  exploration. Strategic Management Journal 13:585-608. \nLittle, R.J.A., Rubin, D.B., 1987. Statistical Analysis with missing Data. New \n  York: Wiley. \nLovell, R.B., 1980. Adult Learning. New York: Wiley. \nLuft, J.L., Shields, M.D., 2001. Why does fixation persist? Experimental evidence on \nthe judgement performance effects of expensing intangibles. The   \nAccounting Review 76:561-587. \nMackinnon, D.P., Lockwood, C.M., Williams, J., 2004. Confidence limits for the \nindirect effect: distribution of the product and resampling methods. \nMultivariate Behavioral Research 39(1), 99-128. \nMahoney, T.A., Jerdee, T.H., Carroll, S.J., 1965. The job(s) of management. \nIndustrial Relations: 97-110. \nMarch, J.G., 1991. Exploration and exploitation in organizational learning. \nOrganization Science 2:71-87 \nMarida, K.V., 1970. Measures of multivariate skewness and kurtosis with \napplications. British Journal of Mathematical and Statistical Psychology \n28:205-214. \n 49 \nMarginson, D., Ogden, S., 2005. Coping with ambiguity through the budget: the \npositive effects of budgetary targets on managers’ budgeting behaviours. \nAccounting, Organizations and Society 30:435-456. \nMarkman, A.B., 1999. Knowledge Representations. Mahway: Lawrence Erlbaum \nAssociates, Inc. \nMarkman, A.B, Gentner, D., 2001. Thinking. Annual Review of Psychology 52:223-\n247. \nMcKinnon, S.M., Bruns, W.J., 1992. The Information Mosaic. Boston: Harvard \nBusiness School Press. \nMerchant, K.A., 1981. The design of the corporate budgeting system: influences on \nmanagerial behaviour and performance. The Accounting Review 56:813-829. \nMia, L., Chenhall, R.H., 1994. The usefulness of management accounting systems, \nfunctional differentiation and managerial effectiveness. Accounting, \nOrganizations and Society 19(1), 1-13. \nMintzberg, H., 1973. The nature of managerial work. New York: Harper & Row. \nMoores, K., Yuen, S., 2001. Management accounting systems and \norganizationalconfiguration: a life-cycle perspective. Accounting, \nOrganizations and Society 26:351-389. \nNeely, A., Al-Najjar, M., 2006. Management learning not management control:  the \ntrue role of performance measurement. California Management Review  \n48:101-114. \nNorman, D.A., 1982. Learning and Memory. San Francisco: W H Freeman. \nNunnally, J C., 1978. Psychometric Theory. New York: McGraw Hill Book \nCompany. \nOtley, D., Fakiolas, A., 2000. Reliance on accounting performance  measures: dead \nend or new beginning?” Accounting, Organizations and Society 25:497-510. \nParker, R.J., Kyi, L., 2006. Vertical information sharing in the budget process.  \nAccounting, Organizations and Society 31:27-45. \nPiaget, J., 1954. The Construction of reality in the Child. New York: Basic Books. \nPodsakoff, P.M., Organ, D.W., 1986. Self-reports in organizational research: \nProblems and prospects. Journal of Management, 12, 531–543. \nPreacher, K.J., Hayes, A.F., 2004. SPSS and SAS procedures for estimating indirect \neffects in simple mediation models. Behavior Research Methods 36, 717-731. \nPreacher, K.J., Hayes, A.F., 2008. Asymptotic and resampling strategies for assessing \nand comparing indirect effects in multiple mediator models. Behavior \nResearch Methods 40(3), 879-891. \nQuinn, J.B., 1980. Strategies for Change: Logical Incrementalism. Homewood: Irwin. \nRomme, G., Dillen, R., 1997. Mapping the landscape of organizational learning. \nEuropean management Journal 15:68-78. \nSamson, D., Terziovski, M., 1999. The relationship between total quality management \npractices and operational performance.” Journal of Operations Management \n17:393-409. \nSenge, P., 1990. The fifth discipline: The art and practice of the learning organization. \nNew York: Doubleday\/Currency. \nShields, M. D., 1997. Research in Management accounting by North Americans in the \n1990’s. Journal of Management Accounting Research 9:3-61. \nSimons, R., 1995. Levers of Control. Boston: Harvard Business School press. \nSprinkle, G.B., 2000. The effect of incentive contracts and learning and performance. \n The Accounting Review 75:299-326. \n 50 \nStaw, B.M., Boettger, R.D., 1990. Task revision: a neglected form of work \nperformance. Academy of Management Journal 33:534-559. \nSubramaniam, N., Mia, L., 2003. A note on work-related values, budget emphasis and  \nmanagers’ organizational commitment. Management   \nAccounting Research 14:389-408. \nTerziovski, M., Sohal, A.S., 2000. The adoption of continuous improvement and \ninnovation strategies in Australian manufacturing firms.” Technovation \n20:539-550. \nUllrich, M.J., Tuttle, B.M., 2004. The effects of comprehensive information reporting \nsystems and economic incentives on managers’ time-planning decisions. \nBehavioral Research in Accounting, 16, 89–105. \nVandenbosch, B., 1999. An empirical analysis of the association between the \nexecutive support system and perceived organizational competitiveness. \nAccounting, Organization and Society 24:77-92. \nVandenbosch, B., Higgins, C.A., 1995. Executive support systems and learning: a \nmodel and empirical test. Journal of Managements Information Systems \n12:99-130. \nVandenbosch, B., Higgins, C.A., 1996. Information acquisition and mental models: an \ninvestigation into the relation between behaviour and learning. Information \nSystems research 7:198-214. \nVandenbosch, B., Huff, S.L., 1997. Searching and scanning: how executives obtain \ninformation from executive information systems. MIS Quarterly   \nMarch:81-107. \nVenkatraman, N., Ramanujam, V., 1987. Measurements of business economic \nperformance: an examination of method convergence. Journal of Management \n13:109-122. \nWentzel, K., 2002. The influence of fairness perceptions and goal commitment on \nmanagers’ performance in a budget setting. Behavioural Research in \nAccounting 14:247-271. \nWidener, S.K., 2007. An empirical analysis of the levers of control framework. \nAccounting, Organization and Society. 32:757-788. \nWold, H., 1985. Systems analysis by partial least squares. In Measuring the \nunmeasureable, edited by P Nijkamp, H Leitnet and N Wrigley. Dordrecht: \nThe Netherlands: Martinus Nijhoff. \n \n \n \n \n \n"}