{"doi":"10.5194\/angeo-23-2183-2005","coreId":"11174","oai":"oai:eprints.lancs.ac.uk:35407","identifiers":["oai:eprints.lancs.ac.uk:35407","10.5194\/angeo-23-2183-2005"],"title":"Transition from substorm growth to substorm expansion phase as observed with a radial configuration of ISTP and Cluster spacecraft","authors":["Sergeev, V.A.","Kubyshkina, M.V.","Baumjohann, W.","Nakamura, R.","Amm, O.","Pulkkinen, T.","Angelopoulos, V.","Mende, S.B.","Klecker, B.","Nagai, T.","Sauvaud, J.-A.","Slavin, J.A.","Thomsen, M.F."],"enrichments":{"references":[{"id":774478,"title":"1-dimensional upward continuation of the ground magnetic ﬁeld disturbance using spherical elementary current systems,","authors":[],"date":"2003","doi":null,"raw":"Vanhamaki, H., Amm, O., and Viljanen, A.: 1-dimensional upward continuation of the ground magnetic ﬁeld disturbance using spherical elementary current systems, Earth Planets Space, 55, 613–620, 2003.","cites":null},{"id":772549,"title":"A two-satellite study of nightside ﬂux transfer events in the plasma sheet,","authors":[],"date":"1992","doi":"10.1016\/0032-0633(92)90052-P","raw":"Sergeev, V. A., Elphic, R. C., Mozer, F. S., Saint-Marc, A., and Sauvaud, J. A.: A two-satellite study of nightside ﬂux transfer events in the plasma sheet, Planet. Space Sci., 40, 1551–1572, 1992a.","cites":null},{"id":774220,"title":"A.: A magnetospheric magnetic ﬁeld model with a warped tail current sheet,","authors":[],"date":"1989","doi":"10.1016\/0032-0633(89)90066-4","raw":"Tsyganenko, N. A.: A magnetospheric magnetic ﬁeld model with a warped tail current sheet, Planet. Space Sci., 37, 5–20, 1989.","cites":null},{"id":768472,"title":"A.: Electromagnetics of substorm onsets in the near-geosynchronous plasma sheet,","authors":[],"date":"2000","doi":"10.1029\/1999ja000424","raw":"Erickson, G. M., Maynard, N. C., Burke, W. J., Wilson, G. R., and Heinemann, M. A.: Electromagnetics of substorm onsets in the near-geosynchronous plasma sheet, J. Geophys. Res., 105, A11, 25265–25290, 2000.","cites":null},{"id":770059,"title":"Analysis of an eastward electrojet by means of upward continuation of ground-based magnetometer data,","authors":[],"date":"1979","doi":null,"raw":"Mersmann U., Baumjohann, W., Kuppers, F., and Lange, K.: Analysis of an eastward electrojet by means of upward continuation of ground-based magnetometer data, J. Geophys., 46, 281–298, 1979.","cites":null},{"id":770550,"title":"Auroral precipitation power during substorms: A Polar-UV Imagerbased superimposed epoch analysis,","authors":[],"date":"2001","doi":"10.1029\/2000ja000428","raw":"Newell, P. T., Liou, K., Sotirelis, T., and Meng, C.-I.: Auroral precipitation power during substorms: A Polar-UV Imagerbased superimposed epoch analysis, J. Geophys. Res., 106, A12, 28885–28896, 2001.","cites":null},{"id":771902,"title":"Case studies of the dynamics of ionospheric ions in the Earths magnetotail,","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":16405417,"title":"Case studies of the dynamics of ionosphericionsintheEarthsmagnetotail,","authors":[],"date":"2004","doi":null,"raw":"Sauvaud, J.-A., Louarn, P., Fruit, G., Stenuit, H., Vallat, C., Dandouras, J., R` eme, H., et al.: Case studies of the dynamics of ionosphericionsintheEarthsmagnetotail, J.Geophys.Res., 109, A1, doi:10.1029\/2003JA009996, 2004.","cites":null},{"id":774780,"title":"Correlated Interball\/ ground-gased observations of isolated substorm: The pseudo-breakup Phase,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-687-2001","raw":"Yahnin, A. G., Sergeev, V. A., Bosinger, T., Sergienko, T. I., Kornilov, I. A., Borodkova, N. L., Thomsen, M. F., Belian, R. D., Sauvaud, J.-A., Lutsenko, V. N., and Skalsky, A. A.: Correlated Interball\/ ground-gased observations of isolated substorm: The pseudo-breakup Phase, Ann. Geophys., 19, 687–698, 2001, SRef-ID: 1432-0576\/ag\/2001-19-687.","cites":null},{"id":769298,"title":"Current disruptions in the near-Earth neutral sheet region,","authors":[],"date":"1992","doi":"10.1029\/91ja02401","raw":"Lui, A. T. Y., Lopez, R. E., Anderson, B. J., Takahashi, K., Zanetti, L. J., McEntire, R. W., Potemra, T. A., Klumpar, D., Grene, E. M., and Strangeway, R.: Current disruptions in the near-Earth neutral sheet region, J. Geophys. Res., 97, 1461–1480, 1992.","cites":null},{"id":773909,"title":"Delivery of cold, dense plasma sheet material into the near-Earth region,","authors":[],"date":"2003","doi":"10.1029\/2002JA009544","raw":"Thomsen, M. F., Borovsky, J. E., Skoug, R. M., and Smith, C. W.: Delivery of cold, dense plasma sheet material into the near-Earth region, J. Geophys. Res., 108, A4, doi:10.1029\/2002JA009544, 2003.","cites":null},{"id":772754,"title":"Drifting holes in the energetic electron ﬂux at geosynchronous orbit following substorm onset,","authors":[],"date":"1992","doi":"10.1029\/92JA00182","raw":"Sergeev, V. A., Bosinger, T., Belian, R. D., Reeves, G. D., and Cayton, T. E.: Drifting holes in the energetic electron ﬂux at geosynchronous orbit following substorm onset, J. Geophys. Res., 97, 6541–6548, 1992b. Sergeev, V. A., Dmitrieva, N. P., Timofeev, E. E., Liou, K., Miyashita, Y., Mukai, T., and Pulkkinen, T.: Strong control of auroralprecipitationbyplasmasheetparametersandtheproblem ofpseudobreakups, Substorms-7, Proc.ofthe7thofIntern.Conf.","cites":null},{"id":770853,"title":"Earthward expansion of tail current disruption: Dualsatellite study,","authors":[],"date":"1998","doi":"10.1029\/98ja00013","raw":"Ohtani, S.-I.: Earthward expansion of tail current disruption: Dualsatellite study, J. Geophys. Res., 103, A4, 6815–6825, 1998.","cites":null},{"id":772939,"title":"edited by: by","authors":[],"date":"2004","doi":null,"raw":"on Substorms, edited by: by Ganushkina, N. and Pulkkinen, T., Finnish Meteorol. Inst. reports, N 2004:5, 182–185, 2004.","cites":null},{"id":16405413,"title":"et al.: Plasma sheet instability related to the westward traveling surge,","authors":[],"date":"1991","doi":"10.1029\/91ja01106","raw":"Roux, A., Perraut, S., Robert, P., Morane, A., Pedersen, A., et al.: Plasma sheet instability related to the westward traveling surge, J. Geophys. Res., 96, A10, 17697–17714, 1991.","cites":null},{"id":768330,"title":"et al.: Timing of magnetic reconnection initiation during a global magnetospheric substorm onset,","authors":[],"date":"2002","doi":"10.1029\/2002gl015539","raw":"Baker, D. N., Peterson, W. K., Eriksson, S., Li, X., Blake, J. B., et al.: Timing of magnetic reconnection initiation during a global magnetospheric substorm onset, Geophys. Res. Lett., 29, doi:10.1029\/2002GL015539, 2002.","cites":null},{"id":771100,"title":"Event study of presubstorm phases and their relation on the energy coupling between solar wind and magnetosphere,","authors":[],"date":null,"doi":"10.1016\/0032-0633(82)90043-5","raw":"Pellinen, R. J., Baumjohann, W., Heikkila, W. J., Sergeev, V. A., Yahnin, A. G., Marklund, G., and Melnikov, A. O.: Event study of presubstorm phases and their relation on the energy coupling between solar wind and magnetosphere, Planet. Space Sci., 30, 4, 371–388, 1982.","cites":null},{"id":773487,"title":"Geotail observations of magnetic ﬂux ropes in the plasma sheet,","authors":[],"date":"2003","doi":null,"raw":"Slavin, J. A., Lepping, R. P., Gjerloev, J., Fairﬁeld, D. H., Hesse, M., Owen, C. J., Moldwin, M. B., Nagai, T., Ieda, A., and Mukai, T.: Geotail observations of magnetic ﬂux ropes in the plasma sheet, J. Geophys. Res., 108, A1, doi:10.1029\/2002JA009557, 2003a. Slavin, J. A., Lepping, R. P., Gjerloev, J., Goldstein, M. L., Fairﬁeld, D. H., Acu˜ na, M. H., Balogh, A., Dunlop, M., Kivelson, M. G., Khurana, K., Fazakerley, A., Owen, C. J., R` eme, H., and Bosqued, J. M.: Cluster electric current density measurements within a magnetic ﬂux rope in the plasma sheet, Geophys. Res.","cites":null},{"id":767810,"title":"High-resolution energetic particle measurements at 6.6RE , 3, Low-energy electron anisotropies and short-term substorm predictions,","authors":[],"date":"1978","doi":"10.1029\/ja083ia10p04863","raw":null,"cites":null},{"id":16405322,"title":"High-resolution energetic particle measurements at 6.6RE, 3, Low-energy electron anisotropies and short-term substorm predictions,","authors":[],"date":"1978","doi":"10.1029\/ja083ia10p04863","raw":"Baker, D. N., Higbie, P. R., Hones, E. W., and Belian, R. D.: High-resolution energetic particle measurements at 6.6RE, 3, Low-energy electron anisotropies and short-term substorm predictions, J. Geophys. Res., 83, 4863–4868, 1978.","cites":null},{"id":772428,"title":"Impulsive reconnection in the magnetotail during substorm expansion,","authors":[],"date":"1987","doi":"10.1016\/0032-0633(87)90026-2","raw":"Sergeev V. A., Semenov, V. S., and Sidneva, M. V.: Impulsive reconnection in the magnetotail during substorm expansion, Planet. Space Sci., 35, 9, 1199–1212, 1987.","cites":null},{"id":768096,"title":"Neutral line model of substorms: Past results and present view,","authors":[],"date":"1996","doi":"10.1029\/95ja03753","raw":"Baker D. N., Pulkkinen, T. I., Angelopoulos, V., Baumjohann, W., and McPherron, R. L.: Neutral line model of substorms: Past results and present view, J. Geophys. Res., 101, 12975–13010, 1996.","cites":null},{"id":769586,"title":"Observations of dayside convection reduction leading to substorm onset,","authors":[],"date":"2003","doi":"10.1029\/2002ja009670","raw":"Lyons, L. R., Liu, S., Ruohoniemi, J. M., Solovyev, S. I., and Samson, J.C.: Observations of dayside convection reduction leading to substorm onset, J. Geophys. Res., 108, A3, doi:10.1029\/2002JA009670, 2003.","cites":null},{"id":771680,"title":"Plasma sheet instability related to the westward traveling surge,","authors":[],"date":"1991","doi":"10.1029\/91ja01106","raw":null,"cites":null},{"id":773155,"title":"Quantitative magnetotail characteristics of different magnetospheric states,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-1019-2004","raw":"Shukhtina, M. A., Dmitrieva, N. P., and Sergeev, V. A.: Quantitative magnetotail characteristics of different magnetospheric states, Ann. Geophys., 22, 1019–1032, 2004, SRef-ID: 1432-0576\/ag\/2004-22-1019. Sitnov, M. I., Sharma, A. S., Guzdar, P. N., and Yoon, P. H.: Reconnection onset in the tail of Earths magnetosphere, J. Geophys.","cites":null},{"id":772154,"title":"Sergeev et al.: Transition from substorm growth to substorm expansion","authors":[],"date":"2004","doi":null,"raw":"Semenov, V. S, Penz, T., Heyn, M. F., Ivanov, I. B., Kubyshkin,2198 V. A. Sergeev et al.: Transition from substorm growth to substorm expansion I. V., Biernat, H. K., and Ivanova, V. V.: Reconstruction of the reconnection rate from magnetic ﬁeld disturbances in an incompressible plasma, Recent Res. Devel. Plasmas, in press, 2004.","cites":null},{"id":773383,"title":"Simultaneous observations of Earthward ﬂow bursts and plasmoid ejection during magnetospheric substorms,","authors":[],"date":"2002","doi":"10.1029\/2000JA003501","raw":"J., and Sutcliffe, P. R.: Simultaneous observations of Earthward ﬂow bursts and plasmoid ejection during magnetospheric substorms, J. Geophys. Res., 107, A7, doi:10.1029\/2000JA003501, 2002.","cites":null},{"id":773707,"title":"Solar wind control of density and temperature in the near-Earth plasma sheet: WIND\/Geotail collaboration,","authors":[],"date":"1997","doi":"10.1029\/96GL04018","raw":"Terasawa, T., Fujimoto, M., Mukai T., et al.: Solar wind control of density and temperature in the near-Earth plasma sheet: WIND\/Geotail collaboration, Geophys. Res. Lett., 24, 935–938, 1997.","cites":null},{"id":769832,"title":"Statistical behavior of proton and electron auroras during substorms,","authors":[],"date":"2003","doi":"10.1029\/2002ja009751","raw":"Mende, S. B., Frey, H. U., Morsony, B. J., and Immel, T. J.: Statistical behavior of proton and electron auroras during substorms, J. Geophys. Res., 108, A9, doi:10.1029\/2002JA009751, 2003.","cites":null},{"id":767568,"title":"Statistical study of thin current sheet evolution around substorm onset,","authors":[],"date":"2004","doi":"10.1029\/2004ja010413","raw":"Asano, Y., Mukai, T., Hoshino, M., Saito, Y., Hayakawa, H., and Nagai, T.: Statistical study of thin current sheet evolution around substorm onset, J. Geophys. Res., 109, A5, doi:10.1029\/2004JA010413, 2004.","cites":null},{"id":770277,"title":"Structure and dynamics of magnetic reconnection for substorm onsets with Geotail observations,","authors":[],"date":"1998","doi":"10.1029\/97ja02190","raw":"Nagai, T., Fujimoto, M., Saito, Y., Machida, S., Terasawa, T., Nakamura, R., Yamamoto, T., Mukai, T., Nishida, A., and Kokubun, S.: Structure and dynamics of magnetic reconnection for substorm onsets with Geotail observations, J. Geophys. Res., 103, A3, 4419–4440, 1998.","cites":null},{"id":771414,"title":"Substorm-associated pressure variations in the magnetotail plasma sheet and lobe,","authors":[],"date":"1999","doi":"10.1029\/98ja02418","raw":"Petrukovich, A. A., Mukai, T., Kokubun, S., Romanov, S., Saito, Y., Yamamoto, T., and Zelenyi, L. M. : Substorm-associated pressure variations in the magnetotail plasma sheet and lobe, J. Geophys. Res., 104, A3, 4501–4514, 1999. Pulkkinen, T. I., Kubyshkina, M. V., Baker, D. N., Cogger, L. L., Kokubun, S., Mukai, T., Singer, H. J., Slavin, J. A., and Zelenyi, L. M.: Magnetotail currents during the growth phase and local auroral breakup, in: Magnetospheric current systems, edited by: Ohtani, S. Ohtani,S.-I., Fujii, R., Hesse, M., and Lysak, R.","cites":null},{"id":768749,"title":"The Kiruna conjecture: the strong version, in:","authors":[],"date":"1992","doi":null,"raw":"Kennell, C. F.: The Kiruna conjecture: the strong version, in: Substorms1, Eur.SpaceAgencySpec.Publ.SP-335, 599–602, 1992. Kubyshkina, M. V., Sergeev, V. A., and Pulkkinen, T. I.: Hybrid Input Algorithm: An event-oriented magnetospheric model, J.","cites":null},{"id":769061,"title":"Variation of the spacecraft potential in the magnetosphere,","authors":[],"date":"2002","doi":"10.1016\/s1364-6826(02)00123-2","raw":"Laakso, H.: Variation of the spacecraft potential in the magnetosphere, J. Atm. Solar-Terr. Phys., 64, 1735–1744, 2002.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-09-15","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/11174.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/35407\/1\/art_727.pdf","pdfHashValue":"d0caa0c870068ae08b944346c8f20c05a4ad55c5","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35407<\/identifier><datestamp>\n      2018-01-24T03:07:46Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Transition from substorm growth to substorm expansion phase as observed with a radial configuration of ISTP and Cluster spacecraft<\/dc:title><dc:creator>\n        Sergeev, V.A.<\/dc:creator><dc:creator>\n        Kubyshkina, M.V.<\/dc:creator><dc:creator>\n        Baumjohann, W.<\/dc:creator><dc:creator>\n        Nakamura, R.<\/dc:creator><dc:creator>\n        Amm, O.<\/dc:creator><dc:creator>\n        Pulkkinen, T.<\/dc:creator><dc:creator>\n        Angelopoulos, V.<\/dc:creator><dc:creator>\n        Mende, S.B.<\/dc:creator><dc:creator>\n        Klecker, B.<\/dc:creator><dc:creator>\n        Nagai, T.<\/dc:creator><dc:creator>\n        Sauvaud, J.-A.<\/dc:creator><dc:creator>\n        Slavin, J.A.<\/dc:creator><dc:creator>\n        Thomsen, M.F.<\/dc:creator><dc:date>\n        2005-09-15<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/35407\/1\/art_727.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-23-2183-2005<\/dc:relation><dc:identifier>\n        Sergeev, V.A. and Kubyshkina, M.V. and Baumjohann, W. and Nakamura, R. and Amm, O. and Pulkkinen, T. and Angelopoulos, V. and Mende, S.B. and Klecker, B. and Nagai, T. and Sauvaud, J.-A. and Slavin, J.A. and Thomsen, M.F. (2005) Transition from substorm growth to substorm expansion phase as observed with a radial configuration of ISTP and Cluster spacecraft. Annales Geophysicae, 23 (6). pp. 2183-2198. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35407\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-23-2183-2005","http:\/\/eprints.lancs.ac.uk\/35407\/"],"year":2005,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"Annales Geophysicae, 23, 2183–2198, 2005\nSRef-ID: 1432-0576\/ag\/2005-23-2183\n© European Geosciences Union 2005\nAnnales\nGeophysicae\nTransition from substorm growth to substorm expansion phase as\nobserved with a radial configuration of ISTP and Cluster spacecraft\nV. A. Sergeev1, M. V. Kubyshkina1, W. Baumjohann2, R. Nakamura2, O. Amm3, T. Pulkkinen3, V. Angelopoulos4,\nS. B. Mende4, B. Klecker5, T. Nagai6, J.-A. Sauvaud7, J. A. Slavin8, and M. F. Thomsen9\n1St. Petersburg State University, Petrodvoretz, 198504 St. Petersburg, Russia\n2Austrian Academy Science, Space Research Inst., Schmiedlstrasse 6, Graz, 8042, Austria\n3Finnish Meteorological Inst., Helsinki, FIN 00101, Finland\n4Univ California, Space Sciences Lab., 7 Gauss Way, Berkeley, CA 94720, USA\n5Max Planck Institut fur Extraterrestrische Physik, D-85741 Garching, Germany\n6Tokyo Inst Technology., Dept Earth & Planetary Sciences., Ookayama 2-12-1 Meguro., Tokyo, 152-8551, Japan\n7CESR, 9 Ave Colonel Roche, Toulouse Cedex 4, 31028, France\n8NASA Goddard Space Flight Center, Greenbelt, MD 20771, USA\n9Los Alamos Natl Lab., MS D466, Los Alamos, NM 87545, USA\nReceived: 29 September 2004 – Revised: 29 March 2005 – Accepted: 23 May 2005 – Published: 15 September 2005\nAbstract. Transition from the growth phase to the substorm\nexpansion during a well-isolated substorm with a strong\ngrowth phase is investigated using a unique radial (THEMIS-\nlike) spacecraft constellation near midnight, including the\nprobing of the tail current at ∼16RE with Cluster, of the\ntransition region at ∼9RE with Geotail and Polar, and of\nthe inner region at 6.6RE with two LANL spacecraft. The\nactivity development on both a global scale and near the\nspacecraft footpoints was monitored with global auroral im-\nages (from the IMAGE spacecraft) and the ground network.\nMagnetospheric models, tuned using in-situ observations, in-\ndicated a strong tail stretching and plasma sheet thinning,\nwhich included the growth of the near-Earth current (ap-\nproaching 30 nA\/m2) and possible formation of a local B\nminimum in the neutral sheet (∼5 nT) at ∼10–12RE near\nthe substorm onset. However, there were no indications that\nthe substorm onset was initiated just in this region. We em-\nphasize the rather weak magnetic and plasma flow pertur-\nbations observed outside the thinned plasma sheet at Clus-\nter, which could be interpreted as the effects of localized\nearthward-contracting newly-reconnected plasma tubes pro-\nduced by the impulsive reconnection in the midtail plasma\nsheet. In that case the time delays around the distinct sub-\nstorm onset are consistent with the activity propagation from\nthe midtail to the inner magnetosphere. A peculiar feature\nof this substorm was that 12 min prior to this distinct onset,\na clear soft plasma injection to the GEO orbit was recorded\nwhich has little associated effects both in the ionosphere and\nin the transition region at ∼9RE . This pseudo-breakup was\nprobably due to either a localized ballooning-type activity or\nCorrespondence to: V. A. Sergeev\n(victor@geo.phys.spbu.ru)\ndue to the braking of a very narrow BBF whose signatures\nwere also recorded by Cluster. This event manifested the\n(previously unknown) phenomenon, a strong tail overload-\ning (excessive storage of magnetic energy) contrasted to the\nmodest energy dissipation and plasma acceleration, which\nare both discussed and interpreted as the consequences of\ncold\/dense and thick pre-substorm plasma sheet which often\noccurs after the long quiet period. The lessons of using the\nradial spacecraft configurations in substorm onset studies are\nalso discussed.\nKeywords. Magnetospheric physics (Auroral phenomena,\nplasma sheet, storms and substorms)\n1 Introduction\nThere are few areas of general agreement concerning the\ndevelopment of the substorm and mechanisms involved\ninto this transition from the growth phase to the expansion\nphase. There seems to be a consensus that the growth of\nthe tail current in the midtail and inner tail regions provides\nthe main free energy source and forms the conditions for\nthe instability to grow explosively. Since the first two\nInternational Substorm Conferences many observational\nfacts were presented to show that the breakup and substorm\nexpansion (may) start deep inside of the closed plasma\nsheet tubes and that the transition region (7–12RE) between\nthe thin current sheet and the dipole-like magnetosphere is\nan important player in the substorm process (e.g. Kennell\n(1992)). Later, the large statistical surveys obtained with the\nGeotail spacecraft provided strong evidence that at substorm\nonset the magnetic reconnection starts typically at 20–25RE\n2184 V. A. Sergeev et al.: Transition from substorm growth to substorm expansion\n20 20.5 21 21.5 22 22.5\n-60\n-40\n-20\n0\n20\n-300\n-200\n-100\n0\n100\n10\n20\n0\n30\n60\n90\n120\n0\n1030\n40\n50\n-10\n-5\n0\n5\n10\n0\n1\n2\nIMF BZ (ACE,Wind)\nPC-index (Vostok)\nBX-Cluster\nBZ-Cluster\n∆BXEXT (Polar-Geotail)\nBZ Polar,Geotail\n∆X, ∆Z  SOD\nASY  - H\n         - D\nSYM\nGeotail\nPolar\nZ\nX\nSeptember 8, 2002\n     ACE (+45min)\n     Wind (+14min)\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n<SO>\n< Q >\nFig. 1. Overview of activity at the end of 8 September 2002: From top to the bottom : (a) IMF BZ-variations at ACE and WIND spacecraft\ntime-shifted to the subsolar magnetopause position, with their GSM coordianates and time shift applied; (b) polar cap PC-magnetic index\nfrom the Vostok station ; (c) BX and BZ component variations at Cluster; (d) difference of the BX components of the external field at Polar\nand Geotail spacecraft and corresponding BZ field components (with T96 model values shown by triangles); (e) magnetic varitions from\nSodankyla (63.8◦ CGLat); (f) midlatitude ASY\/SYM indexes. The growth phase onset and substorm onset (21:18 UT) are marked by the\nvertical lines; the average values of the lobe field expected at the Cluster location for quiet conditions (<Q>) and at the unloading (substorm\nexpansion) onset (<SO>) (after Shukhtina et al., 2004) are shown by the horizontal lines in the panel (c).\ndistance in the midtail (Nagai et al., 1998). Basic points\nof disagreement concern which process, magnetic recon-\nnection, MR, at 20–25RE , or the current disruption, CD,\n(generic name for yet unspecified instability in the transition\nregion), starts first and how these regions communicate\nto each other. Some attempts have also been reported to\nincorporate\/combine both mechanisms\/regions to explain\nthe (sometimes contradictory) observational data (see, e.g.\nErickson et al., 2000, and references therein).\nV. A. Sergeev et al.: Transition from substorm growth to substorm expansion 2185\n-4 -6 -8 -10 -12 -14 -16 -18\nXgsm, Re\n4\n2\n0\n-2\n-4\nYg\nsm\n, R\ne\n20\n21\n22\n202122\n20 2122\n-4 -6 -8 -10 -12 -14 -16 -18\n-2\n0\n2\n4\n6\nZg\nsm\n, R\ne\n2021\n22\n20\n21\n22\n20\n21\n22\n-16 -17\nX , Re\n1\n0\nYgsm,Re\n4\n5\nZgsm, Re\n-16 -17\nX, Re\nPolar\n                               Cluster-3\nGeotail\nLANL-02A\nLANL-01A\nS e p t e m b e r    8  , 2 0 0 2\nLANL-01A\nLANL-02A\n  CLUSTER \n at  2100 UT\nC1 C2 C3 C4\nFig. 2. Configuration of basic spacecraft on 8 September 2002 in GSM-coordinates. The neutral sheet position is indicated on the XZ cross\nsection, spacecraft positions at 21:00 UT are marked by the rectangles.\nThis fundamental problem – to identify the basic substorm\ninstability (by its location, propagation and manifestations) –\nis one of the main goals of the forthcoming THEMIS project.\nIts key elements are: (1) a “radial” spacecraft configuration\n(which combines the direct probing of the near-Earth CD re-\ngion with a cluster of 3 spacecraft positioned at ∼10RE , the\nprobing of midtail reconnection and its communication with\nthe inner region with two spacecraft at 18 and 30RE) while\n(2) supporting them by an extensive ground station network\nto monitor the timing and location of activations. Similar\nradial configuration can partly (and rarely) be realized with\nthe existing fleet of ISTP spacecraft (e.g. Slavin et al., 2002;\nBaker et al., 2002).\nHere we study a unique event, in which a well-isolated\nsubstorm was observed with Themis-like configuration in the\nregion being conjugate to the initial auroral activation at sub-\nstorm onset. The possibility to construct a sequence of mag-\nnetospheric models by adjusting them to the actual observa-\ntions made by multiple spacecraft (rare experience) provide\nus with realistic current sheet parameters of the magnetotail,\na reliable mapping and the knowledge of temporal evolution.\nIn addition to addressing the timing and onset location is-\nsues, this event gives the valuable experience of working in\nsuch configurations, particularly when the key spacecraft are\nlocated outside the plasma sheet. Last but not least, the stud-\nied event displayed an interesting (previously not reported)\nfeature, a strong overloading of the tail, which we have the\nadvantage to study and discuss.\n2 Observations\n2.1 Survey of observations\nThe event on 8 September 2002 can well be one of the best\ntextbook examples of a substorm due to its distinct character\nand unprecendent\/excellent coverage by observations in all\nbasic regions; see a summary in Fig. 1. First of all, it was\nan isolated substorm preceded by >13 h of magnetic calm\nduring a long period of northward-oriented IMF. As usual,\nthe event was initiated by a IMF southward turning, arriv-\ning at the magnetopause around 20:00 UT, Fig. 1a and, sub-\nsequently, the irregular northward turning observed around\n21:20 UT could play a role in triggering the substorm expan-\nsion, which also frequently occurs (e.g. Lyons et al., 2003).\nThe IMF variations shown by two solar wind monitors, ACE\nand Wind, are not quite similar, suggesting inhomogeneous\nsolar wind structure; unreliable timing precludes any seri-\nous observation-based discussion of the triggering process in\nour case. The growth phase (starting after 20:15 UT, accord-\ning to PC index and other ground and tail data) displayed\na steady growth of the tail current and stretching of the tail\nconfiguration until 21:10–21:20 UT (Figs. 1c, d, discussed\nin more detail in the Sect. 3). During that time period, the\nenhanced convection is manifested as the growth of PC in-\ndex (an indicator of polar cap convection, Fig. 1b), of the\nwestward electrojet (see SOD records in Fig. 1e) and of the\nAE index (not shown here). The enhanced convection was\n2186 V. A. Sergeev et al.: Transition from substorm growth to substorm expansion\nGeotail \nPolar\n2114 \n2116\n2118\n2120\nU T\nFig. 3. Time variation of auroral brightness integrated in 2-h wide MLT strips from WIC and S12 cameras of IMAGE spacecraft (a) and the\nexamples of WIC images around the onset (b). The footpoints of Geotail and Polar mapped into the ionosphere are also shown. Vertical\nlines here and on the following figures indicate the times of the pseudo-breakup (green) and of the substorm onset (major breakup, red line).\nalso directly measured at two geostationary LANL space-\ncraft (see Sect. 2.3 below). The oval expansion with the grad-\nual increase of precipitation was probed by the FUV auroral\nmonitor at Image spacecraft (Sect. 2.2). The substorm (ex-\npansion phase) onset was consistently determined by auro-\nral and ground magnetic observations (Sect. 2.2) to occur at\n∼21:18 UT in the local time sector 22:00–24:00 MLT.\nThe mid-latitude activity according to magnetic ASY and\nSYM indices can be characterized as enhanced convection\n(ASY indices) in the growth phase without a clear depression\nof the SYM (proxy ofDst ) index, probably masked by the en-\nhanced solar wind dynamic pressure (peaked at ∼21:00 UT,\nnot shown here). The SYM-index dropped from ∼–30 to\n–50 nT during the substorm expansion phase. The maxi-\nmal electrojet intensity during the substorm was moderate,\nmaximal disturbance amplitude at midnight (see SOD mag-\nnetogram) was about 300 nT and the peak AE index value\nwas ∼400 nT.\nFigure 2 shows a unique constellation of basic space-\ncraft in this study. At 21:00 UT there were two geosyn-\nchronous LANL spacecraft (02 A and 01 A) at 02:00 and\n22:00 MLT, correspondingly, to probe the inner magneto-\nsphere around midnight. Another two spacecraft, Polar at\n[–8.8, –1.9, 1.8]RE and Geotail at [–8.8, 1.0, –1.3] (GSM\ncoordinates are used everywhere), were in an ideal position\n(at the same radial distance, ∼9RE and being separated by\n<3RE both in Y and Z coordinate) to probe the current sheet\non both sides, from the neutral sheet and from midnight. Four\nCluster spacecraft separated by ∼2000 km from the tetrahe-\ndron barycenter (at [–16.1, 0.4, 4.5]RE) probed the northern\nboundary portion of the plasma\/current sheets at midnight.\nSuch configuration resembles the proposed THEMIS config-\nuration by the cluster of 2 spacecraft at ∼9RE (instead of\n3 SC clustering at ∼11RE) and by the Cluster spacecraft\nat the intermediate distance (16RE) between the inner mag-\nnetosphere and the expected average magnetic reconnection\nregion (at 20–25Re). With the Image magnetometer network\n(midnight at around 21:30 UT) probing the ionospheric cur-\nrents near the spacecraft footpoints and global auroral images\nfrom IMAGE spacecraft, to our knowledge, this is the most\nclosest analogy of the configuration expected to be realized\nin the THEMIS project.\n2.2 Auroral and magnetic observations of the substorm on-\nset and preceding pseudo-breakup\nThe FUV observations from the Image spacecraft allow one\nto monitor the global distribution of total precipitation (WIC\ncamera) and of the proton precipitation (S12 instrument) on\nthe nightside at ∼2-min time resolution (e.g. Mende et al.,\n2003). The time variations of the auroral brightness inte-\ngrated in 2-h wide MLT strips (Fig. 3a) indicate a smooth\ngrowth of the overall precipitation during the growth phase,\nwith a clear brightness increase in the 22:00–24:00 MLT sec-\ntor at ∼21:18 UT, which then expanded to the post-midnight\nsector after 21:22 UT. The sequence of images shows this\nbrightening which occurs close to the expected footpoints of\nmajor spacecraft.\nThis onset timing is supported by the magnetometer data.\nThe latitudinal distribution of westward currents in Fig. 4\nV. A. Sergeev et al.: Transition from substorm growth to substorm expansion 2187\n2106 2118\nPBU Main onset\nFig. 4. Latitudinal distribution of the westward currents near midnight reconstructed from data of the IMAGE magnetometer network using\nthe 1-D upward continuation method (Vanhamaki et al., 2003).\nshows the results of the 1-D upward continuation of the\nground magnetic perturbations (Mersmann et al., 1979; Van-\nhamaki et al., 2003), which allows one to reconstruct at each\ntime step the density distribution of the east-west equivalent\nionospheric currents crossing the meridian of the IMAGE\nmagnetometer network (midnight at ∼21:30 UT). A sharp\nchange in (previously smooth) pattern is evident at 21:18 UT,\nfirst, as a structuring of the current density at Pi2 frequency\nand, then, as the intensity increase and poleward expansion of\nthe westward current (around 21:24 UT). The Pi2 pulsations\nafter 21:18 UT were also observed at the SAMNET magne-\ntometer network (not shown) and even at mid-latitudes (at\nCrete station, courtesy by T. Bo¨singer). A notable feature is\nan unusually low latitude (∼61◦ CGLat) of the breakup re-\ngion, corresponding to the very expanded oval at that time.\nAnother notable feature is a fast equatorward shift after\n21:00 UT followed by a weak intensity increase of the west-\nward current at 21:06 UT (to less than 100 nT). The latter\nfeature is later referred to as the pseudo-breakup and may be\nassociated with the plasma injection to the geosynchronous\norbit described in the next section. No distinct auroral bright-\nening could be identified at that time in the FUV imager data.\n2.3 Observations at the geosynchronous orbit\nThe geosynchronous plasma environment was monitored\nwith two basic plasma instruments, MPA (covering elec-\ntrons and protons below 45 keV) and SOPA (for energetic\npopulation above 50 keV). The most interesting information\nwhich came from MPA on two near-midnight spacecraft is\ndisplayed in Fig. 5. Very clear growth phase signatures were\nrecorded between 20:20 and 21:06 UT. First, the steady en-\nhanced convection, established with mostly earthward (ra-\ndial) convection at premidnight SC 01 A and sunward (east-\nward and earthward components) convection at the post-\nmidnight spacecraft, has associated smooth increases of to-\ntal plasma pressure at both spacecraft. A gradual change in\nelectron anisotropy (from pancake-to cigar-shaped distribu-\ntion) was also observed, as shown by increased T‖\/T⊥. This\nis also a well-known manifestation of the growth phase inter-\npreted as a consequence of enhanced drift-shell splitting due\nto the increased magnetic field stretching in the tail (Baker\net al., 1978). A proxy of the magnetic field orientation is\ngiven on the bottom plot, which indicates a slight stretching\nof the magnetic field at the spacecraft #02A (blue trace) dur-\ning the growth phase.\nThis pattern was considerably perturbed at ∼21:06 UT.\nThe pressure of energetic protons (electrons) was sharply\nenhanced at spacecraft 01 A (02 A) without a similar en-\nhancement of the other component, indicating that pro-\ntons observed at ∼22:00 LT and the electrons observed at\n∼02:00 LT were probably injected near midnight, in between\nthese two LT meridians. (A possibility still may be reserved\nthat observed features could be the encounter of the sharp in-\nner boundary of the proton (at 22:00 MLT) and electron (at\n02:00 MLT) plasma sheet, although such coincidence looks\nimprobable, unless these boundaries are suddenly shifted\n2188 V. A. Sergeev et al.: Transition from substorm growth to substorm expansion\n-50 -40 -30 -20 -10 0 10 20 30 40\nTime (min) since 2100 UT\n40\n60\n80\n100\n120\nΘ\n, d\neg\n1\n2\n3\n0.90.8\n0.7\n0.6\n0.5\nTp\nar\n\/T\npe\nrp\n0.1\n1\n10\nPP\nre\nss\nur\ne,\n k\neV\n c\nm\n-3\n-10\n0\n10\n20\nV,\n k\nm\n\/s\n-20\n-10\n0\n10\n20\n        S e p t e m b e r     0 8 ,   2 0 0 2     \nLANL 02A  (~02 h MLT)   &   LANL 01A (~22 h MLT)   \nVEARTH\nVEAST\nHE  protons \nHE electrons\n01A\n02A\nVEAST\nVEARTH\nFig. 5. MPA observations at two geosynchronous LANL spacecraft including (from top to the bottom): proton flow components, electron\nand proton pressure of energetic plasma component (0.3–32 keV), the ratio T‖\/T⊥ for the energetic electron component, and the polar angle\nof the energetic electron anisotropy axis (90◦ corresponds to the dipole field direction).\nearthward, which again points to the necessity of an inward\nplasma injection in a wide MLT sector around midnight.)\nThe previously existing, steady convection pattern was dis-\nrupted at that time. The electron anisotropy also changed\nsharply, but in the opposite direction at the two spacecraft: it\nreturned to the isotropic distribution post-midnight, whereas\nit sharply increased pre-midnight, indicating a stretching of\nthe enhanced magnetic field at ∼22:00 LT (consistent with a\nstrong deviation of the anisotropy axis from the dipole field\ndirection as shown at the bottom plot). Surprisingly, no com-\nparable effects were seen in this energy range at these loca-\ntions 12 min later, at the substorm onset.\nIn sharp contrast to these observations, the substorm has\nvery tiny effects in the more energetic geosynchronous pop-\nulation (>50 keV) covered by the SOPA instrument, which\nis traditionally used to monitor the substorm-related injec-\ntions. The only injection feature recorded at the onset was the\ndrifting electron hole (DEH) observed at the post-midnight\nspacecraft 02A (Fig. 6), whose injection time (from tracing\nback energy dispersed arrival time) was estimated to be at\n21:20:00 (±20 s) UT. It was followed by a small flux increase\nonly in the lowest energy (50 keV) channel.\nV. A. Sergeev et al.: Transition from substorm growth to substorm expansion 2189\n100\n1000\n10000\n100000\nD\niff\n. e\nle\nct\nro\nn \nflu\nx\nEe , keV                                               DEH\n50-75   \n75-105\n105-150\n150-225 \n225-315\n20:50            21:00            21:10            21:20            21:30       UT\nFig. 6. Differential fluxes of energetic electrons recorded at the LANL 02A spacecraft (∼02:00 LT). The only feature around substorm onset\nat GEO orbit was the drifting electron hole corresponding to the injection of depressed particle flux at around 21:20 UT.\nPBU Onset\nFig. 7. Variations observed by Polar and Geotail in the transition region around pseudo-breakup and substorm onset. From top to the bottom:\nThe spectrograms of energetic electrons and ions at Polar (HYDRA instrument); high time resolution (12 s at Geotail, 6 s at Polar) variations\nof the magnetic field (Bzgse and total B) and the plasma-spacecraft potential (SP).\n2190 V. A. Sergeev et al.: Transition from substorm growth to substorm expansion\nFig. 8. Survey of selected Cluster observations: E-t spectrograms for hydrogen and oxygen ions from CODIF and equivalent\nBlobe=(2µ0[(nkT )O++(nkT )H+ ]+B2)1\/2 obtained from the vertical pressure balance.\n2.4 Observations in the transition region at ∼9RE\nTo characterize the current sheet evolution, we plotted in\nthe Fig. 1d the difference between the BX-components of\nthe external magnetic field (the Earth dipole field subtracted\nfrom the total observed field) at Polar and Geotail spacecraft.\nNear midnight the difference characterizes the amount of the\ncurrent in the horizontal slab (per unit length) between the\ntwo spacecraft, whose distance in Z was about 3RE and\nwhich were on the opposite (N and S) sides from the neu-\ntral sheet. During the growth phase this quantity, 1BXEXT ,\nchanged from 30 to about 120 nT, indicating a strong growth\nof the current density in the transition region. Also, BZ de-\ncreased below the average level down to ∼10 nT. Soon after\nthe substorm onset theBZ-components sharply increased and\n1BXEXT decreased, indicating the disruption of this intense\ncurrent, the standard signature of the substorm onset in the\nnear-Earth tail region (e.g. Lui et al., 1992).\nTo see in more detail the plasma and magnetic field dy-\nnamics around the pseudo-breakup and onset times, we plot-\nted in Fig. 7 the spectrogram from the Polar HYDRA in-\nstrument, as well as the variations of the magnetic field and\nspacecraft potential at Polar and Geotail (the latter parameter\ndecreases with the increasing electron flux and serves to char-\nacterize the plasma population; e.g. Laakso, 2002). During\nthat time both Polar (closer to the neutral sheet) and Geotail\n(near the plasma sheet boundary, consistent with their coor-\ndinates in Fig. 2 and the latter at a lower value of the space-\ncraft potential) stayed within the plasma sheet. Geotail exited\nshortly from the plasma sheet between 20:53 and 21:02 UT\nas a result of a transient northward tilt of the current sheet\n(consistent with the modeling results of Sect. 3.1 and Fig. 11,\ntop). No significant particle acceleration or magnetic field\ndipolarization was seen around the pseudo-breakup at either\nPolar or Geotail, except for the effects of fast plasma sheet\nthinning observed by Polar after 21:07 UT.\nAround the substorm onset the earliest indication of ac-\ntivation was the sudden plasma sheet expansion at Polar at\n21:17:40 UT, which was followed at both spacecraft a few\nminutes later by the BZ increase. The earliest changes in\nplasma parameters at Geotail (according to the spectrogram\nfrom the LEP instrument, not shown here) started not ear-\nlier than at 21:19:40, with strong energization evident at\n21:22 UT. When interpreting the observations one should\ntake into account localization and dynamics of activity with\nrespect to the spacecraft location. Particularly, the Polar foot-\npoint initially was outside (eastward, within 1h LT – see\nFig. 3) of the bright auroras at the onset, and considerable\nplasma acceleration at Polar was not observed until 21:26 UT\nwhen the spacecraft footpoint was occupied by the bright au-\nroras in the course of their eastward expansion.\n2.5 Cluster observations at ∼16RE\nAccording to the CODIF spectrogram in Fig. 8, the Clus-\nter spacecraft were in a cold (Ti∼1−2 keV) plasma sheet\nat the beginning of the event. They exited from the\nplasma sheet at around 21:00 UT and returned back to\nthe (considerably heated) plasma sheet after a series of\ntransient encounters with hot boundary layer plasma be-\ntween 21:37 and 22:10 UT. Outside the thinned proton\nplasma sheet, between 21:00 and 21:37 UT, they encoun-\ntered continuously a considerable amount of cold (hundreds\neV) oxygen ions (Fig. 8), flowing tailward with speeds of\nVx∼−40. . .−60 km\/s (Fig. 9). This cold oxygen (iono-\nspheric outflow) beam is an excellent tool for diagnosing\nthe relatively weak (tens km\/s) cross-B motions of the lobe\nplasma tubes, as has recently been shown by Sauvaud et al.\n(2004). The traces of VZ flows at two spacecraft (C1 and\nC4) in Fig. 9 varied similarly, suggesting a relatively large\nscale of these perturbations. This gives us an opportunity to\nV. A. Sergeev et al.: Transition from substorm growth to substorm expansion 2191\nCIS-1 :  BLPS   Æ Lobe\nFig. 9. Top: H+ and O+ plasma densities, O+ perpendicular flows at C1 and C4 spacecraft and BZ-variations at four Cluster spacecraft.\nBottom: VZ−BZ correlation plots for time periods, including the pseudo-breakup and the substorm onset.\nlook at the flux tube perpendicular motions (together with\nmagnetic variations recorded) to learn about the associated\nplasma sheet dynamics, while the spacecraft are staying out-\nside of the plasma sheet.\nNear the substorm onset (since 21:17 UT and throughout\nthe substorm expansion while Cluster was in the lobe\nplasma) one sees a series of negative VZ variations accompa-\nnied by positive BZ variations, suggesting some association\nbetween plasma tube convection toward the neutral sheet\nand magnetic dipolarization events. A similar sequence\nis noticed between 20:52 and 21:05 UT, i.e. prior to the\npseudo-breakup. A correlation analysis (Fig. 9, bottom)\nshows in both cases the anticorrelation between δVZ and\nδBZ (CC ∼−0.6 even without removing the slow substorm-\nrelated BZ trends) which, in case of Alfve´n waves, implies\ntheir earthward propagation. Moreover, the regression slope\nis nearly the same in both intervals (∼10 km\/s\/nT) which\ncan be scaled to evaluate the earthward propagation speed\nas VX=(δVZ\/δBZ) BL ∼500 km\/s for an Alfve´n wave and\nusing the lobe field BL=50 nT.\nLet us look now in more detail into the variations in dif-\nferent components around substorm onset, which are shown\nin Fig. 10. First, the component variations are similar at\nall spacecraft, indicating a relatively large scale of the struc-\ntures (exceeding 3000 km spacecraft separation scale). Sec-\nond, a small time shift exists from C4 to C1 for the first\npulse shown in Fig. 10 (about a 6–8-s time delay when us-\ning cross-correlation), supporting earthward propagation at\nspeeds of 500–700 km\/s. There is a systematic phase shift\nbetween different components: the VZ and BZ variations\nanticorrelate each other with little phase shift evident, but\nthe beginning of a positive δBZ (negative δVZ) pulse cor-\nresponds to the maximum of BX-variation. Such quarter-\nperiod phase shift between the components allows one to in-\nterpret them as localized earthward-contracting reconnected\nflux tubes (NFTEs) or the flux ropes, which will be discussed\nbelow. The more accurate determination of the horizontal\nvelocity of the leading structure (centered at 21:17:22), us-\ning all components at all four Cluster spacecraft (obtained\nby the algorithm used in Slavin et al. (2003b) to trace the\nflux ropes), gives VX=627 km\/s and VY=–72 km\/s.\n2192 V. A. Sergeev et al.: Transition from substorm growth to substorm expansion\nNightside FTE structure (Sergeev et al.,PSS, 1992, p.1551)\nPS expansion\nSC\nFig. 10. Time variations in the plasma sheet around the substorm onset (from top to the bottom): BZ components at Polar and Geotail\n(with onset of rapid PS expansion shown by arrow), BX and BZ components at four Cluster spacecraft; vertical flows at C4 spacecraft.\nThe scheme on the bottom panel displays the pattern of the nightside flux transfer event (NFTE) in the plasma sheet, from (Sergeev et al.,\n1992a) (including the magnetic field lines, plasma pressure showed by hatching and velocities of the flux tubes shown by the arrows) with\nthe spacecraft trajectory overlapped to facilitate the interpretation of observed variations.\n3 Analysis of observations and discussion\n3.1 NFTEs : What can be observed by the spacecraft being\noutside the plasma sheet?\nThe typical situation for the spacecraft in the magnetotail at\nsubstorm onset (or near the reconnection region at any con-\nditions) is that, due to severe thinning of the current sheet,\nthe spacecraft finds itself outside the plasma sheet and can\nno longer diagnose directly the main product of the magnetic\nreconnection – the contracting reconnected plasma tubes car-\nrying the fast-flowing and heated plasma. However the con-\nsequences of that process, specific perturbations with smaller\namplitude, can be observed in the lobes. The most well-\nknown examples are the plasmoids or the flux ropes (see,\ne.g. Slavin et al., 2003a, for a description and references)\nwhich generate the well-known travelling compression re-\ngions (TCR) in the lobes. Other examples are the local-\nized reconnected plasma tubes (or Nightside Flux Transfer\nEvents, NFTEs, see Sergeev et al., 1992a, for the descrip-\ntion of previous work and Fig. 10). Both objects have the\npropagating mesoscale (a few RE) bulge-like perturbations\nof the plasma sheet, which create the BX-compression and\nbipolar perturbation in the normal (BZ) component in the\nlobes near the plasma sheet. The major difference between\nthe two objects is topological; the plasmoid\/flux rope looks\nlike a loop when viewing along the core axis (from the dusk\nflank), and it produces symmetric bipolar N\/S variations in\nBZ . On the contrary, the NFTE has a unipolar closure (net re-\nconnected flux) across the sheet and provides asymmetric BZ\nvariation with a main (positive if observed earthward from\nthe reconnection site) pulse preceded by a smaller negative\npulse. (The latter pulse is created due to the specific wave\nperturbation launched by transient (pulse-like) reconnection,\nas shown in the theoretical models of transient reconnection\n(see Semenov et al., 2004, for reference to theoretical mod-\nels and Sergeev et al. (1987), for comparison between model\npredictions and observations) . Empirical reconstruction of\nperturbations during transient plasma sheet expansions ob-\nserved by ISEE-1 and 2 spacecraft separated in the Z direc-\ntion gave the NFTE pattern (Sergeev et al., 1992a) shown at\nthe bottom of Fig. 10. Such a pattern explains the phase shifts\nV. A. Sergeev et al.: Transition from substorm growth to substorm expansion 2193\nbetween δBX and δBZ , the asymmetric (almost unipolar)\ncharacter of BZ variation, and anticorrelation between δVZ\nand δBZ in agreement with the observations. A good quanti-\ntative agreement between predicted and observed variations\nhas been recently demonstrated for our event by T. Penz and\ncolleagues (T. Penz et al., 20051).\nBased on these results we interpret the positive δBZ (ac-\ncompanied by negative δVZ) pulses as the propagated prod-\nucts of pulsed magnetic reconnection. If so, it implies\nthat a series of ∼1-min-long reconnection pulses (or a few\nX-O-pairs transported earthward, if one prefers the flux rope\ninterpretation) was generated at substorm onset, at a distance\nr>16RE , tailward of the Cluster location. The earliest in-\ndication of onset time at the Cluster location could then be\ndefined at 21:16:40 UT (Fig. 10) when BX and VZ start to\nincrease before the main negative VZ pulse (and positive BZ\npulse) was observed.\n3.2 Tail current sheet dynamics on the large scale\nThe adaptive modeling approach (e.g. Kubyshkina et al.,\n1999) allows one to apply the model functions used in stan-\ndard magnetospheric models (here from the T89 model; Tsy-\nganenko, 1989) to tune the free model parameters and obtain\na best fit to the observations at the given time. The observed\nmagnetic field components at all spacecraft and a proxy of\nthe B-field direction at geostationary spacecraft were used\nhere as the input. The spacecraft configuration on 8 Septem-\nber 2002 is a kind of optimal distribution: the Cluster mag-\nnetic measurements outside the plasma sheet allow one to fix\nthe total current, the data from the Polar\/Geotail spacecraft\npair allow one to control the actual tilt of the current sheet\nand probe its thickness, and the LANL observations help to\nfix the inner magnetospheric magnetic field. No data exist\nat r>17RE which prevents us from discussing seriously the\nconfiguration at far distances where the magnetic reconnec-\ntion could take place. The version of the adaptive model and\nthe free model parameters used are similar to those described\nby Kubyshkina et al. (1999). We varied the tail current in-\ntensity, to thin CS locally and to tilt the current sheet. The\nsequence of the resulting generated models is displayed in\nFig. 11.\nThe modeling confirms large changes in the magnetotail\nduring the growth phase. The equatorial cross-tail current\ndensity started from standard values j∼5 nA\/m2 (20:00 and\n20:20 UT) and increased most of all (by a factor of 5, reach-\ning 25–30 nA\/m2 before the onset) in the transition region\nprobed by the Polar and Geotail spacecraft. The BZ compo-\nnent in the current sheet center decreased, with an indication\nof local BZ minimum∼5 nT, formed at 10–12RE , where the\ncurrent density reached its highest value. This was probably\nthe region where the tail current density (in absolute values)\nwas maximum in the tail.\n1Penz, T., Semenov, V. S., Ivanova, V. V., et al.: Reconstruction\nof the reconnection rate from Cluster measurements: First results,\nJ. Geophys. Res., accepted, 2005.\n0 -4 -8 -12 -16 -20\n-2\n0\n2\n4\n6\nCluster\nGT\nPolarLanl1\n0 -4 -8 -12 -16 -20\n-2\n0\n2\n4\n6\n0 -4 -8 -12 -16 -20\n-2\n0\n2\n4\n6\n61.0 O + 0.3 O\n0 -4 -8 -12 -16 -20\n-2\n0\n2\n4\n6\n60.5 O   +  0.3 O\n0 -4 -8 -12 -16 -20\n-2\n0\n2\n4\n6\n60.5 O + 0.3 O\n20:30\n20:45\n21:00\n21:19\n61.5 O + 0.3 O\n63.0 O + 0.3 O\n21:12\n10\n100\nBz\n , \n n\nT\n20:00\n20:30\n20:45\n21:00\n21:12\n21:19\n-6 -8 -10 -12 -14 -16\nX gsm, Re\n0\n5\n10\n15\n20\n25\n30\nj ,\n  n\nA\/\nm\n2\nPolar &\nGeotail\nFig. 11. Top: magnetic field line configurations (midnight XZ cross\nsections) during the substorm growth phase obtained from the adap-\ntive modeling; CGLat of the innermost field line and latitudinal step\nbetween field lines are shown for each configuration. Bottom: time\nevolution of the radial current density profiles and BZ profiles in\nthe neutral sheet.\n2194 V. A. Sergeev et al.: Transition from substorm growth to substorm expansion\nThe modeling\/mapping results have a few other implica-\ntions when interpreting the observation:\n(1) The modeling reveals the up-down tilts of the current\nsheet, partly related to the changes in the solar wind ver-\ntical flow component (this effect is difficult to explore in\nour case due to the timing problems in the ACE-Wind\ncomparisons mentioned above and the differences, in\nthe recorded signals at two spacecraft). This explains\nthe temporary exit from the plasma sheet of the Geotail\nspacecraft between 20:53 and 21:02 UT.\n(2) The stretching associated with the growth of the tail cur-\nrent was so strong that at 21:12 UT the point at 6.6RE\ndistance in the neutral sheet maps to ∼61◦ CGLat. This\nhelps to link the observation of distinct soft plasma\ninjection at LANL spacecraft at 21:06 UT (Sect. 2.3)\nwith a weak enhancement of westward electrojet at\n∼61◦ CGLat, considering them as a manifestation of\nthe same process, described here as the pseudo-breakup.\nHowever, due to the small BZ (and small magnetic flux\nclosure) in the current sheet, the transition region also\nmaps very near in latitude, for example, the Polar foot-\npoint at 21:12 UT is only at 62.0◦ and the neutral sheet\npoint at 15RE maps to 62.6◦ CGLat.\n(3) The magnetospheric location of the main breakup is dif-\nficult to establish due to uncertainties in both the ob-\nserved location of the breakup in the ionosphere and\nin the mapping (possible uncertainties are roughly esti-\nmated to be about 1◦ CGLat in both cases). It is difficult\nto judge from these data for sure whether the breakup\nshould be mapped to the GEO distance or to the mid-\ntail.\n3.3 Substorm onset timing, interpretation of substorm on-\nset and of the pseudo-breakup\nAs noticed before, the earliest indication of substorm-onset-\nrelated variations was detected on Cluster at 21:16:40 UT.\nAt ∼9RE the corresponding earliest activity sign was the\nstart of sudden plasma sheet expansion at Polar, which was\nobserved at 21:17:40 UT. A one minute time delay over\n∼7RE distance implies the earthward propagation speed of\n∼700 km\/s. This nicely agrees with the cross-correlation\nof magnetic variations at the Cluster spacecraft (giving\nVX=627 km\/s), as well as with the ∼500 km\/s estimate of\nthe local Alfve´n speed evaluated from the δVZ\/δBZ ratio\n(Sect. 2.5). These results, obtained on different scales and\/or\nby different methods, points to the earthward propagation of\nthe disturbance from midtail to the near-Earth region at the\nsubstorm onset.\nConcerning the near-Earth region, the only manifestation\nof the onset was the drifting electron hole (DEH, Fig. 6),\nwhich is known to be a negative of ordinary plasma in-\njection (Sergeev et al., 1992b) and is explained by the in-\nward injection of plasma tube in which the energetic par-\nticle flux is depleted. (Depleted energetic particle flux as\ncompared to the radiation belt population can be naturally\nexplained by a very low temperature and soft electron spec-\ntrum of the plasma sheet (see Sect. 3.5 and also Yahnin et al.,\n2001, for similar observations and interpretation). Since the\n“flux hole” is injected, the “flux hole” then propagates at the\nelectron drift speed, similar to the ordinary injected plasma\ncloud. The time of its injection to the GEO orbit can be\nevaluated from this energy dispersed arrival shown in Fig. 6\nto be at 21:20 UT. Compared to the earliest signature ob-\nserved at ∼9RE , this gives a time delay of 2.5 min over\n2.5RE , which represents a slower propagation speed in the\ninner region of about 100 km\/s. Such a propagation speed is,\nhowever, a typical propagation velocity of the dipolarization\nfronts at these distances, according to the statistical study by\nOhtani (1998), who investigated their timing at two radially-\nseparated spacecraft. Summarizing, if we believe in the in-\nterpretation of Cluster observations suggested in Sect. 3.1,\nthe timing of plasma sheet phenomena at substorm onset is\nconsistent with inward propagation from the midtail to the\ntransition region and then to GEO orbit with realistic propa-\ngation speeds. The discussion in Sect. 3.1 also implies that\nthis disturbance is produced by the impulsive reconnection,\nso it implies an association of substorm onset with the BBFs\n(as recently confirmed by Slavin et al., 2002) and points to\nthe modified NENL model (Baker et al., 1996) to organize\nthe observations.\nThe situation looks different concerning the “pseudo-\nbreakup” at 21:06 UT. Unfortunately, the observations are\nless detailed and do not allow one to draw a complete picture\nfor this episode. No considerable auroral brightening was\nobserved by the FUV instruments at the Image spacecraft,\nand only very weak westward current intensification was in-\nferred from the IMAGE magnetometer data (Fig. 4), which\nprecludes the more detailed analysis of ground effects. The\nmost distinct is the observation of enhanced fluxes of soft\n(keV–20 keV) plasma simultaneously at two locations (22:00\nand 02:00 LT) at GEO orbit, with enhanced ions (electrons)\nobserved exclusively at 22:00 (02:00) LT. This asymmetry\nimplies a plasma injection somewhere in between these two\nmeridians, somewhere around midnight. However, no signif-\nicant effects were observed at ∼9RE near midnight at either\nPolar or Geotail, suggesting that the most intense portion of\nthe current sheet (in the transition region near midnight) was\nnot disrupted and did not play an active role in generating\nthis injection. Therefore, we cannot rule out the excitation of\nsome instability (like ballooning) in the inner magnetosphere\n(e.g. Roux et al., 1991), but it then should be very localized\nin that region and have no global effects, i.e. should be de-\ncoupled from the main portion of the intense current sheet.\nAlternatively, one still can imagine the earthward intrusion of\nthe reconnected plasma tube from midtail, similar to that ob-\nserved at the substorm onset, but more localized in Y , so that\nit could be missed by Polar and Geotail. Supporting evidence\nfor such a version can be the observation of series of anticor-\nrelated δVZ\/δBZ variations between 20:53 and 21:05 UT, re-\nsembling those during substorm onset, but showing different\nBZ-component variations at different Cluster spacecraft, see\nV. A. Sergeev et al.: Transition from substorm growth to substorm expansion 2195\nFig. 9, which suggests their small scale in Y . Summarizing,\nwe do not think either of these two options for the pseudo-\nbreakup mechanism has enough evidence in our observation\nto be preferred. More studies with similar configurations are\nthus necessary.\nBased on the timing result one may argue (Sect. 3.3) that\nalthough the current sheet reached its most stressed state near\nthe transition region (at 10–12RE , Sect. 3.2), it was not ini-\ntially disrupted at that particular place at the substorm onset.\nThe time delay analysis rather shows that the disruption of\nthe most intense near-Earth portion of the intensified current\nsheet followed after some disturbance (earthward contracting\nreconnection tube, a kind of BBF) propagated from the mid-\ntail into\/through that region. Although we could not probe\ndirectly the midtail at r>16RE , from previous experience\nwe believe that a thin current sheet developed there also, so\nthe thinned intensified current sheet is sufficiently long in X\n(say, from 10 to 30RE ; see, e.g. Pulkkinen et al., 2000) and\nmainly its tailward portion is activated. Such asymmetry is\nconsistent with statistical results by Asano et al. (2004), who\nshowed that the initial current sheet thickness at substorm\nonset is smaller for cases starting from earthward flow bursts\nthan in cases starting with tailward flow bursts, which implies\nthat magnetic reconnection activated asymmetrically, prefer-\nring the tailward portion of the intense current sheet. Such\nasymmetry, for example, was suggested theoretically by Sit-\nnov et al. (2002), who considered the influence of transient\nelectron population on the excitation of tearing instability.\n3.4 Lessons for substorm onset studies in radial configura-\ntions\nOur examination of one substorm event with favourable dis-\ntribution of several spacecraft and global control of activ-\nity (also complemented with the magnetospheric modeling)\nshows that removing one of the elements (some spacecraft,\nor ground\/auroral control) can modify (even alternate, see\ne.g. discussion of the pseudo-breakup observations in previ-\nous section) the interpretation. This is why in this paper we\nprefer to abstain from discussing the substorm onset mecha-\nnism based on extensive literature of previous case and statis-\ntical studies, thereby waiting for the forthcoming projects in\nwhich all necessary elements will be in place (e.g. THEMIS).\nOur experience with such rare configuration may, however,\nsuggest some constraints for such types of studies. One im-\nportant constraint is the necessity of detailed control of the\nsource azimuthal location. An example is the difference\nbetween Polar and Geotail observations (separated by only\n3RE in Y and less than ∼1 h MLT in longitude) at the on-\nset, where the plasma energization started a few minutes later\nat Polar (after 21:26 UT) following the eastward expansion\nof bright auroras. The good coverage of ionospheric observa-\ntions expected in the THEMIS project is a type of optimal re-\nquirement. Another point of interest is that the Z-separation\nbetween the spacecraft probing the transition region should\nnot be too large (3RE appeared to be close to the thickness of\nentire current\/plasma sheet at 9RE in out case) to have the\nopportunity to probe the current density in the central and\nouter portions of the plasma sheet; here the value of about\n1RE could be evaluated as the preferable separation.\nAs argued in Sect. 3.1, in the vicinity of reconnection site\nthe spacecraft are most often outside of the thin current sheet.\nHere we argued that the measurements of lobe plasma con-\nvection and magnetic variations can still be a valuable tool\nto diagnose the reconnection pulses. To prove this remote\nsensing technique will also be an important challenge for the\nTHEMIS project. A caution is necessary, however, because\nof large contribution of oxygen ions in that plasma (Fig. 8) if\nthe instruments without mass-discrimination are used.\n3.5 Overloading of the tail, importance of plasma sheet\nstate\nA basic feature of the substorm growth phase, the loading\nof the magnetic flux and magnetic energy into the mag-\nnetotail, is very distinctly observed in our event. More-\nover, the amount of lobe magnetic field increase is unusually\nlarge. To see this in quantitative terms we can use the em-\npirical model of the lobe field at substorm (unloading) on-\nset, which Shukhtina et al. (2004) obtained based on Geo-\ntail measurements in ∼150 substorms with a well-defined\nunloading phase as a function of spacecraft distance, solar\nwind pressure and the IMF parameters. For the Cluster dis-\ntance and given solar wind conditions it predicts a lobe field\nvalue at substorm onset of 38 nT (contrasted with 49 nT in\nour case, Fig. 8), whereas for the quiet state the correspond-\ning relationship predicts 31 nT (which is comparable to 34 nT\nat 20:10 UT). The actual net lobe field increase 15 nT appears\nto be a factor of 2 larger than predicted, so the energy stor-\nage is a factor of 3–4 higher than in the average substorm!\nThe extraordinary large increase in the tail current results\nin the unusually large equatorward expansion of the auroral\noval and unusually low latitude of the substorm onset, at 61–\n62◦C GLat instead of usual 65–67◦ (e.g. Mende et al., 2003).\nAlthough the ground-based observations of the strong growth\nphase features followed by the insignificant expansion phase\nhave been previously reported (e.g. Pellinen et al., 1982), the\nphenomenon of tail overloading by the stored magnetic en-\nergy, to our knowledge, was not yet been reported before.\nIn the standard paradigm the stored energy is explosively\ndissipated during the substorm expansive phase, so one ex-\npects to obtain a strong energy dissipation in the case of large\nenergy storage. This is not the case in our event. The auroral\ncurrents were quite modest (peaked at ∼400 nT in AE index\nand about 400 kA in the westward electrojet at the midnight).\nTotal precipitated energy deposited in the auroral oval on\nthe nightside between 20:00 and 04:00 MLT evaluated from\nFUV Image observations reached the peak value of ∼34 GW\nat 21:50 UT, so a net increase in the precipitation rate during\nthe expansion phase (starting from at ∼21:16 UT) was only\n13 GW. This is comparable to the increase in the total auro-\nral energy deposited on the nightside of∼12 GW, obtained in\na statistical study of 390 auroral substorms by Newell et al.\n(2001); see their Fig. 14. Moreover, the standard substorm\n2196 V. A. Sergeev et al.: Transition from substorm growth to substorm expansion\nsignature, the injections of energetic (>50 keV) electrons\ninto the inner magnetosphere (Baker et al., 1978), was prac-\ntically not observed at all (the injection was soft and did not\nextend into this energy range).\nWe suggest these two features, an extraordinary large\nenergy storage and a modest dissipation rate, may be un-\nderstood together by taking into account that before (and\nin the course of) the substorm we had a cool and dense\nplasma sheet (CDPS). Such conditions typically appear af-\nter many hours of long periods of northward IMF and low\nmagnetic activity (e.g. Terasawa et al., 1997; Thomsen et al.,\n2003), as we had in our case as well as in many cases of\nwell-isolated substorms. In our case the GEO spacecraft\nand Polar observed n∼1 cm−3 at the beginning of substorm\ngrowth, which changed to ∼3 cm−3 at GEO orbit during\nsoft plasma injection at 21:06 UT; at that time the tem-\nperature was Ti∼7 keV at 01 A spacecraft. Dense, cool\nplasma (n∼0.6 cm−3 and Ti∼1 keV) were also observed in\nthe boundary plasma sheet by Cluster prior to its excursion\nto the lobe.\nThe influence of plasma sheet parameters on the substorm\nmanifestations was not seriously discussed previously, al-\nthough it can be very important. It can be realized in a num-\nber of ways:\n(1) The amount (density) and energy of current carriers\ninfluence how much they should be accelerated (by\na field-aligned electric potential drop (18‖) near the\nionosphere) to support the field-aligned currents gener-\nated during reconnection and current disruption. In case\nof n∼1 cm−3, the Knight conductance Q(j‖≈Q18‖;\nQ∼ne\/T 1\/2e ) is large and less field-aligned acceleration\n(18‖) is required, in contrast to the standard case. This\nrelationship between the hardness of precipitation and\nthe n\/T ratio in the plasma sheet was directly confirmed\nrecently by comparing the conjugate precipitation and\nplasma sheet characteristics (Sergeev et al., 2004). A\nconsequence is that precipitated energy flux is low, and\nthe Hall conductivity and currents increase weakly (in\ncomparison to Pedersen currents, in the case of soft pre-\ncipitation), therefore only a weak magnetic disturbance\ncan be observed on the ground. (See also Yahnin et al.,\n2001, for similar observations.)\n(2) The soft energy spectrum (small temperature) has little\nparticle flux in the high-energy tails of particle distri-\nbutions, so no considerable energetic particle flux in-\ncrease is observed in the CDPS case and the drifting\nelectron holes (rather than ordinary drift-dispersed flux\nincreases) are observed during the injection of plasma\ntubes into the inner magnetosphere. (See Yahnin et al.,\n2001, for other examples and discussion of previous\nstudies.)\n(3) Supposing that explosive growth of some local cur-\nrent instability is responsible for the substorm onset in\nthe current sheet, one should remember that threshold\nconditions for the current sheet instabilities are always\ngiven in normalized form, with current sheet thickness\nbeing normalized to either the ion gyroradius or to the\ninertial length. Both quantities can be much smaller (by\na factor of 3 or more) in the CDPS case, as compared\nto the average plasma sheet. This means, in the CDPS\ncase, that the current sheet should be thinned until it\nreaches a much smaller thickness, which takes a longer\ntime. This may partly explain the much stronger loading\nand larger tail current reached in our case.\n(4) The reconnection rate is proportional to the Alfve´n\nspeed in the inflow region (i.e. ∼n−1\/2) and is there-\nfore weak in the CDPS case. This means that after the\nreconnection was initiated, it proceeded with a smaller\n(than average) rate until reaching the open field lines\n(the CDPS after a long quiet period is often very thick,\n(see, e.g. Terasawa et al., 1997). This can also con-\ntribute to the weakness and gradual appearance of the\nsubstorm expansive phase in the CDPS case, as nicely\ndemonstrated by Yahnin et al. (2001) for the 16 Novem-\nber 1995 substorm. On the other hand, the slow dissi-\npation\/transfer rate will not compensate the energy\/flux\ntransfer into the tail which is dictated by the dayside\nmerging; therefore, the transition from dominant stor-\nage to the dominant dissipation (a view of expansion\nphase onset) will be observed at a later time, helping to\naccumulate more magnetic flux and energy in the sys-\ntem. Another possible example for features (3) and (4)\ncould be the well-known GEM substorm on 24 Novem-\nber 1996 (e.g. Petrukovich et al., 1999).\n(5) Last but not least, the CDPS case favors a deeper inward\npenetration (smaller size of Alfve´n forbidden region)\nand less shielding of the convection; therefore, the ra-\ndial distribution of plasma pressure and plasma current\nin the near-Earth tail may differ.\nTo conclude, we emphasize that, together with other fac-\ntors (IMF variations, etc.), the density\/temperature of the\nplasma sheet may considerably influence the substorm man-\nifestations and introduce a large variability in the behavior\nand appearance of the substorms. This could be an important\nissue to address in future (observation-based and simulation)\nstudies.\n4 Conclusions\nUsing fortunate radial configuration of ISTP, Cluster, and\nLANL spacecraft on 8 September 2002, supported by the\nmonitoring of global auroral activity and ionospheric cur-\nrents, we analysed the development of an isolated substorm\nwhich demonstrated both the classic features (textbook ex-\nample of growth\/expansion\/recovery phases with unprece-\ndented coverage of all basic regions) and some unusual prop-\nerties. The unusual aspect was that very strong tail current\ngrowth, magnetic energy loading and auroral oval expansion\nduring the growth phase (the phenomenon of tail overload-\ning) had an associated, unproportionally weak dissipation\nV. A. Sergeev et al.: Transition from substorm growth to substorm expansion 2197\nrate (with the absence of energetic particle injections) dur-\ning the following expansion phase. We argue that the plasma\nsheet state (density\/temperature) can influence the magneto-\ntail dynamics and its ionospheric manifestation in a num-\nber of ways and that the cold\/dense plasma sheet property\nin this event can be invoked to explain the weakness of dis-\nsipation signatures and the tail overloading observed. Con-\ncentrating on the phenomena around the onset we found that\nbasic signatures of substorm (expansion) onset in different\nphenomena\/regions mutually agree and that, although the\nnear-Earth current sheet was strongly thinned and intensified\n(j∼30 nA\/m2) before the onset, the sequence of events fa-\nvors the initiation of a substorm in the midtail region with\nthe subsequent involvement of the near-Earth region. The\nindirect evidence (lobe signatures of earthward-propagating\nnightside flux transfer events) was the first to be observed,\nsuggesting that the midtail magnetic reconnection could be\nthe parent process.\nOn the other hand, 12 min prior to this distinct onset, a\nclear, soft plasma injection to the GEO orbit was recorded\nwhich had little associated effects both in the ionosphere and\nin the transition region at ∼9RE . This pseudo-breakup was\nprobably due to either (very localized) a ballooning-type ac-\ntivity or due to the braking of very narrow BBF. There is still\na large opportunity for various mechanisms or their combina-\ntions to be considered, so the problem still waits for system-\natic studies of observations with THEMIS-like radial space-\ncraft configurations.\nAcknowledgements. We thank O. Troshichev for PC-index from\nVostok station; WDC-C Kyoto for SYM and ASY indices, SAM-\nNET team for the pulsation data and T. Bo¨singer for Crete mag-\nnetometer data, WIND and ACE teams for their data available via\nCDAWeb data base. J. Scudder and C. T. Russel are PIs of HYDRA\nand MFI instruments at Polar, and A. Balogh and H. Re`me are PIs\nof FGM and CIS instruments at Cluster. The work by V. A. Sergeev\nand M. V. Kubyshkina was partly supported by RFBR grants 04-\n05-64932 and 03-05-20012, as well as INTAS grant 03-51-3738.\nV. A. Sergeev thanks the Austrian Academy of Science and Finnish\nMeteorological Institute for support during his stays in Graz and\nHelsinki.\nReferences\nAsano, Y., Mukai, T., Hoshino, M., Saito, Y., Hayakawa, H.,\nand Nagai, T.: Statistical study of thin current sheet evo-\nlution around substorm onset, J. Geophys. Res., 109, A5,\ndoi:10.1029\/2004JA010413, 2004.\nBaker, D. N., Higbie, P. R., Hones, E. W., and Belian, R. D.:\nHigh-resolution energetic particle measurements at 6.6RE , 3,\nLow-energy electron anisotropies and short-term substorm pre-\ndictions, J. Geophys. Res., 83, 4863–4868, 1978.\nBaker D. N., Pulkkinen, T. I., Angelopoulos, V., Baumjohann, W.,\nand McPherron, R. L.: Neutral line model of substorms: Past\nresults and present view, J. Geophys. Res., 101, 12 975–13 010,\n1996.\nBaker, D. N., Peterson, W. K., Eriksson, S., Li, X., Blake, J.\nB., et al.: Timing of magnetic reconnection initiation during a\nglobal magnetospheric substorm onset, Geophys. Res. Lett., 29,\ndoi:10.1029\/2002GL015539, 2002.\nErickson, G. M., Maynard, N. C., Burke, W. J., Wilson, G. R., and\nHeinemann, M. A.: Electromagnetics of substorm onsets in the\nnear-geosynchronous plasma sheet, J. Geophys. Res., 105, A11,\n25265–25290, 2000.\nKennell, C. F.: The Kiruna conjecture: the strong version, in: Sub-\nstorms 1, Eur. Space Agency Spec. Publ. SP-335, 599–602, 1992.\nKubyshkina, M. V., Sergeev, V. A., and Pulkkinen, T. I.: Hybrid\nInput Algorithm: An event-oriented magnetospheric model, J.\nGeophys. Res., 104, A11 , 24 977–24 994, 1999.\nLaakso, H.: Variation of the spacecraft potential in the magneto-\nsphere, J. Atm. Solar-Terr. Phys., 64, 1735–1744, 2002.\nLui, A. T. Y., Lopez, R. E., Anderson, B. J., Takahashi, K., Zanetti,\nL. J., McEntire, R. W., Potemra, T. A., Klumpar, D., Grene, E.\nM., and Strangeway, R.: Current disruptions in the near-Earth\nneutral sheet region, J. Geophys. Res., 97, 1461–1480, 1992.\nLyons, L. R., Liu, S., Ruohoniemi, J. M., Solovyev, S. I.,\nand Samson, J.C.: Observations of dayside convection reduc-\ntion leading to substorm onset, J. Geophys. Res., 108, A3,\ndoi:10.1029\/2002JA009670, 2003.\nMende, S. B., Frey, H. U., Morsony, B. J., and Immel, T. J.: Statis-\ntical behavior of proton and electron auroras during substorms,\nJ. Geophys. Res., 108, A9, doi:10.1029\/2002JA009751, 2003.\nMersmann U., Baumjohann, W., Kuppers, F., and Lange, K.: Anal-\nysis of an eastward electrojet by means of upward continuation\nof ground-based magnetometer data, J. Geophys., 46, 281–298,\n1979.\nNagai, T., Fujimoto, M., Saito, Y., Machida, S., Terasawa, T., Naka-\nmura, R., Yamamoto, T., Mukai, T., Nishida, A., and Kokubun,\nS.: Structure and dynamics of magnetic reconnection for sub-\nstorm onsets with Geotail observations, J. Geophys. Res., 103,\nA3, 4419–4440, 1998.\nNewell, P. T., Liou, K., Sotirelis, T., and Meng, C.-I.: Auro-\nral precipitation power during substorms: A Polar-UV Imager-\nbased superimposed epoch analysis, J. Geophys. Res., 106, A12,\n28 885–28 896, 2001.\nOhtani, S.-I.: Earthward expansion of tail current disruption: Dual-\nsatellite study, J. Geophys. Res., 103, A4, 6815–6825, 1998.\nPellinen, R. J., Baumjohann, W., Heikkila, W. J., Sergeev, V. A.,\nYahnin, A. G., Marklund, G., and Melnikov, A. O.: Event study\nof presubstorm phases and their relation on the energy coupling\nbetween solar wind and magnetosphere, Planet. Space Sci., 30,\n4, 371–388, 1982.\nPetrukovich, A. A., Mukai, T., Kokubun, S., Romanov, S., Saito, Y.,\nYamamoto, T., and Zelenyi, L. M. : Substorm-associated pres-\nsure variations in the magnetotail plasma sheet and lobe, J. Geo-\nphys. Res., 104, A3, 4501–4514, 1999.\nPulkkinen, T. I., Kubyshkina, M. V., Baker, D. N., Cogger, L. L.,\nKokubun, S., Mukai, T., Singer, H. J., Slavin, J. A., and Zelenyi,\nL. M.: Magnetotail currents during the growth phase and lo-\ncal auroral breakup, in: Magnetospheric current systems, edited\nby: Ohtani, S. Ohtani,S.-I., Fujii, R., Hesse, M., and Lysak, R.\nL., Geophys. Monograph 118, AGU, 81–90, 2000.\nRoux, A., Perraut, S., Robert, P., Morane, A., Pedersen, A., et al.:\nPlasma sheet instability related to the westward traveling surge,\nJ. Geophys. Res., 96, A10, 17 697–17 714, 1991.\nSauvaud, J.-A., Louarn, P., Fruit, G., Stenuit, H., Vallat, C., Dan-\ndouras, J., Re`me, H., et al.: Case studies of the dynamics of iono-\nspheric ions in the Earths magnetotail, J. Geophys. Res., 109, A1,\ndoi:10.1029\/2003JA009996, 2004.\nSemenov, V. S, Penz, T., Heyn, M. F., Ivanov, I. B., Kubyshkin,\n2198 V. A. Sergeev et al.: Transition from substorm growth to substorm expansion\nI. V., Biernat, H. K., and Ivanova, V. V.: Reconstruction of the\nreconnection rate from magnetic field disturbances in an incom-\npressible plasma, Recent Res. Devel. Plasmas, in press, 2004.\nSergeev V. A., Semenov, V. S., and Sidneva, M. V.: Impul-\nsive reconnection in the magnetotail during substorm expansion,\nPlanet. Space Sci., 35, 9, 1199–1212, 1987.\nSergeev, V. A., Elphic, R. C., Mozer, F. S., Saint-Marc, A., and\nSauvaud, J. A.: A two-satellite study of nightside flux transfer\nevents in the plasma sheet, Planet. Space Sci., 40, 1551–1572,\n1992a.\nSergeev, V. A., Bosinger, T., Belian, R. D., Reeves, G. D., and Cay-\nton, T. E.: Drifting holes in the energetic electron flux at geosyn-\nchronous orbit following substorm onset, J. Geophys. Res., 97,\n6541–6548, 1992b.\nSergeev, V. A., Dmitrieva, N. P., Timofeev, E. E., Liou, K.,\nMiyashita, Y., Mukai, T., and Pulkkinen, T.: Strong control of\nauroral precipitation by plasma sheet parameters and the problem\nof pseudobreakups, Substorms-7, Proc. of the 7th of Intern. Conf.\non Substorms, edited by: by Ganushkina, N. and Pulkkinen, T.,\nFinnish Meteorol. Inst. reports, N 2004:5, 182–185, 2004.\nShukhtina, M. A., Dmitrieva, N. P., and Sergeev, V. A.: Quan-\ntitative magnetotail characteristics of different magnetospheric\nstates, Ann. Geophys., 22, 1019–1032, 2004,\nSRef-ID: 1432-0576\/ag\/2004-22-1019.\nSitnov, M. I., Sharma, A. S., Guzdar, P. N., and Yoon, P. H.: Recon-\nnection onset in the tail of Earths magnetosphere, J. Geophys.\nRes., 107, A3, doi:10.1029\/2001JA009148, 2002.\nSlavin, J. A., Fairfield, D. H., Lepping, R. P., Hesse, M., Ieda, A.,\nTanskanen, E., Ostgaard, N., Mukai, T., Nagai, T., Singer, H.\nJ., and Sutcliffe, P. R.: Simultaneous observations of Earthward\nflow bursts and plasmoid ejection during magnetospheric sub-\nstorms, J. Geophys. Res., 107, A7, doi:10.1029\/2000JA003501,\n2002.\nSlavin, J. A., Lepping, R. P., Gjerloev, J., Fairfield, D. H., Hesse,\nM., Owen, C. J., Moldwin, M. B., Nagai, T., Ieda, A., and Mukai,\nT.: Geotail observations of magnetic flux ropes in the plasma\nsheet, J. Geophys. Res., 108, A1, doi:10.1029\/2002JA009557,\n2003a.\nSlavin, J. A., Lepping, R. P., Gjerloev, J., Goldstein, M. L., Fair-\nfield, D. H., Acun˜a, M. H., Balogh, A., Dunlop, M., Kivelson,\nM. G., Khurana, K., Fazakerley, A., Owen, C. J., Re`me, H., and\nBosqued, J. M.: Cluster electric current density measurements\nwithin a magnetic flux rope in the plasma sheet, Geophys. Res.\nLett., 30, N7, doi:10.1029\/2002JA016411, 2003b.\nTerasawa, T., Fujimoto, M., Mukai T., et al.: Solar wind con-\ntrol of density and temperature in the near-Earth plasma sheet:\nWIND\/Geotail collaboration, Geophys. Res. Lett., 24, 935–938,\n1997.\nThomsen, M. F., Borovsky, J. E., Skoug, R. M., and Smith, C. W.:\nDelivery of cold, dense plasma sheet material into the near-Earth\nregion, J. Geophys. Res., 108, A4, doi:10.1029\/2002JA009544,\n2003.\nTsyganenko, N. A.: A magnetospheric magnetic field model with a\nwarped tail current sheet, Planet. Space Sci., 37, 5–20, 1989.\nVanhamaki, H., Amm, O., and Viljanen, A.: 1-dimensional up-\nward continuation of the ground magnetic field disturbance us-\ning spherical elementary current systems, Earth Planets Space,\n55, 613–620, 2003.\nYahnin, A. G., Sergeev, V. A., Bosinger, T., Sergienko, T. I., Ko-\nrnilov, I. A., Borodkova, N. L., Thomsen, M. F., Belian, R. D.,\nSauvaud, J.-A., Lutsenko, V. N., and Skalsky, A. A.: Correlated\nInterball\/ ground-gased observations of isolated substorm: The\npseudo-breakup Phase, Ann. Geophys., 19, 687–698, 2001,\nSRef-ID: 1432-0576\/ag\/2001-19-687.\n"}