{"doi":"10.1080\/09687760802315895","coreId":"14117","oai":"oai:generic.eprints.org:742\/core5","identifiers":["oai:generic.eprints.org:742\/core5","10.1080\/09687760802315895"],"title":"Web based lecture technologies: blurring the boundaries between face to face and distance learning","authors":["Woo, Karen","Gosper, Maree","McNeill, Margot","Preston, Greg","Green, David","Phillips, Rob"],"enrichments":{"references":[{"id":1042139,"title":"An exploration into the reactions of undergraduate students to virtual lectures. Paper presented at the OLT,","authors":[],"date":"2003","doi":null,"raw":"Signor, L. 2003. An exploration into the reactions of undergraduate students to virtual lectures. Paper presented at the OLT, November 5, in Queensland, Australia.","cites":null},{"id":195231,"title":"Australian university student finances","authors":[],"date":"2007","doi":null,"raw":"Australian Vice-Chancellor’s Committee. 2007. Australian university student finances 2006. http:\/\/ www.cshe.unimelb.edu.au\/pdfs\/StudentFinances2006.pdf.","cites":null},{"id":447147,"title":"Barriers to learning in distance education.","authors":[],"date":"1997","doi":null,"raw":"Galusha, J.M. 1997. Barriers to learning in distance education.  Interpersonal Computing and Technology 5: 6–14. http:\/\/www.infrastruction.com\/barriers.htm.","cites":null},{"id":447149,"title":"Blending on and off campus: A tale of two cities.","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":1877925,"title":"Blending on and off campus: A tale of two cities. In Handbook of blended learning environments: Global perspectives, local designs,","authors":[],"date":"2006","doi":null,"raw":"Lefoe, G., and J. Hedberg. 2006. Blending on and off campus: A tale of two cities. In Handbook of blended learning environments: Global perspectives, local designs, ed. C. Bonk and C. Graham, 325–37. San Francisco: Pfeiffer.ALT-J, Research in Learning Technology   93 Maag, M. 2006. iPod, uPod? An emerging mobile learning tool in nursing education and students’ satisfaction. Paper presented at the Australasian Society for Computers in Learning in Tertiary Education (ASCILITE) Conference, December 3–6, in Sydney, Australia.","cites":null},{"id":1042136,"title":"Challenging the primacy of lectures: The dissonance between theory and practice in University teaching.","authors":[],"date":"2005","doi":null,"raw":"Phillips, R. 2005. Challenging the primacy of lectures: The dissonance between theory and practice in University teaching.  Journal of University Teaching and Learning Practice  2. http:\/\/ jutlp.uow.edu.au\/2005_v02_i01\/phillips003.html.","cites":null},{"id":446917,"title":"Development and use of the approaches to teaching inventory.","authors":[],"date":"2004","doi":"10.1007\/s10648-004-0007-9","raw":"Trigwell, K., and M. Prosser. 2004. Development and use of the approaches to teaching inventory. Educational Psychology Review 16: 409–24.","cites":null},{"id":195230,"title":"Distance learning – Social software’s killer ap? http:\/\/www.unisa.edu.au\/ odlaaconference\/PPDF2s\/13%20odlaa%20-%20Anderson.pdf.","authors":[],"date":"2005","doi":null,"raw":"Anderson, T. 2005. Distance learning – Social software’s killer ap? http:\/\/www.unisa.edu.au\/ odlaaconference\/PPDF2s\/13%20odlaa%20-%20Anderson.pdf.","cites":null},{"id":1042132,"title":"Does attendance matter? An examination of student attitudes, participation, performance and attendance?","authors":[],"date":"2006","doi":null,"raw":"Massingham, P. and T. Herrington. 2006. Does attendance matter? An examination of student attitudes, participation, performance and attendance?  Journal of University Teaching and Learning Practice 3. http:\/\/www.dest.gov.au\/highered\/eippubs\/eip02_6\/eip02_6.pdf.","cites":null},{"id":446916,"title":"Impact of video recorded lectures among students. Paper presented at the Australasian Society for Computers","authors":[],"date":"2006","doi":null,"raw":"Soong, S.K.A., K.L. Chan, C. Cheers, and C. Hu. 2006. Impact of video recorded lectures among students. Paper presented at the Australasian Society for Computers in Learning in Tertiary Education (ASCILITE) Conference, December 3–6, in Sydney, Australia.","cites":null},{"id":195232,"title":"Interactivity as a criterion for media selection in distance education.","authors":[],"date":"1991","doi":null,"raw":"Bates, A.W. 1991. Interactivity as a criterion for media selection in distance education. Never Too Far 16: 5–9.","cites":null},{"id":447146,"title":"Internet streaming of lectures; A matter of style. http:\/\/www.lectopia.uwa.edu.au\/ misc\/Fardon_Matter Of Style.pdf.","authors":[],"date":"2003","doi":null,"raw":"Fardon, M. 2003. Internet streaming of lectures; A matter of style. http:\/\/www.lectopia.uwa.edu.au\/ misc\/Fardon_Matter Of Style.pdf.","cites":null},{"id":1042131,"title":"iPod, uPod? An emerging mobile learning tool in nursing education and students’ satisfaction. Paper presented at the Australasian Society for Computers","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":446915,"title":"Learning for success: Distance education students’ use of their learning materials.","authors":[],"date":"2006","doi":null,"raw":"Smith, A., and E. Smith. 2006. Learning for success: Distance education students’ use of their learning materials. Journal of University Teaching and Learning Practice. http:\/\/jutlp.uow.edu.au\/ 2006_v03_i01\/pdf\/smith_007.pdf.","cites":null},{"id":195235,"title":"Lecture streaming: Getting the pedagogy right. Paper presented at the OLT,","authors":[],"date":"2004","doi":null,"raw":"Donnan, P., M. Kiley, and C. McCormack. 2004. Lecture streaming: Getting the pedagogy right. Paper presented at the OLT, November 3, in Queensland, Australia.","cites":null},{"id":1042134,"title":"Managing study and work: The impact of full-time study and paid work on the undergraduate experience in Australian universities.","authors":[],"date":"2002","doi":null,"raw":"McInnis, C., and R. Hartley. 2002. Managing study and work: The impact of full-time study and paid work on the undergraduate experience in Australian universities. Department of Education, Science and Training, Commonwealth of Australia. http:\/\/www.dest.gov.au\/highered\/eippubs\/ eip02_6\/eip02_6.pdf.","cites":null},{"id":1877952,"title":"Podcasting, student learning and expectations. Paper presented at the Australasian Society for Computers","authors":[],"date":"2006","doi":null,"raw":"Tynan, B., and S. Colbran. 2006. Podcasting, student learning and expectations. Paper presented at the Australasian Society for Computers in Learning in Tertiary Education (ASCILITE) Conference, December 3–6, in Sydney, Australia.","cites":null},{"id":1877954,"title":"Recording lectures and the impact on student attendance. Paper presented at ALT-C,","authors":[],"date":"2007","doi":null,"raw":"Williams, J., and M. Fardon. 2007. Recording lectures and the impact on student attendance. Paper presented at ALT-C, September 4–6, in Nottingham, UK.","cites":null},{"id":195234,"title":"Research design: Qualitative, quantitative and mixed methods approaches. Thousand Oaks,","authors":[],"date":"2003","doi":"10.1177\/1558689806294476","raw":"Creswell, J.W. 2003. Research design: Qualitative, quantitative and mixed methods approaches. Thousand Oaks, CA: Sage.","cites":null},{"id":447148,"title":"Student test scores are improved in a virtual learning environment.","authors":[],"date":"2000","doi":null,"raw":"Goldberg, H.R., and G.M. McKhann. 2000. Student test scores are improved in a virtual learning environment. Advance Physiological Education 23: 59–66.","cites":null},{"id":446914,"title":"Supporting students in open and distance education. Open and Distance Learning Series.","authors":[],"date":"2000","doi":"10.1080\/02680513.2013.847363","raw":"Simpson, O. 2000. Supporting students in open and distance education. Open and Distance Learning Series. London: Kogan Page.","cites":null},{"id":1042135,"title":"The","authors":[],"date":"2008","doi":null,"raw":"———. 2008. The 2008 Horizon Report. Austin, TX: The New Media Consortium and Boulder, CO: EDUCAUSE Learning Initiative. http:\/\/www.nmc.org\/pdf\/2008-Horizon-Report.pdf.","cites":null},{"id":195233,"title":"The revised two-factor Study Process Questionnaire: R-SPQ-2F.","authors":[],"date":"2001","doi":"10.1348\/000709901158433","raw":"Biggs, J., D. Kember, and D.Y.P. Leung, 2001. The revised two-factor Study Process Questionnaire: R-SPQ-2F. British Journal of Educational Psychology 71: 133–49.","cites":null},{"id":1042138,"title":"The undergraduate experience of blended e-learning: A review of UK literature and practice. The Higher Education Academy.","authors":[],"date":"2006","doi":null,"raw":"Sharpe, R., G. Benfield, G. Roberts, and R. Francis. 2006. The undergraduate experience of blended e-learning: A review of UK literature and practice. The Higher Education Academy. http:\/\/ www.heacademy.ac.uk\/assets\/York\/documents\/ourwork\/research\/literature_reviews\/blended_ elearning_full_review.pdf.","cites":null},{"id":1042137,"title":"Why don’t students attend lectures and what can be done about it through using iPod nanos? Paper presented at the Australasian Society for Computers","authors":[],"date":"2006","doi":null,"raw":"Shannon, S.J. 2006. Why don’t students attend lectures and what can be done about it through using iPod nanos? Paper presented at the Australasian Society for Computers in Learning in Tertiary Education (ASCILITE) Conference, December 3–6, in Sydney, Australia.","cites":null},{"id":1042133,"title":"You, me and iLecture. Paper presented at the Australasian Society for Computers","authors":[],"date":"2006","doi":null,"raw":"McElroy, J., and Y. Blount. 2006. You, me and iLecture. Paper presented at the Australasian Society for Computers in Learning in Tertiary Education (ASCILITE) Conference, December 3–6, in Sydney, Australia.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-06","abstract":"Web based lecture technologies (WBLT) have gained popularity amongst universities in Australia as a tool for delivering lecture recordings to students in close to real time. This paper reports on a selection of results from a larger research project investigating the impact of WBLT on teaching and learning. Results show that while staff see the advantages for external students, they question the extent to which these advantages apply to internal students. In contrast both cohorts of students were positive about the benefits of the technologies for their learning and they adopted similar strategies for their use. With the help of other technologies, some external students and staff even found WBLT useful for fostering communication between internal and external students. As such, while the traditional boundary between internal and external students seems to remain for some staff, students seem to find the boundary much less clear","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14117.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/742\/1\/ALT_J%2DVol16_No2_2008_Web_based_lecture_techn.pdf","pdfHashValue":"6dd5b29fce461b143da8d543470e7432d08ea72e","publisher":"Taylor and Francis Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:742<\/identifier><datestamp>\n      2011-04-04T09:00:34Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/742\/<\/dc:relation><dc:title>\n        Web based lecture technologies: blurring the boundaries between face to face and distance learning<\/dc:title><dc:creator>\n        Woo, Karen<\/dc:creator><dc:creator>\n        Gosper, Maree<\/dc:creator><dc:creator>\n        McNeill, Margot<\/dc:creator><dc:creator>\n        Preston, Greg<\/dc:creator><dc:creator>\n        Green, David<\/dc:creator><dc:creator>\n        Phillips, Rob<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Web based lecture technologies (WBLT) have gained popularity amongst universities in Australia as a tool for delivering lecture recordings to students in close to real time. This paper reports on a selection of results from a larger research project investigating the impact of WBLT on teaching and learning. Results show that while staff see the advantages for external students, they question the extent to which these advantages apply to internal students. In contrast both cohorts of students were positive about the benefits of the technologies for their learning and they adopted similar strategies for their use. With the help of other technologies, some external students and staff even found WBLT useful for fostering communication between internal and external students. As such, while the traditional boundary between internal and external students seems to remain for some staff, students seem to find the boundary much less clear.<\/dc:description><dc:publisher>\n        Taylor and Francis Ltd<\/dc:publisher><dc:date>\n        2008-06<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/742\/1\/ALT_J-Vol16_No2_2008_Web_based_lecture_techn.pdf<\/dc:identifier><dc:identifier>\n          Woo, Karen and Gosper, Maree and McNeill, Margot and Preston, Greg and Green, David and Phillips, Rob  (2008) Web based lecture technologies: blurring the boundaries between face to face and distance learning.  Association for Learning Technology Journal, 16 (2).  pp. 81-93.  ISSN 0968-7769 (print)\/1741-1629 (online)     <\/dc:identifier><dc:relation>\n        10.1080\/09687760802315895<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/742\/","10.1080\/09687760802315895"],"year":2008,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"ALT-J, Research in Learning Technology\nVol. 16, No. 2, June 2008, 81–93\nISSN 0968-7769 print\/ISSN 1741-1629 online\n© 2008 Association for Learning Technology\nDOI: 10.1080\/09687760802315895\nhttp:\/\/www.informaworld.com\nWeb-based lecture technologies: blurring the boundaries between\nface-to-face and distance learning\nKaren Wooa*, Maree Gospera, Margot McNeilla, Greg Prestonb, David Greenc and Rob \nPhillipsd\naLearning and Teaching Centre, Macquarie University, Sydney, Australia; bSchool of Education, \nUniversity of Newcastle, UK; cStaff Development & Training Unit, Flinders University, Adelaide, \nAustralia; dTeaching and Learning Centre, Murdoch University, Perth, Australia\nTaylor and Francis LtdCALT_A_331756.sgm10.1080\/09687760802315895ALT-J, Research in Learning Technology0968 7769 (pri t)\/1741-1629 (onli e)Original Article2 0 & Fran is6 000June 2008K renWook ren.woo@mq.edu.au\nWeb-based lecture technologies (WBLT) have gained popularity amongst universities in\nAustralia as a tool for delivering lecture recordings to students in close to real time. This\npaper reports on a selection of results from a larger research project investigating the\nimpact of WBLT on teaching and learning. Results show that while staff see the\nadvantages for external students, they question the extent to which these advantages\napply to internal students. In contrast both cohorts of students were positive about the\nbenefits of the technologies for their learning and they adopted similar strategies for their\nuse. With the help of other technologies, some external students and staff even found\nWBLT useful for fostering communication between internal and external students. As\nsuch, while the traditional boundary between internal and external students seems to\nremain for some staff, students seem to find the boundary much less clear.\nKeywords: web-based lecture technologies; staff perception; student perception;\ndistance education; external students; internal students; Lectopia\nIntroduction\nThe gap between students’ perception of technology and that of faculty continues to widen.\nStudents and faculty continue to view and experience technology very differently … At the\nsame time, students’ expectations are important, and successful learning-focused organizations\nhave long known they ignore these expectations at their peril. (New Media Consortium 2008, 7)\nThe student profile in higher education is changing. Many need to accommodate work or\nfamily commitments while studying (Australian Vice-Chancellor’s Committee 2007;\nMcInnis and Hartley 2002). These needs may not be met by ‘traditional on-campus teach-\ning paradigms’ (Lefoe and Albury 2004). As a consequence, some universities are utilising\ntechnologies to combine some of the flexibility of distance education models with the\nbenefits of interactions between peers and lecturers in on-campus study. Blended learning\nmodels supported by a range of technologies have emerged which combine, for example,\nface-to-face lectures and\/or tutorials with supplementary online resources and discussion\nforums (Lefoe and Hedberg 2006; Phillips 2005; Sharpe et al. 2006). As suggested by\nLefoe and Albury (2004), ‘the teaching, delivery methods and resources once used only for\none area are now used to support learning in both’. This, in effect, is blurring the bound-\naries between campus-based and distance education.\n*Corresponding author. Email: karen.woo@mq.edu.au\n82  K. Woo et al.\nWhere once we may have assumed that those not present in a lecture were indeed\ndistance students studying from afar, this is not necessarily the case any more. One of the\ntechnologies used to blur the boundaries between on-campus and distance study is web-\nbased lecture technologies (WBLT). These technologies are best described as distributed\nrecording systems for digitally capturing face-to-face lectures for web delivery. They are\nessentially a one-way medium of communication which is well suited to the delivery of\nlecture content in close to real time. Lectopia (previously known as iLecture and more\nrecently Echo 360), a propriety software solution, is an example of this type of technology\n(Lectopia 2007). The recordings are typically delivered through a password-protected\nlearning management system, such as BlackBoard or WebCT.\nIn the past, some universities have offered tape recordings of lectures to distance educa-\ntion students to supplement print-based study materials. These recordings have also enabled\non-campus students to catch up on missed lectures or revisit the content for review\npurposes. Whilst transferring from a tape-based to web-based delivery may seem trivial at\nfirst sight, these technologies have become somewhat controversial amongst lecturers\nbecause of their potentially negative effects on lecture attendance and consequently the\nquality of student learning for internal students (Massingham and Herrington 2006).\nOn the other hand, there seems to be less controversy on the impact of WBLT on\nstudents who study in an external mode and do not normally attend class. Indeed, a\nperceived positive feature is that lecture content can be captured together with day-to-day\nupdates, anecdotes, and discussions which provide external students with a richness not\navailable in pre-prepared materials. Because of the immediacy of delivery to students, there\nis also the potential to provide entrée into follow-up online discussions or similar activities.\nAs such, anecdotally there appears to be an acceptance that WBLT enhance the experience\nof external students.\nAnderson (2005) suggests that a positive educational experience for students studying at\na distance involves three types of interactions: students’ interactions with the content, with\ntheir teacher and with other students. Prior to the popularisation of the internet, most inter-\nactions experienced by either distance education or on-campus students were with content,\nwhether it be learning materials, text books or printed notes (Bates 1991). With little\nstudent–student interaction and teacher–student interaction, distance education has tradi-\ntionally been ‘perceived and experienced as a lonely way to learn’ (Anderson 2005; Galusha\n1997; Simpson 2000), with learners relying to a large extent on their own motivation (Smith\nand Smith 2006). The more recent use of internet-based communication via email or discus-\nsion forums in learning management systems has helped greatly to ease the loneliness of\ndistance learning. By providing close to real-time lectures it is worth entertaining the possi-\nbility of WBLT helping to break down this isolation further and helping to motivate\nstudents to learn, particularly if lecturers acknowledge and cater for the presence of students\nother than those visible in the lecture room. In combination with communication technolo-\ngies such as discussion forums, student to student and student to teacher interactions can be\nestablished to emulate on-campus interactions.\nIf the use of WBLT can enhance the experience of external students, why should they\nnot also be beneficial to internal students who cannot attend lectures? Indeed, existing\nstudies indicate an increasing uptake of these technologies by internal students requiring\nflexible access to lectures due to a variety of reasons including timetable clashes, work\ncommitments, disability, medical conditions or illness (Williams and Fardon 2007).\nWith internal students taking advantage of the flexibility offered by WBLT and not attend-\ning lectures, the boundaries between the experiences offered to internal and external students\nare already beginning to blur. While the blurring may be a reality for students – with internal\nALT-J, Research in Learning Technology   83\nstudents adopting lecture attendance patterns of external students and externals having access\nto the same real-time lecture as internals – this may not be the case for staff. It is likely that\nstaff are still viewing internal and external students as separate cohorts, with different needs\nand expectations. If this is the case, then the mismatch between the expectations of students\nand those of staff will have important implications for learning and teaching – the role of\nlectures, the way they are delivered and the way students and staff communicate and\ncollaborate.\nIt is timely, therefore, to explore the nature of the experience of WBLT for internal and\nexternal students – whether they use the technology in different ways, have different percep-\ntions of the benefits for their learning and whether WBLT can facilitate communication and\ncollaboration between the cohorts.\nThese are some of the issues that the authors explored in a large research study inves-\ntigating how web-based lecture technologies can be used to best effect to support learning\nand teaching. Further details about the project are available on the project website at:\nhttp:\/\/www.cpd.mq.edu.au\/teaching\/wblt\/overview.htm.\nIn this paper we will report on the issues relating to the mismatch in staff and student\nperceptions of WBLT for internal and external students. In particular the paper will focus\non three questions: \n● Do internal and external students have different perceptions of the benefits of WBLT\nfor their learning?\n● Do internal and external students use WBLT differently?\n● Do WBLT facilitate communication and collaboration for external students and\ninternal students?\nIn light of the changing student profile, for this research the term ‘internal’ refers to\nstudents enrolled in internal mode, where the expectation is for them to come regularly to\ncampus for lectures and other activities. ‘External’ refers to students enrolled in external\nmode; the expectation is that they will not be able to participate in regular on-campus\nlectures or activities.\nMethodology\nFour Australian universities were involved in the study. Three of the participating universities\nused different versions of Lectopia (Lectopia 2007). The fourth made use of a combination\nof streaming video\/audio and media files to deliver lecture materials across the university.\nThe four universities varied in their use of the media accompanying the recordings, which\nranged from audio alone to audio accompanied by slides or video. The delivery method also\nvaried encompassing streaming, downloading to computers or mobile devices and podcast-\ning. Variation was also present in the level of automation of the recording process, the level\nof centralised support, and the extent of adoption across campus. Despite the variations, we\nfound no significant differences between the results of different universities on the impact\nof WBLT in learning and teaching. As such, the rest of the paper will not distinguish between\nthe results from different universities.\nThe study employed a mixed methods approach (Creswell 2003), drawing on quantitative\nand qualitative data obtained from both students and staff who used WBLT. Three main data\ncollection activities undertaken were a student survey, a staff survey, and in-depth interviews\nwith both students and staff. The student and staff surveys aimed to provide a comprehensive\noverview of experiences of web-based lecture technologies, with a particular focus on\n84  K. Woo et al.\npedagogy and student learning. The interviews were designed to probe the emerging issues\nin greater detail.\nStudent and staff survey\nThe student survey collected data on four specific areas in relation to the students and their\nuse of WBLT: \n(1) Students’ experience of WBLT in the context of a specific subject including\nlecture attendance patterns, reasons for attending lectures and using WBLT, and\nthe strategies employed when listening to WBLT;\n(2) Students’ approaches to learning using the Revised Two-factor Study Process\nQuestionnaire (Biggs, Kember, and Leung 2001);\n(3) Students’ overall experience of WBLT in relation to perceived benefits for learning\nand the achievement of better results; and\n(4) General demographic information (age, gender, language) and academic information\n(enrolment mode, area of study and length of study).\nThe process of developing the student survey involved collaboration from all four partici-\npating universities. Inputs were sought for the construction of the survey from previous\nresearch on the use of iLecture and similar technologies (Fardon 2003; McElroy and Blount\n2006) and the findings from various evaluation surveys and focus groups conducted at the\nfour participating universities about the experiences of staff and students. A mixture of\nquantitative and qualitative responses to survey questions was employed in order to identify\npatterns and trends as well as to provide qualifying explanations. Once an initial draft was\nproduced, feedback was collected from interested academics at each university and the\nsurvey was piloted with a cohort of 30 students from one of the participating universities.\nStudents from units\/courses making use of web-based lecture technologies at all four\nuniversities were invited to participate. Stratified sampling was used to identify a range of\ncourses \/units. The sample included representation from: \n● broad discipline areas\n● class sizes (fewer than 50 students, 50–200 and more than 200 students)\n● enrolment mode (internal and external students)\n● level (undergraduate and postgraduate).\nInvitations were sent to 13,278 students, but only those students who used the WBLT were\neligible to answer the survey. In total 815 responded, representing a subset of users. The\npercentage response rate could not be determined because we were unable to identify the\nactual number of students using WBLT. Nonetheless, the sample size was large enough for\nstatistically valid conclusions to be made.\nOf the 815 respondents, 702 identified themselves as being enrolled in internal\/on-\ncampus mode and 113 in external\/distance mode.\nThe staff survey was designed to correspond where possible with the student survey, so\nthat results could be compared. The survey collected data on four specific areas in relation\nto lecturers and their use of WBLT: \n(1) The teaching and curriculum context, including details of delivery mode and\ndiscipline area;\nALT-J, Research in Learning Technology   85\n(2) Lecturers’ perspective of teaching and their teaching philosophy, using Trigwell and\nProsser’s (2004) Approaches to Teaching Inventory;\n(3) The reasons for using WBLT and the strategies adopted; and\n(4) Perceptions of the effect of WBLT on lecture attendance and communication\npatterns between themselves and their students.\nA total of 676 academic teaching staff who had made use of WBLT were invited to participate\nin the survey and 155 (22.9%) responded from across the four universities.\nThe interviews of staff and students aimed to provide a contextualised view of the\nissues that arose from the surveys. In particular they were designed to be descriptive in\nnature in order to: highlight the manifestations of particular issues in different contexts;\nexplore the opportunities and challenges evident in these contexts; and provide examples of\ngood practice. Participants self nominated through the surveys and in total, six lecturers\nand 10 students were interviewed using a semi-structured instrument derived from the\nsurvey questions.\nData analysis\nThe statistical package SPSS was used to undertake analysis of the quantitative data and the\ngeneral descriptive data was supplemented by selective correlational analysis to further\nexplore the data set. Factorial analysis, analysis of variance and regression analysis were\nused to further explore the relationships between the independent and dependent variables.\nA significance level of p<.001 was used for correlations throughout the study. The Software\npackage NVivo was used to analyse the qualitative data, with the data being classified and\nline coded in relation to emerging themes.\nOverview of findings\nOverall there was a general mismatch between lecturers’ perceptions and students’ on the\npotential benefits of WBLT for student learning. How they differ, and whether lecturers’\nperceptions of how students use\/abuse WBLT is substantiated against students’ experiences\nwill be discussed. This will be followed by a closer examination of the differences between\nexternal and internal students, their perceptions of the benefits of WBLT, the way in which\nthe technologies are used and the ways in which WBLT can facilitate communication and\ncollaboration\nLecturers’ perceptions\nLecturers perceptions of WBLT were canvassed from three questions with responses based\non a five-point scale. They were asked whether: \n(1) their experience of using WBLT for teaching and learning was positive (almost\nalways to almost never);\n(2) using WBLT made it easier for your students to learn (yes – in a significant way to\nno – it was detrimental); and\n(3) using WBLT helped your students to achieve better results (yes – in a significant\nway to no – it was detrimental).\nIn general, lecturers seem to be rather negative in their experience with WBLT and their\nperceptions on WBLT’s benefits for student learning. Table 1 shows that less of half of the\n86  K. Woo et al.\nstaff respondents had an overall positive experience (47.5%) or agreed that WBLT made it\neasier for their students to learn (48.9%). An even lower percentage of lecturers (30.2%)\nwere positive about WBLT helping their students achieve better results.\nWhen designing the survey, the team did not foresee that lecturers would make a\ndistinction between benefits for internal and external students, so there were no quantitative\nquestions targeted at unravelling the differences. However, even without any promptings,\nmany lecturers made the distinction in their open-ended responses. They suggested that\nWBLT benefit external students through: \n● providing external students with up-to-date information;\n● increasing their sense of belonging; and\n● providing opportunities for interactions for external students.\nAt the same time, lecturers also commented on the detrimental impacts WBLT may have on\ninternal students’ learning, as typified by the comments: \nIt does support external students … On many points I would argue that [WBLT] enhance the\nstudy experience of external students, but generally diminish the study experience of internal\nstudents.\nFor internals I think it can help them to justify not coming to lectures. They think, ‘it’s OK not\nto go, I’ll listen to the iLecture later’. I fear later never comes or comes too late and they cram\nfor assessment. Externals, however, brilliant!\nAs illustrated by the second quote above, some lecturers were concerned that the availability\nof WBLT could give internal students a false sense of security, and without good self-\nmanagement skills, the students may never listen to the lecture.\nOther lecturers indicated that they were concerned that students may not attend lectures\nregularly and keep up-to-date with the unit: \n[WBLT] encourages internal students to think of lecture attendance as optional. Many students\nregularly only come to one lecture a week (on the same day as the tutorial) and miss the other\none. However they do not always listen to the [recording] of the lecture they have missed.\nConsequently they then take up class time asking questions about issues that were discussed\nextensively in the missed lecture, which is frustrating for the other students.\nEven if the internal students listen regularly, many lecturers commented that the quality of\ntheir experience could be diminished due to missing out on the group experience, the\nopportunity to ask questions, the enthusiasm and motivation associated with being present\nat the lecture, and the opportunity to get to know the lecturer. For the students who are only\nlistening, they were concerned they would also miss out on the non-verbal aspects of\ncommunication and the visual aids in the lectures.\nTable 1. Percentage of lecturers’ agreements on their overall experience with WBLT, and the\nbenefits of WBLT on aspects of student learning.\nStaff Overall (n = 134) (combining \nthe first two categories of the scales)\nPositive experience of staff 47.5%\nEasier to learn 48.9%\nAchieve better results 30.2%\nALT-J, Research in Learning Technology   87\nThe overall perception of lecturers that WBLT are more beneficial for externals than for\ninternals presents a mismatch with students’ experiences and their perceptions in relation to\nachieving better results and helping to learn.\nComparison between internal and external students’ perceptions of the effectiveness\nof WBLT\nThe perceptions of effectiveness of WBLT were canvassed from three questions which\nasked student respondents to rate on a five-point scale whether: \n(1) their overall experience of using WBLT was positive (almost always to almost\nnever);\n(2) using WBLT helped them to achieve better results (yes – in a significant way to no\n– it was detrimental); and\n(3) WBLT made it easier for them to learn (yes – in a significant way to no – it was\ndetrimental).\nTable 2 shows the percentages of respondents who expressed overall positive agreement\nwith these items. Agreement was calculated by combining the first two categories on the\nscale.\nIn regard to their overall experience, 76.3% of participants, whether studying in internal\nor external mode, reported they had a positive experience almost always or frequently.\nThere was no significant difference between external and internal students. The positive\nstudent responses are consistent with the general findings in the literature (Donnan, Kiley,\nand McCormack 2004; Goldberg and McKhann 2000; Maag 2006; McElroy and Blount\n2006; Shannon 2006; Signor 2003; Soong et al. 2006; Tynan and Colbran 2006; Williams\nand Fardon 2007).\nWhen asked whether using WBLT made it easier to learn, 79.9% of respondents agreed\nthat it had in either a significant or a moderate way. Once again, there was no significant\ndifference between responses for external and internal students. The external students being\ninterviewed highlighted the benefits of WBLT in providing another dimension to their\nlearning. One interviewee commented that using WBLT ‘makes it easier to learn than just\nrelying on notes’. Moreover, when looking at the open-ended responses and interviews, it\nappeared that the need for flexibility is the same for externals and internals. For example,\none of the external students being interviewed had two young children and found it very\nuseful to be able to listen to the recordings on an iPod whilst her daughters had ballet\nlessons. She commented that WBLT made it possible for her to keep up-to-date with the\ncourse. However, the same need for flexibility was required by an internal student who lived\nover an hour away from campus and needed to drop off her children at school at the time\nwhen the lecture was on.\nTable 2. Percentage of students’ agreement.\nInternal\n(n = 643)\nExternal\n(n = 103)\nAll students\n(n = 746)\nPositive experience 76.9% 72.6% 76.3%\nEasier to learn 79.5% 82.5% 79.9%\nAchieve better results* 65.6% 73.8% 66.8%\n* significant difference between internal and external students p < 0.001.\n88  K. Woo et al.\nWhen students were asked whether using WBLT helped them to achieve better results,\n66.7% of respondents agreed that it had in either a significant or a moderate way. There was\na significant difference between external and internal students with externals being more\nlikely to perceive that WBLT allowed them to achieve better results. Note that while there\nis a significant difference, almost two-thirds of the internal students were still positive about\nWBLT’s impact on helping them achieve better results.\nExternal students were passionate in their open-ended comments on the ways WBLT\nhelped them in terms of reducing isolation, providing guidance and clarification of issues,\nand increasing confidence and motivation: \niLecture is my lifesaver. As I study completely by external I find iLecture clarifies and explains\nany points I am struggling to grasp. iLecture also introduces materials that may not appear in\nthe Readings. I also find the iLecture that discusses exam preparations a vital source. Please\ndon’t take it away!\nStudying externally iLecture was an invaluable tool in keeping in touch with the expectations\nfor the subject. It is a major help with confidence and direction when you would otherwise as\nan external student be very unsure of expectations and requirements. Very helpful in keeping\non track.\nAs such, using WBLT seems to have lowered the barriers for external students and helped\nto provide more parity in their experience with internal students.\nComparison between internal and external students’ usage of WBLT\nTo understand how students were using the technology to support their learning, we asked\nstudents to respond to a number of usage patterns they may have adopted when using\nWBLT, as shown in Table 3. These patterns had been identified from previous research\n(McElroy and Blount 2006) and discussion with staff.\nThere were some significant differences between internal and external students in their\nusage patterns. External students were more likely to listen to the entire recording of the\nlecture, to listen regularly, and to listen to several weeks at a time. They were also less likely\nto listen and browse and stop at points of interest. Overall, they seemed more systematic in\ntheir approach to using WBLT. One reason for the difference could be that the recording is\nthe only way externals can access the lecture. Internals, on the other hand, have a choice of\nattending the lecture or listening to the recording.\nTable 3. Students’ usage patterns (% agreed).\nInternal\n(n = 643)\nExternal\n(n = 103)\nListen to entire recording* 69.0% 82.7%\nListen more than once 55.7% 55.1%\nListen regularly* 45.2% 76.5%\nBrowse and stop at points of \ninterest*\n37.7% 36.0%\nListen to several weeks at a time* 36.2% 59.4%\nChoose particular segments* 31.6% 23.6%\n* significant difference between internal and external students p < 0.001.\nALT-J, Research in Learning Technology   89\nNonetheless, the usage patterns adopted by the two groups were similar. The statement,\nI usually listen to the entire recording of the lecture, was at the top of the list for both\ngroups. Moreover, just over half of both groups of students agreed that they listen to the\nrecordings more than once. Overall this suggests that both groups of students used WBLT\nas a study tool. This is supported by students’ responses to a question about the ways WBLT\nwas used to support learning.\nAs shown in Table 4, both groups of students listed using WBLT to revise for exams, to\nrevisit complex ideas and concepts, and to work at their own pace as one of their top four\npurposes of use.\nThere were significant differences in two of the purposes. One of the differences was\nthat internals were more likely to use the technology to pick up things they missed in class,\nwhich clearly does not relate to external students, so a significant difference could be\nexpected. The second difference was that external students were more likely to use the\ntechnology to work at their own pace. This could be because internal students have the pace\nset by scheduled lectures and other on-campus activities. Externals, on the other hand, have\nmore freedom in determining their time and pace of study.\nIn sum, external students and internal students seem to use WBLT for their study in\nsimilar ways. Again, this reflects firstly the nature of the merge of the two cohorts – internal\nand external students are exhibiting similar patterns of studying. Secondly, it begs the\nquestion of why lecturers would believe that one group of students would benefit more from\nWBLT than the other if they are using the technologies in similar ways.\nFostering communication and collaboration for externals\nAs discussed earlier in the paper, one of the key issues for external students is the lack of\ninteraction with the teacher and other students, and the associated sense of isolation\n(Anderson 2005). While the previous section has demonstrated that WBLT provide\ninternal and external students with an extra tool to interact with the lecture content, our\nfindings also suggest that WBLT have potential for increasing other interactions. For\nexample, an internal student found that WBLT enhanced their communication with their\nlecturer: \nI can validate a question before I ask it. I can listen to the lecture maybe a few times then really\nrefine what I want to ask. I can then (with confidence) approach the lecturer to seek my answer\nbased on accurate reflections, not what I thought the lecture said.\nTable 4. Students’ purpose of use (% agreed).\nInternal\n(n = 643)\nExternal\n(n = 103)\nUsed to pick up on things I missed in class* 80.7% 54.5%\nUsed to revise for exams 77.4% 69.9%\nUsed to revisit complex ideas and concepts 76.7% 72.5%\nUsed to work at my own pace* 72.2% 84.8%\nUsed to take comprehensive notes 61.3% 70.4%\nUsed to pick up announcements and exam hints 61.2% 69.2%\nUsed to revisit as lecturer was unclear 21.2% 18.6%\n* significant difference between internal and external students p < 0.001.\n90  K. Woo et al.\nTo further explore the issue of communication, one of the open-ended questions included in\nthe student survey was: Have you experienced changes in the way you interact and commu-\nnicate with your fellow students and teaching staff? Please explain these changes. In\nresponse to this question, some external students commented that they felt less isolated and\nmore connected with the lecturer and other students as a result of using WBLT: \nHearing a lecturer’s voice makes them feel more real. So that when you write to them they are\na person not a figment of your imagination. Also when talking with others on WebCT I can\ndiscuss lectures if necessary.\nYes as an external it has been very helpful as you don’t feel so alone and through this I have\nmade regular contact and met a few of the students in my course.\nThe comments from these external students seem to indicate a move towards an experience\nthat is more like that of internal students. When asked about possible enhancements to the\ntechnologies, external students were more likely than internal students to report that they\nwould use WBLT more if discussions were captured or if podcasts were available. These\nfeatures can further add to an external student’s sense of becoming part of the class.\nStaff perspectives\nIn the staff survey, staff were asked about the impact of WBLT on communication with\nstudents. 58.2% of staff reported no significant change or that they were not sure of any\nchanges. Those who noticed changes were divided on whether the change had been positive.\nLecturers who felt positive about the change in communication noted benefits for external\nstudents, for example: \nIt assists distance learning students who want a ‘voice’ – adds some interaction.\nContact with the external students is much improved, as most access the lecture soon after its\nactual delivery. Feedback and discussion of topics is much improved.\nI have had students say that the iLecture makes them feel a part of the group, that they ‘know’\nme. One student told me she calls out answers to the questions, talks back to the iLecture and\nchips the internals for being too slow to volunteer answers.\nIn one of the staff interviews the benefits of broadening the range of collaboration opportu-\nnities between external and on-campus students was highlighted: \nI started directly talking to the external students during (WBLT) recording … I could ask\nquestions in a lecture and within an hour or two externals have heard the lecture, heard the\nquestion and posted on the discussion forum their responses to the questions, so it’s more of a\nunited group of students now.\nThere were also signs that a community was being built between internal and external\nstudents. The same lecturer found that ‘the students are helping each other more and more,\nnot just with concepts but also supporting each other emotionally’.\nThe lecturers who feel the impact has been negative considered it in the context of\nreduced attendance and difficulty in communication with internal students: \nI do not have the chance to get to know the students face-to-face unless they are in my tutorials.\nThe class itself misses the chance to share a communal experience where students can interact\nwith each other.\nALT-J, Research in Learning Technology   91\nRecorded lectures have far less human impact than live ones. I find a growing sense of distance\nand alienation. Students are less likely to come and talk to me. They are far less often on\ncampus, and so make poor use of the library as well.\nThe examples provide insights into the way in which these technologies can influence the\nlearning experience beyond the mere delivery of content. They have demonstrated the\npotential for WBLT to foster communication and collaboration between the previously\ndivided groups of internal and external students. Some of the lecturers have also indicated\nthat the technology has enabled the growth of a sense of community between the two groups\nthat was previously not possible – another illustration of how the boundaries between\ninternal and external students are eroding.\nThe examples given also indicate the impact can be negative, as well as positive. As the\nlast two examples rightly indicate, the traditional way of doing things and the dynamic\nbetween staff and students will change. For those wedded to the status quo, this can be\nchallenging.\nOn the positive side, the examples provided have identified ways in which communica-\ntion and collaboration can be enhanced. In these examples, staff and students have remained\nalert and seized the opportunities offered through the technology that have arisen. More\nwork needs to be done to identify other strategies adopted by students and staff so they can\nbe proactively integrated into the teaching and learning environment from the outset.\nConclusion\nThe use of WBLT has provided both internal and external students with a high degree of\nflexibility in access to lectures. Although external students appeared to be more systematic\nin their usage patterns, both internal and external students used WBLT in similar ways to\nsupport their learning and were generally positive about their experience of using WBLT.\nThey found WBLT made it easier for them to learn and helped them to achieve better\nresults.\nWBLT is not the only technology in the changing higher education landscape. The\navailability of social software applications typified by blogs, wikis and discussion forums\n(New Media Consortium 2006) is allowing external students to have communication and\ncollaboration opportunities that were once only possible for internal students. Although\nWBLT were introduced to capture lecture content, their use in association with other\ncommunication technologies can reduce the sense of isolation and help to connect external\nstudents to their lecturers and to each other, particularly when used in conjunction with\nother social technologies. As one external student commented: \nEvery lecture should be available on [WBLT] and I would not mind if the tutorials were as well\n… With modern day technology external students could send their presentation taped and have\ndiscussion via skype … So we would not really be ‘external’.\nWhile students enrolled in internal mode might previously have been seen as having a\nsuperior learning experience than students enrolled in external mode, the possibilities\nbrought about by WBLT and social technologies are challenging this traditional expecta-\ntion. Students enrolled in internal mode now also expect to experience the same online\ninteractions that are available to students enrolling in external modes. One implication as\nillustrated by the findings in the study is that internal students may not exhibit traditional\non-campus behaviours such as regular attendance at lectures.\n92  K. Woo et al.\nWhat is striking is that whilst WBLT and social technologies were introduced to allow\nstudents to become more flexible, lecturers still perceive the students’ absences from\nlectures, even with access to these technologies, as being detrimental to their learning.\nWhilst most agreed that external students benefit from WBLT, they were concerned that\ninternal students could suffer from a poorer learning experience if they chose not to attend\nlectures. Given that the internal and external students are provided with these technologies\nfor flexibility and parity, one can question why staff are concerned about the experience of\none group but not the other.\nWhile feedback from students participating in the study has been largely positive about\nthe use of WBLT, that from staff participants is mixed. This mismatch gives weight to the\nquote at the beginning of the paper which highlighted an increasing gap between staff and\nstudents’ expectations of technologies: \nStudents and faculty continue to view and experience technology very differently … At the\nsame time, students’ expectations are important, and successful learning-focused organizations\nhave long known they ignore these expectations at their peril. (New Media Consortium 2008)\nThe disparity in staff responses could also reflect the complexities of the learning\nenvironments. The next phase of the research involves a series of case studies to tease out\nthe complexities of different curriculum contexts and provide a more complete picture\nincluding the experiences of those who have elected not to use the technology.\nAcknowledgements\nSupport for this publication has been provided by The Carrick Institute for Learning and Teaching in\nHigher Education Ltd, an initiative of the Australian Government Department of Education, Science\nand Training. The views expressed in this publication do not necessarily reflect the views of The\nCarrick Institute for Learning and Teaching in Higher Education.\nReferences\nAnderson, T. 2005. Distance learning – Social software’s killer ap? http:\/\/www.unisa.edu.au\/\nodlaaconference\/PPDF2s\/13%20odlaa%20-%20Anderson.pdf.\nAustralian Vice-Chancellor’s Committee. 2007. Australian university student finances 2006. http:\/\/\nwww.cshe.unimelb.edu.au\/pdfs\/StudentFinances2006.pdf.\nBates, A.W. 1991. Interactivity as a criterion for media selection in distance education. Never Too\nFar 16: 5–9.\nBiggs, J., D. Kember, and D.Y.P. Leung, 2001. The revised two-factor Study Process Questionnaire:\nR-SPQ-2F. British Journal of Educational Psychology 71: 133–49.\nCreswell, J.W. 2003. Research design: Qualitative, quantitative and mixed methods approaches.\nThousand Oaks, CA: Sage.\nDonnan, P., M. Kiley, and C. McCormack. 2004. Lecture streaming: Getting the pedagogy right.\nPaper presented at the OLT, November 3, in Queensland, Australia.\nFardon, M. 2003. Internet streaming of lectures; A matter of style. http:\/\/www.lectopia.uwa.edu.au\/\nmisc\/Fardon_Matter Of Style.pdf.\nGalusha, J.M. 1997. Barriers to learning in distance education. Interpersonal Computing and\nTechnology 5: 6–14. http:\/\/www.infrastruction.com\/barriers.htm.\nGoldberg, H.R., and G.M. McKhann. 2000. Student test scores are improved in a virtual learning\nenvironment. Advance Physiological Education 23: 59–66.\nLectopia. 2007. Licensing. http:\/\/ilectures.uwa.edu.au\/.\nLefoe, G., and R. Albury. 2004. Editorial. Educational Media International 41: 181–2.\nLefoe, G., and J. Hedberg. 2006. Blending on and off campus: A tale of two cities. In Handbook of\nblended learning environments: Global perspectives, local designs, ed. C. Bonk and C. Graham,\n325–37. San Francisco: Pfeiffer.\nALT-J, Research in Learning Technology   93\nMaag, M. 2006. iPod, uPod? An emerging mobile learning tool in nursing education and students’\nsatisfaction. Paper presented at the Australasian Society for Computers in Learning in Tertiary\nEducation (ASCILITE) Conference, December 3–6, in Sydney, Australia.\nMassingham, P. and T. Herrington. 2006. Does attendance matter? An examination of student\nattitudes, participation, performance and attendance? Journal of University Teaching and\nLearning Practice 3. http:\/\/www.dest.gov.au\/highered\/eippubs\/eip02_6\/eip02_6.pdf.\nMcElroy, J., and Y. Blount. 2006. You, me and iLecture. Paper presented at the Australasian Society\nfor Computers in Learning in Tertiary Education (ASCILITE) Conference, December 3–6, in\nSydney, Australia.\nMcInnis, C., and R. Hartley. 2002. Managing study and work: The impact of full-time study and\npaid work on the undergraduate experience in Australian universities. Department of Education,\nScience and Training, Commonwealth of Australia. http:\/\/www.dest.gov.au\/highered\/eippubs\/\neip02_6\/eip02_6.pdf.\nNew Media Consortium. 2006. The 2006 Horizon Report. Austin, TX: The New Media Consortium\nand Boulder, CO: EDUCAUSE Learning Initiative. http:\/\/www.nmc.org\/pdf\/2006_Horizon_\nReport.pdf.\n———. 2008. The 2008 Horizon Report. Austin, TX: The New Media Consortium and Boulder,\nCO: EDUCAUSE Learning Initiative. http:\/\/www.nmc.org\/pdf\/2008-Horizon-Report.pdf.\nPhillips, R. 2005. Challenging the primacy of lectures: The dissonance between theory and practice\nin University teaching. Journal of University Teaching and Learning Practice 2. http:\/\/\njutlp.uow.edu.au\/2005_v02_i01\/phillips003.html.\nShannon, S.J. 2006. Why don’t students attend lectures and what can be done about it through using\niPod nanos? Paper presented at the Australasian Society for Computers in Learning in Tertiary\nEducation (ASCILITE) Conference, December 3–6, in Sydney, Australia.\nSharpe, R., G. Benfield, G. Roberts, and R. Francis. 2006. The undergraduate experience of blended\ne-learning: A review of UK literature and practice. The Higher Education Academy. http:\/\/\nwww.heacademy.ac.uk\/assets\/York\/documents\/ourwork\/research\/literature_reviews\/blended_\nelearning_full_review.pdf.\nSignor, L. 2003. An exploration into the reactions of undergraduate students to virtual lectures.\nPaper presented at the OLT, November 5, in Queensland, Australia.\nSimpson, O. 2000. Supporting students in open and distance education. Open and Distance Learn-\ning Series. London: Kogan Page.\nSmith, A., and E. Smith. 2006. Learning for success: Distance education students’ use of their learn-\ning materials. Journal of University Teaching and Learning Practice. http:\/\/jutlp.uow.edu.au\/\n2006_v03_i01\/pdf\/smith_007.pdf.\nSoong, S.K.A., K.L. Chan, C. Cheers, and C. Hu. 2006. Impact of video recorded lectures among\nstudents. Paper presented at the Australasian Society for Computers in Learning in Tertiary\nEducation (ASCILITE) Conference, December 3–6, in Sydney, Australia.\nTrigwell, K., and M. Prosser. 2004. Development and use of the approaches to teaching inventory.\nEducational Psychology Review 16: 409–24.\nTynan, B., and S. Colbran. 2006. Podcasting, student learning and expectations. Paper presented at\nthe Australasian Society for Computers in Learning in Tertiary Education (ASCILITE)\nConference, December 3–6, in Sydney, Australia.\nWilliams, J., and M. Fardon. 2007. Recording lectures and the impact on student attendance. Paper\npresented at ALT-C, September 4–6, in Nottingham, UK.\n"}