{"doi":"10.1017\/S0040298205300052","coreId":"67880","oai":"oai:eprints.lancs.ac.uk:34678","identifiers":["oai:eprints.lancs.ac.uk:34678","10.1017\/S0040298205300052"],"title":"First Performance Review: London, Temple Church and Cheltenham, Pittville Pump Room: Wood’s 'Cantilena and Fugue' and 'Tribute to Michael Berkeley'","authors":["Venn, Edward"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2005-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67880.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/34678\/1\/displayFulltext5.pdf","pdfHashValue":"9526ab8612358f9cd287241101b6f14752da7710","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:34678<\/identifier><datestamp>\n      2018-01-24T03:04:07Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4D:4D31<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        First Performance Review: London, Temple Church and Cheltenham, Pittville Pump Room: Wood’s 'Cantilena and Fugue' and 'Tribute to Michael Berkeley'<\/dc:title><dc:creator>\n        Venn, Edward<\/dc:creator><dc:subject>\n        M Music<\/dc:subject><dc:date>\n        2005-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/34678\/1\/displayFulltext5.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0040298205300052<\/dc:relation><dc:identifier>\n        Venn, Edward (2005) First Performance Review: London, Temple Church and Cheltenham, Pittville Pump Room: Wood’s 'Cantilena and Fugue' and 'Tribute to Michael Berkeley'. Tempo, 59 (231). pp. 52-53. ISSN 1478-2286<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/34678\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0040298205300052","http:\/\/eprints.lancs.ac.uk\/34678\/"],"year":2005,"topics":["M Music"],"subject":["Journal Article","PeerReviewed"],"fullText":"http:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nSchwetzingen: Adriana Hölszky’s \n‘Der gute Gott von Manhattan’\nAdriana Hölszky – Romanian-born, but Stuttgart-\nbased since 1976 – scored a deserved, significant hit\nwhen her first opera, Bremer Freiheit, based on\nRainer Maria Faessbinder, was staged at the 1988\nMunich Biennale. Two other operas – one based\non Jean Genet – had their premières in Vienna and\nBonn, before Stuttgart’s ever-pioneering\nWürttembergisches Landestheater commissioned\nGiuseppe e Silvia, based on Hans Neuenfels, in 2000.\nA sheaf of chamber and orchestral works have\nseen premières at festivals such as Styria and\nVienna, and (even more aptly) at Donaueschingen.\nAptly, because Adriana Hölszky is a pretty much\nunreconstructed Modernist, whose musical\nlanguage would sit well in the Boulez, Nono and\nStockhausen-dominated early 1960s. In some\nways it accords less well with Schwetzingen, a\nRhineside mini-Versailles near Mannheim, whose\nRococo palace theatre, launched in 1752 with\nMolière, is one of the most charmingly and\nendearingly Mozartian of all German venues.\nRare Baroque revivals are a speciality. Henze’s\nElegy for Young Lovers was premièred there in 1961,\nand Pollicino and The English Cat in 1981\/3; while\nEgk, Fortner, Reimann and, more recently, two\nnew operas by Salvatore Sciarrino are among the\n32 opera premières to date, reflecting the\nSchwetzingen Festival’s bold and industrious\ncommissioning policy.\nThis year’s results were mixed: an ear-battering\nmight seem a slightly Napoleonic solution to the\n2004 commission. Hölszky’s Der gute Gott von\nManhattan features a fuzzily elusive, possibly\nbotched libretto culled by the composer from the\nKlagenfurt-born, Rome-based Existentialist\nphilosopher-poet Ingeborg Bachmann (1926–73)\n– who was Henze’s librettist for Der Junge Lord and\nthe Kleist-based Der Prinz von Homberg. It’s a kind\nof ‘if only love could save the world, but it can’t –\ndeath-and-destruction seem the only logical way\nout’, or ‘après moi le déluge’, nihilistic plot (a\ndance of death, in fact) centering on two lovers\nand their dissociated cavortings in a hotel\nbedroom (actually three bedrooms: they\ngradually make their way up to the 57th – i.e. top\n– floor, before the final balloon goes up (or bomb\ngoes off ). Prescient? Maybe.\nWhat worked best in this not over-attractive\nevening was a highly competent, mildly engaging\nstaging by Stephan Kimmig (also Stuttgart); a\nvivid 8-part chorus from Dresden’s Sächsische\nStaatsoper (the co-commissioners), who went\nthrough their nightmarish antics well; capable\nsinging from the two ‘representative’ central\ncharacters, Jan and Jennifer (former Dresden\nchorister Andreas Scheibner and Stuttgart-trained\nAnn-Katrin Naidu). And above all the first-rate\nplaying – including some stunning antiphonal\nbrass\/percussion, all the more powerful in such\nan intimate environment – under conductor\nAlexander Winterson, John Eliot Gardiner’s\nformer assistant at Munich, who also conducted\nHölszky’s Bremer Freiheit at Stuttgart and later the\npremière of her opera Tragödia in Bonn.\nWinterson had no problem making the music\nspeak clear as well as loud, and his players\nresponded ably to the score’s wealth of detail.\nHölszky has offered a lucid analysis of what she’s\ntrying to achieve structurally. The problem is that\nfor the average polite, supportive opera-goer most\nof this samey Serialist, pathos-devoid stuff goes\nright over their heads, and doubtless ears too. The\ntwo bizarre squirrels’ ditties in the vivid\n‘Marionettentheater’\/Bassarids-like interlude, and\ntheir superb duet (Birgit Fandrey, Anja Maria\nKaftan) when they reappear as policemen, were\ntwo of the most bearable bits. Yet any real\nachievement seemed to defeat itself musically:\nand what should emerge as an existentialist,\nslightly Dürrenmatt-like mystery looked all too\nmuch like just another nervy excess of German\nstagecraft. A gypsy Fortune-Teller (Elisabeth\nWilke) gets underused, and thus unbalancingly\nwasted; the good God (Daniel Gloger), when he\nappears bicycle-borne, is a squawking\ncountertenor: more assault. Hölszky specified the\nsquirrels should be ‘shrill, and sharp as a knife.’\nFrankly, her whole opera sounded a bit like that.\nRoderic Dunnett\nLucerne Festival 2004: Harrison Birtwistle\nAmong major European festivals, the Lucerne\nFestival is outstanding in the attention it pays to\ncontemporary music. The latest manifestation of\n \n37Tempo 59 (231) 37–56 © 2005 Cambridge University Press\nDOI: 10.1017\/S0040298205000057 Printed in the United Kingdom\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nthis is the founding of an annual Lucerne Festival\nAcademy for young professional players,\nspecializing in the music of the 20th and 21st\ncenturies, under the leadership of Ensemble\nIntercontemporain and the indefatigable Pierre\nBoulez. Nor is this is on the modest scale of a\n‘young Sinfonietta’: its final concert, conducted\nby Boulez, began with Harrison Birtwistle’s\nmassive Earth Dances.\nThe choice of this work was no coincidence, as\nBirtwistle, in his seventieth birthday year, was the\nFestival’s composer-in-residence. The programme\nincluded more than a dozen of his works, though\nno music-theatre (Lucerne being a notably un-\noperatic festival). Among them were ‘imported’\nperformances of Pulse Shadows, by the familiar\nNash\/Arditti team, and Theseus Game, by\nEnsemble Modern, as well as the first complete\nperformance of Orpheus Elegies, by the counter-\ntenor Andrew Watts with Heinz and Ursula\nHolliger. Birtwistle’s composer-in-residence status\nalso meant that he was featured in an exhibition of\nmusical portrait photographs spread all over the\ntown, so that one kept coming across his face\nunexpectedly – often pictured by Betty Freeman in\ndelightfully domestic contexts – in foyers and shop\nwindows. (My favourite shot, though, was of\nBoulez and a hip-hop d.j., side by side and smiling\nat the camera, but clearly without either having\nthe faintest idea who the other was.) \nOn a flying visit, I caught the first two\nBirtwistle performances of the festival, on 21\nAugust. In the morning, in the light, modern\nLukaskirche, the second half of Pierre-Laurent\nAimard’s piano recital included three of the\nHarrison’s Clocks pieces – interleaved with music\nby Ligeti, Ravel and Bartók in a continuous\nsequence suggested by the idea of repetition. The\nbrilliance of the playing matched the inspiration\nof this ‘composed programme’, which certainly\ncaught the imagination of a large audience.\nThat evening, in the magnificent lakeside\nKonzertsaal, the Cleveland Orchestra and its\nmusic director Franz Welser-Möst performed\nBirtwistle’s The Shadow of Night and its brand new\ncompanion-piece Night’s Black Bird. The former\nwas written in 2001 to a Cleveland Orchestra\ncommission, and first performed under Welser-\nMöst’s predecessor Christoph von Dohnányi; it\nreached the BBC Proms in 2003. The latter is the\nfirst in a series of commissions sponsored by the\nRoche pharmaceutical company, to be unveiled\nboth at the Lucerne Festival and at Carnegie Hall\nin New York: the 2005 commission has been\nawarded to Chen Yi. The amount of money\ninvolved, not only in the commissioning itself but\nalso in a lavish accompanying book (and in what\nlooked like a seriously glitzy pre-concert party), is\nclearly enough to make British promoters,\ngrubbing around for enough support to keep\ncomposers up to subsistence level, green with envy.\nThe Shadow of Night is a work which reverts to\nBirtwistle’s old obsession with melancholy –\nhitherto most clearly expressed in Melancolia I\n(1976), named after a celebrated Dürer engraving.\nIt grows out of the first line of Dowland’s bleak\nlute song In darkness let me dwell – though it can\nhardly be a coincidence that the opening turning\nsemitone of Dowland’s melody corresponds to\nthe start-up motive of so many of Birtwistle’s\nworks. This gives rise to a continuous nocturne\nlasting the best part of half an hour, punctuated\nby frequent quickenings of tempo to short,\nviolent climaxes, and ending with a striking\ngesture: a chord on low strings and bells, a single\nhigh, loud trumpet note, then as the bells die\naway two gentle scrapes of the guiro.\nNight’s Black Bird (the title is taken from another\nDowland lute-song, Flow My Tears) inhabits the\nsame nocturnal world, but in Birtwistle’s words\n‘takes listeners on a different route through the\nsame musical landscape’ – a familiar analogy in his\nmusic, and indeed a familiar procedure both\nwithin pieces and from one work to another. Its\nopening is a slightly more eventful version of the\nstart of The Shadow of Night, and its ending is\nidentical. But, compared to the earlier work, it’s\nshorter (about 12 minutes), and perhaps more\nobviously evocative of the natural world: the little\nquickenings of tempo seem to peak in animal\nscreams; the melodic line, shared around high\nwoodwind and at one point in piercing eight-fold\nunison, takes on the aspect of birdsong.\nThe performances seemed well-paced and\nsympathetic, belying the reputation Welser-Möst\nacquired in his time with the London\nPhilharmonic as no friend of modernism. The\nCleveland Orchestra’s refined woodwind section\ncould perhaps have summoned up a little more\nraucousness at times; and even in the pin-\ndroppingly clear Konzertsaal acoustic, the harps\nand some of the percussion didn’t always come\nthrough enough.\nBeforehand, Birtwistle had called Night’s Black\nBird a ‘postscript’ to The Shadow of Night, and\nsuggested it should be performed after it,\nseparated by a performance of the Dowland\nsong. At a late stage, the order was reversed,\npointing up the fact that the two works are in\nparallel rather than in series, and creating a\nsatisfying shaped and varied sequence. (The\ndyspeptic critic who, after the Edinburgh Festival\nperformance a few days later, described it as ‘the\nglummest 50 minutes you are likely to spend in a\n38\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nconcert hall’ could hardly have been listening very\nclosely – but then he also called the single-\nmovement The Shadow of Night a ‘suite’).\nPresumably this will now be the standard format\nfor future performances. But I hope symphony\norchestras will also consider programming\nNight’s Black Bird on its own, as a short and\nimmediately appealing Birtwistle ‘taster’ for\ngeneral audiences. ‘Birtwistle without tears’, you\nmight call it – except that in view of the subject-\nmatter it’s more like ‘Birtwistle with tears’.\nAnthony Burton\nPula, Croatia: Balkans’ Summer Music Camp\nThe Balkans’ Summer Music Camp1 was first\nestablished in 1995. Nigel Osborne’s initiative was\nto address the needs of children who had been\nvictims of trauma caught in conflict and war-\nlocked zones in the former Yugoslavia. Through a\nprofessional exchange with Nigel Osborne last\nyear at the Cambridge Music Conference, my\nsister Catherine Carmack (12.10.57–12.12.03)\ndecided to work as a volunteer at the camp this\nsummer. Owing to her untimely death I went in\nher place, to observe the creative and curative\nprocess of the children’s development. About 35\nchildren from the Special School of Mostar,\nBosnia Herzegovina came to the Adriatic for a\nweek’s vacation on the coast of Croatia. Most of\nthese children live in an orphanage in Mostar, but\nare receiving music therapy through the Pavarotti\nMusic Centre. Although most of the children\nwere attended by carers, a few of the children\nwere accompanied by their mothers. Many of the\nchildren are primarily suffering from exposure to\nviolence and remain traumatized. Some of them\nhave special needs including Down’s Syndrome;\ntwo were marginally disabled with cerebral palsy.\nAlthough the Balkans’ Summer Music Camp is\nNigel Osborne’s personal initiative, he admits to\nacting on an assessment made by , which\ndiagnosed the children of Mostar as the most\nseriously damaged and least able to address the\neffect of violence and conflict in their lives. Music\ntherapists and interns working at the Pavarotti\nMusic Centre came to volunteer at the summer\ncamp, as well as a group of therapists and teachers\nassociated with War Child in Prisˇtina, Kosovo.\nAbout 15 university students from the Music\nDepartment of Edinburgh University came to\nhelp, as well as half a dozen volunteers from Japan,\nCanada, England and Germany including myself.\nOsborne had decided on Waiting for Godot for\nthe opera project for a variety of reasons. Beckett’s\nplay seemed especially poignant for the children at\nthe music camp, an ideal way of presenting\ncreatively the painful truth concealed within, to\nwhich their hearts and minds bear witness.\nExposed to the most inhumane brutality during\nthe war, the children Nigel Osborne works with\nare ‘real survivors’. \nSince 2001 the Ulysses Theatre has run a\ncultural initiative of renewal on Brijuni Island, part\nof the Brijuni Archipelago, a protected National\nPark on the coast of Croatia. Three former\nYugoslavs – actor Rade Sˇerbedzˇija, artistic \ndirector Lenka Udovicˇki, and philosopher\/\nwriter\/translator Borislav Vujcˇic´ – decided to work\nwith the cathartic effect of tragedy to implement\nsocial renewal and cultural regeneration in the\naftermath of the war. Many of the best actors who\nfled the former Yugoslavia and received political\nasylum abroad have agreed to endorse this new\ninitiative. Every summer a meaningful collab-\noration develops on Brijuni when the legendary\nfigures of the past return to help forge new cultural\nterms for the future. The Ulysses Theatre aspires\nnot only to capture aspects of brutal misfortune\nand psychological despair many suffered under the\npolitical regime in the former Yugoslavia, but often\nthe intensity of interpretation portrayed on the\nstage subtly speaks of the recent atrocities\nwitnessed during the war. Nigel Osborne was\nasked to join the Ulysses Theatre as music director\nand has set each feature to music. The first year\nShakespeare’s King Lear was produced in 2001, the\nsecond summer Euripides’ Medea in 2002, Peter\nWeiss’s Marat\/Sade in 2003, and Samuel Beckett’s\nWaiting for Godot in 2004. Osborne’s contribution\nbest reveals how compassion and inspiration can\neffectively transform music into a healing medium\nat a level of conscience. \nEach summer the work from the previous\nyears has been revived. As a result the Ulysses\nTheatre performed four plays in July and August\n2004. Next year they are thinking of a new\nproduction of Othello in place of King Lear, which\nhas been seen by 15,000 people during the past\nfour summers. Besides the all-male production of\nWaiting for Godot in Croatian ‘Play Beckett’, the\nUlysses Theatre hosted a workshop of an all\nfemale English cast with Amanda Plummer,\nCaroline John, Lynn Redgrave and Vanessa\nRedgrave (renowned for her initiative in human\nrights). The Ulysses Theatre usually performs on\nMali Brijuni, in what was once an Austro-\nHungarian fortress. The atmosphere of tragedy is\n1 Balkans’ Summer Music Camp: 26 July to 2 August 2004 at\nPuntiezˇla\/Pula, Croatia on the Adriatic Coast looking across at\nthe Brijuni Archipelago. For further details see: www.ulysses.hr\nand www.warchild.org .\n  39\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nenhanced by the permanent reminder of\nmisplaced authority and power.\nThis year the Ulysses Theatre decided to make a\nfilm about the spiritual dimension of their work,\nfor which they received permission for a\nworkshop\/production of Waiting for Godot on the\nisland of Goli Otok, Tito’s former penal colony for\npolitical ‘deviants’. A few female survivors of\nTito’s concentration camp were approached to\nparticipate in the project and made themselves\navailable for interview, giving testimonials of their\nsuffering. The persecution of women on Goli\nOtok from 1949 to 1956 remains censored in the\nhistory of the former Yugoslavia. In an attempt to\nredeem the past through their workshop\nperformance on Goli Otok, the all-English cast\nhoped to recapture the inhumanity of the female\ncolony run by women. Waiting for Godot works as a\ndouble metaphor, not only representing the\natrocities in the former Yugoslavia, but testifying\nto the recent injustices in our own flawed system,\nwitnessed at Guantanamo Bay, Belmarsh Prison\nand Abu-Ghraib. I found it very meaningful to see\nNigel Osborne’s therapeutic work at the Balkans’\nSummer Music Camp set within a broader context\nof human rights issues that concerns us all.\nEvery morning the children swam in the sea,\nwhereas afternoons were dedicated to drama and\nmusic workshops. Waiting for Godot was divided\ninto seven short scenes for the children’s opera\nproject. The seven themes, which emerged from\nBeckett’s text were: 1) putting on shoes, 2) waiting\nfor something, 3) waiting for someone, 4) a tree, 5)\na child\/lullaby, 6) a dog and 7) a monster\/giant.\nThe children worked at finding words and music,\nas well as creating a short dramatic presentation to\nput their ideas across. What is often silenced in an\nindividual who has been traumatized is given voice\nthrough music. The children experience through\nthe opera project how their words and music are\ntaken seriously by others. What often goes\nunnoticed and unexpressed in their inner lives, they\nperceive to be acknowledged and affirmed through\nhearing their words and music sung by others. The\nseven acts of the children’s rendition of Waiting for\nGodot emerged as separate developments in the\nplot, but was linked by a common refrain\ncomposed by the different groups.\nTo help raise the aesthetic development of the\nopera within the consciousness of the children\nthey went to perform their songs in a hospital in\nRovinj, a neighbouring town. Although a medical\ncentre for over 150 years, Martin Horvat Hospital\nis now being run during the summer months as a\nrehabilitation clinic for physically disabled children\nand adults, specifically addressing the needs of\nchildren who have been victims of land mines.\nThe director of the Martin Horvat medical centre\nin Rovinj made it clear that the beauty of the\nphysical surroundings was the primary therapy\npeople came for. At least 500 metres of sea front on\nthe Adriatic has been redesigned for wheel chair\naccess. People ordinarily unable to partake of a\nseaside vacation or swim in the sea can now\nexperience the joy of a seaside holiday with an\nable-bodied friend or member of the family.\nOn the penultimate day of the music camp we\nwere joined by the Mostar Sinfonietta, who play\nfor the Ulysses Theatre during the summer. The\nMostar Sinfonietta is unique insofar that it is\ncomprised of musicians from different\nreligious\/ethnic groups in Bosnia Herzegovina.\nThey joined the Balkans’ Summer Music Camp to\naccompany the dress rehearsal and final\nperformance of the children’s opera. The melody\nand words of the songs in the opera project were\ncomposed by the children through a therapeutic\ndialogue with Nigel Osborne on his guitar, but\ntheir music was quickly orchestrated into parts by\nthe composition students from Edinburgh\nUniversity. Not only enriched by the support of\nthe Mostar Sinfonietta, the children’s production\nof Waiting for Godot was enhanced by the guest\nappearance of Vedran Smajlovicˇ, the legendary\ncellist of Sarajevo. His musical contribution\nconsisted of an improvisation on the cello\ndepicting the monster, but a much more friendly\ncreature than Beckett’s Pozzo. Vedran Smajlovicˇ’s\nreputation in human rights emerged as he\nperformed in Sarajevo wherever atrocities were\nperpetrated during the war. Surrounded by\ngunfire and snipers, he was often seen on the\nfront line accompanied by his friend Nigel\nOsborne on the violin.\nThe children’s audience was truly unique.\nActors from the Ulysses Theatre as well as the\nfemale cast from England performing Waiting for\nGodot came to see the work of the children. It was\nwonderful to witness how the alchemy of music\novercame all the cultural and linguistic barriers\nwe had faced during our week together. The\nBalkans’ Summer Music Camp renews one’s trust\nin the human spirit to heal the unseen horror of\nviolence and injustice in the world!\nElizabeth Carmack\nThe Balkans’ Summer Music Camp is a charitable initiative\nrun by Professor Nigel Osborne, Reid Professor of Music at\nEdinburgh. If you would like to make a donation to the\nBalkans’ Summer Music Camp please send a cheque made\npayable to ‘Edinburgh University’ at: Music Department of\nEdinburgh University, School of Arts, Culture and\nEnvironment, Alison House, 12, Nicolson Square, Edinburgh\nEH8 9DF, U.K.\n40\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nLondon, South Bank and RAM: \n‘Omaggio: a Celebration of Luciano Berio’ \nThe fortnight-long celebration Omaggio to the late\nLuciano Berio, held 15–30 April 2004, explored\nthe post-modern passion and exuberance of the\ncomposer’s musical personality, from the\nexperimental daring and fun of the era of new\nmusic of the 1960s to the more searching multi-\ncultural tapestries of the final decades and his last\nworks. Large audiences drawn from all ages\nenjoyed a wide range of Berio’s works at the\nSouth Bank Centre and the Royal Academy of\nMusic, including several UK premières including\nStanze, his last work, as well as seminal pieces\nsuch as Sinfonia, Laborintus II, the fourteen\nSequenzas, and electronic music, performed by\nleading virtuosi and ensembles. Overall, the\nfestival represented a significant and memorable\ntribute to one of the leading figures of new music\nin the second half of the 20th century.\nJust as last words are treasured and ploughed\nfor every ounce of meaning, so also a composer’s\nlast works. Thus it was only to be expected that\nevery note of Stanze, completed just weeks before\nBerio died in May 2003 and premièred in Paris on\n22 January 2004, should attract great attention in\nits UK première, given by the outstanding\nbaritone Francois Le Roux, London Voices and\nthe Philharmonia Orchestra conducted by Pierre-\nAndre Valade at the RFH on 21 April 2004. Stanze\ncame across as a compelling, expressive, thought-\nprovoking work, significant within the\ndevelopment of Berio’s late style, a final\nstatement of depth and beauty. Sadly the RFH\nwas far from full, symbolic of the difficulty in\nmarketing new music, and the performance was\nnot of the dramatic power and acoustic clarity\none might have wished for. The problems of\nbalance were possibly due to the unfamiliar\ndistribution of the orchestra, to enhance the\ncluster effect of chords and blending of timbres –\nbrass separated on either side, woodwind and\nhorns mixed up, and cellos and violins reversed.\nThe result was that some of Berio’s ‘last\nthoughts’, the vocal lines in this song cycle for\nbaritone, triple men’s choir and orchestra, were\nobscured by the instrumental forces, but this\nmattered little as the texts were printed in the\nprogramme.\nStanze is a cycle of five linked movements\nsetting poems by different 20th–21st century\npoets, the title alluding not to ‘stanzas’ but to\nwhat Berio described as the true meaning of\n‘stanze’, namely ‘rooms that have doors and\nwindows’. Each ‘room’ is inhabited by a contrasting\npoem, which evokes the ‘unmentionable other\nand other place’. In an interesting programme\nnote, Marco Uvietta describes Berio’s work as a\nspiritual exploration of the idea of God in\ndifferent situations, ‘in Brendel’s poem ironic, in\nCaproni, blasphemous, in Sanguineti, elusive, in\nCelan, a peremptory capital letter and in Dan\nPagis, guilty’. Thus the work explores post-\nmodern conceptions and perceptions of God.\nWhile that ‘other’ is sensed in the music through\nelusive sonorities and processes, nevertheless at\nthe same time the work has an intriguing\nsymmetry, dramatic bite and almost Classical\nformalism and teleology. The triple male choir\nsings in the second, third and final movements,\nwhile the soloist, here projected throughout with\nbright and incisive richness by Francois le Roux,\nappears ever-present, yet in each poem changing\nexpressive character and emotional colour.\nThe first and last poems deal with Holocaust\nimagery, from the subject of suffering in\n‘Tenebrae’ by Paul Celan, a poet quite frequently\nset by Berio and always in connection with the\nHolocaust, to the terror-filled silence of ‘The\nBattle’ by the Israeli poet Dan Pagis. Here the\nword ‘schweigen’ is artfully set to the dynamic\nclimax of the whole cycle, a fortissimo chord\nwhich sustains and intensifies to a cry of Edvard\nMunchian proportions. The echoes between\nthose framing poems are heightened by the use of\na German translation of the Hebrew original, and\nby the use of rich harmonic textures in each. In\nthe first, the lyrical and continuous vocal line is\nsupported by dense clusters and rarefied blends of\ntimbres sculpted into heaving waves that are\ngrounded intermittently by the baritone’s low\npedal points at every mention of the word ‘Herr’\n(Lord). By contrast the fifth takes flight in angelic\nfloating sonorities, the voice enveloped by a halo\nof triple male chorus, dreamy and delicate, with\ncelesta glissandi glittering through the high\nstrings and wind chords. The harmony too is\nsweeter and more consonant than in the first\npoem, so that there is a sense of progression, even\narrival, in the final movement.\nThe second and fourth poems are set to\nfrenetic, busy textures, but while Giorgio\nCaproni’s ‘Congedo del viagiatore cerimonioso’\n(The Ceremonious Traveller’s farewell) conveys a\nsense of relentless energy with its train imagery\nsymbolic of death and Holocaust deportation,\nthere is a more playful quality to the setting of\nAlfred Brendel’s ‘ironisch’ Tritsch-Tratsch Polka\npoem. The main character in the Caproni bids\n‘farewell to knowledge to love and to religion’ and\nthe music, with choral echoing of individual\nsyllables into ostinato patterns, is complemented\nby onomatopoeic low brass simulating braking\n  41\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nengines. The soloist has an almost operatic tone\nhere, while there is a more patter-song line to the\nfourth poem in Alfred Brendel’s ironic verse. The\nsong was apparently expanded from a sketched\nsetting Berio gave to Brendel on his 70th birthday\nand there is considerable wit here in the fleeting\nallusions to waltz rhythms, while Strauss’s\nfamous polka makes an oblique appearance at the\nvery end. The scherzo-esque effects of sonorities\nweaving in and out alters to a smoother texture at\n‘nothing must disturb the sense of harmony’, and\nindeed such mirroring of text occurs throughout\nwith great precision, which made the inaudibility\nof at least some of this performance particularly\nannoying.\nAt the heart of the piece is the central poem by\nEdoardo Sanguineti, a poet with whom Berio was\nclosely involved, who wrote the text for Passagio\nand Laborintus II, and who shared Berio’s ideas of\nmulti-layered collage and quotation. According to\nMarco Uvietta, this is the most intense of the\nmovements, but on this occasion, it seemed the\nweakest and most disparate. It is imbued with\ndramatic rhetorical gestures, with the choir\nadding sustained support to single vowels in the\nsolo part. The fourth poem follows with explosive\nsurprise, and not only balances the second as\nmentioned, but acts as a light relief before the\nvisionary trance-like expression of the final\npoem. In the first poem, the sustained clusters are\ncontrasted by two main points of activity: the first\nat the mention of ‘It was blood that you shed,\nLord’ and the second for the image of ‘Eyes and\nmouth are open and empty, Lord’. It is this line\n(with the assonance of ‘Leer, Herr’) which is\nechoed poignantly in the Pagis’s ‘The Battle’,\nwhere the smooth harmonic cushion suddenly\nintensifies at ‘(the dead)…wide-open mouths\nsilent’. Appropriately, it appears, the climax of\nBerio’s final work embodies a struggle against the\nconcept of silence and against the resistance \nto the articulation of suffering. The poignant\nfortissimo seems to defy Adorno’s dictum that\nafter Auschwitz there can be no poetry, as the\npoignant outburst at the final line, ‘who knew\nwho was cursed and who blessed in the burning\ndust’ dies into to sonic embers and final silence.\nIf Berio’s style is full of unpredictability so too\nis there an inevitability to the progression from\nimpressionistic suffering to luminous\ntranscendence, the spiritual journey of the work.\nIn the words of David Osmond-Smith, the Berio\nauthority and leader of a study day on the\ncomposer as part of Omaggio: ‘His music refuses\nto forget’. Indeed the work is an eloquent public\nas well as personal testimony, expressed in Berio’s\ndistinctively exciting, imaginative and original\nvoice, serious while engaging, light while\nmeaningfully trivial, logical while sensuous.\nAnother highlight of Omaggio was the second\nUK performance of Berio’s Ofanim, a stunning\nwork composed in 1988, first performed in 1997\nat the Barbican Centre with Berio himself in\ncommand. The work received an electrifying\nperformance by the Israeli singer Esti Kenan Ofri,\nthe New London Children’s Choir, the London\nSinfonietta and RAM Manson Ensemble\nconducted dynamically by Zsolt Nagy, at the\nQEH on 24 April, with the electronics provided\nby Berio’s own Tempo Reale London-Florence\nproject. Berio’s interest in Hebrew texts dates\nfrom the 1950s, during his work with Cathy\nBerberian, his first wife, and continued with his\ntenure as conductor of the Israel Chamber\nOrchestra in the 1970s, his marriage to Talia\nPecker, an Israeli musicologist who later became\nhis librettist, and his teaching of leading Israeli\ncomposers such as Betty Olivero and Gil Shohat;\namongst his many honours was the 1991\nJerusalem Wolf Foundation Prize.\nThe work contrasts settings of texts from the\napocalyptic Book of Ezekiel and the passionate\nSongs of Songs. ‘Ofanim’ refers to the ‘wheels’ of\nEzekiel’s famous vision, conveyed by rich choral\ntextures and loud percussion, contrasted by\ndelicately sensuous sounds for the Song of Songs\nand instrumental interludes, such as a lively\ntrombone duet, enhanced by spatial live\nelectronics. At the riveting climax, the solo singer-\ndancer emerges from the dark stage and gradually\nstretches to full height while gradually forming\nmeaningful words out of raw syllabic sounds, in a\nmanner recalling the experimental music Berio\ncomposed in the 1950s for Berberian, and which\nwe later heard in the electronic music concert.\nStretching short syllables into lyrical phrases over\na static trombone note, Esti Ofri gave a magnetic\ncharacterization of the uprooted Mother figure,\nwhose moving lament symbolized for Berio ‘all\nthe exiles …that have left deep wounds in our\nconscience’. The daring spirit of new music in the\n1960s was revived in the virtuoso account of\nLaborintus II (Homage to Dante) which concluded\nthe concert. A classic from 1965, Sanguineti’s text\ncombines Dante fragments with his own jazzy\npost-modern prose poetry, and while the poet’s\nson was to have been narrator, due to his\nindisposition Terry Edwards (one of the original\ninterpreters of Berio’s music) took over at short\nnotice, reciting it in English, with the occasional\nItalian phrase. This enhanced the wit and mood,\nbut perhaps missed something of the Italian\nsound colours. With the two ensembles, jazz\nbands, reminiscent of the 1960s Modern Jazz\n42\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nQuartet and other 60s jazz groups, the variety of\nvocal inflections and the way the ensemble builds\ntextures of varying complexity and dramatic\nimpact were thrilling; nearly 40 years after its\ncomposition, the piece is still as contemporary as\never.\nThe hardy souls who stayed for the late-night\nconcert were rewarded with a spectacular\nperformance of Sequenza XII (1995) for solo\nbassoon performed by its dedicatee Pascal\nGallois. All the Sequenzas were performed during\nthe course of the festival, showing the extremes\nof virtuosity Berio strove for. Rumour has it that\nsince Gallois could play Berio’s initial draft, it was\nrewritten to be even more impossible. Indeed the\ndemands are phenomenal and it takes a\nphenomenal player such as Gallois to realise it,\nand on this occasion with magical artistry. At its\nsimplest the piece is a single falling and rising\nglissando in a breath lasting 25 minutes. Using\nincredible variety of lip and breath pressure, and\nhalf-closing holes, Gallois achieved an effortless\nsense of tonal beauty, adding in the melismatic\nornaments along with all sorts of multiphonics,\nundertones, flutter tonguing, extremes of\ndynamics and filigree, and all sorts of similar\neffects. Emerging from darkness onto a twilit\nstage, he made the work happen through an\namazing 25 minutes of circular breathing: a fine\ntribute to the composer and the instrument.\nBerio’s own idea of programming his piano\nworks together with sonatas by Scarlatti made the\nimpressive piano recital by Andrea Luchesini on\n26 April, Duke’s Hall, RAM, into a type of\npremière, a post-modern symbiosis of Baroque\nand contemporary idioms similar to Rendering,\nonly here the focus was on Berio himself. Berio’s\nmusic for piano is of the most compelling nature,\nconcerned with harmony, texture and nuance.\nSequenza IV (1966), the most extended of the\nworks performed, was played effortlessly, with\nenthralling colours, subtle pedalling, overtones,\nand outbursts of activity, fast filigree reminiscent\nof – yet sweeter than – Boulez, hand-crossing,\nstretching to extremes of registers, sustained and\nsilent chords. After Scarlatti’s brightly dotted\nSonata in D, Kk 491, came Brin and Leaf,\nminiatures in memory of the pianist Michel\nOudor and London Sinfonietta manager Michael\nVyner. These were concerned with a single chord\nexpressed in different surface textures, sketch-like\nin the manner of a Haiku: hushed, condensed\nexpressionism. Especially involving were Berio’s\nfour impressionistic ‘Encores’. In Erdenklavier\nsustained notes and pedals create a pointillist\npattern with emphatic tones, while Wasserklavier\n  43\nSouth Bank Centre London\nRoyal  Fest iva l  Ha l l\nQueen E l izabeth Hal l  \nPurcel l  Room\nPeter Maxwell Davies, \na Musician of Our Time\n17 – 30 April 2005\nCome to the South Bank Centre to celebrate a unique\nfigure in British musical life. This festival brings together\nleading orchestras, ensembles and soloists, students and\nschoolchildren. Peter Maxwell Davies himself conducts,\ntakes part in a masterclass and gives the Royal\nPhilharmonic Society's Annual Lecture. Fourteen \nconcerts showcase works from throughout his career,\nincluding world premieres of A Dance on the Hill and\nNaxos Quartet No.6.\nwww.rfh.org.uk\/max\nBox office 08703 800 400 \nBrochure request line 020 7921 0971\nFeaturing:\nLondon Sinfonietta\nPhilharmonia Orchestra\nPsappha\nMaggini Quartet\nEndymion\nCity of London Sinfonia\nRoyal Academy of Music\nPurcell Contemporary Ensemble\nWestminster Cathedral Choir\nDiego Masson\nOliver Knussen\nRichard Hickox\nNicholas Kok\nJane Manning\nHåkan Hardenberger\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nis more tonal, shades of late Brahms, yet vivid in\nits novelty, with the low concluding tonic leading\nevocatively into Scarlatti’s F minor sonata Kk 239.\nThe Debussyesque Luftklavier (1985) was followed\nby a riveting account of Feuerklavier with its\ntoccata-like rhythms. A fast Scarlatti sonata in G\nKk146, formed a bridge to Berio’s powerfully\nexplosive Rounds (1965) to conclude. Andrea\nLuchesini, a Beethoven as well as a Berio specialist\n(he has recorded Berio’s concerto and performed\nBerio’s 2001 Sonata the following day), was in\nbrilliant form, his even tone beautifully lucid and\nglowing throughout. There was barely a breath\nbetween the Berio and Scarlatti which, smoothing\nthe leap from 18th to 20th centuries with an\nintriguing similarity of colour, wove the music\ninto a seamless whole.\nIt was apt that the two final UK premières of\norchestral miniatures from the 1980s, should\nfeature in a student concert, Fanfare for Berio, at\nthe RAM’s Duke’s Hall on 30 April, with the RAM\nSO conducted by Pierre-Andre Valade, an event\nthat symbolized the appeal of Berio for the future\ngenerations of musicians. In Fanfara, (1981), a\nshort movement from the opera La vera storia, a\nwoodwind harmonic strand is overlaid with brass\nmotifs, while in Festum, commissioned for the\nDallas SO in 1989, a percussion ostinato supports\na brass polyphony gradually joined by strings, and\nconcludes, after apparently fading out, with a\nsudden shockwave. Amongst four student pieces\ninspired by Berio, it was the Fanfare for Berio by\nNaomi Pinnock which most pithily captured\nBerio’s wit and exuberance, and the concert, and\nfestival as a whole, concluded with an\nimpressively professional interpretation of\nFormazioni, Berio’s orchestral tour de force from\nthe late 1980s. Just as it was the searching musical\nresponse to the contemporary world of art and\npolitics that marked out Berio’s supremely\nmusical achievement, so Omaggio’s deeper\nsignificance emerged as a call to musicians to\nperform, listen to and discuss Berio’s music, and\nto communicate and reinterpret Berio’s ideals of\nexperimentalism and his imaginative exploration\nof language and sound for our own and\nsucceeding generations.\nMalcolm Miller \nPresteigne Festival 2004\nThe Presteigne Festival in the 21st century is in\nmany ways the natural successor to the post-war\nyears of the Cheltenham Festival, not just in its\nenlightened choice of first-rate contemporary\nBritish music, but in its cultivation of ‘house\ncomposers’ who can be spotted browsing in local\nshops as well as providing the focus of several\ninformal pre-concert talks. In fact, the music of\nthree composers who received their first big\ncommissions from the Cheltenham Festival –\nWilliam Mathias, Alun Hoddinott and John\nMcCabe – were all celebrated at the 2004\nPresteigne Festival.\nOf the world premières on offer, James Francis\nBrown’s Piano Quartet balanced florid writing of\nTippett-like ebullience and energy with a more\nsombre and reflective central section. Far from\noutstaying its welcome, the piece contained\nenough material to merit further development\nand exploration. The Fidelio Piano Quartet’s\nplaying encompassed great refinement as well as\nrobust attack.\nCecilia McDowall’s String Quartet No 1,\nsubtitled ‘the case of the unanswered wire’, was\ninspired by a Douglas Dunn verse novel\ndescribing the life of a Russian engineer on board\nship during the 1905 Russo-Japanese War. Its bold,\nrhythmic drive was reminiscent of the Bartókian\nprotean energy of Elizabeth Maconchy’s\nquartets, whilst the moving final bars, dying away\nto nothing, made a delicately poignant ending to\nan intensely personal work that betrayed an\nacutely responsive creative sensibility. I hope\nMcDowall will return to this medium again soon,\npreferably in the company of the Sorrel Quartet,\nwho seem perfectly attuned to her musical\npersonality.\nThe premiere of John Pickard’s Orion for\ntrumpet and organ also made a strong\nimpression. The opening movement, entitled\n‘Nebula’, established an appropriately\notherworldly ambience punctuated by brief,\nghostly fanfares. If this conjured up associations\nwith the slow movement of Vaughan Williams’s\nSixth Symphony, the use of a flügelhorn in the\ncentral slow movement, entitled ‘Alnitak’,\nbrought to mind the archaic weirdness of RVW’s\nNinth. In the Finale, ‘Betelgeuse’, the organist\nliterally pulled out all the stops, but it was the\nreturn of the atmospheric opening material with\nthe trumpeter offstage and eventually fading into\nthe outer limits that lingered in the memory, for\nall the preceding pyrotechnics. It is hard to\nimagine anyone giving this music a more\ncommitted and virtuosic reading than trumpeter\nAlison Balsom and organist Jonathan Scott.\nAmong other high spots, Gemma Rosefield of\nthe Fidelio Piano Quartet tapped into the full\ngamut of emotions underlying Judith Weir’s\nsmall-scale masterpiece Unlocked in a deeply-felt\nrendering, but the gem among all the 24 events of\n44\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nthe 2004 Presteigne Festival was a morning\nchamber concert featuring Catriona Scott on\nclarinet, accompanied by pianist Catherine\nMilledge. The very sight of the names Judith\nWeir, John McCabe, Alun Hoddinott and\nMatthew Taylor next to each other on the\nprogramme was cause enough for rejoicing, and\nthe performances fulfilled the promise of such\nwise planning. McCabe’s early Three Pieces and\nHoddinott’s Sonata from 1967 gave a timely\nreminder of the solid craftsmanship and sheer\ndelight in music-making shared by these fine\ncomposers, whilst Taylor’s witty Three\nHumoresques provided a genuinely apt precursor\nto Poulenc’s autumnal sonata.\nUnfortunately, not all the programming lived\nup to this level of sensitivity. Cecilia McDowall’s\nString Quartet fared the worst, sandwiched –\nwithout a break – between Mozart’s Dissonance\nand Debussy’s G minor. It had fallen victim to a\nclumsy accommodation of the two ‘themes’\nrunning through the festival, of French music and\nthe chamber works of Mozart and Beethoven.\nMcDowall must have been squirming in her pew\nto see her new work trapped in the middle of this\nexhausting, overstuffed marathon of a concert,\ncarelessly thrown together. Ironically the post-\nwar Cheltenham Festival was also guilty of this\ntype of incongruous programming, where a new\nsymphony by a promising young British\ncomposer would share the platform with\nBeethoven’s Fifth, thereby prompting unhelpful\nand inevitably unflattering comparisons. By the\nearly 1960s, the Cheltenham Festival board\nrealized their mistake and began scheduling\ncontemporary works which illuminated rather\nthan eclipsed their new commissions. It’s a lesson\nfrom history the Presteigne Festival would do\nwell to heed before drowning any future\ncommissions in extraneous mainstream\nrepertoire. Presteigne doesn’t need ‘themes’ (nor\ncan it do anything but pay lip service to them in a\nmere six days). I hope it will concentrate on and\ncontinue to develop what it does uniquely and\nincomparably well – showcasing the best of\ncontemporary and 20th-century British music.\nPaul Conway \nProms 2004: Adams, Corigliano, Saariaho\nLike its predecessors Nixon in China and The Death\nof Klinghoffer, the third opera in John Adams’s\ntrilogy, Doctor Atomic, seems set fair to juxtapose\nmodern political forces, personalities and moral\ndebate. Here admiration for Robert\nOppenheimer and his fellow geniuses who\ncreated the atomic bomb is contrasted with the\nenormity of destruction wreaked on Hiroshima.\nWith over a year to go to the opera’s world\npremière by San Francisco Opera, the composer\nhimself conducted Easter Eve 1945, the opening of\nAct 2, at the Albert Hall on 22 August with the\nBBC Symphony Orchestra and Audra McDonald\nas soloist.\nKitty Oppenheimer, Robert’s wife, sings an\naria that, after its opening premonition of the\nmoment of detonation, is a reflective and\nrestrained setting of Muriel Rukeyser’s poem of\nthe same title. Kitty, as Adams portrays her, is the\n‘moral conscience’ of the opera, the thoughtful\none in contrast to the ‘Yankee ingenuity and\noptimism’ of the breakthrough-hungry scientists\nin Adams’s characterization.\nBrash, harsh stridency vs. slow free-floating\nrumination are the twin poles around which the\nearlier operas revolve. Easter Eve’s wordiness, and\nAdams’s decision to set such an abstract,\nintellectual poem, also remind us of his love of\ncomplex female 20th-century poets – witness El\nNiño. This latest piece also foregrounds a text that\nis essentially undramatic. ‘Now I say there are\nnew meanings now I name\/Death our black\nhonor and feast of possibility’ are typical lines.\nAdams is stronger on foreboding – from the eerie\nstring-inflected midnight atmosphere to the aria’s\nhighpoints: solos for trumpet and horn, the latter\nrecalling Britten’s own 1945 Serenade.\nBorn in Massachusetts, Adams has been a\nresident of California for over 30 years. His new\nconcerto for electric violin, The Dharma at Big Sur,\ngiven its European première in the same concert\nwith Tracy Silverman as soloist, moves us from\nthe University of California’s research facility at\nLos Alamos to the ‘super-real’ (Adams’s\ndescription) beauty of the echt-Californian Big\nSur with its plunging coastal scenery. The\nconcerto draws on the state’s radical side:\nKerouac travelling there in the 1960s, Jimi\nHendrix at the Monterey rock festival in ’67, the\nIndian-influenced hippie culture (not to mention\nTerry Riley and Lou Harrison). The solo part\ndraws upon all these traditions, from druggy\nmeandering, to passages that sound like\nimprovisation, to Hendrix-like (Silverman even\nleaning back as he plays) high-register intensity.\nThe first movement, ‘A new day’, states its rebirth\nnotions by using not only an orchestra (minus\nmost woodwind) that is re-tuned using just\nintonation, but also clear, uncluttered harmonies\nand textures providing a slow background against\nwhich the soloist emerges, the amplification\nexploited so that the apparent lack of attack\n  45\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nmakes the violin sound like some primitive pipe.\nThis is the new day of Matisse’s ‘Music’ or the old,\nsure religious harmonies of Adams’s own\nCommon Tones in Simple Time (1979).\nThe solo violin plays almost continuously, with\nmodest orchestral support – including two\nsamplers – using material derived from a simple\nrising and falling three-note figure played\nportamento. There is both a tranquillity and\nobsessiveness in the violin part that lends itself\nnaturally to a jazz-inflected style. The problem is\nlack of tension. The movement, slow\nthroughout, has a brief coda where tuned metal\npercussion bring that familiar California freeway-\nglittering-in-the-sun feel that we know from\nAdams passim. But piling Eastern mysticism, jazz,\neven the bright new dawn of proto-minimalism in\nthe mid-60s all together gives us a surfeit of laid-\nbackness.The lack of rhythmic drive is made up\nfor in the second movement, which starts attaca,\nthe soloist pressing the orchestra forward with a\nsnappy repeated figure that gains in length and\nexpressive power by transforming the first\nmovement’s principal phrase. Double-stopping is\nused almost for the first time, and as the soloist\nsoars off onto a fff climax the music is driven along\nby percussion again until we are momentarily\nback in familiar American raptures. Everything\nonly really comes together in the second half: the\nelectronically-echoing violin sounds like an\necstatic sitar, the ever-quickening and more\ncomplex solo part – using material previously\ndwelt on languorously – becomes infused with\ndrive and momentum in a confident, hammering\norchestral texture. East and West are\ntriumphantly united.\nAlthough he is about 10 years older than\nAdams, John Corigliano’s reputation has not risen\nso rapidly in his native America or in Britain. The\nperformance of his 1977 Clarinet Concerto on 1\nSeptember by Michael Collins and the BBC SO,\nthis time under Leonard Slatkin, was not only its\nfirst performance in London, but the first time\nthat any of his music has been played at the Proms.\nIn a pre-Prom interview, the London Times’\nJohn Allison put it to the composer that\n‘eclecticism’ was much in evidence in his work,\nand that this approach had attracted some\ncriticism. Corigliano parried by saying that ‘I\nwrite in lots of different styles’ – as indeed he\ndoes, but what Allison appeared to be\neuphemistically wondering was how derivative of\nother composers Corigliano is. (The recent\nSecond Symphony has many strengths, but much\nindebtedness too.) The Clarinet Concerto, one of\nCorigliano’s most popular works, is an interesting\ncase in point. The bright, extravert opening\nmovement sounds like no-one else in particular\nand embodies the qualities that can be found in\nhis music since the 1970s. ‘I wish to be understood\n… communication should always be the primary\ngoal’, he has said. Indeed, the first movement\ncommunicates effectively in a number of ways.\nFirst, the solo part is showy and impressively\ndifficult-sounding, but the central feature of the\ntwo cadenzas that make up the movement are\nvery fast up-and-down quaver runs that are as\nexciting as they are easy to spot when they recur,\nor when orchestral soloists take up and build on\nthese elements. Second, and helping the audience\nto maintain its grasp of the work, even at first\nhearing, is the structure. The opening cadenza\n‘Ignis fatuus’ bursts with free-running energy\nwhich colours the interesting central\n‘Interludium’ before the final cadenza, ‘Corona\nsolis’ (strange that such a populist as Corigliano\nshould go for Latin titles), bursts back in with\nmaterial – runs, trills and loud, dramatic leaps –\nderived from the first. Third, with its percussive\npianos, drums and exuberant solos for orchestral\nsoloists too, the work has many of the qualities of\nits original conductor and dedicatee Leonard\nBernstein. (Bernstein would doubtless have\nadded some vernacular or jazz-type rhythms to a\nClarinet Concerto of his own; Corigliano’s piece\nis notably more parsimonious with such eclectic\nborrowings as well as changes of mood.) \nThe slow central movement, an elegy for\nCorigliano’s father, concertmaster of the NYPO\nfor 23 years, doesn’t dispel the concern that the\nwork communicates fluently but not profoundly.\nIt heavily features the strings, opening with\nunaccompanied, slow, desolate textures and a\nsoulful melody that the soloist later joins with\none of similar character. The mood is unvaried\nthroughout, seven minutes or so deliberately\nwritten, so Corigliano tells us ‘without an\nemotional climax’. This is original in an elegy but\nnot very satisfying; nor in truth is the movement\nelegiac, there being no shifts of emotional gear,\nno stabs of grief, no memories of happiness, just a\nslow lament. At letter ‘N’ a solo violin\nunexpectedly joins the texture rather than the\nclarinet, which is a touching and effective\nsurprise, but it is not quite enough.\nThe fast finale, ‘Antiphonal toccata’, is thrilling.\nCorigliano throws in numerous elements:\nirregular rhythmic pulsations, the slow\nprocessional of Giovanni Gabrieli’s Sonata pian’ e\nforte, two timpanists with some cracking figures\nduetting left and right, a brass cluster-chorus\noperating at an independent tempo from the rest\nof the orchestra and, as if this weren’t enough,\noff-stage (actually in-audience) groups of brass\n46\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nand clarinets that take up the soloist’s ‘computer-\nlike’ fast-toccata figuration and exuberant runs.\nThe full brass Gabrieli comes blazing in (cf.\nBritten’s Young Person’s Guide) and all the various\nexcitements bubble frantically in the same pot at\nthe end. This is the triumph of eclecticism. No-\none is going to object to the use of the Gabrieli\nquotation, even if the finale’s impact is so heavily\ndependent on it. Drama – yes, communicability –\ncertainly, but in the flurry of messages, what\nfinally is being said? \nNo such audience-appealing concerns perturb\nKaija Saariaho. In yet another Prom in quick\nsuccession by the BBC SO – on 7 September, this\ntime under Jukka-Pekka Saraste – her 2002\norchestral piece Orion was given its UK première.\nAsked by Tom Service whether scores like this\none displayed, in their clarity, a heightened\ninterest to communicate, Saariaho ruminated and\nanswered in the negative.\nWhatever her intention was, Orion is a more\napproachable work than the two well-known\nlinked 1990 pieces for orchestra Du cristal and … à\nla fumée, recently reissued in performances by the\nLos Angeles PO under Salonen on Ondine. The\nCD’s addition is the interesting but hardly\nbutterfly-like Sept papillons (2000) expressively\nplayed by Anssi Karttunen. Not only is this her\nlongest purely orchestral piece at 25 minutes, but\nthe three descriptively-titled movements show\nSaariaho, avowedly a non-programmatic\ncomposer, come rather closer to the actions of\nhuman beings, albeit mythical ones, than\npreviously.\nOrion is the name both of a constellation and\nof the murdered son of Neptune, and to this\nduality Saariaho has added the life\/death\ndichotomy of the first movement ‘Memento\nmori’. The movement is particularly successful as\nSaariaho is more seductive and less gritty in her\nsound-world than we are used to. A subtle lament\nof anguish using glissando flutes during the\nfuneral procession-like section with its primitive\ndescending figures manages to be formally\ndistant and energetic yet at the same time\npersonal and lamenting. Better than – in territory\nthey both inhabit – Birtwistle.\nThe second movement, ‘Winter sky’, is more\nstatic and impersonal and shows Saariaho’s\nmastery of highly-coloured ‘spectralist’\norchestral writing, but the movement manages to\nbe more interestingly melodic than usual for this\nschool, even within its typically glacial\natmosphere. A sky full of winds and birds as well\nas glistening stars. It is less certain how well\nSaariaho can do happiness. The last movement,\n‘Hunter’, is marked sempre giocoso, yet Saariaho’s\nloud woodwind scales and brass mottos sound\nlike a cross between Messiaen and, oddly, John\nAdams. It’s all rather too earnest and thickly\nscored when an element of playfulness is surely\nwhat’s required. Still, both the fast tempo and the\nrole given to solo instruments are conscious\ndepartures for the composer; if compositions like\nOrion are the result of a new approach her name,\nwithout too much effort, will continue to rise\nhigher in the musical firmament.\nRobert Stein\nProms 2004: Turnage, Bingham, Sheng, Silk\nRoad, Henze\nIn fulfillment of a commission from the BBC for a\nwork in commemoration of the 75th anniversary\nof the BBC Symphony Chorus, Mark-Anthony\nTurnage produced Calmo, an untypically quiet\nand gentle work for chorus with handbells – and,\nwhat has become something of a signature\ninstrument for him, desk bells. The text of the\nwork consists of the words ‘Dona nobis pacem’\nand their translations in several languages. It is\ndedicated to the memory of Turnage’s friend Sue\nKnussen. Calmo’s intense eloquence was\nenhanced by its brevity, and, both despite and\nbecause of it, stood out in a program of music for\nchorus, harp, and organ by an assortment of older\nand newer Czech and British Composers,\nincluding Janácˇek, MacMillan, Holst, and Eben,\npresented by the BBC Symphony Chorus,\nconducted by Stephen Jackson.\nThe concert ended with the first performance\nof The Secret Garden for chorus and organ, another\nBBC Commission, by Judith Bingham. Bingham\nis the librettist as well as the composer of the\nwork; her text is a meditation that connects\nbiblical quotations from Genesis (about the\nexpulsion from Eden) and the Gospel of St.\nMatthew (about the Kingdom of Heaven). The\nchoral writing of The Secret Garden is elaborate\nand effective. The work itself is somewhat prolix,\nand seems to dispose of the words of its text at an\ninexorably consistent rate. The most effective and\nsuccessful part of it, for this listener, was the\norgan solo which is the work’s fulcrum.\nA greatly expanded London Sinfonietta,\nconducted by David Robertson, presented a\nconcert consisting of the first UK performance of\nBright Sheng’s The Song and Dance of Tears and the\nMessiaen Turangalîla Symphony. The Sheng was\noriginally commissioned by the New York\nPhilharmonic to mark the anniversary of the\ndebuts of Emanuel Ax and Yo-Yo Ma with the\n  47\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\norchestra. Ma requested that the work be related\nto Sheng’s travels along the route of the old Silk\nRoad and that it include a pipa soloist. Eventually\nit was agreed that Sheng would write a quadruple\nconcerto for the Western cello and piano and the\nChinese pipa and sheng.\nThe three movements of the piece, entitled\nSong, Dance, and Tears, respectively, are pretty\nmuch as advertised. Sheng’s fears of the pipa’s not\nbeing able to be heard over an orchestra was the\ncause of his initial reluctance to include it in the\nwork. In this performance the decision to amplify\nthe pipa – or at least as it was done on this\noccasion – seemed like a miscalculation, since in\nfact most of the time it was balanced over the\nother solo instruments, none of which stood out\nas clearly against the rather thick orchestral mass.\nBalances in general could have been better: early\non in the piece, solo instruments from the\norchestra which seemed to be intended to play\nensembles with the soloists were practically\ninaudible. The Song and Dance of Tears is dramatic,\nattractive, elegantly wrought, and compelling in\nmuch the same way that extremely good music\nfor movies is; and, in the same manner as most\nmovie music, has a fairly consistently low melodic\nprofile, making it all seem a little unspecific. That\nquality was highlighted by comparison to the\nMessiaen, which, however robust, rollicking,\nbrawling, silly, and just downright tacky it may be\nfrom time to time, left no doubt, even in this\nrather overly polite and refined performance,\nabout its intention, its earnestness, or its\ngenuineness.\nThe Silk Road Ensemble, a crossover project of\nYo-Yo Ma’s, members of which were the soloists\nin the Sheng work, returned to the Albert Hall\ntwo days later on their own, playing music from\nan array of non-western music cultures. The\nprogram, which featured consistently beautiful\nplaying, nonetheless raised questions and doubts\nabout exactly what was going on, and what it all\nmight mean. The program note informed us that\nthe Mongolian composer\/arranger of the first\nwork and the fabulous singer in that work, a\ncompatriot of his, both ‘represent a new\ngeneration of urbanised Mongolians ... who are\nas comfortable in one of Ulaanbaatar’s many\ndiscoteques and Internet cafés as in a ger, the\nround felt tent of Mongolian herders.’ After the\ninitial feeling that somebody might be pulling\none’s leg, one wondered just what to make of all\nthe implications of that statement. A certain\nvertiginous quality was provided by\nperformances of music of the Roma, featuring a\nsolo by the pipa player in the manner of The Tiger\n48\nConducted by James MacMillan, Sir Andrew Davis, Nicholas Kok\nWorks include Veni, Veni, Emmanuel, The Confession of Isobel Gowdie, Quickening,\nTryst, Epiclesis, Parthenogenesis, The World’s Ransoming plus music by some of\nMacMillan’s influences including Birtwistle and Messiaen\nGuests include Colin Currie, Daniel Hope, Ronald van Spaendonck, \nBBC Philharmonic, BBC Singers, Gould Piano Trio, Royal String Quartet\nVisit www.bbc.co.uk\/orchestras\/so for full details of all events and how to\nbook or call the Barbican Box Office on 020 7638 8891 for a free brochure\n‘...a composer so confident of his own musical\nlanguage that he makes it instantly communicative\nto his listeners.’  The Guardian\nA celebration of a composer at the forefront of 21st\ncentury musical life, with a weekend of concerts,\ntalks and events and a free, late-night ceilidh!\nDarkness \ninto Light:\nThe Music\nof James\nMacMillan\nFriday 14 —\nSunday 16\nJanuary\n2005\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nRag. The program presented transcriptions,\narrangements, and original works for ethnic\ninstruments as more or less the same thing,\nwithout hinting that what was being performed\nwas not exactly authentic folk music. Little\nacknowledgement was made of the fact that\nsomeone had had to write or arrange this music,\nor of those composers and arrangers, beyond\ntheir names and birth years. This listener found a\ncertain self-congratulatory assumption that the\nSilk Road Ensemble was making the world a\nbetter place for us all to live in not particularly\nappealing. It may well, be, though that none of\nthese reservations was important in the light of\nthe spectacularly dazzling playing and the\nconsistently infectious music making. Certainly\nthe very large audience seemed to be having one\nwhale of a time.\nThe Hamburg Philharmonic Orchestra and\nconductor Ingo Metzmacher brought the first UK\nperformance of the Tenth Symphony of Hans\nWerner Henze to the Proms. Henze first imagined\nthe music of the symphony to be ‘something\ncrystalline and clear and English’, conveying the\nquality of its intended first conductor, Simon\nRattle, as ‘a modern man in love with the world’.\nAlthough each of its four movements has a\nromantically evocative title – A Storm, A Hymn, A\nDance, A Dream – they are arranged in the manner\nof a classical symphony: a substantial first\nmovement, a slow movement, a scherzo, and a\nreflective finale. Musically the work also has a\nhighly evocative romantic quality. Henze deploys\nthe enormous orchestra used in the symphony\nwith consummate and magisterial mastery,\nunfolding at just about every moment of the work\nbeautiful and breathtaking instrumental textures.\nLike the Sheng piece, however, the symphony has a\nlack of melodic character and profile which makes\nits effect more general than specific. The\nperformance of this very difficult work – apart\nfrom the slow movement which seemed to be a\nlittle hurried and had a certain cursory quality –\nwas assured, understanding, and compelling.\nRodney Lister\nProms 2004: Zhou, Casken, Hillborg, Vine,\nTalbot\nThe Immortal by the Chinese-American Zhou\nLong (b. 1953) – commissioned by the BBC World\nService (apparently its first-even Proms\ncommission) and premièred by the BBC\nSymphony Orchestra under its out-going chief\nconductor, Leonard Slatkin, on 20 July – is a\ntribute ‘to the influence of Chinese artists and\nintellectuals in the twentieth century’, as the\ncomposer notes in the score. He adds: ‘Having\ngrown up in an artistic family during the time of\nthe Cultural Revolution, I know from personal\nexperience the struggles and hardships that past\ngenerations have endured to remain true to these\neternal ideals’. Past generations? Zhou himself\nwas sent to labour in the fields; a back injury had\nhim re-allocated to a song-and-dance troupe,\nwhere he encountered notionally prohibited\nwestern instruments among the Chinese ones – a\nstylistic integration he maintains even when\nwriting exclusively for the modern symphony\norchestra.\nThe Immortal, 13 minutes long, opens with\ndriving dissonances and the hint of Mossolov-\nstyle machinery before a passage of eerie glissandi\nsuggests not man but malevolent nature, with\nthreatening string pizzicati and shrill bird-calls in\nthe winds. The glissandi, Zhou notes, ‘represent\nthe desire for hope’, but the music hints that this is\nthe torture par l’espérance (Villiers de l’Isle-Adam)\nthat Dallapiccola expressed in Il prigioniero. A few\nfragments of melody struggle to articulate\nthemselves, but the glissandi – here are his\nwestern instruments suggesting Chinese\noriginals – stir up brooding, increasingly violent\ntempers, silenced by a fff chord. The uneasy stasis\nwhich follows hints at the ritual gestures of\ntraditional Chinese music, pentatonic snippets set\ninto an atonal framework, the edgy melodic\nfragments cross-cut by those glissandi elsewhere\nin the orchestra. At last a driving march-rhythm\ngives the music focus and coherence, but it is soon\nsilenced, and the orchestra shakes itself in a\nmighty spasm, quickly balmed by a passage of\nchimed stasis which defeats occasional attempts\nat motion. Quickening rhythms bring in another\nstamping gesture – tiny hints of Messiaen here –\nand the music sinks down into uneasy silence.\nCoincidentally, BIS has released a disc of four\norchestral pieces by Zhou, which showcases his\nattempts to integrate oriental and occidental\ntradition before The Immortal (BIS-CD-1322). It\nopens with Poems from Tang (1995) for string\nquartet and orchestra: four movements, half-an-\nhour long. The first, ‘Hut Among the Bamboo’, is\nall delicate half-shades, overheard gestures, high\nglissandi and harmonics perhaps suggesting an\noverhead bamboo canopy (the image occurred to\nme before I noticed the title). The second, ‘Old\nFisherman’, effects an extraordinary marriage of\nChinese sonorities and western instruments; for\nthe first time something emerges that western\nears would recognise as melody, and eventually\nthe music surges forth in a wave of joy, which\n  49\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nquickly subsides, leaving a shy optimism.\n‘Hearing the Monk Xun Play the Qin’ (a zither)\nopens with distant chimes (inspired, apparently,\nby the sounds of bells across Lake Como) that are\ninterrupted by a series of angry lashes; the\norchestra boils with unfocussed anger and the\nbells close calmly in again. The closing ‘Song of\nEight Unruly Tipsy Poets’ is Zhou’s Sorcerer’s\nApprentice: good humour gradually losing control\nof ebullient energy which threatens to\noverwhelm its origin – and evidence that Zhou\ncan throw an orchestra around as well as paint\naquarelles. Further evidence comes with The\nRhyme of Taigu (2003) which recreates the taigu\ndrumming tradition of ancient China with a\nforceful vigour that makes this piece something\nof a cousin to Revueltas’ Sensemayá, with the lusty\nenthusiasm of Copland’s ‘Hoe-Down’ in its\nwhooping closing pages – here’s a piece that\naudiences would respond to very directly; and at\ntwelve minutes long, it would make a perfect\nconcert-opener. Da Qu (1990–91) is a percussion\nconcerto of sorts (soloist, the dazzling Jonathan\nFox), far less western, more ritualised, than The\nRhyme of Taigu – far less fun, indeed, though no\nless exciting when it builds up a head of steam.\nThe stamping, off-beat chords in the first section\nbring The Rite of Spring very directly to mind; the\nfinale heaves with energy but without an\nequivalent sense of purpose. The disc ends with\nthe brief but powerful The Future of Fire (2001, rev.\n2003), for choir and orchestra, based on a Shaanxi\nlove song – another Sorcerer’s Apprentice story of\nthe farmers’ fire running out of control, and\nsounding for all the world like a cross between\nSteve Reich and Borodin’s ‘Polovtsian Dances’.\nNot having any point of reference, I imagine the\nperformances, by the Singapore Symphony\nOrchestra under Lan Shui, are excellent; and the\nsound is the usual BIS equilibrium of immediacy\nand transparency.\nBack to the Proms, and to John Casken’s\nSymphony, Broken Consort, a BBC commission\ngiven its world première by the BBC\nPhilharmonic under Gianandrea Noseda on 22\nJuly. Casken’s programme note observes that ‘A\nsymphony is not only a large-scale orchestral\nwork, but one that sets out to integrate\ncontrasting material into one unified structure’;\nthe title alludes to his inclusion of a ‘gypsy’\nensemble in the orchestra: cimbalom, piano\naccordion, electric violin and mandolin, grouped\naround the conductor for safety – another East-\nmeets-West piece to satisfy one of this Proms\nseason’s half-cocked thematic conceits. Casken\nbegins by playing sonorities and melodic lines\nagainst one another (why have so few other\ncomposers noticed how effectively the accordion\nslices through orchestral textures? It’s a\ntremendously potent colouristic resource), and\nflickering whisps of energy gradually energise the\nmusic. But it takes the ‘gypsies’ 13 minutes – far\ntoo long – to stir the westerners into a wild dance\nwhich, after all that waiting, fizzles out far too\nsoon and the piece drifts listlessly onwards; a\nsurge of power briefly looms and disappears into\nthe murk. The first movement was met by\napplause: not uncontrolled enthusiasm but\ngratitude from the audience who thought it was\nover and who didn’t find enough point of contact\nbetween Casken’s programme note and the\nmusic itself to work out where they were. The\nsecond movement began the directionless weft as\nbefore; another irruption of energy gave hope\nthat something genuinely symphonic might\nemerge – but no, and the play of static sonorities\nresumed. The gypsy dance breaks out again,\nsending the orchestra spinning into a fierce\nscherzo that slowly runs out of steam and coasts\ninto silence. Broken Consort didn’t begin to justify\nits 35-minute duration: the contrasts weren’t stark\nenough, the material not memorable enough for\nthe thematic integration to tell as a structural\ndevice. I wonder whether some drastic surgery\nmight turn this treatise in texture, with its\noccasionally kaleidoscopic play of colour, into\nsomething that packs more of a punch; I’m not at\nall sure it would.\nOne of the more satisfying newcomers at this\nyear’s Proms was the Swede Anders Hillborg’s\nExquisite Corpse (2002, revised the following year),\ngiven its UK premiere by some visiting\ncompatriots, the Royal Stockholm Philharmonic\nOrchestra under their young American chief\nconductor, Alan Gilbert, on 5 August. The title, as\nGuy Rickards’s note explained, is derived from ‘a\ncurious parlour game played by 1920s Surrealists,\nin which a prose text or poem was collectively\ncreated by various participants, each contributing\na word in turn but concealing it from the others\nuntil the end-point was reached and the finished\nwork read out’ – more familiar (minus the\ngrammatical rules) to contemporary listeners as\n‘Cheddar Gorge’ on that emperor of all radio\nprogrammes, I’m Sorry, I Don’t Have a Clue.\nHillborg reflects this procedure in a 17-minute\norchestral fantasia, doubling as a concerto for\nlarge orchestra, concatenating episodes\ncontaining references – sometimes quotations,\nsometimes stylistic allusions – to Stravinsky\n(Petrushka), Ligeti and other composers who have\nmeant something to him, concluding with a\nradiant quotation from Sibelius’s Seventh\nSymphony that introduces the lyrical closing\n50\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\npages. In the event, Exquisite Corpse was\nsurprisingly unepisodic, each section flowing\nsmoothly into the next; Hillborg’s easy alteration\nof fuller scoring and chamber-music textures\nregularly refreshes the ear and – behind the\npullulating surface details, shifting like the surface\nof the sea – his harmonies suffuse the work with a\nheart-warming inner glow. Exquisite Corpse is one\nof the most sheerly attractive new works I have\nheard in a while: always interesting, sometimes\neven beautiful. The adjective in the title is fully\njustified.\nAnother group of visitors, the impressively\ndisciplined Australian Youth Orchestra under\nLawrence Foster, brought us the UK première of\nCarl Vine’s brief (six-minute) Celebrare celeberimme\non 30 August. Scored for a full orchestra, it’s a\ngood-natured toccata that shakes itself awake with\ndelicate tendrils of melody which pass around the\norchestra as a sunny, summery pastorale gently\nemerges. After a broad tune the tempo gradually\npicks up, the orchestra generating speed and\nstrength, the brass intoning a theme that wouldn’t\nbe out of place in an American film-score. Side-\nand bass-drums batter out a tattoo, the\ntemperature cools, and a brief Goodwinesque\napotheosis rounds the piece off à la 633 Squadron\n(not a pejorative comment, by the way: 633\nSquadron contains some of the most memorable\norchestral writing you can hope to hear).\nCelebrare celeberimme did what it was intended\nto do: allow the orchestra a swift and jolly flourish\nbefore it settled to meatier fare. Joby Talbot’s 13-\nminute Sneaker Wave – another BBC commission,\nreceiving its world premiere on 2 September from\nthe BBC National Orchestra of Wales under\nGrant Llewellyn – overstayed its welcome.\nLikewise an orchestral toccata, it begins with\nbubbling overlaid patterns, announcing its\nminimalist credentials from the start. Happy and\nconsonant, it is dominated by bright, open\ncolours only occasionally disturbed by a ‘sneaker\nwave’ (a rogue wave which can surprise surfers)\nwelling up within the orchestra; the scoring –\nwith prominent tubular bells, marimba,\nxylophone, marimba, harp and piano – reinforces\nthe buoyant mood. And so the piece proceeds on\nits merry way, its displaced rhythms unfazed by\nthe odd dark shadow. By the time it reached its\nbrass-capped climax, reinforced by a\nsupererogatory organ, we had more than got the\npoint: the brusque ending was five minutes too\nlate. The essence, surely, of a sneaker wave is that\nyou don’t foresee what’s coming; unlike\nHillborg’s, the adjectival part of Talbot’s title was\na misnomer.\nMartin Anderson\n  51\nThursday 13 January at 7.30pm \nRNCM Composers’ Focus Day\nA unique opportunity to see a\nselection of compositions by RNCM\nstudents - rehearsed and recorded\nthroughout the day - performed in\npublic.\nThursday 20 January at 7.30pm  \nThe Kronos Quartet \nAppearing at only three venues\nduring a brief UK tour, one of the\nmost celebrated and influential\nensembles in the world today perform\nat The Northern.  \nThe programme includes a Meredith\nMonk world premiere, plus works by\nKevin Volan, Michael Gordon\nand Franghiz Ali-Zadeh.  \nSaturday 29 January at 7.30pm  \nBirmingham Contemporary\nMusic Group\nSongs and Dialogues \nConductor Oliver Knussen \nMezzo Soprano   Mary King\nPiano Nicholas Hodges \nLive electronics Jonty Harrison\nand \nLamberto Coccioli\nThe songs are Stravinsky’s - gems from\nacross almost half a century of his\ncomposing life - the dialogues are Elliott\nCarter – mature music praised by\nStravinsky. Two comparative youngsters\n– Andriessen and Anderson – complete\nthe programme.  \nNew Music at\nThe Northern \nFor further information or to book\ntickets, contact the RNCM Box\nOffice on 0161 907 5555.\nRoyal Northern College of\nMusic, 124 Oxford Road, \nManchester M13 9RD.\nEmail: box.office@rncm.ac.uk\nwww.rncm.ac.uk\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nGloucester Cathedral: Variations on \n‘Down Ampney’\nCommissioned by the Three Choirs Festival and\nperformed there for the first time on 13 August by\nthe Philharmonia Orchestra under Martyn\nBrabbins, these variations on Vaughan Williams’s\nhymn tune ‘Down Ampney’ (so named after the\nvillage of the composer’s birth), were surprising\nindividual successes. The overall shape of the\nwork, arch-like with a slow-fast-slow-fast-slow\nstructure, was suggested by John McCabe,\ncelebrating his 65th birthday year and featured\ncomposer at this year’s Three Choirs. McCabe,\njoined in this collaborative effort by Robert\nSaxton, James Francis Brown, David Matthews\nand Judith Bingham, also sensibly requested that\nthe orchestration be limited to double woodwind,\nmodest brass and percussion sections, harp and\nthe usual strings.\nThe work opened with McCabe’s orchestration\nof the theme, beautifully set in the woodwind and\nhorns with a gentle nod to Vaughan Williams’s\nown Fantasia on a theme of Thomas Tallis in the\nopening paragraph. This led seamlessly into\nMcCabe’s own variation, in compound time,\nagain with filigree writing in the woodwind, and\nwith duplet punctuation in a quartet and later an\noctet of solo violins. The theme was to be found in\na brass chorale interspersed with beautiful\nwoodwind colouration.\nThe quicksilver dash of Robert Saxton’s\ncompact second variation was sadly lost in the\nGloucester Cathedral acoustic, but a driving\nrhythmic thrust in the string writing was evident;\nSaxton made use of constantly changing\norchestral colour between woodwind, horns and\nbrass and culminated in an impressive fff climax.\nJames Francis Brown’s central slow movement,\na delightful lightly-scored confection, was\npossibly the most successful at utilizing the\nspecial acoustic properties of the cathedral;\nBrown’s music has the spirit of the English\nrenaissance, and his striking facility as a composer\nwas evident from the very first bar.\nNext followed an impressive scherzo from\nDavid Matthews; here we heard the work of a\nmaster orchestrator who served influential\napprentice periods with both Britten and Tippett.\nHow exciting, vivid and self-assured this variation\nwas – but again, despite an excellent performance\nfrom the Philharmonia, much of the detail was\nabsorbed by the cathedral acoustic.\nFinally a mesmeric, almost minimalist\nvariation, entitled The Yearning Strong, from Judith\nBingham. Here gentle pizzicato figures in the\nstrings and glimpsed memories of the ‘Down\nAmpney’ theme in the woodwind were\naccompanied by a simple quaver pattern played\non sandpaper blocks, a most effective resonance.\nThis gently beautiful variation brought the work\nto a quiet but satisfying close.\nI would love to hear these variations again in a\ndrier acoustic, and they stand up well as individual\npieces; unfortunately, however, the whole, on this\noccasion, was not greater than the sum of its parts.\nThe variations are published by Maecenas Music.\nGeorge Vass \nLondon, Temple Church and Cheltenham,\nPittville Pump Room: Wood’s ‘Cantilena and\nFugue’ and ‘Tribute to Michael Berkeley’.\nIt has been three years since the last Hugh Wood\npremière (his Fifth String Quartet), and in that\ntime his music has disgracefully become an\nendangered species – practically extinct – in\nconcert programmes. Therefore, his Cantilena\nand Fugue op. 47, given its first performance on 7\nJuly as part of the City of London Festival, was\ndoubly welcome. And, as if to compensate for the\nwait, a second new work followed just two days\nlater, with the première of Wood’s Tribute to\nMichael Berkeley, one of 20 short works\ncommissioned to mark Berkeley’s final year as\nartistic director of the Cheltenham Festival.\nThe Cantilena and Fugue, for the unusual\ncombination of trumpet and organ, opens with a\nbroad, expressive melody for solo trumpet. Varied\nrepetitions of this tune in both the organ and\ntrumpet underpin much of what follows,\nsometimes prominent, at other times functioning\ndiscreetly as a cantus firmus. The emphasis is thus\non the melodic material (and, as is to be expected\nwith Wood, on motivic concentration) rather\nthan colour; the careful selection of organ stops\nnevertheless cleverly articulates thematic\nmaterial and structure.\nThe subsequent Fugue, which Wood marks\n‘Brisk, brash’, complements the Cantilena\ndelightfully. Where the latter is sustained and\nsong-like, the former is characterised by staccato,\ndetaché quavers vigorously arpeggiating up and\ndown through leaps of (mainly) fifths. Despite\nthe brevity of the movement, Wood finds time to\npresent the subject in all manner of inversions,\naugmentations and strettos, before stopping the\nfugue in its tracks to end with a buoyant coda.\nThe Tribute to Michael Berkeley, for solo viola,\nrepresents Wood at his most romantic and\neloquent, opening with arcing melodic lines and\ngrowing to passionate and lyrical declamations,\n52\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nbefore returning to the opening calm at the end of\nthe work. A moving quotation towards the\nconclusion of the opening three chords from\nBeethoven’s Sonata op. 81a (‘Das Lebewohl’), makes\nfor a fitting farewell to Berkeley, whose tenure at\nthe Cheltenham Festival has resulted in many of\nthe recent performances of Wood’s music.\nGiven the relative lack of opportunity to hear\nWood’s music, it is critical that performers get it\nright. In the case of the Cantilena and Fugue, I\nregret to say that many in the audience would\nhave been left with a less than satisfactory\nimpression of the work due to many small but\nsignificant pitch and rhythm slips from the\ntrumpeter Deborah Calland. Full marks though\nto Roger Tapping, whose compelling\nperformance of the Tribute revealed to the\naudience just how powerful and expressive\nWood’s music can be.\nEdward Venn\nLondon, Purcell Room: New French Song\n‘I haven’t heard my piece yet, none of us have’,\nconfided thirtysomething composer Will Todd as\nhe arrived to take his place in the audience at the\nPurcell Room on 13 July. He spoke as one of the\ntwenty British composers, all alive and well,\ncommissioned by artists Alison Smart (soprano)\nand Katharine Durran (piano) to set a French\npoem for them to perform. Unusually, the\ncomposers had to submit their scores as if ‘tablets\nfrom on high’, without rehearsal input. Although\nthis worked well as they all entered into the spirit,\nand the artists seemed particularly adept at\ninterpretation over a wide range of genres – from\nGraham Fitkin’s mimimalist-style ‘Les Aliments\nBlancs’ (Satie: ‘je ne mange que des aliments\nblancs’), to John Casken’s impressionistic\n‘Colloque Sentimental’, with its shades of\nDebussy – having such a swift succession of 20\nshort ‘soundbites’ made for a rather over intense\nprogramme overall. Perhaps, on another\noccasion, a concentration on no more than ten\ncomposers, would allow for rehearsal time with\neach to assist in conveying more in-depth\ninterpretation of the text, and give the audience\nmore time to absorb each contribution.\nThe galaxy of composers, all distinguished in\ntheir own field, produced a highly accessible range\nof songs, based on poems from Hugo to Prévert.\nThere were several settings of Stephane Mallarmé,\nnotably Nicola Lefanu’s imaginative treatment of\n‘Billet à Whistler’, with its astounding opening\nvirtuosic burst of energy, and angular leaps of\nvocal line throughout, interspersed with use of\nspoken monotone in low register. Standing out as\none of the most innovative scores of the evening\nwas Sadie Harrison’s amazing use of varied font\nsizes for an exposé of text of Mallarmé’s ‘… issu\nstellaire’, combining the visual impact of the page\nset of the words with corresponding ‘clusters’ of\nsound. As Sadie herself describes it: ‘My setting of\nextracts from Un coup de dés, attempts to capture\nsomething of Mallarmé’s “empire of passion and\ndreams”, where silence is as important as sound,\nwhere images are strewn like stars on the page’.\nHer portrayal of individual lone stars, in the\nheavenly constellations, is punctuated by silences,\nmost ominously.\nMost impressive of all, in innovative terms,\nwas Adam Gorb’s ‘La Cloche Felée’, setting a\npoignant poem by Charles Baudelaire, where the\ncracked church bell was denoted by the pianist\ncleverly ‘stopping’ the bass strings of the piano to\nproduce a dead rasping sound, ‘like the heavy\ndeath rattle of a wounded man’.\nOf course in setting French poems, there is a\ntendency to the over-staid or stilted idiom,\nwhether in the original score, or in manner of\nperformance, but Howard Skempton managed to\navoid this in his setting of Apollinaire’s ‘Le Pont\nMirabeau’. Will Todd, whose swiftness in\nestablishing himself as one of Britain’s most\npromising young composers I have previously\ncharted for Tempo, went even further in his setting\nof the same text, which, in true Todd style,\ngripped the audience with the sheer flow and\npassion of his offering. ‘I saw it as an operatic\nexercise’, he explained after the concert. ‘Imagine\nit as a character on stage delivering an operatic\naria, and opera is my thing’. Writing in the\nIndependent on Sunday (18 July) George Hall\nproclaimed Todd’s contribution as ‘In first place’,\nin his scorecard of ‘winners of the evening’ – all\ninevitably British of course.\nI myself felt there were in fact no winners or\nlosers, but just 20 very valid contributions, but\nsadly no room to mention them all. Of those not\nalready referred to, I particularly enjoyed Edward\nMcGuire’s setting of his own poem of domestic\nbliss on early rising, Redgate’s quizzical setting of\nBeckett, Bob Chilcott’s ‘L’enfant dort’, Michael\nFinnissy’s ‘Salomé’ and Judith Bingham’s\nstructurally traditional setting of Hérédia’s ‘La\nJeune Morte’, which came across with her\ncustomary verve and impact. Last but not least,\nthe concert, attended by a large audience\nincluding all 20 composers, closed on nocturnal\nnote, with Edward Cowie’s unusually graphic\nOwl in ‘Les Hiboux’.\nJill Barlow\n  53\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nThree London reports\n1) Conway Hall: Ronald Stevenson’s Bax\nVariations \nA piano recital that begins with three Bax\nminiatures, continues with Ronald Stevenson’s\nPeter Grimes Fantasy and a Stevenson first\nperformance, and fills a parallel second half with\nthree Debussy studies, the Busoni Carmen Fantasy\nand the Rachmaninov Corelli Variations\n(ingenious programming!) might not be\ncalculated to sell the place out – the Conway Hall\non this occasion, on 4 May, for a concert given by\nJeremy Limb – but it guarantees those who do\nturn up a high-protein diet. The main course,\nStevenson’s Fugue, Variations and Epilogue on a\nTheme of Bax, was a long time in the cooking:\nbegun in 1983, it was finalized only two decades\nlater, in the last months of 2003, in response to a\nrequest from the Finnish pianist Matti Raekallio.\nThat the prize of the first performance went to\nLimb (b. 1971) is nonetheless appropriate enough:\nhe is Bax’s great-grandson.\nMuch of the music of both Bax and Stevenson\ninhabits a clearly Celtic aesthetic, and Stevenson’s\nnew piece, not quite 20 minutes in length, emerges\nfrom this world of half-colours and harmonic\nrefinement – the theme, taken from the second\nmovement of Bax’s Second Symphony, composed\nin 1924, is instantly recognisable as Celtic, as is the\ndevelopment to which Stevenson treats it.\nStevenson believes, logically enough, that his\nlistener’s ears are at their freshest at the beginning\nof a work, and so that where he prefers to site his\nfugues. This one is free (it is marked ‘without\nprotocol’), the entries not always immediately\napparent to the ear – it’s a sort of subterfugue, if\nyou like; indeed, the entire structure is plastic and\nsupple. The music emerges from the bass, slowly,\nhesitantly, singing modally of mournful places, its\nfrequent recourse to bitonality producing biting\ndissonance, and sonorous bass passages\nalternating with peppery passage-work in the\ntreble as a fanfare, with just a hint of Spanishry,\ncrowns the fugue. The variations creep in\nnervously, the theme shadowed by its own shape,\nas if looking over its shoulder, trying to articulate\na lonely hill song. A sardonic, impish jig precedes a\nfunereal elegy, the phrases extended by Lisztian\ntrills. Abrupt, toccata-like figurations characterize\nthe next variation, before the music flows into a\nbroader, more dignified passage, where Stevenson\nallows the theme its noble head in warmer, less\ntroubled harmonies than those that precede it.\nWith some sort of emotional stability established,\na series of calm chords, brief and beautiful,\nsuggest the onset of a chorale; instead, they\nintroduce the Epilogue, where Stevenson takes\nthe time to state Bax’s theme in unemphatic\ndecoration. As it sinks into well-earned rest, a\nbrief, Busonian chord threatens disruption, but a\nfinal pianissimo chord gently reasserts the\nharmony and the piece is over.\nThe Fugue, Variations and Epilogue on a Theme of\nBax is an oblique work: its power and craggy\nstrength are immediately obvious; equally\nobviously, there is all manner of subtlety that will\nemerge from repeated hearings and further\nperformances – and, as with the rediscovered 1939\nSonata in A, An Riobain Dearg (‘The Red Ribbon’) by\nErik Chisholm, reported in Tempo 58.228, it is a\nmajor contribution to a specifically Scots piano\nliterature.\nBut it wasn’t the last première of the evening.\nStevenson had suggested to Limb that a theme\nfrom the first movement of Bax’s Fourth Piano\nSonata would make a good fugue subject, and\nLimb duly composed one, springing it – and its\ndedication – unannounced on Ronald Stevenson,\ndown from Scotland for the occasion. Limb’s six-\nminute score treads a fine line of emotional\nambiguity, beginning in an uneasy lyricism which\nhints at darker, more passionate feelings below\nthe surface. A brief climax shakes fistfuls of notes\nout of the pianist’s sleeves in a stormy descent of\nthe keyboard before the lyricism returns in\nsinging textures that vaguely evoke Sorabji,\nIreland, even the blues; a powerful stretto surges\nup to close the work in unemphatic strength.\nJeremy Limb couldn’t coax much warmth of\ntone from the unresponsive Conway Hall\ninstrument, sounding in a dead acoustic, too (I’d\nlike to hear what he’d make of the programme\nsomewhere else, with a different piano). What he\nbrought to all the pieces he played was a resolute\ntextural and rhythmic clarity, which proved\nespecially valuable in elucidating Ronald\nStevenson’s contrapuntal complexities – and his\nown, which argue that Limb should swap the\nkeyboard for the writing desk more often: he\nplainly has something to say.\n2) Barbican: Poul Ruders’ ‘Listening Earth’\nPoul Ruders has become something of a specialist\nin vast orchestral scores portraying powerful\nnatural, even supernatural, phenomena: the\napocalyptic (literally) Således saae Johannes (‘Thus\nSaw St John’) in 1983–84, Tundra in 1990, Gong in\n1992 (the gong in question being the blazing disc\nof the sun), Fairytale in 2000 and, in 2001, Listening\nEarth, first performed by the Berlin Philharmonic\nunder David Robertson in November 2002 and\ngiven its UK première, again under Robertson’s\n54\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\ncapable baton, by the BBC Symphony Orchestra\non 6 March.\nListening Earth, a ‘symphonic drama’ in four\nsections, was intended as a celebration of life,\ninspired by the essayist Joseph Addison\n(1672–1719): ‘The Moon takes up the wondrous\ntale, \/ And nightly to the list’ning Earth \/ Repeats\nthe story of her birth’. The work opens with a\nmassive prelude, as a long string melody emerges\nfrom convulsive movements in the bass, with\nchimed percussion adding a tingling gloss.\nSuddenly the skies clear for a brief violin duo\nbefore the earth begins to spawn again; the horn\nmelody from ‘Morning’ in Peter Grimes can’t be\naccidental. The second section is an edgy\nnocturne, with long-held string chords and wind\nlines (and another Britten allusion or two) and the\npercussion gently chiming away the night.\nA sense of threat has been building in the\nbackground and suddenly, at Doppio tempo, quaver\n= 88 Alla breve tempestuoso, a nervous, haunted\nscherzo bursts through, whipped on its way by\ntourbillions from strings and wind and,\nincreasingly, braying brass. Ruders was working\non the score when 19 murderers flew into the\nTwin Towers and ‘personally – and as an artist – I\ncould no longer end the piece on a glorious and\nhappy note’. Addison then gave way to Auden’s\npoem ‘September 1, 1939’: ‘The unmentionable\nodour of death \/ Offends the September night’.\nThe music suddenly takes on a tragic tone and is\nbrutally assaulted by paroxistic blows from tam\ntam and bass drum. The strings maintain a stark\nelegy, with nervous woodwind commentary; a\nviola sola offers, unconvincingly, some cause for\nhope – and Listening Earth comes to a bleak and\nbloodied end.\nBad form to append a review of the latest of\nBridge Records’ CDs of Ruders’ music,2 since I\nwrote the booklet text, but his Fairytale, written\nto a commission from the Nordic student\norchestra Orkester Norden, is such an impressive\npiece that I cannot let it get away unobserved.\nFairytale, Ruders’ score explains, is\na tone poem based on a passage from one of Hans\nChristian Andersen’s lesser known fairytales, The Wind\nTells about Waldemar Daae and his Daughters, a mighty\nallegory about the transitoriness of Life, about Vanity\nand Pride and the inevitable victory of Death (alias the\nwind), whose scything ravaging is sublimely depicted\nby Andersen in these few, truly breathtaking lines: ‘And\nWinter rushed, Winter and Summer they rushed, and\nthey rush, like I rush, like the howling snow, the flurry-\ning apple blossom, the scurrying foliage; rush! rush!\nThe people too!’\nRuders’ wind, chill and implacable, blows straight\ndown from Tapiola, sweeping in, Presto feroce, from\nthe very first bar in orchestral textures that\ndemand the utmost virtuosity (Ruders was\nobviously out to prove these kids’ mettle). After\nthree minutes stamping triplets from the\npercussion seem to slow the hurricane, but the\nunderlying pulse pushes on undaunted: the storm\nmerely refreshes itself with a change of texture and\npiles onwards. Here, too, bass drum and tam-tam\ntry to batter the music into submission, managing\ninitially only in paring a few lines from the texture;\nunexpectedly, the chase drops to half-speed and a\nsuccession of massive clusters spreads from strings\nto winds and finally envelops the entire orchestra.\nBut nature will not be pinioned: Subito prestissimo,\nthe storm escapes and, ringed around with\neddying horns, rushes off to the terse double bar-\nline. This is thrilling music, with masterly\norchestral writing energized by a raw power that,\nheard live, must bring up the hair on the nape of\nyour neck. It deserves repertoire status.\n3) Conway Hall again: Gerard Schurmann’s\nString Quartet\nPremièred by the Chiligirian Quartet in Conway\nHall on 3 October, Gerard Schurmann’s String\nQuartet, was in truth its composer’s third foray\ninto the genre: two earlier exemplars, from 1943\nand 1946, were withdrawn many years back.\nSchurmann, a youthful 80 this year, has long been\nknown as a master of the orchestra, on the\npodium as well as at his desk, but latterly has been\nincreasingly drawn to chamber music, with a Duo\nfor violin and piano, two piano quartets and a trio\nfor clarinet, cello and piano from the past two\ndecades – hardly a telling quantity until one\nconsiders that his worklist barely passes the 30\nmark.\nThis quartet, some 25 minutes in length,\nsuggests he should have been at it a lot sooner: it is\na tightly argued, directly communicative work,\nthoroughly idiomatic in its use of quartet-texture –\nthough over-frequent recourse to unison writing,\nboth in little scalic runs and broad statements,\nsuggests every so often that Schurmann wishes he\nhad a string orchestra to hand.\nThe first of its four movements opens with a\nduet between second viola and viola in a dry-\neyed, reflective Adagio molto cantabile, where they\nare soon joined by cello and first violin.\nOccasional surges through the wiry cantilena hint\n2 RUDERS: The Music of Poul Ruders, Vol. 4: Fairytale;1 Piano\nSonata No. 2;2 De Profundis;3 Concerto in Pieces.4 1Orkester\nNorden c. Stefan Solyom; 2Thomas Adès (pno); 3Quattro Mani\n(pno duo), David Colson (perc); 4BBC Symphony Orchestra c.\nSir Andrew Davis. Bridge 9143.\n  55\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nat energies below the surface until a repeated\nfour-note figure unlocks a whirlwind Allegro of\nflying polyphony, intermittently interrupted by\nstabbing chords, some muscular unisono writing\nand re-examination of the opening material. A\nbright, folky dance – it’s wonderfully catchy – is\nquashed by another unison statement, the\ntension maintained as the tempo repeatedly\npushes forward and pulls back. The buoyant\ndance returns but a further unison passage and\ntwo brusque chords shut the movement up.\nThe tumbling pizzicato scherzo – playfully\nreminiscent of Britten’s Simple Symphony – is\nanswered by some lyrical arco writing in the trio,\nits melody given an awkward but attractive sway\nby its articulation in groups of two. The return of\nthe scherzo is silenced rather as the first\nmovement, with a single pizzicato chord.\nThe third movement, Adagio ed espressivo,\nbegins as a broad dialogue between first violin\nand cello over long-breathed support from second\nviolin and viola. A half-hearted attempt at a\nclimax falls back into a Bartókian rumination,\neach instrument – the cello especially – confiding\nits secrets to the others. Four times the viola\ninitiates further discussion, but the discourse\ncloses, unresolved and uneasy.\nThe finale sets out with another tough unisono,\nout of which a spiky Allegro vivace comes\nbarrelling forth before it’s eventually brought to a\nhalt by another ruminative passage, edgily lyrical,\ngently elegiac. The coda comes like a sunburst,\nwith radiant singing lines over spinning\nfiguration. A further series of staccato chords –\nanother a device I felt was overused – and another\nemphatic chord (a decidedly Brittenesque one)\nseals the action.\nMy misgivings about certain features of the\nquartet – chiefly its regular recourse to specific\ngestures – would very probably be silenced by\nanother hearing: familiarity might well allow me\nto hear them as integrative rather than repetitive.\nAnd one could hear that – for all the passion of the\nChilingirians’ performance – there’s much more\nto come alive once they’re played the work in: the\nslow movement has an intense glow that\nsomehow stayed below the surface on this first\nouting. That such deeper layers of meaning can\nbe sensed points to the richness and subtlety of\nmuch of the writing; what was immediately\nobvious was that it shares the same youthful\nenergy that characterizes its 80-year-old\ncomposer. Meantime, if those two early quartets\nwere staging posts towards this new work,\nhowever distant, it might be worth trying to twist\nSchurmann’s arm into blowing the dust off them\nand giving them another chance.\nMartin Anderson\n56\n"}