{"doi":"10.1029\/93JA01010","coreId":"67620","oai":"oai:eprints.lancs.ac.uk:35343","identifiers":["oai:eprints.lancs.ac.uk:35343","10.1029\/93JA01010"],"title":"Ionospheric convection response to slow, strong variations in a northward interplanetary magnetic field: A case study for January 14, 1988","authors":["Knipp, D.J.","Emery, B.A.","Richmond, A.D.","Crooker, N.U.","Hairston, M.R.","Cumnock, J.A.","Denig, W.F.","Rich, F.J.","de la Beaujardiere, O.","Ruohoniemi, J.M.","Rodger, A.S.","Crowley, G.","Ahn, B.-H.","Evans, D.","Fuller-Rowell, T.J.","Friis-Christensen, E.","Lockwood, M.","Kroehl, H.W.","Maclennan, C.G.","McEwin, A.","Pellinen, R.J.","Morris, R.J.","Burns, G.B.","Papitashvili, V.","Zaitzev, A.","Troshichev, O.","Sato, N.","Sutcliffe, P.","Tomlinson, L."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1993-11-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67620.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/35343\/1\/art_702.pdf","pdfHashValue":"a47facdd65ae216d0475d8946a1cf38291959331","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35343<\/identifier><datestamp>\n      2017-12-28T00:02:55Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Ionospheric convection response to slow, strong variations in a northward interplanetary magnetic field: A case study for January 14, 1988<\/dc:title><dc:creator>\n        Knipp, D.J.<\/dc:creator><dc:creator>\n        Emery, B.A.<\/dc:creator><dc:creator>\n        Richmond, A.D.<\/dc:creator><dc:creator>\n        Crooker, N.U.<\/dc:creator><dc:creator>\n        Hairston, M.R.<\/dc:creator><dc:creator>\n        Cumnock, J.A.<\/dc:creator><dc:creator>\n        Denig, W.F.<\/dc:creator><dc:creator>\n        Rich, F.J.<\/dc:creator><dc:creator>\n        de la Beaujardiere, O.<\/dc:creator><dc:creator>\n        Ruohoniemi, J.M.<\/dc:creator><dc:creator>\n        Rodger, A.S.<\/dc:creator><dc:creator>\n        Crowley, G.<\/dc:creator><dc:creator>\n        Ahn, B.-H.<\/dc:creator><dc:creator>\n        Evans, D.<\/dc:creator><dc:creator>\n        Fuller-Rowell, T.J.<\/dc:creator><dc:creator>\n        Friis-Christensen, E.<\/dc:creator><dc:creator>\n        Lockwood, M.<\/dc:creator><dc:creator>\n        Kroehl, H.W.<\/dc:creator><dc:creator>\n        Maclennan, C.G.<\/dc:creator><dc:creator>\n        McEwin, A.<\/dc:creator><dc:creator>\n        Pellinen, R.J.<\/dc:creator><dc:creator>\n        Morris, R.J.<\/dc:creator><dc:creator>\n        Burns, G.B.<\/dc:creator><dc:creator>\n        Papitashvili, V.<\/dc:creator><dc:creator>\n        Zaitzev, A.<\/dc:creator><dc:creator>\n        Troshichev, O.<\/dc:creator><dc:creator>\n        Sato, N.<\/dc:creator><dc:creator>\n        Sutcliffe, P.<\/dc:creator><dc:creator>\n        Tomlinson, L.<\/dc:creator><dc:date>\n        1993-11-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/35343\/1\/art_702.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/93JA01010<\/dc:relation><dc:identifier>\n        Knipp, D.J. and Emery, B.A. and Richmond, A.D. and Crooker, N.U. and Hairston, M.R. and Cumnock, J.A. and Denig, W.F. and Rich, F.J. and de la Beaujardiere, O. and Ruohoniemi, J.M. and Rodger, A.S. and Crowley, G. and Ahn, B.-H. and Evans, D. and Fuller-Rowell, T.J. and Friis-Christensen, E. and Lockwood, M. and Kroehl, H.W. and Maclennan, C.G. and McEwin, A. and Pellinen, R.J. and Morris, R.J. and Burns, G.B. and Papitashvili, V. and Zaitzev, A. and Troshichev, O. and Sato, N. and Sutcliffe, P. and Tomlinson, L. (1993) Ionospheric convection response to slow, strong variations in a northward interplanetary magnetic field: A case study for January 14, 1988. Journal of Geophysical Research, 98 (A11). pp. 19273-19292. ISSN 0148-0227<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35343\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/93JA01010","http:\/\/eprints.lancs.ac.uk\/35343\/"],"year":1993,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"JOURNAL OF GEOPHYSICAL RESEARCH, VOL. 98, NO. All, PAGES 19,273-19,292, NOVEMBER 1, 1993 \nIonospheric Convection Response Slow, Strong Variations in a Northward \nInterplanetary Magnetic Field' A Case Study for January 14, 1988 \nD. J. KNIPP, • B. A. EMERY, • A.D. RICHMOND, • N. U. C•OOK•,•, • M. R. HAIRSTON, 4 \nJ. A. CUMNOCK, 4 W. F. DENIO, s F. J. RICH, s O. DE LA BEAUJARDIERE, s J. M. RUOHONIEMI, ? \nA. S. RODGER, s G. CROWLEY, 9 B.-H. ArI•, •ø D. S. EVANS, • T. J. FULLER-ROWELL, • \nE. FRIIS-CHRISTENSEN, •2 M. LOCKWOOD, •3 H. W. KROEHL, •4 C. G. MACLENNAN, •s A. McEwIs, • \nR. J. PELLINEN, •7 R. J. MORRIS, •s G. B. BURNS, •s V. PAPITASHVlLI, •9 A. ZAITZEV, •9 \nO. TROSHICHEV, 2øN. SATO, 2• P. SUTCLIFFE, 22 AND L. TOMLINSON 23 \nWe analyze ionospheric convection pat terns over the polar regions during the passage of an in- \nterplanetary magnetic cloud on January 14, 1988, when the interplanetary magnetic field (IMF) \nrotated slowly in direction and had a large amplitude. Using the assirnilative mapping of iono- \nspheric electrodynamics (AMIE) procedure, we combine simultaneous observations of ionospheric \ndrifts and magnetic perturbations from many different instruments into consistent patterns of \nhigh-latitude electrodynamics, focusing on the period of northward IMF. By combining satellite \ndata with ground-based observations, we have generated one of the most comprehensive data \nsets yet assembled and used it to produce convection maps for both hemispheres. We present \nevidence that a lobe convection cell was embedded within normal merging convection during \na period when the IMF By and B, components were large and positive. As the IMF became \npredominantly northward, a strong reversed convection pattern (afternoon-to-morning potential \ndrop of around 100 kV) appeared in the southern (summer) polar cap, while convection in the \nnorthern (winter) hemisphere became weak and disordered with a dawn-to-dusk potential drop \nof the order of 30 kV. These patterns persisted for about 3 hours, until the IMF rotated sig- \nnificantly toward the west. We interpret this behavior in terms of a recently proposed merging \nmodel for northward IMF under solstice conditions, for which lobe field lines from the hemisphere \ntilted toward the Sun (summer hemisphere) drape over the dayside magnetosphere, producing \nreverse convection in the summer hemisphere and impeding direct contact between the solar wind \nand field lines connected to the winter polar cap. The positive IMF B= component present at \nthis time could have contributed to the observed hemispheric asymmetry. Reverse convection \nin the summer hemisphere broke down rapidly after the ratio [ By\/B, [ exceeded unity, while \nconvection in the winter hemisphere strengthened. A dominant dawn-to-dusk potential drop was \nestablished in both hemispheres when the magnitude of By exceeded that of B,, with potential \ndrops of the order of 100 kV, even while B, remained northward. The later transition to south- \nward B, produced a gradual intensification of the convection, but a greater qualitative change \noccurred at the transition through I By\/B= [ = I than at the transition through B= = 0. The \nvarious convection patterns we derive under northward IMF conditions illustrate all possibilities \npreviously discussed in the literature: nearly single-cell and multicell, distorted and symmetric, \nordered and unordered, and sunward and antisunward. \n1. INTRODUCTION \nAn interplanetary magnetic cloud passed the Earth on \nJanuary 14-15, 1988, resulting in very pronounced sig- \nnatures in the high-latitude ionospheric convection pat- \nterns. Coincident ally, a coordinated ionospheric observa- \ntional campaign was taking place under the global iono- \nspheric simultaneous measurements ofsubstorms (GISMOS) \nprogram. A large number of instruments were operat- \ning in both hemispheres, measuring the convection and its \ngeomagnetic effects as well as the ionospheric conductiv- \nity and the fluxes of precipitating auroral particles. We \nhave applied the assimilative mapping of ionospheric elec- \ntrodynamics (AMIE) procedure [Richmond and Kamide, \n1988; Richmond, 1992] to the data from these instru- \nDepartment of Physics, U.S. Air Force Academy, Colorado. \nHigh Altitude Observatory, NCAR, Boulder, Colorado. \nAtmospheric Science Department, UCLA, Los Angeles, Cal- \nifornia. \nUniversity of Texas at Dallas, Richardson. \nPhillips Laboratory, Hanscorn AFB, Massachusetts. \nSRI International, Menlo Park, California. \nJohns Hopkins University Applied Physics Laboratory, Lau- \nMaryland. \nBritish Antarctic Survey, Cambridge, England. \nCenter for Atmospheric Research, University of Mas- \nsachusetts, Lowell. \nCopyright 1993 by the American Geophysical Union. \nPaper number 93JA01010. \n0148-0227\/93\/93 JA-01010505.00 \n•0 Kyungpook National University, Taegu, Korea. \n• Space Environment Laboratory, NOAA, Boulder, Col- \norado. \n• Danish Meteorological Institute, Copenhagen, Denmark. \n• Rutherford-Appleton Laboratory, Chilton, Didcot, Oxon, \nEngland. \n•4 National Geophysical Data Center, Boulder, Colorado. \n•s AT&T Bell Laboratories, Murray Hill, New Jersey. \n•s Bureau of Mineral Resources, Canberra, Australia. \n•? Finnish Meteorological Institute, Helsinki. \n•s Australian Antarctic Division, Kingston, Tasmania. \n•9 IZMIRAN, Troitsk, Moscow. \n•0 Arctic and Antarctic Research Institute, St. Petersburg, \nRussia. \n• National Institute of Polar Research, Tokyo, Japan. \n• Hermanus Magnetic Observatory, HermanUs, South Africa. \n•s Institute of Geological and Nuclear Sciences Ltd., \nChristchurch, New Zealand. \n19,273 \n19,274 KNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE \nments in order to estimate the high-latitude convection \npatterns as they responded to the changing interplane- \ntary magnetic field (IMF). The derived convection pat- \nterns contain a wealth of information relating to solar-wind- \nmagnetospheric-ionospheric coupling processes. The present \npaper focuses on coupling during northward IMF conditions \nand explores the implications of the derived patterns for \nmodels of the coupling processes during periods when the \nsolar wind IMF varied slowly. This study goes well beyond \nthe earlier studies of this period by ffnipp et al. [1993] in \nconvection pattern analysis. \nOther studies of this interval have already shed signif- \nicant light on the magnetosphere-ionosphere sponse to \nthe strong solar wind forcing associated with the magnetic \ncloud. ½•mnock et al. [1992] have provided a detailed anal- \nysis of the convection of the early hours of January 14, 1988, \nand have discussed a mechanism for the evolution of a re- \nverse two-cell convection pattern during the 0400-0800 UT \ninterval. A trilogy of papers by F•eman e• al. [1993] and \nFarrugia e• ai. [1992a, 5] present an overview of the mag- \nnetic cloud structure and its magnetospheric and ionospheric \neffects, including estimates of the cross polar cap voltage \nfrom the D MSP F-8 ion drift data alone. The independent \ninvestigations discussed in that trilogy and in Knapp e• al. \n[1993], have concluded that: (1) strong reverse convection \nwith sunward flow in the southern (summer) polar cap devel- \noped during the interval of northward B•.; (2) simultaneously \nweak, distorted convection existed in the northern (winter) \npolar cap; (3) the summer hemisphere ion flow was strong \nand well ordered while the winter hemisphere ion flow was \nunordered with large velocity shears while B•. was positive \nand large; (4) the By component contributed to significant \nnoon\/midnight flow assymmetries; (5) the high-latitude con- \nvection strengthened as the ratio I By\/B•. I became large; \nand (6) under strong IMF By conditions convection flow \npatterns reverted to a near-normal two-cell configuration. \nAdditionally, Freeman e• •l. [1993] reported a change in the \ndawn-dusk •ymmetry of the southern hemisphere reverse \nconvection pattern associated with the changing By compo- \nnent and investigated the subsequent polar cap dynamics \nas B. turned southward. F•rru•?• et al. [19935] focused on \nthe substorm activity associated with the southward portion \nIMF portion of the cloud. \nWhile the large-scale configuration of convection is \nrelatively well understood when the IMF is southward \n(see review by McPherron [1991]), it is not Well under- \nstood for northward IMF. Recent reviews by Burke [1989], \nTroshichev [1990], and Moses and Reiff[1993] offer examples \nof many different convection configurations for northward \n!MF: single-cell and multicell, distorted cells and symmetric \ncells, ordered and unordered, and sunward and antisunward \nflow over the polar caps. Although numerous investigators \nhave provided insights into this plethora of convection pat- \nterns and have related many of the variations in convection \nto variations in the IMF components, much controversy still \nexists over the apparent multimode nature of the patterns. \nIt is widely believed that magnetospheric-ionospheric \nconvection is driven largely by the merging of the IMF with \ngeomagnetic field lines at the magnetopause, by merging in \nthe magnetotail, and to a lesser extent by some viscous- \nlike processes at the magnetopause that are still poorly un- \nderstood [e.g., Siscoe, 1991]. When the IMF is southward \n(negative iMF B.), magnetic merging can occur between the \nIMF and the northward closed geomagnetic field lines on the \ndayside magnetopause, as first proposed by Dungey [1961]. \nFor northward IMF (positive B.), Russell [1972] proposed \nthat merging occurs on open geomagnetic field lines extend- \ning from the polar caps into the geotail, resulting in lobe \nconvection that stirs field lines in the polar caps but do,es \nnot produce any net transfer of magnetic flux between open \nand closed flux regions. Alternatively, northward IMF may \nmerge with closed field lines poleward of the cusps, as first \nproposed by Dungey [1963]. Merging topologies for north- \nward IMF are reviewed by Crooker [1992]. \nNorthward IMF has often been associated with geomag- \nnetically quiet conditions. Hoffman et ai. [1988] describe \nperiods of extreme quiescence associated with positive B. \nvalues of less than I nT. However, as the B. component \nincreases beyond I nT, quiet conditions can give way to \nvigorous convection. Such vigorous convection can be in- \nferred from Israelerich et al. [1988] who reported electric \nfield strengths in excess of 100 mV\/m in sunward convect- \ning plasma. Knipp et al. [1991] have estimated a potential \ndrop across the polar cap in a reverse convection situation \nto be of the order of 80 kV. In this paper we show that vig- \norous reverse convection in the summer hemisphere, with an \nestimated dusk-to-dawn potential drop in excess of 100 kV, \nexisted simultaneously with. near-ground state conditions in \nthe winter hemispheres under near-solstice, northward IMF \nconditions. \nMaezawa [1976] first presented evidence that reverse con- \nvection cells in the polar cap, with a dusk-to-dawn poten- \ntial drop, existed during northward IMF. During northward \nIMF, separate convection cells equatorward of the polar \ncaps, apparently associated with viscous driving, can often \nbe identified [e.g., Burke et al., 1979; Poretara et al., 1984]. \nViscouslike convection refers to antisunward flow on closed \ngeomagnetic field lines on the dawn and dusk flanks of the \nmagnetopause. Merging can also occur when the IMF is \nmore nearly east-west, although the merging sites on the \nmagnetopause for this configuration are not yet well under- \nstood. \nThe patterns produced by Poretara et al. [1984] for the \nnorthern hemisphere show two reverse convection cells at \nhigh latitudes flanked by lower-latitude cells with an oppos- \ning sense of convection. Their diagrams for the northern \nhemisphere show that as By becomes more negative, the \npositive, high-latitude cell grows at the expense of the neg- \native cell until the positive cell becomes the dominant polar \ncap cell. In the southern hemisphere it is the negative cell \nthat dominates as By becomes increasingly negative. There \nremains some confusion regarding the way in which one cell \nbecomes dominant over the other. There are two possibili- \nties: (1) One cell grows in area, becoming round, while the \nother decreases in area, becoming crescent shaped, but the \ncells have equal potential drops across them, or (2) the po- \ntential in one cell grows while the other decreases. This dis- \ntinction is important because which process occurs indicates \nwhether the cells are merging cells or lobe cells, respectively. \nCrooker [1988] argues that in merging cells, only process 1 \noccurs. Lobe cells have no such constraints. \nIn contrast o the Poretara et al. [1984] patterns, Hepp- \nher and Maynard [1987] show distorted two-cell convection \npatterns for all northward IMF configurations. Part of the \ndistortion produces a wrapping of an extended cell across \nnoon. The degree of distortion depends on the strength of \nKNIPP ET AL.: IONOSPHEI•IC CONVECTION RESPONSE 19,275 \nBy. Their model's regions of sunward flow arise between the \ndistorted cells in the polar cap. The morning cell is gener- \nally confined to a region between approximately 0200 and \n0600 MLT. To date, the differences between the Poretara et \nal. and Heppner and Maynard models remain largely unex- \nplained, although Zhu and Kan [1990] argue that a four-cell \nconvection pattern can be changed into a distorted two-cell \npattern by nonuniform, anisotropic conductance in the iono- \nsphere. Knipp et al. [1991] used AMIE results and Crooker's \n[1988] antiparallel merging model to illustrate how severe \ndistortion of a reverse convection pattern could ultimately \nproduce a normal two-cell convection pattern under slowly \nchanging IMF. The time interval involved in changing the \nconfiguration was long enough to make the distorted two-cell \npattern nearly steady state. \nFriis-Christensen et al. [1985] have also derived an em- \npirical model of convection during northward IMF from 20- \nrain averages of magnetometer data from the west coast of \nGreenland during the northern hemisphere summer. Their \nmodel shows a By dependence that is similar to the Hep- \npner and Maynard model but with less severe distortions. \nThe flow is generally antisunward across the polar cap for \nall IMF orientations. \nThe impact of a.significant By component in the presence \nof northward IMF has been discussed by numerous investi- \ngators. The IMF By component produces antisymmetric \nconvection between the northern and southern polar caps, \nknown as the Svalgaard-Mansurov effect [Svalgaard, 1968; \nMansurov, 1969]. Recently, Cannon et al. [1991] and Crow- \nlevi et al. [1992] have used digital ionosonde (digisonde) data \nfrom the central polar cap to provide statistical information \non the By influence in highest latitudes. McCormac et al. \n[1991] have presented ata from a thermospheric wind anal- \nysis that show that By influences can be traced into the neu- \ntral atmosphere. They suggested that the ratio of lBy\/B.. I \nis crucial for determining the existence of reverse convec- \ntion and that reversed convection only occurs for B.. > 0, \nIBy\/B-- I< 1. \nCotvle•t [1981] suggests that the IMF-B. interactions \nwith the geomagnetic field are more subtle than those as- \nsociated with the other components. In the context of \nnorthward IMF, Luhmann eta!. [1984], Reiff and œuhmann \n[1986], Jankotvska et al. [1990], and Crooker [1992] have \ndiscussed how the IMF B. component can produce inter- \nhemispherical differences in convection through preferential \nmerging of the IMF with one ail lobe. \nSeveral studies have shown that convection is much less \nordered in the winter polar cap than in the summer polar cap \nfor northward IMF [Burke et al., 1979; Heelis and Hanson, \n1980; B•tthrotv et al., 1985; Hoffman et al., 1988; Carlson \net al., 1988]. Whether reduced wintertime conductivity or \nasymmetric merging is responsible for interhemispheric dif- \nferences is a point of contention. ganetti et al. [1982] pre- \nsented observations during northward IMF when the sum- \nmer hemisphere, tilted toward the direction of the oncoming \nsolar wind, showed strong Birkeland current activity, while \nthe winter polar cap appeared to have virtually no linkage \nwith the solar wind. However, for the same period, Reiff \n[1982] demonstrated the existence of sunward convection in \nthe winter polar cap and ascribed the difference in current to \nthe interhemispheric conductivity difference. Crooker [1992] \nproposes that lobe merging between the IMF and open tail \nlobe field lines is possible in only one hemisphere for north- \nward IMF when either dipole tilt or IMF Bx causes lobe field \nlines from one hemisphere to drape over the dayside volume \nof closed field lines. The model also suggests that reverse \nconvection is possible only when lobe field lines drape over \nthe dayside magnetopause. \nMost previous observational studies of global ionospheric \nconvection have relied either on information from individual \nsatellite passes across the polar regions, which measure elec- \ntric or magnetic fields only along the track, or on statisti- \ncal analyses of large collections of ground-based or satellite- \nbased measurements. Individual satellite passes have been \nable to measure only a small portion of the convection pat- \ntern. Statistical analyses may average out or miss small- \nscale and intermediate-scale features that are important in \nexplaining the drivers of the convection. It is only with the \nadvent of magnetogram inversion techniques [e.g., Mishin \net al., 1979; Kamide et al., 1981; Kamide and Buamjo- \nharm, 1985], inversion techniques for satellite auror• im- \nage data [Marklund et al., 1987], and the extension of these \ntechniques to include electric field and other measurements \n[Richmond and Kamide, 1988] that it has become possible to \nstudy \"snapshots\" of the convection over the entire polar re- \ngion [e.g., Kamide et al., 1986; Richmond et al., 1988, 1990; \nKnipp et al., 1989, 1991; Ahn et al., 1989; Mishin, 1990, \n1991; Eme•tj et al., 1990; Marklund et al., 1991; Marklund \nand Biotaberg, 1991]. Our analysis of the events of January \n14, 1988, is the first in which we have included satellite elec- \ntric field measurements in AMIE fits, and it is the first time \nwe have attempted to determine the convection and currents \nin the southern polar region. \n2. PROCEDURE \nThe AMIE procedure and its development have been \ndescribed by Richmond and Kamide [1988] and Richmond \n[1992]. It provides an objective method to estimate the \nhigh-latitude ionospheric conductivities, electric fields and \ncurrents, and associated phenomena from a combination of \nground-based and satellite-based instruments, taking into \naccount a priori information about features of the electrody- \nnamics, such as average patterns, expected variability, and \nspatial correlation distances of electric fields. Each obser- \nvation is weighted by the inverse square of its effective er- \nror, and the uncertainty in the estimated convection electric \nfield is calculated at every point over the polar region. In \nthe present case the uncertainties are substantial, owing to \nthe limited distribution of observation sites in the southern \nhemisphere and to the limited ability of magnetometer data \nto help determine the convection in the dark winter northern \nhemisphere, where the conductivity is often low. \nSeveral upgrades to the AMIE procedure have been made \nsince the above-cited publications. The spatial resolution \nhas been increased by adding more basis functions, up to \n244 from the previously used 121. The additional basis \nfunctions have shorter effective wavelengths, down to about \n5 ø in the north-south direction, signifying effective distance \nscales down to 5ø\/(27r) or roughly 1 •. In longitude the mini- \nmum wavelength is 30 •, corresponding to a distance scale of \nabout 5 • at auroral latitudes. The functions are constructed \nso as to be capable of representing any general pattern of \nelectric potential poleward of 50 • (previously 56 ø) magnetic \nlatitude. \nAnalysis of the spatial variability of the electric fields, \nbased on satellite observations in a manner to be docu- \n19,276 KNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE \nmented in a future publication, has also permitted us to \nimprove the specification of the matrix Cu (defined by Rich- \nmond and Karnide [1988]), which represents the tatistical \nproperties of this variability. This change affects the man- \nner in which AMIE interpolates and extrapolates from the \nobservations to estimate the continuous convection distri- \nbution and also affects the calculation of the uncertainty in \nthe results. In addition, we now compare the mean square \ndifferences between computed fields and observations with \nwhat the error analysis of AMIE predicts for these differ- \nences, and when necessary we adjust the effective data errors \nto improve the agreement in this comparison. This adjust- \nment increases the objectivity of the data error specifica- \ntions, which are a necessary input to the AMIE procedure. \nThe energy flux and mean energy of auroral particles \naxe closely related to the height-integrated ionospheric Ped- \nersen and Hall conductivities, which are calculated as part \nof the AMIE procedure. We have newly added to the AMIE \nprocedure an explicit estimation of the distributions of au- \nroral energy flux and mean particle energy, based on the \ndirect and indirect observations that are available. Our ini- \ntial estimates of the energy flux are from the models of \nFuller. Rowell and Evans [1987], parameterized by the 10- \nlevel hemispheric power index. The empirical mean energy \nmodel is obtained from the Hall-to-Pedersen ratio of the \nFuller. Rowell and Evans [1987] auroral conductance models, \nby finding a Maxwellian flux that produces the same ratio. \nThe resultant fits in energy flux and mean energy are then \nconverted to conductance. This procedure will be described \nin greater detail in a forthcoming publication. Usually, we \nassume that the auroral oval is conjugate, but in this study \nwhich is characterized by great interhemispheric diversity, \nthe hemispheres were solved separately for auroral parame- \nters with no assumption of conjugacy. \nWe have used the Foster et al. [1986] statistical patterns \nas a priori information. Knipp et al. [1993] found that when \ndata coverage is adequate, the a priori patterns have little \ninfluence on the mapped convection results. That study, \nwhich also focused on January 14, 1988, showed that the \ndata coverage was adequate in the northern hemisphere. For \nthe southern hemisphere we have found the data coverage \nadequate to limit the influence of the a priori patterns while \nB, was northward and the convection was confined to high \nlatitudes. \n3. DATA \n3.1. Data Locations \nFigure 1 shows the locations of ground-based and \nsatellite-based observations at 0000 UT used in this study \nfor the high-latitude portions of the northern and south- \nern hemispheres. Figures l a and l d show the location of \n100 magnetometers which are designated by their interna- \ntional three-letter codes. Twelve additional magnetometer \nstations located between 4- 40 ø magnetic were also used in \nthe analysis. For each radar (Figures lb and l e), both the \nradar location (large character) and the potential observ- \ning locations (small characters} are indicated. At any one \ntime, only a portion or sometimes none of the potential \nradar-observing locations actually return an echo of suffi- \ncient strength to a\/low measurement of the convection. In \ngeneral, the AMIE procedure uses data from a single aver- \naging period or scan for each radar, which varies between 5 \nand 20 rain for this analysis. In Figures 1 a- 1 c the northern \nhemisphere is viewed from above the north pole. In order \nto keep the same display format in magnetic latitude and \nmagnetic local time for the two hemispheres the southern \nhemisphere ionosphere (Figures 1 d- If) is viewed as though \none were looking at it through the Earth. \nBoth the DMSP F7 and F8 satellites are in Sun- \nsynchronous orbits at an altitude of around 840 km and \nhave orbital periods of around 100 min. The equatorial \ncrossings of F7 are close to 0900 and 2100 LT, while those \nof F8 are about 0600 and 1800 LT. As the Earth rotates \nunderneath the satellite orbital tracks, the footprints of the \ntracks move in magnetic latitude\/magnetic local time co- \nordinates because of the offsets of the magnetic poles from \nthe geographic poles. Figures lc and If show the extreme \nexcursions of the satellite tracks in magnetic coordinates \nthroughout the universal time of day for the northern and \nsouthern hemispheres, respectively. \n3.2. DMSP Satellite Data \nBoth DMSP F7 and F8 measured the downward en- \nergy flux and mean energy of precipitating auroral elec- \ntrons, which are used for estimating auroral conductivities. \nDMSP F7 also measured the vector magnetic field [Rich and \nGussenhoven, 1987], while F8 measured the cross-track com- \nponent of ion drift with the ion drift meter (IDM) [Heelis and \nHairston, 1990]. The horizontal components of the magnetic \nfield, after subtraction of a main geomagnetic field model, \naxe sequentially differenced to provide the gradient, along \nthe satellite track, of the magnetic field perturbation for use \nin AMIE, as in the works of Knipp [1989] and Emerg et at. \n[1990]. The ion drifts are mapped along geomagnetic field \nlines, scaled to a reference altitude of 110 km and converted \ninto electric fields by the approximate formula: \nEl101trn = -v(h) x Bl•0krn [Rs + 110km)\/(R• + h)] 3\/2 (1) \nSince only the velocity perpendicular to the satellite \ntrack is measured, only the electric field component along \nthe track is obtainable. All DMSP data for each hemisphere \nwithin 4- 15 rain of an analyzed time are used. \n3.3. Incoherent Scatter Radars \nThe Sondrestrom incoherent scatter radar (\"S\" in Fig- \nure lb) provided latitude scans of the vector plasma drift \nevery 20 rain throughout the period as well as conductance \nmeasurements above the radar. The plasma drift values are \nconverted to electric fields by (1). All observations within \n10 rain of the time being analyzed by AMIE are utilized. \nThe Tromso receiver of the EISCAT system (\"E\" in Figure \nlb) alternated between two low-elevation look directions 24 ø \napart on either side of the magnetic meridian every 5 min. \nThe line-of-sight velocities are converted to electric fields by \n(1). The Millstone Hill incoherent scatter radar (\"M\" in Fig- \nure lb) scanned over 40 • of azimuth from north-northwest \nto northeast at a low-elevation angle every 5 min. \n3.4. HF Sounders \nThe Polar Anglo-American Conjugate Experiment \n(PACE) consists of two coherent, high-frequency, backscat- \nter radaxs [Greenwald et al., 1985; Baker et ai., 1989] oper- \nating on a fixed frequency between 8 and 20 MHz deployed \nat Goose Bay (\"G\" in Figure lb) and Halley (\"H\" in Figure \nKNIPP ET AL.: IONOSPHERIC ONVECTION RESPONSE 19,277 \no\/ \n'• øOoo \n• % • o• ø ...... • \no•., o ½• \n200 \n• • o \nO • \n19,278 KNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE \n1 e). The radars require the presence of decameter scale iono- \nspheric irregularities. These drift with the ambient plasma \nat F region altitudes [Ruohoniemi et al., 1987]. The drift \nvalues are converted to electric fields by (1). Ten-rain av- \nerages are used from Goose Bay, while 5-min averages are \nused from Halley. \n3.•. Digisonde \nThe Qanaq, Greenland, digital ionosonde (digisonde, \n\"Q\" in Figure lb), yields plasma drift velocities from the \nF region [Reinisch, 1986; Buchau et al., 1988]. Digisonde \nconvection analyses have been presented by Reinisch et al. \n[1989], Cannon etal. [1991], and Crowle•t t al. [1992]. Drift \nvelocities were provided every 15 min and are converted to \nelectric fields by (1). \n3.6. Oround Magnetometer Data \nThe magnetometer locations above 40* north and south \nmagnetic latitude are shown in Figures 1 a and 1 d. The mag- \nnetic perturbations used as input for the AMIE procedure \naxe the difference between disturbed day values and quiet \nday values. The quiet day used for most Stations is between \nJanuary 9, 1988, 1200 UT, and January 10, 1988, 1200 UT. \nThe D,t effect is removed from the magnetic X (northward) \ncomponent of M1 stations as part of the data processing. \n4. INTE•LANETARY AND GEOPHYSICAL PARAMETERS \nFigure 2 shows the geophysical conditions for January \n14, 1988. At the top of Figure 2 are the times for which \nobservations from various instruments are available. Data \navailability is indicated by broken or continuous bars. Fig- \nures 2b, 2c, and 2d show the IMF Bx, By, and B. com- \nponents in geocentric solar-magnetospheric (GSM) coordi- \nnates, as measured by the IMP 8 satellite which was located \nat approximately 35 RE in the midmorning local time sec- \ntor. The total field strength, Bt, (shown in Figure 2e) was \nunusuMly large throughout most of January 14, reaching \n30 nT at around 1600 UT on January 14. The changes \nin field direction were generally slow, associated with the \norganized and unusually strong magnetic field within an in- \nterplanetary magnetic cloud [Farrugia et al., 1993a]. It is \nthe slow, smooth execution of a large rotation (> 180 ø) over \nthe scale of a day with • minimum of high-frequency fluc- \ntuations that defines a magnetic loud [Burlaga et al., 1990] \nand allows us to extract a wealth of information on varia- \ntions of solar-wind-magnetospheric-ionosphere coupling pro- \ncesses. The ratio of IMF By to B. (I By\/B. I) is shown in \nFigure 2• where it is maximized at a value of one. Figure \n2g shows the solar wind speed, which was relatively large \nfor most of January 14. The high speed is associated with \nspacecraft-to-magnetopause transit time of less than 5 min. \nThe geophysical response had a clear association with \nthe IMF direction. Figure 2h shows the AE index, calcu- \nlated from the 60 magnetometer stations of our set that lie \nbetween magnetic latitudes of 550 and 760 north or south. \n(As noted by Akasofu et al. [1983] and Kamide and Akasofu \n[1983], auroral electrojet indices calculated from more than \nthe conventional 12 northern hemisphere sites will be larger \nthan the conventional indices.) The index showed moder- \nate activity until about 0530 UT and then a subsequent re- \nduction in activity as the IMF became strongly northward. \nElectrojet activity increased after 1200 UT as the IMF By \n{o) \n112 gnd \nF7 mag (NH) .... \nF7 rnag (SH) - - - \nF8 IDM (NH) - - \nF8 IDM (SH) \nJANUARY 14, 1988 \nSondrestrorn \nElSCAT \nMillstone \nGoose Bay -- \nHalley • -- -- \nQanaq .... \nF7 eleo - - - \n.......... F8 elee ........... \n(g) \n(h) \n0 \n900 \n700 \n500 \n(i) \n• i ,,I • I I I i I I J I \ni I i f \nI000 \n0 \n'o \nc: 5 \n\"• 0 • i I • • I \n0 6 12 \nUT (hours) \n18 24 \nFig. 2. Data availability and geophysical conditions on January \n14, 1988. (a) Times for which data are available. The line next \nto each instrument or set of instruments is filled when data are \navailable and is blank when data are missing. The instruments \nare 112 ground magnetometers; DMSP F7 magnetometer in the \nnorthern hemisphere; DMSP F7 magnetometer in the southern \nhemisphere; DMSP F8 ion drift meter (IDM) in the northern \nhemisphere; DMSP F8 IDM in the southern hemisphere; Sondre- \nstrom incoherent scatter radar; EISCAT incoherent scatter radar; \nMillstone Hill incoherent scatter radar; Goose Bay HF radar; Hal- \nley HF radar; Qanaq digisonde; DMSP F7 auroral electron spec- \ntrometer in the northern hemisphere; DMSP F7 auroral electron \nspectrometer in the southern hemisphere; DMSP F8 spectrome- \nter in the northern hemisphere; and DMSP F8 auroral electron \nspectrometer in the southern hemisphere. (b-e) Interplanetary \nmagnetic field (IMF) data from the IMP 8 satellite of \nand B,, respectively, in geocentric solar-magnetospheric coordi- \nnates. (f) The derived ratio I Bx\/B= I. (g) The solar wind velocity \nmeasured by the IMP 8 satellite. (h) The AE index, calculated \nfrom 49 northern and 11 southern hemisphere stations located \nbetween 55* and 76* magnetic. (i) The hemispheric power in- \ndex, defined by Foster et al. [1986] and calculated from auroral \nparticle precipitation measurements on the DMSP spacecraft. \ncomponent became large, even though Bz was still positive. \nShortly after 1600 UT the IMF turned strongly southward \nand the AE index jumped above 600 nT, where it remained \nfor nearly 19 hours. \nKNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE 19,279 \nFigure 2i shows the hemispheric power index (as defined \nby Foster et al. [1986]), determined from measurements by \nDefense Meteorological Satellite Program (DMSP) instru- \nments of auroral particle precipitation energy flux in the \nrange 300 eV to 20 keV. Moderate precipitation levels were \nmeasured before 1300 UT on January 14, but during the \nensuing storm, the levels increased. The hemispheric power \nindex is the parameter used to specify the initial models of \nthe electric potential and the auroral energy flux and mean \nenergy of the AMIE procedure in the present study. \n5. RESULTS AND DISCUSSION \n5.1. IMF Re•7ime: B• > O, By > O, B, > O \nFigures 3a and 4a, 4b and 4c show the convection at 0255 \nUT, 0345 UT, and 0435 UT. Available ground magnetome- \nter data, radar data, and ion drift meter (IDM) data are \noverlain on these plots. Satellite magnetometer observations \naxe available and assimilated but not shown. According to \nFreeman et al. [1993] the Earth was immersed in the sheath \nregion between the interplanetary shock and the magnetic \ncloud proper prior to 0500 UT. Because of an IMP 8 data \ngap between 0115 UT and 0400 UT we cannot be sure of \nthe IMF orientation for the 0255 UT and 0345 UTplots, \nbut continuity of the main convection features in the plots \nand interpolation of the IMF data suggest that the IMF \nconditions were similar for all of the convection patterns in \nFigures 3 and 4, that is, Bx > 0, By > 0, B.. > 0. \nFigure 3b [after Curehock et al., 1992] displays the single- \ncomponent, high-resolution IDM data for 0255 UT, showing \nvery ordered flow with speeds below 1 km\/s. The laxge-scale \npattern in Figure 3a was dominated by a round positive- \npotential convection cell, with the latitudinal extent of the \ncell defined by the IDM data and the strength of the cell \ndetermined both from the IDM data and the ground mag- \nnetometer data. More than 50 kV of the 85 kV cross-polax- \ncap potential difference was contained in this cell, which was \ncentered near 83 ø magnetic latitude. The remainder of the \npotential was associated with an elongated negative cell in \nthe dusk region. \nWe interpret this pattern in the framework of merging, \nlobe, and viscous convection as modulated by an IMF config- \nuration with all components positive. Figure 3c from BurcA \net al. [1985], which was originally drawn for strong By and \nsouthward IMF conditions, provides a conceptual diagram of \nhow lobe, merging, and viscous cells may combine to form \na laxge-scale convection system. Based on suggestions by \nReiff and Luhmann [1986] and our results, we have applied \nthis diagram to northward IMF, as do Burke et al. [1993]. \nThe merging convection (drawn as a heavy contour) pro- \nrides an outer convective envelope in which both viscous \ncells (dashed regions) and lobe cells (light contours) can be \nembedded. The merging and viscous cells share the same \nsense of convection, and in the absence of interhemispheric \nconductivity differences and By effects hould be conjugate. \nMerging convection is in the usual sense: antisunward across \nthe polar cap and sunward at lower latitudes. The lobe \ncell circulation is completed at high latitudes and may op- \npose the convection associated with closely positioned vis- \ncous cells. Lobe circulation is inherently nonconjugate. \nThe arrow in the high-resolution data plot (Figure 3b) \npoints to a region of diminished sunward flow which has been \naveraged out of the data shown in Figure 3a. The Cure. \nhock et al. [1992] detailed analysis of the convection during \nthe early hours of January 14, 1988, suggests that the di- \nminished flow region may be the signature of an embedded \nviscous cell. In general, viscous cells may not be resolvable \nin our laxge-scale mappings of ionospheric convection. Co- \nley et al. [1987] estimate a typical ionospheric width of 50 \nkm for these cells and suggest hat the signature of a viscous \ncell may be smeared out by field-aligned potential drops and \ncould show up as either a small region of antisunwaxd flow \nor a region of diminished sunward flow. Mozer [1984] found \non average only 2 to 3 kV of potential associated with them. \nG. Lu and P. H. Reiff (unpublished manuscript, 1992) ar- \ngue that ground magnetometers cannot sense the magnetic \ndeviations associated with such small-scale features. When \nthe IDM data are assimilated they are averaged into 20-s \nbins which correspond to a resolution of 150 km and are \nthus unlikely to sense viscous cells of normal size. \nIn accord with Burchet al. [1985] we identify any con- \nvection circulation that completely closes poleward of the \nviscous cell as lobe convection. We propose •that lobe, merg- \ning, and viscous drivers combined to produce the convection \npattern in the southern hemisphere at 0255 UT. The dusk \ncell is probably the result of both merging and viscous ef- \nfects, while the dawn cell is likely to be the result of all three \nconvection drivers. By comparing Figures 3a and 3c and us- \ning the above criteria to identify lobe convection, it appears \nthat lobe convection contributes to an imbalance of the two \npotential cells [Crooker, 1979; Burchet al., 1985; Reiff and \nBurch, 1985] and accounts for approximately Z0 kV (35%) \nof the potential drop across the polar region at 0255 UT. \nReiff and Luhmann [1986] attribute voltages as high as 35 \nkV to the lobe circulation process. \nFigures 4a and 4b show the 0345 UT southern and \nnorthern hemisphere convection patterns, respectively. The \nsouthern hemisphere convection plot for 0435 UT is shown \nin Figure 4c. At 0345 UT the DMSP satellite was over \nthe northern pole. Hence the southern hemisphere convec- \ntion pattern was mapped from only Halley Bay HF data \nand ground magnetometer data. The Halley Bay observa- \ntions help confirm the continued existence of the laxge-scale \nconvection around the positive potential cell, while the mag- \nnetometer data, which provide the bulk of the information, \ngive definition to the rest of the convection cell. Again more \nthan 50 kV of the potential drop across the polar cap was as- \nsociated with the positive cell. The nature and extent of the \nnegative cell at 0345 UT is much less ceftin (as indicated by \nthe dashed contour lines) than at 0255 UT, primarily due to \nthe unavailability of data. The negative cell bears an inter- \nesting resemblance to the distorted cell drawn by Heppner \nand Maynard [1987] for similar IMF conditions. However, \nthe stretching of this cell may be only an artifact of the way \nthe AMIE procedure extrapolates the potential beyond the \nregion of observations. Thus it is possible that the AMIE \nprocedure has linked two physically unrelated regions of neg- \native potential. We suspect this to be the case because two \nspatially distinct cells are mapped for subsequent times (see \nFigures 5d, 5e, and 5f). \nThe northern hemisphere pattern for 0345 UT (Figure \n4b) shows a weak, but spatially broad negative potential \ncell dominating the afternoon region and a smaller positive \ncell in the morning region. In stark contrast to the vigorous \nbut ordered convection mapped for the southern hemisphere \nat 0345 UT, the northern hemisphere convection is weaker \n19,280 KNIPP I•T AL.: IONOSPHI•RIC CONVI•CTION P•I•SPONS]• \nKNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE 19,281 \n1988 JAN 14 03:45 UT 12 \nMHI 8 \/ \/ •• \n\/ ' ;' .... \n: C,, • ..... \n•0 mV\/m • •, • 800 •T \noo \nELECTRIC 1988 JAN 14 03:45 UT 12 ELECTRIC \nPOTENTIAL •- • POTENTIAL \n90 kV \/'• .... ,,'; • 53 kV \n_50 ø , 50 ø \n\/ . - •,, • \n- \\ \nß ß \n1988 JAN 14 04:35 UT 12 ELECTRIC \nBz= 10.9 \/ • 104 kV \nMHI 7 \/ ._ \n\/ • _50 ø -. \n- ,. \/'\"• x .... •- • .... x , , ' , • . \ntel , I ' ---I Joe \n\/ \n50 mV\/m • \"\" .... •'• \/ 200 nT \noo \nFig. 4. Electric potential patterns for B, > 0, B• > 0, B, > 0: \n(a) 0345 UT, southern hemisphere; (b) 0345 UT, northern hemi- \nsphere; axtd (c) 0435 UT, southern hemisphere. Five-minute av- \nerages for IMF B., By, and B, age shown in (c) in the top leftß \nIn (b) electric fields measured by the Goose Bay, Millstone Hill, \nand EISCAT radags age polewagd of the letters \"G\", \"M\", axtd \n\"E\" (pagtially obscured by the DMSP data), respectively. The \nEISCAT axtd Millstone Hill me•urements axe line-of-sight veloc- \nities, so the resultant electric fields shown include the calculated \ncross-track drift (or line-of-sight electric field). (Remember that \nthe fields have been rotated 90 ø to point in the direction of the ion \ndrift.) There age also Sondrestrom (\"S\") and Qanaq (\"Q\") mea- \nsurements. (a)Halley HF measurements axe plotted polewagd of \nthe \"H\". Some of the southern hemisphere magnetic perturba- \ntions age too small to be cleagly visible at the times shown in the \nfigures. (b) For clagity the northern hemisphere ground magne- \ntometers age not shown. (a and c) The flow is anti sunwagd across \nthe polag cap and sunwazd at lower latitudes. (b) Antisunwagd \nflow exists between the positive and negative potential cells; sun- \nwagd flow exists at latitudes neag 70 ø magnetic. See Figure 3• \nfor further details. \na•d highly turbulent. Numerous flow reversals exist in the \nnorthern hemisphere IDM data, and regions of high-speed \nflow are interspersed with regions of near-zero flow velocity. \nThis type of flow is typical of the winter hemisphere. Burke \net al. [1979] and Hoffman et al. [1988] estimate that large- \nscale coherent flow patterns in satellite data can only be rec- \nognized 30%-40% of the time in winter when B. is positive. \nAccording to Hoffman et al. [1988] these patterns tend to \nbe weaker, more contracted versions of those observed dur- \ning active periods. Generally, the clearest patterns emerge \nfrom the dayside where conductivities are relatively high. \nHeelis et al. [1986] point out that these coherent patterns \ntend to occur during times of extremely large and prolonged \nnorthward IMF, compatible with our results. \nThe weakness of the 0345 UT northern hemisphere con- \nvection may be due in part to a large a•tisunward dipole tilt \na•d the positive Bx component. Reiff and Luhmann [1986] \n. \nsuggest hat lobe cell formation should be difficult in the \nnorthern hemisphere when B.. > 0, which was probably true \nfor this time, and Crooker [1992] suggests that lobe cells \ncan exist only in the summer hemisphere or the Bx-favored \nhemisphere in which the geomagnetic field Bx component is \nantiparallel to the IMF Bx component. Therefore we find it \nlikely that most of the cross-polar-cap potential drop (~ 50 \nkV) in the northern hemisphere should be azsociated with \nviscous and\/or merging cells. This value is in good agree- \nment with the merging\/viscous voltage value we suggested \nfor 0255 UT in the southern hemisphere. Since merging and \nviscous interactions should be similar between hemispheres, \nwe would expect relatively good agreement in these values. \nThe impact of the large, positive By component is seen in the \nenhancement of the southern (northern) hemisphere dawn \n(dusk) cell at 0345 UT. \nThe southern hemisphere convection at 0435 UT (Fig- \nure 4c) was also dominated by a large positive convection \ncell which most likely contained embedded lobe circulation. \nThis plot is the first convection plot for which we can verify \nthe IMF values (B• = 5.0 nT, By = 18.2 nT, B. = 10.9 \nnT) which are 5-rain averages centered on 0435 UT. The \npattern is similar to the southern hemisphere patterns for \n0255 UT and 0345 UT. However, islands of negative poten- \ntial are evident in the region previously shown with a single \nelongated region of negative potential (0345 UT, Figure 4a). \nIt is possible that these islands simply reflect the influence \nof individual magnetometers and\/or the IDM data in the \nAMIE estimation procedure. But there may be some addi- \ntional significance to the discrete nature of these cells. Cure. \nhock et al. [1992] argue that the region near 1100 MLT is \nassociated with the center of an expanding lobe cell whose \ndevelopment is associated with the growing magnitude of \nthe B.. component. They suggest a means by which a domi- \nnant, sing!e-lobe cell convection configuration evolves into a \n19,282 KNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE \nKNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE 19,283 \ndouble lobe cell convection configuration. It is possible that \nthe distorted cell stretching across magnetic noon in Figure \n4a is actually a combination of viscous and merging con- \nvection (dusk region) and B..-driven lobe convection (dawn \nregion). At 0435 UT (Figure 4c) and 0755 UT (Figure 5d) \nthese regions become increasingly more distinct. \n5.2. IMF Retiime: Bx • O, B• Switchinti SitIn, B• • O, \nand [ B•\/B, [Less Than Unity \nThe IMF underwent a slow change between 0600 UT and \n1130 UT. The By component slowly decreased while B.. re- \nmained strongly positive. The solar wind speed remained \nhigh. In this interval we witness the development of strong \nreverse convection in the southern hemisphere. Our data \nshow that a conjugate reverse pattern did not exist in the \nnorthern hemisphere. The total potential difference in the \nnorthern hemisphere averaged to roughly one third that in \nthe southern hemisphere, and the nature of the convection \ncells is quite different between the hemispheres. As our pre- \nvious discussion suggested, the positive Bx component and \nthe extremely tilted dipole appear to control the strength of \nconvection in each hemisphere. \nWe begin the series at 0705 UT (Figure 5a). The ground \nmagnetometers in the northern hemisphere (not shown) had \nnegligible deviations while, the IDM data (overlain in Figure \n5a) show regions of highly structured ion flow. As a result \nthe northern hemisphere convection was highly structured; \nFigure 5a shows multiple convection reversals. The IMF \nchanged little in the subsequent 50 min, yet the state of \nconvection in the southern hemisphere at 0755 UT (Figure \n5d) was very different from that in the north at 0705 UT. As \nreported by Freeman et al. [1993] and shown in Figure 5d, \nthe IDM recorded strong, organized flow vectors consistent \nwith a reverse convection pattern at very high latitudes. \nAt 0850 UT (Figure 5b) the northern hemisphere con- \nvection was in a relaxed state with little organized structure \nevident in the observations and with only a 25-kV potential \ndrop in the polar region. The By component had become \nnegative. A single round cell is mapped from the turbu- \nlent IDM data. The situation was very similar for 1030 UT \n(Figure 5c), although small ground magnetic perturbations \n(not shown) combined with data from the EISCAT radar \n(\"E\" in Figure 5c) to yield islands of negative potential in \nthe afternoon sector and a 25-kV potential drop across the \npolar region. During the same period the southern hemi- \nsphere convection strengthened. Electric field values in the \nvicinity of the reverse convection cells at 0935 UT (Figure \n5e) were over 100 mV\/m, producing in a dusk-to-dawn po- \ntentiM drop of 109 kV with more than 60 kV in the nega- \ntive potential cell. Sensitivity test runs for 0935 UT, with \nground magnetometer and satellite data incorporated sep- \narately, confirm the large reverse potential drop. The high \nsolar wind velocity may help explain these large electric field \nvalues. In showing Figure 5f, we deviate slightly from the \nother plots of the convection series to show the convection \nfor 1040 UT which contained no IDM data (the subsequent \nDMSP pass, which just barely skims the sunward edge of \nthe reverse convection, is shown in Figure 7a). We do so \nto confirm the sensitivity test at 0935 UT, which showed \napproximately the same reverse convection pattern using ei- \nther ion drift data alone or magnetometer data alone. The \ntwo reverse cells are determined by large and oppositely di- \nrected Z variations, as shown in Figure 5f The pattern \nat 1040 UT also illustrates the. persistent difference in con- \nvection between the two hemispheres that existed while the \nmagnitude of By remained less than that of B... \nFigure 6a shows schematically a possible magnetic topol- \nogy that is of assistance in interpreting the interhemispheric \ndifferences just described. The figure illustrates the mag- \nnetospheric configuration during periods of northward IMF \nwhen the Earth's dipole is tilted into the solar wind, ap- \npropriate to summer in the southern hemisphere [Crooker, \n1992]. The dashed curves lie in the noon-midnight meridian \nplane, with the dotted-dashed outlining the magnetopause, \nand the solid curves drape over the dusk flank. At the motiv- \ning site on the magnetopause (marked by an \"X\" in the \nsouthern hemisphere) an open lobe field line merges with the \nnorthward IMF to form an open field line that drapes over \nthe dayside and subsequently convects tailward generating \nlobe convection. The topology is similar to that proposed \nOVERDRAPED \nLOBE \nß . DORMANT LOBE \nFig. 6. (a) Schematic illustration of overdraped lobe field lines (shaded) created by lobe merging in the southern \nhemisphere. A dormant tail region is indicated in the unshaded region tailward of the overdraped dayside. See \ntext for explanation. (b) Mapping of the overdraped and dormant ail lines (shaded area) to the polar cap. \n19,284 KNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE \nearlier for the generation of reversed, two-cell convection oc- \ncurring completely on open lobe field lines during periods of \nnorthward IMF [Russell, 1972; Maezawa, 1976] except that \nmuch of the overdraped flux lies inside the magnetopause. \nThe resulting overdraped lobe topology suggested here helps \nalleviate the steady state problem of sunward flow in the \nionosphere on field lines connected to antisunward flowing \nsolar wind [Hill, 1992]. The large open arrow in the fig- \nu•e indicates the sense of circulation in the dusk cell. A \nsymmetric dawn cell is assumed to exist on the other side \nof the noon-midnight meridian plane. The lobe field lines \nform a funnel of sunward tipped flux that splays out over \nthe surface like hair blowing in the wind. \nWhat is different from the earlier versions [Russell, 1972; \nMaezawa, 1976] and pertinent to the AMIE results is that \nthe topology allows lobe cells in one hemisphere only, the \nsummer hemisphere, in agreement with the well-ordered \nconvection observed there and the lack of ordered convec- \ntion in the winter hemisphere (compare Figures 5a-5c and \n5d-51'). In the model the flux centers on the magnetic poles. \nThe amount of open flux in the overdraped lobe and, con- \nsequently, circulating in the lobe cells is determined by the \ndegree of dipole tilt. Although the diagram shows relatively \nmodest amounts of open flux, extreme dipole tilt and large \npositive IMF values can substantially increase the circulat- \ning flux. These model features are consistent with the near- \npole location and small size of the observed reversed cells \nas mapped in Figures 5d-5•. The proposed lobe cell con- \nvection is basically a dayside rather than a tail process, as \nsuggested by the schematic in Crowley et al. [1992], who \nhave used digisonde data from Qanaq, Greenland, to study \npolar cap convection. \nFigure 6b illustrates the lobe convection cells generated \nin the southern polar cap by the Figure 6a merging topology. \nThe shaded region maps to the overdraped lobe. The elec- \ntric field from the merging site is applied across the nightside \nof this region, driving the sunward convection. On the ba- \nsis of results presented in the next section we propose that \nthe largest portion of the polar cap maps to a normal, tail- \ndirected lobe consisting of open but dormant field lines, as \nillustrated in Figure 6a. The dormancy of the field lines \nand hence the convection in this region is indicated by the \nunshaded area tailward of the convection cells in Figure 6b. \nApplication of Figure 6a to the results in Figure 5 is \nstraightforward. The strong, steady reverse convection in \nthe summer hemisphere is attributed primarily to over- \ndraped lobe cells, as in Figures 6a-6b. Addition of By effects \nto the above topology will cause one merging cell to increase \nin potential with respect to the other, as discussed earlier. \nBoth of these effects are apparent in Figures 5d and 5e. As \nBy changed from positive to increasingly negative values, \nthe southern hemisphere high-latitude negative cell grew in \narea and strength, at the expense of the positive cell. Figure \n5) • appears to be an exception to this case, but the relative \nstrength of the convection cells in that plot is somewhat \nuncertain due to the assimilation of ground magnetometer \ndata only. \nReverse convection in the southern hemisphere is the \nmost obvious manifestation of the large positive B, com- \nponent, but other signatures may exist. We pointed out the \npossibility of an embedded viscous cell in Figure 3a. Mitchell \net al. [1987] have shown that the low-latitude boundary \nlayer is substantially thicker during northward IMF than \nduring southward IMF. This may allow for expansion of the \nviscous interaction region along the flanks of the magne- \ntopause when the IMF is strongly northward (P. H. Reiff, \nprivate communication, 1992). Some indication of expanded \nlow-latitude cells exists in Figure 5d. Although these cells \nare not as evident in Figure 5e, the high-resolution IDM \ndata (not shown) for Figures 5e (and 5d) indicate that cells \nwith antisunward flow at high latitudes and sunward flows at \nlower latitudes existed equatorward of the reverse convection \ncells. If these cells are viscous in nature, their spatial foot- \nprint in the ionosphere is unusually large, consistent with \nMozer [1984] and Heelis et al. [1986] who show larger than \naverage viscous values (~ 10-15 kV) for northward IMF sit- \nuations. The positive cell at 0200 MLT and 800 magnetic \nlatitude in Figure 5f is only defined by a few magnetometer \nstations, while the negative cell at dusk near 700 latitude is \neven more uncertain. A sensitivity study shows that these \nlow-latitude cells are not the result of the initial electric po- \ntential model. However, a portion of the 50-kV voltage in \nthe low-latitude cells may be as,ociated with viscouslike in- \nteractions, although 50 kv is well above previously reported \nvalues for northward IMF. The large voltages and subse- \nquent dynamics of these cells lead us to propose that these \ncells may be the result of enhanced merging brought about \nby the increasing magnitude of By, as we discuss next. \n5.3. IMF Regime: B v < O, Bz > 0 [By\/B, [ Increasing \nFigure 7 shows the evolution of convection between \n1120 UT and 1535 UT, during a period of increasing ratio \nI By\/B, I. In the three hours prior to this interval, B, had \nbeen stable at nearly +20 nT, while By had become increas- \ningly negative. As the interval progressed, the magnitude of \nBy approached and then exceeded that of B,. Dramatic con- \nvection changes occurred just as the ratio I By\/Bz I exceeded \nunity. \nSouthern hemisphere. At 1120 UT, as the ratio I By\/Bz I \napproached unity, the D MSP satellite (Figure 7a) was skim- \nming just poleward of 650 magnetic latitude in the south- \nern hemisphere providing very little to the determination \nof the convection pattern. The primary convection features \nat 1120 UT were similar to those at 1040 UT (Figure 51) \nand consisted of a set of slightly asymmetric reverse con- \nvection cells situated at high latitudes and a set of cells \nwith convection in the normal sense just tailward of the re- \nversed set. We interpret the 1120 UT reverse convection \ncells as predominantly lobe convection. They correspond to \nthe compact convection cells in Figure 6b. In addition to \nthe reverse cells the 1120 UT pattern has spatially larger \ncells that extend toward the nightside. Within 10 min after \nBy achieved the same magnitude as B..,•the positive cell of \nthe reverse convection pair weakened and significantly con- \ntracted. By 1145 UT (Figure 7b) the positive cell had nearly \ndisappeared, while the negative potential high-latitude cell \nhad strengthened. It is possible that the increasing I By\/B.• I \nratio established a new magnetopause merging site on closed \ndayside or flank field lines that transferred newly opened flux \nacross the high-latitude region, thus contributing open flux \nto a pair of normal merging cells that ultimately spanned \nthe entire polar cap. The new negative merging cell en- \ngulfed the existing negative lobe cell (Figures 7b-7d), while \nthe new positive merging cell formed on the dawnside of the \nnegative cell, where it would be expected for normal (not \nreverse) convection. \nKNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE 19,285 \nBetween 1120 UT and 1240 UT the magnitude of the \nincreasingly negative By component became significantly \nlarger than B•. Within that interval the reverse convection \nconfiguration virtually disappeared (Figure 7J). Meanwhile, \nthe positive nightside cell strengthened and expanded and \nby 1240 UT the itow across much of the polar cap took on an \nantisunward component (Figure 7J). The bulk of the tran- \nsition was achieved less than 60 min after the I By\/B• I ratio \nexceeded unity. Evidence of simultaneously enhanced merg- \ning in the northern hemisphere is discussed in the next sub- \nsection. Despite the fact that the ratio continued to increase \nafter 1215 UT the convection pattern stayed in essentially a \nstable configuration after that time. This seems to indicate \nthat a I By\/B• I ratio close to unity is critical in determin- \ning the configuration of high-latitude convection when the \nIMF is northward. It may be the dividing point between \nwhat were formerly considered patterns for northward and \nsouthward IMF, at least near solstice. Thus normal two-cell \nconvection exists [•rijima and $hibaj•, 1987; C'roo\/cer, 1988; \nMcCormac et al., 1991] for a broad range of IMF orienta- \ntions. The final state of convection achieved from the tran- \nsition most closely resembles the patterns derived by Friis- \nChristen,en et al. [1985] for B. > 0, By < 0. The plots in \nFigure ?•-?f are crucial in showing how the transition from \nreverse convection to normal convection occurred. \nAt 1400 UT the broad scale of the positive dawn cell \n(Figure ?e) was confirmed by a lower-latitude ground mag- \nnetometer data station l•cated at 64ø magnetic latitude and \n0100 MLT. The last element of the convection series (Figure \n?•) shows the state of the high-latitude convection achieved \nfor 5-min average IMF values of Bx = 0.0, By =-30.9 nT, \nand B= = 2.1 nT at 1535 UT. The cross-polar-cap otential \ndifference associated with this east-to-west IMF was at least \n75 kV in the southern hemisphere (and probably closer to \n100 kV, given that sensitivity studies of the AMIE procedure \nshow that use of ground magnetometer data alone for AMIE \nmapping during large Bz negative conditions can underes- \ntimate the cross-polar-cap potential difference by approxi- \nmately 20%). Even for Bz • 0, the flow across the polar \ncap had an antisunward component, but as was the case at \n1240 UT, the itow rotated and constricted slightly to pro- \nduce a dawn-to-dusk flow component in the region tailward \nof the 0600-1800 MLT line. This interval provides a unique \nopportunity to study rapid convection reorganization that is \nattributable more to the variations in relative magnitudes of \nIMF components than to variations in any individual IMF \ncomponent. \nOur final point regarding this event concerns Iteppner \nand Ma•\/nard'• [1987] distorted two-cell patterns. If a satel- \nlite were to make repeated passes over the transitioning pat- \nterns of Figure 7•-7f, we assert that the empiric .al pattern \nobtained after averaging the associate d electric fields would \nbe similar to a southern hemisphere version of Heppner and \nMaynard's distorted two-cell pattern for B• • 0 and By • 0. \nIt is thus possible that some of the strong distortion in \nthe Heppner and Maynard two-cell patterns is an average \nrepresentation of a set of transitory convection states like \nthose mapped here. This does not imply, however, that dis- \ntorted two-cell patterns are associated only with rapid'iMF \nchanges. Knipp et al. [1991] show distorted two-cell pat- \nterns that exist for periods of several hours. \nNorthern hemisphere. Now we consider the northern \nhemisphere convection for a subset of the period just dis- \ncussed, focusing on the times for which we have IDM data. \nAt 1210 UT (Figure 7g) we see a general continuity of several \nof the features mapped at 1030 UT (Figure 5½), although the \npotential drop nearly doubled during the interval. Areas of \nweak negative potential were spread across the dusk sector \nand a round positive potential cell dominated the polar cap. \nWhat is d•erent in the 1210 UT pattern and possibly \nsociated with antisymmetric developments in the southern \nhemisphere (see Figure 7½) is the strong negative potential \ncell situated well t•ilward of the positive cell. The devel- \nopment of this region suggests merging was initiated at or \njust prior to 1210 UT. The negative cell is defined by the \nIDM data as well as the ground magnetic perturbations (not \nshown). Uncalibrated northern hemisphere DMSP imagery \n(not shown) provides clear evidence of regions of auroral \nbrightening consistent with substorm onset at 1210 UT. Af- \nter 1210 UT we observe an expansion and strengthening of \nthe entire convection pattern (Figures 7h and 7 0. Evidence \nof this expansion comes from both the IDM data and the \nground magnetometers. The t•ilward negative-potential cell \nof Figure 7g expanded toward the dayside as the I By\/B. \nratio increased beyond unity (as did the positive t•ilward \ncell in the southern hemisphere). \nThe developments depicted in Figure 7 show a surprising \ndegree of interhemispheric similarity which increases with \ntime (but not conjugacy, since the development is mirror \nimage and thus not on conjugate field lines). By 1535 UT \nboth hemispheres contained cells that can be described as \n•crescent\" and 'Cround,\" each containing nearly equal po- \ntential, thus indicating merging as the primary convection \ndriver. 'We attribute this development o the increasing im- \nportance of the By component. As the By magnitude grew, \nthe convection strength in both hemispheres also increased. \nBy 1535 UT, little interhemispheric d fference in voltage \nor convection configuration was evident. Nearly 80 kV of \ncross-polar-cap voltage was associated with almost purely \neastward IMF (Bx • 0 nT, By -•-30.9 nT, B.. -- 2.1 nT). \nFreeman et al. [1993] have commented that the transition \nto two-cell convection preceded the southward turning. This \nis evident from Figure 7. The B• component, while proba- \nbly contributing to interhemispherical convection asymme- \ntry prior to 1400 UT, became negligible after 1400 UT and \nwas not a likely contributor to the convection configuration \nat 1535 UT. We note that the two-cell nature of the pat- \nterns we map at 1535 UT is somewhat different than a stan- \ndard southward IMF convection pattern. The final result at \n1535 UT (Figure 7 0 is a near-normal two-cell pattern with \na cross-polar-cap potential drop of 93 kV. The itow pattern \nacross the polar cap is clearly antisunward, but the convec- \ntion is centered at. unusually high latitudes, consistent with \na smaller polar cap for northward IMF. \nMuch of the interhemispherical asymmetry which we \nhave attributed to the effects of overdraping (Figures 5 and \n6 and associated iscussion) disappeared as the l By\/B• \nratio increased beyond unity. This is an important point. \nAs we depict in Figure 6a, a portion of the southern hemi- \nsphere lobe itux was draped over the dayside, thereby reduc- \ning southern hemisphere tail lobe magnetic pressure. As the \nmagnitude of By increased, both open-to-open and closed- \nto-open merging may have begun equatorward of the cusp. \nThe former would act to return the overdraped lobe flux to \nthe t•il, while the latter would initiate normal convection \nadding itux to both tails. Evidence of enhanced t•il merg- \n19,286 KNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE \n•o \nKNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE 19,287 \ning in both hemispheres is seen in the plots of Figure 7. \nPutther evidence is seen in the rise of the AE index in the \n1200 UT-1500 UT interval (see Figure 2h). Thus it appears \nthat cessation of reverse convection and overdraping was a \ncontributing factor to substorm initiation for the solstice \nconditions we describe here: I By\/B= I> 1 and B,. > 0. \n$.4. IMF Beg\/me B v << O, B, < O, I Bv\/B, l> 1 \nA brief look at the northern hemisphere's convection as \nthe IMF turned southward completes this paper's descrip- \ntion of the ionospheric convection response to the January \n14, 1988, magnetic cloud. At 1550 UT the IMF turned \nsouthward, but the convection retained the dominant fea- \ntures acquired during the previous interval of large negative \nBy and decteasingly positive Bz. Figures 8a-8c illustrate the \nslow transition to the more normal two-cell convection pat- \ntern usually associated with southward IMF. Figures 8d-Sf \nshow the associated ground magnetic deviations. \nAt 1600 UT and 1640 UT (Figure 8a and 8b), two of \nthe features mapped in the previous convection series in the \nnorthern hemisphere (Figures 7g-7i) are still evident: the \nevening crescent cell and the morning round cell. The con- \ntinuity of these cells through 1640 UT (Figure 8b) suggests \nthat some element of the lobe convection continued to oc- \ncur much as it did prior to the southward turning of the \nIMF. However, the increase in magnetic deviations at 1640 \nUT, especially in the dawn and midnight sectors, attest to \nincreasing electrojet activity in those regions. The activity \ncontinued to expand equatorward (Figure 8]) through 1720 \nUT as the magnitude of Bz grew. The dawn region perturba- \ntions at 1640 UT and 1720 UT suggest very strong currents, \nbut as indicated in the 1720 UT plot (Figure 8c), the \ncompaztying electric fields were weak in the vicinity of the \nsatellite track. This is consistent with increasing conductiv- \nity and currents associated with substorm particle injection. \nIncreasing particle precipitation is suggested by the rise in \nthe logarithmic hemispheric power index which occurred as \nthe B= component became increasingly negative. The two- \ncell convection pattern in Figure 8c is representative of the \nconvection configuration and strength mapped for the sub- \nsequent 17 hours of southward IMF. \n6. SUMMARY \n6.1. General Comments \nThe passage of a interplanetary magnetic cloud, char- \nß cterized by strong, slowly varying IMF conditions, has al- \nlowed us to investigate the configuration and strength of \nconvection under B, northward conditions. We have sup- \nplemented data sets from the GISMOS campaign of 3an- \nusry 14-15, 1988, with DMSP IDM data, digisonde data, \nand radar and ground magnetometer observations from both \nhemispheres to produce one of the most comprehensive data \nsets yet assembled for the study of the convection response to \nsolar wind variations. Based on this data set, we have shown \nthat the polar cap convection was far from conjugate during \nmost of the interval of northward IMF. The data set has also \nallowed us to follow the development and decay of convection \npatterns and portray the ionospheric convection patterns as- \nsociated with the evolution to and from reverse convection \nin the southern hemisphere. We also demonstrate that this \nevolution took place while the northern hemisphere convec- \ntion remained in a normal-to-quiet state. Some of the vari- \n19,288 KNIPP t•T AL.: IONOSPHERIC CONVECTION RESPONSE \nKNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE 19,289 \nations presented here are reflected in the models presented \nby Poretara et al. [1984], Frill-Christensen et al. [1985], \nand Heppner and Maynard [1987] and we have discussed \nthem accordingly. We do not dismiss any of these patterns. \nRather, we have attempted to attach physical significance \nto the differences in these results, especially to the extreme \ndistortion in the Heppner-Maynard patterns. \nAs mentioned in the introduction, Freeman et al. [1993] \nand Farru•ia et al. [1993a, b] have discussed the convection \nduring this interval in terms of the magnetic cloud features. \nWe have interpreted the convection patterns associated with \nthe magnetic cloud within the general framework of a merg- \ning model. Crooker [1992] has recently updated this model \nto include the phenomenon of overdraping for northward \nIMF. During a significant portion of January 14, 1988, we \nbelieve the overdraped model provides the best interpreta- \ntion for most of the interhemispherical asymmetries we de- \npict. The northward IMF patterns show strong interhemi- \nspheric asymmetry, consistent with the predicted existence \nof lobe cell(s) in the summer, Bx-favored hemisphere only, \ncombined with weak merging cells in both hemispheres. The \nAMIE procedure applied to this interval provides a semi- \nquantitative determination of the flux circulating in the pre- \ndicted lobe cells compared to that in merging cells. The \nderived patterns also indicate that while reverse convection \ncells circulated in a small area confined to the dayside of \nthe polar cap, presumably mapping in part to lobe fields \nthat drape over the dayside of the magnetopause, a sizeable \nportion of the nightside polar cap existed in a near-dormant \ncondition. \nDuring the prolonged period of northward IMF, signifi- \ncant variations were introduced by the By component and \nthe relative magnitudes of the By and B• components. Our \nresults suggest hat at solstice the ratio of IMF I By I\/Bz \n= 1 marks the dividing point between reverse and normal \nconvection, implying that normal convection in the south- \nern hemisphere exists three quarters of the time and not half \nof the time as it would if the dividing point were B.. = 0. \nThus it appears that a unitary value of the I By\/Bz I ra- \ntio is critical in separating reverse convection from normal \nconvection. \n6.2. Specific Findings \nBetween 0300 UT and 0500 UT when the By component \nwas large relative to the B.. component (I By\/B• I> 1), the \nsouthern hemisphere xperienced strong (nearly single cell) \nlobe convection, which resulted in a 30-kV excess in poten- \ntial compared to the northern hemisphere. Although the \nnorthern hemisphere was apparently not involved in lobe \nmerging, the convection in that hemisphere was not in a \nground state. Normal merging convection provided simul- \ntaneous cross-polar-cap potential drops of ~50 kV in both \nhemispheres. \nWhile the Bx and B• components were positive and the \nBy component was small, the effects of overdraping are most \nevident. The southern polar cap, which was tilted toward \nthe Sun, experienced strong, organized convection, while the \noppositely tilted pole experienced significantly less ordered \nion flow and reduced convection strength. As Bz increased \nand By decreased in magnitude, an additional lobe cell de- \nveloped in the southern hemisphere. The growth of this \ncell ultimately produced strong reverse (double cell) convec- \ntion with a dusk-to-dawn potential drop of • 120 kV. This \nconvection was confined to magnetic latitudes greater than \n75 ø. At the same time the northern hemisphere convection \nachieved its most relaxed state with a cross-polar-cap po- \ntential drop of 25 kV. \nWhile the Bz component remained positive but the By \ncomponent magnitude grew, some indication of increased \nmerging cell activity became evident in both hemispheres. \nAs the ratio, I By\/B• I, again exceeded unity, a rapid and \nvery dramatic restructuring of the convection configuration \noccurred. Within an hour the southern hemisphere convec- \ntion changed from a reverse configuration to a more normal \nconfiguration encompassing the previously dormant night- \nside of the polar cap. A similar reconfiguration was evi- \ndent in the northern hemisphere. A substantial cross-polar- \ncap potential drop (80-100 kV) arose from convection that \nwas driven by a strong IMF By component. The convec- \ntion strength was similar in each hemisphere but was not \nsymmetric. \nThe transition to Bz southward did not produce an im- \nmediate sharp change to normal two-cell convection. Rather \na slow transition with development of an enhanced dawn cell \nin the northern hemisphere occurred. \nWe have demonstrated many of the strengths and appli- \ncations of the AMIE procedure. The procedure has proved \nto be a useful tool in analyzing convection response to both \nslow and moderately paced variations in the IMF. A future \npaper provides more in-depth documentation of a response \nto rapid solar wind variations. \nAcknowledgments. No analysis of this magnitude can be un- \ndertaken without the generous cooperation of all data providers. \nIncoherent scatter radar data for Sondrestrom (Sondre Strom- \n•ord), Millstone Hill, and EISCAT were provided by the \nCEDAR (Coupling, Energetics and Dyn•nics of Atmospheric \nRegions) data base located at the National Center for Atmo- \nspheric Research (NCAR). Sondrestromincoherent scatter radar \nand the Millstone Hill radar are supported by the National Sci- \nence Foundation (NSF) contractual agreement ATM 8822560; \nthe CEDAR data base and NCAR are also supported by NSF. \nThe EISCAT Scientific Association is supported by Centre \ntional de la Recherche Sclentifique of France, Suomen Akateiia \nof Finland, Max-Planck-Gesellsch&ft of Germany, Norges A1- \nmenvitenskapelige Forskningsrad ofNOrway, Naturvetenskapliga \nForskningsradet of Sweden, and the Science and Engineering Re- \nsearch Council of the United Kingdom. The Johns Hopkins Uni- \nversity\/Applied Physics Laboratory HF radar located at Goose \nBay Labrador is supported in part by the NSF Division of At- \nmospheric Sciences under NSF grant ATM-9003860 and in part \nby the National Aeronautics and Space Administration (NASA) \nunder NASA grant NAG5-1099. Defense Meteorological Satel- \nlite Prograrn (DMSP) ion drift meter data were processed by \nthe University of Texas at Dallas Space Sciences Center Under \nAir Force Phillips Laboratory, Geophysics Directorate contract \nF19628-90-K-0002. We wish to th•k R. A. Heelis for his as- \nsistance in interpreting these data. T. Wilson of the National \nGeophysical Data Center in Boulder, Colorado, was instruxnen- \ntal in providing us with initial electron precipitation measure- \nmerits from the DMSP satellite. The Qanaq digisonde is op- \nerated with support from the Danish Meteorological Institute \nand by permission from the Commission for Scientific Research \nin Greenland. One hundred and two ground magnetic obser- \nvatories contributed to this study. Fifty-six of these were pro- \ncessed through the World Data Center A in Boulder. We are \nindebted to L. Morris of that facility for selecting all the digital \ndata. R. Farmer of the Air Force Academy helped to digitize \nanalog data. We want to extend special th•r•ks to R. Schlich \nand J. Bitterly of the J. nstitut de Physique du Globe de Stras- \nbourg, Strasbourg, France, for submitting magnetometer data \nto the World Data Center for Martin de Vivies (AMS), Port \nAlfred (CZT), Port-aux-Francais (KGL), and Dumont d'Urville \n(DRV). The D.t index used in the analysis of the ground magne- \ntometer stations was provided by T. Karnei of the World Data \n19,290 KNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE \nCenter C2 at Kyoto University and by M. Sugiura of Tokai Uni- \nversity in Japan. The analysis for the southern hemisphere was \naided by access to ground magnetometer data provided by L. \nLanzerotti and A. WoLfe of AT&T Bell Laboratories, USA. T. \nRosenberg o.f the University of Maryland provided quick access \nto South Pole and McMurdo data. The assistance of Australian \nAntarctic Division staff and Australian National Antarctic Re- \nsearch Expedition (ANARE), Auroral and Space Physics expe- \nditioners is gratefully acknowledged. The following individuals \nprovided drafts and\/or preprints of articles related to this pub- \nlication: N. Crooker, G. Crowley, J. Cumnock, C. Farrugia, and \nM. Freeman. We have made extensive use of statistical mod- \nels provided by N. Maynard, T. Fuller-Rowell, D. Evans, and \nJ. Foster in this study. We would like to thax•k R. Lepping of \nNASA Goddard Space Flight Center for providing the IMP 8 \nmagnetic field data, A. Lazarus of the Massachusetts Institute \nof Technology for providing IMP 8 plasma data, R. Johnson of \nthe Space Physics Laboratory of the University of Michigan for \nhelp in obtaining the IMF data, and D. Sibeck of the Johns \nHopkins University\/Applied Physics Laboratory for help in ob- \ntaining the plasma data. N. Crooker was supported by NSF \ngrant ATM 91-17484. O. de la Beaujardiere was supported \nby NSF grant ATM 91-02439. G. Crowley w•s supported by \nthe Air Force Phillips Laboratory Geophysics Directorate under \ncontract F19628-90-K-0005 and the Air Force Office of Scientific \nResearch Task 2310G9. D. Knipp, B. Emery, and A. Richmond \nwere supported by NASA Work Order W-17384. D Knipp was \nalso supported by the F. J. Seller Research Laboratory at the \nAir Force Academy. \nThe Editor thanks J. L. Burch and another referee for their \nassistance in evaluating this paper. \nP•FERENCE$ \nAlto, B.-H., H. W. Kroehl, Y. Kamide, and D. J. Gorney, Esti- \nmation of ionospheric electrodynamic parameters using iono- \nspheric conductance deduced from bremsstrahlung X ray im- \nage data, J. Geophils. Res., 94, 2565, 1989. \nAkasofu, S.-I., B.-H. Ahn, Y. Kamide, and J. H. Allen, A note \non the accuracy of the auroral electrojets indices, J. Geophils. \nRes., 88, 5769, 1983. \nBaker, K. B., R. A. Greenwald, J. M. Ruohoniemi, J. R. Du- \ndehey, M. Pinnock, N. Mattin, and J. M. Leanard, PACE, Po. \nlax Anglo-American Conjugate Experiment (abstract), E© S \nTrans. A G U, 70, 785, 1989. \nBuchau, J., B. W. Reinisch, D. N. Anderson, E. J. Weber, and \nC. G. Dozois, Polar cap convection measurements and their \nrelevance to the real-time modelling of the high latitude iono- \nsphere, Radio Sci., •$, 521, 1988. \nBurch, J. L., P. H. Reiff, J. D. Menietti, R. A. Heelis, W. B. \nHanson, S. D. Shawhan, E.G. Shelley, M. Sugiura, D. R. \nWeimer, and J. D. Winningham, IMF By-dependent plasma \nflow and Birkeland currents in the dayside magnetosphere, 1, \nDynamics Explorer observations, J. Geophils. Res., 90, 1577, \n1985. \nBurke, W. J., M. C. Kelley, R. C. Sagalyn, M. Smiddy, and \nS. T. Lai, Polar cap electric field structures with a northward \ninterplanetary magnetic field, Geophils. Res. Left., 6, 1, 1979. \nBurke, W. J., The polar cap with northward IMF: What I think \nI know, in Philsics of Space Plasmas, SPI Conf. Proc., 8, \n153, 1989. \nBurke, W. J., E. M. Basinska, N. C. Maynard, W. B. Hanson, J \nA. Slavin, and J. D. Winningham, Polar cap potential distri- \nbutions during periods of positive IMF By and B., J. Atmos. \nTerr. Phils., in press, 1993. \nBurlaga, L. F., R. P. Lepping, and J. A. Jones, Global configura- \ntion of a magnetic cloud, in Philsics of Magnetic Flux Ropes, \nGeophils. Monogr. Set., vol. 58, edited by C. T. Russell, E. \nR. Priest, and L. C. Lee, p. 373, AGU, Washington, D.C., \n1990. \nBythrow, P. F., W. J. Burke, T. A. Potemra, L. J. Zanetti, and \nA. T. U. Lui, Ionospheric evidence for irregular reconnection \n•nd turbulent plasma flows in the magnetotail during periods \nof northward interplanetary magnetic field, J. Geophils. Res., \n90, 5319, 1985. \nCannon, P.S., B. W. Reinisch, J. Buchau, and T. W. Bul- \nlett, Response of the polar cap region convection direction to \nchanges in the interplanetary magnetic field: Digisonde mea- \nsurements in northern Greenland, J. Geophils. Res., 96, 1239, \n1991. \nCarlson, H. C., R. A. Heelis, E. 3. Weber, and J. R. Sharber, \nCoherent mesoscale convection patterns during northeast in- \nterplanetary magnetic field, J. Geophils. Res., 93, 14,501, \n1988. \nColey, W. R., R. A. Heelis, and W. B. Hanson, Ionospheric con- \nvection signatures and magnetic field topology, J. Geophils. \nRes., 9•, 12,352, 1987. \nCowley, S. W., Asymmetry effects associated with the X- \ncomponent of the IMF in a magnetically open magnetosphere, \nPlanet Space Sci., •9, 809, 1981. \nCrooker, N. U., Dayside merging and cusp geometry, J. Geo- \nphils. Res., 8•(, 951, 1979. \nCrooker, N. U., Mapping the merging potential from the magne- \ntopause to the ionosphere through the dayside cusp, J. \nphils. Res., 93, 7338, 1988. \nCrooker, N. U., Reverse convection, J. Geophils. Res., 97, \n19,363, 1992. \nCrowley, G., C. G. Dozois, B. W. Reinisch, and J. Buchau, \nPolar cap convection for B. northward, Geophils. Res. Left., \n19, 657, 1992. \nCurehOck, J. A., R. A. Heelis, and M. R. Hairston, The response \nof the ionospheric convection pattern to a rotation of the IMF \non January 14, 1988, J. Geophils. Res., 97, 19,449, 1992. \nDungey, 3. W., Interplanetary magnetic field and the auroral \nzones, Phils. Rev. Left., 6, 47, 1961. \nDungey, J. W., The structure of the ionosphere, or adventures \nin velocity space, in Geophilsics: The Earth's Environment, \nedited by C. DeWitt, J. Hiebolt, and A. Lebeau, pp. 526-536, \nGordon and Breach, New York, 1963. \nEmery, B. A., et aL, Electric potential patterns deduced for the \nSUNDIAL period of September 23-26, 1986, Ann. \n8, 399, 1990. \nFarrugia, C. J., L. F. Burlaga, M.P. Freeman, V. Osheravich, I. \nG. Richardson, R. P. Lepping, and A. Lazarus, A study of an \nexpanding interplanetary magnetic cloud and its interaction \nwith the Earth's magnetosphere: The interplanetary aspect, \nJ. Geophils. Res., 98, 7621, 1993a. \nFarrugia, C. J., M.P. Freeman, L. F. Burlaga, R. P. Lepping, \n•nd K. Takahashi, The Earth's magnetosphere under contin- \nued forcing: Substorm activity during the passage of an inter- \nplanetary magnetic cloud, J. Geophils. Res., 98, 7657, 1993b. \nFoster, J. C., J. M. Holt, R. G. Musgrove, and D. S. Evans, Iono- \nspheric convection associated with discrete levels of particle \nprecipitation, Geophils. Res. Left., 13, 656, 1986. \nFreeman, M.P., C. J. Farrugia, L. F. Burlaga, R. P. Lepping, \nM. E. Greenspan, and J. M. Ruohoniemi, The interaction of \nmagnetic cloud with the Earth: Ionospheric convection in the \nnorthern and southern hemispheres for a wide range of quasi- \nsteady interplanetary magnetic field conditions, J. Geophils. \nRes., 98, 7633, 1993. \nFriis-Christensen, E., Y. Kamide, A.D. Richmond, and S. Mat- \nsushita, Interplanetary magnetic field control of high-latitude \nelectric fields and currents determined from Greenland mag- \nnetometer data, J. Geophils. Res., 90, 1325, 1985. \nFuller-Rowell, T. J., and D. S. Evans, Height-integrated Peder- \nsen and Hall conductivity patterns inferred from the TIROS- \nNOAA satellite data, J. Geophils. Res., 9•, 7606, 1987. \nGreenwald, R. A., K. B. Baker, R. A. Hutchins, and C. Hanuise, \nAn HF phased array radar for studying small scale structure \nin the high-latitude ionosphere, Radio Sci., •0, 63, 1985. \nHeelis, R. A., and M. R. Hairston, Studies of ionospheric dy- \nnamics utilizing data from DMSP, AFSC-GL- TR-90-00• 7 (I), \n1990. \nHeelis, R. A., and W. B. Hanson, High-latitude ion convection \nin the nighttime F region, J. Geophils. Res., 85, 1995, 1980. \nHeelis, R. A., P. H. Reiff, J. D. Winningham, and W. B. Hanson, \nIonospheric convection signatures observed by DE 2 during \nnorthward interplanetary magnetic field, J. Geophils. Res., \n91, 5817, 1986. \nHeppner, J.P., and N. C. Maynard, Empirical high-latitude \nelectric field models, J. Geophils. Res., 9•, 4467, 1987. \nHill, T. W., Theoretical models of polar-cap convection under \nKNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE 19,291 \nthe influence of northward interplanetary magnetic field, J. \nAtmos. Terr. Phys., in press, 1993. \nHoffman, R. A., M. $ugiura, N. C. Maynard, R. M. Candey, J. \nD. Craven, and L. A. Frank, Electrodynamic patterns in the \npolar region during periods of extreme magnetic quiescence, \nJ. Geophys. Res., 93, 14,515, 1988. \nlijlma, T., and T. Shibaji, Global characteristics of north- \nward IMF;associated (NBZ) field-aligned currents, J. Geo- \nphys. Res., 9•, 2408, 1987. \nIsraelevich, P. L., I. M. Podgorny, A. K. Kuzmin, N. S. Niko- \nlaeva, and E. M. Dubinin, Convection and field-aligned cur- \nrents, related to polar cap arcs, during strongly northward \nIMF (11, January 1983), Planet. Space Sci., 36, 1317, 1988. \nJankowsk•, K., R. D. Elphinstone, J. S. Murphree, L. L. Cogget, \nD. Hearn, and G. Marklurid, The configuration of the auroral \ndistribution for interplanetary magnetic field B= northward, 2, \nIonospheric convection consistent with Viking observations, J. \nGeophys. Res., 95, 5805, 1990. \nKamide, Y., and S.-I. Akasofu, Notes on the auroral electrojet \nindices, Rev. Geophys. Space Phys., •I, !647, 1983. \nKamide, Y., and W. Baumjohann, Estimation of electric fields \nand currents from intern&tional magnetospheric study magne- \ntogram data for the CDAW 6 interval: ImPlications for sub- \nstorm dynamics, J. Geophys. Res., 90, 1305, 1985. \nKarnide, Y., A.D. Richmond, an.d S. Matsushita, Estimation \nof ionospheric electric fields, ionospheric currents and field- \naligned currents from ground magnetic records, J. \nRes., 86, 801, 1981. \nKamide, Y., J. D. Craven, L. A. Frank, B.-H. Aim, and S.-I. Aka- \nsofu, Modeling substorm current systems using conductivity \ndistributions inferred from DE auroral images, J. \nRes., 9I, 11,235, 1986. \nKnipp, D. J., A.D. Richmond, G. Crowley, O. de la Beau- \njardiere, E. Friis-Christensen, D. S. Evans, J. C. Foster, I. W. \nMcCrea, F. J. Rich, and J. A. Waldock, Electrodynamics pat- \nterns for September 19, 1984, J. Geoph!•s. Res., 94, 16,913, \n1989. \nKnipp, D. J., A.D. Richmond, B. Emery, N. U. Crooker, O. de \nla Beaujardiere, D. S. Evans, and H. Kroehl, Ionospheric con- \nvection response to changing IMF direction, Geophys. Res. \nLeft., 18, 721, 1991. \nKnipp, D. J., B. A. Emery, A.D. Richmond, and M. R. H•irston, \nMapping ionospheric convection response to IMF By negative \nand B= positive conditions, J. Atmos. Terr. Phys., in press, \n1993. \nLulxmann, J. G., R. J. W•ker, C. T. Russell, N. U. Crooker, \nR. Spreiter, and S.S. Stahara, patterns of potential magnetic \nfield merging sites on the dayside magnetopause, J. Geophys. \nRes., 89, 1739, 1984. \nMaezawa, K., Magnetospheric convection induced by the pos- \nitive and negative Z components of the interplanetary mag- \nnetic field: Quantitative analysis using polar cap magnetic \nrecords, J. Geophys. Res., 8I, 2289, 1976. \nMansurov, S. V., New evidence of a relationship between mag- \nnetic field in space and earth, Geomagn. Aeron., 4, 622, 1969. \nMarklund, G. T., and L. G. Blornberg, On the influence of local- \nized electric fields and field-aligned currents associated with \npolar arcs on the global potential distribution, J. \nRes., 96, 13,977, 1991. \nMarklund, G. T., L. G. Biotaberg, T. A. Poremrs, J. S. Mur- \nphree, F. J. Rich, and K. Stasiewicz, A new method to de- \nrive \"instantaneous\" high latitude potential distributions from \nSatellite measurements including auroral imager data, Geo- \nphys. Res. œett., 14, 439, 1987. \nMarklund, G. T., L. G. Biotaberg, J. S. Murphree, R. D. Elphin- \nstone, L. J. Zanetti, R. E. Erlandson, I. Sands.hi, O. De La \nBeaujardiere, O. Opgenoorth, and F. J. Rich, On the electro- \ndynamical state of the auroral ionosphere during northward \ninterplanetary magnetic field: A transpolar arc case study, J. \nGeophys. Res., 96, 9567, 1991. \nMcCormac, F. G., T. L. Killeen, and J.P. Thayer, The influ- \nence of IMF By on the high-latitude thermospheric irculation \nduring northward!MF, J. Geophys. Res., 96, 115, 1991. \nMcPherron, R. L., Physical processes producing magnetospheric \nsubstorms and magnetic storms, in Geomagnetisrn, vol. 4, \nedited by J. A. Jacobs, pp. 592-739, Academic, San Diego, \nCalif., 1991. \nMishin, V. M., The magnetogrz•n inversion technique and some \napplications, Space Sci. Rev., 53, 83, 1990. \nMishin, V. M., The magnetogr&m inversion technique: Applica. \ntions to the problem of magnetospheric substorms, Space Sci. \nRev., 54, 237, 1991. \nMishin, V. M., A.D. Bazarzhapov, and G. B. Shyhey, Electric \nfields and currents in the earth's magnetosphere, in Dynamics \nof the Magnetosphere, edited by S.-I. Akasofu, pp. 249, D. \nReidel, Norwell, Mass., 1979. \nMitchell, D. G., F. Kutchko, D. J. Williaxns, T. Eastman, L. \nA. Frank, and C. T. Russell, An extended study of the low- \nlatitude boundary layer on the dawn and dusk flanks of the \nmagnetopause, J. Geophys. Res., 9•, 7394, 1987. \nMozer, F. S., Electric field evidence on the viscous interaction \nat the magnetopause, Geophys. Res. œett., II, 135, 1984. \nPoremrs, T. A., L. J. Zanetti, P. F. Bythrow, and A. T. Y. \nLui, By-dependent convection patterns during northward in- \nterplanetary magnetic field, J. Geophys. Res., 89, 9753, 1984. \nReiff, P. H., Sunward convectionin both polar caps, J. Geophys. \nRes., 87, 5976, 1982. \nReiff, P. H., and J. L. Burch, IMF By-dependent plasma flow \nand Birkeland currents in the dayside magnetosphere, 2, A \nglobal model for northward and southward IMF, J. \nRes., 90, 1595, 1985. \nReiff, P. H., and J. G. Lub. m•, Solar wind control of polar \ncap voltages, Solar Wind-Magnetosphere Coupling, editedby \nY. Kamide and J. A. Slavin, pp. 453-476, Terra Scientific, \nTokyo, 1986. \nReinisch, B. W., New techniques in ground based ionospheric \nsounding and studies, Radio Sci., 1•I, 331, 1986. \nReinisch, B. W., K. Bibl, D. Kitrosser, G. Sales, J.zhang, T. \nBullet, and J. Rolls, The digisonde S56 sounder, WITS Hand- \nbook, vol. 2, edited by C. H. Liu, pp. 350-360, University of \nIllinois, Urbana, 1989. \nRich, F. J., and M. S. Gussehoven, The absence of region 1\/re- \ngion 2 field aligned currents during prolonged quiet periods, \nGeophys. Res. Left, I4, 689, 1987. \nRichmond, A.D., Assimilative mapping of ionospheric electro- \ndynamics, Adv. Space Res., 6, (6)59, 1992. \nRichmond, A.D., and Y. Kamide, Mapping electrodynamic fea- \ntures of the high-latitude ionosphere from localized observa- \ntions: Technique, J. Geophys. RES., 93, 5741, 1988. \nRichmond, A.D., et al., Mapping electrodyn•nic features of the \nhigh-latitUde ionosphere from localized observations: Com- \nbined incoherent scatter radar and localized observations: \nMeasurements for January 18-19, 1984, J. Geophys. Res., \n93, 5760, 1988. \nRichmond, A.D., et al., Global measures of ionospheric electro- \ndynamic activity inferred from combined incoherent-scatter \nr•dar and ground magnetometer observations, J. Geophys. \nRes., 95, 1061,1990. \nRuohoniemi, J. M., R. A. Greenwald, K. B. Baker, J.-?. Villian, \nC. Hmxiuse, and J. Kelly, Mapping high-latitude plasma con- \nvection with coherent HF radars, J. Geophy Res., 94, 13,463, \n1989. \nRussell, C. T., The configuration f the magnetosphere, in Cri t- \nicai Problems of Magnetospheric Physics, edited by E. R. \nDyer, Jr., pp. 1-16, National Academy of Sciences, Wash- \nington, D.C., 1972. \nSiscoe, G. L., The magnetosphere: A union of inter-dependent \nparts (abstract), EOS Trans. AGU., 7•, (17), Spring Meeting \nsuppl., 235, 1991. \nSvalgaard, L., Sector structure of the interplanetary magnetic \nfield and d•ily variations of geomagnetic field at high lati- \ntudes, Geophys. Pap. R-6, Dan. Meteorol. Inst., Copen- \nhagen, 1968. \nTroshichev, 0. A., Global dynamics of the magnetosphere for \nnorthward IMF conditions, J. Atmos. Terr. Ph!•s., 5•, 1135, \n1990. \nZanetti, L. J., T. A. Poremrs, J.P. Doering, J. S. Lee, J. F. Fen- \nnell, and R. A. Hoffman, Interplanetary magnetic field control \nof high-latitude activity on July 29, 1977, J. Geophys. Res., \n87, 5963, 1982. \nZhu, L., and J. R. Kan, Relationship between four-cell and dis- \ntorted two-cell convection patterns during northward IMF, \nGeophys. Res. Left., 17, 2325, 1990. \n19,292 KNIPP ET AL.: IONOSPHERIC CONVECTION RESPONSE \nB.-H. All, Kyungpook National University, Taegu, Korea. \nG. B. Burns and R. J. Morris, Australian Antarctic Division, \nI•ngston, Tasmania, Austra•a. \nN. U. Crooker, Atmospheric Science Department, UCLA, Los \nAngeles, CA 90032, \nG. Crowley, The $ohns Hopkins University Applied Physics \nLaboratory, Laurel, MD 20723. \nJ. A. Cumnock and M. R. Hairston, University of Texas at \nDallas, Richardson, TX 75080. \nO. de la Beaujardiere, SRI International, Menlo Park, CA \n37877. \nW. F. Denig and F. J. Rich, Phillips Laboratory, Hanscom \nAFB, MA 01730. \nB. A. Emery and A.D. Richmond, High Altitude Observatory, \nNCAR, Boulder, CO 80307-3000. \nD. S. Evans and T. $. b%lller-Rowell, Space Environment Lab- \noratory, NOAA, Boulder, CO 80303. \nE. Friis-Christensen, Danish Meteorological Institute, Copen- \nhagen, Denmark. \nD. $. Knipp, Department of Physics, U.S. Air Force Academy, \nCO 80840. \nH. W. Kroehl, National Geophysical Data Center, Boulder, \nCO 80303. \nM. Lockwood, Rutherford-Appleton Laboratory, Chilton, \nDidcot, Oxon, England. \nC. G. Maclerman, AT&T Bell Laboratories, Murray Hill, NJ \n07974. \nA. McEwin, Bureau of Mineral Resources, Canberra, Aus- \ntralia. \nV. Papitashvili and A. Zaitzev, IZMIRAN, Troitsk, Moscow \nRegion, Russia. \nR. J. Pellinen, Finnish Meteorological Institute, Helsinki, Fin- \nland. \nA. S. Rodger, British Antarctic Survey, Cambridge, England. \nJ. M. Ruohoniemi, The Johns Hopkins University Applied \nPhysics Laboratory, Laurel, MD 20723. \nN. Sato, National Institute of Polar Research, Tokyo, Japan. \nP. Sutcliffe, Hermanus Magnetic Observatory, Hermanus, \nSouth Africa. \nL. Tomlinson, Institute of Geolo\/•ical and Nuclear Sciences \nLtd., Chrlstchurch, New Zealand. \nO. Troshichev, Arctic and Antarctic Research Institute, St. \nPetersburg, Russia. \n(Received September 24, 1992; \nrevised March 5, 1993; \naccepted April 8, 1993.) \n"}