{"doi":"10.3366\/para.2007.30.3.121","coreId":"65902","oai":"oai:dro.dur.ac.uk.OAI2:4202","identifiers":["oai:dro.dur.ac.uk.OAI2:4202","10.3366\/para.2007.30.3.121"],"title":"A green Blanchot ? impossible.","authors":["Clark, T. J. A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-11-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65902.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4202\/1\/4202.pdf","pdfHashValue":"ee8bf8c9112042bd9f25dace36d4389e2918c682","publisher":"Edinburgh University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4202<\/identifier><datestamp>\n      2011-09-02T11:23:03Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A green Blanchot ? impossible.<\/dc:title><dc:creator>\n        Clark, T. J. A.<\/dc:creator><dc:publisher>\n        Edinburgh University Press<\/dc:publisher><dc:source>\n        Paragraph, 2007, Vol.30(3), pp.121-140 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4202<\/dc:identifier><dc:identifier>\n        issn:0264-8334<\/dc:identifier><dc:identifier>\n        issn: 1750-0176<\/dc:identifier><dc:identifier>\n        doi:10.3366\/para.2007.30.3.121<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4202\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.3366\/para.2007.30.3.121<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4202\/1\/4202.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1750-0176","0264-8334","issn: 1750-0176","issn:0264-8334"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n26 January 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nClark, T. J. A. (2007) ’A green Blanchot ? Impossible.’, Paragraph., 30 (3). pp. 121-140.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.3366\/para.2007.30.3.121\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n26 January 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nPublished version \n \nCitation for published item: \nClark, T. J. A. (2007) 'A green Blanchot ? Impossible.', Paragraph., 30 (3). pp. 121-140. \n \nFurther information on publishers website: \nhttp:\/\/dx.doi.org\/10.3366\/para.2007.30.3.121 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 121\nA Green Blanchot: Impossible?\nTIMOTHY CLARK\nAbstract:\nBlanchot’s work may at first seem remote from any sort of environmentalist\nthinking. While elements of his work share with Levinas and Heidegger a\nproblematic privileging of the human, Blanchot nevertheless offers the basis\nof what might be seen as a timely ‘deeper ecological’ thinking, one that can\nengage the destructive anthropocentrism of Western thought and tradition\nin the very minutiae of its literary and philosophical texts. Unlike in much\n‘green’ philosophy, no concept of nature or earth serves as foundation for\nBlanchot’s thought. He is engaged by the ‘impossible’ as that which is not\na matter of human power or decision, affirmed in both its ethical force and\nits contestation of dominant and appropriative conceptions of knowledge,\nrationality and invention. A comparison is offered between Max Oelschlager’s\nrepresentative ecocritical essay ‘Earth-Talk: Conservation and Ecology’, with\nits romantic attempt to find and celebrate modes of unalienated or ‘natural’\nlanguage, and Blanchot’s practice of what can be seen as a more radical and\nquestioning ‘ecology’ based on almost opposite conceptions.\nKeywords:Blanchot, nature, impossible, deep ecology, physis, animal, anthro-\npocentrism, ethics, environmentalism\nBlanchot’s work belongs with that of Martin Heidegger and Friedrich\nNietzsche in locating the sources of many of the crises facing Western\nhumanity, and now humanity in general, in deep ontological presup-\npositions, pervasive habits of thinking that are inherently aggressive or\nrapacious. Yet unlike Nietzsche and Heidegger, both of whom thema-\ntize the ‘earth’ in ways that have inspired environmentalist thinkers,\nBlanchot’s work seems at first remote from anything recognisably like\ngreen issues.\nPartly, no doubt, out of a reaction against pseudo-agrarian elements\nin Heidegger’s work, Blanchot’s writing, with its overwhelmingly\nurban climate, affirms a kind of anti-essentialist nomadism, refusing all\nforms of nostalgia and insidious notions of ‘rootedness’. This cannot\nbut set Blanchot challengingly against much that might seem attractive\nyet finally unacceptable in much environmentalist thought with terms\nlike ‘nature’ and ‘the earth’. That granted, it is very striking how,\ncompared to almost any page of Heidegger or Nietzsche, Blanchot’s\nParagraph 30:3 (2007) 121–140\n122 Paragraph\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 122\nwriting is almost totally void of references to or images from the\nnatural world. One might even imagine, reading Blanchot’s oeuvre,\nthat humanity and its artifacts were in sole possession of the Earth. His\nconsiderable body of work on Rilke barely takes up the issue of that\npoet’s attention to the mode of being of animals, even when that is\nthe explicit topic of a poem being cited (‘Duino Elegy, 8’).1 To work\nthrough one end of The Writing of the Disaster (1980) to the other\nlooking for any reference to non-human life is to find nothing, bar\none anti-natural figure (‘A rose blossoming into a bud’). After a striking\npassage at the end of Thomas the Obscure does any bird ever fly across\na page of Blanchot?2\nThis essay tries to address the seeming absence in Blanchot of\nwhat is increasingly seen as an epochal issue— the crisis in human\nself-conceptions being wrought by the intensifying degradation of the\nplanet itself. How far can Blanchot’s thinking, his famous refusal of\nthe present, encompass this issue?\nGlobal Responsibility\nOne evident connection between environmentalist thinkers and Blan-\nchot’s work lies in the attention both give to the unprecedented nature\nof the contemporary world as one in which humanity, become truly\nglobal, enters an era of risk and self-questioning. Blanchot’s medi-\ntations often show a planetary awareness, one that we would now\nassociate with ‘globalization’, but which Blanchot described in relation\nto claims about the ‘end of history’ or, as below, to the thought of\nTeilhard de Chardin. He writes:\nwe have entered the final and critical stage in which economic, technical, ethical,\nscientific, artistic, and spiritual expansion carries humanity ‘to the heart of an\nalways accelerated vortex of totalization upon itself’ [de Chardin].3\nSuch a sense of the world as a whole is now so commonplace that its\ndistinctiveness is easily forgotten (so that we think nothing of passing\nin the course of a single conversation from African politics to Japanese\ntechnology to Irish music):\nThe words world civilization, universal domination, planetization, collective cerebral-\nization are expressed or inferred in everything that we say and think. Each\nperson sees himself as master of the entire earth and of all that has existed on\nearth. (F, 73)\nA Green Blanchot: Impossible? 123\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 123\nThis global consciousness, while conducive to fantasies of human\nmastery, is also an existential dilemma. Blanchot is very much a thinker\nof the paradoxy and crises of thought induced by the need to\nthink human existence as a whole (ultimately in its finitude and\npowerlessness), as opposed to analytic tasks of ‘understanding’ directed\ntowards specific issues with a view to enhancing a sense of human\npower over things. The global ecological crisis could be called precisely\n‘Blanchotian’ in its demand that we think increasingly, not in terms\nof regional projects of management or conservation within received\nframeworks of thought, but anew about the totality of human life. As\nin Blanchot’s essay on the atomic bomb (F, 101–8), the issue becomes\nto rethink ‘humanity’ as a question, a ‘who?’\nBlanchot’s work overall offers a striking account of the kinds of\nconceptual and psychic forces that currently structure the minutiae\nof human thought and relations. His work as a critic attends in\nminute detail to how even seemingly common-sensical practices of\nreading, interpretation, and assumptions about knowledge as inher-\nently synthetic, conceptual and systematizing etc., all link to global\nsystems of political\/social violence. Blanchot writes:\nEven comprehension (. . .) is a grasp that gathers the diverse into unity, identifies\nthe different, and brings the other back to the same through a reduction\nthat dialectical movement, after a long trajectory, makes coincide with an\novercoming. All these words—grasp, identification, reduction—conceal within\nthemselves the rendering of accounts that exists in knowledge as its measure:\nreason must be given. What is to be known— the unknown—must surrender\nto the known.4\nInsofar as these issues play themselves out in relation to the minutest\nattention to issues of reading and language in numerous texts, Blan-\nchot’s work as a critic could be said to practise a kind of micro-ecology\n(‘think globally, act locally’).\nThe issue of wrongs done to other living creatures and of the fini-\ntude of the earth itself remains mostly latent here. Nevertheless, the\nseeming opacity and resistance of Blanchot’s work to ‘environmen-\ntalist’ issues may, paradoxically, form a challenge full of intellectual\npromise. Ultimately, Blanchot’s work may adumbrate a thinking that\nmeets one of the most urgent demands of post-enlightenment thought,\nthat is, resources towards a re-enchantment of the natural world that\nwould not at the same time be a kind of mystification, evasion or\ndeception.\n124 Paragraph\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 124\nBlanchot’s Neo-anthropocentrism (1)\nThe seemingly minor status of the natural world as an issue in Blanchot\nmay lie partly in what might be nicknamed his neo-anthropocentrism,\na term that is meant more descriptively than pejoratively. This is his\nversion of the argument, derived from Heidegger and re-inflected by\nEmmanuel Levinas, on the uniqueness of the human compared to the\nrest of nature.\nBlanchot’s attention is to the uniqueness of the immediate human\nenvironment— the realm of the sign and image, the mediation of\nthe space of language—considered not in terms of the positivity of\n‘culture’ but as a kind of rupture in being, without nostalgia for some\nsupposed lost relation to ‘nature’. He moves outside those concepts\nof ‘nature’ and ‘culture’ whose pas de deux has long dominated\nenvironmentalist and much other discourse in the West (those about\n‘art’ and the ‘animal’ for instance). A striking essay in this respect is\n‘The Birth of Art’ (F, 1–11) on prehistoric cave painting and the\nemergence of modern human beings. Blanchot’s fascination with pre-\nhistory (involving the uncanny fact that other species of human being\nhave existed and disappeared) correlates with what Stuart Kendall\nwrites of Georges Bataille in this context: ‘Prehistory is universal\nhistory par excellence because it is not merely the history of the West;\nit is global in its sweep and implications.’5\nBlanchot describes a double movement of distinction between the\nmodern human and the animal. First is the emergence of technology\nalong with some sort of social structure and the prohibitions and\ntaboos that accompany it:\npre-man fortuitously does violence to the natural givens, stands erect, rises up\nagainst himself, (. . .) becomes an animal raised by himself, works, and becomes\nthus something not natural, as far from what is natural as are the prohibitions that\nlimit what he is in order to benefit what he can be. (F, 6)\nThis last point recalls numerous thinkers in defining the animal\/human\ndistinction in terms of the emergence of ‘culture’ through determinants\nto behaviour based on taboos. Human social organization involves the\ndeferral and repression of the immediate individual impulse in view of\nthe greater benefits of cooperative work and power over wild nature.\nThis initial ‘separation between man and animal’ (F, 6), however,\ndoes not suffice to make early humans into truly fellow creatures of\nours. The modern human being is no animal rationale. A second step is\ncalled for. What is uniquely (modern) human according to Blanchot,\nA Green Blanchot: Impossible? 125\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 125\nfollowing Bataille, is not only the power to create ritual, laws, and\nprohibitions and tools, but symbolically to transgress or destroy them.\nIt is that freedom to negate, the power of beginning again, to abolish\nthe real into the empty space of images and signs. For Blanchot, the\nemergence of modern humanity is indissociable here from that of\nlanguage and ‘art’ (in the broadest sense of the creation of images and\nnon-utilitarian designs). Here:\nthe gap between man and his origin is put into question once again and in\nsome sense recovered, explored, and experienced: a prodigious contact with all\nof anterior reality (and first with animal reality) and thus a return to the first\nimmensity, but a return that is always more than a return, for he who returns,\nalthough his movement gives him the illusion of abolishing millions of years of\nbondage, of submission, and weakness, also becomes tumultuously conscious of\nthis impossible return, becomes conscious of the limits and the unique force that\nallows him to break these limits, does not simply lose himself in the dream of total\nexistence but instead affirms himself as that which is added to this existence and\n(. . .) can appropriate it symbolically or communicate with it by making it be. (F, 6)\nThe essay on the caves of Lascaux affirms that art and modern\nhumanity are coeval, born in a common double break from the\nnatural world. Blanchot concludes: ‘Art would thus provide us with\nour only authentic date of birth’ (F, 7).\nBlanchot also repeats the claim— still in dispute6 — that Nean-\nderthals had no art and that this corresponded to their radical difference\nfrom modern people. Only the latter stand in their existence amidst a\nrealm of non-being, that of the image, of detachment from positivity,\nor can choose ‘to stand on the inside or the outside of being as\nnon-presence’ (F, 9). So the disjunction between modern humanity\nand the rest of the natural world includes even another human species.\nIt is as ‘if the division of human possibilities (. . .) were in some sense\ndetermined by an exigency having little to do with the movement\nof evolution’ (F, 9) for, Blanchot observes, evolution was clearly\nas likely as not to produce a humanity without art, ‘freedom’ or\n‘discontinuity’, but still endowed with tools, fire, clothing and instru-\nments of communication, etc. Only modern people, not the extinct\nNeanderthals, could be called Dasein in Heidegger’s sense of beings\ntranscending positivity, one whose being is continually an issue for it.\nArt’s seeming timelessness, Blanchot argues elsewhere, ‘alludes only\nto the power that we have of putting an end to the world, of standing\nbefore or after the world’ (F, 33). It is as if there were latent in\neven the earliest cave art those epochal 1960s images of the earth\n126 Paragraph\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 126\nfrom space, the fragile mottled sphere hanging in an unimaginable\nemptiness, images now forever associated with an emerging ecological\nconsciousness. ‘This is why’, Blanchot continues, ‘art is tied to all that\nputs man in danger, to everything that puts him violently outside the\nworld, outside the security and intelligence of the world to which\nonly the future belongs’ (F, 33).\nIt cannot for any human being be a matter of leaving this third space,\nonly of inhabiting and reconfiguring it in less violent ways. Any notion\nof a ‘return’ to some lost natural ‘harmony’ is intelligible to a reader\nof Blanchot only as an incoherence of thought. Hence Blanchot’s\nremorseless arguments against all kinds of romantic nostalgia, the use\nof art (‘an unreal thing in the world outside the world’ (IC, 382)) for\npurposes of reconciliation with some supposedly ‘lost’ nature, some\ngroup or ethnic identity or allegiance or deeper life.\nThis is a Blanchot who cannot but be pitted against vast stretches\nof environmentalist thought, based as it usually is on a romantic\nprogramme of ‘reconnection’ with ‘nature’ or ‘the earth’. Ultimately,\nhowever, Blanchot may offer a way of articulating global environ-\nmental crisis in terms that do not ultimately rest on forced claims of\nsome lost ‘kinship’ and ‘reciprocity’ with nature.\nBlanchot’s Neo-anthropocentrism (2)\nFirst, however, it is necessary to turn to some more problematic\naspects of Blanchot’s neo-anthropocentrism.\nHis meditative dialogues and essays often turn around the issue\nof modes for self-understanding that would enable human life to be\nthought without reference to illusory moral or metaphysical anchors,\nin ‘God’, ‘nature’, or seemingly self-evident ‘values’. Kevin Hart has\nwritten of the importance of an ethics of the human relation in\nBlanchot’s work overall, read as an attempt to ‘preserve the sacred\nwithout religion’ (206): ‘To lose faith that life has an overarching\nmeaning is not to dismiss mystery; it is to recognize that the human\nrelation is mysterious, that the legitimate processes of demystification\ncannot find traction there.’7 Should this exclusive focus on ‘the\nhuman’ be accepted? Among such a wealth of living things and places\nis there really no other resistance to demystification? Is ‘nothing (. . .)\nmore strange than the human relation’ (DG, 17)? To turn back to\nBlanchot’s pages is to find that the ethical relation, such as he engages\nit after Levinas, seems entirely and exclusively a matter only of one\nhuman being to another.\nA Green Blanchot: Impossible? 127\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 127\nThe central claim of Blanchot’s neo-anthropocentrism lies in the\nunique breach that art and language make within the positivity of\nbeing. This realm of ‘discontinuity’ underlies Blanchot’s reworking\nof an ethics of autrui that both looks to and revises Levinas. It is\ncrucial that autrui speaks. ‘Autrui speaks to me’ (IC, 55). Blanchot\ndefines autrui through the radical inflection which language may bring\nto the relation of one human being to another: ‘the recognition of the\ncommon strangeness that does not allow us to speak of our friends but only\nto speak to them’ (F, 291). At issue is the affirmation of ‘a separation\nthat is presupposed—not surmounted, but confirmed— in all true\nspeech’ (IC, 55; emphasis added), the lack of commonality between\nthose who express themselves. Blanchot’s appeal here is a norm of\n‘true’ speech that seeks to let speak the very ‘separation’, rather than\ndrive to accommodate both speakers within a shared identity, cultural\nhorizon, common values, etc. The ‘double dissymmetry’ of the human\nrelation— its refusal of linear geometry— lies in the fact that if the\nother (autrui) is never a self for me, even as he or she also transcends\nphenomenology, then the reverse is also true, but not in a dialectical\nfashion, for there is no symmetry that could become the foundation\nfor a ‘we’, a common identity or platform.\nClearly, however, in positing that the emergence of the human and\nthis affirmation of a space of discontinuity constitute the same event,\nBlanchot’s argument about autrui must move within the presupposed\ncircle of a sharedDasein. Only within someminimal kind of reciprocity\nbetween speakers is Blanchot’s norm thinkable, affirming an infraction\ninto the realm of shared terms, references and concepts that make up\nlanguage. The ‘double dissymmetry’ remains essentially and necessarily\nsymmetrical even as it maintains an infinity whereby one human being\ncan never be an object or an intentional correlate of the other. The\nrealm of the ethical seems exclusively human.\nHowever, other aspects of Blanchot’s argument implicitly desta-\nbilize his anthropocentrism. In this third space outside terms of\nequivalence and identity the human speakers may come to recognize\nin impossibility our most human belonging to immediate human life, the life that\nit falls to us to sustain each time that, stripped through misfortune of the clothed\nforms of power, we reach the nakedness of every relation: that is to say, the\nrelation to naked presence, the presence of the other. (IC, 47)\nBlanchot’s focus is on what remains of the human relation when\nstripped of all positivities of given identity or cultural belonging. This\nleads him, supposing himself forced to ‘choose [his] ideology’, to give\n128 Paragraph\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 128\nallegiance to a revised notion of ‘humanism’— the humanism of ‘the\ncry— that is to say, the murmur; cry of need or of protest, cry without\nwords and without silence, an ignoble cry’ (IC, 262).\nA reduction to the most basic, stripped ‘humanness’— the helpless\nappeal of a complete vulnerability— this is what Blanchot sees in\nthe victims of the concentration camps: ‘human existence pure and\nsimple, lived as lack at the level of need’ (IC, 133). So, in a sense, it is in\nthe acultural, deprived condition of being reduced to a quasi ‘animal’\nexistence, one might say, that the true claim of humanness becomes\nmanifest, an ethical claim which no power can abolish. This ‘man\nreduced to the irreducible’ (IC, 133) cries out in the ethical appeal\nthat the other makes to me, not only ‘as though this Self were in my\nplace, but [also to] become responsible for it by recognizing in it an\ninjustice committed against everyone’ (IC, 134). This is where some\nkind of re-entry of the other into the realm of ‘dialectical struggle’\n(IC, 134), social identities and moral norms, systems of justice, etc.,\nmust occur. The sense of an ‘injustice committed against everyone’\nmay acquire, in court, the legal status of a ‘crime against humanity’.\nHowever it is at just this same Kantian point—of a universalization\nthat sees in the one wrong a wrong committed against all— that\nthe question of the human\/animal distinction again becomes urgent\nand destabilizing. In relation to the suffering of a creature of another\nspecies, Blanchot’s ‘humanism’ becomes problematic. How can I\nthink ‘as though this Self were in my place’, and how can that sense of\nsuffering become then the basis of an appeal to all who could likewise\nsuffer? Who could ‘all’ or ‘everyone’ be within such a situation? It\ncould surely never include, for instance, the stoat that needs to have\nkilled that leveret in order to eat? Here no kind of broader ‘society’\nexists into which the naked appeal of suffering can be taken up.\nBlanchot’s argument on the autrui and the human relation attempts\nto hold together two separate issues. One is the ethical claim of\nvulnerability, the cry of another’s suffering. The other is the disruption\nof autrui within language taken as a horizon of equivalence, the refusal\nto be embraced within the horizon of given categories and identities\nand the challenge of a neutral space that escapes their purchase.\nThese two arguments dovetail into each other forcefully in Blanchot’s\ntext, but they only do so if one assumes that the relation at issue is\nexclusively that of one human being to another. However, the issue of\nnon-human suffering, vast and incalculable as it is, can make Blanchot’s\nuse of the term autrui look clumsy. Only within a presupposed horizon\nof a common belonging to modern humanity (or Dasein) does it make\nA Green Blanchot: Impossible? 129\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 129\nsense to use it, as Blanchot does, to name at once both a refusal\nof given terms and identities, in the name of the otherness of the\nother, and the powerlessness of the ethical appeal of vulnerability and\nsuffering.\nThe following paragraph exemplifies another problematic part of\nBlanchot’s neo-anthropocentrism. An interlocutor in a dialogue in\nThe Infinite Conversation argues, on the topic of the autrui, the other\n(person):\n[Man] alone is the unknown, he alone the other, and in this he would be presence:\nsuch is man (. . .). Each time we project strangeness onto a non-human being or\nrefer the movement of the unknown back to the universe, we disburden ourselves\nof the weight of man. We sometimes imagine in a very impoverished fashion our\nfrightened encounter in the sky of the planets and the stars with a different and\nsuperior being, and we ask ourselves: what would happen? A question to which\nwe can perfectly well respond, for this being has always been there: it is man,\nman whose presence gives us all measure of strangeness. (IC, 60)\nThe argument here may seem unacceptably extreme, nor is it really\nqualified later in the dialogue. Are the sea, the stars, the forests really\nto be allowed no ‘strangeness’ but that which they reflect back from\nthe human face? Even given innumerable qualifications well known\nto readers of Blanchot, that would still be a kind of ‘deification’ of the\nhuman.8\nHowever, Blanchot’s neo-anthropocentrism may also contain some\nsurprising resources. Elsewhere, it is not a matter of humanity forming\nalone ‘the unknown’ or ‘strange’, but rather of the human relation as\nrevealing such dimensions of existence more generally, giving access\nto a comparable sense of singularity in the realm of other creatures\nand things.\nBlanchot’s micro-ecological thinking concerns both a form of poli-\ntics that is not a quest for power and kinds of knowledge and language\nthat would not be a mode of synthetic force. Blanchot challenges the\npresupposition that being consists fundamentally in a unity, one which\nconveniently corresponds with notions of knowledge as conceptual\nsynthesis. He surmises: ‘why should not man, supposing that the\ndiscontinuous is proper to him and is his work, reveal that the ground\nof things—to which he must surely in some way belong—has as much\nto do with the demand of discontinuity as it does with that of unity?’\n(IC, 9). In other words, being cannot finally be correlated with that\ndrive in human knowledge to synthesize, unify, and to explain under\nthe aegis of a system of governing concepts. Singularity, disunity,\n130 Paragraph\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 130\nopacity and the incalculable are ‘fundamental’ to the ultimate nature\nof things. The human relation remains the unavoidable mode of access\nto this issue, but is not the sole bearer of such singularity (IC, 10).\nImpossibility, Physis, Nature\nOne of Blanchot’s rare references to the natural world in The Infi-\nnite Conversation pivots on its very ‘meaninglessness’: ‘[A]ll modern\nhumanism’, writes Blanchot, ‘the work of science, and planetary\ndevelopment have as their object a dissatisfaction with what is, and\nthus the desire to transform being— to negate it in order to derive\npower from it and to make of this power to negate the infinite move-\nment of human mastery.’ Thus anything (such as Bataille’s notion of\n‘interior experience’) which annuls the scope of conceptualization and\nhuman power ‘lays waste at one stroke to our attempts to dominate the\nearth and to free ourselves from nature by giving it a meaning— that\nis, by denaturing it’ (IC, 149).\nHuman aggression against the indifference of nature is also a denial\nof death. Reading so much of Western thought as the attempt to\nmake death ‘possible’, that is, part of the realm of human power\nand meaning, aligns Blanchot with innumerable thinkers in the deep\necology movement for whom such denial underlies the planetary\ndirectives of techno-science to command nature and all its resources.9\nAs Blanchot suggests, the necessity to which ‘everything in the world\nsubmits’ is death; or rather it is\nthe refusal of death— the temptation of the eternal, all that leads men to prepare\na space of permanence where truth, even if it should perish, may be restored to\nlife. The concept (therefore all language) is the instrument in this enterprise of\nestablishing a secure reign. (IC, 33)\nBy describing something as ‘impossible’, then, Blanchot means not\nthat it cannot exist, but that its existence is not the effect of any\nhuman power, decision or intention. ‘Impossibility’, writes Blanchot,\nis ‘a relation escaping power’ (IC, 38). In this sense, of course, all\nthe basic dimensions of existence—birth, health, death, needs and\npassions, and the immediate recalcitrance of things— are impossible.\nHuman beings cannot ultimately command them. The impossible is\n‘our ultimate dimension’ (IC, 48) and ‘impossibility is being itself’\n(IC, 47). Being alive is itself ‘impossible’ in Blanchot’s sense!\nStrange though it may sound at first, much of Blanchot’s concept\nof ‘the impossible’ correlates with the Aristotelian sense of physis\nA Green Blanchot: Impossible? 131\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 131\nin Heidegger’s reading ‘On the Essence and Concept of Physis in\nAristotle’s Physics B, I’ (1939).10 (Heidegger’s essay also begins by\nciting exactly the same poem by Ho¨lderlin that will be prominent in\nBlanchot’s essay on poetry and the impossible (IC, 38–48)). Physis\nis the term inadequately translated as ‘nature’. It is that fundamental\nself-originating, ordering and resting of things within which all human\nlife finds itself. It cannot be fully conceptualised, for it cannot even be\nthought without having been presupposed: ‘Whatever produces itself,\ni.e. places itself into its appearance, needs no fabrication. If it did, this\nwould mean an animal could not reproduce itself without mastering\nthe science of its own zoology’ (Pathmarks, 222).\nCompare Blanchot on ‘impossibility’: ‘impossibility [is] that in\nwhich one is always already engaged through an experience more\ninitial than any initiative, forestalling all beginning and excluding any\nmovement of action to disengage from it’ (IC, 46).\nA thinking of physis then is implicit in Blanchot’s account of\n‘impossibility’ both as being and as that in being which must precede\nontology, since it cannot be negated. The switch in terminology\nfrom ‘physis’ or ‘nature’ to ‘the impossible’ might seem partly a\nmark of Blanchot’s neo-anthropocentrism (as well as of the influence\nof Bataille’s The Impossible).11 Being as impossibility is characterised\nentirely in terms of its relation to the human—one of non-power!\nTo denominate everything in the universe outside human power ‘the\nimpossible’ may seem merely the inverse of a hopelessly megalomaniac\nhuman-centred metaphysics. However, Blanchot, in affirming ‘the\nimpossible’, is foregrounding just that element of so much Western\nthought.\nThe notion of physis is crucial in Blanchot’s reading of the poetry\nof Rene´ Char. There is even a sense in which Blanchot is almost too\neager to skip over ‘nature’ in the sense of individual creatures and\nthings in favour of physis generally:\nNature has a powerful hold over [Char’s] work, but nature does not only mean all\nterrestrial objects, or the sun, or the oceans, or the wisdom of enduring men; it is\nnot even all things together, not the plenitude of the universe, nor the infinity of\nthe cosmos, but that which already precedes ‘the whole’, is immediate and very\ndistant, is more real than all real things and lies forgotten in every thing, the bond\nthat cannot be bound and by which everything, the whole, is bound. Nature, in\nthe work of Rene´ Char, is this exposure to the origin.12\nA major question can be posed at this point. Is there then\nan analogy between the original underlying meaninglessness of\n132 Paragraph\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 132\nnature—unnegatable, chastening of all human self-aggrandisement—\nand an element of art, Char’s poetry for instance, with its own ordeal\nof another kind of powerlessness and contestation? As we have seen,\nin the emergence of art, prehistoric man found ‘a prodigious contact\nwith all of anterior reality (and first with animal reality) and thus a\nreturn to the first immensity’.\nThis seeming analogy would make Blanchot look close to that\npost-Kantian tradition of aesthetics which understands the peculiarity\nof the achieved work of art by reference to something similar in\nnatural phenomena. For Blanchot, however, the impossibility of art\ninheres in its constitutive breach from the natural world, as in the\nmoment of cave art. The break is a jump, one not explicable in terms\nof laws governing natural phenomena, even those of evolution. The\n‘impossibility’ of art cannot be merely identified with the ultimate\n‘impossibility’ of natural phenomena.\nA better summary formulation of the relation might be this: whereas\nHeidegger may attribute to art a potential grounding role in human\naffairs, for Blanchot the impossibility in art and language may highlight\nthat contestation of all anthropocentrism inherent in physis and natural\nphenomena. To make this issue more concrete let us turn to another\nof the rare occasions on which Blanchot uses an image from the\nnatural world. Early in The Infinite Conversation, Blanchot contrasts\ntwo simple modes of expression:\n‘The sky is blue’, ‘Is the sky blue? Yes.’ One need be no great scholar to recognize\nwhat separates them. The ‘Yes’ does not at all restore the simplicity of the flat\naffirmation; in the question the blue of the sky has given way to the void. The\nblue, however, has not dissipated. On the contrary, it has been raised dramatically\nup to its possibility: beyond its being and unfolding in the intensity of this new\nspace, certainly more blue than it has ever been, in a more intimate relation\nwith the sky, in the instant— the instant of the question where everything is in\ninstancy. Yet hardly is the Yes pronounced, and even as it confirms in its new\nbrilliance the blue of the sky brought into intimacy with the void, we become\naware of what has been lost. Transformed for an instant into pure possibility, the\nstate of things does not return to what it was. (IC, 12–13)\nThe question affirms ‘the gift and the richness of possibility’ (IC, 13),\n‘gift’ being effectively synonymous here with the impossibility of\nnature. This is perhaps a simple instance of the ‘human relation’\nbearing upon a natural phenomenon, against the ‘void’ of outer space\nas effectively human space, in such a way as to foreground the sky\nin its instancy and singularity. In the seemingly trivial grammar of a\nA Green Blanchot: Impossible? 133\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 133\nquestion, Blanchot traces ‘the illuminating force that brings being to\nthe fore’ (IC, 13).\nBlanchot argues that Char’s practice of a fragmentary, non-synthetic\nwriting may adumbrate an irenic language, one that would preserve\nthe unknown as unknown. On Char’s ‘fragmentary’ and paratactic\nmode of writing we read:\nSpeech as archipelago: cut up into the diversity of its islands and thus causing a\nsurging of the great open sea; this ancient immensity, the unknown always still to\ncome, designated for us by the emergence of the earth’s infinitely divided depths.\n(IC, 309)\nThe subject of this extended metaphor is speech or language. This\nis being compared to nature as physis or origin in the guise of ‘the\ngreat open sea’ and the ‘emergence of the earth’s infinitely divided\ndepths’. This is not the familiar romantic position, however, that art\nor language and nature are analogous. The force of language inheres\nhere in its action of breaking away and breaking apart: ‘Speech as\narchipelago: cut up into the diversity of its islands’. This diversity of\nfragmentation and dispersal is said to cause ‘a surging of the great\nopen sea’ and of ‘the unknown always still to come’. Language,\nthen, is not a second-order physis. It enacts and affirms humanity’s\nconstitutive breach with nature and yet, in the process, also unblocks\nwhat is singular and non-synthetic more generally in relation to the\nemergence of unpredictable possibilities. In this way, one might say\nthat the element of the unknown, first apparent in the human relation,\nbecomes generalized through a kind of return without return to that\n‘first immensity’. Thus ‘man, supposing that the discontinuous is\nproper to him and is his work, reveal[s] that the ground of things (. . .)\nhas much to do with the demand of discontinuity as it does with that\nof unity’ (IC, 9).13\nIt is in the third realm of language that a different and irenic relation\nto things lies latent, as well as a different relation to other sentient\nbeings. (‘Reality without the dislocating energy of poetry, what would\nthat be?’ (Char).14) Such language may effect a force of contestation\nand un-meaning which may re-enchant natural phenomena through\nan intensification of the sense of their otherness and giftedness.\nEnvironmentalist thinkers often draw attention (like Blanchot) to\nthe destructive effects of current paradigms of knowledge as ideally\n‘objective’, mathematically quantifiable and decontextualized, a model\nthat transforms reality into a homogenous set of formally expressed\nrelations. Against this, Blanchot’s work offers a detailed reflection on\n134 Paragraph\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 134\nmodes of thought and language that enable an irenic and irreplaceable\nsingularization, discontinuity and openness, one irreconcilable with\nreceived modes of coherence, synthesis, logical consequence and\n‘development’:\nA developed thought is a reasonable thought; it is also, I would add, a political\nthought, for the generality it strives for is that of the universal State when there\nwill be no more private truth and when everything that exists will submit to a\ncommon denominator. (IC, 339)\n‘Poetry: dispersion that, as such, finds its form’ (IC, 360). Such issues\nare at work even in that blend of the elusive and intense lucidity that\nforms the allure of Blanchot’s ‘style’. Its quality is that of the limpidity\nof swift streaming water, at once both monotonous and always fresh.\nBlanchot’s deeper ecology?\nBlanchot’s micro-ecology moves to identify and counter the kinds of\nconceptual violence inherent even in the most seemingly common-\nsensical or innocent modes of thought or speech. Were one to try to\nalign this side of Blanchot’s work with any contemporary school of\nenvironmentalist thought it would surely be with those ‘eco-feminists’\nand ‘social ecologists’ who trace humanity’s rapacious attitude to the\nnatural world to the violence that predominates in relations between\nhuman beings themselves. Verena Conley, for instance, writes:\nThe destructive urge of our culture can be linked with a patriarchy that organizes\nsociety according to a sexual model that is in fact a martial model. This martial\nmodel has its correlative in the economic model of competition and consumption\nthat, while benefiting a few, has led to much of the planet’s degradation.15\nNevertheless, almost all work in environmentalist philosophy and\nethics would also be vulnerable to a Blanchot-style deeper ecology. A\ngood instance of the kind of romantic position that Blanchot’s work\nundermines is Max Oelschlager’s essay, ‘Earth-Talk: Conservation and\nthe Ecology of Language’.16 Oelschlager’s text shares with Blanchot\ntraces of Heidegger’s influence as well as a common attention to\nlanguage as a decisive human environment. For both, a change in\nconceptions of language is essential to any fundamental shift in how\nhuman beings conceive themselves. Oelschalger argues that even the\nvery terms ‘environment’ and ‘environmentalist’ enact the presump-\ntion that humanity stands centre stage in a drama of one, surrounded\nby its ‘environment’ as a kind of scenery. It is at this point, however,\nA Green Blanchot: Impossible? 135\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 135\nthat Oelschlager moves into familiar romantic territory, idealizing\n‘primary cultures’ without literacy and writing as enacting a truer,\nsupposedly non-dualistic understanding of the human relation to the\nnatural world: ‘it is through language generally, and through literacy\nmore particularly, that we have been alienated from the first world’\n(51). Oelschlager addresses the nature\/culture dichotomy split by an\nargument familiar to literary specialists since the time of the high\nromantic poets, for ‘it is also through language that we can return’\n(51). He praises the literary practice of Gary Snyder and ‘earth talk’ as\nmodes of language that understand human beings non-dualistically, as\npart and not master of a habitat. Oelschlager asks that we be attentive\nto the way ‘primary oral cultures have allowed the flora and fauna ‘‘to\nspeak’’ ’ (52).\nThe contrast with Blanchot could not be stronger. The issue for\nhim is not to overcome some mind\/nature dualism through a more\n‘natural’ kind of language, but to intensify the very ‘discontinuity’\nand interruption in being which the ‘human relation’, as it is borne in\nlanguage, poses and is posed by. This produces some very different if\nstill generally positive readings of some pre- or non-scientific modes\nof language (for example, the words of Heraclitus (IC, 85–92)). The\nhuman relation, borne in language, holds open a discontinuity in\nbeing more generally— an un-meaning and wildness that cannot be\ncontained by given concepts of unity, synthesis or by that ‘knowledge’\nwhich has almost always been defined by such principles.\nBlanchot affirms the disturbing yet irenic force of this worklessness,\nas in the following fragment from The Step Not Beyond. This brings\na strange twist to the familiar romantic topoi of the garden and lost\nchildhood:\nAll words are adult. Only the space in which they reverberate— a space infinitely\nempty, like a garden where, even after the children have disappeared, their joyful\ncries continue to be heard— leads them back towards the perpetual death in\nwhich they seem to keep being born.17\nStrikingly, it is the already lost status of Eden that emerges here as\nthe principle of ‘beginning’. A language exposed to its own finitude\nand the violence of the break from the immediate is also one held\nanew in the space of its own genesis. What is the force of this\nstrange simile for the space in which a word or words reverberate:\n‘like a garden where, even after the children have disappeared, their\njoyful cries continue to be heard’? This movement of unworking\nin the language, considered as the constitutive human environment,\n136 Paragraph\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 136\nbecomes, through the acknowledgement of finitude and evanescence,\nan irenic affirmation of ‘impossibility’ as a force of beginning. The\nreference to children recalls the concept of ‘natality’ in Hannah\nArendt’s sense, that ‘with each birth something uniquely new comes\ninto the world’.18 This strange space, whose cold fecundity inheres\nin its very finitude, stands in Blanchot’s work in place of Ho¨lderlin’s\n‘Nature’, Heidegger’s ‘physis’ and Rilke’s ‘das Offene’.\nBlanchot’s ‘naming the possible, responding to the impossible’ (IC,\n48) might even make an excellent summary reformulation of some\nof the aims of the deep ecology movement. The deep ecologist Peter\nReed, for instance, argues that a sense of the otherness of nature\nmay be a better basis for deep ecology than those dubious narra-\ntives of an intensifying human identification with the earth found\nin Arne Naess and Warwick Fox. In Michael Zimmerman’s words:\n‘Encountering the ‘‘austere mystery’’ of dominant nature can reveal\nour intrinsic insignificance (. . .). Only by cultivating this difference,\nrather than seeking to overcome it through wider identification, can\npeople retain appropriate respect for the wholly Other.’19 At the\nsame time, Blanchot’s work refuses, in its very constitution, that\ntemptation which a deep ecologist never seems able to resist, that\nof making a new foundation or absolutist ground out of ‘nature’ or\nthe ‘earth’.\nA World without Impossibility\nTo conclude I wish to turn to a thought experiment, taken from\nEdward O. Wilson’s Biophilia: The Human Bond with Other Species\n(1984). Wilson writes:\nVisualize a beautiful and peaceful world, where the horizon is rimmed by snowy\npeaks reaching into a perfect sky. In the central valley, waterfalls tumble down\nthe faces of steep cliffs into a crystalline lake. On the crest of the terminal bluff\nsits a house containing food and every technological convenience. Artisans have\nworked across the terrain below to create a replica of one of Earth’s landscape\ntreasures, perhaps a formal garden from late eighteenth-century England, or the\nGarden of the Golden Pavilion at Kyoto, marked by an exquisite balance of water,\ncopse, and trail. The setting is the most visually pleasing that human imagination\ncan devise. Except for one thing— it contains no life whatever. This world has\nalways been dead. The vegetation of the garden is artificial, shaped from plastic\nand colored by master craftsman down to the last blade and stem. Not a single\nmicrobe floats in the lake or lies dormant in the ground. The only sounds are the\nA Green Blanchot: Impossible? 137\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 137\nbroken rhythms of the falling water and an occasional whisper of wind through\nthe plastic trees.20\nSuch a landscape, corresponding perhaps to some future lunar colony,\nis nightmarish. ‘This is a world (. . .) where people would find their\nsanity at risk’ (115).\nHow does this thought experiment relate to Blanchot’s work? As\nwe have seen, Blanchot conceptualizes nature in terms of physis and\nthe ‘impossibility’ of being. The natural realm is not to be hastily\nassimilated to a possible object of human power. Is it not the lack\nof ‘impossibility’ in just Blanchot’s sense that renders Wilson’s false\nparadise so horrific? ‘[T]he impossible is not there in order to make\nthought capitulate, but in order to allow it to announce itself according\nto a measure other than that of power’ (IC, 43).\nWilson’s thought experiment helps particularize what is at issue\nin Blanchot’s notion of the impossible. Wilson’s pseudo-beautiful\nlandscape is the physical realization of complex programmes for\nso-called ‘artificial life’, that is, self-organizational algorithms that\nsimulate life-like qualities without actually being alive. Such ‘artificial\nlife’ might seem ‘impossible’ in the limited sense that no human\nbrain, unaided, could model and so understand it. Yet it would still\nnot be impossible in Blanchot’s sense. Even if artificial life were\nindistinguishable from the real thing the sense of nightmare remains\nand is undeniable.\nIt is in this respect that Bill McGibben’s polemic The Death of\nNature seems so Blanchotian as an affirmation of and lament for the\nimpossibility of nature. He argues that ‘we have ended the thing that\nhas, at least in modern times, defined nature for us— its separation from\nhuman society’.21 Nature as a whole, argues McGibben, is losing its\nwildness (its ‘impossibility’) and becoming, however clumsily, part of\nthe sphere of human fabrication.\nIn altering the planet’s atmosphere, humanity has rendered even\nthe most distant mountain winds part of the sphere of human fabri-\ncation. ‘Yes, the wind still blows—but no longer from some other\nsphere, some inhuman place’ (EN, 49). The rain is likewise altered,\nperhaps just slightly chemically, but the sense of rain shifts drastically.\nMcKibben narrates an experience of disenchantment felt one autumn\nwhen listening to the sound of rushing water in the Adirondack\nMountains:\nas I sat there (. . .) and thought about the dry summer we’d just come through,\nthere was nothing awe-inspiring or instructive, or even lulling, in the fall of water.\n138 Paragraph\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 138\nIt suddenly seemed less like a waterfall than like a spillway to accommodate the\noverflow of a reservoir. (EN, 96)\nFor people in less remote areas such disenchantments are enacted daily\non the edge of every growing conurbation: a wood of mixed oak\nand birch, physically untouched by the major road that has been built\nnearby, is trashed nevertheless. Blanchot’s concept of the impossible\nis apt as a name for what is suppressed— that which provokes us to\nthink ‘according to a measure other than that of power’ (IC, 43). Yet,\nas the whole planet is transformed into an object of human use and\nmanagement, ‘the world outdoors will mean much the same thing as\nthe world indoors, the hill the same thing as the house’ (EN, 48).\nIf genetic engineering posits a living organism as a self-replicating\nsoft machine, it removes the creature from that realm of physis to\nwhich Heidegger had opposed the modern conception of organisms\nas merely ‘artefacts that make themselves’ (Pathmarks, 195). Would\ncoming across a genetically engineered rabbit in the countryside,\nMcGibben asks, be much different from finding a discarded coke can?\nBlanchot offers no counter-politics of human liberation, self-\naffirmation or the retrieval of some lost relation to ‘nature’ as ground.\nHis affirmation of the impossible offers a chastening step sideways,\nthe cultivation of a force of natality, ‘beginning’ as a discontinuous,\nunmeaning and acultural element in the human realm generally, one\nthat also affirms the uniqueness and singularity of natural phenomena,\nof physis. This is the ‘wild’ in the sense of a space outside use,\nsomething which is not part of the realm of human power. As we\nsaw, Blanchot’s neo-anthropocentrism bears elements of a problematic\nhuman exclusiveness. At the same time his work overall performs a\nre-enchantment without mystification of both some human artifacts\nand of natural phenomena, touching both with elements of his coldly\nnon-redemptive notion of the sacred.\nNOTES\n1 Maurice Blanchot, The Space of Literature, translated by Ann Smock (Lincoln\nand London, University of Nebraska Press, 1982), 134 ff.\n2 Maurice Blanchot, The Writing of the Disaster, translated by Ann Smock\n(Lincoln and London, University of Nebraska Press, 1986), 36. Thomas the\nObscure [1950 version], translated by Robert Lamberton (New York, Station\nHill Press, 1988), 112–14.\nA Green Blanchot: Impossible? 139\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 139\n3 Maurice Blanchot, Friendship, translated by Elizabeth Rottenberg (Stanford,\nStanford University Press, 1997), 73. All further references to the book will\nbe given in the text, preceded with the abbreviation F.\n4 Maurice Blanchot, The Infinite Conversation, translated by Susan Hanson.\n(Minneapolis, Minnesota University Press, 1993), 43. All further references\nto the book will be given in the text, preceded with the abbreviation IC.\n5 Stuart Kendall, ‘Introduction’ in Georges Bataille, The Cradle of Humanity:\nPrehistoric Art and Culture, edited by Stuart Kendall, translated by Michelle\nKendall and Stuart Kendall (New York, Zone Books, 2005), 15.\n6 See Ian Tattersall and Jeffrey Schwarz, Extinct Humans (Oxford, Westview\nPress, 2001), 213–19.\n7 Kevin Hart, The Dark Gaze: Maurice Blanchot and the Sacred (Chicago,\nUniversity of Chicago Press, 2004), 5. All further references will be given in\nthe text, preceded by the abbreviation DG.\n8 In another passage on the ethical claim of the other person, we read: ‘true\nexteriority is not that of objects, nor that of an indifferent nature or the\nimmense universe (which it is always possible to attain through a relation of\npower by keeping it within the realm of my representation, the horizon of\nmy knowledge, my view, my negation, and even my ignorance)’ (IC, 69;\nemphasis added). This passage, unlike others we will turn to shortly, seems\nto reduce nature to an indifferent object, merely part of the realm of what\ncan be mastered by human power or knowledge. Life itself, the capacity for\nsentience and suffering also seems oddly missing from this account: it moves\nfrom ‘objects’ to ‘an indifferent nature’, then to ‘the immense universe’.\n9 See Michael Zimmerman, Contesting Earth’s Future: Radical Ecology and\nPostmodernity (Berkeley, University of California Press, 1994), 216 ff.\n10 Martin Heidegger, Pathmarks, edited by William McNeill (Cambridge,\nCambridge University Press, 1998), 183–230.\n11 Georges Bataille, The Impossible, translated by Robert Hurley (San Fransisco,\nCity Light Books, 1991).\n12 Maurice Blanchot, ‘The Beast of Lascaux,’ translated by Leslie Hill, Oxford\nLiterary Review, 22 (2000), 9–18 (15).\n13 Reiner Schu¨rmann writes of Char that ‘In the poem all things just begin.\n‘‘Le poe`te, grand Commenceur’’ (the poet, great Beginner) (. . .), says Char.\nAgain, this beginning is neither mythical nor religious. The presence that it\ninaugurates neither founds anything nor even lasts.’ See Reiner Schu¨rmann,\n‘Situating Rene´ Char: Ho¨lderlin, Heidegger, Char and the ‘‘There is’’’,\nBoundary 2,4 (1976), 513–34 (521).\n14 ‘Pour un Prome´the´e saxifrage. En touchant la main e´olienne de Ho¨lderlin’,\nLa Parole en archipel (Paris, Gallimard, 1962), 125.\n15 Verena Andermatt Conley, Ecopolitics: The Environment in Poststructuralist\nThought (London, Routledge, 1997), 132.\n140 Paragraph\nParagraph 30-3 art8.tex V2 - October 23, 2007 11:14 A.M. Page 140\n16 In Wild Ideas, edited by David Rothenberg (Minneapolis, University of\nMinnesota Press, 1995), 42–56.\n17 Maurice Blanchot,The Step Not Beyond, translated by Lycette Nelson (Albany,\nSUNY Press, 1992), 19.\n18 Hannah Arendt, The Human Condition, 2nd edition (Chicago, University of\nChicago Press, 1958), 178. For Blanchot’s ‘natality’\/‘beginning’ see Timothy\nClark, The Poetics of Singularity: The Counter-Culturalist Turn in Heidegger,\nDerrida, Blanchot and the Later Gadamer (Edinburgh, Edinburgh University\nPress, 2005), 115–23.\n19 Contesting Earth’s Future, 303.\n20 Biophilia: The Human Bond with Other Species (Cambridge Mass., Harvard\nUniversity Press, 1984), 114.\n21 Bill McGibben, The End of Nature: Humanity, Climate Change and the Natural\nWorld, revised edition (London, Bloomsbury, 2003), 68. All further references\nto the book will be given in the text, preceded with the abbreviation EN.\n"}