{"doi":"10.1049\/el:19930963","coreId":"69863","oai":"oai:eprints.lancs.ac.uk:20609","identifiers":["oai:eprints.lancs.ac.uk:20609","10.1049\/el:19930963"],"title":"Design-for-test structure to facilitate test vector application with low performance loss in non-test mode.","authors":["Bratt, Adrian","Harvey, R. J. A.","Dorey, A. P.","Richardson, A. M. D."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1993","abstract":"A switching based circuit is described which allows application of voltage test vectors to internal nodes of a chip without the problem of backdriving. The new circuit has low impact on the performance of an analogue circuit in terms of loss of bandwidth and allows simple application of analogue test voltages into internal nodes. The circuit described facilitates implementation of the forthcoming IEEE 1149.4 DfT philosophy [1]","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69863.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/20609\/1\/20609.pdf","pdfHashValue":"013cc3abeb5208c821b646db39522d63607bf4cd","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:20609<\/identifier><datestamp>\n      2018-01-01T03:44:27Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5441<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Design-for-test structure to facilitate test vector application with low performance loss in non-test mode.<\/dc:title><dc:creator>\n        Bratt, Adrian<\/dc:creator><dc:creator>\n        Harvey, R. J. A.<\/dc:creator><dc:creator>\n        Dorey, A. P.<\/dc:creator><dc:creator>\n        Richardson, A. M. D.<\/dc:creator><dc:subject>\n        TA Engineering (General). Civil engineering (General)<\/dc:subject><dc:description>\n        A switching based circuit is described which allows application of voltage test vectors to internal nodes of a chip without the problem of backdriving. The new circuit has low impact on the performance of an analogue circuit in terms of loss of bandwidth and allows simple application of analogue test voltages into internal nodes. The circuit described facilitates implementation of the forthcoming IEEE 1149.4 DfT philosophy [1].<\/dc:description><dc:date>\n        1993<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/20609\/1\/20609.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1049\/el:19930963<\/dc:relation><dc:identifier>\n        Bratt, Adrian and Harvey, R. J. A. and Dorey, A. P. and Richardson, A. M. D. (1993) Design-for-test structure to facilitate test vector application with low performance loss in non-test mode. Electronics Letters, 29 (16). pp. 1438-1440. ISSN 1350-911X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/20609\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1049\/el:19930963","http:\/\/eprints.lancs.ac.uk\/20609\/"],"year":1993,"topics":["TA Engineering (General). Civil engineering (General)"],"subject":["Journal Article","NonPeerReviewed"],"fullText":"smaller cavity efficiency and a stronger influence of third order \ndispersion due to the internal grating compressor. \n-8 2 \nb , x l O c r n \/ W  r \n-0  15 \n-0 I \n-0 0 5  \n0 \nd 0 0 5  0 1 0  0 15 0 20 \na?, pslnrn \nFig. 3 External compressor dispersion at optimum as function of intra- \ncavity group velocity dispersion \n0 experiment \n~ numerical simulations for different b, values \n- - - _  analytical calculation of minimum dispersion \nMode l l ing :  Laser-diode modelocking was analysed using the \nmaster equation approach developed by Haus [a]. Intracavity \ndispersion as well as instantaneous net-gain saturation and \nself-phase modulation effects were included as in the work of \nMartinez et al .  [?‘I. Closed-form analytical solutions of pulse \nparameters could then be obtained. Numerical simulations \nwere performed in parallel to test the stability of the solutions. \nThe details of our analysis are given elsewhere [8]. \nTwo well-known peculiarities of semiconductor laser media \nas compared to other systems are: large refractive index \n(phase) variations associated with gain\/absorption variations, \nand strong gain\/absorption saturation detected in short time \nscales [SI. Considering that quadratic variations of phase with \nenergy (-I“ terms in Reference 7) occur with a sign opposite \nto those of net gain (g” term), we theoretically verified that \nmodelocking could be only achieved for normal intracavity \nGVD. As a second result, we found that instantaneous net- \ngain saturation (b, term in Reference 7) was responsible for \nthe dispersion offset measured at minimum intracavity GVD. \nFor strong chirp, the minimum intracavity GVD and dis- \npersion offset were found to be correctly described by the \nfollowing formulas: \nwhere azo = --Zn,Y”go\/k, is the minimum GVD in the \nabsence of fast gain saturation, a, is the available bandwidth \nand k,, k, are related to the go, g’, g” coefficients appearing \nin the series expansion of net gain with energy (k, =g” \n- 49,. g” and k, = g” - 69,. 9”). The theoretical evolution \nof Do,, predicted by eqns. 1 and 2 is reported in Fig. 3 \nfor a, = 7 x 10-4ps2, go = -0.6, g’ = 0.3pJ-’, g” = \n-O.OZPJ-~ and -I“ = -2.59’’ (dashed curve). Full curves \nare numerical calculations of the external compressor disper- \nsion at optimum. As seen, there is an excellent agreement \nbetween calculations and experiments for b, = -0.15 \nx 10-8cmZ\/W, which is’close to what can be deduced from \nprevious experiments [SI. Note the absence of dispersion \noffset when only energetic (slow) variations of laser net gain \nand phase are considered (b, = 0). The weak dependence of \nthe curve slope with b, is also remarkable; this can be reason- \nably approximated by 2(g” - 39, . g”)\/(go . 8“). \nConclusion: Passive (hybrid) modelocking of laser diodes in an \nextended cavity with high tunable group velocity dispersion \nhas been demonstrated. The evolution of pulse compressibility \nwith intracavity dispersion has revealed the important role of \ninstantaneous laser net gain saturation even for modelocked \npulses in the picosecond time scale. The requirement of posi- \ntive dispersion seems to be related to the self-phase modula- \ntion of the laser medium. \n0 IEE 1993 15th June 1993 \nA. Azouz, N. Stelmakh and J.-M. Lourtioz (Institut d’Efectronique \nFondamentafe U R A  22 du CNRS,  Uniuersite Paris X I ,  Bat. 220,91405 \nOrsay Cedex, France) \nRefereaces \nSCHRANS, I., SALVATORE, R. A., SANDERS, S., and YAIUV, A.: ‘Sub- \npicosecond (3201s) pulses from moddocked external cavity two- \nsection multiquantum well lasers’, Electron. Lett., 1992, 28, pp. \n1480-148 1 \nSTELMAKH, N., and WURTIOZ, I.-M.: ‘230fs high-power pulses from \nconventional mode-locked laser diodes with ion implantation’, \nElectron. Lett., 1993.29, pp. 16&161 \nSILBUIBUIG, Y., and shnni, P. w.: ‘Subpicosewnd pulses from a \nmode-locked semiconductor laser’, IEEE J .  Quantum Electron., \n1986, QE22. pp. 759-761 \nDAKIS, N. c., SILBERBWG, v., -AOE I. P., and A L P H O ~  G.  A.: \n‘High-power ultrafast laser diodes’, IEEE J .  Quantum Efectron., \nMARTINEZ 0. E.: ‘3000 times grating compressor with positive \ngroup velocity dispersion: application to fiber compensation in \n1.3-1.6pm region’, IEEE J. Quantum Electron., 1987, Q E D ,  pp. \n59-64 \nmu% H. A.: Theory of modelocking with a slow saturable \nabsorber’, IEEE J. Quantum Electron., 1975, Q E l l ,  pp. 736-746 \nMARTINEZ, 0. a, FORK, R. L., and GORDON, I. P.: ‘Theory of passively \nmode-locked laser for the case of a nonlinear complex- \npropagation dicient’, J. Opt. Sw. Am. E, 1985.2. pp. 753-760 \nAZOUZ, A., SmLMAKH, N., and munnoZ, I.-M.: submitted to IEEE \nJ. Quantum Electron. \nHULWGRW, c. T., and IPPEN, a P.: ‘Ultrafast refractive index \ndynamics in AlGaAs diode laser amplifiers’, Appl. Phys. Lett., \n1991.9, pp. 635-631 \nDeLP(m, P. I., FWREZ, L. T., SIOFFl& N. G., GMI”F,R, I. I., ANDREA- \n1992, QEW pp. 220-2219 \nDESIGN-FOR-TEST STRUCTURE TO \nFACILITATE TEST VECTOR APPLICATION \nWITH LOW PERFORMANCE LOSS IN \nA. H. Bratt, R. J. Harvey, A. P. Dorey and \nA. M. D. Richardson \nNON-TEST MODE \nIndexing term: Designfor testability \nA switching based circuit is described which allows applica- \ntion of voltage test vectors to internal nodes of a chip \nwithout the problem of backdriving. The new circuit has low \nimpact on the performance of an analogue circuit in terms of \nloss of bandwidth and allows simple application of analogue \ntest voltages into internal nodes. The circuit described facili- \ntates implementation of the forthcoming IEEE 1149.4 D!T \nphilosophy [ 13. \nIntroduct ion:  A DfI  philosophy must simultaneously satisfy \nseveral criteria of which three major elements are [2]: \n(i) Control and observation of deeply embedded nodes must \nbe possible to veriry circuit functionality and detect fabrica- \ntion defects by the application and observation of test vectors. \n(ii) Performance loss must be minimal in normal (non-test) \noperating mode. In particular, loss of bandwidth must be \navoided and area overhead must not be excessive. \n(iii) Migration of the testing problem from device level to chip \nlevel should be possible and this process should be amenable \nto automation. \n1438 ELECTRONICS LETTERS 5th August 1993 Vol. 29 No. 16 \nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 5, 2008 at 05:33 from IEEE Xplore.  Restrictions apply.\nIt is assumed that a design may be divided into a number of \nblocks which perform identiliable functions and may be tested \nin isolation. The process of testing then becomes one of appli- \ncation of test voltages between blocks and observation of the \nsubsequent output of the block on the proceeding signal path. \nA major problem with this methodology is that blocks often \nhave low output impedance which frustrates attempts at \ndirectly controlling voltage levels between them due to the \nlow impedance of the node, a phenomenon known as back- \ndriving. \nIt has been proposed that a pass transistor structure may be \nused to isolate an inter-block node from the output stage of \nthe previous block [3], but the presence of switching tran- \nsistors in the signal path during non-test mode may have \nserious performance repercussions in limiting the bandwidth. \nFig. 1 shows a circuit designed to prevent backdriving based \non that proposed in Reference 3 and traces (i) and (ii) of Fig. 3 \nT \nFig. 1 Complementary pass tramistors used to prevent backdriuing \nrepresent the bandwidth loss of an operational amplifier \nwithout and with, respectively, the complementary switch \nadded as in Fig. 1. Clearly the performance impact is signifi- \ncant and the effect may easily be demonstrated to be much \nmore severe for a circuit which as a sensitive output (sensitive \nin the sense of having low drive power, high loading or a low \nimpedance path to ground). \nA circuit is presented in this Letter which overcomes the \nbackdriving problems associated with attempts to directly \ndrive inter-block nodes and has much less impact on the \nbandwidth of the circuit in non-test mode. \nD j 7  switching circuit operational amplifier: Fig. 2 shows a \nschematic diagram of an operational amplifier with two stan- \ndard input stages of the type shown in Reference 4 and a \ncommon output stage. The digital input signal 'test' and its \ncomplement 'testbar' may be used to connect either of the \ninput stages to the output stage. Note that the field effect \ntransistors (FET) which perform the switching action (M1 and \nM2) are inserted in small-signal paths rather than large signal \npaths. The source and drain terminals of M1 and M2 are \nmaintained at a common voltage of approximately V, - 0.8 V \nso the need for a complementary switch as in Fig. 1, is \nobviated. Note also that M1 and M2 need only have an \naspect ratio of 10\/3 because they carry a typical current of \nonly 8 pA with a 1 MHz sinusoid input signal of 1 V peak to \nIf input stage B is selected (test = '0') then the operational \namplifier performs its normal function with minimal loss of \nbandwidth. Trace (iii) of Fig. 3 represents the Bode plot of this \namplifier in non-test mode. Clearly the bandwidth change \npeak. \n2.01 \n8 10 4 6  \nHz \n0 2  \n1301131 \nFig. 3 Bode plot of operational amplijier with no DjT structures added, \nproposed I E E E  1149.4 DjT structures added, and new structures \nadded \n(i) no added DIT structures \n(ii) proposed IEEE 1149.4 DIT structures added \n( i )  new DIT structures added \nwith respect to the unloaded case (trace (i)) is greatly reduced \nfrom that seen in trace (U). Increasing the aspect ratio of the \nswitching FETs M1 and M2 will further reduce the band- \nwidth degradation if necessary. \nIf input stage A is selected then voltages that are applied to \nterminal 'vector' will re-appear at the output of the amplifier \nsubject to the usual limitations of an operational amplifier \nsuch as offset voltage, slew rate limitation etc. The FETs in \nstage A may be made very much smaller than those of input \nstage B because, in general, the performance of this input \nstage for testing purposes is not usually required to be as high \nas for stage B. \nThe problem of backdriving in the test mode is no longer \npresent with this circuit configuration; the inter-block test \nvector voltage is produced by the output stage of the oper- \national amplifier rather than in opposition to it. \nConclusion: A switching based circuit has been described \nwhich allows a DfT scheme to be implemented with little loss \nof bandwidth and a minimal area overhead. The problem of \nbackdriving is effectively obviated because the output stage \nfor both test and non-test modes is the same. A cell-by-cell \ntesting strategy is possible with the proposed circuit under the \nlimitation that it has been assumed that the majority of blocks \n186um\/ \n5um \nout \nrefn \ng u m \/  \n5um \nL30112j \"ss \nFig. 2 Proposed operational amplijier circuit with switchable input stages for application of voltage test vectors \nELECTRONICS LE77ERS 5th August 1993 Vol. 29 No. 16 1439 \nI 1  \n~~~ \nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 5, 2008 at 05:33 from IEEE Xplore.  Restrictions apply.\n. I  \nhave an operational amplifier driving the output node. Injec- \ntion of test vectors into interblock nodes is performed easily \nand with little loading of the test vector voltage. \nAcknowledgment: The work described here was supported by \nSERC and the EUROCHIP organisation. Thanks also go to \nC. Thomas of MCE, Tewkesbury for many valuable dis- \ncussions. \n0 IEE 1993 7th June 1993 \nA. H. Bratt, R. J. Harvey, A. P. Dorey and A. M. D. Richardson \n(Engineering School, SECAMS, Lancaster University LA1 4YR, \nUnited Kingdom) \nRefereoces \nTHATCHER, c., et al.: ‘1 149.4 mixed-signal measurement proposal’. \nITC. 1993 \nz&nu, T.: Philips Research Laboratories, Eindhoven, The \nNetherlands: Personal Communication \nWLKINS, B. R., et al.: ‘Towards a mixed-signal testability bus stan- \ndard‘. ETC, April 1993 \nALLEN, P. E., and HoLBERG, R. H.: ‘CMOS analog circuit design’ \n(Holt, Rinehart and Winston, New York, 1987). p. 330 \nANALYSIS OF SKELETON JUNCTIONS IN \n3 x 3 WINDOWS \nE. R. Davies and D. Celano \nIndexing t e r m :  Image processing, Pattern recognition \nThe Letter studies the formation and analysis of skeletons in \nbinary images. Particular emphasis is placed on the concept \nof crossing number which is found to be subtly differe-nt \nwhen testing a point known to be on a skeleton and testing \nwhether a point is on a skeleton: these ideas are applied to \nthe elimination of noise spurs from skeletons. \nIntroduction: The skeleton of a binary figure can be defined as \na connected graph that runs along the medial lines of the \nlimbs of the figure [ l ] .  It is a useful concept in that its form \nreflects the general shape of a figure (including all its holes and \nlimbs), and in particular its connectedness parallels that of the \nfigure. Analysis of skeletons involves particularly location and \nclassification of ‘nodes’ (including junctions and line ends) and \nmeasurement of limb lengths and orientations. \nAlthough skeletons are important for the analysis of shapes \nin binary images, a number of intricacies arise in the forma- \ntion and analysis of skeletons. This Letter considers skeleton \njunction analysis and studies the elimination of noise spurs \nfrom skeletons: the immediate motivation for this arose from \nour own work on structure in textures. \nCrossing number and skeleton formation: Both the formation \nand the analysis of skeletons are aided by the concept of a \ncrossing number x, the basic idea of which is to count the \nnumber of changes from white to black and black to white on \nproceeding once around a given pixel [l, 21. However, the \nconcept is complicated in its implementation because the defi- \nnition of connectedness on a binary lattice involves a funda- \nmental difficulty. In particular, diagonally adjacent 1s have to \nbe regard as joined, but diagonally adjacent Os must not be; \nthis ‘8-connectedness’ ddinition overcomes the problem that \nthe background Os are simultaneously adjacent to each other \nand separated from each other by the foreground Is in the \nconfiguration \n1440 \nHence [I, 21, x has to be redefined as the number of effective \nchanges from white to black and black to white on going \naround a given pixel, and implemented in a 3 x 3 window as \nx = U(A1 # A3) + U(A3 # AS) + U(A5 # A7) + U(A7 # A l )  \n+ 2 [ U ( i  AI & A2 & 7.43) + U ( i  A3 & A4 & i A 5 )  \n+ U ( i  A5 & A6 & i A7) + U ( i  A7 & A8 & i Al)] \n(1) \nwhere the 3 x 3 window notation is: \nA5 A0 A1 \nA6 A7 A8 \nthe window values A0 to A8 are all Boolean Os and Is, ‘&‘ is \nthe logical AND function, $1’ is the logical NOT function, \nand the ‘unity’ function U( .) converts Boolean values 0 and 1 \nto numerical values 0 and 1, respectively. \nAlso of relevance for skeleton formation and analysis is the \nu-function: \nU = U(A1) + U(A2) + U(A3) + U(A4) + U(A5) \n+ U(A6) + U(A7) + U(A8) (2) \nA simple parallel thinning algorithm is now [ 2 ] :  suc- \ncessively remove boundary North, South, East and West \npoints until no further change occurs, but only at points for \nwhich x = 2 and U # 1. The first of these two conditions pre- \nvents points from being removed when this would affect con- \nnectedness, and the second condition prevents limbs from \nbeing shortened. Although many more complex thinning algo- \nrithms exist [l, 3 , 4 ] ,  this simple one shows the role played by \ncrossing number in skeleton formation. \nSkeleton analysis potentially involves examination of local \ncrossing number values, e.g. x = 4, x = 6 or 8, x = 2, x = 0 \nmight indicate respectively a ‘normal’ skeleton point, a junc- \ntion, a line end, and a point skeleton. We amend this view of \nthe situation below. \nAnalysis of skeleton junctions;: We have found that although \ncrossing number is a useful concept for skeleton formation, it \nhas restricted value when analysing skeletons. Consider the \nfollowing instance: \n-1 \nThis apparently corresponds to a T-junction, but its crossing \nnumber value of 4 indicates that it is a ‘normal‘ skeleton \npoint. In fact both interpretations are wrong, assuming this is \nknown to be a point on a skeleton; thus the A3 value of 1 can \nonly arise if there is a point North-East of it. Similarly the AI \nvalue of 1 can only arise if there is a point East, NE or SE of \nit. In fact all window border points that are 1s must corre- \nspond to different lies joining the centre pixel; this clearly \nincludes lone diagonal points (e.g. the A6 point in the above \nexample). Thus the number of lines arriving at a given point \nmust be U, and we can consistently (see the Introduction) \ndeiine the effective crossing number on a skeleton as being \ntwice this, i.e. be, = 25. We amplify this statement by giving \ntwo examples of 5 x 5 windows for which the inner 3 x 3 \nwindows have U-values of 4 and 8, respectively: \n1 0 0 1 0  \n0 1 1 0 0  \n0 0 1 1 1  \n0 1 0 0 0  71 0 0 0 0  1 0 1 0 1  0 1 1 1 0  1 1 1 1 1  0 1 1 1 0  r1 0 1 0 1  \nELECTRONICS LE77ERS 5th August 1993 Vol. 29 No. 16 \n~ \nI 1  \nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 5, 2008 at 05:33 from IEEE Xplore.  Restrictions apply.\n"}