{"doi":"10.1177\/001946461004700403","coreId":"217724","oai":"oai:eprints.lse.ac.uk:32552","identifiers":["oai:eprints.lse.ac.uk:32552","10.1177\/001946461004700403"],"title":"Traditional vocations and modern professions among Tamil Brahmans in colonial and post-colonial south India","authors":["Fuller, C. J.","Narasimhan, Haripriya"],"enrichments":{"references":[{"id":17245451,"title":"A Caste in a Changing World: the Chitrapur Saraswat Brahmans, 1700-1935,","authors":[],"date":"1977","doi":"10.2307\/2756766","raw":"Conlon, Frank F. A Caste in a Changing World: the Chitrapur Saraswat Brahmans, 1700-1935, Berkeley, 1977.","cites":null},{"id":17245463,"title":"Agraharam: The Transformation of Social Space and Brahman Status in Tamilnadu during the Colonial and Postcolonial Periods’,","authors":[],"date":"2010","doi":null,"raw":"––––. ‘The Agraharam: The Transformation of Social Space and Brahman Status in Tamilnadu during the Colonial and Postcolonial Periods’, in Michael Bergunder, Heiko Frese and Ulrike Schröder, eds, Ritual, Caste, and Religion in Colonial South India (Neue Hallesche Berichte; 9), Halle, 2010.","cites":null},{"id":17245473,"title":"Agrarian Relations: South India’, in Dharma Kumar and Meghnad Desai, eds, The Cambridge Economic","authors":[],"date":"1970","doi":"10.1017\/chol9780521228022.006","raw":"Kumar, Dharma. ‘Agrarian Relations: South India’, in Dharma Kumar and Meghnad Desai, eds, The Cambridge Economic History of India, vol. 2: c. 1757-c. 1970, Cambridge, 1983, pp. 207-41.","cites":null},{"id":17245483,"title":"Another Reason: Science and the Imagination of Modern India,","authors":[],"date":"2000","doi":"10.2307\/2652070","raw":"Prakash, Gyan. Another Reason: Science and the Imagination of Modern India, Delhi, 2000.","cites":null},{"id":17245482,"title":"Brahmin and Non-Brahmin: Genealogies of the Tamil Political Present,","authors":[],"date":"2007","doi":null,"raw":"Pandian, M. S. S. Brahmin and Non-Brahmin: Genealogies of the Tamil Political Present, Delhi, 2007.","cites":null},{"id":17245445,"title":"Caste, Society and Politics in India from the Eighteenth Century to the Modern Age,","authors":[],"date":"1999","doi":"10.1017\/chol9780521264341","raw":"Bayly, Susan. Caste, Society and Politics in India from the Eighteenth Century to the Modern Age, Cambridge, 1999.","cites":null},{"id":17245470,"title":"Colonial Requirements and Engineering Education: the Public Works Department, 1847-1947’,","authors":[],"date":"1995","doi":null,"raw":"Kumar, Arun. ‘Colonial Requirements and Engineering Education: the Public Works Department, 1847-1947’, in Roy MacLeod and Deepak Kumar, eds, Technology and the Raj: Western Technology and Technical Transfers to India 1700-1947, New Delhi, 1995, pp. 216-32.","cites":null},{"id":17245461,"title":"Companionate Marriage in India: The Changing Marriage System in a Middleclass Brahman Subcaste’,","authors":[],"date":"2008","doi":"10.1111\/j.1467-9655.2008.00528.x","raw":"––––. ‘Companionate Marriage in India: The Changing Marriage System in a Middleclass Brahman Subcaste’, Journal of the Royal Anthropological Institute (n.s.), Vol. 14, 2008, pp. 736-54.","cites":null},{"id":17245498,"title":"Culture, and Sociality in the Indian IT Industry: A Sociological Study, final report to Indo-Dutch Programme for Alternatives to Development,","authors":[],"date":"2006","doi":null,"raw":"Upadhya, Carol, and A. R. Vasavi. Work, Culture, and Sociality in the Indian IT Industry: A Sociological Study, final report to Indo-Dutch Programme for Alternatives to Development, 2006 (online: http:\/\/www.iisc.ernet.in\/nias\/idpad.htm).","cites":null},{"id":17245520,"title":"Cultures and the Maratha Brahmin Model in South India’, Indian Economic and Social History Review Weber, Max. Economy and Society: An Outline of Interpretive Sociology,","authors":[],"date":"1978","doi":null,"raw":"––––. ‘Scribal Cultures and the Maratha Brahmin Model in South India’, Indian Economic and Social History Review Weber, Max. Economy and Society: An Outline of Interpretive Sociology, Berkeley, 1978.","cites":null},{"id":17245519,"title":"Dominance and State Politics in Modern India: Decline of a Social Order,","authors":[],"date":"1989","doi":"10.2307\/2076181","raw":"Rao, eds, Dominance and State Politics in Modern India: Decline of a Social Order, Delhi, 1989, Vol. 1, pp. 204-64.","cites":null},{"id":17245459,"title":"Guntur District, 1788-1848: A History of Local Influence and Central Authority in South India,","authors":[],"date":"1965","doi":"10.2307\/1859409","raw":"Frykenberg, Robert E. Guntur District, 1788-1848: A History of Local Influence and Central Authority in South India, Oxford, 1965.","cites":null},{"id":17245479,"title":"History in South India,","authors":[],"date":"1985","doi":"10.1016\/0305-750x(87)90214-2","raw":"––––. Peasant History in South India, Princeton, 1985.","cites":null},{"id":17245484,"title":"Ideology and Ethnicity under British Imperial Rule: “Brahmans”, Lawyers and Kin-caste Rules in Madras Presidency’,","authors":[],"date":"1989","doi":"10.1017\/s0026749x00011446","raw":"Price, Pamela G. ‘Ideology and Ethnicity under British Imperial Rule: “Brahmans”, Lawyers and Kin-caste Rules in Madras Presidency’, Modern Asian Studies, Vol. 23, 1989, pp. 151-77.","cites":null},{"id":17245509,"title":"Imperial Encounters: Religion and Modernity in India and Britain,","authors":[],"date":"2001","doi":"10.1017\/s0165115300009232","raw":"van der Veer, Peter. Imperial Encounters: Religion and Modernity in India and Britain, Princeton, 2001.","cites":null},{"id":17245522,"title":"India: Scientific and","authors":[],"date":"2000","doi":"10.1596\/0-8213-4775-6","raw":"World Bank. India: Scientific and Technical Manpower Development in India, Report no. 20416-I, Washington, D.C., 2000.","cites":null},{"id":17245443,"title":"Indian Society and the Making of the British Empire,","authors":[],"date":"1988","doi":"10.1017\/chol9780521250924","raw":"Bayly, C. A. Indian Society and the Making of the British Empire, Cambridge, 1988.","cites":null},{"id":17245447,"title":"Industrial Evolution in India,","authors":[],"date":"1912","doi":"10.2307\/2222143","raw":"Chatterton, Alfred. Industrial Evolution in India, Madras, n.d. [1912].","cites":null},{"id":17245494,"title":"Institutions, Agency and Economic Change in South Asia: A Survey and Some Suggestions’,","authors":[],"date":"1996","doi":null,"raw":"Subrahmanyam, Sanjay. ‘Institutions, Agency and Economic Change in South Asia: A Survey and Some Suggestions’, in Burton Stein and Sanjay Subrahmanyam, eds, Institutions and Economic Change in South Asia, Delhi, 1996, pp. 14-47.","cites":null},{"id":17245462,"title":"Landlords to Software Engineers: Migration and Urbanization among Tamil Brahmans’,","authors":[],"date":"2008","doi":"10.1017\/s0010417508000091","raw":"––––. ‘From Landlords to Software Engineers: Migration and Urbanization among Tamil Brahmans’, Comparative Studies in Society and History, Vol. 50, 2008, pp. 170-96.","cites":null},{"id":17245453,"title":"Law and the State in India,","authors":[],"date":"1968","doi":"10.2307\/3510431","raw":"Derrett, J. Duncan M. Religion, Law and the State in India, London, 1968.","cites":null},{"id":17245458,"title":"Madras et le Nord du Coromandel: Étude des Conditions de la Vie Indienne dans un Cadre Géographique,","authors":[],"date":"1960","doi":"10.2307\/1526061","raw":"Dupuis, Jacques. Madras et le Nord du Coromandel: Étude des Conditions de la Vie Indienne dans un Cadre Géographique, Paris, 1960.","cites":null},{"id":17245514,"title":"Memoirs of My Working Life,","authors":[],"date":"1951","doi":null,"raw":"Visvesvaraya, M. Memoirs of My Working Life, Bangalore, 1951.","cites":null},{"id":17245489,"title":"Minorities in Madras State: Group Interests in Modern Politics,","authors":[],"date":"1974","doi":"10.1177\/001946467501200107","raw":"Saraswathi, S. Minorities in Madras State: Group Interests in Modern Politics, Delhi, 1974.","cites":null},{"id":17245486,"title":"Munshis and Kacceri Tamil under the Company’s Document Raj in Early-nineteenth-century Madras’,","authors":[],"date":"2009","doi":null,"raw":"––––. ‘Tamil Munshis and Kacceri Tamil under the Company’s Document Raj in Early-nineteenth-century Madras’, in Thomas R. Trautmann, ed., The Madras School of Orientalism: Producing Knowledge in Colonial South India, Delhi, 2009, pp. 209-32.","cites":null},{"id":17245466,"title":"Network City: Planning the Information Society in","authors":[],"date":"2004","doi":null,"raw":"Heitzman, James. Network City: Planning the Information Society in Bangalore, Delhi, 2004.","cites":null},{"id":17245512,"title":"Organizing for Science: The Making of an","authors":[],"date":"1985","doi":"10.2307\/2056145","raw":"Visvanathan, Shiv. Organizing for Science: The Making of an Industrial Research Laboratory, Delhi, 1985.","cites":null},{"id":17245500,"title":"Outposts of the Global Information Economy: Work and Workers in India’s Outsourcing Industry’,","authors":[],"date":"2008","doi":"10.4324\/9780203152003","raw":"––––. ‘Outposts of the Global Information Economy: Work and Workers in India’s Outsourcing Industry’, in Carol Upadhya and A. R. Vasavi, eds, In an Outpost of the Global Economy: Work and Workers in India’s Information Technology Industry, New Delhi, 2008, pp. 9-49.","cites":null},{"id":17245496,"title":"Politics and Nationalist Awakening","authors":[],"date":"1974","doi":"10.1080\/03612759.1974.9946667","raw":"Suntharalingam, R. Politics and Nationalist Awakening in South India, 1852-1891, Tucson, 1974.","cites":null},{"id":17245467,"title":"Politics and Social Conflict","authors":[],"date":"1969","doi":"10.2307\/2754162","raw":"Irschick, Eugene F. Politics and Social Conflict in South India: the Non-Brahman Movement and Tamil Separatism, 1916-1929, Berkeley, 1969.","cites":null},{"id":17245517,"title":"Precolonial Intellectuals and the Production of Colonial Knowledge’,","authors":[],"date":"2003","doi":"10.1017\/s0010417503000355","raw":"Wagoner, Phillip B. ‘Precolonial Intellectuals and the Production of Colonial Knowledge’, Comparative Studies in Society and History, Vol. 45, 2003, pp. 783-814.","cites":null},{"id":17245487,"title":"Report on Public Instruction in the Bombay Presidency (annual),","authors":[],"date":null,"doi":null,"raw":"Report on Public Instruction in the Bombay Presidency (annual), Bombay, 1857\/8-1942\/43.","cites":null},{"id":17245488,"title":"Report on Public Instruction in the Madras Presidency (annual),","authors":[],"date":null,"doi":null,"raw":"Report on Public Instruction in the Madras Presidency (annual), Madras, 1854\/5-1939\/40.","cites":null},{"id":17245416,"title":"Sashiah Sastri, K.C.S.I., an Indian Statesman: A Biographical Sketch,","authors":[],"date":"1902","doi":null,"raw":"Aiyar, B. V. Kamesvara. Sir A. Sashiah Sastri, K.C.S.I., an Indian Statesman: A Biographical Sketch, Madras, 1902.","cites":null},{"id":17245418,"title":"Science and Technology Education in South India’,","authors":[],"date":"1995","doi":null,"raw":"Ambirajan, S. ‘Science and Technology Education in South India’, in Roy MacLeod and Deepak Kumar, eds, Technology and the Raj: Western Technology and Technical Transfers to India 1700-1947, New Delhi, 1995, pp. 112-33.","cites":null},{"id":17245471,"title":"Science and the Raj: A Study of British India,","authors":[],"date":"2006","doi":"10.1093\/acprof:oso\/9780195687149.003.0007","raw":"Kumar, Deepak. Science and the Raj: A Study of British India, Delhi, 2006.","cites":null},{"id":17245420,"title":"Science, Technology and Medicine in Colonial India,","authors":[],"date":"2000","doi":"10.1017\/chol9780521563192","raw":"Arnold, David. Science, Technology and Medicine in Colonial India, Cambridge, 2000.","cites":null},{"id":17245491,"title":"Selections from the Records of the Madras Government, II, Papers Relating to Public Instruction,","authors":[],"date":"1855","doi":null,"raw":"Selections from the Records of the Madras Government, II, Papers Relating to Public Instruction, Madras, 1855.","cites":null},{"id":17245475,"title":"Social History of an Indian Caste: the Kayasths of Hyderabad,","authors":[],"date":"1978","doi":"10.2307\/2802170","raw":"Leonard, Karen I. Social History of an Indian Caste: the Kayasths of Hyderabad, Berkeley, 1978.","cites":null},{"id":17245468,"title":"Tamil Revivalism in the 1930s,","authors":[],"date":"1986","doi":"10.1177\/001946468802500307","raw":"––––. Tamil Revivalism in the 1930s, Madras, 1986.","cites":null},{"id":17245460,"title":"The Brahmins and Brahminical values in Modern Tamilnadu’,","authors":[],"date":"1999","doi":null,"raw":"Fuller, C. J. ‘The Brahmins and Brahminical values in Modern Tamilnadu’, in Ramachandra Guha and Jonathan Parry (eds), Institutions and Inequalities: Essays in Honour of André Béteille, Delhi, 1999, pp. 30-55.","cites":null},{"id":17245469,"title":"The Changing Brahmans: Associations and Elites among the KanyaKubjas of North India,","authors":[],"date":"1970","doi":"10.1093\/sf\/49.4.653","raw":"Khare, R. S. The Changing Brahmans: Associations and Elites among the KanyaKubjas of North India, Chicago, 1970.","cites":null},{"id":17245476,"title":"The Classical Law of India,","authors":[],"date":"1973","doi":"10.2307\/2052909","raw":"Lingat, Robert. The Classical Law of India, Berkeley, 1973.","cites":null},{"id":17245490,"title":"The Emergence of Indian Nationalism: Competition and Collaboration in the Later Nineteenth Century,","authors":[],"date":"1968","doi":"10.1017\/cbo9780511563409","raw":"Seal, Anil. The Emergence of Indian Nationalism: Competition and Collaboration in the Later Nineteenth Century, Cambridge, 1968.","cites":null},{"id":17245518,"title":"The Emergence of Provincial Politics: the Madras Presidency,","authors":[],"date":"1976","doi":"10.1017\/cbo9780511563430.003","raw":"Washbrook, D. A. The Emergence of Provincial Politics: the Madras Presidency, 1870-1920. Cambridge, 1976. ––––. ‘Caste, Class and Dominance in Modern Tamil Nadu: Non-Brahmanism, Dravidianism and Tamil Nationalism, in Francine R. Frankel and M. S. A.","cites":null},{"id":17245485,"title":"The Familial World of the Company’s kacceri in Early Colonial Madras’,","authors":[],"date":"2008","doi":"10.1353\/cch.0.0011","raw":"Raman, Bhavani. ‘The Familial World of the Company’s kacceri in Early Colonial Madras’, Journal of Colonialism and Colonial History, Vol. 9, No. 2, 2008.","cites":null},{"id":17245455,"title":"The Government of India’s “New Industrial Policy”, 1900-1925: Formation and Failure’,","authors":[],"date":"1979","doi":null,"raw":"Dewey, Clive. ‘The Government of India’s “New Industrial Policy”, 1900-1925: Formation and Failure’, in K. N. Chaudhuri and Clive J. Dewey, eds, Economy and Society: Essays in Indian Economic and Social History, Delhi, 1979, pp. 215-57.","cites":null},{"id":17245465,"title":"The Great Tradition Globalizes: Reflections on Two Studies of “the","authors":[],"date":"2003","doi":null,"raw":"Harriss, John. ‘The Great Tradition Globalizes: Reflections on Two Studies of “the Industrial Leaders” of Madras’, Modern Asian Studies, Vol. 37, 2003, pp. 327-62.","cites":null},{"id":17245457,"title":"The Hollow Crown: Ethnohistory of an Indian Kingdom,","authors":[],"date":"1987","doi":"10.1017\/cbo9780511557989","raw":"Dirks, Nicholas B. The Hollow Crown: Ethnohistory of an Indian Kingdom, Cambridge, 1987.","cites":null},{"id":17245480,"title":"The Indian Middle Classes: Their Growth in Modern Times,","authors":[],"date":"1961","doi":"10.2307\/2089654","raw":"Misra, B.B. The Indian Middle Classes: Their Growth in Modern Times, London, 1961.","cites":null},{"id":17245492,"title":"The Jewish Century,","authors":[],"date":"2004","doi":"10.2307\/3649935","raw":"Slezkine, Yuri. The Jewish Century, Princeton, 2004.","cites":null},{"id":17245441,"title":"The Politics of Cultural Nationalism in South India,","authors":[],"date":"1976","doi":"10.2307\/2757212","raw":"Barnett, Marguerite R. The Politics of Cultural Nationalism in South India, Princeton, 1976.","cites":null},{"id":17245439,"title":"The Politics of South India,","authors":[],"date":"1976","doi":"10.1017\/cbo9780511563584","raw":"Baker, C. J. The Politics of South India, 1920-1937, Cambridge, 1976.","cites":null},{"id":17245516,"title":"The Raja’s Magic Clothes: Re-visioning Kingship and Divinity in England’s India,","authors":[],"date":"1994","doi":"10.1177\/006996679903300314","raw":"Waghorne, Joanne P. The Raja’s Magic Clothes: Re-visioning Kingship and Divinity in England’s India, University Park, PA, 1994.","cites":null},{"id":17245521,"title":"The Religion of India: The Sociology of Hinduism and Buddhism,","authors":[],"date":"1958","doi":"10.1017\/s0035869x00119148","raw":"––––. The Religion of India: The Sociology of Hinduism and Buddhism, New York, 1958.","cites":null},{"id":17245464,"title":"Towards a Non-Brahmin Millennium: from Iyothee Thass to Periyar,","authors":[],"date":"1998","doi":"10.1177\/001946460003700109","raw":"Geetha, V., and S. V. Rajadurai. Towards a Non-Brahmin Millennium: from Iyothee Thass to Periyar, Calcutta, 1998.","cites":null},{"id":17245474,"title":"Western India in the Nineteenth Century: A Study in the Social History of","authors":[],"date":"1968","doi":"10.2307\/2753934","raw":"Kumar, Ravinder. Western India in the Nineteenth Century: A Study in the Social History of Maharashtra, London, 1968.","cites":null},{"id":17245481,"title":"What Makes People Who They Are?","authors":[],"date":"2008","doi":"10.1177\/001946460804500303","raw":"O’Hanlon, Rosalind, and Christopher Minkowski. ‘What Makes People Who They Are? Pandit Networks and the Problem of Livelihoods in Early Modern Western India’, Indian Economic and Social History Review, Vol. 45, 2008, pp. 381-416.","cites":null},{"id":17245449,"title":"Who is a Brahmin? The Politics of Identity in India,","authors":[],"date":"2004","doi":null,"raw":"Chuyen, Gilles. Who is a Brahmin? The Politics of Identity in India, New Delhi, 2004.","cites":null},{"id":17245478,"title":"Who Really Ruled Madras Presidency?’","authors":[],"date":"1978","doi":"10.1177\/001946467801500405","raw":"Ludden, David. ‘Who Really Ruled Madras Presidency?’ Indian Economic and Social History Review, Vol. 15, 1978, pp. 517-9.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Since the nineteenth century, Tamil Brahmans have been very well represented in the educated professions, especially law and administration, medicine, engineering and nowadays, information technology. This is partly a continuation of the Brahmans’ role as literate service people, owing to their traditions of education, learning and literacy, but the range of professions shows that any direct continuity is more apparent than real. Genealogical data are particularly used as evidence about changing patterns of employment, education and migration. Caste traditionalism was not a determining constraint, for Tamil Brahmans were predominant in medicine and engineering as well as law and administration in the colonial period, even though medicine is ritually polluting and engineering resembles low-status artisans’ work. Crucially though, as modern, English-language, credential-based professions that are wellpaid and prestigious, law, medicine and engineering were and are all deemed eminently suitable for Tamil Brahmans, who typically regard their professional success as a sign of their caste superiority in the modern world. In reality, though, it is mainly a product of how their old social and cultural capital and their economic capital in land were transformed as they seized new educational and employment opportunities by flexibly deploying their traditional, inherited skills and advantages","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/217724.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/32552\/1\/Fuller_Traditional_vocations_modern_2010.pdf","pdfHashValue":"33ed8dc504e4f0c3eb8188a844de565c532fe30d","publisher":"Sage Publications","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:32552<\/identifier><datestamp>\n      2013-04-19T13:31:36Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D414E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/32552\/<\/dc:relation><dc:title>\n        Traditional vocations and modern professions among Tamil Brahmans in colonial and post-colonial south India<\/dc:title><dc:creator>\n        Fuller, C. J.<\/dc:creator><dc:creator>\n        Narasimhan, Haripriya<\/dc:creator><dc:subject>\n        GN Anthropology<\/dc:subject><dc:subject>\n        HT Communities. Classes. Races<\/dc:subject><dc:description>\n        Since the nineteenth century, Tamil Brahmans have been very well represented in the educated professions, especially law and administration, medicine, engineering and nowadays, information technology. This is partly a continuation of the Brahmans’ role as literate service people, owing to their traditions of education, learning and literacy, but the range of professions shows that any direct continuity is more apparent than real. Genealogical data are particularly used as evidence about changing patterns of employment, education and migration. Caste traditionalism was not a determining constraint, for Tamil Brahmans were predominant in medicine and engineering as well as law and administration in the colonial period, even though medicine is ritually polluting and engineering resembles low-status artisans’ work. Crucially though, as modern, English-language, credential-based professions that are wellpaid and prestigious, law, medicine and engineering were and are all deemed eminently suitable for Tamil Brahmans, who typically regard their professional success as a sign of their caste superiority in the modern world. In reality, though, it is mainly a product of how their old social and cultural capital and their economic capital in land were transformed as they seized new educational and employment opportunities by flexibly deploying their traditional, inherited skills and advantages.<\/dc:description><dc:publisher>\n        Sage Publications<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/32552\/1\/Fuller_Traditional_vocations_modern_2010.pdf<\/dc:identifier><dc:identifier>\n          Fuller, C. J. and Narasimhan, Haripriya  (2010) Traditional vocations and modern professions among Tamil Brahmans in colonial and post-colonial south India.  Indian Economic and Social History Review, 47 (4).  pp. 473-496.  ISSN 0019-4646     <\/dc:identifier><dc:relation>\n        http:\/\/ier.sagepub.com<\/dc:relation><dc:relation>\n        10.1177\/001946461004700403<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/32552\/","http:\/\/ier.sagepub.com","10.1177\/001946461004700403"],"year":2010,"topics":["GN Anthropology","HT Communities. Classes. Races"],"subject":["Article","PeerReviewed"],"fullText":"  \nC. J. Fuller and Haripriya Narasimhan \nTraditional vocations and modern \nprofessions among Tamil Brahmans in \ncolonial and post-colonial south India \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nFuller, C. J. and Narasimhan, Haripriya (2010) Traditional vocations and modern professions \namong Tamil Brahmans in colonial and post-colonial south India. Indian economic & social \nhistory review, 47 (4). pp. 473-496. \n \nDOI: 10.1177\/001946461004700403  \n \n© 2010 Indian Economic and Social History Association \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/32552\/ \nAvailable in LSE Research Online: April 2013 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \nTraditional vocations and modern professions among Tamil Brahmans in \ncolonial and post-colonial south India \n \nC. J. Fuller and Haripriya Narasimhan \nDepartment of Anthropology, London School of Economics \n \nAbstract \n \nSince the nineteenth century, Tamil Brahmans have been very well represented in the \neducated professions, especially law and administration, medicine, engineering and \nnowadays information technology.  This is partly a continuation of the Brahmans’ \nrole as literate service people, owing to their traditions of education, learning and \nliteracy, but the range of professions shows that any direct continuity is more apparent \nthan real.  Genealogical data are particularly used as evidence about changing patterns \nof employment, education and migration.  Caste traditionalism was not a determining \nconstraint, for Tamil Brahmans were predominant in medicine and engineering, as \nwell as law and administration, in the colonial period, even though medicine is \nritually polluting and engineering resembles low-status artisans’ work.  Crucially, \nthough, as modern, English-language, credential-based professions that are well-paid \nand prestigious, law, medicine and engineering were and are all deemed eminently \nsuitable for Tamil Brahmans, who typically regard their professional success as a sign \nof their caste superiority in the modern world.  In reality, though, it is mainly a \nproduct of how their old social and cultural capital, and their economic capital in land, \nwere transformed as they seized new educational and employment opportunities by \nflexibly deploying their traditional, inherited skills and advantages. \n 2 \n____________________________________________________________________ \n \nOne of the most prominent features of India’s economic growth since the 1990s has \nbeen the rapid expansion of the information technology (IT) industry, especially its \nleading software and services companies.  These companies – such as Tata \nConsultancy Services (TCS) and Infosys Technologies – have grown spectacularly in \nrecent years and have become key players in the globalisation of services that is now \nso central to the world economy.  At the time of writing in summer 2010, it looks as if \nthe IT industry has withstood the global economic crisis and its importance for the \nIndian economy is continuing to grow. \n In Chennai (Madras) in 2003-5, we carried out ethnographic research among \nsoftware engineers and IT professionals employed by the leading software companies, \nas well as among engineers working in manufacturing industry.  Since 2005, we have \nbeen studying Tamil Brahmans, focusing on members of a particular subcaste of \nSmarta Brahmans or Aiyars known as the ‘Eighteen-Village Vattimas’.  One of the \nmain links between the two projects is that Brahmans, the traditional caste elite of \nTamilnadu, who make up no more than 2.5 per cent of its population, almost certainly \nare very well-represented in IT, as they have been in engineering.  Actually, no \nfigures exist to uphold this claim, but it is supported by a lot of circumstantial \nevidence.1  Currently, the Tamil Brahmans’ extensive participation in the IT industry \nappears to confirm them as among the leading mobile service people of today’s global \neconomy, which raises the question of whether this is actually a long-term \ncontinuation of the Brahmans’ role as literate service people and, more generally, of \ntheir position in the pre-colonial economy and the division of labour defined by the \ncaste system.  In other words, are these ‘service nomads’ of the twenty-first century \n 3 \nthe direct descendants of the service people of the pre-modern era?2  In this article, to \nanticipate our conclusion, we shall argue that it in some respects they are, mainly \nbecause of the Brahmans’ tradition of education and learning, but that in relation to \nthe range of professional occupations taken up by Brahmans since the nineteenth \ncentury, any continuity is more apparent than real. \n \nCaste and the modern economy \n \nThe question just posed is of course part of a broader debate found in the sociology of \nIndia since Weber, who argued that other-worldly Hinduism and the caste system had \nprevented the development of modern, rational capitalism.  In relation to caste – \nthough he was mainly discussing low-caste artisans – Weber insisted that: ‘The net \neffect of the religious sanction of caste upon the spirit of economic activity is \ndiametrically opposite to that of rationalism’.3  The ‘vocational ethic’ of the caste \nsystem was said to be alien to rational economic organisation and impeded members \nof one caste from taking up the activities of another caste, although the system was \nsufficiently adaptable to allow them to take up new occupations closely related to \ntheir traditional ones.4  Brahmans in colonial India illustrated this continuity between \nold and new occupations, according to Weber, because they ‘were and are infiltrating \noccupations, particularly administrative posts which demand writing skill and \neducation’.  He specifically mentioned, too, that in early twentieth-century south \nIndia, ‘the Brahmans have maintained a monopoly of administrative positions into \nmodern times’, but found it ‘difficult’ to become doctors for ritual reasons and ‘are \nbut sparsely represented in the field of engineering’.5  As we shall see, the \npropositions about Brahman administrators and doctors are overstated.  Moreover, \n 4 \nwhether Weber meant that there were few Brahman engineers compared with \nbureaucrats (which was true) or that Brahmans were under-represented compared with \nother groups in engineering (which was false) is unclear, but in either case his \nimplication that caste ‘traditionalism’ would discourage Brahmans from becoming \nengineers is unsupported by the evidence.  \n In an incisive review of Weber’s thesis and its influence, published in 1996, \nSubrahmanyam observes that generalisations about the caste system and its associated \n‘traditional’ values have been repeatedly advanced to explain India’s economic \nstagnation and failure to ‘modernise’.6  Since the mid-1990s, some generalisers – \nturning old notions on their head – have switched their attention to India’s rapid \neconomic growth and looked for traditional traits, such as Brahmanical \nphilosophising, that might explain success in ‘virtual’ technology and hence in the \ndevelopment of an IT-based service economy.  Needless to say, the new \ngeneralisations are as weak as the old ones, which persistently depended on uncritical \nassumptions about ‘tradition’ and ‘modernity’.  As Subrahmanyam comments, the old \ngeneralisations were also inconsistent with empirical research demonstrating that the \neconomic action and values of particular groups of Indian workers, businessmen, \ntraders or artisans – even those belonging to specific castes – never were determined \nby caste traditionalism.  One basic aim of this article is to show that this negative \nconclusion also applies to Tamil Brahmans – whether they work as bureaucrats or \nsoftware engineers – but more positively we shall also explore the evolution of \nprofessional employment within the caste, particularly by using some genealogical \nmaterial.  Later we shall discuss some aspects of the development of the learned \nprofessions, especially engineering, whose importance for Tamil Brahmans (and \nindeed other Indians) has not received adequate scholarly attention. \n 5 \n \nHistorical background \n \nThe history of the Tamil Brahmans is familiar to scholars of south India and may be \noutlined briefly.  Since the medieval period, the small Brahman minority has \nconstituted the core of the Tamil country’s social, cultural and religious elite, and \nmany of its scholars, teachers, bureaucrats and jurists were Brahmans.  Although a lot \nof Brahmans, including many priests, were poor, numerous others were landowners \nand some were very wealthy landlords or mirasidars settled in the river-valley wet \nzones, especially the Kaveri delta region.  A high proportion of Brahman males, \nunlike members of other castes, have always been literate in vernacular languages and \nsometimes Sanskrit.  When the British took control of the region that became the \nMadras Presidency in the late eighteenth and early nineteenth centuries, they relied \nheavily on their predecessors’ administrative systems, particularly for land settlement \nand revenue collection.  Literate Brahmans – aptly called ‘revenue Brahmans’ by \nConlon – alongside men from other high-ranking, landowning castes such as Vellalars \nwere key personnel in the early colonial administration’s offices (kacceri) as record-\nkeepers, accountants and tax collectors, and also as village headmen where they were \ndominant landowners.  In villages, although there were many Brahman accountants, \nmany others were non-Brahmans, known as kanakkuppillais.7  \nIn the early colonial period in much of south India, the most powerful \nbureaucrats were Deshastha Brahmans, immigrants from Maharashtra, who had been \nparticularly prominent in the Maratha kingdom of Tanjore in the seventeenth and \neighteenth centuries.  Deshasthas had been both innovative and dominant in the \nbureaucracies of the Muslim states in western India and then in Shivaji’s \n 6 \nMaharashtrian Hindu kingdom in the seventeenth century.  As Maratha power \nexpanded in the west and south, so did the Deshasthas’ sway.  In the late eighteenth \ncentury, though, the smaller group of Chitpavan Brahmans rose at the Deshasthas’ \nexpense in Maharashtra and, during the mid-nineteenth century, Deshasthas ceded \ntheir superiority in the south Indian bureaucracy to Telugu-speaking Niyogi Brahmans \nfrom the Andhra country and later to Tamil Brahmans.8  As the colonial government \nexpanded, especially in the second half of the nineteenth century, so too did the \ndemand for educated, English-speaking ‘natives’.  Tamil and Telugu Brahmans in \nparticular responded vigorously to this demand.  By 1900 Tamil Brahmans, followed \nby Telugu Brahmans, had much higher literacy rates in English than other \ncommunities in Madras Presidency, and the two groups overwhelmingly dominated \nadministration, law and education.9  There was a significant difference between the \ntwo groups, however.  Telugu Brahmans had long been divided into ‘secular’ \nNiyogis, who worked as bureaucrats, for example, and ‘orthodox’ Vaidikas, who did \nnot.  Tamil Brahmans were not divided in this way, which probably restrained them \nfrom turning to new kinds of employment in the early colonial period, as Washbrook \nsuggests, although eventually it tended to promote rather more occupational flexibility \namong them than Telugu Brahmans.10 \n Brahman domination provoked a reaction among urban non-Brahmans, who \nissued their Non-Brahman Manifesto in 1916, and for most of the rest of the twentieth \ncentury, the rise of the non-Brahman movement was at the heart of politics in Madras \nand Tamilnadu.11  Caste and community quotas for government posts were introduced \nin the 1920s and slowly began to reduce Brahman representation in the following \ndecade; after Independence, the process accelerated.  Brahman political power in \nTamilnadu also steadily ebbed away until, in 1967, the non-Brahman party, the \n 7 \nDravida Munnetra Kazhagam (DMK), was elected to power; since then, with only \nbrief interruptions, the DMK and its rival, the All-India Anna Dravida Munnetra \nKazhagam (AIADMK), have ruled Tamilnadu.  In the 1970s and 1980s, DMK and \nAIADMK governments significantly expanded the reservations system, so that 50 per \ncent of posts are reserved for the non-Brahman Other Backward Classes, in addition \nto 18 per cent for the Scheduled Castes and Tribes.  As a result, Brahman numbers in \nstate government and public-sector employment have been drastically reduced over \nthe last few decades. \n Even before caste quotas began to bite in the 1930s, some Tamil Brahmans \nfound employment in private industry and commerce, rather than government and the \npublic sector, and some migrated to Bombay, Calcutta and other Indian cities.  After \nIndependence, emigration from Tamilnadu increased and many Brahmans looked for \njobs in the central government and public sector, where reservations were less \nextensive than in the state government; posts in banks were also a popular alternative \nto government bureaucracy, but a lot of Brahmans took a wide variety of jobs in \nprivate companies.  Within Tamilnadu, some of these companies – such as the large \nindustrial groups Amalgamations and TVS – were founded and are still largely \ncontrolled by Tamil Brahmans.12  Of course, besides professional, middle-class \noccupations, many Brahmans did and do work as clerks, factory workers, shop \nassistants, cooks or priests, or in other low-status, low-salary jobs.  Lots of Tamil \nBrahmans are therefore fairly poor.  Nonetheless and in spite of the reservations \nsystem, all the admittedly circumstantial evidence strongly suggests that, for the \ngroup as a whole, the Tamil Brahmans’ economic position has strengthened, rather \nthan weakened, since Independence and that they have not suffered any economic \ndecline commensurate with their loss of political power.13   \n 8 \n Since the nineteenth century, Tamil Brahmans in all economic strata have \nbeen continually migrating to Chennai and other urban areas, partly ‘pulled’ by new \nopportunities in education and employment, and partly ‘pushed’ by indebtedness and \nother economic or agricultural difficulties.  Later in some regions than others, the \nmajority of Brahman landlords, large and small, progressively sold their land and left \ntheir rural homes for good, to become part of a ‘great exodus’ of Brahmans that \n‘transformed a rural class into an urban class’.14  Thus more and more Brahmans have \nabandoned their agraharams – the village quarters and streets once exclusively \noccupied by Brahmans – so that most agraharams today have numerous non-Brahman \nresidents, who often form the majority, as well as empty or decrepit houses.15  As \nalready mentioned, many Brahmans have also emigrated from Tamilnadu to cities \nthroughout India during the last hundred years or so.  More recently, they have been \ngoing overseas, especially to the United States – the favourite destination – but also to \nthe Middle East, Southeast Asia and Europe.  Once again, accurate statistics are non-\nexistent, but the available evidence strongly suggests that Tamil Brahmans are more \nmobile than almost all other communities in south India and that they are \ndisproportionately well-represented among urban, educated, middle-class \nprofessionals.  Indeed, as we have previously argued, Tamil Brahmans today tend to \nperceive themselves mainly as an urban, middle-class caste, for whom migration, as \nwell as urbanisation, have been formative for their success in the modern world.16 \n \nThree Tamil Brahman genealogies \n \nIn our research, we have collected genealogies from Vattimas and other Tamil \nBrahmans, which provide evidence about changing patterns of employment, \n 9 \neducation and migration across generations within particular families.  For this article, \nwe have selected two genealogies that include men who served as dewans (prime \nministers) appointed by the British colonial government in ‘princely states’, and a \nthird from a family whose members included some of the leading lawyers in Madras \nat the turn of the twentieth century.  Obviously, powerful dewans and top lawyers are \nvery unusual service people from the official elite, which is partly why these three \ngenealogies are interesting; as we shall see, however, most other people in their \nfamilies had or have more ordinary jobs that illustrate the variety and evolution of \nprofessional employment among a wider range of Tamil Brahmans.   \nIn 1841, 16 years before Madras University was founded, Madras High School \nopened.  It was ‘the first serious attempt to disseminate Western education in South \nIndia’ and, for the governor of Madras, one of the school’s main objectives was to \n‘furnish a new generation of administrators capable of holding important positions in \nthe government’.17  Among the cohort of 36 men, including 20 Brahmans, who had \ngraduated with a Proficient’s degree by 1855, 25 joined the colonial bureaucracy.18  \nOne of them was Sir A. Seshia Sastri (1828-1903), who belonged to the Eighteen-\nVillage Vattima subcaste.  Seshia Sastri is constantly mentioned by Vattimas as one \nof their most distinguished ancestors, especially by his descendants who can share in \nthe prestige still emanating from his name. \n Seshia Sastri did not come from a family of traditional scholarly literati or \nservice people acting as ‘revenue Brahmans’.  Instead, he was the son of a poor priest \nliving in Amaravati, a village near Kumbakonam, a temple town in the Kaveri delta, \nbut he had an uncle – a dealer in precious stones in Madras – who took him to the \ncity.19  With financial aid from Pachaiyappa’s Trust, which was founded by a wealthy \nVellalar merchant, Seshia Sastri attended Madras High School and graduated with \n 10 \nfirst-class honours in 1848.  His first post was as a clerk in the Board of Revenue, but \nhe rose through the ranks until he became dewan of Travancore in 1872, succeeding \nhis friend and class-mate, Sir T. Madhava Rao.  Madhava Rao was a Deshastha \nBrahman from Kumbakonam, whose father and uncle had both served as dewans of \nTravancore, and who won a reputation as ‘the outstanding statesman of South India \nduring the nineteenth century’.20  Seshia Sastri left Travancore in 1877 and then \nserved as regent and dewan of Pudukkottai from 1878 to 1894.  In retirement, Seshia \nSastri, who had become a rich man and acquired land in Amaravati, lived in the \nmansion he built in Kumbakonam.  Compared with Madhava Rao, whose reforming \nzeal transformed it, Seshia Sastri’s impact on Travancore was slight, although it was \nmuch greater on Pudukkottai in both the palace and the state as a whole.21   \n Seshia Sastri was married in 1847 to Sundari, a girl from Konerirajapuram, the \nlargest Vattima village and first in rank among the nominal 18 villages.  Sundari, \nwhose mother had died, was brought up by her uncle, who was engaged in business in \nMadras.  She joined her husband (and the marriage was presumably consummated) in \n1853, when Seshia Sastri was the tahsildar of Masulipatam revenue division (in \ncoastal Andhra).  Seshia Sastri and Sundari had no children, so he adopted his \nbrother’s son, who in turn had two sons, Kalyanasundara and Rajagopalan.  An \ninteresting feature of Seshia Sastri’s descendants’ genealogy is the pattern of \nintermarriage with other Vattima families, some belonging to the group of ‘big \nfamilies’ that include the richest landlords in the subcaste’s most important villages.22  \nMore relevant here (though the data are incomplete) are people’s occupations.  It is \nunclear whether Seshia Sastri’s adoptive son had a job or only looked after his \nproperty, but his two grandsons, Kalyanasundara and Rajagopalan, were landlords \nresident in Kumbakonam and Rajagopalan married the sister of a big landlord in the \n 11 \nrichest Vattima village.  In the dewan’s family, a sort of regression to the norm \noccurred, so that after Seshia Sastri’s rise to the top, his grandsons became \nconventional mirasidars just like many of their Vattima and other Brahman \ncontemporaries in the early twentieth century.  Why this occurred is not entirely \ncertain, but because Seshia Sastri came from a poor priestly family and Sundari \nprobably did not belong to one of Konerirajapuram’s rich landed families, his son and \ngrandsons may have wanted to secure their status as landlords on a par with other big, \nwealthy Vattima families with whom they could intermarry.  Unlike many other \nTamil Brahmans, who were seeking urban employment by the 1930s, the majority of \nVattimas remained rural landlords until after Independence. \n In the next generation in the 1950s, however, change began.  \nKalyanasundara’s son worked in the state-owned Life Insurance Company in \nKumbakonam; Rajagopalan’s two sons were the property agent for the Kanchipuram \nmonastery and a bank officer in Tirucchirappalli.  In the generation after that, there \nare or were (until recent retirements) two bank officers and, among men marrying into \nthe family, a leading engineer and industrialist who worked in both north and south \nIndia and a chemical engineer who worked in Kerala, as well as two more bank \nofficers.  Two of the four officers worked in local towns for the City Union Bank \n(CUB), which was founded and is still largely controlled by Vattimas.  In the \nyoungest generation of Seshia Sastri’s descendants and their spouses who are now \nworking, there is a different mixture of occupations, including three bank officers \n(one in the CUB in Coimbatore and two in the multinational HSBC in Chennai), a \ncouple who are doctors in Chennai and a woman who is a physiotherapist there, and \ntwo couples who are working as IT professionals in America.  Today, only five acres \n 12 \nof land in Amaravati still belong to Seshia Sastri’s descendants, although they own \nproperty in Kumbakonam.   \n Seshia Sastri’s status is exceptional, as one of the first Tamil Brahmans to \nreceive a modern education and become a high-ranking official in the colonial \ngovernment.  Nonetheless, during the twentieth century, his descendants’ destiny \nclosely resembled that of many other Eighteen-Village Vattimas, whose genealogies \ndisplay a comparable pattern of employment and migration, including young people \nnow working in the US, particularly in IT.   \n The second genealogy belongs to a Sri Vaishnava or Aiyangar family from \nVangal, a village near Karur in central Tamilnadu.  This very full family tree, \navailable on a website, lists more than 1,200 individual men, women and children.23  \nThiruvengata Chari (1837-1934) was a big landlord, who had three daughters (all \nmarried to landlords) and four sons.  The eldest son, Srinivasa, became a government \ncivil engineer in Madras and his three sons all settled in Madras: the first son was also \na government civil engineer and the other two were government officials.  \nThiruvengata Chari’s second son, Satagopa, became a lawyer in Salem and had four \nsons: one was an income tax official in Tirucchirappalli and two went to Madras, one \nbecoming an oil company executive and the other working for the Reserve Bank of \nIndia; on the fourth son, there is no information.  Thiruvengata Chari’s third son, \nRagunatha, married a wealthy contractor’s daughter and lived without a job in \nSrirangam (near Tirucchirappalli). \nThiruvengata Chari’s youngest son was Sir V. T. Krishnamachari (1881-\n1964), who studied law in Madras before entering government service.  During his \ncareer, he was successively dewan of Baroda, an Indian delegate to the League of \nNations and United Nations, and deputy chairman of the Indian government’s \n 13 \nPlanning Commission.  Krishnamachari had three sons: the eldest became Advocate-\nGeneral for Madras, the second joined the railways in southern India, and the \nyoungest, V. K. Ramaswami, became a distinguished economist and a senior \neconomic advisor to the Indian government.  Krishnamachari’s two daughters lived in \nMadras and respectively married an engineer and a railway officer. \nIn this Vangal family, three sons of the landlord Thiruvengata Chari entered \ngovernment service or the law, but one of them worked in the new profession of \nengineering.  Srinivasa kept a residence in Vangal, but his two brothers – and all their \nsons – settled in towns or cities and, apart from Ragunatha in Srirangam, this family’s \nmenfolk all moved into urban employment within one generation.  The majority of the \nnumerous descendants of Thiruvengata Chari’s professional sons had or have similar \njobs, and today many of them – women now, as well as men – work in IT, banking or \nother private-sector industries, either in India or overseas (mostly in America), and \nsome are employed by the government or public sector in India.  Krishnamachari’s \ndescendants, however, display a wider range of occupations and probably more \nupward social mobility than those of his brothers, and they certainly they do so when \ncompared with the descendants of Seshia Sastri, who was actually buying land at \nmuch the same time as Thiruvengata Chari was investing in his sons’ education and \nfuture professional employment. \n The third genealogy belongs to an Aiyangar family from Varahakulam, a \nvillage near Kumbakonam, which intermarried with the Vembakkam family, \noriginally from Chingelput, near Madras.  Vembakkam family members had been \nprominent in the city since the early 1800s and among their number were several \nlawyers and two dewans; by the end of the century, the family ‘possessed an \nenormous presence in the local bureaucracy of the capital and its surrounding \n 14 \ndistrict’.24  The family produced a series of legal luminaries, including Sir V. \nBashyam Aiyangar (1844-1908), the leading lawyer of his day, who became a Madras \nHigh Court judge; he was also immensely rich and a key member of the ‘Mylapore \ngroup’ prominent in provincial politics at the time.25 \n One of Bashyam Aiyangar’s daughters married C. R. Thiruvenkatachari \n(1865-1935), eldest son of Rangaswami Aiyangar, a wealthy landlord from \nVarahakulam; in addition, one of Bashyam’s sons married Rangaswami’s eldest \ndaughter.  Thiruvenkatachari also became a High Court judge.  His wife Sittammal \nbore him 12 children, of whom 11 survived.  The eldest son had a BA degree, but we \ndo not know if he had a job, and one son died young.  The other three sons were \nrespectively a lawyer, who may have attained a high position in Kerala, an insurance \ncompany agent in Madras, and an army doctor killed during World War II.  Five of \nThiruvenkatachari’s daughters’ husbands were lawyers who variously practised in \nMadras, Chidambaram and Kumbakonam; two of them became judges in lower \ncourts.  The sixth daughter’s husband was an engineer in the central government’s \nPublic Works Department in Madras. \n Thiruvenkatachari had 34 grandchildren and we shall refer only to the \ndescendants of his eldest son, Gopalsamy, and second daughter, Rajalakshmi, whose \nhusband was a subordinate court judge in Madras.  (The eldest daughter, who married \na lawyer in Kumbakonam, had no children.)  Gopalsamy’s son worked for the \nrailways in Calcutta; his two daughters respectively married a doctor in Thanjavur and \na landlord in the Chidambaram area.  Their children and grandchildren, and their \nspouses, include a central government officer; two doctors (one in Pondicherry and \none in the US); two men with unspecified positions in private companies (probably in \nChennai), one of whom is married to a teacher; and one couple and another man who \n 15 \nall have PhD degrees in science and technology and work in the US.  Rajalakshmi had \none son, Vasudevan, who worked as a newspaper editor in Chennai and another who \ndied young.  Vasudevan had five sons: an accountant in Bombay and another in \nChennai, two bank officers mainly posted in Chennai, and an engineer in a private \ncompany in Chennai.  His elder daughter married an engineer in another private \ncompany in the city and his younger daughter, a psychology graduate, worked in \ninsurance.  Among Vasudevan’s grandchildren and their spouses, there is an IT \ncompany manager in Chennai whose husband is an engineer, a woman who is a \njournalist, two men working as IT professionals in Bangalore, a third as an executive \nin a multinational bank, and another who is an engineer in the US; two of these men \nalso have MBAs.  Notable is that none of Gopalsamy’s or Rajalakshmi’s children – or \nindeed any of Thiruvenkatachari’s grandchildren – became lawyers; this was almost \ncertainly because, after Independence, growing competition from non-Brahmans \nmade the law less attractive and other occupations looked more secure or better paid. \n Thiruvenkatachari’s descendants, who often mention Bashyam Aiyangar as \nwell, wistfully acknowledge that they have come down in the world.  One of his late \ngranddaughters, in her nineties when she talked to us, reminisced about the governors \nand judges, Indian and British, who visited Thiruvenkatachari’s home; she amusingly \nremembered, too, that her grandmother used to play tennis at the elite ladies’ \nWillingdon Club clad in a nine-yard sari, then obligatory dress for respectable \nBrahman women.  Elderly family members often remember, too, the mansions on Luz \nChurch Road in Mylapore where the city’s richest lawyers lived.26  \nThiruvenkatachari’s home on this road, like Bashyam’s vast mansion opposite, have \nnow been replaced by nondescript buildings.  Much the same fate befell almost all the \ngreat houses of Mylapore, which were sold for redevelopment after property partition.  \n 16 \nEspecially from Bashyam Aiyangar’s lofty position, downward social mobility was \nalmost inevitable, but it has been limited, for nearly all Thiruvenkatachari’s \ndescendants on whom we have information – like members of the Vangal family – \nwere or are educated professionals employed as government officials, bank officers, \naccountants, company managers, doctors, engineers, academics and IT professionals \nin Chennai, other Indian cities or America.  \n Seshia Sastri and Krishnamachari, as dewans, both occupied positions that had \nregularly been held by Brahmans.  Indeed, according to classical authorities, righteous \nHindu kings invariably depended on Brahman ministers, counsellors and jurists.27 \nHence for these Tamil Brahman dewans, as well as the judges, there were ancient \nprecedents.  More humbly, the same applies to the multitude of lower-ranking \nBrahman bureaucrats and lawyers, and to some extent the accountants as well, whose \npredecessors were the ordinary literate (and numerate) service people of the pre-\ncolonial period.  Hence in relation to caste occupations and roles, there is some \ncontinuity from the past, but in the case of our particular families, discontinuity is \nmore in evidence.  Bashyam Aiyangar’s forebears included lawyers and \nadministrators, but, as far as we know, their predecessors did not belong to the old \nservice elite, although the ancestors of some other leading lawyers in Madras did.28  \nMoreover, the two dewans had fathers who were respectively a priest and a big \nlandlord, and they had no family traditions of service.  Varahakulam and Vembakkam \nwere, of course, major landowning families as well.  Furthermore, within one or two \ngenerations, members of all these families entered other educated professions – \nincluding in particular engineering and medicine – that have no real continuity at all \nwith old Brahman service roles.   \n 17 \n  Before expanding on the question of continuity and discontinuity, we should \nemphasise that today as in the past, parents or other senior kin are always involved in \ndecisions about young people’s education and employment, and the latter have always \nnormally taken full account of advice given to them.  Many informants told us that \ntheir fathers or uncles had guided, encouraged, persuaded or even forced them to take \na particular kind of professional training and then an appropriate job.  Thus some men \nsaid that their own personal preferences had been overruled within the family, so that \nthey had ended up as engineers or accountants, for example, even though they never \nwanted to.  We can reasonably assume that parental direction of sons was at least as \nstrong among our informants’ forebears.  In the case of women, working outside the \nhome has become commoner over the last two or three decades, so that professional \nemployment is now the norm among younger women (at least until they marry and \nhave children), whereas it was not a generation ago.  For women, ‘respectability’ and \nits implications for their marriage prospects affect employment choices far more \npowerfully than they do for men; in particular, engineering has usually been regarded \nas unsuitable for women, because it may involve working in dirty factories or remote \nconstruction sites alongside low-status, male manual workers.  For this article, \nthough, the key point is that the occupations of the men and women who have been \ndiscussed were the outcome of sets of family decisions, not just individual aspirations, \nso that the genealogies illustrate the partially planned evolution of Tamil Brahman \nemployment over the last century or so.  In some cases, family members tend to \ncluster in particular professions, such as law or engineering, for one or more \ngenerations, and shifts over time sometimes occur, such as the decline in lawyers and \nthe growth of IT professionals; in other cases, though, occupations were and are fairly \n 18 \ndiverse, which often reflects families’ attempts to respond to changing educational \nand employment opportunities, as well as personal choice.29 \n \nOld and new professions \n \nAs we have just seen, administration and law were old service professions in which \nBrahmans had always been prominent throughout India, and much the same applies to \nteaching.  Yet, as Bayly shows, ‘the spirit of Western administration wrought subtle \nchanges’.  The more rationalised colonial bureaucracy staffed by trained civil servants \nand operating at higher levels in English – the system in which colonial dewans like \nSeshia Sastri and Krishnamachari served – ensured that ‘the mystique of the old \nscribal order was slowly undermined’.30  Parallel changes took place in the law as the \ncolonial legal system developed, especially after the High Courts were established in \n1861 and the Hindu pandits formerly advising the courts were dismissed in 1864.  To \nsome extent, the law was a particularly attractive field for Brahmans (or indeed men \nof other castes) simply because it was prestigious and remunerative, and there was a \nstrong demand for the services of lawyers, especially after 1861.31  Many posts in the \ncolonial bureaucracy were also open to men with legal qualifications.  During the \nsame period, a modern educational system was progressively established as well and \nin Madras it employed large numbers of Brahman teachers.   \n A crucial aspect of all these modernising changes was, of course, that formal \nqualifications, not caste status, became the requirement for any professional position.  \nCertainly, around 1900, Brahman lawyers and bureaucrats, many with law degrees, \nwere very numerous and made up much of Madras’s rich and powerful elite, which \nmight suggest that Brahmans had an inherited affinity for law and administration.  \nAfter all, the court pandits in Madras had all been Brahmans and many members of \n 19 \nthe caste probably saw the law as their rightful domain.32  Moreover, in some families \nlegal service was a tradition.  In general, though, Brahmans dominated these \nprofessions not because they were constrained to pursue occupations traditionally \nassociated with their caste, but because so many of them had good connections with \nmen already in place and had gained the requisite qualifications.  The latter attainment \nwas plainly linked to their caste traditions of education, learning and literacy and – \nlike the Konkani Brahmans who earlier moved into the service of Shivaji’s kingdom – \nthe Tamil Brahmans ‘carried their skills and advantages with them’ as they moved \ninto the service of the colonial state.33  Yet the Brahmans’ skills were quite flexible \nand their inheritance was advantageous primarily because it enabled them to seize \nnew opportunities, rather than to continue in their old ways, as the other two principal \nlearned professions, medicine and engineering, best illustrate.34 \nWhen Madras High School was founded in 1841, proposals to establish \nmedical and civil engineering colleges were put forward too, but in the following year \nthey were rejected by the Court of Directors in London which declared them \n‘unwarranted by the state of preparation in the native community’, so that very few \n‘native pupils’ would benefit.35  Whether this rejection was justified is far from clear, \nas a medical school and a survey school providing lower-level training already \nexisted.  In any case, medical and civil engineering colleges did open in Madras in the \n1850s and, after the university was founded in 1857, legal, medical and engineering \neducation was regulated and improved; law students were taught in the university’s \nPresidency College before the Law College was founded in 1891.   \nFigures for the community background of students in the three professional \ncolleges were published intermittently in annual reports between the early 1880s and \n1904\/5.  After a gap of several years, the figures were then provided systematically \n 20 \nfrom 1916\/7 to 1938\/9.36  The number of students in the three colleges fluctuated \nconsiderably from year to year.  Between the 1880s and 1904\/5, there were always far \nmore students enrolled in law than medicine or engineering, but the excess reduced \nthereafter.  Between 1916\/7 and 1938\/9, the average enrolments were 665 students in \nlaw, 524 in medicine and 342 in engineering, but law student numbers peaked at just \nover 1,000 in 1923\/4 and then declined to around 500, whereas medical student \nnumbers rose steadily from under 300 to around 800, and engineering student \nnumbers went up and down erratically, between 200 and 500 approximately.  Here, \nthough, the Brahman proportion of students is also relevant; Brahmans, it should be \nnoted, formed about 3 per cent of the enumerated population in this period.  Among \nlaw students, the Brahman proportion varied between 70 and 80 per cent in the two \ndecades from the mid-1880s; between 1916\/7 and 1938\/9, it peaked at 78 per cent in \n1920\/1 and then fell to 49 per cent in 1938\/9.  Among engineering students, Brahmans \nwere also preponderant by the late nineteenth century; they were 74 per cent of the \ntotal in 1920\/1, but down to 40 per cent in 1938\/9 along a path similar to the law \nstudents’.  The graph for medical students is slightly different; the Brahman \nproportion grew slowly from a low base, reaching nearly 30 per cent in 1900 and a \nmaximum of 60 per cent in 1921\/2, before falling to 30 per cent in 1938\/9.  In all \nthree colleges, the decline in Brahman numbers reflected the progressive impact of \nofficial measures to reduce their domination, which started in 1921 with the \nintroduction of community quotas for government jobs.  Incidentally, from the 1890s, \nthe reports also noted regularly – as one would expect – that the majority of students \nin all three disciplines were the sons of landholders or officials, and belonged to the \n‘richer and middle’ classes.  In the Bombay Presidency, we may note, Brahmans were \n 21 \nalso greatly over-represented among students in the professional colleges, though less \nextremely than in Madras.37 \n As is well known, Hindus, especially Brahmans, have or had a traditional \nantipathy to medicine, owing to pollution from corpses and bodily fluids; dissection, a \nkey part of medical education, was particularly problematic.  In Bombay and Calcutta, \nas well as Madras, these problems arose.  But in Bombay, for instance, ‘if such an \nantipathy did exist it was not long in being surmounted’; ‘By the mid-1880s nearly a \nthird of students at Grant Medical College were Hindus, drawn mainly from the \nhigher castes, especially Brahmins’.38  The negative attitude of the ‘higher classes of \nthe native community’ was commented on in a couple of medical college reports from \nMadras (and one from Bombay) in the 1850s.39  By 1884, however, the increasing \nnumber of Brahmans was described as ‘indicating the growing decline of the \nprejudice of the highest caste of Hindus’ to modern medicine, although a dip in \nnumbers occurred a few years later.  In 1896, however, the report again noted ‘the \ngradual disappearance of the difficulties arising from caste or custom’ that deterred \nBrahmans from entering medicine and its expression of satisfaction was probably \njustified, as the continuing growth in Brahman enrolment up to 60 per cent shows.40  \nEngineering student numbers remained relatively low, mainly because \nemployment prospects were worse than in law or medicine, but proportionately \nBrahmans studied engineering almost as readily as law.  Early engineering college \nreports from Madras noted Brahman preponderance several times between 1884 and \n1905, and regretted that there were no students from the ‘artisan classes [which] \nshould have the greatest natural aptitude’ for engineering, or from non-Brahmans as a \nwhole.41  The Public Works Department was the main employer for engineering \ncollege graduates in the late nineteenth and early twentieth centuries, although \n 22 \nprejudice against Indians being promoted to senior positions was widespread \nthroughout the country, typically on the pretext that they ‘were not fit to take \nresponsibility or independent charge’.42  In the PWD in Madras, Brahmans were \nalmost inevitably prominent among Indian engineers and, notwithstanding racial \ndiscrimination, when the first Indians took up senior positions in the 1890s, several \nBrahmans were included among them.  In 1900, in all the senior grades, there were 67 \nengineers, of whom 58 (87 per cent) were Europeans, eight (12 per cent) were \nBrahmans and one (1.5 per cent) was a non-Brahman.  Until 1940, the total \ncomplement of senior engineers remained fairly steady, and between 1925 and 1940 – \nin spite of community quotas – Brahmans made up over 20 per cent of the \ncomplement.43  The PWD was not of course the only employer in Madras.  Engineers, \nincluding many Brahmans, also worked in other government departments or public-\nsector undertakings, as well as some private firms, although many engineers migrated \nto other places in India to find work, for example in Bombay, Calcutta or Jamshedpur, \nwhere the Tata company built its steel plant. \n These statistics, as well as genealogical and other evidence that we have \ncollected, show that even in the early years Tamil Brahmans were very well \nrepresented in engineering.  Unlike medicine, engineering provokes no concern about \nritual pollution, but it still lacks any traditional occupational precedent for Brahmans, \nin ostensible contrast to members of the artisan castes, as the report just quoted \nimplied.  Nevertheless, like medicine after initial reluctance, engineering was hardly \never seen as degrading by Brahmans; instead, both of them were esteemed as learned \nprofessions like the law.   \n \n 23 \nEngineering, caste and the ‘Indian mind’ \n \nEngineering in India has attracted little academic discussion among historians, but it \ndoes raise some significant issues pertinent to our discussion of Tamil Brahmans.44  \nAs we saw above, Weber implied that caste ‘traditionalism’ would discourage \nBrahmans from becoming engineers and, in a more prejudicial version, British \nengineers in India mostly shared his view.  The received wisdom was that Indians \nmade poor engineers, primarily because the ‘Indian mind’ was too inclined to \nsubjective abstraction instead of objective practicality, although an engineering \ncollege report from Bombay still hoped that the profession would ‘correct the dreamy \nand impractical tendencies of Indian students’.45 \nA couple of illustrations will suffice.  Alfred Chatterton started his career as an \nengineering professor in Madras in 1889 and was later a member of the Indian \nIndustrial Commission in 1916-18.46  Chatterton, who admired Indian historical \nachievements in science and technology, was undoubtedly better informed than many \nother British engineers.  Nevertheless, he was sceptical about Indians’ engineering \nability.  Thus Chatterton believed that a combination of factors – such as caste \nrestrictions, over-reliance on memorisation in learning, and the ‘subtle mind of the \nHindu [which] delights in philosophic speculations’ – seriously impeded progress and \nensured, among other things, a vast excess of lawyers over useful engineers.47  \nMoreover, the failure to make the colonial education system more practical is ‘largely \ndue to the characteristics of the people themselves’ and Indians in general ‘do not \npossess in any very large measure the grit and common sense which mark the \nengineer’.48  Blunter than Chatterton was Francis Spring, president and chief engineer \nof the Port Trust of Madras from 1904 to 1919, who told the Indian Industrial \n 24 \nCommission that the only Indians studying engineering were ‘young men who do not \nsee much prospect of succeeding in law’ and, furthermore, that ‘the intense internal \ndesire for accuracy’ was lacking in the Indian soul.49 \nOrientalist prejudices of this kind were widespread among British engineers \nand another Indian Industrial Commission member, the prominent nationalist Madan \nMohan Malaviya, emphatically criticised ‘the often repeated stereotype that \nEuropeans were superior in the “outer” domain of technology’, as opposed to the \n‘inner’, spiritual domain.50  Such prejudices had a real effect on engineering \nemployment, because they rationalised discrimination against Indians in the PWD and \nother organisations, which is mainly why engineering was a less attractive career than \nlaw.  Yet it also apparent that although the prejudices were expressed about Indians \nand the Indian mind in general, they were mainly shaped by assumptions about \nBrahmans or other high-caste Hindus inclined to the habit of ‘philosophic \nspeculations’, rather than artisans or other lower-caste people engaged in practical \nwork or agriculture.  Moreover, in a positive form, similar views were also widely \nexpressed by Indians emphasising their ‘spirituality’ in contrast to western \nmaterialism and, with more or less conviction, proclaiming the unity of modern \nscience and ancient religion.  Tamil Brahmans, especially those influenced by \nTheosophy, were prominent in making these arguments in Madras around 1900.51  \nYet there is little or no evidence that Tamil Brahmans, or any other Indians, whatever \ntheir religious beliefs and practices may have been, ever subscribed to the notion that \nthey lacked the right qualities for engineering owing to mental deficiencies, spiritual \npreoccupations or anything else.   \nOn the other hand, the discontinuity between engineering and earlier Brahman \nvocations is neither illusory nor trivial.  Even if relatively few Brahmans in \n 25 \nTamilnadu ever fully devoted themselves to religion, Sanskrit and scholarship in the \ndharmashastra, these did define an ideal way of life and Brahmans in general saw \ntheir role as traditional literati as an essential aspect of their cultural refinement and \ncaste superiority.  None of this Brahmanical learning was primarily focused on the \nnatural world and material reality.  Certainly, many Brahman literate service people \ndid possess skills in accounting, record-keeping, map-making or indeed astrology that \nrequired numeracy and practical techniques.  All the same, Brahman landowners were \nalmost always patronal lords of the land, not agriculturalists with practical knowledge, \nlet alone direct experience of work in the fields.52  Furthermore, technical work, \nnotably fabrication in wood, metal or stone – and the savoir-faire that goes with it – \nhas been the traditional monopoly of the low-status artisan castes and Brahmans \nregarded the artisans’ work, along with other kinds of manual labour, with disdain or \neven contempt.  Of course, as one Brahman engineer put it to us, a civil engineer is \nnot a mason cutting stones, for he is engaged in intellectual, not manual work.  Yet no \nengineer could do his job properly if he held manual work in contempt, or put \nintellectual theory above applied knowledge.  During his apprenticeship, moreover, a \nprofessional engineer must undergo practical as well as theoretical training, so that he \nknows how the manual work is actually done, even if it is mostly carried out by \nsubordinates.  To put it bluntly, an engineer who never got his hands dirty could never \nsucceed – just as a doctor who never became polluted could not.  Nonetheless, since \nthe turn of the last century, numerous Tamil Brahmans whose fathers and other \nforebears were rural landlords or priests, pandits or record-keepers – or indeed \nlawyers or bureaucrats – have become engineers who have had to acquire a practical, \nhands-on knowledge, albeit informed by college education, that more resembles the \nwork traditionally done by artisans than Brahmans. \n 26 \nIn the modern era, many Tamil Brahmans have become skilled engineers \nworking throughout India and overseas.  The most famous pioneering engineer in \nIndia, however, was undoubtedly Sir Mokshagundam Visvesvaraya (1860-1962), a \nTelugu Brahman from present-day Karnataka.  He became Mysore’s Chief Engineer \nin 1909 and then its dewan from 1912 to 1918, and laid much of the foundation for \nthe modern technological city of Bangalore.53 \nTo recapitulate, there is a real discontinuity between engineering or medicine \nand the Brahmans’ old roles and vocations, even the most practical and numerical of \nthem, which contrasts with the relative continuity evident for law or administration.  \nFor Brahmans themselves, however, unlike sociologists such as Weber, the parallel \nbetween engineering and low-status artisans’ work has rarely if ever been seen as \nsalient and, after a short period of hesitancy, nor has the ritual pollution attendant on \nmedicine been a major impediment.  Instead – for this is the crucial point – as \nmodern, English-language, credential-based professions that are well-paid and \nprestigious, law, medicine and engineering belong to the same category and all three \nlearned professions were and are deemed eminently suitable for south Indian \nBrahmans, who have typically regarded themselves as intellectually superior to other \ncommunities.  Indeed, among Tamil Brahmans today, their presumptive success in \nthese modern professions is much more commonly invoked than ritual purity or Vedic \nscholarship as a sign of their superiority over people from other castes.54 \n \nEngineering and information technology \n \nThe Tamil Brahmans’ prominence in engineering since its early days is salient for \nunderstanding their prominence in IT today, although our discussion will be very \n 27 \nbrief.  Engineering rapidly grew in popularity as a career for Tamil Brahmans – and \nmany other Indians as well – after Independence, especially because the dams, power \nstations, steel plants and heavy engineering factories built as the centrepieces of \nIndia’s industrialisation programme all required sizeable cohorts of civil, mechanical \nand electrical engineers.  By the end of the twentieth century, computer and software \nengineering had become more attractive than the old, core disciplines of engineering, \nand the IT sector was recruiting far more graduate engineers than construction or \nmanufacturing industry.55  Noteworthy, too, is that by 2009 around one-third of \nsoftware engineers employed in the leading Indian software and services companies \nwere women, whereas very few women ever worked in the older engineering \nindustries.  \nThe Indian IT industry has emerged on the world stage dramatically, which \nmay be why some fanciful explanations for its development have been proposed.  For \ninstance, several prominent commentators, as well as some Brahman IT professionals \nthemselves, claim that ancient Indian or Brahmanical traditions of abstract thought \nand pure mathematics have directly contributed to both Indian success in this field \nand the Brahmans’ leading role in it.56  In this context, Tamil Brahmans themselves \nquite often invoke one of their culture heroes, Srinivasa Ramanujan (1887-1920), as if \nhis mathematical genius were part of their hereditary birthright and thereby explained \ntheir prowess in IT. \nClaims like these are intriguing but unfounded.  It is true that high scores in \nmaths exams are required for admission to leading engineering colleges and \nmathematics does provide a good basis for the logical skills desirable in IT \nprofessionals.  Nonetheless, complex mathematics is irrelevant to the vast majority of \nthe routine business done by software and services companies in India or elsewhere.  \n 28 \nMore generally, theories postulating a link between the ancient past and the \nimmediate present ignore the IT industry’s development over thirty or forty years, \nwith foundations resting firmly on India’s scientific, technological and industrial \nmanufacturing base.57  One critical condition for IT’s growth has been the supply of \nengineering graduates, and expertise and training in computer and software \nengineering have developed from and alongside the older engineering disciplines.  \nHence engineering is crucial in the IT professionals’ pre-history and their direct \nvocational ancestors are civil, mechanical and electrical engineers.  Seated in front of \ncomputers in offices, IT professionals may look like bureaucrats and therefore like \ncontemporary reincarnations of traditional literate service people, but this is an \nillusion produced by a misunderstanding of their training and work.  The relatively \nhigh proportion of Tamil Brahmans among IT professionals is not a direct product of \ntheir old roles and vocations, for example as numerate record-keepers; rather it is a \nprolongation of their general over-representation in the modern educated professions, \nmost especially engineering. \n \nConclusion \n \nIn his article in this collection, Washbrook notes that owing to the Deshasthas’ pre-\neminence, Tamil Brahmans were poorly represented in leading positions in the \nprincipal kingdoms’ bureaucracies immediately before and after south India came \nunder British rule.  He also persuasively argues that Deshasthas may have been an \nimportant model for emulation for Tamil Brahmans, who then proceeded to displace \nthem so successfully that they came to dominate colonial administration in Madras in \nthe later nineteenth century.  As Suntharalingam observed earlier, when Brahmans \n 29 \n‘flocked to the colleges’ in the nineteenth century, ‘the pace was initially set by the \nMahratta Brahmins … and their example stimulated’ the Tamil Brahmans.58  Maybe \nthe Deshastha Madhava Rao personally inspired his friend Seshia Sastri.  But this is \njust a speculative gloss on the main argument that the Deshasthas, who had been \nhistorically more innovative, were the catalyst inspiring the conservative Tamil \nBrahmans to exploit the advantages given by their extant education and literacy to \ninvest in modern education, take up new forms of professional employment, and \nmigrate to urban areas in order to do so.   \nAs we have seen, the Tamil Brahmans’ longstanding traditions of education, \nliteracy and scholarship mean that their caste’s leading presence in the modern \nlearned professions does have ancient roots.  Yet there is no simple line of continuity \nbetween the past and present, as if caste traditionalism were determinant.  Most \nprobably, the Deshasthas were a modernising catalyst for the Tamil Brahmans, but in \nany case the latter group’s prominence in the modern professions is mainly a product \nof how their old social and cultural capital, as well as their economic capital in land, \nwere transformed through migration and urbanisation as they seized new educational \nand employment opportunities.  Often, as already mentioned, this transformation was \nthe outcome of loss of land, indebtedness or economic privation, for many Brahmans \nwere poor, not rich.  Moreover, many Brahmans – in towns and cities, as well as those \nremaining in villages – are still poor and have experienced little upward economic or \noccupational mobility.  Nonetheless, during the twentieth century, Tamil Brahmans \ncollectively came to be disproportionately dominant in many of the professions that \nare most critical for a modern economy and society, and they increasingly turned into \na predominantly urban middle-class caste.  By the end of the century, Brahman \ndominance had been much reduced and certainly the vast majority of the urban, \n 30 \neducated, professional middle class in south India is now non-Brahman.  Brahmans, \nhowever, are still over-represented in the middle class and are very numerous in some \nemployment sectors, including the IT industry that is so crucial in the contemporary \nglobal economy.  One fundamental reason for this state of affairs is that from the \nnineteenth century onwards – and more fully than any other social group in south \nIndia – the Tamil Brahmans converted their old assets into new ones so that they \ncould enter the modern, learned professions, and they have continued to build upon \nthis lead until the present day.   \n \nNotes \n \nMost of the research in Chennai in 2003-5 and among Vattima Brahmans in 2005-8 \nwas carried out by Haripriya Narasimhan, although Chris Fuller accompanied her for \npart of the time. This article was written by Fuller, although we have discussed it \ntogether extensively and it represents our joint views. We thank the Economic and \nSocial Research Council, which has supported all the research.  We also thank Polly \nO’Hanlon and David Washbrook, as well as participants in the Oxford workshop on \n‘Munshis, Pandits and Record-keepers’ and seminars at the London School of \nEconomics and Princeton University, for useful comments on earlier versions of this \narticle. \n                                                 \n1 Fuller and Narasimhan, ‘Information Technology Professionals’, p. 126 & passim. \n2 The phrase ‘service nomads’ comes from Slezkine, Jewish Century, who writes that: \n‘Modernity was about everyone becoming a service nomad: mobile, clever, articulate, \noccupationally flexible, and good at being a stranger’, p. 30.  For a brief comparison \n 31 \n                                                                                                                                            \nbetween Tamil Brahmans and Russian Jews, see Fuller and Narasimhan, ‘From \nLandlords to Software Engineers’, pp. 192-3. \n3 Weber, Economy and Society, p. 436. \n4 Weber, Religion of India, pp. 111-17. \n5 Ibid., p. 57. \n6 Subrahmanyam, ‘Institutions, Agency and Economic Change, pp. 22-6. \n7 Conlon, A Caste in a Changing World, p. 54.  See also Dharma Kumar, ‘Agrarian \nRelations’, pp. 209-11; Ludden, ‘Who Ruled Madras?’; idem., Peasant History, pp. \n89-91, 102-7; Raman, ‘Familial World’; idem., ‘Tamil Munshis’, pp. 210-5. \n8 See S. Bayly, Caste, Society and Politics, pp. 66-8, and R. Kumar, Western India, \npp. 37-8, for Deshasthas in Maharashtra; Suntharalingam, Politics and Nationalist \nAwakening, pp. 18-20, 113-14, 125-6, for Deshasthas in Madras.  The classic study of \nDeshastha local bureaucratic dominance in south India is Frykenberg, Guntur District.  \nSee also Raman, ‘Familial World’; Washbrook, ‘Scribal Cultures’. \n9 See Irschick, Politics and Social Conflict, pp. 12-19; Suntharalingam, Politics and \nNationalist Awakening, pp. 113-26. \n10 Wagoner, ‘Pre-colonial Intellectuals’, pp. 795-7; Washbrook, ‘Scribal Cultures’. \n11 From the large literature on the non-Brahman movement, see, e.g., Baker, Politics \nof South India; Barnett, Politics of Cultural Nationalism; Geetha and Rajadurai, \nTowards a Non-Brahmin Millennium; Irschick, Politics and Social Conflict; Tamil \nRevivalism; Pandian, Brahmin and Non-Brahmin; Saraswathi, Minorities in Madras \nState; Washbrook, Emergence of Provincial Politics; idem., ‘Caste, Class and \nDominance’. \n 32 \n                                                                                                                                            \n12 On the importance of Brahman businesses in Tamilnadu, see Harriss, ‘The Great \nTradition Globalizes’.  The range of Brahman occupations is discussed with \nbiographical sketches by Chuyen, Who is a Brahmin?, ch. 5. \n13 Fuller, ‘Brahmins and Brahminical values, pp. 33-5; Fuller and Narasimhan, \n‘Information technology professionals’, pp. 142-3. \n14 Dupuis, Madras, p. 51. \n15 Fuller and Narasimhan, ‘The Agraharam’. \n16 Fuller and Narasimhan, ‘From Landlords to Software Engineers’. \n17 Suntharalingam, Politics and Nationalist Awakening, pp. 58, 66. \n18 Ibid., pp. 65, 69. \n19 Some of our information about Seshia Sastri’s life derives from Aiyar, Sashiah \nSastri. \n20 Suntharalingam, Politics and Nationalist Awakening, p. 78. \n21 On Seshia Sastri in Pudukkottai, see Dirks, Hollow Crown, pp. 389-90; Waghorne, \nRaja’s Magic Clothes, ch. 2. \n22 Fuller and Narasimhan, ‘Companionate marriage’, pp. 743-4. \n23 http:\/\/www.vangalheritage.com\/index.htm. We thank V. L. Vijayaraghavan, \ncompiler of the website, for his assistance. \n24 Washbrook, Emergence of Provincial Politics, p. 235. \n25 Ibid., p. 239.  See also Price, ‘Ideology and Ethnicity’, on Bashyam Aiyangar and \nother leading Brahman lawyers in Madras. \n26 Pandian, Brahmin and Non-Brahmin, pp. 68-9. \n27 Lingat, Classical Law, pp. 207-23.  Cf. S. Bayly, Caste, Society and Politics, ch. 2 \n(‘The “Brahman raj”: kings and service people, c. 1700-1830’). \n 33 \n                                                                                                                                            \n28 Two examples (contemporaries of Thiruvenkatachari), who were both sons of \nlawyers, are C. V. Kumaraswami Sastri, whose ancestors included Sanskrit scholars, \nand V. Krishnaswami Aiyar, whose ancestor was a minister in the Tanjore kingdom; \nsee Price, ‘Ideology and Ethnicity’, pp. 164-5. \n29 The evolution of occupations among Tamil Brahmans resembles that found among \nother Brahmans, such as the north Indian Kanya-Kubja Brahmans, or indeed among \nsome high-status non-Brahmans, such as the Kayasths of Hyderabad; see Khare, \nChanging Brahmans, pp. 4-5, 116-28, 174-90; Leonard, Social History, pp. 161-76, \n230-50.  In many respects, therefore, the Tamil Brahmans are not unique and this \narticle is not intended to imply that they are. \n30 C. A. Bayly, Indian Society, pp. 153-4. \n31 Misra, Indian Middle Classes, pp. 324-32; Seal, Emergence of Indian Nationalism, \npp. 123-30. \n32 On south Indian pandits, see Derrett, Religion, Law and the State, pp. 230, 257-9. \n33 Cf. O’Hanlon and Minkowski, ‘What Makes People Who They Are?’, p. 387. \n34 On medicine and engineering, see Misra, Indian Middle Classes, pp. 333-7; Seal, \nEmergence of Indian Nationalism, pp. 120-2.  On the history of engineering education \nin Madras, see Ambirajan, ‘Science and Technology Education’.   \n35 Selections from the Records of the Madras Government, II, Papers Relating to \nPublic Instruction, 1855, p. 82; Appendix L.L., pp. ccxviii-ccxxii. \n36 See annual Report on Public Instruction in the Madras Presidency (RPIMad.).  In \nthe reports from 1916\/7 to 1921\/2 and 1923\/4, consistent student statistics appeared in \nvol. I, General Tables, Table 3(a); in 1922\/3 and 1924\/5 to 1938\/9, they appeared in \nvol. II, part 2, A-Subsidiary Tables for Indians, Table 1(b). \n 34 \n                                                                                                                                            \n37 In the annual Report on Public Instruction in the Bombay Presidency (RPIBom.), \nconsistent student statistics appeared in the reports from 1923\/4 to 1942\/3 in \nAppendix I.  Law student numbers fluctuated considerably during this period from \nunder 400 to over 700; medical student numbers increased from around 200 to 400; \nengineering student numbers stayed below 100 and averaged around 80.  The \nBrahman proportion of students fluctuated with no noticeable trend (unlike Madras); \nthe median proportions were 46, 35 and 41 per cent for law, medicine and engineering \nrespectively.  In 1931, Brahmans were 3.5 per cent of Bombay Presidency’s \npopulation.  No caste breakdown of students was provided by Bengal’s public \ninstruction reports. \n38 Arnold, Science, Technology and Medicine, p. 64; see also Deepak Kumar, Science \nand the Raj, pp. 114, 134; Seal, Emergence of Indian Nationalism, pp. 120. \n39 RPIMad., 1854\/5, p. 42; 1858\/9, pp. 77-8; RPIBom., 1857\/8, p. 70. \n40 RPIMad., 1883\/4, p. 57; 1887\/8, p. 63; 1895\/6, pp. 40-1. \n41 RPIMad., 1883\/4, p. 59; 1901\/2, p. 20; 1902\/3, p. 14; 1904\/5, p. 12 (Brahmans \npreponderant); 1887\/8, p. 66 (lack of artisan classes); 1897\/8, p. 50 (lack of non-\nBrahmans).   \n42 A. Kumar, ‘Colonial Requirements’, p. 228. \n43 Fuller and Narasimhan, ‘From Landlords to Software Engineers’, p. 180, n. 5; cf. \nIrschick, Tamil Revivalism; p. 69, citing different data. \n44 On engineering in India, see Ambirajan, ‘Science and Technology Education’; \nArnold, Science, Technology and Medicine, pp.105-24; A. Kumar, ‘Colonial \nRequirements’; Deepak Kumar, Science and the Raj, pp. 136-43. \n45 RPIBom., 1870\/1, p. 70. \n 35 \n                                                                                                                                            \n46 On the Indian Industrial Commission, see Dewey, ‘Government of India’s “New \nIndustrial Policy”’, 1900-1925’; Visvanathan, Organizing for Science, ch. 3. \n47 Chatterton, Industrial Evolution, pp. 13-14, 19, 26. \n48 Ibid., p. 359. \n49 Visvanathan, Organizing for Science, p. 44. \n50 Prakash, Another Reason, p. 189; cf. Visvanathan, Organizing for Science, p. 45. \n51 Prakash, Another Reason, pp. 75-85; van der Veer, Imperial Encounters, pp. 80-2. \n52 Fuller and Narasimhan, ‘From Landlords to Software Engineers’, pp. 171-2. \n53 For Visvesvaraya’s career, see his autobiography, Memoirs; on Visvesvaraya and \nBangalore, see Heitzman, Network City, pp. 36-9, 60-2, 222-4, 278-9;  cf. also \nPrakash, Another Reason, pp. 195-8; Visvanathan, Organizing for Science, pp. 107-9. \n54 Hence self-definitions of ‘Brahmanhood’ among Tamil Brahmans have been \nchanging, as they comparably did among Konkani Brahmans in the early modern \nperiod; see O’Hanlon and Minkowski, ‘What Makes People Who They Are?’. \n55 In 1949\/50, India produced about 5,500 graduates in engineering and technology; \nsee Misra, Indian Middle Classes, p. 334.  By 1970, the annual output of engineering \ngraduates was around 20,000 and by 1990, 60,000; see World Bank, India: Scientific \nand Technical Manpower Development in India, Report no. 20416-I, 2000, p. 46, Fig. \n1.2.  According to the All India Council for Technical Education, the output was \nnearly 465,000 in 2004\/5; see report on \nhttp:\/\/search.rediff.com\/money\/2006\/jun\/09bspec.htm, 2006.  The accuracy and \ninternational comparability of AICTE data have been questioned, e.g., by the World \nBank report.   \n56 For example, Amartya Sen, in a keynote address to the National Association of \nSoftware and Services Companies in Mumbai in 2007, traced connections between \n 36 \n                                                                                                                                            \nthe IT industry’s success and the traditional Indian ‘love of mathematics’, as well as \n‘a tradition of being thrilled by intellectual altercations’; see The Hindu, e-paper, 16 \nFebruary 2007; http:\/\/www.hindu.com\/nic\/itindia.htm. \n57 See Upadhya and Vasavi, Work, Culture, and Sociality, pp. 9-12; idem.,‘Outposts’, \npp. 13-14, and p. 41, n.1, for further references on the IT industry’s development. \n58 Suntharalingam, Politics and Nationalist Awakening, pp. 113-14. \n  \nReferences \n \nAiyar, B. V. Kamesvara. Sir A. Sashiah Sastri, K.C.S.I., an Indian Statesman: A \nBiographical Sketch, Madras, 1902. \nAmbirajan, S. ‘Science and Technology Education in South India’, in Roy MacLeod \nand Deepak Kumar, eds, Technology and the Raj: Western Technology and \nTechnical Transfers to India 1700-1947, New Delhi, 1995, pp. 112-33. \nArnold, David. Science, Technology and Medicine in Colonial India, Cambridge, \n2000. \nBaker, C. J. The Politics of South India, 1920-1937, Cambridge, 1976. \nBarnett, Marguerite R. The Politics of Cultural Nationalism in South India, Princeton, \n1976. \nBayly, C. A. Indian Society and the Making of the British Empire, Cambridge, 1988. \nBayly, Susan. Caste, Society and Politics in India from the Eighteenth Century to the \nModern Age, Cambridge, 1999. \nChatterton, Alfred. Industrial Evolution in India, Madras, n.d. [1912]. \nChuyen, Gilles. Who is a Brahmin? The Politics of Identity in India, New Delhi, \n2004. \nConlon, Frank F. A Caste in a Changing World: the Chitrapur Saraswat Brahmans, \n1700-1935, Berkeley, 1977. \nDerrett, J. Duncan M. Religion, Law and the State in India, London, 1968. \nDewey, Clive. ‘The Government of India’s “New Industrial Policy”, 1900-1925: \nFormation and Failure’, in K. N. Chaudhuri and Clive J. Dewey, eds, Economy \nand Society: Essays in Indian Economic and Social History, Delhi, 1979, pp. \n215-57.  \n  \nDirks, Nicholas B. The Hollow Crown: Ethnohistory of an Indian Kingdom, \nCambridge, 1987. \nDupuis, Jacques. Madras et le Nord du Coromandel: Étude des Conditions de la Vie \nIndienne dans un Cadre Géographique, Paris, 1960. \nFrykenberg, Robert E. Guntur District, 1788-1848: A History of Local Influence and \nCentral Authority in South India, Oxford, 1965.  \nFuller, C. J. ‘The Brahmins and Brahminical values in Modern Tamilnadu’, in \nRamachandra Guha and Jonathan Parry (eds), Institutions and Inequalities: \nEssays in Honour of André Béteille, Delhi, 1999, pp. 30-55. \nFuller, C. J., and Haripriya Narasimhan. ‘Information Technology Professionals and \nthe New-rich Middle Class in Chennai (Madras)’, Modern Asian Studies, Vol. \n41, 2007, pp. 121-50. \n––––. ‘Companionate Marriage in India: The Changing Marriage System in a Middle-\nclass Brahman Subcaste’, Journal of the Royal Anthropological Institute (n.s.), \nVol. 14, 2008, pp. 736-54. \n––––. ‘From Landlords to Software Engineers: Migration and Urbanization among \nTamil Brahmans’, Comparative Studies in Society and History, Vol. 50, 2008, \npp. 170-96. \n––––. ‘The Agraharam: The Transformation of Social Space and Brahman Status in \nTamilnadu during the Colonial and Postcolonial Periods’, in Michael \nBergunder, Heiko Frese and Ulrike Schröder, eds, Ritual, Caste, and Religion \nin Colonial South India (Neue Hallesche Berichte; 9), Halle, 2010. \nGeetha, V., and S. V. Rajadurai. Towards a Non-Brahmin Millennium: from Iyothee \nThass to Periyar, Calcutta, 1998. \n  \nHarriss, John. ‘The Great Tradition Globalizes: Reflections on Two Studies of “the \nIndustrial Leaders” of Madras’, Modern Asian Studies, Vol. 37, 2003, pp. 327-\n62. \nHeitzman, James. Network City: Planning the Information Society in Bangalore, \nDelhi, 2004. \nIrschick, Eugene F. Politics and Social Conflict in South India: the Non-Brahman \nMovement and Tamil Separatism, 1916-1929, Berkeley, 1969. \n––––. Tamil Revivalism in the 1930s, Madras, 1986. \nKhare, R. S. The Changing Brahmans: Associations and Elites among the Kanya-\nKubjas of North India, Chicago, 1970. \nKumar, Arun. ‘Colonial Requirements and Engineering Education: the Public Works \nDepartment, 1847-1947’, in Roy MacLeod and Deepak Kumar, eds, \nTechnology and the Raj: Western Technology and Technical Transfers to \nIndia 1700-1947, New Delhi, 1995, pp. 216-32. \nKumar, Deepak. Science and the Raj: A Study of British India, Delhi, 2006. \nKumar, Dharma. ‘Agrarian Relations: South India’, in Dharma Kumar and Meghnad \nDesai, eds, The Cambridge Economic History of India, vol. 2: c. 1757-c. 1970, \nCambridge, 1983, pp. 207-41.  \nKumar, Ravinder. Western India in the Nineteenth Century: A Study in the Social \nHistory of Maharashtra, London, 1968. \nLeonard, Karen I. Social History of an Indian Caste: the Kayasths of Hyderabad, \nBerkeley, 1978. \nLingat, Robert. The Classical Law of India, Berkeley, 1973. \nLudden, David. ‘Who Really Ruled Madras Presidency?’ Indian Economic and Social \nHistory Review, Vol. 15, 1978, pp. 517-9. \n  \n––––. Peasant History in South India, Princeton, 1985. \nMisra, B.B. The Indian Middle Classes: Their Growth in Modern Times, London, \n1961. \nO’Hanlon, Rosalind, and Christopher Minkowski. ‘What Makes People Who They \nAre? Pandit Networks and the Problem of Livelihoods in Early Modern \nWestern India’, Indian Economic and Social History Review, Vol. 45, 2008, \npp. 381-416. \nPandian, M. S. S. Brahmin and Non-Brahmin: Genealogies of the Tamil Political \nPresent, Delhi, 2007. \nPrakash, Gyan. Another Reason: Science and the Imagination of Modern India, Delhi, \n2000. \nPrice, Pamela G. ‘Ideology and Ethnicity under British Imperial Rule: “Brahmans”, \nLawyers and Kin-caste Rules in Madras Presidency’, Modern Asian Studies, \nVol. 23, 1989, pp. 151-77. \nRaman, Bhavani. ‘The Familial World of the Company’s kacceri in Early Colonial \nMadras’, Journal of Colonialism and Colonial History, Vol. 9, No. 2, 2008. \n––––. ‘Tamil Munshis and Kacceri Tamil under the Company’s Document Raj in \nEarly-nineteenth-century Madras’, in Thomas R. Trautmann, ed., The Madras \nSchool of Orientalism: Producing Knowledge in Colonial South India, Delhi, \n2009, pp. 209-32. \nReport on Public Instruction in the Bombay Presidency (annual), Bombay, 1857\/8-\n1942\/43.   \nReport on Public Instruction in the Madras Presidency (annual), Madras, 1854\/5-\n1939\/40.   \n  \nSaraswathi, S. Minorities in Madras State: Group Interests in Modern Politics, Delhi, \n1974. \nSeal, Anil. The Emergence of Indian Nationalism: Competition and Collaboration in \nthe Later Nineteenth Century, Cambridge, 1968. \nSelections from the Records of the Madras Government, II, Papers Relating to Public \nInstruction, Madras, 1855. \nSlezkine, Yuri. The Jewish Century, Princeton, 2004. \nSubrahmanyam, Sanjay. ‘Institutions, Agency and Economic Change in South Asia: \nA Survey and Some Suggestions’, in Burton Stein and Sanjay Subrahmanyam, \neds, Institutions and Economic Change in South Asia, Delhi, 1996, pp. 14-47. \nSuntharalingam, R. Politics and Nationalist Awakening in South India, 1852-1891, \nTucson, 1974. \nUpadhya, Carol, and A. R. Vasavi. Work, Culture, and Sociality in the Indian IT \nIndustry: A Sociological Study, final report to Indo-Dutch Programme for \nAlternatives to Development, 2006 (online: \nhttp:\/\/www.iisc.ernet.in\/nias\/idpad.htm). \n––––. ‘Outposts of the Global Information Economy: Work and Workers in India’s \nOutsourcing Industry’, in Carol Upadhya and A. R. Vasavi, eds, In an Outpost \nof the Global Economy: Work and Workers in India’s Information Technology \nIndustry, New Delhi, 2008, pp. 9-49. \nvan der Veer, Peter. Imperial Encounters: Religion and Modernity in India and \nBritain, Princeton, 2001. \nVisvanathan, Shiv. Organizing for Science: The Making of an Industrial Research \nLaboratory, Delhi, 1985. \nVisvesvaraya, M. Memoirs of My Working Life, Bangalore, 1951. \n  \nWaghorne, Joanne P. The Raja’s Magic Clothes: Re-visioning Kingship and Divinity \nin England’s India, University Park, PA, 1994. \nWagoner, Phillip B. ‘Precolonial Intellectuals and the Production of Colonial \nKnowledge’, Comparative Studies in Society and History, Vol. 45, 2003, pp. \n783-814. \nWashbrook, D. A. The Emergence of Provincial Politics: the Madras Presidency, \n1870-1920. Cambridge, 1976. \n––––. ‘Caste, Class and Dominance in Modern Tamil Nadu: Non-Brahmanism, \nDravidianism and Tamil Nationalism, in Francine R. Frankel and M. S. A. \nRao, eds, Dominance and State Politics in Modern India: Decline of a Social \nOrder, Delhi, 1989, Vol. 1, pp. 204-64. \n––––. ‘Scribal Cultures and the Maratha Brahmin Model in South India’, Indian \nEconomic and Social History Review \nWeber, Max. Economy and Society: An Outline of Interpretive Sociology, Berkeley, \n1978. \n––––. The Religion of India: The Sociology of Hinduism and Buddhism, New York, \n1958. \nWorld Bank. India: Scientific and Technical Manpower Development in India, Report \nno. 20416-I, Washington, D.C., 2000. \n \n"}