{"doi":"10.1109\/IWAT.2005.1461087","coreId":"101783","oai":"oai:epubs.surrey.ac.uk:1214","identifiers":["oai:epubs.surrey.ac.uk:1214","10.1109\/IWAT.2005.1461087"],"title":"An Adaptive Antenna Employing Genetic Algorithm","authors":["Laohapensaeng, C","Free, C","Krairiksh, M"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-01-01","abstract":"<p>This article simplifies the complexity of an adaptive antenna by employing the genetic algorithm. The system requires only the error signal and the phase-shifters in the discrete value to form an antenna pattern. An adaptive antenna with two elements and sixteen discrete steps of phase shifter is used. The instantaneous sample of an error signal is used as the cost function, which is minimized by using the genetic algorithm. Numerical results show that this antenna can improve signal to noise ratio in excess of 15 dB.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1214<\/identifier><datestamp>\n      2017-10-31T14:01:04Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1214\/<\/dc:relation><dc:title>\n        An Adaptive Antenna Employing Genetic Algorithm<\/dc:title><dc:creator>\n        Laohapensaeng, C<\/dc:creator><dc:creator>\n        Free, C<\/dc:creator><dc:creator>\n        Krairiksh, M<\/dc:creator><dc:description>\n        <p>This article simplifies the complexity of an adaptive antenna by employing the genetic algorithm. The system requires only the error signal and the phase-shifters in the discrete value to form an antenna pattern. An adaptive antenna with two elements and sixteen discrete steps of phase shifter is used. The instantaneous sample of an error signal is used as the cost function, which is minimized by using the genetic algorithm. Numerical results show that this antenna can improve signal to noise ratio in excess of 15 dB.<\/p><\/dc:description><dc:date>\n        2005-01-01<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1214\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Laohapensaeng, C, Free, C and Krairiksh, M  (2005) An Adaptive Antenna Employing Genetic Algorithm  In: IWAT 2005. IEEE International Workshop on Antenna Technology: Small Antennas and Novel Metamaterials, 2005..     <\/dc:identifier><dc:relation>\n        10.1109\/IWAT.2005.1461087<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1214\/","10.1109\/IWAT.2005.1461087"],"year":2005,"topics":[],"subject":["Conference or Workshop Item","NonPeerReviewed"],"fullText":"AN ADAPTIVE ANTENNA EMPLOYING GENETIC ALGORITHM \nC. Laohapensaeng’, C. Free’ and M.Krairiksh2 \n‘MSRG Research Group \nUniversity of Surrey, Guildford GU2 7XH,UR \nEmail: c-laohapensaeng@hotmail.com \nT e I . 4 0  1483 686108. Fax. +440 1483 689404 \n‘Faculty of Engineering and Research Center for \nCommunications and Information Technology \nKing Mongkut’s hstitute of Technology Ladkrabang \nBangkok 10520, Thailand \nEmail: kkmonai @ kmi t I .  ac . th \nAbstract \nThis article simplifies the complexity of an adaptive antenna by employing the \ngenetic algorithm. The system requires only the error signal and the phase-shifters in the \ndiscrete value to form an antenna pattern. An adaptive antenna with two elements and sixteen \ndiscrete steps of phase shifter is used. The instantaneous sample of an error signal is used as \nthe cost function, which is minimized by using the genetic algorithm. Numerical results show \nthat this antenna can improve signal to noise ratio in excess of 15 dB. \n1.Introduction \nNowadays, adaptive antenna plays a key role in improving the signal quality in  the \nwireless communication by pointing main beam of the antenna pattern toward the desired \nsignal and placing nulls in the interference source directions. The famous articles that explain \nabout an application of the adaptive antenna to the wireless communication have been \npublished by many authors such as Godara[l-2], and basic theoretical investigation can be \nfound in [3,43. Although the adaptive antenna can provide excellent performance, however it \nis very expensive and complicate in hardware design. Recently, R.L.Haupt [5J proposed an \nadaptive antenna employing the genetic algorithm. It has a unique feature that requires only \nthe discrete phase-shifters to serve as the weights to form an antenna pattern. Thus, i t  leads us \nto the simple and low cost system. Nevertheless, this system has several limitations on some \napplications in which the direction of desired signal must be known. Therefore, i t  is not \nsuitable for some applications, which are based on the low cost design and blind in direction \nof arrival of signal such as TV reception, smart cars, mobile handset and etc. In order to \nsupport these applicaiions, this article extends the study on an adaptive antenna employing the \ngenetic algorithm in blind direction environment. \n2.Adaptive antenna \nThe diagram of an adaptive antenna using genetic algorithm (AAGA) and the \ncoordinate system are shown in Fig. 1. It is formed by N antennas along the z axis which are \nused to feed the phase-shifters. Each of these phase-shifters has the value in discrete form. \nThe microprocessor is used to calculate the certain discrete vaIue of phase-shifters in  order to \nform the antenna patterns. The cost function, which can be defined by several terms, must be \nused as the input data to the microprocessor for calculating the value of phase-shifters. In this \nwork, the instantaneous square of the error signal ( ~ ’ ( k ) )  is considered as the cost function \nand minimized by using the genetic algorithm [6].The advantage of AAGA over the typical \nadaptive antenna can be described as follow. \nTypical algorithms for calculation of the value of weights are based on the gradient \nmethod, such as Least Mean Square (LMS). This algorithm requires the error signal as the \ncost function, which is obtained from the square of the difference between the reference \nsignal and the array output signal in addition to the covariance matrix. It is formed from the \n343 \n0-7803-8842-9\/05\/S$20.00 (EJ 2005 IEEE \nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:03 from IEEE Xplore.  Restrictions apply. \nIEEE International Workshop on Antenna Technology \nsignal received at each antenna element. Thus, it is very expensive due to the requirement the \nseveral high-speed analog to digital converters. In addition it requires the sophisticated \ncalibration for the precision value of the complex weights. However, for the case of AAGA \nonly the cost function (error signal) is required for calculating the value of weights and the \nprecision of the value of the weight is not seriously restricted. Thus the sophisticated \ncalibration is not required and results in the simple and low cost system design. \nFig.1 Diagram of an adaptive antenna \nI \n3. Results \nTo demonstrate the operation of the AAGA in the blind direction environment, two \nsignals SI and Sz are assumed to arrive the antenna in the same plane in the direction of 50 \ndegree and 100 degree, respectively. In this assumption SI is the desired signal while Sz is the \ninterference signal. The power signal of Si is 3dI3 higher than S,. The number of array \nelements is two. The spacing between the elements is 0.5 A ,  The value of each discrete phase- \nshifters are divided into 16 steps. In the genetic algorithm, we begin with 8 chromosomes. In \neach chromosome there are 8 random bits, Only the four best chromosomes are kept for \nmating in the genetic algorithm process. \n0.8 O.gl I \n0.7 1 \n1 \n-0.1 1 I \n0 50 100 150 zoo 250 \nSample Time \nFig.2 Error signal versus sample time. \n344 \nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:03 from IEEE Xplore.  Restrictions apply. \nSmall Antennas and Novel MetaMaterials \nFigure 2 shows the E ’ ( & )  (Instantaneous MSE) versus the sample time. It is obvious that after \n80 samples or around 10 GA generations of the genetic algorithm process, the optimum \nantenna pattem can be obtained. The value of E2(k)is lower than IO%. Nevertheless, it does \nnot equal zero since the antenna has the limited value of the phase-shifter. Thus, it cannot \ncompletely form an antenna pattern such that placing the null in the direction of interference \nsignal. Figure 3 shows the polar diagram of the antenna pattern when the sample time is 240 \nor 30 GA generation. From the figure, the antenna can point the main beam toward the \ndesired direction completely and place null slightly shift from the direction of interference \nsignal due to the limited value of the phase-shifter as mentioned above. However, i t  indicates \nthat the adaptive antenna employing genetic algorithm can improve the signal quality by \ntrying to form an antenna pattem that reduces the interference signal. \n2m \nFig.3 Antenna pattem of the 30’ CA generation \nTo understand the characteristic of the adaptation of antenna pattern of the AAGA, Figure 4 \nshows the optimum antenna pattern of each GA generation versus the GA generation. It \nshows that an adaptive antenna begins with pointing main beam toward the undesired \ndirection (100 degree) while placing null in the direction of desired source (50 degree). When \nthe GA generation is around 10 GA generation or 80 samples time the adaptive antenna can \nadapt the main bcam toward the desired source. \nFig4 Antenna pattem versus the generation \nOne of the parameters which can explain the ability in receiving signal in any direction of the \nantenna is the antenna directivity [7]. Thus, in order to investigate the ability receiving signal \n345 \nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:03 from IEEE Xplore.  Restrictions apply. \nIEEE International Workshop on Antenna Technology \nof the adaptive antenna employing genetic algorithm. The term directivity ratio which is the \nratio of directivity in the desired direction to the directivity in the interference direction is \ncalculated. The graph of directivity ratio versus sample time is shown in Fig.5. We can see \nthat the ability to receive. signal of the adaptive antenna in the desired direction is around \n18dB higher than interference direction after the adaptation of the antenna pattern is \naccomplished. \n0 50 1 DO 150 200 250 \nSample Time \nFig.5 Directivity ratio versus the sample time \nThe improvement of the signal quality with the adaptive antenna can’be expressed by the \ncomparison between the signal to interference ratio (SIR) of the array output and the array \ninput. The signal to interference ratio at the array output can be determined by multiplying the \ndirectivity ratio by the SIR of the array input (here is 3dB). Thus, the SIR of the array output \nis 21dB and the improvement of the signal quality is 18dB, respectively. \n4.Conclusion \nThis article presents the preliminary studies on an adaptive antenna employing \ngenetic algorithm. This antenna system requires only array output to construct the cost \nfunction. In addition, phase-shifters in discrete value form are used. To investigate the \noperation of this antenna, an adaptive antenna with two elements and sixteen discrete steps of \nphase-shiftets is considered. Two signals consisting of the desired signal and the interference \nsignal are assumed to arrive the antenna in the same plane. Numerical results show that this \nantenna system provides a satisfactory performance in forming antenna pattern. After the \nantenna pattern forming is accomplished, the SIR is excess of 15 dB can be improved. \n5,References \n[ I ]  L.C. Godara, “Appdication of Antenna Array to Mobile Communications, Part I: \nPerformance Improvement, Feasibility, and system considerations,” Proc. IEEE, ~01.85, \n[2] L.C. Godara, “Appdication of Antenna Array to Mobile Communications, Part 11: Beam- \nForming and Direction of Arrival Consideration,” Proc. IEEE, ~01.85, No. 4, pp. 1195- \n1245, August 1997. \nNO. 4, pp. 1029-1060, July 1997. \n[ 3 ]  J.E.Hudson, Adaptive Principle. Peter Peregrinus Ltd., 199 1. \n[4] R.T. Compton, Jr, Adaptive Antenna Concepts and Perfurmance. Prentice Hall, 1988. \n[SI R.L. Haupt, “PhaeOnly Adaptive Nulling with a Genetic algorithm,” IEEE Trans. \n[6] R.L. Haupt, “An irtroduction to genetic algorithms for electromagnetics,” IEEE Antenna \n[7] C.A. Balanis, Antenna Theory Analysis and Design. John Wiley & Sons, 1997. \nAntennas Propagat., vol. 45, No. 6, pp. 1009-1015, June 1997. \nandpropagation Magazine,” wl. 37, No. 2, pp. 7-15, Apnl 1995. \n346 \nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:03 from IEEE Xplore.  Restrictions apply. \n"}