{"doi":"10.1111\/j.1539-6924.2008.00999.x","coreId":"140986","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5235","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5235","10.1111\/j.1539-6924.2008.00999.x"],"title":"Work-related road safety: An analysis based on U.K. bus driver performance","authors":["Dorn, Lisa","af Wahlberg, Anders E."],"enrichments":{"references":[{"id":37923413,"title":"A statistical analysis of rural Ontario traffic accidents using induced exposure data. Accident Analysis and Prevention","authors":[],"date":"1969","doi":"10.1016\/0001-4575(69)90080-3","raw":"Carr, B. R., 1969. A statistical analysis of rural Ontario traffic accidents using induced exposure data. Accident Analysis and Prevention 5, 343-357.","cites":null},{"id":37923407,"title":"Accident liability of car drivers: follow-up study.","authors":[],"date":"1995","doi":null,"raw":"Maycock, G.,  Lester, J., 1995. Accident liability of car drivers: follow-up study. In G. B. Grayson (Ed.) Behavioural Research in Road Safety V, pp. 106-120. Crowthorne: Transport Research Laboratory.","cites":null},{"id":37923348,"title":"Accidents among older London Transport drivers; an analysis.","authors":[],"date":"1961","doi":null,"raw":"Spratling,  F.  H.,  1961.  Accidents  among  older  London  Transport  drivers;  an analysis. British Transport Review, 172-184.","cites":null},{"id":37923334,"title":"Age related changes in drivers’ crash risk and crash type.","authors":[],"date":"1998","doi":"10.1016\/s0001-4575(97)00098-5","raw":"Ryan, G. A., Legge, M., Rosman, D., 1998. Age related changes in drivers’ crash risk and crash type. Accident Analysis and Prevention 30, 379-387.","cites":null},{"id":37923347,"title":"An analysis of accident data for franchised public buses in Hong Kong. Accident Analysis and Prevention","authors":[],"date":"1985","doi":"10.1016\/0001-4575(85)90089-2","raw":"Evans, W. A., Courtney, A. J., 1985. An analysis of accident data for franchised public buses in Hong Kong. Accident Analysis and Prevention 17, 355-366.","cites":null},{"id":37923373,"title":"An assessment of driver age on traffic accident involvement using log-linear models. Accident Analysis and Prevention","authors":[],"date":"1998","doi":"10.1016\/s0001-4575(98)00038-4","raw":"Abdel-Aty, M. A., Chen, C. L., Schott, J. R., 1998. An assessment of driver age on traffic accident involvement using log-linear models. Accident Analysis and Prevention 30, 851-861.","cites":null},{"id":37923345,"title":"Changes in collision rates among novice drivers during the first months of driving.","authors":[],"date":"2003","doi":"10.1016\/s0001-4575(02)00047-7","raw":"Mayhew, D. R., Simpson, H. M., Pak, A., 2003. Changes in collision rates among novice drivers during the first months of driving.  Accident Analysis and Prevention 35, 683-691.","cites":null},{"id":37923432,"title":"Characteristics of low speed accidents with buses in public transport.","authors":[],"date":"2002","doi":"10.1016\/s0001-4575(01)00063-x","raw":"af Wåhlberg, A. E., 2002b. Characteristics of low speed accidents with buses in public transport. Accident Analysis and Prevention 34, 637-647.","cites":null},{"id":37923343,"title":"Characteristics of traffic crashes among young, middle-aged, and older drivers.","authors":[],"date":"1999","doi":"10.1016\/s0001-4575(98)00061-x","raw":"McGwin, G., Brown, D. B., 1999.  Characteristics of traffic crashes among young, middle-aged, and older drivers. Accident Analysis and Prevention 31, 181–198.","cites":null},{"id":37923429,"title":"Crash involvement of drivers with multiple crashes.","authors":[],"date":"2006","doi":"10.1016\/j.aap.2005.11.011","raw":"Chandraratna, S., Stamatiadis, N., Stromberg, A., 2006. Crash involvement of drivers with multiple crashes. Accident Analysis & Prevention 38, 532-541.","cites":null},{"id":37923439,"title":"Culpable versus non-culpable traffic accidents; what is wrong with this picture?","authors":[],"date":"2007","doi":"10.1016\/j.jsr.2007.01.013","raw":"af Wåhlberg, A. E., Dorn, L. 2007. Culpable versus non-culpable traffic accidents; what is wrong with this picture? Journal of Safety Research 38, 453-459.  24","cites":null},{"id":37923331,"title":"Differential accident involvement of bus drivers.","authors":[],"date":"2005","doi":"10.1080\/13669870802488891","raw":"af Wåhlberg, A. E., 2005. Differential accident involvement of bus drivers. In L. Dorn (Ed.)  Driver  Behaviour  and  Training,  Volume  II,  pp.  383-391.  Aldershot:  Ashgate. Second International Conference on Driver Behaviour and Training. Edinburgh 15-17 November, 2005.   18","cites":null},{"id":37923326,"title":"Differential accident involvement: A literature survey.","authors":[],"date":"1983","doi":null,"raw":"Golding, A. P., 1983. Differential accident involvement: A literature survey. Council for Scientific and Industrial Research Reports, PERS 356: 44.","cites":null},{"id":37923431,"title":"Driver health and crash involvement: A case-control study.","authors":[],"date":"2006","doi":"10.1016\/j.aap.2005.06.018","raw":"Sagberg, F., 2006. Driver health and crash involvement: A case-control study. Accident Analysis and Prevention 38, 28-34.","cites":null},{"id":37923406,"title":"Driver workload during different driving maneuvers.","authors":[],"date":"1990","doi":"10.1016\/0001-4575(90)90019-h","raw":"Hancock, P. A., Wulf, G., Thom, D., Fassnacht, P., 1990. Driver workload during different driving maneuvers. Accident Analysis and Prevention 22, 281-290.","cites":null},{"id":37923434,"title":"Driver’s mental representations: Experimental study and training","authors":[],"date":"2003","doi":null,"raw":"Bailly, B., Bellet, T., Goupil, C., 2003. Driver’s mental representations: Experimental study and training perspectives. In. L. Dorn (ed). Driver Behaviour and Training. Ashgate, UK.","cites":null},{"id":37923410,"title":"Evaluation of driving performance in patients with juvenile macular dystrophies.","authors":[],"date":"1993","doi":"10.1001\/archopht.1993.01090020061024","raw":"Szlyk, J. P., Severing, K., Fishman, G. A., Alexander, K. R., Viana, M., 1993. Evaluation of driving performance in patients with juvenile macular dystrophies. Archives of Ophthalmology 111, 207-212.","cites":null},{"id":37923333,"title":"Exposure and experience are a confounded nuisance in research on driver behaviour.","authors":[],"date":"1982","doi":"10.1016\/0001-4575(82)90012-4","raw":"Brown, I. D., 1982. Exposure and experience are a confounded nuisance in research on driver behaviour. Accident Analysis and Prevention 14, 345-352.","cites":null},{"id":37923408,"title":"Forgetting near-accidents: The roles of severity, culpability and experience in the poor recall of dangerous driving situations.","authors":[],"date":"2000","doi":"10.1002\/(sici)1099-0720(200001)14:1<31::aid-acp622>3.0.co;2-9","raw":"Chapman, P., Underwood, G., 2000. Forgetting near-accidents: The roles of severity, culpability and experience in the poor recall of dangerous  driving situations. Applied Cognitive Psychology 14, 31-44.","cites":null},{"id":37923437,"title":"Hazard perception and its relevance for driver licensing.","authors":[],"date":"1999","doi":null,"raw":"McKenna, F. P., Horswill, M. S., 1999. Hazard perception and its relevance for driver licensing. Journal of the International Association of Traffic and Safety Sciences 23, 26-","cites":null},{"id":37923330,"title":"Individual differences in accident liability: review of the literature.","authors":[],"date":"1991","doi":null,"raw":"Lester, J., 1991. Individual differences in accident liability: review of the literature. TRRL Research Report 306. Crowthorne: Transport and Road Research Laboratory.","cites":null},{"id":37923414,"title":"Induced exposure.","authors":[],"date":"1973","doi":"10.1016\/0001-4575(73)90019-5","raw":"Haight, F. A., 1973. Induced exposure. Accident Analysis and Prevention 5, 111-126.","cites":null},{"id":37923344,"title":"Month by month changes in accident risk among young novice drivers.","authors":[],"date":"1998","doi":null,"raw":"Sagberg, F., 1998. Month by month changes in accident risk among young novice drivers. Proceedings of the 24 th International Congress of Applied Psychology, San Francisco, 9-14 August.","cites":null},{"id":37923412,"title":"Motor vehicle crash involvement and moving violations: Convergence of self-report and archival data.","authors":[],"date":"2001","doi":"10.1518\/001872001775992507","raw":"Arthur, W., Jr., Tubre, T. C., Day, E., Sheehan, M. K., Sanchez-Ku, M. L., Paul, D. S., Paulus, L. E., Archuleta, K. D. 2001.  Motor vehicle crash involvement and moving violations: Convergence of self-report and archival data. Human Factors 43, 1-11.   22","cites":null},{"id":37923335,"title":"New to the road young drivers and novice drivers: Similar problems and solutions? Ottawa: Traffic Injury Research Foundation,","authors":[],"date":"1990","doi":null,"raw":"Mayhew, D. R., Simpson, H. M., 1990. New to the road young drivers and novice drivers: Similar problems and solutions? Ottawa: Traffic Injury Research Foundation, Ont.","cites":null},{"id":37923324,"title":"On the study of personality factors in research on driving behavior.","authors":[],"date":"1974","doi":"10.2466\/pms.1974.38.3c.1067","raw":"Signori, E. I., Bowman, R. G., 1974. On the study of personality factors in research on driving behavior. Perceptual and Motor Skills 38, 1067-1076.","cites":null},{"id":37923409,"title":"On the validity of self-reported traffic accident data. Manama:","authors":[],"date":"2002","doi":null,"raw":"af Wåhlberg, A. E., 2002a. On the validity of self-reported traffic accident data. Manama: E140 Proceedings of Soric'02. Available at www.psyk.uu.se\/hemsidor\/busdriver","cites":null},{"id":37923342,"title":"Overtaking road accidents: Differences in manoeuvre as a function of driver age.","authors":[],"date":"1998","doi":"10.1016\/s0001-4575(97)00105-x","raw":"Clarke, D. D., Ward, P. J., Jones, J., 1998. Overtaking road accidents: Differences in manoeuvre as a function of driver age. Accident Analysis and Prevention 30, 455-467.   19","cites":null},{"id":37923327,"title":"Personality characteristics of the accident involved employee.","authors":[],"date":"1988","doi":"10.1007\/bf01013766","raw":"Hansen, C. P., 1988. Personality characteristics of the accident involved employee. Journal of Business and Psychology 2, 346-365.","cites":null},{"id":37923325,"title":"Personality factors in highway accidents.","authors":[],"date":"1976","doi":null,"raw":"McGuire, F. L., 1976. Personality factors in highway accidents. Human Factors 18, 433-442.","cites":null},{"id":37923378,"title":"Police and hospital recording of non-fatal road accident casualties: A study in Greater Manchester.","authors":[],"date":"1993","doi":null,"raw":"Hopkin, J. M., Murray, P. A., Pitcher, M., Galasko, C. S., 1993. Police and hospital recording  of  non-fatal  road  accident  casualties:  A  study  in  Greater  Manchester.  TRL Research Report 379. Crowthorne: Transport Research Laboratory.","cites":null},{"id":37923371,"title":"Prediction of police officers' traffic accident involvement using behavioral observations.","authors":[],"date":"1995","doi":"10.1016\/0001-4575(94)00072-t","raw":"Gully, S. M., Whitney, D. J., Vanosdall, F. E., 1995. Prediction of police officers' traffic  accident  involvement  using  behavioral  observations.  Accident  Analysis  and Prevention 27, 355-362.","cites":null},{"id":37923329,"title":"Prediction of vehicular accident involvement: A meta-analysis.","authors":[],"date":"1991","doi":"10.1207\/s15327043hup0402_1","raw":"Arthur, W. Jr., Barrett, G. V., Alexander, R. A. 1991. Prediction of vehicular accident involvement: A meta-analysis. Human Performance 4, 89-105.","cites":null},{"id":37923415,"title":"Quasi-induced exposure revisited.","authors":[],"date":"1991","doi":"10.1016\/0001-4575(91)90005-p","raw":"Lyles, R. W., Stamatiadis, P., Lighthizer, D. R., 1991. Quasi-induced exposure revisited. Accident Analysis and Prevention 23, 275-285.","cites":null},{"id":37923416,"title":"Quasi-Induced Exposure: Methodology and Insight. Accident Analysis and Prevention","authors":[],"date":"1997","doi":"10.1016\/s0001-4575(96)00060-7","raw":"Stamatiadis, N., Deacon, J. A., 1997. Quasi-Induced Exposure: Methodology and Insight. Accident Analysis and Prevention 29, 37-52.","cites":null},{"id":37923376,"title":"Regional variation in motor vehicle accident reporting: Findings from Massachusetts. Accident Analysis and Prevention","authors":[],"date":"1989","doi":"10.1016\/0001-4575(89)90087-0","raw":"Fife, D., Cadigan, R., 1989. Regional variation in motor vehicle accident reporting: Findings from Massachusetts. Accident Analysis and Prevention 21, 193-196.","cites":null},{"id":37923411,"title":"Relative effects of age and compromised vision on driving performance.","authors":[],"date":"1995","doi":"10.1518\/001872095779064645","raw":"Szlyk, J. P., Seiple, W., Viana, M., 1995. Relative effects of age and compromised vision on driving performance. Human Factors 37, 430-436.","cites":null},{"id":37923375,"title":"Road accident statistics - A comparison of police and hospital information.","authors":[],"date":"1973","doi":"10.1016\/0001-4575(73)90004-3","raw":"Bull, J. P., Roberts, B. J., 1973. Road accident statistics - A comparison of police and hospital information. Accident Analysis and Prevention 5, 45-53.","cites":null},{"id":37923381,"title":"Road accident statistics: discrepancies between police and hospital data in a French island. Accident Analysis and Prevention","authors":[],"date":"1999","doi":"10.1016\/s0001-4575(98)00051-7","raw":"Aptel, I., Salmi, L. R., Masson, F., Bourde, A., Henrion, G., Erny, P., 1999. Road accident statistics:  discrepancies between police and hospital data in a French island. Accident Analysis and Prevention 31, 101-108.","cites":null},{"id":37923365,"title":"The accident experience of London bus drivers.","authors":[],"date":"1962","doi":null,"raw":"Cornwall, C. J., 1962. The accident experience of London bus drivers. Annuals of Occupational Hygiene 5, 69-82.","cites":null},{"id":37923332,"title":"The accident liability of car drivers: The reliability of self report data.","authors":[],"date":"1996","doi":null,"raw":"Maycock, G, Lester, J., Lockwood, C. R., 1996. The accident liability of car drivers: The reliability of self report data. TRL Report 219. Crowthorne: Transport Research Laboratory.","cites":null},{"id":37923338,"title":"The accident liability of car drivers.","authors":[],"date":"1991","doi":"10.1080\/01441649308716848","raw":"Maycock, G., Lockwood, C. R., Lester, J. F., 1991. The accident liability of car drivers. TRRL research report 315. Crowthorne: Transport and Road Research Laboratory.","cites":null},{"id":37923370,"title":"The connection between risky driving and involvement in fatal accidents.","authors":[],"date":"1994","doi":"10.1016\/0001-4575(94)90017-5","raw":"Rajalin, S., 1994. The connection between risky driving and involvement in fatal accidents. Accident Analysis and Prevention 26, 555-562.   20","cites":null},{"id":37923323,"title":"The detection and treatment of accident-prone drivers.","authors":[],"date":"1946","doi":"10.1037\/h0061866","raw":"Johnson, H. M., 1946. The detection and treatment of accident-prone drivers. Psychological Bulletin 43, 489-532.","cites":null},{"id":37923438,"title":"The effect of age and experience upon accident rate.","authors":[],"date":"1954","doi":"10.1037\/h0062548","raw":"Van Zelst, R. H., 1954. The effect of age and experience upon accident rate. The Journal of Applied Psychology 38, 313-317.","cites":null},{"id":37923372,"title":"The Five-factor model, conscientiousness, and driving accident involvement.","authors":[],"date":"1996","doi":"10.1111\/j.1467-6494.1996.tb00523.x","raw":"Arthur, W., Jr., Graziano, W. G. 1996. The Five-factor model, conscientiousness, and driving accident involvement. Journal of Personality 64, 593-618.","cites":null},{"id":37923379,"title":"The identification of mistakes in road accident records: Part I, Locational variables.","authors":[],"date":"1995","doi":"10.1016\/0001-4575(94)00065-t","raw":"Austin, K. 1995a. The identification of mistakes in road accident records: Part I, Locational variables. Accident Analysis and Prevention 27, 261-276.","cites":null},{"id":37923380,"title":"The identification of mistakes in road accident records: Part II, Casualty variables.","authors":[],"date":"1995","doi":"10.1016\/0001-4575(94)00066-u","raw":"Austin, K., 1995b. The identification of mistakes in road accident records: Part II, Casualty variables. Accident Analysis and Prevention 27, 277-282.   21","cites":null},{"id":37923328,"title":"The identification of multiple accident correlates in high risk drivers with specific emphasis on the role of age, experience and prior traffic violation frequency.","authors":[],"date":"1993","doi":null,"raw":"Peck, R. C., 1993. The identification of multiple accident correlates in high risk drivers with specific emphasis on the role of age, experience and prior traffic violation frequency. Alcohol, Drugs and Driving 9, 145-166.","cites":null},{"id":37923377,"title":"The real number of road traffic accident casualties in the Netherlands: A year-long survey.","authors":[],"date":"1990","doi":"10.1016\/0001-4575(90)90052-m","raw":"Harris, S., 1990. The real number of road traffic accident casualties in the Netherlands: A year-long survey. Accident Analysis and Prevention 22, 371-378.","cites":null},{"id":37923336,"title":"The relationship between lifestyle factors and collisions involving young drivers.","authors":[],"date":"1996","doi":null,"raw":"Bierness,  D.  L.,  1996.  The  relationship  between  lifestyle  factors  and  collisions involving young drivers. In Simpson H M (Ed). New to the road: Reducing the risks for young motorists. Proceedings of the First Annual International Symposium on the Youth Enhancement Service. University of California, Los Angeles, CA, pp. 71-77.","cites":null},{"id":37923374,"title":"The reporting level of California State Highway accidents.","authors":[],"date":"1966","doi":null,"raw":"Smith, R. N., 1966. The reporting level of California State Highway accidents. Traffic Engineering 29, 20-25.","cites":null},{"id":37923367,"title":"The role of age and experience in bus drivers' accidents.","authors":[],"date":"1987","doi":"10.1093\/ije\/16.1.35","raw":"Blom, D. H., Pokorny, M. L., van Leeuwen, P., 1987. The role of age and experience in bus drivers' accidents. International Journal of Epidemiology 16, 35-43.","cites":null},{"id":37923340,"title":"Time vs. distance as measures of exposure in driving surveys.","authors":[],"date":"1992","doi":"10.1016\/0001-4575(92)90021-a","raw":"Chipman, M. L., MacGregor, C. G., Smiley, A. M., Lee-Gosselin, M., 1992. Time vs. distance as measures of exposure in driving surveys. Accident Analysis and Prevention 24, 679–684.","cites":null},{"id":37923369,"title":"Variability of reaction time and susceptibility to automobile accidents.","authors":[],"date":"1951","doi":"10.1037\/h0053745","raw":"Cation, W. L., Mount, G. E. & Brenner, R., 1951. Variability of reaction time and susceptibility to automobile accidents. Journal of Applied Psychology 35, 101-107.","cites":null},{"id":37923436,"title":"Visual search while driving: Skill and awareness during inspection of the scene.","authors":[],"date":"2002","doi":"10.1016\/s1369-8478(02)00008-6","raw":"Underwood, G., Chapman, P., Bowden, K., Crundall, D., 2002. Visual search while driving: Skill and awareness during inspection of the scene. Transportation Research Part F 5, 87–97.","cites":null},{"id":37923346,"title":"Work-related road accidents.","authors":[],"date":"2003","doi":null,"raw":"Broughton, J., Baughan, C., Pearce, L., Smith, L., Buckle, G., 2003. Work-related road accidents. TRL report 582.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-02-28T00:00:00Z","abstract":"The effects of age and experience on accident involvement for bus drivers were\ninvestigated, with special emphasis upon the first years of being an operator,\nusing two methods. First, direct calculations between these variables were\nundertaken. Thereafter, a variant of the method of quasi-induced exposure (a\nratio of culpable versus nonculpable accidents in the population) was used and\nreferred to as the indirect method. These methods yielded fairly similar\nresults, given that the samples used were drawn from the same population but\nonly partly overlapping. It was found that experience had the strongest effect\non accidents in the first year of driving, while age had a u-shaped association\nwith accidents, that is, young and old drivers had more accidents, something\nthat was more apparent when experience was held constant. These results show\nthat, for bus drivers, experience is initially more important than age, but\nafter two or three years, the effect is small. Thereafter, age is the more\ndiscernible variable, although it is a very weak factor in predicting crash\nrisk","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140986.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1111\/j.1539-6924.2008.00999.x","pdfHashValue":"7bbcb01eec05427f6bd9d9168394aaf4b3ce3b0b","publisher":"Blackwell Publishing Ltd","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5235<\/identifier><datestamp>2012-01-31T16:16:17Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Work-related road safety: An analysis based on U.K. bus driver performance<\/dc:title><dc:creator>Dorn, Lisa<\/dc:creator><dc:creator>af Wahlberg, Anders E.<\/dc:creator><dc:subject>accident bus driver crash, culpability, quasi-induced exposure quasi-induced exposure accident involvement driving performance personality-factors crash involvement age experience identification variables mistakes<\/dc:subject><dc:description>The effects of age and experience on accident involvement for bus drivers were\ninvestigated, with special emphasis upon the first years of being an operator,\nusing two methods. First, direct calculations between these variables were\nundertaken. Thereafter, a variant of the method of quasi-induced exposure (a\nratio of culpable versus nonculpable accidents in the population) was used and\nreferred to as the indirect method. These methods yielded fairly similar\nresults, given that the samples used were drawn from the same population but\nonly partly overlapping. It was found that experience had the strongest effect\non accidents in the first year of driving, while age had a u-shaped association\nwith accidents, that is, young and old drivers had more accidents, something\nthat was more apparent when experience was held constant. These results show\nthat, for bus drivers, experience is initially more important than age, but\nafter two or three years, the effect is small. Thereafter, age is the more\ndiscernible variable, although it is a very weak factor in predicting crash\nrisk.<\/dc:description><dc:publisher>Blackwell Publishing Ltd<\/dc:publisher><dc:date>2011-11-13T23:25:02Z<\/dc:date><dc:date>2011-11-13T23:25:02Z<\/dc:date><dc:date>2008-02-28T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>0272-4332<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1111\/j.1539-6924.2008.00999.x<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5235<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0272-4332","issn:0272-4332"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["accident bus driver crash, culpability, quasi-induced exposure quasi-induced exposure accident involvement driving performance personality-factors crash involvement age experience identification variables mistakes"],"subject":["Article"],"fullText":" 1  \nWork related road safety:  \nAn analysis based on UK bus driver performance \n \n \nLisa Dorn (a), Anders af Wåhlberg (b)*  \n* corresponding author \n \na. Department of Human Factors  \nCranfield University  \nCranfield  \nBedfordshire MK43 0AL \nUK \nL.Dorn@Cranfield.ac.uk \n \nb. Department of Psychology \nUppsala University  \nPO Box 1225, Uppsala \nSweden \nanders.af_wahlberg@psyk.uu.se \n 2  \n \n \n \n \nAbstract \nThe effects of age and experience on accident involvement for bus drivers was investigated, with special \nemphasis upon the first years of being an operator, using two methods. First, direct calculations between \nthese variables were undertaken. Thereafter, a variant of the method of quasi-induced exposure (a ratio of \nculpable versus non-culpable accidents in the population) was used and referred to as the indirect method. \nThese methods yielded fairly similar results, given that the samples used were drawn from the same \npopulation but only partly overlapping. It was found that experience had the strongest effect on accidents in \nthe first year of driving, while age had a u-shaped association with accidents, i.e. young and old drivers had \nmore accidents, something which was more apparent when experience was held constant. These results \nshow that, for bus drivers, experience is initially more important than age, but after two or three years, the \neffect is small. Thereafter, age is the more discernible variable, although it is a very weak factor in \npredicting crash risk. \n \nKeywords: crash, accident, culpability, bus driver, quasi-induced exposure\n 3  \n \n1. INTRODUCTION \nRoad traffic accidents, and the associated economical and social costs, are a major health \nproblem in most countries today. Throughout accident research history, the search for \npredictors of accident involvement has been a central focus of investigation (see for \nexample reference 1). Although a vast number of parameters (psychological, \ndemographic, medical etc) have been tested (for reviews, see 2-6 and the meta-analysis 7) \nno strong associations have been found (e.g. 8).  \nMany organisations are concerned about the frequency with which their employees are \ninvolved in road traffic crashes, but there is, in comparison to car drivers, little published \ndata to guide company policy and professional driver training. This paper aims to 1) re-\nvisit two of the most persistently found accident predictors; age and experience but within \na professional group of drivers that are less well understood compared with car drivers; \nthat of bus operators and 2) we aim to consider methodological approaches to \nunderstanding crash risk that do not seem to have been studied before for any groups of \nprofessional drivers. \nBus drivers are a special group of professional drivers that differ markedly from the \npopulation of car drivers in ways that are likely to affect their crash risk. Firstly, bus \ndrivers already hold a car driving licence before being granted a bus driver’s licence and \nalso start driving a bus work at a later age than novice car drivers do. While it is possible \nthat this is beneficial, currently there is no evidence to indicate that this is the case. On \nthe contrary, no association has been found between years of holding a car driver licence \nand number of bus crashes (9). \n 4  \nSecondly, bus drivers have the added pressure of responsibility for passengers' lives \ndriving large, heavy vehicles that are constantly pulling in and out of traffic, mostly in \nbuilt-up areas. Thirdly, bus drivers have a much higher annual mileage than private \nmotorists. Finally, organisational factors such as bus schedules are likely to exert a strong \ninfluence on their driving behaviour. \nAge and experience are known to be predictive of road traffic collisions for car drivers \n(e.g. 10) but as these predictors are usually highly inter-correlated and are difficult to \nseparate when investigating crash risk (11-14). For age, mileage adjusted crash risk \ndeclines with age but then rises again for drivers aged over 65 (15). This is thought to be \ndue to physical and cognitive declines in older people and higher risk-taking in younger \ncar drivers (16-18). Even limited driving experience has a major effect on road safety, as \nthere is a disproportionately higher crash rate during the first year of driving for car \ndrivers, particularly in the first few months after licensure (19). Mayhew et al (20) found \nlarger decreases in crash risk amongst younger novices compared with older novices \nduring the first few months of car driving. There is thus a reasonable literature on the \neffects of age and experience on crash involvement for private motorists, but little is \nknown about whether these results can be generalised to professional drivers.  \nTurning to professionals, crash risk is greater for drivers who drive for work, even when \ntaking into account their increased mileage (21). For bus operators, the same general \nfindings as those pertaining to car drivers have emerged, although the literature is not as \nprolific. Generally, accident risk is found to decrease somewhat with increased age and \nexperience, both having independent impacts (22), especially at the low end (23) \nalthough in some studies only one of these have been a significant predictor (9, 24, 25). \n 5  \nAlthough some effects of age and\/or experience can almost always be found in crash risk \ncalculations, there exists an inherent problem in such data; the matter of culpability for \ncrashes, which is often not taken into consideration. As all drivers are exposed to events \nthat are due to other drivers' behaviour, studies that use all crashes as the dependent \nmeasure, instead of culpable ones, probably underestimate the effects of their \nindependent variables (studies which have found this effect include 26-29). \nRegarding source methodology, many studies use official accident data to examine crash \nrisk (e.g. 12, 18, 22, 30). These databases most often have the advantages of being large \nand collected over a long time period, but under-reporting and various biases have been \nshown to exist by many authors (e.g. 31-38). Other studies are limited by small sample \nsizes (e.g. 39), while the extremely popular self-report measure of crashes is seriously \nflawed in various ways (15, 29, 40-45).  \nCompany fleet crash data on the other hand have advantages over official archives, and \nare probably more complete than other sources (42). However, they may suffer from \nother problems. Data are often collected for insurance purposes and are concerned with \npolicies and claims rather than crash and driver characteristics. Here, the problem of \nculpability returns, because even though such data may be available, the correctness of \nthe criterion and the actual coding may not be accurate. \nThere are many ways to assess the crash risk associated with different types of road user. \nOften, the driver is used as the unit of analysis and age, experience and crashes over a \ncertain period of time is correlated, which can be called a direct analysis. However, as \ncrashes are rather rare, the statistical power of such an analysis is often low. An \nalternative to this method is to start with crashes, and compare the characteristics of the \n 6  \ndrivers with those of the general driving population. However, using all drivers as \ncomparison is crude, and will probably lead to confounding of different effects, like that \nof exposure. Therefore, several researchers have suggested using what is called induced \nexposure techniques on accident data, producing relative risk ratios, where the number of \nnon-culpable accidents is used as an index of exposure. This method is based on the \nassumption that in two-vehicle crashes there is a driver who is responsible for the \ncollision and that the second driver is selected randomly from the driving population (46, \n47). The culpable and non-culpable drivers can thereafter be compared for various \ncharacteristics. This method has the advantages of not having to ascertain the exact \npopulation of drivers, or their exposure, as crashes are used as the unit of analysis, and \nother crashes used an exposure proxy. Furthermore, the use of pairs of drivers from the \nsame crash means that many environmental variables of interest are held constant. A \nvariant of this method, which is called quasi-induced exposure (see 47-49), calculates \ncrash risk as a ratio of responsible drivers divided by the proportion of non-responsible in \neach group (defined by whatever variable is of interest, age for example), then the groups' \nrisk ratios can be compared. If these differ, it can be said that there is an effect of the \ngrouping variable.  \nThe common approach for the induced method is that you cannot get all relevant data for \nthe population, but instead compare the data of two groups. However, despite its \npopularity, this type of method does not seem to have been validated, and some results \nwould seem to indicate that induced and direct techniques can yield different results, even \nwhen the same data is used (9). Also, for the data in the present study, it has been shown \nthat the assignment of responsiblity is too lenient, with a substantial percent of bus \n 7  \ndrivers’ being categorized as not at fault in accidents when they were probably active \nparticipants in the crash (57). Such erroneous coding may have serious repercussions for \nthe induced method, but probably very small effects if associations with predictors are \ncalculated directly for culpable accidents only. Therefore, it was decided to use both the \ndirect and indirect methods to study the effects of age and experience upon the accident \nrates of bus drivers, and compare results between these methods. \nTo summarize, this study aimed to investigate the role of age and bus driving experience \non crash risk when taking into account culpability, with special emphasis on the first year \nof employment with a bus company, using two different methods of analysing crash risk.  \n \n \n2. METHOD \n2.1 Data \n2.1.1 Source, coding and arrangement \nA major UK bus company supplied data for the present study. Information about all their \ncrashes and passenger falls was gathered and entered into an incident database. Some \ndriver characteristics, such as age and length of employment, were also available. A \nfurther advantage was that all incidents are reported and attributed to a particular driver, \nno matter how minor. This is due to a strictly adhered to company policy that all vehicles \nare checked at the start and end of each shift. Each crash is coded by the driver according \nto several different categories. Culpability was assigned by the depot manager and the \ninsurance team (for further details see the Appendix). In the present study, three levels of \nresponsibility were available; Partly, Solely and Not responsible. \n 8  \nThe data could be analysed taking the driver or crash as the unit of analysis. \nUnfortunately, the available sets for these two different types of analysis were not exactly \nthe same, mainly due to the practical problems of extracting data for such large datasets. \n \n2.1.2 Direct data \nSamples of drivers were drawn from five regions. Available for each driver was date of \nbirth, date of commencement of employment and number of crashes between 2001-2005 \n(the period for which this information was available) at the three different levels of \nculpability. However, only the culpable accidents were used (both categories of partly \nand solely responsible added together). Descriptive data for these are shown in Table 1. It \nshould be noted that both age and experience in the accident sample are lower using the \nindirect method compared with the direct sample (Table 1 and 2). . For the indirect \nsample, it can be seen that mean age does not differ between culpability levels, while \nexperience does. \n \nTables 1-2 about here \n \n2.1.3 Induced data \nThe bus company operates from 121 depots in the UK and the induced analysis included \nall crashes that occurred throughout these depots from December 2000 to June 2003\n1\n, \nexcept passenger falls and those where details about the crash and culpability were not \ncomplete (see Table 2). The accidents of 12,244 bus drivers aged between 18 – 64 years \n 9  \nwho had been in service from one month to 35 years were analysed. Information about \ndriver’s sex was not available, but, as can be seen from the direct data of sample 1 (Table \n1) almost all of these bus drivers are male.  \n \n2.1.4 Direct method calculations \nThe direct method uses the individual driver as the unit of analysis, computing the effects \nof age and experience on accident rate. Also, the drivers with little experience could be \nsingled out for further analysis. Furthermore, the trend over time in accident liability \ncould be tracked by dividing the sample into groups with differing experience and \ncalculating the mean number of accidents for each year between the groups using t-test \nanalyses.  \nThe results for different groups could also be compared with the risk ratios of the indirect \nmethod (see next section), for groups contructed according to the same principles (e.g. an \nage band). If results of the two methods were similar, this would mean that the known \nerror in coding for culpability was random for the two variables of interest here (age and \nexperience), because the direct method does not involve the Not responsible accidents \n(where the coding is partly erroneous, as shown in 57). \n \n2.1.5 Indirect\/induced method calculations \nIn the present paper, the drivers in accidents were not pairs from the same accident, as \nmost were car drivers and thus not really comparable to the population of interest. \nSimilarly, single-vehicle accidents were included, that are, of course assumed to be \n                                                                                                                                                 \n1\n The direct and indirect samples were thus not the same (although there must have been some overlap), due \nto organisational factors; the indirect sample was already compiled by the company, while the direct \n 10  \nculpable. Therefore, the present analyses violated one of the assumptions of quasi-\ninduced exposure, and thus introduced an unknown amount of error into the calculations. \nHowever, for a population of bus drivers, the use of pairs of drivers from the same \naccident are probably not that important, because the main purpose of this part of the \nmethod is to hold constant factors like time of day. Here car drivers probably differ a lot \nin their exposure compared with bus drivers (49). Risk exposure for bus drivers at work is \nmuch more standardized, as they have less choice concerning routes, time of day, type of \nvehicle etc than the car driving population. Therefore, it was not expected that there \nwould be any significant violation of the assumption of non-culpable drivers as a random \nsample of the population. However, the risk ratios computed here cannot be compared to \nthose of the quasi-induced method, as the numbers of drivers assigned to responsible and \nnot responsible categories are not necessarily equally distributed. A higher percentage of \ndrivers in the responsible category will therefore bias the risk ratios towards high values. \nConsequently, the analysis can only yield results that can be used for comparisons \nbetween groups (e.g. the ratio is lower for older drivers). It should be noted that the \nanalysis is based on collisions, so that drivers may appear in the data more than once if \nthey have been involved in multiple collisions within the time period.  \n \n2.2 Statistical methods \nTwo main problems for the present study was a need to find comparable statistics for the \ntwo different methods, and that the effects were not necessarily linear. Also, the two \npredictor variables were expected to be strongly correlated. \n                                                                                                                                                 \nsamples had to be manually extracted from the main database by a researcher at a later date. \n 11  \nAlthough not commonly used in accident research currently, the Pearson correlation and \nmultiple regression analyses were deemed suitable for the direct method, as most \nvariables were fairly normally distributed, with experience being the only exception. \nHere, there was a fairly strong positive skew, indicating that many drivers only stay in the \njob for a rather short period of time. Therefore, t-tests were used to compare different \ngroups of drivers, according to age and experience. \nFor the indirect sample, risk ratios were calculated between the culpable and non-\nculpable accidents, for groups formed with the same cut-off values for age and \nexperience as for the direct calculations. The result is a measure of differences in \naccident-causing tendencies between groups. A ratio of 1 means that a group of drivers \nare equally involved in responsible and non-responsible crashes. \nGiven that measures of risk for groups defined in the same way had been calculated for \nboth the direct and the indirect samples, these could be compared on a common scale, \nafter standardization of values. \n \n \n \n3. RESULTS \n3.1 Direct calculations \nAge and number of years of employment were correlated with the number of responsible \naccidents in a five-year period for all samples. As the associations were rather similar \nbetween samples, they were pooled into one. For this group, correlations for responsible \naccidents with age and experience are shown in Table 3. Thereafter, it was tested whether \n 12  \nexperience had any long-term effect by excluding accidents in the first year of driving for \nthe company. It was found that the correlation with accidents for the whole period (2001-\n2005) was significant for up to four years. With more than five years experience, at the \nbeginning of 2001, r was -.051 (N=1302, ns). As could be expected, the reverse exclusion \nprocess had the opposite effect; the correlation between accidents and experience was \nstrongest for the drivers with less than one year of service at the start of 2001. \nExperience was therefore further analysed by dividing the direct sample by years of \nexperience and calculating the mean number of responsible accidents for each available \ncalender year. The strongest effects were found for the first two years of driving (see \nFigure 1 and Table 4). Therefore, these were singled out and compared with the same \ngroups from the induced data set (Figures 2-3). \nAs age and experience correlated .366 (N=2153, p<.0001), multiple regressions were run \nwith these variables as predictors of responsible accidents. For the whole period (2001-\n2005), both were significant (p<.0001, beta for experience -.150,  age .106, R=.152, \nN=2153). Results for each year in isolation were very similar. It is worth noting here that \nthe age trend was positive. \nHowever, dividing the sample into different age groups and comparing their means \nrevealed that there was actually a higher risk for drivers under 25 years of age (see Figure \n4), a negative initial trend. As this group was very small (N=24), this difference was only \nsignificant at p<.05 in comparison with the three next groupings, while against all other \ndrivers it was not significant.  \n \n \n 13  \nTable 3 and Figure 1 about here \n \n \n3.3 Indirect calculations: Risk ratios \n3.3.1 Total time period \nRisk ratios were first computed for every year of experience. There was a marked decline \nduring the first two years of driving (for both culpability categories), which were \nsignificantly different from later years, using a chi2 test (see Table 5). The later \ndifferences were not significant, due to dwindling Ns with the longer time periods. This \nwould seem to pinpoint the effect of experience within the first years or so. Therefore, \nresults are shown for the first five years, and compared to the findings of the direct \nmethod for drivers with less than one year’s experience at the beginning of 2001 (Figure \n2). This could also be calculated for up to six years, when the first year is deleted (this \ncomparison uses the drivers with more than one but less than 2 year’s experience).  \n \nFigure 3 and Table 5 about here \n \n \n \n \n3.3.3 Comparisons of direct and indirect results \n 14  \nFigures 2 and 3 show the results for experience from the direct and indirect samples, with \ndifferent starting points. It can be seen that for the first comparison (one to five years of \nexperience), the results were very similar, while for the second, they were less similar.  \nThereafter, the risk ratios computed for age groups (responsible accidents divided by not \nresponsible for each age group) can also be seen in Figures 4 and 5, and Table 6. The \ntrends in these sets of data would seem to be fairly similar, with a correlation of .800 \n(N=9, p<.05). \n \nFigures 2-5  and Table 6 about here \n \n \n4. DISCUSSION \nThe main findings of this study indicate that, overall, there was an initial negative, and \nthereafter a weak positive effect of age on bus driver accidents, and a somewhat stronger \ninitial, negative effect of experience, for both calculation methods. It therefore appears \nthat lack of experience of driving a bus is more influential than age in its contribution to \nrisk for crashes at first, but that age after a few years is still influential although rather \nweak, while experience no longer contributes to the change in crash risk. \nIt can also be concluded that the induced method does seem to yield similar results to the \ndirect calculations, despite the violations against the assumptions of the original method \n(e.g. violation of the driver pair assumption). The method used to compare risk ratios and \ndirect calculations of means for similarly constructed groups would seem to be a new \ncontribution to the debate. It is therefore important to point out what can actually be \n 15  \nconcluded from these standardized values. As the basic values are in different units, the \nsize of the two values for example, the first year of experience, cannot be directly \ncompared with each other. However, they can both be compared to the other values \nwithin the same variable, and it can therefore be concluded that both methods indicate \nthat the risk is twice as high in the first year of driving as in the second year of driving. \nThere are a number of methodological limitations to the present study that need to be \nconsidered. Firstly it is reasonable to assume that many of the employees with greater \ncrash involvement will tend to leave the company (56), although no such effect could be \nfound for Swedish bus drivers by af Wåhlberg (9). If this situation were the case, for the \npresent bus company, this would lead to over-estimations of the effects, especially for \nexperience, in the indirect data, while the direct sample would probably under-estimate \nthem instead. However, the differences between methods were small, so there does not \nseem to be a case for suspecting an attrition effect. \nSecondly, assigning culpability was jointly undertaken by depot managers and the \ninsurance company (see Appendix). As there are a large number of depots from which the \ndata was gathered, a large degree of error variance is to be expected from this source. As \nno inter-rater reliability assessments were undertaken, this facet remains an unknown. \nThirdly, it is possible that new drivers may be allocated less favourable routes and shifts \ncompared with their longer serving peers, making their exposure qualitatively worse. \nHowever, the policy for bus company is the opposite to this. Depot managers are \nencouraged to ensure that in the early weeks of driving for the company, new drivers are \ngiven ‘nursery routes’. Therefore, the estimates of the impact of experience on accidents \ncalculated here are, if anything, underestimations. \n 16  \nFourthly, it is estimated by the bus company that about a third of the new drivers actually \nhave some experience from other companies when they are hired. The experience effects \nfound here are therefore underestimates of the actual ones. \nThe induced exposure technique assumes that non-culpable accidents are directly related \nto exposure and can be used as a proxy for it. As has been shown for the present data, this \nis not always the case (57). Also, Sagberg (51) added mileage and age as further \npredictors in his calculations using this method, with considerable effects (52). \nInexperience in the form of lack of knowledge about hazards and the appropriate vehicle \nhandling skills to allow the driver to manoeuvre safely may result in the driver taking \nunnecessary risks in unknown situations (53-55). At present, the average newly recruited \ntrainee bus driver with the present bus company receives about two weeks instruction on \nvehicle handling skills training and hazard awareness in one of the company’s driving \nschools, in common with many other professional driver training courses. Apart from a \ntest of the two methods of analysing crash risk and finding that there is little to chose \nbetween them when considering professional driver accidents, the implications of the \npresent data suggests that the most fruitful targets for training of bus drivers would be to \nfocus on novice drivers, regardless of age. There is also the suggestion that older drivers \nmay need a refresher driver training course to mitigate risk.  \n 17  \n \nREFERENCES \n1. Johnson, H. M., 1946. The detection and treatment of accident-prone drivers. \nPsychological Bulletin 43, 489-532. \n2. Signori, E. I., Bowman, R. G., 1974. On the study of personality factors in research on \ndriving behavior. Perceptual and Motor Skills 38, 1067-1076. \n3. McGuire, F. L., 1976. Personality factors in highway accidents. Human Factors 18, \n433-442. \n4. Golding, A. P., 1983. Differential accident involvement: A literature survey. Council \nfor Scientific and Industrial Research Reports, PERS 356: 44. \n5. Hansen, C. P., 1988. Personality characteristics of the accident involved employee. \nJournal of Business and Psychology 2, 346-365. \n6. Peck, R. C., 1993. The identification of multiple accident correlates in high risk drivers \nwith specific emphasis on the role of age, experience and prior traffic violation \nfrequency. Alcohol, Drugs and Driving 9, 145-166. \n7. Arthur, W. Jr., Barrett, G. V., Alexander, R. A. 1991. Prediction of vehicular accident \ninvolvement: A meta-analysis. Human Performance 4, 89-105. \n8. Lester, J., 1991. Individual differences in accident liability: review of the literature. \nTRRL Research Report 306. Crowthorne: Transport and Road Research Laboratory. \n9. af Wåhlberg, A. E., 2005. Differential accident involvement of bus drivers. In L. Dorn \n(Ed.) Driver Behaviour and Training, Volume II, pp. 383-391. Aldershot: Ashgate. \nSecond International Conference on Driver Behaviour and Training. Edinburgh 15-17 \nNovember, 2005. \n 18  \n10. Maycock, G, Lester, J., Lockwood, C. R., 1996. The accident liability of car drivers: \nThe reliability of self report data. TRL Report 219. Crowthorne: Transport Research \nLaboratory. \n11. Brown, I. D., 1982. Exposure and experience are a confounded nuisance in research \non driver behaviour. Accident Analysis and Prevention 14, 345-352. \n12. Ryan, G. A., Legge, M., Rosman, D., 1998. Age related changes in drivers’ crash risk \nand crash type. Accident Analysis and Prevention 30, 379-387. \n13. Mayhew, D. R., Simpson, H. M., 1990. New to the road young drivers and novice \ndrivers: Similar problems and solutions? Ottawa: Traffic Injury Research Foundation, \nOnt. \n14. Bierness, D. L., 1996. The relationship between lifestyle factors and collisions \ninvolving young drivers. In Simpson H M (Ed). New to the road: Reducing the risks for \nyoung motorists. Proceedings of the First Annual International Symposium on the Youth \nEnhancement Service. University of California, Los Angeles, CA, pp. 71-77. \n15. Maycock, G., Lockwood, C. R., Lester, J. F., 1991. The accident liability of car \ndrivers. TRRL research report 315. Crowthorne: Transport and Road Research \nLaboratory. \n16. Chipman, M. L., MacGregor, C. G., Smiley, A. M., Lee-Gosselin, M., 1992. Time vs. \ndistance as measures of exposure in driving surveys. Accident Analysis and Prevention \n24, 679–684. \n17. Clarke, D. D., Ward, P. J., Jones, J., 1998. Overtaking road accidents: Differences in \nmanoeuvre as a function of driver age. Accident Analysis and Prevention 30, 455-467. \n 19  \n18. McGwin, G., Brown, D. B., 1999.  Characteristics of traffic crashes among young, \nmiddle-aged, and older drivers. Accident Analysis and Prevention 31, 181–198. \n19. Sagberg, F., 1998. Month by month changes in accident risk among young novice \ndrivers. Proceedings of the 24\nth\n International Congress of Applied Psychology, San \nFrancisco, 9-14 August. \n20. Mayhew, D. R., Simpson, H. M., Pak, A., 2003. Changes in collision rates among \nnovice drivers during the first months of driving.  Accident Analysis and Prevention 35, \n683-691. \n21. Broughton, J., Baughan, C., Pearce, L., Smith, L., Buckle, G., 2003. Work-related \nroad accidents. TRL report 582. \n22. Evans, W. A., Courtney, A. J., 1985. An analysis of accident data for franchised \npublic buses in Hong Kong. Accident Analysis and Prevention 17, 355-366. \n23. Spratling, F. H., 1961. Accidents among older London Transport drivers; an  \nanalysis. British Transport Review, 172-184. \n24. Cornwall, C. J., 1962. The accident experience of London bus drivers. Annuals of \nOccupational Hygiene 5, 69-82. \n25. Blom, D. H., Pokorny, M. L., van Leeuwen, P., 1987. The role of age and experience \nin bus drivers' accidents. International Journal of Epidemiology 16, 35-43. \n26. Cation, W. L., Mount, G. E. & Brenner, R., 1951. Variability of reaction time and \nsusceptibility to automobile accidents. Journal of Applied Psychology 35, 101-107. \n27. Rajalin, S., 1994. The connection between risky driving and involvement in fatal \naccidents. Accident Analysis and Prevention 26, 555-562. \n 20  \n28. Gully, S. M., Whitney, D. J., Vanosdall, F. E., 1995. Prediction of police officers' \ntraffic accident involvement using behavioral observations. Accident Analysis and \nPrevention 27, 355-362. \n29. Arthur, W., Jr., Graziano, W. G. 1996. The Five-factor model, conscientiousness, and \ndriving accident involvement. Journal of Personality 64, 593-618. \n30. Abdel-Aty, M. A., Chen, C. L., Schott, J. R., 1998. An assessment of driver age on \ntraffic accident involvement using log-linear models. Accident Analysis and Prevention \n30, 851-861. \n31. Smith, R. N., 1966. The reporting level of California State Highway accidents. Traffic \nEngineering 29, 20-25. \n32. Bull, J. P., Roberts, B. J., 1973. Road accident statistics - A comparison of police and \nhospital information. Accident Analysis and Prevention 5, 45-53. \n33. Fife, D., Cadigan, R., 1989. Regional variation in motor vehicle accident reporting: \nFindings from Massachusetts. Accident Analysis and Prevention 21, 193-196. \n34. Harris, S., 1990. The real number of road traffic accident casualties in the \nNetherlands: A year-long survey. Accident Analysis and Prevention 22, 371-378. \n35. Hopkin, J. M., Murray, P. A., Pitcher, M., Galasko, C. S., 1993. Police and hospital \nrecording of non-fatal road accident casualties: A study in Greater Manchester. TRL \nResearch Report 379. Crowthorne: Transport Research Laboratory. \n36. Austin, K. 1995a. The identification of mistakes in road accident records: Part I, \nLocational variables. Accident Analysis and Prevention 27, 261-276. \n37. Austin, K., 1995b. The identification of mistakes in road accident records: Part II, \nCasualty variables. Accident Analysis and Prevention 27, 277-282. \n 21  \n38. Aptel, I., Salmi, L. R., Masson, F., Bourde, A., Henrion, G., Erny, P., 1999. Road \naccident statistics: discrepancies between police and hospital data in a French island. \nAccident Analysis and Prevention 31, 101-108. \n39. Hancock, P. A., Wulf, G., Thom, D., Fassnacht, P., 1990. Driver workload during \ndifferent driving maneuvers. Accident Analysis and Prevention 22, 281-290. \n40. Maycock, G.,  Lester, J., 1995. Accident liability of car drivers: follow-up study. In \nG. B. Grayson (Ed.) Behavioural Research in Road Safety V, pp. 106-120. Crowthorne: \nTransport Research Laboratory. \n41. Chapman, P., Underwood, G., 2000. Forgetting near-accidents: The roles of severity, \nculpability and experience in the poor recall of dangerous driving situations. Applied \nCognitive Psychology 14, 31-44. \n42. af Wåhlberg, A. E., 2002a. On the validity of self-reported traffic accident data. \nManama: E140 Proceedings of Soric'02. Available at \nwww.psyk.uu.se\/hemsidor\/busdriver  \n43. Szlyk, J. P., Severing, K., Fishman, G. A., Alexander, K. R., Viana, M., 1993. \nEvaluation of driving performance in patients with juvenile macular dystrophies. \nArchives of Ophthalmology 111, 207-212. \n44. Szlyk, J. P., Seiple, W., Viana, M., 1995. Relative effects of age and compromised \nvision on driving performance. Human Factors 37, 430-436. \n45. Arthur, W., Jr., Tubre, T. C., Day, E., Sheehan, M. K., Sanchez-Ku, M. L., Paul, D. \nS., Paulus, L. E., Archuleta, K. D. 2001.  Motor vehicle crash involvement and moving \nviolations: Convergence of self-report and archival data. Human Factors 43, 1-11. \n 22  \n46. Carr, B. R., 1969. A statistical analysis of rural Ontario traffic accidents using \ninduced exposure data. Accident Analysis and Prevention 5, 343-357. \n47. Haight, F. A., 1973. Induced exposure. Accident Analysis and Prevention 5, 111-126.  \n48. Lyles, R. W., Stamatiadis, P., Lighthizer, D. R., 1991. Quasi-induced exposure \nrevisited. Accident Analysis and Prevention 23, 275-285.  \n49. Stamatiadis, N., Deacon, J. A., 1997. Quasi-Induced Exposure: Methodology and \nInsight. Accident Analysis and Prevention 29, 37-52. \n50. Chandraratna, S., Stamatiadis, N., Stromberg, A., 2006. Crash involvement of drivers \nwith multiple crashes. Accident Analysis & Prevention 38, 532-541. \n51. Sagberg, F., 2006. Driver health and crash involvement: A case-control study. \nAccident Analysis and Prevention 38, 28-34. \n52. af Wåhlberg, A. E., 2002b. Characteristics of low speed accidents with buses in \npublic transport. Accident Analysis and Prevention 34, 637-647. \n53. Bailly, B., Bellet, T., Goupil, C., 2003. Driver’s mental representations: Experimental \nstudy and training perspectives. In. L. Dorn (ed). Driver Behaviour and Training. \nAshgate, UK. \n54. Underwood, G., Chapman, P., Bowden, K., Crundall, D., 2002. Visual search while \ndriving: Skill and awareness during inspection of the scene. Transportation Research Part \nF 5, 87–97. \n55. McKenna, F. P., Horswill, M. S., 1999. Hazard perception and its relevance for driver \nlicensing. Journal of the International Association of Traffic and Safety Sciences 23, 26-\n41. \n \n 23  \n56. Van Zelst, R. H., 1954. The effect of age and experience upon accident rate. The \nJournal of Applied Psychology 38, 313-317. \n57. af Wåhlberg, A. E., Dorn, L. 2007. Culpable versus non-culpable traffic accidents; \nwhat is wrong with this picture? Journal of Safety Research 38, 453-459.\n 24  \n \nAppendix \nAssignment of culpability by the Bus Company \n \nAfter a collision, the bus driver completes a report with 6 boxes to tick for road type \ncategories and 7 boxes to describe the road features where the collision took place. The \ndriver can only tick one of these boxes for each of the sections and they are given no \nguidance about the circumstances under which they must respond to different boxes. \nThere is no miscellaneous box. The accident report must also contain a diagram to \ndescribe what happened. \n \nThis report is forwarded to the depot manager who completes an 'Opinion Memo'. The \nmanager looks at the driver's report, considers local knowledge and looks at the diagram. \nHe\/She then sends the Opinion memo to an in-house insurance team. They gather all the \nevidence, which includes the driver's report, the memo, witness reports, police reports, \nphotographs (if available - drivers all have a disposable camera in the cab). The insurance \nteam then either agree or disagree with the opinion memo. Culpability is assigned at this \npoint and the information loaded on to the database. There are about 40 - 60,000 records \neach year. \n \n 25  \n \n \n \n \nTable 1: Descriptive data for the driver samples in the direct analysis. N, sex (percent males), age and \nexperience (time since employment) on 2001-01-01 in years, and number of accidents at each level of \nresponsibility (mean\/std). Note that in the analyses, the five samples were added (total sample), as were the \nPartly and Solely responsible accident categories. \nSample N Sex Age Experience Not responsible Partly responsible Solely responsible \n1 407 95% 46.2\/9.1 9.8\/9.1 2.72\/2.33 0.32\/0.60 2.34\/2.11 \n2 628 - 46.0\/8.7 11.5\/9.5 2.66\/2.25 0.27\/0.53 2.18\/1.96 \n3 141 - 46.5\/8.7 12.6\/8.7 3.69\/3.10 0.34\/0.57 2.14\/2.33 \n4 460 - 47.3\/9.0 9.5\/8.3 2.08\/1.78 0.34\/0.64 2.03\/2.06 \n5 518 - 46.0\/9.7 9.2\/9.0 2.26\/2.27 0.29\/0.57 1.89\/2.07 \n \n 26  \n \nTable 2: Descriptive data for the accident sample of the indirect analysis. Number of incidents, age and \nexperience (mean\/std), for different levels of culpability. Note that in the analyses, the Partly and Solely \nresponsible accident categories were added. \nAccidents sample N Age Experience \nAll 15100 42.8\/10.8 6.1\/7.6 \nNot responsible 7448 (49.3%) 42.9\/10.6 6.7\/7.7 \nPartly responsible 1422 (9.4%) 42.5\/10.8 5.7\/7.2 \nSolely responsible 6230 (41.3%) 42.9\/11.2 5.5\/7.5 \n 27  \n \nTable 3: The correlations between age, experience and number of responsible accidents in each of five \nyears and for the whole period, for the total direct sample. N= \n 2001 2002 2003 2004 2005 2001-2005 \nAge -.002 .003 .022 .072*** .064** .051* \nExperience -.137*** -.058** -.087*** -.012 -.031 -.116*** \n* p<.05, ** p<.01, ***p<.001 \n 28  \n \n \nTable 4: The years in which there were significant differences (p<.05, independent t-tests) between \ndifferently experienced groups (see Figure 1). \nGroup 1><2 years 2><3 years >3 years (N=1585) \n<1 year (N=220) 2001 2001, 2002 2001, 2002, 2003 \n1><2 years (N=218) - ns 2001, 2002 \n2><3 years =N=189)  - 2001, 2003 \n \n 29  \n \nTable 6: The effect of experience in the accident sample. Chi2 values for the differences in risk ratio for \neach of the first three years of experience versus all later years (maximum 35). All df=3. \nVariable N 1 N 2 N 3 \nAccidents 15100 229.4***** 10934 22.6**** 8828 3.41 \n**** p <.0001, ***** p<.00001 \n \n 30  \n \nTable 6: t-values for differences between age groups in the total direct sample (as shown in Figure 4). \nIndependent t-tests. \nGroup 25-30 \nyears \n(N=89) \n30-35 \nyears \n(N=182) \n35-40 \nyears \n(N=261) \n40-45 \nyears \n(N=301) \n45-50 \nyears \n(N=370) \n50-55 \nyears \n(N=523) \n55-60 \nyears \n(N=348) \n>60 \nyears \n(N=29) \n<25 years \n(N=24) \nt=2.2* t=2.5* 2.0 1.2 2.6** 1.5 0.9 0.9 \n25-30 \nyears \n(N=89) \n 0.3 -0.3 -1.4 0.6 -1.3 -2.0* -1.0 \n30-35 \nyears \n(N=182) \n  -0.7 -2.1* 0.4 -2.1* -3.0** -1.3 \n35-40 \nyears \n(N=261) \n   -1.6 1.2 -1.5 -2.5* -0.8 \n40-45 \nyears \n(N=301) \n    3.0** 0.4 -0.9 -0.1 \n45-50 \nyears \n(N=370) \n     -3.1** -4.1*** -1.4 \n50-55 \nyears \n(N=523) \n      -1.4 -0.2 \n55-60 \nyears \n(N=348) \n       0.3 \n* p<.05, ** p<.01, *** p>.001 \n 31  \n \n \n \n \nMean number of responsible accidents by year and experience\n <1 year\n 1><2 years\n 2><3 years\n >3 years\n2001 2002 2003 2004 2005\n0,0\n0,2\n0,4\n0,6\n0,8\n1,0\n \nFigure 1: The mean number of responsible accidents 2001-2005 of drivers with differing amounts of \nexperience as of 2000-01-01, for the direct sample (N=220+218+189+1584). \n \n 32  \nStandardized number of responsible accidents and risk ratios by experience\nFirst year Second year Third year Fourth year Fifth year\n-1,5\n-1,0\n-0,5\n0,0\n0,5\n1,0\n1,5\n2,0\n Direct sample\n Indirect sample\n \nFigure 2: A comparison between the results for direct and indirect calculations of the influence of \nexperience on accident liability. The mean number of responsible accidents and the risk ratios \n(responsible\/not responsible accidents), in the drivers’ first and later years (both standardized). The \ncorrelation between means and risk ratios was .912 (N=5, p<.05). \n 33  \n \nStandardized number of responsible accidents and risk ratios by experience\nSecond year Third year Fourth year Fifth year Sixth year\n-1,5\n-1,0\n-0,5\n0,0\n0,5\n1,0\n1,5\n2,0\n Direct sample\n Indirect sample\nFigure 3: A comparison between the results for direct and indirect calculations of the influence of \nexperience on accident liability. The mean number of responsible accidents and the risk ratios \n(responsible\/not responsible accidents), in the drivers’ second and later years (both standardized). The \ncorrelation between means and risk ratios was .619 (N=5, p>.05). \n 34  \nStandardized number of responsible accidents and risk ratios by age band\n Responsible accidents \n2001-2005\n Risk ratio R\/N<25 years\n25-30 years\n30-35 years\n35-40 years\n40-45 years\n45-50 years\n50-55 years\n55-60 years\n>60 years\n-1,5\n-1,0\n-0,5\n0,0\n0,5\n1,0\n1,5\n2,0\n2,5\n3,0\n \nFigure 4: A comparison between the results for direct and indirect calculations of the influence of age on \naccident liability. The mean number of responsible accidents in 2001-2005, and the risk ratios \n(responsible\/not responsible accidents), grouped according to age band (both standardized). The correlation \nbetween means and risk ratios was .800 (N=9, p<.05). \n 35  \nStandardized number of responsible number of accidents and risk ratios by\nage band for drivers with more than three years experience  \n Responsible accidents \n2001-2005\n Risk ratio R\/N<25 years\n25-30 years\n30-35 years\n35-40 years\n40-45 years\n45-50 years\n50-55 years\n55-60 years\n>60 years\n-1,5\n-1,0\n-0,5\n0,0\n0,5\n1,0\n1,5\n2,0\n \n \nFigure 5: A comparison between the results for direct and indirect calculations of the influence of age on \naccident liability for experienced drivers. The mean number of responsible accidents in 2001-2005, and the \nrisk ratios (responsible\/not responsible accidents), grouped according to age band (both standardized). The \ncorrelation between means and risk ratios was .560 (N=9, p>.05). However, the calculation of responsible \naccidents for <25 years contained only six drivers. \n \n \n \n \nBiographical sketches of the authors: \nLisa Dorn graduated with a BSc in Human Psychology in 1987 and was awarded a PhD \non 'Individual and Group Difference in Driving Behaviour' in 1992, both from Aston \nUniversity, UK. After several post-doctoral positions, Lisa was appointed as Director of \nthe Driving Research Group at Cranfield University in 2001. Her research interests are \ndriver training and the use of psychometrics for predicting driver behaviour and \naccidents. \n \nAnders af Wåhlberg graduated with a B. A. in history (1994) and  an M. A. in psychology \n(1996) from Uppsala University, and thereafter worked as a research assistant at the \nCenter for Risk Research, Stockholm School of Economics 1996-1998. He thereafter \npursued a PhD in psychology (2006) at the Department of Psychology, Uppsala \nUniversity, Sweden. His main research interests are driver behavior, traffic accidents, and \nmethodology, most often combined. \n"}