{"doi":"10.1080\/0968776020100209","coreId":"14223","oai":"oai:generic.eprints.org:383\/core5","identifiers":["oai:generic.eprints.org:383\/core5","10.1080\/0968776020100209"],"title":"A response to the critique of gender issues in computer‐supported learning","authors":["Gunn, Cathy","French, Sheila","MacLeod, Hamish","McSporran, Mae","Conole, Grainne"],"enrichments":{"references":[{"id":197793,"title":"Cultural feminism versus post-structuralism: the identity crisis in feminist theory',","authors":[],"date":"1997","doi":"10.1086\/494426","raw":"Alcoff, L. (1997), 'Cultural feminism versus post-structuralism: the identity crisis in feminist theory', in L. Nicholson (ed.), The Second Wave: A Reader in Feminist Theory, London: Routledge, 330-55.","cites":null},{"id":197794,"title":"Disciplinary discourses: a case study of gender in information technology and design courses',","authors":[],"date":"1999","doi":"10.1080\/09540259920753","raw":"Clegg, S., Mayfield, W. and Trayhurn, D. (1999), 'Disciplinary discourses: a case study of gender in information technology and design courses', Gender and Education, 11 (1), 43-55.","cites":null},{"id":1042870,"title":"Does gender matter in online learning?',","authors":[],"date":"2001","doi":"10.1080\/0968776010090202","raw":"McSporran, M. and Young, S. (2001), 'Does gender matter in online learning?', ALT-J, 9 (2), 3-11.","cites":null},{"id":1042871,"title":"Education on-line: what's in it for women?',","authors":[],"date":"2001","doi":"10.1007\/978-0-387-35509-2_36","raw":"Richardson, H. J. and French, S. (2001), 'Education on-line: what's in it for women?', in E. Balka and R. Smith (eds), Women, Work and Computerisation: Charting a Course to the Future, Boston: Kluwer.","cites":null},{"id":1042872,"title":"Stereotyping in relation to the gender gap in participation in computing',","authors":[],"date":"1988","doi":"10.1080\/0013188880300203","raw":"Siann, G., Durndell, A., Macleod, H. and Glissov, P. (1988), 'Stereotyping in relation to the gender gap in participation in computing', Educational Research, 30, 98-103.","cites":null},{"id":1042873,"title":"The effect of computer use on gender differences in attitudes to computers',","authors":[],"date":"1990","doi":"10.1016\/0360-1315(90)90058-f","raw":"Siann, G., Macleod, H., Glissov, P. and Durndell, A. (1990), 'The effect of computer use on gender differences in attitudes to computers', Computers in Education, 14 (2), 183-91.","cites":null},{"id":197795,"title":"Who wants to learn on-line? Identifying our flexible learners',","authors":[],"date":"1999","doi":"10.1145\/384267.305957","raw":"McSporran, M., Dewstow, R. and Young, S. (1999), 'Who wants to learn on-line? Identifying our flexible learners', Proceedings of the World Conference on Educational Multimedia, Hypermedia and Telecommunications Conference, Washington.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14223.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/383\/1\/ALT_J_Vol10_No2_2002_A%20response%20to%20the%20critique%20of%20.pdf","pdfHashValue":"efb04d62c518a5523008925969a614983f855783","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:383<\/identifier><datestamp>\n      2011-04-04T09:11:33Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/383\/<\/dc:relation><dc:title>\n        A response to the critique of gender issues in computer‐supported learning<\/dc:title><dc:creator>\n        Gunn, Cathy<\/dc:creator><dc:creator>\n        French, Sheila<\/dc:creator><dc:creator>\n        MacLeod, Hamish<\/dc:creator><dc:creator>\n        McSporran, Mae<\/dc:creator><dc:creator>\n        Conole, Grainne<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2002<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/383\/1\/ALT_J_Vol10_No2_2002_A%20response%20to%20the%20critique%20of%20.pdf<\/dc:identifier><dc:identifier>\n          Gunn, Cathy and French, Sheila and MacLeod, Hamish and McSporran, Mae and Conole, Grainne  (2002) A response to the critique of gender issues in computer‐supported learning.  Association for Learning Technology Journal, 10 (2).  pp. 80-82.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776020100209<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/383\/","10.1080\/0968776020100209"],"year":2002,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"A response to the critique of gender issues in\ncomputer-supported learning\nCathy Gunn,* Sheila French,** Hamish MacLeod,*** Mae McSporran**** and\nGrainne Conole*****\n*University of Auckland **Manchester Metropolitan University ***University of\nEdinburgh ****Unitec *****University of Southampton\nemail: ca.gunn@auckland.ac.nz\nWe find the critique of our paper both interesting and informative. The author raises a\nnumber of points as a caution against oversimplification of the issues surrounding gender\nand computer-supported learning. We fully acknowledge the difficulty of reporting\nfindings from a number of studies and of attempting to define or analyse the complex\ninteraction of already complex concepts such as gender, identity and behaviour within\ncomputer-supported learning environments.\nIn response we believe it is important to acknowledge the context in which the article was\nwritten: it summarized the research findings of several authors who together ran a\ndiscussion panel at the ALT Conference in 2001. The authors come from England, New\nZealand and Scotland, have different professional backgrounds and work in different\nacademic disciplines. We brought a variety of converging backgrounds with respect to\ntheories of gender to this collaboration, including cognitive, developmental and\nexperiential (Siann, Durndell, MacLeod and Glissov, 1988; Siann, MacLeod, Glissov and\nDurndell, 1990). The common interest we share is in the real business of working with\nstudents in technologically mediated learning environments. We have concerns, based on\ndirect observations, which we would like others to engage with us about.\nGender issues, we would argue, have not been at the fore of either the ALT journal or\nConference. Our purpose with both the panel and the paper was to raise awareness and to\nbring issues that our own and others' research identify as important to the attention of a\nwider audience. The paper was neither an in-depth study of gender, nor an analysis of the\nsocial and cultural practices which constitute science and technology. This paper was a\ndiscussion of the panel's findings from their own experiences with reference to published\nresearch from other contexts. Whilst the authors would have liked to explore the issues\n80\nALT-J Volume 10 Number 2\nfurther, the length of the paper as well as the complexity of the issues prevented us from\ndoing so. Fuller reading of the case studies cited can be found in Richardson and French\n(2001), McSporran, Dewstow and Young (1999) and McSporran and Young (2001).\nIn our paper, we have tended to universalize gender, particularly for the women in the\nstudies. We have not discussed class, ethnicity, educational background or institutional\nculture, although our collective experience does make us aware of the impact of these\nfactors. Whilst we argue we have tried to acknowledge such differences, we may appear to\nhave fallen into the trap of essentialism. The difficulties of exploring difference in students\nwithout losing the gendered subject, we agree, is complex and problematic. Richardson\nand French realized in their study that there seemed to be a presence of 'woman', which, as\nreported, was a minority on the course. The experiences of these women compelled the\nauthors to explore their experiences further. The authors were not blind to these differences\nbut attempted to recognize them, although this was not covered in the short paper.\nHowever, the authors also recognize that to explore differences among women perhaps\ncompels us to explore differences among men. This, we suggest, waters down the case of\nwomen and challenges the reasons we raised the issues in the first place. The authors\nacknowledge that this is a complex argument of feminist concern (Alcoff, 1997).\nFurther difficulties and complexities arise when reporting findings from a group of\ninternational authors. We, the authors, are from diverse cultures and different genders.\nBringing together findings based on race, ethnicity, our own gendered experience and that\nof our students is almost impossible. We all have our own subjectivities and the cultural\ncontexts we work in are not comparable. In our individual studies we did find differences in\nethnicity and class, which again varied across countries and cultures. For example,\nRichardson and French found their female students to be mainly under thirty, and of\ndiverse cultures and class. McSporran et al. found the females in their study were mainly\nworking class, predominantly white but including some Asian and other recent immigrant\ngroups, as well as mature students returning to work. Most of these women had seen the\nusefulness of computers in the workplace and were pragmatic in their choice of courses.\nHowever, our discussion revealed that there is no basis for comparison across the UK and\nNew Zealand cultures. Social class and the perceived role of women within these cultures\nare different, as is the acceptable role of researchers studying cultural groups that they do\nnot belong to. The ethnic mixes are very different, and so the complexity of definition and\nanalysis increases. Comparing - or even discussing - this in such a short piece of work was\ndifficult, if not impossible.\nMoving then to the educational aspects, the authors are aware that there is a body of work\nfrom authors such as Clegg, Mayfield and Trayhurn (1999) who discuss the many\ndiscourses around the field of computing. We recognize that these are also complex and\nneed further exploration, which some of us are pursuing.\nTo conclude, the discussion raised by Hughes from our original paper has been both\nstimulating and informative. The suggestions give the authors a further body of work to\nresearch should they so wish. We feel these discussions can only help to raise the profile of\ngender issues in computer-supported learning and hope they will be the start of a new and\nstimulating dialogue within the ALT arena. We propose that bringing the various discourses\nof gender, identity and computer-supported learning to the attention of academics in all\n81\nCathy Gunn et al A response to the critique of gender issues in computer-supported learning\ndisciplines will support a move towards the breadth of understanding required to address\nimbalances wherever these exist. A parallel to this is the evolution of the discipline of\nHuman Computer Interaction (HCI) which brought multi-disciplinary perspectives to\nsoftware design in order for its products to be suitable for, and accessible to non-specialists.\nReferences\nAlcoff, L. (1997), 'Cultural feminism versus post-structuralism: the identity crisis in\nfeminist theory', in L. Nicholson (ed.), The Second Wave: A Reader in Feminist Theory,\nLondon: Routledge, 330-55.\nClegg, S., Mayfield, W. and Trayhurn, D. (1999), 'Disciplinary discourses: a case study of\ngender in information technology and design courses', Gender and Education, 11 (1),\n43-55.\nMcSporran, M., Dewstow, R. and Young, S. (1999), 'Who wants to learn on-line?\nIdentifying our flexible learners', Proceedings of the World Conference on Educational\nMultimedia, Hypermedia and Telecommunications Conference, Washington.\nMcSporran, M. and Young, S. (2001), 'Does gender matter in online learning?', ALT-J, 9\n(2), 3-11.\nRichardson, H. J. and French, S. (2001), 'Education on-line: what's in it for women?', in\nE. Balka and R. Smith (eds), Women, Work and Computerisation: Charting a Course to the\nFuture, Boston: Kluwer.\nSiann, G., Durndell, A., Macleod, H. and Glissov, P. (1988), 'Stereotyping in relation to\nthe gender gap in participation in computing', Educational Research, 30, 98-103.\nSiann, G., Macleod, H., Glissov, P. and Durndell, A. (1990), 'The effect of computer use\non gender differences in attitudes to computers', Computers in Education, 14 (2), 183-91.\n82\n"}