{"doi":"10.1007\/s10714-007-0589-x","coreId":"70603","oai":"oai:eprints.lancs.ac.uk:11314","identifiers":["oai:eprints.lancs.ac.uk:11314","10.1007\/s10714-007-0589-x"],"title":"On the generalized Jacobi equation.","authors":["Perlick, Volker"],"enrichments":{"references":[{"id":16307532,"title":"A modiﬁed equation of geodesic deviation.","authors":[],"date":"1972","doi":"10.1007\/bf00759173","raw":"Hodgkinson, D.E.: A modiﬁed equation of geodesic deviation. Gen. Relativ. Gravit. 3, 351–375 (1972)","cites":null},{"id":16307540,"title":"A remarkable property of plane waves in general relativity.","authors":[],"date":"1965","doi":"10.1103\/revmodphys.37.215","raw":"Penrose, R.: A remarkable property of plane waves in general relativity. Rev. Modern Phys. 37, 215–220 (1965)","cites":null},{"id":16307542,"title":"Any space-time has a plane wave as limit.","authors":[],"date":"1976","doi":"10.1007\/978-94-010-1508-0_23","raw":"Penrose, R.: Any space-time has a plane wave as limit. In: M. Cahen, M. Flato (eds.) Diﬀerential geometry and relativity, pp. 271–275. Reidel, Dordrecht (1976)","cites":null},{"id":16307535,"title":"C.W.: Fermi normal coordinates and some basic concepts in diﬀerential geometry.","authors":[],"date":"1963","doi":"10.1063\/1.1724316","raw":"Manasse, F.K., Misner, C.W.: Fermi normal coordinates and some basic concepts in diﬀerential geometry. J. Math. Phys. 4, 735–745 (1963)","cites":null},{"id":16307523,"title":"Explicit Fermi coordinates and tidal dynamics in de Sitter and G¨ odel spacetimes.","authors":[],"date":"2006","doi":"10.1103\/physrevd.74.064019","raw":"Chicone, C., Mashhoon, B.: Explicit Fermi coordinates and tidal dynamics in de Sitter and G¨ odel spacetimes. Phys. Rev. D 74, 064,019 (2006)","cites":null},{"id":16307517,"title":"Fermi coordinates and Penrose limit.","authors":[],"date":"2006","doi":"10.1088\/0264-9381\/23\/11\/020","raw":"Blau, M., Frank, D., Weiss, S.: Fermi coordinates and Penrose limit. Class. Quant. Grav. 23, 3993–4010 (2006)","cites":null},{"id":16307529,"title":"G.F.R.: The large scale structure of space-time.","authors":[],"date":"1973","doi":"10.1017\/cbo9780511524646","raw":"Hawking, S.W., Ellis, G.F.R.: The large scale structure of space-time. Cambridge University Press, Cambridge (1973)","cites":null},{"id":16307525,"title":"Generalized geodesic deviation equation.","authors":[],"date":"1986","doi":"10.1103\/physrevd.34.1014","raw":"Ciufolini, I.: Generalized geodesic deviation equation. Phys. Rev. D 34, 1014– 1017 (1986)","cites":null},{"id":16307544,"title":"Gravitational lensing from a spacetime perspective. Living Rev.","authors":[],"date":"2004","doi":"10.12942\/lrr-2004-9","raw":"Perlick, V.: Gravitational lensing from a spacetime perspective. Living Rev. Relativity 7(9) (2004). http:\/\/www.livingreviews.org\/lrr-2004-9","cites":null},{"id":16307528,"title":"Higher-order geodesic deviations applied to the Kerr metric.","authors":[],"date":"2002","doi":"10.1088\/0264-9381\/19\/17\/309","raw":"Colistete, R., Leygnac, C., Kerner, R.: Higher-order geodesic deviations applied to the Kerr metric. Class. Quant. Grav. 19, 4573–4589 (2002)","cites":null},{"id":16307546,"title":"J.L.: A coordinate-free derivation of a generalized geodesic deviation equation.","authors":[],"date":"1983","doi":"10.1063\/1.525776","raw":"Swaminarayan, N.S., Safko, J.L.: A coordinate-free derivation of a generalized geodesic deviation equation. J. Math. Phys. 24, 883–885 (1983)","cites":null},{"id":16307514,"title":"nski, S.: Kinematics of relative motion of test particles in general relativity.","authors":[],"date":"1977","doi":null,"raw":"Ba˙ za´ nski, S.: Kinematics of relative motion of test particles in general relativity. Ann. Inst. H. Poincar´ e (A) 27, 115–144 (1977)","cites":null},{"id":16307537,"title":"On tidal phenomena in a strong gravitational ﬁeld.","authors":[],"date":"1975","doi":"10.1086\/153560","raw":"Mashhoon, B.: On tidal phenomena in a strong gravitational ﬁeld. Astrophys. J. 197, 705–716 (1975)","cites":null},{"id":16307534,"title":"Relativistic epicycles: another approach to geodesic deviations.","authors":[],"date":"2001","doi":"10.1088\/0264-9381\/18\/22\/302","raw":"Kerner, R., van Holten, J.W., Colistete R., J.: Relativistic epicycles: another approach to geodesic deviations. Class. Quant. Grav. 18, 4725–4742 (2001)","cites":null},{"id":16307548,"title":"The general theory. North-Holland,","authors":[],"date":"1960","doi":"10.1126\/science.132.3444.1933-b","raw":"Synge, J.L.: Relativity. The general theory. North-Holland, Amsterdam (1960)","cites":null},{"id":16307518,"title":"The generalized Jacobi equation.","authors":[],"date":"2002","doi":"10.1088\/0264-9381\/19\/16\/301","raw":"Chicone, C., Mashhoon, B.: The generalized Jacobi equation. Class. Quant. Grav. 19, 4231–4248 (2002)","cites":null},{"id":16307539,"title":"Tidal radiation.","authors":[],"date":"1977","doi":"10.1086\/155500","raw":"Mashhoon, B.: Tidal radiation. Astrophys. J. 216, 591–609 (1977)17","cites":null},{"id":16307521,"title":"Ultrarelativistic motion: inertial and tidal eﬀects in Fermi coordinates.","authors":[],"date":"2005","doi":"10.1088\/0264-9381\/22\/1\/013","raw":"Chicone, C., Mashhoon, B.: Ultrarelativistic motion: inertial and tidal eﬀects in Fermi coordinates. Class. Quant. Grav. 22, 195–205 (2005)","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-05","abstract":"The standard text-book Jacobi equation (equation of geodesic deviation) arises by linearizing the geodesic equation around some chosen geodesic, where the linearization is done with respect to the coordinates and the velocities. The generalized Jacobi equation, introduced by Hodgkinson in 1972 and further developed by Mashhoon and others, arises if the linearization is done only with respect to the coordinates, but not with respect to the velocities. The resulting equation has been studied by several authors in some detail for timelike geodesics in a Lorentzian manifold. Here we begin by briefly considering the generalized Jacobi equation on affine manifolds, without a metric; then we specify to lightlike geodesics in a Lorentzian manifold. We illustrate the latter case by considering particular lightlike geodesics (a) in Schwarzschild spacetime and (b) in a plane-wave spacetime","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70603.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/11314\/2\/genjac.pdf","pdfHashValue":"d5a360ce5636def699ecbb308399d2f04ff76a62","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:11314<\/identifier><datestamp>\n      2018-01-24T00:03:54Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        On the generalized Jacobi equation.<\/dc:title><dc:creator>\n        Perlick, Volker<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        The standard text-book Jacobi equation (equation of geodesic deviation) arises by linearizing the geodesic equation around some chosen geodesic, where the linearization is done with respect to the coordinates and the velocities. The generalized Jacobi equation, introduced by Hodgkinson in 1972 and further developed by Mashhoon and others, arises if the linearization is done only with respect to the coordinates, but not with respect to the velocities. The resulting equation has been studied by several authors in some detail for timelike geodesics in a Lorentzian manifold. Here we begin by briefly considering the generalized Jacobi equation on affine manifolds, without a metric; then we specify to lightlike geodesics in a Lorentzian manifold. We illustrate the latter case by considering particular lightlike geodesics (a) in Schwarzschild spacetime and (b) in a plane-wave spacetime.<\/dc:description><dc:date>\n        2008-05<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s10714-007-0589-x<\/dc:relation><dc:identifier>\n        Perlick, Volker (2008) On the generalized Jacobi equation. General Relativity and Gravitation, 40 (5). pp. 1029-1045. ISSN 0001-7701<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/11314\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1007\/s10714-007-0589-x","http:\/\/eprints.lancs.ac.uk\/11314\/"],"year":2008,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"General Relativity and Gravitation manuscript No.\n(will be inserted by the editor)\nVolker Perlick\nOn the generalized Jacobi equation\nReceived: date \/ Accepted: date\nAbstract The standard text-book Jacobi equation (equation of geodesic\ndeviation) arises by linearizing the geodesic equation around some chosen\ngeodesic, where the linearization is done with respect to the coordinates and\nthe velocities. The generalized Jacobi equation, introduced by Hodgkinson in\n1972 and further developed by Mashhoon and others, arises if the lineariza-\ntion is done only with respect to the coordinates, but not with respect to\nthe velocities. The resulting equation has been studied by several authors in\nsome detail for timelike geodesics in a Lorentzian manifold. Here we begin by\nbriefly considering the generalized Jacobi equation on affine manifolds, with-\nout a metric; then we specify to lightlike geodesics in a Lorentzian manifold.\nWe illustrate the latter case by considering particular lightlike geodesics (a)\nin Schwarzschild spacetime and (b) in a plane-wave spacetime.\nKeywords general relativity · light rays · Jacobi equation\n1 Introduction\nThe Jacobi equation, also known as the equation of geodesic deviation, de-\nscribes geodesics in the neighborhood of a reference geodesic. More precisely,\nthe Jacobi equation is the linearization of the geodesic equation around the\nreference geodesic, where the linearization is done with respect to the co-\nordinates and the velocities. Thus, the Jacobi equation describes geodesics\nwhich are close to the reference geodesic and whose velocities are close to the\nvelocity of the reference geodesic. The Jacobi equation has important ap-\nplications to General Relativity: For timelike geodesics, the Jacobi equation\nV. Perlick\nPhysics Department\nLancaster University\nLancaster LA1 4YB, United Kingdom\nE-mail: v.perlick@lancaster.ac.uk\n2describes the relative acceleration of freely falling particles around a freely\nfalling reference particle. This relative acceleration, which is determined by\nthe curvature tensor along the worldline of the reference particle, can be in-\nterpreted as the tidal force produced by the gravitational field. For lightlike\ngeodesics, the Jacobi equation determines the shape of light bundles around\na reference light ray. Again, the expansion and distortion of the bundle is\ndetermined by the curvature tensor along the reference light ray. Detailed\ndiscussions of the Jacobi equation (or geodesic deviation equation) can be\nfound in almost any text-book on General Relativity, see e.g. Synge [19],\nMisner, Thorne and Wheeler [14] or Hawking and Ellis [8].\nIf a geodesic is close to a reference geodesic but its velocity is not, the\nJacobi equation does not give a valid approximation for it. Such a geodesic is\nproperly described by an equation which is linearized only with respect to the\ncoordinates but not with respect to the velocities. Such a generalized Jacobi\nequation was brought forward, for timelike geodesics in a general-relativistic\nspacetime, by Hodgkinson [9]. This equation describes tidal forces on particles\nwhose relative velocity is not small. Applications to astrophysics were given\nby Mashhoon [12,13]. The generalized Jacobi equation was independently\nrediscovered by Ciufolini [6]. More recently, its implications were studied in\na series of papers by Chicone and Mashhoon [3–5].\nIn geometric terms, the ordinary Jacobi equation approximates the geo-\ndesic flow on a tubular neighborhood of the reference geodesic in phase space\n(i.e., in the cotangent bundle over the base manifold). By contrast, the gen-\neralized Jacobi equation approximates the geodesic flow on a neighborhood\nin phase space that is unrestricted in the fiber dimension.\nAll the references quoted above consider the generalized Jacobi equation\nfor timelike geodesics, which is physically of particular relevance because of\nits relation to tidal forces. In this article we want to discuss the generalized\nJacobi equation for lightlike geodesics. Then it describes light rays around\na reference light ray. The domain where the generalized Jacobi equation is\napplicable but the Jacobi equation is not encompasses all neighboring light\nrays that are close to the reference light ray but whose velocities are not.\nAlthough we are mainly interested in lightlike geodesics, it is worthwile\nto note that the geodesic equation and, hence, the Jacobi equation and the\ngeneralized Jacobi equation can be formulated on an affine manifold, without\na metric. All that is needed is a connection. We begin by deriving the affine\ngeneralized Jacobi equation in Section 2. In Section 3 we specify to lightlike\ngeodesics of a Lorentzian metric. In this case, the generalized Jacobi equation\ncan be used to describe light bundles with arbitrarily large opening angle\naround a reference light ray. Of course, if the opening angle is large, the light\nrays will leave the neighborhood of the reference light ray soon, unless they\nare being refocused towards the reference light ray. So the generalized Jacobi\nequation can be used, in general, as a valid approximation only close to the\nvertex of the bundle. The general results of this section are illustrated by\nconsidering a bundle around a circular light ray at r = 3m in Schwarzschild\nspacetime. In Section 4 we consider lightlike Fermi normal coordinates which\nallow to write the generalized Jacobi equation in terms of the curvature tensor\n3along the reference light ray. As an example, we consider a bundle of light\nrays in a plane-wave spacetime.\nThroughout we work with the generalized Jacobi equation in the sense of\nHodgkinson, Mashhoon etc. This equation is linearized with respect to the\ncoordinates but retains full dependence of the velocities. As an alternative,\none may approximate with respect to the coordinates and the velocities up\nto common order N . This approach, which dates back to Baz˙an´ski [1], can\nbe used to set up an iterative scheme. One begins by solving the ordinary\nJacobi equation, then calculates the corrections due to second-order terms\nand so on. This method was applied to particle motion in Schwarzschild and\nKerr spacetimes by Kerner et al. [10,7].\nThis paper is dedicated to Bahram Mashhoon on occasion of his 60th\nbirthday. I have very much profited from discussions with him and from\nreading his papers. In particular, I wish to thank him for introducing me to\nthe subject of the generalized Jacobi equation.\n2 The generalized Jacobi equation in an affine manifold\nAn affine manifold is a manifold with an affine connection ∇. In local coor-\ndinates, the connection is determined by its connection coefficients Γµνσ,\n∇∂ν∂σ = Γµνσ ∂µ . (1)\nHere and in the following, the dimension of the manifold is n, and we use the\nsummation convention for greek indices running from 1 to n.\nWhenever we have an affine manifold, we can consider the geodesic equa-\ntion\nd2xµ\nds2\n+ Γµνσ(x)\ndxν\nds\ndxσ\nds\n= 0 . (2)\nThe solution curves xµ(s) of (2) are the geodesics (autoparallels) of the affine\nconnection. As a geodesic remains a geodesic under affine reparametrization,\ns 7→ as + b, it is usual to refer to s as to an “affine parameter”. Note that\nonly the symmetric part of Γµνσ enters into the geodesic equation. The anti-\nsymmetric part\nT µνσ := Γ\nµ\nνσ − Γµσν , (3)\nwhich is called the “torsion”, drops out from the geodesic equation. As in the\nfollowing we are interested only in the geodesic equation, and in equations\nderived thereof, we may replace any connection by its symmetrized version.\nTherefore we will assume in the following that the connection is symmetric,\nΓµνσ = Γ\nµ\nσν . (For the Jacobi equation and some of its generalizations in terms\nof a non-symmetric connection see, e.g., Swaminarayan and Safko [18].)\nNow fix a geodesic Xµ(s),\nd2Xµ\nds2\n+ Γµνσ(X)\ndXν\nds\ndXσ\nds\n= 0 . (4)\nWe will call it the “reference geodesic”, and we will assume that it is known,\ni.e., that we have the Xµ explicitly as functions of the curve parameter s.\n4Then the geodesic equation for a neighboring curve xµ(s) = Xµ(s) + ξµ(s)\nresults from inserting xµ(s) = Xµ(s) + ξµ(s) into (2) and subtracting (4),\nd2ξµ\nds2\n+ Γµνσ(X + ξ)\n( dXν\nds\n+\ndξν\nds\n) ( dXσ\nds\n+\ndξσ\nds\n)\n(5)\n− Γµνσ(X)\ndXν\nds\ndXσ\nds\n= 0 .\nWith Xµ(s) known, (5) is a system of second order ordinary differential equa-\ntions for the n functions ξµ(s). It is the exact geodesic equation, expressed in\nterms of the coordinate difference ξµ(s) with respect to the reference geodesic\nXµ(s).\nIf we linearize (5) with respect to ξµ, but not with respect to dξµ\/ds, we\nget\nd2ξµ\nds2\n+ Γµνσ(X)\n(\n2\ndξν\nds\ndXσ\nds\n+\ndξν\nds\ndξσ\nds\n)\n(6)\n+ ∂τΓ\nµ\nνσ(X) ξ\nτ\n( dXν\nds\n+\ndξν\nds\n)( dXσ\nds\n+\ndξσ\nds\n)\n= 0 .\nThis is the generalized Jacobi equation, on an affine manifold, in arbitrary\ncoordinates.\nBy contrast, if we linearize (5) both with respect to ξµ and with respect\nto dξµ\/ds, we get\nd2ξµ\nds2\n+ Γµνσ(X) 2\ndξν\nds\ndXσ\nds\n+ ∂τΓ\nµ\nνσ(X) ξ\nτ dX\nν\nds\ndXσ\nds\n= 0 . (7)\nThis is the ordinary Jacobi equation in arbitrary coordinates. To recover the\nstandard text-book form, we have to introduce the covariant derivative along\nX(s), which is defined by\nDηµ\nds\n=\ndηµ\nds\n+ Γµρτ (X) η\nρ dX\nτ\nds\n(8)\nfor any ην , and the curvature tensor\nRµτνσ = ∂νΓ\nµ\nτσ − ∂τΓµνσ + Γµνλ Γ λτσ − Γµτλ Γ λνσ . (9)\nThen a straight-forward calculation reduces (7) to\nD2ξµ\nds2\n+ Rµτνσ(X) ξ\nν dX\nτ\nds\ndXσ\nds\n= 0 , (10)\nwhich is, indeed, the standard text-book form of the ordinary Jacobi equa-\ntion.\nThe generalized Jacobi equation (6) is a second order non-linear ordinary\ndifferential equation for ξµ(s). It is non-autonomous because the coefficients\nΓµνσ(X) and ∂τΓ\nµ\nνσ(X) are functions of the curve parameter s. It gives a valid\napproximation for all those geodesics for which the ξµ(s) are small, whereas\nthe dξµ(s)\/ds need not be small. Of course, if the dξµ(s)\/ds are not small, the\n5ξµ(s) will in general remain small only for a small interval of the parameter s.\nSuch geodesics will leave the neighborhood of the reference geodesic soon and\nthe generalized Jacobi equation will, in general, give a valid approximation\nfor them only on a small interval of the parameter s.\nThe generalized Jacobi equation may be modified in two ways.\n– One may prefer to choose a different, non-affine, parametrization for the\n(approximate) geodesics.\n– One may wish to choose special coordinates such that the generalized\nJacobi equation takes a simpler form and that it can be easier compared\nfor two different geodesics.\nBoth is possible in an affine manifold, without refering to a metric.\nAs to the first item, it is often convenient to use on a geodesic a (non-\naffine) parameter u which coincides with one of the coordinates, say u = xn.\nThis is possible for all curves which are transverse to the hypersurfaces\nxn = constant. Then the dependence of the xn coordinate on the parameter\nis known, xn(u) = u, and the geodesic equation reduces to a system of differ-\nential equations for the remaining coordinate functions\n(\nx1(u), . . . , xn−1(u)\n)\n.\nThe condition that two curves X(u) and X(u)+ ξ(u), both parametrized by\nu = xn, are geometrically close is equivalent to the condition that the ξi(u)\nare small for i = 1, . . . , (n− 1). By contrast, if an affine parameter s is used\nit may be that not all of the ξµ(s) are small even if the two geodesics are\ngeometrically close. This happens if the affine parameter on one of the two\ngeodesics lags behind or runs ahead of the other.\nTherefore we will now rewrite the generalized Jacobi equation with re-\nspect to the new curve parameter u = xn. We first observe that the µ = n\ncomponent of the geodesic equation (2) can be written in the form\nd2u\nds2\n+ Γnνσ(x)\ndxν\ndu\ndxσ\ndu\n( du\nds\n)2\n= 0 , (11)\nand the remaining (n− 1) components as\nd\nds\n(du\nds\ndxi\ndu\n)\n+ Γ iνσ(x)\ndxν\ndu\ndxσ\ndu\n( du\nds\n)2\n= 0 . (12)\nHere and in the following, latin indices i, j, . . . take values 1 to (n − 1).\nCalculating the first term of (12) with the product rule and inserting (11)\nresults in\nd2xi\ndu2\n− Γnνσ(x)\ndxν\ndu\ndxσ\ndu\ndxi\ndu\n+ Γ iνσ(x)\ndxν\ndu\ndxσ\ndu\n= 0 . (13)\nTogether with the equation xn(u) = u, (13) determines the geodesics (or,\nmore precisely, those geodesics that are transverse to the surfaces xn =\nconstant) with the non-affine parametrization by u = xn. (13) is a system of\nsecond order ordinary differential equations for the (n − 1) functions xi(u).\nClearly, these differential equations are non-autonomous because the coeffi-\ncients depend on u = xn. Also, as a result of the reparametrization we have\nnow got a system of equations that is cubic, rather than quadratic, in the\nvelocities.\n6In analogy to our earlier procedure we search for solutions of (13) in the\nform xµ(u) = Xµ(u)+ξµ(u), with Xµ a known geodesic, now reparametrized\nby u = xn. Of course, as xn(u) = Xn(u) = u, we have ξn(u) = 0. Inserting\nxi(u) = X i(u) + ξi(u) into (13), and linearizing with respect to the ξi, but\nnot with respect to the dξi\/du, gives us the reparametrized version of the\ngeneralized Jacobi equation,\nd2ξi\ndu2\n+ Γ iνσ(X)\n(\n2\ndXν\ndu\ndξσ\ndu\n+\ndξν\ndu\ndξσ\ndu\n)\n(14)\n−Γnνσ(X)\n(\n2\ndXν\ndu\ndξσ\ndu\n+\ndξν\ndu\ndξσ\ndu\n) dX i\ndu\n−Γnνσ(X)\n(dXν\ndu\n+\ndξν\ndu\n)(dXσ\ndu\n+\ndξσ\ndu\n) dξi\ndu\n+ ∂τΓ\ni\nνσ(X) ξ\nτ\n((dXν\ndu\n+\ndξν\ndu\n)(dXσ\ndu\n+\ndξσ\ndu\n)\n− ∂τΓnνσ(X) ξτ\n((dXν\ndu\n+\ndξν\ndu\n)(dXσ\ndu\n+\ndξσ\ndu\n)(dX i\ndu\n+\ndξi\ndu\n)\n= 0 .\nWe now turn to the question of whether the generalized Jacobi equation\ncan be simplified by choosing special coordinates. To that end we will use\nFermi coordinates. Text-books on general relativity treat Fermi coordinates\nnear a timelike reference geodesic (or, more generally, near a timelike refer-\nence curve) in a Lorentzian manifold, see e.g. Synge [19]. However, it is fairly\nobvious that, by an analogous procedure, one can introduce Fermi coordi-\nnates near an arbitrary reference geodesic in an affine manifold, without a\nmetric. The construction is as follows.\nLet an affinely parametrized geodesic X(s) be given. Choose an n-bein\n(i.e., n linearly independent vectors) at one point of the geodesic, such that\nthe nth vector coincides with the tangent vector of the geodesic, and trans-\nport this n-bein parallelly along X(s). Denote the n resulting vector fields\nalong the geodesic by E1(s), . . . , En(s). As X(s) is an affinely parametrized\ngeodesic, En(s) coincides with the tangent vector dX(s)\/ds for all s. Let\nexp denote the exponential map of the given connection which, as indi-\ncated above, is assumed to be torsion-free. Then every point in a sufficiently\nsmall tubular neighborhood of the given geodesic can be written uniquely as\nexpX(u)(x\niEi(u)). The n numbers (x\n1, . . . , xn−1, u) are the Fermi coordinates\nof this point. By definition of the exponential map, this means that the Fermi\ncoordinates are determined by the following property: The point with Fermi\ncoordinates (x1, . . . , xn−1, u) can be reached by following the geodesic with\ninitial point X(u) and initial tangent vector xiEi(u) up to the affine param-\neter 1. By construction, the Fermi coordinate u coincides along the geodesic\nX(s) with the affine parameter s. Along neighboring geodesics, however, the\nFermi coordinate u will give a non-affine parametrization in general.\nNote that Fermi coordinates are well-defined only on a (possibly small)\ntubular neighborhood of a chosen geodesic X(s). Farther away from X(s)\n7they need not exist, because there may be points that cannot be reached by\na geodesic starting on X(s), and they need not be unique, because geodesics\nissuing from a point on X(s) may intersect.\nThe crucial property of Fermi coordinates is that, in such coordinates, the\nconnection coefficients Γµνσ vanish on X(s). To prove this, we first observe\nthat ∇∂n∂µ = 0 along X(s) because the Eµ are parallelly transported, hence\nΓµnσ(X) = 0. As the connection is symmetric, this implies that Γ\nµ\nσn(X) = 0.\nWhat remains to be proven is that Γµij(X) = 0. We use the fact that\n∇(∂i+∂j)\n(\n∂i + ∂j\n)\n= ∇∂i∂i + ∇∂j∂j + ∇∂i∂j + ∇∂j∂i . (15)\nAs for any (n− 1)-tuple (x1, . . . , xn−1) the integral curves of xi∂i that start\non X(s) are geodesics, the left-hand side and the first two terms on the right-\nhand side of (15) vanish onX(s). Thus, (15) tells us that Γµij(X)+Γ\nµ\nji(X) = 0.\nAs our connection is symmetric, this implies that, indeed, Γµij(X) = 0.\nIf written in Fermi coordinates, the generalized Jacobi equation (14) sim-\nplifies considerably because of Γµνσ(X) = 0. Moreover, the use of Fermi co-\nordinates reduces the generalized Jacobi equation to a standard form which\nfacilitates comparison of this equation for two different geodesics. In Sec-\ntion 4 below we will make this explicit for lightlike geodesics in a Lorentzian\nmanifold, where the Fermi coordinates can be further specified.\n3 The generalized Jacobi equation for lightlike geodesics in\narbitrary coordinates\nWe now specify the results of the preceding section to the case that ∇ is the\nLevi-Civita connection of a pseudo-Riemannian metric g = gµνdx\nµdxν ,\nΓµνσ =\n1\n2\ngµρ\n(\n∂νgσρ + ∂σgνρ − ∂ρgνσ\n)\n, (16)\nwhere, as usual,\ngµν gνσ = δ\nµ\nσ . (17)\nWe assume that the metric has Lorentzian signature (+, , . . . ,+,−), and\nwe want to discuss the generalized Jacobi equation for the case of lightlike\ngeodesics,\ngµν\ndxµ\nds\ndxν\nds\n= 0 . (18)\nIf the dimension n of the manifold is equal to 4, lightlike geodesics can be\ninterpreted as light rays in a general-relarivistic spacetime. The mathematical\nresults, however, hold for any n.\nLet us briefly recall the well-known fact that, if the connection coefficients\nΓµνσ are given in terms of a metric via (16), the geodesic equation (2) can be\nderived from a Hamiltonian. As a matter of fact, Hamilton’s equations for\nthe Hamiltonian\nH(x, p) =\n1\n2\ngµν(x) pµ pν . (19)\n8take the form\ndxµ\nds\n= pµ , (20)\ndpµ\nds\n=\n1\n2\n(∂µg\nρσ)(x) pρ pσ . (21)\nThe derivative with respect to s of (21), together with (20) and (16), indeed\nreproduces the geodesic equation (2). By (20), the side-condition (18) takes\nthe form\nH(x, p) = 0 . (22)\nA reparametrization of the solution curves can be achieved for lightlike\ngeodesics in a particularly convenient way: We just have to multiply the\nHamiltonian with an appropriate function of x and p. If we want to change\nfrom the affine parameter s to the parameter u = xn, we can proceed in the\nfollowing way. We first recall that such a reparametrization is possible for\nall geodesics that are transverse to the hypersurfaces xn = constant. (This\ncondition is true for all lightlike geodesics if and only if the hypersurfaces\nxn = constant are spacelike. However, we may also consider the case that\nthese hypersurfaces are lightlike or timelike; then the transversality condition\nonly holds for some lightlike geodesics.) By (20) and (18), the transversality\ncondition is true if gnσ(x)pσ 6= 0. This condition determines an open subset\nof the cotangent bundle (phase space). On this subset we can switch from\nthe Hamiltonian (19) to the modified Hamiltonian\nH˜(x, p) =\ngµν(x) pµ pν\n2 gnσ(x) pσ\n. (23)\nHamilton’s equation with the Hamiltonian H˜ read\ndxµ\ndu\n= − H˜(x, p) g\nnµ(x)\ngnσ(x) pσ\n+\ngµν(x) pν\ngnσ(x) pσ\n, (24)\ndpµ\ndu\n= − H˜(x, p) (∂µg\nnρ)(x) pρ\ngnσ(x) pσ\n+\n(∂µg\nρτ )(x) pρ pτ\n2 gnσ(x) pσ\n, (25)\nand the side-condition (22) is equivalent to\nH˜(x, p) = 0 . (26)\nWith (26), the µ = n component of (24) reduces to\ndxn\ndu\n= 1 , (27)\nso the new curve parameter u coincides, indeed, with the coordinate xn (up\nto an additive constant that can be chosen at will). The other components\nof (24) take the form\ndxi\ndu\n=\ngiν(x) pν\ngnσ(x) pσ\n, (28)\n9where, as before, latin indices range from 1 to (n− 1), and (25) reduces to\ndpµ\ndu\n=\n(∂µg\nρτ )(x) pρ pτ\n2 gnσ(x) pσ\n. (29)\nApplying the derivative operator d\/du to (28), and using (29), reproduces\nthe equation (13) for u-parametrized geodesics. We have thus proven that\nthe lightlike geodesics of the metric g = gµν(x)dx\nµdxν , if reparametrized\nby u = xn, can be derived from the Hamiltonian (23) together with the\nside-condition (26).\nThis gives us a convenient method of how to derive the generalized Jacobi\nequation for lightlike geodesics parametrized by u = xn: Start out from the\nHamiltonian (23). Write Hamilton’s equations with the side-condition (26).\nRewrite this as second-order equations for the xµ. Fix a solution Xµ(u) to\nthese equations, substitute xµ(u) = Xµ(u)+ξµ(u), and linearize with respect\nto the ξµ but not with respect to the dξµ\/du.\nThe resulting set of equations describes lightlike geodesics X(u) + ξ(u)\nwhich are close to the lightlike geodesic X(u) but whose tangent vectors need\nnot be close to the tangent vector of X(u). For n = 4 these equations can\nbe used, by choosing initial conditions appropriately, for describing a homo-\ncentric light bundle around a central light ray X(u) in a general-relativistic\nspacetime. If the vertex of the bundle is at u = u0, say, we have to choose the\ninitial conditions as ξi(u0) = 0. There are only (n−2) = 2 independent solu-\ntions because the side-condition (18) fixes one of the dξi\/du in terms of the\nothers. This is in agreement with the intuitively obvious fact that a homo-\ncentric light bundle has (n−2) = 2 dimensions transverse to the propagation\ndirection. In contrast to the ordinary Jacobi equation, the generalized Jacobi\nequation can be used to describe homocentric bundles whose opening angle\nis arbitrarily large but the approximation is valid, in general, only for small\nvalues of u − u0, i.e., close to the vertex of the bundle. For larger values of\nu− u0, the ξi(u) will, in general, not be small, so the fact that we linearized\nwith respect to these quantities may produce large errors.\nTo be sure, there are special examples were the generalized Jacobi equa-\ntion holds for a large parameter interval. An example of this kind will be\ngiven in Section 4; in this example even the Jacobi equation, the generalized\nJacobi equation and the exact geodesic equation coincide. In general, how-\never, the generalized Jacobi equation for lightlike geodesics is a short-time\nequation, describing the temporal evolution of light bundles with arbitrarily\nlarge opening angles near their vertex.\nWe illustrate the general results of this section with an example.\nExample 1: We want to calculate, with the help of the generalized Jacobi\nequation, the evolution of a light bundle around a circular geodesic at r = 3m\nin Schwarzschild spacetime. The Schwarzschild metric is\ngµν dx\nµ dxν = − (1− 2m\nr\n)\ndt2 +\ndr2\n1− 2m\nr\n+ r2 dϑ2 + r2 sin2ϑ dϕ2 . (30)\nIt is well-known that a lightlike geodesic that starts tangentially to the circle\nr = 3m, ϑ = π\/2, will stay on this circle. We want to write the generalized\n10\nJacobi equation for lightlike geodesics near this circular geodesic. We will use\nthe azimuthal coordinate ϕ for the parameter, u = xn = ϕ. This excludes\ngeodesics tangent to a half-space ϕ = constant. Therefore, our parametriza-\ntion allows us to treat bundles with any opening angle smaller than π\/2\naround the circular geodesic, but not the limiting case that the opening an-\ngle is equal to π\/2. Using ϕ for the parameter gives us directly the intersection\nof the bundle with any half-plane ϕ = constant.\nAfter calculating the contravariant components gµν of the Schwarzschild\nmetric, we write the Hamiltonian (23) with xn = ϕ ,\nH˜(x, p) =\n1\n2\n(\npϕ +\nsin2ϑ\npϕ\n(\np2ϑ + r (r − 2m) p2r −\nr3 p2t\nr − 2m\n) )\n. (31)\nUsing the side-condition H˜(x, p) = 0, Hamilton’s equations for the Hamilto-\nnian H˜ take the form\ndϕ\ndu\n= 1 ,\ndt\ndu\n= − r\n3sin2ϑ pt\n(r − 2m) pϕ ,\ndϑ\ndu\n=\nsin2ϑ pϑ\npϕ\n, (32)\ndr\ndu\n=\nr (r − 2m) sin2ϑ pr\npϕ\n,\ndpϕ\ndu\n= 0 ,\ndpt\ndu\n= 0 ,\ndpϑ\ndu\n=\ncosϑ pϕ\nsinϑ\n, (33)\ndpr\ndu\n= − (r −m) sin\n2ϑ p2r\npϕ\n+\nr2(r − 3m) sin2ϑ p2t\n(r − 2m)2 pϕ .\nIf we apply the derivative d\/du to the expressions for dϑ\/du and dr\/du from\n(32), use (33) and the side-condition H˜(x, p) = 0, we arrive at the following\nsecond order system for ϑ(u) and r(u).\nd2ϑ\ndu2\n=\n2 cosϑ\nsinϑ\n( dϑ\ndu\n)2\n+ sinϑ cosϑ . (34)\nd2r\ndu2\n=\n2 cosϑ\nsinϑ\ndϑ\ndu\ndr\ndu\n+\n2\nr\n( dr\ndu\n)2\n+ (r−3m)\n( ( dϑ\ndu\n)2\n+ sin2ϑ\n)\n. (35)\nObviously, this system of equations admits the solution\nr(u) = 3m, ϑ(u) =\nπ\n2\n. (36)\nIn order to linearize around this circular lightlike geodesic, we write\nr(u) = 3m +\n1√\n3\nξr(u) , ϑ(u) =\nπ\n2\n+\n1\n3m\nξϑ(u) . (37)\nThe numerical factors are chosen such that\ng(∂ξr , ∂ξr ) = g(∂ξϑ , ∂ξϑ) = 1 (38)\n11\nat r = 3m, ϑ = π\/2. Inserting (37) into (34) and (35), and linearizing with\nrespect to ξϑ and ξr, but not with respect to dξϑ\/du and dξr\/du, gives us\nthe generalized Jacobi equation:\nd2ξϑ\ndu2\n= − ξϑ − 2 ξ\nϑ\n9m2\n( dξϑ\ndu\n)2\n, (39)\nd2ξr\ndu2\n= ξr +\nξr\n9m2\n( ( dξϑ\ndu\n)2\n− 2\n3\n( dξr\ndu\n)2 )\n(40)\n− 2 ξ\nϑ\n9m2\ndξϑ\ndu\ndξr\ndu\n+\n2\n3\n√\n3m\n( dξr\ndu\n)2\n.\nIf we linearize also with respect to dξϑ\/du and dξr\/du, only the first term\non the right-hand side of (39) and of (40) survives,\nd2ξϑ\ndu2\n= − ξϑ , (41)\nd2ξr\ndu2\n= ξr . (42)\nThis is the ordinary Jacobi equation.\nIf we solve (41) and (42) with initial conditions\nξϑ(0) = 0 , ξr(0) = 0 , (43)\ndξϑ\ndϕ\n(0) = − ε sinχ , dξ\nr\ndϕ\n(0) = ε cosχ , (44)\nwith χ running from 0 to 2π and ε fixed, it gives us the cross-section of an\ninitially circular bundle with opening angle proportional to ε. Owing to the\nlinearity of the ordinary Jacobi equation, the cross-section of such a bundle\nwill be elliptic for all values of u = ϕ. As a consequence of the plus sign on\nthe right-hand side of (42), in contrast to the minus sign on the right-hand\nside of (41), the expansion of the bundle will increase in the ξr direction\nand decrease in the ξϑ direction; hence the major axis of the ellipse is in the\nξr direction. This reflects the fact that the circular geodesic at r = 3m is\nunstable with respect to perturbations in the ξr direction but stable with\nrespect to perturbations in the ξϑ direction.\nBy contrast, if we solve the non-linear equations (39) and (40) with initial\nconditions (43) and (44), the cross-section of the resulting bundle will not be\nelliptic. The larger the opening angle ε, the stronger the deviation from the\nelliptic shape due to the non-linearities, see Figure 1.\nThis example demonstrates how the generalized Jacobi equation can be\nused for calculating the shapes of light bundles, beyond the small-angle ap-\nproximation that is inherent in the standard treatment based on the ordinary\nJacobi equation. Of course, one has to keep in mind that the generalized Ja-\ncobi equation is, in genetral, a valid approximation only close to the vertex\nof the bundle.\n12\nξr\nξϑ\nFig. 1 Cross section of initially circular light bundle around a circular lightlike\ngeodesic in Schwarzschild spacetime, calculated with the generalized Jacobi equa-\ntion. The point (ξr, ξϑ) = (0, 0) represents the circular geodesic at r = 3m and\nϑ = pi\/2. The ξr axis is in the equatorial plane, pointing outwards. The ξϑ axis is\nperpendicular to the equatorial plane, pointing downwards. The picture shows the\nintersection with a half-plane ϕ = constant close to the vertex of the bundle, for\nfour different opening angles.\n4 The generalized Jacobi equation for lightlike geodesics in Fermi\ncoordinates\nWe have already discussed how, on an affine manifold, Fermi coordinates can\nbe introduced near a reference geodesic X(s). The construction involved the\nchoice of a parallely transported n-bein E1(s), . . . , En(s) along the chosen\ngeodesic which was arbitrary apart from the fact that En(s) should coincide\nwith the tangent vector dX(s)\/ds of the reference geodesic. If our connection\nis the Levi-Civita connection of a Lorentzian metric, we can further specify\nthis n-bein. For a timelike reference geodesic, it is usual to require that the\nn-bein be orthonormal. Then E1(s), . . . , En−1(s) span the spacelike ortho-\ncomplement of dX(s)\/ds at each value of s. Thus, in the Fermi coordinates\n(x1, . . . , xn−1, u) the hypersurfaces u = constant intersect the timelike ref-\nerence geodesic X(s) orthogonally and are, therefore, spacelike near X(s).\n(Farther away from X(s) they need not be spacelike.) These are the Fermi\nnormal coordinates treated in standard text-books on general relativity. In\nthese coordinates the metric attains a standard form if written up to second\norder in the transverse coordinates. This standard form was derived by Man-\nasse and Misner [11] and can be found, e.g., in Misner, Thorne and Wheeler\n[14], p.332.\n13\nWhereas this standard text-book treatment of Fermi normal coordinates\nassumes a timelike geodesic, here we are interrested in Fermi coordinates\nnear a lightlike reference geodesic X(s). Then the n-bein cannot be chosen\northonormal because of the requirement that En(s) = dX(s)\/ds. The best\nchoice is to have En−1(s) lightlike with\ngµν\n(\nX(s)\n)\nEµn−1(s)E\nν\nn(s) = − 1 , (45)\nand the remaining vectors E1(s), . . . , En−2(s) orthonormal and perpendic-\nular to both En−1 and En. (Condition (45) assures that En−1 is future-\npointing if En is future-pointing.) With this choice, the resulting Fermi co-\nordinates (x1, . . . , xn−2, xn−1 = v, u) yield hypersurfaces u = constant that\nare lightlike where they meet the reference geodesic X(s). The hypersurface\nv = 0 is lightlike along the reference geodesic X(s) which is completely con-\ntained in this hypersurface. These lightlike Fermi normal coordinates were\ndiscussed in some detail in a recent article by Blau, Frank and Weiss [2].\nIn that article, the authors derive the general expression for the metric in\nlightlike Fermi normal coordinates, up to second order in the coordinates\naway from the reference geodesic. This result is the lightlike analogue of the\nabove-mentioned Manasse-Misner representation of the metric near a time-\nlike geodesic. If adapted to our sign and index conventions, it reads\ngµν dx\nµ dxν = − 2 du dv + δAB dxA dxB − Rinjn(u)xi xj du2 (46)\n− 4\n3\nRikjn(u)x\ni xj dxk du − 1\n3\nRikjl(u)x\ni xj dxk dxl . . .\nHere the Fermi coordinates are denoted (x1, . . . , xn−2, xn−1 = v, u), as out-\nlined above. As before, greek indices run from 1 to n and lower case latin\nindices i, j, k, l, . . . run from 1 to (n−1). In addition, upper case latin indices\nA,B, . . . run from 1 to (n− 2). As usual, δAB denotes the Kronecker delta.\nRρνστ (u) = gρµ(u)R\nµ\nνστ (u) is the purely covariant version of the curvature\ntensor (9), evaluated at (x1 = 0, . . . , xn−2 = 0, xn−1 = v = 0, u), i.e., along\nthe reference geodesic. The ellipses in (46) indicate terms of third and higher\norder with respect to the xi.\nWith the contravariant metric components gµν calculated, up to second\norder, from (46), we can write the Hamiltonian (23) up to second order. This\nis enough to write the pertaining Hamilton equations up to first order, which\ntogether with the constraint (26) will give us the generalized Jacobi equation\nin lightlike Fermi normal coordinates near an arbitrary lightlike reference\ngeodesic.\nWe will illustrate this with an example.\nExample 2: Consider a plane-wave spacetime in Brinkmann coordinates\n(x1, . . . , xn−2, v, u),\ngµν dx\nµ dxν = − 2 du dv − hAB(u)xA xB du2 + δAB dxA dxB , (47)\nwhere hAB(u) = hBA(u) has a non-negative trace,\nδAB hAB(u) ≥ 0 , (48)\n14\nbut is arbitrary otherwise. For n = 4, any such metric can be interpreted as a\ncombined gravitational and electromagnetic plane wave. If equality holds in\n(48), the spacetime is Ricci-flat and, thus, a pure gravitational wave. For any\nchoice of hAB(u), the vector field ∂v is lightlike and absolutely parallel. For\na discussion of the geometry of plane-wave spacetimes the reader is refered\nto Penrose [15].\nPlane-wave spacetimes have the following interesting property, first dis-\ncovered by Penrose [16]. Near any lightlike geodesic in any spacetime, the\nmetric takes the form of a plane wave in a well-defined limit, called the\nPenrose limit. Thereby the original geodesic is represented as the curve\n(x1 = 0, . . . , xn−2 = 0, v = 0, u) in the limiting plane-wave spacetime (47).\nThe Penrose limit can be conveniently written in terms of lightlike Fermi nor-\nmal coordinate, as recently demonstrated by Blau, Frank and Weiss [2]. In\nparticular, their analysis showed that Brinkmann coordinates for plane waves\nare lightlike Fermi normal coordinates; in this case all the higher-order terms,\nwhich are indicated in (46) by ellipses, vanish exactly. The curvature tensor\nis given along the geodesic (x1 = 0, . . . , xn−2 = 0, v = 0, u) by\nRAnBn(u) = hAB(u) (49)\nand Rµνστ (u) = 0 for all other index combinations, compare (46) with (47).\nWe want to write the generalized Jacobi equation near the lightlike geodesic\n(x1 = 0, . . . , xn−2 = 0, v = 0, u). We will use u = xn for the curve parame-\nter. After calculating the contravariant metric components from (47), we can\nwrite the Hamiltonian (23):\nH˜(x, p) = pu − 1\n2\nhAB(u)x\nA xB pv − δ\nAB pA pB\n2 pv\n. (50)\nNote that this Hamiltonian is of second order with respect to the coordi-\nnates xA and independent of the coordinate v. Hamilton’s equations with\nthe Hamiltonian (50) take the form\ndu\ndu\n= 1 ,\ndv\ndu\n= − 1\n2\nhAB x\nA xB +\nδAB pA pB\n2 p2v\n,\ndxA\ndu\n= − δ\nAB pB\npv\n,\n(51)\ndpu\ndu\n=\n1\n2\ndhAB\ndu\nxA xB pv ,\ndpv\ndu\n= 0 ,\ndpA\ndu\n= hAB x\nB pv . (52)\nApplying d\/du to (51), and using (52), gives us the lightlike geodesic equation\nin second-order form:\nd2xA\ndu2\n= − δAB hBC xC , (53)\nd2v\ndu2\n= − 1\n2\ndhAB\ndu\nxA xB − 2 hAB xA dx\nB\ndu\n. (54)\nIf we write\nxA(u) = 0 + ξA(u) , v(u) = 0 + ξv(u) , (55)\n15\nv − u\nv + u\nx1\nFig. 2 Past light cone of an event in a plane-wave spacetime (47). Three dimensions\n(x1, v, u) are shown, with u future-pointing lightlike (from lower right to upper left),\nv future-pointing lightlike (from lower left to upper right) , and x1 orthogonal to\nboth. The picture is valid for the case that x1 is an eigendirection of hAB(u) with\npositive eigenvalue. In this case in the three-dimensional picture all the light rays\nissuing from an event into the past are refocused into another event, with the\nexception of one single light ray that stays on an integral curve of the absolutely\nparallel lightlike vector field ∂v. A colour version of this picture can be found online\nin [17]. For a similar picture, hand-drawn by Roger Penrose, see [15].\nand linearize with respect to ξA and ξv, we get the generalized Jacobi equa-\ntion\nd2ξA\ndu2\n= − δAB hBC ξC , d\n2ξv\ndu2\n= − 2 hAB ξA dξ\nB\ndu\n. (56)\nFor the transverse coordinates xA = ξA, these equations are independent\nof the velocities; hence, the generalized Jacobi equation coincides with the\nordinary geodesic equation. Moreover, the (generalized) Jacobi equation even\ncoincides with the exact geodesic equation (53). If we solve these equations\nwith initial conditions\nxA(u0) = 0 , δAB\ndxA\ndu\n(u0)\ndxB\ndu\n(u0) = ε\n2 , (57)\nit gives us the cross-section of an initially circular light bundle around the\ngeodesic (x1 = 0, . . . , xn−2 = 0, v = 0, u) with vertex at u = u0. Such a\nbundle will have an elliptic cross-section, for arbitrarily large opening angle.\nThe rate of expansion is positive in eigen-directions of hAB(u) with negative\neigenvalues and negative in eigen-directions of hAB(u) with positive eigenval-\nues. Condition (48) makes sure that at least one eigenvalue is positive (unless\nall are zero in which case (47) is just the Minkowski metric). In directions\nwith positive eigenvalue the light bundle will be refocussed until a conjugate\npoint is reached. This focusing property is illustrated by Figure 2 which dis-\nplays the past-light cone of an event in a plane-wave spacetime, with three\ndimensions (x1, v, u) shown.\n16\nThe fact that, for the lightlike geodesic (x1 = 0, . . . , xn−2 = 0, v = 0, u)\nin a plane-wave spacetime, the generalized Jacobi equation coincides with\nthe ordinary Jacobi equation has the following interesting consequence: In\nthe Penrose limit the difference between the generalized Jacobi equation and\nthe Jacobi equation vanishes.\n5 Concluding remarks\nIn this article we have discussed a generalized Jacobi equation for lightlike\ngeodesics, following as closely as possible the approach that was brought\nforward by Hodgkinson, Mashhoon and others for timelike geodesics. As an\nalternative, one could also apply the approach of Baz˙an´ski [1], which was\nmentioned in the introduction, to lightlike geodesics. In that case one would\nconsider lightlike geodesics of the form x(s) = X(s) + ǫ ξ(s), where X(s)\nis a lightlike reference geodesic, and solve the geodesic equation for x(s)\niteratively up to some order N with respect to ǫ. For any finite order N , the\nresulting equation would not be valid for light bundles of arbitrarily large\nopening angle, in contrast to the generalized Jacobi equation treated here.\nOn the other hand, for ǫ sufficiently small it would be valid for arbitrarily\nlarge parameter intervals. An interesting application of this Baz˙an´ski-type\napproach to lightlike geodesics, which apparently has not been considered in\nthe literature so far, could be to study the caustics of light bundles up to\nsome order N with respect to ǫ.\nReferences\n1. Baz˙an´ski, S.: Kinematics of relative motion of test particles in general relativity.\nAnn. Inst. H. Poincare´ (A) 27, 115–144 (1977)\n2. Blau, M., Frank, D., Weiss, S.: Fermi coordinates and Penrose limit. Class.\nQuant. Grav. 23, 3993–4010 (2006)\n3. Chicone, C., Mashhoon, B.: The generalized Jacobi equation. Class. Quant.\nGrav. 19, 4231–4248 (2002)\n4. Chicone, C., Mashhoon, B.: Ultrarelativistic motion: inertial and tidal effects\nin Fermi coordinates. Class. Quant. Grav. 22, 195–205 (2005)\n5. Chicone, C., Mashhoon, B.: Explicit Fermi coordinates and tidal dynamics in\nde Sitter and Go¨del spacetimes. Phys. Rev. D 74, 064,019 (2006)\n6. Ciufolini, I.: Generalized geodesic deviation equation. Phys. Rev. D 34, 1014–\n1017 (1986)\n7. Colistete, R., Leygnac, C., Kerner, R.: Higher-order geodesic deviations applied\nto the Kerr metric. Class. Quant. Grav. 19, 4573–4589 (2002)\n8. Hawking, S.W., Ellis, G.F.R.: The large scale structure of space-time. Cam-\nbridge University Press, Cambridge (1973)\n9. Hodgkinson, D.E.: A modified equation of geodesic deviation. Gen. Relativ.\nGravit. 3, 351–375 (1972)\n10. Kerner, R., van Holten, J.W., Colistete R., J.: Relativistic epicycles: another\napproach to geodesic deviations. Class. Quant. Grav. 18, 4725–4742 (2001)\n11. Manasse, F.K., Misner, C.W.: Fermi normal coordinates and some basic con-\ncepts in differential geometry. J. Math. Phys. 4, 735–745 (1963)\n12. Mashhoon, B.: On tidal phenomena in a strong gravitational field. Astrophys.\nJ. 197, 705–716 (1975)\n13. Mashhoon, B.: Tidal radiation. Astrophys. J. 216, 591–609 (1977)\n17\n14. Misner, C., Thorne, K., Wheeler, J.A.: Gravitation. Freeman, San Francisco\n(1973)\n15. Penrose, R.: A remarkable property of plane waves in general relativity. Rev.\nModern Phys. 37, 215–220 (1965)\n16. Penrose, R.: Any space-time has a plane wave as limit. In: M. Cahen, M. Flato\n(eds.) Differential geometry and relativity, pp. 271–275. Reidel, Dordrecht\n(1976)\n17. Perlick, V.: Gravitational lensing from a spacetime perspective. Living Rev.\nRelativity 7(9) (2004). http:\/\/www.livingreviews.org\/lrr-2004-9\n18. Swaminarayan, N.S., Safko, J.L.: A coordinate-free derivation of a generalized\ngeodesic deviation equation. J. Math. Phys. 24, 883–885 (1983)\n19. Synge, J.L.: Relativity. The general theory. North-Holland, Amsterdam (1960)\n"}