{"doi":"10.1029\/2000JD000123","coreId":"71242","oai":"oai:eprints.lancs.ac.uk:4426","identifiers":["oai:eprints.lancs.ac.uk:4426","10.1029\/2000JD000123"],"title":"Intercontinental transport of ozone and its precursors in a three-dimensional global CTM","authors":["Wild, Oliver","Akimoto, Hajime"],"enrichments":{"references":[{"id":16356599,"title":"A global model of natural volatile organic compound emissions,","authors":[],"date":"1995","doi":"10.1029\/94jd02950","raw":"Guenther, A., C.N. Hewitt, D. Erikson, R. Fall, C. Geron, et al., A global model of natural volatile organic compound emissions, J. Geophys. Res., 100, 8873–9992, 1995.","cites":null},{"id":16356642,"title":"A parametric model of vertical eddy ﬂuxes in the atmosphere,","authors":[],"date":"1979","doi":"10.1007\/bf00117978","raw":"Louis, J.F., A parametric model of vertical eddy ﬂuxes in the atmosphere, Boundary Layer Meteorology, 17, 187–202, 1979.","cites":null},{"id":16356582,"title":"A photochemical theory for tropospheric ozone,","authors":[],"date":"1973","doi":"10.1029\/jc078i036p08751","raw":"Chameides, W.L., and J.C.G. Walker, A photochemical theory for tropospheric ozone, J. Geophys. Res., 78, 8751–8760, 1973.","cites":null},{"id":16356650,"title":"A review of the observations and origins of the spring ozone maximum,","authors":[],"date":"2000","doi":"10.1016\/s1352-2310(00)00129-1","raw":"Monks, P.S., A review of the observations and origins of the spring ozone maximum, Atmos. Environ., 34, 3545–3561, 2000.","cites":null},{"id":16356660,"title":"A textbook example of longrange transport: Simultaneous observation of ozone maxima of stratospheric and North American origin in the free troposphere over Europe,","authors":[],"date":"1999","doi":"10.1029\/1999jd900803","raw":"Stohl, A., and T. Trickl, A textbook example of longrange transport: Simultaneous observation of ozone maxima of stratospheric and North American origin in the free troposphere over Europe, J. Geophys. Res., 104, 30,445–30,462, 1999.","cites":null},{"id":16356569,"title":"Aerosol optical properties at Mauna Loa Observatory: Long-range transport from Kuwait?,","authors":[],"date":"1992","doi":"10.1029\/92gl00524","raw":"Bodhaine, B.A., J.M. Harris, J.A. Ogren, and D.J. Hofmann, Aerosol optical properties at Mauna Loa Observatory: Long-range transport from Kuwait?, Geophys.12 Res. Lett., 19, 581–584, 1992.","cites":null},{"id":16356639,"title":"An analysis of ozonesonde data for the troposphere: Recommendations for testing 3-D models, and development of a gridded climatology for tropospheric ozone,","authors":[],"date":"1999","doi":"10.1029\/1998jd100096","raw":"Logan, J.A., An analysis of ozonesonde data for the troposphere: Recommendations for testing 3-D models, and development of a gridded climatology for tropospheric ozone, J. Geophys. Res., 104, 16,115–16,149, 1999. Logan, J.A., I.A. Megretskaia, A.J. Miller, G.C. Tiao, D. Choi, L. Zhang, L. Bishop, R. Stolarski, G.J. Labow, S.M. Hollandsworth, G.E. Bodeker, H. Claude, D. DeMuer, J.B. Kerr, D.W. Tarasick, S.J. Oltmans, B. Johnson, F. Schmidlin, J. Staehelin, P. Viatte, and O. Uchino, Trends in the vertical distribution of ozone: a comparison of two analyses of ozonesonde data, J.","cites":null},{"id":16356546,"title":"Anthropogenic NOx emissions in Asia in the period 1990–2020,","authors":[],"date":"1999","doi":"10.1016\/s1352-2310(98)00110-1","raw":"van Aardenne, J.A., G.R. Carmichael, H. Levy, D. Streets, and L. Hordijk, Anthropogenic NOx emissions in Asia in the period 1990–2020, Atmos. Env., 33, 633–646, 1999.","cites":null},{"id":16356567,"title":"Chemical air mass differences near fronts,","authors":[],"date":"1998","doi":"10.1029\/98jd00535","raw":"Bethan, S, G. Vaughan, C. Gerbig, A. Volz-Thomas, H. Richer, and D.A. Tiddeman, Chemical air mass differences near fronts, J. Geophys. Res., 103, 13,413– 13,434, 1998.","cites":null},{"id":16356611,"title":"Deposition of ozone to tundra,","authors":[],"date":"1992","doi":"10.1029\/91jd02696","raw":"Jacob, D.J., S.M. Fan, S.C. Wofsy, P.A. Spiro, P.S. Bakwin, J.A. Witter, E.V. Browell, G.L. Gregory, D.R. Fitzjarrald, and K.E. Moore, Deposition of ozone to tundra, J. Geophys. Res., 97, 16,473–16,479, 1992.","cites":null},{"id":16356548,"title":"Distribution of SO2, NOx and CO2 emissions from fuel combustion and industrial activities","authors":[],"date":"1994","doi":"10.1016\/1352-2310(94)90096-5","raw":"Akimoto, H., and H. Narita, Distribution of SO2, NOx and CO2 emissions from fuel combustion and industrial activities in Asia with 1 ◦×1 ◦ resolution, Atmos. Env., 28, 213–225, 1994.","cites":null},{"id":16356618,"title":"Eﬀect of rising Asian emissions on surface ozone in the United States,","authors":[],"date":"1999","doi":"10.1029\/1999gl900450","raw":"Jacob, D.J., J.A. Logan, and P.P. Murti, Eﬀect of rising Asian emissions on surface ozone in the United States, Geophys. Res. Lett., 26, 2175–2178, 1999.","cites":null},{"id":16356627,"title":"Eﬀects of subgrid segregation on ozone production eﬃciency in a chemical model,","authors":[],"date":"2000","doi":"10.1016\/s1352-2310(99)00520-8","raw":"Liang., J.Y., and M.Z. Jacobson, Eﬀects of subgrid segregation on ozone production eﬃciency in a chemical model, Atmos. Env., 34, 2975–2982, 2000.","cites":null},{"id":16356664,"title":"Empirical model of global soil-biogenic NOx emissions,","authors":[],"date":"1995","doi":"10.1029\/95jd00370","raw":"Yienger, J.J., and H. Levy II, Empirical model of global soil-biogenic NOx emissions, J. Geophys. Res., 100, 11,447–11,464, 1995.","cites":null},{"id":16356662,"title":"Evaluation of the Montsouris series of ozone measurements made in the nineteenth century,","authors":[],"date":"1988","doi":"10.1038\/332240a0","raw":"Volz, A., and D. Kley, Evaluation of the Montsouris series of ozone measurements made in the nineteenth century, Nature, 322, 240–242, 1988. Wild, O., and M.J. Prather, Excitation of the primary tropospheric chemical mode in a global 3-D model, J.","cites":null},{"id":16356607,"title":"Export of reactive nitrogen from North America during summertime: Sensitivity to hydrocarbon chemistry,","authors":[],"date":"1998","doi":"10.1029\/97jd03142","raw":"Horowitz, L.W., J.Y. Liang, G.M. Gardner, and D.J. Jacob, Export of reactive nitrogen from North America during summertime: Sensitivity to hydrocarbon chemistry, J. Geophys. Res., 103, 13,451–13,476, 1998.","cites":null},{"id":16356614,"title":"Factors regulating ozone over the United States and its export to the global atmosphere,","authors":[],"date":"1993","doi":"10.1029\/98jd01224","raw":"Jacob, D.J., J.A. Logan, G.M. Gardner, R.M. Yevich, C.M. Spivakovsky, and S.C. Wofsy, Factors regulating ozone over the United States and its export to the global atmosphere, J. Geophys. Res., 98, 14,817– 14,826, 1993.","cites":null},{"id":16356663,"title":"Fast-J: Accurate simulation of in- and below-cloud photolysis in tropospheric chemical models,","authors":[],"date":"2000","doi":null,"raw":"Wild, O., X. Zhu and M.J. Prather, Fast-J: Accurate simulation of in- and below-cloud photolysis in tropospheric chemical models, J. Atmos. Chem., 37, 245– 282, 2000.","cites":null},{"id":16356666,"title":"Frontier Research System for Global Change,","authors":[],"date":"0001","doi":null,"raw":"H. Akimoto and O. Wild, Frontier Research System for Global Change, 3173-25 Showa-machi, Kanazawaku, Yokohama, Kanagawa 236-0001, Japan. (email: oliver@frontier.esto.or.jp) Received October 31, 2000 This preprint was prepared with AGU’s L ATEX macros v5.01. File pp2 formatted March 12, 2008.14","cites":null},{"id":16356587,"title":"Growth of continental-scale metro-agro-plexes, regional ozone pollution, and world food production,","authors":[],"date":"1994","doi":"10.1126\/science.264.5155.74","raw":"Chameides, W.L., P.S. Kasibhatla, J. Yienger, and H. Levy II, Growth of continental-scale metro-agro-plexes, regional ozone pollution, and world food production, Science, 264, 74–77, 1994.","cites":null},{"id":16356558,"title":"Impacts of increased anthropogenic emissions in Asia on tropospheric ozone and climate,","authors":[],"date":"1996","doi":"10.3402\/tellusb.v48i1.15662","raw":"Berntsen, T, I.S.A. Isaksen, W.C. Wang, and X.Z. Liang, Impacts of increased anthropogenic emissions in Asia on tropospheric ozone and climate, Tellus, 48B, 13–32, 1996.","cites":null},{"id":16356634,"title":"Increasing background ozone in surface air over the United States,","authors":[],"date":"2000","doi":"10.1029\/2000gl011762","raw":"Lin, C.-Y., D.J. Jacob, J.W. Munger, and A.M. Fiore, Increasing background ozone in surface air over the United States, Geophys. Res. Lett., 27, 3465-3468, 2000.","cites":null},{"id":16356563,"title":"Inﬂuence of Asian emissions on the composition of air reaching the North Western United States,","authors":[],"date":"1999","doi":"10.1029\/1999gl900477","raw":"Berntsen, T.K., S. Karlsdottir, and D.A. Jaﬀe, Inﬂuence of Asian emissions on the composition of air reaching the North Western United States, Geophys. Res. Lett., 26, 2171–2174, 1999.","cites":null},{"id":16356593,"title":"Long-range atmospheric transport of soil dust from Asia to the tropical North Paciﬁc,","authors":[],"date":"1980","doi":"10.1126\/science.209.4464.1522","raw":"Duce, R.A., C.K. Unni, B.J. Ray, J.M. Prospero, and J.T. Merrill, Long-range atmospheric transport of soil dust from Asia to the tropical North Paciﬁc, Science, 209, 1522–1524, 1980.","cites":null},{"id":16356655,"title":"Model-calculations of tropospheric ozone production potential following observed convective events,","authors":[],"date":"1990","doi":"10.1029\/jd095id09p14049","raw":"Pickering, K.E., A.M. Thompson, R.R. Dickerson, W.T. Luke, D.P. McNamara, J.P. Greenberg, and P.R. Zimmerman, Model-calculations of tropospheric ozone production potential following observed convective events, J. Geophys. Res., 95, 14,049–14,062, 1990.","cites":null},{"id":16356575,"title":"MOZART, a global chemical transport model for ozone and related chemical tracers .1. Model description,","authors":[],"date":"1998","doi":"10.1029\/98jd02397","raw":"Brasseur, G.P., D.A. Hauglustaine, S. Walters, P.J. Rasch, J.-F. M¨ uller, C. Granier, and X.X. Tie, MOZART, a global chemical transport model for ozone and related chemical tracers .1. Model description, J. Geophys. Res., 103, 28,265–28,289, 1998.","cites":null},{"id":16356657,"title":"Numerical advection by conservation of second-order moments,","authors":[],"date":"1986","doi":"10.1029\/jd091id06p06671","raw":"Prather, M. J., Numerical advection by conservation of second-order moments, J. Geophys. Res., 91, 6671– 6681, 1986. Price, C., and D. Rind, A simple lightning parameterization for calculating global lightning distributions, J.","cites":null},{"id":16356653,"title":"Numerical investigation of the inﬂuence of mineral dust on the tropospheric13 chemistry of East Asia,","authors":[],"date":"2000","doi":null,"raw":"Phadnis, M.J., and G.R. Carmichael, Numerical investigation of the inﬂuence of mineral dust on the tropospheric13 chemistry of East Asia, J. Atmos. Chem., 36, 285–323, 2000.","cites":null},{"id":16356637,"title":"On the non-linearity of tropospheric ozone production,","authors":[],"date":"1988","doi":"10.1029\/jd093id12p15879","raw":"Lin, X., M. Trainer, and S.C. Liu, On the non-linearity of tropospheric ozone production, J. Geophys. Res., 93, 15,879–15,888, 1988.","cites":null},{"id":16356661,"title":"Present and future emissions of air pollutants in China: SO2, NOx,","authors":[],"date":"2000","doi":"10.1016\/s1352-2310(99)00167-3","raw":"Streets, D.G., and S.T. Waldhoﬀ, Present and future emissions of air pollutants in China: SO2, NOx, and CO, Atmos. Env., 34, 363–374, 2000.","cites":null},{"id":16356631,"title":"Seasonal budgets of reactive nitrogen species and ozone over the United States, and export ﬂuxes to the global atmosphere,","authors":[],"date":"1998","doi":"10.1029\/97jd03126","raw":"Liang., J.Y., L.W. Horowitz, D.J. Jacob, Y. Wang, A.M. Fiore, J.A. Logan, G.M. Gardner, and J.W. Munger, Seasonal budgets of reactive nitrogen species and ozone over the United States, and export ﬂuxes to the global atmosphere, J. Geophys. Res., 103, 13,435–13,450, 1998.","cites":null},{"id":16356645,"title":"Seasonal characteristics of tropospheric ozone production and mixing ratios over East Asia: A global threedimensional chemical transport model analysis,","authors":[],"date":"2000","doi":"10.1029\/2000jd900087","raw":"Mauzerall, D.L., D. Narita, H. Akimoto, L. Horowitz, S. Waters, D.A. Hauglustaine, and G. Brasseur, Seasonal characteristics of tropospheric ozone production and mixing ratios over East Asia: A global threedimensional chemical transport model analysis, J. Geophys. Res., 105, 17,895–17,910, 2000.","cites":null},{"id":16356648,"title":"Stratospheric ozone in 3-D models: A simple chemistry and the cross-tropopause ﬂux,","authors":[],"date":"2000","doi":"10.1029\/2000jd900124","raw":"McLinden, C.A., S. Olsen, B. Hannegan, O. Wild, M.J. Prather, and J. Sundet, Stratospheric ozone in 3-D models: A simple chemistry and the cross-tropopause ﬂux, J. Geophys. Res., 105, 14,653–14,665, 2000.","cites":null},{"id":16356578,"title":"The ASAD atmospheric chemistry integration package and chemical reaction database,","authors":[],"date":"1997","doi":"10.1016\/s0010-4655(97)00056-8","raw":"Carver, G.D., P.D. Brown and O. Wild, The ASAD atmospheric chemistry integration package and chemical reaction database, Computer Physics Communications, 105, 197–215, 1997.","cites":null},{"id":16356665,"title":"The episodic nature of air pollution transport from Asia to North America,","authors":[],"date":"2000","doi":"10.1029\/2000jd900309","raw":"Yienger, J.J., M.K. Galanter, T.A. Holloway, M.J. Phadnis, S.K. Guttikunda, G.R. Carmichael, W.J. Moxim, and H. Levy II, The episodic nature of air pollution transport from Asia to North America, J. Geophys. Res., 105, 26,931–26,945, 2000.","cites":null},{"id":16356589,"title":"The European regional ozone distribution and its links with the global scale for the years 1992 and","authors":[],"date":"2015","doi":"10.1016\/s1352-2310(99)00226-5","raw":"Collins, W.J., D.S. Stevenson, C.E. Johnson, and R.G. Derwent, The European regional ozone distribution and its links with the global scale for the years 1992 and 2015, Atmos. Env., 34, 255–267, 2000.","cites":null},{"id":16356624,"title":"The long range transport of pollutants in the Paciﬁc Rim region,","authors":[],"date":"1990","doi":"10.1016\/0960-1686(90)90061-q","raw":"Kotamarthi, V.R., and G.R. Carmichael, The long range transport of pollutants in the Paciﬁc Rim region, Atmos. Env., 24, 1521–1534, 1990.","cites":null},{"id":16356602,"title":"The Paciﬁc Exploratory Mission-West Phase B: February-March","authors":[],"date":"1994","doi":"10.1029\/97jd02581","raw":"Hoell, J.M., D.D. Davis, S.C. Liu, R.E. Newell, H. Akimoto, R.J. McNeal, and R.J. Bendura, The Paciﬁc Exploratory Mission-West Phase B: February-March 1994, J. Geophys. Res., 102, 28,223–28,240, 1997.","cites":null},{"id":16356552,"title":"The Southern Tropical Atlantic Region Experiment (STARE): Transport and Atmospheric Chemistry near the Equator — Atlantic (TRACE-A) and Southern African FireAtmosphere Research Initiative (SAFARI): An Introduction,","authors":[],"date":"1996","doi":"10.1029\/96jd01786","raw":"Andreae, M.O., J. Fishman, and J. Lindesay, The Southern Tropical Atlantic Region Experiment (STARE): Transport and Atmospheric Chemistry near the Equator — Atlantic (TRACE-A) and Southern African FireAtmosphere Research Initiative (SAFARI): An Introduction, J. Geophys. Res., 101, 23,519–23,520, 1996.","cites":null},{"id":16356556,"title":"Three-dimensional global modeling studies of the transport and photochemistry over the North Atlantic Ocean,","authors":[],"date":"1996","doi":"10.1029\/96jd01062","raw":"Atherton, C.S., S. Sillman, and J. Walton, Three-dimensional global modeling studies of the transport and photochemistry over the North Atlantic Ocean, J. Geophys. Res., 101, 29,289–29,304, 1996.","cites":null},{"id":16356596,"title":"Transport and processing of O3 and O3 precursors over the North Atlantic: An overview of the 1993 North Atlantic Regional Experiment (NARE) summer intensive,","authors":[],"date":"1996","doi":"10.1029\/96jd01113","raw":"Fehsenfeld, F.C., P. Daum, W.R. Leaitch, M. Trainer, D.D. Parrish, and G. H¨ ubler, Transport and processing of O3 and O3 precursors over the North Atlantic: An overview of the 1993 North Atlantic Regional Experiment (NARE) summer intensive, J. Geophys. Res., 101, 28,877–28,891, 1996.","cites":null},{"id":16356621,"title":"Transport of Asian air pollution to","authors":[],"date":"1999","doi":"10.1029\/1999gl900100","raw":"Jaﬀe, D., et al., Transport of Asian air pollution to North America, Geophys. Res. Lett., 26, 711–714, 1999.","cites":null},{"id":16356658,"title":"Use of online tracers as a diagnostic tool in general circulation model development, 2, Transport between the troposphere and stratosphere,","authors":[],"date":"1999","doi":"10.1029\/1999jd900006","raw":"Rind, D., J. Lerner, K. Shah, and R. Suozzo, Use of online tracers as a diagnostic tool in general circulation model development, 2, Transport between the troposphere and stratosphere, J. Geophys. Res., 104, 9151– 9167, 1999.","cites":null},{"id":16356651,"title":"Vertical ﬁne-scale atmospheric structure measured from NASA DC-8 during PEM-West","authors":[],"date":"1996","doi":"10.1029\/95jd02613","raw":"Newell, R.E., et al., Vertical ﬁne-scale atmospheric structure measured from NASA DC-8 during PEM-West A, J. Geophys. Res., 101, 1943–1960, 1996.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-11-16","abstract":"The coupling of chemistry with atmospheric transport processes provides a mechanism for local and regional pollution from heavily populated continental regions to influence tropospheric composition at hemispheric and global scales. In this study we use the FRSGC\/UCI 3-D chemical transport model to quantify the impact of ozone precursors from anthropogenic sources in the United States, Europe and East Asia on regional and global ozone budgets and to identify the key controlling processes. We find that the East Asian region has the greatest potential to affect tropospheric ozone due principally to efficient vertical transport, but that Europe experiences the greatest intercontinental effects due to rapid, short-distance transport from North America. In addition to significant boundary layer ozone production in each region, we find that 25-40% of the total net regional production occurs above 730 hPa in the free troposphere, and that on a hemispheric scale 70-85% of ozone from anthropogenic sources in the upper troposphere, above 400 hPa, is due to in-situ chemistry rather than direct vertical transport. Increased surface ozone concentrations over remote continents are largest in spring and autumn at northern mid-latitudes; while this seasonality is driven by horizontal transport in the free troposphere followed by subsidence, boundary layer and upper tropospheric chemical production make a substantial contribution. Although the effects are greatest in periodic episodes when meteorological conditions are favourable, there is significant enhancement in background ozone concentrations. We suggest that increasing emissions will significantly impact the oxidizing capacity of the troposphere by leading to greater polarization between ozone production and destruction environments","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71242.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/4426\/1\/pp2.pdf","pdfHashValue":"eb0a8f989361a8de92fb0562fc0cae4f87a0e248","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:4426<\/identifier><datestamp>\n      2018-01-24T03:12:41Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4745<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Intercontinental transport of ozone and its precursors in a three-dimensional global CTM<\/dc:title><dc:creator>\n        Wild, Oliver<\/dc:creator><dc:creator>\n        Akimoto, Hajime<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        The coupling of chemistry with atmospheric transport processes provides a mechanism for local and regional pollution from heavily populated continental regions to influence tropospheric composition at hemispheric and global scales. In this study we use the FRSGC\/UCI 3-D chemical transport model to quantify the impact of ozone precursors from anthropogenic sources in the United States, Europe and East Asia on regional and global ozone budgets and to identify the key controlling processes. We find that the East Asian region has the greatest potential to affect tropospheric ozone due principally to efficient vertical transport, but that Europe experiences the greatest intercontinental effects due to rapid, short-distance transport from North America. In addition to significant boundary layer ozone production in each region, we find that 25-40% of the total net regional production occurs above 730 hPa in the free troposphere, and that on a hemispheric scale 70-85% of ozone from anthropogenic sources in the upper troposphere, above 400 hPa, is due to in-situ chemistry rather than direct vertical transport. Increased surface ozone concentrations over remote continents are largest in spring and autumn at northern mid-latitudes; while this seasonality is driven by horizontal transport in the free troposphere followed by subsidence, boundary layer and upper tropospheric chemical production make a substantial contribution. Although the effects are greatest in periodic episodes when meteorological conditions are favourable, there is significant enhancement in background ozone concentrations. We suggest that increasing emissions will significantly impact the oxidizing capacity of the troposphere by leading to greater polarization between ozone production and destruction environments.<\/dc:description><dc:date>\n        2001-11-16<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/4426\/1\/pp2.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2000JD000123<\/dc:relation><dc:identifier>\n        Wild, Oliver and Akimoto, Hajime (2001) Intercontinental transport of ozone and its precursors in a three-dimensional global CTM. Journal of Geophysical Research: Atmospheres, 106 (D21). pp. 27729-27744. ISSN 0747-7309<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/4426\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/2000JD000123","http:\/\/eprints.lancs.ac.uk\/4426\/"],"year":2001,"topics":["GE Environmental Sciences"],"subject":["Journal Article","PeerReviewed"],"fullText":"1Intercontinental transport of ozone and its precursors in a 3-D global\nCTM\nOliver Wild, and Hajime Akimoto\nFrontier Research System for Global Change, Yokohama, Japan\nAbstract\nThe coupling of chemistry with atmospheric transport processes provides a mechanism for local\nand regional pollution from heavily populated continental regions to influence tropospheric\ncomposition at hemispheric and global scales. In this study we use the FRSGC\/UCI 3-D\nchemical transport model to quantify the impact of ozone precursors from anthropogenic sources\nin the United States, Europe and East Asia on regional and global ozone budgets and to identify\nthe key controlling processes. We find that the East Asian region has the greatest potential to\naffect tropospheric ozone due principally to efficient vertical transport, but that Europe\nexperiences the greatest intercontinental effects due to rapid, short-distance transport from\nNorth America. In addition to significant boundary layer ozone production in each region, we\nfind that 25–40% of the total net regional production occurs above 730 hPa in the free\ntroposphere, and that on a hemispheric scale 70–85% of ozone from anthropogenic sources in the\nupper troposphere, above 400 hPa, is due to in-situ chemistry rather than direct vertical\ntransport. Increased surface ozone concentrations over remote continents are largest in spring\nand autumn at northern mid-latitudes; while this seasonality is driven by horizontal transport in\nthe free troposphere followed by subsidence, boundary layer and upper tropospheric chemical\nproduction make a substantial contribution. Although the effects are greatest in periodic\nepisodes when meteorological conditions are favourable, there is significant enhancement in\nbackground ozone concentrations. We suggest that increasing emissions will significantly impact\nthe oxidizing capacity of the troposphere by leading to greater polarization between ozone\nproduction and destruction environments.\n21. Introduction\nThe oxidizing capacity of the troposphere depends\nstrongly on ozone as a source of the principal oxidiz-\ning agent, the hydroxyl radical, OH. While flux from\nthe stratosphere is a significant source of ozone in\nthe troposphere, it is clear that chemical formation\nfrom precursors of anthropogenic origin also plays an\nimportant role [Chameides and Walker, 1973]. Com-\nparison of recent ozone measurements with those from\nthe end of last century [Volz and Kley, 1988] show sig-\nnificant increases which may be largely attributable\nto increases in anthropogenic emissions of precursors.\nHowever, production of ozone from these sources and\ntransport to the global atmosphere has generally been\nconsidered in a regional context [e.g., Jacob et al.,\n1993; Kotamarthi and Carmichael, 1990]. The im-\nportance of regional ozone pollution in North Amer-\nica, Europe and Eastern Asia has been highlighted\nby Chameides et al. [1994], who termed these regions\nwith both intense urban-industrial and agricultural\nactivities ‘metro-agro-plexes’, and who drew attention\nto the impacts on crop growth as well as on urban air\nquality. However, these three regions lie in a simi-\nlar latitude band in the Northern Hemisphere, and\ntheir pollution problems may therefore be readily cou-\npled by atmospheric transport processes. While the\nlifetime of the major oxidant precursors, NOx (NO\n+ NO2) and reactive hydrocarbons may only be 1–\n2 days in the lower troposphere, the ozone they form\nhas a lifetime of days to months. Typical transport\ntimes between continents are 5–10 days, and there\nis therefore significant potential for one continental\nregion to affect another, suggesting that regional pol-\nlution should be considered in a global context.\nIntercontinental transport is observed most clearly\nin the transport of aerosol over the ocean, for ex-\nample desert dust [e.g., Duce et al., 1980] and soot\nfrom large fires [Bodhaine et al., 1992]. While similar\nprocesses affect gas-phase pollutants, these episodes\nare more difficult to detect, and are not as easily at-\ntributable to long-range transport due to significant\nand often highly variable ‘background’ concentrations\nand to the wide variety of potential sources. However,\nmeasurements from the STARE campaign [Andreae\net al., 1996] identified the role of biomass burning\nover Africa on episodes of high ozone concentrations\nover the tropical Atlantic. Similarly, aircraft and sur-\nface measurement campaigns over the mid-latitude\nNorth Atlantic [Fehsenfeld et al., 1996] and Pacific\nOceans [Hoell et al., 1997] have followed the evolution\nand export of continental pollution plumes, while ob-\nservations over Europe [Stohl and Trickl, 1999] and\nthe west coast of the U.S. [Jaffe et al., 1999] have\ndetected unusually high concentrations of oxidants\nand their precursors in air masses that can be traced\nback to very distant source regions using trajectory\ntechniques. Recent studies using 3-D global chemi-\ncal transport models (CTM) have demonstrated the\npotential of intercontinental transport to affect oxi-\ndant concentrations over the Atlantic [Atherton et al.,\n1996] and Pacific Oceans [Berntsen et al., 1999], and\nhave started to address the implications of increas-\ning global emissions on regional ozone concentrations\n[Jacob et al., 1999; Collins et al., 2000].\nThis paper addresses the impacts of long-range\ntransport on the regional ozone budget over the main\nNorthern Hemisphere population regions and on the\noxidising capacity of the troposphere on a global scale.\nWe focus on the extent to which precursor emis-\nsions from each region affect ozone concentrations\nover each other region, and on how these influences\nvary through the year. We quantify the relative im-\nportance of chemistry and transport in controlling\nthe export of oxidants and precursors, and how the\nbalance between these processes changes during the\nyear. While chemical processes control oxidant for-\nmation in the polluted continental boundary layer,\nozone production in the free troposphere following\nvertical transport of precursors by rapid mechanisms\nsuch as convection [Pickering et al., 1990] or slower,\nfrontal lifting [Bethan et al., 1998] supplements the\ndirect transport of oxidants from the boundary layer.\nThe balance between these processes is driven by lo-\ncal and regional meteorology, and differs substantially\nfrom season to season and from one region to another.\nTo quantify these effects, and to extend previous re-\ngional studies of oxidant budgets [Jacob et al., 1993;\nLiang et al., 1998], we apply a global model to allow\ndirect comparison of the main emission regions and\nto investigate the coupling between them.\nIn section two, we describe the FRSGC\/UCI GISS\nII′ CTM used in the current studies, and demon-\nstrate its strengths and weaknesses in simulating the\nbudgets of oxidants in the present-day atmosphere.\nIn section three, we present oxidant budgets for the\nthree major northern hemisphere population regions,\nand compare with previous measurement and mod-\nelling estimates. We then describe perturbation stud-\nies varying precursor emissions for selected regions in\nsection four, determining the impacts on oxidant bud-\ngets at regional and global scales, and highlighting the\neffects of each region on ozone concentrations over the\n3other regions. We conclude by highlighting the mech-\nanisms controlling these impacts, demonstrating the\ndifferent balance between them over the different re-\ngions, and by considering the implications of recent\nincreases in emissions over East Asia.\n2. Model Overview\nThe tropospheric modelling studies described in\nthis paper make use of the FRSGC\/UCI CTM, the\nlatest in a generation of models developed at the Uni-\nversity of California, Irvine, based on meteorological\nfields from the Goddard Institute of Space Sciences\n(GISS) GCM. The model is described in detail in\nWild and Prather [2000], and only a brief summary\nwill be provided here. It uses 3-hour averaged fields\nwith a horizontal resolution of 4◦ latitude × 5◦ longi-\ntude, and a vertical resolution of nine levels from the\nsurface to 10 hPa, with six to eight levels in the tro-\nposphere. Advection is calculated using the Prather\nscheme conserving second-order moments [Prather,\n1986]. Entraining and non-entraining convective mass\nfluxes are supplied as 3-hour averages from the mete-\norological fields. The height of the boundary layer is\ndiagnosed from the fields, and mixing is calculated ev-\nery CTM time step using the scheme of Louis [1979].\nThe model includes a detailed tropospheric chemi-\ncal scheme using the ASAD modular chemistry pack-\nage [Carver et al., 1997], with a fast implicit solver\nfor the chemical equations. The chemical module in-\ncludes an explicit treatment of inorganic HOx\/Ox\/NOx\nchemistry and methane oxidation, and a lumped ‘fam-\nily’ treatment of hydrocarbon oxidation for the rep-\nresentative species butane, propene, xylene and iso-\nprene. Photolysis rates are calculated using the Fast-\nJ photolysis scheme [Wild et al., 2000], which has an\non-line treatment of molecular and aerosol absorption\nand scattering, allowing the full variability of photol-\nysis rates to be captured on short time scales as the\ncloud fields vary.\nEmissions of trace species are taken from the EDGAR\nv.2.0 database for 1990 [Olivier et al., 1996], sup-\nplemented with soil emissions of NO [Yienger and\nLevy, 1995] and emissions of isoprene from vegeta-\ntion [Guenther et al., 1995] reduced to 220 Tg(C)\/yr\nconsistent with Brasseur et al. [1998]. A source of\nNO from lightning, 5 Tg(N)\/yr, is included based on\nthe parameterization of Price and Rind [1992]. The\nchoice of emission datasets has been assessed by sen-\nsitivity studies using the GEIA emissions datasets\nfor 1985 (see Wild and Prather [2000] and references\ntherein); although there are some differences in re-\ngional budgets, the variations are not substantially\ndifferent, and do not affect the conclusions of this\nstudy. Dry deposition is treated using a ‘resistances-\nin-series’ scheme based on that of Jacob et al. [1992],\nusing surface meteorological properties, vegetation\ntype and species solubility. Wet deposition is param-\neterised by loss of soluble species in wet convective\nupdrafts, and by removal by below-cloud scavenging\nwhen precipitation is diagnosed from the meteorolog-\nical fields. A dynamical tropopause is diagnosed on-\nline using the 120 ppbv isopleth of an inert, O3-like\ntracer ‘Synoz’ [McLinden et al., 2000] which is emit-\nted at 475 Tg\/yr in the stratosphere, removed at the\nsurface, and has previously been run to steady-state.\nThis tracer is allowed to define the flux of O3 and NOy\nfrom the stratosphere; for other species the effects\nof stratospheric chemistry are simulated by providing\nfirst-order removal rates. A marker of stratospheric\nozone, initialised like Synoz and removed by chemical\nloss in the troposphere, has been added to allow the\nstratospheric influence on ozone to be diagnosed.\nFor the present studies we have reduced the model\nresolution to 8◦×10◦ by combining variables at 4◦×5◦\nto ease the computation burden without significant\nloss of accuracy. Use of the second-order moment\nscheme, which allows a degree of localization of tracer\nmass within grid boxes, minimises the impacts of this\ndegradation, and tracer distributions show only small\ndifferences except in boundary regions. The ability of\nthe model to simulate the tropospheric distribution of\ntrace gases has been evaluated by comparing with ob-\nservations from measurement campaigns, ozonesonde\nprofiles and individual measurement stations. Com-\nparisons for O3, CO, NOy and PAN are presented in\nWild and Prather [2000]; further evaluation has been\nmade using by comparing with aircraft measurements\nfrom recent NASA GTE campaigns.\nFigure 1 shows the monthly variations in ozone Figure 1\nat three altitudes compared with ozonesonde profiles\nfrom Logan [1999]. In general, the magnitudes and\nseasonal variations are reproduced relatively well, but\nthe figure illustrates a number of limitations in the\nmodel simulation. The location of the exchange of air\nbetween the stratosphere and the troposphere is not\nwell represented in the GISS II′ meteorological fields\n[Rind et al., 1999], and as a consequence ozone con-\ncentrations are overestimated in high latitude regions\nin Spring in the chemical simulations, and this can\nbe seen at 250 hPa as far south as Boulder. However,\nthese effects are controlled by use of the ‘Synoz’ tracer\n4to define the total stratospheric input of O3 and NOy,\nand are minimized in the present studies by the fo-\ncus on anthropogenicly-driven perturbations. Ozone\nconcentrations in the most polluted parts of the conti-\nnental boundary layer may be slightly overestimated,\nas seen at Hohenpeissenberg, due to the lack of a sub-\ngrid scale treatment of the high spatial variability in\nemissions in these polluted regions, which may lead\nto overestimation of regional ozone production due\nto non-linearities in ozone formation [Jacob et al.,\n1993; Liang and Jacobson, 2000]. The summertime\ndip in mid-tropospheric O3 in the model over Sap-\nporo, clearly seen in the ozonesondes at Tateno and\nKagoshima in southern and central Japan, is due to\ngreater influence from air over the Tropical Pacific\nduring this season. However, this is not observed as\nfar north as Sapporo, and illustrates the limitations\nof the coarse model resolution used. However, the\ndistributions of many short-lived species have been\ncompared with measurements over Hokkaido [H. Tan-\nimoto, personal communication], and are relatively\nwell reproduced, both in absolute magnitude and in\nthe horizontal, vertical and temporal variation.\nThe global ozone budget is similar to that de-\nrived in other studies; after three years of spin-up, al-\nlowing cross-tropopause and inter-hemispheric trans-\nport to fully redistribute the initial tracer concen-\ntrations, stratospheric injection accounts for 475 Tg\nof tropospheric ozone annually, chemical production\nfor 230 Tg (production 3680 Tg, loss 3450 Tg), and\n704 Tg is deposited at the surface. Figure 2 shows theFigure 2\nseasonal variation in the three major budget terms by\nhemisphere, and demonstrates the dominance of the\nnorthern hemisphere in controlling the total ozone\nbudget. Input from the stratosphere peaks in win-\nter in the Northern Hemisphere and in spring in the\nSouthern Hemisphere, whereas chemical production\nand deposition peak in Northern Hemisphere sum-\nmer, reflecting the importance of the Northern Hemi-\nspheric sources of precursors. Most of the chemical\nproduction occurs in the lowest 2 km above the sur-\nface, where emissions of precursors occur, or in the\nupper troposphere, where they are lifted to by con-\nvection or introduced by lightning or aircraft. In\nthe lower mid-troposphere, chemical destruction dom-\ninates, reflecting losses to photolysis and formation of\nOH radicals. Deposition fluxes follow the ozone con-\ncentrations, being greatest in boreal summer when\nchemical production dominates and in austral spring\nwhen stratospheric injection and production from\nbiomass burning emissions are greatest. The hemi-\nspheric mean values in this figure do not empha-\nsize the large longitudinal gradients in O3 production\nand loss near the surface; the marine boundary layer\nshows consistent, large net loss, whereas the conti-\nnental boundary layer with industrial NOx emissions\nshows an overwhelming net production.\n3. Continental Budgets\nThe chemical budgets of ozone and NOx have been\nderived for the major northern hemisphere popula-\ntion regions from a standard control run of the CTM,\nand form the basis with which subsequent runs are\ncompared. The regions selected, shown in Figure 3, Figure 3\ncover the major emission regions of the United States,\nEurope and East Asia, and are similar in area. Be-\ntween them, the regions account for more than 65%\nof the annual surface fossil fuel sources of NOx from\nthe EDGAR inventory. Mean annual budgets are cal-\nculated for the boundary layer, defined as the lowest\nthree model levels, up to σ = 0.73 (typically about\n2.2 km), and for the troposphere up to σ = 0.15\n(about 13 km), and are shown in Table 1. The net Table 1\nO3 production includes chemical formation from pre-\ncursors from all sources; the net export is the dif-\nference between transport of chemically-produced O3\nout of the region and transport of free-tropospheric\nO3 in. Each region is a net exporter of O3; in addi-\ntion, about 20% of emitted nitrogen is exported from\nthe boundary layer as NOx or the reservoir species\nperoxyacetylnitrate, PAN, most of which is lifted into\nthe free troposphere and leads to further in-situ O3\nproduction. Total net production over each region\nbetween the surface and 150 hPa (about 13 km) is in-\ndicated at the bottom of the table; while the free tro-\nposphere is a smaller source than the boundary layer,\nthe additional 20–25 Tg\/yr production, 25–40% of\nthe total regional O3 production, makes a substantial\ncontribution to the total exports from each region.\nThe annual export of ozone from the U.S. bound-\nary layer (11 Tg\/yr) is similar to that of Liang et\nal. [1998] (6 Tg\/yr), although the variation in chem-\nical ozone tendency through the depth of the lower\ntroposphere and the confinement of deposition to the\nsurface make this value rather sensitive to the defi-\nnition of the boundary layer. Net ozone import oc-\ncurs in the winter and spring, when chemical forma-\ntion is reduced and stratospheric input larger, while\nnet export occurs in the summer and autumn, when\nchemical formation is more rapid and the influence\nof the stratosphere reduced. Net boundary layer pro-\n5duction, at 61 Tg\/yr, is very similar to the 63 Tg\/yr\nderived by Liang et al. [1998]. The ozone production\nefficiency, defined here as the net number of molecules\nof O3 produced per molecule of NOx oxidised [Lin et\nal., 1988], peaks at 4.8 in the summer, somewhat less\nthan the 6.3 derived by Jacob et al. [1993]; in the\nwinter it drops to 1.1. The net summer-time export\nof O3 from the U.S. region, 52 Tg\/yr, is somewhat\nless than the 75 Tg\/yr found by Jacob et al. [1993],\nbut does not account for the influx and removal of O3\nfrom tropospheric sources outside the region. The ex-\nport of NOx and PAN is 1.4 Tg(N), the same as that\nderived by Liang et al. [1998], and constitutes 18% of\nthe annual emissions; peaking at 27% in winter, this\nfraction drops to 13% in summertime, similar to the\n12.5% derived by Horowitz et al. [1998].\nExport of ozone from the European boundary layer\nis smaller in magnitude due to slightly lower emissions\nand lower production efficiencies; slower formation\nrates and significant wintertime titration in Northern\nEuropean industrial regions, which have high NOx\nemission densities, lead to reduced production and\nexport. The ozone production efficiency reaches only\n3.8 in the summer, and is close to zero in the win-\nter, indicating that titration over Northern Europe\nis almost equal to production over Southern Europe.\nA slightly greater fraction of NOx emissions, 21%,\nis exported from the boundary layer than for North\nAmerica, and significant additional ozone production\noccurs in the free troposphere over the region, about\n20 Tg\/yr, similar to that over the U.S.\nNet production of ozone in the boundary layer over\nEast Asia is less than that for North America, but\ngreater than for Europe. The ozone production effi-\nciency is higher, peaking at 6.4 in the summer, reflect-\ning lower NOx emission intensities and more southerly\nlatitudes. Surface deposition is less than for the U.S.,\ndue in part to faster vertical transport out of the\nboundary layer, and this greater venting also leads to\ngreater net production above the boundary layer, 25.6\nTg\/yr compared to 21.0 Tg\/yr. Consequently, net O3\nexport from the region is also larger. Mauzerall et al.\n[2000] make an upper estimate of O3 export from East\nAsia of 58 Tg\/yr; our estimate of 40 Tg\/yr is some-\nwhat lower, but does not account for the influx and\nremoval of O3 from stratospheric sources (13 Tg\/yr),\nwhich brings the figures into good agreement.\n4. Anthropogenic Emissions\nTo determine the effects of anthropogenic emis-\nsions on regional and global ozone budgets, we in-\ncrease the emissions of NOx, CO and NMHC from\nsurface fossil fuel sources by 10% for each region\nin turn. This perturbation was chosen to be small\nenough to avoid significant non-linear chemical influ-\nences on O3 formation, but large enough to produce\na measurable global response. In addition, it pro-\nvides a reasonably realistic short-term scenario for the\nEast Asian region, where NOx emissions are currently\nthought to be increasing at 4–5% a year [van Aar-\ndenne et al., 1999; Streets and Waldhoff, 2000]. For\nthis region, emissions were increased west of 130◦E,\nthereby focusing on the developing nations of the re-\ngion, principally China, and excluding Japan. How-\never, the ratio of emissions has been held constant to\nexplore the current chemical environment, and hence\nthe results may not be truly representative of future\ntrends.\nIn each case, the CTM was initialised with chem-\nical fields for July from an earlier 2-year run of the\nmodel, and run for 18 months, discarding the first 6-\nmonth period. In addition to the standard chemical\nspecies, an inert tracer, ‘iNOx’, was released globally\nat the same rate as fossil fuel NOx emissions, and pro-\nvided with a first-order removal time of 10 days, to\nassess the effects of transport independent of chemical\nprocesses. For each scenario, the impacts of the addi-\ntional emissions on oxidant budgets over each region\nwere assessed for each month by taking the difference\nbetween the budget terms and those in the control\nrun. We first look at the annual, global changes, and\nthen focus on seasonal variations and regional differ-\nences and on the mechanisms which control them.\n4.1. Regional Budgets\nOver each region, increased emissions lead to greater\nnet chemical O3 production over the global tropo-\nsphere, see Table 2. In each case, about 95% of the Table 2\nadditional O3 is deposited to the surface; the rest\ncontributes to increased atmospheric concentrations.\nThe proportion is slightly less for East Asia, where\nvertical transport leads to a greater interaction with\nthe model stratosphere; the length of the runs is insuf-\nficient to allow redistribution throughout the strato-\nsphere and hence to establish a steady-state impact\non the global burden.\nAdditional net O3 production in the regional bound-\nary layer for U.S. and East Asian emissions is greater\n6than the increase in global net production, indicating\nthat the global troposphere outside the continental\nboundary layer is a net sink of pollution O3 on an an-\nnual basis; over Europe, where wintertime titration\nsignificantly reduces additional O3 formation, 35% of\nthe total net formation is outside the region. Addi-\ntional formation over East Asia exceeds that over the\nU.S., despite lower precursor emissions, principally\nbecause of the lower emission intensities over the re-\ngion, hence higher production efficiencies, and the rel-\natively small contribution from wintertime titration.\nThe ozone production efficiencies calculated from the\nadditional formation are rather lower than those de-\nrived for each region in Table 1, reflecting the greatest\nabsolute increases in emissions in areas which already\nhave high emissions, and providing a weighting to-\nwards areas with low production efficiencies.\nThe fraction of pollution O3 exported is fairly sim-\nilar over each region, 66–77% of the additional net O3\nproduction. The proportion is largest for East Asia,\nwhere greater vertical transport leads to the shortest\nresidence time, 2.6 days to transport and deposition\non an annual basis, compared to 4.2 days for the U.S.\nand 5.7 days over Europe. The export fraction for the\nU.S. boundary layer, 66%, is similar to that found in\nprevious studies; Liang et al. [1998] derive a value of\n73%, and Jacob et al. [1993] a summertime value of\n70%. We find that the June–August period accounts\nfor about half of the annual exports from the region;\nwhile there is almost no export in winter, spring ac-\ncounts for about 30% and autumn for about 20% of\ntotal exports.\nTable 2 also shows the relative roles of chemistry\nand vertical transport in controlling O3 from an-\nthropogenic sources in the upper troposphere. Di-\nrectly over each region, direct transport of O3 and\nnet chemical production from transported precursors\nmake similar contributions to the additional O3; for\nthe U.S. and East Asia direct transport is slightly\nmore important, while for Europe it is somewhat less\nimportant. However, on a global basis, additional\nin-situ production dominates, and direct transport\nonly accounts for 14–30% of the upper tropospheric\nO3 enhancement. Most of the additional O3 produc-\ntion (64–73%) occurs beyond the boundaries of the\nregions, emphasising the faster transport and longer\nNOx and O3 lifetimes at these altitudes. As in the\nboundary layer, East Asia has the greatest impacts,\nwith about 30% greater O3 enhancements than for\nthe U.S.; this highlights the critical role played by\nvertical transport processes in enhancing both direct\ntransport and additional chemical production.\n4.2. Global Influences\nThe spatial extent of the annual mean changes in\nO3 and its chemical tendency are shown in Figures 4\nand 5. The change in O3 mixing ratio is greatest Figures 4\nin the boundary layer over the emission region, but\nsignificant impacts are also seen in the upper tropo-\nsphere to the extent that the peak zonal mean en-\nhancements are seen at northern mid-latitudes. The\nmeridional mean figures highlight the enhancements\nin O3 above the polluted boundary layer and some\nway downwind of the region; in the case of East Asian\nemissions, vertical transport processes take O3 and\nprecursors sufficiently close to the tropopause that\nthey interact with the model stratosphere. The extent\nto which additional O3 is found downwind of source\nregions is evident from the column mean figures; that\nthis occurs to the greatest degree in the mid and\nupper troposphere can be seen from the meridional\nmeans. Note the different latitudinal influences, as\nEuropean emissions give the greatest enhancements\nover Polar regions, while East Asian emissions oc-\ncur sufficiently far south to affect the Tropics, and\nconsequently have a greater influence in the Southern\nHemisphere.\nThe change in the chemical O3 tendency, shown in\nFigure 5, highlights the regional effects clearly, and\nemphasizes the role of chemistry beyond the polluted\nboundary layer. While regional boundary layer pro-\nduction is enhanced, significant additional production\noccurs on a hemispheric scale at higher altitudes. The\nimportance of vertical transport processes in enhanc-\ning upper tropospheric O3 formation by lofting pre-\ncursors is clear and accounts for much of the difference\nbetween regions; for Europe, where vertical transport\nplays a smaller role, enhancement of O3 formation\nis restricted to the lower and mid troposphere, and\nthe global extent is reduced. For East Asia, where\nO3 and precursors are lifted highest, the large ad-\nditional upper tropospheric production is partially\noffset by reduced production in the mid-troposphere\nover the emission region compared to the other sce-\nnarios. Increased O3 destruction occurs principally\nin the mid-troposphere in outflow regions; while this\nis a maximum immediately east of each region, low-\nlevel southerly and southwesterly outflow leads to a\nnet increase in destruction in the Northern Tropics.\nIn the zonal and meridional mean figures, decreases\nin annual net O3 production can be seen close to the\nsurface for the Northeastern U.S. and Northwestern\n7Europe, where NOx emissions are highest, providing\nevidence of wintertime ozone titration.\n4.3. Intercontinental Transport\nThe extent to which the continental regions affect\neach other is illustrated in Figure 6, which shows theFigure 6\nmonthly variations in the O3 perturbations at three\naltitudes over each region for each scenario. The\nmass-weighted mean mixing ratios are shown for each\nlevel, while the error bars give the spatial variance\nover each region. O3 is most greatly enhanced in the\nboundary layer in the emission regions, as expected,\nwith reduced perturbations at higher altitudes con-\ntrolled by transport and chemistry. Downwind, the\ngradient is typically reversed, with higher values in\nthe free troposphere than at the surface. All scenarios\nshow summertime maxima in the emission region, and\nmost show summertime minima outside the region,\nconsistent with more rapid chemical formation and\ndestruction and with variations in transport patterns\nbringing more air from southerly latitudes. Down-\nwind regions see a spring maximum at the surface,\nand generally throughout the troposphere; most re-\ngions also see a secondary maximum in autumn. The\nspring maximum occurs at the same period that re-\nmote observation stations in Northern mid-latitude\nregions typically see maximum ozone concentrations\n[e.g.,Monks, 2000], and underscores the contributions\nthat tropospheric sources and transport make to this\nfeature.\nFor East Asian emissions, upper tropospheric con-\ncentrations are enhanced to a greater extent than\nfor the other scenarios, and strong enhancements are\nseen over the U.S., particularly in spring and autumn.\nThis is also seen in the iNOx tracer, shown in Fig-\nure 7, suggesting that it is principally due to moreFigure 7\nrapid, direct transport. This is supported by the rel-\natively strong vertical gradient seen over the region.\nThe spatial variability is large, reflecting the different\nsources and transport times over different parts of the\nU.S.; during the summer, when the westerly airflow\nis rather weaker, the perturbation is small. Inter-\nestingly, the magnitude of variations over Europe is\nsimilar to that over the U.S., but with a smaller vari-\nance due to the greater distance downwind and to the\nlower variability in flow patterns. O3 enhancements\nat the surface are only about 10% less than over the\nU.S., 25% less in the mid-troposphere, and are about\n10% more in the upper troposphere on an annual ba-\nsis. This is partly due to the northward displacement\nof the principal transport pathway over North Amer-\nica in summertime, as the U.S. sees greater influence\nfrom more southerly air masses. However, the signif-\nicant effects over Europe emphasise the role of upper\ntropospheric transport in enhancing surface O3 on a\nhemispheric scale.\nWhile the importance of transport in defining the\nseasonality is clear from the behaviour of the iNOx\ntracer downwind of East Asia, the impacts for O3\nare strongly modulated by chemistry. The greater\nnet summertime formation of ozone in the continen-\ntal boundary layer contrasts with the lack of signifi-\ncant seasonality seen for the iNOx tracer, and might\ntherefore be expected to enhance the impact over the\nU.S. in summer; however the shorter chemical lifetime\nduring transit and slower transport times offset this.\nIn spring and autumn, when longer NOx and NOy\nlifetimes allow more to be carried up into the upper\ntroposphere, the greater in-situ chemical production\nand shorter transport times ensure that these seasons\nremain dominant over the U.S. and Europe.\nThe impact of U.S. emissions on surface O3 in\nEurope are the largest intercontinental effects seen\nhere, and reflect the short transport times; air ar-\nriving in the mid-troposphere, below 400 hPa, sees\nthe greatest enhancements. Surface enhancements\naverage about 35% of those over the U.S. on an an-\nnual basis. The spring maximum at the surface is\nalso seen in the iNOx tracer, emphasising the impor-\ntance of transport. However, the effects on East Asia\nare far smaller, principally because much of the flow\nfollows a more northerly path, around the Tibetan\nPlateau; only the northern parts of China, Korea and\nJapan see greater influences, and the spatial variances\nare consequently large. The vertical gradient is rela-\ntively small, reflecting greater vertical mixing over the\nEurasian continent, and the variations closely match\nthose in the iNOx tracer, suggesting that deposition\nof O3 over Western and Central Asia makes up for\nadditional O3 formation during transport.\nEuropean emissions have the smallest downwind\neffects, due to less active vertical transport, despite\ngreater extremes of boundary layer production and\ntitration. Upper tropospheric O3 is affected least of\nthe three scenarios, but significant perturbations are\nstill seen over both Asia and the U.S., particularly in\nSpring. It is notable that European emissions con-\ntribute as much to surface O3 perturbations over the\nU.S. as emissions from Asia do, with a similar sea-\nsonality, but with much smaller effects in the upper\ntroposphere, reflecting the different modes of transit.\nEuropean emissions are found to have a greater ef-\n8fect on polar regions, and may thereby affect North\nAmerica by a shorter route than mid-latitude trans-\nport around the globe. However, the polar regions are\nleast well represented in the current model, and hence\nfurther analysis is required to support this result.\n4.4. Mechanisms\nThe key mechanisms involved in export of pol-\nlution O3 from the continental boundary layer are\nshown for the three study regions in Figure 8. OverFigure 8\neach region O3 formation is highest in summer, and\nhence net export is largest; however, the regions dif-\nfer considerably in the relative importance of removal\nprocesses. Deposition and deep convection peak in\nsummer, and are similar in magnitude except over\nthe U.S., where deposition dominates. The principal\ndifference between the regions arises from the contri-\nbutions of non-convective vertical transport, typically\nslower transport associated with pressure systems and\nthe passage of fronts. Over Europe, these processes\nhave a very small impact on an annual mean ba-\nsis; over East Asia, they exceed convection. Between\nFebruary and May over East Asia about 65% of the\nvertical transport of O3 is controlled by these pro-\ncesses; in summer, when high pressure systems trap-\nping O3 close to the surface are more common, hori-\nzontal advection dominates. Over Europe, where con-\nvection is rather weaker, large summertime high pres-\nsure regions are common, and horizontal advection in\nthe boundary layer is the major export mechanism\nfor much of the year. Note that the relative impor-\ntance of these processes differs for other species. For\nshort-lived species such as NOx, where the vertical\ngradient is steep, the rapid exchange associated with\nconvection dominates slower lifting processes and ac-\ncounts for more than 90% of vertical export. This sug-\ngests that while convection accounts for only 40% of\nvertical export of O3, chemical production above the\nboundary layer following these events will be rather\ngreater than after slower lifting events.\nTo investigate the mechanisms controlling the fate\nof these oxidants on a global scale, we calculate\nmonthly budgets and tendencies for O3 over each re-\ngion. In addition to the boundary layer, we define\na mid-tropospheric layer (model levels 4 and 5, σ =\n0.73–0.40, typically 2.2–6.4 km), and an upper tropo-\nspheric layer (levels 6 and 7, σ = 0.40–0.15, typically\n6.4–13 km). We calculate fluxes for the same alti-\ntude bins for the global troposphere external to the\nregion; the fluxes in these six domains are additive,\nand cover the whole of the troposphere from the sur-\nface to about 150 hPa. We consider the East Asian\nemissions perturbation to illustrate the mechanisms\ninvolved; we first focus on the ‘iNOx’ tracer which\nhas a fixed, first-order loss rate of 10 days, and then\non O3, where the chemical lifetime varies with season\nand region.\nFigure 9 shows changes in the fluxes of the ‘iNOx’ Figure 9\ntracer over East Asia and over the rest of the globe\ndue to 10% increased emissions over East Asia. In\nthe boundary layer, the lifetime to vertical and hori-\nzontal transport is 3.3 days in January, but only 1.9\ndays in July, and hence the burden is about 60%\ngreater in January than in July. Vertical transport\ninto the free troposphere dominates exports for most\nof the year, but horizontal transport in the bound-\nary layer is important from November to February;\nmuch of this occurs in the southernmost part of the\nregion, where there is wintertime outflow towards In-\ndia. The mid-troposphere sees greatest input from\nthe boundary layer in March, when non-convective\nlofting reaches a maximum; the upper troposphere is\nmore strongly controlled by convection, and input is\ngreatest in summer, although temporary suppression\nof lofting provides a secondary minimum in July. Hor-\nizontal transport out of the emission region is maxi-\nmum in the boundary layer in winter, peaks in March\nin the mid-troposphere, and shows broad spring and\nautumn maxima in the upper troposphere. The sea-\nsonality in the upper troposphere is reversed with re-\nspect to the boundary layer, emphasising the impor-\ntant role that vertical transport processes over emis-\nsion regions play in controlling distributions down-\nwind. Note that while the ‘iNOx’ tracer is sensitive to\ntransport time scales, the export patterns described\nhere are representative of longer-lived pollutants such\nas CO, which shows a very similar seasonal variation\nin exports.\nThe budget of additional O3, see Figure 9, shows\nsimilar patterns modulated by variations in chemi-\ncal O3 production. Net boundary layer O3 formation\npeaks in July at about four times that in winter; the\nresidence time of O3 in the boundary layer is 2.3 days\nin July (8.4 days to deposition, 3.2 days to transport),\nand 4.0 days in January (43 days to deposition, 4.5\ndays to transport); the chemical lifetimes are 3.4 days\nand 6.4 days, respectively. Vertical transport domi-\nnates removal, and upper tropospheric enhancements\nare similar to those for the iNOx tracer, though the\nseasonality is stronger due to the greater summertime\nburden in the boundary layer. Vertical transport of\nshort-lived species such as NOx is dominated by deep\n9convection rather than by slower lifting processes; this\nleads to significant additional O3 production in the\nupper troposphere which almost matches direct O3\ntransport. In the mid troposphere, there is net pro-\nduction in spring, when the ratio of NOx to O3 in\nair lifted from the boundary layer is relatively large,\nbut very little in summer, when boundary layer NOx\nlevels are lower and O3 levels higher.\nWhile horizontal transport of O3 and NOx out of\nthe emission region occurs at all levels, ozone pro-\nduction efficiencies are 10–20 times higher in the up-\nper troposphere than at the surface, and hence net\nchemical formation contributes almost as much O3 as\ndirect export at these altitudes. Most of this O3 is\nlost by subsidence to the lower troposphere, where it\nprovides almost twice as much O3 as direct horizon-\ntal transport from the emission region. Although the\nlower troposphere sees greater ozone formation from\nadvected NOx, production efficiencies are lower, and\ndestruction of additional O3 transported into the re-\ngion dominates. On a global scale, outside the emis-\nsion region, lower tropospheric loss is greater than\nupper tropospheric production, and the global tropo-\nsphere therefore acts as a net chemical sink of the\nadditional pollution O3, as indicated in Table 2.\nThe U.S. scenario (not shown) is qualitatively sim-\nilar, and vertical and horizontal transport make sim-\nilar contributions to export throughout the year; ver-\ntical transport peaks in August and leads to a maxi-\nmum in additional O3 production in the upper tropo-\nsphere at this time. The European scenario shows\nrather different patterns, as significant wintertime\ntitration reduces the net O3 production, and leads to\na reduction in export from the boundary layer during\nthe period. Horizontal transport dominates removal\nof O3 from the boundary layer. Vertical transport\ninto the mid-troposphere provides little additional O3\nbecause of the uniformity of the vertical gradient, but\nsufficient NOx is lifted by convection to contribute ad-\nditional O3 formation, peaking in spring. The propor-\ntion of iNOx tracer reaching the upper troposphere by\nconvection is small, only 15–35% of that reaching the\nmid-troposphere, and the net additional O3 produc-\ntion is likewise small. However, significant quantities\nof NOx are exported from the region, and the upper\ntroposphere sees net production, as for the U.S. and\nEast Asian scenarios (see Table 2). In the boundary\nlayer outside the region about 78% of the additional\nO3 exported is deposited, compared to 56% and 55%\ndownwind of the U.S. and East Asia. This reflects\nboth lower net production in the emission region and\ngreater removal downwind, where deposition over the\nEurasian continent is rather faster than that over the\nPacific or Atlantic Oceans. Increased production from\ngreater horizontal transport of precursors and reduced\nchemical loss from competition with deposition both\ncontribute to an increased net O3 tendency, and in\ncontrast to the U.S. or East Asia scenarios, there is\nsignificant additional net production outside the emis-\nsion region.\n4.5. Episodicity\nWhile the main focus of this study is on monthly,\nregional effects, it is clear from observations [Newell\net al., 1996; Jaffe et al., 1999; Stohl and Trickl,\n1999] and modelling studies [Yienger et al., 2000] that\na significant proportion of intercontinental oxidant\ntransport happens in a limited number of episodes\nwhen meteorological conditions are favourable. These\nepisodes typically bring air from emission regions\nrather more quickly than the mean flow, and may\nbe responsible for much of the seasonality evident in\nFigure 6. We investigate this by considering the tem-\nporal variations in ozone enhancements at Boulder,\nHohenpeissenberg and Sapporo, from increased emis-\nsions in remote regions, see Figure 10. Figure 10\nOver each site, winter shows relatively little vari-\nability at any altitude, as vertical transport over\nsource regions is suppressed and direct transport\nevents are less frequent. However, lower level trans-\nport over the Atlantic is still significant, and can be\nseen in brief periods of enhanced North American in-\nfluence over Hohenpeissenberg. The greatest variabil-\nity typically occurs in the free troposphere between\nMay and November, when greater O3 production and\nmore direct horizontal transport produce larger en-\nhancements. The contrast is greatest in summer in\nthe lower free troposphere at Boulder and Sapporo,\ndespite less direct horizontal transport in this season,\nas cleaner air from more southerly latitudes removes\nthe enhancements in ‘background’ O3. Over Europe,\nwhere air mass origins are less diverse, the enhance-\nments show less variability. In general, the impacts\nfrom upwind regions are reasonably well correlated,\nemphasising the similar pathways for pollutant trans-\nport; over North America, however, there is signif-\nicant anti-correlation of European and Asian influ-\nences evident in the mid-troposphere in spring and\nautumn. While East Asian influences are driven by\nhigh level flow and subsidence, European effects are\ngreatest at lower altitudes in more northerly flow from\npolar regions.\n10\nComparison of upper tropospheric enhancements\nfrom Asian emissions over Boulder and Hohenpeis-\nsenberg reveals the propagation of a number of pollu-\ntion events, most notably in May and September. In\nthe May episode, the largest seen here, the spike in\nO3 takes 8 days to reach the central U.S. and then a\nfurther 4 days to reach Europe, dropping from 2.5 to\n0.67 ppbv. While the resolution of the current model\nmay be too coarse to accurately capture the magni-\ntude of the enhancement in this type of plume, it is\nclear that the model is able to capture the general\nbehaviour of these events. However, despite the pres-\nence of distinct episodes with enhanced transport of\nO3 originating in the continental boundary layer, it is\nclear that the variability does not dominate the mean\nenhancements, and that the baseline of ‘background’\nO3 mixing ratio experienced at these sites is substan-\ntially increased by increases in remote emissions of\nprecursors.\n4.6. Past and Future Changes\nWhile the long-range impacts of continental emis-\nsions have been clearly detected in species such as\nCO, PAN and aerosols in favourable meteorological\nconditions [Jaffe et al., 1999], the monthly-mean im-\npacts on O3 will be rather harder to detect due to the\nsmall size of the perturbations and the large variabil-\nity in natural sources. In addition, rises in O3 from\nanthropogenic sources may be partially masked by re-\nduced influx from the lower stratosphere; Logan et al.\n[1999], analyzing trends from ozonesonde measure-\nments between 1970 and 1996, identify a mid-latitude\ntrend in the lower-most stratosphere of -7%\/decade,\nbut conclude that it is not yet possible to identify a\ngeneral tropospheric trend in O3.\nHowever, Lin et al., [2000], analyzing the trend\nin ozone at rural surface sites over the U.S. between\n1980 and 1998, detect a small increase in ozone at the\nlower end of the probability distribution, peaking in\nspring, and with a secondary maximum in autumn.\nThey suggest increases in East Asian emissions as a\npossible source of this, and the seasonality is very\nsimilar to what would be expected from the current\nstudy, although they find that the effects are greatest\nin the northeastern U.S. rather than in the north-\nwestern U.S. as would be expected for East Asian\ninfluences. While emissions from the U.S. and Eu-\nrope are thought to have changed relatively slowly\nover the last two decades, those from East Asia have\nbeen rising quickly. Akimoto and Narita [1994] esti-\nmate a factor of two increase in NOx emissions in Asia\noutside Japan between 1975 and 1987, and forecasts\nof increases in NOx emissions from Asia for 1990–\n2020 are about 4–5% per year [van Aardenne et al.,\n1999; Streets and Waldhoff, 2000]. Assuming that\nemissions of CO and NMHCs increase proportionally,\nwhich may overestimate trends in CO emissions in\nparticular, our results from a 10% increase in 1990\nemissions suggest that an increase in mean surface\nozone over the U.S. of 40–160 pptv would take 2–\n3 years. While this appears to account for less than\nhalf of the 3–5 ppbv increase suggested by Lin et al.,\n[2000] between 1980 and 1998, it is likely to make\na substantial contribution. Jacob et al. [1999] sug-\ngest that a tripling of emissions over East Asia be-\ntween 1985 and 2010 would lead to monthly mean\nsurface enhancements of 2–6 pppbv over the western\nU.S. and 1–3 ppbv over the eastern U.S. While the\nnon-linearity in ozone production prevents us from\nmaking a direct comparison based on 10% increased\nemissions, our results are in broad agreement with\nthese conclusions, and we suggest that impacts over\nEurope may be only marginally smaller on an annual\nbasis.\n5. Conclusions\nIn this study, we have demonstrated the extent to\nwhich surface emissions of NOx, CO and hydrocar-\nbons from anthropogenic sources may affect oxidant\nconcentrations in downwind regions on a hemispheric\nscale. Of the three Northern mid-latitudes regions\nconsidered, we find that East Asia has the greatest\npotential to affect tropospheric ozone, and that both\nNorth America and Europe see significant influence\nin surface ozone from this source, peaking in spring\nand autumn. However, we find the greatest inter-\ncontinental effects are over Europe due to relatively\nshort-range transport from North American source re-\ngions. The smallest effects are seen downwind of Eu-\nrope, where the continental land-mass and regional\nmeteorology lead to lower-level outflow, greater de-\nposition and flow to the north of the East Asian re-\ngion. We suggest that Europe is the most prone as\na receptor of these long-range impacts, whilst most\nof the East Asian region is relatively sheltered. We\nnote that the ozone enhancements are not limited to\nthe lower atmosphere, and that the substantial upper\ntropospheric enhancements, also found by Berntsen\net al. [1996], may have important implications for\nclimate studies, as ozone in this region has a greater\nradiative forcing effect than at lower altitudes in the\ntroposphere.\n11\nThe extent of these intercontinental impacts is con-\ntrolled by a number of mechanisms: boundary layer\nproduction of ozone, lifting of ozone and precursors\ninto the free troposphere, further in-situ chemical pro-\nduction, rapid and direct horizontal transport, depo-\nsition or chemical removal during transport, and even-\ntual subsidence over receptor regions. The balance\nbetween these processes varies considerably by season\nand by region. While boundary layer production and\nconvective lifting are greatest in summer, the chemi-\ncal lifetime is short, and transport is less direct, pole-\nward of the regions considered, reducing the effects in\nthis season. The greatest impacts are seen in spring\nand autumn, when horizontal transport is rapid and\ndirect, when boundary layer production and lifting\nare greater than in winter, but when the chemical life-\ntime during transport is rather greater than in sum-\nmer. Although the seasonality is controlled largely by\ntransport processes, as demonstrated with the inert\niNOx tracer, chemical production plays a significant\nrole. We find that 25–40% of the total regional net\nproduction occurs above the boundary layer, and that\nin the upper troposphere (400–150 hPa) in-situ forma-\ntion from transported precursors accounts for 70–85%\nof the O3 from surface anthropogenic sources. Fi-\nnally, we highlight the role of efficient non-convective\nlifting over East Asia in spring, coupled with direct\nhorizontal transport, in enhancing the intercontinen-\ntal impacts of this region.\nWhile there is additional net O3 production in the\npolluted boundary layer from increased emissions over\neach region, there is increased destruction in more re-\nmote parts of the lower troposphere caused by the\ngreater export of ozone. Future increases in continen-\ntal emissions are likely to increase net ozone produc-\ntion in those parts of the troposphere which already\nsee net production, and to increase net destruction\nin sink regions such as the remote lower and mid-\ntroposphere. This increasing polarization may be-\ncome evident in greater contrasts between the chemi-\ncal environment over the continents and that over the\noceans, and between the upper and lower troposphere.\nThe emission perturbations used in the present\nstudy include only surface fossil fuel and industrial\nsources; no perturbation is applied to aircraft sources\nwhich may be expected to have larger impacts on up-\nper tropospheric ozone due to direct emissions in the\nregion. Changes in vegetation or biomass burning\nemissions are also not considered, although these are\nlargely under anthropogenic control in the regions of\ninterest. The chemical scheme used, while captur-\ning the general features of the tropospheric distribu-\ntions of the species of interest, does not account for\nheterogeneous chemistry on the surface of aerosols,\nwhich may lead to a reduction in boundary layer O3\nformation [Phadnis and Carmichael, 2000]. Future\nstudies would benefit greatly from using appropriate\nmeteorological data to allow more detailed testing of\nthe conclusions with tropospheric measurements from\ncontinental margins, for example from the West coast\nof the U.S. Finally, this study has focussed on North-\nern mid-latitude effects, but increasing development\nin countries such as India may be expected to ex-\nert considerable influence on the oxidizing capacity\nof the troposphere through direct impact on tropical\nregions.\nAcknowledgments. The authors are grateful for\nhelpful discussions with Michael Prather, and for the use-\nful comments of three anonymous reviewers.\nReferences\nvan Aardenne, J.A., G.R. Carmichael, H. Levy, D. Streets,\nand L. Hordijk, Anthropogenic NOx emissions in Asia\nin the period 1990–2020, Atmos. Env., 33, 633–646,\n1999.\nAkimoto, H., and H. Narita, Distribution of SO2, NOx\nand CO2 emissions from fuel combustion and industrial\nactivities in Asia with 1◦×1◦ resolution, Atmos. Env.,\n28, 213–225, 1994.\nAndreae, M.O., J. Fishman, and J. Lindesay, The South-\nern Tropical Atlantic Region Experiment (STARE):\nTransport and Atmospheric Chemistry near the Equa-\ntor — Atlantic (TRACE-A) and Southern African Fire-\nAtmosphere Research Initiative (SAFARI): An Intro-\nduction, J. Geophys. Res., 101, 23,519–23,520, 1996.\nAtherton, C.S., S. Sillman, and J. Walton, Three-dimensional\nglobal modeling studies of the transport and photo-\nchemistry over the North Atlantic Ocean, J. Geophys.\nRes., 101, 29,289–29,304, 1996.\nBerntsen, T, I.S.A. Isaksen, W.C. Wang, and X.Z. Liang,\nImpacts of increased anthropogenic emissions in Asia\non tropospheric ozone and climate, Tellus, 48B, 13–32,\n1996.\nBerntsen, T.K., S. Karlsdottir, and D.A. Jaffe, Influence\nof Asian emissions on the composition of air reaching\nthe North Western United States, Geophys. Res. Lett.,\n26, 2171–2174, 1999.\nBethan, S, G. Vaughan, C. Gerbig, A. Volz-Thomas, H.\nRicher, and D.A. Tiddeman, Chemical air mass dif-\nferences near fronts, J. Geophys. Res., 103, 13,413–\n13,434, 1998.\nBodhaine, B.A., J.M. Harris, J.A. Ogren, and D.J. Hof-\nmann, Aerosol optical properties at Mauna Loa Obser-\nvatory: Long-range transport from Kuwait?, Geophys.\n12\nRes. Lett., 19, 581–584, 1992.\nBrasseur, G.P., D.A. Hauglustaine, S. Walters, P.J. Rasch,\nJ.-F. Mu¨ller, C. Granier, and X.X. Tie, MOZART, a\nglobal chemical transport model for ozone and related\nchemical tracers .1. Model description, J. Geophys.\nRes., 103, 28,265–28,289, 1998.\nCarver, G.D., P.D. Brown and O. Wild, The ASAD at-\nmospheric chemistry integration package and chemical\nreaction database, Computer Physics Communications,\n105, 197–215, 1997.\nChameides, W.L., and J.C.G. Walker, A photochemical\ntheory for tropospheric ozone, J. Geophys. Res., 78,\n8751–8760, 1973.\nChameides, W.L., P.S. Kasibhatla, J. Yienger, and H.\nLevy II, Growth of continental-scale metro-agro-plexes,\nregional ozone pollution, and world food production,\nScience, 264, 74–77, 1994.\nCollins, W.J., D.S. Stevenson, C.E. Johnson, and R.G.\nDerwent, The European regional ozone distribution\nand its links with the global scale for the years 1992\nand 2015, Atmos. Env., 34, 255–267, 2000.\nDuce, R.A., C.K. Unni, B.J. Ray, J.M. Prospero, and J.T.\nMerrill, Long-range atmospheric transport of soil dust\nfrom Asia to the tropical North Pacific, Science, 209,\n1522–1524, 1980.\nFehsenfeld, F.C., P. Daum, W.R. Leaitch, M. Trainer,\nD.D. Parrish, and G. Hu¨bler, Transport and process-\ning of O3 and O3 precursors over the North Atlantic:\nAn overview of the 1993 North Atlantic Regional Ex-\nperiment (NARE) summer intensive, J. Geophys. Res.,\n101, 28,877–28,891, 1996.\nGuenther, A., C.N. Hewitt, D. Erikson, R. Fall, C. Geron,\net al., A global model of natural volatile organic com-\npound emissions, J. Geophys. Res., 100, 8873–9992,\n1995.\nHoell, J.M., D.D. Davis, S.C. Liu, R.E. Newell, H. Aki-\nmoto, R.J. McNeal, and R.J. Bendura, The Pacific\nExploratory Mission-West Phase B: February-March\n1994, J. Geophys. Res., 102, 28,223–28,240, 1997.\nHorowitz, L.W., J.Y. Liang, G.M. Gardner, and D.J. Ja-\ncob, Export of reactive nitrogen from North America\nduring summertime: Sensitivity to hydrocarbon chem-\nistry, J. Geophys. Res., 103, 13,451–13,476, 1998.\nJacob, D.J., S.M. Fan, S.C. Wofsy, P.A. Spiro, P.S. Bak-\nwin, J.A. Witter, E.V. Browell, G.L. Gregory, D.R.\nFitzjarrald, and K.E. Moore, Deposition of ozone to\ntundra, J. Geophys. Res., 97, 16,473–16,479, 1992.\nJacob, D.J., J.A. Logan, G.M. Gardner, R.M. Yevich,\nC.M. Spivakovsky, and S.C. Wofsy, Factors regulat-\ning ozone over the United States and its export to\nthe global atmosphere, J. Geophys. Res., 98, 14,817–\n14,826, 1993.\nJacob, D.J., J.A. Logan, and P.P. Murti, Effect of rising\nAsian emissions on surface ozone in the United States,\nGeophys. Res. Lett., 26, 2175–2178, 1999.\nJaffe, D., et al., Transport of Asian air pollution to North\nAmerica, Geophys. Res. Lett., 26, 711–714, 1999.\nKotamarthi, V.R., and G.R. Carmichael, The long range\ntransport of pollutants in the Pacific Rim region, At-\nmos. Env., 24, 1521–1534, 1990.\nLiang., J.Y., and M.Z. Jacobson, Effects of subgrid seg-\nregation on ozone production efficiency in a chemical\nmodel, Atmos. Env., 34, 2975–2982, 2000.\nLiang., J.Y., L.W. Horowitz, D.J. Jacob, Y. Wang, A.M.\nFiore, J.A. Logan, G.M. Gardner, and J.W. Munger,\nSeasonal budgets of reactive nitrogen species and ozone\nover the United States, and export fluxes to the global\natmosphere, J. Geophys. Res., 103, 13,435–13,450,\n1998.\nLin, C.-Y., D.J. Jacob, J.W. Munger, and A.M. Fiore,\nIncreasing background ozone in surface air over the\nUnited States, Geophys. Res. Lett., 27, 3465-3468,\n2000.\nLin, X., M. Trainer, and S.C. Liu, On the non-linearity of\ntropospheric ozone production, J. Geophys. Res., 93,\n15,879–15,888, 1988.\nLogan, J.A., An analysis of ozonesonde data for the tropo-\nsphere: Recommendations for testing 3-D models, and\ndevelopment of a gridded climatology for tropospheric\nozone, J. Geophys. Res., 104, 16,115–16,149, 1999.\nLogan, J.A., I.A. Megretskaia, A.J. Miller, G.C. Tiao, D.\nChoi, L. Zhang, L. Bishop, R. Stolarski, G.J. Labow,\nS.M. Hollandsworth, G.E. Bodeker, H. Claude, D. De-\nMuer, J.B. Kerr, D.W. Tarasick, S.J. Oltmans, B.\nJohnson, F. Schmidlin, J. Staehelin, P. Viatte, and O.\nUchino, Trends in the vertical distribution of ozone:\na comparison of two analyses of ozonesonde data, J.\nGeophys. Res., 104, 26,373–26,399, 1999.\nLouis, J.F., A parametric model of vertical eddy fluxes\nin the atmosphere, Boundary Layer Meteorology, 17,\n187–202, 1979.\nMauzerall, D.L., D. Narita, H. Akimoto, L. Horowitz,\nS. Waters, D.A. Hauglustaine, and G. Brasseur, Sea-\nsonal characteristics of tropospheric ozone production\nand mixing ratios over East Asia: A global three-\ndimensional chemical transport model analysis, J. Geo-\nphys. Res., 105, 17,895–17,910, 2000.\nMcLinden, C.A., S. Olsen, B. Hannegan, O. Wild, M.J.\nPrather, and J. Sundet, Stratospheric ozone in 3-D\nmodels: A simple chemistry and the cross-tropopause\nflux, J. Geophys. Res., 105, 14,653–14,665, 2000.\nMonks, P.S., A review of the observations and origins\nof the spring ozone maximum, Atmos. Environ., 34,\n3545–3561, 2000.\nNewell, R.E., et al., Vertical fine-scale atmospheric struc-\nture measured from NASA DC-8 during PEM-West A,\nJ. Geophys. Res., 101, 1943–1960, 1996.\nOlivier, J.G.J., et al., Description of EDGAR Version 2.0,\nRIVM\/TNO report 771060 002, RIVM, Bilthoven, De-\ncember 1996.\nPhadnis, M.J., and G.R. Carmichael, Numerical investiga-\ntion of the influence of mineral dust on the tropospheric\n13\nchemistry of East Asia, J. Atmos. Chem., 36, 285–323,\n2000.\nPickering, K.E., A.M. Thompson, R.R. Dickerson, W.T.\nLuke, D.P. McNamara, J.P. Greenberg, and P.R. Zim-\nmerman, Model-calculations of tropospheric ozone pro-\nduction potential following observed convective events,\nJ. Geophys. Res., 95, 14,049–14,062, 1990.\nPrather, M. J., Numerical advection by conservation of\nsecond-order moments, J. Geophys. Res., 91, 6671–\n6681, 1986.\nPrice, C., and D. Rind, A simple lightning parameteri-\nzation for calculating global lightning distributions, J.\nGeophys. Res., 97, 9919–9933, 1992.\nRind, D., J. Lerner, K. Shah, and R. Suozzo, Use of on-\nline tracers as a diagnostic tool in general circulation\nmodel development, 2, Transport between the tropo-\nsphere and stratosphere, J. Geophys. Res., 104, 9151–\n9167, 1999.\nStohl, A., and T. Trickl, A textbook example of long-\nrange transport: Simultaneous observation of ozone\nmaxima of stratospheric and North American origin in\nthe free troposphere over Europe, J. Geophys. Res.,\n104, 30,445–30,462, 1999.\nStreets, D.G., and S.T. Waldhoff, Present and future emis-\nsions of air pollutants in China: SO2, NOx, and CO,\nAtmos. Env., 34, 363–374, 2000.\nVolz, A., and D. Kley, Evaluation of the Montsouris series\nof ozone measurements made in the nineteenth century,\nNature, 322, 240–242, 1988.\nWild, O., and M.J. Prather, Excitation of the primary\ntropospheric chemical mode in a global 3-D model, J.\nGeophys. Res., 105, 24,647–24,660, 2000.\nWild, O., X. Zhu and M.J. Prather, Fast-J: Accurate\nsimulation of in- and below-cloud photolysis in tropo-\nspheric chemical models, J. Atmos. Chem., 37, 245–\n282, 2000.\nYienger, J.J., and H. Levy II, Empirical model of global\nsoil-biogenic NOx emissions, J. Geophys. Res., 100,\n11,447–11,464, 1995.\nYienger, J.J., M.K. Galanter, T.A. Holloway, M.J. Phad-\nnis, S.K. Guttikunda, G.R. Carmichael, W.J. Moxim,\nand H. Levy II, The episodic nature of air pollution\ntransport from Asia to North America, J. Geophys.\nRes., 105, 26,931–26,945, 2000.\nH. Akimoto and O. Wild, Frontier Research System\nfor Global Change, 3173-25 Showa-machi, Kanazawa-\nku, Yokohama, Kanagawa 236-0001, Japan. (email:\noliver@frontier.esto.or.jp)\nReceived October 31, 2000\nThis preprint was prepared with AGU’s LATEX macros\nv5.01. File pp2 formatted March 12, 2008.\n14\nFigure 1. Monthly-mean O3 mixing ratios over Boulder (40\n◦N, 105◦W), Hohenpeissenberg (48◦N, 11◦E) and\nSapporo (43◦N, 141◦E) in the lower, mid- and upper troposphere; model means (dashed lines) and mulit-year mean\nozonesonde measurements (solid lines) [Logan, 1999].\nFigure 2. Components of the tropospheric ozone budget in the FRSGC\/UCI CTM by hemisphere, showing the\ncontribution of net influx from the stratosphere (top), net chemical tendency (middle), and deposition at the surface\n(bottom) in each hemisphere, month-by-month. Net tendencies are given in Tg\/month.\nFigure 3. The annual distribution of NOx emissions from industrial\/fossil fuel sources (in kgN\/yr) from EDGAR\nv2.0 [Olivier et al., 1996] on a 4◦× 5◦ grid. The regions used in the current study are highlighted; Japan has\nbeen included in the East Asian region for defining total exports (Table 1), but is not included in the perturbation\nstudies to allow a more realistic assessment of the effects of rapid development of other countries in the region.\nFigure 4. Annual zonal, column and meridional mean differences in O3 mixing ratios (in pptv) due to 10%\nincreased emissions over East Asia (top row), the U.S. (middle row), and Europe (bottom row).\nFigure 5. Annual zonal, column and meridional mean differences in net chemical O3 tendencies (in ng\/m\n2\/s) due\nto 10% increased emissions over East Asia, the U.S., and Europe.\nFigure 6. Differences in monthly mean O3 mixing ratios (in ppbv) at the surface, 650 hPa and 200 hPa over East\nAsia, the U.S., and Europe (columns) for 10% increased emissions in each region (rows). Shaded plots indicate the\nregion with increased emissions; error bars indicate the spatial variance of monthly means within each region.\nFigure 7. Differences in monthly mean iNOx mixing ratios (in ppbv) at the surface, 650 hPa and 200 hPa over\nEast Asia, the U.S., and Europe (columns) for 10% increased emissions in each region (rows). Shaded plots indicate\nthe region with increased emissions; error bars indicate the spatial variance of monthly means within each region.\nFigure 8. Monthly mass fluxes of O3 (in Tg\/month) through the physical processes controlling removal or export\nof pollution ozone from the continental boundary layer for the additional O3 formed from 10% increased fossil fuel\nemissions in each region.\nFigure 9. Differences in the mass flux (in Tg\/month) through different processes for (left) the decaying iNOx\ntracer and (right) O3 caused by 10% increased emissions over East Asia. Positive values indicate formation or\nimport, negative values destruction or export; note that the terms are additive, and hence that the six domains\ncover the global troposphere from the surface to 150 hPa.\nFigure 10. Enhancements in three-hourly O3 mixing ratios over Boulder (40\n◦N, 105◦W), Hohenpeissenberg (48◦N,\n11◦E) and Sapporo (43◦N, 141◦E) in the lower, mid- and upper troposphere; for comparison with the monthly means\nat these sites, see Figure 1.\n15\n2 4 6 8 10 12\n0\n20\n40\n60\n80\n100\nSonde\nCTM\n20\n40\n60\n80\n100\nO\n3 \nM\nix\nin\ng \nRa\ntio\n  \/\npp\nbv\n100\n200\n300\n400\nBoulder \n2 4 6 8 10 12\nHohenpeissenberg\n2 4 6 8 10 12\nSapporo\nMonth\n250 hPa\n600 hPa\nSurface\n250 hPa 250 hPa\n600 hPa 600 hPa\nSurface Surface\nFigure 1. Monthly-mean O3 mixing ratios over Boulder (40\n◦N, 105◦W), Hohenpeissenberg (48◦N, 11◦E) and\nSapporo (43◦N, 141◦E) in the lower, mid- and upper troposphere; model means (dashed lines) and multi-year mean\nozonesonde measurements (solid lines) [Logan, 1999].\n16\n 2 4 6 8 10 12\nMonth\n−60\n−40\n−20\n0\nDepos\nChem\nStrat\n−20\n0\n20\n40\nO\nzo\nne\n T\nen\nde\nnc\ny \n\/T\ng\/\nm\non\nth 0\n20\n40\n60\nS. Hemisphere\n 2 4 6 8 10 12\nMonth\n−60\n−40\n−20\n0\nDepos\nChem\nStrat\n−20\n0\n20\n40\nO\nzo\nne\n T\nen\nde\nnc\ny \n\/T\ng\/\nm\non\nth 0\n20\n40\n60\nN. Hemisphere\nFigure 2. Components of the tropospheric ozone budget in the FRSGC\/UCI CTM by hemisphere, showing the\ncontribution of net influx from the stratosphere (top), net chemical tendency (middle), and deposition at the surface\n(bottom) in each hemisphere, month-by-month. Net tendencies are given in Tg\/month.\n17\nFigure 3. The annual distribution of NOx emissions from industrial\/fossil fuel sources (in kgN\/yr) from EDGAR\nv2.0 [Olivier et al., 1996] on a 4◦× 5◦ grid. The regions used in the current study are highlighted; Japan has\nbeen included in the East Asian region for defining total exports (Table 1), but is not included in the perturbation\nstudies to allow a more realistic assessment of the effects of rapid development of other countries in the region.\n18\nFigure 4. Annual zonal, column and meridional mean differences in O3 mixing ratios (in pptv) due to 10%\nincreased emissions over East Asia (top row), the U.S. (middle row), and Europe (bottom row).\n19\nFigure 5. Annual zonal, column and meridional mean differences in net chemical O3 tendencies (in ng\/m\n2\/s) due\nto 10% increased emissions over East Asia, the U.S., and Europe.\n20\n2 4 6 8 10 12\n0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n2 4 6 8 10 12\n200 hPa\n650 hPa\nSurface\n2 4 6 8 10 12\nE. Asian Region U.S. Region European Region\nO\n3 \nPe\nrtu\nrb\nat\nio\nn \n\/p\npb\nv\nMonth\nE. Asian\nPerturbation\nU.S.\nPerturbation\nEuropean\nPerturbation\nFigure 6. Differences in monthly mean O3 mixing ratios (in ppbv) at the surface, 650 hPa and 200 hPa over East\nAsia, the U.S., and Europe (columns) for 10% increased emissions in each region (rows). Shaded plots indicate the\nregion with increased emissions; error bars indicate the spatial variance of monthly means within each region.\n21\n2 4 6 8 10 12\n 0.1\n1\n10\n100\n1000 \n1\n10\n100\n1000 \n1\n10\n100\n1000\n2 4 6 8 10 12\n200 hPa\n650 hPa\nSurface\n2 4 6 8 10 12\nE. Asian Region U.S. Region European Region\ne\n−\nFo\nld\n P\ner\ntu\nrb\nat\nio\nn \n\/p\npt\nv\nMonth\nE. Asian\nPerturbation\nU.S.\nPerturbation\nEuropean\nPerturbation\nFigure 7. Differences in monthly mean iNOx mixing ratios (in ppbv) at the surface, 650 hPa and 200 hPa over\nEast Asia, the U.S., and Europe (columns) for 10% increased emissions in each region (rows). Shaded plots indicate\nthe region with increased emissions; error bars indicate the spatial variance of monthly means within each region.\n22\n0 2 4 6 8 10 12\n−0.10\n−0.05\n0\n0.05\n0.10\n0.15\n0.20\n0.25\nHoriz. Transport\nVert. Trans. (Convective) \nVert. Trans. (Non−Conv) \nDeposition\n2 4 6 8 10 12 2 4 6 8 10 12\nEast Asia U.S. Europe\nMonth\nM\nas\ns \nof\n O\n3 \n\/T\ng\nFigure 8. Monthly mass fluxes of O3 (in Tg\/month) through the physical processes controlling removal or export\nof pollution ozone from the continental boundary layer for the additional O3 formed from 10% increased fossil fuel\nemissions in each region.\n23\n2 4 6 8 10 12\n−0.02\n−0.01\n0\n0.01\n0.02\n0.03\n0.04\nHoriz. Transport\nVert. Transport\nEmissions\nDecay (e−fold)\n−0.01\n0\n0.01\n0.02\n0.03\n0.04\n−0.01\n0\n0.01\n0.02\n0.03\n0.04\n E. Asian Region  \n2 4 6 8 10 12\nRest−of−World\nUpp Trop\nMid Trop\nB.Layer\nM\nas\ns \nof\n iN\nO\nx \nTr\nac\ner\n  \/\nTg\n(N\n)\nMonth\n2 4 6 8 10 12\n−0.4\n−0.3\n−0.2\n−0.1\n0\n0.1\n0.2\n0.3\n0.4\nHoriz. Transport\nVert. Transport\nDeposition\nChemistry\n−0.3\n−0.2\n−0.1\n0\n0.1\n0.2\n0.3\n0.4\n−0.3\n−0.2\n−0.1\n0\n0.1\n0.2\n0.3\n0.4\n E. Asian Region  \n2 4 6 8 10 12\nRest−of−World\nUpp Trop\nMid Trop\nB.Layer\nM\nas\ns \nof\n O\n3 \n \n\/T\ng\nMonth\nFigure 9. Differences in the mass flux (in Tg\/month) through different processes for (left) the decaying iNOx\ntracer and (right) O3 caused by 10% increased emissions over East Asia. Positive values indicate formation or\nimport, negative values destruction or export; note that the terms are additive, and hence that the six domains\ncover the global troposphere from the surface to 150 hPa.\n24\n2 4 6 8 10 12\n0\n0.2\n0.4\n0.6\n0.8\n1.0\nAsian Emissions\nEuropean Emissions \n0.2\n0.4\n0.6\n0.8\n1.0\nO\n3 \nPe\nrtu\nrb\nat\nio\nn \n \/p\npb\nv 0.2\n0.4\n0.6\n0.8\n1.0\nBoulder \n2 4 6 8 10 12\nU.S. Emissions\nAsian Emissions \nHohenpeissenberg\n2 4 6 8 10 12\nEuropean Emissions \nU.S. Emissions\nSapporo\nMonth\n250 hPa\n600 hPa\nSurface\n250 hPa 250 hPa\n600 hPa 600 hPa\nSurface Surface\nFigure 10. Enhancements in three-hourly O3 mixing ratios over Boulder (40\n◦N, 105◦W), Hohenpeissenberg (48◦N,\n11◦E) and Sapporo (43◦N, 141◦E) in the lower, mid- and upper troposphere; for comparison with the monthly means\nat these sites, see Figure 1.\n25\nTable 1. Annual Regional O3 and NOx Budgets\nU. States Europe E. Asia\nRegional Boundary Layer O3 (Tg\/yr)\nNet O3 production 60.5 30.7 49.1\nO3 deposition 49.1 27.2 34.5\nNet O3 export 11.4 3.4 14.7\nO3 prod. efficiency 3.10 2.25 3.90\nSummer (JJA) 4.80 3.84 6.41\nWinter (DJF) 1.10 0.05 2.21\nRegional Boundary Layer NOx (Tg(N)\/yr)\nNOx emissions 7.68 5.79 4.67\nNOx+PAN export 1.41 1.24 1.14\nFraction exported 18% 21% 24%\nTotal Regional O3 up to 150 hPa (Tg\/yr)\nNet O3 production 81.5 49.1 74.7\nNet O3 export 32.3 21.9 40.2\nStrat O3 import 19.3 14.3 13.2\nTrop O3 export 51.6 36.2 53.4\n26\nTable 2. Production and Fate of Anthropogenic O3\nFrom 10% Increased Emissions in Each Region\nU. States Europe E. Asia\nGlobal Tropospheric O3 (Tg\/yr)\nNet O3 production 2.13 2.00 1.65\nO3 deposition 2.04 1.91 1.48\nRegional Boundary Layer O3 (Tg\/yr)\nNet O3 production 2.48 1.30 2.57\nO3 deposition 0.85 0.36 0.58\nNet O3 export 1.63 0.94 1.99\nFraction exported 66% 72% 77%\nO3 prod. efficiency 1.24 0.92 2.74\nUpper Tropospheric O3, 400–150 hPa (Tg\/yr)\nO3 prod. (regional) 0.32 0.20 0.55\n(global) 1.20 0.88 1.53\nVertical transport 0.46 0.14 0.65\ncontrib. 28% 14% 30%\n"}