{"doi":"10.1088\/0305-4470","coreId":"96764","oai":"oai:generic.eprints.org:337\/core69","identifiers":["oai:generic.eprints.org:337\/core69","10.1088\/0305-4470"],"title":"An evolving network model with community structure","authors":["Li, C.","Maini, P. K."],"enrichments":{"references":[{"id":754747,"title":"Diaz-Guilera A and Arenas A","authors":[],"date":"2004","doi":"10.1103\/PhysRevE.70.056122","raw":null,"cites":null},{"id":754334,"title":"For a recent review, see","authors":[],"date":"2004","doi":"10.2307\/4614660","raw":null,"cites":null},{"id":754471,"title":"For some more recent papers see, for example,","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":754961,"title":"Modelling of weighted evolving networks with community structures (submitted)","authors":[],"date":null,"doi":"10.1016\/j.physa.2006.03.005","raw":null,"cites":null},{"id":754162,"title":"Nature 410 268 Albert R and Baraba´si A L","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":755136,"title":"Pastor-Satorras R and Vespignai A","authors":[],"date":"2003","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-11-11","abstract":"Many social and biological networks consist of communities—groups of nodes within which connections are dense, but between which connections are sparser. Recently, there has been considerable interest in designing algorithms for detecting community structures in real-world complex networks. In this paper, we propose an evolving network model which exhibits community structure. The network model is based on the inner-community preferential attachment and inter-community preferential attachment mechanisms. The degree distributions of this network model are analysed based on a mean-field method. Theoretical results and numerical simulations indicate that this network model has community structure and scale-free properties","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96764.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/337\/1\/195.pdf","pdfHashValue":"ac3c2e9f5d78199df0ae4f068afe8e8a64074695","publisher":null,"rawRecordXml":"<record><header><identifier>\n  \n    \n    \n      oai:generic.eprints.org:337<\/identifier><datestamp>\n      2015-05-29T18:20:23Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4143:4D3932<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/337\/<\/dc:relation><dc:title>\n        An evolving network model with community structure<\/dc:title><dc:creator>\n        Li, C.<\/dc:creator><dc:creator>\n        Maini, P. K.<\/dc:creator><dc:subject>\n        Biology and other natural sciences<\/dc:subject><dc:description>\n        Many social and biological networks consist of communities—groups of nodes within which connections are dense, but between which connections are sparser. Recently, there has been considerable interest in designing algorithms for detecting community structures in real-world complex networks. In this paper, we propose an evolving network model which exhibits community structure. The network model is based on the inner-community preferential attachment and inter-community preferential attachment mechanisms. The degree distributions of this network model are analysed based on a mean-field method. Theoretical results and numerical simulations indicate that this network model has community structure and scale-free properties.<\/dc:description><dc:date>\n        2005-11-11<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/337\/1\/195.pdf<\/dc:identifier><dc:identifier>\n          Li, C. and Maini, P. K.  (2005) An evolving network model with community structure.  Journal of Physics A: Mathematical and General, 38  (45).   pp. 9741-9749.      <\/dc:identifier><dc:relation>\n        10.1088\/0305-4470\/38\/45\/002<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/337\/","10.1088\/0305-4470\/38\/45\/002"],"year":2005,"topics":["Biology and other natural sciences"],"subject":["Article","PeerReviewed"],"fullText":"INSTITUTE OF PHYSICS PUBLISHING JOURNAL OF PHYSICS A: MATHEMATICAL AND GENERAL\nJ. Phys. A: Math. Gen. 38 (2005) 9741–9749 doi:10.1088\/0305-4470\/38\/45\/002\nAn evolving network model with community structure\nChunguang Li1,2 and Philip K Maini2\n1 Centre for Nonlinear and Complex Systems, School of Electronic Engineering,\nUniversity of Electronic Science and Technology of China, Chengdu 610054,\nPeople’s Republic of China\n2 Centre for Mathematical Biology, Mathematical Institute, University of Oxford,\nOxford OX1 3LB, UK\nE-mail: cgli@uestc.edu.cn\nReceived 22 July 2005, in final form 7 September 2005\nPublished 26 October 2005\nOnline at stacks.iop.org\/JPhysA\/38\/9741\nAbstract\nMany social and biological networks consist of communities—groups of nodes\nwithin which connections are dense, but between which connections are sparser.\nRecently, there has been considerable interest in designing algorithms for\ndetecting community structures in real-world complex networks. In this\npaper, we propose an evolving network model which exhibits community\nstructure. The network model is based on the inner-community preferential\nattachment and inter-community preferential attachment mechanisms. The\ndegree distributions of this network model are analysed based on a mean-\nfield method. Theoretical results and numerical simulations indicate that this\nnetwork model has community structure and scale-free properties.\nPACS numbers: 89.75.Hc, 02.50.−r\n(Some figures in this article are in colour only in the electronic version)\n1. Introduction\nComplex networks are currently being studied across many fields of science and engineering\n[1], stimulated by the fact that many systems in nature can be described by models of complex\nnetworks. A complex network is a large set of interconnected nodes, in which a node is a\nfundamental unit usually with specific dynamical or information content. Examples include the\nInternet, which is a complex network of routers and computers connected by various physical\nor wireless links; the World Wide Web, which is an enormous virtual network of web sites\nconnected by hyperlinks; and various communication networks, food webs, biological neural\nnetworks, electrical power grids, social and economic relations, coauthorship and citation\nnetworks of scientists, cellular and metabolic networks, etc. The ubiquity of various real and\n0305-4470\/05\/459741+09$30.00 © 2005 IOP Publishing Ltd Printed in the UK 9741\n9742 C Li and P K Maini\nartificial networks naturally motivates the current intensive study of complex networks, on\nboth theoretical and application levels.\nMany properties of complex networks have currently been reported in the literature.\nNotably, it is found that many complex networks show the small-world property [2], which\nimplies that a network has a high degree of clustering as in some regular network and a small\naverage distance between nodes as in a random network. Another significant recent discovery\nis the observation that many large-scale complex networks are scale free. This means that\nthe degree distributions of these complex networks follow a power-law form P(k) ∼ k−γ for\nlarge network size, where P(k) is the probability that a node in the network is connected to\nk other nodes and γ is a positive real number determined by the given network. Since power\nlaws are free of characteristic scale, such networks are called ‘scale-free networks’ [3]. The\nscale-free nature of many real-world networks can be generated by a mechanism of growing\nwith preferential attachment [3].\nCommunities are defined as collections of nodes within which connections are dense, but\nbetween which connections are sparser. There are many real-world networks which exhibit\ncommunity structure, and community structures are supposed to play an important role in\nmany real networks. For example, communities in a citation network might represent related\npapers on a single topic [4]; communities on the web might represent pages on related topics\n[5]; communities in a biochemical network or neuronal system might correspond to functional\nunits of some kinds [6, 7]; and communities also play an important role in information networks\n[8]. There have been several investigations into designing algorithms for detecting community\nstructure in large-scale complex networks [9, 10]. To study the effects of community structure\non network properties and dynamics, the modelling of real networks with community structure\nis very important. However, most of the existing evolving network models do not take the\ncommunity structure into account. In [11], a networked seceder model was proposed to\nillustrate group formation in social networks. In [12], a bipartite growing network model\nfor social community with group structures was proposed. In [13], a social network model\nbased on social distance attachment was proposed, which can exhibit community structure.\nIn [14], the authors proposed a growing network model with community structure. However,\nthere is the possibility within the network model that a node belongs to a community but\nhas no connections with nodes in this community but has connections with nodes in other\ncommunities, which is unacceptable.\nIn this paper, we propose an evolving network model with community structure based\non the inner-community preferential attachment and inter-community preferential attachment\nmechanics. We use a mean-field method to analyse the degree distributions of this network\nmodel. Numerical simulations are also performed to investigate the properties of this network\nmodel. Some more realistic generalizations and extensions are also discussed in section 4.\n2. Network model\nIn this section, we describe the growing mechanics of the proposed network model. For\nsimplicity, we consider only undirected network models in this paper. We assume that there\nis a total of M (M \u0001 2) communities in the network. The proposed model is defined by the\nfollowing scheme.\nStep 1: initialization\nStart from a small number m0 (m0 > 1) of fully connected nodes in each community. Use\nM(M−1)\n2 inter-community links to connect each community to the other M − 1 communities,\nAn evolving network model with community structure 9743\nInter-community link\nInner-community link\nFigure 1. An initial network example with M = 3 and m0 = 3.\nso that there is a link between each community. The nodes to which the inter-community links\nconnect are selected randomly in each community. For example, figure 1 shows an initial\nnetwork with M = 3 and m0 = 3.\nStep 2: growth\nAt each time step, a new node is added to a randomly selected community. The new node will\nbe connected to m (1 \u0002 m \u0002 m0) nodes in the same community through m inner-community\nlinks (defined as the links that connect nodes in the same community), and with probability\nα connected to n (1 \u0002 n \u0002 m) nodes (none with probability 1 − α) in the other M − 1\ncommunities through inter-community links (defined as the links that connect nodes among\ndifferent communities).\nStep 3: preferential attachments\n(a) Inner-community preferential attachment. When choosing nodes in the same community\n(we denote it as the j th community) to which the new node connects through inner-\ncommunity links, we assume that the probability \u0003 that a new node will be connected\nto node i in community j depends on the inner-degree sij (defined as the number of\ninner-links connected to node i) of that node, such that\n\u0003(sij ) = sij∑\nk skj\n. (1)\n(b) Inter-community preferential attachment. When choosing the nodes in other communities\nto which the new node connects through inter-community links, we assume that the\nprobability \u0003 that a new node will be connected to node i in community k (k \u0002= j)\ndepends on the inter-degree lik (defined as the number of inter-links connected to the\nnode), such that\n\u0003(lik) = lik∑\nm,n,n\u0002=j lm,n\n. (2)\nThe motivation for using the inner-community preferential attachment mechanics is the\nsame as that in many other growing network models. There also exist inter-community\npreferential attachment phenomena in some real networks with community structure. For\nexample, in scientific collaboration networks, a multidisciplinary researcher is more likely to\nbe willing to study other unknown fields to him\/her, and has stronger desire to collaborate\n9744 C Li and P K Maini\nFigure 2. A network generated by the proposed scheme: N = 90,M = 3,m0 = 3,m = 3,\nα = 0.1 and n = 1 (the nodes in each community are randomly placed).\nwith researchers in other fields than other single-topic researchers. In friendship networks, an\nindividual with many inter-community links is more likely to make friends with different kinds\nof people, and has higher probability of making new friends with people in other communities\nthan other people with less inter-community links. These are all inter-community preferential\nattachment phenomena.\nAfter t time steps, this scheme generates a network with Mm0 + t nodes, and\n[Mm0(m0 − 1) + M(M − 1)]\/2 + mt + integer(αnt) links in the sense of mathematical\nexpectation. The parameters α and n control the ratio between inter- and inner-community\nlinks.\nWe performed a numerical simulation with a total of N = 90 nodes, m0 = m = 3, n = 1\nand the probability α = 0.1, that is, at each time step, we connect a new node with three\nnodes in a selected community and with probability α = 0.1 connect it to a node in another\ncommunity. For the purposes of clarity, the generated network is shown in figure 2, in which\nthe nodes in each community are randomly placed. As we can see, the network generated by\nthe proposed scheme exhibits community structure. A detailed study of the properties of this\nnetwork model will be presented in the next section.\n3. Network properties\nIn this section, firstly we analytically calculate the degree distribution P(k), which is defined\nas the probability that a randomly selected node has degree k (a node has k connections), and\nthen we numerically study some properties of this network model.\nWe use a mean-field method [15] to analyse the scaling property of the network model.\nFirstly we analyse the inner-degree distribution, and then extend the results to that of the inter-\ndegree and the total degree (defined as the sum of the inner-degree and inter-degree). Similar\nto [15], we assume that sij is continuous, and thus the probability \u0003(sij ) = sij\n\/∑\nk skj can be\nAn evolving network model with community structure 9745\ninterpreted as a continuous rate of change of sij . Consequently, for a node i in community j ,\nwe have\n∂sij\n∂t\n= 1\nM\nm\nsij∑\nk skj\n(3)\nand, noting that\n∑\nk skj = 2mt 1M + m0(m0 − 1) ≈ 2mt 1M for large t in the sense of\nmathematical expectation, we have\n∂sij\n∂t\n≈ sij\n2t\n. (4)\nThe solution of this equation, with the initial condition that node i in community j was\nadded to the system at time ti with connectivity sij (ti) = m, is\nsij (t) ≈ m\n(\nt\nti\n)0.5\n. (5)\nUsing (5), the probability that a vertex has a connectivity sij (t) smaller than k can be written\nas\nP(sij (t) < k) = P\n(\nti >\nm2t\nk2\n)\n. (6)\nAssuming that we add the nodes (including the initial nodes) at equal time intervals to the\nnetwork, the probability density of ti is\nPi(ti) = 1\nMm0 + t\n. (7)\nBy substituting (7) into (6), we have\nP\n(\nti >\nm2t\nk2\n)\n= 1 − P\n(\nti \u0002\nm2t\nk2\n)\n= 1 − m\n2t\nk2(Mm0 + t)\n. (8)\nThe probability density for P(k) can be obtained using\nP(k) = ∂P (sij (t) < k)\n∂k\n= 2m\n2t\nMm0 + t\nk−3, (9)\npredicting that the inner-degree distribution obeys a power-law distribution P(k) ∼ k−γ with\nγ = 3 independent of M and m.\nSimilarly,\n∂lik\n∂t\n= M − 1\nM\nαn\nlik∑\nm,n,n\u0002=j lm,n\n(10)\nin which ∑\nm,n,n\u0002=j\nlm,n = 2M − 1\nM\nαnt + [M(M − 1) − (M − 1)] (11)\nin the sense of mathematical expectation. If α = 0, then no inter-community links are added in\nthe evolution of the network, and the total number of inter-community links is always M(M−1)2 .\nIf α \u0002= 0, then the solution of this equation, with the initial condition that node i in community\nk was added to the network at time tj with inter-community connectivity lik(tj ) = αn in the\nsense of mathematical expectation, is\nlik(t) = αn\n(\nt + β\ntj + β\n)0.5\n(12)\n9746 C Li and P K Maini\nwith β = [M(M−1)−(M−1)]M2αn(M−1) . If α is not so small, such that 2M−1M αnt \u0004 [M(M−1)−(M−1)]\nfor large t (usually, this is the case), then\n∂lik\n∂t\n≈ lik\n2t\n. (13)\nThe solution of this equation, with the initial condition that node i in community k was\nadded to the network at time tj with inter-community connectivity lik(tj ) = αn in the sense\nof mathematical expectation, is\nlik(t) ≈ αn\n(\nt\ntj\n)0.5\n. (14)\nSimilar to the above analysis of the inner-degree distribution, the inter-degree distribution\nP(k) can be written as\nP(k) = 2(αn)\n2t\nMm0 + t\nk−3, (15)\npredicting that the inter-degree distribution also obeys a power-law distribution P(k) ∼ k−γ\nwith γ = 3 independent of M,α and n.\nIn this case, the total degree of node i in community j is\nkij (t) = sij (t) + lij (t) ≈ (m + αn)\n(\nt\nti\n)0.5\n. (16)\nIt is easy to show that the total degree distribution is\nP(k) = 2(m + αn)\n2t\nMm0 + t\nk−3 (17)\nwhich indicates that the total degree also obeys a power-law distribution P(k) ∼ k−γ with\nγ = 3.\nBecause αn < m (usually αn \u0005 m), from (5) and (14) (or (12)) we know that the inter-\ndegrees of network nodes are smaller than the inner-degrees of network nodes in the sense of\nstatistics. So, networks generated by this model will have community structure.\nNext, we numerically study the properties of the network model. We consider a network\ngenerated by the proposed scheme with M = 3,m0 = 3,m = 3, α = 0.3, n = 1 and\nN = 3000. In figures 3–5, the slopes of the lines were obtained by cumulative distributions\nof 10 runs. The inner-degree distribution of this network is shown in figure 3. As we can\nsee, the inner-degree obeys a power-law distribution P(k) ∼ k−γ with γ ≈ 3 (the slope\nof the line is −3). The inter-degree distribution is shown in figure 4, and the inner-degree\nobeys a power-law distribution P(k) ∼ k−γ with γ ≈ 2.9 (the slope of the line is −2.9).\nThe total degree distribution is shown in figure 5, and we observe that the total degree also\nobeys a power-law distribution P(k) ∼ k−γ with γ ≈ 3. So, all these three distributions\nare of power-law type, indicating that the generated network is a scale-free network, and\nthese distributions verify the above analytical results. In figure 6 we plot the time evolution\nof the total degree of two nodes, in which one is an initial node and the other one is added\nto the network at t = 60. This is in good agreement with (16).\nWe also calculated the diameter D, the average path length l and the clustering coefficient\nC for this network. The detailed definitions of these parameters can be found in [1]. The\nvalues of these parameters are D = 7, l = 4.0274 and C = 0.0270, respectively. So the\nnetwork has small average path length and relatively large clustering coefficient (compared to\na random graph).\nAn evolving network model with community structure 9747\n100 101 102 103\n10−5\n10−4\n10−3\n10−2\n10−1\nk\nP(\nk)\nFigure 3. The inner-degree distribution of a network with N = 3000,M = 3,m0 = 3,m = 3,\nα = 0.3 and n = 1. As can be seen, the distribution is well approximated by a straight line with\ngradient −3.\n100 101 102\n10−4\n10−3\n10−2\n10−1\n100\nk\nP(\nk)\nFigure 4. The inter-degree distribution of a network with N = 3000,M = 3, m0 = 3, m = 3,\nα = 0.3 and n = 1. As can be seen, the distribution is well approximated by a straight line with\ngradient −2.9.\n100 101 102 103\n10−5\n10−4\n10−3\n10−2\n10−1\nk\nP(\nk)\nFigure 5. The total degree distribution of a network with N = 3000,M = 3,m0 = 3,m = 3,\nα = 0.3 and n = 1. As can be seen, the distribution is well approximated by a straight line with\ngradient −3.\n9748 C Li and P K Maini\n101 102 103 104\n100\n101\n102\n103\nt\nk i(\nt)\nFigure 6. The time evolution of the degree of two nodes, one is an initial node (the upper one) and\nthe other one was added to the network at t = 60 (lower one). As can be seen, the time evolution\nof the degrees is well approximated by a straight line with gradient 0.5.\n4. Conclusions and remarks\nIn this paper we proposed an evolving network model with community structure. We have\ntheoretically analysed the scaling properties of the network by using a mean-field approach.\nThe analytical and numerical results indicate that the network can produce community\nstructure, and the inner-degree, inter-degree and total degree all obey power-law distributions,\nso the network has scale-free properties. The network also has small average path length\nand relatively large clustering coefficient (compared to a random graph). Note that in [16]\nthe authors proposed a growing network model of two coupled networks—this idea is a little\nsimilar to that in the present paper, but the authors did not consider community structure.\nTo make our model more understandable and to avoid unnecessarily complicated\nnotations, we made some simplifications in our model. Some more realistic cases and\nextensions can be considered with minor modification of our model, for example:\n(1) We did not consider the formation of new communities during the evolution of the\nnetwork model. In some real-world networks, some new communities may appear during\nthe evolution. With minor modification, our model could allow from time to time the\nintroduction of new communities: if a node i is the first of a new community, one could\nonly set links between i and the old communities at the time step of its introduction, and\nfollow the same evolving rules in the proceeding time steps as defined in section 2. It is\neasy to show that, with this modification, the main results will not change.\n(2) In the preferential attachment mechanism, if a node i is not connected to a node j (in the\nsame community or different communities) at the beginning of its introduction, it will\nnever be. In considering the resulting networks, this is of no problem, but in considering\nthe evolution process, it is somewhat unrealistic. We can overcome this problem as\nfollows: in each time step, besides the steps mentioned in section 2, with probability\nβ, an existing node is selected, and we perform the same inner- and inter-community\nattachments of this node to all the other existing nodes that have no links with it. This\nwill surely not change the community structure of the network model.\nFuture extensions of this work include considering other kinds of inner- and inter-linking\nmechanisms other than preferential attachment, such as preferential linking [17] and distance\npreference [18]. Future extensions also include the modelling of directed and weighted network\nAn evolving network model with community structure 9749\nmodels with community structure [19] because many real-world networks with community\nstructures are directed and\/or weighted [20]. Based on this network model, we can study\nthe effects of community structure on network dynamics, such as stability, synchronization,\ndisease and rumour spreading and robustness. We can also introduce different types of\ndynamical node models in different communities to study the dynamical behaviour of some\nreal networks, for example, biochemical networks and brain networks.\nAcknowledgments\nThe authors are grateful to the anonymous reviewers for their valuable suggestions and\ncomments, which have led to the improvement of this paper. The authors would like to thank\nMrs Wei Huang and Yigong Xiao for help in calculating some of the statistical quantities.\nThis research was supported by the Key Programme projects of the National Natural Science\nFoundation of China under grant no. 60502009, and the Youth Science and Technology\nFoundation of UESTC under grant L08010201JX04011.\nReferences\n[1] Strogatz S H 2001 Nature 410 268\nAlbert R and Baraba´si A L 2002 Rev. Mod. Phys. 74 47\nDorogovtsev S N and Mendes J F F 2002 Adv. Phys. 51 1079\nNewman M E J 2003 SIAM Rev. 45 167\n[2] Watts D J and Strogatz S H 1998 Nature 393 440\nWatts D J 1999 Small-Worlds: The Dynamics of Networks Between Order and Randomness (Princeton, NJ:\nPrinceton University Press)\n[3] Baraba´si A L and Albert R 1999 Science 286 509\n[4] Redner S 1998 Eur. Phys. J. B 4 131\n[5] Flake G W, Lawrence S R, Giles C L and Coetzee F M 2002 IEEE Comput. 35 66\n[6] Holme P, Huss M and Jeong H 2003 Bioinformatics 19 532\n[7] Sporns O, Chialvo D R, Kaiser M and Hilgetag C C 2004 Trends Cogn. Sci. 8 418\n[8] Xie H, Yan K-K and Maslov S 2004 Preprint cond-mat\/0409087\n[9] For a recent review, see Newman M E J 2004 Eur. Phys. J. B 38 321\n[10] For some more recent papers see, for example, Massen C P and Doye J P K 2005 Phys. Rev. E 71 046101\nYoung M, Sager J, Csa´rdi G and Ha´ga P 2004 Preprint cond-mat\/0408263\nBagrow J P and Bollt E M 2004 Preprint cond-mat\/0412482\nLatapy M and Pons P 2004 Preprint cond-mat\/0412368\nClauset A, Newman M E J and Moore C 2004 Phys. Rev. E 70 066111 (Preprint cond-mat\/0408187)\nDuch J and Arenas A 2005 Preprint cond-mat\/0501368\nClauset A 2005 Preprint physics\/0503036\nCosta L da F 2004 Phys. Rev. E 70 056106 (Preprint cond-mat\/0312712)\n[11] Gro¨nlund A and Holme P 2004 Phys. Rev. E 70 036108\n[12] Noh J D, Jeong H-C, Ahn Y-Y and Jeong H 2004 Preprint cond-mat\/0412149\n[13] Boguna M, Pastor-Satorras R, Diaz-Guilera A and Arenas A 2004 Phys. Rev. E 70 056122\n[14] Kimura M, Saito K and Ueda N 2004 Neural Netw. 17 975\n[15] Baraba´si A-L, Albert R and Jeong H 1999 Physica A 272 173\n[16] Zheng D and Ergu¨n E 2001 Preprint cond-mat\/0112052\n[17] Dorogovtsev S N, Mendes J F F and Samukhin A N 2000 Phys. Rev. Lett. 85 4633\n[18] Jost J and Joy M P 2002 Phys. Rev. E 66 036126\n[19] Li C and Chen G Modelling of weighted evolving networks with community structures (submitted)\n[20] Li C and Chen G 2003 Preprint cond-mat\/0311333\nBarrat A, Barthe´le´my M, Pastor-Satorras R and Vespignai A 2004 Proc. Natl Acad. Sci. USA 101 3747\nZheng D, Trimper S, Zheng B and Hui P M 2003 Phys. Rev. E 67 040102\nBarrat A, Barthe´le´my M and Vespignai A 2004 Phys. Rev. Lett. 92 228701\nLi C and Chen G 2004 Physica A 343 288\nMorelli L G 2003 Phys. Rev. E 67 066107\n"}