{"doi":"10.1091\/mbc.E01-10-0094","coreId":"66037","oai":"oai:dro.dur.ac.uk.OAI2:3560","identifiers":["oai:dro.dur.ac.uk.OAI2:3560","10.1091\/mbc.E01-10-0094"],"title":"Purification and identification of secernin, a novel cytosolic protein that regulates exocytosis in mast cells.","authors":["Way,  G.","Morrice,  N.","Smythe,  C.","O'Sullivan,  A. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-09-01","abstract":"After permeabilization with the pore-forming toxin streptolysin-O mast cells can be triggered to secrete by addition of both calcium and a GTP analogue. If stimulation is delayed after permeabilization, there is a progressive decrease in the extent of secretion upon stimulation, eventually leading to a complete loss of the secretory response. This loss of secretory response can be retarded by the addition of cytosol from other secretory tissues, demonstrating that the response is dependent on a number of cytosolic proteins. We have used this as the basis of a bioassay to purify Secernin 1, a novel 50-kDa cytosolic protein that appears to be involved in the regulation of exocytosis from peritoneal mast cells. Secernin 1 increases both the extent of secretion and increases the sensitivity of mast cells to stimulation with calcium","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66037.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3560\/1\/3560.pdf","pdfHashValue":"b7e7afa0e00798edf6503e08ed7af28d79469f17","publisher":"American Society for Cell Biology","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3560<\/identifier><datestamp>\n      2011-08-26T13:24:42Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Purification and identification of secernin, a novel cytosolic protein that regulates exocytosis in mast cells.<\/dc:title><dc:creator>\n        Way,  G.<\/dc:creator><dc:creator>\n        Morrice,  N.<\/dc:creator><dc:creator>\n        Smythe,  C.<\/dc:creator><dc:creator>\n        O'Sullivan,  A. J.<\/dc:creator><dc:description>\n        After permeabilization with the pore-forming toxin streptolysin-O mast cells can be triggered to secrete by addition of both calcium and a GTP analogue. If stimulation is delayed after permeabilization, there is a progressive decrease in the extent of secretion upon stimulation, eventually leading to a complete loss of the secretory response. This loss of secretory response can be retarded by the addition of cytosol from other secretory tissues, demonstrating that the response is dependent on a number of cytosolic proteins. We have used this as the basis of a bioassay to purify Secernin 1, a novel 50-kDa cytosolic protein that appears to be involved in the regulation of exocytosis from peritoneal mast cells. Secernin 1 increases both the extent of secretion and increases the sensitivity of mast cells to stimulation with calcium. <\/dc:description><dc:subject>\n        Permeabilized cells<\/dc:subject><dc:subject>\n         Hematopoietic-cells<\/dc:subject><dc:subject>\n         Chromaffin cells<\/dc:subject><dc:subject>\n         Membrane-fusion<\/dc:subject><dc:subject>\n         Streptolysin-O<\/dc:subject><dc:subject>\n         Kinase-C<\/dc:subject><dc:subject>\n         Secretion<\/dc:subject><dc:subject>\n         RAC.<\/dc:subject><dc:publisher>\n        American Society for Cell Biology<\/dc:publisher><dc:source>\n        Molecular biology of the cell, 2002, Vol.13(9), pp.3344-3354 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2002-09-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3560<\/dc:identifier><dc:identifier>\n        issn:1059-1524<\/dc:identifier><dc:identifier>\n        doi:10.1091\/mbc.E01-10-0094<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3560\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1091\/mbc.E01-10-0094<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3560\/1\/3560.pdf<\/dc:identifier><dc:rights>\n        © 2002 by The American Society for Cell Biology<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1059-1524","1059-1524"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2002,"topics":["Permeabilized cells","Hematopoietic-cells","Chromaffin cells","Membrane-fusion","Streptolysin-O","Kinase-C","Secretion","RAC."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n01 October 2008\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWay, G. and Morrice, N. and Smythe, C. and O’Sullivan, A. J. (2002) ’Purification and identification of\nsecernin, a novel cytosolic protein that regulates exocytosis in mast cells.’, Molecular biology of the cell., 13\n(9). pp. 3344-3354.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1091\/mbc.E01-10-0094\nPublisher’s copyright statement:\n2002 by The American Society for Cell Biology\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n01 October 2008\nVersion of attached file:\nPublished\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWay, G. and Morrice, N. and Smythe, C. and O'Sullivan, A. J. (2002) 'Purification and identification of secernin,\na novel cytosolic protein that regulates exocytosis in mast cells.', Molecular biology of the cell., 13 (9), pp.\u00003344-3354.\nFurther information on publishers website:\nhttp:\/\/dx.doi.org\/10.1091\/mbc.E01-10-0094\nPublishers copyright statement:\n© 2002 by The American Society for Cell Biology\nMolecular Biology of the Cell\nVol. 13, 3344–3354, September 2002\nPurification and Identification of Secernin, a Novel\nCytosolic Protein that Regulates Exocytosis in\nMast Cells\nGemma Way,* Nicholas Morrice,† Carl Smythe,† and Antony J. O’Sullivan*‡\n*Department of Biological and Biomedical Sciences, University of Durham, Durham, DH1 3LE,\nUnited Kingdom; and †Division of Cell Signalling, School of Life Sciences, University of Dundee,\nDundee DD1 5EH, Scotland\nSubmitted October 16, 2001; Revised May 10, 2002; Accepted June 5, 2002\nMonitoring Editor: Vivek Malhotra\nAfter permeabilization with the pore-forming toxin streptolysin-O mast cells can be triggered to\nsecrete by addition of both calcium and a GTP analogue. If stimulation is delayed after perme-\nabilization, there is a progressive decrease in the extent of secretion upon stimulation, eventually\nleading to a complete loss of the secretory response. This loss of secretory response can be\nretarded by the addition of cytosol from other secretory tissues, demonstrating that the response\nis dependent on a number of cytosolic proteins. We have used this as the basis of a bioassay to\npurify Secernin 1, a novel 50-kDa cytosolic protein that appears to be involved in the regulation\nof exocytosis from peritoneal mast cells. Secernin 1 increases both the extent of secretion and\nincreases the sensitivity of mast cells to stimulation with calcium.\nINTRODUCTION\nMast cells are secretory cells found on the mucosal and\nserosal surfaces of tissues throughout the body where they\nare involved in the allergic response (Wedemeyer and Galli,\n2000). The cells can be activated by the cross-linking of\nhigh-affinity IgE receptors by antigen-specific IgE that leads\nto activation of phospholipase C, generating IP3 that subse-\nquently causes a release of calcium from cytosolic stores and\nthus triggers secretion (Kinet, 1999). The mast cells secrete a\nvariety of inflammatory mediators, including histamine,\nfrom granules that contain many lysosomal markers (Grif-\nfiths, 1996). The presence of lysosomal markers in the secre-\ntory granules of mast cells and other secretory cells of he-\nmopoietic lineage (such as basophils, cytotoxic T cells,\nnatural killer cells, neutrophils, eosinophils, and macro-\nphages) has led to the suggestion that these secretory gran-\nules are not derived from the classical secretory pathway,\nbut are derived from the lysosomal pathway (Stinchcombe\nand Griffiths, 2001).\nPermeabilization of secretory cells with detergents such as\ndigitonin, bacterial toxins such as Streptolysin-O (SLO) or by\nmechanical disruption allows exocytosis to be triggered by\nthe addition of buffered calcium solutions, bypassing the\nneed for activation of a triggering receptor and associated\nsignal transduction events (Gomperts and Tatham, 1992). In\nmast cells an absolute requirement for guanine nucleotides\nhas been reported, unlike neuroendocrine cells where gua-\nnine nucleotides appear to have a modulatory role (Lillie\nand Gomperts, 1992). This has led to the identification of a\nnumber of GTP binding proteins including Gi\u00013 (Aridor et\nal., 1993), \u0002\u0003 subunits (Pinxteren et al., 1998), rac (O’Sullivan\net al., 1996), rho (Price et al., 1995), and cdc42 (Brown et al.,\n1998), which all appear to regulate secretion in mast cells.\nAlthough the final fusion event is mediated by the SNAP\/\nNSF\/SNARE system in both mast cells (Guo et al., 1998;\nPaumet et al., 2000, Baram et al., 2001), neurons and neuroen-\ndocrine cells (Jahn and Su¨dhof, 1999), it is possible that the\norigin of these secretory granules accounts for the differ-\nences observed in the regulation of secretion in these cells\nwhen compared with the more commonly studied neuroen-\ndocrine systems.\nAfter permeabilization secretory cells leak cytosolic pro-\nteins, leading to a progressive loss of responsiveness to Ca2\u0001\nand nucleotides. This loss of response or rundown can be\nslowed by the provision of exogenous cytosol and has been\nused as the basis of a bioassay in mast cells (O’Sullivan et al.,\n1996), chromaffin cells (Morgan and Burgoyne, 1992), and\nPC12 and GH3 cells (Walent et al., 1992) to purify cytosolic\nproteins that regulate secretion from these cells. We have\npreviously shown that a rac\/RhoGDI complex isolated from\nbovine brain cytosol partially restores secretory responsive-\nness in Streptolysin-O–permeabilized mast cells (O’Sullivan\nArticle published online ahead of print. Mol. Biol. Cell 10.1091\/\nmbc.E01–10–0094. Article and publication date are at www.molbi-\nolcell.org\/cgi\/doi\/10.1091\/mbc.E01–10–0094.\n‡ Corresponding author. E-mail address: a.j.osullivan@durham.ac.uk.\nAbbreviations used: BSA, bovine serum albumin; GTP-\u0003-S,\nguanosine5\u0002-3-O-(thio) triphosphate; SLO, streptolysin-O.\n3344 © 2002 by The American Society for Cell Biology\net al., 1996). A number of other activities were partially\npurified during the purification of the rac\/rhoGDI complex.\nHere we report the full purification and identification of a\nsecond brain cytosolic protein, Secernin 1 (Secern is an ar-\nchaic English term for secrete), which is also capable of\nregulating exocytosis in permeabilized mast cells.\nMATERIALS AND METHODS\nFrozen bovine brains were purchased from First Link UK (Brierley\nHill, West Midlands, UK). Male Sprague Dawley rats were pur-\nchased from B&K Universal Ltd. (Hull, UK). GTP-\u0003-S and bovine\nserum albumin was purchased from Roche Diagnostics Ltd. (Lewes,\nEast Sussex, UK). Streptolysin-O (Murex formulation) was pur-\nchased from Corgenix Biotech Limited (Temple Hill, Dartford, Kent,\nUK). Ceramic hydroxyapatite column was purchased from Bio-Rad\n(Hemel Hempstead, UK), and all other chromatography columns\nwere purchased from Amersham-Pharmacia (Amersham, UK).\nDonkey anti-rabbit horseradish peroxidase (HRP) antibody was\npurchased from Amersham-Pharmacia. The GATEWAY cloning\nsystem and ThermalAce DNA polymerase kit was obtained from\nInvitrogen, Life Technologies (Paisley, UK). The human cDNA\nclone of the gene KIAA0193 was obtained from the Kazusa DNA\nResearch Institute (Kisararazu, Chiba, Japan) and inserted in the\npBluescript SK\u0001 vector. All other chemicals used were of the highest\nquality available from standard commercial sources.\nExperimental Procedures\nSecretion Measurements. Cells were obtained by peritoneal lavage\nof male Sprague Dawley rats (\u0003300 g), and mast cells were purified\nto \u000398% purity by centrifugation through Percoll as previously\ndescribed (Tatham and Gomperts, 1990). Cells, suspended in assay\nbuffer (137 mM NaCl, 2.7 mM KCl, 1 mM MgCl2, 20 mM piperazine-\nN,N\u0002-bis(2-ethanesulfonic acid), pH 6.8) supplemented with 1\nmg\/ml bovine serum albumin (BSA) were incubated with metabolic\ninhibitors (0.6 mM 2-deoxyglucose and 10 \u0004M antimycin A) for 5\nmin at 37°C and then cooled to ice temperature and added to SLO\n(1.6 IU\/ml) in the presence of 0.1 mM EGTA. After 5 min, cells were\nwashed free of unbound SLO and contaminating impurities (Larbi\nand Gomperts, 1996) by dilution and centrifugation at 4°C. Perme-\nabilization and hence rundown of the secretory response was initi-\nated by transferring the cells to prewarmed (37°C) assay buffer\ncontaining 1 mg\/ml BSA, 0.3 mM Ca\/EGTA buffer (10 nM Ca2\u0001),\n100 \u0004M Mg\u0001ATP, and proteins under test in 96-well microtiter\nplates. After allowing predetermined times for rundown (generally\nbetween 5 and 20 min), the cells were stimulated to secrete by\naddition of solutions containing Ca\/EGTA buffers formulated to\nregulate 10 \u0004M Ca2\u0001(or 100 nM Ca2\u0001 for controls) to a final con-\ncentration of 3 mM and GTP-\u0003-S to a final concentration of 100 \u0004M\n(or zero for controls) with sufficient Mg\u0001ATP to maintain the con-\ncentration at 100 \u0004M. After 20 min the reactions were quenched by\naddition of ice-cold buffer supplemented with EGTA (10 mM), and\nthe cells were sedimented by centrifugation. The supernatants were\nsampled for measurement of secreted hexosaminidase as previously\ndescribed (Tatham and Gomperts, 1990).\nCalcium\/EGTA buffers were prepared by mixing solutions of\nEGTA and end-point–titrated Ca\u0001EGTA made up at identical con-\ncentrations and adjusted to pH 6.8, according to a computer pro-\ngram, as previously described (Tatham and Gomperts, 1990).\nSecretion is expressed as the percent of total cellular hexosamini-\ndase released, calibrated by reference to appropriate reagent blanks\nand the total cell content released by 0.1% Triton X-100. Stimulated\nsecretion is calculated as the difference in the amount of hex-\nosaminidase released in response to 100 nM Ca2\u0001 or 10 \u0004M Ca2\u0001 \u0001\n100 \u0004M GTP\u0003S. All determinations were carried out in quadrupli-\ncate unless otherwise stated.\nPurification of Secernin 1. All chromatography was carried out on a\nBio-Rad Biologic liquid chromatography system at 4°C. Frozen bo-\nvine brains, 500 g, were thawed at 4°C before homogenization in a\nWaring blender in 1 liter homogenization buffer (137 mM NaCl, 2.3\nmM KCl, 1 mM MgCl2, 1 mM EGTA, 1 \u0004M Pepstatin, 1 \u0004M Leu-\npeptin, 0.1 mM PMSF, 0.02% NaN3, 20 mM Pipes, pH 6.8). The\nhomogenate was then centrifuged for 10 h at 10,000 \u0004 g at 4°C in a\nfixed angle rotor. This cytosol extract was subjected to ammonium\nsulfate precipitation and an active fraction between 60 and 90%\n(NH4)2SO4 was resuspended in 40 ml homogenization buffer. The\nactive material was subjected to chromatography on Octyl Sepha-\nrose FF as previously described (O’Sullivan et al., 1996), and the\nactive fractions were combined. All column fractions under test\nwere buffer exchanged into assay buffer using NAP-5 columns\nbefore assay.\nDEAE Chromatography. The active fractions from the Octyl Sepha-\nrose column were combined and desalted into buffer A (20 mM\ndiethanolamine, 0.02% NaN3, pH 8.7) in aliquots of 5 ml on a\nHiPrep 26\/10 desalting column (Pharmacia). The desalted material\nwas loaded, using on line dilution via the pump, at 20% protein\nwith 80% buffer A, onto a DEAE Sepharose column (XK26\/50, 100\nml, Pharmacia) that had been equilibrated with buffer A. The col-\numn was then washed with 36 ml 20 mM diethanolamine, pH 8.7,\nbefore elution with a linear gradient of 0–40% buffer B (1 M NaCl,\n20 mM diethanolamine, 0.02% NaN3, pH 8.7) over 372 ml followed\nby a final elution in 100% buffer B over 120 ml. The column was run\nat 5 ml\/min, and 8-ml fractions were collected. The fractions were\nassayed for activity, and the active fractions (45–52) on the third\npeak were combined.\nHydroxyapatite Chromatography. Active fractions (45–52) from the\nthird peak of the DEAE chromatography were concentrated to 5 ml\non a 50-ml Amicon pressure concentrator (43-mm YM10 membrane)\nand then desalted into buffer C (50 mM MES, 0.02% NaN3, pH 6.0)\non a HiPrep 26\/10 desalting column. This was then loaded onto a\nceramic hydroxyapatite column (Econo-Pac CHT-II, 1 ml, Bio-Rad)\npreequilibrated with buffer C. The column was then washed with 2\nml buffer C before elution with a linear gradient of 0–100% buffer D\n(500 mM NaCl, 50 mM MES, 0.02% NaN3, pH 6.0) over 16 ml. The\ncolumn was then washed with an additional 2 ml buffer D, before\nelution with a 0–100% linear gradient of buffer E (500 mM KH2PO4,\n50 mM MES, 0.02% NaN3, pH 6.0) over 16 ml and finally washed\nwith an additional 4 ml of buffer E. The column was run at 1\nml\/min, and 1-ml fractions were collected. The fractions were as-\nsayed for activity, and the active fractions (35–38) in the second peak\nwere combined.\nPhenyl Superose Chromatography.The combined fractions from\npeak 2 of the hydroxyapatite column were diluted with 3.4 M\n(NH4)2SO4, buffered with 50 mM NaH2PO4, 0.02% NaN3, pH 7.5, to\nproduce a final concentration of 2 M (NH4)2SO4. The protein was\nthen applied to a Phenyl Superose column (Pharmacia, HR5\/5, 1\nml) equilibrated in buffer F ((NH4)2SO4, 50 mM NaH2PO4, 0.02%\nNaN3, pH 7.5) and the column washed with 5 ml 100% buffer F\nbefore eluting with a 30–80% gradient of buffer G (50 mM\nNaH2PO4, 0.02% NaN3, pH 7.5) over 30 ml, followed by a final 5 ml\nof 100% buffer G. The column was run at 0.4 ml\/min, and 1-ml\nfractions were collected.\nSuperose 12 Chromatography. Active fractions from the Phenyl\nSuperose (21–23) were concentrated to 240 \u0004l on a 10K Microsep\ncentrifugal concentrator (Filtron, Northborough, MA) at 4°C and\ninjected onto a Superose 12 column (Pharmacia, HR10\/30, 24 ml)\nequilibrated in homogenization buffer. The column was run at\n0.2\/ml min, and 0.5-ml fractions were collected. The active fractions\nwere combined and concentrated before use in secretion experi-\nments.\nLeakage of Secernin. Purified mast cells were treated with diiso-\npropyl fluorophosphate (2 mM) for 10 min at 4°C. The cells were\nRegulation of Mast Cell Secretion\nVol. 13, September 2002 3345\ntreated with SLO at ice temperature as described above, resus-\npended at \u00051 \u0004 106cells\/ml, and then permeabilized by bringing\nthe temperature to 37°C. Samples of cells, 100 \u0004l, were removed\nat intervals and sedimented by centrifugation at 14,000 \u0004 g, and\nthe supernatants were harvested. Ice-cold acetone was added to\nthe supernatants to a final concentration of 80%, and the mixture\nwas maintained at \u000620°C for 2 h after which the aggregated\nproteins were sedimented by centrifugation at 14,000 \u0004 g. These\nwere taken up in Laemmli sample buffer and separated on 12%\nSDS-polyacrylamide gels. Proteins were transferred to nitrocel-\nlulose using a wet blot method and probed for Secernin using the\npolyclonal anti-Secernin antibodies, SK1147 and SK1148, at a\ndilution of 1:4000. Antibody binding was detected using a don-\nkey anti-rabbit HRP-linked secondary antibody at 1:2000 dilution\nand an ECL detection kit.\nPlasmid Construction. Oligonucleotide primers for the amplifica-\ntion of the KIAA0193 gene were designed with attB1 or attB2 sites\nfor the insertion into the GATEWAY donor vector pDONR201 (Life\nTechnologies) by homologous recombination. Primers with the fol-\nlowing sequences were synthesized by MWG, Inc.: KIAA0193 (for-\nward), 5\u0002- GGGGACAAGTTTGTACAAAAAAGCAGGCTTCG A A\nGGAGATAGAACCATGATAAGCAGACCCGCCTGGCTCT-3\u0002; KIAA\n0193 (reverse), 5\u0002-GGGGACCACTTTGTACAAGAAAGCTGGGTC-\nCTATCACTTAAAGAACTTAATCTCCGTG-3\u0002. The primers were\nused to generate the attB PCR product using a ThermalAce DNA\npolymerase kit (Invitrogen) from the pBluescript SK\u0001 vector con-\ntaining KIAA0193. The PCR products were cloned into pDONR201,\nand the resulting plasmid pENTR KIAA0193 were used to transfer\nthe gene sequences into pDEST15 (N terminal GST fusion) or pD-\nEST17 (N terminal His fusion) via homologous recombination. The\ncorresponding plasmids, pEXP15 KIAA0193 and pEXP17\nKIAA0193, were used for overexpression of the fusion proteins in\nEscherichia coli BL21-SI.\nRecombinant Protein Purification. Cells carrying either pEXP15\nKIAA0193 or pEXP17 KIAA0193 were grown overnight in LB broth\nwithout NaCl in the presence of 100 \u0004g\/ml ampicillin at 30°C. The\ncells were then diluted 1 in 10 in prewarmed LB broth without\nNaCl, in the presence of 100 \u0004g\/ml ampicillin at 30°C, and grown\nto an optical density of 0.6 at 600 nm. Protein expression was\ninduced by the addition of NaCl to 0.3 M, and the cells were grown\nfor a further 3 h. Cells were harvested by centrifugation, and inclu-\nsion bodies were purified by the method of Marston et al. (1984).\nAffinity Purification of Antibody SK1147. Inclusion bodies of the\nrecombinant GST-tagged KIAA 0193 (human Secernin 1) were sol-\nubilized in SDS-sample buffer and separated on 10% SDS-PAGE.\nAfter blotting onto nitrocellulose paper the recombinant protein\nwas visualized with Ponceau S staining, and the bands were ex-\ncised. The antibody SK1148 was affinity purified against this protein\nby the method of Smith and Fisher (1984). The antibody was dia-\nlyzed overnight against homogenization buffer before use in neu-\ntralization experiments.\nImmunoneutralization of Secernin. Polyclonal anti-Secernin anti-\nbody SK1147 or preimmune serum was diluted 1:50 into assay\nbuffer and added an equal volume of either purified 60 \u0004g\/ml\nSecernin or 6 mg\/ml freshly prepared rat brain cytosol in assay\nbuffer. The antibody and proteins were incubated at 4°C for 30 min\nbefore addition to permeabilized mast cells at a final concentration\nFigure 1. Purification of secernin. (A) DEAE chromatography. Ac-\ntive fractions from Octyl Sepharose were desalted and loaded onto\na DEAE Sepharose column, the activity was eluted with a rising\ngradient of NaCl. (B) Hydroxyapatite chromatography. Pooled frac-\ntions from peak 3 on the DEAE column were desalted and applied\nto a ceramic hydroxyapatite column. The activity was initially\neluted with a rising gradient of NaCl followed by a second gradient\nof KH2PO4. (C) Phenyl Superose chromatography. Pooled fractions\nfrom peak 2 on the hydroxyapatite column were adjusted to 2 M\n(NH4)2SO4 and applied to a Phenyl Superose column. The activity\nwas eluted with a falling gradient of (NH4)2SO4. All column activ-\nities were assayed for protein concentration and stimulated secre-\ntion as described in the MATERIALS AND METHODS. Data shown\nare mean\u0007 SEM (n\b 4); similar results were obtained on at least 10\noccasions. Some error bars are smaller than symbols used.\nTable 1. Purification of secernin 1\nStep\nTotal\nprotein\n(mg)\nSpecific activity\n(% Stimulation\/\nmg protein)a\nFold\nenrichment\nAmmonium sulphate pellet 1550 ND —\nOctyl Sepharose pool 228 0.097 1\nDEAE peak 3 pool 1.45 5.10 52.6\nHydroxyapatite peak 2 pool 0.307 19.87 205\nPhenyl Superose pool 0.034 208.82 2,153\nSuperose 12 pool 0.0044 1454.5 14,995\na Specific activity of each of the pooled peaks is calculated as aver-\nage increase in stimulated release per mg protein for a typical\npurification.\nG. Way et al.\nMolecular Biology of the Cell3346\nof 10 \u0004g\/ml Secernin and 1 mg\/ml cytosol as described above.\nVarying concentrations of affinity-purified SK1147 was incubated\nwith 3 mg\/ml cytosol in the presence or absence of 5 mg\/ml\ninclusion body containing recombinant human Secernin 1-His fu-\nsion protein. After incubation for 60 min at 4°C, the cytosol was\ncentrifuged at 14,000 \u0004 g to remove the inclusion body before\naddition to permeabilized mast cells at a final concentration of 1\nmg\/ml cytosol and antibody as indicated.\nProtein Assay. Protein concentration was assayed by the method of\nBradford (1976) using BSA as a standard.\nProtein Analysis. Purity of protein samples was assessed by elec-\ntrophoretic separation on 12% SDS-polyacrylamide gels (Laemmli,\n1970) and detection by silver staining (Morrissey, 1981).\nProduction of Antisera. Two polyclonal rabbit antisera (SK1147 and\nSK1148) were raised against purified Secernin 1 by Abcam Ltd.\n(Cambridge, UK), using a 30-\u0004g initial injection followed by three\nbooster injections of 30 \u0004g.\nMass Spectrometric Analysis. p50 was alkylated with iodoacet-\namide in sample buffer (Novex, Encinitas, CA) and run on a 4–12%\nSDS-PAGE gel with a MOPS running buffer system (Novex). The gel\nwas stained with Sypro Orange (Molecular Probes, Eugene, OR),\nand the p50 band was excised and digested with 12.5 \u0004g\/ml mod-\nified trypsin (Roche) in 20 mM NH4CO3. A proportion of the sample\nwas analyzed by MALDI-TOF MS, and the tryptic peptide ions were\nsearched against NCBI and Swiss Prot databases using the MS-FIT\nsearch algorithm from Protein Prospector (UCSF, San Francisco,\nCA).\nThe remainder of the sample was chromatographed on a 150 \u0004\n0.075-mm Pepmap C18 capillary column coupled to an LC Packings\nUltima HPLC system (Dionex, Camberley, UK). The column was\nequilibrated with 2% acetonitrile\/0.1% formic acid in water at 0.2\n\u0004l\/min, and developed with a gradient of acetonitrile\/0.1% formic\nacid. The outlet of the column was connected to a Micromass\nQ-TOF2 mass spectrometer, equipped with a nanoflow source, and\npeptide ions were automatically submitted for ms\/ms fragmenta-\ntion. Spectra from ms\/ms experiments were interpreted, and the\nsequences were searched against NCBI nr and dbEST databases\nusing the BLAST search algorithm. Spectral data was also searched\nagainst the same databases using the Sonar ms\/ms search algorithm\n(http:\/\/service.proteometrics.com\/prowl\/sonar.html).\nRESULTS\nBovine brain cytosol was prepared and fractionated by am-\nmonium sulfate precipitation followed by Octyl Sepharose\nchromatography as previously described (O’Sullivan et al.,\n1996). The purification of Secernin 1 described in MATERI-\nALS AND METHODS is summarized in Table 1. Activity\nfrom cytosol prepared from frozen bovine brains is only\ndetectable after the Octyl Sepharose column, unlike cytosol\nfrom freshly isolated rat brains (O’Sullivan et al., 1996). The\npurification is therefore calculated from the pooled activity\nfrom this column. Figure 1A shows that the activity eluted\nFigure 2. Superose 12 chromatography. (A) Active\nfractions from the Phenyl Superose column were\nconcentrated and loaded onto a superose 12 gel fil-\ntration column and assayed for protein concentra-\ntion and stimulated secretion as described in the\nMATERIALS AND METHODS. Data shown are\nmean \u0007 SEM (n \b 4); similar results were obtained\non at least 10 occasions. Some error bars are smaller\nthan symbols used. (B) Active fractions were ana-\nlyzed by silver-stained 12% SDS-PAGE.\nRegulation of Mast Cell Secretion\nVol. 13, September 2002 3347\nfrom the Octyl Sepharose can be separated by a DEAE\nSepharose column into three distinct peaks of activity by a\ngradient of NaCl. Peak 1 was found to contain the previ-\nously purified rac and rhoGDI, as assessed by Western\nblotting, so further purification of this peak was not under-\ntaken. Peak 3 appeared to have the highest activity and was\ntherefore subjected to further purification.\nThe combined fractions of peak 3 from the DEAE column\nwere applied to a hydroxyapatite column and eluted with a\nrising gradient of NaCl, followed by a rising gradient of\nKH2PO4 as shown in Figure 1B. A small peak of activity\nelutes with NaCl and a larger second activity elutes with\nKH2PO4. This second activity peak was pooled, applied to a\nPhenyl Superose column and eluted by a decreasing gradi-\nFigure 3. Identification of p50\nby MALDI-TOF and Q-TOF mass\nspectrometry. A tryptic digest of\np50 excised from a SDS-PAGE gel\nwas subjected either to finger-\nprint analysis by MALDI-TOF\nmass spectrometry or reverse-\nphase HPLC and online Q-TOF\nms\/ms fragmentation. (A)\nMALDI-TOF mass spectrum an-\nnotated with the sequence and\nmolecular mass (m\/z) of identi-\nfied peptides (highlighted in\ngray). Peptides whose sequence\nwas deduced by Q-TOF fragmen-\ntation analysis are boxed. (B) The\npredicted polypeptide sequence\nencoded by mouse cDNA\nAK012765. Peptide sequences\nidentified by MALDI fingerprint\nanalysis above are highlighted in\ngray. Peptides whose sequence\nwas deduced by MS\/MS frag-\nmentation (in bold font) are\naligned. \u0001 indicates a match, \u0001\nindicates a conserved substitu-\ntion, and (.) indicates a mismatch\nbetween the sequences. The out-\nlined area (\u0002) represents the pre-\ndicted coiled-coil region.\nG. Way et al.\nMolecular Biology of the Cell3348\nent of (NH4)2SO4 as shown in Figure 1C. Fractions from the\ncolumn were then subjected to SDS-PAGE analysis, a single\nprotein of 50 kDa appears to correlate with the activity from\nthe phenyl superose column. To confirm the correlation, the\npooled fractions from the Phenyl Superose column were\nconcentrated and applied to a Superose 12 gel filtration\ncolumn. The fractions were assayed for their ability to retard\nthe rundown of exocytosis in mast cells and subjected to\nSDS-PAGE, and again a single 50-kDa protein was found to\ncorrelate with the activity, as shown in Figure 2.\nTo identify the 50-kDa protein, the purified material was\nsubjected to SDS-PAGE and in-gel trypsinization. The pep-\ntide mixture was recovered and subjected to MALDI-TOF\nmass spectrometry, and the resultant mass fingerprint used\nto interrogate sequence databases. This analysis identified\np50 as a protein corresponding to a previously cloned\nmouse cDNA (GenBank accession no. AK012765) of un-\nFigure 4. Secernin 1 dose response. Mast cells permeabilized with\nSLO in the presence of varying concentrations of Secernin 1. After 15\nmin the cells were stimulated by addition of solutions containing\nEGTA buffered to 10 \u0004M Ca2\u0001 plus GTP\u0003S (final concentration, 100\n\u0004M) or 100 nM Ca2\u0001. After a further 20-min incubation, the cells\nwere sedimented by centrifugation, and the supernatants were sam-\npled for analysis of secreted hexosaminidase. Stimulated secretion is\ncalculated as the difference in the amount of hexosaminidase re-\nleased in response to either 100 nM Ca2\u0001 or 10 \u0004M Ca2\u0001 \u0001 100 \u0004M\nGTP\u0003S. Data shown are mean \u0007 SEM (n \b 4); similar results were\nobtained on four occasions. Some error bars are smaller than sym-\nbols used.\nFigure 5. Effect of Secernin on rundown of secretory response.\nMast cells permeabilized with SLO in the presence (F) and absence\n(E) of Secernin 1 at a final concentration of 3.5 \u0004g\/ml. At times\nindicated, samples were removed and stimulated by transfer to\nsolutions containing EGTA buffered to 10 \u0004M Ca2\u0001 plus GTP\u0003S\n(final concentration, 100 \u0004M) or 100 nM Ca2\u0001. After a further 20-min\nincubation, the cells were sedimented by centrifugation, and the\nsupernatants were sampled for analysis of secreted hexosaminidase.\nStimulated secretion is the difference in the amount of hexosamini-\ndase released in response to either 100 nM Ca2\u0001 or 10 \u0004M Ca2\u0001 \u0001\n100 \u0004M GTP\u0003S. Data shown are mean\u0007 SEM (n\b 4); similar results\nwere obtained on four occasions. Some error bars are smaller than\nsymbols used.\nFigure 6. Presence of Secernin in mast cell cytosol. (A) Western\nblot of intact mast cells. After transfer to nitrocellulose membranes,\nthe proteins were detected by probing with the rabbit polyclonal\nantibody SK1147 and a donkey anti-rabbit HRP secondary antibody\nvisualized by ECL. (B) The permeabilized mast cells were sampled\nat the times indicated and rapidly sedimented. Proteins present in\nthe supernatants were precipitated and Western blotted. Proteins\nwere detected with antibody SK1147.\nRegulation of Mast Cell Secretion\nVol. 13, September 2002 3349\nknown function (Figure 3). To confirm the identity of p50,\nthe balance of the peptide mixture was chromatographed\nby reverse-phase HPLC, and individual peptides were\ndelivered to an online Q-TOF mass spectrometer for\nms\/ms fragmentation and consequent peptide sequence\nidentification. A total of seven peptides were sequenced\n(Figure 3B, bold). Of these, three corresponded to pep-\ntides previously identified by mass fingerprint, and each\nshowed sequence identity with the putative protein en-\ncoded by AK012765. One peptide, not identified in the\ninitial mass fingerprint also was identical to the mouse\nsequence, whereas three additional peptides were closely\nrelated, showing \u000375% homology with it. We conclude\nthat p50 is a novel protein, which we have named Secer-\nnin 1, which is encoded by the bovine orthologue of\nmouse AK012765.\nFigure 4 shows the effect of increasing concentrations of\npurified Secernin 1 on the secretion of hexosaminidase from\npermeabilized mast cells. The optimal concentration of Se-\ncernin 1 is 7.1\u0007 0.9 \u0004g\/ml with an EC50 of 2.21\u0007 0.2 \u0004g\/ml\n(mean\u0007 SEM, n\b 4), which is comparable to other proteins\npreviously demonstrated to regulate secretion in these cells\n(O’Sullivan et al., 1996; Pinxteren et al., 2001). This effect on\nsecretion is unlikely to be due to nonspecific protein effects\nbecause neither boiled Secernin 1 at 10 \u0004g\/ml nor BSA up to\n1 mg\/ml had any effect on secretion from these cells\n(O’Sullivan, unpublished observations). Figure 5 shows the\neffect of the protein at various times of rundown, the protein\ninitially has no effect, but as the cytosol leaks from the cells,\nthere is an increasing effect, which in turn declines as other\nproteins leak from the cell. However, Secernin 1 is incapable\nof completely preventing rundown.\nTo determine that the protein is present in mast cells, a\nrabbit polyclonal antibody SK1147 was generated against\nthe purified protein. Figure 6A shows a Western blot of whole\nmast cells demonstrating a single immunoreactive band at 50\nkDa; a similar result was obtained with a second polyclonal\nantibody SK1148. The results shown in Figure 5 are consistent\nwith a model in which Secernin 1 leaks slowly from the per-\nFigure 7. Inhibition of Secernin in cytosol by anti-Secernin anti-\nbody. (A) Mast cells permeabilized with SLO in the presence of 10\n\u0004g\/ml purified Secernin 1 or 1 mg\/ml rat brain cytosol, which had\nbeen immunoneutralized with SK1147 antisera, preimmune serum,\nor sham neutralized with buffer. After 15 min the cells were stim-\nulated by addition of solutions containing EGTA buffered to 10 \u0004M\nCa2\u0001plus GTP\u0003S (final concentration, 100 \u0004M) or 100 nM Ca2\u0001After\na further 20 min incubation, the cells were sedimented by centrifu-\ngation, and the supernatants were sampled for analysis of secreted\nhexosaminidase. Stimulated secretion is the difference in the\namount of hexosaminidase released in response to either 100 nM\nCa2\u0001 or 10 \u0004M Ca2\u0001 \u0001 100 \u0004M GTP\u0003S. Data shown are mean \u0007\nSEM (n \b 4); similar results were obtained on four occasions. (B)\nMast cells permeabilized with SLO in the presence or absence of 1\nmg\/ml rat brain cytosol that had been immunoneutralized varying\nconcentrations of affinity-purified SK1147 antisera, in the presence\nand absence of inclusion bodies containing recombinant human\nSescernin 1. After 15 min the cells were stimulated by addition of\nsolutions containing EGTA buffered to 10 \u0004M Ca2\u0001plus GTP\u0003S\n(final concentration, 100 \u0004M) or 100 nM Ca2\u0001. After a further 20-min\nincubation, the cells were sedimented by centrifugation, and the\nsupernatants were sampled for analysis of secreted hexosaminidase.\nStimulated secretion is the difference in the amount of hexosamini-\ndase released in response to either 100 nM Ca2\u0001 or 10 \u0004M Ca2\u0001 \u0001\n100 \u0004M GTP\u0003S. Data shown are mean\u0007 SEM (n\b 4); similar results\nwere obtained on four occasions.\nFigure 8. Effect of Secernin on the time course of secretion. Mast\ncells permeabilized with SLO in the presence (f) or absence (\u0002) of\n3 \u0004g\/ml purified Secernin 1. After 15 min the cells were stimulated\nby addition of solutions containing EGTA buffered to 10 \u0004M\nCa2\u0001plus GTP\u0003S (final concentration, 100 \u0004M). After a further 20-\nmin incubation, the cells were sedimented by centrifugation, and\nthe supernatants were sampled for analysis of secreted hexosamini-\ndase. Data shown are mean \u0007 SEM (n \b 3); similar results were\nobtained on four occasions. Some error bars are smaller than sym-\nbols used. The inset figure shows the same data normalized to 100%\nresponse for each of the conditions after 25 min secretion.\nG. Way et al.\nMolecular Biology of the Cell3350\nmeabilized cell and the exogenously added Secernin 1 replaces\nthe lost protein. To test this hypothesis, supernatants were\ncollected from cells permeabilized over increasing periods. The\nsupernatants were precipitated by acetone at\u000620°C, separated\nby SDS-PAGE, and analyzed by Western blot. Figure 6B shows\nthat the antibody detects an increasing amount of the 50-kDa\nprotein in the supernatants with time after permeabilization,\nconfirming that the protein is cytosolic and leaks from the cell\nafter permeabilization with a similar time course to the run-\ndown of the secretory response.\nTo confirm that that the effects of Secernin 1 were due to\nthe 50-kDa protein the anti-Secernin antibody, SK1147 was\nused to immunoneutralize the purified protein. Figure 7A\nshows that the antibody blocks the effect of the optimal dose\nof Secernin 1, whereas same concentration of the preimmune\nsera has no significant effect. This concentration of antibody\nis also inhibits the effect of freshly prepared rat brain cytosol\nby 50%, indicating that Secernin is responsible for a signif-\nicant amount of the activity found in whole cytosol. To\nconfirm that this effect was due to the interaction of SK1147\nwith Secernin, the antibody was affinity purified against\nrecombinant human Secernin 1. Figure 7B demonstrates that\nthe affinity-purified antibody inhibits fresh rat brain cytosol\nand that this inhibition can be blocked by inactive recombi-\nnant human Secernin 1 in an inclusion body.\nTwo possible mechanisms for Secernin 1 to increase the\nextent of secretion would be to increase either the rate of\nsecretion or to allow secretion to occur over a much longer\nperiod. Figure 8 clearly demonstrates that the addition of Se-\ncernin 1 to the cells during rundown, before stimulation, in-\ncreases the rate of secretion from the permeabilized mast cells.\nIf the data are normalized to the response at 25 min, as shown\nin the inset to Figure 8, it becomes clear that although the rate\nof secretion is increased by Secernin 1, the time course of the\nsecretory response is unaffected by the presence of Secernin 1.\nWe have previously shown that the sensitivity of the mast\ncells to both Ca2\u0001 and GTP\u0003S declines as a consequence of the\nrundown of the secretory response (Brown et al., 1998). There-\nfore, we investigated the possibility that Secernin 1 not only\nincreased the rate and extent of secretion, but also had an effect\non the sensitivity of the mast cells to stimulation with both\nCa2\u0001 and GTP\u0003S. Figure 9A shows the effect of Secernin on the\nGTP\u0003S sensitivity of cells in the presence of 0.1 and 10 \u0004M\nCa2\u0001. Under these rundown conditions, all concentrations of\nGTP\u0003S in the presence of 0.1 \u0004M Ca2\u0001 are incapable of induc-\ning secretion, whether Secernin 1 is present or not. In the\npresence of 10 \u0004M Ca2\u0001 Secernin 1 increases the extent of\nsecretion by the same amount, independent of the concentra-\ntion of GTP\u0003S. Figure 9B clearly demonstrates that Secernin 1\npartially restores the Ca2\u0001 sensitivity of the rundown mast\ncells, with some Ca2\u0001-dependent secretion even occurring in\nthe absence of GTP\u0003S.\nDISCUSSION\nWe have purified a novel cytosolic protein, termed Secernin\n1, which regulates exocytosis in permeabilized rat peritoneal\nmast cells. Database analysis reveals that fragments of Se-\ncernin 1 identified by mass spectrometry show 93.5% iden-\ntity and 95.7% homology with the predicted product of\nmouse cDNA AK012765, which has a predicted MW of\n46296, which is consistent with our estimated molecular\nweight of 50 kDa from SDS-PAGE. Database searching in-\ndicates that Secernin 1 is encoded by one of a small family of\nrelated genes (Figure 10). The human genome contains three\nSecernin genes (termed Secernins 1 through 3), which are\nlocalized on chromosomes 7 (7p14.3-p14.1), 17 (17q21.3), and\n2 (2p14-q14.3), respectively. Analysis of cDNAs correspond-\ning to human Secernin 2 indicates the existence of at least\ntwo splice variants (2a and 2b), one of which generates a\nprotein containing a truncated C terminus. Comparison of\nhuman and mouse Secernin 1 cDNAs suggests that the\nformer has a truncated N-terminus lacking\u000560 amino acids.\nHowever, it is also possible that this is a splice variant of a\nlarger protein, because inspection of the 5\u0002 noncoding region\nof the existing cDNA as well as the genomic DNA sequence\nindicates the presence of a putative exon, which is highly\nFigure 9. (A and B) Effect of Secernin on the sensitivity of mast cell\nsecretion to Ca2\u0001 and GTP\u0003S. Mast cells permeabilized with SLO in\nthe presence (filled symbols) or absence (open symbols) of 3 \u0004g\/ml\nSecernin 1. After 15 min the cells were stimulated by addition of\nsolutions containing the following: (A) EGTA buffered to either 0.1\n\u0004M (F, E) or 10 \u0004M Ca2\u0001(\u0004, ƒ) plus varying concentrations of\nGTP\u0003S or (B) EGTA buffered to varying concentrations of Ca2\u0001 plus\na final concentration of either 0 (Œ, ‚) or 100 \u0004M GTP\u0003S (f, \u0002).\nAfter a further 20-min incubation, the cells were sedimented by\ncentrifugation, and the supernatants were sampled for analysis of\nsecreted hexosaminidase. Data shown are mean \u0007 SEM (n \b 4);\nsimilar results were obtained on four occasions. Some error bars are\nsmaller than symbols used.\nRegulation of Mast Cell Secretion\nVol. 13, September 2002 3351\nhomologous to the relevant 5\u0002 coding sequence of mouse\nSecernin 1. We have also identified two partial cDNA se-\nquences in the TIGR bovine gene index database. These\ncorrespond to a bovine homologue of human Secernin 2a\n(Figure 10). The mouse genes are ubiquitously expressed\n(Kawai et al., 2001), which would imply some common role\nin many cell types rather than a protein specifically involved\nin mast cell exocytosis.\nFigure 10. Identification of Secernin family members in\nmammalian species. The protein sequence for mouse Se-\ncernin 1 was used to interrogate the NCBI Human Ge-\nnome and nonredundant databases using the BLAST\nsearch program. Sequences were aligned using the PIMA\nsequence alignment program and formatted using BOX-\nSHADE. Amino acid identities are shown as black boxes.\nConservative changes are shown as shaded boxes. The\nGenBank accession numbers for Secernins are as follows:\nhsSES1, AAD15417; hsSes2a, XP_054038.1; hsSes2b,\nXP_032208.1; hsSes3, XP_035198.1; mmSes1, AK012765;\nmmSes3, AK014701; BtSes2a, TC 80787, Tc80786.\nG. Way et al.\nMolecular Biology of the Cell3352\nThe full-length sequence for Secernin 1 shows no signifi-\ncant degree of homology with any protein known to be\ninvolved in exocytosis, membrane fusion events, or intracel-\nlular signaling. The protein contains no known domain\nstructures apart from a small 21 amino acid region between\n358 and 378, which is predicted to form a coiled-coil domain\nby the COILS program (Lupas et al., 1991). It is therefore\npossible that the actions of the protein may be mediated by\na direct interaction with another protein.\nTwo rabbit polyclonal antibodies raised against purified\nbovine Secernin 1 recognize a single immunoreactive\nband at 50 kDa in mast cells, confirming the presence of\nSecernin 1 in mast cells. After permeabilization this pro-\ntein leaks from the mast cells and can be precipitated from\nthe supernatant, confirming that the protein is cytosolic.\nSecernin 1 leaks from the cell at a rate similar to the\ndecrease in secretory response of the mast cells during\nrundown, implying that the leakage of Secernin 1 is a\nmajor cause of the loss of secretory response. Addition of\nSecernin 1 to permeabilized cells followed by stimulation\nwithin the first 5 min has no effect on secretion, demon-\nstrating a lack of effect of the protein until sufficient\nSecernin 1 has leaked from the cells to impair secretion.\nThe data are consistent with the hypothesis that exog-\nenously added Secernin 1 is replacing the endogenous\nprotein leaking from the permeabilized cells, thus enhanc-\ning the secretory response under these conditions. The\naddition of Secernin 1 alone is not capable of blocking the\nloss of secretory response but slows the rate of loss of\nresponse.\nWhen cells are permeabilized and incubated at 37°C be-\nfore stimulation, there is a decline in sensitivity to both Ca2\u0001\nand guanine nucleotide. Secernin 1 partially restores Ca2\u0001\nsensitivity, but not sensitivity to guanine nucleotide. We\nhave shown that although Secernin 1 increases the extent of\nsecretion from mast cells, the time course of secretion re-\nmains the same. If we assume that any granule that fuses\nwith the plasma membrane releases either all or a constant\nproportion of its hexosaminidase, then the simplest expla-\nnation of this data is that Secernin 1 causes the recruitment\nof additional secretory granules to the site of exocytosis in a\ncalcium-dependent manner. Alternatively Secernin 1, in the\npresence of calcium, may be acting to increase the granule\nswelling, core expulsion and breakdown observed in fused\ngranules (Zimmerberg et al. 1987; Monck et al., 1991), thus\nincreasing the release of hexosaminidase from the cells.\nThe loss of the secretory response is due to a number of\nprotein factors, including Secernin 1, Rac\/RhoGDI, and the\nother partially purified activities shown in Figure 1, and it is\nlikely that the full reconstitution of the secretory response\nwill require a large number of different proteins. This is\nconfirmed by the finding that inhibition of Secernin in cy-\ntosol by immunoneutralization blocks \u000550% of the recovery\nof secretion, indicating that although Secernin is not the only\ncytosolic component that regulates mast cell secretion, it\nappears to be an important component of the response.\nCytosolic proteins that are capable of regulating exocyto-\nsis in permeabilized cell assays appear to fall into four major\ncategories: 1) proteins that directly interact with the fusion\nmachinery, including \u0001-SNAP (Chamberlain et al., 1995); 2)\nGTPases involved in intracellular signaling, such as Arf\n(Fensome et al., 1996, Caumont et al., 1998), rac (O’Sullivan et\nal., 1996), rho (Price et al., 1995), and cdc42 (Brown et al.,\n1998); 3) proteins involved in other intracellular signaling\npathways, such as PKC (Ozawa et al., 1993) and 14–3-3\n(Morgan and Burgoyne, 1992); and 4) proteins involved in\nthe regulation of PIP2, such as PI kinases (Hay et al., 1995)\nand PITP (Hay et al., 1995; Fensome et al., 1996; Pinxteren et\nal., 2001). Our data clearly demonstrate that the cytosolic\nprotein Secernin 1 has a major role in the regulation of\nexocytosis in mast cells, but further work is required to\ndetermine which or if any of these pathways is the site of\naction of Secernin 1.\nACKNOWLEDGMENTS\nWe thank Douglas Lamont for help with MALDI-TOF mass spec-\ntrometry. This work was supported by a grant from the Wellcome\nTrust to A.J.O’S. and a grant to C.S. from the Association for\nInternational Cancer Research.\nREFERENCES\nAridor, M. et al. (1993). Activation of exocytosis by the heterotri-\nmeric G-protein Gi3. Science 262, 1569–1572.\nBaram, D., Mekori, Y.A., and Sagi-Eisenberg, R. (2001). Synaptotag-\nmin regulates mast cell functions. Immunol. Rev. 179, 25–34.\nBradford, M.M. (1976). A rapid and sensitive method for the quan-\ntitation of microgram quantities of protein utilizing the principle of\nprotein-dye binding. Anal. Biochem. 72, 248–254.\nBrown, A.M., O’Sullivan, A.J., and Gomperts, B.D. (1998). Induction\nof exocytosis from permeabilized mast cells by the guanosine\ntriphosphatases Rac and Cdc42. Mol. Biol. Cell 9, 1053–1063.\nCaumont, A.S. et al. (1998). Regulated exocytosis in chromaffin\ncells—translocation of ARF6 stimulates a plasma membrane-associ-\nated phospholipase D. J. Biol. Chem. 273, 1373–1379.\nChamberlain, L.H. et al. (1995). Distinct effects of alpha-snap, 14–3-\n3-proteins, and calmodulin on priming and triggering of regulated\nexocytosis. J. Cell Biol. 130, 1063–1070.\nFensome, A. et al. (1996). ARF and PITP restore GTP gamma S-\nstimulated protein secretion from cytosol-depleted HL60 cells by\npromoting PIP2 synthesis. Curr. Biol. 6, 730–738.\nGomperts, B.D., and Tatham, P.E.R. (1992). Regulated exocytotic\nsecretion from permeabilized cells. Methods Enzymol. 219, 178–189.\nGriffiths, G.M. (1996). Secretory lysosomes—a special mechanism of\nregulated secretion in hemopoietic cells. Trends Cell Biol. 6, 329–\n332.\nGuo, Z.H., Turner, C., and Castle, D. (1998). Relocation of the\nt-SNARE SNAP-23 from lamellipodia-like cell surface projections\nregulates compound exocytosis in mast cells. Cell 94, 537–548.\nHay, J.C. et al. (1995). ATP-dependent inositide phosphorylation\nrequired for Ca2\u0001-activated secretion. Nature 374, 173–177.\nJahn, R., and Su¨dhof, T.C. (1999). Membrane fusion and exocytosis.\nAnnu. Rev. Biochem. 68, 863–911.\nKawai, J. et al. (2001). Functional annotation of a full-length mouse\ncDNA collection. Nature 409, 685–690.\nKinet, J.P. (1999). The high-affinity IgE receptor (Fc epsilon RI): from\nphysiology to pathology. Annu. Rev. Immunol. 17, 931–972.\nLaemmli, U.K. (1970). Cleavage of structural proteins during the\nassembly of the head of bacteriophage T4. Nature 227, 680–685.\nRegulation of Mast Cell Secretion\nVol. 13, September 2002 3353\nLarbi, K.Y., and Gomperts, B.D. (1996). Practical considerations\nregarding the use of streptolysin-O as a permeabilizing agent for\ncells in the investigation of exocytosis. Biosci. Rep. 16, 11–21.\nLillie, T.H.W., and Gomperts, B.D. (1992). Guanine-nucleotide is\nessential and Ca2\u0001 is a modulator in the exocytotic reaction of\npermeabilized rat mast cells. Biochem. J. 288, 181–187.\nLupas, A. et al. (1991). Predicting coiled coils from protein se-\nquences. Science 252, 1162–1164.\nMarston, F.A.O. et al. (1984). Purification of calf prochymosin (pro-\nrennin) synthesized in Escherichia-coli. Bio-technology 2, 800–804.\nMonck, J.R., Oberhauser, A.F., DeToledo, G.A., and Fernandez, J.M.\n(1991). Is swelling of the secretory granule matrix the force that\ndilates the exocytotic fusion pore. Biophys. J. 59, 39–47.\nMorgan, A., and Burgoyne, R.D. (1992). Exo1 and Exo2 proteins\nstimulate calcium-dependent exocytosis in permeabilized adrenal\nchromaffin cells. Nature 355, 833–836.\nMorrissey, J.H. (1981). Silver stain for proteins in polyacrylamide\ngels—a modified procedure with enhanced uniform sensitivity.\nAnal. Biochem, 117, 307–310.\nO’Sullivan, A.J. et al. (1996). Purification and identification of\nFOAD-II, a cytosolic protein that regulates secretion in streptoly-\nsin-O permeabilized mast cells, as a Rac\/RhoGDI complex. Mol.\nBiol. Cell 7, 397–408.\nOzawa, K. et al. (1993). Ca2\u0001-dependent and Ca2\u0001-independent\nisozymes of protein-kinase-c mediate exocytosis in antigen-stimu-\nlated rat basophilic RBL-2H3 cells—reconstitution of secretory re-\nsponses with Ca2\u0001 and purified isozymes in washed permeabilized\ncells. J. Biol. Chem. 268, 1749–1756.\nPaumet, F. et al. (2000). Soluble NSF attachment protein receptors\n(SNAREs) in RBL-2H3 mast cells. Functional role of syntaxin 4 in\nexocytosis and identification of a vesicle-associated membrane pro-\ntein 8-containing secretory compartment. J. Immunol. 164, 5850–\n5857.\nPinxteren, J.A. et al. (1998). Regulation of exocytosis from rat peri-\ntoneal mast cells by G protein beta gamma-subunits. EMBO J. 17,\n6210–6218.\nPinxteren, J.A. et al. (2001). Phosphatidylinositol transfer proteins\nand protein kinase C make separate but non-interacting contribu-\ntions to the phosphorylation state necessary for secretory compe-\ntence in rat mast cells. Biochem. J. 356, 287–296.\nPrice, L.S. et al. (1995). The small GTPases Rac and Rho as regulators\nof secretion in mast-cells. Curr. Biol. 5, 68–73.\nSmith, D.E., and Fisher, P.A. (1984). Identification, developmental\nregulation, and response to heat-shock of 2 antigenically related\nforms of a major nuclear-envelope protein in Drosophila embryos—\napplication of an improved method for affinity purification of anti-\nbodies using polypeptides immobilized on nitrocellulose blots.\nJ. Cell Biol. 99, 20–28.\nStinchcombe, J.C., and Griffiths, G.M. (2001). Normal, and abnormal\nsecretion by hemopoietic cells. Immunology 103, 10–16.\nTatham, P.E.R., and Gomperts, B.D. (1990). Peptide Hormones: A\nPractical Approach, ed. K. Siddle and J.C. Hutton, Oxford, United\nKingdom: IRL Press, 257–269.\nWalent, J.H., Porter, B.W., and Martin, T.F.J. (1992). A novel 145-kd\nbrain cytosolic protein reconstitutes Ca2\u0001-regulated secretion in\npermeable neuroendocrine cells. Cell 70, 765–775.\nWedemeyer, J., and Galli, S.J. (2000). Mast cells, and basophils in\nacquired immunity. Br. Med. Bull. 56, 936–955.\nZimmerberg, J., Curran, M., Cohen, F.S., and Brodwick, M. (1987).\nSimultaneous electrical and optical measurements show that mem-\nbrane-fusion precedes secretory granule swelling during exocytosis\nof beige mouse mast cells. Proc. Natl. Acad. Sci. USA 84, 1585–1589.\nG. Way et al.\nMolecular Biology of the Cell3354\n"}