{"doi":"10.1109\/IGARSS.2005.1525212","coreId":"102569","oai":"oai:epubs.surrey.ac.uk:2054","identifiers":["oai:epubs.surrey.ac.uk:2054","10.1109\/IGARSS.2005.1525212"],"title":"A Semi-Fragile Pinned Sine Transform\\ud\nWatermarking System For Content Authentication\\ud\nof Satellite Images","authors":["Ho, Anthony T. S.","Zhu, Xunzhan","Woon, W. M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005","abstract":"A novel semi-fragile watermarking scheme for the content authentication of satellite images using the pinned sine\\ud\ntransform (PST) is presented in this paper. In the PST domain, the image field is first decomposed into two mutually orthogonal sub-fields, namely, the boundary field and the pinned field. The watermark is embedded into the pinned field of PST, which contains the texture information of the original image. This important property of the pinned field provides the scheme with special sensitivity to any texture alteration to the watermarked image. It is desirable to the authentication of satellite images, to which the texture characters are crucial for semantic understanding. The watermarking system can localize the portions of a watermarked image that have been tampered\\ud\nmaliciously with high accuracy as well as approximately recover it, while maintaining a high degree of image integrity. The interblock relationship introduced in the process of PST renders the watermarking scheme resistant to content cutting-and-pasting attacks. The watermark can still survive slight non-malicious manipulations, which is desirable in many practical applications in satellite remote sensing. Simulation results demonstrated that the probability of tamper detection of this authentication scheme is higher than 98%","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Institute of Electrical and Electronics Engineers","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2054<\/identifier><datestamp>\n      2017-10-31T14:04:05Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:63637372<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2054\/<\/dc:relation><dc:title>\n        A Semi-Fragile Pinned Sine Transform\\ud\nWatermarking System For Content Authentication\\ud\nof Satellite Images<\/dc:title><dc:creator>\n        Ho, Anthony T. S.<\/dc:creator><dc:creator>\n        Zhu, Xunzhan<\/dc:creator><dc:creator>\n        Woon, W. M.<\/dc:creator><dc:description>\n        A novel semi-fragile watermarking scheme for the content authentication of satellite images using the pinned sine\\ud\ntransform (PST) is presented in this paper. In the PST domain, the image field is first decomposed into two mutually orthogonal sub-fields, namely, the boundary field and the pinned field. The watermark is embedded into the pinned field of PST, which contains the texture information of the original image. This important property of the pinned field provides the scheme with special sensitivity to any texture alteration to the watermarked image. It is desirable to the authentication of satellite images, to which the texture characters are crucial for semantic understanding. The watermarking system can localize the portions of a watermarked image that have been tampered\\ud\nmaliciously with high accuracy as well as approximately recover it, while maintaining a high degree of image integrity. The interblock relationship introduced in the process of PST renders the watermarking scheme resistant to content cutting-and-pasting attacks. The watermark can still survive slight non-malicious manipulations, which is desirable in many practical applications in satellite remote sensing. Simulation results demonstrated that the probability of tamper detection of this authentication scheme is higher than 98%.<\/dc:description><dc:publisher>\n        Institute of Electrical and Electronics Engineers<\/dc:publisher><dc:date>\n        2005<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2054\/1\/SRF002120.pdf<\/dc:identifier><dc:identifier>\n          Ho, Anthony T. S., Zhu, Xunzhan and Woon, W. M.  (2005) A Semi-Fragile Pinned Sine Transform Watermarking System For Content Authentication of Satellite Images   IEEE International Geoscience and Remote Sensing Symposium, 2.  pp. 737-740.      <\/dc:identifier><dc:relation>\n        http:\/\/ieeexplore.ieee.org\/xpls\/abs_all.jsp?arnumber=1525212<\/dc:relation><dc:relation>\n        10.1109\/IGARSS.2005.1525212<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2054\/","http:\/\/ieeexplore.ieee.org\/xpls\/abs_all.jsp?arnumber=1525212","10.1109\/IGARSS.2005.1525212"],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"A Semi-Fragile Pinned Sine Transform\nWatermarking System For Content Authentication\nof Satellite Images\nAnthony T. S. Ho, Xunzhan Zhu\nSchool of Electrical and Electronic Engineering\nNanyang Technological University\nEmail: etsho@ntu.edu.sg\nW. M. Woon\nDataMark Technologies Pte Ltd,\n100 Jurong East Street 21,\nST Electronics Jurong East Building, Singapore\nAbstract— A novel semi-fragile watermarking scheme for the\ncontent authentication of satellite images using the pinned sine\ntransform (PST) is presented in this paper. In the PST do-\nmain, the image field is first decomposed into two mutually\northogonal sub-fields, namely, the boundary field and the pinned\nfield. The watermark is embedded into the pinned field of\nPST, which contains the texture information of the original\nimage. This important property of the pinned field provides\nthe scheme with special sensitivity to any texture alteration to\nthe watermarked image. It is desirable to the authentication of\nsatellite images, to which the texture characters are crucial for\nsemantic understanding. The watermarking system can localize\nthe portions of a watermarked image that have been tampered\nmaliciously with high accuracy as well as approximately recover\nit, while maintaining a high degree of image integrity. The inter-\nblock relationship introduced in the process of PST renders the\nwatermarking scheme resistant to content cutting-and-pasting\nattacks. The watermark can still survive slight non-malicious\nmanipulations, which is desirable in many practical applications\nin satellite remote sensing. Simulation results demonstrated that\nthe probability of tamper detection of this authentication scheme\nis higher than 98%.\nI. INTRODUCTION\nWith the tremendous development of the Internet, the online\npurchasing and distribution of satellite images can now be\nperformed relatively easily. It follows that the content authen-\ntication or the integrity protection of digital satellite images is\nincreasingly becoming more and more important. To counter\nthis growing information security problem of illegal distri-\nbution and counterfeiting, a novel semi-fragile watermarking\nscheme for the content authentication of satellite images using\nthe pinned sine transform (PST) [1], [2] is presented in this\npaper, which is based on our previous work [3].\nThe original image is decomposed into two mutually uncor-\nrelated fields, namely, the boundary field and the pinned field.\nThe texture information of the original image is contained\nin the pinned field, wherein the sine transform is equivalent\nto a fast Karhunen-Loeve transform (KLT). By exploiting\nthis important property, we propose to embed a watermark\nsignal into the sine transform domain of the pinned field\nfor content authentication. As illustrated in this paper, the\nproposed watermarking scheme is especially sensitive to tex-\nture alterations of the host image. This provides significant\nadvantage for authentication of biomedical images, which is\nstrongly texture based. Moreover, although our scheme is\nblock-wise, the watermarking of one block is closely related\nto all the blocks surrounding it, which renders our scheme\nrobust to the “cutting and pasting” attacks. The next section\npresents a brief review of the PST. The watermark embedding\nand authentication methods are elaborated in Section III and\nSection IV, respectively. Section V gives the simulation results\nfollowed by the conclusion in Section VI.\nII. PINNED SINE TRANSFORM\nSuppose a data vector\nX = [x0 . . . xn+1]T\nis separated into a boundary response Xb defined by x0 and\nxn+1, and a residual sequence X′ −Xb, where\nX′ = [x1 . . . xn]T .\nIn [4], Jain showed that ifX was a first-order stationary Gauss-\nMarkov sequence, the sequenceX′−Xb had the sine transform\nas its KLT.\nExtending the above theory to the more general 2-D case,\nMeiri et. al. [1], [2] proposed the decomposition of an image\nfield into two sub-fields, namely, the boundary field and a\nresidual field. The boundary field depends only on the block\nboundaries and for the residual field, so-called the pinned field\nin [2], which vanishes at the boundaries, its KLT is the sine\ntransform.\nThe semi-fragile watermarking adapts to a selective au-\nthentication scheme on the content of images. Our scheme\naims at protecting the primary textures, such as edges, of the\nbiomedical images. To this end, the watermark should not\nsurvive the authentication process if such textures are tampered\nor damaged. The results of the decomposition of the 512×512\nSingapore image are shown in Figure 1. We find that the\nboundary field is only a blurred version of the original image,\nwhile the pinned field is a good characterization of edges,\nwhich fully reflects the texture information in the original\nimage. Thus the watermark can be embedded into the pinned\n0-7803-9050-4\/05\/$20.00 ©2005 IEEE. 737\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 11,2010 at 15:54:00 UTC from IEEE Xplore.  Restrictions apply. \n(a) (b) (c)\nFig. 1. The dual-field decomposition of the Singapore image: (a) the original image, (b) the boundary field and (c) the pinned field.\nOriginal Image\nBoundary Field\nPinned Field\nWatermark\nKey\nWatermarked Image\nEmbedding\nAlgorithm\nFig. 2. Watermark embedding process.\nfield as an indicator of the authenticity of the watermarked\nimage. Moreover, since most common image manipulations\ntend to preserve such primary features of images, this em-\nbedding method ensures that the watermark does not suffer\nsignificantly from such legitimate manipulations.\nIn PST, the image is divided into overlapped blocks, which\nintroduces an inter-block relationship to the pinned sine trans-\nformed images. Therefore the watermarking of any particular\nblock also depends on its location in the image instead of\ndepending only on its own content. Thus, simple “cutting and\npasting” counterfeiting attack can be exposed by this encoding\nscheme since the counterfeit of one block affects all the blocks\naround it.\nIII. WATERMARK EMBEDDING\nThe semi-fragile watermarking aims at authentication of\nthe semantic content of images, i.e., they should protect\nthe primary features of the image content, e.g., edges. The\nwatermark should not survive if such features are damaged. As\nwe have seen in the previous section, after the dual-component\ndecomposition, information of prominent edges of the original\nimage is contained in the pinned field. Thus we may embed\nthe watermark into the pinned field as an indication of the\nauthenticity of the watermarked image.\nThe watermark embedding process is described in Figure\n2. The details are described as follows. The original image\nX is partitioned into overlapping blocks {Xm,n} ∈ X of\nsize 10 × 10, where m and n are the coordinate numbers\nof this block. Two neighboring blocks are overlapped by one\ncolumn or row. For every block, the surrounding zone of a 2-\npixel width is averaged to generate the initial boundaries and\ncorners. These parameters are used to achieve the boundary\nfield by interpolation and the pinned field is in turn obtained\nby subtracting the boundary field from central 8 × 8 part of\nthe original block. After every block has been decomposed, it\nresults in non-overlapping pinned field blocks and boundary\nfield blocks, denoted as {Xpm,n} and {Xbm,n}, respectively.\nBoth the boundary field and the pinned field are of size of\n8× 8.\nThe watermarking process proceeds by conducting the sine\ntransform to every Xpm,n block and by embedding a pseudo-\nrandom binary sequence of length L into each block, whose\ninitial seed is contained in a secret key file. In the middle to\nhigh frequency bands of the sine transform coefficients, we\nselect, according to the length of the watermark sequence, L\ncoefficients for watermarking modulation. More specifically,\nthe watermarking process is defined as follow:\nyp =\n\n\nxp (w = 1 ∧ xp > T ) ∨ (w = 0 ∧ xp < −T )\nα1 w = 1 ∧ xp ≤ T\nα2 w = 0 ∧ xp ≥ −T,\n(1)\nwhere xp and yp are the coefficients before and after water-\n0-7803-9050-4\/05\/$20.00 ©2005 IEEE. 738\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 11,2010 at 15:54:00 UTC from IEEE Xplore.  Restrictions apply. \nTest Image\nBoundary Field\nPinned Field\nKey\nDetection\nAlgorithm\nAuthentication\nAlgorithm\nAuthentication\nResult\nFig. 3. Watermark detection and image authentication process.\nmarking, respectively. T is a sufficiently large positive thresh-\nold value, which is set to achieve the best tradeoff between\nthe perceptual quality and robustness. α1 and α2 are floating\npoint values with α1 ∈ [T\/2, T ] and α2 ∈ [−T,−T\/2].\nThe watermarked coefficients are then inverse sine trans-\nformed and a watermarked image is obtained by adding the\nboundary field to the watermarked pinned field.\nIV. WATERMARK DETECTION AND IMAGE\nAUTHENTICATION\nThe detection of watermark is performed as follows. The\ndetection system receives as input a watermarked and possibly\ntampered image Yˆ. After a similar block-wise decomposition\nas in the watermark embedding, we obtain the pinned field\nblocks {Yˆpm,n}. A Sine transform is performed on these\nblocks. The watermarked coefficients are then located and\nchecked based on the following conditions: if yˆp > 0, we\ndecide the watermark bit as “1”; otherwise, we decide it as\n“0”.\nAfter collecting all the watermark bits in one block, we\nobtain the retrieved and possibly corrupted watermark. The\noriginal watermark is also generated using the initial seed\nin the key file. The watermark bits are compared via the\nnormalized cross correlation function:\nρ =\n∑L\nl=0 wˆm,n[l]wm,n[l][∑L\nl=0(wˆm,n[l])2\n]1\/2[∑L\nl=0(wm,n[l])2\n]1\/2 , (2)\nwhere wm,n is the watermark signal and ρ ∈ [−1, 1]. The\nintegrity of the block Yˆm,n is evaluated according to the value\nof ρ. If no tampering ever occurred to this block, ρ → 1; on\nthe other hand, ρ will decrease due to different tampering of\nYˆm,n. If the content of the block has been changed, i.e. the\nblock has been replaced, due to properties of the normalized\ncross correlation function, ρ will be extremely low.\nAssume γ is a properly set threshold, the block is considered\nto be maliciously tampered if ρ < γ. The threshold is deter-\nmined mathematically or experimentally so as to maximize\nthe probability of detection subject to a given probability of\nfalse alarm. In our current simulations, γ is experimentally set\nto tolerate unavoidable non-malicious modifications in some\npractical applications, such as JPEG compression and noise\naddition, while maintain the sensitivity of the authentication\nprocess to malicious modification on the content of the water-\nmarked images. When tampered portions are detected, these\nportions can be recovered using the similar method as that\nin [5].\nV. SIMULATION RESULTS\nWe use two 512×512 gray-scale satellite images Singapore\nand Pyramids as shown in Figures 4(a) and 5(a) to test our\nauthentication algorithm. Figures 4(b) and 5(b) display the\nwatermarked images. We can see that the watermarked images\nlook identical to the original images, with PSNR values of\napproximately 40 dB and 38 dB, respectively. We modified the\ncontent of the watermarked images as follows: in Figure 4(c),\nthe bridge was removed and in Figure 5(c), some texture of the\nimage was modified. Furthermore, to illustrate the insensitivity\nof our algorithm to non-malicious modifications, after content\nmodification, the images were saved as JPEG files with a QF\nof 90%. As illustrated in Figures 4(d) and 5(d), the maliciously\nmodified areas were accurately detected and identified, while\nthe normal image processing manipulations have little affect\non the authentication process. The restoration results are also\nshown in Figures 4(e) and 5(e).\nVI. CONCLUSION\nIn this paper, we discuss a novel semi-fragile watermarking\nusing the pinned sine transform for the authentication of\nsatellite images. The watermark is embedded into the pinned\nfield, which contains the texture information of the original\nimage. This important property of the pinned field provides\nthe scheme with special sensitivity to any texture alteration to\nthe biomedical images. The watermarking system can localize\nthe portions of a watermarked image that have been tampered\nmaliciously with high accuracy. The effectiveness of the new\nmethod has been demonstrated by experimental results.\nREFERENCES\n[1] A. Z. Meiri, “The pinned Karhunen-Loeve transform of a two dimensional\nGauss-Markov field,” in Proc. SPIE Conf. Image Processing, San Diego,\nCA, 1976.\n[2] A. Z. Meiri and E. Yudilevich, “A pinned sine transform image coder,”\nIEEE Trans. Commun., vol. COM-29, pp. 1728–1753, Dec. 1981.\n[3] A. T. S. Ho, X. Zhu, and Y. L. Guan, “Image content authentication using\npinned sine transform,” EURASIP Journal on Applied Signal Processing\n(JASP), Special Issue on Multimedia Security and Rights Management,\nvol. 2004, no. 14, pp. 2174–2184, Oct. 2004.\n[4] A. Jain, “Some new techniques in image processing,” in Image Science\nMathematics, O. Wilde and E. Barrett, Eds. California: Western Period.,\n1976.\n[5] J. Fridrich and M. Goljan, “Images with self-correcting capabilities,” in\nIEEE International Conf. on Image Processing, Kobe, Japan, Oct. 1999,\npp. 792–796.\n0-7803-9050-4\/05\/$20.00 ©2005 IEEE. 739\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 11,2010 at 15:54:00 UTC from IEEE Xplore.  Restrictions apply. \n(a) (b)\n(c) (d) (e)\nFig. 4. (a) The original image Singapore; (b) the watermarked image; (c) the tampered image (the bridge was removed); (d) the authentication\nresult and (e) the restoration result.\n(a) (b)\n(c) (d) (e)\nFig. 5. (a) The original image Pyramids; (b) the watermarked image; (c) the tampered image (the texture was modified); (d) the authentication\nresult and (e) the restoration result.\n0-7803-9050-4\/05\/$20.00 ©2005 IEEE. 740\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 11,2010 at 15:54:00 UTC from IEEE Xplore.  Restrictions apply. \n"}