{"doi":"10.1039\/b915929k","coreId":"8003","oai":"oai:eprints.brighton.ac.uk:7442","identifiers":["oai:eprints.brighton.ac.uk:7442","10.1039\/b915929k"],"title":"Assessing multiple novel tracers to improve the understanding of the contribution of agricultural farm-waste to diffuse water pollution","authors":["Granger, S.R.","Bol, R.","Dixon, L.","Naden, P.S.","Old, G.H.","Marsh, J.K.","Bilotta, Gary","Brazier, R.E.","White, S.M.","Haygarth, P.M."],"enrichments":{"references":[{"id":42817289,"title":"24, 380–391.This journal is ª The Royal","authors":[],"date":"1973","doi":"10.1111\/j.1365-2389.1973.tb00773.x","raw":"B. D. Trafford and D. W. Rycroft, J. Soil Sci., 1973, 24, 380–391.This journal is ª The Royal Society of Chemistry 201033 G. L. Harris, M. J. Goss, R. J. Dowdell, K. R. Howse and P. Morgan, J. Agric. Sci., 1984, 102, 561–581.","cites":null},{"id":42817290,"title":"Abstracts for the 22 Jahrestagung der Arbeitsgemeinschaft Stabile Isotope,","authors":[],"date":"1999","doi":null,"raw":"R. Bol, W. Amelung, C. Friedrich, J. Lauf and M. Shephard, Abstracts for the 22 Jahrestagung der Arbeitsgemeinschaft Stabile Isotope, AS199, G€ottingen, Germany, 4–6 October, 1999, p. 70.","cites":null},{"id":42817282,"title":"Code of Good Agricultural Practice for the Protection of Water,","authors":[],"date":"2002","doi":null,"raw":"Defra, Code of Good Agricultural Practice for the Protection of Water, Defra Publications, London, 2002.This journal is ª The Royal Society of Chemistry 2010","cites":null},{"id":42817284,"title":"Committee of Analysts, Suspended, Settleable and Total Dissolved Solids in Waters and Effluents,","authors":[],"date":"1980","doi":null,"raw":"UK Standing Committee of Analysts, Suspended, Settleable and Total Dissolved Solids in Waters and Effluents, HMSO, London, 1980.","cites":null},{"id":42817245,"title":"Heathwaite, in Phosphorus Loss from Soil to Water,","authors":[],"date":"1997","doi":"10.1111\/j.1475-2743.2003.tb00273.x","raw":"A. L. Heathwaite, in Phosphorus Loss from Soil to Water, ed. H. Tunney, O. T. Carton, P. C. Brookes and A. E. Johnson, CAB International, Wallingford, UK, 1997, pp. 205–223.","cites":null},{"id":42817280,"title":"Lilly,Hydrology of Soil Types: A Hydrologically Based Classification of the Soils of the United Kingdom, Institute of Hydrology,","authors":[],"date":"1995","doi":null,"raw":"D. B. Boorman, J. M. Hollis and A. Lilly,Hydrology of Soil Types: A Hydrologically Based Classification of the Soils of the United Kingdom, Institute of Hydrology, Wallingford, Oxfordshire, 1995, report No.","cites":null},{"id":42817286,"title":"Principles of Fluorescence Spectroscopy,","authors":[],"date":"1983","doi":"10.1007\/978-1-4615-7658-7","raw":"J. R. Lakowicz, Principles of Fluorescence Spectroscopy, Plenum Press, New York, 1983.","cites":null},{"id":42817276,"title":"Rapid Commun. Mass Spectrom.,","authors":[],"date":"2008","doi":"10.1002\/rcm.3505","raw":"S. J. Granger, G. Bilotta, R. Bol, P. Butler, P. M. Haygarth, T. H. E. Heaton and P. N. Owens, Rapid Commun. Mass Spectrom., 2008, 22, 1681–1689.J. Environ. Monit., 2010, 12, 1159–1169  |1169","cites":null},{"id":42817278,"title":"Soil Sci.,","authors":[],"date":"2008","doi":"10.1002\/jpln.200700226","raw":"D. Fangueiro, D. Chadwick and R. Bol, J. Plant Nutr. Soil Sci., 2008,","cites":null},{"id":42817246,"title":"Soil Use Manag.,","authors":[],"date":"2002","doi":"10.1079\/sum2002156","raw":"K. A. Smith, C. P. Beckwith, A. G. Chalmers and D. R. Jackson, Soil Use Manag., 2002, 18, 428–434.","cites":null},{"id":42817243,"title":"steve.granger@bbsrc.ac.uk bCentre for Ecology","authors":[],"date":"2010","doi":null,"raw":"SN. E-mail: steve.granger@bbsrc.ac.uk bCentre for Ecology and Hydrology, Benson Lane, Crowmarsh Gifford, Wallingford, Oxfordshire, UK OX10 8BB cEnvironmental Tracing Systems Ltd, The Coach House, Bannachra, Helensburgh, UK G84 9EF dSchool of Environment and Technology, University of Brighton, Cockcroft Building, Brighton, East Sussex, UK BN2 4GJ eSchool of Geography, University of Exeter, Amory Building, Rennes Drive, Exeter, Devon, UK EX4 4JQ fNatural Resources Department, Cranfield University, Cranfield, Bedfordshire, UK MK43 0AL gCentre for Sustainable Water Management, University of Lancaster, Lancaster, UK LA1 4YQ Fisheries and Rural Affairs (Defra) grant (PE0120). The first1168  |J. Environ. Monit., 2010, 12, 1159–1169author acknowledges the support of Cranfield University and North Wyke Research through his PhD studentship award as well as advice from Dr Phil Owens of the University of Northern British Columbia. North Wyke Research is grant aided by the Biotechnology and Biological Sciences Research Council (BBSRC). We acknowledge the work of Tobias Krueger, Dr Jim Freer, Dr John Quinton (University of Lancaster), and Dr Kit Macleod (N. Wyke) in establishing the flow measurements and uncertainties for the RERP.References","cites":null},{"id":42817244,"title":"Total Environ.,","authors":[],"date":"2001","doi":null,"raw":"R. W. McDowell and A. N. Sharpley, Sci. Total Environ., 2001, 278,","cites":null},{"id":42817288,"title":"Water Res.,","authors":[],"date":null,"doi":"10.1016\/j.watres.2009.11.038","raw":"P. S. Naden, G. H. Old, C. Eliot-Liaze, S. J. Granger, J. M. B. Hawkins, R. Bol and P. M. Haygarth, Water Res., in press.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"A study was undertaken on drained and undrained 1 ha grassland lysimeters to assess the effectiveness of multiple novel tracing techniques in understanding how agricultural slurry waste moves from land to water. Artificial fluorescent particles designed to mimic the size and density of organic slurry particles were found to move off the grassland via inter-flow (surface + lateral through-flow) and drain-flow. Where both pathways were present the drains carried the greater number of particles. The results of the natural fluorescence and δ<sup>13<\/sup>C of water samples were inconclusive. Natural fluorescence was higher from slurry-amended lysimeters than from zero-slurry lysimeters, however, a fluorescence decay experiment suggested that no slurry signal should be present given the time between slurry application and the onset of drainage. The δ<sup>13<\/sup>C values of more than 0.7 µm and less than 0.7 µm material in drainage were varied and unrelated to discharge. The mean value of  more than 0.7 µm δ<sup>13<\/sup>C in water from the drain-flow pathways was higher from the lysimeter which had received naturally enriched maize slurry compared to the lysimeter which received grass slurry indicating a contribution of slurry-derived material. Values of less than 0.7 µm δ<sup>13<\/sup>C from the same pathway, however, produced counter intuitive trends and may indicate that different fractions of the slurry have different δ<sup>13<\/sup>C values","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Royal Society of Chemistry (RSC Publishing)","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.brighton.ac.uk:7442<\/identifier><datestamp>\n      2015-03-13T11:21:00Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D46303030:46383030:46383530<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.brighton.ac.uk\/7442\/<\/dc:relation><dc:title>\n        Assessing multiple novel tracers to improve the understanding of the contribution of agricultural farm-waste to diffuse water pollution<\/dc:title><dc:creator>\n        Granger, S.R.<\/dc:creator><dc:creator>\n        Bol, R.<\/dc:creator><dc:creator>\n        Dixon, L.<\/dc:creator><dc:creator>\n        Naden, P.S.<\/dc:creator><dc:creator>\n        Old, G.H.<\/dc:creator><dc:creator>\n        Marsh, J.K.<\/dc:creator><dc:creator>\n        Bilotta, Gary<\/dc:creator><dc:creator>\n        Brazier, R.E.<\/dc:creator><dc:creator>\n        White, S.M.<\/dc:creator><dc:creator>\n        Haygarth, P.M.<\/dc:creator><dc:subject>\n        F850 Environmental Sciences<\/dc:subject><dc:description>\n        A study was undertaken on drained and undrained 1 ha grassland lysimeters to assess the effectiveness of multiple novel tracing techniques in understanding how agricultural slurry waste moves from land to water. Artificial fluorescent particles designed to mimic the size and density of organic slurry particles were found to move off the grassland via inter-flow (surface + lateral through-flow) and drain-flow. Where both pathways were present the drains carried the greater number of particles. The results of the natural fluorescence and δ<sup>13<\/sup>C of water samples were inconclusive. Natural fluorescence was higher from slurry-amended lysimeters than from zero-slurry lysimeters, however, a fluorescence decay experiment suggested that no slurry signal should be present given the time between slurry application and the onset of drainage. The δ<sup>13<\/sup>C values of more than 0.7 µm and less than 0.7 µm material in drainage were varied and unrelated to discharge. The mean value of  more than 0.7 µm δ<sup>13<\/sup>C in water from the drain-flow pathways was higher from the lysimeter which had received naturally enriched maize slurry compared to the lysimeter which received grass slurry indicating a contribution of slurry-derived material. Values of less than 0.7 µm δ<sup>13<\/sup>C from the same pathway, however, produced counter intuitive trends and may indicate that different fractions of the slurry have different δ<sup>13<\/sup>C values.<\/dc:description><dc:publisher>\n        Royal Society of Chemistry (RSC Publishing)<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Journal article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        <\/dc:rights><dc:identifier>\n        http:\/\/eprints.brighton.ac.uk\/7442\/1\/Granger-2010-Assessing.pdf<\/dc:identifier><dc:identifier>\n          Granger, S.R., Bol, R., Dixon, L., Naden, P.S., Old, G.H., Marsh, J.K., Bilotta, Gary, Brazier, R.E., White, S.M. and Haygarth, P.M.  (2010) Assessing multiple novel tracers to improve the understanding of the contribution of agricultural farm-waste to diffuse water pollution  Journal of Environmental Monitoring, 12 (5).  pp. 1159-1169.  ISSN 1464-0325     <\/dc:identifier><dc:relation>\n        10.1039\/b915929k<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.brighton.ac.uk\/7442\/","10.1039\/b915929k"],"year":2010,"topics":["F850 Environmental Sciences"],"subject":["Journal article","PeerReviewed"],"fullText":"PAPER www.rsc.org\/jem | Journal of Environmental MonitoringAssessing multiple novel tracers to improve the understanding of the\ncontribution of agricultural farm waste to diffuse water pollution\nSteven J. Granger,*a Roland Bol,a Liz Dixon,a Pam S. Naden,b Gareth H. Old,b Jon K. Marsh,c Gary Bilotta,d\nRichard Brazier,e Sue M. Whitef and Philip M. Haygarthg\nReceived 5th August 2009, Accepted 30th November 2009\nFirst published as an Advance Article on the web 2nd March 2010\nDOI: 10.1039\/b915929kA study was undertaken on drained and undrained 1 ha grassland lysimeters to assess the effectiveness\nof multiple novel tracing techniques in understanding how agricultural slurry waste moves from land to\nwater. Artificial fluorescent particles designed to mimic the size and density of organic slurry particles\nwere found to move off the grassland via inter-flow (surface + lateral through-flow) and drain-flow.\nWhere both pathways were present the drains carried the greater number of particles. The results of the\nnatural fluorescence and d13C of water samples were inconclusive. Natural fluorescence was higher\nfrom slurry-amended lysimeters than from zero-slurry lysimeters, however, a fluorescence decay\nexperiment suggested that no slurry signal should be present given the time between slurry application\nand the onset of drainage. The d13C values of >0.7 mm and <0.7 mm material in drainage were\nvaried and unrelated to discharge. The mean value of >0.7 mm d13C in water from the drain-flow\npathways was higher from the lysimeter which had received naturally enriched maize slurry compared\nto the lysimeter which received grass slurry indicating a contribution of slurry-derived material. Values\nof <0.7 mm d13C from the same pathway, however, produced counter intuitive trends and may indicate\nthat different fractions of the slurry have different d13C values.Introduction\nWith the recent introduction of legislation and policy aimed at\nimproving aquatic ecology and water quality in river basins\n(e.g. EU Water Framework Directive), attention is increasingly\nfocusing on efforts to decrease inputs of pollutants into surface\nwaters (i.e. rivers and lakes) and groundwater. Agricultural areas\ntypically represent a large proportion of the land surface in manyaNorth Wyke Research, North Wyke, Okehampton, Devon, UK EX20\n2SN. E-mail: steve.granger@bbsrc.ac.uk\nbCentre for Ecology and Hydrology, Benson Lane, Crowmarsh Gifford,\nWallingford, Oxfordshire, UK OX10 8BB\ncEnvironmental Tracing Systems Ltd, The Coach House, Bannachra,\nHelensburgh, UK G84 9EF\ndSchool of Environment and Technology, University of Brighton, Cockcroft\nBuilding, Brighton, East Sussex, UK BN2 4GJ\neSchool of Geography, University of Exeter, Amory Building, Rennes\nDrive, Exeter, Devon, UK EX4 4JQ\nfNatural Resources Department, Cranfield University, Cranfield,\nBedfordshire, UK MK43 0AL\ngCentre for Sustainable Water Management, University of Lancaster,\nLancaster, UK LA1 4YQ\nEnvironmental impact\nBased on largely anecdotal evidence, agricultural amendments have\ndiffuse pollution. This study assesses a suite of novel tracing appr\nbetween different contaminant sources and the occurrence of poll\ndrained intensively managed grassland on a heavy soil type which ha\napproaches used were artificial fluorescent particles designed to mim\nagricultural wastes, and the difference in the natural abundance C\nThis journal is ª The Royal Society of Chemistry 2010countries, and in Europe and North America this land often\nreceives large quantities of agricultural amendments such as\ninorganic fertilisers or managed animal manure (e.g. farmyard\nmanure (FYM) and slurry) which are applied to improve plant\nproduction. However, with the intensification of farming, and\nsubsequent increases in stocking densities, managed manures are\noften applied to land in excess. These organic amendments can\nhave a significant impact if released into river systems as they\ncontain high levels of nutrients, particularly nitrogen (N) and\nphosphorus (P) and have a high biological oxygen demand which\ncan lead to a decrease in river oxygen levels.1 Increases in plant\nnutrients in aquatic systems can lead to the eutrophication of an\necosystem with a host of associated detrimental effects.2 The\napplication of these amendments to land has long been impli-\ncated by studies as a source of aquatic diffuse N and P pollu-\ntion.3–7However, few studies actually provide evidence of a direct\nlink between the organic sources of pollution applied to land and\nthe occurrence of pollutants in water bodies.8 The potential to\napply tracing techniques—particularly the simultaneous use of\nmultiple tracers—to provide substantive evidence for the nature\nof this link at the field-scale has previously been highlighted.9been linked to the degradation of surface water quality through\noaches which could be used to provide a more definitive link\nution in drainage water. More specifically from an artificially\ns received an application a liquid farm slurry waste. The tracing\nic organic slurry particles, the natural fluorescence properties of\nisotopes of both grass and maize derived slurries.\nJ. Environ. Monit., 2010, 12, 1159–1169 | 1159\nTo provide proof of concept, a tracer study was undertaken on\n1 ha intensively managed, drained and undrained, grassland\nlysimeters in the southwest UK. Three tracing techniques were\nchosen: (i) natural abundance carbon (C) isotopes, (ii) labelled\nsynthetic particles, and (iii) natural fluorescence.\nIt is believed that the use of stable C isotopes at natural\nabundance should be able to provide evidence for the movement\nof slurry-derived C from land into drainage waters. A previous\nunreported study undertaken at the small plot scale had shown\nthat the amount of slurry-derived organic C lost in drainage\nvaried from 10 to 75%, with the maximum loss occurring shortly\nafter slurry application during a rainfall event. Furthermore,\nslurry-derived C continued to be detectable in drainage waters\nfor over 2 months, long after pollutants had returned to pre-\nslurry levels (Bol, personal communication). The principles\nbehind the stable C isotope tracing technique have been\ndescribed in detail elsewhere.10–12 In short, all grasslands in the\nUK are C3 systems (d\n13C z \u000226&). Cattle overwintered on\nsilage produced from this herbage produce a slurry of similar\nenrichment while cattle overwintered on a C4 plant-based silage\nproduce an isotopically higher slurry (d13C z \u000213&).13 Thus,\nany increase in the d13C signal of C present in the drainage water\nleaving a C3 lysimeter which receives C4 slurry, when compared\nto a C3 lysimeter which receives C3 slurry, can be attributed to the\npresence of the C4 slurry. A lysimeter receiving C3 slurry is used\nas a control rather than a zero-slurry lysimeter to account for any\ndifferences in the soil biogeochemical processes due to the pres-\nence of slurry and it is assumed that the processes that affect both\nC3 and C4 slurries are the same. By examining the d\n13C of both\nparticulates and filtrates in the drainage waters, this technique\nmay be extended to provide evidence for differing loss processes.\nSynthetically labelled particles have been previously used in\nmaritime and terrestrial aquatic environments.14–16 These parti-\ncles typically comprise a polymer combined with a fluorescent\ndye manufactured with a density matched to that of the particles\nwhich are being mimicked. To an extent, similar size distribu-\ntions may also be achieved by initial sieving, with further control\nover particle size being applied at the sample analysis phase.\nThus particles of roughly equivalent size and density to particles\ntypically present in slurry can be created and subsequently added\nto and mixed with slurry before its application to the grassland\nlysimeters. The presence, or the absence, of these particles in\nwater draining the lysimeters is a direct indication that particu-\nlate material applied with the slurry is able to move, and has\nmoved from the system.\nRecent advances in fluorescence spectroscopy have enabled\nrapid automated collection of fluorescence intensity data across\na wide range of excitation and emission wavelengths. The\nobserved centres of fluorescence in river water samples corre-\nspond to those produced by known fluorophores, predominantly\nthe amino acids, tryptophan and tyrosine, and high molecular\nweight organic molecules, such as humic and fulvic acids. Hud-\nson et al.17 provide an excellent review of both the phenomenon\nof natural fluorescence and its measurement. Farm wastes have\nalso been analysed for their fluorescent properties and have been\nfound to have very high intensities of tyrosine-like and trypto-\nphan-like fluorescence and high ratios of these to fulvic\/humic-\nlike fluorescence compared to stream waters.18 This suggests that\npollution of waters by these agricultural wastes could leave1160 | J. Environ. Monit., 2010, 12, 1159–1169a distinct fluorescence signature reflecting both the source of the\ndissolved organic matter and its concentration.\nThis combination of tracers may therefore be able to provide\nnot only evidence of a direct connection between pollutant losses\nand organic amendments applied to agricultural grassland but\nalso to discriminate between dissolved and particulate slurry\nfractions. The aim of this paper is to present the results from the\nfield experiment in terms of both the evidence provided by the\ntracers for direct slurry losses into drainage waters and to\nprovide an assessment of the tracing techniques used.\nExperimental\nSite\nThe study was sited on the field-scale lysimeters (1 ha) of the\nRowden experimental research platform (RERP) in Devon,\nSouthwest England (National Grid Reference: SX 650995).\nThe experimental site is maintained as permanent grassland and is\ngrazed by beef heifers at stocking densities of approximately four\nlivestock units per hectare in order to manage sward height during\nthemonthsofJune toSeptember.The soil is a clayeynon-calcareous\npelostagnogley of the Hallsworth series (Dystic Gleysol, FAO;\nHOST class 2419), overlying clay shales of the Crackington forma-\ntion (Culm measures) and the site slopes between 5 and 10% west-\nwards. For details of soil properties see Scholefield et al.20 and\nArmstrong andGarwood.21The annual rainfall at this site averages\n1055 mm, where the majority falls between October and March.\nAs a consequence of the virtually impermeable clay layer below\n30 cm the soil remains waterlogged for much of the winter period.\nHalf of the lysimeters at theRERPhave been agriculturally drained\nwhile the other half has no drainage installed. Lysimeters in which\nnodrainage has been installed are dependent uponnatural drainage\nvia surface-flow and lateral through-flow pathways, and are termed\n‘undrained’ (Fig. 1a). Lysimeters which have drainage installed are\ntermed ‘drained’ and havemole drains at a depthof 55 cmwhich are\ninterceptedbygravel filled trencheswith 85 cmdeeppermanent pipe\ndrains (Fig. 1b). All the lysimeters have perimeter gravel filled\nditches to a depth of 30 cmwhich collect any surface runoff plus any\nlateral through-flow (combined referred to as inter-flow). The flow\nis channelled through 45\u0003 V-notch weirs. The drained lysimeters\nhave additional and separate V-notch weirs for measuring water\nthat flows through the drainage system (termed drain-flow)\n(Fig. 1b). The stage height (h) of both inter-flow and drain-flowwas\nmeasuredusing solar poweredStarlevel flowsensorsona5min time\nstep with data recorded by Campbell radio loggers and subse-\nquently transmitted via radio modem to a central computer.\nTo convert h to discharge (Q) stage–discharge relationships were\nproduced for eachweir, including estimates of the errors involved in\nthe calibration.22 These were used to produce hydrographs with\nassociated uncertainty bands (Qmax andQmin) through a technique\ndevelopedbyKrueger et al.23Rainfall at the sitewasmeasuredusing\na tipping-bucket rain gauge (Rainwise, Bar Harbor, ME), which\nrecorded the total number of tips per minute (each tip equivalent to\n0.254 mm rainfall).\nExperimental design\nThe experiment began on the 18th April 2006. Prior to this, slurry\nwas sourced from two local farms where cattle were overwinteredThis journal is ª The Royal Society of Chemistry 2010\nFig. 1 The hydrological pathways of the undrained (a) and drained (b) lysimeters at the Rowden experimental research platform (adapted from\nGranger et al. 200839). The location of the lysimeters used for each tracer application is presented in (c).on a diet of either ryegrass (Lolium perenne L., a C3 plant with\na d13C value of approx.\u000226&) or maize (Zea mays L., a C4 plant\nwith a d13C value of approx. \u000213&) based silage. After collec-\ntion, and prior to application, the slurries were stored in two\nslurry mini-stores so that they could be well mixed. Each store\nwas used exclusively for the storage and mixing of either the\nC3 or the C4 slurry to avoid cross-contamination.\nPrior to mixing and application to the lysimeters, the C4 slurry\nreceived a dose of fluorescent tracer particles. These were man-\nufactured by Environmental Tracing Systems Ltd, Helensburgh,\nUK with a particle size distribution (PSD) based on the PSD of\nan initial test slurry (Fig. 2a). These data showed a bimodal\ndistribution with one peak between 27 and 37 mm. The artificial\nfluorescent particles were manufactured to match this size range\nand have a density of 1.15 g cm\u00023 so as to be comparable with the\norganic particles within the slurry. The PSD data for the rawFig. 2 Particle size distributions of (a) the initial test dairy slurry, (b) the raw\ndrained and undrained lysimeters after the addition of the tracer particles.\nThis journal is ª The Royal Society of Chemistry 2010tracer particles (Fig. 2b) show a relatively large proportion of\nvery fine particles below 2 mm. Given that these were not present\nin the initial test slurry, all particles below 2 mm were discounted\nduring the analysis of any samples. Excluding the <2 mm parti-\ncles, the D50 of the tracer was \u000412 mm with the main peak\nbetween 16 and 19 mm. Analysis of the two stock solutions\nshowed that 4.4 \u0005 1013 particles were applied per release. Mixing\nwas accomplished through the pump and return of slurry out of,\nand back into the slurry towers using a conventional vacuum\ntanker. Tracer was then added to the slurry before further mixing\nwas undertaken.\nThe experimental design comprised six hydrologically isolated\nlysimeters at the RERP consisting of three drained and\nundrained pairs. Two pairs received an application of either C3\nor C4 slurry while the third pair received nothing (Fig. 1c). The\nmaximum recommended application rate for UK grasslandartificial fluorescent tracer particles and (c) the maize slurries applied to\nJ. Environ. Monit., 2010, 12, 1159–1169 | 1161\nsystems is 50 m3 ha\u00021, however, due to environmental constraints\nat the RERP at the time of application only 21 m3 ha\u00021 were\napplied. The C3 and C4 slurries were applied to the drained\nlysimeters on the 18th April, while application to the undrained\nlysimeters occurred one week later on the 25th April. Slurry was\napplied using a conventional vacuum tanker fitted with a splash\nplate in three applications starting with the third of the lysimeter\nfurthest away from the access point. Slurry was remixed before\neach tanker load was removed from the slurry mini-stores.\nA 10 m margin was left around the edge of each lysimeter in\norder to prevent contamination of the surface drains in accor-\ndance with the ‘Code of Good Agricultural Practice’.24\nSampling\nSoil cores were collected from across the RERP to ascertain the\nd13C of the total soil C prior to slurry application. Five points\nwithin four of the lysimeters at the RERP were used which\nincluded two of the lysimeters used in this study. At each point\n10 cores (2.5 cm diameter) were taken to a depth of 7.5 cm and\nthese cores were then bulked.\nSub-samples of slurry were collected from each batch of slurry\nthat was applied to each of the four lysimeters and stored in\na refrigerator at 4 \u0003C until analysis.\nSamples of drainage water were taken as follows: all V-notch\nweir systems were fitted with an internal stainless steel mixing\nplate below the drainage input to the weir. The drainage flowing\nthrough the mixing plate was then sampled on hourly or sub-\nhourly time steps either using an automated sampler or through\nthe collection of manual grab samples. Sampling of drainage\nwater commenced after the first rainfall event to initiate drainage\nfrom the lysimeters. This occurred on the 19th May 2006, some\n31 days after slurry application. A further two rainfall events\nwere sampled, occurring on the 21st and 24th of May, and these\nthree events are referred to as events 1, 2 and 3 respectively.\nEvents 1 and 3 were sampled using automated samplers while\nevent 2 was sampled manually by taking hourly grab samples.\nThis was undertaken as during event 1 it was found that at low\nflows the auto-samplers were unable to collect sufficient sample\nfor analysis. Event 3 was sufficiently large for resumption of\nautomated sampling. Auto-samplers were set to sample using the\nsame atomic clock time as the flow loggers. Samples were stored\nin a refrigerated environment in 1000 ml polyethylene bottles.\nIn addition, temporal changes in the natural fluorescence\nsignal of the slurry were monitored by applying slurry toFig. 3 The response of the fluorescent tracer particle\n1162 | J. Environ. Monit., 2010, 12, 1159–1169a compartmented tray of a sterile medium (vermiculite) at the\nsame rate (i.e. depth) as to the lysimeters. The use of a sterile\nmedium was chosen so as not to introduce additional sources of\nfluorescence. There was no attempt to simulate soil processes.\nFour replicate sub-samples and two controls were collected each\nweek and extracted using de-ionised water for analysis.\nAnalysis\nChemistry. Slurry samples were analysed for total solids by\ndrying a pre-weighed sample in an oven at 100 \u0003C and subse-\nquently re-weighing until a constant weight is obtained. Organic\nmatter was determined through weight loss on ignition at 500 \u0003C\nof the dried slurry.\nWithin 24 h of arrival at the laboratory, drainage waters had\nsub-samples for total phosphorus (TP) analysis transferred to\npolypropylene autoclavable bottles. Concentration of TP was\nthen determined through an acid persulfate digestion using\na method described by Eisenreich et al.25 Absorbance was\nmeasured colourimetrically on a spectrophotometer (Cecil\nInstruments, Cambridge, UK) calibrated by standards prepared\nfresh on the day of analysis. Concentrations of suspended solids\n(SS) and volatile solids (VS) were determined through vacuum\nfiltration and subsequent drying at 105 \u0003C for at least 1 h, of\na known sample volume through a pre-weighed GF\/F filter paper\n(Whatman), with particle size retention of 0.7 mm. Filter papers\nwere then heated to 500 \u0003C for at least 30 min to determine the\ntotal residual ash. The difference between SS and total ash is\nconsidered to represent VS.26\nArtificial fluorescent particles. Particle size distributions for\nboth the raw tracer particles and tracer particles mixed with\nslurry were measured using a LISST 100 laser diffraction particle\nsize analyser (Sequoia Scientific, USA). In both cases, ten\nanalyses were undertaken and a mean result generated. Water\nsamples collected from the lysimeters were agitated and sonified\nto disaggregate and suspend any solids and tracer particles.\nA measured volume, between 5 and 25 ml depending on\nturbidity, of the sample was then filtered through a 0.45 mm\ncellulose nitrate filter paper (Whatman). The filter paper was\ncarefully transferred using forceps from the filter housing to\na labelled microscope slide. Each slide was then analysed\nmanually using a specially modified scanning fluorescent\nmicroscope (Leica, Germany). The total counts for the measured\nvolume were then converted to tracer counts per ml (cts ml\u00021).s to Q during the three monitored rainfall events.\nThis journal is ª The Royal Society of Chemistry 2010\nReplicate analyses were carried out on 15% of the samples ana-\nlysed with the results indicating less than 9% error on all samples.\nPrior to the release of the tracer particles some raw slurry\nsamples and background water samples were collected from the\nRERP to determine whether there was any background fluo-\nrescence. While some weakly fluorescent particles were present in\nthese samples, likely to be either inorganic minerals and\/or bio-\nlogical material, they did not interfere with the very much\nbrighter fluorescent yellow particles applied due to the different\nexcitation and emission wavelengths.\nNatural fluorescence. Sub-samples of drainage water were\ntaken from the ISCO sample bottles in acid-washed brown glass\nbottles and kept in cool, dark conditions. Samples were analysed\nat room temperature and before analysis, samples were filtered\nusing pre-ashed GF\/C glass fibre filters (Whatman) with particle\nsize retention of 1.2 mm.\nThe fluorescence measurements were carried out on a Varian\nCary Eclipse fluorescence spectrophotometer fitted with a Xenon\nflash lamp using slit widths of 5 nm, an integration time of\n12.5 ms and voltage of 725 V. Excitation wavelengths from 240 to\n400 nm (in steps of 5 nm) and emission wavelengths from 280 to\n500 nm (in steps of 2 nm) were used to generate excitation\/\nemission matrices (EEMs). The absorbance of each sample was\nmeasured in a 1 cm cuvette on an Agilent 8453 spectrophotom-\neter at 1 nm intervals from 200 to 800 nm. Samples with an\nabsorbance value of >0.02 cm\u00021 at 650 nm were omitted from the\nanalysis as this was indicative of inefficient filtering. Samples\nwhich had an absorbance of 0–0.02 cm\u00021 at 650 nm had their\nabsorbance corrected using the long-wavelength scatter-correc-\ntion method of Blough et al.27 Raw fluorescence data were then\ncorrected for lamp output and for instrument sensitivity\nfollowing manufacturer’s instructions (Haines, personal\ncommunication). Inner-filtering corrections, calculated from the\ncorrected absorbance data using the method of Lakowicz,28 were\nthen applied. The fluorescence data were finally converted to\nRaman units using the method of Lawaetz and Stedmon.29\nFollowing investigations using known mixtures of test solu-\ntions prepared with ultra-pure water and DL-tyrosine, L-trypto-\nphan, IHSS Suwannee River Fulvic Acid Standard II and Humic\nAcid Standard II, indices representing tryptophan-like and ful-\nvic\/humic-like fluorescence were calculated as the mean fluores-\ncence intensity over the following ranges:\ntryptophan index (TI): excitation 275–285 nm\/emission\n346–354 nm\nfulvic\/humic index (FI): excitation 325–375 nm\/emission\n450–500 nm\nThis provides a ratio of TI : FI which is typically >2 for slurry\nand <1 in drainage waters in the absence of slurry (Naden et al.,\nin press30). Thus, slurry losses should be identifiable in the\nenrichment of the TI : FI ratio. Where results are presented as\nmeans, two standard errors are presented in parenthesis.\nIsotopic. Bulked soil cores were sieved through a 2 mm sieve to\nremove large stones and organic fragments before being dried\novernight at 30 \u0003C to a constant weight and ground into a fine\npowder. Slurry sub-samples were dried to a constant weight in an\noven at 100 \u0003C before being milled to a fine powder. Drainage\nsamples were collected and delivered to the laboratory withinThis journal is ª The Royal Society of Chemistry 201024 h of being sampled. They were then refrigerated at 5 \u0003C until\nready for preparation. Samples were subject to vacuum filtration\nthrough pre-combusted (500 \u0003C), washed and dried 0.7 mm glass\nfibre filters (GF\/F, Whatman). The resultant filtrate was then\nfrozen and freeze-dried prior to analysis. Filter papers upon\nwhich >0.7 mmparticulate material was collected were dried in an\noven at 105 \u0003C and stored individually in airtight bags and placed\nin a desiccator until ready for analysis.\nTotal C (TC) and 13C content were determined by dry\ncombustion on a Carlo Erba NA 1500 elemental analyser con-\nnected to an automated continuous flow ANCA 20\/20SL system\n(Europa, Crewe, UK). Prepared soil and slurry samples were\nweighed into 8 \u0005 5 mm tin capsules and combusted using 25 ml\nof O2. Samples of particulate material on glass fibre filter papers\nwere cut to fit inside 10 \u0005 10 mm tin capsules and combusted in\nthe elemental analyser via a large bore auto-sampler (AS128)\nusing a 50 ml oxygen loop. Despite the 10\u0005 10 mm capsule being\nable to hold significantly more sample than an 8\u0005 5 mm capsule,\nthe actual amounts of sample C were still found to be low. To test\nthe precision of the mass spectrometer (MS) with small amounts\nof C, a series of 63 flours (42.2% C; \u000226.4& d13C) from 5 mg\ndown to 0.25 mg (i.e. 5, 4, 3, 2, 1, 0.5, and 0.25) were used where\neach weight was weighed to within \u00065% of the target. Sample\ndata were statistically adjusted based on the exponential curves\ngenerated by results up to 5 mg flour. Freeze-dried <0.7 mm\nfiltrates were also weighed into 10 \u0005 10 mm tin capsules and\ncombusted using 50 ml of O2, however, in this case sufficient\nsample C was supplied to not warrant statistical adjustment of\nthe data.\nGround wheat flour referenced against CaCO3 (NBS-19,\nGaithersburg, MD, USA) was used as a calibration standard.\nThe natural abundance values were expressed as d values, which\nrepresent the ratios of 13C\/12C relative to the international VPDB\nstandard.\nThe d13C values (per mil) are defined as:\nv13C ¼\n\"\natom%13Csample \u0002 atom%13CVPDB\natom%13CVPDB\n#\n\u0005 1000\nInternal quality controls were included with samples during\nanalysis comprising no less than 10% of the total number of\nsamples and drift correction was made against internal\nstandards during the run. Replication of samples was typically\nbetter than 0.8& for GF\/F particulate samples and 1& for\nfreeze-dried filtrates with mean values of 0.1 (\u00060.2) and 0.1\n(\u00060.5) respectively (two standard errors are presented in\nparenthesis).\nResults and discussion\nHydrological response\nThree storms were monitored during the period 19th–26th May\n2006 which generated hydrographs from the nine hydrological\npathways contained within the six paired lysimeters. Due to\na logger failure, discharge data from the zero-slurry and maize\nslurry lysimeters were not recorded from 22nd May until the end\nof the study. The Q record from the grass slurry lysimeters was\nunaffected. To estimate the missingQ record for this time period,\nQ has been taken from other lysimeters at the RERP site whichJ. Environ. Monit., 2010, 12, 1159–1169 | 1163\nhave been shown to behave in a hydrologically similar fashion.\nThese lysimeters were selected by visual comparison of the\nhydrographs and assessment of the monthly flow statistics\nrecorded from all lysimeters compared to those with missing data\nover the period March–May 2006.\nThe amounts of rainfall leading to the Q events sampled were\n13, 7 and 14 mm occurring on the 19th, 21st and 24th May\nrespectively. The previous month, during which slurry had been\napplied to the lysimeters, had been unusually dry having received\njust 18 mm rainfall compared to the mean April rainfall of\n68 mm. For the month of May, up to the 19th, 30 mm of rainfall\nhad fallen which was still lower than average for the time of year.\nBy the time drainage caused by event 1 on the 19th May occurred\nthe soil moisture deficit (SMD) for the site, as calculated by the\nPenman equation,31 was approximately 25 mm. This deficit\nexplains why a rainfall event of 13 mm over 6 h did not produce\nsignificantQ for event 1. By event 2 on the 21st May the SMD had\nbeen reduced to \u00044 mm, however, the relatively small amount of\nrainfall received meant that Q was low from the lysimeters.\nHowever, by event 3 on the 24th May the soil had no SMD and\nthe 14 mm of rainfall that fell at the site caused Q to be\nsubstantially greater than event 1.\nThe hydrological response of the lysimeters is typical of this\nsite and of other clay soil sites both with and without mole\ndrainage.21,32,33 Discharge responds rapidly to the onset of rain-\nfall forming characteristically peaky hydrographs, especially\nfrom the undrained lysimeters. Where mole drains have been\ninstalled, one could expect this drainage pathway to carry the\ngreater proportion of storm water.21,33 However, should the\ndrain system not operate efficiently through collapse of the moles\nthe peaky drain-flow hydrograph would be attenuated while the\ninter-flow pathway would carry an increased percentage of\nthe total drainage.21 During this study, while drain-flow from the\nlysimeters remained peaky, the hydrographs are more smoothed\nin comparison to the inter-flow hydrographs. Furthermore, the\nvolume of water carried by the drain-flow pathway was\napproximately equal to that of the inter-flow.22Chemical response\nA summary of the chemical data for each lysimeter and hydro-\nlogical pathway for the three monitored drainage events is pre-\nsented in Table 1. These data show that there was considerable\nvariation in TP concentrations between events, slurry treatments\nand drainage status of the lysimeters with no consistent treat-\nment effect evident. The mean concentrations of TP from the\nzero-slurry undrained lysimeters were 146, 540 and 247 mg l\u00021 for\nevents 1, 2 and 3 respectively. Mean concentrations from slurry-\namended undrained lysimeters were higher during events 1 and 3,\nbut lower during event 2. Mean concentrations of TP from the\ndrained lysimeters were always higher in the drain-flow than the\ninter-flow. Concentrations in both pathways were also found to\nbe higher from the zero-slurry lysimeter compared to both the\nslurry-amended lysimeters during events 1 and 2 although during\nevent 3 concentrations were higher in the drain-flow of both the\nslurry-amended lysimeters.\nSuspended sediment concentrations also showed cross-site\nvariation with no distinct event or slurry treatment effects. Mean\nevent concentrations from the zero-slurry undrained lysimeters1164 | J. Environ. Monit., 2010, 12, 1159–1169were 78, 185 and 51 mg l\u00021 while from the grass slurry-amended\nlysimeter they were 44, 38 and 90 mg l\u00021 and from the maize\nslurry-amended lysimeter 116, 78 and 45 mg l\u00021. Mean concen-\ntrations from the drained lysimeters showed a similar lack of\nevent or slurry effect although concentrations were typically\nhigher in the inter-flow than in the drain-flow for any given\nlysimeter. Concentrations of VS also showed no distinct event or\nslurry treatment effect although as with SS mean concentrations\ntended to be slightly higher in the inter-flow than the drain-flow.\nThe composition of the SS is typically mineral with maximum\nmean VS from the zero-slurry lysimeter of 24% from the\nundrained and 26\/24% from the drain-flow\/inter-flow pathways\nof the drained lysimeters. The proportion of VS was generally\nhigher in lysimeters which received slurry compared to those\nwhich did not for any given event, with the drain-flow of the\ndrained lysimeters having a larger percentage of VS to SS\ncompared to the inter-flow.\nThe highest concentrations of SS and TP typically coincide\nwith or occur just before peak Q and then decrease with\ndecreasing Q as previously described by Bilotta et al.22 The\nconcentrations reported here are comparable with those reported\npreviously during a more comprehensive study of SS and TP\nfrom zero-slurry lysimeters at this site.22 The number of signifi-\ncant correlations between SS and TP increases through events\n1 to 3 but shows no link to drainage status of the lysimeter, the\nhydrological pathway, or the application of slurry (Table 1).\nDuring event 1 there were virtually no significant relationships\nwhile all pathways in event 3 show highly significant correlations.\nThis perhaps indicates that the size of the drainage event may be\nmore important in SS and TP mobilisation rather than the\ndrainage status of the grassland and that the soil, not the slurry,\nwas the dominant source of SS and TP.Artificial fluorescent particles\nThe PSD data for the slurries mixed with tracer are presented in\nFig. 2c and given the much smaller volume of tracer added to\na large volume of slurry the PSD data essentially reflect the slurry\nused for each study. The data indicate that the maize slurry used\nto mix with the fluorescent tracer was not the same as the slurry\nused as an initial guide. The maize slurry used for the undrained\nand drained plots shows mainly a unimodal distribution with\na peak around 60–80 mm and not a bimodal distribution as the\ninitial guide slurry had shown. The PSD data for the slurries\napplied to drained and undrained lysimeters show differences\nalthough given they were different batches and not collected at\nthe same time this is perhaps not surprising. The fluorescent\ntracer particles used tended to represent the initial 40–50% of the\nslurry based on PSD data with more than 50% of the slurry\nconsisting of particles larger than the tracer used. The PSD data\nof the slurry tracer mixture also show that both have an increase\nin the number of particles <2 mm, a feature not present in the\ninitial test slurry. This is interpreted as purely a function of the\naddition of the tracer which has a high number of <2 mm parti-\ncles, which were excluded from analysis.\nThe number of tracer particles lost from each pathway\nincreased through events 1 to 3 (Table 1); the mean number of\nparticles lost during each event from the inter-flow pathway of\nthe undrained lysimeter was 1, 8 and 84 cts ml\u00021, whileThis journal is ª The Royal Society of Chemistry 2010\nT\na\nb\nle\n1\nS\nu\nm\nm\na\nry\no\nf\nd\na\nta\no\nb\nta\nin\ned\nfr\no\nm\nR\nE\nR\nP\nly\nsi\nm\net\ner\ns\nd\nu\nri\nn\ng\nth\ne\nth\nre\ne\nm\no\nn\nit\no\nre\nd\nev\nen\nts\n.\nD\nra\nin\na\ng\ne\nst\na\ntu\ns:\nU\nD\n¼\nu\nn\nd\nra\nin\ned\n,\nD\n¼\nd\nra\nin\ned\n.\nP\na\nth\nw\na\ny\n:\nIF\n¼\nin\nte\nr-\nfl\no\nw\n,\nD\nF\n¼\nd\nra\nin\n-fl\no\nw\n.\nC\no\nrr\nel\na\nti\no\nn\ns:\nn\ns\n¼\nn\no\nt\nsi\ng\nn\nifi\nca\nn\nt,\n*\n¼\np\n<\n0\n.0\n5\n,\n*\n*\n¼\np\n<\n0\n.0\n1\n,\n*\n*\n*\n¼\np\n<\n0\n.0\n0\n1\nThis journal is ª The Royal Society of Chemistry 2010 J. Environ. Monit., 2010, 12, 1159–1169 | 1165\na comparable response is also present in the drain-flow of the\ndrained lysimeter (2, 23 and 90 cts ml\u00021). While there are no data\nfor event 1 from the inter-flow pathway of the drained lysimeter,\nthere is a marked increase in tracer particle numbers in event 3\ncompared with event 2, however, the numbers of particles lost in\nevents 2 and 3 are notably lower from this pathway than from\nthe other two pathways (0 and 58 cts ml\u00021), particularly during\nevent 2. During event 1 no relationship between tracer particles\nand Q was observed in the undrained lysimeter, however,\na significant positive relationship (r7 ¼ 0.83, p < 0.01) occurs in\nthe drain-flow from the drained lysimeter. Similarly during event\n2 no relationship was present between tracer particles and Q in\nthe inter-flow from either lysimeter, although tracer particle\nnumbers had increased compared to event 1 from the undrained\nlysimeter and were in turn greater than those from the drained\nlysimeter inter-flow pathway. No significant relationship was\nfound between particle tracer number and Q from the drain-flow\npathway during event 2; however, the number of particles lost\nwas greatest from this pathway during this event. As event 3 Q\nfrom these two lysimeters is interpolated Q and not true Q from\nthese lysimeters, no statistical analysis of Q vs. tracer particles\nhas been undertaken, however, a clear trend is apparent. From\nall three pathways particle counts per ml appear to exhibit\na positive relationship with Q with the maximum counts per ml\noccurring at, or shortly after, the maximum Q (Fig. 3). The\nincrease in numbers is rapid on the rising limb of the hydrograph,\nwhile numbers decline more slowly on the falling limb, mirroring\nthe nature of the Q itself.Natural fluorescence\nIt is important to analyse samples for natural fluorescence as\nquickly as possible after sampling as it is known that fluorescence\nmay change over time and this may be related to many factors\n(e.g. microbial activity, oxygen availability, temperature in\nsampler) which make the magnitude of change for any given\nsample very difficult to predict. Therefore the data presented here\nare restricted to storm 2 (Table 1) for which the period between\nsampling to analysis was <3 days.\nSpatial sampling in a nearby first order catchment has shown\nthat drainage waters not directly contaminated by farm waste\nhave TI : FI ratios of 0.3 to 0.4; at the RERP subsequent\nsampling of non-slurry affected lysimeters gave mean TI : FI\nratio of 0.45 (\u00060.01). For the samples discussed here, the mean\nvalue of TI : FI in inter-flow from the zero-slurry lysimeter was\n0.37 (\u00060.00) while mean values from the two lysimeters which\nreceived slurry were higher, one marginally so at 0.41 (\u00060.01)\nwhile the other was much higher at 0.80 (\u00060.06). Similarly mean\nvalues recorded in the inter-flow of the drained lysimeters were\nthe same (0.47 (\u00060.02)) or higher (0.59 (\u00060.03)) from slurry-\namended lysimeters compared to the zero-slurry lysimeter\n(0.49 (\u00060.1)). Mean values of TI : FI from the drain-flow appear\nto be more consistently affected by the presence of slurry; the\nvalue from the zero-slurry lysimeter was 0.41 (\u00060.00), while\nvalues from the two slurry-amended lysimeters were 0.53 (\u00060.01)\nand 0.61 (\u00060.02). This suggests some evidence for the loss of\nslurry-derived material in a dissolved phase during event 2.\nHowever, results from the tray experiment indicate that within\n4–5 weeks much of the natural fluorescence signal from the slurry1166 | J. Environ. Monit., 2010, 12, 1159–1169(TI and FI) has been lost and the results from the TI : FI are\ntherefore inconclusive.Isotopic response\nNo significant difference in the d13C of the soil was found\nbetween lysimeters at the RERP and therefore a grand mean of\n\u000228.7& (\u00060.2) is taken to represent the d13C of the soil at the\nsite. Slurry was applied to the lysimeters at two distinct times,\nwith the drained lysimeters receiving an application of grass and\nmaize slurry one week before the undrained lysimeters. The d13C\nof the grass slurries were \u000228.2& (\u00060.3) and \u000227.3& (\u00060.1)\napplied to drained and undrained lysimeters respectively, while\nthe maize slurries had d13C values of\u000218.9& (\u00060.2) and\u000218.0&\n(\u00060.2) having a higher d13C value of \u00049& which is less than\nreported elsewhere.12\nSummary values of d13C measured in material >0.7 and\n<0.7 mm leaving the lysimeters are presented in Table 1. There\nwere no overall significant relationships between the d13C of the\n<0.7 and >0.7 mm fractions. Variation in d13C values is greatest in\nthe <0.7 mm fraction compared to the >0.7 mm fraction and both\nfractions show no clear trends occurring within individual storm\nevents. There were also no clear trends in the d13C of >0.7 and\n<0.7 mm fractions across the three events in the inter-flow of both\nthe undrained and drained lysimeters. However, due to auto-\nsampler failure no data from event 1 on the maize slurry-amen-\nded and event 3 on the grass slurry-amended drained lysimeters\nwere collected from this pathway on the drained lysimeters which\nmake it impossible to delineate trends. Values of d13C from the\ndrain-flow pathway of the drained lysimeters do, however, show\na consistent trend across all three events in both the grass and\nmaize slurry-amended lysimeters. Here values of d13C in both\n>0.7 and <0.7 mm material become lower with each subsequent\nevent (Fig. 4). The trend is clearest in the >0.7 mm material and\nless so in the <0.7 mm fraction, which is strongly influenced by\na few samples which have a far higher d13C than the bulk of the\ndata especially during event 1. This trend of lower values across\nsubsequent storms does not appear to be affected by the slurry\ntreatment.\nTo establish what slurry-derived organic material is leaving the\nlysimeters a comparison between the d13C of lysimeters that\nreceived grass slurry and naturally enriched maize slurry was\nmade. To do this the mean value of d13C (\u00062 standard errors)\nfrom the maize slurry-amended lysimeters during each event was\ntaken and compared to the mean obtained from the grass slurry-\namended lysimeters from the corresponding event and pathway\n(Fig. 4). The >0.7 and <0.7 mm materials obtained from the\nundrained lysimeter were similar in that although there were\napparent differences between grass and maize slurry treatments,\nthere was no specific direction to the trends. A more pronounced\ntrend was observed in the d13C of material derived from the\ndrain-flow of the drained lysimeter. The d13C values of the\n>0.7 mm fraction from the maize slurry lysimeter were always\nhigher relative to that from the grass slurry lysimeter. This\nincrease was only markedly different during events 2 and 3 with\nincreases of 0.6& (\u00060.20 standard error of the difference (SED))\nand 0.9& (\u00060.16 SED) respectively. The reverse was true for the\nd13C values of the <0.7 mm material which were higher from the\ngrass slurry lysimeter relative to the maize slurry lysimeter:This journal is ª The Royal Society of Chemistry 2010\nFig. 4 Mean d13C (\u00062 standard errors) of the <0.7 and >0.7 mm material in waters from the undrained and drained lysimeters which received an\napplication of either grass or maize based slurry.2.1& (\u00060.68 SED) and 3.2& (\u00060.37 SED) for events 2 and 3\nrespectively. Assuming that the increase in d13C of the >0.7 mm\nparticles was caused as a result of maize slurry material becoming\nentrained in the drain-flow; it is estimated that between 6% (\u00062)\nand 10% (\u00062) of this material originated from the slurry during\nevents 2 and 3 respectively.\nWhat is less clear is why an unexpected and counter intuitive\ndifference in d13C values was present within the <0.7 mm fraction\nderived during events 2 and 3. We have no simple explanation for\nthis behaviour. The above observation may point to the fact that:\n(i) the maize slurry was not homogeneously naturally enriched\nwith the <0.7 mm fraction being less labelled than the particulate\n>0.7 mm fraction, (ii) the finer material of the surface applied\n<0.7 mm fraction is predominantly held in the soil matrix at the\nsoil surface, hence what is found in the drains is soil derived\nmaterial which might have a different d13C value between the two\nplots, (iii) the <0.7 mm material contained forms of C that were\nsignificantly different in their isotopic composition from that of\nC3 and C4 plant matter in the slurry; this material may have been\nsourced from either, or both, of the slurries themselves or from\nthe soil\/soil–water system or (iv) the differential fractionation in\nthe soil of the <0.7 and >0.7 mm material differs between maize\nand grass slurry.34 All of these tentative suggestions partly\ncounter the assumption on which the natural abundance label-\nling technique is based35 and require further investigation.Analysis of the tracing approaches\nThe effectiveness of any tracer is wholly dependent on the degree\nto which it represents the material that is being traced. All the\ntracers being applied to this study are novel to some extent;\nnatural fluorescence signals at the field lysimeter scale have not\nbeen widely studied and reported previously, artificial fluorescent\nparticles have been used previously but not in the terrestrial\nenvironment, while natural abundance C isotopes have been used\npreviously to assess the contribution of dung derived C to soil\nsystems but not to aquatic ones nor at this scale. To evaluate fullyThis journal is ª The Royal Society of Chemistry 2010the effectiveness of the tracers being used we need to reconsider\nthe strengths and limitations of the individual approaches.\nThe artificial fluorescent particles appear to have been\na success in terms of improving our understanding of the\nprocesses and pathways that organic material sourced from\nagricultural amendments follow. However, while these particles\nmay mimic the size and density of a large fraction of slurry\nparticles there are other aspects which remain uncertain such as\nthe shapes of slurry particles and the nature of their surface\ncharge (the particles being manufactured with a positive charge).\nThis obviously has implications for the way such particles may\nflocculate and move,36 however, unpublished data indicate that\nthe particles do adsorb natural charge and therefore behave\nsimilarly when looking at hydraulic and flocculation processes\n(J. K. Marsh, personal communication). Furthermore, the\ndistribution and number of tracer particles mixed with the slurry\nmay not represent the distribution and number of particles\nwithin the slurry, and counts of particles in drainage water were\nmade irrespective of particle size. Therefore it is uncertain\nwhether the sizes of particles yielded in drainage are represen-\ntative of the initial tracer as a whole or whether one particular\nsize range dominates. Additionally, to better understand the\nconsequences of slurry particle movement more information is\nneeded on what pollutants are associated with these particles.\nWhile natural abundance C isotopes have been used as tracers\nwith a great deal of success elsewhere,37 results from this appli-\ncation of the technique were inconclusive. This may have resulted\nfrom the low initial slurry application reducing the strength of\nthe maize slurry d13C signal, or may be a consequence of the long\ndry period between slurry application and drainage causing\nslurry-derived material to be (partly) decomposed or sorbed onto\nsoil surfaces. Furthermore, the nature of the label within the C4\nslurry was uncertain, appearing to be only partly labelled with\na d value of \u000218& compared to other C4 slurries with d values of\nca. \u000212&.12 Unlike direct excreta, slurry is a complex composite\nof potentially many materials and while the ‘particulates’ in the\nslurry might be considered to represent pieces of undigested or\npartially digested C4 plant material and therefore fully labelled,J. Environ. Monit., 2010, 12, 1159–1169 | 1167\nthe colloidal and soluble components may represent material not\nsourced from the C4 substrate and therefore not labelled to the\nsame extent. These different size fractions are also subject to\ndifferent processes and rates of decomposition,38 with smaller\norganic particles being metabolised differently to larger ones.\nOther issues were methodological such as the separation of the\n>0.7 and <0.7 mm material. Collecting and analysing >0.7 mm\nmaterial collected on GF\/F papers severely restrict the mass of\nactual particulate material available to the MS and although\nincreasing the volume of sample filtered would have increased the\namount of particulate C on the filters, they would become rapidly\nclogged leading to large sample preparation times and the\nretention of material <0.7 mm. Furthermore, the freeze-dried\n<0.7 mm material represented a composite of all colloids and\nsolutes <0.7 mm, thus may have contained a component of\ninorganic C, which if present may have increased the d13C values.\nNatural fluorescence has potential to act as an indicator for\nslurry-derived material, however, the nature of the signal is time\ndependent and probably only persists for 3–4 weeks after slurry\napplication. Thus, only direct losses may be traced using natural\nfluorescence rather than any longer term impacts. There is also\na requirement for the samples to be analysed quickly after sampling\nwhich may also limit the potential applications of the technique.Conclusions\nThe artificial fluorescent particles show that organic slurry\nparticles have the potential to move readily from land to water\nand numbers increase and decrease withQ. Particles were lost via\nthe inter-flow pathway of both the undrained and drained\nlysimeters. Where both inter-flow and drain-flow pathways were\npresent the drain-flow carried the greater number.\nNatural fluorescence TI : FI ratios were inconclusive.\nAlthough ratios were higher in slurry-amended lysimeters when\ncompared to the zero-slurry lysimeter, given the time interval\nbetween the application of slurry and the monitored runoff it is\nlikely that most of the natural fluorescence signal from the slurry\nper se would have been lost.\nThe data obtained from the stable C isotope tracing approach\nwere also inconclusive. The d13C of both particulate and dissolved\nphases were highly variable over time and only the particulate\nmaterial in the drain-flow appeared to carry a slurry signature.\nWhile many questions have been raised concerning the inter-\npretation of the evidence from individual tracers, the simulta-\nneous use of multiple tracers has been useful in helping to\ncorroborate the available evidence. One of the main limitations\nin the experiment was the low application rate of slurry and\nfurther work needs to be carried out using a higher rate of\napplication. Another limitation was the length of time between\nthe applied slurry and the first rainfall event which meant that the\nuse of some of the tracers was limited. There is a need to follow\nthis up by more controlled experiments looking specifically at the\nmechanisms behind the tracers and the environmental processes\nthrough which they are changed.Acknowledgements\nThe work was supported through a Department of Environment,\nFisheries and Rural Affairs (Defra) grant (PE0120). The first1168 | J. Environ. Monit., 2010, 12, 1159–1169author acknowledges the support of Cranfield University and\nNorth Wyke Research through his PhD studentship award as\nwell as advice from Dr Phil Owens of the University of Northern\nBritish Columbia. North Wyke Research is grant aided by the\nBiotechnology and Biological Sciences Research Council\n(BBSRC). We acknowledge the work of Tobias Krueger, Dr Jim\nFreer, Dr John Quinton (University of Lancaster), and Dr Kit\nMacleod (N. Wyke) in establishing the flow measurements and\nuncertainties for the RERP.References\n1 P. S. Hooda, A. C. Edwards, H. A. Anderson and A.Miller, Sci. Total\nEnviron., 2000, 250, 143–167.\n2 D. J. Conley, H. W. Paerl, R. W. Howarth, D. F. Boesch,\nS. P. Seitzinger, K. E. Havens, C. Lancelot and G. E. Likens,\nEcology, 2009, 323, 1014–1015.\n3 A. L. Heathwaite, in Phosphorus Loss from Soil to Water, ed.\nH. Tunney, O. T. Carton, P. C. Brookes and A. E. Johnson, CAB\nInternational, Wallingford, UK, 1997, pp. 205–223.\n4 K. A. Smith, A. G. Chalmers, B. J. Chambers and P. Christie, Soil Use\nManag., 1998, 14, 154–159.\n5 R. W. McDowell and A. N. Sharpley, Sci. Total Environ., 2001, 278,\n113–125.\n6 K. A. Smith, C. P. Beckwith, A. G. Chalmers and D. R. Jackson, Soil\nUse Manag., 2002, 18, 428–434.\n7 R. W. McDowell, D. M. Nash and F. Robertson, J. Environ. Qual.,\n2007, 36, 1281–1288.\n8 P. M. Haygarth, G. S. Bilotta, R. Bol, R. E. Brazier, P. J. Butler,\nJ. Freer, L. J. Gimbert, S. J. Granger, T. Krueger,\nC. J. A. Macleod, P. Naden, G. Old, J. N. Quinton, B. Smith and\nP. Worsfold, Hydrol. Processes, 2006, 20, 4407–4413.\n9 S. J. Granger, R. Bol, P. J. Bulter, P. M. Haygarth, P. Naden, G. Old,\nP. N. Owens and B. P. G. Smith,Hydrol. Processes, 2007, 21, 417–422.\n10 W. Amelung, R. Bol and C. Friedrich, Rapid Commun. Mass\nSpectrom., 1999, 13, 1291–1294.\n11 R. Bol, W. Amelung, C. Friedrich and N. Ostle, Soil Biol. Biochem.,\n2000, 32, 1337–1343.\n12 J. A. J. Dungait, R. Bol and R. P. Evershed, Isot. Environ. Health\nStud., 2005, 41, 3–11.\n13 B. Glaser, R. Bol, N. Preedy, K. McTiernan, M. Clark and\nW. Amelung, J. Plant Nutr. Soil Sci., 2001, 164, 467–474.\n14 J. K. Marsh, A. J. Bale, R. J. Uncles and K. R. Dyer, Proceedings of\nthe International Symposium on the Transport of Suspended Sediments\nand its Mathematical Modelling, International Association of\nHydraulic Research, Florence, Italy, 2–5 September, 1991, pp. 665–\n681.\n15 J. K. Marsh, A. J. Bale, R. J. Uncles and K. R. Dyer, in\nGeomorphology and Sedimentology of Lakes and Reservoirs, ed.\nJ. McManus and R. W. Duck, John Wiley and Sons Ltd,\nChichester, 1993, pp. 139–153.\n16 P. McComb and K. Black, J. Coastal Res., 2005, 21, 358–373.\n17 N. Hudson, A. Baker and D. Reynolds, River Res. Appl., 2007, 23,\n631–649.\n18 A. Baker, Water Res., 2002, 36, 189–195.\n19 D. B. Boorman, J. M. Hollis and A. Lilly,Hydrology of Soil Types: A\nHydrologically Based Classification of the Soils of the United Kingdom,\nInstitute of Hydrology, Wallingford, Oxfordshire, 1995, report No.\n126.\n20 D. Scholefield, K. C. Tyson, E. A. Garwood, A. C. Armstrong,\nJ. Hawkins and A. C. Stone, J. Soil Sci., 1993, 44, 601–613.\n21 A. C. Armstrong and E. A. Garwood, Hydrol. Processes, 1991, 5,\n157–174.\n22 G. S. Bilotta, R. E. Brazier, P. M. Haygarth, C. J. A. Macleod,\nP. Butler, S. Granger, T. Krueger, J. Freer and J. Quinton,\nJ. Environ. Qual., 2008, 37, 906–914.\n23 T. Krueger, J. N. Quinton, J. Freer, C. J. A. Macleod, G. S. Bilotta,\nR. E. Brazier, P. Butler and P. M. Haygarth, J. Environ. Qual., 2008,\n38, 1137–1148.\n24 Defra, Code of Good Agricultural Practice for the Protection of Water,\nDefra Publications, London, 2002.This journal is ª The Royal Society of Chemistry 2010\n25 S. J. Eisenreich, R. T. Bannerman and D. E. Armstrong, Environ. Res.\nLett., 1975, 9, 43–53.\n26 UK Standing Committee of Analysts, Suspended, Settleable and Total\nDissolved Solids in Waters and Effluents, HMSO, London, 1980.\n27 N. V. Blough, O. C. Zafiriou and J. Bonilla, J. Geophys. Res.,\n[Oceans], 1993, 98, 2271–2278.\n28 J. R. Lakowicz, Principles of Fluorescence Spectroscopy, Plenum\nPress, New York, 1983.\n29 A. J. Lawaetz and C. A. Stedmon,Appl. Spectrosc., 2009, 63, 936–940.\n30 P. S. Naden, G. H. Old, C. Eliot-Liaze, S. J. Granger,\nJ. M. B. Hawkins, R. Bol and P. M. Haygarth, Water Res., in press.\n31 J. L. Monteith, in Applications of Soil Physics II, ed. D. Hillel,\nAcademic Press Incorporated, New York, 1980, pp. 247–253.\n32 B. D. Trafford and D. W. Rycroft, J. Soil Sci., 1973, 24, 380–391.This journal is ª The Royal Society of Chemistry 201033 G. L. Harris, M. J. Goss, R. J. Dowdell, K. R. Howse and P. Morgan,\nJ. Agric. Sci., 1984, 102, 561–581.\n34 R. Bol, W. Amelung, C. Friedrich, J. Lauf and M. Shephard,\nAbstracts for the 22 Jahrestagung der Arbeitsgemeinschaft Stabile\nIsotope, AS199, G€ottingen, Germany, 4–6 October, 1999, p. 70.\n35 J. Balesdent and A. Mariotti, Soil Biol. Biochem., 1987, 19, 25–30.\n36 I. G. Droppo, Hydrol. Processes, 2001, 15, 1551–1564.\n37 W. Amelung, S. Brodowski, A. Sandhage-Hofmann and R. Bol, Adv.\nAgron., 2008, 100, 155–250.\n38 D. Fangueiro, D. Chadwick and R. Bol, J. Plant Nutr. Soil Sci., 2008,\n171, 313–315.\n39 S. J. Granger, G. Bilotta, R. Bol, P. Butler, P. M. Haygarth,\nT. H. E. Heaton and P. N. Owens, Rapid Commun. Mass\nSpectrom., 2008, 22, 1681–1689.J. Environ. Monit., 2010, 12, 1159–1169 | 1169\n"}