{"doi":"10.1007\/s10646-009-0352-z","coreId":"60262","oai":"oai:nora.nerc.ac.uk:7676","identifiers":["oai:nora.nerc.ac.uk:7676","10.1007\/s10646-009-0352-z"],"title":"Do estuaries pose a toxic contamination risk for wading birds?","authors":["Smith, J.T.","Walker, L.A.","Shore, R.F.","Durell, S.E.A. Le V. dit","Howe, P.D.","Taylor, M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-10","abstract":"The impact of potentially toxic chemicals on wildlife is commonly assessed by comparing the intake of the contaminant with the “no observable effects level” (NOAEL) of intake. It is known, however, that there are considerable uncertainties inherent in this method. This study presents a Monte-Carlo based model to assess the degree of risk posed to birds (dunlin, Calidris alpina) from important estuarine habitats, and to show the limitations of such risk assessments, particularly with regard to data availability. The model was applied to predict the uptake of metals (Hg, Pb) in this shorebird species in Poole Harbour and the Severn Estuary\/Bristol Channel, UK, two internationally important shorebird habitats. The results show that in both areas, Pb and Hg concentrations may pose an ecologically relevant toxic risk to wading birds. For Pb, uncertainty in NOAEL values dominates the overall uncertainty. Use of lethal toxicity data (LD50\/100) was investigated as a method for assessing sub-lethal impacts from Hg. It was found that this method led to a significant under-estimate of the potential impact of Hg contamination, compared with direct estimation of NOAEL","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/60262.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/7676\/2\/SmithN007676PP.pdf","pdfHashValue":"c61670ffd173d7faae1c3174575245ba421caf15","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:7676<\/identifier><datestamp>\n      2012-11-22T12:05:19Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533236<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/7676\/<\/dc:relation><dc:title>\n        Do estuaries pose a toxic contamination risk for wading birds?<\/dc:title><dc:creator>\n        Smith, J.T.<\/dc:creator><dc:creator>\n        Walker, L.A.<\/dc:creator><dc:creator>\n        Shore, R.F.<\/dc:creator><dc:creator>\n        Durell, S.E.A. Le V. dit<\/dc:creator><dc:creator>\n        Howe, P.D.<\/dc:creator><dc:creator>\n        Taylor, M.<\/dc:creator><dc:subject>\n        Zoology<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        The impact of potentially toxic chemicals on wildlife is commonly assessed by comparing the intake of the contaminant with the “no observable effects level” (NOAEL) of intake. It is known, however, that there are considerable uncertainties inherent in this method. This study presents a Monte-Carlo based model to assess the degree of risk posed to birds (dunlin, Calidris alpina) from important estuarine habitats, and to show the limitations of such risk assessments, particularly with regard to data availability. The model was applied to predict the uptake of metals (Hg, Pb) in this shorebird species in Poole Harbour and the Severn Estuary\/Bristol Channel, UK, two internationally important shorebird habitats. The results show that in both areas, Pb and Hg concentrations may pose an ecologically relevant toxic risk to wading birds. For Pb, uncertainty in NOAEL values dominates the overall uncertainty. Use of lethal toxicity data (LD50\/100) was investigated as a method for assessing sub-lethal impacts from Hg. It was found that this method led to a significant under-estimate of the potential impact of Hg contamination, compared with direct estimation of NOAEL. <\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2009-10<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/7676\/2\/SmithN007676PP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Smith, J.T.; Walker, L.A.; Shore, R.F.; Durell, S.E.A. Le V. dit; Howe, P.D.; Taylor, M..  2009  Do estuaries pose a toxic contamination risk for wading birds?   Ecotoxicology, 18 (7). 906-917.  https:\/\/doi.org\/10.1007\/s10646-009-0352-z <https:\/\/doi.org\/10.1007\/s10646-009-0352-z>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/content\/72t65q3053n867u8\/<\/dc:relation><dc:relation>\n        10.1007\/s10646-009-0352-z<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/7676\/","http:\/\/www.springerlink.com\/content\/72t65q3053n867u8\/","10.1007\/s10646-009-0352-z"],"year":2009,"topics":["Zoology","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \n \n \nArticle (refereed) \n \n \n \nSmith, J.T.; Walker, L.A.; Shore, R.F.; Durell, S.E.A. Le V. dit; \nHowe, P.D.; Taylor, M.. 2009 Do estuaries pose a toxic \ncontamination risk for wading birds? Ecotoxicology, 18 (7). \n906-917. 10.1007\/s10646-009-0352-z \n \n \n \n© Springer Science+Business Media LLC 2009 \n \nThis version available http:\/\/nora.nerc.ac.uk\/7676\/  \n \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the journal \narticle, incorporating any revisions agreed during the peer review \nprocess. Some differences between this and the publisher’s version \nremain. You are advised to consult the publisher’s version if you wish \nto cite from this article. \n \nwww.springerlink.com \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnoraceh@ceh.ac.uk \n \n \n \nThe NERC and CEH  trade marks and logos (‘the Trademarks’) are registered trademarks of NERC in the UK and \nother countries, and may not be used without the prior written consent of the Trademark owner. \n1 \n \nAppeared as: Smith, J.T., L A Walker, L.A., Shore, R.F., Durell , S E A le V, Howe, P.D., \nTaylor, M. (2009). Do estuaries pose a toxic contamination risk for wading birds?  \nEcotoxicology, Vol 18, No. 7, 906-917. \n \n \nDo estuaries pose a toxic contamination risk for wading birds?   \n \n \n \nJ T Smith\na*\n, L A Walker\nb\n, R F Shore\nb\n, S E A le V dit Durell\nc\n, P D Howe\nd\n, M Taylor\ne\n. \n \n \na. School of Earth and Environmental Sciences, University of Portsmouth, Burnaby Building, \nPortsmouth PO1 3QL. * Corresponding author: E-mail: jim.smith@port.ac.uk; Tel. +44 \n(0)2392 842416; Fax: +44 (0)2392 842244. \n \nb. NERC Centre for Ecology & Hydrology, Lancaster Environment Centre, Library Avenue , \nBailrigg, Lancaster LA1 4AP, UK\n  \n \nc. 30 Bestwall Road, Wareham, Dorset BH20 4JA, UK \n \nd. Centre for Ecology and Hydrology, Monks Wood, Abbots Ripton, Huntingdon, \nCambridgeshire, PE28 2LS, UK \n \ne. Natural England, Riverside Chambers, Castle Street, Taunton, Somerset, TA1 4AP \n \n \n \n \n2 \n \nAbstract \n \nThe impact of potentially toxic chemicals on wildlife is commonly assessed by comparing the \nintake of the contaminant with the “no observable effects level” (NOAEL) of intake. It is \nknown, however, that there are considerable uncertainties inherent in this method. This study \npresents a Monte-Carlo based model to assess the degree of risk posed to birds (dunlin, \nCalidris alpina) from important estuarine habitats, and to show the limitations of such risk \nassessments, particularly with regard to data availability. The model was applied to predict \nthe uptake of metals (Hg, Pb) in this shorebird species in Poole Harbour and the Severn \nEstuary\/Bristol Channel, UK, two internationally important shorebird habitats.  The results \nshow that in both areas, Pb and Hg concentrations may pose an ecologically-relevant toxic \nrisk to wading birds. For Pb, uncertainty in NOAEL values dominates the overall uncertainty. \nUse of lethal toxicity data (LD50\/100) was investigated as a method for assessing sub-lethal \nimpacts from Hg. It was found that this method led to a significant under-estimate of the \npotential impact of Hg contamination, compared with direct estimation of NOAEL.  \n \n \nKey words: mercury, lead, probabilistic modelling, estuaries, reproductive toxicity, \ndunlin.\n3 \n \n1. INTRODUCTION 1 \n 2 \nAnalysis of uncertainty in environmental risk assessments is becoming increasingly important  3 \n(e.g. Verdonck et al., 2005). To our knowledge, however, modelling approaches have not yet 4 \nbeen developed for the assessment of uncertainty in contaminant uptake and risk in wading 5 \nbirds. Here we present a probabilistic modelling approach for risk assessment that employs 6 \necologically relevant toxicological endpoints and, crucially, data inputs (bird behaviour, 7 \nmetal content of prey items, toxicity endpoints) that are realistic for typical environmental 8 \nimpact assessments.  The Monte-Carlo based model is used to assess the degree of risk posed 9 \nto birds from important estuarine habitats, and to show the limitations of such risk 10 \nassessments, particularly with regard to data availability. 11 \n  12 \nEstuaries are typically important feeding areas for wading birds but are also often subject to 13 \nhistoric and current chemical contamination by heavy metals.  Estuarine sediments 14 \ncommonly form major sinks for contaminants released during industrial activity. Many 15 \nindustrial processes lead to the release of metals initially in solution, which can then be 16 \nadsorbed on to, for example, Fe hydroxides or clay minerals (Pirrie et al., 2003) and are 17 \nsubsequently deposited onto estuarine sediments. Both past mining activity and present 18 \nindustrial discharges have resulted in the accumulation of metals in estuarine sediment. 19 \n 20 \nThe Severn Estuary\/Bristol Channel and Poole Harbour (Figure 1) are two major UK 21 \nestuaries and are classified as Special Protection Areas (SPAs) under the European Wild 22 \nBirds Directive.  During the winter, they support nationally and internationally important 23 \nnumbers of overwintering shorebirds (Pickess and Underhill-Day, 2002; Pollitt et al., 2003). 24 \nHowever, both areas are typical of estuaries in that they have previously been subject to 25 \nsignificant metal contamination.  Much of the metal contamination has been adsorbed onto 26 \n4 \n \nestuarine sediments and as a consequence concentrations of heavy metals in sediments 27 \nusually exceed those of the overlying water by between three and five orders of magnitude. 28 \nWith such high concentrations, the bioavailability of even a small fraction of the total 29 \nsediment metal can lead to uptake by filter-feeding and burrowing organisms (Bryan and 30 \nLangston, 1992). Furthermore, several metals, including mercury and lead, may be 31 \ntransformed in sediments to organometallic compounds which have greater bioavailability. 32 \nThese factors can result in accumulation of heavy metals by wading birds feeding in these 33 \nareas (Bryan and Langston, 1992; Ferns and Anderson, 1997). Although there is evidence 34 \nthat metal contamination is declining in both Poole Harbour (Langston, 2003a) and the 35 \nSevern Estuary (Duquesne et al., 2006; Langston et al., 2003b), the current levels of 36 \ncontamination suggest that they could still potentially have an impact on wildlife.   37 \n 38 \nAssessment of the potential risk to wading birds posed from contamination has rarely been 39 \ncarried out, except where there have been specific spills or industrial incidents (Bull et al., 40 \n1983); (Pain et al., 1998).  The aim of the current paper is to use the Severn Estuary and 41 \nPoole Harbour as model systems (for which relatively good empirical data are available) to 42 \nassess the potential risk posed to wading birds from long-term metal contamination in 43 \nestuaries. A Monte Carlo analysis will be carried out to estimate the probability that the 44 \nwading bird population is over-exposed to Pb and Hg in the two estuaries. 45 \n 46 \nMETHODS 47 \n 48 \nThe variability in population-averaged risk to dunlin, Calidris alpine, was assessed using a 49 \nscenario approach.  This species was selected because data on its diet selection and habitat 50 \nuse are available for both estuaries. Modelling was carried out in both estuaries for two 51 \n5 \n \nscenarios: the „Average‟ Scenario and the „Worst Case‟ scenario. The „Average‟ Scenario 52 \nrepresents the best estimate and range of possible PPC\/PNEC (predicted prey 53 \nconcentration\/predicted no effect concentration in prey) values for the average bird, which is 54 \nassumed (over a season) to have a dietary intake of contaminants equal to the mean 55 \nconcentration in prey across all the sites studied. The „Worst Case‟ scenario assumes a 56 \njuvenile bird (which has a lower ratio of body weight to food intake rate and hence a higher 57 \nPPC\/PNEC) feeding exclusively at the most contaminated site in each estuary. 58 \n 59 \nFor each of these scenarios, the uncertainty in predicted PPC\/PNEC value was determined by 60 \nMonte Carlo analysis after assigning uncertainties to each model input parameter based on 61 \nevaluation of empirical data. 62 \n 63 \nSelection of contaminants to be modelled 64 \nAn initial screening exercise was carried out to determine which contaminants to focus on in 65 \nsubsequent modelling. This was carried out by calculating the Predicted Environmental 66 \nConcentration (PEC) and the Predicted No Effect Concentration (PNEC) in birds for each 67 \ncontaminant. The PEC in this case was the predicted concentration of the contaminant in the 68 \nprey of the birds and is in this paper termed the PPC.  The ratio of the PPC to the PNEC was 69 \ncalculated as:  70 \n  71 \nPNEC\nPPC\n         (1) 72 \n 73 \nwhere values of this ratio above 1 imply a toxic risk. A key prey item, ragworms (Nereis 74 \ndiversicolor), were sampled from 12 sites in Poole Harbour and 13 sites in the Severn Estuary 75 \n(Environment Agency, unpubl. res.). It was assumed (for the purposes of the initial screening 76 \n6 \n \nexercise only) that contaminant concentrations in Nereis diversicolor were representative of 77 \nthose in the range of different prey items in each estuary, though in the full uncertainty 78 \nanalysis below, other prey types (earthworms, molluscs and crustaceans) were also 79 \nconsidered. Estimates of PPC\/PNEC were made for each of the organic and inorganic 80 \ncontaminants measured in Nereis. The results of this screening exercise are presented in the 81 \nSupplementary Material (Tables S1 and S2). Seven compounds (all metals or semi-metals) 82 \nhad maximum PPC\/PNEC ratios ≥ 1: zinc (Zn), lead (Pb), mercury (Hg), selenium (Se), iron 83 \n(Fe), arsenic (As), and chromium (Cr) for at least one of the sites.  Fe was not determined in 84 \nthe Severn Estuary and Se was not determined in Poole Harbour. The source toxicity data 85 \nused in calculating the screening PPC\/PNEC ratios were then examined in detail to determine 86 \nif they were experimentally sound (if they fulfilled the criteria set out in the Toxicity Data 87 \nSection below) and if the endpoints were ecologically relevant. Using these criteria, only Pb 88 \nand Hg were selected for subsequent detailed modelling.  89 \n 90 \nModel input data 91 \n 92 \nBird distribution and diet 93 \nBird habitat use and feeding behaviour were estimated using a combination of a foraging 94 \nmodel which accounts for the different utilisation of feeding sites within an estuary (Stillman 95 \net al., 2005; Durell et al., 2006), the Wetland Bird Survey (WeBS) data and other literature 96 \ndata (Goss-Custard et al., 1988; Worrall, 1984). The proportion of different prey types taken 97 \nby the birds and their associated uncertainty estimates are shown in Table 1. Earthworms 98 \ncomprise a significant part of the diet for some shorebird species, but in these estuaries dunlin 99 \ndo not consume significant proportions of earthworms in their diet.  In Poole Harbour, dunlin 100 \nhave not been observed to eat earthworms (Durell et al., 2006), the major proportion of the 101 \n7 \n \ndiet of adult dunlin being marine worms, the rest being made up of molluscs and crustaceans. 102 \nIn the Severn Estuary, earthworms are estimated to form less than 10% of their diet. Juvenile 103 \ndunlin (Table 1) take similar food types to adults.  104 \n 105 \nDietary lead and mercury concentrations 106 \nThe data on Pb and Hg concentrations in Nereis diversicolor used in our model comprised 107 \nnot only new measurements (Environment Agency, unpubl. res.)) but also data from reviews 108 \nof contamination in Poole Harbour and the Severn Estuary (Langston et al., 2003b), 109 \nSupplementary Material,  Tables S3-S6). Assumed ranges and estimates of uncertainty in 110 \nmetal concentrations used in the model are summarised in Table 2. For prey items other than 111 \nNereis, uncertainties in metal concentrations were estimated from data in the reviews, taking 112 \naccount of the known decline in metal contamination over time. 113 \n 114 \nFor the worst-case scenario, it was assumed that the mean concentration of Pb and Hg in 115 \nNereis was equal to the highest value measured at any of the sites in each harbour with 116 \nuncertainty being normally distributed with coefficient of variation of 25%. Based on the 117 \nreview of data in Tables S3 – S6, for molluscs and crustaceans it was assumed (for the worst 118 \ncase scenario) that the average concentration at the most contaminated site was 3-10 times 119 \nhigher (Pb, Hg - Poole Harbour; Pb - Severn Estuary) or 1-3 times higher (Hg - Severn 120 \nEstuary) than the maximum measured value in Nereis.  121 \n 122 \nMetal concentrations in earthworms (Lumbricus terrestris) 123 \nDunlin in Poole Harbour do not consume earthworms (Durell et al., 2006) and we assumed 124 \nthat this was also true for most dunlin in the Severn Estuary (Table 1). Data on Pb 125 \nconcentrations in earthworms is limited but a study of the Avonmouth smelter found 126 \n8 \n \nconcentrations in worms at an unaffected site distant from the smelter to be 27 mg kg\n-1\n (dw) 127 \n(Spurgeon, 1994).  Concentrations in worms on a control site from a separate study were 4 – 128 \n12.3 mg kg\n-1\n dw (Morgan and Morgan, 1991).   129 \nConcentrations of Hg in earthworms measured by (Bull et al., 1977) at a site uninfluenced by 130 \nindustrial activity (range 0.031-0.048 mg kg\n-1\n dw, n = 18) were generally lower than those 131 \nmeasured in estuarine biota (see Tables S4 and S6).  This suggests that, in contrast to Pb, Hg 132 \nin earthworms may have little effect on Hg intake in shorebirds. 133 \n 134 \nProportion of dietary mercury as methylmercury 135 \nThe NOAEL of methylmercury (MeHg) is approximately two orders of magnitude lower than 136 \nthat for inorganic Hg. It is therefore important to estimate the proportion of total Hg in prey 137 \nitems which is in the form of MeHg.  Muhaya et al. (1997) determined that the mean 138 \nproportion of Hg as MeHg in Nereis across 13 sites in the Netherlands was approximately 139 \n18%, but the distribution of values was highly skewed.  We therefore log-transformed these 140 \ndata (mean (±SD) log transformed proportion: 1.28 ± 0.22) and used this transformed 141 \ndistribution to generate random values for our Monte-Carlo model. The values were then 142 \nback-transformed for use in the model. 143 \n 144 \nToxicity data  145 \nA literature search was conducted to identify studies from which avian NOAELs could be 146 \nderived for inorganic and organic Pb and Hg.  We used Web of Knowledge (ISI, 2005), 147 \nEnvironmental Health Criteria (World Health Organisation, 1989a; World Health 148 \nOrganisation, 1989b; World Health Organisation, 1990; World Health Organisation, 1991), 149 \nUS EPA ECOTOXicology database (U.S. Environmental Protection Agency, 2002), and a 150 \nnumber of US EPA reports (Sample et al., 1997; U.S. Environmental Protection Agency, 151 \n9 \n \n1999; U.S. Environmental Protection Agency, 2005) as reference sources.  Where possible, 152 \nthe original papers or reports were assessed, and three criteria were used to decide whether the 153 \nNOAEL values could be included in our models.  These were:   154 \n(i) effects on reproduction and growth are more likely to affect population densities than 155 \nlower order effects and in some cases are the integrated response to a range of physiological 156 \nand biochemical effects.  Thus, NOAELs based on reproduction and growth end-points were 157 \nincluded but those based on physiological, metabolic, biochemical and other lower level end-158 \npoints were rejected.  This selection procedure also increased the likelihood of finding 159 \nsufficient toxicity data for our model as there were unlikely to be multiple studies that used 160 \nexactly the same physiological and biochemical endpoints.  161 \n(ii) use of only one NOAEL from a study when multiple NOAELs were derived from the 162 \nsame test, thereby avoiding pseudo-replication (when multiple NOAELs were derived in the 163 \nsame study  but from different tests, all values were included). 164 \n(iii) studies in which the highest exposure level was assumed to be the NOAEL were excluded 165 \nbecause no effects were observed at any exposure level.   166 \n 167 \nThe value of a NOAEL and Lowest Observed Adverse Effect Levels (LOAELs) is partly 168 \ndetermined by the experimental design of the study if, in the case of NOAELs,  no effect is 169 \nobserved at the highest dose administered  or, in the case of LOAELs, an effect is observed at 170 \nthe lowest dose administered. Using NOAELs derived in such studies may give an over-171 \nestimate of the toxicity of a contaminant while using LOAELs may under-estimate the 172 \ntoxicity. NOAELs were used in this study as a precautionary approach in assessing risk to 173 \nwading birds. Even the studies reporting NOAELs for the effects of Pb and Hg on 174 \nreproduction and growth are sparse in number. Therefore, we also included studies which 175 \nreported chronic Lowest Observed Adverse Effect Levels (LOAELs) for appropriate end-176 \n10 \n \npoints and also investigated the use of LD50 values.  Chronic LOAELs were divided by 10 177 \nand LD50s were divided by 100  to approximate them to chronic NOAELs, following 178 \n(USACHPPM, 2000). 179 \n 180 \nThe ranges in NOAEL used in our models are summarised in Table 3, and the individual data 181 \nare presented in Table S7 in the Supplementary Material: this table also gives information on 182 \nthe species on which the tests were conducted.  For Pb, we found only four studies that met 183 \nour selection criteria for NOAELs.  There are few avian lethality tests for inorganic Pb and, 184 \nfor those test that have been done, LC50 values typically exceed the highest experimental 185 \ndose (≥ 5000 mg Pb\/kg food).  Although we found two avian LD50 values for tetraethyl lead, 186 \nthere appear to be large differences in toxicity between tetraethyl Pb and Pb salts and so we 187 \ndid not use the data for tetraethyl Pb in our model.  For Hg, we found five values (two for 188 \ninorganic Hg, three for Me-Hg) of chronic NOAELs.  Seven further NOAELs (six for MeHg, 189 \none for inorganic Hg) were derived from LD50 values.  For MeHg, there are LD50 values for 190 \nHg for six species of bird (multiple values for most species). We calculated a geometric mean 191 \nLD50 for each species, then, divided these figures by 100 to convert them to chronic 192 \nNOAELs. The range of NOAELs derived in this way was 0.195 to 0.378 mg kg\n-1\n day\n-1\n, at 193 \nleast one order of magnitude higher than experimentally-derived chronic NOAELs for methyl 194 \nmercury dicyandiamide based on reproductive end-points. 195 \n 196 \nModelling 197 \nThe PPC\/PNEC approach was used for the more detailed modelling of Hg and Pb impacts. 198 \nThe PPC was predicted using: 199 \n 200 \ni\niiCfPPC      (2) 201 \n11 \n \n 202 \nwhere fi  is the fraction of the birds‟ diet composed of prey item i and Ci is the concentration 203 \n(mg kg\n-1\n dw) of the metal in prey item i. 204 \n 205 \nThe PNEC was estimated using  206 \n 207 \nDW\/day) (kg FIR\n(kg)BW BW\/day) gNOAEL(mg\/k\nPNEC    (3) 208 \n 209 \nwhere NOAEL is the no observable adverse effect level, BW is the bird body weight and FIR 210 \nis the average daily food intake rate. PPC\/PNEC ratios are calculated on a dry weight basis. .  211 \n 212 \nA Monte-Carlo model was programmed in Microsoft Excel using, where appropriate, 213 \nMicrosoft Visual Basic macros. Using the available data, we ran the Monte-Carlo model to 214 \nestimate ranges in possible PPC\/PNEC values. A total of 10 000 random values were 215 \ngenerated for each variable.  These were based on a normal (or lognormal, as appropriate) 216 \ndistribution about a mean where data were available to determine the mean and uncertainty. 217 \nWhen there were insufficient data to estimate probability distributions, a uniform distribution 218 \nacross the range in observed parameter values was assumed. An additional step was 219 \nintroduced into the model for Hg which was to estimate the fraction of total Hg made up by 220 \nMeHg.  A model sensitivity analysis was carried out by first assigning to each of the input 221 \nparameters its mean value (c.f. Cox et al., 2006). Individual input parameters were then 222 \nassigned random values within their uncertainty distributions for 10 000 model runs to 223 \ndetermine the impact of uncertainty in each input parameter on the predicted PPC\/PNEC 224 \nvalue. 225 \n 226 \n12 \n \nThe daily food intake rate (FIR) was estimated using empirical relationships between food 227 \nintake rate and body weight (BW) (Nagy, 2001). For shorebirds, gulls and auks the daily food 228 \nintake (FIR; DW, kg d\n-1\n) is estimated by regression from data for 15 species in (Nagy, 2001) 229 \ngiving: 230 \n 231 \n77.0)BW(11.0FIR          (4) 232 \n 233 \n(n=15, R\n2\n=0.86, p < 0.001). The residuals in this model were approximately lognormally 234 \ndistributed with mean (of logged ratios model:measured) 0 and standard deviation (of logged 235 \nratios) 0.123. The regression equation and distribution of residuals was used to determine the 236 \nbest estimate and uncertainty in FIR for dunlin. 237 \n 238 \nResults  239 \n 240 \nThe model gives the probability distribution of estimated PPC\/PNEC values based on 10 000 241 \nmodel runs for each estuary and scenario. An example of the model output for Pb in Poole 242 \nHarbour („Average‟ Scenario) is shown in Figure 2, and for Hg in the Severn Estuary in 243 \nFigure 3. All of the model outputs were summarised as the median, 5\nth\n and 95\nth\n percentile 244 \nvalues of PPC\/PNEC in Poole Harbour and the Severn Estuary (Table 4).  245 \n 246 \nLead 247 \nFor the „Average‟ Scenario, median PPC\/PNEC values for Pb were 2.0 and 6.5 for Poole 248 \nHarbour and the Severn Estuary respectively (Figure 4). The lowest 5 percentile value was 249 \nless than 1 in both estuaries, but the highest 95 percentile values were 22 and 75 in Poole 250 \nHarbour and the Severn Estuary respectively. For the „Worst Case‟ scenario, median 251 \n13 \n \nPPC\/PNEC values were only slightly higher than for the „Average‟ Scenario; however, 95 252 \npercentile values were significantly higher, ranging up to 121. 253 \n 254 \nMercury 255 \nPPC\/PNEC estimates for both estuaries are shown in Figure 5. There were sufficient 256 \necotoxicological data to compare the PPC\/PNEC ratios for MeHg based either on 257 \nexperimentally-derived NOAELs or on the much higher approximated values calculated as 258 \nLD50\/100 (Table 3).   The predicted PPC\/PNEC ratios were much higher when based on 259 \nexperimentally derived NOAELs than when based on the LD50\/100 (Figure 5).  When the 260 \nPNEC was estimated using the LD50\/100, Hg would not be predicted to have any 261 \nenvironmental impact on birds in either estuary, since PPC\/PNEC values were lower than 1 262 \n(with a probability of > 95%). In contrast, there is a significant (i.e. >5%) probability that 263 \nPPC\/PNEC values for Hg based on the experimentally derived NOAEL are greater than 1 in 264 \nboth Poole Harbour and the Severn Estuary. Nevertheless, PPC\/PNEC values for Hg (18% 265 \nMeHg, based on NOAEL) are much lower than for Pb in Poole Harbour with the median 266 \nPPC\/PNEC being close to 1 for both „Average‟ and „Worst Case‟ scenarios.  267 \n 268 \nSensitivity Analysis 269 \n 270 \nWe have evaluated the sensitivity of the model to uncertainty in different input parameters. 271 \nIllustrative results of different sensitivity analyses are discussed here.  272 \n 273 \nThere is a very large uncertainty in the NOAEL for Pb; this varies approximately uniformly 274 \nover a range spanning two orders of magnitude (Figure 6). As illustrated in Figure 6, this 275 \nuncertainty in NOAEL dominates the uncertainty in the PPC\/PNEC ratio for Pb when all 276 \n14 \n \nother parameters are assigned their mean value. The predicted PPC\/PNEC ratio, when only 277 \nNOAEL varies, spans a similar range to that predicted when all parameters are allowed to 278 \nvary. When the sensitivity analysis was carried out for other parameters (i.e. other individual 279 \nparameters varied whilst all other parameters assigned their mean) the variation in the 280 \npredicted PPC\/PNEC was minor (Figure 6). 281 \n 282 \nThe sensitivity analysis for Hg is illustrated in Figure 7. The PPC\/PNEC ratio for Hg is 283 \npredicted with significantly greater certainty than that for Pb with predicted PPC\/PNEC 284 \nvalues for Hg being within a range of approximately one order of magnitude. The percentage 285 \nof Hg in the form MeHg is the most important source of uncertainty in the predicted 286 \nPPC\/PNEC ratio, though uncertainty in Hg content of molluscs, FIR and NOAEL also 287 \ncontribute significantly to model uncertainty. 288 \n 289 \nThe outputs of the sensitivity analysis for different estuary scenarios showed very similar 290 \npatterns to the illustrative examples we have given for Pb and Hg in Figures 6 and 7 291 \nrespectively.  292 \n 293 \nDiscussion 294 \n 295 \nThis assessment of two estuaries showed a potential impact of Hg and Pb contamination on 296 \nshorebird communities. For the Average Scenario, there was estimated to be a greater than 297 \n50% probability that PEC\/PNEC values exceeded 1 for Pb in both estuaries and for Hg in the 298 \nSevern Estuary (Table 4). There was an approximately 40% probability that PEC\/PNEC 299 \nexceeded 1 for Hg in Poole Harbour. For the “Worst Case” scenario, probabilities of 300 \nPEC\/PNEC > 1 were 95% or greater for both metals in the Severn Estuary and 68 and 75% 301 \n15 \n \nfor Hg and Pb (respectively) in Poole Harbour. For Hg, where PNEC was calculated on the 302 \nbasis of LD50\/100, PEC\/PNEC values were not predicted to exceed 1 in either estuary (Table 303 \n4).  304 \n 305 \nThe study on two model estuaries for which relatively strong empirical data on shorebird 306 \n(dunlin) feeding habits and metal concentrations were available demonstrates that intakes of 307 \nthese metals in metal contaminated estuaries are at levels which may have adverse effects on 308 \necologically-relevant endpoints. This conclusion is based on an assessment of the food uptake 309 \npathway. We will, however, briefly consider the potential importance of other uptake 310 \npathways for these metals. 311 \n 312 \nAlternative Uptake Pathways 313 \n 314 \nBecause the water-prey bioaccumulation factor is high for these metals, the direct ingestion 315 \nof water by birds is a much less important uptake pathway than the food pathway we have 316 \nmodelled here. It therefore plays no significant role in predictions of PEC and uncertainty in 317 \nthose predictions (Crane et al., 2005).  318 \n 319 \nUptake by ingestion of contaminated soil or sediment may occur incidentally (as, for 320 \nexample, soil or sediment attached to food is ingested) or deliberately (some birds, for 321 \nexample, deliberately ingest grit). Ingestion of contaminated soil or sediment is likely to vary 322 \nsignificantly depending on the behaviour and diet of a bird. For different species of birds, the 323 \nUSEPA (USEPA, 1993) have estimated values of <2 % to 30% soil or sediment (per unit dry 324 \nweight) in faeces of different birds. The highest values were observed in sandpipers which 325 \nfeed on mud-dwelling invertebrates. 326 \n16 \n \n 327 \nUsing data for Pb and Hg in sediments in Poole Harbour (taken from the same sites as Nereis 328 \nwere sampled; Environment Agency, unpubl. res.), we have estimated the potential uptake 329 \nvia contaminated sediments in comparison with direct uptake from food. The calculation 330 \nassumed that either 2% of dry matter intake (DMI) is sediment, or 30% of DMI is sediment. 331 \nThis assumption is based on the USEPA (USEPA, 1993) study of sediment in faeces, though 332 \nthis is likely to be somewhat over-estimated since dry mass of excreted food is lower than dry 333 \nmass of ingested food. For Pb, the amount of ingested metal per day via sediment was in the 334 \nrange 0.01 – 0.15 mg d-1 (for DMI in the range 2-30%) compared to 0.039 mg d-1 via food. 335 \nFor Hg, the ingestion rate via sediment was in the range 7.4 × 10\n-5\n to 1.1 × 10\n-3\n mg d\n-1\n 336 \ncompared to 1.6 × 10\n-3\n mg d\n-1\n via food.  It should be noted, however, that: (1) the upper range 337 \nof sediment ingestion rate of 30% may be unrealistically high: for sandpipers the range was 338 \nestimated to be in the range 7.3-30% (USEPA, 1993) and; (2) metals adsorbed to sediments 339 \nmay be less bioavailable than those in prey (Sheppard et al., 1995). It is, however, possible 340 \nthat direct ingestion of sediment could lead to higher PPC\/PNEC values than those 341 \ndetermined for the food pathway alone, although uncertainties in metal bioavailability and 342 \nsediment uptake make the role of the sediment pathway difficult to quantify.  343 \n 344 \n 345 \nUncertainty in Model Predictions 346 \nIt should be noted that model sensitivity analyses, by definition, only give information on the 347 \nuncertainty encompassed within the defined model. A sensitivity analysis does not 348 \nnecessarily encapsulate all sources of uncertainty (a limitation of all environmental and 349 \necological models). It is possible that due to unknown factors (which may make model 350 \nparameters vary to a different extent than those assumed in the model) real PPC\/PNEC values 351 \n17 \n \nmay be different to the predicted ranges. For example, the NOAEL values used for this study 352 \nare necessarily estimated from data on laboratory birds of different species than those studied 353 \nhere. Actual NOAELs of the wild species studied here may be significantly different to those 354 \nused in the model. Thus sensitivity analysis (whilst being a powerful modelling tool) cannot 355 \nalone determine predictive uncertainty of environmental models.  356 \n 357 \nReducing uncertainty 358 \nFurther field studies of metal concentrations in prey and (to the extent which it is possible) 359 \nfield assessments of the impact of metals on bird health\/populations would be required to 360 \nfurther reduce model uncertainty and to improve assessment of that uncertainty (i.e. validate 361 \npredictions). For Pb, as shown above, the uncertainty in NOAEL is the dominant factor in 362 \nmodel sensitivity, so reducing this uncertainty will have a much greater impact than reducing 363 \nuncertainty in other parameters. For Hg, uncertainty in NOAEL is also important, but the 364 \nstudy has also identified uncertainty in Hg content of prey items, FIR, and relative presence 365 \nof MeHg as being important sources of uncertainty on which future research should be 366 \nfocussed. 367 \n  368 \nOverwintering birds 369 \n 370 \nIn the context of this modelling study, it is important to realise that, for waders that 371 \noverwinter in Poole Harbour or the Severn Estuary and migrate to breeding grounds 372 \nelsewhere, exposure to metal contaminants at the time of breeding may be quite different to 373 \nthat experienced during the winter. It is uncertain what, if any, impacts previous overwinter 374 \nexposure(s) to Pb or Hg may have on subsequent breeding success. Some of the contaminants 375 \naccumulated over winter may be remobilised. For example, Pb sequestered in bone may be 376 \n18 \n \nremobilised as bone (and calcium) turnover increases during egg production, or MeHg in fat 377 \nmay be remobilised as energy reserves are depleted during migration, immediately before 378 \nbreeding starts. There are no toxicological studies that we are aware of that specifically 379 \ninvestigate the effects of prior exposures to Pb and Hg on subsequent reproduction; exposure 380 \ntypically occurs prior to and\/or during the reproductive cycle. Pharmaco-kinetic modelling 381 \nwould therefore be needed to estimate the likely extent of remobilisation of previously 382 \naccumulated contaminants and how this might supplement the internal dose derived from 383 \ndietary intake on the breeding grounds 384 \n 385 \nThe other principal way in which metal intake on overwintering grounds could have 386 \necologically significant effects is their potential contribution to direct over-winter mortality 387 \nor decrease in likelihood of survival during spring migration. There are no suitable toxicity 388 \ntest endpoints to assess whether survival during migration could be affected.  Thus, the only 389 \navailable data are for acute toxicity data (LD50\/LC50\/NOAEL data), which are also sparse for 390 \ninorganic Pb and Hg in birds.  We did not attempt to use acute toxicity endpoints in most of 391 \nthe probabilistic models but had sufficient ecotoxicological data for methyl-mercury to carry 392 \nout an assessment using a NOAEL for survival. This was derived by dividing the LD50 data 393 \nby 100.  When this endpoint was used, the modelled median PPC\/PNEC ratios were all 394 \nextremely low, the 95\nth\n percentile for the worst case scenario being 0.5. Thus, from this 395 \nlimited assessment, there is no evidence that overwinter dietary intake of Pb or Hg poses an 396 \nacute toxic threat to dunlin on the Severn Estuary or Poole Harbour.  397 \n 398 \n 399 \n 400 \n 401 \n19 \n \nConclusions 402 \n 403 \nThe Monte-Carlo based model presented here is able to assess the degree of risk posed to 404 \nbirds feeding on important estuarine habitats, and also shows the limitations of such risk 405 \nassessments, particularly with regard to data quality and availability. This modelling study 406 \nindicates that internationally important feeding grounds for waders such as Poole Harbour 407 \nand the Severn Estuary may pose an ecologically-relevant toxic risk to wading birds. It was 408 \nfound that there was a high probability that PPC\/PNEC for Pb significantly exceeded 1 in 409 \nboth areas for dunlin.  There was also a high probability that PPC\/PNEC for Hg significantly 410 \nexceeded 1 in the Severn Estuary and a significant (>5%) probability that PPC\/PNEC 411 \nexceeded 1 in Poole Harbour.  412 \n 413 \nThe model largely used data sets which would be typically available and necessary for 414 \nassessing the impacts of contamination of large estuaries, although data describing feeding 415 \npreferences and foraging patterns for waders are rarely site-specific.  Whilst acknowledging 416 \nthe inevitable limitations in using such data sets (which are made up of data from a number of 417 \nsources), their use gives a realistic estimate of uncertainty in environmental impact 418 \nassessments. Such an uncertainty based assessment gives important insights into the 419 \nlimitations of real environmental impact assessments. 420 \n 421 \nDespite much previous work on its ecotoxicological impacts, a major source of uncertainty in 422 \npredicting PPC\/PNEC values for Pb was the large uncertainty in NOAEL values.  Generation 423 \nof further experimental toxicity data for metals in birds is likely to be extremely limited 424 \nbecause of the ethical concerns associated with such work, and it is doubtful that there will be 425 \nsignificant reduction in the future in the uncertainty associated with these measures.  For Hg, 426 \n20 \n \nthe amount of Hg present as MeHg, FIR and prey metal concentrations were also important 427 \nsources of uncertainty and further studies to improve the precision of measurements of these 428 \nparameters would reduce some of the uncertainty when estimating the risks of Hg to wading 429 \nbirds.  430 \n 431 \nUse of lethal toxicity data (LD50\/100) was investigated as a method for assessing sub-lethal 432 \nimpacts from Hg. It was found that this method led to a significant under-estimate of the 433 \npotential impact of Hg contamination, as compared with direct estimation of NOAEL. 434 \n 435 \nIf significant toxic risk is still predicted following appropriate studies to reduce the 436 \nuncertainty associated with contaminant levels in prey species, field studies to assess 437 \ncontaminant residues and relevant health indices in waterbirds should be undertaken. These 438 \nshould be focussed on high risk sites where inputs of relevant contaminants are ongoing. An 439 \napproach which makes use of waterbird carcasses (found dead at relevant sites), similar to the 440 \nUK‟s Predatory Bird Monitoring Scheme, should be considered,  to provide further insight 441 \ninto the significance of the risk predictions made through the modelling work reported here.  442 \nApplication of non-invasive biomarkers to samples which could potentially be collected 443 \nduring routine ringing operations may provide useful supplementary information.  444 \n 445 \n 446 \n 447 \n 448 \n 449 \n 450 \n 451 \n21 \n \nACKNOWLEDGEMENTS 452 \n 453 \nThe authors would like to thank the Steering Group for this project, namely Jennifer Best 454 \n(Natural England), Peter Jonas (Environment Agency) and Chris Nikitik (Environment 455 \nAgency Wales).  Thanks are also due to the Environment Agency for provision of data on 456 \ncontaminant residues in Nereis in the Severn Estuary and Poole Harbour.   457 \n22 \n \n8. REFERENCES \n \nBryan GW, Langston WJ. Bioavailability, accumulation and effects of heavy metals in \nsediments with special reference to United Kingdom estuaries: a review. \nEnvironmental Pollution 1992; 76: 89-131. \nBull KR, Every WJ, Freestone P, Hall JR, Osborn D, Cooke AS, et al. Alkyl lead pollution \nand bird mortalities on the Mersey Estuary, UK, 1979-1981. Environmental Pollution \nSeries A, Ecological and Biological 1983; 31: 239-259. \nBull KR, Roberts RD, Inskip MJ, Goodman GT. Mercury Concentrations in Soil, Grass, \nEarthworms and Small Mammals near an Industrial Emission Source. Environmental \nPollution 1977; 12: 135-140. \nCrane M, Ward RM, McInnes RJ. Potential risks to shorebirds from exposure to \ncontaminants in the Severn estuary, UK: A screening level study. English Nature, \n2005, pp. 65. \nDuquesne S, Newton LC, Giusti L, Marriott SB, Stärk H-J, Bird DJ. Evidence for declining \nlevels of heavy-metals in the Severn Estuary and Bristol Channel, U.K. and their \nspatial distribution in sediments. Environmental Pollution 2006; 143: 187-196. \nDurell SEALVd, Stillman RA, Caldow RWG, McGrorty S, West AD, Humphreys J. \nModelling the effect of environmental change on shorebirds: a case study on Poole \nHarbour, U.K. Biological Conservation 2006; 131: 459-473. \nFerns PN, Anderson JI. Lead in the diet and body tissues of dunlins Calidris alpina from the \nBristol Channel, UK. Environmental Pollution 1997; 96: 35-42. \nGoss-Custard JD, McGrorty S, Pearson B, Clarke RT, Rispin WE, Durell SEALVd, et al. \nPrediction of post-barrage densities of birds. Vol.4: Birds. Department of Energy., \n1988. \nISI. ISI Web of Knowledge, 2005. \nLangston WJ, Chesman BS, Burt GR, Hawkins SJ, Readman J, Worsfold P. Characterisation \nof the South West European Marine Sites: The Severn Estuary pSAC, SPA. . \nOccasional Publications of the MBA No. 13. 13. Marine Biological Association, \nPlymouth, 2003b. \nLangston WJ, Chesman, B.S., Burt, G.R., Hawkins, S.J., Readman, J., Worsfold, P.   . \nCharacterisation of the South West European Marine Sites: Poole Harbour SPA. \nOccasional Publications of the MBA No. 12. Marine Biological Association, \nPlymouth, 2003a. \nMorgan JE, Morgan AJ. Differences in the Accumulated Metal Concentrations in 2 Epigeic \nEarthworm Species (Lumbricus-Rubellus and Dendrodrilus-Rubidus) Living in \nContaminated Soils. Bulletin of Environmental Contamination and Toxicology 1991; \n47: 296-301. \nMuhaya BBM, Leermakers M, Baeyens W. Total mercury and methylmercury in sediments \nand in the polychaete Nereis diversicolor at Groot Buitenschoor (Scheldt estuary, \nBelgium). Water Air and Soil Pollution 1997; 94: 109-123. \nNagy KA. Food requirements of wild animals: Predictive equations for free-living mammals, \nreptiles and birds. Nutrition Abstracts and Reviews Series B: Livestock Feeds and \nFeeding 2001; 71: 21-31. \nPain DJ, Sanchez A, Meharg AA. The Donana ecological disaster: Contamination of a world \nheritage estuarine marsh ecosystem with acidified pyrite mine waste. Science of the \nTotal Environment 1998; 222: 45-54. \nPickess BP, Underhill-Day JC. Important Birds of Poole Harbour. Wareham: Poole Harbour \nStudy Group, 2002. \n23 \n \nPirrie D, Power MR, Rollinson G, Camm GS, Hughes SH, Butcher AR, et al. The spatial \ndistribution and source of arsenic, copper, tin and zinc within the surface sediments of \nthe Fal Estuary, Cornwall, UK. Sedimentology, 50(3): 579–595. Sedimentology 2003; \n50: 579-595. \nPollitt MS, Hall C, Holloway SJ, Hearn RD, Marshall PE, Musgrove AJ, et al. The Wetland \nBird Survey 2000-01: Wildfowl and Wader Counts. Slimbridge: \nBTO\/WWT\/RSPB\/JNCC, 2003. \nSample BE, Opresko DM, Suter II GW. Toxicological Benchmarks for Wildlife: 1996 \nRevision. Oak Ridge National Laboratory, Oak Ridge, TN., 1997, pp. 217. \nSheppard SC, Evenden WG, Schwarz WJ. Ingested soil: bioavailability of sorbed lead, \ncadmium, cesium, iodine and mercury. Journal of Environmental Quality 1995; 24: \n498-505. \nSpurgeon DJ. The ecological relevance of the OECD earthworm toxicity test, and its use in \nestablishing soil quality criteria. PhD Thesis. University of Reading, Reading, UK, \n1994, pp. 273. \nStillman RA, West AD, Durell SEALVd, Caldow RWG, McGrorty S, Yates M, et al. Estuary \nspecial protection areas - establishing baseline targets for shorebirds. Final report. \nEnglish Nature, 2005, pp. 157. \nU.S. Environmental Protection Agency. Data collection for the hazardous waste identification \nrule. Section 14.0 ecological benchmarks. Office of Solid Waste, Washington, DC, \n1999, pp. 105. \nU.S. Environmental Protection Agency. ECOTOXicology Database System. Office of \nResearch and Development,, U.S. Environmental Protection Agency, 2002. \nU.S. Environmental Protection Agency. Ecological soil screening levels for lead. Office of \nSolid Waste and Emergency Response, Washington, DC, 2005, pp. 242. \nUSACHPPM. Technical Guide No. 254: Standard practice for wildlife toxicity values. U.S. \nCentre for health promotion and preventative medicine, 2000, pp. 45. \nUSEPA. Wildlife exposure factors handbook. Vol. 1. EPA\/600\/R-93\/187. USEPA, \nWashington, 1993, pp. 572p. \nVerdonck FA, Van Sprang PA, Vanrolleghem PA. Uncertainty and precaution in European \nenvironmental risk assessment of chemicals. Water Science & Technology 2005; 52: \n227-234. \nWorld Health Organisation. Environmental Health Criteria 85: Lead- Environmental Aspects. \nGeneva: World Health Organisation, 1989a. \nWorld Health Organisation. Environmental Health Criteria 86: Mercury - Environmental \nAspects. Geneva: World Health Organisation, 1989b. \nWorld Health Organisation. Environmental Health Criteria 101: Methylmercury. Geneva: \nWorld Health Organisation, 1990. \nWorld Health Organisation. Environmental Health Criteria 118: Inorganic Mercury. Geneva: \nWorld Health Organisation, 1991. \nWorrall DH. Diet of the Dunlin Calidris alpina in the Severn Estuary. Bird Study 1984; 31: \n203-212. \n \n \n \n \n \n \n \n \n24 \n \nFigure Captions \n \nFigure 1. Map of Severn and Poole Harbour estuaries. \nFigure 2. Predicted PPC\/PNEC of Pb in dunlin, Poole Harbour: Average Scenario. The \nhistogram shows the frequency of given PPC\/PNEC output values out of 10,000 model runs. \nPercentage cumulative frequency is shown by the grey line using the right-hand vertical axis. \nThe uncertainty is very high (note the logarithmic scale on the X-axis) due primarily to \nuncertainty in NOAEL (see Sensitivity Analysis section). \nFigure 3. Hg in Dunlin, Severn Estuary, assuming mean fraction of MeHg = 18%. The \nhistograms show the frequency of given PPC\/PNEC output values out of 10,000 model runs. \nPercentage cumulative frequency is shown by the grey line using the right-hand vertical axis. \nWorst case scenario for PNEC based on (a) LD50\/100 or (b) NOAEL based on reproductive \nendpoints. PPC\/PNEC is predicted to be significantly greater than 1 based on NOAEL, but \nless than 1 based on LD50\/100. \nFigure 4. Median predicted values of PPC\/PNEC for lead in dunlin in Poole Harbour and the \nSevern Estuary. Error bars show the range of 5-95 percentile predicted values. \nFigure 5. Median, predicted values of PPC\/PNEC for Hg in dunlin where PNEC is based \neither on an NOAEL or on LD50\/100 in (a) Poole Harbour and (b) the Severn Estuary. Error \nbars show the range of 5-95 percentile predicted values. \nFigure 6 Sensitivity analysis: Pb in dunlin, Poole Harbour (Ave. Scenario). The variation of \npredicted PPC\/PNEC is shown given variation in different individual input parameters, and \nfor variation in all parameters. Uncertainty in NOAEL for Pb dominates uncertainty in \nPPC\/PNEC. \nFigure 7 Sensitivity analysis: Hg in dunlin, Severn Estuary (Ave. Scenario). Uncertainty in \n%MeHg in diet, Hg content of molluscs, FIR and NOAEL all contribute significantly to \nuncertainty in PPC\/PNEC \n25 \n \n \n \nTABLES \n \nTable 1. Percentage of different food types taken by adult (Average Scenario) and juvenile \n(Worst Case Scenario) dunlin in Poole Harbour and the Severn Estuary. \n \nPoole Harbour Percentage food type \nMarine worms 78 % S.D. 5% \nMolluscs 100% minus % of marine worms \nCrustaceans \nEarthworms 0 \nSevern Estuary  \nMarine worms 58 % S.D. 10% \nMolluscs 100% minus Σother \nCrustaceans 0 \nEarthworms 0-10% \n \n \n26 \n \n \n \nTable 2. Assumed distributions (mean  S.E. or range) of lead and mercury in prey items for \nthe Average Scenario based on measured data for ragworms and from a literature review for \nother species (see Tables S3-S6). \nPrey type Pb – Poole H. \nmg\/kg DW \nAssumed \ndistribution \nPb –  Severn Est. \nmg\/kg DW \nAssumed \ndistribution \nNereis 0.71  0.11 Normal 1.51  0.32 Normal \nMolluscs & \ncrustaceans \n0.24 – 7.1 Uniform 0.50-15.1 Uniform \nEarthworms 4 – 27 Uniform 4 – 27 Uniform \nPrey type Hg – Poole H. \nmg\/kg DW \nAssumed \ndistribution \nHg –  Severn Est. \nmg\/kg DW \nAssumed \ndistribution \nNereis 0.076  0.0068 Normal 0.48  0.1 Normal \nMolluscs and \ncrustaceans \n0.025 – 0.76 Uniform 0.16 – 1.44 Uniform \nEarthworms Insufficient data  Insufficient data  \n \n \n \n \n27 \n \nTable 3. Ranges and assumed probability distributions of NOAEL and LD50\/100 values for \nPb and Hg (see Table S7 for details of the studies on which these are based). \n \nMetal Endpoint Range \nmgMetal\/kgBW\/d \nAssumed probability \ndistribution\na \nPb NOAEL 0.011-1.6 Uniform distribution of log-\ntransformed values \nMeHg NOAEL 0.0038-0.0108 Uniform\n \nMeHg LD50\/100 0.195-0.378 Uniform  \nIOM NOAEL 0.45 – 5.5 Uniform \na. A uniform distribution assumes that the endpoint can take any value between the upper and lower \nbounds with equal probability. \n \n \n \n \n \n28 \n \nTable 4. Median, 5 and 95 percentile PEC\/PNEC values for dunlin exposed to Pb and Hg in \nPoole Harbour and the Severn Estuary. \nMetal Scenario Basis for \nPNEC \nPEC\/PNEC \n5% \nPEC\/PNEC \n50% \nPEC\/PNEC \n95% \nPoole Harbour \nPb Average NOAEL 0.18 1.97 21.8 \nHg Average NOAEL 0.23 0.79 2.41 \nHg Average LD50\/100 0.0061 0.02 0.055 \nPb Worst Case NOAEL 0.48 5.62 58.0 \nHg Worst Case NOAEL 0.45 1.39 4.34 \nHg Worst Case LD50\/100 0.012 0.035 0.10 \nSevern Estuary \nPb Average NOAEL 0.58 6.45 74.6 \nHg Average NOAEL 1.01 3.37 10.7 \nHg Average LD50\/100 0.035 0.084 0.19 \nPb Worst Case NOAEL 1.11 11.7 121 \nHg Worst Case NOAEL 2.31 6.94 21.9 \nHg Worst Case LD50\/100 0.060 0.18 0.51 \n      \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n29 \n \nFigure 1 Map of Severn and Poole Harbour estuaries. \n \n \n \n \n \n30 \n \nFIGURES 2-7 \n \n \n \n \n \nFigure 2. Predicted PPC\/PNEC of Pb in dunlin, Poole Harbour: Average Scenario. The \nhistogram shows the frequency of given PPC\/PNEC output values out of 10,000 model runs. \nPercentage cumulative frequency is shown by the grey line using the right-hand vertical axis. \nThe uncertainty is very high (note the logarithmic scale on the X-axis) due primarily to \nuncertainty in NOAEL (see Sensitivity Analysis section). \n31 \n \n \nFigure 3. Hg in Dunlin, Severn Estuary, assuming mean fraction of MeHg = 18%. The \nhistograms show the frequency of given PPC\/PNEC output values out of 10,000 model runs. \nPercentage cumulative frequency is shown by the grey line using the right-hand vertical axis. \nWorst case scenario for PNEC based on (a) LD50\/100 or (b) NOAEL based on reproductive \nendpoints. PPC\/PNEC is predicted to be significantly greater than 1 based on NOAEL, but \nless than 1 based on LD50\/100. \n32 \n \n \n \n \n \n \n \n \n0.1\n1\n10\n100\n1000\nP\nP\nC\n\/P\nN\nE\nC\nPoole Harbour Severn Estuary\n \nFigure 4. Median predicted values of PPC\/PNEC for lead in dunlin in Poole Harbour and the \nSevern Estuary. Error bars show the range of 5-95 percentile predicted values. \n \n33 \n \n0.001\n0.01\n0.1\n1\n10\nNOAEL LD50\/100 NOAEL LD50\/100\nP\nE\nC\n\/P\nN\nE\nC\nScenario\nAverage scenario Worst case scenario\n(a) Hg in Poole Harbour\n0.01\n0.1\n1\n10\nNOAEL LD50\/100 NOAEL LD50\/100\nP\nE\nC\n\/P\nN\nE\nC\nSpecies\/scenario\nAverage scenario Worst case scenario\n(b) Hg in the Severn Estuary\n \nFigure 5. Median, predicted values of PPC\/PNEC for Hg in Dunlin where PNEC is based \neither on an NOAEL or on LD50\/100 in (a) Poole Harbour and (b) the Severn Estuary. Error \nbars show the range of 5-95 percentile predicted values.\n34 \n \n0\n2000\n4000\n6000\n8000\n10000\n12000\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\n% Nereis in diet varied\n0\n2000\n4000\n6000\n8000\n10000\n12000\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\nPb in Nereis varied\n0\n1000\n2000\n3000\n4000\n5000\n6000\n7000\n8000\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\nPb in molluscs & crustaceans varied\n0\n1000\n2000\n3000\n4000\n5000\n6000\n7000\n8000\n9000\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\nFood Intake Rate varied\n0\n200\n400\n600\n800\n1000\n1200\n1400\n1600\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\nNOAEL varied\n0\n200\n400\n600\n800\n1000\n1200\n1400\n1600\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\nAll parameters varied\n \nFigure 6 Sensitivity analysis: Pb in Dunlin, Poole Harbour (Ave. Scenario). The histograms show the frequency of given PPC\/PNEC output \nvalues out of 10,000 model runs. The variation of predicted PPC\/PNEC is shown given variation in different individual input parameters, and for \nvariation in all parameters. Uncertainty in NOAEL for Pb dominates uncertainty in PPC\/PNEC. \n35 \n \n0\n500\n1000\n1500\n2000\n2500\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\nAll parameters varied\n0\n500\n1000\n1500\n2000\n2500\n3000\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\n% MeHg varied\n0\n2000\n4000\n6000\n8000\n10000\n12000\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\n% Nereis in diet varied\n0\n2000\n4000\n6000\n8000\n10000\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\nHg in Nereis varied\n0\n500\n1000\n1500\n2000\n2500\n3000\n3500\n4000\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\nHg in molluscs varied\n0\n500\n1000\n1500\n2000\n2500\n3000\n3500\n4000\n4500\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\nFood Intake Rate varied\n0\n500\n1000\n1500\n2000\n2500\n3000\n3500\n4000\n4500\nF\nre\nq\nu\ne\nn\nc\ny\nPPC\/PNEC\nNOAEL varied\n \nFigure 7 Sensitivity analysis: Hg in Dunlin, Severn Estuary (Ave. Scenario). The histograms show the frequency of given PPC\/PNEC output \nvalues out of 10,000 model runs. Uncertainty in %MeHg in diet, Hg content of molluscs, FIR and NOAEL all contribute significantly to \nuncertainty in PPC\/PNEC\n36 \nSUPPLEMENTARY MATERIAL \n \nTable S1. Maximum PPC\/PNEC estimated from measurements of contaminants in Nereis \ndiversicolor (Environment Agency, unpubl. res.) at 12 sites in Poole Harbour. Contaminants \nwith PPC\/PNEC > 1 are highlighted in bold font. \n \nContaminant Measured \nconcentrati\non (Range) \nmg\/kg f.w. \nNOAEL \nmg\/kgBW\/\nd \nMax. \nPPC\/PNEC \nNotes \nCopper  1.8 - 6.8 47.0  [1] 0.073  \nSilver 0.23 – 0.36 >2.3  [2] <0.12 Used LC50×FIR\/1000  \nZinc 19 – 44 11     [3] 3.15  \nCadmium 0.011 – 0.36 1.45  [4] 0.08  \nMercury 0.0086 – \n0.026 \n0.0064   [5] 3.1 Assume NOAEL = LOAEL\/10 \nA NOAEL for mercury as organo-metal \n(methylmercury) was chosen.\na \nLead 0.11 – 0.36 0.021  [6] 14  \nVanadium <0.23 – 0.48 1.5      [7] 0.25  \nArsenic 1.5 – 6.0 10.0 [8] 0.47  \nChromium <0.23 – 0.48 1.0     [3] 0.37  \nManganese 1.0 – 3.6 977    [9] 0.0029  \nIron 67 – 285 1.03   [2] 216 Used LC50×FIR\/1000. \nBut NOAEL lower than daily iron \nrequirement. \nNickel 0.41 – 1.5 77.4    [10] 0.015  \nPAHs <0.0005 – \n1.1 \n1.43    [11] \nBenzo(a)pyrene \nAll <1 Checked each individual PAH against \nNOAEC for Benzo(a)pyrene, the most \ntoxic PAH. \nTributyl tin n.d. 6.8     [12] - All measured values were below limit of \ndetection.  \na. There is a large disparity between NOAELs for mercuric chloride and methylmercury (0.45 cf. 0.0064 mg\/kg \nbw\/d respectively). Using the NOAEL for methyl mercury over estimates the risk. [1] (Mehring et al., 1960)   \n; [2] (U.S. Environmental Protection Agency, 2002); [3] (Sample et al., 1997); [4] (White and Finley, 1978); [5] \n(Heinz, 1979); [6] (Edens and Garlich, 1983); [7] (Romoser et al., 1961) [8] (Stanley et al., 1994); [9] (Laskey \nand Edens, 1985); [10] (Cain and Pafford, 1981); [11] (Hough et al., 1993); [12] (Schlatterer et al., 1993);  \n \n \n37 \nTable S2. Maximum PPC\/PNEC estimated from measurements of contaminants in Nereis \ndiversicolor at 13 sites in the Severn Estuary.  The range of organic contaminants that were \nanalysed for was greater than in the Nereis collected from Poole Harbour (Table S1).  \nContaminant Measured \nconc. (Range) \nmg\/kg f.w. \nNOAEL \nmg\/kgBW\/d \nMax. \nPPC\/PNEC \nNotes \nCopper 7.2 – 20 47.0   [1] 0.33  \nSilver 0.25 – 1.6 >2.3   [2] <0.53 Used LC50*FIR\/1000 for NOAEL \nZinc 20 – 55 11      [3] 3.9  \nCadmium 0.024 – 0.25 1.45   [4] 0.13  \nMercury 0.039 – 0.20 0.0064   [5] 22.5 Assume NOAEL = LOAEL\/10. \nUsed a NOAEL for  mercury as organo-\nmetal (methylmercury). There is a large \ndisparity between NOAELs for mercuric \nchloride and methylmercury (0.45 cf. \n0.0064 mg\/kg bw\/d respectively). \nLead 0.18 – 0.53 0.021   [6] 34.2  \nArsenic 1.4 – 4.9 10.0 [7] 0.38  \nChromium 0.20 – 1.3 1.0       [3] 1.0  \nNickel 0.32 – 1.3 77.4     [8] 0.013  \nSelenium 1.2 – 3.1 0.5       [9] 4.9 Assume NOAEL = LOAEL\/10 \nPAHs < 0.0005 – 0.8 1.43     [10] \n(Benzo(a)pyre\nne) \nAll <1 Checked each individual PAH against \nNOAEL for Benzo(a)pyrene, the most \ntoxic PAH. \nPCBs < 0.0001 – \n0.0086 \n0.18     [11] \n(Arochlor \n1254) \nSum <1 Checked sum of PCBs vs NOAEL for \nArochlor 1254. \nTributyl tin n.d.\nb \n6.8       [12] - All measurements below L.O.D.\nb \na,b,d,g-\nhexachlorocycl\nohexane \nn.d.   All measurements were below L.O.D. \nAldrin, \nDieldrin, \nEndrin, Isodrin \nn.d.   All measurements were below L.O.D. \nop-DDT,  \npp-DDT \nn.d.   All measurements were below L.O.D. \npp-DDE < 0.001 – \n0.0012 \n  LC50 = 825 mg\/kg. Max 1.19 μg\/kg \nin prey. Only 2 out of 13 samples \nabove L.O.D\n2 \npp-TDE <0.001 – \n0.0032 \n  1 out of 13 samples above L.O.D. \nMeasured value 3.2 μg kg-1 f.w. LD50 \n= 386 mg kg\n-1\n BW acute dose. \nHexachloro-\nbutadiene, \nHexachloro-\nbenzene \nn.d.   All measurements were below L.O.D. \na. n.d. – not detected; b. L.O.D – limit of detection in chemical analysis  \n[1] (Mehring et al., 1960) ; [2] (U.S. Environmental Protection Agency, 2002); [3] (Sample et al., 1997); [4] \n(White and Finley, 1978); [5] (Heinz, 1979); [6] (Edens and Garlich, 1983); [7] (Stanley et al., 1994); [8] (Cain \nand Pafford, 1981); [9] (Heinz et al., 1987); [10] (Hough et al., 1993); [11] (Dahlgren et al., 1972); [12] \n(Schlatterer et al., 1993);  \n38 \nTable S3. Pb in various biota in comparison with Nereis, Poole Harbour \n \nPb mg kg\n-1\n DW Holes Bay \nBrownsea\/main \nharbour \nNotes \nNereis (Hediste) \ndiversicolor  \nRagworm \n<0.5 – 1.6 \nMean: 0.71 \nS.E.: 0.11 \nThis study, range for \nPoole Harbour \n3.6  Langston et al. unpubl. \nMean over 25 yr period. \nScrobicularia plana \nPeppery furrow shell \n18  \n \n \n5.8 \nLangston et al. unpubl. \nMean over 25 yr period. \n \nThis study, Parkstone \nBay \nCerastoderma edule \nCommon cockle \n14 5 (Boyden, 1975) samples \nfrom 1973-4 \nMytilus edulis \nCommon mussel \n19 7 \n \n \n10.5\na \n(Boyden, 1975) samples \nfrom 1973-4 \n \n(MAFF, 1998) Main \nharbour, site not \nspecified. \nOstrea edulis \nNative oyster \n1.2 0.35 (Langston, 2003a). Data \nfrom 1983. \nCrassostrea gigas \nPortuguese oyster \n 2.5 (Langston, 2003a). Data \nfrom 1983. \na. converted to DW basis using a FW\/DW ratio of 7 for bivalves. \n \n39 \nTable S4. Hg in various biota in comparison with Nereis, Poole Harbour \n \nHg mg kg\n-1\n DW Holes Bay \nBrownsea\/main \nharbour \nNotes \nNereis (Hediste) \ndiversicolor  \nRagworm \n0.038 – 0.11 \nMean: 0.076 \nS.E.: 0.0068 \nEA supplied data, 2004 \nrange for Poole Harbour \n0.24  Langston et al. unpubl. \nMean over 25 yr period. \nScrobicularia plana \nPeppery furrow shell \n1.08  \n \n \n0.14 \nLangston et al. unpubl. \nMean over 25 yr period. \n \nEN supplied data 2004 \nParkstone Bay \nMytilus edulis \nCommon mussel \n 0.413\na \n(MAFF, 1998) Main \nharbour, site not specified. \nOstrea edulis \nNative oyster \n0.49 0.16 (Langston, 2003a). Data \nfrom 1983. \nCrassostrea gigas \nPortuguese oyster \n 0.26 (Langston, 2003a). Data \nfrom 1983. \na. converted to DW basis using a FW\/DW ratio of 7 for bivalves. \n \n40 \nTable S5. Pb in various biota in comparison with Nereis, Severn Estuary \n \nPb mg kg\n-1\n DW Avonmouth Severn Estuary Notes \nNereis (Hediste) \ndiversicolor  \nRagworm \n0.55-2.3\na\n  \nMean: 1.51 \nSE: 0.32 \nEA supplied data, 2004 \nrange for Severn Estuary \n44.9 11.4; 17.0 (Ferns and Anderson, \n1997), samples from \n1979\/80 \n3.56 (Langston et al., 2003b). \nMean over 25 year period \nScrobicularia plana \nPeppery furrow shell \n43.5 (Langston et al., 2003b). \nMean over 25 yr period. \nMytilus edulis \nCommon mussel \n 10.0 Environment Agency, \nunpul. res. 2001-05 \nMacoma balthica \nBaltic tellin \n40.6 19.5 – 27.5 (Ferns and Anderson, \n1997). Samples from \n1979\/80. \nNephthys hombergi \nCatworm \n91.9 (Ferns and Anderson, \n1997). Samples from \n1979\/80. \nHydrobia ulva \nLaver spire shell \n44.5 (Ferns and Anderson, \n1997). Samples from \n1979\/80. \na. converted to DW basis using a FW\/DW ratio of 4.4 for Nereis. \n \n \n41 \nTable S6. Hg in various biota in comparison with Nereis, Severn Estuary \n \nHg mg kg\n-1\n DW Severn Estuary Notes \nNereis (Hediste) \ndiversicolor  \nRagworm \n0.08 – 0.89a This study, range for Severn \nEstuary \n1.42 (Langston et al., 2003b). \nMean over 25 yr period. \nScrobicularia plana \nPeppery furrow shell \n0.64 (Langston et al., 2003b). \nMean over 25 yr period. \nMytilus edulis \nCommon mussel \n0.61 \n \n0.5 \n(Langston et al., 2003b). Date \nnot known. \nEnvironment Agency, unpubl. \nres., 2001-05 \na. converted to DW basis using a FW\/DW ratio of 4.4 for Nereis. \n42 \nTable S7. Summary of avian no observed adverse effect levels (NOAELs) for selected contaminants that were included in \nthe probabilistic risk assessment \n \nMetal Form Species\n Exposure \nDuration (d) \nCritical Endpoint \nNOAEL \n(mg\/kg \nBW\/day) \nReference \nPb Lead acetate Chicken  \n(Gallus domesticus) \n28 Egg Production 1.63 (Edens and \nGarlich, 1983) \n Lead acetate Japanese quail  \n(Coturnix c. japonica) \n84 Progeny Counts 0.019a (Edens and \nGarlich, 1983) \n Lead acetate Japanese quail  \n(Coturnix c. japonica) \n35 Egg Production 0.194 (Edens and \nGarlich, 1983) \n Lead acetate Japanese quail  \n(Coturnix c. japonica) \n84 Egg Production 0.011a (Edens et al., \n1976) \nHg (inorganic) Mercury sulphate White leghorn hen \n(Gallus domesticus) \n21 Egg hatchability 5.5 (Scott, 1977) \n Mercuric chloride Japanese quail \n(Coturnix c. japonica) \n140 Egg Production 0.45 (Hill and \nShaffner, 1976) \n Mercuric chloride Japanese quail \n(Coturnix c. japonica) \nN\/A Mortality 0.30b (Hill and Soares, \n1984) \nHg (organic) Methyl mercury chloride Great Egret \n(Ardea albus) \n91 Growth 0.0038 (Spalding et al., \n2000) \n Methyl mercury chloride Great Egret \n(Ardea albus) \n91 Growth 0.0108 (Spalding et al., \n2000) \n Methyl mercury \ndicyandiamide  \nMallard \n(Anas platyrhynchos) \n>365 Egg and Duckling \nProduction \n0.0064a \n \n(Heinz, 1979) \n Methyl mercury \ndicyandiamide \nMallard \n(Anas platyrhynchos) \nN\/A Mortality 0.289b (Hudson et al., \n1984) \n Methyl mercury Bobwhite quail \n(Colinus virginianus) \nN\/A Mortality 0.239b (Hudson et al., \n1984) \n Methyl mercury  Japanese quail \n(Coturnix c. japonica) \nN\/A Mortality 0.195b (Hill and Soares, \n1984; Hudson et \nal., 1984) \n Methyl mercury  Fulvous whistling duck \n(Dendrocygna bicolour) \nN\/A Mortality 0.378b (Hudson et al., \n1984) \n Methyl mercury \ndicyandiamide  \nHouse sparrow \n(Passer domesticus) \nN\/A Mortality 0.219b (Hudson et al., \n1984) \n Methyl mercury \ndicyandiamide  \nPheasant \n(Phasianus colchicus) \nN\/A Mortality 0.253b (Hudson et al., \n1984) \na. values based on a LOAEL divided by a factor of 10; b. values based on a LD50 value divided by a factor of 100. N\/A indicates that duration \nof exposure is not applicable as single oral dose was used. \n \n \n43 \n  \n44 \n \nReferences for Supplementary Material \n \nBoyden CR. Distribution of some trace metals in Poole Harbour, Dorset. Marine Pollution \nBulletin 1975; 6: 180-187. \nCain BW, Pafford EA. Effects of dietary nickel on survival and growth of Mallard ducklings. \nArchives of Environmental Contamination and Toxicology 1981; 10: 737-745. \nDahlgren RB, Linder RL, Carlson CW. Polychlorinated biphenyls: their effects on penned \npheasants. Environmental Health Perspectives 1972; 1: 89-101. \nEdens FW, Benton E, Bursian SJ, Morgan GW. Effect of Dietary Lead on Reproductive-\nPerformance in Japanese Quail, Coturnix-Coturnix Japonica. Toxicology and Applied \nPharmacology 1976; 38: 307-314. \nEdens FW, Garlich JD. Lead-Induced Egg-Production Decrease in Leghorn and Japanese \nQuail Hens. Poultry Science 1983; 62: 1757-1763. \nFerns PN, Anderson JI. Lead in the diet and body tissues of dunlins Calidris alpina from the \nBristol Channel, UK. Environmental Pollution 1997; 96: 35-42. \nHeinz GH. Methyl mercury: reproductive and behavioral effects on three generations of \nmallard ducks. Journal of Wildlife Management 1979; 43: 394-401. \nHeinz GH, Hoffman DJ, Krynitsky AJ, Weller DMG. Reproduction in Mallards Fed \nSelenium. Environmental Toxicology and Chemistry 1987; 6: 423-433. \nHill EF, Shaffner CS. Sexual maturation and productivity of japanese quaiol fed graded \nconcentrations of mercuric chloride. Poultry Science 1976; 55: 1449-1459. \nHill EF, Soares JH. Subchronic Mercury Exposure in Coturnix and a Method of Hazard \nEvaluation. Environmental Toxicology and Chemistry 1984; 3: 489-502. \nHough JL, Baird MB, Sfeir GT, Pacini CS, Darrow D, Wheelock C. Benzo(a)Pyrene \nEnhances Atherosclerosis in White Carneau and Show Racer Pigeons. \nArteriosclerosis and Thrombosis 1993; 13: 1721-1727. \nHudson RH, Tucker RK, Haegele MA. Handbook of toxicity of pesticides to wildlife. USDI \nFish and Wildlife Service, Washington, D C, 1984. \nLangston WJ, Chesman BS, Burt GR, Hawkins SJ, Readman J, Worsfold P. Characterisation \nof the South West European Marine Sites: The Severn Estuary pSAC, SPA. . \nOccasional Publications of the MBA No. 13. 13. Marine Biological Association, \nPlymouth, 2003b. \nLangston WJ, Chesman, B.S., Burt, G.R., Hawkins, S.J., Readman, J., Worsfold, P.   . \nCharacterisation of the South West European Marine Sites: Poole Harbour SPA. \nOccasional Publications of the MBA No. 12. Marine Biological Association, \nPlymouth, 2003a. \nLaskey JW, Edens FW. Effects of chronic high-level manganese exposure on male behavior \nin the Japanese Quail (Cotirnix coturnix japonica). Poultry Science 1985; 64: 579-\n584. \nMAFF. Concentrations of metals and other elements in marine fish and shellfish. Food \nSurveillance Data Sheet 151. Ministry of Agriculture Fisheries and Food, London, \n1998. \nMehring ALJ, Brumbaugh JH, Sutherland AJ, Titus HW. The tolerance of growing chickens \nfor dietary copper. Poultry Science 1960; 39: 713-719. \nRomoser GL, Dudley WA, Machlin LJ, Loveless L. Toxicity of vanadium and chromium for \nthe growing chick. Poultry Science 1961; 40: 1171-1173. \nSample BE, Opresko DM, Suter II GW. Toxicological Benchmarks for Wildlife: 1996 \nRevision. Oak Ridge National Laboratory, Oak Ridge, TN., 1997, pp. 217. \n45 \nSchlatterer B, Coenen TMM, Ebert E, Grau R, Hilbig V, Munk R. Effects of Bis(tri -\nnbutyltin) oxide in Japanese Quail exposed during egg laying period: an \ninterlaboratory comparison study. Archives of Environmental Contamination and \nToxicology 1993; 24: 440-448. \nScott ML. Effects of Pcbs, Ddt, and Mercury-Compounds in Chickens and Japanese Quail. \nFederation Proceedings 1977; 36: 1888-1893. \nSpalding MG, Frederick PC, McGill HC, Bouton SN, McDowell LR. Methylmercury \naccumulation in tissues and its effects on growth and appetite in captive great egrets. \nJournal of Wildlife Diseases 2000; 36: 411-422. \nStanley TR, Spann JW, Smith GJ, Rosscoe R. Main and Interactive Effects of Arsenic and \nSelenium on Mallard Reproduction and Duckling Growth and Survival. Archives of \nEnvironmental Contamination and Toxicology 1994; 26: 444-451. \nU.S. Environmental Protection Agency. ECOTOXicology Database System. Office of \nResearch and Development,, U.S. Environmental Protection Agency, 2002. \nWhite DH, Finley MT. Uptake and retention of dietary cadmium in mallard ducks. \nEnvironment Research 1978; 17: 53-59. \n \n \n \n \n \n \n \n \n"}