{"doi":"10.1080\/0968776930010102","coreId":"7259","oai":"oai:generic.eprints.org:9\/core5","identifiers":["oai:generic.eprints.org:9\/core5","10.1080\/0968776930010102"],"title":"Academics' use of courseware materials: A survey","authors":["Laurillard, Diana","Swift, Betty","Darby, Jonathan"],"enrichments":{"references":[{"id":1882712,"title":"11Diana Laurillard et al Academics'use of courseware materials: a survey","authors":[],"date":"1990","doi":null,"raw":"11Diana Laurillard et al Academics'use of courseware materials: a survey Gardner, N. and Darby, J. (1990), 'Using computers in university teaching: a perspective on key issues', Computers in Education, 15, 1-3, 27-32.","cites":null},{"id":194224,"title":"Blocks to the effective use of information technology in higher education',","authors":[],"date":"1992","doi":"10.1016\/0360-1315(92)90049-b","raw":"Hammond, N., Gardner, N., Heath, S., Kibby, M., Mayes, T., McAleese, R., Mullings, C. and Trapp, A. (1992), 'Blocks to the effective use of information technology in higher education', Computers in Education, 18, 1-3, 155-162.","cites":null},{"id":446615,"title":"Computers and Communication in the Humanities: A Survey of Use,","authors":[],"date":"1992","doi":null,"raw":"Mullings, C. (1992), Computers and Communication in the Humanities: A Survey of Use, Oxford, OHC.","cites":null},{"id":194225,"title":"Computers in education: progress at a snail's pace',","authors":[],"date":"1990","doi":null,"raw":"Kemeny, J.G. (1990), 'Computers in education: progress at a snail's pace', EDUCOM Review 25, 3, 44-47.","cites":null},{"id":194222,"title":"et al Academics'use of courseware materials: a survey","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":446616,"title":"Funding Council","authors":[],"date":"1992","doi":null,"raw":"UFC (Universities Funding Council) (1992), Beyond Lectures: The Report of the Information Systems Committee Courseware Development Working Party, Oxford, CTISS Publications. (Appendix follows...) 12ALT-J VOLUME 1 NUMBER 1","cites":null},{"id":194223,"title":"Integrating computing into higher education',","authors":[],"date":"1990","doi":null,"raw":"Glick, M.D. (1990), 'Integrating computing into higher education', EDUCOM Review, 25, 2, 35-38.","cites":null},{"id":446614,"title":"Report of the Working Party on the Provision of Computing Facilities for Teaching, Durham,","authors":[],"date":"1991","doi":null,"raw":"McDonough, R.W. (1991), Report of the Working Party on the Provision of Computing Facilities for Teaching, Durham, Inter-University Committee on Computing.","cites":null},{"id":194221,"title":"The future of computers in teaching and learning',","authors":[],"date":"1992","doi":"10.1016\/0360-1315(92)90025-z","raw":"Darby, J. (1992), 'The future of computers in teaching and learning', Computers in Education, 19, 1\/2, 193-197.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1993","abstract":"Learning technology has yet to enter the mainstream of higher education. The UFC-funded Teaching and Learning Technology (TLT) programme is attempting to change this by sponsoring projects concerned with courseware production and delivery. These efforts could be thwarted if the Not Invented Here syndrome prevents the use of technology-based teaching and learning materials outside the originating departments. To gain a clearer understanding of why academics have been rejecting much existing courseware, and to establish the extent of the Not Invented Here syndrome, we carried out a survey of 800 academics in eight UK universities. The survey proved to be exceptionally revealing","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/7259.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/9\/1\/CALT_A_00101004_O.pdf","pdfHashValue":"3188e62646f8ac6538cf83e7ad70b631d3511e3e","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:9<\/identifier><datestamp>\n      2011-04-04T09:31:00Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/9\/<\/dc:relation><dc:title>\n        Academics' use of courseware materials: A survey<\/dc:title><dc:creator>\n        Laurillard, Diana<\/dc:creator><dc:creator>\n        Swift, Betty<\/dc:creator><dc:creator>\n        Darby, Jonathan<\/dc:creator><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Learning technology has yet to enter the mainstream of higher education. The UFC-funded Teaching and Learning Technology (TLT) programme is attempting to change this by sponsoring projects concerned with courseware production and delivery. These efforts could be thwarted if the Not Invented Here syndrome prevents the use of technology-based teaching and learning materials outside the originating departments. To gain a clearer understanding of why academics have been rejecting much existing courseware, and to establish the extent of the Not Invented Here syndrome, we carried out a survey of 800 academics in eight UK universities. The survey proved to be exceptionally revealing.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        1993<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/9\/1\/CALT_A_00101004_O.pdf<\/dc:identifier><dc:identifier>\n          Laurillard, Diana and Swift, Betty and Darby, Jonathan  (1993) Academics' use of courseware materials: A survey.  Association for Learning Technology Journal, 1 (1).  pp. 4-14.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776930010102<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/9\/","10.1080\/0968776930010102"],"year":1993,"topics":["LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Academics' use of courseware materials: a survey\nDiana Laurillard*, Betty Swift* and Jonathan Darby**\n* Institute of Educational Technology, Open University, Milton Keynes MK7 6AJ\n** CTISS, University of Oxford, 13 Banbury Road, Oxford OX2 6NN\nAbstract\nLearning technology has yet to enter the mainstream of higher education. The\nUFC-funded Teaching and Learning Technology (TLT) programme is attempting to\nchange this by sponsoring projects concerned with courseware production and delivery.\nThese efforts could be thwarted if the Not Invented Here syndrome prevents the use of\ntechnology-based teaching and learning materials outside the originating departments.\nTo gain a clearer understanding of why academics have been rejecting much existing\ncourseware, and to establish the extent of the Not Invented Here syndrome, we carried\nout a survey of 800 academics in eight UK universities. The survey proved to be\nexceptionally revealing.\nIntroduction\nThe increasing interest in the use of educational technology methods for teaching, fuelled now\nby the Teaching and Learning Technologies (TLT) programme funding, establishes the\ncreation of such courseware as a widespread academic exercise. This is encouraging for those\nof us who believe that educational media can enhance student learning and understanding, but\nit begs the question of who is going to use all the material currently under development. One\nof the key arguments against course materials as an alternative to lectures has always been the\nNot Invented Here syndrome: academics are just about prepared to recommend a colleague's\ntextbook, but would not take on video or computer-based teaching material developed\nelsewhere, as the teaching philosophy would be unlikely to match their own. This is an\nimportant argument because the development of course materials, especially computer\nprograms, is economically feasible as a teaching method only if large numbers of student\nusers are likely. Technology-based materials have to travel beyond the originating department,\nbut how can they if the Not Invented Here syndrome applies?\nThis was the question that exercised the ISC Courseware Development Working Group earlier\nthis year in its deliberations on future mechanisms for universities moving into the field\n4\nALT-J VOLUME 1 NUMBER 1\n(UFC, 1992). We wanted to establish whether the plan to develop materials for use in a range\nof universities was doomed by academics' preference for in-house teaching. Accordingly, the\nWorking Group designed a questionnaire to investigate the issue among a randomly-selected\ngroup of academics. This paper reports on the results.\nLittle attention has been paid in the past to the attitudes of academic staff in higher education\ntowards the use of computer-based learning (CBL) materials. Researchers trying to identify\nthe factors inhibiting the adoption of courseware have mostly focused their attention\nelsewhere. Kemeny (1990) sees the problem primarily in terms of the poor quality of\navailable software resulting from the individual, non-collaborative nature of its production.\nGlick (1990) cites higher education's lack of flexibility and inertia to change as the foremost\nbarrier. Darby (1992) highlights the blockages caused by the secondary importance attached to\nteaching by the majority of academics (research invariably comes first), the lack of\nrecognition afforded to courseware designers, the limited suitability of much available\ncourseware, and the support problems associated with courseware delivery.\nAttitude surveys in higher education have tended to focus on developers (Gardner, 1990),\ncomputer centre directors (McDonough, 1991), or university registrars (CSUP, 1992), and\nhave mainly concentrated on technical and resource issues. The Office for Humanities\nCommunication, in its comprehensive survey of computer use in the humanities, surveyed\nacademic departments as well as libraries and computer centres. Referring to responses from\nacademic departments Mullings reports:\nJust over half the sample reported problems associated with their use of\ncomputers in teaching. These were generally organizational and financial rather\nthan technical. Problems mentioned most frequently were cost, staffing and\nhardware. (Mullings, 1992)\nSeveral centres in the Computers in Teaching Initiative (CTI) have surveyed academic\nattitudes in the discipline communities they serve. Hammond et al (1992) report on two such\nsurveys: Land Use and Psychology. Land Use lecturers identified 'lack of time' as the main\nfactor inhibiting their use of computers in teaching. Psychology lecturers were generally\npositive about computer use but had a narrow perception of potential teaching applications.\nIndeed Hammond et al note: 'It is likely that some of the respondents were hypothesizing\nfrom a state of blissful ignorance.'\nThe Survey\nThe Working Group's survey was designed to find out:\n# the extent to which academics already use teaching and learning technologies in their\nteaching\n• where the materials being used had originated\n# their awareness and opinion of CBL materials in their field, and\n• their attitudes to using CBL materials developed elsewhere.\nThe questionnaire was kept to two sides of straightforward questions, using mainly\nmultiple-choice questions but also generating some open-ended comments (see Appendix).\n5\nDiana Laurillard et al Academics' use of courseware materials: a survey\nThe questionnaire was sent to 800 academics selected at random from the Universities\nHandbook. To minimize costs of mailing, only eight universities were involved in the sample,\nchosen to represent different types and locations: Aston, Bristol, Cambridge, Glasgow, Hull,\nUniversity College London, Cardiff, and York. Addressed questionnaires, with covering\nletters, were sent to a contact at each university for internal circulation to the selected\nacademics. Addressed reminder cards were sent after four weeks, and further copies of the\nquestionnaire with new covering letters were sent after a further four weeks. This elicited a\n50% response rate. Several replies had to be discarded as recipients had changed jobs or\nstatus, or were not involved in teaching, giving a usable response rate of 47%.\nQuantitative data was coded for computer analysis. Qualitative data, in the form of written\nopen-ended comments, were typed into a computer file, giving some 80 pages of comments.\nOne third were analysed by inspection to produce a range of categories which were then used\nto categorize the remaining comments. These are described below.\nExisting use of teaching and learning technologies\nThe great majority of academics recommend textbooks by other authors in their teaching, only\n14% recommending none (Appendix, Question 2). 43% recommend four or more textbooks as\nrequired reading for the three or four courses they are teaching during the year.\nOther kinds of educational materials require the use of technology of some kind, either in the\nclassroom or by individual students in a resource centre. Slides were the most popular\nalternative form, 46% having used them at some time; videocassettes were next with 35%,\nthen CBL (defined as teaching programs, not just application tools such as word processing or\nspreadsheets) with 27%. Audio cassettes attracted a much lower response of 11%, perhaps\nbecause it is essentially a private study medium, whereas the others can all be class-based and\nused within lectures (Question 3).\nThere is a large minority of academics who already make use of teaching and learning\ntechnology, therefore, though the proportion using CBL drops to near a quarter. That is partly\ndue to lack of awareness: only 46% have ever seen CBL programs in their field (Question 4),\nand only 19% have had any contact with their CTI centre.\nAlmost 40% of the academics using CBL had used only programs originating in their own\ndepartment or institution (Question 3ii). That is a disturbingly high figure. Individual\ninstitutions cannot afford to develop such a high proportion of the CBL programs they need if\nsuch programs are to be of good quality, and the medium exploited to its full potential. At\npresent many academics find the programs they need are not available, and develop their own\nfor that reason, which suggests it is a short-term corrective that will change as more\ncourseware becomes available. Or is it a manifestation of the Not Invented Here syndrome?\nCertainly, there is much criticism of the efforts of others in the field, as the next section below\ndemonstrates.\nAttitudes to CBL materials\nOf those in a position to know (i.e. who have seen CBL programs in their field), only 26%\nthink the majority of them are reasonably good; half find them very mixed in quality\n6\nALT-J VOLUME 1 NUMBER 1\n(Question 4ii). In the written comments on their 'reservations' about computer-based teaching\n(Question 5), the criticisms voiced tended to focus on the pedagogy rather than on any\nproblems with the accuracy of what was presented:\nMuch more effort needs to be spent on the user interface. It almost needs to be\nthe focus of development rather than an after-thought.\nThe present software is designed with idiots in mind. We don't have enough\nidiots here to make it viable ... [there should be] more-emphasis on software\nbeing intellectually stimulating.\nHowever, reservations concerning quality of software were very infrequent; there is a sizeable\nminority who express fundamental concerns about the nature of computer-based teaching in\ngeneral:\nStudents can be distanced further from staff members than they are already.\nThis may result in a fundamental misunderstanding of a topic without staff\nrealizing it.\nI am strongly against the use of the computer screen as an alternative to\nhands-on experience with laboratory hardware in such fields as mechanical\nengineering.\nComputers seem inappropriate for material that needs to be pondered over. I\nwould be afraid that they would trivialize the subject, reducing it to a series of\nresponses to problems on the calculation side.\nI fear that it would be used as a crutch by students and as an alternative to the\nwork that is required for true understanding.\nAll these criticisms could be answered with the assurance that computers will not take over,\nthat they will be used only for those parts of the teaching process for which they are suitable,\nand that they will be properly integrated with the more traditional forms of teacher\ninvolvement. These perceptions highlight the importance of clarifying the role computers\nshould take, and confirm its limited nature.\nSome clarification of the perceived role can be found in written replies on the 'advantages' of\ncomputer-based teaching. The key educational benefits are seen as:\n• dynamic visual presentation\n• provision for rehearsal of basic skills\n• access to data and information sources\n• improvement of learning\/understanding.\nOnly the last of these is at all contentious. The category includes achievable expectations such\nas:\nAllows students to progress at their own pace\nStudents can test themselves as they go along\n7\nDiana Laurillard et at Academics' use of courseware materials: a survey\nIt allows students to learn actively without increasing contact time\nWould allow more flexibility and freedom for students to examine process\nalternatives\nwith the first being mentioned most frequently, but the category also includes a few optimistic\ngeneralities concerning better understanding and help with exploring the subject. No medium\ncan offer these advantages by its very nature; they all need inspired creative input to do that.\nIn general, however, the respondents had a realistic and positive approach to the pedagogic\ncapabilities of computer-based teaching.\nThe Not Invented Here syndrome\nIf at present only a quarter of the university teaching population uses CBL, and only 60% of\nthe CBL programs an academic uses are developed elsewhere, does this mean that academics\nare reluctant to take on other people's teaching programs? To gauge the feasibility of a\nnational programme for courseware development, such as TLT, we asked respondents if they\nwould be interested in such collaboration (Question 8a). Interest was high. 52% of all\nrespondents, not just those who already used CBL, were interested in collaborating with other\nacademics either in their own department or in other institutions in order to develop programs.\nThe inter-university consortium approach to courseware development, advocated by the ISC\nWorking Group (UFC, 1992), and manifested in the TLT call for proposals, was clearly\nfeasible, therefore, as was borne out by the unexpectedly large number of consortium\nproposals received by the funding council.\nThat so many academics are now interested in the development of computer-based courseware\nin their subject is vital for adequate provision of a suitable library of courseware. But the real\ntest of the feasibility of CBL resides also in the preparedness of academics to use courseware\noriginating elsewhere. Again, the responses in the survey were extremely encouraging. Almost\n70% of all respondents were interested in using CBL programs developed by a national\nprogramme. Moreover, 60% of all respondents were interested in evaluating such programs,\nitself an essential activity if quality of design is to improve.\nThe survey elicited a fuller picture of attitudes to introducing CBL by asking respondents to\nreact to statements describing different aspects of the issue (Question 6). Around 60%\ndisagreed with statements that 'a computer-based teaching program would be intrusive' and\n'others' ideas would not fit', though 16% agreed with them, coincident with the proportion\nwho use no textbooks. It is an inevitable consequence of the progress of academic knowledge\nthat at any one time some sizeable proportion of the teaching in universities could and should\nbe promulgated independently of standard texts. That is a figure we cannot expect to change\nvery much. At the same time, many teachers welcome the intrusion of others' ideas, and\nalmost 90% agree that they would not mind their students being exposed to 'alternative\nperspectives' on their subject, though this is not the same as alternative 'teaching', which\nCBL may well embody.\nLack of use of CBL does not reflect its innate unsuitability. Nearly 73% of respondents\nagreed that 'some aspects of the subject would benefit from a well-designed computer\nprogram'.\n8\nALT-J VOLUME 1 NUMBER 1\nOpinion is exactly balanced when considering the relative merits of CBL. As many agree as\ndisagree that 'limited resources are better spent on other forms of teaching than on\ncomputer-based teaching programs', with about 40% neutral.\nThe survey shows that while usage of CBL is still low, at around 25% of academics, interest\nis much higher. Most importantly, it counters with impressive evidence the traditional excuse\nfor lack of take-up. The Not Invented Here syndrome is no longer a potent force, if it ever\nwas. The majority of academics are interested in using or testing programs originating\nelsewhere. There are still barriers to take-up, as the next section describes, but they are\nlogistical and financial, not cultural. Academics, as represented by the respondents to this\nsurvey, are open to alternative perspectives in their teaching, aware of the potential benefits of\nCBL, willing to contribute to its development as a teaching method, but also balanced in their\nopinion of its relative value.\nAcademics' concerns\nThe radical reconstruction of higher education in the UK is being experienced by academics\nboth as a catalyst for change and as a barrier. Recognition of the former comes from several\nwritten comments (Question 8b). Barriers are seen as 'insufficient time', as pressures in their\ndepartment make it difficult to take advantage of new teaching methods:\nIt is very difficult to take a new initiative when one is totally occupied coping\nwith the present demands of the University.\nI wish we had more time to develop our teaching, but the demands of academic\nlife make time a virtual impossibility for the foreseeable future. (Strong\nrequirement here is to get on with research).\nGiven the expansion in student numbers, I would much rather see limited\nresources available used to increase staff so we can keep class sizes down to\nmaintain teaching quality.\nWe lost an excellent specialist in this field because of short-sighted\nadministration. Now we have neither the time nor the facilities to use the\nprograms he prepared for us.\nStaff time is one problem, 'inadequate resources' is another:\nAvailability of hardware in sufficient quantity for all students to have enough\naccess.\nWe simply do not have the resources to utilize computer-based teaching because\nof the' costs of providing hardware to numbers of students who would be\ninvolved.\nAt present we lack the hardware to make use of programs a realistic and regular\npart of our teaching to 200+ students per year.\n9\nDiana Laurillard et al Academics' use of courseware materials: a survey\nA related aspect is a concern about the lack of administrative and technical support for the use\nof CBL:\nThe main problem is ... maintenance (especially if printers are involved) and\ngeneral care, up-dating when they become outmoded.\nThe use of computer programs assumes total efficiency of equipment ...\nincluding technicians. This is not necessarily forthcoming.\nUse of computers is likely to require substantial demonstrator\/teacher support.\nApart from these essentially financial barriers to take-up, many academics raised the more\ntechnical\/logistical problems of the immutability of software and the lack of standardization\non hardware and software platforms. In particular, as subject knowledge develops, how will\nthe updating of courseware be maintained?\n[Courseware] developed elsewhere could mean difficulties in adapting to new\nmaterial or data when it's available.\nHow would it remain contemporary, i.e. this year's science?\nVery fast-moving topic. Every year I update material to reflect new\nperspectives. Would this be practical with computer-based teaching?\nI am teaching in an area that is changing rapidly. Computer-based teaching\nwould only be worthwhile for a few of the basics.\nIt is in discussing the related problem of customizing software that academics exhibit their\nreservations about material originating elsewhere:\nIt is essential that materials developed leave the user free to make additions,\ndeletions and changes, and allow the lecturer to give his\/her own start to the\nmaterial.\nAlternative perspectives may be OK, but what is taught must be firmly in the\nhands of the course organiser ... 'authorware' support is what is needed most.\nThe ideal computer-assisted teaching program would be customizable by staff as\nwell as interactive with the students, allowing for local preferences.\nThe solution anticipated in these comments is adaptable courseware, rather than opposition to\nany form of CBL. Courseware has to adapt not only to teaching, however, but also to\nhardware and software environments, as many respondents recognized:\nThe portability issue is also critical - you need portability across (1) machines,\n(2) operating systems, (3) versions of operating systems, (4) window systems,\n(5) versions of window systems, (6) other conventions of the environment in\nwhich students work. These issues have always seemed prohibitive to me.\nIt is quite easy to waste time and money developing packages that are not really\nmuch use because they are too specific to certain hardware.\n10\nALT-J VOLUME 1 NUMBER 1\nAll the points raised in this section are fair comment. UK university teaching is undergoing\nrapid change, and academics are very aware of the difficulties inherent in making CBL work.\nAll these issues need to be addressed at all levels of the educational system, and on a national\nbasis, if academics are to be persuaded that CBL can go beyond the occasional specialist area\ninto the mainstream of university teaching.\nConclusions\nThe survey was able to show that nearly half the university teaching population already use\nteaching and learning technologies, but only a quarter use CBL. Awareness of CBL is much\nhigher, perhaps due to those who have had contact with their CTI centre, but opinion of what\nthey have seen is mixed. There is a general sense that CBL has some value and could be a lot\nbetter. Perhaps because of this, a high proportion of CBL programs originate in the\nacademic's own institution. This is not inevitable, however, as a large majority are interested\nin using and evaluating materials developed elsewhere.\nThere is a healthy criticism of existing materials, therefore, but this does not stifle a\nwillingness to collaborate on the development of CBL. Clearly the TLT programme is timely.\nThe danger is that scepticism about what has gone before will lead academics to act as though\nnothing worthwhile precedes them, and the reinvention of wheels - or worse, the invention of\nsquare wheels - will abound, as has happened so often before in this field. The existence of\nthe CTI centres facilitates the grounding of new work in the lessons of the old. The great\nadvantage this bestows on the new TLT programme should not be lost.\nThe most important message from the survey, however, is the positive one that the Not\nInvented Here syndrome is not a major influence on British academics considering the use of\nCBL.\nAcknowledgements\nOur thanks are due to the following individuals who assisted in the distribution of the\nquestionnaire in their universities: Sue Furber, Dr Robert Harding, Phil Perkins, June\nThompson, Professor Brian Butterworth, Annie Trapp.\nReferences\nCSUP (Committee of Scottish University Principals) (1992), Teaching and Learning in an\nExpanding Higher Education System, Edinburgh, SCFC.\nDarby, J. (1992), 'The future of computers in teaching and learning', Computers in Education,\n19, 1\/2, 193-197.\n11\nDiana Laurillard et al Academics'use of courseware materials: a survey\nGardner, N. and Darby, J. (1990), 'Using computers in university teaching: a perspective on\nkey issues', Computers in Education, 15, 1-3, 27-32.\nGlick, M.D. (1990), 'Integrating computing into higher education', EDUCOM Review, 25, 2,\n35-38.\nHammond, N., Gardner, N., Heath, S., Kibby, M., Mayes, T., McAleese, R., Mullings, C. and\nTrapp, A. (1992), 'Blocks to the effective use of information technology in higher education',\nComputers in Education, 18, 1-3, 155-162.\nKemeny, J.G. (1990), 'Computers in education: progress at a snail's pace', EDUCOM Review\n25, 3, 44-47.\nMcDonough, R.W. (1991), Report of the Working Party on the Provision of Computing\nFacilities for Teaching, Durham, Inter-University Committee on Computing.\nMullings, C. (1992), Computers and Communication in the Humanities: A Survey of Use,\nOxford, OHC.\nUFC (Universities Funding Council) (1992), Beyond Lectures: The Report of the Information\nSystems Committee Courseware Development Working Party, Oxford, CTISS Publications.\n(Appendix follows...)\n12\nALT-J VOLUME 1 NUMBER 1\nAppendix The Use of Courseware Materials •\nPL | | (1-6)\n1 How many courses are you teaching this year? Ring one None 0 (7)\nOne 1\nTwo 2\nThree 3\nFour or more 4\n2 How many textbooks, written by other academics, None 1 (8)\nare you recommending as required reading this year? One 2\nTwo to three 3\nFour to six 4\nMore than six 5\n3 Have you ever used other kinds of materials Slides 1 (9)\ndeveloped by other academics in any of your Videocassette 1 (10)\ncourses'! Please ring any you have used Audiocassette 1 (11)\nComputer-based\nteaching programme\n(see Note 1 below) 1 (12)\nNote 1: Not just word-processing packages, empty spreadsheets\/databases, calculation tools, analysis tools,\nprogramming languages etc.\nIf you tinged 'computer-based program', where was it In your department 1 (13)\n(were they) developed? Please ring as appropriate In your institution 1 (14)\nIn the UK 1 (15)\nElsewhere 1 (16)\n4 Have you ever seen any computer-based teaching Yes 1 (17)\nprograms in your field? No 2\nIF YES: Which of these applies?\nThe majority are reasonably good 1 (18)\nThe majority are rather poor 2\nThey are very mixed in quality 3\n5 What are your views on the notion of using computer-based teaching program developed\nelsewhere in your teaching? Please write in relation to one of the courses you teach\nDiscipline:\nCourse topic: | | (19,20)\nAdvantages:\nYour reservations:\nSerious disadvantages\/problems:\n13\nDiana Laurillard et al Academics' use of courseware materials: a survey\n6a Still thinking about teaching that particular course and using computer-based teaching\nprograms developed elsewhere, to what extent do you agree with the following? Ring one\nanswer for each item\nI have my own way of teaching this course, and:\n- a computer-based teaching program would\nbe intrusive\n- others ideas would not fit\nSome aspects of this subject would benefit from a\nwell-designed computer-based teaching program\nI would not mind my students being exposed to\nalternative perspectives on this subject\nLimited resources are better spent on other\nforms of teaching than on computer-based\nteaching programs\n6b Have you ever had any contact with the Computers in Teaching\nInitiative (CTI) Centre in your subject area?\nIF YES: Please specify the nature of the contact\n7a If a properly funded national consortium was set up to develop computer-based teaching\nprograms in your subject, would you be interested hi any of the following? Ring any that apply\n- collaborating with academics in your department in developing a program\n- collaborating with academics in other institutions in developing a program\n- evaluating programs developed by the scheme\n- using programs developed under this scheme\n7b Have you any further comments on this issue?\nDisagree\nsrrongly\n1 2\n1 2\n1 2\n1 2\n1 2\ni \n3\n3\n3\n3\n3\nAgree\nstrongly\n4\n4\n4\n4\n4\nYes\nNo\n5\n5\n5\n5\n5\n1\n2\n(21)\n(22)\n(23)\n(24)\n(25)\n(26)\n1\n1\n1\n1\n(27)\n(28)\n(29)\n(30)\n7c Are there particular things you would like to do or see done?\nThank you very much for your help.\nPlease return your form to the Survey Office, Institute of Educational Technology, the Open\nUniversity, P O Box 175, Milton Keynes, MK7 6BR. A prepaid label is enclosed.\n14\n"}