{"doi":"10.1177\/0951629810394700","coreId":"216967","oai":"oai:eprints.lse.ac.uk:31591","identifiers":["oai:eprints.lse.ac.uk:31591","10.1177\/0951629810394700"],"title":"A model of non-informational preference change","authors":["Dietrich, Franz","List, Christian"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-04","abstract":"According to standard rational choice theory, as commonly used in political science and economics, an agent's fundamental preferences are exogenously fixed, and any preference change over decision options is due to Bayesian information learning. Although elegant and parsimonious, such a model fails to account for preference change driven by experiences or psychological changes distinct from information learning.\\ud\nWe develop a model of non-informational preference change. Alternatives are modelled as points in some multidimensional space, only some of whose dimensions play a role in shaping the agent's preferences. Any change in these 'motivationally salient' dimensions can change the agent's preferences. How it does so is described by a new representation theorem. Our model not only captures a wide range of frequently observed phenomena, but also generalizes some standard representations of preferences in political science and economics","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/216967.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/31591\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_List%2C%20C_Model%20of%20non-inofrmational%20preference_List_Model%20non-informational%20preference_2015.pdf","pdfHashValue":"cc58aa86b24b61570c83155e8f16f4b32f238b62","publisher":"Sage Publications","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:31591<\/identifier><datestamp>\n      2015-05-05T09:06:45Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4756<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D5048<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3134<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/31591\/<\/dc:relation><dc:title>\n        A model of non-informational preference change<\/dc:title><dc:creator>\n        Dietrich, Franz<\/dc:creator><dc:creator>\n        List, Christian<\/dc:creator><dc:subject>\n        BF Psychology<\/dc:subject><dc:subject>\n        JC Political theory<\/dc:subject><dc:description>\n        According to standard rational choice theory, as commonly used in political science and economics, an agent's fundamental preferences are exogenously fixed, and any preference change over decision options is due to Bayesian information learning. Although elegant and parsimonious, such a model fails to account for preference change driven by experiences or psychological changes distinct from information learning.\\ud\nWe develop a model of non-informational preference change. Alternatives are modelled as points in some multidimensional space, only some of whose dimensions play a role in shaping the agent's preferences. Any change in these 'motivationally salient' dimensions can change the agent's preferences. How it does so is described by a new representation theorem. Our model not only captures a wide range of frequently observed phenomena, but also generalizes some standard representations of preferences in political science and economics.<\/dc:description><dc:publisher>\n        Sage Publications<\/dc:publisher><dc:date>\n        2011-04<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/31591\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_List%2C%20C_Model%20of%20non-inofrmational%20preference_List_Model%20non-informational%20preference_2015.pdf<\/dc:identifier><dc:identifier>\n          Dietrich, Franz and List, Christian  (2011) A model of non-informational preference change.  Journal of Theoretical Politics, 23 (2).  pp. 145-164.  ISSN 0951-6298     <\/dc:identifier><dc:relation>\n        http:\/\/jtp.sagepub.com\/<\/dc:relation><dc:relation>\n        10.1177\/0951629810394700<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/31591\/","http:\/\/jtp.sagepub.com\/","10.1177\/0951629810394700"],"year":2011,"topics":["BF Psychology","JC Political theory"],"subject":["Article","PeerReviewed"],"fullText":"  \nFranz Dietrich and Christian List \nA model of non-informational preference \nchange \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nDietrich, Franz and List, Christian (2011) A model of non-informational preference change. \nJournal of Theoretical Politics, 23 (2). pp. 145-164. ISSN 0951-6298  \n \nDOI: 10.1177\/0951629810394700 \n \n© 2011 The Authors \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/31591\/ \n \nAvailable in LSE Research Online: May 2015 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \nA Model of Non-Informational Preference\nChange\nFranz Dietrich and Christian List\u0003\nJuly 20, 2009\nAbstract\nAccording to standard rational choice theory, as commonly used in po-\nlitical science and economics, an agent\u0092s fundamental preferences are\nexogenously \u0085xed, and any preference change over decision options is\ndue to Bayesian information learning. Although elegant and parsimo-\nnious, such a model fails to account for preference change driven by ex-\nperiences or psychological changes distinct from information learning.\nWe develop a model of non-informational preference change. Alter-\nnatives are modelled as points in some multidimensional space, only\nsome of whose dimensions play a role in shaping the agent\u0092s prefer-\nences. Any change in these \u0091motivationally salient\u0092 dimensions can\nchange the agent\u0092s preferences. How it does so is described by a new\nrepresentation theorem. Our model not only captures a wide range of\nfrequently observed phenomena, but also generalizes some standard\nrepresentations of preferences in political science and economics.\n\u0003F. Dietrich, University of Maastricht and LSE; C. List, LSE. This paper was pre-\nsented at the Choice Group seminar, LSE, 1\/2009, the Preference Change Workshop,\nLSE, 5\/2009, the 3rd Workshop on Decisions, Games and Logic, HEC Lausanne, 6\/2009,\nand the 6th Conference of the Society for Economic Design, Maastricht, 6\/2009. We are\ngrateful to the participants at these events for comments and discussion.\n1\n1 Introduction\nAccording to standard models of rational choice, there is no such thing as\ngenuine preference change. A rational agent has \u0085xed preferences over funda-\nmental alternatives or outcomes, such as fully described states of the world,\nand any observed changes in his or her preferences over less fundamental\nalternatives, such as policy options, are purely information-driven: They are\ndue to the fact that the agent has learnt new information about which fun-\ndamental outcomes are likely to result from those options. In this way, the\nsame fundamental preferences, together with new information, lead to revised\npreferences at the less fundamental level. This theoretical picture is certainly\nelegant and parsimonious, and although it has become increasingly common\nin the social sciences to criticize the assumption of \u0091exogenously \u0085xed pref-\nerences\u0092(e.g., Dryzek 1992, Green and Shapiro 1994), its explanatory power\nshould not be underestimated (e.g., Friedman 1996).\nNonetheless, it is hard to deny that there are instances of preference\nchange which standard rational choice theory has di¢ culties explaining in a\nnatural way. Sometimes agents do undergo transformations that go beyond\ninformation learning in any ordinary sense. Imagine, to give some particu-\nlarly sharp examples, a capitalist businessman who, after surviving a plane\ncrash, decides to devote his life to charity; a workoholic who, after experienc-\ning an illness, changes his or her priorities in life; or an ageing person whose\nphysiological changes \u0096quite apart from the \u0091wisdom of age\u0092\u0096a¤ect his or her\nlifestyle and preferences. Or imagine someone with racist preferences who,\nafter bonding with a new neighbour of a di¤erent racial background, gives\nup his or her racism. To suggest that such changes are solely the result of\ninformation learnt from the plane crash, from the illness, from ageing or from\nbonding with the neighbour seems an unsatisfactory explanation. Something\nmore fundamental appears to be going on here. This raises the question of\nwhether standard rational choice theory can be generalized so as to account\n2\nfor the possibility of more fundamental changes of preference, while retain-\ning, as far as possible, the theory\u0092s elegance and parsimony. Our aim in this\npaper is to propose such a generalization and thereby to contribute to the\nfoundations of rational choice theory in political science and economics.\nThe key idea is that the alternatives over which agents have preferences\n\u0096such as states of the world, policy platforms, candidates, consumer goods\netc. \u0096 can be characterized along several dimensions, only some of which\ntypically play a role in shaping the agent\u0092s preferences. We call these the\nmotivationally salient dimensions. For example, a voter may form his or\nher preferences over policy platforms just on the basis of a conventional\nsocio-economic left-right dimension and ignore their locations on a second,\nreligious-secular dimension, or on a third, urban-rural dimension. Similarly,\nan ordinary person may form preferences over di¤erent kinds of wine just\non the basis of whether those wines are red or white, sweet or dry, cheap or\nexpensive, but be oblivious to the more subtle characteristics that the wine\nconnoisseur appreciates. When some of these further dimensions become\nsalient for the agent, his or her preferences can change.\nA change in an agent\u0092s set of motivationally salient dimensions can be\ntriggered by external experiences or by internal psychological or physiological\nchanges of the agent. It is distinct from learning new information. It cannot\nbe identi\u0085ed, for instance, with learning where alternatives are located on\nthe various dimensions. In our examples, the voter may always have been\nabstractly aware of the existence of the religious-secular and urban-rural\ndimensions of policies, and yet not have been motivated by them; and the\nwine drinker may always have had some information about a wine\u0092s acidity\nand oak, and yet not have been moved by these more subtle characteristics.\nOn our proposal, what happens when the agent\u0092s set of motivationally salient\ndimensions changes is simply that di¤erent dimensions attain force in shaping\nhis or her preferences. There need not be any change in the agent\u0092s beliefs\n3\nabout the locations of the alternatives on those dimensions, or about anything\nelse.\nOur claim that a change in the motivational salience of dimensions cannot\ngenerally be reduced to information learning is further reinforced by the\npossibility that such a change, unlike the acquisition of information, can\ngo in two directions: New dimensions may become motivationally salient,\nwhile others may cease to be so. For example, a poor person who gradually\nbecomes richer may be infected with what is sometimes called \u0091a­ uenza\u0092\nand no longer care about the poverty-related characteristics of alternatives,\nwhile suddenly paying great attention to the luxury-related ones. All this\nis entirely consistent with the agent\u0092s retaining all the factual information\nabout poverty that he or she had before. The resulting preference change is\nhard to model in ordinary informational terms.1\nIn our new model, alternatives are represented by points in some multi-\ndimensional space and an agent forms his or her preferences over the alter-\nnatives on the basis of a particular set of dimensions that have motivational\nsalience for him or her. The agent\u0092s preferences thus depend on the locations\nof the alternatives on the motivationally salient dimensions, but not on their\nlocations on others. On this picture, a change in the motivational salience of\n1A full discussion of whether preference change of the present kind could be remodelled\nas information learning is beyond the scope of this paper. In ongoing work, we give detailed\n(and largely negative) answers to this question, by providing \u0091microscopic\u0092foundations for\nour model. As presented here, the model is \u0091macroscopic\u0092, leaving open why a dimension\ngains or loses motivational salience. This is intended for reasons of generality and parsi-\nmony. Generality requires us not to single out any particular \u0091microscopic\u0092foundation of\nsalience. A dimension\u0092s salience (or lack thereof) could stem from the nature of the agent\u0092s\nconceptualization, imagination or perception, to give just a few examples. Similarly, par-\nsimony is often best achieved by explaining phenomena at a particularly accessible level,\nnot necessarily the most fundamental one. Recall, for instance, how cooperative game\nmodels describe decision making at a coalitional rather than individual level, even when\nreductions to non-cooperative models are possible.\n4\nsome dimensions can induce a preference change.2\nWe prove a general representation theorem in this framework, showing\nthat, under some plausible conditions, the agent\u0092s preferences are repre-\nsentable by an additive utility function, according to which the utility of\neach alternative is given by the sum of the values the agent assigns to its\nlocation on each of the motivationally salient dimensions. This additive form\nis consistent with many widely recognized types of preferences in political\nand economic contexts, such as Euclidean and other distance-based prefer-\nences in spatial voting theory and Cobb-Douglas and constant-elasticity-of-\nsubstitution preferences in the theory of consumer choice and beyond, and\nwe give some simple illustrations. Finally, we discuss how uncertainty and\nlack of information can be reintroduced into our model, so as to show that\nour model properly generalizes a paradigmatic standard model of rational\nchoice, by capturing the possibility of non-informational as well as informa-\ntional preference change.\nOur approach sheds new light on a diverse set of social-scienti\u0085c phe-\nnomena ranging from fairly general phenomena such as preference change\nas a result of new experiences or enhanced or diminished understanding\nto explicitly political ones such as deliberation-induced preference change\n(e.g., Miller 1992, Knight and Johnson 1994, Dryzek and List 2003, List,\nLuskin, Fishkin and McLean 2000\/2006) and Rikerian heresthetics (Riker\n1986, McLean 2001), the art of political manipulation by leading voters to\nreconceptualize the policy space in terms of di¤erent dimensions. Important\nrelated works include Stigler and Becker\u0092s work on taste acquisition, accord-\ning to which an agent\u0092s preference for listening to classical music, consuming\ndrugs, meeting friends etc. changes over time depending on past behaviour\n2Another way to express this idea is to say that the agent views the space of alterna-\ntives through a particular lense, focusing on the projection of the space into a particular\nsubspace rather than on the space as a whole, so that when the subspace in focus changes,\nthe agent\u0092s preferences change accordingly.\n5\nand experiences (e.g., Stigler and Becker 1977, Becker 1996); various au-\nthors\u0092work on the development or loss of other-regarding preferences such\nas sympathy, hate, reciprocity or identi\u0085cation (e.g., Sen 1977, 1996, Rabin\n1998, Fehr and Gaechter 1998, Sethi and Somanathan 2001, Falk and Fis-\nchbacher 2006, Dietrich 2008); dynamic inconsistency in an agent\u0092s choices,\nwhich might be involved, for example, in the development of addictions (e.g.,\nStrotz 1955-56, Hammond 1976); the endogenous determination of prefer-\nences and tastes by environmental factors such as government policies or\ninstitutions (e.g., Polak 1976, Bowles 1998, Dietrich 2009); and the e¤ects\nof issue framing on individual agency (e.g., Tversky and Kahneman 1981,\nBenford and Snow 2000, Gold and List 2004). Our model speaks in various\nways to each of the issues raised by these contributions, representing the\nrelevant concerns a¤ecting the agent\u0092s preferences or tastes (such as certain\nperceived characteristics of alternatives, the welfare of others etc.) in terms\nof separate dimensions of the space of alternatives and suggesting that the\nagent\u0092s preference or taste change stems from a change in the salience of\nthese dimensions. Although our model allows a large number of extensions\nand generalizations, we here aim to give a pedagogical introduction to the\ncentral concepts and ideas, setting aside as many technicalities as possible.\n2 Basic de\u0085nitions\nWe consider an agent\u0092s preferences over some set X of mutually exclusive\nalternatives, for example states of the world, policy platforms, candidates,\nconsumer goods etc. As already indicated, we assume that the set of alter-\nnatives X is some multidimensional space, such as Rk, with k > 0. Each\nalternative x 2 X can thus be written as a k-tuple x = (x1; x2; :::; xk), with\nxj representing the jth characteristic of the alternative or its location on\ndimension j. We write D = f1; 2; :::; kg to denote the set of dimensions.\n6\nAlthough Rk is the standard example of a k-dimensional space, our model is\nmore general. Generally, we assume that X is of the form\nX = X1 \u0002X2 \u0002 :::\u0002Xk,\nwhere each Xj is a connected topological space.3 The real line R or any\ninterval on the real line are the simplest instances of such spaces, but more\ncomplex instances are also conceivable, and an individual dimensionXj could\neven be internally multidimensional (e.g., be itself of the form R2 or R3 etc.).4\nA set of motivationally salient dimensions is a subset S \u0012 D. Our aim\nis to model how the agent\u0092s preferences depend on the set S. We consider\na family of preference orders over the alternatives in X, consisting of one\npreference order for each possible set of motivationally salient dimensions.\nInterpretationally, the agent need not be \u0096and typically is not \u0096aware of\nthese preference orders except the one held under his or her current set of\nmotivationally salient dimensions. For each S \u0012 D, we write\u0017S to denote the\nagent\u0092s preference order in the event that S is the set of motivationally salient\ndimensions. As is conventional, \u0017S is de\u0085ned as a re\u0087exive, transitive and\ncomplete binary relation on X, and we further assume that \u0017S is continuous,\nthus ruling out, for example, lexicographic preferences over X.5 We write\n\u001fS and \u0018S to denote the strict preference order and the indi¤erence relation\ninduced by \u0017S, respectively.\n3A topological space Xj is connected if it cannot be partitioned into two non-empty\nopen sets.\n4In a companion paper, we address (among other things) the alternative case in which\nsome of the Xjs are discrete and thus do not constitute connected topological spaces. This\nalternative case occurs, in particular, when some of the characteristics of the alternatives\nare binary.\n5Formally, \u0017S is continuous if, for all x 2 X, the sets fy 2 X : y \u0017S xg and fy 2\nX : x \u0017S yg are both topologically closed. In our companion paper, we also discuss the\nnon-continuous case.\n7\nIn the example of an election, the underlying set of dimensions D may in-\nclude a socio-economic, a religious-secular and an urban-rural dimension, and\nany subset S \u0012 D could be motivationally salient for a given voter, depend-\ning on which dimensions play a role in shaping his or her preferences. Some\nvoters may form their preferences solely on the basis of the socio-economic\ndimension of policies, while others may also take into account other dimen-\nsions. Similarly, in the case of wines, the underlying set of dimensions D may\ninclude anything ranging from the white-red, sweet-dry and cheap-expensive\ndimensions to those of oak and acidity etc. A wine drinker\u0092s set S of motiva-\ntionally salient dimensions now contains precisely those dimensions that play\na role in shaping his or her preferences. In the case of a particularly inert\nagent, it can even happen that the set of motivationally salient dimensions is\nempty. How can we make the idea of motivational salience more precise? In\nparticular, what do we mean by saying that a dimension plays a role in shap-\ning the agent\u0092s preferences? In the next section, we address these questions\nin more detail.\n3 General result\nWe introduce two axioms on the relationship between an agent\u0092s set of mo-\ntivationally salient dimensions and his or her preference order. The \u0085rst\ncaptures the central idea that only the salient dimensions have any motiva-\ntional force in shaping the agent\u0092s preferences: Unless two alternatives are\ndistinct with respect to some of the motivationally salient dimensions, the\nagent remains indi¤erent between them.\nAxiom 1 \u0091Only salient dimensions motivate.\u0092For any two alternatives x; y 2\nX and any set of motivationally salient dimensions S \u0012 D, if xS = yS, then\nx \u0018S y.6\n6For each x 2 X, we write xS to denote the subvector of x restricted to the dimensions\n8\nThe second axiom concerns the way in which the agent\u0092s preferences re-\nspond to gains or losses of motivationally salient dimensions. For pedagogical\npurposes, it is useful to begin with a simple, albeit unnecessarily strong vari-\nant of the axiom, before stating the \u0091o¢ cial\u0092axiom. The simple variant says\nthat the agent\u0092s preference between any two alternatives may change when\nan additional dimension becomes motivationally salient \u0096or when a previ-\nously salient dimension ceases to be so \u0096only if those two alternatives di¤er\non that dimension.\nAxiom 2 (simple variant) \u0091Only dimensions on which there is a di¤er-\nence motivate.\u0092 For any two alternatives x; y 2 X, any set of motiva-\ntionally salient dimensions S \u0012 D and any other dimension j =2 S, if\nx \u0017S y < x \u0017S[fjg y, then xj 6= yj.\nThe \u0091o¢ cial\u0092, weaker axiom says that, if every gain in motivationally\nsalient dimenions changes the preference between two given alternatives, then\nthose two alternatives must di¤er on at least one previously non-salient di-\nmension: The preference change must stem from some such di¤erence.\nAxiom 2 (o¢ cial variant) For any two alternatives x; y 2 X and any set\nof motivationally salient dimensions S ( D, if x \u0017S y < x \u0017S[T y for\nevery non-empty set T \u0012 DnS, then xj 6= yj for some j 2 DnS.\nOf course, a lot could be said about our two axioms. We can interpret\nthem either as substantive claims about how preferences are constrained\nby the motivational salience of dimensions within an agent, or as formal\nconstraints on the correct demarcation of dimensions and the correct spec-\ni\u0085cation of the motivationally salient ones. The \u0085rst, substantive interpre-\ntation requires that both preferences and motivational salience have some\nin S \u0012 D. When S = ?, xS is the empty vector, and thus xS = yS for any x; y 2 X in\nthis case.\n9\nindependent psychological content \u0096preferences obviously as representations\nof choice dispositions, and motivational salience as capturing some choice-\nrelevant features of the agent\u0092s conceptualization, imagination or perception\nof the alternatives inX. Once this psychological content is properly speci\u0085ed,\nour two axioms become empirically testable (and we hypothesize: compelling)\nclaims about the relationship between preferences and motivational salience.\nThe second, formal interpretation of our axioms, by contrast, is consistent\nwith the pure representation-theoretic spirit of classical decision theory. Here\nthe satisfaction of the two axioms is taken to be a constraint on the correct\nidenti\u0085cation of dimensions and on the ascription of motivationally salient\nones to an agent. For example, if two alternatives coincide on all dimensions\nin a given set S and yet the agent is not indi¤erent between them, contrary\nto axiom 1, then S, on this interpretation, cannot be a correct speci\u0085ca-\ntion of the agent\u0092s set of motivationally salient dimensions. Instead, some\ndimensions outside S must be motivationally salient as well. Similarly, if\nthe addition of one or several new dimensions to the set S always changes\nthe agent\u0092s preference between x and y although x and y do not di¤er on\nany new dimension, contrary to axiom 2, then we must have demarcated the\ndimensions in D incorrectly. It may be necessary, for instance, to combine\none or several of the new dimensions with one or several of the existing di-\nmensions into a single \u0091composite\u0092dimension to which the preference change\ncan be attributed. Di¤erent readers may favour di¤erent interpretations of\nthe axioms; for the purposes of this paper, however, we need not commit\nourselves to one interpretation.7\nWhat is the consequence of these two axioms? Surprisingly, their joint\nsatisfaction ensures that the agent\u0092s family of preference orders can be rep-\nresented in an elegant and uni\u0085ed way.\n7Recall the \u0091macroscopic\u0092nature of the present model, as explained in an earlier note.\n10\nTheorem 1 Suppose there are three or more e¤ective dimensions in D.8\nThen the agent\u0092s preference orders \u0017S across all possible S \u0012 D satisfy ax-\nioms 1 and 2 if and only if there exist continuous value functions\nv1 : X1 ! R, v2 : X2 ! R, ..., vk : Xk ! R such that, for any two al-\nternatives x; y 2 X and any set of motivationally salient dimensions S \u0012 D,\nx \u0017S y ()\nP\nj2S\nvj(xj) \u0015\nP\nj2S\nvj(yj).\nA proof is given in the appendix. While the proof draws on classic charac-\nterization results by Debreu (1960) and Wakker (1988), our theorem operates\nin a completely di¤erent framework, in so far as it describes the properties\nof an entire family of preference orders, and how they are constrained by the\nmotivational salience of dimensions, rather than just a single such order, as\nin those classic results.9\nOur theorem shows that, under the two axioms we have introduced, the\nagent\u0092s preferences are representable by an additive utility function, accord-\ning to which the utility of each alternative is the sum-total of its \u0091value\u0092(as\nassessed by the agent) on all of the motivationally salient dimensions, but\nnot on other dimensions. Formally, for each S, the utility function is of the\nform uS : X ! R, where, for each x 2 X,\nuS(x) =\nP\nj2S\nvj(xj).\n8We call a dimension j 2 D e¤ective if \u0017fjg is not the all-indi¤erent order, i.e., if the\nmotivational salience of j alone lets the agent hold a strict preference between at least one\npair of alternatives in X.\n9The strength of our characterization is nicely illustrated by the following simple combi-\nnatorial consideration. In the absence of our axioms, a family of preference orders (\u0017S)S\u0012D\n(each continuous) is at best representable by 2k possible \u0091value functions\u0092(one for each\nS \u0012 D), each of which, in turn, has k arguments (corresponding to the k dimensions of\nX). Our result reduces this to a representation in terms of only k \u0091value functions\u0092, each\nof which takes only one argument (corresponding to a single dimension of X).\n11\nFor each dimension j, the value function vj by which the agent assesses the\nvalue of each alternative on dimension j can take a number of forms: It\nmay depend, for example, on the distance between the alternatives and some\n\u0091ideal\u0092location on dimension j; or it may involve a weighting of that distance\nso as to amplify or reduce dimension j\u0092s in\u0087uence compared with others; or it\nmay be an increasing function that assigns higher values to higher locations\non dimension j.10 In section 5 below, we illustrate how broadly applicable our\nframework is, by showing that several common classes of preferences studied\nin the social sciences are of the form described by theorem 1.\nIt is important to emphasize that, while our \u0091if and only if\u0092result requires\nthree or more e¤ective dimensions, the \u0091if\u0092direction also holds without this\nrestriction: Any additive utility function as just de\u0085ned satis\u0085es our two\naxioms, regardless of how many or few e¤ective dimensions there are.\nIt is now transparent how our model can explain preference change:\nProposition 1 A change in the set of motivationally salient dimensions S\nchanges the function uS and the corresponding preference order \u0017S except in\nthe special case in which every added or removed salient dimension j has a\nconstant value function vj.\nIn the next section, we consider two concrete examples of preference\nchange driven by changes in the motivational salience of dimensions.\n4 Two examples\nOur \u0085rst example concerns a change in voter preferences. It is frequently\nobserved by political scientists that some of the most signi\u0085cant changes\nin voting behaviour in recent decades can be attributed to a change in the\n10The functions v1, v2, ..., vn are unique up to positive a¢ ne transformations of the\nform vj 7! \u000bvj + \fj , with a common scalar \u000b > 0 for all j.\n12\nsalient political dimensions. In a study of partisan realignment, Miller and\nScho\u0085eld (2003), for example, observe that \u0091[p]arty voting in 1960 was still\nprimarily driven by the economic cleavage of the New Deal. Income and\nclass variations were strong predictors of individual voting behavior, with\nmiddle-class and professional homeowners voting Republican and working-\nclass union members voting Democratic... By 2000, however, the New Deal\nparty alignment no longer captured patterns of partisan voting. In the in-\ntervening 40 years, the Civil Rights and Voting Rights Acts had triggered\nan increasingly race-driven distinction between the parties.\u0092 Discussing the\nwork of Carmines and Stimson (1989) and Huckfeldt and Kohfeld (1989),\nMiller and Scho\u0085eld further point out that \u0091racial issues had become the\ndominent cleavage in American politics\u0092, driving out class-based voting, and\nthat \u0091racial polarities had come to subsume a variety of other social issues as\nwell, including abortion, womens\u0092rights, and prayer in schools.\u0092This change\nin the motivationally salient political dimensions led to a noticeable change\nin voter preferences: Several states that were predominantly Democratic in\n1960 became Republican in 2000 and vice-versa.\nTo give a simpli\u0085ed illustration of the mechanism underlying such a prefer-\nence change, consider the two-dimensional space shown in Figure 1, with two\ndisplayed alternatives, x and y, and a voter with an attributed ideal point.\nDimension 1 might represent the conventional socio-economic left-right di-\nmension, while dimension 2 might represent a \u0091social values\u0092dimension. We\nassume that, for each dimension j, the voter\u0092s value function vj on locations\non that dimension is simply given by the negative value of the distance from\nthe voter\u0092s ideal location on that dimension (we could take the square of that\nvalue if we wanted to capture Euclidean distance in the underlying space R2,\nbut the present simpler de\u0085nition is su¢ cient to make the point \u0096we dis-\ncuss more general distance-based preferences in section 5). Let us begin by\nconsidering the case in which only dimension 1 is motivationally salient for\n13\nFigure 1: Voter preferences\nthe voter, i.e., S = f1g. Clearly, x is closer to the voter\u0092s ideal point on\ndimension 1 than y is, i.e.,\nji1 \u0000 x1j < ji1 \u0000 y1j,\nand therefore\nuS(x) = v1(x1) = \u0000ji1 \u0000 x1j > \u0000ji1 \u0000 y1j = v1(y1) = uS(y),\nwhence x \u0017S y.\nBy contrast, if only dimension 2 is motivationally salient, i.e., S = f2g,\nwe \u0085nd that y is closer to the voter\u0092s ideal point on dimension 2 than x is,\ni.e.,\nji2 \u0000 y2j < ji2 \u0000 x2j,\nwhich implies\nuS(y) = v2(y2) = \u0000ji2 \u0000 y2j > \u0000ji2 \u0000 x2j = v2(x2) = uS(x),\n14\nand thus y \u0017S x. This shows that a change in the set of motivationally salient\ndimensions from S = f1g to S = f2g can lead to a preference reversal between\nx and y. Moreover, in the case in which both dimensions are motivationally\nsalient, i.e., S = f1; 2g, we also \u0085nd that y \u0017S x, since\nuS(y) = v1(y1) + v2(y2) = (\u0000ji1 \u0000 y1j) + (\u0000ji2 \u0000 y2j)\n> (\u0000ji1 \u0000 x1j) + (\u0000ji2 \u0000 x2j) = v1(x1) + v2(x2) = uS(x);\nand hence an extension of the set of motivationally salient dimensions from\nS = f1g to S = f1; 2g can also lead to the same preference reversal between\nx and y. Of course, real-world cases are more complex. Among other things,\nthe positions of parties or policy alternatives may change over and above the\nchange in motivationally salient dimensions, but the basic mechanism should\nbe clear. As famously argued by Riker (1986), a clever political manipu-\nlator who manages to in\u0087uence the perceived salience of various political\ndimensions can make use of such a mechanism to gain support for his or\nher position in the general electorate, a legislature or a committee (see also\nMcLean 2001).\nOur second example concerns preferences over consumer goods, such as\ncars, which may be evaluated, for instance, on the dimensions of convenience\nand energy e¢ ciency. Before the issue of climate change and thereby the\nenergy dimension became politically salient, many consumers preferred big\ncars, such as SUVs, to small cars, on the grounds of convenience or luxury.\nIn the recent past, however, consumer preferences in both the United States\nand Europe have signi\u0085cantly changed, and small cars have suddenly become\nmuch more popular, while SUVs have gone out of fashion. One way to explain\nthis preference change is by referring to a shift in the motivationally salient\ndimension from the convenience dimension to the energy one. This preference\nchange cannot be reduced to information learning alone: SUVs have been\nknown to be gas-guzzling all along, and they also remain as convenient as\n15\never. Of course, there is also the fact of rising energy costs, but presumably\none can identify a preference change in recent years even when controlling\nfor the cost of petrol.\nFigure 2: Consumer preferences\nFigure 2 provides a stylized illustration of this scenario. The \u0085gure shows\na two-dimensional space in which di¤erent cars between which a consumer\ncan choose, such as x and y, are located. Dimension 1 might represent con-\nvenience, dimension 2 energy e¢ ciency. Car x, the SUV, scores highly on\nconvenience but badly on energy e¢ ciency, and car y, the small car, has\nthe opposite characteristics. We assume that, for each dimension j, the con-\nsumer\u0092s value function vj on locations on that dimension is linearly increasing\n(for simplicity, we assume that it is given by vj(xj) = xj, but other, more so-\nphisticated functional forms are possible, as discussed in section 5). Again,\nwe begin by looking at the case in which only dimension 1 is motivation-\n16\nally salient for the consumer, i.e., S = f1g. Since x scores more highly on\ndimension 1 than y does, i.e., x1 > y1, we have\nuS(x) = v1(x1) = x1 > y1 = v1(y1) = uS(y),\nwhence x \u0017S y.\nOn the other hand, if only dimension 2 is motivationally salient, i.e.,\nS = f2g, then y scores more highly than x does, i.e., y2 > x2, and thus\nuS(y) = v2(y2) = y2 > x2 = v2(x2) = uS(x),\nwhich implies y \u0017S x. As in the earlier example, a change in the set of moti-\nvationally salient dimensions from S = f1g to S = f2g leads to a preference\nreversal between x and y. It is also easy to see that, if both dimensions are\nmotivationally salient, i.e., S = f1; 2g, we get y \u0017S x as well, since\nuS(y) = v1(y1) + v2(y2) = y1 + y2 > x1 + x2 = v1(x1) + v2(x2) = uS(x).\nOnce again, real-world cases are likely to be more complex, but our example\nshould illustrate, in a particularly distilled form, the basic mechanism that\nis in operation in a broad range of cases.\n5 Areas of application\nSo far we have only given relatively simple examples of individual prefer-\nences consistent with our model of preference change and the conditions\nof our representation theorem. In particular, everything has been linear in\nthese examples. It is therefore worth going through some widely recognized,\nmore realistic types of preferences in political and economic contexts, in or-\nder to see whether they also \u0085t the conditions of our theorem. If they do,\nas we show, this underlines the wide applicability of our model to many\nstandard social-scienti\u0085c phenomena. We begin by looking at distance-based\n17\npreferences, which are familiar from spatial voting theory; we then turn to\nCobb-Douglas preferences from the theory of consumer choice; and \u0085nally,\nwe consider constant-elasticity-of-substitution (CES) preferences, also orig-\ninally from consumer theory. The latter two kinds of preferences, however,\nare also relevant well beyond consumer theory. Cobb-Douglas preferences,\nfor example, have been used in areas as far removed from consumer theory as\ninternational relations, to model the preferences of state actors over bundles\nof di¤erent goods (e.g., military goods versus civilian goods) (Oren 1994),\nand CES preferences have been used in the area of environmental politics, to\nmodel the idea that people have a constant elasticity of substitution between\nincome and environmental quality, which a¤ects their willingness to support\nenvironmental policies (Jackson 1983).\n5.1 Distance-based preferences\nDistance-based preferences capture the idea that an agent has a most pre-\nferred alternative, such as a most preferred policy platform or a most pre-\nferred election candidate, and prefers other alternatives less as they get more\n\u0091distant\u0092from that most preferred preference. Accordingly, alternatives are\nrepresented by points in a multidimensional space X = Rk endowed with\nsome distance metric. The space might contain all possible policy positions,\nand the metric could be the standard Euclidean metric or another, more\ngeneral one.\nFormally, a distance-based preference order is represented by a utility\nfunction U : X ! R according to which the utility of an alternative decreases\nwith increasing distance from the agent\u0092s most preferred alternative or \u0091ideal\npoint\u0092. For each x 2 X,\nU(x) = \u0000\n \nkX\nj=1\najjxj \u0000 zjjp\n!1=p\n,\n18\nwhere z = (z1; :::; zk) is the agent\u0092s most preferred alternative or \u0091ideal point\u0092\nin X, aj \u0015 0 is the weight assigned to each dimension j, and p \u0015 1 is the\nparameter specifying the \u0091degree\u0092of the metric, often chosen to be 1 (for the\n\u0091Hamming\u0092or \u0091city-block\u0092distance) or 2 (for the \u0091Euclidean\u0092distance).11\nSuppose now, in our model, the preference order \u0017S is induced by the\nutility function\nUS(x) = \u0000\n X\nj2S\najjxj \u0000 zjjp\n!1=p\n,\nwhich captures the natural idea that salient dimensions have positive weight,\nwhile non-salient dimensions have zero weight. Then our two axioms are\nclearly satis\u0085ed: The strictly increasing transformation t 7! \u0000(\u0000t)p, which\npreserves the induced preference order \u0017S, converts US(x) into an additive\nutility function\nuS(x) =\nX\nj2S\nvj(xj),\nwith each value function vj given by vj(xj) = \u0000ajjxj \u0000 zjjp. This is precisely\nof the form described in theorem 1. Thus our model of preference change\nis applicable, for example, to standard spatial voting contexts, where it can\nexplain such phenomena as Rikerian heresthetics or partisan realignment, as\nillustrated in Miller and Scho\u0085eld\u0092s (2003) case study and our simple example\nabove.\n5.2 Cobb-Douglas preferences\nWhile distance-based preferences are based on the existence of a (\u0085nite) most\npreferred alternative, we now turn to two classes of preferences which capture\nthe idea that \u0091more is better\u0092in each dimension, as commonly assumed in\n11In the special case of equal weights aj = 1, the utility function U(x) reduces to\n\u0000kx\u0000 zkp, where k\u000fk is the p-norm.\n19\nconsumer theory and illustrated in our stylized example of consumer prefer-\nences over cars. In this subsection, we discuss Cobb-Douglas preferences, and\nin the next constant-elasticity-of-substitution preferences. As noted above,\nsuch preferences are also relevant well beyond consumer theory narrowly\nconstrued. The assumption that \u0091more is better\u0092 is plausible not only for\ndimensions representing consumption, but also for ones representing health,\nrecognition by colleagues, a¤ection by friends, wine quality etc. Even sym-\npathetic or other-regarding preferences, as famously discussed by Sen (1977),\nfall into this category: Each dimension j 2 D could represent the welfare of\none particular individual among a set of k individuals named 1; 2; :::; k, and\nthe \u0091weight\u0092of each dimension, as formally de\u0085ned in a moment, captures\nhow much the agent represented by our model cares about that individual.\nA Cobb-Douglas preference order is de\u0085ned on the space of alternatives\nX = (0;1)k and represented by the utility function U : X ! R according\nto which the utility of an alternative is a weighted product of its position on\neach dimension. Formally, for each x 2 X,\nU(x) =\nkY\nj=1\nx\naj\nj ,\nwhere aj \u0015 0 is the weight assigned to each dimension j.\nSuppose, in our model, the preference order \u0017S is induced by the utility\nfunction\nUS(x) =\nY\nj2S\nx\naj\nj ,\nagain with the inbuilt stipulation than non-salient dimensions have zero\nweight. Then our two axioms are once again satis\u0085ed: The strictly increasing\ntransformation t 7! log t converts US(x) into an additive utility function\nuS(x) =\nX\nj2S\nvj(xj),\n20\nwith each value function vj given by vj(xj) = aj lnxj, consistently with\ntheorem 1. This shows that, as in our stylized example of preference change\nover cars, our model can explain the change of standard consumer preferences\nthrough changes in the salience of dimensions.\n5.3 Constant-elasticity-of-substitution preferences\nWhile Cobb-Douglas preferences are initially de\u0085ned by a multiplicative\nutility function, constant-elasticity-of-substitution (CES) preferences have a\nmore explicitly additive form. They are de\u0085ned on the space of alternatives\nX = [0;1)k (the only di¤erence to the Cobb-Douglas case being the inclu-\nsion of the zero margin) and represented by the utility function U : X ! R\naccording to which the utility of an alternative is essentially the \u0091distance\u0092\nfrom the zero point, as de\u0085ned by an appropriate (generalized) metric.12 For\neach x 2 X,\nU(x) =\n \nkX\nj=1\najx\np\nj\n!1=p\n,\nwhere, as before, aj \u0015 0 is the weight assigned to each dimension j and\np > 0 is a parameter (interpretable as the \u0091degree\u0092of the generalized metric),\nwhich is often chosen to be less than or equal to 1, so as to de\u0085ne a convex\npreference order.13\nIf, in our model, the preference order \u0017S is induced by the utility function\nUS(x) =\n X\nj2S\najx\np\nj\n!1=p\n,\nonce more with the inbuilt stipulation than non-salient dimensions have zero\nweight, then our two axioms hold, because the strictly increasing transfor-\n12To be precise, the generalized metric becomes a proper metric when p \u0015 1.\n13In the special case of equal weights aj = 1, the utility function U(x) reduces to kxkp,\nwhere k\u000fk is the p-norm.\n21\nmation t 7! tp converts US(x) into a proper additive utility function\nuS(x) =\nX\nj2S\nvj(xj);\nwith each value function vj given by vj(xj) = ajx\np\nj , as required. This com-\npletes our illustration that several standard classes of preferences familiar\nfrom the social sciences are compatible with our model of non-informational\npreference change.\n6 Reintroducing uncertainty\nAt \u0085rst sight, it may appear that uncertainty \u0096the agent\u0092s lack of complete in-\nformation about which fundamental alternatives or outcomes will result from\nhis or her choices \u0096has been banned from our model. Indeed, so far, nothing\nin our model is probabilistic. While the agent\u0092s preferences can change as a\nresult of changes in his or her set of motivationally salient dimensions, prob-\nabilities do not come into play anywhere, and hence there appears to be no\nscope for representing uncertainty or information-driven preference change.\nContrary to this appearance, we now want to show that our model has the\nfull \u0087exibility to represent those classical phenomena as well. In short, our\nmodel is a proper generalization of a paradigmatic standard model of rational\nchoice, in so far as it can capture both informational and non-informational\npreference change.\nTo reintroduce uncertainty into our model, we make a theoretical move\ncommon in decision theory. We assume that the agent\u0092s preference order is\nde\u0085ned not merely over the alternatives in the set X, but over all possible\nlotteries on X. Each such lottery captures one particular (subjective) prob-\nability distribution over the alternatives in X. Di¤erent lotteries could thus\nrepresent either di¤erent possible choices the agent can make, which might\n22\nhave di¤erent likely consequences, or di¤erent beliefs about what the likely\nconsequences of a single choice might be.\nLet L(X) denote the set of all possible lotteries, i.e., probability distrib-\nutions, on X, for simplicity restricted to those with \u0085nite support,14 and let\n~\u0017S denote the agent\u0092s preference order (a re\u0087exive, transitive and complete\nbinary relation) over L(X), for any set of motivationally salient dimensions\nS \u0012 D. As is standard, we assume that ~\u0017S is representable by the expecta-\ntion of some utility function from X into R.\nThe order ~\u0017S naturally induces a preference order \u0017S over the original\nset of alternatives X, interpreted as the set of \u0091sure\u0092lotteries assigning prob-\nability 1 to a single element of X. We assume that the induced preference\norder \u0017S is continuous, as before.\nCan we obtain a representation theorem similar to our earlier theorem,\nwhich applies to preference orders over lotteries? The following result holds.\nTheorem 2 Suppose there are three or more e¤ective dimensions in D.\nThen the agent\u0092s preference orders ~\u0017S across all possible S \u0012 D satisfy\naxioms 1 and 2 (restricted to X) if and only if there exist continuous value\nfunctions v1 : X1 ! R, v2 : X2 ! R, ..., vk : Xk ! R such that, for any\nset of motivationally salient dimensions S \u0012 D, ~\u0017S is representable by the\nexpectation of a utility function ~uS = \u001eS \u000e uS, where\n\u000f uS : X ! R is of the additive form uS(x) =\nP\nj2S\nvj(xj) for each x 2 X,\n\u000f \u001eS : uS(X)! R is a strictly increasing transformation.15\n14Of course, the result to be presented could be generalized further to include the case\nof in\u0085nite support.\n15The set uS(X) on which \u001eS is de\u0085ned is an interval (by the continuity of uS and the\nconnectedness of X), but the image of \u001eS need not be an interval (as \u001eS need not be\ncontinuous).\n23\nThis theorem is a natural extension of our earlier theorem. While in the\nearlier, non-probabilistic case the agent\u0092s preference order \u0017S for each set of\nmotivationally salient dimensions S is directly representable by an additive\nutility function uS, in the probabilistic case the preference order ~\u0017S is rep-\nresentable by the expectation of a composite function ~uS = \u001eS \u000e uS. This\nfunction, in turn, results from the application of a strictly increasing transfor-\nmation \u001eS to an underlying additive utility function uS. The transformation\n\u001eS can be interpreted as re\u0087ecting the agent\u0092s risk attitude for each S \u0012 D.\nTypically, \u001eS is concave, convex, or a¢ ne (i.e., of the form z 7! az + b)\ndepending on whether the agent is risk averse, risk loving, or risk neutral.\nNote that this representation is still quite permissive. It allows not only\nevery possible choice of continuous value functions v1; v2; :::; vk within the\nunderlying additive utility function uS,16 but also every possible choice of\nstrictly increasing transformations \u001eS across S \u0012 D to represent the agent\u0092s\nrisk attitudes. In particular, the transformations \u001eS (for S \u0012 D) need not\neven be continuous, and they can also depend on the set of motivationally\nsalient dimensions S. Thus it is perfectly consistent with our axioms, for\ninstance, that the agent is risk loving for some sets of motivationally salient\ndimensions and risk averse for others. However, if the satisfaction of axioms\n1 and 2 is extended to the set of all lotteries L(X) (rather than restricted\nto X), the transformations \u001eS are all constrained to be positive a¢ ne and\ncan thus be dropped, so that the representation in theorem 2 reduces to the\nexact counterpart of the one in theorem 1 above.\nNow it is easy to see how uncertainty and information-driven preference\nchange can be represented in our model, along with non-informational pref-\nerence change, i.e., preference change from a gain or loss in motivationally\nsalient dimensions. The agent\u0092s preference order over some choice options\n16The existence of three or more e¤ective dimensions merely requires that at least three\nof the functions v1; :::; vk are non-constant.\n24\nchanges as a result of new information whenever the agent revises the lotter-\nies by which he or she represents those options. Ordinarily, this revision is\ndone through Bayesian updating: The relevant probability distributions after\nlearning the new information are obtained from the ones before learning it\nvia Bayes\u0092s rule (or a suitable generalization of it), as in standard rational\nchoice theory.\nThe key lesson of our extended representation theorem, however, is that\nour model retains the conceptual resources of standard rational choice theory,\nwhile also capturing the hitherto unrecognized possibility of non-informational\npreference change.\n7 Concluding remarks\nFolk psychology has long recognized the possibility of non-informational pref-\nerence change. Indeed, none of the examples of non-informational preference\nchange given in this paper should strike a non-academic reader (or indeed\na successful politician who understands how political preferences can be af-\nfected by issue salience) as particularly surprising or controversial. And yet,\nstandard rational choice theory \u0096setting aside some of the notable exceptions\ncited in our introduction \u0096adamently denies the possibility of this kind of\npreference change, proposing instead that every instance of preference change\nshould be explained in purely informational terms. Even a very sophisticated\nreview of political-science research on preference formation, which acknowl-\nedges the challenges that, for example, Tversky and Kahneman\u0092s \u0085ndings\non framing e¤ects pose for classical rational choice theory, shows little will-\ningness to give up the assumption that preference changes must always be\ninformation-driven:\n\u0091For the many substantive domains in which information changes\ndo not induce preference change, no external validity is sacri\u0085ced\n25\nby using the traditional modeling assumptions.\u0092 (Druckman and\nLupia 2000, p. 13).\nAlthough the question of how far the kind of preference change we have dis-\ncussed here can be remodelled informationally deserves more comprehensive\ntreatment (which we provide elsewhere), we wish to make two immediate\nremarks in response to it.\nFirstly, there are some formal barriers to remodelling what we describe as\nnon-informational preference change within the standard model of rational\nchoice. For a start, is it di¢ cult to capture the kind of preference change\nassociated, for instance, with dynamic inconsistency or the loss of salient\ndimensions in standard terms (because their modelling would involve a vio-\nlation of classical Bayesian rationality), while they do not create any special\ndi¢ culties in our model. In addition, any informational remodelling of such\npreference change requires an enrichment of the space of alternatives or states\nof the world over which the agent is assumed to hold beliefs and preferences.\nThus the cost of keeping the assumption of \u0085xed underlying preferences is\nthe in\u0087ated and often unnaturally complex ontology of alternatives or states\nof the world that must be ascribed to the agent.\nSecondly, and perhaps even more importantly, a good theory of ratio-\nnal choice ought to be psychologically plausible, and this is where, in our\nview, the key strength of our model lies. Many frequently observed instances\nof apparently non-informational preference change can be explained by our\nmodel in extremely natural terms, as we hope to have illustrated. Phenom-\nena which, from a classical vantage point, may come across as signi\u0085cant\nviolations of rationality and require a major explanatory stretch, reemerge\nin our model as natural consequences of a change in the agent\u0092s set of moti-\nvationally salient dimensions.\nWhy, then, is there such a strong insistence on \u0085xed underlying prefer-\nences in standard rational choice theory? We suspect that this simply stems\n26\nfrom the lack of an elegant and parsimonious model that preserves the many\nimportant and powerful insights of standard rational choice theory while\nalso capturing the possibility that certain non-informational experiences or\npsychological or physiological changes may a¤ect an agent\u0092s preferences as\nwell. We hope that the present paper contributes to \u0085lling this gap in the\nliterature.\nWhere should the present model be taken from here? Obvious exten-\nsions and generalizations of the model include the introduction of degrees of\nsalience (as opposed to the present on-o¤ notion of salience), the representa-\ntion of discrete (e.g., binary) characteristics of alternatives (as opposed to the\npresent focus on continuous characteristics), the consideration of weaker ax-\nioms (so as to obtain representation theorems that are more permissive than\nour present main theorem) and the representation of more general forms of\nbias, limited imagination or limited conceptualization in how an agent forms\nhis or her preferences over a given space of alternatives. All of these are the\nsubject of ongoing further work.\n8 References\nBecker, G. S. 1996. Accounting For Tastes. Cambridge, Mass.: Harvard\nUniversity Press.\nBenford, R. D. and D. A. Snow. 2000. \u0091Framing Processes and Social\nMovements: An Overview and Assessment.\u0092Annual Review of Sociology 26:\n611-639.\nBowles, S. 1998. \u0091Endogenous preferences: the cultural consequences of\nmarkets and other economic institutions.\u0092 Journal of Economic Literature\n36 (1): 75-111.\nCarmines, E. G. and J. A. Stimson. 1989. Issue Evolution: Race and\nthe Transformation of American Politics. Princeton: Princeton University\n27\nPress.\nDebreu, G. 1960. \u0091Topological methods in cardinal utility theory.\u0092 In K.\nJ. Arrow, S. Karlin and P. Suppes, eds. 1959. Mathematical methods in the\nsocial sciences, pp. 16-26. Palo Alto: Stanford University Press.\nDietrich, F. 2008. \u0091Modelling change in individual characteristics: an\naxiomatic framework.\u0092Working paper, University of Maastricht.\nDietrich, F. 2009. \u0091Anti-terrorism policies and the risk of provoking.\u0092\nWorking paper, London School of Economics.\nDruckman, J. N. and A. Lupia. 2000. \u0091Preference Formation.\u0092 Annual\nReview of Political Science 3: 1-24.\nDryzek, J. S. 1992. \u0091How Far is It from Virginia and Rochester to Frank-\nfurt? Public Choice as Critical Theory.\u0092British Journal of Political Science\n22 (4, Oct.): 397-417.\nDryzek, J. and C. List. 2002. \u0091Social Choice Theory and Deliberative\nDemocracy: A Reconciliation.\u0092 British Journal of Political Science 33 (1,\nJanuary): 1-28.\nFalk, A. and U. Fischbacher. 2006. \u0091A theory of reciprocity.\u0092Games and\nEconomic Behavior 54 (2, February): 293-315.\nFehr, E. and S. Gächter. 1998. \u0091Reciprocity and economics: The economic\nimplications of Homo Reciprocans.\u0092 European Economic Review 42 (3-5,\nMay): 845-859.\nFriedman, J., ed. 1996. The Rational Choice Controversy: Economic\nModels of Politics Reconsidered. New Haven: Yale University Press.\nGold, N. and C. List. 2004. \u0091Framing as Path-Dependence.\u0092 Economics\nand Philosophy 20 (2): 253-277.\nGreen, D. P. and I. Shapiro. 1994. Pathologies of Rational Choice Theory:\nA Critique of Applications in Political Science. New Haven: Yale University\nPress.\nHammond, P. J. 1976. \u0091Changing Tastes and Coherent Dynamic Choice.\u0092\n28\nReview of Economic Studies 43 (1, Feb.): 159-173.\nHuckfeldt, R. R. and C. W. Kohfeld. 1989. Race and the Decline of Class\nin American Politics. Urbana: University of Illinois Press.\nJackson, J. E. 1983. \u0091Measuring the Demand for Environmental Quality\nwith Survey Data.\u0092Journal of Politics 45 (2, May): 335-350.\nKnight, J. and J. Johnson. 1994. \u0091Aggregation and Deliberation: On the\nPossibility of Democratic Legitimacy.\u0092Political Theory 22 (2, May): 277-296.\nKrantz, D. H., R. D. Luce, P. Suppes and A. Tversky. 1971. Foundations\nof measurement, Vol. I, Additive and polynomial representations. New York:\nAcademic Press.\nList, C., R. C. Luskin, J. Fishkin and I. McLean. 2000\/2006. \u0091Delib-\neration, Single-Peakedness, and the Possibility of Meaningful Democracy:\nEvidence from Deliberative Polls.\u0092 Working paper, London School of Eco-\nnomics.\nMcLean, I. 2001. Rational Choice and British Politics: An Analysis of\nRhetoric and Manipulation from Peel to Blair. Oxford: Oxford University\nPress.\nMiller, D. 1992. \u0091Deliberative Democracy and Social Choice.\u0092 Political\nStudies 40 (Special Issue): 54-67.\nMiller, G. and N. Scho\u0085eld. 2003. \u0091Activists and Partisan Realignment in\nthe United States.\u0092American Political Science Review 97 (2, April): 245-260.\nOren, I. 1994. \u0091The Indo-Pakistani Arms Competition: A Deductive and\nStatistical Analysis.\u0092Journal of Con\u0087ict Resolution 38 (2, June): 185-214.\nPolak, R. A. 1976. \u0091Interdependent Preferences.\u0092 American Economic\nReview 66 (3, June): 309-320.\nRabin, M. 1998. \u0091Psychology and economics.\u0092Journal of Economic Lit-\nerature 36 (1): 11-46.\nRiker, W. H. 1986. The Art of Political Manipulation. New Haven: Yale\nUniversity Press.\n29\nSen, A. 1977. \u0091Rational fools: a critique of the behavioural foundations\nof economic theory.\u0092Philosophy and Public A¤airs 6 (4, Summer): 317-344.\nSen, A. 2006. Identity and Violence: The Illusion of Destiny. New York:\nW. W. Norton.\nSethi, R. and E. Somanathan. 2001. \u0091Preference Evolution and Reci-\nprocity.\u0092Journal of Economic Theory 97 (2, April): 273-297.\nStigler, G. J. and G. S. Becker. 1977. \u0091De gustibus non est disputandum.\u0092\nAmerican Economic Review 67 (2): 76-90.\nStrotz, R. H. 1955-56. \u0091Myopia and Inconsistency in Dynamic Utility\nMaximization.\u0092Review of Economic Studies 23 (3): 165-180.\nTversky, A. and D. Kahneman. 1981. \u0091The Framing of Decisions and the\nPsychology of Choice.\u0092Science 211: 453-458\nWakker, P. 1988. \u0091The algebraic versus the topological approach to addi-\ntive representations.\u0092Journal of Mathematical Psychology 32 (4, December):\n421-435.\nA Proofs of the theorems\nRecall that X1; :::; Xk are connected topological spaces (k > 0), X is their\nCartesian product, and D = f1; :::; kg is the set of dimensions.\nA.1 Proof of theorem 1\nLet\u0017S, S \u0012 D, be orders (i.e., re\u0087exive, transitive and connected binary rela-\ntions) on X that are further continuous with respect to the product topology\non X. We present three key steps of our proof as lemmas. (These lem-\nmas require neither the continuity assumption, nor even that the sets Xj are\nconnected topological spaces; they could be arbitrary sets.)\nLemma 1 Assume axiom 2. For all sets of salient dimensions S \u0012 D and\n30\nalternatives x; y 2 X, if xDnS = yDnS then x \u0017S y , x \u0017D y.\nProof of lemma 1. Assume axiom 2 and let S \u0012 D and x; y 2 X with\nxDnS = yDnS. As the equivalence x \u0017S y , x \u0017D y holds trivially if S = D,\nlet us assume that S ( D. As D is \u0085nite, a \u0085nitely repeated application\nof axiom 2 yields a nested sequence of sets S = S1 ( S2 ( ::: ( Sm = D\n(2 \u0014 m < 1) such that x \u0017Sk y , x \u0017Sk+1 y for each k 2 f1; :::;m \u0000 1g.\nHence x \u0017S y , x \u0017D y. \u0004\nFor any set S \u0012 D, any s 2 \u0002j2SXj and any t 2 \u0002j2DnSXj, we write (s; t)\nto denote the vector x 2 X given by xS = s and xDnS = t, i.e., the vector\nthat coincides with s and t on the dimensions in S and DnS, respectively.\nLemma 2 Assume axioms 1 and 2. Then x \u0017S y , (xS; zDnS) \u0017D (yS; zDnS)\nfor all alternatives x; y; z 2 X and sets of salient dimensions S \u0012 D.\nProof of lemma 2. Assume axioms 1 and 2 and let x; y; z 2 X and S \u0012 D.\nBy axiom 1,\nx \u0018S (xS; zDnS) and y \u0018S (yS; zDnS). (\u0003)\nBy lemma 1, (xS; zDnS) \u0017D (yS; zDnS) is equivalent to (xS; zDnS) \u0017S\n(yS; zDnS), which by (*) and the transitivity of \u0017S is equivalent to x \u0017S y.\n\u0004\nAs usual, we call an order \u0017 on X separable if, for every set S \u0012 D, all\ns; s0 2 \u0002j2SXj and all t; t0 2 \u0002j2DnSXj, we have (s; t) \u0017 (s0; t) , (s; t0) \u0017\n(s0; t0) (i.e., if for all S \u0012 D the way in which the subspace \u0002j2SXj is ordered\ngiven that we \u0085x the coordinates on the dimensions in DnS does not depend\non how these coordinates are \u0085xed).\nLemma 3 Assume axioms 1 and 2. The full-salience order \u0017D is separable.\n31\nProof of lemma 3. Assume axioms 1 and 2. Consider any S \u0012 D, s; s0 2\n\u0002j2SXj and t; t0 2 \u0002j2DnSXj. We have to show that (s; t) \u0017D (s0; t) ,\n(s; t0) \u0017D (s0; t0). This equivalence holds because, choosing arbitrary x; y 2 X\nwith xS = s and yS = s0, each side of it is equivalent to x \u0017S y by lemma 2.\n\u0004\nAssume now that at least three dimensions in D are e¤ective. Firstly,\nthe reader may easily check that if the preference orders \u0017S, S \u0012 D, have\nthe speci\u0085ed additive form, then they obey both axioms 1 and 2 (and would\ndo so even without our assumptions of continuity and the e¤ectiveness of at\nleast three dimensions).\nConversely, assume axioms 1 and 2. Each e¤ective dimension j 2 D is\nessential under the full-salience order \u0017D, i.e., there is a non-indi¤erence\nx 6\u0018D y for at least one pair x; y 2 X with xDnfjg = yDnfjg. To see why this\nis the case, recall that j\u0092s e¤ectiveness implies existence of a pair x; y 2 X\nwith x 6\u0018fjg y, which by lemma 2 entails x0 6\u0018D y0 where x0 := (xfjg; zDnfjg)\nand y0 := (yfjg; zDnfjg) for an arbitrarily chosen z 2 X. So, since at least\nthree dimensions j are e¤ective, at least three dimensions are essential under\n\u0017D. Moreover, \u0017D is separable by lemma 3 and continuous by assumption.\nSo, by Wakker\u0092s (1988) strengthened version of Debreu\u0092s (1960) additive\nrepresentation theorem,17 there exist continuous functions vj : Xj ! R,\nj 2 D, such that\nx \u0017D y ,\nX\nj2D\nvj(xj) \u0015\nX\nj2D\nvj(yj) for all x; y 2 X. (1)\n17Debreu\u0092s (1960) original theorem uses an additional assumption (each Xj has a count-\nable topologically dense subset), which is removed by Wakker (1988) (and earlier by Krantz\net al. 1971, yet without proving the continuity of the functions in the representation).\n32\nWe now need to show that, for all S \u0012 D and x; y 2 X, x \u0017S y is equivalent\nto X\nj2S\nvj(xj) \u0015\nX\nj2S\nvj(yj). (2)\nConsider any S \u0012 D and x; y 2 X. Fix an arbitrary z 2 X. By lemma 2,\nx \u0017S y is equivalent to (xS; zDnS) \u0017D (yS; zDnS), which by (1) is equivalent\nto X\nj2S\nvj(xj) +\nX\nj2DnS\nvj(zj) \u0015\nX\nj2S\nvj(yj) +\nX\nj2DnS\nvj(zj),\nand hence (by cancelling out) to (2), as required. \u0004\nA.2 Proof of theorem 2\nOur proof of theorem 2 draws on theorem 1. Recall that ~\u0017S, S \u0012 D, are\norders on the set L(X) of lotteries (i.e., probability distributions with \u0085nite\nsupport) over X. Each ~\u0017S is assumed to be representable by the expectation\nof some function X ! R. Identifying alternatives in X with sure lotteries,\nwe denote by \u0017S, S \u0012 D, the induced orders on X, which are continuous by\nassumption.\nSuppose at least three dimensions are e¤ective. Firstly, assume axioms\n1 and 2. Then, by the \u0091only if\u0092part of theorem 1, there exist continuous\nfunctions vj : Xj ! R, j 2 D, such that the restriction \u0017S of any ~\u0017S, S \u0012 D,\nto the set X of sure lotteries is representable by the function uS : X ! R\ngiven by uS(x) =\nP\nj2S vj(xj). Let S \u0012 D. By assumption, there exists a\nfunction ~uS : X ! R whose expectation represents ~\u0017S. In particular, ~uS\nrepresents the restriction \u0017S of ~\u0017S to X, the set of sure lotteries. So, ~uS\nrepresents the same order \u0017S as uS. Hence, ~uS = \u001eS \u000e uS for some strictly\nincreasing function \u001eS : uS(X)! R, as required.\nConversely, assume that the orders ~\u0017S, S \u0012 D, are representable in the\nspeci\u0085ed way, and let ~uS, \u001eS, uS, S \u0012 D, be the functions that feature in\n33\none such representation. In particular, the restriction \u0017S of any ~\u0017S to the\nset X of sure lotteries is representable by ~uS, hence also by uS (as uS and ~uS\nare strictly increasing transformations of each other). So, by the \u0091if\u0092part of\ntheorem 1, axioms 1 and 2 are satis\u0085ed. \u0004\n34\n"}