{"doi":"10.1080\/17470210601137086","coreId":"71487","oai":"oai:eprints.lancs.ac.uk:854","identifiers":["oai:eprints.lancs.ac.uk:854","10.1080\/17470210601137086"],"title":"Reinstating elaborative encoding operations at test enhances episodic remembering.","authors":["Dewhurst, Stephen A.","Brandt, Karen R."],"enrichments":{"references":[{"id":16350038,"title":"Levels of processing: A framework for memory research.","authors":[],"date":"1972","doi":"10.1016\/s0022-5371(72)80001-x","raw":"Craik, F.I.M., & Lockhart, R.S. (1972). Levels of processing: A framework for memory research. Journal of Verbal Learning & Verbal Behavior, 11, 671-684.","cites":null},{"id":16350041,"title":"Remember-know: A matter of confidence.","authors":[],"date":"2004","doi":"10.1037\/0033-295x.111.2.524","raw":"Dunn, J.C. (2004). Remember-know: A matter of confidence. Psychological Review, 111, 524-542.","cites":null},{"id":16350044,"title":"Memory of selfperformed tasks: Self-performing during recognition.","authors":[],"date":"1994","doi":"10.3758\/bf03202759","raw":"Engelkamp, J., Zimmer, H. D., Mohr, G. & Sellen, O. (1994). Memory of selfperformed tasks: Self-performing during recognition. Memory & Cognition, 22, 34-39.","cites":null},{"id":16350047,"title":"Functional aspects of recollective experience.","authors":[],"date":"1988","doi":"10.3758\/bf03197041","raw":"Gardiner, J.M. (1988). Functional aspects of recollective experience. Memory and Cognition, 16, 309-313.","cites":null},{"id":16350051,"title":"Remembering and knowing.","authors":[],"date":"2000","doi":"10.1037\/e501882009-537","raw":"Gardiner, J.M., & Richardson-Klavehn, A. (2000). Remembering and knowing. In E. Tulving & F.I.M. Craik (Eds), Handbook of memory (pp. 229-244). New York: Oxford University Press.","cites":null},{"id":16350055,"title":"Enhancing the generation effect through repetition of operations.","authors":[],"date":"1985","doi":"10.1037\/\/0278-7393.11.2.193","raw":"Glisky, E.L., & Rabinowitz, J. (1985). Enhancing the generation effect through repetition of operations. Journal of Experimental Psychology: Learning, Memory, & Cognition, 11, 193-205.","cites":null},{"id":16350058,"title":"Recognition memory and awareness: A large effect of study test modalities on “know” responses following a highly perceptual orienting task.","authors":[],"date":"1994","doi":"10.1080\/09541449408520140","raw":"Gregg, V. H., & Gardiner, J.M. (1994). Recognition memory and awareness: A large effect of study test modalities on “know” responses following a highly perceptual orienting task. European Journal of Cognitive Psychology, 6, 131-147.","cites":null},{"id":16350061,"title":"A decrement-to-familiarity interpretation of the revelation effect from forced-choice tests of recognition memory.","authors":[],"date":"1998","doi":"10.1037\/0278-7393.24.5.1105","raw":"Hicks, J.L., & Marsh, R.L. (1998). A decrement-to-familiarity interpretation of the revelation effect from forced-choice tests of recognition memory. Journal of Experimental Psychology: Learning, Memory, & Cognition, 24, 1105-1120.","cites":null},{"id":16350064,"title":"Remembering the data: Analyzing interactive processes in reading.","authors":[],"date":"1983","doi":"10.1016\/s0022-5371(83)90301-8","raw":"Jacoby, L.L. (1983). Remembering the data: Analyzing interactive processes in reading. Journal of Verbal Learning & Verbal Behavior, 22, 485-508.   18 Java, R.I., Gregg, V.H., & Gardiner, J.M. (1997). What do people actually remember (and know) in &quot;remember\/know&quot; experiments? European Journal of Cognitive Psychology, 9, 87-197.","cites":null},{"id":16350066,"title":"Remembering operations.","authors":[],"date":"1973","doi":"10.3758\/bf03198119","raw":"Kolers, P.A. (1973). Remembering operations. Memory & Cognition, 1, 347– 355. LeCompte, D.C. Recollective experience in the revelation effect: Separating the contributions of recollection and familiarity. Memory & Cognition, 23, 324-334.","cites":null},{"id":16350068,"title":"Environmental context and recognition: The role of recollection and familiarity.","authors":[],"date":"2002","doi":"10.1037\/\/0278-7393.28.1.153","raw":"Macken, W.J. (2002). Environmental context and recognition: The role of recollection and familiarity. Journal of Experimental Psychology: Learning, Memory and Cognition, 28, 153-161.","cites":null},{"id":16350070,"title":"Levels of processing versus transfer appropriate processing.","authors":[],"date":"1977","doi":"10.1016\/s0022-5371(77)80016-9","raw":"Morris, C.D., Bransford, J.D., & Franks, J.J. (1977). Levels of processing versus transfer appropriate processing. Journal of Verbal Learning & Verbal Behavior, 16, 519-533.","cites":null},{"id":16350072,"title":"An asymmetry between memory encoding and retrieval.","authors":[],"date":"2006","doi":"10.1111\/j.1467-9280.2005.01657.x","raw":"Mulligan, N.W., & Lozito, J.P. (2006). An asymmetry between memory encoding and retrieval. Psychological Science, 17, 7-11.","cites":null},{"id":16350074,"title":"Retrieval processes.","authors":[],"date":"1996","doi":"10.1016\/b978-012102570-0\/50009-4","raw":"Roediger, H.L., & Guynn, M.J. (1996). Retrieval processes. In E.L. Bjork & R.A. Bjork (Eds.), Human Memory. (pp. 197-236). San Diego: Academic Press.","cites":null},{"id":16350076,"title":"The generation effect: Delineation of a phenomenon.","authors":[],"date":"1978","doi":"10.1037\/\/0278-7393.4.6.592","raw":"Slamecka, N.J., & Graf, P. (1978). The generation effect: Delineation of a phenomenon. Journal of Experimental Psychology: Learning, Memory, & Cognition, 13, 501-518.","cites":null},{"id":16350077,"title":"Memory and consciousness.","authors":[],"date":"1985","doi":"10.1037\/h0080017","raw":"Tulving, E. (1985). Memory and consciousness. Canadian Psychologist, 26, 1-12.","cites":null},{"id":16350078,"title":"Encoding specificity and retrieval processes in episodic memory.","authors":[],"date":"1973","doi":"10.1037\/h0020071","raw":"Tulving, E., & Thompson, D. (1973). Encoding specificity and retrieval processes in episodic memory. Psychological Review, 80, 352-272.   19 Watkins, M.J., & Peynircioglu, Z.F. (1990). The revelation effects: When disguising test items induces recognition. Journal of Experimental Psychology: Learning, Memory, & Cognition, 16, 1012-1020.   20","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007-01-30","abstract":"Two experiments investigated the effects of reinstating encoding operations on remember and know responses in recognition memory. Experiment 1 showed that reinstating an effortful encoding task (generating words from fragments) increased remember responses at test but reinstating an automatic encoding task (reading intact words) did not. This pattern was confirmed in Experiment 2 in which words were either read intact or generated from anagrams. These findings show that repeating effortful (but not automatic) encoding operations at test cues not only the recognition of the information that was acquired via those operations but also the conscious recollection of the encoding episode","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71487.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/854\/2\/Dewhurst_%26_Brandt_revision_2.pdf","pdfHashValue":"4dcbfea5635d6e40b946f885e7a99e69d1a6843a","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:854<\/identifier><datestamp>\n      2018-01-24T03:17:46Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D42:4246<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Reinstating elaborative encoding operations at test enhances episodic remembering.<\/dc:title><dc:creator>\n        Dewhurst, Stephen A.<\/dc:creator><dc:creator>\n        Brandt, Karen R.<\/dc:creator><dc:subject>\n        BF Psychology<\/dc:subject><dc:description>\n        Two experiments investigated the effects of reinstating encoding operations on remember and know responses in recognition memory. Experiment 1 showed that reinstating an effortful encoding task (generating words from fragments) increased remember responses at test but reinstating an automatic encoding task (reading intact words) did not. This pattern was confirmed in Experiment 2 in which words were either read intact or generated from anagrams. These findings show that repeating effortful (but not automatic) encoding operations at test cues not only the recognition of the information that was acquired via those operations but also the conscious recollection of the encoding episode.<\/dc:description><dc:date>\n        2007-01-30<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/854\/2\/Dewhurst_%26_Brandt_revision_2.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1080\/17470210601137086<\/dc:relation><dc:identifier>\n        Dewhurst, Stephen A. and Brandt, Karen R. (2007) Reinstating elaborative encoding operations at test enhances episodic remembering. The Quarterly Journal of Experimental Psychology, 60 (4). pp. 543-550. ISSN 1747-0218<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/854\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1080\/17470210601137086","http:\/\/eprints.lancs.ac.uk\/854\/"],"year":2007,"topics":["BF Psychology"],"subject":["Journal Article","PeerReviewed"],"fullText":"Reinstating effortful encoding operations at test enhances episodic remembering \n \nStephen A. Dewhurst \nDepartment of Psychology, Lancaster University, England \n \nKaren R. Brandt \nSchool of Psychology, University of Keele, England \n \nShort title: Reinstating encoding operations \n \nWord count = 3981 \n \nPlease address correspondence to: \nStephen A. Dewhurst \nDepartment of Psychology \nLancaster University \nLancaster LA1 4YF \nEngland \nTel: 01524 593835 \nFax: 01524 593744 \nEmail: s.a.dewhurst@lancaster.ac.uk \n 1 \nAcknowledgement \nThis research was supported by Grant F\/00185\/G awarded by the Leverhulme Trust. \nWe thank the Trust for its support. \n 2 \nTwo experiments investigated the effects of reinstating encoding operations on \nremember and know responses in recognition memory. Experiment 1 showed that \nreinstating an effortful encoding task (generating words from fragments) increased \nremember responses at test but reinstating an automatic encoding task (reading intact \nwords) did not. This pattern was confirmed in Experiment 2 in which words were \neither read intact or generated from anagrams. These findings show that repeating \neffortful (but not automatic) encoding operations at test cues not only the recognition \nof the information that was acquired via those operations but also the conscious \nrecollection of the encoding episode.  \n 3 \nAccording to many influential theories of memory, successful retrieval \ndepends on the degree to which the operations performed at retrieval overlap with \nthose performed at encoding. For example, the encoding specificity principle (Tulving \n& Thompson, 1973), the transfer-appropriate-processing framework (Morris, \nBransford, & Franks, 1977), and the proceduralist approach to memory (Kolers, 1973) \nall emphasise the importance of the compatibility of encoding and retrieval operations \n(see Roediger & Guynn, 1996, for a review). According to these theories, details of \nthe operations performed at encoding form part of the representation of the \ninformation acquired via those operations. Repeating the same operations at test cues \nthe retrieval of that information. The question addressed in the present study was \nwhether reinstating encoding operations at test facilitates the conscious recollection of \nthe encoding episode or simply increases the familiarity of the material learned during \nthat episode.  \nPrevious research has shown that recognition memory is enhanced when \nparticipants perform the same orienting task at study and test. For example, Glisky \nand Rabinowitz (1985) investigated the generation effect in recognition memory by \nasking participants to read some of the study items and generate the others from \nfragments. They replicated the generation effect, whereby participants were more \nlikely to recognise words that were generated at study rather than read (Slamecka & \nGraf, 1978). Test items were also presented as words or fragments, with half \nappearing in their study format and half in the alternative format. The recognition of \nwords that were generated at encoding was enhanced when they were also generated \nat test.  \n 4 \nA similar pattern was reported by Engelkamp et al. (1994) using the enactment \nparadigm. Participants were presented with a series of action phrases, such as “close \nthe book”, and instructed either to read the phrase only or to read the phrase and \nperform the action. Engelkamp et al. replicated the enactment effect, whereby \nparticipants remembered the enacted phrases better than the read phrases. Engelkamp \net al. also found that the enactment effect was enhanced when the same phrases were \nenacted again at test.  \nThese findings indicate that repeating encoding operations at test aids the \nrecognition of items encoded via those operations. The present study used the \nremember-know procedure (Gardiner, 1988; Tulving, 1985) to investigate whether \nthis effect occurs by increasing the conscious recollection of the studied items or by \nincreasing their familiarity. In the remember-know procedure, participants are \ninstructed to categorise each positive recognition decision as either a remember (R) or \na know (K) response on the basis of their subjective experience. They make an R \nresponse if their recognition features the conscious recollection of episodic details \nsuch as thoughts, images, and associations that occurred when the item was encoded, \nor a K response if their recognition is based on a feeling of familiarity in the absence \nof conscious recollection. Findings from studies that have used the remember-know \nprocedure indicate that R and K responses are functionally distinct (see Gardiner & \nRichardson-Klavehn, 2000).  \nPrevious research suggests that both R and K responses can be influenced by \nthe reinstatement of encoding processes. For example, Gregg and Gardiner (1994) \ninvestigated the effects of study-test modality shifts on R and K responses. \nParticipants in Experiment 2 studied a series of words presented visually at rapid \n 5 \npresentation rates and their task was to check whether any of the letters were blurred. \nThis task was chosen to direct participants’ attention to perceptual attributes of the \nstimuli. The test items were then presented either visually or auditorially. Gregg and \nGardiner found that the shift from visual processing at study to auditory processing at \ntest significantly reduced K responses but not R responses. They suggested that the \nreduction in K responses occurred because the modality shift impaired the fluency \nwith which the test items were processed.  \nIn contrast to the findings of Gregg and Gardiner (1994), Macken (2002) \nfound that R but not K responses were reduced by changes in context. Context in this \nstudy was determined by a combination of the colour and location of a word on a \ndisplay monitor and the colour of the background. Test items were presented either in \ntheir study context or in a novel context. Words presented in the novel context were \nassociated with significantly fewer R responses relative to words presented in their \noriginal context. Macken suggested that reinstating the encoding context at test \nincreased R responses by cueing the conscious recollection of item-context \nassociations formed at encoding.  \nIf reinstating context at test increases the conscious recollection of item-\ncontext associations, the same pattern should be observed when the orienting task \nperformed at study is repeated at test. The present study investigated this possibility. \nExperiment 1 adopted the read-generate manipulation used by Glisky and Rabinowitz \n(1985) in which words were either read or generated from fragments. Test items were \npresented either in the same condition as at study or in the alternative condition. \nBased on Macken’s findings, we predicted that reinstating encoding operations at test \nwould selectively enhance R responses, as repeating the orienting task should cue the \n 6 \nconscious recollection of the encoding episode. This prediction is also supported by \nthe findings of Java, Gregg, and Gardiner (1997) that the recollection of operations \ncarried out at encoding is often the basis for making an R response.  \nThis prediction is at odds with recent findings by Mulligan and Lozito (2006) \nthat reinstating encoding operations at test reduced recognition accuracy. They \ninvestigated the revelation effect, in which items presented in a recognition test are \nmore likely to be selected as old if they are obscured and have to be revealed in order \nto be processed (Watkins & Peynircioglu, 1990). The revelation effect is similar to the \ngeneration effect except that presentation format is manipulated at test rather than at \nstudy. Mulligan and Lozito presented participants with eight-letter words or eight-\nletter anagrams at both study and test, with stimulus type (intact or anagram) \nmanipulated between participants. Test items were presented in either their study \nformat or the alternative format. Using d’ to measure recognition accuracy, Mulligan \nand Lozito found that items presented as anagrams at study were associated with \ngreater accuracy than items presented intact. In contrast, the manipulation of stimulus \ntype at test produced the opposite effect, whereby items presented intact at test were \nassociated with greater recognition accuracy than items presented as anagrams.  \nMulligan and Lozito’s findings appear to contradict theories of memory that \nemphasise the importance of the overlap between encoding and retrieval processes. \nWe therefore conducted a second experiment in which we attempted to reconcile their \nfindings with those of previous studies showing that recognition memory is enhanced \nby the repetition of encoding operations.  \nExperiment 1 \n 7 \nExperiment 1 was essentially a replication of Glisky and Rabinovitz (1985) \nwith the addition of a remember\/know decision. Participants studied five-letter words \nor generated them from four-letter fragments and test items were presented in either \ntheir study format or in the alternative format. Test items presented as fragments had \nto be generated before a recognition decision was made.  \nMethod \nParticipants. Participants were 40 undergraduates from Lancaster University, \nall of whom were native English speakers. They were tested individually and received \na payment of £3.  \nStimuli and Design. Stimuli consisted of 80 common five-letter words, divided \ninto two sets of 40. Four-letter fragments of each word were created by deleting one \nletter and indicating its position with an underscore (e.g. ADU_T). Each fragment had \nonly one possible solution. Participants studied 40 items, of which 20 were presented \nintact and 20 were presented as fragments. Intact words and fragments were presented \nin a different random order for each participant. \nProcedure. Study items were presented individually on Apple Macintosh \ncomputers. Participants were instructed to read the intact words aloud. For the \nfragments, they were instructed to identify the word and then speak it aloud. Each \nitem remained on the screen for three seconds. Participants were informed they would \nlater be given a memory test for the items. The recognition test consisted of the 40 \nstudied items plus the unstudied set. Study and lures were counterbalanced across \nparticipants. Of the 40 studied items, 20 were presented in their study format (intact or \nas fragments) and 20 were presented in the alternative format. Participants were again \ninstructed to read the intact words aloud and to generate and say aloud the fragments \n 8 \nbefore making their recognition decisions. Lure items were also presented either intact \nor as fragments.  \nParticipants made old\/new and remember\/know\/guess decisions for each item \nand indicated their decisions by pressing labelled response keys. We included a \nseparate “guess” (G) response in order to remove guesses from the K category. \nParticipants were instructed to make an R response if their recognition featured the \nrecollection of contextual details such as thoughts and images experienced at study, a \nK response if their decision was based on a feeling of familiarity, and a G response if \nthey were uncertain whether or not the item had appeared at study.  \nResults and Discussion \n Following Glisky and Rabinowitz (1985), statistical analyses consisted of 2x2 \n(Study Format x Test Format) repeated-measures Analyses of Variance (ANOVA). \nSeparate analyses were conducted on R and K responses, with alpha set at .05. \nGuesses were not analyzed as they are typically made at chance levels. However, their \nmean proportions are included in the tables. Table 1 shows mean proportions of \ncorrect and false R, K, and G responses as a function of study and test formats.  \n(Table 1 about here) \nCorrect R responses showed a significant main effect of study format, \nwhereby generated items were associated with more R responses than read items, F \n(1,39) = 60.29, MSE = 2.93. The main effect of test format was not significant, F \n(1,39) = 1.19, MSE = 2.55, p = .29. This was qualified by a significant study x test \ninteraction, F (1,39) = 5.53, MSE = 2.39. Pairwise comparisons showed that the \nadvantage for items generated at study was reliable regardless of whether they were \ngenerated or read at test, t = 6.99 and 3.99 respectively. The source of the interaction \n 9 \nwas in the effects of test format. Items that were generated at test were associated with \nmore R responses than items that were read at test, but only when the generated items \nhad also been generated at study, t = 2.38. In other words, the generation effect in R \nresponses was enhanced when the same items were generated at test. Test format did \nnot reliably affect items that were read at study, t = 0.84. \nThe effect of study format on K responses was in the opposite direction to that \nobserved in R responses but did not reach statistical significance, F (1,39) = 2.92, \nMSE = 2.20, p = .10. Neither the main effect of test format nor the interaction \nbetween study and test were reliable, F < 1. False alarms were analyzed in a 2x2 (test \nformat x response type) ANOVA which showed that they were more likely to be \ncategorised as K than as R responses, F (1, 39) = 9.47, MSE = 3.16. Neither the effect \nof test format nor the interaction with response type were reliable, F < 1.  \nExperiment 1 replicated the generation effect, whereby words that were \ngenerated at encoding were more likely to be recognised than words that were read at \nencoding. The presence of this effect in R but not K responses is consistent with \nprevious findings by Gardiner (1988). The main finding from Experiment 1, however, \nwas that R responses were also enhanced by generation at test, but only when the \nitems had been generated at study. In other words, reinstating the same generation \noperations at test selectively increased R responses. These findings are consistent with \nthose of Glisky and Rabinowitz (1985) and indicate that reinstating generation at test \ninfluences the recollection component of recognition memory. In contrast, reinstating \nthe Read condition at test did not enhance R responses, suggesting that the \nreinstatement effect occurs only for effortful encoding operations. This is considered \nfurther in the General Discussion.  \n 10 \nIn contrast to the findings of Experiment 1, Mulligan and Lozito (2006) found \nthat repeating the generation task at test reduced recognition accuracy (as measured \nby d’). There are a number of possible reasons for the discrepancy between their \nfindings and ours. One is that Mulligan and Lozito manipulated study and test format \nbetween-groups, whereas we used a fully within-groups design. A second is that we \ndid not replicate the standard revelation effect in Experiment 1, in that test format did \nnot reliably influence recognition. It is possible that the pattern of results obtained by \nMulligan and Lozito depends on the presence of a revelation effect. In order to \naddress these two issues, we conducted Experiment 2 in which we replicated the \nanagram procedure used by Mulligan and Lozito but manipulated study and test \nformat in a within-groups design.  \nExperiment 2 \nMethod \n The Method was the same as Experiment 1 with the following modifications: \nA new group of 40 undergraduates were presented with 20 eight-letter words and 20 \neight-letter anagrams. Following Mulligan and Lozito (2006), a number appeared \nbelow each letter indicating its position in the solution. Each anagram had the same \nsolution of 54687321. Each item was preceded by the instruction “read” or “anagram” \nand remained on the screen for 10 s or until the participants produced the correct \nresponse.  Once the correct response was produced the presentation program was \nadvanced manually by the experimenter. If the correct response was not produced \nwithin the 10 s period the experimenter provided the solution. The study list was \npreceded by six practise trials (three words and three anagrams). Test items (the 40 \nold items plus 40 new items, fully counterbalanced) were presented in either their \n 11 \nstudy format or the alternative format. Participants made oral old\/new decisions \nfollowed by remember\/know\/guess decisions for each item judged as old.   \nResults and Discussion \n Table 2 shows mean proportions of correct and false R, K, and G responses as \na function of study and test formats. Correct and false R and K responses were \nanalyzed in separate 2x2 (study format x test format) ANOVAs. R responses showed \na significant main effect of study format, F (1,39) = 103.71, MSE = 2.20, whereby \nmore R responses were made to generated than to read items. The main effect of test \nformat was also significant, F (1,39) = 8.28, MSE = 2.81, and showed that more R \nresponses were made to items that were generated at test. The interaction between \nstudy and test format was also significant, F (1,39) = 28.92, MSE = 2.21. Pairwise \ncomparisons revealed the same pattern as was found in Experiment 1. Words \ngenerated at study were associated with more R responses, regardless of whether they \nwere generated or read at test, t = 11.01 and 3.39 respectively. The source of the \ninteraction was again located in the effects of test format. Words generated at test \nwere associated with more R responses than words read at test, but only if they had \nbeen generated at study, t = 5.40. Test format did not reliably affect words that were \nread at study, t = 1.33.  \n(Table 2 about here) \n Correct K responses were not reliably affected by study format, F < 1. There \nwas a significant main effect of test format, F (1,39) = 12.87, MSE = 1.52, whereby \nitems that were read at test were associated with more K responses than items that \nwere generated at test. The interaction between study and test format was not \nsignificant, F < 1. A 2x2 (test format x response type) ANOVA on false alarms \n 12 \nshowed that they were more likely to be categorised as K rather than R responses, F \n(1,39) = 23.01, MSE = 1.45. Neither the main effect of test format nor the interaction \nwere significant, F < 1.  \n Experiment 2 replicated Experiment 1 in that repeating the generation task at \ntest increased R responses to words that were generated at study. As in Experiment 1, \nreinstating the Read condition at test did not enhance memory. In contrast to \nExperiment 1, a revelation effect was observed whereby participants made more old \nresponses for items generated at test than for items read at test. This finding indicates \nthat the discrepancy between the results of Experiment 1 and those of Mulligan and \nLozito (2006) cannot be due to the absence of a revelation effect. The presence of a \nrevelation effect in Experiment 2 but not Experiment 1 is likely due to the fact that \ngenerating from anagrams is more effortful than generating from fragments.  \nGeneral Discussion \n The main finding from the present study was that generating words at retrieval \nincreased R responses to words that had been generated at encoding. Previous studies \nhave shown that recognition memory is enhanced by the repetition of encoding \noperations such as generation (Glisky & Rabinowitz, 1985) and enactment \n(Engelkamp et al., 1994). The present findings suggest that this enhancement occurs \nbecause repeating encoding operations cues the conscious recollection of items \nencoded via those operations, rather than simply increasing their familiarity. The \nfindings from the Generate condition are thus consistent with theories of memory that \nemphasise the importance of the overlap between encoding and retrieval operations, \nsuch as the encoding specificity principle (Tulving & Thompson, 1973), the transfer \nappropriate processing framework (Morris, Bransford, & Franks, 1977), and the \n 13 \nproceduralist view of memory (Kolers, 1978). The proceduralist view of memory is \nparticularly relevant to the present findings as it emphasises the overlap between the \ncontent of knowledge and the means by which that knowledge was acquired.  \nThe findings from the Read condition, however, are inconsistent with the \nabove theories in that reading words at test did not enhance the recognition of words \nthat were read at encoding. This asymmetry was also found by Glisky and Rabinowitz \n(1985) and Engelkamp et al. (1994) and indicates that retrieval is not enhanced by the \nreinstatement of all encoding operations, but only by the reinstatement of effortful \noperations that enhance recognition when instantiated at encoding. Reinstating an \nencoding task that does not increase recognition, such as reading relative to \ngeneration, does not produce the same memory enhancement. Our findings suggest \nthat the effortful nature of the generation task produces an episodic representation that \nfeatures both the target and the operations that led to its identification. Repeating the \nsame operations at test cues the recollection of the target. This is less likely to occur \nin a task such as reading, in which the operations that lead to the identification of the \ntarget are relatively automatic. \nThe findings from the Generate condition contrast with those of Mulligan and \nLozito (2006) who found that generating words at both study and test reduced \nrecognition accuracy. The difference between their findings and ours may be due in \npart to their use of a between-groups design, in which one group of participants \nstudied words and another studied anagrams. Within each group, half the participants \nperformed the same task at test whereas the remaining participants performed the \nalternative task. In contrast, the present study used a fully within-groups design. It is \npossible that reinstating encoding operations at test increases the relative \n 14 \nmemorability of test items, in that test items that appear in their study format are more \neasily recognised in comparison to items that appear in the alternative format. Such an \neffect is more likely to occur in a within-groups design. It is also notable that the \nreduction in recognition accuracy reported by Mulligan and Lozito was located \nentirely in the false alarms, which were greater for anagrams than for intact words. \nHicks and Marsh (1998) found that the increase in false alarms following revelation \nwas more likely to occur in a between-groups design than a within-groups design.  \n Mulligan and Lozito claimed that their findings are at odds with theories of \nmemory in which “successful memory retrieval recapitulates encoding processes” \n(p.10). We believe the operative phrase here is “successful memory retrieval”. It is \npossible that the Read and Generate orienting tasks led to list-wide context effects, \ninfluencing both hits and false alarms. However, the findings from the present study \nsuggest that the effect of reinstating encoding operations occurs primarily on an item-\nspecific basis, in that it cues the conscious recollection of the items presented at study. \nIf this is the case, manipulating the overlap between encoding and retrieval operations \nis meaningless as far as false alarms are concerned, as lures in a recognition test are \nby definition not presented at study. It is therefore questionable whether d’ is an \nappropriate measure for such data, given that it includes the false alarm rates. \nOther investigations of the revelation effect have also found it to be larger in \nfalse alarms than in hits (e.g., LeCompte, 1995; Watkins & Peynircioglu, 1990). \nLeCompte’s study is particularly relevant to the present experiments as it included R \nand K measures (Experiment 2). Although LeCompte found no evidence of a \nrevelation effect in overall hits, the analysis of R and K responses showed that correct \nR responses were reduced by revelation while correct K responses were increased. At \n 15 \nfirst glance this appears to contradict the present findings. However, in LeCompte’s \nstudy the read-versus-generate manipulation was conducted only on test items (as is \nusually the case in investigations of the revelation effect) whereas the present study \nmanipulated the orienting task at both study and test. Considered together, these \nfindings suggest that when the orienting task is manipulated only at test, generated \nitems are associated with elevated levels of familiarity, as indicated by increases in \ncorrect and false K responses. When the orienting task is manipulated at both study \nand test, R responses are enhanced for items that were generated at both stages, at \nleast in a within-groups design.  \nOur use of the remember\/know procedure implies a tacit assumption that R \nand K responses reflect separate processes in recognition memory. This contrasts with \nthe view expressed in unidimensional models that R and K responses reflect different \nthresholds on a single underlying dimension of confidence or trace strength (e.g., \nDunn, 2004). According to such models, participants make R responses to items that \nexceed the higher threshold and K responses to items that fall between the two \nthresholds. Although the present findings do not arbitrate between these accounts, our \nview is that unidimensional models can mimic the decision process in recognition \nmemory but say nothing about the psychological processes on which the decision is \nbased. They also fail to explain differences between R and K responses in terms of \nsubjective experience and patterns of brain activity (see Gardiner & Richardson-\nKlavehen, 2000, for a review).  \nTo summarise, our findings show that reinstating the generation task at test \ncues both the recognition of the generated items and the conscious recollection of the \nencoding episode. These findings are consistent with the view that R responses reflect \n 16 \nepisodic memories that include details of the encoding context, such as the operations \ncarried out on the stimuli, as well as the information acquired via those operations \n(Gardiner, 1988; Java et al., 1997; Tulving, 1985). In contrast, repeating the Read \ncondition at test did not enhance memory. This asymmetrical pattern (see also Glisky \n& Rabinowitz, 1985, and Engelkamp et al., 1994) suggests that the enhancement of R \nresponses by the reinstatement of encoding operations occurs only with effortful \norienting tasks that enhance recollection when instantiated at encoding.  \n 17 \nReferences \nCraik, F.I.M., & Lockhart, R.S. (1972). Levels of processing: A framework \nfor memory research. Journal of Verbal Learning & Verbal Behavior, 11, 671-684.  \nDunn, J.C. (2004). Remember-know: A matter of confidence. Psychological \nReview, 111, 524-542. \nEngelkamp, J., Zimmer, H. D., Mohr, G. & Sellen, O. (1994). Memory of self-\nperformed tasks: Self-performing during recognition. Memory & Cognition, 22, 34-\n39. \n Gardiner, J.M. (1988). Functional aspects of recollective experience. Memory \nand Cognition, 16, 309-313. \n Gardiner, J.M., & Richardson-Klavehn, A. (2000). Remembering and \nknowing. In E. Tulving & F.I.M. Craik (Eds), Handbook of memory (pp. 229-244). \nNew York: Oxford University Press.  \n Glisky, E.L., & Rabinowitz, J. (1985). Enhancing the generation effect \nthrough repetition of operations. Journal of Experimental Psychology: Learning, \nMemory, & Cognition, 11, 193-205. \nGregg, V. H., & Gardiner, J.M. (1994). Recognition memory and awareness: \nA large effect of study test modalities on “know” responses following a highly \nperceptual orienting task. European Journal of Cognitive Psychology, 6, 131-147. \nHicks, J.L., & Marsh, R.L. (1998). A decrement-to-familiarity interpretation \nof the revelation effect from forced-choice tests of recognition memory. Journal of \nExperimental Psychology: Learning, Memory, & Cognition, 24, 1105-1120. \nJacoby, L.L. (1983). Remembering the data: Analyzing interactive processes \nin reading. Journal of Verbal Learning & Verbal Behavior, 22, 485-508. \n 18 \n Java, R.I., Gregg, V.H., & Gardiner, J.M. (1997). What do people actually \nremember (and know) in \"remember\/know\" experiments? European Journal of \nCognitive Psychology, 9, 87-197. \n Kolers, P.A. (1973). Remembering operations. Memory & Cognition, 1, 347–\n355. \n LeCompte, D.C. Recollective experience in the revelation effect: Separating \nthe contributions of recollection and familiarity. Memory & Cognition, 23, 324-334.  \nMacken, W.J. (2002). Environmental context and recognition: The role of \nrecollection and familiarity. Journal of Experimental Psychology: Learning, Memory \nand Cognition, 28, 153-161. \nMorris, C.D., Bransford, J.D., & Franks, J.J. (1977). Levels of processing \nversus transfer appropriate processing. Journal of Verbal Learning & Verbal \nBehavior, 16, 519-533. \nMulligan, N.W., & Lozito, J.P. (2006). An asymmetry between memory \nencoding and retrieval. Psychological Science, 17, 7-11.  \nRoediger, H.L., & Guynn, M.J. (1996). Retrieval processes. In E.L. Bjork & \nR.A. Bjork (Eds.), Human Memory. (pp. 197-236). San Diego: Academic Press. \n Slamecka, N.J., & Graf, P. (1978). The generation effect: Delineation of a \nphenomenon. Journal of Experimental Psychology: Learning, Memory, & Cognition, \n13, 501-518. \nTulving, E. (1985). Memory and consciousness. Canadian Psychologist, 26, \n1-12. \nTulving, E., & Thompson, D. (1973). Encoding specificity and retrieval \nprocesses in episodic memory. Psychological Review, 80, 352-272. \n 19 \nWatkins, M.J., & Peynircioglu, Z.F. (1990). The revelation effects: When \ndisguising test items induces recognition. Journal of Experimental Psychology: \nLearning, Memory, & Cognition, 16, 1012-1020. \n 20 \n            \n Table 1. Mean Proportions (with Standard Errors) of Correct and False Remember,  \nKnow, and Guess Responses as a Function of Study and Test Format in Experiment 1.  \n            \nRemember responses \n   Study Format   \nTest Format  Generate Read  Mean  False  Alarms \nGenerate  .67 (.04) .40 (.03) .53 (.04) .04 (.01) \nRead   .58 (.04) .43 (.03) .51 (.04) .04 (.01) \nMean   .63 (.04) .42 (.03) \n            \nKnow Responses \nStudy Format   \nTest Format  Generate Read  Mean  False Alarms \nGenerate  .21 (.03) .24 (.02) .22 (.03) .08 (.01) \nRead   .21 (.03) .26 (.03) .23 (.03) .08 (.01) \nMean   .21 (.03) .25 (.03) \n            \nGuess Responses \nStudy Format   \nTest Format  Generate Read  Mean  False Alarms \nGenerate  .04 (.01) .08 (.02) .06 (.02) .06 (.05) \nRead   .05 (.01) .07 (.02) .06 (.02) .07 (.03) \nMean   .05 (.01) .07 (.02) \n           \n 21 \n            \nTable 2. Mean Proportions (with Standard Errors) of Correct and False Remember,  \nKnow, and Guess Responses as a Function of Study and Test Format in Experiment 2.  \n            \nRemember responses \n   Study Format   \nTest Format  Generate Read  Mean  False Alarms  \nGenerate  .65 (.03) .28 (.03) .46 (.03) .03 (.01) \nRead   .44 (.03) .33 (.03) .39 (.03) .02 (.01) \nMean   .54 (.03) .31 (.03) \n            \nKnow Responses \nStudy Format   \nTest Format  Generate Read  Mean  False Alarms \nGenerate  .25 (.03) .22 (.02) .23 (.02) .07 (.01) \nRead   .31 (.02) .30 (.02) .30 (.02) .07 (.01) \nMean   .28 (.03) .26 (.02) \n            \nGuess Responses \nStudy Format   \nTest Format  Generate Read  Mean  False Alarms \nGenerate  .05 (.01) .11 (.02)  .08 (.02) .06 (.01) \nRead   .09 (.01) .12 (.02)  .10 (.02) .09 (.02) \nMean   .07 (.01) .11 (.02) \n              \n"}