{"doi":"10.1080\/0968776000080102","coreId":"14268","oai":"oai:generic.eprints.org:316\/core5","identifiers":["oai:generic.eprints.org:316\/core5","10.1080\/0968776000080102"],"title":"Staff development at RMIT: Bottom‐up work serviced by top‐down investment and policy","authors":["McNaught, Carmel","Kennedy, Paul"],"enrichments":{"references":[{"id":199129,"title":"Design elements for interactive multimedia',","authors":[],"date":"1997","doi":null,"raw":"Kennedy, D. K. and McNaught, C. (1997), 'Design elements for interactive multimedia', Australian Journal of Educational Technology, 13 (1), 1-22. Laurillard, D., Technology strategy for academic advantage. Open University, UK, http:\/\/www2.open.ac.uk\/LTTO\/internal\/tsaa.htm.","cites":null},{"id":199132,"title":"Developing and evaluating a university-wide online Distributed Learning System: The experience at RMIT University',","authors":[],"date":"1999","doi":null,"raw":"McNaught, C., Kenny, J., Kennedy, P. and Lord, R. (1999), 'Developing and evaluating a university-wide online Distributed Learning System: The experience at RMIT University', Educational Technology and Society, 2 (4), http:\/\/ifets.gmd.de\/periodical\/vol_4_99\/mcnaught.html. McNaught, C., Phillips, P., Rossiter, D., and Winn, J. (forthcoming), Developing a Framework for a Usable and Useful Inventory of Computer-facilitated Learning and Support Materials in Australian Universities, Evaluations and Investigations Program report. Canberra: Higher Education Division Department of Employment, Education, Training and Youth Affairs.","cites":null},{"id":199128,"title":"Developing new roles and skills',","authors":[],"date":"1997","doi":null,"raw":"Hughes, C., Hewson, L. and Nightingale, P. (1997), 'Developing new roles and skills', in Yetton, P. (ed.), Managing the Introduction of Technology in the Delivery and Administration of Higher Education, Evaluations and Investigations Program report 97\/3, Canberra: Australian Government Publishing Service, 49-79, http:\/\/www.detya.gov.au\/highered\/eippubsl997.htm.","cites":null},{"id":199134,"title":"Diffusion of Innovations, Fourth Edition,","authors":[],"date":"1995","doi":null,"raw":"Rogers, E. M. (1995), Diffusion of Innovations, Fourth Edition, New York: The Free Press.","cites":null},{"id":199133,"title":"Effective dimensions of interactive learning on the World Wide Web',","authors":[],"date":"1997","doi":null,"raw":"Reeves, T. C. and Reeves, P. M. (1997), 'Effective dimensions of interactive learning on the World Wide Web', in B. H. Khan (ed.), Web-based Instruction, Englewood Cliffs, New Jersey: Educational Technology Publications, 59-66. 17Camel McNought and Paul Kennedy Staff development at RMIT RMIT Education and Training IT Alignment Project, http:\/\/www.online.rmit.edu.au\/main.cfm?code=ia00.","cites":null},{"id":199131,"title":"First Year on Campus, A commissioned project for the Committee for the Advancement of University Teaching. Canberra: Australian Government Publishing Service.","authors":[],"date":"1995","doi":null,"raw":"Mclnnis, C., James, R. and McNaught, C. (1995), First Year on Campus, A commissioned project for the Committee for the Advancement of University Teaching. Canberra: Australian Government Publishing Service.","cites":null},{"id":199130,"title":"Loss and Change,","authors":[],"date":"1974","doi":"10.2307\/590168","raw":"Marris, P. (1974), Loss and Change, London: Routledge & Kogan Page.","cites":null},{"id":199126,"title":"Scholarship Reconsidered Priorities of the Professoriate,","authors":[],"date":"1990","doi":"10.2307\/40250362","raw":"Boyer, E. L. (1990), Scholarship Reconsidered Priorities of the Professoriate, Princeton, New Jersey: The Carnegie Foundation for the Advancement of Teaching.","cites":null},{"id":199127,"title":"Staff development responses to the demand for online teaching and learning',","authors":[],"date":"1998","doi":null,"raw":"Ellis, A., O'Reilly, M. and Debreceny, R. (1998), 'Staff development responses to the demand for online teaching and learning', in Corderoy, R. (ed.) FlexibilITy: The Next Wave? Proceedings of the Australian Society for Computers in Learning in Tertiary Education Conference, University of Wollongong, 191-201.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2000","abstract":"Effective staff development is the weaving together of many strands. We need to support staff in their current work, while providing them with ideas, incentives and resources to look for new ways to design learning environments which will enhance student learning. Staff development must be combined with specific projects where change is occurring. Ideas are not hard to find Incentives and resources are another matter. The paper will outline some general principles for effective staff development. These principles will be applied in the description of the substantial investment RMIT has made in order to realize our teaching and learning policy. We have a model of ‘grass‐roots’ faculty‐based work funded by large‐scale corporate ‘investment’. ‘Bottom‐up’ meets ‘top‐down’","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14268.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/316\/1\/ALT_J_Vol8_No1_2000_Staff%20development%20at%20RMIT_%20Bot.pdf","pdfHashValue":"bb8aa909f5eb275d1b7d6b4e1ee519b416bb60c8","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:316<\/identifier><datestamp>\n      2011-04-04T09:16:25Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/316\/<\/dc:relation><dc:title>\n        Staff development at RMIT: Bottom‐up work serviced by top‐down investment and policy<\/dc:title><dc:creator>\n        McNaught, Carmel<\/dc:creator><dc:creator>\n        Kennedy, Paul<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Effective staff development is the weaving together of many strands. We need to support staff in their current work, while providing them with ideas, incentives and resources to look for new ways to design learning environments which will enhance student learning. Staff development must be combined with specific projects where change is occurring. Ideas are not hard to find Incentives and resources are another matter. The paper will outline some general principles for effective staff development. These principles will be applied in the description of the substantial investment RMIT has made in order to realize our teaching and learning policy. We have a model of ‘grass‐roots’ faculty‐based work funded by large‐scale corporate ‘investment’. ‘Bottom‐up’ meets ‘top‐down’.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2000<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/316\/1\/ALT_J_Vol8_No1_2000_Staff%20development%20at%20RMIT_%20Bot.pdf<\/dc:identifier><dc:identifier>\n          McNaught, Carmel and Kennedy, Paul  (2000) Staff development at RMIT: Bottom‐up work serviced by top‐down investment and policy.  Association for Learning Technology Journal, 8 (1).  pp. 4-18.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776000080102<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/316\/","10.1080\/0968776000080102"],"year":2000,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Staff development at RMIT: bottom-up work\nserviced by top-down investment and policy\nCarmel McNaught and Paul Kennedy\nRoyal Melbourne Institute of Technology, Australia\nemail: carmel. mcnaught@rmit.edu.ac\nEffective staff development is the weaving together of many strands. We need to support\nstaff in their current work, while providing them with ideas, incentives and resources to\nlook for new ways to design learning environments which will enhance student learning.\nStaff development must be combined with specific projects where change is occurring.\nIdeas are not hard to find Incentives and resources are another matter. The paper will\noutline some general principles for effective staff development. These principles will be\napplied in the description of the substantial investment RMIT has made in order to\nrealize our teaching and learning policy. We have a model of 'grass-roots' faculty-based\nwork funded by large-scale corporate 'investment'. 'Bottom-up' meets 'top-down'.\nEducational design as the key to successful flexible learning\nWhat is the business of a university in the 1990s and 2000s? Quantity and quality are both\nimportant considerations in modern universities as they seek to maintain important\nintellectual and physical spaces for their staff to pursue creative research and development,\nwhile at the same time needing to provide teaching for escalating numbers of students in all\ncourses in order to shore up funding. These student cohorts have become increasingly\ndiverse (Mclnnis, James and McNaught, 1995) with more part-time students and students\nfrom a greater variety of backgrounds. Flexible modes of delivery have been widely viewed\nas the prime way of meeting the challenges posed by this diversity. There has been a fair\namount of naive equating of flexible delivery with production of online materials ('Plug\nthem into the Web') and insufficient attention to the relationship between flexible modes of\noperation for students, the use of communication and information technologies, and the\ndesign of educationally sound learning environments (Kennedy and McNaught, 1997;\nReeves and Reeves, 1997). However, there is no doubt that communication and\ninformation technologies will be a major part of future university planning, as several\nrecent reports make clear (e.g. Yetton et al., 1997).\n4\nALT-J Volume 8 Number I\nDiscussions about using technology for flexible learning often centre on variation in time\nand place access to learning experiences. But it must mean more, if we are to believe that\ntechnology can meaningfully enhance students' learning experiences. Looking at how we\ncan cater for a variety of learning styles, for example, by offering a variety of learning\nactivities and a variety of assessment strategies, is essential.\nGood educational design is the key to successful flexible learning. Here at RMIT\nUniversity we offer staff a set of online tools to assist them in refurbishing their subjects\nand courses. We explain the functionality of each of the tools in terms of student learning\nactivities. Table 1 matches some student learning needs, with examples of the design of\nsuitable student activities, with components of the online toolset. Several of the tools could\nbe used for most of the activities; examples are used for simplicity.\nStudent learning need Examples of student activity Example of current RMIT\nbenchmark Distributed Learning\nSystem (DLS) toolset component\nInformation handling skills\nDeveloping understanding\nLinking theory to practice\nPractising discussion\nand argument\nPractising articulation of ideas\nRehearsing skills and\nprocedures\nPractising teamwork\nLearning professional\npractice\nWeb searching;\nusing electronic Library databases\nBuilding links between information\nfrom various sources;\nproblem-solving exercises\nWorking with embedded media and\nsimulations in course material;\ntutorial programs with feedback\nOnline debates using a threaded\ndiscussion\nRole playing using a threaded\ndiscussion;\nsharing essays online\nOnline quizzes with feedback\nGroup projects\nAll of the above!\nCourselnfo\/ BSCW\nQuestion Mark\nCourselnfo\nHybrid systems with\nCD-Roms\nWebBoard\nWebBoard\nBSCW\nPerception Question Mark\nBSCW\n(The student learning need is based on Laurillard: www2.open.ac.uk\/LTTO\/intemal\/tsaa.htm)\nTable I: Functions of the RMIT DLS toolset\nUniversities as organizations which support or hinder innovation\nIn a recent investigation into the factors supporting the adoption of computer-facilitated\nlearning (CFL) at Australian universities (McNaught, Phillips, Rossiter and Winn,\nforthcoming), three major themes emerged. These were policy, culture and support. The\n5\nCamel McNaught and Paul Kennedy Staff development at RMIT\nconsiderable overlap between and within these themes is illustrated in Figure 1. There\nneeds to be a congruence of policy, culture and support factors if significant adoption of\nCFL strategies is to occur.\nThe policy theme looked at specific institutional policies, such as equity and intellectual\nproperty, the alignment of policy throughout the organization, the direction of policy\nchange (bottom-up or top-down) and a number of strategic processes which flowed on\nfrom policies such as grant schemes. Culture incorporated factors such as collaboration\nwithin institutions, and personal motivation of staff to use CFL, as well as particular\naspects of funding, staff rewards and time, leadership, teaching and learning models, and\nattitudes such as 'not invented here'. Support incorporated a whole gamut of institutional\nissues including IT, library and administrative infrastructure, professional development for\nstaff, student support, educational and instructional design support for academic staff,\nfunding and grant schemes, and IT literacy.\nSeveral universal factors in relation to widespread use of CFL were identified:\n• coherence of policy across all levels of institutional operations and specific policies\nwhich impact on CFL within each institution;\n• intellectual property, particularly the role of copyright in emerging online environments;\n• leadership and institutional culture;\n• staff issues and attitudes, namely, professional development and training, staff\nrecognition and rewards, and motivation for individuals to use CFL;\n• specific resourcing issues related to funding for maintenance or updating of CFL\nmaterials and approaches, staff time release and support staff.\nFunding\nRewards\nLeadership\nT&L models\nInfrastructure\n(Library, ITS,\nAdmin)\nFigure I: Themes and their\nrelationships affecting the\nadoption of CFL\n6\nAn-J Volume 8 Number I\nStaff development and training\nIn all universities this is seen as a vitally important area. We should not underestimate the\ndifficulties involved in innovation and change. Marris (1974) parallels the sense of loss\nduring bereavement to the resistance one can feel when letting go of known ways of doing\nthings and embarking on new strategies. For many academics the increasing emphasis on\nthe use of computer technology for administration, research and teaching is highly\nthreatening. We need to recognize these fears and devise plans which build staff confidence\nand motivation, and provide adequate support and training opportunities.\nStaff development can no longer be a pleasant 'cottage industry' on the fringes of academe\nor the enthusiastic enterprise of a few individuals supported by 'soft' money. Effective staff\ndevelopment is positioned at the centre of university functioning and yet needs to retain\nconnections with the needs and perceptions of teaching staff. This is a demanding\nchallenge. Staff development programmes that are successful in meeting the needs of\ncomplex modern Australian universities need to be supported strategically (and\nfinancially) by their own universities.\nHughes, Hewson and Nightingale (1997), in a study of twenty Australian universities,\ndescribe three approaches to staff development for the use of information technology in\nteaching - integrated, parallel and distributed. These approaches are defined and the\ndiscussion in Hughes et al. is summarized in Table 2. In reality, universities use a\ncombination of approaches, though with a trend in one direction. The table is useful as a\ntool for assessing the potential strengths and weaknesses of the combination of any\nparticular set of support units in a given university\nThe number of players in the professional development area is large, including:\n• 'Traditional' academic development units, concentrating on general teaching and\nlearning support; these can be centrally located or in faculties.\n• Units where the key focus is the use of communication and information technologies in\nteaching and learning. These can be centrally located or in faculties. They are often\ncalled flexible learning units.\n• Units which focus on courseware production using technology. These can be centrally\nlocated or in faculties. Some of these units have evolved from print-based distance\neducation units or centrally-based Information Technology Services units.\n• University libraries.\nEllis, O'Reilly and Debreceny (1998) reported on an online survey of twenty academic\ndevelopment units (48 per cent response rate with a follow-up phone survey conducted of\nnon-respondents) about staff development activities for technology in teaching and\nlearning undertaken during 1997 and those planned for 1998. Results show that most of\nthis type of staff development is still delivered by traditional methods such as classroom\npresentations, demonstrations and half-day tutorials while online methods of delivering\nstaff development are less frequently used. The content of these courses covers a broad\nrange of topics with the most popular being pedagogical issues in online course design,\nWeb page design, and course authoring systems. Staff undertaking training tended to be\nfrom a cross-section of academic levels. Staff development activities of this nature are not\n7\nCarmel McNought and Paul Kennedy Staff development at RMIT\nIntegrated Approach (eggs in one basket!)\nStrong structural links between units or section of the one unit which provide general T&L support, support\nfor using IT in T&L, and production support for courseware. Essentially top-down.\nBenefits: Issues raised by\nCoherent policy framework. Ease of access by all staff limited.\nEfficient planning of resources and Individual approaches less likely to be\navoidance of duplication. recognized.\nAn emphasis on one technological solution\nmay emerge and overwhelm educational\ndesign.\nParallel approach (never the twain shall meet?)\nSeparate units for general T&L support and support for using IT in T&L\nBenefits: Issues raised by.\nAllows due recognition to be given to a Co-operation between the various units may be\nwide range ofT&L issues (e.g internationalization) and difficult to achieve.There is a potential for\nnot just educational design associated with the use of IT. confusion and competition to emerge.\nAllows the development of expertise relating to the May result in a narrow range of educational issues\nnew technologies. being addressed in the IT in T&L units.\nDistributed approach (organic sprouting)\nMore bottom-up than the other two approaches. A range of units, centrally located and in faculties which are\nnot tightly co-ordinated. Project management remains with local projects.\nBenefits: Issues raised by:\nAn 'organic' solution where unnecessary controls Can result in weak project management where\ndo not hamper innovation. there may be insufficient educational expertise.\nCan be economical as skills are sought when they Potential for innovations to falter without visible\nare needed. institutional support\nCan result in waste and duplication of effort and\nresources, including equipment\nTable 2: Integrated, parallel and distributed approadhes to staff development for the use of information\ntechnology in teaching (after Hughes et a\/, \/ 997)\nexclusively provided by the academic staff development unit, but tend to be carried out by\na range of internal and external providers, as noted above. The academic development\nunits often play a key role in establishing and maintaining relationships between these units\nand the co-ordination of their activities is essential to the development of coherent and\ncomprehensive staff development programmes.\nMcNaught et al. (forthcoming), identify six key issues in staff development:\n• The appropriate balance point between centrally provided and local staff development\nservices needs to be determined in each university. Central services can be more clearly\n8\nAa-J Volume 8 Number I\nlinked to university priorities; faculty or department services can be more in touch with\nlocal needs.\nAs technology becomes more mainstream, support services need to be scaled up. This\ninvolves deciding on the level of support that can be afforded and the model of support\nwhich is most apposite. The educational design and evaluation, technical, and media\nproduction support services that universities currently have are under strain. It is\nunlikely that the existing examples of good practice at each university will be sufficient\nto ensure that new or revised subjects will be well designed and evaluated. By modelling\ngood practice themselves, mentors can assist staff to make optimal use of resources.\nA follow-on issue is determining the optimal relationship between staff development\nand production support services. Again, this needs to be decided in each university\ncontext.\nEven if an integrated model of professional development is adopted, there are still\nmany professional development providers at most universities. Mapping the services of\neach provider and ensuring reasonable co-ordination is increasingly important as the\nneed for support services scales up.\nAcademic and general staff work load is a key issue. Careful work planning to ensure\nthat staff have time to learn new skills and manage new processes is essential.\nWe are in a time of rapid change. It is important that professional development support\nbe flexible, appropriate and adaptable. It should make sense to staff, be linked to\npractice and be appropriately timed.\nJust how effective are academic development unit activities in\nsupporting adoption of CFL?\nFigure 2 shows how staff in academic development units (ADUs) at Australian universities\nrate various activities in terms of how effective they believe each activity is in increasing the\nuptake of CFL in their university. The data in the survey in McNaught et al. (forthcoming)\nwere represented by a five-point scale from 'very important' (5) through to 'not important'\n(1); the data have been collapsed into two categories - 'important' (4 and 5) and 'limited\nimportance' (1-3) in order to see trends more clearly.\nThis can be compared with the responses of seventy-three members of ASCILITE\n(Australasian Society of Computers in Learning in Tertiary Education - the Australasian\nequivalent of ALT) - who rated how effective they believed each activity had been in\nsupporting their use of CFL materials (Figure 3). The profiles are remarkably similar.\nEducational design and individual consultations are believed to be most important.\nHowever, as many ASCILITE members are innovators or early adopters (see Figure 4\nbelow), this congruence between the perceptions of providers and clients must be tempered\nwith the need to provide staff development across the whole range of staff expertise and\ninterest. Indeed, coverage of support for all staff, not just the enthusiast teachers, has\nalways been a major issue for academic development work.\n9\nCarmel McNought and Paul Kennedy Staff development at RMIT\nEffectiveness of ADU Activit ies (Q 4.7)\nNumber of Universities\n0 5 10 15 20 25\nUniWshop\nFacWshop\nSoftTrain\nITLitStaff\nITLitStud\nInfoLitStaff\nInfoLitStud\nEdDesignCourse\nEdDesignUnit\nConsult\nEvalCFL\nCFLresource\nCFL inven\nAssess\nOnline\nGrants\nVisitors\n(•Important • Limited Importance\nKey.\nUniWshop: General workshops\nacross the university\nFacWshop: Faculty\/ department\nworkshops\nSoftTrain: Software training\nsessions\nITLitStaff: IT literacy support for\nstafT\nITLitStud: IT literacy support for\nstudents\nEdDesignCourse: Educational\ndesign of entire courses\nEdDesignUnit Educational design\nof units\nConsult Individual consultations\nEvalCFL: Evaluation of computer-\nfacilitated learning (CFL)\ninnovations\nCFLresource: Providing information\nabout CFL resources\nCFLinven: Maintaining an inventory\nof CFL projects in the university\nAssess: Support for computer-\nbased assessment systems\nOnline: Support for online learning\nsystem\nGrants: Facilitation of grant writing\nfor CFL development\nVisitors:Visiting specialists, teachers,\nscholars\nFigure 2: ADU Assessment of effectiveness of various activities in supporting the uptake of CFL\nAre all staff being supported?\nA recent survey of ASCILITE members (McNaught et al., forthcoming) showed\ninteresting data about the perceptions innovators or early adopters have about their\ncolleagues. Most of the seventy-three members surveyed regarded themselves as innovators\nor early adopters (Figure 4) and many had developed significant projects single-handedly\nwith little support from faculties or their university. These members were able to see the\nneed for a well-supported environment for development. They were asked to categorize\nthemselves on the scale:\n• innovators;\n• early adopters;\n• users when technology is mainstream;\n• very reluctant users.\nio\nALT-J Volume 8 Number I\nKey. See Figure 2. Note\nthatASCIUTE\nmembers were not\nasked about the\neffectiveness of visiting\nspeakers and scholars\nas several members\nwork in this capacity\nthemselves.\nfigure 3: ASCIUTE\nmembers' assessment\nof effectiveness of\nvarious activities in\nsupporting their\nuptake ofCFL\nEffectiveness of Members Activities (Q 5.2)\n10\nNumber of Universities\n20 30 40 50 60 70 80\nUniWshop\nFacWshop\nSoftTrain\nITUStaff\nITUtStud\nInfoUtStaff\ninfoLHStud\nEdDesignCourse\nEdDesignUnit\nConsult\nEvalCFL\nCFLresource\nCFL inven\nAssess\nOnline\nGrants\nI i\ni i\nan IBM\nIs Important • Limited Importance\nfigure 4: Schematic diagram of\nphases of technology take-up\n(after Rogers, 1995)\nInnovators\nEarly adopters\nI\nUsers when technology is mainstream\nVery reluctant users\nIntroduction of technology\nWe also asked them to consider where the majority of staff in each category of\ndepartment\/ faculty\/ university were on this scale. The results are shown in Figure 5. The\ndata from the survey were in four categories; the data have been collapsed into two\nI I\nCarmel McNaught and Paul Kennedy Staff development at RMIT\nCFL Adoption Patterns (Q 5.1)\n20 40 60\nNumber of Universities\nS Innovators\/ Adopters • Users\nFigure 5: ASC\/UTE members'\nperceptions of CFL adoption patterns\nat their universities\ncategories - innovators\/ adopters and users\/ reluctant users - in order to see trends more\nclearly. It is striking how isolated in many ways these innovators\/early adopters are. The\nmajority of respondent ASCILITE members considered themselves to be innovators or\nearly adopters while they perceived that the majority of staff at their institutions only used\ntechnology when it was mainstream or were very reluctant users.\nHow big are the staff development needs?\nData obtained from Information Technology Services units at Australian universities\nprovide insight into another issue relating to staff using computer-facilitated learning\nstrategies. Figure 6 illustrates software support available to staff and their use of it. Note\nthat while the respondent universities were all able to provide data about university\ninfrastructure software support, many did not comment on staff and student use. It is clear\nthat staff do not use the full range of technologies available to them. There are complex\nissues relating to culture, staff development and adequate provision of facilities at a local\nlevel that relate to the fact that the majority of Australian academics use their computers\nfor email, Web-browsing and maybe basic Web teaching, and office applications (Word,\nPowerPoint and Excel). Also, it may be that some technologies will not be considered\nappropriate by the majority of staff and will not be used widely. Of course, it is heartening\nto note that many universities have set in place useful infrastructure for software support\nbut, as indicated above, staff will use technology in their teaching when culture, policy and\nsupport structures are congruent.\nApplying these ideas to the context of RMIT University\nUniversities in Australia are currently in an environment of intense change. They are being\nrequired to. educate more students, from an increasing variety of backgrounds, with\ndecreasing government funding. Universities are required to compete vigorously for\nstudent enrolments and external sources of funding. In this environment, universities have\nhad to reassess their fundamental business and the way they go about it. Information\ntechnology (IT) is viewed as an important factor in streamlining their operations.\nI2\nALT-J Volume 8 Number I\nFigure 6: Software support available to\nstaff and their usage.\nKey. email, Web, telnet, ftp, synchronous chat\ndesktop videoconferencing, studio\nvideoconferencing, streaming audio,\nstreaming video, dial-up access, general\nOffice applications\nUniversity Infrastructure Software Support for Staff\n(0 2.1)\nNumber of Universities\n0 5 10 15\nUsage of Technologies by Staff\n(Q 2.2.1)\nNumber of Universities\n5 10 15 20 25\nWWW\nTelnet\nFTP\nSynch\nVideoC\nStudioVC\nStream Audio\nStream Video\nDial-up\nOffice\nI\nI\n|B Major • Minor • No reply |\nRMIT University is an 'old' (in Australian terms; RMIT began in 1887) technological\nuniversity. It is highly diverse - it is a bi-sectoral (includes vocational sector) university and\nhas the largest number of international students of any Australian university. There are\nseven strong faculties which often resist central directions. In recent years there has not\nbeen a strong staff development programme.\nIn the program which is described below, RMIT wanted staff development which:\n• is linked to RMIT business and vision;\n• promotes sound educational practice;\n• ensures flexible learning is 'owned' in every department;\n13\nCarmel McNaught and Paul Kennedy Staff development at RMIT\n• organizes adequate support for all staff;\n• results in low increase in staff work loads.\nThere are two key policy documents which are currently guiding the direction RMIT takes\nfor the next three to five years. The first is the Teaching and Learning Strategy (T&LS).\nRMIT teaching and learning strategy\nThe RMIT teaching and learning strategy aims to provide a student-centred learning\nenvironment where:\n• subject programmes and the courses they comprise are designed to develop the\nfollowing graduate attributes in students: knowledgeable, critical, responsible, creative\nand with a capacity for life-long learning, leadership and employability and an\ninternational outlook;\n• the system is flexible enough to suit the particular learning needs of students in terms\nof their prior experience and current situation;\n• courses are designed and implemented holistically with coherent connections between\nsubjects comprising the core of a course;\n• students and the community are seen as significant stakeholders;\n• assessment is directly related to the explicitly stated objectives of subjects;\n• quality improvement and quality assurance based on reflective practice and customer-\nfocused systems design are ubiquitous.\nThere are resources allocated to implement the T&LS both in human and financial terms.\nFor example, each faculty has two senior positions established by secondment of academic\nstaff members from within the faculty. Each faculty has a developing Faculty Education\nServices Group (FESG) where technical and educational support for staff is available.\nRMIT IT Alignment Programme\nRMIT University established a project team in 1998 to develop an Information\nTechnology Strategy designed to facilitate the implementation of the objectives of the\nTeaching and Learning Strategy in respect of electronically mediated flexible learning\nenvironments. The RMIT Education and Training Alignment Project (ITAP) report (1998)\ndelivered by the team in June 1998 and adopted by the University, forms the basis for a\n$A50 million investment by RMIT over the next three years (1999-2001).\nThe report comprises several elements:\n• IT infrastructure aligned with the needs of education to deliver the systems and\nhardware necessary to provide students with an electronically connected learning\nenvironment and access to computer-based learning resources;\n• a Distributed Learning System (DLS) compliant with the emerging Educom\/CAUSE\nInstructional Management System (IMS);\n• a Student Management System (SMS), fully integrated with the DLS to provide\nenrolment and subject and course progress records electronically accessible to\nacademics and students;\n14\nALT-J Volume 8 Number I\nan extensive review of all academic processes within the university in a Business Process\nRe-engineering (BPR) project;\nextensive staff development.\nEnacting the RMIT teaching and learning strategy through the\nIT alignment project: designing the RMIT distributed learning\nsystem\nWe have to deliver on our promise that we can provide a flexible set of tools that will enable\nstaff who are not technological whizz kids to develop pedagogically sound, interesting, and\nrelevant online courses in an efficient and well administered way. How have we designed\nour Distributed Learning System (DLS)? Here are some of our principles:\n• a suite of tools, not just one;\n• integrating educational principles into the description of the toolset;\n• IMS compliance of all tools;\n• a team approach to all online projects;\n• involvement of all seven faculties in a benchmarking exercise to evaluate the toolset\nand the effectiveness of the learning environments we are building.\nA learning-centred evaluation is being attempted. In order to set up a base-line for the\nteachers' reflections, teachers in each DLS project are asked to articulate the student\nlearning outcomes for their subject and where they think the online experience would\nenhance learning. We ask all teachers to submit a weekly journal entry via an online\nfeedback form to continue this process of reflection. It is quite difficult to extract this\nstream of continuous reflection from teachers (staff workload remains an issue), but\nseveral teachers do give us formal and informal feedback from time to time. As much of\nthe informal anecdotal feedback is in email messages, the substance can be captured.\nWe also use the usual evaluation strategies with students of online questionnaires, focus\ngroups, analysis of Web access data, analysis of support\/ help desk records, and analysis of\nperformance on learning outcomes. At this stage we really have only anecdotal evidence of\nlearning enhancement (or otherwise).\nEach semester we use a spreadsheet to collate the feedback data collected from staff and\ndata received from staff and students from the DLS Help Desk. This is supplemented by\ndata from student surveys conducted by individual subjects and reports from focus groups\nwith students. The data are then coded using an iterative method whereby each discrete\nstatement is assigned a descriptive category; these are then reviewed with some reduction\nof the number of categories occurring. For example, in Semester 1 of 1999 this process led\nto the identification of thirty-nine categories under which the comments were grouped.\nThe categories were grouped under seven headings - access, toolset competence, support,\nstudent issues, educational outcomes, communication and miscellaneous. A report on the\nevaluation of Semester 1 1999 DLS subjects is given in McNaught, Kenny, Kennedy and\nLord (1999).\nis\nCarmel McNaught and Paul Kennedy Staff development at RMIT\nStaff development through the Learning Technology Mentor\nProgramme\nApproximately seventy Learning Technology Mentors have been appointed - one in each\ndepartment of the university and some in central areas such as the Library. These are\nmostly academic and teaching staff who have funded one day a week time release to\ndevelop online materials and support their colleagues in their departments to engage with\nonline teaching and learning. Initially this is a one-semester program but it will be extended\nin 2000, giving some LTMs a further 26 days' time release, and bringing another cohort of\n120 LTMs on board.\nThese LTMs undertake an extensive staff development programme about a week long.\nSome of the key topics are:\n• RMIT's vision with respect to the university's position as a major international\ntechnological university. The Boyer (1990) Scholarship model has been used for some\ntime as an integrating model for all RMIT work.\n• The evolution of the Teaching and Learning Strategy over the last few years.\n• The structure and function of the ITAP; description and key staffing of the ITAP\nTeams. Some comment on the importance of the Business Process Re-engineering\n(BPR).\n• Course and subject renewal guidelines exist in all faculties and form a central focus of\nthe T&LS and the way in which ITAP works. The concept of graduate attributes is part\nof this process.\n• Roles of the faculty-based Faculty Education Services Groups (FESGs). Relationship\nbetween FESGs and central ITAP Teams.\n• Overview of the DLS toolset; how the use of the DLS tool? relates to the renewal of\nsubjects.\nAdditional staff development sessions are run each week. These sessions cover a range of\npractical 'hands-on' sessions and workshops in areas such as assessment and evaluation\nstrategies for online learning, student induction methods, managing digital resources,\nproject management, etc.\nAll LTMs develop a work contract with the first author who heads the Professional\nDevelopment Team of the ITAP; if individual staff wish this can be formalized into\naccreditation for a subject in a Graduate Certificate of Flexible Learning.\nWe are seeing that staff development and support for developing online learning materials\nand strategies must become distributed across the organization. Therefore the role of the\nfaculty-based Faculty Education Services Groups (FESGs) is pivotal. Growth needs to occur\nin these units rather than at the centre. We believe that technical support staff, educational\ndesigners and graphical designers are needed at faculty level and the only courseware\nproduction that should exist at the centre is some support for high-end media production and\nmultimedia production. We are trying to combine the benefits of both the integrated and\ndistributed approached mentioned earlier by Hughes et al. (1997).\n16\nALT-} Volume 8 Number I\nWhere to from here?\nWe have a great deal of consolidation and development to do. We have been delighted by\nthe enthusiasm of many Learning Technology Mentors. We have a sense of gathering\nmomentum. In one year we have 190 subjects using the Distributed Learning System and\nmany more in planning for use in 2000. Several faculties are showing real commitment,\nthough a couple might still need a persuasive nudge. Have we reached critical mass yet,\nwhere the appropriate use of technology will roll out across the University? Probably not,\nbut we feel we are on the right track.\nReferences\nBoyer, E. L. (1990), Scholarship Reconsidered Priorities of the Professoriate, Princeton,\nNew Jersey: The Carnegie Foundation for the Advancement of Teaching.\nEllis, A., O'Reilly, M. and Debreceny, R. (1998), 'Staff development responses to the\ndemand for online teaching and learning', in Corderoy, R. (ed.) FlexibilITy: The Next\nWave? Proceedings of the Australian Society for Computers in Learning in Tertiary\nEducation Conference, University of Wollongong, 191-201.\nHughes, C., Hewson, L. and Nightingale, P. (1997), 'Developing new roles and skills', in\nYetton, P. (ed.), Managing the Introduction of Technology in the Delivery and\nAdministration of Higher Education, Evaluations and Investigations Program report 97\/3,\nCanberra: Australian Government Publishing Service, 49-79,\nhttp:\/\/www.detya.gov.au\/highered\/eippubsl997.htm.\nKennedy, D. K. and McNaught, C. (1997), 'Design elements for interactive multimedia',\nAustralian Journal of Educational Technology, 13 (1), 1-22.\nLaurillard, D., Technology strategy for academic advantage. Open University, UK,\nhttp:\/\/www2.open.ac.uk\/LTTO\/internal\/tsaa.htm.\nMarris, P. (1974), Loss and Change, London: Routledge & Kogan Page.\nMclnnis, C., James, R. and McNaught, C. (1995), First Year on Campus, A commissioned\nproject for the Committee for the Advancement of University Teaching. Canberra:\nAustralian Government Publishing Service.\nMcNaught, C., Kenny, J., Kennedy, P. and Lord, R. (1999), 'Developing and evaluating a\nuniversity-wide online Distributed Learning System: The experience at RMIT University',\nEducational Technology and Society, 2 (4),\nhttp:\/\/ifets.gmd.de\/periodical\/vol_4_99\/mcnaught.html.\nMcNaught, C., Phillips, P., Rossiter, D., and Winn, J. (forthcoming), Developing a Framework\nfor a Usable and Useful Inventory of Computer-facilitated Learning and Support Materials in\nAustralian Universities, Evaluations and Investigations Program report. Canberra: Higher\nEducation Division Department of Employment, Education, Training and Youth Affairs.\nReeves, T. C. and Reeves, P. M. (1997), 'Effective dimensions of interactive learning on the\nWorld Wide Web', in B. H. Khan (ed.), Web-based Instruction, Englewood Cliffs, New\nJersey: Educational Technology Publications, 59-66.\n17\nCamel McNought and Paul Kennedy Staff development at RMIT\nRMIT Education and Training IT Alignment Project,\nhttp:\/\/www.online.rmit.edu.au\/main.cfm?code=ia00.\nRogers, E. M. (1995), Diffusion of Innovations, Fourth Edition, New York: The Free Press.\nYetton, P. and associates. (1997), Managing the Introduction of Technology in the Delivery\nand Administration of Higher Education, Evaluations and Investigations Program report\n97\/3. Canberra: Higher Education Division Department of Employment, Education,\nTraining and Youth Affairs,\nhttp:\/\/www.deet.gov.au\/divisions\/hed\/operations\/eip9703\/front.htm.\n18\n"}