{"doi":"10.1029\/2006JF000474","coreId":"66538","oai":"oai:dro.dur.ac.uk.OAI2:1247","identifiers":["oai:dro.dur.ac.uk.OAI2:1247","10.1029\/2006JF000474"],"title":"Development and response of a coupled catchment fan system under changing tectonic and climatic forcing.","authors":["Densmore, A.L.","Allen, P.A.","Simpson, G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-02","abstract":"Sediment fans are a potentially useful and underexploited recorder of Earth's climatic and tectonic history, but historical observations have led to conflicting views on the importance of tectonic, climatic, and lithologic variables in controlling fan morphology and deposition. A one-dimensional model of a sediment fan and its associated catchment is used to explore the sensitivity of such simple sediment routing systems to perturbations in fault slip and precipitation rates. A transport-limited catchment is coupled to a fan whose surface slope is set by the balance between catchment sediment efflux and the available tectonically generated basin accommodation. Rock uplift rate is spatially variable across the model space. Increasing the fault slip rate, or decreasing the precipitation rate, leads to an increase in fan slope, temporary back-stepping of the fan toe, and a pronounced angular unconformity. Conversely, a decrease in slip rate, or an increase in precipitation rate, results in a decrease in fan slope, and progradation and eventual stabilization of the fan toe. Once perturbed, the system evolves toward a new equilibrium state with time constants of ∼0.5 to 2 Myr; these response times are insensitive to slip rate but are strongly dependent on precipitation rate. Variations in fan slope are well described by a dimensionless parameter that expresses equilibrium slope as a function of slip rate, precipitation rate, system size, and catchment lithology. This parameter holds promise as a predictive tool in inverting the morphology of natural fans for environmental variables","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66538.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1247\/1\/1247.pdf","pdfHashValue":"7180edc03fc1c5721286c8f5f4a2ddda695b8ee4","publisher":"American Geophysical Union","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1247<\/identifier><datestamp>\n      2013-10-10T11:43:47Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Development and response of a coupled catchment fan system under changing tectonic and climatic forcing.<\/dc:title><dc:creator>\n        Densmore, A.L.<\/dc:creator><dc:creator>\n        Allen, P.A.<\/dc:creator><dc:creator>\n        Simpson, G.<\/dc:creator><dc:description>\n        Sediment fans are a potentially useful and underexploited recorder of Earth's climatic and tectonic history, but historical observations have led to conflicting views on the importance of tectonic, climatic, and lithologic variables in controlling fan morphology and deposition. A one-dimensional model of a sediment fan and its associated catchment is used to explore the sensitivity of such simple sediment routing systems to perturbations in fault slip and precipitation rates. A transport-limited catchment is coupled to a fan whose surface slope is set by the balance between catchment sediment efflux and the available tectonically generated basin accommodation. Rock uplift rate is spatially variable across the model space. Increasing the fault slip rate, or decreasing the precipitation rate, leads to an increase in fan slope, temporary back-stepping of the fan toe, and a pronounced angular unconformity. Conversely, a decrease in slip rate, or an increase in precipitation rate, results in a decrease in fan slope, and progradation and eventual stabilization of the fan toe. Once perturbed, the system evolves toward a new equilibrium state with time constants of ∼0.5 to 2 Myr; these response times are insensitive to slip rate but are strongly dependent on precipitation rate. Variations in fan slope are well described by a dimensionless parameter that expresses equilibrium slope as a function of slip rate, precipitation rate, system size, and catchment lithology. This parameter holds promise as a predictive tool in inverting the morphology of natural fans for environmental variables. <\/dc:description><dc:subject>\n        Sediment fans<\/dc:subject><dc:subject>\n         Numerical modeling<\/dc:subject><dc:subject>\n         Response times<\/dc:subject><dc:subject>\n         Sedimentation.<\/dc:subject><dc:publisher>\n        American Geophysical Union<\/dc:publisher><dc:source>\n        Journal of geophysical research : earth surface, 2007, Vol.112, pp.F01002 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-02<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1247<\/dc:identifier><dc:identifier>\n        issn:0148-0227<\/dc:identifier><dc:identifier>\n        doi:10.1029\/2006JF000474<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1247\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1029\/2006JF000474<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1247\/1\/1247.pdf<\/dc:identifier><dc:rights>\n        © 2007 American Geophysical Union.\\ud\nDensmore, A. L. and Allen, P. A. and Simpson, G., (2007), 'Development and response of a\\ud\ncoupled catchment fan system under changing tectonic and climatic forcing.', Journal of\\ud\ngeophysical research : earth surface., 112, F01002, 10.1029\/2006JF000474 (DOI). To view the published open abstract, go to http:\/\/dx.doi.org and enter the DOI.\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0148-0227","0148-0227"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Sediment fans","Numerical modeling","Response times","Sedimentation."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n18 March 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nDensmore, A. L. and Allen, P. A. and Simpson, G. (2007) ’Development and response of a coupled catchment\nfan system under changing tectonic and climatic forcing.’, Journal of geophysical research : earth surface., 112\n. F01002.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1029\/2006JF000474\nPublisher’s copyright statement:\n2007 American Geophysical Union. Densmore, A. L. and Allen, P. A. and Simpson, G., (2007), ’Development and\nresponse of a coupled catchment fan system under changing tectonic and climatic forcing.’, Journal of geophysical\nresearch : earth surface., 112, F01002, 10.1029\/2006JF000474 (DOI). To view the published open abstract, go to\nhttp:\/\/dx.doi.org and enter the DOI.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n18 March 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nPublished version \n \nCitation for published item: \nDensmore, A. L. and Allen, P. A. and Simpson, G. (2007) 'Development and response of a \ncoupled catchment fan system under changing tectonic and climatic forcing.', Journal of \ngeophysical research : earth surface., 112 . F01002. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1029\/2006JF000474 \n \nPublisher’s copyright statement: \n© 2007 American Geophysical Union. \n \nAdditional information: \nDensmore, A. L. and Allen, P. A. and Simpson, G., (2007), 'Development and response of a \ncoupled catchment fan system under changing tectonic and climatic forcing.', Journal of \ngeophysical research : earth surface., 112, F01002, 10.1029\/2006JF000474 (DOI). To view \nthe published open abstract, go to http:\/\/dx.doi.org and enter the DOI. \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDevelopment and response of a coupled catchment fan system\nunder changing tectonic and climatic forcing\nAlexander L. Densmore,1 Philip A. Allen,1,2 and Guy Simpson1\nReceived 30 January 2006; accepted 8 September 2006; published 1 February 2007.\n[1] Sediment fans are a potentially useful and underexploited recorder of Earth’s climatic\nand tectonic history, but historical observations have led to conflicting views on the\nimportance of tectonic, climatic, and lithologic variables in controlling fan morphology\nand deposition. A one-dimensional model of a sediment fan and its associated catchment\nis used to explore the sensitivity of such simple sediment routing systems to perturbations\nin fault slip and precipitation rates. A transport-limited catchment is coupled to a fan\nwhose surface slope is set by the balance between catchment sediment efflux and the\navailable tectonically generated basin accommodation. Rock uplift rate is spatially\nvariable across the model space. Increasing the fault slip rate, or decreasing the\nprecipitation rate, leads to an increase in fan slope, temporary back-stepping of the fan toe,\nand a pronounced angular unconformity. Conversely, a decrease in slip rate, or an increase\nin precipitation rate, results in a decrease in fan slope, and progradation and eventual\nstabilization of the fan toe. Once perturbed, the system evolves toward a new equilibrium\nstate with time constants of \u00010.5 to 2 Myr; these response times are insensitive to slip\nrate but are strongly dependent on precipitation rate. Variations in fan slope are well\ndescribed by a dimensionless parameter that expresses equilibrium slope as a function of slip\nrate, precipitation rate, system size, and catchment lithology. This parameter holds promise\nas a predictive tool in inverting the morphology of natural fans for environmental variables.\nCitation: Densmore, A. L., P. A. Allen, and G. Simpson (2007), Development and response of a coupled catchment fan system under\nchanging tectonic and climatic forcing, J. Geophys. Res., 112, F01002, doi:10.1029\/2006JF000474.\n1. Introduction\n[2] The Earth’s surface is a dynamic interface that, at its\nmost basic level, routes sediment from sources to sinks. To\ngrasp how this surface evolves, we must first understand\nhow sediment routing systems respond to perturbations in\ntheir tectonic and climatic driving forces. The timescales\nover which this response occurs are vital for understanding\nthe fidelity with which landscapes, or the sedimentary\nproducts that are routed through them, can record the\ntectonic or climatic history of a region [e.g., Humphrey\nand Heller, 1995; Me´tivier and Gaudemer, 1999;\nCastelltort and van den Driessche, 2003]. Put another\nway, are landscapes and their associated sedimentary\nrecords ‘‘reactive’’ or ‘‘buffered’’ [Allen, 2007], particularly\nin the face of high-frequency forcing variations? This\nclearly determines whether it is safe to invert the strati-\ngraphic record or the morphometric properties of a land-\nscape to reveal information on driving mechanisms.\n[3] Recent work on landscape response has focused\nlargely on specific elements in sediment routing systems,\nsuch as hillslopes [Fernandes and Dietrich, 1997], bedrock\nrivers in upland areas [e.g., Whipple and Tucker, 1999;\nWhipple, 2001; Carretier and Lucazeau, 2005], or alluvial\nriver systems [e.g., Paola et al., 1992; Dade and Friend,\n1998; Me´tivier et al., 1999; Me´tivier and Gaudemer, 1999;\nCastelltort and van den Driessche, 2003]. These studies risk\noverlooking the potential coupling and feedbacks between\ndifferent landforms and processes within a sediment routing\nsystem [Humphrey and Heller, 1995]. The entire system\nmay respond in different ways and over different scales,\ndepending on the nature and frequency of the perturbation.\nAllen [2005] consequently likened the response of land-\nscapes to the different frequencies produced by playing of a\nguitar chord, with different finger positions on different\nfrets.\n[4] We focus here on the behavior of one of the smallest\nand simplest complete sediment routing systems: an upland\ncatchment where sediment is produced, and an adjacent fan\nwhere some or all of that sediment is deposited (Figure 1).\nMost catchment fan systems are limited in spatial scale and\nare amenable to a mass or volume balance since they are\nessentially closed in their sediment budget [Whipple and\nTrayler, 1996; Allen and Densmore, 2000]. They are ubiq-\nuitous features of tectonically active environments where\nrock uplift and accommodation generation are controlled by\ndeformation on discrete upper crustal structures, including\nrifts, extensional fault blocks, strike-slip zones, and fold\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 112, F01002, doi:10.1029\/2006JF000474, 2007\nClick\nHere\nfor\nFull\nArticle\n1Institute of Geology, Department of Earth Sciences, ETH Zu¨rich,\nZu¨rich, Switzerland.\n2Now at Department of Earth Science and Engineering, Imperial\nCollege London, London, UK.\nCopyright 2007 by the American Geophysical Union.\n0148-0227\/07\/2006JF000474$09.00\nF01002 1 of 16\nthrust belts. As such, they form the basic building blocks of\nlarger, more complex sediment routing systems.\n[5] A key question is whether catchment fan systems are\nsensitive recorders of the tectonic and climatic histories of a\nregion, and whether these different driving mechanisms can\nbe recognized and separated from each other. Whereas\nmuch effort in resolving this question has focused on\ncatchment form, particularly river long profiles [e.g.,\nWhipple and Tucker, 1999; Snyder et al., 2000; Whipple\nand Tucker, 2002; van der Beek and Bishop, 2003; Wobus et\nal., 2006], considerably less recent attention has been paid\nto the associated depositional fans. Fans have the advantage\nof preserving the history of catchment sediment efflux and\naccommodation generation in their stratigraphy and in their\nplan view and cross-sectional geometry [e.g., Fraser and\nDeCelles, 1992]. In addition, we can build on a large body\nof basic observations of fan form and sedimentary charac-\nteristics in different geologic settings [Bull, 1962, 1964;\nDenny, 1965; Hooke, 1967, 1968; Hooke and Rohrer, 1977;\nWhipple and Dunne, 1992; Gordon and Heller, 1993; Blair\nand McPherson, 1994; Blair, 1999a, 1999b]. Pioneering\nwork on the coupling between catchments and fans was\ncarried out by Humphrey and Heller [1995], who presented\na simple model of a mountain catchment and adjoining\nfan, each obeying different geomorphic rules and linked at\nthe fan apex. They showed that perturbation of even this\nhighly stylized model yielded complex, cyclic patterns of\nerosion and sedimentation, but did not extend their analysis\nto long-term landform development. Pelletier [2004] and\nCarretier and Lucazeau [2005] used similar models to\nargue that the presence of a downstream fan plays a key\nrole in modulating river incision and long profile develop-\nment, but did not consider the variations in, or the controls\non, fan morphology.\n[6] Starting from a set of basic observations on catch-\nments and fans, we build a dynamical model of a single\ncatchment fan system. Our objective is to use the simplest\npossible model that allows us to understand the response of\nthe integrated system to changes in forcing mechanisms. We\napply both tectonic and climatic perturbations to the system\nand focus on the response of geological or geomorpholog-\nical variables that can be easily observed, such as fan slopes\nand lengths from head to toe. Our analysis clarifies some of\nthe hitherto confusing correlations between tectonic and\nclimatic boundary conditions, catchment sediment efflux,\nand fan slope and geometry, and identifies some key\nlandscape-scale response times of the system.\n2. Observations of Fan Geometry in Coupled\nCatchment Fan Systems\n[7] The depositional fans of California and Nevada in the\nwestern United States were the subject of pioneering work\nduring the middle part of the twentieth century [Bull, 1962,\n1964; Denny, 1965; Hooke, 1967, 1968]. These studies\nprovide a number of important, and to some extent forgot-\nten, observations that must constrain any modeling of\ncatchment fan systems in tectonically active regions. They\nalso provide at least a qualitative idea of the fidelity of\nalluvial fans as recorders of tectonic and climatic variations\nthrough time. Here we summarize some of the key points\nthat are relevant to our model experiments and predictions.\n2.1. Fan Area and Length\n[8] A number of workers have discussed the controls on\nfan area, motivated in part by a commonly observed power\nlaw relationship between fan area Af and catchment area Ac\n[e.g., Bull, 1964; Denny, 1965; Hooke, 1968; Whipple and\nTrayler, 1996; Allen and Hovius, 1998]:\nAf ¼ cAnc ð1Þ\nwhere c and n are empirical coefficients and n is close to\nunity. Bull [1964] argued that fan areas in the San Joaquin\nValley, California, were dependent largely on the erodibility\nof rocks in the catchment. Catchments underlain by weak\nrocks produce larger fans, presumably due to higher rates of\nlong-term sediment supply, than those dominated by less\nerodible lithologies such as sandstone. Whipple and Trayler\n[1996] questioned this interpretation, pointing out that,\ncounterintuitively, the catchments underlain by weak rocks\nare also significantly steeper than those in stronger rocks,\nwhich raises the possibility that differential rock uplift rates\nmay play a role. Hooke and Rohrer [1977] demonstrated\nthat, while differences in catchment erodibility produce\nsecond-order variations in fan areas in Death Valley, fault\nslip rates are the dominant controlling factor. Likewise,\nWhipple and Trayler [1996] and Allen and Hovius [1998]\nargued, largely on theoretical grounds, that fault slip rate\nmust be the dominant control on fan area, but left the\nquestion of how this occurs somewhat open. High rock\nuplift rates in the catchment will promote high sediment\nsupply and thus large fans, with long radial lengths from\nFigure 1. Schematic view of a typical catchment fan\nsystem. Upland block is separated from adjacent basin by an\nactive crustal-scale fault. Catchment area Ac is typically\nrelated to fan area Af through a power law relationship\n(equation (1)). Fan toe position is controlled by fan surface\nslope and local base level at the fan toe, which in this case is\nan axial alluvial system. Heavy solid line shows range-\nbounding fault; dotted line shows schematic across-strike\ndisplacement pattern.\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n2 of 16\nF01002\nFigure 2. Fan radial profiles, modified from Bull [1964]. (a) Radial profiles of fan surfaces from fan\nhead to toe. Dots are data points, and solid lines are linear segments interpolated by Bull [1964]. Thin\ndashed lines show the upslope continuation of segments. Profiles have been shifted horizontally and\nvertically for clarity. Vertical exaggeration is 50\u0005. (b) Radial profiles of channels within catchments\n(‘‘mountains’’) and adjacent, active fan surfaces (‘‘alluvial fan’’). Symbols are as in Figure 2a. Profiles\nhave been shifted horizontally and vertically for clarity. Vertical exaggeration is 25\u0005. (c) Radial profiles\nof older fan depositional segments (grey lines) and active channels (black lines) on fans with incised\nheads. Thin dashed lines show the upslope continuation of the active depositional segments. Profiles have\nbeen shifted horizontally and vertically for clarity. Vertical exaggeration is 50\u0005.\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n3 of 16\nF01002\nhead to toe. In contrast, high subsidence rates in the basin\nshould lead to proximal deposition and thus small fans, with\nshort radial lengths. At present, the shortage of data on\ncatchment erosion rates, fan deposition rates, and fan\nvolumes in well-constrained tectonic settings does not allow\nus to deconvolve these competing effects from those of\ncatchment lithology and erodibility.\n2.2. Fan Slopes and Radial Profiles\n[9] Fan surface slope appears to vary systematically with\ncatchment area and catchment lithology [e.g., Bull, 1964;\nDenny, 1965]. It is important to realize, however, that\ndeposition rarely occurs over the entire fan surface at any\none time [Blair and McPherson, 1998]. Instead, fans are\ncommonly built of a number of depositional segments of\ndifferent age [Bull, 1964; Denny, 1965]. Bull [1964] showed\nthat the surface slopes of segments on many fans in Cal-\nifornia and Nevada are uniform, and that segment bound-\naries are marked by abrupt breaks in slope (Figure 2a). A\nnumber of authors have suggested, either explicitly or\nimplicitly, that fan slope is a function of depositional\nprocess, with debris flow fans being systematically steeper\nthan fluvial fans [e.g., Blair and McPherson, 1994; Oguchi\nand Ohmori, 1994; Milana and Ruzycki, 1999]. Such a\nsimple relationship is somewhat complicated by the obser-\nvations that (1) debris flow fans can exhibit a wide range of\ndepositional slopes, down to \u00010.5\u0001 in the case of lahar-\ndominated fans [Hungr et al., 2005], and (2) individual fans\nare commonly formed by a range of processes, with fluvial\nsediment transport and granular debris flows being the\nendmembers of a broad process spectrum [Saito and Oguchi,\n2005].\n[10] Bull [1964] also showed that the slope of the active\nchannel in the lowermost 1–2 km of the catchment is the\nsame as the active depositional segment on the fan, and the\nradial profiles of older fan segments are often colinear with\nstrath or fill terrace remnants in the lower catchment\n(Figures 2b and 2c). This important observation is not\nFigure 3. Profiles of active and abandoned channels on Shepherd Creek and Symmes Creek fans,\nOwens Valley, California. Thick vertical lines show the position of the active, normal slip Sierra Nevada\nfrontal fault that separates catchments (to the left of fault) from fans (to the right). (top) Profiles of\npresently active channel in both catchment and fan (black lines), as well as profiles of older, inactive fan\ndepositional segments (grey lines). Note that the channels are alluvial on both catchment and fan; bedrock\nexposure is limited to the upstream portions of both catchments. Ages of older segments are averages of\n3–7 surface exposure ages derived from cosmogenic 10Be analysis [Du¨hnforth et al., 2007]. (bottom)\nGradient of active channel in both catchment and fan, derived from a 10 m DTM (thick black lines), as\nwell as 21-point smoothed curves (thin black line). Arrows mark the onset of significant fan deposition,\nwhich need not coincide with the position of the fault. The head of Shepherd Creek fan is incised, so the\nmodern channel has a lower slope than the older fan segment, and fan deposition does not begin until\nabout 2 km downstream of the fault. Symmes Creek fan is not incised, so the modern channel is\ncoincident with the older segment and fan deposition occurs on both sides of the fault. On both fans, fan\nslope is approximately uniform for \u00012 km beyond the onset of deposition.\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n4 of 16\nF01002\nlimited to the fluvial San Joaquin Valley fans that were\nstudied by Bull [1964]; debris flow fans in Owens Valley,\nCalifornia, show identical patterns of (1) linear fan seg-\nments that were active at different times and (2) colinearity\nbetween the lowermost 1–2 km of the catchment and the\nactive depositional fan segment (Figure 3). Likewise,\nTalling and Sowter [1998] demonstrated general continuity\nof fan slope with channel slope across the mountain front of\nthe Apennines, in central Italy. This continuity in both\nelevation and slope between catchment and fan, despite\nmarked changes in channel confinement and substrate, is\nsomewhat surprising. It suggests that (1) the catchment and\nfan form a linked longitudinal profile; (2) this profile is in\nequilibrium, or in a transient state toward equilibrium, with\nprocesses shaping the entire catchment fan system; and\n(3) ultimate base level for the catchment fan system is\nfound at the fan toe (Figure 1).\n[11] Bull [1964] used the colinearity of catchment and fan\nsurfaces to argue that the generation of fan segments with\ndifferent slopes is driven by changes in the balance of\nerosion and tectonics in the catchment, rather than by\nintrinsic processes on the fan. In his model, increasing fault\nslip rate creates higher slopes in the catchment and thus a\nsteepening of the fan surface. If this dominance of rock\nuplift over erosion persists, it will generate a set of back-\nstepping fan segments, with ever steeper segment slopes\nand smaller radial lengths. Conversely, long-term domi-\nnance of erosion over rock uplift should yield shallower\ncatchment gradients through time, lower fan slopes, and a\ndownward-stepping set of fan segments.\n2.3. Summary of Observations\n[12] These observations provide us with a set of geomet-\nrical and geomorphic constraints that must be satisfied by\nany model of a catchment fan system. Besides the overall\nform of the catchment fan pair (i.e., a generally concave-up\ncatchment channel, and a wedge-shaped fan), these include\n(1) fan radial length that varies as some function of fault slip\nrate and sediment supply; (2) approximately uniform radial\nslopes on the active fan surface; (3) slope and elevation\ncontinuity between the lowermost catchment and the active\nfan surface; (4) the potential for segmentation into different\ndepositional lobes; and (5) both basinward and rangeward\nstepping of the active fan toe.\n3. A One-Dimensional Coupled Catchment Fan\nModel\n[13] It is clear from the summary above that a number of\ndifferent agents have been invoked to explain fan geometry,\nand in particular changes in fan surface form. We thus\ndevelop a simple numerical model of a catchment fan\nsystem, to see whether these agents, changes in fault slip\nrate, changes in climatic variables, lithological effects, and\nautocyclic ‘‘tintinnabulations’’ [Humphrey and Heller,\n1995], produce distinct topographic or stratigraphic finger-\nprints that can be sought in the geological record. The goal\nof our numerical modeling is to explore the first-order\nrelationships and feedbacks between rock uplift, erosion\nand deposition in a catchment fan system, rather than to\nreproduce detailed patterns of channel fan dynamics such as\ntransient incision or stratigraphic stacking.\n3.1. Catchment Erosion\n[14] The basis for the catchment portion of the model is\nconservation of mass in one dimension:\n@z\n@t\n¼ U x; tð Þ \u0006 @qs\n@x\nð2Þ\nwhere x is downstream distance (m), z is the elevation of the\nsurface (m), U(x, t) is the rock uplift rate as a function of\ntime and space (m yr\u00061), and qs is the total sediment\ndischarge per unit width (m2 yr\u00061). We assume a simple\ntransport-limited flux law that combines dispersive and\nconcentrative terms [e.g., Smith and Bretherton, 1972;\nSimpson and Schlunegger, 2003]:\nqs ¼ \u0006 k @z\n@x\nþ ct a xð Þm @z\n@x\n\u0001 \u0002\nð3Þ\nwhere @z\/@x is the local slope (dimensionless), a is\nprecipitation rate (m yr\u00061), k is a linear diffusivity (m2\nyr\u00061), ct is a nonlinear transport coefficient ((m\n2 yr\u00061)1\u0006m),\nand m is a dimensionless exponent. Precipitation rate a is\nassumed to be uniform throughout the catchment, so that the\nquantity ax yields the water discharge per unit width. Note\nthat we implicitly assume a slope exponent of 1, consistent\nwith a system that is dominated by gravel bedload transport\n[Howard, 1980; Whipple and Tucker, 2002]. We use\nequation (3) because it is the simplest general expression\nthat allows for the simultaneous development of both a\ndiffusive hillslope and incisive channel, depending on the\nvalue of x [Simpson and Schlunegger, 2003]. Such a\ntransport-limited flux law is likely to be most appropriate in\norogens underlain by weak lithologies [Talling, 2000;\nWhipple and Tucker, 2002], or where the catchment channel\nis at least partly sediment mantled (Figure 3). A detach-\nment-limited relationship would yield a similar steady-state\ncatchment form and long-term sediment efflux, but would\ndiffer in the detailed, transient response to perturbations\n[e.g.,Whipple and Tucker, 2002; Tucker and Whipple, 2002;\nWhipple, 2004]. As we are primarily interested in the\noverall form of the catchment fan system, we take\nadvantage of the simplicity and ease of implementation of\nequation (3).\n[15] Combining equations (2)–(3) yields an expression\nfor the rate of surface change with time:\n@z\n@t\n¼ U x; tð Þ þ @\n@x\n\u0003\nkþ ct a xð Þm\n\u0001 \u0004\n@z\n@x\n\u0002\nð4Þ\nNote that the term in square brackets can be thought of as a\nsystem diffusivity, with units of m2 yr\u00061. It consists of a\nlinear or ‘‘hillslope’’ diffusivity k, and a nonlinear or\n‘‘fluvial’’ diffusivity that depends on precipitation rate a\nand downstream distance x.\n3.2. Fan Deposition\n[16] The observations that fan slope is (1) approximately\nuniform on a given depositional segment and (2) equal to\nthe channel slope in the lowermost catchment (Figures 2\nand 3) suggest that fan slope is largely a geometrical\nfunction of the balance between sediment supply and basin\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n5 of 16\nF01002\naccommodation and may be somewhat independent of the\nactual process of sediment delivery, provided there is\nminimal reworking on the fan. For a given basin geometry,\nthe fan slope sets the length of the fan from head to toe, and\nthus dictates the volume of sediment in the basin; a high fan\nslope yields a short, relatively low volume fan. At the same\ntime, because the fan slope is observed to be continuous\nwith the channel slope at the catchment outlet, the fan slope\nalso sets an important base level boundary condition on the\ncatchment. A high fan slope at the channel fan boundary,\nand thus a steep catchment channel, promotes high erosion\nrates and a large sediment efflux. Conversely, a low fan\nslope, for example due to widespread aggradation on the fan\nsurface, will lead to a low catchment channel slope and thus\na small sediment efflux.\n[17] To capture this dynamic linkage, we model the fan\nsurface as a straight, sloping line from the catchment mouth.\nThe toe of the fan occurs where this line intersects the\npredepositional topography, so that the toe position is\ncontrolled by the fan slope and the spatial pattern of basin\nsubsidence. The channel slope at the catchment outlet is\nassumed to be equal to the fan slope, which is initially\nunknown. We iterate to find the value of fan slope that\nbalances the volume of material eroded from the catchment\nwith the volume of the fan. Increasing the fan slope\nincreases the volume of material eroded but decreases the\npotential fan volume, and vice versa.\n[18] Note that we strive to keep the model as simple as\npossible, in order to better understand the first-order\nresponses of the system to tectonic or climatic perturbations.\nOur model differs from that of Humphrey and Heller [1995]\nin that (1) we assume a transport limited, rather than\ndetachment limited, catchment; (2) the rock uplift pattern\nis spatially variable; (3) fan deposition is not assumed to be\ndiffusional, but is based strictly on mass balance consid-\nerations and geometric observations; and (4) the slope of the\nfan, as well as the elevation of the fan head, acts as a lower\nbase level condition on the catchment. Our fan model does\nnot simulate a particular depositional process, such as\nstreamflow or debris flow transport, but is driven strictly\nby mass balance considerations and the observed geomet-\nrical constraints on fan and catchment slopes. Because we\nconsider only a one-dimensional system, we ignore varia-\ntions in channel width, which may be important in allowing\nfan head incision and entrenchment [Bull, 1964; Hooke,\n1967]. We also do not account for grain-size effects on fan\ngeometry [e.g., Paola et al., 1992; Marr et al., 2000].\n3.3. Experimental Design\n[19] Model experiments are performed on a regularly\nspaced one-dimensional vector of x positions. For simplic-\nity, we refer to the uplifting mountain block as the ‘‘foot-\nwall’’ and the subsiding basin as the ‘‘hanging wall’’\n(Figure 1), although in the model the ‘‘fault’’ separating\nthem is vertical. The footwall is 10 km long, while the\nhanging wall is 30 km long and is assumed to end in a playa\nor similarly low relief, low gradient basin floor (Figure 1).\nWe simulate tectonic flux of material by imposing vertical\ndisplacements U(x, t) that decay exponentially with distance\nfrom the fault (Figure 4). The decay length scale is 7500 m,\nwhich yields a comparable coseismic displacement profile\nto those observed in large normal fault earthquakes [e.g.,\nStein and Barrientos, 1985].\n[20] We solve equation (4) within the footwall using the\nGalerkin finite element method with linear shape and\nweighting functions and nonlinear iterations [Zienkiewicz\nand Taylor, 2000]. The time derivative in equation (4) is\ndiscretized using an implicit finite difference scheme. This\nsolution shapes the channel profile in the footwall block and\ndetermines the sediment flux to the hanging wall. The fan\nslope and channel slope at the catchment outlet are equal\nand are initially set to an arbitrary value. During each time\nstep, the model iterates to find the fan slope that balances\nthe volume of eroded sediment with the volume of the\nhanging wall fan. A no-flux boundary condition is imposed\nat the upstream end of the footwall.\n[21] Details of the dimensions and parameters used in the\nexperiments are given in Table 1. Each experiment begins\nwith a horizontal initial topography, and is run for 5 Myr\nwith constant tectonic and climatic conditions (Figure 4).\nWe then perturb the resulting base run by imposing a step\nchange in either the fault slip rate or the precipitation rate.\nAll other parameters are left constant, allowing us to isolate\nthe responses and associated timescales of both catchment\nand fan.\n4. Results\n4.1. Base Run\n[22] At the end of the 5 Myr base run, a concave-up\nchannel on the footwall is paired with a sloping hanging\nwall fan (Figure 4). Total fault slip is 10 km, comparable to\nlarge faults in regions of continental extension [Densmore et\nal., 2004]. The early growth of the system is characterized\nby surface uplift in the footwall, headward migration of the\nFigure 4. Results of the base run after 5 Myr of model run time with constant fault slip rate (1 mm yr\u00061) and precipitation\nrate (1 m yr\u00061). (a) Catchment topography and fan stratigraphy. Model space is divided into uplifting ‘‘footwall’’ and\nsubsiding ‘‘hanging wall’’ domains, separated by active dip-slip fault at x = 10 km. Fault displacement rate decreases\nexponentially away from the fault. Heavy black lines show bedrock surface (lower curve) and topographic surface (upper\ncurve). Thin black lines show deformed stratigraphic timelines in the basin, recorded every 250 kyr. Note progradation of\nfan toe and pinch-out against bedrock surface. Dotted line shows fault displacement envelope. Total fault slip is 10 km and\nis divided evenly between footwall uplift and hanging wall subsidence; note that displacement envelope in hanging wall is\ncoincident with bedrock surface beneath the basin. (b) Sediment flux qs at the catchment outlet as a function of time during\nthe 5 Myr run. Dashed line shows the value of the tectonic flux into the footwall qt, which is 2.75 m\n2 yr\u00061. Note mismatch\nbetween qs and qt at the end of the run. (c) Fan surface slope as a function of time during the run. (d) Fan radial length as a\nfunction of time during the run; radial length is measured from the fault to the point where the fan pinches out against\nbedrock. (e) Chronostratigraphic diagram of the basin; grey area shows lateral extent of basin sedimentation as a function of\ntime.\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n6 of 16\nF01002\ndrainage divide toward the left-hand edge of the space, and\nprogradation of a fan that steepens with time. The channel\nprofile achieves a smooth, concave-up profile with a total\nrelief from divide to catchment mouth of \u0001500 m. Both fan\nslope and sediment flux at the catchment outlet vary\napproximately exponentially with time and approach steady\nvalues after several million years, with a time constant t\n(defined by fitting the flux curve with an expression of the\nform [1 \u0006 exp(\u0006t\/t)]) of 550 kyr.\n[23] Progradation of the fan toe results in progressive\nonlap onto the subsiding basement, and construction of a\nwedge-shaped fan deposit that thins away from the fault\n(Figure 4). While the progradation rate slows with time, it\ndoes not reach zero during the 5 Myr run. This somewhat\nsurprising result is a consequence of the lack of topographic\nsteady state in the base run. The sediment flux from the\ncatchment qs approaches a steady value by the end of the\nrun, but this steady value is slightly greater than the constant\nFigure 4\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n7 of 16\nF01002\ntectonic flux into the footwall qt = hUiL, where hUi is the\nmean rock uplift rate and L is the length of the footwall\ncatchment (Figure 4). The result of this imbalance is that the\ncatchment achieves a steady form and relief, but this form\ntranslates downward because of net removal of mass from\nthe footwall. When combined with the spatially variable\n(but nonzero) hanging wall subsidence rate, this leads to a\nslowly prograding fan toe. These results highlight the often\nunappreciated fact that, for a landscape at ‘‘equilibrium’’,\nthe time derivative in equation (4) need not be zero, and that\nneither flux steady state (qs = qt) nor topographic steady\nstate (@z\/@t = 0; Willett and Brandon [2002]) are necessary\nto achieve steady catchment relief.\n4.2. Slip Rate Perturbations\n[24] To evaluate the response of the base run to tectonic\nperturbations, we vary the slip rate by a factor of 2 after\n5 Myr of model run time, and run the model for an additional\n5 Myr. Doubling the slip rate from 1 to 2 mm yr\u00061 results in\nan increase in fan slope and sediment flux at the catchment\nmouth (Figure 5). Both parameters approach new equilibrium\nvalues with a time constant of 630 kyr, approximately equal\nto the response time during initial system growth. The\nincrease in slip rate causes an instantaneous increase in the\nrate of accommodation generation, which in turn causes an\ninitial back-stepping of the fan toe by about 8 km [e.g.,\nGordon and Heller, 1993; Allen and Densmore, 2000]. As\nthe sediment flux from the catchment gradually increases in\nresponse to the higher slip rate, the fan toe progrades again\nand onlaps onto older fan deposits with an angular uncon-\nformity, eventually extending beyond the preperturbation fan\nlimit (Figure 5). The total duration of this back-stepping\nprograding event, from the onset of the slip rate perturbation\nuntil the fan toe reaches its previous extent, is about 2.5 Myr.\nNote that the increased slip rate after the perturbation results\nin significantly higher sediment thickness and deposition\nrates compared to the preperturbation fan (Figure 5).\n[25] When the slip rate is halved from 1 to 0.5 mm yr\u00061,\ncatchment flux and fan slope decay to lower equilibrium\nvalues, again with a time constant of approximately 500 kyr\n(Figure 6). The fan toe progrades rapidly at first because of\nthe decreased rate of accommodation generation, but then\nslows and reaches a fixed location as sediment supply\ndecays. This progradation, combined with the simultaneous\ndecrease in fan slope, produces a distinctive sheet-like\nstratigraphic unit that maintains a nearly uniform thickness\nacross the entire fan surface (Figure 6). Note that there is no\nchange in the pattern of tectonic accommodation generation\nduring deposition of this distinct unit, and subsequent\ndepositional units revert to a more usual wedge shape that\nthins away from the fault. The decrease in the rate of\naccommodation generation means that postperturbation\nsedimentary units are thinner, and deposition rates are\nlower, than before the change in slip rate.\n4.3. Precipitation Rate Perturbations\n[26] In the second set of experiments, we explore the\nresponse of the system to variations in precipitation rate. As\nbefore, we perturb the base run by varying the precipitation\nrate after 5 Myr, and then run the model for an additional\n5 Myr. Increasing the precipitation rate by 50% (from 1 to\n1.5 m yr\u00061) causes the sediment flux from the catchment qs\nto rise instantaneously, because the increase is felt simulta-\nneously across the entire catchment (Figure 7). The flux\nthen decays back to a new equilibrium level that is about\n12% higher than the preperturbation value, with a time\nconstant of 280 kyr. The new equilibrium flux is consider-\nably higher than the input tectonic flux qt, again emphasiz-\ning that a balance between qs and qt is not required to\ngenerate steady catchment relief, and demonstrating that the\nimbalance between qs and qt is at least partly dependent on\nthe precipitation rate.\n[27] As with a decrease in slip rate, increasing the\nprecipitation rate leads to rapid progradation of the fan toe\nand deposition of a distinctive sheet-like sedimentary unit\n(Figure 7). Subsequent depositional units revert to a wedge\nshape that pinches out basinward. Note that, in this case, the\nthicknesses and deposition rates of preperturbation and\npostperturbation fan deposits are similar, because the rate\nof accommodation generation is unchanged throughout the\nexperiment. This similarity in deposit thickness and the\ninstantaneous increase in sediment flux are the only diag-\nnostic observations that would allow us to differentiate an\nincrease in precipitation rate from a comparable decrease in\nslip rate (e.g., compare Figures 6 and 7).\n[28] Decreasing the precipitation rate by 50% (from 1 to\n0.5 m yr\u00061) produces a dramatic back-stepping of the fan\ntoe, by more than 10 km (Figure 8). This back-stepping, and\nthe associated increase of the fan slope, produces a signif-\nicant angular unconformity. Subsequent deposition leads to\nrenewed progradation of the fan toe, but the low precipita-\ntion rate and high fan slope means that the toe never reaches\nits former position. Catchment efflux drops instantaneously\nat the time of the perturbation and then recovers only\nslowly, with a time constant of 920 kyr. The fan slope rises\nrapidly at first, but the long time constant means that a new\nequilibrium slope is not reached by the end of the model\nrun.\n4.4. Controls on Fan Slope\n[29] Clearly, both precipitation rate and fault slip rate are\nimportant controls on fan slope in our model. Precipitation\nTable 1. Symbols and Model Parameters\nSymbol Name Value and Units\nAc catchment area m\n2\nAf fan area m\n2\nC fan area coefficient -\nct nonlinear sediment transport\ncoefficient\n1 \u0005 10\u00066 (m2 yr\u00061)1\u0006m\ndt time step 1000 years\ndx cell size 100 m\nL footwall catchment length 104 m\nm slope exponent 2\nn fan area exponent -\nqs sediment flux m\n2 yr\u00061\nqt tectonic flux m\n2 yr\u00061\nt run time Y\nU rock uplift rate m yr\u00061\nU0 rock uplift rate at fault 1 \u0005 10\u00063 m yr\u00061 in\nbase run\nx, z horizontal and vertical position M\na precipitation rate 1 m yr\u00061 in base run\nk linear diffusivity 0.01 m2 yr\u00061\nq dimensionless fan slope parameter -\nt time constant years\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n8 of 16\nF01002\nFigure 5. Experimental results following a doubled slip rate, to 2 mm yr\u00061, after 5 Myr of model run\ntime. Model behavior before the perturbation, from 0 to 5 Myr, is the same as in the base run (Figure 4).\n(a) Hanging wall stratigraphy before (dark grey arrow) and after (light grey arrow) the increase in slip\nrate. Deformed stratigraphic timelines are recorded every 500 kyr. Note increase in deposition rate and\nback-stepping prograding behavior of the fan toe, following the perturbation. (b) Sediment flux at the\ncatchment outlet. Vertical line here and in subsequent panels marks the increase in slip rate at 5 Myr.\nDashed line shows the tectonic flux into the footwall qt. (c) Fan surface slope before and after the\nperturbation. (d) Fan radial length before and after the perturbation. Note back-stepping of the fan toe by\nabout 8 km, followed by renewed progradation. (e) Chronostratigraphic diagram of the basin. Grey area\nshows lateral extent of basin sedimentation as a function of time. Solid horizontal line marks the increase\nin slip rate at 5 Myr.\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n9 of 16\nF01002\nFigure 6. Experimental results following a halved slip rate, to 0.5 mm yr\u00061, after 5 Myr of model run\ntime. Model behavior before the perturbation, from 0 to 5 Myr, is the same as in the base run (Figure 4).\n(a) Hanging wall stratigraphy before (dark grey arrow) and after (light grey arrow) the increase in slip\nrate. Deformed stratigraphic time lines are recorded every 500 kyr. Note decrease in deposition rate and\ndeposition of sheet-like unit (light grey) immediately after perturbation. Fan toe progrades, then stabilizes\nat an equilibrium position. (b) Sediment flux at the catchment outlet. Vertical line here and in subsequent\npanels marks the decrease in slip rate at 5 Myr. Dashed line shows the tectonic flux into the footwall qt.\n(c) Fan surface slope before and after the perturbation. (d) Fan radial length before and after the\nperturbation. Note minor progradation of the fan toe, followed by stabilization. (e) Chronostratigraphic\ndiagram of the basin. Grey area shows lateral extent of basin sedimentation as a function of time. Solid\nhorizontal line marks the decrease in slip rate at 5 Myr.\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n10 of 16\nF01002\nFigure 7. Experimental results following a 50% increase in the precipitation rate, to 1.5 m yr\u00061, after\n5 Myr of model run time. Model behavior before the perturbation, from 0 to 5 Myr, is the same as in the\nbase run (Figure 4). (a) Hanging wall stratigraphy before (dark grey arrow) and after (light grey arrow)\nthe increase in slip rate. Deformed stratigraphic time lines are recorded every 500 kyr. Fan deposition rate\nis unaffected by the perturbation. Increased precipitation rate leads to deposition of sheet-like unit (light\ngrey) immediately after perturbation. Fan toe progrades, then stabilizes at an equilibrium position.\n(b) Sediment flux at the catchment outlet. Vertical line here and in subsequent panels marks the increase\nin precipitation rate at 5 Myr. Dashed line shows the tectonic flux into the footwall qt, which remains\nconstant during the run. (c) Fan surface slope before and after the perturbation. (d) Fan radial length\nbefore and after the perturbation. Note minor progradation of the fan toe, followed by stabilization.\n(e) Chronostratigraphic diagram of the basin. Grey area shows lateral extent of basin sedimentation as a\nfunction of time. Solid horizontal line marks the increase in precipitation rate at 5 Myr.\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n11 of 16\nF01002\nFigure 8. Experimental results following a 50% decrease in precipitation rate, to 0.5 m yr\u00061, after 5 Myr\nof model run time. Model behavior before the perturbation, from 0 to 5 Myr, is the same as in the base run\n(Figure 4). (a) Hanging wall stratigraphy before (dark grey arrow) and after (light grey arrow) the\ndecrease in precipitation rate. Deformed stratigraphic time lines are recorded every 500 kyr. Fan\ndeposition rate is unaffected by the perturbation. Note back-stepping prograding behavior of fan toe and\nmarked angular unconformity following the perturbation. (b) Sediment flux at the catchment outlet.\nVertical line here and in subsequent panels marks the decrease in precipitation rate at 5 Myr. Dashed line\nshows the tectonic flux into the footwall qt, which remains constant during the run. (c) Fan surface slope\nbefore and after the perturbation. (d) Fan radial length before and after the perturbation. Note back-\nstepping of the fan toe by more than 10 km, followed by renewed progradation. (e) Chronostratigraphic\ndiagram of the basin. Grey area shows lateral extent of basin sedimentation as a function of time. Solid\nhorizontal line marks the decrease in precipitation rate at 5 Myr.\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n12 of 16\nF01002\nrate determines sediment supply, while slip rate determines\nboth sediment supply (through catchment gradient) and the\namount of accommodation. To evaluate their relative influ-\nence on fan slope, we systematically vary both parameters\nand calculate the resulting steady state fan slope. Precipita-\ntion rate is varied from 0.5 to 1.5 m yr\u00061 in 0.1 m yr\u00061\nincrements, while slip rate is varied from 0.1 to 2 mm yr\u00061\nin 0.1 mm yr\u00061 increments, both geologically reasonable\nranges.\n[30] The computed equilibrium fan slopes shows that fan\nslope depends linearly on slip rate, but varies as the inverse\nsquare of precipitation rate (Figure 9). Sensitivity to tecton-\nics is lowest at high precipitation rates, because sediment\nfluxes are uniformly high and the basin is filled (i.e., fan\nslopes are low) regardless of slip rate. Conversely, sensitiv-\nity to climate is lowest at low slip rates, because little\naccommodation is generated and again the basin is always\nfilled. Very steep (>8–10\u0001) fans, such as those in the Black\nMountains of Death Valley [Denny, 1965], can only form\nthrough a combination of very high slip rates and low\nprecipitation rates.\n[31] The simple relationships in Figure 9 suggest that a\nnondimensional form of equation (3) should yield an\nanalytical expression for equilibrium fan slope. We intro-\nduce the following variable replacements:\nx ¼ x\nL\n; z ¼ z\nL\n; t ¼ t U0\nL\n; qs ¼ qs 1\nLU0\nð5Þ\nwhere L is the length of the footwall catchment, U0 is the\nslip rate at the fault, and the bars denote dimensionless\nvariables. Substituting these into equation (3) yields\nqs ¼ \u0006 k\n1\nLU0\nþ cta\nmLm\nLU0\nxm\n\u0001 \u0002\n@z\n@x\nð6Þ\n[32] The flux at the catchment outlet qsout determines the\nequilibrium fan slope. At the outlet, x = 1 and the first term\nin brackets is small compared with the second, so we can\nsimplify equation (6) to\n@z\n@x\n¼ U0\nctamLm\u00061\nqsout ð7Þ\n@z\n@x\n¼ qqsout ð8Þ\nwhere q = U0\/(cta\nmLm\u00061). The dimensionless grouping of\nconstants q illustrates the relative role of climate and\ntectonics in setting fan slope in the model, and is somewhat\nanalogous to the uplift erosion number proposed by\nWhipple and Tucker [1999]. For a given sediment flux\nfrom the catchment, equilibrium fan slope varies linearly\nwith fault slip rate U0, and varies inversely with lithology\n(parameterized by the transport coefficient ct), precipitation\nrate a, and catchment length L. Thus equation (8) collapses\nthe variability evident in Figure 9 into a single, quasi-linear\nrelationship for fan slope (Figure 10).\n4.5. System Response Times\n[33] The strikingly different responses to increases or\ndecreases in the precipitation rate suggest that, not surpris-\ningly, the time required for the catchment fan system to\nreach a new equilibrium is dependent upon the system\ndiffusivity (e.g., equation (4)). To further explore this\ndependence, we again systematically vary both precipitation\nrate and slip rate as in the previous experiment. We begin\nwith horizontal initial topography, as in the base run\nexperiment, and run the model with a specified slip rate\nand precipitation rate until equilibrium values of sediment\nflux and fan slope are reached. We assess the response time\nusing the time constant t of the flux curve, defined by\nFigure 9. Controls on equilibrium fan slope. Model was\nrun with different combinations of slip rate and precipita-\ntion rate until a constant fan slope was achieved.\nPrecipitation rate was varied from 0.5 to 1.5 m yr\u00061 in\n0.1 m yr\u00061 increments, while slip rate was varied from 0.1\nto 2 mm yr\u00061 in 0.1 mm yr\u00061 increments. (a) Surface plot\nof fan slope as function of precipitation and slip rates.\nHigh fan slopes (>8–10\u0001) are possible only at the lowest\nprecipitation rates and highest slip rates. (b) Sections of\nthe surface in Figure 9a showing functional dependence on\nprecipitation and slip rates. (Figure 9b, top) Dependence\non precipitation rate at a fixed slip rate of 1 mm yr\u00061;\n(Figure 9b, bottom) Dependence on slip rate at a fixed\nprecipitation rate of 1 m yr\u00061.\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n13 of 16\nF01002\nfitting an expression of the form [1 \u0006 exp(\u0006t\/t)]. Perturb-\ning the base run, rather than starting with a horizontal initial\ntopography, yields similar results for the time constant for\ngiven values of slip and precipitation rates.\n[34] As expected, the time constant decreases with in-\ncreasing precipitation rate, and thus with increasing system\ndiffusivity (Figure 11). Because equation (4) is a diffusion\nequation, the time constant varies approximately inversely\nwith the system diffusivity, and thus as the inverse square of\nthe precipitation rate. A more unexpected result is that the\ntime constant is largely independent of the slip rate, for a\nreasonable range of values from 0.1 to 2 mm yr\u00061\n(Figure 11). In other words, the response time of the model\ndepends strongly on the system diffusivity, but not on the\nrate of rock uplift (which governs accommodation genera-\ntion and base level change, and imposes a tectonically\ninduced slope @z\/@x to the system).\n5. Discussion and Conclusions\n[35] Our model can be used to show that many aspects of\nsediment fan morphology can be explained in terms of\nperturbations to tectonic or climatic boundary conditions.\nAn increase in fault slip rate, or a decrease in precipitation\nrate, leads to an increase in fan slope, and to back-stepping\nand subsequent progradation of the fan toe. These responses\noccur because the perturbations cause a temporary domi-\nnance of tectonic deformation over the ability of the\nsediment transport system to redistribute mass; in other\nwords, the first term on the right in equation (4) overwhelms\nthe second. Conversely, a decrease in slip rate, or an\nincrease in precipitation rate, allows the sediment transport\nsystem to temporarily overcome the effects of rock uplift.\nThis results in a decrease in fan slope, and to progradation\nand stabilization of the fan toe. Although tectonic and\nclimatic perturbations may appear to have broadly similar\neffects on the fan morphology, there are two key differ-\nences: (1) fan deposition rates are largely independent of\nprecipitation variations but strongly linked to changes in\nslip rate [e.g., Whipple and Trayler, 1996]; and (2) the\nsediment flux at the catchment outlet responds very rapidly\nto changes in precipitation rate but relatively slowly (over\ntimescales of \u00010.5–2 Myr) to changes in slip rate.\n[36] The long response times shown by the model, while\npartly a function of our choice of parameter values,\nunderscore the difficulty of recording short-duration,\nhigh-frequency perturbations in large-scale fan morphology\nor stratigraphic architecture. Even a simple step-change\nincrease in slip rate gives rise to a cycle of fan toe back-\nstepping and progradation, with a significant angular\nunconformity between preperturbation and postperturbation\nstratigraphy, over a timescale of\u0001105 to 106 years. While the\ndetails of this transient response are partly dependent on the\ncatchment sediment efflux (and thus on the chosen erosion\nrule), a general outcome of our model is that adjustment of\nkilometer-scale fan surface slope or toe position is simply\ntoo slow to faithfully reflect high-frequency variations in,\nFigure 11. Response times as a function of precipitation\nrate (top) and slip rate (bottom). Model is run from a flat\ninitial topography until a steady sediment flux at the\ncatchment outlet is achieved, similar to the base run in\nFigure 4. Response time for achievement of this equilibrium\nis expressed as exponential time constant t, defined by\nfitting the sediment flux curve with an expression of the\nform [1 \u0006 exp(\u0006t\/t)]. Figure 11, top, shows time constant\nas a function of precipitation rate, which is varied from 0.1\nto 1.5 m yr\u00061 in 0.1 m yr\u00061 increments, for a fixed slip rate.\nNote approximately quadratic decay of time constant with\nincreasing precipitation rate, consistent with linear depen-\ndence of time constant on system diffusivity (equation (4)).\nFigure 11, bottom, shows time constant as function of slip\nrate, which is varied from 0.1 to 2 mm yr\u00061 in 0.1 mm yr\u00061\nincrements, for a fixed precipitation rate. Response time is\ninsensitive to slip rate over this geologically reasonable\nrange.\nFigure 10. Equilibrium fan slope as a function of\ndimensionless parameter q. Black line shows fan slope as\na function of variable precipitation rate at a fixed slip rate of\n1 mm yr\u00061; compare with Figure 9b, top. Grey line shows\nfan slope as a function of variable slip rate, for a fixed\nprecipitation rate of 1 m yr\u00061; compare with Figure 9b,\nbottom. Dashed line is linear fit to both data sets. The\ndimensionless parameter q collapses tectonic and climatic\ncontrols on fan slope into a single, quasi-linear relationship.\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n14 of 16\nF01002\nfor example, precipitation or water discharge. We identify\ntwo possible mechanisms that might circumvent this slug-\ngish response and allow preservation of a high-frequency\nrecord. First, segmentation of the fan, caused by abandon-\nment and preservation of older depositional lobes [Bull,\n1964; Hooke, 1967], will preserve the fan slope at the time\nof abandonment and potentially allow its interpretation as a\nfunction of climatic and tectonic conditions. This implies\nthat we should particularly seek fans with incised heads,\nwhere older depositional surfaces are preserved in the\nproximal part of the fan (e.g., Figure 3). Second, proximity\nto base level may provide an alternate means of ‘‘freezing’’\nthe fan morphology rapidly after a perturbation event. For\nexample, Pliocene Gilbert deltas in the Loreto Basin in Baja\nCalifornia appear to record short-duration (\u0001104 y) slip rate\nvariations on the basin-bounding Loreto fault [Dorsey et al.,\n1997; Mortimer et al., 2005]. Such preservation is possible\nbecause the sediments were deposited in shoal water envi-\nronments, at or just below sea level, as individual prograda-\ntional units [Mortimer et al., 2005]. In closed or isolated\nbasins, as are common in many continental rift settings, such\na high-resolution record of base level change is unlikely to\nbe deposited or preserved.\n[37] A unique aspect of our model is that fan slope is\nassumed to be uniform and is dictated solely by mass\nbalance considerations between the flux of material re-\nmoved from a catchment and the rate of accommodation\ngeneration in the adjacent basin. Similar elements were\nincorporated into a conceptual model of sedimentation in\nflexural foreland basins by Heller et al. [1988], who\nattributed alternating phases of proximal stacking of\ncoarse-grained wedges and distal deposition of sediment\nsheets to tectonic activity and quiescence, respectively. Our\napproach differs from that of other fan models in that we do\nnot adopt a diffusive rule for sediment transport and\ndeposition on the fan [e.g., Paola et al., 1992; Humphrey\nand Heller, 1995; Parker et al., 1998; Marr et al., 2000].\nDiffusive fan models with uniform diffusivity tend to\nproduce concave-up surface profiles [e.g., Marr et al.,\n2000; Sun et al., 2002]. The near-uniformity of segment\nslopes on many natural fans suggests that diffusive fan\ntransport models may be inappropriate in those settings\nunless diffusivity is somehow varied down-fan, perhaps\nassociated with changes in grain size [Blair and McPherson,\n1998; Marr et al., 2000; Stock et al., 2004] or channel\nwidth.\n[38] By linking fan slope directly to catchment sediment\nflux, we are implicitly assuming that fan slope is inversely\ndependent on the ‘‘efficiency’’ of the sediment transport\nsystem in moving material out into the basin. A highly\nefficient system, driven for example by high water dis-\ncharge, would generate high sediment discharge at the\ncatchment mouth, necessitating a large fan with a low\nsurface slope [Oguchi and Ohmori, 1994; Milana and\nRuzycki, 1999]. This may be a better explanation for\nvariations in fan surface slope than the simple process-\nbased division between debris flow and alluvial fans out-\nlined in section 2.2. A better way to address this would be to\napply more realistic sediment transport algorithms to the fan\nsurface; this is relatively straightforward in the case of\nstreamflow-dominated fans [Parker et al., 1998; Marr et\nal., 2000; Sun et al., 2002], but to our knowledge has not\nbeen attempted in the case of debris flow fans.\n[39] Acknowledgments. Support for this research was provided by\ngrants from the Swiss National Science Foundation (grants 2100-067624\nand 200020-105225\/1) and the U.S. National Science Foundation (grant\nEAR0207569). We thank Se´bastien Castelltort, Patience Cowie, Andrea\nCozzi, Nancye Dawers, Max Densmore, Miriam Du¨hnforth, Sanjeev Gupta,\nand Kelin Whipple for ideas and stimulating discussions. Constructive\nreviews by Sanjeev Gupta, Paul Heller, and an anonymous reviewer helped\nto clarify and focus the manuscript.\nReferences\nAllen, P. A. (2005), Striking a chord, Nature, 434, 961.\nAllen, P. A. (2007), Time scales of tectonic landscapes and their sediment\nrouting systems, in Earth’s Dynamic Surface: Catastrophe and Continu-\nity in Landscape Evolution, Geol. Soc. of London Spec. Publ., in press.\nAllen, P. A., and A. L. Densmore (2000), Sediment flux from an uplifting\nfault block, Basin Res., 12, 367–380.\nAllen, P. A., and N. Hovius (1998), Sediment supply from landslide-domi-\nnated catchments: Implications for basin-margin fans, Basin Res., 10,\n19–35.\nBlair, T. C. (1999a), Sedimentary processes and facies of the waterlaid\nAnvil Spring Canyon alluvial fan, Death Valley, California, Sedimentol-\nogy, 46, 913–940.\nBlair, T. C. (1999b), Sedimentology of the debris flow-dominated Warm\nSpring Canyon alluvial fan, Death Valley, California, Sedimentology, 46,\n941–965.\nBlair, T. C., and J. G. McPherson (1994), Alluvial fan processes and forms,\nin Geomorphology of Desert Environments, edited by A. D. Abrahams\nand A. J. Parsons, pp. 354–402, CRC Press, Boca Raton, Fla.\nBlair, T. C., and J. G. McPherson (1998), Recent debris-flow processes and\nresultant form and facies of the Dolomite alluvial fan, Owens Valley,\nCalifornia, J. Sediment. Res., 68, 800–818.\nBull, W. B. (1962), Relations of alluvial fan size and slope to drainage basin\nsize and lithology in western Fresno County, California, Prof. Pap., 450-\nB, pp. 51–53, U.S. Geol. Surv., Washington D.C.\nBull, W. B. (1964), Geomorphology of segmented alluvial fans in western\nFresno County, California, Prof. Pap., 352-E, 129 pp., U.S. Geol. Surv.,\nWashington D.C.\nCarretier, S., and F. Lucazeau (2005), How does alluvial sedimentation at\nrange fronts modify the erosional dynamics of mountain catchments?,\nBasin Res., 17, 361–382.\nCastelltort, S., and J. van den Driessche (2003), How plausible are high-\nfrequency sediment supply-driven cycles in the stratigraphic record?,\nSediment. Geol., 157, doi:10.1016\/S0037-0738(03)00066-6.\nDade, W. B., and P. F. Friend (1998), Grain size, sediment transport regime,\nand channel slope in alluvial rivers, J. Geol., 106, 661–675.\nDenny, C. S. (1965), Alluvial fans in the Death Valley region, California\nand Nevada, Prof. Pap., 466, 62 pp., U.S. Geol. Surv., Washington D.C.\nDensmore, A. L., N. H. Dawers, S. Gupta, R. Guidon, and T. Goldin\n(2004), Footwall topographic development during continental extension,\nJ. Geophys. Res., 109, F03001, doi:10.1029\/2003JF000115.\nDorsey, R. J., P. J. Umhoefer, and P. D. Falk (1997), Earthquake clustering\ninferred from Pliocene Gilbert-type fan deltas in the Loreto basin, Baja\nCalifornia Sur, Mexico, Geology, 25, 679–682.\nDu¨hnforth, M., A. L. Densmore, S. Ivy-Ochs, and P. A. Allen (2007),\nTiming of debris-flow fan aggradation and incision on Shepherd and\nSymmes Creek fans, Owens Valley, California, deduced from cosmo-\ngenic 10Be, J. Geophys. Res., doi:10.1029\/2006JF000562, in press.\nFernandes, N. F., and W. E. Dietrich (1997), Hillslope evolution by diffu-\nsive processes: The timescale for equilibrium adjustments, Water Resour.\nRes., 33, 1307–1318.\nFraser, G. S., and P. G. DeCelles (1992), Geomorphic controls on sediment\naccumulation at margins of foreland basins, Basin Res., 4, 233–252.\nGordon, I., and P. L. Heller (1993), Evaluating major controls on basin\nstratigraphy, Pine Valley, Nevada: Implications for syntectonic deposi-\ntion, Geol. Soc. Am. Bull., 105, 47–55.\nHeller, P. L., C. L. Angevine, N. S. Winslow, and C. Paola (1988), Two-\nphase stratigraphic model of foreland-basin sequences, Geology, 16,\n501–504.\nHooke, R. L. (1967), Processes on arid-region alluvial fans, J. Geol., 75,\n438–460.\nHooke, R. L. (1968), Steady-state relationships on arid-region alluvial fans\nin closed basins, Am. J. Sci., 266, 609–629.\nHooke, R. L., and W. L. Rohrer (1977), Relative erodibility of source-area\nrock types, as determined from second-order variations in alluvial fan\nsize, Geol. Soc. Am. Bull., 88, 1177–1182.\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n15 of 16\nF01002\nHoward, A. D. (1980), Thresholds in river regimes, in Thresholds in Geo-\nmorphology, edited by D. R. Coates and J. D. Vitek, pp. 227–258, Allen\nand Unwin, St. Leonards, N.S.W., Australia.\nHumphrey, N., and P. L. Heller (1995), Natural oscillations in coupled\ngeomorphic systems: An alternative origin for cyclic sedimentation,\nGeology, 23, 499–502.\nHungr, O., S. McDougall, and M. Bovis (2005), Entrainment of material by\ndebris flows, in Debris-flow Hazards and Related Phenomena, edited by\nM. Jakob and O. Hungr, pp. 135–158, Springer, New York.\nMarr, J. G., J. B. Swenson, C. Paola, and V. R. Voller (2000), A two-\ndiffusion model of fluvial stratigraphy in closed depositional basins,\nBasin Res., 12, 381–398.\nMe´tivier, F., and Y. Gaudemer (1999), Stability of output fluxes of large\nrivers in South and East Asia during the last 2 million years: Implications\nfor floodplain processes, Basin Res., 11, 293–303.\nMe´tivier, F., Y. Gaudemer, P. Tapponier, and M. Klein (1999), Mass\naccumulation rates in Asia during the Cenozoic, Geophys. J. Int.,\n137, 280–318.\nMilana, J. P., and L. Ruzycki (1999), Alluvial-fan slope as a function of\nsediment transport efficiency, J. Sediment. Res., 69, 553–562.\nMortimer, E., S. Gupta, and P. Cowie (2005), Nucleation and growth in\ncoarse-grained deltas, Loreto Basin, Baja California Sur, Mexico: A re-\nsponse to episodic accelerations in fault displacement, Basin Res., 17,\n337–359.\nOguchi, T., and H. Ohmori (1994), Analysis of relationships among alluvial\nfan area, source basin area, basin slope, and sediment yield, Z. Geomor-\nphol., 38, 405–420.\nPaola, C., P. L. Heller, and C. L. Angevine (1992), The large-scale dynamics\nof grain size variation in alluvial basins: 1, Theory, Basin Res., 4, 73–90.\nParker, G., C. Paola, K. X. Whipple, and D. Mohrig (1998), Alluvial fans\nformed by channelized fluvial and sheet flow: 1, Theory, J. Hydraul.\nEng., 24, 985–995.\nPelletier, J. D. (2004), The influence of piedmont deposition on the time\nscale of mountain belt denudation, Geophys. Res. Lett., 31, L15502,\ndoi:10.1029\/2004GL020052.\nSaito, K., and T. Oguchi (2005), Slope of alluvial fans in humid regions of\nJapan, Taiwan, and the Philippines, Geomorphology, 70, 147–162.\nSimpson, G., and F. Schlunegger (2003), Topographic evolution and mor-\nphology of surfaces evolving in response to coupled fluvial and hillslope\nsediment transport, J. Geophys. Res., 108(B6), 2300, doi:10.1029\/\n2002JB002162.\nSmith, T. R., and F. P. Bretherton (1972), Stability and the conservation of\nmass in drainage basin evolution, Water Resour. Res., 8, 1506–1529.\nSnyder, N. P., K. X. Whipple, G. E. Tucker, and D. J. Merritts (2000),\nLandscape response to tectonic forcing: Digital elevation model analysis\nof stream profiles in the Mendocino triple junction region, Northern\nCalifornia, Bull. Geol. Soc. Am., 112, 1250–1263.\nStein, R. S., and S. E. Barrientos (1985), Planar high-angle faulting in the\nBasin and Range: geodetic analysis of the 1983 Borah Peak, Idaho,\nearthquake, J. Geophys. Res., 90, 11,355–11,366.\nStock, J. D., K. M. Schmidt, and D. M. Miller (2004), Observations on\nalluvial fans with relevance to recent sediment transport, Eos Trans.\nAGU, 85(47), Fall Meet. Suppl., Abstract H41G-03.\nSun, T., C. Paola, G. Parker, and P. Meakin (2002), Fluvial fan deltas:\nLinking channel processes with large-scale morphodynamics, Water Re-\nsour. Res., 38(9), 1151, doi:10.1029\/2001WR000284.\nTalling, P. J. (2000), Self-organization of river networks to threshold states,\nWater Resour. Res., 36, 1119–1128.\nTalling, P. J., and M. J. Sowter (1998), Erosion, deposition, and basin-wide\nvariations in stream power and bed shear stress, Basin Res., 10, 87–108.\nTucker, G. E., and K. X. Whipple (2002), Topographic outcomes predicted\nby stream erosion models: sensitivity analysis and intermodel compari-\nson, J. Geophys. Res., 107(B9), 2179, doi:10.1029\/2001JB000162.\nvan der Beek, P., and P. Bishop (2003), Cenozoic river profile development\nin the upper Lachlan catchment (SE Australia) as a test of quantitative\nfluvial incision models, J. Geophys. Res., 108(B6), 2309, doi:10.1029\/\n2002JB002125.\nWhipple, K. X. (2001), Fluvial landscape response time: how plausible is\nsteady-state denudation?, Am. J. Sci., 301, 313–325.\nWhipple, K. X. (2004), Bedrock rivers and the geomorphology of active\norogens, Annu. Rev. Earth Planet. Sci., 32, 151–185.\nWhipple, K. X., and T. Dunne (1992), The influence of debris-flow rheol-\nogy on fan morphology, Owens Valley, California, Bull. Geol. Soc. Am.,\n104, 887–900.\nWhipple, K. X., and C. R. Trayler (1996), Tectonic control of fan size:\nThe importance of spatially variable subsidence rates, Basin Res., 8,\n351–366.\nWhipple, K. X., and G. E. Tucker (1999), Dynamics of the stream power\nincision model: Implications for height limits of mountain ranges, land-\nscape response time scales, and research needs, J. Geophys. Res., 104,\n17,661–17,674.\nWhipple, K. X., and G. E. Tucker (2002), Implications of sediment-flux-\ndependent river incision models for landscape evolution, J. Geophys.\nRes., 107(B2), 2039, doi:10.1029\/2000JB000044.\nWillett, S. D., and M. T. Brandon (2002), On steady states in mountain\nbelts, Geology, 30, 175–178.\nWobus, C., K. Whipple, E. Kirby, N. Snyder, J. Johnson, K. Spyropolou,\nB. T. Crosby, and D. Sheehan (2006), Tectonics from topography:\nProcedures, promise, and pitfalls, in Tectonics, Climate, and Landscape\nEvolution, Geol. Soc. Am. Spec. Pap., 398, edited by S. D. Willett et\nal., pp. 55–74, Geol. Soc. of Am., Boulder, CO.\nZienkiewicz, O. C., and R. L. Taylor (2000), The Finite Element Method:\nVolume 1, The Basis, 689 pp., Elsevier, New York.\n\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\nP. A. Allen, Department of Earth Science and Engineering, Imperial\nCollege London, South Kensington Campus, London SW7 2AZ, UK.\nA. L. Densmore and G. Simpson, Institute of Geology, Department of\nEarth Sciences, ETH Zu¨rich, CH-8092 Zu¨rich, Switzerland. (densmore@\nerdw.ethz.ch)\nF01002 DENSMORE ET AL.: RESPONSE OF A CATCHMENT-FAN SYSTEM\n16 of 16\nF01002\n"}