{"doi":"10.1063\/1.2945291","coreId":"100784","oai":"oai:epubs.surrey.ac.uk:180","identifiers":["oai:epubs.surrey.ac.uk:180","10.1063\/1.2945291"],"title":"Dopant-Stress Synergy in Si Solid-Phase Epitaxy","authors":["Rudawski, N G","Jones, K S","Gwilliam, R"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-01-01","abstract":"<p>The influence of dopants on stressed solid-phase epitaxy of Si was studied in B-doped material up to B concentration of similar to 3.0 x 10(20) cm(-3) and stress of 1.0 +\/- 0.1 GPa. As per the generalized Fermi level shifting model of growth enhancement in the presence of electrically active impurities, it is advanced that application of compressive stress may decreases the energy difference between intrinsic Fermi and acceptor levels thus making dopant and stress effects synergistic in growth kinetics. (C) 2008 American Institute of Physics.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:180<\/identifier><datestamp>\n      2017-10-31T13:57:04Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:696F6E5F6265616D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/180\/<\/dc:relation><dc:title>\n        Dopant-Stress Synergy in Si Solid-Phase Epitaxy<\/dc:title><dc:creator>\n        Rudawski, N G<\/dc:creator><dc:creator>\n        Jones, K S<\/dc:creator><dc:creator>\n        Gwilliam, R<\/dc:creator><dc:description>\n        <p>The influence of dopants on stressed solid-phase epitaxy of Si was studied in B-doped material up to B concentration of similar to 3.0 x 10(20) cm(-3) and stress of 1.0 +\/- 0.1 GPa. As per the generalized Fermi level shifting model of growth enhancement in the presence of electrically active impurities, it is advanced that application of compressive stress may decreases the energy difference between intrinsic Fermi and acceptor levels thus making dopant and stress effects synergistic in growth kinetics. (C) 2008 American Institute of Physics.<\/p><\/dc:description><dc:date>\n        2008-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/180\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Rudawski, N G, Jones, K S and Gwilliam, R  (2008) Dopant-Stress Synergy in Si Solid-Phase Epitaxy   Applied Physics Letters, 92 (23).       <\/dc:identifier><dc:relation>\n        10.1063\/1.2945291<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/180\/","10.1063\/1.2945291"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Dopant-stress synergy in Si solid-phase epitaxy\nN. G. Rudawski,1,a\u0001 K. S. Jones,1 and R. Gwilliam2\n1Department of Materials Science and Engineering, University of Florida,\nGainesville, Florida 32611-6400, USA\n2Nodus Accelerator Laboratory, Advanced Technology Institute, Surrey Ion Beam Centre, Guildford,\nSurrey GU2 7XH, United Kingdom\n\u0001Received 29 April 2008; accepted 26 May 2008; published online 12 June 2008\u0002\nThe influence of dopants on stressed solid-phase epitaxy of Si was studied in B-doped material up\nto B concentration of \u00033.0\u00011020 cm−3 and stress of 1.0\u00020.1 GPa. As per the generalized Fermi\nlevel shifting model of growth enhancement in the presence of electrically active impurities, it is\nadvanced that application of compressive stress may increase the energy difference between\nintrinsic Fermi and acceptor levels thus making dopant and stress effects synergistic in growth\nkinetics. © 2008 American Institute of Physics. \u0004DOI: 10.1063\/1.2945291\u0005\nSolid-phase epitaxial growth \u0001SPEG\u0002 of amorphized Si\nis a topic of great technological importance.1 In particular,\nthere is interest in studying the roles of electrically active\nimpurities and, more recently, stress states \u0001\u0003ij\u0002 on growth\nkinetics due the prevalent nature of stresses in Si device\nprocessing.2 At light electrically active impurity levels, the\nvelocity \u0004 of an advancing growth front between amorphous\n\u0001\u0005\u0002 and crystalline phases can be modeled as linearly en-\nhanced with dopant concentration stemming from a shift in\nthe Fermi energy at the \u0005\/crystalline \u0001growth\u0002 interface.3–6\nThis is known as the generalized Fermi level shifting \u0001GFLS\u0002\nmodel. In the case of B-doped Si, \u0004 takes the form\n\u0004 = \u0004i\u00061 + \u0001CBg\/ni\u0002exp\u0007− EFi − EnpkT \b\t , \u00011\u0002\nwhere kT has the usual meaning, \u0004i is the intrinsic SPEG\nvelocity at T, CB is the electrically active B concentration at\nthe growth interface, g is the degeneracy factor \u00011.5\u00020.2\u0002, ni\nis the intrinsic carrier concentration7 at T, EF\ni is the intrinsic\nFermi level \u00010.55 eV\u0002, and Enp is the acceptor energy level for\nB \u00010.20\u00020.02 eV\u0002. By convention, all energy levels are\nmeasured relative to the top of the valence band.6\nFrom an atomistic standpoint, growth results from crys-\ntal island nucleation at the growth interface with subsequent\nin-plane migration of island ledges.8,9 The GFLS model pro-\nposes that individual nuclei may possess charge states such\nthat the total nucleation rate \u0001with \u0003ij =0\u0002 is given by\n\u0006n\u00010\u0002−1=\u0006n\ni \u00010\u0002−1+\u0006n\np\u00010\u0002−1, where \u0006n\ni \u00010\u0002−1 and \u0006n\np\u00010\u0002−1 are the\nstress-free nucleation rates of uncharged and positively\ncharged nuclei in p-type material. Thus, in the case of\ncharged nuclei, nucleation kinetics will be Fermi level de-\npendent. Assuming a Maxwell–Boltzmann approximation\n\u0001reasonable for dilute dopant levels\u0002 and using the usual ex-\npression for Fermi level as a function of doping, it can be\nshown that\n\u0006n\u00010\u0002−1 = \u0006n\ni \u00010\u0002−1\u00061 + \u0001CBg\/ni\u0002exp\u0007− EFi − EnpkT \b\t \u00012\u0002\nin B-doped Si.10 In conjunction with recent work11,12 where\nthe stress-free growth velocity was shown to be given by\n\u0004=2\u0007x\u0006n\u00010\u0002−1, where \u0007x is the monolayer spacing\n\u00010.14 nm\u0002, Eq. \u00011\u0002 may be rewritten as\n\u0004 =\n2\u0007x\n\u0006n\ni \u00010\u0002\u00061 + \u0001CBg\/ni\u0002exp\u0007− EFi − EnpkT \b\t . \u00013\u0002\nIn terms of stressed-SPEG, recent work in intrinsic \u0001001\u0002\nSi advanced \u0004 as a function of uniaxial stress in the plane of\nthe growth front \u0001\u000311\u0002 of the form\n\u0004 =\n\u0007x\n\u0006n\ni \u00010\u0002 + 2−3\/2\u0006m,11\ni \u00010\u0002exp\u0007− \u0007V11m,11\u000311kT \b\n+\n\u0007x\n\u0006n\ni \u00010\u0002 + 2−3\/2\u0006m,11\ni \u00010\u0002\n, \u00014\u0002\nwhere \u0006m,11\ni \u00010\u0002 is the intrinsic \u0003ij =0 time for ledge migration\nalong 1 and \u0007V11\nm,11 is the activation volume for ledge migra-\ntion along 1 in the 1 direction. By convention, 1 and 2 are the\nin-plane directions, 3 is the growth direction, and positive\n\u0001negative\u0002 elements of \u0003ij are tensile \u0001compressive\u0002. A\nconsequence of Eq. \u00014\u0002 is that \u0004 has finite limits. In the\ncase of 0\b\u000311, \u0004 approaches the tensile saturation velocity\n\u0004t\u00032\u0007x\u0006n\ni \u00010\u0002−1 while in the case of \u000311\t0, \u0004 approaches\nthe compressive velocity limit \u0004c\u0003\u0007x\u0006n\ni \u00010\u0002−1 and thus\n\u0004t \/\u0004c\u00032.\nAt present, it is unclear how the combined presence of\ndopants and stress alters growth kinetics.13–15 Furthermore,\napplication of stress has been shown to cause significant al-\nterations to the electronic structure of Si which, as per the\nGFLS model, may lead to synergistic dopant- and stress-\ninfluenced SPEG kinetics.16–20 Thus, the goal of this work is\nto study the combined roles of electrically active impurities\nand stress on SPEG kinetics.\nIn this study, a polished 50-m-thick \u0001001\u0002 Si wafer was\nSi+-implanted at 50, 100, and 200 keV to doses of 1\u00011015,\n1\u00011015, and 3\u00011015 cm−2 and subsequently B+ implanted\nat 60 keV to a dose of 3.5\u00011015 cm−2. The wafer was sub-\nsequently cleaved along \n110\u000b directions into \u00030.2\n\u00011.8 cm2 strips \u0001with 1 and 2 directions taken to be \u0004110\u0005\nand \u000411¯0\u0005 crystal directions\u0002 and uniaxially stressed up to\nmagnitude of 1.0 GPa along \u0004110\u0005 as presented elsewhere.21\nThe error in all nonzero stress measurements is estimated to\nbe \u00020.1 GPa. Stress-free, tensilely stressed, and compres-\na\u0002Author to whom correspondence should be addressed. Electronic mail:\nngr@ufl.edu.\nAPPLIED PHYSICS LETTERS 92, 232110 \u00012008\u0002\n0003-6951\/2008\/92\u000223\u0001\/232110\/3\/$23.00 © 2008 American Institute of Physics92, 232110-1\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\nsively stressed strips were annealed simultaneously at\n500\u00021 °C in N2 ambient up to 11.2 h. No detectable stress\nrelaxation occurred during annealing. Growth was examined\nusing cross-sectional transmission electron microscopy\n\u0001XTEM\u0002. Approximately 70 XTEM specimens \u000310 \nm\nlong were prepared via site-specific focused ion beam \u0001FIB\u0002\nmilling within a distance of \u00023 mm from the strip centers to\nminimize the presence of any thermal gradient. Due to the\nvery small specimen length to strip length ratio, it is reason-\nably assumed no intraspecimen stress gradients existed.\nFigures 1\u0001a\u0002 and 1\u0001e\u0002 display XTEM micrographs of the\nas-implanted structure indicating an initial \u0005-Si layer\n365\u00025 nm thick. The error in all \u0005-Si thickness \u0001and Si\ngrowth\u0002 measurements is given as the root mean squared\nroughness of the \u0005\/crystalline interface. Annealing for 7.0 h\nwith \u000311=0 resulted in 328\u00023 nm of growth with a planar\n\u0005\/crystalline interface, as shown in Fig. 1\u0001f\u0002. End of range\ndefects from ion implantation were present in all samples. In\nthe case of annealing for 7.0 h with \u000311=−0.25, −0.5, and\n−1.0 GPa, shown in Figs. 1\u0001b\u0002–1\u0001d\u0002, 83\u000225, 64\u000214, and\n57\u000210 nm of growth occurred which is less than the \u000311\n=0 case. The growth interface was observed to roughen sig-\nnificantly with \u000311\u000b0, presumably due to kinetically driven\ninstabilities.11,13 In contrast, annealing with \u000311=0.5 and\n1.0 GPa, shown in Figs. 1\u0001g\u0002 and 1\u0001h\u0002, produced nominally\nthe same amount of growth as the \u000311=0 case. These obser-\nvations are qualitatively consistent with recent studies of in-\ntrinsic stressed SPEG.11,12\nThe \u0005-Si thickness as a function of anneal time was\nmeasured for different \u000311 as shown in Fig. 2. The implanted\nCB profile as measured using secondary ion mass spectrom-\netry \u0001SIMS\u0002 is superimposed in Fig. 2 indicating a peak CB\nof \u00033.0\u00011020 cm−3 \u0003200 nm deep. In cases of 0&nbsp;\n\b\u000311\b1.0 GPa, the \u0005-Si thickness versus time behavior\nwas nominally the same for all \u000311 in this range and thus\nonly the \u000311=0 set of data is reported for clarity. The growth\nkinetics for \u000311\u000b0 were greatly retarded compared to the\n0\b\u000311 cases. For all \u000311, the growth kinetics appears to vary\nwith anneal time and increase with CB as reported by\nothers.3–6\nFigure 3 displays a plot of \u0004 versus CB for different \u000311\nestimated from the data of Fig. 2 using the following\nmethod: \u00011\u0002 the average growth rate between two subsequent\nanneal times was calculated as the change in \u0005-Si thickness\nbetween the anneal times divided by the time interval \u0001this is\nthe reported \u0004\u0002 and \u00012\u0002 the median value of CB over the \u0005-Si\nthickness interval was obtained \u0001this is the reported CB\u0002. For\nall CB, \u0004 was unchanged with 0\u000b\u000311 and retarded for −1.0\n\b\u000311\b−0.25 GPa. It is also evident from Fig. 3 that clear \u0004t\nand approximate \u0004c limits at a given CB are observed as\nindicated.\nSince \u0004 versus CB is constant for 0\b\u000311, it is reasonable\nto extend Eq. \u00013\u0002 to \u0004=\u0004t. Equation \u00013\u0002 was fit to the \u0004t data\nFIG. 1. \u0004\u0001a\u0002 and \u0001e\u0002\u0005 XTEM images of the as-implanted structure. XTEM\nimages of specimens annealed for 7.0 h with applied stress of \u0001b\u0002\n−0.25 GPa, \u0001c\u0002 −0.5 GPa, \u0001d\u0002 −1.0 GPa, \u0001f\u0002 0, \u0001g\u0002 0.5 GPa, and \u0001h\u0002 1.0 GPa.\nFIG. 2. \u0005-Si thickness versus anneal time behavior for different applied\nstress values \u0001\u000311\u0002 as superimposed on the SIMS-determined B concentra-\ntion \u0001CB\u0002 profile.\nFIG. 3. Effect of B concentration \u0001CB\u0002 on growth velocity \u0001\u0004\u0002 for different\napplied stress values \u0001\u000311\u0002.\n232110-2 Rudawski, Jones, and Gwilliam Appl. Phys. Lett. 92, 232110 \u00022008\u0001\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\nin Fig. 3 \u0001assuming stress-independent ni\u00031017 cm−3\u0002 pro-\nducing \u0006n\ni \u00010\u0002= \u00019.0\u00020.5\u0002\u000110−3 h, g=1.0\u00020.1, and \u0007E\n=0.34\u00020.02 eV, where \u0007E=EF\ni\n−En\np\n. The values of g and\n\u0007E are in good agreement with those from the GFLS model.6\nThus, it appears 0\u000b\u000311 does not appreciably alter EF\ni\n−En\np\n.\nThe results support the assumption of ni being stress inde-\npendent. However, considering the vast body of prior work\nregarding stress-induced band structure changes,16–20 it may\nalso be the case that application of 0\u000b\u000311 induces compen-\nsating alterations to EF\ni and En\np such that EF\ni\n−En\np remains\nconstant.\nFigure 3 also displays the estimated \u0004t \/\u0004c versus CB be-\nhavior. The ratio for lower CB is near 2 but \u0004t \/\u0004c\u00036 as CB\nincreases past \u00031.5\u00011020 cm−3. In the case of B-doped Si\n\u0004t\u00032\u0007x\u0006n\np\u00010\u0002−1 as nucleation kinetics do not appear to be\ninfluenced by 0\u000b\u000311. Thus, as per the observed \u0004t \/\u0004c values,\n\u0004c\u0003\u0007x\u0006n\np\u0001\u000311\t0\u0002−1 in B-doped Si where 3\u0001\u0006n\np\u0001\u000311\t0\u0002−1\n\u0003\u0006n\np\u00010\u0002−1. In intrinsic SPEG, \u000311 does not alter nucleation\nkinetics as per the activation volume tensor for crystal island\nformation \u0001\u0007Vij\nn \u0002.11,12 Presumably, \u0007Vij\nn for charged nuclei is\nof the same form. Thus, an explanation for the retarded\nnucleation kinetics with \u000311\t0 is due to stress-induced\nchanges in the Si band structure. Assuming the GFLS model\nis valid for in-plane compression, it therefore appears that\n\u000311\u000b0 increases ni and\/or increases EF\ni\n−En\np\n.\nThe results of this study suggest dopant and stress influ-\nences in SPEG may be synergistic. This is an important re-\nsult as prior work of combined dopant- and stress-influenced\nSPEG assumed the two influences were independent.13–15 In\nparticular, synergy would be important to consider in any\nSPEG simulations.22\nOf course, there are several challenges in this work. Ac-\ncurately characterizing \u0004 as a function of CB with a variable\ndopant profile is difficult, especially due to the ex situ nature\nof the experiments. Another issue is growth interface rough-\nening with \u000311\u000b0 which is partly stress driven, but is also\ndopant gradient driven.13 Prior work of intrinsic SPEG with\n\u000311\t0 observed roughening nearly an order of magnitude\nless than that observed herein.11,12 A possible way to avoid\nthese issues in future work would be to use Si wafers with\nepitaxial layers with constant CB.\nIn summary, the influence of combined dopant- and\nstress-influenced SPEG of amorphized \u0001001\u0002 Si was investi-\ngated. As per the GFLS model of dopant-enhanced SPEG, it\nappears stress may alter the Si electronic structure such that\ndopant and stress influences are synergistic in growth kinet-\nics.\nThe authors acknowledge the Semiconductor Research\nCorporation \u0001Task ID 1372.003\u0002 for funding this research.\nThe Major Analytical Instrumentation Center at the\nUniversity of Florida is acknowledged for use of the FIB and\nTEM facilities.\n1G. L. Olsen and J. A. Roth, Mater. Sci. Rep. 3, 1 \u00011988\u0002.\n2S. M. Hu, J. Appl. Phys. 70, R53 \u00011991\u0002.\n3L. Csepregi, E. F. Kennedy, T. J. Gallagher, J. W. Mayer, and T. W.\nSigmon, J. Appl. Phys. 48, 4234 \u00011977\u0002.\n4J. S. Williams and R. G. Elliman, Phys. Rev. Lett. 51, 1069 \u00011983\u0002.\n5J. C. McCallum, Nucl. Instrum. Methods Phys. Res. B 148, 350 \u00011999\u0002.\n6B. C. Johnson and J. C. McCallum, Phys. Rev. B 76, 045206 \u00012007\u0002.\n7M. A. Green, J. Appl. Phys. 67, 2944 \u00011990\u0002.\n8F. Spaepen, Acta Metall. 26, 1167 \u00011978\u0002.\n9J. S. Williams, R. G. Elliman, W. L. Brown, and T. E. Seidel, Phys. Rev.\nLett. 55, 1482 \u00011985\u0002.\n10P. A. M. Dirac, Proc. R. Soc. London, Ser. A 123, 714 \u00011929\u0002.\n11N. G. Rudawski, K. S. Jones, and R. Gwilliam, Phys. Rev. Lett. 100,\n165501 \u00012008\u0002.\n12N. G. Rudawski, K. S. Jones, and R. Gwilliam, Mater. Sci. Eng., R. 61, 40\n\u00012008\u0002.\n13W. Barvosa-Carter and M. J. Aziz, Appl. Phys. Lett. 79, 356 \u00012001\u0002.\n14W. Barvosa-Carter, M. J. Aziz, A.-V. Phan, T. Kaplan, and L. J. Gray, J.\nAppl. Phys. 96, 5462 \u00012004\u0002.\n15N. G. Rudawski, K. S. Jones, and R. G. Elliman, J. Vac. Sci. Technol. B\n26, 435 \u00012008\u0002.\n16J. J. Wortman, J. R. Hauser, and R. M. Burger, J. Appl. Phys. 35, 2122\n\u00011964\u0002.\n17Y. Kanda, Jpn. J. Appl. Phys. 6, 475 \u00011967\u0002.\n18C. G. Van de Walle and R. M. Martin, Phys. Rev. B 34, 5621 \u00011986\u0002.\n19I. Balslev, Phys. Rev. 143, 636 \u00011966\u0002.\n20C. Herring and E. Vogt, Phys. Rev. 101, 944 \u00011956\u0002.\n21N. G. Rudawski, K. S. Jones, and R. Gwilliam, Appl. Phys. Lett. 91,\n172103 \u00012007\u0002.\n22S. Morarka, N. G. Rudawski, and M. E. Law, J. Vac. Sci. Technol. B 26,\n357 \u00012008\u0002.\n232110-3 Rudawski, Jones, and Gwilliam Appl. Phys. Lett. 92, 232110 \u00022008\u0001\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}