{"doi":"10.1103\/PhysRevLett.96.096603","coreId":"100872","oai":"oai:epubs.surrey.ac.uk:270","identifiers":["oai:epubs.surrey.ac.uk:270","10.1103\/PhysRevLett.96.096603"],"title":"Spin Relaxation by Transient Monopolar and Bipolar Optical Orientation","authors":["Murdin, B N","Litvinenko, K","Clarke, D G","Pidgeon, C R","Murzyn, P","Phillips, P J","Carder, D","Berden, G","Redlich, B","van der Meer, A F","Clowes, S","Harris, J J","Cohen, L F","Ashley, T","Buckle, L"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-01-01","abstract":"<p>We have used two-color time-resolved spectroscopy to measure the relaxation of electron spin polarizations in a bulk semiconductor. The circularly polarized pump beam induces a polarization either by direct excitation from the valence band, or by free-carrier (Drude) absorption when tuned to an energy below the band gap. We find that the spin relaxation time, measured with picosecond time resolution by resonant induced Faraday rotation in both cases, increases in the presence of photogenerated holes. In the case of the material chosen, n-InSb, the increase was from 14 to 38 ps.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:270<\/identifier><datestamp>\n      2017-10-31T13:57:31Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:70686F746F6E696373<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/270\/<\/dc:relation><dc:title>\n        Spin Relaxation by Transient Monopolar and Bipolar Optical Orientation<\/dc:title><dc:creator>\n        Murdin, B N<\/dc:creator><dc:creator>\n        Litvinenko, K<\/dc:creator><dc:creator>\n        Clarke, D G<\/dc:creator><dc:creator>\n        Pidgeon, C R<\/dc:creator><dc:creator>\n        Murzyn, P<\/dc:creator><dc:creator>\n        Phillips, P J<\/dc:creator><dc:creator>\n        Carder, D<\/dc:creator><dc:creator>\n        Berden, G<\/dc:creator><dc:creator>\n        Redlich, B<\/dc:creator><dc:creator>\n        van der Meer, A F<\/dc:creator><dc:creator>\n        Clowes, S<\/dc:creator><dc:creator>\n        Harris, J J<\/dc:creator><dc:creator>\n        Cohen, L F<\/dc:creator><dc:creator>\n        Ashley, T<\/dc:creator><dc:creator>\n        Buckle, L<\/dc:creator><dc:description>\n        <p>We have used two-color time-resolved spectroscopy to measure the relaxation of electron spin polarizations in a bulk semiconductor. The circularly polarized pump beam induces a polarization either by direct excitation from the valence band, or by free-carrier (Drude) absorption when tuned to an energy below the band gap. We find that the spin relaxation time, measured with picosecond time resolution by resonant induced Faraday rotation in both cases, increases in the presence of photogenerated holes. In the case of the material chosen, n-InSb, the increase was from 14 to 38 ps.<\/p><\/dc:description><dc:date>\n        2006-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/270\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Murdin, B N, Litvinenko, K, Clarke, D G, Pidgeon, C R, Murzyn, P, Phillips, P J, Carder, D, Berden, G, Redlich, B, van der Meer, A F, Clowes, S, Harris, J J, Cohen, L F, Ashley, T and Buckle, L  (2006) Spin Relaxation by Transient Monopolar and Bipolar Optical Orientation   Physical Review Letters, 96 (9).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevLett.96.096603<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/270\/","10.1103\/PhysRevLett.96.096603"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"PRL 96, 096603 (2006) P H Y S I C A L R E V I E W L E T T E R S week ending10 MARCH 2006Spin Relaxation by Transient Monopolar and Bipolar Optical Orientation\nB. N. Murdin, K. Litvinenko, and D. G. Clarke\nAdvanced Technology Institute, University of Surrey, Guildford GU2 7XH, United Kingdom\nC. R. Pidgeon and P. Murzyn*\nDepartment of Physics, Heriot-Watt University, Edinburgh EH14 4AS, United Kingdom\nP. J. Phillips, D. Carder, G. Berden, B. Redlich, and A. F. G. van der Meer\nFOM Institute ‘‘Rijnhuizen’’, Post Box 1204, NL-3430BE Niewegein, The Netherlands\nS. Clowes, J. J. Harris, and L. F. Cohen\nBlackett Laboratory, Imperial College London, Prince Consort Road SW7 2BZ, United Kingdom\nT. Ashley and L. Buckle\nQinetiQ Ltd, St. Andrews Road, Malvern WR14 3PS, United Kingdom\n(Received 9 December 2004; published 10 March 2006)0031-9007=We have used two-color time-resolved spectroscopy to measure the relaxation of electron spin\npolarizations in a bulk semiconductor. The circularly polarized pump beam induces a polarization either\nby direct excitation from the valence band, or by free-carrier (Drude) absorption when tuned to an energy\nbelow the band gap. We find that the spin relaxation time, measured with picosecond time resolution by\nresonant induced Faraday rotation in both cases, increases in the presence of photogenerated holes. In the\ncase of the material chosen, n-InSb, the increase was from 14 to 38 ps.\nDOI: 10.1103\/PhysRevLett.96.096603 PACS numbers: 72.25.Rb, 72.25.Fe, 78.47.+pSpin polarizations have become a focus of interest in\nsemiconductor physics in recent years, not least for their\npotential application in ‘‘spintronic’’ devices [1]. It has\nbeen shown that spin polarized electrons (or holes) can\nbe injected from magnetic semiconductor materials into\nsemiconductors [2,3], that they can be coherently trans-\nported through a device [4], and that they can be controlled\n(or modulated) with an external electric field [5]. It remains\nchallenging to improve these breakthroughs to the extent\nthat they can be combined in a practical device [1]. A\nsufficiently long spin lifetime \u0001s is important in the design\nof structures which confine and\/or transfer spin. It is there-\nfore necessary to understand the establishment of a polar-\nized spin population and subsequent spin relaxation\nmechanisms in both bulk and low dimensional semicon-\nductors. A large amount of literature has been established\nto determine spin lifetimes by one or another form of time-\nresolved optical orientation techniques based on spin in-\njection by pulsed interband pumping with circularly polar-\nized light [4–13]. In this Letter we investigate and contrast\nthe spin relaxation lifetimes as measured in a bipolar\n(interband) experiment with spin lifetimes measured in a\nmonopolar regime. In the former, significant numbers of\nexcess electrons and holes are photopumped, whereas most\ndevice proposals involve electrical injection and manipu-\nlation of one type of charge carrier only, ideally at room\ntemperature and often zero magnetic field. To this end we\ncompare in such conditions the results of interband versus\nintraband pumping of spins with picosecond pulses, in the06=96(9)=096603(4)$23.00 09660same sample. We find that the difference is a factor of\nbetween 2 to 3.\nOnly one previous experiment measured the lifetime of\nspins pumped with monopolar excitation in zero magnetic\nfield. In that case hole lifetimes in p-type GaAs=AlGaAs\nquantum wells were measured at low temperature by\nsteady state bleaching of the circularly polarized photo-\ncurrent response [14]. The spin lifetime estimated from the\nsaturation intensity was found to be \u000120 ps at liquid\nhelium temperature. Our picosecond time-resolved mea-\nsurements do not rely on theoretically derived absorption\ncross sections, were made on material at room temperature,\nand directly compare the bipolar and monopolar spin ex-\ncitation and relaxation in the same sample. Our results\nshow, counterintuitively, that photoholes slow down the\nelectron spin relaxation in n-type materials (by a factor\nof 2 to 3 in our case).\nWe chose the narrow gap semiconductor (NGS) InSb for\nthe present study because of the relative strength of the\nDrude absorption (due to the small effective mass) at\nwavelengths relatively near the interband absorption (as-\nsociated with the small energy gap). This was done so that\na single tuneable pump laser, in our case the free electron\nlaser FELIX, could easily reach both regimes. NGSs may\nbe important in future spintronics applications because of\ntheir high Rashba effect [15–17], g factor, and mobility,\netc. Indeed electrical observation of injection with long\nspin mean free path has been reported [18]. In spite of their\npotential, many fewer time-resolved optical measurements3-1 © 2006 The American Physical Society\n0 50 100 150 200\n0.01\n0.1\n1\n0 100 200 300\n10\n100lif\net\nim\ne\n(ps\n)\n \n \n temperature (K)\nN\no\nrm\na\nliz\ne\nd \no\npt\nic\na\nl p\nol\na\nriz\na\ntio\nn\nTime delay, ps\nFIG. 1. The optical polarization decay from the bipolar (de-\ngenerate) circularly polarized pump-probe experiment at 6 \u0005m\nwavelength and 300 K, for intrinsic (open triangles) and n-type\ndoped (open circles) InSb. The solid lines are exponential fits to\nthe data. Inset: spin lifetime determined from the exponential fits\nfor the n-type sample (from the present work and from [9]),\nalong with the theoretical prediction from Eq. (1).\nPRL 96, 096603 (2006) P H Y S I C A L R E V I E W L E T T E R S week ending10 MARCH 2006\nof spin relaxation in narrow gap materials have been\ndescribed than in the GaAs system, because of the relative\nrarity of suitable long wavelength short pulse light sources.\nHowever, we and others have reported such measurement\nof lifetimes in HgCdTe [9], InSb [9], InAs [10–12], and\nInAs=GaSb superlattices [13]. For the same reason, to our\nknowledge, there have not been any reports of time-\nresolved monopolar excitation.\nIn bulk semiconductors three main spin relaxation pro-\ncesses have been found to be important in optical orienta-\ntion experiments: the D’yakonov-Perel (DP) [19], the\nElliott-Yafet (EY) [20], and the Bir-Aronov-Pikus (BAP)\n[21] mechanisms. The BAP mechanism is based on the\nelectron-hole exchange interaction and its rate increases\nwith the concentration of holes. The EY mechanism results\nfrom the fact that the eigenstates are mixed spin and so\ncan be connected by interactions with phonons, etc. The\nrate 1=\u0001EYs is proportional to 1=\u0001p where \u0001p is the orbital\nmomentum scattering time, which would again be in-\ncreased by the presence of holes.\nThe DP mechanism results from the lack of inversion\nsymmetry so that the spin-orbit interaction not only mixes\nthe spins as described above but also lifts the spin degen-\neracy, even in the absence of an externally applied mag-\nnetic field. For small k in bulk crystals this splitting can be\nwritten as \u0001E \u0002 \u0002k3, where \u0002 is the Dresselhaus spin-\nsplitting coefficient. The splitting is equivalent to that\nwhich would be caused by an effective magnetic field\nresulting in the electron spin precessing at a rate deter-\nmined by the splitting. Because of the mixing, injection of\nan electron with definite spin by circularly polarized light\n(or from a magnetic material) is not in a stationary state but\na linear combination of the eigenstates. This superposition\nprecesses coherently at a rate given by the spin splitting,\nwhich depends on k. Furthermore, the direction of the\nprecession vector \u0001 also depends on k. In an ensemble\nof electrons all having different k and hence precessing\nabout different directions and at different rates, the macro-\nscopic polarization unphases at a rate determined by the\nmagnitude of \u0002. Linear momentum scattering changes the\nDP picture from the ‘‘ballistic’’ regime to the ‘‘diffusive’’\nregime, and at elevated temperature it causes k and hence\nalso \u0001 for each electron to perform a random walk, slow-\ning the DP unphasing, so that its rate 1=\u0001s is proportional to\n\u0001p. This is the so-called ‘‘motional narrowing,’’ which\noccurs when \u0002\u0001p \u0003 1. The presence of holes would be\nexpected to increase 1=\u0001p for the electrons, which would\nhave the effect of increasing the electron spin lifetime \u0001s,\nin contrast with the other two mechanisms (and we show\nbelow that this is indeed the case).\nThe diffusive DP relaxation rate is given by [19]\n1\n\u0001DP\n\u0002 \u00022\u0001p \u0002 Q\u0003\n2E3k\n@\n2EG\n\u0001p; (1)\nwhere EG is the band gap, Ek is the electron kinetic energy,09660and \u0003 is a measure of the spin splitting. The dimensionless\nparameter Q depends on the electron distribution and\nscattering process, and is predicted to be 0.05 for impurity\nscattering and degenerate statistics [7]. Clearly the lifetime\nincreases as the temperature (and hence also Ek) is reduced\nas is shown in the inset of Fig. 1.\nAt room temperature and zero magnetic field spin life-\ntimes of the order of 1 ns were reported for GaAs [22]\n(though of the order of hundreds of ns for low tempera-\nture), and 10–20 ps for lightly n-type InSb and InAs [9–\n12], and have been interpreted with the DP mechanism.\nThe expected difference in the DP lifetime between InSb\nand GaAs may be roughly estimated from band structure\nparameters at the band edge, since at the band edge where\nthe spin splitting is cubic in k, \u0003 \u0002 \u0004me=\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n3\u0004 \u0004p , where\n\u0004 \u0002 \u0001=\u0005EG \u0006 \u0001\u0007, me is the electron effective mass ratio\nand \u0001 is the spin orbit split-off energy [19]. Hence \u0003 \u0002\n0:045 for InSb and 0.027 for GaAs, so \u0001DP \/ 1=\u00022 \/\nEG=\u00032 is about 20 times smaller in InSb than in GaAs.\nAlternatively, using values of \u0002 \u0002 \u0003= \u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u00018EGm3ep (atomic\nunits) from [23] we find smaller absolute magnitude\n(\u0003InSb \u0002 0:017), but larger ratio \u0001GaAsDP =\u0001InSbDP \u0001 80 using\n\u0001DP \/ 1=\u00022.\nThe sample used for our study, ME1722, was 5 \u0005m\nthick InSb, grown by molecular-beam epitaxy tech-\nnique on a semi-insulating GaAs substrate. It was n-type\ndoped in order to have significant intraband free-carrier\nabsorption, and the room temperature electron concen-\ntration and mobility measured with the Hall effect\nwere 8\b 1016 cm\u00043 and 54 000 cm2 V\u00041 s\u00041, respec-\ntively. For reference we have also made measurements\non a lightly doped sample, ME1654 (1:5\b 1016 cm\u00043;\n68 700 cm2 V\u00041 s\u00041).\nWe performed circularly polarized pump-probe experi-\nments using transient induced Faraday rotation, similar to\nthose described elsewhere [4–6], with the difference being3-2\n0 50 100 150 200\n0.01\n0.1\n1\n1015 1016 1017 1018\n0.1\n1\n10\nτ p\n \n(ps\n)\n \n \nexcitation density (cm-3)\n \nN\nor\nm\na\nliz\ne\nd \nop\ntic\na\nl p\nol\na\nriz\na\ntio\nn\nTime delay, ps\nFIG. 2. Comparison of the optical polarization decay for the\nbipolar and monopolar circularly polarized pump-probe experi-\nments at 300 K. The probe beam was at 6 \u0005m wavelength in\nboth cases, and the pump was either at 6 \u0005m, i.e., degenerate\nwith the probe (open circles) or at 11 \u0005m (solid circles). The\n11 \u0005m pump results in a spin decay that is clearly faster than for\n6 \u0005m pumping. The solid lines are exponential fits to the data.\nThe inset shows the calculated electron momentum relaxation\ntime due to collisions with ionized impurities only (dashed\ncurve) and with both ionized impurities and photoholes (solid\ncurve), as functions of the photoexcited carrier density. Sub-\nstitution of \u0001p into Eq. (1) gives \u0001DP.\nPRL 96, 096603 (2006) P H Y S I C A L R E V I E W L E T T E R S week ending10 MARCH 2006\nthat the pump and the probe originated from two different\nlasers. The pump beam was the free electron laser, FELIX,\nwhich produces (sub-) picosecond pulses and is continu-\nously tunable from 4–250 \u0005m. The probe beam was taken\nfrom a solid state laser system (pumped by an amplified\nmode-locked Ti:sapphire laser) producing subpicosecond\nmidinfrared pulses from 3:3–18 \u0005m. The lasers were syn-\nchronized with an rf phase locked loop. With the chosen\nsample material, InSb, FELIX can reach both above and\nbelow the gap, and we were thus able to investigate easily\nboth interband and intraband excitations without any modi-\nfication of the experimental apparatus. The sample doping\ncauses a Moss-Burstein shift of the interband absorption\nedge to wavelength shorter than the room temperature\nbandgap of InSb (7 \u0005m \t 0:18 eV). Therefore the probe\nlaser was set at a wavelength of 6 \u0005m (\t0:20 eV) and\nremained fixed throughout the experiment.\nFirst, the pump laser was set at 6 \u0005m wavelength,\ndegenerate with the probe. Both beams were linearly po-\nlarized. The pump and probe pulse energies were approxi-\nmately 1 \u0005J and 10 nJ, respectively, and they were focused\nto spot sizes of approximately 100 \u0005m. The decay time\n(data not shown) was 1 ns, and this is the interband\nrecombination time and has been shown previously to be\ndetermined by Auger recombination in this material [24].\nFor the transient Faraday rotation experiment a variable\nwavelength quarter-wave plate was then inserted into the\npump beam. The probe remained linearly polarized (verti-\ncally). An uncoated (nonpolarizing) ZnSe beam splitter\nwas placed in the probe beam after the sample and an\nanalyzer was placed in one of the arms (the ‘‘signal’’) at\n45\n to the incoming polarization, and the other arm (the\n‘‘reference’’) was unpolarized. Matched, cooled HgCdTe\ndetected the signal and reference simultaneously and the\nratio was used as a measure of the induced Faraday rota-\ntion, eliminating any change in magnitude of the trans-\nmitted probe due to pulse amplitude fluctuations, etc. The\ndecay time of the transient Faraday rotation due to inter-\nband bipolar pumping, Fig. 1, gives a spin lifetime of 38 ps\nfor the doped sample ME1722 and 12 ps for the lightly\ndoped sample ME1654.\nWe then tuned the pump laser to the far infrared at\n11 \u0005m (\t0:11 eV) and readjusted the variable quarter-\nwave plate in the pump beam for the new wavelength.\nNothing else was changed. The new pump pulse energy\nwas 2 \u0005J and the spot size was 200 \u0005m, i.e., the irradiance\nat the sample was very similar to the degenerate experi-\nment. At this wavelength, well below the band gap of InSb,\nthe strongest absorption process is free-carrier (Drude)\nabsorption of the electrons. It has previously been shown\nthat this process can be used to generate spin polarizations\nthough with a rather weaker selection rule than for inter-\nband transitions [25]. Free-carrier absorption is a second\norder process that involves electron-photon absorption to\nan intermediate state, followed by phonon scattering. The09660dominant pathway involves intermediate states within the\nconduction band, but this is spin independent. However,\nprocesses with the intermediate state in the valence band\ngive rise to spin selectivity in exactly the same way as for\ninterband transitions, so that a small fraction of electrons\nbecome polarized. In GaAs the number of spins per ab-\nsorption was estimated to be about 10\u00046 for h\u0006 \u0002 10 meV\n[25], but in our case this is about 2500 times larger due to\nthe larger spin-orbit coupling & smaller gap of InSb, and\nthe larger pump photon energy. The probe was left exactly\nas before, at 6 \u0005m, and therefore had the same sensitivity\nto spin polarization in the sample as for the interband\npumping experiment. A significantly shorter spin lifetime\nof 14 ps was measured (solid circles Fig. 2) for the monop-\nolar pump experiment. In comparison, this lifetime is about\na third of that obtained with bipolar pumping (open circles\nFig. 2).\nIn order to explain the bipolar experiment, and its rela-\ntionship with the monopolar result we note that the scat-\ntering of minority and majority carriers may be treated the\nsame as ionized impurity scattering, and we may therefore\ncalculate the effect of the photoholes on the orbital electron\nmomentum scattering time using the Brooks-Herring for-\nmula [26]\n\u0001iip \u0002 2\n9=2\u0007\"2m\u000b1=2E3=2k\ne4NI\n\u0002\nlog\n\u0003\n1\u0006 8m\n\u000bEk\n@q20\n\u0004\n\u0004 1\n1\u0006 @q20=8m\u000bEk\n\u0005\u00041\n; (2)\nwhere m\u000b is the electron effective mass, \" is the dielectric3-3\nPRL 96, 096603 (2006) P H Y S I C A L R E V I E W L E T T E R S week ending10 MARCH 2006\npermittivity, NI is the ionized impurity concentration, and\nthe screening length is given by\nq20 \u0002\ne2m\u000b\n\u0007\"0\"1@2\n\u0003\n3ne\n\u0007\n\u0004\n1=3\n; (3)\nwhere ne is the total electron concentration. For the total\nlifetime under bipolar excitation we replace NI by the sum\nof the donor concentration and the photohole concentra-\ntion. Results for the momentum scattering time for the two\ncases (scattering by donors only or by both donors and\nphotoholes) are shown in the inset of Fig. 2. In the monop-\nolar experiment no photocarriers are created, and the mo-\nmentum scattering time in this limit is 1 ps. In the bipolar\nexperiment at bleaching (i.e., when the electron and hole\nquasi-Fermi energies are separated by the pump photon\nenergy) the photohole concentration is 4\b 1017 cm\u00043. In\nthis case the momentum scattering time by ionized impu-\nrities alone is 4 ps, and has risen because the rise in electron\nenergy means that they are less affected by the ion poten-\ntial. On the other hand, when the photoholes are taken into\naccount, this effectively increases the number of scatterers,\nso that the total momentum time has fallen to 0.6 ps, as\nshown in Fig. 2. Finally, this means that the \u0001DP \/\n1=\u0005E3k\u0001p\u0007 is predicted to increase by a factor of about 2\ngoing from monopolar to bipolar pumping, in reasonable\nagreement with the experimental results (from 14 to 38 ps).\nWe have used the bleaching condition again to find the\naverage value hE3ki \u0002 \u00050:10 eV\u00073 in the bipolar experiment,\nwhich is very similar to the excitation energy in the mo-\nnopolar case. The implications for the pure (intrinsic)\nsample are that the observed bipolar lifetime of 12 ps has\nalso been increased by the photopumping, and that the true\nDP lifetime is about 6 ps. This cannot of course be verified\nby direct experiment because monopolar pumping is not\npossible with an intrinsic sample.\nFinally, we must consider the effects (if any) of hot\nelectrons on the validity our assumption of motional nar-\nrowing. Taking the measured bipolar spin lifetime in the\ndoped sample (38 ps) and the calculated \u0001p (0.6 ps), using\nEq. (1) we find \u0002 \u0002 0:2 ps\u00041, and \u0002\u0001p \u0002 0:1. The value\nof \u0002 is consistent with that found using a reduced value of\n\u0003 \u0002 0:01 at high k [23], and assuming Q \u0002 0:05 [7] and\nEk \u0002 0:10 eV. Moving to the monopolar experiment, us-\ning Ek \u0002 0:11 eV and \u0001p \u0002 1 ps, we find that \u0002\u0001p \u0002\n0:3. Thus, although the electrons are hot, in both cases\n\u0002\u0001p \u0003 1 and, consequently, the motional narrowing con-\ndition applies. Finally we note that hE3ki is very similar in\nboth cases, so the different lifetime is not due to different\nelectron distributions. We may therefore assume that dif-\nferences between the two results are due to the effects of\nholes on \u0001p.\nIn conclusion, we have demonstrated clearly that\nthrough the presence of the photoholes there is a difference\nbetween monopolar and bipolar pumping of a bulk semi-\nconductor. The spin lifetime in the monopolar regime was09660shown to decrease by about a factor of between 2 and 3\ncompared to the bipolar pumping case. This could have\nimportant implications for the physics of future spintronic\ndevices. It is suggested that the explanation for this short-\nening of the lifetime for monopolar pumping is that the\nphotoholes lower the electron mobility, which for the DP\nmechanism lengthens the spin relaxation time. In the case\nof the EY or BAP mechanism the injection of holes and\nlowering of the mobility would have the opposite effect.\nWe gratefully acknowledge support by EPSRC-UK\n(GR\/R74178, EP\/C511999), FOM-NL, and the European\nCommunity (G5RD-CT-2001-00535 and I3 IA-SFS).3-4*Present address: Department of Physics and Astronomy,\nUniversity of Sheffield, Sheffield S3 7RH, United\nKingdom.\n[1] S. Datta and B. Das, Appl. Phys. Lett. 56, 665 (1990).\n[2] R. Fiederling et al., Nature (London) 402, 787 (1999).\n[3] Y. Ohno et al., Nature (London) 402, 790 (1999).\n[4] Y. Kato, R. C. Myers, A. C. Gossard, and D. D.\nAwschalom, Nature (London) 427, 50 (2004).\n[5] O. Z. Karimov et al., Phys. Rev. Lett. 91, 246601\n(2003).\n[6] M. A. Brand et al., Phys. Rev. Lett. 89, 236601 (2002).\n[7] G. E. Pikus and A. N. Titkov, in Optical Orientation,\nedited by F. Meier and B. Zakharchenya (North-Holland,\nNew York, 1984), p. 84.\n[8] A. Tackeuchi, T. Kuroda, S. Muto, and O. Wada, Physica\nB (Amsterdam) 272, 318 (1999).\n[9] P. Murzyn et al., Phys. Rev. B 67, 235202 (2003).\n[10] T. F. Boggess et al., Appl. Phys. Lett. 77, 1333 (2000).\n[11] P. Murzyn et al., Appl. Phys. Lett. 83, 5220 (2003).\n[12] B. N. Murdin et al. (to be published).\n[13] K. C. Hall et al., Phys. Rev. B 68, 115311 (2003).\n[14] S. D. Ganichev et al., Phys. Rev. Lett. 88, 057401 (2002).\n[15] W. Zawadski and P. Pfeffer, Semicond. Sci. Technol.\n19 R1 (2004).\n[16] T. Koga, J. Nitta, T. Akazaki, and H. Takayanagi, Phys.\nRev. Lett. 89, 046801 (2002).\n[17] S. D. Ganichev et al., Phys. Rev. Lett. 92, 256601 (2004).\n[18] P. R. Hammar and M. Johnson, Phys. Rev. Lett. 88,\n066806 (2002).\n[19] M. I. D’yakonov and V. I. Perel, Sov. Phys. JETP 33, 1053\n(1971); Sov. Phys. Solid State 13, 3023 (1972).\n[20] R. J. Elliott, Phys. Rev. 96, 266 (1954); Y. Yafet, in Solid\nState Physics, edited by F. Seitz and D. Turnbull\n(Academic, New York, 1963), Vol. 14.\n[21] G. L. Bir, A. G. Aronov, and G. E. Pikus, Sov. Phys.\nJETP 42, 705 (1975).\n[22] W. H. Lau, J. T. Olesburg, and M. E. Flatte, Phys. Rev. B\n64, 161301 (2001).\n[23] M. Cardona, N. E. Christensen, and G. Fasol, Phys. Rev. B\n38, 1806 (1988).\n[24] B. N. Murdin et al., Inst. Phys. Conf. Ser. 144, 267 (1995).\n[25] S. A. Tarasenko et al., J. Supercond. 16, 419 (2003).\n[26] B. K. Ridley, Quantum Processes in Semiconductors\n(Oxford University, New York, 1993), p. 176.\n"}