{"doi":"10.1107\/S0909049598017087","coreId":"195551","oai":"oai:lra.le.ac.uk:2381\/7649","identifiers":["oai:lra.le.ac.uk:2381\/7649","10.1107\/S0909049598017087"],"title":"Amplitude Reduction in EXAFS.","authors":["Roy, Mervyn","Gurman, Steve J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1999-05","abstract":"In real systems, inelastic processes remove photoelectrons from the elastic scattering channel.  This reduces the amplitude of the EXAFS causing disagreement between the experimental and theoretically predicted amplitudes.  Traditionally these discrepancies were treated by including two semi empirical reduction factors in the data analysis; a mean free path term, which models the so called extrinsic loss processes, and a constant amplitude reduction factor which accounts for many electron excitations at the absorbing atom.  The extrinsic inelastic effects may, however, be modelled more rigorously using a complex exchange and correlation potential.  For example the Hedin-Lundqvist (H-L) potential used in most EXAFS data analysis programs.  We present a method by which the losses caused by such a potential may be evaluated quickly and easily in the first Born approximation.  The losses produced by the H-L potential significantly overestimate those produced by the mean free path alone.  Instead the losses appear to agree well with the total reduction given by the semi-empirical reduction factors.  These losses do not exhibit the correct low or high energy behaviour but do show excellent agreement with experiment over the range of a typical EXAFS spectrum.  We therefore conclude, that the semi-empirical reduction parameters should not be included when data fitting using the H-L potential.Peer-reviewedPublisher Versio","downloadUrl":"http:\/\/hdl.handle.net\/2381\/7649","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7649\/3\/10.1107_S0909049598017087.pdf","pdfHashValue":"5ed8277e8a1e8addd10d0661daf10f9f1c951a99","publisher":"International Union of Crystallography","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7649<\/identifier><datestamp>\n                2014-02-01T02:01:15Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nAmplitude Reduction in EXAFS.<\/dc:title><dc:creator>\nRoy, Mervyn<\/dc:creator><dc:creator>\nGurman, Steve J.<\/dc:creator><dc:description>\nIn real systems, inelastic processes remove photoelectrons from the elastic scattering channel.  This reduces the amplitude of the EXAFS causing disagreement between the experimental and theoretically predicted amplitudes.  Traditionally these discrepancies were treated by including two semi empirical reduction factors in the data analysis; a mean free path term, which models the so called extrinsic loss processes, and a constant amplitude reduction factor which accounts for many electron excitations at the absorbing atom.  The extrinsic inelastic effects may, however, be modelled more rigorously using a complex exchange and correlation potential.  For example the Hedin-Lundqvist (H-L) potential used in most EXAFS data analysis programs.  We present a method by which the losses caused by such a potential may be evaluated quickly and easily in the first Born approximation.  The losses produced by the H-L potential significantly overestimate those produced by the mean free path alone.  Instead the losses appear to agree well with the total reduction given by the semi-empirical reduction factors.  These losses do not exhibit the correct low or high energy behaviour but do show excellent agreement with experiment over the range of a typical EXAFS spectrum.  We therefore conclude, that the semi-empirical reduction parameters should not be included when data fitting using the H-L potential.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPublisher Version<\/dc:description><dc:date>\n2010-03-08T16:02:17Z<\/dc:date><dc:date>\n2010-03-08T16:02:17Z<\/dc:date><dc:date>\n1999-05<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nJournal of Synchrotron Radiation, 1999, 6 (3), pp. 228 - 230<\/dc:identifier><dc:identifier>\n0909-0495<\/dc:identifier><dc:identifier>\nhttp:\/\/scripts.iucr.org\/cgi-bin\/paper?S0909049598017087<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7649<\/dc:identifier><dc:identifier>\n10.1107\/S0909049598017087<\/dc:identifier><dc:identifier>\n1600-5775<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nCondensed Matter Physics<\/dc:relation><dc:rights>\nCopyright © 1999, International Union of Crystallography. Deposited with reference to the publisher’s archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nInternational Union of Crystallography<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0909-0495","1600-5775","issn:1600-5775","0909-0495"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Condensed Matter Physics"],"year":1999,"topics":[],"subject":["Article"],"fullText":"228 \nJ. Synchrotron ~:lad. (1999). 6, 228-230 \nAmplitude reduction in EXAFS \nM. Roy* and S. J. Gurman \nDepartment of Physics, University of Leicester, Leicester \nLE1 7RH, U.K. England. E-mail: mr6 @ le.ac.uk \nIn real systems, inelastic processes remove photoelectrons from the \nelastic scattering channel. This reduces the amplitude of the EX- \nAFS causing disagreement between the experimental nd theoret- \nically predicted amplitudes. Traditionally these discrepancies were \ntreated by including two semi empirical reduction factors in the data \nanalysis: a mean tree path term, which models the so called extrin- \nsic loss processes, and a constant amplitude reduction factor which \naccounts for many electron excitations at the absorbing atom. The \nextrinsic inelastic effects may, however, be modelled more rigor- \nously using a complex exchange and correlation potential. For ex- \nample the Hedin-Lundqvist (H-L) potential used in most EXAFS \ndata analysis programs. We present a method by which the losses \ncaused by such a potential may be evaluated quickly and easily in \nthe first Born approximation. The losses produced by the H-L po- \ntential significantly overestimate hose produced by the mean free \npath alone. Instead the losses appear to agree well with the total re- \nduction given by the semi-empirical reduction factors. These losses \ndo not exhibit he correct low or high energy behaviour but do show \nexcellent agreement with experiment over the range of a typical EX- \nAFS spectrum. We therefore conclude, that the semi-empirical re- \nduction parameters should not be included when data fitting using \nthe H-L potential. \nKeywords: EXAFS; Many Body Theory; Inelastic \nprocesses. \n1. Introduction \nInterpretation of the EXAFS may be based on a simple equation \n(Lee & Pendry, 1975) obtained using the plane wave approxima- \ntion. The single electron, single scattering expression for the EX- \nAFS function x(k) is, \nNjlfj(k)l \nx~(k)  = \n2 - -  2 R j \/ ~ ( ~ ) ~ ( - -  '2 k 2 ~ . 2 ) \nJ ~o~ ~ \" kR 2 \nx sin(2krj + 2&j(k,r) + ¢5)\" (1) \nEquation (l) describes the EXAFS due to scattering by shells of \nNj atoms at a distance Rj from the absorbing atom. fj (k) is the \nbackscattering amplitude from each of the Nj neighbours whilst \nthe Debye-Waller factor, aj, allows for static and thermal disor- \n, 2 der effects. The reduction factors, e -2nj\/~(k) and so account for \ndiscrepancies between the predicted and experimentally measured \namplitudes. \nThese discrepancies arise because only elastically scattered pho- \ntoelectrons contribute to the primary channel EXAFS. With a real \nscattering potential, the reduction factors are needed to account for \neffective absorptions from the photoelectron beam due to various \ninelastic scattering processes, e-9nj\/~'(k) is the mean free path \nterm. This accounts for the extrinsic losses (Penn 1987), those pro- \nduced by inelastic electron-electron scattering events at neighbour- \ning atoms and in the medium in between. The constant amplitude \nConference Proceedings \n2 approximates the losses due to multiple elec- reduction factor, So, \ntron excitations at the absorbing atom. The multiple electron exci- \ntations are caused by the creation of a core hole in addition to the \nphotoelectron when the x-ray photon is absorbed. They are usually \nreferred to as the 'intrinsic losses' in the literature (Bardyszewski \n& Hedin, 1985). \nMost modem EXAFS data analysis programs use a complex ex- \nchange and correlation potential to model the extrinsic inelastic \neffects, for example the H-L potential (Hedin & Lundqvist, 1969) \nused in the standard Daresbury package EXCURV92 (Binsted et al, \n1992). The H-L potential approximates the effect of the electron- \nelectron interactions as the photoelectron propagates between the \ncentral and neighbouring atoms. This potential gives rise to com- \nplex phase shifts in equation (1) and therefore reduces the ampli- \ntude of the EXAFS without he need for ad hoc reduction param- \neters. We shall now proceed to calculate the amplitude of the EX- \nAFS in the presence of the H-L potential. \n2. Calculation \nWe could, in principle, use a program such as EXCURV92 to in- \nvestigate the effect of the H-L potential on the EXAFS amplitudes. \nThe full EXAFS could be calculated both in the presence and the \nabsence of the imaginary part of the H-L potential and the am- \nplitudes compared. However for the sake of ease of computation \nwe choose to evaluate the EXAFS in the first Born approximation. \nThis approach gives the standard textbook results in the case of an \nisolated atom (Bransden and Joachain 1983). \nStandard single electron EXAFS theory may be developed \nwithin the 'muffin tin' approximation using the Hartree photoelec- \ntron Greens function, Gc(r, r'), and the basis state wave function, \ndpo(kr). Where ¢o(kr) = ~-~tm 27rztei6' Rl(kr)Yzm(÷)Yt~([¢) \ninside the muffin tin, and Rt(kr) is a regular solution of the \nSchrOdinger equation in the presence of the atomic potential and \nthe real part of the H-L potential. We examine the effect of the \nimaginary part of the H-L potential, 1\/'i, on the EXAFS by treat- \ning it as a perturbation on the wave functions, ¢o(kr). V] is \nzero outside each of the muffin tin spheres. To first order in VI, \n¢1 (kr) = ¢o (kr) + Gc (r, r') VI (r')¢o (kr). Outside the muffin tin \nthe perturbed basis state is then found to have the same functional \nform as dpo(kr). The phase-shifted parts are merely multiplied by \nk,,~ (Rtl l,\"t I Rt) } which we can subsume into the a factor { 1 + n--r \nphase shifts making 3t complex. Using the complex phase shifts, \n6~ = ~l + ~2kn-~ (Rz I VII Rz), in the expression for the basis state \nwave functions and in the Hartree Greens function we may pro- \nceed with the standard theoretical treatment to derive the EXAFS \nin a form similar to equation ( 1 ), \nkR~ --~-(R, I V, I R,) } \nx sin(2krj + 2~j(k,r) + ej) .  (2) \nIn equation (2) l is the angular momentum of the relevant photo- \nelectron final state and the perturbed backscattering factor, f~ (k), \nis given by, \nz { km } \ng(k)  = ~-~ ~(- -1 )L (2L+I )  1 -- --~-<RLI v, I  RL>e 2'6L , \nL \n(3) \nComparing equations ( ! ) and (2) we can easily see that the ampli- \ntude reduction produced by the imaginary part to the H-L potential \nis given by, \n2kin <Rz I Vzl Rt> } lY;(k)l (4) \nA = t 1 - ~ J If~(k)l \n@ 1999 International Union of Crystallography \nPrinted in Great Britain - all rights reserved \nJournal of Synchrotron Radiation \nISSN 0909-0495 @ 1999 \n1.0 We calculate the radial wave functions used in equation (4) by \nnumerically integrating out the Schr6dinger equation to the edge \nof the muffin tin sphere. The calculated phase shifts are then used \nto evaluate fj (k) and f~ (k). \nThe exchange and correlation potential is also evaluated numer- \nically. We follow a scheme outlined by Lee and Beni (Lee & Beni, \n1976) who first developed the H-L potential for EXAFS calcula- \ntions by applying standard results for the electron self energy in a \nhomogeneous electron gas within a local density formalism. The \nself energy is calculated using the single plasmon pole approxi- \nmation in which the elementary excitations of the electron gas are \nreplaced by a single plasmon-like absorption for all wavevectors. \nThis absorption isweighted so as to exhaust the sum rule on the di- \nelectric function (Hedin & Lundqvist, 1969). Thus the H-L poten- \ntial should include all the relevant inelastic electron-electron scat- \ntering events. \n0.8 \n0.6 \nE < 0.4 \n0.2 \n1.0 \n0.0 \n0.0 \n' Calculation ' \n510 l().O 15.0 \nk(A') \nFigure 2 \nCalculated and best fit EXAFS reduction factors plotted against photo- \nelectron wave vector for Copper. \n3. Results \nThe EXAFS amplitude is calculated using equation (4) for three \nelements: Silicon, Copper and Silver. This is then compared to \nknown values of the empirical parameters, s2o(k) and e -2nj\/x(k), \nfitted using the real X-alpha potential for the three elements with \nthe data analysis program EXCURV92. The best fit values of so 2\nand an effective, constant, imaginary potential, VPt, were found \n2 2 to be So = 0.72 4- 0.1 for Silicon, So = 0.70 4. 0.1 for Cop- \nper, and so 2 = 0.67 4. 0.15 for Silver. The VpI values used \nwere: -4 .0eV 4. 0.2eV for Silicon, -4 .0eV + 0.2eV for Cop- \nper and -6 .3eV 4. 0.2eV for Silver where the quoted uncertain- \nties are 2a errors. The mean free path term is calculated from \nthe constant imaginary potential, VpI, using the standard relation \nA(k) = h'Zk\/mVpt. \n0.8 '- Calculation \n0.6 \nE < 0.4 \n0.2 \nConference Proceedings 229 \n0.0 \n0.0 5.0 10.0 15.0 \nk(A' ) \nFigure 1 \nCalculated and best fit EXAFS reduction factors plotted against photo- \nelectron wave vector for Silicon. \n1.0 \n0.8 \n0.6 \n..J \n< 0.4 \n0.2 \n- - -  Calculation \n........ Experiment \nFigure 3 \nCalculated and best fit EXAFS reduction factors plotted against photo- \nelectron wave vector for Silver. \nIn figures 1, 2 and 3 we plot the calculated amplitude as a func- \ntion of the photoelectron wave-vector, k in ,~1-x. The solid band \n2 e-2Rj\/X(k) shows the product of the fitted values of so and within \nthe limit of experimental error. We can clearly see that the losses \nobtained from the H-L potential agree with the total reduction \ngiven by the semi-empirical reduction parameters and must there- \nfore overestimate that produced by the mean free path effects alone. \nOver the range of a typical EXAFS spectrum, 4:1.- 1 to 14)1- x, the \ncalculated reduction parameters lie within the error range of the \nbest fit experimental data. We measure the correlation between our \ncalculations and the fitted empirical parameters in this region using \nthe R-factor, R = ~ [expt-theorlt[ X 100%. We find R = 4.9% \nE [expt[ \nfor Silicon, R = 6.5% for Copper, and R = 10.4% for Silver. \nThese uncertainties are much lower than those observed in the best \nfit parameters for the various elements: 15.5% for Silicon, 16.1% \nfor Copper and 24.4% for Silver, which suggests that the reduction \ngiven by the H-L potential is equivalent to that produced by the \nsemi-empirical reduction parameters. \nEXCURV92 was also used to fit values for the adjustable pa- \n2 rameter, so, using the H-L potential. We found values of s2o(k) = \n0.92 4- 0.10 for Silicon, S2o(k) = 1.05 4- 0.05 for Copper and \nS2o(k) = 1.02 4- 0.05 for Silver. These values are all consistent \nwith unity which again would suggest that, empirically, the H-L \npotential accounts for all of the losses to the EXAFS. \n0.0  ~ J \n0.0 5.0 10.0 15.0 \nk(A' ) \n230 Conference Proceedings \nAt low x-ray energies the calculated results exhibit unphysical \nbehaviour. Close to the edge the calculated amplitude does not vary \nfrom unity until, at about k -,~ 3~ -1 , it cuts in rapidly to its min- \nimum value. This low energy cut off is a feature of the H-L po- \ntential. No inelastic scattering events are possible until the photo- \nelectron is above the minimum plasmon energy. Above this energy \nthe reduction cuts in rapidly because most of the contribution to \nthe imaginary part of the H-L potential comes from the region of \nalmost constant electronic density close to the edge of the muffin \ntin. \nA theoretical model by Thomas (Thomas, 1984) suggests that \nthe reduction factor should vary smoothly from unity to its full \nstrength within about 50eV above the edge. Our calculations do \nnot show this smooth energy dependence because the H-L poten- \ntial does not include single electron excitations with energies below \nthe minimum plasmon energy. At higher energies these single elec- \ntron events are included by appropriately weighting the plasmon \nexcitation strength, thus this failure only occurs at low k. \nAt high k the H-L potential overestimates the EXAFS ampli- \ntudes. The H-L potential models the extrinsic loss effects and so, \nlike the mean free path term it will disappear at high energies. From \nFigures 1, 2 and 3 it is clear that the calculated amplitudes are still \nincreasing at k = 15~ -x. The H-L potential itself varies as 1\/k  \nat large k, and, as the radial wave functions, Rt (kr),  are also pro- \nportional to 1\/k  at high energies, the EXAFS amplitudes given \nby the H-L potential will obviously tend to unity. However, using \nthe sudden approximation we can show that the intrinsic loss pa- \nrameter, and hence the total amplitude reduction, should tend to a \nconstant value of about 0.7 at high photoelectron energies (Rehr et \nal, 1978, Roy & Gurman, 1997). This is because the H-L potential \ndoes not include a contribution from the core hole. In the region of \nenergy appropriate to the EXAFS it merely overestimates the mean \ntree path effects in order to obtain the correct amplitude reduction \nfactors. Indeed, an explicit calculation of the mean free path using \nthe H-L potential gives values much shorter than those observed \nexperimentally. \n4. Conclusion \nWe have calculated the effect of the imaginary part of the H-L po- \ntential on the EXAFS amplitude using a perturbation series to first \norder in VI (r). We find that the H-L potential overestimates the \nlosses to the EXAFS due to the finite photoelectron mean free path \nalone. However, it happens to give excellent agreement with the to- \ntal experimental losses in the range of most EXAFS data analysis. \nEmpirically the H-L potential accounts for all of the losses to \nthe EXAFS amplitudes. We therefore conclude that it should not \n2 be necessary to use the additional amplitude fitting parameters, So \nand e -2n~\/;'(k), when data fitting with the H-L potential. \nHowever the H-L potential is 'merely a phenomenological \nmodel that happens to work for the EXAFS' (Tyson 1991). It also \ndoes not exhibit the correct behaviour at very high and low pho- \ntoelectron energies. As such the development of a more accurate \nexchange and correlation potential for use in EXAFS calculations \nwould be desirable. \nReferences \nP A Lee & J B Pendry, Phys. rev. B 11 (1975) 2785-2811 \nW Bardyszewski & L Hedin, Physica Scripta, 32 (1985) 439-450 \nL Hedin & S Lundqvist, Solid State Physics, 23 (1969) 2-181 \nD R Penn, Phys Rev B, 35 (1987) 482-486 \nN Binsted, S J Gurman, T C Campbell, & P C Stephenson, EXCURV92 \nprogram (Daresbury: SERC Daresbury Laboratory) 1992 \nB H Bransden & C J Joachain Physics of Atoms and Molecules, Longman \nScientific and Technical, (1983), 494 \nP A Lee & G Beni, Phys. Rev. B 15 (1976), 2862-2883 \nT Darrah Thomas, Phys. Rev. Letters 52 (1984) 417-420 \nJ J Rehr, E A Stem, R L Martin & E A Davidson, Phys. Rev. B17(1978), \n560-565 \nM Roy & S J Gurman, J. Ph~'s. IV France Colloque C2 151 -152 \nT A Tyson, PhD Thesis, Stanford University (1991) \n(Received 10 August 1998; accepted 9 December 1998) \n"}