{"doi":"10.1111\/j.1471-4159.2008.05528.x","coreId":"8238","oai":"oai:eprints.brighton.ac.uk:5692","identifiers":["oai:eprints.brighton.ac.uk:5692","10.1111\/j.1471-4159.2008.05528.x"],"title":"Synapse-specific changes in serotonin signalling contribute to age-related changes in the feeding behaviour of the pond snail, Lymnaea","authors":["Yeoman, Mark","Patel, Bhavik","Arundell, M.","Parker, K.","O'Hare, D."],"enrichments":{"references":[{"id":946243,"title":"Changes in chemosensory processing contributes to aging in the snail feeding system.","authors":[],"date":"2005","doi":"10.1016\/j.neurobiolaging.2005.09.040","raw":null,"cites":null},{"id":946902,"title":"Aging and oral motor function: evidence for altered performance amoung older persons.","authors":[],"date":"1983","doi":"10.1177\/00220345830620010401","raw":null,"cites":null},{"id":947592,"title":"Snail feeding oscillator: the central pattern generator and its control by modulatory interneurones. In: Neuronal and Cellular Oscillators. Edited by JW Jacklet,","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":948393,"title":"Prevalence of Parkinsonian signs and associated mortality in a community of older people.","authors":[],"date":"1996","doi":"10.1056\/nejm199601113340202","raw":null,"cites":null},{"id":948994,"title":"Glutamatergic N2v cells are central pattern generator interneurones of the Lymnaea feeding system: new model for rhythm generation.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":949673,"title":"Glutamate is the transmitter for N2v retraction phase interneurons of the Lymnaea feeding system.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":949718,"title":"Voltage-dependent actions of endogenous and exogenous serotonin on identified neurones.","authors":[],"date":"1982","doi":"10.1016\/0306-4492(82)90094-6","raw":null,"cites":null},{"id":950458,"title":"Aging regulates 5-HT(1B) receptors and serotonin reuptake sites in the SCN. Brain Res.","authors":[],"date":"2000","doi":"10.1016\/s0006-8993(99)02397-5","raw":null,"cites":null},{"id":951199,"title":"Cholinergic interneurones in the feeding system of the pond snail, Lymnaea stagnalis. II. N1 interneurones make cholinergic synapses with feeding motoneurons.","authors":[],"date":"1992","doi":"10.1098\/rstb.1992.0054","raw":null,"cites":null},{"id":951888,"title":"Comparative neuroethology of feeding control in molluscs.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":952682,"title":"Functional oral motor skills: do they change with age?","authors":[],"date":"1998","doi":"10.1007\/pl00009571","raw":null,"cites":null},{"id":953313,"title":"Ionic mechanisms and receptor properties underlying the responses of molluscan neurones to 5-hydroxytryptamine.","authors":[],"date":"1974","doi":"10.1113\/jphysiol.1974.sp010761","raw":null,"cites":null},{"id":954032,"title":"The effect of food intake on the central monoaminergic system in the snail, Lymnaea stagnalis.","authors":[],"date":"2004","doi":"10.1556\/abiol.55.2004.1-4.23","raw":null,"cites":null},{"id":954705,"title":"Effects of age, gender, bolus volume, and trial on swallowing apnea duration and swallow\/respiratory phase relationships of normal adults.","authors":[],"date":"2001","doi":"10.1007\/s004550011001","raw":"Hiss, S.G., Treole, K. and Stuart, A., 2001. Effects of age, gender, bolus volume, and trial on swallowing apnea duration and swallow\/respiratory phase relationships of normal adults. Dysphagia 16, 128-135.","cites":null},{"id":955340,"title":"Neuromodulation of vertebrate motor neuron membrane properties.","authors":[],"date":"1992","doi":"10.1016\/0959-4388(92)90132-5","raw":"Hultborne H. and Kiehn O., 1992. Neuromodulation of vertebrate motor neuron membrane properties. Curr Opin Neurobiol. 2(6), 770-775.","cites":null},{"id":955971,"title":"Age-related decline in physical activity: generalisation to non-humans.","authors":[],"date":"2000","doi":null,"raw":"Ingram, D.K., 2000. Age-related decline in physical activity: generalisation to non-humans.","cites":null},{"id":956618,"title":"Sports Exerc.","authors":[],"date":null,"doi":"10.1016\/j.spinee.2013.03.037","raw":"Med. Sci. Sports Exerc. 32(9), 1623-1629.","cites":null},{"id":957316,"title":"Age-related changes in female reproductive activity and growth in the mollusc Lymnaea stagnalis.","authors":[],"date":"1989","doi":"10.1093\/geronj\/44.6.b148","raw":null,"cites":null},{"id":958024,"title":"Effects of aging on serotonin transporter availability and its response to fluvoxamine in the living brain: PET study with.","authors":[],"date":"2001","doi":"10.1002\/syn.1039","raw":null,"cites":null},{"id":958747,"title":"A comparison of four techniques for mapping the distribution of serotonin and serotonin-containing neurons in fixed and living ganglia of the snail,","authors":[],"date":"1989","doi":"10.1007\/bf01206662","raw":null,"cites":null},{"id":959422,"title":"Chemical and tactile inputs to the Lymnaea feeding system: effects on behaviour and neural circuitry.","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":960094,"title":"Aging, estradiol and time of day differentially affect serotonin transporter binding in the central nervous system of female rats.","authors":[],"date":"2003","doi":"10.1016\/s0006-8993(03)03441-3","raw":null,"cites":null},{"id":960835,"title":"Regulation of serotonin transporter gene expression in human glial cells by growth factors.","authors":[],"date":"2001","doi":"10.1016\/s0014-2999(01)00906-2","raw":null,"cites":null},{"id":961479,"title":"Aging-related changes in skeletal muscles: mechanisms and interventions.","authors":[],"date":"2000","doi":"10.2165\/00002512-200017040-00006","raw":null,"cites":null},{"id":962287,"title":"Ovarian steroid regulation of serotonin reuptake transporter (SERT) binding, distribution, and function in female macaques.","authors":[],"date":"2003","doi":"10.1038\/sj.mp.4001243","raw":null,"cites":null},{"id":962973,"title":"Patterns of activity and axonal projections of the cerebral giant cells of the snail, Lymnaea stagnalis.","authors":[],"date":"1980","doi":null,"raw":null,"cites":null},{"id":963412,"title":"Synaptic relationships of the cerebral giant cells with motoneurones in the feeding system of Lymnaea stagnalis.","authors":[],"date":"1980","doi":"10.1016\/0742-8413(89)90071-6","raw":null,"cites":null},{"id":964150,"title":"Serotonin transporter (SERT) mRNA and binding site densities in male rat brain affected by sex steroids. Brain Res.","authors":[],"date":"1999","doi":"10.1016\/s0169-328x(98)00281-2","raw":null,"cites":null},{"id":964803,"title":"Increased expression of serotonin transporter messenger RNA in raphe neurons of the aged rat. Brain Res.","authors":[],"date":"1995","doi":"10.1016\/0169-328x(95)00110-e","raw":null,"cites":null},{"id":964983,"title":"The cerebral giant cells: a neurophysiological correlate of aging in the snail feeding system.","authors":[],"date":"2006","doi":"10.1016\/j.neurobiolaging.2005.09.041","raw":null,"cites":null},{"id":965608,"title":"The role of a modulatory neuron in feeding and satiation in Aplysia: effects of lesioning of the serotonergic metacerebral.","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":966784,"title":"Role of neurotrophins in cholinergic-neurone function in the adult and aged CNS.","authors":[],"date":"1994","doi":"10.1016\/0166-2236(94)90138-4","raw":null,"cites":null},{"id":967462,"title":"Aged Fischer 344 rats exhibit altered orolingual motor function: relationships with nigrostriatal neurochemical measures.","authors":[],"date":"2003","doi":"10.1016\/S0197-4580(02)00083-0","raw":null,"cites":null},{"id":968893,"title":"Neurophysiological correlates of unconditioned and conditioned feeding behaviour in the pond snail, Lymnaea stagnalis.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":970466,"title":"Extrinsic modulation and motor pattern generation in a feeding network: a cellular study.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":971950,"title":"Egg laying in the hermaphrodite pond snail Lymnaea stagnalis.","authors":[],"date":"1992","doi":"10.1016\/S0003-3472(85)80022-1","raw":null,"cites":null},{"id":972027,"title":"Postsynaptic actions of serotonergic cerebral giant-cells on buccal motoneurones in the snail Lymnaea stagnalis.","authors":[],"date":"1989","doi":"10.1016\/0742-8413(89)90071-6","raw":null,"cites":null},{"id":972748,"title":"Age-related decline in central serotonin transporter availability with [(123)I] beta-CIT SPECT.","authors":[],"date":"2000","doi":"10.1016\/S0197-4580(00)00152-4","raw":null,"cites":null},{"id":973436,"title":"A cholinergic modulatory interneuron in the feeding system of the pond snail, Lymnaea stagnalis.","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":974157,"title":"Central pattern generating interneurons are targets for the modulatory cerebral giant cells in the feeding system of Lymnaea.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":974703,"title":"Modulatory role for the serotonergic cerebral giant cells in the feeding system of the snail, Lymnaea. II Photoinactivation.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":975396,"title":"Modulatory role for the serotonergic cerebral giant cells in the feeding system of the snail Lymnaea. I. Fine wire recording in the intact animal and pharmacology.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-06-28","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Wiley-Blackwell","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.brighton.ac.uk:5692<\/identifier><datestamp>\n      2015-04-01T11:00:45Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D43303030<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.brighton.ac.uk\/5692\/<\/dc:relation><dc:title>\n        Synapse-specific changes in serotonin signalling contribute to age-related changes in the feeding behaviour of the pond snail, Lymnaea<\/dc:title><dc:creator>\n        Yeoman, Mark<\/dc:creator><dc:creator>\n        Patel, Bhavik<\/dc:creator><dc:creator>\n        Arundell, M.<\/dc:creator><dc:creator>\n        Parker, K.<\/dc:creator><dc:creator>\n        O'Hare, D.<\/dc:creator><dc:subject>\n        C000 Biological and Biomedical Sciences<\/dc:subject><dc:publisher>\n        Wiley-Blackwell<\/dc:publisher><dc:date>\n        2008-06-28<\/dc:date><dc:type>\n        Journal article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        <\/dc:rights><dc:identifier>\n        http:\/\/eprints.brighton.ac.uk\/5692\/1\/J_Neurochem_5_HT_and_feeding.pdf<\/dc:identifier><dc:identifier>\n          Yeoman, Mark, Patel, Bhavik, Arundell, M., Parker, K. and O'Hare, D.  (2008) Synapse-specific changes in serotonin signalling contribute to age-related changes in the feeding behaviour of the pond snail, Lymnaea  Journal of Neurochemistry, 106 (4).  pp. 1699-1709.  ISSN 0022-3042     <\/dc:identifier><dc:relation>\n        10.1111\/j.1471-4159.2008.05528.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.brighton.ac.uk\/5692\/","10.1111\/j.1471-4159.2008.05528.x"],"year":2008,"topics":["C000 Biological and Biomedical Sciences"],"subject":["Journal article","NonPeerReviewed"],"fullText":"Synapse specific changes in serotonin signalling contribute to age-related \nchanges in the feeding behaviour of the pond snail, Lymnaea. \n \n \n1Yeoman MS,  1,2Patel BA, 1,2Arundell M, 1Dolphin K, 1Johnson E, 1Tynan, A, 2Parker K, \n2O’Hare D. \n \n1 School of Pharmacy and Biomolecular Sciences, Cockcroft Building, University of \nBrighton, Moulsecoomb, Brighton, BN2 4GJ, East Sussex, U.K.  2 Physiological Flow \nStudies Group, School of Bioengineering, Imperial College, London,  \nAddress for Correspondence: Dr. M.S. Yeoman \n    School of Pharmacy and Biomolecular Sciences \nCockcroft Building, University of Brighton \nBrighton, BN2 4GJ \nEast Sussex, United Kingdom. \nTel: 44 (0) 1273 642078 \nFax: 44 (0) 1273 679333 \nE-mail: m.s.yeoman@brighton.ac.uk \n \nAbbreviations: \n5-HT, 5, hydroxytryptamine or serotonin \n5-HIAA, 5, hydroxyindole acetic acid \nMAO, monoamine oxidase \nSERT, serotonin transporter \nCGCs, Cerebral Giant cells\n 2\nAbstract \nThis study utilised the feeding system of the pond snail, Lymnaea to examine the \ncontribution that alterations in serotonergic signalling make to age-related changes in motor \nfunction.  Behavioural experiments demonstrated that age-related decreases frequency of \nfeeding movements were due to a specific increases in the duration of the inter-bite interval \n(swallow phase), with no change in the bite duration (protraction\/rasp phases) of each feeding \ncycle. The modulatory Cerebral Giant cells (CGCs) provide the sole serotonergic input to \nfeeding neurones in the buccal ganglia of the CNS and are important in allowing the feeding \nsystem to respond to a food stimulus.  HPLC analysis of the buccal ganglia, demonstrated an \nage-related decrease in 5-HIAA levels that was positively correlated with the feeding \nfrequency and negatively correlated with the duration of the inter-bite interval.  A \ncombination of electrophysiology and antibody labelling experiments were used to examine \nwhether the decrease in 5-HIAA was due to a decrease in 5-HT re-uptake. Antibody labelling \nexperiments demonstrated a qualitative decrease in the levels of the serotonin transporter \n(SERT) in the buccal ganglia of 11-12 month snails compared to either the 3-4 month or 6-7 \nmonth group.  Analysis of the monosynaptic connection between the CGC and B1 \n(protraction phase) motoneurone demonstrated that while fluoxetine (10-100 nM) was capable \nof increasing the amplitude of the CGC-evoked B1 EPSP in both the young and middle aged \ngroup it had no significant effect in the old group. Both lines of evidence suggest a functional \nattenuation of SERT in the old age group. \nAge-related changes in the postsynaptic actions of 5-HT were examined using two key \nmotoneurones that are monosynaptically excited by the CGCs.  Application of 5-HT to B1 \n(protraction phase) motoneurones caused a concentration dependent increase in the amplitude \nof the evoked depolarisation, which was significantly greater in the old neurones compared to \nboth young or middle aged.  Conversely, the amplitude of the 5-HT-induced depolarisation in \n 3\nthe B4 (swallow phase) motoneurone, and the ability of 5-HT to induce conditional bursting \nin B4 cells were attenuated in the old neurones.  The ability of the CGCs and its main \ntransmitter 5-HT to depolarise key feeding motoneurones and also to induce conditional \nbursting in the B4 motoneurone are both necessary to allow their appropriate activation \nduring feeding.  We have previously shown that the CGCs firing rate is decreased with \nincreasing age.  The observed changes in sensitivity to 5-HT and the decreases in SERT \nactivity would act to strengthen the CGC→B1 connection and compensate for the decreases \nin the spontaneous CGC firing allowing the function of this protraction phase motoneurone to \nbe maintained.  However, changes in the sensitivity of B4 cells to 5-HT would weaken the \nCGC→B4 synapse and attenuate the functioning of the swallow phase motoneurone and \nwould slow the feeding rhythm. \nApplication of the selective serotonin re-uptake inhibitor, fluoxetine (0.1 nmoles – 3 \nnmoles) to freely moving young animals was capable of mimicking the effects of age by \nsignificantly reducing the frequency of feeding and increasing the duration of the inter-bite \ninterval. \nIn summary these data show that a functional attenuation of SERT and differential \nchanges in sensitivity of key feeding motoneurones to 5-HT contribute to the age-related \nchanges in feeding behaviour. \n \n  \n \nRunning Title:  Serotonergic signalling and feeding in ageing Lymnaea. \nKey words:  Serotonin transporter, feeding, neuronal ageing, Lymnaea. \n 4\n1. Introduction \n In a wide variety of animals ageing is associated with a marked reduction in both the \nquantity and quality of motor activity (Peng et al. 1980; Bennett et al. 1996; Ingram 2000 and \nLarsson and Ramamurthy 2000).  Specifically, deficits can be seen in rhythmic motor \nbehaviours such as locomotion (Bennett et al 1996), ventilation (Hiss et al. 2001) and feeding \nmovements (e.g. Baum and Bodner 1983; Fucile et al. 1998; Stanford et al., 2003; Arundell et \nal 2006). However, in many cases the precise neurophysiological correlates underlying these \nchanges are so far unknown.  Recently, it has been shown in the pond snail, Lymnaea that \nageing is associated with a decrease in the frequency of rhythmic feeding movements, due \nmainly to a prolongation of the swallow phase of each feeding cycle (Arundell et al 2006).  \nFeeding in the pond snail consists of a series of rhythmic feeding cycles.  Each cycle consists \nof three active phases known as protraction, rasp and swallow.  In protraction the mouth is \nopened and the radula is forced out of the mouth.  During rasp the radula is rotated forwards \nand scraped along the substrate to collect food.  Finally, during the swallow phase, the radula \nis rotated backwards and the food forced into the oesophagus (for review see Benjamin and \nElliott 1989; Elliott and Susswein 2002).  This basic rhythm is driven by a central pattern-\ngenerating circuit (CPG) located in a region of the CNS known as the buccal ganglia (see Fig. \n1).  The CPG comprises of three populations of interneurones termed N1, N2 and N3.  The \nN1 interneurones fire during the protraction phase, N2 during rasp and the N3 neurones \nduring the swallow phase.  Through their connections with the motoneurones the \ninterneurones ensure the coordinated contraction of the buccal muscles that are responsible \nfor producing the three active phases of feeding.  In addition to understanding a great deal \nabout the connectivity of the feeding circuitry, the neurotransmitters utilised by some of these \nneurones are also known.  The N1 interneurones utilise acetylcholine as their main \n 5\nneurontransmitter (Elliott and Kemenes 1992; Yeoman et al 1993) while the N2 neurones are \nglutamatergic (Brierley et al. 1997a, b). \nThis basic rhythm can be fine tuned by a variety of modulatory neurons (Hernadi et al. \n2004; Kyriakides and McCrohan 1989; Yeoman et al. 1994a, b, 1996) that are distinct from \nthe CPG.  The paired serotonergic cerebral giant cells (CGCs) are a specific type of \nmodulatory neurone, located in the cerebral ganglion of the CNS (see Fig. 1).  The CGCs \nsend their axons down the cerebro-buccal connective to the buccal ganglia, providing the sole \nserotonergic imput to the feeding circuitry (Kemenes et al. 1989).  Previous studies have \nshown that they have both a gating and a frequency control function, allowing the feeding \nsystem to both respond to a food stimulus as well as being able to regulate the frequency of \nfeeding movements (Yeoman et al. 1994a,b, 1996).  Specifically, in vivo recordings of the \nCGCs activity showed that a minimum level of firing (6 spikes min-1) was necessary to allow \nthe animals to respond to a feeding stimulus (gating function), while increases in CGC firing \nrates between 6-15 spikes min-1 were capable of increasing the frequency of feeding \nmovements (Yeoman et al. 1994b).  The CGCs have their actions via alterations in the \nexcitability and endogenous properties of the N1, N2 and N3 interneurones (Yeoman et al. \n1996) and also through their ability to regulate the excitability and endogenous properties of \nkey motoneurones (B1; protraction and B4; swallow) with which they make monosynaptic \nconnections (McCrohan et al 1980a,b; Straub and Benjamin 2001).  The ability of serotonin to \nregulate motor function is not limited to Lymnaea but has been demonstrated in other \nmolluscs (e.g. Rosen et al. 1989) and in mammals (Hultborne and Kiehn, 1992).  The fact that \nthese CPGs play important roles in generating fundamental life sustaining behaviours (e.g. \nfeeding and ventilation) suggests that their ability to generate a basic rhythm is unlikely to be \naltered dramatically during the ageing process.  However, the decreases observed in quantity \nand quality of rhythmic motor activity may represent changes in the functioning of \n 6\nmodulatory neurons that act to shape this basic rhythm.  In support of this hypothesis we have \nrecently shown that with increasing age there are marked decreases in the spontaneous firing \nrate and the excitability of the CGCs (Patel et al 2006), which could underlie the observed \nchanges in feeding behaviour seen with increasing age.  As the CGCs form the sole \nserotonergic input to the feeding circuitry in the buccal ganglia, this simple system allows a \nunique opportunity to examine the effects of age on serotonergic signalling and feeding \nbehaviour. \n \nThis paper utilises biochemical, pharmacological and electrophysiological techniques \nto detail age-related molecular changes in the ability of the serotonergic CGCs to signal to \nkey target motoneurones.  The paper demonstrates a functional attenuation in the serotonin \ntransporter and changes in the sensitivity of key protraction (B1) and swallow (B4) phase \nmotoneurones to exogenously applied 5-HT as the animal’s age.  These changes strengthen \nthe CGC→B1 synapse, but attenuate the CGC→B4 synapse.  The potential contributions \nthese age-related changes make to feeding behaviour are discussed.\n 7\nMethods \n \nExperimental Animals  \nAll animals were bred in house at the University of Brighton.  Animals were kept in \nlarge tanks at 18-20°C on a 12hr light\/dark cycle in copper-free tap water.  They were fed on \nalternate days with either lettuce or fish food (Tetrapond fish flakes; Tetrapond UK Ltd.).  \nAnimals were kept in groups of up to 600 in large circulating tanks at a stocking density of \napproximately 1 snail per litre. \n \nMeasurement of changes in short-term feeding behaviour \nThe effects of age on short-term feeding were examined using a method previously \ndescribed by Staras et al. (1998).  Briefly, animals were removed from their home tank and \nmaintained in smaller tanks in copper-free tap water for 7 days with free access to lettuce.  12 \nhours before the experiment, the lettuce was removed, and the animals starved overnight prior \nto experimentation.  Animals were tested by placing them in a petri dish filled with 90ml of \ncopper-free tap water.  The time taken for them to emerge from their shells (both tentacles \nvisible) was recorded after which 5 ml of copper-free tap water was pipetted around the lips \nof the animal and feeding movements recorded over the next 2 minutes.  At the end of the 2 \nmin period 5ml of sucrose (final concentration 0.01M) was added to the dish and feeding \nmovements recorded for a further 2 minutes.  0.01 M sucrose was chosen as previous work by \nKemenes et al. (1986) demonstrated that this concentration was capable of evoking feeding \nresponses in 100% of young animals and this stimulus, unlike lettuce was not prone to \nseasonal variations in quality.  The feeding behaviour was recorded using a software package \nproduced by Staras (1998) yielding a typical feeding trace (Fig. 2A).  Several feeding \nparameters could be measured from the trace including the latency to first bite, bite duration, \n 8\ninter-bite interval and the number of sucrose-evoked bites in 2 minutes.  Three age groups \nwere examined, 3-4 month (young), 6-7 month (middle aged) and 11-12 month (old).  The \nchoice of these three age groups has previously been discussed in Arundell et al. 2006.  The \nCNSs from the animals used in this part of the study were then emoved for HPLC analysis \n(see below). \nIn a further series of experiments the effects of different doses of fluoxetine (0.1 \nnmoles- 3 nmoles) on short-term feeding behaviour were examined.  Animals were injected \ninto the haemoceol with either fluoxetine or HEPES-buffered saline 10 minutes prior to the \nmeasurement of short-term feeding (see details above). \n \n HPLC sample preparation \nThe CNS was removed from Lymnaea stagnalis and pinned out in a silicone elastomer \n(Sylgard; Corning, UK) – lined dish, filled with ice-cold 4-(2-hydroxylethyl)piperazine-1-\nethanesulphonic acid (HEPES)-buffered saline (consisting of 10 mM HEPES, 50 mM NaCl, \n1.7 mM KCl, 2 mM MgCl2.6H2O and 4.0 mM CaCl2.2H2O, buffered to pH 7.9).  The CNS \nwas dissected into 2 regions.  These were i) buccal ganglia + lateral and ventral buccal nerves \nand cerebrobuccal connectives (BG); ii) cerebral ganglia (CG; Fig. 1). Each of these tissue \nsamples was homogenised in 200 µl of ice cold 0.1 M perchloric acid (BDH) and centrifuged \nat 20000 g at 4 °C. All samples were run within 20 minutes of preparation, and were stored on \nice prior to analysis. \n \n \nHPLC-EC determination of levels of 5-HT and 5-HIAA \nThe methods used have been described previously by Patel et al. (2005).  Briefly, \nsamples were injected into a LUNA ODS 3 µm 150 × 1.0 mm I.D. analytical column with a \n 9\n4.0 × 2.0 mm I.D. 5 µm guard column (Phenomenex, Macclesfield, UK).  Epilson LC \namperometric detector (Bioanalytical systems, West Lafayette, IN, USA) was used to control \ndetector voltage and record the current.  A 6 mm glassy carbon electrode (Unijet, BAS) \nserved as the working electrode and was used with a Ag|AgCl reference electrode and a \nstainless steel auxiliary block as the counter electrode. The working electrode was set at a \npotential of +750 mV vs. Ag|AgCl reference electrode.  The sensitivity of the detector was \nmaintained at 50 nA full scale deflection.  Control and data collection\/processing were \nhandled through BAS ChromGraphTM software.  The mobile phase, containing 25 mM \nsodium dihydrogenorthophosphate, 27 µM disodium ethylene-diamine-tetra-acetate (EDTA), \n50 mM sodium citrate, 10 mM of diethylamine, 10 mM sodium chloride and 2 mM of decane-\nsulfonic acid sodium salt was made up in deionized, distilled water and buffered to pH 3.2 \nusing concentrated phosphoric acid.  This was then mixed with UV- grade acetonitrile \n(CHROMSOLV® for HLPC, Riedel de Haën) in a ratio of 82.5: 17.5 v\/v and filtered through \na 0.20 µm membrane filter and degassed under vacuum after mixing. \nStandard solutions were prepared from a 100 µg dm-3 stock standard of each analyte \nand were made up in freshly prepared ice-cold 0.1 M perchloric acid (BDH).  Each of the \nstandard solutions was prepared on the day of analysis and stored on ice between injections. \nSpike and recovery data were obtained to account for errors during sample \npreparation. Recovery factors were calculated using standard IUPAC procedures (Patel et al. \n2005).   \n \nWhole mount immunohistochemistry \nLymnaea CNSs were dissected in HEPES-buffered saline, the intact CNS removed \nand the cerebral-cerebral commisure severed in order to pin the preparation flat in a Sylgard-\nlined dish. The preparation was then incubated in 0.5% protease (Sigma, type XIV) in \n 10\nHEPES-buffered saline for 30 minutes at room temperature and subsequently fixed overnight \nin 1% paraformaldehyde\/ 1% acetic acid solution at 4°C. After fixation, the CNSs were \nwashed hourly for 8 hours at 4°C in Supermix containing 50mM Tris ( \nhydroxymethylaminomethane), 150 mM NaCl  and 2% (v\/v) Triton X-100, and then \nincubated overnight at 4°C in an anti-serotonin transporter (SERT) primary antibody (Abcam, \ndeveloped in rabbit) diluted 1 in 600 in Supermix containing 2% Triton X-100. The tissue was \nthen rinsed hourly for 6 hours at 4°C in Supermix without Triton X-100 and then incubated \novernight at 4°C in fluorescein-labelled goat anti-rabbit secondary antibody (Sigma) diluted 1 \nin 50 in Supermix containing Triton X-100. Finally the tissue was rinsed hourly for 4 hours at \n4°C in Supermix without Triton X-100 and then mounted in 1% ethylenediamine\/ 75% \nglycerol and viewed under an inverted microscope (Zeiss, Axiovert 25). Levels of \nfluorescence were compared qualitatively from photomicrographs taken under standard \nexposure conditions. \n \nElectrophysiology \n Previous work had shown that the main age-related changes in feeding behaviour were \ndue to increases the duration of swallow (N3 phase) of the feeding cycle, with occasional, \nbatch specific, changes in the bite duration (N1\/N2 phases; Arundell et al. 2006).  Closer \nexamination of the bite duration showed that changes were specifically due to increases in the \nduration of protraction (N1 phase) with no significant change in rasp (N2 phase).  Therefore \nin a series of experiments the strength of the monosynaptic connection between the CGC and \neither the protraction phase motoneurone (B1) or the swallow phase motoneurone (B4) were \nexamined in the presence and absence of different concentrations of fluoxetine (10 -100 nM; \nSigma Chemical Co., U.K.).  The CNS was dissected in HEPES-buffered saline and pinned in \na Sylgard-lined dish.  The outer connective tissue overlying the cerebral and buccal ganglia \n 11\nwas removed with fine forceps and the inner connective tissue sheath softened with protease \n(Type XIV, Sigma-Aldrich Co. U.K.) to facilitate electrode impalement.  The bath containing \nthe CNS was perfused constantly with HEPES-buffered ringer and drugs (fluoxetine, \nserotonin, Sigma Chemical Co., U.K.) were added to the motoneurone via a local superfusion \npipette.  Intracellular recordings were made from both the CGC and the motoneurone using \nglass micorelectrodes that had resistances ranging from 10-15 MΩ when filled with 4 M \npotassium acetate.  The membrane potential of the motoneurone was held at -70 mV and the \nCGCs spontaneous firing rate maintained at 0.5Hz by constant current injection.  The strength \nof the CGC → B1 and CGC → B4 connections were determined by recording the amplitude \nof the excitatory post-synaptic potentials (EPSPs) that were evoked in the motoneurone \nfollowing spontaneous action potentials in the CGCs.  In experiments designed to examine the \neffects of fluoxetine (10-100 nM) on the strength of the CGC → motoneurone connection, \nfluoxetine was applied locally to the motoneurones for 20 s via the superfusion pipette.   \nIn a separate series of experiments designed to examine the sensitivity of B1 and B4 to \n5-HT, the CNS was first perfused with a high Mg2+\/zero Ca2+ ringer, containing 50 mM NaCl, \n1.7 mM KCl, 6 mM MgCl2.6H2O, 10 mM HEPES, pH 7.9. in order to chemically isolate the \nmotoneurone.  Serotonin was then applied in a concentration range of 10-8 M to 10-4 M for 5 s \nvia the superfusion pipette and the amplitude of the evoked depolarisation was determined in \nboth B1 and B4 cells.  In addition, the ability of 5-HT to induce conditional bursting in the B4 \nmotoneurone was also determined (Straub and Benjamin, 2001).  Mean burst frequency was \ncalculated by averaging the number of bursts evoked during the 1st 100 s after 5-HT \napplication. \n \n 12\nData Analysis \nThe feeding data were analysed as follows.  For emergence, latency to first bite and \nnumber of bites per minute, values were taken for each animal within a particular age group, \nthe mean calculated and compared using a 1-way analysis of variance (ANOVA) followed by \na post-hoc Tukey test (Minitab Vs 13).  Values for the inter-bite interval and bite duration \nwere anlaysed by calculating the mean values of all the bites evoked by sucrose for each \nanimal.  These values were then averaged to yield a group average for the two parameters.  \nThese values were statistically compared using a 1-way ANOVA (see above).  Statistical \ndifferences in the levels of 5-HT and 5-HIAA, with respect to both CNS region and the age of \nthe animal, were compared using a 2-way ANOVA (age x CNS region) followed by a post-\nhoc Tukey test (Excel).  Correlations between changes in the CNS levels of the analytes and \nalterations in the feeding parameters were determined using a standard regression (Excel).  A \ntwo-way analysis of variance was also used to examine the effects of either fluoxetine or \nserotonin (concentration x age) on the amplitude of the postsynaptic potential recorded in the \nB1 and B4 motoneurones.  All values plotted are the mean + SEM, p<0.05 taken as \nsignificant. \n 13\nResults \nAlterations in short-term feeding behaviour \nThe effects of increasing age were examined on short-term sucrose-evoked feeding \nresponses.  A significant decrease in the number of sucrose-evoked bites per minute was seen \nwith increasing age (p<0.001; Fig. 2Bi).  This decrease was associated with an increase in the \nduration of the inter-bite interval (p<0.01; Fig. 2Bii).  There were no significant changes in \nthe bite duration (protraction\/rasp phases) of each feeding cycle, or any other feeding \nparameter examined. \n \nChanges in CNS serotonergic systems \nA 2-way ANOVA of the combined 5-HT data obtained from both the buccal and \ncerebral ganglia showed a clear age effect (F(2, 65) = 6.26; p<0.01) with the 6-7 month group \nhaving higher 5-HT levels than either the 3-4 month (p<0.05) or 11-12 month group (p<0.01).  \nAlthough the increase in 5-HT was apparent in both the buccal and cerebral ganglia samples \nanalysis of changes in either one of the ganglia using a post-hoc Tukey test failed to reach \nsignificance (Fig. 3A). \n Age-related changes in the levels of 5HIAA showed consistent decreases with \nincreasing age across both CNS regions examined (F(2, 65) = 32.34, p<0.001).  In the BG levels \nof 5HIAA in the 3-4 month group were significantly higher than the 6-7 month group \n(p<0.001) and the 11-12 month group (p<0.001), although there was no significant difference \nbetween the 6-7 and 11-12 month groups (Fig. 3B).  Values for the cerebral ganglia showed \nsimilar changes to those seen in the BG (Fig. 3B). \n Examination of the ratio of 5HIAA:5-HT again showed consistent decreases with \nincreasing age across all CNS regions examined (F(2, 65) = 13.43, p<0.0001).  In the buccal \nganglia the 5HIAA:5-HT ratio was higher in the young group compared to both the middle \n 14\naged (p<0.001) and old groups (p<0.001, Fig 3C).  Although qualitatively similar changes \nwere seen in the cerebral ganglia these changes did not reach significance (p>0.05, Fig. 3C). \n \nCorrelations between age-related changes in the HPLC data and feeding behaviour \n The data from all three age groups was combined and correlational analyses used to \nexamine the relationship between each of the feeding parameters and the levels of 5-HT and \nits metabolite 5-HIAA in both CNS regions examined.  Specifically, the age-related change in \nthe number of sucrose-evoked bites was positively correlated with levels of 5HIAA in the \nbuccal ganglia (p<0.01, Fig 4A) and the cerebral ganglia (p<0.05, Fig 4B).  Analysis of the \ninter-bite interval showed that it was negatively correlated with levels of 5HIAA in the buccal \nganglia (p<0.05, Fig 5). \nCorrelations performed between the biochemical data and corresponding behavioural \ndata within a particular age group were all non-significant. \n \nAge-related changes in SERT labelling \n Analysis of the 3-4 month and 6-7 month old animals showed fluorescent labelling in \nthe buccal ganglia of both age groups.  Labelling could be clearly seen in the neuropile, \nextending across the buccal-buccal commisure and exiting the buccal ganglia via the paired \ndorsal buccal nerves towards the oesophagus.  Fluorescent processes were also seen in the \noesophagus that were particularly evident in the 3-4 month CNSs (Fig 6A), less evident in the \n6-7 month group (Fig. 6B) and appeared to originate from labelled processes in the dorsal \nbuccal nerve.  In the majority of old animals (5 out of 6 preparations) there was no clear \nlabelling in the buccal ganglia or oesophagus (Fig. 6C), although labelling could be seen in \nother areas of the CNS not involved in the regulation of feeding (Fig. 6D). Occasionally (1 \nout of 6 preparations), SERT labelling could be seen in the buccal ganglia of an old animal; \n 15\nalthough this was noticeably fainter than the labelling seen in either the young or middle-aged \ngroups (Fig. 6E).  No labelling was seen in the absence of the primary antibody (Fig. 6F). \n \nAge-related changes in the sensitivity of the CGC → motoneurone connections to \nfluoxetine \nWe have previously shown that amplitude of the CGC evoked EPSP in the B1 \nprotraction phase motoneurone was increased with increasing age (Fig, 6A in Arundell et al. \n2006).  One possible mechanism to increase the amplitude of the evoked EPSP would be to \nreduce removal of the released 5-HT from the CGC→B1 synapse via the serotonin transporter \n(SERT).  In order to test this hypothesis, the amplitude of the evoked EPSPs was examined in \nthe presence and absence of fluoxetine.  Fig. 7Ai shows a CGC evoked EPSP in a 3-4 month \nold, B1 protraction phase motoneurone recorded in normal HEPES-buffered ringer.  \nFollowing the application of 10 nM fluoxetine the amplitude of the EPSP increased (p<0.01; \nFig. 7Aii).  Application of 100 nM fluoxetine failed to further enhance the amplitude of the \nCGC-evoked EPSP (Fig 7Aiii).  Similar results were obtained for the 6-7 month group (data \nnot shown).  For both the 3-4 month and 6-7 month old groups the effects of fluoxetine could \nbe completely reversed by washing for 5 minutes in normal HEPES-buffered saline.  Fig. 6B \nshows the effect of fluoxetine on the amplitude of a CGC-evoked B1 EPSPs in an 11-12 \nmonth old animal.  Addition of either 10nM (Fig. 7Bii) or 100 nM fluoxetine (Fig. 7Biii) \nfailed to significantly enhance the amplitude of the evoked EPSP and in a number of cases \nactually reduced EPSP amplitude, particularly in CNSs perfused with 100 nM fluoxetine.  2-\nway ANOVA showed that the effects of fluoxetine on the change in amplitude of the CGC \nevoked B1 EPSP were age-dependent (F(2,52) =9.42 p< 0.001.).  Post-hoc analysis showed that \nwhile there was no difference in the response of the young and middle aged animals to \nfluoxetine, both these groups were significantly more sensitive to fluoxetine than the old \n 16\ngroup (p<0.001 and p<0.05 respectively), which showed no consistent change in EPSP \namplitude with fluoxetine (Fig 7C).  Attempts to record EPSPs in the B4 motoneurone evoked \nby single CGC action potentials in normal HEPES-buffered ringer were unsuccessful due to \nthe small amplitude of the evoked EPSPs.  Previous work has shown that it is possible to \nvisualise CGC → B4 EPSPs using a combination of a saline high in divalent ions (Hi-Di \nsaline) and hexamethonium to block the resulting large inhibitory cholinergic inputs from \nother pattern generating interneurones (Straub pers. comm.).  However, we have previously \nshown that the effects of Hi-Di saline are age-dependent (Patel et al. 2006) and this \ndifferential effect precluded its use in this study. \n \nAge-related changes in the sensitivity of B1 and B4 to exogenously applied 5-HT \nAn alternative explanation for the observed increase in CGC → B1 EPSP with \nincreasing age would be an increase in the sensitivity of the motoneurone to 5-HT.  In order to \ntest this motoneurones were chemically isolated from other neurones in the intact but isolated \nCNS by bathing the preparation in a high Mg2+\/zero Ca2+ ringers. Successful isolation was \nconfirmed by the disappearance of the classical CPG inputs that are seen in the B1 \n(protraction phase) motoneurone (see arrows Fig 8A).  Application of 5-HT to the B1 neurone \ncaused a concentration dependent increase in the amplitude of the evoked depolarisation in \nboth the 3-4 month (Fig. 8B) and 11-12 month old (Fig. 8C) groups (F(2,80) =21.75; p<0.001; \nFig. 8B\/C).  Two-way analysis of variance showed that while both the 3-4 month and 6-7 \nmonth old neurones responded similarly to 5-HT the 11-12 month old neurones responded \nmore strongly to a given concentration of 5-HT (F(2,84) =3.75; p<0.05; Fig. 8B\/C\/D). This \nstronger depolarisation caused the old motoneurones to fire action potentials following the \napplication of all three concentrations of 5-HT, while the young motoneurones only fired \naction potentials at the highest concentration of 5-HT. \n 17\nIntracellular recordings from the B4 (swallow phase) motoneurone in normal HEPES-\nbuffered ringer typically resulted in regular bursts of activity that occur following a series of \ncharacteristic inhibitory inputs from both the N1 and N2 interneurones (Fig. 9Ai).  Following \nperfusion with a high Mg2+\/zero Ca2+ ringer, bursting became irregular and there was a \ncomplete loss of N1 and N2 inhibitory inputs (Fig. 9Aii).  The spontaneous depolarisations \nand consequential burst of action potentials recorded in the B4 motoneurone are an \nendogenous property of these neurones that is activated by 5-HT and has previously been \ndescribed by Straub and Benjamin (2001).  Continued perfusion with high Mg2+\/zero Ca2+ \nringers caused the motoneurones to become silent.  Application of 5-HT to the B4 \nmotoneurone caused a concentration-dependent increase in the amplitude of the evoked \ndepolarisation in both the 3-4 month (Fig. 9B) and 11-12 month (Fig. 9C) groups (F(2,88) = \n32.19; p<0.001; Fig 9B\/C). This depolarisation far out-lasted the duration of application of 5-\nHT (Fig. 9B\/C).  Unlike the B1 motoneurone, there was a clear decrease in the ability of the \nB4 motoneurone to respond to 5-HT with increasing age (F(2,80) =7.44; p<0.01; Fig. 9B\/C\/D).  \nPost-hoc analysis showed there to be no difference between the responsiveness of the young \nand middle aged groups to applied 5-HT but a both groups responded significantly better to 5-\nHT than the old group (p<0.001 and p<0.05 respectively).  The 5-HT-induced depolarisation \nwas also accompanied by conditional bursting in the B4 motoneurones (Fig. 10A\/B).  The \nbursting again far outlasted the duration of application of 5-HT typically lasting for periods in \nexcess of 100s, for a 5 s application of 5-HT.  With increasing age the bursting frequency in \nresponse to a 5 s application of 10-6M 5-HT decreased significantly (compare Figs. 10Aii and \nBii and see Fig. 10C).  A post-hoc Tukey test showed that bursting in the young age group \nwas significantly different from the old but did not differ significantly from the middle aged \ncells (Fig. 10D).  This differential effect could be negated by perfusing the B4 cells with 10-4 \nM 5-HT (data not shown). \n 18\n \nEffects of fluoxetine on feeding behaviour \n   Although we have recorded post-synaptic changes in 5-HT sensitivity for two key \nmotoneurones in the feeding system of Lymnaea, trying to mimic these changes in the intact \nanimal was not possible.  We therefore decided to test whether changes in SERT could \naccount for the observed changes in feeding behaviour seen in aged Lymnaea.  To test this \nhypothesis 3-4 month old animals were injected with fluoxetine, a 5-HT transporter \nantagonist to see if it was possible to mimic the age-related changes in feeding behaviour. \nThese data were also compared with the effects of fluoxetine on the feeding behaviour of 11-\n12 month old animals.  Using a 2-way ANOVA injection of animals with increasing doses of \nfluoxetine caused a significant dose-dependent decrease in the number of sucrose-evoked \nbites (F(4,53) =25.9; p<0.001; Fig 11A) and an increase in the duration of the inter-bite interval \n(F(4,53) = 5.61; p<0.05; Fig 11B).  These changes were seen consistently in both the young and \nold groups of animals although the ability of the fluoxetine to decrease feeding rate and the \nincrease in the duration of the inter-bite interval were much greater in the 3-4 month group \nthan the 11-12 month group (F (4,53) = 7.7 ; p<0.01 and F(4,53) =2.68; p< 0.05 respectively; Fig \n11A\/B). Interestingly, at the highest dose of fluoxetine there was no significant difference \nbetween the feeding behaviour of the 3-4 month and 11-12 month old group (Fig 11A\/B).\n 19\nDiscussion \nThe aim of the current study was to examine whether changes in 5-HT signalling \ncould explain the age-related changes in feeding behaviour in the pond snail, Lymnaea.   \n \nAge-related changes in feeding behaviour and its relationship to serotonin metabolism.  \nThe behavioural data presented in this paper confirms previous work that \ndemonstrated age-related decreases in the number of sucrose-evoked bites and increases in the \nduration of the inter-bite interval (Arundell et al 2006).  \nNeurones within the buccal and cerebral ganglia have previously been shown to be \nintimately involved with the regulation of feeding behaviour (for reviews see Benjamin and \nElliott, 1989; Elliott and Suswein 2002). In particular the CGCs provide the sole serotonergic \ninput to the buccal ganglia meaning that any changes observed in serotonergic metabolism in \nthese ganglia are due to alterations in the properties of the paired CGCs (Kemenes et al. \n1989).  In both the BG and CG increasing age was associated with a decrease in the \n5HIAA:5-HT ratio that could be explained by a significant decrease in 5-HIAA levels over \nthe same time course.  5-HT is primarily metabolised to 5-HIAA by the enzyme monoamine \noxidase A (MAO-A) following its re-uptake into the nerve terminal after vesicular release.  \nAlterations in serotonin re-uptake via SERT could regulate 5-HT metabolism. Two \napproaches were taken to test the possibility that SERT was impaired in old animals.  The \nfirst used immunohistochemical techniques to label the SERT protein in the buccal ganglia of \nthe CNS.  Clear labelling was seen in the 3-4 and 6-7 month old animals but was absent in the \nmajority of 11-12 month old animals indicating a reduction in the levels of SERT with \nincreasing age.  However, using this method alone it was impossible to ascertain whether the \nobserved reduction in labelling was functionally significant.  To test this we examined the \namplitude of the evoked CGC→B1 EPSP in the presence of differing concentrations of \n 20\nfluoxetine a SERT inhibitor.  In the young and middle aged animals fluoxetine was capable of \nincreasing the amplitude of the evoked EPSP inferring the presence of functional SERT \nproteins.  However, in the old animals, fluoxetine failed to significantly alter the amplitude of \nthe EPSP suggesting a lack of functional proteins.  Previous work by Patel et al. (2006) \ndemonstrated an age related increase in the amplitude of the CGC→B1 connection.  The \ndecreases in SERT function detailed in this study would increase synaptic 5-HT and could \ncontribute to the observed increase in CGC-evoked EPSP. \nIn humans, binding studies have demonstrated a decrease in SERT levels with \nincreasing age (van Dyck et al. 2000; Kakiuchi et al. 2001), inferring an age-related \nimpairment of re-uptake.  However, we believe this current study is the first to describe an \nage-related functional decrease in SERT activity. Surprisingly, in rats increasing age appears \nto be associated with an increase in SERT (Meister et al.1995; Duncan et al. 2000; Krajnak, \n2003), indicating that the regulation of SERT expression with increasing age may differ \nbetween species. \nDecreases in 5-HIAA may also represent decreases in the release of 5-HT.  Patel et al \n(2006) previously demonstrated an age-related decrease in the firing rate of the paired CGCs.  \nThis decrease in firing would reduce 5-HT release, the availability of 5-HT for re-uptake and \ntherefore metabolism and could explain the age-related decrease in the 5-HIAA\/5-HT ratio in \nthese ganglia.  Changes in the levels of 5HIAA in the BG were positively correlated with the \nnumber of sucrose-evoked bites per minute and negatively correlated with the duration of the \ninter-bite interval suggesting a link between CGC firing rate, 5-HT release and feeding \nbehaviour.  Previous work by Yeoman et al. (1994a, b) showed that increases in CGC firing \nrates above 6 spikes min-1 can regulate the frequency of fictive feeding movements recorded \nin the isolated CNS preparation and that CGC firing rate was proportional to the frequency of \nfeeding movements in the intact animal.  This change in CGC firing rate may therefore \n 21\nprovide an explanation for the age-related changes in the frequency of feeding movements.  \nThe fact that cerebral ganglia levels of 5-HIAA were also correlated with the same two \nfeeding parameters may reflect the release of 5-HT from processes of the CGCs which remain \nwithin the cerebral ganglia or it maybe reflective of the activity of other serotonergic neurons \nwhose cell bodies and processes also lie within this pair of ganglia, but whose function is \nunknown (Kemenes et al. 1989).  . \nThe observed reductions in re-uptake would help to compensate for the observed age-\nrelated decreases in CGC firing rate and may help to preserve the functioning of the \nCGC→B1 synapse.  However, the CGCs have the ability to alter the excitability of a wide \nrange of motoneurones that are active in all three phases of the feeding rhythm (McCrohan \nand Benjamin 1980b) and also have effects on the endogenous properties and excitability of \nthe N1, N2 and N3 CPG interneurones.  Why therefore, does this study only show significant \nchanges in the duration of the inter-bite interval (N3 phase) and not the bite duration (N1, \nprotraction\/ N2, rasp phases)? \n \nChanges in the postsynaptic 5-HT sensitivity can explain age-related changes in specific \nphases of the feeding rhythm \nWhile a decrease in SERT activity could explain the observed age-related increase in \nthe amplitude of the CGC-evoked EPSP in the B1, protraction phase motoneurone, it was \npossible that the motoneurone’s sensitivity to exogenously applied 5-HT may also increase \nwith increasing age.  Indeed, while application of 5-HT caused a concentration dependent \nincrease in the amplitude of the B1 depolarisation, this increase was age-dependent with older \nanimals being more sensitive to the applied 5-HT than the young or middle-aged groups.  \nThus despite an age-related decrease in the firing rate of the CGCs (Patel et al. 2006), which \nwould act to decrease 5-HT signalling at this synapse, the CGC→B1 connection  attempts to \n 22\ncompensate by decreasing re-uptake and increasing the sensitivity of the B1 motoneurone to \n5-HT.  These compensatory changes presumably contribute to the lack of a change in the bite \nduration observed in the behavioural experiments in this group of animals.  \nWhile this study was unable to examine the function of the SERT protein at the \nCGC→B4 connection it did record a marked age-related decrease in the sensitivity of the B4 \nmotoneurone to exogenously applied 5-HT.  This would decrease the ability of the CGC to \ndepolarise B4, reduce B4 firing frequency and cause an increase the duration of the inter-bite \ninterval.  In addition to the attenuation in 5-HT-induced depolarisation, there was also an age-\nrelated decrease in the frequency of 5-HT-induced bursting in B4 cells.  Previous work has \nshown that the ability of 5-HT to cause a prolonged depolarisation and also to induce \nconditional bursting in the B4 motoneurones are a necessary requirement for these neurones \nto be activated during a feeding rhythm (Straub and Benjamin 2001).  These data are therefore \nconsistent with an attenuation of the CGC→B4 synapse and an increase in the inter-bite \ninterval and a consequential slowing of the feeding rhythm.  The observation that there were \nno significant age effects in either 5-HT-induced depolarisation or conditional bursting in B4 \ncells perfused with the highest concentration of 5-HT (10-4 M), suggests that the mechanisms \ninvolved in regulating these processes are still intact but down-regulated in the old animals. \n \nCan a down-regulation of SERT explain age-related changes in feeding behaviour? \nIn order to examine whether an inhibition of SERT function could explain the age-\nrelated changes in feeding behaviour, animals were injected with increasing doses of \nfluoxetine and the effects on feeding behaviour examined.  Application of fluoxetine to intact \n3-4 month old animals caused a concentration-dependent decrease in the feeding frequency \nand an increase in the duration of the inter-bite interval, data that were consistent with \nchanges observed during ageing.  While these data are suggestive that inhibition of SERT \n 23\ncontributes strongly to the changes in feeding behaviour observed during ageing in Lymnaea, \nit is important to realise that in young animals the inhibition of SERT function is occurring in \nthe presence of relatively fast CGC firing rates that would not be seen in the old animals \n(Patel et al. 2006).  This makes the data difficult to interpret, but at the very least suggests that \ndisruptions in 5-HT signalling can reduce feeding behaviour.  Fluoxetine was also capable of \ndecreasing feeding response in the 11-12 month old animals albeit to a lesser extent than the \n3-4 month old animals.  This reduction is interesting because it appears to contradict the \neffects of fluoxetine on the CGC→B1 synapses and suggests that functional SERT proteins \nare present in old animals and can influence feeding.  However, antibody labelling \nexperiments in this study were limited toan examination of the CNS and did not examine \nputative changes in the expression of SERT on serotonergic terminals in the buccal muscles \nthat drive feeding.  At the highest concentrations there were no significant differences in the \nbehaviour of the young or old animals suggesting this dose was capable of blocking all \nfunctional SERT proteins. \n While a down-regulation of SERT may contribute strongly to the differences in \nfeeding behaviour between young and old animals, the electrophysiological data suggest that \nthese changes occur sometime between 7-11 months and therefore can not explain the \nreduction in 5HIAA:5-HT ratio and the reduction in feeding frequency seen in the 6-7 month \ncompared to the 3-4 month group.  It is possible therefore, that these changes are due to \nreductions in the CGC firing frequency seen in this age group (Arundell et al. 2006) or maybe \ndue to temporal differences in SERT function at synapses distinct from those examined in this \nstudy.  \n \n 24\nWhat are the possible causes of the changes in serotonergic signalling? \nWhile very little is known about the molecular mechanisms by which 5-HT excites \nboth the B1 and B4 motoneurones there are clear published differences in both the kinetics of \nthese responses and their pharmacology.  Specifically, the latency of the CGC→B1 \nconnection is much shorter than the CGC→B4 connection, despite both neurones receiving \nmonosynaptic connections from the CGCs (McCrohan and Benjamin, 1980).  In Helix these \nslower responses, recorded in homologous neurones, have been shown to be due to the \nclosing of a K+ channel (Cottrell 1982), while the faster responses presumably represent either \nopening of Na+ or Ca2+ channels (Gershenfeld and Paupardin-Tritsch, 1974).  Additionally, an \nexamination of the pharmacology of the CGC-motoneurone synapses showed the B1 synapse \nto be sensitive to d-tubocurarine, while the B4 synapse was insensitive (Tuersley and \nMcCrohan 1989). A fuller understanding of these differences may help explain the \ndifferential sensitivity of the CGC→B1 and CGC→B4 synapses to the effects of increasing \nage.  \nRegulation of SERT expression in the membrane has been fairly well studied.  SERT \nlevels have been shown to be down-regulated by activation of PKC (Qian et al. 1997), a loss \nof basic fibroblast growth factor (Kubota et al. 2001) and by a loss of oestrogen (McQueen et \nal. 1999; Lu et al., 2003, Krajnak et al. 2003).  Lymnaea are hermaphrodites and although \negg-laying behaviour has been studied in great detail in Lymnaea (ter Maat, 1992), to date \nthere is no known role for oestrogen in this process.  However the timing of the down-\nregulation in SERT (7-11 months) is consistent with an onset of menopause in these animals \nwhich has been shown to occur from 8 months of age (Janse et al.1989).  In addition, changes \nin Ca2+ homeostasis (eg. Verkhratsky and Toescu, 1998) and a loss of responsiveness to \ngrowth factors (e.g. Rylett and Williams, 1994) have been suggested as possible explanations \nfor changes in the ageing CNS and these possibilities are currently being investigated.  It is \n 25\ninteresting to note that the loss of SERT-labelling in the buccal ganglia was not accompanied \nby a similar loss in the main ring ganglia (see Fig. 6D).  This is suggestive that regulation of \nSERT in these two regions of the CNS is either under differential control or is differentially \nsensitive to the same regulator.  \n \nSummary \nWe have shown for the first time that changes in 5-HT signalling can account for age-\nrelated changes in the feeding behaviour of the pond snail, Lymnaea.  Specifically, we have \nshown that decreasing levels of 5-HIAA in the BG and CG are well correlated with age-\nrelated decreases in feeding behaviour.  At a neuronal level these behavioural changes involve \ndecreases in CGC firing rates, compensatory decreases in the functioning of SERT and \nselective alterations in the sensitivity of the key feeding motoneurones to 5-HT.  These \nchanges help maintain the function of protraction phase motoneurones and reduce the \nfunction at swallow phase motoneurones and most likely contribute to the effects of age on \nfeeding behaviour.  Interestingly, at the behavioural level the effects of age could be \nmimicked by the application of fluoxetine a SERT inhibitor providing the possibility that all \nthe changes described above are linked to an inhibition of SERT.  \n 26\nAcknowledgements \nWe would like to thank the EPSRC for funding this research and Glaxo-Smith Kline for \ndonating the HPLC system to BAP. \n \n 27\nReferences \n \nArundell, M., Patel, B.A., Straub, V., Allen, M.C., Janse, C., O’Hare, D., Parker, K., Gard, \nP.R. and Yeoman, M.S., 2005.  Changes in chemosensory processing contributes to aging in \nthe snail feeding system.  Neurobiol. Aging 27(12),1880-1891. \n \nBaum, B.J. and Bodner, L, 1983.  Aging and oral motor function: evidence for altered \nperformance amoung older persons.  J. Dent. Res. 62(1), 2-6. \n \nBenjamin, P.R. and Eliott, C.J.H, 1989.  Snail feeding oscillator: the central pattern generator \nand its control by modulatory interneurones.  In: Neuronal and Cellular Oscillators. Edited by \nJW Jacklet, New York: Dekker, p. 173-214. \n \nBennett, D.A., Beckett, L.A., Murray, A.M., Shannon, K.M., Goetz, C. G., Pilgrim, D.M. et \nal., 1996.  Prevalence of Parkinsonian signs and associated mortality in a community of older \npeople.  N. Eng. J. Med. 334, 71-76. \n \nBrierley, M.J., Yeoman, M.S. and Benjamin, P.R., 1997a.  Glutamatergic N2v cells are \ncentral pattern generator interneurones of the Lymnaea feeding system: new model for rhythm \ngeneration. J Neurophysiol 78(6), 3396-3407. \n \nBrierley, M.J., Yeoman, M.S. and Benjamin, P.R., 1997b.  Glutamate is the transmitter for \nN2v retraction phase interneurons of the Lymnaea feeding system. J. Neurophysiol. 78(6), \n3408-3414. \n \n 28\nCottrell, G.A., 1982.  Voltage-dependent actions of endogenous and exogenous serotonin on \nidentified neurones.  Comp. Biochem. Physiol. C 72(2), 271-279. \n \nDuncan M.J., Crafton C.J. and Wheeler D.L., 2000.  Aging regulates 5-HT(1B) receptors and \nserotonin reuptake sites in the SCN.  Brain Res. 856(1-2), 213-9. \n \nElliott, C.J.H. and Kemenes, G, 1992.  Cholinergic interneurones in the feeding system of the \npond snail, Lymnaea stagnalis.  II.  N1 interneurones make cholinergic synapses with feeding \nmotoneurons.  Philos Trans R Soc Lond B Biol Sci 336(1277), 167-180. \n \nElliott, C.J.H. and Susswein A.J., 2002. Comparative neuroethology of feeding control in \nmolluscs.  J.Exp. Biol. 205(7), 877-896. \n \nFucile, S., Wright, P.M., Chan, I., Yee, S., Langlais, M-E, and Gisel, E.G., 1998.  Functional \noral motor skills: do they change with age?  Dysphagia 13, 195-201. \n \nGerschenfeld H.M. and Paupardin-Tritsch D., 1974.  Ionic mechanisms and receptor \nproperties underlying the responses of molluscan neurones to 5-hydroxytryptamine.  J. \nPhysiol. 243(2), 427-56. \n \nHernadi, L., Hiripi, L., Dyakonova, V., Gyori, J., Vehovszky, A., 2004.  The effect of food \nintake on the central monoaminergic system in the snail, Lymnaea stagnalis.  Acta Biol. \nHung. 55(1-4), 185-194. \n \n 29\nHiss, S.G., Treole, K. and Stuart, A., 2001.  Effects of age, gender, bolus volume, and trial on \nswallowing apnea duration and swallow\/respiratory phase relationships of normal adults.  \nDysphagia 16, 128-135. \n \nHultborne H. and Kiehn O., 1992.  Neuromodulation of vertebrate motor neuron membrane \nproperties. Curr Opin Neurobiol. 2(6), 770-775.  \n \nIngram, D.K., 2000.  Age-related decline in physical activity: generalisation to non-humans.  \nMed. Sci. Sports Exerc. 32(9), 1623-1629. \n \nJanse C., Wildering W.C. and Popelier C.M., 1989.  Age-related changes in female \nreproductive activity and growth in the mollusc Lymnaea stagnalis.  J. Gerontol. 44(6), B148-\n55. \n \nKakiuchi, T., Tsukada, H., Kukumoto, D. and Nishiyama, S., 2001.  Effects of aging on \nserotonin transporter availability and its response to fluvoxamine in the living brain: PET \nstudy with.  Synapse 40(3), 170-179. \n \nKemenes G., Elekes, K., Hiripi, L. and Benjamin P.R. 1989.  A comparison of four \ntechniques for mapping the distribution of serotonin and serotonin-containing neurons in \nfixed and living ganglia of the snail, Lymnaea.  J. Neurocytol. 18(2), 193-208. \n \nKemenes, G., Elliott, C.J.H. and Benjamin, P.R., 1986.  Chemical and tactile inputs to the \nLymnaea feeding system: effects on behaviour and neural circuitry.  J Exp Biol. 122, 113-138. \n \n 30\nKrajnak, K., Rosewell, K.L., Duncan, M.J., and Wise, P.M., 2003.  Aging, estradiol and time \nof day differentially affect serotonin transporter binding in the central nervous system of \nfemale rats.  Brain Res. 990(1-2), 87-94. \n \nKubota N., Kiuchi, Y., Nemoto, M., Oyamada, H., Ohno, M., Funahashi, H., Shioda, S. and \nOguchi, K., 2001.  Regulation of serotonin transporter gene expression in human glial cells by \ngrowth factors.  Eur J Pharmacol. 417(1-2), 69-76 \n \nKyriakides, M.A., McCrohan, C.R., 1989.  Effect of putative neuromodulators on rhythmic \nbuccal motor output in Lymnaea stagnalis.  J. Neurobiol. 20(7), 635-650. \n \nLarsson, L., and Ramamurthy, B., 2000.  Aging-related changes in skeletal muscles: \nmechanisms and interventions.  Drugs Aging 17(4), 303-316. \n \nLu, N.Z., Eshleman, A.J., Janowsky, A. and Bethea, C.L., 2003.  Ovarian steroid regulation of \nserotonin reuptake transporter (SERT) binding, distribution, and function in female macaques. \nMol Psychiatry. 8(3), 353-60. \n \nMcCrohan, C.R. and Benjamin, P.R., 1980a.  Patterns of activity and axonal projections of the \ncerebral giant cells of the snail, Lymnaea stagnalis.  J. Exp. Biol. 85:149-168. \nMcCrohan, C.R. and Benjamin, P.R., 1980b.  Synaptic relationships of the cerebral giant cells \nwith motoneurones in the feeding system of Lymnaea stagnalis.  J. Exp. Biol. 85, 169-186. \n \n 31\nMcQueen, J.K., Wilson, H., Sumner, B.E. and Fink, G., 1999.  Serotonin transporter (SERT) \nmRNA and binding site densities in male rat brain affected by sex steroids.  Brain Res. Mol. \nBrain Res. 63(2), 241-7 \n \nMeister, B., Johnson, H. and Ulfhake, B. 1995.  Increased expression of serotonin transporter \nmessenger RNA in raphe neurons of the aged rat.  Brain Res. Mol. Brain Res. 33(1), 87-96. \n \nPatel, B.A., Arundell, M., Allen, M.C., Gard, P., O’Hare, D., Parker, K. and Yeoman M.S., \n2006.  The cerebral giant cells: a neurophysiological correlate of aging in the snail feeding \nsystem.  Neurobiol. Aging 27(12), 1892-1961. \n \nPatel, B.A., Arundell, M., Parker, K., Yeoman, M.S. and O’Hare, D. 2005.  Simple and rapid \ndetermination of serotonin and catecholamines in biological tissue using high-performance \nliquid chromatography with electrochemical detection. J. Chrom. B. 818(2), 269-276.  \n \nPeng, M.T., Jiang, M.J. and Hsu, H.K., 1980.  Changes in running-wheel activity, eating and \ndrinking and their day\/night distributions throughout the life span of the rat.  J Gerontol. \n35(3), 339-47. \n \nQian, Y., Galli, A., Ramamoorthy, S., Risso, S., DeFelice, L.J. and Blakely, R.D., 1997.  \nProtein kinase C activation regulates human serotonin transporters in HEK-293 cells via \naltered cell surface expression.  J. Neurosci. 17(1), 45-57. \n \nRosen, S.C., Weiss, K.R., Goldstein, R.S. and Kupfermann, I., 1989.  The role of a \nmodulatory neuron in feeding and satiation in Aplysia: effects of lesioning of the serotonergic \n 32\nmetacerebral.   J. Neurosci. 9(5), 1562-78.  \n \nRylett, R.J. and Williams, L.R., 1994.  Role of neurotrophins in cholinergic-neurone function \nin the adult and aged CNS.  Trends Neurosci. 17(11), 486-490. \n \nStanford, J.A., Vorontsova, E., Surgener, S.P., Gerhardt, G.A. and Fowler, S.C., 2003. Aged \nFischer 344 rats exhibit altered orolingual motor function: relationships with nigrostriatal \nneurochemical measures.  Neurobiol. Aging 24, 259-266. \n \nStaras, K., Kemenes, G. and Benjamin, P.R., 1998.  Neurophysiological correlates of \nunconditioned and conditioned feeding behaviour in the pond snail, Lymnaea stagnalis.  J \nNeurophysiol 79(6), 3030-3040. \n \nStraub, V.A. and Benjamin, P.R., 2001.  Extrinsic modulation and motor pattern generation in \na feeding network: a cellular study.  J. Neurosci.21(5), 1767-78. \n \nTer Maat, A., 1992.  Egg laying in the hermaphrodite pond snail Lymnaea stagnalis.  Prog. \nBrain Res. 92, 345-60. \n \nTuersley M.D.and McCrohan, C.R., 1989.  Postsynaptic actions of serotonergic cerebral \ngiant-cells on buccal motoneurones in the snail Lymnaea stagnalis.  Comp. Biochem. Physiol. \nC-Pharmacol. Toxicol. & Endocrinol. 92(2), 377-383.  \n \n 33\nVan Dyck, C.H., Malison, R.T., Seibyl, J.P., Laurelle, M., Klumpp, H., Zoghbi, S.S., \nBaldwin, R.M., and Innis, R.B., 2000.  Age-related decline in central serotonin transporter \navailability with [(123)I] beta-CIT SPECT.  Neurobiol Aging 21(4), 497-501. \n \nVerkhratsky, A. and Toescu, E.C., 1998.  Calcium and Neuronal Ageing. Trends Neurosci. \n21(1), 2-7. \n \nYeoman, M.S., Parish, D. and Benjamin, P.R., 1993.  A cholinergic modulatory interneuron \nin the feeding system of the pond snail, Lymnaea stagnalis.  J Neurophysiol 70, 37-50. \n \nYeoman, M. S., Brierley, M. J. and Benjamin, P.R. 1996. Central pattern generating \ninterneurons are targets for the modulatory cerebral giant cells in the feeding system of \nLymnaea.  J. Neurophysiol. 75, 11-25. \n \nYeoman, M.S., Kemenes, G., Benjamin, P.R. and Elliott, C.J.H., 1994b.  Modulatory role for \nthe serotonergic cerebral giant cells in the feeding system of the snail, Lymnaea. II \nPhotoinactivation.  J Neurophysiol 72, 1372-82. \n \nYeoman, M.S., Pieneman, A.W., Ferguson, G.P., ter Maat, A. and Benjamin, P.R., 1994a.  \nModulatory role for the serotonergic cerebral giant cells in the feeding system of the snail \nLymnaea. I. Fine wire recording in the intact animal and pharmacology. J Neurophysiol 72, \n1357-71. \n 34\nFigure Legends \nFigure 1: Diagrammatic representation of the CNS from Lymnaea stagnalis.  The diagram \nillustrates a dorsal view of the main ganglia and nerves associated with the CNS.  Details of \nthe regions taken for HPLC analysis are shown by the dotted boxes.  The cerebral ganglia \n(CG) are shown with the cerebral commisure cut and the left and right ganglia folded out to \ngive a flattened, two dimensional view of the CNS.  Ganglia: buccal (BG); cerebral (CG); \npedal (PG); pleural (PLG); parietal (PAG) and visceral (VG).  L and R indicate left and right \nand A and P anterior and posterior. Major nerves and connectives:  (1) dorsobuccal nerve; (2) \nlaterobuccal nerve; (3) ventrobuccal nerve; (4) cerebrobuccal connective; (5) superior lip \nnerve; (6) median lip nerve. \n \nFigure 2:  Age-related changes in feeding behaviour.  A) Diagrammatic representation of a \ntypical feeding trace illustrating the main feeding parameters examined. The shaded bars \nshow typical timings of the 3 active phases (protraction (P); rasp (R), swallow (S)) and 1 \ninactive phase (I) that comprises each feeding cycle.  B) Bar graphs showing age–related \nchanges in the number of sucrose-evoked bites (Bi) and inter-bite interval (Bii).  Values \nplotted are the mean + SEM n ≥ 9 for each bar. ** p<0.01, *** p<0.001. \n \nFigure 3:  Age-related changes in CNS levels of 5-HT and 5-HIAA.  Bar graphs showing \nage-related differences in (A) 5-HT; (B) 5-HIAA and (C) 5HIAA: 5-HT ratio in the buccal \nand cerebral ganglia.  Values represent the mean + SEM, n=≥9 for each group.  Analysis \nperformed using a 2 way ANOVA and post-hoc Tukey test.  **p<0.01, *** p<0.001. \n \nFigure 4:  Relationship between number of sucrose-evoked bites per minute and CNS levels \nof 5-HIAA.  The number of sucrose-evoked bites was positively correlated with 5-HIAA \n 35\nlevels in the buccal (A) and cerebral ganglia (B).  Symbols represent individual animals for \neach of the 3 age groups. \n \nFigure 5:  Relationship between inter-bite interval and CNS levels of 5-HIAA.  Correlational \nanalysis of animals in all three age groups showed that inter-bite interval was negatively \ncorrelated with the 5-HIAA content of the buccal ganglia.  Symbols represent individual \nanimals for each of the 3 age groups. \n \nFigure 6:  Whole mount SERT immunohistochemistry in the Lymnaea CNS.  Anti-SERT \nlabelling is visualised in the buccal ganglia (Bg) as light grey processes extending between \nthe paired Bg and travelling via the dorsal buccal nerves to the oesophagus (Oes) of 3-4 \nmonth (A) and 6-7 month old animals (B).  In the majority of 11-12 month old animals anti-\nSERT labelling is absent from the buccal ganglia (C), but can be visualised in other CNS \nganglia (D).  Occasionally (1 out of 6 preparations), faint anti-SERT labelling can be seen in \nthe buccal ganglia of 11-12 month old animals (E).  Controls performed in the absence of the \nprimary antibody failed to show distinctive SERT labelling (F).  A, B, C, E, F are x100, D x \n50.  All scale bars 500 µm. \n \nFigure 7: Fluoxetine sensitivity of the CGC→B1 synapse.  Action potentials in the CGCs \nevoked unitary EPSPs in the B1 motoneurone (Ai\/Bi).  In 3-4 month old CNSs application of \neither 10 nM flluoxetine (Aii) or 100 nM fluoxetine (Aiii) increased the amplitude of the \nEPSP (Bi-iii).  In 11-12 month old animals fluoxetine failed to significantly increase EPSP \namplitude.  C) Bar graph showing the change in EPSP amplitude following fluoxetine \napplication.  Fluoxetine significantly increases EPSP amplitude in the 3-4 month and 6-7 \n 36\nmonth groups but fails to significantly alter EPSP amplitude in the 11-12 month old group.  * \np<0.05; ** p<0.01, values are the mean + SEM, n=8 for all groups. \n \nFigure 8:  Sensitivity of the B1 protraction phase motoneurone increases with age.  A) \nApplication of a High Mg2+\/zero Ca2+ ringer solution to the isolated CNS leads to the \nchemical isolation of the B1 motoneurone (N.B. the disappearance of spontaneous synaptic \nimputs). Application of 5-HT to chemically isolated B1 motoneurones from 3-4 month (B) \nand 11-12 month old animals (C) causes a concentration-dependent increase in the evoked \ndepolarisation.  D)  Graph showing the increase in the amplitude of the 5-HT-evoked \ndepolarisation is greater in 11-12 month old group compared to either the 3-4 month and 6-7 \nmonth groups.  * p<0.05, values are mean + SEM, n=8 for all points. \n \nFigure 9:   Sensitivity of the B4 swallow phase motoneurone decreases with age.  Ai) B4 \nmotoneurone recorded in normal HEPES-buffered ringer showing typical chemical inputs \nfrom N1 and N2 interneurones.  (Aii) Chemical isolation of B4 with a high Mg2+\/zero Ca2+ \nringer removes rhythmic N1 and N2 inputs leaving smaller irregular bursts that are \nendogenously generated by B4.  Application of 5-HT to chemically isolated B4 motoneurones \nfrom 3-4 month (B) and 11-12 month old animals (C) causes a concentration-dependent \nincrease in the evoked depolarisation.  N.B. the lack of response of 11-12 month old cells to \nboth 10-8 and 10-6 M 5-HT.  D)  Graph showing the increase in the amplitude of the 5-HT-\nevoked depolarisation in 3-4, 6-7 and 11-12 month old animals.  * p<0.05, values are mean + \nSEM, n=8 for all points. \n \nFigure 10:  Increasing age reduces 5-HT-induced bursting in B4 motoneurones.  Application \nof a 5 sec pulse of 10-6M 5-HT induced bursting in chemically isolated B4 motoneurones \n 37\nfrom (A) 3-4 month, (B) 11-12 month animals.  A 30 second sample of each of these traces is \nshown on a faster time base in Aii and Bii.  C)  Graph showing the decrease in the mean \nfrequency of 5-HT-induced bursts with increasing age (averaged over the 1st 100 s following \n5-HT application). n=5 for each bar. p<0.05. \n \nFigure 11:  Application of fluoxetine can mimic age-related changes in feeding behaviour.  \nAi)  Fluoxetine causes a dose-dependent decrease in the number of sucrose-evoked bites and \nan increase in the duration of the inter-bite interval (Aii).  Values are mean + SEM, n=8 for all \npoints, * p<0.05, ***p<0.001. \n 38\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nCG\nPAG \nVG \nPLG \nPG\n1 2\n3\n4 \n5\n6\nCG \nPG \nPLG\nPAG\nBG \nFigure 1 Yeoman et al. J. Neurochem\n 39\n3-4 6-7 11-12\n0\n10\n20\n30\n40\nmouth closed\nmouth openLatency\nInterbite Interval\nBite Duration\nSucrose\nA\n**\nBiiBi\n**\n***\n Age (months)\nSu\ncr\nos\ne-\nev\nok\ned\n b\nite\ns\n3-4 6-7 11-12\n0\n2\n4\n6\n8\n10\nI\nS\nR\nP\n**\n Age (months)\n In\nte\nrb\nite\n In\nte\nrv\nal\n (s\n)\nFigure 2 Yeoman et al. J. Neurochem\n 40\nBuccal ganglia Cerebral ganglia\n0\n10\n20\n30\n40\n50\n60\n \n [5\n-H\nT]\n fm\nol\nes\n m\ng-1\n ti\nss\nue\nBuccal ganglia Cerebral ganglia\n0\n2\n4\n6\n8\n10\n \n***\n***\n***\n***\n [5\n-H\nIA\nA\n] f\nm\nol\nes\n m\ng-1\n ti\nss\nue\nBuccal ganglia Cerebral ganglia\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n \n 3-4 months\n 6-7 months\n 11-12 months\n**\n**\nCerebral\nGanglia\nCerebral\nGanglia\nCerebral\nGanglia\nBuccal\nGanglia\nBuccal\nGanglia\nBuccal\nGanglia\nC\nB\nA\n [5\n-H\nIA\nA\n]:[\n5-\nH\nT]\n r\nat\nio\nFigure 3 Yeoman et al. J. Neurochem\n 41\n0 5 10 15 20 25 30 35 40\n-2\n0\n2\n4\n6\n8\n10\n 3-4 months\n 6-7 months\n 11-12 months\n Number of sucrose-evoked bites\nBuccal Ganglia\nr=0.54\np<0.01\n[5\n-H\nIA\nA\n] f\nm\nol\nes\n m\ng-1\n ti\nss\nue\n0 5 10 15 20 25 30 35 40\n-2\n0\n2\n4\n6\n8\n10\nBA\n [5\n-H\nIA\nA\n] f\nm\nol\nes\n m\ng-1\n ti\nss\nue\n Number of sucrose-evoked bites\nr=0.41\np<0.05\nCerebral Ganglia\nFigure  4 Yeoman et al. J. Neurochem\n 42\n0 2 4 6 8 10\n0\n2\n4\n6\n8\n10  3-4 months\n 6-7 months\n 11-12 months\nr=-0.41\np<0.05\nBuccal ganglia\n[5\n-H\nIA\nA\n] f\nm\nol\nes\n m\ng-1\n ti\nss\nue\nInterbite Interval (s)\n \n \nFigure  5 Yeoman et al. J. Neurochem\n 43\n3-4 months \n6-7 months \n11-12 months 11-12 months \nBg \nOes \nOes \nBg \nBg \nBg \nBg \nOes Oes \nOes \nBg \nOes \nA \nB \nC\nD F\nE\nFigure  6 Yeoman et al. J. Neurochem\n 44\n \n3-4 6-7 11-12-1\n0\n1\n2\n3\nB1\nB1\nCGC\nCGC\n**\n*\n 10nM Fluoxetine\n 100 nM Fluoxetine\n C\nha\nng\ne \nin\n E\nPS\nP \nam\npl\nitu\nde\n (m\nV\n)\nAge (months)\nAii\nControl\nC\nBi\nAi Aiii\n10 nM Fluox\n40 mV\n2 mV\n100 nM Fluox\n2 mV\n200 ms\nBii Biii\n40 mV\nFigure  7 Yeoman et al. J. Neurochem \n 45\n \n20 s\n10 mV\n10-6M 10-4M\n10-4M10-6M10-8M 20 s\n20 mV\n20 mV\nCii\n10-8M\nCiiiCi\nBiiiBiiBi\nA\n20 s\n-8 -6 -4\n0\n5\n10\n15\n20\n25\n*\n 3-4 months\n 6-7 months\n 11-12 months\n Log [5-HT] MA\nm\npl\nitu\nde\n o\nf 5\n-H\nT-\nin\ndu\nce\nd\nde\npo\nla\nri\nsa\ntio\nn \n(m\nV\n)\nB1\nHigh Mg2+\/zero Ca2+\nFigure  8 Yeoman et al. J. Neurochem \n 46\n \nN2N1\nNormal Saline\n20 mV\n20 mV\n10 s\n20 mV\nB4 B4 B4\nB4B4B4\nB4B4\nHigh Mg2+\/zeroCa2+\nBiiiBiiBi\nAiiAi\nD\nCiiCi\n10-6M\n10-6M\nCiii\n10-4M\n10-4M\n20 s10-8M\n10-8M\n-8 -6 -4\n0\n5\n10\n15\n20\n25\n*\n Log [5-HT] M\n 3-4 months\n 6-7 months\n 11-12 months\nA\nm\npl\nitu\nde\n o\nf 5\n-H\nT-\nev\nok\ned\nde\npo\nla\nri\nsa\ntio\nn \n(m\nV\n)\n \nFigure  9 Yeoman et al. J. Neurochem\n 47\nAii\nBi\nAi\n40 mV\n40 s\nC\n11-12 months\n3-4 months\nB4\nB4\n10 s\n3-4 6-7 11-12\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n*\n Age (months)\n M\nea\nn \nBu\nrs\nt F\nre\nqu\nen\ncy\n (H\nz)\nFigure  10 Yeoman et al. J. Neurochem\n 48\n \n-7.5 -7.0 -6.5 -6.0 -5.5\n0\n10\n20\n30\n40\n50\n***\n***\n****\n3\n3.0\n1.\n1.0\n0.3\n0.1\n 3-4 months\n 11-12 months\nAii\nAi\nSu\ncr\nos\ne-\nev\nok\ned\n b\nite\ns\nDose of Fluoxetine (nmoles)\n0\n1\n2\n3\n4\n5 *\n*\n0.3\n0.1\nC\nC\nIn\nte\nrb\nite\n In\nte\nrv\nal\n (s\n)\nDose of Fluoxetine (nmoles)\n \n \nFigure  11 Yeoman et al. J. Neurochem \n"}