{"doi":"10.1016\/0025-5564(94)90029-9","coreId":"96916","oai":"oai:generic.eprints.org:496\/core69","identifiers":["oai:generic.eprints.org:496\/core69","10.1016\/0025-5564(94)90029-9"],"title":"Nonlinear diffusion of a growth inhibitory factor in multicell spheriods","authors":["Chaplain, M. A. J.","Benson, D. L.","Maini, P. K."],"enrichments":{"references":[{"id":799531,"title":"Analysis of cellular interactions in density-dependent inhibition of 3T3 cell proliferation,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":799796,"title":"A simplified mathematical model of tumor growth,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":799865,"title":"A mathematical model of tumor growth,lI. Effects of geometry and spatial nonuniformity on stability,","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":800081,"title":"A mathematical model of tumor growth.-","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":800225,"title":"Corrigendum: A mathematical model of tumor growth by diffusion,","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":800493,"title":"A qualitative analysis of some models of tissue growth,","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":800754,"title":"Existence of two chalone-like substances in intestinal extract from the adult newt inhibiting embryonic intestinal cell profileration, Cell Tissue Kinet.","authors":[],"date":"1975","doi":null,"raw":null,"cites":null},{"id":800975,"title":"Intercellular communication in multicell spheroids,","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":801233,"title":"The pattern of tumour growth,","authors":[],"date":"1971","doi":null,"raw":null,"cites":null},{"id":801240,"title":"Rate of growth of solid tumours as a problem of diffusion,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":801497,"title":"On the concentration profile of a growth inhibitory factor in multicell spheroids,","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":801715,"title":"A mathematical model for the diffusion of tumour angiogenesis factor into the surrounding host tissue,","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":801948,"title":"Intercellular communication, threedimensional cell contact and radiosensitivity,","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":802165,"title":"Cell cycle kinetics in an in vitro tumour model, Cell Tissue I&et.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":802438,"title":"Multicell spheroids as a model for cell kinetic studies, Cell Tissue Kinet.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":802681,"title":"Self-regulation of growth in three dimensions,","authors":[],"date":"1973","doi":null,"raw":null,"cites":null},{"id":802903,"title":"Chalones and specific growth factors in normal and tumor growth,","authors":[],"date":"1984","doi":null,"raw":null,"cites":null},{"id":803148,"title":"Role of necrosis in saturation of spheroid growth,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":803430,"title":"Regrowth of cells from multicell tumour spheroids, Cell Tissue Kinet.","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":803654,"title":"Determination of diffusion constants for metabolites in multicell tumor spheroids,","authors":[],"date":"1983","doi":null,"raw":null,"cites":null},{"id":804002,"title":"Regulation of growth saturation and development of necrosis in EMT6\/Ro multicellular spheroids by the glucose and oxygen supply, Cancer Res.","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":804221,"title":"Proliferative and clonogenic heterogeneity of cells from EMT6\/Ro multicellular spheroids induced by the glucose and oxygen supply, Cancer Res.","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":804449,"title":"In situ oxygen consumption rates of cells in V-79 multicellular spheroids during growth,","authors":[],"date":"1984","doi":null,"raw":null,"cites":null},{"id":804673,"title":"Models for the growth of a solid tumor by diffusion,","authors":[],"date":"1972","doi":null,"raw":null,"cites":null},{"id":804944,"title":"On the self-inhibited growth of cell cultures,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":805208,"title":"On the growth and stability of cell cultures and solid tumours,","authors":[],"date":"1976","doi":null,"raw":null,"cites":null},{"id":805437,"title":"Density-dependent inhibition of growth: Inhibitory diffusible factors from 3T3- and Rous sarcoma virus (RSVJ-transformed 3T3 cells,","authors":[],"date":"1984","doi":null,"raw":null,"cites":null},{"id":805677,"title":"Extraction, purification and preliminaxy characterization of the epidermal chalone,","authors":[],"date":"1968","doi":null,"raw":null,"cites":null},{"id":805827,"title":"Closing and opening of gap junction pores between two- and three-dimensionally cultured tumor cells,","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":805924,"title":"Epidermal chalones and squamous cell carcinomas, Virchows Arch.","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":806182,"title":"The chalones in Tissue Growth Factors,","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":806376,"title":"What’s new in endogenous growth stimulators and inhibitors (chalones),","authors":[],"date":"1985","doi":"10.1016\/S0344-0338(85)80079-0","raw":null,"cites":null},{"id":806588,"title":"A model for the growth of multicell spheroids, Cell Tissue Kinet.","authors":[],"date":"1982","doi":"10.1111\/j.1365-2184.1982.tb01065.x","raw":null,"cites":null},{"id":806851,"title":"Identification of a tumor inhibitory factor in rat ascites fluid,","authors":[],"date":"1984","doi":"10.1016\/0006-291X(84)91620-6","raw":null,"cites":null},{"id":807095,"title":"Junctional intercellular communication: The cell-to-cell membrane channel,","authors":[],"date":"1981","doi":"10.1007\/BF01871630","raw":null,"cites":null},{"id":807168,"title":"A model for the growth of a solid tumor with non-uniform oxygen consumption,","authors":[],"date":"1977","doi":"10.1016\/0025-5564(77)90028-1","raw":null,"cites":null},{"id":807432,"title":"Mathematical model of prevascular growth of a spherical carcinoma,","authors":[],"date":"1990","doi":"10.1016\/0895-7177(90)90040-T","raw":null,"cites":null},{"id":807684,"title":"A tissue-specific factor inhibiting DNA synthesis in mouse","authors":[],"date":"1973","doi":null,"raw":null,"cites":null},{"id":807922,"title":"Heterogeneous oxygen partial pressure and pH distribution in C3H mouse mammary adenocarcinoma,","authors":[],"date":"1992","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1994","abstract":"A mathematical model is presented for the production of a growth inhibitory factor (GIF) within a multicell spheroid. The model is based on the assumption that the GIF diffuses within the spheroid in a nonlinear spatially dependent manner. This is in contrast with previous models, in which the nonlinearity was assumed in the production team. The results of the new model are compared with those of previous models and with experimental data","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96916.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/496\/1\/41.pdf","pdfHashValue":"46ebe37f98c82616517a4ae9463cf988b92c6d0f","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:496<\/identifier><datestamp>\n      2015-05-29T18:23:16Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4143:4D3932<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/496\/<\/dc:relation><dc:title>\n        Nonlinear diffusion of a growth inhibitory factor in multicell spheriods<\/dc:title><dc:creator>\n        Chaplain, M. A. J.<\/dc:creator><dc:creator>\n        Benson, D. L.<\/dc:creator><dc:creator>\n        Maini, P. K.<\/dc:creator><dc:subject>\n        Biology and other natural sciences<\/dc:subject><dc:description>\n        A mathematical model is presented for the production of a growth inhibitory factor (GIF) within a multicell spheroid. The model is based on the assumption that the GIF diffuses within the spheroid in a nonlinear spatially dependent manner. This is in contrast with previous models, in which the nonlinearity was assumed in the production team. The results of the new model are compared with those of previous models and with experimental data.<\/dc:description><dc:date>\n        1994<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/496\/1\/41.pdf<\/dc:identifier><dc:identifier>\n          Chaplain, M. A. J. and Benson, D. L. and Maini, P. K.  (1994) Nonlinear diffusion of a growth inhibitory factor in multicell spheriods.  Mathematical Biosciences, 121  (1).   pp. 1-13.      <\/dc:identifier><dc:relation>\n        10.1016\/0025-5564(94)90029-9<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/496\/","10.1016\/0025-5564(94)90029-9"],"year":1994,"topics":["Biology and other natural sciences"],"subject":["Article","PeerReviewed"],"fullText":"Nonlinear Diffusion of a Growth Inhibitory Factor \nin Multicell Spheroids \nM. A. J. CHAPLAIN \nSchool of Mathematical Sciences, University of Bath, Bath BA2 7AI: United Kingdom \nAND \nD. L. BENSON AND P. K. MAIN1 \nCentre for Mathematical Biology, Mathematical Institute, University of Oxford, Oq%ord, \nUnited Kingdom \nABSTRACT \nA mathematical model is presented for the production of a growth inhibitory \nfactor (GIF) within a multicell spheroid. The model is based on the assumption that \nthe GIF diffuses within the spheroid in a nonlinear spatially dependent manner. This \nis in contrast with previous models, in which the nonlinearity was assumed in the \nproduction term. The results of the new model are compared with those of previous \nmodels and with experimental data. \n1. INTRODUCTION \nIn vivo cancer growth is a complicated phenomenon involving many \ninterrelated processes. Solid tumor growth is known to take place in two \ndistinct phases-the avascular phase and the vascular phase. The transi- \ntion from avascular growth to vascular growth depends upon the crucial \nprocess of neovascularization, and in order to accomplish this the tumor \ncells secrete a diffusible substance known as tumor anglogenesis factor \ninto the surrounding tissues. This has the effect of stimulating nearby \ncapillary blood vessels to grow toward and penetrate the tumor, resup- \nplying it with vital nutrient [121. Invasion and metastasis can now take \nplace. By the time a tumor has grown to a size whereby it can be \ndetected by clinical means, there is a strong likelihood that it has \nalready reached the vascular growth phase. In this paper we focus on \nthe initial avascular stage of tumor growth and present a mathematical \nmodel for one of the processes involved. \nThe initial avascular growth phase can be studied in the laboratory \nby culturing cancer cells in the form of three-dimensional multicell \nspheroids. It is well known that these spheroids, whether grown from \nMATHEMATICAL BIOSCIENCES 121:1-13 (1994) \nOElsevier Science Inc., 1994 \n1 \n655 Avenue of the Americas, New York, NY 10010 0025-5564\/94\/$7.00 \n2 M. A. J. CHAPLAIN ET AL. \nestablished tumor cell lines or actual in vivo tumor specimens, possess \ngrowth kinetics that are very similar to those of in vivo tumors. Typi- \ncally, these avascular nodules grow to a few millimeters in diameter. \nCells toward the center, being deprived of vital nutrients, die and give \nrise to a necrotic core. Proliferating cells can be found in the outer \nthree to five cell layers. Lying between these two regions is a layer of \nquiescent cells, a proportion of which can be recruited into the outer \nlayer of proliferating cells. Many experimental data have been gathered \non the internal architecture of spheroids, and studies regarding the \ndistribution of vital nutrients (e.g., oxygen) within the spheroids have \nbeen carried out 18, 13-15, 18-23, 26, 40, 41, 44, 4.51. \nTo incorporate all of the known and observed experimental results \ninto a mathematical model would be a very formidable task indeed. \nFurthermore, from such a complicated model it would be difficult to \nfocus on the roles of individual processes. Even deciding upon simplify- \ning assumptions can be difficult. However, at minimum a realistic model \nof spheroid growth should include certain nonuniformities in the central \nprocesses of inhibition of mitosis, consumption of nutrients, and cell \nproliferation as well as the dependence of cell mitotic rate on growth \ninhibitor concentration, geometrical constraints, and central necrosis. \nSeveral papers [2-6, 11, 33, 39, 431 have focused attention on the \nchemical inhibition of mitosis within multicell spheroids, the main \nassumption of the modeling being that a growth inhibitory factor (GIF) \nis produced within the spheroid in some prescribed spatially dependent \nmanner to reflect the observed cellular heterogeneity within spheroids. \nThe existence and properties of chemicals that inhibit mitosis are \nvery will documented [7, 17, 28, 30-32, 381. Indeed there is experimental \nevidence concerning the specific effects of extracts from necrotic areas \nin tumors. It has been demonstrated that these extracts possess the \nability to reduce the proliferation of cultured cells [34] and also of \nmonolayer tumor cells [18, 211, and the same effects have been pro- \nposed to occur in tumors in vivo [27]. In this paper we focus attention \non the diffusion of a growth inhibitory factor within a multicell spheroid \nand its possible effect on cell mitosis and proliferation. To this end, \ninstead of a nonlinear production term, we consider the effects of \nintroducing a nonlinear, spatially dependent diffusion coefficient. \nIt is known that in spheroids normal structural associations (e.g., \ncell-cell junctions) are disrupted, and hence the possibility arises of \nnormal intercellular signals being disrupted also. Nonlinear diffusion of \nthe GIF within the spheroid is one possible and simple way to take \naccount of this. In Section 2 we present a mathematical model for this \nand compare our results with previous models and also with the avail- \nable experimental data. These results are discussed in the final section \nas are the merits and demerits of both types of models. \nGIF NONLINEAR DIFFUSION IN MULTICELL SPHEROIDS 3 \n2. THE MATHEMATICAL MODEL \nThe control of mitosis in tissues can be modeled as a schematic \nmechanism in which self-regulating growth is achieved as a result of \nnegative feedback from the growing tissue [391. In this approach mitosis \nis assumed to be controlled by a discontinuous switchlike mechanism, \nsuch that if the concentration of the GIF is less than some threshold \nlevel 0, say, in any region within the tissue, mitosis occurs in this region, \nwhereas if the concentration is greater than 0, mitosis is completely \ninhibited. The differential equation describing the diffusion, production, \nand degradation of the GIF within a spheroid can be written \n%=DvzC+f(C)+hS(r), rER, (2.1) \nwhere C = C(r,t) is the concentration of GIF within the spheroid \noccupying the region KI E s3 and A is the inhibitor production rate \n(molecules per unit volume per second). A more detailed description of \nthe background biology and the derivation of the above equation can be \nfound in [2, 3, 18, 21, 31, 391. Previous papers make the assumptions \nthat the GIF is produced throughout the tissue by the individual cells, \nmodeled by a source function S(r), diffuses with a constant diffusion \ncoefficient D, and is depleted everywhere at a prescribed rate f(C). \nShymko and Glass [391 and Adam 12-41 use the function f(C) = - yC, \nwhere y is the decay or loss constant. Various forms for the source \nfunction S(r) have been used. In the original model of Shymko and \nGlass [39], the GIF is assumed to be produced at a constant rate \nthroughout the tissue, yielding the uniform source function \nr inside the tissue, \nr outside the tissue. \nIn an attempt to model more accurately the heterogeneity of cells \nwithin tumors, the models of Adam consider a norzunifonn source \nfunction of the form \nOsrsR, \nr> R, \nwhere r is the distance from the origin. However, as shown by Britton \nand Chaplain [6], the nonuniform source term of Adam [2-51 is unreal- \nistic from a biological point of view since S’(O) # 0, and they suggest a \nsmooth source function of the form \nI-r2\/R2, OsrsR \nr> R. \n(2.2) \n4 M. A. J. CHAPLAIN ET AL. \nIf system (2.2) is studied in a spherical geometry with radial symme- \ntry, that is, a sphere of radius R, where the GIF concentration depends \nonly on the radial distance from the center of the sphere [C = C(r)], \nthen it may be used to model mitotic inhibition within multicell \nspheroids. As stated in the introduction, there is a large body of \nexperimental data available for multicell spheroids that can be used to \nstudy tumor microregions, the results of which can be applied to in vivo \ntumors [40, 421. Small spheroidal nodules of tumor cells can be grown in \nthe laboratory, the growth kinetics of which closely follow the first \navascular stage of in vivo tumor growth such as carcinomas. These grow \nto a diffusion-limited steady-state size a few millimeters in diameter. \nCells at the center of the avascular nodule are starved of vital nutrients \nand die [26], forming a central necrotic core. A thin layer of live, \nproliferating cells three to five cell layers thick forms at the periphery of \nthe nodule, while sandwiched between these two regions is a layer of \nquiescent cells. A proportion of the quiescent cells are reproductively \nviable and may be recruited into the proliferating compartment. \nOne feature of spheroid growth that has hitherto not been treated in \ndetail by mathematical models is the importance of cell-cell contacts. It \nis known that spheroids are held together by various surface membrane \nmicroprojections, extracellular matrix, and a variety of cell-cell junc- \ntions including spot desmosomes, tight junctions, junctional complexes, \nand gap junctions. It is possible that the loss of coupling between cells \nmay play a critical role in the uncontrolled proliferation in cancer [351. \nIn addition to this, whether through gap junctions or by other struc- \ntures, intercellular permeability may not be constant between cells at \ndifferent stages of spheroid growth [l, 13, 291. These observatiosn \nsuggest that diffusion of chemicals between cells may not be constant \n(cf. [20]). In this paper, therefore, we examine the effect of spatial \nnonuniformity not on the production term but on the diffusion coeffi- \ncient, and to this end the model we consider is \n~=V.[D(r)VC] +f(C)+ AS(r), rER, (2.3) \ndC -= \ndr 0, \nr = 0, (2.4) \nD(r)$+PC=O on dlR, P>O, (2.5) \nwhere we assume that production of GIF is via the uniform source \nfunction; P is the permeability of the tissue surface, and the diffusion- \ncoefficient D(r) in (2.3) is now assumed to be spatially dependent, that \nis, it varies throughout the interior of the spheroid, for which there is \nexperimental evidence [201. Thus the observed cellular heterogeneity \nwithin spheroids, the heterogeneous intercellular permeability and the \nGIF NONLINEAR DIFFUSION IN MULTICELL SPHEROIDS 5 \ncomposition of the extracellular matrix, is accounted for via nonlinear \ndiffusion. The boundary conditions (2.4), (2.5) have been dealt with at \nlength elsewhere [2, 6, 391, and we do not discuss their derivation here. \nConsidering the spherical geometry described in the introduction and \nassuming radial symmetry, the above system reduces to \nac 1 d, _=-_ \nat r2 dr r2D(rpg -yC+ A, rsR, (2.6) \naC 0 dr= > r = 0, \nD(r)%+PC=O, r = R. \n(2.7) \n(2.8) \nTo facilitate analysis of the above system it is convenient to nondi- \nmensionalize, and hence we choose appropriate reference variables. \nThe obvious variables to choose (cf. [ll]) are, as the reference length, \nR, the radius of the spheroid under consideration; as a reference GIF \nconcentration, 0, the critical threshold level of C; and as a reference \ntime, R2\/D. Thus we define new variables \nWe also assume that we can write \nD(r) = Dd(r), (2.9) \nwhere D is a constant. The system now becomes, upon dropping the \ntildes for notational convenience, \ndC 1 d -=_- \ndt r2 dr ( \nr’d(r)$j -L2C+aL2, \n1 \ndC -= \ndr 0, r = 0, \nd(r)$j+$C=O, , r=l \n(2.10) \n(2.11) \n(2.12) \nwhere ~~ = y\/D, L = KR, a = A\/y0 and n =(YD>“~\/P. With this \nnondimensionalization we see that once the parameters for a particular \nspheroid are determined, the only undetermined parameter is the \nradius R. The solutions to (2.10) can therefore be monitored for \nspheroids of various sizes. Thus we can analyze the system using \ndifferent values for the spheroid radius R while holding constant the \nvarious observable parameters associated with the system, that is, D, y, \nP, and h\/8 (cf. [391X It is our intention to discover if a concentration \n6 M. A. J. CHAPLAIN ET AL. \nprofile of GIF inside the spheroid can be found corresponding to the \nobserved pattern of necrosis seen experimentally. \nSince it is known that rapidly growing tumors enlarge at a rate on the \norder of 0.4-0.7 mm\/day [9] while diffusing chemical substances, with \ndiffusion coefficients on the order of 10ph cm*\/s, and reach steady state \non a time scale of the order of a few minutes, then it is sufficient to \nconsider the corresponding steady-state equation given by \n(2.13) \ntogether with the boundary conditions (2.11), (2.12). To accomplish this, \n(2.10) was solved using the NAG routine D03PBF, with zero initial \nconditions C(r,O) = 0. The steady-state solutions evolved on a time \nscale of O(1). Various forms for the function d(r) were considered, \nwhich we assume is some monotonic function of r. Both monotonically \nincreasing functions of d(r) [d(O) < d(l)] and monotonically decreasing \nfunctions [d(O) > d(l)] were investigated. For our purposes we chose \nd(r) = 0.8 + 0.2r2 as an example of the former and d(r) = 1.0 - 0.2r2 as \nan example of the latter (variability in diffusion constants between \nspheroids grown from different cell lines has been verified experimen- \ntally [201). \nAs stated above, once the observable parameters have been fixed, the \nconcentration profile for different sized spheroids can be easily ob- \ntained from the steady-state solutions of (2.10) simply by varying one \nparameter, namely the spheroid radius R. Mathematical models for this \nstage of spheroid growth involving the dynamic evolution of the radius \nR(t) are given by, for example, Burton [lo], Greenspan [24-261, \nMcElwain and Ponzo [36], and Maggelakis and Adam [37]. In these \nmodels, since the initial growth of the spheroids is avascular, they grow \nto a finite, diffusion-limited size a few millimeters in diameter. Mathe- \nmatically, as t + m, R(t) + R*. Thus by varying (i.e., increasing) the \nvalue for R in (2.10) from an initial value R(O), say, up to R*, we can \neffectively follow the development of the GIF concentration profile \nwithin the spheroid as the spheroid grows. This seems intuitively more \nappropriate than letting R +m, which does not happen in practice. We \nalso note that a consequence of the nondimensionalization is that in \neach case the critical threshold level for mitosis occurs at C = 1. \n3. RESULTS \nThe results presented in this section are compared with the experi- \nmental data of Folkman and Hochberg [16]. In order to compare and \ncontrast our results with previous mathematical models, following \nGIF NONLINEAR DIFFUSION IN MULTICELL SPHEROIDS 7 \nShymko and Glass [39] and Chaplain and Britton [ll], we choose \nD = 5 X 10m7 cm’\/s, P = 10m4 cm\/s, and y = 5 X 10P5\/s-‘. Corre- \nspondingly, K = 10 cm- ’ and n = 0.05. We note that in accordance with \nour assumption of a spatially varying diffusion coefficient [cf. (2.9)] the \nvalue of D given above will hold only at r = 1, that is, the tumor edge. \nThe value of the diffusion coefficient in the interior of the spheroid will \nvary according to the prescribed function d(r). To find a value for the \nparameter u, we follow the procedure of Chaplain and Britton [ll] and \nuse the experimental observation of Folkman and Hochberg [16] that \nwhen the spheroids are approximately 0.05 cm in radius, the volume of \nthe active mitotic zone is 0.6 of the total volume of the tissue. A simple \ncalculation then shows that the size of the inner radius of the necrotic \ncore must be 0.037cm (cf. [ll]). In terms of the nondimensionalized \nvariables, we therefore require that C = 1 when r = 0.74, L = 0.5, 71 = \n0.05. Equation (2.10) was solved numerically with various values of the \nparameter a and allowed to evolve to steady state. Figure 1 shows the \nsteady-state profiles achieved with a value of a = 32.5, that is, h\/8 = \n1.625 X lop3 s-r for (i) a monotonically increasing and (ii) a monotoni- \ncally decreasing diffusion coefficient. It can be seen from Figure 1 that \nI .8 \nDistance from came \nFIG. 1. Plot of GIF concentration profile throughout multicell spheroid of size \nR = 0.05 cm; D = 5 X 1O-7 cm’\/s, P = 1O-4 cm\/s, y = 5 x 10m5 s-‘. (i) d(r) = 0.8+ \n0.2r2 (monotonically increasing); (ii) d(r) = 1.0 - 0.2r2 (monotonically decreasing); \nconstant source term. \n8 M. A. J. CHAPLAIN ET A&. \nthis value of a (approximately) satisfies the above experimental con- \nstraint. Exact agreement could not be easily obtained since the analytic \nsolution of (2.10) is not known. \nFigure 2 shows the steady-state GIF profiles within a spheroid 4 mm \nin diameter, that is, the diffusion-limited size. Once again the two \ncurves correspond to (i) a monotonically increasing and (ii) a monotoni- \ncally decreasing diffusion coefficient. \nThe horizontal line drawn at C = 1 in all figures is the threshold \nvalue for the GIF. Hence in any region of the spheroid where the GIF \nconcentration is greater than 1, mitosis will be inhibited here. This \nenables regions within the spheroid where mitosis is taking place and \nthose where mitosis is inhibited (necrotic core) to be easily distin- \nguished. As can be clearly seen from Figure 2, the final steady-state \nGIF profile achieved is in good agreement with the experimental data \nof Folkman and Hochberg [16], where at the stable, diffusion-limited \nsize there was a narrow layer of one or two cells that was mitotically \nactive surrounding the necrotic core. These results also parallel those of \nChaplain and Britton [ill. \n0’ I \n-1 -0.8 -0.6 -0.4 -0.2 0 0.2 0.4 0.6 0.X I \nDistance from centre \nFK. 2. Plot of GIF concentration profile throughout multicell spheroid of \nultimate size R = 0.2 cm; D = 5 x lOA7 cm’\/s,P = 10m4 cm\/s, y = 5 x 10m5 s-l. (i) \nd(r) = 0.8 +0.2r2 (monotonically increasing); (ii) d(r) = 1.0 -0.2r2 (monotonically \ndecreasing); constant source term. \nGIF NONLINEAR DIFFUSION IN MULTICELL SPHEROIDS 9 \nWe now also consider solving the above system with the constant \nsource t&m being replaced by a spatially nonuniform source function of \nthe type suggested by Britton and Chaplain [6l, that is, \nS(r) = \n1-r2\/R2, OsrsR, \no \n9 i->R. \n(3.1) \nAfter nondimensionalization, the model equation now becomes \nac -= \ndt \n+-$ ?d(r)!g \n( ) \n-PC+aP(l-r2). (3.2) \nFigure 3 shows the steady-state GIF concentration profiles obtained \nwith a value of a = 65 for (i) a monotonically increasing and (ii) a \nmonotonically decreasing nonlinear diffusion term. Once again this \nvalue for a enables the experimental observation of Folkman and \nHochberg [16] concerning the ratio of the volume of the active mitotic \nzone to the total tissue volume to be satisfied. Figure 4 shows the \nc \nI \nc \n-0.8 -0.6 -0.4 -0.2 0 0.2 0.4 0.6 0.8 I \nDistance from centre \nFIG. 3. Plot of GIF concentration profile throughout multicell spheroid of size \nR = 0.05 cm; D = 5 X lo-’ cm* s, P = 10e4 cm\/s, y = 5 X 10m5 s-‘. (i) d(r) = 0.8+ \n0.2~’ (monotonically increasing); (ii) d(r) = l.O-0.2r2 (monotonically decreasing); \nnonlinear source term. \n10 M. A. J. CHAPLAIN ET AL. \n-0.8 -0.6 -0.4 -0.2 0 0.2 0.4 0.6 0.8 I \nDistance from centre \nFIG. 4. Plot of GIF concentration profile throughout multicell spheroid of \nultimate size R = 0.2 cm; II = 5 X IO-’ cm’\/s,P = 10m4 cm\/s, y = 5 X lo-” s- ‘. (i) \nd(r) = 0.8 + 0.2r2 (monotonically increasing); (ii) d(r) = 1 .O - 0.2r2 (monotonically \ndecreasing); nonlinear source term. \ncorresponding steady-state GIF concentration profiles for a spheroid of \nultimate size 0.4 cm diameter. Again these show good agreement with \nthe experimental observations. \nWe note for completeness that results similar to those of Britton and \nChaplain [6] can be obtained upon straightforward application of the \nmaximum principle to (2.10)-(2.12) and (3.2). Using these techniques it \nis easily shown that, qualitatively, the final GIF concentration profile \ndepends only on the qualitative form of the function d(r), which can be \nchosen to model the interior heterogeneity of the spheroids. \n4. CONCLUSIONS \nWe have shown that using a nonlinear, spatially dependent diffusion \ncoefficient, which reflects the cellular heterogeneity of the interior of \nmulticell spheroids and the heterogeneous intercellular permeability, is \nalone sufficient to produce a GIF concentration profile within the \nspheroid that is not incompatible with available experimetnal evidence. \nWe have also shown that a combination of nonlinear diffusion with a \nnonlinear source term can also account for the experimental observa- \ntions. Hence we have shown that a nonuniform source function is not \nGIF NONLINEAR DIFFUSION IN MULTICELL SPHEROIDS 11 \nthe only way to produce qualitatively correct GIF concentration profiles \nwithin multicell spheroids. Therefore, mathematically it is not possible \nto distinguish between the effects of nonlinear diffusion and a nonlinear \nsource term. We conclude that more experimental work on the precise \nmechanisms governing cell cycle kinetics (cf. [14, 15, 19, 451) must be \ndone to elucidate the underlying tissue heterogeneity. \nREFERENCES \n1 G. Adam, U. Steiner, H. Maier, and S. Ullrich, Analysis of cellular interactions \nin density-dependent inhibition of 3T3 cell proliferation, Biophys. Srnrct. Mech. \n9:75-82 (1982). \n2 J. A. Adam, A simplified mathematical model of tumor growth, Math. Biosci. \n86:183-211 (1987). \n3 J. A. Adam, A mathematical model of tumor growth,lI. Effects of geometry and \nspatial nonuniformity on stability, Math. Biosci. 86:183-211 (19871. \n4 J. A. Adam, A mathematical model of tumor growth.- III. Comparison with \nexperiment, Math. Biosci. 86:213-227 (1987). \n5 J. A. Adam, Corrigendum: A mathematical model of tumor growth by diffusion, \nMath. Biosci. 94:155 (1989). \n6 N. F. Britton and M. A. J. Chaplain, A qualitative analysis of some models of \ntissue growth, Math. Biosci. 113:77-89 (1992). \n7 G. Brugal and J. Pelmont, Existence of two chalone-like substances in intestinal \nextract from the adult newt inhibiting embryonic intestinal cell profileration, \nCell Tissue Kinet. 8:171-187 (1975). \n8 F. Briimmer and D. F. Hiilser, Intercellular communication in multicell \nspheroids, Eur. .I. Cell Biol. 27:108 (1982). \n9 W. S. Bullough and J. U. Deol, The pattern of tumour growth, Symp. Sot. fip. \nBiol. 25:255-275 (1971). \n10 A. C. Burton, Rate of growth of solid tumours as a problem of diffusion, Growth \n3:157-176 (1966). \n11 M. A. J. Chaplain and N. F. Britton, On the concentration profile of a growth \ninhibitory factor in multicell spheroids, Math. Biosci. 115:233-245 (1993). \n12 M. A. J. Chaplain and A. M. Stuart, A mathematical model for the diffusion of \ntumour angiogenesis factor into the surrounding host tissue, IMA J. Math. Appl. \nMed. Biol. 8:191-220 (1991). \n13 H. Dertinger, G. Hinz, and K. H. Jakobs, Intercellular communication, three- \ndimensional cell contact and radiosensitivity, Biophys. Struct. Mech. 9:89-93 \n(19821. \n14 R. E. Durand, Cell cycle kinetics in an in vitro tumour model, Cell Tissue I&et. \n9:403-412 (1976). \n15 R. E. Durand, Multicell spheroids as a model for cell kinetic studies, Cell Tissue \nKinet. 23:141-159 (1990). \n16 J. Folkman and M. Hochberg, Self-regulation of growth in three dimensions, J. \nExp. Med. 138:745-753 (1973). \n17 F. Fremuth, Chalones and specific growth factors in normal and tumor growth, \nActu Univ. Carol. Mongr. 110:157-164 (1984). \n12 M. A. J. CHAPLAIN ET AL. \n18 J. P. Freyer, Role of necrosis in saturation of spheroid growth, Struhlentherapie \n160:58 (1984). \n19 J. P. Freyer and P. L. Schor, Regrowth of cells from multicell tumour spheroids, \nCell Tissue Kinet. 20:249 (1987). \n20 J. P. Freyer and R. M. Sutherland, Determination of diffusion constants for \nmetabolites in multicell tumor spheroids, Adu. fip. Med. Biol. 159:463-475 \n(1983). \n21 J. P. Freyer and R. M. Sutherland, Regulation of growth saturation and \ndevelopment of necrosis in EMT6\/Ro multicellular spheroids by the glucose \nand oxygen supply, Cancer Res. 46:3504-3512 (1986). \n22 J. P. Freyer and R. M. Sutherland, Proliferative and clonogenic heterogeneity of \ncells from EMT6\/Ro multicellular spheroids induced by the glucose and oxygen \nsupply, Cancer Res. 46:3513-3520 (1986). \n23 J. P. Freyer, E. Tustanoff, A. J. Franko, and R. M. Sutherland, In situ oxygen \nconsumption rates of cells in V-79 multicellular spheroids during growth, J. Cell. \nPhysiol. 118:53-61 (1984). \n24 H. P. Greenspan, Models for the growth of a solid tumor by diffusion, Stud. \nA&. Math. 51:317-340 (1972). \n25 H. P. Greenspan, On the self-inhibited growth of cell cultures, Growth \n38:81-95 (1974). \n26 H. P. Greenspan, On the growth and stability of cell cultures and solid tumours, \nJ. Theor. Biol. 56:229-242 (1976). \n27 L. Hare], G. Chatelain, and A. Golde, Density-dependent inhibition of growth: \nInhibitory diffusible factors from 3T3- and Rous sarcoma virus (RSVJ-trans- \nformed 3T3 cells, J. Cell Physiol. 119:101-106 (1984). \n28 W. Hondius-Boldingh and E. B. Laurence, Extraction, purification and prelimi- \nnaxy characterization of the epidermal chalone, J. Biochem. 5:191-198 (1968). \n29 D. F. Hiilser and F. Briimmer, Closing and opening of gap junction pores \nbetween two- and three-dimensionally cultured tumor cells, Biophys. Struct. \nMech. 9:83-88 (1982). \n30 0. H. Iverson, Epidermal chalones and squamous cell carcinomas, Virchows \nArch. B Cell Pathol. 271229-235 (1978). \n31 0. H. Iversen, The chalones in Tissue Growth Factors, R. Baserga, Ed., \nSpringer-Verlag; Berlin; 1981, pp. 491-550. \n32 0. H. Iverson, What’s new in endogenous growth stimulators and inhibitors \n(chalones), Pathol. Res. Pratt. 180:77-80 (1985). \n33 J. Landry, J. P. Freyer, and R. M. Sutherland, A model for the growth of \nmulticell spheroids, Cell Tissue Kinet. 15585-594 (1982). \n34 A. E. Levine, D. A. Hamilton, L. C. Yeoman, H. Busch, and M. G. Brattain, \nIdentification of a tumor inhibitory factor in rat ascites fluid, Biochem. Biophys. \nRes. Commun. 119:76-82 (1984). \n35 W. R. Loewenstein, Junctional intercellular communication: The cell-to-cell \nmembrane channel, Physiol. Rev. 61:829-889 (1981). \n36 D. L. S. McElwain and P. J. Ponzo, A model for the growth of a solid tumor \nwith non-uniform oxygen consumption, Math. Biosci. 35:267-279 (1977). \n37 S. A. Maggelakis and J. A. Adam, Mathematical model of prevascular growth of \na spherical carcinoma, Math. Comp. Modelling 13:23-38 (1990). \n38 F. Marks, A tissue-specific factor inhibiting DNA synthesis in mouse epidermis, \nNat. Cancer Inst. Monogr. 38:79-90 (1973). \nGIF NONLINEAR DIFFUSION IN MULTICELL SPHEROIDS 13 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \nR. M. Shymko and L. Glass, Cellular and geometric control of tissue growth and \nmitotic instability, J. Theor. Biol. 63:355-374 (1976). \nR. M. Sutherland, Cell and environment interactions in tumor microregions: \nThe multicell spheroid model, Science 240:177-184 (1988). \nR. M. Sutherland and R. E. Durand, Growth and cellular characteristics of \nmulticell spheroids, Recent Results Cancer Rex 95:24-49 (1984). \nR. M. Sutherland, J. A. McCredie, and W. R. Inch, Growth of multicell \nspheroids as a model of nodular carcinomas, J. Nutl. Cancer Inst. 46:113-120 \n(1971). \nG. W. Swan, The diffusion of an inhibitor in a spherical tumor, Math. Biosci. \n108:75-79 (1992). \nP. W. Vaupel, S. Frinak, and H. I. Bicher, Heterogeneous oxygen partial \npressure and pH distribution in C3H mouse mammary adenocarcinoma, Cant. \nRes. 41:2008-2013 (19811. \nE. Wibe, T. Lindmo, and 0. Kaalhus, Cell kinetic characteristics in different \nparts of multicellular spheroids of human origin, Cell Tissue Kinet. 14:639-651 \n(1981). \n"}