{"doi":"10.1016\/j.econedurev.2006.02.005","coreId":"68750","oai":"oai:eprints.lancs.ac.uk:31307","identifiers":["oai:eprints.lancs.ac.uk:31307","10.1016\/j.econedurev.2006.02.005"],"title":"Immigrant overeducation : evidence from recent arrivals to Australia.","authors":["Green, Colin","Kler, Parvinder","Leeves, Gareth"],"enrichments":{"references":[{"id":910305,"title":"Australian Bureau of Statistics","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":917963,"title":"Australian immigration: the triumph of economics over prejudice?.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":912169,"title":"Black immigrants in the United States: A comparison with native Blacks and other immigrants.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":912787,"title":"Do selection criteria make a di¤erence? Visa category and the labour market status of immigrants to Australia.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":910538,"title":"Earnings inequality, returns to education and immigration into Ireland.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":916357,"title":"Graduate overeducation in Australia: A comparison of the mean and objective methods.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":911243,"title":"How well can we measure overeducation and its e¤ects?","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":918297,"title":"Immigrant families in the Canadian labour market.","authors":[],"date":"1996","doi":"10.2307\/3551455","raw":null,"cites":null},{"id":917416,"title":"Immigrant unemployment: The Australian experience.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":915030,"title":"Immigrants and invisible underemployment.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":913604,"title":"Immigration and Multicultural and Indigenous A¤airs","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":917111,"title":"Immigration policy and immigrant quality: The Australian points system.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":910048,"title":"Immigration policy and the skills of migrants to Australia, Canada, and the United States.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":916651,"title":"Limited dependent variable models using panel data.","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":912477,"title":"Measuring over-education.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":917687,"title":"On least squares estimation when the dependent variable is grouped.","authors":[],"date":"1983","doi":"10.2307\/2297773","raw":null,"cites":null},{"id":916131,"title":"Over-education and earnings: where are we, where should we go?","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":910958,"title":"Overeducation among graduates: A cohort view.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":911831,"title":"Overeducation and ethnic minorities in Britain.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":917510,"title":"Overeducation: a short or long run phenomenon for individuals?","authors":[],"date":"2003","doi":"10.1016\/S0272-7757(02)00052-3","raw":null,"cites":null},{"id":913309,"title":"Public policy and the labor market adjustment of new immigrants to Australia.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":911883,"title":"School quality and returns to education of U.S.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":914156,"title":"Settler arrivals 1998-1999.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":916782,"title":"The earnings of immigrant men in Australia: Assimilation, cohort e¤ects, and macroeconomic conditions.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":914740,"title":"The incidence and e¤ects of overeducation in the UK graduate labour market.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":910640,"title":"The labour market characteristics and labour market impacts of immigrants in Ireland.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":913015,"title":"The longitudinal survey of immigrants to Australia.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":915572,"title":"The overquali Canadian graduate: the role of the academic program in the incidence, persistence, and economic returns to overquali","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":913572,"title":"The wage e¤ects of overschooling revisited.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":911500,"title":"To what extent are ethnic minorities in Britain overeducated?.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":915327,"title":"Why women earn less: The theory and estimation of di¤erential overquali","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":915870,"title":"You cant take it with you? Immigrant assimilation and the portability of human capital.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007-08","abstract":"Australian immigration policy, in common with the US and Canada, has increased the emphasis on skill-based selection criteria. A key premise of this policy is that skilled immigrants are more employable and can add to the productive capacity of the economy. However, this effect will be diminished if immigrants are working in occupations that fail to utilise their skills. We examine the extent of overeducation for recently arrived immigrants to Australia. We find that they are more likely to be overeducated than the native population, even if they enter on skill assessed visas. Overeducation is greater for immigrants from non-English speaking backgrounds (NESB) and generates lower returns to education. Tighter restrictions to welfare support on entry raised employment levels but increased overeducation. This will serve to reduce the potential productivity gains from skill biased immigration policies","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68750.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/31307\/1\/Overed_Immigrant_WP.pdf","pdfHashValue":"d3973358318e45fb2534f20ad98cd5e2c70c0583","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:31307<\/identifier><datestamp>\n      2018-01-24T02:55:11Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D48:4842<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Immigrant overeducation : evidence from recent arrivals to Australia.<\/dc:title><dc:creator>\n        Green, Colin<\/dc:creator><dc:creator>\n        Kler, Parvinder<\/dc:creator><dc:creator>\n        Leeves, Gareth<\/dc:creator><dc:subject>\n        HB Economic Theory<\/dc:subject><dc:description>\n        Australian immigration policy, in common with the US and Canada, has increased the emphasis on skill-based selection criteria. A key premise of this policy is that skilled immigrants are more employable and can add to the productive capacity of the economy. However, this effect will be diminished if immigrants are working in occupations that fail to utilise their skills. We examine the extent of overeducation for recently arrived immigrants to Australia. We find that they are more likely to be overeducated than the native population, even if they enter on skill assessed visas. Overeducation is greater for immigrants from non-English speaking backgrounds (NESB) and generates lower returns to education. Tighter restrictions to welfare support on entry raised employment levels but increased overeducation. This will serve to reduce the potential productivity gains from skill biased immigration policies.<\/dc:description><dc:date>\n        2007-08<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31307\/1\/Overed_Immigrant_WP.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.econedurev.2006.02.005<\/dc:relation><dc:identifier>\n        Green, Colin and Kler, Parvinder and Leeves, Gareth (2007) Immigrant overeducation : evidence from recent arrivals to Australia. Economics of Education Review, 26 (4). pp. 420-432. ISSN 0272-7757<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/31307\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.econedurev.2006.02.005","http:\/\/eprints.lancs.ac.uk\/31307\/"],"year":2007,"topics":["HB Economic Theory"],"subject":["Journal Article","PeerReviewed"],"fullText":"Immigrant Overeducation: Evidence from\nRecent Arrivals to Australia.\nGreen, C\u0003, Kler, Py,.and Leeves, Gz.\nAbstract\nAustralian immigration policy, in common with the US and Canada,\nhas increased the emphasis on skill based selection criteria. A key premise\nof this policy is that skilled immigrants are more employable and can add\nto the productive capacity of the economy. However, this e¤ect will be\ndiminished if immigrants are working in occupations that fail to utilise\ntheir skills. We examine the extent of overeducation for recently arrived\nimmigrants to Australia. We \u0085nd that they are more likely to be overed-\nucated than the native population, even if they enter on skill based visas.\nOvereducation is greatest for immigrants from Non-English speaking back-\ngrounds (NESB) and appears to generate lower returns to education. The\nincidence of overeducation is signi\u0085cantly reduced for all immigrants if\nthey enter with visas that are a result of a job o¤er from an employer in\nthe recipient country.\nKEYWORDS: Human Capital, Rate of Return, Overeducation.\nJEL CODE: J24, J61.\n\u0003Centre for Economic Policy Modelling, University of Queensland.\nyCorresponding Author: Parvinder Kler, Centre for Economic Policy Modelling, Level 6\nColin Clark Building, University of Queensland, St Lucia, QLD, Australia, 4072. e-mail:\np.kler@economics.uq.edu.au, fax: +61 7 3365 7299.\nzSchool of Economics, University of Queensland\n1\n1 INTRODUCTION\nRecently in Australia, as in Canada and the U.S., immigration policy has decid-\nedly shifted towards skill based immigration (Cobb-Clark 2000, Antecol, Cobb-\nClark and Trejo 2003). In Australia, skilled immigration increased in the 1990\u0092s,\nwhereas family based immigration declined (DIMIA 1999). A key premise of\nthis change in policy focus is that skilled immigrants are more employable and\nhave the potential to add to the productive capacity of the economy. It has\nbeen shown that the human capital endowments of immigrants to Australia\nhas increased and their employment situation has improved relative to native\nborn Australians in the last decade (Cobb-Clark 2003). However, the extent\nto which this improvement in employment will add to Australian productive\ncapacity is not yet understood. In the case of Ireland, Barrett, FitzGerald and\nNolan (2002) suggest that the long-term impact of increased skilled migration\nto Ireland in the 1990\u0092s could have contributed as much as a 4% increase in\nGNP over the decade. However, as Barrett, Bergin and Du¤y (2005) point\nout, if immigrants experience an occupational gap, such that their skills are\nnot fully employed, the productivity gain from increased skilled immigration\ncould be reduced. They suggest that the occupational gap experienced by im-\nmigrants in Ireland may have reduced their contribution to GNP to nearer 3%.\nThus, the underutilisation of immigrant skills could have signi\u0085cant macroeco-\nnomic e¤ects. Furthermore, if better educated immigrant workers begin taking\njobs in occupations requiring less education, this could in\u0087uence wages and and\nemployment in other sectors of the Australian labour market.\n2\nIn this paper we address the issue of whether there is an immigrant occupa-\ntional gap in Australia by examining the extent to which recently arrived immi-\ngrants\u0092educational quali\u0085cations are matched to the jobs they hold in Australia.\nIn particular, we analyse the incidence and returns to immigrant overeducation\nand compare this to the Australian labour force as a whole. Overeducation\noccurs when an individual has quali\u0085cations greater than those required for the\njob. Thus far there is little evidence on the extent of immigrant overeduca-\ntion. Flatau, Petridis and Wood (1995) examined overeducation of Australian\nimmigrants and found those from a non-English speaking background (NESB)\nexperienced higher rates of overeducation when compared to immigrants from\nan English Speaking Background (ESB) and the native population. However,\nthis study did not distinguish immigrants by the visa category under which\nthey entered Australia. In this paper, we can examine whether the employment\nimprovements that appear to have been associated with tighter entry critieria\nunder the points based skills systems used in Australia can also improve the\nutilisation of immigrant\u0092s human capital.\nIn the U.S. Bratsberg and Terell (2002) noted that the returns to education of\nU.S. immigrants are in general lower for those from Asian1 and African countries,\ncompared to those from European countries. This follows earlier work that\nidenti\u0085ed how black immigrants su¤er lower rates of return to education than\nnative blacks (Butcher 1994). Neither study distinguished between those who\nare appropriately educated and those who are overeducated. It is a stylised fact\n1Japan being a notable exception.\n3\nthat the returns to overeducation are positive but lower than that for education\nthat is appropriate to the skill requirement of the job (Hartog 2000). This means\nlower overall returns to education for the overeducated (Battu, Bel\u0085eld and\nSloane 1999, 2000, Dolton and Vignoles 2000, Chevalier 2003, Rubb 2003 and\nFrenette 2004). There is some evidence from Australia and the United Kingdom\nthat minority groups su¤er higher incidences of overeducation and this translates\nto reduced returns to education (Flatau et al. 1995, Battu and Sloane 2002,\nBattu and Sloane 2004). Therefore, some of the observed di¤erences in returns\nto education for U.S. immigrants could be the result of overeducation being\nmore prevalent amongst immigrants from certain regions. Hence, we distinguish\nbetween the source region of immigrants to Australia and examine the extent of\nvariation in overeducation incidence and returns to education across groups and\ncompare this with the native population. Thus the paper will provide insights\ninto how an occupational gap is related to selection criteria and the regional\norigin of immigrants.\nThe data set used in this survey, the Longitudinal Survey of Immigrant Aus-\ntralians (LSIA), covers the immediate (3 to 4 year) period following arrival in\nAustralia. It was designed speci\u0085cally to examine the experiences of immigrants.\nAs a result it contains information not generally available in labour force or cen-\nsus data sources. Of particular interest for our purposes, it provides information\nsuch as entry visa category and some details on labour market experience in the\nformer country.\nTo summarise our results; we \u0085nd evidence of an occupational gap for recent\n4\nNESB immigrants to Australia. Despite the fact that they have on average\nhigher quali\u0085cation levels compared to the native population, they are substan-\ntially less likely to be in managerial or professional jobs and more likely to be in\nelementary service and labouring work. As a result, all immigrant groups from\nNESB backgrounds are more likely to be overeducated than the native popula-\ntion. Visa category of entry is an important determinant of overeducation for\nall immigrants. Immigrants, especially those from NESBs, also appear to su¤er\nlarger earnings penalties from overeducation than the native population. This\ncoupled with their higher rates of overeducation indicate that they receive, on\naverage, lower returns to education than the native population. Moreover, visa\nskill criteria do not appear to signi\u0085cantly reduce the incidence of overeducation\nunless they are linked to a job o¤er from an employer in the country.\nThe remainder of the paper is set out as follows. Section 2 provides back-\nground information on immigrants to Australia and outlines the data source.\nSection 3 outlines the econometric methodology. Section 4 discusses the results,\nwhilst section 5 concludes.\n2 BACKGROUND AND DATA\nUnder the immigration system at the time of the LSIA, immigrants entered\nAustralia on one of \u0085ve visa categories; these are Independent Skilled, Busi-\nness\/Employment Nominated Scheme (ENS)2 , Concessional Family, Preferen-\n2The LSIA does not distinguish between these two visa groups.\n5\ntial Family and Humanitarian visas. Those who arrived on the Independent\nSkilled or ENS visas are assessed based on their skill level3 . Immigrants with\nBusiness visas ful\u0085l the requirements that they are expected to go into busi-\nness shortly after arrival while those on ENS visas are nominated by Australian\nemployers to \u0085ll skilled positions vacant in the domestic labour market. Inde-\npendent Skilled visas are awarded to independent immigrants without family\nrelationships where points are awarded for skills, education, age and English\nlanguage ability. Concessional Family visa holders are skilled assessed but ob-\ntain points for having close relatives that are willing to sponsor and provide\nsupport during their \u0085rst two years in Australia. Thus, their skill level need\nnot be on par with those in the Independent Skilled visa category. Those on\nHumanitarian and Preferential Family visas are not skilled assessed and obtain\ntheir visas based on humanitarian reasons and family links, respectively. We\ndistinguish the source region of immigrants by three broad categories, ESB,\nAsian NESB and Other NESB4 . We also identify sub-groups of countries within\nthese regions as far as numbers will allow. These sub-groups of countries have\ncharacteristics that are likely to in\u0087uence immigrants returns to education, such\nas di¤erences in the quality of educational systems (Bratsberg and Terell 2002).\nThe data covers the period 1994 to early 1999 and comparisons are made\nwith the 1996 Census data on the native born population5 . At this time the\n3For more details see Miller (1999) and Teicher, Shah and Gri¢ n (2002).\n4This classi\u0085cation closely follows the English language pro\u0085ciency criteria grouping used\nby Australian Department of Immigration, Multicultural and Indigenous A¤airs (DIMIA\n1996).\n5Census data and estimates are reported for (a) overall working male population aged 15-64\nand (b) prime-age working males aged 25-54.\n6\nIndependent Skilled visas did not have minimum age, skill and English language\ncriteria. These were introduced later in the decade and appeared to lead to in-\ncreased levels of employment success amongst immigrants (Cobb-Clark 2003).\nHowever, our aim is to identify if an occupational gap exists and examine in-\ncidences and returns to education amongst immigrants groups relative to the\nnative population. The 1996 census provides a comparison point that is near to\nthe time period of the LSIA data.\nThe LSIA attempts to \"document the settlement, including the labour mar-\nket experiences, of a cohort of recently arrived, o¤shore-visaed immigrants to\nAustralia\" (Cobb-Clark, 2001: 467)6 . As a result it contains information that is\nnot generally available in labour force or census data sources. The LSIA looks\nat a cohort of immigrants to Australia that arrived between September 1993\nand August 1995. This group was interviewed approximately \u0085ve months (wave\n1), 17 months (wave 2) and 41 months (wave 3) after arrival (Cobb-Clark 2001).\nHowever, some variation in the timing of interviews occurred, and as a result\neach individual\u0092s period of residence at time of interview di¤ers. Participants\nare questioned on a wide range of issues including visa type, English language\nability and country of origin, \u0085nancial situation on arrival and employment in\nformer country.\nThe scale of post-war migration to Australia has been large, with nearly\n6 million individuals moving to Australia in the post-war period. Australian\n6For an encompassing review of the dataset, see Cobb-Clark (2001). For a detailed look\nat the technical aspects of the LSIA see the user documentation by the Department of Immi-\ngration and Multicultural and Indegenous A¤airs (DIMIA 2002).\n7\nimmigration policy has changed markedly in the post war period, evolving from\nthe White Australia Policy to one based on the separation of immigrants into\nfamily, skilled and humanitarian groups. The e¤ect this has had on the compo-\nsition of immigrants is re\u0087ected in the declining proportion of ESB immigrants;\nin the period 1959 to 1965, 76 per cent of permanent settler arrivals were ESB\nimmigrants; this had declined to 46 per cent in the period covering 1975 to 1980,\nand decreased further to 28 per cent for the 1990 to 1995 period. (Teicher et\nal. 2002). The rise in the proportion of NESB immigrants into Australia has\nbeen the subject of earlier research. They have experienced a large earnings gap\n(relative to the native population) which does not appear to signi\u0085cantly nar-\nrow over time (McDonald and Worswick 1999) and su¤er higher unemployment\n(Miller and Neo 1997).\nInitially the LSIA covers 5192 primary applicants. Attrition rates decreased\nthe sample to 4469 primary applicants in the second wave and 3752 in the third\nwave, a rate of 28% (Cobb-Clark 2001, DIMIA 2002)7 . DIMIA (2002) could \u0085nd\nno evidence of signi\u0085cant bias in relation to economic activity classi\u0085cation as\na result of attrition from the sample. Furthermore, between waves 1 and 3 the\naverage age of ESB and Asian NESB and Other NESB immigrants increased\nby approximately 3.4, 3.1 and 2.8 years, respectively. Hence, there appears to\nbe little evidence of attrition of speci\u0085c age groups of immigrants across the\nthree categories. We focus on male primary applicants aged between 15 and\n7New Zealand citizens, unilke other nationalities, do not have to apply to migrate to\nAustralia and so are excluded from this sample.\n8\n64 years8 . This reduces the initial sample size to 2879 individuals. Of these\n1190 were wage or salary earners in wave 1, with corresponding \u0085gures of 1385\nand 1317 in waves 2 and 3 respectively. We further exclude individuals holding\nmultiple jobs and a handful of individuals due to incomplete responses for key\nvariables, this provides us with an initial (wave 1) sample of 1069 (330 ESB,\n363 Asian NESB, and 376 Other NESB).\nINSERT TABLE 1\nFirst we want to identify if an immigrant occupational gap exists in Aus-\ntralia. Table 1 presents data on the distribution of educational quali\u0085cations\nand occupations of both the immigrant and native population. ESB immigrants\nhave the highest quali\u0085cation level, with 50% of those in employment having\na tertiary quali\u0085cation or higher. However, the Asian NESB \u0085gure for tertiary\nquali\u0085ed is comparable with the ESB \u0085gure at 48.9% while for Other NESB\nthe \u0085gure is 38.3%. For all immigrant groups this compares favourably with\nthe native population where those with tertiary quali\u0085cations account for only\nabout 17% of those in employment. By contrast nearly 50% of the native popu-\nlation have only completed compulsory schooling; for Other NESB immigrants\nthe comparable \u0085gure is 29% and for Asian NESB and ESB immigrants it is\n20% and 7% respectively. If we compare the distribution across occupations, we\nobserve that approximately 27% of the native population are in managerial and\nprofessional occupations and 15% in elementary service or labouring work. For\nimmigrants from Asian and Other NESB backgrounds the \u0085gures are 33.4% and\n8 Immigrant women are often tied-movers who enter into occupations to supplement family\nincome (Frank, 1978; Worswick, 1996).\n9\n29% for managerial and professional work and 20% and 24.5% for elementary\nservice and labouring work. ESB \u0085gures are 56% in managerial and professional\nand 6.5% in elementary service and labouring work. Thus, at \u0085rst glance, it does\nappear that in the case of NESB immigrants there is an occupational gap, but\nit is less clear that ESB migrants experience an occupational gap compared to\nthe native population.\nTable 2 presents sample averages of the characteristics of the three immigrant\ngroups9 . A full description of all variables is provided in the appendix (Table\nA2). Brie\u0087y, a greater proportion of ESB immigrants enter as Business\/ENS\nvisa holders compared to NESB immigrants, and they have higher average years\nof education and are on average older. Other NESB immigrants were most likely\nto enter under non-skilled assessed visas, while Asian NESB immigrants are most\nlikely to enter under either Concessional Family or Independent Skilled visas.\nESB immigrants were substantially more likely to have visited Australia before\nsettlement, to have a car and to have funds on arrival. Only a small proportion\nof NESB immigrants reported English as their primary language.\n9For comparison sample averages for all male immigrants aged 15-64 are included as ap-\npendix Table A1.\n10\n3 METHODOLOGY\n3.1 Incidence of Overeducation\nTo measure overeducation we use job analysis data to determine the occupa-\ntional requirements of jobs10 . For each immigrant the occupation code of their\njobs was recorded using the 1996 Australian Standard Classi\u0085cation of Occu-\npation (ASCO) codes (ABS 1997), which is similar to the Dictionary of Occu-\npational Titles (DOT) in the United States. ASCO provides a detailed list of\nminimum required quali\u0085cations to undertake a particular job. This information\ncan be compared to the education quali\u0085cations of the immigrant, and if these\nquali\u0085cations exceed the job requirements as stated this individual is de\u0085ned as\nbeing overeducated (Oi = 1), otherwise they are not overeducated (Oi = 0).\nA measure of the extent of overeducation can also be derived using this\napproach. This is done by decomposing an employed individual\u0092s education into\nthat level which is required for the job (according to ASCO), and the amount of\neducation that is surplus to the requirements of the job. For instance, consider\nthe case of an immigrant who has a degree level quali\u0085cation (in e¤ect 15 years\nof schooling) but is employed in a job which only requires high school level\neducation (12 years of schooling). In this case, the required schooling is 12\nyears, whilst the surplus education is 3 years (individuals education level minus\nthe job requirements). These measures are used later in the earnings regressions\nto calculate the wage premium paid to surplus education.\n10Also known as the objective measure of overeducation. See Hartog (2000) for more details.\n11\nFor any period t the underlying probability of being overeducated.(O\u0003it) is\nunobservable, instead we observe a dummy variable (Oit) de\u0085ned as:\nOit = 1 if O\u0003it > 0\nOit = 0 otherwise\nThe probability of an immigrant being overeducated can be viewed as a\nfunction of personal characteristics (Xi) and also the visa category (Vi):\nPr(O\u0003it) = \f0 + \f1Xi + \f2Vi + \u001dit; t = 1; 2; 3 (1)\nEquation (1) is estimated using a random e¤ects probit, where the error\nterm consists of two components such that:\n\u001dit = \"it + \u001bi\n\"it is a standard stochastic error term and \u001bi is a random e¤ects variable. An\nassumption underlying the random e¤ects model is that the individual speci\u0085c\ncomponent of the error term is uncorrelated with the independent variables. An\nalternative which overcomes this assumption is \u0085xed e¤ects estimation whereby\na time-invariant control is included for each individual. However, in the situation\nwhere there is a limited dependant variable, the number of cross-sectional units\nis large, but there are few time periods this can lead to problems with degrees of\nfreedom and may lead to inconsistent estimates of parameters (Maddala 1987).\nAdditionally, in a \u0085xed e¤ects approach, estimates of all time invariant covari-\nates are subsumed in the individual speci\u0085c e¤ect. As a result the impact of\n12\nvisa-category and source country on overeducation would be indeterminate. In\nthe empirical work, we compare the random e¤ects results to those from a pooled\nOLS regression.\nWhilst some of the covariates used are standard (for instance English lan-\nguage skills and marital status), the novel nature of the LSIA allows us to include\na number of less typical covariates. These are brie\u0087y discussed below. We can\nidentify whether the immigrant was employed in his source country and whether\nthat job was a managerial and\/or professional job. In addition, we include a\nvariable \u0092No Funds on Arrival\u0092. Immigrants who face liquidity constraints may\nbe forced to accept jobs for which they are overeducated. Likewise, immigrants\nwithout access to a privately owned motor vehicle may also be \u0085nancially con-\nstrained 11 . Hence, we include a variable - No Car. A control is also included for\nwhether the individual had visited Australia prior to immigration (Never Vis-\nited Australia), which may provide an indication of knowledge of the Australian\nlabour market or previous contact with Australian employers.\nImmigrants enter with quali\u0085cations from a large variety of educational sys-\ntem and some of these will be of the same standard to the equivalent quali\u0085cation\nin Australia. Others may nominally be of the same standard but be of a lower\ncontent and\/or quality (Friedberg 2000). Assessment may improve the recogni-\ntion of quali\u0085cations in the Australian labour market. Not all immigrants who\nentered under Independent Skilled visas were required to submit their quali\u0085ca-\ntions for assessment by Australian authorities. As a result, we have individuals\n11Employment prospects for ethnic minorities in the UK appear to be closely related to\naccess to transport (Battu and Sloane 2002, 2004).\n13\nwith assessed and non-assessed quali\u0085cations across all visa categories. In our\nsample, Asian immigrants (40%) were slightly more likely to have had their\nquali\u0085cations assessed than ESB immigrants (36%) or Other NESB immigrants\n(27%). The proportions by visa category who have their quali\u0085cations assessed\nare similar across immigrant groups, with those on Independent Skilled visas\nhaving the highest proportions (approximately 70%) and those on Preferential\nFamily and Humanitarian visas the lowest (13%). In the subsequent empirical\nwork we control for individuals who have had their quali\u0085cations assessed.\n3.2 Earnings\nEarnings are estimated using a standard human capital framework (Battu et\nal. 1999, Battu et al. 2000, Rubb 2003, Frenette 2004):\nlnYit = \f0 + \f1Srit + \f2Ssit + \f3Xi + \u001dit; t = 1; 2; 3 (2)\nWe estimate equation (2) by random e¤ects OLS, where the error term consists\nof two components such that:\n\u001dit = \"it + \u001bi\nln Y it is the natural log of weekly wages from employment for the ith indi-\nvidual at period t. In the LSIA wages are reported as a categorical variable12 .\nFrom this data we computed midpoint estimates of weekly wages. In unreported\n12These wage categories are 1-57, 58-96, 97-154, 155-230, 231-308, 309-385, 386-481, 482-\n577, 578-673, 674-769, 770-961, 962 and more. Hours worked are only available as a categorical\nvariable. As a result, we cannot accurately compute hourly wages.\n14\nestimations, no signi\u0085cant di¤erence was found between covariate estimates gen-\nerated by OLS and those generated by grouped data maximum likelihood esti-\nmation (Stewart 1983). As a result, we report only the OLS estimates.\nThe coe¢ cient \f1 measures the return to required education (Sr) whilst\n\f2 measures the returns to surplus education (Ss). On the basis of existing\nresearch we expect positive returns to both required and surplus schooling, but\nalso expect that \f2 <\f1 (Cohn and Khan 1995, Hartog 2000): Xi is a vector\nof individual covariates, which includes some of those used in equation 1 but\nalso includes a variable identifying weeks since arrival. We do not observe the\nactual length of time in employment for each immigrant only time since arrival\nin Australia.\n4 Results\n4.1 Preliminary Evidence\nINSERT TABLE 3\nTable 3 presents the incidence of overeducation across each LSIA wave by\nsource region and visa category. ESB immigrants are the best matched, whilst\nAsian NESB immigrants have the highest rate of overeducation. Some variation\nin the incidence of overeducation is apparent across the waves. ESB immi-\ngrants initially experience a rise in the rate of overeducation, but this rise is\nmore than reversed by wave 3. For both NESB groups, the rate of overeduca-\ntion amongst those who are employed appears to rise over the sample period.\n15\nImmigrant overeducation rates appear very high when compared to the native\npopulation, where the rate was 7.5%13 . This lower rate is a¤ected by the much\nlarger proportion of individuals in the census who have only minimum school\nquali\u0085cations and so cannot be overeducated14 . For further evidence, we can\ncompare immigrants with tertiary quali\u0085cations (degree and higher) with the\nsame group from the native population. In this case, the di¤erence becomes less\nmarked. The census \u0085gure for male employees with graduate quali\u0085cations was\n21%, whilst the \u0085gures for graduate immigrants ranged from 12% for ESB, to\n40% for Other NESB and 38% for Asian NESB immigrants. Thus, NESB im-\nmigrants with tertiary education were subject to higher rates of overeducation\nthan the native population. Earlier we noted that there are a greater proportion\nof NESB immigrants with tertiary quali\u0085cations.\nThe table also illustrates that visa categories a¤ect the incidence of overe-\nducation. For all immigrants, those on Business\/ENS visas have the lowest\nincidence of overeducation. Concessional Family visas are associated with the\nhighest rates of overeducation for NESB immigrants; the incidence of overedu-\ncation for Asian NESB immigrants on Concessional Family visas is particularly\nlarge (54%). A priori expectations are that those on visas that are not as-\nsessed for skills would have higher rates of overeducation. ENS visa holders are\nemployer nominated so the \u0085nding that Business\/ENS visa holders attract low\n13 In a previous study, using a di¤erent measure of overeducation, Flatau et al. (1995) found\nthe incidence of overeducation for the Australian born working population to be 11% in 1990-\n91. Hence, the incidence of overeducation amongst Australian born workers in the early and\nmid-1990s were lower than in \u0085ndings in other countries.\n14 In the ASCO job requirements no occupation requires lower than school level\nquali\u0085cations.\n16\nrates of overeducation is not surprising. Interestingly, Independent Skilled visa\nholders have substantial rates of overeducation for all groups.\nINSERT TABLE 4\nLooking at the average weekly wages in Table 4, it is clear that ESB im-\nmigrants earn markedly more than their NESB counterparts. Moreover, NESB\nimmigrants\u0092weekly wages do not catch up with ESB immigrants over the three\nyear period, consistent with earlier evidence on relative wages of immigrants\nfrom these regions (McDonald and Worswick 1999). When compared to native\nearnings, ESB immigrants earn more and NESB immigrants earn less. Again\nit is interesting to compare earnings of tertiary quali\u0085ed workers to see if the\nskill premium di¤ers across immigrants and native population. We observe\nin the lower section of Table 4 that the gap between native and immigrant\nearnings of tertiary quali\u0085ed employees is larger compared to the earnings gap\nbetween native and immigrants as a whole. However, the earnings of tertiary\neducated NESB immigrants increased rather more than tertiary educated ESB\nimmigrants over the same period.\n4.2 Determinants of Overeducation\nINSERT TABLE 5\nTable 5 presents the probit estimates of equation (1) for immigrants from\nthe three regions. To aid interpretation the covariate estimates are reported as\nmarginal e¤ects. As suggested by Table 3, all of the visa categories (except-\ning Asian NESBs on Humanitarian visas) are associated with a signi\u0085cantly\n17\ngreater incidence of overeducation when compared to the omitted category of\nBusiness\/ENS visa. However, after introducing controls for immigrant charac-\nteristics the relative di¤erences between visa categories change. For instance,\nthe impact on overeducation of being an Asian NESB immigrant on an Indepen-\ndent Skilled visa appears to be lower than that suggested by the unconditional\nmeans. This group may be under-represented with respect to the characteristics\nthat increase the risk of overeducation. Conversely, Other NESB immigrants on\nHumanitarian visas seem at greater risk of overeducation once characteristics\nare controlled for.\nThe e¤ects of age di¤er between ESB and NESB groups. For the former\novereducation decreases with age at a diminishing rate. In contrast, overeduca-\ntion increases with age at a diminishing rate for NESB immigrants. This could\nbe consistent with the hypothesis that there are greater di¢ culties for the latter\ngroup in getting their experience recognised in the Australian labour market.\nCanadian and American immigrants appear to face the least likelihood of being\novereducated of any country group, which could be indicative of the relative\nresourcing of educational systems. Being in a managerial or professional job\nprior to emigrating reduces the risk of overeducation, though this is not sig-\nni\u0085cant for Other NESB immigrants. Looking at the other covariates, lack of\nfunds on arrival only appears to a¤ect the incidence of overeducation for Asian\nNESB immigrants. No access to a private motor vehicle has at most a mar-\nginal positive impact on overeducation incidence for Other NESB immigrants.\nSpeaking a primary language other than English only appears to signi\u0085cantly\n18\na¤ect overeducation for Asian NESB immigrants. Part time NESB workers are\nmore likely to be overeducated.\nThe impact of quali\u0085cation assessment on overeducation appears perverse\nfor Other NESB immigrants. To investigate this further we distinguish between\nthose who had their quali\u0085cation assessment completed before the initial inter-\nview and those who completed their assessment at a later stage. The rationale\nfor this distinction is that immigrants who are experiencing labour market dif-\n\u0085culties are more likely to pursue later assessment. For example, two-thirds of\nOther NESB immigrants in our sample who did not pursue assessment stated\nthat this was because they did not require assessment for the purposes of employ-\nment 15 . Equation (1) was re-estimated with separate covariates for quali\u0085cation\nassessment prior to \u0085rst interview and assessment after \u0085rst interview. There\nis no statistically signi\u0085cant relationship between assessment prior to the \u0085rst\ninterview and overeducation, whilst the relationship between post immigration\nassessment and overeducation is 0.05 but not quite signi\u0085cant (T-Stat = 1.54).\nOf course, this result may merely re\u0087ect endogeneity between overeducation and\nquali\u0085cation assessment. In this case, individuals who have a greater incidence\nof overeducation are more likely to subsequently seek assessment. Whilst there\nis some correlation an immigrant having their quali\u0085cation assessed and be-\ning overeducated in the previous period, it is not particularly large (correlation\ncoe¢ cient = 0.09).\nFinally, estimation by pooled OLS (not reported) produced very similar re-\n15Speci\u0085cally, they answered that quali\u0085cation assessment was not required becuase the\nquali\u0085cation readily accepted by employer or it was not necessary to get the job (DIMIA 2002).\n19\nsults. In particular, the impact of visa categories, age and managerial\/professional\nwork in former country on overeducation was unaltered.\n4.3 Earnings\nINSERT TABLE 6\nTable 6 presents the estimates of the log weekly wage equations. Columns\ntwo to four present estimates for immigrants and estimates of education returns\nfor the native population are presented at the bottom of the table16 . For all\nimmigrants the return to required education is positive, with ESB immigrants\nexperiencing higher return compared to native born Australians. The Asian\nNESB \u0085gure is comparable to the native born returns with Other NESB immi-\ngrants enjoying the lowest returns. Surplus education earns a premium above\nthe required level but the rate of return is less than that for required education.\nThis is consistent with the stylised facts of overeducation (Hartog 2000, Rubb\n2003, Kler 2005). Thus, an overeducated worker earns less for a given set of\nquali\u0085cations than someone who is appropriately quali\u0085ed for their position.\nReturns to both required and surplus education are lowest for Other NESB\nimmigrants. The returns to surplus education appear largest for the native\npopulation, although this is only marginally higher than for ESB immigrants.\nA lower return to surplus education implies a penalty, in terms of returns to\neducation, for being in a job for which an individual is overeducated. Recall\n16Covariates used in the census equations include potential experience and its squared term,\nand identi\u0085ers for NESB, Aboriginal and Torres Straits Islander background (indigenous pop-\nulation), marital status, state of residence, sector of employment, \u0085eld of tertiary study,\npart-time employment and overtime hours.\n20\nthat NESB immigrants have substantially higher rates of overeducation than\nboth ESB immigrants and the native born population. When combined with\nthe lower return to surplus education this suggests that NESB immigrants skills\nreceive a poorer return in Australia than ESB immigrants and the native pop-\nulation. This appears to be borne out by the overall earnings \u0085gures in Table\n4. Hence the occupational gap means a reduced return to human capital and\nso the contribution from better quali\u0085ed immigrants to productive capacity is\nreduced.\nLooking at the other covariates we \u0085nd that having a managerial or pro-\nfessional job prior to emigrating clearly aids individuals both through avoiding\novereducation, as we saw earlier, and in obtaining higher earnings. However, the\ngain from prior work experience can be o¤set in the case of NESB immigrants\nfor whom English is not their primary language. Age e¤ects for ESB and Other\nNESB immigrants display a typical age-earnings concave pro\u0085le, though the\nformer group exhibits stronger earnings returns to age. However, Asian NESB\nimmigrant earnings are not signi\u0085cantly a¤ected by age, which could imply\nthat prior experience is not valued in the same way for this group in Australia.\nBy contrast, weeks since arrival in Australia is positively associated with weekly\nwages for all immigrant groups. Pooled OLS regression estimates (not reported)\nproduced the same pattern of signi\u0085cance as the results presented in Table 6,\nwith the exception that for Asian NESB immigrants having a managerial or\nprofessional job in the source country where this variable became insigni\u0085cant.\n21\n4.4 Sensitivity Tests\nIn this section we present regression results for immigrants who entered on\nIndependent Skilled visas. There are two reasons to select this group. Firstly,\nwe are interested in how skilled immigrants impact on local labour markets and\ncontribute to productivity. Secondly, it is well known that estimates of returns\nto education could be downwardly biased if there is a positive sorting in the\nimmigration process (Butcher 1994). This occurs if the immigration process\nself-selects such that immigrants have better unobservable characteristics and\nskills than the overall population of the source country. Moreover, any bias,\nif present, intensi\u0085es with lower levels of schooling. Those who enter under\nIndependent Skilled visas are selected in part based on their quali\u0085cations and\nas a result have higher average schooling levels. As a result, we would expect\nestimates of ther returns to education should su¤er from less bias than other\nimmigrant visa groups.\nIn Table 7 we present estimates for the determinants of overeducation in the\nsecond column for this group. The major di¤erence in these results and those in\nTable 5 is that age has no e¤ect on incidence of overeducation for Independent\nSkilled visa holders. This is an outcome of the selection criteria, where age\ncan count against an immigrant by earning fewer points. The age distribution\nfor this group ranges from 22 - 49 years. Hence, there is a truncation in the\ndistribution that diminishes the impact of age. As before, coming from Europe\nor North America reduces the chance of being overeducated, as does holding a\nmanagerial or professional job in the former country.\n22\nFor the earnings regression (column 3) we note that required schooling es-\ntimates are comparable to those of the native population (prime age) (Table\n6). However, the return to surplus education is insigni\u0085cant. This seems to\nsuggest that there is a considerable penalty for overeducation for this group. To\ninvestigate this further we disaggregated Independent Skilled visa immigrants\ninto the three regional groups and ran separate regressions. For Asian NESB\nimmigrants the surplus education coe¢ cient was positive (0.03) and signi\u0085cant\nat the 5% level. For ESB and Other NESB the surplus education coe¢ cient was\nsmall (0.02, 0.005) and insigni\u0085cant. Thus, it is these latter two groups who\nsu¤er the large penalty in the form of no return to surplus education.\n5 Conclusion\nThis paper examined the extent to which immigrants entering Australia utilised\ntheir quali\u0085cations in the labour market. There was evidence of an occupational\ngap for NESB immigrants. They were better educated than the native born pop-\nulation but were relatively less likely to be found in managerial and professional\noccupations and were over represented in unskilled work. This occupational gap\ntranslated into higher overeducation rates for NESB immigrants, between 80%\nto 100% higher than those experienced by ESB immigrants. Additionally, even\nNESB immigrants with tertiary quali\u0085cations experienced higher rates of overe-\nducation than the native population. Moreover, NESB immigrants experienced\nlower returns to both required and surplus education than ESB immigrants.\n23\nInterestingly, roughly 30% who entered under Independent Skilled visas were\novereducated irrespective of country of origin. Thus, skill based immigration\npolicies appear to create an under-utilisation of skills, even though it appears\nto have lead to an improvement in immigrant employment in Australia (Cobb-\nClark 2003). Hence, there may be some shortfall in the productivity gain that\ncould be expected from these policies. Moreover, in common with earlier re-\nsearch investigating returns to immigrant education in the U.S. (Bratsberg and\nTerell 2002) it was found that coming from a European or North American back-\nground leads to better outcomes in terms of increased returns to education and\nthis seems linked to the reduced incidence of overeducation that Independent\nSkilled visa holders from these countries experience. Countries that develop\nimmigration policies based upon skill criteria, who attract immigrants from\nheterogenous backgrounds, should not expect that the productivity potential\nof these immigrants will be fully utilised unless their entry is linked to a job\no¤er from an employer in the country. Hence, expansion of visa schemes where\npotential immigrants are nominated by employers in the recipient country are\na means of increasing skill utilisation in the early phase of immigration.\n6 Appendix\nINSERT TABLE A1\nINSERT TABLE A2\n24\nREFERENCES\nAntecol, H., Cobb-Clark, D. A., & Trejo, S. J. (2003). Immigration policy and\nthe skills of migrants to Australia, Canada, and the United States. Journal\nof Human Resources 16 (4), 192-218.\nAustralian Bureau of Statistics (1997). Australian standard classi\u0085cation of oc-\ncupations. 2nd Edition, Cat. No. 1220.0. Canberra, AGPS.\nBarrett, A., FitzGerald, J., & Nolan, B. (2002). Earnings inequality, returns to\neducation and immigration into Ireland. Labour Economics 9, 665-680.\nBarrett, A., Bergin, A., & Du¤y, D. (2005). The labour market characteristics\nand labour market impacts of immigrants in Ireland. IZA Discussion Paper\nNo. 1553, Bonn, IZA.\nBattu, H., Bel\u0085eld, C. R., & Sloane, P. J. (1999). Overeducation among gradu-\nates: A cohort view. Education Economics 7, 21-38.\nBattu, H., Bel\u0085eld, C. R., & Sloane, P. J. (2000). How well can we measure\novereducation and its e¤ects? National Institute Economic Review 171, 82-\n93.\nBattu, H., & Sloane, P. J. (2002). To what extent are ethnic minorities in Britain\novereducated?. International Journal of Manpower 23, 192-208.\nBattu, H., & Sloane, P. J. (2004). Overeducation and ethnic minorities in\nBritain. Manchester School 72, 535-559.\n25\nBratsberg, B., & Terrell, D. (2002). School quality and returns to education of\nU.S. immigrants. Economic Inquiry 40, 177-198.\nButcher, K. F. (1994). Black immigrants in the United States: A comparison\nwith native Blacks and other immigrants. Industrial and Labor Relations Re-\nview 47, 265-284.\nChevalier, A. (2003). Measuring over-education. Economica 70, 509-531.\nCobb-Clark, D. A. (2000). Do selection criteria make a di¤erence? Visa category\nand the labour market status of immigrants to Australia. Economic Record\n76, 15-31.\nCobb-Clark, D. A. (2001). The longitudinal survey of immigrants to Australia.\nAustralian Economic Review 34, 467-77.\nCobb-Clark, D. A. (2003). Public policy and the labor market adjustment of\nnew immigrants to Australia. Journal of Population Economics 16, 655-681.\nCohn, E. & Khan, S.P. (1995) The wage e¤ects of overschooling revisited. Labour\nEconomics 2 (1), 67-76.\nDepartment of Immigration and Multicultural and Indigenous A¤airs (1996).\nClassi\u0085cation of countries into English pro\u0085ciency groups. Canberra, AGPS.\nDepartment of Immigration and Multicultural and Indigenous A¤airs (1999).\nSettler arrivals 1998-1999. Canberra, AGPS.\nDepartment of Immigration and Multicultural and Indigenous A¤airs (2002).\nLongitudinal survey of immigrants to Australia (LSIA) User documentation.\n26\nDolton, P. J., & Vignoles, A. (2000). The incidence and e¤ects of overeducation\nin the UK graduate labour market. Economics of Education Review 19 (2),\n179-98.\nFlatau, P., Petridis, R., & Wood, G. (1995). Immigrants and invisible underem-\nployment. Canberra, AGPS.\nFrank, R. H. (1978). Why women earn less: The theory and estimation of\ndi¤erential overquali\u0085cation. American Economic Review 68, 360-72.\nFrenette, M. (2004). The overquali\u0085ed Canadian graduate: the role of the acad-\nemic program in the incidence, persistence, and economic returns to overqual-\ni\u0085cation. Economics of Education Review 23 (1), 29-45.\nFriedberg, R. M. (2000). You can\u0092t take it with you? Immigrant assimilation and\nthe portability of human capital. Journal of Labour Economics 18, 221-251.\nHartog, J. (2000). Over-education and earnings: where are we, where should we\ngo? Economics of Education Review 19 (2), 131-47.\nKler, P. (2005). Graduate overeducation in Australia: A comparison of the mean\nand objective methods. Education Economics 13 (1), 47-72.\nMaddala, G. (1987) Limited dependent variable models using panel data. Joun-\nral of Human Resouces 22, 307-338.\nMcDonald, J. T., & Worswick, C. (1999). The earnings of immigrant men in\nAustralia: Assimilation, cohort e¤ects, and macroeconomic conditions. Eco-\nnomic Record 75, 49-62.\n27\nMiller, P. W. (1999). Immigration policy and immigrant quality: The Australian\npoints system. American Economic Association Papers and Proceedings 89,\n192-197.\nMiller, P. W., & Neo, L. (1997). Immigrant unemployment: The Australian\nexperience. International Migration 35, 155-185.\nRubb, S. (2003). Overeducation: a short or long run phenomenon for individu-\nals? Economics of Education Review 22 (4), 389-394.\nStewart, M. (1983). On least squares estimation when the dependent variable is\ngrouped. Review of Economic Studies 50,. 737-53.\nTeicher, J., Shah, C., & Gri¢ n, G. (2002). Australian immigration: the triumph\nof economics over prejudice?. International Journal of Manpower 23, 209-236.\nWorswick, C. (1996). Immigrant families in the Canadian labour market. Cana-\ndian Public Policy 22,. 378-396.\n28\nTable 1: Quali\u0085cation and Occupation Structure - Employed Males17\nImmigrant Native Born\nESB Asian Other Prime-Age Overall\nQuali\u0085cation\nMasters and Ph.Ds. 24.00% 14.64% 14.49% 2.73% 2.26%\nPost-Graduate Diplomas 7.58% 4.28% 5.68% 2.33% 1.85%\nDegrees 18.37% 28.70% 18.14% 12.99% 11.62%\nDiplomas and Vocational Qual. 26.64% 18.50% 20.83% 37.54% 34.10%\nNo Post-School Qual. 6.89% 20.23% 28.99% 44.41% 50.17%\nOccupation\nManagement 15.73% 6.25% 4.52% 13.44% 11.49%\nProfessional 40.07% 27.145 24.33% 17.36% 15.37%\nAssociate Professional 7.58% 4.28% 4.52% 13.81% 12.42%\nTrade 18.83% 23.60% 23.38% 19.21% 21.32%\nAdvanced Services 0.11% 0.07% 0.97% 1.01%\nIntermediate Services 7.12% 5.59% 5.39% 10.06% 10.26%\nIntermediate Production 4.13% 13.40% 13.40% 13.12% 13.32%\nElementary Services 3.79% 4.03% 4.59% 4.28% 5.52%\nLabourer 2.76% 15.79% 19.81% 7.75% 9.30%\n17Source: LSIA, 1996 Census.\n29\nTable 2: Summary Statistics - Employed Males\nVariables ESB ASIAN OTHER\nAge 34.52 32.99 31.37\nYears of Schooling 14.67 13.86 13.57\nQuali\u0085cations Assessed 0.36 0.40 0.27\nAustralian Quali\u0085cations 0.01 0.10 0.03\nNot Married 0.28 0.31 0.29\nNever Visited Australia 0.25 0.59 0.52\nNo Funds on Arrival 0.07 0.25 0.24\nNo Car 0.10 0.28 0.26\nMgmt \/ Prof.Jobs in FC 0.47 0.36 0.35\nPrimary Language - Not English - 0.78 0.80\nVisa - Humanitarian - 0.04 0.06\nVisa - Preferential Family 0.14 0.20 0.43\nVisa - Concessional Family 0.22 0.28 0.16\nVisa - Independent Skilled 0.26 0.31 0.22\nVisa - Business\/ENS 0.38 0.17 0.14\nIndividuals 330 363 376\n30\nTable 3: Incidences of Male Overeducation18\nImmigrant Native-Born\nESB Asian Other Prime-Age Overall\nWave 1 21.21% 31.96% 30.85%\nWave 2 27.57% 38.69% 33.00%\nWave 3 19.17% 38.68% 34.60%\nCensus 96 7.29% 7.42%\nVisa Category\nBus\/ENS 6.73% 11.61% 11.53%\nInd Skilled 31.17% 33.51% 30.515\nConc Family 32.61% 53.48% 44.44%\nPref Family 34.88% 38.57% 35.96%\nHumanitarian 22.34% 36.31%\n18Source: LSIA, 1996 Census.\n31\nTable 4: Average Weekly Wages - Male Wage and Salary Earners19\nImmigrant Native Born\nESB Asian Other Prime-Age Overall\nWave 1 $778.93 $536.30 $547.68\nWave 2 $819.34 $569.97 $564.70\nWave 3 $886.16 $637.85 $640.26\nCensus 96 $736.65 $666.58\nTertiary Educated\nWave 1 $901.55 $659.78 $694.65\nWave 2 $924.93 $686.34 $719.68\nWave 3 $975.56 $761.83 $761.52\nCensus 96 $1,020.11 $977.14\n19Source: LSIA, 1996 Census.\n32\nTable 5: Determinants of Male Immigrant Overeducation20\nVariables ESB ASIAN OTHER\nUnemployment Rate 0.001 (0.01) -0.017** (0.07) 0.009 (0.01)\nPart-Time 0.035 (0.07) 0.061*** (0.03) 0.092* (0.04)\nQuali\u0085cation Assessed -0.006 (0.04) 0.004 (0.03) 0.071* (0.03)\nAustralian Quali\u0085cations -0.064 (0.14) -0.068 (0.04) 0.062 (0.07)\nNot Married 0.067 (0.04) 0.082* (0.02) -0.031 (0.03)\nNever Visited Australia -0.016 (0.04) -0.011 (0.03) 0.017 (0.04)\nNo Funds on Arrival 0.041 (0.08) 0.133* (0.03) -0.057*** (0.03)\nNo Car -0.018 (0.05) 0.027 (0.03) 0.058*** (0.03)\nMgmt \/ Prof.Jobs in FC -0.130* (0.04) -0.094* (0.03) -0.008 (0.03)\nAge -0.036** (0.02) 0.037* (0.01) 0.033** (0.01)\nAge Squared 0.0004** (0.0002) -0.0004** (0.0002) -0.0004** (0.0002)\nPrimary Language - Not English - 0.096* (0.02) 0.034 (0.03)\nCanadian or American -0.112** (0.05) - -\nSouth African or Zimbabwean -0.070 (0.04) - -\nNorth East Asian - -0.052 (0.03) -\nCentral or South Asian - -0.009 (0.03) -\nEuropean - - -0.030 (0.04)\nRest of Other NESB Immigrants - - 0.041 (0.04)\nVisa - Humanitarian - 0.003 (0.06) 0.509* (0.06)\nVisa - Preferential Family 0.185* (0.07) 0.312* (0.06) 0.430* (0.05)\nVisa - Concessional Family 0.221* (0.06) 0.361* (0.05) 0.497* (0.06)\nVisa - Independent Skilled 0.166* (0.06) 0.265* (0.05) 0.347* (0.08)\n\u001a 0.72 (0.06) 0.89 (0.03) 0.95 (0.01)\nObs. 871 1216 1373\nIndividuals 386 596 735\nWald chi2 46.92 84.24 58.63\nProb > chi2 0.0001 0 0\nProb (chibar) 0 0 0\nLog-likelihood -348.68 -571.15 -600.81\n20Estimates are marginal e¤ects reported at the sample means.\n* 1% level of signi\u0085cance, ** 5% level of signi\u0085cance,*** 10% level of signi\u0085cance. Standard\nerrors in parentheses.\nOmitted categories are Working Full-time, Quali\u0085cations Not Assessed, Foreign Obtained\nQuali\u0085cations, Married, Visited Australia Prior to Immigrating, Had Funds on Arrival, Have\nAccess to a Private Motor Vehicle, Not Employed in a Managerial or Professional Job in For-\nmer Country, Primary Language - English and Visa - Business\/ENS. For regional dummies,\ncoming from the UK and Ireland, South East Asia, and from North Africa and the Middle\nEast are the omitted cases for ESB, Asian NESB and Other NESB immigrants, respectively.\n33\nTable 6: Male Log Weekly Wage Earnings21\nImmigrants\nVariables ESB ASIAN OTHER\nRequired Schooling 0.115* (0.01) 0.104* (0.01) 0.085* (0.01)\nSurplus Schooling 0.0519* (0.01) 0.049* (0.01) 0.024** (0.01)\nWeeks Since Arrival 0.0007* (0.00) 0.0014* (0.000) 0.0012* (0.00)\nPart-Time -0.324* (0.05) -0.544* (0.04) -0.870* (0.04)\nNot Married -0.064*** (0.03) -0.080** (0.04) 0.068** (0.03)\nNever Visited Australia -0.084* (0.03) -0.087** (0.04) -0.108* (0.03)\nNo Funds on Arrival -0.102*** (0.06) -0.072*** (0.04) -0.110* (0.03)\nNo Car 0.001 (0.04) -0.052*** (0.03) -0.028 (0.03)\nMgmt \/ Prof.Jobs in FC 0.091* (0.03) 0.078** (0.04) 0.098* (0.04)\nAge 0.050* (0.01) -0.023 (0.02) 0.026*** (0.01)\nAge Squared -0.0006* (0.0002) 0.0002 (0.0002) -0.0003*** (0.0002)\nPrimary Language - Not English - -0.101* (0.04) -0.106* (0.04)\nCanadian or American -0.004 (0.04) - -\nSouth African or Zimbabwean -0.038 (0.04) - -\nNorth East Asian - 0.004 (0.04) -\nCentral or South Asian - 0.072 (0.04) -\nEuropean - - 0.091** (0.04)\nRest of Other NESB Immigrants - - 0.030 (0.04)\n\u001a 0.57 0.60 0.51\nObs. 871 1216 1373\nIndividuals 386 596 735\nWald chi2 415.57 750.33 1211.68\nProb > chi2 0 0 0\nR2 0.43 0.44 0.52\nNative\nPrime-Age Overall\nRequired Schooling 0.099* (0.00) 0.100* (0.00)\nSurplus Schooling 0.052* (0.00) 0.062* (0.00)\n21Estimates are marginal e¤ects reported at the sample means.\n* 1% level of signi\u0085cance, ** 5% level of signi\u0085cance,*** 10% level of signi\u0085cance. Standard\nerrors in parentheses.\nOmitted categories are Working Full-time, Quali\u0085cations Not Assessed, Foreign Obtained\nQuali\u0085cations, Married, Visited Australia Prior to Immigrating, Had Funds on Arrival, Have\nAccess to a Private Motor Vehicle, Not Employed in a Managerial or Professional Job in For-\nmer Country, Primary Language - English and Visa - Business\/ENS. For regional dummies,\ncoming from the UK and Ireland, South East Asia, and from North Africa and the Middle\nEast are the omitted cases for ESB, Asian NESB and Other NESB immigrants, respectively.\n34\nTable 7: Determinants of Male Immigrant Overeducation and Earnings - Inde-\npendent Skilled Visa Holders 23\nVariables Overeducation Earnings\nUnemployment Rate -0.004 (0.01)\nRequired Schooling 0.107* (0.01)\nSurplus Schooling 0.018 (0.01)\nWeeks since arrival 0.001* (0.00)\nPart-Time 0.120*** (0.06) -0.632* (0.05)\nAustralian Quali\u0085cations -0.123*** (0.07)\nNot Married 0.135*** (0.07) -0.036 (0.03)\nNever Visited Australia 0.037 (0.05) -0.099* (0.03)\nNo Funds on Arrival 0.0542 (0.06) -0.035 (0.04)\nNo Car 0.027 (0.04) -0.041 (0.03)\nMgmt \/ Prof.Jobs in FC -0.158* (0.05) 0.086* (0.03)\nAge 0.056 (0.04) 0.059*** (0.03)\nAge Squared -0.0009 (0.0006) -0.0008*** (0.0004)\nPrimary Language - Not English 0.109** (0.05) -0.065*** (0.04)\nCanadian or American -0.207* (0.06) 0.147 (0.09)\nSouth African or Zimbabwean -0.148*** (0.08) -0.0265 (0.08)\nSouth East Asian -0.014 (0.08) 0.005 (0.06)\nNorth East Asian -0.017** (0.07) -0.114* (0.06)\nCentral or South Asian 0.037 (0.08) -0.086 (0.05)\nNorth African or Middle Eastern -0.039 (0.10) -0.167* (0.07)\nEuropean -0.150** (0.06) -0.0391 (0.06)\nRest of Other NESB Immigrants 0.012 (0.07) -0.110 (0.06)\n\u001a 0.84 (0.04) 0.46(0.00)\nObs. 911 911\nIndividuals 431 431\nWald chi2 42.93 605.42\nProb > chi2 0.00 0.00\nProb (chibar) 0\nLog-likelihood -421.98\nR2 0.45\n23Estimates are marginal e¤ects reported at the sample means.\n* 1% level of signi\u0085cance, ** 5% level of signi\u0085cance,*** 10% level of signi\u0085cance. Standard\nerrors in parentheses.\nOmitted categories are Working Full-time, Married, Visited Australia Prior to Immigrating,\nHad Funds on Arrival, Have Access to a Private Motor Vehicle, Not Employed in a Managerial\nor Professional Job in Former Country, Primary Language - English and coming from the\nUnited Kingdom or Ireland.\n35\nTABLE A1 - Summary Statistics - Males Aged 15-64\nVariables ESB ASIAN OTHER\nAge 35.87 34.89 33.04\nYears of Schooling 14.53 13.39 13.20\nQuali\u0085cations Assessed 0.36 0.33 0.24\nAustralian Quali\u0085cations 0.02 0.08 0.02\nNot Married 0.28 0.29 0.29\nNever Visited Australia 0.23 0.59 0.68\nNo Funds on Arrival 0.06 0.32 0.40\nNo Car 0.09 0.31 0.40\nMgmt \/ Prof.Jobs in FC 0.44 0.34 0.25\nPrimary Language - Not English - 0.84 0.91\nVisa - Humanitarian - 0.15 0.26\nVisa - Preferential Family 0.17 0.19 0.37\nVisa - Concessional Family 0.22 0.26 0.15\nVisa - Independent Skilled 0.25 0.24 0.16\nVisa - Business\/ENS 0.35 0.16 0.06\nIndividuals 457 978 1253\n36\nTABLE A2 - Variable De\u0085nitions\nVariables Description\nAge Continuous variable for age of immigrant.\nYears of Schooling Number of years of study undertaken to obtain educational quali\u0085cations\nRequired Education Level of education required to do a job as indicated by ASCO codes\nSurplus Education Additional years of education of jobholder over what is required to do their job\nVisa Category\nBusiness\/ENS Individual entered under a business or employer nominated scheme visa\nHumanitarian Individual entered under a humanitarian visa\nPreferential Family Individual entered under a preferential family visa\nConcessional Family Individual entered under a concessional family visa\nIndependent Skilled Individual entered under an independent skilled visa\nUnemployment Rate Monthly unemployment rate for the State the immigrant was living in at time of each interview\nWeeks since Arrival Length of time the immigrant has been residing in Australia at time of interview.\nQuali\u0085cation Assessed Individual has had their foreign obtained quali\u0085cation assessed\nAustralian Quali\u0085cations Individual had obtained an Australian quali\u0085cation\nNever Visited Australia Individual had not previously visited prior to immigrating\nNo Funds on Arrival Individual arrived with no funds\nNo Car Individual has access to a privately owned motor vehicle\nMgmt \/ Prof.Jobs in FC Individual employed in Managerial\/Professional level in former country\nwithin the 12 months prior to immigration\nNot Married Individual was not married\nPrimary Language - Not English Main language spoken at home not English.\n37\n"}