{"doi":"10.1007\/s00410-009-0410-9","coreId":"59194","oai":"oai:nora.nerc.ac.uk:8446","identifiers":["oai:nora.nerc.ac.uk:8446","10.1007\/s00410-009-0410-9"],"title":"The petrogenesis of sodic island arc magmas at Savo volcano, Solomon Islands","authors":["Smith, D.J.","Petterson, M.G.","Saunders, A.D.","Millar, I.L.","Jenkin, G.R.T.","Toba, T.","Naden, J.","Cook, J.M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009","abstract":"Savo, Solomon Islands, is a historically active volcano dominated by sodic, alkaline lavas, and pyroclastic rocks with up to 7.5 wt% Na2O, and high Sr, arc-like trace element chemistry. The suite is dominated by mugearites (plagioclase–clinopyroxene–magnetite ± amphibole ± olivine) and trachytes (plagioclase–amphibole–magnetite ± biotite). The presence of hydrous minerals (amphibole, biotite) indicates relatively wet magmas. In such melts, plagioclase is relatively unstable relative to iron oxides and ferromagnesian silicates; it is the latter minerals (particularly hornblende) that dominate cumulate nodules at Savo and drive the chemical differentiation of the suite, with a limited role for plagioclase. This is potentially occurring in a crustal “hot zone”, with major chemical differentiation occurring at depth. Batches of magma ascend periodically, where they are subject to decompression, water saturation and further cooling, resulting in closed-system crystallisation of plagioclase, and ultimately the production of sodic, crystal and feldspar-rich, high-Sr rocks. The sodic and hydrous nature of the parental magmas is interpreted to be the result of partial melting of metasomatised mantle, but radiogenic isotope data (Pb, Sr, Nd) cannot uniquely identify the source of the metasomatic agent.\\ud\n\\ud\nElectronic supplementary material  The online version of this article (doi:10.1007\/s00410-009-0410-9) contains supplementary material, which is available to authorized users","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/59194.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/8446\/1\/Savo_CMP.pdf","pdfHashValue":"028f0545a112c9bbb37aee792f1c509ddb098260","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:8446<\/identifier><datestamp>\n      2012-11-22T12:05:15Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8446\/<\/dc:relation><dc:title>\n        The petrogenesis of sodic island arc magmas at Savo volcano, Solomon Islands<\/dc:title><dc:creator>\n        Smith, D.J.<\/dc:creator><dc:creator>\n        Petterson, M.G.<\/dc:creator><dc:creator>\n        Saunders, A.D.<\/dc:creator><dc:creator>\n        Millar, I.L.<\/dc:creator><dc:creator>\n        Jenkin, G.R.T.<\/dc:creator><dc:creator>\n        Toba, T.<\/dc:creator><dc:creator>\n        Naden, J.<\/dc:creator><dc:creator>\n        Cook, J.M.<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        Savo, Solomon Islands, is a historically active volcano dominated by sodic, alkaline lavas, and pyroclastic rocks with up to 7.5 wt% Na2O, and high Sr, arc-like trace element chemistry. The suite is dominated by mugearites (plagioclase–clinopyroxene–magnetite ± amphibole ± olivine) and trachytes (plagioclase–amphibole–magnetite ± biotite). The presence of hydrous minerals (amphibole, biotite) indicates relatively wet magmas. In such melts, plagioclase is relatively unstable relative to iron oxides and ferromagnesian silicates; it is the latter minerals (particularly hornblende) that dominate cumulate nodules at Savo and drive the chemical differentiation of the suite, with a limited role for plagioclase. This is potentially occurring in a crustal “hot zone”, with major chemical differentiation occurring at depth. Batches of magma ascend periodically, where they are subject to decompression, water saturation and further cooling, resulting in closed-system crystallisation of plagioclase, and ultimately the production of sodic, crystal and feldspar-rich, high-Sr rocks. The sodic and hydrous nature of the parental magmas is interpreted to be the result of partial melting of metasomatised mantle, but radiogenic isotope data (Pb, Sr, Nd) cannot uniquely identify the source of the metasomatic agent.\\ud\n\\ud\nElectronic supplementary material  The online version of this article (doi:10.1007\/s00410-009-0410-9) contains supplementary material, which is available to authorized users.<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2009<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8446\/1\/Savo_CMP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Smith, D.J.; Petterson, M.G.; Saunders, A.D.; Millar, I.L.; Jenkin, G.R.T.; Toba, T.; Naden, J.; Cook, J.M..  2009  The petrogenesis of sodic island arc magmas at Savo volcano, Solomon Islands.   Contributions to Mineralogy and Petrology, 158 (6). 785-801.  https:\/\/doi.org\/10.1007\/s00410-009-0410-9 <https:\/\/doi.org\/10.1007\/s00410-009-0410-9>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/content\/100406\/<\/dc:relation><dc:relation>\n        10.1007\/s00410-009-0410-9<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/8446\/","http:\/\/www.springerlink.com\/content\/100406\/","10.1007\/s00410-009-0410-9"],"year":2009,"topics":["Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"1 \nThe petrogenesis of sodic island arc magmas at Savo \nvolcano, Solomon Islands \nAuthors \nD. J. Smith a,*, M. G. Petterson a, b, A. D. Saunders a, I. L. Millar c, G. R. T. Jenkin a, T. Toba d, J. Naden b, \nJ. M. Cook b \na Department of Geology, University of Leicester, LE1 7RH, UK  \nb British Geological Survey, Keyworth, Nottingham, NG12 5GG, UK \nc NERC Isotope Geosciences Laboratory, Kingsley Dunham Centre, Keyworth, Nottingham NG12 5GG, \nUK \nd Ministry of Energy Water and Mineral Resources, Honiara, Solomon Islands \n* Corresponding author. Tel.: +44 (0)116 252 3315. Fax: +44 (0)116 252 3918. Email: djs40@le.ac.uk \nAbstract  \nSavo, Solomon Islands, is a historically active volcano dominated by sodic, alkaline lavas and pyroclastic \nrocks with up to 7.5 wt % Na2O, and high Sr, arc-like trace element chemistry. The suite is dominated by \nmugearites (plagioclase–clinopyroxene–magnetite ± amphibole ± olivine) and trachytes (plagioclase–\namphibole–magnetite ± biotite). The presence of hydrous minerals (amphibole, biotite) indicates relatively wet \nmagmas. In such melts, plagioclase is relatively unstable relative to iron oxides and ferromagnesian silicates; it \nis the latter minerals (particularly hornblende) that dominate cumulate nodules at Savo and drive the chemical \ndifferentiation of the suite, with a limited role for plagioclase. This is potentially occurring in a crustal “hot \nzone”, with major chemical differentiation occurring at depth. Batches of magma ascend periodically, where \nthey are subject to decompression, water saturation and further cooling, resulting in closed-system \ncrystallisation of plagioclase, and ultimately the production of sodic, crystal and feldspar-rich, high-Sr rocks. \nThe sodic and hydrous nature of the parental magmas is interpreted to be the result of partial melting of \nmetasomatised mantle, but radiogenic isotope data (Pb, Sr, Nd) cannot uniquely identify the source of the \nmetasomatic agent.  \nKeywords  \nSodic, island arc, trachyte, mugearite, alkaline, Solomon Islands, Savo, hot zone \nIntroduction \nThe Solomon Islands arc has experienced a complex subduction history, involving the collision of an \noceanic large igneous province (the Ontong Java Plateau; Hughes 2004; Petterson et al. 1997), initiation of a \nsecond subduction zone (Petterson et al. 1999), and the subduction of a young oceanic spreading ridge (Crook \nand Taylor 1994). These process have contributed to a number of unusual magmatic features, including \nvolcanism on the plate being subducted (Simbo; König et al. 2007) and in the forearc region (Kavachi; Johnson \nand Tuni 1987); picritic magmas (Schuth et al. 2004); high magnesian andesites and adakites (König et al. \n2007); and alkaline magmas (DeLong et al. 1975). \n2 \nSavo occupies an ambiguous tectonic position, approximately equidistant between the two opposing \nsubduction zones that define the arc (Fig. 1). The volcano is constructed on unknown basement. Fresh magmatic \nrocks at Savo display a number of unusual characteristics, including high sodium contents (up to 7.5 wt % \nNa2O), increasing Sr with fractionation, and abundant ultramafic nodules. Along with Kavachi, Savo is one of \nonly two historically active volcanoes in the arc. The role that the various tectonic elements and events have \nplayed in magma genesis at Savo remains unclear. Previous authors have related the magmatism at Savo to the \nsubduction zone to the south (Petterson et al. 2003) but a relationship to the northern subduction zone has not \nbeen ruled out  (Cooper and Taylor 1987). There is scope for interaction between both subduction zones in \nmagmatic processes in the Solomon Islands. Previous studies have provided brief summaries of chemistry and \npetrology at Savo (Petterson et al. 2003; Stanton 1994). Here we provide a critical assessment of petrogenesis at \nSavo, important for understanding tectonic and large-scale chemical processes of the Solomon Islands in \nparticular, and the southwest Pacific in general.  \nTectonic and geological history of the Solomon Islands \nThe Solomon Islands were formed by the ongoing convergence of the Indo-Australian and Pacific plates \n(Fig. 1). Southward subduction of the Pacific plate at the North Solomon Trench System (NSTS) commenced in \nthe Eocene (Petterson et al. 1999). Sometime before 6.4 Ma, the Ontong Java Plateau (an Alaska-sized oceanic \nlarge igneous province) “choked” the NSTS resulting in initiation of subduction of the Indo-Australian Plate at \nthe South Solomon Trench System (SSTS; Cooper and Taylor 1987; Petterson et al. 1999; Phinney et al. 2004). \nIntermittent subduction along the NSTS still occurs (Auzende et al. 1996; Cooper and Taylor 1987; Kroenke \n1995). The subducted Pacific slab may still be a source of metasomatic fluids and melts to the sub-arc mantle \n(e.g. König et al. 2007). \nSubduction of the Indo-Australian Plate at the SSTS continues at the present day. Earthquake hypocentres \nshow that the Indo-Australian slab dips vertically to 250 km in the western region of the arc and vertically to \n100 km in the eastern end of the arc (Cooper and Taylor 1987). However, in the central Solomon Islands \nseismicity is low magnitude, shallow and diffuse. The poor definition of the slab by seismic studies is thought to \nbe a result of the relative warmth of the young lithosphere of the Woodlark Basin (and its subducted equivalent) \ncompared to older, colder lithosphere to the east and west (Cooper and Taylor 1987; Mann et al. 1998). \nSubduction of the Woodlark Basin is considered to be a major influence on structure and magmatism in \nthe Solomon Islands (Cooper and Taylor 1987; Johnson et al. 1987; Taylor and Exon 1987). Spreading at the \nWoodlark Ridge began before 5 Ma (based on magnetic lineations; Taylor 1987) and ceased at approximately \n0.5 Ma (Crook and Taylor 1994). One of the Woodlark Ridge transform faults intersects the SSTS to produce a \ntrench-trench-transform triple junction east of Simbo Island (Crook and Taylor 1994). The combined divergence \nand subduction of the Woodlark Ridge is believed to have led to the formation of “windows” in the Indo-\nAustralian slab beneath the arc (Chadwick et al. 2009; Johnson et al. 1987; Perfit et al. 1987; Taylor 1987; \nTaylor and Exon 1987). The development of slab windows is believed to be responsible for fore-arc magmatism \nat Kavachi (Johnson et al. 1987), and the genesis of island arc picrites in New Georgia (Johnson et al. 1987; \nPerfit et al. 1987; Rohrbach et al. 2003; Schuth et al. 2004).  \n3 \nSavo volcano \nSavo volcano is 35 km northwest of Honiara, the administrative capital of the Solomon Islands (9°8`S \n159°49`E). The volcano has a basal diameter of 9 km and a height of approximately 1400 m, and is constructed \non ~14 km thick oceanic crust (Furumoto et al. 1976; Petterson et al. 2003). The upper portion of the volcano is \nabove sea level – Savo Island is approximately 7 km long (N–S) by 6 km wide (E–W), with a high point of \n485 m. The centre of the island is marked by a 1.5 km wide, approximately 80 m deep crater. At least two \nheavily vegetated, small lava domes are visible in the central crater, along with a number of steeper domes in the \nsouth and southwest of the island. Streams drain from the outer crater wall in a radial pattern, dissecting the \nisland into a series of steep-sided gorges and valleys. A number of streams originate at inland hot springs. With \nthe exception of the steep domes in the southwest of the island, pyroclastic and reworked pyroclastic deposits \nare ubiquitous on the island, and include block and ash flow (BAF), debris flow, tephra fall, lahar, and surge \ndeposits (Petterson et al. 2003). Coherent lavas (and\/or intrusive bodies) are limited to the domes in the crater \nand southwest of the island, and discontinuous, heavily weathered exposures in valleys (Savo map in \nsupplementary data). \nSampling and analytical methods \nDue to intense tropical weathering, in-situ outcrops were rarely suitable for analytical work. Fresh \nsamples were collected from volcaniclastic deposits, stream-cut exposures, beaches, and wherever possible, \nfrom exposed coherent lavas. Sample location map is in the electronic supplement. A number of samples were \nnodules within a larger body of host rock, and some of the samples collected as individual blocks (particularly \nthe most mafic) may represent nodules separated from the host rock during transport.  \nWeathered surfaces were removed from samples by splitter or rock saw prior to crushing. Samples were \ncrushed to coarse chips using a hardened steel press and rendered to a powder in an agate planetary mill at the \nUniversity of Leicester, with the exception of samples for Pb isotope ratio determination which were milled to a \nfind powder in tungsten carbide, rather than agate. \nWhole rock major and trace element compositions were analysed with a Philips PW1400 (samples SV1–\n65) or PANalytical PW4400 Axios Advanced (samples SV151–400) X-ray fluorescence spectrometer at the \nUniversity of Leicester, using standard methods (Smith 2008). A range of reference materials (RMs) were used \nto calibrate both instruments. The precision (1σ) of the major element data, across a range of compositions, was \nestimated to be <3% for SiO2, Al2O3, Fe2O3, MgO, CaO and Na2O, <7% for TiO2 and MnO, <10% for K2O and \nP2O5. For trace elements at concentrations above10 ppm the precision was <15% for Ba; <10% for Ce, Co, Cr, \nCu, Ni, Sc; and <5% for Ga, Rb, Sr, V, Zn, Zr. For trace elements at concentrations below 10 ppm, the \nestimated for precision were <1 ppm for Ga, Nb, Rb; <2 ppm for Co, Cu, La, Nd, Ni, Y; <4 ppm for Ba, Cr, Th, \nZr. Measured values for RMs were within 1σ of accepted values. There was no significant difference between \nresults from the two spectrometers.  \nRare earth elements were analysed by solution ICP-MS at the British Geological Survey Keyworth, \nfollowing sodium peroxide fusion of powdered samples (Smith 2008). Accuracy was estimated from analysis of \ncertified RMs and was typically within 10% of the accepted values. Precision (1σ) was estimated to be \n<0.05 ppm for Ho, Lu, Pr, Tb, Tm; <0.1 ppm for Eu, Pr; <0.2 ppm for Dy, Er, Sm, Yb; <1 ppm for Ce, Gd, La, \nNd.  \n4 \nMineral chemistry data were collected using a JEOL 8600 Superprobe at the University of Leicester \n(Smith 2008). Precision for electron probe analysis was calculated from counting statistics, and was generally \nbetter than ±1% for measurements > 10 wt %, and better than ±5% for contents > 0.5 wt %. Microprobe data \ntables are in the Supplementary Data. \nStrontium and neodymium isotope ratio determinations were carried out at the NERC Isotope \nGeosciences Laboratory (NIGL). Strontium and neodymium fractions were prepared using standard techniques \noutlined in Royse et al. (1998). Samples were analysed using a Thermo-Finnigan Triton thermal ionisation mass \nspectrometer. The Sr blank at the time of analysis was 111 pg. Replicate analyses of the SRM987 standard \nsolution gave an average value of 0.710263 ± 4 (1σ, n=50). Data are reported normalised to SRM987 = \n0.710250. A number of samples were leached in HCl to ascertain the effect of minor alteration; no significant \ndifference in 87Sr\/86Sr was found between leached and unleached sample fractions. The Nd blank at the time of \nanalysis was 132 pg. Replicate analyses of the J&M standard solution gave an average value of 0.511104 ± \n0.000012 (2σ, n=50). Data are reported normalised to J&M solution standard = 0.511123. \nSamples for the determination of Pb isotope ratios were prepared using techniques described by Kempton \nand McGill (2002). Pb isotope ratios were determined at NIGL using a VG Axiom, MC-ICP-MS instrument for \nsamples spiked with Tl. All Pb isotope ratios have been corrected relative to the NBS 981 composition of \nThirlwall (2002). Blanks are typically less than 200 pg, although one high blank (2 ng) was obtained during the \ntime of analysis. \nResults \nSamples from Savo are divided into two groups: the main suite consists of crystal rich trachytes, \nmugearites and occasional benmoreites, defined on the basis of total alkalis versus silica (Fig. 2), and by virtue \nof their sodic chemistry (Na2O−2 > K2O). Nodules commonly occur as inclusions within main suite samples. \nThe nodules include a wide variety of mineralogies, and occur in range of sizes, from 30 cm in diameter, to \nxenocrysts and micro-nodules identifiable only at thin section scale.  \nPetrography and mineral chemistry – main suite \nThe main suite of samples are typically crystal-rich (55–70% crystals by volume) and porphyritic with \nhyalopilitic groundmass (Fig. 3a), although a small number of the mafic (hawaiite and mugearite) samples \ncollected from small exposures of lava flow deposits are entirely crystalline, with phenocrysts of clinopyroxene \nand olivine (0.5–3 mm) in a groundmass of plagioclase crystals (0.3–3 mm; Fig. 3b). \nPlagioclase and magnetite occur in all samples. There is a progressive change in the mafic mineral \nassemblage with increasing whole rock SiO2, from clinopyroxene mugearites to clinopyroxene–amphibole \nmugearites, amphibole benmoreites and finally amphibole–biotite trachytes (Fig. 4). Olivine is present in a small \nnumber of the more mafic samples. Anhydrite was observed in one trachyte sample (SV40). Needle-like apatite \ncrystals can be seen in trachytic samples. Apatite crystals are more readily distinguished as inclusions within \nfeldspar phenocrysts due to the microlite-rich nature of the groundmass. \nPlagioclase is ubiquitous throughout the suite, and constitutes 25–35% of the sample volume of \nmugearites, and 40–45% of benmoreites and trachytes (Fig. 4). Crystals are typically euhedral laths in thin \nsection at <0.2 mm to over 10 mm in rare cases, but more typically 2–3 mm. A significant quantity of \nfragmented crystals is also present. Normal zoning is common (Fig. 3a). Plagioclase crystals in mugearites \n5 \nrange from An85–An50, often within a single crystal; in benmoreites the range is from An80–An30. Plagioclase \nwithin trachytes is commonly An40–An10, although some crystals are An75–An20. Potassium contents are low; \nrare outliers with >5% orthoclase (Or) may be a result of minor alteration. Occasionally plagioclase contains \ninclusions of amphibole and magnetite. \nMagnetite occurs throughout the suite as a minor phenocryst phase (1–12% by volume; Fig. 4), with \ncrystals typically <0.3 mm. Magnetite has been observed as inclusions within all major phenocryst phases. \nMany magnetite crystals show well developed exsolution lamellae under reflected light. Electron microprobe \nanalysis of magnetite frequently returned analyses with totals <90 wt %, with iron analysed as FeO (the ideal \ntotal for pure magnetite is 93%). This may be a result of an excess of the Fe2O3 component, i.e. the magnetites \nare approaching the maghemite endmember. Magnetite–maghemite solid solution is probably a result of \nsubsolidus oxidation (Haggerty 1976). \nClinopyroxene occurs in the hawaiites, mugearites and one benmoreite sample (SV12; Fig. 3c), typically \nas well developed phenocrysts between 0.5 and 2 mm diameter, up to 30% by volume (Fig. 4). Zoning, \nexsolution lamellae and reaction rims are rarely observed. Clinopyroxene crystals occasionally contain \ninclusions of magnetite (up to 0.3 mm, typically well developed crystals), and rarely plagioclase (<0.2 mm, \npoorly developed crystals). Pyroxenes from the main suite fall in a narrow compositional range that spans the \naugite–diopside compositional boundary; they are typically aluminian and aluminian-ferrian diopsides\/augites, \nwith a smaller proportion (<10% of analyses) of chromian diopsides and augites. There is little covariation of \npyroxene chemistry with whole rock chemistry. \nOlivine occurs as phenocrysts (up to 2 mm diameter) in a small number of mugearitic samples, where it \nconstitutes up to 7% by volume (Fig. 4). Crystals are typically rounded with the margins altered to iddingsite. \nMicroprobe analyses are available only for sample SV1; analysed crystals are Fo70–80, with Ca contents of 0.15–\n0.20 wt %.  \nAmphibole occurs over a wide range of whole rock SiO2 values (from ~52 to ~65 wt %), and after \nplagioclase is the most abundant phenocryst mineral. Amphibole is commonly present as well developed \ncrystals and laths, typically crystals are between 0.5 and 1 mm but occasionally over 3 mm in length. Amphibole \nshows strong pleochroism (α= pale green, β= pale green–yellow, γ= deep green; or α= yellow, β= reddish \nbrown, γ= brown). Zoning was observed in a number of well-formed crystals. \nAll fresh amphiboles are hornblende group (sensu lato), the majority being pargasites and \nmagnesiohastingsites, with a smaller number of edenites and magnesiohornblendes. Significant variations in \ncomposition (e.g. Si, NaA+KA, Mg#) occur within single samples, and even within single crystals. For example, \na single crystal in SV40 was found to be normally (with minor oscillations) zoned from Mg# (Mg\/Mg+Fe) 0.79 \nto 0.55, as NaA+KA varied from 0.55 to 0.9. No systematic variation in zoning was observed for the suite; \nnormal, reverse and oscillatory zoning all occur, as do homogeneous crystals. \nIn a number of samples, hornblende displays opaque rims, and in some (including SV12, 20, 29) the \namphibole is completely pseudomorphed by finely crystalline opaque minerals (Fig. 3c). Stanton (1994) found \nthe replacing assemblage to be a mixture of clinopyroxene, magnetite and plagioclase with trace quartz and \nhematite, in his study of pseudomorphed and rimmed amphiboles from Guadalcanal and Savo. \nBiotite occurs in benmoreite and trachyte samples, typically as small (<0.5 mm) crystals; rare examples \nwith diameters up to 2 mm were observed. Biotite is often deformed, and in rare examples may be seen as \n6 \ninclusions within large amphibole crystals. Biotite typically constitutes between 3 and 7% by volume of samples \nwith whole rock SiO2>60 wt %. Biotites are relatively magnesium rich (Mg# typically 0.6–0.7). The majority of \nsamples analysed are part of the annite–phlogopite series (sensu Tischendorf et al. 2007), with a significant \nproportion sufficiently Mg-rich to be classified as phlogopite.  \nPetrography and mineral chemistry – nodules \nNodules are subdivided on the basis of dominant mineralogy: \nHornblendites (sensu lato) are composed of amphibole (>90%) with minor clinopyroxene and magnetite \n± plagioclase ± apatite. Amphibole crystals are typically >2 mm, and can measure up to 3 cm. Texture varies \naccording to mineralogy: plagioclase ± apatite-bearing samples typically have euhedral amphibole crystals, with \ninterstitial plagioclase and apatite; plagioclase-free and plagioclase-poor samples are much more common on \nSavo, and are dominated by anhedral amphibole. The samples are consistent with cumulate textures, with \nplagioclase-free orthocumulates (Fig. 3d) and plagioclase-bearing adcumulates (Fig. 3e). Amphibole \ncompositions in nodules overlap with those from the main suite. Plagioclase in hornblendites may be more \ncalcic than in the main suite (SV38, SV181 nodules are An80–90) but not in all cases (Fig. 5).  \nClinopyroxenites are dominated by clinopyroxene, with olivine, minor amphibole, and magnetite, and \ndisplay orthocumulate textures. Amphibole can be seen to be replacing clinopyroxene in a number of samples, \nespecially at the contact between the host rock and the nodule, and also occurs as an intercumulus phase, \ntypically leading to poikilitic textures. Clinopyroxene chemistries overlap with those of the main suite, tending \nto be slightly more Mg-rich. From the small number of olivine analyses there is no appreciable difference in \nFo% between the nodules and main suite, but the nodule olivines are less calcic than those of the main suite \n(>0.1 versus ~0.2 wt % CaO, respectively). \nHornblende gabbros are coarsely crystalline (1–5 mm) with plagioclase, amphibole, clinopyroxene and \nmagnetite (Fig. 3f). Amphiboles are often blackened or partially replaced by clinopyroxene and magnetite. \nHornblende gabbros are transitional between hornblendites and main suite hawaiites and mugearites in terms of \nmineralogy and texture. \nMajor element chemistry \nMain suite samples from Savo are mildly alkaline and sodic (Na2O−2 > K2O), and are classed as \nmugearites, benmoreites and trachytes, with occasional hawaiites and dacites (Fig. 2; Table 1). The majority of \nanalysed samples are silica saturated and metaluminous, but a small number of mugearites are nepheline-\nnormative. \nMajor element trends for the main suite and nodules are shown in Harker variation diagrams in Fig. 6. \nSamples from the main suite show well defined linear relationships for all elements relative to SiO2. There is a \npaucity of benmoreites relative to the mugearites and trachytes; to what extent this reflects a sampling bias \nrather than a real lack of benmoreites in the erupted material at Savo is difficult to ascertain. Most major \nelement oxides show relatively simple trends versus silica. The exceptions are Al2O3, which shows a weakly \ndefined linear increase as SiO2 increases from 50–55 wt % SiO2¸ and plateaus at approximately 18 wt % at \nhigher SiO2 values. P2O5 is relatively constant at 0.18–0.26 for samples with low SiO2; at SiO2 >62 wt % \nphosphorous contents decrease steadily as silica increases.  \n7 \nMajor element trends for nodules are more scattered, due to the varied mineralogy and small sample \npopulations. Clinopyroxenite samples (SV159 and SV161) show features – e.g. low Al; high Fe – that reflect the \npredominance of clinopyroxene, with increased olivine contents in SV159 leading to higher Mg contents (Table \n2).  \nHornblendites SV6A, 155 and 175 cluster closely on plots of all major element oxides, with the exception \nof TiO2 as it is controlled by magnetite, which is a variable minor phase. Notably, the hornblendites are co-\nlinear with main suite samples for the major elements except Al and P. Sample SV181 plots separately from the \nother hornblendites, with lower SiO2 (~34 wt %) and Mg, and significantly higher Ti, Fe and P, which is \nconsistent with increased magnetite and apatite contents. \nHornblende gabbro nodules are approximately co-linear with the main suite for the elements Al, Ca, Na, \nK and Fe (Fig. 6). Magnesium contents are more varied, but as displayed by the hornblendites and \nclinopyroxenites, Mg is susceptible to variations in modal olivine and clinopyroxene. \nTrace element chemistry \nTrace element data (Tables 1 and 2) are shown as Harker variation diagrams (Fig. 7). For the most part, \nincompatible elements (Ba, Zr, Rb) increase and compatible elements (Co, Cr, V) decrease with increasing \nSiO2. A notable feature of the suite is the increase in Sr content with SiO2. Strontium and barium show weakly \nbimodal distributions, with a cluster of mugearite and benmoreite samples at lower concentrations, and a \ntrachyte cluster at higher contents.  \nFor nodules, Ba, Rb, Sr and Zr are approximately co-linear with the main suite. The compatible elements \nshow significant scatter for the nodules relative to the main suite; Cr in particular shows significant enrichment \n(relative to the overall trend) in the clinopyroxenites and clinopyroxene-bearing hornblendites (i.e. excluding \nSV181). \nRare earth element chemistry \nAll samples are enriched relative to average C1 chondrite (Tables 1 and 2; Fig. 8). As SiO2 increases, the \nREE profiles become steeper due to progressive depletion of the MREE and HREE. The change in slope of the \nREE profile can be expressed as the increase in LaN\/YbN and LaN\/DyN from 3–4 to 6–10 as SiO2 increases from \n50–66 wt %; over the same silica range, DyN\/YbN increases from 2 to 4. Europium anomalies are absent in most \nsamples, with only trachytes SV2, 17 and 39 showing weak positive anomalies (Eu\/Eu*=1.2, based on the \ndeviation from the geometric mean of SmN and GdN). \nThe rare earth profiles for two hornblendites (SV181 and SV6A) are included in Fig. 8. The two differ in \nterms of LREE, with SV181 considerably more enriched in La–Nd compared to SV6A. This is assumed to be a \nresult of high apatite content in SV181, also reflected in the high P2O5 content. \nRadiogenic isotopes \nIn the main suite, 87Sr\/86Sr ranges between 0.7040–0.7042 (Table 1; Fig. 9). Trachytes tend to dominate \nthe upper end of this range, but overlap with mugearites, so there appears to be little significant variation in \n87Sr\/86Sr with composition.  \n8 \nThe lead isotope ratios show no resolvable variation with increasing whole-rock SiO2 (Table 1; Fig. 9), \nand are similar to volcanic samples from the western Solomon Islands (König et al. 2007). There is no \nobservable variation of 143Nd\/144Nd with increasing SiO2, with data clustered tightly around 0.51297. \n \nDiscussion \nThe role of water in petrogenesis at Savo \nA number of petrological and geochemical features point to high pre-eruptive water contents in the \nmagmas at Savo. High concentrations of fluid-mobile elements (Sr, Ba, Rb) in mafic samples are consistent with \nmelt generation from hydrated mantle (Pearce 1982), and the presence of amphibole and biotite requires high \nwater contents (>3 wt %) in the crystallising magmas (Barclay and Carmichael 2004; Gill 1981; Moore and \nCarmichael 1998; Sisson and Grove 1993). Pre-eruptive conditions (temperature, pressure, pH2O) are difficult \nto determine precisely due to the mineralogy (e.g. one pyroxene, no ilmenite), lack of glass and widespread \ndevelopment of opaque-rich rims on amphiboles. However, numerous experiments have been undertaken on arc \nbasalts and the qualitative aspects of those experiments should apply to Savo. \nHigh water contents in basaltic melts have the effect of destabilising silicate minerals, plagioclase in \nparticular (Gaetani et al. 1993; Gill 1981; Sisson and Grove 1993). Plagioclase is suppressed at high water \ncontents, and occurs as a liquidus phase at lower temperatures and pressures in hydrous basalts than in \nanhydrous equivalents (Gaetani et al. 1993). Oxides are affected much less than silicates by high water contents. \nThus, arc basalts typically fractionate assemblages (in order of appearance, rather than abundance) of magnetite \n> olivine > clinopyroxene > plagioclase (Sisson and Grove 1993). High fO2 (the presence of anhydrite in SV40 \nindicates fO2 ≥ NNO+1; Carroll and Rutherford, 1987) would also stabilise oxides relative to silicates. \nAmphibole is stabilised as a liquidus phase at high water contents (>3 wt %), particularly in sodic melts (Sisson \nand Grove 1993). \nThe presence of clinopyroxenite and in particular, hornblendite cumulates, at Savo is consistent with the \nfractionation of a hydrous magma. With reference to the mineralogy of the main suite, clinopyroxenites would \nbe the dominant cumulate early in the fractionation, as clinopyroxene and olivine are the main mafic phases in \nthe least evolved mugearites (Fig. 4). Hornblende does not appear until greater degrees of differentiation, and so \nthe hornblendites are expected to represent a later fractionating assemblage. However, the role of plagioclase in \nthe differentiation of the suite is unclear – the majority of cumulates are plagioclase-poor, and Sr behaves as an \nincompatible element with increasing differentiation (Fig. 7) indicating a limited role for plagioclase in \nfractionating assemblages. \nStrontium data from main suite plagioclase crystals indicate further complexity. Fig. 10a shows that the \nplagioclase compositions can be divided into two groups within the main suite – mugearites and benmoreites \n(characterised by a relatively flat trend of SrO with decreasing XAn) and trachytes (sharply decreasing from high \ninitial SrO with decreasing XAn). A small number of benmoreite-hosted crystals lie closer to the trachyte group \n(i.e. elevated SrO for a given XAn). Core-to-rim traverses did not locate any elevated SrO zones with crystals; \nrather, the entire crystal would be elevated relative to the predominant trend. Given these crystals occur within \nthe same sections as “normal” plagioclase, they may represent xenocrysts or products of magma mingling. By \n9 \ncomparison, BaO from the same analysed crystals does not show two distinct groupings – instead it shows one \ntrend with increasing BaO with decreasing XAn (Fig. 11). \nFig. 10b uses the equation of Blundy and Wood (1991) for DSr varying with XAn to calculate equilibrium \nmelt Sr. Equilibrium melt compositions slope steeply down from high initial Sr (~1000 ppm) as XAn decreases, \nwithin both the mugearite\/ benmoreite group and trachyte groups. Closed system crystallisation of plagioclase is \nthe most obvious explanation of the trend within a group – plagioclase crystallises, progressively exhausting the \nmelt of Sr. Plagioclase fractionation is limited, at least within the trachytes, as whole rock Sr is greater than any \ncalculated melt composition. The whole rock chemistry of these crystal rich rocks does not reflect a liquid line \nof descent. \nFig. 10b shows that trachytes evolved from melts with higher Sr than mugearites and benmoreites. \nHowever, the BaO–XAn plot (Fig. 11) does not show two trends, and when considering that 87Sr\/86Sr shows little \ndifference between mugearitic and trachytic compositions, this would seem to rule out a significant role for \nassimilation. The whole rock chemistry, although not representing liquid lines of descent, does show linear \ntrends for most elements, implying a common origin for mugearites and trachytes. \nHydrous arc magmas may fractionate and evolve according to the “hot zone” model of Annen et al. \n(2006), where parental magmas undergo significant amounts of differentiation in lower crustal intrusions, with \nperiodic release of fractionated daughter  magmas into shallow chambers. To apply this model to Savo, \nmagnetite, clinopyroxene, amphibole and limited amounts of plagioclase (plus minor olivine and apatite) are \nfractionated extensively in deeper intrusions (and recovered as cumulate nodules), then evolved magmas ascend \nto shallow levels where plagioclase is “frozen in” by rapid crystallisation. The primary control on chemistry is \nthe deep fractionation event, where linear trends in elements such as Co, V, Ba, and Zr are generated for the \nmain suite as they are either entirely compatible with the mafic mineral assemblages, or entirely incompatible \n(i.e. bulk D values remain above or below 1 regardless of the minerals fractionating). Strontium behaves as an \nincompatible element when plagioclase crystallisation is limited. Upon ascent, batches of magma are subject to \ndecreasing pressure, decreasing water solubility, and ultimately water saturation and degassing. Plagioclase will \nbegin crystallising, or will constitute an increasingly large proportion of the crystallising assemblage as the \nsystem moves to lower water contents, and Sr will behave compatibly and leave the melt fraction progressively \ndepleted (as per Fig. 10b). Viscosity will increase, thus limiting plagioclase fractionation, and so crystal-rich, \nhigh-Sr mushes will be produced. \nThe role of the deep fractionation of mafic minerals, and in particular amphibole, has a number of \nimportant controls on geochemistry at Savo. Rare earth element profiles of the main suite exhibit curves \ncharacteristic of hornblende fractionation, with progressive MREE-HREE depletion (Fig. 8; compare with \nhornblendite SV6A). LREE remain relatively consistent, a result of apatite saturation and fractionation in the \nmore evolved rocks (see P2O5-rich hornblendite SV181, Fig. 8). Hornblende fractionation (plus minor \nplagioclase removal in hornblende gabbro-type cumulates) also limits the progressive increase in whole rock \nAl2O3, preventing the melts from becoming corundum normative, and increases SiO2, moving compositions \naway from silica-undersaturated to saturated conditions (Martin 2007). Minimal plagioclase fractionation at \nSavo, and the dominance of calcic compositions in cumulates when it does occur (Fig. 5) serve to maintain the \nhigh sodium content of the whole rocks. Sodium is retained along with Sr in the feldspar, whereas in the case of \nplagioclase fractionation, the suite would become more potassic with differentiation. Potassium does indeed \n10 \nincrease at Savo, but whole rock values remain sufficiently sodic that Na2O−2 is greater than K2O throughout \nthe main suite. \nThe trachytes of Savo show a number of geochemical characteristics in common with adakites (Defant \nand Drummond 1990). However, the geochemical criteria for defining a rock as adakitic are genetically non-\nunique (Richards and Kerrich 2007). Already the importance of amphibole fractionation has been demonstrated \nat Savo, and the late crystallisation and retention of plagioclase further emphasises the high Sr\/Y value of the \nmagma. The most likely explanation for the “adakitic signatures” at Savo is that initially Sr-rich, hydrous arc \nbasalt\/ hawaiite fractionates an amphibole-dominated assemblage, resulting in increasing La\/Yb, and Sr\/Y. \nThe plagioclase crystal chemistry plots show a bimodal distribution within the main suite, with only a \nminority of crystals from benmoreite hosts displaying intermediate SrO–XAn compositions (Fig. 10). To what \nextent this gap is real or an artefact of sampling is unclear. Compositional gaps can develop by periodic \nextraction of fractionated liquids from magmas when a critical degree of crystallisation is reached (Brophy and \nDreher 2000). By this mechanism, extraction of a trachytic liquid from crystallising mugearite at Savo would \nrequire release of the daughter liquid prior to significant plagioclase crystallisation (to maintain high Sr in the \ndaughter). Alternatively, benmoreites at Savo might have a tendency to remain in the upper crust, rather than \nascending to surface, perhaps as a result of neutral buoyancy, high viscosity or deeper water saturation (by \nvirtue of higher water contents than mugearites through fractionation, and lower water solubility than trachytes \nby virtue of melt composition). Simply put, a wide compositional range of melts can be released from depth \nfollowing fractionation from a parental melt, and all begin closed-system (plagioclase-dominated) crystallisation \nupon water saturation – the depth of water saturation will vary for the different melt compositions. Without data \nto constrain melt H2O contents at Savo, this hypothesis cannot presently be tested. \nSodic magmas at Savo \nSodic magmas (where Na2O−2 > K2O) are unusual occurrences in arcs, although they may be generated \nby a number of mechanisms, including: partial melting of subducted slabs; partial melting of underplated \nbasaltic crust (Atherton and Petford 1993); assimilation of basaltic lower crustal material (Feeley and Hacker \n1995); partial melting of mantle metasomatised by aqueous fluids (Kamenov et al. 2008; McInnes and Cameron \n1994) and\/or melts from subducted slabs (Kepezhinskas et al. 1995); and small degrees of partial melting of the \nmantle in truncated melt columns (Hole and Saunders 1996). \nModels involving extensive interaction with crustal material are unlikely at Savo. Radiogenic isotope data \npreclude the involvement of compositionally (or temporally) distinct material, and crustal thickness beneath \nSavo (approximately 14 km; Petterson et al. 2003) is much thinner than in those models that involve extensive \ncrustal interaction (Atherton and Petford 1993; Feeley and Hacker 1995).  \nDeLong et al. (1975) compiled data for sodic magmas in intra-oceanic arcs and observed that these rock \ntypes occur in a number of specific tectonic settings: 1) near lateral edges of subduction zones where hinge \nfaulting is occurring (Bering, Fiji, Grenada) and 2) where fracture zones and ridges are being subducted at a \nhigh angle (Kanaga, Aoba and Ambrym, New Georgia, Iwo-jima). DeLong et al. (1975) suggested that the \nsubduction of these linear features provides pathways for magmas from regions beneath or within the subducted \nlithosphere, an idea further expanded into a model of slab window development. Thorkelson and Breitsprecher \n(2005) predicted that melts above such a slab window would likely be adakitic, due to thermal erosion of the \nslab window margins during mantle upwelling. The slab window model is viable for the Solomon Arc, and \n11 \nexplains a number of features in the western portion of the arc, including forearc volcanism (Johnson et al. \n1987), island arc picrites (Schuth et al. 2004), and volcanism on the plate being subducted (Chadwick et al. \n2009; König et al. 2007). \nSlab melts and aqueous fluids from subducted slabs can enrich the mantle by metasomatism (Gregoire et \nal. 2001; Kepezhinskas et al. 1995; McInnes et al. 2001; Pearce and Peate 1995; Rapp et al. 1999). At low \nmelt\/rock ratios, slab melts enrich the mantle wedge with mobile elements, and particularly with Na \n(Kepezhinskas et al. 1995; Xiong et al. 2006), rather than ascending to the surface as pristine adakites or mantle-\nhybridised high magnesian andesites (HMAs; Kepezhinskas et al. 1995; Rapp et al. 1999). Given the presence \nof HMAs in the western Solomon Islands (New Georgia Province and Simbo; König et al. 2007), as well as the \nfavourable tectonic setting for partial melting of the subducted slab, this is an appealing agent for enriching \nmantle-derived melts with Na at Savo. \nEnrichment of the mantle has occurred further west in the Tabar–Lihir–Tanga–Feni island arc of Papua \nNew Guinea, where alkaline eruptive suites commonly contain mantle xenoliths that indicate widespread \nmetasomatism beneath the arc (Gregoire et al. 2001; Kamenov et al. 2008; McInnes and Cameron 1994). \nVarious interpretations have been made of the origin of the metasomatism in this region, including partial \nmelting of subducted crust as the geotherms recover at the stalled slab, resulting in adakite genesis (Kamenov et \nal. 2008). However, other studies have concluded that the metasomatic agent was a hydrous fluid (Gregoire et \nal. 2001). Under high pressure and temperature conditions (1250°C, 15–25 kb), aqueous fluids derived from a \ndehydrating slab are capable of carrying significant mass fractions of mobile elements. Under such conditions, \naqueous fluids and silicate melts may be entirely miscible, and would have similar solvent properties (Ayers and \nEggler 1995; Bureau and Keppler 1999). It therefore makes it difficult to discriminate between slab melt and \nhydrous metasomatism on the basis of trace and major elements alone. In fact, the presence of arc-like Ba and Sr \nenrichments in basalts erupted in the Woodlark Basin suggests that the Pacific slab has a “hydrous footprint” \nthat extends a considerable distance south of the arc (Perfit et al. 1987; Woodhead et al. 1998). \nThe geographical location of Savo places it in an ambiguous position above both the Pacific and Indo-\nAustralian slabs. Both slabs have the potential to dehydrate, or partially melt, given the unusual tectonic \nscenario (stalled subduction, young crust, and slab window development). Radiogenic isotopes do not clearly \ndistinguish fluid\/ melt sources at Savo, particularly if subducted sediments are involved (Fig. 9). Both processes \ncould occur in tandem, given the two subducted slabs present beneath the arc, to give rise to alkali-enriched, \nmetasomatised mantle and ultimately to sodic magmas at Savo. \nConclusions \nThe erupted material at Savo spans a broad range of compositions, from mafic to felsic, with abundant \nnodules of cognate ultramafic material. The trace element, isotopic and mineral chemistry of the samples \nanalysed in this study indicate that the various compositions at Savo have a common origin, but have undergone \ndistinct differentiation and crystallisation histories.  \nThe fractionation models at Savo are consistent with “hot zone” models of arc magmatism (Annen et al. \n2006), where primitive, hydrous  mantle melts are emplaced at deep crustal levels, undergo high temperature \nand pressure differentiation by the fractionation of ferromagnesian silicates and oxides to establish major \nchemical variations. High water contents suppress plagioclase relative to mafic minerals. Evolved magmas \n12 \nascend to shallower levels, where water saturation and further crystallisation occurs. At Savo, plagioclase \ncrystallisation occurs as a closed-system process, resulting in strongly normal-zoned feldspars, and high whole-\nrock strontium concentrations. Distinct feldspar crystallisation trends are visible within the suite, indicating that \ndistinct batches of magma are released after relatively plagioclase poor fractionation at depth, to crystallise upon \nascent. Limited plagioclase fractionation retains the sodic chemistry in terms of whole rock compositions. \nThe hydrous, sodic magmas that occur at Savo are most likely derived from a metasomatised mantle \nwedge. The metasomatic “footprint” of either the Pacific or Indo-Australian slabs extends a considerable \ndistance away from the respective trenches, and Savo’s location equidistant between the two slabs means that an \nunequivocal slab source cannot be identified. The unusual tectonic features of the Solomon Islands are \nimportant contributors to forearc volcanism and picrite petrogenesis elsewhere in the arc. This study of Savo \nvolcano indicates that alkaline magmatism is another notable product of the complex geodynamic setting of the \narc. \nAcknowledgements \nThis research was funded by the Natural Environment Research Council (UK) and British Geological \nSurvey University Funding Initiative as part of PhD studentship NER\/S\/A\/2004\/12339. Analytical work was \nsupported by NERC Isotope Geosciences Facilities Steering Committee grant IP\/889\/1105. Additional \nfieldwork funds were provided by Society of Economic Geologists Student Research Grants (Hugh E. \nMcKinstry Fund and Newmont Mining Corporation Grant). Thanks to KA Green (BGS) and A Sumner (NIGL) \nfor assistance with analytical work; W Satokana, G Albert, A Ramo, D Billy and S Basi (Solomon Islands \nMinistry of Natural Resources), the British High Commission (Honiara) for assistance with fieldwork; D Selles \n(Harvard) for helpful discussion. We thank G Moore, editor TL Grove and an anonymous reviewer for \ncomments which have greatly improved this manuscript. MGP, ILM, JN, and JMC publish with the permission \nof the Executive Director, British Geological Survey (NERC). \n13 \nReferences \nAnnen C, Blundy JD, Sparks RSJ (2006) The genesis of intermediate and silicic magmas in deep crustal hot \nzones. J Petrol 47(3):505-539 \nAtherton MP, Petford N (1993) Generation of sodium-rich magmas from newly underplated basaltic crust. \nNature 362(6416):144-146 \nAuzende J-M, Kroenke LW, Collot JY, Lafoy Y, Pelletier B, Collot J-Y (1996) Compressive tectonism along \nthe eastern margin of Malaita Island (Solomon Islands). Mar Geophys Res 18:289-304 \nAyers JC, Eggler DH (1995) Partitioning of elements between silicate melt and H2O - NaCl fluids at 1.5 and 2.0 \nGPa pressure: Implications for mantle metasomatism. Geochim Cosmochim Acta 59(20):4237-4246 \nBarclay J, Carmichael ISE (2004) A hornblende basalt from western Mexico: Water-saturated phase relations \nconstrain a pressure-temperature window of eruptibility. J Petrol 45(3):485-506 \nBlundy JD, Wood BJ (1991) Crystal-chemical controls on the partitioning of Sr and Ba between plagioclase \nfeldspar, silicate melts, and hydrothermal solutions. Geochim Cosmochim Acta 55:193-209 \nBoynton WV (1984) Geochemistry of the rare earth elements: meteorite studies. In: Henderson P (ed) Rare \nEarth Element Geochemistry. Elsevier, pp 63-114 \nBrophy JG, Dreher ST (2000) The origin of composition gaps at South Sister volcano, central Oregon: \nimplications for fractional crystallization processes beneath active calc-alkaline volcanoes. J Volcanol Geotherm \nRes 102(3-4):287-307 \nBureau H, Keppler H (1999) Complete miscibility between silicate melts and hydrous fluids in the upper \nmantle: experimental evidence and geochemical implications. Earth Planet Sci Lett 165(2):187-196 \nCarroll MR, Rutherford MJ (1987) The stability of igneous anhydrite: experimental results and implications for \nsulfur behavior in the 1982 El Chichon trachyandesite and other evolved magmas. J Petrol 28(5):781-801 \nChadwick J, Perfit M, McInnes B, Kamenov G, Plank T, Jonasson I, Chadwick C (2009) Arc lavas on both \nsides of a trench: Slab window effects at the Solomon Islands triple junction, SW Pacific. Earth Planet Sci Lett \n279(3-4):293-302 \nCooper P, Taylor B (1987) The spatial distribution of earthquakes, focal mechanisms and subducted lithosphere \nin the Solomon Islands. In: Taylor B, Exon NF (eds) Marine Geology, Geophysics and Geochemistry of the \nWoodlark Basin-Solomon Islands, vol 7. pp 67-80 \nCrook KAW, Taylor B (1994) Structure and Quaternary tectonic history of the Woodlark Triple Junction region, \nSolomon Islands. Mar Geophys Res 16(1):65-89 \nDefant M, Drummond MS (1990) Derivation of some modern arc magmas by melting of young subducted \nlithosphere. Nature 347(6294):662-665 \nDeLong SE, Hodges FN, Arculus R (1975) Ultramafic and mafic inclusions, Kanaga Island, Alaska, and the \noccurrence of alkaline rocks in island arcs. J Geol 83:721-736 \nFeeley TC, Hacker MD (1995) Intracrustal derivation of Na-rich andesitic and dacitic magmas - an example \nfrom Volcan Ollague, Andean Central Volcanic Zone. J Geol 103(2):213-225 \nFurumoto AS, Webb JP, Odegard ME, Hussong DM (1976) Seismic studies on the Ontong Java Plateau, 1970. \nTectonophysics 34(1-2):71-90 \nGaetani GA, Grove TL, Bryan WB (1993) The influence of water on the petrogenesis of subduction related \nigneous rocks. Nature 365(6444):332-334 \nGill JB (1981) Orogenic Andesites and Plate Tectonics. Springer-Verlag, New York \nGregoire M, McInnes BIA, O'Reilly SY (2001) Hydrous metasomatism of oceanic sub-arc mantle, Lihir, Papua \nNew Guinea - Part 2. Trace element characteristics of slab-derived fluids. Lithos 59(3):91-108 \nHaggerty SE (1976) Oxidation of opaque mineral oxides in basalts. In: Rumble III D (ed) Oxide Minerals, vol 3.  \nHofmann AW (1997) Mantle geochemistry: the message from oceanic volcanism. Nature 385(6613):219-229 \nHole MJ, Saunders AD (1996) The generation of small melt-fractions in truncated melt columns: constraints \nfrom magmas erupted above slab windows and implications for MORB genesis. Mineral Mag 60:173-189 \n14 \nHughes GW (2004) Accretion of the Ontong Java Plateau to the Solomon arc: a historical perspective. \nTectonophysics 389(3-4):127-136 \nJohnson RW, Jaques AL, Langmuir CH, Perfit MR, Staudigel H, Dunkley PN, Chappell BW, Taylor SR, \nBaekisapa M (1987) Ridge subduction and forearc volcanism; petrology and geochemistry of rocks dredged \nfrom the western Solomon Arc and Woodlark Basin. In: Taylor B, Exon NF (eds) Marine Geology, Geophysics \nand Geochemistry of the Woodlark Basin-Solomon Islands, vol 7. pp 155-226 \nJohnson RW, Tuni D (1987) Kavachi, an active forearc volcano in the western Solomon Islands: reported \neruptions between 1950 and 1982. In: Taylor B, Exon NF (eds) Marine Geology, Geophysics and Geochemistry \nof the Woodlark Basin-Solomon Islands, vol 7. pp 89-112 \nKamenov GD, Perfit MR, Mueller PA, Jonasson IR (2008) Controls on magmatism in an island arc \nenvironment: study of lavas and sub-arc xenoliths from the Tabar-Lihir-Tanga-Feni island chain, Papua New \nGuinea. Contrib Mineral Petrol 155(5):635-656 \nKempton PD, McGill R (2002) Procedures for the analysis of common lead at the NERC Isotope Geosciences \nLaboratory and an assessment of data quality. In. NERC Isotope Geosciences Laboratory, p 59 \nKepezhinskas PK, Defant MJ, Drummond MS (1995) Na metasomatism in the island-arc mantle by slab melt- \nperidotite interaction: Evidence from mantle xenoliths in the north Kamchatka arc. J Petrol 36(6):1505-1527 \nKönig S, Schuth S, Münker C, Qopoto C (2007) The role of slab melting in the petrogenesis of high-Mg \nandesites: evidence from Simbo Volcano, Solomon Islands. Contrib Mineral Petrol 153(1):85-103 \nKroenke LW (1995) A morphotectonic interpretation of SOPACMAPS 1:500 000 charts, Central Solomon \nIslands - Southern Tuvalu. In: SOPAC Technical Report. SOPAC, Fiji,  \nLe Maitre RW, Bateman P, Dudek A, Keller J, Lameyre J, Le Bas MJ, Sabine PA, Schmid R, Sorensen H, \nStreckeisen A, Woolley AR, Zanettin B (1989) A Classification of Igneous Rocks and Glossary of Terms: \nRecommendations of the International Union of Geological Sciences Subcommission on the Systematics of \nIgneous Rocks. Blackwell Scientific, Oxford \nMann P, Taylor FW, Lagoe MB, Quarles A, Burr G (1998) Accelerating late Quaternary uplift of the New \nGeorgia Island Group (Solomon island arc) in response to subduction of the recently active Woodlark spreading \ncenter and Coleman seamount. Tectonophysics 295(3-4):259-306 \nMartin RF (2007) Amphiboles in the igneous environment. In: Amphiboles: Crystal Chemistry, Occurrence, and \nHealth Issues, vol 67. Mineralogical Soc Amer, pp 323-357 \nMcInnes BIA, Cameron EM (1994) Carbonated, alkaline hybridizing melts from a sub-arc environment: Mantle \nwedge samples from the Tabar-Lihir-Tanga-Feni arc, Papua New Guinea. Earth Planet Sci Lett 122(1-2):125-\n141 \nMcInnes BIA, Gregoire M, Binns RA, Herzig PM, Hannington MD (2001) Hydrous metasomatism of oceanic \nsub-arc mantle, Lihir, Papua New Guinea: petrology and geochemistry of fluid-metasomatised mantle wedge \nxenoliths. Earth Planet Sci Lett 188(1-2):169-183 \nMoore G, Carmichael ISE (1998) The hydrous phase equilibria (to 3 kbar) of an andesite and basaltic andesite \nfrom western Mexico: constraints on water content and conditions of phenocryst growth. Contrib Mineral Petrol \n130(3-4):304-319 \nPearce JA (1982) Trace element characteristics of lavas from destructive plate boundaries. In: Thorpe RS (ed) \nAndesites: Orogenic Andesites and Related Rocks. John Wiley and Sons, Chichester, pp 525-548 \nPearce JA, Peate DW (1995) Tectonic implications of the composition of volcanic arc magmas. Annu Rev Earth \nPlanet Sci 23:251-285 \nPeate DW, Pearce JA, Hawkesworth CJ, Colley H, Edwards CMH, Hirose K (1997) Geochemical variations in \nVanuatu arc lavas: the role of subducted material and a variable mantle wedge composition. J Petrol \n38(10):1331-1358 \nPerfit MR, Langmuir CH, Baekisapa M, Chappell BW, Johnson RW, Staudigel H, Taylor SR (1987) \nGeochemistry and petrology of volcanic rocks from the Woodlark Basin; addressing questions of ridge \nsubduction. In: Taylor B, Exon NF (eds) Marine Geology, Geophysics and Geochemistry of the Woodlark \nBasin-Solomon Islands, vol 7. pp 113-154 \n15 \nPetterson MG, Babbs T, Neal CR, Mahoney JJ, Saunders AD, Duncan RA, Tolia D, Magu R, Qopoto C, Mahoa \nH, Natogga D (1999) Geological-tectonic framework of Solomon Islands, SW Pacific; crustal accretion and \ngrowth within an intra-oceanic setting. Tectonophysics 301(1-2):35-60 \nPetterson MG, Cronin SJ, Taylor PW, Tolia D, Papabatu A, Toba T, Qopoto C (2003) The eruptive history and \nvolcanic hazards of Savo, Solomon Islands. Bull Volcanol 65(2-3):165-181 \nPetterson MG, Neal CR, Mahoney JJ, Kroenke LW, Saunders AD, Babbs TL, Duncan RA, Tolia D, McGrail B \n(1997) Structure and deformation of north and central Malaita, Solomon Islands; tectonic implications for the \nOntong Java Plateau-Solomon arc collision, and for the fate of oceanic plateaus. Tectonophysics 283(1-4):1-33 \nPhinney EJ, Mann P, Coffin MF, Shipley TH (2004) Sequence stratigraphy, structural style, and age of \ndeformation of the Malaita accretionary prism (Solomon arc–Ontong Java Plateau convergent zone). \nTectonophysics 389(3-4):221-246 \nRapp RP, Shimizu N, Norman MD, Applegate GS (1999) Reaction between slab-derived melts and peridotite in \nthe mantle wedge: experimental constraints at 3.8 GPa. Chem Geol 160:335-356 \nRichards JP, Kerrich R (2007) Special Paper: Adakite-like rocks: their diverse origins and questionable role in \nmetallogenesis. Econ Geol 102(4):537-576 \nRohrbach A, Schuth S, Münker C, Ballhaus C (2003) Island arc picrites from the Solomon Islands - origin by \nmantle matrix collapse. Geophys Res Abstr 5:11716 \nRoyse KR, Kempton PD, Darbyshire DPF (1998) Procedure for the analysis of rubidium-strontium and \nsamarium-neodymium isotopes at the NERC Isotope Geosciences Laboratory. NERC Isotope Geosciences \nLaboratory Report Series No. 121 \nSchuth S, Rohrbach A, Münker C, Ballhaus C, Garbe-Schönberg D, Qopoto C (2004) Geochemical constraints \non the petrogenesis of arc picrites and basalts, New Georgia Group, Solomon Islands. Contrib Mineral Petrol \n148(3):288-304 \nSisson TW, Grove TL (1993) Experimental investigations of the role of H2O in calc-alkaline differentiation and \nsubduction zone magmatism. Contrib Mineral Petrol 113(2):143-166 \nSmith DJ (2008) From Slab to Sinter: The Magmatic-Hydrothermal System of Savo Volcano, Solomon Islands, \nPh.D. thesis, University of Leicester \nStanton RL (1994) Ore Elements in Arc Lavas. Oxford University Press,  \nTaylor B (1987) A geophysical survey of the Woodlark-Solomons region. In: Taylor B, Exon NF (eds) Marine \nGeology, Geophysics and Geochemistry of the Woodlark Basin-Solomon Islands, vol 7. pp 25-48 \nTaylor B, Exon NF (1987) An investigation of ridge subduction in the Woodlark-Solomons region: introduction \nand overview. In: Taylor B, Exon NF (eds) Marine Geology, Geophysics and Geochemistry of the Woodlark \nBasin-Solomon Islands, vol 7. pp 1-24 \nThirlwall MF (2002) Multicollector ICP-MS analysis of Pb isotopes using a 207Pb-204Pb double spike \ndemonstrates up to 400 ppm\/amu systematic errors in Tl-normalization. Chemical Geology 184(3-4):255-279 \nThorkelson DJ, Breitsprecher K (2005) Partial melting of slab window margins: genesis of adakitic and non-\nadakitic magmas. Lithos 79(1-2):25-41 \nTischendorf G, Forster HJ, Gottesmann B, Rieder M (2007) True and brittle micas: composition and solid-\nsolution series. Mineral Mag 71:285-320 \nWoodhead JD, Eggins SM, Johnson RW (1998) Magma Genesis in the New Britain island arc: further insights \ninto melting and mass transfer processes. J Petrol 39(8):1641-1668 \nXiong XL, Xia B, Xu JF, Niu HC, Xiao WS (2006) Na depletion in modern adakites via melt\/rock reaction \nwithin the sub-arc mantle. Chem Geol 229(4):273-292 \n \n \n16 \nTables \nSample SV33 SV19 SV45 SV20 SV1 SV12 SV17 SV44 SV10 SV39 SV2 SV38 \nLocation Tuluka Pogho. Pagha. Pogho. Rembo. Pogho. Pagha. Lemboni Pogho. Crater Rembo. Crater \nRock \n \nMUG MUG MUG MUG MUG BEN TRAC TRAC TRAC TRAC TRAC TRAC \nSiO2 (wt %) 50.7 51.0 51.8 51.9 52.4 58.5 61.5 62.9 63.1 64.9 65.1 65.7 \nTiO2 0.86 0.72 0.63 0.75 0.68 0.52 0.42 0.44 0.37 0.33 0.25 0.33 \nAl2O3 16.8 16.5 16.1 17.4 15.3 17.6 18.5 17.9 18.2 18.2 17.7 18.4 \nFe2O3 9.07 9.31 9.83 8.76 9.31 5.84 4.11 3.67 3.37 2.85 2.36 2.83 \nMnO 0.16 0.14 0.12 0.13 0.15 0.13 0.10 0.09 0.10 0.07 0.06 0.07 \nMgO 4.54 4.78 4.41 3.68 6.88 1.93 1.48 1.81 1.26 1.19 0.87 1.16 \nCaO 9.04 10.0 9.95 8.00 10.2 6.48 4.16 3.68 4.31 3.07 2.41 2.98 \nNa2O 4.50 3.74 3.98 4.32 3.71 5.33 6.23 6.84 6.10 7.08 7.56 7.27 \nK2O 2.02 1.63 1.34 1.72 1.35 1.88 2.27 2.36 1.99 2.20 2.35 2.20 \nP2O5 0.27 0.22 0.19 0.21 0.19 0.19 0.17 0.24 0.16 0.16 0.10 0.15 \nLOI 2.13 1.09 1.12 1.99 -0.12 0.57 0.58 0.30 0.16 0.32 0.26 0.35 \nTotal 100.2 99.2 99.5 98.9 100.0 99.1 99.5 100.2 99.1 100.4 99.0 101.5 \nBa (ppm) 527 525 494 331 327 425 737 854 733 893 931 889 \nCo 34 27 27 24 35 15 9 15 7 12 bdl 9 \nCr 77 98 92 10 214 29 bdl 7 15 7 bdl bdl \nCu 105 88 110 77 103 8 9 21 21 11 bdl 10 \nGa 20 20 24 21 19 22 25 25 26 24 22 24 \nNb bdl bdl 2 bdl bdl 2 4 2 4 4 4 4 \nNi 22 24 7 9 43 bdl bdl bdl bdl bdl bdl bdl \nPb bdl bdl 11 bdl bdl bdl bdl 17 13 15 12 14 \nRb 23 22 34 26 21 31 40 42 45 47 49 44 \nSc 39 32 44 30 28 13 bdl bdl bdl bdl bdl bdl \nSr 849 849 1215 762 709 863 1506 1630 1427 1497 1206 1420 \nTh 6 7 4 5 6 bdl 5 10 6 7 6 8 \nV 438 460 305 273 225 183 83 83 62 55 46 53 \nY 16 20 20 17 19 16 10 11 12 8 7 8 \nZn 85 89 55 64 61 46 47 45 47 38 31 38 \nZr 61 68 77 79 63 102 136 135 136 124 127 124 \nLa 11 11 11 8 8 10 11 14 10 9 6 10 \nCe 23 23 22 17 16 20 21 28 19 17 11 19 \nPr 3.1 2.9 2.8 2.4 2.2 2.6 2.6 3.3 2.4 2.1 1.3 2.4 \nNd 15 13 12 11 11 11 11 13 10 9 6 10 \nSm 3.4 3.1 2.8 2.7 2.4 2.3 2.0 2.5 2.1 1.3 1.0 1.7 \nEu 1.0 1.0 0.9 1.0 0.8 0.8 0.7 0.7 0.7 0.5 0.4 0.5 \nGd 3 3 3 3 2 2 2 2 2 1 1 1 \nTb 0.45 0.45 0.41 0.46 0.40 0.39 0.25 0.25 0.28 0.17 0.13 0.19 \nDy 2.8 2.7 2.6 2.8 2.4 2.2 1.6 1.5 1.5 1.0 0.8 1.2 \nHo 0.56 0.58 0.55 0.62 0.53 0.51 0.33 0.27 0.30 0.19 0.19 0.25 \nEr 1.6 1.9 1.7 1.7 1.4 1.4 0.9 0.9 0.9 0.7 0.5 0.7 \nTm 0.22 0.26 0.20 0.26 0.21 0.20 0.14 0.12 0.15 0.09 0.08 0.11 \nYb 1.9 1.7 1.5 1.7 1.4 1.5 1.0 0.9 1.1 0.6 0.6 0.8 \nLu 0.24 0.24 0.20 0.27 0.20 0.22 0.16 0.13 0.17 0.11 0.10 0.12 \n87Sr\/86Sr 0.70412 0.70405 0.70402 0.70403 0.70400 0.70413 0.70421 0.70414 0.70421 0.70417 0.70444 0.70418 \n87Sr\/86Sr N 0.70410 0.70404 0.70401 0.70402 0.70399 0.70412 0.70420 0.70413 0.70420 0.70416 0.70443 0.70417 \n143Nd\/144Nd 0.51297 0.51294 0.51296 0.51298 0.51297 0.51297 0.51296  0.51296 0.51295 0.51298 0.51297 \n206Pb\/204Pb 18.449 18.485  18.449 18.451 18.455 18.443 18.449 18.445 18.461  18.461 \n207Pb\/204Pb 15.521 15.524  15.520 15.518 15.521 15.520 15.520 15.520 15.521  15.522 \n208Pb\/204Pb 38.269 38.317  38.265 38.273 38.268 38.263 38.268 38.266 38.269  38.277 \nTable 1: Whole rock major and trace element chemistry, and radiogenic isotope composition of main suite \nsamples. \n  \n17 \nSample Standards SV159 SV161 SV181 SV155 SV175 SV6A SV59 SV350 SV365 \nLocation   Soulo. Soulo. Soulo. Soulo. Soulo. Pogholav. Mbonala Kalaka Tuluka \nRock \n \nAverage 1σ CPXITE CPXITE HBLITE HBLITE HBLITE HBLITE GAB GAB GAB \nSiO2 (wt %) 39.4 1 0.32 44.4  49.8  34.1  42.0  42.8  43.4  40.6  43.8  49.7  \nTiO2 3.84 0.12 0.31  0.31  1.61  1.07  0.91  0.52  1.22  1.18  0.79  \nAl2O3 8.52 0.16 3.5  3.0  13.4  11.3  10.8  12.2  18.6  18.2  17.4  \nFe2O3 18.1 0.11 13.2  8.47  22.7  13.7  13.4  12.5 14.1 13.5  8.73  \nMnO 0.16 0.01 0.21  0.12  0.23  0.12  0.12  0.22  0.18  0.12  0.17  \nMgO 13.9 0.12 26.3  19.7  7.92  14.4  14.8  14.2 6.26  6.59  3.10  \nCaO 14.9 0.24 10.1  19.1  13.9  13.6  13.6  12.9  13.2  12.5  9.66  \nNa2O 0.79 0.02 0.90  0.29  2.56  2.25  2.22  2.34  2.50  2.51  3.92  \nK2O 0.20 0.02 0.17  0.03  0.68  0.54  0.58  0.46  0.44  0.56  1.77  \nP2O5 0.06 0.01 0.01   1.34  0.01  0.00  0.01  1.13  0.08  0.25  \nLOI   1.43  -0.09  0.47  0.22  0.28  0.30  0.74  0.35  3.80  \nTotal   100.5  100.7  98.9  99.1  99.6  98.9  99.0  99.5  99.6  \nBa (ppm) 58 8 26  9  107  61  67  33  97  139  383  \nCo 84 2 103  55  39  60  63  52  38  43  25  \nCr 527 25 1236  1871  40  249  345  731  28   11  \nCu 138 5   109   81  8  225  102  87  \nGa 18 1 6  5  21  15  12  17  23  23  22  \nNb 20 1      2  2   2  \nNi 198 7 414  163  7  89  86  183    7  \nPb 5 2          \nRb 10 1 4  3  4  4  4  4  5  4  23  \nSc 55 1 45  85  36  75  71  63  32  45  29  \nSr 269 2 112  52  463  261  193  179  674  667  921  \nTh 2 2      5  5    \nV 552 20 130  185  459  572  503  214  430  444  266  \nY 15 2 6  6  26  13  11  17  24  15  19  \nZn 207 7 76  33  97  52  41  98  74  70  67  \nZr 110 4 10  6  31  16  10  19  34  30  73  \nLa 5 2 0   6    1     \nCe 13 0   14    4     \nPr 2.0 0.0   2.7    1.0     \nNd 10 0   16    6     \nSm 3.3 0.1   4.7    1.9     \nEu 1.1 0.0   1.6    0.6     \nGd 4 0   0.75    0.39     \nTb 0.68 0.01   6    2     \nDy 4.9 0.1   4.7    2.3     \nHo 1.01 0.02   0.96    0.51     \nEr 3.1 0.1   2.8    1.4     \nTm 0.43 0.01   0.37    0.20     \nYb 3.0 0.2   2.4    1.2     \nLu 0.43 0.01   0.32    0.24     \n87Sr\/86Sr 0.704110 3 0.000005      0.70420    \n87Sr\/86Sr N 0.704097       0.70418    \n143Nd\/144Nd 0.511104 4 0.000006          \n206Pb\/204Pb 18.380 5 0.001          \n207Pb\/204Pb 15.563 0.001          \n208Pb\/204Pb 38.697 0.004          \nCPXITE = clinopyroxenite; HBLITE = hornblendite; GAB = hornblende gabbro; bdl = below detection limits; Soulo. = \nSoulomata catchment; Pogholav. = Pogholavka. 1 = XRF (majors and traces) standard is MRG-1 (Canadian Certified \nReference Materials Project); 2 = REE standard is JA-1 (Geological Survey of Japan); 3 = JB-1 (Geological Survey of Japan); \n4 = J&M solution standard; 5 = JB-1. \nTable 2: Whole rock major and trace element chemistry, and radiogenic isotope composition of nodules. Also \nincludes data (average values and one standard deviation) of reference materials analysed along with samples \nfrom Savo.\n18 \n \n \nFigures \n \nFig. 1: Map of the Solomon Islands showing major tectonic features, and locations discussed in the text. \nWoodlark seafloor ages from Taylor (1987). Plate motions from Petterson et al. (1999). \n \nFig. 2: Total alkalis vs. silica for samples from Savo (after Le Maitre et al. 1989). Samples recalculated to 100% \non a volatile-free basis. Samples are sodic (Na2O−2>K2O), contain less than 20% normative quartz, and are thus \nclassified as a hawaiite–trachyte series.  \n19 \n \nFig. 3: Thin section photomicrographs samples from Savo: A) typical crystal-rich trachyte (SV10) in cross \npolarised light; B) crystalline olivine–clinopyroxene mugearite (SV1); C) benmoreite with fresh clinopyroxene, \nand amphibole replaced by a mixture of clinopyroxene + magnetite + plagioclase (SV12); D) hornblendite with \nclinopyroxene (SV175); E) hornblendite with intercumulus plagioclase and apatite in trachyte host rock \n(SV181); F) hornblende gabbro with hornblende, clinopyroxene and plagioclase (SV55). \n20 \n \nFig. 4: Modal mineralogy of main suite thin sections as determined by point counting (minimum 750 points). \nSamples are ordered by increasing SiO2 contents, left to right. \n \nFig. 5: Plagioclase compositions from unaltered samples. \n21 \n \nFig. 6: Major element Harker variation diagrams for main suite samples and nodules from Savo Island. All data \nrecalculated to 100% on a volatile-free basis. Also shows results of least-squares fractionation models discussed \nin text. Error bars show typical precision (1 standard deviation). \n \n22 \n \nFig. 7: Selected trace element Harker variation diagrams for main suite and nodule samples from Savo Island. \nSiO2 from major element analyses, recalculated to 100% on a volatile-free basis. Error bars show typical \nprecision (1 standard deviation). \n  \n23 \n \nFig. 8: Chondrite-normalised REE plot for a subset of samples from Savo. Normalising values from Boynton \n(1984). Hornblendite sample SV181 has a significant quantity of apatite (P2O5 >1 wt %) and is LREE-enriched \nrelative to hornblendite SV6A. \n24 \n \nFig. 9: A) Sr–Nd diagram for samples from Savo. Fields for Pacific and Indo-Australian MORB from Hofmann \n(1997), New Georgia field from Schuth et al. (2004), and sediments field from König et al. (2007). Error within \npoint size. B) Whole rock common lead isotopes for Savo. Fields from Peate et al. (1997). Error within point size. \n \n25 \n \nFig. 10: A) Behaviour of SrO (wt %) with decreasing XAn (mole fraction anorthite) in plagioclase for a subset of \nelectron microprobe analyses (includes core-to-rim analysis of zones crystals). Points are shaded according to \nhost rock composition. B) Equilibrium melt Sr (ppm) contents, based on DSr values calculated for a given XAn \nfrom the equation of Blundy and Wood (1991). \n \nFig. 11: Behaviour of BaO (wt %) with decreasing XAn in plagioclase for a subset of electron microprobe analyses \n(includes core-to-rim analysis of zoned crystals. Points are shaded according to host rock comparison. Analytical \nprecision is too low to resolve significant variations in calculated equilibrium melt compositions (not shown).  \n26 \n \n \n \n"}