{"doi":"10.1016\/j.ymssp.2005.09.015","coreId":"141066","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1467","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1467","10.1016\/j.ymssp.2005.09.015"],"title":"A comparative experimental study on the diagnostic and prognostic capabilities\nof acoustics emission, vibration and spectrometric oil analysis for spur gears.","authors":["Tan, Chee Keong","Irving, Phil E.","Mba, David"],"enrichments":{"references":[{"id":37925152,"title":"A review of transmission vibration monitoring at Westland Helicopter Ltd. 20 Th European Rotorcraft Forum.","authors":[],"date":"1994","doi":null,"raw":"Cameron, B.G. and Stuckey, M.J. A review of transmission vibration monitoring at Westland Helicopter Ltd. 20 Th European Rotorcraft Forum. Paper 116. pp 116\/1 – 116\/16. 1994.","cites":null},{"id":37925210,"title":"A study on the effect of surface topography on rough friction in roller contact.","authors":[],"date":"2003","doi":"10.1016\/s0043-1648(03)00329-6","raw":"Xiao, L., Rosen, B.G., Amini, N. And Nilsson, P.H. A study on the effect of surface topography on rough friction in roller contact. Wear. Vol 254(11), 1162-1169. 2003.","cites":null},{"id":37925156,"title":"Acoustic emission and ultrasounics.","authors":[],"date":"2000","doi":null,"raw":"Holroyd, T.J. (2000). Acoustic emission and ultrasounics. 1 st ed. Coxmoor Publishing Company. Oxford, UK.","cites":null},{"id":37925135,"title":"Acoustic Emission Testing,","authors":[],"date":"1987","doi":null,"raw":"Miller, R.K. and McIntire, P. Acoustic Emission Testing, Volume 5, 2 nd ed., Nondestructive Testing Handbook. Ed., American Society for Non-destructive Testing, pp 275-310, 1987.","cites":null},{"id":37925216,"title":"Acoustics emission from lubricated and rubbing surfaces.","authors":[],"date":"1989","doi":null,"raw":"MacBride, S.L., Bones, R.J., Sobczyk, M and Viner, M.R. Acoustics emission from lubricated and rubbing surfaces. Journal of Acoustic Emission. 8(1-2). 192-196. 1989.","cites":null},{"id":37925164,"title":"An experimental and theoretical study of the effects of simulated pitch line pitting on the vibration of a geared system. ASME report 77-DET-123.","authors":[],"date":"1977","doi":null,"raw":"Drosjack, M.J. and Houser, D.R. An experimental and theoretical study of the effects of simulated pitch line pitting on the vibration of a geared system. ASME report 77-DET-123. 1977.","cites":null},{"id":37925162,"title":"Analysis of the effects of surface pitting and wear omn the vibration of a gear transmission.","authors":[],"date":"1996","doi":"10.1016\/0301-679x(95)00037-5","raw":"Choy, F.K., Polyschchuk, V., Zakrajsek, J.J., Handschuh, R.F. and Townsend, D.P. Analysis of the effects of surface pitting and wear omn the vibration of a gear transmission. Tribology International.  Vol. 29(1).  77-83. 1996.","cites":null},{"id":37925140,"title":"Applicability of acoustic emissions to monitoring the mechanical integrity of bolted structures in low speed rotating machinery: case study.","authors":[],"date":"2002","doi":"10.1016\/s0963-8695(01)00053-6","raw":"Mba, D. Applicability of acoustic emissions to monitoring the mechanical integrity of bolted structures in low speed rotating machinery: case study. NDT and E International. Vol 35, No. 5, pp. 293-300. 2002.","cites":null},{"id":37925145,"title":"Application of acoustic emission to seeded gear fault detection.","authors":[],"date":"2005","doi":"10.1016\/j.ndteint.2004.06.008","raw":"Toutountzakis, T., Tan, C.K. and Mba, D. Application of acoustic emission to seeded gear fault detection. NDT and E International. Vol. 38, No. 1, pp 27-36. 2005.","cites":null},{"id":37925166,"title":"Best Practices in maximising fault detection in rotating equipment using","authors":[],"date":null,"doi":null,"raw":"Fitch, J.C. Best Practices in maximising fault detection in rotating equipment using WDA. International Conference on Condition Monitoring. Swansea, UK. 65-75.","cites":null},{"id":37925148,"title":"Condition monitoring of helicopter gearboxes using automatic vibration analysis techniques. AGARD CP 369. Gears and power transmission system for helicopter turboprops.","authors":[],"date":"1984","doi":null,"raw":"Gadd, P. and Mitchell, P.J. Condition monitoring of helicopter gearboxes using automatic vibration analysis techniques. AGARD CP 369. Gears and power transmission system for helicopter turboprops. 29\/1 – 29\/10. 1984.","cites":null},{"id":37925137,"title":"Condition monitoring of low-speed rotating machinery using stress waves: Part1 and Part 2. Proc Inst Mech Engrs. Vol 213, Part E,","authors":[],"date":null,"doi":"10.1243\/0954408991529906","raw":"Mba, D. and Bannister, R.H. Condition monitoring of low-speed rotating machinery using stress waves: Part1 and Part 2. Proc Inst Mech Engrs. Vol 213, Part E, pp 153-","cites":null},{"id":37925218,"title":"Correlation between Acoustic Emission activity and asperity contact during meshing of spur gears under partial elastohydrodynamic lubrication., TRIBOLOGY LETTERS,","authors":[],"date":"2005","doi":"10.1007\/s11249-005-7793-1","raw":"C K Tan and D Mba, Correlation between Acoustic Emission activity and asperity contact during meshing of spur gears under partial elastohydrodynamic lubrication., TRIBOLOGY LETTERS, 2005. In Press","cites":null},{"id":37925144,"title":"Detecting Gear Tooth Breakage Using Acoustic Emission: A Feasibility and Sensor Placement Study,","authors":[],"date":"1999","doi":"10.1115\/1.2829503","raw":"Singh, A., Houser, D. R., and Vijayakar, S. Detecting Gear Tooth Breakage Using Acoustic Emission: A Feasibility and Sensor Placement Study, Journal of Mechanical Design. Vol. 121, 587-593, 1999.","cites":null},{"id":37925142,"title":"Detection of Defects in Gears by Acoustic Emission Measurements,","authors":[],"date":"1999","doi":null,"raw":"Tandon, N. and Mata, S. Detection of Defects in Gears by Acoustic Emission Measurements, Journal of Acoustic Emission. Vol. 17, Issue 1-2, 23-27, 1999.","cites":null},{"id":37925143,"title":"Early Detection of Gear Pitting,","authors":[],"date":"1996","doi":null,"raw":"Singh, A., Houser, D. R., and Vijayakar, S. Early Detection of Gear Pitting, Power Transmission and Gearing Conference, ASME. DE-Vol. 88, 673-678, 1996.","cites":null},{"id":37925214,"title":"Englewood Cliffs.","authors":[],"date":"1986","doi":"10.7202\/701977ar","raw":"Suh, N.P. Tribophysics. Prentice-Hall. Englewood Cliffs. NJ. 1986.","cites":null},{"id":37925203,"title":"Fundamental principles in setting alarms and limits in WDA. Practicing Oil Analysis.","authors":[],"date":"2003","doi":null,"raw":"Davis A.M. Fundamental principles in setting alarms and limits in WDA. Practicing Oil Analysis. 2003.","cites":null},{"id":37925160,"title":"Gear tooth stiffness reduction measurement using modal analysis and its use in wear fault severity assessment of spur gears.","authors":[],"date":"2003","doi":"10.1016\/s0963-8695(03)00011-2","raw":"Yesilyurt, I., Gu, F.S. and Ball, A.D. Gear tooth stiffness reduction measurement using modal analysis and its use in wear fault severity assessment of spur gears. NDT & E International. Vol. 36, No. 5. 357-372. 2003.","cites":null},{"id":37925150,"title":"Helicopter gearbox vibration analysis in the Canadian Forces-applications and lessons.","authors":[],"date":"1990","doi":null,"raw":"Leblanc, J.F.A., Dube, J.R.F. and Devereux, B. Helicopter gearbox vibration analysis in the Canadian Forces-applications and lessons.  1 st International Conference, Gearbox noise and vibration. IMechE, Cambridge, UK. C404\/023, pp 173 -177. 1990.  37","cites":null},{"id":37925158,"title":"Identification of the Acoustic Emission source during a comparative study on diagnosis of a spur gearbox.","authors":[],"date":"2005","doi":"10.1016\/j.triboint.2004.10.007","raw":"Tan, C.K. and Mba, D.U. Identification of the Acoustic Emission source during a comparative study on diagnosis of a spur gearbox. Tribology International. Volume 38, Issue 5,  Pages 469-480 , May 2005","cites":null},{"id":37925212,"title":"Investigation of the milling process using acoustic emission signal analysis,","authors":[],"date":"1985","doi":null,"raw":"Diei, E.N. Investigation of the milling process using acoustic emission signal analysis,  PhD. Thesis, Department of Mechanical engineering, University of California, Berkeley, CA. 1985.","cites":null},{"id":37925217,"title":"Limitation of Acoustic Emission for identifying seeded defects in gearboxes.","authors":[],"date":"2005","doi":"10.1007\/s10921-005-6657-9","raw":"Chee Keong Tan and David Mba, Limitation of Acoustic Emission for identifying seeded defects in gearboxes.  Journal of Non-Destructive Evaluation, Vol. 24, No. 1, March 2005, p 11 - 28. ISSN: 0195-9298.","cites":null},{"id":37925136,"title":"Observation of Acoustic Emission Activity During Gear Defect Diagnosis.","authors":[],"date":"2003","doi":"10.1016\/s0963-8695(03)00063-x","raw":"Toutountzakis, T. and Mba, D. Observation of Acoustic Emission Activity During Gear Defect Diagnosis. NDT and E International. Vol. 36, No.7, pp 471-477. 2003.","cites":null},{"id":37925141,"title":"Opportunities offered by acoustic emission for shaft-seal rubbing in power generation turbines; a case study sponsored by the","authors":[],"date":"2003","doi":"10.1243\/095765004773644076","raw":"Mba, D., Cooke, A., Roby, D. and Hewitt, G. Opportunities offered by acoustic emission for shaft-seal rubbing in power generation turbines; a case study sponsored by the British Institute of NDT. International Conference on Condition Monitoring. Oxford, UK, 2-4 July 2003. pp 280-286, ISBN 1901892174. 2003.","cites":null},{"id":37925154,"title":"Recent improvements in oil analysis spectrometers.","authors":[],"date":"1999","doi":null,"raw":"Anderson, D.P., Lukas, M. and Yurko, R.J. Recent improvements in oil analysis spectrometers. International Conference on Condition Monitoring. Swansea, UK. 395-402. 1999.","cites":null},{"id":37925215,"title":"Slip detection using acoustic emission signal analysis.","authors":[],"date":"1987","doi":"10.1109\/robot.1987.1087812","raw":"Dornfeld, D. and Handy, C. Slip detection using acoustic emission signal analysis. IEEE. 1868-1875. 1987.","cites":null},{"id":37925139,"title":"The detection of shaft-seal rubbing in large-scale turbines using acoustic emission.","authors":[],"date":null,"doi":"10.4028\/0-87849-420-0.433","raw":"Mba D. The detection of shaft-seal rubbing in large-scale turbines using acoustic emission. 14th International Congress on Condition Monitoring and Diagnostic Engineering Management (COMADEM'2001).  Manchester, UK, 4-6 September","cites":null},{"id":37925138,"title":"The Use of Acoustic Emission for Machine Condition Monitoring.","authors":[],"date":"1992","doi":"10.1016\/0963-8695(94)90465-0","raw":"Holroyd, T. and Randall, N. The Use of Acoustic Emission for Machine Condition Monitoring. British Journal of Non-Destructive Testing. Vol. 35(2), pp 75. 1992.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007-01-01T00:00:00Z","abstract":"Prognosis of gear life using the acoustic emission (AE) technique is relatively\nnew in condition monitoring of rotating machinery. This paper describes an\nexperimental investigation on spur gears in which natural pitting was allowed to\noccur. Throughout the test period, AE, vibration and spectrometric oil samples\nwere monitored continuously in order to correlate and compare these techniques\nto natural life degradation of the gears. It was observed that based on the\nanalysis of root mean square (rms) levels only the AE technique was more\nsensitive in detecting and monitoring pitting than either the vibration or\nspectrometric oil analysis (SOA) techniques. It is concluded that as AE\nexhibited a direct relationship with pitting progression, it offers the\nopportunity for prognosis","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/141066.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.ymssp.2005.09.015","pdfHashValue":"8f1659628c33b835ed9f22b97f5ef069c45d9c83","publisher":"Elsevier Science B.V., Amsterdam","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1467<\/identifier><datestamp>2011-12-13T11:40:59Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>A comparative experimental study on the diagnostic and prognostic capabilities\nof acoustics emission, vibration and spectrometric oil analysis for spur gears.<\/dc:title><dc:creator>Tan, Chee Keong<\/dc:creator><dc:creator>Irving, Phil E.<\/dc:creator><dc:creator>Mba, David<\/dc:creator><dc:subject>Acoustic emission<\/dc:subject><dc:subject>Condition monitoring<\/dc:subject><dc:subject>Gear pitting<\/dc:subject><dc:subject>Machine diagnosis<\/dc:subject><dc:subject>Prognosis<\/dc:subject><dc:subject>Spectrometric oil analysis<\/dc:subject><dc:subject>Vibration analysis<\/dc:subject><dc:description>Prognosis of gear life using the acoustic emission (AE) technique is relatively\nnew in condition monitoring of rotating machinery. This paper describes an\nexperimental investigation on spur gears in which natural pitting was allowed to\noccur. Throughout the test period, AE, vibration and spectrometric oil samples\nwere monitored continuously in order to correlate and compare these techniques\nto natural life degradation of the gears. It was observed that based on the\nanalysis of root mean square (rms) levels only the AE technique was more\nsensitive in detecting and monitoring pitting than either the vibration or\nspectrometric oil analysis (SOA) techniques. It is concluded that as AE\nexhibited a direct relationship with pitting progression, it offers the\nopportunity for prognosis.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam<\/dc:publisher><dc:date>2011-11-28T23:09:07Z<\/dc:date><dc:date>2011-11-28T23:09:07Z<\/dc:date><dc:date>2007-01-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Chee Keong Tan, Phil Irving and David Mba, A comparative experimental study on\nthe diagnostic and prognostic capabilities of acoustics emission, vibration and\nspectrometric oil analysis for spur gears, Mechanical Systems and Signal\nProcessing, Volume 21, Issue 1, January 2007, Pages 208-233.<\/dc:identifier><dc:identifier>0888-3270<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.ymssp.2005.09.015<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1467<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0888-3270","0888-3270"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Acoustic emission","Condition monitoring","Gear pitting","Machine diagnosis","Prognosis","Spectrometric oil analysis","Vibration analysis"],"subject":["Article"],"fullText":" 1\nA comparative experimental study on the diagnostic and prognostic \ncapabilities of Acoustics Emission, Vibration and Spectrometric Oil Analysis \nfor spur gears \n \n  Chee Keong Tan1, Phil Irving1 and David Mba2 \n1 School of Industrial and Manufacturing Science, 2 School of Engineering,  Cranfield University, \nBedfordshire. MK43 0AL, UK \nE-mail :- p.e.irving@cranfield.ac.uk, d.mba@cranfield.ac.uk \n \nABSTRACT \n \nPrognosis of gear life using the Acoustic Emission (AE) technique is relatively new in \ncondition monitoring of rotating machinery. This paper describes an experimental \ninvestigation on spur gears in which natural pitting was allowed to occur. Throughout the \ntest period, AE, vibration and spectrometric oil samples were monitored continuously in \norder to correlate and compare these techniques to natural life degradation of the gears. It \nwas observed that based on the analysis of r.m.s levels only the AE technique was more \nsensitive in detecting and monitoring pitting than either the vibration or Spectrometric Oil \nAnalysis (SOA) techniques. It is concluded that as AE exhibited a direct relationship with \npitting progression, it offers the opportunity for prognosis.  \n \nKEYWORDS \nAcoustic Emission, condition monitoring, gear pitting, machine diagnosis, prognosis, \nSpectrometric Oil Analysis, Vibration analysis \n \n 2\n1. INTRODUCTION \n \nAcoustic emission (AE) was originally developed for non-destructive testing of static \nstructures [1], however, over recent years its application has been extended to health \nmonitoring of rotating machines and bearings [2-7]. It offers the advantage of earlier \ndefect detection for gearboxes in comparison to vibration analysis [8-10]. However, on \nseeded faults in gearboxes, this is not without difficulties [11].  \n \nThe use of vibration analysis for gear fault diagnosis and monitoring has been widely \ninvestigated and its application in industry is well established [12-14]. This is particularly \nreflected in the aviation industry where the helicopter engine, drive trains and rotor \nsystems are fitted with vibration sensors for component health monitoring. Similarly, \nSpectrometric Oil Analysis (SOA) has been routinely used for elemental analysis of wear \nparticles, contaminants and additives in lubricants for more than 50 years [15]. Analysis \nof wear particles can assist in determining the source of wear and the condition of the \nmachine. In the aviation industry, this technique has been successfully employed for \ncondition monitoring of rotating components prior the introduction of vibration \nmonitoring technique. Today, it still serves as a complementary diagnostic tool for most \naircraft\/helicopter platforms. The basic idea of spectrometry is to identify and quantify \nwear particles from an oil sample. Typical spectrometers are capable of detecting wear \nparticles of between 5 and 10μm. \n \n 3\nIn this paper, the authors present results from an experimental programme that observed \nthe relationship between AE, vibration and SOA with natural progressive pitting in a pair \nof spur gears. \n \n2. BACKGROUND \n2.1 Acoustics Emission (AE) \n \nAE is defined as transient elastic waves generated due to a rapid release of strain energy \ncaused by structural alteration in\/on a solid material under mechanical or thermal \nstresses. Primary sources of AE are crack initiation, crack propagation, plastic \ndeformation and friction. AE was originally developed as a method of Non-Destructive \nTesting (NDT) where it was used to monitor crack initiation, propagation and location. \nAttempts to apply this technique to condition monitoring started in the late 1960’s [16]. \nSome of the principal advantages of AE include:  \n \na) As AE is non-directional, one AE sensor is sufficient to perform the task \ncompared to other techniques such as vibration monitoring which can \nrequire information from three axes. \nb) Since AE is produced at microscopic level it is highly sensitive and offers \nopportunities for identifying defects at an earlier stage when compared to \nother condition monitoring techniques. A typical example is the proven \nability [3] to detect the earliest stages of bearing degradation.  \n 4\nc) As AE only detects high frequency elastic waves, it is insensitive to \nstructural resonances and typical mechanical background noise (<20kHz).  \n \nHowever, the main concern on application of the AE technique is the attenuation of the \nsignal during propagation and as such the AE sensor has to be as close to its source as \npossible. This limitation may pose a practical constraint when applying this technique to \ncertain rotating machinery. \n \n2.2 AE source during gear meshing \n \nUnderstanding the source of AE activity at the gear mesh is a fundamental pre-requisite if \nthis technique is to be successfully employed for gear diagnostics and prognostics. \nToutountzakis [11] highlighted limitations in the current understanding of the source \nmechanism of AE during gear meshing. Tan et al [17] ascertained the AE source \nmechanism through a series of experimental programmes. These experimental \nprogrammes consisted of isothermal tests on undamaged gears to explore the effects of \nrotational speed and applied torque on AE levels. From the isothermal test results, it was \nobserved that variation of the applied torque had a negligible effect on the AE r.m.s \nlevels, similar to the negligible effect of load on film thickness under \nElastohydrodynamic Lubrication (EHL) of non-conforming mating surfaces. It also noted \nthat the variation in rotation speed had a more pronounced effect on AE r.m.s levels \nrelative to the load. Tan et al [17, 29] concluded that the source of AE during gear mesh \nwas asperity contact under rolling and sliding of the meshing gear teeth surfaces. These \n 5\nobservations detailed by Tan et al [17, 29] were under isothermal conditions. In \nconditions other than isothermal, an increase in speed and load will result in increased \nAE levels [26]. \n \n2.3 Vibration characteristics and gear damage \n \nYesilyurt et al [18] utilised the vibration analysis technique for damage detection and \nassessment, and stated that gear tooth damage would cause a reduction in tooth stiffness \nand the extent of this damage could be monitored. Yesilyurt concluded that for \ndistributed damage condition the reduction of tooth stiffness and loss of gear tooth \ninvolute profile contribute to the increase in vibration. However, in the case of localised \ndefect, tooth stiffness reduction was the sole contributor to the increase in vibration \nlevels. Choy et al [19] came to a similar conclusion. Drosjack et al [20] presented an \nexperimental and theoretical study on the effect of simulated pits located on the pitch-line \nusing vibration technique. Drosjack concluded that pitting on gear teeth surfaces altered \nthe vibration characteristics via the change in stiffness of the gear teeth. \n \nIn summary, the presence of damage such as pitting, either localised or distributed, will \nalter the stiffness of the gear due to modification of the Hertzian contact zone. In \naddition, an impulsive reaction between gears that have lost the original involute profile \nwill change the vibration levels from the gears. \n \n \n 6\n \n3. EXPERIMENTAL SET-UP \n \nThe test-rig employed for this experimental work consisted of two identical oil-bath \nlubricated gearboxes, connected in a back-to-back arrangement, see figure 1. The gear set \nemployed was made of 045M15 steel (without any heat treatment) which had a measured \nhardness of 137 Hv30. The gears (49 and 65 teeth) had a module of 3 mm, a pressure \nangle of 20°, and a surface roughness (Ra) of between 2-3 µm. A simple mechanism that \npermitted a pair of coupling flanges to be rotated relative to each other, and locked in \nposition, was employed to apply torque to the gears.  \n \nThe AE sensors used for this experiment were broadband type with relatively flat \nresponse in the region between 100 KHz to 1MHz. One sensor was placed on the pinion \nwith 49 teeth. And the second AE sensor was located on the bearing casing. The cable \nconnecting the sensor placed on the pinion with the pre-amplifier was fed into the shaft \nand connected to a slip ring (‘IDM’ PH-12). This arrangement allowed the AE sensor to \nbe placed as close as possible to the gear teeth. The sensor was held in place with strong \nadhesive superglue. The output signal from the AE sensors was pre-amplified at 20dB. \nThe signal output from the pre-amplifier was connected (i.e. via BNC\/coaxial cable) \ndirectly to a commercial data acquisition card. \n \nAn accelerometer was fitted onto the bearing casing to record vibration data, see figure 1. \nThe accelerometer used for vibration measurement in this experiment was a resonant type \n 7\nsensor with a frequency response between 10 Hz and 8000 Hz. The accelerometer was \nmounted on the base of the bearing casing connecting to the pinion shaft. The \naccelerometer was connected to a charge amplifier, and the signal output from the pre-\namplifier was fed to a commercial data acquisition card.   \n \n \nFigure 1 Back-to-back gearbox arrangement with AE sensors and \naccelerometer \n \nIn normal gearbox operation, an anti-wear lubricant is usually employed to prevent or \nslow down wear on the gear teeth.  In order to initiate surface pitting in a relatively short \ntime frame, lubricant oil without anti-wear properties was employed for the accelerated \ngear fatigue tests; SAE 20W-50. Also, to accelerate the pitting process the face width of \nthe pinion employed was half that of the wheel. \nAE sensor\nAccelerometer \n 8\n4. EXPERIMENTAL PROCEDURES \n \nThe fatigue gear tests were performed at a rotational speed of 745 rpm and applied \ntorques of 220, 147 and 73 Nm. Two tests were undertaken at each torque to ensure \nrepeatability. At regular intervals (ranging from 15 to 55 hours depending on the applied \ntorque levels), visual inspection of gear surface damage was undertaken, oil sump \ntemperatures were measured and oil samples were drawn for SOA (see table 1 and 2). \n \nTable 1 Inspection and SOA collection intervals for all the test conditions \nApplied Torque \n73 Nm \nTest 1        |        Test 2 \n147 Nm \nTest 1        |        Test 2 \n220 Nm \nTest 1        |        Test 2 \nInterval \nNo. \n                                   Cumulative inspection time (hours) \n1 0 0 0 0 0 0 \n2 45 49 24 24 9 17 \n3 95 96 46 48 20 28 \n4 145 144 70 72 31 40 \n5 196 193 94 96 41 52 \n6 268 241 118 121 54 70 \n7 353 290 143 145 70 86 \n8 425 341   91  \n9 485 403   116  \n10  472     \n 9\n \nTable 2 Oil temperatures at respective inspection intervals for all the test \nconditions \nApplied Torque \n73 Nm \nTest 1        |        Test 2 \n147 Nm \nTest 1        |        Test 2 \n220 Nm \nTest 1        |        Test 2 \nInterval \nNo. \nOil temperatures at respective cumulative inspection times (0C) \n1 19.7 21.7 24.1 22.1 23.1 23.8 \n2 36.5 37.4 48.0 44.5 60.9 60.5 \n3 36.3 37.0 50.2 46.7 64.1 61.9 \n4 38.2 37.6 51.7 48.3 63.8 62.9 \n5 37.8 39.4 52.8 50.3 65.3 63.8 \n6 36.2 37.9 54.3 51.3 65.2 63.1 \n7 36.4 40.2 49.9 51.0 66.0 63.9 \n8 35.7 41.9   63.0  \n9 35.9 40.5   64.0  \n10  48.0     \n \nContinuous AE r.m.s values from the bearing casing and pinion gear were calculated in \nreal time by the analogue-to-digital converter (ADC) controlling software. This software \nemployed a hardware accelerator to perform calculations in real time for a programmable \ntime interval set by the user, 10ms in this instance and a sampling interval of 90ms was \nemployed. Anti-aliasing filters were also employed prior to the ADC. Raw vibration \n 10\nwaveforms, sampled at 8192 Hz, were recorded for a period of 1 second at intervals of 30 \nminutes. Vibration r.m.s values were calculated over the recorded duration (1-second). \n \nDuring the inspection interval, gear teeth surfaces on both the pinion and gear were \nvisually inspected for pitting or other abnormalities such as scoring and scuffing. The \nlargest pitted area on any single tooth was recorded. The authors set the failure, or test \ntermination, criterion at 50% pitted area of the gear tooth surface area. The visual \ninspections were performed by two separate inspectors independently and repeated for \nconsistency. This inspection error was determined to be ± 5% of pitted area. \n \nThe spectrometer used for SOA is an Atomic Emission type, namely Inductively Coupled \nplasma (ICP). The analysis was performed by subjecting the oil sample to high voltage \nplasma which energises the atomic structure of the metallic elements, causing emission of \nlight. The emitted light is subsequently focused into the optical path of the spectrometer \nand separated by wavelength, converted to electrical energy and measured. The intensity \nof the emitted light for any element is proportional to the concentration of wear metal \nsuspended in the lubricating fluid. The ICP used for determining levels of Fe elements in \nthe lubricating fluid had an accuracy of ±  3% at an average precision of 95% confidence \nlevel. \n \n \n \n \n 11\n5. RESULTS \n5.1 Pitting Rates  \n \nFigure 2 shows percentage of the gear surface pitted area plotted against the test \noperating time. For each torque condition a linear equation was fitted to both sets of data. \nThe worst fit was at 73 Nm with a correlation coefficient value (R2) of 0.8696. The \ngradient values of the equations fitted to each data set represent the pitting rates at each \napplied torque. These values were 0.45, 0.35 and 0.10 (%\/hr) for 220, 147 and 73 Nm \nrespectively. The highest gear teeth pitting rate was observed at 220 Nm (figure 2). With \ndecreasing torque levels the rate of pitting decreased.  \nR2 = 0.9724\nR2 = 0.9905\nR2 = 0.8696\n0\n10\n20\n30\n40\n50\n60\n0 100 200 300 400 500\nOperating Time (hours)\nPe\nrc\nen\nta\nge\n o\nf g\nea\nr \npi\ntte\nd \nar\nea\n (%\n)\n220 Nm 147 Nm 73 Nm\n \nFigure 2 Pitting rates of the test gear under 220, 147 and 73 Nm; 745 rpm \n \n \n 12\n5.2 Data Analysis \n \nAll original data from AE, SOA and vibration are presented in figures 3 to 10 (220Nm) \nand figures 18 to 33 (147 and 73Nm) in appendix B. A few general observations on all \ntorque levels were noted. From figure 3, it can be seen that in one of the tests the AE \nr.m.s initially decreased, whereas in the other it increased from the start. After \napproximately 15 hours the AE levels in both tests increased at very similar rates \n(gradients) but different absolute AE r.m.s values. Figure 4 shows a plot of AE r.m.s \nversus the percent gear pitted area illustrating a linear relationship between the two for \nboth tests. A totally linear relationship was not mirrored from the AE measurements \ntaken from the bearing casing, see figures 5 and 6. In the latter instance a linear \nrelationship was noted from approximately 15 hours until about 70 hours after which a \nrelatively rapid rise in r.m.s values was noted. The reason AE measurements from the \nbearing casing were not completely linear, as observed from AE measurements taken \nfrom the gear pinion, was attributed to attenuation, increased vibration levels after 70 \noperational hours (see figure 7)  and varying transmission paths through the bearing as a \nfunction of roller position. The influence of roller position within the bearing on AE \ntransmission was recently noted by Tan et al [28]. \n 13\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\n0.0 20.0 40.0 60.0 80.0 100.0 120.0\nTime (h)\nA\nE\n r\n.m\n.s \n(V\n)\n220Nm (1)\n220Nm (2)\n \nFigure 3 AE r.m.s against operating time at 220 Nm; 745 rpm \n0.00\n0.02\n0.04\n0.06\n0.08\n0.10\n0 10 20 30 40 50 60\n% of gear pitted area\nA\nE\n r\n.m\n.s.\n (v\n)\n220Nm(1) 220Nm(2)\n \nFigure 4 AE r.m.s against % pitted area; 220 Nm, 745 rpm \n 14\n0\n0.01\n0.02\n0.03\n0.04\n0.05\n0.0 20.0 40.0 60.0 80.0 100.0 120.0\nTime (h)\nB\nea\nri\nng\n c\nas\nin\ng \nA\nE\n r\n.m\n.s \n(V\n)\n220Nm (1)\n220Nm (2)\n \nFigure 5 Bearing casing AE r.m.s against operating time at 220 Nm; 745 rpm \n0\n0.0005\n0.001\n0.0015\n0.002\n0.0025\n0.003\n0.0035\n0.004\n0 10 20 30 40 50 60\n% of gear pitted area\nB\nea\nri\nng\n c\nas\nin\ng \nA\nE\n r\n.m\n.s \n(v\n)\n220Nm(1) 220Nm(2)\nFigure 6 Bearing casing AE r.m.s against % pitted area; 220 Nm, 745 rpm \n \n 15\nFigure 7 shows vibration r.m.s values against time for the 220Nm test. It demonstrates \nthat the application of the same torque produced similar vibration r.m.s values until 60 \nhours when the tests departed from each other. Also it was observed that there was an \ninitial increase of vibration level from 0 to between 10 and 15 hours, thereafter the \nvibration level remained relatively constant until 60 hours. Figure 8 shows the original \nvibration r.m.s values plotted against percentage of pitted area. Following the run-in \nperiod vibration levels remained constant until 25% pitted area, after which levels rose \nsteadily. \n0.00\n0.20\n0.40\n0.60\n0.80\n0 20 40 60 80 100 120 140\nOperating Time (hours)\nV\nib\nra\ntio\nn \nr.\nm\n.s.\n (v\n)\n220(1) 220(2)\n \nFigure 7 Vibration r.m.s against operating time at 220 Nm; 745 rpm \n 16\n0.00\n0.20\n0.40\n0.60\n0.80\n0 10 20 30 40 50 60\n% of gear pitted area\nV\nib\nra\ntio\nn \nr.\nm\n.s.\n (v\n)\n220(1) 220(2)\n \nFigure 8 Vibration r.m.s against % pitted area; 220 Nm, 745 rpm \n \nFrom figure 9 levels of SOA with operating time are presented which show diverging \nlevels after approximately 17 hours of operation. It is interesting to note that though SOA \nlevels for both tests diverged, they maintained an approximately similar overall gradient.  \nFigure 10 shows absolute Fe concentration levels at different percentage pitted areas; the \ndifferences between both tests under the same torque can be noted. \n 17\n0\n100\n200\n300\n400\n0 20 40 60 80 100 120\nOperating Time (hours)\nFe\n C\non\nce\nnt\nra\ntio\nn \n(p\npm\n220(1) 220(2)\n \nFigure 9 Fe concentration with correction against operating time at 220 Nm; \n745 rpm \n \n 18\n0\n100\n200\n300\n400\n0 10 20 30 40 50 60\n% of gear pitted area\nFe\n C\non\nce\nnt\nra\ntio\nn \n(p\npm\n) \n220(1) 220(2)\n \nFigure 10 Fe concentration with correction against % pitted area; 220 Nm, 745 \nrpm \n \nThe observed pitting progression for all test conditions are summarised in Appendix A \nwhich lists all detailed observations of scoring, pitting rates and location of pitting in \nrelation to the gear face area (dedendum, pitch and addendum) as a function of operating \ntime. The experiments revealed that pitting occurred from the dedendum and moved \ntowards the pitch-line. For the higher applied torque conditions (220 and 147 Nm), the \npitting always occurred across the face width and was evident on most of the gear teeth. \nFor the light torque condition (73 Nm), pits spread across the face width of the gear teeth \nat a much slower rate and was localised to only a few teeth. With prolonged operation \ntime, the pitting spread across to other gear teeth. Figures 11 to 13 show the progression \n 19\nof gear tooth pitting from 6.3% to 41.7% of gear pitted area, under the test condition of \n73 Nm and  745 rpm.  \n \n \n \nFigure 11 6.3% of gear pitted area at 48.5 hours of operating time; 73 Nm and \n745 rpm \n \nPits\n 20\n \n \nFigure 12 27.8% of gear pitted area at 240.5 hours of operating time; 73 Nm and \n745 rpm \n \nPits \n 21\n \n \nFigure 13 41.7% of gear pitted area at 402.5 hours of operating time; 73 Nm and \n745 rpm \n \n6. DISCUSSION \n \n6.1 AE and pitting \n \nIn relating AE activity to pitting rates cognisance of the effects of surface roughness, \nlubrication regime, friction and the slide-to-rolling ratio of the meshing gears must be \nconsidered. Xiao et al [23] investigated the effect of surface topography on lubricated \nsliding gear surfaces and noted that friction coefficient of mating surfaces increased with \nincreasing average surface roughness. Diei [24] proposed a relationship between AE \nPits \n 22\nr.m.s and the rate of frictional energy dissipation from sliding contact. In relating AE to \nsliding friction Dornfeld [26] et al have shown the high sensitivity of AE to sliding speed \nand applied load. It was noted that the basic mechanism for AE generation during sliding \nwas the elastic deformation of the material at asperity contacts. This deformation was \naugmented by increased rates (sliding speed), contact forces and lubrication. \nFurthermore, the relationship between AE and wear of mating surfaces was presented by \nMcBride et al [27] where it was stated that ‘This paper shows that asperity contact can be \ndetected by acoustic emission measurements, and that such measurements can provide a \nvital understanding of the complex wear processes in both dry and lubricated situations’. \nSuh [25] defined asperity deformation as the main determinant of friction in metal to \nmetal contact whilst Tan et al [17] concluded that the source of AE during the gear mesh \nwas attributed to asperity contact. Based on the observations of AE activity and pitting \nprogression during this investigation, and conclusions of the various researchers detailed \nabove, the authors postulate that AE levels will increase with increasing gear pitted area. \nA consequence of the increase in pitted area is an increase of surface roughness and \nfriction, leading to an increase in AE levels. This deduction was confirmed by the \nobservations of AE r.m.s levels from the pinion gear (figures 3, 4 and 18 to 21) which \nshow AE levels increasing with operating time \/ gear pitted area. However, observations \nof AE levels from the bearing casing were inconsistent. Whilst at the higher torque value \nof 220Nm a direct relationship between AE levels and pitting was observed, the AE \nresponse at the lower torque values of 147Nm and 73Nm were not sensitive to \nmonitoring the rate of surface degradation.  \n \n 23\n \n6.3 Diagnostics and prognostics capabilities \n \nIn assessing the diagnostics and prognostics capabilities of the AE, SOA and vibration \nmonitoring techniques for gear teeth surface pitting wear, the following questions arise: \n \n1) Which is the best indicator for monitoring pit growth? \n2) How does load affect the various indicators? \n3) What is the prognostic potential of these technique? \n  \n6.3.1  Which is the best indicator for monitoring pit growth? \n \nClearly, there existed an initial period during which the gear teeth surface smoothened \nout, oil sump temperatures increased and dynamic stabilisation of the rotating systems \n(such as bearing, alignments etc) took place. Because of the complexity involved during \nthis process, it was deemed inappropriate to relate any of the monitoring indicators to this \nperiod; 0 to 15hrs. However, after this initial period defined as wear-in, the monitoring \nindicators behaved differently with pit progressions. As discussed earlier, AE r.m.s levels \nexhibited a linear relationship with running time (as observed from AE measurements \ntaken from the gear after the run-in period), which was not necessarily the case for \nvibration, SOA and AE (bearing casing) observations. \n \n \n 24\n \n6.3.1.1  The AE technique \n \nThroughout the duration of the tests it is believed that there are two processes affecting \nthe generation of AE. Firstly, the wear-in process which causes a smoothing of surface \nroughness with a consequent decrease in AE levels. The second involves the increased \nsurface roughness due to pitting progression\/development which will increase surface \nroughness and AE levels. At the beginning of the tests AE levels will also be influenced \nby the oil film temperature and dynamic characteristics of the test-rig arrangement. \nIncreasing oil temperature will lead to a reduction of oil film thickness; this encourages \nmore asperity contacts resulting in increased AE levels. On the other hand, the smoothing \nof the gear teeth surfaces due to the wear-in process will reduce surface roughness which \nwill result in lower AE levels.  Furthermore, the authors postulate that the factors that \ndetermine the onset value of the AE level are the initial surface roughness of the gear \nteeth surfaces, assembly of the gear components and bearings, and, the initial oil \ntemperature.  \n \nThe two test results  at 220Nm, see figure 3, exhibited different trends at the start of the \ntests; ‘220(1)’ showed decreasing AE levels up to 15 hours operational time, whereas AE \nlevel for ‘220(2)’ increased from the start of the test.  It is postulated that the difference is \ndue to the balancing process between increasing oil temperature and reducing surface \nroughness of the gear teeth, which have opposing effects on AE levels. In addition, the \nauthors cannot guarantee that the exact positioning of the gear wheels and clearances \n 25\nwithin the gearbox were identical for each test condition; best practice was followed. For \nthis particular test, from about 15 hours, 8% of gear pitted area; the AE r.m.s values \nincreased linearly with increasing running time and pitted area. An important point to \nnote; both test cases exhibit similar gradient from 8% pitted area or 15 hours running \ntime onward. Similar observations were noted for 147 and 73 Nm tests (see figures 18 to \n21 of appendix B). The linear relationship between AE levels measured from the sensor \nplaced on the pinion and pit growth rate at all torque conditions was encouraging and \nemphasised the sensitivity of the AE technique. \n \nObservations of AE activity measured from the bearing casing showed differing \ncorrelations between torque levels and pitting wear. At 220Nm, and after 15hours run-in, \na linear relationship between AE levels and pit growth was noted until about 70 hours of \noperation. At this instance the rate of increase in AE r.m.s levels with operating \ntime\/wear increased further; deviating from the linear relationship, see figure 5. It is \ninteresting to note that at 70 hours of operation the vibration levels of the bearing casing \nincreased; see section 6.3.1.2 and figure 7. The increase in the rate of increasing AE \nlevels at this instance (70hrs) is attributed to the additional generation of AE from within \nthe bearing as a direct result of increased vibration. This is in addition to the AE \ngenerated from the wearing of the gears. At the lower torque levels the observations of \nAE activity were different to that observed at 220Nm.  At the lower torque loads the AE \nlevels remained at electronic noise levels until about 50, 80 and 130 hours, depending on \nthe load and test, after which a sudden increase in AE levels were noted, see figures 22 to \n25 of appendix B. \n 26\n \n6.3.1.2  The Vibration technique \n \nFigure 9 shows the plot for vibration r.m.s against gearbox operating time under an \napplied torque of 220Nm. Vibration r.m.s increased from 0 to between 10 to 15 hours, \nwhich was indicative of increasing oil temperature (see table 2) and decreasing oil film \nthickness. As oil film thickness reduced, the damping effect of the oil film between the \nmeshing gear teeth surfaces will reduce resulting in increasing vibration levels. A plateau \nwas observed for the vibration r.m.s between 15 to 55 hours of the running time, even \nthough gear surface pitted area increased to 25%, see figure 10. This showed that \nvibration technique was unable to monitor the pit grow process until the pit development \nwas advanced. Hence at this point, it can be concluded that AE technique has an \nadvantage over vibration technique in terms of pit growth monitoring. Observations of \nvibration response at 147Nm and 73Nm, figures 26 to 29 of appendix B, reiterated the \nobservations detailed above. Unfortunately during the second test condition under \n147Nm the vibration acquisition system failed, thus only one test result for vibration is \navailable at this condition. In summary, the vibration response increased when minimum \ncriteria of 25% pitted area was reached which is attributed to alterations in the stiffness of \nthe gear due to modification of the Hertzian contact zone. It must be noted that for this \nparticular investigation the gearbox configuration is very simple, on real operational \ngearboxes as used on helicopters, the detection of pitting would occur later in operational \nlife. This conclusion is attributed to the increased background noise levels and highly \ncomplex transmission path from the gears to the sensor. \n 27\n \n6.3.1.3       Fe Concentration \n \nAs mentioned earlier it is believed that there are two processes operating during the tests. \nFirstly, the wear-in progress which causes a smoothening of surface roughness, and \nsecondly the increased surface roughness due to pitting progression\/development. At the \nbeginning of the tests SOA levels will also be influenced by oil film temperature. An \nincrease in oil temperature will led to a reduction of oil film thickness which will result in \nincreased asperity contact hence increased Fe concentration levels.  On the other hand, \nthe smoothening of the gear teeth surface due to the wear-in progress will also result in \nFe particle production. Typically the concentration levels increased with operational time \nand level of applied torque. However, this was not exactly true for the test condition of \n73Nm, see figures 9, 10, and 30 to 33 of appendix B.  The authors postulate that as the pit \nrate at 73 Nm test condition is significantly lower than the other tests, the concentration \nof pit particles within the SOA detectable range may not increase consistently with the \noperating time. However, when all Fe data are plotted against percentage pitting, see \nfigure 17, more consistent behaviour is obtained after 20% gear pitted area. The unique \nobservation of Fe concentration levels for the first 15 hrs at 73Nm is attributed to the \nparticle generation during wear-in. From this observation it is envisage that for the torque \nconditions where pit development is slow, wear-in will dominate over particles generated \nfrom pits until such a time that pit progress begins. \n \n 28\nAt the higher applied torque (220 Nm) the averaged absolute value of the Fe \nconcentration was significantly higher than at 147 and 74 Nm; 146.5ppm compared to \n43.5 and 24.5ppm respectively. \n \n6.3.1 How does load affect the various indicators? \n \nThe influence of torque on these monitoring indicators could provide valuable \ninformation on the potential, or limitation, in applying these techniques in practical \nsituations where environmental and operational factors come into play. The load \ndependency of each indicator was investigated in terms of gearbox operating\/running \ntime and percentage of gear pitted area. \n \n6.3.2.1  Gear AE r.m.s \n \nFrom figure 14 at any particular given operating time, the greater the applied torque the \ngreater the AE r.m.s value. This is due to the fact that the lubricant oil temperature is \nrelatively higher at higher applied torques, which in turn produced a smaller oil film \nthickness. The average oil temperatures for 220, 147 and 73 Nm were 63.2, 50.0 and \n38.30C respectively (see table 2). The thinner oil film will result in more asperity contact \nat the meshing gear teeth surfaces, thus higher AE activity. This will only hold true when \nthe lubricating regime is under partial EHL. It was also observed that the rate of pitting \nincreased at higher torques. In addition, this showed that the AE technique had a good \nsensitivity to percentage pitted gear area at all torque levels following the wear-in period.  \n 29\n \n0.0000\n0.2000\n0.4000\n0.6000\n0.8000\n1.0000\n1.2000\n0.0 50.0 100.0 150.0 200.0 250.0 300.0 350.0 400.0 450.0 500.0\nTime (h)\nA\nE\n r\n.m\n.s \n(V\n)\n \nFigure 14 AE r.m.s against gearbox operating time for various torque conditions \nat 745rpm \n \n6.3.2.2 Bearing casing AE r.m.s \n \nFrom figure 15 at any particular given operating time, the greater the applied torque the \ngreater the AE r.m.s value though this was dependent on the operational time. At 220Nm \nthe rate of increase in levels of AE showed good sensitivity to pitting but this was not the \ncase at the lower torque loads (147 and 73Nm). At 147Nm AE levels remained at \nelectronic noise levels until 50 and 80 hours of operation. At these times AE activity \nincreased as a result of the wear on the gear faces, see figures 22 to 25 of Appendix B. It \n220Nm\n147Nm\n73Nm \n 30\nis worth stating that the reason for this reduced sensitivity of AE measurements from the \nbearing casing is attributed to attenuation of the high frequency AE waves. The influence \nof transmission path (i.e., the location of the roller in the bearing) will also contribute to \nthe reduced sensitivity [28]. \n0\n0.005\n0.01\n0.015\n0.02\n0.025\n0.03\n0.035\n0.04\n0.045\n0.05\n0.0 50.0 100.0 150.0 200.0 250.0 300.0 350.0 400.0 450.0 500.0\nTime (h)\nB\nea\nri\nng\n c\nas\nin\ng \nA\nE\n r\n.m\n.s \n(V\n)\n \nFigure 15 Bearing casing AE r.m.s against gearbox operating time for various \ntorque conditions at 745rpm \n \n \n \n \n \n \n220Nm\n147Nm 73Nm \n 31\n6.3.2.3 Vibration r.m.s \n0.00\n0.10\n0.20\n0.30\n0.40\n0.50\n0.60\n0.70\n0.80\n0 100 200 300 400 500\nOperating Time (hours)\nV\nib\nra\ntio\nn \nr.\nm\n.s.\n (v\n)\n \nFigure 16 Vibration r.m.s against gearbox operating time for various torque \nconditions at 745rpm \n \nFrom figure 16 it is clear that the highest applied torque resulted in the steepest rise in \nvibration r.m.s levels. This was expected as the higher applied torque produced higher \npitting rates, which will modify the Hertzian contact zone at a faster rate. Furthermore, \nfrom figure 16 it was apparent that vibrations levels for 220Nm and 147Nm showed \nsimilar patterns of pitting progression, see figures 7 and 26 of Appendix B, i.e., a steep \nrise in vibration levels at the start of the tests; a relative period of constant levels followed \nby a steep rise before termination of the tests. This pattern was observed for one of the \ntests at 73Nm, see figure 27 [73 (1)], however, the pattern was not mirrored for the \n220Nm\n147Nm\n73Nm \n 32\nsecond test at 73Nm. It is interesting to note that though the data for vibration at 220Nm \nand 147Nm showed a ‘plateau region’ (steady vibration level even though pitting steadily \nincreased during this period) the value of percentage gear pitted area at which the r.m.s \nrose above the plateau region varied; 30% at 220Nm, 20% at 147Nm and 40% at 73Nm, \nsee figure 8 and 28 and 29 of appendix B. The response of vibration to gear pitted area \nwas considerably less sensitive than AE at all torque levels.  \n \n6.3.1.4  Fe Concentration \n \nThe Fe concentration plots with respect to gearbox operating time, see figure 17, showed \nthat the higher the applied torque, the steeper the gradients. It is important to note that at \nthe torque value of 73Nm a period existed where Fe concentration changed relatively \nslowly with respect to the running time.  \n 33\n0\n100\n200\n300\n400\n0 100 200 300 400 500\nOperating Time (hours)\nFe\n C\non\nce\nnt\nra\ntio\nn \n(p\npm\n \nFigure 17 Fe concentration against gearbox operating time for various torque \nconditions at 745 rpm \n \n6.3.2 What is the prognosis potential of these technique? \n \nFrom the results presented it was clearly evident that the AE levels measured from the \ngear pinion could be linearly correlated to the gearbox pitting rates for all torque \nconditions, with detection of onset of pitting as early as 8% of the pitted area. This \noffered much earlier diagnosis than vibration analysis where only after between 20 to \n40% of pitted area did this technique offer capability for defect identification. It was \ninteresting to note that measurements of AE levels from the bearing casing suggested \nbetter sensitivity to pitting progression than vibration but only at the higher torque level \n220Nm\n147Nm\n73Nm \n 34\nof 220Nm. This near linear relationship between AE (measured from the pinion) and pit \nprogression offers great potential, and opportunities, for prognostics in rotating \nmachinery. At high applied torque condition, the SOA technique performed better in pit \ngrowth monitoring in comparison to vibration technique. The disappointing performance \nof SOA and vibration at the lowest torque condition was not mirrored by the AE \ntechnique. \n \n7 CONCLUSIONS \n \n1. Fatigue gear testing was performed on spur gears to investigate the pitting detection \ncapability of the AE, vibration and SOA techniques.  \n2. Higher applied torques resulted in greater pitting rate. \n3. For all 3 indicators; Fe concentration, AE and vibration r.m.s, the rate of change of \nthese parameters with respect to gearbox operating time increased with increasing \napplied torque. \n4. AE r.m.s levels from the pinion were linearly correlated to pitting rates for all \ntorque conditions. \n5. AE levels from the bearing casing showed better sensitivity than vibration at only \nthe higher toque level (220Nm). Vibration showed better sensitivity to pitting rates \nat the lower torque levels of 147 and 73Nm. \n6. SOA technique has a better pit growth monitoring capability at the higher applied \ntorques in comparison to vibration. However, both techniques showed less \nsensitivity at the lowest torque condition. \n 35\n7. The linear relationship between AE, gearbox running time and pit progression \nimplied that the AE technique offers good potential for prognostic capabilities for \nhealth monitoring of rotating machines. This will be the subject of future \npublication. \n \nREFERENCES \n \n1. Miller, R.K. and McIntire, P. Acoustic Emission Testing, Volume 5, 2nd ed., Non-\ndestructive Testing Handbook. Ed., American Society for Non-destructive Testing, pp \n275-310, 1987. \n2. Toutountzakis, T. and Mba, D. Observation of Acoustic Emission Activity During \nGear Defect Diagnosis. NDT and E International. Vol. 36, No.7, pp 471-477. 2003. \n3. Mba, D. and Bannister, R.H. Condition monitoring of low-speed rotating machinery \nusing stress waves: Part1 and Part 2. Proc Inst Mech Engrs. Vol 213, Part E, pp 153-\n185. 1999. \n4. Holroyd, T. and Randall, N. The Use of Acoustic Emission for Machine Condition \nMonitoring. British Journal of Non-Destructive Testing. Vol. 35(2), pp 75. 1992. \n5. Mba D. The detection of shaft-seal rubbing in large-scale turbines using acoustic \nemission. 14th International Congress on Condition Monitoring and Diagnostic \nEngineering Management (COMADEM'2001).  Manchester, UK, 4-6 September \n2001. pp 21-28, ISBN 0080440363. 2001. \n 36\n6. Mba, D. Applicability of acoustic emissions to monitoring the mechanical integrity of \nbolted structures in low speed rotating machinery: case study. NDT and E \nInternational. Vol 35, No. 5, pp. 293-300. 2002. \n7. Mba, D., Cooke, A., Roby, D. and Hewitt, G. Opportunities offered by acoustic \nemission for shaft-seal rubbing in power generation turbines; a case study sponsored \nby the British Institute of NDT. International Conference on Condition Monitoring. \nOxford, UK, 2-4 July 2003. pp 280-286, ISBN 1901892174. 2003. \n8. Tandon, N. and Mata, S. Detection of Defects in Gears by Acoustic Emission \nMeasurements, Journal of Acoustic Emission. Vol. 17, Issue 1-2, 23-27, 1999. \n9. Singh, A., Houser, D. R., and Vijayakar, S. Early Detection of Gear Pitting, Power \nTransmission and Gearing Conference, ASME. DE-Vol. 88, 673-678, 1996. \n10. Singh, A., Houser, D. R., and Vijayakar, S. Detecting Gear Tooth Breakage Using \nAcoustic Emission: A Feasibility and Sensor Placement Study, Journal of Mechanical \nDesign. Vol. 121, 587-593, 1999. \n11. Toutountzakis, T., Tan, C.K. and Mba, D. Application of acoustic emission to seeded \ngear fault detection. NDT and E International. Vol. 38, No. 1, pp 27-36. 2005. \n12. Gadd, P. and Mitchell, P.J. Condition monitoring of helicopter gearboxes using \nautomatic vibration analysis techniques. AGARD CP 369. Gears and power \ntransmission system for helicopter turboprops. 29\/1 – 29\/10. 1984. \n13. Leblanc, J.F.A., Dube, J.R.F. and Devereux, B. Helicopter gearbox vibration analysis \nin the Canadian Forces-applications and lessons. 1st International Conference, \nGearbox noise and vibration. IMechE, Cambridge, UK. C404\/023, pp 173 -177. 1990. \n 37\n14. Cameron, B.G. and Stuckey, M.J. A review of transmission vibration monitoring at \nWestland Helicopter Ltd. 20Th European Rotorcraft Forum. Paper 116. pp 116\/1 – \n116\/16. 1994. \n15. Anderson, D.P., Lukas, M. and Yurko, R.J. Recent improvements in oil analysis \nspectrometers. International Conference on Condition Monitoring. Swansea, UK. \n395-402. 1999. \n16. Holroyd, T.J. (2000). Acoustic emission and ultrasounics. 1st ed. Coxmoor Publishing \nCompany. Oxford, UK. \n17. Tan, C.K. and Mba, D.U. Identification of the Acoustic Emission source during a \ncomparative study on diagnosis of a spur gearbox. Tribology International. Volume \n38, Issue 5,  Pages 469-480 , May 2005 \n18. Yesilyurt, I., Gu, F.S. and Ball, A.D. Gear tooth stiffness reduction measurement \nusing modal analysis and its use in wear fault severity assessment of spur gears. NDT \n& E International. Vol. 36, No. 5. 357-372. 2003. \n19. Choy, F.K., Polyschchuk, V., Zakrajsek, J.J., Handschuh, R.F. and Townsend, D.P. \nAnalysis of the effects of surface pitting and wear omn the vibration of a gear \ntransmission. Tribology International.  Vol. 29(1).  77-83. 1996. \n20. Drosjack, M.J. and Houser, D.R. An experimental and theoretical study of the effects \nof simulated pitch line pitting on the vibration of a geared system. ASME report 77-\nDET-123. 1977. \n21. Fitch, J.C. Best Practices in maximising fault detection in rotating equipment using \nWDA. International Conference on Condition Monitoring. Swansea, UK. 65-75. \n1999. \n 38\n22. Davis A.M. Fundamental principles in setting alarms and limits in WDA. Practicing \nOil Analysis. 2003. \n23. Xiao, L., Rosen, B.G., Amini, N. And Nilsson, P.H. A study on the effect of surface \ntopography on rough friction in roller contact. Wear. Vol 254(11), 1162-1169. 2003. \n24. Diei, E.N. Investigation of the milling process using acoustic emission signal \nanalysis, PhD. Thesis, Department of Mechanical engineering, University of \nCalifornia, Berkeley, CA. 1985. \n25. Suh, N.P. Tribophysics. Prentice-Hall. Englewood Cliffs. NJ. 1986. \n26. Dornfeld, D. and Handy, C. Slip detection using acoustic emission signal analysis. \nIEEE. 1868-1875. 1987. \n27. MacBride, S.L., Bones, R.J., Sobczyk, M and Viner, M.R. Acoustics emission from \nlubricated and rubbing surfaces. Journal of Acoustic Emission. 8(1-2). 192-196. 1989. \n28. Chee Keong Tan and David Mba, Limitation of Acoustic Emission for identifying \nseeded defects in gearboxes.  Journal of Non-Destructive Evaluation, Vol. 24, No. \n1, March 2005, p 11 - 28. ISSN: 0195-9298. \n29. C K Tan and D Mba, Correlation between Acoustic Emission activity and asperity \ncontact during meshing of spur gears under partial elastohydrodynamic lubrication., \nTRIBOLOGY LETTERS, 2005. In Press \n \n \n \n \n \n 39\nAppendix A \n \nPitting Progression for applied torque of 220 Nm \n \n \n \n \n \n \n* All dimensions in mm. \n220-Test 1 220-Test 2 \n \nTime \nInterval \n(hours) Zone  A Zone B \nTime \nInterval\n(hours) Zone A Zone B \n9 Wear-in marks  \na = 3  \n \nLight pitting across face width \nb < 0.5 \nc = 5 \n0   \n20 Scoring marks \na = 2 \n \nPitting moving towards pitch-\nline. Similar no. of pits but \ndeeper in depth \n0.5 < b < 1 \n8.3% pitting area \nc = 5 \n17 Scoring marks \na = 2.5 \n \nLight pitting across \nface width \nb = 0.5 \n8.3% pitting area \nc = 5 \n31 Scoring marks \na = 2.5 \n \nPitting moving towards pitch-\nline. Pits are deeper and bigger \nb = 1 (cover about ¾ of this \nrange) \n12.5% pitting area \nc = 5 \n28 Scoring marks \na = 2.5 \n \nPitting moving \ntowards pitch-line. \nPits are deeper and \nbigger \nb = 1 (cover about ¾ \nof this range) \n12.5% pitting area \nc = 5 \n41 Scoring marks \na = 2.5 \n \nPitting moving towards pitch-\nline. Pits are bigger and deeper  \nb = 1.5 (cover about ¾ of this \nrange) \n18.8% pitting area \nc = 5 \n40 Scoring marks \na = 2.5 \n \nPitting moving \ntowards pitch-line. \nPits are bigger and \ndeeper  \nb = 1.5 (cover about \n2\/3 of this range) \n16.7% pitting area \nc = 5 \n54 Scoring marks \na = 2.5 \n \nMore pitting and pits touched \nthe pitch-line \nb = 2 (cover about 2\/3 of this \nrange) \n22.2% pitting area \nc = 5 \n52 Scoring marks \na = 2.5 \n \nMore pitting and pits \ntouch the pitch-line \nb = 2 (cover about \n3\/4 of this range) \n25.0% pitting area \nc = 5 \n70 Scoring marks \na = 2.5 \n \nPitting moving downward to \nthe dedendum. More pits  \nb = 2 \n33.3% pitting area \nc = 6 \n70 Scoring marks \na = 2.5 \n \nPitting moving \ndownward to the \ndedendum. More pits  \nb = 2.5 (cover about \n5\/6 of this range) \n34.7% pitting area \nc = 5.5 \n91 Scoring marks \na = 3 \n \nPits touched the pitch-line and \nspread across the face width  \nb = 2.5 (cover about 7\/8 of this \nrange) \n36.5% pitting area \nc = 6 \n86 Scoring marks \na = 2.5 \n \nPits reached the \npitch-line and spread \nacross the face width  \nb = 3 (cover about \n9\/10 of this range) \n45.0% pitting area \nc = 5.5 \n116 Scoring marks \na = 3 \n \nAlmost every tooth has large \npits across face width and \nreached the pitch-line \nb = 3, 50.0% pitting area \nc = 6 \n   \nZone A\nZone B\na\nb \nc\nAddendum\nDedendum\nPitch-line \n 40\n \nPitting Progression for applied torque of 147 Nm \n \n \n \n \n \n \n \n* All dimensions in mm. \n147-Test 1 147-Test 2 \n \nTime \nInterval \n(hours) Zone  A Zone B \nTime \nInterval \n(hours) Zone A Zone B \n24 Wear-in marks  \na = 3  \n \nLight pitting across \nhalf the face width \nb < 0.5 \n4.2% pitting area \nc = 4.5 \n24 Wear-in marks  \na = 3.5 \nLight pitting across \none quarter the face \nwidth \nb = 1 (cover about \n1\/4 of this range) \n4.2% pitting area \nc = 5 \n46 Wear-in marks \na = 3 \n \nPitting moving \ntowards pitch-line. \nSome teeth have \npitting at addendum \n b= 1 \n16.7% pitting area \nc = 5 \n48 Wear-in marks \na = 3..5 \n \nPitting moving \ntowards pitch-line. \nVery deep pits along \nthe bottom. \nb = 1.5 (cover about \n7\/12 of this range) \n14.6% pitting area \nc = 5.5 \n70 Wear-in marks \na = 3 \n \nPitting moving \ntowards pitch-line.  \nb = 1.5 \n25.0% pitting area \nc = 5 \n72 Wear-in marks \na = 3.5 \n \nPitting moving across \nface width, deeper \npits at lower regions. \nb = 1.5  \n25.0% pitting area \nc = 5.5 \n94 Wear-in marks \na = 3 \n \nPitting moving \ntowards pitch-line.  \nb = 2 \n33.3% pitting area \nc = 5 \n96 Wear-in marks \na = 3.5 \n \nPitting moving \ntowards pitch-line. \nMore teeth with \nincreased no. and \ndeeper pits at the \naddendum.  \nb = 2 \n33.3% pitting area \nc = 5.5 \n118 Wear-in marks \na = 3 \n \nPitting moving \ntowards pitch-line.  \nb = 2.5 \n41.7% pitting area \nc = 5 \n121 Wear-in marks \na = 2.5 \n \nPitting moving \ntowards pitch-line. \nMore teeth with \ndeeper pits at the \naddendum.  \nb = 2.5 \n41.7% pitting area \nc = 5.5 \n143 Wear-in marks \na = 2.5 \n \nPitting reached \npitch-line  \nb = 3 \n50.0% pitting area \nc = 5.5 \n145 Scoring marks \na = 2.5 \n \nPitting moving \nreached pitch-line. \nSome teeth with very \ndeep pitting at the \naddendum.  \nb = 3 \n50.0% pitting area \nc = 5.5 \n      \n \n \nZone A\nZone B\na\nb \nc\nAddendum\nDedendum\nPitch-line \n 41\nPitting Progression for applied torque of 73 Nm \n \n \n \n \n \n \n \n* All dimensions in mm. \n73-Test 1 73-Test 2 \n \nTime \nInterval \n(hours) Zone  A Zone B \nTime \nInterval \n(hours) Zone A Zone B \n45 Wear-in marks  \na = 3  \n \nLight pitting \nacross half the \nface width \nb < 0.5 \nc = 5 \n49 Wear-in marks  \na = 2.5  \n \nLight pitting across \none quarter of the face \nwidth. Some teeth \nhave pitting at \naddendum. \nb= 1.5 (cover about \n1\/4of this range) \n6.3% pitting area \nc = 5 \n95 Wear-in marks \na = 3 \n \nPitting moving \ntowards pitch-line \nand occupied half \nof the face width. \nb= 1 (cover about \n½ of this range) \n8.3% pitting area \nc = 5 \n96 Wear-in marks \na = 2.5 \n \nPitting moving across \npitch-line and \noccupied half of the \nface width. \nb= 1.5 (cover about ½ \nof this range) \n12.5% pitting area \nc = 5.5 \n145 Wear-in marks \na = 3 \n \nPitting moving \ntowards pitch-line \nand concentrated \npitted on the right \n1\/3 of face width. \nb = 2 (cover about \n1\/3 of this range) \n11.1% pitting area \nc = 5 \n144 Wear-in marks \na = 2.5 \n \nPitting moving across \npitch-line and \noccupied 2\/3 of the \nface width. Pits got \ndeeper. \nb= 1.5 (cover about \n2\/3 of this range) \n16.7% pitting area \nc = 5.5 \n196 Wear-in marks \na = 3 \n \nPitting moving \ntowards pitch-line \nand concentrated \npitted on the right \n1\/3 of face width. \nb = 2.5 (cover \nabout 1\/3 of this \nrange) \n13.9% pitting area \nc = 5.5 \n193 Wear-in marks \na = 2.5 \n \nPitting moving across \npitch-line and \noccupied the whole of \nface width. \nb = 1.5 (cover about \n1\/3 of this range) \n25.0% pitting area \nc = 5.5 \n268 Wear-in marks \na = 3 \n \nPitting moving \ntowards pitch-\nline. \nb = 1.5 full face \nwidth &  \nb = 1 (cover about \n1\/3 of this range) \n30.6% pitting area \nc = 5.5 \n241 Wear-in marks \na = 2.5 \n \nPitting moving \ntowards pitch-line. \nAlmost all teeth has \n25% pitting area, the \nrest has 27.8%. Some \npitting over pitch-line \nb = 2.5 (cover about \n2\/3 of this range) \n27.8% pitting area \nc = 5.5 \n353 Wear-in marks \na = 3 \n \nPitting moving \ntowards pitch-\nline. Only 3 to 4 \nteeth have this \npitting area. \nb = 1.5 half  face \n290 Wear-in marks \na =2.5 \n \nPitting moving \ntowards pitch-line. \nPitch-line covered \nwith pits \nb = 2.5 (cover about \n6\/7 of this range) \nZone A\nZone B\na\nb \nc\nAddendum\nDedendum\nPitch-line \n 42\nwidth &  \nb = 2.5 half face \nwidth \n33.3% pitting area \nc = 5.5 \n35.7% pitting area \nc = 5.5 \n425 Wear-in marks \na = 3 \n \nPitting moving \ntowards pitch-\nline. 6 to 8 teeth \nhave this pitting \narea. \nb = 1.5 half  face \nwidth &  \nb = 2.5 half face \nwidth \n33.3% pitting area \nc = 5.5 \n341 Wear-in marks \na = 2.5 \n \nPitting reached pitch-\nline. Almost all teeth \nhave 33.3% pitting \narea, only a few teeth \nhave 41.7%.  \nb = 2.5 \n41.7% pitting area \nc = 5.5 \n \n485 Wear-in marks \na = 3 \n \nPitting moving \ntowards pitch-\nline. 11 to 15 \nteeth have this \npitting area. \nb = 1.5 half  face \nwidth &  \nb = 2.5 half face \nwidth \n33.3% pitting area \nc = 5.5 \n403 Wear-in marks \na = 2.5 \n \nThe no. of teeth with \n41.7% pitted area has \nincreased from a few \nto 50% of the total no. \nof gear teeth.  \nb = 2.5 \n41.7% pitting area \nc = 5.5 \n \n   472 Wear-in marks \na = 2.5 \n \nMost teeth have \n41.7% of gear pitted \narea, others reached \n50%. \nb = 3 \n50.0% pitting area \nc = 5.5 \n* The test was terminated since the pitting area did not increase, but this percentage of pitted area was spreading across all the rest of \ngear teeth. This implied localised pitting has been developed into distributed pitting. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 43\nAppendix B \n \n \n-0.0500\n0.0000\n0.0500\n0.1000\n0.1500\n0.2000\n0.2500\n0.0 100.0 200.0 300.0 400.0 500.0\nTime (h)\nA\nE\n r\n.m\n.s \n(V\n)\n73Nm (1)\n73Nm (2)\n \n \nFigure 18 AE r.m.s. against operating time at 73 Nm; 745 rpm \n \n0.0000\n0.1000\n0.2000\n0.3000\n0.4000\n0.5000\n0.6000\n0.7000\n0.8000\n0.9000\n0.0 20.0 40.0 60.0 80.0 100.0 120.0 140.0 160.0 180.0\nTime (h)\nA\nE\n r\n.m\n.s \n(V\n)\n147Nm (1)\n147Nm (2)\n \nFigure 19 AE r.m.s against operating time at 147 Nm; 745 rpm \n \n 44\n0.00\n0.05\n0.10\n0.15\n0.20\n0.25\n0 10 20 30 40 50 60\n% of gear pitted area\nA\nE\n r\n.m\n.s.\n (v\n)\n73(1) 73(2)\n \nFigure 20 AE r.m.s against % pitted area; 73 Nm, 745 rpm \n \n0.00\n0.30\n0.60\n0.90\n0 10 20 30 40 50 60\n% of gear pitted area\nG\nea\nr \nA\nE\n r\n.m\n.s.\n (v\n)\n147Nm(1) 147Nm(2)\n \n \nFigure 21 AE r.m.s against % pitted area; 147 Nm, 745 rpm \n \n \n \n 45\n \n \n \n0\n0.004\n0.008\n0.012\n0.016\n0.0 50.0 100.0 150.0\nTime (h)\nB\nea\nri\nng\n c\nas\nin\ng \nA\nE\n r\n.m\n.s \n(V\n)\n147Nm (1)\n147Nm (2)\n \nFigure 22 Bearing casing AE r.m.s against operating time at 147 Nm; 745 rpm \n \n0\n0.002\n0.004\n0.006\n0.0 100.0 200.0 300.0 400.0 500.0\nTime (h)\nB\nea\nri\nng\n c\nas\nin\ng \nA\nE\n r\n.m\n.s \n(V\n)\n \nFigure 23 Bearing casing AE r.m.s against operating time at 73 Nm; 745 rpm \n 46\n \n0\n0.001\n0.002\n0.003\n0.004\n0.005\n0.006\n0 10 20 30 40 50 60\n% of gear pitted area\nB\nea\nri\nng\n c\nas\nin\ng \nA\nE\n r\n.m\n.s \n(v\n)\n147Nm(1) 147Nm(2)\nFigure 24 Bearing casing AE r.m.s against % pitted area; 147 Nm, 745 rpm \n \n0\n0.001\n0.002\n0.003\n0.004\n0.005\n0.006\n0 10 20 30 40 50 60\n% of gear pitted area\nB\nea\nri\nng\n c\nas\nin\ng \nA\nE\n r\n.m\n.s \n(v\n)\n73Nm(1) 73Nm(2)\n \nFigure 25 Bearing casing AE r.m.s against % pitted area; 73 Nm, 745 rpm \n \n 47\n0.00\n0.10\n0.20\n0.30\n0.40\n0 50 100 150 200\nOperating Time (hours)\nV\nib\nra\ntio\nn \nr.\nm\n.s.\n (v\n)\n147(1)\n \nFigure 26 Vibration r.m.s against operating time at 147 Nm; 745 rpm \n0.00\n0.04\n0.08\n0.12\n0.16\n0 100 200 300 400 500\nOperating Time (hours)\nV\nib\nra\ntio\nn \nr.\nm\n.s.\n (v\n)\n73(1) 73(2)\n \nFigure 27 Vibration r.m.s. against operating time at 73 Nm; 745 rpm \n 48\n0.00\n0.02\n0.04\n0.06\n0.08\n0.10\n0.12\n0.14\n0 10 20 30 40 50 60\n% of gear pitted area\nV\nib\nar\ntio\nn \nr.\nm\n.s.\n (v\n)\n73(1) 73(2)\n \nFigure 28 Vibration r.m.s against % pitted area; 73 Nm, 745 rpm \n0.00\n0.05\n0.10\n0.15\n0.20\n0.25\n0.30\n0 10 20 30 40 50 60\n% of gear pitted area\nV\nib\nra\ntio\nn \nr.\nm\n.s.\n (v\n)\n147(1)\n \nFigure 29 Vibration r.m.s against % pitted area; 147 Nm, 745 rpm \n \n 49\n0\n20\n40\n60\n80\n0 50 100 150\nOperating Time (hours)\nFe\n C\non\nce\nnt\nra\ntio\nn \n(p\npm\n147(1) 147(2)\n \nFigure 30 Fe concentration with correction against operating time at 147 Nm; \n745 rpm \n \n0\n10\n20\n30\n40\n50\n0 100 200 300 400 500\nOperating Time (hours)\nFe\n c\non\nce\nnt\nra\ntio\nn \n(p\npm\n)\n73(1) 73(2)\n \nFigure 31 Fe concentration with correction against operating time at 73 Nm; 745 \nrpm \n \n 50\n0\n10\n20\n30\n40\n50\n0 10 20 30 40 50 60\n% of gear pitted area\nFe\n c\non\nce\nnt\nra\ntio\nn \n(p\npm\n)\n73(1) 73(2)\n \nFigure 32 Fe concentration with correction against % pitted area; 73 Nm, 745 \nrpm \n0\n20\n40\n60\n80\n0 10 20 30 40 50 60\n% of gear pitted area\nFe\n C\non\nce\nnt\nra\ntio\nn \n(p\npm\n)\n147(1) 147(2)\n \nFigure 33 Fe concentration with correction against % pitted area; 147 Nm, 745 \nrpm \n"}