{"doi":"10.1068\/d456t","coreId":"65041","oai":"oai:cadair.aber.ac.uk:2160\/1653","identifiers":["oai:cadair.aber.ac.uk:2160\/1653","10.1068\/d456t"],"title":"In what way is the world really flat? Debates over geographies of the moment","authors":["Dodgshon, Robert"],"enrichments":{"references":[],"documentType":{"type":0.7777777778}},"contributors":["Cultural and Historical Geography","Department of Geography and Earth Sciences"],"datePublished":"2008","abstract":"Dodgshon, Robert, (2008) 'In what way is the world really flat? Debates over geographies of the moment', Environment and Planning: D Society and Space, pp. 300-314 RAE2008This paper highlights the role played by the specious present or moment, what some call the present of the now, in geographical discussions of social change. Its most explicit treatment as a temporal framing for such change has been in performative approaches, with their stress on the capacity of immersive body practices to produce difference through the ongoing repetition of such practices, a difference that plays on what is habitually or instinctively accessed through each specious present. However, we can also find debates focused on large-scale social practices that have combined various forms of structural or institutional contingency (ie customary practices, past investment cycles, etc) with becoming and which see becoming as rooted in the everyday reiteration of such practices, an interpretation that also privileges the moment as the point when becoming is actualised. Brought together, these different approaches provide the basis for a more broadly based interpretation of change focused on the specious present. This paper explores the case for this broader interpretation. It is divided into four sections. The first reviews those philosophical discussions of the specious present that have attracted most attention from human geographers. The second reviews the ways in which the geographical debate has used the specious present as a framing for change. The third examines how these different geographical treatments fill or extend the specious present, whilst the fourth and final section considers the implications of such thinking for how we interpret change.Peer reviewe","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65041.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/2160\/1653","pdfHashValue":"f976d41a9d90f92c31844a5deda3d3720d5233fa","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n        \n            \n                oai:cadair.aber.ac.uk:2160\/1653<\/identifier><datestamp>\n                2018-01-21T19:33:41Z<\/datestamp><setSpec>\n                com_2160_7<\/setSpec><setSpec>\n                com_2160_7908<\/setSpec><setSpec>\n                col_2160_1588<\/setSpec><setSpec>\n                col_2160_7909<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nIn what way is the world really flat? Debates over geographies of the moment<\/dc:title><dc:creator>\nDodgshon, Robert<\/dc:creator><dc:contributor>\nCultural and Historical Geography<\/dc:contributor><dc:contributor>\nDepartment of Geography and Earth Sciences<\/dc:contributor><dc:description>\nDodgshon, Robert, (2008) 'In what way is the world really flat? Debates over geographies of the moment', Environment and Planning: D Society and Space, pp. 300-314 RAE2008<\/dc:description><dc:description>\nThis paper highlights the role played by the specious present or moment, what some call the present of the now, in geographical discussions of social change. Its most explicit treatment as a temporal framing for such change has been in performative approaches, with their stress on the capacity of immersive body practices to produce difference through the ongoing repetition of such practices, a difference that plays on what is habitually or instinctively accessed through each specious present. However, we can also find debates focused on large-scale social practices that have combined various forms of structural or institutional contingency (ie customary practices, past investment cycles, etc) with becoming and which see becoming as rooted in the everyday reiteration of such practices, an interpretation that also privileges the moment as the point when becoming is actualised. Brought together, these different approaches provide the basis for a more broadly based interpretation of change focused on the specious present. This paper explores the case for this broader interpretation. It is divided into four sections. The first reviews those philosophical discussions of the specious present that have attracted most attention from human geographers. The second reviews the ways in which the geographical debate has used the specious present as a framing for change. The third examines how these different geographical treatments fill or extend the specious present, whilst the fourth and final section considers the implications of such thinking for how we interpret change.<\/dc:description><dc:description>\nPeer reviewed<\/dc:description><dc:date>\n2008-12-15T15:50:34Z<\/dc:date><dc:date>\n2008-12-15T15:50:34Z<\/dc:date><dc:date>\n2008<\/dc:date><dc:type>\n\/dk\/atira\/pure\/researchoutput\/researchoutputtypes\/contributiontojournal\/article<\/dc:type><dc:identifier>\nDodgshon , R 2008 , ' In what way is the world really flat? Debates over geographies of the moment ' Environment and Planning D: Society and Space , vol 26 , no. 2 , pp. 300-314 . DOI: 10.1068\/d456t<\/dc:identifier><dc:identifier>\n0263-7758<\/dc:identifier><dc:identifier>\nPURE: 95926<\/dc:identifier><dc:identifier>\nPURE UUID: 820cb31a-d7f8-45b5-91f6-2b08830df138<\/dc:identifier><dc:identifier>\ndspace: 2160\/1653<\/dc:identifier><dc:identifier>\nDSpace_20121128.csv: row: 1394<\/dc:identifier><dc:identifier>\nScopus: 40849101254<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2160\/1653<\/dc:identifier><dc:identifier>\nhttp:\/\/www.envplan.com\/epd\/fulltext\/dforth\/d456t.pdf<\/dc:identifier><dc:identifier>\nhttp:\/\/www.ies.aber.ac.uk\/publications\/in-what-way-world-really-flat-debates-over-geographies-moment<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1068\/d456t<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nEnvironment and Planning D: Society and Space<\/dc:relation><dc:rights>\n<\/dc:rights><dc:format>\n15<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0263-7758","0263-7758"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Environment and Planning D: Society and Space"],"year":2008,"topics":[],"subject":["\/dk\/atira\/pure\/researchoutput\/researchoutputtypes\/contributiontojournal\/article"],"fullText":""}