{"doi":"10.1109\/RTP.2007.4383824","coreId":"101823","oai":"oai:epubs.surrey.ac.uk:1256","identifiers":["oai:epubs.surrey.ac.uk:1256","10.1109\/RTP.2007.4383824"],"title":"Boron pile-up phenomena during ultra shallow junction formation","authors":["Ferri, M","Solmi, S","Giubertoni, D","Bersani, M","Hamilton, JJ","Kah, M","Cowern, NEB","Kirkby, K","Collart, EJH"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"The redistribution during annealing of low-energy B implants in SOI structures and in bulk Si have been investigated by comparing Secondary Ion Mass Spectrometry (SIMS) and simulated profiles. Samples preamorphised with Ge at different implantation energies have been prepared in order to investigate the effects of the damage position on B diffusion. The specimens have been subsequently B implanted at 500 eV with doses 2×10 and 2×10 cm and annealed between 700 and 1100°C. SIMS profiles show a B pile-up in the first few nanometres of the Si matrix on the Si surface. Simulations of diffused profiles indicate that the B redistribution upon annealing can be explained by assuming that the mobility of the dopant which arrives in proximity of the surface is practically annulled. The amount of B trapped at the surface is maximum at the temperatures around 800°C, when more than 80% of the implanted dopant is made immobile and electrically inactive. The trapped B increases with reducing the depth of the amorphous layer and it is higher in the bulk Si than in SOI. By comparing Hall measurements and the amount of B not trapped at the surface, we also estimate the amount of B that aggregates inside the Si lattice in form of clusters (BICs). For the B dose of 2×10 cm, after isochronal annealing of 60 s, the amount of BICs is about 3-4×10 cmat the lowest temperatures and tends to vanish at high temperatures. © 2007 IEEE","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1256<\/identifier><datestamp>\n      2017-10-31T14:01:15Z<\/datestamp><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:696F6E5F6265616D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1256\/<\/dc:relation><dc:title>\n        Boron pile-up phenomena during ultra shallow junction formation<\/dc:title><dc:creator>\n        Ferri, M<\/dc:creator><dc:creator>\n        Solmi, S<\/dc:creator><dc:creator>\n        Giubertoni, D<\/dc:creator><dc:creator>\n        Bersani, M<\/dc:creator><dc:creator>\n        Hamilton, JJ<\/dc:creator><dc:creator>\n        Kah, M<\/dc:creator><dc:creator>\n        Cowern, NEB<\/dc:creator><dc:creator>\n        Kirkby, K<\/dc:creator><dc:creator>\n        Collart, EJH<\/dc:creator><dc:description>\n        The redistribution during annealing of low-energy B implants in SOI structures and in bulk Si have been investigated by comparing Secondary Ion Mass Spectrometry (SIMS) and simulated profiles. Samples preamorphised with Ge at different implantation energies have been prepared in order to investigate the effects of the damage position on B diffusion. The specimens have been subsequently B implanted at 500 eV with doses 2×10 and 2×10 cm and annealed between 700 and 1100°C. SIMS profiles show a B pile-up in the first few nanometres of the Si matrix on the Si surface. Simulations of diffused profiles indicate that the B redistribution upon annealing can be explained by assuming that the mobility of the dopant which arrives in proximity of the surface is practically annulled. The amount of B trapped at the surface is maximum at the temperatures around 800°C, when more than 80% of the implanted dopant is made immobile and electrically inactive. The trapped B increases with reducing the depth of the amorphous layer and it is higher in the bulk Si than in SOI. By comparing Hall measurements and the amount of B not trapped at the surface, we also estimate the amount of B that aggregates inside the Si lattice in form of clusters (BICs). For the B dose of 2×10 cm, after isochronal annealing of 60 s, the amount of BICs is about 3-4×10 cmat the lowest temperatures and tends to vanish at high temperatures. © 2007 IEEE.<\/dc:description><dc:date>\n        2007<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1256\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Ferri, M, Solmi, S, Giubertoni, D, Bersani, M, Hamilton, JJ, Kah, M, Cowern, NEB, Kirkby, K and Collart, EJH  (2007) Boron pile-up phenomena during ultra shallow junction formation       <\/dc:identifier><dc:relation>\n        10.1109\/RTP.2007.4383824<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1256\/","10.1109\/RTP.2007.4383824"],"year":2007,"topics":[],"subject":["Conference or Workshop Item","NonPeerReviewed"],"fullText":"15th IEEE International Conference on Advanced Thermal Processing of Semiconductors - RTP2007\nBoron pile-up phenomena during ultra shallow\njunction formation\nM. Ferri(a), S. Solmi(a), D. Giubertoni(b), M. Bersani(b), J. J. Hamilton(C), M. Kah(c), N.E.B. Cowern(c), K.\nKirkby(c), and E.J.H. Collart(d)\n(a)Institute of Microelectronics and Microsystems CNR-IMM Via Gobetti, 101 - 40129 Bologna, Italy.\n(b)Fondazione Bruno Kessler - irst Via Sommarive, 18 - Povo, Trento 38050, Italy.\n(c)Ion Beam Centre, Advance Tech. Institute, University of Surrey, Guildford, Surrey, GU2 7XH, UK.\n(d)Parametric and Conductive Impl. Division, Applied Materials UK Ltd, Foundry Lane, Horsham, West\nSussex, RH13 5PX.\nThe redistribution during annealing of low-energy B implants in SOI structures and in bulk Si have been\ninvestigated by comparing Secondary Ion Mass Spectrometry (SIMS) and simulated profiles. Samples\npreamorphised with Ge at different implantation energies have been prepared in order to investigate the\neffects of the damage position on B diffusion. The specimens have been subsequently B implanted at 500\neV with doses 2xl013 and 2xl014 cm-2 and annealed between 700 and 1100 'C. SIMS profiles show a B\npile-up in the first few nanometres of the Si matrix on the Si surface. Simulations of diffused profiles\nindicate that the B redistribution upon annealing can be explained by assuming that the mobility of the\ndopant which arrives in proximity of the surface is practically annulled. The amount of B trapped at the\nsurface is maximum at the temperatures around 800 'C, when more than 80 % of the implanted dopant is\nmade immobile and electrically inactive. The trapped B increases with reducing the depth of the\namorphous layer and it is higher in the bulk Si than in SOI. By comparing Hall measurements and the\namount of B not trapped at the surface, we also estimate the amount of B that aggregates inside the Si\nlattice in form of clusters (BICs). For the B dose of 2x1 014 cm-3, after isochronal annealing of 60 s, the\namount of BICs is about 3-4xI 013 cm-2 at the lowest temperatures and tends to vanish at high\ntemperatures.\nIntroduction (SPER) process [1]. It is well known that, as a\nconsequence of the amorphising implant, an\nScaling of electronic devices requires both the .. ..excess of Si intershtitals forms JUSt beyond the\nreduction of all the physical dimensions, amorphous\/crystalline interface in the end-of-\nincluding junction depth profile, and high levels\n^ ~~~range (BOR) region. During subsequent\nof active dopant concentration. Highly active, annealing these defects evolve through the\nshallow and steep doping profile can be obtained formation\/dissolution of aggregates and the\nby using preamorphising implants prior dopant release of free self interstitials [1-4]. This\nimplantation and annealing at low temperature interstitial supersaturation causes unwanted\nexploiting the solid phase epitaxial re-growth phenomena like transient enhanced diffusion\n1-4244-1227-7\/07\/$25.00 ©2007 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:20 from IEEE Xplore.  Restrictions apply. \n(TED), point defects clusters and clustering\nbetween point defects and dopant with\nconsequent electrical deactivation [1,2].\nThe surface (and the interfaces) affect the\nimpurity profile both through the segregation and\ntrapping of dopant atoms in energetically\nfavourite places and acting on point defects\ndistribution, and consequently, on the TED\nphenomena. These effects are particularly evident\nfor boron [5-8] and phosphorous [9, 10], but have\nbeen also evidenced in ultrashallow junctions\nobtained by low energy arsenic implantation [11,\n12].\nIn these last years the interest for silicon-on-\ninsulator (SOI) technology has strongly increased\ndue to the expected superior performances and\nfabrication advantages of this material with\nrespect to the bulk silicon [13]. As far as the\ndiffusion phenomenon is concerned, the presence\nin the SOI samples of a buried Si\/SiO2 interface\nprovides another efficient sink for the interstitials\nbesides the silicon surface. This second sink\nmodifies the distribution of the point defects\nduring the annealing and consequently the\nunwanted effects related to these defects [14].\nPurpose of this work is to investigate the\nuphill diffusion in ultrashallow p+\/n junctions\nobtained by low energy B implantation in both\nbulk Si and SOI material. In particular, the\ndependence of this phenomenon on implanted\ndose, depth of the amorphous layer and annealing\nconditions has been analyzed with the support of\na simulation program which takes into account\nthe dopant segregation at the surface and allows a\nsatisfactory describe of the dopant redistribution\nupon annealing.\nExperimental\nThe experiments were performed on (100)\noriented, n-type CZ silicon wafers with\nresistivity 10-25 Q.cm, and on SOI wafers with a\n55 nm-thick p-type Si over layer obtained by\nwafer bonding technology. The samples were Ge\nimplanted to produce amorphous layers of\ndifferent depth. With a Ge dose of 1x1015 cm-2\nand energies of 8, 20 and 25 keV we amorphised\nthe silicon to depths of about, 20, 40 and 45 nm,\nrespectively [15]. The specimens were\nsubsequently B implanted at 500 eV to doses of\n2x1 013 and 2x1 014 cm-2 . The annealing treatment\nwere performed at temperatures between 700 and\n1100 °C for different times between 5 s and 4 h\nusing a Process Products Corporation 18 Lamp\nrapid thermal processing (RTP) annealer in\nnitrogen atmosphere. To monitor the temperature\nin the annealer, we use a k-type thermocouple\nattached to the bottom of a 5\" Si support wafer\nand the samples to be annealed are placed on top\nof this support wafer. From the comparison of\nthe re-growth rate of the amorphous layer we\nfound that the bulk Si samples experienced abaut\n3 °C higher temperature than the SOI specimens.\nThis is within the uncertainties of the techniques\nused.\nCAMECA Sc-Ultra mass spectrometer has\nbeen used to perform Secondary Ion Mass\nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:20 from IEEE Xplore.  Restrictions apply. \nSprectroscopy (SIMS) depth profiles. An oblique\nincidence (68°) 500 eV 2+ primary beam has\nbeen used and positive secondary ions were\ncollected. In order to obtain a suitable depth\nresolution and sensitivity a controlled oxygen\nleak was introduced in the analysis chamber and\nsample underwent a rotation during sputtering\n[16].\nThe electrical activity of the B implants was\nassessed by sheet resistance and Hall\nmeasurements using an Accent HL5500 machine.\nThe simulations of the diffused profiles are\nperformed by using a pair-diffusion model which\nconsiders unpaired point defects and dopant-\ndefect pairs as mobile species and the unpaired\ndopant on lattice sites as immobile species. To\ntake into account the B uphill diffusion toward\nthe surface we introduce a \"trap\" distribution into\nthe Si in the first 2-3 nanometres below the Si\/gas\ninterface. All the simulations are performed with\nan equilibrium constant reaction which favours a\nrapid formation of the B-Trap complexes and\nwith the trap density used as fitting parameter.\nThis simple approach allows us to strongly\nimprove the agreements between simulation and\nmeasured profiles in a wide range of experimental\nconditions. A more detailed description of the\nmodel can be found in Ref. [17]\nResults and discussion\nFig. 1 shows the SIMS profiles of Ge PAI\nsamples at 20 keV and B implanted with dose\n2x1 013 cm-2 after annealing for 60 s at various\ntemperatures both in SOI (Fig. 1 a) and in bulk\nmaterial (Fig. lb). In dotted line the simulated\nprofiles are also reported. SIMS profiles clearly\nshow a B pile-up in the first few nanometres of\nthe Si matrix on the Si surface. The simulations\npermit to describe the phenomenon of the uphill\ndiffusion and to evaluate the amount of B\ncollected on the surface region.\na',L} Sol5 as im plI\n850 c2\n0 j t= 60I E;=ss\nE 1 0 90 00'C0~~~~~~~~~~~0\n,__ 101 .5 \\w n Nd\nN)bkasim01\n350\nL1 01\nb)bulk ~~~~~~asim pl.\nE K20 100 McO \\ ~~~~~~~~~~~1 0:500C\n1 01a L\nH-i\niii~~~~~~~~~~~~~-\nu du 41J biUIJ\nDepth (nm)\nFig. 1: Comparison between simulated (dashed lines)\nand SIMS (continuous lines) profiles of PAI samples at\n20 keV, B implanted with dose 2x1013 cm-2 after\nisochronal annealing of 60 s at various temperatures in\nSOI (Fig. la) and in bulk material (Fig. lb).\nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:20 from IEEE Xplore.  Restrictions apply. \nSimulations indicate that the B diffusion,\napparently against the concentration gradient, is\nconsistent with Fick's diffusion equation if the\ndiffusivity near the surface suddenly drops to\nnegligible values; this effect is performed in the\nsimulation by assuming the presence of traps in\nthat region without considering any asymmetric\nbehaviour of the dopant movement. The presence\nof unsaturated traps in the surface region drives\nthe [BI] pair concentration to be very small, and\nthus creates a huge gradient between the B profile\nand the traps region. This gradient drives the\nphenomenon of the uphill diffusion. On the\ncontrary, simulations performed without the\nintroduction of traps near the surface bring to a\nrelevant overestimation of the junction depth and\nan incorrect determination of the B concentration\nin the surface region (not shown).\nBy using the SIMS profiles and simulations\nthe amount of B which is distributed into the Si,\nand not trapped at the surface, can be evaluated.\nThe obtained results are reported in Fig. 2 for the\nB implanted dose of 2x1 013 cm-2 as a function of\nthe annealing temperature for a 60 s treatment.\nThe data refer to the bulk samples preamorphised\nwith Ge implantation at 8 and 20 KeV. In all\nsamples there is a minimum in the free-B amount\naround 800-850 °C; at these temperatures more\nthan 80 % of the implanted B is trapped at the\nsurface.\nBoron segregation at the surface depends on\nannealing temperature. At low temperatures (700-\n775°C) the low B diffusivity limits the dopant\natoms to reach the surface then the segregation is\nreduced. This is confirmed by the dependence of\nthe trapped B amount on the position of the EOR\ndefects. Higher trapping is obtained in the\nsamples where the dissolving EOR defects, which\nrelease interstitials and promote B diffusion, are\nnearer to the surface. At high annealing\ntemperature, B segregated at the surface reduces.\nE 1013\nco70m\nL-\no\nz\n1012\n700 800 900 1000\nAnnealing T (°C)\n1100\nFig. 2: Amount of not trapped B vs annealing\ntemperature for isochronal treatments of 60 s in bulk\nsamples PAI with Ge at different energies, in order to\nlocate the EOR defects at different depths. The B\nimplanted dose was 2x1013 cm-2.\nThis is due both to the lowering of interstitial\nsupersaturation with increasing temperature that\nallows for B atoms to avoid the surface\nsegregation diffusing inside the bulk and to the\ntendency of segregation phenomena to reduce at\nhigher temperature. However, only for\ntemperature as higher than 1050 °C we have a\nnearly complete release of the trapped B (see Fig.\n2).\nThe different evolution of the interstitial\nsupersaturation is also responsible for the\ndifferences of B trapping between SOI and bulk\nAnnealing time 60 s\n0--Ge 8 keV\nbulk Si Ge 20 keV\nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:20 from IEEE Xplore.  Restrictions apply. \nSi shown in Fig. 3a and Fig. 4 for samples B\nimplanted with dose 2xl014 cm-2.\nIn fact, in SOI samples the buried oxide acts as\na sink for interstitials increasing EOR dissolution\nrate and reducing the enhancement of the B\ndiffusion [7]. The effect is more evident for the\nsamples preamorphised at 20 keV due to the\nproximity of the EOR defects to the buried oxide\nlayer. Also for this dose the surface trapping in\nthe samples preamorphised at 8 keV is higher\nrespect to the one exhibited by the samples more\ndeeply preamorphised at 20 keV.\nB 2x1 014 CM-2 t= 60 s\nC\n~14\na)\n-B ulk 8 keV\n° 3 -SOI 8 keV\n:10 Bulk20 keV\nSOI 20 keV\nE\n_ 10 14\nI 1\n0\n0\n751 01 Hall Measures0r\n700 800 900 1000\nAnnealing T (°C)\nFig. 3: Amount of not trapped B (3a) and hole\nconcentration (3b) vs annealing temperature for\nisochronal treatments of 60 s in SOI samples and bulk\nmaterial PAI with Ge at different energies. The B\nimplanted dose was 2x10'4 cm-2.\n1021 Ouu k\" DU 5\nbulk\nIE 1 020 Sol\no\n-%,Ge20keV\n0 1 019\nU) 18 Ge8keV\no) 10o\no) 17\n1016\n0 10 20 30 40 50 60\nDenth (nm)\nFig. 4: Comparison of the B profiles of samples\nimplanted with dose 2x10'4 cm-2 and annealed at 800\n°C for 60 s in SOI and bulk Si PAI with Ge at different\nenergies.\nThe trend of the not trapped B vs temperature\nshown in Fig. 3a is in qualitative agreement with\nthe one of the active B concentration reported in\nFig 3b. Two effects contribute to the B\ndeactivation: i) B segregation in proximity of the\nsurface and ii) formation of Boron interstitial\nclusters (BICs) inside the Si lattice in presence of\nhigh interstitial supersaturation [18]; both these\ncontributions increase with increasing interstitial\nsupersaturation. However, the good correlation\nbetween hole concentration and not trapped B\nindicates that surface segregation is the dominant\neffect to determine the amount of active B in\nthese experimental conditions.\nFig. 5 shows the comparison between the hole\nconcentration and the not trapped boron of Ge\nPAI samples at 8 keV and B implanted with dose\n2x1014 cm-2 after annealing for 60 s at various\ntemperatures in the SOI material. The difference\nbetween the two curves, i.e. the amount of BICs\nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:20 from IEEE Xplore.  Restrictions apply. \npresent after 1 min annealing, is in the range 3-\n4x1 013 cm-2 at low temperatures and then reduces\nwith increasing temperature down to vanish, in\nagreement with the dissolution (or not formation)\nof these clusters (see Fig.5). A value of 3-4x1013\ncm-2 means that at low temperature about 30-40%\nof the B located inside the silicon is in form of\nBICs.\n1 014\n1-1E\n0\nI.-_\nCU\n0\na)\n° 1 0\n700 800 900 1000\nT (OC)\nFig. 5: Comparison between not trapped B and hole\nconcentration vs annealing temperature for isochronal\ntreatment of 60 s in SOI sample PAI with Ge at 8 keV\nand B implanted at 2x1014 cm-2.\nThe junction depths, Xj, evaluated from SIMS\nprofiles at the concentration of 1x1018 cm3, for\nthe samples B implanted with dose 2x1014 cm-2\nare reported in Fig. 6 as a function of the\nannealing temperature. For temperatures higher\nthan 850 °C a shallower Xj in SOI material with\nrespect to bulk Si is obtained in agreement with\nprevious observations [19]. This effect was\nattributed to the interstitial recombination on the\nburied oxide layer [20, 19].\n60\n-A-SOI 20 keV\nSOI 8 keV\nE Si bulk 20 keV\nC. 40 L-*-Si bulk 8kkeV40~~~~~~~\na)\n0 20 -\nD - 2x1014 cm-2\n0\n700 800 900 1000\nT (°C)\nFig. 6: Junction depths (Xi), evaluated from SIMS\nprofiles at the concentration of 1X1018 cm-3, for the\nsamples B implanted with dose 2x1014 cm-2 as a function\nof the annealing temperature for isothermal treatments\nof 60 s. The figure shows the results of SOI and bulk Si\nPAI with Ge at 8 and 20 keV.\nConclusions\nUltrashallow junctions obtained by low energy\n(500 eV) B implanted in preamorphised SOI and\nin bulk Si show, after annealing, a strong effect of\nuphill diffusion which confines, and makes\nelectrically inactive, a relevant amount of dopant\nin proximity of the surface. This redistribution\ncan be accounted for by simulations based on pair\ndiffusion model and with the introduction of\ntrapping sites in proximity of the surface, without\nconsidering any asymmetric behaviour of the\ndopant movement. The amount of trapped B\nincreases with decreasing temperature, and, for a\nfixed temperature, is higher in the conditions of\nhigher diffusivity. The correlation between\ntrapped B and diffusivity allows explaining the\nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:20 from IEEE Xplore.  Restrictions apply. \nincrease of the trapped B with reducing the depth\nof the amorphous layer and the differences\nobserved between SOI layers and bulk Si. At the\ntemperatures around 800 °C, more than 80 % of\nthe implanted dopant is trapped in the surface\nregion.\nBy comparing Hall measurements and the\namount of B not trapped at the surface, we\nestimate the amount of BICs formed during the\nannealing. For the B dose of 2x1014 cm-3, after\nisochronal annealing of 60 s, the amount of BICs\nis about 3-4x1 013 cm-2 at the lowest temperatures\nand tends to vanish at high temperatures.\nAcknowledgments\nThis work was partially supported by the\nFIRB project (contract RBNE012N3X).\nBibliography\n1. P. A. Stolk, J. H.-J. Gossmann, D. J.\nEaglesham, D. C. Jacobson, C. S. Rafferty, G. H.\nGilmer, M. Jariz, and J. M. Poate, J. Appl. Phys.\n81, 6031 (1997).\n2. M. Servidori, Z. Sourek, and S. Solmi, J. Appl.\nPhys. 62, 1723 (1987).\n3. A. Clavere, B. Colombeau, B. De Mauduit, C.\nBonafos, X. Herras, G. Ben Assayag, and F.\nCristiano, Appl. Phys. A, 76, 1025 (2003).\n4. C. Bonafos, D. Matoit, and A. Claveries, J.\nAppl. Phys. 83, 3008 (1998).\n5. H. C. Wang, C. C. Wang, C. S. Chang, T.\nWang, P. B. G, and C. H. Diaz, IEEE El. Dev.\nLett. 29, 65 (2001).\n6. A. Shima, T. Jinbo, N. Natsuaki, J. Ushio, J.-H.\nOh, K. Ono, and M. Oshima, J. Appl. Phys. 89,\n3458 (2001).\n7. R. Duffy, V. C. Venezia, A. Heringa, T. W. T.\nHusken, M. J. P. Hopstaken, N. E. B. Cowern, P.\nB. Griffin, C. C. Wang, Appl. Phys. Lett. 82,\n3647 (2003).\n8. M. Y. L. Jung, R. Gunawan, R. D. Braatz, and\nE. G. Seebauer, J. Appl. Phys. 95, 1134 (2004).\n9. R. Duffy, V. C. Venezia, J. Loo, M. J. P.\nHopstaken, M. A. Verheijen, J. G. M. van\nBerkum, G. C. J. Maas, and C. Demeurisse, Appl.\nPhys. Lett. 86, 81917 (2005).\n10. S. Ruffell, I. V. Mitchell, and P. J. Simpson,\nJ. Appl. Phys. 97, 123518 (2005).\n11. S. Solmi, M. Ferri, M. Bersani, D. Giubertoni,\nand V. Soncini, J. Appl. Phys. 94, 4950 (2003).\n12. M. Ferri, S. Solmi, A. Parisini, M. Bersani, D.\nGiubertoni and M. Barozzi, J. App. Phys. 99,\n113508 (2006).\n13. G. K. Celler and S. Cristoloveanu, J. Appl.\nPhys. 93, 4955 (2003).\n14. P. Fahey and S. Solmi, J. Appl. Phys. 60,\n4329 (1986).\n15. J. J. Hamilton, E. J. H. Collart, B. Colombeau,\nC. Jeynes, M. Bersani, D. Giubertoni, J. A. Sharp,\nN. E. B. Cowern, and K. J. Kirkby, Nuclear Instr.\nand Meth. B, 237, 107 (2005).\n16. M. Bersani, D. Giubertoni, E. Jacob, M.\nBarozzi, S. Pederzoli, L. Vanzetti, M. Anderle,\nAppl. Surf. Sci. 252, 7315 (2006).\n17. M. Ferri, S. Solmi, A. Parisini, M. Bersani, D.\nGiubertoni, and M. Barozzi, J. Appl. Phys. 99,\n113508 (2006).\nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:20 from IEEE Xplore.  Restrictions apply. \n18. B. J. Pawlak, R. Surdeanu, B. Colombeau, A.\nJ. Smith, N. E. B. Cowern, R. Lindsay, W.\nVandervorst, B. Brijs, 0. Richard, and F.\nCristiano, Appl. Phys. Lett. 84, 2055 (2004).\n19. J. J. Hamilton, N. E. B. Cowern, J. A.Sharp,\nK. J. Kirkby, E. J. H. Collart, B. Colombeau, M.\nBersani, D. Giubertoni, A. Parisini, Appl. Phys.\nLett. 89, 042111(2006).\n20. J. J. Hamilton, E. J. H. Collart, B.\nColombeau, M. Bersani, D. Giubertoni, J. A.\nSharp, N. E. B. Cowern, K. J. Kirkby, Mat.\nScience and Eng B., 124, 215 (2005).\nAuthorized licensed use limited to: University of Surrey. Downloaded on September 18, 2009 at 06:20 from IEEE Xplore.  Restrictions apply. \n"}