{"doi":"10.1029\/2010GL045695","coreId":"177325","oai":"oai:aura.abdn.ac.uk:2164\/2120","identifiers":["oai:aura.abdn.ac.uk:2164\/2120","10.1029\/2010GL045695"],"title":"Turbulent friction in flows over permeable walls","authors":["Manes, C.","Pokrajac, D.","Nikora, V. I.","Ridolfi, L.","Poggi, D."],"enrichments":{"references":[{"id":3671,"title":"Advice, methods and tools for estimating channel roughness,","authors":[],"date":"2009","doi":"10.1680\/wama.2009.162.6.353","raw":"McGahey, C., D. W. Knight, and G. P. Samuels (2009), Advice, methods and tools for estimating channel roughness, Proc. Inst. Civ. Eng. Water Manage., 162, 353–362.","cites":null},{"id":3673,"title":"and R.Walters (2007), Double‐averaging concept for rough‐bed open‐channel and overland flows: Theoretical background,","authors":[],"date":null,"doi":"10.1061\/(ASCE)0733-9429(2007)133:8(873)","raw":null,"cites":null},{"id":3679,"title":"Channel flow over permeable beds of graded spheres,","authors":[],"date":"1976","doi":null,"raw":"Zagni, A. F. E., and K. V. H. Smith (1976), Channel flow over permeable beds of graded spheres, J. Hydraul. Div., 102, 207–222.","cites":null},{"id":6018066,"title":"Double‐averaging concept for rough‐bed open‐channel and overland flows: Theoretical background,","authors":[],"date":null,"doi":"10.1061\/(asce)0733-9429(2007)133:8(873)","raw":"Nikora,V.,I.McEwan,S.McLean,S.Coleman,D.Pokrajac,andR.Walters (2007), Double‐averaging concept for rough‐bed open‐channel and overland flows: Theoretical background, J. Hydraul. Eng., 133(8), 873–883.","cites":null},{"id":3676,"title":"Hydraulic resistance of submerged rigid vegetation derived from first‐order closure models,","authors":[],"date":"2009","doi":"10.1029\/2008WR007373","raw":"Poggi, D., C. Krug, and G. G. Katul (2009), Hydraulic resistance of submerged rigid vegetation derived from first‐order closure models, Water Resour. Res., 45, W10442, doi:10.1029\/2008WR007373.","cites":null},{"id":3675,"title":"Hyporheic exchange with gravel beds: Basic hydrodynamic interactions and bedform‐induced advective flows,","authors":[],"date":"2004","doi":"10.1061\/(ASCE)0733-9429(2004)130:7(647)","raw":"Packman, A., M. Salehin, and M. Zaramella (2004), Hyporheic exchange with gravel beds: Basic hydrodynamic interactions and bedform‐induced advective flows, J. Hydraul. Eng., 130(7), 647–656.","cites":null},{"id":3674,"title":"Laws of flow in rough pipes,","authors":[],"date":"1933","doi":"10.1680\/iicep.1976.3342","raw":"Nikuradse, J. (1933), Laws of flow in rough pipes, Forschungsh. 361, Ger. Assoc. of Eng., Duesseldorf, Germany.","cites":null},{"id":3677,"title":"Peculiar mean velocity profiles within a porous bed of an open channel,","authors":[],"date":"2007","doi":"10.1063\/1.2780193","raw":"Pokrajac, D., C. Manes, and I. McEwan (2007), Peculiar mean velocity profiles within a porous bed of an open channel, Phys. Fluids, 19, 098109.","cites":null},{"id":3670,"title":"Turbulence structure of open channel flows over permeable and impermeable beds: A comparative study,","authors":[],"date":"2009","doi":"10.1063\/1.3276292","raw":"Manes, C., D. Pokrajac, I. McEwan, and V. Nikora (2009), Turbulence structure of open channel flows over permeable and impermeable beds: A comparative study, Phys. Fluids, 21, 125109.","cites":null},{"id":3680,"title":"Turbulent boundary‐layer flow over permeable and non‐permeable rough surfaces,","authors":[],"date":"1983","doi":"10.1080\/00221688309499450","raw":"Zippe, H. J., and W. H. Graf (1983), Turbulent boundary‐layer flow over permeable and non‐permeable rough surfaces, J. Hydraul. Res., 21(1), 51–65. C. Manes, D. Poggi, and L. Ridolfi, Department of Hydraulics, Transports and Civil Infrastructures, Politecnico di Torino, Corso Duca degli Abruzzi 24, I‐10129 Torino, Italy. (costantino.manes@polito.it) V. I. Nikora and D. Pokrajac, Department of Engineering, University of Aberdeen, Fraser Noble Building, Kings College, Aberdeen AB24 3UE, UK. MANES ET AL.: FRICTION AND POROUS WALLS L03402 L03402 5o f5","cites":null},{"id":3678,"title":"Turbulent shear flow in porous boundary,","authors":[],"date":"1972","doi":null,"raw":"Ruff, J. F., and L. W. Gelhar (1972), Turbulent shear flow in porous boundary, J. Eng. Mech. Div., 98, 975–991.","cites":null},{"id":3672,"title":"UVP Monitor Model UVP‐XW User’s Guide,","authors":[],"date":"2000","doi":null,"raw":"Metflow (2000), UVP Monitor Model UVP‐XW User’s Guide, Meflow SA, Lausanne, Switzerland.","cites":null}],"documentType":{"type":null}},"contributors":["University of Aberdeen, School of Engineering","University of Aberdeen, Energy","University of Aberdeen, Environment and Food Security"],"datePublished":"03-09-20","abstract":"Peer reviewedPublisher PD","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:aura.abdn.ac.uk:2164\/2120<\/identifier><datestamp>\n                2018-01-06T01:53:05Z<\/datestamp><setSpec>\n                com_2164_320<\/setSpec><setSpec>\n                com_2164_319<\/setSpec><setSpec>\n                com_2164_318<\/setSpec><setSpec>\n                com_2164_677<\/setSpec><setSpec>\n                com_2164_371<\/setSpec><setSpec>\n                com_2164_331<\/setSpec><setSpec>\n                com_2164_705<\/setSpec><setSpec>\n                col_2164_321<\/setSpec><setSpec>\n                col_2164_678<\/setSpec><setSpec>\n                col_2164_706<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nTurbulent friction in flows over permeable walls<\/dc:title><dc:creator>\nManes, C.<\/dc:creator><dc:creator>\nPokrajac, D.<\/dc:creator><dc:creator>\nNikora, V. I.<\/dc:creator><dc:creator>\nRidolfi, L.<\/dc:creator><dc:creator>\nPoggi, D.<\/dc:creator><dc:contributor>\nUniversity of Aberdeen, School of Engineering<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Energy<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Environment and Food Security<\/dc:contributor><dc:subject>\nboundary layer<\/dc:subject><dc:subject>\npermeable wall<\/dc:subject><dc:subject>\nturbulence<\/dc:subject><dc:subject>\nfriction<\/dc:subject><dc:subject>\nTA Engineering (General). Civil engineering (General)<\/dc:subject><dc:subject>\nTA<\/dc:subject><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPublisher PDF<\/dc:description><dc:date>\n2011-09-02T23:01:26Z<\/dc:date><dc:date>\n2011-09-02T23:01:26Z<\/dc:date><dc:date>\n2011-02-02<\/dc:date><dc:date>\n03-09-20<\/dc:date><dc:type>\nJournal article<\/dc:type><dc:identifier>\nManes , C , Pokrajac , D , Nikora , V I , Ridolfi , L & Poggi , D 2011 , ' Turbulent friction in flows over permeable walls ' Geophysical Research Letters , vol 38 . DOI: 10.1029\/2010GL045695<\/dc:identifier><dc:identifier>\n0094-8276<\/dc:identifier><dc:identifier>\nPURE: 6431444<\/dc:identifier><dc:identifier>\nPURE UUID: 2f21a79b-f7f8-4ff3-8795-e61e0ba2bc09<\/dc:identifier><dc:identifier>\nWOS: 000287038200002<\/dc:identifier><dc:identifier>\nScopus: 79751484509<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2164\/2120<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1029\/2010GL045695<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nGeophysical Research Letters<\/dc:relation><dc:rights>\nAn edited version of this paper was published by AGU. Copyright 2011 American Geophysical Union. Manes, C, Pokrajac, D, Nikora, VI, Ridolfi, L & Poggi, D 2011, 'Turbulent friction in flows over permeable walls', Geophysical Research Letters, vol 38.10.1029\/2010GL045695. To view the published open abstract, go to http:\/\/dx.doi.org and enter the DOI.<\/dc:rights><dc:format>\n5<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0094-8276","issn:0094-8276"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Geophysical Research Letters"],"year":3,"topics":["boundary layer","permeable wall","turbulence","friction","TA Engineering (General). Civil engineering (General)","TA"],"subject":["Journal article"],"fullText":"Turbulent friction in flows over permeable walls\nC. Manes,\n1,2 D. Pokrajac,\n2 V. I. Nikora,\n2 L. Ridolfi,\n1 and D. Poggi\n1\nReceived 30 September 2010; revised 3 December 2010; accepted 17 December 2010; published 2 February 2011.\n[1] The experimental results of Nikuradse and the concept\nof hydraulically smooth, transitional, and rough flow\nregimes are commonly used as a benchmark for data inter-\npretation and modeling of hydraulic resistance. However,\nNikuradse’s experiments were carried out in pipes with\nimpermeable rough‐walls whereas many geophysical flows\noccur over permeable walls and thus the permeability effects\nneed to be quantified and accounted for. On the basis of our\nown experimental results, it is shown that wall permeability\ninfluences flow resistance dramatically and that the conven-\ntional ‘hydraulically‐rough regime’, for which the friction\nfactor depends only on the ratio of the roughness size to\nthe flow thickness, does not apply to flows over permeable\nwalls. Indeed, even at high Reynolds number (Re), the\nfriction factor progressively increases with increasing Re.\nPossible mechanisms that explain this behavior, as well\nas the implications of these results for modeling of the fric-\ntion factors and hyporheic exchange in porous‐bed rivers\nare discussed. Citation: Manes, C., D. Pokrajac, V. I. Nikora,\nL. Ridolfi, and D. Poggi (2011), Turbulent friction in flows over\npermeable walls, Geophys. Res. Lett., 38, L03402, doi:10.1029\/\n2010GL045695.\n1. Introduction\n[2] The traditional approach to quantify flow resistance in\nwall bounded flows is to use a friction coefficient or factor\nthat can be defined in a variety of ways. Among the com-\nmon definitions, the Darcy‐Weisbach friction factor that\nrepresents the ratio of frictional forces to inertial forces\nf ¼ 8\nu2\n*\nU2\nb\n, where u* ¼\nﬃﬃﬃ\n 0\n \nq\nis the friction velocity, t0 is the\nmean shear stress acting at the wall surface, and Ub is a bulk\nvelocity (i.e., averaged over the whole flow thickness). In\nhis pioneering studies on flow resistance in rough pipes,\nNikuradse [1933] elucidated that f is basically a function of\ntwo parameters: (i) the roughness Reynolds number,\nRe* ¼\nu*\nd\n  (where n is the kinematic viscosity and d is the\ncharacteristic size of the roughness elements) that quantifies\nthe ratio of the roughness size d to the thickness of the\nviscous sub‐layer, which scales with\nu*\n  ; and (ii) the relative\nsubmergence D\nd, where D is the pipe diameter. Note that\nsome follow up results, such as the Moody’s diagram, are\nbased on a global Re = UD\/n instead of the roughness Re*.\nNikuradse [1933] observed that, with increasing Re* a\nturbulent flow in a pipe experiences three different flow\nregimes, namely the smooth, transitional and hydraulically‐\nrough regime. For a given relative submergence, the friction\nfactor decreases with Re in the smooth regime, then in-\ncreases in the transition regime until it reaches a plateau in\nthe hydraulically rough regime. This behavior is commonly\ninterpreted as a result of the roughness elements being pro-\ngressively exposed to the turbulent flow, with the viscous\nsub‐layer thickness diminishing with increasing Re*.\n[3] The experimental results of Nikuradse [1933] and the\nproposed concepts of hydraulically‐smooth, transitional,\nand rough‐wall (bed) flow regimes have been a major\nbreakthrough in fluid mechanics and are now commonly\nused for data interpretation and prediction of flow resis-\ntance in wall bounded flows. However, these results were\nobtained from experiments involving flows in impermeable‐\nwall pipes, whereas many geophysical flows occur over\npermeable boundaries.\n[4] It is intuitive to expect that, in terms of flow resistance,\na permeable wall behaves differently from an impermeable\none. Indeed, for the latter case, the effective roughness felt\nby the flow is limited to the size of the roughness elements\ncharacterizing the wall surface. In contrast, for the case of a\npermeable wall, this limit is set by the thickness of the wall\nitself. Furthermore, it is plausible that momentum penetra-\ntion within a permeable wall increases with Re*. As a result\nof this, the effective roughness and the associated friction\nfactor should increase with Re* until, in principle, the whole\nwall thickness is exposed to fluid shear. The described\nconcept is partly confirmed by some studies from the liter-\nature [Ruff and Gelhar, 1972; Zagni and Smith, 1976; Zippe\nand Graf, 1983; Manes et al., 2009] although none of these\nprovides compelling evidence to show that friction factors\nincrease due to momentum penetration.\n[5] Despite the results reported in the literature, the effects\nof wall permeability on flow resistance are often neglected.\nThe most striking example comes from studies dedicated to\nthe modeling of friction factors in gravel bed rivers where\nhydraulically‐rough conditions are generally assumed and\nthe dependence of f on Re* is commonly neglected. One of\nthe aims of this letter is to raise the attention to this issue.\nFurthermore, this letter contributes to the current knowledge\nby (i) providing a series of experiments where flow resis-\ntance was investigated in turbulent open channel flows over\ngravel beds to complement the experimental results for\nartificial walls already available in the literature, (ii) dis-\ncussing the most appropriate definition of friction factors for\nflows over permeable walls, and (iii) discussing the physical\nmechanisms responsible for the increase of friction factors\neven within a range of Re, where one would expect a\nhydrodynamically rough behavior.\n2. Description of the Experiments\n[6] All the experiments were performed in a water flume\nat the University of Aberdeen. The flume is 11 m long and\n1Department of Hydraulics, Transports and Civil Infrastructures,\nPolitecnico di Torino, Turin, Italy.\n2Department of Engineering, University of Aberdeen, Aberdeen, UK.\nCopyright 2011 by the American Geophysical Union.\n0094‐8276\/11\/2010GL045695\nGEOPHYSICAL RESEARCH LETTERS, VOL. 38, L03402, doi:10.1029\/2010GL045695, 2011\nL03402 1o f50.4 m wide. Bed slope, water discharge and flow depth were\nmeasured for three bed conditions: (i) a smooth perspex bed;\n(ii) a single layer of gravel grains with nominal diameter\nd = 10 mm; (iii) a 6 cm thick layer of gravel grains with the\nsame diameter as in (ii). The permeability of the porous\nrough bed was k = 2.4 × 10\n−8 m\n2. We chose gravel as the\npermeable material because it is widely encountered in\ngeophysical flows and many of the results presented herein\nare directly relevant to river hydrodynamics. We will refer to\n(i) as the smooth bed, (ii) as the rough‐impermeable bed,\nand (iii) as the rough‐permeable bed. For bed condition (iii),\nin addition to the bulk characteristics (i.e., bed slope, flow\nrate, depth), mean velocity profiles were also measured\nabove the bed by means of a Met‐Flow Ultrasonic Velocity\nProfiler (UVP). A 4MHz UVP probe was inserted within the\nbed with a known angle and with the emitting head facing\nthe free surface (Figure 1). Once the probe was submerged\nby the flow, the system could measure velocities along the\ndirection parallel to the physical axis of the probe (i.e., ua).\nMean streamwise velocities were then computed by\nassuming that the mean vertical velocity is zero and by using\nthe probe inclination angle, i.e., u(z)=ua cos a, (Figure 1).\nFor each experiment, UVP allowed horizontal mean velocity\nmeasurements at 128 positions along the whole flow depth\nwith a spatial resolution of roughly half a millimeter. More\ndetails on the UVP system and the flume used in these\nexperiments are described elsewhere [Metflow, 2000; Manes\net al., 2009].\n[7] For bed conditions (ii) and (iii), experiments were\nconducted by keeping the flow depth constant and varying\nthe bed slope. In analogy with the experiments of Nikuradse\n[1933], this allowed maintaining a constant relative sub-\nmergence H\/d (where H is the flow depth defined as the\ndistance between water surface and the bed‐roughness tops,\nFigure 2), while varying Re* and therefore highlighting the\neffects of Re* on friction factors. This procedure was\nrepeated for two and three values of H\/d for the imperme-\nable and permeable bed configurations, respectively. For\neach submergence, the upper limit of Re* was bounded by\neither the onset of sediment motion or the Froude number\nexceeding 1. Thus, in order to focus specifically on the\neffects of boundary friction on flow resistance, only sub‐\ncritical conditions were considered. The range of Re*\ninvestigated in the experiments with beds (ii) and (iii) was\nfrom 127 to 597, i.e., it corresponded to the conventional\nhydraulically‐rough regime.\n[8] Experiments with the smooth and rough‐impermeable\nbeds (i.e., bed conditions (i) and (ii)) were mainly performed\nto reproduce results already available in the literature and\nhence verify the reliability of the experimental set up. The\nmain focus of this paper is on the results obtained from the\nexperiments with the rough‐permeable bed (bed condition\n(iii)).\n3. Definition of Friction Factors in Flows\nOver Permeable Walls\n[9] Let us consider the case of a uniform, steady and\nturbulent open channel flow over a permeable bed. The flow\nFigure 1. Display of the UVP probe within the permeable\nrough bed.\nFigure 2. Parameters of interest for defining friction factors in flows over permeable beds. (left) A hypothetic profile for\nthe mean velocity (thick solid line) and for the porosity function  (z) (thin solid line) over and within a permeable bed. Ud\nand  min are the undisturbed velocity within the bed and the bulk porosity of the bed respectively. (right) The solid line\nshows the momentum supply between any level z and the free surface. For z0 < z < zc the momentum supply is partially\nabsorbed by the drag and partially transferred by the fluid shear stress (dashed line). The momentum supply at the level\nz0 is denoted with t0.\nMANES ET AL.: FRICTION AND POROUS WALLS L03402 L03402\n2o f5domain can be split in three distinct regions, here called\n(1) the porous medium region where the flow can be studied\nby means of porous media hydrodynamics; (2) the surface\nflow region that often exhibits boundary layer type behav-\nior; and (3) an interface region where the surface flow and\nthe porous medium region interact (Figure 2). According to\nthis flow partition, we define zc as the height of the rough-\nness tops and z0 as the level at which the total fluid stress tf,\nimposed by the surface flow, vanishes within the porous\nbed. It is reasonable to assume that this level coincides with\nthe elevation where the mean velocity profile within the\nporous bed becomes constant (Figure 2) (although in gran-\nular beds of particular regular packing this level may also\ncorrespond to a local minimum [Pokrajac et al., 2007]).\n[10] The other parameters for our considerations include:\nh =\nR\nz0\nzc (z) dz (where  (z) is the wall porosity function,\nFigure 2), i.e., the effective height of fluid volume contained\nwithin the interface region; t0 = rgS(H + h), which is the\ntotal weight per unit surface of the fluid contained between\nz0 and zws, projected along the mean flow direction, where r\nis the fluid density, g is the gravity acceleration, S is the bed\nslope, and H is the flow depth; the Double Averaged mean\nvelocity profile hui(z), i.e., averaged first in time and then in\nspace within thin boxes parallel to the bed (overbar and\nangular brackets stand for time and spatial averaging\nrespectively; for more details on the Double Averaging\nMethodology (DAM) see Nikora et al. [2007]); the bulk\nmean velocity Uc ¼ 1\nH\nR zws\nzc uðzÞdz within the surface flow\nregion; the bulk mean velocity UL ¼ 1\nh\nR zc\nz0 huiðzÞ ðzÞdz\nwithin the interface region; and the undisturbed velocity UD\nwithin the porous media region, which comes from the\nbalance between gravity and drag forces. The above\nvelocities relate to the specific bulk discharge as q = Q\/B =\nUcH + ULh + UDD, where B is the width of the flume and\nD =\nR\n0\nz0 (z) dz is the effective thickness of the porous bed\nbelow the interface region (Figure 2).\n[11] In open‐channel flow hydrodynamics, friction factors\nhave been introduced primarily for engineering applications\nand thus their definition follows the need of quantifying the\namount of water passing through a stream cross‐section per\nunit time at given flow depth and bed slope. In the case of\nflows over permeable beds, a friction factor can be defined\nin several ways depending on the particular needs. If we are\ninterested in a combined flow rate through the surface and\nthe interface flow regions, then a friction factor may be\ndefined as f ¼ 8\nu2\n*\nU2\nb\n,w h e r eUb ¼\nUcHþULh\nHþh [P o g g ie ta l . ,\n2009] and, assuming 2‐D flow conditions, the friction\nvelocity can be estimated as u* =\nﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃ\ngSðH þ hÞ\np\n.\n[12] As far as our experiments are concerned, f could be\neasily estimated for the impermeable‐rough bed case,\nbecause Ub and u* are known. Indeed, Q, H, B, S were\nmeasured and h is constant since z0 coincides with the flume\nbottom. In contrast, for the permeable‐rough bed case, f is\ndifficult to estimate because the position of z0 is likely to be\nflow‐dependent and is not known a priori. As an alternative,\na definition can be implemented, focusing on the assessment\nof the surface flow rate defined by Uc, i.e., f1 ¼ 8\ngSH\nU2\nc , where\nUc in our experiments was computed from the integration of\nthe mean velocity profile measured by UVP. The interrela-\ntion between f and f1 can be presented as:\nf ¼ 8\nu2\n*\nU2\nb\n¼ 8\ngS H þ h ðÞ\n3\nUcH þ ULh ðÞ\n2 ¼ f1\n1 þ h\nH\n   3\n1 þ UL\nUc\nh\nH\n   2 ¼ f1\n 3\n1\n 2\n2\n: ð1Þ\nSince the ratio between interface and surface mean velocity\nis less than unity, i.e., UL\nUc < 1, then\n 3\n1\n 2\n2\nis greater than one.\nThis means that f1 always underestimate f and the difference\nincreases with increasing h\nH and hence with increasing\nmomentum penetration within the bed.\n4. Results and Discussion\n[13] Figures 3a and 3b report plots of the friction factor vs\nbulk Reynolds number Re = UbH\/n. Re is used in place of\nRe* because it allows inclusion of smooth‐bed data, and also\nfor consistency with already published data. It is encour-\naging to see that for the impermeable bed configurations,\nfriction factors behave as reported in the literature. The\nsmooth bed data follow the well known Blasius‐Karman\nrelationship. The rough‐impermeable bed data at different\nsubmergences are constant within experimental uncertainty,\nexcept for the point at the lowest Reynolds numbers that\nFigure 3. (a) Friction factors for the impermeable‐rough\nbed; (b) friction factors for the permeable‐rough bed;\n(c) residual discharge for the permeable‐rough bed experi-\nments. The dashed lines in Figures 3a and 3b correspond to\nthe Blasius‐Karman relationship for smooth walls. The inset\nin Figure 3b shows the friction factors for the permeable‐\nrough bed (symbols) overlapped with the Moody diagram\n(solid lines). Relative relative roughness (submergence)\nincreases (decreases) in the direction of the arrow.\nMANES ET AL.: FRICTION AND POROUS WALLS L03402 L03402\n3o f5shows some transitional behavior. This indicates that the\nflow was mostly at the hydraulically‐rough regime. Friction\nfactor curves for the permeable rough bed configuration are\nvery similar to those reported by Zagni and Smith [1976]\nand Ruff and Gelhar [1972]. In particular, friction factors\ndisplay increasing trends at any Reynolds number without\nreaching a hydrodynamically rough plateau (this is partic-\nularly evident for the curve associated with the highest\nrelative submergence, which contains the widest range of\nRe). At low Re such increasing trend may still be justified by\nstandard transitional behavior, but not at higher Re where\nRe* approaches values close to 400–500 and therefore vis-\ncous drag acting on the grains located at the bed surface is\nexpected to be negligible compared to pressure drag. It is\nworth noting that the increasing trend of f1 reported in\nFigure 3b would be even steeper for f, because, as discussed\nin section 3, f1 underestimates f as Re, and hence momentum\npenetration, increases. Therefore, the increasing trend in f1 is\na robust result, i.e., it does not depend on how exactly\nfriction factors are defined.\n[14] We now discuss a range of possible physical\nmechanisms that may explain the Re dependence of the\nfriction factors observed in Figure 3b. As introduced in\nsection 1, the increasing trend of friction factors can be\nexplained by a progressively deeper momentum penetration\nwithin the porous bed as Re increases. In turbulent flows\nover porous media, the effective hydrodynamic roughness is\nnot related to the size of the grains composing the bed, but\nrather to the thickness of the interface region, i.e., h.\nTherefore, it is intuitive to state that an increase in h (i.e., an\nincrease in momentum penetration) corresponds to an\nincrease in the effective roughness height and, in the case of\nflows with constant depth, to a decrease in relative sub-\nmergence H\/h. In a standard Moody diagram, the decrease\nin relative submergence implies a jump from a lower to a\nhigher line of relative roughness and therefore to an increase\nin the friction factor (inset of Figure 3b).\n[15] Some support to the hypothesis of momentum pen-\netration increasing with Re can be found in Figure 3c: since\nthe flow rate within the porous media region is negligible,\nthe ratio (Q − Qc)\/Q (where Qc = Uc (HB)) represents an\nestimate of the amount of water flowing within the interface\nregion normalized with the total discharge Q.F i g u r e3 c\nclearly shows that (Q − Qc)\/Q increases with increasing\nRe, which means that the amount of water flowing within\nthe interfacial region increases as Re increases. This\nbehavior is consistent with our hypothesis, although it does\nnot prove it because the increase of (Q − Qc)\/Q could also be\nexplained by an increase of mean velocities within a fixed\ndepth of momentum penetration. It is worth noting that at\nlow Re,( Q − Qc)\/Q assumes negative values in Figure 3c\nbecause Qc is computed as if the mean velocity profile\nmeasured in the central cross section of the flume extends\nacross the whole width, i.e., side‐wall effects are neglected.\nA correction of Qc that includes side wall effects was not\nattempted because we are not interested in the absolute\nvalues of (Q − Qc)\/Q but rather in its dependency on Re.\n[16] Another possible mechanism that may contribute to\nthe Re dependence of the friction factors is associated with\nthe nature of drag around sheltered and buried grains. It is\nplausible that, due to the sheltering effects of the overlying\ngrains, some buried grains may not generate pressure drag\neven at high Re. With increasing Re, however, more and\nmore sheltered particles may experience flow separations\nleading to the growing total drag. This can produce a rise of\nthe friction factors with increasing Re even if the depth of\nmomentum penetration (i.e., h) remains constant.\n[17] At this stage we cannot assess the contributions of the\ndescribed mechanisms to the observed effect of growing\nresistance factors with Re. However, it is likely that a\ncombination of mechanisms acts to produce the observed\neffect rather than a single dominant mechanism.\n[18] It is important to note that, at sufficiently large Re, the\nconventional picture of a constant friction factor maybe\nrestored because the depth of momentum penetration is lim-\nited by the depth of the porous bed. However, the critical Re\nrestoring the conventional picture may be sufficiently high\nthat it may not be attained in many practical applications.\n5. Implications\n[19] The common assumption that at Re*   70, river\nflows are in the hydraulically‐rough regime and friction\nfactors are dependent only on relative submergence [see,\ne.g., McGahey et al., 2009], has to be refined. River beds are\noften porous and therefore a Reynolds number dependence\nof friction factors due to permeability must be expected. This\nresult has direct implications for river engineering and earth\nsciences. For example, it is common practice to estimate\nresistance coefficients for river flows at periods of low flow\nrates when it is easy to measure. By assuming hydraulically‐\nrough conditions, the same coefficients are then used to\nestimate water levels during floods, when the flow Re is\nmuch higher. Such a procedure may lead to a significant\nunderestimation of water levels because, according to our\nresults, with increasing Re the flow resistance exerted by\nporous beds is significantly enhanced.\n[20] Our results also provide explanation for an unre-\nsolved issue concerning hyporheic exchange in open chan-\nnel flows over porous beds. Packman et al. [2004] observed\nthat the diffusion coefficients for solute exchange between\nopen channel flows and (flat) gravel or sand beds were\nproportional to the square of the Reynolds number. The\nauthors could not provide a definitive explanation for this\nbehavior. However, they argued that, with increasing Re,\nmomentum transfer between stream and pore‐water flows\nmay also increase and in turn enhance scalar diffusion. Our\nresults provide support to this hypothesis. In fact, the\nincrease of friction factors with Re observed in our experi-\nments is consistent with the idea of enhanced momentum\ntransfer at the sediment water interface.\n6. Conclusions\n[21] Flow resistance in turbulent boundary layers over\nporous walls has a peculiar behavior. By means of the\nexperimental results presented herein, we have shown that\nfor a given relative submergence, friction factors increase as\nRe increases without displaying a classical hydraulically\nrough plateau even when Re*   70. We have demonstrated\nthat such a rise in friction factors is likely to be associated\nwith a progressive increase of momentum penetration into\nthe porous bed and\/or with gradual involvement of sheltered\nbed particles in the generation of pressure drag. We have\nthen discussed the implications of our results in the context\nMANES ET AL.: FRICTION AND POROUS WALLS L03402 L03402\n4o f5of modeling friction factors and hyporheic exchange in\ngravel bed rivers.\n[22] Acknowledgments. The work presented in this paper was\nfunded by the Royal Society (grant TG091071) and by Regione Piemonte.\nReferences\nManes, C., D. Pokrajac, I. McEwan, and V. Nikora (2009), Turbulence\nstructure of open channel flows over permeable and impermeable beds:\nA comparative study, Phys. Fluids, 21, 125109.\nMcGahey, C., D. W. Knight, and G. P. Samuels (2009), Advice, methods\nand tools for estimating channel roughness, Proc. Inst. Civ. Eng. Water\nManage., 162, 353–362.\nMetflow (2000), UVP Monitor Model UVP‐XW User’s Guide, Meflow SA,\nLausanne, Switzerland.\nNikora,V.,I.McEwan,S.McLean,S.Coleman,D.Pokrajac,andR.Walters\n(2007), Double‐averaging concept for rough‐bed open‐channel and over-\nland flows: Theoretical background, J. Hydraul. Eng., 133(8), 873–883.\nNikuradse, J. (1933), Laws of flow in rough pipes, Forschungsh. 361, Ger.\nAssoc. of Eng., Duesseldorf, Germany.\nPackman, A., M. Salehin, and M. Zaramella (2004), Hyporheic exchange\nwith gravel beds: Basic hydrodynamic interactions and bedform‐induced\nadvective flows, J. Hydraul. Eng., 130(7), 647–656.\nPoggi, D., C. Krug, and G. G. Katul (2009), Hydraulic resistance of\nsubmerged rigid vegetation derived from first‐order closure models,\nWater Resour. Res., 45, W10442, doi:10.1029\/2008WR007373.\nPokrajac, D., C. Manes, and I. McEwan (2007), Peculiar mean velocity\nprofiles within a porous bed of an open channel, Phys. Fluids, 19,\n098109.\nRuff, J. F., and L. W. Gelhar (1972), Turbulent shear flow in porous\nboundary, J. Eng. Mech. Div., 98, 975–991.\nZagni, A. F. E., and K. V. H. Smith (1976), Channel flow over permeable\nbeds of graded spheres, J. Hydraul. Div., 102, 207–222.\nZippe, H. J., and W. H. Graf (1983), Turbulent boundary‐layer flow over\npermeable and non‐permeable rough surfaces, J. Hydraul. Res., 21(1),\n51–65.\nC. Manes, D. Poggi, and L. Ridolfi, Department of Hydraulics,\nTransports and Civil Infrastructures, Politecnico di Torino, Corso Duca\ndegli Abruzzi 24, I‐10129 Torino, Italy. (costantino.manes@polito.it)\nV. I. Nikora and D. Pokrajac, Department of Engineering, University of\nAberdeen, Fraser Noble Building, Kings College, Aberdeen AB24 3UE,\nUK.\nMANES ET AL.: FRICTION AND POROUS WALLS L03402 L03402\n5o f5"}