{"doi":"10.1017\/S0305004104008035","coreId":"66139","oai":"oai:dro.dur.ac.uk.OAI2:2995","identifiers":["oai:dro.dur.ac.uk.OAI2:2995","10.1017\/S0305004104008035"],"title":"A bound for the number of automorphisms of an arithmetic Riemann surface.","authors":["Belolipetsky,  M.","Jones,  G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-03","abstract":"We show that for every g > 1 there is a compact arithmetic Riemann surface of genus g with at least 4(g-1)automorphisms, and that this lower bound is attained by infinitely many genera, the smallest being 24.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66139.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2995\/1\/2995.pdf","pdfHashValue":"32e595313d260a1bc4e0512196b4ea1c6647f4fa","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2995<\/identifier><datestamp>\n      2011-08-24T08:19:23Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A bound for the number of automorphisms of an arithmetic Riemann surface.<\/dc:title><dc:creator>\n        Belolipetsky,  M.<\/dc:creator><dc:creator>\n        Jones,  G.<\/dc:creator><dc:description>\n        We show that for every g > 1 there is a compact arithmetic Riemann surface of genus g with at least 4(g-1)automorphisms, and that this lower bound is attained by infinitely many genera, the smallest being 24.\\ud\n<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        Mathematical proceedings of the Cambridge Philosophical Society, 2005, Vol.138(2), pp.289-299 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2995<\/dc:identifier><dc:identifier>\n        issn:0305-0041<\/dc:identifier><dc:identifier>\n        issn: 1469-8064<\/dc:identifier><dc:identifier>\n        doi:10.1017\/S0305004104008035<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2995\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S0305004104008035<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2995\/1\/2995.pdf<\/dc:identifier><dc:rights>\n        Copyright © Cambridge University Press 2005. This paper has been published by Cambridge University Press in Mathematical proceedings of the Cambridge Philosophical Society (138:2 (2003) 289-299) http:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=283520<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1469-8064","issn:0305-0041","issn: 1469-8064","0305-0041"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n31 March 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBelolipetsky, M. and Jones, G. (2005) ’A bound for the number of automorphisms of an arithmetic Riemann\nsurface.’, Mathematical proceedings of the Cambridge Philosophical Society., 138 (2). pp. 289-299.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0305004104008035\nPublisher’s copyright statement:\nCopyright Cambridge University Press 2005. This paper has been published by Cambridge University Press in\nMathematical proceedings of the Cambridge Philosophical Society (138:2 (2003) 289-299)\nhttp:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=onlineaid=283520\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n31 March 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nPublished version \n \nCitation for published item: \nBelolipetsky, M. and Jones, G. (2005) 'A bound for the number of automorphisms of an \narithmetic Riemann surface.', Mathematical proceedings of the Cambridge Philosophical \nSociety., 138 (2). pp. 289-299. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1017\/S0305004104008035 \n \nPublisher’s copyright statement: \nCopyright © Cambridge University Press 2005. This paper has been published by \nCambridge University Press in Mathematical proceedings of the Cambridge Philosophical \nSociety (138:2 (2003) 289-299) \nhttp:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=283520 \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nMath. Proc. Camb. Phil. Soc. (2005), 138, 289 c© 2005 Cambridge Philosophical Society\nDOI: 10.1017\/S0305004104008035 Printed in the United Kingdom\n289\nA bound for the number of automorphisms of an arithmetic\nRiemann surface\nBy MIKHAIL BELOLIPETSKY\nSobolev Institute of Mathematics, Novosibirsk, 630090, Russia.\ne-mail: mbel@math.nsc.ru\nand GARETH A. JONES\nFaculty of Mathematical Studies, University of Southampton, Southampton, SO17 1BJ.\ne-mail: gaj@maths.soton.ac.uk\n(Received 16 December 1999; revised 2 December 2003)\nAbstract\nWe show that for every g \u0002 2 there is a compact arithmetic Riemann surface of\ngenus g with at least 4(g − 1) automorphisms, and that this lower bound is attained\nby infinitely many genera, the smallest being 24.\n1. Introduction\nSchwarz [17] proved that the automorphism group of a compact Riemann surface\nof genus g \u0002 2 is finite, and Hurwitz [10] showed that its order is at most 84(g −\n1). This bound is sharp, by which we mean that it is attained for infinitely many\ng, and the least genus of such an extremal surface is 3. However, it is also well\nknown that there are infinitely many genera for which the bound 84(g − 1) is not\nattained. It therefore makes sense to consider the maximal order N (g) of the group\nof automorphisms of any Riemann surface of genus g. Accola [1] and Maclachlan [14]\nindependently proved that N (g) \u0002 8(g + 1). This bound is also sharp, and according\nto p. 93 of [2], Paul Hewitt has shown that the least genus attaining it is 23. Thus\nwe have the following sharp bounds for N (g) with g \u0002 2:\n8(g + 1) \u0003 N (g) \u0003 84(g − 1).\nWenow consider these bounds from an arithmetic point of view, defining arithmetic\nRiemann surfaces to be those which are uniformized by arithmetic Fuchsian groups.\nThe motivation for this approach can be found in the works of Borel, Margulis and\nothers on arithmetic groups. Concerning Riemann surfaces with large groups of\nautomorphisms, the surprising fact, which can easily be seen, is that all the extremal\nsurfaces for Hurwitz’s upper bound are arithmetic, whereas all the extremal surfaces\nfor the Accola–Maclachlan lower bound are non-arithmetic. This raises the natural\nquestion: “What can be said about the other two bounds?”\n290 Mikhail Belolipetsky and Gareth A. Jones\nThe non-arithmetic analog of Hurwitz’s upper bound, obtained by the first author\nin [3], is 156(g− 1)\/7; this bound is sharp, and the least genus attaining it is 50. The\naim of the current paper is to obtain an arithmetic analog of the Accola–Maclachlan\nlower bound, namely that for each g \u0002 2 there is an arithmetic surface of genus g\nwith 4(g − 1) automorphisms, and that this bound is attained for infinitely many g,\nstarting with 24.\nWe now collect these results together: definingNar(g) andNna(g) to be the maximal\norders of the automorphisms groups of the arithmetic and non-arithmetic surfaces\nof genus g respectively, for sufficiently large g we have sharp bounds\n4(g − 1) \u0003 Nar(g) \u0003 84(g − 1),\n8(g + 1) \u0003 Nna(g) \u0003\n156\n7\n(g − 1).\nIn Section 2 we recall the basic facts about Riemann surfaces and arithmetic\ngroups. Section 3 contains the proof of the 4(g − 1) lower bound, with a number of\nadditional remarks. Finally, in Section 4 we use our proof of the 4(g − 1) bound to\ndescribe an infinite set of genera for which the bound is attained, and to prove that\nthe least genus attaining the bound is 24.\n2. Basic facts\nIn this section we recall some definitions and basic properties of Riemann surfaces\nand arithmetic groups. For more information about Riemann surfaces and Fuchsian\ngroups see [7, 11]. The basic references for quaternion algebras and arithmetic groups\nare [12, 20].\nDefinition 2·1. ARiemann surface is a connected one-dimensional complex analytic\nmanifold. An automorphism of a Riemann surface is an analytic mapping of the\nsurface onto itself.\nIn this paper we shall consider only compact Riemann surfaces of genus g \u0002 2. By\nthe uniformization theorem [7, chapter IV] each such surface S can be represented\nas the quotient space H\/ΓS , where H is the hyperbolic plane and ΓS is a cocompact\ntorsion-free discrete subgroup of the group Isom+(H) = PSL(2,R) of orientation-\npreserving isometries of H. This group ΓS , called the surface group corresponding to\nS, is unique up to conjugacy in PSL(2,R) and is finitely generated.\nDiscrete subgroups of PSL(2,R) are called Fuchsian groups. Each cocompact\nFuchsian group Γ has a signature σ = (g;m1, . . . ,mk), where g is a non-negative\ninteger, equal to the genus of H\/Γ, and each mj is an integer greater than 1, indic-\nating a cone-point of order mj in H\/Γ. This signature corresponds to the canonical\npresentation for Γ:\nΓ(g;m1, . . . ,mk) =\n〈\nα1, β1, . . . , αg, βg, γ1, . . . , γk |\ng∏\ni=1\n[αi, βi]\nk∏\nj=1\nγj = 1, γ\nmj\nj = 1\n〉\n.\nIf g = 0 we shall omit g from σ, and write (m1, . . . ,mk).\nAutomorphisms of an arithmetic Riemann surface 291\nWe define μ(Γ) to be the hyperbolic measure of H\/Γ; it can be expressed in terms\nof the signature:\nμ(Γ) = μ(g;m1, . . . ,mk) = 2π\n(\n2g − 2 +\nk∑\nj=1\n(\n1− 1\nmj\n))\n. (1)\nBy the Riemann–Hurwitz formula if Γ′ is a subgroup of index n in Γ we have:\nμ(Γ′) = n · μ(Γ).\nThe automorphisms of a Riemann surface S lift to the isometries ofH normalizing\nthe surface group ΓS , so S has automorphism group\nAut (S)\u0002N (ΓS)\/ΓS\nwhere N (ΓS) is the normalizer of ΓS in PSL(2,R).\nIn our investigations we often need to construct a Riemann surface S with a given\nFuchsian group Γ normalizing its surface group ΓS . In order to do this one has\nto find a torsion-free normal subgroup of finite index in Γ, or equivalently to find\nan epimorphism from Γ onto some finite group G with a torsion-free kernel. We\ncall such an epimorphism a surface-kernel epimorphism, or SKE for short. In these\ncircumstances Aut (S) has a subgroup isomorphic to G. It is known that in any\nFuchsian group all elements of finite order are conjugate to powers of the elliptic\ngenerators in a canonical presentation of the group. Hence, in order to verify that a\ngiven epimorphism is a SKE, one has only to check that the orders of these generators\nare preserved.\nNow we introduce a special class of Riemann surfaces, which we call arithmetic\nsurfaces.\nDefinition 2·2. (See [4, 12, 15, 18, 20].) Let A = (a,b\nk\n) be a quaternion algebra over\na totally real number field k, such that there is an isomorphism ρ from (a,bR ) to the\nmatrix algebra M2(R) and such that (\nσ(a),σ(b)\nR ) \u0002 H (Hamilton’s quaternions) for\nevery non-identity Galois monomorphism σ: k → R. Let O be an order in A, and\nlet O1 be the group of elements of norm 1 in O. Then any subgroup of PSL(2,R)\nwhich is commensurable with the image in PSL(2,R) of some such ρ(O1) is called\nan arithmetic Fuchsian group.\nArithmeticity is invariant under conjugation in PSL(2,R), so the following defin-\nition is valid:\nDefinition 2·3. A Riemann surface is arithmetic if it is uniformized by an arithmetic\nFuchsian group. All other Riemann surfaces are nonarithmetic.\nWe finish this section with some examples of arithmetic Fuchsian groups and\nRiemann surfaces.\nExample 2·1. Triangle groups are Fuchsian groups which have signatures of the\nform (m1,m2,m3). Triangle groups with a given signature are conjugate in PSL(2,R)\n(this fails for most other signatures), so either all of them or none of them are\narithmetic. Takeuchi first proved that there are only finitely many signatures of\narithmetic triangle groups, and gave the complete list of them in [18]; particularly\n292 Mikhail Belolipetsky and Gareth A. Jones\nimportant examples for us are the signatures (2, 3, 7) and (2, 4, 5). In order to obtain\nthis result Takeuchi used an arithmeticity test which he introduced in the same\npaper.\nExample 2·2. The orientation-preserving subgroup of the group generated by re-\nflections in the sides of a right-angled hyperbolic pentagon Π is a Fuchsian group\nΓ of signature (2, 2, 2, 2, 2). If Π can be subdivided into n congruent triangles, so\nthat whenever two triangles have a common side they are symmetric with respect\nto that side, then Γ is a subgroup of index n in the corresponding triangle group.\nIn particular, if this triangle group is arithmetic then so is Γ. For instance, one can\nbarycentrically subdivide an equilateral right-angled pentagon into 10 triangles with\nangles π\/2, π\/4 and π\/5, and so obtain a (2, 2, 2, 2, 2)-subgroup of index 10 in the\narithmetic (2, 4, 5)-group. However, it is worth noting that among the arithmetic\ngroups of a given signature there may also be maximal Fuchsian groups, and these\ncan not be obtained as subgroups of arithmetic triangle groups.\nExample 2·3. All surfaces of genus g with 84(g−1) automorphisms (such as Klein’s\nquartic) are arithmetic, since they are uniformized by finite index subgroups of the\n(2, 3, 7) triangle group, which is arithmetic.\n3. The main results\nLemma 3·1. Let {Sg}g∈G be an infinite sequence of arithmetic surfaces of different\ngenera g, such that for each g ∈ G the group of automorphisms of Sg has order a(g + b)\nfor some fixed a and b. Then b = −1.\nProof. Let S be a surface from the given sequence. Since Aut (S)\u0002N (ΓS)\/ΓS , the\nRiemann–Hurwitz formula gives\nμ(N (ΓS)) =\nμ(ΓS)\n|Aut (S)| =\n2π(2g − 2)\na(g + b)\n,\nso μ(N (ΓS))→ 4π\/a as g →∞.\nSince ΓS is an arithmetic Fuchsian group, N (ΓS) is also arithmetic. Borel [4]\nshowed that the measures of arithmetic groups form a discrete subset of R, so for all\nbut finitely many g ∈ G we have\n2π(2g − 2)\na(g + b)\n=\n4π\na\n,\nand from this it follows that b = −1.\nAs an immediate consequence of Lemma 3·1 we deduce that the Accola–Maclachlan\nlower bound for N (g) cannot be attained by infinitely many arithmetic surfaces. In\nfact, since the extremal surfaces for this bound are uniformized by surface subgroups\nof (2, 4, 2(g + 1))-groups with g \u0002 24 [14], and these are not arithmetic by [18], it is\nnever attained by arithmetic surfaces.\nIt also follows from Lemma 3·1 that the infinite sequences of Riemann surfaces\nwith automorphism groups of order 8(g + 1), 8(g + 3), etc., as studied by Accola [1],\nConder and Kulkarni [5], Maclachlan [14] and others, can be constructed only in\nnon-arithmetic situations.\nAutomorphisms of an arithmetic Riemann surface 293\nWe now come to the central question of this paper, which is to find a sharp lower\nbound for Nar(g).\nLemma 3·2. Nar(g) \u0002 4(g − 1) for all g \u0002 2.\nProof. Let Γ= 〈γ1, . . . , γ5 | γ2j = γ1 · · · γ5 = 1〉 be an arithmetic group with signature\n(2, 2, 2, 2, 2) (see Example 2·2). Consider the homomorphism θ from Γ to the dihedral\ngroup G = D2(g−1) = 〈a, b | a2(g−1) = b2 = (ab)2 = 1〉 of order 4(g − 1) defined by\nγj \u0007→ ab, b, ag−2b, b, ag−1 for j = 1, . . . , 5. It is easy to verify that θ is a SKE. The\nkernelK = ker (θ) is therefore a surface group, and the surface S = H\/K is arithmetic\nsince K is a finite index subgroup of the arithmetic group Γ. Since μ(Γ) = π and\n|G| = 4(g−1), the Riemann–Hurwitz formula gives μ(K) = μ(Γ)|G| = 2π(2g−2) and\nso S has genus g. Since Aut (S) \u0002 Γ\/K\u0002G it follows that Nar(g) \u0002 |G| = 4(g − 1).\nTheorem 3·1. Nar(g) \u0002 4(g−1) for all g \u0002 2, and this bound is attained for infinitely\nmany values of g.\nProof. The inequality in the statement of the theorem was proved in the previous\nlemma, so it remains to show that the bound is sharp. Suppose that G :=Aut (S) has\norder |G| > 4(g − 1) for some compact arithmetic surface S of genus g \u0002 2. We will\nsuccessively impose a set of conditions on g which lead to a contradiction, and then\nshow that infinitely many values of g satisfy these conditions.\nBy our hypothesis, G\u0002Γ\/K for some cocompact arithmetic group Γ and normal\nsurface subgroup K = ΓS of Γ, with\n4π(g − 1) = μ(K) = |G|μ(Γ) > 4(g − 1)μ(Γ), (2)\nso μ(Γ) < π. Borel’s discreteness theorem [4] implies that there are only finitely\nmany measures of cocompact arithmetic groups μ(Γ) < π, and then formula (1) for\nμ(Γ) shows that these correspond to a finite set Σ of signatures, all of genus 0 and\nwith either three or four elliptic periods.\nFor each σ ∈ Σ, the number q = μ(Γ)\/4π is rational and depends only on the\nsignature σ of Γ, so write q = r\/s = rσ\/sσ in reduced form, and let R = lcm{ rσ |\nσ ∈ Σ }. By (2) we have |G| = (g − 1)\/q = (g − 1)s\/r for some such q. Since |G| is an\ninteger, if we choose g so that g − 1 is coprime to R then for surfaces of genus g we\nhave r = 1 and |G| = (g − 1)s.\nSuppose that g − 1 is a prime p > S, where S = max{ sσ | σ ∈ Σ, rσ = 1 }.\nThen |G| = ps with s coprime to p and less than p + 1, so Sylow’s Theorems imply\nthat G has a normal Sylow p-subgroup P \u0002 Cp. Let Δ denote the inverse image of\nP in Γ, a normal subgroup of Γ with Γ\/Δ \u0002 Q :=G\/P of order s. Let Π denote\nthe finite set of primes which divide an elliptic period mj of some signature σ ∈ Σ\nwith rσ = 1. If we take p \u0002 Π, then the natural epimorphism G → Q preserves the\norders of the images of all elliptic generators of Γ; the inclusion K \u0003 Δ therefore\ninduces a smooth p-sheeted covering S → T = H\/Δ of surfaces, so Δ is a surface\ngroup of genus 1+ (g− 1)\/p = 2. Thus Q is a group of automorphisms of a Riemann\nsurface T of genus 2, so Q is one of a known finite list of groups (for instance,\n|Q| \u0003 48). Let E denote the least common multiple of the exponents of all the groups\nof automorphisms of Riemann surfaces of genus 2. (All we need here is the fact that\nE is finite and even.)\n294 Mikhail Belolipetsky and Gareth A. Jones\nSince Δ\/K\u0002P \u0002Cp it follows that K contains the subgroup Δ′Δp generated by\nthe commutators and pth powers in Δ, so P is isomorphic (as a ZpQ-module) to a 1-\ndimensional quotient of the ZpQ-module Δ\/Δ′Δp, where the action ofQ is induced by\nconjugation in Γ. NowΔ is isomorphic to the fundamental group π1(T ) of T , so Δ\/Δ′ is\nisomorphic (as a ZQ-module) to its first integer homology groupH1(T ,Z)\u0002π1(T )ab,\nand hence Δ\/Δ′Δp is isomorphic (as a ZpQ-module) to H1(T ,Zp) \u0002 H1(T ,Z) ⊗\nZp; since T has genus γ = 2, this has dimension 2γ = 4 as a vector space over\nZp. Since p does not divide s = |Q|, Maschke’s Theorem [8, I.17.7] implies that\nH1(T ,Zp) is a direct sum of irreducible submodules. Now H1(T ,C) = H1(T ,Z) ⊗ C\nis a direct sum of two Q-invariant subspaces, corresponding under duality to the\nholomorphic and antiholomorphic differentials inH1(T ,C), and these afford complex\nconjugate representations of Q [16]. It follows that there are just three possibilities\nfor H1(T ,Zp): it may be irreducible, a direct sum of two irreducible 2-dimensional\nsubmodules, or a direct sum of four irreducible 1-dimensional submodules. Since\nH1(T ,Zp) has a 1-dimensional quotient, only the last of these three cases can arise.\nWe have p > 2 (since p > S \u0002 2), so a theorem of Serre [7, V·3·4] implies that Q is\nfaithfully represented on H1(T ,Zp); thus Q \u0003 GL1(p)4\u0002 (Cp−1)4, so Q has exponent\ne dividing p− 1. Since e also divides E, if we choose p so that gcd(p− 1, E) = 2 then\ne must divide 2. Since Δ is a surface group, the natural epimorphism Γ → Γ\/Δ\u0002Q\nis a SKE, so each elliptic period of Γ is equal to 2. However, as noted earlier, Γ is\na cocompact Fuchsian group of genus 0 with at most four elliptic periods, so this\ncontradicts the fact that μ(Γ) > 0.\nIt remains to check that there are infinitely many values of g satisfying the above\nconditions, namely that g − 1 is a prime p where p > S, p \u0002 Π, p is coprime to R,\nand gcd(p − 1, E) = 2. Dirichlet’s Theorem implies that there are infinitely many\nprimes p satisfying the last condition (for instance, primes p ≡ −1 mod (E)), and all\nbut finitely many satisfy the other three conditions (since Π is finite), so the proof is\ncomplete.\nRemark 3·1. In this proof arithmeticity is used only to show that there are just\nfinitely many signatures σ that can occur. It follows that there are similar results for\nother classes of groups with this finiteness property.\nRemark 3·2. For our chosen values of g, the bound 4(g − 1) is attained only by\ndihedral quotients of Γ = Γ(2, 2, 2, 2, 2), as in Lemma 3·2. To see this, repeat the proof\nof Theorem 3·1, but starting with |Aut (S)| \u0002 4(g−1) instead of strict inequality. We\neventually find that Γ = Γ(2, 2, 2, 2, 2) or Γ = Γ(1; 2) = 〈α, β, γ | γ2 = [α, β]γ = 1〉;\nsince Q is abelian (having exponent 2), all commutators in G lie in P and hence\nthere is no SKE from Γ(1; 2) ontoQ. Thus Γ = Γ(2, 2, 2, 2, 2). The Riemann–Hurwitz\nformula gives |Q| = μ(Δ)\/μ(Γ) = 4π\/π = 4, so Q\u0002 V4 (a Klein four-group). Since\nAut (Cp)\u0002 Cp−1 the only extensions of Cp by V4 are Cp × V4 and Dp × C2\u0002 D2p;\nthere is no epimorphism Γ(2, 2, 2, 2, 2)→ Cp, so we must have G\u0002D2p = D2(g−1).\nRemark 3·3. Theorem 3·1 has another more elementary proof. Let us start with\nthe sequence of genera in [14] which attain the Accola–Maclachlan bound. These\nhave the form g = 89p + 1, with the prime p satisfying five additional conditions. As\nmentioned earlier, the extremal surfaces of these genera are uniformized by surface\nsubgroups of the (2, 4, 2(g+1)) triangle groups, which are non-arithmetic, so for such\nAutomorphisms of an arithmetic Riemann surface 295\ng we have 4(g−1) \u0003 Nar(g) < N (g) = 8(g+1). There are only finitely many signatures\nσ with μ(2, 4, 2(g + 1)) < μ(σ) < μ(2, 2, 2, 2, 2) which can correspond to arithmetic\ngroups, and so may be considered as candidates for giving a better lower bound for\nNar(g). Using the Riemann–Hurwitz formula one can apply divisibility arguments\nto exclude those signatures which do not have surface subgroups of genus 89p + 1.\nTogether with known information about arithmetic groups of signature (2, 2, 2, n)\n[15, 19] and arithmetic triangle groups [18], this gives the following list of candidates:\n(2, 5, 20), (2, 6, 12), (2, 8, 8), (3, 4, 6), (4, 4, 4), (2, 2, 2, 4), (2, 7, 14), (2, 9, 18), (2, 12, 12),\n(3, 4, 12), (3, 6, 6), (4, 4, 6), (2, 2, 2, 6), (2, 2, 3, 3), (2, 15, 30), (5, 5, 5), (2, 2, 2, 10). Using\na case-by-case argument, one can show if p is a sufficiently large prime then no\ngroup Γ of such a signature can have a normal surface subgroup of genus g = 89p+1.\nIf we also impose the conditions on p given in [14] then we obtain a sequence of\ngenera g for which the arithmetic bound 4(g − 1) is sharp.\nIn this approach one needs only Sylow’s Theorems and some other basic facts about\nfinite groups, but the proof is rather routine and not very straightforward: it is easy\nto handle the signatures with large elliptic periods, but it becomes more complicated\nwhen the periods are small. The most challenging case is when σ = (2, 2, 2, 4). The\nother reason why we prefer our initial proof of Theorem 3·1 will be clear after the\nnext section, where we find the minimal genus for which our bound is attained.\n4. Extremal surfaces\nIn this section we shall first use the proof of Theorem 3·1 to produce a specific\nset of genera g attaining our lower bound for Nar(g). We shall then strengthen the\narguments in order to consider smaller g, and finally determine the least genus for\nwhich Nar(g) = 4(g − 1).\nTo begin with, let us see which signatures actually form the set Σ corresponding\nto the cocompact arithmetic groups Γ with μ(Γ) < π. Firstly, almost all of the\ncocompact arithmetic triangle groups in Takeuchi’s list [18] are contained in Σ.\nSimple calculations show that the other possible signatures are (2, 2, 2, n) for n \u0002 3,\n(2, 2, 3, 3), (2, 2, 3, 4) and (2, 2, 3, 5). The arithmetic groups of signature (2, 2, 2, n) with\nodd n were determined by Maclachlan and Rosenberger [15]. For even n, groups of\nsignature (2, 2, 2, n) have a subgroup of index 2 isomorphic to a (1;n\/2)-group, and\nthe list of arithmetic groups of signature (1;n\/2) was obtained by Takeuchi [19].\nCombining these results we find that only 12 signatures of the form (2, 2, 2, n) yield\narithmetic groups. It is a matter of direct verification whether or not there are\narithmetic groups of the remaining three signatures, but since this does not affect\nour arguments we shall ignore this point and include them in the Table of Signatures\nσ ∈ Σ given at the end of the paper.\nNow inspecting this list Σ of possible signatures, one can use the proof of The-\norem 3·1 to produce specific values of g attaining the lower bound Nar(g) \u0002 4(g − 1).\nFor instance, we see that R = 22 · 3 · 5 · 7, so a prime p is coprime to R provided\np > 7. Inspection also shows that Π = {2, 3, 5, 7}, so p \u0002 Π if and only if p > 7. We\nalso have S = 84, so we need p > 84 for the proof of the Theorem to work (though it\ncan be adapted to apply to certain smaller primes, as we shall see). A standard result\n[7, V·1·11] states that a Riemann surface of genus γ \u0002 2 has no automorphisms of\nprime order greater than 2γ+1, so taking γ = 2 we see that E is divisible only by the\n296 Mikhail Belolipetsky and Gareth A. Jones\nprimes 2, 3 and 5; hence the condition gcd(p− 1, E) = 2 is satisfied by all odd p such\nthat p − 1 is not divisible by 3, 4 or 5, that is, p ≡ 23, 47 or 59 mod (60). It follows\nthat for all such primes p > 84, our bound is attained by g = p + 1. The smallest\nprime in this sequence is p = 107, giving g = 108.\nIf we inspect Σ more closely, and use other group-theoretic techniques in addi-\ntion to Sylow’s Theorems, we can find smaller values of g attaining our bound. The\nbasic idea is that, in order to show that G has a normal Sylow p-subgroup of or-\nder p, we replace the rather crude sufficient condition p > S with a more careful\nanalysis of the possibilities for a group of order ps. We use the fact that (according\nto the Table of Signatures in the Appendix) the largest possible values of s (for\nr = 1) are s = 84, 48, 40, 36, 30, corresponding to the arithmetic groups of sig-\nnatures (2, 3, 7), (2, 3, 8), (2, 4, 5), (2, 3, 9), (2, 3, 10) respectively, followed by s = 24\ncorresponding to (2, 3, 12) and (2, 4, 6), and then s = 21 corresponding to (2, 3, 14).\nExample 4·1. Let p = 59, so g = 60. We follow the proof of Theorem 3·1, amending\nit where necessary for this particular prime p. Since p > 7, p is coprime to R and\nhence |G| = (g − 1)s = 59s. No possible value of s is divisible by 59 (see the Table),\nso a Sylow 59-subgroup P of G has order 59. The number of Sylow 59-subgroups\ndivides s and is congruent to 1 mod (59); this immediately implies that there is only\none such subgroup, so P is normal in G. For the rest of the proof, it is sufficient to\nnote that p = 59 satisfies p \u0002 Π and gcd(p − 1, E) = 2, so g = 60 attains the lower\nbound.\nExample 4·2. Let p = 47. Once again p > 7, p is coprime to R, and |G| = (g−1)s =\n47s. A Sylow 47-subgroup P of G has order 47 since there is no value of s divisible\nby 47. We need to show that P is normal in G, so suppose not. The number n47\nof Sylow 47-subgroups divides s and is congruent to 1 mod (47), so (by inspection)\nn47 = s = 48. This means that P = NG(P ), so G permutes its 48 Sylow 47-subgroups\nby conjugation as a Frobenius group. A theorem of Frobenius [8, V·7·6, V·8·2] implies\nthat G has a normal subgroup N of order 48 (the Frobenius kernel), so Γ has an\nepimorphism onto G\/N\u0002C47. However, s = 48 implies that Γ is the triangle group\nΓ(2, 3, 8), so no such epimorphism exists, and hence P is normal in G. The rest of the\nproof is the same, so the lower bound is attained for g = 48. This method also deals\nwith g = 84, using p = 83 and Γ = Γ(2, 3, 7).\nExample 4·3. Let p = 23. As with p = 47, the only place where the proof of\nTheorem 3·1 fails is that Sylow’s Theorems are not strong enough to prove that\na Sylow 23-subgroup P of G is normal and has order 23. By inspection of Σ, no\npossible value of s is divisible by 23, so |P | = 23. Similarly, if P is not normal, then\nthere must be n23 = 24 Sylow 23-subgroups, with s = 24 or 48, so |G| = 24 · 23\nor 48 · 23. In either case, G permutes its Sylow 23-subgroups by conjugation as a\ntransitive permutation group G˜ of degree 24. In fact, G˜ is doubly transitive, since\nP must have a single orbit of length 23 on the remaining Sylow 23-subgroups: if it\nnormalized a Sylow p-subgroup P ∗ \u0003 P , then PP ∗ would be a subgroup of G of\norder 232. Thus |G˜| is divisible by 24 · 23, and it divides |G|, so |G˜| = 24 · 23 or 48 · 23.\nIn the first case, G˜ is sharply 2-transitive, which is impossible since such groups all\nhave prime-power degree [9, XII·9·1]. In the second case, since a point-stabilizer\nmust act as D23, G˜ is a Zassenhaus group with two-point stabilizers of even order\nAutomorphisms of an arithmetic Riemann surface 297\n(= 2); Zassenhaus showed that such groups of degree n have two-point stabilizers of\norder at least (n−2)\/2 [9, XI·1·10], so this case is also impossible. (Alternatively, the\nclassification of finite simple groups implies that the doubly transitive finite groups\nare all known [6]: those of degree 24 are the symmetric group S24, the alternating\ngroup A24, the Mathieu group M24, the projective general linear group PGL(2, 23),\nand the projective special linear group PSL(2, 23), all of which have order greater\nthan 48 · 23.) Thus P is normal in G, as required, so our lower bound is attained\nfor g = 24. We will now show that this is the least genus for which the bound is\nattained.\nIn [13], Kazaz classified the elementary abelian coverings of the regular hypermaps\nof genus 2. In terms of Fuchsian groups and Riemann surfaces, his results include\nthe following consequences. Suppose that Γ \u0002 Δ \u0002 K where Γ is a triangle group, Δ\nis a normal surface subgroup of genus 2, and K is a normal subgroup of Γ of prime\nindex p in Δ (soK is a surface group of genus g = p+1, and G = Γ\/K \u0003 Aut (H\/K)).\nThen we have the following possibilities for Γ, Q = Γ\/Δ, s = |Q| and p (all of which\noccur):\n(a) Γ = Γ(2, 8, 8), Q = C8, s = 8, p ≡ 1 mod (8) or p = 2;\n(b) Γ = Γ(4, 4, 4), Q = Q8, s = 8, p = 2;\n(c) Γ = Γ(2, 4, 8), Q = SD8, s = 16, p = 2;\n(d) Γ = Γ(5, 5, 5), Q = C5, s = 5, p ≡ 1 mod (5) or p = 5;\n(e) Γ = Γ(2, 5, 10), Q = C10, s = 10, p ≡ 1 mod (5) or p = 5;\n(f) Γ = Γ(3, 6, 6), Q = C6, s = 6, p ≡ 1 mod (6) or p = 3;\n(g) Γ = Γ(2, 6, 6), Q = C6 × C2, s = 12, p ≡ 1 mod (6) or p = 3.\n(Here Q8 is the quaternion group 〈a, b | a4 = 1, a2 = b2, ba = a−1b〉 of order 8, and\nSD8 is the semidihedral group 〈a, b | a8 = b2 = 1, ba = a3b〉 of order 16.)\nThese triangle groups Γ are all arithmetic, so if g = p+1 for any of the above primes\np then Nar(g) \u0002 sp > 4(g− 1). Among the genera g < 24, those covered by this result\nare g = 3, 4, 6, 8, 12, 14, 18 and 20. To show that each odd g = 2m + 1 satisfies\nNar(g) \u0002 6(g − 1), we can use a SKE from Γ = Γ(2, 2, 2, 6) onto S3 ×Dm. This leaves\ng = 2, 10, 16 and 22 among the genera g < 24. A SKE Γ(2, 3, 8) → GL(2, 3) shows\nthat Nar(2) \u0002 48 (in fact, Nar(2) = N (2) = 48). For g = 10 we can use a SKE from\nΓ(2, 2, 2, 4) onto a split extension of C3 × C3 by D4, giving Nar(10) \u0002 72 = 8(g − 1).\nWe see in case (g) that if Γ = Γ(2, 6, 6) then Δ contains normal surface subgroups K3\nand K7 of Γ, of index 3 and 7 in Δ; then K = K3 \u0003K7 is a normal surface subgroup\nof Γ of index 21 in Δ, so Nar(22) \u0002 252 = 12(g−1). Finally, for g = 16 we have a SKE\nfrom Γ(3, 3, 4) onto the alternating group A6, which gives Nar(16) \u0002 24(16− 1).\nWe summarize the results of this section in the following statement:\nTheorem 4·1. For all primes p ≡ 23, 47 or 59 mod (60) we have\nNar(g) = 4(g − 1),\nwhere g = p + 1. The least genus g for which Nar(g) = 4(g − 1) is g = 24.\n298 Mikhail Belolipetsky and Gareth A. Jones\nAcknowledgements. The authors would like to thank A. D. Mednykh for suggesting\nthis problem, and C. Maclachlan for some very helpful discussions.\nAppendix. Table of signatures σ ∈ Σ\nσ μ(Γ) s\/r σ μ(Γ) s\/r\n(2,3,7) π\/21 84 (3,3,4) π\/6 24\n(2,3,8) π\/12 48 (3,3,5) 4π\/15 15\n(2,3,9) π\/9 36 (3,3,6) π\/3 12\n(2,3,10) 2π\/15 30 (3,3,7) 8π\/21 21\/2\n(2,3,11) 5π\/33 132\/5 (3,3,8) 5π\/12 48\/5\n(2,3,12) π\/6 24 (3,3,9) 4π\/9 9\n(2,3,14) 4π\/21 21 (3,3,12) π\/2 8\n(2,3,16) 5π\/24 96\/5 (3,3,15) 8π\/15 15\/2\n(2,3,18) 2π\/9 18 (3,4,4) π\/3 12\n(2,3,24) π\/4 16 (3,4,6) π\/2 8\n(2,3,30) 4π\/15 15 (3,4,12) 2π\/3 6\n(2,4,5) π\/10 40 (3,5,5) 8π\/15 15\/2\n(2,4,6) π\/6 24 (3,6,6) 2π\/3 6\n(2,4,7) 3π\/14 56\/3 (3,6,18) 8π\/9 9\/2\n(2,4,8) π\/4 16 (3,8,8) 5π\/6 24\/5\n(2,4,10) 3π\/10 40\/3 (4,4,4) π\/2 8\n(2,4,12) π\/3 12 (4,4,5) 3π\/5 20\/3\n(2,4,18) 7π\/18 72\/7 (4,4,6) 2π\/3 6\n(2,5,5) π\/5 20 (4,4,9) 7π\/9 36\/7\n(2,5,6) 4π\/15 15 (4,5,5) 7π\/10 40\/7\n(2,5,8) 7π\/20 80\/7 (4,6,6) 5π\/6 24\/5\n(2,5,10) 2π\/5 10 (5,5,5) 4π\/5 5\n(2,5,20) π\/2 8 (2,2,2,3) π\/3 12\n(2,5,30) 8π\/15 15\/2 (2,2,2,4) π\/2 8\n(2,6,6) π\/3 12 (2,2,2,5) 3π\/5 20\/3\n(2,6,8) 5π\/12 48\/5 (2,2,2,6) 2π\/3 6\n(2,6,12) π\/2 8 (2,2,2,7) 5π\/7 28\/5\n(2,7,7) 3π\/7 28\/3 (2,2,2,8) 3π\/4 16\/3\n(2,7,14) 4π\/7 7 (2,2,2,9) 7π\/9 36\/7\n(2,8,8) π\/2 8 (2,2,2,10) 4π\/5 5\n(2,8,16) 5π\/8 32\/5 (2,2,2,12) 5π\/6 24\/5\n(2,9,18) 2π\/3 6 (2,2,2,14) 6π\/7 14\/3\n(2,10,10) 3π\/5 20\/3 (2,2,2,18) 8π\/9 9\/2\n(2,12,12) 2π\/3 6 (2,2,2,22) 10π\/11 22\/5\n(2,12,24) 3π\/4 16\/3 (2,2,3,3) 2π\/3 6\n(2,15,30) 4π\/5 5 (2,2,3,4) 5π\/6 24\/5\n(2,18,18) 7π\/9 36\/7 (2,2,3,5) 14π\/15 30\/7\nREFERENCES\n[1] R. D. Accola. On the number of automorphisms of a closed Riemann surface.\nTrans. Amer. Math. Soc. 131 (1968), 398–408.\n[2] R. D. Accola. Topics in the Theory of Riemann Surfaces. Lecture Notes in Math. 1595\n(Springer-Verlag, 1994).\n[3] M. Belolipetsky. On the number of automorphisms of a nonarithmetic Riemann surface.\nSiberian Math. J. 38 (1997), 860–867.\n[4] A. Borel. Commensurability classes and volumes of hyperbolic 3-manifolds. Ann. Scuola\nNorm. Sup. Pisa Cl. Sci. (4) 8 (1981), 1–33.\n[5] M. D. E. Conder and R. Kulkarni. Infinite families of automorphism groups of Riemann\nsurfaces. In Groups and Geometry (eds. C. Maclachlan and W. J. Harvey), pp. 47–56.\nLondon Math. Soc. Lect. Note Ser. 173 (Cambridge University Press, 1992).\nAutomorphisms of an arithmetic Riemann surface 299\n[6] J. D. Dixon andB. Mortimer. Finite Permutation Groups. Grad. Texts in Math. 163 (Springer-\nVerlag, 1996).\n[7] H. M. Farkas and I. Kra. Riemann Surfaces. Grad. Texts in Math. 71 (Springer-Verlag,\n1980).\n[8] B. Huppert. Endliche Gruppen I (Springer-Verlag, 1967).\n[9] B. Huppert and N. Blackburn. Finite Groups III (Springer-Verlag, 1982).\n[10] A. Hurwitz. U¨ber algebraische Gebilde mit eindeutige Transformationen in sich. Math. Ann.\n41 (1893), 403–442.\n[11] G. A. Jones and D. Singerman. Complex Function Theory: an Algebraic and Geometric View-\npoint (Cambridge University Press, 1987).\n[12] S. Katok. Fuchsian Groups (University of Chicago Press, 1992).\n[13] M. Kazaz. Finite Groups and Surface Coverings. Ph.D. thesis. University of Southampton\n(1997).\n[14] C. Maclachlan. A bound for the number of automorphisms of a compact Riemann surface.\nJ. London Math. Soc. 44 (1968), 265–272.\n[15] C. Maclachlan and G. Rosenberger. Two-generator arithmetic Fuchsian groups, II.\nMath. Proc. Camb. Phil. Soc. 111 (1992), 7–24.\n[16] C.-H. Sah. Groups related to compact Riemann surfaces. Acta Math. 123 (1969), 13–42.\n[17] H. A. Schwarz. Ueber diejenigen algebraischen Gleichungen zwischen zwei ver-a¨nderlichen\nGro¨ssen, welche eine Schaar rationaler, eindeutig umkehrbarer Transformationen in sich\nselbst zulassen. J. Reine Angew. Math. 87, 139–145; Ges. Math. Abh. II, pp. 285–291 (1890,\nreprinted Chelsea, 1972).\n[18] K. Takeuchi. Arithmetic triangle groups. J. Math. Soc. Japan 29 (1977), 91–106.\n[19] K. Takeuchi.Arithmetic Fuchsian groups with signature (1; e). J. Math. Soc. Japan 35 (1983),\n381–407.\n[20] M.-F. Vigne´ras. Arithme´tique des Alge`bres de Quaternions. Lecture Notes in Math. 800\n(Springer-Verlag, 1980).\n"}