{"doi":"10.5194\/angeo-28-1659-2010","coreId":"55860","oai":"oai:nora.nerc.ac.uk:11064","identifiers":["oai:nora.nerc.ac.uk:11064","10.5194\/angeo-28-1659-2010"],"title":"Estimating the location of the open-closed magnetic field line boundary from auroral images","authors":["Longden, Nicola","Chisham, Gareth","Freeman, Mervyn P.","Abel, Gary A.","Sotirelis, Tom"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-09-10","abstract":"The open-closed magnetic field line boundary (OCB) delimits the region of open magnetic flux forming the polar cap in the Earth’s ionosphere. We present a reliable, automated method for determining the location of the poleward auroral luminosity boundary (PALB) from far ultraviolet (FUV) images of the aurora, which we use as a proxy for the OCB. This technique models latitudinal profiles of auroral luminosity as both a single and double Gaussian function with a quadratic background to produce estimates of the PALB without prior knowledge of the level of auroral activity\\ud\nor of the presence of bifurcation in the auroral oval. We\\ud\nhave applied this technique to FUV images recorded by the\\ud\nIMAGE satellite from May 2000 until August 2002 to produce\\ud\na database of over a million PALB location estimates,\\ud\nwhich is freely available to download. From this database,\\ud\nwe assess and illustrate the accuracy and reliability of this technique during varying geomagnetic conditions. We find that up to 35% of our PALB estimates are made from double Gaussian fits to latitudinal intensity profiles, in preference to single Gaussian fits, in nightside magnetic local time (MLT) sectors. The accuracy of our PALBs as a proxy for the location of the OCB is evaluated by comparison with particle precipitation boundary (PPB) proxies from the DMSP satellites. We demonstrate the value of this technique in estimating the total rate of magnetic reconnection from the time variation of the polar cap area calculated from our OCB estimates","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/55860.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/11064\/1\/angeo-28-1659-2010.pdf","pdfHashValue":"e82dca92096b56579aa9a4625ddea0b9d60f7fbe","publisher":"Copernicus","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:11064<\/identifier><datestamp>\n      2012-11-22T12:13:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533234<\/setSpec><setSpec>\n      7375626A656374733D5334<\/setSpec><setSpec>\n      7375626A656374733D533235<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/11064\/<\/dc:relation><dc:title>\n        Estimating the location of the open-closed magnetic field line boundary from auroral images<\/dc:title><dc:creator>\n        Longden, Nicola<\/dc:creator><dc:creator>\n        Chisham, Gareth<\/dc:creator><dc:creator>\n        Freeman, Mervyn P.<\/dc:creator><dc:creator>\n        Abel, Gary A.<\/dc:creator><dc:creator>\n        Sotirelis, Tom<\/dc:creator><dc:subject>\n        Physics<\/dc:subject><dc:subject>\n        Atmospheric Sciences<\/dc:subject><dc:subject>\n        Space Sciences<\/dc:subject><dc:description>\n        The open-closed magnetic field line boundary (OCB) delimits the region of open magnetic flux forming the polar cap in the Earth’s ionosphere. We present a reliable, automated method for determining the location of the poleward auroral luminosity boundary (PALB) from far ultraviolet (FUV) images of the aurora, which we use as a proxy for the OCB. This technique models latitudinal profiles of auroral luminosity as both a single and double Gaussian function with a quadratic background to produce estimates of the PALB without prior knowledge of the level of auroral activity\\ud\nor of the presence of bifurcation in the auroral oval. We\\ud\nhave applied this technique to FUV images recorded by the\\ud\nIMAGE satellite from May 2000 until August 2002 to produce\\ud\na database of over a million PALB location estimates,\\ud\nwhich is freely available to download. From this database,\\ud\nwe assess and illustrate the accuracy and reliability of this technique during varying geomagnetic conditions. We find that up to 35% of our PALB estimates are made from double Gaussian fits to latitudinal intensity profiles, in preference to single Gaussian fits, in nightside magnetic local time (MLT) sectors. The accuracy of our PALBs as a proxy for the location of the OCB is evaluated by comparison with particle precipitation boundary (PPB) proxies from the DMSP satellites. We demonstrate the value of this technique in estimating the total rate of magnetic reconnection from the time variation of the polar cap area calculated from our OCB estimates.<\/dc:description><dc:publisher>\n        Copernicus<\/dc:publisher><dc:date>\n        2010-09-10<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/11064\/1\/angeo-28-1659-2010.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Longden, Nicola; Chisham, Gareth; Freeman, Mervyn P.; Abel, Gary A.; Sotirelis, Tom.  2010  Estimating the location of the open-closed magnetic field line boundary from auroral images.   Annales Geophysicae, 28 (9). 1659-1678.  https:\/\/doi.org\/10.5194\/angeo-28-1659-2010 <https:\/\/doi.org\/10.5194\/angeo-28-1659-2010>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.ann-geophys.net\/28\/1659\/2010\/angeo-28-1659-2010.html<\/dc:relation><dc:relation>\n        10.5194\/angeo-28-1659-2010<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/11064\/","http:\/\/www.ann-geophys.net\/28\/1659\/2010\/angeo-28-1659-2010.html","10.5194\/angeo-28-1659-2010"],"year":2010,"topics":["Physics","Atmospheric Sciences","Space Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Ann. Geophys., 28, 1659–1678, 2010\nwww.ann-geophys.net\/28\/1659\/2010\/\ndoi:10.5194\/angeo-28-1659-2010\n© Author(s) 2010. CC Attribution 3.0 License.\nAnnales\nGeophysicae\nEstimating the location of the open-closed magnetic field line\nboundary from auroral images\nN. Longden1, G. Chisham1, M. P. Freeman1, G. A. Abel1, and T. Sotirelis2\n1British Antarctic Survey, High Cross, Madingley Road, Cambridge, CB3 0ET, UK\n2The Johns Hopkins University, Applied Physics Laboratory, Laurel, MD 20723, USA\nReceived: 12 March 2010 – Revised: 7 July 2010 – Accepted: 27 August 2010 – Published: 10 September 2010\nAbstract. The open-closed magnetic field line boundary\n(OCB) delimits the region of open magnetic flux forming the\npolar cap in the Earth’s ionosphere. We present a reliable,\nautomated method for determining the location of the pole-\nward auroral luminosity boundary (PALB) from far ultravio-\nlet (FUV) images of the aurora, which we use as a proxy for\nthe OCB. This technique models latitudinal profiles of au-\nroral luminosity as both a single and double Gaussian func-\ntion with a quadratic background to produce estimates of the\nPALB without prior knowledge of the level of auroral activ-\nity or of the presence of bifurcation in the auroral oval. We\nhave applied this technique to FUV images recorded by the\nIMAGE satellite from May 2000 until August 2002 to pro-\nduce a database of over a million PALB location estimates,\nwhich is freely available to download. From this database,\nwe assess and illustrate the accuracy and reliability of this\ntechnique during varying geomagnetic conditions. We find\nthat up to 35% of our PALB estimates are made from double\nGaussian fits to latitudinal intensity profiles, in preference to\nsingle Gaussian fits, in nightside magnetic local time (MLT)\nsectors. The accuracy of our PALBs as a proxy for the loca-\ntion of the OCB is evaluated by comparison with particle pre-\ncipitation boundary (PPB) proxies from the DMSP satellites.\nWe demonstrate the value of this technique in estimating the\ntotal rate of magnetic reconnection from the time variation of\nthe polar cap area calculated from our OCB estimates.\nKeywords. Magnetospheric physics (Auroral phenomena;\nMagnetospheric configuration and dynamics; Instruments\nand techniques)\nCorrespondence to: N. Longden\n(nilo@bas.ac.uk)\n1 Introduction\nThe polar cap is the ionospheric footprint of the region of\nopen magnetic flux in the Earth’s magnetosphere, i.e., those\nmagnetic field lines that attach both to the Earth and to the in-\nterplanetary magnetic field (IMF). The interface between the\nopen field lines of the polar cap and the closed field lines\nof the auroral zone of the ionosphere is termed the open-\nclosed boundary (OCB). Changes in the area of the polar\ncap are linked to magnetic reconnection, with the addition\nof open flux as a result of reconnection between the geo-\nmagnetic field lines and IMF on the dayside and the closure\nof flux on the nightside in the magnetotail (e.g., Siscoe and\nHuang, 1985; Brittnacher et al., 1999). Hence, the rate of\nchange of polar cap area (PCA) can be used as a proxy for\nthe total net rate of magnetic reconnection (e.g., Milan et al.,\n2003; Chisham et al., 2008). Also, the local rate of recon-\nnection and its spatial variability can be determined wherever\nthe OCB location is known and measurements of ionospheric\nplasma flow across it exist, allowing a local estimation of the\nrate of flux transfer between open and closed field line re-\ngions (e.g., Pinnock et al., 2003; Chisham et al., 2004; Hu-\nbert et al., 2006; Chisham et al., 2008). Therefore, accurate\ndetermination of the OCB location is a prerequisite to esti-\nmation of the rate of reconnection.\nThe location of the OCB can be best estimated from mea-\nsurements of particle precipitation boundaries (PPB) made\nby satellites in low-altitude orbits (e.g., Vampola, 1971;\nMakita et al., 1983; Makita and Meng, 1984; Newell et al.,\n1991; Mishin et al., 1992; Newell et al., 1996; Sotirelis\nand Newell, 2000). However, whilst these PPBs are con-\nsidered to provide the best proxy of the OCB, they typi-\ncally provide only infrequent, point measurements of this\nboundary. Many other instruments have been used to pro-\nvide estimates of the location of the OCB with higher\nPublished by Copernicus Publications on behalf of the European Geosciences Union.\n1660 N. Longden et al.: Estimating the OCB\nspatial and temporal coverage. These include HF radars\n(e.g., Baker et al., 1995, 1997; Milan et al., 1999; Milan\nand Lester, 2001; Chisham et al., 2001, 2002; Chisham and\nFreeman, 2003), ground-based magnetometers (e.g., Iijima\nand Potemra, 1978; Mishin, 1990), all-sky cameras (e.g.,\nAkasofu and Kimball, 1965; Feldstein and Galperin, 1985),\nmeridian scanning photometers (e.g., Blanchard et al., 1995;\nSandholt et al., 1998), and satellite-based imagers (e.g., Brit-\ntnacher et al., 1999; Kauristie et al., 1999; Baker et al., 2000;\nCarbary et al., 2003; Boakes et al., 2008). Arguably the best\ninstrument to estimate the location of the complete OCB (in\na single hemisphere) is the satellite-based imager, which can\nimage the whole auroral oval at a time resolution of the order\nof minutes, for hours at a time (see e.g., Boakes et al., 2008).\nSince the earliest auroral imager observations, a number of\ndifferent techniques have been used to estimate the poleward\nboundary of auroral luminosity, thought to provide a good\nproxy for the location of the OCB. These techniques have in-\ncluded visual inspection (e.g., Elphinstone et al., 1990; Gjer-\nloev et al., 2007), identifying a return to a threshold of low\nauroral luminosity poleward of the main emission (e.g., Brit-\ntnacher et al., 1999; Baker et al., 2000), identifying a return\nto a fraction of the peak intensity on the poleward edge of the\nmain emission (e.g., Kauristie et al., 1999; Baker et al., 2000;\nCarbary et al., 2003; Boakes et al., 2008), and identifying a\nreturn to an intensity threshold relative to background inten-\nsity levels (e.g., Mende et al., 2003; Gjerloev et al., 2008).\nCarbary et al. (2003) estimated over 23 000 poleward auro-\nral luminosity boundaries (PALB) from images recorded by\nthe ultraviolet imager (UVI) on the Polar satellite, by mod-\nelling latitudinal profiles of auroral luminosity intensity as a\nGaussian function superimposed on a quadratic background.\nThis method assumes that the auroral oval is characterised by\na single, contiguous band of emission across magnetic lati-\ntudes, for all magnetic local time (MLT) sectors, at all times.\nDuring substorm recovery, the auroral oval often exhibits a\n“double oval” configuration with a main oval and a poleward\narc of emission (Elphinstone et al., 1995a,b). Gjerloev et al.\n(2008) have confirmed the configuration of a bifurcated auro-\nral oval in UV images during substorm activity through a su-\nperposed epoch analysis of 116 isolated substorms. A func-\ntion with two Gaussian components has been used to model\nlatitudinal profiles of auroral intensity during substorm ac-\ntivity when bifurcation may be present in the oval (Gjerloev\net al., 2008; Mende et al., 2003). Gjerloev et al. (2008) con-\nsider the Gaussian peaks representing the main oval and the\nbulge of the poleward emission to be quasi-independent phe-\nnomena, arising from bifurcation in the particle precipitation\nor energisation regions in the magnetosphere. When a dou-\nble oval configuration exists, the poleward arc maps close to\nthe OCB, at least in the nightside ionosphere (Elphinstone\net al., 1995a). Accurate modelling of the auroral luminos-\nity intensity profile during a double oval configuration is re-\nquired for the best estimation of the OCB location, partic-\nularly during substorm recovery when this configuration is\nprevalent (Elphinstone et al., 1995b), although substorms oc-\ncurring during ongoing geomagnetic activity do not always\nexhibit the classical evolution of isolated substorms with au-\nroral bifurcation (Hoffman et al., 2010).\nThe accuracy of the PALB as a proxy for the OCB has been\nevaluated by comparison with satellite determined PPBs\n(e.g., Kauristie et al., 1999; Baker et al., 2000; Carbary et al.,\n2003; Boakes et al., 2008). These studies have highlighted\nsystematic differences between the locations of the PPBs and\nPALBs and that this discrepancy varies with MLT. The com-\nparative studies of Kauristie et al. (1999), Baker et al. (2000),\nand Carbary et al. (2003) estimated PALBs from a single ul-\ntraviolet imager based on either the Viking or Polar satel-\nlite. Boakes et al. (2008) estimated PALBs from FUV images\nrecorded by the IMAGE satellite. The IMAGE FUV instru-\nment has three detectors enabling the discrimination between\nauroral emissions resulting from proton and electron precip-\nitation. Boakes et al. (2008) showed that the PALBs derived\nfrom the FUV detector that is sensitive to proton emissions\nwere more poleward than those derived from the detectors\nthat are sensitive to electron emissions in pre-dawn MLT sec-\ntors, and were located equatorward during the dusk to pre-\nmidnight MLT sectors. Boakes et al. (2008) were able to\nimprove the correlation between PPBs and PALBs in some\nMLT sectors by selecting boundaries from the most appro-\npriate FUV detector for that sector, for example, selecting\nboundaries from the detector sensitive to proton emission\nfrom 01:00 to 07:00 MLT.\nIn this paper, we present an automated method to esti-\nmate poleward and equatorward auroral luminosity bound-\naries (EALB) from IMAGE FUV images and show how to\ncorrect the PALBs for use as a proxy for the OCB. Our tech-\nnique brings together the strengths of various other methods.\nWe present analysis of a database of over 1 million PALB\nlocation estimates derived from IMAGE FUV images us-\ning this technique, and demonstrate how satellite-measured\nPPBs can be used to improve the accuracy of these bound-\naries as a proxy for the OCB. The OCB location estimates\ncan be used to compile an extensive set of reconnection rate\nestimations, enabling further analysis of this fundamental\nphysical process.\n2 Instrumentation\n2.1 IMAGE FUV\nThe IMAGE FUV instrument is comprised of three detec-\ntors; the Wideband Imaging Camera (WIC) and two Spec-\ntrographic Imagers (SI12 and SI13) (Mende et al., 2000b).\nThe WIC sensor has a passband of 140 to 190 nm, observing\nemissions from the N2 Lyman-Birge-Hopfield band (Mende\net al., 2000a,b). The SI12 detector is sensitive to Doppler-\nshifted Lyman-α emissions in the 121.8 nm band, caused\nby proton precipitation (Mende et al., 2000b,c). The SI13\ndetector is sensitive to the 135.6 nm oxygen emission band\nAnn. Geophys., 28, 1659–1678, 2010 www.ann-geophys.net\/28\/1659\/2010\/\nN. Longden et al.: Estimating the OCB 1661\nresulting from energetic electron precipitation (Mende et al.,\n2000b,c). FUV images are recorded with a time resolution\nof two minutes, determined by the spin period of the satellite\n(e.g., Burch, 2000). Both SI detectors produce images with\na 128× 128 pixel resolution while the WIC detector has a\nresolution of 256×256 pixels (Mende et al., 2000b). During\nits operation (years 2000 to 2005), the IMAGE satellite was\nin an elliptical orbit at 90◦ inclination with an altitude of 7\nEarth radii (RE) at apogee and 1000 km at perigee, and with\nan orbital period of 13.5 h (e.g., Burch, 2000; Gibson et al.,\n2000; Mende et al., 2000b). IMAGE FUV data are available\nfrom May 2000 until December 2005. We use the two years\nof data from the start of the mission until August 2002, while\nthe satellite apogee is close to the north pole (e.g., Frey and\nMende, 2006). Some inaccuracy exists in the pointing infor-\nmation of the IMAGE satellite, with systematic errors of up\nto 4 pixels in the spin axis plane and 2 pixels perpendicular\nto the spin plane (e.g., Frey et al., 2004; Frey and Mende,\n2006). According to Frey et al. (2004), this pointing error\ncan increase the positional uncertainty of local time determi-\nnation during summer and winter periods and uncertainty in\nlatitude determination during the spring and autumn.\n2.2 DMSP\nPPBs are taken from the SSJ\/4 precipitating electron and ion\nspectrometer instruments onboard the low-altitude Defense\nMeteorological Satellites Program (DMSP) satellites. The\nDMSP satellites are located in a sun-synchronous polar or-\nbit at an altitude of around 830 km. Their orbital period is\n101 min. The SSJ\/4 particle detectors cover an energy range\nof 30 eV to 30 keV across twenty channels (Hardy et al.,\n1984). During the period of May 2000 until December 2001,\nsatellites DMSP 11 to 15 were in operation. The algorithm\nused for automated identification of nightside PPBs from\nthe DMSP energy spectra is detailed in Newell et al. (1996)\nwhile the algorithm to determine dayside PPBs is outlined in\nSotirelis and Newell (2000), based on Newell et al. (1991).\nWe use the b6 boundary representing the poleward edge of\nsubvisual drizzle as the proxy for the OCB in nightside MLT\nsectors and the doc boundary, representing a transition from\nclosed to open precipitation regions, in dayside MLT sec-\ntors. We refer to the nightside b6 boundary and the dayside\ndoc boundary, derived from DMSP data, collectively as pole-\nward auroral precipitation boundaries (PAPB). Where multi-\nple crossings of the same magnetospheric region are identi-\nfied in a single pass of the satellite, the most poleward bound-\nary for each region is selected, and where clear transitions\nbetween precipitation regions cannot be made, PPBs are dis-\ncarded (Sotirelis and Newell, 2000). Consequently regions\nvoid of particle precipitation equatorward of closed regions\nare considered to also be closed. Alternative classification\nschemes could be used but authors differ on the physical in-\nterpretation of spatially-separated void regions (Brittnacher\net al., 1999). Due to the satellite orbit, Northern Hemi-\nsphere auroral boundaries are only available in the 05:00 to\n22:00 MLT sectors during the time period under considera-\ntion.\n3 Boundary location technique\n3.1 Boundary derivation\nIn order to estimate the location of the auroral luminos-\nity boundaries, we first determine latitudinal profiles of\nFUV intensity for each image from WIC, SI12 and SI13.\nThe geomagnetic coordinates of the FUV images are trans-\nformed to altitude-adjusted corrected geomagnetic coordi-\nnates (AACGM, Baker and Wing, 1989), with an effective\nemission altitude of 130 km, for consistency with the mag-\nnetic coordinate system used for DMSP data. For each im-\nage, 24 latitudinal emission intensity profiles are constructed\nby averaging available emission intensities in bins of 1◦ mag-\nnetic latitude and 1 h of MLT. The luminosity intensity pro-\nfiles are created covering the 50◦ to 90◦ AACGM latitude\nrange (where satellite coverage is available).\nTwo functions are fit to each latitudinal profile; a sin-\ngle Gaussian function with a quadratic component (Eq. 1)\nand a double Gaussian function with a quadratic component\n(Eq. 2),\nFs(λ)=A0exp\n[\n− (λ−µ0)\n2\n2σ 20\n]\n+B+Cλ+Dλ2 (1)\nFd(λ) = Aeexp\n[\n− (λ−µe)\n2\n2σ 2e\n]\n+\nApexp\n[\n− (λ−µp)\n2\n2σ 2p\n]\n+E+Fλ+Gλ2 (2)\nwhere λ is the magnetic latitude. In Eq. (1), A0, µ0, and\nσ0 are the peak amplitude, peak latitude, and width of the\nGaussian, respectively, and B, C, and D, are the coefficients\nof the quadratic background of the function. In Eq. (2), Ae,\nµe, and σe are the coefficients of the most equatorward of\nthe two Gaussian components of the function, while Ap, µp,\nand σp are the coefficients of the most poleward of the two\nGaussian components. E, F , and G are coefficients of the\nquadratic background of the function. In both cases, the\nGaussian components of the function attempt to categorise\nauroral emissions while the quadratic components represent\nthe background emissions. Carbary et al. (2003) and Boakes\net al. (2008) also fit a function of the form of Eq. (1) to lat-\nitudinal intensity profiles in order to derive estimates for the\nlocation of the PALB while Mende et al. (2003) fit a function\nsimilar to Eq. (2) for this purpose.\nWIC and SI13 images can be susceptible to contamination\nby dayglow in the FUV spectrum (e.g. Boakes et al., 2008;\nHubert et al., 2006). Dayglow emission is generated by in-\ncident solar radiation on the atmosphere and is dependent\nwww.ann-geophys.net\/28\/1659\/2010\/ Ann. Geophys., 28, 1659–1678, 2010\n1662 N. Longden et al.: Estimating the OCB\non the solar zenith angle, with the greatest dayglow emis-\nsion observable at the subsolar point (e.g., Meier, 1991, and\nreferences therein). When present, dayglow can be seen in\nlatitudinal luminosity intensity profiles as very high intensity\nat the lowest magnetic latitudes, rapidly decreasing towards\nhigher latitudes. Dayglow can be modelled by the quadratic\nbackground of the functions Fs(λ) and Fd(λ) (Carbary et al.,\n2003). However, during fitting, sometimes a Gaussian com-\nponent of the functions will be fit to the dayglow in prefer-\nence to the auroral emission (e.g., Boakes et al., 2008). In\nthis case, the resulting PALB will be incorrectly located and\nshould not be used as an estimate for the OCB.\nWe attempt to enforce the fitting of the Gaussian compo-\nnents of our models to the auroral emissions rather than the\ndayglow by constraining the lower limit of dayside luminos-\nity intensity profiles (i.e., those in the 06:00 to 18:00 MLT\nsectors). Hence, we search the intensity profile to find the\nmost equatorward local minimum in the 50◦ to 90◦ AACGM\nrange to locate the latitude at which auroral emissions exceed\nthe background. We then attempt to fit Eqs. (1) and (2) to the\nintensity profile from the latitude of this local minimum up\nto 90◦. When a local minimum cannot be found, no attempt\nat fitting is made for that profile and no auroral luminosity\nboundary estimates are made. As the intensity profiles are\ntypically noisy, we smooth the profiles using a boxcar slid-\ning average and find the location of the local minima from the\nsmoothed profiles. For intensity profiles derived from WIC\nimages, a width of three points is used in the sliding aver-\nage. A width of seven points is used for intensity profiles de-\nrived from SI13 images due to the lower resolution and count\nnumbers of these images. The fits are subsequently made\nto the original, unsmoothed, intensity profiles. No dayglow\nremoval is performed for intensity profiles covering night-\nside MLTs and those obtained from SI12 images at all local\ntimes, as these images are much less susceptible to dayglow\ncontamination (e.g. Boakes et al., 2008; Hubert et al., 2006).\nTechniques do exist to pre-process FUV images in an attempt\nto completely remove dayglow by using an empirical refer-\nence model of dayglow emission from FUV images obtained\nduring quiet conditions that can then be used to characterise\ndayglow in other images (Immel et al., 2000). While this\ntechnique has been applied to IMAGE FUV images (e.g.,\nMeurant et al., 2003; DeJong et al., 2007), there is an im-\npact on the extent of automation that can be achieved in the\nselection of appropriate quiet time images and a dependence\nbetween images is introduced. Some uncertainty is also in-\ntroduced through the accuracy of the reference model in rep-\nresenting the actual dayglow in each specific image. Hence,\nfor our purposes our basic dayglow mitigation method pro-\nvides the best solution.\nThe Levenberg-Marquardt method for nonlinear least-\nsquares fitting, adapted from Press et al. (1992), is used to\nfit the functions Fs(λ) and Fd(λ) to each latitudinal lumi-\nnosity intensity profile. Prior to fitting, initial values for\nthe function parameters are estimated from the intensity pro-\nfile. Specifically, the quadratic coefficients D and G are ini-\ntially set to zero and initial estimates for the constant (i.e.,\nB and E) and linear (i.e., C and F ) coefficients are obtained\nby performing a linear least-squares fit to the intensity pro-\nfile. The background intensity components with these initial\nvalues are subtracted from the intensity profile to produce an\nestimate for the auroral emissions. The location and mag-\nnitude of the one (or two) maxima in this derived auroral\nemission profile are selected as the initial estimates for the\ncentre (µ) and amplitude (A) of the Gaussian component(s)\nof Fs(λ) (or Fd(λ)). Initial estimates for the widths (σ ) of\nthe Gaussian components of Fs(λ) and Fd(λ) are made from\nestimates of the corresponding full width at half maximum\n(FWHM), where FWHM= 2√2ln(2)σ . The FWHM is es-\ntimated for each peak by calculating the distance between\nthe points where the intensity has fallen to one half of the\npeak value on both sides of the peak. When a local minimum\nin a profile is found prior to the half maximum value being\nreached, the FWHM is estimated to this turning point.\nOnce estimates have been made for the function parame-\nters, the Levenberg-Marquardt fit is iterated until either im-\nprovements in the fitting are negligible in successive iter-\nations or a set maximum number of iterations is reached.\nWe consider improvements in fitting between iterations to\nbe negligible when the value of the reduced chi-squared\ngoodness-of-fit statistic (χ2\/ν, where ν is the degrees of\nfreedom) reduces by less than 0.01 between successive it-\nerations. We define the maximum number of iterations to\nbe 200 as more than 97% of fits showing convergence have\nachieved full convergence to the optimum solution by this\npoint. During fitting, we prevent the parameters relating to\nthe Gaussian coefficients from becoming negative between\nsuccessive iterations by inverting the sign of a negative in-\ncrement that would move the parameter value below zero.\nThis prevents the fitting of an inverted Gaussian profile to\nrepresent the separation of emission in a bifurcated intensity\nprofile, for example.\nThe parameters returned by the final fitting iteration are\nused to estimate the EALB (λe) and PALB (λp). Following\nCarbary et al. (2003), we use the FWHM of the fitted Gaus-\nsian peaks offset from the centre of the peak, i.e.,\nλe = µe−2\n√\n2ln(2)σe (3)\nλp = µp+2\n√\n2ln(2)σp (4)\nwhere µe =µp =µ0 and σe = σp = σ0 for a single Gaussian\nprofile. Uncertainties in the boundary locations can be de-\nrived according to Eq. (5),\nUλ=\n√(\n∂λ\n∂µ\nUµ\n)2\n+\n(\n∂λ\n∂σ\nUσ\n)2\n+2 ∂λ\n∂µ\n∂λ\n∂σ\nU2µσ (5)\nwhere Uµ and Uσ are the uncertainties of the mean and\nwidth of the fitted Gaussian peaks and Uµσ is the covari-\nance of these two parameters, which are derived as part of\nthe Levenberg-Marquardt fitting.\nAnn. Geophys., 28, 1659–1678, 2010 www.ann-geophys.net\/28\/1659\/2010\/\nN. Longden et al.: Estimating the OCB 1663\n3.2 Evaluation of the success of the fitting and boundary\nlocation\nThe coefficients of each fit and the estimated boundaries are\nchecked against a number of criteria to remove auroral lumi-\nnosity boundaries arising from the results of poor fitting to\nbad or noisy data. These criteria are based on those specified\nby Carbary et al. (2003) but have been adjusted and tested for\nuse with IMAGE FUV data. The criteria used here are:\n1. The Gaussian amplitude(s) A must be greater than zero.\n2. The Gaussian centre(s) µ must fall within the AACGM\nlatitude range of the given intensity profile.\n3. The Gaussian amplitude(s) A must be at least 10%\nof the amplitude of the background FUV intensity at\nthe location of the centre of that Gaussian peak (i.e.,\nB+Cµ+Dµ2 or E+Fµ+Gµ2). In the case of the\nfitted double Gaussian, the amplitude of the secondary\npeak also must be at least 20% of the amplitude of the\nprimary peak.\n4. The Gaussian width(s) σ must exceed the bin width of\nthe intensity profile, i.e., 1◦, but must not exceed the\nAACGM latitude range of the intensity profile.\n5. The derived PALB λp must fall within the range of the\nlowest latitude covered by the intensity profile and 90◦\nAACGM latitude.\nAdditional criteria based on measures of goodness-of-fit or\nuncertainty can be used to determine whether an auroral lu-\nminosity boundary estimation should be considered a suc-\ncess. Thresholds for χ2\/ν or standard error can be varied to\nmaximise either the number of estimates or to minimise the\nuncertainty in estimates, for example. We have used the con-\nstraint that the χ2\/ν value must be below 10.0 for a fit to be\nconsidered successful. We also require that the uncertainty\non the poleward and equatorward boundaries derived from\nWIC images must not exceed 1◦ (2◦ for boundaries derived\nfrom SI12 and SI13 images). The threshold for the equator-\nward boundary uncertainty is included as an indication of the\noverall precision of the fit. When fitting a single Gaussian\nfunction, the uncertainty on the poleward and equatorward\nboundaries will be the same.\nThe χ2\/ν statistic is also used to determine the most ap-\npropriate auroral luminosity boundary estimates when the fits\nof both the single Gaussian and double Gaussian function to\na given latitudinal intensity profile pass all of the criteria.\nThe fit with the lowest χ2\/ν value is selected as the more ap-\npropriate fit to the data and the corresponding λe and λp are\nretained. The degrees of freedom (ν) of a fit to an intensity\nprofile is simply the number of magnetic latitude bins in that\nprofile minus the number of parameters used to specify the\nfunction for the fit. Hence, the ν for a single Gaussian fit to a\nlatitudinal profile will be higher than that for a double Gaus-\nsian fit to the same profile as 6 parameters are used to specify\nthe single Gaussian function rather than the 9 parameters of\nthe double Gaussian function. This means that should the fits\nof the single and double Gaussian functions have an almost\nidentical χ2 value, the fit to the single Gaussian function will\nbe selected in preference to the fit to the double Gaussian.\nIn the case that one of the single and double Gaussian fits\nto an intensity profile passes the criteria for success detailed\nabove while the other fails, that fit will be used to determine\nthe PALB location. This is irrespective of which fit had the\nbetter χ2\/ν value for that intensity profile.\n3.3 Technique limitations\nThe technique as outlined requires that each MLT sector be\nwell modelled either as a continuous single or double auro-\nral oval and so will not provide an accurate representation of\nmore complex auroral configurations (see Frey, 2007, for a\nreview of localised auroral features outside the main oval).\nNo explicit distinction is made between a double oval and\nother auroral features that may appear poleward of the main\noval, such as high-latitude sun-aligned arcs. When present,\nhigh-latitude sun-aligned arcs can be suggestive of a config-\nuration of multiple regions of open and closed magnetic flux\nrather than a single open polar cap (e.g., Newell et al., 1997;\nBrittnacher et al., 1999; Newell et al., 2009). For each MLT\nsector, only a single PALB is assumed to be a proxy for the\nOCB and, hence, polar caps with multiple open field line re-\ngions will not be well modelled. Our technique also assumes\nthat the region between the main oval and a poleward bulge\nis on closed magnetic field lines. The technique used for\nautomated detection of PAPBs from DMSP data also con-\nsiders any void regions observed at latitudes equatorward of\na closed region, such as the central plasma sheet or plasma\nsheet boundary layer, to also be closed (Sotirelis and Newell,\n2000) and so comparison of our PALBs with this dataset is\nstill valid. Additionally, post-processing techniques could be\napplied to our PALBs to identify or eliminate images show-\ning deviation from “typical” auroral configurations, such as\nimages with theta auroral signatures. Subauroral features,\nsuch as detached arcs and patches, may also occasionally re-\nsult in inaccurate modelling of the EALB.\n4 Evaluation of the boundary location technique\nIn this section, we present a case study to illustrate how our\nauroral luminosity boundary location technique compares\nwith the single Gaussian model and single camera location\nmethod of Carbary et al. (2003). In addition, we present a sta-\ntistical analysis of the whole dataset, in order to show more\ngenerally the advantages of modelling intensity profiles as\nboth single and double Gaussian functions.\nwww.ann-geophys.net\/28\/1659\/2010\/ Ann. Geophys., 28, 1659–1678, 2010\n1664 N. Longden et al.: Estimating the OCB\nFig. 1. FUV intensity observed by the IMAGE FUV WIC instrument at 00:10 UT 1 February 2001 in AACGM coordinates (panel a). The\nsolid black lines mark the 02:00–03:00 and 22:00–23:00 MLT sectors. All count values above 1600 have been saturated. The latitudinal\nluminosity intensity profiles corresponding to these MLT sectors are shown in panels (b) and (c), respectively. The black diamonds show the\nmean count values of the intensity profiles. The standard error on these intensity count values are shown. The blue curves show the result of\nfitting the function Fs(λ) to these intensity profiles with the vertical blue dashed lines indicating the PALBs derived from these fits for each\nprofile. The red curves show the result of fitting the function Fd(λ) to these intensity profiles with the vertical red dashed lines indicating the\nPALBs derived from these fits.\n4.1 Case study: boundary estimates during moderate\ngeomagnetic activity\nFigure 1a shows the auroral luminosity variation recorded\nby the WIC channel of the IMAGE FUV instrument on 1\nFebruary 2001 at 00:10 UT in AACGM coordinates. Inten-\nsity values greater than 1600 counts have been saturated. The\nsaturated values at lower magnetic latitudes across the day-\nside MLT sectors are caused by dayglow. This image was\ntaken during a small geomagnetic storm driven by the pas-\nsage of an interplanetary coronal mass ejection (ICME) with\na minimum value of the Dst index of −43 nT. The onset of\nthis small storm occurred on the morning of the 31 January\n2001, with minimum Dst observed at 18:00 to 19:00 UT on\nthat day. At the time of the image, Dst was−33 nT while the\nKp index had a value of 2.\nBifurcation of auroral emission is evident in both the pre-\nand post-midnight sectors, with emission poleward of the\nmain oval. Figure 1b and c shows latitudinal profiles of FUV\nintensity (black diamonds) in the 02:00 to 03:00 MLT and\n22:00 to 23:00 MLT sectors, respectively, as highlighted in\nFig. 1a by the black solid lines. Error bars on the diamonds\nindicate the standard error of the mean intensity values. In\neach panel, the blue curve shows the result of fitting the sin-\ngle Gaussian function Fs(λ) to the latitudinal profile while\nthe red curve shows the result of fitting the double Gaussian\nfunction Fd(λ) to that profile. The vertical dashed lines mark\nthe location of the PALB estimated from the coefficients of\neach fit using Eq. (4).\nThe bifurcation of the auroral oval apparent in Fig. 1a is\nalso evident in the latitudinal profiles, with emission pole-\nward of the main peak in Fig. 1b and a largely detached sec-\nondary peak in Fig. 1c. In both cases, the double Gaussian\nfit provides a better description of the underlying intensity\nprofile and was selected in preference to the single Gaussian\nfit; in the 02:00 to 03:00 MLT sector, χ2\/ν for the Fd(λ)\nfit is ∼ 0.4 compared to ∼ 4.9 for the Fs(λ) fit, and in the\n22:00 to 23:00 MLT sector, the χ2\/ν for the Fd(λ) fit is∼ 1.7\ncompared to ∼ 11.1 for the Fs(λ) fit. It is also clear that\nthe quadratic coefficients of the single Gaussian function are\npoorly fit to the background emissions of the intensity profile\ndue to the presence of the second peak in auroral emission in\nthe 22:00 to 23:00 MLT sector.\nThe PALBs estimated from the function Fd(λ) are located\npoleward of both intensity peaks for both profiles and appear\nto correspond to a return to background FUV intensity lev-\nels poleward of the auroral oval. They also pass our criteria\nfor successful boundary location. In the 02:00 to 03:00 MLT\nAnn. Geophys., 28, 1659–1678, 2010 www.ann-geophys.net\/28\/1659\/2010\/\nN. Longden et al.: Estimating the OCB 1665\nFig. 2. Intensity counts recorded by the IMAGE FUV WIC sensor on the 1 February 2001 between 00:00 and 06:00 UT. Count values above\nand below thresholds indicated in the intensity scales have been saturated. Not a Number (NaN) and zero count intensity values are shown\nin yellow. From top to bottom, the panels show the MLT sectors 00:00–01:00, 06:00–07:00, 12:00–13:00, and 18:00–19:00, respectively.\nPanels (a) to (d) show auroral luminosity boundary locations derived according to the method detailed in this paper. Blue squares denote\npoleward and equatorward luminosity boundaries determined from fits to a function with a single Gaussian component (Fs(λ)), with blue\nerror bars showing ±Uλ on these boundaries. Red squares denote poleward and equatorward luminosity boundaries determined from fits to\na function with a double Gaussian component (Fd(λ)), with red error bars showing ±Uλ on these boundaries. Panels e to h show these data\nwith auroral luminosity boundary locations derived according to the method detailed in Carbary et al. (2003). Vertical dashed black lines\nindicate times of substorm onset from the list outlined in Frey et al. (2004).\nsector (Fig. 1b), the single Gaussian fit also passes the criteria\nfor success, which could have resulted in an incorrectly esti-\nmated PALB. However, the single Gaussian fit in the 22:00\nto 23:00 MLT sector failed the criteria and would have been\ndiscarded.\nFigure 2 shows keograms of auroral luminosity intensity in\nfour MLT sectors recorded by WIC from 00:00 to 06:00 UT\n1 February 2001. In this time period, Dst was in the range\n−29 nT to −36 nT while Kp was in the range 2 to 3+. In\nthis figure, auroral luminosity boundaries derived from fits\nto the function Fs(λ) are indicated as blue squares and those\nderived from fits to the function Fd(λ) are indicated as red\nsquares. Error bars show the upper and lower uncertainty\nbounds on these boundary estimates (Uλ). Panels on the left\nhand side of the figure show the auroral luminosity boundary\nlocations derived using the technique outlined in this paper\nwhile the right hand side panels show those derived using the\ntechnique of Carbary et al. (2003). We include the bound-\naries obtained using the method of Carbary et al. (2003) to\nenable direct comparison of our method with another fully\nautomated boundary location technique that only employs\nfits to a single Gaussian function when deriving PALB loca-\ntions. These PALBs have not been corrected for their syste-\nmatic offset with DMSP PAPBs, and hence the boundary lo-\ncations derived using the method outlined in this paper from\na single Gaussian function, Fs(λ), differ from those derived\nusing the method of Carbary et al. (2003) only by their differ-\nent success criteria. The list of substorm onsets detected from\nIMAGE data in Frey et al. (2004) includes two onsets during\nthe period shown in Fig. 2. These occurred at ∼03:16 UT\nwww.ann-geophys.net\/28\/1659\/2010\/ Ann. Geophys., 28, 1659–1678, 2010\n1666 N. Longden et al.: Estimating the OCB\nand ∼04:26 UT and are highlighted by the vertical dashed\nblack lines in the figure. Oscillations in the latitude of auroral\nemissions, and, consequently PALB locations, with a period\nof around 10 to 20 min are evident in the keograms, and are\nparticularly clear in the 00:00 MLT sector prior to 01:00 UT.\nThese oscillations are caused by inconsistency in the IMAGE\npointing calculation due to spin-axis coning of the satellite\n(as discussed earlier). Other contemporaneous images of the\naurora, such as those obtained from the NORSTAR 630 nm\nmeridian scanning photometer (not shown) do not show this\noscillation.\nAt the start of the interval, prior to∼01:30 UT, bifurcation\nof auroral emission is evident in the 00:00 to 01:00 MLT sec-\ntor. The PALBs estimated from single Gaussian fits (Fig. 2e)\ntypically correspond to the more equatorward emission band\nand appear to be at erroneously low latitudes. The PALBs es-\ntimated from double Gaussian fits (Fig. 2a) appear to cover\nthe full extent of auroral emission during this time. For a\nvery small number of intensity profiles, auroral luminosity\nboundary estimates have been made from the single Gaus-\nsian fits in preference to double Gaussian fits. In these cases,\nthe relatively low amplitude of the secondary emission with\nrespect to the main oval causes the double Gaussian fit to fail\nthe criteria set out in Sect. 3.2 (specifically, criterion 3) while\nthe single Gaussian fits pass all of our criteria, hence the au-\nroral boundaries are taken from the fits to Fs(λ). Bifurcation\nis also evident in the 00:00 to 01:00 and 18:00 to 19:00 MLT\nsectors following the onset of substorm activity. At these\ntimes, the double Gaussian appears to be a more appropri-\nate model for the auroral emissions. Prior to ∼02:17 UT, the\ncomplex auroral emission profiles observed in the 06:00 to\n07:00 MLT sector also appear to be better fit by double Gaus-\nsian function than a single Gaussian function from compari-\nson of the boundaries shown in Fig. 2b and f, especially the\nEALBs. Panels (c) and (g) of Fig. 2 show the limited number\nof auroral luminosity boundary locations that have been es-\ntimated in the 12:00 to 13:00 MLT sector, because dayglow\ncontamination swamps the auroral emission.\nIn the 18:00 to 19:00 MLT sector (Fig. 2d), it can be\nseen that some of the auroral boundaries prior to ∼01:30 UT\nand again between∼03:00 UT and 04:30 UT switch between\nthose estimated from a single Gaussian function and those\nestimated from a double Gaussian function. This switching\nappears to be caused by fluctuations in the amplitudes of two\nclosely-spaced Gaussian components in the auroral emission\nprofiles such that at times the two peaks cannot be resolved\nand appear as one. At the transition between an apparently\nsingle and a resolved bifurcated oval, intensity profiles are\nnot clearly better modelled as either Fs(λ) or Fd(λ), result-\ning in the switching behaviour.\nTo illustrate the difference between the IMAGE FUV ca-\nmeras, Fig. 3 shows the mean intensity counts recorded by\nthe SI12 (panels a to d) and SI13 (panels e to h) channels dur-\ning the same moderate storm period with auroral luminosity\nboundary locations estimated using the method outlined in\nSect. 3. As before, blue squares indicate boundaries derived\nfrom single Gaussian fits to the intensity profiles while red\nsquares indicate boundaries derived from double Gaussian\nfits. In contrast to the WIC data shown in Fig. 2, bifurca-\ntion is not evident in the SI12 auroral emissions and con-\nsequently fewer boundaries are made from double Gaussian\nfits. In particular, the more poleward band of emission ob-\nserved prior to∼01:30 UT in the WIC emissions in the 00:00\nto 01:00 MLT sector (Fig. 2a) is not obvious in the SI12 emis-\nsions (Fig. 3a). Some dayside boundaries have been resolved\nfrom the SI12 auroral emission due to the reduced dayglow\ncontamination at this wavelength. However, the SI13 auroral\nemissions show some bifurcation in the 00:00 to 01:00 MLT\nsector at the start of the period and following the second sub-\nstorm onset (Fig. 3e) but does not capture the bifurcation ev-\nident in the WIC auroral emissions in the dawn and dusk\nsectors. This is likely the result of the lower resolution of the\nSI13 camera relative to the separation of the peaks in auroral\nintensity.\n4.2 Statistical analysis of the impact of the double\nGaussian model on boundary estimation\nThe number of PALB locations successfully estimated from\nimages from each of the three FUV detectors between May\n2000 and August 2002 is shown in Fig. 4a. As can been\nseen, the lowest numbers of successful PALB locations oc-\ncur in dayside MLTs for all three cameras. This is due to\na combination of the effects of dayglow and weak dayside\nauroral emissions. Peak numbers of successful PALB loca-\ntions from SI12 and SI13 images occur around local mid-\nnight, while peak successful PALB locations from WIC im-\nages occur around dawn and dusk MLTs. The primary cause\nof failure in PALB estimation in all MLT sectors for inten-\nsity profiles from SI12 and SI13 images is the uncertainty in\nboundary location exceeding the acceptable limit specified in\nSect. 3.2. Additionally, a large number of double Gaussian\nfits fail our width criteria (criterion 4). In nightside MLT\nsectors, there are fewer successful PALBs derived from WIC\nimages than may be expected from the trends in SI12 and\nSI13 PALB numbers. This is a largely seasonal effect, with\nfew “nightside” boundaries being successfully located during\nsummer months from WIC images due to dayglow contami-\nnation beyond the geomagnetic pole.\nFigure 4b shows the percentage of those successfully es-\ntimated auroral luminosity boundary locations made from a\nfit of Fd(λ) to a latitudinal intensity profile in preference to\nFs(λ). A clear MLT dependence is evident, with the highest\npercentages observed around local midnight. WIC images\nhave higher percentages of intensity profiles that are better\nmodelled as a double Gaussian function than images from\nSI12 and SI13 in each MLT sector, with ∼35% of WIC pro-\nfiles in the 23:00 to 01:00 MLT sector being better modelled\nas a double Gaussian. The difference between the SI13 and\nWIC imagers, which are both sensitive to electron emissions,\nAnn. Geophys., 28, 1659–1678, 2010 www.ann-geophys.net\/28\/1659\/2010\/\nN. Longden et al.: Estimating the OCB 1667\nFig. 3. Intensity counts recorded by the IMAGE FUV SI12 and SI13 sensors on the 1 February 2001 between 00:00 and 06:00 UT. Count\nvalues above and below thresholds indicated in the intensity scales have been saturated. Not a Number (NaN) and zero count intensity\nvalues are shown in yellow. From top to bottom, the panels show the MLT sectors 00:00–01:00, 06:00–07:00, 12:00–13:00 and 18:00–\n19:00, respectively. Panels (a) to (d) show auroral luminosity boundary locations derived according to the method detailed in this paper\nfrom SI12 images, with panels (e) to (h) showing the same derived from SI13 images. Blue squares denote poleward and equatorward\nluminosity boundaries determined from fits to a function with a single Gaussian component (Fs(λ)), with blue error bars showing ±Uλ on\nthese boundaries. Red squares denote poleward and equatorward luminosity boundaries determined from fits to a function with a double\nGaussian component (Fd(λ)), with red error bars showing ±Uλ on these boundaries. Vertical dashed black lines indicate times of substorm\nonset from the list outlined in Frey et al. (2004).\nis likely due to the lower imager resolution and lower typical\nintensity count levels of SI13, making the bifurcation of au-\nroral emission more difficult to resolve in SI13 images. Sim-\nilarly, this is also the case for SI12 but with the additional\ndifferences due to proton rather than electron emissions.\nTable 1 compares the number of successful PALB loca-\ntions made using our technique (showing both those bound-\naries made from fits of the single Gaussian function (Fs(λ))\nand those made from fits of the double Gaussian function\n(Fd(λ))), and using the technique outlined in Carbary et al.\n(2003) (WIC only). It also shows how these numbers vary\nwith geomagnetic activity (as measured by Kp) and MLT\n(6-h sectors). Consistent with Fig. 4, PALBs made from\nfits of Fd(λ) using our technique are most numerous in the\nnightside MLT sectors (21:00 to 03:00 MLT) and least nu-\nmerous in the dayside (09:00 to 15:00 MLT). Additionally,\nthe percentage of the total number of our successfully lo-\ncated PALBs being made from fits of Fd(λ) in preference to\nFs(λ) in the nightside increases with geomagnetic activity,\nwith more than 50% of nightside boundaries made from WIC\nimages resulting from double Gaussian fits. Additionally, the\npercentage of successfully located PALBs from the available\nluminosity profiles also increases with geomagnetic activity\nin all MLT ranges for each of the FUV detectors (with the\nexception of WIC in nightside sector where similar percent-\nages of PALBs are successfully located during moderate and\nactive conditions). From comparison with the numbers of\nPALB locations successfully estimated using the technique\nwww.ann-geophys.net\/28\/1659\/2010\/ Ann. Geophys., 28, 1659–1678, 2010\n1668 N. Longden et al.: Estimating the OCB\nFig. 4. Number of PALBs in each MLT sector derived from IMAGE FUV WIC images (red line), SI12 images (blue line), and SI13 images\n(green line) from May 2000 until August 2002 using the technique outlined in this paper (panel a). Panel (b) shows the percentage of these\nsuccessful boundary locations that are derived from fits of the function Fd(λ) to latitudinal intensity profiles.\nTable 1. Number (N ) of PALB estimations derived from IMAGE FUV images between May 2000 and August 2002 using the method\noutlined in this paper (all three FUV detectors) and the method of Carbary et al. (2003) (WIC images only) separated by MLT and geomag-\nnetic activity. The percentages of successfully located PALBs out of the total available luminosity profiles are shown in parentheses. The\npercentages of successfully located PALBs made from single Gaussian fits (Fs(λ)) and double Gaussian fits (Fd(λ)) are also shown.\nOur method Carbary method\nSI12 SI13 WIC WIC\nMLT N Fs(λ) Fd(λ) N Fs(λ) Fd(λ) N Fs(λ) Fd(λ) N\nDuring quiet activity 0≤Kp< 2\n21:00–03:00 392 182 (35%) 96% 4% 404 304 (37%) 91% 9% 273 536 (27%) 81% 19% 371 707 (36%)\n03:00–09:00 85 264 (8%) 98% 2% 143 935 (13%) 94% 6% 217 696 (21%) 87% 13% 254 310 (25%)\n09:00–15:00 24 919 (2%) 98% 2% 59 808 (6%) 98% 2% 59 722 (6%) 94% 6% 61 253 (6%)\n15:00–21:00 164 039 (15%) 98% 2% 165 651 (15%) 98% 2% 198 802 (19%) 94% 6% 217 504 (21%)\nDuring moderate activity 2≤Kp< 4\n21:00–03:00 595 584 (60%) 91% 9% 548 541 (56%) 81% 19% 327 845 (35%) 63% 37% 391 158 (41%)\n03:00–09:00 206 120 (21%) 97% 3% 263 827 (27%) 92% 8% 360 710 (38%) 84% 16% 361 173 (38%)\n09:00–15:00 77 375 (8%) 98% 2% 94 069 (10%) 98% 2% 90 003 (10%) 95% 5% 77 393 (8%)\n15:00–21:00 384 581 (39%) 95% 5% 313 221 (32%) 94% 6% 369 010 (39%) 88% 12% 359 926 (38%)\nDuring high activity Kp≥ 4\n21:00–03:00 182 071 (71%) 85% 15% 172 958 (69%) 71% 29% 82 717 (34%) 49% 51% 96 697 (40%)\n03:00–09:00 100 193 (39%) 92% 8% 105 465 (42%) 86% 14% 117 050 (48%) 78% 22% 113 837 (47%)\n09:00–15:00 51 700 (20%) 96% 4% 33 588 (13%) 97% 3% 36 658 (15%) 95% 5% 23 686 (10%)\n15:00–21:00 150 736 (59%) 89% 11% 106 082 (42%) 81% 19% 107 752 (45%) 75% 25% 102 009 (42%)\nof Carbary et al. (2003), it can be seen that the requirement\nof our technique to discriminate between single and double\nGaussian models of auroral luminosity does not greatly re-\nduce the number of boundary locations found (< 10%).\nFigure 5 illustrates the effect of modelling the latitudi-\nnal intensity profiles as a double Gaussian function on the\nestimated auroral luminosity boundary locations. It shows\nthe distribution of differences between boundaries estimated\nAnn. Geophys., 28, 1659–1678, 2010 www.ann-geophys.net\/28\/1659\/2010\/\nN. Longden et al.: Estimating the OCB 1669\nFig. 5. Distribution of differences in auroral luminosity boundaries derived from single Gaussian (Fs(λ)) and double Gaussian fits (Fd(λ))\nwhen both models successfully produce boundary locations under differing levels of geomagnetic activity, inferred from the Kp index. The\ncoloured curves show the distribution of PALB differences for each of the three IMAGE FUV detectors during May 2000 to August 2002.\nThe black curves in each panel show the distribution of EALB differences.\nTable 2. Sample size (N ), mean (µ), standard deviation (σ ), 25th percentile (25%), median (50%), and 75th percentile (75%) for the\ndifferences between DMSP PAPBs and IMAGE FUV PALBs, during 2000 and 2001. Differences have been included only when PALBs\nare successfully located from fits of both single and double Gaussian functions to an auroral intensity profile and the double Gaussian is the\nsuperior model.\nFs(λ) Fd(λ)\nN µ σ 25% 50% 75% µ σ 25% 50% 75%\nWIC 370 −1.67 3.60 −3.55 −1.88 −0.02 −1.94 3.18 −3.02 −1.74 −0.49\nSI12 140 1.42 3.44 −0.93 1.40 3.70 −1.17 3.08 −2.69 −1.48 0.57\nSI13 219 −0.98 5.30 −3.24 −1.28 0.96 −1.30 4.58 −2.15 −1.07 0.17\nfrom fits of the single Gaussian function (Fs(λ)) and the dou-\nble Gaussian function (Fd(λ)) when both models produce\nsuccessful boundary locations. In nearly all cases (> 99%),\nthe double Gaussian function is a better model than the sin-\ngle Gaussian function. The coloured curves show the distri-\nbution of differences in the derived PALBs while the black\ncurves show the differences in EALBs. The boundary diffe-\nrences have been separated according to geomagnetic activ-\nity and FUV camera. Each distribution of PALB differences\nshows a main narrow peak with a modal value close to zero\nand a secondary peak or heavy skew for large, positive diffe-\nrences. These distributions imply two classes of offset be-\ntween PALBs estimated from Fs(λ) and Fd(λ); small offsets\nthat do not show a significant poleward or equatorward bias\nwww.ann-geophys.net\/28\/1659\/2010\/ Ann. Geophys., 28, 1659–1678, 2010\n1670 N. Longden et al.: Estimating the OCB\nTable 3. The number (N) and mode (M) of comparisons of differences between DMSP PAPBs and FUV PALBs during 2000 and 2001\nand inter-camera comparisons from May 2000 to August 2002. All available boundaries have been included. Estimated values for modal\ndifferences are shown in square brackets.\nλDMSP−λWIC λDMSP−λSI12 λDMSP−λSI13 λWIC−λSI12 λWIC−λSI13 λSI12−λSI13\nMLT N M N M N M N M N M N M\n00:00–01:00 – [0.0] – [−1.5] – [−1.0] 88 096 0.2 99 123 0.0 149 128 0.0\n01:00–02:00 – [0.0] – [−1.5] – [−0.5] 82 105 −0.2 95 789 −0.2 13 5371 0.2\n02:00–03:00 – [0.5] – [−1.5] – [0.0] 72 059 −0.4 89 998 0.0 113 759 0.4\n03:00–04:00 – [0.0] – [−1.0] – [0.0] 60 409 −0.8 83 852 −0.4 89 959 0.8\n04:00–05:00 – [0.0] – [−0.5] – [0.0] 49 082 −0.8 76 231 −0.4 62 989 1.2\n05:00–06:00 143 −0.5 32 −1.5 48 0.5 40 537 −0.6 64 875 0.2 40 031 0.8\n06:00–07:00 570 −0.5 191 0.0 245 −0.5 30 840 −0.4 45 323 −0.4 23 026 1.0\n07:00–08:00 281 −1.5 107 0.0 144 −1.0 20 696 0.6 32 757 0.0 14 668 1.0\n08:00–09:00 221 −2.0 74 −1.5 120 −1.0 11 874 0.2 20 908 0.0 8994 0.4\n09:00–10:00 174 −2.0 66 −2.0 159 −1.0 6545 0.0 11 596 −0.2 5737 0.4\n10:00–11:00 55 −1.0 47 −2.5 79 −1.5 4655 0.4 6409 0.4 5453 0.4\n11:00–12:00 38 −2.0 40 −3.5 48 −1.5 4107 0.4 4309 0.2 5777 1.0\n12:00–13:00 20 −1.5 31 −2.0 22 −2.0 4184 −0.2 4881 0.4 5947 0.4\n13:00–14:00 36 −1.5 22 −1.5 38 −1.5 5559 −0.4 8023 0.2 6887 0.4\n14:00–15:00 70 −1.5 41 −1.0 68 −1.5 10 350 −0.2 16 748 0.2 10 225 0.0\n15:00–16:00 156 −1.5 99 0.0 137 −1.0 20 845 0.6 33 238 0.4 18 048 0.0\n16:00–17:00 490 −1.5 281 0.5 277 −1.0 37 503 0.8 49 486 0.4 28 013 −0.4\n17:00–18:00 793 −1.5 571 0.0 533 −1.0 51 964 1.8 55 185 0.2 38 659 −1.0\n18:00–19:00 551 −2.0 550 1.0 478 −1.0 63 210 1.8 63 985 0.2 58 179 −0.8\n19:00–20:00 282 −1.5 425 1.0 328 −1.5 66 233 2.0 69 336 0.2 81 368 −1.0\n20:00–21:00 357 −1.5 541 1.0 482 −1.5 72 958 1.6 76 338 0.0 109 780 −1.0\n21:00–22:00 206 −1.5 379 0.0 326 −1.5 79 412 1.0 84 445 0.2 134 310 −0.8\n22:00–23:00 – [−1.0] – [−0.5] – [−1.5] 85 084 0.8 92 218 0.0 148 770 −0.2\n23:00–00:00 – [−0.5] – [−1.0] – [−1.0] 88 710 0.6 97 808 0.0 154 217 −0.2\nTotal 4443 – 3497 – 3532 – 1 057 017 – 1 282 861 – 1 449 295 –\nand large offsets where the PALB from Fd(λ) is consistently\npoleward of the PALB from Fs(λ). This trend is present for\nall levels of geomagnetic activity. The narrow peak of the\ndistribution located close to zero is likely to be from times\nwhere the auroral emission luminosity profiles exhibit two\nclosely located or overlapping peaks. The large differences\nare likely to be from times when there is clear separation in\nthe auroral emissions, with the PALBs from double Gaussian\nfits consistently being made from the more poleward peak\nwhile the PALB from the single Gaussian fit is made from the\nmore equatorward peak. The EALB difference distributions\nare approximately anti-symmetric to the PALB ones, particu-\nlarly for boundaries from WIC and SI13 during times of low\ngeomagnetic activity. This demonstrates that when the single\nand double Gaussian models produce very different auroral\nluminosity boundaries, the poleward (equatorward) bound-\naries of the double Gaussian model are consistently poleward\n(equatorward) of those from the single Gaussian models.\nFigure 6 shows the probability densities of PALB locations\nfor each of the three IMAGE FUV detectors separated into 6-\nh MLT ranges. In each panel, the solid coloured bars show\nthe densities for PALBs estimated from double Gaussian fits\nwhile the black curves show the densities for PALBs esti-\nmated from single Gaussian fits. In the dusk sector (15:00\nto 21:00 MLT), the centroids of the density distributions of\nPALBs from single Gaussian fits are slightly poleward of the\ncentroids of the density distributions of PALBs from double\nGaussian fits from WIC and SI13. In all other MLT sectors\nand for SI12 boundaries, the PALBs centroids of the den-\nsity distributions of the PALBs from double Gaussian fits are\npoleward of those relating to single Gaussian fits. In most\ncases, this suggests that the auroral luminosity boundaries are\npoleward of the main peak in emission. However, the distri-\nbution of PALBs from double Gaussian fits to WIC profiles in\nthe dayside MLT sector indicates some potentially erroneous\nboundaries due to the relatively high probability of bound-\naries being located close to the cutoff of 90◦ compared to\nthe other MLT sectors and instruments. While these bound-\naries could indicate the presence of auroral features at high\nlatitudes, they do not appear in the distributions for SI12 and\nSI13 cameras, which are less susceptible to dayglow contam-\nination.\nAnn. Geophys., 28, 1659–1678, 2010 www.ann-geophys.net\/28\/1659\/2010\/\nN. Longden et al.: Estimating the OCB 1671\nFig. 6. Probability densities of IMAGE FUV PALBs derived using the method outlined in this paper during May 2000 to August 2002 with a\nresolution of 1◦. From top to bottom, panels show the densities for PALBs from the WIC, SI12 and SI13 cameras, respectively. From left to\nright, the panels show the probability densities for nightside, dawnside, dayside, and duskside MLT sectors, respectively. The solid coloured\nbars show the densities for PALBs derived from double Gaussian (Fd(λ)) fits to intensity profiles while the black curves show the densities\nfor those derived from single Gaussian (Fs(λ)) fits to intensity profiles. All successfully located PALBs are included.\n4.3 Statistical comparison of FUV PALBs\nwith DMSP PAPBs\nAs with similar studies (e.g. Carbary et al., 2003; Boakes\net al., 2008), we compare our estimated PALBs with con-\ntemporaneous, co-located DMSP PAPBs (where available)\nto assess their accuracy as a proxy for the OCB. Boundary\ncomparisons are made to the closest successful PALB within\n±5 min UT and within±0.5 h MLT of the DMSP PAPB dur-\ning the period from May 2000 until December 2001. The\ndistributions of the differences between DMSP PAPBs and\nIMAGE PALBs across all available MLT sectors are shown\nin Fig. 7a to c, with a resolution of 0.5◦. Consistent with\nthe study of Carbary et al. (2003), these boundary difference\ndistributions are roughly Gaussian in profile, although the\nSI12 PALB distribution exhibits a positive skew, indicating\na higher proportion of events where the DMSP PAPB is lo-\ncated poleward of our FUV PALB. This is similar to the ob-\nservation in the earlier case study of SI12 PALBs being made\nfrom an equatorward band of auroral emission in the 00:00 to\n01:00 MLT sector between around 00:00 to 01:30 UT while\nWIC and SI13 PALBs are made from a clear poleward band\nof emission (Figs. 2a, 3a, and 3e). The pointing calculation\nerror for the IMAGE dataset and subsequent effect on the ac-\ncuracy of the derived PALBs may increase the uncertainty of\nthese PALBs in comparison with the PAPBs. Panels (d) to (f)\nof Fig. 7 illustrate the effect of fitting a double Gaussian func-\ntion (Fd(λ)) on these boundary differences. In these panels,\nthe solid bars show the distribution of differences between\nDMSP PAPBs and IMAGE PALBs derived from fits of Fd(λ)\nto intensity profiles when the fits from this function were su-\nperior to those of fits to the single Gaussian function Fs(λ).\nWe only include boundaries when the PALB derived from the\nsingle Gaussian fit have also passed our criteria. The distri-\nbutions of differences between PAPBs and PALBs estimates\nfrom these single Gaussian fits are shown as black lines in\nFig. 7d to f. Due to the lower number of comparisons in these\ndistributions, a resolution of 1◦ has been used. The mean (µ),\nstandard deviation (σ ), and percentile values for the differen-\nces between the DMSP PAPBs and FUV PALBs are sum-\nmarised in Table 2. In each case, the boundary differences\nrelating to PALBs derived from double Gaussian fits have\nwww.ann-geophys.net\/28\/1659\/2010\/ Ann. Geophys., 28, 1659–1678, 2010\n1672 N. Longden et al.: Estimating the OCB\nFig. 7. Distribution of differences between DMSP PAPBs and IMAGE FUV PALBs derived using the method outlined in this paper during\n2000 and 2001. From top to bottom, panels show the distribution of differences between PAPBs and PALBs from the WIC, SI12 and SI13\ncameras, respectively. Panels (a) to (c) show the distribution of all differences between PAPBs and PALBs at a resolution of 0.5◦. Panels\nd to f show the distribution of differences between PAPBs and PALBs derived from double Gaussian (Fd(λ)) fits to intensity profiles (solid\ncoloured bars) and PALBs derived from single Gaussian (Fs(λ)) fits to intensity profiles (black line) at a resolution of 1◦. For panels (d) to\n(f), boundaries are only included when PALBs derived from both the single and double Gaussian fits to an intensity profile pass our criteria\nbut the double Gaussian provides the superior fit to the profile.\na smaller standard deviation than those relating to PALBs\nfrom single Gaussian fits, showing that the double Gaussian\nfit yields a boundary more consistent with PAPBs than would\nhave been obtained by a single Gaussian fit. The interquartile\nrange is also lower for PALBs from double Gaussian fits than\nthose from single Gaussian fits for all FUV cameras. It must\nbe noted that the sample here is limited, and is biased by the\nrequirement that both the double and single Gaussians are\ngood fits to the profile, therefore excluding a large majority\nof cases when the double Gaussian represents a much better\nfit to the emission profile than a single Gaussian fit that fails\nthe criteria. Hence, the improved correlation with the PAPBs\nis more subtle here than in reality.\nTable 3 lists a summary of the comparisons of DMSP\nPAPBs and PALBs in each MLT sector taken from each of\nthe IMAGE FUV detectors, including the number of compar-\nisons made (N), and the mode of the distribution of the diffe-\nrences between these boundary locations (M). Due to the low\nfrequency of differences in some MLT sectors, the difference\ndistribution in each MLT sector has been smoothed three\ntimes using a boxcar average over five points (e.g., Boakes\net al., 2008). The MLT variation of these smoothed modal\ndifferences for each FUV detector are shown in Fig. 8a to c\n(diamond symbols). Error bars show estimates for the stan-\ndard deviations derived from fitting a Gaussian function to\neach distribution. To obtain estimates for the expected modal\nvalues in the MLT sectors where no DMSP PAPBs are avail-\nable, we model the MLT variation of the modal differences\n(L(ϕ)) as a second-order harmonic function (e.g., Carbary\net al., 2003; Boakes et al., 2008):\nL(ϕ)=C0+C1cosϕ+D1sinϕ+C2cos2ϕ+D2sin2ϕ (6)\nwhere ϕ is the angle associated with each MLT sector in cir-\ncular coordinates with 0◦ at midnight, and increasing with in-\ncreasing MLT, and C0, C1, C2, D1 and D2 are coefficients of\nthe fit. We again use the Levenberg-Marquardt least squares\nfitting routine adapted from Press et al. (1992) to obtain the\nparameters of the fit. No weighting was applied during fit-\nting. The results of these fits are shown as the continuous\ncurves in Figs. 8a to c. The modal differences estimated\nfrom these fits, rounded to the nearest 0.5◦, are shown in Ta-\nble 3 in square brackets for the MLT sectors without DMSP\nAnn. Geophys., 28, 1659–1678, 2010 www.ann-geophys.net\/28\/1659\/2010\/\nN. Longden et al.: Estimating the OCB 1673\nFig. 8. Comparison of DMSP PAPBs and IMAGE FUV PALBs derived using the method outlined in this paper during 2000 and 2001.\nPanels (a) to (c) show the modes of the smoothed difference distributions between PAPBs and PALBs from the WIC, SI12 and SI13 cameras,\nrespectively, with a resolution of 0.5◦, represented by diamond symbols. The solid lines in each panel show the second-order harmonic fits\nto the modal distribution values. Error bars show estimates for the standard deviations of the boundary differences. Panel (d) shows the\ncorrelation coefficient of PAPBs and PALBs from the WIC (red plus symbols), SI12 (blue cross symbols), and SI13 (green asterisks) FUV\ncameras in each MLT sector. Grey symbols indicate correlation coefficient values that are not significant to the 95% confidence level.\ndata. Figure 8d shows the correlation coefficients for DMSP\nPAPBs and FUV PALBs in each MLT sector. Coloured sym-\nbols show significant correlation coefficients while grey sym-\nbols indicate coefficients that are not significant at the 95%\nconfidence level.\nIn addition to the differences between DMSP PAPBs and\nFUV PALBs, Table 3 also lists the (unsmoothed) modal\nvalues of the distribution of differences between PALBs ob-\ntained from the different FUV cameras and the number of\ninter-camera comparisons available during May 2000 until\nAugust 2002 in each MLT sector. Due to the typically higher\nnumbers of inter-camera comparisons relative to the compar-\nisons with DMSP PAPBs, a resolution of 0.2◦ was used for\nthese difference distributions. Inter-camera comparisons are\nmade between successful PALBs within±15 s UT and in the\nsame MLT sector.\nFrom the modal differences of the inter-camera compar-\nisons, it can be seen that PALBs obtained from WIC and\nSI13 images are largely the same, with a slight poleward off-\nset for WIC PALBs of up to 0.6◦ across all MLTs. As ex-\npected from the offset between electron and proton aurora,\nthe modal difference values indicate that PALBs from SI12\nimages are typically located poleward of those from WIC and\nSI13 in the predawn sector and equatorward around dusk.\n4.4 OCB estimate correction\nCarbary et al. (2003) and Boakes et al. (2008) proposed\nconstant offset corrections to minimise the systematic er-\nror observed between DMSP PAPBs (thought to provide\nthe most accurate proxy for the OCB) and PALBs derived\nfrom auroral images, aiming to improve the accuracy of the\nPALB as a proxy for the OCB. We use the modal differen-\nces between the FUV PALBs and DMSP PAPBs as well\nwww.ann-geophys.net\/28\/1659\/2010\/ Ann. Geophys., 28, 1659–1678, 2010\n1674 N. Longden et al.: Estimating the OCB\nFig. 9. Correction offset values for PALBs derived from images\nfrom the IMAGE FUV WIC, SI12, and SI13 detectors using the\nmethod outlined in this paper between May 2000 and August 2002,\nrepresented by diamond symbols. The solid lines in each panel\nshow the second-order harmonic fits to these offsets.\nas the modes of the inter-camera comparisons (as listed in\nTable 3) to calculate the necessary offsets (1λFUV) to cor-\nrect PALBs from each FUV camera using Eqs. (11) to (13)\nof Boakes et al. (2008) (Eq. 13 of Boakes et al. (2008)\nhas a typographical error and should read E−D = (−x2−\nx3 − x4 − x5 − x6)\/3). We invert these offset values such\nthat λOCB = λFUV+1λFUV. We model the resulting offset\nvalues for each FUV camera as a second-order harmonic fit\nin the form of Eq. (6) (with 1λFUV replacing L(ϕ)), again\nusing the Levenberg-Marquardt least squares fitting routine\nadapted from Press et al. (1992). These offset values and\nfits are shown in Fig. 9, and the coefficients of these fits are\nalso listed in Table 4. An MLT dependence in the systema-\ntic offsets is clear from Fig. 9, with PALBs from all came-\nras being corrected equatorward around local noon and mid-\nnight. Around local dawn, PALBs from SI13 and WIC need\nrelatively little correction while PALBs from SI12 are cor-\nrected equatorward. Around local dusk, PALBs from SI12\nare corrected slightly poleward whereas PALBs from WIC\nand SI13 are corrected equatorward. The harmonic coeffi-\ncients presented in Table 4 can be used in Eq. (6) to provide\nthe correction offset (1λFUV) for PALB estimates from any\ncamera at any MLT. The correlation coefficients shown in\nFig. 8d indicate the applicability and suitability of these off-\nsets (the inter-camera correlation coefficients are significant\nto the 95% confidence level in all MLT sectors). Hence, these\noffset corrections should only be used when the correlation\ncoefficients between DMSP PAPBs and FUV PALBs are sig-\nnificant, i.e., WIC corrections should not be used in the 11:00\nto 13:00 MLT sector and SI12 corrections should not be used\nin the 11:00 to 14:00 MLT sector.\nTable 4. Harmonic coefficients for correction of PALBs derived\nfrom IMAGE FUV images between May 2000 and August 2002.\nC0 C1 D1 C2 D2\nWIC −1.10 0.52 0.43 −0.38 0.43\nSI12 −0.88 0.66 −0.49 −0.57 −0.04\nSI13 −0.89 0.37 0.28 −0.40 0.31\n5 Polar cap area estimation\nAssuming a spherical geometry, the PCA can be estimated\nfrom the OCB (or the measured proxies) using Eq. (7) (e.g.\nCarbary et al., 2003; Chisham et al., 2008):\nPCA=\n∫ 2pi\n0\n(RE+h)2[1−sin(λOCB(φ))]dφ (7)\nwhere h is the effective altitude of the measurements, λOCB is\nthe magnetic latitude of the OCB, and φ is the magnetic lon-\ngitude. Our corrected PALBs define a proxy measure for the\nlatitude of the OCB at 24 evenly-spaced magnetic longitudes\nand, hence, the PCA can be estimated from a summation of\nthe bounded areas in each MLT sector (ϕ) using Eq. (8) (e.g.\nCarbary et al., 2003; Chisham et al., 2008):\nPCA= 2pi(RE+h)\n2\n24\n24∑\ni=1\n[1−sin(λp(ϕi)+1λ(ϕi))] (8)\nAs PALB estimates may not be available for all 24 MLT sec-\ntors in an image, a method to estimate the boundaries in the\nmissing sectors must be used. Where PALB estimates are not\navailable for all 24 MLT sectors in an image, a simple lin-\near piece-wise interpolation across the successfully defined\nboundaries is assumed.\nAs an example, Fig. 10 shows the intensity counts\nrecorded by each channel of the IMAGE FUV instrument\non 28 October 2001 at ∼09:18 UT in AACGM coordinates.\nPanels (a) to (c) show the intensity counts recorded by WIC\n(red), SI12 (blue), and SI13 (green) respectively. Panel d\nshows the composite intensity counts when the most ap-\npropriate camera for each MLT sector is selected, with the\ncolourscale corresponding to that of the selected camera.\nIn the MLT sectors where statistical comparisons with the\nDMSP PAPBs were available, we determine the most ap-\npropriate FUV camera to be the one where PALBs show\nthe highest correlation with PAPBs. For the MLT sectors\nwhere PAPBs are not available, we select the camera that\ntypically produces the most poleward boundary of the three\nbased on the modal differences of the inter-camera compar-\nison (i.e., WIC from 22:00 to 01:00 MLT and SI12 from\n01:00 to 05:00 MLT). Here, we are making the conservative\nassumption that all particle precipitation that results in sig-\nnificant auroral luminosity occurs on closed field lines, and\nhence the OCB must be poleward of all regions of auroral lu-\nminosity. In the 22:00 to 00:00 MLT sectors, where PALBs\nAnn. Geophys., 28, 1659–1678, 2010 www.ann-geophys.net\/28\/1659\/2010\/\nN. Longden et al.: Estimating the OCB 1675\nFig. 10. FUV intensity observed by the IMAGE FUV instrument at 09:18 UT 28th October 2001 in AACGM coordinates. Panels (a) to\n(c) show the intensity values from the WIC, SI12, and SI13 cameras respectively. Panel (d) shows the composite intensities obtained when\nselecting the most appropriate camera for each MLT sector. The white diamonds in panel (d) show the OCB location estimates made using\nthe method outlined in this paper from the selected camera. The correction offsets have been added to these OCB locations.\ncould be taken from either the WIC or SI13 camera, we use\nWIC data due to its higher image resolution. This instru-\nment selection is in agreement with those used in the 22:00\nto 05:00 MLT sectors by Boakes et al. (2008). Overlaid on\nthe composite image are white diamonds indicating the esti-\nmates for the OCB locations from the PALBs with systema-\ntic offsets corrected for. The white curve illustrates the linear\ninterpolation across the MLT sectors for which no PALB is\navailable. The area enclosed by this curve is considered to be\nthe PCA.\nFigure 11 shows PCA estimates made during the period of\nmoderate geomagnetic activity on the morning of 1 Febru-\nary 2001 (as covered in Fig. 2). Panel (a) shows the PCA\nestimates made during this time period for three different\nOCB estimation methods: (1) OCBs estimated from PALBs\nfrom single Gaussian models of WIC intensity profiles (blue\ncurve), (2) OCBs estimated from PALBs from single Gaus-\nsian models of intensity profiles from the best combination\nof three IMAGE FUV cameras (yellow dashed curve), and\n(3) OCBs estimated from PALBs from the combination of\nsingle and double Gaussian models of intensity profiles from\nthe best combination of the FUV cameras (red curve). OCB\ncorrection offsets as outlined in Sect. 4.4 have been applied\nto the boundaries used in method 3. We have calculated ad-\nditional OCB correction offsets using PALBs derived from\nsingle Gaussian fits only and applied these to the boundaries\nused in PCA estimation methods 1 and 2. Panel (b) in Fig. 11\nshows the percentage differences between the PCAs from\nmethod 3 and the other two PCA methods from panel (a).\nThe vertical black dashed lines indicate the times of sub-\nstorm onset identified by Frey et al. (2004). PCA estimates\nare made when PALBs are available for at least 10 of the 24\nMLT sectors of the FUV image.\nFrom Fig. 11, expansion of the polar cap prior to the sub-\nstorm activity can be seen, with contraction of the polar cap\nfollowing the onset of the second substorm for all three PCA\nestimates. During the initial period of expansion, prior to\n∼01:30 UT, when bifurcation of the auroral oval was evi-\ndent in Fig. 2, PCAs calculated using methods 1 and 2 are\ngenerally overestimated relative to those from method 3. At\ntimes, this overestimation exceeds 20% of the total PCA. In\nthe mid-phase of the period shown, from ∼02:00 UT until\nthe onset of the second substorm at ∼04:26 UT, the PCA es-\ntimates from methods 2 and 3 are highly similar as during\nthis time bifurcation in the auroral oval was limited. Fol-\nlowing the onset of the second substorm, while the auroral\nwww.ann-geophys.net\/28\/1659\/2010\/ Ann. Geophys., 28, 1659–1678, 2010\n1676 N. Longden et al.: Estimating the OCB\nFig. 11. Polar cap areas estimated from IMAGE FUV auroral\nboundaries on the 1 February 2001 between 00:00 and 06:00 UT.\nPanel (a) shows the PCA estimates derived from auroral boundaries\nobtained using the method outlined in this paper. The areas are cal-\nculated from boundaries estimated from single and double Gaussian\nfits to intensity profiles from the best combination of all three IM-\nAGE FUV cameras (solid red line), from boundaries obtained from\nsingle Gaussian fits to intensity profiles from the best combination\nof all three cameras (dashed yellow line), and from boundaries ob-\ntained from single Gaussian fits to intensity profiles from the WIC\ncamera only (solid blue line). Correction offset values have been\napplied to these auroral boundaries. Panel (b) shows the relative\ndifference in PCA estimated from boundaries from single Gaussian\nfits from all three FUV cameras (yellow diamonds), and boundaries\nfrom single Gaussian fits from the WIC camera (blue diamonds)\nwith respect to area estimates from boundaries derived from both\nsingle and double Gaussian fits to intensity profiles from all three\nFUV cameras. Vertical dashed black lines indicate times of sub-\nstorm onset from the list outlined in Frey et al. (2004).\noval undergoes contraction, fewer PCA estimates exist when\nOCBs are derived from fits of a single Gaussian function\nonly. Again, the PCA estimates made from single Gaussian\nfits only (methods 1 and 2) are frequently substantially differ-\nent to those from the combined single and double Gaussian\nfits (method 3).\n6 Conclusions\nBuilding on the strengths of previous techniques (e.g. Car-\nbary et al., 2003; Mende et al., 2003; Boakes et al., 2008;\nGjerloev et al., 2008), we have developed a new, more gen-\neral, method for estimating the location of auroral oval lu-\nminosity boundaries. This technique is fully automated, re-\nquiring no prior knowledge of geomagnetic conditions, and\ncan be used to estimate auroral luminosity boundaries dur-\ning all levels of auroral activity. A case study and statistical\nanalysis demonstrate that the accuracy of auroral luminosity\nboundary locations can be improved by modelling latitudi-\nnal profiles of auroral luminosity intensity as either a single\nor double Gaussian function compared to modelling these\nprofiles as a single Gaussian function alone. We have identi-\nfied that a significant percentage of intensity profiles exhibit\na degree of bifurcation, with up to 35% of WIC profiles in\nnightside MLTs being better modelled by a double Gaussian\nform, and over 50% during high geomagnetic activity. Fol-\nlowing the techniques of Carbary et al. (2003) and Boakes\net al. (2008), we have derived systematic correction values\nto improve our PALBs as a proxy for the OCB. By applying\nour technique to a large number of IMAGE FUV images, we\nhave produced a substantial database of OCB location esti-\nmates. From the case study of a single storm event where bi-\nfurcation is present in the auroral oval, we have demonstrated\nhow these OCB proxies can be used to calculate the PCA and\nshown that the technique used to derive PALBs from mod-\nels of a single Gaussian function can produce significantly\ndifferent PCA estimates than those implementing combined\nsingle and double Gaussian modelling. These differences,\ncoupled with the number of successfully estimated PALBs\nfrom fits in the form of Fd(λ), could have implications for\nstudies where changes in the PCA are used as a proxy for\nthe rate of magnetic reconnection during storm or substorm\nactivity. The dataset that we have compiled opens up the op-\nportunity to measure the rate of reconnection across an un-\nprecedented range of temporal and spatial scales. The auro-\nral boundaries that we have derived from IMAGE data using\nthe technique outlined in this paper are available to down-\nload at www.antarctica.ac.uk\/bas research\/our research\/az\/\nmagnetic reconnection\/auroral boundary data.html\nAcknowledgements. NL is supported by the UK Science and Tech-\nnology Facilities Council grant PP\/E002110\/1. GC and MPF\nare supported by the UK Natural Environment Research Council\nthrough the Complexity workpackage of the BAS Environmental\nChange and Evolution Programme. The authors would like to thank\nthe NASA Space Physics Data Facility and National Space Science\nData Centre, and the IMAGE FUV team for data usage, process-\ning tools, and advice. The authors would also like to thank Pe-\nter Boakes for useful conversations and the Radio Space Plasma\nPhysics group at Leicester University for assistance with data ac-\nquisition. NORSTAR 630 nm MSP data were obtained from the\nCanadian Space Science Data Portal.\nTopical Editor I. A. Daglis thanks J. Wanliss and J. Baker for\ntheir help in evaluating this paper.\nReferences\nAkasofu, S.-I. and Kimball, D.: Auroral morphology as shown by\nall-sky photographs: Arctic and Antarctic, Annals of the Interna-\ntional Geophysical Year, 38, 1965.\nBaker, J., Clauer, C., Ridley, A., Papitashvili, V., Brittnacher, M.,\nand Newell, P.: The nightside poleward boundary of the auroral\noval as seen by DMSP and the Ultraviolet Imager, J. Geophys.\nRes., 105, 21267–21280, 2000.\nAnn. Geophys., 28, 1659–1678, 2010 www.ann-geophys.net\/28\/1659\/2010\/\nN. Longden et al.: Estimating the OCB 1677\nBaker, K. and Wing, S.: A new magnetic coordinate system for\nconjugate studies at high latitudes, J. Geophys. Res., 94, 9139–\n9143, 1989.\nBaker, K., Dudeney, J., Greenwald, R., Pinnock, M., Newell, P.,\nRoger, A., Mattin, N., and Meng, C.-I.: HF radar signatures of\nthe cusp and low-latitude boundary layer, J. Geophys. Res., 100,\n7671–7695, 1995.\nBaker, K., Rodger, A., and Lu, G.: HF-radar observations of the\ndayside magnetic merging rate: A Geospace Environment Mod-\neling boundary layer campaign study, J. Geophys. Res., 102,\n9603–9617, 1997.\nBlanchard, G., Lyons, L., Samson, J., and Rich, F.: Locating the po-\nlar cap boundary from observations of 6300A˚ auroral emission,\nJ. Geophys. Res., 100, 7855–7862, 1995.\nBoakes, P. D., Milan, S. E., Abel, G. A., Freeman, M. P., Chisham,\nG., Hubert, B., and Sotirelis, T.: On the use of IMAGE FUV\nfor estimating the latitude of the open\/closed magnetic field line\nboundary in the ionosphere, Ann. Geophys., 26, 2759–2769,\ndoi:10.5194\/angeo-26-2759-2008, 2008.\nBrittnacher, M., Fillingim, M., and Parks, G.: Polar cap area\nand boundary motion during substorms, J. Geophys. Res., 104,\n12251–12262, 1999.\nBurch, J.: IMAGE mission overview, Space Sci. Rev., 91, 1–14,\n2000.\nCarbary, J., Sotirelis, T., Newell, P., and Meng, C.-I.: Auroral\nboundary correlations between UVI and DMSP, J. Geophys.\nRes., 108, 1018, doi:10.1029\/2002JA009378, 2003.\nChisham, G. and Freeman, M. P.: A technique for accurately\ndetermining the cusp-region polar cap boundary using Super-\nDARN HF radar measurements, Ann. Geophys., 21, 983–996,\ndoi:10.5194\/angeo-21-983-2003, 2003.\nChisham, G., Pinnock, M., and Rodger, A.: The response of the HF\nradar spectral width boundary to a switch in the IMF By direc-\ntion: Ionospheric consequences of transient dayside reconnec-\ntion?, J. Geophys. Res., 106, 191–202, 2001.\nChisham, G., Pinnock, M., Coleman, I. J., Hairston, M. R., and\nWalker, A. D. M.: An unusual geometry of the ionospheric\nsignature of the cusp: implications for magnetopause merg-\ning sites, Ann. Geophys., 20, 29–40, doi:10.5194\/angeo-20-29-\n2002, 2002.\nChisham, G., Freeman, M. P., Coleman, I. J., Pinnock, M.,\nHairston, M. R., Lester, M., and Sofko, G.: Measuring the\ndayside reconnection rate during an interval of due northward\ninterplanetary magnetic field, Ann. Geophys., 22, 4243–4258,\ndoi:10.5194\/angeo-22-4243-2004, 2004.\nChisham, G., Freeman, M., Abel, G., Lam, M., Pinnock, M., Cole-\nman, I., Milan, S., Lester, M., Bristow, W., Greenwald, R.,\nSofko, G., and Villain, J.-P.: Remote sensing of the spatial and\ntemporal structure of the magnetopause and magnetotail recon-\nnection from the ionosphere, Rev. Geophys., 46, RG1004, doi:\n10.1029\/2007RG000223, 2008.\nDeJong, A. D., Cai, X., Clauer, R. C., and Spann, J. F.:\nAurora and open magnetic flux during isolated substorms,\nsawteeth, and SMC events, Ann. Geophys., 25, 1865–1876,\ndoi:10.5194\/angeo-25-1865-2007, 2007.\nElphinstone, R., Jankowska, K., Murphree, J., and Cogger, L.: The\nconfiguration of the auroral distribution for interplanetary mag-\nnetic field BZ northward. 1. IMF Bx and By dependencies as ob-\nserved by the Viking satellite, J. Geophys. Res., 95, 5791–5804,\n1990.\nElphinstone, R., Hearn, D., Cogger, L., Murphree, J., Wright, A.,\nSandahl, I., Ohtani, S., Neweel, P., Klumpar, D., Shapsak, M.,\nPotemra, T., Mursula, K., and Sauvaud, J.: The double oval UV\nauroral distribution. 2. The most poleward arc system and the dy-\nnamics of the magnetotail, J. Geophys. Res., 100, 12093–12102,\n1995a.\nElphinstone, R., Murphree, J., Hearn, D., Cogger, L., Sandahl, I.,\nNewell, P., Klumpar, D., Ohtani, S., Sauvaud, J., Potemra, T.,\nMursula, K., Wright, A., and Shapshak, M.: The double oval UV\nauroral distribution. 1. Implications for the mapping of auroral\narcs, J. Geophys. Res., 100, 12075–12092, 1995b.\nFeldstein, Y. and Galperin, Y. I.: The auroral luminosity structure\nin the high-latitude upper atmosphere: its dynamics and relation-\nship to the large-scale structure of the Earth’s magnetosphere,\nRev. Geophys., 23, 217–275, 1985.\nFrey, H.: Localized aurora beyond the auroral oval, Rev. Geophys.,\n45, RG1003, doi:10.1029\/2005RG000174, 2007.\nFrey, H. and Mende, S.: Substorm onsets as observed by IMAGE-\nFUV, in: Proceedings of the Eigth International Conference on\nSubstorms (ICS-8), edited by: Syrja¨suo, M. and Donovan, E. F.,\nUniversity of Calgaray, Alberta, Canada, 71–75, 2006.\nFrey, H., Mende, S., and Angelopoulos, V.: Substorm onset obser-\nvations by IMAGE-FUV, J. Geophys. Res., 109, A10304, doi:\n10.1029\/2004JA010607, 2004.\nGibson, W., Burch, J., Scherrer, J., Tapley, M., Killough, R., Volpe,\nF., Davis, W., Vaccarello, D., Grismore, G., Sakkas, D., and\nHousten, S.: The IMAGE observatory, Space Sci. Rev., 91, 15–\n50, 2000.\nGjerloev, J., Hoffman, R., Sigwarth, J., and Frank, L.: Statistical\ndescription of the bulge-type auroal substorm in the far ultravio-\nlet, J. Geophys. Res., 112, A07213, doi:10.1029\/2006JA012189,\n2007.\nGjerloev, J., Hoffman, R., Sigwarth, J., Frank, L., and Baker, J.:\nTypical auroral substorm: A bifurcated oval, J. Geophys. Res.,\n113, A03211, doi:10.1029\/2007JA012431, 2008.\nHardy, D., Schmitt, L., Gussenhoveann, M., Marshall, F., Yeh,\nH., Schumaker, T., Huber, A., and Pantazis, J.: Precipitating\nelectron and ion detectors (SSJ\/4) for the block 5D\/flights 6-10\nDMSP satellites: Calibration and data presentation, in: Environ-\nmental Research Papers, 902, Air Force Geophysics Laboratory,\nHanscom Air Force Base, MA, 1984.\nHoffman, R. A., Gjerloev, J. W., Frank, L. A., and Sigwarth,\nJ. W.: Are there optical differences between storm-time sub-\nstorms and isolated substorms?, Ann. Geophys., 28, 1183–1198,\ndoi:10.5194\/angeo-28-1183-2010, 2010.\nHubert, B., Miolan, S., Grocott, A., Blockx, C., Cowley, S., and\nGe´rard, J.-C.: Dayside and nightside reconnection rates inferred\nfrom IMAGE FUV and Super Dual Auroral Radar Network data,\nJ. Geophys. Res., 111, A03217, doi:10.1029\/2005JA011140,\n2006.\nIijima, T. and Potemra, T.: Large-scale characteristics of field-\naligned currents associated with substorms, J. Geophys. Res., 83,\n599–615, 1978.\nImmel, T., Craven, J., and Nicholas, A.: An empiracal model of the\nOI FUV dayglow from DE-1 images, J. Atmos. Sol.-Terr. Phy.,\n62, 47–64, 2000.\nKauristie, K., Weygand, J., Pulkkinen, T., Murphree, J., and Newell,\nP.: Size of the auroral oval: UV ovals and precipitation bound-\nwww.ann-geophys.net\/28\/1659\/2010\/ Ann. Geophys., 28, 1659–1678, 2010\n1678 N. Longden et al.: Estimating the OCB\naries compared, J. Geophys. Res., 104, 2321–2331, 1999.\nMakita, K. and Meng, C.-I.: Average electron precipitation patterns\nand visual aurora characteristics during geomagnetic quiescence,\nJ. Geophys. Res., 89, 2861–2872, 1984.\nMakita, K., Meng, C.-I., and Akasofu, S.-I.: The shift of the auroral\nelectron precipitation boundaries in the dusk-dawn sector in as-\nsociation with geomagnetic activity and interplanetary magnetic\nfield, J. Geophys. Res., 88, 7967–7981, 1983.\nMeier, R.: Ultraviolet spectroscopy and remote sensing of the upper\natmosphere, Space Sci. Rev., 58, 1–185, 1991.\nMende, S., Heetderks, H., Frey, H., Lampton, M., Geller, S., Abiad,\nR., Siegmund, O., Tremsin, A., Spann, J., Dougani, H., Fuselier,\nS., Magoncelli, A., Bumala, M., Murphree, S., and Trondsen, T.:\nFar ultraviolet imaging from the IMAGE spacecraft. 2. Wideband\nFUV imaging, Space Sci. Rev., 91, 271–285, 2000a.\nMende, S., Heetderks, H., Frey, H., Lampton, M., Geller, S.,\nHabraken, S., Renotte, E., Jamar, C., Rochus, P., Spann, J., Fuse-\nlier, S., Gerard, J.-C., Gladstone, R., Murphree, S., and Cogger,\nL.: Far ultraviolet imaging from the IMAGE spacecraft. 1. Sys-\ntem design, Space Sci. Rev., 91, 243–270, 2000b.\nMende, S., Heetderks, H., Frey, H., Stock, J., Lampton, M., Geller,\nS., Abiad, R., Siegmund, O., Habraken, S., Renotte, E., Jamar,\nC., Rochus, P., Gerard, J.-C., Sigler, R., and Lauche, H.: Far ul-\ntraviolet imaging from the IMAGE spacecraft. 3. Spectral imag-\ning of the Lyman-α and OI 135.6 nm, Space Sci. Rev., 91, 287–\n318, 2000c.\nMende, S., Frey, H., Morsony, B., and Immel, T.: Statistical be-\nhaviour of proton and electron auroras during substorms, J. Geo-\nphys. Res., 108, 1339, doi:10.1029\/2002JA009751, 2003.\nMeurant, M., Ge´rard, J.-C., Hubert, B., Coumans, V., Blockx, C.,\nØstgaard, N., and Mende, S.: Dynamics of global scale electron\nand proton precipitation induced by a solar wind pressure pulse,\nGeophys. Res. Lett., 30, 2032, doi:10.1029\/2003GL018017,\n2003.\nMilan, S. E. and Lester, M.: A classification of spectral popula-\ntions observed in HF radar backscatter from the E region auroral\nelectrojets, Ann. Geophys., 19, 189–204, doi:10.5194\/angeo-19-\n189-2001, 2001.\nMilan, S. E., Lester, M., Cowley, S. W. H., Moen, J., Sandholt, P.\nE., and Owen, C. J.: Meridian-scanning photometer, coherent HF\nradar, and magnetometer observations of the cusp: a case study,\nAnn. Geophys., 17, 159–172, doi:10.1007\/s00585-999-0159-5,\n1999.\nMilan, S. E., Lester, M., Cowley, S. W. H., Oksavik, K., Brittnacher,\nM., Greenwald, R. A., Sofko, G., and Villain, J.-P.: Variations in\nthe polar cap area during two substorm cycles, Ann. Geophys.,\n21, 1121–1140, doi:10.5194\/angeo-21-1121-2003, 2003.\nMishin, V.: The magnetogram inversion technique and some appli-\ncations, Space Sci. Rev., 53, 83–163, 1990.\nMishin, V., Bazarzhapov, A., Saifudinova, T., Lunyushkin, S., Shi-\nrapov, S. S., Woch, J., Eliasson, L., Opgenoorth, H., and Mur-\nphree, J.: Different methods to determine the polar cap area, J.\nGeomagn. Geoelectr., 44, 1207–1214, 1992.\nNewell, P., Burke, W., Sa´nchez, E., Meng, C.-I., Greenspan, M., and\nClauer, C.: The low-latitude boundary layer and the boundary\nplasma sheet at low altitude: Prenoon precipitation regions and\nconvection reversal boundaries, J. Geophys. Res., 96, 21013–\n21023, 1991.\nNewell, P., Feldstein, Y., Galperin, Y., and Meng, C.-I.: Morphol-\nogy of nightside precipitation, J. Geophys. Res., 101, 10737–\n10748, 1996.\nNewell, P., Xu, D., Meng, C.-I., and Kivelson, M.: Dynamical polar\ncap: A unifying approach, J. Geophys. Res., 102, 127–139, 1997.\nNewell, P., Liou, K., and Wilson, G.: Polar cap particle precipita-\ntion and aurora: Review and commentary, J. Atmos. Solar-Terr.\nPhys., 71, 199–215, doi:10.1016\/j.jastp.2009.11.004, 2009.\nPinnock, M., Chisham, G., Coleman, I. J., Freeman, M. P., Hairston,\nM., and Villain, J.-P.: The location and rate of dayside recon-\nnection during an interval of southward interplanetary magnetic\nfield, Ann. Geophys., 21, 1467–1482, doi:10.5194\/angeo-21-\n1467-2003, 2003.\nPress, W., Teukolsky, S., Vetterling, W., and Flannery, B.: Numer-\nical Recipes in C. The Art of Scientific Computing, Cambridge\nUniversity Press, 2nd edn., 1992.\nSandholt, P., Farrugia, C., Øieroset, M., Stauning, P., and Denig,\nW.: Auroral activity associated with unsteady magnetospheric\nerosion: Observations on December 18, 1990, J. Geophys. Res.,\n103, 2309–2317, 1998.\nSiscoe, G. and Huang, T.: Polar cap inflation and deflation, J. Geo-\nphys. Res., 90, 543–547, 1985.\nSotirelis, T. and Newell, P.: Boundary-oriented electron precipita-\ntion model, J. Geophys. Res., 105, 18655–18673, 2000.\nVampola, A.: Access of solar electrons to closed field lines, J. Geo-\nphys. Res., 76, 36–43, 1971.\nAnn. Geophys., 28, 1659–1678, 2010 www.ann-geophys.net\/28\/1659\/2010\/\n"}