{"doi":"10.1063\/1.3647577","coreId":"140843","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/6521","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/6521","10.1063\/1.3647577"],"title":"Nanosecond-range imprint and retention characterized from polarization-voltage\nhysteresis loops in insulating or leaky ferroelectric thin films","authors":["Jiang, A. Q.","Liu, X. B.","Zhang, Qi"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-10-03T00:00:00Z","abstract":"We transferred ferroelectric domain switching currents under pulses into\npolarization-voltage (P-V) hysteresis loops. With this transformation, it is\npossible to derive the remanent polarization and coercive voltage from domain\nswitching currents after the shortest imprint and retention time of 35 ns. After\nthe separation of film leakage current from domain switching current, we\nmeasured the P-V hysteresis loop in a semiconducting BiFeO3 leaky thin film,\nwhere the apparent coercive field highly reaches 320 kV\/cm2, suggestive of a\ndifferent domain switching mechanism from other insulators. This technique\nfacilitates nanosecond-range measurements of both ferroelectric capacitive and\nresistive memories","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140843.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1063\/1.3647577","pdfHashValue":"d3e175f1a0f8e9208809a991160a568c51dd29a0","publisher":"American Institute of Physics","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/6521<\/identifier><datestamp>2011-10-31T14:23:33Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Nanosecond-range imprint and retention characterized from polarization-voltage\nhysteresis loops in insulating or leaky ferroelectric thin films<\/dc:title><dc:creator>Jiang, A. Q.<\/dc:creator><dc:creator>Liu, X. B.<\/dc:creator><dc:creator>Zhang, Qi<\/dc:creator><dc:description>We transferred ferroelectric domain switching currents under pulses into\npolarization-voltage (P-V) hysteresis loops. With this transformation, it is\npossible to derive the remanent polarization and coercive voltage from domain\nswitching currents after the shortest imprint and retention time of 35 ns. After\nthe separation of film leakage current from domain switching current, we\nmeasured the P-V hysteresis loop in a semiconducting BiFeO3 leaky thin film,\nwhere the apparent coercive field highly reaches 320 kV\/cm2, suggestive of a\ndifferent domain switching mechanism from other insulators. This technique\nfacilitates nanosecond-range measurements of both ferroelectric capacitive and\nresistive memories.<\/dc:description><dc:publisher>American Institute of Physics<\/dc:publisher><dc:date>2011-10-24T23:03:13Z<\/dc:date><dc:date>2011-10-24T23:03:13Z<\/dc:date><dc:date>2011-10-03T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>A. Q. Jiang, X. B. Liu, and Q. Zhang, Nanosecond-range imprint and retention characterized from polarization-voltage\nhysteresis loops in insulating or leaky ferroelectric thin films, Applied Physics Letters, Volume 99, Issue 14, 2011, Paper Number 142905.<\/dc:identifier><dc:identifier>0003-6951<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1063\/1.3647577<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/6521<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0003-6951","0003-6951"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2011,"topics":[],"subject":["Article"],"fullText":"Nanosecond-range imprint and retention characterized from polarization-\nvoltage hysteresis loops in insulating or leaky ferroelectric thin films\nA. Q. Jiang,1,a) X. B. Liu,1 and Q. Zhang2\n1State Key Laboratory of ASIC & System, Department of Microelectronics, Fudan University,\nShanghai 200433, China\n2Department of Materials, Cranfield University, Cranfield, Bedfordshire, MK43 0AL, United Kingdom\n(Received 22 August 2011; accepted 17 September 2011; published online 6 October 2011)\nWe transferred ferroelectric domain switching currents under pulses into polarization-voltage (P-V)\nhysteresis loops. With this transformation, it is possible to derive the remanent polarization and\ncoercive voltage from domain switching currents after the shortest imprint and retention time of\n35 ns. After the separation of film leakage current from domain switching current, we measured the\nP-V hysteresis loop in a semiconducting BiFeO3 leaky thin film, where the apparent coercive field\nhighly reaches 320 kV\/cm2, suggestive of a different domain switching mechanism from other\ninsulators. This technique facilitates nanosecond-range measurements of both ferroelectric\ncapacitive and resistive memories.VC 2011 American Institute of Physics. [doi:10.1063\/1.3647577]\nNonvolatile ferroelectric random access memories make\nuse of two switchable remnant polarization states of the\nmaterials to store binary information, which have advantages\nof low writing voltage, fast writing speed, and high endur-\nance.1,2 Beyond the destructive readout of the information\nfrom capacitive ferroelectric memories,3 the nondestructive\nreadout is possible from high- and low-conductance bipolar\nswitching of ferroelectric resistive memories upon polariza-\ntion reversal.4–6 However, the present commercial ferroelec-\ntric testers measure polarization-voltage (P-V) hysteresis\nloops with a modified Sawyer-Tower circuit by applying a\ntriangular\/sinusoidal wave below 1MHz to an insulating thin\nfilm, which is different from memory writing\/reading pulses\nwith duration below 50 ns.3 Additionally, this technique is\nunable to differentiate the leakage current from the displace-\nment current and, thus, unsuitable for the leaky film charac-\nterization. From pulse measurements, it is possible to\nseparate the two currents and interweave the whole P-V loop\nfrom integrations of switching currents under many pulses in\nstep-by-step increase of the voltage,4 which is nevertheless\nunsuitable for the fast reliability tests. Due to this considera-\ntion, it is necessary to transfer a positive\/negative switching\ncurrent into a P-V hysteresis loop directly from which both\nthe remanent polarization (Pr) and coercive voltage (Vc) can\nbe predicted.\nInsulating Pb(Zr0.4Ti0.6)O3 (PZT) thin films were pre-\npared using sol-gel spin coating on IrO2\/Pt\/TiO2\/SiO2\/Si sub-\nstrates with the thickness of 140 nm. Pt\/IrO2 top electrodes\nwere sputtered on the films integrated into squares with side\nlengths of 1-200lm. For the extraction of P-V hysteresis\nloops in leaky films, oxygen-deficient (001) BiFeO3 (BFO)\nsemiconducting films with the thickness of 270 nm were de-\nposited on (100) SrTiO3 substrates at 650\n\u0002C with the SrRuO3\nbottom electrode using pulsed laser deposition at the O2 pres-\nsure of 10 Pa.4 Function-step voltage pulses with rising times\nof 5-7.5 ns were supplied by Agilent 33250A\/81150A pulse\ngenerators. Domain switching current Isw with time t under\nthe pulse was monitored by an LC 6200A oscilloscope in se-\nries with a ferroelectric capacitor Cf. The total internal resist-\nance of the pulse generator and oscilloscope is Rt¼ 100 X.\nThere is a reference capacitor Cref (\u0003 Cf) input in the\nSawyer-Tower circuit in the characterization of P-V loops\nunder a triangular\/sinusoidal wave. However, the characteri-\nzation can be much faster if Cref is replaced by Rt, as shown\nin the upper panel of Fig. 1. The voltage VR across Rt is\nguarded by an oscilloscope with Isw(t)¼VR(t)\/Rt. Figure 1(a)\nshows VR(t) for PZT with the electrode area of S¼ 4\u0004 10\u00056\ncm2 under bipolar pulses of V(t) with the width of 30 ns,\nwhere we observed two peaks of positive and negative do-\nmain switching.7 From the voltage of Vf(t)¼V(t)\u0005VR(t)\nacross Cf and the polarization compensation charge of\nFIG. 1. (Color online) (a) The input pulse and voltage transient across Rt\nfrom the pulse measurement for PZT. (b) The transferred P-V hysteresis\nloop from domain switching currents. The upper panel shows the equivalent\ncircuit description of Sawyer-Tower and pulse measurements.\na)Author to whom correspondence should be addressed. Electronic mail:\naqjiang@fudan.edu.cn.\n0003-6951\/2011\/99(14)\/142905\/3\/$30.00 VC 2011 American Institute of Physics99, 142905-1\nAPPLIED PHYSICS LETTERS 99, 142905 (2011)\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/apl.aip.org\/apl\/copyright.jsp\nPf ðtÞ ¼\nÐ t\n0\nVRðtÞ\nSRt\ndt across Rt, we can transfer the two currents\ninto a Pf\u0005Vf hysteresis loop, as shown in Fig. 1(b).\nFor the integrated high-density memory, domain switch-\ning time decreases with the shrinkage of the capacitor area,8\nas shown in Fig. 2. In contrast, Vc is no longer constant,\nwhich otherwise enhances with the area reduction. This is\ndue to the fastened domain switching speed; the higher the\ndomain switching speed, the larger the coercive voltage.9\nThe speed is believed to be proportional to the domain\nswitching current density of Jsw¼ (V \u0005 Vc)\/(RtS), which is\nlargely adjustable through S spanning several orders of mag-\nnitude here.\nThe P-V hysteresis loop shifts positively\/negatively with\ntime along the voltage axis after a negative\/positive preset-\nting pulse (imprint).10,11 The imprint is induced through the\ninterfacial-layer charge injection between the film and the\nelectrodes to build up an internal field, which is temporally\nuncompensated after polarization reversal and described by a\nsemilogarithmic time dependence above an initial time t0 on\nthe order of several tens of seconds.10 Below t0, the Vc shift\nis believed to be weak. However, with our improved meas-\nurements, we can largely shorten the imprint time into 35 ns,\nas shown in Fig. 3(a), where the semilogarithmic time de-\npendence for the positive\/negative coercive voltage (6Vc)\npertains true without the above t0 limit, as shown by the\nsolid-line fitting of the data. Meanwhile, we can measure the\nnanosecond-range ferroelectric depolarization, much faster\nthan the time of seconds examined from the previous piezor-\nesponse force microscopy,12 as shown in Fig. 3(b). j\u0005Prj\ndecays exponentially with time, as shown by the solid-line\nfitting of the data, seemly like the interfacial-layer capacitor\ndischarging until the depolarization field across the ferro-\nelectric layer is smaller than the coercive field.8\nIf ferroelectric thin films are leaky for the resistive\nmemories, Isw(t) will show a leakage current level of IL= 0\nafter completion of domain switching in Fig. 4(a) (in solid\nlines). From a least-squares cubic polynomial fit of the\nVf \u0005 IL dependence and the relationship of Vf(t)¼V (t)\n– IL(t)Rt, we can calculate IL(V(t)).\n4 After subtraction of\nIL(Vf(t)) from Isw(t), we obtained the domain displacement\ncurrent only in Fig. 4(a) (in dashed lines), and thus the final\nPf \u0005 Vf loop with Pr¼ 61-64 lC\/cm2 in Fig. 4(b), in agree-\nment with (001) oriented BFO insulators.13\nThe square loops in Fig. 4(b) are unavailable from the\ncommercial tester (Radiant Premier II) using a modified\nSawyer-Tower circuit, as shown by the opened symbols, and\nalso different from the loop interweaved with switching cur-\nrent integrations under many pulses.4 Unlike ferroelectric\ninsulators, the coercive field here is around 320 kV\/cm at\nVf¼ 12V in Fig. 4(b), which nevertheless reduces quickly\nwith the Vf reduction. This suggests the domain switching\nmechanism in a semiconductor different from those in other\nFIG. 2. (Color online) Capacitor area dependences of domain coercive volt-\nage and switching time for PZT at V¼ 2.5V fitted by two solid lines.\nFIG. 3. (Color online) (a) Semilogarithmic time dependence of positive\/\nnegative coercive voltage for PZT after the presetting pulse sketched in the\nupper panel, where the solid lines are the best fitting of the data. (b) Expo-\nnential degradation of the remanent polarization with time fitted by the solid\nline.\nFIG. 4. (Color online) (a) Positive\/negative domain switching current tran-\nsient for BFO with an electrode area of 8.35\u0004 10\u00055 cm2 at V¼612V and\npulse width of 1000 ns before (a solid line) and after (a dashed line) leakage\ncurrent deduction, where the inset shows the voltage dependence of domain\nswitching current fitted by two solid lines. (b) The transferred P-V hysteresis\nloops from domain switching currents, where the opened symbols show the\nmeasurement from a Radiant tester at 50 kHz.\n142905-2 Jiang, Liu, and Zhang Appl. Phys. Lett. 99, 142905 (2011)\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/apl.aip.org\/apl\/copyright.jsp\ninsulators.14 Equivalent circuit description of this mechanism\ncan assume the presence of a large contact resistance Rc\nbetween the film and electrodes,15 which is only 6.2 X in\nPZT. The apparent coercive voltage in the loop consists of\nthe intrinsic coercive voltage of domain switching and the\nvoltage of IswRc across Rc, where Isw¼ (V\u0005Vc)\/(RcþRt).4,8\nFrom the linear dependence of domain switching current on\nV shown by the inset in Fig. 4(a), we got the intrinsic\n6Vc¼þ5.17V\/\u00056.74V with asymmetric Rc¼ 121 X\/183 X\nin BFO,15 in agreement with the coercive field of \u0006200 kV\/\ncm in other insulators.13\nIn conclusion, we estimated Pr and Vc after domain\nswitching current transformation into a P-V hysteresis loop\nwith pulse width as short as 30 ns. After deduction of the\nleaky current from the switching current, we extracted the P-\nV hysteresis loop in a leaky BFO thin film with domain\nswitching mechanism different from other insulators. This\ntechnique is unique and superior to traditional Sawyer-\nTower measurements for the nanosecond characterization of\nimprint and retention in either insulating or leaky thin films.\nThis work was supported by the Shanghai Key Program\n(1052nm07600) and the Program for Professor of Special\nAppointment (Eastern Scholar) at Shanghai.\n1J. F. Scott, Ferroelectric Memories (Springer, Heidelberg, Germany,\n2000), pp. 24–50.\n2H. Kohlstedt, Y. Mustafa, A. Gerber, A. Petraru, M. Fitsilis, R. Meyer, U.\nBo¨ttger, and R. Waser, Microelectron. Eng. 80, 296 (2005).\n3Y. Shimojo, A. Konno, J. Nishimura, T. Okada, Y. Yamada, S. Kitazaki,\nH. Furuhashi, S. Yamazaki, K. Yahashi, K. Tomioka, Y. Minami, H.\nKanaya, S. Shuto, K. Yamakawa, T. Ozaki, H. Shiga, T. Miyakawa, S.\nShiratake, D. Takashima, I. Kunishima, T. Hamamoto, and A. Nitayama,\nin Proceedings of the Symposium on VLSI Technology (Japan Society\nApplied Physics, Tokyo, 2009), pp. 218–219.\n4A. Q. Jiang, C. Wang, K. J. Jin, X. B. Liu, J. F. Scott, C. S. Hwang, T. A.\nTang, H. B. Lu, and G. Z. Yang, Adv. Mater. 23, 1277 (2011).\n5V. Garcia, S. Fusil, K. Bouzehouane, S. Enouz-Vedrenne, N. D. Mathur,\nA. Barthelemy, and M. Bibes, Nature 460, 81 (2009).\n6P. Maksymovych, S. Jesse, P. Yu, R. Ramesh, A. P. Baddorf, and S. V.\nKalinin, Science 324, 1421 (2009).\n7A. Gruverman, D. Wu, and J. F. Scott, Phys. Rev. Lett. 100, 097601\n(2008).\n8A. Q. Jiang, Y. Y. Lin, and T. A. Tang, J. Appl. Phys. 101, 104105 (2007).\n9A. Q. Jiang, H. J. Lee, C. S. Hwang, and J. F. Scott, “Sub-picosecond\nprocesses of ferroelectric domain switching from field and temperature\nexperiments,” Adv. Funct. Mater. (in press).\n10A. K. Tagantsev, I. Stolichnov, and N. Setter, J. Appl. Phys. 96, 6616\n(2004).\n11W. L. Warren, H. N. Al-Shareef, D. Dimos, and B. A. Tuttle, Appl. Phys.\nLett. 68, 1681 (1996).\n12C. S. Ganpule, V. Nagarajan, S. B. Ogale, A. L. Roytburd, E. D. Williams,\nand R. Ramesh, Appl. Phys. Lett. 77, 3275 (2000).\n13R. R. Das, D. M. Kim, S. H. Baek, C. B. Eom, F. Zavaliche, S. Y. Yang,\nR. Ramesh, Y. B. Chen, X. Q. Pan, X. Ke, M. S. Rzchowski, and S. K.\nStreiffer, Appl. Phys. Lett. 88, 242904 (2006).\n14P. Maksymovych, S. Jesse, M. Huijben, R. Ramesh, A. Morozovska, S.\nChoudhury, L. Q. Chen, A. P. Baddorf, and S. V. Kalinin, Phys. Rev. Lett.\n102, 017601 (2009).\n15H. J. Lee, G. H. Kim, M. H. Park, A. Q. Jiang, and C. S. Hwang, Appl.\nPhys. Lett. 96, 212902 (2010).\n142905-3 Jiang, Liu, and Zhang Appl. Phys. Lett. 99, 142905 (2011)\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}