{"doi":"10.1109\/TNS.2004.832570","coreId":"69902","oai":"oai:eprints.lancs.ac.uk:20130","identifiers":["oai:eprints.lancs.ac.uk:20130","10.1109\/TNS.2004.832570"],"title":"Development of a linear array for intracavitary in vivo dosimetry during external beam radiotherapy and brachytherapy.","authors":["Price, R. A.","Benson, C.","Joyce, Malcolm J.","Rogers, K."],"enrichments":{"references":[{"id":16319184,"title":"An audit of radiotherapy patient doses measured with in vivo semiconductor detectors,”","authors":[],"date":"1997","doi":"10.1259\/bjr.70.832.9166077","raw":"A. Adeyemi and J. Lord, “An audit of radiotherapy patient doses measured with in vivo semiconductor detectors,” Br. J. Radiol., vol. 70, no. 832, pp. 339–408, 1997.","cites":null},{"id":16319207,"title":"Anisotropically conductive adhesive flip-chip bonding on rigid and flexible printed circuit substrates,”","authors":[],"date":"1996","doi":"10.1109\/96.533908","raw":"Z. H. Lai and J. H. Liu, “Anisotropically conductive adhesive flip-chip bonding on rigid and flexible printed circuit substrates,” IEEE Trans. Comp., Packag., Manufact. Technol., pt. B, vol. 19, pp. 3–5, Mar. 1996.","cites":null},{"id":16319188,"title":"Assessment of target dose delivery in anal cancer using in vivo thermoluminescent dosimetry,”","authors":[],"date":"2001","doi":"10.1016\/s0167-8140(01)00334-6","raw":"D. C. Weber, P. Nouet, J. M. Kurtz, and A. S. Allal, “Assessment of target dose delivery in anal cancer using in vivo thermoluminescent dosimetry,” Radiother. Oncol., vol. 59, no. 1, pp. 39–43, 2001.","cites":null},{"id":16319164,"title":"Calculation of the uncertainty in the dose delivered during radiation therapy,”","authors":[],"date":"1985","doi":"10.1118\/1.595762","raw":"M. Goitein, “Calculation of the uncertainty in the dose delivered during radiation therapy,” Med. Phys., vol. 12, no. 5, pp. 602–612, 1985.","cites":null},{"id":16319211,"title":"Characterization and reliability study of anisotropic conductive adhesives for fine-pitch package assembly,”","authors":[],"date":"1995","doi":"10.1142\/s0960313195000025","raw":"F. Stam, P. O’Grady, and J. Barrett, “Characterization and reliability study of anisotropic conductive adhesives for fine-pitch package assembly,” J. Electron. Manufact., vol. 5, no. 1, pp. 1–8, 1995.","cites":null},{"id":16319189,"title":"Characterization of radiation response of 400 nm implanted gate oxide","authors":[],"date":"2002","doi":"10.1109\/miel.2002.1003360","raw":"A. Jaksic, G. Ristic, M. Pejovic, A. Mohammadzadeh, and W. Lane, “Characterization of radiation response of 400 nm implanted gate oxide RadFET,” Met. Sci. Eng. B-Solid, vol. 89, pp. 1–3, 2002.","cites":null},{"id":16319176,"title":"Comprehensive QA for radiation oncology report 40 of AAPMradiation therapycommitteetask group40,”Med.","authors":[],"date":"1994","doi":null,"raw":"G. J. Kutcher, L. Coia, M. Gillin, W. F. Hanson, S. Leibel, and R. J. Morton et al., “Comprehensive QA for radiation oncology report 40 of AAPMradiation therapycommitteetask group40,”Med. Phys.,vol.21, no. 4, pp. 581–618, 1994.","cites":null},{"id":16319217,"title":"Development of a calibration facility for test instrumentation in diagnostic radiology,” Rad.","authors":[],"date":"1996","doi":"10.1093\/oxfordjournals.rpd.a031795","raw":"S. Greene, J. E. Palethorpe, D. E. Peach, and D. A. Bradley, “Development of a calibration facility for test instrumentation in diagnostic radiology,” Rad. Proc. Dosim., vol. 67, no. 1, pp. 41–46, 1996.","cites":null},{"id":16319221,"title":"Dose response of various radiation detectors to synchrotron radiation,”","authors":[],"date":null,"doi":"10.1088\/0031-9155\/43\/11\/006","raw":"T. Kron, L. Duggan, T. Smith, A. Rosenfeld, M. Buston, and G. Kaplan et al., “Dose response of various radiation detectors to synchrotron radiation,” Phys. Med. Biol., vol. 43, no. 11, pp. 3235–3259.","cites":null},{"id":16319162,"title":"Dosimetric precision requirements in radiation therapy,”","authors":[],"date":"1984","doi":"10.3109\/02841868409136037","raw":"A. Brahme, “Dosimetric precision requirements in radiation therapy,” Acta Radiol. Oncol., vol. 23, no. 5, pp. 379–391, 1984.","cites":null},{"id":16319160,"title":"Eds., “Physics Aspects of Quality Control in Radiotherapy,”,","authors":[],"date":"1999","doi":null,"raw":"W. P. H. Mayles, R. Lake, A. Mcenzie, E. M. Macaulay, H. M. Morgan, T. J. Jordan, and S. K. Powel, Eds., “Physics Aspects of Quality Control in Radiotherapy,”, IPEM Rep. no. 81, 1999.","cites":null},{"id":16319224,"title":"Effects of packaging geometry, materials and die design on energy-dependence of PMOS dosimeters,”","authors":[],"date":"1995","doi":"10.1109\/23.364879","raw":"G. J. Brukner, S. Kronenberg, and F. Gentner, “Effects of packaging geometry, materials and die design on energy-dependence of PMOS dosimeters,” IEEE Trans. Nucl. Sci, vol. 42, pp. 33–40, Feb. 1995.","cites":null},{"id":16319193,"title":"Evaluation of a dual bias dual metal oxide-silicon semiconductor field effect transistor as a radiation dosimeter,”","authors":[],"date":"1994","doi":"10.1118\/1.597314","raw":"M. Soubra, J. Cygler, and G. Mackay, “Evaluation of a dual bias dual metal oxide-silicon semiconductor field effect transistor as a radiation dosimeter,” Med. Phys., vol. 21, no. 4, pp. 567–572, 1994.","cites":null},{"id":16319157,"title":"Guide to the Expression of Uncertainty","authors":[],"date":"1995","doi":"10.1017\/cbo9781139135085.018","raw":"Guide to the Expression of Uncertainty in Measurement, International Organization for Standardization (ISO), Geneva, 1995.","cites":null},{"id":16319180,"title":"Handbook of Radiation Effects, 2nd ed.,","authors":[],"date":"2002","doi":null,"raw":"Handbook of Radiation Effects, 2nd ed., Oxford Univ. Press, Oxford, U.K., 2002.","cites":null},{"id":16319173,"title":"Health protection of individuals against the dangers of ionising radiations in relation to medical exposures,”","authors":[],"date":"1997","doi":"10.1093\/oxfordjournals.rpd.a032482","raw":"“Health protection of individuals against the dangers of ionising radiations in relation to medical exposures,” Official J. Eur. Community, vol. L180\/22, 1997.","cites":null},{"id":16319185,"title":"Importance of in vivo dosimetry as part of a quality assurance program in tangential breast treatments,”","authors":[],"date":"1994","doi":"10.1016\/0360-3016(94)90169-4","raw":"G. Leunens, J. Van Dam, A. Dutreix, and E. van der Schueren, “Importance of in vivo dosimetry as part of a quality assurance program in tangential breast treatments,” Int. J. Rad. Oncol. Biol. Phys., vol. 28, no. 1, pp. 285–296, 1994.","cites":null},{"id":16319171,"title":"In vivo dosimetry by diode semiconductors in combination with portal films during TBI: Reporting on a 5-year clinical experience,”","authors":[],"date":"1999","doi":"10.1016\/s0167-8140(99)00104-8","raw":"P. Mangili, C. Fiorino, A. Rosso, G. M. Cataneo, R. Parisi, E. Villa, and R. Calandrino, “In vivo dosimetry by diode semiconductors in combination with portal films during TBI: Reporting on a 5-year clinical experience,” Radiother. Oncol., vol. 52, no. 3, pp. 269–276, 1999.","cites":null},{"id":16319168,"title":"In vivo dosimetry during conformal radiotherapy, requirements for and findings of a routine procedure,”","authors":[],"date":"1999","doi":"10.1016\/s0167-8140(99)00074-2","raw":"J. H. Lanson, M. Essers, G. J. Meijnheer, A. W. H. Minken, G. J. Uiterwaal, and B. J. Mijnheer, “In vivo dosimetry during conformal radiotherapy, requirements for and findings of a routine procedure,” Radiother. Oncol., vol. 52, no. 1, pp. 144–151, 1999.","cites":null},{"id":16319166,"title":"In vivo dosimetry during external photon beam radiotherapy,”","authors":[],"date":"1999","doi":"10.1016\/s0360-3016(98)00341-1","raw":"M. Essers and B. J. Mijnheer, “In vivo dosimetry during external photon beam radiotherapy,” Int. J. Radiation Oncology Biol. Phys., vol. 43, no. 2, pp. 245–259, 1999.","cites":null},{"id":16319186,"title":"In vivo dosimetry for tangential breast irradiation: role of the equipment in the accuracy of dose delivery,”","authors":[],"date":"1991","doi":"10.1016\/0167-8140(91)90164-c","raw":"G. Leunens, J. Verstraete, J. van Dam, A. Dutreix, and E. van der Schueren, “In vivo dosimetry for tangential breast irradiation: role of the equipment in the accuracy of dose delivery,” Radiother. Oncol., vol. 22, no. 4, pp. 285–289, 1991.","cites":null},{"id":16319179,"title":"In vivo urethral dose measurements: a method to verify high dose rate prostate treatments,”","authors":[],"date":"2000","doi":"10.1016\/s0167-8140(00)81492-9","raw":"I. A. Brezovich, J. Duan, P. N. Pareek, J. Fiveash, and M. Ezekiel, “In vivo urethral dose measurements: a method to verify high dose rate prostate treatments,” Med. Phys., vol. 27, no. 10, pp. 2297–2302, 2000.","cites":null},{"id":16319194,"title":"Ionizing Radiation Effects in MOS Devices and Circuits.","authors":[],"date":"1989","doi":null,"raw":"T. P. Ma and P. V. Dressendorfer, Ionizing Radiation Effects in MOS Devices and Circuits. New York: Wiley, 1989.","cites":null},{"id":16319159,"title":"J.C.StroomandB.J.Heijmen,“Geometricaluncertainties,radiotherapy planning margins and the ICRU-62 report,” Radiotherapy Oncology,","authors":[],"date":"2002","doi":"10.1016\/s0167-8140(02)00140-8","raw":"J.C.StroomandB.J.Heijmen,“Geometricaluncertainties,radiotherapy planning margins and the ICRU-62 report,” Radiotherapy Oncology, vol. 64, no. 1, pp. 75–83, July 2002.","cites":null},{"id":16319227,"title":"Khivrich,“MOSFETdosimeters:theroleofencapsulationondosimetric characteristics in mixed gamma-neutron and megavoltage X-ray fields,”","authors":[],"date":"1995","doi":"10.1109\/23.489229","raw":"A. B. Rosenfeld, M. G. Carolan, G. I. Kaplan, B. J. Allen, and V. I. Khivrich,“MOSFETdosimeters:theroleofencapsulationondosimetric characteristics in mixed gamma-neutron and megavoltage X-ray fields,” IEEE Trans. Nucl. Sci., vol. 42, pp. 1870–1877, Dec. 1995.","cites":null},{"id":16319229,"title":"MOSFET dosimetry in modern radiation oncology modalities,” Rad.","authors":[],"date":"2002","doi":"10.1093\/oxfordjournals.rpd.a006009","raw":"A. B. Rosenfeld, “MOSFET dosimetry in modern radiation oncology modalities,” Rad. Proc. Dosim., vol. 101, no. 1–4, pp. 393–398, 2002. Authorized licensed use limited to: Lancaster University Library. Downloaded on December 11, 2008 at 08:24 from IEEE Xplore.  Restrictions apply.","cites":null},{"id":16319213,"title":"Novel developments in the MOSFET dosimeter for neutron dosimetry applications,” Rad Proc Dosim.,","authors":[],"date":"2004","doi":"10.1093\/rpd\/nch202","raw":"R. A. Price, C. Benson, M. J. Joyce, D. J. Kestell, and D. L. Silvie, “Novel developments in the MOSFET dosimeter for neutron dosimetry applications,” Rad Proc Dosim., 2004, to be published.","cites":null},{"id":16319190,"title":"Optimized stacked RadFET’s for micro-gray dose measurements,” in","authors":[],"date":null,"doi":null,"raw":"B. O’Connell, C. Mcarthy, and W. Lane, “Optimized stacked RadFET’s for micro-gray dose measurements,” in Proc. 5th Eur. Conf. Radiation and Its Effects on Materials (RADEC’s 99), Fontevarad, France, Sept..","cites":null},{"id":16319187,"title":"Patient dosimetry quality assurance program with a commercial diode system,”","authors":[],"date":"1994","doi":"10.1016\/0360-3016(94)90415-4","raw":"P. C. Lee, J. M. Sawicka, and G. P. Glasgow, “Patient dosimetry quality assurance program with a commercial diode system,” Int. J. Radiation Oncology Biol. Phys., vol. 29, no. 5, pp. 1175–1182, 1994.","cites":null},{"id":16319182,"title":"Quality assurance in radiotherapy by in vivo dosimetry. 1. Entrance dose measurements, a reliable procedure,”","authors":[],"date":"1990","doi":"10.1016\/0167-8140(90)90102-3","raw":"G. Leunens, J. Van Dam, A. Dutreix, and E. van der Schueren, “Quality assurance in radiotherapy by in vivo dosimetry. 1. Entrance dose measurements, a reliable procedure,” Radiother. Oncol., vol. 17, no. 2, pp. 141–151, 1990.","cites":null},{"id":16319183,"title":"Quality assurance in radiotherapy by in vivo dosimetry. 2. Determination of the target absorbed dose,”","authors":[],"date":"1990","doi":"10.1016\/0167-8140(90)90167-u","raw":", “Quality assurance in radiotherapy by in vivo dosimetry. 2. Determination of the target absorbed dose,” Radiother. Oncol., vol. 19, no. 1, pp. 73–87, 1990.","cites":null},{"id":16319199,"title":"RADFETs: a review of the use of metal-oxide-silicon devices as integrating dosimeters,”","authors":[],"date":"1986","doi":null,"raw":"A. Homes-Sieldle and L. Adams, “RADFETs: a review of the use of metal-oxide-silicon devices as integrating dosimeters,” Radiat. Phys. Chem., vol. 28, pp. 235–244, 1986. Authorized licensed use limited to: Lancaster University Library. Downloaded on December 11, 2008 at 08:24 from IEEE Xplore.  Restrictions apply.1426 IEEE TRANSACTIONS ON NUCLEAR SCIENCE, VOL. 51, NO. 4, AUGUST 2004","cites":null},{"id":16319191,"title":"Review paper: RaFET’s for improved radiation sensitivity,” in ESSDERC,","authors":[],"date":"1996","doi":null,"raw":"B. O’Connell, W. Kelleher, W. Lane, and L. Adams, “Review paper: RaFET’s for improved radiation sensitivity,” in ESSDERC, Bologna, Sept. 1996.","cites":null},{"id":16319192,"title":"Rozenfeld et al., “A new radiotherapy surface dose detector:","authors":[],"date":"1996","doi":"10.1118\/1.597702","raw":"M. J. Butson and J. N. Rozenfeld et al., “A new radiotherapy surface dose detector: the MOSFET,” Med. Phys., vol. 23, no. 5, pp. 655–658, 1996.","cites":null},{"id":16319181,"title":"Silicon Diodes as Detectors","authors":[],"date":"1983","doi":"10.3892\/or.8.1.181","raw":"G. Rikner, “Silicon Diodes as Detectors in Relative Dosimetry of Photon, Electron and Proton Radiation Fields,” Ph.D. thesis, Uppsala Univ., Uppsala, Sweden, 1983.","cites":null},{"id":16319203,"title":"The response of a MOSFET, p-type semiconductor and LiF TLD to quasimonoenergeticx-rays,”Phys.Med.Biol.,vol.42,no.12,pp.2383–2391,","authors":[],"date":"1997","doi":"10.1088\/0031-9155\/42\/12\/006","raw":"C. R. Edwards, S. Green, J. E. Palethorpe, and P. J. Mountford, “The response of a MOSFET, p-type semiconductor and LiF TLD to quasimonoenergeticx-rays,”Phys.Med.Biol.,vol.42,no.12,pp.2383–2391, 1997.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004","abstract":"We present the details of a new linear array dosimeter consisting of a chain of semiconductors mounted on an ultra-thin (50 μm thick) flexible substrate and housed in an intracavitary catheter. The semiconductors, manufactured by NMRC Cork, have not been packaging and incorporate a passivation layer that allows them to be mounted on the substrate using flip-chip-bonding. This paper reports, for the first time, the construction of a multiple (ten) detector array suited to in vivo dosimetry in the rectum, esophagus and vagina during external beam radiotherapy, as well as being adaptable to in vivo dosimetry during brachytherapy and diagnostic radiology","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69902.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/20130\/1\/getPDF3.pdf","pdfHashValue":"3e03d9d411bebb3322e9f5d04227c1e8771adcfa","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:20130<\/identifier><datestamp>\n      2018-01-24T02:34:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5441<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Development of a linear array for intracavitary in vivo dosimetry during external beam radiotherapy and brachytherapy.<\/dc:title><dc:creator>\n        Price, R. A.<\/dc:creator><dc:creator>\n        Benson, C.<\/dc:creator><dc:creator>\n        Joyce, Malcolm J.<\/dc:creator><dc:creator>\n        Rogers, K.<\/dc:creator><dc:subject>\n        TA Engineering (General). Civil engineering (General)<\/dc:subject><dc:description>\n        We present the details of a new linear array dosimeter consisting of a chain of semiconductors mounted on an ultra-thin (50 μm thick) flexible substrate and housed in an intracavitary catheter. The semiconductors, manufactured by NMRC Cork, have not been packaging and incorporate a passivation layer that allows them to be mounted on the substrate using flip-chip-bonding. This paper reports, for the first time, the construction of a multiple (ten) detector array suited to in vivo dosimetry in the rectum, esophagus and vagina during external beam radiotherapy, as well as being adaptable to in vivo dosimetry during brachytherapy and diagnostic radiology.<\/dc:description><dc:date>\n        2004<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/20130\/1\/getPDF3.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/TNS.2004.832570<\/dc:relation><dc:identifier>\n        Price, R. A. and Benson, C. and Joyce, Malcolm J. and Rogers, K. (2004) Development of a linear array for intracavitary in vivo dosimetry during external beam radiotherapy and brachytherapy. IEEE Transactions on Nuclear Science, 51 (4). pp. 1420-1426. ISSN 0018-9499<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/20130\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1109\/TNS.2004.832570","http:\/\/eprints.lancs.ac.uk\/20130\/"],"year":2004,"topics":["TA Engineering (General). Civil engineering (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"1420 IEEE TRANSACTIONS ON NUCLEAR SCIENCE, VOL. 51, NO. 4, AUGUST 2004\nDevelopment of a RadFET Linear Array for\nIntracavitary in vivo Dosimetry During External\nBeam Radiotherapy and Brachytherapy\nRobert A. Price*, Member, IEEE, Chris Benson, Malcolm J. Joyce, and Kenneth Rodgers\nAbstract—We present the details of a new linear array\ndosimeter consisting of a chain of semiconductors mounted on\nan ultra-thin (50 m thick) flexible substrate and housed in\nan intracavitary catheter. The semiconductors, manufactured\nby NMRC Cork, have not been packaging and incorporate a\npassivation layer that allows them to be mounted on the substrate\nusing flip-chip-bonding. This paper reports, for the first time, the\nconstruction of a multiple (ten) detector array suited to in vivo\ndosimetry in the rectum, esophagus and vagina during external\nbeam radiotherapy, as well as being adaptable to in vivo dosimetry\nduring brachytherapy and diagnostic radiology.\nIndex Terms—Dosimetry, in vivo patient dosimetry, MOSFET,\nRadFET, radiotherapy, semiconductor detectors.\nI. INTRODUCTION\nTHE overall process of planning and treatment of a patientwith ionizing radiation encompasses many complex and\ndiverse steps, all of which are subject to uncertainty [1] and pos-\nsible human error. In order to provide efficacious disease man-\nagement, radiotherapy treatment requires the patient to be ac-\ncurately positioned with respect to the radiation fields so that\na therapeutic dose can be delivered to the target region (tumor)\nwhilst the absorbed dose to the normal tissue and organs at risk\nis kept to a minimum. It is known that the accuracy with which\nthe patient is positioned in the beam affects both the probability\nof cure (tumor control) and the undesirable complication rate\n[2]. In addition to the geometric precision with which the pa-\ntient is positioned, the efficacy of the treatment is critically de-\npendent on the magnitude of the absorbed dose in the tumor\nand other volumes. Using clinically derived dose-effect curves\nfor local tumor-control and normal tissue-complications, var-\nious authors have estimated the accuracy requirements for dose\ndelivery in conventional external-beam treatments to be 3.5%\nfor absolute dose at the specification point and 5% at other\npoints within the target volume [3]–[6]. For other, high-pre-\ncision treatments such as conformal radiotherapy, Essers [7]\nManuscript received November 14, 2003; revised April 6, 2004. This work\nwas supported in part under EU framework–V Grant (InvoRad Project): ISD-\n200125343. The work of C. Benson was supported by Engineering and Physical\nScience Research Council. Asterisk indicates corresponding author.\n*R. A. Price is with Computational and Applied Dosimetry Research Group,\nPhysics Department, Clatterbridge Centre for Oncology NHS Trust, Wirral\nCH63 4JY, U.K. (e-mail: rprice1495@aol.com).\nC. Benson is with Appleyard Lees, Halifax HX1 2HY, U.K.\nM. J. Joyce is with University of Lancaster, Lancaster LA1 4YW, U.K.\n(e-mail: m.joyce@lancaster.ac.uk).\nK. Rodgers is with NMRC Cork, Cork, Ireland (e-mail: krodgers@nmrc.ie).\nDigital Object Identifier 10.1109\/TNS.2004.832570\nnotes that the accuracy criteria may need to be tightened: cur-\nrent wisdom stating a 2% or 2 mm criterion on absorbed dose\nand positional accuracy respectively.\nIt is apparent that effective quality assurance and control pro-\ncedures are essential in radiotherapy if the above stated accu-\nracy is to be achieved and maintained. Within such a quality as-\nsurance program, individual quality control tasks are concerned\nwith checking the accuracy and precision of each step in the\nplanning and delivery chain [8] but it is only at the final step,\nwhen a beam is actually delivered to a patient, that a single check\non the whole procedure (through in vivo dosimetry measure-\nments) can be made and the attainment of a desired dose-accu-\nracy formally confirmed.\nClearly, patient dose verification at the point of delivery is\nan important part of quality assurance in radiotherapy treat-\nment [9]. It is included as a requirement in the UK Manual of\nCancer Standards [10] and is recommended within the whole of\nEurope [11] and North America [12] for procedures involving\nhigh doses to the patient. When included as part of a general\nsystem of radiotherapy quality assurance within a clinic, in vivo\ndosimetry can significantly reduce the risk of mistreatment. Two\ncommonly used detectors for in vivo dosimetry are thermolumi-\nnescence dosimeters (TLDs) and semiconductors.\nTLDs are popular because of their small size but they require\nextremely careful handling and calibration in order to obtain a\nmeasurement accuracy of better than 5% at 95% confidence.\nThey are, to some degree, inconvenient to use, as they require\nspecialized ovens for post irradiation annealing and expensive\nTLD reading equipment. Further, they do not provide a means\nof ‘real-time’ dosimetry because there must be a well-controlled\ndelay of approximately two hours or more between irradiation\nand reading in order to allow the decay of short-lived traps. Due\nto the stringent handling requirements and the need to protect\nthe TLD chips from UV light and chemical contaminants they\nare not well-suited for inclusion in arrays or for use in intracav-\nitary dosimetry. Some authors have, however, used TLDs for\nintracavitary in vivo dosimetry—for example, Brezovich [13],\net al. incorporated some 20 LiF rods in a 6fr urethral catheter\nin order to verify high dose rate (HDR) prostrate treatments; the\nTLD rods being read within 24–48 hrs of the radiation treatment.\nSemiconductor detectors such as diodes and metal-oxide\nfield-effect transistors [14] (MOSFETs) provide a conve-\nnient alternative to TLD technology. Such detectors can be\nconstructed with a small active volume whilst retaining high\nsensitivity and accuracy [15]. Importantly, real-time in vivo\ndosimetry (using semiconductor detectors, MOSFETs or dia-\n0018-9499\/04$20.00 © 2004 IEEE\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 11, 2008 at 08:24 from IEEE Xplore.  Restrictions apply.\nPRICE et al.: DEVELOPMENT OF A RadFET LINEAR ARRAY FOR INTRACAVITARY 1421\nmonds, etc) allows differences in recorded and expected dose\nvalues to be investigated with the patient still in the treatment\nposition [16]. Based on such measurements and an analysis\nof the actual treatment set-up, a treatment can be modified, if\ndeemed suitable, before the next fraction in order to bring the\noverall treatment back in-line with expectations. This approach\nto the use of real-time in vivo dosimetry is discussed by several\nauthors [17], [18] and has been put into practical use by various\ngroups [19]–[21].\nThe majority of in vivo dosimetric measurements performed\nin the clinic are achieved by placing the detector on the entrance\nor exit surface of the patient and the tumor dose derived via\nvarious algorithms—for example Lee et al. [22]. However, it is\noften desirable to make intracavitary measurements of absorbed\ndose distributions: For example, during external beam treatment\nof rectal carcinoma the dose delivered to the rectum and the re-\ngion of the anal verge is of critical importance in controlling\ndeleterious complications [23] and so intracavitary in vivo mea-\nsurements are indicated. Similarly, intracavitary measurements\nduring cervical treatments or head and neck treatments would\nprovide valuable information on the absorbed dose to sensitive\nstructures such as the bladder and esophagus.\nIn this paper we describe the design and construction of a\nprototype catheter array based on RadFET (radiation sensitive\nMOSFETs) and diode detectors—specifically, we describe a\nprototype rectal array in which the semiconductors do not have\nequal spacing but this is not a limitation of the system.\nII. MATERIALS AND METHODS\nA. RadFET Detectors\nThe RadFET detector is a p-type Metal Oxide Field Effect\nTransistor (p-MOSFET) that has been optimized as a radiation\ndetector [24]–[26]. These detectors have excellent radiation-\nand physical-characteristics that make them eminently suitable\nfor use as in vivo radiation detectors in radiotherapy applica-\ntions [27]–[30]. Exposure to ionizing radiation, such as gamma\nrays, x-rays, electrons and high-energy protons produce a pre-\ndictable shift in the threshold voltage (proportional to absorbed\ndose) that is easily measurable with a simple circuit that can be\nintegrated on the same small chip; they can provide real-time\naccumulated absorbed-dose information and are thus suited to\nuse in Intensity Modulated Radiotherapy (IMRT) applications;\nas with diodes, they are highly sensitive (approximately 1800\ntimes more sensitive per gamma than an equivalent volume gas-\ndetector) and are small in size (1 ), they can be operated\nin zero-bias mode and typically show a lower over-response\nat low-energies than do currently available commercial diodes\n[31].\nThe RadFET used in this work is the ESAPMOS4 device\nmanufactured by NMRC Cork. This consists of four RadFET\ndetectors and an integral diode on the same silicon chip. The\nchip is 1 mm square and houses two (300\/50)\nand two (690\/15) devices as well as an on-board\ndiode. The ratios above refer to width\/length ratio of the gate\noxide region. The on-board diode has a P+ to N+ minimum dis-\ntance of 15 . There are 12 bond-pads in the chip that are used\nfor making electrical connections. The bond-pad size is 100\nsquare and the distance between bond-pads is 150 . We have\nused a 400 nm Implanted Gate Oxide RadFET (IMPL RadFET)\nwhich, because of additional implantation steps, has a lower\ninitial output voltage than the standard (un-implanted) 400 nm\nRadFET. The preirradiation output voltage of 400 nm gate, thick\noxide IMPL RadFET (300\/50) is about 1.5 V, whereas the initial\nvoltage of a standard 400 nm gate, thick oxide RadFET (300\/50)\nis about 8 V. For 690\/15 devices the output voltages are approx.\n1 V lover than these.\nB. Flip-Chip Bonding\nIn order to obtain the minimum interconnection complexity\non an array of ten or more RadFETs we have used a process\nknown as flip-chip bonding [32], [33]. This bonding method\nhas a lower footprint dimension than other interconnection tech-\nniques, such as wire bonding, and removes the need to have\nmultiple wire bond interconnects that would significantly in-\ncrease the overall dimensions of the array and possibly cause\nradiation shielding difficulties. Flip-chip interconnection uses\nconductive bumps to connect the chip to corresponding sub-\nstrate bond-pads. All packaging is removed and the bare chip\nis flipped upside down in order to make the appropriate connec-\ntions directly from the chip to the substrate. In this way, it is\nonly the chip dimensions that determine the final footprint.\nThere are a number of flip-chip techniques that can be used\nin order to make the bond between the chip and the bond-pads.\nWe have used an anisotropic conductive adhesive to bond the\nRadFET to the flexible substrate. To perform this mounting\ntechnique the bond pads of the RadFETs are first coated with 20\nhigh nickel bumps using an electrolyzes plating technique.\nWe then used Loctite 3441 anisotropically conductive adhesive\nto achieve the electrical connection to the substrate. This ma-\nterial consists of electrically conductive particles (5-micron di-\nameter gold-coated polymer-spheres) dispersed in an adhesive\nmatrix at a high concentration to ensure reliable conductivity\nbetween the substrate and the die i.e. electrical interconnection\nis in the z-axis direction where particles are trapped between the\nbump and track and electrical insulation is maintained in the x-y\nplane of the bond interface. In our mounting technique the chip\nis bonded under 5 pressure at 200 .\nC. Description of the Rectal Array\nThe array herein described has been constructed specifically\nfor measuring the dose distribution from the location of the\ntumor to the position of the anal verge during external beam ra-\ndiotherapy treatment of an anal carcinoma. In this construction\nwe have deliberately used nonuniform detector spacing so that\nwe can resolve information in the rapidly changing dose area\nat the anal verge. All other dimensions of the array have been\nchosen so that it is suitable for esophageal, rectal and vaginal\nplacement. In future developments the external dimensions\nwill be significantly reduced to permit its use in brachytherapy\ncatheters.\nThe array is 12.5 cm in length and consists of ten RadFETs\nplaced inside a catheter of overall length 53 cm (Fig. 1).\nWhen placed inside the patient, detector 1 (left-most detector\nin Fig. 1) will be positioned at the entrance to the anus with de-\ntector 10 (right-most detector in Fig. 1) used to monitor the dose\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 11, 2008 at 08:24 from IEEE Xplore.  Restrictions apply.\n1422 IEEE TRANSACTIONS ON NUCLEAR SCIENCE, VOL. 51, NO. 4, AUGUST 2004\nFig. 1. Schematic of the rectal array showing the position and spacing of the\nindividual detectors.\nFig. 2. Schematic cross section of the array showing the rolled flexible\ninterconnect. In the rectal array, the RadFETs are positioned close to the\nsurface of the catheter to permit dose measurements at the rectal wall.\nat the tumor location. The greatest density of detectors (detec-\ntors 1–6) are used to monitor the dose in the anal region, these\ndetectors have a spacing of 0.6 cm. The following 6 cm have two\ndetectors (detector 7 & 8) spaced at 3 cm intervals. The final two\ndetectors (detectors 9 & 10) are placed at 11.5 cm and 12.5 cm.\nThe detector array has a diameter less than 0.4 cm so it can be\nplaced in a standard catheter, which is its self filled with tissue\nequivalent gel. Markers that can be seen on a portal imager or\nx-ray film are placed between detectors 6 and 7 and detectors 9\nand 10 to aid in correct placement on the catheter.\nThe polyimide interconnect substrate consists of a 50 thick\npolyimide layer with metal tracks to provide electrical contact\nto the RadFET devices. The metal tracks are 70 wide with\na gap of 70 between each track. They consist of a base metal\nlayer of 5 of copper coated with a 3 layer of nickel and\nfinally a 0.07 layer of gold. In later developments we intend\nto remove this gold layer to reduce any local dose-enhancement\ndue to photoelectron generation at low energies [34].\nUsing a 70 track and gap width for the metal tracks and al-\nlowing for up to 120 tracks to connect out all I\/Os of the RadFET\ndevices required a substrate width of 1.7 cm—which is signif-\nicantly larger than the inner diameter of the catheter. However\nbecause the substrate is flexible we have been able to roll it up\nto allow insertion within the catheter. The cross section of the\nsystem is shown schematically in Fig. 2.\nFig. 3 shows the actual prototype constructed array. Clearly\nseen are the individual RadFET devices and the 70 tracks\nused for electrical connections.\nD. Electronic Read-Out\nThroughout the work herein discussed, the change in\nthreshold voltage after irradiation was measured using a PC to\ncontrol a Keithley Instruments 2400 source-meter via a Hewlett\nPackard GPIB controller card. The system was configured\nto measure the gate-source voltage whilst simultaneously\npassing a fixed channel current of 10 . In order to reduce\nthe influence of short-lived interface states, the reader circuit\nwas programmed to measure the threshold-voltage 10 s after\nthe initial turn-on of supply current to the RadFET.\nFig. 3. Actual prototype array showing the individual RadFETs flip-chip\nmounted on the flexible substrate and the 70 \u0016m interconnection lines.\nIII. RESULTS\nElectrical parameters of each RadFET were checked in both\nthe read and irradiation modes just prior to irradiation in order to\nensure their correct functionality. RadFETs were irradiated with\neither 0 V or 5 V present on the gate terminal and all other con-\nnections grounded. In the later case the applied potential results\nin a 25 MV\/cm field across the gate oxide. This field reduces\nhole-electron recombination in the and enhances hole-\ntrapping within the oxide, thereby providing a greater threshold-\nvoltage shift and thence sensitivity.\nA. Radiation Characterization\nInitial characterization focused on four aspects of the\nindividual RadFET performance: 1) Linearity of response\nwith absorbed dose, 2) determination of the energy-dependent\nsensitivity, 3) evaluation of inherent reproducibility and\n4) determination of the lower level of detection. Except for\nthe energy-response analysis, all experimental work was\nperformed on medical linear accelerators with bremsstrahlung\nspectra having end-point energies of 6 or 10 MeV and dose\nrates of approximately 6 Gy\/min. Data at in a spectrum\nwas obtained on a medical cobalt machine (dose-rate approxi-\nmately 6 Gy\/min at reduced source-detector distance). Energy-\nresponse data was obtained using a PANTAK HF-320 constant\npotential x-ray generator using ISO narrow spectra at the\nRegional Radiation Protection Physics Service, Birmingham,\nUK [35].\nDevice Dose Linearity: In order to measure the linearity of\ndevice response with respect to absorbed radiation dose, Rad-\nFETs were individually placed at a depth of 7 cm within a spe-\ncially constructed PMMA phantom having a cross section of\n30 cm 30 cm and an overall thickness of approximately 20 cm.\nThese dimensions were chosen to ensure that the devices were\nin a region of full charged particle equilibrium and that the influ-\nence of contaminating low-energy radiation scattered from the\nlinac head was minimized. A calibrated NE2571 Farmer ioniza-\ntion chamber (calibration traceable to National standards) was\npositioned at the same depth as the RadFETs but displaced by\napproximately 2 cm laterally. This horizontal displacement had\npreviously been determined to be sufficient so that scattered ra-\ndiation from the graphite thimble had no statistically significant\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 11, 2008 at 08:24 from IEEE Xplore.  Restrictions apply.\nPRICE et al.: DEVELOPMENT OF A RadFET LINEAR ARRAY FOR INTRACAVITARY 1423\nFig. 4. Average response for 20 RadFET devices as a function of increasing\nabsorbed radiation dose from a 10 MV medical linear accelerator. The solid line\nis a linear fit to the data. Statistical r = 0:998.\neffect on the response of the RadFET but that the measured ab-\nsorbed dose in this location was statistically identical to that at\nthe location of the RadFET. A calibrated thermometer was sim-\nilarly placed within the phantom to provide accurate tempera-\nture measurement. The Farmer chamber output was measured\nusing a calibrated Keithley 35 040 therapy electrometer and the\nabsolute value of the absorbed dose to water was subsequently\nderived through the UK standard high-energy photon dosimetry\nprotocol. Prior to irradiation, the phantom and RadFET were al-\nlowed to reach thermal equilibrium. Throughout the experimen-\ntation, the phantom temperature was constant to within 1\nFig. 4 shows the device output (voltage-shift) as a function of\ntotal absorbed dose (water) for 5 V biased devices. The data\npoints represent the mean value observed for 20 RadFETs. Each\ndevice was subjected to increasing absorbed dose—applied in\ndiscrete steps from 0.01 Gy (water) to approximately 50 Gy\n(water). The Fig. clearly demonstrates a near linear response\nshows up to 50 Gy (water) with for a linear model.\nInterdevice Response Variability: Interdevice variability was\nexamined, using the same experimental set-up as for the lin-\nearity tests, for both 0 V and 5 V gate bias, in each case twenty\nRadFETs were used. Fig. 5 shows the probability distribution\nof sensitivities ( -shift per Gy) for the case of 0 V bias whilst\nFig. 6 shows the distribution for 5 V gate bias. We observed a\nstatistical of 3% at 0 V and 1% at 5 V gate bias respectively.\nMean absolute sensitivities are 0.0619 and 0.1414 V\/Gy at 0 V\nand 5 V respectively.\nResponse Angular Anisotropy: Angular anisotropy was mea-\nsured free in-air to avoid changes in optical depth of the device\nin the parallelepiped phantom as a function of beam angle. Each\ndevice was held in a low-scatter arm and irradiated to nomi-\nnally 0.1 Gy at 15 intervals through 360 . The angle relative\nto the machine central axis was measured with a digital incli-\nnometer to better than 1 . A fixed Farmer chamber (calibrated\nto national standards) provided an independent monitor of the\nmachine output for normalization purposes. Fig. 7 shows the\nin-air anisotropy plot, the data being the mean response of 5-de-\nFig. 5. Interdevice variability in sensitivity at 0 V bias for 20 devices.Mean =\n0:0619 V=Gy, \u001b = 3%.\nFig. 6. Interdevice variability in sensitivity at +5 V gate bias. Twenty devices\nwere irradiated to 0.1 Gy-absorbed dose to water as described in the text. Mean\nsensitivity is seen to be 0.1414 V\/Gy, \u001b = 1%.\nFig. 7. Angular anisotropy measured with a medical linear accelerator\noperating at 6 MV.\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 11, 2008 at 08:24 from IEEE Xplore.  Restrictions apply.\n1424 IEEE TRANSACTIONS ON NUCLEAR SCIENCE, VOL. 51, NO. 4, AUGUST 2004\nFig. 8. RadFET energy response (+5 V bias) measured using a PANTAK HF\n320 constant potential x-ray generator and ISO narrow spectra—solid line. Also\nshown are computed values of the relative energy deposition using MCNPX\n(triangles). The response is relative to that in a Co spectrum.\nvices. All data are normalized to the response at 0 . Uncertainty\nin the plotted data points is 1% at . Anisotropy is 2.5%.\nSome distortion is expected due to asymmetric placement of the\nRadFET in the catheter.\nResponse Variation With Photon Energy: The energy re-\nsponse of the RadFET ( 5 V gate bias) was measured using the\nthree different radiation sources described above. High-energy\nresponse data were obtained with the RadFETs mounted\n7 cm deep in the PMMA phantom, the actual absorbed dose\nto water being determined as for the linearity experiments.\nLow-energy response data were obtained with the RadFETs\nsurface mounted on a thin, ultra low-density expanded polysty-\nrene block supplied by RRPPS. This block is used to provide\nstructural support with very little backscatter thus changes in\nthe backscatter factor over the energy range of interest had\nlittle effect on the total absorbed dose. Further, since the active\nregion is only 400 nm thick and has above it only 1.2 of low\nZ material, including a silicon nitride passivation region and\nbeneath it approximately 400 of Si, the device essentially\nsees the surface dose. In all cases, absolute dosimetry was\nperformed by RRPPS and was traceable to national standards.\nFig. 8 shows the observed energy-response at low-energies\n(solid line and squares). Also seen on the plot are Monte Carlo\ncalculated values of energy-deposition (triangles). All data are\nrelative to the response in a spectrum. Experimental un-\ncertainty is better than 2% at and calculated and experiment\nresults match to better than 2%. The relative responses at 6 and\n10 MV (not shown) are 1 and 0.99 respectively. An over-re-\nsponse of approximately a factor of 6 (relative to ) is ob-\nserved—this is consistent with results on other commercially\navailable devices [31] however, in our case, we observe a second\nmaximum at around 100 keV (both experimentally and compu-\ntationally). This is currently under investigation by the authors.\nIt is likely to be due to secondary photoelectrons from high-Z\nmaterials in the RadFET or substrate construction [36], [37].\nB. Monte Carlo Simulated Energy Deposition\nIn order to quality assure the energy-response data and to pro-\nvide future modeling for device optimization purposes we have\nbuilt a detailed Monte Carlo simulation model of the RadFET\ndevice using MCNPX [38]. We assume direct proportionality\nbetween the energy deposited in the oxide layer and the physical\nresponse of the device. Although this is clearly an approxima-\ntion—especially at very low energies, it is sufficient for our cur-\nrent purposes. Calculations proceed, as usual, from the primary\nsource spectrum. In the case of the low-energy response, we\nhave used the defined ISO narrow spectra that have been verified\nfor the RRPS machine used. In the case of the high-energy re-\nsponse, the exact spectra are not known experimentally. In these\ncases, we have first computed the mixed photon and electron\nspectra for the linacs used through detailed Monte Carlo models\nusing [39] and used this spectrum as the primary\nspectrum for the subsequent coupled photon-electron MCNPX\ncalculations. In all cases we have converged the MCNPX cal-\nculations to 1% statistical accuracy, although it is understood\nthat this is only a partial component of the overall uncertainty\nbudget for the calculation. In all cases, the energy-deposition\ntally was used and passed all statistical tests of sampling and\nconvergence provided within the MCNPX code.\nIV. DISCUSION\nDevice Linearity: Measurement of device linearity to\nabsorbed radiation dose has shown that individual RadFETs\nfollow a sufficiently linear model , at least up to\napproximately 50 Gy-absorbed dose (water), to allow simple\ndetermination of absorbed dose via a single calibration factor.\nThis first-order model becomes increasingly inaccurate at\nhigher levels of absorbed dose when it is more appropriate to\nuse an exponential expression [34].\nAngular Anisotropy: In-air studies on bare RadFETs reveals\nan angular anisotropy of better than 2.5% over 360 . This is ex-\npected to be reduced for the devices encapsulated in the uniform\ncylindrical catheter. Providing the orientation of the catheter is\nknown to within 90 when positioned in the patient, the uncer-\ntainty in measured dose due to anisotropy effects will be better\nthan the maximum 2.5% above. Due to the construction of the\ncatheter array, it is unlikely that it will twist by more than a few\ndegrees during insertion, ensuring that the uncertainty due to an-\ngular anisotropy is better than 2.5% in practice.\nDevice Sensitivity: Device sensitivity has been shown to be\n0.1414 V\/Gy when biased at 5 V. In this mode, we are able to\nmeasure doses lower than 0.05 Gy (water) based on a signal\nabove noise [40]. This is sufficient to measure doses within the\npenumbral region of the radiation beam (defined to be approxi-\nmately 20%–80% of the central axis dose [3] of 2 Gy per frac-\ntion for a typical external beam treatment) and approximately\n0.1 Gy for organs at risk such as the anus, which lie just outside\nof the beam.\nInterdevice Variability: The variability in sensitivity be-\ntween devices is important when considering the calibration of\na multiple detector array. We have measured this variability to\nbe better than 1% for devices biased at 5 V and 3% when they\nare used in passive mode indicating that for all but the most\nstringent requirements, a single calibration factor is sufficient\nproviding that the devices have all been manufactured from the\nsame wafer.\nThe precise dimensions and small size of the active region\nin a RadFET (the gate), allows the device to be used\nfor dosimetry in steep dose gradients, as shown by other\nresearchers [40].\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 11, 2008 at 08:24 from IEEE Xplore.  Restrictions apply.\nPRICE et al.: DEVELOPMENT OF A RadFET LINEAR ARRAY FOR INTRACAVITARY 1425\nV. CONCLUSION AND FUTURE WORK\nWe have developed and constructed a prototype catheter\ndosimeter based on MOSFET technology that is suited to\nuse within natural cavities of the human body. In particular,\nwe have adapted and utilized an existing MOSFET designed\nspecifically as a radiation detector—the ESAPMOS4 RadFET\nfrom NMRC Cork. The radiation response characteristics of\nindividual RadFETs have been shown to be suitable for use as\nin vivo dosimeters, i.e. they have small size, require zero or low\nvoltage bias, can provide a dose measurement with the patient\nstill in position on the therapy bed and posses dose linearity to\ntherapeutically high dose levels.\nWe have successfully demonstrated that these devices can be\nused at absorbed dose levels as low as 0.05 Gy, which is suffi-\ncient to monitor the dose in regions just outside of the defined\nradiation field—i.e. at the anal verge in a rectal treatment.\nWithin the framework of a 3.5% total uncertainty of dose\nmeasurement, when used with a simple linear response model\nthe RadFETs used in this work are adequate for single patient\nuse in a QA program incorporating selective in vivo dosimetry.\nThe device presented herein is suitable for on-line in vivo\ndosimetry for external beam radiotherapy of the rectum, esoph-\nagus and vagina. As discussed by other authors [41], MOSFET\ndosimeters have an application in the characterization and\nquality assurance of the steep dose gradients associated with\nthe penumbra of modern radiation modalities and we have put\nthis to good use in the array presented.\nFuture work involves a detailed analysis of changes in sensi-\ntivity with respect to dose-rate, scattered radiation and temper-\nature—although the on-board diode will be used in practice for\ntemperature compensation.\nA patient based trial of the array dosimeter in the treatment\nof rectal carcinoma is planned. We are currently in the process\nof building a dedicated multichannel RadFET reader and ex-\ntending the concept of the array to the use of other semicon-\nductor detectors, such as diodes.\nACKNOWLEDGMENT\nR. A. Price would like to thank Clatterbridge Centre for On-\ncology for continuing research support. The authors would also\nlike to thank the Regional Radiation Protection Physics Service\n(RRPPS) for making available their low-energy photon calibra-\ntion facilities.\nREFERENCES\n[1] Guide to the Expression of Uncertainty in Measurement, International\nOrganization for Standardization (ISO), Geneva, 1995.\n[2] J. C. Stroom and B. J. Heijmen, “Geometrical uncertainties, radiotherapy\nplanning margins and the ICRU-62 report,” Radiotherapy Oncology,\nvol. 64, no. 1, pp. 75–83, July 2002.\n[3] W. P. H. Mayles, R. Lake, A. Mcenzie, E. M. Macaulay, H. M. Morgan,\nT. J. Jordan, and S. K. Powel, Eds., “Physics Aspects of Quality Control\nin Radiotherapy,”, IPEM Rep. no. 81, 1999.\n[4] A. Brahme, “Dosimetric precision requirements in radiation therapy,”\nActa Radiol. Oncol., vol. 23, no. 5, pp. 379–391, 1984.\n[5] C. J. Millwater, A. S. Macleod, and D. I. Thwaites, “In vivo semicon-\nductor dosimetry as part of routine quality assurance,” Br. J. Radiol., vol.\n71, no. 846, pp. 661–668, 1998.\n[6] M. Goitein, “Calculation of the uncertainty in the dose delivered during\nradiation therapy,” Med. Phys., vol. 12, no. 5, pp. 602–612, 1985.\n[7] M. Essers and B. J. Mijnheer, “In vivo dosimetry during external photon\nbeam radiotherapy,” Int. J. Radiation Oncology Biol. Phys., vol. 43, no.\n2, pp. 245–259, 1999.\n[8] J. H. Lanson, M. Essers, G. J. Meijnheer, A. W. H. Minken, G. J. Uiter-\nwaal, and B. J. Mijnheer, “In vivo dosimetry during conformal radio-\ntherapy, requirements for and findings of a routine procedure,” Radio-\nther. Oncol., vol. 52, no. 1, pp. 144–151, 1999.\n[9] P. Mangili, C. Fiorino, A. Rosso, G. M. Cataneo, R. Parisi, E. Villa, and\nR. Calandrino, “In vivo dosimetry by diode semiconductors in combi-\nnation with portal films during TBI: Reporting on a 5-year clinical ex-\nperience,” Radiother. Oncol., vol. 52, no. 3, pp. 269–276, 1999.\n[10] Manual of Cancer Standards, UK Department of Health Publication,\n2000.\n[11] “Health protection of individuals against the dangers of ionising radia-\ntions in relation to medical exposures,” Official J. Eur. Community, vol.\nL180\/22, 1997.\n[12] G. J. Kutcher, L. Coia, M. Gillin, W. F. Hanson, S. Leibel, and R. J.\nMorton et al., “Comprehensive QA for radiation oncology report 40 of\nAAPM radiation therapy committee task group 40,” Med. Phys., vol. 21,\nno. 4, pp. 581–618, 1994.\n[13] I. A. Brezovich, J. Duan, P. N. Pareek, J. Fiveash, and M. Ezekiel,\n“In vivo urethral dose measurements: a method to verify high dose\nrate prostate treatments,” Med. Phys., vol. 27, no. 10, pp. 2297–2302,\n2000.\n[14] Handbook of Radiation Effects, 2nd ed., Oxford Univ. Press, Oxford,\nU.K., 2002.\n[15] G. Rikner, “Silicon Diodes as Detectors in Relative Dosimetry of\nPhoton, Electron and Proton Radiation Fields,” Ph.D. thesis, Uppsala\nUniv., Uppsala, Sweden, 1983.\n[16] G. Leunens, J. Van Dam, A. Dutreix, and E. van der Schueren, “Quality\nassurance in radiotherapy by in vivo dosimetry. 1. Entrance dose mea-\nsurements, a reliable procedure,” Radiother. Oncol., vol. 17, no. 2, pp.\n141–151, 1990.\n[17] , “Quality assurance in radiotherapy by in vivo dosimetry. 2. Deter-\nmination of the target absorbed dose,” Radiother. Oncol., vol. 19, no. 1,\npp. 73–87, 1990.\n[18] C. J. Millwater, A. S. Macleod, and D. I. Thwaites, “In vivo semicon-\nductor dosimetry as part of routine quality assurance,” Br. J. Radiol., vol.\n71, no. 846, pp. 661–668, 1998.\n[19] A. Adeyemi and J. Lord, “An audit of radiotherapy patient doses mea-\nsured with in vivo semiconductor detectors,” Br. J. Radiol., vol. 70, no.\n832, pp. 339–408, 1997.\n[20] G. Leunens, J. Van Dam, A. Dutreix, and E. van der Schueren, “Im-\nportance of in vivo dosimetry as part of a quality assurance program in\ntangential breast treatments,” Int. J. Rad. Oncol. Biol. Phys., vol. 28, no.\n1, pp. 285–296, 1994.\n[21] G. Leunens, J. Verstraete, J. van Dam, A. Dutreix, and E. van der\nSchueren, “In vivo dosimetry for tangential breast irradiation: role of\nthe equipment in the accuracy of dose delivery,” Radiother. Oncol., vol.\n22, no. 4, pp. 285–289, 1991.\n[22] P. C. Lee, J. M. Sawicka, and G. P. Glasgow, “Patient dosimetry quality\nassurance program with a commercial diode system,” Int. J. Radiation\nOncology Biol. Phys., vol. 29, no. 5, pp. 1175–1182, 1994.\n[23] D. C. Weber, P. Nouet, J. M. Kurtz, and A. S. Allal, “Assessment of\ntarget dose delivery in anal cancer using in vivo thermoluminescent\ndosimetry,” Radiother. Oncol., vol. 59, no. 1, pp. 39–43, 2001.\n[24] A. Jaksic, G. Ristic, M. Pejovic, A. Mohammadzadeh, and W. Lane,\n“Characterization of radiation response of 400 nm implanted gate oxide\nRadFET,” Met. Sci. Eng. B-Solid, vol. 89, pp. 1–3, 2002.\n[25] B. O’Connell, C. Mcarthy, and W. Lane, “Optimized stacked\nRadFET’s for micro-gray dose measurements,” in Proc. 5th Eur.\nConf. Radiation and Its Effects on Materials (RADEC’s 99),\nFontevarad, France, Sept..\n[26] B. O’Connell, W. Kelleher, W. Lane, and L. Adams, “Review paper:\nRaFET’s for improved radiation sensitivity,” in ESSDERC, Bologna,\nSept. 1996.\n[27] M. J. Butson and J. N. Rozenfeld et al., “A new radiotherapy surface\ndose detector: the MOSFET,” Med. Phys., vol. 23, no. 5, pp. 655–658,\n1996.\n[28] M. Soubra, J. Cygler, and G. Mackay, “Evaluation of a dual bias dual\nmetal oxide-silicon semiconductor field effect transistor as a radiation\ndosimeter,” Med. Phys., vol. 21, no. 4, pp. 567–572, 1994.\n[29] T. P. Ma and P. V. Dressendorfer, Ionizing Radiation Effects in MOS\nDevices and Circuits. New York: Wiley, 1989.\n[30] A. Homes-Sieldle and L. Adams, “RADFETs: a review of the use of\nmetal-oxide-silicon devices as integrating dosimeters,” Radiat. Phys.\nChem., vol. 28, pp. 235–244, 1986.\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 11, 2008 at 08:24 from IEEE Xplore.  Restrictions apply.\n1426 IEEE TRANSACTIONS ON NUCLEAR SCIENCE, VOL. 51, NO. 4, AUGUST 2004\n[31] C. R. Edwards, S. Green, J. E. Palethorpe, and P. J. Mountford, “The\nresponse of a MOSFET, p-type semiconductor and LiF TLD to quasi-\nmonoenergetic x-rays,” Phys. Med. Biol., vol. 42, no. 12, pp. 2383–2391,\n1997.\n[32] Z. H. Lai and J. H. Liu, “Anisotropically conductive adhesive flip-chip\nbonding on rigid and flexible printed circuit substrates,” IEEE Trans.\nComp., Packag., Manufact. Technol., pt. B, vol. 19, pp. 3–5, Mar. 1996.\n[33] F. Stam, P. O’Grady, and J. Barrett, “Characterization and reliability\nstudy of anisotropic conductive adhesives for fine-pitch package\nassembly,” J. Electron. Manufact., vol. 5, no. 1, pp. 1–8, 1995.\n[34] R. A. Price, C. Benson, M. J. Joyce, D. J. Kestell, and D. L. Silvie,\n“Novel developments in the MOSFET dosimeter for neutron dosimetry\napplications,” Rad Proc Dosim., 2004, to be published.\n[35] S. Greene, J. E. Palethorpe, D. E. Peach, and D. A. Bradley, “Develop-\nment of a calibration facility for test instrumentation in diagnostic radi-\nology,” Rad. Proc. Dosim., vol. 67, no. 1, pp. 41–46, 1996.\n[36] T. Kron, L. Duggan, T. Smith, A. Rosenfeld, M. Buston, and G. Kaplan\net al., “Dose response of various radiation detectors to synchrotron ra-\ndiation,” Phys. Med. Biol., vol. 43, no. 11, pp. 3235–3259.\n[37] G. J. Brukner, S. Kronenberg, and F. Gentner, “Effects of packaging\ngeometry, materials and die design on energy-dependence of PMOS\ndosimeters,” IEEE Trans. Nucl. Sci, vol. 42, pp. 33–40, Feb. 1995.\n[38] MCNPX Users Manual Version 2.3.0, L. S. Waters, Ed., 2002.\n[39] BEAM Users Manual, National Research Council, Canada, 1995.\n[40] A. B. Rosenfeld, M. G. Carolan, G. I. Kaplan, B. J. Allen, and V. I.\nKhivrich, “MOSFET dosimeters: the role of encapsulation on dosimetric\ncharacteristics in mixed gamma-neutron and megavoltage X-ray fields,”\nIEEE Trans. Nucl. Sci., vol. 42, pp. 1870–1877, Dec. 1995.\n[41] A. B. Rosenfeld, “MOSFET dosimetry in modern radiation oncology\nmodalities,” Rad. Proc. Dosim., vol. 101, no. 1–4, pp. 393–398, 2002.\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 11, 2008 at 08:24 from IEEE Xplore.  Restrictions apply.\n"}