{"doi":"10.1007\/s10982-011-9114-1","coreId":"220175","oai":"oai:eprints.lse.ac.uk:37521","identifiers":["oai:eprints.lse.ac.uk:37521","10.1007\/s10982-011-9114-1"],"title":"Kant, copyright and communicative freedom","authors":["Barron, Anne"],"enrichments":{"references":[{"id":17291181,"title":"Copyright Infringement, ‘Free-Riding’ and the Lifeworld”","authors":[],"date":"2010","doi":"10.1017\/cbo9780511761577.007","raw":"Anne  Barron,  “Copyright  Infringement,  ‘Free-Riding’  and  the  Lifeworld”  in  L. Bently, J. Davis and J. Ginsburg (eds.) Copyright and Piracy: An Interdisciplinary Critique (Cambridge: Cambridge University Press, 2010), pp.93-127 Charles  R.  Beitz,  “The  Moral  Rights  of  Creators  of  Artistic  and  Literary  Works” Journal of Political Philosophy 13(3) (2005) pp.330-358 Seyla Benhabib, The Rights of Others: Aliens, Residents, and Citizens (Cambridge: Cambridge University Press, 2004) Yochai Benkler, “Free as the Air to Common Use: First Amendment Constraints on Enclosure of the Public Domain” 74 (1999) New York University Law Review pp.354-446 Yochai  Benkler,  “Siren  Songs  and  Amish  Children:  Autonomy,  Information  and Law” 76 (2001) New York University Law Review pp.23-113 Yochai Benkler, The Wealth of Networks (New Haven and London: Yale University Press, 2006) James Bohmann, “The Public Spheres of the World Citizen” in J. Bohmann and M.","cites":null},{"id":17291185,"title":"Hegel and the Tradition: Essays in Honour of H.S. Harris (Toronto:","authors":[],"date":"1997","doi":null,"raw":"Russon (eds.) Hegel and the Tradition: Essays in Honour of H.S. Harris (Toronto: University of Toronto Press, 1997), pp.40-73 John  Christian  Laursen,  “The  Subversive  Kant:  The  Vocabulary  of  ‘Public’  and ‘Publicity’” in J. Schmidt (ed.) What is Enlightenment? 18 th Century Answers and 20 th Century Questions (Berkeley and Los Angeles: University of California Press, 1996) pp. 253-269 Mark  A.  Lemley,  “Property,  Intellectual  Property,  and  Free  Riding”  Texas  Law Review 83 (2005) pp.1031-1075 Lawrence Lessig, Free Culture: How Big Media Uses Technology and the Law to Lock Down Culture and Control Creativity (New York: Penguin, 2004) Robert  P.  Merges,  Justifying  Intellectual  Property  (Cambridge,  MA:  Harvard University Press, 2011) John Stuart Mill, On Liberty (1859) (London: Penguin, 1974) Neil  W.  Netanel,  “Alienability  Restrictions  and  the  Enhancement  of  Author Autonomy  in  United  States  and  Continental  Copyright  Law”  Cardozo  Arts  and Entertainment Law Journal 12 (1994) 1 Neil W. Netanel, Copyright’s Paradox (Oxford: Oxford University Press, 2008) Peter Niesen, “Colonialism and Hospitality” Politics and Ethics Review 3(1) (2007) pp. 90–108 Onora O’Neill, Constructions of Reason: Explorations of Kant’s Practical Philosophy (Cambridge: Cambridge University Press, 1989) Alan Patten, Hegel’s Idea of Freedom (Oxford: Oxford University Press, 2002) Thomas W. Pogge, “Kant’s Theory of Justice” Kant-Studien 79 (1988) pp.407-433 Joseph Raz, The Morality of Freedom (Oxford: Oxford University Press, 1988 Arthur  Ripstein,  Force  and  Freedom:  Kant’s  Legal  and  Political  Philosophy (Cambridge, Massachusetts: Harvard University Press, 2009) Cyrill P. Rigamonti, “The Conceptual Transformation of Moral Rights” (2007) 55 American Journal of Comparative Law 67 Pamela Samuelson, “Challenges in Mapping the Public Domain” in L. Guilbault and P.","cites":null},{"id":17291182,"title":"Perpetual Peace: Essays on Kant’s Cosmopolitan Ideal (Cambridge,","authors":[],"date":"1997","doi":"10.1017\/s0008423900009033","raw":"Lutz-Bachmann  (eds.)  Perpetual  Peace:  Essays  on  Kant’s  Cosmopolitan  Ideal (Cambridge, MA: MIT Press, 1997), pp.179-200 James Boyle, “The Second Enclosure Movement and the Construction of the Public Domain” Law & Contemporary Problems 66 (2003) pp.33-74 James  Boyle  and  Lawrence  Lessig  (eds.)  ‘Cultural  Environmentalism  @  10’  (a special issue of Law and Contemporary Problems 70(2) (2007) James Boyle, The Public Domain: Enclosing the Commons of the Mind (New Haven and London: Yale University Press, 2008) B. Sharon Byrd and Joachim Hruschka, Kant’s Doctrine of Right: A Commentary (Cambridge: Cambridge University Press, 2010) Georg Cavallar, Kant and the Theory and Practice of International Right (Cardiff: University of Wales Press 1999) Joseph Chan, “Raz on Liberal Rights and Common Goods” Oxford Journal of Legal Studies 15 (1995) pp.15-31 Olha O. Cherednychenko, “Fundamental Rights and Private Law: A Relationship of Subordination or Complementarity?” Utrecht Law Review 3(2) (2007) pp.1-25 John  Christman  and  Joel  Anderson,  Autonomy  and  the  Challenges  to  Liberalism (Cambridge: Cambridge University Press, 2005) Committee on Economic, Social and Cultural Rights, General Comment No. 17 U.N. Doc. E\/C.12\/GC\/17 (Nov. 21, 2005) Katerina  Deligiorgi,  Kant  and  the  Culture  of  Enlightenment  (Albany,  NY:  SUNY Press, 2005) Peter  Drahos  with  John  Braithwaite,  Information  Feudalism  (London:  Earthscan, 2002) Abraham Drassinower, “A Rights-Based View of the Idea\/Expression Dichotomy in Copyright Law” Canadian Journal of Law and & Jurisprudence 16 (2003) pp.3-21 Abraham Drassinower, “Taking User Rights Seriously” in Michael Geist, ed., In the Public Interest: The Future of Canadian Copyright Law, (Toronto:  Irwin Law, 2005), pp.462-479 Abraham  Drassinower,  “Authorship  as  Public  Address:  On  the  Specificity  of Copyright vis-à-vis Patent and Trade-Mark” Michigan State Law Review 1 (2008) pp.199-232 Kant, Copyright and Communicative Freedom forthcoming, Law and Philosophy (2011) Abraham Drassinower, “From Distribution to Dialogue: Remarks on the Concept of Balance in Copyright Law” 34(4) (2009) Journal of Corporation Law pp. 991-1007 Abraham Drassinower, “Capturing Ideas: Copyright and the Law of First Possession” (2006) 54 Cleveland State Law Review 191-204 Abraham Drassinower, “Copyright Infringement as Compelled Speech” (2011) (draft on file with the author) Gerald  Dworkin,  The  Theory  and  Practice  of  Autonomy  (Cambridge:  Cambridge University Press, 1991) Elisabeth Ellis, Kant’s Politics: Provisional Theory for an Uncertain World (New Haven: Yale University Press, 2005) Johann  G.  Fichte,  “Proof  of  the  Unlawfulness  of  Reprinting”  (Berlinische Monatschrift (1793), pp. 443-482, trans. Martha Woodmansee, in L. Bently & M.","cites":null},{"id":17291183,"title":"Primary Sources on Copyright (1450-1900) (available at: www.copyrighthistory.org) Katrin Flikschuh, Kant and Modern Political Philosophy (Cambridge:","authors":[],"date":"2000","doi":null,"raw":"Kretschmer  (eds.)  Primary  Sources  on  Copyright  (1450-1900)  (available  at: www.copyrighthistory.org) Katrin  Flikschuh,  Kant  and  Modern  Political  Philosophy  (Cambridge:  Cambridge University Press, 2000) Katrin Flikschuh, Freedom: Contemporary Liberal Perspectives (Cambridge: Polity Press 2007) Christophe Geiger, “‘Constitutionalising’” Intellectual Property Law? The Influence of Fundamental Rights on Intellectual Property in the European Union” IIC 37 (2006) pp.371-406 Dena  Goodman,  The  Republic  of  Letters:  A  Cultural  History  of  the  French Enlightenment (Ithaca: Cornell University Press, 1994) Lucie M.C.R. Guibault, Copyright Limitations and Contracts (The Hague, London and Boston: Kluwer, 2002) Jürgen Habermas, The Structural Transformation of the Public Sphere: An Inquiry into a Category of Bourgeois Society (1962) (Cambridge: Polity, 1989) David Hesmondhalgh, The Cultural Industries 2 nd ed. (London: Sage, 2007) Otfried  Höffe,  Kant’s  Cosmopolitan  Theory  of  Law  and  Peace,  (Cambridge: Cambridge University Press, 2006) Anthony  M.  Honoré,  “Ownership”  in  A.  G.  Guest  (ed.)  Oxford  Essays  in Jurisprudence (Oxford: Clarendon, 1961) Immanuel  Kant,  Critique  of  Pure  Reason  (1781)  (trans.  P.  Guyer  and  A.  Wood) (Cambridge: Cambridge University Press, 1998) Immanuel Kant, “An Answer to the Question: ‘What is Enlightenment?’” (1784) in Mary J. Gregor (ed.) Immanuel Kant: Practical Philosophy (Cambridge: Cambridge University Press 1998) pp.17-22 Immanuel Kant, “On the Wrongfulness of Unauthorized Publication of Books” (1785) in  Mary  J.  Gregor  (ed.)  Immanuel  Kant:  Practical  Philosophy  (Cambridge: Cambridge University Press 1998) pp.29-35 Immanuel Kant, Groundwork for the Metaphysics of Morals (1785) in Mary J. Gregor (ed.) Immanuel Kant: Practical Philosophy (Cambridge: Cambridge University Press 1998), pp.41-108 Immanuel Kant, “What is Orientation in Thinking” (1786) in H. Reiss (ed.) Kant’s Political Writings (2 nd ed.) (Cambridge: Cambridge University Press, 1991), pp.237-49 Immanuel  Kant,  Critique  of  Practical  Reason  (1788)  in  Mary  J.  Gregor  (ed.) Immanuel  Kant:  Practical  Philosophy  (Cambridge:  Cambridge  University  Press 1998), pp.137-271 Kant, Copyright and Communicative Freedom forthcoming, Law and Philosophy (2011) Immanuel  Kant,  Critique  of  Judgment  (1790)  (trans.  W.  S.  Pluhar)  (Indianapolis: Hackett, 1997) Immanuel Kant, The Metaphysics of Morals (1797), in Mary J. Gregor (ed.) Immanuel Kant: Practical Philosophy (Cambridge: Cambridge University Press 1998), pp.363-603 Immanuel Kant, “On the Common Saying: That may be Correct in Theory, but it is no use in Practice” (1793) in Mary J. Gregor (ed.) Immanuel Kant: Practical Philosophy (Cambridge: Cambridge University Press 1998), pp.279-309 Immanuel Kant, “Toward Perpetual Peace” (1795) in Mary J. Gregor (ed.) Immanuel Kant: Practical Philosophy (Cambridge: Cambridge University Press 1998), pp.315-351 Immanuel Kant, Anthropology from a Pragmatic Point of View (1798) trans. Mary J.","cites":null},{"id":17291186,"title":"The Future of the Public Domain: Identifying the Commons in Information Law (Kluwer: Alphen aan den Rijn,","authors":[],"date":"2006","doi":null,"raw":"B. Hugenholtz (eds.) The Future of the Public Domain: Identifying the Commons in Information Law (Kluwer: Alphen aan den Rijn, 2006), pp. 7-25 Kant, Copyright and Communicative Freedom forthcoming, Law and Philosophy (2011) Stig Strömholm, Le Droit Moral de l’Auteur (2 Vols.) (Stockholm: P.A. Norstedt & Söners Förlag, 1967) Leslie  Kim  Treiger-Bar-Am,  “Kant  on  Copyright:  Rights  of  Transformative Authorship” Cardozo Arts and Entertainment Law Journal (2008) pp.1059-1103 Howard  Williams,  “Liberty,  Equality  and  Independence:  Core  Concepts  in  Kant’s Political  Philosophy”  in  G.  Bird  (ed.)  A  Companion  to  Kant  (Oxford:  Blackwell, 2006), pp. 364-382 Raymond Williams, Culture (London: Fontana, 1981) Allen W. Wood, Kant’s Ethical Thought (Cambridge: Cambridge University Press, 1999) Allen  Wood,  Hegel’s  Ethical  Thought  (Cambridge:  Cambridge  University  Press, 1990)","cites":null},{"id":17291184,"title":"The Hague,","authors":[],"date":"1974","doi":null,"raw":"Gregor (Nijhoff: The Hague, 1974) Christopher Kelty, Two Bits: The Cultural Significance of Free Software (Durham and London: Duke University Press, 2008) Larry  Krasnoff,  “The  Fact  of  Politics:  History  and  Teleology  in  Kant”  European Journal of Philosophy 2(1) (1994) pp. 22-40 Jay Lampert, “Locke, Fichte and Hegel on the Right to Property” in M. Baur and J.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2012","abstract":"The rapid recent expansion of copyright law worldwide has sparked efforts to defend the ‘public domain’ of non-propertized information, often on the ground that an expansive public domain is a condition of a ‘free culture’. Yet questions remain about why the public domain is worth defending, what exactly a free culture is, and what role (if any) authors’ rights might play in relation to it. From the standard liberal perspective shared by many critics of copyright expansionism, the protection of individual expression by means of marketable property rights in authors’ works serves as an engine of progress towards a fully competitive ‘marketplace of ideas’ – though only if balanced by an extensive public domain from which users may draw in the exercise of their own expressivity. This article shows that a significantly different, and arguably richer, conception of what a free culture is and how authors’ rights underpin it emerges from a direct engagement with the philosophy of Immanuel Kant. For Kant, progress towards a fully emancipated (i.e. a ‘mature’ or ‘enlightened’) culture can only be achieved through the critical intellectual activity that public communication demands: individual expressive freedom is only a condition, not constitutive, of this ‘freedom to make public use of one’s reason in all matters’. The main thesis defended in this article is that when Kant’s writings on publicity (critical public debate) are read in relation to his writings on the legal organization of publishing, a necessary connection emerges between authors’ rights – as distinct from copyrights – and what Jürgen Habermas and others have named the public sphere. I conclude that it is the public sphere, and not the public domain as such, that should serve as the key reference point in any evaluation of copyright law’s role in relation to the possibility of a free culture","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/220175.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/37521\/1\/Kant_Copyright_and_Communicative_Freedom_%28lsero%29.pdf","pdfHashValue":"baf73ef245a7fe89ace6e175b7be2c6b90dc35eb","publisher":"Springer Netherlands","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:37521<\/identifier><datestamp>\n      2011-12-19T16:06:22Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4C4C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/37521\/<\/dc:relation><dc:title>\n        Kant, copyright and communicative freedom<\/dc:title><dc:creator>\n        Barron, Anne<\/dc:creator><dc:subject>\n        K Law (General)<\/dc:subject><dc:description>\n        The rapid recent expansion of copyright law worldwide has sparked efforts to defend the ‘public domain’ of non-propertized information, often on the ground that an expansive public domain is a condition of a ‘free culture’. Yet questions remain about why the public domain is worth defending, what exactly a free culture is, and what role (if any) authors’ rights might play in relation to it. From the standard liberal perspective shared by many critics of copyright expansionism, the protection of individual expression by means of marketable property rights in authors’ works serves as an engine of progress towards a fully competitive ‘marketplace of ideas’ – though only if balanced by an extensive public domain from which users may draw in the exercise of their own expressivity. This article shows that a significantly different, and arguably richer, conception of what a free culture is and how authors’ rights underpin it emerges from a direct engagement with the philosophy of Immanuel Kant. For Kant, progress towards a fully emancipated (i.e. a ‘mature’ or ‘enlightened’) culture can only be achieved through the critical intellectual activity that public communication demands: individual expressive freedom is only a condition, not constitutive, of this ‘freedom to make public use of one’s reason in all matters’. The main thesis defended in this article is that when Kant’s writings on publicity (critical public debate) are read in relation to his writings on the legal organization of publishing, a necessary connection emerges between authors’ rights – as distinct from copyrights – and what Jürgen Habermas and others have named the public sphere. I conclude that it is the public sphere, and not the public domain as such, that should serve as the key reference point in any evaluation of copyright law’s role in relation to the possibility of a free culture.<\/dc:description><dc:publisher>\n        Springer Netherlands<\/dc:publisher><dc:date>\n        2012<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/37521\/1\/Kant_Copyright_and_Communicative_Freedom_%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Barron, Anne  (2012) Kant, copyright and communicative freedom.  Law and Philosophy, 31 (1).  pp. 1-48.  ISSN 0167-5249     <\/dc:identifier><dc:relation>\n        http:\/\/www.springer.com\/philosophy\/value+theory\/journal\/10982<\/dc:relation><dc:relation>\n        10.1007\/s10982-011-9114-1<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/37521\/","http:\/\/www.springer.com\/philosophy\/value+theory\/journal\/10982","10.1007\/s10982-011-9114-1"],"year":2012,"topics":["K Law (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nAnne Barron \nKant, copyright and communicative \nfreedom \n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nBarron, Anne (2011) Kant, copyright and communicative freedom. Law and philosophy . pp. 1-\n48. \nDOI: 10.1007\/s10982-011-9114-1  \n \n© 2011 Springer Netherlands. The final publication is available at www.springerlink.com. \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/37521\/ \nAvailable in LSE Research Online: September 2011 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 1 \n \n \nKant, Copyright and Communicative Freedom \n \nAnne Barron, Law Department, London School of Economics and Political Science \n \n \nAbstract \n \nThe rapid recent expansion of copyright law worldwide has sparked efforts to defend \nthe ‘public domain’ of non-propertized information, often on the ground that an \nexpansive public domain is a condition of a ‘free culture. Yet questions remain about \nwhy the public domain is worth defending, what exactly a free culture is, and what \nrole (if any) authors' rights might play in relation to it. From the standard liberal \nperspective shared by many critics of copyright expansionism, the protection of \nindividual expression by means of marketable property rights in authors’ works serves \nas an engine of progress towards a fully competitive ‘marketplace of ideas’ – though \nonly if balanced by an extensive public domain from which users may draw in the \nexercise of their own expressivity. This article shows that a significantly different, and \narguably richer, conception of what a free culture is and how authors' rights underpin \nit emerges from a direct engagement with the philosophy of Immanuel Kant. For \nKant, progress towards a fully emancipated (i.e. a ‘mature’ or ‘enlightened’) culture \ncan only be achieved through the critical intellectual activity that public \ncommunication demands: individual expressive freedom is only a condition, not \nconstitutive, of this ‘freedom to make public use of one’s reason in all matters’. The \nmain thesis defended in this article is that when Kant's writings on publicity (critical \npublic debate) are read in relation to his writings on the legal organization of \npublishing, a necessary connection emerges between authors' rights – as distinct from \ncopyrights – and what Jürgen Habermas and others have named the public sphere. I \nconclude that it is the public sphere, and not the public domain as such, that should \nserve as the key reference point in any evaluation of copyright law’s role in relation to \nthe possibility of a free culture.  \n \nKeywords: Kant; authors’ rights; copyright; intellectual property; public reason; \npublic sphere; Habermas. \n \n \nIntroduction \n \nAs currently institutionalized, copyrights are property rights that subsist in the ‘works’ \nof authors, where works are legally defined to include all the intellectual products \nmarketed by the cultural and information industries as publications, broadcast and \nonline content, and software. Copyrights have two key features that they share with \nother species of property right: they are alienable, and they equip their holders with the \npower to exclude all others from the (intangible) objects in which they subsist. The \npower of exclusion is by no means absolute: for example, copyrights are limited in \nduration and in extent,1 and copyright law recognizes would-be users of the works that \n                                                 \n1\n A copyright in a work in fact comprises an array of property rights to control reproduction of the \nwork, various forms of distribution of copies of the work (paradigmatically by sale), and all kinds of \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 2 \nit protects as having privileges to use them for certain purposes without incurring \nliability.2 Nonetheless, the subsistence of a copyright in a work entitles the holder of \nthe copyright to control (i.e. veto or licence, in return for royalties) certain uses of the \nwork by anyone else within the jurisdiction, and indeed beyond.3  \n \nIn common law jurisdictions, the copyright system has on the whole tended to be \njustified in liberal-utilitarian terms, more particularly in terms of its contribution to \nachieving an efficient allocation of society’s scarce resources. According to the \nstandard economic analysis, an efficient regime of copyright protection is a ‘balanced’ \nregime that limits the unpaid use of ‘information goods’ just enough to ensure that \nincentives are available to motivate their production, but no more. In the past couple \nof decades this paradigm for understanding copyright law has been challenged by \nwhat Mark Lemley has described as an ‘absolute protection’ or ‘full value’ view of \nintellectual property (IP),4 informed by neoclassical property rights theory and \ndefined by a strong commitment to the idea that private property rights should ideally \nextend to every valued use of information goods, such that users would be required by \nlaw to pay the owner’s price for any such use except in atypical instances of \nunavoidable market failure. Arguably, the expansion that copyright law has \nundergone at national, regional and international levels over the last two decades in \nparticular has been legitimated by the rise to ascendancy of this way of thinking, the \nunderlying assumption of which is that cultural development and the advancement of \nknowledge are best secured by privatizing the ‘raw materials’ of these processes. \n \nThis assumption is contested in a large literature (and an associated political \nmovement) that has emerged by way of a backlash against IP expansionism and the \nhegemony of its justificatory theory. Here the category of the ‘public domain’ plays a \nkey role. In ordinary parlance, information is said to be in the public domain when it \nis publicly available, i.e. not secret. In the context of the contemporary resistance to IP \nexpansionism, however, it generally refers to “information resources that are \nunencumbered by intellectual property rights”5 as well as being publicly available in \nthat sense. Defenders of this public domain argue strenuously against its colonization \n                                                                                                                                            \npublic communication (including public performance and electronic transmission) of the work. (See \ne.g. the Copyright, Designs and Patents Act (UK), c.48 ss.17-21 (1988); US Copyright Act, 17 USC \n§106 (1976).) However a copyright is not an ownership right (compare Honoré’s list of the ‘standard \nincidents’ of full ownership: Anthony M. Honoré, “Ownership” in Anthony G. Guest (ed.) Oxford \nEssays in Jurisprudence (Oxford: Clarendon, 1961). In Hohfeldian terms, it could be said that the \n‘bundle of rights’ comprised in a copyright is relatively thin. \n2\n For example, Chapter III of the UK’s Copyright, Designs and Patents Act 1988 exempts ‘fair’ use of \na work in some circumstances for certain approved purposes – non-commercial research and private \nstudy, criticism or review, and news reporting – and includes a lengthy catalogue of more narrowly \ndefined exemptions. \n3\n The Berne Convention for the Protection of Literary and Artistic Works sets out minimum standards \nof copyright protection that must be available in every signatory state to nationals of other signatory \nstates. Further, Article 9.1 of the Agreement on Trade-Related Aspects of Intellectual Property Rights – \none of the agreements administered by the World Trade Organization (WTO) – puts WTO members \nunder an obligation to comply with the Berne Convention, and adds a substantial number of additional \nobligations that go beyond those imposed by membership of the Berne Union. \n4\n Mark A. Lemley, “Property, Intellectual Property, and Free Riding” Texas Law Review 83 (2005) \npp.1031-1075 (criticizing the absolute protection view). \n5\n Pamela Samuelson, “Challenges in Mapping the Public Domain” in L. Guilbault and P. B. Hugenholtz \n(eds.) The Future of the Public Domain: Identifying the Commons in Information Law (Kluwer: Alphen \naan den Rijn, 2006), pp.7-25. \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 3 \nvia the ‘second enclosure movement’6 that they claim is represented by IP \nexpansionism and legitimated by neoclassical economic theory. They argue for a \npositive re-valuation of non-propertized ‘information resources’: overcoming the \nnegative representation of the public domain as a kind of wasteland, “a sad jumble of \nthings that don’t deserve to be protected by intellectual property laws or … a \nnetherworld where old information goes to die,”7 as one sympathetic commentator has \nput it. There is now a well-established tendency to conceptualize the public domain as \na kind of cultural ‘environment,’8 which in turn has yielded calls for strategies of \n‘environmental preservation’ analogous to those around which the environmental \nmovement took shape in the 1970s. Yet these tendencies are frequently underpinned \nby concerns to emphasize the economic value of the public domain and the \ninefficiencies that can result from privatizing its contents, and this tends only to \nreinforce liberal-utilitarianism’s hegemony as the privileged lens through which to \nview copyright law and the fields that it affects.9 So while it is easy to be sympathetic \ntowards the general ambition underlying these arguments, the arguments themselves \nhave not so far been premised on a particularly rich understanding of what ‘culture’ \nis, what its social dynamics are, and what exactly, therefore, is threatened by IP \nexpansionism in general and copyright expansionism in particular. This article forms \npart of an ongoing project to address these questions.  \n \nOne promising starting point from which to begin to address them is the idea that an \nauthor is a kind of speaker (i.e. one who creates works with a view to communicating \nwith a public), that ‘culture’ is the realm in which dialogue between speakers occurs, \nand that copyright law rightly forms part of the legal framework that facilitates this \ndialogue. Theorists of copyright law who adopt this starting point frequently assume \nthat authorial rights (as well as limits on these rights) are legitimated by a more \ngeneral individual right to freedom of expression, with copyright law – as the United \nStates Supreme Court famously put it in 1985 – serving as the ‘engine’ of free \nexpression by establishing marketable rights in expressive products.10 On this \nstandard liberal view, culture is envisioned on the model of a ‘marketplace of ideas’, \nunderpinned by an actual market in authors’ works, which in turn is underpinned in \nvarious ways by law. In so far as copyright law helps to produce the conditions in \nwhich competitive markets in authors’ works can flourish, it is said to be consistent \nwith freedom of expression.11 Its recent expansionary tendencies – which have made \ncopyrights ever less like the limited property rights they were originally designed to \nbe, and ever more like rights of absolute dominion over intellectual creations – have \nyielded a standard diagnosis of how copyright law can threaten freedom of \n                                                 \n6\n James Boyle, “The Second Enclosure Movement and the Construction of the Public Domain” Law & \nContemporary Problems 66 (2003) pp.33-74. \n7\n Samuelson, “Challenges in Mapping the Public Domain,” p.7. \n8\n See e.g. the papers published as a special issue of Law and Contemporary Problems on the theme of \n‘Cultural Environmentalism @ 10’ (2007, Vol. 70, No. 2), and James Boyle, The Public Domain: \nEnclosing the Commons of the Mind (New Haven & London: Yale University Press, 2008). \n9\n On this see Anne Barron, “Copyright Infringement, ‘Free-Riding’ and the Lifeworld” in Lionel \nBently, Jennifer Davis and Jane Ginsburg (eds.) Copyright and Piracy: An Interdisciplinary Critique \n(Cambridge: Cambridge University Press, 2010), pp.93-127.  \n10\n Harper & Row, Publishers, Inc. v. Nation Enterprises 471 U.S. 539 (1985) (“By establishing a \nmarketable right to the use of one’s expression, copyright supplies the economic incentive to create and \ndisseminate ideas” (ibid. p. 558)). \n11\n For an exemplary study in this vein, see Neil Weinstock Netanel, Copyright’s Paradox (Oxford: \nOxford University Press, 2008). \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 4 \nexpression. Given the oligopolistic structure of markets for cultural commodities, \nbloated copyrights produce a ‘permission culture’ that chills expression (since \npermission to use copyright material as raw material for follow-on creativity “is not \noften granted to the critical or independent”).12 The negative liberty of individuals is \nthereby endangered; some have argued that space for the self-cultivation of each \nindividual’s potentialities (‘autonomy’ as understood within the tradition that includes \nJ.S. Mill and Joseph Raz) is also restricted.13 Consequently, the benefits that accrue to \nsociety as a whole from the clamour of competing claims and perspectives – a \ndiversity of opinions and forms of creativity, information which is reliable because \ntested in the heat of public debate, the dissemination of knowledge, a more effective \ndemocracy – are diminished. From the perspective of this liberalism, a free culture \nemerges from the freedoms of individuals to say what they choose to say and \nexperience what others choose to say, unhindered in either dimension by intellectual \nproperty rights unless aggregate welfare (or on the Razian view, liberal-democratic \nculture as a ‘common good’)14 is thereby advanced.  \n \nMy claim in this article is that a significantly different, and arguably richer, \nconception of what a free culture entails and how the rights of authors relate to it \nemerges from a direct engagement with the philosophy of Immanuel Kant.15 The \nimmediate justification for turning to Kant in this context is that he dealt very directly \nwith the issue of authors’ rights – first in an essay published in 178516 (hereinafter \n‘1785 Essay’) and again briefly in a section – entitled “What is a Book” – of his late \nwork of political philosophy, Part I of The Metaphysics of Morals.17 Moreover, he \ntheorized these rights as speech rights, and not as rights of property in works \n                                                 \n12\n Lawrence Lessig, Free Culture: How Big Media Uses Technology and the Law to Lock Down \nCulture and Control Creativity (New York: Penguin, 2004), p.10. \n13\n Yochai Benkler’s critique of copyright’s expansionary tendencies seems to proceed from a liberal \nperfectionism indebted to Joseph Raz and ultimately to J.S. Mill (see in particular his “Free as the Air \nto Common Use: First Amendment Constraints on Enclosure of the Public Domain” (1999) 74 N.Y.U. \nL.Rev. 354 and “Siren Songs and Amish Children: Autonomy, Information and Law” 76 (2001) N.Y.U. \nL. Rev. 23). For an accessible statement of Benkler’s position, see his The Wealth of Networks (New \nHaven and London: Yale University Press, 2006), esp. Ch. 5 (arguing that the ‘industrial’ organization \nof information production, underpinned by strong copyrights, enables the flow of information to \nindividuals to be shaped by a few large corporations, limiting individuals’ capacities to ‘author their \nown lives’).  \n14\n From the Razian perspective, a liberal-democratic culture is a common good because it not only \nserves the interests of individual rights-bearers but also advances the conditions under which all \nmembers of a society could achieve personal autonomy (see e.g. Joseph Raz, The Morality of Freedom \n(Oxford: Oxford University Press, 1988). On the relationship between the utilitarian principle of \naggregate utility and Raz’s conception of the common or general good, see generally Joseph Chan, \n“Raz on Liberal Rights and Common Goods” Oxford Journal of Legal Studies 15 (1995) pp.15-31.  \n15\n Page references to all of Kant’s works cited in this article – except those collected in H. Reiss (ed.) \nKant’s Political Writings (2nd ed.) (Cambridge: Cambridge University Press, 1991) – include in \nparentheses references by volume:page number to the Prussian Academy edition of Kant’s works. \nReferences to the Critique of Pure Reason include in parentheses references to the pagination of the \nfirst and second editions, indicated by the letters ‘A’ and ‘B’ respectively. \n16\n Immanuel Kant, “On the Wrongfulness of Unauthorized Publication of Books” (1785), in Mary J. \nGregor (ed.) Immanuel Kant: Practical Philosophy (Cambridge: Cambridge University Press 1998) \npp.29-35 (8:79-87). (References to the Essay are all to this translation.) \n17\n Immanuel Kant, The Metaphysics of Morals (1797), in Gregor (ed.), Immanuel Kant: Practical \nPhilosophy, pp.353-603, at pp.437-438 (6:289-291).  (References to The Metaphysics of Morals are all \nto this translation.) \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 5 \nconsidered as crystallizations of their authors’ communications.18 The most well-\nknown of the arguments contained in these writings can be briefly outlined. Kant’s \npremise is that a book considered as a material object must be distinguished from a \nbook considered as the vehicle for an activity of authorial speech. On the one hand, an \nauthor’s manuscript, and every printed copy of it, is an ordinary object of property \nattracting an ordinary right of property vested in whomever is legitimately in \npossession of the object. This right would include the right to use the object, to sell \nthe object and indeed to copy the object. On the other hand, a published book \n(considered as the vehicle of its author’s speech) is also a communication from \npublisher to public in the name of the author. Hence it is also an action, and as such it \nhas its existence in a person – the person of the author. For Kant, it follows that \nunauthorized publication of copies of the author’s text – though not unauthorized \nreproduction as such – is wrongful. By selling copies of an author’s text to the public, \nthe unauthorized publisher is not just dealing with commodities – printed books – in \nhis own name, but is disseminating an author’s speech, thus compelling the author to \nspeak against his will,19 to acknowledge the book as his own and be responsible for \nit.20 Actions “belong exclusively to the person of the author, and the author has in \nthem an inalienable right always himself to speak through anyone else, the right, that \nis, that no one may deliver the same speech to the public other than in his (the \nauthor’s) name”21 or deliver a fundamentally altered speech in his name.22 However if \n                                                 \n18\n This has been contested, most influentially by Kant’s younger contemporary, Johann Fichte. In 1793, \nFichte – citing Kant’s 1785 Essay in support – argued that an author has a “natural, inborn, and \ninalienable right of ownership” in his work (Johann G. Fichte “Proof of the Unlawfulness of \nReprinting” (Berlinische Monatschrift (1793), pp. 443-482, p.461 and 472-3 (trans. Martha \nWoodmansee, in L. Bently & M. Kretschmer (eds.) Primary Sources on Copyright (1450-1900), \navailable at: www.copyrighthistory.org). An author’s book, Fichte argued, consists of three aspects. It \nhas a physical aspect (the manuscript or printed book), and an ideal aspect which is in turn divisible \ninto two: the ideas expressed by the author and the ‘form’ of the author’s expression of those ideas: \n“the way in which, the combination in which, the phrasing and wording in which they are presented” \n(ibid p. 447) Although ideas become the common property of all as soon as a book is published, the \nform in which they are expressed, Fichte argued, “remains forever … [the author’s] exclusive \nproperty” (ibid p. 451). Fichte claimed that this followed from Kant’s argument in the 1785 Essay that \na book is a use of the author's faculties. That activity, according to Fichte, consists in giving form to \nthoughts, “so that it is through [the author] – and only in that particular form which he has defined for it \n– that the book is able to exist” (ibid p. 472). Fichte’s claim here appears to be that because each \nindividual’s process of giving form to thoughts is unique to him- or herself, the resulting form is that \nperson’s exclusive and inalienable property. Nothing in the 1785 Essay supports this claim. Moreover, \nit is not in accordance with Kant’s thinking, because it depends on an idea of self-actualization through \nownership to which Kant did not adhere. Fichte here, as on many other questions, is closer to his \nintellectual successor Hegel than to his predecessor Kant (see further Allen Wood, Hegel’s Ethical \nThought (Cambridge: Cambridge University Press, 1990), Ch. 4 and 5; Jay Lampert, “Locke, Fichte \nand Hegel on the Right to Property” in M. Baur and J. Russon (eds.) Hegel and the Tradition: Essays \nin Honour of H.S. Harris  (Toronto: University of Toronto Press, 1997), pp.40-73; Alan Patten, Hegel’s \nIdea of Freedom (Oxford: Oxford University Press, 2002), Ch. 5). \n19\n “The author and someone who owns a copy can both, with equal right, say of the same book, ‘it is \nmy book,’ but in different senses. The former takes the book as writing or speech, the second merely as \nthe mute instrument of delivering speech to him or the public, i.e. as a copy. This right of the author is, \nhowever, not a right to a thing, namely to the copy (for the owner can burn it before the author’s eyes), \nbut an innate right in his own person, namely, to prevent another from having him speak to the public \nwithout his consent, which consent certainly cannot be presumed because he has already given it \nexclusively to someone else” (Kant, “On the Wrongfulness of Unauthorized Publication of Books” \np.35 (footnote to text at 8:87), emphasis added). \n20\n Ibid. p.33 (8:84). \n21\n Ibid. p.35 (8:86).  \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 6 \nthe work is indeed so altered that it would be wrong to attribute it to the author, it can \nrightfully be published in the modifier’s name.23  \n \nThese remarks on authors’ rights have not gone unnoticed by copyright lawyers. On \nthe contrary, Kant’s 1785 Essay is often cited as inspiration for the theory – now \ninstitutionalized in international copyright law – that authors ought to have inalienable \n‘moral’ rights in relation to their works.24 These are enforceable legal rights which are \n‘moral’ in the sense that they concern authors’ non-pecuniary interests in relation to \ntheir works (such as the interest in being identified as author, and in ensuring that \none’s works are published only in the form in which they were created); and they \ncontrast with the economic rights (e.g. to control the reproduction and distribution of \ncopies) which protect authors’ pecuniary interests in the commercial exploitation of \ntheir works. Yet moral rights in practice afford far less protection to authors than the \ntheory would suggest, and transferable economic rights to the most commercially \nvaluable works are more often than not held by corporate investors. And since it is \neconomic rights which are the focus of concerns about copyright expansionism and its \nimplications for the public domain, the formal recognition of a doctrine of moral \nrights has done little to allay these concerns.  \n \nHowever, in the fairly recent past, there has been renewed scholarly interest in \nexploring not only the 1785 Essay, but also Kant’s better-known philosophical texts, \nfor more comprehensive insights about how copyright law in general might be re-\nthought so as to give more weight to the rights of ‘transformative’ authors – those \nwho, in re-using authored material, also modify that material – and thereby also \nimbue the public domain of freely re-usable intellectual artefacts with a richer \nnormative significance. Against the grain of Kant’s own writings, Leslie Kim Treiger-\nBar-Am has attempted to derive a right to what she calls ‘autonomy of expression’ \nfrom a conception of moral autonomy that she takes from Kant’s ethical theory. She \nargues that the 1785 Essay can be read as defining a structure of authorial rights to \nautonomy of expression, necessitated by the respect due to individual dignity, which \nin turn is grounded in a universal capacity for moral autonomy.25 From this structure \n                                                                                                                                            \n22\n For Kant, this inalienable personal right only arises in relation to a particular class of thing: \nmanuscripts or books incorporating writings. While the literary ‘action’ can always be distinguished \nfrom the printed book, in the work of visual art the idea or intellectual element cannot be separated \nfrom the material object, and for this reason Kant excludes paintings and sculptures from the category \nof works protected by a personal right to prevent the distribution of copies: a work of visual art, it \nwould seem, is merely a thing (ibid. p.34 (8:85-6)). \n23\n Ibid. p.35 (8:86-7). \n24\n There are extensive literatures on the historical emergence of authors’ moral rights and on their \nconceptual relationship with authors’ economic rights (for an exemplary analysis, see Stig Strömholm, \nLe Droit Moral de l’Auteur (2 Vols.) (Stockholm: P.A. Norstedt & Söners Förlag, 1967)). It suffices \nfor present purposes to say that, as currently understood, moral rights rest on a theorization of authors’ \nworks as manifesting the author’s person, and hence as attracting a species of inalienable ‘personality’ \nright that is specific to authors (see further on the rise to global dominance of this theorization, Cyrill P. \nRigamonti, “The Conceptual Transformation of Moral Rights” (2007) 55 Am. J. Comp. L. 67). It is not \nuncommon for proponents of this theorization to seek to support it by reference to Kant’s 1785 Essay \n(see e.g. Strömholm, Le Droit Moral de l’Auteur pp.184-95). The analysis of the Essay I propose here, \nhowever, suggests that these interpretations miss the point of Kant’s reflections on authors’ rights. \n25\n Leslie Kim Treiger-Bar-Am, “Kant on Copyright: Rights of Transformative Authorship” Cardozo \nArts and Entertainment Law Journal (2008) pp.1059-1103. “The autonomy that affords the capacity to \nself-legislate is the ground of a rational being’s dignity…. Because we are autonomous, we deserve \nrespect for our dignity…. Autonomy therefore grounds both [the unconditional and universal right to \nrespect for] the dignity of autonomous beings and also their obligation to respect the dignity of others” \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 7 \nof authorial rights, she argues, it can be inferred that the transformative re-use of a \nfirst author’s work by a second author ought to attract the same rights (and the same \ncorrelative duties) as the first author’s expressive act. Abraham Drassinower too has \ninvoked the 1785 Essay in the process of reaching similar conclusions regarding \ntransformative authorship.26 However in contrast to Treiger-Bar-Am, Drassinower has \ntended to orient himself by reference to Kant’s philosophy of law, although he too at \ntimes seeks to account for the rights of authors in general in terms of the ‘respect’ \nowed to the ‘autonomy’ or ‘dignity’ of the individual:27 terms that derive from Kant’s \nethical theory. In a series of thoughtful and important articles, Drassinower has for \nexample drawn on the principle of equal external freedom that animates Kant’s legal \ntheory to elaborate a conception of the public domain (of intellectual materials which \nmay be freely used by others) as a necessary limit to the author’s right, generated by \nthe internal logic of that right itself. His central theme has been that a justifiable \ncopyright regime must be one that secures equal expressive freedom as between \nauthors and users of copyright material. \n \nHelpful though these contributions have been in rescuing the 1785 Essay from relative \nobscurity and making it relevant to contemporary debates – including in particular \nthose sparked by the rise of Web 2.0 and the ubiquity of (re)user-generated digital \n‘content’ – they do not in the end depart from the standard liberal model of expressive \nfreedom that was outlined above. Effectively, they assimilate Kant’s conception of \nfreedom to the idea(s) of freedom embedded in that model, thereby continuing the \nhabit – most recently exemplified in the IP context by Robert P. Merges’s Justifying \nIntellectual Property28 – of representing Kant as the originator of a liberal \nindividualism now widely associated with figures such as Ronald Dworkin and John \nRawls. In what follows, I contest this representation on the ground that it is \ninconsistent with both the letter of Kant’s texts and the spirit animating his \nphilosophical system. In particular, it involves conflating conceptions and forms of \n                                                                                                                                            \n(ibid. pp.1099-1100). \n26\n Abraham Drassinower “A Rights-Based View of the Idea\/Expression Dichotomy in Copyright Law” \nCanadian Journal of Law and & Jurisprudence 16 (2003) pp.3-21; “Taking User Rights Seriously” in \nMichael Geist, ed., In the Public Interest: The Future of Canadian Copyright Law, (Toronto:  Irwin \nLaw, 2005), pp.462-479; “Authorship as Public Address: On the Specificity of Copyright vis-à-vis \nPatent and Trade-Mark” Michigan State Law Review 1 (2008) pp.199-232; “From Distribution to \nDialogue: Remarks on the Concept of Balance in Copyright Law” 34(4) (2009) Journal of Corporation \nLaw pp. 991-1007; “Copyright Infringement as Compelled Speech” (2011) (draft article on file with \nthe author).  \n27\n See especially “A Rights-Based View of the Idea\/Expression Dichotomy,” “Taking User Rights \nSeriously” and “Copyright Infringement as Compelled Speech.” \n28\n Robert P. Merges, Justifying Intellectual Property (Cambridge, MA: Harvard University Press, \n2011). Proclaiming a loss of faith in the utilitarianism that has hitherto guided his writings on IP, \nMerges here seeks to incorporate a reading of Kant’s theory of property (together with those of Locke \nand Rawls) into “a liberal theory of intellectual property law” (ibid. p.13) that he hopes will equip the \nfield with a more credible normative foundation. Kant is important to this project because, for Merges, \n“[h]is thought upends amorphous concepts of collective interest and utilitarian balancing, replacing \nthem with [an] … idea of personal autonomy” (ibid. p.17) as “the ability to steer oneself according to \none’s own plan and design” (ibid. p.18). Taking Kant seriously thus results in “a more clear-headed \nfocus” (ibid.) on intellectual property as an individual – though alienable (ibid. p.81) – right which \ntakes precedence over “third-party interests” (ibid. p.17). From this interpretation of the centrality of \npersonal autonomy and individual rights to Kant’s philosophy – an interpretation broadly congruent \nwith that of Treiger-Bar-Am and Drassinower – Merges is able to reach a diametrically opposed \nconclusion: “An infusion of Kant promises to help correct the recent and intense emphasis on the rights \nof users and consumers of IP” (ibid., emphasis added).  \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 8 \nfreedom that for Kant were quite distinct, albeit closely related – agency and \nautonomy; moral autonomy and intellectual autonomy; expressive freedom and \ncommunicative freedom; individual liberty and collective emancipation. I argue that a \nfull appreciation of the significance for copyright law of the1785 Essay requires that \nthese distinctions be kept firmly in mind, which in turn requires that the Essay be read \nin relation to Kant’s philosophical project as a whole, but in particular his vindication \nof “the freedom to make public use of one’s reason in all matters.”29 Drawing \nespecially on Onora O’Neill’s interpretation of the various writings in which Kant \nexplains the basis and significance of this freedom,30 I argue that what he envisages \nhere is a principled freedom – a freedom to engage in what O’Neill has called \n‘tolerant’ communication. On one hand, ‘toleration’ names a particular attitude \ntoward – indeed a practice in relation to – the communications of other persons: it is a \nresponse to communication31 which involves at the very least a recognition on the \npart of the addressee that she is addressed by another’s communication. On the other \nhand, toleration also names the act of communicating itself in so far as it aspires \ntowards what Kant called ‘maturity’ – that is, in so far as it aims to be critical and \nreflective in relation to what we would now call dominant worldviews, hegemonic \nideologies, homogenized cultures, embedded traditions or established forms of \nexpertise – while also being open to the mature perspectives of others. To \ncommunicate in this spirit of toleration is to participate in a communication \ncommunity which is engaged in a collective project: that of advancing towards a fully \nmature, or truly emancipated, culture. It is the possibility of this community, I argue, \nthat is truly at stake in contemporary resistances to copyright expansionism. \nRethinking authors’ rights as a structure of equal and reciprocal freedoms for \nindividual authors and their addressees is only one aspect of what a Kantian approach \nto copyright law demands. More broadly, Kant’s philosophy calls for an interrogation \nof how copyright law and the practices it underpins relate to that process of collective \nemancipation which is enabled by tolerant communicative interactions. \n \nThe structure of the article is as follows. Section 1 presents an analysis of the \nunderstanding of freedom contained in Kant’s practical philosophy. In 1.1 the core \nelements of Kant’s ethical theory – and in particular his understanding of (moral) \nautonomy – are briefly introduced. However the bulk of this section (1.2) is devoted \nto Kant’s legal theory (in particular his Doctrine of Right), because it is of more direct \nrelevance to the interpretation of the 1785 Essay on authors’ rights. Having noted the \ncentrality to this theory of the idea of progress towards a just political order, and the \nposition Kant assigns to ‘publicity’ (open public debate) as the motor of this progress, \nI move in Section 2 to an analysis of the meaning and significance, for Kant, of free \npublic criticism more generally. In Section 3, I consider the 1785 Essay against the \nbackdrop formed by Kant’s critical philosophy as a whole – but in particular the \nDoctrine of Right and his conception of public reason – with a view to uncovering the \nsystematic connections uniting all of these dimensions of his thought. Once these \nconnections are appreciated, it will be apparent that Kant’s philosophical system \nyields a rich and complex picture of the significance of authors’ rights; and, as I argue \n                                                 \n29\n Immanuel Kant, “An Answer to the Question: ‘What is Enlightenment?’” (1784) [hereinafter “What \nis Enlightenment?”] in Gregor (ed.) Immanuel Kant: Practical Philosophy pp.17-22 (8:35-8:42), p.18. \n(All references to “What is Enlightenment?” are to this translation.) \n30\n Onora O’Neill, Constructions of Reason: Explorations of Kant’s Practical Philosophy (Cambridge: \nCambridge University Press, 1989). \n31\n Ibid. p.32 \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 9 \nin Section 4, can inspire a more radical rethinking of copyright law’s role in relation \nto communicative freedom than has thus far been imagined. \n \n \n1 Kant’s Understanding of Practical Freedom  \n \n1.1 Freedom as Autonomy: Kant’s Ethical Theory \n \nThe idea of autonomy occupies a central place in contemporary liberal thought.32 As \nwe shall see, it is also central to Kant’s philosophy – but it is a mistake to assume that \n‘it’ is the same idea of autonomy. When contemporary liberals refer to autonomy, \nthey generally have in mind the vision of positive freedom set out by John Stuart Mill \nin his classic essay On Liberty:33 personal autonomy as the free development of \n‘individuality’ through the self-cultivation of one’s natural potentialities. Autonomy \nin this sense presupposes a private domain in which to make one’s own choices and \nform one’s own life-plans free of interference from others except to the extent that \nthose plans prejudice the legitimate interests of other individuals.34 More particularly, \nit involves turning one’s wants and inclinations into expressions of one’s own nature, \nas developed by sustained activities of self-formation and self-government. This \nconception of autonomy is very different from – and in many ways at odds with – \nKant’s account of moral autonomy as the submission of subjectively experienced \nwants and inclinations to the jurisdiction of an objectively valid moral law.35 Involved \nin his account is a characterization of the human capacity to will as manifesting itself \nin two ways. As Willkür, the will can be considered as a kind of legislative and \nexecutive authority, determining our rules of action and implementing them through \naction; as Wille, it can be regarded as a kind of constitutional authority, testing our \nordinary rules of action against the supreme moral law ordained by pure reason. In \nordinary practical reasoning, the rules legislated by Willkür have a hypothetical form: \n‘if I want x, I ought to do y’. Viewed from a Kantian perspective, Millian autonomy \nengages only Willkür, albeit in a particularly refined way: it presupposes a process of \n‘intelligent self-mastery’, through which we decide between our wants with a view to \nsatisfying those that will realize our potentialities most completely. For Kant, \nhowever, action which is conditioned in any way by wants or ‘inclinations’ is not \nautonomous, but heteronomous. Certainly, the will’s process of legislating and \nexecuting ordinary rules of action exhibits a kind of freedom – the freedom to choose \nwhich of our wants to pursue and how to pursue them. But action governed by such \nrules is not completely self-determined, because the rules themselves are dictated in \n                                                 \n32\n Gerald Dworkin, The Theory and Practice of Autonomy (Cambridge: Cambridge University Press, \n1991). For critical reflections, see John Christman and Joel Anderson, Autonomy and the Challenges to \nLiberalism (Cambridge: Cambridge University Press, 2005); Katrin Flikschuh, Freedom: \nContemporary Liberal Perspectives (Cambridge: Polity Press 2007). \n33\n John Stuart Mill, On Liberty (1859) (London: Penguin, 1974), esp. Ch. III. \n34\n Treiger-Bar-Am’s notion of ‘autonomy of authorial expression’ is clearly informed by this liberal \nconception of autonomy: see her “Kant on Copyright” pp.1070-1; 1075-6 1082-4; 1093-99. So too is \nthe conception of the creative individual’s personal autonomy invoked by Robert Merges in his \nJustifying Intellectual Property: see ibid. pp.70-83. The fundamental problem with these analyses is \nthat they proceed from the erroneous assumption that this conception of autonomy is also Kant’s. \n35\n The key texts in which the elements of Kant’s moral theory are presented are: Groundwork for the \nMetaphysics of Morals (1785), in Gregor (ed.) Immanuel Kant: Practical Philosophy, pp.41-108 \n(4:385-4:463); Critique of Practical Reason (1788), in Gregor (ed.) Immanuel Kant: Practical \nPhilosophy pp.137-271 (5:1-5:163); and Part II of The Metaphysics of Morals (1797), in Gregor (ed.) \nImmanuel Kant: Practical Philosophy pp.507-603 (6:373-6:493). \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 10 \npart by something merely given: the object of a want. It follows that what ultimately \ncauses one’s action here is this object – or, broadly, ‘nature.’ The will takes as given a \nnaturally occurring inclination and decides only on the means of its fulfilment.  \n \nNonetheless, the limited form of freedom involved with these operations of Willkür \nnecessarily, for Kant, presupposes a still higher form of freedom, whereby action is \ndetermined by reason alone. Kant calls this higher form of freedom free will, or \n‘autonomy’, and argues that it is engaged when Wille tests our rules of action for their \nmoral validity. Wille’s ‘pure’ use of practical reason involves transcending our \nempirically given wants and deciding what we ought to do from the viewpoint of pure \nreason; and it is only when we act according to reason that we are truly autonomous. \nThe first formulation of Kant’s Categorical Imperative captures what this entails: \nWille mandates that in any action situation, our rules of action be universalizable as \nlaws that any rational being could adopt to govern their actions.36 In observing this \n‘constitutional’ principle, we disregard any motive for action that could only be \nattributable to our particular inclinations, and realize the capacity of the human will to \nbe truly autonomous. Kant took the view that every human being must be regarded as \nhaving the capacity for freedom in this sense. Hence the second formulation of the \nCategorical Imperative requires respect for the rational autonomy (or ‘dignity’) \ninhering in every human being: ‘act so that you treat humanity, whether in your own \nperson or in the person of any other, always as an end and never as a means only.’37 \nTo treat a person as an end and never simply as a means to one’s ends is to treat that \nperson as a being who could rationally endorse the reasons underlying one’s actions.  \n \n1.2 Freedom as Agency: Kant’s Legal Theory \n \nKant himself does not base authors’ rights – or rights generally – directly on the idea \nof moral autonomy. Rather, he elaborates a distinct philosophy of law, the Doctrine of \nRight (the Rechtslehre, which comprises Part I of The Metaphysics of Morals) \nprecisely in order to deal with the contradiction between the idea of self-determination \nin accordance with a universal moral law, and the idea of Right as that set of universal \nmoral norms which may be enforced: a right, after all, is “an authorisation to use \ncoercion”38 against another. It is Kant’s Universal Principle of Right, not his \nCategorical Imperative, which provides the moral justification for this use of force. \nThe need for a distinct principle authorising coercion arises from the inevitability of \nconflict between human beings in a context of finitude: a spatially limited planet, \nlimited resources, and (consequently) human competition for the means of survival in \na shared world. The concept of Right emerges from the interplay of these unavoidable \nempirical conditions with the (moral) principles according to which relations between \npersons should be formed. \n \nBoth Kant’s ethical theory and his theory of Right are organized around the idea of \nfreedom in conformity with law (and so are united as distinct parts of his overarching \nmoral philosophy), but in different senses: they concern internal and external freedom \nrespectively. Internal freedom depends on how one is motivated to act; external \nfreedom depends on whether, in acting, one is impeded by the actions of other \n                                                 \n36\n See e.g. Kant, Groundwork of the Metaphysics of Morals, in Gregor (ed.) Immanuel Kant: Practical \nPhilosophy p.73 (4:421). (References to the Groundwork are all to this translation.) \n37\n Ibid. p.80 (4:429). \n38\n Kant, The Metaphysics of Morals p.389 (6:232). \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 11 \npersons.39 If the Categorical Imperative imposes a duty on me to universalize my \nsubjective reasons for acting – to render what I will compatible with what anyone else \ncould rationally will – the Universal Principle of Right (UPR) requires that my \nactions be able to “coexist with everyone’s freedom [of action] in accordance with a \nuniversal law.”40 According to this principle, then, freedom of action is morally \nlimited by reference to what is right, and the rightfulness of any individual’s action \nhinges on its implications for others’ freedom.41 From this principle, Kant claims to \nderive an entire system of rights (otherwise put, a system of reciprocal and coercible \nlimits on action) which is morally required to reconcile conflicts between persons’ \nfreedoms.  \n \n‘Action’ here presupposes choice – the choice of which ends to pursue and which \nmeans to adopt in pursuit of them.42 One person’s action can interfere with another’s \nfreedom of action either by depriving the other of the means for pursuing his or her \nends, or by instrumentalizing those means towards ends not chosen by that other.43 \nThe central idea underlying Kant’s principle of Right is that such interferences are \nwrongful because they are incompatible with the other’s agency: in the first case \ndestroying the capacity for agency; in the second case usurping it. Moral autonomy is \nnot directly in issue here: the UPR is concerned only with the conditions under which \nthe freedom of persons as agents – beings with the capacity to formulate ends and \ndeploy means for their attainment – could be secured. If agents are to co-exist as such, \nthe external freedom of each must be limited so as to be compatible with the equal \nfreedom of every other.44 It follows that the system of rights required by the UPR \nmust render persons’ spheres of external freedom mutually consistent; and that, as a \nsystem of restrictions on external freedom, it should apply ‘in accordance with a \nuniversal law’ – that is, the same restrictions should apply equally to all.45 \n \nOccupying the first level within Kant’s system of rights is an ‘innate’ right to \nfreedom, borne by human beings conceived of simply as agents: that is, as having \nrecourse to nothing other than their innate means (their own bodily and mental \n                                                 \n39\n Ibid. \n40\n Ibid. p.387 (6:230). \n41\n Adherence to rational principle – and the acknowledgement of others as equally rational beings – is \ntherefore constitutive of external freedom, no less than internal freedom. On the propensity of this view \nof freedom to trouble liberal individualist readings of Kant, see Katrin Flikschuh, Kant and Modern \nPolitical Philosophy (Cambridge: Cambridge University Press, 2000), esp. Ch. 3 and 4. \n42\n Kant, The Metaphysics of Morals pp.374-5 (6:213) (distinguishing between choosing an end and \nmerely wishing it); Arthur Ripstein, Force and Freedom: Kant’s Legal and Political Philosophy \n(Cambridge, MA: Harvard University Press, 2009) p.14. Agency is thus what distinguishes persons \nfrom things, which can only be objects of persons’ choices (Kant, The Metaphysics of Morals p.378 \n(6:223)). \n43\n On this, see in particular Ripstein, Force and Freedom pp.43-5. \n44\n “Right is … the sum of the conditions under which the choice of one can be united with the choice of \nanother in accordance with a universal law of freedom.” (Kant, The Metaphysics of Morals p.387 \n(6:230)). Or as Kant puts it elsewhere, “Right is the restriction of each individual's freedom so that it \nharmonises with the freedom of everyone else (in so far as this is possible within the terms of the \ngeneral law)” (Immanuel Kant, “On the Common Saying: That may be Correct in Theory, but it is no \nuse in Practice” [hereinafter “Theory and Practice”] in Gregor (ed.) Immanuel Kant: Practical \nPhilosophy pp.279-309 (8:275-8:309), p.290 (8:290)) (References to “Theory and Practice” are all to \nthis translation.). \n45\n Thomas W. Pogge, “Kant’s Theory of Justice” Kant-Studien 79 (1988) pp.407-433, 413. \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 12 \npowers) to pursue their ends in the empirical world.46 It entails a right to use one’s \nown powers as one sees fit subject to the equivalent right of everyone else (hence, for \nexample, using one’s powers to enslave others is wrongful). For Kant, however, \nfreedom requires that persons also be able to have ‘external objects of choice’ at their \ndisposal.  Thus, a second level of Right – private right, regulating persons’ use of \nthese means for pursuing their ends – can be rationally ‘postulated’ as an extension of \nthe innate right to freedom and thereby also of the UPR. Invoking the divisions of \nRoman private law, Kant presents private right as necessarily reducible to three \ncategories: property rights (subsisting in respect of things), contract rights (subsisting \nin respect of others’ actions) and what he calls domestic rights (subsisting in respect \nof other persons as such).47 Private right is however impossible except in “a rightful \ncondition, under an authority giving laws publicly.”48 Thus the third level in Kant’s \nsystem is public right, whereby a public authority exercising legislative, executive and \njudicial functions can enable private rights to be legitimately acquired, enforced and \napplied. Kant illustrates the problems arising in a ‘state of nature’ (a condition in \nwhich innate rights are insecure, and private rights can apply only provisionally, \nbecause of the absence of public right49) through his discussion of what is involved in \ninitially acquiring a property right. This acquisition – though itself an exercise of \nexternal freedom – is a unilateral act that purports to exclude all others from the \nputative object of property, and so compromises the freedom of everyone else by \nsubjecting them to the choice of the acquirer. A state of nature, then, is a condition in \nwhich everyone is at all times subject to the unilateral choices of everyone else.50 \nSince this condition is inconsistent with the possibility of anyone’s agency, a ‘civil’ \ncondition in which individual rights could be endorsed, and rendered secure and \ndeterminate, by a public will – a public authority that acts for all – is morally required.  \n \nPublic right in turn has three dimensions. The first (just considered) regulates the \nrelations of citizen-subjects within a state; the second is a system of international \nright, regulating relations between states; and the third is a system of what Kant calls \n‘cosmopolitan’ right, regulating the relations of ‘citizens of the world’ (that is, \nindividuals considered apart from their membership of any state) to foreign states. In \nthe Rechtslehre and in “Toward Perpetual Peace” (an essay published in 1795) Kant \ndefines the content of cosmopolitan right as limited to a ‘right of hospitality:’51 “the \nright of a foreigner not to be treated with hostility because he has arrived on the land \n                                                 \n46\n “Freedom (independence from being constrained by another’s choice), insofar as it can coexist with \nthe freedom of every other in accordance with universal law, is the only original right belonging to \nevery man by virtue of his humanity” Kant, The Metaphysics of Morals p.393 (6:238). Kant defines \nthis ‘innate’ right as “that which belongs to everyone by nature, independently of any act that would \nestablish a right” (ibid. (6: 237)) and distinguishes it from an acquired right, “for which such an act is \nrequired” (ibid).   \n47\n Domestic rights recall the Roman law of persons. For Ripstein, they are rights of ‘status’ (Force and \nFreedom pp.70-77), characterized by the incapacity of the party in respect of whom they are held to \nconsent to the choices made for him or her by the right-holder. He claims that for Kant, such rights are \nexceptional and strictly limited: an example would be the rights of parents in respect of their children. \n48\n Kant, The Metaphysics of Morals p.409 (6:255). \n49\n On this see Ripstein, Force and Freedom Ch. 6. \n50\n Ibid. p.38. \n51\n Immanuel Kant, “Toward Perpetual Peace” (1795), in Gregor (ed.) Immanuel Kant: Practical \nPhilosophy pp.315-351 (8:341-386), at pp.328-331 (8:357-360) (references to “Toward Perpetual \nPeace” are all to this translation); Kant, The Metaphysics of Morals pp.489-90 (6:352-353). \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 13 \nof another.”52 Arguably, however, Kant sees the totality of rightful relations – \ncomprising all three dimensions of public right – as forming a cosmopolitan polity. \nFor Kant, all forms of public law have only provisional validity until such a polity has \nbeen established, because only in that event could a condition of war – an \ninternational state of nature – be definitively brought to an end in a context of global \ninterdependence.53 “[We] must work toward establishing perpetual peace and the kind \nof constitution that seems to us most conducive to it (say, a republicanism of all \nstates, together and separately).”54 Involved in Kant’s concept of Right, then, is an \nidea of progress towards a just political order:55 a global system of reciprocal external \nfreedom, realized through law. The establishment of sovereign states is only the first \nstep towards this end. Central to Kant’s account of how further progress is possible \nare two interrelated principles: the principle of the independence of every member of \neach state as a citizen – “that is, as a co-legislator”56 – and the principle of publicity.  \n \nCitizenship is a pivotal concept in Kant’s political theory, but his use of the concept is \napt to confuse. He defines the quality requisite to citizenship – “apart from the natural \none (of not being a child or a woman)”57 – as “only that of being one’s own master \n(sui juris), hence having some property … that supports him.”58 This in turn means \nthat the citizen is one who is able to sustain himself (sic) only by alienating what \nbelongs to him and not by providing services to others: only then can it be said that he \nhas that civic independence which qualifies him as ‘serving only the commonwealth.’ \nOne way of reading this stipulation is as revealing a bias towards propertied men as \nsolely equipped and entitled to participate in the polity. Yet Kant’s property \nrequirement can also be interpreted as implying only that the capacity for agency must \nbe supported by the material conditions under which it is possible to be one’s own \nmaster: that, to be meaningful, political agency must be substantive and not merely \nformal. Further, because Kant clearly intended to offer a dynamic account of the \nforces that might move political institutions towards the ideal of justice, citizenship \nhere can be understood not as a static condition for which a person either is or is not \nqualified, but as an ideal of political ‘maturity’ towards which all persons (children \nand women included) may aspire and from which no one, therefore, is in principle \nbarred.59   \n                                                 \n52\n Kant, “Toward Perpetual Peace” pp.328-9 (8:357-8). This right “belongs to all human beings by \nvirtue of the right of possession in common of the earth’s surface on which, as a sphere, they cannot \ndisperse infinitely” (ibid p.329 (8:358)). The meaning of hospitality is however heavily contested: \nsome for example link it to the rights of refugees (see Seyla Benhabib, The Rights of Others: Aliens, \nResidents, and Citizens (Cambridge: Cambridge University Press, 2004)); others to rights to engage in \ninternational trade (see e.g. B. Sharon Byrd and Joachim Hruschka, Kant’s Doctrine of Right: A \nCommentary (Cambridge: Cambridge University Press, 2010), pp.205-11); others stress Kant’s \ninsistence that cosmopolitan right ‘shall be limited to conditions of hospitality’ for the visitor, and does \nnot amount to a right to settle, thereby positioning colonial occupation outside its scope (see Peter \nNiesen, “Colonialism and Hospitality” Politics and Ethics Review, 3(1) (2007), pp. 90–108).  \n53\n Kant, “Toward Perpetual Peace” p.322 (8:349n).   \n54\n Ibid. p.491 (6:354).  \n55\n On this dimension of Kant’s political thought, see Elisabeth Ellis, Kant’s Politics: Provisional \nTheory for an Uncertain World (New Haven: Yale University Press, 2005), esp. Ch. 3. \n56\n Kant, “Theory and Practice” p.294 (8:294). \n57\n Ibid. p.295 (8:295). \n58\n Ibid. \n59\n See further on the theme of independence in Kant’s political thought, Howard Williams, “Liberty, \nEquality and Independence: Core Concepts in Kant’s Political Philosophy” in G. Bird (ed.) A \nCompanion to Kant (Oxford: Blackwell, 2006), pp.364-382.  \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 14 \n \nFurther interpretive difficulties arise when one considers the form of political \nparticipation that Kant envisages for the citizenry. He frequently asserts that a rightful \ncondition only exists where a legal order, together with its constitutional structure, \nactualizes the idea of the “general (united) will”60 of the whole ‘people.’61 He also \nsuggests that this idea requires that the people considered as a collective entity (i.e. \nthe citizenry) author the laws binding the people considered severally as a sovereign’s \nsubjects. Yet on closer inspection it becomes clear that these are not arguments for \npopular sovereignty in any conventional sense. For Kant, constitutional founding is \nnot to be understood as an actual assertion, at some point in history, of popular \n‘constituent power’; and he denies that Right requires the actual consent of all \nempirical legal subjects to the laws promulgated by a constituted sovereign. The idea \nof the general united will is only an ‘idea of reason,’ binding the sovereign “to give \nhis laws in such a way that they could have arisen from the united will of a whole \npeople and to regard each subject, insofar as he wants to be a citizen, as if he has \njoined in voting for such a will.”62 Moreover, only the sovereign, not the subject, can \nbe the judge of whether its laws meet this standard. Faced with laws that in the \nsubject’s view a unified public will could not possibly have endorsed, the subject \nmust nonetheless obey.63 To do otherwise would be to precipitate a return to the state \nof nature in which no unique law-making authority in fact exists and everyone makes, \napplies and enforces his own unilateral judgements.64  \n \nWhat then becomes of the idea of the citizen as co-legislator? It is at this point that the \nrelevance of publicity to Kant’s analysis of both citizenship and justice (or Right) \nbecomes clear. In a nutshell, Kant’s message is this: subjects must obey the laws in \nforce, but as citizens they should also argue publicly about their rightness. Subjects – \nwhile acting ‘externally’ in obedience to laws – may nonetheless harbour \nconscientious objections to them ‘internally’. These doubts testify to the freedom of \nsubjects, while constrained in what they can do vis-à-vis the laws in force, \nnonetheless to think about their rightness. Such independent opinion-formation is \nperfectly legitimate, even in a civil condition, since “every human being still has his \ninalienable rights, which he can never give up even if he wanted to and about which \nhe is authorized to judge for himself…;”65 and each is therefore entitled to judge the \nlaws in force wanting as failing to respect these rights. However it is “freedom of the \npen” – the freedom to publicly articulate these opinions – that is “the sole palladium \nof the people’s rights,”66 the only guarantee that laws and institutions will in fact be \nbrought into conformity with Right. It is through the free public criticism of unjust \n                                                 \n60\n Kant, “Theory and Practice” p.295 (8:295).  \n61\n In “Theory and Practice” Kant refers to the ‘original contract’ by which a multitude establishes a \ncivil constitution (p.296 (8:297)), a constitution being defined in the Rechtslehre as ‘a rightful \ncondition under a will uniting them’ (Kant, The Metaphysics of Morals p.455 (6:311)). So a civil \nconstitution is an arrangement under which the multitude is united into a people, and the people, \nconsidered now severally as legal subjects, are governed through a system of laws under the ultimate \nauthority of a sovereign. \n62\n Kant, “Theory and Practice” pp.296-7 (8:297) (emphasis added). \n63\n Ibid. pp.297-8 (8:297-8). \n64\n Kant thus rules out revolutionary action as incompatible with citizenship. Although the idea that laws \nought to reflect the general united will remains always as a standard against which to evaluate the \njustice of the sovereign’s laws, it cannot without contradiction be invoked as the basis of a right to \nrevolution against a sovereign which appears to betray this idea. \n65\n Kant, “Theory and Practice” p.302 (8:304). \n66\n Ibid. \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 15 \nlaws that citizens become co-legislators – by collectively constructing the standards of \nreason that can guide law-making towards realisation of the general united will. As \nexplained further in Section 2 below, these standards are not mere aggregations of \nindividual opinions, or victors in the clash of opinions, but may claim universal \nvalidity because forged in a specifically public process of argument through which \nreason itself emerges as the victor. It is this conviction that underlies Kant’s claim (in \n“Toward Perpetual Peace”) that there is an a priori (and not just an empirical) \nconnection between public justifiability (publicity) and justice or Right. That is, \npublicity is not only appropriate on prudential grounds (because fallible empirical \nsovereigns are liable to promulgate laws that contradict the rightful condition \ndemanded by reason, and public argument enables these errors to be foreseen or \ncorrected), but is a transcendentally necessary condition for just laws. Further, Kant \nseems to argue here that publicity can be the mechanism of progress towards a global \nsystem of Right.67 In the absence of (or until)68 the creation of a world republic with \nsupreme coercive power to make, enforce and apply global laws, the united public \nopinion of world citizens can substitute for such laws, constituting universal standards \nby reference to which abuses of political power everywhere can be judged.69  \n \nAt both the domestic and the global levels, then, open public debate is for Kant the \nmediator between principles of justice and the practice of politics. It is the crucial \nmechanism by which civic independence is exercised and through which it is \nenhanced; and it therefore underlies the development of an increasingly mature \ncitizenry and progress towards a just polity.70 But as the next Section will show, the \npublic use of reason has an even wider significance within Kant’s philosophical \nsystem, for he sees it as indispensable to the advance of Enlightenment in every \ndimension.  \n \n \n2 Freedom as Communicative Autonomy: Kant on Public Reason \n \nThe most obvious clues to the true meaning and import of the public use of reason for \nKant emerge from some of his shorter journalistic essays, writings that were aimed at \n                                                 \n67\n Ibid. p.347-51 (8:381-6).  \n68\n It remains a matter of dispute amongst Kant scholars whether Kant wanted to make a case for a \nworld republic: see e.g. Georg Cavallar, Kant and the Theory and Practice of International Right \n(Cardiff: University of Wales Press 1999) (arguing against this interpretation) and Otfried Höffe, \nKant’s Cosmopolitan Theory of Law and Peace, (Cambridge: Cambridge University Press, 2006) \n(arguing in favour). \n69\n On this, see James Bohmann, “The Public Spheres of the World Citizen” in J. Bohmann and M. \nLutz-Bachmann (eds.) Perpetual Peace: Essays on Kant’s Cosmopolitan Ideal (Cambridge, MA: MIT \nPress, 1997), pp.179-200. Bohmann argues that this interpretation of the global significance of \npublicity for Kant can be gleaned from Kant’s remark in “Toward Perpetual Peace” that “the … \ncommunity of the nations of the earth has now gone so far that a violation of right on one place of the \nearth is felt in all…” (“Toward Perpetual Peace” p.330 (8:360)). If universal outrage is indeed so felt, \nBohmann argues, it is because world citizens publicly expose and criticize such violations, and thereby \npublicly acknowledge as universal the rights that have been violated. This criticism can in turn only \noccur because the right to hospitality guaranteed by cosmopolitan law accords to world citizens the \nfreedom to communicate within the public spheres of foreign states, and thus “a cosmopolitan public \nsphere forms within each republic, with transnational relations to many other such spheres” (Bohmann, \n“The Public Spheres of the World Citizen” p.186).  \n70\n Larry Krasnoff, “The Fact of Politics: History and Teleology in Kant” European Journal of \nPhilosophy 2(1) (1994) pp. 22-40; Ellis, Kant’s Politics esp. Ch.1 (emphasizing Kant’s foregrounding \nof publicity “as a motor of progress towards an ideal state” (ibid p.12)). \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 16 \na wider audience than that addressed by his more technical philosophical works.71 In \none of these essays, published in 1784 – “An Answer to the Question: ‘What is \nEnlightenment?’” – Kant characterizes enlightenment as the attainment of maturity \nthrough the use of reason: thinking and deciding for oneself rather than deferring to \nestablished authority or tradition. In principle, Kant argues here, maturity is possible \nfor all persons, because all are equipped with the capacity for independence. Yet \nthrough laziness, cowardice or irresolution, individuals are apt to remain in thrall to \n‘guardians’ – Kant instances priests and doctors – and so in a state of self-incurred \nminority.  \n \nAs Katerina Deligiorgi has noted,72 there is a parallel between the account presented \nin Kant’s practical philosophy of ‘pathologically determined’ action – action \ndetermined by sensuous inclinations – and the account he offers here of allowing \none’s thinking to be dictated by forces external to oneself: while Kant acknowledges \nthe prevalence of heteronomous thought, no less than heteronomous action, he insists \nthat what essentially characterizes the human subject is the capacity for the free (i.e. \nautonomous) use of reason.  What Kant urges in general, then, is the emancipation of \nour reason from everything that undermines its authority for us. Yet whereas his \npractical philosophy yields a method or principle – the Categorical Imperative – that, \nif followed, will (he claims) enable one to act autonomously, here Kant suggests that \nfree thought depends only on public communication: “[f]or … enlightenment, \nhowever, nothing is required but … freedom to make public use of one’s reason in all \nmatters.”73 It is not immediately obvious why this should be so – at least, it is not \nclear why the freedom to express something in public should be any guarantee of the \nspeaker’s progress towards intellectual independence (since the views expressed \nmight simply be hackneyed or formulaic, or the speaker a puppet of some ‘guardian’). \nEmbedded in Kant’s idea of a public use of reason, then, must be a normative \ncriterion of publicity: some principle that could guide thought, as the Categorical \nImperative guides action. Yet none is spelled out in this essay. The only definition \nKant offers of a public use of reason is this: “that use which anyone may make of \n[reason] as a scholar before the entire public of the world of readers.”74  \n \nIn the context of the essay, the immediate significance of the italicized terms is that \nthey serve to distinguish a public from a ‘private’ use of reason. However Kant’s \nconception of a private use of reason is somewhat peculiar.75 It is not a use of reason \nthat is merely personal to the reasoner and undisclosed to anyone else. Rather, it is \n“that [use] which someone makes of [reason] in a certain civil post or office”76 and \nthe examples Kant invokes in “What is Enlightenment?” to illustrate his meaning \nhere all refer to utterances directed at an audience: a priest’s sermon, an army \nofficer’s orders, a tax official’s demands, and so forth. It would seem that when these \nrepresentatives of ecclesiastical or state authorities interpret the latter’s dictates and \naddress their interpretations to these authorities’ subjects, or when they speak in the \n                                                 \n71\n The key essays in this connection are: “An Answer to the Question: ‘What is Enlightenment?’” \n(1784); “Idea of a Universal History from a Cosmopolitan Point of View” (1784); “What Is Orientation \nin Thinking?” (1786); “Theory and Practice” (1793); “Toward Perpetual Peace” (1795) and “The \nConflict of the Faculties” (1798). \n72\n Katerina Deligiorgi, Kant and the Culture of Enlightenment (Albany, NY: SUNY Press, 2005), p.60. \n73\n Kant “What is Enlightenment?” p.18 (8:36). \n74\n Ibid. p.18 (8:37). \n75\n Deligiorgi, Kant and the Culture of Enlightenment p.63. \n76\n Kant, “’What is Enlightenment?’” p.18 (8:37). \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 17 \nexercise of an authority delegated to them from above, they engage in private uses of \nreason in Kant’s sense. They reason publicly, on the other hand, when they speak \ntheir own minds on issues within the jurisdiction of these authorities. Thus although \nthe priest – in his private capacity of officer of the church – is obliged to preach \nreligious orthodoxy to his flock from the pulpit “for he [is] employed by [the church] \non that condition”,77 as a scholar (i.e. as an intellectual) “he has complete freedom \nand is even called upon to communicate to the public all his carefully examined and \nwell-intentioned thoughts about what is erroneous in that creed and his suggestions \nfor a better arrangement of the religious and ecclesiastical body.”78 The normative \nforce of this freedom and calling is conveyed by Kant’s insistence that it would be a \n“crime against human nature”79 for members of the clergy to bind themselves never \nto doubt an established religious creed in public: this would be an instance of \nrenouncing enlightenment altogether, which in turn would “violate the sacred right of \nhumanity.”80 Yet once again Kant does not explain in so many words where the \nnormative force of this ‘public doubting’ emanates from: how exactly it contributes to \nenlightenment.  \n \n“What is Orientation in Thinking?,” published in 1786, is one of a number of texts in \nwhich Kant finally reveals what might be called the ‘supreme principle of rational \nthinking’, the analogue of the Categorical Imperative that was suggested by, but \nmissing from, “What is Enlightenment?”. It is contained in the following proposition:  \n \nTo think for oneself means to look within oneself (i.e. in one’s own reason) for \nthe supreme touchstone of truth; and the maxim of thinking for oneself at all \ntimes is enlightenment…. To employ one’s own reason means simply to ask \noneself, whenever one is urged to accept something, whether one finds it \npossible to transform the reason for accepting it, or the rule which follows \nfrom what is accepted, into a universal principle governing the use of one’s \nreason.81 \n \nIn form this is very similar to the Categorical Imperative, which is itself a principle \nrequiring the moral reasoner to assess whether her subjective rules of action could, \nwithout contradiction, be universalizable. And like the Categorical Imperative, which \norients moral action not via a substantive moral code but by means of a procedure that \noperates only negatively, this principle does not tell us what to think. Instead it urges \nus to examine the criteria underlying our acceptance or rejection of propositions with \na view to identifying whether these are mere prejudices, arising from the passivity of \nour mental faculties, or criteria that could be valid for anyone: only in the latter case \nare the propositions they support worthy of acceptance. Now if thinking for oneself is \nsolely a matter of reflecting on one’s thought processes by the light of this \nuniversalizability test, it is difficult to see what the connection is between \nenlightenment and public debate. Yet Kant here reaffirms his earlier emphasis on the \ninextricable link between individual freedom of thought and the freedom to think “in \ncommunity with others to whom we communicate our thoughts and who \n                                                 \n77\n Ibid p.19 (8:38). \n78\n Ibid. \n79\n Ibid p.20 (8:39). \n80\n Ibid. \n81\n Kant, “What is Orientation in Thinking”, in H. Reiss (ed.) Kant: Political Writings, pp.237-49, \np.249. (All references to “What is Orientation in Thinking” are to this translation.) \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 18 \ncommunicate their thoughts to us.”82 So close is the connection here forged between \npublic debate and autonomous thinking, indeed, that Kant goes so far as to state that \n“the same external constraint which deprives people of the freedom to communicate \ntheir thoughts in public also removes their freedom of thought.”83 Yet there is at least \na tension between the principle that before accepting a proposition I must ask myself \nwhether I can judge it to be universally valid (which seems at most to involve an ideal \nconversation with an imagined community of reasoners), and the principle that I must \nfirst test whether it meets with general assent following an actual process of open \npublic debate.  \n  \nThis brings us closer to where the normative significance of Kantian publicity resides. \nThe key point is that the public use of reason (implying both the universalizability of \na proposition and its availability for open public debate) is indispensable to the task of \nsecuring the authority of reason – in politics, knowledge and human affairs generally \n– and displacing the authority of unquestioned tradition or power. This dimension of \nKant’s thought has been explored with particular rigour by Onora O’Neill.84 For \nO’Neill, “What is Enlightenment?” is best read as characterizing ‘private’ uses of \nreason by reference to two related features that render them “deprived (privatus) [and] \nincomplete”85 by comparison with what Kant calls public uses of reason. The first is \nthe partial reliance of private reason’s authority on the power that attends the \nreasoner’s superior status vis-à-vis her audience: “[i]n all such communication there is \na tacit, uncriticized and unjustified premise of submission to the ‘authority’ that \npower of office establishes,”86 which in turn means that “[a]t some points in debates \nabout such communications argument must stop and authority be invoked.”87 The \nsecond is that the audience for such utterances is necessarily restricted to those who \naccept the speaker’s ability to invoke his or her superior status as an argument-stopper \nin this way. A public use of reason, by contrast, is one that presupposes no authority \nother than reason, and is thereby in principle available for debate by ‘the entire \npublic.’  \n \nO’Neill herself characterizes utterances of this kind as ‘publicizable’, and notes that \nKant clearly prioritizes publicizability (in this sense of worthiness to be publicly \ndebated) over publicity (actual public debate). Yet she also stresses that whether a \nproposition is publicizable cannot for Kant depend simply on whether the proponent \nbelieves it to be so, or on whether it is stated to conform to transcendent standards of \nrationality that have been established in advance of its communication. Even \npropositions that are believed in good faith to invoke no authority other than reason \nmight be informed by hidden prejudices of which their proponents are unaware; and \nthis danger cannot be circumvented by invoking a higher authority as the guarantor of \nreason without regressing to a state of tutelage. Of necessity, then, authoritative \ncriteria of rationality have to be constructed, and this requires a process of trial, error, \ncorrection and retrial – an ongoing collective task, guided only by the idea that the \n                                                 \n82\n Ibid. p. 247. In “Theory and Practice”, too, Kant remarks that “it is a natural calling of humanity to \ncommunicate with one another, especially in what concerns people generally” (ibid. p.303 (8:305)). \n83\n Kant, “What is Orientation in Thinking”, p.247 (emphasis added). \n84\n O’Neill, Constructions of Reason, esp. Ch. 1 and 2.  \n85\n Ibid. p.17. \n86\n Ibid. \n87\n Ibid. p.34. \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 19 \nauthority striven for must be that to which all can agree.88 This in turn means that \neach person should reason in a way that recognises – in oneself and in everyone else – \nthe freedom to think for oneself, while at the same time acknowledging the necessity \nto think in community with others. It is only through sustained practices of free, \ncritical and universal debate that the task of constructing reason’s authority – and \nprogress towards a fully Enlightened world – stands any chance of accomplishment. \n \nWhat then are the principles by reference to which reason’s authority can be \ncollectively constituted through the process of open debate? Kant offers no particular \nspecification in any of his writings on the public use of reason, but here again \nO’Neill’s interpretation is helpful. The most basic of these principles can, she argues, \nbe extrapolated from Kant’s moral theory, in particular the prohibitions on using \ncoercion and lying in one’s communications with others. She finds other principles \nelsewhere in Kant’s oeuvre – especially in the Critique of Judgment89 and in \nAnthropology from a Pragmatic Point of View,90 where general guidance is offered on \nhow to think in community with a plurality of others who cannot be guaranteed in \nadvance to agree.91 Briefly, this guidance reduces to three maxims: ‘think for oneself’; \n‘think from the standpoint of everyone else’; and ‘think consistently’. The first of \nthese maxims requires active and unprejudiced, rather than passive, thinking: \notherwise no genuine plurality of perspectives can emerge.92 The second requires \nreflection on one’s initial judgments from the perspective of all so that any partiality \nconditioning them can be corrected.93 Far from being a matter of ascending to a \nneutral Archimedean point above the conflict of opinions, this process should be \noriented toward comparing one’s independently formed judgments with the actual \nviewpoints of others,94 and taking any discrepancies as signalling that one’s reasoning \nmay be erroneous. Since the results of this reflective movement will constantly be in \nflux, contradictions in one’s thinking can be expected to emerge. Hence the third \nmaxim implies a preparedness to work through these contradictions in an unceasing \neffort to integrate all of one’s considered judgments into a whole which is unified \nunder common criteria.95  \n \nTo think and communicate in accordance with these principles is to think and \ncommunicate autonomously. It should be clear that this intellectual\/communicative \nautonomy is irreducible to freedom of expression in the standard liberal sense of \nfreedom to choose what to say and whether to say it.96 This is not to suggest that \nexpression can be arbitrarily prohibited or interfered with, but individual expressive \nliberty is only a condition, not constitutive, of what Kant actually has in mind as the \n                                                 \n88\n Ibid. p.18-20. \n89\n Immanuel Kant, Critique of Judgment (trans. W. S. Pluhar) (Indianapolis: Hackett, 1997) pp.160-2 \n(5:294-6). (All references to the Critique of Judgment are to this translation.) \n90\n Immanuel Kant, Anthropology from a Pragmatic Point of View [hereinafter Anthropology] trans. \nMary J. Gregor (Nijhoff: The Hague, 1974), pp.72 (7:200) and 96-7 (7:228-9). (All references to \nAnthropology are to this translation.)  \n91\n O’Neill, Constructions of Reason pp.24-27, 46-50. \n92\n Kant, Critique of Judgment p.161 (5:295); O’Neill, Constructions of Reason p.46. \n93\n Kant, Critique of Judgment p. 161 (5:295).  \n94\n O’Neill, Constructions of Reason p.46-7.  \n95\n Kant, Critique of Judgment p. 161-2 (5:295).  \n96\n “In contrast to contemporary liberal defences of free speech, Kant proceeds on the basis of what he \nconsiders to be the essential requirements for rational autonomy, and not from a notion of basic \nindividual rights” (Deligiorgi, Kant and the Culture of Enlightenment p.85). \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 20 \npractice of public reason. Onora O’Neill invokes the idea of toleration to mark the \ndistinction, and I adopt it in what follows. Toleration here on the one hand signifies a \nresponsiveness towards the communications of others (“[w]e do not tolerate others’ \ncommunications if we are merely passive and noninterfering”),97 and on the other \nhand the act of communicating itself in so far as that act is oriented towards \nconformity with the principles and maxims identified above. On O’Neill’s \ninterpretation, an utterance which is, for example, purely egoistic,98 or dictated by an \nexternal authority, or trivial, or unintelligible, could only be an expression, which is to \nsay a failed communication (since expression is parasitic on communication) that fails \nbecause it is ‘intolerant’ of its audience;99 while a communication which is greeted \nwith indifference, even if not interfered with, is treated as if it were a mere expression \nand so not ‘tolerated’ as a communication. In general, then, the public use of reason – \nwhere ‘use’ signifies processes involving both communication and reception – \npresupposes toleration.  \n \nIt was noted in Section 2 above that Kant saw the public use of reason as the motor of \nprogress towards a just political order. It should now be clear why he saw it as the key \nto the advance of Enlightenment generally. The process of Enlightenment – and with \nit, progress towards a free or ‘mature’ culture characterised by the mutual recognition \nof the intellectual autonomy of all – depends on social practices of tolerant \ncommunicative interaction which are both public and fully inclusive. Although \noriented towards the horizon of universal consensus, these practices are essentially \nconstituted of disagreements with, and contestations of, perspectives that happen to \nbe generally accepted – albeit within the limits set by the presupposition of all critical \nintellectual activity, which is toleration. If afforded space in which to flourish, \nprincipled communicative practices can fuel an emancipatory process that is not \npersonal to each individual so much as it moves humanity as a whole towards a \nsituation in which ‘everything submits’ to criticism.100 And since reason for Kant \nowes its authority to nothing other than criticism,101 reason would in that situation rule \nsupreme in human affairs.  \n \n \n3 The Legal Structure of Communicative Freedom \n \n                                                 \n97\n O’Neill, Constructions of Reason p.31. Simply put, the distinction is between allowing someone to \nspeak and engaging with what they have to say. \n98\n Egoistic uses of reason disregard the necessity of testing one’s judgments against the judgments of \nothers (Kant, Anthropology, p.10 (7:128)). \n99\n O’Neill, Constructions of Reason p.31. \n100\n Kant makes the connection between Enlightenment and criticism\/the free public use of reason \nexplicit in a footnote appearing in the Preface to the first edition of the Critique of Pure Reason: “Our \nage is the true age of criticism, to which everything must submit. Religion through its holiness, and \nlegislation through its majesty commonly seek to exempt themselves from it. But in this way they heap \njustified suspicion upon themselves, and cannot claim the genuine respect that reason grants only to \nwhat has been able to stand the test of free and public examination” (Immanuel Kant, Critique of Pure \nReason, trans. P. Guyer and A. Wood (Cambridge: Cambridge University Press, 1998) [hereinafter \nCPR] pp.100-101 (A xi)). (All references to the Critique of Pure Reason are to this translation.)  \n101\n Kant insists that reason itself is subject to “searching review and inspection:” its “very existence” \ndepends on freedom of critique and its claim to authority is based on nothing more than “the agreement \nof free citizens” (CPR p.643 (A738-9\/B766-7)). For consideration of the relation between reason and \ncriticism in Kant’s writings, see Deligiorgi, Kant and the Culture of Enlightenment, pp.85-92. \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 21 \nThe question that must now be addressed is whether Kant envisages any particular \nlegal arrangements as necessary for the flourishing of tolerant communicative \ninteractions in the sense outlined in the previous Section. The dominant view is that \nthe answer is ‘no’: the public use of reason is not in fact conceived of by Kant as \namenable to being organised in terms of claims that can be redeemed through rights – \neven a right to free speech – at all. Rather, it is sustained by social practices and \norientations; and Kant establishes the legitimacy of these practices and orientations by \nreference to his conception of reason, not Right.102  \n \nIt is undeniable that Kant’s case for the free use of reason in public is advanced in \nterms that appear to suggest that it is a ‘right’ of human reason, not an individual \n(subjective) right properly so called:   \n \nTo this freedom … belongs the freedom to exhibit the thoughts and doubts \nwhich one cannot resolve oneself for public judgment without thereupon being \ndecried as a malcontent and dangerous citizen. This lies already in the original \nright of human reason, which recognizes no other judge than universal human \nreason itself, in which everyone has a voice; and since all improvement of \nwhich our condition is capable must come from this, such a right is holy and \nmust not be curtailed.103 \n \nIf anything, it would seem to follow that the counterpart to this ‘right’ is a duty – but a \nduty that each human being owes to humanity, not to other individuals. Nonetheless, \nit could be argued that the freedom to engage in a public use of reason is required by \nthat aspect of Kant’s Universal Principle of Right that, in Pogge’s words, “demands \n… the thriving of reason, and the promotion of its development both in the species \nand in each particular person.”104 Otherwise put, Kant can be construed as arguing \nthat justice demands not only a legal order guaranteeing equal spheres of external \nfreedom for all, but a set of legal arrangements conducive to Enlightenment in the \nbroadest sense. And since free public criticism is, for Kant, absolutely central to \nEnlightenment, it is at least arguable that Kant sees law as having a role to play in \nfacilitating it.  \n \nWhat then is the juridical structure of free communication as Kant sees it? It is first \nnecessary to recall that for Kant, a system of rights is a set of pure rational concepts \nthat define the morally necessary form of interaction between persons prior to any \npositive laws which would give effect to these concepts. Pending the \ninstitutionalisation of these concepts in positive law, persons can only be said to have \nmorally valid rights claims against others: in Kant’s words, “(moral) capacities for \nputting others under obligations.”105 Moreover, a claim to right is intrinsically \ncoercive: it is indeed simply a claim that others ought to be constrained to treat the \nclaimant in certain ways. Kant himself clearly takes the view that there is a right (in \nthe specific sense just outlined) not to be prevented from saying what one chooses: he \nstates in the Rechtslehre that in so far as speech does not infringe on the rights of \nothers, the freedom to utter one’s thoughts to others is protected by the innate right to \n                                                 \n102\n Ibid. See also Allen W. Wood, Kant’s Ethical Thought (Cambridge: Cambridge University Press, \n1999) (“Kant asserts no individual right of free speech or expression” (ibid. p.306)).  \n103\n Ibid. p. 650 (A752\/B780). \n104\n Pogge, “Kant’s Theory of Justice” p.413, 421.  \n105\n Kant, The Metaphysics of Morals p. 393 (6: 237); Byrd and Hruschka, Kant’s Doctrine of Right, p.3 \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 22 \nfreedom.106 Even lies and deceitful promises are within the sphere of freedom to \nwhich each is entitled simply by virtue of being a person: though immoral, these \nutterances can be regarded as rightful in so far as they do not infringe the addressee’s \nsphere of external freedom by diminishing that to which the addressee is entitled.107 It \nis also clear that the right to say what one chooses is a necessary condition of \npublicity’s operating as a mechanism for securing progress towards a just state and, \nmore generally, that it is a necessary condition of the public use of reason in any \ndiscursive domain at all. It is necessary, because freedom of speech is the sine qua \nnon of the possibility of communicative freedom in the sense outlined in Section 2 \nabove, and so also of rational discourse, including in particular discourse about \ninjustice:  \n \nCertainly one may say, “Freedom to speak or write can be taken from us by a \nsuperior power, but never the freedom to think.” But how much, and how \ncorrectly, would we think if we did not think as it were in common with \nothers, with whom we mutually communicate! Thus one can well say that the \nexternal power which wrests from man the freedom publicly to communicate \nhis thoughts also takes away the freedom to think – the sole jewel that remains \nto us under all civil repression and through which alone counsel against all the \nevils of that state can be taken.108 \n \nThe argument in the passage just quoted is that without the possibility of individual \nexpression, communication with others is impossible, and without communication \nwith others, rational thought is impossible: in other words, the right to free speech is \nhere justified, not by reference to the innate right to freedom, but by reference to the \ndemands of reason and the possibility of Enlightenment. More precisely, Kant claims \nthat since speech is the indispensable means of testing one’s individual opinions \nagainst the opinions of others, the right to expressive freedom is justified by the \nmaxim of broad-minded thinking (thinking from the standpoint of everyone else, and \nthereby transcending the partiality of one’s own opinions) which was referred to in \nSection 2 above as one of his three maxims of thinking:  \n \nThe logical egoist considers it unnecessary to test his judgment by the \nunderstanding of others … as if he had no need at all for this touchstone \n(criterium veritatis externum). But we cannot dispense with this means for \nassuring the truth of our judgments; this is so certain that it may be the main \nreason why educated people clamour so urgently for freedom of the press. For \nif we are denied this freedom, we are deprived at the same time of an \nimportant means for testing the correctness of our own judgments and left \nopen to error.”109  \n \nHowever, though necessary, freedom of speech is not a sufficient condition for the \npublic use of reason, precisely because freedom of speech is also grounded in the \ninnate right to freedom. As such, it includes the right to use one’s power of expression \nto manipulate one’s interlocutors; and it implies no duty to listen and so no duty to \nengage with or respond to them. It follows that there can be no right in anyone to \n                                                 \n106\n Kant, The Metaphysics of Morals p. 387 (6: 231). \n107\n Ibid. p.394 (6:238). Hence fraudulent claims and lies that damage another’s reputation are wrongful. \n108\n Kant, “What is Orientation in Thinking” p.247. \n109\n Kant, Anthropology p. 10 (7:128-9). \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 23 \nforce anyone else to engage in tolerant communicative interactions. To say that I have \na morally valid claim to force others to permit me to engage in the free public use of \nmy reason is either tautological or incoherent: my claim to freedom to engage in the \npublic use of my reason adds nothing to my claim to be free to say what I choose \nother than the contradictory (in Kant’s terms) notion that others can be compelled to \nparticipate with me in processes of public reasoning oriented towards our collective \nemancipation. In short, for Kant, each person has a right to speak, but no (strictly \njuridical) duty to speak ‘maturely’ and no (strictly juridical) right that anyone else do \nso. \n \nBut granted that the public use of reason is unenforceable, it does not follow that Kant \nsaw law as having no role to play in fostering conditions conducive to its advance and \ncounteracting manipulative, egoistic or generally intolerant (in the sense outlined in \nSection 2 above) speech. My claim here is that Kant does indeed conceive of a \nsystematic legal structure for the protection of communicative freedom, but that he \nsees this structure as constituted by the rights of authors, publishers and the reading \npublic in relation to authorial communications. An important clue to the significance \nKant ascribes to authorship is to be found in the two passages quoted above, where \nfreedom to speak is explicitly linked with freedom to ‘write’ and freedom of the \n‘press’. These linkages reveal how in practice the sphere of public reasoning, the \ncosmopolitan Lesewelt, was in Kant’s view to be realized: through the production, \ndistribution and consumption by ‘educated people’ of cultural artefacts, namely \nbooks. As Kant clearly recognized, to ‘speak’ in this setting is in fact to communicate \none’s words in writing to the ‘reading public’; and since communicating to the \n‘entire’ reading public is of the essence of a public use of reason, writing for that \npublic necessarily involves the mass production of one’s texts as books, and the \ndistribution of these to a public with the practical capabilities to read them. Hence \nfreedom of speech must involve the freedom to communicate one’s words in writing \nto the ‘reading public’; and freedom of the press must involve the freedoms to mass \nproduce one’s texts as books, to distribute these to the public, to facilitate public \ncommunication by printing and publishing the books of others, and to acquire and \nread printed material. Indeed, authorial communication by means of printed texts \ncannot have been regarded by Kant as merely subsidiary to speech: it is in fact more \nconducive than oral communication to the public use of reason, in that it orients the \nauthor towards an unknown readership and so promotes an awareness of the necessity \nof communicating in terms that could be accepted by all. The only conclusion one can \ndraw from reading Kant’s remarks on publicity in relation to those on publishing, I \nbelieve, is that Kant elaborated his views on the rights of authors, publishers and \nreaders with a view to showing how commercial publishing should be legally \nstructured if the public sphere – the institutional space for the public use of reason – \nwas to be nurtured. In the remainder of this Section I reveal the lineaments of this \nstructure as set out in the 1785 Essay: the author’s innate right to say (only) what s\/he \nchooses to say, the publisher’s private right to appropriate profits from publishing the \nauthor’s words, the reading public’s right to an undistorted communicative relation \nwith the author and – underpinning all of these rights – the universal calling to engage \nin tolerant communicative interactions through the medium of print. I argue that Kant \nmust be read as conceiving of all of this as forming an integrated legal regime \noriented towards advancing – albeit indirectly – the public use of reason. \n \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 24 \nOstensibly, the 1785 Essay is simply concerned with showing how the private rights \n(in the sense elaborated in the Rechtslehre) of publishers are engaged by the \nunauthorized publication of an author’s book. Kant commences his consideration of \nthe wrongfulness of unauthorized publication by establishing that this act wrongs the \nauthorized publisher. The authorized publisher, he reasons, is one who has received a \nmandate from the author to communicate the author’s discourse to the public. A \nmandate is the focus of a contract, the purpose of which is to empower one person to \nbe another’s agent by “carrying on another’s affairs in his place and in his name,”110 \nso the publishing contract enables a publisher, through the author’s writing, to \ndiscourse publicly in the author’s name.111 Kant insists that such empowerments must \nbe exclusive, since otherwise rival publishers would be competing to sell the same \nbook and none could profit from doing so.112 Moreover, unless the author has \nreserved the right to object to the transfer of the empowerment to another publisher, it \nis itself alienable by the publisher.113 Absent such a transfer, the unauthorized re-\nprinter usurps the empowerment and steals the legitimate publisher’s profits. Hence \n“it is not the author but the publisher empowered by him who is wronged”114 by the \nre-printer’s activities. Thus far, the rights of the author seem marginal to Kant’s \nanalysis. However as explained above, Kant also explicitly argues that publishing an \nauthor’s writing without his consent is tantamount to forcing him to speak against his \nwill, which wrongs the author because the right to be one’s own master in respect of \none’s speech is an aspect of the innate right to freedom: “[t]he right of the author is … \nan innate right in his own person, namely, to prevent another from having him speak \nto the public without his consent…”.115 One’s innate right to freedom is the right to \ndetermine how one’s innate physical and intellectual capacities shall be exercised and \nto what ends; otherwise put, it is the right that no one else shall interfere with or usurp \nthose capacities. Thus the authorized publisher’s acquired right to the use of the \nauthor’s innate power to speak to the reading public depends on the author’s consent \nto what would otherwise be a violation of his or her innate right.116  \n \nThe innate right of the author is not a right of property, and it is inalienable. These \nconclusions follow from Kant’s conception of authorial speech as ‘an action \nbelonging to the author’s person’: an author’s intellectual creation is an exercise of \nthe author’s innate capacities which, as such, cannot be owned (for that would be to \npresuppose that a person is also a thing, which is contradictory) but to which, as such, \nonly that person could have a right.117 Now it was noted in Section 1 above that for \nKant, the freedom\/calling to publicly voice criticisms of existing political \n                                                 \n110\n Kant, The Metaphysics of Morals p. 433 (6: 285). \n111\n Ibid. p.437 (6:289). \n112\n Ibid. p.31 (8:81). \n113\n Ibid. p.31 (8:82). \n114\n Kant, “On the Wrongfulness of Unauthorized Publication of Books” p.31 (8:82). \n115\n Ibid. p.35 (footnote to text at 8:86). \n116\n “[T]he right to publish cannot be included in the rights that depend upon ownership of a copy; it can \nbecome rightful only by a separate contract with the author” (ibid). \n117\n On this, see further Ripstein, Force and Freedom pp.14-15 and Ch. 2. For an account of how a \nKantian idea of innate self-mastery has informed rules restricting the alienability of authors’ \nentitlements in civil law jurisdictions, see Neil W. Netanel, “Alienability Restrictions and the \nEnhancement of Author Autonomy in United States and Continental Copyright Law” Cardozo Arts and \nEntertainment Law Journal 12 (1994) 1. Cf. Charles R. Beitz “The Moral Rights of Creators of Artistic \nand Literary Works” Journal of Political Philosophy 13(3) (2005) pp.330-358, 351 n56 (“Kant himself \noffers nothing that could be construed as an argument for the inalienability of the right against \nunauthorized, inaccurate or unattributed copying [sic]”). \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 25 \narrangements resides in all citizens, and citizens are persons who can live by selling \nwhat is theirs. Kant admits that it can be difficult to distinguish such persons from \nthose who live by selling their services, but the key is whether a man produces some \nthing (opus) which is his to alienate.118 Prima facie, professional authors seem to have \nno property to sell, and so appear to lack this key requisite of citizenship. However in \nthe 1785 Essay, Kant establishes that authors are indeed their own masters on the \nbasis that an author produces an “opus”119 (a copy of his text in the form of a \nmanuscript) which is his to alienate. An author, he implies, can sell his ‘copies’ (i.e. \nthe handwritten or printed copies of his text that he himself has made) direct to the \npublic, or he can hand this trade over to an intermediary by selling his manuscript to a \npublisher and making a further contract with the publisher empowering the latter to \nmake copies and sell these to the public. The publisher’s authorization to publish the \nmanuscript – the focus of this further contract – derives, as we have seen, from the \nauthor’s (inalienable) right not to be compelled to speak. But that right makes \npracticable the right to sell the opus which is the manuscript, and so also the \ncapacities characteristic of the citizen, for in the absence of a right to control \nunauthorized publication, no publisher would purchase a manuscript from an author in \nthe first place. It is arguably for this reason that Kant’s major concern in the 1785 \nEssay is in fact to legitimize the book trade, the publishing agreements that underpin \nit, and the profits that may be realized from it: he aims not to denigrate publishers and \nthe publishing trade, but to show how the trade can be rightfully organized, because in \nits absence professional authors could not be regarded as having the qualities requisite \nfor citizenship. \n \nAlready, then, it can be seen that authorship has a crucial, and interrelated, set of \nimplications for Kant.120 As inscription – i.e. as the production of a physical \nmanuscript – it attracts a property right in the manuscript that both founds a legitimate \ntrade in copies (an economic pursuit which the author cannot undermine by \nauthorizing competing publishers) and at the same time positions the professional \nauthor to exercise civic independence. As expression – i.e. as an activity for which the \nmanuscript is the vehicle – it attracts a right that is ‘innate in the author’s own \nperson’: a right (which is not a property right) to exert a continuing control over his or \nher speech. However, it is as communication – i.e. as an address to the reading public \n– that authorship is also culturally significant. The central right adumbrated in the \n1785 Essay – the inalienable right “that no one may deliver the same speech to the \npublic other than in … the author’s name”121 – clearly has implications not only for \nthe individual author but also for the advance of an emancipated culture. To re-\ncirculate an author’s text unaltered without the latter’s consent is not only to deny the \nauthor’s innate right but to show no independence of thought in one’s \ncommunications with the reading public: no sign that the re-publisher has obeyed the \ninjunction to ‘think for oneself.’ Correspondingly, where a reader, by re-writing an \n                                                 \n118\n Thus a barber provides services, but a wigmaker is a trader, “even if I have given him the hair for \nthe wig…” (Kant, “Theory and Practice”, footnote to text at p.295 (8:295)). \n119\n “The copy that the publisher has had printed is a work of the author (opus) and belongs entirely to \nthe publisher, once he has negotiated for the manuscript or a printed copy …” (Kant, “On the \nWrongfulness of Unauthorized Publication of Books” p.33 (8:84)). \n120\n “If the publisher is at the same time the author as well, the two affairs are still distinct, and he \npublishes in his capacity as a merchant what he has written in his capacity as a scholar” (ibid p.33 \n(footnote to text at 8:84)).  \n121\n Ibid. p.35 (8:86). It is central because from this right follows the right to prevent unauthorized \npublication of the same speech, and the attribution to the author of a fundamentally altered speech.  \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 26 \nauthor’s text with modifications, has shown evidence of an ability (however \nembryonic) to think for him- or herself, the rights of the first author in respect of the \ndelivery to the public of the original text must give way to the rights of the modifier in \nrespect of the public communication of the modified text. The reciprocal rights of \nauthor and reader here serve the wider cultural goal of facilitating that critical \nreflection on which reason’s authority depends. The same applies to the author’s right \nto object to the delivery of the modified text in his or her name and the modifier’s \nright to claim authorship of that text: these rights too are conducive to the \ndevelopment of a mature culture, because such a culture is one in which persons \nspeak for themselves and take responsibility for their utterances as named individuals. \nFinally, the author’s right to object to the delivery of an altered speech in his or her \nname also preserves the integrity of the communication between that author and his or \nher readers. Not only the author, but also the audience, has a right that this \ncommunication be undistorted. Throughout the Essay, Kant reiterates that the author’s \ncommunication is with the public, and that the publisher and the book trade should \nonly facilitate this communication. That the public has a right against the commercial \nintermediary to receive the author’s communication in the form the author intended \nemerges very clearly from the following passage: \n \nWere the author to die after he has given his manuscript to the publisher for \nprinting and the latter has bound himself to print it, the publisher is not at \nliberty to hold the manuscript back as his property; instead, if the author has \nno heirs, the public has a right to compel him either to publish or to turn the \nmanuscript over to someone else who offers to do so. For it was once an affair \nthat the author wanted to carry on with the public through him and for which \nhe offered himself as the agent. It is not necessary for the public to know of \nthe author’s promise or to accept it; it obtains this right against the publisher \n(to perform something) by law alone. It is not a right of the public to the \nmanuscript but to an affair with the author that is the basis for this. If, after the \nauthor’s death, the publisher were to put out his work in an abridged or \nfalsified form, or in an edition smaller than the demand for it, the public would \nbe authorized to compel him to correct or enlarge the edition or, failing this, to \nprovide for someone else to do so. All this could not happen unless the \npublisher’s right were derived from an affair that he carries on between the \nauthor and the public in the author’s name.122  \n \nTaken together, then, it seems clear that the rights set out in the 1785 Essay are \nconceived of by Kant as tending to yield the conditions in which authors would \nadvance their own reason (by speaking for themselves) and at the same time advance \npublic reason by communicating their thoughts, undistorted by commercial \nimperatives, to a critical mass public which is free to read and respond. The final \nsection below will briefly sketch some of the possible implications of viewing \ncontemporary copyright law through Kant’s lens. \n \n \n4 Copyright Law, Communicative Freedom and the Global Public Sphere \n \n                                                 \n122\n Ibid. p.33-4 (8:85). \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 27 \nAn appropriate starting point here is Abraham Drassinower’s claim that the normative \nheart of copyright law resides, not in the right to control unauthorized copying as \nsuch, but in what he calls the right of public presentation: an author’s exclusive right \nto address the public, in his or her own words, in the form of a work.123 Copyright \nlaw, Drassinower argues, necessarily takes authorial activity to be an instance of \nspeech. All of its central categories – including in particular the exclusive rights of the \nauthor and the major defences available to users of copyright material – should, he \nargues, be (re-) interpreted in relation to a conceptualization of works of authorship as \ncommunications to the public.124 This would limit the current scope of copyright \nprotection, because when re-interpreted in this way, not every act of copying can \nproperly be regarded as infringing. Only reproductions of the work qua \ncommunicative act – or reproductions which are “in the service of public \npresentation”125 – are normatively relevant; copies which are reproductions only “in \nthe physical sense”126 are not. Copies made for personal use would fall into the \nsecond category, as would copies technically incidental to the reception of the work, \nsuch as cache copies or digital copies made while browsing online. Moreover, to \nreproduce another’s work as a work (i.e. to repeat the communicative act represented \nby the work) is – properly construed – not simply to re-communicate another’s work, \nbut to “wrongfully place [one]self in another’s position as an author.”127 What \nDrassinower has in mind here, evidently, is any adoption of another’s communicative \nact as one’s own, and in a way which also involves its public presentation. There is no \nsuch adoption where A independently creates and communicates a work that \ncoincidentally bears a similarity to a pre-existing work authored by B: the similarity, \nrightly in Drassinower’s view, does not constitute a basis for finding A liable to B. \nThere should equally be no liability, in his view, if A’s use of the earlier work, though \ndeliberate, is reasonably necessary for his or her own exercise of authorship,128 for in \nsuch a case A is addressing the public on his or her own account. (It is this \ninterpretation of the wrong involved in copyright infringement that grounds \nDrassinower’s arguments, noted in the Introduction above, about the legal position of \ntransformative re-users of copyright material.)  \n \nAspects of copyright law, Drassinower argues, already recognize this fundamental \nreciprocity between actual and potential future authors. One example is the so-called \nidea\/expression dichotomy: the principle that where one author has not copied another \nauthor’s expression but has instead expressed the latter’s idea anew, s\/he has shown \nindependent authorship and cannot be impugned for trespassing on another’s \nauthorship.129 Another example is the defence available for using a work as part of an \nexercise in criticism or review of that work. However other aspects of the current law \n– including many of those yielded by its recent expansionary tendencies – fail to \nacknowledge the equal authorial freedom of addressees. To remedy this, Drassinower \nsuggests that at least some defences and exceptions to copyright protection – the vast \nmajority of which currently give rise to nothing more than user ‘privileges’ and as \nsuch are vulnerable to being overridden by digital rights management systems and the \n                                                 \n123\n Drassinower, “Authorship as Public Address.” \n124\n Ibid. p.223. \n125\n Ibid. p.224. \n126\n Ibid. p.225. \n127\n Ibid. \n128\n Ibid. p.224-5. \n129\n Drassinower, “A Rights-Based View of the Idea\/Expression Dichotomy in Copyright Law,” p.9-10.  \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 28 \ncontractual ordering of user privileges that these enable – should be placed on a firmer \nlegal foundation by being characterised as user ‘rights.’130 The fundamental user right, \nhe suggests, is the right to engage with (as opposed to merely repeating), and respond \npublicly to, works of authorship in ways that reasonably require the use of those \nworks. This is as integral to copyright law as the authorial right of public presentation, \nbecause it too protects authorial freedom. “Equality, then, is the category that would \nmake intelligible the connection between author rights and user rights as aspects of \nthe copyright system.”131 The domain protected by copyright and the public domain \n(i.e. the reservoir of intellectual materials that may be freely drawn upon in authorial \nactivity) must thus be seen as two moments of a single integrated structure oriented \ntowards guaranteeing equal authorial freedom for all.  \n \nThese conclusions – which dovetail with recent proposals to ‘constitutionalize’ the \nprivate relations between copyright owners and users of copyright material132 – are \nundeniably consistent with the logic of the 1785 Essay. However, what I want to \nargue here is that from the perspective of Kant’s philosophy as a whole, the structure \nof rights Drassinower envisages is in turn only intelligible as conducing to social \nemancipation by fostering the conditions under which free public criticism could be \npossible. It is his neglect of this dimension of Kant’s thought that accounts for \nDrassinower’s tendency to conflate communication with expression, and autonomy \nwith agency, when theorizing the nature of the ‘speaking’ that is bound up with \nauthorship and protected by authors’ rights. While he frequently asserts that copyright \nlaw’s point is to protect ‘communication’ – a copyright work, he insists, just “is an \ninvitation to engage in dialogue”133 – Drassinower’s arguments only in fact sustain the \nclaim that copyright law protects original expression: expression that originates in the \nmind of an individual.134 What he shows is that responses to the authorial acts of \nothers ought to be legally guaranteed, not particularly as elements within a social \nprocess of communicative interaction, but as individual expressive acts in their own \nright. This begs the question of why individual expressivity merits copyright law’s \nprotection in the first place. On the utilitarian account, that protection is merely a \nmeans to an end: by incentivizing expression, copyrights serve aggregate welfare. \nDrassinower wants to invoke the idea of moral autonomy that underpins Kant’s \nethical theory to argue for an opposed understanding of authors’ rights as ends in \nthemselves, “inseparable from and embedded in any affirmation of the dignity of \nauthorship itself.”135 Yet what his analysis actually suggests is that authors’ rights are \ngrounded, not in an idea of autonomy (whether Kantian or Millian) but in a quite \n                                                 \n130\n On this, see in particular Drassinower, “Taking User Rights Seriously”, where it is also suggested \nthat existing defences to copyright “are not exhaustive but rather illustrative of a higher principle of \nauthorship equally applicable to both parties” (ibid. p.471) to a copyright infringement action, and \nhence that further defences not currently given statutory recognition may be warranted.  \n131\n Drassinower, “Authorship as Public Address” p.213. \n132\n For comparative analysis of the constitutionalisation of private law generally in Germany, the \nNetherlands and the UK, see Olha O. Cherednychenko, “Fundamental Rights and Private Law: A \nRelationship of Subordination or Complementarity?” Utrecht Law Review 3(2) (2007) pp.1-25. On the \nconstitutionalisation of copyright law, see e.g. Lucie M.C.R. Guibault, Copyright Limitations and \nContracts (The Hague\/London\/Boston: Kluwer, 2002), and Christophe Geiger, “‘Constitutionalising’ \nIntellectual Property Law? The Influence of Fundamental Rights on Intellectual Property in the \nEuropean Union” IIC 37 (2006) 371-406. \n133\n Drassinower, “Authorship as Public Address” p.230 (emphasis in original). \n134\n On this see also Abraham Drassinower, “Capturing Ideas: Copyright and the Law of First \nPossession” Cleveland State Law Review 54 (2006) p.191. \n135\n Drassinower, “Taking User Rights Seriously” p.479. \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 29 \ndifferent idea of negative liberty: freedom as individual capacity to do (or in this case, \nto say) what one chooses, without interference from others but within limits defined \nby the equivalent liberties of others. Unfortunately, this presupposes an individualistic \nand empiricist understanding of the rationality of choice that is perfectly compatible \nwith the very utilitarianism from which Drassinower seeks to distance himself.  \n \nKant’s own answer to the question of why individual expressivity merits protection is, \nas we have seen, rather more complex. At no point does he argue that individual \nrights to freedom of expression, much less authors’ rights, are directly deducible from \nthe idea of moral autonomy. Individual expressive freedom is an aspect of a person’s \nagency, and Right requires that others not be permitted to interfere with or usurp it \nexcept under a universal law guaranteeing equal spheres of freedom for all. However \nthere is much more at stake in the protection of expressive freedom than individual \nagency, because freedom of expression is also a condition for the possibility of \nintellectual autonomy in Kant’s very demanding sense: the determination of thought \nby reason alone. Intellectual autonomy in turn presupposes communicative freedom: \nthe freedom to articulate one’s thoughts in public, subject to principles entailed by the \ninternal logic of communication itself as a mode of interaction between a plurality of \n(at least potentially) rational persons. It is this principled freedom of thought and \ncommunication that alone serves humanity’s collective project of advancing towards a \nmature, and therefore fully emancipated, culture.  \n \nWhat additional implications for copyright law – beyond those rightly identified by \nDrassinower – can be gleaned from Kant’s reflections on authors’ rights, set against \nthis picture of communicative freedom? One point must be made unequivocally. It \nfollows from Kant’s own understanding of Right that law cannot prohibit ‘immature’ \nforms of expression: individual liberty to say what one chooses is, as we have seen, a \ncondition of communicative freedom in the richer sense outlined in section 2 above. \nThere can therefore be no question of, for example, reorganizing the copyright system \nso as to favour intellectual production that shows a particularly high degree of \nauthorial independence – as if such a standard could be knowable in advance of the \nvery interactions that enable its emergence. Kant’s thinking must be construed as \ntending in a different direction, and as yielding two general but nonetheless powerful \ninsights. First, the 1785 Essay on unauthorized reprinting reflects Kant’s recognition \nthat communication between speakers in modern conditions is inevitably channelled – \nby technologies and media of communication (print and books in Kant’s day; \nsoftware and networks in ours), by commercial intermediaries (Prussian publishers in \nKant’s context; global information and entertainment corporations in ours), and by \ninstitutional structures (book markets then; information markets generally now) – in \nways that may shape the form and content of communication and so the nature of the \ncommunication community itself. The Essay can therefore be understood as \nthematizing these mediations and their propensity to enhance, but also perhaps to \ncompromise, extant possibilities for mature communicative interactions; and as \nreflecting upon the legal framework that ought to regulate these mediations so as to \nrealise their capacity to support such interactions and forestall their capacity to distort \nthem.136 The second insight speaks directly to that aspect of the legal framework that \n                                                 \n136\n The free software movement can be understood in this light. It is primarily concerned with ensuring \nthat the technical infrastructures with which today’s public spheres are intertwined – the protocols, \nstandards, applications and software constituting digital networks: what might be called the material, as \ndistinct from the transcendental, conditions for the possibility of public communication – are \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 30 \nprotects the rights of authors. It poses a challenge to the premise of the standard \nliberal perspective on the relationship between authors’ rights and a free culture: that \nmarketable property rights in authors’ works, by protecting individual expression, \nserve as motors of progress towards a fully competitive marketplace of ideas. For \nKant, by contrast, progress towards an enlightened culture can only be achieved \nthrough the critical intellectual activity that communication – the free use of reason in \npublic – demands. This position affords a perspective from which to evaluate the \nexpressive diversity that passes for freedom on the standard liberal account: for Kant, \nthere simply is no freedom without the principled communicative interactions that the \npublic use of reason presupposes. Expressive freedom is certainly a condition of this \n‘higher’ form of freedom, but in so far as the workings of the copyright system \nimpede the social practices and orientations conducive to intellectual\/communicative \nautonomy, copyright law must be regarded as constituting an obstacle to cultural \nprogress, rather than its engine.  \n \nConstraints of space preclude a comprehensive exploration of the ways in which the \ncurrent organization of the copyright industries and copyright law might be vulnerable \nto the kind of rethinking that these insights demand. However one conclusion at least \nseems inescapable: fully exchangeable property rights in works of authorship are in \nno way required by Kant’s theory of authors’ rights. IP scholars who claim Kant as an \ninfluence have been remarkably reluctant to acknowledge this,137 perhaps because of a \n                                                                                                                                            \nthemselves subject to public debate and re-making. As the movement’s advocacy of ‘copyleft’ \nlicensing shows, this critical project in turn implicates copyright law’s regulation of these \ninfrastructures. For an unorthodox but interesting argument along these lines, see Christopher Kelty, \nTwo Bits: The Cultural Significance of Free Software (Durham and London: Duke University Press, \n2008). \n137\n Drassinower is ambivalent. Whereas he insists that works of authorship be regarded for copyright \npurposes as activities of speech rather than as intellectual ‘objects’ – reified results of these activities – \nhe falls short of denying that a copyright is or ought to be a property right (see e.g. Drassinower, \n“Authorship as Public Address” p.221). Robert Merges, meanwhile, has called on Kant’s support for \nhis own project of justifying intellectual property (see note 28 above). This move is problematic for a \nnumber of reasons. As shown already, it is impossible to read the 1785 Essay as explaining the rights \nof authors in terms of a concept of literary property, and Merges’s own attempt to do so rests on an \nimplausible interpretation of a throwaway remark Kant makes at the beginning of the Essay, coupled \nwith an unconvincing dismissal of the rest of the Essay (Merges, Justifying Intellectual Property, p.78 \nand n.40, pp.341-2). Merges’s invocation of Kant’s theory of property to ground intellectual property \nrights tout court, on the other hand, depends on a reconstruction of the theory that bears scant \nresemblance to anything in the Rechtslehre, where Kant’s theory of property is set out. Kant, Merges \nasserts, “believed that any object [including intellectual objects] onto which a person projects his or her \nwill may come to be owned” (ibid. p.72). He adds that “Kant understands ownership to be crucial to \nthe development of a person’s full potential” (ibid. p.304), and that “[f]or Kant, property is all about \nrespect for autonomy” (ibid. p.307). Consequently, he says, Kant’s vision of property implies “a \nradically individualistic … view of humans” (ibid. p.76). Creative individuals imprint their autonomous \nwills on the intellectual artefacts they produce in the process of realizing their unique mental \nconceptions (ibid. pp.72-77). Hence the respect due to the dignity of these individuals makes the legal \nprotection of IPRs rationally necessary (ibid. p.94-6). It is difficult to discern the logic of Merges’s \nthinking here, but it is certainly not Kant’s. The ‘autonomy’ to which he refers is clearly the personal \nautonomy around which contemporary liberal individualism is organized, yet the notion that property is \nthe central platform for the realization of this autonomy seems to add an infusion of Hegel (drained of \nthe latter’s metaphysics of Spirit) to the mix. For Kant, by contrast, property is necessary to agency, not \npersonal autonomy. One exercises one’s agency in relation to a thing by publicly taking control of it, \nnot by realizing one’s plans for it once control has been assumed (Kant, The Metaphysics of Morals \np.411 (6:258); p.417 (6:265)). It is absolutely clear that, for Kant, only corporeal things may be objects \nof property rights (as distinct from contract or domestic rights): see ibid. p.402 (6:247); p.412 (6:259); \np.421 (6:270); p.437-8 (6:2:290)). Further, Kant’s conception of the legitimacy of a claim to property in \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 31 \nconcern that without such rights authors would lack the means to support themselves \nfrom the fruits of their intellectual activity alone. Yet breaking the link between \nauthors’ rights and property rights in no way entails leaving authors with only their \ninalienable ‘moral’ rights – their authorial ‘dignity’ and nothing else. As we have \nseen, Kant’s Essay was centrally oriented towards establishing the right of authors to \nearn a living from their works, thereby fostering the emergence of a class of \nprofessional intellectuals released from dependence on courtly and ecclesiastical \npatronage. In contemporary conditions, however, exchangeable intellectual property \nrights more often than not result in a new kind of authorial ‘tutelage’ in relation to the \ninvestors that acquire these rights.138 Reading Kant quite literally, there is no \n(rationally) necessary connection between protecting the material interests of authors \nand recognizing them as holders of property rights in their works, and it follows that \nother systems of subsidy might serve equally well to protect these interests while also \nmore effectively guaranteeing authorial independence.139 As Kant himself pointed \nout, “the author speaks to his reader; and the one who has printed the book speaks, by \nhis copy, not for himself but simply and solely in the author’s name. He presents the \nauthor as speaking publicly, and only mediates delivery of his speech to the \npublic.”140 Ideally, then, commercial intermediaries between authors and audiences \nprovide only “the mute instruments for delivering the author’s speech to the \npublic;”141 they cannot assume the capacity to dictate or distort this speech.  \n \nThis dimension of Kant’s thought might fruitfully be read in relation to Jürgen \nHabermas’s much-discussed account of the ‘structural transformation’ of the public \nsphere.142 Habermas here picked out the rise of the culture industry in the nineteenth \ncentury as the key element in this transformation (and, in his view, decline). He \n                                                                                                                                            \na thing has nothing to do with placing one’s “unique stamp” (Merges, Justifying Intellectual Property, \np.305) on the thing: indeed Kant dismisses as “absurd” (ibid. p.413 (6:260) this “tacit prevalent \ndeception of personifying things” (ibid. p.420 (6:269)). Instead, the legitimacy of a proprietary claim \ndepends on the possibility of reconciling one’s claim with the equal claim of everyone else to exercise \nhis or her agency in relation to the same thing (ibid. p.410 (6:257); p.413 (6:261)). For Kant, this is \ndeeply problematic given the finitude of possible objects of property on a ‘spherical’ planet. It is for \nthis reason that he holds that property rights can only be provisional pending the achievement of a \nglobal system of Right: a process of global public (i.e. fully inclusive) legislation through which the \nfreedoms of all in respect of the Earth’s finite resources could be reconciled (ibid. p.491 (6:355)). (On \nthis see Flikschuh, Kant and Modern Political Philosophy, Ch. 4 and 5). In short, nothing in Kant’s \nown theory of property serves as a foundation for a theory of intellectual property, and his theory of \nproperty in tangibles cannot plausibly be described as ‘radically individualistic’.  \n138\n Raymond Williams has charted the historical shift from patronal to market social relations around \ncultural production. In Culture, he identified the latest phase of market relations at the time of writing \n(1981) as the ‘corporate professional’, characterized by highly capitalized corporate structures and the \ndirect commissioning of saleable products from employed writers. (Raymond Williams, Culture \n(London: Fontana, 1981), Ch.2). David Hesmondhalgh has since revisited and updated Williams’ \nanalysis (re-naming the ‘corporate professional’ as the ‘complex professional’ era of cultural \nproduction): see David Hesmondhalgh, The Cultural Industries 2nd ed. (London: Sage, 2007), Ch.2. \n139\n The UN’s Committee on Economic, Social and Cultural Rights has taken this view of the \nrequirements of Art. 15(1)(c) of the Covenant on Economic, Social and Cultural Rights, recognizing \n“the right of everyone to benefit from the protection of the moral and material interests resulting from \nany scientific, literary or artistic production of which he or she is the author” (see CESCR, General \nComment No. 17 U.N. Doc. E\/C.12\/GC\/17 (Nov. 21, 2005)).  \n140\n Kant, “On the Wrongfulness of Unauthorized Publication of Books” p.30 (8:80). \n141\n Ibid. p.30 (8:81). The mute instruments Kant had in mind here were printed books, but today of \ncourse include the full panoply of cultural commodities. \n142\n Jürgen Habermas, The Structural Transformation of the Public Sphere: An Inquiry into a Category \nof Bourgeois Society (1962) (Cambridge: Polity, 1989) p.102 ff. \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 32 \nargued that commodified mass culture turned active readers into passive, privatized \nconsumers of leisure and entertainment, fragmenting them into distinct taste \ncommunities and distancing them from cultural producers; while groups of experts \nemerged to take over the critical functions of the earlier public sphere. “The sounding \nboard of an educated stratum tutored in the public use of reason … shattered; the \npublic … split apart into minorities of specialists who put their reason to use \nnonpublicly and the great mass of consumers whose receptiveness [was] public but \nuncritical.”143 As a result, the eighteenth century public sphere – having initially \nemerged in opposition to the ‘representative’ public organised around the figure of the \nfeudal monarch’s court – became ‘re-feudalised’. Habermas never considered how \ncopyright law figured in this transformation, although an echo of his concerns \narguably reverberates within contemporary debates about the ‘information feudalism’ \nassociated with over-broad copyrights wielded in today’s context of cultural industry \nconcentration.144 Reading Habermas in the light of Kant’s 1785 Essay, it seems clear \nthat an analysis of the role that authors’ rights – as distinct from copyrights – might \nplay in the reinvigoration of the public sphere (the sphere of principled public \ncriticism) is long overdue.  \n \nSuch a project, however, would inevitably also involve reading Kant in the light of \nHabermas and other contemporary critics of information capitalism, and thus move \nbeyond Kant’s own writings on authorship, rights and communicative freedom even if \nremaining broadly ‘Kantian’ in orientation. The justification for such a move would \nsimply be this: in allowing one’s thinking about matters of contemporary concern to \nbe guided by Kant’s texts, it is unwise to look in these texts for prescriptions that must \nbe followed to the letter, for that would be to treat Kant himself as a ‘guardian’ whose \ndoctrines ought to supplant our own intellectual autonomy in these matters. As is \nparticularly apparent from his account of citizenship, Kant could not transcend his \nown – far from fully enlightened – cultural environment. It is for this reason that \nHabermas has read Kant’s remarks on publicity as presupposing the educated \nbourgeoisie as the critically debating public that was uniquely entitled and obliged to \nengage in a free use of its reason. And although Katerina Deligiorgi may be correct to \nclaim that Kant’s exclusion of women from the status of citizenship did not translate \ninto a denial of women’s participation in the cosmopolitan realm of public debate,145 \nthis concession arguably only reflects the division of the political from the \n(feminized) literary public sphere that was a feature of eighteenth century bourgeois \nlife.146 Recall that Kant defines the public use of reason as “that use which anyone \nmay make of [reason] as a scholar before the entire public of the world of readers.”147 \nThe words ‘anyone’ and ‘entire’ here suggest that this practice of reasoned \ncommunication is in principle available to all, regardless of social status. Yet the \nwords ‘scholar’ and ‘readers’ make clear that it was from the ranks of the learned that \nKant expected the rational debating public to emerge.148  \n                                                 \n143\n Ibid. p.175. \n144\n Peter Drahos with John Braithwaite, Information Feudalism (London: Earthscan, 2002). \n145\n Deligiorgi, Kant and the Culture of Enlightenment, p.73. \n146\n See e.g. Dena Goodman, The Republic of Letters: A Cultural History of the French Enlightenment \n(Ithaca: Cornell University Press, 1994). \n147\n Kant, “‘What is Enlightenment?’” p.18 (8:37) \n148\n Deligiorgi suggests that this expectation can be interpreted as inclusive rather than exclusive \nbecause it signifies that none of the traditional barriers of rank, wealth or occupation should apply \n(Deligiorgi, Kant and the Culture of Enlightenment, p.72). However, John Christian Laursen has shown \nthat Kant aimed his remarks very deliberately at a particular social class: the educated general public \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 33 \n \nIf indeed Kant conflated the educated bourgeoisie with humanity as such, and saw the \nopinions generated by the debating bourgeois public as reflecting the light of reason \nas such, are we to assume that the authors whose rights Kant theorizes in his \nreflections on books and publishing are likewise bourgeois authors – if not ‘scholars’ \nthen persons whose class position made it inevitable that they could write as if they \nwere scholars? If so, Kant’s writings on both publicity and publishing would be \nhopelessly compromised by his own particular prejudices. Yet Habermas’s reading of \nKantian publicity suggests that it need not be dismissed as a mere ideological cloak \nfor bourgeois privilege: that the ideal of fully participatory public criticism between \nequals is still worth pursuing. The spirit of Kant’s understanding of this ideal – \nwhereby ‘anyone’ may address the ‘entire public’ – requires that all persons be free, \nsubstantively as well as formally, to participate. Because of this, Kant’s argument for \nthe continued advance of Enlightenment can be read as calling for the overcoming of \nevery kind of obstacle to its realization – an unceasing interrogation of all the \neconomic, technological, political, social and legal impediments that now stand in the \nway of universal, equal and effective access to the means and media of \ncommunication – and this on a global scale, if Kant is understood as positing a \n‘cosmopolitan’ society of free communicative interactions, a global public sphere. \nCopyright law is not the only such impediment – nor only an impediment, for as \nsuggested here, authors’ rights deserve a place in the legal infrastructure underpinning \nboth global and domestic public spheres – but in its current form it is an important \none.  \n \n \n \nACKNOWLEDGEMENTS \n \nA first draft of this article – entitled “Copyright and the Public Sphere” – was \npresented at a conference on the theme of ‘Philosophy and Intellectual Property’ at \nthe Institute of Philosophy, London (May 29-30, 2009). Thanks are due to the \nconference participants for engaging enthusiastically with that paper. The process of \nre-drafting thereafter was greatly enriched by discussions with Katerina Deligiorgi, \nPeter Niesen, and Lea Ypi.  \n \n \n \n \n \n \n                                                                                                                                            \naddressed by the essays on the public use of reason was in fact the eighteenth century German \nbourgeoisie (John Christian Laursen, “The Subversive Kant: The Vocabulary of ‘Public’ and \n‘Publicity’” in J. Schmidt (ed.) What is Enlightenment? 18th Century Answers and 20th Century \nQuestions (UC Berkeley Press: 1996) pp.253-269). The occupants of civil positions referred to in \n“‘What is Enlightenment?’”, Laursen suggests, are not only state and church officials narrowly \nconceived, but members of the bourgeois class in general, all of whom – in the Prussia of Kant’s day – \nwould have depended (directly or indirectly) on the monarch for their livelihoods. The category would \nhave included merchants, professors like Kant himself and members of the clergy, to whose situation \nmost of the discussion in the essay is directed. Indeed Laursen has argued that Kant’s project in this \nessay was to make a case for the freedom of this constituency to express their considered opinions \nopenly, notwithstanding their status as functionaries of the establishment.  \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 34 \n \nREFERENCES \n \nAnne Barron, “Copyright Infringement, ‘Free-Riding’ and the Lifeworld” in L. \nBently, J. Davis and J. Ginsburg (eds.) Copyright and Piracy: An Interdisciplinary \nCritique (Cambridge: Cambridge University Press, 2010), pp.93-127 \nCharles R. Beitz, “The Moral Rights of Creators of Artistic and Literary Works” \nJournal of Political Philosophy 13(3) (2005) pp.330-358  \nSeyla Benhabib, The Rights of Others: Aliens, Residents, and Citizens (Cambridge: \nCambridge University Press, 2004) \nYochai Benkler, “Free as the Air to Common Use: First Amendment Constraints on \nEnclosure of the Public Domain” 74 (1999) New York University Law Review pp.354-\n446 \nYochai Benkler, “Siren Songs and Amish Children: Autonomy, Information and \nLaw” 76 (2001) New York University Law Review pp.23-113  \nYochai Benkler, The Wealth of Networks (New Haven and London: Yale University \nPress, 2006) \nJames Bohmann, “The Public Spheres of the World Citizen” in J. Bohmann and M. \nLutz-Bachmann (eds.) Perpetual Peace: Essays on Kant’s Cosmopolitan Ideal \n(Cambridge, MA: MIT Press, 1997), pp.179-200 \nJames Boyle, “The Second Enclosure Movement and the Construction of the Public \nDomain” Law & Contemporary Problems 66 (2003) pp.33-74 \nJames Boyle and Lawrence Lessig (eds.) ‘Cultural Environmentalism @ 10’ (a \nspecial issue of Law and Contemporary Problems 70(2) (2007) \nJames Boyle, The Public Domain: Enclosing the Commons of the Mind (New Haven \nand London: Yale University Press, 2008) \nB. Sharon Byrd and Joachim Hruschka, Kant’s Doctrine of Right: A Commentary \n(Cambridge: Cambridge University Press, 2010) \nGeorg Cavallar, Kant and the Theory and Practice of International Right (Cardiff: \nUniversity of Wales Press 1999)  \nJoseph Chan, “Raz on Liberal Rights and Common Goods” Oxford Journal of Legal \nStudies 15 (1995) pp.15-31 \nOlha O. Cherednychenko, “Fundamental Rights and Private Law: A Relationship of \nSubordination or Complementarity?” Utrecht Law Review 3(2) (2007) pp.1-25 \nJohn Christman and Joel Anderson, Autonomy and the Challenges to Liberalism \n(Cambridge: Cambridge University Press, 2005) \nCommittee on Economic, Social and Cultural Rights, General Comment No. 17 U.N. \nDoc. E\/C.12\/GC\/17 (Nov. 21, 2005) \nKaterina Deligiorgi, Kant and the Culture of Enlightenment (Albany, NY: SUNY \nPress, 2005) \nPeter Drahos with John Braithwaite, Information Feudalism (London: Earthscan, \n2002) \nAbraham Drassinower, “A Rights-Based View of the Idea\/Expression Dichotomy in \nCopyright Law” Canadian Journal of Law and & Jurisprudence 16 (2003) pp.3-21 \nAbraham Drassinower, “Taking User Rights Seriously” in Michael Geist, ed., In the \nPublic Interest: The Future of Canadian Copyright Law, (Toronto:  Irwin Law, 2005), \npp.462-479 \nAbraham Drassinower, “Authorship as Public Address: On the Specificity of \nCopyright vis-à-vis Patent and Trade-Mark” Michigan State Law Review 1 (2008) \npp.199-232 \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 35 \nAbraham Drassinower, “From Distribution to Dialogue: Remarks on the Concept of \nBalance in Copyright Law” 34(4) (2009) Journal of Corporation Law pp. 991-1007 \nAbraham Drassinower, “Capturing Ideas: Copyright and the Law of First Possession” \n(2006) 54 Cleveland State Law Review 191-204 \nAbraham Drassinower, “Copyright Infringement as Compelled Speech” (2011) (draft \non file with the author) \nGerald Dworkin, The Theory and Practice of Autonomy (Cambridge: Cambridge \nUniversity Press, 1991) \nElisabeth Ellis, Kant’s Politics: Provisional Theory for an Uncertain World (New \nHaven: Yale University Press, 2005) \nJohann G. Fichte, “Proof of the Unlawfulness of Reprinting” (Berlinische \nMonatschrift (1793), pp. 443-482, trans. Martha Woodmansee, in L. Bently & M. \nKretschmer (eds.) Primary Sources on Copyright (1450-1900) (available at: \nwww.copyrighthistory.org) \nKatrin Flikschuh, Kant and Modern Political Philosophy (Cambridge: Cambridge \nUniversity Press, 2000) \nKatrin Flikschuh, Freedom: Contemporary Liberal Perspectives (Cambridge: Polity \nPress 2007) \nChristophe Geiger, “‘Constitutionalising’” Intellectual Property Law? The Influence \nof Fundamental Rights on Intellectual Property in the European Union” IIC 37 (2006) \npp.371-406 \nDena Goodman, The Republic of Letters: A Cultural History of the French \nEnlightenment (Ithaca: Cornell University Press, 1994) \nLucie M.C.R. Guibault, Copyright Limitations and Contracts (The Hague, London \nand Boston: Kluwer, 2002) \nJürgen Habermas, The Structural Transformation of the Public Sphere: An Inquiry \ninto a Category of Bourgeois Society (1962) (Cambridge: Polity, 1989) \nDavid Hesmondhalgh, The Cultural Industries 2nd ed. (London: Sage, 2007) \nOtfried Höffe, Kant’s Cosmopolitan Theory of Law and Peace, (Cambridge: \nCambridge University Press, 2006) \nAnthony M. Honoré, “Ownership” in A. G. Guest (ed.) Oxford Essays in \nJurisprudence (Oxford: Clarendon, 1961) \nImmanuel Kant, Critique of Pure Reason (1781) (trans. P. Guyer and A. Wood) \n(Cambridge: Cambridge University Press, 1998)  \nImmanuel Kant, “An Answer to the Question: ‘What is Enlightenment?’” (1784) in \nMary J. Gregor (ed.) Immanuel Kant: Practical Philosophy (Cambridge: Cambridge \nUniversity Press 1998) pp.17-22  \nImmanuel Kant, “On the Wrongfulness of Unauthorized Publication of Books” (1785) \nin Mary J. Gregor (ed.) Immanuel Kant: Practical Philosophy (Cambridge: \nCambridge University Press 1998) pp.29-35  \nImmanuel Kant, Groundwork for the Metaphysics of Morals (1785) in Mary J. Gregor \n(ed.) Immanuel Kant: Practical Philosophy (Cambridge: Cambridge University Press \n1998), pp.41-108 \nImmanuel Kant, “What is Orientation in Thinking” (1786) in H. Reiss (ed.) Kant’s \nPolitical Writings (2nd ed.) (Cambridge: Cambridge University Press, 1991), pp.237-\n49  \nImmanuel Kant, Critique of Practical Reason (1788) in Mary J. Gregor (ed.) \nImmanuel Kant: Practical Philosophy (Cambridge: Cambridge University Press \n1998), pp.137-271 \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 36 \nImmanuel Kant, Critique of Judgment (1790) (trans. W. S. Pluhar) (Indianapolis: \nHackett, 1997) \nImmanuel Kant, The Metaphysics of Morals (1797), in Mary J. Gregor (ed.) Immanuel \nKant: Practical Philosophy (Cambridge: Cambridge University Press 1998), pp.363-\n603 \nImmanuel Kant, “On the Common Saying: That may be Correct in Theory, but it is no \nuse in Practice” (1793) in Mary J. Gregor (ed.) Immanuel Kant: Practical Philosophy \n(Cambridge: Cambridge University Press 1998), pp.279-309  \nImmanuel Kant, “Toward Perpetual Peace” (1795) in Mary J. Gregor (ed.) Immanuel \nKant: Practical Philosophy (Cambridge: Cambridge University Press 1998), pp.315-\n351  \nImmanuel Kant, Anthropology from a Pragmatic Point of View (1798) trans. Mary J. \nGregor (Nijhoff: The Hague, 1974) \nChristopher Kelty, Two Bits: The Cultural Significance of Free Software (Durham \nand London: Duke University Press, 2008) \nLarry Krasnoff, “The Fact of Politics: History and Teleology in Kant” European \nJournal of Philosophy 2(1) (1994) pp. 22-40 \nJay Lampert, “Locke, Fichte and Hegel on the Right to Property” in M. Baur and J. \nRusson (eds.) Hegel and the Tradition: Essays in Honour of H.S. Harris (Toronto: \nUniversity of Toronto Press, 1997), pp.40-73 \nJohn Christian Laursen, “The Subversive Kant: The Vocabulary of ‘Public’ and \n‘Publicity’” in J. Schmidt (ed.) What is Enlightenment? 18th Century Answers and 20th \nCentury Questions (Berkeley and Los Angeles: University of California Press, 1996) \npp. 253-269 \nMark A. Lemley, “Property, Intellectual Property, and Free Riding” Texas Law \nReview 83 (2005) pp.1031-1075  \nLawrence Lessig, Free Culture: How Big Media Uses Technology and the Law to \nLock Down Culture and Control Creativity (New York: Penguin, 2004) \nRobert P. Merges, Justifying Intellectual Property (Cambridge, MA: Harvard \nUniversity Press, 2011) \nJohn Stuart Mill, On Liberty (1859) (London: Penguin, 1974) \nNeil W. Netanel, “Alienability Restrictions and the Enhancement of Author \nAutonomy in United States and Continental Copyright Law” Cardozo Arts and \nEntertainment Law Journal 12 (1994) 1 \nNeil W. Netanel, Copyright’s Paradox (Oxford: Oxford University Press, 2008) \nPeter Niesen, “Colonialism and Hospitality” Politics and Ethics Review 3(1) (2007) \npp. 90–108 \nOnora O’Neill, Constructions of Reason: Explorations of Kant’s Practical Philosophy \n(Cambridge: Cambridge University Press, 1989) \nAlan Patten, Hegel’s Idea of Freedom (Oxford: Oxford University Press, 2002) \nThomas W. Pogge, “Kant’s Theory of Justice” Kant-Studien 79 (1988) pp.407-433 \nJoseph Raz, The Morality of Freedom (Oxford: Oxford University Press, 1988 \nArthur Ripstein, Force and Freedom: Kant’s Legal and Political Philosophy \n(Cambridge, Massachusetts: Harvard University Press, 2009) \nCyrill P. Rigamonti, “The Conceptual Transformation of Moral Rights” (2007) 55 \nAmerican Journal of Comparative Law 67 \nPamela Samuelson, “Challenges in Mapping the Public Domain” in L. Guilbault and P. \nB. Hugenholtz (eds.) The Future of the Public Domain: Identifying the Commons in \nInformation Law (Kluwer: Alphen aan den Rijn, 2006), pp. 7-25 \nKant, Copyright and Communicative Freedom  \nforthcoming, Law and Philosophy (2011) \n 37 \nStig Strömholm, Le Droit Moral de l’Auteur (2 Vols.) (Stockholm: P.A. Norstedt & \nSöners Förlag, 1967) \nLeslie Kim Treiger-Bar-Am, “Kant on Copyright: Rights of Transformative \nAuthorship” Cardozo Arts and Entertainment Law Journal (2008) pp.1059-1103 \nHoward Williams, “Liberty, Equality and Independence: Core Concepts in Kant’s \nPolitical Philosophy” in G. Bird (ed.) A Companion to Kant (Oxford: Blackwell, \n2006), pp. 364-382 \nRaymond Williams, Culture (London: Fontana, 1981) \nAllen W. Wood, Kant’s Ethical Thought (Cambridge: Cambridge University Press, \n1999) \nAllen Wood, Hegel’s Ethical Thought (Cambridge: Cambridge University Press, \n1990) \n \n \n"}