{"doi":"10.3189\/172756407782282453","coreId":"69276","oai":"oai:eprints.lancs.ac.uk:27353","identifiers":["oai:eprints.lancs.ac.uk:27353","10.3189\/172756407782282453"],"title":"Volcano-ice interactions at Prestahnukur, Iceland : rhyolite eruption during the last interglacial-glacial transition.","authors":["McGarvie, David W.","Stevenson, John A.","Burgess, R.","Tuffen, Hugh","Tindle, A. G."],"enrichments":{"references":[{"id":982624,"title":"A model for submarine rhyolite dome growth: Ponza Island (central Italy).","authors":[],"date":"2001","doi":"10.1016\/S0377-0273(00)00295-X","raw":"DeRita, D., G. Giordano and A. Cecili. 2001. A model for submarine rhyolite dome growth: Ponza Island (central Italy). J. Volcan. Geotherm. Res., 107(4), 221–239.","cites":null},{"id":981984,"title":"Block size distributions on silicic lava flow surfaces: implications for emplacement conditions.","authors":[],"date":"1998","doi":"10.1130\/0016-7606(1998)110<1258:BSDOSL>2.3.CO;2","raw":"Anderson, S.W., E.R. Stofan, J.J. Plaut and D.A. Crown. 1998. Block size distributions on silicic lava flow surfaces: implications for emplacement conditions. GSA Bulletin, 110(10), 1258–1267.","cites":null},{"id":982064,"title":"Compositional changes during crystallization of some peralkaline silicic lavas of the Kenya rift valley.","authors":[],"date":"1977","doi":"10.1016\/0377-0273(77)90013-0","raw":"Baker, B.H. and L.F. Henage. 1977. Compositional changes during crystallization of some peralkaline silicic lavas of the Kenya rift valley. J. Volcan. Geotherm. Res., 2(1), 17–28.","cites":null},{"id":982895,"title":"Morphology, eruption rates, and rheology of lava domes: Insights from laboratory models.","authors":[],"date":"1998","doi":"10.1029\/97JB02838","raw":"Fink, J.H. and R.W. Griffiths. 1998. Morphology, eruption rates, and rheology of lava domes: Insights from laboratory models. J. Geophys. Res., 103(B1), 527–546.","cites":null},{"id":982365,"title":"Subaqueous, rhyolitic dome-top tuff cones: a model based on the Devonian Bunga Beds, southeastern Australia and a modern analogue.","authors":[],"date":"1990","doi":"10.1007\/BF00334802","raw":"Cas, R.A.F, R.L. Allen, S.W. Bull, B.A. Clifford and J.V. Wright. 1990. Subaqueous, rhyolitic dome-top tuff cones: a model based on the Devonian Bunga Beds, southeastern Australia and a modern analogue. Bull. Volcanol., 52(3), 159–174.","cites":null},{"id":16664304,"title":"The response of a glacier to a surface disturbance: a case study on Vatnajo ¨kull ice cap,","authors":[],"date":"2000","doi":null,"raw":"Aðalgeirsdo ´ttir, G., G.H. Guðmundsson and H. Bjo ¨rnsson. 2000. The response of a glacier to a surface disturbance: a case study on Vatnajo ¨kull ice cap, Iceland. Ann. Glaciol., 31, 104–110.","cites":null},{"id":981941,"title":"The response of a glacier to a surface disturbance: a case study on Vatnajo¨kull ice cap,","authors":[],"date":"2000","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-10","abstract":"Prestahnukur is a 570m high rhyolite glaciovolcanic edifice in Iceland's Western Rift Zone with a volume of 0.6 km3. Uniform whole rock, mineral and glass compositions suggest that Prestahnukur was constructed during the eruption of one magma batch. Ar-Ar dating gives an age of 89+\/-24 ka, which implies eruption during the transition (Oxygen Isotope substages 5d to 5a) between the Eemian interglacial and the Weichselian glacial period. Prestahnukur is unique among published accounts of rhyolite tuyas because a base of magmatically-fragmented tephra appears to be absent. Instead, basal exposures consist of glassy lava lobes and coarse hyaloclastite, above which are single and multiple lava sheets with matrix-supported basal breccias and hyaloclastite upper carapaces. Steepening ramp structures at sheet termini are interpreted as ice-contact features. Interactions between erupting magma and water\/ice have affected all lithologies. A preliminary model for the construction of Prestahnukur involves an effusive subglacial eruption between 2 and 19 years duration which never became emergent, into an ice sheet over 700m thick. If 700m of ice had built up during this interglacial-glacial transition, this would corroborate models arguing for the swift accumulation of land-based ice in rapid response to global cooling","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69276.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/27353\/1\/McGarvie_et_al_Ann_Glac_2007.pdf","pdfHashValue":"0422f6b738d05a8afbccd37ddd57b3e556d09c80","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:27353<\/identifier><datestamp>\n      2018-01-24T02:51:06Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5145<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Volcano-ice interactions at Prestahnukur, Iceland : rhyolite eruption during the last interglacial-glacial transition.<\/dc:title><dc:creator>\n        McGarvie, David W.<\/dc:creator><dc:creator>\n        Stevenson, John A.<\/dc:creator><dc:creator>\n        Burgess, R.<\/dc:creator><dc:creator>\n        Tuffen, Hugh<\/dc:creator><dc:creator>\n        Tindle, A. G.<\/dc:creator><dc:subject>\n        QE Geology<\/dc:subject><dc:description>\n        Prestahnukur is a 570m high rhyolite glaciovolcanic edifice in Iceland's Western Rift Zone with a volume of 0.6 km3. Uniform whole rock, mineral and glass compositions suggest that Prestahnukur was constructed during the eruption of one magma batch. Ar-Ar dating gives an age of 89+\/-24 ka, which implies eruption during the transition (Oxygen Isotope substages 5d to 5a) between the Eemian interglacial and the Weichselian glacial period. Prestahnukur is unique among published accounts of rhyolite tuyas because a base of magmatically-fragmented tephra appears to be absent. Instead, basal exposures consist of glassy lava lobes and coarse hyaloclastite, above which are single and multiple lava sheets with matrix-supported basal breccias and hyaloclastite upper carapaces. Steepening ramp structures at sheet termini are interpreted as ice-contact features. Interactions between erupting magma and water\/ice have affected all lithologies. A preliminary model for the construction of Prestahnukur involves an effusive subglacial eruption between 2 and 19 years duration which never became emergent, into an ice sheet over 700m thick. If 700m of ice had built up during this interglacial-glacial transition, this would corroborate models arguing for the swift accumulation of land-based ice in rapid response to global cooling.<\/dc:description><dc:date>\n        2006-10<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/27353\/1\/McGarvie_et_al_Ann_Glac_2007.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.3189\/172756407782282453<\/dc:relation><dc:identifier>\n        McGarvie, David W. and Stevenson, John A. and Burgess, R. and Tuffen, Hugh and Tindle, A. G. (2006) Volcano-ice interactions at Prestahnukur, Iceland : rhyolite eruption during the last interglacial-glacial transition. Annals of Glaciology, 45 (1). pp. 38-47. ISSN 0260-3055<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/27353\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.3189\/172756407782282453","http:\/\/eprints.lancs.ac.uk\/27353\/"],"year":2006,"topics":["QE Geology"],"subject":["Journal Article","PeerReviewed"],"fullText":"Volcano–ice interactions at Prestahnu´kur, Iceland:\nrhyolite eruption during the last interglacial–glacial transition\nD.W. McGARVIE,1 J.A. STEVENSON,2 R. BURGESS,3 H. TUFFEN,2 A.G. TINDLE1\n1Department of Earth Sciences, The Open University, Milton Keynes MK7 6AA, UK\nE-mail: d.mcgarvie@open.ac.uk\n2Environmental Sciences, Lancaster University, Lancaster LA1 4YQ, UK\n3School of Earth, Atmospheric and Environmental Sciences, University of Manchester, Oxford Road,\nManchester M13 9PL, UK\nABSTRACT. Prestahnu´kur is a 570m high rhyolite glaciovolcanic edifice in Iceland’s Western Rift Zone\nwith a volume of 0.6 km3. Uniform whole rock, mineral and glass compositions suggest that\nPrestahnu´kur was constructed during the eruption of one magma batch. Ar-Ar dating gives an age of\n89\u000124 ka, which implies eruption during the transition (Oxygen Isotope substages 5d to 5a) between\nthe Eemian interglacial and the Weichselian glacial period. Prestahnu´kur is unique among published\naccounts of rhyolite tuyas because a base of magmatically-fragmented tephra appears to be absent.\nInstead, basal exposures consist of glassy lava lobes and coarse hyaloclastite, above which are single and\nmultiple lava sheets with matrix-supported basal breccias and hyaloclastite upper carapaces. Steepening\nramp structures at sheet termini are interpreted as ice-contact features. Interactions between erupting\nmagma and water\/ice have affected all lithologies. A preliminary model for the construction of\nPrestahnu´kur involves an effusive subglacial eruption between 2–19 years duration which never became\nemergent, into an ice sheet over 700m thick. If 700m of ice had built up during this interglacial–glacial\ntransition, this would corroborate models arguing for the swift accumulation of land-based ice in rapid\nresponse to global cooling.\nINTRODUCTION\nAn important focus of climate research is the transition from\ninterglacial to glacial conditions. The most recent such\ntransition between the Eemian interglacial and the Weich-\nselian glacial (Imbrie and others, 1989) was a period\ninvolving climatic instability linked with rapid temperature\nfluctuations (Guiot, 1990; Follieri and others, 1989;\nMcManus and others, 1994).\nThe main aims of this paper are to present a model for an\nIcelandic rhyolite eruption that occurred during this tran-\nsition, and to show how studies of ice–volcano interactions\ncombined with Ar-Ar dating can provide improved estimates\nof past ice thicknesses. (Detailed accounts of the physical\nvolcanology and petrology of Prestahnu´kur will be pub-\nlished elsewhere.)\nGEOLOGICAL SETTING\nPrestahnu´kur is an isolated rhyolite edifice (Fig. 1), elliptical\n(2.5 km NNE-SSW axis and 2 km WNW-ESE axis), with a\nvolume of \u00020.6 km3 dense rock equivalent (DRE). The\nsummit of 1226m lies \u0002570m above the lowest exposures\n(roughly defined by the 650m contour). Its northwest flanks\nare overlain by the 1069m high Ha´degisfell syðra (a basalt\nglaciovolcanic edifice), and its east-northeast flanks may be\noverlain by the 1390m high Geitlandsjo¨kull basalt tuya;\nhowever, contacts are obscured by scree. Glaciated beds of\nbasaltic hyaloclastite (which probably originated during the\nformation of Geitlandsjo¨kull) occur across much of the\nedifice, which are usually <0.5m but occasionally up to 6m\nthick and contain rhyolite clasts from Prestahnu´kur, particu-\nlarly in the coarser beds.\nVOLCANOLOGICAL OBSERVATIONS\nPrestahnu´kur can be subdivided into three lava tiers: upper,\nlower and southern (Fig. 2). The lower tier is only exposed\non the west flank, where it crops out continuously for nearly\n2 km. The upper tier forms a summit plateau and feeds slope-\ndraping lava sheets on the southeast and east flanks. The\nsouthern tier lies beneath the upper tier and feeds slope-\ndraping lava sheets on the south and southwest flanks\n(Fig. 2). While it is possible that all three tiers originally\nformed one high-level tier that was dismembered by normal\nfaulting, the amount of throw required (over 300m) seems\nunlikely given the much smaller throws on nearby faults\n(Piper, 1973; Saemundsson, 1992). The various lava and\nfragmental lithofacies are now described and interpreted.\nFragmental lithologies\nA range of fragmental lithologies are present. These are\nbroadly divided into four groups: (1) lobe-bearing breccias;\n(2) coarse polymictic breccias; (3) well-bedded breccias,\nsandstones and gravels; and (4) pumice-ash breccias.\nLobe-bearing breccias\nThese dominate the lower parts of the edifice and may\nconstitute >30% of its total volume. They form a clast-\nsupported breccia of coarse and moderately vesicular or\nmicro-vesicular blocks (pale grey and flow-banded), nor-\nmally less than 10 cm, but ranging from 2cm up to 1m in\nsize (Figs 3 and 4), with slightly elongate vesicles oriented\nparallel to flow bands. The blocks are often prismatically\njointed and variably fractured (jigsaw fit), while abundant\ngrey, silty ash infills fractures. Within the breccias occur\nshattered but coherent glassy lava lobes (up to 10m in size)\nAnnals of Glaciology 45 200738\nwhich show irregular columnar joint development (usually\n<10 cm) with hackly and pseudopillow fractures (Lescinsky\nand Fink, 2000) and whose margins grade into the\nsurrounding breccia. This lithology shows little evidence of\noxidation, and has been extensively perlitised.\nQuenching (by water) can explain the observed combin-\nation of abundant obsidian and glassy textures, the matrix of\nash, the lack of oxidation and the generally smaller block\nsize when compared to subaerial rhyolites (Anderson and\nothers, 1998). While smaller blocks can be generated during\nhigh effusion rates (Anderson and others, 1998), the higher\nproportions of obsidian glass and ashy matrix (relative to\nsubaerial lavas), the extensive fracturing of the lava lobes\n(Lescinsky and Fink, 2000) and the extensive perlitisation of\nthe lobes and breccias all suggest that external water was\npresent during the eruption. The breccias are therefore\nFig. 2. Prestahnu´kur from the South: 1 – upper tier; 2 – southern tier; 3 – lower tier; 4 – slope-draping sheets; 5 – hyaloclastite carapace\n(see Figure 7); 6 – single sub-horizontal sheet; and V – vents. A glacial trim-line is visible on the lower left of the edifice (T).\nFig. 1. Outline map of Prestahnu´kur, depicting localities of analysed samples and the extent of the edifice (dotted line). For simplicity, the\nupper and southern tiers have been combined. Black lines indicate localized steepening at sheet termini.\nMcGarvie and others: Volcano–ice interactions at Prestahnu´kur 39\ninterpreted as the quenched outer carapaces of the lava\nlobes: they are hyaloclastite (Goto and Tsuchiya, 2004).\nLobe-hyaloclastite complexes are commonly formed by\nsubaqueous eruptions of silicic magmas (e.g. Goto and\nTsuchiya, 2004; Stewart and McPhie, 2006). This lithology is\ntherefore broadly analogous to the pillow lava sequence\nfound at the base of basaltic tuyas, where extensive\ninteraction with meltwater is well established (e.g. Smellie,\n2000). However, other lithologies characteristic of true\nsubaqueous rhyolite eruptions (e.g. re-deposited hyaloclas-\ntite) are absent (Yamagishi and Dimroth, 1987; DeRita and\nothers, 2001; Stewart and McPhie, 2006).\nCoarse polymictic breccias\nThis lithology occurs at all stratigraphic levels in a variety of\nforms. Only two examples are given here: (a) self-supported\nangular clasts (<20 cm) of flow-banded rhyolite (\u000250%),\nmicrovesicular rhyolite (40%) and obsidian (10%) in an ash\nmatrix; and (b) clast-supported polymictic breccia with\nangular clasts up to 10 cm dominated by microvesicular\nrhyolite clasts (with only minor clasts of obsidian or flow-\nbanded rhyolite).\nExample (a) is interpreted as the deposits of pyroclastic\ndensity currents (block and ash flow) generated by small\nexplosions and collapses of lava bodies during extrusion;\nsuch explosions were common during the emergent phases\nof the 1953–57 Tuluman eruption (Reynolds and others,\n1980). Example (b) is interpreted as the quenched carapace\nof a lava body and\/or the product of glacial reworking of\nsuch material.\nWell-bedded breccias, sandstones and gravels\nIsolated exposures of well-bedded volcaniclastics occur on\nthe edifice (Fig. 5). The beds are usually shallow-dipping\nFig. 3. Typical highly-perlitised lobe-bearing breccias at base of edifice. Person is 1.85m tall.\nFig. 4. Contact between lower tier lava sheet and underlying\nsubstrate: hyaloclastite of the lobe-bearing breccias grades upwards\ninto matrix-supported breccias and then into undisrupted lava.\nPerson is 1.85m tall.\nMcGarvie and others: Volcano–ice interactions at Prestahnu´kur40\nwith a variety of orientations (including dipping back into\nthe slope). Beds range from 1m to <5 cm in thickness, with\nbetter sorting in the thinner and finer-grained beds. Although\nsome exposures contain monolithologic beds (e.g. of grey\nmicrovesicular rhyolite, grading from coarse breccia into\ngravel and then sandstone), more commonly a variety of\nclast types (including obsidian and flow-banded rhyolite)\noccur. In the southwest, a 1.5m thick sequence consists of\n75 cm of well-sorted, diffusely cross-stratified brownish sand\nwith obsidian granules, overlain by 75 cm of extremely fine\nash. The basal part of the ash contains beds up to 2 cm thick\nbearing crystals and obsidian fragments.\nThis lithology, exhibiting sorting and well-defined bed-\nding, is interpreted as the product of debris flows deposited\nin water. This suggests that regions of standing water existed\nat the edifice at different levels and times during its\nconstruction. Poor exposure does not enable the original\nsizes of the water bodies to be determined, but their\nlocalized nature suggests that they were small and isolated.\nMuch of this material has been reworked from a variety of\nsources. The southwest locality, whose fine grain size in a\nproximal location indicates phreatomagmatic explosions\n(Cas and others, 1990), suggests that at least some of this\nmaterial is primary in origin.\nPumice-ash breccias\nThis uncommon lithology forms beds up to 5m thick\ncontaining angular clasts of both white (highly vesicular)\nand grey (moderately vesicular) pumice supported by a\nmatrix of granules of pumice, obsidian and of fine ash. Such\ndeposits form the bulk of the basal parts of other rhyolite\ntuyas (Tuffen and others, 2002; Stevenson, 2005) and were\ninterpreted to have formed by magmatic (vapour-driven)\nfragmentation. They appear to be rare at Prestahnu´kur.\nFragmental lithologies – summary\nThese fragmental lithologies represent the products of a\nrange of eruptive styles and environments, and demonstrate\nthat water, which was involved in both fragmentation and\ndeposition, played a significant role throughout the eruption.\nLava lithofacies\nThe three lava tiers comprise single and multiple lava sheets\nof variable thickness (\u00025–60m) with orientations from sub-\nhorizontal to slope-parallel (up to 408). The lower tier\nappears to consist of one sheet some 30–60m thick, \u00022 km\nwide, which probably flowed <1 km from the (unexposed)\nvent. Both the upper and southern tiers (Fig. 2) comprise\nsingle and stacked lava sheets which have fed slope-draping\nsheets (up to 400m long and 100–250m wide). The\nconstituent lava is strongly flow-banded with abundant\nlithophysae and spherulites constituting up to 80% of the\nrock; the largest lithophysae are 19 cm in diameter. General\nfeatures of the lava sheets are described and interpreted.\nSheet bases\nLava sheet bases are underlain by a zone of interaction with\nthe material beneath (Fig. 4). This zone comprises matrix-\nsupported breccias up to 12m thick (although 2–5m is more\ntypical) consisting of angular, flow-banded and glassy\nrhyolite clasts of variable size (Fig. 6) set in a matrix of\n(mm to sub-mm) comminuted lava fragments and ash. Close\nto the lava, larger clasts (10–30 cm) define mainly jigsaw-fit\ndomains. These grade outwards into smaller clasts defining\nboth jigsaw-fit and clast-rotated domains.\nThese breccias are interpreted as the products of quench\nfragmentation of the lava sheet bases that flowed over soggy\nsubstrate, in a process akin to peperite formation (White and\nothers, 2000), although sediment, sensu stricto, is not in-\nvolved. Explosive mixing has been most energetic nearer the\nsubstrate contact, leading to comminution and back injec-\ntion of the small lava clasts (derived from the sheet) and ash\n(derived from fragmentation of microvesicular substrate\nblocks). Larger jigsaw-fit clasts reflect only minor disruption\nof the sheet well above the zone of explosive mixing.\nSheet tops\nAlthough sheet tops are poorly exposed (either removed by\nerosion or obscured by scree\/till), massive interior lava (often\nglassy) can be seen grading upwards into carapaces com-\nprising unconsolidated pale-to-reddish microvesicular pum-\nice breccias (clast sizes typically 3–20 cm), within which\nselvedges of flow-banded and contact-parallel obsidian\nFig. 6. Matrix-supported breccia at base of slope-draping sheet\n(southern tier). Both jigsaw-fit and clast-rotated domains are\npresent. Person is 1.90m tall.\nFig. 5. Bedded volcaniclastics. The sorting and well-defined\nbedding are interpreted as deposition within water (following\ntransport in debris flows). This suggests that regions of ponded water\nexisted at the edifice at different levels and times during its\nconstruction. Length of pencil within image is 15 cm.\nMcGarvie and others: Volcano–ice interactions at Prestahnu´kur 41\noccur (Fig. 7). Some sheets have carapaces up to 30m thick,\nbut <10m is more typical. Flow banding in most of the sheet\nis generally contact-parallel, but steep ramps develop in the\n(glassy) upper \u00025–10m within which incipient brecciation\ncan be seen. Where carapaces have been completely\nremoved, lobes (glassy with small columns) are exposed\n(Fig. 8).\nThese carapaces comprise smaller blocks than the upper\nsurfaces of subaerial rhyolites (typically 20–30 cm, Anderson\nand others, 1998) and they are also much thicker (Fink and\nothers, 1992; Fink and Anderson, 2000; Stevenson and\nothers, 1994). They are more akin to the hyaloclastite\ncarapaces of silicic sills described by Hunns and McPhie\n(1999) and Orth and McPhie (2003). This implies that the\nsheets were wetted from above and that brecciation (i.e.\nhyaloclastite formation) was encouraged by water accessing\nupper parts of the flow via downward-propagating tension\ncracks (Stevenson and others, 1994).\nSheet termini\nA number of sheets (both sub horizontal and slope-parallel)\nterminate in steep glassy walls (Fig. 9), with flow banding\nsteepening dramatically towards the vertical over short\ndistances (<50m) and in extreme cases becoming over-\nturned. The tips of downward-propagating tension cracks\nassociated with brecciation are often prominent.\nWe interpret the localized steepening of flow banding at\nsheet termini as ice-contact features, where (ice) resistive\nforces became higher than the forces promoting flow of lava.\nMuch of the entire \u00022 km long termini of the lava sheet\ncomprising the lower tier shows this localized steepening,\nwhich also occurs at some upper tier flows (e.g. at \u00021100m\naltitude on the north flank). Overturning of flow ramps may\nsuggest pinning of the lava sheet’s upper surface to an ice\nroof while ductile flow continued below.\nSheets – summary\nWe consider the sheets to represent sills that intruded ice-\nedifice interfaces (Wilson and Head, 2002), with intrusion of\nthe slope-draping sheets being aided by gravity. Meltwater\nplayed a key role in sheet formation: basal breccias indicate\nboth quenching and explosive mixing, while brecciation at\nflow ramps and upper carapaces indicate sustained wetting\n(and penetration of water) from overlying ice. Steeply\nFig. 7. Upper carapace of sheet showing hyaloclastite formation developing along flow bands, with remnant obsidian selvedges. Thickness\nof main obsidian band in upper left is approximately 3m. Note slope-draping sheet from upper tier on left, with pronounced flow layering.\nFig. 8. Part of a steeply-dipping (\u0002358) segment of the lower tier,\nwhere the upper carapace has been removed to reveal columnar\njointed lobes. These are interpreted as the upper parts of sheets\nwhere they made contact with the base of the overlying ice. Person\nis 1.75m tall.\nMcGarvie and others: Volcano–ice interactions at Prestahnu´kur42\nramped flow termini may indicate that ephemeral gaps\nexisted between the growing edifice and the enclosing ice\n(perhaps aided\/created by meltwater escape).\nVents\nTwo vents have been identified. The first is near the summit\n(upper tier) where a steeply dipping carapace of finely\nvesicular pumice breccia partly encloses microcrystalline\nrhyolite (Fig. 10). This vent fed a \u0002400m long slope-draping\nsheet that travelled to the base of the edifice (Fig. 7). The\nsecond is in the southwest of the southern flank tier where\nagain, a finely-vesicular pumice breccia carapace partly\nsurrounds microcrystalline and lithophysae-rich rhyolite.\nGEOCHEMISTRY AND MINERALOGY\nTo place discussions of ice–volcano interactions in context,\nit should be established whether a glaciovolcanic edifice has\nbeen constructed during just one eruptive event or during\nseveral events separated by substantial time gaps (Werner\nand others, 1996). We use geochemistry and mineralogy to\nestablish this for Prestahnu´kur.\nDetailed studies of Icelandic rhyolites have shown that\neach magma batch possesses a unique geochemical\nsignature (McGarvie, 1985; MacDonald and others, 1990),\nwith rare exceptions being eruptions from zoned magma\nchambers (McGarvie and others, 1990). A robust sampling\nstrategy should therefore analyse samples from three or\nmore eruptive units spanning the duration of the eruption. If\nsamples show near-identical trace element concentrations\/\nratios then the edifice is likely to have been constructed by\nthe eruption of a single magma batch. If differences exist\nthen either the edifice has been constructed by multiple\nmagma batches, or it is monogenetic but produced during a\nzoned eruption.\nAt Prestahnu´kur, six rhyolites were analysed to determine\nthe variability of erupted compositions (Table 1). Major and\ntrace elements show a consistent composition for all six\nrhyolites with very little variability, even for the alkalis\n(Na2O and K2O) which often show greatest variability\n(Baker and Henage, 1977). The rhyolites are sparsely\nporphyritic (<8% crystals, with \u00021–4% being typical).\nLath-shaped and tabular oligoclase feldspars up to 2mm in\nsize dominate, with most being around 1mm although some\nlarger grains reach 4mm. Other phenocrysts occur in\naccessory proportions: clinopyroxene (ferroaugite), fayalitic\nolivine, ilmenite and allanite. All phenocrysts show uniform\ncompositions, while relationships between phenocrysts and\nglassy groundmass (i.e. euhedral phenocrysts showing no\ndisequilibrium textures at their margins) suggest mineral-\nmelt equilibria.\nEssentially, consistent whole-rock, glass and mineral\nchemistry – corroborated by textures indicating no disequi-\nlibrium between mineral and glass phases – indicate that\nPrestahnu´kur was constructed during the eruption of one\nmagma batch over a sufficiently short time span that did not\nallow for chemical and petrological differentiation of the\nmagma feeding the eruption.\nFinally, a striking feature of the rhyolites is their high silica\ncontent, with SiO2 whole-rock contents ranging from\n76.61% to 77.14% (average 76.93%) and glass contents\njust over 78% (Table 1). A scrutiny of published analyses\n(e.g. Walker, 1966; Sigmarsson and others, 1991) suggests\nthat Prestahnu´kur contains the highest silica rhyolites in\nIceland. Such high-silica rhyolites should have higher\nviscosities than lower-silica rhyolites (e.g. Shaw, 1972).\nFig. 10. The partly-eroded summit vent. Microcrystalline rhyolite\nforming the cliff is flanked on the left by a microvesicular carapace.\nSteep flow-banding (interpreted as upward flow) in the vent interior\nshallows to the right (highlighted by dashed curves). Figure (upper\nskyline) is 1.90m tall; the summit cairn at 1226m is immediately to\ntheir left.\nFig. 9. Termini of sub-horizontal sheet at \u00021100m on the north\nflank, interpreted as an ice-contact feature. Flow banding is\nprominent (often picked out by localized lithophysae develop-\nment). Between the uppermost flow bands are incipient hyaloclas-\ntite-breccia zones, which progress in fully developed form to those\nseen in Figure 7. Height of RH cliff edge is \u000245m.\nMcGarvie and others: Volcano–ice interactions at Prestahnu´kur 43\nWATER CONTENTS\nThe dissolved water content in two obsidian samples was\nmeasured using a Thermo Nicolet Fourier transform infrared\nspectrometer (FTIR) at The Open University, UK. The FTIR\nused a liquid N2-cooled MCT-A detector, KBr beamsplitter,\na spot size of 50 mm and the sample chamber was purged\nwith dried air. Five hundred scans were taken between 4000\nand 600 cm–1. The thickness of double-polished sample\nwafers (\u0002100 mm) was measured with a Mitutoyo digital\ndisplacement gauge. The height of the total water absor-\nbance peak at \u00023550 cm–1 was used to calculate water\ncontents using the Beer-Lambert law, a linear baseline\ncorrection and an absorption coefficient for rhyolitic glass of\n78\u00014 Lmol–1 cm–1 (Ihinger and others, 1994). There is\ninsufficient total water in the samples for a significant\nquantity of molecular water to be present and no CO2 peak\nwas detectable. The total water contents of samples PK1\n(lower tier lava flow) and PK7 (summit lava) were found to\nbe 0.10\u00010.01wt% and 0.14\u0001 0.01wt%, respectively. (The\naccumulated errors from uncertainties in measurements and\nthe absorption coefficient are about 10%.)\nAr-Ar DATING\nThree samples of rhyolite from two eruptive units (PK1 and\nPK7) were selected for Ar-Ar dating. Sub-millimetre frag-\nments of glass matrix were hand picked under a binocular\nmicroscope to avoid phenocrysts that may have experienced\na different magmatic history. Each sample was ultrasonically\ncleaned in methanol and de-ionised water before being\nirradiated. Samples and the Alder Creek age standard\n(t ¼ 1.193\u00010.0001Ma; Nomade and others, 2005) were\nirradiated for 0.5 hr in the CLICIT (Cadmium-Lined In-Core\nIrradiation Tube) facility of the TRIGA reactor at Oregon State\nUniversity. The J-value was determined from four aliquots of\nAlder Creek and interspersed among the rhyolite samples to\ngive a weighted mean value of 0.000139\u0001 0.000004.\nNeutron interference corrections were determined from\nCaF2 and K2SO4 included in the irradiation and lie within\nthe errors of values previously determined by the OSU\nreactor (Nomade and others, 2005). Ar was extracted from\nrhyolite samples using 30minute temperature steps at 500,\n1100, 1300 and 15008C in a resistance furnace, with >70%\nof the 39Ar released in the 11008C step. Raw data were\ncorrected for discrimination, radioactive decay and neutron\ninterference. Data from all samples show a good correla-\ntion on a 40Ar\/36A–39Ar\/36Ar isotope correlation diagram\n(Fig. 11). The regression line was determined using the\nmethod of Williamson (1968) leading to an Ar-Ar age of\n84\u000124 ka (1\u0001 error). The mean squared weighted deviation\n(MSWD) value of 0.49 (n ¼ 12) indicates an acceptable\nstatistical correlation with p ¼ 0.90. However, the low\nMSDW suggests the analytical errors may be overestimated.\nBased upon the Y-intercept value of 296.6\u00011.4 in Figure 11,\nthe trapped component is most likely to be atmospheric\nargon. Radiogenic 40Ar only accounts for between 8–21% of\nthe total 40Ar released at 11008C.\nDISCUSSION\nA model for the formation of Prestahnu´kur is proposed and\nice–volcano interactions and climatic implications are\ndiscussed.\nFig. 11. 40Ar \/36Ar–39Ar \/36Ar correlation diagram for Prestahnu´kur\nrhyolite. The regression line indicates mixing between a trapped\nAr component of air 40Ar \/36Ar ¼ X\u0001Y and a radiogenic com-\nponent with 40Ar \/39Ar given by the slope of the regression line of\n89\u0001 24 ka.\nTable 1. XRF major and trace element data for six Prestahnu´kur\nrhyolites. See Stevenson and others (2006) for details of analytical\nmethods, equipment and uncertainties. Glass major element data\nrepresent an average of 37 microprobe analyses of PK4 (note that\nLOI is not determined during probe analysis)\nPK1 PK2 PK3 PK4 PK6 PK7 Glass\nSiO2 77.14 76.80 77.12 77.04 76.85 76.61 78.23\nTiO2 0.12 0.12 0.12 0.12 0.13 0.12 0.10\nAl2O3 12.05 12.17 12.19 12.19 12.16 12.11 12.25\nFe2O3 1.59 1.74 1.74 1.73 1.75 1.73 1.33*\nMnO 0.04 0.05 0.05 0.05 0.05 0.05 0.04\nMgO 0.03 0.03 0.01 0.02 0.02 0.02 0.00\nCaO 0.96 1.05 1.04 1.04 1.05 1.04 0.93\nNa2O 4.29 4.39 4.37 4.41 4.42 4.40 1.19\nK2O 3.41 3.29 3.33 3.28 3.28 3.30 3.31\nP2O5 0.01 0.01 0.01 0.01 0.01 0.01 0.01\nLOI 0.37 0.32 0.33 0.24 0.36 0.36 –\nTotal 100.00 99.97 100.31 100.12 100.08 99.76 97.39\nRb 82 79 79 79 80 79\nSr 68 78 76 76 78 77\nY 98 110 110 109 110 110\nZr 201 259 248 249 256 254\nNb 59 68 66 65 66 66\nBa 623 619 629 620 627 628\nPb 8 8 9 6 8 6\nTh 12 12 13 14 14 13\nU 2 3 4 4 4 4\nSc 2 2 3 1 1 1\nV 3 5 3 4 0 4\nCr 4 4 4 4 4 3\nCo 2 2 2 3 2 2\nNi 2 3 2 3 3 3\nCu 8 7 9 11 9 8\nZn 97 117 115 116 119 116\nGa 21 21 23 21 22 22\nMo 3 4 4 3 3 3\nAs 2 5 1 3 2 0\nS 24 24 23 21 21 20\n*Data represent Fe as FeOtotal.\nMcGarvie and others: Volcano–ice interactions at Prestahnu´kur44\nModel for the formation of Prestahnu´kur\nA 3-stage preliminary model is proposed. Stage 1 involved\neffusion at the ice–bedrock interface. Extensive interactions\nwith meltwater caused quenching and fragmentation of the\nmargins of the magma leading to the formation of lobe-\nbearing hyaloclastite. Significant volumes of hyaloclastite\nhave not been reported from subglacial eruptions of evolved\nmagmas elsewhere, such as the Garibaldi Volcanic Field or\nThe Table (Kelman and others, 2002). In these locations,\neruptions took place on steep topography, which would\nhave promoted drainage of meltwater. However, the pre-\neruption topography at Prestahnu´kur was almost flat. Al-\nthough theoretical calculations suggest that meltwater\ngeneration from eruptions of evolved magmas is insuffi-\nciently rapid to generate water-filled cavities (Ho¨skuldsson\nand Sparks, 1997), the lobe-bearing hyaloclastite can be\nproduced provided that meltwater escape is inefficient and\nthe breccia pile has been left soggy. Magmatically-\nfragmented tephras, which are ubiquitous in basal pedestal\ndeposits at Torfajo¨kull and Kerlingarfjo¨ll rhyolite tuyas\n(Tuffen and others, 2002; Stevenson, 2005) are scarce at\nPrestahnu´kur. This may reflect one or more of lower initial\nvolatile contents, high confining pressure (which implies\nthick ice), high magma viscosity or extensive degassing\nprior to eruption.\nStage 2 involved the formation of the lower tier via sill\nintrusion at the ice-edifice interface. Contact with wet\nsubstrate generated peperite-like sheet bases, while hyalo-\nclastite carapaces indicate flow top wetting (via melting of\noverlying ice).\nStage 3 involved the formation of the upper and southern\ntiers, with the production of single, stacked and slope-\ndraping sheets. Peperite-like bases and hyaloclastite car-\napaces were generated by flow along the edifice-ice\nboundary. On the upper tier at \u00021100m altitude, sheets\non the north and northwest ended at ice walls developing\nsteeply-ramped termini. Explosions and collapses of lava\nbodies generated clasts which were deposited, along with\nreworked carapace material, in localized water bodies.\nThese polymictic breccias demonstrate that meltwater was\nimportant throughout the eruption.\nThe original volatile content of the Prestahnu´kur magma\nis not known. FTIR measurements on obsidians show low\nwater contents of only 0.10–0.14wt%. However, some\nvolatile loss (degassing) is required to generate the thick\npumiceous carapaces on the lava tiers and the vesicular\nclasts in the lobe-hyaloclastite complexes, and so the\noriginal volatile content will have been greater than 0.10–\n0.14wt%. Evidence for volatile-driven fragmentation at\nPrestahnu´kur is however rare, whereas it is abundant at\nthe rhyolite tuyas of Torfajo¨kull and Kerlingarfjo¨ll (Tuffen\nand others, 2002; Stevenson, 2005), where higher volatile\ncontents (determined by FTIR) of up to 0.61wt% have been\nreported (Tuffen, 2001) on edifices of similar vertical extent\nas Prestahnu´kur. Consequently, we suggest that the original\nvolatile content of the Prestahnu´kur rhyolite was probably\n0.2–0.5wt%, which would imply that the magma originally\nhad a lower volatile content than that of other Icelandic\nrhyolite tuyas (Tuffen and others, 2002; Stevenson, 2005).\nEstimating eruption durations depends on the mass\ndischarge rate selected (e.g. Fink and Griffiths, 1998). Low\ndischarge rates have been proposed: 0.5–1.6m3 s–1 at an\nactive dacite lava flow (62.5% SiO2) by Harris and others\n(2004); 0.1m3 s–1 for a submarine-emergent silicic lava\ndome eruption (68–72% SiO2) in 1934–35 by Maeno and\nTaniguchi (2006); and 0.1–10m3 s–1 for the effusive erup-\ntion of the Bla´hnu´kur subglacial rhyolite by Tuffen and\nothers (2001). In contrast, higher discharge rates of 100–\n1000m3 s–1 were proposed by Ho¨skuldsson and Sparks\n(1997) for small-volume fissure-fed rhyolitic eruptions,\nwhile Tuffen and others (2002) argued that rates of 10–\n100m3 s–1 were appropriate for rhyolite tuyas. Using rates\nof 1, 10 and 100m3 s–1 and Prestahnu´kur’s DRE volume of\n0.6 km3 gives eruption durations of 19 years, 2 years and 69\ndays, respectively. We consider an average rate between 1\nand 10m3 s–1 to be reasonable given that Pyle (2000) has\nargued that magma discharge rates are roughly proportional\nto erupted volume, and given the paucity of volatile-driven\nfragmentation at Prestahnu´kur. This duration (2–19 years)\nis broadly consistent with the 3.5–4 year duration of the\nsubaqueous-to-emergent rhyolite eruption of Tuluman\n(Reynolds and others, 1980), and could have allowed\nsubstantial replenishment of melted ice (given rates of\ninward ice flow of 10–5 to 10–6m s–1, Aðalgeirsdo´ttir and\nothers, 2000).\nIce–volcano interactions\nIce-contact features in upper tier sheets at \u00021100m altitude\n(just \u0002120m below the present summit) suggest that ice may\nhave covered the edifice throughout its construction. This\nwould explain the evidence for meltwater interaction at all\nstratigraphic levels. As no significant emergent phase has\nbeen found, Prestahnu´kur could be the product of an entirely\nsubglacial eruption. If this is correct, then as ice cauldron\ndepths of up to 150m have been observed in ice-sheet\nsurfaces above heat sources that are melting basal ice\n(Guðmundsson and others, 2004), and assuming that a\nsimilarly-sized cauldron formed in the ice above Prestahnu´-\nkur, this would imply that the ice was at least 700m thick\nduring the eruption. This is likely to be a minimum thickness,\nas larger cauldrons may form above larger edifices.\nFinally, while more sophisticated models could be\nconstructed that incorporate ice roof collapse, ice wall\nmelt-back and encroachment, heavy snowfall and so on, we\nTable 2. Compilation of data on the interglacial–glacial transition between the Eemian and Weichselian (Lowe and Walker, 1997)\nOI stage\/substage 5e 5d 5c 5b 5a 4\nTerminology Eemian interglacial Lower Weichselian Middle Weichselian\nConditions Warm Cold Warm Cold Warm Cold\nMidpoints 5d to 5a (ended 115 ka) 110 ka 100 ka 91 ka 75 ka (began 70 ka)\nAir T (8C lower) 8–10 6–7 5–7 2–3\nSea level drop 60m 20–25m 50m 20–25m\nMcGarvie and others: Volcano–ice interactions at Prestahnu´kur 45\nbelieve that the present entirely subglacial model provides a\nsufficient and simple explanation for the volcanological\nfeatures we have observed.\nClimatic implications\nTable 2 summarises conditions during the Lower Weichse-\nlian transition between the Eemian interglacial (Oxygen\nIsoptope (OI) substage 5e) and full glacial conditions of OI\nstage 4, while Figure 12 shows relative temperature\nfluctuations from the Eemian to the Holocene. The span of\nthe \u0001 24 ka (1 \u0001) error on Prestahnu´kur’s 89 ka Ar-Ar age\nimplies eruption from 113 ka (substage 5d) to 65 ka in early\nOI stage 4. However, as noted earlier, the low MSWD\nsuggests that analytical errors may be overestimated, so we\nconsider it reasonable to assume that eruption occurred\nduring the actual interglacial–glacial transition (i.e. OI\nsubstages 5d to 5a).\nIn Figure 12, the rapid switching between cold and warm\n(interstadial) conditions over 103–104 years from 5e to 5a is\napparent. Evidence from ice-rafted debris suggests that\nduring cold periods (5d and 5b) the rapid build-up of land\nice (McManus and others, 1994) reached \u000250% of that at\nthe last glacial maximum (18–22 ka), while evidence from\ninterstadial sediments (Lundqvist, 1986) indicates near-\ncomplete deglaciation during warm periods (5c and 5a).\nNote that ambient air temperatures (even during the 5c\nand 5a interstadials) were consistently lower than during\ninterglacial conditions (Table 2).\nIf we assume that Prestahnu´kur was entirely ice-covered\nduring its construction and that it erupted when ice was at a\nmaximum thickness, then this implies eruption when (at a\nconservative estimate) there was >700m of ice in this area at\nthe time. Given this ice thickness, eruption is more likely\nduring a cold substage than during a warm substage, but the\nerror on the Ar-Ar age does not allow us to say whether this\nwas during either cold substage 5d (mid-point 110 ka) or 5b\n(mid-point 91 ka). Nevertheless, the eruption of Prestahnu´-\nkur during this interglacial–glacial transition (when there\nwere rapid fluctuations in temperature) supports models\narguing for very rapid accumulation of land-based ice in\nresponse to global cooling (e.g. Raymo and others, 1998), as\nit can be seen from Figure 12 that the timescales involved\nare \u0002103 years. In conclusion, this is the first time that ice–\nvolcano interactions in combination with Ar-Ar dating has\nprovided a reasonable estimate for ice thicknesses during an\ninterglacial–glacial transition at an Icelandic locality.\nCONCLUSIONS\nPrestahnu´kur is a glaciovolcanic edifice constructed dur-\ning the eruption of a single batch of high-silica rhyolite.\nThe eruption was effusive, and initially produced lobe-\nhyaloclastite breccias followed by a complex sequence of\nlava sheets, interpreted as sills that intruded the edifice-ice\ninterface.\nExposures reveal no evidence for a substantial early phase\nof magmatic (i.e. volatile-driven) fragmentation. It is there-\nfore suggested that the erupting magma had a relatively low\nvolatile content (0.2–0.5wt%), and had an eruption rate of\nbetween 1 and 10m3 s–1, generating an eruption duration of\n2–19 years. Steep ramping of lava flow termini suggests\ncontact with ice barriers, implying ice thicknesses of at least\n450m. The edifice may have been ice-covered throughout\nits construction, implying a minimum ice thickness of\n700m. The age of 89\u0001 24 ka suggests eruption during OI\nstage 5 (possibly one of the cold spikes indicated by\nsubstages 5d or 5b).\nThis supports models that argue for the very rapid\naccumulation of land-based ice even during short-lived cold\nperiods, as both these substages reached their maxima in\nunder \u00029 ka.\nACKNOWLEDGEMENTS\nWe thank J. Watson for assistance with XRF, K. Sharma for\nassistance with FTIR and J. McGarvie for fieldwork support.\nSpecial thanks go to G. I´varsson and M.T. Guðmundsson for\ntransportation in Iceland. D.McG. was supported by The\nOpen University Staff Tutor Research Fund. Finally, we\nwould like to express our sincere thanks to D. Crown and\nS. Anderson for supportive and helpful reviews.\nREFERENCES\nAðalgeirsdo´ttir, G., G.H. Guðmundsson and H. Bjo¨rnsson. 2000.\nThe response of a glacier to a surface disturbance: a case study\non Vatnajo¨kull ice cap, Iceland. Ann. Glaciol., 31, 104–110.\nAnderson, S.W., E.R. Stofan, J.J. Plaut and D.A. Crown. 1998. Block\nsize distributions on silicic lava flow surfaces: implications for\nemplacement conditions. GSA Bulletin, 110(10), 1258–1267.\nBaker, B.H. and L.F. Henage. 1977. Compositional changes during\ncrystallization of some peralkaline silicic lavas of the Kenya rift\nvalley. J. Volcan. Geotherm. Res., 2(1), 17–28.\nCas, R.A.F, R.L. Allen, S.W. Bull, B.A. Clifford and J.V. Wright.\n1990. Subaqueous, rhyolitic dome-top tuff cones: a model based\non the Devonian Bunga Beds, southeastern Australia and a\nmodern analogue. Bull. Volcanol., 52(3), 159–174.\nDeRita, D., G. Giordano and A. Cecili. 2001. A model for\nsubmarine rhyolite dome growth: Ponza Island (central Italy).\nJ. Volcan. Geotherm. Res., 107(4), 221–239.\nFink, J.H. and R.W. Griffiths. 1998. Morphology, eruption rates, and\nrheology of lava domes: Insights from laboratory models.\nJ. Geophys. Res., 103(B1), 527–546.\nFig. 12. Schematic glaciation curve for the last interglacial–glacial\ncycle in Scandinavia. The curve indicates periods of ice accumu-\nlation (to the left) and ice recession (to the right). OI ¼ oxygen\nisotope. After Mangerud (1991).\nMcGarvie and others: Volcano–ice interactions at Prestahnu´kur46\nFink, J.H. and S.W. Anderson. 2000. Lava domes and coulees. In\nSigurdsson,H., B.Houghton,H. Rymer, J. Stix and S.McNutt, eds.\nEncyclopedia of Volcanoes. London, Academic Press, 403–418.\nFink, J.H., S. Anderson and C.R. Manley. 1992. Textural constraints\non effusive silicic volcanism – beyond the permeable foam\nmodel. J. Geophys. Res. - Solid Earth, 97(B6), 9073–9083.\nFollieri, M., D. Magri and L. Sadori. 1989. Pollen stratigraphical\nsynthesis from Valle di Castiglione (Roma). Quat. Int., 3\/4,\n81–84.\nGoto, Y. and N. Tsuchiya. 2004. Morphology and growth style of a\nMiocene submarine dacite lava dome at Atsumi, northeast\nJapan. J. Volcan. Geotherm. Res., 134(4), 255–275.\nGuðmundsson, M.T., F. Sigmundsson, H. Bjo¨rnsson and þ. Ho¨gna-\ndo´ttir. 2004. The 1996 eruption at Gja´lp, Vatnajo¨kull ice cap,\nIceland: efficiency of heat transfer, ice deformation and sub-\nglacial water pressure. Bull. Volcanol., 66(1), 46–65.\nGuiot, J. 1990. Methodology of the last climatic cycle reconstruc-\ntion in France from pollen data. Palaeogeogr., Palaeoclimatol.,\nPalaeoecol., 80(1), 49–69.\nHarris, A.J.L., L.P. Flynn, O. Matias, W.I. Rose and J. Cornejo. 2004.\nThe evolution of an active silicic lava flow field: an ETM+\nperspective. J. Volcan. Geotherm. Res., 135(1–2), 147–168.\nHo¨skuldsson, A. and R.S.J. Sparks. 1997. Thermodynamics and\nfluid dynamics of effusive subglacial eruptions. Bull. Volcanol.,\n59(3), 219–230.\nHunns, S.R. and J. McPhie. 1999. Pumiceous peperite in a\nsubmarine volcanic succession at Mount Chalmers, Queens-\nland, Australia. J. Volcan. Geotherm. Res., 88(4), 239–254.\nIhinger, P.D., R.L. Hervig and P.F. McMillan. 1994. Analytical\nmethods for volatiles in glasses. Reviews in Mineralology and\nGeochemistry, 30(1), 67–121.\nImbrie, J., A.McIntyre and A.Mix. 1989. Oceanic response to orbital\nforcing in the late Quaternary: observational and experimental\nstrategies. In Berger, A., S. Schneider and J.C. Duplessy, eds.\nClimate and Geo-sciences. Boston, Kluwer, 121–165.\nKelman, M.C., J.K. Russel and C.J. Hickson. 2002. Effusive\nintermediate glaciovolcanism in the Garibaldi Volcanic Belt,\nsouthwestern British Columbia, Canada. In Smellie, J.L. and\nM.G. Chapman, eds. Volcano-Ice Interaction on Earth and Mars\n(Geological Society Special Publication, No. 202). London,\nGeological Society of London, 195–211.\nLescinsky, D.T. and J.H. Fink. 2000. Lava and ice interaction at\nstratovolcanoes: use of characteristic features to determine past\nglacial extents and future volcanic hazards. J. Geophys. Res.,\n105(B10), 23,711–23,726.\nLowe, J.J. and M.J.C. Walker. 1997. Reconstructing Quaternary\nEnvironments. Essex, Pearson Education.\nLunqvist, J. 1986. Stratigraphy of the central area of the\nScandinavian glaciation. Quat. Sci. Rev., 5, 251–268.\nMacDonald, R., D.W. McGarvie, H. Pinkerton, R.L. Smith and\nA. Palacz. 1990. Petrogenetic evolution of the Torfajo¨kull\nVolcanic Complex, Iceland I. Relationship between the magma\ntypes. J. Petrol., 31(2), 429–459.\nMcGarvie, D.W. 1985. Volcanology and petrology of mixed\nmagmas and rhyolites from the Torfajo¨kull volcanic complex.\n(PhD Thesis, University of Lancaster.)\nMcGarvie, D.W., R. MacDonald, H. Pinkerton and R.L. Smith.\n1990. Petrogenetic evolution of the Torfajo¨kull Volcanic\nComplex, Iceland II. The role of magma mixing. J. Petrol.,\n31(2), 461–481.\nMcManus, J.F., G.C. Bond, W.S. Broecker, S. Johnsen, L. Labeyrie\nand S. Higgins. 1994. High-resolution climate records from the\nNorth Atlantic during the last interglacial. Nature, 371(6495),\n326–329.\nMaeno, F. and H. Taniguchi. 2006. Silicic lava dome growth in the\n1934–1935 Showa Iwo-jima eruption, Kikai caldera, south of\nKyushu, Japan. Bull. Volcanol., 68(7\/8), 673–688.\nMangerud, J. 1991. The last interglacial\/glacial cycle in Northern\nEurope. In Shane, L.C.K. and E. Cushing, eds. Quaternary\nLandscapes. Minneapolis, University of Minnesota Press, 38–75.\nNomade, S. and 7 others. 2005. Alder Creek sanidine (ACs-2): A\nQuaternary 40Ar \/39Ar dating standard tied to the Cobb Moun-\ntain geomagnetic event. Chemical Geol., 218(3–4), 315–338.\nOrth, K. and J. McPhie. 2003. Textures formed during emplacement\nand cooling of a Palaeoproterozoic, small-volume rhyolitic sill.\nJ. Volcan. Geotherm. Res., 128(4), 341–362.\nPiper, J.D.A. 1973. Volcanic history and tectonics of the North\nLangjo¨kull region, Central Iceland. Can. J. Earth Sci., 10,\n164–179.\nPyle, D.M. 2000. Sizes of volcanic eruptions. In Sigurdsson, H.,\nB. Houghton, H. Rymer, J. Stix and S. McNutt, eds. Encyclopedia\nof Volcanoes. London, Academic Press, 263–269.\nRaymo, M.E., K. Ganley, S. Carter, D.W. Oppo and J. McManus.\n1998. Millennial-scale climate instability during the early\nPleistocene epoch. Nature, 392, 699–702.\nReynolds, M.A, J.G. Best and R.W. Johnson. 1980. Eruption of\nTuluman Volcano: rhyolitic volcanic activity in the northern\nBismarck Sea. Geological Survey of Papua New Guinea\nMemoir, 7.\nSaemundsson, K. 1992. Geology of the Thingvallavatn area. Oikos,\n64, 40–68.\nShaw, H.R. 1972. Viscosities of magmatic silicate liquids; an\nempirical method of prediction. Am. J. Sci., 272, 870–893.\nSigmarsson, O., C. Hemond, M. Condomines, S. Fourcade and\nN. Oskarsson. 1991. Origin of silicic magma in Iceland revealed\nby Th isotopes. Geology, 19(6), 621–624.\nSmellie, J.L. 2000. Subglacial eruptions. In Sigurdsson, H.,\nB. Houghton, H. Rymer, J. Stix and S. McNutt, eds. Encyclopedia\nof Volcanoes. London, Academic Press, 269–285.\nStevenson, J.A. 2005. Volcano-ice interaction at O¨ræfajo¨kull and\nKerlingarfjo¨ll, Iceland. (PhD Thesis, The Open University.)\nStevenson, J.A., D.W. McGarvie, J.L. Smellie and J.S. Gilbert. 2006.\nSubglacial and ice-contact volcanism at the O¨ræfajo¨kull\nstratovolcano, Iceland. Bull. Volcanol., 68(7\/8), 737–752.\nStevenson, R.J., R.M. Briggs and A.P.W. Hodder. 1994. Physical\nvolcanology and emplacement history of the Ben Lomond\nrhyolite lava flow, Taupo Volcanic Centre, New Zealand. NZ J.\nGeol. Geophys., 37(3), 345–358.\nStewart, A.L. and J. McPhie. 2006. Facies architecture and Late\nPliocene – Pleistocene evolution of a felsic volcanic island,\nMilos, Greece. Bull. Volcanol., 68(7\/8), 703–726.\nTuffen, H. 2001. Subglacial rhyolite volcanism at Torfajo¨kull,\nIceland. (PhD Thesis, The Open University.)\nTuffen, H., J. Gilbert and D. McGarvie. 2001. Products of an\neffusive subglacial rhyolite eruption: Bla´hnu´kur, Torfajo¨kull,\nIceland. Bull. Volcanol., 63(2–3), 179–190.\nTuffen, H., D.W. McGarvie, J.S. Gilbert and H. Pinkerton. 2002.\nPhysical volcanology of a subglacial-to-emergent rhyolitic tuya\nat Rauðufossafjo¨ll, Torfajo¨kull, Iceland. In Smellie, J.L. and\nM.G. Chapman, eds. Volcano-Ice Interaction on Earth and Mars\n(Geological Society Special Publication, No. 202). London,\nGeological Society of London, 213–236.\nWalker, G.P.L. 1966. Acid volcanic rocks in Iceland. Bull.\nVolcanol., 29, 375–402.\nWerner, R., H.-U. Schmincke and G.E. Sigvaldason. 1996. A new\nmodel for the evolution of table mountains: volcanological and\npetrological evidence from Herðubreið and Herðubreiðarto¨gl\nvolcanoes (Iceland). Geol. Rundsch., 85(2), 390–397.\nWhite, J.D.L., J. McPhie and I. Skilling. 2000. Peperite: a useful\ngenetic term. Bull. Volcanol., 62(1), 65–66.\nWilliamson, J.H. 1968. Least-squares fitting of a straight line. Can.\nJ. Phys., 46, 1845–1847.\nWilson, L. and I.J.W. Head. 2002. Heat transfer and melting in\nsubglacial basaltic volcanic eruptions: implications for volcanic\ndeposit morphology and meltwater volumes. In Smellie, J.L. and\nM.G. Chapman, eds. Volcano-ice interaction on Earth and Mars.\nLondon, Geological Society, 5–26. (Special publication 202.)\nYamagishi, H. and E. Dimroth. 1987. Studies on the Neogene\nsubaqueous lavas and hyaloclastites in southwest Hokkaido.\nGeological Survey of Hokkaido, 59. 55–117.\nMcGarvie and others: Volcano–ice interactions at Prestahnu´kur 47\n"}