{"doi":"10.1109\/JLT.2006.889670","coreId":"139790","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/4695","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/4695","10.1109\/JLT.2006.889670"],"title":"Multiplexing of Fibre optic long period Grating based interferometric sensors","authors":["Murphy, R. P.","James, Stephen W.","Tatam, Ralph P."],"enrichments":{"references":[{"id":37951552,"title":"Bending sensitivity of in-series long-period gratings,”","authors":[],"date":"1998","doi":"10.1364\/ol.23.001624","raw":"B. H. Lee and J. Nishii, “Bending sensitivity of in-series long-period gratings,” Opt. Lett., vol. 23, no. 20, pp. 1624–1626, Oct. 1998.","cites":null},{"id":37951555,"title":"Cascaded long period gratings with nano-structured coatings,”","authors":[],"date":"2005","doi":"10.1117\/12.624270","raw":"S. W. James, I. Ishaq, G. J. Ashwell, and R. P. Tatam, “Cascaded long period gratings with nano-structured coatings,” Opt. Lett., vol. 30, no. 17, pp. 2197–2199, Sep. 2005.","cites":null},{"id":37951560,"title":"Enhanced sensitivity ﬁbre optic long period grating temperature sensor,” Meas.","authors":[],"date":"2002","doi":"10.1088\/0957-0233\/13\/5\/318","raw":"S. Khaliq, S. W. James, and R. P. Tatam, “Enhanced sensitivity ﬁbre optic long period grating temperature sensor,” Meas. Sci. Technol., vol. 13, no. 5, pp. 792–795, 2002. Richard P. Murphy received the B.Sc. Joint Honours degree in mathematics\/physics and the M.Sc. degree in mathematics from the National University of Ireland, Cork, Ireland, in 2002 and 2003, respectively. He is currently a Research Student with the Engineering Photonics Group, Cranﬁeld University, Cranﬁeld, U.K. His current research interests include the development of sensors based on ﬁber-optic long-period gratings.MURPHY et al.: MULTIPLEXING OF FIBER-OPTIC LONG-PERIOD GRATING-BASED INTERFEROMETRIC SENSORS 829 Stephen W. James received the B.Sc. degree in physics and the M.Sc. degree in applied optics from Imperial College London, London, U.K., in 1987 and 1988, respectively, and the Ph.D. degree from University of Southampton, Southampton, U.K., in 1992. He is currently a Senior Lecturer with the Engineering Photonics Group, Cranﬁeld University, Cranﬁeld, U.K. Since joining Cranﬁeld University in 1993, he has developed interests in a range of optical measurement and sensing techniques, including laser anemometry, speckle interferometry, and optical ﬁber-grating-based sensors. He has published more than 150 papers in journals and conferences. Dr. James is the Editor-in-Chief of Optics and Laser Technology. R a l p hP .T a t a mreceived the B.Sc. degree in physics and chemistry and the D.Sc. degree from the University of Exeter, Exeter, U.K., in 1981, 1986, and 2005, respectively, and the Ph.D. degree in physics from the City of London Polytechnic, London, U.K., in 1986. Following four years at the Physics Laboratory, University of Kent, he moved to Cranﬁeld University, Cranﬁeld, U.K., where he is currently a Professor of engineering photonics with the School of Engineering and heads the Engineering Photonics Group. He has published more than 300 papers and has been involved with numerous national and international conferences. He has been active in optical and optical-ﬁber-based instrumentation and sensing for 20 years. His current research interests include optical ﬂow measurement, speckle interferometry, and optical ﬁber sensors. Prof. Tatam is a Fellow of The International Society for Optical Engineering (SPIE).","cites":null},{"id":37951558,"title":"Fibre modal index measurements based on ﬁbre gratings,”","authors":[],"date":"2001","doi":"10.1080\/014680301750413403","raw":"B. H. Lee, Y.-J. Kim, Y. Chung, W.-T. Han, and U.-C. Paek, “Fibre modal index measurements based on ﬁbre gratings,” Fiber Integr. Opt., vol. 20, no. 5, pp. 443–455, Sep. 2001.","cites":null},{"id":37951554,"title":"Fibre-optic sensing applications of a pair of long-period ﬁbre gratings,”","authors":[],"date":"2001","doi":"10.1088\/0957-0233\/12\/7\/304","raw":"Y. G. Han, B. H. Lee, W. T. Han, U. C. Paek, and Y. Chung, “Fibre-optic sensing applications of a pair of long-period ﬁbre gratings,” Meas. Sci. Technol., vol. 12, no. 7, pp. 778–781, 2001.","cites":null},{"id":37951559,"title":"Fourier-transform method of fringe-pattern analysis for computer-based topography and interferometry,”","authors":[],"date":"1982","doi":"10.1364\/josa.72.000156","raw":"M. Takeda, H. Ina, and S. Kobayashi, “Fourier-transform method of fringe-pattern analysis for computer-based topography and interferometry,” J. Opt. Soc. Amer., vol. 72, no. 1, pp. 156–159, Jan. 1982.","cites":null},{"id":37951556,"title":"Frequency-division multiplexing of optical-ﬁber sensors using a frequency-modulated source,”","authors":[],"date":"1986","doi":"10.1007\/bf02029873","raw":"I. Sakai, “Frequency-division multiplexing of optical-ﬁber sensors using a frequency-modulated source,” Opt. Quantum Electron., vol. 18, no. 4, pp. 279–289, 1986.","cites":null},{"id":37951557,"title":"Multiplexing of optical ﬁber sensors using a frequency-modulated source and gated output,”","authors":[],"date":"1987","doi":"10.1109\/jlt.1987.1075586","raw":"I. Sakai, R. R. Youngquist, and G. Parry, “Multiplexing of optical ﬁber sensors using a frequency-modulated source and gated output,” J. Lightw. Technol., vol. LT-5, no. 7, pp. 932–940, Jul. 1987.","cites":null},{"id":37951549,"title":"Optical ﬁbre long period grating sensors: Characteristics and application,”","authors":[],"date":"2003","doi":"10.1088\/0957-0233\/14\/5\/201","raw":"S. W. James and R. P. Tatam, “Optical ﬁbre long period grating sensors: Characteristics and application,” Meas. Sci. Technol., vol. 14, no. 5, pp. R49–R61, 2003.","cites":null},{"id":37951553,"title":"Study of in ﬁber Mach–Zehnder interferometer based on two spaced 3-dB long period gratings surrounded by a refractive index higher than that of silica,”","authors":[],"date":"2000","doi":"10.1016\/s0030-4018(00)00709-4","raw":"O. Duhem, J. F. Henninot, and M. Douay, “Study of in ﬁber Mach–Zehnder interferometer based on two spaced 3-dB long period gratings surrounded by a refractive index higher than that of silica,” Opt. Commun., vol. 180, no. 4–6, pp. 255–262, Jun. 2000.","cites":null},{"id":37951551,"title":"The interrogation and multiplexing of long period grating curvature sensors using a Bragg grating based, derivative spectroscopy technique,”","authors":[],"date":"2004","doi":"10.1088\/0957-0233\/15\/1\/006","raw":"T. Allsop, T. Earthrowl, R. Reeves, D. J. Webb, and I. Bennion, “The interrogation and multiplexing of long period grating curvature sensors using a Bragg grating based, derivative spectroscopy technique,” Meas. Sci. Technol., vol. 15, no. 1, pp. 44–48, 2004.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-03-01T00:00:00Z","abstract":"Two long-period gratings (LPGs) fabricated in series in an optical fiber form a\nMach-Zehnder interferometer, producing a sinusoidal channelled spectrum within\nthe characteristic LPG attenuation bands, which has the appearance of an\ninterference fringe pattern. The phase of the fringes is sensitive to changes in\nthe surrounding environmental parameters, such as refractive index. Fabrication\nof a number of identical cascaded LPG pairs with different separations produces\nindependent fringe patterns of different frequencies within the attenuation\nbands. The application of basic Fourier techniques to analyze the transmission\nspectrum allows the phase of each fringe pattern to be determined independently,\nfacilitating the differentiation of external effects acting on each\ninterferomete","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139790.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1109\/JLT.2006.889670","pdfHashValue":"0a1db2d8b337b4f40de1c09a2b14c9c9bcf72f9d","publisher":"IEEE Institute of Electrical and Electronics","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/4695<\/identifier><datestamp>2011-05-26T15:54:28Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Multiplexing of Fibre optic long period Grating based interferometric sensors<\/dc:title><dc:creator>Murphy, R. P.<\/dc:creator><dc:creator>James, Stephen W.<\/dc:creator><dc:creator>Tatam, Ralph P.<\/dc:creator><dc:description>Two long-period gratings (LPGs) fabricated in series in an optical fiber form a\nMach-Zehnder interferometer, producing a sinusoidal channelled spectrum within\nthe characteristic LPG attenuation bands, which has the appearance of an\ninterference fringe pattern. The phase of the fringes is sensitive to changes in\nthe surrounding environmental parameters, such as refractive index. Fabrication\nof a number of identical cascaded LPG pairs with different separations produces\nindependent fringe patterns of different frequencies within the attenuation\nbands. The application of basic Fourier techniques to analyze the transmission\nspectrum allows the phase of each fringe pattern to be determined independently,\nfacilitating the differentiation of external effects acting on each\ninterferometer<\/dc:description><dc:publisher>IEEE Institute of Electrical and Electronics<\/dc:publisher><dc:date>2010-12-17T13:36:12Z<\/dc:date><dc:date>2010-12-17T13:36:12Z<\/dc:date><dc:date>2007-03-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>0733-8724<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1109\/JLT.2006.889670<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/4695<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0733-8724","issn:0733-8724"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article"],"fullText":"JOURNAL OF LIGHTWAVE TECHNOLOGY, VOL. 25, NO. 3, MARCH 2007 825\nMultiplexing of Fiber-Optic Long-Period\nGrating-Based Interferometric Sensors\nRichard P. Murphy, Stephen W. James, and Ralph P. Tatam\nAbstract—Two long-period gratings (LPGs) fabricated in series\nin an optical fiber form a Mach–Zehnder interferometer, pro-\nducing a sinusoidal channelled spectrum within the characteristic\nLPG attenuation bands, which has the appearance of an inter-\nference fringe pattern. The phase of the fringes is sensitive to\nchanges in the surrounding environmental parameters, such as\nrefractive index. Fabrication of a number of identical cascaded\nLPG pairs with different separations produces independent fringe\npatterns of different frequencies within the attenuation bands. The\napplication of basic Fourier techniques to analyze the transmission\nspectrum allows the phase of each fringe pattern to be determined\nindependently, facilitating the differentiation of external effects\nacting on each interferometer.\nIndex Terms—Multiplexing, optical-fiber long-period gratings\n(LPGs), sensors.\nI. INTRODUCTION\nO PTICAL-FIBER long-period gratings (LPGs) are thesubject of considerable research interest for use as sensor\nelements. LPGs exhibit sensitivity to environmental parameters\nsuch as strain, temperature, curvature, and refractive index of\nthe surrounding material [1]. A limitation of LPG-based sensor\nsystems is the difficulty associated with multiplexing serial\nsensor arrays. In a recent report, this problem was addressed\nby using the reflection from matched fiber Bragg gratings to\nilluminate an array of two LPGs of different periods. Derivative\nspectroscopy techniques were implemented to facilitate the in-\nterrogation and demultiplexing of the LPG sensors, which were\ndeployed as bend sensors [2]. Here, the multiplexing of a serial\narray of LPG-based Mach–Zehnder interferometers (MZIs) by\nthe application of simple Fourier transform techniques to the\ntransmission spectrum is explored.\nThe formation of an intrinsic MZI by cascading two LPGs\nhas been shown to produce a sinusoidal channelled spectrum\nwithin the attenuation bands that characterize the transmission\nspectrum of an LPG [3], which has the appearance of an\ninterference fringe pattern. Cascaded LPGs have been used to\nsense bending [3], external index of refraction [4], [5], temper-\nature, and transverse load [5]. The influence of nanostructured\ncoatings on the phase of the fringes has been investigated for\nsensing applications [6].\nManuscript received April 20, 2006; revised December 1, 2006. This work\nwas supported by the Engineering and Physical Science Research Council U.K.\nThe authors are with the Engineering Photonics Group, School of Engineer-\ning, Cranfield University, MK43 0AL Cranfield, U.K. (e-mail: r.p.murphy@\ncranfield.ac.uk; s.w.james@cranfield.ac.uk; r.p.tatam@cranfield.ac.uk).\nColor versions of one or more of the figures in this paper are available online\nat http:\/\/ieeexplore.ieee.org.\nDigital Object Identifier 10.1109\/JLT.2006.889670\nThe frequency of the fringes is determined predominantly\nby the separation of the LPGs, while the phase is influenced\nby measureand-induced changes in the effective index of the\ncladding modes. Thus, if an array of cascaded LPG sensors\nwere fabricated, each with a different LPG separation, it would\nbe possible to identify each sensor element from the fre-\nquency of the fringes in the transmitted optical spectrum, while\nthe phase of the fringes would allow the measureand to be\nmonitored.\nThe technique has analogies with the frequency-modulated\ncontinuous wave technique used to multiplex fiber-optic MZIs,\nin which the optical frequency of the source used to illuminate\na serial array of MZIs with different path length imbalances is\nmodulated [7], [8]. This produces a distinct carrier frequency\nfor each MZI, which is dependent on the path length imbalance\nand the frequency excursion of the source. In this paper, the op-\ntical frequency scan is achieved by illuminating the LPG-based\nMZI array using a broadband optical source and monitoring\nthe transmission spectrum using an optical spectrum analyzer.\nAnalyzing the Fourier transform of the transmission spectrum\nallows the carrier frequencies associated with each MZI to be\ndistinguished and the phase to be determined.\nII. PRINCIPLE OF THE TECHNIQUE\nA. Cascaded LPGs\nAn LPG is a periodic modulation of the propagation con-\nstants of the modes of an optical fiber, which is formed by a\nnumber of means, particularly UV-induced modulation of the\nrefractive index of the core of the fiber. The period of the mod-\nulation is typically in the range of 100–1000 µm and facilitates\ncoupling of energy between the propagating mode of the core\nof the fiber and a discreet set of forward-propagating cladding\nmodes. Coupling takes place at wavelengths determined by the\nphase matching condition, which is dependent on the product\nof the difference between the effective indexes of the core and\ncladding modes with the period of the modulation [1]. Thus\nλi =\n(\nneff(λ)− nicl(λ)\n)\nΛ (1)\nwhere neff(λ) is the effective refractive index of the propagating\ncore mode at wavelength λ, nicl(λ) is the refractive index of\nthe ith cladding mode, and Λ is the period of the LPG. The\nhigh attenuation of the cladding modes results in the presence\nwithin the transmission spectrum of a set of attenuation bands\nat the central wavelengths defined by (1). Thus, a single LPG\nintroduces a number of relatively broad spectral features into\n0733-8724\/$25.00 © 2007 IEEE\n826 JOURNAL OF LIGHTWAVE TECHNOLOGY, VOL. 25, NO. 3, MARCH 2007\nFig. 1. (a) Operation of cascaded LPGs as an MZI. (b) Interference fringes in\nthe attenuation bands.\nthe transmission spectrum of the optical fiber, which, when\ncoupled with the large sensitivity of the central wavelength of\nthe attenuation bands to environmental parameters, can limit\nthe practicality of the use of wavelength-division multiplexing\ntechniques for serial arrays of LPG sensors.\nThe fabrication of in-series or cascaded LPGs results in the\nformation of an MZI, producing interference fringes within the\nattenuation bands, as illustrated in Fig. 1. The first LPG acts to\ncouple light to a cladding mode. Light then propagates to the\nsecond LPG via two routes, namely 1) in the core and 2) in\nthe cladding. At the second LPG, the cladding mode is coupled\nback into the core. By virtue of the difference between the\neffective refractive indexes of the core and cladding modes, the\nlight coupled into the core by the second LPG is phase shifted\nwith respect to the light that propagated through the core, giving\nrise to the interference pattern.\nThe transmission spectrum of cascaded LPGs is described\nby [9]\nI = Icore + αIicladd − 2\n√\nαIcoreIicladd\n× cos\n(\n2π\nλ\n(neffcore − nieffcladd)L+Φ\n)\n(2)\nΦ =2 tan−1\n(\n∆β\n2s\ntan sd\n)\n−∆βd (3)\n∆β =\n2π\nλ\n(neffcore − nieffcladd)−\n2π\nλ\n(4)\nwhere Icore and I icladd, and neffcore and nieffcladd, are the inten-\nsities and propagation constants, respectively, of the core and\ncladding modes, α is the attenuation of the cladding mode,\nd is the grating length, L is the separation of the LPGs, and\ns depends on coupling coefficient κ and detuning ∆β, s2 =\nκκ∗ = (∆β\/2)2. The phase of the interference pattern is depen-\nFig. 2. Optical fiber containing four LPGs.\nFig. 3. Fourier transform of the intensity spectrum F (I) of an optical fiber\ncontaining two cascaded LPG pairs of differing separations. Si, i = 1−4 labels\nthe significant frequency components present. The cascaded LPG pairs form\ntwo independent MZIs.\ndent on a phase difference imposed by the LPG Φ and on the\noptical path difference between the core and cladding modes.\nFig. 2 illustrates the proposed multiplexed LPG MZI system.\nTwo or more cascaded LPG pairs are fabricated in a single\nlength of fiber, with each LPG pair having a different physical\nseparation to produce fringes of different frequencies. The\nLPGs all have identical properties, such that the attenuation\nbands overlap. For an individual cascaded LPG pair, the length\nof fiber separating the LPGs has its polymer buffer jacket\nremoved to allow the cladding modes to propagate between\nthe LPGs. Between each LPG pair, the presence of the buffer\njacket ensures that the cladding modes are stripped and that the\ninterferometers are independent.\nB. Signal Processing\nAssuming that the LPGs are identical and have a 3-dB\ncoupling strength and that the attenuation of the cladding\nmodes can be neglected, the resulting intensity pattern can be\ndescribed by\nI = I0(λ)\n(\n1− cos\n(\n2π\nλ\n(\nneffcore − nieffcladd\n)\n1\nL1 +Φ\n)\n×\n(\n1− cos\n(\n2π\nλ\n(neffcore − nieffcladd)2 L2 +Φ\n)))\n(5)\nwhere I0(λ) represents the spectral form of the attenuation\nband envelope, L1 and L2 are the fiber lengths separating LPG\npairs 1 and 2, respectively, and Φ is the phase imposed by\nthe LPGs. The Fourier transform of such an experimentally\nobtained intensity pattern is illustrated in Fig. 3. Four distinct\npeaks are visible on each side of the central DC peak, which is\ntruncated in amplitude in the interest of clarity.\nMURPHY et al.: MULTIPLEXING OF FIBER-OPTIC LONG-PERIOD GRATING-BASED INTERFEROMETRIC SENSORS 827\nThese four peaks represent the four frequencies present in\nthe intensity pattern. Each MZI introduces a unique frequency\nto the spectrum, S1 and S3, respectively, determined by the\nphysical separation of the component LPGs. The sum and dif-\nference frequency components S4 and S2, respectively, are also\npresent. As for all frequency-based interferometer multiplexing\ntechniques, it is important to ensure that the MZI path length\nimbalances are distinct to ensure that the frequency components\ndo not overlap. Furthermore, the MZI path length imbalances\nmust be chosen to ensure that the sum and difference frequency\ncomponents present in the spectrum are not equal to the primary\nfrequencies.\nA change in local environmental parameters will result in a\nconcomitant change in the effective refractive indexes of the\ncore and cladding modes. This will be exhibited as a change in\nthe phase of the interference fringes, which may be determined\nfrom analysis of the Fourier transform of the transmission spec-\ntrum F (I). From the preceding plot, the various frequencies\npresent in the spectrum are known. These frequencies were then\nisolated, and after translation to the origin, the arctangent of the\nratio of the real to imaginary components was used to determine\nthe phase. This process is outlined in [10]. The phase values\nobtained in this way were wrapped modulo 2π, resulting in\ndiscontinuities in the phase, which were then unwrapped using\na simple algorithm.\nC. Experiment and Results\nTo demonstrate the operation of the multiplexing scheme,\ntwo cascaded LPG pairs were fabricated in hydrogen-loaded\nsingle-mode optical fiber with a cutoff wavelength of 820 nm\nvia UV irradiation though an amplitude mask with a period of\n400 µm. For the first LPG pair, the buffer jacket was removed\nover a length of 130 mm, and two 20-mm-long LPGs were\nfabricated with a physical separation of 90 mm, producing the\ntransmission spectrum shown in Fig. 4(a). The second LPG pair\nwas fabricated 1 m further along the fiber, in a stripped section\nof fiber with a length of 60 mm. The LPGs were 20 mm long,\nseparated by 30 mm. The transmission spectra were monitored\nby coupling the output from a tungsten–halogen lamp into the\nfiber and coupling the output of the fiber to a CCD spectrometer\n(Ocean Optics HR4000).\nThe influence of the separation of the LPGs on the frequency\nof the fringes is evident. The low visibility of the fringes in\nFig. 4(a) may be a result of the attenuation of the cladding\nmode over the 90-mm-long fiber separating the LPGs. The\ntransmission spectrum observed upon inscribing two such in-\nterferometers in a single optical fiber is shown in Fig. 5. This\narrangement results in the envelope of the attenuation band\nbeing modulated by two distinct frequencies.\nThirty-millimeter-long sections of the length of fiber sepa-\nrating each LPG pair were immersed within cells containing\nCargille oil with a refractive index of ∼1.46. Each cell was\nmounted on a Peltier thermoelectric heater to independently\ncontrol the temperature of the oil surrounding the fiber sections.\nAs the temperature of the oil was varied, a concomitant change\nin the phase of the corresponding fringe pattern was observed,\narising from the thermal expansion and thermooptic response of\nFig. 4. (a) Transmission spectrum of a cascaded LPG pair with a separation\nof 90 mm. (b) Transmission spectrum of a cascaded LPG pair with a separation\nof 30 mm. The LPGs were 20 mm long, had a period of 400 µm, and were\nfabricated within a hydrogen-loaded single-mode optical fiber with a cutoff\nwavelength of 820 nm.\nFig. 5. Transmission spectrum of an optical fiber containing two cascaded\nLPG pairs, in which the LPGs were separated by 90 and 30 mm, respectively.\nthe fiber and the change in effective index of the cladding mode\ncaused by the thermally induced refractive index change of the\noil. Below ∼40 ◦C, the refractive index of the oil exceeded that\nof the cladding of the fiber, with the result that no fringes were\nobserved in the transmission spectrum. As the temperature was\nincreased beyond 40 ◦C, the negative thermooptic coefficient\nof the oil caused the refractive index to decrease, allowing\nthe cladding mode to propagate to the second LPG and in\n828 JOURNAL OF LIGHTWAVE TECHNOLOGY, VOL. 25, NO. 3, MARCH 2007\nFig. 6. Change of phase of the fringe patterns in response to increasing\nthe temperature of Cargille oil surrounding a 40-mm-long section of the\nfiber separating the LPGs in LPG pair 1 (90-mm separation). \u0001: phase of\nfringes corresponding to LPG pair 1 (90-mm separation). -: phase of fringes\ncorresponding to LPG pair 2 (30-mm separation).\nFig. 7. Change of phase of the fringe patterns in response to increasing\nthe temperature of Cargille oil surrounding a 20-mm-long section of the\nfiber separating the LPGs in LPG pair 2 (20-mm separation). \u0001: phase of\nfringes corresponding to LPG pair 1 (90-mm separation). -: phase of fringes\ncorresponding to LPG pair 2 (20-mm separation).\nturn producing the interference fringes. As the temperature was\nincreased, the phase of the fringes responded to the change in\ntemperature of the length of fiber submersed in the oil and to\nthe change in refractive index of the oil, which modified the\neffective index of the cladding mode. The Fourier transform of\nthe optical spectrum was analyzed to yield the phase change\nof each of the fringe patterns at a specified wavelength in the\nspectrum.\nFigs. 6 and 7 show the change associated with the frequencies\nof the two fringe patterns, determined at a wavelength of\n980 nm, when the lengths of optical fiber immersed in the\noil were heated. In Fig. 6, the temperature of the oil bath\nsurrounding the fiber in LPG pair 1 (90-mm separation) was\nvaried, while the oil bath for LPG pair 2 (30-mm separation)\nwas held constant at 40 ◦C. The fringes were observed to\nsuffer a red-shift, and the phase analysis of the high-frequency\nfringes revealed an 8-rad variation over the temperature range.\nThe drift in the phase of the lower frequency fringes, corre-\nsponding to LPG pair 2, equates to a variation of the tem-\nperature of the oil of ±0.15 ◦C about a mean of 40 ◦C, as\ndetermined from the data shown in Fig. 7. This lies within\nthe temperature stability achieved by the thermoelectric con-\ntroller used.\nThe experiment was repeated, heating the oil surrounding\nthe fiber separating the LPGs in LPG pair 2 while holding the\ntemperature of LPG pair 1 constant at 40 ◦C. In this case, the\nlower frequency fringes corresponding to LPG pair 2 are ob-\nserved to exhibit a significant phase change, while the phase\nof the fringes corresponding to LPG pair 1 show a small drift,\nwhich equates to a variation of ±0.1 ◦C around a mean of\n40 ◦C, as determined from the data shown in Fig. 6. This lies\nwithin the temperature stability achieved by the thermoelectric\ncontroller used.\nIII. CONCLUSION\nThe multiplexing of independent LPG-based MZIs has been\ndemonstrated. The LPG pairs forming the MZIs were fabricated\nwith different separations, producing fringe patterns of different\nfrequencies. Fourier analysis of the transmission spectrum of\nthe system allowed discrimination of the different frequencies\nand measurement of changes in the phase of the fringe patterns\nin response to external stimuli.\nREFERENCES\n[1] S. W. James and R. P. Tatam, “Optical fibre long period grating sen-\nsors: Characteristics and application,” Meas. Sci. Technol., vol. 14, no. 5,\npp. R49–R61, 2003.\n[2] T. Allsop, T. Earthrowl, R. Reeves, D. J. Webb, and I. Bennion, “The\ninterrogation and multiplexing of long period grating curvature sensors\nusing a Bragg grating based, derivative spectroscopy technique,” Meas.\nSci. Technol., vol. 15, no. 1, pp. 44–48, 2004.\n[3] B. H. Lee and J. Nishii, “Bending sensitivity of in-series long-period\ngratings,” Opt. Lett., vol. 23, no. 20, pp. 1624–1626, Oct. 1998.\n[4] O. Duhem, J. F. Henninot, and M. Douay, “Study of in fiber\nMach–Zehnder interferometer based on two spaced 3-dB long period\ngratings surrounded by a refractive index higher than that of silica,” Opt.\nCommun., vol. 180, no. 4–6, pp. 255–262, Jun. 2000.\n[5] Y. G. Han, B. H. Lee, W. T. Han, U. C. Paek, and Y. Chung, “Fibre-optic\nsensing applications of a pair of long-period fibre gratings,” Meas. Sci.\nTechnol., vol. 12, no. 7, pp. 778–781, 2001.\n[6] S. W. James, I. Ishaq, G. J. Ashwell, and R. P. Tatam, “Cascaded long\nperiod gratings with nano-structured coatings,” Opt. Lett., vol. 30, no. 17,\npp. 2197–2199, Sep. 2005.\n[7] I. Sakai, “Frequency-division multiplexing of optical-fiber sensors using\na frequency-modulated source,” Opt. Quantum Electron., vol. 18, no. 4,\npp. 279–289, 1986.\n[8] I. Sakai, R. R. Youngquist, and G. Parry, “Multiplexing of optical fiber\nsensors using a frequency-modulated source and gated output,” J. Lightw.\nTechnol., vol. LT-5, no. 7, pp. 932–940, Jul. 1987.\n[9] B. H. Lee, Y.-J. Kim, Y. Chung, W.-T. Han, and U.-C. Paek, “Fibre modal\nindex measurements based on fibre gratings,” Fiber Integr. Opt., vol. 20,\nno. 5, pp. 443–455, Sep. 2001.\n[10] M. Takeda, H. Ina, and S. Kobayashi, “Fourier-transform method of\nfringe-pattern analysis for computer-based topography and interferome-\ntry,” J. Opt. Soc. Amer., vol. 72, no. 1, pp. 156–159, Jan. 1982.\n[11] S. Khaliq, S. W. James, and R. P. Tatam, “Enhanced sensitivity fibre optic\nlong period grating temperature sensor,” Meas. Sci. Technol., vol. 13,\nno. 5, pp. 792–795, 2002.\nRichard P. Murphy received the B.Sc. Joint Honours degree in mathemat-\nics\/physics and the M.Sc. degree in mathematics from the National University\nof Ireland, Cork, Ireland, in 2002 and 2003, respectively.\nHe is currently a Research Student with the Engineering Photonics Group,\nCranfield University, Cranfield, U.K. His current research interests include the\ndevelopment of sensors based on fiber-optic long-period gratings.\nMURPHY et al.: MULTIPLEXING OF FIBER-OPTIC LONG-PERIOD GRATING-BASED INTERFEROMETRIC SENSORS 829\nStephen W. James received the B.Sc. degree in physics and the M.Sc. degree\nin applied optics from Imperial College London, London, U.K., in 1987 and\n1988, respectively, and the Ph.D. degree from University of Southampton,\nSouthampton, U.K., in 1992.\nHe is currently a Senior Lecturer with the Engineering Photonics Group,\nCranfield University, Cranfield, U.K. Since joining Cranfield University in\n1993, he has developed interests in a range of optical measurement and sensing\ntechniques, including laser anemometry, speckle interferometry, and optical\nfiber-grating-based sensors. He has published more than 150 papers in journals\nand conferences.\nDr. James is the Editor-in-Chief of Optics and Laser Technology.\nRalph P. Tatam received the B.Sc. degree in physics and chemistry and the\nD.Sc. degree from the University of Exeter, Exeter, U.K., in 1981, 1986, and\n2005, respectively, and the Ph.D. degree in physics from the City of London\nPolytechnic, London, U.K., in 1986.\nFollowing four years at the Physics Laboratory, University of Kent, he moved\nto Cranfield University, Cranfield, U.K., where he is currently a Professor of\nengineering photonics with the School of Engineering and heads the Engi-\nneering Photonics Group. He has published more than 300 papers and has\nbeen involved with numerous national and international conferences. He has\nbeen active in optical and optical-fiber-based instrumentation and sensing for\n20 years. His current research interests include optical flow measurement,\nspeckle interferometry, and optical fiber sensors.\nProf. Tatam is a Fellow of The International Society for Optical Engineering\n(SPIE).\n"}