{"doi":"10.1111\/j.1468-5965.2010.02084.x","coreId":"215471","oai":"oai:eprints.lse.ac.uk:29268","identifiers":["oai:eprints.lse.ac.uk:29268","10.1111\/j.1468-5965.2010.02084.x"],"title":"Europe in the political imagination","authors":["White, Jonathan"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-09","abstract":"Perceptions of the EU tend to be studied by examining responses to targeted opinion polls. This paper looks instead at how citizens draw Europe into a wider discussion of politics and political problems. Based on a series of group discussions with taxi-drivers in Britain, Germany and the Czech Republic, it examines the motifs speakers use to explain the origins of problems, the assumptions they make about their susceptibility to address, and how, when these patterned ways of speaking are applied to the EU, they serve to undermine its credibility as a positive source of political agency","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/215471.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/29268\/1\/White%20_Europe%20in%20the%20political%20imagination.pdf","pdfHashValue":"9eae040406d9b0355944837188d6377cad0e88f1","publisher":"Wiley-Blackwell in association with UACES, the University Association for Contemporary European Studies","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:29268<\/identifier><datestamp>\n      2017-05-04T09:35:19Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4555<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/29268\/<\/dc:relation><dc:title>\n        Europe in the political imagination<\/dc:title><dc:creator>\n        White, Jonathan<\/dc:creator><dc:subject>\n        JZ International relations<\/dc:subject><dc:subject>\n        JA Political science (General)<\/dc:subject><dc:description>\n        Perceptions of the EU tend to be studied by examining responses to targeted opinion polls. This paper looks instead at how citizens draw Europe into a wider discussion of politics and political problems. Based on a series of group discussions with taxi-drivers in Britain, Germany and the Czech Republic, it examines the motifs speakers use to explain the origins of problems, the assumptions they make about their susceptibility to address, and how, when these patterned ways of speaking are applied to the EU, they serve to undermine its credibility as a positive source of political agency.<\/dc:description><dc:publisher>\n        Wiley-Blackwell in association with UACES, the University Association for Contemporary European Studies<\/dc:publisher><dc:date>\n        2010-09<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/29268\/1\/White%20_Europe%20in%20the%20political%20imagination.pdf<\/dc:identifier><dc:identifier>\n          White, Jonathan  (2010) Europe in the political imagination.  Journal of Common Market Studies, 48 (4).  pp. 1015-1038.  ISSN 1468-5965     <\/dc:identifier><dc:relation>\n        http:\/\/onlinelibrary.wiley.com\/journal\/10.1111\/(ISSN)1468-5965<\/dc:relation><dc:relation>\n        10.1111\/j.1468-5965.2010.02084.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/29268\/","http:\/\/onlinelibrary.wiley.com\/journal\/10.1111\/(ISSN)1468-5965","10.1111\/j.1468-5965.2010.02084.x"],"year":2010,"topics":["JZ International relations","JA Political science (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nJonathan White  \nEurope in the political imagination \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: White, Jonathan (2010) Europe in the political imagination. Journal of \nCommon Market Studies, 48 (4). pp. 1015-1038. ISSN 1468-5965  \n \nDOI: 10.1111\/j.1468-5965.2010.02084.x \n \n© 2010 John Wiley & Sons \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/29268\/ \nAvailable in LSE Research Online: February 2016 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \n 1 \nEurope in the Political Imagination \n \nJonathan White, LSE\n1\n \n \nWhite, Jonathan (2010), ‘Europe in the political imagination’, Journal of Common \nMarket Studies, 48 (4). 1015-1038. ISSN 1468-5965 \n \n \n‘The idea was to build up the markets there.  That was the point of the thing I think, the enlargement of the EU – \nPoland, Czech Republic, Slovenia etc. – to build up new markets there, so that the people there can also, how \nshould I say, boost the economy here, so they can buy the products which are produced here.  It was already noted \neven back then – I can remember – in the political discussion that things would turn out as they have now, with \nthis migration [of companies] to the East.  It was known even then, when all this was opened up.  It was done \nanyway though, and now … you asked earlier what can be done about it, it sounds very hard and sad when I say \nit, but actually nothing.  It has its own dynamic, the door has been opened and now it’s open!  You can’t close it \nany more.’   \nRalf, taxi-driver, Würzburg (Germany) \n \n \nIn normative debates on the European Union, the argument is sometimes made that the allegiance of \ncitizens to a transnational polity should be based on the opportunities it provides for promoting \npolitical goals.  Rather than locating community in some ‘sense of Europeanness’, centred on facts or \nperceptions of cultural commonality, or a supposed identity of constitutional values, this view holds \nthat the collective bond should be that of a ‘community of projects’ (Nicolaidis 2004, p.103); also \n(Morgan 2005).  Such a view need by no means imply a technocratic understanding of the polity – \nplenty of scope may be afforded for deliberation and dispute concerning the goals to be pursued and \nthe policies appropriate to them – but the suggestion is that citizens should regard the polity as \nsomething that responds to substantive concerns rather than something expressive of a unity of \nattributes or beliefs.   \n This paper presupposes there are good reasons for adopting this perspective on EU citizenship, \nbut does not seek to engage directly in this normative debate.  Rather it explores how far there exists \nthe ideational background necessary for such a perspective to resonate with EU citizens.  At a general \nlevel, it proposes that only if such a perspective sits well with existing understandings of what may be \nachieved politically, or if these are adapted to accord with it, is it likely to achieve plausibility amongst \na wider population.  Empirically, the paper examines some of the recurrent motifs of political \n                                                 \n1\n The paper was much improved by comments received at workshops in Sussex, Riga, Bremen and Paris.  Particular thanks \nto Volker Balli, Thomas Christiansen, Sophie Duchesne, Niilo Kauppi, Michèle Lamont, Herwig Reiter, Stefan Seidendorf, \nPeter Wagner, Cornelia Woll, Lea Ypi and the Journal’s referees.  The piece was finalised during a research fellowship at \nthe Humboldt-Universität zu Berlin funded by the Alexander von Humboldt Stiftung. \n 2 \nunderstanding voiced by a series of EU citizens in interaction, and how these relate to the political \nsignificance they ascribe to the EU. \n A project-oriented conception of the EU would seem to demand that citizens regard decision-\nmaking at a European level as appropriate to tackling at least some of the political problems they \nconsider important.  For these, Europe-wide measures would have to make sense in principle, even if \nthe EU in its current form were thought deficient.  One can rephrase this as a two-step requirement.  \nFirst, citizens would need to assume that the problems of significance to them are susceptible to some \nkind of organised address, whether centred on governmental institutions or collective action with other \ncitizens, and that they are not simply unavoidable ‘facts of life’, or issues that can be sufficiently dealt \nwith by individual adaptation alone.  Second, for at least some such problems there would need to be \nthe conviction that it is both feasible and necessary for them to be tackled at a European level, rather \nthan in a context more local or more global.\n2\n \n The study presented here looks at the perspectives expressed in a series of group discussions \nwith taxi-drivers in Britain, Germany and the Czech Republic.  It examines how speakers talk about \nthe political problems of significance to them, notably their origins and susceptibility to remedy, and \nthe ways they evoke, or choose not to, the relevance of the EU.  Important variations across issue-area \nare highlighted using the empirically-derived categories of Economics, Relations between Peoples, and \nSociety and the Law.  The paper shows how the way problems tend to be explained, combined with \nexpectations concerning their susceptibility to address, generally forecloses common action at the \nEuropean level as a convincing proposition.  Rather than contributing to the EU’s political credibility, \nthese patterns of understanding invite it to be seen as largely irrelevant to certain sets of problem, \nwhile powerless to control, and indeed liable to exacerbate, others.  The paper thus develops a \nvariegated picture of how far, and in what ways, ‘Europe’ and the EU are spontaneously invoked as \nreference-points when citizens make sense of their everyday circumstances (Meinhof 2004).   \n Such an approach differs sharply from quantitative studies in this area.  When polls are used to \nprobe views on the EU, the goal is to identify positive or negative attitudes towards a clearly defined \n                                                 \n2\n Other potentially relevant dispositions include willingness to regard citizens elsewhere in the EU as sufficiently like-\nminded to be partners in pursuit of these goals, and decision-makers sufficiently trustworthy to act on ‘our’ behalf.  These \nare beyond this paper, though cf. (White 2010a) and (White 2010b). \n 3 \nobject, whether European integration as a whole, its constituent policies, or the citizens of other \nmember-states (Kohli 2000) (Hooghe & Marks 2007) (Duchesne 2008).  Political community is \nconceived in terms of citizens’ willingness to express explicit support or affective engagement.  \nConversely, studying interventions in a conversational setting, one can refocus attention on the \nassembly of reference-points people take for granted and the underlying repertoires of interpretation \nthat structure (or inhibit) the formation of attitudes – on the ‘political imagination’, as it may \nconveniently be described.\n3\n  One can examine, for example, not just whether speakers consider EU \nenlargement good or bad, but the sense in which they consider it, like Ralf in the extract cited, almost \ninevitable, something with ‘its own dynamic’ scarcely responsive to political deliberation.  Drawing \non political-sociological approaches rarely applied in the EU context (Gamson 1992; Perrin 2006), the \npaper investigates how the EU is conjured in the patterns of everyday political talk.   \n \n \nWhy Talk to Taxi-Drivers? \n \nIf taxi-drivers are worth speaking to, perhaps the reader will assume this is because their views are \nheld representative of a social group of particular significance.  Such an argument can certainly be \nmade: the majority of taxi-drivers in EU members-states occupy the socio-economic space extending, \non a conventional stratification scale, from the working- to the lower-middle classes, and while \ntheories of mobilisation weigh their significance differently (Eder 1995), such classes and their \npolitical dispositions are from many perspectives important.  But there is no need thus to suppose \neither that taxi-drivers across the EU form a coherent social group, or that they themselves are actors \nof special consequence.  A better argument centres on the kinds of experience taxi-driving exposes its \npractitioners to: on the one hand they are in a position of heightened sensitivity to political \ndevelopments such as changes in prices or spending behaviour, criminal activity, or the arrival of \nimmigrant labour, while on the other they are exposed to a wide range of opinion stimuli – \nnewspapers, radio, conversations with clients – ensuring theirs is not an isolated speech community.  \nFurthermore, the self-understanding (Brubaker & Cooper 2000) of many taxi-drivers is arguably as \n                                                 \n3\n The term is metaphorical, since we are dealing with trans-individual patterns of meaning rather than private cognition.  \n 4 \npeople of commonsense; whereas academics or artists may set store by originality, taxi-drivers seem \nless inclined to emphasise the distinctiveness of their views.  Furthermore, their daily experiences do \nnot invite unusually strong sympathy or antipathy towards the EU.  There is therefore reason to \nsuppose that – alongside certain idiosyncratic concerns peculiar to taxi-drivers – one may find in their \ndiscussion, in a particularly concentrated form, some of the tacit assumptions and interpretative motifs \ndispersed more widely amongst citizens.\n4\n  \nFor this research, conducted between October 2004 and August 2005, groups of three to four \ndrivers were assembled for two-hour discussions in ten mid-sized European cities – Reading, Swansea \nand Norwich in Britain; Plzeň, Liberec and Ostrava in the Czech Republic; and Erfurt, Lübeck, Kassel \nand Würzburg in Germany.\n5\n  These cities exhibit geographical spread and historical diversity, notably \nregarding the consolidation of democracy and the experience of foreign rule, yet continuity in the \ncharacter of taxi-driving: it tends to be a full-time occupation, involving long-term residents rather \nthan recent arrivals.  The study’s aim was to identify patterns of discursive practice widely present \nacross the different sites, together with some of the salient variations between them.  Using group \ndiscussions allowed the researcher to minimise his interventions so as to study the kinds of knowledge \nand understanding participants expect of each other (Duchesne & Haegel 2007) (Gamson 1992).   \nThe discussions were loosely structured.  Approximately the first twenty minutes involved a \ncategorisation exercise, designed to provoke a discussion in which one could study the importance \nspeakers attributed to various political problems, how these were assumed to fit together, and the \nconcepts used to link them.  Participants were invited to cluster a series of thematic index-cards \naccording to ‘what goes naturally with what’, justifying their choices as they did so, and then to \ndiscuss how best to summarise each grouping with a heading.\n6\n  The researcher probed where \nnecessary to encourage speakers to clarify their criteria of categorisation, recording the new headings \n                                                 \n4\n How these may be found in differing proportions across different social groupings is not the focus here, but is explored in \nan ongoing project on ‘Citizens Talking about Europe’ (CITES) in Britain, France and Belgium – cf. ‘Conference on \nEuropean Citizenship Revisited’, Oxford University, 23rd June 2008. \n5\n There were 37 participants in total.  Those in each group were generally acquaintances, and often in conversation when \napproached. \n6\n Seventeen cards designed by the author were used, each consisting of two images and a verbal caption as follows: Peace \n& War, Treatment of Outsiders, Overseas Aid, Medical Care, Education & Training, The Legal System, Policing, Health & \nSafety Standards, The Environment, Science & Research, Transport, Money & Prices, Purchase of Property, Markets & \nProduction, Taxation, Corruption, and Work.  Participants were invited to create supplementary cards where necessary, but \nthis option was not pursued.  For further details, see (White 2009a).   \n 5 \non additional cards, and noting disagreements where they arose.  This then fed into an open discussion \nled principally by the participants themselves, during which they selected certain problem-areas to \nexplore in depth according to those considered most pressing.  The card arrangements from the \npreceding exercise, which remained on the table, acted as a form of topic guide, allowing a basic level \nof thematic order to be sustained and a diversity of topics to be discussed, while still respecting \nspeakers’ inclination to focus on some topics over others and to explore cross-cutting themes.  In this \nopen phase, the researcher intervened occasionally to bring participants into discussion, to ask \nspeakers to elaborate with examples, and to ask questions to do with causality and political agency of \nthe kind described below.\n7\n  Importantly, no attempt was made to draw conversation towards the EU or \n‘things European’ until the discussions were near conclusion.   \nAllowing participants to determine the categories by which the discussions were ordered \nserved a purpose in the subsequent analysis: it allowed the researcher to choose an analytical scheme \nwith an empirical basis in the texts.  While no two groups produced the exact same ordering criteria, \nand the analyst is inevitably an active interpreter, one can arrive at a series of thematic headings \nreflecting the topics discussed in greatest detail across the interviews and the ways these tended to be \nclustered in the exercise and open discussion.  Three headings are used in the following analysis: \nEconomics (understood to include, amongst others, problems of (un)employment, wages, price rises, \ntaxation, inequality, and social security), Relations between Peoples (encompassing problems of \nintergroup conflict within and between states – often linked by speakers – and problems concerning \nthe unwanted encounter with those deemed culturally different), and Society and the Law (including \nmatters of crime, corruption, policing, the judicial system, social misdemeanour, and schooling).\n8\n  In \nformulating these headings, and selecting material for citation, special attention has been paid to the \nway speakers interacted and chose to acknowledge and pursue (or not) the interventions of others.  \nFollowing (Gamson 1992), passages in which multiple participants were active and mutually \n                                                 \n7\n The researcher also made probes unrelated to this paper: ‘who is affected by such problems?’, or ‘does anyone gain from \nthat?’, were asked to enable study of the evocation of social groupings.  Additionally, participants were asked about media \nconsumption – not a topic relevant to this project, but a useful means to disguise the research focus. \n8\n The concerns raised in these interviews broadly correspond to those identified in a large-scale coterminous study of the \nEU-25 populations (OPTEM 2006, pp.7-8).  The list above is not exhaustive of the topics discussed – other problems, e.g. \nenvironmental, were occasionally mentioned – but represents the core of those articulated and developed throughout the \ndiscussions.  Note that the fact certain topic-cards were widely neglected in discussion – e.g. ‘Science & Research’ – \nsuggests that, while the cards were useful aids, they did not predetermine the discussions’ content.  For more on the \nelaboration of the analytical categories, see (White 2009a). \n 6 \nresponsive are preferred to those where one speaker dominated and where evidence of reciprocal \nunderstanding is thus lacking.\n9\n  Taking these three headings as the units of study, the analysis focuses \non the explanations speakers invoke when discussing these problems, the expectations they express \nconcerning political agency, and, in the section thereafter, the ways these motifs are deployed when \nconversation touches on European integration.  \n \n \nExplanatory Motifs and Expectations of Agency \n \n‘Explanation’ can be conceptualised in multiple ways (Antaki 1988).10  From the logician’s \nperspective, it may mean reported causality: explanations involve the explicit giving of reasons for the \nemergence of a problematic situation.  As a feature of everyday talk, where points may be made \nincrementally by multiple speakers, a looser definition is needed.  Indeed, even in the purest cases, a \ngood portion of explanation lies not in explicit reason-giving but semantic meaning and assumptions \nof relevance.  There is a sense in which one may hear almost any utterance as explanatory depending \non its context and the questions one asks of it (Draper 1988, p.16) (Antaki 1994 p.4).  We shall focus \non patterns in what is deemed relevant to understanding a given set of problems.  These explanatory \nmotifs may be thought of as culturally-available interpretative resources, employed by speakers to \nmake sense of situations and experiences (Lamont & Thévenot 2000; Swidler 2001; White 2009b)  \nThey appeared spontaneously as speakers articulated and discussed the problems under consideration, \nbut were also elicited by the researcher.  Direct questions, such as ‘how do you explain that problem?’ \nor ‘why does it arise?’, were combined with indirect ones exploring the attribution of responsibility \nand blame.  Such questions are ambiguous on the criteria of what is relevant, and so – given no \nresponse can include all possibly significant factors – force participants to exercise discrimination. \nExpectations of agency were likewise embedded in the flow of discussion, but were further \nelicited using probes such as ‘can that problem be avoided?’ and ‘can something be done about it?’  \n                                                 \n9\n Such an approach does not exclude intra-group disagreement, which may be abundant at the level of explicit opinion.  \nHowever, its enabling condition is a basic level of agreement concerning how to thematise reality, else conversations fail.  \nConcerning inter-group disagreement, the Norwich and Ostrava groups diverged from this thematic scheme in the card \nexercise, categorising according to how local or global they deemed issues to be, but the structure of their open discussions \nwas quite compatible. \n10\n This article is informed by discursive approaches, but cf. ‘attribution theory’ in social psychology (Hewstone 1996).  \n 7 \nWhere the possibility of action was affirmed or denied, of interest would be the agents mentioned; \nfurther probes examined the expectations associated with these.  A useful sensitising framework is \nPerrin’s threefold distinction between expectations of agency centred on government, the general \npublic, and the private individual (Perrin 2006, pp.63-4; pp.116ff).  The first involves the expectation \nthat government officials can adopt policies to tackle the problems in question, and may be judged \naccording to their willingness and success in pursuing these.  The second involves society-focused \ncollective action such as the formation of social movements, the organising of boycotts, or the use of \nmedia to communicate to a wider public.  Both such approaches entail organised collective action, and \noffer a potential rationale for the polity as either the apparatus by which desired ends are sought or the \nspace in which groups of citizens may coordinate for common purpose.  Conversely, a private \napproach involves moves to avoid problems rather than a coordinated effort to resolve them.  This last \nperspective, which supposes certain concerns can be addressed only by individual adaptation, offers \nfew resources for making sense of a polity in terms of the pursuit of political projects.   \n Let us then move to the empirical material, looking at the explanatory motifs and expectations \nof agency identifiable for each of Economics, Relations between Peoples, and Society and the Law.  \n \n \nEconomics \n \nOne of the first notable things about problems to do with Economics is that many of them elude \nexplanation.  They form a large proportion of the discussions, and are discussed with urgency, but also \nwith a certain mystery concerning their origins.  Dean in Swansea is not atypical when expressing \namazement at how ‘the purchase of a house can go from … £50,000 to £200,000 in two years.  It’s \nludicrous … more debt, more stress, more everything …  [Author:  Why are the prices going up so \nmuch do you think?]  Why has it gone up? … I don’t know, I can’t answer that.  […] Whether it’ll \nstart coming down I don’t know. […] But you know, everything’s got to come to a head hasn’t it.’  \nWith similar uncertainty, when the Norwich group reports long-overdue improvements in the local \neconomy, these are accounted for on the grounds that luck inevitably changes.  Vagueness on the \ncauses of economic change need not produce the fatalist assertion they are beyond control – one can \n 8 \nimagine the view ‘it’s not our business to know, but someone in power ought to’ – but it seems \nprobable that a lack of explanatory resources undermines the capacity to identify forms of political \naction able to influence such mechanisms and the inclination to associate these with public policy \n(Gamson 1992, p.6).  Absent certain basic tools of understanding, citizens would need to fall back on a \nstrong and uncritical faith in the superior vision of political elites. \nWhile explanations are often thin on the ground for Economics, they are certainly not absent.  \nImportantly – the second point to emphasise – where present they tend to be broad and transnational, \nindeed global, in scope.  They evoke factors extending far beyond the local environment where \nproblems are encountered, and often considerably beyond Europe.  A passage from Reading brings \nthis out, with participants building on each others’ points:11 \n \nMalik:  …  England for example is not a manufacturing country any more.  Hi-tech, yes, but like the old \nstuff, it’s moved away from that into these lovely nice business parks and things and everybody’s in a \nnice suit and everything …  Everything’s changing, and you have to like sort-of [change with it]… If \nyou say ‘I’m a rag-n-bone man, I want to stay a rag-n-bone man’, you can’t be because rag-n-bone \nman’s out the window.  Same like with the guy that used to have the horse and cart and drives the coal \n…  You know, it’s all changing, so you have to change with the time. \n \nHanif:  There used to be a Huntley-Palmer factory [in Reading] …  They made biscuits …  \n \nMalik:  Huntley-Palmers, yeah […] Also for example now, right, like with the new one, Prudential, right, \nthey’ve taken their call centres over to India.  Why?  Because it’s cheaper.  Same with manufacturing.  \nI mean, if I had a factory and I was paying … \n \nSaeed:  So, like, hang on, they pay the work to the Indians … so it’s less work in England then, isn’t it? \n \nDerek:  ’Course, yeah … but the economy for that company Prudential … they’re having a laugh … \n \nAs Malik then summarises, ‘they pay pittance over there and we want minimum £10 an hour.’  The \nworld of cheaper wages further east, whether in Eastern Europe or Asia, is a common motif across the \ngroups when problems such as unemployment or the decline of industry are discussed.   \nThe fact that explanatory factors are remote, where given, is probably an important reason why \nthe possibilities for governmental agency are assumed limited.  The drivers of change lie principally \n‘over there’, leaving few options for influence ‘here’.  Inevitability is a common theme, and cost \nimbalances are held decisive: ‘it’s supply and demand,’ says Malik, ‘… unless you start paying \neverybody 10p an hour for their jobs, you can’t compete with other countries now.’  A consensus in \n                                                 \n11\n This passage appears 35 mins into the interview (15 mins into the open discussion).  It follows discussion of the social \nsecurity system and the availability of work, and marks the beginning of a lengthy discussion on changing economic \nconditions in Britain, western Europe and east Asia.   \n 9 \nthe Würzburg group is that politicians are ‘puppets’ when it comes to the economy.  Another motif \nholds that while yesterday’s politicians had opportunities to act decisively, e.g. by rejecting \nprivatisation, today’s are powerless and it is too late to alter things.  Speakers in Kassel emphasise the \ngovernment is unable to control the movement of manufacturers: ‘That doesn’t work any more,’ says \nPeter; ‘it’s simply too late …’, says Hans; ‘in the past … in the past,’ chips in Dieter, ‘we’ve got no \nchance now.  The train has left the station.’  While viable in the past, governmental action today is \nimplausible.  To these widely diffused patterns one may add local variations: speakers in the Czech \ngroups emphasise the dependence of economic conditions in their country on the health of \nneighbouring economies such as Germany’s,12 while the Czech state’s weak finances are further said \nto undermine its capacity to alleviate hardship.  Such concerns intensify the sense of powerlessness \nfound more widely across the groups.  \n Positive proposals are occasionally heard.  Some speakers suggest individuals should adapt to \nnew economic circumstances by learning new skills (cf. Malik above) – a private response, in other \nwords – though rarely is it suggested this would be sufficient.  Individual consumer action against \ndeparting firms is also occasionally advocated, yet considered hindered by the way economic \nprocesses extend far afield.  Peter in Kassel notes a limit to what consumers can do: ‘if I had an \naccount with Deutsche Bank, I’d cancel it.  I’d boycott such firms.  The thing is, everything’s so \ninterwoven these days, you don’t really know … [Dieter: yeah] … where they all work, where they \nproduce …  Whatever you do, the glasses will come from somewhere, you can’t say “I’m not drinking \nthat any more because the glass doesn’t come from Germany.”  That’s the problem, because ultimately \nyou simply can’t separate it out.’  Not only this but organised action of a public kind, such as a \ncollective boycott, is cast in doubt with scepticism regarding the firmness of other citizens.  Even if \npeople like ‘us’ were to take the initiative, the danger is the rest would not follow.   \n In sum, the dominant pattern across the groups holds there are few possibilities for action on \nproblems of Economics.  With these treated either as a matter of puzzlement, or seen as heavily \ndependent on distant processes, the prospect of organised collective action, governmental or public, is \n                                                 \n12\n A similar sense of dependence is identifiable in the Erfurt group (i.e. that in the former East Germany), with a sense of \ngovernmental agency little stronger. \n 10 \nconsidered heavily circumscribed.  Speakers generally invoke ‘the government’, ‘politicians’ or ‘the \nstate’ as the most relevant reference-points, but regularly to write off their capacities.   \n \n \nRelations between Peoples \n \nDescriptions of problems to do with intergroup conflict and the unwanted encounter with cultural \ndifference are not immune from a sense of mystery.  Peter in Kassel is not the only participant to fear \nwar ultimately as arbitrary: ‘all you need is for someone who’s a bit hysterical to come to power and \nsomeday he presses the [nuclear] button.’  But aside from assertions of contingency one does find \nexplanatory motifs, the difficulty being that not only are some rather disturbing, but they encourage \nthe problems articulated to be regarded as unsolvable. \n Two sets of motif recur, both primarily externalising responsibility for bad relations onto \nothers.  One points to the unequal global distribution of power and resources, causing conflict as those \nin a position of inferiority seek gains.  That ‘it’s all about power’ is a common refrain.  Another set, \nperhaps more common, focuses on ‘other peoples’ expressing supposedly intrinsic characteristics, be it \nextremism, intransigence, or an undue attachment to religion and ‘ideology’.  Wars are generally \nprojected onto far-away places of contrast like Africa or the Middle East, where – as participants in the \nLübeck group put it – ‘there are fanatics on both sides’, people are ‘stubborn’ and ‘unwilling to sit \ndown with each other and work out a compromise’, so ‘they get each other more and more worked up \nuntil it becomes really extreme.’  Contemporary Europe and ‘the West’ are generally considered \nplaces of peace.  Yet conflict intrudes.  Immigration is the obvious way speakers make this link, with \nthe suggestion that those arriving from afar bring their natural characteristics with them.  The problem \ntends to be cast as the unwillingness or inability of such peoples to compromise on their differences, \nseeking instead to impose their customs and ways of life.  As Zbyněk in Ostrava put it, in a \nformulation echoed widely, ‘Muslims don’t know how to compromise.  It’s a completely different \nmentality.’  Such motifs are applied to a range of developments, from the building of mosques in the \nlocal area to acts of violence and terrorism. \n 11 \nThe possibilities for amelioration are again considered limited, probably in part because the \nway they are understood implies they are out of ‘our’ hands.  Rarely does one find the idea relations \ncan be improved through dialogue or mutual understanding.  ‘You’re never gonna stop war,’ says \nDerek in Reading, and ‘I can’t do nothing about it.’  Instead, the idea of irreconcilable difference is \nemphasised: for Peter and Dieter at Kassel, ‘people’s opinions are simply too different’.  Conflict is \nnormalised, and tackling these problems tends to be presented as a matter of reducing exposure.  \nGovernmental action at the national level remains the principal reference-point: stricter immigration \npolicies are a predictably well-cited possibility, accompanied by concerns they would be ineffective \ndue to the ingenuity of those arriving and the numbers already ‘here’.  Public approaches, and those \nbased on individual action, are scarcely mentioned.  The tendency to assume problems experienced at \na local level also play out on a wider scale is probably a contributing element in the scepticism, in that \nit implies such problems transcend polity boundaries.  They are neither purely local and therefore \nsusceptible to local address, nor purely distant and therefore susceptible to a policy of disengagement.   \n \n \nSociety and the Law \n \nFor problems such as crime and social misdemeanour, explanations are found reliably – there is less \nthe sense of mystery here.  Such problems tend to attract focus on the behaviour and mentalities of \nlocal actors, with explanatory factors including family upbringing, school discipline levels, and the \nwillingness of law-enforcement agencies to apply the rules.  Transnational factors are rarely cited, \neven though in principle one might imagine references to wider phenomena such declining religious \nfaith in modern societies, the impact of technological change, or the rise of criminal networks. \n The sense that something can be done varies, but is generally stronger than we have \nencountered so far – perhaps precisely because the focus is more local.  Improving the national \neducation system so as to raise honest citizens is widely regarded a credible objective.  Punitive \nmeasures against criminals are a second way government-led action is affirmed.  More police on the \nstreets, together with stronger criminal sentencing, are obvious expressions of this sentiment, with the \nnational government sometimes actively blamed where these expectations are unmet.  ‘We were \n 12 \npromised three strikes and you’re out, weren’t we,’ says Malcolm in Norwich, ‘that was one of the \nreasons I’ve voted for this government.’  All fellow participants assent to his suggestion that higher \ntaxation would be acceptable to see the laws properly enforced.  The exception to this more \naffirmative tone is found in the Czech groups, where the weakness of state finances is again deemed a \nconstraint, as likewise the prevalence of corruption: indeed, here the legal system is sometimes \ndescribed as another expression of rule-breaking rather than a potential solution. \n The possibility of society-led public approaches is raised in several groups.  Other citizens are \nto be encouraged to ostracise misbehavers, and if people will ‘stand up for the rules’ then positive \nchange is possible.  Such ideas are heard frequently amongst the British and German groups; in the \nCzech and Erfurt groups, one encounters a distinctive form of fatalism based on the notion that a large \nproportion of society remains morally tarnished by its association with communism, and that the \narrival of a ‘new generation’ is needed before a wider change in attitudes can be expected. \n To summarise, the sense of agency for these problems, while still qualified, is stronger than \nelsewhere.  Especially amongst the British and German groups, education and law enforcement are \nconsidered convincing governmental approaches – though the authority involved is national or sub-\nnational, and there is no reference to a transnational context.   \n \n These points are summarised in the table below.  Rendition in boxes risks excessive \nsimplification and a sense of determinism.  It deserves emphasis that while discursive practices are \npatterned, attempts to express these patterns are procrustean, since speakers may sometimes diverge \nfrom them, and – relatedly – since new patterns are always in generation.  Nothing said so far excludes \nthe possibility individuals may question or reject some of the motifs they encounter.   \n Principally it is governmental action which speakers mention: ‘politicians’ (generically, and as \nindividual leaders), ‘the government’ (in the abstract, and in the guise of ruling parties) and ‘the State’ \nare the main reference-points, while reference to private and public approaches are rarer.\n13\n  Yet often \n                                                 \n13\n Other than some isolated remarks about taxi-driver organisations, there are two references in total to NGOs – and these \nas examples of embezzlement.  This indifference towards organised civil society may be a European specificity: cf. (Perrin \n2006), in whose US groups public action is more prominent.  \n 13 \npolitical actors are assumed lacking in power, especially where the problems faced are traced out to a \nglobal level. \n \n \nTABLE 1 \n \n Economics Relations between Peoples Society & the Law \n \n \n \n \nExplanatory \nMotifs \n \n \nOften lacking. \n \nAlternatively very broad, \nstretching beyond Europe – \nglobal price & wage inequality, \nthe ‘cheaper East’. \n \nVariation: in CZ, ‘the East’ starts \nfurther east (e.g. Ukraine). \n \n \nGenerally broad, stretching \nbeyond Europe – global \ninequalities of power and \nresources; intransigent impulses \nof opponent ‘peoples’. \n \nVariation: less discussion of these \ntopics in CZ than GB and D, \nthough similar motifs appear. \n \nGenerally local – mentalities \n& conduct of local actors; \ndeclining levels of discipline; \nweak institutions of \nenforcement. \n \nVariation: in CZ + Erfurt, \nreferences to communist past as \nfurther source of problems. \n \n \n \n \n \n \n \n \nPossibilities \nfor Action \n \n \n \n \nGovernmental: Little.  Sense of \ninevitability; global price \/ wage \ninequalities assumed conclusive; \n‘too late’ to act.  \nVariation: in CZ + Erfurt, \nreferences to constraining effect \nof weak state finances and \neconomic dependence on western \nEurope. \n \nPublic: Little.  Boycotts \nmentioned, but problems of \nidentifying who to target, and \ngetting others to cooperate.   \n \nPrivate: Some.  Individual \nadaptation (e.g. acquiring new \nskills); enlightened consumerism \nwhere feasible. \n \n \nGovernmental: Little. \nConflict largely inevitable.  Can \nreduce exposure, e.g. with \nimmigration controls.   \nVariation: occasional reference \nin GB (not D \/ CZ) to use of \nmilitary force where necessary. \n \nPublic: Not mentioned. \n \nPrivate: Not mentioned. \n \nGovernmental:  Some.  \nImprove schooling; stronger \nlaw enforcement.   \nVariation: in CZ, references to \nconstraining effect of weak \nstate finances and corruption. \n \nPublic: Some.  Ostracisation of \nrule-breakers – if others in \nsociety willing to ‘stand up’.  \nVariation: in CZ, need to await \nnew, uncorrupted generation. \n \nPrivate: Some.  Better home \neducation; personal action (inc. \nvigilante-style) against rule-\nbreakers. \n \n Abbreviations: GB – Britain; D – Germany; CZ – Czech Rep. \n  \n \nEurope and the EU in Discussion \n \nAt this point we can resume focus on the matter of political authority at a European level.  As the \nreader will recall, at stake is not the general question of what citizens think of the EU but a more \ntargeted one to do with political justification: with what degree of credulity is a project-oriented \nrationale for the EU likely to be received?  Looking at how ‘Europe’ and the EU are evoked in these \ndiscussions allows examination of the significance of the patterns identified so far – how they may \n‘carry over’ to the idea of a European polity.  Of particular interest, given speakers’ emphasis on \n 14 \ngovernmental forms of action and their perceived limitations, is the extent to which the EU comes to \nbe regarded as an augmentation of, even a substitute for, governmental agency at the national level, or \nconversely is assumed to be suffering from the same – and perhaps additional – shortcomings. \n As indicated, the researcher made no concerted effort to steer these discussions towards \nEurope-related matters until the interviews were near conclusion.  In each discussion references to \nthese did appear naturally at some stage, featuring a range of terms, principally ‘the EU’ (the most \ncommon term in the German groups, and amongst the Czechs in the expanded form of ‘the European \nUnion’, though rare amongst the British) and ‘Europe’ (used fairly frequently as shorthand for the EU, \nespecially in the British discussions).\n14\n  These references were considerably more common than those \nto other transnational political arrangements such as the United Nations or to transnational economic \ninstitutions.\n15\n  They were significantly less common though than references to governmental actors at \nthe national level.\n16\n \n For the purposes of analysis a distinction can be made between two kinds of EU-related \nreference.  The first involves the direct expression of opinions concerning the Union’s institutions, \ndecision-making procedures, and the transfer of sovereignty, separate from the context of substantive \npolitical problems.  An emblematic example would be the complaint made by Alan in Swansea about \nthe money wasted (‘£20 million or something’) each time ‘Brussels’ moves from Brussels to \nStrasbourg.  Such opinions, though conceivably an influence on perceptions of agency, are not the \nfocus here, since they were rare and appeared mostly in response to the researcher’s direct questioning \nabout the EU late in discussion.  Of close to 100 EU-related references in the data, only nine were \ndetached in this way from substantive concerns.  Perhaps this relative infrequency is because such \n                                                 \n14\n The terminology itself is interesting: greater familiarity (perhaps not approval) seems implied by the frequency of the \nabbreviation ‘EU’ in the German groups, while the use of ‘Europe’ by British speakers suggests a more distant \nrelationship.  Occasionally one finds other terms too: ‘Brussels’ (used sometimes amongst the British, generally \npejoratively), the ‘common’, ‘internal’ or ‘European market’, and ‘the euro countries’ (this appearing occasionally in the \nBritish discussions to indicate a wider political grouping beyond the eurozone).  For simplicity, the umbrella term ‘Europe \nand the EU’ is used to summarise.  References to specific countries or regions in Europe, e.g. in the form of transnational \ncomparisons, are not examined here, though cf. (White 2009a). \n15\n The UN was mentioned just once, while the IMF, World Bank and WTO were never mentioned.  Note also that not only \nwere such structures absent in name but the concept of them (e.g. of global government) was also un-mentioned.  NATO \nwas mentioned once. \n16\n In total, 254 mentions of governmental actors at the national level (including ‘the government’, ‘the State’, political \nparties, or individual politicians and heads of state) were counted, and 94 mentions of the EU or related terms (cf. fnt. 13).  \nIn addition to this basic difference in visibility, virtually none of the latter kind distinguished between the EU institutions, \nmentioned Euro-parties or party groupings, or identified EU-related individuals.  (These figures are indicative: where one \nspeaker repeated a reference twice in quick succession, only one was recorded; also, judgement was required to distinguish \nmentions of ‘Europe’ with political content from those referring simply to a geographical space.) \n 15 \nreferences concern phenomena specific to the EU’s institutional configuration, about which public \nlevels of knowledge are notoriously low and of which ignorance is often conceded.\n17\n  Even criticising \nthe EU on procedural grounds requires a familiarity with its institutions which may rare.  Perhaps \ninfrequency also reflects diminished concern.  While questions of the mechanisms and ‘finality’ of \nintegration will properly be of salience to scholars, it seems natural those without a professional \ninterest may prefer to work outwards from problems of immediate concern, and to invoke ‘Europe’ \nonly where it is assumed to have bearing.\n18\n  We shall focus on these problem-related references.  \n It will have been anticipated from the preceding section that for one set of problems – Society \nand the Law – the significance ascribed to the EU is basically non-existent.  These are problems given \nprominence across the groups, but attention is on the domestic, with explanations local in focus.  One \nsees relatively positive assumptions of agency, with roles ascribed to national government and fellow \ncitizens.  Importantly, such a perspective implies speakers are not reflexly cynical about all forms of \npolitical agency – government ‘has its place’, at least for certain problems.  Nor is it a perspective \nincompatible with a European polity, since the possibility of decentralising authority is expressed in \nthe EU’s principle of subsidiarity.  But undoubtedly it is a perspective which invites little positive \nsignificance to be ascribed to the EU – instead it is overlooked.   \n In discussion of Economics (especially) and Relations between Peoples (somewhat), ‘Europe’ \nand the EU are invoked more.\n19\n  That a connection is made on both reminds that the meaning ascribed \nto the EU cannot be reduced to a single register of evaluation, whether economic or cultural-\ngeopolitical.  It also implies the absence of references on Society and the Law is no mere artefact of \nthe interview format, since otherwise one would expect similar reticence across the full range of topics \ndiscussed.  Yet this was not the case: for Economics and Relations between Peoples, such references \ndid appear.  Surely linked is the fact that both sets of problems are described transnationally, with \nexplanatory motifs including factors extending well beyond the local environment.  This would seem \nto suggest some of the ideational ‘raw materials’ are in place for speakers to make positive sense of \n                                                 \n17\n See e.g. (OPTEM 2006) on knowledge levels and attitudes to the EU institutions. \n18\n The focus on substantive problems might also be suspected as a reason, but note that one of the problems discussed – \n‘corruption’ – provided considerable opportunity for a discussion of the EU in these terms if desired. \n19\n The prominence of economic perspectives on the EU is also evident in the findings of the ‘Citizens Talking about \nEurope’ (CITES) project; see also (Díez Medrano 2009). \n 16 \nthe EU.  Yet when one recalls more closely the patterns identified above, the difficulties will be \napparent.  While speakers do occasionally raise the prospect of political action at a European level \n(understood in governmental terms, for society-based forms of action at a European level are not \nmentioned), it is generally with severe doubts attached.  Furthermore, references to ‘Europe’ and the \nEU are not always references to the (im)possibility of political action, but to the unfolding of problems \nthemselves. \n Fully consistent with the emphasis on irresistible forces at a global level, speakers give little \nsuggestion that European approaches may succeed where conventional ones fail.  The EU is very \nrarely mentioned in these discussions as a means of addressing economic problems which cannot be \naddressed by national government.  Nor is it much blamed for failing to act, something which might \nimply the possibility.  Given the underlying understanding of the problems in question, the EU would \nneed to appear as a kind of deus ex machina, an unexpected rupture from the narrative frame, in order \nto be seen as a decisive and positive influence.  It comes closest to this in the Czech groups, where \ncredit is occasionally given for infrastructure improvements: Robert in Plzeň notes judiciously that ‘it \ncan be said that in the time we’ve been in the EU the situation’s improved.’  Michal confirms: ‘the \nUnion’s contributed to the construction of every bridge here, large and small.’  It remains doubtful \nhowever whether such EU-led action is seen as an expression of agency rather than a welcome but \nmysterious change in fortunes.  Generally, with most economic problems linked in discussion to \nglobal factors far beyond the borders of Europe, little positive role is accorded to a European polity.   \n Instead, across the groups, and particularly in the German and Czech discussions, various \ncurrent EU policies come to be heavily entwined with such problems, such that the Union is treated as \nan expression or exacerbation of them.  This can be seen in several instances.  Discussion of the euro’s \nintroduction, for example, exhibits the familiar motif of inevitability.  Participants in Ostrava talk of \nthe prospect of the euro as a ‘catastrophe’, but are agreed it will come.  For Pavel in Plzeň, ‘the only \nquestion is when.’  In a Lübeck passage, a specific grievance with discrepancies created by the EU is \nlinked together with a more general sense of powerlessness before wider economic forces:\n20\n \n                                                 \n20\n  The passage appears 26 mins into the interview (10 mins into the open discussion).  The focus since the card exercise \nhas been on economic issues: unemployment, price rises due to the euro, problems of mis-regulation, and the impact of \n 17 \n \nJochen:  All these Polish workers, the manual labourers – tilers, bricklayers, for example – they work here in \nsuch favourable conditions because they don’t have to contribute social-security taxes [W:  Right …] like a \nGerman labourer has to.  A German labourer is checked to make sure he makes all his contributions.  And a \nPolish worker comes over and says ‘yeah, I’ll do that,’ but no-one bothers about him so long as he’s not \ncaught, so long as no-one catches him doing black labour, so he can afford to offer attractive prices.  He \ncan work as a bricklayer, a tiler, he’s flexible.  And naturally unemployment isn’t going to get better like \nthat, it’s going to get worse. \n \nWerner:  I find it really, really bad, if that … what the EU Directive says, concerning the free movement of \nservices, if that goes through, then Polish and Czech employees, or from Lithuania too … If they’re \nallowed to work with us here under their own conditions then no small entrepreneur’s going to be able to \nsurvive here.  The German master-bricklayer, or the bricklayer, or the tiler who works for himself, he has to \npay his taxes, his contributions to the professional association, he has to contribute his share to employees’ \nhealth insurance, pension insurance etc., and none of them have that so they can set more attractive prices.  \nAnd so that also disturbs our economy.  \n \nAuthor:  Is there any solution to this kind of problem … can one do something about it?   \n \nJochen:  Well, the world is heading ever more towards globalisation, and globalisation is … in the future an \nequalisation between poor countries and rich countries …  And this process won’t be complete within the \nnext few years, it’ll be very, very slow, it’ll last a really long time, until Uzbekistan has the same standard \nof living as we do, for example, as the Federal Republic of Germany.  And then sometime far off in the \ndistant future – fiction really – this problem will naturally be solved.  But that’ll definitely take generations. \n \nNiklas:  The standards are closing towards each other … Not everyone is going to get such a high standard as \nhere ... \n \nWerner:  It’ll go down here and go up for the others, that’s clear. \n \nJochen:  You can see that already in the EU.  That some countries profit from it and other countries … [W: … \nsuffer from it …] suffer from it. \n \nAuthor:  Which ones profit, for example? \n \nJochen:  The ones who profit are the poorer countries with the low GNP.  And the industrial countries, they \nbasically have to step down from their level, surrender their achievements.  To put it simply. \n           \nAuthor:  What do you expect of the government in this context?  [J:  Difficult …]  What can it do? \n \nWerner:  Very, very difficult … [N: … to find solutions …] \n \nJochen:  Many say we should go back, we should have the Deutschmark instead of the euro, the borders must be \n… the walls must be erected again, then everything will be better again.  But whether that’s the solution, \nI’d strongly doubt it.  [N:  I don’t think so either.] \n \nWerner:  This process is no longer reversible. \n \n \nChanges associated with the EU, such as the opening of borders and the arrival of the euro, are \ndescribed as symptoms of a broader process of globalisation and the loss of boundaries.  Attempts to \nintroduce barriers are likely to be futile, for it is an irreversible long-term process.  Note ‘you can see \nthat already in the EU’, implying the EU is the first or most immediate expression.  The euro comes \nacross as neither positive nor negative, neither a remedy nor a mistake, but the extension of a pattern.  \nIn this and other groups, participants do raise complaints about the manner in which it was introduced \n                                                                                                                                            \nimmigrant labour.  Subsequent discussion looks at how further EU enlargement may exacerbate problems of job \ncompetition and high taxes, and why manufacturers are moving to east Asia. \n 18 \n– ‘no-one asked us, there should have been a referendum,’ says Hamid in Lübeck – but this is not \nmatched by a sense the outcome might have been different.  The EU follows wider trends. \n \n When discussion touches problems of Relations between Peoples, one finds further reference \nto ‘Europe’ and the EU.  As noted, questions of intergroup conflict are generally not associated with \nthe majority-peoples of ‘the West’ as these are constructed in discussion.  Their relations are assumed \npeaceful, and war between them unlikely.  As Ralf in Würzburg puts it, ‘the only conflicts which are \nleft are far away from us, and here in Central Europe, in Europe, in the EU area we have a very \npeaceful shared existence.  I think that’s very important, that’s a historical step forward.  Germany-\nBritain, the bombardment in the Second World War, this hard enmity is gone, gone once and for all.’  \nPerhaps because this assumption is made readily, a role for the EU in coordinating harmonious \nrelations – one of its classic justifications, after all – appears superfluous.  When Ralf suggests the EU \nmight be given credit for the emergence of peaceful coexistence, his co-participants are dubious, \nespecially about such a role today.   \n Nor does the EU tend to be accorded a positive role as regards those inter-people relations \nquite clearly problematised.  Building up ‘Europe’ as a global power in military and defence so as to \nmanage threats emerging from outside – another form of action, desirable or not – is a proposal heard \nrarely in these discussions.  That ‘the West’ evokes something broader than Europe probably weakens \nthe extent to which acting at a European level is given credence; likewise the assumption that \nopponents are living within the local environment, not just beyond.  They can be encountered on the \ncity streets, not just in far-away locations.  When the problem is thus constructed as one of daily \nexposure, the relevance of foreign and defence policy at any level is much diminished.  \n Compared to Economics, it is rare for the EU to be treated as a contributing factor to the \nproblems articulated.  Prospective Turkish membership is the notable exception.  In Lübeck, during a \ndiscussion of awkward relations with ‘Ausländer’, Jochen comments with collective approval that \n‘these differences in mentality, they’re particularly serious with regard to Turkey’s entry [into the EU] \n… It’ll get even more extreme.  Because that’s where the Orient meets the Occident, isn’t it.  \nPractically two different cultures.  I think that’s really, really difficult.’   \n 19 \n \n \n \n \n \nTABLE 2 \n \n Economics Relations between Peoples Society & the Law \n \n \n \n \n \n \n \nEvocations of \n‘Europe’ \/ EU  \n \nMentioned regularly.   \n \nBut rarely as possible augmentation or \nsubstitute for nat. governmental agency. \nVariation: speakers in CZ acknowledge \npossibility EU might herald economic \nimprovements. \n \nOften mentioned as expression of \nproblems themselves, picking up familiar \nmotifs of exposure to global forces, \nirresistibility of changes, irreversibility of \ndecisions. \nVariation: above true esp. amongst D and \nCZ groups; speakers in UK make similar \npoints, but more rarely. \n \n \nMentioned sometimes. \n \nOccasional references to \npossibility of a European security \npolicy.  But generally dismissed – \npeace between ‘European’ peoples \nalready secure, while the serious \nproblems not considered European \nin origin or effect - both more \nglobal and local. \n \nOccasionally mentioned as a \nsource of problems, mainly re. \nenlargement to Turkey. \nVariation: no such mentions \namongst UK groups. \n \n \n \n \n \n \n \n \nNot mentioned \n \n \nLet us draw the threads of the argument together.  As ‘Europe’ and the EU are invoked in these \ndiscussions, speakers readily link them with the problems of everyday life.  In doing so, they draw on \nthe repertoires of understanding available to them for making sense of these problems, thus entwining \nthe EU in these wider patterns.  In three major ways, such patterns do little to ‘make sense of’ the EU \nin positive political terms.  First, there are problems from which it is ostensibly deemed too remote to \nbe relevant (mainly those to do with law and order and antisocial behaviour), with these problems \nunderstood as local in origin and effect.  Second, with regard to those problems for which it is ascribed \nrelevance, the EU takes on the sense of powerlessness before mysterious or inevitable forces attributed \nto governmental agency more generally, thus undermining the possibility it might be regarded as a \nsuitable response to these.  And third, more than this, its policies come to be linked to many of the \nproblems raised, casting it as an expression, perhaps even an exacerbation, of them.  In each of these \nthree ways, the dominant tone evoked is perhaps not so much that of active hostility towards the EU as \na combination of indifference and knowing resignation – notwithstanding the seriousness accorded to \nthe problems themselves.   \n 20 \nNote it is not argued the only factor conditioning citizen perspectives on the EU is its degree of \naccordance with these patterns of political understanding.  The discussions were focused from the \noutset on substantive problems, not for instance feelings of cultural or values-based commonality: they \nconsequently do not provide a comprehensive catalogue of reasons why the EU may be seen \nnegatively or with apathy.  To reiterate, it is the plausibility of a project-oriented rationale for the EU \nwhich is at stake.  Moreover, as noted, the interview structure was deliberately kept quite open, with \nthe researcher generally refraining from challenging participants to articulate views on the EU so as to \nfocus on wider assumptions.  While this avoids embedding Euro-centrism in the research design, still \none must acknowledge that why ‘Europe’ and the EU are evoked in certain ways at certain moments, \nand left unspoken at others, can only be the subject of interpretative claims.  What gives these claims \ntheir plausibility is the consistency they highlight between patterns of sense-making on Europe as a \npolitical phenomenon and patterns of political interpretation more generally. \n \n \nDiscussion \n \nAccepting this reading of the material, how should one judge the implications?  To continue the \npreceding thought, individual cognitive processes at a particular moment, such as at the polling booth \nwhen deciding whether to endorse further integration, can only be a matter of conjecture.  Some such \nindividuals may draw directly on the motifs identified; others, following the expectations of \npsychological approaches, may act according to ostensibly unrelated emotions to do with how \n‘European’ they feel and how they respond to Europe-related symbols (Bruter 2005).  Others – surely \na minority – may be persuaded more by procedural concerns to do with (perceptions of) how the \nBrussels institutions are run.  Others may not even get to the polling booth.  If the patterned ways in \nwhich citizens interpret the political world are important, it is not necessarily in the sense one can \nattribute them a causal status for individual actions at a given moment. \n Rather than as determinative in the particular instance, this ideational background is better seen \nas exercising a more general enabling and constraining effect on various political aspects of \ncitizenship.  First, as suggested, it may shape the kinds of arguments that can feasibly be made on \n 21 \nbehalf of political authority and those unlikely to resonate, thus influencing general levels of consent \ntowards the polity.  Project-oriented justifications for the EU, referring e.g. to the possibilities it holds \nfor addressing problems to do with economics or migration, will be received as convincing only to the \nextent those projects themselves are held credible.  Second, it may influence levels of political \nvigilance and participation, for only if citizens have the tools of imagination to see the EU as a \npossible deliverer of political goods are they likely to seek assurance its policies approximate the \nstandards this requires.  Without this necessary basis on which to judge and criticise, the risk will be \nthat the legal and political rights of EU citizenship are neglected, leaving a passive and manipulated \ncitizenry.  Also, while these ideational features may not determine electoral outcomes, they may affect \nwhich political actors have the best resources at their disposal.  Certain routinised ways of seeing can \nbe used to mobilise supporters behind a political programme, and to encourage transnational alliances \nand supranational claims-making in its pursuit, while others inhibit such action (Gamson 1992).  \nProjects of economic redistribution, or intercultural dialogue, would be pertinent cases in point. \n The way the EU is drawn into these discussions with taxi-drivers rather jars with the notion its \npolitical viability and legitimacy rest on addressing the substantive concerns of citizens.  Even \nsupposing the EU does perform this beneficial role, such a message is not easily ‘hearable’ for those of \nits citizens drawing on the patterns of interpretation traced.  Certainly the findings suggest these \ndifficulties are not restricted to the EU, since the political capacities of national institutions are \nquestioned analogously (albeit rather more actively, and with a lingering sense of what may be \nachieved on certain issues).  But the consequences of such thinking are especially damaging in the EU \ncase, for a transnational polity is not only permanently vulnerable to a dissolution into its component \nparts, but is less able to draw on some of the additional sources of allegiance associated with the \nnation-state.  The ties generated by commonality of culture and history, or the commitments born of \nroutine and repeated exposure, may ensure that in the nation-state context the question ‘what is the \npolity for?’ either finds an instinctive answer or is not even posed; yet these ties and commitments \nseem absent in the European context and unlikely to emerge.   \n Given the observations made, changes in certain common patterns of political understanding \nseem a necessary accompaniment to any deepening of the EU’s political credibility.  Such changes are \n 22 \npossible, since rather than expressing a uniquely correct way to appraise the political world, these \npatterns express contingent interpretations.  Reality is sufficiently complex as to resist definitive \nrepresentation (Sewell 2005, p.191).  Indeed, changes are inescapable, since these discursive patterns \nare reproduced through acts of human interpretation, and must respond to the creativity individuals \nbring to this.  While generally enduring, there may be moments of crisis and conflict when such \ncommonsense ideas are swiftly remade.  The task for suitably inclined political actors would be to \nmake available new ways of interpreting the problems of everyday life so as to make better sense of \nthe possibilities for their organised address (Tarrow & Tilly 2007; Tilly 2003).  Judging by this study, \nthese would need to offer ways of understanding the origins of problems such that they did not appear \nthe outcome of mysterious forces or the inevitable consequence of human nature, and would need to \ndispute the tendency to locate causal factors either at a quite local level or far beyond Europe’s \nborders.  Only then is political agency at a European level likely to escape the triple hazards of \nseeming remote from, dwarfed by, or partly responsible for, the challenges it might seek to address.  \nThe articulation of new sets of problems little heard in these discussions, for instance to do with the \nenvironment, would further expand the stock of resources with which such arguments could be made. \n \nThe paper began with a quotation from Ralf, a taxi-driver in Würzburg.  His words conjure the \nEU, specifically its process of enlargement, as an economic phenomenon, both in its goals – the \ncreation of markets – and its consequences – the migration of companies to the East.  As the \nsubsequent analysis has indicated, the sense of fatalism he conveys can be read as part of a more \ngeneral mood speakers evoke when articulating matters of economic concern.  The ‘door’ which has \nbeen opened in the EU can no longer be closed, just as it is ‘too late’ to control the economic forces of \nglobalisation.  Such motifs weaken the credibility of counter-arguments seeking to portray the EU as a \npositive means to address the substantive concerns of its citizens, and, one may suppose, any resolve \nto ensure it fulfils such a role.  If a project-oriented rationale of this kind is to have resonance, it would \nseem to require wider changes in the interpretative schemes by which the political world is imagined. \n \n \nReferences \n 23 \n \nAntaki, Charles (1988), 'Explanations, Communication and Social Cognition', in Antaki (ed.), Analysing Everyday \nExplanation: A Casebook of Methods (London: Sage). \n--- (1994), Explaining and Arguing: The Social Organization of Accounts (London: Sage). \nBrubaker, Rogers and Cooper, Frederick (2000), 'Beyond \"Identity\"', Theory and Society, 29 (1). \nBruter, Michael (2005), Citizens of Europe?  The Emergence of a Mass European Identity (Basingstoke: Palgrave). \nDíez Medrano, Juan (2009), 'The Public Sphere and the European Union’s Political Identity', in Peter Katzenstein and \nJeffrey Checkel (eds.) European Identity (Cambridge: CUP). \nDraper, Stephen W. (1988), 'What's Going On in Everyday Explanation?' in Charles Antaki (ed.), Analysing Everyday \nExplanation: A Casebook of Methods (London: Sage). \nDuchesne, Sophie (2008), 'Waiting for European identity: Preliminary thoughts about the identification process with \nEurope', Perspectives on European Politics and Society 9 (4). \n--- & Florence Haegel (2007), 'Avoiding or Accepting Conflict in Public Talk', British Journal of Political Science, 37 (1). \nEder, Klaus (1995), 'Does Social Class Matter in the Study of Social Movements? A Theory of Middle Class Radicalism', \nin Louis Maheu (ed.), Social Movements and Social Classes (London: Sage). \nGamson, William (1992), Talking Politics (Cambridge: CUP). \nHewstone, Miles & Frank Fincham (1996), 'Attribution Theory and Research: Basic Issues and Applications', in Hewstone, \nWolfgang Stroebe & Geoffrey Stephenson (eds.), Introduction to Social Psychology (Oxford: Blackwell). \nHooghe, Liesbet and Gary Marks (eds.) (2007), 'Special Issue: Understanding Euroscepticism', Acta Politica 42 (2-3). \nKohli, Martin (2000), 'The Battlegrounds of European Identity', European Societies, 2 (2). \nLamont, Michèle and Thévenot, Laurent (eds.) (2000), Rethinking Comparative Cultural Sociology (Cambridge: CUP). \nMeinhof, Ulrike (2004), 'Europe Viewed from Below: Agents, Victims, and the Threat of the Other', in Richard K. \nHerrmann, Thomas Risse, and Marilynn B. Brewer (eds.), Transnational Identities: Becoming European in the \nEU (Oxford: Rowman & Littlefield). \nMorgan, Glyn (2005), The Idea of a European Superstate: Public Justification and European Integration (Princeton: PUP). \nNicolaidis, Kalypso (2004), ''We, the Peoples of Europe ...'', Foreign Affairs,  (November \/ December). \nOPTEM (2006), 'European Citizens and the Future of Europe: a Qualitative Study in the 25 Member States', (Eurobarom.). \nPerrin, Andrew J. (2006), Citizen Speak: The Democratic Imagination in American Life (Chicago: UCP). \nSewell, William H. (2005), Logics of History: Social Theory and Social Transformation, (Chicago: UCP).  \nSwidler, Ann (2001), Talk of Love. How Culture Matters (Chicago: UCP). \nTarrow, Sidney and Tilly, Charles (2007), Contentious Politics (Boulder, Colo.: Paradigm). \nTilly, Charles (2003), 'Political Identities in Changing Polities', Social Research, 70 (2).  \nWhite, Jonathan (2009a), 'Thematization and Collective Positioning in Everyday Political Talk', British Journal of Political \nScience 39 (4), pp.699-709. \n--- (2009b), 'The Social Theory of Mass Politics', Journal of Politics 71 (1), pp.96-112. \n--- (2010a), ‘Europe and the Common’, Political Studies 58 (1), pp.104-22. \n--- (2010b), ‘European Integration by Daylight’, Comparative European Politics 8 (1), pp.55-73. \n \n \n"}