{"doi":"10.1002\/job.173","coreId":"92881","oai":"oai:eprints.lse.ac.uk:831","identifiers":["oai:eprints.lse.ac.uk:831","10.1002\/job.173"],"title":"A psychological contract perspective on organizational citizenship behavior","authors":["Coyle-Shapiro, Jacqueline A."],"enrichments":{"references":[{"id":17335962,"title":"A new kind of performance for industrial and organizational psychology: Recent contributions to the study of organizational citizenship behavior.","authors":[],"date":"1999","doi":null,"raw":"Organ, D.W. Paine, J.B. 1999.  A new kind of performance for industrial and organizational psychology: Recent contributions to the study of organizational citizenship behavior.  In C.L. Cooper & I.T. Robertson (Eds), International Review of Industrial and Organizational Psychology.  John Wiley & Sons, Vol 14, pp337-368.","cites":null},{"id":17335919,"title":"An equity-exchange model of organizational involvement.","authors":[],"date":"1979","doi":"10.2307\/257403","raw":"Gould, S. 1979.  An equity-exchange model of organizational involvement.  Academy of Management Review 4: 53-62.","cites":null},{"id":17335955,"title":"An examination of the development and consequences of psychological contracts. Paper presented at the annual Meeting of the Academy of Management,","authors":[],"date":"1999","doi":null,"raw":"O’Leary-Kelly, A. M. Schenk, J.A. 1999. An examination of the development and consequences of psychological contracts.  Paper presented at the annual Meeting of the Academy of Management, Chicago.","cites":null},{"id":17335906,"title":"An integrative framework for explaining reactions to decisions: Interactive effects of outcomes and procedures.","authors":[],"date":"1996","doi":"10.1037\/\/0033-2909.120.2.189","raw":"Brockner, J. Weisenfeld, B.M. 1996.  An integrative framework for explaining reactions to decisions: Interactive effects of outcomes and procedures.  Psychological Bulletin 120: 189-208.","cites":null},{"id":17335938,"title":"Beyond fairness: A theory of allocation preferences.","authors":[],"date":"1980","doi":null,"raw":"Leventhal, G.S. Karuza, J. Fry, W.R. 1980. Beyond fairness: A theory of allocation preferences.  In G. Mikula (Ed.), Justice and social interaction (pp167-218). New York: Springer-Verlag.","cites":null},{"id":17335900,"title":"Beyond reciprocity: the role of relationship orientation in explaining cooperative organizational behavior. In","authors":[],"date":"2000","doi":null,"raw":"Blader, S.L. Tyler, T.R. 2000. Beyond reciprocity: the role of relationship orientation in explaining cooperative organizational behavior. In J. Neuman & J. Coyle-Shapiro (Chairs), Employee-Employer Reciprocity: Within and Beyond the Employment Relationship. Symposium conducted at the meeting of the Society for Industrial and Organizational Psychology, New Orleans, Louisiana.","cites":null},{"id":17335934,"title":"Citizenship and social exchange.","authors":[],"date":"1994","doi":"10.2307\/256704","raw":"Konovsky, M.A. Pugh, S.D. 1994. Citizenship and social exchange.  Academy of Management Journal 37: 656-669.","cites":null},{"id":17335910,"title":"Consequences of the psychological contract for the employment relationship: A large scale survey.","authors":[],"date":"2000","doi":"10.1111\/1467-6486.00210","raw":"Coyle-Shapiro, J. Kessler, I. 2000.  Consequences of the psychological contract for the employment relationship: A large scale survey.  Journal of Management Studies 37(7): 903-930.","cites":null},{"id":17335969,"title":"Differential perceptions of employers’ inducements: implications for psychological contracts.","authors":[],"date":"1998","doi":"10.1002\/(sici)1099-1379(1998)19:1+<769::aid-job968>3.0.co;2-1","raw":"Porter, L.W. Pearce, J.L. Tripoli, A.M. Lewis, K.M. 1998. Differential perceptions of employers’ inducements: implications for psychological contracts.  Journal of Organizational Behavior 19: 769-782. Rhoades, L & Eisenberger, R. (in press) Perceived organizational support: A review of the literature, Journal of Applied Psychology.","cites":null},{"id":17335950,"title":"Does perceived organizational support mediate the relationship between procedural justice and organizational citizenship behavior?","authors":[],"date":"1998","doi":"10.2307\/256913","raw":"Moorman, R.H. Blakely, G.L.  Niehoff, B.P. 1998. Does perceived organizational support mediate the relationship between procedural justice and organizational citizenship behavior?  Academy of Management Journal 41: 351-357.","cites":null},{"id":17336000,"title":"Easing the pain: Determinants and effects of psychological contract violations. Paper presented at the Annual Meeting of the Academy of Management,","authors":[],"date":"2000","doi":null,"raw":"Tekleab, A.G Taylor, M.S. 2000.  Easing the pain: Determinants and effects of psychological contract violations.  Paper presented at the Annual Meeting of the Academy of Management, Toronto.     - 34 -  Psychological contracts and OCB Taylor, E.C. Tepper, B.J. 1999. Mediating and moderating effects of role definitions on relationships between organizational justice and organizational citizenship behavior.  Paper presented at the annual meeting of the Academy of Management, August, Chicago.","cites":null},{"id":17335911,"title":"Emerging justice concerns in an era of changing psychological contracts.","authors":[],"date":"2001","doi":null,"raw":"Cropanzano, R. Prehar, C.A. 2001. Emerging justice concerns in an era of changing psychological contracts.  In R. Cropanzano (Ed.) Justice in the Workplace (Vol 2 245-269). Lawrence Erlbaum Associates: Mahwah, NJ.","cites":null},{"id":17335905,"title":"Exchange and power in social life. Wiley: New York. - 28 - Psychological contracts","authors":[],"date":"1964","doi":"10.2307\/2574842","raw":"Blau, P. 1964. Exchange and power in social life. Wiley: New York.   - 28 -  Psychological contracts and OCB Brockner, J., Dewitt R.L., Grover, S. Reed, T. 1990. When it is especially important to explain why: factors affecting the relationship between managers’ explanations of a layoff and survivors’ reactions to a layoff.  Journal of Experimental Social Psychology, 26: 289-407.","cites":null},{"id":17335917,"title":"Individuals, interpersonal relations and trust.","authors":[],"date":null,"doi":null,"raw":"Good, D.1988. Individuals, interpersonal relations and trust.  In Gambetta, D. (Ed.) Trust. Basil Blackwell: New York.","cites":null},{"id":17335899,"title":"Interactional justice: Communication criteria for fairness. In","authors":[],"date":"1986","doi":null,"raw":"Bies, R.J. and Moag, J.S. 1986. Interactional justice: Communication criteria for fairness. In B. Sheppard (Ed.), Research on Negotiation in Organizations, Vol 1, pp. 43-55.  Greenwich, CT: JAI Press.","cites":null},{"id":17335907,"title":"Interpersonal attraction in exchange and communal relationships.","authors":[],"date":"1979","doi":"10.1037\/\/0022-3514.37.1.12","raw":"Clark, M.S. Mills, J. 1979. Interpersonal attraction in exchange and communal relationships.  Journal of Personality and Social Psychology 37: 12-24.","cites":null},{"id":17335925,"title":"Is the psychological contract worth taking seriously?.","authors":[],"date":"1998","doi":"10.1002\/(sici)1099-1379(1998)19:1+<649::aid-job970>3.0.co;2-t","raw":"Guest, D. 1998. Is the psychological contract worth taking seriously?. Journal of Organizational Behavior 19: 649-664.","cites":null},{"id":17335923,"title":"Justice and organizational citizenship behavior: A commentary on the state of the science. Employee Responsibilities and Rights","authors":[],"date":"1993","doi":"10.1007\/bf01419448","raw":"Greenberg, J. 1993.  Justice and organizational citizenship behavior: A commentary on the state of the science.  Employee Responsibilities and Rights Journal 6: 249-256.","cites":null},{"id":17335998,"title":"Method variance as an artifact in self-reported affect and perceptions at work: myth or significant problem.","authors":[],"date":"1987","doi":"10.1037\/\/0021-9010.72.3.438","raw":"Spector, P.E. 1987. Method variance as an artifact in self-reported affect and perceptions at work: myth or significant problem.  Journal of Applied Psychology 72: 438-443.","cites":null},{"id":17335912,"title":"Multiple regression in psychological research and practice.","authors":[],"date":"1968","doi":"10.1037\/h0025471","raw":"Darlington, R.B. 1968. Multiple regression in psychological research and practice. Psychological Bulletin, 69: 161-182.","cites":null},{"id":17335895,"title":"Multiple Regression: Testing and Interpreting Interactions.","authors":[],"date":"1991","doi":"10.1177\/109821409301400208","raw":"Aiken, L.S. West, S.G. 1991.  Multiple Regression: Testing and Interpreting Interactions. Sage: Newbury Park, CA.","cites":null},{"id":17335929,"title":"Multivariate Data Analysis. (3 rd edition) Macmillan:","authors":[],"date":"1992","doi":null,"raw":"Hair, J.F. Anderson, R.E. Tatham, R.L.  Black, W.C. 1992.  Multivariate Data Analysis. (3 rd edition)  Macmillan: New York.","cites":null},{"id":17335974,"title":"New hire perceptions of their own and their employer’s obligations: A study of psychological contracts.","authors":[],"date":"1990","doi":"10.1002\/job.4030110506","raw":"Rousseau, D.M. 1990. New hire perceptions of their own and their employer’s obligations: A study of psychological contracts. Journal of Organizational Behavior 11: 389-400.","cites":null},{"id":17335908,"title":"New work attitude measures of trust, organizational commitment and personal need non-fulfilment.","authors":[],"date":"1980","doi":"10.1111\/j.2044-8325.1980.tb00005.x","raw":"Cook, J., & Wall, T. 1980. New work attitude measures of trust, organizational commitment and personal need non-fulfilment. Journal of Occupational Psychology 53: 39-52.","cites":null},{"id":17335909,"title":"On the dimensionality of organizational justice: A construct validation of a measure.","authors":[],"date":"2001","doi":"10.1037\/\/0021-9010.86.3.386","raw":"Colquitt, J.A. 2001. On the dimensionality of organizational justice: A construct validation of a measure.  Journal of Applied Psychology 86: 386-400.","cites":null},{"id":17336008,"title":"Organizational citizenship behavior of contingent workers in Singapore.","authors":[],"date":"1998","doi":"10.2307\/256965","raw":"Van Dyne, L. Ang, S. 1998.  Organizational citizenship behavior of contingent workers in Singapore. Academy of Management Journal, 41: 692-703. - 35 -  Psychological contracts and OCB TABLE 1 Results of factor analysis of OCB items Factor Items  1 2 3 4 5 Uses professional judgment to assess what is right\/wrong for the organization   .71  .10  .01  .09  .03 Makes creative work related suggestions to co-workers   .71  .23  .29  .01  .06 Makes innovative suggestions to improve the functioning of the department   .71  .19  .24  .11  .11 Shares ideas for new projects or improvements widely   .69  .14  .19  .15  .09 Encourages others to speak up at meetings   .64  .24  .04  .11  -.02 Participates in outside groups for the benefit of the organization ‡  .50  .07  .45  .17  -.05 Helps  others  who  have  heavy  workloads  .19 .80 .17 .03 .09 Helps others who have been absent  .22  .75  .07  .04  .11 Goes out of the way to help colleagues with job related problems  .24  .72  .19  .04  .09 Readily assists supervisor with his\/her work  .11  .69  .21  .08  -.05 Tries to avoid creating problems for others  .16  .50  -.01  .05  .32 Works  beyond  what  is  expected  .18 .21 .74 .02 .16 Exceeds formal requirements of the job  .23  .20  .67  -.02  .19 Goes the ‘extra mile’ for the organization  .31  .20  .54  .31  .14 Only attends work related meetings if required by the job   .00  .05  -.52  -.29  .04 Participates in activities that are not required but that help the image of the organization   .32  .17  .50  .30  .02 Avoids extra duties and responsibilities at work † ‡  -.02  .18  .46  .29  .30 Personally pursues additional training to improve performance ‡  .32  .14  .42  .04  .08 Tells outsiders that the organization is a good place to work  .05 .04 .14 .87 .00 Defends the employer when other employees criticize it  .19  .00  .15  .75  .02 Represents  the  organization  favorably  to  outsiders  .16 .12 .11 .73 .10 Neglects aspects of job responsibilities  †  -.05 .05 .06 -.11 .76 Wastes time while at work on personal matters †  .10  -.09  .13  .01  .72 Regardless of circumstance, produces the highest quality work   .13  .27  .15  .13  .57 Follows work rules and instructions with extreme care  .01  .32  .04  .21  .53 Eigenvalue  7.3  2.18 1.85 1.39 1.12 Percentage  of  variance  explained  29.2  8.7 7.4 5.6 4.5 ‡ Item dropped    † item reversed scored   - 36 -  Psychological contracts and OCB TABLE 2 Descriptive statistics and intercorrelations of main study variables Mean  S.D  1 2 3 4 5 6 7 1.  Gender T1  0.65  0.48 2.  Age T1  42.92  8.69  -.01 3.  Organizational Tenure  T1  10.51 7.89  -.25 .37 4.  Trade union membership T1  1.97 0.18  -.11  .16  .25 5.   Employer obligations T1  24.69 5.52  .05  -.01  .01  .06  (.84) 6.   Employer inducements T1  16.70  4.20 .06  .04  .04  .00 .41  (.74) 7.   Norm of reciprocity T3  3.65 1.34  -.21  -.12 -.03  .02  .06  -.03  (.60) 8.   Trust in employer T1  4.29 1.37  .19 .04 -.07 -.10  -.06  .38  -.16 9.   Procedural justice T2  4.44 1.30  .14  -.04 -.02 -.03  -.07  .19  -.10 10.  Interactional justice T2  5.24  1.44 .04  -.05  .00  -.05 .01  .26 -.08 11.  Advocacy participation T3  3.71  0.64 .06  .09  .05  .05 .22  .17 -.09 12.  Helping  T3  3.77  0.60 .18  .06  -.02  -.03 .18  .11 -.13 13.  Functional Participation T3  4.16  0.71 .15  .07  -.08  .07 .16  .17 -.16 14.  Loyalty T3  3.51  0.76 .05  .02  .04  .02 .10  .30 -.11 15.  Obedience T3  5.25  0.48 .25  .13  .00  .01 .05  .02 -.17 Correlations > .13 are statistically significant at p< .01. Correlations > .09 are statistically significant at p< .05. Gender (1=F, 0=M), Trade union membership (1=member, 0=nonmember)     - 37 -  Psychological contracts and OCB TABLE 2 (continued) Descriptive statistics and intercorrelations of main study variables 8  9  10 11 12 13 14 1. Gender  T1 2.  Age T1 3. Organizational Tenure T1 4. Trade union membership T1 5. Employer obligations T1 6. Employer inducements T1 7. Norm of reciprocity T3 8. Trust in employer T1 (.90) 9. Procedural justice T2 .38  (.91) 10. Interactional justice T2 .27  .42  (.95) 11. Advocacy participation T3 .07  .09  .11  (.81) 12. Helping  T3 .10 .09 .05  .49  (.80) 13. Functional Participation T3 .16 .13 .13  .57  .46  (.80) 14. Loyalty T3 .34 .32 .29  .32  .18 .45  (.79) 15. Obedience T3 .06 .02 .09  .22  .34 .37 .16  (.63) Correlations >.13 are statistically significant at p< .01. Correlations >.09 are statistically significant at p< .05.     - 38 -  Psychological contracts and OCB","cites":null},{"id":17336002,"title":"Organizational citizenship behavior: Construct redefinition, measurement and validation.","authors":[],"date":"1994","doi":"10.2307\/256600","raw":"Van Dyne, L., Graham, J.W., & Dienesch, R.M. 1994.  Organizational citizenship behavior: Construct redefinition, measurement and validation.  Academy of Management, 37: 765-802.","cites":null},{"id":17335997,"title":"Organizational citizenship behavior: Its nature and antecedents.","authors":[],"date":"1983","doi":"10.1037\/\/0021-9010.68.4.653","raw":"Smith, C.A. Organ, D.W. Near, J.P. 1983.  Organizational citizenship behavior: Its nature and antecedents. Journal of Applied Psychology, 68: 653-663.","cites":null},{"id":17335957,"title":"Organizational Citizenship Behavior: The Good Soldier Syndrome.","authors":[],"date":"1988","doi":"10.2307\/2393071","raw":"Organ, D.W. 1988. Organizational Citizenship Behavior: The Good Soldier Syndrome. Lexington Books: Lexington, MA.","cites":null},{"id":17335965,"title":"Organizational citizenship behaviors and managerial evaluations of employee performance: A review and suggestions for future research.","authors":[],"date":"1993","doi":null,"raw":"Podsakoff, P.M.  MacKenzie, S.B. Hui, C. 1993.  Organizational citizenship behaviors and managerial evaluations of employee performance: A review and suggestions for future research.  In G.R. Ferris (Ed.) Research in Personnel and Human Resources Management. Greenwich, CT: JAI Press, Vol 11, pp. 1-40.","cites":null},{"id":17335967,"title":"Organizational citizenship behaviors: A critical review of the theoretical and empirical literature and suggestions for future research.","authors":[],"date":"2000","doi":"10.1016\/s0149-2063(00)00047-7","raw":"Podsakoff, P.M MacKenzie, S.B Paine, J.B. Bachrach, D.G. 2000.  Organizational citizenship behaviors: A critical review of the theoretical and empirical literature and suggestions for future research.  Journal of Management 26: 513-563.","cites":null},{"id":17335946,"title":"Organizations. Wiley: New York. - 31 - Psychological contracts and OCB","authors":[],"date":"1958","doi":null,"raw":"March, J.G.  Simon, H.A. 1958.  Organizations.  Wiley: New York.   - 31 -  Psychological contracts and OCB McLean Parks, J., & Kidder, D.L 1994.  “Till death us to part….” Changing work relationships in the 1990s”.  In C.L. Cooper and D.M. Rousseau (Eds.) Trends in Organizational Behavior.  London: John Wiley & Sons, Vol 1, pp. 111-136.","cites":null},{"id":17335933,"title":"Perceived fairness of employee drug testing as a predictor of employee attitudes and job performance.","authors":[],"date":"1991","doi":"10.1037\/\/0021-9010.76.5.698","raw":"Konovsky, M.A. Cropanzano, R. 1991.  Perceived fairness of employee drug testing as a predictor of employee attitudes and job performance.  Journal of Applied Psychology, 76: 698-707.","cites":null},{"id":17335896,"title":"Perceived organizational support and police performance: The moderating influence of socioemotional needs.","authors":[],"date":"1998","doi":"10.1037\/\/0021-9010.83.2.288","raw":"Armeli, S. Eisenberger, R. Fasolo, P. Lynch, P. 1998. Perceived organizational support and police performance: The moderating influence of socioemotional needs.  Journal of Applied Psychology, 83: 288-297.","cites":null},{"id":17335996,"title":"Personality as a moderator in the relationship between fairness and retaliation.","authors":[],"date":"1999","doi":"10.2307\/256877","raw":"Skarlicki, D.P. Folger, R. Tesluk, P. 1999. Personality as a moderator in the relationship between fairness and retaliation.  Academy of Management Journal 42: 100-108.","cites":null},{"id":17335936,"title":"Psychological contract breach and the employment exchange: Perceptions from employees and employers. Paper presented at the annual meeting of the Academy of Management,","authors":[],"date":"1998","doi":null,"raw":"Lewis-McClear, K. and Taylor, S. 1998. Psychological contract breach and the employment exchange: Perceptions from employees and employers. Paper presented at the annual meeting of the Academy of Management, San Diego.","cites":null},{"id":17335973,"title":"Psychological contracts and OCB: The effect of unfulfilled obligations on civic virtue.","authors":[],"date":"1995","doi":"10.1002\/job.4030160309","raw":"Robinson, S.L., Morrison, E.W. 1995. Psychological contracts and OCB: The effect of unfulfilled obligations on civic virtue. Journal of Organizational Behavior, 16: 289-298.   - 33 -  Psychological contracts and OCB Robinson, S.L., & Rousseau, D.M. 1994. Violating the psychological contract: Not the exception but the norm. Journal of Organizational Behavior 15: 245-259.","cites":null},{"id":17335931,"title":"Psychological contracts and performance: The role of social exchange. Paper presented at the Annual Meeting of the Academy of Management,","authors":[],"date":"2001","doi":null,"raw":"Irving, P.G Gellatly, I.R. 2001 Psychological contracts and performance: The role of social exchange.  Paper presented at the Annual Meeting of the Academy of Management, Washington D.C. Katz, D. 1964. The motivational basis of organizational behavior.  Behavioral Science 9: 131-133.   - 30 -  Psychological contracts and OCB Kidder, D.L. 1998.  Temporary, part-time and full-time nurses: Psychological contracts and the performance of extra-role behaviors.  Paper presented at the annual meeting of the Academy of Management, San Diego.","cites":null},{"id":17335975,"title":"Psychological Contracts in Organizations. Sage: Thousand Oaks,","authors":[],"date":"1995","doi":null,"raw":"Rousseau, D.M. 1995. Psychological Contracts in Organizations. Sage: Thousand Oaks, CA.","cites":null},{"id":17335914,"title":"Reciprocation ideology.","authors":[],"date":"1987","doi":"10.1037\/t06222-000","raw":"Eisenberger, R. Cotterell, N. Marvel, J. 1987.  Reciprocation ideology. Journal of Personality and Social Psychology 4: 743-750.   - 29 -  Psychological contracts and OCB Folger, R. 1993.  Reactions to mistreatment at work.  In J.K. Murnighan (Ed.) Social psychology in organizations: Advances in theory and research (pp161-183).  Englewood cliffs, NJ: Prentice Hall.","cites":null},{"id":17335913,"title":"Reciprocation of perceived organizational support.","authors":[],"date":"2001","doi":"10.1037\/\/0021-9010.86.1.42","raw":"Eisenberger, R. Armeli, S. Rexwinkel, B. Lynch, P.D Rhoades, L. 2001.  Reciprocation of perceived organizational support.  Journal of Applied Psychology 86: 42-51.","cites":null},{"id":17335948,"title":"Relationship between organizational justice and organizational citizenship behaviors: Do fairness perceptions influence employee citizenship?","authors":[],"date":"1991","doi":"10.1037\/\/0021-9010.76.6.845","raw":"Moorman, R.H. 1991. Relationship between organizational justice and organizational citizenship behaviors: Do fairness perceptions influence employee citizenship? Journal of Applied Psychology 76: 845-855.","cites":null},{"id":17335995,"title":"Retaliation in the workplace: The role of distributive, procedural, and interactional justice.","authors":[],"date":"1997","doi":"10.1037\/0021-9010.82.3.434","raw":"Skarlicki, D.P. Folger, R. 1997. Retaliation in the workplace: The role of distributive, procedural, and interactional justice. Journal of Applied Psychology 82: 434-443.","cites":null},{"id":17335954,"title":"Role definitions and organizational citizenship behavior: The importance of the employees’ perspective.","authors":[],"date":"1994","doi":"10.2307\/256798","raw":"Morrison, E.W. 1994. Role definitions and organizational citizenship behavior: The importance of the employees’ perspective.  Academy of Management Journal 37: 1543-1567.","cites":null},{"id":17335977,"title":"Social and economic exchanges as mediators between commitment and performance.","authors":[],"date":"2002","doi":null,"raw":"Shore, L.M. Tetrick, L.E. Lynch, P. Barksdale, K. 2002. Social and economic exchanges as mediators between commitment and performance.  Unpublished manuscript.","cites":null},{"id":17335976,"title":"Stone Age Economics.","authors":[],"date":"1972","doi":"10.1126\/science.179.4071.372","raw":"Sahlins, M. 1972.  Stone Age Economics.  New York: Aldine De Gruyter.","cites":null},{"id":17335902,"title":"The &quot;anticipatory psychological contract&quot;: Employer\/employee obligations and job choice. Paper presented at the annual meeting of the Academy of Management,","authors":[],"date":"2000","doi":null,"raw":"Blancero, D.M. Kreiner, G.E 2000. The &quot;anticipatory psychological contract&quot;: Employer\/employee obligations and job choice.  Paper presented at the annual meeting of the Academy of Management, Toronto.","cites":null},{"id":17335915,"title":"The effects of procedural justice, distributive justice, and reactions to pay raise decisions.","authors":[],"date":"1989","doi":"10.2307\/256422","raw":"Folger, R. Konovsky, M.A. 1989. The effects of procedural justice, distributive justice, and reactions to pay raise decisions.  Academy of Management Journal 32: 115-130.","cites":null},{"id":17335942,"title":"The effects of psychological contract strength and violation on organizational commitment and organizational justice. Paper presented at the annual meeting of the Academy of Management,","authors":[],"date":"1999","doi":null,"raw":"Liao-Troth, M. 1999.  The effects of psychological contract strength and violation on organizational commitment and organizational justice.  Paper presented at the annual meeting of the Academy of Management, Chicago.","cites":null},{"id":17335898,"title":"The Functions of the Executive.","authors":[],"date":"1938","doi":null,"raw":"Barnard, C.I. 1938.  The Functions of the Executive. Harvard University Press: Cambridge, MA.","cites":null},{"id":17335944,"title":"The impact of formal and interactional procedures on organizational outcomes.","authors":[],"date":"1997","doi":null,"raw":"Malatesta, R.M  Byrne, Z.S. 1997.  The impact of formal and interactional procedures on organizational outcomes.  Paper presented at the 12 th annual conference of the Society for Industrial and Organizational Psychology, St Louis, MO.","cites":null},{"id":17336001,"title":"The impact of psychological contract violations on exit, loyalty and neglect.","authors":[],"date":"1999","doi":"10.1177\/001872679905200703","raw":"Turnley, W.H. Feldman, D.C. 1999. The impact of psychological contract violations on exit, loyalty and neglect. Human Relations, 52: 895-922 Turnley, W.H. Feldman, D.C. 2000. Re-examining the effects of psychological contract violations: unmet expectations and job dissatisfaction as mediators.  Journal of Organizational Behavior, 21: 25-42.","cites":null},{"id":17335960,"title":"The motivational basis of organizational citizenship behavior.","authors":[],"date":"1990","doi":null,"raw":"Organ, D.W. 1990.  The motivational basis of organizational citizenship behavior.  In B.M. Staw & L.L. Cummings (Eds.), Research in Organizational Behavior.  Greenwich, CT: JAI Press, Vol 12, pp. 43-72.   - 32 -  Psychological contracts and OCB Organ, D.W. and Moorman, R.H. 1993.  Fairness and organizational citizenship behavior: What are the connections?  Social Justice Research, 6, 5-18.","cites":null},{"id":17335921,"title":"The norm of reciprocity.","authors":[],"date":"1960","doi":"10.2307\/2092623","raw":"Gouldner, A.W. 1960.  The norm of reciprocity.  American Sociological Review 25: 161-178.","cites":null},{"id":17335897,"title":"The psychological contract: A concept in need of closer scrutiny?.","authors":[],"date":"1996","doi":"10.1080\/13594329608414876","raw":"Arnold, J. 1996. The psychological contract: A concept in need of closer scrutiny?. European Journal of Work and Organizational Psychology 5: 511-520.","cites":null},{"id":17335952,"title":"Treating employees fairly and organizational citizenship behavior: Sorting out the effects of job satisfaction, organizational commitment, and procedural justice.","authors":[],"date":"1993","doi":"10.1007\/bf01419445","raw":"Moorman, R.H. Niehoff, B.P. Organ, D.W. 1993. Treating employees fairly and organizational citizenship behavior: Sorting out the effects of job satisfaction, organizational commitment, and procedural justice.  Employee Responsibilities and Rights Journal, 6: 209-225.","cites":null},{"id":17335971,"title":"Trust and breach of the psychological contract.","authors":[],"date":"1996","doi":"10.2307\/2393868","raw":"Robinson, S.L. 1996. Trust and breach of the psychological contract. Administrative Science Quarterly 41: 574-599.","cites":null},{"id":17335940,"title":"Trust as a social reality.","authors":[],"date":"1985","doi":"10.2307\/2578601","raw":"Lewis, D.J. Weigert, A. 1985.  Trust as a social reality.  Social Forces 63: 967-985.","cites":null},{"id":17335999,"title":"Work status and organizational citizenship behavior: A field study of restaurant employees.","authors":[],"date":"2001","doi":"10.1002\/job.100","raw":"Stamper, C.L. Van Dyne, L. 2001.  Work status and organizational citizenship behavior: A field study of restaurant employees.  Journal of Organizational Behavior 22: 517-536.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2002-12","abstract":"This study examined the contribution of the psychological contract framework to understanding organizational citizenship behavior (OCB) using survey data gathered at three measurement points over a three year period from 480 public sector employees. Separating perceived contract breach into its two components, the data suggest that perceived employer obligations explained unique variance in three dimensions of citizenship behavior (helping, advocacy and functional participation) beyond that accounted for by perceived employer inducements. Employees’ acceptance of the norm of reciprocity moderated the relationship between employer inducements and the dimensions of advocacy and functional participation. Employees’ trust in their employer moderated the relationship between perceived employer obligations and the dimensions of advocacy and functional participation. Contrary to the hypothesis, procedural or interactional justice were not found to moderate the relationship between the psychological contract and OCB. The implications of the findings for psychological contract research are discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/92881.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/831\/1\/JOB_PC_and_OCB.pdf","pdfHashValue":"66032bdfe0ab7b4ffda384d67a8f871dc772337b","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:831<\/identifier><datestamp>\n      2010-10-01T08:44:08Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/831\/<\/dc:relation><dc:title>\n        A psychological contract perspective on organizational citizenship behavior<\/dc:title><dc:creator>\n        Coyle-Shapiro, Jacqueline A.<\/dc:creator><dc:subject>\n        H Social Sciences (General)<\/dc:subject><dc:description>\n        This study examined the contribution of the psychological contract framework to understanding organizational citizenship behavior (OCB) using survey data gathered at three measurement points over a three year period from 480 public sector employees. Separating perceived contract breach into its two components, the data suggest that perceived employer obligations explained unique variance in three dimensions of citizenship behavior (helping, advocacy and functional participation) beyond that accounted for by perceived employer inducements. Employees’ acceptance of the norm of reciprocity moderated the relationship between employer inducements and the dimensions of advocacy and functional participation. Employees’ trust in their employer moderated the relationship between perceived employer obligations and the dimensions of advocacy and functional participation. Contrary to the hypothesis, procedural or interactional justice were not found to moderate the relationship between the psychological contract and OCB. The implications of the findings for psychological contract research are discussed.<\/dc:description><dc:date>\n        2002-12<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/831\/1\/JOB_PC_and_OCB.pdf<\/dc:identifier><dc:identifier>\n          Coyle-Shapiro, Jacqueline A.  (2002) A psychological contract perspective on organizational citizenship behavior.  Journal of Organizational Behavior, 23 (8).  pp. 927-946.  ISSN 1099-1379     <\/dc:identifier><dc:relation>\n        http:\/\/www3.interscience.wiley.com\/journal\/4691\/home<\/dc:relation><dc:relation>\n        10.1002\/job.173<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/831\/","http:\/\/www3.interscience.wiley.com\/journal\/4691\/home","10.1002\/job.173"],"year":2002,"topics":["H Social Sciences (General)"],"subject":["Article","PeerReviewed"],"fullText":""}