{"doi":"10.1103\/PhysRevLett.93.011602","coreId":"66493","oai":"oai:dro.dur.ac.uk.OAI2:1362","identifiers":["oai:dro.dur.ac.uk.OAI2:1362","10.1103\/PhysRevLett.93.011602"],"title":"Effective theory approach to unstable particle production.","authors":["Beneke, M.","Chapovsky, A. P.","Signer, A.","Zanderighi, G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-07","abstract":"Using the hierarchy of scales between the mass M and the width Gamma of a heavy, unstable particle, we construct an effective theory that allows calculations for resonant processes to be systematically expanded in powers of the coupling alpha and Gamma\/M. We illustrate the method by computing the next-to-leading order line shape of a scalar resonance in an Abelian gauge-Yukawa model","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66493.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1362\/1\/1362.pdf","pdfHashValue":"c0669aa0f0854e2e4ec3de449664726d7187a031","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1362<\/identifier><datestamp>\n      2011-08-05T11:47:12Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Effective theory approach to unstable particle production.<\/dc:title><dc:creator>\n        Beneke, M.<\/dc:creator><dc:creator>\n        Chapovsky, A. P.<\/dc:creator><dc:creator>\n        Signer, A.<\/dc:creator><dc:creator>\n        Zanderighi, G.<\/dc:creator><dc:description>\n        Using the hierarchy of scales between the mass M and the width Gamma of a heavy, unstable particle, we construct an effective theory that allows calculations for resonant processes to be systematically expanded in powers of the coupling alpha and Gamma\/M. We illustrate the method by computing the next-to-leading order line shape of a scalar resonance in an Abelian gauge-Yukawa model. <\/dc:description><dc:subject>\n        Effective field-theory<\/dc:subject><dc:subject>\n         Gauge-invariance<\/dc:subject><dc:subject>\n         Heavy quarks.<\/dc:subject><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review letters, 2004, Vol.93, pp.011602 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2004-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1362<\/dc:identifier><dc:identifier>\n        issn:0031-9007<\/dc:identifier><dc:identifier>\n        issn: 1079-7114<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevLett.93.011602<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1362\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevLett.93.011602<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1362\/1\/1362.pdf<\/dc:identifier><dc:rights>\n        © 2004 by The American Physical Society. All rights reserved.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0031-9007"," 1079-7114","issn:0031-9007","issn: 1079-7114"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Effective field-theory","Gauge-invariance","Heavy quarks."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n28 April 2008\nVersion of attached file:\nOther\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBeneke, M. and Chapovsky, A. P. and Signer, A. and Zanderighi, G. (2004) ’Effective theory approach to\nunstable particle production.’, Physical review letters., 93 . 011602.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevLett.93.011602\nPublisher’s copyright statement:\n2004 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 3042 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online 25 April 2008 \n \nCitation for item:  \nBeneke, M. and Chapovsky, A. P. and Signer, A. and Zanderighi, G. (2004) 'Effective \ntheory approach to unstable particle production.' , Physical review letters., 93, 011602. \n \nDefinitive version available at:  \nhttp:\/\/dx.doi.org\/10.1103\/PhysRevLett.93.011602 \nar\nX\niv\n:h\nep\n-p\nh\/\n03\n12\n33\n1v\n1 \n 2\n3 \nD\nec\n 2\n00\n3\nPITHA 03\/13; IPPP\/03\/82; FERMILAB-Pub-03\/407-T; hep-ph\/0312331\nEffective theory approach to unstable particle production\nM. Beneke1, A.P. Chapovsky1, A. Signer2 and G. Zanderighi 3\n1Institut fu¨r Theoretische Physik E, RWTH Aachen, D-52056 Aachen, Germany\n2IPPP, Department of Physics, University of Durham, Durham DH1 3LE, England\n3Fermi National Accelerator Laboratory, Batavia, IL 60510\n(Dated: December 22, 2003)\nUsing the hierarchy of scales between the mass, M , and the width, Γ, of a heavy, unstable particle\nwe construct an effective theory that allows calculations for resonant processes to be systematically\nexpanded in powers of the coupling α and Γ\/M . We illustrate the method by computing the next-\nto-leading order line shape of a scalar resonance in an abelian gauge-Yukawa model.\nPACS numbers: 11.15.Bt, 11.80.Cr\nHigher-order calculations for processes involving mas-\nsive, unstable particles close to resonance suffer from the\nbreakdown of ordinary perturbation theory, since the in-\ntermediate propagator becomes singular. This singular-\nity is avoided if the finite width, Γ, of the unstable parti-\ncle is taken into account in the construction of the prop-\nagator via resummation of self-energy insertions. There\nare a number of approaches along this line to avoid the\nproblem [1]. However, so far there is no method that\nallows to systematically improve the accuracy of calcula-\ntions order by order in perturbation theory. The purpose\nof this letter is to present such a method.\nWe are concerned with processes involving an unstable\nparticle close to resonance. The main idea is to exploit\nthe hierarchy of scales Γ≪M , whereM is the pole mass,\nin order to systematically organize the calculations in a\nseries in the coupling, α, and Γ\/M . While the expan-\nsion in α is standard, we construct an effective theory\nto perform the expansion in Γ\/M . A first step in this\ndirection has been presented in [2]. The main idea of\nour approach is similar to non-relativistic QCD, where\nan expansion in α and the velocity of the heavy quarks is\nmade. We will identify all relevant modes and use them\nto write the operators of the Lagrangian of the effective\ntheory. This Lagrangian is then matched to the underly-\ning theory, using the method of regions [3]. In this letter\nwe will outline the basic idea and we refer to [4] for more\ndetails.\nWe consider a toy model that involves a massive scalar\nfield, φ, and two fermion fields. The scalar as well as\none of the fermion fields, ψ, (the “electron”) are charged\nunder an abelian gauge symmetry, whereas the other\nfermion, χ, (the “neutrino”) is neutral. The model al-\nlows for the scalar to decay into an electron-neutrino pair\nthrough a Yukawa interaction. The Lagrangian is\nL = (Dµφ)†Dµφ− Mˆ2φ†φ+ ψ¯i 6Dψ + χ¯i6∂χ\n− 1\n4\nFµνFµν − 1\n2ξ\n(∂µA\nµ)2\n+ yφψ¯χ+ y∗φ†χ¯ψ − λ\n4\n(φ†φ)2 + Lct , (1)\nwhere Mˆ and Lct denote the renormalized mass and the\ncounterterm Lagrangian and D = ∂ − igA. We define\nαg ≡ g2\/(4π), αy ≡ (yy∗)\/(4π) (at the scale µ) and\nassume αg ∼ αy ∼ α, and αλ ≡ λ\/(4π) ∼ α2\/(4π).\nWe would like to obtain the totally inclusive cross sec-\ntion for the process\nν¯(q) + e−(p)→ X (2)\nas a function of s ≡ (p + q)2 by calculating the forward\nscattering amplitude T (s) and taking its imaginary part.\n(The total cross section of process (2) has an initial state\ncollinear singularity which has to be absorbed into the\nelectron distribution function. In what follows it is un-\nderstood that this singularity is subtracted minimally.)\nIn particular, we are interested in the region s ≈ M2,\nor more precisely s − M2 ∼ MΓ ∼ αM2 ≪ M2. In\nthis kinematic region the cross section is enhanced due\nto the propagator of the scalar. Furthermore, at each\norder in α we get additional contributions proportional\nto αMˆ2\/(s− Mˆ2) ∼ 1 due to self-energy insertions.\nWe now turn to the main part of this letter and dis-\ncuss how to construct the effective theory. Our approach\nis based on the hierarchy of scales Γ ≪ M . Thus, we\nsystematically expand the cross section in powers of α\nand\nδ ≡ s− Mˆ\n2\nMˆ2\n∼ Γ\nM\n. (3)\nIn a theory that formulates this expansion correctly,\nother issues like resummation of self-energy insertions\nand gauge invariance are taken care of automatically.\nIn a first step we integrate out hard momenta k ∼ M .\nThe effective theory will then not contain any longer dy-\nnamical hard modes since their effect is included in the\ncoefficients of the operators. The hard effects are associ-\nated with what is usually called factorizable corrections,\nwhereas the effects of the dynamical modes correspond\nto the non-factorizable corrections [2]. On the level of\nFeynman diagrams, this amounts to using the method of\nregions to separate loop integrals into various contribu-\ntions [3]. The hard part is obtained by expanding the\nintegrand in δ. The difference between the full integral\n2and its hard part has to be reproduced by modes cor-\nresponding to momentum configurations that are near\nmass-shell. The main task is to identify these modes,\nand to write the operators of the effective Lagrangian\nin terms of the corresponding field operators and then\nto compute the coefficients of the operators by matching\n(up to a certain order in α and δ).\nOur goal is to carry out this programme for our model\nto an order in α and δ that is sufficient to compute\nT (0) + T (1), the forward scattering amplitude at next-\nto-leading order (NLO), where T (0) sums up all terms\nthat scale as (α\/δ)n ∼ 1 and T (1) contains all terms that\nare suppressed by an additional power of α or δ.\nThe basic process under consideration is the following:\nwe start with highly energetic fermions, produce a near\nmass-shell scalar which then decays again into highly en-\nergetic fermions. Accordingly we split the effective La-\ngrangian into three parts. Roughly speaking, the first,\nLHSET, describes the heavy scalar field near mass-shell\nand its interaction with the gauge field. The second part,\nLSCET, describes energetic (charged) fermions and their\ninteractions with the gauge field. Finally, the third part,\nLint, describes the external fermions and how they inter-\nact to produce the final state. We will discuss these three\nparts in turn.\nThe construction of LHSET follows closely the construc-\ntion of the effective Lagrangian for heavy quark effec-\ntive theory (HQET) [5]. We write the momentum of the\nscalar particle near resonance as P = Mˆv+ k, where the\nvelocity vector v satisfies v2 = 1 and the residual mo-\nmentum k scales as Mδ. We will call such a scalar field\na “soft” field (in [2] the term “resonant” has been used).\nThus, for a soft scalar field we have P 2 − Mˆ2 ∼Mδ and\nthis remains true if the scalar particle interacts with a soft\ngauge boson with momentum Mδ. In analogy to HQET\nwe remove the rapid spatial variation e−iMˆv·x from the\nφ-field and define\nφv(x) ≡ eiMˆv·x P+φ(x) , (4)\nwhere P+ projects onto the positive frequency part to\nensure that φv is a pure destruction field. We now write\nthe effective Lagrangian in terms of φv and construct the\nbilinear terms so as to reproduce the two-point function\nclose to resonance. Denoting the complex pole of the\npropagator by s¯ and the residue at the pole by Rφ the\npropagator can be written as\ni Rφ\nP 2 − s¯ =\ni Rφ\n2Mˆvk + k2 − (s¯− Mˆ2) . (5)\nWe define the matching coefficient\n∆ ≡ s¯− Mˆ\n2\nMˆ\n(6)\nand aµ⊤ ≡ aµ − (va) vµ for any vector. There are two\nsolutions to P 2 = s¯, one of which is irrelevant since it\nscales as vk ∼ Mˆ . For the other we find\nvk = −Mˆ +\n√\nMˆ2 + Mˆ∆− k2⊤\n=\n∆\n2\n− ∆\n2 + 4k2⊤\n8Mˆ\n+O(δ3), (7)\nwhere we expanded in δ in the second line. Therefore,\nthe bilinear terms are given by\nLφφ = 2Mˆφ†v\n(\niv ·Ds − ∆\n2\n)\nφv\n+ 2Mˆφ†v\n(\n(iDs⊤)\n2\n2Mˆ\n+\n∆2\n8Mˆ\n)\nφv + . . . , (8)\nwhere Ds ≡ ∂ − igAs denotes the soft covariant deriva-\ntive. In obtaining Lφφ we exploited the fact that the\ngauge invariance of the full Lagrangian is not broken by\nthe separation into hard and soft parts. Therefore, the ef-\nfective Lagrangianmust be gauge invariant as well and we\ncan obtain the interaction of the scalar with the soft pho-\nton simply by replacing ∂ → Ds. The gauge invariance of\n∆ follows from the gauge invariance of s¯ and Mˆ . Further-\nmore, ∆ is given entirely by hard contributions, which\njustifies its interpretation as matching coefficient. Using\n(6) we can express it in terms of the hard part of the self-\nenergy Πh(s). Writing Πh(s) = Mˆ\n2\n∑\nk,l δ\nlΠ(k,l), where\nit is understood that Π(k,l) ∼ αk, we obtain\n∆ ≡\n∑\ni\n∆(i) = (9)\nMˆ Π(1,0) + Mˆ\n(\nΠ(2,0) + Π(1,1)Π(1,0)\n)\n+ . . .\nExplicit results for ∆(1) and ∆(2) in the MS and pole\nrenormalization scheme can be found in [4]. Here we\nonly note that in the pole scheme s¯ ≡ M2 − iMΓ, so\n∆ = −iΓ when Mˆ = M . Inserting the expansion (9)\ninto (8) and supplementing Lφφ with the kinetic terms\nfor soft photons and fermions we obtain\nLHSET = 2Mˆφ†v\n(\niv ·Ds − ∆\n(1)\n2\n)\nφv\n+ 2Mˆφ†v\n(\n(iDs,⊤)\n2\n2Mˆ\n+\n[∆(1)]2\n8Mˆ\n− ∆\n(2)\n2\n)\nφv\n− 1\n4\nFsµνF\nµν\ns + ψ¯si 6Dsψs + χ¯si 6∂χs. (10)\nEach term in LHSET can be assigned a scaling power in δ.\nIn momentum space the propagator of the φv field scales\nas 1\/δ. Hence, because\n∫\nd4k counts as δ4, the soft scalar\nfield φv(x) scales as δ\n3\/2. Since ∆(1) ∼ Ds ∼ Mδ, both\nterms in the first line of (8) scale as δ4 and are leading\nterms. The terms in the second line are suppressed by\none power in δ or α. Finally, since Aµs scales as δ and the\nsoft fermion fields scale as δ3\/2 (see [7]) the terms in the\nlast line of (8) scale as δ4. In (8) we have left out terms\n3further suppressed in δ or α. As we will see, they are\nnot needed for the calculation of the line shape at NLO.\nHowever, we stress that the expansion can be performed\nto whatever accuracy is needed.\nWe note that computing the scalar propagator to all\norders in δ using LHSET does not reproduce (5). Instead\nnear resonance we obtain i̟−1Reffφ\/(P\n2 − s¯), where\n̟−1 ≡ (Mˆ2+Mˆ∆−k2⊤)1\/2\/Mˆ = 1+O(δ, α). The differ-\nence in the normalization is taken into account in match-\ning calculations by an additional wave-function normal-\nization factor ̟−1\/2 for each external φv-line in the ef-\nfective theory.\nNext, we turn to the construction of the effective La-\ngrangian, LSCET, associated with the energetic fermions.\nWe need a “collinear” mode to describe a fermion with\nlarge momentum in the say ~n− direction. Such modes\nhave been discussed previously within the context of soft-\ncollinear effective theory (SCET) [6]. The Lagrangian\nhas been worked out to order δ in [7] and we can take\nthe parts relevant to us from there. (What we call “soft”\nhere what is usually called “ultrasoft” in the context of\nSCET and in the power counting our δ corresponds to λ2\nin [7].) For each direction defined by an energetic par-\nticle we introduce two reference light-like vectors, n±,\nwith n2+ = n\n2\n− = 0 and n+n− = 2 and we write the\ncorresponding momentum as\npµ = (n+p)\nnµ−\n2\n+ pµ⊥ + (n−p)\nnµ+\n2\n, (11)\nwhere n+p ∼ M , n−p ∼ Mδ and p⊥ ∼ Mδ1\/2. Given a\ncertain direction n− we introduce the collinear field ψc\nwhich satisfies 6n−ψc = 0. The terms relevant for the\ncalculation of T (0) + T (1) are then given by\nLSCET = ψ¯c\n(\nin−D + i 6D⊥c 1\nin+Dc + iǫ\ni 6D⊥c\n) 6n+\n2\nψc .\n(12)\nSince we are concerned with the forward scattering am-\nplitude, the only directions defined by energetic particles\nare given by the incoming electron and (anti)neutrino.\nThus, we have two sets of collinear modes, one for\nthe incoming electron, ψc1, and one for the incoming\n(anti)neutrino, χc2. Of course, in the case of the neutrino,\nthe covariant derivatives in (12) have to be replaced by\nordinary derivatives. All terms in (12) scale as δ2. Terms\nof order δ5\/2 and δ3 exist, but they are not needed for\nour application, since they would result in contributions\nsuppressed by an additional power of α and, therefore,\ncontribute only at NNLO. Again there is no difficulty in\ngoing to higher orders in the expansion if needed.\nThe last part to consider is Lint. It has to include\noperators that allow the production and decay of the un-\nstable particle. Without introducing additional modes it\nis not possible to include such vertices as ordinary inter-\naction terms in the effective Lagrangian [4]. The reason is\nthat the momenta associated with generic collinear fields\nψc1 and χ¯c2 do not add up to a momentum of the form\nP =Mv+k. Either we have to implement this kinematic\nconstraint on our external states by hand [4] or we have\nto introduce a new “external-collinear” mode. Adopting\nthe second option, we define an external-collinear mode\nwith large momentum in the ~n− direction by assigning it\na momentum Mˆn−\/2 + k, where k ∼ δ. This mode has\nthe same virtuality Mˆδ1\/2 as a generic collinear mode but\nthe momentum is not given by (11), because it has a fixed\nlarge component such that the two incoming fermions\nproduce a scalar near mass shell. For such a mode it is\nuseful to extract the fixed large momentum and to define\nψn\n−\n(x) ≡ eiMˆ\/2 (n−x)P+ ψc1(x), (13)\nand similarly for χn+ . For the purpose of computing\nT (0)+T (1) it is sufficient to take the first term of LSCET,\n(12), with a soft photon only to describe the interaction\nof the external-collinear fermions with the photons\nL± = ψ¯n\n−\nin−Ds\n6n+\n2\nψn\n−\n+ χ¯n+in+∂\n6n−\n2\nχn+ . (14)\nWith the external-collinear modes we can implement\nthe production and decay vertices as interaction terms\nin Lint. It is also convenient to integrate out generic\ncollinear fields and keep only the external-collinear modes\nin the effective theory. Because adding soft fields results\nin a further suppression in δ we then find that we can\nrestrict ourselves to\nLint = C y φvψ¯n\n−\nχn+ + C y\n∗φ†vχ¯n+ψn−\n+ F\nyy∗\nMˆ2\n(\nψ¯n\n−\nχn+\n)(\nχ¯n+ψn−\n)\n, (15)\nwhere C = 1+O(α) and F are the matching coefficients.\nThe external fields scale as δ3\/2. Thus, an insertion of\na φψχ operator results in\n∫\nd4xφvψ¯n\n−\nχn+ ∼ δ1\/2. The\nforward scattering amplitude can be obtained by two in-\nsertions of this operator. Taking into account the scaling\nof the external state 〈ν¯e−| ∼ δ−1 we see that T (0) ∼ α\/δ.\nThe four-fermion operator is suppressed in δ and results\nin a contribution of order α to T . Thus, to compute T (1)\nwe need C(1), the O(α) contribution to the matching co-\nefficient C, while F is only needed at tree level.\nThe coefficient C(1) is obtained by matching the on-\nshell three-point function of a scalar field, an electron and\na neutrino at order yα and at leading order in δ. In par-\nticular, this involves the computation of (the hard part)\nof the vertex diagram, and the additional wave-function\nnormalization factor ̟−1\/2 mentioned above has to be\ntaken into account. For the precise matching equation as\nwell as the explicit result for C(1) we refer to [4]. Here it\nsuffices to say that these are standard loop calculations.\nTo obtain F (0) (the LO contribution to F ) we have to\nmatch the four-point function at tree level, but include\nsubleading terms in δ. The explicit result is F (0) = 1\/4.\n480 90 100 110 120\n10-5\n10-4\n10-3\nFIG. 1: The line shape (in GeV−2) in the effective the-\nory at LO (light grey\/magenta dashed) and NLO (light\ngrey\/magenta) and the LO cross section off resonance in the\nfull theory (dark grey\/blue dashed) as a function of the center-\nof-mass energy (in GeV).\nWe have now completed the construction of the effec-\ntive Lagrangian Leff = LHSET+L±+Lint to an accuracy\nsufficient to compute T at NLO. At leading order there\nis only one diagram, involving two three-point vertices\nand one resonant scalar propagator. We get\niT (0) = −i yy\n∗\n2MˆD [u¯(p)v(q)] [v¯(q)u(p)], (16)\nwhere we defined D ≡ √s− Mˆ −∆(1)\/2. In the effective\ntheory there are three classes of diagrams that contribute\nto T (1). Firstly, there are hard corrections consisting of a\npropagator insertion [∆(1)]2\/4− Mˆ∆(2) as well as a ver-\ntex insertion C(1). Secondly, there is a four-point vertex\ndiagram due to the (ψ¯χ)(χ¯ψ) operator in Lint. The third\nclass are soft-photon loop diagrams, corresponding to the\nnon-factorizable corrections. Adding up all these contri-\nbutions and using the explicit result for C(1) (in the MS\nscheme) [4] we obtain\ni T (1) = i T (0)× (17)[\nag\n(\n3 ln\n−2MˆD\nν2\n+ 4 ln\n−2MˆD\nMˆ2\nln\n−2MˆD\nν2\n− 7 ln −2MˆD\nMˆ2\n− 3\n2\nln\nMˆ2\nµ2\n− 7\n2\n+\n2π2\n3\n)\n+ ay\n(\n2 ln\nMˆ2\nµ2\n− 1\n2\n− iπ\n)\n− [∆\n(1)]2\n8DMˆ +\n∆(2)\n2D −\nD\n2Mˆ\n]\n,\nwhere ai ≡ αi\/(4π). The initial state collinear singular-\nities have been subtracted minimally and we denote the\ncorresponding factorization scale by ν to distinguish it\nfrom the renormalization scale µ.\nWe can now perform the polarization average and take\nthe imaginary part of (T (0) + T (1))\/s. This result de-\nscribes the line shape near resonance with a relative er-\nror of α2. Moving away from the resonance, the relative\nerror becomes of order unity, since δ is not small any\nlonger. To obtain a good description for all values of\n√\ns,\nthe result of the effective theory has to be matched to\nthe off-resonance result of the full theory.\nIn Figure 1 we show the leading order line shape in\nthe effective theory and the tree-level (order α2) cross\nsection off resonance in the full theory. The two results\nagree in an intermediate region where both calculations\nare valid. This allows to obtain a consistent LO result\nfor all values of\n√\ns. We also show the NLO line shape.\nFor the numerical results we have chosen to use the MS\nscheme with αy = αg = 0.1 and αλ = (0.1)\n2\/(4π). The\npole mass is assumed to be M = 100 GeV which results\nin the MS value Mˆ = 98.8 GeV for the LO result and\nMˆ = 99.1 GeV for the NLO result. Furthermore, we have\nchosen a variable factorization scale such that there are\nno large logarithms involving ν. We remark that in order\nto obtain an improved NLO result for the whole region\nof\n√\ns, the NLO line shape would have to be matched to\nthe NLO off-resonance cross section in the full theory.\nThe example considered here is based on a rather sim-\nple toy model. Nevertheless, it allows to address the\nconceptual issues related to unstable particles. The main\nresult is that, using an effective theory approach, calcula-\ntions can be performed in a systematic way in expanding\nin the small quantities α and Γ\/M . Applying our method\nto the Standard Model might require more tedious calcu-\nlations, but the main result remains valid. In particular,\nas discussed in [4], NNLO line-shape calculations now\nappear feasible.\nThe work of M.B. and A.P.C. is supported in\npart by the DFG Sonderforschungsbereich\/Transregio 9\n“Computer-gestu¨tzte Theoretische Teilchenphysik”\n[1] R. G. Stuart, Phys. Lett. B 262 (1991) 113;\nA. Aeppli, G. J. van Oldenborgh and D. Wyler, Nucl.\nPhys. B 428 (1994) 126 [hep-ph\/9312212];\nE. N. Argyres et al., Phys. Lett. B 358 (1995) 339\n[hep-ph\/9507216].\n[2] A. P. Chapovsky, V. A. Khoze, A. Signer and W. J. Stir-\nling, Nucl. Phys. B 621 (2002) 257 [hep-ph\/0108190].\n[3] M. Beneke and V. A. Smirnov, Nucl. Phys. B522 (1998)\n321 [hep-ph\/9711391].\n[4] M. Beneke, A. P. Chapovsky, A. Signer and G. Zanderighi,\nEffective theory calculation of resonant high-energy scat-\ntering, in preparation.\n[5] E. Eichten and B. Hill, Phys. Lett. B234 (1990) 511;\nH. Georgi, Phys. Lett. B240 (1990) 447;\nB. Grinstein, Nucl. Phys. B339 (1990) 253.\n[6] C. W. Bauer, S. Fleming, D. Pirjol, and I. W. Stewart,\nPhys. Rev. D63 (2001) 114020 [hep-ph\/0011336];\nC. W. Bauer, D. Pirjol, and I. W. Stewart, Phys. Rev.\nD65 (2002) 054022 [hep-ph\/0109045].\n[7] M. Beneke, A. P. Chapovsky, M. Diehl and Th. Feldmann,\nNucl. Phys. B 643 (2002) 431 [hep-ph\/0206152].\n"}