{"doi":"10.1080\/0968776020100108","coreId":"14231","oai":"oai:generic.eprints.org:370\/core5","identifiers":["oai:generic.eprints.org:370\/core5","10.1080\/0968776020100108"],"title":"Metadata in the changing learning environment: Developing skills to achieve the blue skies","authors":["Foster‐Jones, Juanita","Beazleigh, Hazel"],"enrichments":{"references":[{"id":1042911,"title":"An idiot's guide to the resource description framework'. Available from: http:\/\/archive.dtscedu.au\/KDU\/reports\/RDF-Idiotl (last accessed 19","authors":[],"date":"1998","doi":null,"raw":"Ianella, R. (1998), 'An idiot's guide to the resource description framework'. Available from: http:\/\/archive.dtscedu.au\/KDU\/reports\/RDF-Idiotl (last accessed 19 December 2001).","cites":null},{"id":1042909,"title":"Application profiles: mixing and matching metadata schemas',","authors":[],"date":"2000","doi":null,"raw":"Heery, R. and Patel, M. (2000), 'Application profiles: mixing and matching metadata schemas', Ariadne, 25, http:\/\/www.ariadne.ac.uklissue25\/app-profiles\/intro.html (last accessed 26 July 2001).","cites":null},{"id":198175,"title":"ASK for Information Retrieval: Part 1, background and theory',","authors":[],"date":"1982","doi":"10.1108\/eb026722","raw":"58Alt-J Volume 10 Number I Belkin, N. I, Oddy, R. N. and Brooks, H. M. (1982), 'ASK for Information Retrieval: Part 1, background and theory', Journal of Documentation, 38 (2), 61-71.","cites":null},{"id":1042913,"title":"Available from: http:\/\/www.eres.ac.uk\/source\/docs\/resl-ou-l.pdf (last accessed 17","authors":[],"date":"2001","doi":null,"raw":"Available from: http:\/\/www.eres.ac.uk\/source\/docs\/resl-ou-l.pdf (last accessed 17 December 2001).","cites":null},{"id":1042912,"title":"Baseline report setting the context for Reusable Educational Software Library (RESL) of SoURCE Project (RESL-OU-1)'.","authors":[],"date":"1999","doi":null,"raw":"Kim, Y., Clarke, S. and Ramsden, A. (1999), 'Baseline report setting the context for Reusable Educational Software Library (RESL) of SoURCE Project (RESL-OU-1)'.","cites":null},{"id":1042915,"title":"htm (last accessed 16","authors":[],"date":"2001","doi":null,"raw":"htm (last accessed 16 May 2001).","cites":null},{"id":198174,"title":"IMS Meta-Data Best Practice and Implementation Guide', version 1.1. Available from: http:\/\/www.imsproject.org (last accessed 25","authors":[],"date":"2000","doi":null,"raw":"Anderson, T. and Wason, T. (2000), 'IMS Meta-Data Best Practice and Implementation Guide', version 1.1. Available from: http:\/\/www.imsproject.org (last accessed 25 October 2001).","cites":null},{"id":1042914,"title":"Overview of the MPEG-7 Standard',","authors":[],"date":"2001","doi":"10.1007\/0-306-46983-9_2","raw":"Martinez, Jose M. (2001), 'Overview of the MPEG-7 Standard', ISO IIEC JTCI\/ SC29\/WG11 N4031. Available from: http:\/\/www.cselt.it\/mpeg\/standards\/mpeg-7\/mpeg-7.","cites":null},{"id":1042908,"title":"Stuff&quot; about &quot;stuff - the differing meanings of &quot;metadata&quot;',","authors":[],"date":"2000","doi":"10.1108\/eb040722","raw":"Dovey, M. J. (2000),' &quot;Stuff&quot; about &quot;stuff - the differing meanings of &quot;metadata&quot;', Vine, 116, 6-13.","cites":null},{"id":1042910,"title":"Using Dublin Core'. Available from: http:\/\/dublincore.org\/documentsl 2000\/0716\/usageguide\/ (last accessed 18","authors":[],"date":"2000","doi":null,"raw":"Hillman, D. (2000), 'Using Dublin Core'. Available from: http:\/\/dublincore.org\/documentsl 2000\/0716\/usageguide\/ (last accessed 18 April 2001).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":"This short paper will examine the importance of metadata and its role in the changing learning environment, beginning with an introduction about what metadata is, and the benefits to be gained from applying it to all academic resources. Two Open University projects, Portfolio and the Reusable Educational Software Library, will be described and used to illustrate how the IMS Learning Resource Metadata scheme is being applied, and the issues that have been encountered by the Open University and how it is attempting to resolve them. The need for change in organizational culture so that metadata becomes part of the creation process, rather than an afterthought, will then be discussed The paper concludes with a glimpse into the blue skies of the future ‐ where all resources will have metadata as standard practice, and institutions can share and utilize their resources effectively","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14231.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/370\/1\/ALT_J_Vol10_No1_2002_Metadata%20in%20the%20changing%20learn.pdf","pdfHashValue":"dcb35ba9948e03c31a0f539bae1e519c7b518e5a","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:370<\/identifier><datestamp>\n      2011-04-04T09:12:15Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/370\/<\/dc:relation><dc:title>\n        Metadata in the changing learning environment: Developing skills to achieve the blue skies<\/dc:title><dc:creator>\n        Foster‐Jones, Juanita<\/dc:creator><dc:creator>\n        Beazleigh, Hazel<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        This short paper will examine the importance of metadata and its role in the changing learning environment, beginning with an introduction about what metadata is, and the benefits to be gained from applying it to all academic resources. Two Open University projects, Portfolio and the Reusable Educational Software Library, will be described and used to illustrate how the IMS Learning Resource Metadata scheme is being applied, and the issues that have been encountered by the Open University and how it is attempting to resolve them. The need for change in organizational culture so that metadata becomes part of the creation process, rather than an afterthought, will then be discussed The paper concludes with a glimpse into the blue skies of the future ‐ where all resources will have metadata as standard practice, and institutions can share and utilize their resources effectively.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2002<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/370\/1\/ALT_J_Vol10_No1_2002_Metadata%20in%20the%20changing%20learn.pdf<\/dc:identifier><dc:identifier>\n          Foster‐Jones, Juanita and Beazleigh, Hazel  (2002) Metadata in the changing learning environment: Developing skills to achieve the blue skies.  Association for Learning Technology Journal, 10 (1).  pp. 52-59.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776020100108<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/370\/","10.1080\/0968776020100108"],"year":2002,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Metadata in the changing learning environment:\ndeveloping skills to achieve the blue skies\nJuanita Foster-Jones and Hazel Beazleigh\nThe Open University\nemail: J.Foster-Jones@open.ac.uk\nThis short paper will examine the importance of metadata and its role in the changing\nlearning environment, beginning with an introduction about what metadata is, and the\nbenefits to be gained from applying it to all academic resources. Two Open University pro-\njects, Portfolio and the Reusable Educational Software Library, will be described and used\nto illustrate how the IMS Learning Resource Metadata scheme is being applied, and the\nissues that have been encountered by the Open University and how it is attempting to resolve\nthem. The need for change in organizational culture so that metadata becomes part of the\ncreation process, rather than an afterthought, will then be discussed The paper concludes\nwith a glimpse into the blue skies of the future - where all resources will have metadata as\nstandard practice, and institutions can share and utilize their resources effectively.\nDefining metadata\nIt is perhaps a reflection of the increasing importance of metadata that the term is now\ncommonplace amongst publishing, computing and library and information communities\nand, as such, subject to many attempts to define it properly. Definitions range from\nsimplistic attempts such as, 'stuff about stuff' (Dovey, 2000), to more comprehensive\nefforts to capture its meaning and purpose fully. Of these, the definition we feel is most\nenlightening states 'metadata describes an information resource. It is the internet-age term\nfor information that librarians traditionally have to put into catalogues, and it most\ncommonly refers to descriptive information about Web resources' (Hillman, 2000).\nThe underlying concept of metadata is not an unfamiliar one. Descriptive information has\nlong been applied to resources to enrich their existence and more recent metadata\ndevelopments simply reflect our need to manage the proliferation of electronic resources\nwith which we now have to cope.\n52\nA\/t-J Volume 10 Number I\nMetadata in the changing learning environment\nAs technology evolves, so the landscape of learning is clearly changing. No longer confined\nto the school, further education, and university education progression, learners can choose\nwhen and how they acquire knowledge, and lifelong and modular learning have become\ncommonly sought after educational experiences. The Open University (OU) has always\noffered its students a flexible approach to learning, so it is perhaps unsurprising that we are\nnow also embracing ways to extend our expertise into new realms of information delivery.\nOur challenge is to meet users' expectations of flexibility and ease of use, prompted by\ntheir experiences of many online environments; by facilitating access to information, so\nthat their efforts may be concentrated on achieving individual objectives, rather than\nmerely searching for the objects to achieve them. We are convinced at the Open University\nthat effective resource description could indeed provide the key to meeting this challenge\nby:\n• enabling users to discover and identify existing materials;\n• providing them with sufficient data to evaluate and distinguish between different\nresources;\n• providing the option to personalize information presented, via a learner's information\nprofile.\nOpen University case studies\nWe will use two OU projects to illustrate the issues raised while implementing metadata,\nPortfolio and the Reusable Educational Software Library (RESL),1 which, although they\ndiffer significantly in their implementation, share the following features:\n• the use of IMS Learning Resource Metadata Specification vl .02;\n• the objective of facilitating reuse of existing materials;\n• a change in responsibility for metadata creation from the hands of experts (information\nprofessionals) to those of the practitioners (content creators).\nPortfolio digital archive\nThe ultimate function of the Portfolio digital archive is to provide a repository for storing,\nlocating and reusing print-masters of all OU course materials. To achieve this, we have\nadopted a phased metadata implementation strategy, selecting in the first instance a\nskeleton set of IMS metadata elements (see Figure 1) in order to test their impact on\nlocating and evaluating records. This was driven by the size of the database (10,000 items\ninitially with 500 items added per month) and the resource implications. We felt that it was\nmore likely to be successful if a small number of elements were chosen. Our test results will\nthen be used to guide subsequent phases of development, which will focus on how users\nmay select items for reuse on the basis of pedagogical rationale, using educational\nelements.\nCurrently, metadata is being added retrospectively to each item within the archive, which is a\nhuge and possibly insurmountable task, as approximately 500 new items are being added to\nthe archive every month. Work is therefore in progress to develop tools that will facilitate\n53\n]uanita Foster-Jones and Hazel Beazleigh Metadata in the changing learning environment\nPortfolio Metadata\neducational El*tn*nts\nL«—wing K M M V C * Typ*\nClassification Elements\nClassification Scheme\nKeywords tor Classificition\ntroad Subject Citegoi)\n|EatSdnctt\nRelation Elements\nRelation Type\nFigure \/: Portfolio Metadata Elements - Phase I: IMS descriptive elements have been used for\nPortfolio, in conjunction with other University projects to secure its future interoperability with other\nrepositories\n54\nAlt-] Volume 10 Number I\nconcurrent, author-generated metadata - a goal shared by other projects within the OU -\nwithin the course production workflow. This will ensure that authors will not be burdened\nwith additional work, but that metadata they already generate is systematically collected.\nRESL\nThe Reusable Educational Software Library (RESL) is a strand of the SoURCE (Software\nUse, Reuse and Customization in Education) TLTP project.3 RESL originally aimed to test\nthe feasibility of a national software library through the creation of a prototype and\nencourage academics to add examples of software to the prototype. This concept was later\nexpanded to encompass case studies created by SoURCE and other TLTP projects in order\nto enhance the feasibility study, whilst facilitating the dissemination of information.\nPotential users of RESL were identified as software developers, academics and\nadministrators, who would each have different needs. These were investigated in RESL-\nOU-1 (available from RESL), and resulted in the use of four different controlled\nvocabularies, with terminology aimed at satisfying the different information needs.\nIt was assumed that academics would have little experience of metadata creation, so data\nentry templates were created. These were converted into data entry forms, presenting the\nmetadata author with only the fields, required for a specific type of resource to ensure\nconsistency and quality of metadata supplied. A final proofing stage was also built into the\nworkflow as part of the quality control process. The use of controlled vocabularies,\nrepresented as 'pick lists' in the data entry templates, maintained authority control, whilst\nfree text keywords allowed a degree of flexibility for the metadata submitter. The\ncontrolled subject vocabularies are also used as browse lists on the search interface, linking\nmetadata to the information retrieval process. This recognizes the fact that searchers may\nnot have a clear idea of what it is they are looking for, or be able to articulate it (Belkin,\n1982). By providing browse lists, searchers have a starting-point to guide them to the\nresources, which will, we hope, lead to a match for their needs.\nRESL implements selected elements from all of the IMS categories. Additional project-\nspecific metadata elements have also been added to fulfil certain project needs, but only\nafter much deliberation since they could impinge upon interoperability. Interoperability\nwas seen as highly desirable; if RESL becomes a national database we would wish to share\nrecords with other sources. Where IMS was extended, it was only after we had checked that\nno other field was suitable for our purpose, and only if we felt that the field would give\nbenefit to the users, or increase the functionality of the database. For example, we added a\n'date last visited' field after the URL, so that users had an idea of the currency of the\ninformation provided. We also added a project field to the metametadata screen, allowing\nprojects to submit their project URL and logo, thus identifying resources they had\nsubmitted. It was felt that this would encourage other TLTP projects to add resources. It\nshould also be noted that RESL does not use XML binding for its metadata, due to time\nand resource constraints.4 If the project were to be scaled, then XML would need to be\nconsidered to ensure interoperability with other IMS compliant systems.\nIssues\nFor both projects, the primary concern was to determine whether to use an existing\nmetadata schema, or to create an OU-specific schema. In both instances we decided to\n55\nJuanita Foster-Jones and Hazel Beazkigh Metadata in the changing learning environment\nadopt an existing schema. This ensured that time was not wasted in duplicating effort, and\nwould facilitate future interoperability. IMS was chosen for its semantic density, in\nparticular for the educational elements. The OU also has a responsibility as joint partners\nin CETIS to contribute to IMS development and thus, by implementing our metadata, we\ncan then feed our experiences into future revisions. However, adoption of this schema has\nidentified a number of issues.\nThe IMS metadata model consists of nine categories, with a total of sixty element tags for\ndescribing a learning resource, all of which are optional. Having decided upon using IMS,\nwe then needed to select which elements to implement. Different projects have different\nneeds, and so will use a variety of element combinations. In addition, we also needed to\ndecide on the depth of description to give. For Portfolio, a staged approach was taken,\nstarting with a minimum number of elements with the option to increase as required,\nwhereas for RESL a comprehensive approach was taken, implementing a large number of\nelements to test the IMS metadata. Portfolio used the staged approach for two reasons.\nFirstly, due to the sheer size of the database, choosing a limited number of elements to\ncomplete would ensure more items were given metadata. Secondly, Portfolio was\ninvestigating the levels of granularity to which metadata should be added, that is, should\nmetadata be added at the item, chapter or paragraph level. A small set of metadata would\nfacilitate this.\nFor RESL we wanted to take advantage of the semantic density of the IMS schema, to\nfacilitate in resource identification and evaluation. For example, in the technical category,\nIMS provides a number of elements which describe the hardware and software\nrequirements of the resource. These were felt to be of use to the end user, as they would\nprovide an indication of what equipment is required to access the learning resources\ndescribed on the database. Institutions will need to decide what level of metadata entry\nthey can resource.\nSelecting appropriate elements has proved to be no simple task. In some cases this has been\nhampered by the lack of examples provided with IMS specifications. Our experience has\nshown that descriptions within the guidelines can be complex and difficult to interpret, due\nto their terminology and technical bias. Although we were approaching this as qualified\nlibrarians, and thus as experts in metadata, we have still experienced difficulties. To this end\nwe have decided to look at all metadata elements within the IMS specification, and give\nexamples of how they may be used within the OU context. This will make adoption by\nother projects easier, and encourage a standardized implementation.\nWhere IMS specifications refer to other documents for best practice it can be difficult to\nlocate the relevant part, as you are referred to a main site. Some of the documents referred\nto are also aimed at users with technical backgrounds, and can be complex to read and\nunderstand, often hindering progress.\nIt should also be noted that IMS did not meet all requirements of either project, although\nwe recognize that it is unlikely that any standard would accomplish this. Both Portfolio and\nRESL have had to make decisions about whether to add metadata elements to the schema.\nThis was addressed with caution, on the understanding that any deviance would impinge\non interoperability. Where additional fields were added, it was only after all IMS elements\nhad been considered for their suitability. Guidelines within the IMS Meta-Data Best\n56\nAlt-J Volume 10 Number i\nPractice and Implementation Guide (Anderson and Wason, 2000) on extending IMS\nwould have been welcome.\nFinally there is the fact that IMS is a specification, and hence susceptible to revision. A\nplan of action needs to be determined to review each new version, and decide to what\nextent any changes should be implemented. It may be that metadata is upgraded for new\nitems, but those using the old schema are left unrevised due to lack of resources.\nLessons learnt\nThe OU is still in the early stages of metadata implementation. As we become more\nexperienced in our use of metadata, we shall be able to address some of the issues raised by\nthese two projects. As further projects recognize the importance of metadata, it is likely\nthat new issues will be raised. There is still a considerable amount of work to be done to\nensure that metadata is created and exploited to its full potential, and that the issues\nidentified above are overcome.\nExperience from Portfolio has shown that retrospective metadata application to existing,\npopulated databanks is a Herculean task. Methods of creating metadata automatically at\nthe point of item creation would help address this but would require working practices to\nchange, to make metadata generation an integral aspect of authorship. Tools such as DC-\ndot5 and the Sun Microsystems Developers toolkit6 can assist in this automatic generation\nof metadata, and work will need to be carried out to investigate their effectiveness, and\nthen compare the quality of metadata generated by tools such as these with manually\ngenerated metadata.\nFor any such change to be successful it requires authors to become stakeholders, and to\nshare ownership of metadata. To do this we must first prove its value, by making resource\nlocation more effective and by removing fears of extra work by automating the process as\nmuch as possible. The OU is currently examining the use of XML style-sheets to see if they\ncan provide a workable solution.\nMetadata needs to be an integral part of an institution's information strategy. Recognition\nand support for metadata is required from the top of an organization's structure. Only with\nofficial recognition will it be possible to put measures in place for a standardized approach\nto metadata creation and quality control. Within the OU a Metadata Working Group has\nbeen created, to provide recommendations for a metadata strategy. This will be presented\nto OU boards for approval, and by so doing will set metadata firmly on the OU agenda.\nThere is also a need for implementers to share implementation and best practice examples,\nand to build communities of practice. Given that many metadata schemas are not yet\nstandards, there is an opportunity for early adopters to influence their further develop-\nment.\nBlue skies\nIt is too easy to become distracted by the obstacles and issues to be overcome, and to\nquestion the relevance of metadata. But it is crucial that we invest our efforts and resources\nin this developmental phase so that we can contribute to the evolution of metadata\nstandards, using our experiences to create one that best suits our needs.\n57\nJuanita Foster-Jones and Hazel Beazleigh Metadata in the changing learning environment\nWe should not lose sight of the ultimate objectives of this exercise, which are to locate,\nshare and reuse the learning resources that are the assets of our organization. Like\ninformation, a resource is only valuable if it can be found and utilized in time. 'The value\nof information often depends on how easily it can be found, retrieved, accessed, filtered\nand managed' (Martinez, 2001).\nPerhaps the way forward to achieving interoperability will be through the use of\napplication profiles. Application profiles 'consist of data elements drawn from one or more\nnamespace schemas combined together by implementers and optimised for a particular\nlocal application' (Heery and Patel, 2000). In the blue skies of the future there will be a\nregistry in which application profiles are stored. These will be accessible to implementers,\nso that they can benefit from work already completed, and to creators of metadata tools,\nto assist with the development of metadata creation and information retrieval processes\nthat take into account this 'pick and mix' approach to metadata.\nUtilization of the Resource Description Framework (RDF)7 will contribute to this tailored\nmetadata approach:\nThe Objective of RDF is to support the interoperability of metadata. RDF allows\ndescriptions of Web resources - any object with a Uniform Resource Identifier (URI) as\nits address - to be made available in machine understandable form. This enables the\nsemantics of objects to be expressible and exploitable. Once highly deployed, this will\nenable services to develop processing rules for automated decision-making about Web\nresources. (Iannella, 1998)\nRDF allows a resource to be described using elements from multiple schemas, in effect\nproviding the structure for application profiles.\nThe aim of all metadata is to make resource location possible. We value libraries for\nstructuring and managing books for research, therefore we should no less value metadata\ncreators for structuring and managing our learning resource assets. At the OU we are\nmaking a commitment to metadata standards, to ensure the future accessibility of all our\nassets.\nNotes\n1\n RESL: http:\/\/www.resl.ac.uk\/ (last accessed 17 December 2001).\n2\n IMS: http:\/\/www. imsproject. orglindex. html (last accessed 2 January 2002).\n3\n SoURCE: http:\/\/www.source.ac.uk\/ (last accessed 4 October 2001).\n4\n A full list of RESL metadata elements, and associated rationale can be found in RESL-\nOU-4 and RESL-OU-5 on the SoURCE Web site http:\/\/www.source.acuk\/.\n5\n DC-dot: http:\/\/www.ukoln.ac.uk\/metadataldcdot\/ (last accessed 17 December 2001).\n6\n Sun Microsystems Developers Toolkit: http:\/\/www.imsproject.org\/tools\/sun.html (last\naccessed 17 December 2001).\n7\n RDF: http:\/\/www. w3. org\/RDF\/ (last accessed 2 January 2002).\nReferences\nAnderson, T. and Wason, T. (2000), 'IMS Meta-Data Best Practice and Implementation\nGuide', version 1.1. Available from: http:\/\/www.imsproject.org (last accessed 25 October 2001).\n58\nAlt-J Volume 10 Number I\nBelkin, N. I , Oddy, R. N. and Brooks, H. M. (1982), 'ASK for Information Retrieval: Part\n1, background and theory', Journal of Documentation, 38 (2), 61-71.\nDovey, M. J. (2000),' \"Stuff\" about \"stuff - the differing meanings of \"metadata\"', Vine,\n116, 6-13.\nHeery, R. and Patel, M. (2000), 'Application profiles: mixing and matching metadata\nschemas', Ariadne, 25, http:\/\/www.ariadne.ac.uklissue25\/app-profiles\/intro.html (last accessed\n26 July 2001).\nHillman, D. (2000), 'Using Dublin Core'. Available from: http:\/\/dublincore.org\/documentsl\n2000\/0716\/usageguide\/ (last accessed 18 April 2001).\nIanella, R. (1998), 'An idiot's guide to the resource description framework'. Available from:\nhttp:\/\/archive.dtscedu.au\/KDU\/reports\/RDF-Idiotl (last accessed 19 December 2001).\nKim, Y., Clarke, S. and Ramsden, A. (1999), 'Baseline report setting the context for\nReusable Educational Software Library (RESL) of SoURCE Project (RESL-OU-1)'.\nAvailable from: http:\/\/www.eres.ac.uk\/source\/docs\/resl-ou-l.pdf (last accessed 17 December\n2001).\nMartinez, Jose M. (2001), 'Overview of the MPEG-7 Standard', ISO IIEC JTCI\/\nSC29\/WG11 N4031. Available from: http:\/\/www.cselt.it\/mpeg\/standards\/mpeg-7\/mpeg-7.\nhtm (last accessed 16 May 2001).\n59\n"}