{"doi":"10.1109\/16.7429","coreId":"69438","oai":"oai:eprints.lancs.ac.uk:26797","identifiers":["oai:eprints.lancs.ac.uk:26797","10.1109\/16.7429"],"title":"A fast large-signal model for coupled-cavity TWTS.","authors":["Srivastava, V.","Carter, Richard G."],"enrichments":{"references":[{"id":1002830,"title":"Analysis ofLinear Systems.","authors":[],"date":"1959","doi":null,"raw":"[IO]  D. K. Cheng, Analysis ofLinear Systems.  Reading, MA: AddisonWesley, 1959. *","cites":null},{"id":1000961,"title":"Calculations of coupled cavity TWT performance,”","authors":[],"date":"1975","doi":null,"raw":"[2]  J. R.  M.  Vaughan,  “Calculations  of coupled  cavity  TWT performance,” IEEE  Trans. Electron  Devices, vol.  ED-22, pp. 880-890, 1975.","cites":null},{"id":1003385,"title":"Carter graduated in physics from Queens’ College Cambridge In","authors":[],"date":"1965","doi":null,"raw":"Richard  G. Carter  graduated  in  physics  from Queens’ College Cambridge In  1965 and received the Ph.D. degree from the University of Wales In 1968 for work on wave propagation on neutralized ion beams under the supervision of Dr. R. H. C. Newton.","cites":null},{"id":1003664,"title":"Carter is a Chartered Engineer and a Member of the Institution of Electncal Engineers (U K.). Authorized licensed use limited to:","authors":[],"date":"2009","doi":null,"raw":"Dr. Carter is a Chartered Engineer and a Member of the Institution of Electncal Engineers (U K.). Authorized licensed use limited to: Lancaster University Library. Downloaded on July 27, 2009 at 04:30 from IEEE Xplore.  Restrictions apply.","cites":null},{"id":1001207,"title":"Computer program for analysis of coupled-cavity traveling-wave tubes,” NASA Rep.","authors":[],"date":"1977","doi":null,"raw":"[3]  D. J. Connolly and T. A. O’Malley, “Computer program for analysis of  coupled-cavity  traveling-wave  tubes,”  NASA  Rep.  TND-8492, May  1977.","cites":null},{"id":1002036,"title":"Con$ Microwave and Optical Generation and Amplification, [7] D. Van Tassel, Program Style, Design, Eficiency, Debugging, and Testing. Englewood Cliffs,","authors":[],"date":"1978","doi":null,"raw":"6th Int. Con$  Microwave and Optical Generation and Amplification, [7]  D. Van Tassel, Program Style, Design, Eficiency, Debugging, and Testing.  Englewood Cliffs, NJ: Prentice-Hall,  1978.","cites":null},{"id":1002580,"title":"Effect of boundaries on the space charge potential in coupled-cavity travelling wave tubes,”","authors":[],"date":"1986","doi":null,"raw":"[9]  V. Srivastava and R. G. Carter,  “Effect of boundaries on the space charge potential in coupled-cavity travelling wave tubes,” IEE Proc., vol. 133, pt. I, no. 5,  pp. 185-188,  1986.","cites":null},{"id":1001472,"title":"Large signal theory and computation for coupled-cavity TWTs,” Acta Electron.","authors":[],"date":"1984","doi":null,"raw":"[4]  W.-M. Sung, “Large signal theory and computation for coupled-cavity TWTs,” Acta Electron. Sin.,  vol. 12, no. 3, pp. 25-32,  1984. [5] R. W. Hamming, Numerical  Methods for Scientists  and Engineers.","cites":null},{"id":1002328,"title":"Method for calculating the properties of coupled cavity slow wave structures from their dimensions,”","authors":[],"date":"1986","doi":null,"raw":"[8]  R. G. Carter and L. Shun-kang,  “Method for calculating the properties of coupled cavity slow wave structures from their dimensions,” IEE Proc., vol. 133, pt. H, no. 5,  pp. 330-334,  1986. pp. 49-53,  1966.","cites":null},{"id":1000708,"title":"Power Travelling Wave Tubes.","authors":[],"date":"1964","doi":null,"raw":"[l] J. F. Gittins, Power Travelling  Wave Tubes.  London: English Universities Press,  1964.","cites":null},{"id":1001773,"title":"Smallsignal and large-signal theories for the coupled-cavity TWT,” in","authors":[],"date":"1973","doi":null,"raw":"New York: McGraw-Hill, 1973. [6]  G.  S. Kino, Y. Hiramatsu, W. A. Harman, and J. A. Ruetz, “Smallsignal and large-signal theories for the coupled-cavity TWT,” in Proc.","cites":null},{"id":1003120,"title":"Vishnu Srivastava was born in Ajmer, India on","authors":[],"date":"1953","doi":null,"raw":"Vishnu Srivastava was born  in Ajmer, India on November 22,  1953. He  received the B.Sc. and M.Sc. degrees from the University of Rajasthan, Jaipur, India, in 1973 and 1975, respectively,  and the Ph.D. degree in engineering from the University of Lancaster, Lancaster, United Kingdom, in 1987. His Ph.D.  dissertation  concerns the largesignal modeling of coupled-cavity TWT’s.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1988-11","abstract":"A fast and accurate one-dimensional large-signal model for coupled-cavity TWTs has been developed that can be used interactively for the optimization of a TWT design. Different modeling techniques for enhancing the speed of the large-signal model with no loss in accuracy are discussed. It has been shown that the speed of the model can be increased by (1) suitable selection of the basic integration parameters such as the number of electron discs per RF cycle and number of integration steps per cavity, (2) choosing a suitable method of integration of the relativistic equation of motion, (3) optimizing the iteration processes through each cavity and each section, and (4) efficient calculation of the space-charge forces. The model has been tested for the low-space-charge high-efficiency NASA CTS 200-W tube and for a high-space-charge high-gain tube. The characteristics of a 58-cavity tube for a single value of input power and frequency can be computed in less than 1.5 min of CPU time on a VAX 11\/785 computer. This is at least 5 to 6 times faster than the previous models with the same accuracy","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69438.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/26797\/1\/getPDF8.pdf","pdfHashValue":"18243bb88745ba0bae04db3b7cfbfe97cfdedec3","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:26797<\/identifier><datestamp>\n      2018-01-01T04:04:07Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:544B<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A fast large-signal model for coupled-cavity TWTS.<\/dc:title><dc:creator>\n        Srivastava, V.<\/dc:creator><dc:creator>\n        Carter, Richard G.<\/dc:creator><dc:subject>\n        TK Electrical engineering. Electronics Nuclear engineering<\/dc:subject><dc:description>\n        A fast and accurate one-dimensional large-signal model for coupled-cavity TWTs has been developed that can be used interactively for the optimization of a TWT design. Different modeling techniques for enhancing the speed of the large-signal model with no loss in accuracy are discussed. It has been shown that the speed of the model can be increased by (1) suitable selection of the basic integration parameters such as the number of electron discs per RF cycle and number of integration steps per cavity, (2) choosing a suitable method of integration of the relativistic equation of motion, (3) optimizing the iteration processes through each cavity and each section, and (4) efficient calculation of the space-charge forces. The model has been tested for the low-space-charge high-efficiency NASA CTS 200-W tube and for a high-space-charge high-gain tube. The characteristics of a 58-cavity tube for a single value of input power and frequency can be computed in less than 1.5 min of CPU time on a VAX 11\/785 computer. This is at least 5 to 6 times faster than the previous models with the same accuracy.<\/dc:description><dc:date>\n        1988-11<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/26797\/1\/getPDF8.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/16.7429<\/dc:relation><dc:identifier>\n        Srivastava, V. and Carter, Richard G. (1988) A fast large-signal model for coupled-cavity TWTS. IEEE Transactions on Electron Devices, 35 (11, Pa). pp. 2068-2076. ISSN 0018-9383<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/26797\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1109\/16.7429","http:\/\/eprints.lancs.ac.uk\/26797\/"],"year":1988,"topics":["TK Electrical engineering. Electronics Nuclear engineering"],"subject":["Journal Article","PeerReviewed"],"fullText":"2068 IEEE TRANSACTIONS ON ELECTRON DEVICES. VOL. 35. NO. I I .  NOVEMBER 1988 \nA Fast Large-Signal Model for Coupled-Cavity \nTWT’s \nVISHNU SRIVASTAVA AND RICHARD G. CARTER \nAbstract-A fast and accurate one-dimensional large-signal model \nfor coupled-cavity TWT’s has been developed that can be used inter- \nactively for the optimization of a TWT design. Different modeling tech- \nniques for enhancing the speed of the large-signal model with no loss \nin accuracy are discussed in this paper. It has been shown that the \nspeed of the model can be increased by 1) suitable selection of the basic \nintegration parameters such as the number of electron discs per RF \ncycle and number of integration steps per cavity, 2) choosing a suitable \nmethod of integration of the relativistic equation of motion, 3) optim- \nizing the iteration processes through each cavity and each section, and \n4) efficient calculation of the space-charge forces. The model has been \ntested for the low-space-charge high-efficiency NASA CTS 200-W tube \nand for a high-space-charge high-gain tube. The characteristics of a \n58-cavity tube for a single value of input power and frequency can be \ncomputed in less than 1.5 min of CPU time on a VAX 11\/785 computer. \nThis is at least 5 to 6 times faster than the previous models with the \nsame accuracy. \nI. INTRODUCTION \nOUPLED-CAVITY traveling-wave tubes [ 11 are C high-power broad-band microwave amplifiers. These \ndevices are widely used in space communications and in \nmodern radar systems because of their unique character- \nistics of high gain, wide bandwidth, and high average \npower handling capability. They have many other favor- \nable characteristics such as linear phase response and low \nnoise. In the operation of these devices, the amplification \nof the RF wave is produced by the interaction between an \nelectron beam and the electromagnetic wave propagating \nalong a bandpass coupled-cavity slow-wave structure. The \ncoupled-cavity structure is severed into sections in order \nto achieve higher gain without regenerative instabilities, \nand the phase velocity of the circuit is reduced near the \noutput (velocity taper) in order to obtain higher electronic \nefficiency. \nA theoretical analysis of the large-signal behavior of a \ncoupled-cavity TWT is of immense interest because a tube \nis normally operated near to the maximum available out- \nput power. However, the computer simulation of a cou- \npled-cavity TWT to analyze the electron-wave interaction \nManuscript received March 18, 1988; revised July 26, 1988. This work \nwas supported in part by the English Electric Valve Company, Ltd. V. \nSrivastava was supported under a scholarship from the Association of Com- \nmonwealth Universities. \nV. Srivastava was on leave with the Department of Engineering, Uni- \nversity of Lancaster, Lancaster LA1 4YR, United Kingdom. He is with the \nCentral Electronics Engineering Research Institute, Pilani, India. \nR. G. Carter is with the Department of Engineering, University of Lan- \ncaster, tancaster, LA1 4YR, United Kingdom. \nIEEE Log Number 8823888. \nprocess is very complicated at large-signal level. There- \nfore, computer models have been developed with a num- \nber of simplifying assumptions to make them fast enough \nto run interactively while retaining the desired accuracy \nand flexibility. Vaughan [2] developed a one-dimensional \nlarge-signal model of a coupled-cavity TWT with partic- \nular emphasis on increasing the speed of the program. \nConnolly and O’Malley [3] and Sung [4] improved \nVaughan’s model for better accuracy. These models take \ntypically 10 to 20 min of CPU time for converged output \nfor the NASA CTS 200-W tube. Therefore, it was desir- \nable to further improve the speed of the large-signal pro- \ngram. \n11. THE LARGE-SIGNAL NALYSIS \nThe large-signal analysis has been made for single-fre- \nquency operation of a coupled-cavity TWT (monochro- \nmatic operation) and for an unmodulated beam at the tube \nentrance. The analysis has been done on a cavity-by-cav- \nity basis and under the fundamental assumption of one- \ndimensional electron motion. For the analysis, the enter- \ning beam in one RF cycle is divided into a number of \nequal cylindrical charge discs (Fig. 1) and each charge \ndisc is tracked in the laboratory frame whose coordinate \nsystem has its origin at the beginning of the first cavity. \nEach cavity is divided into a number of equal parts of \nlength Az as shown in Fig. 2. The shooting method [5] \nhas been used for solving the large-signal equations. The \nmethod uses stepping-in-distance through each cavity; the \nequation of motion for each charge disc is integrated at \neach distance step in the presence of the RF circuit field \nand space-charge field forces. The fundamental compo- \nnent of the RF beam current is calculated at each step of \nintegration by Fourier analyzing the distribution of the \nelectrons over one RF cycle. The RF beam current at each \nstep is then used to calculate the forward- and backward- \ninduced voltage components in a cavity by integrating in- \ndividual induced current components over the cavity pe- \nriod using Simpson’s rule [ 5 ] .  \nSince the resultant RF circuit field in a cavity depends \non the electron trajectories and vice versa, this calculation \nis iterated through the cavity until a converged solution is \nobtained. This process is repeated for each cavity of a \nsection in turn, and then the process is iterated through \nthe section to account for the backward wave. The above \nanalysis is repeated for each section of a tube until the last \nsection, which finally gives the tube performance at a sin- \n0018-9383\/88\/1100-2068$01 .OO @ 1988 IEEE \nAuthorized licensed use limited to: Lancaster University Library. Downloaded on July 27, 2009 at 04:30 from IEEE Xplore.  Restrictions apply. \nSRIVASTAVA AND CARTER: FAST LARGE-SIGNAL MODEL FOR COUPLED-CAVITY TW1 ' S  \nL- - \nFig. 1. Representation of the electron beam in one RF cycle by disc model \n( b  is the beam radius, d is the disc thickness, and A, is the beam wave- \nlength). \n- \nforward  i n t e g r a t i o n  \nI j k A Z k  \n> -  \n- 5CCt  i o n  >ever ---- sectiori  \n1 2 \nI I \nfo rward  in tegrat ion \n- + \nFig. 2.  Division of a cavity period into small steps for forward integration \nwithin a cavity ( L  is the cavity period divided into small steps A z  in \ncavity K ) .  \nfo rward  i n t e g r a t i o n  \nl o r  induced gap f i e l d  \nI I \n(c) \nFig. 3. Basic iteration mechanism during the forward integration process. \n(a) Single cavity (b) Circuit section (more than one cavity). (c) Tube \n(combination of circuit sections and severs). \ngle value of frequency and drive power. The whole pro- \ncess is iterated through the tube to analyze the tube per- \nformance for different cases. Fig. 3 illustrates the basic \nmechanism of the forward integration process as used by \nKino et al. [6]. In the analysis, the working equations are \nprimarily the same as given by Connolly and O'Malley \n[3] except that some of these equations have been cor- \nrected (see the Appendix). \n2069 \n111. MODELING TECHNIQUES FOR A FAST COMPUTER \nMODEL \nDifferent modeling techniques have been investigated \nto increase the speed of the one-dimensional large-signal \nprogram as much as possible without loss of accuracy. \nThe structure of the program and programming tech- \nniques were also optimized to increase the program effi- \nciency [7]. The modeling techniques are discussed below \nusing as illustrations the results obtained from the pro- \ngram for the low-space-charge high-efficiency NASA CTS \n200-W tube and for a high-space-charge (beam perveance \nof 1.22 ,up) high-gain EEV tube. \nA .  Integration Parameters \nIn the program, provisions have been made for the \nchoice of the basic integration parameters, i.e. the num- \nber of electron discs per beam wavelength and the number \nof integration steps per cavity. This is very useful for in- \ncreasing the speed and accuracy of the program. \nI )  Number of Discs per  RF Cycle: In general, the ac- \ncuracy of the solution increases with the number of discs \nper RF cycle ( N d ) ,  but so does the required computation \ntime and the storage space on a computer. Because the \nspace-chaige force on every representative electron must \nbe calculated as a function of the relative position of every \nother electron, the computation time increases rapidly with \nthe increase of the number of discs per RF cycle. The \nprovision for selecting different numbers of electron discs \nper RF cycle along the tube is based on the following re- \nsults. \nFig. 4(a) shows the CPU time and the output efficiency \nversus number of discs per RF cycle used for computation \nof the high-space-charge tube. The drive power is chosen \nnear to the saturation drive level of the tube. Fig. 4(b) \nshows profiles of the Fourier fundamental component of \nthe RF beam current ( Z l \/ Z o )  along the tube for different \nnumber of discs per RF cycle. Both figures show the self- \nconsistency of the tube ourput after 20 discs per RF cycle, \nbut the CPU time is increasing almost parabolically. The \nself-consistency of the model was also checked for drive \npower above the saturation drive. It has been concluded \nfrom the results of different cases that, for calculation up \nto and including saturation, 24 discs per RF cycle are suf- \nficient. Beyond saturation, more discs (36 or 48) should \nbe used especially for high-efficiency tubes where de- \nbunching of the beam is high at the output. \nIt is obvious from Fig. 4(a) and (b) that an efficient \nnumerical algorithm is possible if the number of discs per \nRF cycle is chosen to be small in the linear region and \nincreased subsequently near to the saturation region. The \nprogram has been modified to choose 12 discs per RF \ncycle up to a cavity in the linear region where the number \nof disc,s per RF cycle is increased to 24 by an interpolation \nmethod. The interpolation of the trajectory data from 12 \nto 24 discs must satisfy the conditions that the kinetic en- \nergy of the beam and the fundamental RF beam current \nare conserved. Since in the linear region the electron tra- \njectories are almost linear, the following techniques are \nAuthorized licensed use limited to: Lancaster University Library. Downloaded on July 27, 2009 at 04:30 from IEEE Xplore.  Restrictions apply. \nIEEE TRANSACTIONS ON ELECTRON DEVICES, VOL. 35. NO. I I ,  NOVEMBER 1988 2070 \n420 \n360 \n300 \n2 240 \nI - 180 \nE \n3 120 \n- \n0 \na \nV \n60 \n0 - U - L - - - L - -  L L \n0 6 I 2  18 24 30 36 42 48 \nnumber of discr p r r  r f  cycle \n(a) \no.2 t \n0.0 I \n: 6  \n= 12 \n= 24 \n= 36 \nI 48 \nc d v i i y  nuinbcr \n(b) \nFig. 4. (a) CPU time and output efficiency versus number of electron discs \nper RF cycle for the EEV tube: number of cavities (with severs) is 40, \nnumber of integration steps per cavity is 16, and number of iterations \nthrough a section is 5. (b) Profiles of the fundamental RF beam current \nalong the EEV tube for different number of discs per RF cycle. \nused for interpolation of the velocities and times of the \ndiscs. \nFirst, the velocities and times of discs 1 to 12 are de- \nfined to be those of discs l ,  3, 5, . . . , 23. The velocity \nand time of disc 25 are determined from the trajectory \ndata of disc 1 using the periodicity in time. Then the ve- \nlocities and times of discs 2, 4, 6, . . . , and 24 are re- \nspectively defined from the following equations: \nThis approach can easily be adapted so that different \nnumbers of discs per RF cycle can be used for each sec- \ntion of a device, enabling the CPU time to be reduced \nappreciably while the accuracy remains high. \n2) Number of Steps per Cavity: In the numerical inte- \ngration, there is a range for the number of the integration \nsteps per cavity ( N , )  that can be used for a given accuracy \nof the solution. Within this range, it is desirable to choose \nthe smallest number of computational steps per cavity for \nthe maximum speed. The lower limit on the number of \nthe integration steps per cavity is imposed by the trunca- \ntion error as well as by the instability of the computed \nsolution. When the number of the integration steps per \ncavity is less than some minimum value, the computed \nsignal levels oscillate with increasing amplitude around \nthe correct functional values. The upper limit on the num- \nber of the integration steps per cavity is determined by the \nonset of effects from the round-off error and the increase \nin the CPU time. In the model, a provision has been made \nfor selecting different step lengths in each cavity based on \nthe following results. \nFig. 5(a) shows the CPU time and the output efficiency \nversus number of steps per cavity for the CTS tube for \ndrive power near to the saturation drive. Fig. 5(b) shows \nthe profiles of the fundamental RF beam current (Z,\/Zo) \nfor different step lengths. Both figures show that the out- \nput is unstable if the number of steps per cavity is equal \nto 4, and it is self-consistent if the number of steps per \ncavity is equal to or greater than 16. It has been found \nthat the self-consistency of the program does not change \nwith the number of steps per cavity even if the drive power \nis increased beyond the saturation drive. These results in- \ndicate that the speed of the model can be increased with- \nout loss in accuracy by selecting a smaller number of steps \nper cavity in the early cavities and a greater number of \nsteps in the later cavities of a tube. \nB. Method of Integration \n1 )  The one-dimensional relativistic equation of motion \nfor each particle is used for tracking of electrons. This \nequation is expressed in terms of distance as an indepen- \ndent variable [3] and it is integrated with respect to dis- \ntance at each step within a cavity. Integration with respect \nto distance is preferred because of its advantages in speed \nand accuracy over integration with respect to time [2]. \nThe main advantage of distance-step integration is that the \ntrajectories, Le., the velocities and arrival times of the \nrepresentative electrons are directly known as a function \nof distance. This is useful for the instantaneous calcula- \ntion of the RF circuit field, the RF beam current, the in- \nduced voltage on the circuit, and the kinetic energy of the \nmodulated beam at each plane along the circuit. It is only \nnecessary to track the electrons in one RF cycle because \nof the periodicity of the system in time that exists under \nsteady-state conditions. The distance step method is also \nuseful for the analysis in a section after a sever, where \nthe RF forward voltage is set to zero and the variables \n(velocity and time) characterizing the motions of the elec- \ntrons are continuous. \n2) The integration of the equation of motion is carried \nout by Euler’s method [5] and by the Predictor-Corrector \n(successive iteration) method [ 5 ] .  It has been found in the \nsuccessive iterative method that using more than one it- \neration does not improve the accuracy. Fig. 6 shows the \nefficiency profiles for the EEV tube, using both Euler’s \nmethod and Predictor-Corrector method for integration. \nAuthorized licensed use limited to: Lancaster University Library. Downloaded on July 27, 2009 at 04:30 from IEEE Xplore.  Restrictions apply. \nSRIVASTAVA AND CARTER: FAST LARGE-SIGNAL MODEL FOR COUPLED-CAVITY TWT’S 201 1 \n420 “:j \nv I20 \n30 \ns \n- 2 8  ”, \n- 26 .: \ncv \n... \nu - 24 \nnumber ot steps per cavrty \n(a) \nI \n= 24 \n= 16 \n: 8  \n= 4  \nL L  I \n20 30 40 50 60 \ncavity number \n(b) \nFig. 5 .  CPU time and output efficiency versus number of integration steps \nper cavity for the CTS tube: number of cavities (with severs) is 58, num- \nber of electron discs per RF cycle is 24, and number of iterations through \na section is 4. (b) Profiles of the fundamental RF beam current along the \nCTS tube for different number of integration steps per cavity. \nEuler’s method \n(C.l’U time: 30.5 seconds \n(CPU time: IO seconds) \nCavity nuiriber \nFig. 6. Efficiency profiles along the EEV tube by Euler’s and Preditor- \nCorrector methods of integration: number of electron discs per RF cycle \nis 24, number of integration steps per cavity is 16, number of iterations \nthrough a cavity is 1, and number of iterations through a section is 1. \nIn the latter method, the results were computed with re- \ncalculation of the space-charge forces during the correc- \ntion to the predicted values. The CPU times for both cases \nare also indicated. In the program, provision has also been \nmade to use the same values of the space-charge force for \ncorrection as calculated during prediction (discussed in \nSection III-D). \nIn the program, the Predictor-Corrector method has \nbeen preferred over the Leap-Frog method (a noniterative \nmethod of integration) used by Connolly and O’Malley \n[3] for the following reasons: In the Leap-Frog method, \ntwo solutions are carried along: one with the values of X \ncomputed at the alternate points zl, z3 ,  z5 ,  . . . based on \nthe values of X ‘  at the intermediate points z2,  z4,  z g ,  etc. \nThe other solution is the values of X computed at z2 ,  z4, \nZg, . . . based on the values of X ’  at t,, 23, 25, etc. The \nLeap-Frog method, therefore, requires more variables and \nmore core storage. It is also possible that the two solu- \ntions may diverge for a large value of z .  \nThe storage of the trajectory data for a cavity has been \noptimized so that, when a new cavity is entered, the new \ntrajectory data occupy the same storage space as the pre- \nvious data. This has reduced the memory requirements \nand improved the program speed. \nC. Iteration Processes \nAll the information required for calculating the RF field \nforce on the electron beam by the circuit and for calcu- \nlating the induced voltage components on the circuit by \nthe modulated beam at each step of integration within a \ncavity is precalculated and stored. This approach has the \nadvantage of making the program faster than the approach \n[3] of calculating these tables as each different cavity type \nis entered. In the program the iteration processes through \neach cavity and each section of a tube during the forward \nintegration have been optimized as follows. \n1) During the first pass through a section, the integra- \ntion is performed only once for each cavity. On second \nand subsequent passes through the section, the program \ndecides the number of passes for each cavity. This is \nachieved by determining the difference between the for- \nward gap voltages in a cavity on this pass and on the pre- \nvious pass through the section. If this difference is greater \nthan 1 percent, then the program makes a second pass \nthrough the cavity. It has been found that in most cases, \ntwo passes through a cavity are sufficient for good accu- \nracy. If the number of passes required for a cavity is more \nthan one then the space-charge forces calculated in the \nprevious pass through the cavity can sometimes be used \nin the subsequent passes through the cavity (discussed in \nSection III-D). This approach has the important effect of \nenhancing the speed with no loss in accuracy. \n2) It has been found that when iteration is done on a \nsection-by-section basis, it leads to a faster convergence \nin respect of the tube output results than iterating over the \nwhole tube. The program stops the iteration through a \nsection when a convergence of the order of 1 percent in \nthe output power is achieved. In most cases, three to four \npasses through a section have been found sufficient except \nnear the band edges where the effect of the backward wave \nbecomes significant. Sometimes more passes ( 8  to 10) \nAuthorized licensed use limited to: Lancaster University Library. Downloaded on July 27, 2009 at 04:30 from IEEE Xplore.  Restrictions apply. \n2072 IEEE TRANSACTIONS ON ELECTRON DEVICkS. \\Ol. 15. \\O I I  X O V t h l l 3 l  K I')XH \n- d 4 0 0 0 !  3 00 \n6 1 2  15 2 4  \nC d i l t Y  l l iIl l lb<,l \nFig. 7 .  Profiles of the forward gap voltage along the EEV tubc i n  dill'ercnt passe\\ through cacti vxLioi i  01 t l i c  t i i I>c \nthrough a section are needed to achieve convergence at \nthe output. In such a case, the modification given in 3 )  \nbelow helps to achieve faster convergence. \n3) In programs described in the literature, each pass \nthrough a section was started from the first cavity of the \nsection. It has been found during this investigation that \nthe changes in the forward gap voltage during subsequent \npasses become significant only after some cavities (Fig. \n7) especially in the input sections of a tube. This suggests \nthat the next pass through the section should be started \nfrom the cavity (as marked in the figure) at which the dif- \nference in the forward gap voltage of this pass and the \nprevious pass through the section is greater than a pre- \ndefined value. \nThe program decides the starting position on a section \nduring second and subsequent passes through the section. \nThese passes are started from the cavity at which the dif- \nference between the forward gap voltages on this pass and \non the previous pass through the section is greater than 1 \npercent. This modification has been found important for \nthe first two sections of a tube as it helps to achieve a \nconverged solution in the sections quickly after the sec- \nond pass. \n4) It has been found that, using a higher speed at the \ncost of less accuracy in the first pass through a section \naffects, neither the accuracy of the converged output re- \nsults nor the rate of convergence, i .e. ,  the number of \npasses required for output convergence, is not increased. \nTherefore, the program has been modified to make only \none pass through a cavity and to do the forward integra- \ntion at alternate steps in each cavity during the first pass \nthrough a section. If the number of steps per cavity is 16, \nthen the program does the integration at steps 0, 2, 4, 6,  \n8 ,  . . . , 16 in the first pass through the section. This al- \nlows the same number of steps per cavity to be chosen for \nall the passes. \nD. Calculation of the Space-Charge Forces \nIn a large-signal model, the approach to the calculation \nof the space-charge forces is a very important factor as it \ncan save a lot of computing time if the calculation is done \nefficiently. The space-charge tield force is calculated by \nsetting up a look-up table: this table contain5 the coeffi- \ncients of the quadratic equations derived from the spacc- \ncharge forces between two discs for relative positions \nvarying from 0 to half a beatn wavelength in  small steps \n( A d  ) equal to ( h,,\/2 * Z!,]): whcrc A,, is the beam wave- \nlength and I,[, is the number of points i n  half a beam wave- \nlength. \nThe coefficients at the rith point. A ( r i ) .  B (  I I  1 .  ;inti \nC( n ) ,  calculate the space-charge force (scf ) between two \ndiscs whose separation is (: = HA(\/  ) from the equation \nsc : f ( i ? )  = A ( n ) ?  + B ( r 1 ) :  t C ( \/ I ) .  ( 3 )  \nThus, the space-charge force can he calculated at any \nintermediate point using the coefficients of the looh-up \ntable. The calculation of the space-charge force by this \nmethod has been optimized by: I )  improving the method \nof determining the relative disc positions, 2 )  efficient usc \nof the look-up table, 3) using a constant space-charge \nforce on a disc over a certain number ot' integration steps \nin a cavity, and 4) using the space-charge t'orccs f rom the \nprevious pass. \nI )  The computation for calculating the relative posi- \ntions of the discs has been programmcd for optimum speed \nby avoiding all possible repcated calculations a n d  iissuni- \ning that discs are moving with constant velocity during \nthe minimum separation ( A t )  in  time of arrival of the i t h  \nand j t h  discs at a plane z \n- = Af ' l l \/  ( 4 1  ) \nG I . \/  \nz \/ , ,  = At . 11, .  (4b \nIn 4(a), z,,, is the relative position o f  the ,jth disc 1'rom \nthe ith at a timet, ( z ) ;  t, ( z )  and ii, (:) arc the arrival time \nof the ith and the velocity of the j t h  discs at a plane :. \nrespectively. It has been found that (4) is sufficiently ac- \ncurate for calculating the relative disc positions, and i t  is \nnot necessary to use a second-order tertii to improve the \naccuracy. \n2) The number of data points in  the look-up tablc con- \ntaining the coefficients of the quadratic equations is a pro- \nAuthorized licensed use limited to: Lancaster University Library. Downloaded on July 27, 2009 at 04:30 from IEEE Xplore.  Restrictions apply. \nSRIVASTAVA AND CARTER: FAST LARGE-SIGNAL MODEL FOR COUPLED-CAVITY TWT'S \n60 \n120 \n240 \n480 \n1200 \n2400 \nTABLE I \nCOMPARISON BETWEEN Two DIFFERENT APPROACHES OF USING THE LOOK- \nUP TABLE \nData P o i n t s  Quadratic I n t e r p o l a t i o n  D i r e c t  Look-up I \n21.25 34.61 24.93 31.18 \n2 2 . 1 2  34.59 25.16 31.22 \n22.08 34.96 24.65 31.31 \n22.06 35.29 23.71 31.54 \n22.82 31.98 \n22.40 32.74 \nI L f f c n . ( % )  1 C';:ec';fme \/ E f f c n . ( % ) l  CPU Time \n( s e c . )  \n''- \n.-. \nNstep ' \nNstep = \nN5tep = 8 \nNstep ' l6 \nNStep CPU time (second3 \n1 53.5 \n2 42.6 \n4 37.0 \n8 34.4 \nnumber o f  e l e c t r o n  d i s c s  Iper r f  c y c l e  = 24 \nnumber o f  i n t e g r a t i o n  s t e p s  per  c a v i t y  = 16 \nt o t a l  number o f  c a v i t i e s  = 40 \nnumber of i t e r a t i o n  through a c a v i t y  = 1 \nnumber of i t e r a t i o n  throu,:h il s e c t i o n  = I \nand t h e  space  charge f o r c e  was c a l c u l a t e d  a t  each s t e p  o f  \ni n t e g r a t i o n .  \n3.0 r \n'D 0 2 . 0 1  \npass no. 2 \npass no. 3 \npass no. 4 \n__ \n2073 \n------A pass no. I \nd -1.0 t \n-2.0 1 , , 1 \n0 10 20 30 40 50 \ncavity number \nFig. 8 .  Variation of the acceleration on a disc due to space-charge force \nalong the CTS tube in different passes through the tube. \n32 r \n\/ \n~ i t l i o u t  space charge force \ngram input parameter and it was set to 240. The results \nfor a range of data points in the look-up table varying \nfrom 60 to 480 in the program are presented in Table I, \nfor the high-space-charge EEV tube. \nTable I also compares the above approach with another \nmethod of using the look-up table. In the latter method, \nthe look-up table contains the values of the space-charge \nforce between two discs at relative positions varying from \n0 to half a beam wavelength in small steps, and the space- \ncharge force at a distance was taken directly from the ta- \nble for the point nearest to that distance. Table I shows \nthat calculating the space-charge force from the quadratic \ninterpolation is more accurate and the difference in the \nCPU time in both methods is not very great. In the pro- \ngram, a provision was also made to calculate the space- \ncharge force using linear interpolation. However, in the \ncase of linear interpolation, more data points are required \nin the look-up table to obtain the same results as in the \ncase of quadratic interpolation. Therefore, in the compu- \ntation, the coefficients for quadratic interpolation were \npreferred so that the accuracy could be ensured even in a \nhigh-space-charge tube. \n37) Since the space-charge force acting on a disc is the \nresultant force due to all the other surrounding discs, it \ndoes not change rapidly across each cavity during a pass \nthrough the section especially at the input end (Fig. 8). \nTherefore, the same value of the space-charge force can \nbe used over a certain number of integration steps ( Nstep). \n1 a v l t y  iiurnber \nFig. 9. Efficiency profiles along the CTS tube for varying the number of \nintegration steps for a uniform space charge force on a disc: number of \nelectron discs per RF cycle is 24, number of integration steps per cavity \nis 16, number of  iterations through a cavity is 1, and number of iterations \nthrough a section is 1. \nIn the program, a provision has been made for calcu- \nlating the space-charge force at 1, 2, 4, 8,  and 16 steps. \nFor a step interval equal to 1, the space-charge forces are \ncalculated at each step of integration within a cavity. At \nthe other extreme, the space-charge forces are calculated \nonly at the beginning of a cavity and are assumed constant \nthroughout it. Fig. 9 shows the efficiency profiles for the \nCTS tube for different values of step interval in the cal- \nculation of the space-charge forces. The CPU time for \neach case is also indicated. It is interesting to note that \nthe efficiency profile for step interval equal to 16 does not \ndiffer much with the efficiency profile for step interval \nequal to 1 .  The figure also shows the efficiency profiles \nwithout the space-charge force, with illustrates that the \nresults with and without the space-charge forces are very \ndifferent. These results suggest that initially the space- \ncharge force on a disc can be calculated with a higher \nvalue of step interval and the step interval for the calcu- \nlation of the space-charge force can be reduced succes- \nsively if the error in the space-charge force exceeds some \nlimit. \nThe program has been modified so that it can be run \nwith a higher value of step interval in calculation of the \nAuthorized licensed use limited to: Lancaster University Library. Downloaded on July 27, 2009 at 04:30 from IEEE Xplore.  Restrictions apply. \n2074 IEEE TRANSACTIONS ON ELECTRON DEVICES, VOL. 35, NO. I I ,  NOVEMBER 1988 \nspace-charge forces and, in the forward integration pro- \ncess, the program decides at the beginning of each cavity \nthe number of the integration steps for which the space- \ncharge force on a disc is kept constant. If the number of \nthe integration steps with uniform space-charge force is \ngreater than one, then this number is halved when the dif- \nference between the space-charge forces on a disc, cal- \nculated in the normal manner and by extrapolating the last \nthree calculated values of the space-charge force on that \ndisc, is greater than 1 percent. \n4) Fig. 8 shows that the space-charge force on a disc \nat a point does not change much for successive passes \nafter the first, especially in the linear region. Therefore, \nthe same values of the space-charge forces can be used in \nthese passes if the difference between the space-charge \nforces on a disc at a point on this and the previous passes \nis not more than 1 percent. \nThe program stores the space-charge forces calculated \nin the first pass through a section. In the next pass through \nthe section the program decides at the beginning of each \ncavity, from the difference between the space-charge \nforces on a disc on this and the previous pass, whether \nthey should be recalculated in the cavity. If recalculation \nof the space-charge forces is not desired, then the pro- \ngram uses the stored values of the space-charge forces on \nthe discs in the cavity. This approach has approximately \ndoubled the computational speed in a typical case with no \nloss in accuracy of the results. However, one limitation \nof this approach is that it requires a large memory in the \ncomputer to store the array of the space-charge forces on \neach disc at each integration point along the whole tube. \nThe solution to this problem is to store the data at some \npositions, and to calculate the space-charge forces at the \nintermediate points by interpolation. \nIV. SPEED AND ACCURACY OF THE MODEL \nWhen the modifications described were incorporated in \na one-dimensional large-signal model of a coupled-cavity \nTWT, the program was found to be faster than previous \nprograms with no loss in accuracy. On a VAX 11\/785 \ncomputer, the characteristics of the NASA CTS 200-W \ntube for a single value of input power and frequency can \nbe computed in less than 1.5 min of CPU time, which is \nat least 5 to 6 times faster than previous models having \nthe same accuracy. The increased speed of this program \nis a major advantage for interactive applications. The \nmodel is self-consistent, and it also provides a compre- \nhensive range of output data for design purposes. The \nprogram generates both tabulated and graphical output; \nthe principal graphical outputs are the Applegate diagram, \nvelocity-phase diagram, profiles of the RF circuit field and \nRF beam current characteristics along the tube, and the \nspent beam characteristics. \nThe internal energy balance check was typically satis- \nfied within -0.15 percent of the input beam power even \nbeyond saturation showing the high numerical accuracy \nof the model. The error, which is maximum at the posi- \ntion of maximum beam bunching, appears because the \n8 I \n12.00 12.05 12.10 12.15 12.20 \nfrequency (CHz) \n(a) \nMalley \nexperimental \nConnolly b 0' \n12.15 12.20 12.00 12.05 12.10 \nfrequency ( C H r )  \n28 r \n26 i \n22 __ .. ... L .~ . . . ..I-._- \n24 12.00 P--- 12.05 12.10 12.15 12.20 \ncomputed \nConnolly h 0' \nexper imenial \nMalley \nMdlley \nfrequency ( G H d  \n(C) \nFig. 10. Computed and experimental results for the NASA CTS 200-W \ntube. on: (a) small-signal gain versus frequency (0-dBm drive), (b) sat- \nurated output power versus frequency, and (c) saturation drive power \nversus frequency. \nchange in the space-charge potential energy is neglected \nin the energy balance calculation. \nThe accuracy of the program was also checked by com- \nparing the computed results with the experimental results \nfor two typical space harmonic tubes. Fig. 10 shows a \ngood agreement between the computed results on (a) the \nsmall-signal gain, (b) the saturated output power, and (c) \nthe saturation drive power with the corresponding exper- \nimental results [3] over the frequency band for the low- \nspace-charge high-efficiency NASA CTS 200-W tube. \nThe figure also shows that the agreement between the \ncomputed results and the results of Connolly and O'Mal- \nley [3] is excellent. Fig. 11 shows results on the gain ver- \nsus frequency for the high-space-charge high-gain EEV \ntube. The figure shows good agreement between the com- \nputed results and the experimental results over the scaled \noperating band of 2.96 to 3.12 GHz. The poor agreement \nbetween the computed results and the experimental results \noutside the operating band might be due to errors in the \nvalues of the parameters used for the matching and the \nslot tapered cavities of the tube that were calculated from \ntheir dimensions using an equivalent circuit program [ 81. \nAuthorized licensed use limited to: Lancaster University Library. Downloaded on July 27, 2009 at 04:30 from IEEE Xplore.  Restrictions apply. \nSRIVASTAVA A N D  CARTER: FAST LARGE-SIGNAL MODEL FOR COUPLED-CAVITY TWT'S 2015 \nexperimental \n\\ \n2.84 2.88 2.92 2.96 3.00 3.04 3.08 3.12 < I 6  \nfrequency ( C H r )  \nFig. 1 1 .  Computed and experimental results on the large signal gain versus frequency at a fixed drive power for the EEV tube \nV. CONCLUSIONS \nA one-dimensional large-signal model of a coupled- \ncavity TWT has been developed that is much faster than \nother similar programs with the same accuracy. The basic \ntheory of the model is based on the large particle method \nin which the electron beam is modeled in terms of the \ncylindrical charge discs and the axial movements of the \ncharge discs are tracked in response to the RF circuit and \nspace-charge field forces. Since the success of a computer \nmodel is judged by the extent to which it predicts and \nagrees with the experimental results, different modeling \ntechniques were investigated that could increase the speed \nof the program with no loss in accuracy. \nI) A provision has been made for selecting different \nnumbers of representative electrons per beam wavelength \nalong the tube, Le., fewer electrons in the linear region \nand more in the nonlinear region. Though this approach \nis very useful for increasing the speed of the program, \nthere is a need to improve it in the nonlinear region. Sim- \nilarly, a provision has been made for selecting different \nstep lengths in each cavity, i.e., a small number of steps \nin the early cavities and more in the later cavities. \n2) The integration of the equation of motion has been \ncarried out with respect to distance because of its advan- \ntages in speed and accuracy over integration with respect \nto time. The Predictor-Corrector method has been found \nbetter than the Leap-Frog method [3] because the storage \nspace and the computation time required for the same ac- \ncuracy are less. \n3) The iterations through each cavity and through each \nsection during the forward integration process have been \noptimized. It has been shown that iteration on a section- \nby-section basis leads to a faster convergence and that the \nfirst pass through a section can be made faster at the cost \nof less accuracy. It has also been shown that, instead of \nmaking each pass from the first cavity of the section, a \nlater cavity may be used as the starting position for the \nthird and subsequent passes through the section. \n4) Since efficient calculation of the space-charge force \ncan save a lot of computing time, the program was optim- \nized by: improving the method of determining the relative \ndisc positions, efficient use of the look-up table, suitable \nchoice of the number of integration steps for the uniform \nspace-charge force on a disc, and using the space-charge \nforce from the previous pass. \nWith these modifications, the program speed has been \nconsiderably improved to, typically, less than 1.5 min of \nCPU time for converged output on a VAX type 111785 \ncomputer. Although the program has been checked only \nfor a typical low-space-charge high-efficiency tube and for \na typical high-space-charge high-gain tube, it is hoped that \nthe program is generalized enough to be used for different \ntypes of tubes with good accuracy and speed. Also, the \nmodel can easily be modified to investigate the interaction \nof a traveling-wave circuit with a prebunched beam by \nassuming the current and velocity distributions at the en- \ntrance to the circuit. This approach can be used for study- \ning different velocity taper circuits in the output section \nof a tube. \nAPPEND I x\nIn the large-signal analysis, the working equations pri- \nmarily differ from that used by Connolly and O'Malley \n[3] in the following respects: \nI) The effect of the space-charge potential depression \nunder the actual boundary condition is taken into account \nfor calculating the dc beam velocity [9]. Because of the \nradial variation of the potential depression, the dc beam \nvelocity is no longer the same for electrons at different \nradii. It has been assumed that the beam velocity on the \naxis can be used with sufficient accuracy because some \ndegree of compensation is produced by variation of the \nbeam velocity about its axis due to magnetic focussing \nfield. \n2) The equations for calculating the RF circuit field \nacting on the electron beam and for calculating the volt- \nage induced on the circuit by the modulated beam require \nsummations over an infinite set of space harmonics. It has \nbeen found that summation from -2 to 2 is generally suf- \nficient. \n3) The equation for the RF circuit field force on an \nelectron disc differs from [3, eq. (20)] by a negative sign \nthat was found by its derivation. \n4) The equation for the RF beam current density differs \nAuthorized licensed use limited to: Lancaster University Library. Downloaded on July 27, 2009 at 04:30 from IEEE Xplore.  Restrictions apply. \n2076 IEEE TRANSACTIONS ON ELECTRON DEVICES, VOL. 35, NO. 11.  NOVEMBER 1988 \nfrom [3, eq. (74)] by a factor of 2 in the numerator that \nwas found from the theory of Fourier series of complex \narguement [lo]. \n5) The equation for the forward and backward com- \nponents of the induced voltage differ from the respective \n[3, eqs. (76) and (77)] by multiplication factor 0.5 that \nwere found by their derivatives. \n6) In the power balance verification, equations related \nto the RF circuit power differ from the respective 13, eq. \n(55) and (56)] by a factor of half of the induced voltage \nwith the forward or backward gap voltage. This additional \nterm appeared in these equations on the basis of the power \nbalance within the cavity. \nACKNOWLEDGMENT \nWe wish to thank the management of the English Elec- \ntric Valve Co., Ltd. for permission to publish this paper. \nV. Srivastava wishes to thank the Association of Com- \nmonwealth Universities for awarding him a scholarship \nand the Director, CEERI, Pilani, India, for sponsorship \nto carry out research studies at the University of Lancas- \nter. He is also thankful to Dr. S. S. S. Agarwala and S. \nN . Joshi of his organization for their encouragement. \nREFERENCES \n[l] J. F. Gittins, Power Travelling Wave Tubes. London: English Uni- \nversities Press, 1964. \n[2] J.  R. M. Vaughan, “Calculations of coupled cavity TWT perfor- \nmance,” IEEE Trans. Electron Devices, vol. ED-22, pp. 880-890, \n1975. \n[3] D. J. Connolly and T. A. O’Malley, “Computer program for analysis \nof coupled-cavity traveling-wave tubes,” NASA Rep. TND-8492, \nMay 1977. \n[4] W.-M. Sung, “Large signal theory and computation for coupled-cav- \nity TWTs,” Acta Electron. Sin., vol. 12, no. 3, pp. 25-32, 1984. \n[5 ]  R. W. Hamming, Numerical Methods for Scientists and Engineers. \nNew York: McGraw-Hill, 1973. \n[6] G .  S. Kino, Y. Hiramatsu, W. A. Harman, and J. A. Ruetz, “Small- \nsignal and large-signal theories for the coupled-cavity TWT,” in Proc. \n6th Int. Con$ Microwave and Optical Generation and Amplification, \n[7] D. Van Tassel, Program Style, Design, Eficiency, Debugging, and \nTesting. Englewood Cliffs, NJ: Prentice-Hall, 1978. \n[8] R. G. Carter and L. Shun-kang, “Method for calculating the prop- \nerties of coupled cavity slow wave structures from their dimensions,” \nIEE Proc., vol. 133, pt. H,  no. 5 ,  pp. 330-334, 1986. \npp. 49-53, 1966. \n[9] V. Srivastava and R. G. Carter, “Effect of boundaries on the space \ncharge potential in coupled-cavity travelling wave tubes,” IEE Proc.,  \nvol. 133, pt. I, no. 5 ,  pp. 185-188, 1986. \n[IO] D. K. Cheng, Analysis ofLinear Systems. Reading, MA: Addison- \nWesley, 1959. \n* \nVishnu Srivastava was born in Ajmer, India on \nNovember 22, 1953. He received the B.Sc. and \nM.Sc. degrees from the University of Rajasthan, \nJaipur, India, in 1973 and 1975, respectively, and \nthe Ph.D. degree in engineering from the Univer- \nsity of Lancaster, Lancaster, United Kingdom, in \n1987. His Ph.D. dissertation concerns the large- \nsignal modeling of coupled-cavity TWT’s. \nSince 1976, he has been working in the Micro- \nwave Tubes Area, Central Electronics Engineer- \ning Research Institute, Pilani, India, where he has \nbeen engaged in the design and development of high-power microwave \ntubes. He was a Commonwealth Scholar at the University of Lancaster \nfrom October 1984 to September 1987. His current research interests are \nin CAD\/CAM of high-power microwave tubes and UHV technology. \nDr. Srivastava is an Associate Member of the Institution of Electrical \nEngineers (U.K.) and a member of the Institution of Electronics and Tele- \ncommunication Engineers (India), the Computer Society of India, and the \nIndian Physics Association. \n* \nRichard G. Carter graduated in physics from \nQueens’ College Cambridge In 1965 and received \nthe Ph.D. degree from the University of Wales In \n1968 for work on wave propagation on neutralized \nion beams under the supervision of Dr. R. H. C. \nNewton. \nFrom 1968 to 1972, he was a Development En- \ngineer with the English Electric Valve Company \nLimited (EEV) working on high-power traveling- \nwave tubes. In 1972, he became a Lecturer in the \nDepartment of Engineering of the University of \nLancaster. He was responsible for the development of the B.Sc course in \nphysical electronic engineenng and the M.Sc. course in project engineer- \ning. He is the author of a number of papers on microwave tubes and on \nengineering education, and of the undergraduate text Electromagnetism for \nElectronic Engineers. A Consultant to EEV since 1976, he was promoted \nto Senior Lecturer and EEV Fellow in 1986. \nDr. Carter is a Chartered Engineer and a Member of the Institution of \nElectncal Engineers (U K.). \nAuthorized licensed use limited to: Lancaster University Library. Downloaded on July 27, 2009 at 04:30 from IEEE Xplore.  Restrictions apply. \n"}