{"doi":"10.1007\/978-94-007-1214-0_11","coreId":"219648","oai":"oai:eprints.lse.ac.uk:36658","identifiers":["oai:eprints.lse.ac.uk:36658","10.1007\/978-94-007-1214-0_11"],"title":"The application of warfare ecology to belligerent occupations","authors":["Mason, Michael"],"enrichments":{"references":[{"id":17279146,"title":"Vulnerability. Global Environmental Change 16(3): 269-281. Amnesty International","authors":[],"date":"2006","doi":"10.1016\/j.gloenvcha.2006.02.006","raw":"Adger, W.N. (2006) Vulnerability. Global Environmental Change 16(3): 269-281. Amnesty International (2009) Troubled Waters: Palestinians Denied Fair Access to Water, London: Amnesty International http:\/\/www.amnesty.org\/en\/library\/asset\/MDE15\/027\/2009\/en\/e9892ce4-7fba-469b-96b9-c1e1084c620c\/mde150272009en.pdf Benvenisti, E. (2003) Water conflicts during the occupation of Iraq. American Journal of International Law 97(4): 860-872.","cites":null},{"id":17279147,"title":"Protection of the environment during armed conflict: one Gulf, two wars.","authors":[],"date":"2004","doi":"10.1111\/j.1467-9388.2004.00397.x","raw":"Bunker, A.L. (2004) Protection of the environment during armed conflict: one Gulf, two wars. Review of European Community and International Environmental Law 13(2): 201-213.","cites":null},{"id":17279148,"title":"The International Law of Belligerent Occupation, Cambridge:","authors":[],"date":"2009","doi":"10.1017\/cbo9780511818257","raw":"Dinstein, Y. (2009) The International Law of Belligerent Occupation, Cambridge: Cambridge University Press.","cites":null},{"id":17279149,"title":"Agriculture Organization (2008) Social Protection in the West Bank and Gaza Strip: Working Paper 5: Household Food Security Profiling.","authors":[],"date":null,"doi":null,"raw":"Food and Agriculture Organization (2008) Social Protection in the West Bank and Gaza Strip: Working Paper 5: Household Food Security Profiling. Rome: FAO.","cites":null},{"id":17279150,"title":"of the Red Cross (2010) International Humanitarian Law: Hague Convention IV Respecting the Laws and Customs of War on Land,","authors":[],"date":"2008","doi":"10.1163\/ilwo-iib1a","raw":"International Committee of the Red Cross (2010) International Humanitarian Law: Hague Convention IV Respecting the Laws and Customs of War on Land, Geneva: ICRC. http:\/\/www.icrc.org\/ihl.nsf\/FULL\/195?OpenDocument IRIN News (2008) Health threat posed by aging water supply networks, IRIN: United Nations. http:\/\/www.irinnews.org\/PrintReport.aspx?ReportId=81077 Machlis. G.E. and T. Hanson (2008) Warfare ecology. BioScience 58(8): 729-736.","cites":null},{"id":17279151,"title":"Environmental justice in situations of armed conflict.","authors":[],"date":"2009","doi":"10.1017\/cbo9780511576027.013","raw":"Okowa, P. (2009) Environmental justice in situations of armed conflict. In J. Ebbeson and P. Okowa (eds) Environmental Law and Justice in Context, Cambridge: Cambridge University Press, pp. 231-252.","cites":null},{"id":17279152,"title":"Militarized Landscapes: From Gettysburg to Salisbury Plain,","authors":[],"date":"2010","doi":"10.1177\/09683445110180040804","raw":"Pearson, C., P. Coates and T. Cole (eds) (2010) Militarized Landscapes: From Gettysburg to Salisbury Plain, London: Continuum.","cites":null},{"id":17279153,"title":"Health and Human Rights Consequences of War in Iraq: A Briefing Paper,","authors":[],"date":"2003","doi":null,"raw":"Physicians for Human Rights (2003) Health and Human Rights Consequences of War in Iraq: A Briefing Paper, Boston, MA: Physicians for Human Rights.   15 http:\/\/physiciansforhumanrights.org\/library\/documents\/reports\/health-and-human-rights.pdf Roberts, A. (2006) Transformative military occupation: applying the laws of war and human rights. American Journal of International Law 100(3): 580-622.","cites":null},{"id":17279154,"title":"Green war: An assessment of the environmental law of international armed conflict.","authors":[],"date":"1997","doi":"10.1007\/978-90-6704-740-1_8","raw":"Schmitt, M.N. (1997) Green war: An assessment of the environmental law of international armed conflict. Yale Journal of International Law 22(1): 1-109.","cites":null},{"id":17279155,"title":"The Law of Belligerent Occupation, Washington: Crimes of War Project http:\/\/www.crimesofwar.org\/print\/onnews\/iraq5-print.html","authors":[],"date":"2003","doi":null,"raw":"Schmitt, M.N. (2003) The Law of Belligerent Occupation, Washington: Crimes of War Project http:\/\/www.crimesofwar.org\/print\/onnews\/iraq5-print.html Sen, B. (2003) Iraq Evaluation Report: Iraq Watching Brief: Overview Report, New York: UNICEF http:\/\/www.unicef.org\/evaldatabase\/index_29697.html Stevens, M.L. (2007) Iraq and Iran in ecological perspective: the Mesopotamian marshes and the Hamizeh-Azim Peace Park. In S.H. Ali (ed) Peace Parks: Conservation and Conflict Resolution, Cambridge, MA; MIT Press, pp. 313-331.","cites":null},{"id":17279156,"title":"A Sleeping Time Bomb: Pollution of the Mountain Aquifer by Solid Waste, Amman: EcoPeace\/Friends of the Earth Middle East.","authors":[],"date":"2006","doi":null,"raw":"Tagar, Z. and V. Qumsieh (2006) A Sleeping Time Bomb: Pollution of the Mountain Aquifer by Solid Waste, Amman: EcoPeace\/Friends of the Earth Middle East.","cites":null},{"id":17279157,"title":"A wall, water and power: the Israeli ‘separation fence’.","authors":[],"date":"2007","doi":"10.1017\/s0260210507007334","raw":"Trottier, J. (2007) A wall, water and power: the Israeli ‘separation fence’. Review of International Studies 33(1):105-127.","cites":null},{"id":17279158,"title":"A framework for vulnerability analysis in sustainability science.","authors":[],"date":"2003","doi":"10.1073\/pnas.1231335100","raw":"Turner, B.L. et al. (2003) A framework for vulnerability analysis in sustainability science. Proceedings of the National Academy of Science, 100(14): 8074-8079.","cites":null}],"documentType":{"type":1}},"contributors":["Machlis, Gary","Hanson, Thor","Špirić, Zdravko","McKendry, J. E."],"datePublished":"2011","abstract":"Insofar as warfare ecology aims to examine all war-related conditions, belligerent occupations are a necessary stage in its broad taxonomy. Under international law, belligerent occupations are covered by a distinctive subset of jus in bello (humanitarian law), which is imprecise regarding ecological changes. This chapter examines the potential role of warfare ecology in studying belligerent occupations, highlighting the multiple, often indirect, means by which such occupations shape ecological processes. Particular attention is paid to the Israeli occupation of Palestinian territory, due to its protracted duration, although also discussed are environmental effects associated with the US and UK occupation of Iraq. The onus on the occupying power, under international humanitarian law, to protect the conditions of life for civilians can plausibly be applied to the environmental resources of the resident population. It is argued that warfare ecology can make a significant contribution both to assessing the effects of occupations and, through the generation of policy advice, to promote conflict outcomes more sensitive towards ecological processes","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/219648.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/36658\/1\/The_application_of_warfare_ecology_to_belligerent_occupations_%28LSE_RO%29.pdf","pdfHashValue":"a918f95c736b9b607ec7df5a7e5a6a0fdc3765e9","publisher":"Springer Netherlands","rawRecordXml":"<record><header><identifier>\n  \n    \n    \n      oai:eprints.lse.ac.uk:36658<\/identifier><datestamp>\n      2014-05-30T14:21:30Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53452D52432D4343<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3735<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/36658\/<\/dc:relation><dc:title>\n        The application of warfare ecology to belligerent occupations<\/dc:title><dc:creator>\n        Mason, Michael<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        Insofar as warfare ecology aims to examine all war-related conditions, belligerent occupations are a necessary stage in its broad taxonomy. Under international law, belligerent occupations are covered by a distinctive subset of jus in bello (humanitarian law), which is imprecise regarding ecological changes. This chapter examines the potential role of warfare ecology in studying belligerent occupations, highlighting the multiple, often indirect, means by which such occupations shape ecological processes. Particular attention is paid to the Israeli occupation of Palestinian territory, due to its protracted duration, although also discussed are environmental effects associated with the US and UK occupation of Iraq. The onus on the occupying power, under international humanitarian law, to protect the conditions of life for civilians can plausibly be applied to the environmental resources of the resident population. It is argued that warfare ecology can make a significant contribution both to assessing the effects of occupations and, through the generation of policy advice, to promote conflict outcomes more sensitive towards ecological processes.<\/dc:description><dc:publisher>\n        Springer Netherlands<\/dc:publisher><dc:contributor>\n        Machlis, Gary<\/dc:contributor><dc:contributor>\n        Hanson, Thor<\/dc:contributor><dc:contributor>\n        Špirić, Zdravko<\/dc:contributor><dc:contributor>\n        McKendry, J. E.<\/dc:contributor><dc:date>\n        2011<\/dc:date><dc:type>\n        Book Section<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/36658\/1\/The_application_of_warfare_ecology_to_belligerent_occupations_%28LSE_RO%29.pdf<\/dc:identifier><dc:identifier>\n          Mason, Michael  (2011) The application of warfare ecology to belligerent occupations.   In: Machlis, Gary and Hanson, Thor and Špirić, Zdravko and McKendry, J. E., (eds.) Warfare Ecology: a New Synthesis for Peace and Security.  Springer Netherlands, Dordrecht, Germany, pp. 155-173.  ISBN 9789400712133     <\/dc:identifier><dc:relation>\n        http:\/\/www.springer.com<\/dc:relation><dc:relation>\n        10.1007\/978-94-007-1214-0_11<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/36658\/","http:\/\/www.springer.com","10.1007\/978-94-007-1214-0_11"],"year":2011,"topics":["GE Environmental Sciences"],"subject":["Book Section","NonPeerReviewed"],"fullText":"  \nMichael Mason\nThe application of warfare ecology to \nbelligerent occupations \n \nBook section \nOriginal citation: \nMason, Michael (2011) The application of warfare ecology to belligerent \noccupations. In: Machlis, Gary and Hanson, Thorand Špirić, Zdravko and McKendry, J. E., (eds.) \nWarfare ecology: a new synthesis for peace and security. Springer, Dordrecht, Germany. ISBN \n9789400712133 \n© 2011 Springer\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/36658\/  \nAvailable in LSE Research Online: June 2011 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s submitted version of the book section. There may be differences \nbetween this version and the published version.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n 1 \n \nThe Application of Warfare Ecology to Belligerent Occupations \n \nMichael Mason \nDepartment of Geography and Environment, London School of Economics and Political Science, \nHoughton Street, London, WC2A 2AE, UK, email: m.mason@lse.ac.uk \n \n \n \nAbstract \nInsofar as warfare ecology aims to examine all war-related conditions, belligerent occupations are a \nnecessary stage in its broad taxonomy. Under international law, belligerent occupations are covered \nby a distinctive subset of jus in bello (humanitarian law), which is imprecise regarding ecological \nchanges. This chapter examines the potential role of warfare ecology in studying belligerent \noccupations, highlighting the multiple, often indirect, means by which such occupations shape \necological processes. Particular attention is paid to the Israeli occupation of Palestinian territory, \ndue to its protracted duration, although also discussed are environmental effects associated with the \nUS and UK occupation of Iraq. The onus on the occupying power, under international humanitarian \nlaw, to protect the conditions of life for civilians can plausibly be applied to the environmental \nresources of the resident population. It is argued that warfare ecology can make a significant \ncontribution both to assessing the effects of occupations and, through the generation of policy \nadvice, to promote conflict outcomes more sensitive towards ecological processes. \n \n \n \n1.0 Introduction \n \nThe emergent field of warfare ecology is concerned with the application of environmental research \nto the full range of war-related conditions. As noted by Machlis and Hanson (2008: 729), an \naccurate taxonomy of warfare is essential to the development of this field of study, which indicates \na need explicitly to incorporate military occupation. All occupations are covered by international \nhumanitarian law, though ‘permissive’ occupations  have contested legal status depending on the \npresumed consent of the displaced sovereign authority and the civilian population within the \nterritory controlled by external military forces. The subject matter of this chapter is restricted to \nbelligerent occupations, which under Article 42 of the 1907 Hague Regulations, are defined as \nterritory placed under the control of a hostile army (International Committee of the Red Cross \n2010): such occupations lack the consent of the civilian population and its recognized \nrepresentatives. It should be noted that civilian authorities (domestic or external) may be \nresponsible for governance in belligerent occupations, but only under the supervision of the \noccupying authority. \n \nUnder international law, belligerent occupations come under a distinctive subset of jus in bello \n(humanitarian law), complementing the legal norms governing the conduct of hostilities (Dinstein \n2009: xi). These norms are drawn from customary international law, the Hague Regulations (1907), \nthe Fourth Geneva Convention (1949) and Additional Protocol I (1977) to the Geneva Conventions \n(Protocol I). As humanitarian law has evolved, it has focused increasingly on minimizing the \nimpact of the occupying power on civilian resources and infrastructure until such time as the \noccupation ceases and legitimate government is re-established. Indeed, the overriding principle of \nthe international law of belligerent occupation is that the civilian population of an occupied territory \nmust benefit from maximal safeguards feasible in the circumstances (Schmitt 2003; Dinstein 2009: \n286). It should be noted that the designation of a ‘belligerent occupation’ is often disputed by the \nstate in military control, such as the Israeli position on East Jerusalem and Gaza, and Morocco’s \n 2 \nstance on the Western Sahara. In this chapter, authoritative weight will be accorded to declarations \non belligerent occupation by relevant representative bodies of the international community, notably \nthe UN Security Council, the International Court of Justice and the High Contracting Parties to the \nFourth Geneva Convention. \n \nAfter briefly outlining the relevant provisions on environment protection in international \nhumanitarian law, this chapter surveys the environmental effects of belligerent occupations, \nhighlighting the multiple, often indirect, means by which such occupations shape ecological \nprocesses. Particular attention is paid to the Israeli occupation of Palestinian territory, due to its \nprotracted duration (since November 1967 as dated by UN Security Council Resolution 242), \nalthough also discussed are the environmental effects associated with the occupation of Iraq \n(deemed by the UN Security Council Resolution 1483 to be under occupation from May 2003 until \nJune 2004, when an Iraqi Interim Government replaced the Coalition Provisional Authority). It is \nargued that warfare ecology can make a significant contribution both to assessing the effects of \noccupations and, through the generation of policy advice, to reducing those consequences. \n \n \n2.0 Belligerent occupation and the environment \n \nExisting humanitarian law prohibits extreme and disproportionate damage to the environment by \nbelligerents during armed interventions. Along with customary international law, the key treaties of \nrelevance are the Hague Regulations, the Fourth Geneva Convention, Protocol I and the Convention \non the Prohibition of Military and Hostile Use of Environmental Modification Techniques (1977). \nHowever, it is only in recent years that environmental considerations have seriously been treated as \na legitimate constraint on warfare, which can be attributed to the precedents created by UN Security \nCouncil Resolution 687 (1991) establishing Iraqi liability for environmental (and other) damage \nduring the First Gulf War and also to Article 8(2)(b)(iv) of the Rome Statute of the International \nCriminal Court (2002), which states that the intentional infliction of “widespread, long-term and \nsevere damage to the natural environment” is a war crime (see Bunker 2004). \n \nWhile belligerent occupation falls within the scope of international humanitarian law, the \napplication of its provisions on environmental protection are more uncertain; for belligerent \noccupation typically features low levels of violent conflict, where the occupying power encounters \nat most sporadic resistance from those opposed to its control. Furthermore, the relevant legal regime \nfor environmental protection covers in practice the routine exercise of authority by the occupying \npower in its efforts to secure stable governance. The environmental protection duties of \nhumanitarian law are, under belligerent occupation, largely indirect. In its overriding responsibility \nto meet the needs of the civilian population, the occupying power is obliged to exercise \nguardianship of natural resources (Hague IV: Article 55) and not to undertake extensive destruction \nand appropriation of property (Fourth Geneva Convention: Article 147). In addition, Article 54(2) \nof Protocol I prohibits the destruction, removal and disablement of civilian objects indispensable to \nthe survival of the civilian population, including agricultural areas, drinking water installations and \nirrigation works. It should be noted that, according to UN General Assembly Resolution 305 \n(1972), an occupied population retains permanent sovereignty over its natural wealth and resources \n(Okowa 2009: 244-245). The onus on the occupying power, under international humanitarian law, \nnot to make fundamental changes in the constitutional, social, economic and political order of an \noccupied territory (Roberts 2006) can therefore plausibly be applied to the environmental resources \nof the resident population. \n \nThere remains debate amongst scholars as to the application of multilateral environmental \nagreements and customary international environmental norms to warfare. Given the growing body \nof international environmental law, its potential scope for influence on the practice of belligerent \n 3 \noccupation is substantial. The more restrictive interpretation is that the exceptional status of a \nbelligerent occupation means that only humanitarian norms apply as the specific law (lex specialis) \ntailored to the situation: peacetime environmental norms are effectively suspended insofar as they \nclash with this jus in bello (see Bunker 2004: 204). Less restrictive positions counter that peacetime \nenvironmental treaties remain applicable (e.g. Schmitt 1997: 41). In this chapter, the latter \nperspective is adopted, which is consistent with the understanding in humanitarian law that \nbelligerent occupations should make as much space as possible for the continuation of pre-\noccupation norms of governance. This covers arguments that international human rights law \ncontinues to apply, as well as other international treaties applied in peacetime. It is argued here that \nthe population under occupation continues to be covered by the core customary rule of international \nenvironmental law – that states do not cause harm to the environment of other states or areas \nbeyond national control. This means, for example, that these populations are entitled not to suffer \nenvironmental injuries caused by the occupier and\/or other states. \n \n \n3.0 Assessing the environmental effects of occupations \n \nLike other conflict-related conditions, the presence of a belligerent occupation often presents major \npractical obstacles to scientific efforts to determine impartially the environmental effects of \nhostilities. Even if an occupation is stable enough to qualify as ‘post-conflict’, there may be serious \nlimitations in data availability and monitoring, while both the occupying power and political \nrepresentatives of the occupied may have neither the willingness nor capacity to undertake \nenvironmental assessments. It is also the case that the Post-Conflict Needs Assessments (PCNAs) \nundertaken by the international community have tended to sideline environmental considerations, \nexcept insofar as they have obvious linkages to human health, livelihoods and security (UNEP \n2009: 5). As formulated by the UN Development Group and the World Bank, PCNAs are \nundertaken with the consent of the occupying power (following an invasion) or domestic authorities \n(following a civil war), and are oriented to short-term recovery needs and longer-term \nreconstruction needs. In the past decade there has been a provision within PCNAs to consider \nenvironment as a cross-cutting theme. A recent UNEP review of PCNAs conducted from 2000 to \n2006 – including reports on periods of belligerent occupation in Iraq and Georgia – identified a \ngrowing recognition of immediate environmental problems, though a neglect of longer-term \nenvironmental needs and effects (UNEP 2009). \n \nOutside the PCNA process, UNEP has developed arguably the most credible set of post-conflict \nenvironmental assessments (PCEAs) within the international community. Since 1999, it has \nconducted ten PCEAs, including in Kosovo (2001), Afghanistan (2003), Lebanon (2007) and the \nGaza Strip (2009). The PCEA methodology encompasses background research, systematic \nsampling, fieldwork and laboratory analysis: in the interests of transparency and neutrality, the \nterms of reference and methodological protocols are shared with all relevant parties. When field \nassessments are not possible for political or security reasons, UNEP has also conducted Desk \nStudies on the Environment – notably in 2003 for the occupied Palestinian territory and Iraq.  \n \nWhile a comprehensive survey of relevant UNEP environmental assessments is outside the scope of \nthis chapter, their categorization of ecological effects will be followed now in highlighting \nparticular trajectories of change associated with belligerent occupations in practice. This classifies \nconsequences by: direct changes to natural resources and ecosystems – distinguishing here between \n(i) the effects of large-scale conflicts and (ii) the direct effects of occupation practices – (iii) indirect \neffects on natural resources and ecosystems, and (iv) reductions to institutional capacity for \nenvironmental management. While UNEP post-conflict assessments in practice have tended to \nfocus on negative environmental consequences, there are occasions – some noted below – when \nmilitary interventions have led to positive ecological consequences, whether or not these were \n 4 \nintended. These include removing regimes that have employed environmental pollution as a \nmilitary tactic (e.g. the firing of oil wells and trenches by Iraqi forces in 2003). \n \n \n3.1 DIRECT CONFLICT EFFECTS ON NATURAL RESOURCES AND ECOSYSTEMS \n \nThe most obvious source of war-related environmental damage within occupied territories is the \nlegacy of large-scale military action either preceding an occupation (e.g. the Coalition attack on \nIraq between March-May 2003) or taking place during an occupation (e.g. the Israeli attack on the \nGaza Strip, code-named Operation Cast Lead, between December 2008-January 2009). At the same \ntime, contemporary armed conflict may exacerbate pre-existing environmental vulnerabilities, \nposing longer-term risks to the populations of occupied territories. UNEP environmental \nassessments of armed conflict in Iraq (UNEP 2003b; 2003c) and the Gaza Strip (UNEP 2009a) \nlisted the following problems as significant: \n \n3.1.1 Water and sanitation \n \nIn Iraq during Saddam Hussein’s regime, poor maintenance of the water infrastructure and \nunsustainable irrigation practices were, prior to the 2003 conflict, already causing severe \ncontamination of surface water and salinization of agricultural land. This was both the result of \nmisrule and the effects of the international sanctions regime, which blocked imports of equipment \nand chemicals necessary for water infrastructure maintenance (Physicians for Human Rights 2003: \n3). The focus of US and UK attacks on major urban areas resulted in serious impacts on Iraqi water \ndistribution and sanitation systems, in large part because of deliberate cuts to electricity supplies \n(UNEP 2003b: 71). While water supplies in major cities were restored by April 2003, water \nnetworks and pumping stations were subject to acts of sabotage during and after the Coalition \noccupation, impeding investments in sanitation and sewage systems. Without significant \nimprovements in water infrastructure, the population continues to face a high risk of disease \nepidemics, as evident from the major cholera outbreak in 2008 (IRIN News 2008). In the Gaza \nStrip, severe water quality and sanitation problems accentuated by the Israeli blockade and \neconomic sanctions (which were introduced after the election of the Hamas Government in January \n2006) were further stressed during Occupation Cast Lead by Israeli military damage to water wells, \nas well as to the water distribution and sewage network. For example, a direct hit to the \nembankment wall of the Az Zaitoun wastewater treatment plant led to a wastewater and sludge \nspillage affecting 55,000 square metres of agricultural land (UNEP 2009a: 33-36). \n \n3.1.2 Waste \n \nThe Iraqi capacity for waste collection and disposal was eroded by the UN sanctions regime \npreceding the start of the US and UK attack in March 2003. While hampered in its Desk Study on \nthe Environment by the lack of information on Iraqi waste management practices, UNEP concluded \nthat accumulations of domestic, demolition and clinical waste were already posing significant risks \nto human health; and that previous military conflicts – including the 1991 Gulf War – had resulted \nin large and widespread quantities of military debris and toxic material (UNEP 2003b: 34-37). \nImpacts of the 2003 conflict was judged to have exacerbated the critical waste management \nsituation in Iraq, aggravating health and safety risks to urban populations: the risks included disease \nvectors sourced to human remains, clinical and food waste, and exposure to hazardous dust and \ndebris (UNEP 2003b: 71). More confidence is attached by UNEP to its assessment of waste \nproblems in the Gaza Strip on account of the extensive access of its technical team to impacted \nareas in May 2009. Israeli military actions during Operation Cast Lead impacted almost 2,700 \nbuildings in the Strip, generating approximately 600,000 tonnes of debris (UNEP 2009a: 27). While \nthe international community has funded the clean-up of this debris – including provision for \n 5 \nmaterials recovery and re-use – concerns remain about the insufficient capacity of local landfill \nsites and the absence of a dedicated facility for processing hazardous wastes. A lingering post-\nconflict challenge is the presence in landfills of hazardous health care waste mixed with domestic \nwastes, which can be traced to the disruption of medical waste disposal systems during the Israeli \nbombardment (UNEP 2009a: 77). As in Iraq, the physical impacts of the conflict overloaded a solid \nwaste infrastructure that was already weak and fragmented. \n \n3.1.3 Pollution from oil fires and spillages \n \nThe UN sanctions regime that weakened solid waste management in Iraq also prevented proper \nmaintenance of its oil infrastructure, and UNEP surmised that significant degradation of soil and \ngroundwater, and flaring-induced air pollution, were likely to have been present before the invasion \n(UNEP 2003b: 38). During the immediate hostilities, Iraqi forces set fire to a number of oil wells \n(in southern Iraq) and oil-filled trenches (around Baghdad) to impede US\/UK surveillance and \nweapons systems. In contrast to the substantial ecological damage caused by the firing of Kuwaiti \noil wells by the retreating Iraqi army in 1991, UNEP observed a more localized diffusion of \npollutants in 2003: indeed, given their potential contamination of soil and groundwater bodies, \nunfired oil trenches were assessed to more environmentally damaging over the long-term (UNEP \n2003b: 74-79). Fuel stations and tanks were systematically targeted by Israeli military forces in the \n2008\/2009 Gaza Strip hostilities, although the UNEP post-conflict environmental assessment \nuncovered no evidence of major oil pollution incidents (UNEP 2009a: 30-31): here, the small-scale, \ndispersed nature of Gazan industrial facilities is likely to have reduced the risk of high-consequence \noil pollution from military strikes. \n \n3.1.4 Physical degradation of ecosystems \n \nNo military actions in the 2003 Iraqi conflict had ecological effects comparable in scale to the \nmassive degradation of ecosystems unleashed by domestic policy choices in the preceding decade, \nnotably the destruction of the Mesopotamian marshlands as a result of the construction of upstream \ndams and politically-motivated drainage schemes. UNEP’s Desk Study on the Environment in Iraq \nillustrates vividly the shrinkage of the southern wetlands, with dramatic losses in biodiversity \n(2003b: 39-44). Elsewhere in Iraq, over-exploitation of dryland ecosystems had increased the risk \nof desertification prior to the Coalition invasion. In terms of ecosystem damage during the 2003 \nIraqi war, UNEP estimated widespread degradation to desert environments from intensive military \nactivities. The use of depleted uranium munitions by Coalition forces was also highlighted as giving \nrise to environmental and health risks, although with continuing uncertainties as to the long-term \neffects (UNEP 2003b: 80-82; UNEP 2003c: 20-21). \n \nFor the Gaza Strip, Operation Cast Lead had major environmental effects on its already vulnerable \nfarmland. In its 2009 environmental assessment, UNEP reports on the findings of a UNDP post-\nconflict survey, which claimed that 17% of the total cultivated area of the Gaza Strip was seriously \ndamaged, including 17.5% of the orchards and 9.2% of open fields. A long-term reduction in \nagricultural productivity is also forecast as a result of the extensive destruction of the vegetation \ncover, because of: (i) the mixing and degradation of the thin topsoil cover, (ii) the unavailability of \nheavy ploughing machinery to break up dense soil crusts caused by the tracks of Israeli military \nvehicles, (iii) increased sensitivity to soil erosion and desertification, and (iv) the intolerance of \nyoung fruit and olive saplings to the brackish water now routinely used for irrigation in the Gaza \nStrip (UNEP 2009a: 32). Furthermore, the rebuilding and restocking of destroyed greenhouses, \nlivestock and poultry farms is severely constrained by Israeli and Egyptian restrictions on the \nmovement of people and materials across their borders with the Gaza Strip. \n \n \n 6 \n3.2 DIRECT ENVIRONMENTAL EFFECTS OF OCCUPATION PRACTICES \n \nDirect changes to natural resources and ecosystems may also be caused by occupation practices. \nUnder Article 147 of the Fourth Geneva Convention, destruction and appropriation of civilian \nproperty is only justified by ‘military necessity’, which would cover, for example, the unavoidable \ndegradation of water and agricultural resources as a result of the movement and deployment of \nmilitary assets. Outside such direct consequences, the occupying power is bound by humanitarian \nlaw not to utilize natural resources for the purposes of its domestic population: should these \nresources be privately owned, there is a prohibition against confiscation (Hague Regulations, \nArticle 46) and, if they are publicly owned, there is an obligation to administer them under the rules \nof usufruct; that is, a right of use that conserves the capital stock of the resources in question \n(Hague Regulations, Article 55). International environmental law reinforces the principle here that \nthe occupying force should not create long-term environmental damage: Principle 21 of the 1972 \nStockholm Declaration on the Human Environment enjoins states not to cause damage to the \nenvironment of other states or of areas beyond the limits of national jurisdiction. \n \nSince 1967 the enduring occupation by Israel of the West Bank (including East Jerusalem) and the \nGaza Strip provides much practical evidence on the environmental effects of the coercive control of \na territory. Israel has always been resistant to the notion that the Fourth Geneva Convention is de \njure applicable to the occupied Palestinian territory (oPt), though the Supreme Court of Israel has \nrepeatedly ruled that the West Bank and the Gaza Strip are areas subject to the application of law of \nbelligerent occupation (Dinstein 2009: 23). Authoritative representatives of the international \ncommunity, including the UN and the High Contracting Parties to the Fourth Geneva Convention, \nhave also consistently maintained the international humanitarian law applies to the oPt. This \nincludes the Gaza Strip even after the unilateral Israeli disengagement in September 2005, because, \nit is claimed, effective control is still exercised by Israel. Similarly, while annexed by Israel in \n1980, the international community continues to regard East Jerusalem as subject to occupation. The \napplication of humanitarian law to the oPt raises critical issues about the environmental \nresponsibilities and impacts of the occupying power and its citizens, including the 290,000 Israeli \nsettlers who currently reside in the West Bank (in contravention of Article 49 of the Geneva \nConvention and Article 8(2)(b) of the Rome Statute of the International Criminal Court). \n \n3.2.1 Water resources \n \nThe oPt has low levels of per-capita water availability – three-quarters of the population are \nestimated to consume between 60-100 liters for domestic use per capita per day (lcpd) compared to \n330 lcpd in Israel (Zeitoun 2008: 14). In the West Bank, average water availability for Palestinians \nis lowest at 50 lcpd compared to 369 lcpd for Israeli settlers. In the Gaza Strip it is just over 90 lcpd, \nwith very poor drinking water quality (World Bank 2009: 13, 28). This situation is of ongoing \nhumanitarian concern as the WHO minimal standard for daily water consumption for direct human \nconsumptive needs is 100 lcpd. According to recent reports by the World Bank (2009) and Amnesty \nInternational (2009), Palestinian water insecurity is largely the result of the occupation, as Israel \neffectively controls shared Israeli-Palestinian water resources. While joint governance rules and \nwater allocations were established under the 1995 Oslo Interim Agreement, these have failed to \nallow the development of a functioning water infrastructure for the Palestinians, entrenching instead \na highly asymmetric access to water resources in the West Bank. In the Gaza Strip, the economic \nblockade has prevented necessary investments in water and sanitation, including local desalination \ncapacity and the option of transferring water from the West Bank Mountain Aquifer: as a result the \nCoastal Aquifer is being severely degraded by over-extraction and pollution from sewage and \nirrigation (UNEP 2009b: 55-62). \n \n 7 \nThe effects of the occupation on water resources are compounded by the Israeli ‘security fence’ or \nbarrier complex constructed first along the border with Gaza in 1987 in response to the First \nIntifada, and then, since 2002, as a Separation Barrier from the West Bank (eventually to reach a \nplanned 763km), running mostly within the Palestinian side of the Green Line and encompassing \nmajor Israeli settlements in occupied territory. For the Gaza Strip, this has meant the denial of entry \nto equipment and supplies necessary to repair water facilities following the recent conflict. In the \nWest Bank, movement and access restrictions on the civilian population are having severe public \nhealth and environmental impacts. For the crucial Western Aquifer Basin, for example, which is the \nlargest groundwater resource between the two territories, Israeli prohibition of new Palestinian \nwells, and restrictions to existing Palestinian wells caught on the Israeli side of the Separation \nBarrier, are significantly reducing supplies of agricultural water for the northern West Bank \n(Trottier 2007: 121). \n \n3.2.2 Agricultural resources \n \nAs agriculture in the West Bank and the Gaza Strip accounts for two-thirds of Palestinian \nwithdrawn water, water deficits induced by the Israeli occupation have significantly constrained the \ngoals of the Palestinian Authority to develop this sector – one that accounts for 10% of Palestinian \nGDP and 15% of total employment. Coupled with declining water availability, access and \nmovement restrictions have inhibited agricultural labor inputs and the export of agricultural goods \n(World Bank 2009: 25-26). In the West Bank, plans to increase the contribution of irrigated \nagriculture (currently only 6% of the cultivated area), which would be supportive of high value \nvegetable and fruit crops, have been held back by Israeli restrictions on well-drilling. Israeli \ngovernment and settler activities are also a significant constraint on Palestinian agricultural \nactivities; for example, the politically-motivated destruction of Palestinian olive trees by settlers, \nalong with the clearance of agricultural land for the construction\/expansion of settlements and their \nassociated security infrastructure. Similarly, investment in the agricultural sector in the Gaza Strip \nhas been frustrated by the Israeli closure regime imposed following the election into government of \nHamas: farmers have substantially reduced the planting of export crops (e.g. cherry tomatoes, \npeppers, cucumbers) on account of the severe difficulties in moving them across the border. \n \nIt should be noted that the agricultural sector is also a crucial underpinning of the food security of \nthe Palestinian population, and here occupation practices have increased the vulnerabilities of \nhouseholds and communities. In 2008 25% of the West Bank population and 56% of the Gaza \npopulation were deemed by the Food and Agriculture Organization to be food insecure, resulting in \nmajor food aid interventions by international humanitarian agencies (FAO 2008). While recent \ndroughts have affected food production (particularly for the rain-fed cultivated fields and \nrangelands of the West Bank), these climatic stresses have been accentuated by the security and \nsettlement practices of the occupying power. To be sure, the attribution of agricultural sector \nimpacts to particular occupation practices is often contested between the Israeli Government and the \nPalestinian Authority, and the institutional weaknesses of the latter are also a contributing factor to \nfood insecurity. However, there is consensus amongst international organizations active in the oPt – \n e.g. UNDP, FAO, World Food Programme – that the occupation is significantly impeding the \ndevelopment of the Palestinian agricultural sector. This includes indirect environmental effects \nfrom the coping strategies employed by local communities (see Section 3.3. below). \n \n3.2.3 Waste pollution \n \nIn its Desk Study on the Environment in the Occupied Palestinian Territories, UNEP (2003a) noted \nwith alarm the various environmental and health threats from waste pollution in the West Bank and \nGaza Strip caused by: (i) a lack of treatment facilities for wastewater resulting in pollution of the \nMountain (West Bank) and Coastal (Gaza Strip) Aquifers, (ii) the open burning of municipal solid \n 8 \nwaste and the mixing in landfill sites of hazardous and non-hazardous waste, and (iii) the lack of \nstorage and disposal options for hazardous wastes. Inadequate management by Palestinian \nauthorities was blamed for some of these environmental risks, but a number were directly linked to \noccupation practices. For wastewater pollution, it is notable that, since 1967, Israel has only \nestablished one sewage pre-treatment plant (at Tulkarem) for the Palestinian population in the West \nBank, and has also blocked or delayed the upgrading of the three sewage treatment plants in Gaza. \nEven more obviously a consequence of occupation is the release of large quantities of poorly treated \ndomestic and industrial sewage by most of the Israeli settlements and outposts in the West Bank: in \naddition, approximately 200,000 Israelis living beyond the Green Line in East Jerusalem produce \nsubstantial quantities of untreated or partially treated sewage that flows eastwards into the West \nBank, causing environmental damage to soil and water resources (Amnesty International 2009: 69-\n70). \n \nIn 2003 UNEP judged Israeli environmental authorities to have limited control over an estimated \n131,000 tons of solid waste produced by the Israeli settlements in the West Bank (UNEP 2003a: 59-\n68). Until Israeli National Master Plan 16 (1986) on solid waste treatment, hundreds of illegal waste \ndumps were scattered across Israel and the oPt. The subsequent decommissioning of dump sites \nonly applied to Israel, and though military orders issued by the Israeli Civil Administration in the \nWest Bank applied Israeli waste disposal standards to settlements, the Palestinian Authority has \nalleged that the unregulated disposal of untreated solid waste (including hazardous wastes) \ncontinues and that decommissioned sites have not been made safe (Tagar and Qumsieh 2006: 12-\n13; Amnesty International 2009: 70). As with wastewater management, access and movement \nrestrictions associated with the occupation have hampered solid waste management. In the West \nBank, curfews and roadblocks, which increased in the wake of the Second Intifada, have disrupted \nthe transfer of waste to municipal disposal sites, triggering the creation of unregulated, temporary \ndisposal sites and the open burning of waste. For the Gaza Strip, the temporary storage and burning \nof waste intensified during and after Operation Cast Lead, while the shutting down of incinerators \n(due to electricity shortages) resulted in the indiscriminate dumping of hazardous wastes in landfill \nsites (UNEP 2003a: 58-70; UNEP 2009a: 44-54). \n \n3.2.4 Conservation of biodiversity \n \nThe variety of physical environments within the oPt gives rise to rich land and marine biodiversity. \nWhile there is no systematic database of biodiversity in the Gaza Strip and the West Bank, the oPt \nshares threats to biodiversity with other territories in the Mediterranean biome – these include rising \nhuman population density, urbanization, agricultural land use and invasive species. However, the \nunique structures and practices of the occupation have negatively affected biodiversity. In the West \nBank, the main negative effects have been caused by extensive settlement building, the construction \nof the Separation Barrier, and the associated growth of a parallel road infrastructure for the use of \nsettlers and the military. Not only have these practices resulted in the loss and fragmentation of \nwildlife habitats, they have also eroded the rich agricultural biodiversity built up over centuries by \nPalestinian farmers, from crop varieties to domesticated bees (UNEP 2003a: 95-103). In the Gaza \nStrip, desertification processes in the southern agricultural lands have been accelerated by the \nimposition by the Israelis of a closed security area along the border, preventing farmers from \ngaining access to their lands. The Strip has one protected natural area. In 2002 the Palestinian \nAuthority established the Wadi Gaza Nature Reserve on a salt marsh ecosystem that historically \nserved as a major resting point for migratory birds: this site has been severely degraded by sewage-\nrelated contamination, which at least in part is attributable to delays in installing a wastewater \ntreatment plant as a result of the Israeli blockade on materials and investment into Gaza (UNEP \n2009a: 41-42, 50). \n \n 9 \nIt should be noted that military interventions do not necessarily generate negative ecological \nconsequences for biodiversity. There are historical examples of landscapes and ecosystems \nbenefitting ecologically from exclusionary zones enforced by the military, such as the Korean and \nCypriot demilitarized zones (e.g. Pearson et al. 2010). Similarly, recent efforts to restore the \nMesopotamian marshes in Iraq indicate that military interventions and occupations may enable \necological restoration of previously degraded ecosystems (Stevens 2007). Nevertheless, in the \nPalestinian and Iraqi cases, the direct ecological effects of occupations have been judged by \ninternational organizations to be overwhelmingly negative on balance. \n \n \n3.3 INDIRECT ENVIRONMENTAL EFFECTS OF OCCUPATION PRACTICES \n \nAs with conflict more generally, occupation practices can indirectly affect natural resources and \necosystems by influencing (constraining or enhancing) the adaptive coping strategies employed by \nlocal populations and displaced people (UNEP 2009b: 6). These indirect environmental effects, \nmediated by the behavior of the occupied population, are multiple, and can be assessed according to \ndifferent timeframes and scales, but generally they relate to the means by which affected \ncommunities respond to the material and social constraints imposed on them by an occupation. Of \ncourse, even assuming the occupying power complies with international humanitarian law, the \ncoercive nature of belligerent occupation often entails significant restrictions on the livelihood \noptions for affected civilians. Aside from the environmental consequences caused by military \nactions preceding or interrupting an occupation, the civilian population must also cope with, and \nadapt to, the stresses of occupation practices, such as movement restrictions, personal insecurity and \ndisincentives to wealth creation.  \n \nIn Iraq under the Coalition Provisional Authority (April 2003 to June 2004), the severe lack of \nsecurity and stability aggravated humanitarian demands from a population already weakened by the \nconflict and the preceding UN sanctions regime. The collapse of the oil and agricultural sectors (the \ntwo largest sectors of employment), along with insurgent attacks in major urban areas, saw a \ndramatic reduction in livelihood opportunities (Sen 2003). As the scale of the humanitarian crisis in \nIraq was not foreseen by the occupying powers, it overwhelmed their post-invasion governance \ncapacity. The Iraqi population became heavily dependent on international aid, while natural \nresource use was plagued by corruption and illegal trade, notably in oil. It should be noted that the \nCoalition Provisional Authority did attempt to facilitate environmental benefits in some of the \nrecovery and coping strategies it directed at the occupied population. For example, in October 2003, \nthe US Government began a three-year agricultural reconstruction and development program: $343 \nmillion was invested in activities that included soil conservation, improved water management and \nsupport for agricultural livelihoods (USAID 2009). Nevertheless, the great bulk of the $33 billion in \ngrants and loans pledged by international donors in October 2004 did not address environmental \nissues (UN Development Group\/World Bank 2006: 6). \n \nIn a protracted belligerent occupation, as with the Israeli presence in Palestinian territory, there may \nbe long-term damage to the capabilities and assets of the affected population (including refugees \nand internally displaced groups) resulting in negative environmental effects. Such damage is more \nlikely to the extent that the protective rules of humanitarian law are not effectively implemented or \nenforced. There is strong prima facie evidence that this is the case in both the West Bank and Gaza. \nIn the former area, Israel control of natural resources and movement restrictions on the Palestinian \npopulation have increased  environmental pressures; for example, rangeland degradation in the \nsouth Hebron hills caused by over-grazing, because Palestinians are denied access to traditional \npastures and other livelihood opportunities. In the Gaza Strip, the Israel blockade has induced short-\nterm coping mechanisms with negative environmental and social effects; for example, the use of \nvegetable oils for fuel causing local air pollution, soil contamination as a result of the use of \n 10 \nuntreated wastewater for agriculture, and increased water scarcity from unregulated well-digging \n(UNDP 2010). While Palestinian governance failings are apparent in both the West Bank and Gaza \n(see Section 3.4 below), the occupying power has major responsibility, both legally and practically. \n \nClimate hazards and other external environmental stresses can also affect the indirect environmental \neffects of occupation. In Iraq, post-conflict recovery of irrigated agriculture and the Mesopotamian \nmarshlands has been threatened by three years of drought, as well as upstream damming of the \nEuphrates and Tigris rivers by Syria and Turkey. Benvenisti has argued that the law of occupation \nincludes grounds for the occupying power to safeguard freshwater resources by negotiating with \nneighboring states (2003: 870-872), though the Coalition Provisional Authority made no such \nrepresentations to Syria and Turkey. For Palestinians, climate change modeling predicts, over this \ncentury, a decrease in precipitation of up to 35% (with significant seasonal variation), a significant \nwarming of between 2.60C and 4.80C, and a tendency towards more extreme weather events. The \nbiophysical impacts forecast include an increased probability of flash floods, droughts, \ndesertification and saline intrusion into groundwater (UNDP 2010: 49-56). According to UNDP, the \nIsraeli occupation has significantly weakened the capacity of Palestinians to cope with, and adapt \nto, climate hazards, notably from restrictions imposed on the development of efficient water \ninfrastructure, as well as the loss and degradation of agricultural land as a result of security and \nsettlement practices (UNDP 2010). \n \n \n3.4 INSTITUTIONAL CHANGES \n \nThe conflict preceding or interrupting a belligerent occupation can disable or remove the domestic \ngovernance institutions within an affected territory. Even if not directly targeted, the collapse of \nenvironmental management institutions may lead to uncontrolled resource exploitation and \npollution (UNEP 2009b: 6). In addition, the immediate priorities of the occupation government are \nlikely to be the maintenance of the rule of law rather than environmental regulation. International \nhumanitarian law nevertheless calls on the occupying power to pursue an ‘effective administration’ \nover the territory it controls, as explicitly noted in Security Council Resolution 1483 on Iraq \n(Benvenisti 2006: 863). This resolution obliged the US and UK to promote the welfare of the Iraqi \npeople, which included their lawful right to proceeds from the exploitation of oil and natural gas \nresources. In the case of the occupied Palestinian territory, the unprecedented length of the Israeli \noccupation has raised far-reaching questions as to how the responsibility for environmental \nmanagement should be allocated when there are different levels of control exercised over East \nJerusalem, the Gaza Strip and the West Bank (including different categories of control within the \nWest Bank, as well as the separate application of Israeli domestic law to the settlements). \n \nGiven the complexity and costs of governing an occupied territory, it is not surprising that, subject \nto the oversight of the occupying power(s), domestic authorities may be allowed to perform \ngovernmental functions (Schmitt 2003). In Iraq the Coalition Provisional Authority created an Iraqi \nGoverning Council as early as July 2003, and by September this had established a new Ministry of \nEnvironment under the responsibility of a Cabinet-level Minister. As noted by a UN Post-Conflict \nAssessment Team, the new ministry inherited most of the staff and organizational structure of the \nprevious Environmental Protection and Improvement Directorate. The rationale was to maintain the \nacknowledged expertise and effective decentralization of Iraqi environmental governance, although \nthe new ministry was judged to require substantial international assistance to cope with the scale of \npost-conflict environmental damage (UNEP\/DEP 2003). What was not foreseen in 2003 was that \nthe severe security situation in Iraq would for years inhibit capacity-building of environmental \ninstitutions. \n \n 11 \nIn the occupied Palestinian territory, delegation of various environmental governance functions is \nenabled by the Oslo Accords, agreed in 1993 (Oslo I) and 1995 (Oslo II) between Israel and \nPalestinian political representatives. The Accords, which were planned to be interim self-\ngovernment arrangements until a permanent peace settlement, allowed the creation of the \nPalestinian National Authority (PNA) as an autonomous political entity. In 2000 the PNA created a \nMinistry of Environmental Affairs (subsequently renamed the Environmental Quality Authority) to \noversee the development of environmental policy in the West Bank and Gaza. With assistance from \ninternational donors, the Environmental Quality Authority has developed professional expertise and \nregulatory competence relating to natural resources, pollution, biodiversity, land degradation and \ncultural heritage. Other PNA entities – notably the Palestinian Water Authority and Ministry of \nAgriculture – also have environmental management responsibilities, and cooperate with the \nenvironmental authority. While the Oslo Accords facilitated the development of environmental \ngovernance in the oPt, this capacity is nevertheless significantly compromised by the Israeli \noccupation. For example, Israel remains responsible for civil affairs and security in 60% of the \nWest Bank (Area C) and, even outside Area C, movement and access restrictions weaken the \nexercise of Palestinian regulatory powers. As already noted, Israel also retains control of shared \nPalestinian-Israeli water resources, which, according to recent independent reviews (Amnesty \nInternational 2009; World Bank 2009), are neither equitably allocated nor sustainably managed. \n \nThe environmental policy responsibilities of an occupying power come under its humanitarian \nobligations to take care of the civilian population and to undertake responsible management of \nnatural resources. It remains an open question as to how far an occupying power should facilitate, \nor allow, improvements in environmental governance capacity that exceed those present in the \ncountry prior to occupation. In the scholarship on international humanitarian law, there is a \nrecognition that occupying powers may be justified, under human rights considerations, in altering \nthe constitutional and legal order governing the subject population – what Roberts (2006) labels \n‘transformative military occupation’: the introduction of a democratic constitution to Iraq is one \nsuch example, which is potentially positive in terms of respect for human rights. If democratic \ngovernance becomes a legitimate expectation in the movement away from occupation, it can \nplausibly be argued that occupying powers should promote environmental management institutions \ncompatible with a democratic political culture. Similarly, the idea that an occupied territory may \none day rejoin the international community as a sovereign state generates also the expectation that \nits environmental management targets are compatible with widely shared norms of environmental \nlaw. \n \n \n4.0 Research and policy implications \n \nThere is a modest but growing body of research on the environmental effects of occupations. While \nattention has typically been drawn to the environmental effects arising from the high-intensity \nconflict that precedes or interrupts a belligerent occupation, there is increasing recognition of the \ndirect and indirect environmental changes caused by occupation practices themselves. The \npervasiveness and often diffuse character of these effects – which may be unintended in terms of \nthe goals of the occupying power – can escape the attention of those tracking more visible \ndisruptions to the physical environment. It is here that warfare ecology can make a significant \ncontribution both to the development of research on the effects of occupations and also to policy \nconsiderations for reducing these effects. \n \n \n \n \n \n 12 \n4.1 RESEARCH IMPLICATIONS \n \nIn their manifesto for warfare ecology, Machlis and Hanson (2008) identify the need for research \nwhich considers the environmental effects of more than one stage of warfare, as well as the \ncumulative and cascading effects of particular actions. They recommend the development and \ntesting of conceptual frameworks which are capable of capturing the trajectories of these changes \nthrough coupled biophysical and socioeconomic systems. It is not surprising, therefore, that systems \ntheory lends itself to warfare ecology and that any such systemic explanation needs to be able to \naccommodate interdisciplinary inputs. As with the ecological study of other stages of warfare, the \nanalysis of occupation practices could productively be undertaken both by extensive comparative \nsurveys and intensive case studies. However, the findings should be integrated into the systemic \nexplanatory frameworks of warfare ecology. \n \nAt the same time, environmental research on belligerent occupations can add distinctive analytical \ncomponents to warfare ecology. In the first place, the interests of the occupying power\/people in \nrecovery and reconstruction suggest the opportunity for post-war insights on the long-term effects \nfrom contemporary armed conflict. Such insights are necessary for the occupying power to \nundertake effective administration and meet its international humanitarian obligations. Section 3.1 \nabove summarized some of the key ecological effects encountered in practice during the \noccupations of Iraq and the Palestinian territory. Warfare ecology can provide a fertile theoretical \nframework for categorizing and assessing the various consequences across different spatio-temporal \nscales. It can also suggest hypotheses for advancing understanding of the socio-ecological processes \nthat determine which effects are more significant and why. \n \nSecondly, warfare ecology can illuminate the inter-linkages between, on the one hand, the impacts \nof intense conflict and, on the other, the direct and indirect environmental effects of occupation \npractices. Sections 3.2 and 3.3 outlined a diverse range of direct and indirect effects as encountered, \nagain, in Iraq and the occupied Palestinian territory. These environmental effects of occupation \npractices are under-theorized, in past because of the lack of systematic ecological research on this \nstage of warfare. The nature of occupation practice, which imposes enduring stresses on the \naffected civilian population, suggests that vulnerability analysis could offer valuable insights here \nas part of a warfare ecology approach. Broad-based vulnerability perspectives are most appropriate \n(e.g. Turner et al. 2003; Adger 2006) as they encompass the role of socio-economic and political \npressures on individuals and groups who are also facing war-related environmental effects. \nVulnerability analysis is also in tune with the openness of warfare ecology to the multi-scalar \noperation of human-biophysical processes; for example, how an occupied population may be \nvulnerable to events outside the control of an occupying power, such as the impacts of climate \nchange and variations in world food prices. \n \nTo advance such an understanding, there is a need, thirdly, for the formulation and use of \nstandardized methodologies. There are already examples of best practice to draw upon in order to \nguide warfare ecological analyses of occupations. The environmental assessment methodology \ndeveloped by UNEP is arguably the most mature and scientifically robust: UNEP now has over a \ndecade of experience conducting post-conflict environmental assessments (PCEAs), and these \nstudies demonstrate the importance of context-sensitive data gathering and analysis. As noted above \nin Section 3.0, the diverse methods employed in practice have included background research, \nremote sensing, fieldwork and laboratory analysis. Of course, PCEAs are usually conducted in a \nreactive fashion, with a methodological focus on sites severely damaged by conflict rather than \noccupation practices, although there are exceptions – for example, the environmental desk study of \nthe occupied Palestinian territory (UNEP 2003a). Warfare ecology can make an significant \nscholarly contribution by considering the wider ecosystem context of post-conflict environmental \n 13 \neffects. Indeed, its holistic perspective could assist PCEA practitioners in considering longer-term \nenvironmental vulnerabilities. \n \n \n4.2 POLICY IMPLICATIONS \n \nThere are also policy implications that arise from the application of warfare ecology to the study of \nbelligerent occupations. Needless to say, these implications include adding occupation-specific \ninsights to the policy outcomes suggested by Machlis and Hanson for warfare ecology more \ngenerally (2008: 733-734). Thus, ecological research on occupations may assist military planners in \npreventing or mitigating the long-term ecological and humanitarian impacts of warfare. Such \nresearch may also facilitate a more effective recovery of those ecosystem services essential to \nmeeting the basic needs of a vulnerable population in an occupation, e.g. water, food and fuel \nsecurity. Insofar as an occupying power seeks to cooperate with humanitarian agencies, warfare \necology could facilitate an agreed methodological framework for assessing environmental effects. \nWarfare ecology could, in addition, provide insights on the restoration of natural resource-\ndependent economic sectors, with a view to supporting sustainable livelihoods and other human \ndevelopment goals for occupied populations. Indeed, UNEP (2009b) has recently recommended \nwidening the environmental scope of post-conflict needs assessments to include longer-term \nenvironmental trends in relation to sustainable natural resource use. \n \nWhether or not an occupation is belligerent, the protection of environmental resources has become a \nlegitimate responsibility for military or civilian forces governing in post-conflict territories. \nHowever, the coercive character of belligerent occupation is a distinctive policy challenge, as the \nlegal obligation on an occupying power to undertake effective administration conflicts with the \nnotion that the affected population has the right to full democratic governance – at least as long as \nthe occupation lasts. As noted above (Section 3.4), it remains an open question under humanitarian \nlaw as to how much an occupying power is obliged to facilitate or promote the environmental \ngovernance capacity of domestic institutions under its effective control. In the occupied Palestinian \nterritory, for example, limits imposed by Israel on the regulatory authority and scope of Palestinian \ninstitutions have impeded the implementation of environmental policy. In Iraq under the Coalition \nProvisional Authority, efforts to build effective environmental institutions were undermined by \ncontinuing lawlessness and violent resistance. \n \n \n5.0 Conclusion \n \nBelligerent occupations are part of the conflict continuum covered by warfare ecology. They are \nalso covered by a distinctive subset of international humanitarian law (jus in bello) – the legal \nnorms governing the conduct of war. Existing humanitarian law includes provisions that prohibit \nunnecessary environmental damage, yet their application during periods of occupation is uncertain, \nrelating largely to the control of civilian resources and infrastructure by the occupying power. The \nlegal norms governing occupation are also hampered by the absence of an international enforcement \nagency: at best, these norms are selectively enforced by relevant states and international \norganizations. This chapter examined the potential role of warfare ecology in accounting for the \nenvironmental effects of belligerent occupations, highlighting the multiple, often indirect, means by \nwhich such occupations affect ecological processes. Substantive examples were drawn from the \noccupation of Palestinian territory by Israel and the occupation of Iraq by the Coalition Provisional \nAuthority.  \n \nIt was argued that warfare ecology can make a major contribution to assessing the effects of \noccupations and, through the generation of policy advice, to promote means for reducing negative \n 14 \necological consequences. Nevertheless, there remains unresolved the question as to the nature and \nscope of environmental protection duties borne by an occupying power under international \nhumanitarian law. On the one hand, these seem largely indirect: in its overriding responsibility to \nmeet the needs of the civilian population, the occupying power is obliged at best to exercise the \nguardianship of natural resources under its control. On the other, this role of ‘temporary trusteeship’ \nindicates that the occupied population actually retains permanent sovereignty over these resources \nand associated ecosystem services. If the latter is the case, then warfare ecology has a vital role to \nplay in showing how the environmental responsibility of an occupying power is much more than the \nprevention or mitigation of particular impacts arising from its military activities. Indeed, it implies \nthat the occupying power must strive to ensure that the occupied population is also protected from \nother sources of significant environmental harm. \n \n \nReferences \n \nAdger, W.N. (2006) Vulnerability. Global Environmental Change 16(3): 269-281. \n \nAmnesty International (2009) Troubled Waters: Palestinians Denied Fair Access to Water, \nLondon: Amnesty International \nhttp:\/\/www.amnesty.org\/en\/library\/asset\/MDE15\/027\/2009\/en\/e9892ce4-7fba-469b-96b9-\nc1e1084c620c\/mde150272009en.pdf \n \nBenvenisti, E. (2003) Water conflicts during the occupation of Iraq. American Journal of \nInternational Law 97(4): 860-872. \n \nBunker, A.L. (2004) Protection of the environment during armed conflict: one Gulf, two wars. \nReview of European Community and International Environmental Law 13(2): 201-213. \n \nDinstein, Y. (2009) The International Law of Belligerent Occupation, Cambridge: Cambridge \nUniversity Press. \n \nFood and Agriculture Organization (2008) Social Protection in the West Bank and Gaza Strip: \nWorking Paper 5: Household Food Security Profiling. Rome: FAO. \n \nInternational Committee of the Red Cross (2010) International Humanitarian Law: Hague \nConvention IV Respecting the Laws and Customs of War on Land, Geneva: ICRC. \nhttp:\/\/www.icrc.org\/ihl.nsf\/FULL\/195?OpenDocument \n \nIRIN News (2008) Health threat posed by aging water supply networks, IRIN: United Nations. \nhttp:\/\/www.irinnews.org\/PrintReport.aspx?ReportId=81077 \n \nMachlis. G.E. and T. Hanson (2008) Warfare ecology. BioScience 58(8): 729-736. \n \nOkowa, P. (2009) Environmental justice in situations of armed conflict. In J. Ebbeson and P. \nOkowa (eds) Environmental Law and Justice in Context, Cambridge: Cambridge University Press, \npp. 231-252. \n \nPearson, C., P. Coates and T. Cole (eds) (2010) Militarized Landscapes: From Gettysburg to \nSalisbury Plain, London: Continuum. \n \nPhysicians for Human Rights (2003) Health and Human Rights Consequences of War in Iraq: A \nBriefing Paper, Boston, MA: Physicians for Human Rights. \n 15 \nhttp:\/\/physiciansforhumanrights.org\/library\/documents\/reports\/health-and-human-rights.pdf \n \nRoberts, A. (2006) Transformative military occupation: applying the laws of war and human rights. \nAmerican Journal of International Law 100(3): 580-622. \n \nSchmitt, M.N. (1997) Green war: An assessment of the environmental law of international armed \nconflict. Yale Journal of International Law 22(1): 1-109. \n \nSchmitt, M.N. (2003) The Law of Belligerent Occupation, Washington: Crimes of War Project \nhttp:\/\/www.crimesofwar.org\/print\/onnews\/iraq5-print.html \n \nSen, B. (2003) Iraq Evaluation Report: Iraq Watching Brief: Overview Report, New York: \nUNICEF http:\/\/www.unicef.org\/evaldatabase\/index_29697.html \n \nStevens, M.L. (2007) Iraq and Iran in ecological perspective: the Mesopotamian marshes and the \nHamizeh-Azim Peace Park. In S.H. Ali (ed) Peace Parks: Conservation and Conflict Resolution, \nCambridge, MA; MIT Press, pp. 313-331. \n \nTagar, Z. and V. Qumsieh (2006) A Sleeping Time Bomb: Pollution of the Mountain Aquifer by \nSolid Waste, Amman: EcoPeace\/Friends of the Earth Middle East. \n \nTrottier, J. (2007) A wall, water and power: the Israeli ‘separation fence’. Review of International \nStudies 33(1):105-127. \n \nTurner, B.L. et al. (2003) A framework for vulnerability analysis in sustainability science. \nProceedings of the National Academy of Science, 100(14): 8074-8079. \n \nUN Development Group\/World Bank (2006) PCNA Review: Phase One: Iraq Needs Assessment, \nNew York: UN Development Group\/World Bank \nhttp:\/\/www.uniraq.org\/documents\/Iraq_PCNA_Case_Study.pdf \n \nUNDP (2010) Climate Change Adaptation Strategy and Programme of Action for the Occupied \nPalestinian Authority, Jerusalem: UNDP \n \nUNEP (2003a) Desk Study on the Environment in the Occupied Palestinian Territories, Geneva: \nUNEP http:\/\/postconflict.unep.ch\/publications\/INF-31-WebOPT.pdf \n \nUNEP (2003b) Desk Study on the Environment in Iraq, Geneva: UNEP \nhttp:\/\/postconflict.unep.ch\/publications\/Iraq_DS.pdf \n \nUNEP (2003c) Environment in Iraq: UNEP Progress Report, Geneva: UNEP \nhttp:\/\/postconflict.unep.ch\/publications\/Iraq_PR.pdf \n \nUNEP (2009a) Environmental Assessment of the Gaza Strip, Geneva: UNEP \nhttp:\/\/www.unep.org\/PDF\/dmb\/UNEP_Gaza_EA.pdf \n \nUNEP (2009b) Integrating Environment in Post-Conflict Needs Assessments, Geneva: UNEP \nhttp:\/\/postconflict.unep.ch\/publications\/environment_toolkit.pdf \n \nUNEP\/DEP (2003) Needs Assessment for Identification of Environmental Priorities in Iraq, \nGeneva: UNEP\/DEP\/Post-Conflict Assessment Unit \n \n 16 \nUSAID (2009) USAID: Assistance for Iraq: Agriculture, Washington: USAID \nhttp:\/\/www.usaid.gov\/iraq\/accomplishments\/agri.html \n \nWorld Bank (2009) West Bank and Gaza: Assessment of Restrictions on Palestinian Water Sector \nDevelopment, World Bank: Jerusalem http:\/\/unispal.un.org\/pdfs\/47657-GZ.pdf \n \nZeitoun, M. (2008) Power and Water in the Middle East: The Hidden Politics of the Palestinian-\nIsraeli Water Conflict, London: Tauris \n \n \n"}