{"doi":"10.1063\/1.1302426","coreId":"68612","oai":"oai:eprints.lancs.ac.uk:31950","identifiers":["oai:eprints.lancs.ac.uk:31950","10.1063\/1.1302426"],"title":"The role of noise in forming the dynamics of a quasiperiodic system","authors":["Khovanova, N. A.","Khovanov, I. A.","Anishchenko, V. S.","McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2000","abstract":"The dynamical properties of the quasiperiodic logistic map with and without a very weak noise are compared, and the influence of noise on its strange nonchaotic attractor (SNA) is investigated. It is found that, in the presence of weak noise, the largest Lyapunov exponent gives misleading information about the dynamical properties of the attractor. We have shown that, in the presence of noise, the properties of strangeness and chaos are invariably associated, so that SNAs are not then observed during the transition to chaos from the torus","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68612.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/31950\/1\/AIPlakes2000RoleOfNoise.pdf","pdfHashValue":"caf95e9ad38fd99b4974d8a20ebb5254d3c71b25","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:31950<\/identifier><datestamp>\n      2017-12-18T00:03:54Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The role of noise in forming the dynamics of a quasiperiodic system<\/dc:title><dc:creator>\n        Khovanova, N. A.<\/dc:creator><dc:creator>\n        Khovanov, I. A.<\/dc:creator><dc:creator>\n        Anishchenko, V. S.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        The dynamical properties of the quasiperiodic logistic map with and without a very weak noise are compared, and the influence of noise on its strange nonchaotic attractor (SNA) is investigated. It is found that, in the presence of weak noise, the largest Lyapunov exponent gives misleading information about the dynamical properties of the attractor. We have shown that, in the presence of noise, the properties of strangeness and chaos are invariably associated, so that SNAs are not then observed during the transition to chaos from the torus.<\/dc:description><dc:date>\n        2000<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31950\/1\/AIPlakes2000RoleOfNoise.pdf<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31950\/4\/AIPlakes2000RoleOfNoise.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.1302426<\/dc:relation><dc:identifier>\n        Khovanova, N. A. and Khovanov, I. A. and Anishchenko, V. S. and McClintock, Peter V. E. (2000) The role of noise in forming the dynamics of a quasiperiodic system. AIP Conference Proceedings, 502. pp. 488-493. ISSN 0094-243X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/31950\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"sq","id":41,"name":"Albanian"},"relations":["http:\/\/dx.doi.org\/10.1063\/1.1302426","http:\/\/eprints.lancs.ac.uk\/31950\/"],"year":2000,"topics":["QC Physics"],"subject":["Journal Article","NonPeerReviewed"],"fullText":"The Role of Noise in Forming\nthe Dynamics of a Quasiperiodic System\nNatalia A\u0002 Khovanova\n\u0000\n\u0003 Igor A\u0002 Khovanov\n\u0000\n\u0003 Vadim S\u0002Anishchenko\n\u0000\nand Peter V\u0002E\u0002 McClintock\ny\n\u0000\nDepartment of Physics\u0002 Saratov State University\u0002\nAstrakhanskaya str\u0003 \u0004\u0005\u0002 \u0006\u0007\b\b\t\n Saratov\u0002 Russia\ny\nDepartment of Physics\u0002 Lancaster University\u0002 Lancaster\u0002 LA\u0007 \u0006YB\u0002 UK\nAbstract\u0002 The dynamical properties of the quasiperiodic logistic map with and with\u0002\nout a very weak noise are compared\u0003 and the in\u0004uence of noise on its strange nonchaotic\nattractor \u0005SNA\u0006 is investigated\u0007 It is found that\u0003 in the presence of weak noise\u0003 the\nlargest Lyapunov exponent gives misleading information about the dynamical proper\u0002\nties of the attractor\u0007 We have shown that\u0003 in the presence of noise\u0003 the properties of\nstrangeness and chaos are invariably associated\u0003 so that SNAs are not then observed\nduring the transition to chaos from the torus\u0007\nDuring the last thirty years\u0002 quasiperiodic systems\u0002 i\u0003e\u0003 those whose dynamics is\nformed by signals with two or more independent frequencies\u0002 have attracted the\nattention of scientists from many di\u0004erent \u0005elds\u0003 Such systems display interesting\nand often unexpected properties\u0002 one of which is the presence of strange nonchaotic\nattractors \u0006SNAs\u0007 \b\t\n\u0003 Before SNAs were discovered it was assumed that strange\nand chaotic were synonyms\u0002 even though they describe quite di\u0004erent features\u000b the\nattractor\fs geometrical and dynamical properties respectively\u0003 An SNA is strange\nin that it has a geometrically complex structure \u0006i\u0003e\u0003 the attractor is not a \u0005nite\nset of points\u0002 and is not piecewise di\u0004erentiable\u0007\u0002 and it is nonchaotic in that it\nexhibits no sensitivity to initial conditions\u0003 In quasiperiodic systems an SNA is\nusually observed as the intermediate stage in the evolution of the system from the\ntorus to the chaotic regime \b\r\n\u0003\nIn \b\r\n and in most other papers on the subject\u0002 quasiperiodic systems are studied\nin the absence of noise\u0002 i\u0003e\u0003 no account is taken of the fact that real macroscopic\nphysical systems are always subject to random \u000euctuations\u0003 It is well known \b\u000f\n\u0002\nhowever\u0002 that the interaction between the nonlinear deterministic part of a dynam\u0010\nical system and internal or external \u000euctuations can lead to a range of interesting\nand important phenomena\u0003 In this paper\u0002 we study the in\u000euence of noise on the\nproperties of an SNA in a quasiperiodic system\u0003\nAs the object of our investigations we have chosen the quasiperiodic logistic map\u000b\nxn\u0000\u0002\n\u0011 \u0002\u0006\t \u0012 \u0003 cos \u0004\nn\n\u0007x\nn\n\u0006\t \u0000 x\nn\n\u0007 \u0012D\u0005\nn\n\u0006\n\u0004\nn\u0000\u0002\n\u0011 \u0004\nn\n\u0012 \u0007mod\r\b\u0006 \u0006\t\u0007\nin which\u000b x\nn\n\u0002 \b\u0013\u0006 \t\n\u0014 \u0007 \u0011 \r\b\t\u0014 \u0005\nn\nis Gaussian noise of intensityD\n\u0003\n\u0014 and \u0002\u0002 \u0003\u0002 \t are\nparameters\u0003 It describes the dynamics of \u000eow under a two\u0010frequency quasiperiodic\nforce and\u0002 in the absence of noise\u0002 is the paradigm system for studying SNAs\u0003 By\nchanging \u0002\u0002 we can observe in turn\u000b the torus\u0014 an SNA\u0014 and a strange chaotic\nattractor\u0003 The route by which the SNA appears has been considered in detail in\n\b\u0015\u0002\u0016\n\u0003 Following \b\u0015\n\u0002 we \u0005x \u0003 \u0011 \u0013\n\u0013\t and \t \u0011 \u0006\np\n\u0016 \u0000 \t\u0007\u000b\r\u0002 and we designate \u0002 as\nthe control parameter\u0003\nIn the absence of noise \b\u0015\n for \u0002 \f \u000f\n\u0016\r\u0017\u0018\u0013 a torus is observed\u0014 at \u0002 \u0003 \u000f\n\u0016\r\u0017\u0018\u0013\na collision occurs between the period\u0010\r repellor and the period\u0010\u0015 attractor\u0003 The\nresultant fractal structure \b\u0015\n means that for \u0002 \r \u000f\n\u0016\r\u0017\u0018\u0013 the attractor is strange\u0003\nTo con\u0005rm this picture\u0002 we have calculated \u0006Fig\u0003 \t\u0007 the fractal dimensionD\nF\n\u0002 which\nde\u0005nes the metric properties of an attractor in phase space \b\u0018\n\u000b for \u0002 \r \u000f\n\u0016\r\u0017\u0018\u0013\u0002\nD\nF\ndi\u0004ers markedly from unity\u0002 implying strangeness of the attractor\u0003\nFIGURE \u0003\u0002 Fractal dimension D\nF\nas a function of parameter \u0002 in the absence \u0005\b\u0002\t\u0006 and in the\npresence \u0005\b\n\t\u0006 of noise\u0007\nTo diagnose the presence of chaos\u0002 it is conventional to calculate the largest Lya\u0010\npunov exponent \u0006LLE\u0007 characterizing the evolution of in\u0005nitely\u0010small perturbations\nover an in\u0005nitely\u0010large time period\u0003 A positive LLE implies that the perturbation\ngrows exponentially\u0002 indicating a sensitivity to initial conditions that leads to mix\u0010\ning and thus chaos\u0003 The connection between chaos and the sign of the LLE has\nbeen strictly proven only for hyperbolic and quasihyperbolic systems \b\u0017\n\u0003 For the\nnonhyperbolic systems with which we usually deal in practice\u0002 including the logistic\nmap \u0006\t\u0007\u0002 there is as yet no rigorous proof of such a connection\u0003 In many papers\u0002\ntherefore\u0002 in addition to calculating the LLE\u0002 authors also explore sensitivity to\ninitial conditions by use of a variety of more direct methods \b\t\u0002\u0015\u0002\u0019\u001a\t\u0013\n\u0003 For ex\u0010\nample\u0002 in \b\u001b\u0002\t\u0013\n the evolution of an ensemble of initially closely spaced trajectories\nfx\ni\nn\n\u0006 \u0004\nn\ng\u0002 characterized by the same phase of the external force\u0002 is considered\u0003 If the\ndistance between trajectories tends to zero asymptotically as t\u0004\u0005 \u0006achieves the\nsize of attractor\u0007\u0002 sensitivity is absent \u0006present\u0007\u0002 and the attractor is nonchaotic\n\u0006chaotic\u0007\u0003 We have used this method\u0002 in addition to calculation of the LLE\u0002 to\ndiagnose the types of attractor in \u0006\t\u0007\u0003 To describe the evolution of an ensemble of\ntrajectories we have studied the dispersion S\u0006n\u0007 \b\u001b\n\u000b\nS\u0006n\u0007 \u0011\n\u0000\n\t\nN\nN\nX\ni\u0004\u0002\n\u0006x\ni\nn\n\u0000 hx\ni\nn\ni\u0007\n\u0003\n\u0002\n\u0002\u0002\u0003\n\u0014 \u0006\r\u0007\nhereN is the number of trajectories in the ensemble\u0002 and \u001ch i\u001d indicates an ensemble\naverage\u0003 A set of points fx\ni\n\u0005\ng at time t \u0011 \u0013 is located within an interval of length\nl \u0011 \u0013\n\u0013\u0013\u0013\t\u0002 at the center of which lies a point belonging to the attractor\u0003 The\nsensitivity to initial conditions may then be characterized by e\u0003g\u0003 the maximal\ndispersion S\nmax\n\u0003 This has been calculated over \t\u0013\u0013\u0013\u0013\u0013\u0013 iterations\u0002 following a\nrelaxation time of similar duration\u0003\nIn Fig\u0003 \r the LLE and S\nmax\nas functions of \u0002 are shown by the circle data\u0003 It can\nbe seen \u0006Fig\u0003 \r\u0006a\u0007\u0007 that\u0002 for \u0002 \f \u000f\n\u0016\r\u0017\u001b\r\u0002 the LLE is negative indicating an absence\nof sensitivity to initial conditions\u0003 Consistent with \b\u0015\u0002\t\t\n and the results shown in\nFig\u0003 \t and Fig\u0003 \r\u0006a\u0007\u0002 we con\u0005rm that in the noise\u0010free \u0006D \u0011 \u0013\u0007 map\u000b for \u0002 \f \u000f\n\u0016\r\u0017\u0018\u0013\nthe torus is an attractor of the map \u0006region \t\u0007\u0014 that for \u000f\n\u0016\r\u0017\u0018\u0013 \f \u0002 \f \u000f\n\u0016\r\u0017\u001b\r\u0002 an\nSNA arises \u0006region \r\u0007\u0014 and that for \u0002 \r \u000f\n\u0016\r\u0017\u001b\r a strange chaotic attractor exists\n\u0006region \u000f\u0007\u0003 However\u0002 the calculated S\nmax\ndemonstrates \u0006Fig\u0003 \r\u0006b\u0007\u0007 an absence of\nsensitivity to initial conditions \u001a including the region of positive LLE\u0003\nFIGURE \u0004\u0002 LLE \u000b \u0005a\u0006 and maximal dispersion S\nmax\n\u0005b\u0006 as functions of parameter \u0002 in the\nabsence \u0005\b\u0002\t\u0006 and in the presence \u0005\b\n\t\u0006 of noise\u0007\nTo account for these apparent contradictions\u0002 we have analyzed the time evolu\u0010\ntion of an in\u0005nitely\u0010small perturbation\u0003 Its magnitude \u000e\u0006n\u0007 at iteration n is de\u0005ned\nby \u000e\u0006n\u0007 \u0011 \u000e\n\u0005\nexp\u0006\u000f\ns\n\u0006n\u0007\u0007\u0014 here \u000e\n\u0005\nis the initial perturbation at n \u0011 \u0013\u0014 and \u000f\ns\n\u0006n\u0007 is\nthe sum of local Lyapunov exponents during the time n\u000b\n\u000f\ns\n\u0006n\u0007 \u0011\nn\nX\ni\u0004\u0005\nlog j\u0002\u0006\t \u0012 \u0003 cos \u0004\ni\n\u0007\u0006\t\u0000 \rx\ni\n\u0007j\n \u0006\u000f\u0007\nThe quantity exp\u0006\u000f\ns\n\u0006n\u0007\u0007 is de\u0005ned as the factor by which the initial perturbation\n\u000e\n\u0005\nhas changed in size at the nth iteration\u0003 Note that the LLE \u001e and \u000f\ns\n\u0006n\u0007 are\nconnected by \u001e \u0011 lim\nn\u0000\u0002\n\u000f\ns\n\u0006n\u0007\u000bn\u0003 In Fig\u0003 \u000f\u0006a\u0007 the evolution of \u000f\ns\n\u0006n\u0007 is shown\nfor di\u0004erent types of attractor\u0003 For the torus and SNA\u0002 the initial perturbation\ndecreases\u0002 whereas for chaos it increases as t \u0004 \u0005\u0003 It can be seen \u0006insert in\nFig\u0003 \u000f\u0006a\u0007\u0007 that\u0002 for all types of attractors\u0002 the size of the perturbation alternately\ndecreases and increases\u0003 Thus perturbations of trajectories in the torus and SNA\nregimes are not necessarily either decreasing or increasing at any given moment of\ntime\u0003 On the other hand\u0002 in the region of the chaotic attractor\u0002 the perturbation\ncan decrease locally\u0003\nFIGURE \u0005\u0002 \u0005a\u0006 Evolution \u0003\ns\n\u0005n\u0006 for di\ferent types of attractors\r \u000e \u000f torus\u0003 \u0002 \u0010 \u0011\u0004\u0012\u0013\u0014\u0015\u0016\u0017 \u0013 \u000f\nSNA\u0003 \u0002 \u0010 \u0011\u0004\u0012\u0013\u0014\u0018\u0016\u0017 \u0011 \u000f chaotic attractor\u0003 \u0002 \u0010 \u0011\u0004\u0012\u0013\u0018\u0016\u0007 The insert is an expansion for small n\u0007\n\u0005b\u0006 \u0003\nmax\nas function of \u0002 for the torus and SNA \u0005\b\u0002\t\u0006 and for chaos \u0005\b\u0000\t\u0006\u0007\nWe have calculated the maximal factors \u000f\nmax\nof increase for the torus and SNA\u0002\nand decrease for chaos\u0003 For chaos\u0002 the perturbation decreases by more than exp\u0006\u0016\u0013\u0007\nduring some time intervals\u0002 i\u0003e\u0003 the distance between nearby trajectories of the\nensemble can decrease to a value less than the truncation errors\u0003 The trajectories\nmust subsequently evolve together because two double\u0010precision numbers di\u0004ering\nonly in the \t\u0017th decimal place cannot normally be distinguished with a computer\u0003\nFor precisely this reason\u0002 the maximal distance between nearby trajectories of the\nchaotic attractor falls to zero\u0002 despite their positive LLE \u0006Fig\u0003 \r\u0006a\u0007\u0007\u0003 In the region\nof the torus \u0006Fig\u0003 \u000f\u0006b\u0007\u0002 circles\u0002 \u0002 \f \u000f\n\u0016\r\u0017\u0018\u0013\u0007\u0002 the perturbation can increase by \u0006\nexp\u0006\t\u0016\u0007 times\u0014 for the SNA \u0006Fig\u0003 \u000f\u0006b\u0007\u0002 circles\u0002 \u000f\n\u0016\r\u0017\u0018\u0013 \f \u0002 \f \u000f\n\u0016\r\u0017\u001b\r\u0007\u0002 it can\nincrease by \u0006 exp\u0006\u0016\u0013\u0007 times\u0003 We \u0005nd that the size of initial perturbation \u000e\n\u0005\nwhich\nwill not become comparable with the size of the attractor during these time intervals\nis \u0006 \t\u0013\n\u0003\u0006\n\u0006torus\u0007 \u0002 and \u0006 \t\u0013\n\u0003\u0003\u0007\n\u0006SNA\u0007\u0003 If the perturbation exceeds these values\u0002\nthen mixing will occur\u0003 Recall however \u0006Fig\u0003 \u000f\u0006a\u0007\u0007 that perturbations within the\ntorus and SNA regimes tend to zero asymptotically as t\u0004\u0005\u0003\nIn reality we almost always deal with \u0005nite\u0010time perturbations\u0002 because the \u000euc\u0010\ntuations in real systems occur continuously\u0003 In the presence of \u000euctuations the\nsize of perturbation cannot be less than some value corresponding to the noise\nintensity \b\t\r\n\u0003 In other words\u0002 when we take account of \u000euctuations\u0002 two initial\u0010\nly close trajectories will always di\u0004er from each other by some value\u0014 this is true\neven for the regular regime\u0003 Consequently\u0002 within all regimes perturbations must\nevolve as follows\u000b during some time intervals the perturbation increases\u0002 whether\nmixing or not \u0006dependent on the noise intensity\u0007\u0002 and during other time intervals\nthe perturbation decreases to a non\u0010zero value de\u0005ned by the noise intensity\u0003\nWe now address the question\u000b does weak noise change the geometrical properties\nof the attractors\u001f We consider noise of intensity D \u0011 \t\u0013\n\u0003\u0002\b\n\u0002 substantially larger\nthan the truncation errors of \u0006 \t\u0013\n\u0003\u0002\t\n\u0003 In Fig\u0003 \t the dependence ofD\nF\non \u0002 is shown\n\u0006pluses\u0007 for the noisy system\u0003 It is evident that the geometrical characteristics\nremain quite unchanged\u0003 Next\u0002 we return to consider the dynamical properties of\nthe noisy map\u0003 We suggest that in region \u0002 \u0006Fig\u0003 \r\u0006a\u0007\u0007 the mixing of trajectories will\nbe absent because\u0002 for mixing\u0002 it is necessary for the initial perturbation to exceed\n\u0006 \t\u0013\n\u0003\u0006\n\u0003 In region \u0003 we will observe mixing which must occur where \u000euctuations\nexceed \t\u0013\n\u0003\u0003\u0007\n\u0003 So\u0002 the behavior of trajectories in regions \u0003 and \u0004 must be similar\u0003 In\ngeneral they cannot be distinguished for noise intensities exceeding \t\u0013\n\u0003\u0003\u0007\n\u0003 Hence for\n\u0002 \r \u000f\n\u0016\r\u0017\u0018\u0013 in the noisy map we will observe a strange chaotic attractor\u0002 because\nmixing exists and an SNA cannot arise\u0003\nTo con\u0005rm these ideas\u0002 we have examined the evolution of an ensemble of tra\u0010\njectories and the behavior of the LLE in the presence of very weak noise\u0003 It can be\nseen \u0006Fig\u0003 \r\u0006a\u0007\u0007 that the LLE is una\u0004ected by whether there is weak noise in the\nmap or not\u0003 The maximum dispersion \u0006Fig\u0003 \r\u0006b\u0007\u0007 di\u0004ers from zero everywhere but\u0002\nfor \u0002 \r \u000f\n\u0016\r\u0017\u0018\u0013\u0002 it is comparable in size to the attractor\u0003 This suggests a sensitive\ndependence on initial conditions\u0002 i\u0003e\u0003 chaos\u0003 Note that\u0002 for the noise\u0010free map in\nthis range of \u0002\u0002 we observed \u0006see above\u0007 both an SNA and a chaotic attractor\u0003\nThus\u0002 weak noise does not in\u000euence the fractal structure \u0006strangeness\u0007 of an\nattractor\u0002 but it transforms an SNA of the quasiperiodic system into an attractor\ncharacterized by a sensitivity to initial conditions\u0002 i\u0003e\u0003 a strange chaotic attractor\u0002\nalbeit one that is characterized by a negative LLE\u0003 This implies that use of the LLE\nas an indicator of the velocity of perturbation growth gives misleading information\nabout the dynamical properties of attractors in the quasiperiodic system with noise\u0003\nWe have therefore calculated the complexitymeasureK\n\u0003\n\u0002 which was introduced \b\t\r\n\nfor the analysis of chaotic systems in the presence of \u000euctuations\u0003 It de\u0005nes the\nvelocity of divergence of nearby trajectories and is calculated for two trajectories\nwith di\u0004erent noisy realizations\u0003 For regular motion\u0002 K\n\u0003\n\u0011 \u0013\u0002 but K\n\u0003\ndi\u0004ers from\nzero in the chaotic regime\u0003 It can be seen \u0006Fig\u0003 \u0015\u0007\u0002 that the complexity di\u0004ers from\nzero in the regions where an SNA and chaos exist in the noise\u0010free system\u0002 and\nthat K\n\u0003\n\u0011 \u0013 in the region of the torus\u0003 This reinforces our conclusion that\u0002 for\n\u0002 \r \u000f\n\u0016\r\u0017\u0018\u0013 in the presence of noise\u0002 the motion is chaotic\u0003\nSo it would appear that\u0002 for the system considered\u0002 the presence of extremely\nweak noise means that chaos is necessarily associated with strangeness\u000b the SNA\nseen in the noise\u0010free system ceases to exist once noise is added\u0003 We have established\nsimilar results for the other systems \b\r\n where an SNA arises near the boundary of a\nFIGURE \u0006\u0002 Measure of the complexity K\n\u0002\nas a function of parameter \u0002\u0007\nchaotic regime\u0003 If\u0002 as appears to be the case\u0002 these results are generally applicable\u0002\nand since noise is invariably present in real macroscopic physical systems\u0002 we must\nconclude that in reality SNAs do not arise as the intermediate stage in the evolution\nfrom regular to chaotic behavior\u0003\nThe research was supported by INTAS \u0006grant N \u001b\u0018\u0010\u0013\u000f\u0013\u0016\u0007\u0002 and by the Royal\nSociety of London\u0003 N\u0003A\u0003Kh and I\u0003A\u0003Kh would like to acknowledge the hospitality\nof Lancaster University\u0003 I\u0003A\u0003Kh gratefully acknowledges support from Max\u0010Planck\u0010\nInstitute for Physics of Complex Systems in Dresden\u0003\nREFERENCES\n\u0000\u0002 Grebogi C\u0002\u0003 Ott E\u0002\u0003 Pelikan S\u0002\u0003 and Yorke J\u0002A\u0002\u0003 Physica \u0000\u0002D\u0003 \u0004\u0005\u0000 \u0006\u0000\u0007\b\t\n\u0002\n\u0004\u0002 Ding M\u0002\u0003 Grebogi C\u0002\u0003 and Ott E\u0002\u0003 Phys\u0002 Rev\u0002 A \u0003\u0003\u0003 \u0004\u000b\u0007\f \u0006\u0000\u0007\b\u0007\n\u0002\n\f\u0002 Matsumoto K\u0002\u0003 and Tsuda I\u0002\u0003 J\u0002 Stat\u0002 Phys\u0002 \u0002\u0000\u0003 \b\r \u0006\u0000\u0007\b\f\n\u000e Bulsara A\u0002R\u0002\u0003 Jacobs\nE\u0002W\u0002\u0003 and Schieve W\u0002C\u0002\u0003 Phys\u0002 Rev\u0002 A \u0004\u0005\u0003 \t\u0005\u0000\t \u0006\u0000\u0007\u0007\u000f\n\u000e Wiesenfeld K\u0002\u0003 Moss F\u0002\u0003\nNature \u0002\u0006\u0002\u0003 \f\f \u0006\u0000\u0007\u0007\u000b\n\u000e M\u0002Millonas\u0003 Fluctuations and Order\u0003 The New Synthesis\u0003\nINLS New York\u0010 Springer\u0003 \u0000\u0007\u0007\t\u0002\n\t\u0002 Heagy J\u0002F\u0002\u0003 and Hammel S\u0002M\u0002\u0003 Physica \u0006\u0007D\u0003 \u0000\t\u000f \u0006\u0000\u0007\u0007\t\n\u0002\n\u000b\u0002 Prasad A\u0002\u0003 Mehra V\u0002\u0003 and Ramaswamy R\u0002\u0003 Phys\u0002 Rev\u0002 E \u0003\u0006\u0003 \u0000\u000b\r\u0005 \u0006\u0000\u0007\u0007\b\n\u0002\n\u0005\u0002 Farmer J\u0002D\u0002\u0003 Ott E\u0002\u0003 Yorke J\u0002A\u0002\u0003 Physica \u0006D\u0003 \u0000\u000b\f \u0006\u0000\u0007\b\f\n\u000e Russel D\u0002A\u0002\u0003 Hanson J\u0002D\u0002\u0003\nOtt E\u0002\u0003 Phys\u0002 Rev\u0002 Lett\u0002 \u0004\u0003\u0003 \u0000\u0000\r\u000b \u0006\u0000\u0007\b\u000f\n\u0002\n\r\u0002 Pesin J\u0002B\u0002\u0003 Uspekhi Mat\u0002 Nauk \u0002\u0005\u0003 \u000b\u000b \u0006\u0000\u0007\r\r\n\u0002\n\b\u0002 Nicolis C\u0002\u0003 and Nicolis G\u0002\u0003 Phys\u0002 Rev\u0002 A \u0004\u0002\u0003 \u000b\r\u0004\u000f \u0006\u0000\u0007\u0007\u0000\n\u0002\n\u0007\u0002 Lai Y\u0002\u0011C\u0002\u0003 Feudel U\u0002\u0003 and Grebogi C\u0002\u0003 Phys\u0002 Rev\u0002 E \u0003\u0004\u0003 \u0005\u000f\r\u000f \u0006\u0000\u0007\u0007\u0005\n\u0002\n\u0000\u000f\u0002 Romeiras F\u0002J\u0002\u0003 Grebogi C\u0002\u0003 and Ott E\u0002\u0003 Phys\u0002 Rev\u0002 A \u0004\u0000\u0003 \r\b\t \u0006\u0000\u0007\u0007\u000f\n\u0002\n\u0000\u0000\u0002 Lichtenberg A\u0002L\u0002\u0003 Liberman M\u0002A\u0002\u0003 Regular and Stochastic Motion\u0003 New\u0011York\u0010\nSpringer\u0011Verlag\u0003 \u0000\u0007\b\f\u0002\n\u0000\u0004\u0002 Palladin G\u0002\u0003 Serva M\u0002\u0003 and Vulpiani A\u0002 Phys\u0002 Rev\u0002 Lett\u0002 \u0006\u0004\u0003 \u0005\u0005 \u0006\u0000\u0007\u0007\u000b\n\u0002\n"}