{"doi":"10.1016\/j.tecto.2010.02.007","coreId":"57729","oai":"oai:nora.nerc.ac.uk:9616","identifiers":["oai:nora.nerc.ac.uk:9616","10.1016\/j.tecto.2010.02.007"],"title":"Three-dimensional gravity and magnetic modelling of the Irish sector of the NE Atlantic margin","authors":["Kimbell, G.S.","Ritchie, J.D.","Henderson, A.F."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-04-29","abstract":"A new 3D lithospheric model has been constructed using high-resolution gravity data from the Irish National Seabed Survey. The sedimentary component of the model incorporated density variations due to laterally varying overcompaction associated with Cenozoic denudation. After optimisation based on gravity inversion, regional crustal thickness variations were defined which are in reasonable agreement with the results of wide-angle seismic experiments. High crustal extension factors (β>5) characterise the deeper parts of the Rockall and Porcupine basins and in places the model indicates extreme stretching (β>10) beneath these basins. This could be because of instability in the gravity inversion, although other recent investigations have independently suggested similarly high extension factors. In contrast, the Hatton Basin is characterised by an apparent extension factor of about 2. The modelling resolves a pattern of NE- to NNE-trending local Mesozoic basins on the margins of the Rockall Trough, helping to delineate structures that were previously only sparsely sampled by seismic surveys. It appears possible that rifts with similar trends underlie the volcanic rocks which obscure the deeper parts of the Hatton Basin. The linear trends of the basins to the south and east of Ireland are interpreted to have been inherited from a basement fabric that was initially established during the late Precambrian assembly of this basement and subsequently subjected to Caledonian and Variscan reactivation. Magnetic modelling indicates that the variations in the thickness of the crystalline crust predicted by the gravity models can explain the regional magnetic anomaly patterns over the Rockall and Porcupine basins, but that significant additional magnetic material (probably igneous rocks of both Palaeogene and Cretaceous ages) is required to explain the anomalies in the Hatton Basin region. The magnetic signature of the Rockall Basin is distinctly different to that over the basement (of similar apparent thickness) formed during mid Cretaceous (C34N) opening of the ocean basin to the south. This is an impediment to hypotheses that invoke mid Cretaceous sea-floor spreading rather than intracontinental rifting to explain the development of the basin. The exception is in the extreme south of the basin where the volcanism associated with the Barra Volcanic Ridges combined with indications of relatively strong lithosphere could be evidence of incipient ocean opening","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/57729.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/9616\/1\/kimbell_etal_2010_irish_margin_final.pdf","pdfHashValue":"0725ac0c5ef1a372106e015fc5f7e649a8708160","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:9616<\/identifier><datestamp>\n      2012-11-22T12:09:27Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9616\/<\/dc:relation><dc:title>\n        Three-dimensional gravity and magnetic modelling of the Irish sector of the NE Atlantic margin <\/dc:title><dc:creator>\n        Kimbell, G.S.<\/dc:creator><dc:creator>\n        Ritchie, J.D.<\/dc:creator><dc:creator>\n        Henderson, A.F.<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        A new 3D lithospheric model has been constructed using high-resolution gravity data from the Irish National Seabed Survey. The sedimentary component of the model incorporated density variations due to laterally varying overcompaction associated with Cenozoic denudation. After optimisation based on gravity inversion, regional crustal thickness variations were defined which are in reasonable agreement with the results of wide-angle seismic experiments. High crustal extension factors (β>5) characterise the deeper parts of the Rockall and Porcupine basins and in places the model indicates extreme stretching (β>10) beneath these basins. This could be because of instability in the gravity inversion, although other recent investigations have independently suggested similarly high extension factors. In contrast, the Hatton Basin is characterised by an apparent extension factor of about 2. The modelling resolves a pattern of NE- to NNE-trending local Mesozoic basins on the margins of the Rockall Trough, helping to delineate structures that were previously only sparsely sampled by seismic surveys. It appears possible that rifts with similar trends underlie the volcanic rocks which obscure the deeper parts of the Hatton Basin. The linear trends of the basins to the south and east of Ireland are interpreted to have been inherited from a basement fabric that was initially established during the late Precambrian assembly of this basement and subsequently subjected to Caledonian and Variscan reactivation. Magnetic modelling indicates that the variations in the thickness of the crystalline crust predicted by the gravity models can explain the regional magnetic anomaly patterns over the Rockall and Porcupine basins, but that significant additional magnetic material (probably igneous rocks of both Palaeogene and Cretaceous ages) is required to explain the anomalies in the Hatton Basin region. The magnetic signature of the Rockall Basin is distinctly different to that over the basement (of similar apparent thickness) formed during mid Cretaceous (C34N) opening of the ocean basin to the south. This is an impediment to hypotheses that invoke mid Cretaceous sea-floor spreading rather than intracontinental rifting to explain the development of the basin. The exception is in the extreme south of the basin where the volcanism associated with the Barra Volcanic Ridges combined with indications of relatively strong lithosphere could be evidence of incipient ocean opening.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2010-04-29<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9616\/1\/kimbell_etal_2010_irish_margin_final.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Kimbell, G.S.; Ritchie, J.D.; Henderson, A.F..  2010  Three-dimensional gravity and magnetic modelling of the Irish sector of the NE Atlantic margin.   Tectonophysics, 486 (1-4). 36-54.  https:\/\/doi.org\/10.1016\/j.tecto.2010.02.007 <https:\/\/doi.org\/10.1016\/j.tecto.2010.02.007>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/journal\/00401951<\/dc:relation><dc:relation>\n        10.1016\/j.tecto.2010.02.007<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/9616\/","http:\/\/www.sciencedirect.com\/science\/journal\/00401951","10.1016\/j.tecto.2010.02.007"],"year":2010,"topics":["Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Kimbell et al.  3D model of the Irish margin \n 1 \nThree-dimensional gravity and magnetic modelling of the Irish sector of the NE Atlantic \nmargin \n \nG.S. Kimbella*, J.D. Ritchieb and A.F. Hendersonb \n \na British Geological Survey, Keyworth, Nottingham, NG12 5GG, UK  \nb British Geological Survey, Murchison House, West Mains Road, Edinburgh, EH9 3LA, UK \n \nA new 3D lithospheric model has been constructed using high-resolution gravity data from \nthe Irish National Seabed Survey. The sedimentary component of the model incorporated \ndensity variations due to laterally varying overcompaction associated with Cenozoic \ndenudation. After optimisation based on gravity inversion, regional crustal thickness \nvariations were defined which are in reasonable agreement with the results of wide-angle \nseismic experiments. High crustal extension factors (β>5) characterise the deeper parts of the \nRockall and Porcupine basins and in places the model indicates extreme stretching (β>10) \nbeneath these basins. This could be because of instability in the gravity inversion, although \nother recent investigations have independently suggested similarly high extension factors. In \ncontrast, the Hatton Basin is characterised by an apparent extension factor of about 2. The \nmodelling resolves a pattern of NE- to NNE-trending local Mesozoic basins on the margins \nof the Rockall Trough, helping to delineate structures that were previously only sparsely \nsampled by seismic surveys. It appears possible that rifts with similar trends underlie the \nvolcanic rocks which obscure the deeper parts of the Hatton Basin. The linear trends of the \nbasins to the south and east of Ireland are interpreted to have been inherited from a basement \nfabric that was initially established during the late Precambrian assembly of this basement \nand subsequently subjected to Caledonian and Variscan reactivation. Magnetic modelling \nindicates that the variations in the thickness of the crystalline crust predicted by the gravity \nmodels can explain the regional magnetic anomaly patterns over the Rockall and Porcupine \nbasins, but that significant additional magnetic material (probably igneous rocks of both \nPalaeogene and Cretaceous ages) is required to explain the anomalies in the Hatton Basin \nregion. The magnetic signature of the Rockall Basin is distinctly different to that over the \nbasement (of similar apparent thickness) formed during mid Cretaceous (C34N) opening of \nthe ocean basin to the south. This is an impediment to hypotheses that invoke mid Cretaceous \nsea-floor spreading rather than intracontinental rifting to explain the development of the \nbasin. The exception is in the extreme south of the basin where the volcanism associated with \nthe Barra Volcanic Ridges combined with indications of relatively strong lithosphere could \nbe evidence of incipient ocean opening. \n \n* Corresponding author \nE-mail addresses: gsk@bgs.ac.uk (G.S. Kimbell), jdri@bgs.ac.uk (J.D. Ritchie), \nafhe@bgs.ac.uk (A.F. Henderson). \n \nKeywords: Ireland; north-east Atlantic; continental margin; gravity modelling; magnetic \nmodelling \nKimbell et al.  3D model of the Irish margin \n 2 \n1. Introduction \nThe Irish Designated Area extends for more than 1200 km, from the Irish Sea in the east to \nthe continental margin adjacent to the Edoras High in the west, and contains a large number \nof sedimentary basins (Fig.1). Shannon et al. (2001) categorized these basins into two groups: \ninboard basins with predominantly pre-Cenozoic sedimentary fill and little bathymetric \nexpression, and larger outboard basins with mainly Cenozoic and Cretaceous fill and a \ndistinct bathymetric expression. The latter group includes the Rockall, Hatton and Porcupine \nbasins.  \nThe region spans the transition between the magma-poor and magma-dominated parts of the \nNE Atlantic margin (Reston, 2009). Northward from the Edoras High this margin is \ncharacterised by volcanic sequences imaged as seaward-dipping reflectors (SDRs) and high-\nvelocity underplated or intruded lower crust, which have been linked to rifting under the \ninfluence of relatively high mantle temperatures associated with the Iceland Plume (White \nand McKenzie, 1989; Barton and White, 1997a, b). Palaeogene plateau basalts extend \nlandward from the margin across the Hatton Basin and Rockall High. In the south (e.g. on the \nGoban Spur margin) seaward-dipping reflectors and underplating appear to be absent, \nalthough basaltic lava flows have been proven at DSDP Site 551 (de Graciansky et al., 1985) \nand are responsible for a local magnetic anomaly (Scrutton, 1985; Louvel et al., 1997). \nKimbell et al. (2004, 2005) presented results of regional 3D gravity modelling of the \nlithospheric structure of the NE Atlantic margin, which included the Irish sector. The models \nwere constrained using isostatic and flexural principles and optimised by inversion of gravity \nanomalies. They define the regional pattern of crustal thickness variation along the margin \nand the geometries of the main sedimentary basins. The resolution was limited by a number \nof factors, including shortcomings in the initial model for the cover sequence and restrictions \nin resolution associated with the use of satellite-derived gravity data (Kimbell et al., 2004). \nThe present paper will describe application of similar 3D modelling methods to the Irish \nmargin, in which the resolution has been improved by adopting a more sophisticated cover \nsequence model and employing a gravity dataset which includes modern, high-resolution \nmarine data collected during the Irish National Seabed Survey. \nKimbell et al.  3D model of the Irish margin \n 3 \n2. Form and evolution of the main basins on the Irish margin \n2.1 Rockall Basin and associated marginal basins \nThe Rockall Basin is the dominant structural feature within the study area and extends to the \nNE into UK waters (Fig. 1) (see Naylor et al., 1999). It is a NE- to NNE-trending, 1100 km \nlong, mainly Mesozoic and younger, sediment-starved, deepwater rift basin which narrows \nfrom approximately 350 km in the south to less than 200 km in the north. \nWithin the study area, only exploration wells 5\/22-1 and 12\/2-1A have been drilled on the \neastern flank of the basin (Fig. 1). In the latter well, gas condensate was recovered from \nPermian strata within a tilted fault block (P. Croker, oral communication, 6th Petroleum \nGeology Conference, London, 2003). The age, distribution and thickness of the pre-\nPalaeogene stratigraphic intervals are mainly inferred from velocity data derived from the \nresults of wide-angle seismic experiments (e.g. Keser Neish, 1993; Shannon et al., 1994; \nO’Reilly et al., 1995; Shannon et al., 1999; Mackenzie et al., 2002; Morewood et al., 2005). \nEstimates of gross stratigraphic thicknesses vary between 4.5 and 7.0 km, with the thickest \nsections occurring towards the margins of the basins where inferred early Mesozoic basins \nare better developed (e.g. Naylor and Shannon, 2005; Mackenzie et al., 2002). There are also \na number of narrow, NNE- to NE-trending, mainly Mesozoic to Late Palaeozoic remnant \nhalf-grabens developed on both flanks of the Rockall Basin (see Naylor et al., 1999), the most \nimportant of which are the contiguous NNE-trending Slyne and NE-trending Erris basins on \nthe eastern margin of the basin. The Slyne Basin has been drilled by a number of wells \nincluding 27\/5-1 and 13-1 in the south and 18\/20-1, 2, 3 and 4 associated with the Corrib \nField in the north (Fig. 1). The basin is considered to be a mainly Triassic-Jurassic half-\ngraben, with the most significant phase of rifting occurring during mid Jurassic times (Dancer \net al., 2005).  It is interpreted to contain a thin Cenozoic-Cretaceous succession overlying 2.5 \nkm of Middle Jurassic and also Permo-Triassic and Carboniferous (Westphalian) strata \n(Dancer et al., 1999). The Slyne Basin is separated from the Erris Basin to the north by a \nNW-trending transfer zone (Dancer et al., 1999). The Erris Basin has been drilled by wells \n19\/5-1 and 12\/13-1A (Fig. 1) and is considered to comprise a series of sub-basins that were \nformed during phases of Permo-Triassic and late Middle to Upper Jurassic rifting (Chapman \net al., 1999).  According to Chapman et al. (1999), the basin contains Cenozoic, Jurassic and \nPermo-Triassic successions with a maximum stratigraphic thickness of approximately 6 km.  \nKimbell et al.  3D model of the Irish margin \n 4 \nIn the Irish sector of the Rockall Basin, extension factors of β = 4 to 6 have been reported by \nShannon et al. (1999) from the RAPIDS seismic experiment, though they prefer a depth-\ndependent stretching model with values varying between β = 9 in the upper\/middle crust and \nβ = 4 in the lower crust (see also Morewood et al., 2005). The crystalline crust is \napproximately 6 km thick, with the Moho interpreted to lie at a depth of 14 km and the \nthinnest crust occurring towards the margins of the basin (Keser Neish, 1993; Hauser et al., \n1995; O’Reilly et al., 1995; Mackenzie et al., 2002, Morewood et al., 2005).  \nThere is still great uncertainty regarding the timing and number of phases of rifting associated \nwith the formation of the Rockall Basin, partly due to a lack of wells to calibrate its infill. \nThe suggestions include: Early Cretaceous (e.g. Musgrove and Mitchener, 1996); Late \nCretaceous (Hanisch, 1984); Permo-Triassic, Jurassic and Early Cretaceous  (Knott et al., \n1993); Cretaceous to Cenozoic but with older pre-Cretaceous phases (e.g. Nadin et al., 1999); \nNeocomian  (Scrutton and Bentley, 1988); Jurassic-Early Cretaceous (Corfield et al., 1999); \nJurassic-Cretaceous (Mackenzie et al., 2002); Triassic to Late Jurassic-Cretaceous (Shannon \net al., 1999); Latest Triassic-Cretaceous (Roberts et al., 1999); Permo-Triassic to Jurassic \n(Shannon et al., 1994); Permo-Triassic, Late Jurassic and localised Early Cretaceous (Naylor \nand Shannon, 2005); Permo-Triassic (Bott and Watts, 1971); and Carboniferous (e.g. \nHaszeldine and Russell, 1987).  \nThere has also been much debate regarding the nature of the basement that floors the Rockall \nBasin with suggestions including: oceanic crust, formed during Jurassic-Lower Cretaceous \n(e.g. Roberts, 1975), Mid-Late Cretaceous (Kristofferson, 1978; Chappell and Kusznir, \n2005), Early Permian (Russell and Smythe, 1978) or Late Carboniferous (Haszeldine and \nRussell, 1987) times; quasi-oceanic crust formed during Late Carboniferous-Early Permian \n(Smythe, 1989) times; stretched continental crust with zones of oceanic crust (e.g. Megson, \n1987); highly stretched continental crust (Shannon et al., 1994, 1999; Hauser et al., 1995; \nO’Reilly et al., 1996; Morewood et al., 2005); highly stretched continental crust with \nconcomitant igneous intrusion (Joppen and White, 1990); and crustal blocks interspersed with \nserpentinised mantle (Pérez-Gussinyé et al., 2001). \n2.2 Porcupine Basin \nThe Porcupine Basin (including the North Porcupine and Seabight basins) forms a N-trending \nrift graben approximately 400 km in length, and tapering from 150 km width in the south to \n50 km in the north (Fig. 1; Naylor et al., 2002, enclosure 1). The results of wide-angle \nKimbell et al.  3D model of the Irish margin \n 5 \nseismic and potential field modelling indicate that its sedimentary infill is underlain by either \nvery thin continental crust (e.g. Conroy and Brock, 1989; Johnson et al., 2001) or partially \nserpentinised upper mantle (Reston et al., 2004; O’Reilly et al., 2006). The basin has been \ndrilled by approximately 30 exploration wells (see Croker and Shannon, 1987), mainly along \nits northern flanks and is considered to contain in excess of 8 km of Permo-Triassic to Recent \nstrata, overlying a Carboniferous and Devonian succession of uncertain distribution and \nthickness (Naylor et al., 2002; Readman et al., 2005). The main phases of rifting are \ninterpreted to have occurred during Permo-Triassic, Jurassic and earliest Cretaceous times \n(e.g. Naylor et al., 2002; Naylor and Shannon, 2005). The axial region of the central and \nnorthern parts of the Porcupine Basin is transected by a combination of the arcuate, deeply \nburied Porcupine Volcanic Ridge System and the N-trending Porcupine Arch (Naylor et al., \n2002, enclosure 1). The ridge system is considered by Tate and Dobson (1988) to represent \nan igneous complex of mainly Cretaceous age, although Reston et al. (2001) prefer a \nserpentinite diapiric origin. The Porcupine Arch is a high-amplitude reflector which may \nmark the top of the crystalline basement (Johnson et al., 2001) or partially serpentinized \nmantle (Reston et al., 2004).  \n2.3 Hatton Basin  \nThe Hatton Basin is approximately 500 km long and 200 km wide and extends north-\neastwards from the western part of the study area into UK waters (Fig. 1). It has informally \nbeen divided into northern and southern parts, separated by the WNW-trending South Hatton \nLineament of Kimbell et al., 2005 (Fig. 4)  The basin is one of the most poorly understood of \nthe major basins in the NE Atlantic region, due to the masking effects of thick Paleocene-\nEocene volcanic and intrusive rocks (e.g. Hitchen, 2004). \nThe eastern margin of the Hatton Basin has been drilled by DSDP wells 116 and 117 (Fig. 1), \nproving approximately 850 m of sediments ranging from Upper Paleocene to Recent. Results \nfrom the RAPIDS wide-angle seismic experiment indicated that the Hatton Basin contains 1-\n2.5 km of Cenozoic sediments overlying up to 3.5 km of older high-velocity syn-rift \nsediments (Vogt et al., 1998). Shannon et al. (1999, their fig. 2) modified this interpretation, \nsuggesting that approximately 1 km of Cenozoic sediments rest on 3 km of Upper \nCarboniferous, Permo-Triassic to Jurassic strata. On the UK Hatton margin, mid-Cretaceous \nsediments have been proven in shallow boreholes (Hitchen, 2004). Results from wide-angle \nand normal incidence profiles acquired by the iSIMM project have been interpreted to show \nthat the basin contains approximately 2 km of Cenozoic post-rift sediments resting on a 2 - 4 \nKimbell et al.  3D model of the Irish margin \n 6 \nkm thick, higher velocity (4.3 – 6.1 km\/s) layer (Smith et al., 2005; Smith, 2006).  The \n‘hummocky’ nature of the upper surface of the lower layer (e.g. Smith et al., 2005, their fig. \n5) suggests that it is capped by Palaeogene volcanic rocks extruded in a submarine \nenvironment, contrasting with the parallel-bedded seismic facies of the subaerial lavas on the \nsurrounding highs (Boldreel and Andersen, 1994). Results from the RAPIDS, iSIMM and \npotential field modelling studies have suggested thicknesses for the crystalline crust beneath \nthe Hatton Basin of between 10 and 20 km (Shannon et al., 1999; Kimbell et al., 2005; Smith \net al., 2005; Smith, 2006). \n3. Construction of a cover sequence model \n3.1. Rock physical properties \nDensity and sonic velocity variations within the cover sequence were investigated using \ngeophysical logs from 28 released wells on the Irish Continental Shelf, together with log and \nsample measurements from Deep Sea Drilling Programme (DSDP) and Ocean Drilling \nProgramme (ODP) sites in the region. The primary aim was to establish densities for gravity \nmodelling, but rock sonic velocities were also analysed, both for comparison with the trends \nobserved in the density data and to assist with the time-to-depth conversion of seismic \ninterpretations. The densities and velocities of sedimentary rocks are influenced by both \nlithology and compaction. If part of a sedimentary sequence has been removed, for example \nby uplift and erosion, the remaining rocks will not lie at their maximum burial depth and will \nhave higher densities and velocities than similar, but normally compacted, lithologies at the \nsame depths. This is an important consideration on the NE Atlantic margin where there is \nabundant evidence of Cenozoic uplift and denudation (Doré et al., 2002a and references \ntherein). Denudation appears to have occurred across much of the Irish continental shelf, \nexcept in the central parts of the Rockall and Porcupine basins (Allen et al., 2002; Doré et al., \n2002b).  \nLog sections were identified that were assumed to be normally compacted on the basis of \nprevious studies of their thermal history and the absence of unconformities. Density logs \nfrom these suggested that the shale compaction curve of Sclater and Christie (1980) would \nprovide an appropriate ‘normally compacted’ reference against which to compare the other \ndensity logs. In a similar fashion, an empirical normally compacted velocity-depth \nrelationship was established from analysis of the borehole sonic data. The geophysical well \nlogs were then separated into Cenozoic and pre-Cenozoic components and the depth shift \nKimbell et al.  3D model of the Irish margin \n 7 \nrequired to provide the best fit between the log data and the normal compaction trend was \ncalculated. The velocity and density data from the pre-Cenozoic sedimentary rocks indicate \ndenudation values that are broadly comparable with each other and with published data \nincluding other velocity analyses and appatite fission track and vitrinite reflectance data (e.g. \nHillis, 1995; Murdoch et al., 1995). The denudation estimates for the Cenozoic rocks were \nconsistently much lower than those for the pre-Cenozoic section, as expected from the uplift \nhistory of this margin.  \nFrom this evidence, a density model for the sedimentary part of the cover sequence was \ndeveloped which was based on the shale compaction curve of Sclater and Christie (1980) and \nassumed normal compaction for the Cenozoic sedimentary strata and a varying degree of \novercompaction for the pre-Cenozoic strata. There were insufficient data to map local \novercompaction variations (e.g. due to inversion of individual structures), so a highly \nsimplified denudation map was constructed (Fig. 2d) in which the shelf areas around Ireland \nwere assigned values of 1 – 1.2 km and the sequences in the deep water basins were assumed \nto be normally compacted. The density of the sub-lava sedimentary rocks in the Hatton-\nRockall area is difficult to quantify, but limited apatite fission track (Hitchen, 2004) and \nseismic velocity (Vogt et al., 1998) data suggest that this part of the cover sequence is \novercompacted. An average denudation similar to that in the shelf areas around Ireland has \ntherefore been assumed, although it is recognised that this is poorly constrained. \nThe density of the basaltic lavas present in the NW of the study area was estimated using a \nnominal trend constructed by interpolating between the averaged values identified from \ndensity logs through thick volcanic sections on the Vøring (DSDP Site 642) and East \nGreenland (ODP Site 917) margins and the deeper density data available from the Lopra \nborehole on the Faroe Islands (Ellis et al., 2002). \n3.2. Cover sequence thickness \nAn initial structural model for the cover sequence was required in order to guide the way in \nwhich the crustal contribution to observed gravity anomalies was partitioned between \nsedimentary and crystalline components. It is not feasible to attempt such a partition solely on \nthe basis of gravity anomalies as it is not possible to separate the effects of long wavelength \nvariations in sediment thickness from those due to changes in Moho depth. The structural \nmodel was constructed from a range of sources, including: \n1. Composite logs from released wells.  \nKimbell et al.  3D model of the Irish margin \n 8 \n2. Thicknesses in two-way travel time (twtt) derived from geological cross-sections in \nenclosures within the structural nomenclature reports for the Irish Rockall Basin region \n(Naylor et al., 1999) and Porcupine-Goban region (Naylor et al., 2002). \n3. Contours (in depth and twtt) from the Rockall and Porcupine basins based on \nunpublished maps supplied by the Irish Petroleum Affairs Division. \n4. Models for the structure of the cover sequence beneath the Rockall Basin derived from \nwide-angle data (Joppen and White, 1990; Hauser et al., 1995; Shannon et al., 1999; \nMackenzie et al., 2002; Morewood et al., 2005). \n5. Contours of total sediment thickness from the North Atlantic geophysical atlas of \nSrivastava et al. (1988). \n6. Contours of depth to acoustic basement in the Hatton-Rockall area from Roberts et al. \n(1979; their fig. 8). \n7. Contours of total sediment thickness within the Goban Spur area (Masson et al., 1985).  \n8. Contours of total sediment thickness within the Celtic Sea basins area (Tucker and Arter, \n1987). \n9. Grids of total sediment thickness over the North Atlantic region generated by Louden et \nal. (2004). \n10. Published seismic cross-sections (in twtt) and other data from the Peel, Kish Bank, \nCentral Irish Sea, St Georges Channel, North Celtic Sea, Rockall, Slyne and Erris basins \n(e.g. Croker, 1995; Dancer et al., 1999; Dunford et al., 2001; Chapman et al., 1999; \nFloodpage et al., 2001; Izatt et al., 2001; Murdoch et al., 1995; Mackenzie et al., 2002) \n11. Seismic interpretation from the western approaches to the English Channel from Evans et \nal. (1990). \n12. Seismic interpretation from the Malin-Hebrides Sea area from Fyfe et al. (1993). \n13. Seismic interpretation from the Isle of Man area from Chadwick et al. (2001). \nThe sedimentary part of the cover sequence model was divided into Cenozoic and pre-\nCenozoic components (Figs. 2b and 3a). Data that were only available in two-way travel time \nwere converted to thickness using an algorithm derived from the empirical velocity-depth \nrelationship for normally compacted sediments described in the preceding section. An \novercompaction correction based on Fig. 2d was applied in the depth coversion of the pre-\nCenozoic component. \nIn the NW part of the study area the seismic expression of underlying sedimentary rocks is \nlargely masked by the extensive Palaeogene lavas, such that the acoustic basement used in \nKimbell et al.  3D model of the Irish margin \n 9 \nthe construction of published sediment thickness maps for this area (e.g. Roberts et al., 1979; \nSrivastava et al., 1988) will typically lie at the top of the lavas. The initial ‘Cenozoic’ \nsedimentary model therefore nominally represents post-lava sediments in this area and the \nfull Cenozoic sequence elsewhere. \nLittle information was available on the thickness of the Palaeogene lavas in the Hatton \nRockall area, apart from some speculative base lava picks on seismic sections (e.g. Boldreel \nand Andersen, 1994), evidence for ‘windows’ where they are highly thinned or absent \n(Hitchen, 2004) and imaging of the seaward-dipping reflector sequence adjacent to the \ncontinental margin (Barton and White, 1997a, b). Only a highly simplified representation of \nthis unit was therefore possible (Fig. 2c). This included a thickened sequence where seaward-\ndipping reflectors were assumed to lie on continental crust (the inner reflector package of \nBarton and White, 1997a, b), feather-edges at the assumed limit of the lavas and where \nwindows have been identified, and approximately 1 km of lavas elsewhere.  \nA nominal sub-lava sedimentary thickness of up to about 2 km was included in the Hatton \nBasin on the basis of the limited information available from wide-angle seismic experiments \n(e.g. Vogt et al., 1998). Such experiments suggest that rapid thickness variations may occur \nwithin this layer but these could not be defined a priori so a smoothly varying initial \nthickness was adopted with the aim of using the gravity data to resolve shorter wavelength \nvariation. \nThe initial model of the base of the cover sequence does not coincide with a particular \nstratigraphic level, and this is even more the case after the surface has been optimised using \ngravity anomalies (see below).  The density contrast associated with this surface is primarily \nthat between the Mesozoic sequence and the Lower Palaeozoic and older basement. The \nCarboniferous strata are not easy to incorporate as their structure is poorly defined, and thus \ncannot generally be included in the starting model, and their properties span from those of the \ncover (in low density Upper Carboniferous units) to those of the basement. The optimised \nmodel may thus contain features relating to variations in the thickness of the Carboniferous \nsequence but these are unlikely to be simulated accurately. \n4. Geophysical modelling \nThe lithospheric models comprised a series of regular grids with a 2 km node separation \nrepresenting the depths to a set of interfaces and the lateral variations in rock densities \nbetween these interfaces. The density of the cover sequence was guided by the compaction  \nKimbell et al.  3D model of the Irish margin \n 10 \nand denudation trends discussed above and that of the crystalline crust was assigned \nrepresentative values of 2.75 Mg\/m3 in the upper crust and 2.95 Mg\/m3 in the lower crust. \nUpper mantle densities were simulated in a way which accounted for thermal influences, as \ndescribed below. \n4.1. Thermal modelling \nO’Reilly et al. (1998), Breivik et al (1999) and Kimbell et al. (2004) have demonstrated the \nneed for incorporating thermal effects when modelling gravity anomalies in the vicinity of \ncontinental margins. In the present model, a temperature profile was calculated at each \noceanic node using a 1D plate cooling model together with the estimated age of the ocean \ncrust (Fig. 1) and the present-day bathymetry (Fig 2a). For the continental upper mantle, the \ntemperature profile was based on a nominal geotherm calculated on the basis of a surface \nheat flow of 55 mW\/m2. Two-dimensional finite-element modelling was conducted using the \nTHERMIC program (Bonneville & Capolsini, 1999) and a procedure similar to that of \nBreivik et al. (1999) to simulate temperature variations across a continent ocean boundary \nformed at ages ranging from 55 Ma to 105 Ma. The models indicated that there is a relatively \npronounced thermal contrast where ocean opening has occurred most recently, but that this \nhas largely decayed beneath the older margin. Sections taken through the thermal models \nindicated that the lateral temperature variations across the margin could be simulated in the \n3D model with sufficient accuracy by a 170 km wide linear ramp centred at the continent-\nocean boundary. The position of this boundary was derived using the methods described by \nKimbell et al. (2005). The resulting upper mantle temperature model was translated into \ndensities within a series of arbitrary ‘layers’ by applying corrections for thermal expansion \nand overburden stress, as described by Kimbell et al. (2004). It was assumed that conductive \ncooling extends down to the 1100ºC isotherm and that more efficient convective heat transfer \nbelow this isotherm substantially reduces thermal gradients (see discussion in Kimbell et al., \n2004). \nIt is recognised that the region will contain some thermal perturbations that are not simulated \nin the initial model. The thermal impact of Late Jurassic – Early Cretaceous continental \nextension should have decayed by now but any more recent extensional episodes, for \nexample affecting the Hatton Basin, may still have a thermal imprint. The conditions that \ngave rise to widespread Palaeogene igneous activity on the Atlantic margin may have left a \nmore extensive thermal effect than the ‘standard’ passive margin model that has been \nKimbell et al.  3D model of the Irish margin \n 11 \nassumed, although 2D modelling indicates that the heat stored in the lavas and underplating \nwill have largely dissipated by now. The uniform continental geotherm model does not allow \nfor local perturbations in upper mantle temperatures due to variations in the thickness and \nthermal properties of the overlying crust. \n4.2. Construction of an optimised 3D model \nThe 3D lithospheric model was constructed and optimised using the procedure described \nbelow. Potential field computations and inversions were undertaken using the BGS Gmod \nand Bmod programs (Dabek and Williamson, 1999) which employ wavenumber domain \nroutines developed by Parker (1972) and Oldenburg (1974). \n1.  An isostatic model was constructed using topographic data and the models for mantle \ndensity variations and cover sequence structure and density described above. The post-lava \nsediments were represented by a series of seabed-parallel layers in order to simulate \ncompaction effects. At this stage the pre-lava sedimentary layer was represented by a single \nlayer with an averaged density at each node. An average density for the crystalline crust of \n2.85 Mg\/m3 was assumed, together with a reference Moho depth of 30 km (i.e. its nominal \ndepth when the topographic surface lies at datum and no cover sequence is present). The \nMoho depth was adjusted to equalise the load at a compensation depth of 125 km. \n2.  The gravity field over the entire model (down to 125 km) was computed. Following \nKimbell et al. (2004), the average offset between the computed field over this isostatic model \nand the observed field was used to define a ‘background’ value which was subtracted from \nobserved gravity anomalies prior to model optimisation. In this case a shift of -15 mGal was \napplied to the observed anomalies. The ‘indirect effect’ (Chapman and Bodine, 1979), which \nis the gravity correction due to the difference in elevation between the geoid (the datum to \nwhich the gravity measurements are referred) and the spheroid (the datum to which the \ngravity reference field is referred) was effectively incorporated in this correction rather than \nbeing defined explicitly. Relative gravity variations due to the indirect effect are less than \nabout 4 mGal over the entire study area and less than 2.5 mGal over the Irish Designated \nArea. \n3.  The geometry of the Moho interface was optimised by gravity inversion to improve the fit \nwith observed longer wavelength gravity anomalies (employing a low-pass filter with a ramp \nbetween wavelengths of 67 km and 100 km). Prior to this it was smoothed to suppress shorter \nKimbell et al.  3D model of the Irish margin \n 12 \nwavelength variations resulting from its derivation on the basis of local isostasy but not \ndetectable at Moho depths using gravity data. \n4.  The base sediment interface was optimised to accommodate shorter wavelength gravity \nvariations, although it was still necessary to apply a low-pass filter (ramp between 10 km and \n20 km) to avoid instability and suppress features that might be associated with noise in the \nobserved data. \n5.  The density structure of the sedimentary components and the upper mantle was re-\ncomputed using these modified interfaces. At this stage the pre-Cenozoic sedimentary unit \nwas subdivided (in a similar fashion to the Cenozoic sediments) to provide a better \nrepresentation of compaction effects. A mid-crustal interface was introduced which equally \ndivided the crystalline crust into upper (2.75 Mg\/m3) and lower (2.95 Mg\/m3) components.  \n6.  A further optimisation of the Moho interface was undertaken, using the same filter settings \nas in step 3. The change in Moho depth was re-scaled to reflect the movement in the mid-\ncrustal interface which was applied subsequently. \n7.  A further optimisation of the base sediment interface was undertaken, and the depth \nchanges scaled at each grid node by a factor reflecting the ratio between the local contrast at \nthis boundary and the average contrast between the pre-Cenozoic sedimentary unit and the \ncrystalline crust. \n8.  The sedimentary and upper mantle densities were recomputed and a final forward gravity \ncalculation was made using the complete model. \nFigure 3 shows the thickness variations in the pre-Cenozoic sedimentary rocks before and \nafter the optimisation process. Fig. 4 shows the total cover sequence thickness (with \nannotations) and Fig. 5 shows the thickness of crystalline crust and depth to Moho in the final \nmodel. The modelled gravity field matches the main features of the observed field well (Fig. \n6), with the largest amplitude discrepancies occurring over igneous centres (which were not \nexplicitly modelled). The root mean square residual gravity anomaly over the final model is \n1.92 mGal. \n5. Results \n5.1. Overview of gravity modelling results \nKimbell et al.  3D model of the Irish margin \n 13 \nOn a broad scale, the optimised model confirms the well-known structural configuration of  \nthe continental part of the region, with highly stretched crystalline crust and shallow Moho \nbeneath the Rockall and Porcupine basins and more normal crustal thickness elsewhere (Fig. \n5). At least some of the areas of extreme crustal thinning indicated by the model (Fig. 5a) \nmay be artefacts due to instability in the inversion and limitations of the modelling \nassumptions, but the potential for continental crust to have been stretched ‘to the limit’ \ncannot be dismissed. Some recent models invoke unroofing of the mantle lithosphere beneath \nthe Porcupine Basin (Reston et al., 2004; Readman et al., 2005) and possibly also the Rockall \nBasin (Pérez-Gussinyé et al., 2001). The crust beneath the deeper parts of the Hatton Basin is \ntypically 13-16 km thick (Fig. 5a), suggesting an extension factor of around 2, significantly \nless than the Rockall and Porcupine basins. \nThe optimised model provides a more detailed picture of the structure of the cover sequence \n(Figs. 3 and 4) than previous regional 3D modelling (Kimbell et al., 2004, 2005). This is \nmainly because of a more detailed approach to the structure and properties of the initial cover \nsequence model and the higher resolution of the gravity field available for this study, as a \nresult of incorporation of marine data from the Irish National Seabed Survey. The details of \nthe small basins on the flanks of the Rockall Basin are better resolved than previously and a \nsignificantly more complex model for the structure of the Hatton Basin has been produced. \nThe inferred structure for the pre-Cenozoic sedimentary rocks includes linear zones where \nthere are sharp thickness changes implying fault control. Compare, for example, the initial \nand optimised geometries for the Slyne and Erris basins and eastern margin of the Porcupine \nBasin (Fig. 3a, b).  \nThe oceanic crust is thicker in the NW corner of the study area than beneath the Porcupine \nAbyssal Plain in the south (Fig. 5a). This reflects the volcanic nature of the Hatton margin, \nwhere generation of thicker than normal oceanic crust has been ascribed to the influence of \nthe Iceland Plume (White and McKenzie, 1989). The East Thulean Rise (ETR in Fig. 5) \nappears as a zone of thickened oceanic crust to the south of the Charlie Gibbs fracture zone, \ncentred at about 21ºW 51ºN. This feature (and the conjugate West Thulean Rise in the NW \nAtlantic) developed at c. 55 Ma (magnetic chron C24R), strongly suggesting an association \nwith a southward extension of the thermal anomaly at the time the northern Atlantic started \nopening between NW Europe and Greenland. It is possible to calibrate the development and \ndecay of the thermal anomaly across the East Thulean Rise because oceanic crust lies on both \nsides of the feature. On the basis of the modelled crustal thickness variations, the anomaly \nKimbell et al.  3D model of the Irish margin \n 14 \nappears to have developed rapidly (over a period of c. 2 Ma) but decayed over a longer time-\nscale. \n5.2. Comparison with deep seismic experiments \nAn obvious difference between the 3D gravity model and seismic models is that the \ncrystalline crust in the former is arbitrarily divided into two layers of equal thickness whereas \nthe latter are able to resolve the velocity discontinuities and often indicate a three-layer crust \n(e.g. Shannon et al., 1999; Mackenzie et al., 2002). Such layering cannot be resolved from \ngravity data and the mid-crustal interface is used as a mechanism for handling the transition \nfrom the density contrast at the base of the cover to that at the Moho, without introducing \nundue complexity into the models. The results should still be comparable, in terms of crustal \nthickness and depth to Moho, provided the average density assumed for the crystalline crust \nremains valid.  \nThe Moho was modelled relative to an empirically-defined reference value of 30 km. This \nprovides reasonable agreement with the results of deep seismic experiments in the region, \nwith model and seismic Mohos typically lying within about 2 km of each other. The shapes \nof Moho features are also generally well reproduced, for example along the RAPIDS 33 \nprofile where there is asymmetrical crustal thinning across the Rockall Basin, with a steeper \nflank to the SE than to the NW (Fig. 7). The agreement in Moho depth beneath the Rockall \nBasin is perhaps surprising, given the evidence for a relatively low seismic velocity in the \nupper mantle beneath the basin, which has been interpreted as the result of serpentinisation \n(O’Reilly et al., 1996; Morewood et al., 2005). This potential low density zone is not \nincorporated in the model and thus might be expected to result in the model Moho lying at \ngreater depth than the seismic Moho (Kimbell et al., 2004).  It may be that the density effect \nof serpentinisation is offset by a thermal effect (relatively cold upper mantle because of \nthinning and reduced heat production in the overlying crust). \nThe model appears to underestimate the thickness of oceanic crust beneath the Porcupine \nAbyssal Plain in the SW. White (1992) tabulates results from 7 seismic soundings around the \nGoban-Western Approaches margin that indicate an average seismic thickness for the \ncrystalline crust of 6.37 km while the average modelled crustal thickness at the same sites is \n5.23 km. There is little seismic evidence for the thickness of the oceanic crust further to the \nwest, away from the continental margin, but the comparisons described above suggest that \nthe typical modelled thickness of 3-4 km in this area (Figure 5a) is an underestimate. This \nKimbell et al.  3D model of the Irish margin \n 15 \ncould arise in part because the density of the oceanic crust is underestimated, but inaccuracies \nin other modelling assumptions (reference model and background field) may also be \ninvolved. There may be lateral changes in mantle density due to varying degrees of mantle \ndepletion which are not allowed for in the modelling. The oceanic crust in this region \nnonetheless still appears to be thinner than the global average of about 7 km, as Thinon et al. \n(2003) cite values of 3-5 km for the oceanic crust off the North Armorican margin to the \nsouth. Bullock and Minshull (2005) suggest that exhumed mantle may be present in a c. 70 \nkm wide zone adjacent to the continent-ocean boundary at the Goban Spur margin (see \nfurther discussion in Section 6). \n5.3. Discussion of selected features \nSelected features of the cover sequence model are annotated in Fig. 4 and discussed below \nusing the same abbreviations. \n5.3.1. Hatton Ridge basins \nInboard of the seaward-dipping reflectors on the Hatton Margin (SDR in Fig. 4) are the \nHatton Ridge basins (HRB), which have northern and southern parts separated by a possible \ntransfer structure termed the South Hatton Lineament (SHL) by Kimbell et al. (2005). \nSeismic evidence for an offset in the post-lava components of these basins is provided by \nRoberts et al. (1979). The southern basin has been drilled at DSDP Site 555, which \ndemonstrates the post-lava sedimentary thickening, and the gravity modelling suggests that a \npre-lava component is also required. Seismic evidence for pre-lava structure is very limited, \nbut there is a weak indication of dipping reflections from a sub-lava sequence in the northern \nbasin on line CDP87-3 of Keser Neish (1993, her fig. 9, ~SP45300). \n5.3.2. Hatton Basin \nThe model for the deep structure of the Hatton Basin is speculative, because of very limited \ncontrol. The post-lava sedimentary model is based on only limited data and there is little \ncontrol over the thickness of the lavas and pre-lava sediments. Errors in the initial top lava \nsurface will have been absorbed (and amplified) by artefacts in the modelled base of the \ncover sequence. The model nonetheless is interpreted to provide at least some qualitative \ninsight into the structural fabric of the basin.  \nThe cover sequence has a modelled thickness of up to about 6 km in the northern part of the \nHatton Basin (NHB), with the thickest deposits lying along an ENE-trending axis. Smith et \nKimbell et al.  3D model of the Irish margin \n 16 \nal. (2005) estimated a total cover sequence thickness within the basin of about 4 km beneath \nthe iSIMM seismic profile, which lies just to the north of the present study area and this is \ncompatible with the adjacent parts of our model. Smith (2006) revised this interpretation to \ninclude up to about 7 km of cover, but with relatively high (> 5 km\/s) velocities in its lower \npart. It is likely that the basin contains pre-Cenozoic sedimentary rocks at depth. These have \nnot yet been clearly imaged by seismic reflection surveys but there is evidence of deformed \nstrata beneath the lavas on the Hatton High (Keser Neish, 1993; Hitchen, 2004) and boreholes \nproving mid-Cretaceous sedimentary rocks in this area (Hitchen, 2004).  \nThere is a change in the modelled structural fabric of the Hatton Basin across the South \nHatton Lineament, with the southern part of basin (SHB) characterised by a series of highs \nand lows with a NNE trend (Fig. 4). Although some of the modelled structure at the base of \nthe cover sequence may be an artefact due to shortcomings in the resolution of interfaces at \nshallower levels (e.g. top lava), there is seismic evidence from RAPIDS (Vogt et al., 1998) \nand GEUS (Boldreel and Andersen, 1994; Edwards, 2002) profiles for rapid variations in the \nthickness of a lower sedimentary layer, compatible with the configuration of the 3D model. \nThe trend of the structures inferred from the gravity model matches that of Mesozoic \nstructures elsewhere in the study area. \n5.3.3. Basins on the Rockall High \nNaylor et al. (1999) identified the Colmán (COLB) and Ciarán (CIAB) basins at the southern \nend of the Rockall High from their expressions on a single seismic line, but were not able to \ndefine their lateral extent because of lack of data. They considered it likely that both were \nMesozoic basins. The 3D model suggests that the Colmán Basin is a linear feature about 90 \nkm long (Fig.4). The modelled northern margin of the Ciarán Basin has an E-W orientation \nwhile a basement high on its south-eastern side has a NW trend.  \nThe model indicates two further basins on the Rockall High further to the NE. The form of \nthe gravity anomaly over the western of these (R1) suggests that it is a half-graben which is \nfaulted on its SE side. Naylor et al. (1999) mapped a fault which coincides with this margin \nbut did not detect significant sedimentary infill, perhaps because this fill is of Mesozoic age \nand masked by Palaeogene lavas. The second, more northerly basin (R2) appears as an upper-\ncrustal, low velocity zone at the NW end of the RAPIDS 33 profile (Figs. 4, 7); Mackenzie et \nal. (2002) ascribe the velocity effect to fractured or weathered basement rather than a \nsedimentary depocentre but the gravity signature favours the latter explanation. \nKimbell et al.  3D model of the Irish margin \n 17 \nThe modelled forms of the Conall (CNB) and Rónán (ROB) basins are similar to those \nmapped by Naylor et al. (1999), although the Conall Basin has a somewhat more arcuate \nshape. A further basin (R3 in Fig. 4) is modelled on the Rockall High just north of the median \nline. It has a similar trend to the Rónán Basin and may thus be a faulted Mesozoic basin \nbeneath the Palaeogene basalts. Hitchen (2004) reports evidence for natural oil seeps along \nthe NW margin of this basin and a separate set which align along a prolongation of the NW \nmargin of the Rónán Basin to the south.  There are further possible small basins to the E and \nNE of R3 at the edge of the Rockall Basin although these are not well resolved because of \nlimitations in the bathymetric and gravity data coverage. \n5.3.4. Rockall Basin \nThe modelled average thickness of the crystalline crust beneath the Rockall Basin is 5-6 km \nbut there is a distinct increase in crustal thickness in the north, with values of around 10 km \ncharacterising the part of the basin to the north of the Irish Designated Area (Fig. 5a). Wide-\nangle seismic experiments (Roberts et al., 1988; Klingelhöfer et al., 2005) and previous \ngravity modelling (Kimbell et al., 2005) confirm that lower apparent extension factors \ncharacterise the Rockall Basin to the north of the present study area, with the change in \ndegree of extension probably accommodated by transfer movements on the intervening \nAnton Dohrn lineament zone (Kimbell et al., 2005). Gravity and seismic data suggest that the \ncrystalline crust beneath the axis of the northern part of the Irish Rockall Basin is somewhat \nthicker than towards its flanks, and O’Reilly et al. (1995) have ascribed this to cooling and \nstrengthening along this axis leading to outward migration of strain to the warmer margins  \n(see also Bassi, 1995). \nThe Barra Volcanic Ridge System (Fig. 1) in the southern part of the Rockall Basin \ncomprises a series of arcuate ridges in the acoustic basement which are associated with strong \nmagnetic anomalies (Fig. 8a; Bentley and Scrutton, 1987; Scrutton and Bentley, 1988). The \nridges are considered to be extrusive volcanic edifices which were subsequently draped with \nsedimentary rocks until finally being overstepped by sediment in Eocene time (Scrutton and \nBentley, 1988). The stratigraphic control does not allow them to be dated accurately but they \nmay be of Early Cretaceous age, when there was also significant igneous activity in the \nPorcupine Basin and on the Labrador Margin (Scrutton and Bentley, 1988; Tate and Dobson, \n1988; Balkwill, 1987; DeSilva, 1999). Although the seismically-imaged ridges appear \nextrusive, modelling by Scrutton and Bentley (1988) indicated that the magnetic anomalies \nKimbell et al.  3D model of the Irish margin \n 18 \nare best explained by a combination of the extrusive units and underlying intrusions, \npresumably lying along the fissures through which the igneous rocks were emplaced. The two \nmost prominent ridges (in terms of their magnetic anomalies) correlate closely with the \nmargins of a pronounced positive gravity anomaly (GH in Fig. 6a). This is accommodated in \nthe 3D model by a zone of highly stretched crystalline crust, although a lateral change in \ncrustal density provides an alternative explanation (Scrutton and Bentley, 1988). In either \ncase there is a requirement for a marked departure from isostatic equilibrium, indicating \nsignificant lithospheric strength. \n5.3.5. Basins on the SE side of the Rockall Basin \nThe North Bróna Basin (NBB) and South Bróna Basin (SBB) are Mesozoic basins on the \nwestern side of the Porcupine High and the Cillian Basin (CB) is a shallow graben lying on \ntheir east side (Figs. 1 and 4). Naylor et al. (1999) ascribe a Cenozoic age to the Cillian \nBasin, but Haughton et al. (2005) indicate that it may contain a substantial proportion of \nCretaceous sediments. The southern part of the Cillian Basin is not well resolved by the 3D \nmodel, but the results do suggest that it extends about 30 km further to the NW than is \nindicated in the map of Naylor et al. (1999) (Figs. 1 and 4). The ENE alignment of the \nnorthern margin of this extension suggests the possibility of influence by reactivated \nCaledonian structures (Great Glen Fault or Fair Head – Clew Bay Line). \nThe model indicates a further possible basin on the Porcupine High (PHB) between the \nCillian and Macdara basins. Corfield et al. (1999) interpreted this to lie between splays of the \nGreat Glen Fault. The interpretation by Naylor et al. (1999) of GSI Line 1 indicates only thin \nCenozoic cover across the basin, suggesting a Mesozoic or older age. Recent evidence for \nlavas of Cretaceous age in this area (Haughton et al., 2005) might explain the difficulty in \nimaging deeper structure on seismic profiles.  \nThe model emphasises the linearity of the Erris Basin (EB), and comparison with the starting \nmodel reveals that the most strongly linear components were introduced by the gravity \noptimisation and thus provide an independent view of the fault architecture. The northern \nextension of the basin is offset north of 55.8ºN and the southern limit of the basin occurs in \nan area of structural complexity at its intersection with the Slyne Basin. The gravity and \nmagnetic modelling enable the Erris High (EH) to be traced over a distance of about 170 km, \nlinking it southward to a basement high detected on WESTLINE (England and Hobbs, 1997). \nKimbell et al.  3D model of the Irish margin \n 19 \nThe Slyne Basin (SB) is another strongly linear feature, particularly along its faulted western \nmargin, and this accentuates the difference between its NNE trend and the NE trend of the \nErris Basin. The eastern margin of the basin appears faulted towards the north, close to the \nintersection with the Erris Basin, but more diffuse south of about 54ºN, where the main fault \nis modelled to lie on the west side of the basin. This is compatible with the seismic images \npresented by Dancer et al. (1999). Those authors accommodate the change in basin polarity \nby transfer movements on a reactivated splay of the Great Glen Fault. Additional structural \ncontrol may have been provided by an extension of the South Hatton Lineament which could \ndefine the northern margin of the Slyne High (SH) and then project south-eastwards across \nthe basin in the area where the polarity change occurs. \n5.3.6. Porcupine Basin \nThe modelled pre-Cenozoic sedimentary thickness has sharp inflections across the margins of \nthe Porcupine Basin (PB) that are most probably related to fault zones. Comparison of the \ninitial and optimised structure (Fig.3a and b respectively), particularly along the eastern \nmargin of the basin, indicates that offsets between fault zones that compare well with \nstructure identified by seismic surveys (e.g. Naylor et al., 2002). The western margin of the \nbasin is more irregular in the model than in the structural element map of Naylor et al. (2002) \nwith tongues of sediment extending further westward onto the Porcupine High than indicated \nby that map. One of these features, which lies just south of 52° N, was identified by Readman \net al. (2005), and related to a NW-trending fault system which they infer to have influenced \nbasin evolution. The model reveals an asymmetry in the way the crystalline crust thins at the \nbasin margins, with more rapid thinning on its western side (Fig. 5a), and this was also \nobserved in wide-angle seismic data by O’Reilly et al. (2006).  \nRegardless of the nature of the basement beneath the Porcupine Basin, the free-air (Fig. 5a) \nand isostatic gravity anomaly high that coincides with the northern part of this basin indicates \nan isostatic imbalance. It is not possible to generate the positive gravity anomaly without \nplacing the sedimentary infill at a higher level than would be dictated by local isostasy.  \nKimbell et al. (2004) illustrated how the gravity high can be explained by the influence of \nlithospheric strength during sediment loading, and estimated an effective elastic thickness of \n10 km based on a sedimentary model extending approximately to base Cretaceous level. The \nsubdivided sedimentary section provided by the current model provided an opportunity to test \nwhether the strength is a largely Cenozoic phenomenon or extends back into the Mesozoic. \nKimbell et al.  3D model of the Irish margin \n 20 \nWhen lithospheric strength was assumed to apply only during Cenozoic deposition, the \npredicted positive gravity anomaly over the Porcupine Basin was broader than that observed \nand offset to the north. The conclusion is that lithospheric strength did have an influence \nduring Cretaceous times, and this is compatible with a sag phase following Late Jurassic – \nearliest Cretaceous rifting (Naylor and Shannon, 2005). The implication is that any \nlithospheric weakening associated with partial serpentinisation of the mantle beneath the \nPorcupine Basin is offset by the strength of the underlying, unaltered and relatively strong \nlithospheric mantle, which is still thicker than the lithospheric mantle beneath the \nneighbouring highs.   \n5.3.7. Basins to the south of Ireland \nThe cover sequence thickness model (Fig. 4) emphasises the linear ENE-trending structural \ncontrol over the North Celtic Sea Basin (NCSB), South Celtic Sea Basin (SCSB) and \nWestern Approaches Basin (WAB). This contrasts with the NE- to NNE-trends which \ncharacterise the Fastnet Basin (FB) and, to the NE, the Kish Bank Basin (KBB), Central Irish \nSea Basin (CISB), Peel Basin (PB) and Cardigan Bay Basin (CBB). The change in trend \nbetween the basins in the Celtic and Irish Seas could reflect the influence of Variscan \nstructures in the former area, but there is a similar change in Caledonian features to the north \nof the Variscan Front including the Iapetus Suture, which swings from an ENE trend across \nthe west of Ireland to a NE trend across the east of Ireland and back to an ENE trend beneath \nmainland Britain (Fig. 4; Phillips et al., 1976; McKerrow and Soper, 1989; Kimbell and \nQuirk, 1999; see also Readman et al., 1997). Kimbell and Stone (1995) and Kimbell and \nQuirk (1999) identified antecedents for these trends within the basement to the south of the \nIapetus Suture beneath Britain. The ENE trend is followed, for example, by the Causey Pike \nFault and Southern Borrowdales lineament of the Lake District (Cooper et al., 2004), and the \nmore northerly trend is followed by the Welsh Borderland Fault System and other basement \nstructures beneath northern England and the Irish Sea. Kimbell and Quirk (1999) concluded \nthat the basement structures with these trends may have been initiated during the late \nPrecambrian – early Cambrian assembly of Avalonia at the northern margin of Gondwana, \nand that they were subsequently subject to multiple phases of Caledonian reactivation, \nincluding rifting at the margins of the Iapetus Ocean and compressional deformation \nassociated with the closure of that ocean (see also Hutton and Alsop, 1996). If the Avalonian \nbasement to the south of Ireland has a similar structural fabric this could have influenced \nCaledonian and Variscan deformation in this region which, in turn, established the structural \nKimbell et al.  3D model of the Irish margin \n 21 \ncontrols over subsequent basin evolution (cf. Bois et al., 1990; Ford et al., 1992; McCann and \nShannon, 1994; McCann, 1996). The nature of the underlying continental basement may \nchange in the extreme SE of the study area, because the northern margin of the Western \nApproaches Basin appears to lie along the extension of the Rheic Suture, which marks the \nboundary between Avalonian and Cadomian basement formed by the closure of the Rheic \nOcean in late Silurian – early Devonian time (Pharaoh, 1999 and references therein). \n5.3.8 Continental margin in the south \nApparent ENE- and NE-trending features in the model for the Goban Spur area are \nconsidered unreliable, probably arising from distortions in the observed gravity field relating \nto the merging of different data sources. Satellite-derived gravity data were employed in an \narea extending eastwards from the southern extremity of the Irish Designated Area (visible as \na change in frequency content in Fig. 6a). A discrepancy between high-resolution bathymetry \nand low resolution gravity along the Western Appoaches – North Armorican margin results \nin further model distortion. Superior bathymetric sampling has led to the prediction of \nfeatures which are not resolved by the gravity observations and thus accommodated by \ninaccurately modelled sediment thickness variations. For these reasons the modelling results \nin this area will not be discussed further. \n6. Magnetic modelling \n6.1 Method \nTheoretical total magnetic field anomalies were calculated from the crustal structure defined \nby the gravity model, based on the assumption that the crystalline crust has a magnetisation \nof 1 A\/m in the direction of the Earth’s present field (cf. Kimbell & Stone 1995; Kimbell & \nQuirk, 1997) and the volcanic layer in the Hatton-Edoras area has a reversed magnetisation of \n3 A\/m (based on DSDP palaeomagnetic measurements). The result is displayed alongside the \nobserved magnetic field in Fig. 8. The modelling does not attempt to simulate the effects of \nmagnetic reversals within the oceanic crust but there is a broad zone of normally magnetised \noceanic crust adjacent to the Porcupine – Goban Spur continental margin (crust formed \nduring the Cretaceous normal polarity superchron, C34N), so it is instructive to include this \nin the comparison. The first reversed polarity interval (C33R) is well resolved in the observed \nmagnetic field (Fig. 8a) and has been traced on the calculated field (Fig. 8b) for cross-\nreference. \nKimbell et al.  3D model of the Irish margin \n 22 \n6.2 Results \nThe magnetic modelling demonstrates that it is not possible to explain much of the observed \nshorter wavelength magnetic signal with the simple assumptions made. Substantial \ncontributions are required from variations in basement magnetisation combined with a variety \nof intrusive and extrusive magnetic sources, including both reversely and normally \nmagnetised units. The forward model does, however, reproduce some of the broader features \nof the magnetic field, showing that the regional magnetic lows over the Rockall and \nPorcupine basins can be explained by the thinning of magnetic crystalline crust beneath these \nbasins. The magnetic crust probably extends westwards beneath the Hatton-Rockall area but \nthe basement beneath the basins to the south and east of Ireland is less magnetic, as the sharp \nmagnetic signatures over these basins in the forward magnetic model are not reflected by the \nobserved field. This is probably because the upper part of the basement in this region \ncomprises Lower Palaeozoic metasedimentary rocks which generally have lower \nmagnetisation.   \nWithin the southern part of the Hatton Basin, high amplitude NNE-trending linear magnetic \nhighs and lows show a partial correlation with computed magnetic features associated with \nbasement highs and lows resolved by the 3D modelling. However, differences in the detail of \nthe anomaly pattern and the far smaller amplitudes of the anomalies in the forward magnetic \nmodel indicate that this is not simply a case of variations in the thickness of non-magnetic \nsediments over ‘normal’ magnetic crystalline basement. Strongly magnetic basement is \npresent on the conjugate margin (calc-alkaline rocks within the Ketilidean orogen in southern \nGreenland) and may extend beneath the Hatton area, but the form of the anomalies does \nsuggest the possibility of later igneous sources. For example, a pronounced linear positive \nmagnetic anomaly extends almost 500 km in a NNE direction between 21°W 53°N and 18°W \n57°N (MH in Fig. 8a) and is partially coincident with the Fangorn High (FH; Roberts, 1975; \nRoberts et al.,1979), and it is possible that the latter overlies a more extensive normally \nmagnetised intrusive body (Edwards, 2002). Such bodies might be of Palaeogene and\/or \nCretaceous ages. If the latter, they could have been emplaced at the same time as the Barra \nVolcanic Ridge System (Bentley and Scrutton, 1987; Scrutton and Bentley, 1988). \nThe magnetic signatures change between the southern and northern parts of the Hatton Basin. \nIn the north, the thickest parts of the cover sequence tend to correlate with magnetic highs \nrather than lows, possibly because reversely magnetised Palaeogene lavas are thinner beneath \nthe basin than on its flanks, as a result of thickness changes across the lava escarpments \nKimbell et al.  3D model of the Irish margin \n 23 \nobserved at the basin margins. The NNE trend is less pronounced in the north, although there \nare weak indications of the continuity of magnetic lineaments across the divide. There are \nmagnetic discontinuities at the South Hatton Lineament (Fig. 8a), and it appears possible that \nthere may be an additional discontinuity slightly further north, in the vicinity of the median \nline. The latter is difficult to identify with confidence in the current compilation, however, \nbecause of a change in magnetic data quality across that line. \nThe observed magnetic field in the southern part of the Rockall Basin is dominated by the \neffects of the Barra Volcanic Ridge System, but further north there are subtle magnetic \nfeatures in the observed field that appear to be due to variations in the depth and thickness of \nthe crystalline crust beneath the basin (Fig. 8a). A significant proportion of these features are \nreproduced by the forward magnetic model (Fig.8b) suggesting that the optimisation process \nhas recovered real variations in crustal structure.  \n6.3 Insights from the pseudogravity transform in the Porcupine area \nFigure 9 illustrates the pseudogravity transform (Baranov, 1957) of the observed and \ncalculated magnetic fields in the Porcupine area. This transform suppresses short-wavelength \nmagnetic variations, helping to clarify similarities and differences between the longer \nwavelength components of these fields. The magnetic low associated with thinning of the \ncrystalline crust beneath the Porcupine Basin is well resolved in both, but the version based \non the observed field highlights lateral variations in basement magnetisation elsewhere in the \narea. A clear boundary, with more magnetic crust to the north, occurs just east of Ireland \nclose to the offshore projection of the Iapetus Suture Zone (Fig.1). This configuration is \ncomparable to that observed across Ireland and Britain and may be due to less magnetic \nmetasedimentary rocks originally deposited on the margins of the Iapetus Ocean being \njuxtaposed against more magnetic crystalline basement to the north (Kimbell and Stone, \n1995; Kimbell and Quirk, 1999). The magnetic boundary occurs close to the southern edge of \nthe zone of north-dipping reflectors correlated with the Iapetus Suture Zone by Klemperer et \nal. (1991). Although the Variscan Front also trends towards this location it appears unlikely \nthat it represents a sufficiently large structural disruption to be responsible for the observed \nmagnetic effect (Ford et al., 1992). There is no evidence of a magnetisation boundary on the \nPorcupine High along the direct (WSW) projection of the feature identified just west of \nIreland, so the most likely trajectory for the Iapetus Suture lies slightly further south, close to \nthe southern end of this high.  \nKimbell et al.  3D model of the Irish margin \n 24 \nA further feature highlighted by the pseudogravity comparison is a zone of less magnetic \ncrust to the north of the Porcupine Basin (PHB in Fig. 9a). This partially correlates with a \nlocal basin defined by the gravity model (PHB in Fig. 4) but the magnetic feature is more \nextensive. The most likely explanation is that there is a belt of sedimentary\/metasedimentary \n(Palaeozoic?) rocks that has low magnetisation but only locally a low density. The southern \nboundary of this feature lies along the projection of the Skerd Rocks (Southern Upland) Fault \n(Fig. 4). \nThere is a distinct contrast between the observed pseudogravity anomalies over the oceanic \nbasement adjacent to the Porcupine–Goban Spur margin and those over the eastern side of the \nRockall Basin (Fig. 9a). This suggests that the former has a higher magnetisation than the \nlatter, as their modelled (and seismically defined) thicknesses and theoretical psuedogravity \nresponses (Fig. 9b) are similar. The observed difference in magnetisation is explicable if it is \nassumed that there is normally magnetised igneous oceanic crust in the south while the \nRockall Basin is underlain by highly stretched and less magnetic continental crust. This \ninterpretation differs from the hypotheses that the Rockall Basin is floored by oceanic crust of \nmid-Cretaceous age (e.g. Chappell and Kusznir, 2005) or that the Porcupine Abyssal Plain \nadjacent to Goban Spur margin is underlain by exhumed, serpentinised mantle (Bullock and \nMinshull, 2005). Measurements of the magnetisation of serpentinised peridotite from \nexhumed mantle on the Iberian margin indicate values that are significantly less than those \nfor oceanic basalts (Zhao, 1996; Zhao et al., 2001; Russell and Whitmarsh, 2003). Sibuet et \nal. (2007) argued that some magnetic anomalies in this area could relate to serpentinisation, \nbut conceded that the magnetisations involved are lower and more variable than those \ncharacteristic of igneous ocean crust. On the North Armorican margin the ocean-continent \ntransition zone identified by Thinon et al. (2003), which may contain exhumed mantle, has a \nmuch more subdued magnetic signature than the normal oceanic crust to the south. \nOur preferred interpretation is that that the extensive zone of magnetic basement adjacent to \nthe Porcupine-Goban margin is mainly composed of igneous oceanic crust formed during the \nCretaceous normal-polarity superchron (C34N). If exhumed mantle occurs within this area \nwe suggest that it may have only limited extent. Such a hypothesis receives some support \nfrom the presence of a relative magnetic low which appears to coincide with the anomalous \nbasement identified by Bullock and Minshull (2005) near the western end of the WAM \nprofile (compare their figs. 2a and 9), but further investigation would be necessary to confirm \nthis. \nKimbell et al.  3D model of the Irish margin \n 25 \n7. Concluding remarks \nThe new modelling results are similar to those for the Irish part of the NE Atlantic margin in \nthe 3D model of Kimbell et al. (2004, 2005), but with a marked improvement in the \nresolution of cover sequence structure. The key factors leading to this improvement were a \nmore accurate representation of the initial geometry of this sequence and the density \nvariations within it, and higher resolution sampling of the observed gravity field available \nfrom marine survey data acquired for the Irish National Seabed Survey.  The results obtained \nover better-known structures, such as the Slyne and Erris basins, indicate that gravity \ninversion has resolved structure that can be validated by comparison with seismic evidence. \nThis gives confidence in the delineation of less well-known structures such as the Ciarán and \nColmán basins and further, previously unidentified basins on the Rockall High. Further \napparent Mesozoic rifts beneath the Hatton Basin and Hatton-Edoras High are more \nspeculative, because of uncertainties in modelling the overlying sequence and the possible \ninfluence of igneous units, but nonetheless represent suitable targets for further investigation. \nThe modelled configuration of the main deep water basins conforms to that identified by a \nnumber of previous studies, with highly stretched crust beneath the Rockall and Porcupine \nbasins and a lower degree of stretching beneath the Hatton Basin. Forward modelling \nindicates that the broad magnetic anomaly pattern across the Rockall and Porcupine basins \ncan be explained in terms of variations in the thickness of the magnetic crystalline crust. \nSuperimposed on this are anomalies associated with intra-basement magnetisation variations, \nfor example between magnetic crystalline rocks in the hanging wall of the Iapetus Suture and \nnon-magnetic metasedimentary rocks in its footwall. The magnetic expression of the Hatton \nBasin appears to have been strongly influenced by igneous rocks of Palaeogene and possibly \nalso Cretaceous ages. \nMagnetic signatures across the eastern margin of the Rockall Basin and the continent-ocean \nboundary in the adjacent Porcupine – Goban Spur area suggests that the former area is \nfloored by highly stretched continental crust, perhaps including areas of exhumed upper \nmantle, and the latter by igneous ocean crust. If the main extensional event in the basin was \nearliest Cretaceous in age then this amagmatic response to stretching would be compatible \nwith that which occurred on the Iberian margin at that time (Pinheiro et al., 1996). A strongly \ncontrasting magnetic expression is associated with the Barra Volcanic ridges in the \nsouthernmost part of the Rockall Basin. The age of these is not known, but their cross-basin \n(NW) trend suggests that they could be an igneous manifestation of a later stretching event \nKimbell et al.  3D model of the Irish margin \n 26 \nthat occurred under conditions more conducive to magmatic activity. The presence of \nvolcanic rocks on the Labrador margin (Alexis Formation) lying immediately beneath \nsandstones of Albian age (Balkwill, 1987), and of igneous ocean crust of similar age off the \nGoban Spur margin (at least in our interpretation), suggests that such conditions had been \nestablished by mid-Cretaceous times. Magmatism of this age might also explain some of the \nmagnetic responses observed in the Hatton Basin area. The gravity response over the area \nspanned by the Barra Volcanic Ridges suggests relatively strong and perhaps incipient \noceanic lithosphere beneath this area. Final breakup did not, however, proceed along this axis \nbut transferred westward along the Charlie Gibbs transform. \n \nAcknowledgements \nThe modelling project that provided the basis for this paper was sponsored by the Irish Shelf \nPetroleum Studies Group (ISPSG; part of Ireland’s Petroleum Infrastructure Programme). We \nthank the ISPSG Secretariat and Petroleum Affairs Division (Department of \nCommunications, Energy and Natural Resources) for their assistance with initiating the \nproject and the Geological Survey of Ireland for kindly providing data from the Irish National \nSeabed Survey. This paper is published with the permission of the Executive Director of the \nBritish Geological Survey (NERC). \n \nKimbell et al.  3D model of the Irish margin \n 27 \nReferences  \nAllen, P.A., Bennett, S.D., Cunningham, M.J.M., Carter, A., Gallagher, K., Lazzaretti, E., Galewsky, J., \nDensmore, A.L., Phillips, W.E.A., Naylor, D., Solla Hach, C., 2002. The post-Variscan thermal and \ndenudational history of Ireland. In: Doré, A G, Cartwright, J A, Stoker, M S, Turner, J P, and White, N J (Eds.), \nExhumation of the North Atlantic margin: Timing, Mechanisms and Implications for Petroleum Exploration. \nSpecial Publication of the Geological Society, London 196, 371-399. \nBalkwill, H.R., 1987. Labrador Basin: structural and stratigraphic style. Memoir of the Canadian Society of \nPetroleum Geologists 12, 17-43. \nBaranov, V., 1957. A new method for the interpretation of aeromagnetic maps: pseudogravimetric anomalies.   \nGeophysics 22 359-383. \nBarton, A.J., White R.S., 1997a. Crustal structure of Edoras Bank continental margin and mantle thermal \nanomalies beneath the North Atlantic. Journal of Geophysical Research 102, B2, 3109-3129. \nBarton, A.J., White, R.S., 1997b. Volcanism on the Rockall continental margin. Journal of the Geological \nSociety, London 154, 531-536. \nBassi, G., 1995. Relative importance of strain rate and rheology for the mode of continental extension. \nGeophysical Journal International 122, 195-210. \nBentley, P.A.D., Scrutton, R.A., 1987. Seismic investigations into the basement structure of southern Rockall \nTrough. In: Brooks, J. and Glennie, K.W.  (Eds.), Petroleum Geology of Northwest Europe: Proceedings of the \n3rd Conference. Graham and Trotman, London, pp. 667-675.  \nBIRPS and ECORS,  1986.   Deep seismic reflection profiling between England, France and Ireland.   Journal of \nthe Geological Society, London 143, 45-52. \nBois, C., Lefort, J.-P., Le Gall, B., Sibuet, J.-C., Gariel, O., Pinet, B., Cazes, M., 1990. Superimposed Variscan, \nCaledonian and Proterozoic features inferred from deep seismic profiles recorded between southern Ireland, \nsouthwestern Britain and western France. Tectonophysics 177, 15-37. \nBoldreel, L.O., Andersen, M.S., 1994. Tertiary development of the Faroe-Rockall Plateau based on seismic \nreflection data. Bulletin of the Geological Society of Denmark 41, 169-180. \nBonneville, A., Capolsini, P., 1999. THERMIC: a tool to solve conductive and advective heat transfer problems \nin Earth sciences. Computer and Geosciences 25, 1137-1148. \nBott, M.H.P., Watts, A.B., 1971. Deep structure of the continental margin adjacent to the British Isles. In: \nDelaney, F.M. (Ed.), The geology of the East Atlantic continental margin. 2. Europe. Report of the Institute of \nGeological Sciences 70\/14, 89-109. \nBreivik, A.J., Verhoef, J., Faleide, J.I., 1999. Effect of thermal contrasts on gravity modelling at passive \nmargins: results from the western Barents Sea. Journal of Geophysical Research 104, 15293-15311. \nBullock, A.D., Minshull, T.A., 2005. From continental extension to seafloor spreading: crustal structure of the \nGoban Spur rifted margin, southwest of the UK. Geophysical Journal International 163, 527-546. \nChadwick, R.A., Jackson, D.I., Barnes, R.P., Kimbell, G.S., Johnson, H., Chiverrell, R.C., Thomas, G.S.P., \nJones, N.S., Riley, N.J., Pickett, E.A., Young, B., Holliday, D.W., Ball, D.F., Molyneux, S.G., Long, D., Power, \nG.M., Roberts, D.H., 2001. Geology of the Isle of Man and its offshore area. British Geological Survey \nResearch Report, RR\/01\/06. \nChapman, M.E., Bodine, J., 1979. Considerations of the indirect effect in marine gravity modelling. Journal of \nGeophysical Research 84, 3889-3892. \nChapman, T.J., Broks, T.M., Corcoran, D.V., Duncan, L.A., Dancer, P.N., 1999. The structural evolution of the \nErris Trough, offshore northwest Ireland, and implications for hydrocarbon generation. In: Fleet, A.J., Boldy, S \nA.R. (Eds.), Petroleum Geology of Northwest Europe: Proceedings of the 5th Conference. The Geological \nSociety, London, pp. 455-469. \nChappell, A.R., Kusznir, N.J., 2005. Crustal thickness mapping using satellite gravity data: implications for the \nformation of the southern Rockall Trough. Geophysical Research Abstracts 7, 07953. \nConroy, J.J., Brock, A., 1989. Gravity and magnetic studies of crustal structure across the Porcupine basin west \nof Ireland. Earth and Planetary Science Letters 93, 371-376. \nKimbell et al.  3D model of the Irish margin \n 28 \nCooper, A.H., Fortey, N.J., Hughes, R.A., Molyneux, S.G., Moore, R.M., Rushton, A.W.A., Stone, P., 2004. \nThe Skiddaw Group of the English Lake District. Memoir of the British Geological Survey. \nCorfield, S., Murphy, N., Parker, S., 1999. The structural and stratigraphic framework of the Irish Rockall \nTrough. In: Fleet, A.J., Boldy, S.A.R. (Eds.), Petroleum Geology of Northwest Europe: Proceedings of the 5th \nConference. The Geological Society, London, pp. 407-420.  \nCroker, P.F., 1995. The Clare Basin; a geological and geophysical outline. In: Croker, P.F., Shannon, P.M. \n(Eds.), The Petroleum Geology of Ireland’s Offshore Basins. Special Publication of the Geological Society, \nLondon 93, 327-339. \nCroker, P.F., Shannon, P.M., 1987. The evolution and hydrocarbon prospectivity of the Porcupine Basin, \nOffshore Ireland. In: Brooks, J. and Glennie, K.W. (eds) Petroleum Geology of NW Europe, Proceedings of the \n3rd Conference. Graham and Trotman, London, pp. 633-642. \nDabek, Z.K., Williamson, J.P., 1999. Forward and inverse wavenumber formulae for the gravity and magnetic \nresponses of layered models. British Geological Survey Technical Report WK\/99\/03C. \nDancer, P.N., Algar, S.T., Wilson, I.R., 1999. Structural evolution of the Slyne Trough. In: Fleet, A.J., Boldy, \nS.A.R. (Eds.), Petroleum Geology of Northwest Europe: Proceedings of the 5th Conference. The Geological \nSociety, London, pp. 445-453. \nDancer, P.N., Kenyon-Roberts, S.M., Downey, J.W., Baillie, J.M., Meadows, N.S., .Maguire, K., 2005. The \nCorrib gas field, offshore west of Ireland. In: Doré, A.G., Vining, B.A. (Eds), Petroleum Geology: North-West \nEurope and Global Perspectives - Proceedings of the 6th Petroleum Geology conference. The Geological \nSociety, London, pp. 1035-1046.  \nDe Graciansky, P.C., Poag, C.W. et al., 1985. Initial Reports of the Deep Sea Drilling Program, Leg 80. \nDeSilva, N.R., 1999. Sedimentary basins and petroleum systems offshore Newfoundland and Labrador. In: \nFleet, A.J., Boldy, S.A.R. (Eds.), Petroleum Geology of Northwest Europe: Proceedings of the 5th Conference. \nThe Geological Society, London, pp. 501-515. \nDoré, A.G., Cartwright, J.A., Stoker, M.S., Turner, J.P., White, N.  (Eds.), 2002a. Exhumation of the North \nAtlantic margin: Timing, Mechanisms and Implications for Petroleum Exploration. Special Publication of the \nGeological Society, London 196. \nDoré, A.G., Corcoran, D.V., Scotchman, I.C., 2002b. Prediction of the hydrocarbon system in exhumed basins, \nand application to the NW European margin. In: Doré, A G, Cartwright, J A, Stoker, M S, Turner, J P, and \nWhite, N J (Eds.), Exhumation of the North Atlantic margin: Timing, Mechanisms and Implications for \nPetroleum Exploration. Special Publication of the Geological Society, London 196, 401-429. \nDunford, G.M., Dancer, P.N., Long, K.D., 2001. Hydrocarbon potential of the Kish Bank Basin: integration \nwithin a regional model for the greater Irish Sea Basin. In: Shannon, P.M., Haughton, P.D.W., Corcoran, D.V. \n(Eds.), The Petroleum Exploration of Ireland’s Offshore Basins. Special Publication of the Geological Society, \nLondon 188, 135-154. \nEdwards, J.W.F., 2002., Development of the Hatton-Rockall Basin, north-east Atlantic Ocean. Marine and \nPetroleum Geology 19, 193-205.  \nEllis, D., Bell, B.R., Jolley, D.W., O’Callaghan, M., 2002. The stratigraphy, environment of eruption and age of \nthe Faroes Lava Group, NE Atlantic Ocean. In: Jolley, D.W., Bell, B.R. (Eds.), The North Atlantic Igneous \nProvince: Stratigraphy, Tectonic, Volcanic and Magmatic Processes. Special Publication of the Geological \nSociety, London 197, 253-269. \nEngland, R.W., Hobbs, R.W., 1997. The structure of the Rockall Trough imaged by deep seismic reflection \nprofiling. Journal of the Geological Society, London 154, 497-502. \nEvans, C.D.R., Hillis, R.R., Gatliff, R.W., Day, G.A., Edwards, J.W.F., 1990.  United Kingdom offshore \nregional report: the geology of the western English Channel and its western approaches. HMSO for the British \nGeological Survey, London.  \nFloodpage, J., Newman, P., White, J., 2001. Hydrocarbon prospectivity in the Irish Sea area: insights from \nrecent exploration of the Central Irish Sea, Peel and Solway basins. In: Shannon, P.M., Haughton, P.D.W., \nCorcoran, D.V. (Eds.), The Petroleum Exploration of Ireland’s Offshore Basins. Special Publication of the \nGeological Society, London 188, 107-134. \nKimbell et al.  3D model of the Irish margin \n 29 \nFord, M., Klemperer, S.L., Ryan, P.D., 1992. Deep structure of southern Ireland: a new geological synthesis \nusing BIRPS deep reflection profiling. Journal of the Geological Society, London 149, 915-922. \nFyfe, J.A., Long, D., Evans, D., Abraham, D.A., 1993. United Kingdom offshore regional report: the geology of \nthe Malin-Hebrides Sea area. HMSO for the British Geological Survey, London. \nHanisch, J., 1984. The Cretaceous opening of the northeast Atlantic. Tectonophysics 101, 1-23. \nHaszeldine, R.S., Russell, M.J., 1987. The Late Carboniferous northern North Atlantic Ocean: implications for \nhydrocarbon exploration from Britain to the Arctic. In: Brooks, J, Glennie, K.W. (Eds.) Petroleum Geology of \nNW Europe, Proceedings of the 3rd Conference.  Graham and Trotman, London, pp. 1163-1175. \nHaughton, P., Praeg, D., Shannon, P., Harrington, G., Higgs, K., Amy, L., Tyrrell, S., Morrissey, T., 2005. First \nresults from shallow stratigraphic boreholes on the eastern flank of the Rockall Basin, offshore western Ireland. \nIn: Doré, A.G., Vining, B.A. (Eds), Petroleum Geology: North-West Europe and Global Perspectives - \nProceedings of the 6th Petroleum Geology conference. The Geological Society, London, pp.1077-1094. \nHauser, F., O’Reilly, B.M., Jacob, A.W.B., Shannon, P.M., Makris, J., Vogt, U., 1995. The crustal structure of \nthe Rockall Trough: differential stretching without underplating.  Journal of Geophysical Research 100, 4097-\n4116. \nHillis, R., 1995. Regional Tertiary exhumation in and around the United Kingdom. In: Buchanan, J.G., \nBuchanan, P.G. (Eds.),  Basin Inversion. Special Publication of the Geological Society, London 88, 167-190. \nHitchen, K., 2004. The geology of the UK Hatton-Rockall margin. Marine and Petroleum Geology 21, 993-\n1012. \nHutton, D.H.W., Alsop, G.I., 1996. The Caledonian strike-swing and associated lineaments in NW Ireland and \nadjacent areas: sedimentation, deformation and igneous intrusion patterns. Journal of the Geological Society, \nLondon 153, 345-360. \nIzatt, C., Maingarm, S., Racey, A., 2001. Fault distribution and timing in the Central Irish Sea Basin. In: \nShannon, P.M., Haughton, P.D.W., Corcoran, D.V. (Eds.), The Petroleum Exploration of Ireland’s Offshore \nBasins. Special Publication of the Geological Society, London 188, 155-169. \nJohnson, H,, Ritchie, J.D., Gatliff, R.W., Williamson, J.P., Cavill, J., Bulat, J., 2001. Aspects of the structure of \nthe Porcupine and Porcupine Seabight basins as revealed from gravity modelling of regional seismic transects. \nIn: Shannon, P.M., Haughton, P.D.W., Corcoran, D.V. (Eds.), The Petroleum Exploration of Ireland’s Offshore \nBasins. Special Publication of the Geological Society, London 188, 265-274. \nJoppen, M., White, R.S., 1990. The structure and subsidence of Rockall Trough from two-ship seismic \nexperiments. Journal of Geophysical Research 95 (B12), 19821-19837. \nKeser Neish, J., 1993. Seismic structure of the Hatton-Rockall area: an integrated seismic\/modelling study from \ncomposite datasets. In: Parker, J.R. (Ed.), Petroleum Geology of Northwest Europe: Proceedings of the 4th \nConference. The Geological Society, London, pp. 1047-1056. \nKimbell, G.S., Stone, P., 1995. Crustal magnetisation variations across the Iapetus Suture Zone. Geological \nMagazine 132,  599-609. \nKimbell, G.S., Quirk, D.G., 1999. Crustal magnetic structure of the Irish Sea region: evidence for a major \nbasement boundary beneath the Isle of Man. In: Woodcock, N.H., Quirk, D.G., Fitches, W.R., Barnes, R.P. \n(Eds.), In sight of the suture: the geology of the Isle of Man in its Iapetus Ocean context. Special Publication of \nthe Geological Society, London 160, 227-238. \nKimbell, G.S., Gatliff, R.W., Ritchie, J.D., Walker, A.S.D., Williamson, J.P., 2004. Regional three-dimensional \nmodelling of the NE Atlantic margin. Basin Research 16, 259-278. \nKimbell, G.S., Ritchie, J.D.,  Johnson, H., Gatliff, R.W., 2005. Controls on the structure and evolution of the NE \nAtlantic margin revealed by regional potential field imaging and 3D modelling. In: Doré, A.G., Vining, B.A. \n(Eds), Petroleum Geology: North-West Europe and Global Perspectives - Proceedings of the 6th Petroleum \nGeology conference. The Geological Society, London, pp. 933-945. \nKlemperer, S.L., Ryan, P.D., Snyder, D.B., 1991. A deep seismic reflection profile across the Irish Caledonides. \nJournal of the Geological Society, London 148, 149-164. \nKlingelhöfer, F., Edwards, R.A., Hobbs, R.W. and England, R.W., 2005. Crustal structure of the NE Rockall \nTrough from wide-angle seismic data modelling. Journal of Geophysical Research, 110, B11105, 1-25. \n \nKimbell et al.  3D model of the Irish margin \n 30 \nKnott, S.D., Burchell, M.T., Jolley, E.J. and Fraser, A.J., 1993. Mesozoic to Cenozoic plate reconstructions of \nthe North Atlantic and hydrocarbon plays of the Atlantic margins.  In: Parker, J.R. (Ed.), Petroleum Geology of \nNorthwest Europe: Proceedings of the 4th Conference.  The Geological Society, London, pp. 953-974. \nKristofferson, Y., 1978. Sea-floor spreading and the early opening of the North Atlantic. Earth and Planetary \nScience Letters 38, 273-290. \nLouden, K.E., Tucholke, B.E., Oakey, G.N., 2004. Regional anomalies of sediment thickness, basement depth \nand isostatic crustal thickness in the North Atlantic Ocean. Earth and Planetary Science Letters 224, 193-211. \nLouvel, V., Dyment, J., Sibuet, J.-C., 1997. Thinning of the Goban Spur continental margin and formation of \nearly ocean crust: constraints from forward modelling and inversion of marine magnetic anomalies. Geophysical \nJournal International 128, 188-196. \nMcCann, T., 1996. The North Celtic Sea reflector – a possible basement structure, offshore southern Ireland. \nTectonophysics 266, 361-377. \nMcCann, T., Shannon, P.M., 1994. Late  Mesozoic reactivation of Variscan faults in the North Celtic Sea Basin, \nIreland. Marine and Petroleum Geology 11, 94-103. \nMackenzie, G.D., Shannon, P.M., Jacob, A.W.B., Morewood, N.C., Makris, J., Gaye, M., Egloff, F., 2002. The \nvelocity structure of the sediments in the southern Rockall Basin: results from new wide-angle seismic \nmodelling. Marine and Petroleum Geology 19, 983-1003. \nMcKerrow, W.S., Soper, N.J., 1989. The Iapetus suture in the British Isles. Geological Magazine 126, 1-8.  \nMasson, D.G., Montadert, L., Scrutton R.A., 1985. Regional geology of the Goban Spur continental margin. \nInitial Reports of the Deep Sea Drilling Project  80, 1115-1139. \nMegson, J.B., 1987. The evolution of the Rockall Trough and implications for the Faroe-Shetland Tough. In: \nBrooks, J. and Glennie, K.W. (eds) Petroleum Geology of NW Europe, Proceedings of the 3rd Conference. \nGraham and Trotman, London, 653-665. \nMorewood, N.C., Mackenzie, G.D., Shannon, P.M., O’Reilly, B.M., Readman, P.W., Makris, J., 2005. The \ncrustal structure and regional development of the Irish Atlantic margin region. In: Doré, A.G., Vining, B.A. \n(Eds), Petroleum Geology: North-West Europe and Global Perspectives - Proceedings of the 6th Petroleum \nGeology conference. The Geological Society, London, pp. 1023-1033. \nMüller, R.D., Roest W.R., Royer, J.-Y., Gahagan, L.M., Sclater, J.G., 1997. Digital isochrons of the world’s \nocean floor. Journal of Geophysical Research 102, 3211-3214. \nMurdoch, L.M., Musgrove, F.W., Perry, J.S., 1995. Tertiary uplift and inversion history in the North Celtic Sea \nBasin and its influence on source rock maturity. In: Crocker, P.F., Shannon, P.M. (Eds.), The Petroleum \nGeology of Ireland’s Offshore Basins. Special Publication of the Geological Society, London 93, 297-319. \nMusgrove, F.W., Mitchener, B., 1996. Analysis of the pre-Tertiary history of the Rockall Trough. Petroleum \nGeoscience 2, 353-360. \nNadin, P.A., Houchen, M.A., Kuznir, N.J., 1999. Evidence for pre-Cretaceous rifting in the Rockall Trough: an \nanalysis using quantitative 2D structural\/stratigraphic modelling. In: Fleet, A.J. and Boldy, S.A.R. (eds) \nPetroleum Geology of Northwest Europe: Proceedings of the 5th Conference. The Geological Society, London, \n371-378. \nNaylor, D., Shannon P.W., 2005. The structural framework of the Irish Atlantic Margin. In: Doré, A.G., and \nVining, B. (Eds.) Petroleum Geology: North-West Europe and Global Perspectives - Proceedings of the 6th \nPetroleum Geology Conference. The Geological Society, London, pp. 1009-1022. \nNaylor, D., Shannon, P., Murphy, N., 1999. Irish Rockall Basin region - a standard structural nomenclature \nsystem. Petroleum Affairs Division, Special Publication 1\/99. \nNaylor, D., Shannon, P., Murphy, N., 2002. Porcupine-Goban region - a standard structural nomenclature \nsystem. Petroleum Affairs Division, Special Publication 1\/02. \nOldenburg, D.W., 1974., The inversion and interpretation of gravity anomalies. Geophysics 39, 526-536.  \nO'Reilly, B.M., Hauser, F., Jacob, A.W.B., Shannon, P.M., Makris, J., Vogt, U., 1995. The transition between \nthe Erris and the Rockall Basins: new evidence from wide-angle seismic data. Tectonophysics 241, 143-163. \nO'Reilly, B.M., Hauser, F., Jacob, A.W.B., Shannon, P.M., 1996. The lithosphere below the Rockall Trough: \nwide-angle seismic evidence for extensive serpentinisation. Tectonophysics 255, 1-23. \nKimbell et al.  3D model of the Irish margin \n 31 \nO’Reilly, B.M, Readman, P.W., Hauser, F., 1998. Lithospheric structure across the western Eurasian plate from \na wide-angle seismic and gravity study: evidence for a regional thermal anomaly. Earth and Planetary Science \nLetters 156, 275-280. \nO’Reilly B.M., Hauser, F., Ravaut, C., Shannon, P.M., Readman, P.W., 2006. Crustal thinning, mantle \nexhumation and serpentinization in the Porcupine Basin. Journal of the Geological Society, London 163, 775-\n787. \nParker, R.L., 1972. The rapid calculation of potential anomalies. Geophysical Journal of the Royal Astronomical \nSociety 31, 447-455. \nPérez-Gussinyé, M., Reston, T.J., Phipps Morgan, J., 2001. Serpentinization and magmatism during extension at \nnon-volcanic margins: the effect of initial lithospheric structure. In: Wilson, R.C.L., Whitmarsh, R.B., Taylor, \nB., Froitzheim, N. (Eds.), Non-volcanic rifting of continental margins: a comparison of evidence from land and \nsea.  Special Publication of the Geological Society, London 187, 551-576. \nPharaoh, T.C., 1999. Palaeozoic terranes and their lithospheric boundaries within the Trans-European Suture \nZones (TESZ): a review. Tectonophysics 314, 17-41. \nPhillips, W.E.A., Stillman, C.J., Murphy, T., 1976. A Caledonian plate tectonic model. Journal of the \nGeological Society, London 132, 579-609. \nPinheiro, L.M., Wilson, R.C.L., Reis, P.D., Whitmarsh, R.W., Ribeiro, A., 1996. The Western Iberian margin: a \ngeophysical and geological overview. In: Whitmarsh, R.B., Sawyer, D.S., Klaus, A., Masson, D.G. (Eds.), \nProceedings of the Ocean Drilling Program, Scientific Results, 149, 3–23. \nReadman, P.W., O’Reilly, B.M., Murphy, T. 1997. Gravity gradients and upper crustal tectonic fabrics, Ireland. \nJournal of the Geological Society, London 154, 817-828. \nReadman, P.W., O’Reilly, B.M., Shannon, P.M., Naylor, D., 2005. The deep structure of the Porcupine Basin, \noffshore Ireland, from gravity and magnetic studies. In: Doré, A.G., Vining, B.A. (Eds), Petroleum Geology: \nNorth-West Europe and Global Perspectives - Proceedings of the 6th Petroleum Geology conference. The \nGeological Society, London, pp. 1047-1056. \nReston, T.J., 2009. The structure, evolution and symmetry of the magma-poor rifted margins of the North and \nCentral Atlantic. Tectonophysics 468, 6-27. \nReston, T.J., Pennell, J., Stubenrauch, A., Walker, I., Perez-Gussinye, M., 2001. Detachment faulting, mantle \nserpentinization and serpentinite mud volcanism beneath the Porcupine Basin SW of Ireland. Geology 29, 587–\n590. \nReston, T.J., Gaw, V., Pennell, J., Klaeschen, D., Stubenrauch, A., Walker, I., 2004. Extreme crustal thinning in \nthe south Porcupine Basin and the nature of the Porcupine Median High: implications for the formation of non-\nvolcanic rifted margins. Journal of the Geological Society, London 161, 783-798. \nRoberts, D.G., 1975. Marine geology of the Rockall Plateau and Trough. Philosophical Transactions of the \nRoyal Society of London, Series A  278, 447-509. \nRoberts, D.G., Montadert, L., Searle, R C., 1979. The western Rockall plateau: stratigraphy and structural \nevolution. Initial Reports of the Deep Sea Drilling Programme 48, 1061-1088. \nRoberts, D.G., Ginzberg, A., Nunn, K., McQuillin, R., 1988. The structure of the Rockall Trough from seismic \nrefraction and wide-angle reflection measurements. Nature 332, 632-635. \nRoberts, D.G., Thompson, M., Mitchener, B., Hossack, J., Carmichael, S. and Bjornseth, H-M., 1999. \nPalaeozoic to Tertiary rift and basin dynamics: mid-Norway to the Bay of Biscay – a new context for \nhydrocarbon prospectivity in the deep water frontier. In: Fleet, A.J. and Boldy, S.A.R. (eds) Petroleum Geology \nof Northwest Europe: Proceedings of the 5th Conference. The Geological Society, London, pp. 7-40. \nRussell, M.J., Smythe, D.K., 1978. Evidence for an Early Permian oceanic rift in the northern North Atlantic. In: \nNeumann, E.-R. and Ramberg, I.B. (Eds.), Petrology and geochemistry of continental rifts.  Riedel, Dordrecht, \npp. 173-179. \nRussell, S.M., Whitmarsh, R.B., 2003. Magmatism at the west Iberia non-volcanic rifted continental margin: \nevidence from analyses of magnetic anomalies. Geophysical Journal International 154, 706-730. \nSandwell, D.T., Smith, W.H.F., 1997.  Marine gravity anomaly from Geosat and ERS 1 satellite altimetry. \nJournal of Geophysical Research 102, 10039-10054. \nKimbell et al.  3D model of the Irish margin \n 32 \nSclater, J.G., Christie, P.A.F., 1980. Continental stretching: an explanation of the post-mid-Cretaceous \nsubsidence of the central North Sea basin. Journal of Geophysical Research 85, 3711–3739.  \nScrutton, R.A.., 1985. Modelling of magnetic and gravity anomalies at Goban Spur, northeast Atlantic. Initial \nReports of the Deep Sea Drilling Program 80, 1141-1151. \nScrutton, R.A., Bentley,  P.A.D., 1988.  Major Cretaceous volcanic province in the southern Rockall Trough. \nEarth and Planetary Science Letters 91, 198-204 \nShannon P.M., Jacob, A.W.B., Makris, J., O'Reilly, B., Hauser, F., Vogt, U., 1994. Basin evolution in the \nRockall region, North Atlantic. First Break 12, 515-522. \nShannon, P.M., Jacob, A.W.B., O’Reilly, B.M., Hauser, F., Readman, P.W., Makris, J., 1999. Structural setting, \ngeological development and basin modelling in the Rockall Trough. In: Fleet, A.J., Boldy, S.A.R. (Eds.), \nPetroleum Geology of Northwest Europe: Proceedings of the 5th Conference. The Geological Society, London, \npp. 421-431. \nShannon, P.M., Corcoran, D.V., Haughton, P.D.W., 2001. The petroleum geology of Ireland’s offshore basins: \nintroduction. In: Shannon, P.M., Haughton, P.D.W., Corcoran, D.V. (Eds.), The Petroleum Exploration of \nIreland’s Offshore Basins. Special Publication of the Geological Society, London 188, 1-8. \nSibuet, J.-C., Srivastava, S., Manatschal, G., 2007. Exhumed mantle-forming transitional crust in the \nNewfoundland-Iberia rift and associated magnetic anomalies. Journal of Geophysical Research 112 (B6), \nB06105, doi:10.1029\/2005JB003856. \nSmith, L.K., White, R.S., Kusznir, N.J., the iSIMM Team, 2005. Structure of the Hatton Basin and adjacent \ncontinental margin. In: Doré, A.G., Vining, B.A. (Eds), Petroleum Geology: North-West Europe and Global \nPerspectives - Proceedings of the 6th Petroleum Geology Conference. The Geological Society, London, pp. 947-\n956.  \nSmith, L.K., 2006. Crustal structure of Hatton Bank volcanic continental margin from traveltime inversion of \nwide-angle data. Unpublished PhD Thesis, University of Cambridge. \nSmythe, D.K., 1989. Rockall Trough - Cretaceous or Late Palaeozoic? Scottish Journal of Geology 25, 5-43. \nSrivastava, S.P., Voppel, D., Tucholke, B., 1988. Geophysical Atlas of the North Atlantic 50º to 72ºN and 0º to \n65º W. Deutsches Hydrographisches Institut, Hamburg. \nTate, M.P., Dobson, M.R., 1988. Syn- and post-rift igneous activity in the Porcupine Seabight Basin and \nadjacent continental margin W of Ireland. In: Morton, A.C., Parson, L.M. (Eds.), Early Tertiary Volcanism and \nthe Opening of the NE Atlantic. Special Publication of the Geological Society, London 39, 309-334. \nThinon, I., Matias, L., Réhault, J.P., Hirn, A., Fidalgo-González, L., Avedik, F., 2003. Deep structure of the \nArmorican Basin (Bay of Biscay): a review of Norgasis seismic reflection and refraction data.  Journal of the \nGeological Society, London 160, 99-116. \nTucker, R.M., Arter, G., 1987. The tectonic evolution of the North Celtic Sea and Cardigan Bay basins with \nspecial reference to basin inversion. Tectonophysics 137, 291-307. \nVerhoef, J., Roest, W.R., MacNab, R., Arkani-Hamed, J., et al., 1996. Magnetic anomalies of the Arctic and \nNorth Atlantic Oceans and adjacent land areas. Geological Survey of Canada Open File Report, No. 3125a. \nVogt, U., Makris, J., O’Reilly, B.M., Hauser, F., Readman, P.W., Jacob, A.W.B., Shannon, P.M., 1998. The \nHatton Basin and continental margin: crustal structure from wide-angle seismic and gravity data. Journal of \nGeophysical Research 103, 12545-12566. \nWhite, R.S., 1992. Crustal structure and magmatism of North Atlantic continental margins. Journal of the \nGeological Society, London 149, 841-854. \nWhite, R.S., McKenzie, D., 1989. Magmatism at rift zones: The generation of volcanic continental margins and \nflood basalts. Journal of Geophysical Research 94, 7685-7729. \nZhao, X., 1996. Magnetic signatures of peridotite rocks from Sites 897 and 899 and their implications. In: \nWhitmarsh, R.B., Sawyer, D.S., Klaus, A., Masson, D.G. (Eds.), Proceedings of the Ocean Drilling Program, \nScientific Results 149, 431-446. \nZhao, X., Turrin, B.D., Jackson, M., Solheid, P., 2001. Data report: Paleomagnetic and rock magnetic \ncharacterization of rocks recovered from Leg 173 sites. In: Beslier, M.-O., Whitmarsh, R.B., Wallace, P.J., \nGirardeau, J. (Eds.), Proceedings of the Ocean Drilling Program, Scientific Results 173, 1-34 [Online]. \nKimbell et al.  3D model of the Irish margin \n 33 \nFigure captions \nFig. 1  Structural elements of the Irish continental shelf, mainly based on Naylor et al. (1999, \n2002). Age of ocean crust (in Ma) after Müller et al. (1997). Abbreviations: BVRS = Barra \nVolcanic Ridge System; CAB = Canice Basin; CBB = Cardigan Bay Basin; CIAB = Ciarán \nBasin; CB = Cillian Basin; CISB = Central Irish Sea Basin; CMB = Colm Basin; CNB = \nConnall Basin; COB = Cockburn Basin; COLB = Colmán Basin; EB = Erris Basin; EH = \nErris High; FB = Fastnet Basin; FH = Fangorn High; FHCB =  Fair Head – Clew Bay line; \nGGF = Great Glen Fault; HRB = Hatton Ridge basins; IS = Iapetus Suture; KBB = Kish \nBank Basin; MB =  Malin Basin; MDB = Macdara Basin; NBB = North Bróna Basin; OHH = \nOuter Hebrides High; PEB = Peel Basin; PVRS = Porcupine Volcanic Ridge System; ROB = \nRónán Basin (\/ Ladra High); SB = Slyne Basin; SBB = South Bróna Basin; SH = Slyne High; \nSTH =  Stanton High; SUF = Southern Upland Fault; VF = Variscan Front. \nFig. 2  Components of the initial cover sequence model. (a) Topography; (b) thickness of  \nCenozoic sedimentary rocks; (c) assumed thickness of Palaeogene volcanic rocks in the \nRockall-Hatton area; and (d) assumed denudation affecting the pre-Cenozoic sequence. \nWhere volcanic rocks are present, map b represents the post-volcanic succession. \nFig. 3  Thickness of pre-Cenozoic (\/pre-volcanic) sedimentary rocks (a) before and (b) after \nmodel optimisation. \nFig. 4  Total cover sequence thickness in the optimised model. R33 = RAPIDS 33 profile \n(see Fig. 7). Annotations as in Fig. 1, with the following additions: EDH = Edoras High; HH \n= Hatton High; NCSB = North Celtic Sea Basin; NHB = North Hatton Basin; PB Porcupine \nBasin; PH = Porcupine High; PHB = possible basin on Porcupine High; R1-R3 = possible \nbasins on Rockall High; RB = Rockall Basin; RH = Rockall High; SCSB = South Celtic Sea \nBasin; SDR = seaward-dipping reflectors; SHB = South Hatton Basin; SHL = South Hatton \nLineament; WAB = Western Approaches Basin.  \nFig. 5  (a) Thickness of crystalline crust and (b) depth to Moho in the optimised model. \nHeavy contours are at 10 km intervals. CGFZ = Charlie Gibbs Fracture Zone; ETR = East \nThulean Rise; HB = Hatton Basin; PB = Porcupine Basin; RB = Rockall Basin. \nFig. 6  (a) Observed and (b) calculated free-air gravity fields over the Irish Continental Shelf. \nColour shaded-relief images with illumination from the north (same colour scale and imaging \nparameters applied in both maps). The observed field was compiled by the Irish Petroleum \nAffairs Directorate from sources including their own surveys, the Irish National Seabed \nSurvey and satellite-derived data (Sandwell and Smith, 1997). HB = Hatton Basin; GH = \ngravity high within Rockall Basin; PB = Porcupine Basin; RB = Rockall Basin; SHL = South \nHatton Lineament. \nFig. 7  Deep structure beneath the RAPIDS 33 seismic profile, comparing a section through \nthe 3D model (top two panels) with the seismic interpretation of Mackenzie et al. (2002) \n(bottom panel). 3D model interfaces are superimposed as heavy black lines on the seismic \nmodel. Numbers in the bottom panel are P-wave velocities in km\/s. \nFig. 8  (a) Observed and (b) calculated magnetic field over the Irish Continental Shelf. \nColour shaded-relief images with illumination from the north (same colour scale and imaging \nparameters applied in both maps). The observed field was compiled by the Irish Petroleum \nAffairs Directorate from sources including their own surveys, the Irish National Seabed \nSurvey and the GAMMAA5 compilation (Verhoef et al., 1996). The first reversed polarity \ninterval in the oceanic crust (C33R) is clearly imaged in the observed data and its location is \nshown on the modelled version (which does not include magnetic reversals). BVRS = Barra \nVolcanic Ridge System; HB = Hatton Basin; MH = magnetic high within Hatton Basin; PB = \nKimbell et al.  3D model of the Irish margin \n 34 \nPorcupine Basin; PVRS = Porcupine Volcanic Ridge System; RB = Rockall Basin; SHL = \nSouth Hatton Lineament. \nFig. 9 (a) Observed and (b) calculated pseudogravity field over the southeast Rockall – \nPorcupine – Goban Spur area. C33R, C34N = oceanic crust of chron indicated; COB = \ncontinent-ocean boundary (purple line); IS = possible magnetic expression of the Iapetus \nSuture; PB = Porcupine Basin; PH = Porcupine High; PHB = sedimentary\/metasedimentary \nbody on Porcupine High suggested by an observed pseudogravity low; RB = Rockall Basin; \nWAM = Western Approaches Margin seismic profile (BIRPS and ECORS, 1986). \n100\n90807060\n50\n40\n20°W             15°W             10°W\nKimbell et al.  Fig. 1\nRockall\nBasin\nHatton\nBasin\nRo\ncka\nll H\nigh\nPorcupine\nBasin\nWestern\nApproaches\nBasin\nFB\nN C\nelti\nc S\nea \nBa\nsin\nS C\neltic\n Se\na B\nasin\nHR\nB\nCIAB\nCO\nLB\nSB\nEB\nMB\nCharlie Gibbs\nFracture Zone\nCOB\nCA\nB\nNBB\nSBB\nCB\nMD\nB\nCMB\nFH\nKBB\nPEB\nCBB\nCISB\nPorcupine\nAbyssal\nPlain\nRO\nB\nCN\nB\nBVRS\nPVRS\nPo\nrc\nup\nin\ne \nH\nig\nh\nHatton\nHigh\nEdoras\nHigh\nSTH\nOHH\nLimit of Irish\nDesignated Area\nGoban Spur\nbasins\nContinent-ocean\nboundary\nVF\nIS\nSU\nF\nFH\nCB\nGG\nF\n!\n!\n!\n!\n!\n!\n!\n!\n!\n!\n!\n!\nDSDP 555\nDSDP117\nDSDP 116\nODP 982\n27\/5-1\n5\/22-1\n62\/7-1\n19\/5-1\n12\/2-1A\n18\/20-1..4\n27\/13-1A\n12\/13-1A\nHigh\nBasin (mainly\nMesozoic and \nCenozoic)\nOceanic crust\n(of age indicated)\n50°N\n55°N\nVolcanic ridge\nEH\nSU\nF\n!5\/22-1\nOnshore structure\nSelected well\nSH\nKimbell et al.  Fig. 2\n100 km\n20°W             15°W             10°W\n50°N\n55°N\nd\nkm\n0\n0.25\n0.5\n0.75\n1.0\n1.25\n100 km\n20°W             15°W             10°W\n50°N\n55°N\nc\nkm\n0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\n3.5\n4.0\n0\n0.5\n1.0\n1.5\n2.0\n3.0\n4.0\n100 km\n20°W             15°W             10°W\n50°N\n55°N\nb\nkm\n100 km\nRockall \nTrough \nRockall \nBank \nLorien \nBank \nEdoras \nBank \nHatton \nBank \nPorcupine\nAbyssal \nPlain \nPorcupine\nSeabight\nGoban \nSpur \nPorcupine\nBank \n50°N\n55°N\n20°W             15°W             10°W\na\nkm\n1.0\n0.5\n0.0\n-0.5\n-1.0\n-1.5\n-2.0\n-2.5\n-3.0\n-3.5\n-4.0\n-4.5\nKimbell et al.  Fig. 3\n100 km\n20°W             15°W             10°W\n50°N\n55°N\nb\nkm\n0\n0.5\n1\n1.5\n2\n3\n4\n5\n6\n8\n10\n15\n100 km\nkm\n0\n0.5\n1\n1.5\n2\n3\n4\n5\n6\n8\n10\n15\n20°W             15°W             10°W\n50°N\n55°N\na\nRockall\nBasin\nHatton\nBasin\nPorcupine\nBasin\nkm\n0 - 0.5\n0.5 - 1\n1 - 1.5\n1.5 - 2\n2 - 3\n3 - 4\n4 - 5\n5 - 6\n6 - 8\n8 - 10\n>10\n100 km\nVolcanic centre\nIrish designated\narea\nContinent-ocean\nboundary\n20°W             15°W             10°W\n50°N\n55°N\nKimbell et al.  Fig. 4\n100 km\nVF\nGG\nFRB\nSB\nMDBCIAB\nCOLB\nRH\nCNB\nROB\nNHB\nPB\nPH\nSBB\nNBB CB\nCAB\nFB\nCOB\nWAB\nNCSB\nSCSB\nCBB\nCISB\nKBB\nPEB\nMB\nSTH\nOHH\nEB\nCMB\nEDH\nHH\nHRB\nSDR\nFH\nR33\nEH\nSHB\nSHL\nR2\nR3\nR1\nPHB\nSH\nIS\nSU\nF\nFH\nCB\nKimbell et al.  Fig. 5\n100 km\n20°W             15°W             10°W\n50°N\n55°N\nkm\n6\n8\n10\n12\n14\n16\n18\n20\n22\n24\n26\n28\n30\n32\nb\nPB\nRB\nHB\nETR\nCGFZ\n100 km\nkm\n20°W             15°W             10°W\n50°N\n55°N\n2\n4\n6\n8\n10\n12\n14\n16\n18\n20\n22\n24\n26\n28\n30\na\nPB\nRB\nHB\nETR\nCGFZ\n100 km\n50°N\n55°N\n20°W             15°W             10°W\nb\nPB\nRB\nHB\n100 km\n50°N\n55°N\n20°W             15°W             10°W\nKimbell et al.  Fig. 6\na\nPB\nRB\nHB\nGH\nSHL\n6.0\n6.1\n6.3\n6.4\n6.7\n6.8\n6.0\n6.4\n6.7\n6.8\n7.6 7.6\n8.1\n6.0\n6.1\n6.3\n6.4\n6.7\n6.8\n5.0-5.1\n1.8-4.5\n30\n20\n10\n0\nkm\n0 100 200 300 km\nKimbell et al.  Fig. 7\nObserved\nCalculated\n-100\n-50\n0\n50\nmGal\n30\n20\n10\n0\nkm\n0 100 200 300 km\nNW SE\nCenozoic sediments\nPre-Cenozoic sediments\nUpper crust\nLower crust Mantle\nRockall High Conall Basin Rockall Basin Macdara Basin Porcupine High\n0 100 200 300 km\nR2\n50°N\n55°N\n20°W             15°W             10°W\n100 km\nC33R\nb\nPB\nRB\nHB\n100 km\n50°N\n55°N\n20°W             15°W             10°W\nKimbell et al.  Fig. 8\na\nC33R\nBVRS\nPVRS\nPB\nRB\nHB\nSHL\nMH\nC34N\n15°W\n50°N\n55°Nb\n15°W\n50°N\n55°N\nWAM\na\nIS\nPB\nPHB\nC33R\nC34N\nRB\nCOB PH\nKimbell et al.  Fig. 9\n"}