{"doi":"10.1109\/ICICS.2003.1292646","coreId":"102444","oai":"oai:epubs.surrey.ac.uk:1904","identifiers":["oai:epubs.surrey.ac.uk:1904","10.1109\/ICICS.2003.1292646"],"title":"A slant transform watermarking for copyright protection of satellite images","authors":["Zhu, Xunzhan","Ho, Anthony T. S."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-12-15","abstract":"<p>In this paper, we propose a digital watermarking algorithm based on the Slant transform for the copyright protection of satellite images. Designed to match basis vectors to areas of constant luminance slope, the Slant transform is good for compact energy in \"smooth\" images. However, our earlier research work suggests that in terms of watermarking, it works better for textured images, for the energy spread becomes a significant advantage in watermarking and offers a good spread of middle to higher frequencies with significant energies for robust information hiding. This has brought us to consider protecting the copyright of digital satellite images using Slant transform watermarking, which is commonly highly textured. An analytical comparative study on the performance of the Slant transform adapting our earlier watermarking schemes for fast Hadamard transform will be performed based on its robustness against various Stirmark attacks.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n  \n    \n    \n      oai:epubs.surrey.ac.uk:1904<\/identifier><datestamp>\n      2017-10-31T14:03:35Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:436F6D707574696E67<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1904\/<\/dc:relation><dc:title>\n        A slant transform watermarking for copyright protection of satellite images<\/dc:title><dc:creator>\n        Zhu, Xunzhan<\/dc:creator><dc:creator>\n        Ho, Anthony T. S.<\/dc:creator><dc:description>\n        <p>In this paper, we propose a digital watermarking algorithm based on the Slant transform for the copyright protection of satellite images. Designed to match basis vectors to areas of constant luminance slope, the Slant transform is good for compact energy in \"smooth\" images. However, our earlier research work suggests that in terms of watermarking, it works better for textured images, for the energy spread becomes a significant advantage in watermarking and offers a good spread of middle to higher frequencies with significant energies for robust information hiding. This has brought us to consider protecting the copyright of digital satellite images using Slant transform watermarking, which is commonly highly textured. An analytical comparative study on the performance of the Slant transform adapting our earlier watermarking schemes for fast Hadamard transform will be performed based on its robustness against various Stirmark attacks.<\/p><\/dc:description><dc:date>\n        2003-12-15<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1904\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Zhu, Xunzhan and Ho, Anthony T. S.  (2003) A slant transform watermarking for copyright protection of satellite images  In: Fourth International Conference on Information, Communications and Signal Processing, 2003 and the Fourth Pacific Rim Conference on Multimedia. Proceedings of the 2003 Joint.     <\/dc:identifier><dc:relation>\n        10.1109\/ICICS.2003.1292646<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1904\/","10.1109\/ICICS.2003.1292646"],"year":2003,"topics":[],"subject":["Conference or Workshop Item","PeerReviewed"],"fullText":"ICICS-PCM 2003 \n15-18 Dccembs 2W3 \nS i  \n2C2.7 \nA Slant Transform Watermarking \nfor Copyright Protection of Satellite Images \nXunzhan Zhu, Anthony T.S. Ho \nDivision of Information Engineering \nSchool of Electrical and Electronic Engineering \nNanyang Technological University \nEmail: xzzhuODmail.ntu.edu.sg \nAbstract \nIn this paper, we propose a digital watermarking algorithm \nbased on the Slant transform for the copyright protection of \nsatellite images. Designed to match basis vectors to areas of \nconstant luminance slope, the Slant transform is good for \ncompact energy in “smooth” images. However, our earlier \nresearch work suggests that in terms of watermarking, it \nworks better for textured images, for the energy spread \nbecomes a significant advantage in watermarking and offers \na good spread of middle to higher frequencies with \nsignificant energies for robust information hiding. This has \nbrought us to consider protecting the copyright of digital \nsatellite images using Slant hamform watermarking, which \nis commonly bighly textured. An analytical comparative \nstudy on the performance of the Slant transform adapting \nour earlier watermarking schemes for fast Hadamard \ntransform will be performed based on its robustness against \nvarious Stirmark attacks. \n1. Introduction \nspread becomes a significant advantage, as there is now a \ngood spread of middle to higher fiequencies with \ns i w c a n t  energies for robust information hiding. In \nparticular, our earlier research work suggests the above \nproperty of the Slant transform is even more significant \nwhen applied to highly textured images [7], which has \nbrought us to consider protecting the copyright of digital \nsatellite images using Slant transform watermarking. \nThe proposed algorithm applied to satellite images will be \nevaluated based on its robustness against various Stirmark \nattacks [SI. The performance results of the Slant transform \nfor satellite image watermarking against Hadamard \ntransform wil l  also be presented. \nThe rest of this paper is organized as follows. In Section 2, \nthe Slant transform and its relation to Hadamard transform \nis briefly reviewed. Then, our proposed watermarking \nmethod is elaborated in Section 3. Simulation results are \npresented in Section 4, these include comparison of the \nSlant transform to the Hadamard transform in 11, 21. \nFinally, the conclusions are given in Section 5.  \nWith the tremendous development of the Internet, the \nonline purchasing and distribution of satellite images can \nnow be performed relatively easily. It follows that the \ncopyright protection and authaItiCatiOn of digital Satellite \n2. The Slant Transform \nLet [U1 be the original image of sue N x N. its 2DSlant - L 1  - \ntransform is given by [5]  images is increasingly becoming more and more important. \nTo counter this growing information secnrity problem of . 1 I ..,- .T \nillegal distribution and counterfeiting, a novel [ V I =  l ~ “ I L ~ I l ~ “ 1  \nwatermarkmg scheme based 011 fast Hadamard transform \nfor copyright protection of satellite images has been \nproposed in our previous papers [1,2]. The experiment \nresults suggest that this transform could provide a good \n“hidden” space for digital watermarking. \nIn this paper, we propose an improved digital \nWatermarking algoritbm based on the Slant transform for \nthe copyright protection of satellite images. The Slant \ntramform bas been applied to many image processing \napplications, such as transform coding and image \nrestoration [3,4,5] along with many fast algorithms have \nbeen proposed for it [6]. The Slant transform has many \nsimilar properties to the Walsh-Hadamard transform. In \nterms of transform coding, the Slant transform is \nconsidered to be a sub-optimum orthogonal transform for \nenergy compaction. For digital watermarking, the energy \nwhere[S-] is the N x N  unitary Slant matrix. The inverse \ntransformation to recover [U]  fiom the transform \ncomponents [ V] is given by \nThe Slant transform is a member of the orthogonal \ntransforms. It has a constant function for the fmt row, and \nhas a second row which is a hea r  (slant) function of the \ncolumn index. \nThe Slant transform matrix of order two is given by \n0-7803-8185-8\/03\/$17.00 Q 2003 1178 \n3. Watermarking in Slant Transform \nDomain \n(3) \n1 \n,y -_ 4 - 112 2 \n- - 1  0 I 1 0 - q  i 0 [lo] is shown in Figure 1. The original image is not \nnecessary at the watermark recovery stage. This refers to a \n‘‘blind’’ watermarking process. A visually recognizable a4 b4 I -a4 b4 \npattern is embedded by modifyiog the Slant transform \n0 1 :  0 - 1  coefficients of relevant sub-blocks of the host image. The \ndetailed Imageembedded watermark insertion and \n. . . . . . . . . . . . . . . . . . . . . . . .  (4) \nconditions lead to \n1 \na, = 2b, and b4 = \n5 \nEquation (4) can be generalized to give the Slant matrix of \norder N in terms of the Slant matrix of order N I 2  by the \nrecursive relation as given by \n1 s __ \nI -  “ I  \n- 1  0 j : 1 0 :  \nap b, i 0 : -aN bR i 0 \n. . . . . . . . . . . . . . . . . . . . . . . . . . .  \n0 ! I,.,+* i 0 j L2*% \n. . . . . . . . . . . . . . . . . . . . . . . . . . .  \nZ O L i  j 0 - 1 ;  \n-bN : 0 h bx ok j 0 \n. . . . . . . . . . . . . . . . . . . . . . . . . . .  \n0 5 I<.,*>, : 0 j -1,”,%*> \ns,, ~ 0 \n... : ... \n0 i s,, \nThe ma& I,,,,,+, is the identity matrix of dimension \n(N I2) - 2 . The constants aN , bN may be computed by the \nformulas \n= ( - 3N2 )”’, b2, = [ - 1V-11”’ (6) \n.4N2 -1 4N”I \nIn [6], Wang proved that the Slant transform may be \napproached by a series of steps that gradually change the \ntransform from a Hadamard transform, which demonstrates \nthe close relationship between the Slant transform and the \nWalsh-Hadamard transform. From our previous study [7], \nthe Slant transform and the Hadamard transform display \nsimilar properties when applied to digital watermarking. \n=I - ==? \nFigure 1 Generic block diagram of a blind watermarking system \nCopyright information in the form of a trademark or logo \ncan be created as a pattern for watermarking. In our \nexperiment, a grayscale image of sue 64 x 64 is used as the \nWatermark. The watermark insation process is shown in \nFigure 2. We adapt a similar image-embedded watermark \ninsertion algorithm as in [I], while using the Slant \ntransform domain instead of the Hadamard transform \ndomain. The algorithm can be described as follows. \nt D I T -  \nWatermark \nOriginalimage \nFigure 2 Image-embedded watermarking insertion process \nThe watermark image, W ( x , y ) ,  is first transformed into a \nset of Slant transform coefficients by equation (1). A Slant \ntransform matrix of order 64 is applied to this image, and \nthen a 64x64 Slant transform coefficients matrix is \nobtained. The DC component is stored in the secret key fie \nand the AC components are used for watermark embedding. \nLet the original image be I (x , y )  . Simiiar to the algorithm \nused in [1,2], it is decomposed into a set of non-overlapped \n8x8 sub-blocks. An m-sequence random number generator \nis used to select a certain number of sub-blocks for \nwatermark embedding, whose initial seed is also kept in the \nsecret key fde. In every selected sub-block, sixteen middle \nand high fkquency coefficients are used for later \nmodulation. The way of the coefficients selection affects \nthe performance of the watermarking scheme significantly. \n1179 \nThe bigb frequency components are relatively vulnerable to \ncompression operations, while the low fkquency \ncomponents must be retained for visual quality of the \nwatermarked image. Therefore, most existing watermarkmg \nschemes choose to embed the watermark into the middle \nfrequency band. In our scheme, embedding locations as \nshown in Figure 3 are adopted, which are observed, through \nour experiments, to provide a best tradeoff between \nrobustness and data integrity. \nFigure 3 Embedding locations \nLet the watermark Slant transform coefficients denoted by \nm,. The AC coefficients of Slant transformed original image \nsub-blocks, before and after inserting watermark are \ndenoted by x, and x,* , respectively, and i E (O,n] , where n \nis the number of the watermarked coefficients to be inserted \ninto every sub-block, which is set to 16 in our experiment. \nThe embedding formula is given as follows \nx, = a m ,  (7) \nwhere a is the watermark strength factor that controls the \ntradeoff between visual quality of the watermarked image \nand robustness of the watermarkmg scheme. \nAfter embedding, the original coefficient x, is replaced by \nxC* and a new 8 x 8 matrix of Slant transform coefficients \nof image sub-block is obtained. The inverse Slant transform \nis then applied to the 8x8 matrix using equation (2) to \nobtain the luminance matrix of the watermarked image sub- \nblock. After performing the watermark insertion for all  the \nselected sub-blocks of the original image, a watermarked \nimage, Z'(x,y) , is obtained, At the same time, as indicated \nearlier, the secret key file has been generated for \nsubsequent decoding. \nIn watermark detection, the positions of the sub-blocks with \nwatermark embedded are computed using the seed of the \nm-sequence and initial state number that is stored in the key \nfile. All the selected sub-blocks are Slant transformed. Let \nthese coefficients denoted by x,\"and the retrieved \nwatermark Slant transform coefficients by m ; ,  i E ( O , n ] ,  \nwhere n is the number of the watermarked coefficients to be \ninserted in every sub-block. The watermark extraction \nformula is given by \n. x  m =- \na \nThe extracted AC coefficients and the DC component \nstored in the key file are rearranged into a 64x64 Slant \ntransform coefficients matrix. The extracted watermark \nimage, R ' ( x , y ) ,  is then obtained by an inverse Slant \ntransform using equation (2). \n4. Simulation Results \nWe use two 512x512 gray-scale satellite images with \ndistinct texture to test our algorithm. The original and \nwatermarked images are shown in Figure 4. Results show \nthat there are no perceptually visible degradations on the \nwatermarked images with a PSNX of 37.43 dE3 for \nSingapore and 40.65 dl3 for Dolomites. \nFigure 4 GT@MI images (left) and watermarked images (right): \n(a) Singapore; (b) Dolomites. \nTable 1 Results of some Stirmark tests for Singapore \n1180 \nThe Slant transform watermarking scheme is benchmarked \nusing Stirmark 4.0 [SI. Sample results of the Singupore are \nshown in Table 1. We can see that the Slant transform \nwatermarking is robust to noise and common image \nprocessing techniques. \nWe also compare the robustness of the Slant scheme to the \nHadamard scheme in [1,2] against the typical JPEG \ncompression attack. The results are shown in Figures 5. We \ncan see that, for the two typical satellite images, the Slant \ntransform survive P E G  compression far better than the \nHadamard transform. Since the Slant transform is designed \nto match basis vectors to areas of constant luminance slope, \nit is good for compact energy in “smooth” images. \nHowever, in ten& of watermarking, it works better for \n“textured” images, for the energy spread becomes a \nsignificant advantage in watermarking and offers a good \nspread of middle to higher frequencies with significant \nenergies for robust information hiding. It follow therefore \nthat the Slant transform is very robust when applied for \nw a t e r m h g  satellite images, which are commonly highly \ntextured. \n, . .  , . ,  \n. . . .  , . . .  . . . .  ......... ~~.~ ....... ~ ............. . , . .  \nr m m  Bo 70 60 50 o P 20 i o  \nJPEG Compression OualQ Factor \nFigure 5 Performance cumparisons between Slant trimsform and \nHadamad transform, using two images Singupore and Dolomites. \n5. Conclusion \nThis paper has presented a robust watermarking technique \nfor embedding grayscale image watermark into a satellite \nimage based on the Slant transform. The embedding and \nextracting processes have been described in details. The \nSlant transform has more useful middle and high frequency \nbands than several high gain transforms, especially for \nhighly textured satellite images, which provides a good \n“hidden” space for digital Watermarking. It also offers a \nsignificant advantage in shorter processing time and ease of \nhardware implementation than commonly used DCT and \nDWT techniques. This research is based on o w  previous \nwork on the Hadamard transform [1,2]. Comparison results \nbetween the Slant transform and the Hadamard transform \nhave also been presented. \nReferences \n[l] Ho, A.T.S., J. Shea S. H. Tan, “Digital image-in image \nWatermarking technique for copyright protection of \nsatellite images using the fast Hadamard transform,” \nIGARSSOT, June 2416,2002, Toronto, Canada. \n[2] Ho, A.T.S., I. Shen, S. H. Tan, “A robust digital image \nin-image watermarking technique for satellite images,” \nICICS’OI, 15-18 October, 2001, Singapore. \n[3] Clarke, R J., Transform Coding of Images, New York \nAcademic Press, 1985 \n[4] W. K. Pratt, L. R Welch, and W. H. Chen, “Slant \ntransform for image coding,” Proc. Symp. Awl. Walsh \nFunction, March 1972. \n[5] W. K. Pratt, W.H. Chen, and L.R Welch, “Slant \ntransform coding,” IEEE Trans. Communications, vol. \nCOM-22, No. 8, Aug. 1974. \n[6] Z. D. Wang, ‘Wew algorithm for the slant transform,” \nIEEE trans. Pattern Analysis and Machine Intelligence, \nvol. pami-4, pp. 551-555, Dec. 1982. \n[7] Ho, A.T.S., X. Zhn, J. Shen, “Slant transform \nwatermarking for digital images,” Visual Communications \nand Image Processing (VCP03), SPIE, Accepted for \nsession on Image and Video Security and Watermarkiog I, \n8-11, July 2003, Lugano, Switzerland. \n[8] Available at: http:\/\/www.cl.cam.ac.uk\/-fapp2\/water- \nmarking\/stirmark. \n[9] I. J. Cox, J. Kilian, F. T. Leighton, and T. Shamoon, \n“Secure spread spectrum watermarking for multimediq” \nIEEE Trans. Image Processing, vol. 6, pp. 1673-1687, \nDec. 1997. \n[lo] S. Katzenbeisser and A.P.F. Petitcolas, Information \nHiding Techniques for Steganogaphy and Digital \nWatermarking, Artech House, Boston, 2000. \n1181 \n"}