{"doi":"10.1016\/j.jbtep.2007.08.001","coreId":"102557","oai":"oai:epubs.surrey.ac.uk:2040","identifiers":["oai:epubs.surrey.ac.uk:2040","10.1016\/j.jbtep.2007.08.001"],"title":"\"Perhaps you only imagined doing it\": Reality-monitoring in obsessive-compulsive checkers using semi-idiographic stimuli","authors":["Cougle, JR","Salkovskis, PM","Thorpe, SJ"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":"Memory failures reported by obsessive-compulsive (OC) checkers often seem to be errors of \"reality-monitoring\", or misremembering whether one performed or imagined performing an action. To examine these memory processes in the context in which such errors are said to occur, an in-home reality-monitoring experiment involving bothersome and non-bothersome actions was conducted with 21 OC checkers and 24 non-clinical controls. OC checkers reported poorer confidence in memory, but both groups performed similarly on tests of immediate and delayed free and prompted recall. Among OC checkers (but not controls), accuracy in recall and confidence in memory were correlated. Theoretical implications are discussed. (C) 2007 Elsevier Ltd. All rights reserved","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2040<\/identifier><datestamp>\n      2017-10-31T14:04:02Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:50737963686F6C6F6779<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2040\/<\/dc:relation><dc:title>\n        \"Perhaps you only imagined doing it\": Reality-monitoring in obsessive-compulsive checkers using semi-idiographic stimuli<\/dc:title><dc:creator>\n        Cougle, JR<\/dc:creator><dc:creator>\n        Salkovskis, PM<\/dc:creator><dc:creator>\n        Thorpe, SJ<\/dc:creator><dc:description>\n        Memory failures reported by obsessive-compulsive (OC) checkers often seem to be errors of \"reality-monitoring\", or misremembering whether one performed or imagined performing an action. To examine these memory processes in the context in which such errors are said to occur, an in-home reality-monitoring experiment involving bothersome and non-bothersome actions was conducted with 21 OC checkers and 24 non-clinical controls. OC checkers reported poorer confidence in memory, but both groups performed similarly on tests of immediate and delayed free and prompted recall. Among OC checkers (but not controls), accuracy in recall and confidence in memory were correlated. Theoretical implications are discussed. (C) 2007 Elsevier Ltd. All rights reserved.<\/dc:description><dc:date>\n        2008<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2040\/1\/reality_monitoring_JBTEP_rev_final.pdf<\/dc:identifier><dc:identifier>\n          Cougle, JR, Salkovskis, PM and Thorpe, SJ  (2008) \"Perhaps you only imagined doing it\": Reality-monitoring in obsessive-compulsive checkers using semi-idiographic stimuli   Journal of Behavior Therapy and Experimental Psychiatry, 39 (3).  pp. 305-320.      <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science?_ob=ArticleURL&_udi=B6V5V-4PD4XGP-1&_user=121707&_coverDate=09%2F30%2F2008&_rdoc=11&_fmt=high&_orig=browse&_srch=doc-info(%23toc%235796%232008%23999609996%23691615%23FLA%23display%23Volume)&_cdi=5796&_sort=d&_docanchor<\/dc:relation><dc:relation>\n        10.1016\/j.jbtep.2007.08.001<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2040\/","http:\/\/www.sciencedirect.com\/science?_ob=ArticleURL&_udi=B6V5V-4PD4XGP-1&_user=121707&_coverDate=09%2F30%2F2008&_rdoc=11&_fmt=high&_orig=browse&_srch=doc-info(%23toc%235796%232008%23999609996%23691615%23FLA%23display%23Volume)&_cdi=5796&_sort=d&_docanchor","10.1016\/j.jbtep.2007.08.001"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Reality-monitoring \n \n1\nRunning head: REALITY-MONITORING \n \n \n \n \n“Perhaps you only imagined doing it”: Reality-Monitoring in Obsessive-Compulsive Checkers \nUsing Semi-Idiographic Stimuli \n \nJesse R. Cougle1, Paul M. Salkovskis2, Susan J. Thorpe3 \n \n \n1Department of Experimental Psychology, University of Oxford, South Parks Road, Oxford, \nOX1 3UD, UK \n2Department of Psychology, PO Box 077, Institute of Psychiatry, de Crespigny Park, Denmark \nHill, London, SE5 8AF, UK \n3Department of Psychology, School of Human Sciences, University of Surrey, Guildford, Surrey \nGU2 7XH, UK \n \n \n \n \nCorrespondence concerning the manuscript may be addressed to Jesse R. Cougle, \nDepartment of Psychology, University of Texas, 1 University Station A8000, Austin, TX 78712-\n0187, Office: 512-471-3722. Email: cougle@mail.utexas.edu.  \nReality-monitoring 2\nAbstract \nMemory failures reported by obsessive-compulsive (OC) checkers often seem to \nbe errors of “reality-monitoring”, or misremembering whether one performed or \nimagined performing an action. To examine these memory processes in the context in \nwhich such errors are said to occur, an in-home reality-monitoring experiment involving \nbothersome and non-bothersome actions was conducted with 21 OC checkers and 24 \nnon-clinical controls. OC checkers reported poorer confidence in memory, but both \ngroups performed similarly on tests of immediate and delayed free and prompted recall. \nAmong OC checkers (but not controls), accuracy in recall and confidence in memory \nwere correlated. Theoretical implications are discussed.  \nKey words: Obsessive Compulsive Disorder; Checking; Memory; Reality-monitoring \n \n \n \n \n \n \n \n \n \n \n \n \nReality-monitoring 3\n“Perhaps you only imagined doing it”: Reality-Monitoring in Obsessive-Compulsive \nCheckers Using Semi-Idiographic Stimuli \n1. Introduction \nObsessive-Compulsive (OC) checkers often attribute their checking to memory \ndifficulties. Theoretical formulations focusing on the idea that a memory deficit may be \nresponsible for repetitive checking behaviours have good face validity (Sher, Frost, & \nOtto, 1983; Sher, Mann, Frost, 1984; Sher, Frost, Kushner, Crews, & Alexander, 1989; \nPurcell, Maruff, Kyrios, & Pantellis, 1998). OC checking could readily be conceptualized \nas behaviour intended to compensate for poor memory. However, observations such as \nthe situational specificity of checking behaviours have raised the possibility that poor \nconfidence in memory could account for compulsive checking (Rachman 2002; \nSalkovskis 1996; Salkovskis & Kirk, 1997). The OC sufferer may check as a response to \nthe experience of levels of confidence in memory that fall short of the standards they set \nfor themselves; this discrepancy is most likely to occur when they believe that the \nconsequences of an error are particularly serious. Salkovskis (1985; 1999) proposes that \npeople who suffer from OCD are particularly sensitive to the possibility that their actions \nmay result in them being responsible for harm to themselves or others. When applied to \nthe decision as to whether one has completed an action, such beliefs would result in a \nfurther undermining of confidence levels and\/or the requirement of still higher standards \nof confidence in recall. There is evidence that repetitive checking is counter-productive \nand can lead to a further decline in memory confidence (van den Hout & Kindt, 2003; \nRadomsky, Gilchrist & Dussault, 2006), and a cycle of checking behaviour.  \nReality-monitoring 4\nThere is some evidence consistent with both types of theory. Woods and \ncolleagues (2002,) concluded in their recent meta-analysis of memory and checking \nstudies that a deficit may exist for checkers on several different types of memory tasks, \nincluding verbal and visual recall, and recall of actions. However, they also found that the \neffect sizes for poor confidence in memory were much larger and more consistent across \nstudies than those noted for memory deficits.   \n Some of the most convincing evidence of mnestic deficits among OC checkers \nwas found in a neuropsychological investigation by Purcell, Maruff, Kyrios, and Pantelis \n(1998). They paired OC checkers with non-clinical controls from the general population \nand patients suffering from panic disorder and unipolar depression. OC checkers had \nlower scores than other groups on tests of spatial working memory, spatial recognition, \nand motor initiation and execution. Unfortunately, it was not clear how OC checkers \nperformed relative to non-checking OCs. This is important because the direct memory \ndeficit hypothesis is most relevant to checking and it would be important to examine how \nmuch obsessive rumination (characteristic of both OC checking and non-checking \ngroups) may have affected the memory performance of obsessive-compulsive checkers in \nthis study. The effects of rumination on test scores were investigated by Davis and \nNolen-Hoeksema (2000), who found cognitive test scores among non-OCD ruminators \nsimilar to those typical of patients suffering from OCD. It is, therefore, possible that \nobsessions may serve as a distraction from the different tasks both groups were asked to \nperform.  \n Given the difficulty in identifying gross memory deficits, it has been suggested \nthat the deficit is one of reality monitoring (Sher et al., 1983); that is, the recall of \nReality-monitoring 5\nwhether an action has actually been performed or only imagined. Ecker and Engelkamp \n(1995) examined reality-monitoring in OC checkers, low-checking clinical, and high-\nchecking clinical groups. They gave participants four different tasks: 1) mime an action \n(motor encoding), 2) imagine themselves performing an action, 3) imagine seeing \nsomeone else perform an action (motor-imaginal encoding), and 4) subvocal rehearsal (as \na control condition). They found that OCD patients scored lower than low-checking \ncontrols on free-recall tests of motor-encoding and also made more mistakes of reality-\nmonitoring. In addition, the motor imaginal and motor confusion (mistakes of reality-\nmonitoring) scores were significantly correlated with their scores on the checking \nsubscale of the MOCI (Hodgson & Rachman, 1978). OC participants obtained similar \noverall scores to high-checking clinical controls; however, they were found to make \ndifferent types of errors. OC checkers were more likely to make type A errors \n(incorrectly remembering that they imagined an action they actually performed), and \nhigh-checking controls made more type B errors (recalling the performance of an action \nthey actually imagined) than low-checking controls. In this study, memory tasks were \ncarried out in a laboratory and not in the environment in which OC checkers experience \ntheir specific memory problems. The actions did not involve anxiety-provoking \nsituations, nor were they personally relevant to the participants.  \n Some attempts have been made to test memory for actions in conditions that are \nanxiety-provoking for OC checkers. Anxiety experienced by the OC checker may \ninterfere with the process of memory retrieval; the perception of poor retrieval could in \nturn motivate checking behaviours. Constans, Foa, Franklin, and Mathews (1995) tested \nreality-monitoring ability among OC checkers and non-clinical controls through the use \nReality-monitoring 6\nof neutral actions (e.g., capping and uncapping a pen) and anxiety-provoking actions \n(e.g., turning on and off a lamp). They found no difference in reality-monitoring ability \nbetween OC checkers and non-clinical controls. However, OC checkers were more likely \nto desire a greater vividness in recollection than controls. In fact, their memory for how \nanxiety-provoking items were left was significantly better than controls. \n More recently, Hermans and colleagues (2003) built on the work of Constans et \nal. (1995) through the use of ideographically-selected stimuli. OC checkers and yoked \nnon-anxious controls were asked to perform or imagine a series of actions: three relevant \ncompulsive actions, six irrelevant compulsive actions, and six neutral actions. No \ndifferences were found between groups for reality-monitoring ability. In addition, \nmemory accuracy did not vary by category of action. OC checkers also reported lower \nconfidence in memory than controls, but only for neutral actions.  \n Threat and responsibility appraisals influence the occurrence of checking \nbehaviour (Ladouceur, Rhéaume, & Aublet, 1997). Given the importance of \nresponsibility for harm in cognitive models of compulsive checking (Rachman, 2002; \nSalkovskis 1999) and the specificity of OC checkers memory problems, what is needed is \nan evaluation of memory for actions in an  environment for which compulsive checkers \nfeel personally responsible, focussing on stimuli normally checked by these individuals.  \nRadomsky, Rachman, & Hammond (2001) evaluated memory in the homes of OC \ncheckers. Participants were asked to check an item that normally causes distress or \ndiscomfort (e.g., the stove). In addition, responsibility was manipulated by having \nparticipants (high responsibility) or the experimenter (low responsibility) carry out \ndifferent checks. Participants were also told that they would be tested afterwards on their \nReality-monitoring 7\nmemory for the check and for other things that may have happened during the check (i.e., \nthreat irrelevant information). The experimenter provided threat irrelevant information by \ncoughing, clipping a coloured pin to his shirt, or reading aloud different 4-digit lists \nduring each check. Participants were more likely to remember threat-relevant information \n(e.g., how many times they touched the stove) than threat-irrelevant information (e.g., the \ncolour of the experimenter’s pen), and this memory bias was augmented under conditions \nof high responsibility. The absence of an anxious control group in this study, however, \nmeans that it was not possible to evaluate whether or not memory biases were specific to \ncompulsive checkers.  \nThe aim of the present study was to test reality-monitoring ability, memory for \nactions, and confidence in memory among OC checkers and Non-Clinical Controls \n(NCCs) in the course of home visits using stimuli that are and are not bothersome to \nthem. We predicted that OC checkers would not have memory deficits relative to controls \nbut that they would express less confidence in their memory than controls, especially \nconcerning items which are particularly bothersome to them. In addition, given that two \ndifferent experiments have recently linked increased responsibility with decreased \nconfidence in memory among OCs (Boschen & Vulksanovic, in press; Moritz et al., in \npress), we predicted that an experimental manipulation of responsibility for harm would \nresult in lower confidence in memory for individuals in the “high responsibility” \ncondition compared to participants in the “low responsibility” condition and that these \neffects would be present for OC checkers but not NCCs.  \n \n \nReality-monitoring 8\n2. Method \n2.1. Participants \nThe experiment was completed by patients who met DSM-IV (SCID) criteria for OCD \n(n=21) and whose primary compulsion was checking. NCCs (n=24) from Oxford, \nEngland, and the surrounding area. Controls were recruited by word of mouth and from \namong staff at the Warneford Hospital in Oxford. Patients were recruited from therapists \nassociated with the Oxford University Psychiatry department. Some also responded to \nadvertisements in self-help newsletters. A payment of seven pounds was given to all \nparticipants upon completion of the experiment.  \nParticipant demographic and psychometric information is given in Table 1. Group \ndifferences were examined using chi-square (for gender) and ANOVA tests.  \n2.2. Design \nIn-home visits were scheduled with the experimenter (JC). Upon arrival, participants \nwere asked to either perform or imagine performing actions which the participant thought \nwere bothersome and non-bothersome. After completing these tasks, participants were \ngiven a two-minute filler task and were then asked to recall the actions they had \npreviously performed and imagined performing. In addition, they rated their confidence \nin each recollection. Following the free recall task, participants were given a list of the \nactions used and were asked to determine whether they actually performed it or only \nimagined performing each. Again, they provided ratings of their confidence in their \nmemory for each recollection. Anxiety, depression, discomfort, and urge to check ratings \nwere taken throughout these tasks using Visual Analogue Scales.  \nReality-monitoring 9\nParticipants were then asked to refrain from checking and were randomised to one \nof the two experimental groups using sampling without replacement. In one condition, \nparticipants were told that they were responsible for anything bad that may happen as a \nresult of their not checking and in the other that the experimenter was responsible for \nthese things. A contract was given to confirm the agreement. The researcher then left the \nparticipant’s house and, after an hour, phoned them for a post-experiment interview \nlasting approximately 15 min. Memory was again assessed for imagined and performed \nactions (free recall, prompted recall, and confidence in memory). In addition, several \nratings which dealt with how they had been feeling since the experimenter left were \nmade.   \n2.3. Measures \nVisual analogue scales assessing anxiety, discomfort, urge to check, and \ndepression were used at various points during the experiment. These measures were rated \nfrom 0 (e.g., ‘Not at all anxious’) – 100 (e.g., ‘Extremely anxious’). \n Participants completed measures of depression (BDI; Beck, Ward, Mendelson, \nMock & Erbaugh, 1961), anxiety (BAI; Beck, Epstein, Brown, & Steer, 1988), OC \nsymptoms (OCI; Foa, Kozak, Salkovskis, Coles, & Amir, 1998), and responsibility \nbeliefs (RAS) and appraisals (RIQ; Salkovskis et al., 2000).  \n2.4. Procedure \nParticipants completed the questionnaires in their own time before a home visit was \narranged with the researcher. Upon arrival at the participants’ home, the researcher \nexplained to them the Visual Analogue (VA) scales that would be used. Participants were \nthen shown a list of 11 common activities which can elicit checking obsessions and were \nReality-monitoring 10\nasked to rate how bothersome each checking-related action was for them. The list is \nprovided in Table 2. The two most bothersome and two least bothersome categories were \nidentified for use in the subsequent reality-monitoring tasks. Memory tasks were then \nexplained to participants: “Now, I’m going to ask you in a minute to perform a task or \nimagine yourself performing a task. By imagining, I mean to picture yourself in your \nmind performing the action that I may give you. Is that clear? For example, I can either \ndraw a ‘two’ like this (draw two) or imagine myself drawing a ‘two’.” Further discussion \nwas continued until it was clear that the participant fully understood the task procedure. \nThey were taken through six different tasks associated with each of the chosen \ncategories (24 in all), alternating between actual and imagined actions and troublesome \nand non-troublesome categories. The list of actions was standardized, but if an item was \nnot available in the home (e.g., if one did not have a stereo to unplug), a suitable \nalternative which was related to the category would be found (they may have been asked \nto unplug a coffee-maker). They were asked to report how they were feeling by using the \nVA scales after completing each category of actions. After they had completed the tasks, \nthey were asked to complete anxiety (BAI) and depression (BDI) inventories during a \ntwo min distraction time interval. They were then asked to recall all of the actions they \ndid or imagined themselves doing in any order. A confidence in memory rating (0 = not \nat all confident, 100 = extremely confident) was obtained for each recalled item. VA \nscale readings were taken again.  \nThe researcher then prompted participants with each item alternating randomly \nbetween categories. Participants reported whether they performed or imagined each \nReality-monitoring 11\naction and their confidence in their recollections. VA scale readings were obtained, and \nparticipants were asked to finish the BDI and BAI if they were not completed by now. \nThe next stage of the experiment involved a responsibility manipulation. ‘High’ \nor ‘low’ responsibility contracts based on those used in the Lopatka and Rachman (1995) \nstudy were presented to participants after they completed the in-home memory tasks. The \n‘low responsibility’ contract indicated that the experimenter would be responsible for any \nharm that would come as a result of not checking the relevant memory items during a one \nhour period. The ‘high responsibility’ contract stated that, during this one hour period, the \nparticipant would be responsible for any harm associated with the memory task items. \nParticipants were placed in two different conditions through the use of either of the \nfollowing instructions: \na) “I know that I’ve asked you to perform tasks that may be very \ndistressing to you, but I want you to refrain from checking for the next hour. I will \ncall you in an hour’s time, but until then, I’d like you to please refrain from \nchecking. During this hour, I want you to know that I’ll be completely responsible \nfor any harm that may come as a result of your not checking. I will be responsible \nonly for this hour and only concerning the items we have dealt with. Just to make \nsure that you understand this agreement, I’ve made a contract. I’d like to go over \nthe main points with you (went over main points on low-responsibility contract).” \nb) “I know that I’ve asked you to perform tasks that may be very \ndistressing to you, but I want you to refrain from checking for the next hour. I will \ncall you in an hour’s time, but until then, I’d like you to please refrain from \nchecking. I want you to know that I will not be responsible for any harm that may \nReality-monitoring 12\ncome as a result of your not checking during this hour. You will be completely \nresponsible for anything bad that happens with these items. Just to make sure that \nyou understand this agreement, I’ve made a contract. I’d like to go over the main \npoints with you (went over main points on high-responsibility contract).” \nAfter the participant had read the contract, two copies were signed by the \nresearcher and the participant. One copy was left with the participant. VA scale readings \nwere taken again. An envelope with an enclosed scale was given to the participant and \nhe\/she was instructed not to open it. They were told that they would be phoned in an \nhour’s time. They were reminded not to check during the following hour. In addition, \nthey were told to take a ten minute walk. \n After an hour passed, the researcher phoned participants for a post-experiment \ninterview. Current anxiety, discomfort, urge to check, and depression ratings were taken. \nTests of free recall were repeated. Participants were prompted with any items omitted \nfrom the free recall list, and were asked whether they imagined or performed the action. \nConfidence in memory ratings were taken for each action reported. Participants were \nasked to rate how much they checked any of the experiment items during the one hour \nperiod: 0 (not at all), 1 (a very small amount, or less than a minute), 2 (a moderate \namount, more than once but less than ten times, or more than one minute but less than \nfive minutes), 3 (frequently, or between 10 and 20 times, or 10 and 20 minutes), or 4 \n(very frequently, over 20 times or 20 minutes).  \nParticipants were then asked to open the envelope and examine the rating scales \nincluded. They were asked several questions and rated their response using each scale. \nFirst, they were asked to rate how much of the past hour they had been directly thinking \nReality-monitoring 13\nabout the actions the experimenter had asked them to perform or imagine performing \n(had been actively ruminating about them in the front of their minds). They were then \nasked to rate how much of the hour, in addition to the time directly thinking about those \nactions, they were still there at the back of their minds (meaning that they have been \nactively thinking about something else while still having an awareness of those actions). \nParticipants were also asked how hard they tried to ‘deliberately go over in your mind \nwhat you had done or how you had left things’. Next, they were asked to rate their \ncurrent discomfort associated with the actions and their highest level of discomfort during \nthe past hour. They were then asked to rate how likely it seemed at present that \nsomething bad would happen in connection with the actions they performed; they also \nrated the highest level of likelihood they felt during the past hour. In addition, \nresponsibility for harm ratings were completed which related to the level they currently \nfelt and the highest level they felt during the past hour. After completing these general \nratings, participants were asked to give five ratings for each category of actions they \ncompleted. They indicated how confident they were that there was no problem with the \nway items were left, their anxiety associated with the item, their discomfort about the \nitem, their present urge to check the item, and their greatest urge to check the item during \nthe past hour. Final anxiety, discomfort, urge to check, and depression ratings were then \nobtained. \n3. Statistical Analyses \nUnless otherwise stated, 2 (OC vs NCC) X 2 (Immediate vs Delayed) X 2 (Bothersome \nvs Non-Bothersome) repeated measures ANCOVAs were used throughout. Because \neducation level was positively correlated with greater memory accuracy, r = .39, p <.01, \nReality-monitoring 14\nand was also significantly higher among NCCs, it was used as a covariate in each \nanalysis. Where interactions were significant, simple main effects analyses were carried \nout using one-way ANCOVAs.  \n4. Results \nIn the first section below, participants’ reactions to engaging in the experimental tasks are \nanalyzed in order to indicate the way in which the memory task was perceived; this \nsection also describes an analysis of the experimental manipulation check. The key \nmemory variables are presented next as the principal test of the hypothesis. Thirdly, \ncorrelations are considered.  \n4.1. Reaction to Experimental Tasks \n4.1.1. Visual Analogue Scales \nVisual analogue scales which were presented to participants before and after each \ncategory of actions to be imagined or performed, after the responsibility contracts were \nsigned, and before and after the phone interview. These ratings indicate the participants’ \nresponse to participation in the study. Repeated measures ANCOVAs were used to \nexamine group and time of assessment differences. Scores for anxiety did not \nsignificantly vary across the time points of the experiment, F(10,410)=1.58, p=.11, at \nwhich it was measured, but a main effect was found for group, F(1,41)=102.27, p<.0001, \nwith OC checkers reporting significantly greater anxiety than NCCs (OC: M=47.35, \nSE=2.7; NCC: M=8.31, SE=2.6). No group X time interaction was found (F<1). Similar \nresults were found for measures of discomfort, where scores did not significantly vary \nacross time, F(10,410)=1.31, p=.23, and OCs reported greater discomfort than NCCs, \nF(1,41)=97.07, p<.0001; OC: M=46.72, SE=2.9; NCC: M=6.02, SE=2.8. No group X \nReality-monitoring 15\ntime interaction was found (F<2). A main effect for group was also found for urge to \ncheck, F(1,42)=43.53, p<.0001, and this was qualified by a significant group X time \ninteraction, F(10,420)=3.62, p<.05. Follow-up tests revealed that differences in urge to \ncheck ratings were not present at baseline, F(1,42)=2.85, p=.099; OC: M=28.86, SE=5.9; \nNCC: M=14.75, SE=5.5. However, during VAS assessment points 2 to 11, urge to check \nratings were significantly higher among OCs than NCCs (F>10, p<.002, OC: M=40.59, \nSE=3.5; NCC: M=6.18, SE=3.3). A main effect of group was found for depression \nratings, F(1,42)=33.16, p<.0001, but not time, F(10,420)=1.04, p>.40. A group X time \ninteraction was also found, F(10,420)=2.40, p<.01. Follow-up tests revealed greater \ndepression ratings among OCs than NCCs for each time point (F>18, p<.0001; OC: \nM=27.09, SE=3.1; NCC: M=1.64, SE=2.9). Among OCs, depression ratings differed \nsignificantly over time, F(10,200)=2.00, p<.05. Pairwise comparisons indicate that \ndepression was significantly higher at time points 7, 9, and 10 than at time point 2, p<.05. \nDepression was also significantly higher at time point 9 than at point 5, p<.05. These \nfindings suggest that depression was higher during the later stages of the experiment than \nat baseline. Overall, these results suggest that OCs were significantly more distressed \nwhile carrying out the memory tasks than NCCs, and that the task provoked the urge to \ncheck in OC patients but not controls. \n4.1.2. Manipulation Check  \nThe responsibility contract did not result in any significant effects for either group during \nthe follow-up period. Perceived levels of responsibility, urge to check, and mood ratings \nduring the delay period did not differ significantly between participants in the high- and \nlow-responsibility conditions (F<1), nor were any group X contract interactions found \nReality-monitoring 16\nfor these variables (F<1). OC checkers reported greater levels of responsibility (low \ncontract: M=47.63, SE=8.2; high contract: M=53.87, SE=9.1) during the delay period \nthan NCCs (low contract: M=19.15, SE=8.2; high contract: M=10.52, SE=8.0), \nF(1,42)=17.15, p<.0002. There was a marginally significant group X contract interaction \nfor the amount of glancing and checking behaviour during the delay period, \nF(1,41)=2.88, p=.097. However, follow-up tests revealed no significant differences \nbetween high and low responsibility contracts for either NCCs or OC checkers, p>.10.   \n4.2. Memory effects \n4.2.1. Free recall accuracy \nGroup means and standard deviations for memory accuracy (maximum score = 12) and \nconfidence in memory ratings are given in Table 3. Free recall accuracy was examined \naccording to whether participants correctly recalled what actions they performed or \nimagined themselves performing without being prompted. The crucial main effects of \ngroup were not significant (F<1), nor were there any significant interactions involving \ngroup and time of test or item type (F<2). In addition, no main effects of group, item \ntype, or time of memory test were found (F<1). These results suggest comparable \nmemory for actions in terms of reality-monitoring between OC checkers and NCCs in \ntests of free recall. No effect of responsibility contract on memory accuracy was found \nfor either group, p>.10. \n4.2.2. Analysis of Free Recall Errors \nFree recall errors were calculated for both groups through an analysis of instances where \nparticipants did not recall an action which was performed or imagined (no recollection \nerrors) or errors where confusion was made between an actual or imagined action \nReality-monitoring 17\n(reality-monitoring errors). A 2 (OC vs NCC) X 2 (Bothersome vs Non-bothersome) X 2 \n(Immediate vs Delayed) X 2 (Imagined actions vs Performed actions) repeated measures \nANCOVA was carried out to examine ‘no recollection’ errors. No significant differences \nwere found between groups for no-recollection errors (F<1; OC: M=2.64, SE=.2; NCC: \nM=2.39, SE=.2), but both groups were more likely to forget actions which they had \nimagined relative to actions they performed, F(1,42)=9.92, p<.005. A 2 (OC vs NCC) X \n2 (Bothersome vs Non-bothersome) X 2 (Immediate vs Delayed) X 2 (Imagined actions \nrecalled as performed vs Performed actions recalled as imagined) repeated measures \nANCOVA was carried out to examine ‘reality monitoring’ errors. Groups did not \nsignificantly differ in errors of reality monitoring, F(1,42)=2.34, p=.13 (OC: M=.19, \nSE=.05; NCC: M=.31, SE=.05). No main effects or interactions for free recall reality-\nmonitoring errors were found (F<4).  \nFree recall errors which involved actions which were neither performed nor \nimagined were analyzed using a 2 (OC vs NCC) X 2 (Bothersome vs Non-bothersome) X \n2 (Immediate vs Delayed) X 2 (Actions recalled as imagined vs Actions recalled as \nperformed). No significant differences were found between groups, F(1,42)=.26, p>.60 \n(OC: M=2.83, SE=.2; NCC: M=2.69, SE=.2). A main effect of error type (performed vs \nimagined) was found, F(1,42)=12.37, p<.002, which was qualified by a significant item \ntype X time X error type X group interaction, F(1,42)=4.53, p<.05. Follow-up tests \nrevealed a marginally significant item type X error type X group interaction for the \nimmediate recall period, F(1,42)=3.79, p=.058, though this interaction was absent for the \ndelayed free recall test (F<1). Further analyses of immediate tests revealed a significant \ngroup X item type interaction for items recalled as imagined, F(1,42)=4.39, p<.05, \nReality-monitoring 18\nthough this interaction was not present for items recalled as performed (F<1). Additional \nanalyses found a trend for OCs reporting a greater number of imagined recollection errors \nfor non-bothersome items than NCCs, F(1,42)=3.10, p=.086 (OC: M=3.69, SE=.3; NCC: \nM=2.90, SE=.3), though no group differences were found for bothersome items (F<1).   \n4.2.3. Prompted recall accuracy \nPrompted recall was taken after reality-monitoring tasks were completed and during the \nphone interview by providing participants with a list of actions they performed or only \nimagined performing. Participants were asked to state whether they performed or \nimagined performing each action. No differences between groups emerged, F(1,42)=1.32, \np>.20, but a significant main effect for item type was found, F(1,42)=6.91, p<.05. This \nreflects the fact that participants recalled non-bothersome items (M=10.70, SE=.2) with \ngreater accuracy than bothersome items (M=10.09, SE=.2). No effect of responsibility \ncontract on memory accuracy was found for either group, p>.10. \nPrompted recall errors came in two forms: stating that one performed an action \nhe\/she actually imagined or stating one imagined an action that he\/she actually \nperformed. No significant interactions or differences between groups were found for \nthese errors (F<1). \n4.2.4. Confidence in memory \n Reports of confidence in memory for free recall showed significant differences \nbetween groups, F(1,31)=4.56, p<.05, with OC checkers reporting significantly lower \nconfidence in recollections. This main effect was qualified by a significant time X item \ntype X group interaction, F(1,31)=7.23, p<.05. Follow-up tests revealed a trend for a time \nX group interaction among bothersome items (F(1,34)=3.00, p=.09) that was not present \nReality-monitoring 19\nfor non-bothersome items, F(1,36)=2.17, p=.15. Additional analyses revealed that, \ncompared to OC checkers, NCCs reported significantly greater confidence for \nbothersome items in the immediate testing period, F(1,37)=6.85, p<.05, though groups \ndid not differ significantly for bothersome items in the delayed test, F(1,35)=2.85, p=.10. \nNo effect of responsibility contract on memory confidence was found for either group, \np>.10. \n Confidence in memory for prompted recall items was analysed, and a main effect \nfor group was found, F(1,42)=15.33, p<.001, with OCs reporting significantly less \nconfidence in memory than NCCs. No significant differences were found across time of \ntest, nor were any interactions found. There was a trend for participants to report greater \nconfidence in memory for non-bothersome items (M=85.75, SE=1.8) than bothersome \nitems (M=81.50, SE=1.8; F(1,42)=3.17, p=.08). In addition, no effect of responsibility \ncontract on memory confidence was found for either group, p>.10. \n4.3. Analysis of situational variables and correlational analyses \n4.3.1. Post-experiment interview ratings \nState measures which were taken by the phone interview were analysed. Self-\nreport ratings for anxiety, discomfort, urge to check and depression were significantly \nhigher in OCs than controls, F>15, p<.0005. These were taken at the beginning and at the \nend of the interview. Significant differences between groups were found for \nchecking\/glancing during the past hour, F(1,42)=5.91, p<.05, whether or not they sought \nreassurance, F(1,42)=11.00, p<.005, rumination about items during the past hour (front of \nmind: F(1,42)=11.90, p<.005; back of mind: F(1,42)=14.96, p<.001), present discomfort \nabout items, F(1,42)=35.40, p<.0001, discomfort about items during the past hour, \nReality-monitoring 20\nF(1,42)=37.64, p<.0001, present perception of likelihood of harm, F(1,42)=28.37, \np<.001, peak likelihood of harm during the past hour, F(1,42)=31.13, p<.0001, and \npresent responsibility for harm, F(1,42)=35.50, p<.0001. These differences reflect the \nfact that OC checkers rated themselves significantly higher on these measures than \ncontrols.  \nPost-experiment interview measurements were then analyzed which concerned \neach of the four specific categories of actions participants chose. These item categories \nwere previously ranked by participants as the first and second most bothersome and the \nfirst and second least bothersome. A 2 (OCD vs Controls) X 2 (Bothersome vs Non-\nBothersome) X 2 (First vs Second) repeated measures ANCOVA was carried out which \nfound no main effects between bothersome and non-bothersome categories (F<1) or first- \nand second-rated categories (F<1) on the measure of confidence that there is no problem \nwith the way an item was left. A significant main effect was found between groups, \nF(1,42)=32.62, p<.0001. Also, a significant group X item type interaction was found, \nF(1,42)=6.00, p<.05. This interaction was due to OCs reporting less confidence for \nbothersome items (M=61.43, SE=5.0) than non-bothersome items (M=75.48, SE=4.2; \nF(1,20)=8.88, p<.01), though this difference was absent in NCCs (F<2). Significant main \neffects for groups were found in which OC checkers scored higher than NCCs in \nmeasures of anxiety, (F(1,42)=64.54, p<.0001), discomfort (F(1,42)=58.65, p<.0001), \nurge to check at present (F(1,42)=26.42, p<.0001), and the peak urge to check in the past \nhour (F(1,42)=61.60, p<.0001) associated with the test items. Again, significant \ninteractions were found between item type and group for anxiety (F(1,42)=14.77, \np<.001), discomfort (F(1,42)=15.78, p<.001), urge to check at present (F(1,42)=21.88, \nReality-monitoring 21\np<.0001), and peak urge to check during the past hour (F(1,42)=11.03, p<.005). These \ninteractions indicate that OC checkers scored higher on these measures for bothersome \nitems than for non-bothersome items (F>9). NCCs reported greater peak urge to check \nfor bothersome items than non-bothersome items, F(1,23)=9.13, p<.01, though this \ndistinction was not present with any other post-experiment measure.  \n4.3.2. Responsibility beliefs and memory performance \n To test whether perceived responsibility for harm during the delay period and at \nthe time of the second memory test may have led to recollection errors after the delay \nperiod, partial correlation analyses were carried out which controlled for memory \nperformance on the immediate (in-home) memory tests. Analyses found no significant \nrelationship between responsibility levels and delayed memory performance for \nbothersome items. However, among non-bothersome items tested for prompted recall, a \nsignificant negative correlation was found between accuracy and levels of responsibility \nreported at the delayed memory test, r(42)=-.42, p<.005, and during the delay period,  \nr(42)=-.37, p<.05. This suggests that participants reporting greater levels of responsibility \nwere more likely to make errors of prompted recall for non-bothersome items.  \nPartial correlation analyses were also carried out on confidence in memory \nreports, while controlling for confidence in memory expressed on immediate memory \ntests. Confidence in memory reported for the delayed tests was not correlated with \nresponsibility levels for bothersome items. However, among non-bothersome items, \nlevels of responsibility reported at the delayed memory test, r(36)=-.35, p<.05, and peak \nlevels of responsibility during the delay period, r(36)=-.35, p<.05, were negatively \ncorrelated with confidence in memory on the delayed test of free recall. These findings \nReality-monitoring 22\nsuggest that participants reporting greater levels of responsibility were more likely to \nreport poorer confidence in memory for free recall recollections of non-bothersome items \nat the delayed memory test.  \n4.3.3. Correlational Analyses \nOC participants’ ratings for confidence in memory correlated significantly with \naccuracy in delayed prompted tests for bothersome, r=.63, p<.005, and non-bothersome \nitems, r=.64, p<.005. No significant correlations were found on these measures with \nNCCs (bothersome, r=-.20; non-bothersome, r=.16). These results suggest that OC \ncheckers, but not NCCs, tend to report higher confidence when they recall accurately and \nlower confidence when their recollections are inaccurate.  \nCorrelational analyses were also carried out using both OCs and control \nparticipants’ ratings of responsibility for harm felt during the delay period. Responsibility \nwas found to correlate well with how much a participant glanced during the delay period, \nr(45)=.47, p<.005, whether or not they sought reassurance, r(45)=.42, p<.005, and how \nmuch they had been thinking about the relevant items in the front, r(45)=.55, p<.001, and \nthe back, r(45)=.77, p<.001, of their minds. Responsibility for harm also correlated well \nwith how much participants had deliberately gone over in their minds what they had done \nor how they had left things, r(45)=.56, p<.001, how uncomfortable they felt at present, \nr(45)=.49, p<.005, and peak discomfort they felt during the past hour, r(45)=.54, p<.001, \nabout the things they did and the way they were left. In addition, correlations were found \nbetween responsibility and reports of how likely it seemed that something bad would \nhappen in connection with the things they did (right now: r(45)=.52, p<.001; past hr.: \nr(45)=.59, p<.001).  \nReality-monitoring 23\n5. Discussion \nThis study found no evidence for actual memory deficits in terms of reality-monitoring or \nmemory for actions obsessive-compulsive checkers. The memory of OC checkers was at \nleast as accurate as controls on both immediate and delayed tests of free and prompted \nrecall. As predicted, confidence in memory was weaker in OCs than controls for both free \nrecall and prompted recall tests, although for free recall tests, OCs showed poorer \nconfidence in memory only for bothersome (i.e. OCD relevant) actions on the immediate \nmemory test. Also, both OCs and controls remembered non-bothersome actions better \nthan bothersome actions on tests of prompted recall. These findings are broadly \nconsistent with those previous studies finding no reality-monitoring deficit in obsessive-\ncompulsive checkers (Constans et al., 1995; McNally & Kohlbeck 1993). This research is \nalso consistent with previous work demonstrating that OCs report less confidence in their \nmemory than non-clinical controls (MacDonald, Antony, Macleod, & Richter, 1997; \nMcNally & Kohlbeck, 1993).  \nThe post-experiment interview revealed a number of differences between OCs \nand controls in terms of their reaction to the memory task. OCs reported that they were \nless confident “that there was no problem with the way an item was left”. OCs also \nreported less confidence for bothersome items than non-bothersome items, a difference \nabsent in controls. In addition, controls scored lower on self-reported measures of \nanxiety, discomfort, urge to check at present and maximum urge to check in the past hour \non tests relating to specific action sequences. With the exception of measures of peak \nurge to check, OCs, but not controls, scored higher on these measures if they were \nassociated with bothersome items, rather than non-bothersome items. These results come \nReality-monitoring 24\nas no surprise given the specificity of checking problems in OCs, and they complement \nother findings in this study showing better recall for non-bothersome items than \nbothersome ones.  \nAlthough the experimental responsibility manipulation (contract) failed to impact \nthe group responsibility levels, correlational analyses revealed that individual differences \nin self-reported feelings of responsibility were associated with memory accuracy and \nconfidence, as well as other measures. Measures of perceived responsibility correlated \nwith how much a participant ruminated about the significant items, how much the \nparticipants had gone over in their mind what they had done or how they had left things, \nand discomfort felt during the delay period. In addition, after controlling for memory \nperformance on the immediate memory test, higher levels of responsibility during the \none-hour delay period were associated with poorer prompted recall memory for non-\nbothersome items following the delay period. Higher responsibility ratings were also \nassociated with poorer confidence in memory for non-bothersome items on the delay free \nrecall test. These findings may be due to associations between responsibility and \nincreased attentiveness to bothersome items during the delay period, rather than a direct \nassociation between responsibility and poor performance with non-bothersome items.  \nThe perceived likelihood that something bad could happen in connection with the \nthings one did was also correlated with responsibility ratings. This is consistent with \nLopatka and Rachman’s (1995) study which showed how an inflated sense of \nresponsibility for an unwanted event is associated with a higher estimate of the likelihood \nthat the unwanted event could occur.   \nReality-monitoring 25\nIt was not clear why the responsibility manipulation in the present study failed. \nWe suspect that the responsibility contracts lacked sufficient credibility. Recent research \nhas used other responsibility manipulations that were highly effective (Arntz, Voncken, \n& Goosen, 2007; Mancini & Gangemi, 2006), and this research found the expected \nrelationships between responsibility and OC symptoms. The fact that this experiment \ntook place in the homes of participants limited the choice of responsibility manipulations \navailable, as other studied manipulations have been laboratory-based.  \nA curious finding among OCs, but absent in controls, was the correlation between \ndelayed tests of prompted recall accuracy and ratings of confidence in memory. That is, \nOCs were more accurate in their judgement about how well they can rely on their \nmemory for actions. This phenomenon may be due to excessive attention that OCs give \nto mental processes (Salkovskis, 1985). Comparable patterns of attention have been \ndetected in panic disorder patients who make fewer errors in terms of bodily sensations \n(heart rates) (Ehlers & Breuer, 1992). These data are consistent with cognitive theories \nwhich focus on over-attentiveness as a contributing factor to anxiety disorders (eg, Beck, \nEmery, & Greenberg, 1985). It might be deduced from the findings of the present \nexperiment that it is not memory difficulties per se that are the source of the problem. \nRather, it may be beliefs about and over-attentiveness to memory processes that \ncontribute to compulsive checking.  \nThe results do not support the hypothesis that checkers have an actual deficit in \nmemory which motivates them to check. Rather, they are most consistent with the \ncognitive-behavioural view that people suffering from OCD check because they \nexperience levels of confidence in memory that do not meet the high standards they set \nReality-monitoring 26\nfor themselves; that is, they try to be particularly sure because they have unusually high \nlevels of concern about making an error. \nLimitations to the study include the use of semi-ideographic methodology. \nActions chosen for the memory task were chosen from a restricted list, resulting in some \nvariability in items used, and it is possible that some actions may have been easier to \nrecall than others. However, there was no evidence of systematic differences between \ngroups in terms of items chosen. The fact that the experimenter was not blind to \nparticipant diagnostic status is a further issue; the careful scripting of the study should \nhave prevented this potential bias from affecting the results. The study also lacked a \nclinical control group; the fact that memory was unimpaired in OCs means that this is not \na major issue. Though research suggests poor memory confidence is specific to OC \ncheckers (Cougle, Salkovskis, & Wahl, 2007), it is not known whether poor memory \nconfidence would also be present among anxious controls and non-checking OCs when \nusing in-home reality monitoring tasks. \nThe advantage of the present study’s methodology is that it ensured that the \nmemory tasks were meaningful to OC checkers in the environment where checking \nbehaviour occurs. The inclusion of a delayed test gave an opportunity to examine how \ndifferent thought patterns and memory processes could relate to responsibility and \nchecking behaviours. Past work on OCD and memory was limited by the use of tasks \nwhich were far removed from the daily concerns of OCs (Bouvard & Cottraux, 1997; \nPurcell et al., 1998) or memory for actions tasks which did not take into consideration the \nspecificity involved in checking problems and such phenomena as feelings of \nresponsibility which may play an important role in maintaining OCD (Constans et al., \nReality-monitoring 27\n1995; Ecker & Engelkamp, 1995; Hermans et al., 2003; McNally & Kohlbeck, 1993). \nFuture research on memory and compulsive checking should take into consideration the \nimportance of context in OC memory failures. The findings of the present study suggest \nthat compulsive checking may be more effectively treated if beliefs about memory are \ntargeted as part of cognitive-behavioural therapy (Salkovskis, 1999).  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nReality-monitoring 28\nReferences \nAronowitz, B. R., Hollander, E., DeCaria, C., Cohen, L., et al. (1994). \nNeuropsychology of obsessive-compulsive disorder: Preliminary findings. \nNeuropsychiatry, Neuropsychology, and Behavioral Neurology, 7(2), 81-86.  \nArntz, A., Voncken, M., & Goosen, A. C. A. (2007). Responsibility and \nobsessive-compulsive disorder: An experimental test. Behaviour Research and Therapy, \n45, 425-435. \nBeck, A. T., Emery, G., & Greenberg, R. L. (1985). Anxiety disorders and \nphobias. New York: Basic Books.  \nBeck, A. T., Epstein, N., Brown, G., & Steer, R. A. (1988). An inventory for \nmeasuring clinical anxiety: Psychometric properties. Journal of Consulting and Clinical \nPsychology, 56(6), 893-897.  \nBeck, A. T., Ward, C. H., Mendelson, M., Mock, J., & Erbaugh, J. (1961). An \ninventory for measuring depression. Archives of General Psychiatry, 4, 561-571. \nBenton, A. L. (1974). The Revised Visual Retention Test (4th Edn.). New York: \nThe Psychological Corporation. \nBoone, K. B., Ananth, J., Philpott, L., Kaur, A., et al. (1991). Neuropsychological \ncharacteristics of nondepressed adults with obsessive-compulsive disorder. \nNeuropsychiatry, Neuropsychology, and Behavioral Neurology, 4(2), 96-109. \nBoschen, M.J. & Vuksanovic, D. (in press). Deteriorating memory confidence, \nresponsibility perceptions and repeated checking: Comparisons in OCD and control \nsamples. Behaviour Research and Therapy.  \nReality-monitoring 29\nBouvard, M. & Cottraux, J. (1997). Comparative study of normal subjects and \nobsessive compulsive subjects on intrusive thoughts and memory. Encephale, 23(3), 175-\n179. \nCohen, L. J., E. Hollander, et al. (1996). Specificity of neuropsychological \nimpairment in obsessive-compulsive disorder: a comparison with social phobic and \nnormal control subjects. Journal of Neuropsychiatry and Clinical Neuroscience 8(1), 82-\n85. \n Constans, J. I., Foa, E. B., Franklin, M. E., & Mathews, A. (1995). Memory for \nactual and imagined events in OC checkers. Behaviour Research and Therapy, 33(6), \n665-671. \n Cougle, J.R., Salkovskis, P.M., & Wahl, K. (2007). Perception of memory ability \nand confidence in recollections in obsessive-compulsive checking. Journal of Anxiety \nDisorders, 21, 118-130.  \n  Davis, R. N. & Nolen-Hoeksema (2000). Cognitive inflexibility among \nruminators and non-ruminators. Cognitive Therapy & Research, 24(6), 699-711. \nEcker, W., & Engelkamp, J. (1995). Memory for actions in obsessive-compulsive \ndisorder. Behavioural and Cognitive Psychotherapy, 23, 349-371. \nEhlers, A. & Breuer, P. (1992). Increased cardiac awareness in panic disorder. \nJournal of Abnormal Psychology, 101, 371-382. \nFoa, E. B., Kozak, M. J., Salkovskis, P. M., Coles, M. E., & Amir, N. (1988). The \nvalidation of a new obsessive-compulsive disorder scale: The Obsessive-Compulsive \nInventory. Psychological Assessment, 10, 206-214. \nReality-monitoring 30\n  Hermans, D., K. Martens, K., DeCort, K., Pieters, G., & Eelen, P. (2003). Reality-\nmonitoring and metacognitive beliefs related to cognitive confidence in obsessive-\ncompulsive disorder. Behaviour Research and Therapy, 41(4), 383-401. \n  Hodgson, R. J. & Rachman, S. J. (1978). Obsessive-compulsive complaints. \nBehaviour Research and Therapy, 15, 385-389.  \nHollander, E., E. Schiffman, E., Cohen, B., Rivera-Stein, M. A., et al. (1990). \nSigns of central nervous system dysfunction in obsessive-compulsive disorder. Archives \nof General Psychiatry, 47(1), 27-32. \n  Ladouceur, R., J. Rheaume, & Aublet, F. (1997). Excessive responsibility in \nobsessional concerns: a fine-grained experimental analysis. Behaviour Research and \nTherapy, 35(5), 423-427. \n  Lopatka, C. & S. Rachman (1995). Perceived responsibility and compulsive \nchecking: an experimental analysis. Behaviour Research and Therapy, 33(6), 673-684. \n  MacDonald, P. A., Antony, M. M., Macleod, C., & Richter, M. A. (1997). \nMemory and confidence in memory judgements among individuals with obsessive \ncompulsive disorder and non-clinical controls. Behaviour Research and Therapy, 35(6), \n497-505. \nMancini, F. & Gangemi, A. (2006). The role of responsibility and fear of guilt in \nhypothesis-testing. Journal of Behavior Therapy and Experimental Psychiatry, 37(4), \n333-346.  \nMcNally, R. J. & P. A. Kohlbeck (1993). Reality-monitoring in obsessive-\ncompulsive disorder. Behaviour Research and Therapy, 31(3), 249-253. \nReality-monitoring 31\nMoritz, S., Wahl, K., Zurowski, B., Jelinek, L., Fricke, S., & Hand, I. (in press). \nEnhanced perceived responsibility decreases metamemory but not memory accuracy in \nobsessive compulsive disorder (OCD). Behaviour Research and Therapy.  \nMueller, J. H. (1980). Anxiety and encoding processes in memory. Personality \nand Social Psychology Bulletin, 5(3), 288-294. \nPurcell, R., Maruff, P., Kyrios, M., & Pantellis, C. (1998). Neuropsychological \ndeficits in obsessive-compulsive disorder: a comparison with unipolar depression, panic \ndisorder, and normal controls. Archives of General Psychiatry, 55(5), 415-423. \n  Rachman, S. (2002). A cognitive theory of compulsive checking. Behaviour \nResearch and Therapy, 40(6), 625-639. \nRadomsky, A. S., Gilchrist, P. T., & Dussault, D. (2006). Repeated checking \nreally does cause memory distrust. Behaviour Research and Therapy, 44(2), 305-316. \nRadomsky, A. S., & Rachman, S. (1999). Memory bias in obsessive-compulsive \ndisorder (OCD). Behaviour Research and Therapy, 37(7), 605-618. \nRadomsky, A.S., Rachman, S., & Hammond, D. (2001). Memory bias, confidence \nand responsibility in compulsive checking. Behaviour Research & Therapy, 39(7), 813-\n822. \n  Salkovskis, P. M. (1985). Obsessional-compulsive problems, a cognitive-\nbehavioural analysis. Behaviour Research and Therapy, 23(5), 571-583. \n  Salkovskis, P. M. (1999). Understanding and treating obsessive-compulsive \ndisorder. Behaviour Research and Therapy, 37 Suppl 1, S29-52. \nReality-monitoring 32\nSalkovskis, P. M., & Kirk, J. (1997). Obsessive-compulsive disorder. In D. M. \nClark & C. G. Fairburn (Eds.), The science and practice of cognitive-behaviour therapy. \nOxford: Oxford University Press.  \nSalkovskis, P. M., Wroe, A. L., Gledhill, A., Morrison, N., Forrester, E., \nRichards, C., Reynolds, M., & Thorpe, S. (2000). Responsibility attitudes and \ninterpretations are characteristic of obsessive compulsive disorder. Behaviour Research \nand Therapy, 38(4), 347-372. \n Sher, K. J., Frost, R. O., & Otto, M. (1983). Cognitive deficits in compulsive \ncheckers, an exploratory study. Behaviour Research and Therapy, 21(4), 357-363. \n  Sher, K. J., Mann, B., & Frost, R. O. (1984). Cognitive dysfunction in compulsive \ncheckers, further explorations. Behaviour Research and Therapy, 22(5), 493-502. \n  Sher, K. J., Frost, R. O., Kushner, M., Crews, T. M., & Alexander, J. E. (1989). \nMemory deficits in compulsive checkers, replication and extension in a clinical sample. \nBehaviour Research and Therapy, 27(1), 65-69. \n  van den Hout, M. and M. Kindt (2003). Repeated checking causes memory \ndistrust. Behaviour Research and Therapy, 41(3), 301-316. \n Wechsler, D., & Stone, C. (1945). Manual for the Wechsler Memory Scale. New \nYork: The Psychological Corporation.  \nWoods, C.M., Vevea, J.L., Chambless, D.L., & Bayen, U.J. (2002). Are \ncompulsive checkers impaired in memory? A meta-analytic review. Clinical Psychology: \nScience & Practice, 9(4), 353-366. \n \n \nReality-monitoring 33\nAuthor Notes \n1Jesse R. Cougle, Department of Experimental Psychology, University of Oxford, \nOxford, UK. \n 2Paul M. Salkovskis, Professor of Clinical Psychology and Applied Science, \nDepartment of Psychology, Institute of Psychiatry, London, England. \n3Susan J. Thorpe, Department of Psychology, University of Surrey, Surrey, \nEngland. \n  \nThis study was conducted for partial completion of the first author’s MSc at the \nUniversity of Oxford, and was supervised by the second author. Portions of this research \nwere previously presented at the 2003 annual meeting of the Association for the \nAdvancement of Behavior Therapy, Boston, Massachusetts.  \nCorrespondence concerning the manuscript may be addressed to Jesse R. Cougle, \nDepartment of Psychology, University of Texas, 1 University Station A8000, Austin, TX \n78712-0187, Office: 512-471-3722. Email: cougle@mail.utexas.edu .  \n \n \n \n \n \n \n \n \nReality-monitoring 34\nTable 1.  \n \nDemographic and psychometric data.  \n         \n \n  \n \nOC checkers \n \nNon-clinical controls \n \nGroup comparisons \n \nGender \n \n8 male 13 female \n \n9 male 15 female \n \nX 2=.002, p>.5 \n mean SD Mean SD  \nBDI \n \n20.43 (8.6) 3.63 (3.9) F(1,43)=74.44, p<.0001 \nBAI \n \n20.29 (9.5) 5.21   (3.5) F(1,43)=51.93, p<.0001 \nOCI \n \n72.76 (28.4) 19.50   (13.0) F(1,43)=68.07, p<.0001 \nOCI - \nchecking \n20.71 (7.9) 3.42 (3.2) F(1,43)=96.44, p<.0001 \nRAS \n \n4.93 (0.6) 3.87 (0.8) F(1,43)=25.12, p<.0001 \nRIQ beliefs \n \n44.69 (22.1) 31.13 (18.8) F(1,39)=4.49, p<.05 \nRIQ freq. \n \n1.68 (0.9) 0.88 (0.7) F(1,40)=10.37, p<.005 \nAge \n \n37.29 (10.0) 41.79 (13.8) F(1,39)=2.88, p=.10 \nYears of \neducation \npast age 12 \n6.80 (2.4) 7.46 (2.6) F(1,43)=5.54, p<.05 \n         \n \n \n \n \n \n \n \nReality-monitoring 35\nTable 2.  \nCategories of actions used in reality-monitoring tests and number of participants \nlabelling each category among their two most bothersome or two least bothersome \ncompulsions.  \nActions Non-clinical Controls  OC checkers \n1. Door 13 Bothersome 13 Bothersome \n1 Non-bothersome \n2. Windows \n \n1 Bothersome \n3 Non-bothersome \n \n3. Lights 4 Non-bothersome 2 Bothersome \n5 Non-bothersome \n4. Plugs 1 Bothersome \n6 Non-bothersome \n7 Bothersome \n6 Non-bothersome \n5. Sharp objects 1 Bothersome \n12 Non-bothersome \n8 Non-bothersome \n6. Cooker\/Oven 13 Bothersome \n1 Non-bothersome \n7 Bothersome \n7. Poisons (bleach, \nmedicine, etc.) \n \n14 Non-bothersome 2 Bothersome \n5 Non-bothersome \n8. Ordering 1 Bothersome \n6 Non-bothersome \n1 Bothersome \n7 Non-bothersome \n9. Reading 4 Bothersome \n1 Non-bothersome \n3 Bothersome \n5 Non-Bothersome \n10. Water taps 2 Bothersome \n1 Non-bothersome \n1 Bothersome \n3 Non-bothersome \n11. Wallet\/purse, money, \nand keys \n12 Bothersome 6 Bothersome \n2 Non-bothersome \n \n \n \n \nReality-monitoring 36\nTable 3.  \nFree recall and prompted recall memory accuracy and confidence in memory. \n OC Checkers Non-clinical Controls \n \n \n \nAccuracy  \nMean (SD) \nConfidence in \nMemory \nMean (SD) \n \nAccuracy  \nMean (SD) \nConfidence in \nMemory \nMean (SD) \n \nImmediate \n \n \nFR-B \n \n \n5.57 (1.9) \n \n77.39 (18.7) \n \n5.54 (2.4) \n \n93.64 (8.0) \n FR – NB \n \n5.90 (2.4) 87.37 (14.4) 7.21 (2.8) 95.27 (5.3) \n PR – B \n \n10.14 (1.5) 72.82 (14.5) 9.83 (1.3) 89.27 (9.1) \n \n \nPR – NB 10.81 (1.1) 79.17 (16.0) 10.83 (1.3) 92.43 (6.7) \nDelayed \n \nFR – B \n \n5.81 (2.1) 82.80 (16.8) 6.42 (2.9) 94.26 (7.0) \n \n \nFR – NB 6.76 (2.8) 83.94 (16.8) 8.42 (2.6) 95.04 (6.4) \n \n \nPR – B 10.38 (1.4) 74.40 (15.7) 9.96 (1.9) 89.65 (9.3) \n PR – NB 10.33 (1.5) 77.78 (17.5) 10.79 (1.2) 93.47 (7.1) \nNote: FR = Free recall; PR = Prompted recall; B = Bothersome actions; NB = Non-bothersome \nactions. \n \n"}