{"doi":"10.1002\/anie.201002951","coreId":"103030","oai":"oai:epubs.surrey.ac.uk:2703","identifiers":["oai:epubs.surrey.ac.uk:2703","10.1002\/anie.201002951"],"title":"A role for microbial palladium nanoparticles in extracellular electron transfer.","authors":["Wu, X","Zhao, F","Rahunen, N","Varcoe, JR","Avignone-Rossa, C","Thumser, AE","Slade, RC"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-01-10","abstract":"Herein we have demonstrated a DET mechanism used by D. desulfuricans; where the periplasmic cytochromes and hydrogenases play an important role, and Pd nanoparticles bound to the microbes may participate in the electron transfer process. The present work is of importance not only for the fundamental studies of electron transfer processes in microbial physiology and ecology, but also for increased understanding and improvement of the performance of bioelectrochemical techniques e.g. precious metals are extensively used and important catalysts, and therefore present in many industry processing wastewaters. Bio-nanoparticles can oxidize in situ metabolites e.g. H2, formate and ethanol in the anode chambers, while also acting as cathodic catalysts for the oxygen reduction reaction[23]. In addition, this study indicates the feasibility of using bioelectrochemical systems for metal immobilization, recovery or detoxificatio","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2703<\/identifier><datestamp>\n      2017-10-31T14:06:15Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6368656D6963616C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2703\/<\/dc:relation><dc:title>\n        A role for microbial palladium nanoparticles in extracellular electron transfer.<\/dc:title><dc:creator>\n        Wu, X<\/dc:creator><dc:creator>\n        Zhao, F<\/dc:creator><dc:creator>\n        Rahunen, N<\/dc:creator><dc:creator>\n        Varcoe, JR<\/dc:creator><dc:creator>\n        Avignone-Rossa, C<\/dc:creator><dc:creator>\n        Thumser, AE<\/dc:creator><dc:creator>\n        Slade, RC<\/dc:creator><dc:description>\n        Herein we have demonstrated a DET mechanism used by D. desulfuricans; where the periplasmic cytochromes and hydrogenases play an important role, and Pd nanoparticles bound to the microbes may participate in the electron transfer process. The present work is of importance not only for the fundamental studies of electron transfer processes in microbial physiology and ecology, but also for increased understanding and improvement of the performance of bioelectrochemical techniques e.g. precious metals are extensively used and important catalysts, and therefore present in many industry processing wastewaters. Bio-nanoparticles can oxidize in situ metabolites e.g. H2, formate and ethanol in the anode chambers, while also acting as cathodic catalysts for the oxygen reduction reaction[23]. In addition, this study indicates the feasibility of using bioelectrochemical systems for metal immobilization, recovery or detoxification<\/dc:description><dc:date>\n        2011-01-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2703\/1\/Support_information.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2703\/2\/Angewandte_Chemie_2011.pdf<\/dc:identifier><dc:identifier>\n          Wu, X, Zhao, F, Rahunen, N, Varcoe, JR, Avignone-Rossa, C, Thumser, AE and Slade, RC  (2011) A role for microbial palladium nanoparticles in extracellular electron transfer.   Angew Chem Int Ed Engl, 50 (2).  pp. 427-430.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1002\/anie.201002951<\/dc:relation><dc:relation>\n        10.1002\/anie.201002951<\/dc:relation><dc:language>\n        eng<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2703\/","http:\/\/dx.doi.org\/10.1002\/anie.201002951","10.1002\/anie.201002951"],"year":2011,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" 1\nMicrobial direct electrochemistry \nThe definitive version is available at \nwww3.interscience.wiley. \nDOI: 10.1002\/anie.200123456 \nA role for microbial–palladium nanoparticles in \nextracellular electron transfer∗∗ \nXuee Wu, Feng Zhao*, Nelli Rahunen, John R. \nVarcoe, Claudio Avignone–Rossa, Alfred E. Thumser, \nRobert C.T. Slade \nInsights into extracellular electron transfer of microorganisms are \nimportant for the understanding of electron transport processes in \nbioelectrochemical systems (e.g. biological fuel cells and \nmicrobial electrolysis cells), as well as for biogeochemical cycles, \nbiocorrosion and bioremediation[1-7]. Two principal mechanisms \nfor extracellular electron transfer have been proposed: i) \nelectroactive metabolites\/secretions serve as mediators in an \nindirect electron transfer process; ii) electrons transfer directly \nfrom the cells to the electrodes via either membrane cytochromes \nor electrically conductive pili – the latter process has been \ndefined in a termed direct electron transfer (DET) and has \nrecently been the subject of intense study[3–7]. It is well known \nthat several microbes are capable of transforming a range of \nmetal ions\/minerals into nanoparticles that are bound into the cell \nmembrane. However, little is understood about the role of such \nmetallic nanoparticles in the physiological electron transfer \nprocesses, and important questions remain regarding the detailed \nmechanisms involved.  \n     In this work, the sulfate–reducing bacterium D. desulfuricans \nstrain was chosen as a model organism to study the direct \nelectrochemistry of microbes and the role of transformed metals.      \nNative cells appeared as thin rods with a homogenous surface \n(Figure 1). After exposing these cells to Pd(II) cations in an \naqueous lactate solution, the bacterial surface presented dense \ndark spots in the images; these exhibited a range of shapes and \n                                                          \n[∗] Dr. X. Wu, Dr. J. R. Varcoe,  Prof. R. C.T. Slade \nChemical Sciences, University of Surrey, Guildford, GU2 \n7XH, United Kingdom                                                                           \nN. Rahunen, Dr. C. Avignone-Rossa                               \nMicrobial Sciences, University of Surrey, Guildford, GU2 7XH, \nUnited Kingdom                                                                                                                                                \nDr. A. E. Thumser                                                           \nBiological Sciences, University of Surrey, Guildford, GU2 \n7XH, United Kingdom                                                                                                                                                \nProf. F. Zhao                                                                         \nInstitute of Urban and Environment, Chinese Academy of \nSciences, Xiamen, 361021, China                                                                           \nE-mail: fzhao@iue.ac.cn  \n[∗∗] This research was supported by the UK’s Engineering and \nPhysical Sciences Research Council as part of the \nSupergen5 Biological Fuel Cells Consortium programme \n(contract EP\/D047943\/1). F.Z. acknowledges the One \nHundred Talents Program of CAS.  \n         Supporting information for this article is available on the \nWWW under http:\/\/www.angewandte.org \nhad an average diameter of less than 10 nm and were confirmed \nas Pd metal nanoparticles by EDX analysis.  \n     DET of native cell. Direct evidence from the washed cells \nwas obtained using cyclic voltammetry. Curve 2 in Figure 2a \nshows oxidation peaks at –0.39 and 0.05 V and reduction peaks at \n–0.45 and –0.26 V in 50 mM buffer. An increase of pH caused a \nnegative shift of potential in the oxidative\/reductive waves, with a \nslope of –60 mV pH–1, suggesting that proton concentration \ngradients are involved in the extracellular electron transfer \nprocess. The experiments were conducted under conditions that \nexcluded the possibility of indirect electron transfer reactions; \nhence, the redox waves are due to the DET of enzymes bound on \nthe membranes of the cells. The results corroborate the \nassumption that the direct mechanism (i.e. DET) is preferred by \nsulfate–reducing bacteria when obtaining electrons from metals \n(as in the corrosion of iron), rather than involving intermediate \ncorrosive agents such as H+ or HS-[8]. \n \nFigure 1. STEM images of: a) a pristine D. desulfuricans cell; b) a D. \ndesulfuricans cell after exposure to 1 mM Pd(II) solution for 3 h with \nlactate as electron donor; c) microscopic detail of a washed Pd–loaded \ncell (magnification × 300000); and d) localization of bio–deposited Pd(0) \nparticles examined by EDX mapping (magnification × 300000). \n     The open circuit potential of D. desulfuricans modified glassy \ncarbon is approximately –0.23 V, and originates from the \nelectrode reactions of membrane enzymes linking oxidative \nmetabolism to extracellular electron transfer; this value would \nundergo a negative shift in potential in the presence of \nmicrobially produced sulfide[9,10]. Microbes obtain electrons from \nsubstrates which are oxidized through metabolic processes. A \ncomparison of curves 2 and 3 in Figure 2a reveals that the \noxidation peak at 0.1 V is linked to the electron pathway of \nlactate oxidation due to an increase in catalytic current. The \nformal potential of lactate oxidation to acetate has been reported \nto be at –0.42 V[7], however, the catalytic current in Figure 2a can \nbe seen to start at –0.06 V, which is consistent with the reported \nvalue for a cytochrome isolated from Shewanella[11]. Cytochrome \nc3 has been demonstrated to act as an electron carrier for \nhydrogenase reactions in D. desulfuricans, to either utilize or \nproduce hydrogen depending on the growth conditions[12]. In our \ncase, a membrane–bound cytochrome c3 could act as a conduit \nfor extracellular electron transfer to the electrode, while \nperiplasmic hydrogenases may provide a pathway for electrons \ntransport from the substrate oxidation; in other words, \ncytochromes and hydrogenases are interacting to enable the \ntransfer of electrons to the electrode. Scheme 1a shows the \nproposed electron transfer chain based on the data from the \nliterature[12–14]. As lipid membranes are not electronically \nconductive, the proposed route of electron transfer between \nproteins in the cell membranes is determined by their location (or \n 2\ntranslocation); the sequential multi–step reactions depend on the \nrelevant energy states (i.e. Gibbs free energy changes for the \nenzyme catalyzed redox reactions) involved. In Desulfovibrio \nspecies, substrates provide electrons via oxidation reactions \ncatalyzed by enzymes such as lactate dehydrogenase or formate \ndehydrogenase. Periplasmic hydrogenases then transport the \nelectrons via reactions involving hydrogen or proton \ntranslocation; and some electrons are terminally transported to \nelectrodes via cytochromes present in the membrane[12–14].  \nFigure 2. a) Cyclic voltammograms of: (1) bare GC electrode; washed D. \ndesulfuricans (Pd-free) cells coated onto a GC electrode in the absence \n(2) and presence (3) of lactate in 0.05 M buffer under a nitrogen \natmosphere. b) Cyclic voltammograms of: (1) D. desulfuricans coated \nonto a GC electrode; (2) D. desulfuricans cells exposed to 0.07 mM \nPd(II) coated onto a GC electrode; (3) D. desulfuricans cells exposed to \n1.0 mM Pd(II) coated onto a GC electrode. Scan rate 10 mV\/s. c) Cyclic \nvoltammograms in the presence of formate of a GC electrode coated with \nD. desulfuricans cells exposed to 1 mM Pd(II). d). Potentiostatic lactate \noxidation with a working electrode consisting of Pd(0)-D. desulfuricans \ncoated onto GC and held at a potential of 0.20 V vs. Ag\/AgCl. 0.2 M \nlactate was added in the buffer at t = 960 s. \n    DET of low-load-Pd cells. Microorganisms are capable of \ntransforming metal ions into metal (e.g. palladium, platinum and \ngold) nanoparticles[15–18]; these elements, like enzymes, have \noutstanding catalytic properties in a wide range of redox reactions. \nMoreover, the metal particles have a higher electronic \nconductivity compared to the microbial pili (~0.1 S\/cm)[5] of \nextracellular electron transfer. To investigate the role of the \nnanoparticles in the physicochemical reactions, the microbes \nwere first exposed to Pd(II) in concentrations of 0.07 and 1 mM \nto obtain different loadings[19] of cell bound Pd(0) particles; these \ncells were then coated onto GC electrodes for electrochemical \ntesting. Compared to the benchmark Pd–free D. desulfuricans \nmodified GC experiment (curve 1 in Figure 2b), the 0.07 mM-\nPd(II)-exposed cells (curve 2 in Figure 2b) yielded higher lactate \noxidation currents in the range –0.4 to 0.2 V which shows that the \nelectron transport increased with the presence of bio–derived \nPd(0). It has been known that environmental conditions \nsignificantly influence the physiological state of microbes and \ncan even impact upon the substrates or enzymes that can be \nutilized as temporary electron acceptors[20], and electrons from \nlactate oxidation are capable of transport through two or more \npathways[13]. In the present case, the periplasmic cytochrome c3 \nand hydrogenases are involved in the electron transfer processes \nfor lactate oxidation and for initial Pd(II) ions reduction[21] and \nhydrogenases act as the nucleation sites of phase \ntransformation[17]. When a low amount of Pd(0) is present \nalongside the periplasmic hydrogenases and cytochromes, the \nmetallic particles are hypothesised to facilitate electron transfer \nbetween the cells and electrode due to the higher conductivities \nand lower energy states compared to the proteins (illustrated in \nScheme 1b). Curve 2 in Figure 2b shows large reduction currents \nat low potentials in the region corresponding to proton reduction \n(i.e. H2 evolution); this data suggests that the microbial–derived \nPd particles exhibit a high catalytic activity for the production of \nmolecular hydrogen, which is a key intermediate in the energy \nmetabolism of a wide range of microbes. The increased current of \nlactate oxidation and of hydrogen evolution raises a possibility \nthat the Pd nanoparticles participate in microbial metabolism as a \nbio–derived electron carrier, a mechanism which may be further \nconfirmed by molecular biology or combined electrochemistry-\nspectroscopy techniques[6]. \n \nScheme 1. Hypothesised pathways for extracellular electron transfer \nchain between cell and electrode: a) via periplasmic cytochromes and \nhydrogenases (absence of bio–Pd); b) presence of low loaded bio–Pd(0); \nand c) presence of high loaded bio–Pd(0). [FeFe] represents iron–only \nhydrogenases, Cyt represents c–type cytochromes and grey shaded areas \nthe bio–Pd(0) nanoparticles. \n    DET of high-load-Pd cells. The tolerance of microbes towards \nmetal ions and the growth of the elemental particles depend on \nthe physicochemical parameters[22]. Compared to the benchmark \nPd–free D. desulfuricans modified GC,  cells exposed to the 1 \nmM Pd(II) (curve 3 in Figure 2a) exhibited no obvious redox \npeaks in the range of –0.4 to 0.2 V but there was a positive shift \nin the open circuit potential, indicating an influence from the \ninteraction of the enzymes and Pd(0) particles. The electrode \nreaction for this high loaded Pd system is illustrated in Scheme 1c. \nWhen the Pd metal particles grow in size and spatially dominate \naround the positions of periplasmic hydrogenases and \ncytochromes, they will interfere with the natural enzymatic \nelectron transfer pathways and catalytic reactions due to their \nhigh electronic conductive capacity. In Figure 2c, an oxidation \ncurrent of 5.1 μA (forward scan) was achieved with the presence \nof formate instead of lactate. Upon reversing the potential sweep \ndirection, an oxidation current of 3.2 μA was obtained. \nConsidering the observed high currents and the profile of the \nvoltammogram, abiotic direct electrochemical oxidation of \nformate on the surfaces of the bio–Pd(0) electrocatalysts is \nprobably due to the intrinsic catalytic activity of the membrane–\nbound particles. \n    When potentiostatic investigations were undertaken, a stable \nlactate oxidation current was obtained (Figure 2d); the changes in \ncurrent on addition of electron donors for a variety of prepared \nelectrodes are shown in Table 1. For the control experiments, no \nchange in oxidation current was detected on addition of lactate. \nThe low loaded Pd–D. desulfuricans–GC yielded a stable current \nof 25 nA, a factor of 4 greater compared to the Pd–free D. \ndesulfuricans–GC control; this indicates that the Pd nanoparticles \n 3\nbound onto the cell membranes facilitate the electron transfer. No \nlactate oxidation currents were detected for the high loaded Pd–D. \ndesulfuricans–GC electrode, which indicates that the Pd(0) \ninterferes with the microbial enzyme reactions in the cell \nmembrane at these loadings. However, the particles can act as \nhighly active bio–nanocatalysts for electrode reactions in \npresence of formate and hydrogen etc. and this could have \npotential environmental applications in bio-remediation \nprocesses[19]. \nTable 1. Summary of potentiostatic data for substrate oxidation on \nvarious working electrodes poised at +0.20 V vs. Ag\/AgCl. \nElectrode type Substrate Current increase (nA) \non substrate addition \nPristine GC Lactate n.d. \nPd–only modified GC Lactate n.d. \nD. desulfuricans–GCb Lactate n.d. \nD. desulfuricans–GCa Lactate 6.1 ± 5.3 \nD. desulfuricans–Pd(0)–\nGC (low Pd loading)a \nLactate 25 ± 17 \nD. desulfuricans–Pd(0)–\nGC (low Pd loading)b \nLactate n.d. \nD. desulfuricans–Pd(0)–\nGC (high Pd loading)a \nLactate n.d. \nPd–only modified GC Formate 191 ± 87 \nD. desulfuricans–Pd(0)–\nGC (high Pd loading)a \nFormate 232 ± 65 \nNote: aelectrode was prepared under nitrogen condition; \nbelectrode was prepared as a control experiments via an air–dried \nprocedure to obtain dead Pd-cells. n.d. = none detected. Data \npresented with standard deviations (n = 6).  \n \n Herein we have demonstrated a DET mechanism used by D. \ndesulfuricans; where the periplasmic cytochromes and \nhydrogenases play an important role, and Pd nanoparticles bound \nto the microbes may participate in the electron transfer process. \nThe present work is of importance not only for the fundamental \nstudies of electron transfer processes in microbial physiology and \necology, but also for increased understanding and improvement \nof the performance of bioelectrochemical techniques e.g. precious \nmetals are extensively used and important catalysts, and therefore \npresent in many industry processing wastewaters. Bio-\nnanoparticles can oxidize in situ metabolites e.g. H2, formate and \nethanol in the anode chambers, while also acting as cathodic \ncatalysts for the oxygen reduction reaction[23]. In addition, this \nstudy indicates the feasibility of using bioelectrochemical \nsystems for metal immobilization, recovery or detoxification. \nExperimental Section \nCultivation conditions: D. desulfuricans strain was obtained from the \nGerman Collection of Microorganisms and Cell Cultures (DSMZ, \nBraunschweig, Germany). The cells were grown in sealed bottles for 3 \ndays at 30oC in the medium previously described[9,10], collected by \ncentrifugation at 3500 rpm for 15 min. Pellets were washed two times \nwith 50 mL of 20 mM morpholinepropanesulfonic acid (MOPS)–NaOH \nbuffer (pH = 6.9) to remove any residual sulfide required prior to bio–\nPd(0) preparation. All solutions were purged with nitrogen before use and \nanaerobic conditions were maintained throughout the study unless \notherwise stated. \nPd(II) reduction by D. desulfuricans: Microbial pellets were added to 10 \nmL sterile MOPS buffer with 5 mM lactate as electron donor. A \nconcentrated stock solution of ammonium tetrachloropalladate(II) was \nadded to a yield a final concentration of 0.07 and 1.0 mM respectively. \nThe cultures were maintained different time (0, 1, 2, 3, 4 and 24 h) at 30 ± \n1 or 22 ± 1 °C for the Pd(II) reduction process.  \nMicrobially modified electrode preparation: After the reduction, the cells \nwere harvested by centrifugation at 3500 rpm for 15 min, further washed \nwith MOPS buffer and water (> 18.2 M\/cm), anaerobically transferred \nonto a the surface of a polished glassy carbon electrode (GC, 3 mm \ndiameter), and dried at room temperature under a nitrogen atmosphere (in \na control experiment, to show that the Pd-bacteria produced the electric \ncurrent, the bacteria were killed by either exposing them to air (these \nbacteria are anaerobes) or by heat treatement (details?)). \nElectrochemical measurements: The electrochemical characterization was \ncarried out by cyclic voltammetry and potentiostatic measurements using \na computer–controlled Autolab potentiostat\/galvanostat with a three–\nelectrode chamber containing a platinum wire counter electrode and a \nAg\/AgCl reference electrode. All potentials in this paper refer to this \nreference electrode. 0.05 M buffer (no culture medium) was used as \nelectrolyte. \nElectron microscopy and energy–dispersive X–ray: Cells suspended in \nthe MOPS buffer were fixed for 1 h in 2.5%(w\/v) glutaraldehyde, and \nthen dehydrated by using an ethanol in water series (25, 50, 75 and 100%), \nin steps was of 15 min duration. The suspension was air dried for 12 h \nand then placed onto a carbon–coated copper grid for electron microscopy \nanalysis. A Hitachi HD2300A scanning transmission electron microscope \nwith an EDX detector was used to characterize the cells and the Pd(0) \nparticles with an acceleration voltage of 200 kV.      \nReceived: ((will be filled in by the editorial staff)) \nPublished online on ((will be filled in by the editorial staff)) \nKeywords: · direct electron transfer· bioelectrochemical systems· \ncytochromes· hydrogenases· nanoparticle · sulphate reducing bacteria \n[1] C. Myers, K.H.  Nealson, Science 1988, 240, 1319–1321. \n[2] R. Kolter, D. K. Newman, Nature 2000, 405, 94–97. \n[3] B. H. Kim, H. J. Kim, M. S. Hyun, D. H. Park, J. Microbiol. \nBiotechnol. 1999, 9, 127–131. \n[4] G. Reguera, K. D. McCarthy, T. Mehta, J. S. Nicoll, M. T. \nTuominen, D. R. Lovley, Nature 2005, 435, 1098–1011. \n[5] M. Y. El-Naggar, Y. A. Gorby, W. Xia, K. H. Nealson, \nBiophys. J. 2009, 95, L10-12. \n[6] F. Zhao, J. Varcoe, R. Slade, Chem. Soc. Rev. 2009, 38, 1926–\n1939. \n[7] Marsili, E., Baron, D. B., Shikhare, I. D., Coursolle, D., \nGralnick, J. A., Bond, D. R. Proc. Natl. Acad. Sci. USA. 2008, \n105, 3968–3973. \n[8] H. T. Dinh, J. Kuever, M. Mumann, A. W. Hassel, M. \nStratmann, F.Widdel, Nature 2004, 427, 829–832. \n[9] F. Zhao, N. Rahunen, J. Varcoe, A. Roberts, C. Avignone-\nRossa, A. Thumser, R. Slade, Biosens. Bioelectron. 2009, 24, \n1931–1936. \n[10] F. Zhao, N. Rahunen, J. Varcoe, A. Chandra, C. Avignone-\nRossa, A. Thumser, R. Slade, Environ. Sci. Technol. 2008, 42, \n4971–4976. \n[11] R. Nakamura, F. Kai, A. Okamoto, G. J. Newton, K. \nHashimoto, Angew. Chem. int. Ed.  2009, 48, 508-511. \n[12] J. M. Odom, H. D. Peck, Jr, Annu. Rev. Microbiol. 1984, 38, \n551–592. \n[13] D. A. Elias, J. M. Suflita, M. J. McInerney, L. R. Krumholz, \nAppl. Environ. Microbiol. 2004, 70, 413–420. \n[14] D. R.  Lovley, Nat. Rev. Microbiol. 2006, 4, 497–508. \n[15] J. R. Lloyd, P. Yong, L. E. Macaskie, Appl. Environ. \nMicrobiol. 1998, 64, 4607–4609. \n[16] G. M. Gadd, Geoderma 2004, 122, 109–119. \n[17]  P. Yong, N. A. Rowson, J. P. Farr, I. R. Harris, L. E. \nMacaskie, Biotechnol. Bioeng. 2002, 80, 369–379. \n[18] F. Reith, M. F. Lengke, D. Falconer, D. Craw, G. Southam, \nISME J. 2007, 7, 567–584. \n[19] M. D. Redwood, K. Deplanche, V. S. Baxter–Plant, L. E.  \nMacaskie, Biotechnol. Bioeng. 2007, 99, 1045–1054.  \n[20] S. Glasauer, S. Langley, T. J. Beveridge, Science 2002, 295, \n117–119. \n 4\n[21] R. B. Payne1, L. Casalot, T. Rivere1, J. H. Terry, L. Larsen1, \nB. J. Giles, J. D.  Wall, Arch. Microbiol. 2004, 181, 398–406. \n[22] T. Klaus, R. Joerger, E. Olsson, C.–G. Granqvist, Proc. Natl. \nAcad. Sci. USA 1999, 96, 13611–13614. \n[23] F. Zhao, F. Harnisch, U. Schröder, F. Scholz, P. Bogdanoff, I. \nHerrmann, Environ. Sci. Technol. 2006, 40, 5193–5199. \n \n"}