{"doi":"10.1179\/136217109X406938","coreId":"139871","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/4308","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/4308","10.1179\/136217109X406938"],"title":"Welding process impact on residual stress and distortion","authors":["Colegrove, Paul A.","Ikeagu, C.","Thistlethwaite, A.","Williams, Stewart W.","Nagy, T.","Suder, Wojciech","Steuwer, Axel","Pirling, T."],"enrichments":{"references":[{"id":37950102,"title":"Acta Materialia,","authors":[],"date":"2004","doi":"10.1016\/j.actamat.2004.06.048","raw":"R. V. Preston, H. R. Shercliff, P. J. Withers and S. Smith: Acta Materialia, 2004, 52, 4973-4983.","cites":null},{"id":37950087,"title":"Analysis of Welded Structures',","authors":[],"date":"1981","doi":"10.1016\/b978-0-08-022714-6.50008-3","raw":"K. Masubuchi: 'Analysis of Welded Structures', 642; 1981, Oxford, England, Pergamon Press.","cites":null},{"id":37950104,"title":"Computational Welding Mechanics',","authors":[],"date":"2005","doi":"10.1007\/978-94-007-2739-7_437","raw":"J. A. Goldak and M. Akhlaghi: 'Computational Welding Mechanics', 316; 2005, New York, Springer.","cites":null},{"id":37950099,"title":"Fuerschbach: Welding Journal,","authors":[],"date":"1996","doi":"10.2172\/750165","raw":"P. W. Fuerschbach: Welding Journal, 1996, 75, 24-s.","cites":null},{"id":37950091,"title":"Guidelines for the Control of Distortion in Thin Ship Structures',","authors":[],"date":"1999","doi":null,"raw":"R. D. James, R. C. Harvey and K. Kyle: 'Guidelines for the Control of Distortion in Thin Ship Structures', Report 42372GDE TDL-98-01, EWI, Columbus, Ohio, 1999.","cites":null},{"id":37950088,"title":"Heat Effects of Welding',","authors":[],"date":"1992","doi":"10.1007\/978-3-642-48640-1","raw":"D. Radaj: 'Heat Effects of Welding', 1992, New York, Springer.","cites":null},{"id":37950095,"title":"Ikeagu:","authors":[],"date":"2008","doi":null,"raw":"T. Nagy, S. W. Williams, P. A. Colegrove, I. Fafiolu and C. R. Ikeagu: Proc. 2nd International Workshop on 'Thermal Forming and Welding Distortion', Bremen, Germany, 22-23 April 2008.","cites":null},{"id":37950101,"title":"Materials Science Forum,","authors":[],"date":"2007","doi":"10.4028\/0-87849-428-6.4025","raw":"D. G. Richards, P. B. Pragnell, P. J. Withers, S. W. Williams, A. Wescott and E. C. Oliver: Materials Science Forum, 2007, 539-543, 4025-4030.","cites":null},{"id":37950089,"title":"McPherson: Journal of Ship Production,","authors":[],"date":"2007","doi":null,"raw":"N. A. McPherson: Journal of Ship Production, 2007, 23, 94-117.","cites":null},{"id":37950103,"title":"Metallurgical Transactions.","authors":[],"date":"1984","doi":"10.1007\/bf02667333","raw":"J. Goldak, A. Chakravarti and M. Bibby: Metallurgical Transactions. B, Process Metallurgy, 1984, 15 B, 299-305.","cites":null},{"id":37950093,"title":"Welding Journal,","authors":[],"date":"1997","doi":null,"raw":"P. Michaleris and A. DeBiccari: Welding Journal, 1997, 76, 172-s-181-s.","cites":null},{"id":37950097,"title":"Welding Metallurgy',","authors":[],"date":"2003","doi":"10.1002\/0471434027","raw":"S. Kou: 'Welding Metallurgy', 461; 2003, New York, USA, Wiley-Interscience.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-11-01T00:00:00Z","abstract":"Residual stress and distortion continue to be important issues in shipbuilding\nand are still subject to large amounts of research. This paper demonstrates how\nthe type of welding process influences the amount of distortion. Many shipyards\ncurrently use submerged arc welding (SAW) as their welding process of choice. In\nthis manuscript we compare welds made by SAW with DC gas metal arc welding,\npulsed gas metal arc welding, Fronius Cold Metal Transfer (CMT), autogenous\nlaser and laser hybrid welding on butt welds in 4mm thick DH36 ship plate. Laser\nand laser hybrid welding were found to produce the lowest distortion.\nNevertheless a considerable improvement can be achieved with the pulsed gas\nmetal arc welding and CMT processes. The paper seeks to understand the\nrelationship between heat input, fusion area, measured distortion and the\nresidual stress predicted from a simple numerical model, and the residual\nstresses validated with experimental data","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139871.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1179\/136217109X406938","pdfHashValue":"61eecfdf74661a018a7dffb00e0e8c591a307be8","publisher":null,"rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/4308<\/identifier><datestamp>2016-02-09T20:11:22Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Welding process impact on residual stress and distortion<\/dc:title><dc:creator>Colegrove, Paul A.<\/dc:creator><dc:creator>Ikeagu, C.<\/dc:creator><dc:creator>Thistlethwaite, A.<\/dc:creator><dc:creator>Williams, Stewart W.<\/dc:creator><dc:creator>Nagy, T.<\/dc:creator><dc:creator>Suder, Wojciech<\/dc:creator><dc:creator>Steuwer, Axel<\/dc:creator><dc:creator>Pirling, T.<\/dc:creator><dc:subject>Welding<\/dc:subject><dc:subject>modelling<\/dc:subject><dc:subject>residual stress<\/dc:subject><dc:subject>distortion<\/dc:subject><dc:description>Residual stress and distortion continue to be important issues in shipbuilding\nand are still subject to large amounts of research. This paper demonstrates how\nthe type of welding process influences the amount of distortion. Many shipyards\ncurrently use submerged arc welding (SAW) as their welding process of choice. In\nthis manuscript we compare welds made by SAW with DC gas metal arc welding,\npulsed gas metal arc welding, Fronius Cold Metal Transfer (CMT), autogenous\nlaser and laser hybrid welding on butt welds in 4mm thick DH36 ship plate. Laser\nand laser hybrid welding were found to produce the lowest distortion.\nNevertheless a considerable improvement can be achieved with the pulsed gas\nmetal arc welding and CMT processes. The paper seeks to understand the\nrelationship between heat input, fusion area, measured distortion and the\nresidual stress predicted from a simple numerical model, and the residual\nstresses validated with experimental data.<\/dc:description><dc:date>2011-02-07T23:08:11Z<\/dc:date><dc:date>2011-02-07T23:08:11Z<\/dc:date><dc:date>2009-11-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Paul Colegrove, Chukwugozie Ikeagu, Adam Thistlethwaite, Stewart Williams, Tamas Nagy, Wojciech Suder, Axel Steuwer and Thilo Pirling. The welding process impact on residual stress and distortion. Science and Technology of Welding and Joining, 2009, Vol 14 (8), p.717-725<\/dc:identifier><dc:identifier>1362-1718<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1179\/136217109X406938<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/4308<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1362-1718","1362-1718"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Welding","modelling","residual stress","distortion"],"subject":["Article"],"fullText":"1The welding process impact on residual stress and distortion\nPaul Colegrove1, Chukwugozie Ikeagu2, Adam Thistlethwaite3, Stewart Williams1, Tamas\nNagy1, Wojciech Suder1, Axel Steuwer4 and Thilo Pirling5.\n1Welding Engineering Research Centre, Cranfield University, Bedfordshire MK43 0AL, UK\n2Acergy, Bucksburn House, Howes Road, Aberdeen, AB16 7QU, UK\n3Furmanite International Ltd – UK, Furman House, Shap Road , Kendal, Cumbria LA9 6RU,\nUK\n4ESS Scandinavia, Lund University, Stora Algatan 4, 22350 Lund, Sweden\n5Institut Laue-Langevin (ILL), BP 156, 6, rue Jules Horowitz, 38042 Grenoble Cedex 9,\nFrance\n2Abstract\nResidual stress and distortion continue to be important issues in shipbuilding and are still\nsubject to large amounts of research. This paper demonstrates how the type of welding\nprocess influences the amount of distortion. Many shipyards currently use submerged arc\nwelding (SAW) as their welding process of choice. In this manuscript we compare welds\nmade by SAW with DC gas metal arc welding, pulsed gas metal arc welding, Fronius Cold\nMetal Transfer (CMT), autogenous laser and laser hybrid welding on butt welds in 4mm thick\nDH36 ship plate. Laser and laser hybrid welding were found to produce the lowest distortion.\nNevertheless a considerable improvement can be achieved with the pulsed gas metal arc\nwelding and CMT processes. The paper seeks to understand the relationship between heat\ninput, fusion area, measured distortion and the residual stress predicted from a simple\nnumerical model, and the residual stresses validated with experimental data.\nKeywords: Welding, modelling, residual stress, distortion.\n3Introduction\nTwo of the major problems of any welding process are residual stress and distortion.\nExtensive reviews of these problems have been written by Masubuchi1 and Radaj2 and a more\nrecent review which focuses on the issues in the shipbuilding industry has been written by\nMcPherson3. Residual stress is primarily caused by the compressive yielding that occurs\naround the molten zone as the material heats and expands during welding. When the weld\nmetal cools it contracts which causes a tensile residual stress, particularly in the longitudinal\ndirection. These stresses are shown diagrammatically in Fig. 1(a). After welding a residual\ntensile stress remains across the weld centerline and causes a balancing compressive stress\nfurther from the weld zone as shown in Fig. 1(b). The tensile residual stress on the weld line\nreduces the fatigue strength and the toughness, particularly when combined with any notches\nor defects associated with the weld bead.\nTo relieve some of the residual stresses caused by the welding process, the structure deforms,\ncausing distortion. There are several modes of distortion, but the one that is most common,\nparticularly in thin welded structures is buckling distortion, which is caused by the\ncompressive stress in the parent material. Buckling distortion is becoming increasingly\ncommon due to the use of new high strength materials that enable the use of thinner sections\nwith reduced critical buckling loads (and stresses)4.\nIt is often useful to examine the residual stress in terms of the Applied Weld Load (AWL).\nThe AWL is the magnitude of the longitudinal tensile load and is obtained by multiplying the\naverage tensile stress σmax by the width of the tensile stress region4. Where the AWL exceeds\nthe critical buckling load distortion occurs5. To reduce the AWL it is necessary to reduce\neither the magnitude or the width of the tensile stress region.\nReducing the AWL can be done by either processing or stress engineering. The processing\nmethod involves the use of a lower heat input e.g. laser welding6,7 to reduce the width of the\ntensile stress region during welding. These methods generally have little effect on the\nmagnitude of the tensile stress region which is typically around the yield value. Stress\nengineering methods are those that can be used during an existing welding process to lower\nthe magnitude of the tensile stress region. These methods rely on the application of a tensile\nstress which reduces the compressive yielding and induces a tensile stretch in the material\nafter welding8.\nFinally, some methods reduce the distortion without significantly reducing the weld residual\nstress or AWL. These include improved clamping and weld sequencing9 and those methods\nthat deal with the residual stress after it has been created. The most common methods are\npost weld heat treatment, flame straightening10, vibratory stress relief10 and induction heat\ntreatment methods3.\nThis paper investigates the method of reducing the heat input to reduce the weld distortion\nand is an extension of the work reported in Nagy et al.11. It is divided into three parts, the first\ndescribes the experimental work, the second seeks to understand the experiments with a\nsimple model that predicts the residual stress, and the final section compares these residual\nstress predictions with residual stress measurements from neutron diffraction.\n4Method\nWelding\nThe investigation compared six processes: Submerged Arc Welding (SAW), DC Gas Metal\nArc Welding (GMAW), Pulsed GMAW, Fronius Cold Metal Transfer (CMT), autogenous\nlaser and hybrid laser. The material used for the investigation was 500 × 125 × 4mm ASTM\nA131 steel; grade DH36. The narrow width of the specimens ensured that the critical\nbuckling load was low, so the distortion was large and could be easily measured. All the\nplates were rolled prior to welding to remove distortion (but not stress). Table 1 gives the\ntypical compositional range. The yield strength is typically 350 MPa and the ultimate tensile\nstrength is between 490 and 620 MPa. All processes except for autogenous laser and SAW\nused ARCWELD A18 Plus, 1.2 mm diameter filler wire and a shielding gas that contained\nArgon with 20% CO2. The SAW process used ESAB OK Autrod 12.22 copper coated, 3.2\nmm diameter wire with Oerilikon OP 122 as the top flux and Oerilikon PIE UP 18 as the\nbottom flux. A closed square butt joint preparation and copper backing was used for all\nprocesses except CMT. This joint preparation was used because it requires the least\npreparation in a production environment. CMT used a single sided V-butt joint preparation\nwith a 90o included angle and a copper backing bar since the process had insufficient power to\nuse the closed square butt preparation.\nThe clamping arrangement used for the experiments is shown in Fig. 2. The specimens were\nclamped to a large baseplate which had grooves for the backing bar and thermocouples.\nConsistent pressure along the weld length was crucial to producing high quality welds, due to\nits effect on the heat loss through the backing bar. Tacking of the plates was required to avoid\nplate separation during welding.\nThe thermocouples were spot welded to the underside of the plates due to the restrictions\nimposed by the clamps and the flux in SAW. Temperature was measured at distances of 15,\n30 and 60 mm from the weld centerline and K-type thermocouples were used at all locations.\nMonitoring of the current, voltage and wire feed speed was done with a Triton Electronics\nLimited’s AMV 4000 arc watch system. This system calculated the average weld power input\nby averaging the instantaneous voltage multiplied by the instantaneous current. The weld\nheat input was then calculated by dividing by the weld travel speed and including an\nefficiency factor for the process. 85% was used for SAW and 80% was used for the GMAW\nprocesses based on Kou12. An efficiency of 90% was assumed for the laser power in the two\nlaser processes based on Fuerschbach13. This issue is discussed further in a later section.\nThe welding parameters were developed by trial and error and are summarized in Table 2.\nThe welds were principally evaluated by visual examination and with BS EN 25817:1992\n(ISO 5817:1992) intermediate quality level C as a guide. It should be noted that proper\nprocedure development should involve other examinations such as metallography and\nmechanical testing (hardness and Charpy test). In using this standard, the following were\nensured.\n Good bead penetration\n Adequate capping and smooth bead appearance\n Absence of surface defects such as undercuts.\nPost-weld Analysis\nThe distortion of each of the plates was measured after welding with six Mitutoyo IDU\nDigimatic displacement transducers across a grid where the measurement points were spaced\n50 mm apart. The length of each of the specimens was reduced to 450 mm to enable\nconsistent distortion measurements. Welds from each of the processes were sectioned,\n5polished and then etched with Nital (2% Nitric acid in ethyl alcohol) before examination\nunder the microscope.\nHardness was measured with a Vickers micro hardness testing machine. For SAW, DC\nGMAW, Pulsed GMAW and CMT, the indentation points were made 1mm apart across the\nsection, while measurements were made every 20μm for the hybrid and autogenous laser \nprocesses.\nResults\nHigh quality welds were obtained for all processes except DC GMAW and autogenous laser.\nThe DC GMAW process was very sensitive to the welding parameters. Incorrect settings led\nto either burn-through (too much heat) or lack of penetration (too little). High quality welds\nwere however achieved with the pulsed GMAW process: the lower heat input avoiding the\nproblem of burn-through while the peak current provided sufficient arc pressure to achieve\nfull penetration. The autogenous laser weld had significant undercut, which would be\nresolved by the addition of filler wire. In all welds, but particularly those with the higher heat\ninputs consistent clamping along the weld length was crucial to the production of high quality\nwelds.\nA typical plot of the measured distortion for SAW is shown in Fig. 3, and shows first order\nbuckling distortion. First order buckling was observed for all the welds apart from\nautogenous laser weld where the distortion was negligible. The SAW also demonstrates a\nsmall amount of angular distortion which is just discernable in Fig. 3. The angular distortion\nfor all other welding processes was negligible.\nThe distortion index for each weld was found by averaging the distortion measurements\nacross the plate, which is plotted against the heat input in Fig. 4 (a). The trend line shows a\nnear linear relationship between the heat input and distortion index. The greatest deviation\nfrom this trend is for the DC GMAW process. There is an even a stronger correlation\nbetween the heat input and the fusion area as shown in Fig. 4(b). Further evidence of the\ndifference in heat inputs between the processes is provided by the plot of the peak\ntemperatures verses the distance from the weld centerline in Fig. 5(a). Finally the residual\nstress measurements in Fig. 5(b) illustrate how the tensile peak widens with increasing heat\ninput. There is very little difference in the magnitude of the tensile peak between the different\nwelding processes. The results for the autogenous laser process are perhaps slightly lower,\nand there was considerably greater noise in these values than for the other processes.\nEach of the welds was sectioned and the microstructure examined. Even though there were\nsignificant differences in the weld microstructures there was remarkably little difference in\nthe hardness values of the base material, HAZ and weld metal as shown in Fig. 5(c). The one\nexception is the autogenous laser process which had an unacceptably high hardness in the\nfusion zone.\nDiscussion\nMaking an adequate comparison of the different welding processes is difficult given the\nwidely different travel speeds used. Nevertheless, the high heat input and distortion of the\nSAW is abundantly clear: both being almost twice as much as the other arc welding\nprocesses. Therefore there is a clear advantage in using an alternate welding process to lower\ndistortion. Overall, a distortion reduction of 20-70% is realizable with the GMAW processes\nover the SAW process and 80-95% reduction is possible with the laser processes.\n6The near linear relationship between the heat input and fusion area in Fig. 4 (b) is perhaps\nmore fortuitous for these set of experiments than a general rule that can be applied to all\nwelding processes. Nevertheless higher heat inputs do result in more material being melted\nand they provide further verification of the heat input calculations.\nAs mentioned in the introduction, the amount of distortion depends on the applied weld load\n(AWL). For all processes except autogenous laser, the tensile strength in the weld region is\nnearly constant. Therefore the AWL is linearly dependent on the width of the tensile stress\nregion. The width will be approximately proportional to the area of the fusion zone.\nTherefore the linear increase in fusion zone area with heat input, implies that there will also\nbe a linear increase in the AWL. This link between AWL and heat input has also been\ndemonstrated by James et al.4.\nThe other main finding, that heat input and distortion have a near linear relationship (Fig. 4\n(a)) is supported by the findings of Michaeleris et al.14 who showed a near linear increase in\ndistortion with AWL (and hence heat input as discussed above) above the critical buckling\nload. Furthermore, the trend line suggests that the critical buckling load is not exceeded for\nheat inputs below about 0.12 kJ mm-1 based on the x axis intercept for this plate geometry. To\nsummarize, there is a near linear relationship between the AWL, fusion area, heat input and\ndistortion index for the welds analysed in this study.\nThe results for the residual stress measurements indicate that the width of the tensile peak\nincreases with heat input, as expected. Note however that the residual stress of the CMT and\nPulsed GMAW processes are almost identical. It should be noted however that the amount of\nreinforcement with the CMT weld is considerably less, in part due to the edge preparation.\nTherefore the Applied Weld Load for this weld will be lower than for the Pulsed GMAW\nwhich explains the greater distortion with this weld.\nThe peak temperatures provide further verification of the heat input findings, with a similar\norder being observed. Note, that some of the low speed processes, e.g. CMT, can have\nrelatively high temperatures in the far field (60 mm away from the centerline) because there is\nmore time for the heat to diffuse away from the arc.\nFinally all of the weld hardness levels are within the acceptable level of 350HV7, with the\nexception of autogenous laser. In this case, the low heat input and high welding speeds\ncontributed to a rapid cooling rate which led to the formation of lower bainite, and possibly\nsome martensite being present. A more detailed analysis of a similar autogenous laser weld in\nDH 36 steel7 showed that the weld metal contained bainite and Widmanstatten ferrite.\nIn addition, the autogenous laser process requires very tight tolerances and cannot tolerate any\ngaps between the plates. This leads to very poor process robustness and quality. To capture\nthe differences between the processes, a qualitative comparison has been attempted in Table\n3. Overall, the hybrid laser and pulsed GMAW have the most advantages and the least\ndisadvantages. The final choice will depend on whether the hybrid laser’s high productivity\nand low distortion offsets the added cost and safety issues associated with this process.\nModeling\nDescription of Model\n3-dimensional models for welding the thermal cycle and residual stress in welding are now in\ncommon use as a research tool for both academic and commercial purposes15-19. The models\n7use a transient 3-dimensional thermal model which is coupled to an elastic-plastic model for\ncalculating the stress and strain. The loading on the elastic-plastic model is calculated from\nthe thermal expansion at each time step. During the last time step the plate is allowed to cool,\ngiving the as-welded residual stress. Computational time is often an issue with these models\ndue to the need to calculate both the temperature and stress at each time step. Although a\nsteady state approach is trivial for the heat flow, such an analysis cannot be used easily for\nresidual stresses. Various methods have been used to reduce the solution time and include:\n 2-dimensional thermal and plane strain elastic-plastic models5. These models use a\nmesh which is orientated in a plane transverse to the welding direction. Although\nsome accuracy is lost with the 2-dimensional approximation, the residual stress results\ncompare favourably with experiments. The stress field from the 2-dimensional model\ncan be applied to a three dimensional elastic model using a thermal loading, which\nenables the prediction of distortion14.\n Analytical methods20. These use a thermal model to calculate the maximum\ntemperatures and the weld bead. The temperature data is then used to calculate the\ntransverse ‘Thermal Contraction Strain’ (TCS) via the size of the weld bead and the\nlongitudinal ‘Mismatched Thermal Strain’ (MTS) via the magnitude of the maximum\ntemperature. These strains are then applied as a thermal load to a 3-dimensional\nelastic model which predicts the distortion. This method is similar to the previous one\nand differs in the analytical rather than computational method for calculating the\nthermal loading which makes it more efficient.\nThe model presented in this paper uses the former approach. It is used to get a better\nunderstanding of the differences between the processes through prediction of the longitudinal\nresidual stress and in particular the far field compressive stress that causes buckling distortion.\nNote that prediction of distortion from the residual stress has not been attempted.\nAlthough there are many similarities with the Michaleris and DeBiccari model, the current\nmodel differs from it in one major respect. Rather than using a 2-dimensional model for both\nthe thermal and structural aspects, a 3-dimensional steady state model is used for the thermal\nfield. A series of temperature slices from this model are shown in Fig. 6. These two-\ndimensional temperature slices (in the y-z plane) are then transferred to the 2-dimensional\nelastic-plastic model. Note that in practice many more slices are taken, particularly around\nthe weld pool – the diagram in Fig. 6 is purely illustrative. Any differences with Michaleris\nand DeBiccari are expected to be minor, and due to forward heat conduction that is\npermissible in the 3-dimensional thermal model, but not accounted for in the simpler 2-\ndimensional thermal model.\nFor each slice a plane strain analysis is carried out to determine the thermal strain (and hence\nstress) imparted by the temperature field. This strain is used as the initial condition for the\nanalysis of the subsequent slice and this allows the development of stress to be determined.\nThe stress analysis is carried out against the direction of welding i.e. from the cool base metal,\nthrough the heat source, along the trailing thermal gradients and back to metal at room\ntemperature. This ensures that the final residual stress plot has taken account of the prior\ntemperature and stress\/strain history. With this in mind it is clear that it is important to\nminimize the distance between each slice if accurate stress predictions are required as\nimportant phenomena occurring between slices may be missed. Therefore the density of the\nslices around the weld region is increased due to the large thermal gradients.\nModel Application\nA model of each of the welds was created with the Comsol Finite Element package. The\nthermal properties used for this model are identical to those used in Michaleris and DeBiccari5\n8who used the properties for mild steel. There is little difference in the thermal properties with\nalloy content for structural steels. These properties use an artificially high thermal\nconductivity for temperatures greater than 1500oC, to capture the convective heat transfer in\nthe weld pool. The latent heat of fusion was included in the model by artificially increasing\nthe specific heat around the melting temperature. The size of the latent heat was tested and\nhad virtually no effect on the magnitude of the final residual stress.\nThe heat source was represented with a conventional double ellipsoid heat source21 for all\nprocesses including the laser processes.\n \n\n\n\n\n\n\n\n\n 2\n2\n2\n2\n2\n2\n333exp\n36\n,,\na\nz\nb\ny\nc\nx\ncba\nQr\nzyxq\nff\nf\nf\n\nx>0\n \n\n\n\n\n\n\n\n\n 2\n2\n2\n2\n2\n2\n333exp\n36\n,,\na\nz\nb\ny\nc\nx\ncba\nQrzyxq\nbb\nb\nb\n\nx<0\nwhere:\nx,y,z,a,b,cf and cb are defined in Fig. 7;\nQ is the input power, including a factor for efficiency;\nrb and rf are factors for distributing the power between the front and back of the weld.\nThey must add to 2 and have been distributed as:\nbf\nf\nf cc\nc\nr\n\n\n2\nand\nbf\nb\nb cc\nc\nr\n\n\n2\nThe authors acknowledge that better representations such as a point and line heat\nsource22could have been used for the laser process, but this method was used to simplify the\nmodel’s implementation. The size parameters (a, and c) used in the double ellipsoid heat\nsource are shown in Table 4 and equal the weld pool size. Note that the thickness parameter,\nb is assumed to be the plate thickness of 4 mm. This is possibly not ideal, as Goldak and\nAkhlaghi23 suggest using values 10% smaller than those of the weld, however the difference\nis small and not expected to have a significant effect on the residual stresses predicted.\nFinally, the travel speeds used for each process are shown in Table 2.\nHeat loss occurs primarily from the underside which is in contact with the backing bar. This\nis modelled with a convective heat transfer coefficient which becomes one of the two main\nunknown variables in the model. The other unknown variable is the weld efficiency (which\naffects the weld power input). A trial and error approach was used to determine the value of\nthese parameters. The thermal profile at the locations used for the thermocouples was\ndetermined and compared with the experimental results. By adjusting these two parameters\nthe thermal profiles were matched to within ±15ºC.\nOne of the most crucial aspects of the structural model is the material strength. The model\nuses elastic perfectly plastic material properties and ignores the phase changes that occur in\nthe real material. The yield strength was varied between the processes, with the value being\ninferred from the average weld metal hardness. ASTM A370 Tables 2 & 3 were used to\napproximate tensile strength from the weld hardness values, and a tensile\/yield strength factor\nof the 1.58 was used to determine the approximate room temperature yield strength of the\nweld metal in each case. Table 5 shows the yield strengths obtained using this technique.\nTemperature dependent yield strength values for the weld metal were inferred by offsetting\nthe standard curve for the welding wire from Fig. 5 of Michaleris and DeBiccari5 by the\ndifference between the standard value and that stated in\nTable 5.\n[1]\n9Results\nUnfortunately it was not possible to obtain results for the SAW process due to instability\nproblems that were likely to be caused by the high heat input for this process. No problems\nwere experienced for the remaining five processes.\nThe weld efficiency and heat transfer coefficient values that gave best agreement with the\nthermocouples are shown in Table 6. The efficiency of all processes apart from CMT was\nlower than those reported in Kou12. Fig. 8 illustrates the predicted longitudinal residual stress\nfor each process. The residual stresses are generally near the yield values and are high and\nnarrow for the laser process and lower and broader for the remaining processes.\nTo understand how the residual stress relates to a loading that causes distortion, the residual\nstress predictions were multiplied by the area over which the stress acts. This value is plotted\nagainst the heat input and compared with the distortion index Fig. 9.\nDiscussion\nSome caution needs to be used in interpreting the values of weld efficiency and convective\nheat transfer coefficient in Table 6. The solutions shown were the best fit for the simple\nmodel used and there may be other solutions possible, particularly where more complex\nboundary conditions on the underside of the weld are used. For example, models that capture\nthe relatively good heat transfer to the backing bar near the weld region would be more\nrealistic and would lead to different heat transfer coefficients and weld efficiencies than those\nreported.\nIn all cases except the CMT process, the efficiency predicted by the model was 10-20% lower\nthan the generic values provided in Kou12. More recent arc efficiency measurements by\nJoseph et al. gave values in the range 67 to 82% for GMAW and are closer to those reported\nin this work. Measuring the arc efficiency is difficult and the method described above is\nlikely to be less accurate than using direct calorimetric measurements24. The other unknown\nparameter calibrated in the weld was the convective heat transfer coefficient. This showed a\nsignificant variation between the welds which may (in-part) be due to variation in the\nclamping conditions.\nThe predictions of the longitudinal residual stress profile are typical of this kind of model5\nand show a flat compressive stress distribution with distance from the weld. The laser process\nhas the greatest peak due to the harder microstructure. The peak value found for the\nremaining processes is similar, but widens with the greater heat input resulting in a greater\nweld load. There is a direct relationship between the weld load and the measured distortion as\nseen in Fig. 9. Based on these results the critical buckling load is likely to be between 20-25\nkN. The distortion of the laser welds and the autogenous laser weld in particular is likely to\nbe inherent in the plate and\/or angular distortion. A very similar relationship between the\nAWL and distortion index has been reported in Michaleris et al.5,14. The main difference with\nthe published work is that the distortion index is measured experimentally, rather than being\nan output of a model.\nResidual Stress Measurements\nMethodology\nThe residual stresses of each of the samples were measured by neutron diffraction on the\nSALSA Engineering Beamline at the Institut Laue-Langevin in Grenoble, France during beam\ntime allocation 1-01-56. Each of the specimens was cut down to 385 mm in length for the\n10\npurpose of this experiment, and the strains were measured transverse to the weld direction\nhalf way along the length. The residual stresses were inferred from the strains in the\nlongitudinal, transverse and normal directions assuming a biaxial stress system. The SALSA\ninstrument used a wavelength of 1.694 Ǻ and the diffraction peak Fe-211 at 2Θ=88.5° was \nmeasured to obtain cuboidal gauge volumes. The primary and secondary slits were positioned\napproximately 40 mm away from the gauge volume. The gauge volume, as defined by the slit\nsizes was 1 × 1 × 0.9 mm3 for the longitudinal strains and 1.5 × 1.5 × 10 mm3 for the normal\nand transverse directions. 1 mm steps were used to capture the residual stresses in the weld\nregion which was increased to 10 mm in the parent material, away from the weld. Each\nmeasurement point counted 1500 neutrons to ensure a good quality diffraction peak. Finally,\nthe strain free lattice spacing was found from equations that assumed the stress normal to the\nplate surface was zero (biaxiality).\nResults and Discussion\nThe longitudinal residual stresses across the six welds are shown in Fig. 10(a) and a\ncomparison of the weld region with the model predictions is shown in Fig. 10(b). The results\nindicate that the width of the tensile peak increases with heat input, as expected. Note\nhowever that the residual stress of the CMT and pulsed gas metal arc welding process are\nalmost identical, indicating comparable (absorbed) heat input for the two processes.\nThe comparison between the model and experimental predictions in Fig. 10(b) is particularly\ninteresting. Although the magnitude of the peak stresses is not well represented by the model,\nthere is remarkably good agreement in the width of the tensile stress regime. This result is\npleasing given the simplifying assumptions made in the model. The magnitude of the tensile\npeak produced by the model is primarily a function of the yield tensile stress vs. temperature\ndata. Since this was not measured for the material used in the experiment it is hardly\nsurprising that there is a discrepancy. In addition, there is very little variation in the peak\nresidual stress between the processes, unlike the model predictions. In particular, the\nmeasured residual stress for the laser weld is slightly lower than the other processes and does\nnot appear to be affected by microstructural hardening. It is unclear why this should be the\ncase, although there was relatively large point-to-point scatter in the residual stress data for\nthe laser weld.\nConclusions\nThrough a comparison of the SAW, DC GMAW, pulsed GMAW, CMT, hybrid laser and\nautogenous laser processes this paper has demonstrated:\n The clear link between the heat input and the measured distortion for a range of\nwelding processes on 4mm thick DH36 ship plate.\n A linear relationship between the fusion area and heat input.\n The advantages and disadvantages of the six welding processes. The comparison\nsuggested that either the hybrid laser or pulsed GMAW were the best processes for\nthis application.\n A simple model which was used to predict the longitudinal residual stress for five of\nthe welds.\n The AWL calculated by the model increased with the heat input primarily due to a\nwidening of the tensile residual stress region. There was a direct link between the\nAWL predicted by the model and the distortion index, confirming previously\npublished numerical results.\n There is good agreement between the width of the longitudinal residual stresses\npredicted by the model and those measured experimentally. However, the model fails\n11\nto predict the peak residual stress values correctly which is primarily due to poor yield\nstress vs. temperature data used in the model.\nAcknowledgements\nThe authors wish to thank Flemming Nielsen, Brian Brookes, and David Archer from\nCranfield University who assisted in the experimental work.\nReferences\n1. K. Masubuchi: 'Analysis of Welded Structures', 642; 1981, Oxford, England, Pergamon\nPress.\n2. D. Radaj: 'Heat Effects of Welding', 1992, New York, Springer.\n3. N. A. McPherson: Journal of Ship Production, 2007, 23, 94-117.\n4. R. D. James, R. C. Harvey and K. Kyle: 'Guidelines for the Control of Distortion in Thin\nShip Structures', Report 42372GDE TDL-98-01, EWI, Columbus, Ohio, 1999.\n5. P. Michaleris and A. DeBiccari: Welding Journal, 1997, 76, 172-s-181-s.\n6. S. M. Kelly, R. P. Martukanitz, P. Michaleris, M. Bugarewicz, T. D. Huang and L.\nKvidahl: Journal of Ship Production, 2006, 22, 105-109.\n7. N. A. McPherson, N. Suarez-Fernandez, D. W. Moon, C. P. H. Tan, C. K. Lee and T. N.\nBaker: Science and Technology of Welding and Joining, 2005, 10, 460-467.\n8. D. A. Price, S. W. Williams, A. Wescott, C. J. C. Harrison, A. Rezai, A. Steuwer, M. Peel,\nP. Staron and M. Koc ̧ak: Science and Technology of Welding and Joining, 2007, 12, 620-633.\n9. M. Mochizuki, T. Hattori and K. Nakakado: Journal of Engineering Materials and\nTechnology, Transactions of the ASME, 2000, 122, 108-112.\n10. A. S. M. Y. Munsi, A. J. Waddell and C. A. Walker: Strain, 2001, 37, 141-149.\n11. T. Nagy, S. W. Williams, P. A. Colegrove, I. Fafiolu and C. R. Ikeagu: Proc. 2nd\nInternational Workshop on 'Thermal Forming and Welding Distortion', Bremen, Germany,\n22-23 April 2008.\n12. S. Kou: 'Welding Metallurgy', 461; 2003, New York, USA, Wiley-Interscience.\n13. P. W. Fuerschbach: Welding Journal, 1996, 75, 24-s.\n14. P. Michaleris, L. Zhang, S. R. Bhide and P. Marugabandhu: Science and Technology of\nWelding and Joining, 2006, 11, 707-716.\n15. P. Dong: Science and Technology of Welding & Joining, 2005, 10, 389-398.\n16. J. Goldak, J. Zhou, S. Tchernov, D. Downey, S. Wang and B. He: Proc. International\nConference on 'Trends in Welding Research', Pine Mountain, GA, 16-20 May 2005, Materials\nPark, OH, USA, 531-539.\n12\n17. D. G. Richards, P. B. Pragnell, P. J. Withers, S. W. Williams, A. Wescott and E. C.\nOliver: Materials Science Forum, 2007, 539-543, 4025-4030.\n18. R. V. Preston, H. R. Shercliff, P. J. Withers and S. Smith: Acta Materialia, 2004, 52,\n4973-4983.\n19. N. A. McPherson, K. McGibbon and S. W. Wen: Science and Technology of Welding and\nJoining, 2006, 11, 191-199.\n20. D. Camilleri, T. Comlekci and T. G. F. Gray: Journal of Strain Analysis for Engineering\nDesign, 2005, 40, 161-176.\n21. J. Goldak, A. Chakravarti and M. Bibby: Metallurgical Transactions. B, Process\nMetallurgy, 1984, 15 B, 299-305.\n22. W. M. Steen, J. Dowden, M. Davis and P. Kapadia: J. Phys. D, 1988, 21, 1255-1260.\n23. J. A. Goldak and M. Akhlaghi: 'Computational Welding Mechanics', 316; 2005, New\nYork, Springer.\n24. A. Joseph, D. Harwig, D. F. Farson and R. Richardson: Science and Technology of\nWelding and Joining, 2003, 8, 400-406.\n13\nTable 1 Composition ranges of DH36 steel.\nC Mn Si S P Al Nb V Cu Cr Ni Mo Fe\n0.18\nmax\n0.9\n–1.6\n0.1\n-0.5\n0.04\nmax\n0.04\nmax\n0.015\nmin\n0.015-\n0.05\n0.05-\n0.1\n0.35 0.20 0.40 0.08 Rem\nTable 2 Details of welding processes and parameters used.\nProcess SAW DC\nGMAW\nPulsed\nGMAW\nCMT Hybrid Laser Autogenous\nLaser\nMachine\nType\nStarmatic\n1300DC\nESAB\nAristo\n450\/\nLUD\n450\nESAB\nAristo\n450\/\nLUD\n450\nFronius\nTranspuls\nSynergic\n5000 CMT\npower supply\nwith VR700\nwire CMT\nfeeder\nIPG YLR-8000\nfibre laser with\nLincoln Power\nWave\n455M\/STT\noperating in\npulsed mode.\nIPG YLR-\n8000 fibre\nlaser\nContact\ntip to\nwork\ndistance\n(mm)\n20 12 12 12 20, 69o to laser\ntorch.\n-\nWelding\nspeed\n(m min-1)\n1.125 0.667 0.8 0.618 2.5 2.5\nWFS\n(m min-1)\n1.4 7.6 8.5 6.9 11.43 -\nAverage\nCurrent\n(A)\n503.5 278 281 232 270 -\nAverage\nVoltage\n(V)\n35 25.5 27.5 16.5 25 -\nGas Flow\n(L min-1)\n- 15 15 15 12 12\nLaser\npower\n(kW)\n- - - - 4.5 4.5\nLaser\nspot size\n(mm)\n- - - - 0.63\n(uniform)\n0.63\n(uniform)\nFocus\nposition\nOn top surface.\nAngle between\nthe torch and\nthe laser was\nset at 31o.\nOn top\nsurface\n14\nTable 3 Subjective comparison of the six welding processes.\nKey\nGood Fair Poor\nProcess Edge Prep Welding Position Safety Cost Productivity Mechanical\nProperties\nQuality Heat Input Distortion\nSAW None Down hand Standard Medium Medium Good Good Very high Very High\nDC GMAW None Down hand Standard Low Medium Good Poor High High\nPulsed GMAW None Any Standard Low Medium Good Good High Medium\nCMT V- Butt Any Standard Medium Low to medium Good Good Medium Medium\nHybrid Laser None Any Very high Very High High Good Good Low Low\nAutogenous Laser None Any Very high High High Poor Poor Low Low\n15\nTable 4 Size parameters used in heat source model.\nProcess a (mm)\n(Half width of weld\npool)\ncf (mm)\n(Size of weld pool in\nfront of arc)\ncb (mm)\n(Size of weld pool\nbehind arc)\nGMAW 6 9 18\nPulsed GMAW 6 6 21\nCMT 5 7 14\nHybrid Laser 3.5 5 15\nAutogenous\nLaser\n1 1 1\nTable 5 Assumed room temperature yield strength for the different welding processes.\nWelding\nProcess\nAverage Weld Metal\nHardness (HV 0.2)\nApproximate Tensile\nStrength (MPa)\nApproximate Yield\nStrength (MPa)\nGMAW 224 715 451\nPulsed\nGMAW 234 785 495\nCMT 226 738 465\nHybrid Laser 258 820 517\nAutogenous\nLaser 414 1390 876\nTable 6 Weld efficiency and convective heat transfer coefficients used in numerical model.\nWelding Process Weld Efficiency (%)\nConvective Heat Transfer Coefficient (W\nm-2K-1)\nGMAW 70 100\nPulsed GMAW 58 20\nCMT 90 20\nHybrid Laser 72 90\nAutogenous Laser 70 80\nFig. 1 Str\nstresses a\nFig. 2 Cla\nWeld pool or nugget Tensile stress due tothermal contractiona\nb\nCom16\nesses near a typical weld: (a) thermal stresses during and (b) longitudinal residual\nfter welding.\nmping arrangement for plates.\nIsotherms\nV\nCompressive stress due\nto thermal expansion\nTMAX\nLongitudinal\nresidual stress\n(after cooling)\nDistance from\nweld centerline\nTensile\npressive\nFig. 3\n0\n1\n2\n3\n4\n5\n6\n7\nD\nis\nto\nrt\nio\nn\nIn\nde\nx\n(m\nm\n)\nFu\nsi\non\nZ\non\ne\nA\nre\na\n(m\nm\n2 )\nFig.\nthe h\n0 50\n150\n200\n300\n400\n500\n0\n10\n20\nLocation of\nweld\na\nb10017\nMeasured distortion profile for SAW\n0 0.2 0.4 0.6 0.8 1\nHeat Input (kJ\/mm)\nDC GMAW\nSAW\nPulsed GMAW\nCMT\nHybrid Laser\nAutogenous\nLaser\n0\n10\n20\n30\n40\n50\n60\n0 0.2 0.4 0.6 0.8 1\nHeat Input (kJ\/mm)\nSAW\nDC GMAW\nPulsed GMAW\nCMT\nHybrid Laser\nAutogenous Laser\n4 (a) Distortion index (trend line for textbook efficiencies) and (b) fusion zone area vs.\neat input.\n200 2500\n100 Plate Length (mm)Plate Width (mm)\n2 4 6 8 10 12\n0 2 4 6 8 10 12\nDistortion (mm)\n18\n0\n50\n100\n150\n200\n250\n300\n350\n400\n450\n0 5 10 15 20 25 30 35 40 45 50 55 60 65\nDistance From Weld Centerline (mm)\nPe\nak\nT\nem\npe\nra\ntu\nre\n(o\nC\n)\nSAW\nDC GMAW\nPulsed GMAW\nCMT\nHybrid Laser\nAutogenous Laser\n-200\n-100\n0\n100\n200\n300\n400\n500\n-50 -30 -10 10 30 50\nDistance from Weld Centreline (mm)\nSt\nre\nss\n(M\nPa\n)\nSAW\nDC GMAW\nPulsed GMAW\nCMT\nHybrid Laser\nAutogenous Laser\n0\n50\n100\n150\n200\n250\n300\n350\n400\n450\nH\nV\nSAW DC GMAW\nPulsed GMAW CMT\nHybrid Laser Autogenous Laser\nBase\nMaterial HAZ Weld Metal HAZ\nBase\nMaterial\nFig. 5 Comparison of (a) peak temperature, (b) longitudinal residual stress, and (c) hardness\nbetween the different welding processes.\na\nb\nc\nFig. 6 Division of thermal solution fo\nFig. 7 Definition of coordinate system\n-100\n100\n300\n500\n700\n900\n1100\n0 5 10 15 2\nDistance from We\nR\nes\nid\nua\nlS\ntr\nes\ns(\nM\nPa\n)\nFig. 8 Predicted longitudinal residua\nz\ny\ncb\ncf19\nr sequential stress analysis.\nand coefficients used for heat source.\n0 25 30 35 40\nld Centerline (mm)\nDC GMAW\nPulsed GMAW\nCMT\nHybrid laser\nAutogenous Laser\nl stress.\nx\na\nb\nx\nz\ny\n20\n0\n0.5\n1\n1.5\n2\n2.5\n3\n3.5\n4\n4.5\n5\n0 5 10 15 20 25 30 35 40\nApplied Weld Load (kN)\nD\nis\nto\nrt\nio\nn\nIn\nde\nx\n(m\nm\n)\nDC GMAW\nPulsed GMAW\nCMT\nHybrid LaserAutogenous\nLaser\nFig. 9 Correlation between the distortion index and the AWL.\n500 SAW\nDC GMAW-200\n-100\n0\n100\n200\n300\n400\n-50 -30 -10 10 30 50\nDistance from Weld Centreline (mm)\nSt\nre\nss\n(M\nPa\n)\nPulsed GMAW\nCMT\nHybrid Laser\nAutogenous Laser\na21\n-200\n0\n200\n400\n600\n800\n1000\n1200\n0 5 10 15 20 25 30\nDistance from Weld Centreline (mm)\nSt\nre\nss\n(M\nPa\n)\nDC GMAW (Model)\nPulsed GMAW (Model)\nCMT (Model)\nHybrid laser (Model)\nAutogenous Laser (Model)\nDC GMAW (Exp)\nPulsed GMAW (Exp)\nCMT (Exp)\nHybrid Laser (Exp)\nAutogenous Laser (Exp)\nFig. 10 (a) Longitudinal residual stress measured across the six samples and (b) comparison\nwith the model predictions.\nb\n"}