{"doi":"10.5194\/angeo-21-1553-2003","coreId":"11136","oai":"oai:eprints.lancs.ac.uk:35434","identifiers":["oai:eprints.lancs.ac.uk:35434","10.5194\/angeo-21-1553-2003"],"title":"Interhemispheric comparison of spectral width boundary as observed by the SuperDARN radars","authors":["Hosokawa, K.","Woodfield, E.E.","Lester, M.","Milan, S.E.","Sato, N.","Yukimatu, A.S.","Iyemori, T."],"enrichments":{"references":[{"id":761096,"title":"A new magnetic coordinate system for conjugate studies of high latitudes,","authors":[],"date":"1989","doi":"10.1029\/ja094ia07p09139","raw":"Baker, K. B. and Wing, S.: A new magnetic coordinate system for conjugate studies of high latitudes, J. Geophys. Res., 94, 9139, 1989.","cites":null},{"id":771395,"title":"A.: A magnetospheric magnetic ﬁeld model with a warped tail current sheet,","authors":[],"date":"1989","doi":"10.1016\/0032-0633(89)90066-4","raw":"Tsyganenko, N. A.: A magnetospheric magnetic ﬁeld model with a warped tail current sheet, Planet. Space Sci., 37, 5, 1989. Woch, J.andLundin, R.: Magnetosheathplasmaprecipitationinthe polar cusp and its control by the interplanetary magnetic ﬁeld, J.","cites":null},{"id":772200,"title":"A.: A statistical study of the location and motion of the HF radar cusp,","authors":[],"date":"2002","doi":"10.5194\/angeo-20-275-2002","raw":"Yeoman, T. K., Hanlon, P. G., and McWilliams, K. A.: A statistical study of the location and motion of the HF radar cusp, Ann. Geophysicae, 20, 275, 2002.","cites":null},{"id":771942,"title":"An evaluation of range accuracy in the Super Dual Auroral Radar Network over-the-horizon HF radar systems,","authors":[],"date":"2001","doi":"10.1029\/2000RS002558","raw":"Yeoman, T. K., Wright, D. M., Stocker, A. J., and Jones, T. B.: An evaluation of range accuracy in the Super Dual Auroral Radar Network over-the-horizon HF radar systems, Radio Sci., 36, 801, 2001.","cites":null},{"id":770432,"title":"Auroral activity associated with unsteady magnetospheric erosion:","authors":[],"date":"1990","doi":"10.1029\/97ja01317","raw":null,"cites":null},{"id":763832,"title":"Auroral boundary variations and the interplanetary magnetic ﬁeld,","authors":[],"date":"1984","doi":"10.1016\/0032-0633(84)90038-2","raw":"Holzworth, R. H. and Meng, C.-I.: Auroral boundary variations and the interplanetary magnetic ﬁeld, Planet. Space Sci., 32, 25, 1984.K. Hosokawa et al.: Interhemispheric comparison of spectral width boundary 1565 Hosokawa, K., Woodﬁeld, E. E., Lester, M., Milan, S. E., Sato, N., Yukimatu, A. S., and Iyemori, T.: Statistical characteristics of spectral width as observed by the conjugate SuperDARN radars, Ann. Geophysicae, 20, 1213, 2002.","cites":null},{"id":16418844,"title":"Auroralactivityassociatedwithunsteadymagnetospheric erosion:","authors":[],"date":"1990","doi":"10.1029\/97ja01317","raw":"Sandholt, P. E., Farrugia, C. J., Oieroset, M., Stauning, P., and Denig, W.F.: Auroralactivityassociatedwithunsteadymagnetospheric erosion: observations on 19 December 1990, J. Geophys. Res., 103, 2309, 1998.","cites":null},{"id":16418788,"title":"C.I.: Dipoletiltangleeffectsonthelatitude of the cusp and cleft\/low-latitude boundary layer,","authors":[],"date":"1989","doi":"10.1029\/ja094ia06p06949","raw":"Newell, P.T.andMeng, C.I.: Dipoletiltangleeffectsonthelatitude of the cusp and cleft\/low-latitude boundary layer, J. Geophys. Res., 94, 6949, 1989.","cites":null},{"id":16418289,"title":"C.J.: Meridian-scanningphotometer, coherentHF radar, and magnetometer observation of the cusp : a case study,","authors":[],"date":"1999","doi":"10.1007\/s005850050746","raw":"Milan, S. E., Lester, M., Cowley, S. W. H., Moen, J., Sandholt, P. E., andOwen, C.J.: Meridian-scanningphotometer, coherentHF radar, and magnetometer observation of the cusp : a case study, Ann. Geophysicae, 17, 159, 1999.","cites":null},{"id":771227,"title":"Conjugate auroras and the interplanetary magnetic ﬁeld,","authors":[],"date":"1997","doi":"10.1029\/96ja03563","raw":"Stenbaek-Nielsen, H. C. and Otto, A.: Conjugate auroras and the interplanetary magnetic ﬁeld, J. Geophys. Res., 102, 2223, 1997.","cites":null},{"id":768557,"title":"Conjugate observations of the day-side reconnection electric ﬁeld: A GEM boundary layer campaign,","authors":[],"date":"1999","doi":"10.1007\/s005850050773","raw":"Pinnock, M., Rodger, A. S., Baker, K. B., Lu, G., and Hairston, M.: Conjugate observations of the day-side reconnection electric ﬁeld: A GEM boundary layer campaign, Ann. Geophysicae, 17, 443, 1999.","cites":null},{"id":762842,"title":"DARN\/SuperDARN: A global view of high-latitude convection,","authors":[],"date":"1995","doi":"10.1007\/bf00751350","raw":"Greenwald, R. A., Baker, K. B., Dudeney, J. R., Pinnock, M., Jones, T. B., Thomas, E. C., Villain, J.-P., Cerisier, J.-C, Senior, C., Hanuise, C., Hunsucker, R. D., Sofko, G., Koehler, J., Nielsen, E., Pellinen, R., Walker, A. D. M., Sato, N., and Yamagishi, H.: DARN\/SuperDARN: A global view of high-latitude convection, Space Sci. Rev., 71, 763, 1995.","cites":null},{"id":769414,"title":"Dawn-dusk (y) component of the interplanetary magnetic field and the local time of the Harang discontinuity,","authors":[],"date":"1984","doi":"10.1016\/0032-0633(84)90058-8","raw":null,"cites":null},{"id":16418822,"title":"Dawn-dusk(y)componentoftheinterplanetary magnetic ﬁeld and the local time of the Harang discontinuity,","authors":[],"date":"1984","doi":"10.1016\/0032-0633(84)90058-8","raw":"Rodger, A. S., Cowley, S. W. H., Brown, M. J., Pinnock, M., and Simmons, D.A.: Dawn-dusk(y)componentoftheinterplanetary magnetic ﬁeld and the local time of the Harang discontinuity, Planet. Space Sci., 8, 1021, 1984.","cites":null},{"id":762625,"title":"Dependence of convective ﬂows and particle precipitation in the high-latitude ionosphere on the X and Y components of the interplanetary magnetic ﬁeld,","authors":[],"date":"1991","doi":"10.1029\/90ja02063","raw":"Cowley, S. W. H., Morelli, J. P., and Lockwood, M.: Dependence of convective ﬂows and particle precipitation in the high-latitude ionosphere on the X and Y components of the interplanetary magnetic ﬁeld, J. Geophys. Res., 96, 5557, 1991.","cites":null},{"id":768062,"title":"Dipole tilt angle effects on the latitude of the cusp and cleft\/low-latitude boundary layer,","authors":[],"date":"1989","doi":"10.1029\/JA094iA06p06949","raw":null,"cites":null},{"id":16418267,"title":"Dynamics of auroral belt and polargeomagneticdisturbance,","authors":[],"date":"1967","doi":"10.1016\/0032-0633(67)90190-0","raw":"Feldstein, Y. I. and Starkov, G. V.: Dynamics of auroral belt and polargeomagneticdisturbance, Planet.SpaceSci., 15, 209, 1967.","cites":null},{"id":765801,"title":"Electric ﬁeld ﬂuctuations and charged particle precipitation in the cusp,","authors":[],"date":"1993","doi":"10.1029\/92ja01791","raw":"Matsuoka, A., Tsuruda, K., Hayakawa, H., Mukai, T., Nishida, A., Okada, T., Kaya, N., and Fukunishi, H.: Electric ﬁeld ﬂuctuations and charged particle precipitation in the cusp, J. Geophys. Res., 98, 11225, 1993.","cites":null},{"id":16418264,"title":"Electron polar cap and the boundary of open geomagnetic ﬁeld lines,","authors":[],"date":"1972","doi":"10.1029\/ja077i028p05580","raw":"Evans, L. C. and Stone, E. C.: Electron polar cap and the boundary of open geomagnetic ﬁeld lines, J. Geophys. Res., 77, 5580, 1972.","cites":null},{"id":16418241,"title":"Excitation and decay of solar wind driven ﬂows in the magnetosphere-ionosphere system,","authors":[],"date":"1992","doi":"10.1016\/0273-1177(95)00972-8","raw":"Cowley, S. W. H. and Lockwood, M.: Excitation and decay of solar wind driven ﬂows in the magnetosphere-ionosphere system, Ann. Geophysicae, 10, 103, 1992.","cites":null},{"id":16418249,"title":"Ground observations and possible source regions of two types of Pc1-2 micropulsation at very high latitudes,","authors":[],"date":"1997","doi":"10.1029\/97ja02191","raw":"Dyrud, L. P., Engebretson, M. J., Posh, J. L., Hughes, W. J., Fukunishi, H., Arnoldy, R. L., Newell, P. T., and Horne, R. B.: Ground observations and possible source regions of two types of Pc1-2 micropulsation at very high latitudes, J. Geophys. Res., 102, 27011, 1997.","cites":null},{"id":769952,"title":"Ground-based imaging of magnetospheric boundaries,","authors":[],"date":"2000","doi":"10.1016\/s0273-1177(99)00657-2","raw":"Rodger, A. S.: Ground-based imaging of magnetospheric boundaries, Adv. Space Res., 25, 1461, 2000.","cites":null},{"id":761587,"title":"HF radar observations of the dayside magnetic merging rate: A Geospace Environment Modeling boundary layer campaign study,","authors":[],"date":"1997","doi":"10.1029\/97ja00288","raw":"Baker, K. B., Rodger, A. S., and Lu, G.: HF radar observations of the dayside magnetic merging rate: A Geospace Environment Modeling boundary layer campaign study, J. Geophys. Res., 102, 9603, 1997.","cites":null},{"id":766286,"title":"Identiﬁcation of the magnetospheric cusp and cleft using Pc1-2 ULF pulsations,","authors":[],"date":"1992","doi":"10.1016\/0021-9169(92)90069-w","raw":"Menk, F. W., Fraser, B. J., Hansen, H. J., Newell, P. T., Meng, C.-I., and Morris, R. J.: Identiﬁcation of the magnetospheric cusp and cleft using Pc1-2 ULF pulsations, J. Atmos. Terr. Phys., 54, 1021, 1992.","cites":null},{"id":769126,"title":"IMF By -dependent plasma flow and Birkeland currents in the dayside magnetosphere 2. A global model for northward and southward IMF,","authors":[],"date":"1985","doi":"10.1029\/JA090iA02p01595","raw":null,"cites":null},{"id":16418820,"title":"IMF By-dependent plasma ﬂow and Birkeland currents in the dayside magnetosphere 2. A global model for northward and southward IMF,","authors":[],"date":"1985","doi":"10.1029\/ja090ia02p01595","raw":"Reiff, P. H. and Burch, J. L.: IMF By-dependent plasma ﬂow and Birkeland currents in the dayside magnetosphere 2. A global model for northward and southward IMF, J. Geophys. Res., 90, 1595, 1985.","cites":null},{"id":766538,"title":"Initial Backscatter occurrence statistics from the CUTLASS HF radars,","authors":[],"date":"1997","doi":"10.1007\/s005850050486","raw":"Milan, S. E., Yeoman, T. K., Lester, M., Thomas, E. C., and Jones, T. B.: Initial Backscatter occurrence statistics from the CUTLASS HF radars, Ann. Geophysicae, 15, 703, 1997.","cites":null},{"id":766018,"title":"Intense, variable electric ﬁelds at ionospheric altitudes in the high latitude regions as observed by DE-2,","authors":[],"date":null,"doi":"10.1029\/gl009i009p00981","raw":"Maynard, N. C., Heppner, J. P., and Egeland, A.: Intense, variable electric ﬁelds at ionospheric altitudes in the high latitude regions as observed by DE-2, Geophys. Res. Lett., 9, 981, 1982.","cites":null},{"id":770865,"title":"Inter-hemispheric contrasts in the ionospheric convection response to changes in the interplanetary magnetic ﬁeld and substorm activity: a case study,","authors":[],"date":"1998","doi":"10.1007\/s00585-998-0764-8","raw":"Shand, B. A., Yeoman, T. K., Lewis, R. V., Greenwald, R. A., and Hairston, M. R.: Inter-hemispheric contrasts in the ionospheric convection response to changes in the interplanetary magnetic ﬁeld and substorm activity: a case study, Ann. Geophysicae, 16, 764, 1998.","cites":null},{"id":764112,"title":"Interhemispheric comparison of spectral width boundary 1565","authors":[],"date":"2002","doi":"10.5194\/angeo-21-1553-2003","raw":null,"cites":null},{"id":767242,"title":"Interhemispheric differences in the HF radar signature of the cusp region: A review through the study of a case example, Adv. Polar Upper Atmos.","authors":[],"date":"2001","doi":null,"raw":"Milan, S. E. and Lester, M.: Interhemispheric differences in the HF radar signature of the cusp region: A review through the study of a case example, Adv. Polar Upper Atmos. Res., 15, 159, 2001.","cites":null},{"id":771890,"title":"Interhemispheric observation of nightside ionospheric electric ﬁelds in response to IMF Bz and By changes and substorm pseudobreakup,","authors":[],"date":"2000","doi":"10.1007\/s00585-000-0897-x","raw":"Yeoman, T. K., Lewis, R. V., Khan, H., Cowley, S. W. H., and Ruohoniemi, J. M.: Interhemispheric observation of nightside ionospheric electric ﬁelds in response to IMF Bz and By changes and substorm pseudobreakup, Ann. Geophysicae, 18, 897, 2000.","cites":null},{"id":768307,"title":"Ion acceleration at the equatorward edge of the cusp: low-altitude observations of patchy merging,","authors":[],"date":"1991","doi":"10.1029\/91GL02088","raw":"Newell, P. T. and Meng, C. I.: Ion acceleration at the equatorward edge of the cusp: low-altitude observations of patchy merging, Geophys. Res. Lett., 18, 1829, 1991.","cites":null},{"id":16418246,"title":"L.A.: Theasymmetricsubstormexpansion phase (abstract),","authors":[],"date":"1996","doi":null,"raw":"Craven, J.D.andFrank, L.A.: Theasymmetricsubstormexpansion phase (abstract), EOS Trans. AGU, 77(17), Spring Meet. Suppl., 252, 1996.","cites":null},{"id":16418233,"title":"Magnetospheric asymmetries associated with the","authors":[],"date":"1981","doi":"10.1016\/0032-0633(81)90141-0","raw":"Cowley, S. W. H.: Magnetospheric asymmetries associated with the Y-component of the IMF, Planet. Space Sci., 29, 79, 1981.","cites":null},{"id":762365,"title":"Magnetospheric asymmetries associated with the Y -component of the IMF,","authors":[],"date":"1981","doi":"10.1016\/0032-0633(81)90141-0","raw":null,"cites":null},{"id":770737,"title":"Mapping the outer LLBL with SuperDARN double-peaked spectra,","authors":[],"date":"1997","doi":"10.1029\/97gl53304","raw":"Schifﬂer, A., Sofko, G., Newell, P. T., and Greenwald, R. A.: Mapping the outer LLBL with SuperDARN double-peaked spectra, Geophys. Res. Lett., 24, 3149, 1997.","cites":null},{"id":767016,"title":"Meridian-scanning photometer, coherent HF radar, and magnetometer observation of the cusp : a case study,","authors":[],"date":"1999","doi":"10.1007\/s005850050746","raw":null,"cites":null},{"id":765550,"title":"Observation of two complete substorm cycles during the Cassini Earth swing-by: Cassini magnetometer data in a global context,","authors":[],"date":"2002","doi":"10.1029\/2001ja900049","raw":"Khan, H., Cowley, S. W. H., Kolesnikova, E., Lester, M., Brittnacher, M. J., Hughes, T. J., Hughes, W. J., Kurth, W. S., McComas, D. J., Newitt, L., Owen, C. J., Reeves, G. D., Singer, H. J., Smith, C. W., Southwood, D. J., and Wattermann, J. F.: Observation of two complete substorm cycles during the Cassini Earth swing-by: Cassini magnetometer data in a global context, J. Geophys. Res., in press, 2002. Lockwood, M.: Relationship of dayside auroral precipitations to the open-closed separatrix and the pattern of convective ﬂow, J.","cites":null},{"id":765295,"title":"Observations of the response time of high-latitude ionospheric convection to variations in the interplanetary magnetic ﬁeld using EISCAT and IMP-8 data,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-1306-8","raw":"Khan, H. and Cowley, S. W. H.: Observations of the response time of high-latitude ionospheric convection to variations in the interplanetary magnetic ﬁeld using EISCAT and IMP-8 data, Ann. Geophysicae, 17, 1306, 1999.","cites":null},{"id":767723,"title":"On the collocation between dayside auroral activity and coherent HF radar backscatter,","authors":[],"date":"2001","doi":"10.1007\/s005850000302","raw":"Moen, J., Carlson, C., Milan, S.E., Shumilov, N., Lybekk, B., Sandholt, P. E., and Lester, M.: On the collocation between dayside auroral activity and coherent HF radar backscatter, Ann. Geophysicae, 18, 1531, 2001.","cites":null},{"id":760837,"title":"On the factors conditioning the Doppler spectral width determined from SuperDARN HF radars,","authors":[],"date":null,"doi":"10.5194\/angeo-20-1769-2002","raw":"Andr´ e, R., Pinnock, M., Villain, J.-P., and Hanuise, C.: On the factors conditioning the Doppler spectral width determined from SuperDARN HF radars, Int. J. Geomagn. Aeron., 2, 77, 2000a. Andr´ e, R., Pinnock, M., and Rodger, A. S.: Identiﬁcation of the low-altitude cusp by Super Dual Auroral Radar Network radars: A physical explanation for the empirically derived signature, J.","cites":null},{"id":760593,"title":"On the SuperDARN autocorrelation function observed in the ionospheric cusp,","authors":[],"date":"1999","doi":"10.1029\/1999gl003658","raw":"Andr´ e, R., Pinnock, M., and Rodger, A. S.: On the SuperDARN autocorrelation function observed in the ionospheric cusp, Geophys. Res. Lett., 26, 3353, 1999.","cites":null},{"id":770982,"title":"Polar cap inﬂation and deﬂation,","authors":[],"date":"1985","doi":"10.1029\/ja090ia01p00543","raw":"Siscoe, G. L. and Huang, T. S.: Polar cap inﬂation and deﬂation, J. Geophys. Res., 90, 543, 1985.","cites":null},{"id":763366,"title":"Precipitating electron and ion detectors (SSJ\/4) for the block 5D\/Flights 6-10 DMSP satellites: calibration and data presentation,","authors":[],"date":"1984","doi":null,"raw":"Hardy, D. A., Schmitt, L. K., Gussenhoven, M. S., Marshall, F. J., Yeh, H. C., Schumaker, T. L., Huber, A., and Pantazis, J.: Precipitating electron and ion detectors (SSJ\/4) for the block 5D\/Flights 6-10 DMSP satellites: calibration and data presentation, Rep. AFGL-TR-84-0317, Air Force Geophysics Laboratory, Hanscom AFB, Mass., 1984.","cites":null},{"id":761810,"title":"Separation of multiple echoes using a high resolution spectral analysis","authors":[],"date":"1998","doi":"10.1029\/98rs00714","raw":"Barthes, L., Andr´ e, R., Cerisier, J.-C., and Villain, J.-P.: Separation of multiple echoes using a high resolution spectral analysis in SuperDARN HF radars, Radio Sci., 33, 1005, 1998.","cites":null},{"id":761355,"title":"Simultaneous HF radar and DMSP observation of the cusp,","authors":[],"date":"1990","doi":"10.1029\/gl017i011p01869","raw":"Baker, K. B., Greenwald, R. A., Ruohoniemi, J. M., Dudeney, J. R., Pinnock, M., Newell, P. T., Greenspan, M. E., and Meng, CI.: Simultaneous HF radar and DMSP observation of the cusp, Geophys. Res. Lett., 17, 1869, 1990 Baker, K. B., Dudeney, J. R., Greenwald, R. A., Pinnock, M., Newell, P. T., Rodger, A. S., Mattin, N., and Meng, C.-I.: HFradar signatures of the cusp and low latitude boundary layer, J.","cites":null},{"id":771642,"title":"Simultaneous observation of the cusp in optical,","authors":[],"date":"1997","doi":"10.1029\/97gl02072","raw":"Yeoman, T. K., Lester, M., Cowley, S. W. H., Milan, S. E., Moen, J., and Sandholt, P. E.: Simultaneous observation of the cusp in optical, DMSP and HF radar data, Geophys. Res. Lett., 24, 2251, 1997.","cites":null},{"id":769643,"title":"Simultaneous optical and HF radar observations of the ionospheric cusp,","authors":[],"date":null,"doi":"10.1029\/95GL01797","raw":"Rodger, A. S., Mende, S. B., Rosenberg, T. J., and Baker, K. B.: Simultaneous optical and HF radar observations of the ionospheric cusp, Geophys. Res. Lett., 22, 2045, 1995.","cites":null},{"id":764608,"title":"Small-scale vortices in the high-latitude F-region,","authors":[],"date":"2000","doi":"10.1029\/1999ja000417","raw":"Huber, M. and Sofko, G.: Small-scale vortices in the high-latitude F-region, J. Geophys. Res., 105, 20885, 2000.","cites":null},{"id":768848,"title":"Solar wind plasma injection at the dayside magnetospheric cusp,","authors":[],"date":"1977","doi":"10.1029\/JA082i004p00479","raw":"Reiff, P. H., Hill, T. W., and Burch, J. L.: Solar wind plasma injection at the dayside magnetospheric cusp, J. Geophys. Res., 82, 479, 1977.","cites":null},{"id":770158,"title":"Substorm intensiﬁcations and ﬁeld line resonances in the nightside magnetosphere,","authors":[],"date":"1992","doi":"10.1029\/91ja03156","raw":"Samson, J. C., Wallis, D. D., Hughes, T. J., Creutzberg, F., Ruohoniemi, J. M., and Greenwald, R. A.: Substorm intensiﬁcations and ﬁeld line resonances in the nightside magnetosphere, J. Geophys. Res., 97, 8495, 1992.","cites":null},{"id":767752,"title":"The cusp and the cleft\/boundary layer: Low-altitude identiﬁcation and statistical local time variation,","authors":[],"date":"1988","doi":"10.1029\/JA093iA12p14549","raw":"Newell, P. T. and Meng, C. I.: The cusp and the cleft\/boundary layer: Low-altitude identiﬁcation and statistical local time variation, J. Geophys. Res., 93, 14549, 1988.","cites":null},{"id":766774,"title":"The dayside auroral zone as a hard target for coherent HF radars,","authors":[],"date":"1998","doi":"10.1029\/98gl02781","raw":"Milan, S. E., Yeoman, T. K., and Lester, M.: The dayside auroral zone as a hard target for coherent HF radars, Geophys. Res. Lett., 25, 3717, 1998.","cites":null},{"id":762361,"title":"The ionospheric footprint of antiparallel merging regions on the dayside magnetopause,","authors":[],"date":"2000","doi":"10.1007\/s00585-000-0511-2","raw":"Coleman, I. J., Pinnock, M., Rodger, A. S.: The ionospheric footprint of antiparallel merging regions on the dayside magnetopause, Ann. Geophysicae, 18, 511, 2000.","cites":null},{"id":769886,"title":"The ionospheric response to flux transfer events: the first few minutes,","authors":[],"date":"1997","doi":"10.1007\/s00585-997-0685-y","raw":null,"cites":null},{"id":16418829,"title":"The ionospheric response to ﬂux transferevents: theﬁrstfewminutes,","authors":[],"date":"1997","doi":null,"raw":"Rodger, A. S. and Pinnock, M.: The ionospheric response to ﬂux transferevents: theﬁrstfewminutes, Ann.Geophysicae, 15, 685, 1997.","cites":null},{"id":762079,"title":"The response of the HF radar spectral width boundary to a switch in the IMF By directions: Ionospheric consequence of transient dayside reconnection?,","authors":[],"date":"2001","doi":"10.1029\/2000ja900094","raw":"Chisham, G., Pinnock, M., and Rodger, A. S.: The response of the HF radar spectral width boundary to a switch in the IMF By directions: Ionospheric consequence of transient dayside reconnection?, J. Geophys. Res., 106, 191, 2001.","cites":null},{"id":767510,"title":"Variations in polar cap area during two substorm cycles, submitted to Ann. Geophysicae,","authors":[],"date":"2002","doi":"10.5194\/angeo-21-1121-2003","raw":"Milan, S. E., Lester, M., Cowley, S. W. H., Oksavik, K., Brittnacher, M., Greenwald, R. A., Sofko, G., and Villain, J.-P.: Variations in polar cap area during two substorm cycles, submitted to Ann. Geophysicae, 2002.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-07","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/11136.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/35434\/1\/art_914.pdf","pdfHashValue":"54af3ee700ea0741196c0cf1df5d8198c49266a5","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35434<\/identifier><datestamp>\n      2018-01-24T03:07:58Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Interhemispheric comparison of spectral width boundary as observed by the SuperDARN radars<\/dc:title><dc:creator>\n        Hosokawa, K.<\/dc:creator><dc:creator>\n        Woodfield, E.E.<\/dc:creator><dc:creator>\n        Lester, M.<\/dc:creator><dc:creator>\n        Milan, S.E.<\/dc:creator><dc:creator>\n        Sato, N.<\/dc:creator><dc:creator>\n        Yukimatu, A.S.<\/dc:creator><dc:creator>\n        Iyemori, T.<\/dc:creator><dc:subject>\n        Q Science (General)<\/dc:subject><dc:date>\n        2003-07<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/35434\/1\/art_914.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-21-1553-2003<\/dc:relation><dc:identifier>\n        Hosokawa, K. and Woodfield, E.E. and Lester, M. and Milan, S.E. and Sato, N. and Yukimatu, A.S. and Iyemori, T. (2003) Interhemispheric comparison of spectral width boundary as observed by the SuperDARN radars. Annales Geophysicae, 21 (7). pp. 1553-1565. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35434\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-21-1553-2003","http:\/\/eprints.lancs.ac.uk\/35434\/"],"year":2003,"topics":["Q Science (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Annales Geophysicae (2003) 21: 1553–1565 c© European Geosciences Union 2003\nAnnales\nGeophysicae\nInterhemispheric comparison of spectral width boundary as\nobserved by SuperDARN radars\nK. Hosokawa1, E. E. Woodfield2, M. Lester2, S. E. Milan2, N. Sato3, A. S. Yukimatu3, and T. Iyemori4\n1Department of Geophysics, Graduate School of Science, Kyoto University, Kyoto, Japan\n2Department of Physics and Astronomy, University of Leicester, Leicester, UK\n3National Institute of Polar Research, Tokyo, Japan\n4Data Analysis Center for Geomagnetism and Space Magnetism, Graduate School of Science, Kyoto University, Kyoto, Japan\nReceived: 30 April 2002 – Revised: 15 January 2003 – Accepted: 6 February 2003\nAbstract. Previous studies have shown that dayside equa-\ntorward edge of coherent HF radar backscatter having broad\nDoppler spectral width is coincident with the equatorward\nedge of the cusp particle precipitation. This enables the\nboundary between broad and narrow spectral width backscat-\nters (spectral width boundary) in the dayside magnetic local\ntime sector to be used as a proxy for the open\/closed field\nline boundary. The present case study employs magnetically\nconjugate SuperDARN coherent HF radars to make an inter-\nhemispheric comparison of the location and variation of the\nspectral width boundaries. Agreement between the magnetic\nlatitudes of the boundaries in both hemispheres is remark-\nable. Correlation coefficients between the latitudes of the\nboundaries are larger than 0.70. Temporal variation of the\nspectral width boundary follows the same equatorward trend\nin both hemispheres. This is consistent with the accumu-\nlation of open flux in the polar cap by dayside low-latitude\nmagnetopause reconnection, expected when IMF Bz is neg-\native. Boundaries in both hemispheres also exhibit short-\nlived poleward motions superposed on the general equator-\nward trend, which follows the onset of substorm expansion\nphase and a temporary northward excursion of IMF Bz dur-\ning substorm recovery phase. There is an interhemispheric\ndifference in response time to the substorm occurrence be-\ntween two hemispheres. The spectral width boundary in the\nSouthern Hemisphere starts to move poleward 10 min earlier\nthan that in the Northern Hemisphere. We discuss this differ-\nence in terms of interhemispheric asymmetry of the substorm\nbreakup region in the longitudinal direction associated with\nthe effect of IMF By .\nKey words. Ionosphere (ionosphere-magnetosphere inter-\nactions; plasma convection) – Magnetospheric physics (mag-\nnetopause, cusp, boundary layers)\nCorrespondence to: K. Hosokawa\n(hosokawa@kugi.kyoto-u.ac.jp)\n1 Introduction\nIt is very important for the study of magnetosphere-\nionosphere coupling processes to identify the location of the\nopen\/closed field line boundary (OCFLB) in the ionosphere.\nDetermining the OCFLB around the dayside ionosphere en-\nables us to estimate several geophysical parameters such as\n(1) the rate of reconnection at the magnetopause; (2) the size\nof polar cap; (3) the creation and destruction of open mag-\nnetic flux associated with the dayside and nightside recon-\nnection. In practice, however, the OCFLB can be difficult\nto locate in the ionosphere continuously. Although there are\na number of signatures that can be employed as proxies for\nthe OCFLB, some of these still require verification (Rodger,\n2000). Direct observations of cusp particle precipitation by\nlow-altitude spacecraft, such as DMSP (e.g. Newell and\nMeng, 1988, 1991), are most widely utilized as a proxy for\nthe OCFLB. The optical auroral signature triggered by the\ncusp particles precipitation has also been a good guide for\nthe identification of the OCFLB (Sandholt et al., 1998). The\ndayside auroral zone provides a good target for HF radars\n(Milan et al., 1998) and a relationship between the magneto-\nspheric cusp particle precipitation into the ionosphere and the\nHF radar backscatter from the ionospheric F-region has been\nreported by a number of authors (Baker et al., 1990, 1995;\nRodger et al., 1995; Yeoman et al., 1997). They demon-\nstrated that the equatorward edge of radar backscatter show-\ning broad Doppler spectral width is coincident with the equa-\ntorward edge of the cusp particle precipitation. The equator-\nward edge of the HF radar backscatter also appears to corre-\nspond closely to the equatorward edge of red line aurora and\nhence, the OCFLB (Rodger et al., 1995; Milan et al., 1999),\nthough it is possible that this relationship breaks down for\nnorthward IMF (Moen et al., 2001).\nPreviously, many papers have examined the spectral width\nboundary (boundary between broad and narrow spectral\nwidth), which is identical to the HF radar signatures of the\nOCFLB around the dayside ionosphere, through case stud-\nies (Baker et al., 1997; Chisham et al., 2001) and statistical\n1554 K. Hosokawa et al.: Interhemispheric comparison of spectral width boundary\nFig. 1. The map of the Northern Hemisphere showing the location of the CUTLASS Iceland East radar field-of-view (blue line) in geographic\ncoordinate system. Superimposed on this is the field-of-view of the SENSU Syowa East radar (orange line) as mapped onto the Northern\nHemisphere. Three beam pairs used in the interhemispheric comparison of the spectral width boundary are displayed on the fields-of-views\nof both radars. The beams that belong to the Iceland East are indicated as a blue line and those to the Syowa East as an orange line.\nanalysis (Yeoman et al., 2002). However, there have been\nonly a few simultaneous observations of the spectral width\nboundary using data from magnetic conjugate radars (Pin-\nnock et al., 1999; Milan and Lester, 2001). These authors\nassumed the spectral width boundary to be a proxy for the\ntrue OCFLB and estimated the dayside reconnection elec-\ntric field from the convection flow across the OCFLB. How-\never, they have not investigated in detail how the behavior of\nthe spectral width boundary is collocated between conjugate\nhemispheres and how the temporal variation of the bound-\nary is different between the two hemispheres. All of the\nprevious conjugate studies of spectral width employed the\ndata of Polar Anglo-American Conjugate Radar Experiment\n(PACE) radars located at Goose Bay, Canada, and Halley,\nAntarctica which are a part of SuperDARN chain (Green-\nwald et al., 1995). In contrast, we employed another mag-\nnetic conjugate radar pair in the SuperDARN chain which is\ncomposed of the Iceland East radar of the Cooperative U.K.\nTwin-Located Auroral Sounding System (CUTLASS) (Mi-\nlan et al., 1997) and Syowa East radar of Syowa-South and\nEast HF Radars of NIPR for SuperDARN (SENSU). We di-\nrectly compared the location and motion of the spectral width\nboundaries identified in magnetic conjugate ionospheres and\ninvestigated the degree of the interhemispheric collocation of\nthe spectral width boundaries. Furthermore, the factors con-\ntrolling the motion of the boundary, such as interplanetary\nmagnetic field variation and the occurrence of substorm have\nbeen examined in detail. Consequently, a significant inter-\nhemispheric difference in the response time to the occurrence\nof substorm expansion was identified.\n2 Experimental arrangement\nWe present the data from CUTLASS Iceland East radar at\nPykkibaer, Iceland (63.86◦ N; 19.20◦ W) and SENSU Syowa\nEast radar at Antarctica (69.01◦ S; 39.61◦ E). These radars\nare a part of the international Super Dual Auroral Radar\nNetwork (SuperDARN), which covers a vast portion of the\nnorthern and southern auroral zones and polar cap. The Su-\nperDARN coherent HF radars (Greenwald et al., 1995) em-\nploy backscatter from high-latitude field-aligned ionospheric\nplasma density irregularities as tracers of the bulk plasma\nmotion under the influence of the convection electric field,\nand hence, as a diagnostic tool for the investigation of large-\nscale magnetosphere-ionosphere coupling. Figure 1 presents\nthe fields-of-view of CUTLASS Iceland East and SENSU\nSyowa East mapped into the geographic coordinate system\nin the Northern Hemisphere. The conjugate fields-of-view\noverlap considerably and have very similar pointing direc-\ntions. This allows for an almost direct comparison of the\nbackscatter features observed by the two radars. On the day\npresented in this paper (10 October 1999), the radars were\noperating in a high time resolution normal scan mode. In\nthe current version of this mode, the radar scans through 16\nbeams every 1 min, with an integration time of 3 s for each\nbeam, which are binned into 75 range gates. We determined\nthree beam pairs that have nearly parallel conjugate beams\nand used them for this interhemispheric comparison. These\nconjugate beam pairs are shown in Fig. 1. Beam pair I is\ncomposed of Iceland East beam 0 and Syowa East beam 4,\nbeam pair II is Iceland East beam 7 and Syowa East beam\n6, beam pair III is Iceland East beam 10 and Syowa East\nK. Hosokawa et al.: Interhemispheric comparison of spectral width boundary 1555\nFig. 2. The latitude versus time spectral width plot for the beams of each conjugate beam pair during the period of the present study, from\n09:30 UT to 13:30 UT, 10 October 1999 (top panels) for beam 0, 3 and 6 of Iceland East in the Northern Hemisphere, (bottom panels) for\nbeam 4, 7 and 10 of Syowa East in the Southern Hemisphere. A white line in each panel presents the spectral width boundary estimated\nusing the algorithm described in the text.\nbeam 6. Coverage of these beam pairs at F-region altitude is\nranging approximately from 72◦ to 83◦ in magnetic latitude\naround the dayside magnetic local time sector. Beam pair I is\npointing closest to the magnetically meridional direction (the\nangle between the beam direction and the magnetic meridian\nis approximately 45◦), and hence, is most favorable for the\ndirect comparison of the latitudinal movement of the spectral\nwidth boundary.\n3 Observations\n3.1 Determining spectral width boundary\nFigure 2 displays the magnetic latitude (AACGM coordinate\nsystem, based on Baker and Wing, 1989) versus time spectral\nwidth plot for the beams of each conjugate beam pair I, II and\nIII during the interval of this study, 09:30 UT to 13:30 UT, 10\nOctober 1999. The spectral width is colour-coded and grey\nindicates backscatter from the ground. The top three pan-\nels show the observations from Iceland East in the North-\nern Hemisphere and the bottom three panels from Syowa\nEast in the Southern Hemisphere. During this UT period,\nthe fields-of-view of the two radars cover the magnetic lati-\ntudes ranging from the average latitude of the central plasma\nsheet (CPS) and low-latitude boundary layer (LLBL) to the\npolar cap through the cusp around the dayside ionosphere. In\neach scan, the broad spectral width region at higher latitudes\n(characterized by a mixture of the colours such as green,\nyellow and red) is clearly distinct from the narrow spectral\nwidth region at lower latitudes (characterized by an almost\nuniform blue appearance), and then well-defined boundaries\nbetween narrow and broad spectral width can be identified\nfor all beam pairs.\nIn order to compare the spectral width boundaries in two\nhemispheres, we need an algorithm that can identify the lo-\ncation of the boundaries. Previous studies have placed the\nboundary at the first range gate where the spectral width ex-\nceeds specific criteria, such as 150 m s−1 (Baker et al., 1997;\nPinnock et al., 1999) and 250 m s−1 (Chisham et al., 2001).\nThis approach is based on the occurrence distributions of the\nspectral widths within the cusp and the region equatorward\nof the cusp (such as the LLBL and the CPS, i.e. the re-\ngions of closed field lines) reported by Baker et al. (1995).\nThey pointed out that the occurrence distribution of spectral\nwidths within the cusp is a broad Gaussian shaped distribu-\ntion. The average spectral width is located around 220 m s−1,\nwith the majority of the spectra found in the range from\nabout 120 to 320 m s−1. In contrast, the distribution equa-\n1556 K. Hosokawa et al.: Interhemispheric comparison of spectral width boundary\nFig. 3. (Top panels) maps of spectral width observation by Iceland East on magnetic latitude and MLT coordinates for the time interval of\nDMSP satellite overpass. Dotted circles represent 60◦, 70◦ and 80◦ latitudes and radial dotted lines represent MLT meridians, 12:00 MLT\nbeing directed towards the top of the panel. Superimposed black line on white in each panel is the track of the overpassing DMSP satellite.\nWhite line on black represents the estimated location of the spectral width boundary and black point on white indicates the point where\nthe DMSP identified particle trapping boundary. (Bottom panels) Electron and ion measurements from the overpassing satellite. These are\nspectrograms between ≈ 10 eV and 30 keV. From these observations, particle trapping boundary have been identified, which are indicated as\na dashed line.\ntorward of the cusp is more similar to an exponential distri-\nbution with a peak occurring at about 50 m s−1. Hosokawa et\nal. (2002) have carried out a statistical analysis of the spec-\ntral width distribution obtained from Iceland East and Syowa\nEast. They have shown that 80% of spectral width values ob-\ntained within the non-cusp region are less than 200 m s−1 in\nboth radars. Hence, we have used 200 m s−1 as a criterion to\ndetermine the location of the spectral width boundary.\nAn algorithm is then employed which finds the first ap-\npearance (in increasing latitude) of two consecutive range\ncells where the spectral width is greater than or equal to\n200 m s−1. The boundary is then determined to be at the start\nof the first of these radar range cells. The result is temporally\nsmoothed (window for smoothing is 5 min, i.e. 5 samples)\nand plotted as a white on black line in each panel. Accu-\nracy of the backscatter location should be estimated before\ninvestigating the behavior of the boundaries in detail. Yeo-\nman et al. (2001) investigated simultaneous observation with\nthe CUTLASS radars and EISCAT Tromsoe heating facility\nand estimated potential error of the standard algorithm for\nthe determination of the backscatter location normally em-\nployed in the SuperDARN community. They found that the\naccuracy is within 60 km for one and a half hop ionospheric\nbackscatter. They also calculated the HF propagation path\nfrom the CUTLASS Iceland East radar for several elevation\nangles. During the interval of this study, the elevation angle\nis about 30◦ and the spectral width boundaries appear at ap-\nproximately 1000 km in slant range in Iceland East radar (fa-\ncility for angle of arrival determination has not been installed\nin Syowa East radar). If we refer to the propagation path esti-\nmated by Yeoman et al. (2001), echoes around the boundary\nare considered to be one and a half hop ionospheric backscat-\nter. Then, the accuracy could be estimated to be ±60 km in\nour observation, corresponding to 1.08◦ in latitude.\nIt is clear that the estimated spectral width boundary pro-\nvides a clear demarcation line between the narrow spectral\nwidth region at lower latitudes and the broad spectral width\nregion at higher latitudes. One thing worth noting is that the\nmain part of the narrow spectral width echoes equatorward\nof the boundaries are not ground scatter; hence, the bound-\naries identified here are not between different scattering tar-\ngets, e.g. ground and ionospheric scatter. The spectral width\nboundary is located at magnetic latitudes between approxi-\nmately −69.5◦ and −75.0◦ in the Southern Hemisphere, and\nbetween 69.0◦ and 75.5◦ in the Northern Hemisphere. The\naverage latitudes of the boundaries are very similar between\nK. Hosokawa et al.: Interhemispheric comparison of spectral width boundary 1557\nthe two hemispheres. We return to a more detailed analysis\nlater in this paper.\n3.2 Low-latitude particle precipitation\nIn the course of this study, we investigate the interhemi-\nspheric similarity and difference in the location of the day-\nside OCFLB using the radar spectral width boundary as a\nproxy. The spectral width boundary in the radar data has\nbeen widely used as a proxy for the OCFLB in recent pa-\npers, although its validity has not been so well established.\nHence, the boundaries identified here have to be calibrated\nusing other proxies for the OCFLB. There are a number\nof signatures which can be employed as proxies for the\nOCFLB (Rodger, 2000). The most popular one is the trap-\nping boundary of the high energy (≈10 keV) particle pre-\ncipitation (Evans and Stone, 1972). Here, we employ three\noverpasses of the Defense Meteorological Satellite Program\nDMSP F12 and F14 satellite (Hardy et al., 1984) and esti-\nmate the validity for using the spectral width boundary as a\nproxy for the true OCFLB. The data from the DMSP space-\ncraft are available only in the Northern Hemisphere during\nthis interval.\nThe results of the comparison are summarized in Fig. 3.\nThe top three panels display the maps of the spectral\nwidth observation by CUTLASS Iceland East radar for three\nDMSP overpasses at 09:33 UT, 09:49 UT and 11:16 UT, re-\nspectively. The bottom three panels show energy spectro-\ngrams of electrons (upper) and ions (lower) observed by the\nDMSP F12 and F14 satellite as they traversed the radar field-\nof-view. As the satellite approaches the noon sector, a dis-\npersed ion feature is commonly observed in all overpasses.\nSuch features are characteristic of precipitation on newly-\nreconnected field lines for southward IMF (e.g. Reiff et al.,\n1977; Woch and Lundin, 1992), the dispersion being a conse-\nquence of the velocity filter effect. The lower latitude cutoff\nof this ion feature provides a sharp demarcation between high\nand low fluxes of high energy (>10 keV) particles, which is\nconsidered to be a trapping boundary. Dashed lines in the\nspectrograms indicate the trapping boundary as identified by\nthe DMSP satellites. Black points on the spacecraft overpass\nin the polar map give the location of the spacecrafts when\nthey identify the trapping boundary. White on black lines\nin the polar map indicate the latitude of the spectral width\nboundary identified for each scan of the radar.\nIn all overpasses, spectral width boundaries exhibit L-\nshell aligned variation with longitude. Although not shown\nhere, in the Southern Hemisphere the variation of the spectral\nwidth boundary with longitude is also L-shell aligned. How-\never, the spectral width boundary is located slightly poleward\nof the particle trapping boundary, with the offset being 1–\n1.5◦ in magnetic latitude. What is worth noting is that this\ntendency is found to be the case for all overpasses. Andre´\net al. (1999, 2000a, 2000b) simulated the effect of a time-\nvarying electric field, with frequencies of the order of ≈0.1–\n5 Hz, on the autocorrelation function (ACFs) derived from\nthe coherent HF radars’ pulse sequence and proposed that\nlarge spectral widths can be caused by such an electric field.\nThey then link the large spectral widths observed within the\ncusp to the wave activity observed by polar-orbiting satellites\npassing through the cusp (e.g. Maynard et al., 1982; Mat-\nsuoka et al., 1993) and ground magnetometer data showing\nPc1\/Pc2 activity underneath the cusp (e.g. Menk et al., 1992;\nDyrud et al., 1997). Matsuoka et al. (1993) have pointed out\nthat correlation between these wave activities and enhance-\nment of the flux of precipitating cusp ions and electrons is\ngood during the intervals of the southward IMF Bz compo-\nnent. Lockwood (1997) and Rodger and Pinnock (1997) have\nshown that the finite poleward convection velocity of recently\nreconnected flux tubes leads the bulk of the cusp particles\nto the region some distance poleward of the true OCFLB at\nionospheric altitudes. Rodger and Pinnock (1997) assumed\nthat the cusp particle precipitation travels at the speed of the\nions, and then estimated this offset to be≈150 km near noon.\nIf we assume that the broad spectral width is caused by the\ntime-varying electric field closely related to the cusp parti-\ncle precipitation, the offset between spectral width boundary\nand particle trapping boundary seen in the present observa-\ntion can be explained by the effect of finite poleward flow\nsuggested by Lockwood (1997). This length of the offset\n(1–1.5◦) is consistent with those estimated by Rodger and\nPinnock (1997).\nSince there is no overpass of the DMSP satellite in the\nSouthern Hemisphere during this interval, we do not know\nwhether or not the offset between the spectral width bound-\nary and the particle trapping boundary exists also in the\nSouthern Hemisphere. Coleman et al. (2000) have shown\nthat the ionospheric footprint of the reconnection X-line\nvaries in length with dipole tilt angle. This effect can intro-\nduce an interhemispheric difference in ionospheric convec-\ntion velocities in the solstice conditions, which has been con-\nfirmed by Pinnock et al. (1999) at the summer solstice. How-\never, the present observation was done at equinox. Hence, the\npoleward convection velocity of the newly-reconnected flux\ntubes is expected to be equal between the two hemispheres.\nThis suggests that the offset between the true OCFLB and the\nspectral width boundary is also equal in both hemispheres.\nThen, it is valid to use the spectral width boundary as a proxy\nfor the OCFLB and to discuss the interhemispheric differ-\nence in the behavior of the OCFLB, keeping in mind the pos-\nsibility that we may underestimate the latitude of the OCFLB\nby a small amount.\n3.3 Interhemispheric comparison of the spectral width\nboundary\nFor better understanding of the behavior of the spectral width\nboundaries in both hemispheres, we projected the spectral\nwidth boundary identified in the Northern Hemisphere into\nthe Southern Hemisphere using the Tsyganenko 89 magnetic\nfield model (Tsyganenko, 1989) and compared directly the\nlocations of the boundaries in both hemispheres. The reason\nwhy the direct comparison was done in the Southern Hemi-\nsphere and not in the opposite hemisphere is that there is\n1558 K. Hosokawa et al.: Interhemispheric comparison of spectral width boundary\nFig. 4. (Top two panels) The By and Bz components of the IMF as measured by the ACE and Wind spacecraft (solid and dashed line,\nrespectively), lagged to the magnetopause. Two vertical dashed lines indicate the time of the northward excursion of the IMF Bz (“NE1” and\n“NE2”). (Middle three panels) The magnetic latitude of the spectral width boundaries identified for each conjugate beam pair, respectively.\nIn each panel, the blue line indicates the boundary identified in Iceland East and the orange line indicates the boundary identified in Syowa\nEast. Attached grey bars indicate uncertainties in the determination of the boundary latitude. (Bottom panel) H -component magnetograms\nfrom the CANOPUS networks, along with filtered data showing Pi2 activity (scaled by a factor of 5 for clarity). Vertical dashed lines indicate\nthe onset of the two substorm breakup (“SB1” and “SB2”).\nK. Hosokawa et al.: Interhemispheric comparison of spectral width boundary 1559\nFig. 5. (Top three panels) The scattergram of the magnetic latitudes of the spectral width boundaries identified in both hemispheres for each\nconjugate beam pair, respectively. Vertical axis is the magnetic latitude of Iceland East and horizontal is that of Syowa East. Dot-dashed\nline in each panel indicates a hypothetical equality of the boundaries identified in both hemispheres for comparative purposes. Linear fits to\nthe variations are indicated by solid lines, and correlation coefficients are shown at the bottom of the panels. Dipole tilt angle is shown in\ncolour-scale. (Bottom three panels) The histograms of the magnetic latitudes of the spectral width boundaries identified in Iceland East (grey\nbars) and Syowa East (open bars) for each conjugate beam pair, respectively.\nno major difference in the result of the projection between\nthese two approaches. The middle three panels of Figure 4\nshow the latitudes of the spectral width boundaries identi-\nfied in both hemispheres for each conjugate beam pair. In\neach panel, the blue line indicates the boundary identified in\nIceland East radar and the orange line indicates the bound-\nary identified by Syowa East radar. Attached grey bars in-\ndicate uncertainties in the boundary location as estimated in\nSect. 3.1 (1.08◦ in latitude). There exists a lack of the spec-\ntral width boundary in Iceland East between 10:35 UT and\n10:45 UT on beam pair I. Field lines at these latitudes can\nnot be traced from the Northern Hemisphere into the South-\nern Hemisphere because they are defined to be open by the\nTsyganenko 89 model.\nThe magnetic latitude of the spectral width boundary fol-\nlows the same general equatorward trend in both hemi-\nspheres throughout the interval. It is difficult to determine\nwhether this variation is purely temporal or not. In general,\nthe equatorward edge of the polar cap (ideally, this corre-\nsponds to the poleward edge of the auroral oval) is not a cir-\ncle. Latitudes are slightly different against magnetic local\ntime. If we refer to the model of the auroral oval (e.g. Feld-\nstein and Starkov, 1967), the latitude of the poleward edge\nof the oval is found to be highest at magnetic local noon.\nHence, the boundary seems to shift poleward (equatorward)\nas it moves from dawnside (noon) to noon (duskside). This\napparent variation could be a considerable bias when we es-\ntimate how the polar cap is expanding and contracting in as-\nsociation with the IMF orientations and substorm activities.\nIn the middle panels of Fig. 4, approximate UT of magnetic\nlocal noon is indicated by an open black triangle. The large-\nscale equatorward trend of the boundaries is found to be in-\ndependent on the MLT, which suggests that the bias intro-\nduced by the longitudinal variation of the polar cap boundary\nis negligible during the interval of this study.\nTo illustrate how the boundaries collocate between two\nhemispheres, Fig. 5 presents scattergrams (top) and his-\ntograms (bottom) of the magnetic latitudes of the boundaries\nidentified in both hemispheres for each conjugate beam pair.\nIn the top three panels, linear fits to the variations are in-\ndicated by solid lines, and correlation coefficients are also\nshown. Dashed-lines on the scattergrams indicate a hypothet-\nical equality of the boundaries identified in both hemispheres\nfor comparative purposes. It is clear that the latitudes of the\nspectral width boundaries are highly collocated between both\nhemispheres, where correlation coefficients are larger than\n1560 K. Hosokawa et al.: Interhemispheric comparison of spectral width boundary\n0.70 for all beam pairs and occurrence histograms are con-\nsiderably overlapping. However, the boundary in Syowa East\ntends to be at higher latitude compared with that in Iceland\nEast, where the differences as large as 2◦ in latitude can be\nidentified on individual points. In general, magnetic latitude\nof the cusp varies with dipole tilt angle (e.g. Newell and\nMeng, 1989). When the dipole tilt angle is directed positive,\nthe latitude of the cusp is higher in the Northern Hemisphere\nthan that in the Southern Hemisphere. In order to estimate\nhow the tilt of the dipole contributes to the interhemispheric\ndifference in the latitude of the boundaries, information on\nthe dipole tilt angle is displayed as a colour-scale in the top\nthree panels. It is found that the interhemispheric difference\nis larger when the dipole tilt angle is larger (blue and green\npoints), while the difference is almost negligible when the\nangle is close to zero (orange and red points).\n3.4 Response to the IMF and substorm activity\nReturning to the middle three panels of Fig. 4, the magnetic\nlatitude of the spectral width boundary follows the same gen-\neral equatorward trend in both hemispheres throughout the\ninterval, which means the OCFLB is gradually expanding\naround the dayside ionosphere. It is also worth noting that\nthe latitude of the spectral width boundary shows short-lived\npoleward excursions superposed on the general equatorward\ntrend. In order to clarify what causes these poleward and\nequatorward movements of the spectral width boundary, we\nhave examined the variation of the interplanetary magnetic\nfield and the occurrence of substorms during the interval.\nThe former would contribute to the expansion of the OCFLB\nthrough the reconnection at the magnetopause, while the lat-\nter would contribute to the contraction of the OCFLB through\nthe reconnection of the open field in the tail, most likely as a\npart of the substorm process.\nDuring the interval of the present study, the ACE space-\ncraft was located upstream of the magnetosphere at Xgsm ≈\n228RE and the Wind spacecraft was located at Xgsm ≈\n49RE . An approximate solar wind velocity of 530 km s−1\nmeasured by both spacecrafts during this interval gives a de-\nlay of some 50 min for ACE and 14 min for Wind between\nthe observation of IMF features and their incidence on the\nEarth’s magnetopause. The calculation is based on the tech-\nnique of Khan and Cowley (1999). An additional two min-\nutes must be added to account for the propagation time of\nAlfve´n waves from the subsolar magnetopause to the day-\nside high-latitude ionosphere. A total solar wind propaga-\ntion time delay of 52 min for ACE and 16 min for Wind\nappears to give the best correlation between the variations\nobserved in the IMF and the behavior of the spectral width\nboundary observed by the radars. The IMF By and Bz com-\nponents, as measured by the spacecraft, including the esti-\nmated propagation time of 52 min for ACE and 16 min for\nWind, are displayed in the top two panels of Fig. 4, with data\nfrom ACE being represented by the solid line and data from\nWind by the dashed line. During the first 30 min from the\nstart of the interval, IMF By is strongly positive, but turns\nnegative at 10:00 UT, after which it has a strong negative\nvalue (≈ −10 nT). In the case of the Bz component, nega-\ntive values are dominant throughout the interval, with excur-\nsions close to zero around 11:18 UT (“NE1”) and 12:22 UT\n(“NE2”), which are presented as dot-dashed lines.\nAs is already noted, the magnetic latitude of the spectral\nwidth boundary exhibits a general equatorward trend in both\nhemispheres. This trend is found to be related to the con-\ntinuous negative Bz component of the IMF. Following each\nof the two northward excursions of the IMF, the spectral\nwidth boundary moved poleward in both hemispheres. The\nresponse of the spectral width boundary to these northward\nexcursion is rapid (response time is less than 5 min) and it\noccurs simultaneously in both hemispheres. The duration of\nthese poleward motions of the boundaries is similar to that\nof the northward excursion of the IMF. When the By com-\nponent of the IMF suddenly changes, the magnetic latitudes\nof the spectral width boundaries are also expected to move.\nCowley et al. (1991) pointed out that in the Northern Hemi-\nsphere the OCFLB shifts towards dusk during a By positive\ninterval and towards dawn for the By negative case. The situ-\nation is reversed in the Southern Hemisphere. At the time of\nthe large By change (10:00 UT), the radars observe the spec-\ntral width boundary between 10:00 MLT and 12:00 MLT in\nboth hemispheres. Hence, this IMF By change could cre-\nate poleward displacement of the spectral width boundary\nin the Northern Hemisphere and equatorward in the South-\nern Hemisphere. However, our observation does not support\nthis effect. Although there could be evidence that the spec-\ntral width boundary in the Northern Hemisphere shifts pole-\nward in response to the By change, corresponding equator-\nward movement of the spectral width boundaries cannot be\nidentified in the Southern Hemisphere.\nTwo substorms occur during the interval of interest, the\nprogress of which are monitored by three magnetometer sta-\ntions from the Canadian Auroral Network for the OPEN\nProgram Unified Study (CANOPUS) network (as described\nby Samson et al., 1992). These stations are FSIM, FSMI\nand DAWS, which are located between 22:30 MLT and\n04:00 MLT at the times of the substorm breakups. The H -\ncomponent magnetograms from the three stations and band-\npass filtered data from DAWS are shown in the bottom panel\nof Fig. 4. The first substorm occurs at 09:45 UT (“SB1”)\nand the second at 11:48 UT (“SB2”), both of which are con-\nfirmed by a large negative bay in the H -component and the\npresence of Pi2 pulsations, indicating the expansion phase\nonset of the substorms. Following the expansion phase on-\nset of the substorms (as indicated by the dot-dashed line, re-\nspectively), the spectral width boundary starts to move pole-\nward or stops its equatorward motion. This response is more\nclearly seen at the time of the first substorm onset (degree of\nthe displacement is approximately 3◦ in magnetic latitude),\nalthough there is some evidence for this at the time of the\nsecond substorm onset (degree of the movement is less than\n1◦ in beam pair I and II, and the boundary remains at a con-\nstant latitude in beam pair III). In short, the degree of the\npoleward movement of the spectral width boundary is larger\nK. Hosokawa et al.: Interhemispheric comparison of spectral width boundary 1561\nfollowing the first substorm onset than in the second.\nAt the time of the first substorm breakup, there is an in-\nterhemispheric difference in response to the spectral width\nboundary to the substorm. The spectral width boundary starts\nto move poleward 5 min after the onset of the substorm in the\nSouthern Hemisphere, while it takes approximately 15 min to\nrespond in the Northern Hemisphere. This signature is more\nclearly identified in beam pair II and III. The degree of the\ndifference is about 2◦ in magnetic latitude, which is larger\nthan the uncertainty in the identification of the spectral width\nboundary, as estimated in Sect. 3.1. In beam pair I, we cannot\nfind a clear interhemispheric difference whose scale is larger\nthan the uncertainty of the backscatter location. However,\nthe boundary in Syowa East exhibits a small poleward excur-\nsion (≈ 1◦) at 09:50 UT, which is consistent with the pole-\nward variation seen in beam pair II and III. In contrast to this\ndifference in response to the first substorm breakup, no inter-\nhemispheric difference can be found in the response time to\nthe second substorm. The cause of the interhemispheric sym-\nmetry and asymmetry in response to the substorm breakup\nwill be discussed in a later section.\n4 Discussion\n4.1 Interhemispheric collocation of the boundaries\nFirst, we discuss the collocation of the spectral width bound-\naries in both hemispheres. The present observation suggests\nthat the magnetic latitude of the spectral width boundary is\nsimilar in both hemispheres, and the correlation coefficients\nbetween both latitudes are larger than 0.70 for all beam pairs.\nNewell and Meng (1989) investigated a large data set of\nDMSP satellite crossings of the cusp and concluded that the\nposition of the cusp is about 4◦ lower in winter than in the\nsummer hemisphere and approximately symmetric around\nequinox. The first interhemispheric observation of the spec-\ntral width boundaries by Pinnock et al. (1999) identified the\ndifference in the latitude of the boundaries, up to 4◦ in mag-\nnetic latitude, between both hemispheres. Their observation\nwas carried out during summer in the Northern Hemisphere.\nHence, they argued that the interhemispheric difference of\nthe boundary location is caused by the seasonal asymmetry\nof the dayside structure related to the dipole tilt angle effect.\nOn the other hand, the present observation was done during\nequinoctial conditions, when the effect of dipole tilt angle\non the interhemispheric difference is minimized, which can,\ntherefore, be the reason for the good collocation of the spec-\ntral width boundary between both hemispheres in our obser-\nvation.\nThough the spectral width boundaries coincide on aver-\nage between both hemispheres, there is a slight difference,\nsuch that the boundary identified in Syowa East’s field-of-\nview tends to be at a higher latitude compared with that in\nIceland East (2◦ in maximum). There are at least two possi-\nble reasons for this difference. Again, one reason is the effect\nof the dipole tilt angle, which varies not only with season, but\nalso with UT. During the interval of this study, the dipole tilt\nangle changes from −9.33◦ (09:30 UT) to 0.76◦ (13:30 UT).\nAs clearly shown in Fig. 5, there exists a good correlation\nbetween the dipole tilt angle and degree of the interhemi-\nspheric difference in boundary latitude. This suggests that\nthe primary cause of the interhemispheric difference in the\nlatitude of the boundaries is the effect of the dipole tilt angle.\nNewell and Meng (1989) have shown that 17◦ of dipole tilt\nangle is required to shift the cusp by 1◦ of latitude. −9.33◦\nof dipole tilt angle shifts the cusp equatorward (poleward) by\n0.55◦ in the Northern (Southern) Hemisphere. Then, an in-\nterhemispheric difference in boundary latitude is estimated\nto be 1.1◦, which is roughly consistent with the present ob-\nservation. Although the observation was carried out close to\nthe equinox, it was not under pure equinox conditions (about\na half month after the equinox). According to the statistical\nanalysis of Newell and Meng (1989), such a shift from the\nequinox is enough to create a small difference in the average\nlatitude of the dayside structure. The other possibility is the\neffect of IMF By . Apart from the first 30 min of the interval,\nIMF By is predominantly negative. The IMF By component\nimposes a strong skewing force on the high-latitude convec-\ntion pattern (e.g. Cowley, 1981) which results, within the\nNorthern Hemisphere, in anti-sunward flow being dragged\ntowards the morning sector for IMF By positive and towards\nthe evening sector for By negative (e.g. Reiff and Burch,\n1985). Variation of dayside OCFLB with longitude could\nalso have a dependence on the IMF By , which can create a\ndifference in spectral width location around dayside.\nWe again stress our finding: that the spectral width bound-\naries identified in both hemispheres are highly collocated.\nMilan et al. (1998) shows that the HF radar technique can\nbe relatively insensitive to the variations in the propagation\nenvironment of the high-latitude ionosphere and that dayside\nauroral backscatter exhibits a true geophysical structure. Fur-\nthermore, Yeoman et al. (1997) employed a swept-frequency\nradar mode to demonstrate that the equatorward boundary\nof the cusp backscatter was independent of the radio-wave\nfrequency and any variations in propagation. Our observa-\ntional results also suggest that the spectral width boundary is\nnot affected by the local conditions in a hemisphere and are\nstrongly controlled by factors common to both hemispheres.\nRecently, Andre´ et al. (1999, 2000a, 2000b) have postulated\nthat high frequency (Pc1) wave activity associated with the\ncusp results in highly variable electric fields, which broaden\nthe spectra, although this is not the only source of high spec-\ntral widths in HF radar data (strictly speaking, the effect of\nvelocity shears on the scale of radar range\/beam cell needs to\nbe considered). Most of these waves are attributed to electro-\nmagnetic ion cyclotron waves generated at the dayside mag-\nnetopause in the equatorial plane. Since this wave activity is\nconsidered to propagate into the conjugate ionospheres from\nthe equatorial plane, the collocation of the spectral width\nboundary in our observation can be explained by the mecha-\nnism.\n1562 K. Hosokawa et al.: Interhemispheric comparison of spectral width boundary\n4.2 Response to the changes of IMF Bz and substorm\nWe have seen that the spectral width boundary appears to\nmove equatorward or poleward in response to the changes\nin the IMF and the occurrence of substorm. We now discuss\nthe influence of the Bz component of IMF and the occurrence\nof substorm on the variation of the spectral width boundary.\nThe size of the area of open flux is controlled by both the\ndayside and nightside reconnection rates (Siscoe and Huang,\n1985). Cowley and Lockwood (1992) illustrated an expand-\ning\/contracting polar cap model in which they described the\nionospheric flow as a consequence of both dayside and night-\nside reconnection rates. Initially, it is assumed that the open\nand closed flux in the polar cap is in a state of equilibrium and\nthat the polar cap is circular, containing some amount of open\nflux. In response to a burst of dayside reconnection, a region\nof closed flux adjacent to the pre-existing dayside polar cap\nboundary is opened. The OCFLB, the boundary which en-\ncloses open flux, moves equatorward to encompass the new\nopen flux. For the period analyzed in the present study, neg-\native Bz was dominant throughout the interval. The general\nequatorward trend of the spectral width boundary is consis-\ntent with the gradual accumulation of open flux in the polar\ncap through magnetopause reconnection, which is expected\nfor southward IMF.\nConversely, during the substorm expansion phase, when\nreconnection occurs in the magnetotail closing pre-existing\nopen flux, the boundary moves poleward as the polar cap\nshrinks. Following the onset of two substorm breakups\n(termed “SB1” and “SB2” in the text), the spectral width\nboundary moves poleward with some delay time, which in-\ndicates that the reconnection in the magnetotail is destroying\nopen flux within the polar cap. There is a difference between\nthe two poleward excursions associated with the substorm\noccurrence, such that the scale of the poleward movement of\nthe boundary is larger following the first substorm breakup\n(SB1) than the second substorm breakup (SB2). At the on-\nsets of both substorms, the Bz component of IMF is oriented\nsouthward. However, just after the onset of the first substorm,\nIMF Bz becomes close to zero, while the IMF continues to\nbe directed southward after the onset of the second substorm.\nIf reconnection occurs in the magnetotail and on the dayside\nsimultaneously, the day and nightside reconnection rates are\nin competition, that is creating and destroying open flux, re-\nspectively. In the case of the first substorm, the nightside\nreconnection rate is expected to strongly exceed the dayside\nreconnection rate, hence, the spectral width boundary shifts\npoleward by approximately 3◦. On the other hand, during\nthe interval of the second substorm breakup, the difference\nbetween the reconnection rate at the dayside magnetopause\nand in the tail is considered to be smaller compared with that\nat the first substorm breakup, due to the continuing south-\nward IMF. Hence, the scale of the poleward excursion fol-\nlowing the second substorm breakup is small (less than 1◦ or\nremaining at a constant latitude).\nWhen the IMF has a northward component, reconnection\ncan take place at the high-latitude magnetopause, tailward of\nthe magnetopause entrance to the cusp region. Here, recon-\nnection occurs between the IMF and pre-existing open flux\nin the magnetotail lobe. These field lines map to the high-\nlatitude side of the ionospheric footprint of the cusp, and are\nlocated at higher latitude within the polar cap. Hence, no\nnew open flux is created in this process and the amount of\nopen flux in the polar cap is expected to remain unchanged\nif there is no nightside reconnection. In the present obser-\nvation, however, following the northward excursions of the\nIMF Bz (termed “NE1” and “NE2” in the text), the spec-\ntral width boundary moves poleward in both hemispheres.\nThis suggests that tail reconnection is still continuing. Ac-\ntually, at the times of both northward excursions, variation\nof the CANOPUS magnetometers still exhibits the signature\nof substorm recovery phase. Milan et al. (2002) pointed out\nthat magnetotail reconnection and the associated shrinkage\nof the polar cap appears to continue from substorm expan-\nsion phase onset to the end of the recovery phase, which is\nabout 100 min. A similar finding was reported by Khan et\nal. (2002), in which reconnection signatures were observed\nin the magnetotail some time after significant auroral activity\nhad subsided. This signature is also consistent with a ces-\nsation of dayside reconnection and associated contraction of\nthe polar cap. Our observation is consistent with their results.\n4.3 Interhemispheric asymmetry in response to the sub-\nstorms\nHere, we discuss the interhemispheric difference in the re-\nsponse time to the occurrence of substorm expansion. Dur-\ning the period analyzed in this paper, two substorms, SB1\nand SB2, occur. Following the onset of both substorms, the\nspectral width boundary moves poleward, indicating that re-\nconnection in the magnetotail is destroying open flux in the\npolar cap. However, there is a difference in response time\nto the substorm onset between the two substorms. For the\nfirst substorm, the spectral width boundary starts to move\npoleward 5 min after the onset of the substorm in the South-\nern Hemisphere, while it takes approximately 15 min to re-\nspond in the Northern Hemisphere. The conjugate observa-\ntion of the spectral width boundary by Pinnock et al. (1999)\ndemonstrated that there is an interval of poleward movement\nof the spectral width boundary, suggesting that the nightside\nreconnection rate exceeds the dayside rate. However, no in-\nterhemispheric difference was discussed in their study. Here,\nwe discuss this difference in terms of interhemispheric asym-\nmetry of the substorm breakup region in the longitudinal di-\nrection, associated with the effect of the IMF By component.\nIt is well known that the By component of IMF imposes a\nskewing force on the convection pattern around the dayside\nhigh-latitude ionosphere, which results, within the Northern\nHemisphere, in anti-sunward flow being dragged towards the\nmorning sector for IMF By positive and towards the evening\nsector for By negative, with an opposite variation produced\nwithin the Southern Hemisphere (e.g. Cowley, 1981). This\nskewing force imposed on the ionosphere also results in\nK. Hosokawa et al.: Interhemispheric comparison of spectral width boundary 1563\nFig. 6. A schematic diagram of the situation accounting for the difference in response time of the spectral width boundary to the substorm\nexpansion at the time of the first substorm onset (left panel) and the second substorm onset (right panel). Magnetic local noon is toward the\ntop of the figure.\nthe dawn-dusk displacement of the auroral oval, within the\nSouthern Hemisphere in the direction of the imposed By\ncomponent (Holzworth and Meng, 1984). Also, in the night-\nside ionosphere, configuration of the ionosphere depends on\nthe IMF By . For example, Rodger et al. (1984) described the\nasymmetric location in MLT of the Harang discontinuity as\na function of IMF By , with its location within the Northern\nHemisphere skewed ≈2 h westwards and within the South-\nern Hemisphere ≈2 h eastwards, for an IMF y-component of\n≈8 nT. Shand et al. (1998) and Yeoman et al. (2000) inves-\ntigated interhemispheric contrasts in the ionospheric convec-\ntion response to variations of the IMF and substorm activ-\nity using conjugate SuperDARN radar data on the nightside.\nThey also demonstrated that when the IMF By is large, then\nsufficient asymmetries are generated between the Northern\nand Southern Hemisphere ionospheric convection patterns to\nresult in large-scale non-conjugacy, even in flows driven by\nnightside processes. In a recent analysis of conjugate satel-\nlite images, Craven and Frank (1996) found an indication of a\ndependence in the substorm expansion phase on the By com-\nponent of the IMF. Stenbaek-Nielsen and Otto (1997) gave\nan interpretation with the penetration of the By component\nof IMF causing the observed interhemispheric difference in\nthe behavior of discrete aurora.\nIn the present observation, IMF By is ≈8 nT at the onset\nof the first substorm, and ≈ −8 nT at the onset of the second\nsubstorm. At the onset of both substorms, the Bz component\nof IMF is predominantly negative. If we postulate a motion\nof the substorm breakup region in a similar fashion to Rodger\net al. (1984), the substorm breakup region shifts towards dusk\nfor the case of the first substorm and towards dawn for the\nsecond substorm within the Northern Hemisphere, with the\nsituation being reversed in the Southern Hemisphere. At the\nonset of the first substorm, the conjugate radars are observ-\ning spectral width boundaries between 10–11.5 MLT, while\nat the onset of the second substorm, the boundaries in the\nfield-of-view of the radars are locate around 12 MLT. The\nsituation described here is summarized in Fig. 6. Hence, the\nbreakup region of the first substorm is expected to be closer\nto the spectral width boundary as identified by the radar in\nthe Southern Hemisphere than in the Northern Hemisphere,\nwhile there is no considerable difference in distance from the\nsubstorm breakup region to fields-of-view of the conjugate\nradars for the case of the second substorm. We suggest that\nthis displacement of the substorm breakup region in MLT\nassociated with IMF By polarity could create the interhemi-\nspheric difference in response of the boundaries to the first\nsubstorm. However, whether longitudinal displacement of\nsubstorm breakup region expected here is sufficient to cre-\nate the 10 min difference in response of the spectral width\nboundary around the dayside ionosphere is still an open ques-\ntion and more detailed analysis is needed for further under-\nstanding of this interhemispheric difference.\n5 Summary and conclusion\nThe spectral width boundaries obtained from the conjugate\nradar pair composed of CUTLASS Iceland East in the North-\nern Hemisphere and SENSU Syowa East in the Southern\nHemisphere were compared. Correspondence between the\nmagnetic latitudes of the boundaries in both hemispheres is\ngenerally very good. Correlation coefficients between the\nlatitudes of the boundaries are larger than 0.70 for all conju-\ngate beam pairs employed in this study, which suggests that\nthe spectral width boundary is not affected by the local con-\nditions in a hemisphere but are strongly controlled by fac-\ntors common to both hemispheres. This high correlation oc-\ncurs because the present observation was carried out around\nequinox when the effect of the dipole tilt angle on the lo-\ncation of the cusp is minimized. The temporal variation of\nthe magnetic latitude of the boundary follows the same equa-\n1564 K. Hosokawa et al.: Interhemispheric comparison of spectral width boundary\ntorward trend in both hemispheres. This signature is con-\nsistent with the accumulation of open flux in the polar cap\nby magnetopause reconnection, expected when IMF Bz is\nnegative. Boundaries in both hemispheres also exhibit short-\nlived poleward motions superposed on the general equator-\nward trend, which follow both the onset of substorm expan-\nsion phases and temporary northward excursions of IMF Bz\nduring substorm recovery phase. This suggests that the night-\nside reconnection rate exceeds the dayside reconnection rate\nand the polar cap contracts during these intervals. In addi-\ntion, there is a interhemispheric difference in response time\nto the substorm occurrence between two hemispheres. At\nthe time when the first substorm occurs, the spectral width\nboundary starts to move poleward 5 min after the onset of\nthe substorm in the Southern Hemisphere, while it takes ap-\nproximately 15 min to respond in the Northern Hemisphere,\nwith the difference being about 10 min. We have suggest that\nthe displacement of the substorm breakup region in MLT as-\nsociated with IMF By polarity could create this difference.\nAcknowledgements. The Ministry of Education, Culture, Sports,\nScience and Technology supports the SENSU Syowa HF radar sys-\ntems. The 39th and 40th JAREs (Japanese Antarctic Research Ex-\npedition) have carried out the HF radar operation at Syowa sta-\ntion. The Iceland East-Finland radar pair (the Co-operative UK\nTwin Located Auroral Sounding System: CUTLASS) is funded by\nthe Particle Physics and Astronomy Research Council, U.K., under\ngrant PPA\/R\/R\/1997\/00256, the Finnish Meteorological Institute,\nHelsinki, and the Swedish Institute for Space Research, Uppsala.\nThe authors would like to thank N. Ness at Bartol Research Insti-\ntute and CDAWeb for access to key parameter data from the MFI\ninstrument onboard the ACE spacecraft. The authors also thank\nthe principle investigator, R. P. Lepping, for the use of key pa-\nrameters from the Wind MFI instruments. The CANOPUS instru-\nment array is constructed, maintained and operated by the Cana-\ndian Space Agency. D. Hardy of Phillips Laboratory designed and\nbuilt the DMSP SSJ\/4 particle detectors employed in this study.\nThis research is supported by the Grant-in Aid for Scientific Re-\nsearch (A:11304029) from Japan Society for the Promotion of Sci-\nence (JSPS). KH is supported by Research Fellowships of the Japan\nSociety for the Promotion of Science for Young Scientists. EEW\nis indebted to the Particle Physics and Astronomy Research Coun-\ncil (PPARC) for a research studentship. The authors thank a ref-\neree, Mike Pinnock for his significant suggestions in evaluating this\npaper.\nReferences\nAndre´, R., Pinnock, M., and Rodger, A. S.: On the SuperDARN\nautocorrelation function observed in the ionospheric cusp, Geo-\nphys. Res. Lett., 26, 3353, 1999.\nAndre´, R., Pinnock, M., Villain, J.-P., and Hanuise, C.: On the\nfactors conditioning the Doppler spectral width determined from\nSuperDARN HF radars, Int. J. Geomagn. Aeron., 2, 77, 2000a.\nAndre´, R., Pinnock, M., and Rodger, A. S.: Identification of the\nlow-altitude cusp by Super Dual Auroral Radar Network radars:\nA physical explanation for the empirically derived signature, J.\nGeophys. Res., 105, 27 081, 2000b.\nBaker, K. B. and Wing, S.: A new magnetic coordinate system for\nconjugate studies of high latitudes, J. Geophys. Res., 94, 9139,\n1989.\nBaker, K. B., Greenwald, R. A., Ruohoniemi, J. M., Dudeney, J.\nR., Pinnock, M., Newell, P. T., Greenspan, M. E., and Meng, C-\nI.: Simultaneous HF radar and DMSP observation of the cusp,\nGeophys. Res. Lett., 17, 1869, 1990\nBaker, K. B., Dudeney, J. R., Greenwald, R. A., Pinnock, M.,\nNewell, P. T., Rodger, A. S., Mattin, N., and Meng, C.-I.: HF-\nradar signatures of the cusp and low latitude boundary layer, J.\nGeophys. Res., 100, 7671, 1995.\nBaker, K. B., Rodger, A. S., and Lu, G.: HF radar observations\nof the dayside magnetic merging rate: A Geospace Environment\nModeling boundary layer campaign study, J. Geophys. Res., 102,\n9603, 1997.\nBarthes, L., Andre´, R., Cerisier, J.-C., and Villain, J.-P.: Separation\nof multiple echoes using a high resolution spectral analysis in\nSuperDARN HF radars, Radio Sci., 33, 1005, 1998.\nChisham, G., Pinnock, M., and Rodger, A. S.: The response of\nthe HF radar spectral width boundary to a switch in the IMF By\ndirections: Ionospheric consequence of transient dayside recon-\nnection?, J. Geophys. Res., 106, 191, 2001.\nColeman, I. J., Pinnock, M., Rodger, A. S.: The ionospheric foot-\nprint of antiparallel merging regions on the dayside magne-\ntopause, Ann. Geophysicae, 18, 511, 2000.\nCowley, S. W. H.: Magnetospheric asymmetries associated with the\nY -component of the IMF, Planet. Space Sci., 29, 79, 1981.\nCowley, S. W. H., Morelli, J. P., and Lockwood, M.: Dependence\nof convective flows and particle precipitation in the high-latitude\nionosphere on the X and Y components of the interplanetary\nmagnetic field, J. Geophys. Res., 96, 5557, 1991.\nCowley, S. W. H. and Lockwood, M.: Excitation and decay of so-\nlar wind driven flows in the magnetosphere-ionosphere system,\nAnn. Geophysicae, 10, 103, 1992.\nCraven, J. D. and Frank, L. A.: The asymmetric substorm expansion\nphase (abstract), EOS Trans. AGU, 77(17), Spring Meet. Suppl.,\n252, 1996.\nDyrud, L. P., Engebretson, M. J., Posh, J. L., Hughes, W. J., Fukun-\nishi, H., Arnoldy, R. L., Newell, P. T., and Horne, R. B.: Ground\nobservations and possible source regions of two types of Pc1-\n2 micropulsation at very high latitudes, J. Geophys. Res., 102,\n27 011, 1997.\nEvans, L. C. and Stone, E. C.: Electron polar cap and the bound-\nary of open geomagnetic field lines, J. Geophys. Res., 77, 5580,\n1972.\nFeldstein, Y. I. and Starkov, G. V.: Dynamics of auroral belt and\npolar geomagnetic disturbance, Planet. Space Sci., 15, 209, 1967.\nGreenwald, R. A., Baker, K. B., Dudeney, J. R., Pinnock, M., Jones,\nT. B., Thomas, E. C., Villain, J.-P., Cerisier, J.-C, Senior, C.,\nHanuise, C., Hunsucker, R. D., Sofko, G., Koehler, J., Nielsen,\nE., Pellinen, R., Walker, A. D. M., Sato, N., and Yamagishi, H.:\nDARN\/SuperDARN: A global view of high-latitude convection,\nSpace Sci. Rev., 71, 763, 1995.\nHardy, D. A., Schmitt, L. K., Gussenhoven, M. S., Marshall, F.\nJ., Yeh, H. C., Schumaker, T. L., Huber, A., and Pantazis, J.:\nPrecipitating electron and ion detectors (SSJ\/4) for the block\n5D\/Flights 6-10 DMSP satellites: calibration and data presen-\ntation, Rep. AFGL-TR-84-0317, Air Force Geophysics Labora-\ntory, Hanscom AFB, Mass., 1984.\nHolzworth, R. H. and Meng, C.-I.: Auroral boundary variations\nand the interplanetary magnetic field, Planet. Space Sci., 32, 25,\n1984.\nK. Hosokawa et al.: Interhemispheric comparison of spectral width boundary 1565\nHosokawa, K., Woodfield, E. E., Lester, M., Milan, S. E., Sato, N.,\nYukimatu, A. S., and Iyemori, T.: Statistical characteristics of\nspectral width as observed by the conjugate SuperDARN radars,\nAnn. Geophysicae, 20, 1213, 2002.\nHuber, M. and Sofko, G.: Small-scale vortices in the high-latitude\nF-region, J. Geophys. Res., 105, 20 885, 2000.\nKhan, H. and Cowley, S. W. H.: Observations of the response time\nof high-latitude ionospheric convection to variations in the in-\nterplanetary magnetic field using EISCAT and IMP-8 data, Ann.\nGeophysicae, 17, 1306, 1999.\nKhan, H., Cowley, S. W. H., Kolesnikova, E., Lester, M., Brit-\ntnacher, M. J., Hughes, T. J., Hughes, W. J., Kurth, W. S., Mc-\nComas, D. J., Newitt, L., Owen, C. J., Reeves, G. D., Singer,\nH. J., Smith, C. W., Southwood, D. J., and Wattermann, J. F.:\nObservation of two complete substorm cycles during the Cassini\nEarth swing-by: Cassini magnetometer data in a global context,\nJ. Geophys. Res., in press, 2002.\nLockwood, M.: Relationship of dayside auroral precipitations to\nthe open-closed separatrix and the pattern of convective flow, J.\nGeophys. Res., 102, 17 475, 1997.\nMatsuoka, A., Tsuruda, K., Hayakawa, H., Mukai, T., Nishida, A.,\nOkada, T., Kaya, N., and Fukunishi, H.: Electric field fluctua-\ntions and charged particle precipitation in the cusp, J. Geophys.\nRes., 98, 11 225, 1993.\nMaynard, N. C., Heppner, J. P., and Egeland, A.: Intense, variable\nelectric fields at ionospheric altitudes in the high latitude regions\nas observed by DE-2, Geophys. Res. Lett., 9, 981, 1982.\nMenk, F. W., Fraser, B. J., Hansen, H. J., Newell, P. T., Meng, C.-\nI., and Morris, R. J.: Identification of the magnetospheric cusp\nand cleft using Pc1-2 ULF pulsations, J. Atmos. Terr. Phys., 54,\n1021, 1992.\nMilan, S. E., Yeoman, T. K., Lester, M., Thomas, E. C., and Jones,\nT. B.: Initial Backscatter occurrence statistics from the CUT-\nLASS HF radars, Ann. Geophysicae, 15, 703, 1997.\nMilan, S. E., Yeoman, T. K., and Lester, M.: The dayside auroral\nzone as a hard target for coherent HF radars, Geophys. Res. Lett.,\n25, 3717, 1998.\nMilan, S. E., Lester, M., Cowley, S. W. H., Moen, J., Sandholt, P.\nE., and Owen, C. J.: Meridian-scanning photometer, coherent HF\nradar, and magnetometer observation of the cusp : a case study,\nAnn. Geophysicae, 17, 159, 1999.\nMilan, S. E. and Lester, M.: Interhemispheric differences in the HF\nradar signature of the cusp region: A review through the study of\na case example, Adv. Polar Upper Atmos. Res., 15, 159, 2001.\nMilan, S. E., Lester, M., Cowley, S. W. H., Oksavik, K., Brittnacher,\nM., Greenwald, R. A., Sofko, G., and Villain, J.-P.: Variations in\npolar cap area during two substorm cycles, submitted to Ann.\nGeophysicae, 2002.\nMoen, J., Carlson, C., Milan, S. E., Shumilov, N., Lybekk, B., Sand-\nholt, P. E., and Lester, M.: On the collocation between dayside\nauroral activity and coherent HF radar backscatter, Ann. Geo-\nphysicae, 18, 1531, 2001.\nNewell, P. T. and Meng, C. I.: The cusp and the cleft\/boundary\nlayer: Low-altitude identification and statistical local time varia-\ntion, J. Geophys. Res., 93, 14 549, 1988.\nNewell, P. T. and Meng, C. I.: Dipole tilt angle effects on the latitude\nof the cusp and cleft\/low-latitude boundary layer, J. Geophys.\nRes., 94, 6949, 1989.\nNewell, P. T. and Meng, C. I.: Ion acceleration at the equatorward\nedge of the cusp: low-altitude observations of patchy merging,\nGeophys. Res. Lett., 18, 1829, 1991.\nPinnock, M., Rodger, A. S., Baker, K. B., Lu, G., and Hairston,\nM.: Conjugate observations of the day-side reconnection electric\nfield: A GEM boundary layer campaign, Ann. Geophysicae, 17,\n443, 1999.\nReiff, P. H., Hill, T. W., and Burch, J. L.: Solar wind plasma injec-\ntion at the dayside magnetospheric cusp, J. Geophys. Res., 82,\n479, 1977.\nReiff, P. H. and Burch, J. L.: IMF By -dependent plasma flow and\nBirkeland currents in the dayside magnetosphere 2. A global\nmodel for northward and southward IMF, J. Geophys. Res., 90,\n1595, 1985.\nRodger, A. S., Cowley, S. W. H., Brown, M. J., Pinnock, M., and\nSimmons, D. A.: Dawn-dusk (y) component of the interplanetary\nmagnetic field and the local time of the Harang discontinuity,\nPlanet. Space Sci., 8, 1021, 1984.\nRodger, A. S., Mende, S. B., Rosenberg, T. J., and Baker, K. B.: Si-\nmultaneous optical and HF radar observations of the ionospheric\ncusp, Geophys. Res. Lett., 22, 2045, 1995.\nRodger, A. S. and Pinnock, M.: The ionospheric response to flux\ntransfer events: the first few minutes, Ann. Geophysicae, 15, 685,\n1997.\nRodger, A. S.: Ground-based imaging of magnetospheric bound-\naries, Adv. Space Res., 25, 1461, 2000.\nSamson, J. C., Wallis, D. D., Hughes, T. J., Creutzberg, F., Ruo-\nhoniemi, J. M., and Greenwald, R. A.: Substorm intensifications\nand field line resonances in the nightside magnetosphere, J. Geo-\nphys. Res., 97, 8495, 1992.\nSandholt, P. E., Farrugia, C. J., Oieroset, M., Stauning, P., and\nDenig, W. F.: Auroral activity associated with unsteady magneto-\nspheric erosion: observations on 19 December 1990, J. Geophys.\nRes., 103, 2309, 1998.\nSchiffler, A., Sofko, G., Newell, P. T., and Greenwald, R. A.: Map-\nping the outer LLBL with SuperDARN double-peaked spectra,\nGeophys. Res. Lett., 24, 3149, 1997.\nShand, B. A., Yeoman, T. K., Lewis, R. V., Greenwald, R. A., and\nHairston, M. R.: Inter-hemispheric contrasts in the ionospheric\nconvection response to changes in the interplanetary magnetic\nfield and substorm activity: a case study, Ann. Geophysicae, 16,\n764, 1998.\nSiscoe, G. L. and Huang, T. S.: Polar cap inflation and deflation, J.\nGeophys. Res., 90, 543, 1985.\nStenbaek-Nielsen, H. C. and Otto, A.: Conjugate auroras and the\ninterplanetary magnetic field, J. Geophys. Res., 102, 2223, 1997.\nTsyganenko, N. A.: A magnetospheric magnetic field model with a\nwarped tail current sheet, Planet. Space Sci., 37, 5, 1989.\nWoch, J. and Lundin, R.: Magnetosheath plasma precipitation in the\npolar cusp and its control by the interplanetary magnetic field, J.\nGeophys. Res., 97, 1421, 1992.\nYeoman, T. K., Lester, M., Cowley, S. W. H., Milan, S. E., Moen,\nJ., and Sandholt, P. E.: Simultaneous observation of the cusp in\noptical, DMSP and HF radar data, Geophys. Res. Lett., 24, 2251,\n1997.\nYeoman, T. K., Lewis, R. V., Khan, H., Cowley, S. W. H., and Ruo-\nhoniemi, J. M.: Interhemispheric observation of nightside iono-\nspheric electric fields in response to IMF Bz and By changes and\nsubstorm pseudobreakup, Ann. Geophysicae, 18, 897, 2000.\nYeoman, T. K., Wright, D. M., Stocker, A. J., and Jones, T. B.: An\nevaluation of range accuracy in the Super Dual Auroral Radar\nNetwork over-the-horizon HF radar systems, Radio Sci., 36, 801,\n2001.\nYeoman, T. K., Hanlon, P. G., and McWilliams, K. A.: A statisti-\ncal study of the location and motion of the HF radar cusp, Ann.\nGeophysicae, 20, 275, 2002.\n"}