{"doi":"10.1016\/j.ejvs.2009.07.012","coreId":"195798","oai":"oai:lra.le.ac.uk:2381\/7912","identifiers":["oai:lra.le.ac.uk:2381\/7912","10.1016\/j.ejvs.2009.07.012"],"title":"Should Asian men be included in abdominal aortic aneurysm screening programmes?","authors":["Salem, M. K.","Rayt, H. S.","Hussey, G.","Rafelt, S.","Nelson, C. P.","Sayers, R. D.","Naylor, A. R.","Nasim, A."],"enrichments":{"references":[{"id":44722831,"title":"Epidemiology of abdominal aortic aneurysms in the Asian community.","authors":[],"date":null,"doi":"10.1046\/j.1365-2168.2001.01709.x","raw":"Epidemiology of abdominal aortic aneurysms in the Asian community. Spark JL et al. British Journal of Surgery 2001;88;382-384.","cites":null},{"id":44722835,"title":"low-risk screening for abdominal aortic aneurysm both reduce aneurysm-related mortality. A stratified analysis from a single-centre randomised screening trial. Lindholt","authors":[],"date":"2007","doi":"10.1016\/j.jvs.2007.05.009","raw":"High-risk and low-risk screening for abdominal aortic aneurysm both reduce aneurysm-related mortality. A stratified analysis from a single-centre randomised screening trial. Lindholt JS, Juul S, Henneberg EW. Eur J Vasc Endovasc Surg. 2007 Jul;34(1):53-8.","cites":null},{"id":44722833,"title":"peripheral arterial disease. Hobbs SD,","authors":[],"date":"2003","doi":"10.1053\/ejvs.2002.1884","raw":"Ethnicity and peripheral arterial disease. Hobbs SD, Wilmink AB, Bradbury AW Eur J Vasc Endovasc Surg. 2003 Jun;25(6):505-12. Review","cites":null},{"id":44722829,"title":"Screening for abdominal aortic aneurysm. Cochrane Database Syst Rev","authors":[],"date":"2007","doi":"10.1002\/14651858.cd002945","raw":"Cosford PA, Leng GC. Screening for abdominal aortic aneurysm. Cochrane Database Syst Rev 2007;(2):CD002945.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-12","abstract":"Introduction\\ud\nA national AAA screening programme for men aged 65 is shortly to be implemented in England. Trials that have provided evidence for this screening programme have not included information on ethnicity. Hence their findings may not be applicable to ethnically diverse populations.\\ud\n\\ud\nReport\\ud\nThis study retrospectively looked at the prevalence of AAA in men aged 65, from different ethnic backgrounds in our city's current screening programme.19014 men (Caucasians n = 18,431, Asian n = 446, others n = 137) were screened. Prevalence was 4.69% (4.39–5% 95% CI), and 0.45% (0.054–1.161% 95% CI) in Caucasians and Asians respectively (Fisher's exact test: P < 0.0001).\\ud\n\\ud\nDiscussion\\ud\nPrevalence of AAAs in men aged 65 of Asian origin appears to be low and so increases uncertainty about cost-effectiveness of screening Asian men","downloadUrl":"http:\/\/hdl.handle.net\/2381\/7912","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7912\/1\/final%20edition%20salem.pdf","pdfHashValue":"90cc479fa8c94ad9263f3e4fb1190dab09552179","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7912<\/identifier><datestamp>\n                2015-12-11T14:36:26Z<\/datestamp><setSpec>\n                com_2381_10<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_11<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nShould Asian men be included in abdominal aortic aneurysm screening programmes?<\/dc:title><dc:creator>\nSalem, M. K.<\/dc:creator><dc:creator>\nRayt, H. S.<\/dc:creator><dc:creator>\nHussey, G.<\/dc:creator><dc:creator>\nRafelt, S.<\/dc:creator><dc:creator>\nNelson, C. P.<\/dc:creator><dc:creator>\nSayers, R. D.<\/dc:creator><dc:creator>\nNaylor, A. R.<\/dc:creator><dc:creator>\nNasim, A.<\/dc:creator><dc:subject>\nAbdominal aortic aneurysm<\/dc:subject><dc:subject>\nScreening<\/dc:subject><dc:subject>\nAsian<\/dc:subject><dc:description>\nIntroduction\\ud\nA national AAA screening programme for men aged 65 is shortly to be implemented in England. Trials that have provided evidence for this screening programme have not included information on ethnicity. Hence their findings may not be applicable to ethnically diverse populations.\\ud\n\\ud\nReport\\ud\nThis study retrospectively looked at the prevalence of AAA in men aged 65, from different ethnic backgrounds in our city's current screening programme.19014 men (Caucasians n = 18,431, Asian n = 446, others n = 137) were screened. Prevalence was 4.69% (4.39–5% 95% CI), and 0.45% (0.054–1.161% 95% CI) in Caucasians and Asians respectively (Fisher's exact test: P < 0.0001).\\ud\n\\ud\nDiscussion\\ud\nPrevalence of AAAs in men aged 65 of Asian origin appears to be low and so increases uncertainty about cost-effectiveness of screening Asian men.<\/dc:description><dc:date>\n2010-05-14T10:19:54Z<\/dc:date><dc:date>\n2010-05-14T10:19:54Z<\/dc:date><dc:date>\n2009-12<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nEuropean Journal of Vascular and Endovascular Surgery. Volume 38, Issue 6, December 2009, Pages 748-749. Should Asian Men be Included in Abdominal Aortic Aneurysm Screening Programmes? M.K. Salem, H.S. Rayta, G. Husseya, S. Rafelta, C.P. Nelsona, R.D. Sayersa, A.R. Naylora and A. Nasima<\/dc:identifier><dc:identifier>\n1078-5884<\/dc:identifier><dc:identifier>\nhttp:\/\/www.sciencedirect.com\/science\/article\/pii\/S1078588409003888<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7912<\/dc:identifier><dc:identifier>\n10.1016\/j.ejvs.2009.07.012<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author’s final draft post-refereeing of the paper published as European Journal of Vascular and Endovascular Surgery. Volume 38, Issue 6, December 2009, Pages 748-749. Should Asian Men be Included in Abdominal Aortic Aneurysm Screening Programmes? M.K. Salem, H.S. Rayta, G. Husseya, S. Rafelta, C.P. Nelsona, R.D. Sayersa, A.R. Naylora and A. Nasima. \\ud\nThe final published version is available at the DOI below:<\/dc:rights><dc:publisher>\nElsevier<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1078-5884","1078-5884"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Abdominal aortic aneurysm","Screening","Asian"],"subject":["Article"],"fullText":"Title page \nTitle:  \nShould Asian Men Be Included In Abdominal Aortic Aneurysm Screening Programmes? \n \nNames and affiliations:  \nMK Salem, HS Rayt, G Hussey, S Stevens, C Nelson, RD Sayers, AR Naylor, A \nNasim \nDepartment of Vascular & Endovascular Surgery, University Hospitals of Leicester \nNHS Trust, Leicester, LE1 5WW, UK. \n \nCorresponding author; \nMurtaza Salem,  \nDepartment of Surgery, \nRobert Kilpatrick Clinical Sciences Building, \nLeicester Royal Infirmary, Leicester, LE2 7LX, UK. \nEmail: ms447@le.ac.uk \nTel: 0116 2523252 \nFax: 0116 2523179 \n \nCategory: \nShort report \nShort title:  \nAsian Men and Aneurysm Screening? \n \n \n \n ABSTRACT \n \nShould Asian men be included in the abdominal aortic aneurysm screening \nprogrammes?  \n \nIntroduction \nA national AAA screening programme for men aged 65 is shortly to be implemented in \nEngland. Evidence for this screening programme has not included information on ethnicity \nand so their findings may not be applicable to ethnically diverse populations.  \n \nReport \nThis study looked at the prevalence of AAA in men aged 65, from different ethnic \nbackgrounds in our city’s current screening programme.19014 men (Caucasians n=18431, \nAsian n=446, others n=137) were screened. Prevalence was 4.69%(4.39%-5% 95% CI),  and \n0.45% (0.054% - 1.161% 95% CI) in Caucasians and Asians respectively. (Fisher’s exact \ntest: P<0.0001) \n \nDiscussion \nPrevalence of AAAs in men aged 65 of Asian origin appears to be low and so increases \nuncertainty about cost-effectiveness in screening Asian men. \n \n \n \n \nKeywords: Abdominal Aortic Aneurysm, Screening, Asian \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \nIntroduction \n \nAn AAA screening program for men aged 65 is to be introduced this year in England. \nEvidence of benefit for AAA screening in men has come from 4 randomised trials, showing a \nhighly significant reduction in aneurysm-related mortality in the screened population\n1\n. \n \nThe above trials provided no data on race or ethnicity of the participants and therefore their \nfindings may not be applicable to ethnically diverse populations.  \n \nOur city has a higher than average population of Asians from the Indian subcontinent. The \naim of this study was to establish whether the prevalence of AAA amongst Asian men is \ndifferent to Caucasian men in our screening programme. \n Report \nWe have been undertaking AAA screening in participating general practices in Leicester \nsince 1993. According to the data in the last census, approximately 30% of the population in \nLeicester classed themselves as Asian, with Asian defined as those originating from the \nIndian sub-continent\n2\n.  \n \nA total of 66 general practices (40% of total practices, covering approximately 60% of the \ncity’s population) participate in our screening programme. All men aged 65 were invited for \nan abdominal USS at their local general practice. Ethnic origin data was obtained by self-\nassignment and recorded in all men. Data was collected prospectively from 1993 through to \n2008 and was analysed with the help of a medical statistician. \n \nDuring the 15 year period between 1993 and 2008, 19014 men were screened (Caucasians \nn=18431, Asian n=446, Afro-Caribbean n=102, other n=35). An AAA was detected in 871 \nparticipants (Caucasians n=865 (4.69%)(4.39%-5% 95% CI), Asian n=2(0.45%)(0.054%-\n1.61% 95% CI) OR= 0.091 (95%CI  0.023 , 0.367), Afro-Caribbean n=4(3.9%)(1.07%-9.7% \n95% CI) OR=0.829 (95%CI  0.304 , 2.258), other n=0). There was a statistically significant \ndifference in prevalence between Caucasian and Asian men (P<0.0001, Fisher’s Exact Test). \n \n \n \n \n \n \nDiscussion \nThis study confirms that the prevalence of AAA in Caucasian men (4.69%) is similar to that \nreported previously\n3\n. However, the prevalence in Asian men is significantly lower and is \nconsistent with the observations of other reported series with variation in peripheral arterial \ndisease seen in different ethnic groups\n4,5\n. AAAs appears to be predominantly a disease of \nCaucasians, where as Asians have a tendency towards distal-occlusive disease predominantly \ncoronary heart disease.  \n \nThe low screening rate of Asian men in comparison to the Asian population could account for \nthe difference in prevalence seen, and one major limitation of our part-population screening \nprogramme is that attendance rates were not recorded. We have confirmed that 40% of GP \npractices involved in our screening programme were from areas with a high Asian population \nensuring that Asian men aged 65 were being invited equally, but actual numbers attending \ncompared to those invited is unknown. One reason for the low number of screened Asians \ncould be that the large Asian population is still young. Data from the last census showed that \nonly 5% of Asians are over 65 compared to 9% and 16% of Afro-Caribbean’s and Caucasians \nrespectively\n2\n, which reflects the large scale migration patterns of ethnic minority groups to \nthe UK between 1950 and 1970.  \n \nThe evidence for the national AAA screening programme is derived from 4 randomised \ntrials1. The participating centres in the two trials conducted in the United Kingdom were \nChichester, Oxford, Portsmouth, Southampton and Winchester. According to census data, all \nof these cities have an Asian population of less than 5%, whereas in Leicester the Asian \npopulation is around 30%. As the above trials did not record data on ethnic origin, it is not \nclear whether their findings are applicable to ethnically diverse populations and in particular \nto cities in England with a very high proportion of Asians such as Blackburn, \nWolverhampton and several boroughs of London\n2\n. \n \nGiven the lack of robust data on AAA in different racial\/ethnic groups, the increasing \npopulation of mixed-race individuals and the ethical dilemmas raised with excluding certain \nindividuals based on race, Asian men cannot be excluded from the AAA screening \nprogramme.  \n \nA study by Lindholt et al\n6\n found equal efficacy in screening high risk and low risk individuals \nfor AAAs, and so given the relatively low cost of scanning, cost-effectiveness may be largely \nunaffected in a national screening program where only 15% of non-Caucasians are over 50-\nyears old\n2\n. An advanced cost effective analysis of screening low risk individuals is needed.  \n \nReferences \n \n1. Cosford PA, Leng GC. Screening for abdominal aortic aneurysm. Cochrane Database \nSyst Rev 2007;(2):CD002945. \n2. Census Data 2001 – Office of National Statistics. http:\/\/www.statistics.gov.uk \n3. Collaborative Aneurysm Screening Study Group (CASS Group), Chichester Aneurysm \nScreening Group (UK), Viborg Aneurysm Screening Study (Denmark), Western Australia \nAbdominal Aortic Aneurysm Program (Australia), and Multicentre Aneurysm Screening \nStudy (MASS)(UK) . A comparative study of the prevalence of abdominal aortic \naneurysms in the United Kingdom, Denmark, and Australia  \nJ Med Screen 8(1): 46-50; doi:10.1136\/jms.8.1.46 \n4. Epidemiology of abdominal aortic aneurysms in the Asian community. Spark JL et al.  \nBritish Journal of Surgery 2001;88;382-384. \n5. Ethnicity and peripheral arterial disease. Hobbs SD, Wilmink AB, Bradbury AW Eur \nJ Vasc Endovasc Surg. 2003 Jun;25(6):505-12. Review \n6. High-risk and low-risk screening for abdominal aortic aneurysm both reduce \naneurysm-related mortality. A stratified analysis from a single-centre randomised \nscreening trial. Lindholt JS, Juul S, Henneberg EW. Eur J Vasc Endovasc Surg. 2007 \nJul;34(1):53-8.  \n \n \n"}