{"doi":"10.1017\/S0040298206210143","coreId":"67885","oai":"oai:eprints.lancs.ac.uk:34672","identifiers":["oai:eprints.lancs.ac.uk:34672","10.1017\/S0040298206210143"],"title":"'Letters From a Life: Selected Letters of Benjamin Britten, Volume Three 1946–51', eds. Donald Mitchell, Philip Reed and Mervyn Cooke (Faber and Faber); 'Selected Letters of Michael Tippett', ed. and trans. Thomas Schuttenhelm (Faber and Faber).","authors":["Venn, Edward"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-04","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67885.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/34672\/1\/displayFulltext2.pdf","pdfHashValue":"b13ff3f37e6a7364defc0f415f463fc4e34d5424","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:34672<\/identifier><datestamp>\n      2018-01-17T00:03:00Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4D:4D31<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        'Letters From a Life: Selected Letters of Benjamin Britten, Volume Three 1946–51', eds. Donald Mitchell, Philip Reed and Mervyn Cooke (Faber and Faber); 'Selected Letters of Michael Tippett', ed. and trans. Thomas Schuttenhelm (Faber and Faber).<\/dc:title><dc:creator>\n        Venn, Edward<\/dc:creator><dc:subject>\n        M Music<\/dc:subject><dc:date>\n        2006-04<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/34672\/1\/displayFulltext2.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0040298206210143<\/dc:relation><dc:identifier>\n        Venn, Edward (2006) 'Letters From a Life: Selected Letters of Benjamin Britten, Volume Three 1946–51', eds. Donald Mitchell, Philip Reed and Mervyn Cooke (Faber and Faber); 'Selected Letters of Michael Tippett', ed. and trans. Thomas Schuttenhelm (Faber and Faber). Tempo, 60 (236). pp. 61-64. ISSN 1478-2286<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/34672\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0040298206210143","http:\/\/eprints.lancs.ac.uk\/34672\/"],"year":2006,"topics":["M Music"],"subject":["Journal Article","PeerReviewed"],"fullText":"http:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nLetters From a Life: Selected Letters of Benjamin Britten,\nVolume Three 1946–51, edited by Donald Mitchell, Philip\nReed and Mervyn Cooke. Faber and Faber, £25.00.\nSelected Letters of Michael Tippett, edited and transcribed\nby Thomas Schuttenhelm. Faber and Faber, £25.00.\n‘The practice – the whole culture – of\n“biography” has radically altered in our time and\nbecome an unthinking pursuit of what is often\nrepresented to be the “dark” side of the\nbiographer’s subject’ (Letters From a Life, p. 6). For\nDonald Mitchell, writing in his introduction to\nthe third volume of Britten’s letters, a prime\nexample of such a pursuit is Humphrey\nCarpenter’s biography of Britten.1 Mitchell\nclaims that Carpenter’s study, released a year after\nthe first two volumes of Britten’s Selected Letters,\nwas ‘hijacked’ by the subject of Britten’s sexuality\nand his relationship with boys (p. 5). Nevertheless,\nthe biography ‘effected a fundamental change in\nmuch writing about the composer’ (p. 5): in what\nfollows, Mitchell makes it clear that Letters From a\nLife is offered as a corrective to the excesses\nresulting from this fundamental change.\nMitchell’s concern is that a number of post-\nCarpenter studies (and indeed, Carpenter himself\nat times) identify items of biography with the\nexperience of Britten’s music, an uncritical turn\nthat compromises genuine insight in both fields.\nTo interpret Britten’s life and music through the\nhermeneutic lens of his sexuality has led to a\n‘narrowness of … focus’ that has\ntoppled over from the interpretation of the music into\naccounts of the life itself which, in a comparable sense,\ncan all too easily be bleached of its human, and some-\ntimes all too human, complications and contradictions\n(p. 10).\nTo demonstrate such complications, and\nthereby reveal the limitations of Carpenter’s\napproach, Mitchell provides two lengthy\nexamples. The first concerns Carpenter’s\nassertion that ‘Britten had a particular young\nperson in mind’ – Humphrey Maud – when\nwriting The Young Person’s Guide to the Orchestra\n(Carpenter, p. 231). The second involves Stephen\nReiss’s suggestion, reported by Carpenter, that\nAlistair Hardy, the son of the caretaker whose\ndismissal from the Aldeburgh Festival set in\nmotion events culminating Reiss’s own\nresignation as General Manager, was ‘more or less\nthe prototype for the boy in Death in Venice’\n(Carpenter, p. 524). By providing dates of\nsignificant events, and above all interviews with\nHumphrey Maud and the Hardy family – the \nkey players in the two events Carpenter describes\n– Mitchell effectively dismantles the premises\nupon which Carpenter bases his musical inter-\npretations, whilst simultaneously demonstrating\nthe ‘human complications and contradictions’\nthat can be found in all aspects of Britten’s life. \nGiven that Carpenter does not comment upon\nReiss’s identification of Hardy with Tadzio, and\nthat his interpretations of the Young Person’s Guide\nare so superficial as to be negligible, one could\nsuggest that by devoting many pages to the\nmatter, Mitchell is overstressing his case. But his\npoints are nevertheless well-made, and indicative\nof the scrupulous research that characterizes all\nthree volumes of the Selected Letters to date.\nNevertheless, one also senses that there is more\nto Mitchell’s sustained critique of Carpenter et al\nthan just the solidity of the foundations upon\nwhich interpretations are based. The issue at\nstake is that of authenticity. For Mitchell, \nthe best biographical approach was to assemble an\naccount of a life, mostly in the composer’s own words,\nthe telling which – because of its peculiar dedication to\nmusic – had no option but also to function as a\npowerful illumination of the oeuvre itself (p. 4). \nThe same issue emerges at the end of the\nintroduction, when Mitchell claims that an\nanecdote, ‘is worth more than a moment’s\namused reflection. Is it not in fact a perfect\nexample of the authentic – that is to say, unpre-\ndictable, unforeseeable, immeasurably intricate\nand often undocumented – interaction between\nlife and art that I believe this volume of letters,\nannotations, and interpolations of oral history,\nlike its predecessors, uniquely affirms’ (p. 52,\nemphasis added). \nI have dwelt on his argument at some length\nbecause it seems clear to me that the Benjamin\nBritten whom Mitchell, Reed and Cooke present\nin Letters From a Life is no more or less authentic\n1 Humphrey Carpenter, Benjamin Britten: A Biography (London:\nFaber and Faber, 1992)\n \n61Tempo 60 (236) 61–72 © 2006 Cambridge University Press\nDOI: 10.1017\/S0040298206000143 Printed in the United Kingdom\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nthan the Britten we find in Carpenter’s biography.\nWhilst Carpenter may have dwelt too much on\nthe topic of Britten’s sexuality, the fact that\nBritten’s letters contain few references either to\nthis or to his relationship with boys results in\nLetters From a Life giving the subject too little\nemphasis. After all, these were important aspects\nof Britten’s life, and Mitchell’s efforts to downplay\ntheir significance further with an appeal to focus\nrather on the ‘image of the family and its creative\nsignificance’ for Britten’ (p. 10) is unconvincing.\nWhilst Letters from a Life provides a welcome\noverview of many of the facets of Britten’s\npersonality, I imagine that Britten’s sexuality –\nrightly or wrongly – will nevertheless continue to\noccupy centre-stage in the interpretation of his\nmusic for some years to come. \nFollowing the introduction, the volume opens\nwith a selection of letters that came to light in the\nlast 13 years and belong to the period covered in\nthe first two volumes. The large amount of\ncorrespondence between Britten and Edward\nSackville-West that has also been discovered\nrecently is the subject of an informative mini-\nessay by Mitchell. Here, Mitchell suggests that the\nsignificance of their collaborative effort The\nRescue ‘is perhaps still not adequately recognized\ntoday’ (p. 117), one of the few critical comments\nabout actual music that one can find in this\nvolume.\nBut it is the letters from the period on which\nthis third volume is focussed, 1946–51, which\nhold the attention most firmly. These are the\nyears in which Britten’s newly-gained\ninternational status was confirmed with works\nsuch as The Rape of Lucretia, Albert Herring, the\nSpring Symphony, and Billy Budd. They also\nwitnessed the consolidation of Britten’s career as\na performer, and the increasing importance of his\nrole as an administrator – the English Opera\nGroup and the Aldeburgh Festival were\nestablished in this astonishingly productive time. \nSo productive, in fact, that many of the letters\nrepresented in this volume are concerned with the\nmanagement of Britten’s numerous musical\naffairs. Here are the nuts and bolts of his\nprofessional life: details of commissions both\nfulfilled and declined; tours undertaken and\ncancelled; the organization and critiques of\nperformances; and the changing relationships –\npersonal as well as artistic – between Britten and\nhis collaborators. Of the latter, arguably the most\nimportant – after Peter Pears, of course – was Eric\nCrozier, who worked with Britten on Saint Nicolas,\nLet’s Make An Opera, Albert Herring, and Billy Budd.\nWhilst the story of their increasingly distant\nrelationship is not new, the way in which it unfolds\nin the letters reveals the chilly inevitability of the\nend of their friendship; something of which both\nBritten and Crozier seem completely aware.\nThe letters to friends, colleagues and Peter\nPears reveal a great deal about Britten’s\npersonality: his warmth, his generosity and his\nhumour all shine through. So too do the testy\nremarks, the impatience and the ambition. For\nthose who regard a composer’s music as an\nextension of his personality, the letters will reveal\nmuch about the music composed at this time. But\nthose looking for an insight into how Britten\ncomposed, or what he really thought of the\ncharacters in his opera, the letters provide slim\npickings. The stark distinction between life and\nart that this gives rise to stands at odds with\nMitchell’s claim that Britten’s words ‘function as a\npowerful illumination of the oeuvre itself ’.\nIt is important, therefore, not to lose sight of\nwhat the book does provide us with. Forget the\ndubious psychology of the introduction:\nMitchell’s undoubted strength, along with his co-\neditors Reed and Cooke, can be found in the\nexhaustive editorial annotations to the letters. As\nwith the first two volumes, no reference is left\nuncommented upon, no context left unexplained.\nThe result is a vivid, illuminating and rewarding\nportrayal of the historical, social and musical\ncontext in which Britten lived and composed,\nwhich rivals the insights one finds in the letters\nthemselves. \nWhat a contrast this makes with Thomas\nSchuttenhelm’s Selected Letters of Michael Tippett.\nWhere Mitchell, Reed and Cooke are expansive,\nSchuttenhelm is minimalist, providing\ninformation about the circumstances of the\nletters, and personal information about the\ncorrespondents, only when the letters do not\nthemselves make it clear. The result is that our\nattention is placed firmly on Tippett himself: his\nsexuality, his philosophy, his musical inspirations\nand above all his personality radiate from every\npage. \nTippett was a prolific correspondent: the\npresent collection consists of approximately a\nfifth of some 2500 letters that have survived.\nWhereas Britten used afternoon walks to help\ncrystallize his ideas, Tippett used the process of\nletter writing. In a letter to Alan Bush in 1944,\nTippett begins:\nExcuse my writing again. As you may have observed,\nand may remember, I seem to help clear myself (as far\nas I ever get clear) of the dead weight of Weltschmerz\nand other allied emotions, by writing people of intelli-\ngence. This is not so much to bother them, as to give\nmyself the illusion of corresponding, and of discus-\nsion, which I miss very much (p. 133).\n62\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nTen years later, in a letter to Barbara Hepworth\n(the set designer for The Midsummer Marriage), we\nfind the same sentiment: ‘You must be seeing\nmore clearly than I am that I write (as I always do)\nto clear my own mind’ (p. 349).\nIt is perhaps because of Tippett’s desire to\nclarify his own thoughts that he often wrote a\nseries of letters to a specific individual. Thus in\n1936, Tippett began one of his many letters to\nAlan Bush on the subject of politics, and\nparticularly communism, with: ‘Don’t be worried\nby these rows of letters. I get into the habit of\nwriting a whole batch to someone and then stop\nfor a bit’ (p. 124). \nThe association of particular individuals with\nparticular topics may have prompted\nSchuttenhelm’s editorial decision to arrange the\nletters by correspondent, rather than by date.\nWhat this gains in concentration of ideas, it loses\nin overall shape: one has to make disconcerting\nchronological leaps back and forth between\nsections. Grouping by correspondent also seems\nto lead to some needless repetition: on both p. 263\nand p. 332 Tippett describes his conducting ability\nin relation to Britten and Henze in remarkably\nsimilar terms. One wonders if a straightforward\nchronological ordering would have caused one or\nother reference to be omitted. \nWhen varied repetition arises due to Tippett\narticulating his view of a specific event in different\nways, the separation of related letters is clearly to\nthe detriment of the narrative. For instance, in a\nletter written to David Webster at Covent\nGarden, dated 27 July 1954, Tippett cautiously\ndescribes the ways in which the assembling of\npersonnel for The Midsummer Marriage was far\nfrom his satisfaction. But it is in a letter\nreproduced some 46 pages earlier, in a letter to\nEdward Sackville-West, that Tippett’s feelings,\nbarely repressed in his letter to Webster, are made\nentirely clear; indeed, Webster is explicitly\nblamed for the problems Tippett describes. The\nfirst letter really needs to be followed by the other\nto make the fullest sense of the situation. \nAnother such narrative that is dispersed\nthroughout the collection is that of Tippett’s\nrelationship with the conductor John\nMinchinton. His name first appears in passing in\nonly the third letter of the collection (to Adrian\nBoult); the biographical appendix describes\nMinchinton as a ‘conductor and close friend of\nTippett’ (p. 436). More can be gleaned from\nTippett’s autobiography, in which Minchinton\nmakes a brief cameo appearance (Those Twentieth\nCentury Blues, p. 226–8); we learn that the two\nwere for a short while intimate, but this ended\npartly due to Minchinton’s marriage, and partly\ndue to Tippett’s relationship with Karl Hawker.\nBut in Schuttenhelm’s selection of letters, we find\nevidence of Tippett’s considerable generosity and\nsupport of Minchinton, both personally and\nprofessionally (and this is by no means an isolated\ncase), as well as gaining further insight into the\nabrupt end of their dealings.\nMinchinton is not the only figure to emerge\nfrom the selected letters in a new light. Douglas\nNewton, with whom Tippett collaborated briefly\nduring the early stages of The Midsummer\nMarriage, may not have had a significant role on\nTippett’s artistic development, but as a friend and\n– as it transpires – a lover, was nevertheless an\nimportant psychological and physical support for\nTippett during the war years. Thus in 1943,\nTippett writes ‘for some reason of circumstance\nrelations with you are more satisfying in fact than\never before with anyone’ (p. 161). The volume of\ncorrespondence to Newton in these selected\nletters is second only to that of Francesca\nAllinson. Sheer volume is of course not enough\nto warrant a reconsideration of Newton’s place in\nTippett’s biography, but the varied content of\nthese letters – sex, music, dreams, conscientious\nobjection – suggests that Newton was closer to\nTippett than had otherwise been presumed.\nThe selected letters are full of revelations and\ninsights such as this. But even more engagingly,\nthey paint a picture of Tippett as a composer well\naware of his full worth. Writing to Newton in\n1942, Tippett suggests that the spirituals in A Child\nof our Time, which Sackville-West had described\nas ‘phony’, ‘won’t appear so “phony” in years to\ncome, but will be judged as a historical fact’ (p.\n144). To Britten, shortly after the première of The\nMidsummer Marriage, Tippett noted that ‘for\nbetter or worse, we two are the most interesting\nEnglish music has at the moment’ (p. 205). There\nis no false modesty, or over-inflated ego: Tippett’s\nassessment of his music was invariably spot on,\nand spoken with conviction.\nTippett’s letters, unlike Britten’s, also provide\nan insight into the inspiration behind the music.\nThe protracted genesis of the plot and libretto of\nThe Midsummer Marriage can be discerned from\nletters to a wide range of correspondents; A Child\nof Our Time and The Knot Garden also feature\nprominently. Indeed, Tippett’s comments on\nlibretti and drama in general are an endless source\nof fascination, though one cannot imagine\nBritten would have responded well to Tippett’s\ncriticisms of The Rape of Lucretia (‘I don’t suppose\nthey’ll get all over to you, because our mental\nprocesses are so different. But I should feel lacking\nin friendship if I didn’t hand you over all I have, as\nfar as I can’ [p. 199]).\n  63\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nI could go on: barely an aspect of Tippett’s\npersonality, intellectual curiosity, political\naffiliations, views on relationships, etc., remains\nuncovered in this collection. For this,\nSchuttenhelm deserves our praise, and the\nSelected Letters must surely be considered an\nimportant landmark in Tippett scholarship.\nThere are a few minor errors in the index, and one\nnoticeable misidentification of a work (on pp.\n46–7, Tippett is surely writing about the Four\nInventions for recorders rather than the Little Music\nfor String Orchestra), but these mistakes draw\nattention to themselves by virtue of the\notherwise scrupulous care with which\nSchuttenhelm has edited the volume. \nHowever, I cannot leave Schuttenhelm’s\ncontention that ‘the publication of his letters\nenables Tippett to speak for himself ’ (p. xxiv)\nunchallenged. As I argued above, such claims for\nauthenticity are critically unacceptable: in\nchoosing one selection over another,\nSchuttenhelm is by definition imposing his\ninterpretation of Tippett’s personality upon the\nreader. Let me temper this, though, by stating\nthat one imagines that this editorial\ninterpretation has only a slight impact on the\nimage of Tippett that we receive. Although the\npublished letters are only the tip of the iceberg –\nthe other four-fifths remaining submerged – one\ndoubts that the unpublished material would\nsignificantly alter this picture. \nThere is another way in which Schuttenhelm\nprevents Tippett from speaking solely for himself,\nfor he makes frequent elisions to Tippett’s letters,\n‘to eliminate obscure references and repetition’\nand to remove passages that can be conceived as\npart of a continuing exchange which is deemed to\nbe ‘of no relevance’ (p. xxii). Here we do have\nsome idea of what has been omitted, and it\ntranspires that such elisions can have an impact on\nour perception of the composer. For instance,\nSchuttenhelm removes the opening of a letter to\nFrancesca Allinson dated 24 April 1944, which\nleaves remaining an account of Tippett’s progress\non his Symphony No. 1. The result is a\ncorrespondence that maps on closely to David\nMatthews’s comments in the foreword; namely\nthat ‘the letters paint a vivid self-portrait of a man\nconstantly absorbed with ideas that will nourish\nhis overriding concern, his music. He was\nunashamedly self-centred, although perhaps no\nmore so than many other great artists’ (p. xi). \nThe letter in question happened to appear\ncomplete in Tippett’s autobiography: the deleted\nlines at the start of the letter are simply: ‘Sorry to\nsee you poorly again – hope it soon passes over.\nLet me know how things go’ (Those Twentieth-\nCentury Blues, p. 168). An awareness of these lines\ndoes not negate the fact that the bulk of the letter\nis about Tippett, but it can nevertheless colour\nour response to them.\nIn fact, there are quite a large number of letters\nin Schuttenhelm’s selection that have been\nreproduced elsewhere. A small number of those\nwritten to the BBC appeared in Lewis Foreman’s\ncontribution to Michael Tippett: Music and\nLiterature (Ashgate, 2002); there is also a cross-\nover between the section on Eric Walter White\nand White’s chapter on The Knot Garden in his\nTippett and his Operas (Barrie & Jenkins, 1979). A\ngreater amount of replication can be found in the\nletters to Francesca Allinson and Bill Bowen:\nnearly half of the letters to Allinson in Selected\nLetters, and a quarter of those to Bowen, can be\nfound in Those Twentieth Century Blues. Some of\nthis overlap is undoubtedly necessary, but given\nthe vast amount of unpublished correspondence,\nand given the importance of this collection, it is\nregrettable that more ‘new’ material didn’t find its\nway into the final version.\nEdward Venn\nAaron Copland and His World, edited by Carol J. Oja and\nJudith Tick. The Bard Music Festival Princeton\nPaperbacks, $55.00\/£35.95 (cloth), $22.95\/£14.95\n(paper).\nMusic For The Common Man: Aaron Copland During The\nDepression and War by Elizabeth B. Crist. Oxford\nUniversity Press, $35.00.\nThe Queer Composition of America’s Sound: Gay\nModernists, American Music, and National Identity by\nNadine Hubbs. University of California Press, $50.00\n(hardbound), $19.95 paperback.\nComposers keep ‘developing’ even after they die.\nShostakovich, who was not a great composer at\nhis death (at least not in academic circles, or\nAmerican ones, anyway), has become one over\nthe last 20 or so years. Benjamin Britten, who was\nfor all intents and purposes a vocal composer at\nthe end of his life, over the last 15 years or so has\nbecome an instrumental composer. Hindemith in\nthe early 1960s was generally considered one of\nthe three great 20th-century composers, along\nwith Stravinsky and Bartók; now he is a sort of\nsecond- (or third-) tier composer, more or less like\nMilhaud, known for having been an influential\npedagogue, with two or three works in the\nrepertory, otherwise useful as a provider of\nteaching pieces for less usual instruments. Aaron\nCopland, during his lifetime, went from being\n64\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\n‘the Dean of American Composers’ at his prime\nto become a rather unfashionable nationalist\nanachronism in his later years. Yet after his death\nthe popularity of his music increased steadily, and\nhe has moved from being a popular and\nimportant American composer to being the great\nAmerican composer, whose music defines the\nlanguage of American music. \nOne of the ironies of Copland’s status, both\nnow and during his lifetime, was that a politically\nradical-leaning, homosexual, first-generation\nRussian Jew from Brooklyn became the iconic\nrepresentative of American music, whose works\nevoked the physical expanse of the American\nlandscape and the American spirit and character.\nSome of his contemporaries (particularly Roy\nHarris and Virgil Thomson, who felt that they\nhad a more valid claim for the position) found this\na source of some consternation. Thomson\npointed out, with some justice, in American Music\nSince 1910,2 that he had actually got there first in a\nnumber of cases, including writing ballets and\noperas, using hymn tunes and folk music, and that\nhe had shown Copland how it could be done.\nHarris especially felt cheated, since he thought\nthat, having actually been born on the prairies, in\nOklahoma, and on Lincoln’s birthday as well, he\nand his music were the genuine, all-American\nitem, and should be recognized as such.3\nEvery year since 1990 The Bard Music Festival\nhas featured the work of a single composer,\nexploring his achievements, his influences, and his\ncultural surroundings. In each of these cases the\nPrinceton University Press has published an\nassociated book of essays on the composer. The\n2005 festival, featuring Copland, was curated by\nCarol J. Oja and Judith Tick, who also edited\nAaron Copland and His World. Essays dealing with\nCopland’s life (Howard Pollack and Martin\nBrody), his connexion with other arts (Paul\nAnderson, Morris Dickstein, Gail Levin, and Lynn\nGarafola), and his political activities (Elizabeth\nCrist, Beth Levy, and Neil Lerner) are\ncomplemented by analytical essays about his\nPiano Sonata (Larry Starr) and his three famous\nballets (Elliott Antokoletz). His complete\ncorrespondence with his friend the composer and\ncritic Arthur Berger, whose 1953 book was the\nfirst extended treatment of Copland’s music,4 and\nexcerpts from his correspondence with Leonard\nBernstein are also included, along with annotated\ntranscripts of the post-concert discussion of the\nNew York Composers’ Forum-Laboratory\nfeaturing Copland in 1937 and of a television\ninterview with visiting Soviet composers on\nWGBH in Boston at the height of the Cold War in\n1957. There is also a detailed annotated listing of\ntelevision documentaries about and interviews\nwith Copland, concluding with an extended essay\nby Leon Botstein on the current view of\nCopland’s life and music. Of these, the most\nimmediately appealing are the letters of Copland,\nBernstein, and Berger, which offer glimpses of the\ncharm, intelligence, and seriousness of the real\nperson at the center of the whole project. \nThe examination of Copland’s Jewish identity\nby Botstein and Levy in their respective articles is\nperhaps the most provocative and informative\npart of the book. The position of Jews in the\nUnited States, the way that they are thought of by\nother Americans, and probably even the way they\nthink about themselves as Americans, since the\nSecond World War, is radically different from\nhow things were before it. These days it is all too\neasy not to realize that when Copland’s\ncontemporaries friendly to him and his music\nwrote in the 1920s, 30s and 40s of his prophetic\nvoice or of the Mosaic quality of his work – or,\ngoing even further, spoke of his ‘strong contact\nwith the old testament’,5 or of being reminded by\nhis music of ‘the psalmodic chants for the\nsynagogue with their biblical air of prophecy and\ngloom’6 – they were speaking in very specific\ncoded language. Those who were critical felt free\nto be more explicit. Daniel Gregory Mason,\nunfailingly hostile to Copland, whom he referred\nto as ‘a cosmopolitan Jew’, was alarmed by ‘the\ninsidiousness of the Jewish menace to our artistic\nintegrity’ represented by Copland’s 1925 Music for\nthe Theatre (and Gershwin’s Rhapsody in Blue). He\ndeclared that ‘Our public taste is in danger of\nbeing permanently debauched … by the\nintoxication of what is, after all, an alien art’.7\nEdward Burlingame Hill wrote to Virgil\nThomson, concerning Music for the Theatre, that it\ndisplayed the ‘usual clever Hebraic assimilation of\nthe worst features of polytonalitité’.8 Even Lazare\nSaminsky, composer, critic, and director of music\n2 Virgil Thomson, American Music Since 1910 (New York: Holt,\nRinehart and Winston, 1970), pp. 55–58.\n3 Harris was inordinately proud of the fact of the date of his\nbirth, and often reminded people of it. Legend has it that on\none of those occasions Roger Session pointed out to him that\nlightning never strikes twice in the same place. \n4 Arthur Berger, Aaron Copland (New York: Oxford University\nPress, 1953).\n5 John Kirkpatrick, ‘Aaron Copland’s Piano Sonata’, Modern Music\n19.4 (1942), p. 246.\n6 Berger, p. 52.\n7 Quoted from Daniel Gregory Mason, ‘Is American Music\nGrowing Up? Our Emancipation from Alien Influences’,“ in\nArts and Decoration, November 1920.\n8 Letter from Edward Burlingame Hill to Virgil Thomson, 5\nDecember 1925.\n  65\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nat New York’s Temple Emanu-El during the\n1920s, in his comments about Copland (‘His\nneurotic drive and stringent intellectualism are\ntypically Jewish, but of the worst sort’9) and about\nJews in general (‘… race of extraordinary\ndefiniteness of psyche, race mentally polar to a\nnation aggressively Western, would preclude\neven a shade of sterling Americanism in a\ncomposer of recent adoption. In even a son or\ngrandson of an outlander’10) writes in language\nsomewhere between Wagner’s pronouncements\nabout Jews in music and The Protocols of the\nElders of Zion.\nElizabeth Crist, who is represented in the\nOja\/Tick collection by the essay ‘Copland and the\nPolitics of Americanism’, writes about Copland’s\npolitics and the political intentions and\nimplications of his best-known music in greater\nlength and detail in Music for the Common Man:\nAaron Copland During the Depression and War.\nAlthough never a member of the Communist\nParty, Copland’s political leanings were definitely\nprogressive, and throughout the 1930s and 40s he\nwas actively aligned with a host of radical causes\nand organizations. His association with the\nComposers Collective of the Pierre Degeyter\nClub, the Communist Party’s music organization,\nresulted in his mass song, Into the Streets May First,\nan entry in a competition to set the text by Alfred\nHayes. (His setting won; the prize was publication\non the front page of the Communist journal New\nMasses.) \nBy the mid-1930s the American Communist\nParty, at the behest of the Comintern in Moscow,\nhad shifted its strategy away from a militant idea\nof proletarian culture (matched with a militant\nmusical modernism by leftist composers) to a\nmore inclusive leftism, which aimed to join non-\ncommunist liberals and progressives with\nworkers, farmers, and the middle class in\nopposition to reactionary forces. This movement\nwas widely known as The Popular Front. Even\nthough the initial impetus for The Popular Front\nmay have come from the Comintern, Crist agrees\nwith the contention of Michael Denning11 that it\nwas a larger cultural phenomenon, driven not by\nthe communists, but by non-communists\nsocialists and independent leftists, ‘marking out a\nculture that was neither a Party nor a liberal New\nDeal culture’.12 Politically the Popular Front\nfocused on ideas of democracy, anti-fascism,\nracial equality, and social justice; culturally it\nevoked American history and folklore. Folk music\nwas considered the authentic expression of the\nAmerican people, and composers were urged to\nmake use of it. During the early 30s Copland\nbecame preoccupied with the project of writing a\nmusic which maintained the highest standards of\nmodernism but at the same time would be\ncomprehensible and appealing to mass audiences. \nThe pursuit of this project led him to develop a\nstyle of ‘imposed simplicity’, often using folk\nsongs; but it also led him to seek work in more\ndemotic media, such as radio, movies, opera, and\nballet. It also had influence on his choice of extra-\nmusical subject matter that celebrated American\nhistory and communitarian values, along with\nindividual and personal expression and\nresponsibility, in an attempt to create and foster\nan ideal liberal democratic community. It was\nimportant to Copland that this more demotic\nmusic was not less serious or even qualitatively\ndifferent from his earlier, more ‘abstract’ music,\nand he was not pleased with the distinction that\nArthur Berger made between his ‘severe’ and\n‘simple’ styles in an article about his Piano\nSonata.13 Copland hoped that his music intended\nfor a wider public would draw audiences into\nconcert halls where they could encounter those\nmore abstract works. \nCrist traces in a clear and engaging manner the\nhistory of Copland’s political and musical\nactivities, from his association with the\nComposers Collective of the Pierre Deygeter\nClub in the early 1930s; his work on Into the Streets\nMay First; the radical and abstract Short Symphony,\nStatements, and Piano Variations; through his\nearliest work with folk material in El Salon Mexico;\nhis first film score, The City; the high school\nopera, The Second Hurricane; the three famous\nballets; and the most famous war-time works, A\nLincoln Portrait, Fanfare for the Common Man, and,\nclimactically, the Third Symphony. This history is\naccompanied by a serious consideration of the\npolitical contexts, intentions, and subtexts of\nthese works, along with thorough analyses of the\nmusical content of each and thoughtful\nexamination of the connexions between the\nintentions and content. Crist also manages to\ncontinually emphasize Copland’s personal\nintegrity in his dedication to his musical and\npolitical ideals and toward the realization of a\ndistinctive and distinguished American music. \n9 Lazare Saminsky, Music of Our Day: Essentials and Prophecies\n(New York: Thomas Y. Crowell Company, 1939; repr. Freeport,\nN. Y.: Books for Libraries Press, 1970), p. 152.\n10 Saminsky, p. 161.\n11 Michael Denning, The Cultural Front: The Laboring of American\nCulture in the Twentieth Century (London: Verso, 1997).\n12 Denning, p. 5, quoted in Crist, p. 20.\n13 Arthur Berger, ‘Copland’s Piano Sonata’, Partisan Review 10, no.\n2 (March–April, 1943), pp. 187–90. Copland’s letter of 10 April\n1943 to Berger regarding this article is in Oja\/Tick, pp.191–2.\n66\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nIn her chapter on Copland’s ballets, she\ncontrasts the rather superficial, but real, ways in\nwhich they have become the reference point for\nmusical evocations of the American West – and,\nby extension, the American spirit – with the\nintentions of Copland, the choreographer\nEugene Loring, and the impresario Lincoln\nKirstein, all of them leftist intellectuals, which\nwere to explore American social conflicts and\ncultural contradictions in the realization of Billy\nthe Kid. In her consideration of Rodeo, Copland’s\nother Western ballet, her focus is more on the\npossible sexual subtext, both for Copland and for\nAgnes de Mille, the choreographer.\nThe issue of Copland’s homosexuality has\nbecome as important for scholars as that of his\npolitics. Nadine Hubbs has made it the central\nsubject in her book about the formulation of the\nmodernist tonal style which has come to be\nconsidered quintessentially American. The flavor\nand substance of Hubbs’s book is probably\nencapsulated in the following passage:\nCopland was ideally suited to his position, within the\nexclusively male realm of twentieth-century composi-\ntion, of generous and patient mentoring – but not by\nvirtue of any identity or experience in the paterfa-\nmilias role, for indeed he had none. Copland’s qualifi-\ncations, rather, was that he was a gay daddy par\nexcellence. His embrace of the classic pederastic\nmodel and his belief in the societal benefits afforded by\npederastic love and mentoring were cast early in\nCopland’s life as a gay man. (p.11)\nHubbs sees the American tonal modernist style as\nhaving been formulated by Virgil Thomson,\nunder the influence of Gertrude Stein, and then\nmined, refined, and popularized by Copland. She\nquotes Ned Rorem as claiming that Copland (‘the\nqueer’) and Thomson (‘the pansy’) were ‘the\nfather and mother [respectively] of American\nMusic’ (p.13). \nThe first chapter of the book is devoted to\nproposing a reading of Stein’s ‘abstract’ text for\nFour Saints In Three Acts as a queer text explicitly\nabout gay life. Hubbs sees the ultimate result of\nthe combination of Catholic allusions, the\nlibretto, and Thomson’s music as being camp\n(‘…a specifically queer social critique…’, p.55)\nand, therefore, as simultaneously disguising and\nrevealing its creators (who included, along with\nStein and Thomson, the choreographer Frederick\nAshton and Maurice Grosser, Thomson’s lifelong\ncompanion, who devised the scenario, all of them\ncheered on by Carl Van Vechten, the novelists and\nphotographer, who was their common friend,\nand who was very involved in promoting Four\nSaints and their other work) as ‘sexual outlaw[s],\nqueer in gender and sexuality’ (p.25). Hubbs\n  67\n2006 Contemporary Music\nTitles from Ashgate.\nVisit our website or request a\ncatalogue for more details.\nMusic Theory and Analysis in the\nWritings of Arnold Schoenberg\n(1874–1951)\nNorton Dudeque\nJanuary 2006 Hardback £50.00\nWomen Composers and Music\nTechnology in the United States\nCrossing the Line\nElizabeth Hinkle-Turner\nFebruary 2006 Hardback £47.50\nA Soviet Credo: Shostakovich’s Fourth\nSymphony\nPauline Fairclough\nFebruary 2006 Hardback £55.00\nRuth Gipps\nAnti-Modernism, Nationalism and Difference\nin English Music\nJill Halstead\nMarch 2006 Hardback £45.00\nThe Music of Mauricio Kagel\nBjörn Heile\nAugust 2006 Hardback c. £45.00\nThe Soundscapes of Australia\nMusic, Place and Spirituality\nEdited by Fiona Richards\nSeptember 2006 Hardback c. £50.00\nNadia and Lili Boulanger\nCaroline Potter\nOctober 2006 Hardback c. £42.50\nThe Correspondence of Alan Bush\nand John Ireland\n1927–1961\nCompiled by Rachel O’Higgins\nDecember 2006 Hardback c. £59.50\nwww.ashgate.com\n15% discount when ordering online\nEnquiries: Tel: +44 (0)1252 331551\nE-mail: info@ashgatepublishing.com\nOrders: Tel: +44 (0)1235 827730\nE-mail: ashgate@bookpoint.co.uk\nCall us for a copy of our new catalogue\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nmakes much of Stein’s abstraction (Stein would\nprobably have preferred to consider it cubism14) as\nthe means by which the what she sees as being the\nsubject of the opera, gay life, is both exposed and\nobscured.15 She sees this as being consonant with\nthe necessary covertness which gay men and\nwomen at the time were forced to assume in\nregards to their sexual identity.\nThis argument is not completely convincing. It\nis true that Thomson wrote that the subject was\n‘the life we were both living’, but he explicitly\nidentified that life as ‘the working artist’s working\nlife’,16 for which the saints’ religious life was a\nmetaphor, rather than the ‘gay life’ which Hubbs\nclaims is depicted by the activities of the many\nsaints in the opera. In her overarching argument\nregarding Thomson and Stein, she completely\nneglects to consider their other opera, The Mother\nof Us All. On the one hand one might suspect that\nthis is due to the fact that their later opera has the\nappearance of being much more straightforward,\nand thus is less open to being construed however\none might wish. On the other, since it features a\nsame-sex couple – Susan B. and her companion\nAnne, whose relationship is presented\nunambiguously and as an unremarkable fact (and\nwho, of the several partnerships in the opera, are\nthe only ones to have a completely satisfactory\nand successful relationship) – its omission from\nthe argument is puzzling. Although Hubbs posits\nthe connexion between features of Thomson’s\nlanguage and that of Copland’s Popular Front\nstyle, her discussion of the actual music, in\nexcerpts of their compositions is cursory and\nrather general, pointing up elements that they do\nshare, but which they also share with many other\npieces by many other composers, both gay and\nstraight. \nIn the rest of the book Hubbs considers the\nrelationships of Copland and Thomson to a\nnumber of other homosexual American\ncomposers (most prominently Ned Rorem and\nPaul Bowles, less thoroughly Marc Blitzstein,\nLeonard Bernstein, David Diamond, Samuel\nBarber, and Gian Carlo Menotti) and the possible\nlinkage between their sexuality and the tonal\nmodernist language they employed. She also\nconsiders the inclination of most of them\ntowards French music, in contrast to the more\ndissonant, less tonal, possibly more German-\noriented language which became predominant\nafter the Second World War, and which was\napparently much more the domain of\nheterosexual composers. She also discusses the\nrumors of a ‘homosexual mafia’ or ‘Homintern,’\nconcerning the worldly success of these\ncomposers during the war and postwar years: a\nparticular vintage of sour grapes that intertwined\nwith both homophobia and McCathyist anti-\ncommunism. She comes perilously close to\nclaiming that Congressman Fred Busbey’s\nnotorious protest at the inclusion of A Lincoln\nPortrait in a concert celebrating the presidential\ninauguration of Dwight Eisenhower – which led\nto the removal of the work from the concert and\nwas the beginning a number of political problems\nfor Copland personally – was due to the fact that\nCopland’s music was not 12-tone (pp. 164–5).\nThat misses the real fact that it was what he knew,\nor thought he knew about Copland’s politics, not\nanything about the actual music, which was\nobjectionable to the congressman and his allies. \nAlthough the book is accurate in its discussion\nof many of the historical and espistemological\naspects of its topic, its actual engagement with\nthe music of the composers it deals with is hardly\nexistent. One is left with the nagging feeling that\nit has taken negative stereotypes which many gay\npeople have, for a long time, tried to prove false\nand to overcome, warmed them over, dressed\nthem up, and then presented them back more or\nless the same, except as positives.\nThe concentrated attention to Copland and his\nmusic afforded by these three books leave the\nlasting impression of work of remarkable\nseriousness, integrity, and quality, produced by a\nman dedicated to the proposition that his music\ncould be of some use and value to the world. His\ncomment about his overall purpose in being a\ncomposer, expressed in conversation with Vivian\nPerlis, was\nI think basically you compose because you want to\nsomehow summarize in some permanent form your\nmost basic feelings about being alive. Life seems so\n14 ‘First of all, Tender Buttons, subtitled Objects: Food: Rooms, is\nan essay in description, of which the subjects are those com-\nmonly employed by painters of still life. And cubist painting too\nwas concerned with still life. Cubism’s characteristic device in\nrepresenting still life was to eliminate the spatially fixed view-\npoint, to see around corners, so to speak, to reduce its subject\nto essentials of form and profile and then to reassemble these\nas a summary or digest of its model. Resemblance was not for-\nbidden; on the contrary, clues were offered to help the viewer\nrecognize the image; and cubist painters (from the beginning,\naccording to Gertrude) had been disdainful of viewers who\ncould not “read” their canvases. (Today’s “abstract” painters, on\nthe other hand, maintain that in their work resemblances are\npurely accidental.)’ – Virgil Thomson, Virgil Thomson (New\nYork: Alfred A. Knopf, 1966), pp. 172–73.\n15 ‘Whereas Stein celebrated quotidian pleasures in occult lan-\nguage, the decadents celebrated occult pleasure in relatively\nquotidian language’ (Hubbs, p. 59). By virtue of its abstract for-\nmal characteristics, Four Saints already evinces a “refusal of\n[and] withdrawal from social normativity” that may be said to\nmirror queerness and other kinds of social marginality and\nresistance’ (Hubbs, p. 49).\n16 Thomson, Virgil Thomson, p. 90.\n68\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\ntransitory that it seems very attractive to be able to set\ndown in either words, or tones, or paint, or some way\nsome sort of permanent statement about the way it\nfeels to live now today. So, that when it’s all gone\npeople will be able to go to the art work of the time\nand get some sense of what it felt like to be alive.17\nEven though the reception of a composer’s\nwork changes with time, the work itself is\nconstant. The evaluation of Copland’s career by\nhis friend, rival, and fellow crusader for American\nmusic, Virgil Thomson, still rings true: \nHe has never turned out bad work, nor worked\nwithout an idea, an inspiration. His stance is that not\nonly of a professional but also of an artist–responsible,\nprepared, giving of his best. And if that best is also the\nbest we have, there is every reason to be thankful for\nits straightforward employment of high gifts. Also, of\ncourse, for what is the result of exactly that, ‘this\nsimple and great man in our midst.’18\nRodney Lister\nPolish Music since Szymanowski by Adrian Thomas.\nCambridge University Press, £60.00.\n‘Music is now something above nationality, above\nidentity’ proclaims Daniel Barenboim, his\nloudhailer recent advertisements for the West-\nEastern Divan Orchestra’s debut recording.19\nReaders of Adrian Thomas’s study of the searches\nfor identity undertaken by Polish composers\namidst the tumult of Poland’s 20th century will\nbe encouraged to develop more nuanced views\non this matter. In Polish Music since Szymanowski,\nThomas demonstrates how recent Polish music\nand music-making can be read both to reflect and\nto transcend their immediate socio-political\ncontexts. In turn, the book illustrates how this\ntipping point of critical ambiguity remains one of\nthe richest sites for serious commentary on the\nart – especially when a detailed interplay of\ncontext and content is meticulously conveyed, as\nhere, by a scholar with an eye for the enthralling\nhistorical panoply of his topic and an ear for the\nmost telling analytical detail.\nTake Thomas’s discussion of Lutosl⁄awski’s\nConcerto for Orchestra (1950–54), ‘the\nimagination, scale and socialist-realist relevance\nof which were recognized immediately’, he\nwrites, in Stalinist Poland (p. 76). As Thomas\nexplains, the piece’s rhetoric ‘is remarkably close\nto the grandiosity of other contemporary Polish\npieces’ (77), as is its use of 18th-century genres\nand, most crucially, folksong-inspired materials.\nBut ‘Lutosl⁄awski’s genius’, Thomas argues, ‘was\nnot to make heavy weather of these archaic\nresources’ (77), and to fuse them with treatments\nof folk materials not as socialist-realist window-\ndressing, but rather as themes filled with\nsymphonic potential. Consequently, because the\npiece’s ‘materials, goal-directed structure and\nclear expressive idiom epitomized many of the\nideals of socialist realism’, while reconfiguring\nthe possibilities of the multi-movement\norchestral work in a composition of dazzling\ninventiveness, it is ‘definitively a creature of its\ntime as well as, miraculously, a transcendence of\nit’ (79). \nFor this review to highlight Lutosl⁄awski, of\ncourse, is to invoke the clichéd canon of Polish\nmusic (focusing next, one would expect, on\nGórecki and Penderecki) that Thomas’s book so\ndeftly deconstructs. His ‘revisionist ambition’\n(xvii) is to contextualize and counterpoint the\nstudy’s inevitably detailed discussions of the big\nPolish names through its recognition of the\ndiversity, richness and sheer profusion of decent\nand, sometimes, outstanding music that has been\ncomposed in Poland since 1900. Consequently,\nthe study does not merely rewrite the book on\nPolish music: it compels one to rethink the\nWestern European-centric narrative of\nmodernism which remains at the heart of most\ntellings of that tale.20 Instead of modernism (or for\nthat matter neo-classicism, postmodernism, or\nany other ‘ism’ one cares to invoke), one must,\nthis book reminds us, think modernisms (etc., etc.).\nSo alongside Szymanowski and the big post-war\nthree, Panufnik, Bacewicz, Szabelski, Baird,\nSerocki, Szalonek, Schaeffer, Meyer, Krauze,\nSikorski, Kilar, Knapik, Lason´, and a latter day\n‘Young Poland’ to parallel Szymanowski’s artistic\nmilieu (Kulenty, Szyman´ski, Knittel, Talma-Sutt\nand Wielecki), to name but a few, are analysed\nand contextualised here. If one does not know\nsome (or even most) of these composers (and\nwho but Thomas does, outside Poland?), this\nbook will function as a provocation both to\ninvestigate an extraordinary new repertoire –\nincluding music that, like the pieces which first\ninspired Thomas’s interest in Polish music in the\n17 Vivian Perlis and Libby Van Cleve, Composers’ Voices from Ives to\nEllington: An Oral History of American Music – transcipt,\nwww.yale.edu\/oham\/CD2transcript.html\n18 Thomson, American Music Since 1910, p. 58.\n19 See, for example, the back page of The Guardian, ‘Friday\nReview’, 9 September 2005.\n20 The lack of any kind of broad appraisal of Central-to-Eastern\nEuropean modernisms is a serious flaw, for instance, in both the\ndesign and execution of Nicholas Cook and Anthony Pople,\neds, The Cambridge History of Twentieth-Century Music\n(Cambridge: Cambridge University Press, 2004). \n  69\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nlate 1960s, often manages ‘to be both\ncontemporary and communicative as well as\nsounding totally different from [contemporaneous]\nWestern European music’ (xvii) – and to\nreconstruct one’s personal narrative of 20th-\ncentury music.\nThe composer focuses are contextualised\nwithin a five-part, basically chronological\nstructure which pivots around externally imposed\nturning points in the development of Polish\nmusic. ‘The captive muse’ examines the\ninterlinked impacts of World War II (a time when\n‘any expression of Polishness could prove fatal’,\n16) and the Soviet imposition of socialist-realist\nideals (statement in the journal Ruch Muzyczny\nfrom 1945: ‘The sooner good music reaches the\npeasant and the worker, the sooner we can look\ninto the future with absolute certainty’, 41). The\ndiscussions here of Turski’s Symphony No. 2,\nOlympic (1948) and Panufnik’s Symphony of Peace\n(1951) are masterly, offering balanced musical\ncomments where others would merely treat the\npieces concerned as symptoms of a malaise;\nindeed, these chapters and the next few deserve to\nbecome set texts on any music and politics\nmodule, as ‘Facing west’ examines the re-\nengagement of Polish musicians with the\nWestern avant-garde after Stalin’s death, with a\nparticular focus on the ‘Warsaw Autumn’ festivals\nin 1956 and 1958–61. Thomas thereby seeks to\ntake full advantage of ‘a rare opportunity to\nexamine creative responses to external stimuli\nfollowing a period of cultural repression’ (92) –\nresponses including the manifold sonorisms of a\n‘Polish School’ diverse enough to include\nPenderecki’s Threnody (1960), Schaeffer’s Nonstop\n(1960), Dobrowolski’s tape experiments,\nGórecki’s Genesis I: Elementi (1962) and Szalonek’s\nLes sons (1965), as well as Bacewicz and\nLutosl⁄awski’s judicious accommodations with\nexperimentalism. An extraordinary time. \n‘The search for individual identity’ following\nthe Polish thaw then occupies part three and,\narguably, the final two sections (‘Modernism and\nnational iconographies’ and the three-page\npostscript ‘After Lutosl⁄awski’). Following the\ndouble whammy of socrealizm and the shock of\nthe new in the mid-1950s, the Polish composers’\nsearches for identity form a hall of mirrors\nreflecting Szymanowski’s much earlier dualistic\nstruggle ‘to achieve not only Poland’s musical\nidentity but also his own’ (8). Szymanowski wrote\nof his desire to let ‘all streams from universal art\nmingle freely with ours’, maintaining contact\nwith culture beyond Poland’s shifting boundaries\n‘because it is only on such a plane that a truly\ngreat, living art, including nationalistic music, can\nflourish’.21 Such creative wrangling, proceeding\nthrough communism, the rise and fall of\nSolidarity, and into the harsh new world of a truly\ndemocratic Poland, forms the source material for\nthe composer portraits and thumbnail sketches\nthat Thomas provides in the second half of the\nstudy, as the focus of his book shifts from (to\ngeneralize) extra-musically enforced musical\nidentities to self-made identities, the ultimate\ndiversity of which was nonetheless shaped,\nironically, by Poland’s experience of stifling (pre-\nthaw) socio-political and (post-thaw) aesthetic\nideologies. In this respect, supporting appendices\nusefully chart the fast-moving socio-political\nevents of 1953–6, the ‘Warsaw Autumn’\nprogrammes from 1956–61 (a good place to start\nrevising one’s narrative of 20th-century music,\nincidentally, with usual and unusual ‘Western’\nsuspects counterpointing their ‘Eastern’\ncolleagues), and pivotal Polish events from\n1966–90. \nFor historians reading Polish Music since\nSzymanowski, Thomas’s fundamentally analytical\nfocus may sometimes get in the way of the socio-\ncultural narrative; for composers, analyst-critics\nand new music enthusiasts, the analyses may not\nalways go far enough. Thomas would probably\nrecognize this tension; his previous and\nforthcoming publications (existing monographs\non Bacewicz and Górecki, forthcoming books on\nPoland’s socialist-realist ‘Dark Decade’ and\nLutosl⁄awski’s Cello Concerto) speak to the need\nfor a mobile depth of field in historically-\ninformed analysis (or analytically-informed\nhistory writing). However, that Thomas is able to\nundertake such a diversity of surveys is a clear\nmarker of the present book’s greatest source of\nstrength: its writer’s 30-plus years of active\nengagement with the music, culture and people\nof Poland. The book is bursting with insights – it\nis an astonishingly realized synthesis, but could\nclearly have been profitably longer – all delivered\nwith a degree of critical balance that Polish\ncommentators may find difficult (or unappealing)\nto match. Consequently, while the book is\nbounded by discussions of death (Szymanowski’s\nand Lutosl⁄awski’s), Thomas’s palpable\nenthusiasm for his topic and discriminatingly\nlively writing perfectly complement his\ninvestigation and overriding acclamation of the\ninextinguishability of Polish musical life. \nNicholas Reyland\n21 Karol Szymanowski, ‘On Contemporary Musical Opinion in\nPoland’ (1920), in Alastair Wightman (trans and ed.),\nSzymanowski on Music (London: Toccata Press, 1999), p. 93.\nQuoted in Thomas, Polish Music since Szymanowski, p. ix.\n70\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nRonald Stevenson: The Man and his Music. A Symposium\nedited by Colin Scott-Sutherland. With a Foreword by\nLord Menuhin. Toccata Press, £45.00. \nUpon receiving this volume for review, my first\ntemptation – and a strong one it was – was to give\nit an unqualified rave, since for people like me\nwho really care about Ronald Stevenson’s music,\nthe mere appearance of this book represents\nsomething of a watershed. It would have indeed\nbeen easy for me to sweep all critical faculties\naside in favor of a blind endorsement; anything to\nurge listeners and performers alike to find out\neverything they can about this most astonishing\nand compelling musician.\nIt is therefore my greatest pleasure to be able to\nreport that the book not only lived up to my\nhopes, but in many respects surpassed what I had\nexpected. It is true that it was bound to do that in\nany case, since it told me many things I hadn’t\nbeen aware of in regard to the remarkable\nbreadth of Stevenson’s output. With the\nexception of opera and electronic music, he has\nmanaged to represent almost every genre within\nthe realm of concert music, and has done so with\nutmost craftsmanship and artistry, putting a very\npersonal stamp on anything he touched. It should\nalso be said that, although the influences in his\ncompositional output are many and varied,\nranging from ‘serious’ music of all eras, folk- and\nworld- music to Busoni (a very strong presence\nthroughout his oeuvre), he has managed to fuse\nand internalize them into a deeply individual\nlanguage in which one never feels a trace of\nartificiality or second-handedness.\nEvery care seems to have been taken to pay\nhomage to Stevenson’s life-work, and each of the\ncontributors writes generously and with great\ndetail. Ates¸ Orga’s chapter, devoted to the piano\nmusic, is as descriptive and all-encompassing as\none could wish; many of the shorter pieces are\nexamined, which is most welcome and essential,\nconsidering the overwhelming importance of\nlarger works such as the Passacaglia on DSCH or the\nPrelude, Fugue and Fantasy on Busoni’s ‘Doktor Faust’.\nOther chapters, which examine the choral\nmusic, his numerous songs, his orchestral works\nand his chamber music, are all equally\nilluminating. Each of the authors is profoundly\nacquainted with the composer’s aesthetic, in\naddition to having had the chance to know him\npersonally and to experience first-hand the\nriveting way he can discuss all matters musical. I\nmyself feel fortunate in having had the great\npleasure of his company on a number of\noccasions.\nMartin Anderson has provided a very usefully\ndetailed list of works, which covers 79 pages.\nMany musical examples have been provided\nthroughout the book, and this is of course always\na welcome feature, especially for someone so\nunder-represented in the concert hall as\nStevenson is. But an especially attractive feature\nto me is the inclusion of several facsimile pages of\nthe composer’s own manuscripts; this particular\nselection consists entirely of shorter pieces\npresented in their entirety, and it allows us the\nbonus of being able to enjoy the composer’s\nexquisite calligraphy.\nPublishing ventures such as this are exactly\nwhat is needed to pull performers away from their\ntendency towards a sameness of repertoire.\nThere is some vital music to be discovered in\nStevenson’s work; anyone curious enough to\nexamine what he has given us will discover some\nof the richest, most sincere and, in many cases,\nmost accessible music written during the last\ncentury.\nMarc-André Hamelin\nPrince of Virtuosos: A Life of Walter Rummel, American\nPianist, by Charles Timbrell. Scarecrow Press, £29.00 \/\n$44.95.\nYour reaction might well be, as mine was, Walter\nwho? It is extraordinary that a pianist of Walter\nRummel’s eminence can have been so completely\nforgotten – a warning in itself not to trust what\n‘posterity’ hands down to us as the ways things\nhappened: the celebrated winnowing process of\nhistory is a capricious business. Yet the title of\nCharles Timbrell’s biography of Walter Rummel\ncomes from a comment by Debussy, whose Douze\nÉtudes he premièred, and a close friend;\nMengelberg called him ‘one of the greatest\npianists I know’, and d’Albert confessed that ‘his\nplaying moved me deeply’. These endorsements\ncome from the first paragraph of Timbrell’s\nprologue (there are many more later: in 1922, for\nexample, Paul Le Flem ranked him ‘one of the\nbest pianists of our time’ – and remember who\nelse was active then); and as one progresses\nthrough the book, the story becomes ever more\nastonishing. ‘The basic facts of Rummel’s life\nwould suit a Hollywood film’, Timbrell states,\nsomewhat optimistically: a screenplay along these\nlines would soon invite incredulity.\nJohann Walter Edward Rummel – American\ndespite the name and his Berlin birth, on 19 July\n1887 – was a grandson of Samuel Morse, inventor\nof the eponymous code; he later took in his\n  71\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\ngrandfather’s name, concertizing as Walter\nMorse Rummel. He was a student of Godowsky, a\ngrand-student of Liszt, a friend of Pound, Shaw\nand Yeats. He enjoyed a passionate, three-year\naffair with Isadora Duncan, which ended when he\ntransferred his attentions to Duncan’s daughter,\nAnna. His third wife became the mistress of\nLeopold III of Belgium, with Rummel’s consent.\nHe took to Steiner’s anthroposophy and claimed\nin all seriousness to have discovered the site of the\nTemple of the Holy Grail – indicating an\nunworldliness that was later to prove his undoing. \nThough he seems not to have bought into the\nNazis’ racism (in 1921, living in Munich, he had\nbeen infuriated by the anti-Semitic attacks on\nBruno Walter, chief conductor of the opera\nthere, in the Nazi newspaper, Der völkische\nBeobachter, and had given shelter to Jewish\nrefugees in Paris in 1932–33) the influence of his\npro-Nazi third wife, Francesca Erik, appears to\nhave pushed him into the arms of the Germans.\nHe repeatedly endorsed the Nazis’ anti-\nmodernism (in 1941, for instance: ‘We are\nwitnessing a complete change in the public who,\nweary of the artifices and deceits of a modern\npseudo-art, as well as of modern pseudo-artists,\ndemand a human and wholesome art’ – straight\nGoebbelsgespräch). He played in occupied Europe\nwith the active support of its conquerors as well\nas inside the Reich (his last known war-time\nrecital was in the Grosses Konzerthaussaal in\nVienna in November 1944), he made pro-Nazi\nglorious-dawn statements in the press and on the\nair and he voluntarily acquired German\ncitizenship.\nSmall wonder that at war’s-end he came under\ninvestigation by the FBI – late in 1945 he blithely\nturned up to play for the occupying American\ntroops but was blacklisted by the authorities. The\nyears after the War were spent performing where\nhe could, from a base in the south-west of France.\nHe died on 2 May 1953, when a rash of obituaries\ngarnered him the last press attention he would\ncommand for another half-century, until\nTimbrell’s researches bore this fruit. \nA 77-minute CD with the book confirms the\nsterling qualities of Rummel’s pianism. Opening\nwith three of his 25 Bach transcriptions, and\ncontinuing with Liszt, Beethoven, Brahms,\nChopin and Mendelssohn, it reveals a player who\nmanages to combine a calm and dignified manner\nwith a sense of spontaneity; his tone is warm and\nthe textures limpidly clear, not least because of his\nawareness of colour.\nThe principal shortcoming in Timbrell’s book\nis that his interest in Rummel the man and pianist\ndoes not extend to Rummel the composer.\nGranted, the loss of all his large-scale works (a\nSong of the Virgin Mother for voice, strings, flutes,\nharp and trumpet, 1910; a Poème for violin and\norchestra, 1922; Invocation to the God of Earth for\ncontralto and orchestra, 1929; a piano concerto,\nSOS, based on the distress call of his grandfather’s\ncode, 1931–34; a Requiem for contralto, double\nchorus and orchestra, 1934; and a Cantata for the\nCity of Lyon, 1946–47) puts assessment of\nRummel as musical architect and orchestral\ntechnician beyond us. (It seems that in his later\nyears, down on his luck, he would leave his scores\nas IOUs in hotels, with the intention of reclaiming\nthem when he could afford to settle the bill – and,\nof course, he never could.) Rummel’s four\nchamber scores (a warmly received violin sonata\nof 1907–8, a piano trio, Divine Youth, of 1909, a\n1910 string quartet, From the Depths, and an\nImpression for violin and piano from around 1934)\nare likewise missing. Yet there are around 40\npublished songs – sung in their day by the likes of\nTeyte, Nordica, Anderson, Steber, Gerhardt,\nSlezak and McCormack – and four suites for\npiano. But Timbrell goes nowhere near them:\nthere’s no discussion of Rummel’s style, no\nindication of its influences and qualities, not a\nmusic example in sight – his compositions aren’t\neven indexed. \nIt’s still a fascinating tale, but this major\nomission means that Timbrell’s improbable\ndiscoveries also bring disappointment, like a\nmagnificent meal prepared with insufficient salt.\nDon’t let that stop you reading it, though.\nMartin Anderson\n72\nhttp:\/\/journals.cambridge.org Downloaded: 07 Dec 2010 IP address: 194.80.32.10\nG Y Ö R G Y  K U R T Á G\nK a f k a  F r a g m e n t e ,  O p .  2 4\nJuliane Banse: soprano \nAndrás Keller: violin \nTo celebrate György Kurtág’s 80th birthday on 19 February 2006, \nECM issues his longest work to date, the Kafka Fragments for soprano and\nviolin, in a new recording made in close co-operation with the composer. \ne\nEC\nM\n N\new\n S\ner\nie\ns1\n90\n5 \n  C\nD\n 4\n76\n 3\n05\n2 \nEC\nM\n N\new\n S\ner\nie\ns1\n93\n1 \n  C\nD\n 4\n76\n 3\n05\n3\nEC\nM\n N\new\n S\ner\nie\ns1\n93\n0 \n  C\nD\n 4\n76\n 3\n04\n8 \nEC\nM\n N\new\n S\ner\nie\ns1\n96\n5 \n C\nD\n 4\n76\n 3\n09\n9 \nApril releases: \nT I G R A N  M A N S U R I A N A r s  P o e t i c a   \nConcerto for mixed choir a cappella \nArmenian Chamber Choir \/ Robert Mlkeyan: conductor \nECM New Series 1895   CD 476 3070 \nG I A C I N T O  S C E L S I N a t u r a  R e n o v a t o r  \nFrances-Marie Uitti: cello \/ Munich Chamber Orchestra \/ Christoph Poppen: conductor \nECM New Series 1963   CD 476 3106\nMail order from Music Connection: 01233 334884 or email musconnection@aol.com \nFor information on all of ECM’s recordings of Arvo Pärt and free mailings about new releases contact: \nECM Marketing, New Note, Pinnacle Building, Teardrop Centre, London Road, Swanley, Kent BR8 8TS or email ecm@newnote.com \nECM Records, Postfach 600 331, D-81203 München    www.ecmrecords.com \nB A R R Y  G U Y\nF o l i o\nMaya Homburger: baroque violin \nMuriel Cantoreggi: violin \nBarry Guy: double-bass \nMunich Chamber Orchestra\nChristoph Poppen: conductor \nA hugely ambitious piece…Guy proves himself a composer of sure\ninstincts with this absorbing work, which combines spontaneity and\nshapeliness, stasis and excitement. \n– Stephen Pettitt, Sunday Times \nT I G R A N  M A N S U R I A N\nS t r i n g  Q u a r t e t s  &  Te s t a m e n t\nRosamunde Quartet  \nAndreas Reiner: violin\nSimon Fordham: violin\nHelmut Nicolai: viola\nAnja Lechner: violoncello \nThis is a work of ravishing if crepuscular beauty, deeply tonal, whose\nmelodic language is partly influenced by a song by the much-loved\nArmenian national composer Komitas. \n– Calum MacDonald, International Record Review \nA R V O  P Ä R T\nL a m e n t a t e\nDa pacem Domine \nThe Hilliard Ensemble\nLamentate \nAlexei Lubimov: piano \nSWR Symphony Orchestra Stuttgart\nAndrey Boreyko: conductor \nReleased on the occasion of Arvo Pärt’s 70th birthday in September 2005 \nThis is truly overwhelming music and Pärt’s vast vision is magnificently\ncaptured in absolutely stunning recorded sound.  \n– Marc Rochester, International Record Review\n"}