{"doi":"10.1111\/j.1753-318X.2010.01075.x","coreId":"58738","oai":"oai:nora.nerc.ac.uk:8816","identifiers":["oai:nora.nerc.ac.uk:8816","10.1111\/j.1753-318X.2010.01075.x"],"title":"Review of methods for deriving areal reduction factors","authors":["Svensson, C.","Jones, D.A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"The design of hydraulic structures requires knowledge of how much rain is likely to fall within a certain amount of time, and over a specific area. Point rainfalls are only representative for a very limited area, and for larger areas the areal average rainfall depth is likely to be much smaller than at the point of maximum observed depth. The estimation of areal reduction factors is concerned with the relationship between the point and areal rainfalls. This relationship has been found to vary with, for example, predominant weather type, season and return period. Methods for estimation of areal reduction factors include empirical and analytical methods. The current design guidelines in the United Kingdom are based on an empirical method, but since they were issued in 1975, several new analytical methods have been proposed. These methods are discussed, and recommendations for an update suitable for United Kingdom conditions are made","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/58738.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/8816\/2\/N008816PP.pdf","pdfHashValue":"010cc75d724235afbb1f3156f1f70b254be3ae15","publisher":"Blackwell Publishing Ltd.","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:8816<\/identifier><datestamp>\n      2014-08-22T09:55:31Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533233<\/setSpec><setSpec>\n      7375626A656374733D533137<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8816\/<\/dc:relation><dc:title>\n        Review of methods for deriving areal reduction factors<\/dc:title><dc:creator>\n        Svensson, C.<\/dc:creator><dc:creator>\n        Jones, D.A.<\/dc:creator><dc:subject>\n        Meteorology and Climatology<\/dc:subject><dc:subject>\n        Hydrology<\/dc:subject><dc:description>\n        The design of hydraulic structures requires knowledge of how much rain is likely to fall within a certain amount of time, and over a specific area. Point rainfalls are only representative for a very limited area, and for larger areas the areal average rainfall depth is likely to be much smaller than at the point of maximum observed depth. The estimation of areal reduction factors is concerned with the relationship between the point and areal rainfalls. This relationship has been found to vary with, for example, predominant weather type, season and return period. Methods for estimation of areal reduction factors include empirical and analytical methods. The current design guidelines in the United Kingdom are based on an empirical method, but since they were issued in 1975, several new analytical methods have been proposed. These methods are discussed, and recommendations for an update suitable for United Kingdom conditions are made. <\/dc:description><dc:publisher>\n        Blackwell Publishing Ltd.<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8816\/1\/N008816PP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Svensson, C.; Jones, D.A..  2010  Review of methods for deriving areal reduction factors.   Journal of Flood Risk Management, 3. 232-245.  https:\/\/doi.org\/10.1111\/j.1753-318X.2010.01075.x <https:\/\/doi.org\/10.1111\/j.1753-318X.2010.01075.x>     \n <\/dc:identifier><dc:relation>\n        http:\/\/onlinelibrary.wiley.com\/doi\/10.1111\/j.1753-318X.2010.01075.x\/abstract<\/dc:relation><dc:relation>\n        10.1111\/j.1753-318X.2010.01075.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/8816\/","http:\/\/onlinelibrary.wiley.com\/doi\/10.1111\/j.1753-318X.2010.01075.x\/abstract","10.1111\/j.1753-318X.2010.01075.x"],"year":2010,"topics":["Meteorology and Climatology","Hydrology"],"subject":["Publication - Article","PeerReviewed"],"fullText":" © NERC (CEH). Journal of Flood Risk Management © 2010 CIWEM and Blackwell Publishing Ltd \nThis version available http:\/\/nora.nerc.ac.uk\/8816\/  \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the journal \narticle, incorporating any revisions agreed during the peer review \nprocess. Some differences between this and the publisher’s version \nremain. You are advised to consult the publisher’s version if you wish \nto cite from this article. \nwww.wiley.com\/  \n \n \n \n \n \nArticle (refereed) \n \n \n \nSvensson, C.; Jones, D.A.. 2010 Review of methods for deriving areal \nreduction factors. Journal of Flood Risk Management, 3. 232-245. \n10.1111\/j.1753-318X.2010.01075. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnoraceh@ceh.ac.uk \n \n \n \nThe NERC and CEH  trade marks and logos (‘the Trademarks’) are registered trademarks of NERC in the UK and \nother countries, and may not be used without the prior written consent of the Trademark owner. \n  1\nReview of methods for deriving areal reduction factors \n \nCecilia Svensson and David A. Jones \n \nCentre for Ecology and Hydrology, Wallingford, OX10 8BB, UK \n \n16 July 2010 \n \n \nAbstract \n \nThe design of hydraulic structures requires knowledge of how much rain is likely to fall \nwithin a certain amount of time, and over a specific area. Point rainfalls are only \nrepresentative for a very limited area, and for larger areas the areal average rainfall depth \nis likely to be much smaller than at the point of maximum observed depth. The estimation \nof areal reduction factors (ARFs) is concerned with the relationship between the point \nand areal rainfalls. This relationship has been found to vary with, for example, \npredominant weather type, season and return period. Traditionally, ARF estimates are \nbased on empirical methods though, more recently, a range of analytical methods have \nbeen applied. The review has found that no method is unambiguously correct. However, \nthe traditional data-intensive, empirical, fixed-area methods still have advantages, \nincluding probabilistically correct ARF estimates and applicability over a comprehensive \nrange of spatial and temporal scales. Although the analytical techniques try to put ARF \nestimation on a sounder scientific basis, they tend to rely on simplified assumptions \nand\/or are only applicable within limited scales. The use of radar is problematic because \nof inhomogeneities and short data records, as well as possible biases in the ARF \nestimates.  \n \nKeywords: Areal rainfall, areal reduction factor, design rainfall, methodology, rainfall \n \nCorresponding author: Cecilia Svensson, csve@ceh.ac.uk \n \n \n \nAccepted for publication in Journal of Flood Risk Management (Chartered \nInstitution of Water and Environmental Management, Blackwell Publishing) \n \nThe definitive version is available at www.blackwell-synergy.com \n \nhttp:\/\/onlinelibrary.wiley.com\/doi\/10.1111\/j.1753-318X.2010.01075.x\/abstract \n  2\nIntroduction \n \nAreal reduction factors are used in the construction of design rainfall events which are \nneeded for the design of hydrological structures. A design rainfall event consists of a \nspecification of a set of rainfall depths varying in space as well as time. There are two \nphilosophically different ways to approach this specification. Firstly, observed events can \nbe transposed or entire rainfall fields can be generated by a computer model, as a \nstochastic series of space- and time-rainfalls that reproduces the observed behaviour (e.g. \nSeed et al. 1999). Secondly, a simplified representation can be used. For example, an \nobserved temporal rainfall profile can be combined with a uniform spatial rainfall \ndistribution to obtain a design rainfall event. This review paper is concerned with the \nderivation of the magnitude of this spatial rainfall from point rainfalls, via the concept of \nan areal reduction factor (ARF). The ARF denotes the ratio between the areal average \nrainfall and a point rainfall. There are several different ways to define this ratio, which \ncan lead to ARFs with different properties. \n \nThe use of ARFs is convenient because networks of raingauges with long series, which \nare needed for accurate rainfall frequency estimation, are generally sparse, and do not \nallow for an appropriate characterisation of the associated spatial rainfall patterns. Denser \nnetworks may be available for more recent decades, or for special study areas, and these \ndatasets can be used to study spatial rainfall variability. The spatial information can \nsubsequently be combined with a point rainfall frequency estimate from the long-term \ndataset, to obtain an areal rainfall frequency estimate. Methods for estimating point \nrainfall magnitudes are reviewed in Svensson and Jones (submitted). \n \nAn outline of how various factors influence the ARF is given below. A description then \nfollows of methods used to estimate ARFs, and suitable methods for re-examining ARFs \nin a modern context are suggested. \n \n \nFactors influencing the areal reduction factor \n \nSeveral different issues affect the ratio between the spatial average rainfall over an area, \nand a point rainfall in that area. These issues include factors relating to the characteristics \nof the rainfall itself, but also to the physical characteristics of the catchment, and to the \ndata and methods used to derive the ARF. \n \n \nFactors relating to rainfall characteristics \n \nDifferent synoptic weather types produce different spatial rainfall patterns (e.g. Huff and \nShipp 1969; Skaugen 1997; Einfalt et al. 1998). Skaugen (1997) classified daily rainfall \nevents in southeast Norway into convective showers and frontal rainfall, and concluded \nthat the spatial averages for large-scale frontal events do not reduce much in magnitude \nwith increasing area, whereas for small-scale convective events they do. Using a more \ndetailed classification, Huff and Shipp (1969) found that the decay in spatial correlation \n  3\nis smaller in storms occurring in low pressure centres than at the fronts associated with \nmidlatitude cyclones, and that it is greatest in air mass storms. \n \nSkaugen (1997) found that the difference in ARF curves (ARF plotted against area) \nbetween convective and frontal events in Norway becomes more pronounced for higher \nreturn periods (i.e. for more extreme rainfall events). ARFs for both convective and \nfrontal events decrease with increasing return period, but the rate of decrease for \nconvective events is considerably greater than for frontal events. Using data from North \nCarolina and New Jersey in the United States, Allen and DeGaetano (2005a) also found \nthat the areal rainfall is smaller compared with the corresponding point rainfall (i.e. the \nARF decreases) at higher return periods. Similar results were obtained for Texas by \nAsquith and Famiglietti (2000). In contrast, when analysing areal rainfall in Switzerland, \nGrebner and Roesch (1997) found that ARFs were independent of return period, at least \nfor areas greater than 500 km2. For smaller areas there was some variation between the \nARF curves for different return periods, but the authors thought this may be caused by \nthe limited ability of the network to detect centres of convection (about 1 gauge per 100 \nkm2) and the shortness of the reference period (13 years). \n \nAllen and DeGaetano (2005a) found that the ARFs are smaller in the warm season than in \nthe cold, presumably in response to increased convection in summer. Huff and Shipp \n(1969) found a similar seasonal difference, in that the decay with distance of spatial \ncorrelation patterns of precipitation was greater in May-September than in the cold \nseason. The decrease in ARF with increasing return period may also reflect the \nimportance of convection in producing very heavy point rainfalls. \n \nSkaugen (1997) noted that the point rainfall extremes associated with the convective type \ntends to occur inland, whereas the maxima of the large-scale events usually occurred \nnearer the coast. Other investigators also note that ARFs vary with geographical location \nand climate, presumably because of a difference in the predominant rainfall generating \nmechanisms. For example, Omolayo (1993) suggests that 1-day ARFs are generally \nhigher in the United States than in Australia, and Zehr and Myers (1984) suggest that \nARFs decline more rapidly in the semi-arid southwestern United States than in the rest of \nthe country. The latter finding is supported by Asquith and Famiglietti (2000) who found \nthat ARFs are higher in eastern United States than in Texas.  \n \nARFs reported for the United Kingdom (UK) in the Flood Studies Report (NERC 1975) \nshow more sharply decreasing ARFs with increasing areas for shorter durations than for \nlonger ones (Figure 1). This feature was also noted by Ramos et al. (2005) when \ninvestigating rainfalls of 6 to 90 minutes duration in Marseille, France. Sivapalan and \nBlöschl (1998) explain that the rationale for this is that short-duration events (i.e. \nconvective) are small in areal extent. Other authors do not find much variation in ARF \nwith the duration of rainfall, probably because they are not studying as wide a range of \ndifferent durations as presented in the Flood Studies Report (which lists durations from 1 \nminute to 25 days), and\/or are considering comparatively long durations. Clark and \nRakhecha (2002) investigated heavy rainfalls of one to three days’ duration in India for \nareas up to 20,000km2, and did not find any real difference in ARFs between these \n  4\ndurations. Huff (1995) studied shorter durations, between 3 and 24 hours, in the midwest \nof the United States, and came to the same conclusion. He attributed the similar \nbehaviour to the large dependence between heavy rainfall events of different durations. In \nhis study, most of the 24-hour storms were also found in the shorter-duration samples. \n \n \n \nFigure 1.  Areal reduction factors for precipitation in the United Kingdom presented \nin the Flood Studies Report (diagram derived from tabulated values in \nNERC (1975)). \n \n \nFactors relating to catchment characteristics \n \nSo far, research suggests that the effect of catchment characteristics, such as catchment \nshape, topography and urbanisation, on ARFs is small. \n \nAn elongated catchment shape would result in different ARFs depending on whether the \ntypical rainfall isohyets (resulting from the shape of the typical rainfall system and\/or its \ndirection of movement) were aligned along the catchment or perpendicular to it. \nHowever, when investigating rainfall fields and ARFs from a theoretical multifractal \nperspective, Veneziano and Langousis (2005) conclude that the effect of catchment shape \nis generally small, and also notes that very highly elongated catchments are rare. \n \nLeeward and windward effects of hills and mountains on rainfall may affect the ARFs. \nThiessen polygon and inverse distance weighting methods used to compute areal \nprecipitation do not directly account for topography. Because raingauge networks tend to \nbe sparser at higher elevations (e.g. Prudhomme and Reed 1999) they may not adequately \nrepresent areal precipitation at high altitudes. Allen and DeGaetano (2005a) suggested \nadjusting for this when spatially interpolating rainfall amounts. However, they found that \ntopographical rainfall biases appear to be insignificant for the estimation of ARFs.  \n \nHuff (1995) noted that there may be a difference in the reduction factor between urban \nareas and the surrounding rural areas. Eight storms in Chicago were found to have a \nslower rate of decrease in the reduction factor within 500 km2 of the urban storm centre \n  5\ncompared with 67 rural storms. For larger areas, the rate of decrease for urban storms \nexceeded that for the rural storms. However, this sample of storms is rather small, and \nnatural variability in spatial rainfall characteristics is large, so Huff concluded that this \nanomaly could also be due to natural variation rather than an urban rainfall effect. \n \n \nFactors relating to data and methodology \n \nBecause of the temporal variability in rainfall, the periods of data collection may \ninfluence the ARF estimates (e.g. Asquith and Famiglietti 2000). Asquith and Famiglietti \n(2000) also noted that three overlapping raingauge networks around Houston, Texas, did \nnot give the same ARFs, and concluded that differing precipitation-monitoring networks \ncannot be indiscriminately combined. However, as far as only station density is \nconcerned, Allen and DeGaetano (2005a) conclude that for North Carolina and New \nJersey the influence of differences in station density and interpolation method appear to \nbe insignificant.  \n \nThe use of different methodologies to estimate ARFs is likely to result in different ARF \nestimates. The next section comprises a review of ARF estimation methods, including the \nuse of radar data. \nMethods for ARF estimation \n \nMethods for estimation of areal reduction factors include empirical and analytical \nmethods. In many countries the current design guidelines are based on empirical \nmethods, including in the UK where they were issued in 1975 (NERC 1975). However, \nsince then several new analytical methods have been proposed. These include methods \nbased on correlation analysis, crossing properties, scaling relationships and storm \nmovement. Radar rainfall data have also become available in many parts of the world, \nand at improving spatial and temporal resolutions. Empirical and analytical methods for \nARF estimation, as well as the potential for use of radar rainfall data, are discussed in this \nsection. Notations have sometimes been changed compared with the original source \ndocuments in order to keep them reasonably consistent within this review. \n \n \nEmpirical methods \n \nEmpirical methods are generally data intensive and computationally laborious, but they \nlargely don’t rely heavily on distributional or other assumptions about the rainfall \nprocess.  \n \nGeographically fixed versus storm-centred approaches \n \nEmpirical ARF estimation can be divided into two categories, “geographically fixed” or \n“fixed-area” approaches on the one hand, and “storm-centred” approaches on the other \nhand (e.g. Omolayo, 1993).  \n \n  6\nIn the storm centred approach, the region over which the areal rainfall is estimated is not \nfixed, but changes for each storm. The centre point for the approach is the point \nobserving the maximum rainfall, which also changes for each storm. The areal reduction \nfactor is given by  \n \nARF = Parea \/ Ppoint,          (Eq. 1)       \n \nwhere Parea is the areal storm rainfall enclosed by a selected isohyet (the rainfall in the \nenclosure is everywhere at least as large as the value of the isohyet), and Ppoint is the \nmaximum point rainfall at the storm centre. \n \nAsquith and Famiglietti (2000) note that storm-centred approaches have not seen \nwidespread application, partly because of difficult implementation on multi-centred \nstorms. In contrast, the fixed-area approach takes an extreme value of the areal average \nrainfall over a geographically fixed area (such as a catchment) and divides it by a \ncorresponding value of the point rainfall that is typical for the area. \n \nOmolayo (1993) also points out that storm-centred approaches are not correct for \nestimating areal rainfall of a particular frequency from point rainfalls. This is because \nextreme point rainfalls and extreme areal rainfalls are unlikely to be produced by the \nsame storm, or storm type. For example, localised convective events may produce very \nheavy point rainfalls, but may not result in a large areal rainfall. Omolayo (1993) \nsuggests that to obtain the probabilistically correct ARF for a duration D, the T-year areal \nrainfall over a region, Parea, of size A should be divided by the (wi-weighted) average T-\nyear point rainfall, Pi, of all the gauges i in the same region: \n \n[ ]∑\n∑\n=\ni\nii\ni\ni\narea\nTDPw\nw\nTDAP\nTDAARF\n),(1\n),,(),,( .      (Eq. 2) \n  \nThus, this necessitates a fixed-area approach. Note that the ARF defined in this way (Eq. \n2) is radically different from that for the storm-centred approach (Eq. 1). \n \nA variant of the fixed-area approach is described by Yoo et al. (2007), who apply a \nmixed distribution based on the concept of rainfall intermittency (wet and dry periods, \nwith a continuous Gamma distribution fitted to the wet periods) for estimating rainfall \nreturn periods, T. This method uses all the daily data available, rather than the traditional \nway of fitting an extreme value distribution to the annual maxima series. For ARF \npurposes, only the 1-day duration is studied, and subsequently a function is fitted to the \nempirically estimated ARFs for various areas A, as \n \n1)(0.1),( −−−= bAaeMTAARF . \n \nThe parameters M, a and b are estimated for each return period considered. \n \n  7\nStorm-centred approaches may be used for probable maximum precipitation (PMP) \npurposes, because PMP does not have an associated frequency estimate. However, the \nstorm-centred approach does generally not result in a conservative ARF estimate. \nSivapalan and Blöschl (1998) note that storm-centred ARFs are usually somewhat \nsmaller than geographically fixed ARFs. There are probably at least two reasons for this. \nIf the ARFs are derived from storms with a heavy point rainfall, then these storms may be \ndominated by convective events with a limited areal extent. Also, the heaviest point \nrainfall of a storm may often be located outside the boundaries used for a fixed-area \napproach.  \n \n \nThe US Weather Bureau method \n \nMany “traditional” empirical methods disregard any effect of return period on the ARF, \nalthough such effects are now acknowledged. The method developed by the US Weather \nBureau in Technichal Paper No. 29 (U. S. Weather Bureau 1957-1958) remains the most \ncommonly used method in the US (Allen and DeGaetano 2005a) although alternative \nmethods have been proposed in the intervening years (see below). The US Weather \nBureau method has the advantage of being intuitive to apply, although it is somewhat \nlaborious. It does not take return period into account, as only short rainfall series from \ndense networks were available at the time the method was developed. The gauges in the \nstudy were nearly uniformly spaced, but weighted rainfall estimates could be \nrecommended for uneven networks. The method relates the mean of the annual maximum \nareal rainfall series to the mean of the annual maximum point measurements at all \nstations, i, and in all years, j. With the annual maximum point rainfalls denoted Pij, and \nthe point measurements making up the annual maximum areal event denoted P’ij , the \nARF is calculated as: \n \n∑∑\n∑∑\n=\nj i\nij\nj i\niji\nTP29 P\nPw\nARF\n'\n.        (Eq. 3) \n \n \nSmall-scale study \n \nA three-year experimental monitoring program in France focused on ARF estimation \nusing a dense network of 9 gauges covering up to 4 km2 for durations from 5 minutes to 4 \nhours (Desbordes et al. 1984). The 58 largest events, as measured by resulting discharge \nat the urban catchment outlet, were studied using two methodologies. These methods \nresemble, but do not quite conform to, the above concepts of storm-centred and fixed-\narea methods. For the “storm-centred” approach the largest point rainfall recorded in the \nstudy area for each event and duration was noted, and the concurrent areal rainfall \n(calculated using Thiessen polygons) was divided by it. The authors note that the actual \ncentre of the storm would probably in most cases be located outside of the study area, and \nthe areal reduction factors would thus most likely recede more quickly than those \n  8\nestimated from the available data. The ARFs for each duration were averaged separately \nbefore being analysed. \n \nFor the “fixed-area” approach the largest point rainfall of a given duration at each gauge \nfor each event was selected, and the concurrent areal rainfall of the same duration was \ndivided by it (the “storm-centred” ARFs are a subset of the fixed-area set). Some of these \nARFs are therefore greater than 1. The ARFs for the individual events and gauges were \nsubsequently averaged for each duration. These averaged ARF estimates are greater than \nthe “storm-centred” ones, but it is not clear how they would compare with those of more \nstandard methodologies like, say, the US Weather Bureau method. One may speculate \nthat they would be larger because all the point rainfalls have been used, and because of \nthe frequent occurrence of the selected events (on average 19 per year). The large number \nof selected events makes good use of the data collected during the short experiment, but it \nis at the expense of events not being representative of extreme rainfalls. It seems unlikely \nthat the ARFs would be strictly probabilistically correct (i.e. relating an areal rainfall of a \ncertain return period to a point rainfall of the same return period), but the magnitude of \nthe difference is unknown. \n \nThe initial selection of the 58 events based on discharge most likely captures the largest \nareal rainfalls, and because of the small size and high gauge density of the study area \nprobably also the largest point rainfalls. However, in a larger area it would be safer to \nselect rainfall events based on the rainfall rather than the discharge, as isolated heavy \nrainfalls may not have caused extreme runoff.  \n \nMethods used in the United Kingdom \n \nThe fixed-area method currently used in the UK, presented in the Flood Studies Report \n(NERC 1975), does not take return period into account, as the effect was assumed to be \nsmall. In this method, the annual maximum areal rainfall over a particular region is \nfound, and the point measurements, P’ij, at station i and year j of these areal events are \nnoted. Independently, the annual maximum point rainfalls, Pij, at each station i for year j, \nin the region are noted. For each region of area A and for each duration D, the ARF is \ncalculated as \n \n∑∑=\nj i ij\nij\nFSR P\nP\nIJ\nARF\n'1\n \n \nwhere I is the total number of stations in the region, and J is the record length (years). \nThis is a simplification of the US Weather Bureau method described above, and was \nadopted for computational convenience. It makes the assumption that “an average of \nratios” can safely approximate “a ratio of averages” (NERC 1977), which may be \nconsidered as somewhat unorthodox.  \n \nBell (1976) re-examined the ARFs in the Flood Studies Report with regard to, among \nother things, the assumption that ARFs are independent of return period. He did so by \nfitting frequency distributions to the areal and point annual maximum rainfall series, and \n  9\nthen calculating the ARF as the ratio between the areal and point rainfall estimates of the \nsame return period. The method involves ranking the annual maximum (Thiessen-\nweighted) areal rainfall series, and then also ranking the annual maximum point rainfall \nseries at each individual station in the area. To obtain a single point rainfall frequency \ncurve that is representative for the area, the Thiessen-weighted mean of annual maximum \npoint rainfalls of the same rank were computed. Frequency distributions were then fitted \nto the areal and point rainfall series and the ARFs calculated for different return periods. \nBell (1976) found evidence for more rapidly decreasing ARFs with increasing return \nperiod, but concluded that using the ARFs calculated according to the Flood Studies \nReport (NERC 1975) resulted in conservative ARF estimates. \n \nEssentially following Bell’s (1976) method, Stewart (1989) re-evaluated the ARFs for an \nupland area in northwest England. Stewart introduced a standardisation of the rainfall \nthrough division by the mean annual maximum rainfall, so that the ARF’s were derived \nusing rainfall growth curves rather than actual rainfall frequency curves. This has the \neffect of allowing locational variations to be represented by differences in the mean \nannual maximum values, while return period effects are represented through the growth \nfactors. For this particular region, the ARFs for daily durations, derived using raingauge \ndata, are lower than those presented in NERC (1975). Similarly to Bell’s study, ARFs \nwere found to decrease with increasing return period, and this rate of decrease increases \nwith area. ARFs were shown to be weakly correlated with latitude and showed a stronger \nrelationship with Standard Average Annual Rainfall (SAAR). \n \nVariations of Bell’s method have also been applied to rainfall in Australia by Siriwardena \nand Weinmann (1996) and Porter and Ladson (1993). However, the current Australian \ndesign guidelines (ARR 2001), suggests using ARFs derived by the United States \nWeather Service for Chicago (Myers and Zehr 1980) or Arizona (Zehr and Myers 1984), \ndepending on which Australian climatic zone the ARFs will be applied to. This method is \ndiscussed below. \n \n \nNational Weather Service method \n \nThe current national United States approach to ARF estimation is outlined in NOAA \nTechnical Report NWS 24 (Myers and Zehr 1980). It is based on frequency analysis of \nannual maximum rainfall at pairs of stations, and the distance between them. The \ndefinition of the ARF, taking into account the return period of the rainfall, is a \nrestatement of Eq. (2) as \n \n)0,,(\n),,(),,(\ntfX\nAtfXAtfARF\nA\nA\nNWS ∆\n∆\n=∆ , \n \nwhere XA(f, ∆t, A) is the areal average rainfall of frequency f and duration ∆t over area A, \nand XA(f, ∆t, 0) represents point rainfall of frequency f and duration ∆t. The precipitation \nmagnitudes X at frequency f are estimated using Chow’s (1951, 1964) general equation \nfor frequency analysis,  \n  10\n \nσµ )(K)( ffX += , \n \nwhere µ  is the mean and σ  is the standard deviation of the population of X’s, and K(f) is \nthe frequency factor for the Gumbel fitting of a Fisher-Tippet type I distribution.  \n \nRather than estimating µ  and σ  from samples of point and areal rainfalls directly, the \nmethod was developed to take advantage of series of annual maximum two-station \naverage rainfall, and from certain other statistics derived for station-pairs. The µ  and σ  \nare estimated for station-pairs at various distances and for various durations, and a \nsmoothing surface is then fitted to each parameter in the distance-duration-space. From \nthese statistics, upper and lower bounds of the moments µ  and σ  of the “true” areal \naverage rainfall are estimated by (a rather involved) theory developed for the purpose. \nThe positions of the areal moments between these bounds are then set by a calibration \nwith the moments of a limited number of annual maximum multi-station averages. \n \nThis method explicitly takes into account the variation of ARF with return period. It uses \nstatistics of station-pairs and small five-station networks, which reduces the need for \nlarge, dense networks with concurrent data observations. Because the station-pairs and \nfive-station networks are located at random locations within an area, there is an \nassumption of isotropy in the spatial rainfall field. Hence, the case of elongated \ncatchments with rainfalls typically aligned in one direction or other is not considered (a \nfeature not unique to this method). However, it is questionable whether the complicated \nmethodology used is justified as precipitation observations become more plentiful with \ntime. \n \n \nAnnual-maxima centred method \n \nAsquith and Famiglietti (2000) present an annual-maxima centred approach to ARF \nestimation and apply it to study areas in Texas, United States. It uses the concurrent \nrainfall measurements surrounding a point annual maximum, and does a pair-wise \ncalculation of the ratio of rainfall between each surrounding gauge and the target (annual \nmaximum) gauge. The ratios are then plotted against the distance between the gauge-\npairs, and a function is fitted. This is done separately for each return period, i.e. those \nratios surrounding, say, five-year or greater annual point maxima are plotted together. \nARFs can be estimated from the function by spatially integrating the ratios for a user-\nspecified area. It is labour-saving as it does not require prior spatial averaging of \nprecipitation, explicit determination of spatial correlation coefficients or explicit \ndefinition of a representative area of a particular storm in the analysis. However, its \napplication requires a dense network of gauges in the study area. The method results in \nmore rapidly decreasing ARFs than the US method presented in Technical Paper No. 29 \n(U. S. Weather Bureau 1957-1958). This seems reasonable for two reasons. Firstly, other \nauthors have found faster declining ARFs in the drier southwestern United States than in \nthe eastern areas for which the Weather Bureau based their estimates (e.g. Zehr and \nMyers 1984). Second, the storms are selected based on heavy point rainfalls, which \n  11\nmeans that the largest areal rainfall events may not be represented at all. The population \nof events selected will not be as focussed on heavy point rainfalls as a storm-centred \napproach, but is still likely to result in more rapidly decreasing ARFs than fixed-area \nestimates, as discussed previously. Thus it seems questionable that the method will result \nin a “probabilistically correct” ARF, as this ARF multiplied by the point rainfall of a \nparticular return period may not result in an areal rainfall of the same return period, but \nmore likely in a less extreme one. However, the size of the discrepancy is unknown, and, \nfor any method, a small difference may be acceptable when considered in conjunction \nwith a method’s other advantages. \n \n \nSpatial correlation structure \n \nThis collection of methods that are based on estimates of the spatial correlation of the \nrainfall field are perhaps more elegantly formulated than the traditional empirical \nmethods. However, they rely on assumptions such as isotropy and particular statistical \ndistributions of the rainfall process. They still require a reasonable amount of data to \nestimate the model parameters, and hence the ARF. \n \nRodriguez-Iturbe and Mejía method \n \nRodriguez-Iturbe and Mejía (1974) introduced a method of estimating ARFs using the \ncorrelation, ρd, between two gauges separated by a “characteristic correlation distance” in \nthe study area. The characteristic correlation distance, d, measures the mean separation \nbetween two points randomly chosen in the area, and thus depends on the size and shape \nof the area. The ARF depends only on the correlation, and is calculated as \n \ndRIMARF ρ= . \n \nThe method assumes a particular spatial correlation structure, either an exponentially \ndecaying function or a Bessel-type correlation structure. Other assumptions include the \npoint precipitation being both isotropic and Gaussian with a zero mean. This distribution \nis not a typical characteristic of extreme, shorter-duration precipitation. When the \nprecipitation is non-Gaussian, there will not be an exact correspondence between the \nfrequency factors of the point and areal precipitation extremes. That is, the method will \nhave a problem associated with it that is similar to that of storm-centred approaches. \nHowever, whereas typical storm-centred approaches generally result in more quickly \nreceding ARFs, this may not be the case for the Rodriguez-Iturbe and Mejía method. \nBecause this method uses all precipitation data, rather than just extreme events, it is not \ncertain that the likely result will be an un-conservative ARF estimate, as less extreme \nevents may be spatially more evenly distributed than heavier events.  \n \n \n  12\nSivapalan and Blöschl method \n \nSivapalan and Blöschl (1998) point out that in the Rodriguez-Iturbe and Mejía method \nthe mean of the areally averaged rainfall does not change with the averaging area. \nSivapalan and Blöschl (1998) consider this feature to be more appropriate for the parent \nrainfall process rather than to the extreme value process, and therefore propose an \nextension to the Rodriguez-Iturbe and Mejía method. The new method makes use of the \nspatial correlation structure while looking at the extreme value distributions rather than \nthe parent distributions only. The authors consider it appropriate for rainfall systems \nwhich are large relative to catchment area, because it cannot handle finite storm extent or \npartial coverage of the catchment. \n \nThe parent distribution of rainfall intensity at a point is assumed to be exponential. The \nspatial correlation, ρp, of point rainfall intensity is assumed to be isotropic and of the \nexponential type: \n \n( ) \n\n\n\n\n\n−= λρ\nr\nrp exp , \n \nwhere r is the distance between two points and λ is the spatial correlation length \n(interpreted as a measure of the spatial extent of the rainfall field). When the point \nrainfall process is exponentially distributed, the areally averaged rainfall process is \napproximately gamma distributed. To the upper tail of the cumulative gamma distribution \nof areally averaged rainfall intensity, the authors then fit an exponential function. \nThrough the Gumbel (1958) theory of extremes, the parameters of this exponential \nfunction are also the parameters of the Gumbel distribution of areally averaged extreme \nrainfall intensity. The parameters are also functions of the scaled catchment area, A\/λ2, \nand this dependence is used to show how catchment intensity-duration-frequency (IDF) \ncurves change with catchment area. The parameters of the catchment IDF curves for the \nparticular case of zero catchment area (A = 0), are matched with the parameters of \nobserved point IDF curves, resulting in absolute values (rather than functions) of the \nparameters for the catchment IDF curves. For this particular case, this is only possible if \nthe observed point rainfall extremes also follow a Gumbel distribution. Hence, this \nparticular formulation of the method does not cater for the many cases where extreme \npoint rainfall is better fitted by other distributions. Similar to the Rodriguez-Iturbe and \nMejía method, there is also an assumption that the correlation structure of the extreme \nrainfall is the same as for the parent (“average”) rainfall process, which seems unlikely. \n \nEven after some simplification the final expression of ARF is complex, but shows \ndependence on catchment area, spatial correlation length, duration and return period. \nThere is only a weak dependence on duration, whereas in empirical methods this is \ngenerally a major control on the ARF. Instead, it is the spatial correlation length, λ, that is \ncritical in the proposed method, and the authors note that λ and duration are often closely \nrelated to each other and to storm type. For very large return periods, the ARF is a \nfunction of catchment area and correlation structure only. The authors argue that the \ncorrelation length is a more direct and pertinent measure of storm type and governing \n  13\nprecipitation processes than duration is, and that correlation length is therefore more \nrelevant to the estimation of ARFs. However, for hydrological applications the \nconcentration (response) time of the catchment, and hence the rainfall duration, as well as \nits spatial extent, is the design criterion. The concentration time does not only vary with \ncatchment area, but also with other catchment characteristics, such as geology, and \ndensity and configuration of the drainage network. \n \nAlthough the authors refer to the method as “fixed area” rather than “storm-centred”, they \nuse two individual storm events to verify their model, rather than using long and spatially \ndense data sets which would be required for an empirical estimate of fixed area ARFs, \nparticularly if variation with return period is to be shown. The spatial correlation length, \nλ, is estimated visually from isohyetal patterns of the two storms, one small-scale \nconvective event (λ = 1-2 km, duration ~ 4 hours) and one large-scale frontal event (λ = \n60-120 km, duration ~ 96 hours). The suggested ranges of correlation lengths result in \nARF curves that partly envelope the empirically derived storm-centred ARFs.  \n \n \nOmolayo’s method \n \nOmolayo (1989, referenced in Srikanthan 1995) assumes that rainfall depths are log-\nnormally distributed in space, and uses the average spatial correlation coefficient, ρ, to \nestimate the ARF as: \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n−\n−+\n= 1)1(1Kexp T\nn\nnARFOmolayo\nρ\nσ , \n \nwhere KT is a frequency factor corresponding to return period T, σ is the standard \ndeviation of rainfall depth in the log domain, and n is the number of rainfall stations. This \nARF varies directly with spatial correlation coefficient and inversely with return period, \nstandard deviation and the number of raingauges. The ARF depends on the number of \nstations used, and on the area because ρ will depend on the area. The ARF has a lower \nbound which is reached for ρ = 0. Tabulated values of these lower bounds given in \nSrikanthan (1995) for typical values of T, n and σ seem high.  \n \nFor an assumption of normal distribution, the expression of the ARF is \n \nn\nnARFOmolayo\nρ)1(1\n2,\n−+\n=  , \n \nwhich for large n reduces to \n \nρ=3,OmolayoARF . \n \n  14\nThis is similar to the expression derived by Rodriguez-Iturbe and Mejía, except that in \nthis case the correlation coefficient is averaged over the raingauges rather than \nrepresenting the value at a particular separation distance. \n \n \nCrossing properties \n \nThe method described in this section takes a completely different approach to the \nestimation of ARFs compared with the empirical and correlation methods. An elaborate \nstatistical framework for describing the spatio-temporal behaviour of rainfall is used, \nwhich involves several idealised assumptions. However, the calibration of the model \nrequires less data than is needed for ARF estimation using the previously described \nmethods. \n \nThe method of Bacchi and Ranzi (1996) is based on an underlying probabilistic model \ninvolving the crossing properties of extreme rainfall and on spatial and temporal integrals \nof this field. “Crossing properties” here refers to the local behaviour, in terms of spatial \nand temporal derivatives, of the fields at points where a given threshold is crossed. The \nrainfall field is considered in space (two dimensions) and time, and a type of peaks-over-\nthreshold approach is applied in these three dimensions. As the threshold, b, increases, \nthe average number, µb, of local rainfall maxima above the threshold per unit “volume” in \nthe space-time domain is proportional to the rate of crossings of the threshold. The \nauthors assume that the process of crossings converges to a Poisson process: however, \nwhile they do concede that corrections would be needed if clustering of local maxima \noccurs, they do not include any in their analysis. The ARF is calculated as \n \n( ) ),,(\n),,(\n),,(\n),,(\n,,\n11\n& TDAb\nTDAb\nTDAP\nTDAPTDAARF RB ==       \n \nwhere P is the rainfall of duration D over the area A or A1 which has return period T. Here \nA1 denotes the area of a “point” approximated by a 1 km square radar pixel. The notation \nusing b in the second form corresponds to using b for the threshold in the underlying \ntheory. \n \nLet ),,(\n,,\ntyxXX DADA = denote the rainfall field accumulated locally over a duration D \nand over an area A. If the Poisson counting of exceedances holds, the probability that the \nmaxima do not exceed the threshold b within an overall time-period D0 and within an \noverall spatial domain A0 is given by the following exponential relationship: \n \n( )00,, exp) exceeds  noPr()( DAbXbF bDADA µ−== . \n \nHere the dependence of bµ  on the area A and duration D of the accumulated rainfall field \nis suppressed from the notation. The function ),,( TDAb  is found by solving  \n \n  15\n( ) 1\n,\n)( −= KTbF DA  or ( )KTDAb log00 =µ , \n \n \nfor b, where K is the constant to convert the time-units to years. After some further \ndevelopment of the theory, and some data analysis, a formula of the following type is \nderived: \n \n( )\n)3\/(1\n00\n,\nlog\n),,(\nDA\nKT\nDADdATDAb\nβδγ +\n\n\n\n\n\n\n= , \n \nwhere d, γ , δ  and DA,β  are data-fitted constants obtained using observed values of DAX ,  \nfrom a given data set, and where DA,β  varies with A and D.  \n \nIn order to arrive at their expression for the ARF, Bacchi and Ranzi (1996) needed to \nmake a number of assumptions (apparently unjustified in strict terms although the \nassumptions hold for Gaussian fields). These relate to crossing-properties taking each of \nthe x-, y- and t-directions separately and include assumptions about statistical \nindependence between statistics for these directions. The assumptions used are in \naddition to the assumption inherent in the use of a Poisson model for the occurrence of \nlarge rainfalls.  \n \nThe data analysis is limited to a single storm event in a period covering 4 days, which \nseems to be a very small amount of data from which to derive estimates of extreme \nrainfall frequencies. Nevertheless, the functional form of the relationship of \n),,(& TDAARF RB  is of some interest. In particular the results suggest that ARF is \nproportional to a power (close to zero) of ( )KTlog , which would imply a fairly slowly-\nchanging function: the parameter values found by Bacchi and Ranzi (1996) imply a slow \ndecay (i.e. a small negative power). \n \nThe model is calibrated using radar images of an occluded front passing over the eastern \nPo Valley, Italy. That is, the model is calibrated using images from a single, large-scale \nstorm. The authors consider the method to be applicable for small urban catchments no \ngreater than a few square kilometres and with durations up to a few hours. These limited \nscales are presumably necessary for the maxima to be assumed independent in time and \nspace, i.e. for the Poisson assumption. The authors note that the local maxima in the \nstorm used for calibration showed clustering features. They conclude that a more \nextensive analysis of observed rainfall fields is needed to investigate the dependence of \nthe reduction factor on different meteorological regimes and to improve the statistical \nsoundness of the relationships presented. The use of radar data is discussed in a separate \nsection below. \n \n \n  16\nScaling relationships \n \nIt has been noted that empirical ARF curves often display scale-invariant (scaling) \nbehaviour in space and time within particular limits, the scaling regime, which indicates \nthat a multifractal analysis may be successful (e.g. Veneziano and Langousis 2005). The \nattractive feature of a multifractal approach is that statistical properties of complex \ngeophysical data can be characterised over a wide range of scales in terms of a few \nparameters (e.g. Davis et al. 1994). Scaling relationships therefore seem to hold some \npromise for the development of a theoretical framework for ARF estimation. \n \nIn a review paper, Veneziano et al. (2006) discuss different definitions of multifractality \nand outline the theory for deriving ARFs based on counting rainfall exceedances above a \nthreshold in “tiles” making up a unit “cube” in two spatial dimensions plus a time \ndimension. They suggest that if the ARF is insensitive to climate, season, etc., then it can \nbe robustly estimated from just one or very few space-time data sets. However, when the \nmodels are fitted to empirically derived ARFs they need the same amount of data as these \nmethods (while not necessarily spanning as large range of spatial and temporal scales). \nBy being based on a counting exercise, these methods superficially have similarities with \nempirical methods, but the elaborate multifractal framework encompassing the counts \nsets them apart from these. The concept of exceedances was also used in the crossing \nproperties method (Bacchi and Ranzi 1996), but again the theoretical framework here is \ndifferent. \n \nReflecting the scaling properties of rainfall in space and time, de Michele et al. (2001) \npresent a simple model that is calibrated using empirically derived ARFs for Milan, Italy \n(empirical ARFs are derived as the mean of annual maximum areal rainfalls divided by \nthe mean of annual maximum point rainfalls). \n \nb\/b\nz\n*1\nυ\nϖ\n−\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n+=\nD\nAARF Michelede , \n \nwhere A* is the (catchment) area minus the area of the raingauge, D is the duration of the \nrainfall, and ϖ , z, b and υ are fitted parameters. Because only eight years of data were \navailable, the authors did not attempt to develop a model that incorporates the return \nperiod of the rainfall. The model was fitted to durations between 20 minutes and 6 hours, \nand areas between 0.25 and 300 km2. A plot of expected rainfall intensities versus A* \nshows that the model fits the data well for the 1- and 3-hour durations, but slightly less \nwell for the 20 minute and 6-hour durations. The fit also becomes worse for increasing \nsizes of area. The systematic manner in which the model results deviate from the \nobserved data is a worrying feature, suggesting that the scaling regime might be rather \nlimited. However, the authors also fit a model to UK ARFs presented in the Flood Studies \nReport (NERC 1975), with durations ranging from 1 minute to 25 days and areas from 1 \nto 18,000 km2. Although the explained variance of the fitted model is very high, at \nR2=0.96, it is not clear from the scatter plot of modelled and observed ARFs which points \n  17\nrelate to particular durations and areas, and hence it is difficult to judge whether or not \nthere are any systematic biases. \n \nAlso using ARF values presented for the UK in NERC (1975), Veneziano and Langousis \n(2005) deduce that ARFs are scale-invariant with regard to area and duration for \n(roughly) areas, A, between 1000 and 10,000 km2 and durations, D, between 15 minutes \nand several hours. Specifically, the ARF is constant for AD ∝ . Outside these spatial \nand temporal ranges, rainfall increasingly deviates from perfect multifractality, consistent \nwith local intensity fluctuations being smaller than required for scale invariance. \nVeneziano and Langousis (2005) argue further that under perfect multifractality ARFs \nshow asymptotic scaling behaviour with return period. However, they note that this may \nnot apply in reality, or may occur for return periods that are too large to be of practical \ninterest.  \n \n \nStorm movement \n \nIn contrast to previous methods which were empirically or statistically based, Bengtsson \nand Niemczynowicz (1986) take a simplified conceptual physics approach to ARF \nestimation by moving an idealised storm across an area. The resulting ARFs should \ntherefore be more similar to ARFs derived using storm-centred rather than fixed-area \napproaches. The data requirements are limited as the method is applicable to small areas \nand is representative of frequent events. It makes assumptions about the shape and \nmovement of convective rainfalls resulting in a fairly simple ARF calculation. \n \nThe method is intended for urban catchments, up to about 30 km2 in size, and for short \ndurations up to 40 minutes. It is referred to as the moving storm derived areal reduction \nfactor, M-ARF, and was developed using 12 recording raingauges in the city of Lund, \nSweden. The method is based on the movement of convective storms, and ARFs are \ncalculated from rainfall observations at a fixed point (point hyetograph) and storm speed. \n \nThe assumption is made that the shape of the hyetograph and its velocity of movement do \nnot change during the storm’s passage over the area. Since urban areas are limited in \nareal extent, rainfall intensities are not expected to change drastically. Further, the lateral \nrainfall intensity (transverse to the storm’s direction of movement) is assumed to decay \nexponentially, such that \n \nky\nceii\n−\n=  \n \nwhere i is the rainfall intensity at a lateral distance y from the centre, which has rainfall \nintensity ic, and k is a distribution coefficient. The storm speed is derived using a \nregression relationship with concurrent wind velocity at 600 mb height, which is \ngenerally available from nearby airports. The areal rainfall is calculated by integrating the \nrainfall field as it moves across the catchment. This is divided by the point rainfall to \nobtain the ARF estimate. The areal reduction factor turns out not to depend much on \nwhich raingauge hyetograph is used, but average ARFs derived from hyetographs at any \n  18\nthree raingauges give a very stable estimate. The results are reported to agree well with \nempirical ARF estimates of 0.5 years return period. Where hyetographs are not available, \nsynthetic storms such as a block rainfall derived from an intensity-duration-frequency \ncurve may be simulated to move across the catchment. The authors note that ARFs have \nbeen found to depend on return period, and suggest that for design storms this can be \ntaken into account by varying the storm speed and\/or the lateral rainfall intensity \ndistribution.  \n \nThe method assumes a laterally decaying rainfall intensity that is appropriate only for \nsmall convective storms, and the main area of application is in urban hydrology. Hence, it \nis not suitable for application to large catchment areas, or for long durations.  \n \n \nRadar data \n \nTraditional ARF estimation has been carried out using dense networks of raingauges. \nMore recently radar data have become available and several authors have investigated its \nuse as an alternative to using ground observations (e.g. Durrans et al. 2002; Allen and \nDeGaetano 2005b; Lombardo et al. 2006). Radar data provide a much improved spatial \ncoverage compared with even the more dense raingauge networks, resulting in good \nindications of the spatial patterns of rainfall. However, radar records are short, \nparticularly for the finest spatial resolutions. The quantitative measurements are also poor \ncompared with raingauge data, although this might be overcome by using raingauge-\ncalibrated radar data. \n \nDurrans et al. (2002) evaluated the potential of radar-rainfall data for development of \ngeographically-fixed depth-area relationships that vary with return period (compare \nEq. (2)). They used data on a (roughly) 4 km grid covering a rectangular area from \neastern Colorado to western Arkansas, and from northeastern Texas to central Kansas, \nUnited States. Durations of 1, 2 and 4 hours were investigated during a 7.5-year study \nperiod, May 1993 to September 2000. This study found the following issues: the short \nperiod of record is a limitation for the application of frequency analysis to obtain the \npoint and areal rainfalls of a particular return period when calculating the ARF. \nHeterogeneities in the radar data occurring because of continual improvements to the data \nprocessing algorithm is another difficulty. The sampling variation due to short records \nand heterogeneities can give rise to unexpected results, such as ARFs greater than 1 for \nsome averaging areas and return periods. This mainly occurred because of edge effects in \nthe spatial smoothing algorithm. Record lengths and poor homogeneity should improve \nwith the passage of time. \n \nDurrans et al. (2002) also report a concern about possible biases in the radar estimates of \nextreme rainfall. Precipitation estimates for the 100-year return period were found to be \nat least 20-35% smaller than gauge-based estimates published in Hershfield (1961) and \nFrederick et al. (1977). This may be due to short radar records and natural climate \nvariability. The ARFs are less affected, because the biases cancel out to some extent \nwhen calculating the area to point rainfall ratio. Hence, composite ARFs developed using \n  19\nradar data (averaging ARFs calculated for several sub-areas, and avoiding edge areas) are \nconsidered reasonably consistent with earlier gauge-based studies presented in U. S. \nWeather Bureau (1958). However, they do not decrease with area as rapidly as gauge-\nbased estimates do. There is not a pronounced difference between the curves for different \nreturn periods, but the ARFs for larger return periods recede somewhat quicker than for \nsmaller return periods. Radar data are expected to become more reliable as the technique \ndevelops in the future.  \n \nIn contrast to the study by Durrans et al. (2002), Allen and DeGaetano (2005b) found that \nARFs derived from radar data decay at a faster rate with increasing area than ARFs \ncalculated from raingauge data. This more recent study uses five years, 1996-2000, of \ndaily radar data on a 2 km grid over two areas in the eastern United States (New Jersey \nand North Carolina). The ARFs are calculated according to Eq. (3). For a basin size of \n20,000 km2 the difference between ARFs from radar and gauge data ranges from 11 to \n32%. Between-station variance of same-day extreme precipitation, as well as the \ncoefficient of variation, tends to be larger for the radar-derived areal extreme events, \nfavouring a smaller radar areal precipitation. Smaller radar ARFs are also favoured \nbecause, on average, a larger percentage of gauges have coincident annual maxima than \ndo the radar pixels that correspond to these gauges. The authors conclude that the \naccuracy of the calibrated radar data for extreme events is suspect. When radar areal \nprecipitation amounts were calculated and compared with gauged areal precipitation, the \nresults varied from region to region as to which were the largest. \n \n \nDiscussion and recommendations \n \nThe relationship between the point and areal rainfalls has been found to vary with, for \nexample, predominant weather type, season, return period and estimation method. This \nsection discusses the methods reviewed in detail earlier in the paper. A summary of the \nkey characteristics of each method and its advantanges and limitations is given in \nTable 1. Two distinct groups of methods can be recognised; the generally data intensive \nand computationally laborious traditional empirical methods and the often more elegantly \nformulated and recently developed analytical methods. \n \nThe analytical methods (correlation by Rodriguez-Iturbe and Mejía 1974, Sivapalan and \nBlöschl 1998 and Omolayo 1989; crossing properties by Bacchi and Ranzi 1996; scaling \nmethods by de Michele et al. 2001 and Veneziano and Langousis 2005; and storm \nmovement by Bengtsson and Niemczynowicz 1986) attempt to put areal reduction factor \n(ARF) estimation on a sounder scientific basis. However, they are generally based on \nassumptions that are not entirely true descriptions of the real rainfall process, which is a \ncause for concern and uncertainty regarding the results. This concern is compounded by \nthe often limited amount of actual rainfall data that so far has been used to verify them. \nHowever, with further verification, some of these methods may prove to provide \nperfectly adequate ARF estimates with a much smaller amount of computational effort \nand data requirements than the traditional methods. Results from methods based on \nscaling relationships seem to agree with empirical estimates within a limited scaling \n  20\nregime, but similarly to methods developed for short durations and small areas (e.g. the \nempirical small-scale study and the analytical crossing properties and storm movement \nmethods), they may not be appropriate for application to a comprehensive set of temporal \nand space scales. \n \nA number of both the empirical and analytical methods, such as storm-centred methods, \nsome correlation-based methods and the annual maxima-centred method, may not result \nin probabilistically correct areal rainfall estimates. That is, when multiplying the ARF \nwith a T-year point rainfall, the resulting areal rainfall may not necessarily have the same \nT-year return period. However, the question is how large the discrepancy is, as, for any \nmethod, a small difference may be acceptable when considered in conjunction with a \nmethod’s other advantages. Until the magnitudes of the discrepancies have been assessed, \nit seems prudent not to recommend these methods for use with rainfall frequency \nestimates. Instead, a fixed-area approach can be used to obtain probabilistically correct \nareal rainfall estimates. But for any method it should be borne in mind that the results will \nnot be better than the underlying data. A fixed-area approach may not give \nprobabilistically correct results, for example, if there are biases in the areal rainfall \nestimates, say, because of underrepresentation of gauges in upland parts of a catchment.  \n \nThe use of radar data is at present problematic. Differences can be expected between \nsuccessive time periods for the same area because of heterogeneities in the data, as \nresolution and radar data processing improves with time. Other problems are short \nrecords and possible biases in the ARF estimates. Although this type of data holds much \npromise for the future, it seems too early to apply it for ARF estimation at national levels.  \n \nThere is no quick and unambiguously correct way of updating the current ARF estimates, \nwhich in most parts of the world have probably been derived using traditional empirical \nfixed-area methods. Although being data-intensive and laborious, these traditional \nmethods still have advantages over the newer analytical methods, mainly because of the \nlimitations of the latter as discussed above (i.e. assumptions not strictly met by the real \nrainfall process; limited range in space and time; not probabilistically correct). Some \nempirical fixed-area methods have the advantage also over empirical storm-centred \napproaches in that they can provide probabilistically correct ARFs. \n \nWith modern database systems for data storage and powerful computers for data \nprocessing, the application of empirical fixed-area methods should not be problematic. \nFor example, in the UK more than 30 years of rainfall data have been collected since the \nARF estimates in the Flood Studies Report (NERC 1975) were presented. The UK has a \nrelatively dense network of daily gauges, and over the past decades the digital rainfall \nrecords from the network of gauges with a sub-daily resolution have become more \nplentiful. Data availability in many other countries has probably followed a similar \npattern, and this increase in available data would provide improved ARF estimates if new \nstudies were undertaken. For example, a version of Bell’s fixed-area method (Bell 1976), \nwhich varies with return period, may be suggested perhaps in conjunction with a \nregionalisation scheme taking into account the differing rainfall characteristics of \ndifferent climatic regions.  Bell’s method offers specific advantages over other empirical \n  21\nmethods.  In particular, compared to the US Weather Bureau (1957-1958), NERC (1975) \nand the Desbordes et al. (1984) methods, it has the advantage of incorporating return \nperiod, and it has the additional advantage over the last of these in that it encompasses a \nwider range of time and space scales. It is simpler than the National Weather Service \nmethod (Myers and Zehr 1980). Finally, it is intuitively more probabilistically correct \nthan the annual-maxima centred method (Asquith and Famiglietti 2000). \n \n \nAcknowledgements \n \nThis review was undertaken as part of the Defra-funded project “Reservoir Safety – Long \nReturn Period Rainfall” (WS194\/2\/39). \n \n \nReferences \n \nAllen, R. J. and DeGaetano, A. T. (2005a) Areal reduction factors for two eastern United \nStates regions with high rain-gauge density. J. Hydrol. Eng., 10 (4), 327-335. \n \nAllen, R. J. and DeGaetano, A. T. (2005b) Considerations for the use of radar-derived \nprecipitation estimates in determining return intervals for extreme areal precipitation \namounts. J. Hydrol., 315, 203-219. \n \nAsquith, W. H. and Famiglietti, J. S. (2000) Precipitation areal-reduction factor \nestimation using an annual-maxima centred approach. J. Hydrol., 230 (1-2), 55-69. \n \nARR (2001) Design rainfall considerations, Book 2 of Volume 1 of Australian Rainfall \nand Runoff (ed. Pilgrim, D. H.). Engineers Australia, Barton, Australia, 49 pp. \n \nBacchi, B. and Ranzi, R. (1996) On the derivation of the areal reduction factor of storms. \nAtmos. Res., 42, 123-135. \n \nBell, F. C. (1976) The areal reduction factor in rainfall frequency estimation. Institute of \nHydrology Report No 35, Natural Environment Research Council, UK. \n \nBengtsson, L. and Niemczynowicz, J. (1986) Areal reduction factors from rain \nmovement. Nordic Hydrol., 17 (2), 65-82. \n \nChow, V. T. (1951) A general formula for hydrologic frequency analysis. Trans. Am. \nGeophys. Union, 32, 231-237. \n \nChow, V. T. (1964) Statistical and probability analysis of hydrologic data. In Chow, V. T. \n(ed) Handbook of Hydrology, pp. 8.1-8.42. McGraw-Hill, New York. \n \nClark, C. and Rakhecha, P. R. (2002) Areal PMP distribution of one-day to three-day \nduration over India. Meteorol. Appl., 9, 399-406.  \n  22\n \nDavis, A., Marshak, A., Wiscombe, W and Cahalan, R. (1994) Multifractal \ncharacterizations of nonstationarity and intermittency in geophysical fields: Observed, \nretrieved, or simulated. J. Geophys. Res., 99, 8055-8072. \n \nde Michele, C., Kottegoda, N. T. and Rosso, R. (2001) The derivation of areal reduction \nfactor of storm rainfall from its scaling properties. Water Resour. Res., 37 (12), 3247-\n3252. \n \nDesbordes, M., Raous, P. and Trévisiol, Y. (1984) Areal reduction factors on short time \nand space intervals. Wat. Sci. Tech., 16, 189-198.  \n \nDurrans, S. R., Julian, L. T. and Yekta, M. (2002) Estimation of depth-area relationships \nusing radar-rainfall data. J. Hydrol. Eng., 7 (5), 356-367. \n \nEinfalt, T., Johann, G. and Pfister, A. (1998) On the spatial validity of heavy point \nrainfall measurement. Wat. Sci. Tech., 37 (11), 21-28. \n \nFrederick, R. H., Myers, V. A. and Auciello, E. P. (1977) Five- to 60-minute precipitation \nfrequency for the eastern and central Unived States. NOAA Technical Memorandum \nNWS HYDRO-35. Office of Hydrology, National Weather Service, Silver Spring, Md. \n \nGrebner, D. and Roesch, T. (1997) Regional dependence and application of DAD \nrelationships. Proc. FRIEND’97 – Regional hydrology: Concepts and models for \nsustainable water resource management. Postojna, Slovenia, Sept.-Oct. 1997. IAHS Publ., \n246, 223-230. \n \nGumbel, E. J. (1958) Statistics of extremes. Columbia University Press, New York. \n \nHershfield, D. M. (1961) Rainfall frequency atlas of the Unites States for durations from \n30 minutes to 24 hours and return periods from 1 to 100 years. Technical Paper No. 40. \nU. S. Department of Commerce, Washington D. C.  \n \nHuff, F. A. (1995) Characteristics and contributing causes of an abnormal frequency of \nflood-producing rainstorms at Chicago. Water Resour. Bull., 31 (4), 703-714. \n \nHuff, F. A. and Shipp, W. L. (1969) Spatial correlations of storm, monthly, and seasonal \nprecipitation. J. Appl. Meteorol., 8 (4), 542-550. \n \nLombardo, F., Napoletano, F. and Russo, F. (2006) On the use of radar reflectivity for \nestimation of the areal reduction factor. Nat. Hazards Earth Syst. Sci., 6, 377-386. \n \nMyers, V. A. and Zehr, R. M. (1980) A methodology for point-to-area rainfall frequency \nratios. NOAA Technical Report NWS 24. U. S. Department of Commerce, National \nOceanic and Atmospheric Administration, National Weather Service, Washington D. C., \nUSA. \n  23\n \nNERC (1975) Flood studies report, Volume II. Natural Environment Research Council, \nUK. \n \nNERC (1977) Flood studies supplementary report No 1: The areal reduction factor in \nrainfall frequency estimation. Natural Environment Research Council, UK. \n \nOmolayo, A. S. (1989) Relationships between point and areal rainfall for flood and \ndrought assessments. Ph. D. Thesis, University of New South Wales, Australia. \n \nOmolayo, A. S. (1993). On the transposition of areal reduction factors for rainfall \nfrequency estimation. J. Hydrol., 145 (1-2), 191-205. \n \nPorter, J. W. and Ladson, A. R. (1993) An application of fixed-area rainfall reduction \nfactors. Hydrology and Water Resources Symposium, Newcastle, Australia, 30 June-2 \nJuly 1993. IEAust. Nat. Conf. Publ., 93\/14, 273-279. \n \nPrudhomme, C and Reed, D. W. (1999) Mapping extreme rainfall in a mountainous \nregion using geostatistical techniques: A case study in Scotland. Int. J. Climatol., 19, \n1337-1356. \n \nRamos, M. H., Creutin, J.-D. and Leblois, E. (2005) Visualization of storm severity. J. \nHydrol., 315 (1-4), 295-307. \n \nRodriguez-Iturbe, I. and Mejía, J. M. (1974) On the transformation of point rainfall to \nareal rainfall. Water Resour. Res., 10 (4), 729-735. \n \nSeed, A. W., Srikanthan, R. and Menabde, M. (1999) A space and time model for design \nstorm rainfall. J. Geophys. Res., 104 (D24), 31623-31630. \n \nSiriwardena, L. and Weinmann, P. E. (1996) Derivation of areal reduction factors for \ndesign rainfalls in Victoria. Report 96\/4, Cooperative Research Centre for Catchment \nHydrology, Australia. \n \nSivapalan, M. and Blöschl, G. (1998) Transformation of point rainfall to areal rainfall: \nIntensity-duration-frequency curves. J. Hydrol., 204 (1-4), 150-167. \n \nSkaugen, T. (1997) Classification of rainfall into small- and large-scale events by \nstatistical pattern recognition. J. Hydrol., 200 (1-4), 40-57. \n \nSrikanthan, R. (1995) A review of the methods for estimating areal reduction factors for \ndesign rainfall. Report 95\/3, Cooperative Research Centre for Catchment Hydrology, \nAustralia. \n \n  24\nStewart, E. J. (1989) Areal reduction factors for design storm construction: Joint use of \nraingauge and radar data. In: New directions for surface water modeling, Proc. Baltimore \nSymposium, May 1989. IAHS Publ., 181, 31-40. \n \nU. S. Weather Bureau (1957-1958) Rainfall intensity-frequency regime Parts 1 and 2, \nTechnical Paper No. 29. U.S. Department of Commerce, Washington D.C., US. \n \nVeneziano, D. and Langousis, A. (2005) The areal reduction factor: A multifractal \nanalysis. Water Resour. Res., 41, W07008, 15pp, DOI:10.1029\/2004WR003765. \n \nVeneziano, D., Langousis, A. and Furcolo, P. (2006) Multifractality and rainfall \nextremes: A review. Water Resour. Res., 42 (supplement), W06D15, 18 pp, DOI: \n10.1029\/2005WR004716. \n \nYoo, C., Kim, K., Kim, H. S. and Park, M. J. (2007) Estimation of areal reduction factors \nusing a mixed gamma distribution. J. Hydrol., 335 (3-4), 271-284. \n \nZehr, R. M. and Myers, V. A. (1984) Depth-area ratios in the semi-arid southwest United \nStates. NOAA Technical Memorandum NWS HYDRO-40. Office of Hydrology, \nNational Weather Service, NOAA, Silver Spring, MD, USA.  \n \n \n \nWord count: 8776 (excluding references and figure and table captions) \n \n \nFigure caption \n \nFigure 1.  Areal reduction factors for precipitation in the United Kingdom presented \nin the Flood Studies Report (diagram derived from tabulated values in \nNERC (1975)). \n \nTable caption \n \nTable 1.  Summary of methods for areal reduction factor (ratio of areal to point \nrainfall) estimation. \n \n \n \n  25\nTable 1.  Summary of methods for areal reduction factor (ratio of areal to point \nrainfall) estimation. \n \nType Method name \nand\/or \nreference \nCharacteristics Comments \n    \nG\nen\ner\nal\n \nem\npi\nric\nal\n \nm\net\nho\nds\n \nFixed-area (e.g. \nOmolayo 1993) \nGeographically fixed area, \nsuch as a catchment; the \npoint rainfall used is \nrepresentative for the \nwhole catchment  \nThe ARF can be (but does not \nhave to be) defined as an areal \nrainfall of a particular return \nperiod divided by the point \nrainfall of the same return period \nresulting in a probabilistically \ncorrect ARF estimate; data \nintensive  \nStorm-centred \n(e.g. Omolayo \n1993) \nThe area changes for each \nstorm, and is outlined by a \nselected isohyet; the point \nrainfall used is the highest \nwithin each storm. \nTypically used for PMP \nestimates, which are not \nassociated with a particular return \nperiod \n    \nSp\nec\nifi\nc \nem\npi\nric\nal\n \nm\net\nho\nds\n \nUS Weather \nBureau (1957-\n1958) \nFixed-area; relates mean \nannual max areal rain to \nmean annual max point \nrain (for all stations and \nyears)  \nThe most commonly used method \nin the US; intuitive to apply but \nlaborious; does not take into \naccount return period \nSmall-scale \nstudy – “fixed-\narea” \n(Desbordes et \nal. 1984) \nLargest point rainfall of a \ngiven duration at each \ngauge for each event in the \narea is noted and the \nconcurrent Thiessen-\nweighted areal rainfall is \ndivided by it; ARFs are \nthen averaged to get a final \nestimate; events selected \nbased on discharge \nApplicable to small space and \ntime scales; unclear how results \ncompare with more standard \nmethods, but makes good use of \ndata collected during a short \nexperiment; may not be \nrepresentative of extreme \nrainfalls as area small and period \nof record short; does not take into \naccount return period; \nintermediate ARFs may be > 1 \nSmall-scale \nstudy – “storm-\ncentred” \n(Desbordes et \nal. 1984) \nA subset of the above, \nusing only the largest point \nrainfall in the study area \n(but not necessarily for the \nentire storm area) for each \nevent \nAll intermediate ARFs ≤ 1, but \notherwise similar comments to \nabove; ARFs recede more \nquickly than for the above \nmethod \n   \nNERC (1975) Fixed area; assumes that \n“an average of ratios” can \nA simplification of the US \nWeather Bureau method; \n  26\napproximate “a ratio of \naverages” \nunorthodox assumption makes \ncomputations convenient; does \nnot take return period into \naccount \nBell (1976) Fixed area; fits frequency \ndistributions to point and \nThiessen-weighted areal \nannual max rainfalls and \ncalculates ARFs for \nspecified return periods \nThese ARFs recede more quickly \nthan those of the NERC method; \ntakes return period into account; \nfollowing Bell’s method Stewart \n(1989) introduced a \nstandardisation taking into \naccount local variation in the \nmean annual max rainfall \nNational \nWeather \nService (Myers \nand Zehr 1980) \nBased on frequency \nanalysis of annual max \nrainfall at pairs of stations \nand the distance between \nthem; uses small five-\nstation networks \nSome of the theory developed is \nrather involved; takes return \nperiod into account; does not \nrequire large, dense networks of \nconcurrent observations \nAnnual-maxima \ncentred method \n(Asquith and \nFamiglietti \n2000) \nConcurrent rainfalls \nsurrounding a point annual \nmax are used for \ncalculation of ratios \nbetween gauge-pairs (the \nmax is always one of the \npair), which are then \nplotted against distance; a \ncurve is fitted and ARFs \nintegrated; stratification on \nreturn period at annual max \ngauge \nTakes return period into account, \nbut may not be “probabilistically \ncorrect”; labour-saving as it does \nnot require spatial averaging of \nrainfall, explicit calculation of \ncorrelation coefficient, or \ndefinition of representative area; \nrequires a dense network of \ngauges \n    \nSp\nat\nia\nl c\no\nrr\nel\nat\nio\nn\n \nst\nru\nct\nu\nre\n \nRodriguez-\nIturbe and \nMejía (1974) \nRelates the ARF to the \ncorrelation between two \ngauges separated by a \n“characteristic correlation \ndistance”; assumes a \nparticular spatial \ncorrelation structure and \nGaussian point \nprecipitation \nStraight-forward, but requires \nestimation of mean distance \nbetween two random points in the \narea; does not take return period \ninto account; assumption of \nGaussian point rainfall not likely \nmet \nSivapalan and \nBlöschl (1998) \nExtension to the \nRodriquez-Iturbe and \nMejía method; point \nrainfall is assumed to \nfollow an exponential \ndistribution \nExpression of ARF is more \ncomplex than for the above \nmethod, depending on area, \n“spatial correlation length”, \nduration and return period; \nmethod is verified using \n  27\nindividual storm events rather \nthan a traditional fixed-area \napproach \nOmolayo \n(1989) \nThe ARF is calculated \nusing the average spatial \ncorrelation and the number \nof gauges in the area  \nDepends on return period; if \nGaussian rainfall is assumed \nrather than log-normal, the ARF \nreduces to a measure similar to \nthat of Rodriguez-Iturbe and \nMejía \n    \nCr\no\nss\nin\ng \npr\no\npe\nrt\nie\ns \nBacchi and \nRanzi (1996) \nApplies a peak-over-\nthreshold approach to the \nspatial rainfall field; relies \non assumptions of \nindependence in the rainfall \nfield in the two spatial \ndirections and in time, in \naddition to distributional \nassumptions \nSuitable for small areas and short \ndurations; takes return period into \naccount; relies on many \nassumptions about the rainfall \nfield that may not be met \n    \nSc\nal\nin\ng \nre\nla\ntio\nn\nsh\nip\ns \nde Michele et \nal. (2001), \nVeneziano and \nLangousis \n(2005) \nBased on scale-invariant \n(scaling) behaviour of \nrainfall; statistical \nproperties can be \ncharacterised over a range \nof scales in terms of a few \nparameters \nThe range of spatial and temporal \nscales for which the derived \nrelationships are valid is in \npractice limited; could take return \nperiod into account \n    \nSt\no\nrm\n \nm\no\nv\nem\nen\nt Bengtsson and \nNiemczynowicz \n(1986) \nApproach based on the \nmovement of convective \nstorms; uses point \nhyetograph and storm \nspeed; assumes exponential \ndecay transverse to the \ndirection of movement \nApplicable to small areas and \nshort durations; example used \nagrees with empirically derived \nARF estimate of 0.5 years return \nperiod \n    \nR\nad\nar\n \nda\nta\n \nDurrans et al. \n(2002), Allen \nand DeGaetano \n(2005b), \nLombardo et al. \n(2006) \nVarious methods described \nabove can be applied to this \ntype of data \nImproved spatial coverage \ncompared with raingauge \nnetworks, but short \ninhomogeneous records and poor \nquantitative rainfall \nmeasurements cause uncertainties \nin the ARF estimates \n    \n \n \n  28\n \n \n \n \n"}