{"doi":"10.1007\/s002850200151","coreId":"96525","oai":"oai:generic.eprints.org:52\/core69","identifiers":["oai:generic.eprints.org:52\/core69","10.1007\/s002850200151"],"title":"The role of cell-cell interactions in a two-phase model for avascular tumour growth","authors":["Breward, C. J. W.","Byrne, H. M.","Lewis, C. E."],"enrichments":{"references":[{"id":677207,"title":"A poroelastic finite element formulation including transport and swelling in soft tissue structures.","authors":[],"date":"1996","doi":"10.1115\/1.2795941","raw":null,"cites":null},{"id":674760,"title":"A reaction-diffusion model of cancer invasion.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":672930,"title":"A two-phase model of solid tumour growth.","authors":[],"date":"2001","doi":"10.1016\/S0893-9659(03)00038-7","raw":null,"cites":null},{"id":673796,"title":"Advection-diffusion models for solid tumour evolution in vivo and related free boundary problems.","authors":[],"date":"2000","doi":"10.1142\/S0218202500000239","raw":null,"cites":null},{"id":671930,"title":"An anisotropic biphasic theory of tissue-equivalent mechanics: the interplay among cell traction, fibrillar network deformation, fibril alignment and cell contact guidance.","authors":[],"date":"1997","doi":"10.1115\/1.2796072","raw":null,"cites":null},{"id":676929,"title":"Cellular growth and travelling waves of cancer.","authors":[],"date":"1993","doi":"10.1137\/0153079","raw":null,"cites":null},{"id":672682,"title":"Free boundary value problems associated with the growth and development of multicell spheroids.","authors":[],"date":"1997","doi":"10.1017\/S0956792597003264","raw":null,"cites":null},{"id":672474,"title":"Growth of nonnecrotic tumours in the presence and absence of inhibitors.","authors":[],"date":"1995","doi":"10.1016\/0025-5564(94)00117-3","raw":null,"cites":null},{"id":673343,"title":"How is a tissue built?","authors":[],"date":"2000","doi":"10.1115\/1.1324665","raw":null,"cites":null},{"id":675919,"title":"Hypoxic cervical cancers with low apoptotic index are highly agressive.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":676500,"title":"Integrins, cadherins and catenins: molecular cross-talk in cancer cells.","authors":[],"date":"1998","doi":"10.1002\/(SICI)1096-9896(199809)186:1<1::AID-PATH135>3.0.CO;2-T","raw":null,"cites":null},{"id":677667,"title":"Mathematical modelling of avascular-tumour growth II: modelling growth saturation.","authors":[],"date":"1999","doi":"10.1093\/imammb\/16.2.171","raw":null,"cites":null},{"id":677444,"title":"Mathematical modelling of avascular-tumour growth.","authors":[],"date":"1997","doi":"10.1093\/imammb\/14.1.39","raw":null,"cites":null},{"id":674290,"title":"Mathematical modelling of tumour growth and stability. PhD Thesis.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":674541,"title":"Mathematical models in the applied sciences.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":677890,"title":"Microelectrode measurements of pericellular pO2 in erythropoietin-producing human hepatoma cell cultures.","authors":[],"date":"1993","doi":"10.1007\/BF00270051","raw":null,"cites":null},{"id":673125,"title":"Modelling solid tumour growth using the theory of mixtures.","authors":[],"date":"2001","doi":"10.1093\/imammb\/20.4.341","raw":null,"cites":null},{"id":672107,"title":"Modelling the interactions between tumour cells and a blood vessel in microenvironment within a vascular tumour.","authors":[],"date":"2001","doi":"10.1017\/S095679250100448X","raw":null,"cites":null},{"id":674999,"title":"Models for the growth of a solid tumour by diffusion.","authors":[],"date":"1972","doi":null,"raw":null,"cites":null},{"id":675171,"title":"On the growth and stability of cell cultures and solid tumours.","authors":[],"date":"1976","doi":null,"raw":null,"cites":null},{"id":672376,"title":"Pericellular oxygen tension in experimental cell culture apparatus (working title). In Preparation.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":674041,"title":"Poroelastic multiphase flow modelling for paper squeezing.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":675686,"title":"Solid stress inhibits the growth of multicellular tumour spheroids.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":673596,"title":"The control of cell division by tension or diffusion.","authors":[],"date":"1971","doi":"10.1038\/274052a0","raw":null,"cites":null},{"id":676127,"title":"The number and distribution of capillaries in muscles with calculations of the oxygen pressure head necessary for supplying the tissue.","authors":[],"date":"1919","doi":null,"raw":null,"cites":null},{"id":676701,"title":"Three-dimensional spheroid model in tumour biology.","authors":[],"date":"1999","doi":"10.1159\/000028065","raw":null,"cites":null},{"id":675420,"title":"Tumour development under angiogenic signalling: a dynamic theory of tumour growth, treatment ersponse and postvascular dormancy.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":676387,"title":"Tumour dynamics and necrosis: surface tension and stability.","authors":[],"date":"2001","doi":"10.1093\/imammb\/18.2.131","raw":null,"cites":null},{"id":676963,"title":"Wave front propagation in a competition equation with a new motility term modelling contact inhibition between cell populations.","authors":[],"date":"2000","doi":"10.1098\/rspa.2000.0616","raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":"A two-phase model is presented to describe avascular tumour growth. Conservation of mass equations, including oxygen dependent cell growth and death terms, are coupled with equations of momentum conservation. The cellular phase behaves as a viscous liquid, while the viscosity of the extracellular water manifests itself as an interphase  drag. It is assumed that the cells become mechanically stressed if they are too densely packed and that the tumour will try to increase its volume in order to relieve such stress. By contrast, the overlapping filopodia of sparsely populated  cells create short-range attractive effects. Finally, oxygen is consumed by the cells as it diffuses through the tumour.\n\n\nThe resulting system of equations are reduced to three, which describe the evolution of the tumour cell volume fraction, the cell speed and the oxygen tension.  Numerical simulations indicate that the tumour either evolves to a travelling wave profile, in which it expands at a constant rate, or it settles to a steady state, in which the net rates of cell proliferation and death balance. The impact of varying key model parameters such as cellular viscosity, interphase drag, and cellular tension are discussed. For example, tumours consisting of well-differentiated ( i.e. viscous) cells are shown to grow more slowly than those consisting of poorly-differentiated (i.e. less viscous) cells. Analytical results for the case of oxygen-independent growth are also presented, and the effects of varying the key parameters determined (the results are in line with the numerical simulations of the full problem). The key results and their biological implications are then summarised and future model refinements discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96525.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/52\/1\/D136.pdf","pdfHashValue":"059b9239c804dafe46790bdf5c61f788e62ed945","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:52<\/identifier><datestamp>\n      2015-05-29T18:15:44Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4F5A:4D3335<\/setSpec><setSpec>\n      7375626A656374733D4143:4D3932<\/setSpec><setSpec>\n      7375626A656374733D4447:4D3736<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/52\/<\/dc:relation><dc:title>\n        The role of cell-cell interactions in a two-phase model for avascular tumour growth<\/dc:title><dc:creator>\n        Breward, C. J. W.<\/dc:creator><dc:creator>\n        Byrne, H. M.<\/dc:creator><dc:creator>\n        Lewis, C. E.<\/dc:creator><dc:subject>\n        Partial differential equations<\/dc:subject><dc:subject>\n        Biology and other natural sciences<\/dc:subject><dc:subject>\n        Fluid mechanics<\/dc:subject><dc:description>\n        A two-phase model is presented to describe avascular tumour growth. Conservation of mass equations, including oxygen dependent cell growth and death terms, are coupled with equations of momentum conservation. The cellular phase behaves as a viscous liquid, while the viscosity of the extracellular water manifests itself as an interphase  drag. It is assumed that the cells become mechanically stressed if they are too densely packed and that the tumour will try to increase its volume in order to relieve such stress. By contrast, the overlapping filopodia of sparsely populated  cells create short-range attractive effects. Finally, oxygen is consumed by the cells as it diffuses through the tumour.\n\n\nThe resulting system of equations are reduced to three, which describe the evolution of the tumour cell volume fraction, the cell speed and the oxygen tension.  Numerical simulations indicate that the tumour either evolves to a travelling wave profile, in which it expands at a constant rate, or it settles to a steady state, in which the net rates of cell proliferation and death balance. The impact of varying key model parameters such as cellular viscosity, interphase drag, and cellular tension are discussed. For example, tumours consisting of well-differentiated ( i.e. viscous) cells are shown to grow more slowly than those consisting of poorly-differentiated (i.e. less viscous) cells. Analytical results for the case of oxygen-independent growth are also presented, and the effects of varying the key parameters determined (the results are in line with the numerical simulations of the full problem). The key results and their biological implications are then summarised and future model refinements discussed.<\/dc:description><dc:date>\n        2002<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/52\/1\/D136.pdf<\/dc:identifier><dc:identifier>\n          Breward, C. J. W. and Byrne, H. M. and Lewis, C. E.  (2002) The role of cell-cell interactions in a two-phase model for avascular tumour growth.  Journal of Mathematical Biology, 45  (2).   pp. 125-152.      <\/dc:identifier><dc:relation>\n        DOI 10.1007\/s002850200151<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/52\/","DOI 10.1007\/s002850200151"],"year":2002,"topics":["Partial differential equations","Biology and other natural sciences","Fluid mechanics"],"subject":["Article","PeerReviewed"],"fullText":"Journal of Mathematical Biology manuscript No.\n(will be inserted by the editor)\nC. J. W. Breward ·H. M. Byrne · C. E. Lewis\nThe role of cell-cell interactions in a two-phase model for avascular\ntumour growth\n3rd May 2001\nAbstract. A two-phase model is presented to describe avascular tumour growth. Conservation of mass equations,\nincluding oxygen-dependent cell growth and death terms, are coupled with equations of momentum conservation.\nThe cellular phase behaves as a viscous liquid, while the viscosity of the extracellular water manifests itself as an\ninterphase drag. It is assumed that the cells become mechanically stressed if they are too densely packed and that\nthe tumour will try to increase its volume in order to relieve such stress. By contrast, the overlapping filopodia of\nsparsely populated cells create short-range attractive effects. Finally, oxygen is consumed by the cells as it diffuses\nthrough the tumour.\nThe resulting system of equations are reduced to three, which describe the evolution of the tumour cell volume\nfraction, the cell speed and the oxygen tension. Numerical simulations indicate that the tumour either evolves to a\ntravelling wave profile, in which it expands at a constant rate, or it settles to a steady state, in which the net rates of\ncell proliferation and death balance. The impact of varying key model parameters such as cellular viscosity, interphase\ndrag, and cellular tension are discussed. For example, tumours consisting of well-differentiated (i.e. viscous) cells are\nshown to grow more slowly than those consisting of poorly-differentiated (i.e. less viscous) cells. Analytical results for\nthe case of oxygen-independent growth are also presented, and the effects of varying the key parameters determined\n(the results are in line with the numerical simulations of the full problem). The key results and their biological\nimplications are then summarised and future model refinements discussed.\n1. Introduction\nThe avascular stage of tumour growth is characterised by small tumours which gain the nutrients and oxygen\nthey need for survival and growth by diffusion in from external blood vessels. Since there are no blood vessels\nwithin the tumour to supply the mass needed for such volume expansion, this must also enter through the\ntumour’s periphery.\nAvascular tumour growth has been widely studied using mathematical techniques, and the resulting\nmodels are becoming increasingly sophisticated. For example, in an early paper [16], Greenspan presented a\ncompartmentalised model in which the tumour was divided into proliferating and quiescent regions. Recently,\nWard and King incorporated more realistic functional forms for the cell birth and death rates, which depend\non the local oxygen tension in the tumour tissue [28,29]. They also distinguished between live and dead\ncell populations. A common feature of the models presented in [17,28,29] is that low oxygen tensions are\nresponsible for generating substantial cell death, and for the resulting formation of areas of necrosis within the\ntumours. Landman and Please [22] propose an alternative mechanism for the formation of regions of necrosis.\nThey view the tumour as a two-phase mixture of cells and water, each phase having a different pressure. In\nviable regions of the tumour, where cells proliferate, the cell volume fraction is taken to be constant and the\ncell pressure is assumed to exceed the water pressure – the cells are compacted and pressure is transmitted\nfrom cell-to-cell. They assume that “necrotic” regions form when the pressures in the two phases become\nequal and the cells are no longer compacted. This hypothesis has yet to be demonstrated experimentally.\nC. J. W. Breward e-mail: breward@maths.ox.ac.uk, C. E. Lewis: Academic Unit of Pathology, Section of Pathology\nand Oncology, University of Sheffield Medical School, Beech Hill Road, Sheffield. S10 2RX. UK\nC. J. W. Breward, H. M. Byrne: Centre for Mathematical Medicine, Division of Theoretical Mechanics, School of\nMathematical Sciences, University of Nottingham, University Park, Nottingham. NG7 2RD. UK\nC. J. W. Breward: Current Address: Oxford Centre for Industrial and Applied Mathematics, Mathematical Institute,\n24-29 St Giles, Oxford. OX1 3LB\nKey words: Two-phase modelling; tumour growth; avascular; cellular viscosity; cell-cell stresses; numerical solution\n2 C. J. W. Breward et al.\nDe Angelis and Preziosi [10] relax the assumption that the cell volume fraction in the viable region of the\ntumour be constant and develop an alternative approach in which cells are assumed to attract each other\nwhen the cell volume fraction is below a threshold value and to repel each other when this value is exceeded.\nIn this paper we generate a new mathematical model for the development of an avascular tumour which\nincorporates a number of the phenomena introduced in the papers described above. As in [22], we view\nthe tumour as a two-phase material, consisting of tumour cells and extracellular water. Note that there are\nother phases present in avasular tumours; we discuss the formation of three-phase models which incorporate,\nfor example, extracellular matrix, in the discussion. We also assume that necrosis is initiated by low oxygen\ntensions, following [28,29]. We assume that there is internal conservation of mass, and that changes in tumour\nvolume are due to the in-flow of liquid across the tumour boundary: this fluid is taken up by cells which are\ngrowing and undergoing mitosis. We suppose that the behaviour of the cellular phase is similar to that of a\nviscous fluid, the viscosity indicating the degree of differentiation of the tumour cells: poorly differentiated\ntumours (i.e. the most aggressive tumours) are characterised by less intercellular cohesion and are thus “less\nviscous” than their well-differentiated counterparts, see [13,23].\nOur final key assumption is that the pressure in the cellular phase differs from that in the extracellular\nwater phase due to interactions between the cells. Rather than fixing the cell volume fraction, we adopt a\nsimilar approach to [6,7,10] and allow cells to attract or repel each other, depending on their local volume\nfraction. We associate cellular attraction with overlapping filopodia, and cellular repulsion with the relief of\nmechanical stress caused by deformation of the cellular membrane.\nOur model has its foundations in two-phase flow models, and, as such, follows the approach taken by\nFitt et al. [12]. However, our model allows for matter to change phase due to cell birth and death and, as\nsuch, differs from the numerous two-phase models that are used to describe nonbiological applications, in\nwhich there is no internal phase generation. For simplicity, we formulate our model in a one-dimensional\n(cartesian) geometry. All the equations and boundary conditions in our model could be easily replaced\nwith their radially-symmetric or fully three dimensional counterparts. We expect that the results obtained\nfrom analysing our one-dimensional model would be qualitatively similar to those obtained using a more\ncomplicated geometry. We formulate conservation of mass and momentum equations for the two phases, and\na diffusion-consumption equation to describe the oxygen tension within the tumour mass (we focus on the\noxygen tension rather than any other nutrients, assuming that it is the single, rate-limiting nutrient within\nthe tumour volume). We close the model equations by specifying appropriate constitutive laws. The first\nlaw states that there are no voids within the tumour, and the second describes the way in which cell-cell\ninteractions influence the pressure in the cell phase.\nOur model provides us with predictions for the effects of varying the cellular viscosity (i.e. the differentia-\ntion status of the tumour cells), the interphase drag (which we correlate with the viscosity of the extracellular\nwater) and the membrane tension. We are also able to justify the use of diffusion-like equations describing\ntumour growth: our cell-cell interactions manifest themselves as a nonlinear diffusivity, in the limit as viscous\neffects are neglected. The modelling strategy described in this paper also provides a framework for easily\nincorporating stress-dependent cell-proliferation and death terms. All these insights are discussed in the text\nor in section 6.\nThroughout this paper we avoid identifying the actual magnitude of the physical parameters. This is\nbecause we are interested in generating a generic model that can then be used (in various subforms) to\ndescribe the growth of a wide variety of tumour cell lines. Also, to our knowledge, no complete set of data\nexists for any specific cell line, and we believe that it would be inconsistent to quote an incomplete set of\ndata.\nOur underlying aim for generating the model presented in this paper is to use it as a building block for\nproducing a model that describes vascular tumour growth, that is, the late stage of growth in which the\ntumour has aquired its own blood supply. Such models will be useful for studying vascular tumour growth\nboth at the microscale and at the macroscale. At the microscale, we are concerned with interactions between\na single, compliant blood vessel and the tumour cells that it supplies with nutrients (see [2,21]); at the\nmacroscale, we are concerned with predicting how the tumour as a whole grows (see [4,18]).\nIn section 2 we formulate our mathematical model, which describes the evolution of the tumour. In\nsection 3 we explain how the model may be simplified and nondimensionalise the governing equations,\nbefore discussing the behaviour of the tumour near its outer boundary. In section 4 we present numerical\nsimulations of the model equations for several parameter regimes of physical interest. We analyse the initial\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 3\ngrowth of the tumour in section 5.1 before considering whether the tumour evolves to a steady state in\nsection 5.2. We analyse the model for the case in which oxygen levels are uniformly high within the tumour\nin section 5.3. Finally we present our conclusions and a discussion in section 6.\n2. Mathematical model\nWe denote the volume fractions of tumour cells and extracellular water by α and β. We formulate conservation\nof mass equations under the assumption that each phase has the same density. This is a reasonable assumption\nin a two-phase model, since we assume that cells are built from the extracellular water, and that the products\nof cell death are extracellular water. We denote by x and t the independent variables and write\n∂α\n∂t\n+\n∂\n∂x\n(ucα) = qc and\n∂β\n∂t\n+\n∂\n∂x\n(uwβ) = qw. (1)\nIn equations (1), uc is the speed with which the tumour cells move, uw the speed with which the water phase\nmoves, qc represents the rate of change of tumour cell volume due to cell birth and death, and qw represents\nthe complementary rate of change of extracellular water volume due to cell birth and death. We assume that\nthere are no voids and so we set\nα+ β = 1. (2)\nWe further assume that momentum is conserved. Denoting the stresses in the cellular and extracellular\nphases by σc and σw, and neglecting inertia (we may check, a posteriori, that the Reynolds number for the\nflow, Re = ρLU\/µc ∼ 10−2 and, hence, that inertial effects are indeed negligible), we write\n∂\n∂x\n(ασc) + fc = 0 and\n∂\n∂x\n(βσw) + fw = 0. (3)\nIn equations (3), fc and fw represent the net sources of momentum in each phase.\nFinally, we assume that oxygen transport through the tumour is controlled by diffusion [2], and the\nquasi-steady equation for the oxygen tension C(x, t) reads\n∂2C\n∂x2\n= Qc, (4)\nwhere Qc represents the rate of oxygen consumption by the tumour cells.\n2.1. Constitutive laws\nVolume source terms\nIn an arbitrary control volume within an avascular tumour, volume cannot be created: rather it is exchanged\nbetween the extracellular and cellular phases. Thus we set qw = −qc and choose qc to be consistent with\n[29]:\nqc =\nα(1− α)S0C\n1 + S1C\n− S2 + S3C\n1 + S4C\nα. (5)\nThe first term in (5) represents cell growth due to mitosis, characterised by the parameters S0 and S1, and\nthe second represents cell death, parameterised by S2, S3 and S4. We assume throughout the paper that\nS2 < S3\/S4. We note that the rate of cell growth increases with C and that, with the restriction on S2 given\nabove, the rate of cell death increases as C decreases (this is in line with experimental observations, [20]).\nWe do not distinguish different mechanisms of cell death (for example, apoptosis and necrosis); we assume\nboth effects are accounted for in our generic death term.\nStress tensors\nWe suppose that the stresses in the water and cell phases are given by\nσw = −pw and σc = −pc + 2µc ∂uc\n∂x\n. (6)\n4 C. J. W. Breward et al.\nIn equations (6), pw and pc are the average pressures in the water and cellular phases respectively and µc\nrepresents the viscosity of the cells. Recall from the introduction that we associate the viscosity of the cellular\nphase with the degree of differentiation of the tumour cells. Well-differentiated tumours are characterised by\nsignificant levels of inter-cellular cohesion (as compared to poorly-differentiated tumours) and thus are have\na higher viscosity. In order to close the model equations we specify the following constitutive relationship\nbetween the two pressures:\npc = pw +Σc, (7)\nwhere Σc describes the pressure in the cell phase due to cell-cell interactions. We suppose that there is a\ncertain volume fraction of cells, α∗ say, at which the cells are at their natural, close-packing density. At higher\nvolume fractions, the cells’ membranes deform and the cells experience stress. This pressure becomes infinite\nas the cell volume fraction approaches α = 1. Under such conditions (when α > α∗), the cells will attempt\nto move in order to reduce their stress. If α < α∗ and the cells are close enough, the filopodia that they\nextend may come into contact and stimulate the motion of the cells towards each other, i.e. cell aggregation.\nThis is a short-range phenomenon; if the cells are too far apart (α ≤ αmin say), they will not experience\nthis attraction. Note that αmin ≤ α∗, with equality holding in the case where there are no short-range forces\npresent between cells. Combining these ideas, we choose the following functional form for Σc:\nΣc =\nγ\nα− α∗\n(1− α)2 if α > αmin,\n0 if α < αmin.\n(8)\nIn (8), we call γ the tension constant. It is a measure of the cells’ affinity for the natural density, α = α∗.\nMomentum source terms\nWe suppose that there are momentum sources due to the interfacial pressures and that differential movement\nof the two phases manifests itself as a Darcy-style drag term. We set\nfc = pw\n∂α\n∂x\n+ k1αβ(uw − uc) and fw = pw ∂β\n∂x\n− k1αβ(uw − uc). (9)\nIn (9) k1 is the drag coefficient, which is proportional to the viscosity of the extracellular water. We note that\nadditional terms could be included to describe, for example, the change in momentum associated with mass\ntransfer between the two phases [6]. We discuss introducing such terms in Section 6. We have assumed that\nthe drag terms are proportional to the product αβ (i.e. there is no drag if either species is not present). Other\npermeabilities may be more physically realistic (for example, we could use the Carman-Kozeny relationship\npresented in [14]). However, we proceed with our form for the drag because we believe it is the simplest\npossible form.\nOxygen consumption rate\nFor consistency with [3,30], we suppose that the oxygen consumption rate is governed by a Michaelis-Menten\nlaw [11], and thus we set\nQc =\nQ0αC\n1 +Q1C\n, (10)\nwhere Q0 and Q1 are positive constants.\n2.2. Initial and boundary conditions\nWe suppose that the width of the tumour l(t) and the initial volume fraction of the cells are known, so that\nl = L0 and α = α0 at t = 0. (11)\nWe assume symmetry about the tumour centre, so that\nuc = uw = 0 at x = 0, (12)\n∂C\n∂x\n= 0 at x = 0. (13)\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 5\nAt the tumour boundary, we assume continuity of stress, and we allow the free passage of water. Neglecting\nthe medium outside the tumour, we therefore have\npw = 0, 2µc\n∂uc\n∂x\n=\nγ\nα− α∗\n(1− α)2 if α > αmin,\n0 if α < αmin.\nat x = l (14)\nWe also assume that the tumour’s outer boundary moves at the same speed as the tumour cells on the\nboundary and so we fix\ndl\ndt\n= uc|x=l. (15)\nFinally, we assume that the oxygen tension outside the tumour is constant, and thus we set\nC = Cout at x = l. (16)\nIn summary, our model consists of the conservation of mass equations (1), with sources given by (5), the\nno-voids condition (2), the conservation of momentum equations (3), with stresses defined in (6) and sources\ndefined in (9), the constitutive relationship given in (7), the oxygen tension equation (4) with consumption\nrate given by (10), and the initial and boundary conditions given in (11–16). We note that the model\ncomprises seven equations for the seven unknowns α, β, uc, uw, pc, pw and C. In the next section we show\nhow the model may be reduced to three equations for α, uc and C.\n3. Model simplification\nIn this section we reduce the model to a trio of equations for α, uc and C. First we add equations (1), to\nobtain\n∂\n∂x\n(αuc + (1− α)uw) = 0, (17)\nwhich we may integrate to obtain\nuw = − αuc\n1− α, (18)\nimposition of (12) indicating that the constant of integration be set to zero. Similarly, adding equations (3),\nand substituting for the stress in each phase using (6), we find that\nγ\n∂\n∂x\n(\nα\nα− α∗\n(1− α)2H(α− αmin)\n)\n+\n∂pw\n∂x\n= 2µc\n∂\n∂x\n(\nα\n∂uc\n∂x\n)\n. (19)\nWe use the second of equations (3) and (18) to obtain a relationship between pw and uc:\nuc =\n(1− α)\nk1α\n∂pw\n∂x\n. (20)\nWe substitute from (20) into (19) to obtain\nγ\n∂\n∂x\n(\nα\nα− α∗\n(1− α)2H(α− αmin)\n)\n+\nk1αuc\n1− α = 2µc\n∂\n∂x\n(\nα\n∂uc\n∂x\n)\n. (21)\nOur reduced model may now be stated as comprising the first of equations (1) coupled with equations (4)\nand (19), with boundary and initial conditions specified by (11–16).\n6 C. J. W. Breward et al.\n3.1. Nondimensionalisation\nWe scale the independent and dependent variables in the following manner:\nt = (1 + S1Cout)\/(S0Cout)t\n′, x = L0x′, l = L0l′,\nα = α′, uc = L0S0Cout\/(1 + S1Cout)uc′, C = CoutC ′.\nOmitting the primes, the resulting equations for the dependent variables read,\n∂α\n∂t\n+\n∂\n∂x\n(ucα) =\n(1 + s1)α(1− α)C\n1 + s1C\n− s2 + s3C\n1 + s4C\nα, (22)\n∂\n∂x\n(\nα\nα− α∗\n(1− α)2H(α− αmin)\n)\n+\nkαuc\n1− α = µ\n∂\n∂x\n(\nα\n∂uc\n∂x\n)\n, (23)\n∂2C\n∂x2\n=\nQαC\n1 + Qˆ1C\n, (24)\nwith initial and boundary conditions\nl = 1, α = α0 at t = 0, (25)\nuc = 0 =\n∂C\n∂x\nat x = 0, (26)\nµ\n∂uc\n∂x\n=\nα− α∗\n(1− α)2H(α− α\n∗), C = 1 at x = l, (27)\ndl\ndt\n= uc at x = l. (28)\nIn equations (22)-(27), we have introduced\ns1 = S1Cout, s2 = S2\n1 + S1Cout\nS0Cout\n, s3 = S3\n1 + S1Cout\nS0\n, s4 = S4Cout,\nk =\nk1L\n2\n0S0Cout\nγ(1 + S1Cout)\n, µ =\n2µcS0Cout\nγ(1 + S1Cout)\n, Q = Q0L\n2\n0, Qˆ1 = Q1Cout.\nIn this study, we shall focus our attention on the effects of varying the viscosity parameter µ and the drag\nconstant k.\n3.2. Change of variables\nBefore carrying out the numerical solutions, it is convenient to map the domain of interest onto a fixed\ndomain. We change variables from (x, t) to (ξ, τ), where ξ = x\/l(t) and τ = t. The transformed problem\nreads\n∂α\n∂τ\n− ξ\nl\ndl\ndτ\n∂α\n∂ξ\n+\n1\nl\n∂\n∂ξ\n(ucα) =\n(1 + s1)α(1− α)C\n1 + s1C\n− s2 + s3C\n1 + s4C\nα, (29)\nl\n∂\n∂ξ\n(\nα\nα− α∗\n(1− α)2H(α− αmin)\n)\n+\nkl2αuc\n1− α = µ\n∂\n∂ξ\n(\nα\n∂uc\n∂ξ\n)\n, (30)\n∂2C\n∂ξ2\n=\nQl2αC\n1 + Qˆ1C\n, (31)\nwith initial and boundary conditions\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 7\nl = 1, α = α0 at τ = 0, (32)\nuc = 0 =\n∂C\n∂ξ\nat ξ = 0, (33)\nµ\n∂uc\n∂ξ\n= l\nα− α∗\n(1− α)2H(α− αmin), C = 1 at ξ = 1, (34)\ndl\ndτ\n= uc at ξ = 1. (35)\nBefore presenting numerical simulations of the model equations, there are several points to note. In the\ncase where viscous effects are negligible, µ→ 0 and the stress equation (30) reveals that\nuc = −1− α\nklα\n∂\n∂ξ\n(\nα(α− α∗)\n(1− α)2 H(α− αmin)\n)\n. (36)\nSubstituting with (36) in (29) we deduce\n∂α\n∂τ\n=\n1\nkl2\n∂\n∂ξ\n[\n(1− α) ∂\n∂ξ\n(\nα(α− α∗)\n(1− α)2 H(α− αmin)\n)]\n+\nξ\nl\ndl\ndτ\n∂α\n∂ξ\n+\n(\n(1 + s1)α(1− α)C\n1 + s1C\n− s2 + s3C\n1 + s4C\nα\n)\n,\n(37)\nwith\nα = α0, l = 1 at τ = 0, (38)\n∂α\n∂ξ\n= 0 at ξ = 0, (39)\nα = α∗ at ξ = 1, (40)\ndl\ndτ\n=\n1\nkl(1− α∗)\n∂α\n∂ξ\nat ξ = 1. (41)\nThus, in the limit as µ → 0 the problem reduces to a nonlinear diffusion equation for the tumour cell\nvolume fraction, α. Such equations have been proposed by other authors to describe tumour growth (see,\nfor example, [15,25,26]). Whereas Sherratt, Gatenby and others used nonlinear diffusion equations as the\nstarting point for their modelling and analysis, we have presented a systematic argument, based on cellular\nbehaviour, which justifies their description of cellular motion as a diffusion process. Note that, while equation\n(30) is formally singular in the limit µ → 0, no boundary layer is formed because we are fortunate enough\nto still be able to satisfy all the boundary conditions in this limit.\nBy relaxing the assumption that viscous effects are negligible, so that µ > 0, we can generate a differential\nequation for A(τ) = α(l(τ), τ):\n∂A\n∂τ\n+\nA\nµ\n(\n(A− α∗)H(A− αmin)\n(1−A)2\n)\n= A(1− s5 −A), (42)\nwhere s5 = (s2 + s3)\/(1 + s4). Note that s5 denotes the ratio of the tumour cell death rate to the tumour\ncell birth rate that occurs when the oxygen tension is at the externally supplied level, (i.e. when C = Cout).\nIn Figure 1 we sketch A(τ) as τ varies for different choices of µ and fixed values of s5 and A(0). From these\nresults we note that as the cells become more viscous (i.e. as µ increases) the time taken for A to reach its\nsteady state increases. Also, we see that, for all parameter values considered, A has attained its steady state\nby time τ = 1. Now, the steady state, As = A(τ →∞), satisfies\nAs = 0, or\n1\nµ\n(As − α∗)\n(1−As)2 H(As − αmin) = 1− s5 −As. (43)\nIf 1− s5 < αmin, then As = 1− s5 whereas if 1− s5 > αmin, then As > αmin solves\n0 = µ(1−As)3 − µs5(1−As)2 + (1−As) + α∗.\n8 C. J. W. Breward et al.\nFigures 1 and 2 near here\nIn Figure 2 we plot the physically relevant root of the above cubic as µ varies, for fixed values of s5. We note\nthat if 1− s5 > α∗ then As > α∗ so that the cells at the tumour’s edge are in a stressed state, and we expect\nthe tumour to grow. From (43) we deduce that As → α∗ as µ → 0, and As → 1 − s5 as µ → ∞. Further,\nwhen s5 = 1\/11 and µ = 1, we find that As = 0.804, and, so, As − α∗ \u001c 1. In the limit s5 ∼ 1 − α∗, we\nconsider the expansion As = α\n∗ + \u000fA¯, where \u000f = 1− α∗ − s5. Substituting this form into (43), we find that\n\u000fA¯\nµ(1− α∗ − \u000fA¯)2 = \u000f(1− A¯) ⇒ A¯ =\nµ(1− α∗)2\n1 + µ(1− α∗)2 +O(\u000f). (44)\nWe can use the relationship for As in (34) to determine ∂uc\/∂ξ at ξ = 1:\n∂uc\n∂ξ\n(ξ = 1, τ) ∼ \u000fl\n1 + µ(1− α∗)2 +O(\u000f\n2). (45)\nThus, since we know, from the simulations presented in Figure 1, that A approaches its steady state by\nτ ∼ 1, when studying the longtime behaviour of the system it is appropriate to scale uc = \u000fu and τ = T\/\u000f:\nthis scaling ensures a nontrivial balance in (35).\nIn the case where we neglect drag (i.e. k → 0), which corresponds to the situation where the cells are\nnot affected by the flow of extracellular water between them, spatial variations in the water pressure become\nnegligible and the model reduces to a single equation for α: we integrate (30) twice to find that\nuc =\nl\nµ\n∫ ξ\n0\nα− α∗\n(1− α)2H(α− αmin)ds. (46)\nSubstituting (46) into (29) we find that\n∂α\n∂τ\n+\nα\nµ\nα− α∗\n(1− α)2H(α− αmin) +\n1\nµ\n∂α\n∂ξ\n∫ ξ\n0\nα− α∗\n(1− α)2H(α− αmin)ds−\nξ\nl\ndl\ndτ\n∂α\n∂ξ\n=\n(\n(1 + s1)α(1− α)C\n1 + s1C\n− s2 + s3C\n1 + s4C\nα\n)\n. (47)\nThe initial and boundary conditions read\nα = α0, l = 1 at τ = 0, (48)\nα = A at ξ = 1, (49)\ndl\ndτ\n=\nl\nµ\n∫ 1\n0\nα− α∗\n(1− α)2H(α− αmin)ds at ξ = 1. (50)\nThus, in the limit k → 0, the problem reduces to a non-local, integro-differential equation for the tumour\ncell volume fraction, α. To our knowledge, this is the first time such a model has been proposed to describe\ntumour growth.\nIn the case where both viscous effects and the drag are negligible (i.e. µ → 0, k → 0), the momentum\nbalance equation (30) predicts that the tumour cell volume fraction is constant, and equal to α∗, from the\nboundary conditions. Equation (29) then defines the speed with which the tumour cells move:\n∂uc\n∂ξ\n= l\n(\n(1 + s1)(1− α∗)C\n1 + s1C\n− s2 + s3C\n1 + s4C\n)\n. (51)\nIn (51), the evolution of l is governed by (35) so that\ndl\ndτ\n= uc|ξ=1 = l\n∫ 1\n0\n{\n(1 + s1)(1− α∗)C\n1 + s1C\n− s2 + s3C\n1 + s4C\n}\ndξ.\nThus, in the limit as k, µ → 0, our model describes a situation in which α is constant and the tumour’s\ngrowth rate depends on the oxygen distribution. This reduced model is similar in form to models presented\nby Greenspan [16] and Landman and Please [22].\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 9\nFinally, we note that in the limit in which the (dimensional) tension constant γ is negligible, (i.e. µ, k →\n∞), condition (34) reduces to ucξ = 0, and the solution to (30), (33), (34) and (35) is uc = 0, l = 1. In this\ncase, the tumour does not grow and (29) reduces to an ordinary differential equation that describes how\nmass is exchanged between the cellular and extracellular phases, until the volume fraction is such that the\ncells experience repulsive forces and the tumour can increase in size.\n4. Numerical simulations\nIn this section we present numerical simulations of equations (29)-(35), scaled so that we use u and T rather\nthan uc and τ (as described in the last section), in several parameter regimes. Our aims are to determine\nthe general behaviour of the model equations and to see how varying two key model parameters, namely the\nviscosity constant and the drag constant, affects the tumour’s growth.\nIn the absence of a complete set of parameter values, we focus on the qualitative nature of the model\nequations and pick the following values of the parameters:\nQ = 0.5, Qˆ1 = 0, s1 = s4 = 10, s2 = s3 = 0.5,\nk = 1 = µ = 1, α0 = αmin = α\n∗ = 0.8.\nWe have taken α∗ = αmin so that the effects of cellular attraction are not included in this simulation. We\nshow how α, u and l evolve over time in Figures 3a, b and c respectively. We find that, initially, the tumour\ncell volume fraction α increases towards the centre of the tumour (results not shown, but see Section 7 for\nan explanation): the tumour can relieve the stress at its outer boundary by expanding outwards and, thus,\nreducing the volume fraction there. Following this early phase, the tumour becomes sufficiently large that\ncells at the centre start to die, so that a central necrotic core forms and α there decreases. The system\nthen settles to a steady, travelling-wave solution, in which cells close to the edge of tumour move outwards\n(to relieve their stress), whilst cells nearer to the tumour centre move inwards. Figure 3c confirms that the\nsystem settles to a steady, travelling-wave profile: after an initial period of growth, the speed with which the\nleading edge of the tumour advances is approximately constant.\nFigure 3 about here\nIn Figure 4 we show how the size of the tumour changes over time, for different choices of the initial\nvolume fraction α(x, 0) = α0. For α0 < αmin (= α\n∗ in this case), there is a “waiting time” during which the\ntumour does not change in size but the tumour cell volume fraction increases to α∗ at the tumour’s edge.\nFigure 4 about here\nThe results presented in Figure 5 show how the tumour’s growth alters when the drag parameter k is\nchanged: as the drag coefficient increases the tumour’s growth rate reduces. The drag parameter represents\nthe ease with which extracellular water may pass between the tumour cells. As this parameter is increased,\nthe extracellular water is less able to flow between the cells and hence the mass available for tumour cell\nproliferation diminishes.\nFigure 5 about here\nThe impact that changing the viscosity parameter µ has on the tumour’s growth is depicted in Fig-\nure 6. We observe that as µ increases the tumour’s growth rate reduces. The viscosity parameter represents\nthe amount of inter-cellular cohesion, which is high for well-differentiated tumours, and low for poorly-\ndifferentiated tumours. Increasing this parameter corresponds to stronger inter-cellular bonds.\n10 C. J. W. Breward et al.\nFigure 6 about here\nIn Figure 7 we investigate the effects of altering µ and k simultaneously, in a way that corresponds to\nchanging the tension constant γ (see definition of dimensionless parameter groups k and µ following equation\n(28)). Decreasing k and µ together (i.e. increasing γ), increases the speed of tumour growth. The tension\nconstant corresponds to the affinity that the cells have for their natural volume fraction. As this parameter\nincreases, the cells move faster in order to try and regain the natural volume fraction. We discuss the physical\ninterpretations of these observations further in section 6.\nFigure 7 about here\nFinally we relax the assumption that αmin = α\n∗ and consider the impact of fixing αmin < α∗. Physically,\nthis means that the cells sense each other using their filopodia, and are attracted towards each other. When\nαmin = 0.6, the system settles to a steady state. The resulting steady state profiles for α and u, together\nwith the evolution of the tumour boundary l = l(T ), are presented in Figure 8. In this steady state, the\nmotion of the cells is everywhere inward, and the cellular volume fraction is significant everywhere. We do\nnot observe the formation of an area of necrosis.\nFigure 8 about here\n5. Analysis\nIn this section we present some analytical results which help to explain some of the behaviour observed\nin the last section. In particular, we derive an expression for the “waiting time” depicted in Figure 4,\nnecessary conditions for the formation of a steady state solution, and we investigate oxygen-independent\ngrowth (corresponding to the initial growth of the tumour) for different limits of the cellular viscosity µ.\n5.1. Transient analysis for tumours seeded below αmin\nWhen α(ξ, 0) = α0 < αmin, the solution to (30) is uc = 0. Equation (29) then reduces to a time-dependent\nordinary differential equation which describes the evolution of α at each position x. The tumour will remain\nof size l = 1 until τ = τwait, at which time α(1, τ) = αmin. We may determine this “waiting time” by solving\nthe differential equation for α(1, τ). With uc = 0, equation (42) reduces to\n∂A\n∂τ\n= A(1−A− s5), A(0) = α0, (52)\nwith solution\nA =\n(1− s5)α0e(1−s5)τ\n1− s5 − α0 − α0e(1−s5)τ . (53)\nThus, the waiting time, τwait, is given by\nτwait =\n1\n1− s5 log\n(\nαmin(1− s5 − α0)\nα0(1− s5 − αmin)\n)\n. (54)\nRemembering that T = (1−s5−α∗)τ , we show how the waiting time Twait varies with α0 in Figure 9. There\nis good agreement between the analytical values and the numerical estimates of Figure 4.\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 11\nFigure 9 about here\n5.2. Necessary conditions for realising an equilibrium solution\nThe numerical results presented in Figure 8 suggest that, in certain parameter regimes, the system ultimately\nevolves to a steady state. We suppose that such a state is possible, and seek necessary conditions for realising\nequilibrium solutions. If a steady state occurs then uc = 0 at ξ = 1. Integrating equation (34) and noting\nthat uc = 0 at ξ = 0, 1, we deduce that a necessary condition for obtaining a steady state solution is:∫ 1\n0\n{\nα(1− α)(1 + s1)C\n1 + s1C\n− s2 + s3C\n1 + s4C\nα\n}\ndξ = 0. (55)\nIntegrating equation (30) twice with respect to ξ we find that a second necessary condition is:∫ 1\n0\nα(α− α∗)H(α− αmin)\n(1− α)2 dx =\n∫ 1\n0\nk\nα\n∫ 1\nξ\nαuc\n1− αdydx. (56)\nSince uc ≤ 0 and 0 ≤ α ≤ 1, we note that the integral on the right-hand-side (RHS) of (56) is non-positive\nand, for non-trivial solutions, it is negative. Since the RHS of (56) is non-zero, we deduce that α > αmin\nfor a finite range of points within the tumour volume. Since, for a nontrivial solution, the integrals in (56)\nare both negative, we deduce further that α∗ > αmin is a necessary condition for obtaining a steady state\nsolution. We note that the numerical simulations presented in section 4 are consistent with these necessary\nconditions. The physical interpretation is that, in order for our tumour to reach a steady state, we must\nhave a region within the tumour where the cells are sparsely populated and short-range attractive forces are\nacting in order to balance the repulsive forces experienced in denser packed regions of the tumour.\n5.3. Analysis for initial stages of tumour growth\nIn this section we focus on equations (22)-(28) during the initial stages of avascular tumour growth, when all\ncells are well-oxygenated and, hence, proliferate at the maximal, oxygen-independent rate. The asymptotic\nlimit of interest has Q = Qˆ1 = 0 (and, hence, C ≡ 1) and s2 = s3 = 0 (and, hence, no cell death). In what\nfollows, to simplify the analysis, we shall also assume that 0 < 1 − α∗ \u001c 1. Physically, this corresponds to\nthe case where, at the natural packing density, the tumour cells fill almost all of the available space within\nthe tumour.\nWe scale α, uc and t using similar scalings to those proposed at the end of section 3. Specifically, we write\n1− α = \u000fθ, uc = \u000fu, t = T\/\u000f, where 0 < \u000f = 1− α∗ \u001c 1.\nUnder these rescalings, equations (22) and (23) become\n−\u000f ∂θ\n∂T\n+\n∂\n∂x\n((1− \u000fθ)u) = (1− \u000fθ)θ, (57)\n\u000fµ\n∂\n∂x\n(\n(1− \u000fθ)∂u\n∂x\n)\n− ∂\n∂x\n(\n(1− \u000fθ) (1− θ)\n\u000fθ2\n)\n= k\n1− \u000fθ\nθ\nu, (58)\nwith boundary conditions\nu = 0 at x = 0, (59)\nµ\n∂u\n∂x\n=\n(1− θ)\n\u000f2θ2\nat x = l, (60)\ndl\ndT\n= u at x = l. (61)\nIf we introduce ν = µ\u000f2, κ = k\u000f then equations (57) and (58) read (at leading-order in \u000f)\n∂u\n∂x\n= θ, ν\n∂2u\n∂x2\n+\n(2− θ)\nθ3\n∂θ\n∂x\n= κ\nu\nθ\n,\n12 C. J. W. Breward et al.\nand may be combined to yield a single equation for θ:\n∂\n∂x\n((\nνθ +\n2\nθ2\n− 1\nθ\n)\n∂θ\n∂x\n)\n= κθ. (62)\nThe boundary conditions now read\n∂θ\n∂x\n= 0 at x = 0, (63)\nνθ =\n(1− θ)\nθ2\nat x = l, (64)\ndl\ndT\n=\n1\nκ\n(\nνθ +\n2\nθ2\n− 1\nθ\n)\n∂θ\n∂x\nat x = l. (65)\nWe now investigate the behaviour of equations (62)-(65) for three limiting cases: (a) 0 < ν \u001c 1, (b) ν ∼ O(1)\nand (c) ν \u001d 1. Case (a) corresponds to a situation in which the viscous effects are unimportant, and the\ntumour development is governed by drag and tension effects, case (b) corresponds to a situation in which\nviscous, tension and drag effects are all important, and case (c) corresponds to a situation in which viscous\neffects dominate.\n(a) Small ν limit. When 0 < ν \u001c 1, viscous effects can be neglected and the leading-order problem for θ\nmay be integrated once by introducing ∂θ\/∂x = ϕ(θ)1\/2 and imposing (63). We find that\nϕ =\n2κθ4\n(2− θ)2 (2 log (θ\/θ\n∗) + (θ∗ − θ)) , (66)\nwhere θ∗(T ) = θ(0, T ). Referring to (64), we remark that, since 0 < ν \u001c 1, θ = 1 at x = l and, so, (65)\nimplies that\nκ\n(\ndl\ndT\n)2\n= −4 log θ∗ − 2(1− θ∗). (67)\nUsing the solution for ϕ given above, we find that the (implicit) solution for θ reads\n√\n2κx =\n∫ θ\nθ∗\n(2− s)ds\ns2\n√\n2 log(s\/θ∗)− (s− θ∗) . (68)\nIt remains to determine the size of the tumour l and θ∗. There are two equations for these two unknowns,\nnamely (67) and\n√\n2κl =\n∫ 1\nθ∗\n(2− s)ds\ns2\n√\n2 log(s\/θ∗)− (s− θ∗) . (69)\nCombining these equations yields the following equation for θ∗:\n∂θ∗\n∂T\n= 2(−2 log θ∗ − (1− θ∗))θ∗2 + (−2 log θ∗ − (1− θ∗))1\/2θ∗2\n∫ 1\/θ∗\n1\nΛ(r, θ∗)dr (70)\nwhere\nΛ(r, θ∗) =\n16 log r − 2(−5 + 5r + 2r log r)θ∗ + 3(r − 1)rθ∗2\n2r2θ∗3(−2 log r + (r − 1)θ∗)√2 log r + θ∗(1− r)dr. (71)\nIn practice, it is easier to solve (66) numerically, treating l as a parameter and identifying the value of θ∗\nthat is consistent with the boundary conditions and this choice of l. The solutions for various values of l\nare presented in Figure 10. We see that, as the tumour grows, θ decreases internally and has a minimum\nat the centre of the tumour. Thus, as the tumour grows, the tumour cell volume fraction (α = (1 − θ)\/\u000f)\nincreases internally, and has a maximum at the centre. We can understand this behaviour by considering the\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 13\nfollowing argument. Cells throughout the tumour mass proliferate. In the vicinity of the boundary, there is\nless resistance to motion than in the centre and so the cellular volume fraction is lower near the boundary\nthan in the centre due to cell motion. The tumour mass expands because the cellular volume fraction exceeds\nthe natural packing density throughout, and hence the tumour grows in order to relieve this stress.\nWhen determining how l increases over time, there are two options: either we solve equation (70) to\nobtain θ∗, or we use the value of θ∗ = θ∗(l) identified from the numerical solution described above. In both\ncases, we then use (67) to determine l. In practice, we write∫ l\n1\nds\n(−2 log(θ∗(s))− (1− θ∗(s)))1\/2 =\n√\n2\nκ\nτ, (72)\nand use the second approach. The resulting growth curves for different choices of κ are presented in Figure 11.\nThey show that increasing κ retards tumour growth. Since κ = \u000fk ∝ k1\/γ, this corresponds to either\nincreasing the drag coefficient k1 or decreasing the tension constant γ. Thus the qualitative behaviour of our\nreduced, oxygen-rich model is in good agreement with the numerical results of the full model presented in\nFigures 5 (k varies) and 7 (γ varies).\nFigures 10 and 11 here\n(b) ν ∼ O(1). When ν ∼ O(1), viscous, drag and tension effects are all important. As above, we substitute\n∂θ\n∂x = ϕ(θ)\n1\/2 into (62), and find that\nϕ =\n2κθ4\n(2− θ + νθ3)2\n(\n2 log(θ\/θ∗)− (θ − θ∗) + ν\n3\n(θ3 − θ∗3)\n)\n. (73)\nUsing the boundary conditions at x = l, we find that the condition for lT reads\nκ\n2\n(\ndl\ndT\n)2\n= 2 log(θl\/θ\n∗)− (θl − θ∗) + ν\n3\n(θ3l − θ∗3), (74)\nwhere θl is the positive root of (64) which decreases monotonically with ν.\nIn order to ascertain the effects of including viscosity, we compare θ for tumours of various size in Figure\n12, for ν = 0 and ν = 1. We fix κ = 1 throughout these calculations. We see that, in each case, the viscosity\nlowers the value of θ throughout the tumour, but that, for large l, the difference between the viscous and\nnon-viscous cases is negligible except close to the advancing front. We show how the tumour size varies with\ntime in Figure 13. We see that the viscous term retards the tumour’s growth, so that, again, the reduced,\noxygen-rich model exhibits the same qualitative behaviour as the full model (see Figure 6).\nFigures 12 and 13 near here\n(c) Large ν limit. When ν \u001d 1, viscous effects dominate drag and tension effects. We set δ = 1\/ν \u001c 1, and\nthen the problem reads\n∂\n∂x\n((\nθ +\nδ(2− θ)\nθ2\n)\n∂θ\n∂x\n)\n= δκθ, (75)\n∂θ\n∂x\n= 0 at x = 0, (76)\nθ3 = δ(1− θ) at x = l, (77)\nδ\ndl\ndT\n=\n1\nκ\n(\nθ +\nδ(2− θ)\nθ2\n)\n∂θ\n∂x\nat x = l. (78)\n14 C. J. W. Breward et al.\nIn this limit, regardless of the size of κ, the leading-order solution when we take δ → 0 is\nθ = 0, l = 1. (79)\nIn the leading-order solution, the tumour mass consists entirely of cells, which cannot proliferate since there\nis no extracellular water present. The tumour therefore stays at a constant width.\nWe are forced to rescale θ so that θ 6= 0 at x = 1. Using (77), we deduce that the appropriate scaling is\nθ = δ1\/3ψ, and the behaviour of the resulting model depends on the asymptotic size of κ relative to δ.\nIf κ ∼ O(δ−1\/3), then the drag term is negligible, and the solution to the problem reads\nθ = ν−1\/3, l = 1. (80)\nIf κ ∼ O(δ−2\/3), we set K = δ2\/3κ, and rescale time in order to retain the time-dependence in equation\n(78) (specifically, we fix T = δ−1\/3T ′). As for the cases of small and O(1) viscosity, we are able to integrate\nthe resulting problem. If we set ϕ1\/2 = ∂ψ∂x , then the equation for ϕ reads\n∂ϕ\n∂ψ\n− 2(4− ψ\n3)\nψ(2 + ψ3)\nϕ =\n2Kψ3\n2 + ψ3\n, (81)\nwhich has solution\nϕ =\n2Kψ4\n(2 + ψ3)2\n(\n2 log(ψ\/ψ∗) +\n1\n3\n(\nψ3 − ψ∗3\n))\n. (82)\nThe tumour’s growth rate satisfies\nK\n2\n(\ndl\ndT ′\n)2\n= −2 logψ∗ + 1\n3\n(\n1− ψ∗3\n)\n. (83)\nWe comment that time has been rescaled to a long timescale T ′ = δ1\/3T . This indicates that the tumour’s\ngrowth rate slows as µ→∞, a result which is consistent with the numerical results presented in Figure 6.\nAs a final remark, we note that, as the tumour gets larger, the effects of oxygen depletion become more\nimportant and the validity of our assumption that the tumour is nutrient-rich becomes less valid.\n6. Discussion\nIn this paper we have presented a new mathematical model that describes the growth of an avascular\ntumour. The model is based on a multiphase flow, and incorporates the effects of (i) cell proliferation and\ndeath changes that depend on the local oxygen tension, (ii) motion of the cells due to short range attraction\n(if the cells are sparsely populated) and repulsion (if the cells are overcrowded), (iii) the viscous nature of\nthe cells, (iv) drag forces caused by the motion of extracellular water through the gaps between the cells,\nand (v) changes in oxygen tension due to cellular consumption. Formulating the model in this way allows us\nto couple together mechanical and growth phenomena. For example, our framework could easily be used to\nstudy the effect of stress on cellular proliferation and death, as demonstrated experimentally in [9,19] and\nstudied in [7].\nWe were able to solve explicitly for the volume fraction of tumour cells on the tumour boundary and to\nshow that the tumour cell death rate was crucial in determining the behaviour of the advancing front. In\nparticular, if the death rate is less than a threshold value, then cells at the front are in a stressed state and\nwe predict that the tumour will expand in order to relieve this stress. We showed that a number of models\nfor tumour growth that exist in the literature may be recovered as special, limiting cases of our model. For\nexample, when viscous effects are neglected, the resulting model reduces to a nonlinear diffusion equation\nfor the cellular volume fraction (akin to the models presented by Sherratt [25,26] and Gatenby [15]). Thus,\nour model provides a justification for using nonlinear diffusion equations to describe tumour growth, and\nprovides an interpretation of the diffusivity in such models in terms of cell-cell interactions. Further, when\nboth viscosity and interphase drag were neglected, the model admitted solutions in which the cellular volume\nfraction was constant and the tumour’s growth rate was regulated by the oxygen tension along. This reduced\nmodel is in line with models developed by Byrne and Chaplain [5], Greenspan [16] and Landman and Please\n[22].\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 15\nIn section 4 we presented numerical simulations of the model equations. We saw that, in the case where\nthe short-range, attractive force was inactive, the tumour developed a necrotic core, and the live cells were\nconfined to a thin region near the advancing front. Cells close to this front propagated outwards, while cells\ncloser to the centre migrated inwards. The system settled to a travelling wave with near constant speed\nof propagation. The distribution of live and dead cells within the tumour mass mirrors the actual spatial\nstructure observed in a multicell spheroid in vitro (see [24]), and also has the same features as the solutions\npresented in [28]. Tumours seeded below the natural packing density enjoyed a period of quiescence during\nwhich the overall size of the tumour remained fixed and the cell density increased to the natural packing\ndensity. Thereafter the tumour expanded, as normal. We were able to predict this waiting time and show how\nit depended on system parameters such as the initial cell density and the natural packing density. Whilst the\nexistence of waiting times in solid tumour growth remains to be investigated experimentally, we note that\nthis result may have important implications in tissue engineering [8]. Here pieces of tissue, such as cartilage,\nthat are needed to replace damaged or degraded tissue, are cultured in vitro by seeding the relevant cells\non a porous scaffold which is bathed in fluid and vital nutrients. We anticipate that in such circumstances\nthere may be an initial quiescent period, or waiting time, during which the seeded cells increase in number\nbut the colony size does not increase in size.\nBy performing a series of numerical simulations (with the short-range, attractive force switched off),\nwe investigated the impact that changing the model parameters had on the tumour’s growth. We found\nthat increasing the drag parameter reduces the speed of tumour growth, increasing the viscosity parameter\nreduces the tumour growth, while increasing the tension constant increases the speed of tumour growth.\nOur prediction that increasing the drag parameter reduces the speed of tumour growth is consistent with\nthe interpretation that the drag represents the ease with which extracellular water may pass between the\ntumour cells, and correlates with the viscosity of the extracellular water (which, in this paper, comprises\nof water and necrotic debris). Increasing the drag increases the resistance to the motion of extracellular\nwater, and, in turn, this slows local growth of tumour cells due to lack of available building blocks. Our\nprediction that increasing the cellular viscosity decreases the speed of tumour growth is consistent with\nthe idea that cellular viscosity correlates with the degree of differentiation (and, hence, invasiveness) of the\ntumour cells, i.e. we predict that tumours containing well-differentiated cells grow more slowly than their\nless differentiated counterparts. Our prediction that the speed of tumour growth increases with increasing\nthe tension coefficient is consistent with the idea that the tension coefficient corresponds to the affinity of the\ncells to their natural volume fraction. Increasing the tension coefficient increases this affinity and increases\nthe speed with which the cells move in order to try and regain the natural volume fraction. This results in an\nincrease in the speed of expansion of the tumour when the cells proliferate. We suggest that experiments be\ncarried out to test these hypotheses. For example, to test whether increasing the extracellular drag decreases\ntumour growth, spheroids could be grown in vitro in liquids of different viscosities (since the viscosity of the\nextracellular water depends crucially on the viscosity of any external liquid source).\nWith the short-range, attractive force switched on, the tumour evolved to a steady state (with the\nparticular set of parameters chosen) in which cellular motion was always inward. In such a situation, there\nwas no mass flux across the free surface, and the mass required for the generation of new cells came completely\nfrom recycling old cells. No area of necrosis was generated in this case.\nWe analysed the model for the special case in which the tumour was rich in oxygen and the cells prolifer-\nated at their maximal, oxygen-independent rate. We expect that this case is relevant during the early stages\nof avascular growth, whilst the tumour is still small enough that all cells are well-nourished. With suitable\nchoices for the parameters, we were able to reduce the model to a quasi-steady limit. We found that the\nvolume fraction of tumour cells was highest in the centre of the tumour, which we attributed to proliferation\nand the inability of the cells near the centre to migrate. Further, increasing the drag coefficient decreased the\nspeed of tumour growth, as did increasing the viscosity. We also saw that increasing the viscosity increased\nthe cell volume fraction at the boundary, and throughout the tumour, for a given width. In the limit of large\nviscosity, we found that the tumour cells filled space, and that there was no growth in this case because there\nwas no extracellular water available to provide the building blocks for proliferation. The results of varying\nthe key parameters in the oxygen-rich model agree well with the results of the numerical solution of the full\nmodel, even though they are a valid approximation only when the tumour remains small.\nIn developing our two-phase model, we have employed the simplest forms for each of the mechanisms\nincluded. We could modify these relations to make them more realistic. For example, we could use the\n16 C. J. W. Breward et al.\nCarman-Kozeny relationship for the permeability (see [14]). This is an empirically determined relationship\nthat is used to describe the drag between water and sand grains that are nearly spherical, and captures the\neffect of the pore configuration. In this case,\nfc = pw\n∂α\n∂x\n+\nk1α\n2\n(1− α)2 (uw − uc), (84)\nand the equation replacing (21) would read\nγ\n∂\n∂x\n(\nα\nα− α∗\n((1− α)2H(α− αmin)\n)\n+\nk1α\n2uc\n(1− α)4 = 2µc\n∂\n∂x\n(\nα\n∂uc\n∂x\n)\n. (85)\nOur relationship for the cell-cell interaction term Σc could also be modified to remove the jump in the\npressure at α = αmin. To do this, we would consider a Σc of the form\nΣc =\nγ\n(α− α∗)(α− αmin)\n(1− α)2 if α > αmin,\n0 if α < αmin.\n(86)\nThese and other modifications to the functional forms that are used to describe the various phenomena in\nour model still result in a second-order equation for the cell velocity of the form\n∂\n∂x\n(\nf1(α)\n∂uc\n∂x\n)\n= f2(α)uc + f3(α). (87)\nIn addition to providing a more physically-based description of avascular tumour growth, the model\npresented in this paper is a first step towards achieving a realistic model of vascular tumour growth. In order\nto do this, we plan to extend the existing model to include three phases: cells, extracellular water, and blood\nvessels. The modelling approach will follow directly from that presented herein; we merely require a further\nconstitutive law to close the system. Such a model will be valuable to both experimentalists and clinicians\nfor describing both the growth of vascular tumours in vivo and also for investigating the impact of therapies,\nincluding those that target the tumour’s vasculature.\nThree phase models could also be used to provide more detailed descriptions of other aspects of solid\ntumour growth. For example, we could include the effects of macrophages, extracellular matrix or a second\npopulation of tumour cells. Further, the multiphase modelling approach described in this paper could be used\nto describe a variety of other interesting and biologically important situations in which mass changes phase,\nsuch as modelling the growth of tissue engineered cartilage, bone remodelling, and soft tissue growth (see [1,\n8,27] for examples of work that could be extended). In each case, the challenge of the modelling will be to\ncapture accurately the stress relationships observed physiologically, and to incorporate correct representations\nof the sources and sinks for both mass and momentum. We believe that these models represent the natural\nmodelling framework for mathematical study in these areas.\nAcknowledgements. We wish to acknowledge many helpful discussions with Dr P. D. Howell. This work was carried\nout with the financial support of an EPSRC Ropa award (to CEL\/HMB for CJWB) and an EPSRC Advanced\nFellowship (HMB).\nReferences\n1. Barochas, V. H. & Tranquillo, R.T. (1997) An anisotropic biphasic theory of tissue-equivalent mechanics:\nthe interplay among cell traction, fibrillar network deformation, fibril alignment and cell contact guidance. J.\nBiomed. Eng., 119, 137–145.\n2. Breward, C. J. W., Byrne, H. M. & Lewis, C. E. (2001) Modelling the interactions between tumour cells\nand a blood vessel in microenvironment within a vascular tumour. Euro. J. Appl. Math.., 12, 529–556.\n3. Breward, C.J.W. et al. (2001) Pericellular oxygen tension in experimental cell culture apparatus (working\ntitle). In Preparation.\n4. Byrne, H. M. & Chaplain, M. A. J. (1995) Growth of nonnecrotic tumours in the presence and absence of\ninhibitors. Math. Biosci., 2, 151–181.\n5. Byrne, H. M. & Chaplain, M. A. J. (1997) Free boundary value problems associated with the growth and\ndevelopment of multicell spheroids. Euro. J. Appl. Math., 8, 639–658.\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 17\n6. Byrne, H.M., King, J.R., McElwain, D.L.S. & Preziosi, L. (2001) A two-phase model of solid tumour\ngrowth. Appl. Math. Lett.. In Press.\n7. Byrne, H.M. & Preziosi, L. (2001) Modelling solid tumour growth using the theory of mixtures. IMA J. Math.\nAppl. Med. Biol.. Submitted.\n8. Cowin, S. (2000) How is a tissue built? J. Biomech. Eng., 122, 553–569.\n9. Curtis, A. S. G. & Seehar, G.M. (1971) The control of cell division by tension or diffusion. Nature, 274,\n52–53.\n10. De Angelis, E. & Preziozi, L. (2000) Advection-diffusion models for solid tumour evolution in vivo and related\nfree boundary problems. Math. Mod. Meth. App. Sci., 10:(3), 379–407.\n11. Dixon, M. & Webb, E.C. (1979) Enzymes. Academic Press, New York.\n12. Fitt, A. D., Howell, P. D., King, J. R., Please, C. P. & Schwendeman, D.W. Poroelastic multiphase\nflow modelling for paper squeezing. Euro. J. Appl. Math. To appear.\n13. Franks, S. J. (2001) Mathematical modelling of tumour growth and stability. PhD Thesis. University of Not-\ntingham.\n14. Fowler, A. C. (1997) Mathematical models in the applied sciences. Cambridge University Press, Cambridge.\n15. Gatenby, R.A. & Gawlinski, E.T. (1996) A reaction-diffusion model of cancer invasion. Cancer Res., 56,\n5745-5753.\n16. Greenspan, H.P. (1972) Models for the growth of a solid tumour by diffusion. Stud. Appl. Math., 52, 317-340.\n17. Greenspan, H. P. (1976) On the growth and stability of cell cultures and solid tumours. J. Theor. Biol., 56,\n229–242.\n18. Hahnfeldt, P., Panigraphy, D., Folkman, J. & Hlatky, L. (1999) Tumour development under angiogenic\nsignalling: a dynamic theory of tumour growth, treatment ersponse and postvascular dormancy. Cancer Res., 59,\n4770–4775.\n19. Helmlinger, G., Netti, P. A., Lichtenbeld, H. C., Melder, R. J., & Jain, R. K. Solid stress inhibits the\ngrowth of multicellular tumour spheroids. Nature Biotech., 15, 778–783.\n20. Hockel, M., Schlenger, K., Hockel S. & Vaupel, P. (1999) Hypoxic cervical cancers with low apoptotic\nindex are highly agressive. Cancer Res., 59(18), 4525–4528.\n21. Krogh, A. (1919) The number and distribution of capillaries in muscles with calculations of the oxygen pressure\nhead necessary for supplying the tissue. J. Physiol., 52, 409–415.\n22. Landman, K. A. & Please, C. P. (2001) Tumour dynamics and necrosis: surface tension and stability. IMA.\nJ. Math. Appl. Med., 18:2, 131–158.\n23. Pignatelli, M. (1998) Integrins, cadherins and catenins: molecular cross-talk in cancer cells. J. Pathol., 186:(1),\n1–2.\n24. Santini, M.T. & Rainaldi, G. (1999) Three-dimensional spheroid model in tumour biology. Pathobiology,\n67:(3), 148–157.\n25. Sherratt, J.A. (1993) Cellular growth and travelling waves of cancer. SIAM Appl. Math., 53, 1713-1730.\n26. Sherratt, J.A. (2000) Wave front propagation in a competition equation with a new motility term modelling\ncontact inhibition between cell populations. Proc. Roy. Soc Lond. A, 456, 2365-2386.\n27. Simon, B. R., Liable, J. P., Pflaster, D., Yuan, Y., & Krag, M. H. (1996) A poroelastic finite element\nformulation including transport and swelling in soft tissue structures. J. Biomed. Eng., 118, 1–9.\n28. Ward, J. P. & King, J. R. (1997) Mathematical modelling of avascular-tumour growth. IMA. J. Math. Appl.\nMed., 14, 39–69.\n29. Ward, J. P. & King, J. R. (1999) Mathematical modelling of avascular-tumour growth II: modelling growth\nsaturation. IMA. J. Math. Appl. Med., 16, 171–211.\n30. Wolff, M., Fandrey, J., & Jelkmann, W. (1993) Microelectrode measurements of pericellular pO2 in\nerythropoietin-producing human hepatoma cell cultures. Am. J. Physiol, 265:(5), 1266–1270\n18 C. J. W. Breward et al.\n0.2 0.4 0.6 0.8 1\n0.82\n0.84\n0.86\n0.88\n0.9\nτ\nA\nFig. 1. Graph showing how A varies with τ when µ = 0.1 (dot-dashed line), µ = 1 (Solid line), and µ = 10 (dashed\nline). Parameter values: αmin = 0.7, α\n∗ = 0.8 and s5 = 1\/11.\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 19\n2 4 6 8 10\n0.78\n0.82\n0.84\nAs\nµ\nFig. 2. Graph showing how As varies with µ, for s5 = 0 (small dashed line), s5 = 1\/11 (solid line), s5 = 0.15,\n(dot-dashed line) and s5 = 0.3 (large dashed line). Parameter values: αmin = 0.7, α\n∗ = 0.8.\n20 C. J. W. Breward et al.\n2.5 5 7.5 10 12.5 15 17.5 20\n0.2\n0.4\n0.6\n0.8\n1\nα\nx\n2.5 5 7.5 10 12.5 15 17.5 20\n-0.4\n-0.2\n0.2\n0.4\n0.6\n0.8\n1\nu\nx\n5 10 15 20 25\n2.5\n7.5\n10\n12.5\n15\n17.5\n20\nT\nl\nFig. 3. Graphs showing (a) how α varies with x = ξl(T ), for various values of T (T = 0.4, 3.2, 6, 8.8, 11.6, 14.4,\n17.2, 20 and 22.8) (b) how u varies with x, for various values of T , and (c) how l evolves with T .\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 21\n1 2 3 4\n2\n3\n4\n5\nl\nT\nFig. 4. Graph showing how l varies with T , for α0 = 0.1 (dashed line) α0 = 0.5 (solid line) and α0 = 0.8 (dot-dashed\nline line). Parameter values: µ = 0.25 and k = 0.25.\n22 C. J. W. Breward et al.\n10 20 30 40\n5\n10\n15\n20\n25\n30\nl\nT\nFig. 5. Graph showing how l varies with T , for k = 0.1 (dashed line) k = 1.0 (solid line) and k = 10.0 (dot-dashed\nline). Parameter values: µ = 1.\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 23\n5 10 15 20\n2\n4\n6\n8\n10\n12\n14\nl\nT\nFig. 6. Graph showing how l varies with T , for µ = 0.25 (dashed line) µ = 1.00 (solid line) and µ = 10.00 (dot-dashed\nline). Parameter values: k = 1.\n24 C. J. W. Breward et al.\n10 20 30 40\n5\n10\n15\n20\n25\n30\nl\nT\nFig. 7. Graph showing how l varies with T , for µ = k = 0.25 (dashed line) µ = k = 1.00 (solid line) and µ = k = 10.00\n(dot-dashed line).\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 25\n0.2 0.4 0.6 0.8 1\n0.78\n0.785\n0.79\n0.795\nα\nξ\n0.2 0.4 0.6 0.8 1\n-1\n-0.8\n-0.6\n-0.4\n-0.2\nu\nξ\n2 4 6 8 10 12\n1.5\n2\n2.5\n3\n3.5\n4\nl\nT\nFig. 8. Graphs showing (a) how α varies with ξ = x\/l and (b) how u varies with ξ = x\/l, in the steady state, and\n(c) how l varies with T . Parameter values: µ = 0.25, k = 0.25, α∗ = 0.8, and αmin = 0.6.\n26 C. J. W. Breward et al.\n0.2 0.4 0.6 0.8\n0.2\n0.4\n0.6\n0.8\n1\nTwait\nα0\nFig. 9. Graph showing how the waiting time Twait varies with α0. The dots indicate the waiting times for tumours\nseeded with α0 = 0.1 and 0.5 (c.f. Figure 4). Parameter values s5 = 1\/11, α\n∗ = αmin = 0.8\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 27\n0.2 0.4 0.6 0.8 1\n0.2\n0.4\n0.6\n0.8\n1\nθ\nξ\nFig. 10. Graph showing how θ varies with ξ = x\/l, for l = 1 (highest line), 2, 5, 10 and 20 (lowest line).\n28 C. J. W. Breward et al.\n2 4 6 8 10\n5\n10\n15\n20\n25\nT\nl\nFig. 11. Graph showing how l varies with T , for κ = 0.1 (dashed line), 1 (solid line), and 10 (dot-dashed line).\nThe role of cell-cell interactions in a two-phase model for avascular tumour growth 29\n0.2 0.4 0.6 0.8 1\n0.2\n0.4\n0.6\n0.8\n1\nθ\nξ\nFig. 12. Graph showing how θ varies with ξ = x\/l, for ν = 0 (solid line) and ν = 1 (dashed line) for tumours of\nwidth l = 1 (highest lines), 2, 5, 10 and 20 (lowest lines).\n30 C. J. W. Breward et al.: cell-cell interactions in avascular tumour growth\n2 4 6 8 10\n5\n10\n15\n20\n25\nl\nT\nFig. 13. Graph showing l against T for ν = 0 (dashed line), ν = 1 (solid line) and ν = 10 (dot-dashed line).\n"}