{"doi":"10.1086\/511894","coreId":"93264","oai":"oai:eprints.lse.ac.uk:3051","identifiers":["oai:eprints.lse.ac.uk:3051","10.1086\/511894"],"title":"Qualified ratification: explaining reservations to international human rights treaties","authors":["Neumayer, Eric"],"enrichments":{"references":[{"id":17300964,"title":"Accepting the Unacceptable? A New Nordic Approach to Reservations to Multilateral Treaties.","authors":[],"date":"2000","doi":"10.1163\/15718100020296233","raw":"Klabbers, Jan. 2000. Accepting the Unacceptable? A New Nordic Approach to Reservations to Multilateral Treaties. Nordic Journal of International Law 69:179–93.","cites":null},{"id":17300951,"title":"Annual Surveys of Freedom Country Ratings","authors":[],"date":"2004","doi":"10.4135\/9781412972048.n633","raw":"Freedom House. 2004. Annual Surveys of Freedom Country Ratings 1972 to 2003. New York: Freedom House.","cites":null},{"id":17300939,"title":"Cingranelli and Richards Human Rights Dataset (computer ﬁle).","authors":[],"date":"2004","doi":"10.1353\/hrq.0.0141","raw":"Cingranelli, David L., and David L. Richards. 2004. Cingranelli and Richards Human Rights Dataset (computer ﬁle). http:\/\/www.humanrightsdata.com.","cites":null},{"id":17300992,"title":"Defense of Declarations, Reservations and Understandings. Pp. 54–67 in U.S. Ratiﬁcation of the Human Rights Treaties—with or without Reservations? edited by Richard B. Lillich.Charlottesville:University Press of Virginia.","authors":[],"date":"1981","doi":null,"raw":"Rovine, Arthur. 1981. Defense of Declarations, Reservations and Understandings. Pp. 54–67 in U.S. Ratiﬁcation of the Human Rights Treaties—with or without Reservations? edited by Richard B. Lillich.Charlottesville:University Press of Virginia.","cites":null},{"id":17300986,"title":"Do International Human Rights Treaties ImproveRespect for Human Rights?","authors":[],"date":"2005","doi":"10.2139\/ssrn.607681","raw":"Neumayer, Eric. 2005. Do International Human Rights Treaties ImproveRespect for Human Rights? Journal of Conﬂict Resolution 49:1–29 Neumayer, Eric, and I. De Soysa. 2005. Trade Openness, Foreign Direct Investment and Child Labor. World Development 33:43–63.","cites":null},{"id":17300956,"title":"Explaining Costly International Institutions:Persuasion and Enforceable Human Rights Norms.","authors":[],"date":"2004","doi":"10.1111\/j.0020-8833.2004.00325.x","raw":"Hawkins, Darren. 2004. Explaining Costly International Institutions:Persuasion and Enforceable Human Rights Norms. International Studies Quarterly 48: 779–804.","cites":null},{"id":17300936,"title":"General Comment 24: Confronting the Problem of Res-426","authors":[],"date":"1999","doi":null,"raw":"Baylis, Elena A. 1999. General Comment 24: Confronting the Problem of Res-426 \/ THE JOURNAL OF LEGAL STUDIES \/ VOLUME 36 (2) \/ JUNE 2007 ervations to Human Rights Treaties. Berkeley Journal of International Law 17:277–329.","cites":null},{"id":17300966,"title":"How Is International Human Rights Law Enforced?","authors":[],"date":"1998","doi":"10.1093\/acprof:oso\/9780198259121.001.0001","raw":"———. 1998. How Is International Human Rights Law Enforced? Indiana Law Journal 74:1396–1417.","cites":null},{"id":17300954,"title":"How to Inﬂuence States: Socialization and International Human Rights Law. Duke Law Journal 54:621–703.","authors":[],"date":"2004","doi":"10.1093\/acprof:oso\/9780199300990.003.0001","raw":"Goodman, Ryan, and Derek Jinks. 2004. How to Inﬂuence States: Socialization and International Human Rights Law. Duke Law Journal 54:621–703.","cites":null},{"id":17300952,"title":"Human Rights as General Norms and a State’s Right to Opt Out—Reservations and Objections to Human Rights Conventions. London:","authors":[],"date":"1997","doi":"10.1093\/acprof:oso\/9780198262350.003.0039","raw":"Gardner, J. P., ed. 1997. Human Rights as General Norms and a State’s Right to Opt Out—Reservations and Objections to Human Rights Conventions. London: British Institute of International and Comparative Law.","cites":null},{"id":17300955,"title":"Human Rights in a Globalizing World: The Paradox of Empty Promises.","authors":[],"date":"2005","doi":"10.1086\/428442","raw":"Hafner-Burton, Emilie M., and Kiyoteru Tsutsui. 2005. Human Rights in a Globalizing World: The Paradox of Empty Promises. American Journal of Sociology 111:1373–1411.RESERVATIONS TO HUMAN RIGHTS TREATIES \/ 427 Hathaway, Oona. 2002. The Cost of Commitment. Stanford Law Review 55: 1821–22.","cites":null},{"id":17300953,"title":"Human Rights Treaties, Invalid Reservations, and State Consent.","authors":[],"date":"2002","doi":"10.2307\/3062161","raw":"Goodman, Ryan. 2002. Human Rights Treaties, Invalid Reservations, and State Consent. American Journal of International Law 96:531–60.","cites":null},{"id":17300950,"title":"Human Rights, Democracy and Development. Human Rights Quarterly 21:608–32.","authors":[],"date":"1999","doi":"10.1353\/hrq.1999.0039","raw":"———. 1999. Human Rights, Democracy and Development. Human Rights Quarterly 21:608–32.","cites":null},{"id":17300988,"title":"Intergovernmental Organizations, 1815–2000: A New Correlates of War Data Set (computer ﬁle).","authors":[],"date":"2004","doi":"10.1080\/07388940490463933","raw":"Pevehouse, John, Timothy Nordstrom, and Kevin Warnke. 2004. Intergovernmental Organizations, 1815–2000: A New Correlates of War Data Set (computer ﬁle). http:\/\/cow2.la.psu.edu\/COW2%20Data\/IGOs\/IGOv2-1.htm.","cites":null},{"id":17300990,"title":"International Human Rights Law.","authors":[],"date":"2003","doi":"10.1163\/ej.9789004158269.i-576","raw":"Rehman, Javaid. 2003. International Human Rights Law. Harlow: Pearson Education.","cites":null},{"id":17300949,"title":"International Human Rights.","authors":[],"date":"2002","doi":"10.4135\/9781848608290.n27","raw":"Schmitz, Hans Peter, and Kathryn Sikkink. 2002. International Human Rights. Pp. 517–537 in Handbook of International Relations, edited by Walter Carlsnaes, Thomas Risse, and Beth A. Simmons. London: Sage Publications.","cites":null},{"id":17300963,"title":"Introduction. Pp. xv–xxix in Human Rights as General Norms and a State’s Right to Opt Out—Reservations and Objections to Human Rights Conventions,","authors":[],"date":"1997","doi":"10.1093\/acprof:oso\/9780198262350.003.0039","raw":"Higgins, Rosalyn. 1997. Introduction. Pp. xv–xxix in Human Rights as General Norms and a State’s Right to Opt Out—Reservations and Objections to Human Rights Conventions, edited by J. P. Gardner. London: British Institute of International and Comparative Law.","cites":null},{"id":17300967,"title":"New Challenges to the Regime of Reservations under the International Covenant on Civil and Political Rights.","authors":[],"date":"2002","doi":"10.1093\/ejil\/13.2.437","raw":"Korkelia, Konstantin. 2002. New Challenges to the Regime of Reservations under the International Covenant on Civil and Political Rights. European Journal of International Law 13:437–77.","cites":null},{"id":17300979,"title":"Reservations and the Capacity to Implement Human428","authors":[],"date":"1997","doi":null,"raw":"McBride, Jeremy. 1997. Reservations and the Capacity to Implement Human428 \/ THE JOURNAL OF LEGAL STUDIES \/ VOLUME 36 (2) \/ JUNE 2007 Rights Treaties. Pp. 120–184 in Human Rights as General Norms and a State’s Right to Opt Out—Reservations and Objections to Human Rights Conventions, edited by J. P. Gardner. London: British Institute of International and Comparative Law.","cites":null},{"id":17300982,"title":"Reservations of Virtue? Lessons from Trinidad and Tobago’s Reservation to the First Optional Protocol. Human Rights Quarterly 23:769–826.","authors":[],"date":"2001","doi":"10.1353\/hrq.2001.0038","raw":"McGrory, Glenn. 2001. Reservations of Virtue? Lessons from Trinidad and Tobago’s Reservation to the First Optional Protocol. Human Rights Quarterly 23:769–826.","cites":null},{"id":17301017,"title":"Reservations to Human Rights Treaties and the Vienna Convention Regime: Conﬂict, Harmony or Reconciliation?","authors":[],"date":"2004","doi":"10.1007\/978-94-017-6019-5","raw":"Ziemele, Ineta, ed. 2004. Reservations to Human Rights Treaties and the Vienna Convention Regime: Conﬂict, Harmony or Reconciliation? Leiden: Martinus Nijhoff Publishers.","cites":null},{"id":17300993,"title":"Reservations to Human Rights Treaties: Time for Innovation and Reform.","authors":[],"date":"1994","doi":null,"raw":"Schabas, William A. 1994. Reservations to Human Rights Treaties: Time for Innovation and Reform. Canadian Yearbook of International Law 32:39–81.","cites":null},{"id":17300941,"title":"Reservations to Multilateral Treaties on Human Rights.","authors":[],"date":"1985","doi":null,"raw":"Coccia, Massimo. 1985. Reservations to Multilateral Treaties on Human Rights. California Western International Law Journal 15:1–51.","cites":null},{"id":17301013,"title":"Reservations to the Convention on the Elimination of All Forms of Discrimination against Women: An Unresolved Issue or (No) New Developments?","authors":[],"date":"2004","doi":"10.1007\/978-94-017-6019-5_1","raw":"Scho ¨pp-Schilling, Hanna Beate. 2004. Reservations to the Convention on the Elimination of All Forms of Discrimination against Women: An Unresolved Issue or (No) New Developments? Pp. 3–39 in Reservations to Human RightsRESERVATIONS TO HUMAN RIGHTS TREATIES \/ 429 Treaties and the Vienna Convention Regime: Conﬂict, Harmony or Reconciliation? edited by Ineta Ziemele. Leiden: Martinus Nijhoff Publishers.","cites":null},{"id":17300943,"title":"Reservations to the Convention on the Elimination of All Forms of Discrimination against Women. Virginia","authors":[],"date":"1989","doi":"10.1007\/978-94-017-6019-5_1","raw":"Cook, Rebecca J. 1989. Reservations to the Convention on the Elimination of All Forms of Discrimination against Women. Virginia Journal of International Law 30:643–716.","cites":null},{"id":17300977,"title":"Reservations to the Convention on the Rights of the Child: A Macroscopic View of State Practice.","authors":[],"date":"1996","doi":"10.1163\/157181896x00031","raw":"Leblanc, Lawrence J. 1996. Reservations to the Convention on the Rights of the Child: A Macroscopic View of State Practice. International Journal of Children’s Rights 4:357–81.","cites":null},{"id":17300994,"title":"Reservations to the Convention on the Rights of the Child.Human Rights Quarterly 18:472–91.","authors":[],"date":"1996","doi":"10.1353\/hrq.1996.0023","raw":"———. 1996. Reservations to the Convention on the Rights of the Child.Human Rights Quarterly 18:472–91.","cites":null},{"id":17300989,"title":"Reservations to Treaties and Human Rights","authors":[],"date":"1997","doi":"10.1017\/s0020589300060486","raw":"Redgewell, Catherine J. 1997. Reservations to Treaties and Human Rights Committee General Comment No. 24(52). International and Comparative Law Quarterly 46:390–412.","cites":null},{"id":17300978,"title":"Reservations to UN-Human Rights Treaties—Ratify and Ruin? Dordrecht: Martinus Nijhoff Publishers.","authors":[],"date":"1995","doi":"10.2307\/2624783","raw":"Lijnzaad, Liesbeth. 1995. Reservations to UN-Human Rights Treaties—Ratify and Ruin? Dordrecht: Martinus Nijhoff Publishers.","cites":null},{"id":17300957,"title":"Sample Selection Bias as a Speciﬁcation Error. Econometrica 47:153–61.","authors":[],"date":"1979","doi":"10.2307\/1912352","raw":"Heckman, James. 1979. Sample Selection Bias as a Speciﬁcation Error. Econometrica 47:153–61.","cites":null},{"id":17300932,"title":"Should Invalid Reservations to Human Rights Treaties Be Disregarded?","authors":[],"date":"2000","doi":"10.1093\/ejil\/11.2.413","raw":"Baratta, Roberto. 2000. Should Invalid Reservations to Human Rights Treaties Be Disregarded? European Journal of International Law 11:413–25.","cites":null},{"id":17300942,"title":"Sovereignty Relinquished? Explaining Commitment to the International Human Rights Covenants, 1966–1999. American Sociological Review 70:472–95.","authors":[],"date":"2005","doi":"10.1177\/000312240507000306","raw":"Cole, Wade M. 2005. Sovereignty Relinquished? Explaining Commitment to the International Human Rights Covenants, 1966–1999. American Sociological Review 70:472–95.","cites":null},{"id":17300968,"title":"Sovereignty, Regimes, and Human Rights. Pp. 139–167 in Regime Theory and International Relations, edited by Volker Rittberger.","authors":[],"date":"1993","doi":null,"raw":"Krasner, Stephen D. 1993. Sovereignty, Regimes, and Human Rights. Pp. 139–167 in Regime Theory and International Relations, edited by Volker Rittberger. Oxford: Clarendon Press.","cites":null},{"id":17301015,"title":"The Conﬂict of Law and Policy on Reservations to Human Rights Treaties.","authors":[],"date":"2000","doi":"10.1093\/bybil\/71.1.181","raw":"Tyagi, Yogesh. 2000. The Conﬂict of Law and Policy on Reservations to Human Rights Treaties. British Yearbook of International Law 71:181–258.","cites":null},{"id":17300969,"title":"The Evolution of the International Human Rights Regime: Political and Economic Determinants. Working paper.","authors":[],"date":"2002","doi":null,"raw":"Landman, Todd. 2002. The Evolution of the International Human Rights Regime: Political and Economic Determinants. Working paper. University of Essex, Department of Government.","cites":null},{"id":17300961,"title":"The Institutional Environment for Economic Growth. Economics and Politics 12:1–31.","authors":[],"date":"2000","doi":"10.1111\/1468-0343.00066","raw":"Henisz, W. J. 2000. The Institutional Environment for Economic Growth. Economics and Politics 12:1–31.","cites":null},{"id":17300985,"title":"The Origins of Human Rights Regimes: Democratic Delegation","authors":[],"date":"2000","doi":"10.1162\/002081800551163","raw":"Moravcsik, Andrew. 2000. The Origins of Human Rights Regimes: Democratic Delegation in Postwar Europe. International Organization 54:217–52.","cites":null},{"id":17300991,"title":"The Power of Human Rights—International Norms and Domestic Change. Cambridge:","authors":[],"date":"1999","doi":"10.1017\/cbo9780511598777","raw":"Risse, Thomas, Stephen C. Ropp, and Kathryn Sikkink. 1999. The Power of Human Rights—International Norms and Domestic Change. Cambridge: Cambridge University Press.","cites":null},{"id":17300976,"title":"The Quality of Government.","authors":[],"date":"1999","doi":"10.3386\/w18268","raw":"La Porta, Rafael, Florencio Lopez-de-Silanes, Andrei Shleifer, and RobertVishny. 1999. The Quality of Government. Journal of Law, Economics and Organization 15:222–79.","cites":null},{"id":17300934,"title":"The UN Human Rights Treaty System—Universality at the Crossroads. The Hague:","authors":[],"date":"2001","doi":null,"raw":"Bayefsky, Anne F. 2001. The UN Human Rights Treaty System—Universality at the Crossroads. The Hague: Kluwer Law International.","cites":null},{"id":17300940,"title":"The Vienna Convention Reservations Regime and the Convention on Discrimination against Women.","authors":[],"date":"1991","doi":"10.2307\/2203063","raw":"Clark, Belinda. 1991. The Vienna Convention Reservations Regime and the Convention on Discrimination against Women. American Journal of International Law 85:281–321.","cites":null},{"id":17300987,"title":"the Vienna Convention. Working paper.George","authors":[],"date":"2002","doi":null,"raw":"Parisi, Francesco, and Catherine S ˇevc ˇenko. 2002. Treaty Reservations and the Economics of Article 21(1) of the Vienna Convention. Working paper.George Mason University, School of Law.","cites":null},{"id":17300938,"title":"Treaties, Human Rights, and Conditional Consent. Pennsylvania Law Review 149:339–468.","authors":[],"date":"2000","doi":"10.2307\/3312731","raw":"Bradley, Curtis A., and Jack L. Goldsmith. 2000. Treaties, Human Rights, and Conditional Consent. Pennsylvania Law Review 149:339–468.","cites":null},{"id":17301016,"title":"Treaty Series: Treaties and International Agreements Registered or Filed and Recorded with the Secretariat of the United Nations.","authors":[],"date":"1947","doi":"10.2307\/2199815","raw":"United Nations. 1947–2005. Treaty Series: Treaties and International Agreements Registered or Filed and Recorded with the Secretariat of the United Nations. New York: United Nations.","cites":null},{"id":17300962,"title":"U.S. Ratiﬁcation of Human Rights Conventions:TheGhost of Senator Bricker.","authors":[],"date":"1995","doi":"10.2307\/2204206","raw":"Henkin, Louis. 1995. U.S. Ratiﬁcation of Human Rights Conventions:TheGhost of Senator Bricker. American Journal of International Law 89:341–50.","cites":null},{"id":17301014,"title":"Why Commit? Explaining State Acceptance of International Human Rights Obligations. Working paper.","authors":[],"date":"2000","doi":null,"raw":"Simmons, Beth. 2000. Why Commit? Explaining State Acceptance of International Human Rights Obligations. Working paper. University of California at Berkeley, Political Science Department.","cites":null},{"id":17300965,"title":"Why Do Nations Obey International Law? Review Essay.","authors":[],"date":"1996","doi":"10.2307\/797228","raw":"Koh, Harold Hongju. 1996. Why Do Nations Obey International Law? Review Essay. Yale Law Journal 106:2599–2659.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/93264.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/3051\/1\/Qualified_ratification_%28LSERO%29.pdf","pdfHashValue":"cb009ca12c6b7a78365ec4c9b88f148ba8f418b4","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:3051<\/identifier><datestamp>\n      2010-10-01T08:48:54Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/3051\/<\/dc:relation><dc:title>\n        Qualified ratification: explaining reservations to international human rights treaties<\/dc:title><dc:creator>\n        Neumayer, Eric<\/dc:creator><dc:subject>\n        K Law (General)<\/dc:subject><dc:date>\n        2007<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/3051\/1\/Qualified_ratification_%28LSERO%29.pdf<\/dc:identifier><dc:identifier>\n          Neumayer, Eric  (2007) Qualified ratification: explaining reservations to international human rights treaties.  Journal of Legal Studies, 36 (2).  pp. 397-430.  ISSN 0047-2530     <\/dc:identifier><dc:relation>\n        http:\/\/www.journals.uchicago.edu\/loi\/jls<\/dc:relation><dc:relation>\n        10.1086\/511894<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/3051\/","http:\/\/www.journals.uchicago.edu\/loi\/jls","10.1086\/511894"],"year":2007,"topics":["K Law (General)"],"subject":["Article","PeerReviewed"],"fullText":""}