{"doi":"10.1007\/978-1-4020-4423-6_229","coreId":"62197","oai":"oai:nora.nerc.ac.uk:4990","identifiers":["oai:nora.nerc.ac.uk:4990","10.1007\/978-1-4020-4423-6_229"],"title":"Observatories : programme in the British Isles","authors":["Kerridge, David"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":["Gubbins, David","Herreo-Bervera, Emilio"],"datePublished":"2007","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/62197.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/4990\/1\/DK_BI_Obs.pdf","pdfHashValue":"736e5d2be87b92e241a5f1e0c2fff851897a44b9","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:4990<\/identifier><datestamp>\n      2012-11-22T11:53:19Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/4990\/<\/dc:relation><dc:title>\n        Observatories : programme in the British Isles<\/dc:title><dc:creator>\n        Kerridge, David<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:publisher>\n        Springer<\/dc:publisher><dc:contributor>\n        Gubbins, David<\/dc:contributor><dc:contributor>\n        Herreo-Bervera, Emilio<\/dc:contributor><dc:date>\n        2007<\/dc:date><dc:type>\n        Publication - Book Section<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/4990\/1\/DK_BI_Obs.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Kerridge, David.  2007  Observatories : programme in the British Isles.    In: Gubbins, David; Herreo-Bervera, Emilio, (eds.) Encylopedia of geomagnetism and paleomagnetism.  Dordrecht, Netherlands, Springer, 720-721, 1054pp.  (Encyclopedia of earth sciences).      \n <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/<\/dc:relation><dc:relation>\n        10.1007\/978-1-4020-4423-6_229<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/4990\/","http:\/\/www.springerlink.com\/","10.1007\/978-1-4020-4423-6_229"],"year":2007,"topics":["Earth Sciences"],"subject":["Publication - Book Section","PeerReviewed"],"fullText":"Comp. by: ASaid Maraikayar Date:23\/10\/06 Time:20:41:44 Stage:First Proof File Path:\/\/spiina1001z\/womat\/\nproduction\/PRODENV\/0000000005\/0000001725\/0000000005\/0000096477.3D Proof by: QC by:\nO\nOBSERVATORIES, PROGRAM IN THE\nBRITISH ISLES\nHistory\nIn his survey of magnetic observatories that have operated in the British\nIsles, Robinson (1982) lists 18 locations, including 11 in England, 4 in\nScotland, 2 in the Republic of Ireland, and 1 on the island of Jersey. The\nearliest two observatories were both constructed in 1838: in the grounds\nof Trinity College, Dublin; and in Greenwich Park, London, where an\nastronomical observatory had been established following a warrant\nissued by King Charles II in 1675. The earliest known measurement\nof magnetic declination at Greenwich is that made by John Flamsteed\nin 1680, and declination measurements were made there regularly from\n1816, to assist in the calibration of ships’ compasses. The initial pro-\ngram of observations at Dublin and Greenwich consisted of two-hourly\nmeasurements. Both observatories, along with that at Makerstoun in\nScotland, participated in the Göttingen Magnetic Union (1836–1841),\nwhich promoted simultaneous measurements at cooperating observa-\ntories, and certain days were designated “term days\" when observations\nwere made every 5 min. A British artillery officer, Edward Sabine, was\na chief protagonist of the efforts by the Göttingen Magnetic Union to\nestablish a global network of observatories, and through this, several\nobservatories were set up by the British in its colonies at the time (see\nGauss, Carl Friedrich; Humbolt, Alexander von; Sabine, Edward; and\nGeomagnetism, history of ).\nThe laborious nature of meteorological and magnetic observations\nstimulated a drive to develop automatic recording devices, and Charles\nBrooke designed the photographic magnetographs that were brought\ninto operation in Greenwich in 1847 (Brooke, 1847). Francis Ronalds,\nworking at KewObservatory, which had been built at Richmond, London,\nfor King George III to observe the transit of Venus in 1769, also produced\na photographic magnetograph at around the same time as Brooke's.\nRonalds’ instrument was later redesigned by John Welsh to produce the\nKew-pattern magnetograph that was subsequently installed in many\nobservatories around the world (Stewart, 1859). The instrumental devel-\nopments by Brooke and Ronalds established the standard technique\nemployed for magnetic observatory recording worldwide for more than\na century (see Instrumentation, history of ).\nObservations at Dublin Observatory were short-lived, continuing only\nuntil 1850. A meteorological observatory was established on Valentia\nIsland, Kerry, in 1867 and regular absolute magnetic observations com-\nmenced there in 1888. The observatory was moved to the mainland, close\nto the town of Cahirciveen, in 1892, but kept the name Valentia Observa-\ntory. Continuous recording instruments were first installed in 1953. Met\nÉireann, the Irish meteorological service, now runs the observatory.\nGeomagnetic measurements in London were to become impossible\nbecause of electrification of the railway and tramway systems. Kew\nObservatory suffered disturbances from about 1900 and with compen-\nsation from the tramway company responsible, Eskdalemuir Observa-\ntory, in the Southern Uplands of Scotland, was built. Eskdalemuir was\nselected as one of very few places in Great Britain that was more than\n10 miles from the then extensive rail network. Construction work at\nEskdalemuir started in 1904 and a full program of magnetic observations\nbegan in 1908. Later, the geomagnetic work carried out at Greenwich was\nsimilarly affected and was transferred to Abinger Observatory, on Leith\nHill, London, in 1924. Observations were made there until April 1957\nwhen, once more, disturbances from electrified railways reached intoler-\nable levels. A transfer of operations was planned and a magnetic observa-\ntory was constructed close to the village of Hartland, Devon. Hartland\nObservatory opened in 1957, in time for the observatory to participate in\nthe International Geophysical Year (IGY). Overlapping measurements\nwere made at the times of the Greenwich–Abinger and the Abinger–\nHartland moves, establishing site differences and enabling the records\nfrom the three observatories to be combined.\nLerwick Observatory in the Shetland Isles was established as a\nmeteorological station in 1919 and geomagnetic measurements began\nthere in 1922. Lerwick, Eskdalemuir, and Hartland are the three mag-\nnetic observatories in operation in the UK in 2005. They are run by the\nBritish Geological Survey (BGS), a component body of the Natural\nEnvironment Research Council. Lerwick and Eskdalemuir continue\nto have roles as meteorological stations, and seismological equipment\nis operated at all the observatories.\nObservatory operations in 2005\nThe main objective of a magnetic observatory is to record geomagnetic\nfield variations continuously, over the long term, at a stable location,\nand to maintain the accuracy required to produce data of the quality\nneeded for studies of the slow changes of the main geomagnetic field\ngenerated in the Earth's core, the secular variation. The combination of\nmagnetographs, based on suspended magnet instruments and photo-\ngraphic recording, supported by regular absolute observations, enabled\nthe UK observatories to achieve this objective over many decades.\nHowever, the observatory operations were labor-intensive, both in run-\nning the magnetographs and in processing the analog photographic\nrecordings. By the 1970s, technical developments in fluxgate and pro-\nton precession magnetometers gave an alternative set of observatory\ninstruments, and advances in digital data acquisition and computing\npresented new opportunities for observatory automation. The BGS\nbegan a development program, and automatic digital systems were\nadopted as the observatory standard recording equipment at the three\nUK observatories on January 1, 1983 (see Geomagnetic secular varia-\ntion; Observatories, instrumentation).\nSince 1983, technology has continued to develop, bringing significant\nimprovements to magnetometer performance and data acquisition and\ncommunications. The latest generation systems used at the UK observa-\ntories were commissioned on January 1, 2003, again based on the com-\nbination of fluxgate and proton precession magnetometers. The fluxgate\nmagnetometer output is sampled once per second and the data are trans-\nmitted to the BGS offices in Edinburgh within minutes. A fluxgate–\ntheodolite combination is used to make regular (manual) absolute\nmeasurements of magnetic declination and inclination, with the proton\nmagnetometer providing absolute values of total field strength.\nComp. by: ASaid Maraikayar Date:23\/10\/06 Time:20:41:44 Stage:First Proof File Path:\/\/spiina1001z\/womat\/\nproduction\/PRODENV\/0000000005\/0000001725\/0000000005\/0000096477.3D Proof by: QC by:\nInstruments similar to those at the UK observatories are used at\nValentia Observatory. Efforts to improve the global coverage of obser-\nvatories continue and to this end observatories were set up by the BGS\non Ascension Island and at Port Stanley in the Falklands Islands in\n1992 and 1994, respectively.\nUses of the observatory data\nIn 2005, the combination of data from magnetic survey satellites, such\nas Ørsted and CHAMP, and observatories worldwide, is providing a\nrich resource for research into core processes. The data also bring prac-\ntical benefits through their use in the production of global and national\nmagnetic field models and charts used for navigation. Here, observa-\ntory data are of great importance because of the information they give\non the secular variation, providing the basis for estimation of future\nvalues of the geomagnetic field at a given location (see Ørsted;\nCHAMP; Main field maps; Main field modeling; and IGRF, Interna-\ntional Geomagnetic Reference Field).\nObservatories also provide data on the relatively rapidly varying\nmagnetic fields of ionospheric and magnetospheric origin. These “dis-\nturbance fields,\" indicative of “space weather\" conditions, are charac-\nterized by various geomagnetic activity indices (Mayaud, 1980). Each\nof the UK observatories has provided data for the computation of the\nKp-index since its creation in 1932. Data from the Greenwich–Abinger–\nHartland series, together with data from Australian observatories, have\nbeen used to construct the aa-index, which extends from 1868, providing\nvaluable information on long-term changes in solar–terrestrial interac-\ntions. (Both the Kp- and the aa-indices are computed for 3-h intervals.)\nWhen space weather conditions are such that a major geomagnetic distur-\nbance, a magnetic storm, is in progress, operations in space and on the\nground can be at risk. Global geomagnetic activity indices, such as Kp,\nare usedwidely asmeasures of disturbance. Satellite management, assess-\nment of propagation conditions for radio and GPS signals, and geophysi-\ncal surveying are examples of applications where indices are used (see\nStorms and substorms, magnetic and Geomagnetic hazards).\nBy collecting 1-s samples, the UK observatories are producing data\nuseful for research into external magnetic fields. Data at this time reso-\nlution are required for, and are applied to, modeling geomagnetically\ninduced currents, which is of interest to the electricity distribution indus-\ntry. A further modern-day application, important to hydrocarbons pro-\nduction around the UK, is the use of accurate magnetic reference data\nto correct wellbore survey measurements acquired using magnetic sur-\nvey tools. Data from the UK magnetic observatories are used in the ana-\nlysis of data collected in measurement-while-drilling operations, and this\napplication demands the rapid access to the data that the UK observa-\ntory operations provide. This application has resulted in observatories\nbeing set up on Sable Island, offshore Nova Scotia, and at Prudhoe\nBay in northern Alaska by Halliburton with the assistance of the BGS.\nOutlook\nLerwick, Eskdalemuir, Hartland, Valentia, Ascension, and Port Stanley\nare all INTERMAGNET observatories and hence are members of a\ncoordinated global monitoring network operating to high modern stan-\ndards (see Observatories, INTERMAGNET). This echoes the participa-\ntion of observatories in the British Isles and Empire in the Göttingen\nMagnetic Union. These observatories are providing data for scientific\nresearch, for global data products, and are also finding local applica-\ntions for the data they produce. The scientific and “real world\"\ndemands for the data are as strong today as at any time in the past.\nDavid Kerridge\nBibliography\nBrooke, C., 1847. Description of apparatus for automatic registration\nof magnetometers and other meteorological instruments by photo-\ngraphy. Philosophical Transactions of the Royal Society of London,\n137: 69–77.\nMayaud, P.N., 1980. Derivation, Meaning and Use of Geomagnetic\nIndices. American Geophysical Union, Geophysical Monograph 22.\nWashington, DC:American Geophysical Union.\nRobinson, P.R., 1982. Geomagnetic observatories in the British Isles.\nVistas in Astronomy, 26: 347–367.\nStewart, B., 1859. An account of the construction of the self-recording\nmagnetographs at present in operation at the Kew Observatory.\nBritish Association Report 1859, pp. 200–228.\nCross-references\nCHAMP\nGauss, Carl Friedrich (1777–1855)\nGeomagnetic Hazards\nGeomagnetic Secular Variation\nGeomagnetism, History of\nHumbolt, Alexander von (1759–1859)\nIGRF, International Geomagnetic Reference Field\nInstrumentation, History of\nMagnetometers, Laboratory\nMain Field Maps\nMain Field Modeling\nObservatories, Instrumentation\nObservatories, INTERMAGNET\nØrsted\nSabine, Edward (1788–1883)\nStorms and Substorms, Magnetic\n2 OBSERVATORIES, PROGRAM IN THE BRITISH ISLES\n"}