{"doi":"10.1039\/B106357J","coreId":"194674","oai":"oai:lra.le.ac.uk:2381\/586","identifiers":["oai:lra.le.ac.uk:2381\/586","10.1039\/B106357J"],"title":"Preparation of novel, moisture-stable, Lewis acidic ionic liquids containing quaternary ammonium salts with functional side chains","authors":["Abbott, Andrew P.","Capper, Glen","Davies, David L.","Munro, Helen L.","Rasheed, Raymond K.","Tambyrajah, Vasuki"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-09-19","abstract":"A range of novel, moisture-stable, Lewis-acidic ionic liquids has been prepared by mixing appropriate molar ratios of MCl[subscript 2] (M = Zn and\/or Sn) and quaternary ammonium salts of formula [Me[subscript 3]NC[subscript 2]H[subscript 4]Y]Cl (Y = OH, Cl, OC(O)Me, OC(O)Ph); the influence of substituent Y and metal M on the physical properties of the melts has been investigated.Peer-reviewedPublisher Versio","downloadUrl":"http:\/\/hdl.handle.net\/2381\/586","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/586\/1\/10.1039_b106357j.pdf","pdfHashValue":"81e217c0c1de9fc0180ccd5a435f4d15cdcc964d","publisher":"The Royal Society of Chemistry","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/586<\/identifier><datestamp>\n                2013-11-14T02:01:21Z<\/datestamp><setSpec>\n                com_2381_118<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_119<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nPreparation of novel, moisture-stable, Lewis acidic ionic liquids containing quaternary ammonium salts with functional side chains<\/dc:title><dc:creator>\nAbbott, Andrew P.<\/dc:creator><dc:creator>\nCapper, Glen<\/dc:creator><dc:creator>\nDavies, David L.<\/dc:creator><dc:creator>\nMunro, Helen L.<\/dc:creator><dc:creator>\nRasheed, Raymond K.<\/dc:creator><dc:creator>\nTambyrajah, Vasuki<\/dc:creator><dc:description>\nA range of novel, moisture-stable, Lewis-acidic ionic liquids has been prepared by mixing appropriate molar ratios of MCl[subscript 2] (M = Zn and\/or Sn) and quaternary ammonium salts of formula [Me[subscript 3]NC[subscript 2]H[subscript 4]Y]Cl (Y = OH, Cl, OC(O)Me, OC(O)Ph); the influence of substituent Y and metal M on the physical properties of the melts has been investigated.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPublisher Version<\/dc:description><dc:date>\n2009-12-08T16:23:17Z<\/dc:date><dc:date>\n2009-12-08T16:23:17Z<\/dc:date><dc:date>\n2001-09-19<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nChemical Communications, 2001, 19 (1), pp.2010-2011<\/dc:identifier><dc:identifier>\n1359-7345<\/dc:identifier><dc:identifier>\nhttp:\/\/pubs.rsc.org\/en\/Content\/ArticleLanding\/2001\/CC\/b106357j#!divAbstract<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/586<\/dc:identifier><dc:identifier>\n10.1039\/B106357J<\/dc:identifier><dc:identifier>\n1364-548X<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:rights>\nCopyright © 2001, The Royal Society of Chemistry. Deposited with reference to the publisher’s archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nThe Royal Society of Chemistry<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["1359-7345","1364-548x","issn:1364-548X","issn:1359-7345"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007"],"year":2001,"topics":[],"subject":["Article"],"fullText":"C\nom\nm\nunication\nw\nw\nw\n.rsc.org\/chem\ncom\nm\nC\nH\nEM\nCO\nM\nM\nPreparation of novel, moisture-stable, Lewis-acidic ionic liquids\ncontaining quaternary ammonium salts with functional side chains†\nAndrew P. Abbott, Glen Capper, David L. Davies,* Helen L. Munro, Raymond K. Rasheed and\nVasuki Tambyrajah\nDepartment of Chemistry, University of Leicester, Leicester, UK LE1 7RH. E-mail: dld3@le.ac.uk\nReceived (in Cambridge, UK) 17th July 2001, Accepted 29th August 2001\nFirst published as an Advance Article on the web 19th September 2001\nA range of novel, moisture-stable, Lewis-acidic ionic liquids\nhas been prepared by mixing appropriate molar ratios of\nMCl2 (M = Zn and\/or Sn) and quaternary ammonium salts\nof formula [Me3NC2H4Y]Cl (Y = OH, Cl, OC(O)Me,\nOC(O)Ph); the influence of substituent Y and metal M on the\nphysical properties of the melts has been investigated.\nIonic liquids, or room temperature molten salts, have attracted\nincreasing interest over recent years, particularly in the area of\ngreen chemistry, due to their advantageous properties including\nnegligible vapour pressure and wide liquid range.1–3 Work has\nfocussed on liquids formed from dialkylimidazolium halides\nwhich are readily prepared from 1-methylimidazole and a slight\nexcess of the desired haloalkane.4 Addition of a suitable molar\nratio of aluminium chloride to these salts gives rise to ionic\nliquids containing complex metal anions which have been used\nin a number of applications such as electroplating, electro-\nchemical devices and catalysts for organic synthesis.1,4–6 The\nmain disadvantage of imidazolium-based liquids is their\nrelatively high cost for bulk applications, whilst chloroalumi-\nnate ionic liquids have the additional problem of their low\ntolerance to moisture, necessitating the use of glove box and\nSchlenk techniques to prepare and investigate their properties.\nThe former problem may be overcome by using cheaper\nammonium salts whereas the latter may be solved by replacing\naluminium with less reactive metals.\nRecently, Freeman and coworkers have characterised ionic\nliquids formed from FeCl2 or FeCl3 and 1-butyl-3-methylimida-\nzolium chloride.7 However, other examples of ionic liquids\nmade from metal chlorides other than aluminium are less well\ncharacterised and are mainly cited in conference proceedings8\nor in the patent literature.9,10 Here we report the synthesis and\ncharacterisation of new moisture-stable, Lewis-acidic ionic\nliquids made from metal chlorides and quaternary ammonium\nsalts that are commercially available or simple to synthesise.\nThese offer the potential to tailor the physical properties e.g.\nmelting point, viscosity and conductivity, and to tune the Lewis\nacidity by choosing a different metal or indeed combinations of\nmetals.\nTo investigate the parameters necessary for a salt to be liquid\nat or near room temperature we have heated a range of\nammonium salts with zinc chloride in a 1+2 molar ratio and the\nresults are shown in Table 1.‡ Using salts of symmetrical\ncations, H4NCl and Me4NCl, no liquid is formed below 200 °C\nwhereas with the longer chain NEt4Cl the freezing point was ca.\n90 °C. It has been established in the imidazolium systems that\nreducing the symmetry of the cation leads to a lower freezing\npoint for the ionic liquid, thus, we have examined cations of the\ngeneral formula Me3NR+. Using Me3NEt+ gives a freezing\nrange of 53–55 °C, i.e. a reduction of ca. 35 or 140 °C compared\nwith Et4N+ and Me4N+ respectively. However, we have found\nthat functionalised ethyl chains, Me3NC2H4Y+, give even lower\nfreezing points; e.g. if Y = OH or Cl, room temperature liquids\nare observed with freezing points of 23–25 °C. Even when the\nsubstituent is significantly larger, e.g. Y = OC(O)Me or\nOC(O)Ph, the salts formed have lower freezing points than for\nMe3NEt+. These results suggest that both lower symmetry and\nthe presence of a functional group reduce the freezing points of\nthe salts formed, though the exact role of the functional\nsubstituent is not yet clear. In all cases the liquids formed are\nviscous and hygroscopic but moisture-stable so can be easily\nprepared and stored without the need for specialist equip-\nment.\nSince choline chloride, [Me3NC2H4OH]Cl, gave the lowest\nfreezing point we have characterised this system in more detail.\nHeating mixtures of choline chloride and zinc chloride in molar\nratios between 1+1 and 1+3 gave rise to clear colourless liquids,\nwith the freezing points varying between ca. 65 °C (1+1), 25 °C\n(1+2) and 45 °C (1+3). Unlike analogous aluminium sys-\ntems,4,11,12 ratios with a molar excess of choline chloride, i.e.\nbasic melts, do not form ambient temperature liquids in these\nsystems. This would imply that complex zinc anions, in which\nthe charge can be delocalised, are necessary in the formation of\nthese ionic liquids. Further characterisation of the 1:2 liquid is\ndescribed below.\nA 1H NMR spectrum of the neat ionic liquid was recorded\nand shows resonances at d 2.97, 3.34 and 3.94 assigned to the\nmethyl groups, N–CH2 protons, and the CH2OH protons,\nrespectively, of the choline cation. All signals were broad and\npoorly resolved, even at 80 °C, due to the viscosity of the melt.\nThe FAB mass spectrum shows the presence of complex zinc\nchloride ions [ZnCl3]2, [Zn2Cl5]2 and [Zn3Cl7]2. Higher\nclusters are also detectable but occurred at very low intensities.\nSimilar species have been observed in aluminium chloride-\nbased ionic liquids.13\nThe ionic liquid has a conductivity of 36 mS cm21 at 40 °C\nand this increases exponentially with temperature, due to a\ndecrease in the viscosity and hence an increase in the mobility\nof the ions in the melt.† The conductivity is similar to that found\nin alkylpyridinium-based ionic liquids14 and is sufficient for\nthem to be suitable media for electrochemical applications such\n† Electronic supplementary information (ESI) available: plot of con-\nductivity vs. temperature for the ionic liquid formed from zinc chloride and\ncholine chloride (2+1). See http:\/\/www.rsc.org\/suppdata\/cc\/b1\/b106357j\/\nTable 1 Freezing points for the materials formed from heating a quaternary\nammonium chloride and MCl2 (M = Zn, Sn) in a 1+2 molar ratio\nCation M Freezing point\/°C\n1 NH4 Zn > 200\n2 Me4N Zn > 200\n3 Et4N Zn 90–92\n4 Me3NEt Zn 53–55\n5 Me3NCH2CH2OH Zn 23–25\n6 Me3NCH2CH2Cl Zn 23–25\n7 Me3NCH2CH2OC(O)Me Zn 30–32\n8 Me3NCH2CH2OC(O)Ph Zn 46–48\n9 Me3NCH2CH2OH Sn 43–45\n10 Me3NCH2CH2Cl Sn 69–71\n11 Me3NCH2CH2OC(O)Me Sn 13–15\n12 Me3NCH2CH2OH Zn\/Sna 21–23\na The ratio [Me3NCH2CH2OH]Cl+ZnCl2+SnCl2 was 1+1+1.\nThis journal is © The Royal Society of Chemistry 2001\n2010 Chem. Commun., 2001, 2010–2011 DOI: 10.1039\/b106357j\nPu\nbl\nish\ned\n o\nn \n19\n S\nep\nte\nm\nbe\nr 2\n00\n1.\n D\now\nnl\noa\nde\nd \nby\n U\nni\nve\nrs\nity\n o\nf L\nei\nce\nste\nr o\nn \n12\n\/0\n8\/\n20\n13\n 1\n7:\n18\n:4\n5.\n \nView Article Online \/ Journal Homepage \/ Table of Contents for this issue\nas batteries and metal deposition. The liquids provide an\nelectrochemical window of about 2 V positive from the Zn\/Zn2+\ncouple. Further details of the conductivity and electrochemical\nproperties are reported elsewhere.15\nHaving established that the cationic component can be varied\nwe have also investigated changing the metal-containing, i.e.\nanionic, component. Heating choline chloride and SnCl2 in a\n1+2 molar ratio provides a viscous liquid which has a freezing\nrange of 43–45 °C. The negative ion FAB mass spectrum shows\nthe presence of [SnCl3]2 and [Sn2Cl5]2; however, no higher\nions are observed in this case. For the tin-containing melts the\nliquid formed from [YC2H4NMe3]Cl (Y = OC(O)Me) gave the\nlowest melting point. Heating choline chloride+ZnCl2+SnCl2 in\na 1+1+1 molar ratio gives a liquid with a freezing point of\n21–23 °C, i.e. similar to the pure zinc-containing melt but\nsignificantly lower than the pure tin-containing one. The FAB\nmass spectrum of this liquid shows the presence of the\nindividual metal-containing ions and the mixed metal ion\n[SnZnCl5]2. Mixed metal melts allow the possibility of tuning\nthe catalytic properties of the liquids, as well as opening up\npossibilities for electrodeposition of metal alloys.\nTo conclude, we have shown that heating functionalised\nquaternary ammonium halides [Me3NC2H4Y]Cl and MCl2 (M\n= Zn, Sn) gives materials that are conducting, viscous liquids at\nor around room temperature. The freezing points are dependent\nupon the symmetry of the cation and upon the nature of the\nfunctionalised side chain. The advantages of these new ionic\nliquids over presently available metal-containing ionic liquids\nare that they are insensitive to moisture and are much cheaper\nthan imidazolium-based liquids. In addition, their Lewis acidity\ncan be altered by varying the metal chloride(s) used. The use of\nthese liquids as catalysts for the Diels–Alder reaction of\nacroleins and dienes will be reported elsewhere.\nWe thank Scionix Ltd., a joint venture company between\nWhyte Chemicals and the University of Leicester, for financial\nsupport.\nNotes and references\n‡ The general route for the synthesis of the ionic liquids was as follows:\nquaternary ammonium salt (20 mmol) was mixed with zinc chloride (40\nmmol) and heated to ca. 150 °C in air with stirring until a clear colourless\nliquid was obtained. In contrast with the usual AlCl3-based ionic liquids the\nreaction appears to be endothermic.\nDrying the liquids under vacuum at 100 °C overnight has only a small\neffect on the freezing point, a few degrees, suggesting that immediately after\npreparation the liquids do not contain much water. The liquids are at least\nas thermally stable as AlCl3-based liquids, and can be heated to at least\n190 °C.\n1 T. Welton, Chem. Rev., 1999, 99, 2071.\n2 M. J. Earle and K. R. Seddon, Pure Appl. Chem., 2000, 72, 1391.\n3 P. Wassercheid and W. Keim, Angew. Chem., Int. Ed., 2000, 39,\n3789.\n4 J. S. Wilkes, J. A. Levisky, R. A. Wilson and C. L. Hussey, Inorg.\nChem., 1982, 21, 1263.\n5 A. A. Fannin, Jr., L. A. King, J. A. Levisky and J. S. Wilkes, J. Phys.\nChem., 1984, 88, 2609.\n6 T. M. Laher and C. L. Hussey, Inorg. Chem., 1983, 22, 1279.\n7 M. S. Sitze, E. R. Schreiter, E. V. Patterson and R. G. Freeman, Inorg.\nChem., 2001, 40, 2298.\n8 T. B. Scheffler and M. S. Thompson, Proc. Electrochem. Soc., 1990,\n90–17, (Proc. Int. Symp. Molten Salts, 7th, 1990), 281.\n9 N. Koura and N. Takami, Jpn. Pat., 1095469, 1989.\n10 F. G. Sherif, L.-J. Shyu, C. P. M. Lacroix and A. G. Auke, US Pat.,\n5731101, 1998.\n11 R. J. Gale, B. P. Gilbert and R. A. Osteryoung, Inorg. Chem., 1978, 17,\n2728.\n12 J. S. Wilkes, J. S. Frye and G. F. Reynolds, Inorg. Chem., 1983, 22,\n3870.\n13 S. P. Wicelinski, R. J. Gale, K. M. Pamidimukkala and R. A. Laine,\nAnal. Chem., 1988, 60, 2228.\n14 R. A. Carpio, L. A. King, R. E. Lindstrom, J. C. Nardi and C. L. Hussey,\nJ. Electrochem. Soc., 1979, 126, 1644.\n15 A. P. Abbott and D. L. Davies, Int. Pat., 2000, WO 0056700; A. P.\nAbbott, G. Capper, D. L. Davies, H. L. Munro, R. K. Rasheed and V.\nTambyrajah, in preparation.\nChem. Commun., 2001, 2010–2011 2011\nPu\nbl\nish\ned\n o\nn \n19\n S\nep\nte\nm\nbe\nr 2\n00\n1.\n D\now\nnl\noa\nde\nd \nby\n U\nni\nve\nrs\nity\n o\nf L\nei\nce\nste\nr o\nn \n12\n\/0\n8\/\n20\n13\n 1\n7:\n18\n:4\n5.\n \nView Article Online\n"}