{"doi":"10.2753\/IJS0020-7659380204","coreId":"195427","oai":"oai:lra.le.ac.uk:2381\/7507","identifiers":["oai:lra.le.ac.uk:2381\/7507","10.2753\/IJS0020-7659380204"],"title":"The Italian Antiracist Movement Between Advocacy, Service Delivery, and Political Protest","authors":["Ruzza, Carlo"],"enrichments":{"references":[{"id":44695081,"title":"National Identity in Europe Today: What the People Feel and Think.”","authors":[],"date":"2005","doi":"10.2753\/ijs0020-7659350404","raw":"Arts, W., and L. Halman. 2005. “National Identity in Europe Today: What the People Feel and Think.” International Journal of Sociology 35, no. 4: 69–93.","cites":null},{"id":44695082,"title":"Policy Networks and Immigrants’ Associations in Italy: The Cases of Milan,","authors":[],"date":"2005","doi":"10.1080\/13691830500177891","raw":"Caponio, T. (2005). “Policy Networks and Immigrants’ Associations in Italy: The Cases of Milan, Bologna and Naples.” Journal of Ethnic and Migration Studies 31: 931–50.","cites":null},{"id":44695083,"title":"Non Persone. L’esclusione dei migranti in una società globale <<translation of title?>>","authors":[],"date":"1999","doi":null,"raw":"Dal-Lago, A. 1999. Non Persone. L’esclusione dei migranti in una società globale <<translation of title?>> Milan: Feltrinelli.","cites":null},{"id":44695084,"title":"Breaking Old Taboos: Changing Political Opportunities and the Re-invention of the Italian right.”","authors":[],"date":"2006","doi":"10.1080\/14613190600787344","raw":"Fella, S., and C. Ruzza. 2006. “Breaking Old Taboos: Changing Political Opportunities and the Re-invention of the Italian right.” Journal of Southern Europe and the Balkans 8, no. 2. <<page nos. of article?>> Piven, F.F., and R. Cloward. 1978. Poor People’s Movements: Why They Succeed, How They Fail. New York: Vintage.","cites":null},{"id":44695085,"title":"The Northern League: Winning Arguments, Losing Influence.” Current Politics and","authors":[],"date":"2004","doi":null,"raw":"Ruzza, C. 2004. “The Northern League: Winning Arguments, Losing Influence.” Current Politics and Economics of Europe 13, no. 4: 309–34.","cites":null},{"id":44695086,"title":"Human Rights, Antiracism and EU Advocacy Coalitions.","authors":[],"date":"2006","doi":null,"raw":"———. 2006. “Human Rights, Antiracism and EU Advocacy Coalitions. In Sociology and Rights, ed. L. Morris, 111–28. London: Routledge.","cites":null},{"id":44695087,"title":"The Outsider: Prejudice and Politics in Italy.","authors":[],"date":"2000","doi":"10.2307\/3089496","raw":"Sniderman, P., P. Peri, et al. 2000. The Outsider: Prejudice and Politics in Italy.","cites":null},{"id":44695088,"title":"Contentious Politics.","authors":[],"date":"2007","doi":"10.1093\/oxfordhb\/9780199566020.003.0019","raw":"Tilly, C., and S. G. Tarrow. 2007. Contentious Politics. Boulder, CO: Paradigm.","cites":null},{"id":44695089,"title":"Postwar Migration in Southern Europe, 1950–2000 An Economic Analysis. Cambridge:","authors":[],"date":"2004","doi":"10.1017\/cbo9780511510793","raw":"Venturini, A. 2004. Postwar Migration in Southern Europe, 1950–2000 An Economic Analysis. Cambridge: Cambridge University Press.","cites":null},{"id":44695090,"title":"Le Associazioni di Cittadini Stranieri in Italia <<translation of title?>>. Venice: Fondazione Corazzin.","authors":[],"date":"2001","doi":null,"raw":"Vicentini, A., and T. Fava. 2001. Le Associazioni di Cittadini Stranieri in Italia <<translation of title?>>. Venice: Fondazione Corazzin.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":"The Italian antiracist movement is a composite political entity that has expressed the views, concerns, and political protests of various institutionalized and noninstitutionalized constituencies. In recent years, this movement has mainly taken a defensive stand because in the mind of many Italians \"race\" is associated with migration, which, in turn, is associated with crime, ethnic rivalry, and illegality. The movement has focused on affirming the primacy of human rights and individual responsibility in the face of a political system that has often yielded to negative stereotypes in order to exploit emerging political opportunities for the populist right. In addition, the movement has been active in particular policy fields where racial discrimination is more likely to occur, such as housing policy, education, sports, health policy, and practices in the job market.\\ud\n\\ud\nThis article reviews the role and impact of the main actors of the antiracist movement in terms of its structure and composition, its campaigns, and its activities. It argues that facing hostile public opinion, and interpreting the grievances of socially and politically weak groups of recently arrived migrants, it has learned to rely on the generalist associational resources of the leftist and Catholic conscience constituencies. It has formed a broad and articulated antiexclusionary advocacy coalition","downloadUrl":"http:\/\/mesharpe.metapress.com\/app\/home\/contribution.asp?referrer=parent&backto=issue,5,7;journal,7,24;linkingpublicationresults,1:110910,1.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7507\/1\/2008%2004%20Ruzza-2%20AR%20Flam.pdf","pdfHashValue":"a9e5dd6ea0cf3258ce804331e61f62d9057a23b8","publisher":"M.E. Sharpe","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7507<\/identifier><datestamp>\n                2016-04-19T13:46:19Z<\/datestamp><setSpec>\n                com_2381_43<\/setSpec><setSpec>\n                com_2381_9551<\/setSpec><setSpec>\n                col_2381_427<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nThe Italian Antiracist Movement Between Advocacy, Service Delivery, and Political Protest<\/dc:title><dc:creator>\nRuzza, Carlo<\/dc:creator><dc:description>\nThe Italian antiracist movement is a composite political entity that has expressed the views, concerns, and political protests of various institutionalized and noninstitutionalized constituencies. In recent years, this movement has mainly taken a defensive stand because in the mind of many Italians \"race\" is associated with migration, which, in turn, is associated with crime, ethnic rivalry, and illegality. The movement has focused on affirming the primacy of human rights and individual responsibility in the face of a political system that has often yielded to negative stereotypes in order to exploit emerging political opportunities for the populist right. In addition, the movement has been active in particular policy fields where racial discrimination is more likely to occur, such as housing policy, education, sports, health policy, and practices in the job market.\\ud\n\\ud\nThis article reviews the role and impact of the main actors of the antiracist movement in terms of its structure and composition, its campaigns, and its activities. It argues that facing hostile public opinion, and interpreting the grievances of socially and politically weak groups of recently arrived migrants, it has learned to rely on the generalist associational resources of the leftist and Catholic conscience constituencies. It has formed a broad and articulated antiexclusionary advocacy coalition.<\/dc:description><dc:date>\n2010-02-09T14:20:15Z<\/dc:date><dc:date>\n2010-02-09T14:20:15Z<\/dc:date><dc:date>\n2008<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nInternational Journal of Sociology, 2008, 38 (2), pp. 54-62.<\/dc:identifier><dc:identifier>\n0020-7659<\/dc:identifier><dc:identifier>\nhttp:\/\/www.tandfonline.com\/doi\/abs\/10.2753\/IJS0020-7659380204<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7507<\/dc:identifier><dc:identifier>\n10.2753\/IJS0020-7659380204<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author's final draft of the paper published as International Journal of Sociology, 2008, 38 (2), pp. 54-62.  Copyright M.E. Sharpe.  The final version is available from http:\/\/mesharpe.metapress.com\/app\/home\/contribution.asp?referrer=parent&backto=issue,5,7;journal,7,24;linkingpublicationresults,1:110910,1.  Doi: 10.2753\/IJS0020-7659380204<\/dc:rights><dc:publisher>\nM.E. Sharpe<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0020-7659","issn:0020-7659"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article"],"fullText":"55\nCarlo Ruzza (MA SUNY, Ph.D. Harvard) teaches ethnic relations at the University of Leicester, UK. \n His research interests focus upon antiracism, populism, and ethnonationalism, civil \nsociety, Europe, and social movements. Address correspondence to: Carlo Ruzza, Dipar-\ntimento di Sociologia e Ricerca Sociale. Piazza Venezia 41- 38100 Trento, Italy; e-mail: \ncarlo.ruzza@soc.unitn.it.\nThe author thanks the following funding organizations, which supported the empiri-\ncal work for this article: The European Union–DG Research, which funded the projects \nOrganized Civil Society and European Governance (CIVGOV 2003–6) and Institutional \nPatterns of Race Discrimination (XENOPHOB 2003–6). The work on migrant associa-\ntions with particular reference to the health policy fields was supported by the Volkswagen \nFfoundation grant Giving New Subjects a Voice (2005–8). Thanks to Giulia Bigot for her \nhelp with the interviews.\nInternational Journal of Sociology, vol. 38, no. 2, Summer 2008, pp. x–x.\n© 2008 M.E. Sharpe, Inc. All rights reserved.\nISSN 0020–7659\/2008 $9.50 + 0.00.\nDOI 10.2753\/IJS0020-7659380204\nCARLO RUZZA\nThe Italian Antiracist Movement  \nBetween Advocacy, Service  \nDelivery, and Political Protest\nABSTRACT: The Italian antiracist movement is a composite political entity that \nhas expressed the views, concerns, and political protests of various institutional-\nized and noninstitutionalized constituencies. In recent years, this movement has \nmainly taken a defensive stand because in the mind of many Italians “race” is \nassociated with migration, which, in turn, is associated with crime, ethnic rivalry, \nand illegality. The movement has focused on affirming the primacy of human rights \nand individual responsibility in the face of a political system that has often yielded \nto negative stereotypes in order to exploit emerging political opportunities for \nthe populist right. In addition, the movement has been active in particular policy \nfields where racial discrimination is more likely to occur, such as housing policy, \neducation, sports, health policy, and practices in the job market.\nThis article reviews the role and impact of the main actors of the antiracist \n04 Ruzza.indd   55 4\/23\/2008   3:14:13 PM\n56 INTERNATIONAL  JOURNAL  OF  SOCIOLOGY\nmovement in terms of its structure and composition, its campaigns, and its activi-\nties. It argues that facing hostile public opinion, and interpreting the grievances of \nsocially and politically weak groups of recently arrived migrants, it has learned to \nrely on the generalist associational resources of the leftist and Catholic conscience \nconstituencies. It has formed a broad and articulated antiexclusionary advocacy \ncoalition.\nIssues of racial and xenophobic discrimination, which have been relevant in North-\nern Europe for several decades, are now also prominent in Southern Europe where \nethnic diversity is growing through increasing migration flows. While throughout \nEurope conflicts related to ethnic diversity have sparked a reexamination of the \nmeaning of territorial belonging, citizenship, and nationality, and have stimulated \na broad range of responses by social and political institutions, South European \ncountries have only recently begun to react to the politicization of migration-related \nissues. One such reaction is the emergence of distinct antiracist organizations paral-\nleled by antidiscrimination and promigrant campaigns supported by the left-liberal \nfamily of social movements, mainstream leftist parties, churches, and voluntary \norganizations.\nThis article examines the conditions for its emergence and its political oppor-\ntunities in the current political and social context. Evidence for the article comes \nfrom a variety of sources. In 2003–5, interviews were conducted with key Italian \ngovernment officials at various levels of government and with representatives of \nantiracist organizations in five cities on the role, strategies, and political opportu-\nnities of antiracist movements in the policy process. Fourteen formal interviews \nwith representatives of antiracist groups were conducted in Milan, Udine, Bolo-\ngna, Naples, and Cagliari—selected to represent the variety of geographical and \neconomic specificities of the country. The interviews focused on activists’ percep-\ntions of institutional support and support by the population, their identification of \ndiscrimination in different policy sectors and particularly in relation to housing \nand labor market policies.\nDemographic, Economic, and Political Context\nSouthern Europe as a whole, and within it Italy, have seen substantial migration \nflows in recent years. In contrast to Northern Europe, this migration is character-\nized by the multiprovenance of migrants and their illegal status. It occurs at a time \nwhen economic globalization engenders increased competition in the Italian labor \nmarket and a redefinition of employment patterns in favor of increasingly irregular, \noften illegal forms of employment. In this context, rapidly increasing immigration \nhas deeply shocked a country with no significant colonial past and therefore little \nexperience of ethnic diversity. The limited ability of the Italian state to control its \nterritory, typical of all South European states, the prevalence of organized gangs of \nhuman traffickers, and the objective difficulty of controlling a very long coastline \n04 Ruzza.indd   56 4\/23\/2008   3:14:13 PM\nSUMMER  2008 57\nmeant that illegal migration escalated rapidly in the late 1980s and 1990s, spur-\nring fears of crime but also engendering feelings of cultural displacement in the \npopulation.\nThese factors shaped the focus of both antimigrant and antiracist movements. \nAntiracist mobilization has focused only secondarily on issues of “race.” While \ncombating media stereotyping of migrants, it has emphasized migrants’ human \nrights or justified their access to services, political representation, and\/or territo-\nrial belonging. The issue of biological “race” remains significant in some limited \ncontexts and for some ethnic groups, not least because many migrants are nonwhite, \nbut it is not the main issue. Rather, antiracist mobilization focuses on (1) revers-\ning the exclusionary conceptualizations in various arenas in a state whose funding \nprinciples are largely based on a monoethnic model; and (2) counteracting the \nperception of ethnic rivalry.\nThe issue of racism emerged at a time when the foreign population increased at \na rapid rate in the 1980s and 1990s in the relatively weak states of Southern Europe \nthat had high unemployment rates and levels of political corruption, and a substantial \ninformal economy of 25 percent of gross national product (Venturini 2004). As \nin these countries, in Italy as well migrant workers were defined as the subjects \nof a “war among the poor” (ibid.). In 1945, having rejected racial discrimination, \nwhich permeated institutions under Fascism, most Italians were not ready to readopt \ncompromised biological racist stereotypes. Even the political right eschewed their \nuse. The Italian lore was to maintain “we are not racist.” Or even “we are not racist \nbecause we have been discriminated against ourselves.” Nonetheless, intolerance \nand institutional discrimination toward foreign migrants emerged quickly in several \nparts of the country, combining with that directed against internal migrants who \nhad come to the north from the south of Italy in the 1980s–1990s (Sniderman, Peri \net al. 2000). As the flow of migrants continued, new stereotypes emerged—they \nmanifested themselves in the media and in political discourse (Dal-Lago 1999). \nWhile some political actors exacerbated negative sentiments against migrants, \npublic responses were less vehement. Two dominant frames emerged: migration \nas a threat to jobs and migration as a threat to security.\nThese frames resonated with the population, which was very concerned with \njoblessness and personal safety and less with “race.” A 1999–2000 survey found that \nItalians accept people of other “races” as neighbors slightly more than they accept \nimmigrants. At around 15 percent this figure is roughly midway in a distribution \nof twenty-eight European countries (Arts and Halman 2005: 87). However, both \nin 1990 and in 1999–2000, more than 90 percent of the Italian population sampled \nbelieves that in case of job scarcity, employers should give priority to co-nationals \nrather than to migrants (ibid.: 89). This figure is the highest in a distribution of \ntwenty-nine countries, and the fact that it remained constant in the two different \nsurveys ten years apart (1990 and 2000) indicates fairly well-ingrained attitudes.\nThe antiracist movement emerged as a response to a period of right-wing politi-\ncal success. Before the collapse of the first republic in the early 1990s, the Italian \n04 Ruzza.indd   57 4\/23\/2008   3:14:13 PM\n58 INTERNATIONAL  JOURNAL  OF  SOCIOLOGY\npolitical culture, split as it was between two universalisms—the Communist and \nthe Catholic—refused to make political use of internal ethnic rivalries. With the \ncollapse of the party system following a set of corruption scandals, the situation \nchanged. Capitalizing on and fueling ethnic tensions, the ethnonationalist movement \nNorthern League began to acquire electoral support by thematizing and politiciz-\ning a Northern-Italian territorial identity that was previously merely cultural. As \ninternal migration abated, the language of ethnic discrimination changed. Parties \nof the right profited from the fears engendered by migration. A content analysis of \nparty documents reveals an increasing negative focus on migration over the past \ndecade (Fella and Ruzza 2006).\nThe center-left government in 1998 approved a framework law to regulate \nmigration policy: the Turco-Napolitano law, which instituted special temporary \nholding camps (centri di permanenza temporanea, CPTs), to detain illegal immi-\ngrants. These centers, which emerged as one of the largest topics of mobilization, \nreveal how even the left was sensitive to an alarmist political climate. Nonetheless, \nat the same time, the Turco-Napolitano law included new provisions to combat \nracial discrimination, and instituted a number of consultative fora of associations \nrepresenting the rights and interests of immigrants. After the 2001 election the \ncenter-right replaced the center-left government and took a more exclusionary \nstand on migration-related issues. A new law on immigration was introduced, the \nBossi-Fini law, which attempted to clamp down on clandestine immigration and \ntied legal immigration to the possession of employment contracts.\nAll these factors created a context in which the antiracist movement found it \ndifficult to mobilize.\nAntiracist Mobilization\nA bloc of antiracist associations has emerged in several EU countries. In the core \nEuropean countries, they often grew out of smaller migrant associations and formed \na movement against racist attacks. In Southern Europe they often developed from \nmultipurpose nongovernmental organizations or within leftist political parties or \nsocial organizations. The core European countries with a colonial past imposed \ntheir language on and granted citizenship to their nonwhite citizens. Nevertheless, \ndiscrimination constitutes a severe problem even for the children and grandchildren \nof these citizens. Antiracist formations emerged as a reaction to this discrimination. \nThey rely on differentiated action repertoires, ranging from the strategic use of \nthe vote, to lobbying and advocacy activities, to political protest, and occasionally \nother forms of disruptive action. After years of institutionalization, in recent years \ndisaffected youth have again taken to the streets of several core European capitals \nin often violent urban protests. These episodes presuppose a relatively socially \nskilled population with an ability to collaborate at least in staging contentious \nevents, if only at a basic level.\nThe situation is more difficult for antiracist mobilization in Southern Europe, \n04 Ruzza.indd   58 4\/23\/2008   3:14:13 PM\nSUMMER  2008 59\nsince political opportunities are more restricted. Immigrants come from a wide \nrange of countries, are often illegal and as such they do not have access to political \nrights or vote. For them public protest activities are high-risk strategies that can \ncause expulsion from the country. As they often do not speak the host language, \ncoordinating strategies with allies, sympathetic institutional actors, and other so-\ncial movements remains difficult. Coordinating activities is difficult even among \nmigrants living in the same area since they speak many different languages. Since \ntheir religions differ, they cannot utilize churches as shared meeting points. They \nmight have different and sometimes incompatible problems, principles, and claims. \nFinally, they are also often territorially dispersed. Despite discrimination, they find \nit difficult to mobilize. Their situation epitomizes the “poor people’s movements,” \nwhich do not have the political skills, organizing ability, and resources to engage \nin viable protests (Piven and Cloward 1978).\nMigrants in Southern Europe live and work in much poorer societies and are \nthemselves poorer than many autochthonous citizens. Struggling to find employ-\nment often becomes an all-absorbing activity that leaves no time for any form of \npolitical participation, contentious or noncontentious. Associations of migrants are \nalso too weak to function as stepping-stones for social movements. Nonetheless, a \nconscience constituency of institutional activists and allies has emerged to oppose \nracial discrimination, improve quality of life, and promote the social recognition \nand political representation of migrants. To sum up, in South European societies \nthere are many obstacles to migrant self-mobilizing. Antiracist movements have \nemerged even in these difficult conditions, but they tend to be restricted in terms \nof political opportunities, media visibility, and possibly outcomes.\nWe find the same pattern in Italy. A hostile political climate, worries about ethnic \nrivalry on the job market, and security-related fear of migrants have weakened the \nappeal of the movement in the population. As public opinion turned more antimi-\ngrant, however, new opportunities were opening at both national and supranational \nlevels of the antiracist movement. After the prospects of the Italian antiracist move-\nment deteriorated during the right-wing government (2001–6), which suspended \nall national-level consultation forums and seemed barely interested in interacting \nwith migrants and their representatives, and since the 2006 election of the Prodi \ncenter-left government, responsiveness to antiracist associations has improved. \nPerhaps even more important: the approval of article 13 of the Amsterdam Treaty \nand the two antiracist directives were eventually incorporated in Italian legislation \n(Ruzza 2006). This handed a new powerful tool to antiracist organizations and their \ninstitutional sympathizers. In particular, in connection with the approval of the two \n“race directives,” a new service, the National Office Against Racial Discrimina-\ntion (UNAR) was formed to collect grievances and act upon them through the new \nlaws. After the formation of UNAR, antiracists had an institutional interlocutor that \ncould process their grievances and requests. A number of pro-immigrant associa-\ntions also formed to defend immigrants against racism and discrimination and to \npromote their social integration.\n04 Ruzza.indd   59 4\/23\/2008   3:14:13 PM\n60 INTERNATIONAL  JOURNAL  OF  SOCIOLOGY\nAntiracist Actors, Their Action Repertoires, and Their Opposition\nItalian antiracist movements neither ask often for policy changes nor support \ntheir requests by threatening disruptive action. There is not enough support in the \npopulation and therefore little approval of contentious politics among activists. \nNevertheless, some protest events occur and groups oriented to it are present—but \nmainly in large cities.\nIn large cities such as Milan and Naples contentious repertoires are perceived as \nmore attainable and are therefore utilized by at least some organizations. In medium-\nsize cities, such as Udine and Bologna, promigrant organizations prefer not to use \ncontentious repertoires, also as a matter of principle. The key explanation for this \nfact is found in the frequent interaction between activists from a social movement \nbackground with third-sector personnel and volunteers, which limits the available \nrepertoire (Tilly and Tarrow 2007).\nContentious episodes have occurred in reaction to some of the positions of \nright-wing local authorities, especially in the northeast of the country where the \nNorthern League has its electoral basis. For instance, organized protests have oc-\ncurred in Padua in the past few years in response to the building by a right-wing \nlocal administration of a three-meter metal partition to enclose a high-crime migrant \nhousing project.1 In that context, demonstrations and other actions such as study \ngroups, public meetings, festivals, and petitions took place.\nAs most actions occur at the local level it is difficult to assess their frequency \nand relevance. Most interviewees argue that contentious actions are infrequent and \noften poorly attended apparently because the migrant and nonwhite population is \nstill too concerned with the immediate goals of ensuring subsistence and housing \nto engage in political participation of any kind. The Italian left-liberal social move-\nments constituency is, in principle, supportive but often not prepared to mobilize, \nparticularly in this period of relatively low overall movement mobilization. Also, \nmany left-liberal movement activists are aware that contentious actions would not \nbe well received by the population. Conversely there are small groups of leftist \nand anarchists, often based in city-based “social centers,” that reject the ideology \nof participation and advocate hard protest. They constitute a minority voice in the \nmovement.\nThe core of the movement is constituted by promigrant associations. A study in \n2001 revealed that there were 900 associations operating on behalf of immigrants\/\nnon-Italian citizens in Italy, including 750 promoted by foreign nationals and 150 \nby Italian activists acting on their behalf (Vicentini and Fava 2001 [cited in Ca-\nponio 2005]). Migrants’ own associations were weak, fragmented, small-scale and \nnonprofessional, devoting their energies to cultural initiatives rather than political \nmobilization. They were hardly representative of the migrant population—smaller \nmigrant groups with higher cultural capital formed more associations than larger \ngroups, especially if these were not Catholic and received less help from the Catholic \nChurch: there is a higher proportion of Middle Eastern and African associations \n04 Ruzza.indd   60 4\/23\/2008   3:14:13 PM\nSUMMER  2008 61\nstaffed by students and refugees than there are Chinese associations—a group whose \nmany members are unskilled and whose familist culture hinders associationism \n(Caponio 2005: 933). Associations that promote the rights of migrants are dominated \nby those led by white ethnic Italians, particularly those linked to the trade unions \nand the Catholic Church. The Catholic association, Caritas, is the most influential \nand prominent organization working with immigrants, and is highly active both at \nthe national and local levels in organizing a range of social assistance provisions. \nOur own interviews indicated that antiracist organizations are engaged in a variety \nof mainly sensitizing campaigns, primarily at the local level.\nAt the national level, the Italian antiracist movements have occasionally unified \nin their countermobilization against xenophobic movements, such as the Northern \nLeague (Ruzza 2004). Large associations are involved in broader antiracist activities \nand campaigns to raise awareness of the problems endured by immigrants. Among \nthe few unified national campaigns, one can cite an unsuccessful campaign in the \nlate 1990s titled “From Guests to Citizens,” which included a petition to facilitate the \nacquisition of Italian citizenship. This campaign integrated a host of organizations, \nsuch as peace groups like Lunaria and antiracist groups such as European Network \nAgainst Racism (ENAR), as well as political parties, such as the Communist Re-\nfoundation Party. National-level events are organized by the Italian representation \nof ENAR, organizations such as CESTIM and Lunaria, which promotes research \non immigration issues and campaigns on racism, awareness-raising activities, and \nintercultural training, and the Association of Juridical Studies on Migration—a \nvoluntary association of legal professionals providing legal advice and assistance \nto immigrants and training for those working with them, promotes research and \nstudy on the legal problems facing immigrants and lobbies for changes in the law \non immigration.\nAt the local level, resource-poor associations find it hard to get involved in large-\nscale coordinated campaigns. They are often mainly oriented to service delivery, \noften on behalf of local authorities. Many such associations are dependent on \npublic funding, therefore making it difficult to challenge decision makers openly. \nInstead they seek to influence decision makers through their regular institutional \ncontacts. Caritas and the Catholic associations linked to it enjoy a more privileged \nrelationship with decision makers (having connections both to center-right and \ncenter-left former Christian democrat parties) and enjoy greater opportunities to \nlobby decision makers. Other local-level associations tend to be more preoccupied \nwith local cultural initiatives for migrants.\nLocal actors that are branches of national associations or members of umbrella \norganizations tend to get more involved in broader political campaigns related to the \nnational policymaking sphere. For example, Caritas branches provide services for \nimmigrants at the local level while producing authoritative research and statistical \nstudies on the experience of immigrants in Italy at the national level. Representing \nand enjoying a privileged position, they are esteemed by Catholics on the right and \nleft. The National Association Beyond Frontiers (ANOLF)—linked to the Confed-\n04 Ruzza.indd   61 4\/23\/2008   3:14:13 PM\n62 INTERNATIONAL  JOURNAL  OF  SOCIOLOGY\neration of Italian Workers Trade Union—with branches throughout Italy, acts as \nan advocate of immigrant rights, promoting cultural activities and information and \ntraining for immigrants and those working with them.\nIn particular, organizations connected to the trade unions (e.g., ANOLF in Naples, \nthe Association of Friuli emigrant workers in Udine) or to the left and the social \ncenters (e.g., the Recreational Italian Communist Association [ARCI] in Cagliari, \nthe Association for Foreign and Nomads Support in Milan) became involved in \nbroader campaigns—for example, protest actions against the government’s im-\nmigration policies and more specific local initiatives against CPTs.\nStill at the local level we find campaigning for greater openness of EU borders \nto migrants, a campaign of information on the consequences of the Bossi-Fini law, \na campaign of “Mobilization Against the Opening of Illegal Immigrant Detention \nCenters in Milan,” a continuing initiative to provide support and information of-\nfices for migrants in most cities of the Friuli Venezia Giulia region and support \nfor migrant rights protection (continuing since 1987), support for a project titled \n“Project Equal: Ethnos and Ethos,” a campaign to provide information on bursaries \nfor non-European migrant students, a campaign to promote the right to vote at the \nlocal level, campaigns of groups working within schools to promote intercultural \neducation, and so on. As we see, the range of activities is wide, some activities are \noriented to the public sphere, others to specific public policies. Much work has \nbeen done in the fields of education, health, housing, employment, and the justice \nsystem. In each of these areas a set of changes has taken place over past decades, \nredefining the actors, political opportunities, and action repertoires of antiracist \nsocial movements.\nAdministrative Bias and the “Second Generation” Challenge\nCaponio’s fieldwork on three cities (Naples, Milan, and Bologna) suggests that \nadministrations prefer to interact with large generalist promigrant organizations \nstaffed by Italians rather than migrant-run organizations (Caponio 2005). This might \nchange as a second generation of migrants goes through the education system and \nwill reach adulthood in a few years. This is particularly the case for the larger migrant \ncommunities: people from Albania, Morocco, Romania, China, and the Philippines. \nThus, a dialogue about combating discrimination has developed between represen-\ntatives of the promigrant wing of generalist voluntary associations mainly at the \nlocal level (Caponio 2005), and particularly in the areas ruled by left-wing local \ngovernments with a history of constructive collaboration between progressive local \ngovernments and the political representatives of the Catholic and ex-communist \nsubcultures. Solid relations of collaboration between likeminded social and political \nactors, reelected by a stable vote, have often thrived over the years. The antiracist \norganizations left outside these local dialogues face greater obstacles.\nOur own interviews point to a split between the institutionalized and dominant \nwing of the movement, which includes the Christian Association Italian Workers, \n04 Ruzza.indd   62 4\/23\/2008   3:14:13 PM\nSUMMER  2008 63\na large Catholic association and ARCI, an ex-communist youth association, on the \none hand, and a set of smaller antiracist associations, which are fairly isolated from \npolicymakers, on the other. Apparently, several small antiracist associations found \ntheir dialogue with policymakers too limited—and saw its activities increasingly \noriented to the public sphere and focused on sensitizing of the local population \nthrough the diffusion of information on discrimination, and also the organization \nof petitions and other protest events.\nConclusions\nThis article argued that in the Italian context both conflict and cooperation are avail-\nable options. There is not an alternative between disruption and institutionalization \nbut both strategies can be pursued at the same time. We found that movement-related \nassociations interact with sympathetic parts of the state and social institutions in \na concerted effort to diffuse antiracist values and to affect policy. In all contexts, \ncivil society associations perform distinctive roles: they focus on improving \npolicies, opposing exclusionary policies and actors, constructing an autonomous \npublic sphere that is more open to a plurality of cultural expressions. However, we \nfound that a minority of actors disagree with this approach, and, favoring disrup-\ntive action, argue that the currently dominant ideology of participation can stifle \ndissent, engender excessive compliance with institutions, and provide undeserved \nlegitimacy to political actors.\nNote\n1. See www.globalproject.info\/art-3031.html and http:\/\/it.wikipedia.org\/wiki\/Muro_\ndi_Padova\/.\nReferences\nArts, W., and L. Halman. 2005. “National Identity in Europe Today: What the People Feel \nand Think.” International Journal of Sociology 35, no. 4: 69–93.\nCaponio, T. (2005). “Policy Networks and Immigrants’ Associations in Italy: The Cases \nof Milan, Bologna and Naples.” Journal of Ethnic and Migration Studies 31: 931–50.\nDal-Lago, A. 1999. Non Persone. L’esclusione dei migranti in una società globale       \n<<translation of title?>> Milan: Feltrinelli. \nFella, S., and C. Ruzza. 2006. “Breaking Old Taboos: Changing Political Opportunities \nand the Re-invention of the Italian right.” Journal of Southern Europe and the Balkans \n8, no. 2. <<page nos. of article?>>\nPiven, F.F., and R. Cloward. 1978. Poor People’s Movements: Why They Succeed, How \nThey Fail. New York: Vintage.\nRuzza, C. 2004. “The Northern League: Winning Arguments, Losing Influence.” Current \nPolitics and Economics of Europe 13, no. 4: 309–34.\n———. 2006. “Human Rights, Antiracism and EU Advocacy Coalitions. In Sociology \nand Rights, ed. L. Morris, 111–28. London: Routledge.\nSniderman, P., P. Peri, et al. 2000. The Outsider: Prejudice and Politics in Italy. \n04 Ruzza.indd   63 4\/23\/2008   3:14:13 PM\n64 INTERNATIONAL  JOURNAL  OF  SOCIOLOGY\nPrinceton, NJ: Princeton University Press.\nTilly, C., and S. G. Tarrow. 2007. Contentious Politics. Boulder, CO: Paradigm.\nVenturini, A. 2004. Postwar Migration in Southern Europe, 1950–2000 An Economic \nAnalysis. Cambridge: Cambridge University Press.   \nVicentini, A., and T. Fava. 2001. Le Associazioni di Cittadini Stranieri in Italia \n<<translation of title?>>. Venice: Fondazione Corazzin.  \n04 Ruzza.indd   64 4\/23\/2008   3:14:14 PM\n"}