{"doi":"10.1007\/978-3-642-11628-5_7","coreId":"139852","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/4706","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/4706","10.1007\/978-3-642-11628-5_7"],"title":"Survey of media forms and information flow models in microsystems companies","authors":["Durugbo, Christopher","Tiwari, Ashutosh","Alcock, Jeffrey R."],"enrichments":{"references":[{"id":37949917,"title":"A Review of Information Flow Diagrammatic Models for Product-Service Systems. Submitted to Int J Adv Manuf Tech,","authors":[],"date":"2009","doi":"10.1007\/s00170-010-2765-5","raw":"Durugbo, C., Tiwari, A., Alcock, J. R.: A Review of Information Flow Diagrammatic Models for Product-Service Systems. Submitted to Int J Adv Manuf Tech, (2009)","cites":null},{"id":37949915,"title":"An Infodynamic Engine Approach to Improving the Efficiency of Information Flow in a Product-Service System.","authors":[],"date":"2009","doi":null,"raw":"Durugbo, C., Tiwari, A., Alcock, J. R.: An Infodynamic Engine Approach to Improving the Efficiency of Information Flow in a Product-Service System. Proceedings of the 1st CIRP IPS2 Conference, 107--112 (2009)","cites":null},{"id":37949913,"title":"Developing new product service systems (PSS): methodologies and operational tools.","authors":[],"date":"2006","doi":"10.1016\/j.jclepro.2006.01.023","raw":"Morelli, N.: Developing new product service systems (PSS): methodologies and operational tools. J Clean Prod 14: 1495--1501 (2006)","cites":null},{"id":37949920,"title":"Diagramming Techniques for Analysts and Programmers, Prentice Hall Englewood Cliffs,","authors":[],"date":"1985","doi":null,"raw":"Martin, J., McClure, C.: Diagramming Techniques for Analysts and Programmers, Prentice Hall Englewood Cliffs, New Jersey (1985)","cites":null},{"id":37949919,"title":"GRAI Approach to Designing and Controlling Advanced Manufacturing Systems","authors":[],"date":"1989","doi":"10.1007\/978-3-642-74575-1_21","raw":"Doumeingts, G.: GRAI Approach to Designing and Controlling Advanced Manufacturing Systems in CIM Environment. In: Advanced Information Technologies for Industrial Material Flow Systems, Nof SY, Moodie CL (eds.), NATO ASI Series, Springer-Verlag, Berlin, 461--529 (1989)","cites":null},{"id":37949923,"title":"Reviewing software diagrams: a cognitive study,","authors":[],"date":"2004","doi":"10.1109\/tse.2004.1265814","raw":"Hungerford, B. C., Hevner A. R., Collins, R. W.: Reviewing software diagrams: a cognitive study, IEEE T Software Eng 30:82--96 (2004)","cites":null},{"id":37949918,"title":"Spaces, traces and networked design. In:","authors":[],"date":"2001","doi":"10.1109\/hicss.2001.926505","raw":"Perry, M. J., Fruchter, R., Spinelli, G.: Spaces, traces and networked design. In: P Ann HICSS, 112--121 (2001)","cites":null},{"id":37949916,"title":"State-of-the-art in product-service systems.","authors":[],"date":"2007","doi":"10.1243\/09544054jem858","raw":"Baines, T.S., Lightfoot, H.W., Evans, S., Neely, A., Greenough, R., Peppard, J., Roy, R., Shehab, E., Braganza, A., Tiwari, A., Alcock, J.R., Angus, J.P., Basti, M., Cousens, A., Irving, P., Johnson, M., Kingston, J., Lockett, H., Martinez, V., Michele, P., Tranfield, D., Walton, I.M., Wilson, H.: State-of-the-art in product-service systems. P I Mech Eng B-J Eng 221: 1543--1552 (2007)","cites":null},{"id":37949921,"title":"Structured Analysis and System Specification.","authors":[],"date":"1979","doi":"10.1007\/978-3-642-59412-0_33","raw":"DeMarco, T.: Structured Analysis and System Specification. Yourdon Press, New Jersey (1979)","cites":null},{"id":37949922,"title":"Systems Design and Documentation: An Introduction to the HIPO Method,","authors":[],"date":"1976","doi":null,"raw":"Katzan, H.: Systems Design and Documentation: An Introduction to the HIPO Method, Van Nostrand Reinhold, New York (1976)","cites":null},{"id":37949914,"title":"Two decades of MEMS – from surprise to enterprise.","authors":[],"date":"2007","doi":"10.1109\/memsys.2007.4433017","raw":"Fujita, H.: Two decades of MEMS – from surprise to enterprise. IEEE MEMS Conf: 1--6 (2007).","cites":null}],"documentType":{"type":1}},"contributors":["Camarinha-Matos, L. M.","Pereira, P.","Ribeiro, L."],"datePublished":"2010-02-22T00:00:00Z","abstract":"The paper presents the findings of a survey of 40 microsystems companies that\nwas carried out to determine the use and the purpose of use of media forms and\ninformation flow models within these companies. These companies as\n\"product-service systems' delivered integrated products and services to\nrealise customer solutions. Data collection was carried out by means of an\nonline survey over 3 months. The survey revealed that 42.5% of respondents made\nuse of data flow diagrams and 10% made use of design structure matrices. The\nsurvey also suggests that a majority of companies (75%) made use of textual and\ndiagrammatic media forms for communication, analysis, documentation and\nrepresentation during design and development processes. The paper also discusses\nthe implications of the survey findings to product-service systems","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139852.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1007\/978-3-642-11628-5_7","pdfHashValue":"9602bdb7988da2f855f572c9e6a7e5bbc62fdded","publisher":null,"rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/4706<\/identifier><datestamp>2012-06-19T10:56:14Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Survey of media forms and information flow models in microsystems companies<\/dc:title><dc:creator>Durugbo, Christopher<\/dc:creator><dc:creator>Tiwari, Ashutosh<\/dc:creator><dc:creator>Alcock, Jeffrey R.<\/dc:creator><dc:description>The paper presents the findings of a survey of 40 microsystems companies that\nwas carried out to determine the use and the purpose of use of media forms and\ninformation flow models within these companies. These companies as\n\"product-service systems' delivered integrated products and services to\nrealise customer solutions. Data collection was carried out by means of an\nonline survey over 3 months. The survey revealed that 42.5% of respondents made\nuse of data flow diagrams and 10% made use of design structure matrices. The\nsurvey also suggests that a majority of companies (75%) made use of textual and\ndiagrammatic media forms for communication, analysis, documentation and\nrepresentation during design and development processes. The paper also discusses\nthe implications of the survey findings to product-service systems.<\/dc:description><dc:contributor>Camarinha-Matos, L. M.<\/dc:contributor><dc:contributor>Pereira, P.<\/dc:contributor><dc:contributor>Ribeiro, L.<\/dc:contributor><dc:date>2011-02-04T23:04:17Z<\/dc:date><dc:date>2011-02-04T23:04:17Z<\/dc:date><dc:date>2010-02-22T00:00:00Z<\/dc:date><dc:type>Conference paper<\/dc:type><dc:identifier>C. Durugbo, A. Tiwari, J.R. Alcock. Survey of media forms and information flow models in microsystems companies. Doctoral Conference on Computing, Electrical and Industrial Systems\nLisbon, Portugal, 22-24 Febuary 2010, pp62-69.<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1007\/978-3-642-11628-5_7<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/4706<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Conference paper"],"fullText":"Survey of Media Forms and Information Flow Models\nin Microsystems Companies\nChristopher Durugbo, Ashutosh Tiwari, Jeffery R. Alcock\nSchool of Applied Science, Cranfield University, Cranfield, United Kingdom\n{c.durugbo, a.tiwari, j.r.alcock}@cranfield.ac.uk\nAbstract. The paper presents the findings of a survey of 40 microsystems\ncompanies that was carried out to determine the use and the purpose of use of\nmedia forms and information flow models within these companies. These\ncompanies as ‘product-service systems’ delivered integrated products and\nservices to realise customer solutions. Data collection was carried out by means\nof an online survey over 3 months. The survey revealed that 42.5% of\nrespondents made use of data flow diagrams and 10% made use of design\nstructure matrices. The survey also suggests that a majority of companies (75%)\nmade use of textual and diagrammatic media forms for communication,\nanalysis, documentation and representation during design and development\nprocesses. The paper also discusses the implications of the survey findings to\nproduct-service systems.\nKeywords: Information flow, Modelling, Services, Product-service systems,\nMicrosystems.\n1 Introduction\nThis study focuses on a sample of microsystems companies to consider accessibility\nissues for product-service systems (PSS) but in particular information flow by means\nof media forms and models. Determining the use and purpose of use of media forms\nand information flow models could be useful in improving the delivery of products\nand services realised from microsystems production. This is because a PSS applies\n‘social constructs’ that require information flow to manage the delivery of value\npropositions based on closely linking and offering products and services [1].\nFurthermore, information flow knowledge is key to the implementation of standards\nfor quality, efficiency, and financial performance in the delivery of customer solutions\nas defined by ISO 9000 and ISO 14000 [2].\nThe main aim of this paper is to capture industry practice in the use of media forms\nand information flow models for the delivery of product-service systems.\nThe remainder of this paper has been structured as follows. Section 2 describes the\nnovelty of the research while Section 3 identifies common information flow models in\nliterature. Section 4 outlines the methodology for the research. Section 5 presents the\nfindings of the study while Section 6 discusses the implication of the study for PSS.\nC. Durugbo, A. Tiwari, and J.R. Alcock\n2 Contribution to technological innovation\nAs microsystems production moves from a ‘surprise to enterprise’ [3] phase, it is\nimportant to examine current applied tools. This paper investigates information flow\nmodelling in microsystem companies that apply PSS and seeks to contribute to\ntechnological innovation by:\n1) establishing if there are correlations in the information flow models for PSS\nproposed in literature and those actually employed in industry\n2) comparing and contrasting the various media forms employed for information\nflow during microsystem production\nTo the best of our knowledge, no previous study of this kind has been undertaken for\nthe microsystems domain.\n3 Information Flows for Product-Service Systems\nA Product-Service System (PSS) has been defined as ‘an integrated product and\nservice offering that delivers value in use’ [4]. Value in use for a PSS is realised in a\nfunction-oriented business model highlighting the importance of information flow for\nthe delivery of products and services by a manufacturer to a costumer [5].\nInformation flow is based on information gathering [1] by means of textual, audio,\nvideo and graphical media forms [6]. These media forms are used for communication\nwithin an organisation [7], for description of processes [8], for analysis of systems [9]\nand for the documentation of ideas, activities and processes [10].\nA useful way of representing information flow in a system or an organisation is by\nmeans of information flow models that depict system functions and architectures [5].\nDiagrammatic tools in particular have been suggested for information flow modelling\nbecause these tools require less storage and are processed more efficiently in humans\n[11]. Function-oriented diagrammatical information flow models such as data flow\ndiagrams (DFD), Integrated DEFinition (IDEFØ), Graphes à Résultats et Activités\nInterreliés (GRAI) grids, Petri nets, Input-Process-Output (IPO) charts and Design\nStructure Matrices (DSM), provide useful means for representing information flow in\na PSS [5]. DFD can be used in organisations to propose information flow paths\n(logical view) and to represent actual flows (physical view). DFD depict processes,\nexternal entities, data stores and flows in sequential representations. Information\nflows in manufacturing can be highlighted by the IDEFØ approach by means of boxes\nthat depict processes, and arrows that indicate inputs, controls, outputs, and\nmechanisms associated with a function. GRAI grids provide information flow\ndescriptions to support decision making processes in an organisation or a system.\nPetri-Nets deliver representations of information flow in the development and\nsimulation of event-driven and automated manufacturing systems. IPO charts offer\ninformation flow descriptions in programs but can also be extended to describe\nsystems with varying complexity. DSM offer compact, visual, matrix representations\nfor systems analysis to offer a roadmap of system level knowledge.\nSurvey of Media Forms and Information Flow Models in Microsystems Companies\n4 Research Methodology\nThis study was undertaken in four stages: literature review, state-of-the-art in\nindustry, online questionnaire and data representation.\nThe research began with a literature review of function-oriented diagrammatic models\nfor product service systems [5]. The second stage considered the state-of-the-art in\nindustry for product-service systems within the microsystems industry based on a\nsample of 100 microsystems companies. The sample was made up of a random\nselection of members of organisations (MEMS Industry Group, IVAM and SEMI) for\ncompanies aiming to carry out business transactions within the microsystems\nindustry. These companies are headquartered at locations in Europe (56%), North\nAmerica (38%) and Asia (6%). For the third stage, a questionnaire was developed and\ndistributed with pre-defined responses (and the option of a user-defined response)\nfrom participants over a period of 3 months. The questionnaire inquired about the use\nand the purpose of use of media forms and information flow models in microsystems\nproduction through questions such as ‘What are the major considerations in the choice\nof media forms?’ and ‘What modelling techniques have you used as part of your\nduties?’ Responses to the questionnaires were solicited in three ways: firstly, via\nelectronic mail containing the questionnaire, secondly, by means of an online survey\nsite for which participants were allocated a unique ID to maintain traceability and\nconfidentiality, and thirdly, by means of follow up telephone calls. 40 companies\ncompleted the questionnaire. A breakdown of the types of companies that completed\nthe questionnaire is presented in Table 1.\nTable 1 Breakdown of survey respondents.\nType of Company Number of Survey Respondents\nMicrosystems foundry 8\nMicrosystems manufacturer 22\nComputer-Aided Design (CAD) developer 3\nIntellectual Property (IP) company 2\nConsulting firm 2\nMicrosystems distributor 3\nFor the fourth stage, data representation was undertaken by means of column charts\nthat show the results of the study. Responses to each question in the survey were\naggregated and presented in a column chart that compared the aggregated responses.\n5 Research Findings\nIn terms of media forms, the survey revealed that 40 of the respondents made use text\nformats (electronic mail, facsimile and text files) while 34 of the respondents applied\ngraphical representations (diagrams and charts) for the flow of information. Audio\nand video formats, on the other hand, were used by 16 and 21 of the respondents\nrespectively as shown in Fig. 1.\nC. Durugbo, A. Tiwari, and J.R. Alcock\nFig. 1 Media forms for microsystems production\n15% of the respondents noted the use of software based simulation and 3D simulation\n\/animation by means of Computer-aided design (CAD) tools as key to information\nflow during design and development. 12.5% of the respondents noted that popular\ninformation technology formats especially slide presentations, video conferencing and\ninternet\/intranet websites were crucial to the flow of information for the design and\ndevelopment of microsystems. 1 of the respondents noted the use of physical\nprototypes as a means of information flow. 10% of the respondents also noted that\ninformation flow by face-to-face and word of mouth was applied to complement their\ncompanies’ media forms because they were small and new companies to the\nmicrosystems industry.\nFig. 2 Purpose of use for media forms during microsystems production\nIn terms of the purpose for using media forms (the question posed was ‘When are\nthese media forms used?’), 100% of the respondents chose various media forms based\non use for communication, 77.5% for description of functions and processes, 72.5%\nfor analysis of systems and 85.0% for documentation (as shown in Fig. 2). Other uses\nof media forms captured by 22.5% of the survey respondents included: for presenting\nresults and for conversations to clarify concepts or rectify issue.\nSurvey of Media Forms and Information Flow Models in Microsystems Companies\nFig. 3 Major considerations for selecting media forms during microsystems production\nIn relation to major considerations for selecting media forms, the study revealed that\n75.0% of the respondents chose various media forms because of the nature of their\nbusiness, 37.5% because of the domain of application, and 32.5% because of\navailable capital. Other considerations for the choice of media forms include: standard\nindustry practice, ease of communication, effort required to generate the material vs.\nthe communication value, ease of use and convenience. These other considerations\nwere noted by 25.0% of the survey respondents as shown in Fig. 3.\nFor information flow models, the survey showed that 17 of the respondents applied\nDFD as part of their duties, 4 respondents made use of DSM while 17 of the\nrespondents did not make use of any of the information flow models identified in\nSection 2. All respondents that made use of DSM also made use of DFD. None of the\nrespondents made use of IDEFØ, Petri Nets, GRAI or IPO charts as shown in Fig. 4.\nFig. 4 Diagrammatic models for microsystems production\n32.5% (13 from 40) of the respondents noted the use of other forms of diagrammatic\ntools such as engineering block diagrams, Gantt charts, timing diagrams, software\ndevelopment tools, enterprise resource planning (ERP) tools and project management\ntools based on methodologies such as PRINCE2 (PRojects IN Controlled\nEnvironments). 5% of the respondents also noted the use of intuitive and individual\napproaches for generating diagrams to carry out tasks.\nC. Durugbo, A. Tiwari, and J.R. Alcock\nThe study revealed that when asked what diagrammatic tools were used to model,\n50% (20 from 40) of the respondents answered for products while 17.5% (7 from 40)\nanswered for services. 12.5% (5 from 40) of the respondents made use of\ndiagrammatic tools to model both products and service.\nIn relation to the purpose of using modelling tools, the study showed that 50% of\nrespondents applied modelling tools for the design and development of products as\nshown in Fig. 5. 15% of respondents made use of modelling tools to design services\nwhile 17.5% of respondents made use of modelling tools to develop services. Other\npurposes of use identified by 12.5% of respondents include: for customer support, for\nquality planning, for managing the life of software development, to explain products\nand services to customers, for research and quality control, and for the delivery of\nservices and products.\nFig. 5 Purpose of use for diagrammatic models during microsystems production\n6 Implications for Product-Service Systems\nThe implications of this study are threefold: emphasis on business-driven information\nflows, simplicity of information flows and trade-offs between creativity\/conformity in\napproaches to managing information flow.\nWith regards to business-driven information flows, the study suggests that most\ncompanies (75.0% of survey respondents) considered the nature of their business the\nmajor consideration for choice of media forms. The microsystem businesses studied\nincluded foundries, manufacturers, CAD developers, IP companies, consulting firms\nand distributors. Consequently, the decision by a microsystem company to make use\nof media forms is dependent on the type of products and services offered. For\ninstance, a CAD developer could prefer information flow by means of software based\nsimulation whereas microsystems distributors could lay greater emphasis on\ninformation flow by means of internet websites. Furthermore, the use of modelling\ntools as highlighted in the study, supports product\/service design, product\/service\ndevelopment and in one case product\/service delivery.\nIn terms of simplicity of information flow, the study highlights two key themes:\nease of use and informal information flows. As suggested by this study, text and\ngraphical forms (the simpler media forms) scored higher among respondents.\nFurthermore, in Perry et al. [6] the use of face-to-face or word of mouth, though not\nmedia forms, are identified as common and informal forms of communications.\nSurvey of Media Forms and Information Flow Models in Microsystems Companies\nConsequently, although this was not asked as part of the questionnaire, it is assumed\nthat this is the case for all participating companies for two main reasons. Firstly,\ninformation flow by face-to-face contact and word of mouth are natural forms of\ninformation exchange and secondly, these forms of communication offer useful\navenues for informal flow of information.\nThe study also highlights the importance of considering trade-offs between\ncreativity and conformity in approaches to managing information flow. This is\nbecause the study identified cases (5% of the survey respondents) in which\ninformation flow was individual-focused i.e. companies allowed designers and\nengineers to make use of intuitive and individual approaches for modelling\ninformation flow. This attitude for analysing and managing information flow on one\nhand could foster timely delivery of a PSS. This is because approaches based on\nindividual initiatives may allow individuals to apply approaches best suited to their\nmode of operation thereby fostering timeliness in the individual’s results or output.\nOn the hand, issues of compatibility and continuity in functions of a PSS may require\na company to impose standard information flow approaches. With regards to\ncompatibility in the functions of a PSS, the use of common tools such as DFD could\nserve as a starting point for modelling information flow. This study suggests the\npopular use (42.5% of survey respondents) of DFD for modelling products and\nservices. This is in comparison to the DSM approach which was used by 10% of\nrespondents and IDEFØ, Petri Nets, GRAI or IPO charts which were not used by any\nof the respondents. This suggestion correlates with assertions in literature that\nhighlight the common use and wide spread support for DFD by most Computer-Aided\nSoftware Engineering (CASE) tools [5].\n7 Conclusions\nThe paper presents the findings of a survey to capture information flow for product-\nservice systems (PSS) based on a sample of 100 microsystems companies. In\nliterature, textual, audio, video and graphical media forms of nature have been\nidentified for maintaining information flow and for exchanging ideas among system\ndevelopers and implementers. Furthermore, the use of modelling tools has been\npromoted in research for defining and representing information flow in organisations\nand systems.\nAs indicated by the results of 40 respondents to the survey, information flow in terms\nof communication, analysis, description and documentation of microsystem functions,\nis largely motivated by the nature of businesses. In addition, the survey showed that\n17 of the respondents have used Data Flow Diagrams and 4 respondents have used\nDesign Structure Matrices. None of the respondents made use of Integrated\nDEFinition (IDEFØ), Graphes à Résultats et Activités Interreliés (GRAI) grids, Petri\nnets or Input-Process-Output (IPO) charts. The study also highlights the importance\nof emphasis on business-driven information flows, simplicity of information flows\nand trade-offs between creativity\/conformity in managing information flow.\nFuture work will focus on the implications of this study to propose techniques for\nsimplifying and emphasising business-driven information flow for microsystem\nC. Durugbo, A. Tiwari, and J.R. Alcock\ncompanies within the context of PSS. This study presents an initial attempt to\ninvestigate information flow modelling in microsystem companies. Further studies are\ntherefore recommended to evaluate how the findings of the survey compare with\nother domains and the wider implications of modelling information flow for PSS in\nterms of promoting creativity and conformity in companies.\n8 Acknowledgements\nThe authors would like to extend their sincere thanks to the Engineering and Physical\nSciences Research Council (EPSRC), for its support via the Cranfield Innovative\nManufacturing Research Centre (IMRC), towards the work carried out in the\npreparation of this paper. Also the authors would like to thank all the participants that\ntook part in the survey.\nReferences\n1. Morelli, N.: Developing new product service systems (PSS): methodologies and operational\ntools. J Clean Prod 14: 1495--1501 (2006)\n2. Fujita, H.: Two decades of MEMS – from surprise to enterprise. IEEE MEMS Conf: 1--6\n(2007).\n3. Durugbo, C., Tiwari, A., Alcock, J. R.: An Infodynamic Engine Approach to Improving the\nEfficiency of Information Flow in a Product-Service System. Proceedings of the 1st CIRP\nIPS2 Conference, 107--112 (2009)\n4. Baines, T.S., Lightfoot, H.W., Evans, S., Neely, A., Greenough, R., Peppard, J., Roy, R.,\nShehab, E., Braganza, A., Tiwari, A., Alcock, J.R., Angus, J.P., Basti, M., Cousens, A.,\nIrving, P., Johnson, M., Kingston, J., Lockett, H., Martinez, V., Michele, P., Tranfield, D.,\nWalton, I.M., Wilson, H.: State-of-the-art in product-service systems. P I Mech Eng B-J Eng\n221: 1543--1552 (2007)\n5. Durugbo, C., Tiwari, A., Alcock, J. R.: A Review of Information Flow Diagrammatic\nModels for Product-Service Systems. Submitted to Int J Adv Manuf Tech, (2009)\n6. Perry, M. J., Fruchter, R., Spinelli, G.: Spaces, traces and networked design. In: P Ann\nHICSS, 112--121 (2001)\n7. Doumeingts, G.: GRAI Approach to Designing and Controlling Advanced Manufacturing\nSystems in CIM Environment. In: Advanced Information Technologies for Industrial\nMaterial Flow Systems, Nof SY, Moodie CL (eds.), NATO ASI Series, Springer-Verlag,\nBerlin, 461--529 (1989)\n8. Martin, J., McClure, C.: Diagramming Techniques for Analysts and Programmers, Prentice\nHall Englewood Cliffs, New Jersey (1985)\n9. DeMarco, T.: Structured Analysis and System Specification. Yourdon Press, New Jersey\n(1979)\n10. Katzan, H.: Systems Design and Documentation: An Introduction to the HIPO Method, Van\nNostrand Reinhold, New York (1976)\n11. Hungerford, B. C., Hevner A. R., Collins, R. W.: Reviewing software diagrams: a cognitive\nstudy, IEEE T Software Eng 30:82--96 (2004)\n"}