{"doi":"10.1017\/S0263574700019792","coreId":"69881","oai":"oai:eprints.lancs.ac.uk:20405","identifiers":["oai:eprints.lancs.ac.uk:20405","10.1017\/S0263574700019792"],"title":"Swing-up control of inverted pendulum systems.","authors":["Bradshaw, Alan","Shao, Jindi"],"enrichments":{"references":[{"id":16337121,"title":"A New Inverted Pendulum Apparatus for Education&quot;","authors":[],"date":"1991","doi":"10.1016\/b978-0-08-040958-0.50029-4","raw":"K. Furuta, M. Yamakita, S. Kobayashi and M. Nishimura &quot;A New Inverted Pendulum Apparatus for Education&quot; IF AC Advances in Control Education, Massachusetts, USA (1991) pp. 133-138.","cites":null},{"id":16337139,"title":"Attitude Control of a Triple Inverted Pendulum&quot;","authors":[],"date":null,"doi":"10.1080\/00207178408933251","raw":"K. Furuta, T. Ochiai and N. Ono &quot;Attitude Control of a Triple Inverted Pendulum&quot; Int. J. Control 39, No. 6, 1351-1365(1984).","cites":null},{"id":16337119,"title":"Control of Unstable Mechanical System, Control of Pendulum&quot;","authors":[],"date":"1976","doi":"10.1080\/00207177608922192","raw":"S. Mori, H. Nishihara and K. Furuta, &quot;Control of Unstable Mechanical System, Control of Pendulum&quot; Int. J. Control 23, No. 5, 673-692 (1976).","cites":null},{"id":16337137,"title":"Digital Control of a Double Inverted Pendulum on an Inclined Rail&quot;","authors":[],"date":"1980","doi":"10.1080\/00207178008922898","raw":"K. Furuta, H. Kajiwara and K. Kosuge &quot;Digital Control of a Double Inverted Pendulum on an Inclined Rail&quot; Int. J. Control 32, No. 5. 907-924 (1980).","cites":null},{"id":16337140,"title":"Discrete Computer Control of a Triple Inverted Pendulum&quot;","authors":[],"date":"1990","doi":"10.1002\/oca.4660110205","raw":"H.M.Z. Farwig and H. Unbenauen &quot;Discrete Computer Control of a Triple Inverted Pendulum&quot; Optimal Control Applications and Methods 11, 157-171 (1990).","cites":null},{"id":16337116,"title":"Dynamics & Nonlinear Control of Unstable Inverted Pendulum Systems&quot;","authors":[],"date":"1995","doi":null,"raw":"J. Shao, &quot;Dynamics & Nonlinear Control of Unstable Inverted Pendulum Systems&quot; PhD Thesis (Engineering Department of Lancaster University, Britain, 1995).","cites":null},{"id":16337118,"title":"Legged Robots that Balance","authors":[],"date":"1986","doi":"10.1145\/5948.5950","raw":"M.H. Raibert, Legged Robots that Balance (The MIT Press. London, 1986).","cites":null},{"id":16337132,"title":"Modern Control Theory (Prentice-Hall,","authors":[],"date":"1991","doi":null,"raw":"W.L. Brogan Modern Control Theory (Prentice-Hall, New Jersey, 1991).","cites":null},{"id":16337135,"title":"On the Control of Unstable Multiple-Output Mechanical Systems&quot;","authors":[],"date":"1963","doi":null,"raw":"D.T. Higdon and R.H. Cannon &quot;On the Control of Unstable Multiple-Output Mechanical Systems&quot; ASME Winter Annual Meeting, Philadelphia (November, 1963) paper No. 63-WA-148.","cites":null},{"id":16337125,"title":"Robo Sapiens: a Personal Assistant Robot&quot;","authors":[],"date":"1994","doi":null,"raw":"A. Bradshaw, D.W. Seward and F.N. Nagy &quot;Robo Sapiens: a Personal Assistant Robot&quot; Proc. of Joint HungarianBritish Mechatronks Conf., Budapest, (Sept. 1994) pp. 159-164.","cites":null},{"id":16337120,"title":"Swing Up Control of Inverted Pendulum&quot;","authors":[],"date":"1991","doi":"10.1109\/iecon.1991.239008","raw":"K. Furuta, M. Yamakita and S. Kobayashi, &quot;Swing Up Control of Inverted Pendulum&quot; IECON&quot;9\/ (1991) pp. 2193-2198.","cites":null},{"id":16337117,"title":"Walking Machines-an Introduction to Legged Robots","authors":[],"date":"1985","doi":"10.1016\/0278-6125(85)90030-5","raw":"D.J. Todd, Walking Machines-an Introduction to Legged Robots (Kogan Page Ltd, London, 1985).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1996-07","abstract":"In Part I a technique for the swing-up control of single inverted pendulum system is presented. The requirement is to swing-up a carriage mounted pendulum system from its natural pendent position to its inverted position. It works for all carriage balancing single inverted pendulum systems as the swing-up control algorithm does not require knowledge of the system parameters. Comparison with previous swing-up controls shows that the proposed swing-up control is simpler, eaiser. more efficient, and more robust. In Part II the technique is extended to the case of the swing-up control of double inverted pendulum systems. Use is made of a novel selective partial-state feedback control law. The nonlinear, open-loop unstable, nonminimum-phase. and interactive MIMO pendulum system is actively linearised and decoupled about a neutrally stable equilibrium by the partial-state feedback control. This technique for swing-up control is not at all sensitive to uncertainties such as modelling error and sensor noise, and is both reliable and robust","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69881.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/20405\/1\/download.pdf","pdfHashValue":"47efea6c73ef96ae933a378d4bf7ff3245a8584d","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:20405<\/identifier><datestamp>\n      2018-01-24T02:34:39Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5441<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Swing-up control of inverted pendulum systems.<\/dc:title><dc:creator>\n        Bradshaw, Alan<\/dc:creator><dc:creator>\n        Shao, Jindi<\/dc:creator><dc:subject>\n        TA Engineering (General). Civil engineering (General)<\/dc:subject><dc:description>\n        In Part I a technique for the swing-up control of single inverted pendulum system is presented. The requirement is to swing-up a carriage mounted pendulum system from its natural pendent position to its inverted position. It works for all carriage balancing single inverted pendulum systems as the swing-up control algorithm does not require knowledge of the system parameters. Comparison with previous swing-up controls shows that the proposed swing-up control is simpler, eaiser. more efficient, and more robust. In Part II the technique is extended to the case of the swing-up control of double inverted pendulum systems. Use is made of a novel selective partial-state feedback control law. The nonlinear, open-loop unstable, nonminimum-phase. and interactive MIMO pendulum system is actively linearised and decoupled about a neutrally stable equilibrium by the partial-state feedback control. This technique for swing-up control is not at all sensitive to uncertainties such as modelling error and sensor noise, and is both reliable and robust.<\/dc:description><dc:date>\n        1996-07<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/20405\/1\/download.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0263574700019792<\/dc:relation><dc:identifier>\n        Bradshaw, Alan and Shao, Jindi (1996) Swing-up control of inverted pendulum systems. Robotica, 14 (4). pp. 397-405. ISSN 0263-5747<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/20405\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0263574700019792","http:\/\/eprints.lancs.ac.uk\/20405\/"],"year":1996,"topics":["TA Engineering (General). Civil engineering (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Robotica (1996) volume 14. pp 397-405. © 1996 Cambridge University Press\nSwing-up control of inverted pendulum systems\nAlan Bradshaw and Jindi Shao\nEngineering Department, Lancaster University. Lancaster, LAI 4YR (UK)\n(Received in Final Form: December 11. 1995)\nSUMMARY\nIn Part I a technique for the swing-up control of single\ninverted pendulum system is presented. The requirement\nis to swing-up a carriage mounted pendulum system from\nits natural pendent position to its inverted position. It\nworks for all carriage balancing single inverted pendulum\nsystems as the swing-up control algorithm does not\nrequire knowledge of the system parameters. Com-\nparison with previous swing-up controls shows that the\nproposed swing-up control is simpler, eaiser. more\nefficient, and more robust.\nIn Part II the technique is extended to the case of the\nswing-up control of double inverted pendulum systems.\nUse is made of a novel selective partial-state feedback\ncontrol law. The nonlinear, open-loop unstable,\nnonminimum-phase. and interactive MIMO pendulum\nsystem is actively linearised and decoupled about a\nneutrally stable equilibrium by the partial-state feedback\ncontrol. This technique for swing-up control is not at all\nsensitive to uncertainties such as modelling error and\nsensor noise, and is both reliable and robust.\nKEYWORDS: Inverted pendulum: Nonlinear unstable syst-\nems: Swing-up control: Partial-state'feedback.\nPART I: SINGLE INVERTED PENDULUM\nSYSTEM\n1. Introduction\nInverted pendulum systems' are well known in control\nengineering for verification and practice of control theory\nand robotics.\"\"1 Modern inverted pendulum systems\nextend the inverted pendulum's working range from\naround the upright vertical to the full 360° angular range.\nThis introduces an initialisation problem, that is. to\nswing-up the pendulum from its natural pendent position\nto its inverted position.\nTwo approaches to swing-up control have been\npresented previously. The first uses a feed-forward\nbang-bang control.4 This technique is very sensitive to\nmodelling error and noise due to the nature of\nfeed-forward control and is not a reliable technique. The\nsecond uses a feedback bang-bang control\/\" This was\nsuccessfully demonstrated on a rotating-arm single\ninverted pendulum system without rail length restriction.\nIt is not suitable for carriage balancing single inverted\npendulum (CBSIP) systems in which the rail length is\nfinite.\nIn this paper, a new approach to swing-up control is\nproposed. This approach depends on a sound under-\nstanding of the physical behaviour of CBSIP systems. It\nis based on three observations: (1) when disturbed, the\npendulum's natural behaviour is a nonlinear vibration\naround its pendent vertical position (stable equilibrium)\nwith a decreasing amplitude and a varying (increasing)\ncircular frequency: (2) by increasing the pendulum's\nkinetic energy, the amplitude of the pendulum's\nvibration can be increased: and (3) the kinetic energy can\nbe increased by moving the carriage co-ordinately\nfollowing the rhythm of the pendulum's vibration.\nThe major principle of the proposed swing-up control\nis to follow the pendulum's natural vibration, and\ngradually turn it from damped vibration into resonance\nin a controlled manner. This will make the pendulum\nswing higher and higher. When it is close to the inverted\nvertical, a full-state feedback controller will take over the\ncontrol and stabilise the whole system including the\ninverted pendulum.\nThe proposed technique has two major advantages: (1)\nrobustness, it works for all CBSIP systems regardless of\nthe vaues of their parameters, and (2) simplicity, it is\nsimple and easy to tune. Furthermore, the principle of\nthe technique can be applied to double and triple\npendulum systems, and robotics.7\n2. Inverted pendulum system\nAs schematically shown in Figure 1. a CBSIP system\nconsists of a carriage and a pendulum atop the carriage.\nThe carriage has mass Mc. and translational friction\ncoefficient kr along the rail. The pendulum has mass Mp,\nlength Lp, rotational friction coefficient ko, and gravity\ncentre at C. Control of the system is by means of force u\napplied horizontally to the carriage, the outputs are the\ncarriage's position .vc. and the pendulum's angle 0\n(0° £ 0 < 360°).\nApplying Lagrange's method, the system's nonlinear\nequations of motion can be readily obtained, and setting\nM - Mc + Mp can be expressed in the form\n*>Lpii - •\nx,. = •\n+ IMpLp sin (0)02\n+ 6cos (9)kt,9 - l. pg sin (20)\n(4\/W, + M;> + 3M,, sin2 (6)]LP\n-6MPLP cos {9)u + 6MPLP cos {8)k,xe\n- I.SM-LJsin (20)02 - \\2Mk,,B + 6MMpLpg sin (9)\n[4M, + Mp + 3\/V\/,, sin2(0)]\/V\/,,L:,\n(1)\n398 Inverted pendulum systems\nFig. 1. Carriage balancing single inverted pendulum system.\nThe nonlinear equation of motion (1) can be linearised\nabout 0 = 0°. and setting M, = 4M(. + A\/,, the result can\nbe expressed in state-space form\nx = Ax + Bit (2)\nwhere\nA =\n1\n- 4 * ,\nM,\n0\n6kr\n0\n6*,,\nMXLP\n1\n-12MA:,,\nB =\n0\n_4_\nM,\n0\n- 6\nIn equation (2). x = [.rt. ve 0 w] r where v,. is the speed\nof the carriage and w is the angular velocity of the\npendulum. The nonlinear equations (1) are used for\ncomputer simulation of the system, and the linearised\nequation (2) is used for linear controller design. Because\nthe linearised system shown in equation (2) is unstable\nbut controllable, a full-state feedback control\" of the\nform\nu = kxxr - kx (3)\nwith the constant control vector Ar = [kx kr ke ka] exists,\nwhich will stabilise the whole system and achieve the\ncarriage's position control. In equation (3), xr is the\ncommanded carriage position, which is set to zero in this\nstudy. The control vector k can be calculated by the\nLQR (linear-quadratic regulator) design method8 with\nthe performance criterion\n(4)J= (xT Qx + uRu) dt\nwhere Q is the state weighting matrix which must be\nsymmetric and positive semi-definite, and R is the control\nweighting coefficient which must be positive. In order\nto compare the swing-up control results in this paper\nwith previous results, the system's parameter specifica-\ntions are taken from Mori\"s system:4 Me = 0.48 kg.\nA:, = 3.83 [Ns\/m], Mp = 0.16 kg. Lp = 0.5m. and ko =\n0.00218 [Nms\/Rad]. With Q = \/ and rt = 0.02. the\noptimum control vector is found to be\nk = [-7.071 -15.73 -59.59 -12.70] (5)\nOnly if the initial pendulum angle 0(0) is close to the\ninverted vertical, can the full-state feedback control\nshown in equation (3) with the control vector (5) balance\nthe pendulum and position the carriage. Evidently, the\ninitialisation of the pendulum is necessary, which is to\nbring the inverted pendulum up from its natural pendent\nvertical position.\n3. Swing-up control\nThe nonlinear system represented by equation (1) has a\nstable equilibrium at jr, = [.rt. 0 180° 0]T, and an\nunstable equilibrium at x2 = [.r,. 0 0° 0]T. Both of these\nequlibrium points can be obtained with an arbitrary\ncarriage position xc (therefore the carriage's position\ncontrol is possible). Without the control (z< = 0), the\nsystem's natural behaviour can be observed by releasing\nit from the initial state x(0) = [0 0 0(0) 0]7\" where\n0(0) * 0° and 0(0) ^ 180°. With 0(0) = 10° the numerical\nsolution of equation (1) is computed and shown in Figure\n2.\nThe natural behaviour of the system is damped\nvibration of both the pendulum and the carriage. Two\nimportant factors can be observed from the system's\nnatural behaviour: (1) due to the translational and the\nrotational friction, the amplitudes of both the pendulum\nand the carriage decrease with the time: and (2) with the\ndecreasing amplitudes, the circular frequencies of the\nvibrations increase with the time, which is a nonlinear\ncharacteristic.\nIn order to swing-up the pendulum towards the\ninverted vertical, its kinetic energy level must be\nincreased. In this system, this can only be achieved by\napplying force to the carriage, and this force must at least\nPendulum Angle (degree)\n-0.06\n3 4 5 6 7\nTime: 0-10 seconds\nFig. 2. Natural behaviour of carriage balancing single inverted\npendulum system.\nInverted pendulum systems\nbe large enough to overcome the friction. The direction\nand the amplitude of the input force must always be\ncontrolled so as to increase the pendulum's kinetic\nenergy, despite the difficulties that (1) the force u applies\nto the pendulum indirectly through the carriage. (2) the\nvibrations of the pendulum and the carriage are\nnonlinear, and (3) there is a phase-lag between these two\nvibrations. Failure to do so will at best lead to energy\nloss and make the initialisation unnecessarily longer and\nat worst lead to a forced vibration of the pendulum at a\nconstant amplitude and make the initialisation impos-\nsible. When the total energy of the pendulum equals PE,\nwhere\nPE = M,,LPg (6)\nthat is. the pendulum's potential energy at the inverted\nvertical, the pendulum will be swung-up to its upright\nposition. It is shown in this paper that the easiest and\nmost efficient way to achieve this is to apply the force at\nthe frequency of the pendulum's nonlinear vibration, so\nas to drive the pendulum into a resonance in a controlled\nmanner. This leads directly to the swing-up control law.\nas linear feedback of w according to the equation:\n», = ks (7)\nClearly, to start the swing-up control, a nonzero initial\nw(0) is required. This can be obtained either by releasing\nthe pendulum from a small angle away from the pendent\nvertical, or by applying a force to the carriage for a short\ntime period before switching to the swing-up control. To\nsimplify the discussion, the pendulum is released at\n[0(0) = 165° w(0) = 0j.\n4. Tuning of swing-up control\nThe tuning of the sole constant k, in equation (7) is easily\nachieved by starting from a small value and gradually\nincreasing it. either in a computer simulation or in a real\nlaboratory experiment. There exists a boundary kh of ks.\nwhich is determined by the friction and the parameters of\n399\nthe system. The relationship between ks and kh is as\nfollows: (1) if k,<kh then », is not strong enough to\novercome friction, both the pendulum and the carriage\nperform damped vibrations: (2) if ks = kh then H, is just\nstrong enough to overcome friction, both the pendulum\nand the carriage perform undamped vibrations: and (3) if\nk^ > kh then us is strong enough to swing-up the\npendulum towards the inverted vertical.\nBy substituting equation (7) into the nonlinear\nequation (1). kh could be obtained analytically, however\nthis is both difficult and unnecessary. The value of kh can\nbe found by numerical solution of equations (1) and (7)\nduring the tuning of the swing-up control. For example,\nit is found that kh = 0.31 for the parameter values used in\nthis paper. The system's time responses with kx = 0A.\n0.31, and 0.4 are shown in Figure 3. Once ks>kh, the\npendulum will be swung-up towards the upward vertical\nby the control it, given by equation (7).\nThe tuning of k, is judged by two factors, the required\nrail space .vr, and the required swing-up time r, at which\nthe pendulum is close to the inverted vertical (normally\nwithin ±10°). Generally, increasing k, leads to decreasing\nts and increasing xn. For example, a swing-up time\n\/., < 2 s can be achieved by choosing ks = 2. The results of\nthe swing-up control shown in Figure 4. in which the\npendulum is successfully swung-up towards the inverted\nvertical, are obtained with k, = 2. In Figure 4. the control\n»., is limited by a maximum force «m.,v = 10.8 N. which\nwill be discussed shortly.\n5. Switching conditions\nThere are three important factors which must be\nconsidered when switching between the swing-up control\nand the full-state feedback control. First, the closed-loop\nsystem with the full-state feedback control expressed in\nequation (3) has a restricted stable state region around\nthe origin, because the controller design is based on the\nlinearised system represented in equation (2). Second,\nthe final states of the swing-up control must not force the\n0.05\n•o.oi\nPendulum Angles (degree)\n0.5 1.5 2 2.5 3 3.5\nCarriage Positions\n4.5\n4.5 51.5 2 2.5 3 3.5\nTime: 0 - 5 seconds\nFig. 3. The vibrations of the carriage balancing single inverted\npendulum system.\nPendulum Angle (degree)\n0.2 0.4 1.4 1.60.6 0.8 1\nTime: 0-1.6 seconds\nFig. 4. Swing-up control of the carriage balancing single\ninverted pendulum system.\n400 Inverted pendulum systems\ncarriage beyond the available rail space. Third, during\nthe swing-up control the pendulum should not be\nallowed to go over the top. Once it crosses the upward\nvertical, the pendulum will perform a nonlinear rotation\naround its pivot with a nonzero angular velocity. In this\nsituation, even if the system is switched when the\npendulum is vertical, it is most likely that either the\nsystem is outside the stable region, or the full-state\nfeedback control runs out of rail space.\nTo prevent the pendulum from crossing the upward\nvertical, its total energy must be less than PE as given by\nequation (6) (Clearly a larger Mp or Lp leads to a larger\nPE, and hence a larger force or a longer switching time.).\nThis can be achieved by saturating the control to a\nmaximum umax. If the pendulum starts rotating, the\nrotation can be controlled back to a vibration by\nresetting umax.\nDuring swing-up control, the best switching moment is\nwhen the pendulum is close to the upward vertical and at\nits maximum angle of vibration, then, the system's states\nare nearest to the equilibrium condition. Although .r(. is\nat its maximum position, it does not affect the system's\nstability. vc is close to zero (there is a phase lag between\nthe vibrations of the carriage and the pendulum). \\9\\ is at\nthe minimum (0 = 360° also stands for the inverted\nvertical), and w = 0. This case can be observed in Figure\n5 which shows the states of the swing-up control with\nks = 2 and umax = 10.8 N.\nMoreover, when close to the upward vertical, the\nfull-state feedback control uf can quickly stabilise the\npendulum (small 9 and w = 0) and then drive the\ncarriage towards the middle of the rail (.r, = 0), so that\nthe recovery does not require much extra rail length.\nThus, the switching conditions ate \\9\\^9S and w = 0,\nwhere the boundary 9S is determined mainly by the\nconstants of the full-state feedback control. Generally, 9S\ncan be set to 10° to ensure smooth switching. However,\nthe results shown in Figure 5 indicate that the system's\nbest switching time is ts = 1.58 s, at which time 9 = 17.5°.\nEven with this larger angle (9> 10°), the system can be\nstabilised easily and smoothly, by switching on the\nfull-state feedback control. The complete swing-up\ncontrol of the system is computed and shown in Figure 6.\nThe flow chart of a computer algorithm that\nautomatically tunes and switches the swing-up control is\nshown in Figure 7. In the algorithm, H is the step size\nwith which to increase ks from zero, and h is the step size\nwith which to decrease »max from the real maximum\nforce of the system.\nRefer to Figure 7, when the switch conditions are met.\nthe full-state feedback control is switched on to complete\nthe swing-up control. If the pendulum starts rotating\n[9 = 0°), umas will be decreased by h and the experiment\nor simulation will start again. On the other hand, if the\nswitching conditions are not met by t = ts, ks will be\nincreased by H and the experiment or simulation will\nstart again.\n6. Discussion of swing-up control\nThe results of the swing-up control shown in Figure 4 are\nalmost identical to those in Mori's nonlinear optimal\nswing-up control.4 Mori's approach uses a bang-bang\ntype feed-forward control, this is very sensitive to\nchanges of the parameter values, the experiment\nconditions, and noise. Also the recovery can be difficult,\nas the system might not be at the desired state at the end\nof the preset control sequence. On the other hand, the\napproach in this paper uses a linear feedback control\nequation (7). which does not require detailed knowledge\nof the system. As the system is switched at a state near\nthe equilibrium, the whole control is smooth and reliable.\nTherefore, the proposed swing-up control approach is\nsimple and robust.\nBased on a rotating-arm balancing inverted pendulum\nsystem. Furuta's approach used a feedback control3\"6 and\nwas therefore more robust than Mori's approach.\nHowever, as it was still of the bang-bang type, the result\nwas not as smooth as the result of the approach\npresented in this paper. Furthermore, Furuta's approach\nwas not as simple as that presented in this paper.\nBecause the switching of the bang-bang control was\nPendulum Angle (degree)\n-120 0.2 0.4 0.6 0.8 1 1.2 f.4 1.6\nTime: 0 - 2 seconds\n1.8\nFig. 5. Complete responses of the carriage balancing single\ninverted pendulum system.\n4 5 6 7\nTime: 0 -10 seconds\n10\nFig. 6. Complete initialisation process.\nInverted pendulum systems 401\nx(0)\n-fO\nInitialisation\n0 165 0],\nix, ti, h, 11, fc\/i\n* , = 0,\nk,=k,+H\nt = 0\nWait till \/ - r , Experiment orSimulation\nSwitching to the full-\nstate feedback control\nFig. 7. The Algorithm of the swing-up control.\nbased on the phase plane of (dw). knowledge of the\nsystem parameter values was requried in Furuta\"s\napproach. Finally unlike CBSP systems, rail length is not\nan issue in the rotating-arm type of inverted pendulum\nsystem.\nPART II: DOUBLE INVERTED PENDULUM\nSYSTEM\n\/. Introduction\nExcept for the case of swing-up control.4\"6 nearly all\nprevious theoretical and'experimental studies of inverted\npendulum systems have been based on linear analyses.\nAll reported double pendulum systems, such as.yul have\nbeen single-input systems. The only two MIMO\n(multi-input multi-output) pendulum systems were both\ntriple pendulum systems.\"12 Although these two systems\nwere able to achieve nonlinear pendulum position\ncontrol, they were both limited to small perturbations\nfrom the vertical equilibrium position, and so were\nessentially examples of linear control systems.\nThe failure to extend inverted pendulum system\nstudies into large amplitude, nonlinear regions is mainly\ndue to the fact that a nonlinear unstable pendulum\nsystem is extremely difficult to balance and control.\nFurthermore, at interactive MIMO pendulum system\nalso requires decoupling. With the uncertainties of\nmodelling error and noise, decoupling is difficult, even in\nlinear unstable systems.\nIn nonlinear MIMO double pendulum systems, a\nchallenging control object is to swing-up the double\npendulum from its natural pendent position to the\ninverted position. As these systems are nonlinear,\nopen-loop unstable, nonminimum-phase. and interactive,\nit is impossible to achieve swing-up control by using a\nlinear full-state feedback control law. As a result,\nswing-up control of double pendulum system has not\nbeen studied previously in the literature.\nFor nonlinear, open-loop unstable, and interacting\nMIMO systems, full-state feedback is not always the best\nsolution. In fact, by a suitable partitioning of the\nstate-space, it is possible to achieve several control\nobjectives. Indeed, a new controller design strategy\nbased on a selective partial-state feedback control\napproach is presented in this paper. A special feature of\nthe approach is that it can actively decouple and linearise\ninteracting nonlinear unstable MIMO systems. Further-\nmore, as the partial-state feedback control itself is linear,\nlinear control theory can be used for system analysis and\ncontroller design.\nBased on both the partial-state feedback control and\nthe single pendulum swing-up control presented in Part I,\nthe swing-up control of a double pendulum system is\nachieved successfully in this study. The theoretical\nstudies and simulations in this paper show that the once\ncomplicated control problem, which is associated with\nnonlinearity and interaction, is solved in a simple and\neasy manner. Unlike conventional linearisation and\ndecoupling which are associated with fixed operating\npoints, the double pendulum is actively linearised and\ndecoupled about its neutrally stable equilibrium\" by the\npartial-state feedback control. This makes the double\npendulum swing-up control very reliable and robust.\n2. Selective partial-state feedback control\nTo date, the most common procedure for stabilising and\ncontrolling a nonlinear unstable MIMO system is: (1)\nlinearise the system at its operating point which must be\nan equilibrium state of the system. (2) decouple,\nstabilise, and control the linearised system by using\nfull-state feedback, and (3) use the resulting linear\ncontroller to control the original nonlinear system\naround the operating point. As linear control theory has\nbeen well developed, the above procedure often works\nsuccessfully.\nThere are three major disadvantages of the above\nprocedure which are now discussed,\n(i) The resulting linear controller can only stabilise the\nnonlinear system around the operating point. To\ncover a wide range of the state-space, the system has\nto be linearised at several operating points. Also the\nlinear controller design has to be carried out at each\noperating point. When the system works over large\nregions of the state-space, the number of required\noperating points increase sharply,\n(ii) The decoupling control is based on the linearised\nmodel of the nonlinear system, and is therefore very\nsensitive to the system's modelling error and noise.\nMoreover, unwanted steady-state errors are intro-\nduced when the system is stabilised between the\noperating points.\n402 Inverted pendulum systems\n(iii) The idea of \"stability\" and \"full-state feedback\"\nhave greatly restricted the search for better control,\nas control engineers are used to think in these\nterms. For example, the first double pendulum\nsystem was built more than 30 years ago in 1963.1* its\ncontrol system was designed using a linearised\nmodel and full-state feedback. Moreover, there has\nbeen no significant progress in the control of double\npendulum systems since.\nA system is defined as unstable if some of its output\nincrease without a boundary or outside a preset\nboundary when time tends to infinity. However, many\nreal controls are only required temporarily, such as\nthe initialisation of an inverted pendulum. By using\nthe concept of BIBS (bounded-input bounded-state)\nstability.\" the behaviour of those unstable outputs is\noften well understood and predictable. For a nonlinear\nunstable MIMO system with some equilibrium positions,\ninstead of linearising and decoupling the nonlinear\nsystem around some operating points, partial-state\nfeedback could be used directly to decouple, linearise,\nand stabilise the system at the equilibrium. A nonlinear,\nunstable, and interactive MIMO system with linear\nsub-state xt and nonlinear sub-state x,, can be expressed\nin the partitioned state-space form\n[ x 1 f fix x u u ) 1\nxj Lfll(Xi.xl,,u,.ul,)\\\nwhere u, is the control of x, and u,, is the control of x,,. If\nequation (&) has a neutrally stable equilibrium [xu. x,,e]T,\nthen it is possible to find a partial-state feedback\nun = rH-KnxH (9)\nto stabilise the subsystem of x,, at xm. In equation (9).\nr\n,< =f(xlie) is the reference input, and Kn is the controller\nconstant matrix. Once the subsystem is stabilised at xm.\nby u,,, there is no movement within the subsystem.\nTherefore the nonlinear subsystem is effectively linear-\nised at x,,,., and it can be described by a reduced order\nstate x,t. To stabilise the whole system, another\npartial-state feedback\n= ri- K,x, - rln (10)\nis required, where r, =f(xu.) is the reference input. K, is\nthe controller constant matrix of x,, Ku, is the controller\nconstant matrix of xlh and r,,,=f(xlu.) is to compensate\nfor the effect of .r,, on x,,. As the position control of .v,, is\nachieved by u,,, and the position control of .v, is achieved\nby u,, the nonlinear system expressed in equation (8) is\neffectively decoupled, linearised, and stabilised. The\noverall control u of equation (8) is\n' (11)\ni\/,,J L rn-Kl,xll J\n3. Double pendulum system\nA nonlinear double pendulum system is shown in Figure\n8. The carriage has mass Mc and translational friction\ncoefficient kr. The lower pendulum has mass MpK, length\nLpl, and rotational friction coefficient k,tl at the pivot O.\nThe higher pendulum has mass Mp2, length Lp2, and\nrotational friction coefficient k,,z at the joint between the\npendulums. There are two control inputs: a horizontal\nforce U on the carriage, and a torque T between the\npendulums.\nThe coordinates of the system are the carriage position\nAY. the lower pendulum angle 9, and the higher\npendulum angle \/3. By using Lagrange's equations, the\nsystem's nonlinear equations of motion can be expressed\nin the form\nf MA\\. + P\\ cos (9)9 + P2 cos (j3)\/3\n= U- kX + Pi sin (9)6: + P2 sin (j3)\/3:\nP, cos (0).v, + 2P}'6 + P4cos (]8 - 6)P\n=-T - (knl + k,,2)e + k,,20\nP2 cos (\/3 ).\\\\. + Pi cos 03-9)9 + 2P}J3\n= T + k,l29 - k,,2p - PA sin (\/3 - 9)92 + P2g sin i\n(12)\nwhere\nM = M, + Mpl + Mp2\n\/>, = (0.5\/W,,, + Mp2)Lpl\nP2 = 0.5Mp2Lp2\nP:, = (MpJ6 + 0.5Mp2)L\nPA = 0.5Mp2LrlL,,2\nP, = Mp2L:p2\/6\nFig. 8. Nonlinear double pendulum system.\nSetting A\\. = A\\. = 9 = '8 = \/? = $ = 0, the equilibrium of\nequation (12) is determined by\n(13)\nwhere Ue and Tf are the required controls to achieve the\nequilibrium. 9, and j3e are the equilibrium pendulum\nangles. Equation (13) is very important in any double\npendulum system study, as it shows that: (1) the\nequilibrium can occur at an arbitrary AY. therefore the\ncarriage position control can be achieved: (2) as there is\nonly one equation governing 0,, and \/?,., one of the\nInverted pendulum systems 403\npendulums can be positioned at an arbitrary angle,\nhowever the other pendulum must meet equation (13) to\nkeep both of the pendulums balanced: and (3) a nonzero\nsteady-state torque Te is required to keep the pendulums\nat the required angles. Equation (13) defines a neutrally\nstable equilibrium, as the carriage position and one of\nthe pendulum angles can be arbitrary. It can be seen\nfrom Figure 8 that the maximum moment of the higher\npendulum about O occurs at j3 = -90°. Further, it can be\nseen from equation (13) that, in order to balance the\npendulums, the maximum lower pendulum angle is\n(14)\nwhich is defined by the pendulums' lengths and masses.\nIt follows from equations (12) and (13). in order to\nachieve the full 360° angle pendulum control, that\n(0.5Mp] + Mp2)Lrl 1 (15)\nFor demonstration purposes, the following values\nare assigned to the system parameters: Mt = 0.5 kg.\nk,. = 3.8 [Ns\/m]. M,,, =0.1 kg. L,,, = 0.25 m. A:,,, =\n0.002 [Nms\/Rad]. M,r = 0.1 ke. Lr = 0.25 m. A> =\n0.002 [Nms\/Rad]. and g = 9.8 [mis1].\n4. Swing-up control\nThe natural behaviour of the nonlinear double pendulum\nsystem can be computed and observed from equation\n(12) by setting U = T = 0 and x(0) = [0 0 10° 0 10° O]7\",\nas shown in Figure 9. The carriage and the pendulums all\nperform damped nonlinear vibrations. At the beginning\nthe two pendulums vibrate differently, therefore the\ninteraction between the pendulums makes the system's\nmotion complicated. However, the pendulums tend to\nvibrate at the same circular frequency, and the vibrations\nare towards the stable equilibrium (0 = 180° \/3 = 180°).\nThe system's responses are much smoother when the\npendulums vibrate at the same frequency.\nClearly, in order to swing-up the two pendulums, the\nhigher pendulum has to follow the lower pendulum as it\nswings up towards the inverted vertical. Therefore, the\nangle (\/3 - 8) between the pendulums has to be\ncontrolled. Because (1) the pendulum system's state-\nvariables can be partitioned as\nA\\ , = [9 6 (16)\nand (2) there is a neutrally stable equilibrium described\nby equation (13). the partial-state feedback expressed in\nequation (9) exists in the double pendulum system with\n#•„ = Trs.K,, = [-K,, -Ky Kp KY], and u,, = Tr.'where\nBy substituting equation (17) into equation (12). the\nnonlinear system's steady-state responses under the\npartial-state feedback are given by\nP, sin (0) + A sin (ft) = 0 (IS)\nComparison of equations (13) and (18) shows that Tr\ncan balance the pendulums at the equilibrium angles 0,.\nand ft.. Therefore, the angle between the pendulums is\ncontrolled, and the whole nonlinear system is both\nlinearised and decoupled actively. For example, by\nsetting K0 = 10. Kv = 5. and 9, = 10c. it follows from\nequation (IS) that ft. = -31.40° and Tr= -7.162. If the\nnonlinear system described by equation (12) is released\nfrom .v(0) = [ 0 0 0 0 10c 0]' . ' with U = 0 and T = 7\",, the\nsystem's time responses can be computed and are shown\nin Figure 10. Although the pendulums vibrate towards\nthe stable equilibrium (0,. + 180° ft. + 180°). the angle\n(13 - 9) between the pendulums is balanced at\n(ft. - 9C) = -41.40°. With the control Tr. the double\npendulum can be safely regarded as an equivalent single\npendulum, which can be described by the lower\npendulum's state xtl = [9 9]T.\nObviously, for the swing-up control of the double\npendulum system, in equation (17) 9C = 0. and therefore\nit follows from equation (18) that ft. = Tr = 0. Moreover,\nfrom the single pendulum swing-up control presented in\nCarriage Position\n3 4 5 6 7\nPendulum Angles (degree)\n4 5 6 7\nTime: 0-10 seconds\n10\nFig. 9. Natural behaviour of the pendulum system.\nPendulum Angles (degree)\n•40 L\n1 : 3 4 5 6 7\nAngle between the Pendulums (degree)\n10\np-e\n4 5 6 7\nTime: 0-10 seconds\nFig. 10. Angle control between the pendulums.\n404 Inverted pendulum systems\nPart I (Section 3), it can be seen that the control Us to\nswing-up the double pendulum is\n(19)\nwhere Ks is the controller constant, and Umax is the\nmaximum force. Obviously, Ux is a positive partial-state\nfeedback. The swing-up control tuning process described\nin Part I (Section 4) gives the result that Ks = 4.\\ and\nUmux = 10.6 N. Substitution of equations (17) and (19)\ninto equation (12) gives the swing-up control of the\ndouble pendulum system which has been computed and\nis shown in Figure 11.\nAs shown in Figure 11, both of the pendulums are\nswung-up from (around) the pendent vertical to near the\ninverted vertical. The best switching time is at ts = 2.07 s\nwith 0(0=11.03° and ^ ( O = 10.78°. Therefore, the\noriginally nonlinear swing-up control of the double\npendulum system has been successfully achieved by using\ntwo simple linear partial-state feedback control laws\nsimultaneously.\n5. Stabilisation of the system\nFollowing the discussion in Section 2, after the swing-up\ncontrol has been accomplished, the whole system can be\nstabilised by using equation (17) and another partial-\nstate feedback Uh\nUh = Ur- Kxxc - KJC - Kg6 - Kj (20)\nwhere Kx, Kv, Kg, and Kw are the controller constants,\nUr is the reference input. The purpose of Ur is to effect\nthe desired carriage and pendulum positions in the\nsteady state. It can be deduced by consideration of the\nsteady state behaviour of the system obtained when\nU = Uh in equation (12). Thus\nU, = Kxxr + Ke6r (21)\nwhere xr is the commanded carriage position and 6r is the\ncommanded lower pendulum angle. In equation (21)\nKg6r is for removing the interaction from the double\npendulum to the carriage. Comparing equations (20) and\n(21) with equation (10). it can be seen that K, = [Kx Kv),\nKM = [KB K J . r, = Kxxr, and r,n = Kedr As the non-\nlinear double pendulum system is dynamically converted\ninto an equivalent linear single pendulum system by Tp,\nthe controller constants of equation (20) can be obtained\nby following the design procedure of the single pendulum\nsystem in Section 2 (Part I). The equivalent single\npendulum has the parameters Mp = 0.2 kg, L,, = 0.5 m,\nand k,, = 0.002 [Nms\/Rad]. Setting Q = I and R = 0.01 in\nthe LQR design,8 the controller constants are obtained\nas\n# , = [-10 -19.96] KM = [-78.74 -17.20J (22)\nUsing the partial-state, feedback equations (17) and\n(20) together, asymptotically stable nonlinear position\ncontrol of the double pendulum system can be achieved.\nBy switching the control from equations (17) and (19) to\nequations (17) and' (20) at \/, = 2.07 s, the double\npendulum system is initialised and then stabilised, as\nshown in Figure 12.\nSupported by the robust partial-state feedback control\napproach, the swing-up control can also be achieved with\nan angle between the pendulums. With 0r=lO°,\n\/3,=-31.40°, 7; =-7.162, ATV = 4.1, and £\/max=10.3N,\nthe partial-state feedback equations (17) and (19) can\nswing-up the pendulums towards 6r and jSr from\n0(0) = \/3(0) = 180°. The best switching time is found at\nr, = 1.606 s, with jct.(O = - 0 . 8 m, 0 ( 0 = 24.69°, and\n\/3(O = -14.87°. Afterwards, with xr = Q and Ur=-\n13.74, equations (17) and (20) can stabilise the whole\nsystem at the required positions: xr = 0, 0r = 10°, and\n\/3r ~ -31.40°. The complete swing-up control is shown in\nFigure 13. The large angle \/3r - 6, = -41.40° is achieved\nand kept throughout the whole initialisation process.\nPART III: CONCLUSION\nA practical and robust swing-up control approach is\npresented in Part I. The robust approach gives a smooth\nperformance, and is able to bring a pendulum up from its\nCarriage Position\nI 1.5\nPendulum Angles (degree)\nCarriage Position\n1 1.5\nTime: 0 - 2.5 seconds\n2 3 4 5\nPendulum Angles (degree)\n2 3 4\nTime: 0-7 seconds\nFig. 11. Swinging-up the pendulums. Fig. 12. Repositioning the double pendulum system.\nInverted pendulum systems\nCarriage Position\n3 4 5 6 7\nPendulum Angles (degree)\n10\n3 4 5 6 7\nTime: 0 - 1 0 seconds\n10\nFig. 13. Pendulum control with a large angle.\nnatural pendent position and balance it in the inverted\nposition. It works for all CBSIP systems regardless of the\nparameter values. The principle employed in the\napproach can be used to swing-up a double or triple\npendulum. Furthermore, the principle can also be\napplied to new kinds of artificial intelligent machines.7\nAs presented in Part II, the selective partial-state\nfeedback control approach has been proved extremely\nsuccessful in the nonlinear, unstable, and interactive\ndouble pendulum system. It can also be applied to triple\npendulum systems for both swing-up control and\nnonlinear pendulum position control. Indeed, partial-\nstate feedback control can be applied with advantage to a\nwide range of nonlinear, unstable systems. All that is\nrequired is that the system equations can be partitioned\nas in equation (8). Many machines and processes are\ngoverned by such equations. In particular, many\n405\ndynamical models used in the study of legged robots2\"1\nare governed by partitionable, nonlinear systems of\nequations.\nReferences\n1. J. Shao, \"Dynamics & Nonlinear Control of Unstable\nInverted Pendulum Systems\" PhD Thesis (Engineering\nDepartment of Lancaster University, Britain, 1995).\n2. D.J. Todd, Walking Machines-an Introduction to Legged\nRobots (Kogan Page Ltd, London, 1985).\n3. M.H. Raibert, Legged Robots that Balance (The MIT Press.\nLondon, 1986).\n4. S. Mori, H. Nishihara and K. Furuta, \"Control of Unstable\nMechanical System, Control of Pendulum\" Int. J. Control\n23, No. 5, 673-692 (1976).\n5. K. Furuta, M. Yamakita and S. Kobayashi, \"Swing Up\nControl of Inverted Pendulum\" IECON\"9\/ (1991) pp.\n2193-2198.\n6. K. Furuta, M. Yamakita, S. Kobayashi and M. Nishimura\n\"A New Inverted Pendulum Apparatus for Education\"\nIF AC Advances in Control Education, Massachusetts,\nUSA (1991) pp. 133-138.\n7. A. Bradshaw, D.W. Seward and F.N. Nagy \"Robo Sapiens:\na Personal Assistant Robot\" Proc. of Joint Hungarian-\nBritish Mechatronks Conf., Budapest, (Sept. 1994) pp.\n159-164.\n8. W.L. Brogan Modern Control Theory (Prentice-Hall, New\nJersey, 1991).\n9. D.T. Higdon and R.H. Cannon \"On the Control of\nUnstable Multiple-Output Mechanical Systems\" ASME\nWinter Annual Meeting, Philadelphia (November, 1963)\npaper No. 63-WA-148.\n10. K. Furuta, H. Kajiwara and K. Kosuge \"Digital Control of\na Double Inverted Pendulum on an Inclined Rail\" Int. J.\nControl 32, No. 5. 907-924 (1980).\n11. K. Furuta, T. Ochiai and N. Ono \"Attitude Control of a\nTriple Inverted Pendulum\" Int. J. Control 39, No. 6,\n1351-1365(1984).\n12. H.M.Z. Farwig and H. Unbenauen \"Discrete Computer\nControl of a Triple Inverted Pendulum\" Optimal Control\nApplications and Methods 11, 157-171 (1990).\n"}