{"doi":"10.1080\/17516230903027898","coreId":"95483","oai":"oai:eprints.lse.ac.uk:24978","identifiers":["oai:eprints.lse.ac.uk:24978","10.1080\/17516230903027898"],"title":"Drivers of housing choice among rural-to-urban migrants: evidence from Taiyuan","authors":["Li, Bingqin","Duda, Mark","An, Xiangsheng"],"enrichments":{"references":[{"id":17244086,"title":"20. Spatial Spread of Daily Activity Patterns of Slum Dwellers in Calcutta and Delhi, The Asian City: Processes of Development, Characteristics, and Planning.","authors":[],"date":"1994","doi":"10.1007\/978-94-011-1002-0_20","raw":"Dutt, A. K., Tripathi, S. and Mukhopadhyay, A. (1994) 20. Spatial Spread of Daily Activity Patterns of Slum Dwellers in Calcutta and Delhi, The Asian City: Processes of Development, Characteristics, and Planning.","cites":null},{"id":17244088,"title":"A room of one’s own: housing consumption and residential crowding in transitional urban China, Environment and Planning","authors":[],"date":"2003","doi":"10.1068\/a35119","raw":"Huang, Y. (2003) A room of one’s own: housing consumption and residential crowding in transitional urban China, Environment and Planning A, 35, 591-614.","cites":null},{"id":17244100,"title":"China’s floating population and their settlement intention in the cities: Beyond the hukou reform.","authors":[],"date":"2007","doi":"10.1016\/j.habitatint.2006.04.002","raw":"Zhu, Y. (2007) China’s floating population and their settlement intention in the cities: Beyond the hukou reform. Habitat International, 31, 65–76.","cites":null},{"id":17244091,"title":"Housing inequality and housing poverty in urban China in the late 1990s.","authors":[],"date":"2006","doi":"10.1016\/j.chieco.2004.09.005","raw":"Sato, H. (2006) Housing inequality and housing poverty in urban China in the late 1990s. China Economic Review 17(1): 37-50.","cites":null},{"id":17244085,"title":"Housing Inequality in Chinese Cities--How Important is Hukou?, Landlines,","authors":[],"date":"2008","doi":null,"raw":"Duda, M. and Li, B. (2008) Housing Inequality in Chinese Cities--How Important is Hukou?, Landlines, LLA080104, 14-19. Duda, M., Li, B. and H. Peng (forthcoming) Household Strategies and Migrant Housing Quality in Tianjin, In Migration and Social Protection in China, Vol. forthcoming. (Ed, Smyth, R.) Chandos Publishing, Oxford.","cites":null},{"id":17244090,"title":"Housing Inequality in Transitional Beijing,","authors":[],"date":"2007","doi":"10.1111\/j.1468-2427.2009.00890.x","raw":"Huang, Y. and Jiang, L. (2007) Housing Inequality in Transitional Beijing, In International Conference on China's urban Transition and City Planning Cardiff, Wales, UK, Li, B., Duda, M. and Peng, H. (2007) Low-Cost Urban Housing Markets--Serving the Needs of Low-Wage Rural-Urban Migrants? Lincoln Institute of Land Policy, Working paper: WP07MD1, Ministry of Construction PRC (2005) Guidelines on issues related to the management of Housing Provident Funds (guanyu zhufang gongjijin guanli ruogan juti wenti de zhidao yijian), Vol. Jianjinguan [2005] No. 5. (Ed, Office of the State Council PRC).","cites":null},{"id":17244093,"title":"Housing rural migrants in China’s urbanizing villages,","authors":[],"date":"2007","doi":null,"raw":"Song, Y. (2007) Housing rural migrants in China’s urbanizing villages, Land Lines 19, 2-7.","cites":null},{"id":17244089,"title":"Housing Tenure Choice in Transitional Urban China: A Multilevel Analysis,","authors":[],"date":"2002","doi":"10.1080\/00420980220099041","raw":"Huang, Y. and Clark, W. A. V. (2002) Housing Tenure Choice in Transitional Urban China: A Multilevel Analysis, Urban Studies 39, 7-32.","cites":null},{"id":17244098,"title":"Lack of rural-urban migrants' participation led to unenthusiastic responses to public housing for rural-urban migrants (nongmingong gongyu lengchang yuanyu quefa canyu jizhi),","authors":[],"date":"2006","doi":null,"raw":"Xiao, J. A. (2006) Lack of rural-urban migrants' participation led to unenthusiastic responses to public housing for rural-urban migrants (nongmingong gongyu lengchang yuanyu quefa canyu jizhi), In New Beijing Daily (Xin Jing Bao)Beijing, Zhu, Y. (2003) The floating population's household strategy and the migration's role in China's regional development and integration, International Journal of Population Geography, 9, 485–502.","cites":null},{"id":17244095,"title":"Migrant housing in urban China - Choices and constraints,","authors":[],"date":"2002","doi":"10.1177\/107808702401097817","raw":"Wu, W. (2002) Migrant housing in urban China - Choices and constraints, Urban Affairs Review, 38, 90-119.","cites":null},{"id":17244097,"title":"Migrant Intra-urban Residential Mobility in Urban China,","authors":[],"date":"2006","doi":"10.1080\/02673030600807506","raw":"Wu, W. (2006) Migrant Intra-urban Residential Mobility in Urban China, Housing Studies, 21, 745-765.","cites":null},{"id":17244094,"title":"Migrant workers' home&quot; is set up in our city (woshi chengli &quot;nongmingong zhijia&quot;),","authors":[],"date":"2007","doi":null,"raw":"Taiyuan Government (2007) &quot;Migrant workers' home&quot; is set up in our city (woshi chengli &quot;nongmingong zhijia&quot;), http:\/\/www.taiyuan.gov.cn\/?sj=88715.","cites":null},{"id":17244087,"title":"Migration and social structure: Analytic issues and comparative perspectives in developing nations,","authors":[],"date":"1987","doi":"10.1007\/bf01124380","raw":"Goldscheider, C. (1987) Migration and social structure: Analytic issues and comparative perspectives in developing nations, Sociological Forum, 2, 674-696.","cites":null},{"id":17244082,"title":"Rural Survey Team","authors":[],"date":"2005","doi":null,"raw":"China Rural Survey Team (2005) The number, structure and characteristics of farmers leaving their villages to work in 2004 (2004 nian nongmin waichu wugong de shuliang, jiegou ji tedian), China 3F information net, http:\/\/www.sannong.gov.cn\/fxyc\/ldlzy\/200507110158.htm.","cites":null},{"id":17244083,"title":"Slums and Squatter Areas as Entrepots for Rural-Urban Migrants in a Less Developed Society,","authors":[],"date":"1987","doi":"10.2307\/2578748","raw":"Costello, M. A. (1987) Slums and Squatter Areas as Entrepots for Rural-Urban Migrants in a Less Developed Society, Social Forces, 66, 427-445.","cites":null},{"id":17244096,"title":"Sources of migrant housing disadvantage in urban China,","authors":[],"date":"2004","doi":"10.1068\/a36193","raw":"Wu, W. (2004) Sources of migrant housing disadvantage in urban China, Environment and Planning A, 36, 1285-1304.","cites":null},{"id":17244092,"title":"The 21st century health challenge of slums and cities,","authors":[],"date":"2005","doi":"10.1016\/s0140-6736(05)71049-7","raw":"Sclar, E. D., Garau, P. and Carolini, G. (2005) The 21st century health challenge of slums and cities, The Lancet, 365, 901-903.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-07","abstract":"Policies addressing the influx of rural migrants into Chinese urban areas have evolved over time from active opposition, through suspicious ambivalence, to wary tolerance, and now seem to have entered a new phase in which productive engagement is being attempted. Unfortunately, little information or experience is available to inform policy development in this new era. This paper helps address this knowledge gap by studying housing behaviour and choices among a sample of migrants in Taiyuan. The study's results suggest that migrants' housing outcomes in urban areas are influenced heavily by priorities linked to the transitional economic environment and individual migration characteristics. The analysis finds a more limited role for factors such as income and life cycle, which are central to housing choice in other contexts. We argue that migrants' housing outcomes cannot be explained without reference to the specific set of challenges they face, and the resulting decisions that they make, as a result of their immersion in the country's economic transition","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/95483.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/24978\/1\/Drivers_of_housing_choice_among_rural_to_urban_migrants%28LSERO_version%29.pdf","pdfHashValue":"10fecaa0224e2f1cad2f1f18e914b1d96987d4a7","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:24978<\/identifier><datestamp>\n      2010-10-01T09:26:37Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5341<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/24978\/<\/dc:relation><dc:title>\n        Drivers of housing choice among rural-to-urban migrants: evidence from Taiyuan<\/dc:title><dc:creator>\n        Li, Bingqin<\/dc:creator><dc:creator>\n        Duda, Mark<\/dc:creator><dc:creator>\n        An, Xiangsheng<\/dc:creator><dc:subject>\n        HM Sociology<\/dc:subject><dc:description>\n        Policies addressing the influx of rural migrants into Chinese urban areas have evolved over time from active opposition, through suspicious ambivalence, to wary tolerance, and now seem to have entered a new phase in which productive engagement is being attempted. Unfortunately, little information or experience is available to inform policy development in this new era. This paper helps address this knowledge gap by studying housing behaviour and choices among a sample of migrants in Taiyuan. The study's results suggest that migrants' housing outcomes in urban areas are influenced heavily by priorities linked to the transitional economic environment and individual migration characteristics. The analysis finds a more limited role for factors such as income and life cycle, which are central to housing choice in other contexts. We argue that migrants' housing outcomes cannot be explained without reference to the specific set of challenges they face, and the resulting decisions that they make, as a result of their immersion in the country's economic transition.<\/dc:description><dc:publisher>\n        Routledge<\/dc:publisher><dc:date>\n        2009-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/24978\/1\/Drivers_of_housing_choice_among_rural_to_urban_migrants%28LSERO_version%29.pdf<\/dc:identifier><dc:identifier>\n          Li, Bingqin and Duda, Mark and An, Xiangsheng  (2009) Drivers of housing choice among rural-to-urban migrants: evidence from Taiyuan.  Journal of Asian Public Policy, 2 (2).  pp. 142-156.  ISSN 1751-6242     <\/dc:identifier><dc:relation>\n        http:\/\/www.tandf.co.uk\/journals\/titles\/17516234.asp<\/dc:relation><dc:relation>\n        10.1080\/17516230903027898<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/24978\/","http:\/\/www.tandf.co.uk\/journals\/titles\/17516234.asp","10.1080\/17516230903027898"],"year":2009,"topics":["HM Sociology"],"subject":["Article","PeerReviewed"],"fullText":"  \nBingqin Li, Mark Duda, and Xiangsheng An \nDrivers of housing choice among rural-to-\nurban migrants: Evidence from Taiyuan \n \nArticle (Accepted version) \n(Unrefereed) \nOriginal citation: \nLi, Bingqin and Duda, Mark and An, Xiangsheng (2009) Drivers of housing choice among rural-\nto-urban migrants: evidence from Taiyuan. Journal of Asian public policy, 2 (2). pp. 142-156. \nISSN 1751-6242 \n \nDOI: 10.1080\/17516230903027898\n \n© 2009 Routledge\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/24978\/\n \nAvailable in LSE Research Online: February 2011 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \nDrivers of housing choice among rural-to-urban migrants: Evidence from Taiyuan1 \n \nBingqin Li, Mark Duda, and Xiangsheng An \n \n \n \nAbstract \n \nPolicies addressing the influx of rural migrants into Chinese urban areas have evolved \nover time from active opposition, through suspicious ambivalence, to wary tolerance, and \nnow seem to have entered a new phase in which productive engagement is being \nattempted. Unfortunately, little information or experience is available to inform policy \ndevelopment in this new era. This paper helps address this knowledge gap by studying \nhousing behaviour and choices among a sample of migrants in Taiyuan. The study’s \nresults suggest that migrants’ housing outcomes in urban areas are influenced heavily by \npriorities linked to the transitional economic environment and individual migration \ncharacteristics. The analysis finds a more limited role for factors such as income and life \ncycle, which are central to housing choice in other contexts. We argue that migrants’ \nhousing outcomes cannot be explained without reference to the specific set of challenges \nthey face, and the resulting decisions that they make, as a result of their immersion in the \ncountry’s economic transition. \n \nKey Words: Chinese cities, migration, housing policy \n \n \n \nIntroduction \nBy the 1990s, strong urban labour demand, vast disparities in rural and urban incomes, \nand widespread rural under-employment had combined to put a de facto end to China’s \nregime of strict domestic mobility controls. The resulting internal migration has been the \ndriving force behind the country’s rapid urbanization, which has now reached 43.0 \npercent, up from 19.6 percent in 1980 and projected to exceed 70.0 percent in 2050. The \nmajority of future increases will continue to be driven by migration rather than natural \nincrease. \nRapid, migration-driven urbanization has placed enormous strain on Chinese cities. \nUrban officials complain that migration has stretched physical infrastructure, social \nwelfare programs, and administrative capacity to the breaking point. Yet, these same \nofficials have been under intense pressure to facilitate economic growth, among other \nthings by ensuring the availability of a pool of low-cost labour. Over time, this reality has \nresulted in a shift away from rules designed to prevent migrants from living legally in \n                                                 \n1 This study was funded by a grant from the Suntory and Toyota International Centres for Economics and \nRelated Disciplines (STICERD) at LSE and builds directly upon earlier work funded by the Lincoln \nInstitute of Land Policy.  \n 2\ncities. Recently, some cities have begun experimenting with various measures intended to \nhelp migrants to settle in during their spells of urban employment. \nIn the housing sector, this has meant a shift (albeit not a wholesale shift) away from the \ndemolition of so-called ‘urban villages’ (chengzhongcun) and the decline of institutional \nmechanisms that formerly denied migrants access to urban housing. Going further, some \ncities have begun offering migrants access to housing finance and saving schemes \n(Ministry of Construction PRC 2005), though the extent to which these actually meet the \nneeds of migrants is debatable. Other cities have taken a different tack, intervening in the \nlow-cost rental market by building dormitories specifically for migrants and leasing them \nat nominal rates (Xiao 2006, Song 2007).  \nThat even these latter policies – interventions in the low-cost rental market where many \nmigrants find housing - have largely failed reflects the fact that policy development and \nimplementation to date has taken place without the input of migrants themselves and \nwithout any grounding in policy-driven empirical research into the sources of migrant \nhousing behaviour and preferences. Policymakers remain poorly informed about the type \nof interventions that could help integrate migrants into urban life and\/or deal with the \nhousing pressure posed by extremely rapid, migration-driven urbanization (Duda and Li, \n2008).  \nThe goal of this paper is to inform policymaking by providing information about the \nhousing needs and preferences of low-income migrants, and the factors that drive their \ndecision-making. The paper argues that these differ from the standard life cycle and \neconomic explanations due to the pervasive influence that the transition context has on \nmigrants’ livelihoods. Fieldwork took place in 2007 in Taiyuan, the capital of Shanxi \nProvince where, up to that point, the state had not intervened in the provision of housing \nfor migrant workers. Taiyuan therefore presents an example of ‘organic’ housing market \ndevelopment for rural to urban migrants.  \nHousing choice among rural migrants in Chinese cities \nStudies in various countries have found that migrants tend to occupy less desirable \nhousing than urban natives (e.g., Goldscheider 1987, Dutt et al. 1994, Costello 1987, \nSclar et al. 2005). This phenomenon has been consistently documented in China as well \n(Huang and Clark 2002, Wu 2002, Wu 2004, Huang 2003, Huang and Jiang 2007). \nSeveral Chinese studies have attempted to ascertain what factors explain these \ndifferences.  \n \nPerhaps the most prominent of the proposed explanations is institutionalised disadvantage \nlinked to the hukou (urban household registration system), which Huang and Jiang (2007) \ncall the ‘hukou inequality hypothesis.’ That study considers tenure choice in Beijing \nusing data from 1995 and 2000, and finds that, relative to permanent urban residents, \nmigrants with temporary, rural hukou status are significantly less likely to own privatized \npublic housing and significantly more likely to end up in private rentals or the ‘other’ \ncategory, but not less likely to own private housing. \n \n 3\nAnother study from this perspective is that by Wu (2004), who models tenure choice of \nmigrants (both with and without local hukou) and urban natives in Beijing and Shanghai. \nShe finds that having local hukou (i.e., being a non-migrant) substantially increases the \nodds of being a homeowner. Similarly, in a national sample Huang and Clark (2002) find \nthat, when other relevant factors are controlled, households without permanent residency \nare 78 percent less likely to own homes than those with local residency.  \n \nHuang’s (2003) study looks at renters. She points out that because of the legacy of hukou \nsystem, migrant renters in the 1990s did not have access to urban subsidized rental \nhousing and were therefore disadvantaged relative to urban citizens. She then argues that \nthis differential access to subsidized rentals explains observed differences in housing \nchoice and quality. Relatedly, Wu (2006) shows that having a rural hukou increases \nmobility, but that migrants who have been able to find housing in public sector rentals \nhave lower mobility rates. \n \nIn additional to institutional factors, the research literature also suggests that migration \ncharacteristics can affect migrants’ housing choice. Wu (2004) used two variables to \nexamine the impact of migration on housing choice: duration of residence in city and plan \nto stay in city. She found that duration of residence is positively related to housing quality \nand plan to stay long term also improves housing quality and size. She concludes that \nmigrants make housing decisions based on whether or not they intend to settle in the \ncities, and argues that granting only temporary urban residence permits to migrants helps \nsteer them away from homeownership. \nBuilding on insights from these earlier studies, which are based on data gathered during \nthe 1990s, Duda and Li (2008) and Li, Duda, and Peng (forthcoming) have argued that, \nwhile important, the role that institutionalised disadvantage currently plays in causing \nhousing disparities among migrants and urban natives may be overstated in the research \nliterature. They suggest that other potentially important causal factors, such as cohort \neffects in housing attainment introduced by the privatization process and the intentionally \ntemporary nature of many migrant spells in the city (Zhu 2007, 2003) have been under-\nexamined. Ultimately, they argue that these other factors are important enough to drive \ndifferences in housing outcome between migrants and urban natives, even when the \nsocio-demographic determinants of housing choice are controlled and in the absence of \ninstitutional constraints.  \n‘Transition priorities’ and migrant housing behaviour  \nBuilding on the arguments in our earlier papers, in this paper we develop an explanation \nof migrants’ housing outcomes that is grounded in four ‘transition priorities.’ We use this \nterm to mean a set of preferences linked directly to China’s transitional economic \nenvironment, which drives much of the migration phenomenon itself. These ‘transition \npriorities’ reflect both migrants’ coping strategies in the face of enormous change and \nuncertainty about the future, and a recognition of the temporary nature of many \nopportunities they perceive. \n \n 4\nThe first transition priority concerns employment. Although there are other \nconsiderations involved, most migrants are pushed out of villages and pulled to cities by \nrural urban wage\/opportunity gaps. Further, once they land in the city they must earn \nmoney simply to survive, ensuring that employment swamps other concerns. As a result, \nmigrants tend to make certain types of combined housing-employment choices, such as \nliving in the housing offered by an employer, in order, for example, to maximize time \navailable for work.  \nThe second transition priority, seen among both recent and longer-term migrants, is a \nstrong savings orientation. This ‘savings priority’ is associated with household-level \nstrategies for diversifying risk across urban and rural income sources in the transitional \neconomic environment. This not only allows them to work in the city but consume in the \ncountry but is also a general response to the reality that economic transition has been \nexperienced by most rural people as a time of dramatically increased uncertainty. \nThe third priority is mobility. In pursuit of employment opportunities, migrants are \nmobile not only across jobs among different districts within a city, but also among \ndifferent cities, and between cities and rural areas. This ‘mobility priority’ affects \nmigrants’ propensity to buy homes and makes them unwilling to commit to long-term \nrental contracts, both of which tend to reduce the quality of the housing they occupy \nrelative to that of urban natives that are more connected to particular locations.  \nThe fourth priority is family life. When the family of a migrant worker joins him\/her in \nthe city, employer usually does not offer housing to the family members and workplace \nhousing is in any case typically unsuitable for families. Households that are initially split \nbetween rural and urban areas are thus must therefore consciously united only when it is \ndetermined that they can survive as a family in the city. Whether the family is separated \nor united, housing choices are highly attuned to and reflective of choices related to family \nsituation.  \nThese four transition priorities jointly influence housing decisions. All else equal, the \nemployment, savings, and mobility priorities suggest that migrants will place relatively \nlow value on housing quality and more emphasis on convenience and low cost. Because \nmany housing options open to single persons (including adult family members not \nresiding together) are unsuitable for couples or children, the family life priority indicates \nthat united families will experience housing outcomes more like urban natives with \nsimilar economic and demographic characteristics.   \nSeveral hypotheses can be developed based on the discussion of transition priorities. \nFirst, we would expect that employment will be closely linked to any and all housing \ndecisions made by migrants (employment priority). Second, we would expect that the \nassociation between income and housing choices will not be particularly strong (savings \npriority). Third, migrants will tend to live in housing linked to employment to the extent \nthat it is available (employment, savings, and mobility priorities). Fourth, migrant \nfamilies living together in the city will have made different housing choices than \nsimilarly situated single migrants (family life priority). The empirical analysis presented \n 5\nlater in the paper tests these hypotheses by examining the relationship between housing \nprovider\/cost and a series of independent variables. \n \nStudy site: Taiyuan, Shanxi \n \nThe empirical results in this paper are based on a survey conducted in May\/June of 2007 \nin Taiyuan, the capital of Shanxi Province (Figure 1A\/1B). Not counting migrants, \nTaiyuan has 3.15 million inhabitants, of which 2.30 million reside in the core urban area. \nOfficial estimates put the migrant population at about 300,000 (Taiyuan Government, \n2007). The city and suburbs together are comprised of six districts: Yingze, Xinghualing, \nWanbolin, Xiaodian, Jiancaoping and Jinyuan.  \n \nEconomically, Taiyuan is a commercial and industrial city known for heavy \nmanufacturing and for being a centre of the coal industry. It is one of the major heavy \nindustrial centres in China, dependent heavily on the resource sector. As such, it has \ngreatly benefited from very strong resource demand by the rapidly growing Chinese \neconomy. As the city has become wealthier, the service sector also grown and now \nattracts substantial numbers of migrants.  \n \nUnlike some cities, Taiyuan’s government has historically not intervened in the housing \nprovision for migrants.2 At the time of our interviews, there was effectively no \ngovernment housing policy that targeting migrants. As a result, the city presents an ideal \ntesting ground for the investigation of housing preferences and behaviour of migrants in \ntransitional China in the absence of policies designed to address them. \n \n \nFigure 1A\/1B: Taiyuan’s Location in China and District Level Map \n \n \n \nSource Figure 1A: China National Tourism Administration (2008). (www.china-travel-guide.com\/chinamap2.htm). \nFigure 1B: Source: Taiyuan Government (2006). Taiyuan Zhinan, www.tyzn.gov.cn\/ShowArticle.asp?ArticleID=345. \n \n                                                 \n2 Late in 2007 (well after the completion of our fieldwork), local authorities began requiring employers that \nhire a large number of migrant workers to build more permanent dormitories for their employees. \n 6\n \nData collection \n \nThe study is based on series of in-person interviews with 805 migrants in various \noccupations in Taiyuan. In order to focus the sample on the most policy-relevant group of \nlow-wage\/low-skill migrants, respondents were screened to eliminate homeowners and \nanyone with Taiyuan hukou. The survey instrument was a structured schedule combining \nopen- and closed-ended questions that had been previously deployed in a companion \nstudy conducted in Tianjin (Li, Duda, and Peng 2007). A team of graduate students under \nsupervision of Professor Xiangsheng An of Taiyuan Normal University conducted the \ninterviews. \n \nThe primary methodological challenge of the study stems from the fact that there is no \nsample frame of either housing units or migrants from which to draw a representative \nsample for the research. It was not possible to follow the approach of some earlier studies \nof urban residents (e.g., Sato 2006) that use the housing unit data compiled by \nneighbourhood committees, because this excludes completely in situ employer-provided \nhousing, which is one of the major sources of housing occupied by migrants. Similar \nchallenges and limitations apply to assembling a sampling frame comprised of rural \nmigrants, rather than of the housing they occupy, because migrants are highly mobile and \nfrequently unregistered with local authorities. \n \nTo circumvent these problems we stratified our sample based on migrants’ occupational \ndistribution in research by the China Rural Survey Team (2005) that was focused on \nmigrant employment in the central provinces.3 Our data collection was conducted so that \nindustry sector (e.g., manufacturing, construction) shares in the sample matched industry \nsector shares from the Rural Survey Team research. Respondents were identified at or \noutside their workplaces throughout the six urban and suburban districts. This approach \nto drawing a representative sample implicitly assumes that by accurately capturing the \nrange of variation in migrant occupations, the sample will also capture the range of \nhousing types occupied by the majority of rural migrants. \n \nUltimately, we view this sampling strategy as a defensible response to a situation that \npresents substantial methodological challenges for those seeking to use statistical \nmethods. Nonetheless, it is important to acknowledge some potential impacts on the \nsample we procured of our approach. Because our interviewers identified many \nrespondents on the street outside their workplaces, or as they moved through the city (in \nthe case of street vendors and refuse collectors), there was little possibility to do follow-\nup visits to improve the response rate if the initial contact was unsuccessful. Interviewers \ninstead identified and interviewed replacement interviewees from the same sub-district \nand employment category if the initial interviewee declined to participate. The sample is \ntherefore biased toward those willing to be interviewed. (Interviewees were given a small \ngift in exchange for participation.)  \n \n                                                 \n3 Central provinces include Shanxi, Henan, Anhui, Hubei, Hunan and Jiangxi. \n 7\nUnwillingness to participate was least problematic among self-employed individuals and \nmore challenging among workers in more formal employment. Not only could members \nof this group (e.g., factory workers) not be reached during working hours but in some \ncases employers tried to forbid interviewees from accepting interviews. It is possible that \nthis is another source of bias as potential interviewees working in the least desirable \nconditions might be more likely to be excluded from the sample (though it is not clear \nwhat impact this might have on characteristics of housing units in the sample). In any \ncase, we attempted to minimize this problem by having interviewers wait outside \nfactories at the end of each working day and conducting interviews after work outside the \nworkplace itself.  \n \n \nTable 1: Migrant Employment Distribution by Industry Sector \n(about here) \n \nTable 1 shows the distribution of migrant employment by industry sector. \nRestaurant\/hotel and construction are the two largest groups with each about 20 percent \nof the total population. Manufacturing is the third largest sector. Although Taiyuan is \nknown for its heavy industry, apart from coal mines, other heavy industries are dependent \non skilled labourers with at least high school education, which excludes many rural \nmigrants. The manufacturing sector is therefore less important for migrants in Taiyuan \nthan in many coastal cities with higher shares of light industry. \n \nMigrant housing quality and satisfaction in Taiyuan \n \nAs discussed above, migrants’ housing quality in urban China is generally quite low in \nabsolute and relative terms. This is of interest because this low quality is not strongly \nlinked to typical causal factors, such as income. This section shows, however, that it is \nrelated in various ways to employment. The discussion here explores these issues in \nanticipation of the housing choice models presented in the next section. \n \nTable 2 shows frequency distributions for a housing quality index and a scaled measure \nof housing satisfaction. The quality indicator is comprised of responses to five questions \n(no toilet, no tap water, no heat source, temporary structure, and building used for other \npurposes), with the respondent allocated a point for each positive response (i.e., for each \nproblem the respondent faces).4 The table shows that more than two-thirds of migrants \nconfront at least one of these quality problems, and that more than one-quarter face two \nor more. Meanwhile, the satisfaction results show that only 3.0 percent are very \nunsatisfied (note that 8.9 percent faced three or more of the quality index problems), and \nthat 83.9 percent of respondents are either satisfied or have ‘no strong opinion.’ Taken \ntogether, these results suggest that migrants’ housing quality is modest but that low \nquality is met with ambivalence. \n \nTable 2: Migrant Housing Quality and Satisfaction \n(about here) \n                                                 \n4 See the appendix for detailed response information for the index components. \n 8\n \nTable 3 cross-tabulates quality index score with household income. The upper panel, \nwhich includes all respondents, indicates little relationship between the two variables. \nThe share of respondents facing ‘no problems’ is actually lowest in the lowest income \ngroup, with the highest income group second highest. Among those facing severe \nproblems, the highest earners have the smallest share but are only slightly ahead of the \nlowest earners.    \n \nThe middle panel of Table 3 shows only respondents occupying housing provided \nthrough their employer. Here the lowest earners are again most likely to avoid quality \nproblems, and trends are again indistinct across income groups. It is only in the private \nrental market (bottom panel) that the income\/quality relationship appears more typical. \nThat is, among migrants participating in the low cost rental market, quality problems are \nmost prevalent among the lowest earners and least common for those earning the most.  \n \nTable 3: Housing Quality and Household Income \n(about here) \n \nTable 4 pursues the link between employment and quality further by cross-tabbing \nhousing quality and industry sector. The table shows that those in the service sector face \nthe fewest quality problems, followed by manufacturing, self-employed and construction.  \nEach of these four industry sectors seems to have a distinct quality profile, which is \nconsistent both with anecdotal evidence on the quality of housing for migrants in various \noccupations, and with our previous work in Tianjin ((Duda and Li, forthcoming).  \n \nTable 4: Housing Quality by Industry Sector \n(about here) \n \nAnalyzing the data for the drivers of housing satisfaction yields similar levels of \nambiguity and insight. Cross-tabulating satisfaction with whether or not the respondent \npays rent shows that a very high percentage (44.2 percent) of those not paying rent are \n‘very satisfied,’ compared to 24.3 percent of those that do pay rent.  Among those getting \nhousing via their employers, however, there is almost no variation at all based on whether \nthe employee pays rent or not. (Only 6.5 percent of those getting housing through \nemployers reported paying for it.) Similarly, among those paying rent in the private \nmarket there is little variation in satisfaction level based on how much rent is paid. \n \nOverall, these descriptive comparisons hint that relationships between housing quality \nand satisfaction and their expected drivers such as income and rent levels do not follow \nstandard patterns. They further suggest that this is likely caused by employment \nintervening in migrants’ housing choice. The next section tests this proposition by \nmodelling two elements of housing choice relevant to migrants’ particular choice context \nin urban China.  \n \n \nResearch findings on housing choice \n 9\n \nThe dataset used in the modelling captures information on four sets of migrant \ncharacteristics: socio-demographic information on the interviewee; individual\/household \nincome data; employment information on the interviewee (and spouse if living in \nTaiyuan); and information on the interviewee’s migration characteristics. In this section, \nthese migrant characteristics are used as independent variables in logit models of housing \ncost and housing provider. \n \nVariables Used in the Analysis \nTable 5 shows characteristics of respondents in the sample. About two-thirds of \nrespondents are men. Average age is about 32 with the youngest being 17 and the oldest \n72. The education profile shows that 22 percent of the respondents completed primary \nschool or less, whereas two-thirds completed secondary school. Only 13.3 percent went \nbeyond secondary school, the majority of which (11.6 percent), completed high school. \nMost of the interviewees (61.9 percent) are married, and 61.4 percent of these live \ntogether with their partners. A majority (59 percent) of respondents have children, among \nwhom 218 have children in Taiyuan. Of these 218 families, 158 had school age children.  \n \nThe survey captures both individual and household monthly income. For interviewees \nthemselves, the monthly median was 1,000 yuan. For households it was slightly higher, at \n1,200. Most migrants (48.8 percent) earn their living in the private sector, followed by \nself-employed (37.3 percent) and the state sector (13.8 percent). In terms of the four \nindustry sectors discussed above, the sample is comprised of roughly half service \nworkers, one-fifth each for manufacturing and construction, and one-tenth street \nbusiness.5  \n \nMost migrants had left their villages relatively recently (median time outside the village \nis 5 years) and in Taiyuan for even less time (median time in Taiyuan is 3 years). Slightly \nless than one-third of respondents plan to stay in Taiyuan permanently. More than 60 \npercent send monthly remittances home, with the median (mean) amount of these \nremittances being 417 yuan (437 yuan). \n \nTable 5: Migrant Characteristics \n(about here) \n \nThe two indicators used as dependent variables in the analysis are whether housing is \nsourced from the market or employers, and whether or not the respondent pays rent. \nThese overlap because employers that provide housing typically do not charge for it \ndirectly, though housing provision is almost certainly reflected in wage levels, and we are \naware anecdotally of employers that offer migrants either housing or a higher monthly \nwage.  \n \nIn our sample, 38.0 percent of respondents get their housing through their employer, the \nprivate market supplies 59.0 percent and the remaining 3.0 percent receive housing from \n                                                 \n5 ‘Services’ combines wholesale\/retail, restaurant, and domestic services. ‘Street business’ combines \nrecycling, street vending, and other. Manufacturing and construction are unadjusted.  \n 10\na combination of friends, relatives, and government, or have built their own home. \nOverall, a majority of all respondents (61.5 percent) pays rent and the rest do not. Of \nthose not paying rent, over 90 percent get housing through their employer. Among rent \npayers, the monthly median amount paid is 100 yuan for people who do not live with \ntheir family\/spouse and 200 RMB for those who do. \n \nTable 6: Housing Source\/Cost \n(about here) \n \nModels of housing provider and rent payment \nAs noted at the outset of this paper, our goal is to inform policy development by \npresenting information about the housing process pursued by migrants in urban areas. \nDeveloping successful policies depends on understanding the determinants of housing \noutcomes in the absence of effective interventions. To this end, we model housing cost \n(free vs. rented) and provider (market vs. employer) by a set of migrant individual \ncharacteristics to better understand what factors determine their housing outcomes. \nIndependent variables are grouped so as to allow for the testing of the four ‘transition \npriorities.’ The impact of the model results on these hypotheses is discussed at the end of \nthis section. \n \nIn the provider model (left panel of Table 7), socio-demographic characteristics have \nlittle effect on the odds that respondents found housing through their employer. Only age \nis meaningfully related to housing provider, with each extra year reducing the likelihood \nof getting housing through one’s employer. As suggested by the earlier descriptive \nanalysis, income is also not related to housing outcomes, in this case provider.  For \nhousehold structure, having one’s partner in Taiyuan raises the odds that the respondent \nrents housing in the market substantially. However, having a spouse working in Taiyuan \nraises the odds of living in employer-provided housing more than 1,000 percent. The \nlikely explanation is that couples where both spouses are in the city working are likely to \nlive separately in employer provided housing. Interestingly, simply being married and\/or \nhaving children in Taiyuan do not influence housing provider. \n \nTwo of the four migrant characteristics we examined are shown to influence housing \nprovider. Each year as a migrant raises the odds of getting housing from one’s employer \nby 8.0 percent, whereas each year in Taiyuan has a comparably sized opposite effect. \nNeither sending remittances nor planning to settle permanently in Taiyuan has any \nimpact. All of the employment variables in the provider model have significant effects.  \nWorking in the state sector increases the odds that hosing will come via one’s employer \nby about 95 percent.  And, relative to working in construction, manufacturing, service, \nand street sector employees are progressively more likely to find housing in the private \nmarket. \n \nTable 7: Housing choice logistic regression results \n(about here) \n \n 11\nIn the ‘cost’ model (right panel of Table 7), we look simply at whether housing is \nprovided for free (38.5 percent) or rented (61.5 percent). (Note that it does not make \nsense to model the amount of rent paid as a function of these independent variables \nbecause housing may be a form of compensation for some but not all of those that are not \ncharged rent.)    \n \nSocio-demographic results differ somewhat from the provider model. Gender becomes \nsignificant, with men’s odds of paying rent more than 50 percent higher than those of \nwomen. Each additional year of age increases the odds of paying rent 26 percent, which \nis consistent with older people being more likely to participate in the private rental \nmarket, as indicated in the provider model. Education and income are once again not \nsignificant. Being married raises the odds of paying rent more than 80 percent, as does \nhaving one’s partner in the city, while having one’s partner working has a substantial \nnegative effect.   \n \nIn terms of migration characteristics, each additional year in Taiyuan raises the odds of \npaying rent about 9 percent and planning to stay in the city permanently increases it over \n80 percent. Each year as a migrant has a modest negative effect. The employment panel \nof the table shows that working in the state sector reduces the odds of paying rent for \nhousing, whereas the odds of paying rent steadily increase for workers in the \nmanufacturing, services, and street business sectors relative to those doing construction. \n \nDiscussion \n \nAs noted above, the provider and cost models measure similar things because more than \n90 percent of employer provided housing would register as ‘free’ on our ‘pay rent or not’ \nindicator. This notion is supported by the fact that all of the significant variables in the \nprovider model are also significant in the cost model and have opposite signs (sign \nchanges reflect the fact that ‘employer’ is coded ‘1’ in the provider model and ‘pay no \nrent’ is coded ‘0’  in the cost model).  \n \nThe model results offer support for the ‘transition priorities’ scheme outlined earlier in \nthe paper. The first hypothesis emerging from this scheme links employment concerns to \nhousing outcomes, arguing essentially that the former trump the latter. Support for this \ncan be clearly seen in the industry sector results, where the respondent’s occupation is \nshown to be very strongly associated with the source\/cost of housing. Our hypothesis \nregarding the second transition priority, savings, anticipated that income variation would \nnot be closely linked to housing outcomes as migrants respond to uncertainty about the \nfuture and\/or a desire to build permanent homes in rural areas by spending as little as \npossible on housing. In both models, neither income nor income squared have any impact \nat all, confirming the notion that migrants’ savings motivation swamps the temptation to \nimprove urban living standards as income increases.  \n \nThe third transition priority – mobility - implies that migrants want to live as close to \nwork as possible and not commit to housing contracts that cannot be severed if job \nopportunities open up elsewhere. The model results tend to support this claim, as the odds \n 12\nof living in employer provided housing seems to be most strongly influenced by whether \nor not the employer offers housing, which varies by industry sector. It is worth noting \nthat, beyond being convenient to work, employer provided housing is linked to \nemployment status and, therefore, subjects the migrant to no risk of being tied to a rental \ncontract while not employed. The appeal of this arrangement is consistent with migrants’ \nsavings priority. In terms of the ‘family life priority,’ the model results support the claim \nthat migrants in different stages of intentional temporary family separation and\/or \nplanned reunification in urban areas will make housing choices accordingly. Specifically, \ncouples that are both working in Taiyuan behave like two single people with respect to \nhousing, whereas those with one earner tend to live in the privately provided rental \nhousing.  \n \nIn addition to the model results supporting our transition priorities arguments, these \nhypotheses are bolstered by a results from a section of the survey in which we asked \nrespondent about their reasons for choosing their current housing. By an overwhelming \nmargin, the top response was ‘convenient to work,’ followed by ‘low cost.’ These two \nwere followed only distantly by ‘close to friends and family’ and ‘safety,’ with other \nchoices still farther back. This rank ordering is consistent with the influence that priorities \nemerging from the transition environment exert on migrants housing choices being \nsubstantial, as argued in our transition priorities explanation for observed housing \noutcomes.  \n \nConclusion \n \nThe analysis in this paper indicates that many migrant housing choices are driven by a set \nof priorities that are derived from the role they occupy in Chinese society during this \nperiod of economic transition. Because it increases their need for income and makes them \nvulnerable to persistent and unexpected changes, the transition environment makes it \nimperative that migrants in urban areas find work, have the flexibility to leave it, and \nsave as much of their income as possible. In a context where different industries have \nmarkedly different propensities to offer housing to their workers, this means that the \npropensity of migrants themselves to occupy employer provided housing vary markedly \nas well. For those working in construction, for example, very little in the way of ‘housing \nchoice’ exists. \n \nIf it is true that housing outcomes are based on priorities emerging from the transitional \neconomic environment, this has several important implications for migrant housing \npolicy development. The first of these is that migrant behavior in the housing market is \ndriven by factors that are specific to the transitional environment and thus is likely to \nchange over time. Policies should anticipate that such changes and emphasize flexibility \nin response to the ever-evolving transitional economy. The second important implication \nis that migrants’ housing decisions are still in many cases subsidiary to employment \nconsiderations. Housing policies must therefore avoid obstructing migrants’ ability to \nobtain and change employment.  \n \n 13\nA third implication is that employment linked housing has a particular appeal that is hard \nto compete with in that it eliminates housing expenses during any periods of \nunemployment or job changes. Job-linked housing suits the requirements of many \nmigrants because they do not need to sort out termination of an existing lease or acquire \nnew housing elsewhere if a better employment opportunity arises. To the extent possible, \npolicymakers should attempt to replicate this characteristic, which is consistent with both \nintra- and inter-urban labour mobility, if they choose to intervene in the low-cost rental \nsector. \n \nAnother implication of the current research for policy development is that, to the extent \nthat policymakers are concerned with migrant housing quality, they might best begin by \nregulating the pool of employer provided housing. Minimally, this would have the \nadvantage of affecting a majority of housing units occupied by migrants. A final \nimplication of the work here is that policymaking should not facilitate mobility at the cost \nof making long-term settlement in urban areas more difficult for migrants. To this end, it \nis critical that policies help reduce costs of urban living, such as school fees and medical \ninsurance, that will provide migrants with more disposable income to devote to currently \nunmet housing needs. \n \nIn closing, it is important to note that these results are for a single city in a particular \nregion of the country. They are broadly consistent with our earlier work in Tianjin, \nhowever, conditions may be quite different in other cities or regions. For example, we \nhave been told anecdotally that the link between employment and housing is much looser \nin southern cities. Examining this issue systematically would be an important area for \nfuture research.   \n \nIn general, the study of migrant housing conditions and choices is a rich area for policy \nrelevant research that has been largely ignored to date. Among the many areas for future \nresearch would be studies more directly targeted at understanding variation in the housing \nneeds within the migrant pool. Such work should specifically consider the different needs \nof those planning to settle permanently in urban areas and those planning to work for a \nwhile and return home.  \n 14\nReferences \n \nChina Rural Survey Team (2005) The number, structure and characteristics of farmers leaving their villages \nto work in 2004 (2004 nian nongmin waichu wugong de shuliang, jiegou ji tedian), China 3F \ninformation net, http:\/\/www.sannong.gov.cn\/fxyc\/ldlzy\/200507110158.htm. \nCostello, M. A. (1987) Slums and Squatter Areas as Entrepots for Rural-Urban Migrants in a Less \nDeveloped Society, Social Forces, 66, 427-445. \nDuda, M. and Li, B. (2008) Housing Inequality in Chinese Cities--How Important is Hukou?, Landlines, \nLLA080104, 14-19. \nDuda, M., Li, B. and H. Peng (forthcoming) Household Strategies and Migrant Housing Quality in Tianjin, \nIn Migration and Social Protection in China, Vol. forthcoming. (Ed, Smyth, R.) Chandos \nPublishing, Oxford. \nDutt, A. K., Tripathi, S. and Mukhopadhyay, A. (1994) 20. Spatial Spread of Daily Activity Patterns of \nSlum Dwellers in Calcutta and Delhi, The Asian City: Processes of Development, Characteristics, \nand Planning. \nGoldscheider, C. (1987) Migration and social structure: Analytic issues and comparative perspectives in \ndeveloping nations, Sociological Forum, 2, 674-696. \nHuang, Y. (2003) A room of one’s own: housing consumption and residential crowding in transitional \nurban China, Environment and Planning A, 35, 591-614. \nHuang, Y. and Clark, W. A. V. (2002) Housing Tenure Choice in Transitional Urban China: A Multilevel \nAnalysis, Urban Studies 39, 7-32. \nHuang, Y. and Jiang, L. (2007) Housing Inequality in Transitional Beijing, In International Conference on \nChina's urban Transition and City Planning Cardiff, Wales, UK,  \nLi, B., Duda, M. and Peng, H. (2007) Low-Cost Urban Housing Markets--Serving the Needs of Low-Wage \nRural-Urban Migrants? Lincoln Institute of Land Policy, Working paper: WP07MD1,  \nMinistry of Construction PRC (2005) Guidelines on issues related to the management of Housing Provident \nFunds (guanyu zhufang gongjijin guanli ruogan juti wenti de zhidao yijian), Vol. Jianjinguan \n[2005] No. 5. (Ed, Office of the State Council PRC).  \nSato, H. (2006) Housing inequality and housing poverty in urban China in the late 1990s. China Economic \nReview 17(1): 37-50. \nSclar, E. D., Garau, P. and Carolini, G. (2005) The 21st century health challenge of slums and cities, The \nLancet, 365, 901-903. \nSong, Y. (2007) Housing rural migrants in China’s urbanizing villages, Land Lines 19, 2-7. \nTaiyuan Government (2007) \"Migrant workers' home\" is set up in our city (woshi chengli \"nongmingong \nzhijia\"), http:\/\/www.taiyuan.gov.cn\/?sj=88715. \nWu, W. (2002) Migrant housing in urban China - Choices and constraints, Urban Affairs Review, 38, 90-\n119. \nWu, W. (2004) Sources of migrant housing disadvantage in urban China, Environment and Planning A, 36, \n1285-1304. \nWu, W. (2006) Migrant Intra-urban Residential Mobility in Urban China, Housing Studies, 21, 745-765. \nXiao, J. A. (2006) Lack of rural-urban migrants' participation led to unenthusiastic responses to public \nhousing for rural-urban migrants (nongmingong gongyu lengchang yuanyu quefa canyu jizhi), In \nNew Beijing Daily (Xin Jing Bao)Beijing,  \nZhu, Y. (2003) The floating population's household strategy and the migration's role in China's regional \ndevelopment and integration, International Journal of Population Geography, 9, 485–502. \nZhu, Y. (2007) China’s floating population and their settlement intention in the cities: Beyond the hukou \nreform. Habitat International, 31, 65–76.  \n \n 15\nAppendix: Housing Quality \n \nHousing Quality Problem Count Share (%) \n*Not heated 65 8.1\n*Building also used for other purposes 81 10.1\nVery noisy\/noise disturbs sleep 93 11.6\n*Structure is temporary 112 13.1\nCold in winter 146 18.2\nDamp 220 27.3\n*No interior tap water 253 31.4\n*No interior toilet 399 49.6\nNo kitchen 510 63.4\nNo shower 716 89.2\nMedian living space (sq m\/person) 3.0  \nMean living space (sq m\/person) 5.8   \n Note: Starred characteristics are used in the housing quality index.\n 16\nTable 1: Migrant Employment Distribution by Industry Sector \n \n  \nTaiyuan Sample Composition Rural Survey Team \n  \nFrequency Percentage Percentage \nManufacturing 145 18.0 18 \nRestaurant\/hotel 162 20.1 20 \nWholesale\/retailing 125 15.5 15 \nConstruction 162 20.1 20 \nDomestic and other services 130 16.2 18 \nStreet vending 49 6.1 5 \nRecycling 32 4.0 4 \nTotal 805 100 100 \nNote: Data in the column of Rural Survey Team has been re-categorised to match the fit into the  \ncategories listed on the left column. \n \nTable 2: Migrant Housing Quality and Satisfaction \n \nHousing Quality Count Percent  Housing Satisfaction Count Percent  \nNo problems 249 30.9 Very unsatisfied 24 3.0 \nSome problems (1 problem) 341 42.4 Unsatisfied 88 11.0 \nSignificant problems(2 problems) 143 17.8 No strong opinion 199 24.8 \nSevere problems (3-5 problems) 72 8.9 Satisfied 236 29.4 \n      Very satisfied 257 32.0 \nTotal 805 100.0 Total 804 100.2 \n \nTable 3: Housing Quality and Household Income \n \n  Percent \nALL \nRESPONDENTS \nSevere \nproblems \nSignificant \nproblems \nSome \nproblems No problems Total N \n<800 8.8 21.4 25.3 44.5 100.0 182 \n800 to 1,200 21.6 19.1 26.6 32.7 100.0 199 \n1,200 to 2,000 14.3 19.2 37.9 28.6 100.0 182 \n>2,000 7.0 18.2 32.2 42.6 100.0 242 \nTotal 12.7 19.4 30.6 37.4 100.0 805 \nN 102 156 246 301 805   \nEMPLOYER \nHOUSING \nSevere \nproblems \nSignificant \nproblems \nSome \nproblems No problems Total N \n<800 9.2 15.3 20.4 55.1 100.0 98 \n800 to 1,200 30.6 20.4 22.4 26.5 100.0 98 \n1,200 to 2,000 27.1 24.3 30.0 18.6 100.0 70 \n>2,000 25.6 23.1 25.6 25.6 100.0 39 \nTotal 22.3 20.0 23.9 33.8 100.0 305 \n  68 61 73 103 305   \nRENTAL MARKET \nSevere \nproblems \nSignificant \nproblems \nSome \nproblems No problems Total N \n<800 9.2 30.3 32.9 27.6 100.0 76 \n800 to 1,200 10.4 18.8 32.3 38.5 100.0 96 \n1,200 to 2,000 3.9 17.5 44.7 34.0 100.0 103 \n>2,000 3.0 17.1 33.7 46.2 100.0 199 \n 17\nTotal 5.7 19.6 35.7 39.0 100.0 474 \n  27 93 169 185 474   \n \n \nTable 4: Housing Quality by Industry Sector \n \n  \nSevere \nproblems \nSignificant \nproblems  \nSome \nproblems No problem Total N \nServices 2.9 16.6 29.3 51.3 100.0 417 \nManufacturing 12.4 22.8 33.1 31.7 100.0 145 \nSelf-employed 21.0 21.0 38.3 19.8 100.0 81 \nConstruction 34.0 22.8 27.8 15.4 100.0 162 \nTotal 12.7 19.4 30.6 37.4 100.0 805 \nN 102 156 246 301 805   \n \nTable 5: Migrant Characteristics \n \nSOCIO DEMOGRAPHIC Count Percent HOUSEHOLD STRUCTURE Count Percent \nGender (1 = male) 530 65.8 Married 498 61.9 \nAge (mean=31.9)    Partner lives in Taiyuan 309 61.4 \n  <= 20 134 16.7 Partner works in Taiyuan    \n  20-30 278 34.5 Children studying in Taiyuan    \n  30-40 231 28.7   None 647 80.4 \n  40-50 119 14.8   One or more 158 19.6 \n  50-60 34 4.2      \n  >60 9 1.2      \nEducation    MONTHLY INCOME (RESPONDENT ONLY)   \n  Primary school or less 177 22.0 \n  Median \n   \n1,200    \n  Secondary school 520 64.8 \n  Mean\/Standard Deviation \n   \n1,544  \n  \n1,446 \n  High\/Vocational\/Polytech sch. 106 13.3 \n  Min\/Max \n   \n100  \n  \n20,000 \n          \nEMPLOYMENT     MIGRATION     \nEmployer Type    Permanently in Taiyuan (1=yes) 239 29.7 \n  State\/collective 111 13.8 Send monthly remittance 503 62.5 \n  Private  393 48.8 Years outside village    \n  Self employed\/no employer 300 37.3   Median 5   \nIndustry Sector      Mean\/Standard Deviation 6.4 5.8 \n  Manufacturing 145 18.0 Years in Taiyuan    \n  Construction 162 20.1   Median 3   \n  Services 417 51.8   Mean\/Standard Deviation    \n  Street business 81 10.1       \n \nTable 6: Housing Source\/Cost \n \nPROVIDER Count Percent MONTHYL RENT \n  Private market 474 59.0 Singles     \n  Employer 305 38.0   Median             100    \n  Other 24 3.0   Mean\/St. Dev.             169  \n   \n(213) \nRENT       Min\/Max               15              2,000  \nPay rent 495 61.5 Families     \nFree 310 38.5   Median             200    \n  Employer 287 93.2   Mean\/St. Dev.             289  \n   \n(257) \n 18\n  Relatives 13 4.2   Min\/Max               30              1,500  \n  Friends 3 1.0       \n  Government 5 1.6       \n \nTable 7: Housing choice logistic regression results \n \n  \nHousing Provider (1 = \nemployer; 0=market) Pay rent or not (1 = yes) \n  coefficient odds ratio   coefficient odds ratio   \nSOCIO-DEMOGRAPHIC             \nGender (1 = male) -0.21 0.82   0.45 1.57 ** \nAge -0.23 0.80 *** 0.23 1.26 *** \nAge squared 0.00 1.00 *** 0.00 1.00 *** \nEducation (ref: primary or less)           \n  Secondary school  0.16 1.18   -0.15 0.86   \n  High Sch.\/Vocational\/Polytech -0.06 0.95   0.06 1.07   \nINCOME           \nHousehold income 0.00 1.00   0.00 1.00   \nHousehold income sq 0.00 1.00   0.00 1.00   \nHOUSEHOLD STRUCTURE           \nMarriage status (1 =married\/cohabit) -0.11 0.89   0.59 1.81 * \nPartner in Taiyuan (1 = yes) -3.67 0.03 *** 3.34 28.24 *** \nChild studying in Taiyuan (1=yes) 0.50 1.66   0.07 1.07   \nPartner is working in Taiyuan (1=yes) 2.61 13.53 ** -2.17 0.11 ** \nMIGRATION           \nPlan to settle in Taiyuan permanently (1 = \nyes) -0.23 0.79   0.59 1.81 ** \nYears as a migrant 0.08 1.08 *** -0.05 0.95 ** \nYears in Taiyuan -0.12 0.89 *** 0.09 1.09 ** \nSend remittances (1 = yes) -0.26 0.77   0.29 1.33   \nEMPLOYMENT           \nWorking for the state sector (1 = yes) 0.61 1.85 ** -0.49 0.61 ** \nIndustry sector (construction omitted)           \n  Manufacturing industry -0.52 0.60 * 0.99 2.70 *** \n  Service industry -1.73 0.18 *** 2.04 7.71 *** \n  Street vendors -4.29 0.01 *** 4.01 54.95 *** \nCONSTANT 6.38   *** -6.66   *** \nLog likelihood -323.78     -340.67     \nLR chi square \/degrees of freedom 385.81 19   382.11 19   \nPseudo R2 0.373    0.359    \nN 772     798     \n \nNote: *\/**\/*** denote significance at 0.10\/ 0.05\/0.01 levels. \n \n \n \n"}