{"doi":"10.1007\/s10040-003-0274-4","coreId":"62710","oai":"oai:nora.nerc.ac.uk:3626","identifiers":["oai:nora.nerc.ac.uk:3626","10.1007\/s10040-003-0274-4"],"title":"Response Of The Dupi Tila Aquifer to intensive pumping in Dhaka, Bangladesh","authors":["Morris, Brian","Seddique, Ashraf Ali","Kazi, Matin Ahmed"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003","abstract":"This paper focuses on the water-quantity issues facing Dhaka because of the rapid exploitation of the Dupi Tila aquifer.  Dhaka is one of the world’s largest groundwater-dependent cities, relying on water withdrawn from this underlying semiconfined sand aquifer.  A meteoric rise in well construction in both the private and public sectors in recent years has produced an estimated 1,300 boreholes that tap the aquifer in urban and suburban parts of the city.  Analysis of construction records for public-supply wells drilled between 1970 and 2000 shows that water levels are falling in several areas of the city despite apparently favorable recharge conditions .  The productivity of boreholes as measured by specific capacity has also declined significantly.  Even though the aquifer system is vital to the infrastructure of the city it remains a poorly quantified resource, and until this is resolved by investment in evaluation studies, attempts to efficiently manage the resource in a sustainable way will be frustrated","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/62710.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/3626\/1\/HJ-2002-900738.pdf","pdfHashValue":"01114cba329011ee288d47e84e7046b025b285d6","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:3626<\/identifier><datestamp>\n      2012-11-22T11:50:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533139<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      7375626A656374733D533134<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3626\/<\/dc:relation><dc:title>\n        Response Of The Dupi Tila Aquifer to intensive pumping in Dhaka, Bangladesh<\/dc:title><dc:creator>\n        Morris, Brian<\/dc:creator><dc:creator>\n        Seddique, Ashraf Ali<\/dc:creator><dc:creator>\n        Kazi, Matin Ahmed<\/dc:creator><dc:subject>\n        Management<\/dc:subject><dc:subject>\n        Earth Sciences<\/dc:subject><dc:subject>\n        Electronics, Engineering and Technology<\/dc:subject><dc:description>\n        This paper focuses on the water-quantity issues facing Dhaka because of the rapid exploitation of the Dupi Tila aquifer.  Dhaka is one of the world’s largest groundwater-dependent cities, relying on water withdrawn from this underlying semiconfined sand aquifer.  A meteoric rise in well construction in both the private and public sectors in recent years has produced an estimated 1,300 boreholes that tap the aquifer in urban and suburban parts of the city.  Analysis of construction records for public-supply wells drilled between 1970 and 2000 shows that water levels are falling in several areas of the city despite apparently favorable recharge conditions .  The productivity of boreholes as measured by specific capacity has also declined significantly.  Even though the aquifer system is vital to the infrastructure of the city it remains a poorly quantified resource, and until this is resolved by investment in evaluation studies, attempts to efficiently manage the resource in a sustainable way will be frustrated.<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2003<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3626\/1\/HJ-2002-900738.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Morris, Brian; Seddique, Ashraf Ali; Kazi, Matin Ahmed.  2003  Response Of The Dupi Tila Aquifer to intensive pumping in Dhaka, Bangladesh.   Hydrogeology Journal, 11 (4). 496-503.  https:\/\/doi.org\/10.1007\/s10040-003-0274-4 <https:\/\/doi.org\/10.1007\/s10040-003-0274-4>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/content\/102028\/?sortorder=asc&p_o=30<\/dc:relation><dc:relation>\n        10.1007\/s10040-003-0274-4<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/3626\/","http:\/\/www.springerlink.com\/content\/102028\/?sortorder=asc&p_o=30","10.1007\/s10040-003-0274-4"],"year":2003,"topics":["Management","Earth Sciences","Electronics, Engineering and Technology"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Response Of The Dupi Tila Aquifer To Intensive \nPumping In Dhaka, Bangladesh. \nBRIAN L MORRIS, ASHRAF ALI  SEDDIQUE, KAZI MATIN AHMED \nBrian L Morris (✉ ): British Geological Survey, Maclean Building, Crowmarsh Gifford, \nWallingford, Oxon OX10 8BB, UK .   \ne-mail: blm@bgs.ac.uk Fax 44 1491 692345, Tel 44 1491 838800  \nASHRAF A SEDDIQUE, K MATIN AHMED \nAshraf Ali Seddique, Kazi Matin Ahmed: University of Dhaka, Dept of Geology, Dhaka 1000, \nBangladesh.  \ne-mail: kmahmed@udhaka.net  Fax 880 2 8615583 Tel 880 2 9661900-59, \nExt 4897, 6015. \nAbstract: This paper focuses on the water-quantity issues facing Dhaka because of the rapid exploitation of the \nDupi Tila aquifer.  Dhaka is one of the world’s largest groundwater-dependent cities, relying on water withdrawn from \nthis underlying semiconfined sand aquifer.  A meteoric rise in well construction in both the private and public sectors in \nrecent years has produced an estimated 1,300 boreholes that tap the aquifer in urban and suburban parts of the city.  \nAnalysis of construction records for public-supply wells drilled between 1970 and 2000 shows that water levels are \nfalling in several areas of the city despite apparently favorable recharge conditions .  The productivity of boreholes as \nmeasured by specific capacity has also declined significantly.  Even though the aquifer system is vital to the \ninfrastructure of the city it remains a poorly quantified resource, and until this is resolved by investment in evaluation \nstudies, attempts to efficiently manage the resource in a sustainable way will be frustrated. \nKeywords Bangladesh Urban groundwater Water levels Borehole  design \nIntroduction \nThe inexorable global rise in the proportion of people that live in cities continues apace, such that \nby 2010 it has been estimated that half the then global population of seven billion will be urban \ndwellers, compared to less than 30% in 1950 (UNCHS, 1987).  Much of this increase has been \nconcentrated in the developing world.  Nowhere is this better illustrated than in Bangladesh where \nthe proportion of population that is urban grew from less than one in seven in 1980 to almost one in \nfour in 1999 (World Bank, 2000).  The capital, Dhaka, had a 1985 population of 4.9 million \n(UNEP, 1992) which grew to 7.8 million by 1995 (UNPD, 1995) and with a more than 5% annual \ngrowth rate is expected to have achieved megacity status of 10 million+ by 2000.  It is now one of \nthe world’s 25 largest cities. \nGroundwater Setting of Dhaka \nDhaka is more than 95% dependent on groundwater for domestic, industrial, and commercial water \nsupply.  The rise in groundwater use over the last 50 years continues apace, from the drilling of the \nfirst borehole in 1949 to more than 190 public-supply and 200 private boreholes together \nabstracting an estimated 310 Mm 3 per year in 1998 (Ahmed et al. 1999).  New investment in the \nlate 1990s has significantly increased the number of public-supply boreholes operated by the utility, \nDhaka Water Supply and Sewerage Authority (DWASA).  As a result, groundwater withdrawals \nhave accelerated such that by late 2000 DWASA was operating more than 330 wells and pumping \napproximately 400 Mm3 per year of water into the supply.  Abstraction from private boreholes, \nwhose numbers have also expanded dramatically to more than 970  (DWASA, 2000), is \nunquantified but likely to be substantial.  \nAll water is obtained locally from underlying fluvio-deltaic sands of the highly productive Dupi \nTila aquifer, which is locally reported to be about 140 m thick.  These Plio-Pleistocene sediments, \nwith a transmissivity typically in the range 500-2,000 m²\/d are considered to be of limited extent in \nthe environs of Dhaka.  They occupy a horst that extends southwards from the main \noutcrop\/subcrop north of the city, as shown in Figure 1 .  More recent Quaternary fluvio-deltaic \nsediments on either side of this southerly fault-bounded block are composed predominantly of silts \nand clays of the Madhupur Formation and younger alluvium.  These are much less permeable, \ntypically about 0.01 m\/d for the clays and 0.1 m\/d for the silts.  Such a groundwater setting implies \nthat the Dupi Tila aquifer, confined beneath the leaky Madhupur Formation, comprises a \ngroundwater resource that is large, but by no means infinite. \nFigure 1 \n \nThe very low elevations, the proximity of the Rivers Buriganga, Turag and Balu to the southwest, \nwest and east, and the risk of flooding have historically constrained the direction of expansion of \nDhaka.  This has meant that until recently new industrial\/commercial and residential development \nhas tended towards the north, in effect coincident with the extent of the Dupi Tila aquifer.  It has \ntherefore continued to be possible to provide water from intra-urban wells, without the need for \ncomplex water-transfer systems from peri-urban wellfields or distant surface-water sources.  The \ncorollary is that recharge to the Dupi Tila sands, either directly via near-city reaches of the \nBuriganga River or indirectly by leakage through the confining Madhupur clay, is increasingly \ninfluenced by urban processes.   \nSuch processes can often have the effect of increasing the overall availability of recharge (Foster et \nal, 1993) but at a cost in terms of chemical and biological water quality (Morris et al 1994, \nLawrence et al. 1997, Ellis 1997).  In the case of Dhaka, some water-quality deterioration has \nalready taken place as urban recharge (direct or indirect) impacts on the baseline water quality of \nthe Dupi Tila sands.  By 1996 significant increases in electrical conductivity from a background of \nless than 200 µS\/cm to more than 600 µS\/cm were being observed in the older  industrial district \nlocated near the Buriganga River (Ahmed et al. 1999).  The influx of urban recharge directly or \nindirectly is also evidenced by depleted oxygen and hydrogen stable isotope ratios in samples from \nboreholes in the south of the city near the River Buriganga and in the area of maximum piezometric \ndecline (Darling et al, pers. comm. 2001).  The rapid increase in groundwater withdrawals in the \nlate 1990s is likely to accentuate this trend.      \nHowever, issues other than declining water quality may in the future affect Dhaka’s water supply.  \nThis paper uses public-supply borehole drilling records from 1970 to 2001 to assess the effect of \nincreasing abstraction on well productivity.  For a given groundwater demand, average well \nproductivity will control not only the number and spacing of boreholes in an urban wellfield, but \nalso the energy costs incurred in pumping the water into the supply.  If the productivity of an \naquifer is declining, both capital and operating costs are thus increased, and this can impact \nparticularly on public water supply, where economic cost recovery can be a difficult issue.  It is \neven more sensitive in Bangladesh than elsewhere because of the level of urban and rural poverty.  \nWith a per capita GNP of US$ 370 (1999), it has been estimated that in 1996 78% of the population \nsubsisted on less than US$ 2 per day per person (World Bank, 2000).  Even apparently trivial \nincreases in unit water cost will have a disproportionately greater impact when passed on to \nconsumers living at or below this poverty line.  This is a delicate issue for one of the poorest mega-\ncities in one of the world’s poorest countries. \nTrends in Water Levels, Productivity and Borehole Design \nWater levels  \nDhaka is zoned for water-supply purposes into six districts, with newer zones having the higher \nnumbers.  Zones 1 and 2 are in the older more densely populated southern part of the city and Zone \n6 coincides with the major industrial district of Tejgaon located north of the old city centre (Figure \n2).   Zones 1, 2 and 6 have seen the most intensive well development, but during the 1990s new \ndrilling has increasingly extended to the other supply zones.   \n \nFigure 2 \n \nBased on sparsely available monitoring-well information Ahmed et al. (1999), have already \nreported declines in piezometric water levels in Dhaka.  By 1995, widespread pumping had induced \nthe formation of an extensive cone of depression centred on the southern part of the city with up to \na 25-metre depression of the regional water level. \n \nBy the late 1990s, pumping in these areas from an ever-increasing density of public-supply and \nprivate wells had resulted in piezometric levels of more than 35m below ground level.  Away from \nthese zones, in which there is a high density of water-supply boreholes, new wells could still \nencounter static water levels which, although depressed in comparison with the pre-urban state, \nwere still only about 10m or so below the pre-development condition. These two trends, which \nstarted in the 1970s, are well illustrated in Figure 3 which shows static water levels at the date of \nconstruction of 329 boreholes drilled for DWASA between 1970-2000.  \nFigure 3 \n \nFigure 4, which records pumping water levels in new wells at the date of commissioning, shows \nthat individual pumping lifts were by the late 1990s exceeding 55m in the most heavily exploited \nareas.  This compares with less than 15m in the early 1970s.  Averaged over the three most \nintensively exploited zones 1, 2 and 6, pumping lifts increased from 19m in the early 1970s, \nthrough 28m in the 1980s, 42m in the late 1990s, to 48m by 2001. \nFigure 4 \nProductivity  \nIn order to simplify and standardise test-pumping plant and subsequent pumping station design, \nwater-supply boreholes in Dhaka have for many years been designed and step-tested for a \nproduction rate of 2 cubic feet\/sec (56.6 l\/s).  A standardised pumping rate permits a direct \ncomparison of specific capacities and temporal trends from the borehole construction records of 342 \npublic-supply wells constructed between 1970 and 2001.  Figure 5 shows that since the early 1970s \nthere has been a steady decline in specific capacity, from 6.3 l\/s\/m in the 1970s to 4.5 l\/s\/m in 1991-\n2000.  This represents a decline of almost 30% in the productivity of a typical public-supply well. \nFigure 5 \nBorehole Design \nThe DWASA public-supply borehole construction records provided individual site information on \nborehole number, depth, date drilled, length of upper plain casing housing the pump, lower plain \ncasing and screen, design discharge, and static and pumping water level at the commissioning date.  \nWells have a standard design of large-diameter pump casing extending from the surface into which \nis telescoped plain casing above a screened interval above a sand sump.  For trend-analysis \npurposes, the wells were divided into those drilled during the 1970s, the 1980s and the 1990s, and \ninto zone subsets.  Average values for the length of well linings are summarised in Table 1. Some \nobservations include: \n \nTable 1 \n \n• The average installed length of pump casing has progressively increased from 41m in the 1970s \nto 71m in the late 1990s.  This reflects recognition of the need to design for initial pump settings \nat progressively  lower depths  as regional water levels decline, and to consider the need for a \nfuture resetting of production pumps as regional levels continue to fall \n• Much of this increase has been accommodated for by a reduction in the smaller diameter plain \ncasing length above the screen. \n• Screen lengths have consequently seen only a modest increase both in length (of about 8m to an \naverage of 95m in the 1990s) and in their midpoint depth settings (from 110m to approximately \n120m). \n• As a result, average well depth has increased by only about 12m since the 1970s, 2m of which is \naccounted for by a trend towards deeper sand sumps to accommodate fine sediment entrained \nduring pumping.   \nThe average values for the lengths of various well-linings for the whole city mask some variation in \ntrend within the supply sectors, especially in heavily exploited Zones 1 and 2, where well design \nhas had to accommodate the lowest water levels as interference effects and dewatering become \nmore marked.  Table 2 shows how this has affected the depth at which screens are set.  In  Zone 1 \nthe midpoint screen depth  increased by 18.5m (equivalent to about 0.75m\/year over the review \nperiod), whereas in the more lightly developed Zones 4 and 5 the screen depth remained relatively \nunchanged.   \nTable 2 \nHydrogeological Significance of Falling Water Levels in the \nDhaka Aquifer \nThe Dupi Tila aquifer beneath Dhaka benefits from a relatively favourable recharge regime.  \nAnnual average rainfall exceeds 2,500 mm.  Moreover the city is located adjacent to distributaries \nof the gigantic Ganges-Brahmaputra-Megna river system which, as has already been established \n(Ahmed et al. 1999, Darling et al. 2001), ensures induced recharge is possible through the \nBuriganga river bed Additional major new sources of recharge are now available from the urban \ninfrastructure via pipe leakage (water mains, sewers, storm drains), on-site sanitation, and pluvial \ndrainage. So there appears to be ready water availability.  It is therefore of concern not only that \nwater levels are falling across such an extensive part of the city, leading to increased pumping costs, \nbut also that well productivity should be declining too. \n \nFollowing are several possible reasons for the trends described earlier, of which the first two are \nlikely to be the more important: \n \n(i) The principal explanation for the trend of falling levels despite apparently ample sources of \nrecharge at the surface is likely to be a result of the particular hydrogeological setting of the \ncity.  The Dupi Tila aquifer is confined by the leaky Madhupur Formation of silty clays, \nwhich is patchy but on average about 10m thick beneath Dhaka.  As seasonal water levels \nhave fallen from a few metres below ground level in the 1970s to 25m+ in the late 1990s, \nthe aquitard has been drained and the upper part of the Dupi Tila is now being dewatered.  \nOnce saturated conditions give way to unsaturated, the vertical hydraulic conductivity is \nreduced, especially in the uppermost finer-grained strata where narrow pore necks become \nfilled with air and obstruct water passage.  Although the Dupi Tila is in places sufficiently \ndewatered to have become unconfined, changes from the initial leaky confined response of \nwells to pumping also reflect the reduced  amount of recharge to the aquifer as the hydraulic \nresistance increases.  In effect, the drawdown-limiting tendency for  free drainage from the \naquifer under unconfined conditions is counterbalanced by a reduced capacity for leakage \nthrough the aquitard.  In the case of the Dhaka aquifer, drawdowns have increased, and \ntherefore specific capacities have decreased.  Figures 5 and 6 illustrate these effects. \nFigure 6 \n \n(ii) A second explanation lies in progressive reduction of transmissivity or effective thickness as \npump casings are deepened but well depths stay the same.  As a hydraulic approximation, \nunless the well has a large diameter-to-length ratio, the depth to the bottom of the lowermost \nscreen effectively defines the base of the aquifer in the near-well zone around a borehole.  It \nis therefore quite likely that many wells in Dhaka are experiencing dewatering effects as the \nsaturated thickness originally tapped by those wells declines.  This effect will be especially \nmarked within the cone of drawdown and will compound the more widespread water-level \ndepression experienced across heavily-pumped zones of the city.  The actual thickness of the \nDupi Tila aquifer has not been reliably mapped for the Dhaka area and there is some \nindication from recent (post-1998) drilling that productive zones of the aquifer may extend \nsignificantly below the 150 m below ground level which is typically cited as the base of the \nDupi Tila aquifer beneath the city.  This means that the reduction in effective thickness \nwhich is affecting some older central-zone boreholes is independent of actual aquifer \nthickness, being instead a function of well depth and design. \n(iii) Deterioration due to encrustation, plugging, dewatering, or other gradual performance-\nlimiting processes.  This may be excluded as a cause because the specific-capacity data are \nderived from newly commissioned  wells. \n(iv) A steady change with time towards less efficient well designs\/completions.  While the \ndownward trend in static water levels illustrated in Figure 3 shows that falling water levels \nare aquifer-wide in some of the city’s distribution zones, it is possible that the effect may be \ncompounded by declining well-screen efficiency.  Reductions in well efficiency could be \ndue to deterioration either in drilling\/well development practices or in screen specifications.  \nThere is no information on this aspect, which would in practice be difficult to disentangle \nfrom well interference effects in such a densely exploited urban aquifer.  However, if it is a \ncontributory effect, its magnitude appears to be small, as the average drawdown in DWASA \nboreholes (which would include the effects of interference in several distribution zones) has \nonly increased from 11.0 m in the 1970s to 13.1m in the 1990s.  \n(v) A change with time as well screens are set lower to deeper aquifer horizons.  Variations in \npermeability with depth in the Dupi Tila sands have unfortunately not been recorded and are \nunknown.  Tables 1 and 2 show that with one exception, well designers have not \nsignificantly deepened screen settings over the 30-year period under review.  The exception \nis Zone 1 where a systematic increase, from 120m to 139m, is noted.  This trend however \naffects less than 18% of all wells considered in the dataset, and screen lengths and settings \nelsewhere have remained broadly unchanged.  Thus it is not possible to ascertain whether \ndeeper horizons of the Dupi Tila are more permeable because in general they have not yet \nbeen tapped.  Equally, however, changes in screen setting with time can be discounted as \ncontributory to productivity declines.     \n(vi) Permeability reduction in the Dupi Tila sands northwards away from the axis of the River \nBuriganga, causing a reduction in the mean values as new wells are increasingly drilled in \nnorthwestern and northeastern sectors of metropolitan Dhaka.  This may be a possibility but \nthere are no field permeability or transmissivity data available to either support or refute the \nhypothesis.  It is observed that no significant geographical pattern of median or interquartile \nrange emerged from a statistical analysis of specific capacity by city zone (Figure 7).  \nHowever it is recognised that specific capacity results are not necessarily a reliable indicator \nof possible changes in permeability\/storage release because they may also depend on other \nfactors in a heavily exploited aquifer (such as degree of development leading to interference \neffects).  \nFigure 7 \nDiscussion \nThe nine-parameter data set used in this paper (borehole number, depth, date drilled, length of upper \nplain casing housing the pump, lower plain casing and screen, design discharge, and static and \npumping water level at the commissioning date) represents 30 years of public water supply borehole \nconstruction for Dhaka.  It shows that despite the city’s location in a zone of ample annual effective \nprecipitation and its proximity to a major hydraulically-connected river system, the aquifer \nproviding 95% of the city’s water-supply needs is experiencing major declines in water levels.  \nFalling water levels have adversely affected the productivity of new city public-supply wells, which \nduring the boom in well drilling of the 1990s have shown a specific capacity almost 30% lower than \ntheir equivalents from the 1970s. \n \nRecharge mechanisms to an urban\/urbanising aquifer are complex but one global conclusion \nemerging from the relatively few studies carried out to date on groundwater-dependent cities is that \nirrespective of climatic regime, the quantity of recharge tends to increase, reflecting the rise in \npotential sources of water that can infiltrate from the city water and drainage infrastructure.  Figure \n8 for instance summarises the results from twelve cities in different climatic regimes.  It is not \nknown if increased post-urbanisation recharge is the case for the Dhaka aquifer, where so far there \nhave been no significant water imports via mains into the city from the periurban\/rural hinterland.  \nEven if recharge is increasing it does not appear to be keeping pace with rising abstraction, so water \nlevels are falling as withdrawals from storage occur instead.  \nFigure 8 \n \nThe specific capacities of the 329 DWASA boreholes which are analysed here refer only to the \nproductivity of  the wells at the date of commissioning.  A modern re-survey of the boreholes is \nneeded in order to compare changes in site values over time.  It is logical to expect that the \nproductivity of the older wells located in zones now heavily exploited would be substantially less \nthan at the date of commissioning, and this would further demonstrate the hidden cost of \nunmanaged withdrawals from the urban aquifer.  Similarly, it would be instructive to conduct an \neconomic analysis demonstrating the present additional cost of the energy required to cope with the \nincreased lift and likely future additional costs arising from changes in well and pumping-plant \ndesign, which are required as regional water levels decline (deepening of wells; and installation of  \nlonger large-diameter pump casings and longer screen sections). \n \nThere is no information available on the performance of private boreholes, but it seems likely that \nthe trend in the same areas of the city will be similar.  The construction of new boreholes continues \napace, both by the water utility DWASA and by the private sector.  \n \nDespite the most extensive exploitation and its vital role in Dhaka’s water infrastructure, the Dupi \nTila aquifer system remains relatively poorly studied and poorly understood.  The summaries of \nDWASA borehole construction used in this paper for instance indicate that even the geometry of \nthe aquifer remains uncertain. Aquifer characteristics have been only sporadically determined at a \nfew sites and recharge mechanisms and magnitude remain unquantified.  This continuing paucity of \ninvestment in basic resource evaluation limits the confidence with which urban water-supply \nmanagers can recalibrate and apply predictive tools such the aquifer model established for the city \narea in the early 1990s.  Lack of such aquifer data seriously hampers proactive urban water \nmanagement, for which reliable predictive modeling of different operating and regulatory scenarios \nis a prerequisite (Foster et al 1998).  \nConclusions \nThe existence of the thick and productive Dupi Tila aquifer beneath Dhaka has been of \nimmeasurable benefit to a city with poor financial resources that has doubled in size to megacity \nstatus in only 15 years or so.  Groundwater drawn locally from this aquifer continues to be the \nprime source to meet demands for domestic, industrial, and commercial water supplies provided \neither by the public utility or by private well owners.  However the aquifer has limitations in areal \nextent and the local geography has conspired to focus much of Dhaka’s expansion northwards \nacross more and more of the aquifer’s outcrop\/subcrop.   \n \nThis urbanisation trend will be matched by increasing abstraction and major changes in  recharge \npatterns, yet unfortunately it is taking place in an aquifer system that remains very poorly \nunderstood as a result of inadequate investment in scientific groundwater investigation and \nquantification.  As a resource supplying one of the world’s poorest large cities in one of the world’s \npoorest countries, the aquifer requires sustainable management not only to protect future water \nquality but also to ensure that the resource can continue to meet the quantitative demands being \nplaced upon it.   \nAcknowledgements This paper is published by permission of the Director, British Geological \nSurvey (NERC).  The study has been made possible by the support of the UK Department for \nInternational Development.  The authors thank colleagues for helpful discussion and especially \nDhaka Water Supply and Sewerage Authority (DWASA) for providing the borehole construction \ninformation that forms the principal data source for this paper. \nREFERENCES \nAhmed K H, Hasan M K, Burgess W G, Dottridge J, Ravenscroft P and van Wonderen J J  (1999)  The Dupi Tila aquifer of Dhaka, \nBangladesh: hydraulic and hydrochemical  response to intensive exploitation. In Groundwater in the Urban Environment: \nSelected City Profiles, P J Chilton (ed.) Balkema, Rotterdam,19-30 \nDarling W G, Burgess W G and Hasan M K (pers.comm. 2001)  Isotopic evidence for induced river recharge to the Dupi Tila aquifer \nin the Dhaka urban area, Bangladesh \n DWASA (2000)  Management Information Report for the Month of November 2000.  Dhaka Water Supply and Sewerage Authority, \nDhaka Bangladesh \nEiswirth M, Wolf L and Hotzl H 2002.  Balancing the contaminant input into urban water resources.  In:  Procs XXXII IAH and VI \nALHSUD Congress on groundwater and human development.  Mar del Plata 21-25 October 2002 \nEllis J B (1997)  Groundwater pollution from infiltration of urban stormwater runoff.  In Groundwater in the Urban Environment: \nProblems Processes and Management, P J Chilton et al (eds.) Balkema, Rotterdam, 131-136 \nFoster S S D, Morris B L and Lawrence A R (1993)   Effects of urbanisation on groundwater recharge.  ICE International Conference \non Groundwater Problems in Urban Areas, London, June 1993. \nFoster S S D, Lawrence A R, Morris B L (1998)  Groundwater in urban development: assessing management needs and formulating \npolicy strategies.  World Bank Technical Paper 390, WB Washington DC. \nKrothe J N, Garcia-Fresca B and Sharp Jr. J M  2002.  Effects of urbanisation on groundwater systems.  In:  Procs XXXII IAH and \nVI ALHSUD Congress on groundwater and human development.  Mar del Plata 21-25 October 2002 \nLawrence A R, Morris B L, Gooddy D C, Calow R and Bird M J (1997)  The study of the pollution risk to deep groundwaters from \nurban wastewaters: project summary report.  British Geological Survey Technical Report WC\/97\/15, Keyworth UK. \nMorris B L, Lawrence A R and Stuart M E (1994)  The impact of Urbanisation on Groundwater Quality (Project Summary Report).  \nBritish Geological Survey Report WC\/94\/56. \nUNCHS (1987)  Global Report on Human Settlements. UN Centre for Human Settlements, Oxford University Press, New York \nUNEP (1992)  The World Environment 1972-92, UNEP Nairobi \nUN Population Division (1995)  World urbanisation prospects, 1994 revision.  UN New York 1995, Tables A12, A14 \nWorld Bank (2000)  World Development Report 2000-2001.  Oxford University Press New York \n \n \n \n \nFigure 1  Groundwater setting of Dhaka (modifed from Ahmed et al. 1999) \nFigure 2  Public water supply distribution zones of urban area of Dhaka \nFigure 3  Decline in construction-date static water levels in Dhaka public-supply wells, 1970-2000 \nFigure 4  Decline in construction-date pumping water levels in Dhaka public-supply wells, 1970-2000 \nFigure 5  Productivity decline in newly-commissioned Dhaka public-supply wells, 1970-2000 \nFigure 6  Response of Dhaka aquifer to effects of intensive abstraction. \nFigure 7  Percentile distribution diagram for specific capacity by water-supply distribution zone \nFigure 8  Increase in groundwater recharge due to urbanisation (modified from Foster et al 1993, Krothe et al. 2002, \nEiswirth et al. 2002) \nTable 1  Well lining design trends, DWASA boreholes 1970-2000 \n \nLength (m) 1970-80 1981-90 1991-00 \nPump housing 41 49 71 \nPlain casing 46 45 24 \nSub-total plain 87 94 95 \nScreen section 48 50 50 \nMidpoint screen \ndepth \n110 119 120 \nSand sump 2 3 4 \nTotal depth 137 147 149 \n \n \n \nTable 2  Average midpoint screen depths in metres below ground level, DWASA boreholes 1970-2000 \n \nCity Zone 1970-80 1981-90 1991-00 \nZone 1 120.3 126.1 138.8 \nZone 2 105.5 118.9 115.5 \nZone 3 - 97.6 106.6 \nZone 4 - 104.9 100.3 \nZone 5 - 125.8 123.4 \nZone 6 - 125.3 130.6 \nAll zones 110.4 118.8 119.9 \n \nBuriganga\nRiver\nBalu\nRiver\nDHAKA\nW E\nMadhupur\nClay\nDupi Tila Sand\nAlluvium\nfault fault\nRecharge\nRoutes\n \nFigure 1 Groundwater setting of Dhaka (modifed from Ahmed et al.1999) \n \n \n \n\u0001\u0002\u0003\u0004\u0005\u0006\n\u0001\u0002\u0003\u0004\u0005\u0006\u0001\u0002\u0003\u0004\u0002\u0006\n\u0004\u0007\u0003\b\u0005\u0006\n\t\n\n\u000b\f\n\r\n\u000e\n\u000f\u0010\n\u0011 \u000b\n\u0012\n\f\u0013\n\n\n\u000e\n\u000f\u0010\n\u0011\n\u000b\n\u0001 \u0002\u0003\u0004\n\u0001\n\u0002\n\u0003\n\u0004\n\u0005\n\u0006\n\u0007\b\t\n\t\n\u0001\u0002\u0003\u0004\u0002\u0006\n\u0004\u0007\u0003\u0005\u0002\u0006\n\u0004\u0007\u0003\b\u0005\u0006\n\u0012\n\u000b\u000f\r\f\u0014\r\f\n\u000e\u000f\u0010\u0011\u000b\n\u000b\f\r\u000e\u000f\u0010\u0011\n\u0004\u0007\u0003\u0005\u0002\u0006\n \nFigure 2 Public water supply distribution zones of urban area of Dhaka \ny = 1E-67e0.0787x\nR2 = 0.5658\n0\n10\n20\n30\n40\n50\n60\n1970 1975 1980 1985 1990 1995 2000\nYear\nR\nes\nt w\nat\ner\n le\nve\nl (\nm\nbg\nl)\n \n \n  \n \n \n \n \n \n \n \nFigure 3 Decline in construction-date static  water levels in Dhaka public-supply wells, 1970-2000 \n \n \ny = 2E-45e0.0535x\nR2 = 0.5034\n0\n10\n20\n30\n40\n50\n60\n70\n80\n1970 1975 1980 1985 1990 1995 2000\nYear\nPu\nm\npi\nng\n w\nat\ner\n le\nve\nl (\nm\nbg\nl)\n \nFigure 4 Decline in construction-date pumping water levels in Dhaka public-supply wells, 1970-\n2000 \n2 \n6.3\n5.7\n4.5\n0\n1\n2\n3\n4\n5\n6\n7\nSp\nec\nifi\nc \nca\npa\nci\nty\n (l\n\/s\nec\n\/m\n)\n1970-1980 1981-1990 1991-2000\nAverage for period\nFigure 5 Productivity decline in newly-commissioned Dhaka public-supply wells, 1970-2000 \n \n \n \n \n \n \nmbgl\n0\n20\n40\n60\n80\n100\n120\n140\n160\n1970’s\nREADY RECHARGE TO SHALLOW\nWATER TABLE\nLATE 1990’s\nIMPEDED RECHARGE THROUGH THICK\nUNSATURATED ZONE\nMADHUPUR SILTY\nCLAY AQUITARD\nD U P I  T I L A\nS A N D\nA Q U I F E R\nDEVELOPMENT\nSTAGE\nKvc\n \nSAT\nKvu\n \nSAT\nKvc\n \nUNSAT\nKvu\n \nSAT\nKvu\n \nUNSAT\nRelative permeability comparison:\nKvu\n \nSAT > Kvu\n \nUNSAT > Kvc\n \nSAT >> Kvc\n \nUNSAT\n41\n87\n135\n137\n71\n95\n145\n149\nboth aquitard\nand upper\naquifer saturated\naquitard and\n10m+ of upper\naquifer dewatered\nWL\nPUMP HOUSING\nPLAIN CASING\nSCREEN\nPUMP HOUSING\nPLAIN CASING\nSCREEN\n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 6 Response of Dhaka aquifer to effects of intensive abstraction. \n3 \nZone number\n1 2 3 4 5 6\nSp\nec\nifi\nc \nca\npa\nci\nty\n (l\n\/s\n\/m\n)\n0\n2\n4\n6\n8\n10\n12\n95 %ile\n90 %ile\n75 %ile\nMedian\n25 %ile\n10 %ile\n5 %ile\nKey\nFigure 7 Percentile distribution diagram for specific capacity by water supply distribution zone  \n \n\u0005\u0006\u0007\b\t\u0006\n\u000b\t\f\r\u000e\u0006\t\u000f\f\n\u0012 \t\u0013\u0014 \u0010\u000f\b\u0006\u0011\r\u0006\n\u0012\f\u0005\u0007\f\u0011\u0013\u000b\u0014\f\u0015\u0012\r\u0016\n\u0013\u0014 \u0017\u0006\t\u0006\r\u0006\u0011\u0013\u000b\u0018\f\u0005\f\u0019\b\f\n\u0006\n\u0007\u0014 \u001a\t\f\u0011\u001b\f\u0005\u0013\u000b\u001c\f\t\u0004\u0006\u0005\u001d\n\b\u0015\u0014 \u001e\u0006\u0007\u000b\u001f\u0006\u0012\u0013\u000b \u000e\u0006\u0012\n\u0006\u0005\u001b\n\u0012\u0014 !\u0012\u0004\u0006\u0013\u000b\"\f\t\b\n\u0012\t\u0014 !\u0016\u0011\u000b\u0010\u0005\u000f\f\n\f\u0011\u0013\u000b#$\u0010\n\u0016\u0014 \u0014%\t\u0012\u001b\u0006\u0013\u000b\u0014\f\u0015\u0012\r\u0016\n\u0017\u0014 \"\f\t\u0007\u000e\u0013\u000b\u0010\b\u0011\u0007\t\u0006\n\u0012\u0006\n\u0018 &\u0006\u0011\u0007\u0006\u0007\u0007\u0013\u000b\u001c\f\t\u0004\u0006\u0005\u001d\n\u0019\u0014 $\f\u0016\b\n\u0013\u000b'\u0016\t\f\u0006\n\u0019\u0013\u0014 $\u0006\u0005\u0007\u0006\u000b\u0017\t\b\u0019\u0013\u000b(\u0016\n\u0012)\u0012\u0006\n\u001a\u0014 *\u0016\n)\f\t\u000e\u0006\u0004+\u0007\u0016\u0005\u0013\u000b#'\n,\u0001\u0001\u0001 -\u0001\u0001\u0001 \u0002\u0001\u0001 ,\u0001\u0001 -\u0001\u0001 \u0002\u0001 ,\u0001 -\u0001\n\u0015\u0016\u0017\u0011\u0014\u0017\u000f\f\u0013\u0018\n\u000b\u0019\f\u0014\u0018\u000b\u0011\u001a\u001b\f\u000b\r\u0011\n\u001c\u001d\f\u000f\u0014\u001e\u0018\u0013\u0011\f\u001f\f\r\u0011 \n\n\u000b\u0019\f\u0014\u0018!\u000b\f\u000f\u0014\f\r\u0011\u0018\f\u0014!\n\"\f\u001e\u0017\u0011#\"\f\u0017\u0011\u000b\u0018!\u000f\u001e$\u0016\u001e\f\u0013 \n\u0014\f\u0017\n\u000b\f\u0013\u0018\u000b\u0011\u001a\u001b\f\u000b\r\u0011%\n&\f\u0017\n\u000b\f\u0013 \u001c\u0014\u0016\u0014#\n\u000b\u0019\f\u0014% \u0011\u0014\u0010\u000f\u000b\u0016\u0014\u001d\n\u0011\u0014\u0017\n\u0007\u0016\u0007\u0006\n\u000b\t\f\r\u000e\u0006\t\u000f\f\n.+\t\f\/\b\t0\u0006\u0005\n\u000b\t\f\r\u000e\u0006\t\u000f\f\u000b\u0005\u0012\n1\n-\u0001\n\u0002\n,\u0001\n\u0002\u0001\n-\u0001\u0001\n,\u0001\u0001\n\u0002\u0001\u0001\n-\u0001\u0001\u0001\n,\u0001\u0001\u0001 !\u0012\u0003\f\n\u001d\u000b\u0004\u0006\u0015\u0012\u0004\b\u0004\u000b)\u0006\n\b\f\u000b2\u0016\t\u000b\b\u0005\u0011\f3\f\t\f\u001b\u000b\r\u0012\u0007\u001d\u000b3\u0012\u0007\u000e\u0016\b\u0007\u000b\u0004\u0006\u0012\u0005\u0011\u000b\u001b\t\u0006\u0012\u0005\u0006\u000f\f\n\b\u001b\u0016\u001c\u0007 \u0019\u001d\u0016\u001c\u001e\t\u0018\u001c\u0007 \t\u0018\u001c\u0007\n&\u0006\u0012\u00052\u0006\n\n\u000b.\u0004\u00044\u00061\n\u001a\n\f\f\n+\u000b\n\u0012\u0005\n2\u0012\n\n\u0007\t\n\u0006\u0007\n\u0012\u0016\n\u0005\u000b\n.\u0004\n\u0004\n4\u0006\n1\n\u0011\f3\f\t\f\u001b \r\u0012\u0007\u001d 3\u0012\u0007\u000e \u0004\u0006\u0012\u0005\u0011 \u001b\t\u0006\u0012\u0005\u0006\u000f\f\n\"\t\u00160\u00060\n\f \u0004\u0012\u0005\u0012\u0004\b\u0004 )\u0006\n\b\f 2\u0016\t\u0012\t\n\b\u0015\n\u0019\n\u0019\u0013\n\u0017\n\u0007\u001a\n\t\n\u0016\n\u0013\n\u0018\n \n \nFigure 8 Increase in groundwater recharge due to urbanisation (modified from Foster et al. 1993, \nKrothe et al. 2002, Eiswirth et al. 2002) \n \n4 \n"}