{"doi":"10.1111\/j.1574-6941.2007.00400.x","coreId":"191844","oai":"oai:lra.le.ac.uk:2381\/3525","identifiers":["oai:lra.le.ac.uk:2381\/3525","10.1111\/j.1574-6941.2007.00400.x"],"title":"Photosynthetic genes in viral populations with a large genomic size range from Norwegian coastal waters","authors":["Sandaa, Ruth-Anne","Clokie, Martha R.J.","Mann, Nicholas H."],"enrichments":{"references":[{"id":44631426,"title":"Bacteriophage diversity in the North Sea.","authors":[],"date":"1998","doi":null,"raw":"Wichels A, Biel SS, Gelderblom HR, Brinkhoff T, Muyzer G & Schütt C (1998) Bacteriophage diversity in the North Sea. Appl Environ Microbiol 64: 4128-4133.","cites":null},{"id":44631395,"title":"Dynamics and Distribution of Cyanophages and Their Effect on Marine Synechococcus Spp.","authors":[],"date":"1994","doi":"10.3354\/meps092099","raw":"Suttle CA & Chan AM (1994) Dynamics and Distribution of Cyanophages and Their Effect on Marine Synechococcus Spp. Applied and Environmental Microbiology 60: 3167-3174.","cites":null},{"id":44631239,"title":"Genome size distributions indicate variability and similarities among marine viral assemblages from diverse environments.","authors":[],"date":"2000","doi":"10.4319\/lo.2000.45.8.1697","raw":"Steward GF, Montiel JL & Azam F (2000) Genome size distributions indicate variability and similarities among marine viral assemblages from diverse environments. Limnology and Oceanography 45: 1697-1706.","cites":null},{"id":44631423,"title":"Giant viruses infecting algae.","authors":[],"date":"1999","doi":"10.1146\/annurev.micro.53.1.447","raw":"Van Etten JL & Meints RH (1999) Giant viruses infecting algae. Annual Review of Microbiology 53: 447-494.","cites":null},{"id":44631424,"title":"Growth of Prochlorococcus, a photosynthetic prokaryote, in the equatorial Pacific ocean.","authors":[],"date":"1995","doi":"10.1126\/science.268.5216.1480","raw":"Vaulot D, Marie D, Olson RJ & Chisholm SW (1995) Growth of Prochlorococcus, a photosynthetic prokaryote, in the equatorial Pacific ocean. Science 268: 1480-1482.","cites":null},{"id":44631397,"title":"Infection of Phytoplankton by Viruses and Reduction of Primary Productivity.","authors":[],"date":"1990","doi":"10.1038\/347467a0","raw":"Suttle CA, Chan AM & Cottrell MT (1990) Infection of Phytoplankton by Viruses and Reduction of Primary Productivity. Nature 347: 467-469.","cites":null},{"id":44631238,"title":"Isolation and characterization of two viruses with large genome size infecting Chrysochromulina ericina (Prymnesiophyceae) and Pyramimonas orientalis (Prasinophyceae).","authors":[],"date":"2001","doi":"10.1006\/viro.2001.1161","raw":"Sandaa RA, Heldal M, Castberg T, Thyrhaug R & Bratbak G (2001) Isolation and characterization of two viruses with large genome size infecting Chrysochromulina ericina (Prymnesiophyceae) and Pyramimonas orientalis (Prasinophyceae). Virology 290: 272-280. (PFGE). Methods in Microbiology, Vol 30, pp. 85-103.","cites":null},{"id":44631393,"title":"Marine Cyanophages Infecting Oceanic and Coastal Strains of Synechococcus - Abundance, Morphology, Cross-Infectivity and Growth-Characteristics.","authors":[],"date":"1993","doi":"10.3354\/meps092099","raw":"Suttle CA & Chan AM (1993) Marine Cyanophages Infecting Oceanic and Coastal Strains of Synechococcus - Abundance, Morphology, Cross-Infectivity and Growth-Characteristics. Marine Ecology-Progress Series 92: 99-109.","cites":null},{"id":44631398,"title":"PAUP*: Phylogenetic Analysis Using Parsimony (and Other Methods). Sinauer Associates,","authors":[],"date":"2000","doi":"10.1017\/cbo9780511819049.010","raw":"Swofford DL (2000) PAUP*: Phylogenetic Analysis Using Parsimony (and Other Methods). Sinauer Associates, Sunderland MA.","cites":null},{"id":44631427,"title":"Population dynamics of Chesapeake bay virioplankton: Total-community analysis by pulsed-field gel electrophoresis.","authors":[],"date":"1999","doi":null,"raw":"Wommack KE, Ravel J, Hill RT, Chun JS & Colwell RR (1999) Population dynamics of Chesapeake bay virioplankton: Total-community analysis by pulsed-field gel electrophoresis. Applied and Environmental Microbiology 65: 231-240.","cites":null},{"id":44631379,"title":"Prevalence and Evolution of core Photosystem II genes in Marine Cyanobacterial viruses and their hosts.","authors":[],"date":"2006","doi":"10.1371\/journal.pbio.0040234","raw":"Sullivan MB, Lindell D, Lee JA, Thompson LR, Bielawski JP & Chisholm SW (2006) Prevalence and Evolution of core Photosystem II genes in Marine Cyanobacterial viruses and their hosts. Plos Biology 4: e234.","cites":null},{"id":44631425,"title":"Resistance to Cooccurring Phages Enables Marine Synechococcus Communities to Coexist with Cyanophages Abundant in Seawater.","authors":[],"date":"1993","doi":null,"raw":"Waterbury JB & Valois FW (1993) Resistance to Cooccurring Phages Enables Marine Synechococcus Communities to Coexist with Cyanophages Abundant in Seawater. Applied and Environmental Microbiology 59: 3393-3399.","cites":null},{"id":44631421,"title":"The CLUSTAL X windows interface: flexible strategies for multiple sequence alignment aided by quality analysis tools.","authors":[],"date":"1997","doi":"10.1093\/nar\/25.24.4876","raw":"Thompson JD, Gibson T, Plewniak F, Jeanmougin F & Higgins DG (1997) The CLUSTAL X windows interface: flexible strategies for multiple sequence alignment aided by quality analysis tools. Nucleic Acids Res. 25: 4876–4882.","cites":null},{"id":44631241,"title":"Three Prochlorococcus cyanophage genomes: Signature features and ecological interpretations.","authors":[],"date":"2005","doi":"10.1371\/journal.pbio.0030144","raw":"Sullivan MB, Coleman ML, Weigele P, Rohwer F & Chisholm SW (2005) Three Prochlorococcus cyanophage genomes: Signature features and ecological interpretations. Plos Biology 3: 790-806.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-01","abstract":"This is the final draft of the authors paper published as FEMS Microbiology Ecology, 2008, 63 (1), pp.2-11. The final published version is available at http:\/\/www.blackwell-synergy.com\/doi\/full\/10.1111\/j.1574-6941.2007.00400.","downloadUrl":"http:\/\/hdl.handle.net\/2381\/3525","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/3525\/1\/ClokieCompleteDoc.pdf","pdfHashValue":"124683b8e3b65b893b98603c3ffd21cacd38b1cf","publisher":"Blackwell Publishing","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/3525<\/identifier><datestamp>\n                2008-07-02T08:19:57Z<\/datestamp><setSpec>\n                com_2381_6<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_9<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nPhotosynthetic genes in viral populations with a large genomic size range from Norwegian coastal waters<\/dc:title><dc:creator>\nSandaa, Ruth-Anne<\/dc:creator><dc:creator>\nClokie, Martha R.J.<\/dc:creator><dc:creator>\nMann, Nicholas H.<\/dc:creator><dc:description>\nThis is the final draft of the authors paper published as FEMS Microbiology Ecology, 2008, 63 (1), pp.2-11. The final published version is available at http:\/\/www.blackwell-synergy.com\/doi\/full\/10.1111\/j.1574-6941.2007.00400.x<\/dc:description><dc:date>\n2008-02-11T12:27:40Z<\/dc:date><dc:date>\n2008-02-11T12:27:40Z<\/dc:date><dc:date>\n2008-01<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nJournal of FEMS Microbiology Ecology, 2008, 63 (1), pp.2-11<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/3525<\/dc:identifier><dc:language>\nen<\/dc:language><dc:publisher>\nBlackwell Publishing<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article"],"fullText":"1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n \n \nPhotosynthetic genes in viral populations with a large genomic size range \nfrom Norwegian coastal waters. \n \n \nRuth-Anne Sandaa1 , Martha Clokie2, Nicholas H. Mann3\n \n1 University of Bergen, P.O. Box 7800, Department of Biology, N-5020 Bergen, Norway. \n2Department of Infection, Immunity and Inflammation, Maurice Shock Medical Sciences \nBuilding, University of Leicester, Leicester LE1 9HN, United Kingdom \n3Department of Biological Sciences, University of Warwick, Coventry CV4 7AL, United \nKingdom \n1 Corresponding author \ne-mail: ruth.sandaa@bio.uib.no \n \n \nJournal:  FEMS Microbial Ecology \n \nPages: 20 \n \nFigures: 2 \n \nTables: 2 \n \nRunning Title: Photosynthetic genes in uncultured viral populations \n \nKeywords: Cyanophage, Synechococcus, photosynthetic genes, viral genome size, Pulse field \ngel electrophoresis (PFGE). \n \n 1\nAbstract 1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n \nHere we report the diversity of uncultured environmental viruses harbouring photosynthetic \ngenes (psbA and psbD) in samples from cold sea water (latitude above 60o).  The viral \ncommunity in coastal Norwegian waters was separated according to genome size using pulse \nfield gel electrophoresis.  Viral populations within a wide genome size range (31 to 380 kb) \nwere investigated for the presence of the psbA and psbD genes using PCR, combined with \ncloning and sequencing. The results show the presence of photosynthetic genes in viral \npopulations from all size ranges.  Thus we are able to obtain valuable information about the \nsize class to which viral particles that encode photosynthesis genes belong.  The wide \ngenomic size range detected implies that we have observed a different cyanophage profile \nthan has previously been reported. Thus, the method of phage gene detection applied here \nmay represent a truer picture of phage diversity in general or that there is a larger range of \nsize profile for viruses with psbA and psbD in higher latitudes than for the better studied \nlower latitudes.  Alternatively we may be observing a picture of diversity based on a different \nset of biases than that from either isolation-based research, or from conventional \nmetagenomic approaches.   \n \n 2\n1. Introduction 1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n \nThe main prokaryotic component of the picophytoplankton in the photic zone of the world´s \noceans consist of marine unicellular cyanobacteria from the genera Synechococcus and \nProchlorococcus. Together they contribute to up to 89 % of the primary production in the \noligotrophic regions of the oceans (Li, 1995, Liu, et al., 1997, Partensky, et al., 1999). \nCyanophages are viruses that infect cyanobacteria and are, like their hosts, ubiquitous in \nmarine environments. They are found in concentrations up to 106 particles\/ml in coastal \nwaters during the summer period and are considered a significant factor in determining the \ndynamics of cyanobacterial populations (Suttle & Chan, 1993, Waterbury & Valois, 1993, \nSuttle & Chan, 1994).   \nGenes involved in photosynthesis have recently been detected in cyanophages (Mann, \n2003). These genes (psbA and psbD) codes for two proteins, D1 and D2, that form the \nreaction centre dimer of photosystem II (PSII).  DI is common to all oxygenic phototrophs \nand has a high turnover rate as a result of photo-damage (Aro, et al., 1993) .  Both psbA and \npsbD genes have been reported in cyanophages infecting Synechococcus  (Mann, 2003, \nMillard, et al., 2004, Mann, et al., 2005, Sullivan, et al., 2006),  Prochlorococcus (Lindell, et \nal., 2005, Sullivan, et al., 2005, Sullivan, et al., 2006)  and identified in BAC clones and \namplicons from environmental samples (Zeidner, et al., 2005).  Studies have shown that these \nphage-encoded photosynthetic genes are expressed in the host after infection (Lindell, et al., \n2005, Clokie, et al., 2006a). The expression of these genes may increase the fitness of the \nphage by ensuring the provision of energy for extended viral replication.  \nProchlorococcus is essentially ubiquitous between 40oN and 40oS, but is not found in \nwater where the temperature is less than 10oC (Olson, et al., 1990). This contrasts to \nSynechococcus, which is somewhat broader distributed in that it tolerates a wider range of \ntemperature. Prochlorococcus is normally about 10-fold more abundant than Synechococcus \nin the oligotrophic regions of the open oceans (Vaulot, et al., 1995), while Synechococcus \npopulations are most abundant both in coastal and colder waters (Reviewed in Partensky, et \nal., 1999). Most Synechococcus phage research has been carried out in low-latitude temperate \nand tropical waters and there is a lack of knowledge about the diversity of these phages in \nwaters of latitudes above 60o.  \nThe fact that most viral hosts have not been cultured has severely limited studies of viral \ndiversity. One characteristic of viruses, which varies over a wide range and is readily \n 3\ndetermined, is the genome size. Reported viral genomes range from a few to 1200 kb (Raoult, \net al., 2004, Cann, 2005). Pulsed field gel electrophoresis (PFGE) is a method that provides a \nseparation over the full range of intact viral genome sizes. Lately, this approach has been used \nin several studies to explore the dynamics in the communities of dsDNA viruses in the marine \nenvironment (Wommack, et al., 1999, Steward, et al., 2000, Castberg, et al., 2001, Larsen, et \nal., 2001, Riemann & Middelboe, 2002, Jiang, et al., 2003, Ovreas, et al., 2003, Larsen, et al., \n2004, Sandaa & Larsen, 2006). These studies have shown that the viral assemblage in the \nmarine environment is distributed in a genome size range from approximately 20 to 560 kb. \nThe most dominant populations have genome sizes between 20 and 100 kb (Wommack, et al., \n1999, Steward, et al., 2000, Ovreas, et al., 2003, Larsen, et al., 2004, Sandaa & Larsen, \n2006), which is also the size range of most isolated marine bacteriophages with dsDNA \ngenomes (Ackermann & DuBow, 1987, Jiang, et al., 2003). Infections by cyanophages were \nfirst reported in 1990 (Proctor & Fuhrman, 1990, Suttle, et al., 1990)  and isolates of these \ncyanoviruses have recently been characterised and sequenced (Suttle & Chan, 1993, \nWaterbury & Valois, 1993, Wilson, et al., 1993, Chen & Lu, 2002, Mann, et al., 2005). Most \nof the Synechococcus phages are tailed phages with dsDNA genomes mostly with genomes in \nthe range 100-200 kb belonging to the family Myoviridae (Mann, 2003).   \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \nThe objective of this study was to investigate the diversity of photosynthetic genes in \nuncultured cyanophages from Norwegian costal waters.  All previous studies of \nphotosynthetic viral genes have been either on isolated viruses (Lindell, et al., 2004, Millard, \net al., 2004, Lindell, et al., 2005, Sullivan, et al., 2005, Sullivan, et al., 2006) or using whole \nviral fractions (Zeidner, et al., 2005, Sullivan, et al., 2006). The approach described here is \nunique as it allows us to investigate the presence of photosynthesis genes in non-cultured \nviruses, but where the genome size of the virus is known.  This type of information can not be \nobtained from standard metagenomic data sets.  To do this, viral PFGE bands within a wide \ngenomic size range were investigated for the presence of the photosynthetic genes, psbA and \npsbD. PCR products with amplicons of these two genes were cloned, sequenced, and \nphylogenetic analyses were performed.  \n \n 4\n2. Material and Methods 1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n2.1. Sample collection \nCoastal water samples were collected at a station in Raunefjorden (60°16.2’N, 5°12.5’E), \nsouth of Bergen, Norway at nine different time points between 13th of April, to 2nd of \nNovember 2004 (Table 2). A total volume of 30 l was collected from the 2-meter depth. The \nsamples were collected using a hand pump connected to a flask. Temperature was measured \nusing a STD SAIV a\/s SD 204 with a Sea Point fluorometer (SAIV A\/S, Environmental \nSensors & Systems, Bergen, Norway).  \n \n2.2. Concentration of viral communities. \n \nNatural viral communities were concentrated from 25 l of seawater by ultrafiltration. The \nsamples were filtrated through a 0.45 µm pore-size low-protein-binding Durapore membrane \nfilters of 142 mm in diameter (Millipore) to remove zooplankton, phytoplankton and some \nbacteria. The filtered samples were then concentrated down to a final volume of around 150 to \n250 ml, using a 30 000 MW cuttoff spiral-wound Millipore ultrafiltration cartidge \n(Regenerated Cellulose, PLTK Prep\/scale TFF 1 ft2, Millipore). One hundred and forty ml of \nthis concentrate was concentrated further by ultracentifugation (Beckman L8-M with SW-28 \nrotor, Beckman GmbH, Germany) for 2 h at 25 000 rpm at 10 oC. The viral pellet was \ndissolved in 400 µl of SM buffer (0.1 M NaCl, 8 mM MgSO4.7H2O, 50 mM Tris-HCl (pH \n8.0), 0.005% (w\/v) glycerine). 200 µl was stored at –20ºC for quantitative Real-Time PCR \nanalysis, while 200 µl was used for PFGE analysis \n \n2.3. Pulse field gel electrophoresis (PFGE) \n \nFour virioplankton agarose plugs were made from the 200 µl concentrate. The samples were \nseparated on a 1%w\/v SeaKem GTG agarose (FMC, Rockland, Maine) gel in 1 X TBE gel \nbuffer using a Bio-Rad DR-II CHEF Cell (Bio-Rad, Richmond Ca, USA) electrophoresis unit \n(Wommack, et al., 1999). From each sample point three of the plugs were used, each at a \ndifferent pulse ramp condition in order to separate the large range of viral genome sizes: i): 1-\n5 s switch time with 20 h run time for separation of small genome sizes (0-130 kb); ii) 8-30 s \nswitch time with 20 h run time for separation of medium genome sizes (130-300 kb); iii) 20-\n40 s switch time with 22 h run time for separation of large genome sizes (300-600 kb). A \n 5\n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \nmolecular size standard (lambda ladder and 5 kb ladder (Bio-Rad, Richmond, California)) \nwas run on each side of the gel.  Further details of the procedure are found in (Larsen, et al., \n2001). The gels were visualized and saved as computer files using the Fujifilm imaging \nsystem, LAS-3000.  \n  \n2.4. PCRs, cloning and DNA sequencing.   \n \nPFGE bands to be investigated for the presence of photosynthetic genes were excised from \nthe gel and frozen at –20Co. The DNA was extracted from the gel by use of the GeneClean \nTurbo kit (BIO101) for extraction of large DNA fragments from agarose gel, following the \nmanufacturer’s instructions yielding approximately 10 ng\/µl of DNA (total 30 µl). The \ngenomic DNA required for sequencing and PCR were produced by the GenomiPhi DNA \namplification kit (Amersham Biosciences) according to the manufacturer’s instructions \nyielding approximately 1µg\/µl of DNA. This DNA was used in a PCR with both the primer \nsets targeting a section of the photosynthetic genes psbA and psbD (Table 1).  PCRs were \ncarried out in a total volume of 50 µl containing: sterile distilled water, PCR buffer (10 x PCR \nbuffer B, Promega, Madison, WI), dNTPs (each 200 nM), primers (each 0.5 μM), 1.5 mM \nMgCl, 2.5 U Taq DNA polymerase (Promega) and template amplicon (1-2 ng). Amplification \nconditions using the psbA primers were as follows: 94°C for 5 min, 10 cycles of 94°C for 30 \nsec, 64°C (-1°C per cycle) for 30 sec, and 72°C for 1 min. There was then an extension of 2 \nmin at 72°C, followed by 25 cycles of 94°C for 30 sec, 56.5°C for 30 sec, and 72°C for 1 min. \nThe final extension was at 72°C for 10 min. Furthermore, the amplification conditions for the \npsbD primers were: 94°C for 5 min, 35 cycles of 94°C for 1 min, 50°C 1 min, and 72°C for 1 \nmin, and a final extension at 72°C for 10 min.  The PCR products were cloned with the TOPO \nPCR cloning kit (Invitrogen, Paisley, UK) following the manufacturer’s description. The \nresulting reactions were used to transform competent Escherichia coli TOP10 (Invitrogen). \nFifteen positive clones (white colonies) from each library were picked randomly and \ntransferred by streaking onto agar plates. Positive clones were confirmed by PCR using the \nM13 primers according to the protocol (Invitrogen). Positive PCR products were purified \nusing the DNA Clean & Concentrator-5 kit (Genetix Limited, New Milton, UK).  Five \npositive PCR products from each cloning reaction were sequenced by cycle sequencing \naccording to the protocol from Perkin Elmer (Foster City, USA) using the cloning  primer \nM13f (Invitrogen) as sequencing primer.  Sequences were obtained on the ABI PRISM 3700 \nsequence analyser (Perkin-Elmer Applied Biosystem, USA).  \n 6\n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n \n2.5. Phylogenetic analysis. \nBetween two and five clones resulted in sequences of good quality and were used in the \nphylogenetic analysis. Analysis of DNA sequences was carried out by alignment to the closest \nrelative in the GenBank database using BLASTX (Altschul, et al., 1990).  Alignments were \nperformed using CLUSTALX (Thompson, et al., 1997). Sequences were initially aligned \nbased on protein sequences.  The protein alignment was then used to align the corresponding \nDNA sequences. Maximum parsimony and neighbor-joining (NJ) analysis were conducted on \nnucleotide dataset by using the test version of  PAUP* 4.0 beta10 (Swofford, 2000). Supports \nfor clades was estimated by means of bootstrap analysis, as implemented in PAUP* using \n1000 replicates. The trees were viewed using the TreeView program and rooted with either \nthe psbA or psbD gene of Synechocystis PCC 6803. The nucleotide sequences reported in this \npaper has been submitted to GenBank and assigned the accession numbers: psbD, DQ787206-\nDQ787235 and psbA, DQ787236-DQ787256. \n 7\n3. Results and Discussion. 1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \nHere we report the first study to investigate the diversity of uncultured environmental \nviruses harbouring photosynthetic genes (psbA and psbD) in samples from cold sea water.  \nThe study was performed by investigating nineteen PFGE bands in a broad size range (31-380 \nkb) from samples taken at different time periods (Fig. 1) based on information on the viral \ndiversity and cyanophage seasonal dynamics in Raunefjorden (Sandaa & Larsen, 2006). The \nbands which were chosen represented the brightest bands in each of the different size classes. \nThe viral community in Raunefjorden have shown a pronounced seasonal dynamic that \ncorrelates with changes in the abundance of possible hosts (Sandaa & Larsen, 2006). Most of \nthe bands examined in the present study were from samples collected between late September \nand early November. This is at the same time there is a bloom in the Synechococcus \npopulation in the fjord (Sandaa & Larsen, 2006). The bloom is followed by a peak in the \ncyanophage numbers, and is accompanied by a major change in the viral community structure \n(Sandaa & Larsen, 2006). The water temperature in Raunefjorden, at the sampling times was \nbetween 5,3 and 13,3°C (Table 2). Over a 10 months period, the water temperature at the \nsampling depth in Raunefjorden may vary between 5,2 to 15,4°C (Sandaa & Larsen, 2006). \nAs Prochlorococcus has not been reported in water with temperatures below 10°C (Olson, et \nal., 1990) it is reasonable to conclude that the putative uncultured cyanophages presented in \nthis study infect Synechococcus strains.  \nEleven out of 19 investigated PFGE bands in this study contained detectable \nphotosynthetic genes. The genes were detected in PFGE bands with genomic sizes from 31 to \n380 kb (Table 2). Although the size range of genomes containing psbA and psbD is larger \nthan has been described before, it may be even larger than we report, as bands smaller or \nlarger than this size range were not investigated. Eight of the PFGE bands contained both the \npsbA and psbD genes, while three of the PFGE bands had only one of the genes (Table 2). \nThe psbA and psbD genes are highly conserved (Lindell, et al., 2004, Millard, et al., 2004, \nSullivan, et al., 2006), suggesting that they encode functional proteins that may be involved in \nmaintaining host photosynthesis during infections (Clokie, et al., 2006a).  Most cultured \ncyanophages carry both the psbA and psbD genes (Lindell, et al., 2004, Millard, et al., 2004, \nSullivan, et al., 2006), however, some only contain psbA (Millard, et al., 2004, Sullivan, et \nal., 2006). Two of the PFGE bands in this study contained only the  psbA gene. However, in \ncontrast to earlier published findings, we amplified only the psbD gene from one of the PFGE \nbands (Table 2).  This is the first observation of cyanophages carrying the psbD gene, only. \nThese observations, along with the fact that psbD and psbA are very far apart from each other \n 8\nin Synechococcus genomes, implies that the genes have been acquired independently from \ntheir hosts. \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n Our present knowledge on the occurrence and diversity of the photosynthetic genes in \ncyanophages is mainly based on isolated phages, belonging to two viral families, Myoviridae \nand Podoviridae (Mann, 2003, Lindell, et al., 2004, Millard, et al., 2004, Sullivan, et al., \n2005, Sullivan, et al., 2006) and from their abundance in metagenomic data sets (Zeidner, et \nal., 2005, Sullivan, et al., 2006).  Metagenomic data sets have been very valuable in raising \nour awareness of the widespread nature of phage encoded photosynthesis genes but do not \nprovide further information about the phage biology.  Although whole and partial genome \nsequencing of cultured cyanophages has revealed psbA and psbD genes in Synechococcus \nmyoviruses, none have been shown to be in any Synechococcus podoviruses (Sullivan, et al., \n2006), however it should be noted that very few Podoviridae infecting Synechococcus have \nbeen isolated or sequenced. The genome size in cultured cyanophages varies from \napproximately 48-200 kb and the trend is for myoviral genomes (normally in the size range \n100-200 kb) to be larger than podoviral genomes which normally range from 38-48 kb \n(Wichels, et al., 1998, Mann, 2003). Forty-five percent of the observed PFGE bands with \nphotosynthetic genes, had genome sizes in this range (95-200 kb), however, 55 % fell outside \nthis normal size range. Three of the populations (S9, S12 and S13) were in the genomic size \nrange 31 to 67 kb, which according to size suggests they might belong to the Podo- or \nSiphoviridae.  So far, there is no report of Synechococcus phages from Siphoviridae, and only \nfew isolates reported belonging to Podoviridae (Waterbury & Valois, 1993, Fuller, et al., \n1998, Chen & Lu, 2002, Sullivan, et al., 2005, Sullivan, et al., 2006).  On the other hand, if \nthese viral populations belong to Myoviridae, this is also interesting as it suggests that the size \nrange of this taxonomic group must be much broader that earlier reported. The other viral \npopulations (3b, 5b, and S1) were in the genomic size range of 240 to 380 kb. Although it is \nmost likely that these are from Myoviridae, they are much bigger than any reported thus far.  \nAnother plausible explanation is that these photosynthetic genes are from viral populations \ninfecting photosynthetic picoeukariotes, as viruses infecting algae do have genome sizes in \nthis size range (Sandaa, et al., 2001, Castberg, et al., 2002,Van Etten & Meints, 1999). These \npsbA and D genes, however, exhibited highest similarity to other cyanophage and \nSynechococcus sequences in GenBank, not to photosynthetic genes in picoeukariotes. We \ntherefore believe that these genes are present in cyanophages infecting Synechococcus.  It \nshould though be stressed that these observations are based on genome size alone, and that \n 9\n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \nphysiological properties of the phage, e.g. viral morphology, is essential for correct definition \nof phage taxonomy. \n Phylogenetic analysis of the psbA and psbD was carried out in PAUP* using both \nmaximum parsimony and a neighbour-joining analysis (NJ).  The two methods gave \ncongruent results and those presented here are from the NJ analysis (Fig 2a and b). Most of \nthe clusters of the environmental sequences from this study lack sequences from cultured \ncyanophage or hosts, which suggests that these sequences may belong to phages that infects \nas-yet uncultured Synechococcus hosts.  This is a common observation when using culture- \nindependent approaches for investigation of environmental viruses.  The psbA sequences fell \ninto several distinct groups.  From the top of the tree and downwards, one clade of 7 psbA \nsequences  has 87% bootstrap support and consists only of environmental sequences \ndetermined in this study.  There is then an interesting group (with 76% bootstrap support) \nwhich contains both a new psbA sequences from this study, an environmental clone from the \nMonterey Bay, California (Zeidner, et al., 2003) and a known Synechococcus myophage S-\nRSM2.  Two smaller clades again contain 2 and 3 new environmental psbA sequences, \nrespectively.  The two Synechococcus strains included in this analysis form a clade with an \nenvironmental psbA sequence from the Monterey Bay, California (Zeidner, et al., 2003).  \nThere is one final large group which contains the remainder of the environmental psbA \nsequenced from Raunefjorden and which at its higher level contains 2 environmental \nsequences, one from the Red Sea (BAC9D04) and the other from the Mediterranean Sea \n(V141) (Zeidner, et al., 2005).  The sequence BAC9DO4 is from a putative podophage based \non the fact that genes upstream of it are podophage like (Zeidner & Béjà, 2004), but the phage \nhas not been isolated so the actual morphology has not been confirmed. Thirty eight percent \nof the psbA sequences from this study clustered in this large clade. If these viral populations \nare podophages, infecting Synechococcus, this is in contrasts to what has been shown using \ndifferent methods in other environments. Therefore it may be that the method of phage gene \ndetection employed here may represent a truer picture of phage diversity in general, or that \nphage diversity in high latitudes has a different profile to that from better studied lower \nlatitudes.  It may alternatively be that the method used in this study simply has a different set \nof biases than isolation-based or strict metagenomic approaches. Although the phage psbA \nsequences isolated here cluster with the sequence in BAC9D4, it should be emphasised that \nthere is significant variation at the nucleotide level, as there were a sequence differences of \napproximately 25 %.  \n 10\n The environmental psbD sequences obtained in this study fell into several distinct \ngroups (Fig 2b), showing greatest similarity to three Synechococcus myophages, syn1, syn10 \nand S-RSM2 (Millard, et al., 2004, Sullivan, et al., 2006).  It is worth mentioning that the \npsbD gene has only been detected in cyanophage isolates belonging to Myoviridae (Sullivan, \net al., 2006).  The isolate, S-RSM2 was isolated from the Gulf of Aquaba (Millard, et al., \n2004). PsbD appears to be a much better phylogenetic marker than psbA as all of these new \npsbD sequences were distinguishable from their host psbD genes, in contrast to the phage-\nencoded psbA genes that form a clade together with their host genes (Fig 2a and b). Thus, \ncompared to the phage encoded psbA genes, these new psbD genes might have had a longer \npurifying selection time resulting in a clear divergence of the viral and host psbD genes.  It \nmay alternatively be the case that there is less evolutionary constraint on psbD than psbA \ngenes and thus the phage-encoded versions can evolve more freely than phage-encoded psbA. \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n Interestingly, the psbD genes from the different clones partly cluster according to their \noriginal PFGE band.  In contrast, the psbA genes did not show any such relationship.  Thus, it \nseems that the level of diversity observed in the psbD gene is less than that observed in psbA \nwhere multiple very closely related genes were recovered from a single band. This might \nimply that the genes are moving or evolving (or both) independently, with different selection \npressures that also would result in phylogenetic differences.  Indeed, it may be that a specific \nphage ‘population’ may have multiple versions of psbA.  Alternatively, differences between \nthe trees may also be attributed to the fact that each PFGE band may consist of more than one \nviral population, with a similar genome sizes and so the clone library of one viral band can \nthus contain photosynthetic genes from different, but genetically similar cyanophages. \nAlthough, some of the photosynthetic genes in this study might originate from host genes, the \nfact that all the psbD sequences from Raunefjorden displayed greatest similarity to isolated \ncyanophages, and not to their hosts, is inconsistent with this assumption, confirming the \nreliability of both the viral concentration step and the PFGE analysis. In summary the psbD \nanalysis shows a clear diversity of phage encoded photosynthetic gene, whilst the psbA \nanalysis appears to suffer from homoplasy, despite this, it is still useful as it has hinted at the \nfamily affiliation to which 8 of the newly sequenced phage populations may belong. \n Using PFGE for studies of the viral community, it is possible to detect between 105 -\n106 viral particles per ml (Wommack, et al., 1999, Steward, 2001). One important issue is the \nsize of the viral genome that will influence the sensitivity of the method. For viruses with \nlarger genome sizes, the detection limit will be lower, e.g. a viral genome of 300 kb might be \ndetected down to 105 particles per ml (Steward, 2001). In our analysis we collected 25 l of \n 11\nsample that was concentrated by a factor of approximately 100.  If we assume a detection \nlimit of 10\n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n5, we need to have 103 particles per ml of one population to result in a signal on the \nPFGE gel.  \nIn order to produce sufficient DNA from the different PFGE bands, we applied a \ntechnique based on whole genome amplification, using the enzyme φ 29 DNA polymerase. \nThe φ 29 DNA polymerase is an enzyme which is widely used for rolling-circle amplification \nof plasmids and circular DNA templates (Dean, et al., 2002, Detter, et al., 2002). The strand-\ndisplacing enzyme has proofreading activity, is extremely sensitive, and has been shown to \namplify DNA of up to 70 kb (Blanco, et al., 1989). This polymerase has also been used for \nenvironmental whole-genome amplification of bacterial and viral communities(Abulencia, et \nal., 2006, Angly, 2006) and for a variety of genetical applications including sequencing and \nmicrosatellite marker and single nucleotide polymorphism (SNP) analysis of single \nindividuals (Jiang, et al., 2005). These results have demonstrated that the introduction of bias \nmay be due to the sizes of DNA templates (possibly sheared during extraction and mixing), \nrandom primer availability, and stochastic effects of amplifying from very low concentrations \nof template (Jiang, et al., 2005, Abulencia, et al., 2006). Another bias may be the differential \ncloning efficiency of amplified DNA compared to un-amplified DNA (Abulencia, et al., \n2006). Most of these biases will not be valid in our study as we used the multiple \ndisplacement amplification (MDA) approach to produce DNA that were used in a second \nPCR with specific primers. However, as our technique does apply several amplification steps, \nwe should be aware of errors in the PCR product that might place clones from the same viral \npopulation at different positions in the tree. \n  Our objective with this study was to describe the distribution and diversity of \nphotosynthetic genes in different genomic size ranges of viral populations, using a culture-\nindependent approach such as PFGE in combination with cloning and sequencing. With PFGE \nit is possible to gain information about the dominant and presumably the most active viral \npopulations in the samples, without the need for a cultureable host.  So far, most knowledge on \nphotosynthetic genes in phages is based on cultured cyanophages isolated using two \ncyanobacterial strains; Synechococcus WH7803 and Prochlorococcus Med4 as hosts.  Recent \nestimates have shown that more than 99 % of marine bacteria (potential phage hosts) are \nunculturable (Rappé & Giovannoni, 2003), supporting the importance of a culture- independent \napproach for studies of genetically and functional viral diversity in environmental samples. \nCompared to other culture-independent approaches, e.g. metagenome cloning (Zeidner, et al., \n2005), PFGE also provides us information about the genome size of the viruses.  Such \n 12\n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \ninformation can be used to suggest the likely family that these viruses belong to. Using this \napproach we discovered a much higher diversity in viral populations with photosynthetic genes \nthan previously reported. Our results document the naturally occurring genetic diversity among \nuncultured environmental viruses in samples from cold sea water.  Furthermore, the interesting \nfindings that viral populations of different sizes harbour photosynthetic genes that were \nphylogenetically similar supports the idea of promiscuous horizontal gene transfer of gene \nmodules within a common cyanophage gene pool. Thus, it might be hypothesized that marine \ncyanophages could have played a vital role in the evolution of photosynthetic gene diversity by \nproviding an accessible pool of portable genes and facilitating the reshuffling, acquisition and \nexchange of such genetic material. \n 13\nAcknowledgement 1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n \nWe are grateful to Thomas Sørlie for collecting the sea water samples and Mette Hordnes \n(UiB) for providing the water temperature data. This study was performed with financial \nsupport from Research Council of Norway project: Biodiversity patterns: blooms versus \nstable coexistence in the lower part of marine food webs and EU project: Bacterial single-cell \napproaches to the relationship between diversity and function in the sea (BASIC), Contract \nnumber: EVK3-CT-2002-00078 and   \n 14\n1 \n2 \nTable 1.  \nPrimers targeting the photosynthetic genes psbA and psbD. \nPrimer \nname \nSequence 5’-3’ Approximate \nproduct size (bp) \nReferences \npsbAf GTNGAYATHGAYGGNATHMGNGARCC 800 (Millard, et al., 2004) \npsbAr GGRAARTTRTGNGC   \npsbDf GGNTTYATGCTNMGNCARTT 380 (Clokie, et al., 2006b) \npsbDr CKRTTNGCNGTVAYCAT   \n 3 \n4  \n 15\nTable 2. Information about size range and sampling dates of investigated PFGE bands for the \npresence of the photosynthetic genes psbA and psbD, water temperature and number of \ncyanophages in the samples.  The number of  cyanophages was determined by real-time PCR, \nrespectively (Sandaa & Larsen, 2006).   \n1 \n2 \n3 \n4 \nViral \nbands \nDate of \nsampling \nGenome \nsize \n(Kb) \npsbA \ngene \npsbD\ngene \nWater \ntemperature \n(Co) \nCyanophages\nParticles \n(103\/ml)a\n2b 29.jun 300 - nd 7,8 2 \n3b 29.jun 255 + - 7,8 2 \n4b 29.jun 192 + + 7,8 2 \n5b 19.aug 380 + + 9,2 17 \n6b 10.aug 140 + + 8,0 nd \n7b 11.may 140 + - 6,1 11 \n8b 11.may 200 - - 6,1 11 \n1C2 13.apr 75 - nd 5,3 3 \nS1 02.nov 240 + + 13,3 21 \nS2 02.nov 200 + + 13,3 21 \nS5 02.nov 165 - - 13,2 21 \nS6 02.nov 145 - nd 13,2 21 \nS7 02.nov 139 - nd 13,2 21 \nS8 02.nov 95 + + 13,2 21 \nS9 02.nov 67 + + 13,2 21 \nS10 06.oct 64 - nd 11,3 30 \nS11 06.oct 46 - nd 11,3 30 \nS12 12.oct 44 + + 11,6 72 \nS13 28.sep 31 - + 11,5 21 \n5 \n6 \n7 \nnd= not determined \na Data published in (Sandaa & Larsen, 2006). \n \n 16\nFigure legends: 1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n \nFig.1 \nSchematic outline of viral populations determined by PFGE. Viral populations are defined by \ngenome size, and the outline is based on three different electrophoresis runs for each viral \nconcentrate. Numbers indicate bands that have sliced out and tested for the presence of psbA \nand psbD genes by PCR. Red dots: presence of both the psbA and psbD genes, Green dots: \npresence of  the psbA gene, Blue dots: presence of the psbD gene.  \n \nFig. 2. \nPhylogenetic affiliation of the psbA (a) and psbD (b) sequences from the clones isolated from \nPFGE bands (the first number indicates the PFGE band of origin (Table 2) and the second \nnumber indicates the clone number), and representative psbA and psbD sequences from six \nmarine cyanomyoviruses; P-SSM4, S-RSM2, S-RSM28, S-WHM1, S-PM2, S-RM88,  \n(GenBank accession no: NC006884, AJ628768, AJ629221, AJ628769, AJ630128, \nAJ629075), and the psbA gene from a putative podovirus BAC9D04 (a) (GenBank accession \nno: AY456121).  PsbA genes from three clones; eBAC65-3, RED-132-6-6 and V141 were \nalso included (a) (GenBank accession no: AY176623, AY176632, AY713429), and psbD \ngenes from three marine cyanomyoviruses; syn1, syn10 and syn30 (DQ473702, DQ473703, \nDQ473700). Both psbA and psbD genes from the cyanobacteria Prochlorococcus MED4, \nSynechococcus sp. WH7803 and Synechococcus sp. WH8103 were included in the analysis \n(GenBank accession no: NC 005072 and DQ473718, AF156980, DQ473687, DQ473716, \nrespectively). Trees were rooted with either the psbA or psbD gene from the freshwater \ncyanobacterium Synechocystis sp. PCC 6803 (GenBank accession no: X58825, NC 000911, \nrespectively). Text in bold and colour indicates the clones from this study retrieved from \nPFGE bands in the size range; Blue: < 100 kb, Black: 100-199 kb, Green: 200-299 kb, Red: \n>300 kb. Bootstrap values were generated with 1000 replicates; values < 75 is not shown. \nScale bar represents 0.1 substitutions per site.  \n \n 17\nReferences 1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \nAbulencia CB, Wyborski DL, Garcia JA, Podar M, Chen W, Chang SH, Chang HW, Watson \nD, Brodie E L, Hazen TC & Keller, M. (2006) Environmental whole-genome \namplification to access microbial populations in contaminated sediments. Appl Environ \nMicrobiol 72: 3291-3301. \nAckermann H-W & DuBow MS (1987) Viruses of prokaryotes. CRC Press Inc., Boca Raton, \nFL. \nAltschul S, Gish W, Miller W, Myers E & Lipman D (1990) Basic local aligment search tool. \nJ. Mol. Biol. 215: 403-410. \nAngly FE, Felts B, Breitbart M, Salamon P, Edwards RA, Carlson C, Chan AM, Haynes M, \nKelley S, Liu H, Mahaffy JM, Mueller JE, Nulton J, Olson R, Parsons R, Rayhawk S, \nSuttle, CA & Rohwer F (2006) The Marine Viromes of Four Oceanic Regions. PLoS Biol \n4: e368. \nAro E-M, Virgin I & Andersson B (1993) Photoinhibition of photosystem-2-inactivation, \nprotein damage and turnover. Biochim Biophys Acta. 1143: 113-134. \nBlanco L, Bernad A, LÃ¡zaro JM, MartÃ-n G, Garmendia C & Salas M (1989) Highly \nefficient DNA synthesis by the phage phi 29 DNA polymerase. Symmetrical mode of \nDNA replication. J Biol Chem 264: 8935-8940. \nCann A (2005) Principles of Molecular Virology. Elsevier Academic Press,, Burlington, MA, \nUSA. \nCastberg T, Larsen A, Sandaa RA, Brussaard CPD, Egge JK, Heldal M, Thyrhaug R, van \nHannen EJ & Bratbak G (2001) Microbial population dynamics and diversity during a \nbloom of the marine coccolithophorid Emiliania huxleyi (Haptophyta). Marine Ecology-\nProgress Series 221: 39-46. \nCastberg T, Thyrhaug R, Larsen A, Sandaa RA, Heldal M, Van Etten JL & Bratbak G (2002) \nIsolation and characterization of a virus that infects Emiliania huxleyi (Haptophyta). \nJournal of Phycology 38: 767-774. \nChen F & Lu J (2002) Genomic sequence and evolution of marine cyanophage P60: a new \ninsight on lytic and lysogenic phages. Appl Environ Microbiol 68: 2589-2594. \nClokie MRJ, Shan J, Bailey S, Jia Y, Krisch HM, West S & Mann NH (2006a) Transcription \nof a \"photosynthetic\" T4-type phage that infects marine cyanobacteria. Environmental \nMicrobiology 8: 827-835. \nClokie MRJ, Millard AD, Mehta JY & Mann NH (2006b) Virus isolation studies suggest \nshort-term variations in abundance in natural cyanophage populations of the Indian \nOcean. J Mar Biol Ass UK 86: 499-505. \nDean FB, Hosono S, Fang L, Wu X, Faruqi AF, Bray-Ward P, Sun Z, Zong Q, Du Y, Du J, \nDriscoll M, Song W, Kingsmore SF, Egholm M & Lasken RS (2002) Comprehensive \nhuman genome amplification using multiple displacement amplification. Proc Natl Acad \nSci U S A 99: 5261-5266. \nDetter JC, Jett JM, Lucas SM, Dalin E, Arellano AR, Wang M, Nelson JR, Chapman J, Lou \nY, Rokhsar D, Hawkins TL & Richardson PM (2002) Isothermal strand-displacement \namplification applications for high-throughput genomics. Genomics 80: 691-698. \nFuller NJ, Wilson WH, Joint IR & Mann NH (1998) Occurrence of a sequence in marine \ncyanophages similar to that of T4 g20 and its application to PCR-based detection and \nquantification techniques. Applied and Environmental Microbiology 64: 2051-2060. \nJiang S, Fu W, Chu W & Fuhrman JA (2003) The vertical distribution and diversity of marine \nbacteriophage at a station off Southern California. Microbial Ecology 45: 399-410. \nJiang Z, Zhang X, Deka R & Jin L (2005) Genome amplification of single sperm using \nmultiple displacement amplification. Nucleic Acids Res 33: e91. \nLarsen A, Flaten GAF, Sandaa RA, Castberg T, Thyrhaug R, Erga SR, Jacquet S & \n 18\n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \nBratbak G (2004) Spring phytoplankton bloom dynamics in Norwegian coastal waters: \nMicrobial community succession and diversity. Limnology and Oceanography 49: 180-\n190. \nLarsen A, Castberg T, Sandaa RA, Brussaard CPD, Egge J, Heldal M, Paulino A, Thyrhaug \nR, van Hannen EJ & Bratbak G (2001) Population dynamics and diversity of \nphytoplankton, bacteria and viruses in a seawater enclosure. Marine Ecology-Progress \nSeries 221: 47-57. \nLi WKW (1995) Composition of ultraphytoplankton in the central North-Atlantic. Mar Ecol \nProg Ser 122: 1-8. \nLindell D, Jaffe JD, Johnson ZI, Church GM & Chisholm SW (2005) Photosynthesis genes in \nmarine viruses yield proteins during host infection. Nature 438: 86. \nLindell D, Sullivan MB, Johnson ZI, Tolonen AC, Rohwer F & Chisholm SW (2004) \nTransfer of photosynthesis genes to and from Prochlorococcus viruses. Proceedings of the \nNational Academy of Sciences of the United States of America 101: 11013-11018. \nLiu HB, Nolla HA & Campbell L (1997) Prochlorococcus growth rate and contribution to \nprimary production in the equatorial and subtropical North Pacific Ocean. Microb Ecol \n12: 39-47. \nMann NH (2003) Phages of the marine cyanobacterial picophytoplankton. FEMS \nMicrobiology Reviews 27: 17-34. \nMann NH, Clokie MRJ, Millard A, Cook A, Wilson WH, Wheatley PJ, Letarov A & \nKrisch HM (2005) The genome of S-PM2, a \"photosynthetic\" T4-type bacteriophage that \ninfects marine Synechococcus strains. Journal of Bacteriology 187: 3188-3200. \nMillard A, Clokie MRJ, Shub DA & Mann NH (2004) Genetic organization of the psbAD \nregion in phages infecting marine Synechococcus strains. Proceedings of the National \nAcademy of Sciences of the United States of America 101: 11007-11012. \nOlson RJ, Chisholm SW, Zettler ER, Altabet MA & Dusenberry JA (1990) Spatial and \ntemporal distributions of prochlorophyte picoplankton in the North Atlantic Ocean. Deep-\nSea Research Part a-Oceanographic Research Papers 37: 1033. \nOvreas L, Bourne D, Sandaa RA, Casamayor EO, Benlloch S, Goddard V, Smerdon G, \nHeldal M & Thingstad TF (2003) Response of bacterial and viral communities to nutrient \nmanipulations in seawater mesocosms. Aquatic Microbial Ecology 31: 109-121. \nPartensky F, Hess WR & Vaulot D (1999) Prochlorococcus a marine photosynthetic \nprokaryote of global significance. Microbiol Mol Biol Rev 63: 106–127. \nProctor LM & Fuhrman JA (1990) Viral Mortality of Marine-Bacteria and Cyanobacteria. \nNature 343: 60-62. \nRaoult D, Audic S, Robert C, Abergel C, Renesto P, Ogata H, La Scola B, Suzan M &  \nClaverie J (2004) The 1.2-megabase genome sequence of Mimivirus. Science 306: 1344-\n1350. \nRappé M & Giovannoni S (2003) The uncultured microbial majority. Annu Rev Microbiol 57: \n369–394. \nRiemann L & Middelboe M (2002) Stability of bacterial and viral community compositions in \nDanish coastal waters as depicted by DNA fingerprinting techniques. Aquatic Microbial \nEcology 27: 219-232. \nSandaa RA & Larsen A (2006) Seasonal variations in viral-host populations in Norwegian  \ncoastal waters: Focusing on the cyanophage community infecting marine Synechococcus \nspecies. Appl Environ Microbiol 72: 4610-4618. \nSandaa RA, Heldal M, Castberg T, Thyrhaug R & Bratbak G (2001) Isolation and \ncharacterization of two viruses with large genome size infecting Chrysochromulina ericina \n(Prymnesiophyceae) and Pyramimonas orientalis (Prasinophyceae). Virology 290: 272-\n280. \n 19\n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \nSteward GF (2001) Fingerprinting viral assemblages by pulsed field gel electrophoresis \n(PFGE). Methods in Microbiology, Vol 30, pp. 85-103. \nSteward GF, Montiel JL & Azam F (2000) Genome size distributions indicate variability and \nsimilarities among marine viral assemblages from diverse environments. Limnology and \nOceanography 45: 1697-1706. \nSullivan MB, Coleman ML, Weigele P, Rohwer F & Chisholm SW (2005) Three \nProchlorococcus cyanophage genomes: Signature features and ecological interpretations. \nPlos Biology 3: 790-806. \nSullivan MB, Coleman M, Weigele P, Rohwer F & Chisholm SW (2005) Three \nProchlorococcus cyanophage genomes: Signature features and ecological interpretations. \nPublic Library of Science 3: e144. \nSullivan MB, Lindell D, Lee JA, Thompson LR, Bielawski JP & Chisholm SW (2006) \nPrevalence and Evolution of core Photosystem II genes in Marine Cyanobacterial viruses \nand their hosts. Plos Biology 4: e234. \nSuttle CA & Chan AM (1993) Marine Cyanophages Infecting Oceanic and Coastal Strains of \nSynechococcus - Abundance, Morphology, Cross-Infectivity and Growth-Characteristics. \nMarine Ecology-Progress Series 92: 99-109. \nSuttle CA & Chan AM (1994) Dynamics and Distribution of Cyanophages and Their Effect \non Marine Synechococcus Spp. Applied and Environmental Microbiology 60: 3167-3174. \nSuttle CA, Chan AM & Cottrell MT (1990) Infection of Phytoplankton by Viruses and \nReduction of Primary Productivity. Nature 347: 467-469. \nSwofford DL (2000) PAUP*: Phylogenetic Analysis Using Parsimony (and Other Methods). \nSinauer Associates, Sunderland MA. \nThompson JD, Gibson T, Plewniak F, Jeanmougin F & Higgins DG (1997) The CLUSTAL X \nwindows interface: flexible strategies for multiple sequence alignment aided by quality \nanalysis tools. Nucleic Acids Res. 25: 4876–4882. \nVan Etten JL & Meints RH (1999) Giant viruses infecting algae. Annual Review of \nMicrobiology 53: 447-494. \nVaulot D, Marie D, Olson RJ & Chisholm SW (1995) Growth of Prochlorococcus, a \nphotosynthetic prokaryote, in the equatorial Pacific ocean. Science 268: 1480-1482. \nWaterbury JB & Valois FW (1993) Resistance to Cooccurring Phages Enables Marine \nSynechococcus Communities to Coexist with Cyanophages Abundant in Seawater. \nApplied and Environmental Microbiology 59: 3393-3399. \nWichels A, Biel SS, Gelderblom HR, Brinkhoff T, Muyzer G & Schütt C (1998) \nBacteriophage diversity in the North Sea. Appl Environ Microbiol 64: 4128-4133. \nWilson WH, Joint IR, Carr NG & Mann NH (1993) Isolation and Molecular Characterization \nof 5 Marine Cyanophages Propagated on Synechococcus Sp Strain Wh7803. Applied and \nEnvironmental Microbiology 59: 3736-3743. \nWommack KE, Ravel J, Hill RT, Chun JS & Colwell RR (1999) Population dynamics of \nChesapeake bay virioplankton: Total-community analysis by pulsed-field gel \nelectrophoresis. Applied and Environmental Microbiology 65: 231-240. \nZeidner G & Béjà O (2004) The use of DGGE analyses to explore eastern Mediterranean and \nRed Sea marine picophytoplankton assemblages. Environ Microbiol 6: 528–534. \nZeidner G, Bielawski JP, Shmoish M, Scanlan DJ, Sabehi G & Beja O (2005) Potential \nphotosynthesis gene recombination between Prochlorococcus and Synechococcus via viral \nintermediates. Environmental Microbiology 7: 1505-1513. \nZeidner G, Preston C, Delong EF, Massana R, Post AF, Scanlan DJ & Béjà O (2003) \nMolecular diversity among marine picophytoplankton as revealed by psbA analyses. \nEnviron Microbiol 5: 212–216. \n \n 20\n1   \n 21\nDate\n02.Nov12.Oct6.Oct28.Sept19.Aug10.Aug29.Jun11.May13.Apr\nG\ne\nn\no\nm\ni\nc\n \ns\ni\nz\ne\n \n(\nk\nb\n)\n0\n100\n200\n300\n400\n500\nFig 1\n2b\n3b\n4b\n5b\n6b7b\n8b\n1C2\nS1\nS2\nS5\nS6\nS7\nS8\nS9S10\nS11 S12\nS13\n100\n87\n98\n76\n100\n81\n100\n100\n100\n100\n100\n97\n75\n100\n77\n100\n97\n79\n85\n78\nFig 2a\nSynechocystis PCC 6803\nP-SSM4\nProchlorococcus MED4\nS2-1\nS2-6\nS12-19\n5b-5\nS9-23\nS8-11\nS12-16\n5b-4\nS-RSM2\neBAC65-3\nRED-132-6-6\nS8-12\nS8-13\nS8-14\nS9-24\neBAC65-10\nS2-10\nS-RSM28\nS-WHM1\nSynechococcus WH7803\nSynechococcus WH8102\nS-PM2\nS-RM88\nBAC9D04 uncultured Podovirus (?)\nS12-18\nV141 Viral fraction\nS12-20\n3b-22\nS9-15\nS12-17\nS2-7\nS9-25\nS2-9\nBlue: < 100 kb\nBlack: 100-199 kb\nGreen: 200-299 kb\nRed: >300 kb\nFig2b\nSynechocystis PCC 6803\nSynechococcus WH8102\nP-SSM4\nProchlorococcus MED4\nS-RSM2\nS-RSM28\nS-WHM1\nsyn19\nsyn30\nS9-5\nS1-3\nS8-1   \nS2-2\nS2-5\nS1-2\nS9-1\nS1-1\nS1-4\nS1-5\nS-BM4\nS-PM2\nsyn10\nsyn1\nS2-3\n4b-4\nS9-4\nS8-3\nS8-4\n4b-5\nS8-2\n5b-5\n5b-1\n5b-3\n5b-2\nS12-4\nS2-4\nS8-5\n5b-4\n4b-2\n4b-3\nS12-3\nS12-5\n100\n100\n100\n98\n87\n100\n100\n75\n98\n99 100\n97\n85\n100\n100\n100\n86\n78\n99\n91\n83\n100\n98\n4b-1\nBlue: < 100 kb\nBlack: 100-199 kb \nGreen: 200-299 kb\nRed: >300 kb\n\n"}