{"doi":"10.1103\/PhysRevB.77.033204","coreId":"102292","oai":"oai:epubs.surrey.ac.uk:1751","identifiers":["oai:epubs.surrey.ac.uk:1751","10.1103\/PhysRevB.77.033204"],"title":"Temperature dependence of the electron Landé <i>g<\/i> factor in InSb and GaAs","authors":["Litvinenko, K. L.","Nikzad, L.","Pidgeon, C. R.","Allam, J.","Cohen, L. F.","Ashley, T.","Emeny, M.","Zawadzki, W.","Murdin, B. N."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-01-29","abstract":"<p>We report Larmor precession in bulk InSb observed in the time domain from 77 to 300 K. The optically\noriented polarization precesses coherently even at 300 K. The inferred Zeeman spin splitting is strongly\nnonparabolic, and the electron <i>g<\/i> factor (<i>g<sup>*<\/sup><\/i>) is in good agreement with <b>k·p<\/b> theory (provided we take only the\ndilational contribution to the change in energy gap with temperature). We also show here that correct application\nof the 14-band <b>k·p<\/b> model agrees with apparently anomalous trends previously reported for GaAs and\nconfirm that the most widely quoted formula for <i>g<sup>*<\/sup><\/i> in GaAs is incomplete.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1751<\/identifier><datestamp>\n      2017-10-31T14:02:58Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:70686F746F6E696373<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1751\/<\/dc:relation><dc:title>\n        Temperature dependence of the electron Landé <i>g<\/i> factor in InSb and GaAs<\/dc:title><dc:creator>\n        Litvinenko, K. L.<\/dc:creator><dc:creator>\n        Nikzad, L.<\/dc:creator><dc:creator>\n        Pidgeon, C. R.<\/dc:creator><dc:creator>\n        Allam, J.<\/dc:creator><dc:creator>\n        Cohen, L. F.<\/dc:creator><dc:creator>\n        Ashley, T.<\/dc:creator><dc:creator>\n        Emeny, M.<\/dc:creator><dc:creator>\n        Zawadzki, W.<\/dc:creator><dc:creator>\n        Murdin, B. N.<\/dc:creator><dc:description>\n        <p>We report Larmor precession in bulk InSb observed in the time domain from 77 to 300 K. The optically\noriented polarization precesses coherently even at 300 K. The inferred Zeeman spin splitting is strongly\nnonparabolic, and the electron <i>g<\/i> factor (<i>g<sup>*<\/sup><\/i>) is in good agreement with <b>k·p<\/b> theory (provided we take only the\ndilational contribution to the change in energy gap with temperature). We also show here that correct application\nof the 14-band <b>k·p<\/b> model agrees with apparently anomalous trends previously reported for GaAs and\nconfirm that the most widely quoted formula for <i>g<sup>*<\/sup><\/i> in GaAs is incomplete.<\/p><\/dc:description><dc:date>\n        2008-01-29<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1751\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Litvinenko, K. L., Nikzad, L., Pidgeon, C. R., Allam, J., Cohen, L. F., Ashley, T., Emeny, M., Zawadzki, W. and Murdin, B. N.  (2008) Temperature dependence of the electron Landé g factor in InSb and GaAs   Physical Review B, 77 (033204).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevB.77.033204<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1751\/","10.1103\/PhysRevB.77.033204"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Temperature dependence of the electron Landé g factor in InSb and GaAs\nK. L. Litvinenko,1 L. Nikzad,1 C. R. Pidgeon,3 J. Allam,1 L. F. Cohen,3 T. Ashley,4 M. Emeny,4 W. Zawadzki,5 and\nB. N. Murdin1,*\n1Advanced Technology Institute, University of Surrey, Guildford GU2 7XH, United Kingdom\n2Department of Physics, Heriot-Watt University, Edinburgh EH14 4AS, United Kingdom\n3Blackett Laboratory, Imperial College London, Prince Consort Road, London SW7 2BZ, United Kingdom\n4QinetiQ Ltd., St. Andrews Road, Malvern WR14 3PS, United Kingdom\n5Institute of Physics, Polish Academy of Sciences, 02-688 Warsaw, Poland\n\u0001Received 29 September 2007; published 29 January 2008\u0002\nWe report Larmor precession in bulk InSb observed in the time domain from 77 to 300 K. The optically\noriented polarization precesses coherently even at 300 K. The inferred Zeeman spin splitting is strongly\nnonparabolic, and the electron g factor \u0001g*\u0002 is in good agreement with k ·p theory \u0001provided we take only the\ndilational contribution to the change in energy gap with temperature\u0002. We also show here that correct applica-\ntion of the 14-band k ·p model agrees with apparently anomalous trends previously reported for GaAs and\nconfirm that the most widely quoted formula for g* in GaAs is incomplete.\nDOI: 10.1103\/PhysRevB.77.033204 PACS number\u0001s\u0002: 72.25.Fe, 71.70.Ej, 72.25.Rb, 78.47.-p\nInSb is an interesting semiconductor from the point of\nview of tests of semiconductor band structure calculations\nbecause the heavy constituent atoms produce large relativis-\ntic effects such as spin-orbit coupling \u0001responsible for the\nlarge, negative gyromagnetic ratio\u0002. InSb is also a candidate\nmaterial for room-temperature spintronic devices such as the\nDas-Datta spin transistor, which relies on a coherent spin\npopulation manipulated by the Rashba effect, and thus, de-\ntailed investigation of the spin-electronic structure in this\nmaterial at room temperature is of high topical interest. In\nthe present work, we report the experimental measurement of\nthe g factor in InSb at temperatures up to 300 K and the\ntheoretical evaluation of g*\u0001T\u0002 for both InSb and GaAs.\nAlthough it has been claimed that measurements of the g\nfactor of GaAs at 300 K are inconsistent with k ·p perturba-\ntion theory,1–4 this theory has been successfully used for de-\ncades to calculate the band structure in bulk semiconductors\nand heterostructures,5–14 and, in particular, the conduction\nband effective mass and g factor. We show here that provided\nwe include only the dilational change of the energy gap with\ntemperature,8,13 we obtain reasonable agreement between ex-\nperiment and theory for the high-temperature g factor in both\nInSb and GaAs, and there is no anomaly. The higher band\nk ·p parameters have only a very small effect on the electron\ng factor for InSb, but they are very important for GaAs; in\nparticular, we confirm that it is essential to include the effects\nof the interband spin-orbit coupling parameter, which was\npreviously ignored in the Hermann and Weisbuch formula\nfor g* \u0001Ref. 9\u0002 used in Refs. 1 and 2.\nIn an externally applied magnetic field, the electron en-\nergy is given by\nE\u0001,n,kB\u0001B\u0002 =\n\u00022kB\n2\n2m*\n+ \u0003n + 12\u0004\u0002eBm* \u0001 12g*\u0003BB , \u00011\u0002\nmeasured from the \u00046 conduction band edge, where \u0003B is the\nBohr magneton, the quantum numbers \u0001 refer to the spin, n\nto the Landau level index, and kB to the component of mo-\nmentum parallel to the magnetic field B. In the parabolic\napproximation, the effective mass and g factor, m* and g*,\nare constants and independent of n, kB, and B. The nonpara-\nbolicity of GaAs is usually taken to be small because the\ndependence of the effective mass on electron energy is\nsmall.7 However, the g value, although small in magnitude,\nis significantly nonparabolic and changes from −0.44 at the\nband edge for low temperature to zero at an excess energy of\n80 meV.\nWe used a midinfrared circularly polarized pump-probe\ntransient absorption technique, which we have previously\nused for investigation of spin relaxation in narrow-gap\nsemiconductors.15,16 In this experiment, a subpicosecond la-\nser pulse excites electrons which quickly thermalize during\nthe pulse, filling up the conduction band, and the resulting\nchange in absorption \u0001a dynamic Moss-Burstein shift\u0002 is\nmeasured by the probe pulse. For InSb, both the light hole\nand electron effective masses are very much less than the\nheavy hole mass \u0001by a factor of \u000530\u0002, so that it is a good\napproximation to assume that the valence band is flat. The\nlaser induced transitions involve electron states whose ki-\nnetic energy is simply given by the laser photon energy mi-\nnus the optical energy gap. Bleaching of the probe absorp-\ntion, which is easy to achieve due to the small density of\nstates, therefore occurs when the conduction quasi-Fermi en-\nergy is also equal to the difference in the laser and band gap\nenergies. By inclusion of a small magnetic field in the Voigt\ngeometry, the optically oriented spins perform Larmor pre-\ncession and a sinusoidal modulation of the transmission\nchange is produced.1–4,15,17 The experimental sensitivity on\ndetermination of the precession frequency, and hence g*, was\nlimited by the electron spin lifetime which limits the number\nof cycles for available magnetic fields. The InSb sample used\nfor our study was undoped and 5 \u0003m thick, grown by\nmolecular-beam epitaxy on a semi-insulating GaAs sub-\nstrate. The mobility and carrier concentration \u0001n type\u0002 mea-\nsured by the Hall effect at 300 K \u000177 K\u0002 were 6.37 m2 \/V s\n\u00013 m2 \/V s\u0002 and 1.4\u00051015 cm−3 \u00012.8\u00051015 cm−3\u0002.\nTypical transients for different excitation wavelengths at\n77 K with an applied magnetic field of 0.288 T are shown in\nPHYSICAL REVIEW B 77, 033204 \u00012008\u0002\n1098-0121\/2008\/77\u00013\u0002\/033204\u00014\u0002 ©2008 The American Physical Society033204-1\nFig. 1. The shapes of the transients are well described by a\nsimple exponentially decaying sinusoid; the measured polar-\nization precesses coherently at angular frequency g*\u0003BB \/\u0002\nwhile decaying with the spin lifetime \u0006s. The measured pe-\nriod of the oscillation becomes longer for excitation energies\nabove the band gap illustrating the reduction of the absolute\nvalue of the effective g factor with the electron energy due to\nnonparabolicity. The macroscopic polarization decays be-\ncause spins of different quantum numbers n or kB precess at\ndifferent rates due to the nonparabolicity of g*, so the coher-\nence is lost by dephasing. Increasing the pump photon en-\nergy increases the electron quasi-Fermi energy and therefore\nreduces the coherence time, as shown in the inset of Fig. 1.\nThe effective g factor obtained from the transients for repre-\nsentative temperatures is plotted in Fig. 2 against excess op-\ntical energy above the band gap. The experiment is insensi-\ntive to the sign of g*, and we assume that it is negative.\nModeling of InSb using k•p theory requires only eight\nbands6,10 \u0001i.e., four spin-split bands: the three p-like \u00047 and\n\u00048 valence bands—heavy hole, light hole, and spin-orbit\nsplit-off bands—and the lowest \u00046 s-like conduction band\u0002\nbecause the energy separation between the \u00046 band and the\nnext conduction level is much greater than the fundamental\ngap. Accurate modeling of GaAs on the other hand requires\n14 bands \u0001i.e., also including the higher p-like \u00047 and \u00048\nconduction bands\u0002. The band-edge g factor from the 14-band\nmodel may be written analytically,7\ng*\n2\n= 1 −\nEP0\n3 \u0003 1G0 − 1E0\u0004 + EP13 \u0003 1G1 − 1E1\u0004\n−\n2\n9\n\u0007¯\u0006EP0EP1\u0003 2E1G0 + 1E0G1\u0004 + C\u0001, \u00012\u0002\nwhere EP0 and EP1 are the squared interband momentum\nmatrix elements, E0, G0, E1, and G1 are the energies of the\n\u00048 and \u00047 valences and \u00047 and \u00048 conduction bands, respec-\ntively, measured relative to the \u00046 conduction band edge. The\nvalence and higher conduction band spin-orbit splittings are\n\u00070=G0−E0 and \u00071=G1−E1, and \u0007¯ is the spin-orbit coupling\nenergy between the higher conduction band and the valence\nband. Equation \u00012\u0002 reduces to the expression derived by Her-\nmann and Weisbuch9 and used in Refs. 1 and 2 if one puts\n\u0007¯ =0. \u0007N.B., additional small corrections due to \u0007¯ to the\nenergies E0, etc., in the full formula from Ref. 7 have negli-\ngible effect and have been ignored in Eq. \u00012\u0002\b. For narrow-\ngap semiconductors \u0001NGSs\u0002, where E0 is small compared\nwith the other gaps, it is necessary to retain only the second\nterm on the right hand side of Eq. \u00012\u0002. It is plain that for\nInSb, accurate knowledge of fewer parameters is required.\nFor negligible higher band interactions, the energy depen-\ndence of the g factor for NGSs may be written analytically10\nif the spin splitting is small compared with E−E0 \u0001which it is\nfor all reasonable magnetic fields\u0002,\ng*\u0001E\u0002\n2\n= 1 −\nEP0\n3 \u0003 1\u00070 + E0 − E − 1E0 − E\u0004 . \u00013\u0002\nIn the case of InSb at low temperature where11\nE0=−0.2352 eV, EP0=23.1 eV, and \u00070=−0.803, this leads\nto g* \u0001E=0,T=0\u0002=−51 \u0001with negligible correction if we in-\nclude the higher band terms\u0002, and the low-temperature slope\ndg* \/dE is approximately 260 eV−1 at the band edge. The use\nof the full 8\u00058 Pidgeon-Brown matrix diagonalization6 in-\nstead of Eq. \u00013\u0002 results not only in an increase in the slope\ndg* \/dE but also in an increase in the nonparabolicity so that\nthe correction to g*\u0001E\u0002 is small. The model and the param-\neters agree well with experiment for low-temperature spin\nresonance.12\nIn order to model the temperature dependence of g* from\nFig. 2 \u0001or of m*\u0002, the temperature dependent band gap is\nrequired. The temperature dependence of the optical band\ngap is well known. However, there are two contributions to\nthe temperature change of the optical gap, which are firstly\ndue to lattice dilation arising from the fact that the ionic\npotential is anharmonic, \u0001\u0001E0 \/\u0001T\u0002P, and secondly the vibra-\ntional part is \u0001\u0001E0 \/\u0001T\u0002V. It is well known that the effective\n0 10 20 30 40 50\n0.00 0.15\n8\n12\n290meV\n390meV\n250meV\nn\no\nrm\na\nliz\ned\no\npt\nica\nl\npo\nla\nriz\nat\nio\nn\n(ar\nb.u\nnit\ns)\nTime delay (ps)\nτ\ns\n(ps)\nE (eV)\nFIG. 1. Measured spin precession as a function of time for InSb\ntaken using the circularly polarized pump-probe technique at 77 K\nand in an applied Voigt geometry magnetic field of 0.288 T. The\noptical excitation was of different wavelengths or photon energies:\n5 \u0003m\t250 meV \u0001circles\u0002, 4.3 \u0003m\t290 meV \u0001triangles\u0002, and\n3.2 \u0003m\t390 meV \u0001squares\u0002. The spin lifetime taken from the de-\ncay of the envelope as a function of the excess energy above the\noptical gap is shown in the inset.\n0.00 0.05 0.10 0.15\n-70\n-60\n-50\n-40\n-30\n-70\n-60\n-50\n-40\n-30\n0.05 0.10 0.15\ngy\nro\nm\nag\nne\ntic\nra\ntio\n,g\n*\nEnergy, E (eV)\n250K\n100K77K\n300K\nFIG. 2. Dependence of the g factor \u0001symbols\u0002 on photon energy\nat different temperatures for InSb. The theoretical dependence from\nEq. \u00013\u0002 is shown as a solid line \u0001dilational change of band gap\u0002 and\ndashed line \u0001full optical band gap\u0002.\nBRIEF REPORTS PHYSICAL REVIEW B 77, 033204 \u00012008\u0002\n033204-2\nmass follows the dilational contribution only, since the vibra-\ntions occur on a much slower time scale than the time the\nelectron takes to sample the interband interactions that deter-\nmine the mass, which are at optical frequency. This has been\nused successfully to explain both temperature and pressure\ndependences of the effective mass for a variety of materials\nincluding InSb and GaAs.8,13 Following Refs. 8, 13, and 18,\nwe calculate the dilational change in the energy gap using\nInSb expansion coefficient measurements from Ref. 19. An\napproximate parametrization of the dilational change in E0\nover the range of 0–300 K for InSb leads to a E0\ndil\n=\n−0.2352+5.17\u000510−7T2−9.25\u000510−9T3+3.81\u000510−11T4\n−5.12\u000510−14T5, where T is in kelvin. Simple consideration\nof the momentum operator suggests that the interband mo-\nmentum matrix element should also scale \u0001inversely\u0002 with\nthe lattice dilation, so its square, EP0, changes no more than\n0.1% from 0 to 300 K. The spin-orbit splitting \u00070 measured\nby modulated reflectance is temperature insensitive for the\nrange from 5 to 300 K for InSb.14 We therefore assume that\nother than the fundamental band gap, all band parameters are\nindependent of temperature.\nAs can be seen from Fig. 2, Eq. \u00013\u0002 is quite consistent\nwith the experimental data without any fitting parameters.\nClearly, the data of Fig. 2 at high temperature \u0001particularly, at\nlow energies\u0002 is in better agreement with the theory includ-\ning only the dilational band gap, in accord with the previous\nwork on effective mass. The clinching point is that at the\nlowest energies, the measured g factor tends to a value of\naround −56 at 300 K, corresponding to the dilational band\ngap of −0.217 eV, and not to a value of −73, corresponding\nto the optical band gap of −0.174 eV. We note that incom-\nplete bleaching, if occurring, would be especially apparent at\nhigh energy and high temperatures, and the experimental\npoints would fall to the right of the line. There may be some\nevidence of this at 300 K above 0.1 eV, but for lower energy\nor lower temperature, no significant effect of reducing the\nlaser intensity was seen.\nAccording to Eq. \u00013\u0002, the g factor does not depend on\ntemperature as long as the excitation photon energy is kept\nconstant \u0001h\b=E−E0=const\u0002, and any departures from this\ngive a direct measure of the effect of higher bands. We have\nalso performed such an experiment where we keep the pho-\nton energy constant and vary the temperature. The resulting\ntransients are presented in Fig. 3, and we see a small reduc-\ntion in the magnitude of the g factor associated with the\nhigher band interactions. Figure 3 also shows the prediction\nfor the band-edge g factor using the dilational change.\nHaving shown that the temperature dependence of the g\nfactor for InSb, obtained from our own transient absorption\nmeasurements, can be satisfactorily explained by k ·p pertur-\nbation theory \u0001provided that one includes only the dilational\ncontribution to the change of energy gap\u0002, we may consider\nthe situation for GaAs. For GaAs, the low-temperature\nparameters7 are E0=−1.519 eV, \u00070=−0.341 eV, EP0\n=27.86 eV, E1=2.969 eV, \u00071=0.171 eV, EP1=2.36 eV, \u0007¯\n=−0.061 eV, and C\u0001=−0.0215, leading to g* \u0001T=0\u0002=−0.44\nfrom Eq. \u00012\u0002. Because of the near cancellation of the first and\nsecond terms on the right hand side in Eq. \u00012\u0002, the fourth\nterm amounts to 30% of g* for GaAs and must not be ne-\nglected, even though \u0007¯ is small. The third and fifth terms\ncontribute only 5% each. Incomplete use of the Hermann and\nWeisbuch formula9 for g* requires modification of the other\nparameters to compensate, as was done in Refs. 1 and 2. In\ncontrast, the widely used Hermann and Weisbuch formula for\neffective mass is perfectly adequate for GaAs because in the\nfull m* expression7 corresponding to Eq. \u00012\u0002, the \u0001second\u0002 E0\nterm dominates while the \u0001fourth\u0002 \u0007¯ term is negligible.\nWe now turn our attention to interpreting the time-\nresolved photoluminescence results of Oestreich and co-\nworkers for GaAs \nRefs. 1 and 2\u0002 reproduced in Fig. 4. We\nshould emphasize that the experiment of Refs. 1 and 2 is\n0 10 20 30 40 50\n250 K\n300 K\n200 K\n150 K\n100 K\n77 Ko\npt\nica\nlp\nol\nar\niza\ntio\nn\n(ar\nb.\nu\nn\nits\n)\nTime delay (ps)\n0 100 200 300\n-70\n-60\n-50\n-40\nT (K)\ng*\nFIG. 3. \u0001a\u0002 As in Fig. 1 but for different temperatures at a fixed\nexcitation wavelength of 4.7 \u0003m\t260 meV. \u0001b\u0002 The gyromagnetic\nratio inferred from the transients of the main figure \u0001circles\u0002. The\nthick solid line is calculated from Eq. \u00013\u0002, which shows that for\nfixed photon energy, g=−45 is a constant. The rise in the data with\ntemperature is due to the effects of higher bands. The thin lines are\nthe band-edge g values calculated using the dilational \u0001solid\u0002 and\noptical \u0001dashed\u0002 band gap changes with temperature.\n0 100 200 300\n-0.7\n-0.6\n-0.5\n-0.4\n-0.3\ngy\nro\nm\nag\nne\ntic\nra\ntio\n,g\n*\nTemperature (K)\nFIG. 4. Experimental and theoretical temperature dependences\nof g factor for GaAs. Data are taken from Ref. 1 \u0001circles\u0002. The\ndashed lines are the band-edge g value of Eq. \u00012\u0002. The solid lines\nwere calculated using the full 14-band k ·p matrix method \u0001Ref. 7\u0002\nat E=kT above the conduction band edge, appropriate for photolu-\nminescence. The thin lines include the temperature variation of E0\nand E1 using the optical gap and the higher band energy both from\nRef. 20, whereas the thick lines use the same E1 variation but only\nthe dilational part of the fundamental band gap change from Ref.\n18.\nBRIEF REPORTS PHYSICAL REVIEW B 77, 033204 \u00012008\u0002\n033204-3\ndifferent from our transient absorption experiment in that\nthey pump at low laser intensity in order to avoid state filling\nand, consequently, they measure electrons with average en-\nergy approximately \u000bE\f\u0005kT. We have made a full 14-band\nk ·p calculation of g* at E=kT shown in Fig. 4, following the\nprocedure outlined in Ref. 7, i.e., not making use of arbitrary\napproximations. In brief, one diagonalizes two matrices, one\nfor each conduction band spin state, which include exactly\nthe interactions between the seven states of the same Landau\nquantum number and also the nearest adjacent interacting\nLandau levels coupled by the terms proportional to EQ\n=15.56 eV \u0001the momentum matrix element between the\nhigher conduction and valence bands\u0002.7 We define g* \u0001E\u0002\n= \u0001E+−E−\u0002 \/\u0003BB from Eq. \u00011\u0002, where E= \u0001E++E−\u0002 \/2. As for\nInSb above, we assumed that EP0, EP1, and EQ are all con-\nstants \u0001i.e., negligible dilational changes only\u0002. Also, as for\nInSb, reflectance measurements20 have shown that the spin-\norbit splitting \u00070 is nearly constant \u0001and very close to the\nvalue used above7\u0002. We therefore also assumed that the other\nspin orbit couplings \u00071 and \u0007¯ are also constant. As already\nmentioned, the E1 \u0001third\u0002 term in Eq. \u00012\u0002 is small, so using\nthe optical or dilational change of that gap, or leaving it\nconstant, makes negligible difference. The fundamental band\ngap is therefore the only temperature dependent parameter,\nand the dilational contribution to the change in E0 with T for\nGaAs was taken from Ref. 18. We see from Fig. 4 that if we\nuse the optical band gap, then g* \u0001E=kT\u0002 should increase in\nmagnitude \u0001thick dashed line\u0002, whereas if we assume that\nonly the dilational gap change is applied, the magnitude de-\ncreases \u0001thick solid line\u0002 and we get a reasonable fit to the\ndata. Averaging g* over the electron distribution can produce\nmuch better agreement but is magnetic field dependent and\ntherefore ambiguous.\nIn summary, good agreement is obtained between the ex-\nperimental g factor and the predictions of k ·p theory for\nInSb up to 300 K provided we include only the dilational\nchange in the band gap, confirming the prediction of the\nclassic papers by Ehrenreich.8 In addition, we have shown\nthat the temperature dependence of g* measured by other\nworkers for GaAs \u0001Refs. 1–4\u0002 is not, in fact, anomalous; on\nthe contrary, good agreement is obtained with the 14-band\nmodel without adjustable parameters, providing, again, we\nuse only the dilational change with temperature in the fun-\ndamental band gap. We reemphasize that the effect of \u0007¯ must\nnot be neglected for g*.\nWe would like to thank A. Andreev for useful discussions,\nand we gratefully acknowledge the support by EPSRC-UK\nunder Grant No. EP\/C511999\/1.\n*Corresponding author. b.murdin@surrey.ac.uk\n1 M. Oestreich and W. W. Ruhle, Phys. Rev. Lett. 74, 2315 \u00011995\u0002.\n2 M. Oestreich, S. Hallstein, A. P. Heberle, K. H. Schmidt, K.\nEberl, E. Bauser, and W. W. Ruhle, Phys. Rev. B 53, 7911\n\u00011996\u0002; J. Hubner, S. Dohrmann, D. Hagele, and M. Oestreich,\narXiv:cond-mat\/0608534 \u0001unpublished\u0002.\n3 T. Lai, X. Liu, H. Xu, Z. Jiao, J. Wen, and W. Lin, Appl. Phys.\nLett. 88, 192106 \u00012006\u0002.\n4 P. E. Hohage, G. Bacher, D. Reuter, and A. D. Wieck, Appl. Phys.\nLett. 89, 231101 \u00012006\u0002.\n5 E. O. Kane, J. Phys. Chem. Solids 1, 82 \u00011956\u0002; 1, 249 \u00011957\u0002.\n6 C. R. Pidgeon and R. N. Brown, Phys. Rev. 146, 575 \u00011966\u0002; M.\nWeiler, J. Magn. Magn. Mater. 11, 131 \u00011979\u0002.\n7 P. Pfeffer and W. Zawadzki, Phys. Rev. B 41, 1561 \u00011990\u0002; 53,\n12813 \u00011996\u0002.\n8 H. Ehrenreich, J. Phys. Chem. Solids 2, 131 \u00011959\u0002; 9, 129\n\u00011959\u0002.\n9 C. Hermann and C. Weisbuch, Phys. Rev. B 15, 823 \u00011977\u0002.\n10 W. Zawadzki, Phys. Lett. 4, 190 \u00011963\u0002.\n11 H. J. Jimenez-Gonzalez, R. L. Aggarwal, and G. Favrot, Phys.\nRev. B 49, 4571 \u00011994\u0002.\n12 B. D. McCombe and R. J. Wagner, Phys. Rev. B 4, 1285 \u00011971\u0002.\n13 R. A. Stradling and R. A. Wood, J. Phys. C 1, 1711 \u00011968\u0002; 3,\nL94 \u00011970\u0002; L. G. Shantharama, A. R. Adams, C. N. Ahmad, and\nR. J. Nicholas, ibid. 17, 4429 \u00011984\u0002.\n14 M. Cardona, K. L. Shaklee, and F. H. Pollak, Phys. Rev. 154, 696\n\u00011967\u0002.\n15 B. N. Murdin, K. Litvinenko, J. Allam, C. R. Pidgeon, M. Bird,\nK. Morrison, T. Zhang, S. Clowes, W. R. Branford, J. Harris,\nand L. F. Cohen, Phys. Rev. B 72, 085346 \u00012005\u0002.\n16 K. L. Litvinenko, L. Nikzad, J. Allam, B. N. Murdin, C. R. Pid-\ngeon, J. J. Harris, T. Zhang, and L. F. Cohen, J. Appl. Phys. 101,\n083105 \u00012007\u0002.\n17 S. A. Crooker, D. D. Awschalom, J. J. Baumberg, F. Flack, and N.\nSamarth, Phys. Rev. B 56, 7574 \u00011997\u0002.\n18 S. A. Lourenco, I. F. L. Dias, J. L. Duarte, E. Laureto, L. C.\nPocas, D. O. Toginho Filho, and J. R. Leite, Braz. J. Phys. 34,\n517 \u00012004\u0002.\n19 D. F. Gibbons, Phys. Rev. 112, 136 \u00011958\u0002.\n20 P. Lauenslchlager, M. Garriga, S. Logothetidis, and M. Cardona,\nPhys. Rev. B 35, 9174 \u00011987\u0002.\nBRIEF REPORTS PHYSICAL REVIEW B 77, 033204 \u00012008\u0002\n033204-4\n"}