{"doi":"10.1111\/j.1747-6593.2003.tb00439.x","coreId":"60191","oai":"oai:nora.nerc.ac.uk:7755","identifiers":["oai:nora.nerc.ac.uk:7755","10.1111\/j.1747-6593.2003.tb00439.x"],"title":"A method for investigating the potential impacts of climate-change scenarios on annual minimum groundwater levels","authors":["Bloomfield, J.P.","Gaus, I.","Wade, S.D."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003","abstract":"Previous approaches to assessing the impact of climate-change scenarios on groundwater levels and groundwater droughts have focused on modelling specific recharge processes or phenomena. However, statistical methods, based on correlations between historic groundwater level and rainfall time-series, provide an alternative and robust approach to predicting minimum groundwater levels and droughts. For the purposes of this study, groundwater droughts are defined in terms of the return period of a given groundwater level. A multiple linear regression model (regression of monthly rainfall totals for a given period against values of minimum annual groundwater levels for the same period), when used with synthetic rainfall data based on climate-change scenarios, enables changes in future annual groundwater-level minima to be modelled. The method is illustrated at three sites on the Chalk, Permo-Triassic sandstone and Jurassic limestone aquifers","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/60191.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/7755\/1\/Paper_for_CIWEM_Journal_%28JP_Bloomfield_et_al%29.pdf","pdfHashValue":"dd32725190de0188e8fe66f412e7bd49386dc818","publisher":"Wiley-Blackwell","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:7755<\/identifier><datestamp>\n      2012-11-22T12:13:42Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533137<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/7755\/<\/dc:relation><dc:title>\n        A method for investigating the potential impacts of climate-change scenarios on annual minimum groundwater levels<\/dc:title><dc:creator>\n        Bloomfield, J.P.<\/dc:creator><dc:creator>\n        Gaus, I.<\/dc:creator><dc:creator>\n        Wade, S.D.<\/dc:creator><dc:subject>\n        Hydrology<\/dc:subject><dc:description>\n        Previous approaches to assessing the impact of climate-change scenarios on groundwater levels and groundwater droughts have focused on modelling specific recharge processes or phenomena. However, statistical methods, based on correlations between historic groundwater level and rainfall time-series, provide an alternative and robust approach to predicting minimum groundwater levels and droughts. For the purposes of this study, groundwater droughts are defined in terms of the return period of a given groundwater level. A multiple linear regression model (regression of monthly rainfall totals for a given period against values of minimum annual groundwater levels for the same period), when used with synthetic rainfall data based on climate-change scenarios, enables changes in future annual groundwater-level minima to be modelled. The method is illustrated at three sites on the Chalk, Permo-Triassic sandstone and Jurassic limestone aquifers.<\/dc:description><dc:publisher>\n        Wiley-Blackwell<\/dc:publisher><dc:date>\n        2003<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/7755\/1\/Paper_for_CIWEM_Journal_%28JP_Bloomfield_et_al%29.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Bloomfield, J.P.; Gaus, I.; Wade, S.D..  2003  A method for investigating the potential impacts of climate-change scenarios on annual minimum groundwater levels.   Water and Environment Journal, 17 (2). 86-91.  https:\/\/doi.org\/10.1111\/j.1747-6593.2003.tb00439.x <https:\/\/doi.org\/10.1111\/j.1747-6593.2003.tb00439.x>     \n <\/dc:identifier><dc:relation>\n        http:\/\/onlinelibrary.wiley.com\/journal\/10.1111\/(ISSN)1747-6593<\/dc:relation><dc:relation>\n        10.1111\/j.1747-6593.2003.tb00439.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/7755\/","http:\/\/onlinelibrary.wiley.com\/journal\/10.1111\/(ISSN)1747-6593","10.1111\/j.1747-6593.2003.tb00439.x"],"year":2003,"topics":["Hydrology"],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1 \nA Method for Investigating the Potential Impacts of \nClimate Change Scenarios on Annual Minimum \nGroundwater Levels \n \nJ. P. Bloomfield, BSc, MSc, PhD, CGeol*, I. Gaus, BSc, PhD* and S. D. Wade \nBSc, MSc, PhD** \n \n* British Geological Survey, Groundwater Systems and Water Quality Programme, Wallingford, \nUK \n** W S Atkins Water, Epsom, UK \n \nAbstract \n \nPrevious approaches to assessing the impact of climate change scenarios on \ngroundwater levels and groundwater droughts have focused on modelling \nspecific recharge processes or phenomena. Statistical methods, however, based \non correlations between historic groundwater level and rainfall time series, \nprovide an alternative and robust approach to predicting minimum groundwater \nlevels and droughts. For the purposes of this study groundwater droughts are \ndefined in terms of the return period of a given groundwater level.  A multiple \nlinear regression model (regression of monthly rainfall totals for a given period \nagainst values of minimum annual groundwater levels for the same period) when \nused with synthetic rainfall data based on climate change scenarios, enables \nchanges in future annual groundwater level minima to be modelled. The method \nis illustrated at three sites on the Chalk, Permo-Triassic sandstone and Jurassic \nlimestone aquifers. \n \nKey words: climate change; groundwater levels; groundwater drought; return \nperiod analysis; UK aquifers \n 2 \nIntroduction \n \nClimate change affects the hydrological cycle and has an uncertain impact on \ngroundwater resources. There is a clear need to understand and assess the \nimportance of climate change both at the scale of catchments and of public \nsupply sources, and to assess the possible risks posed to groundwater resources \nunder different climate change scenarios(1). These risks include, at one extreme, \nthe potential degradation of groundwater-fed ecosystems and the potential \nreduction of source yields due to low groundwater levels associated with \ngroundwater droughts. At the other extreme they could include possible \ngroundwater flooding with associated implications for infrastructure damage and \ndeleterious effects on water quality under conditions of high seasonal or shorter \nduration intense rainfall. The work described in this paper aims to reduce \nuncertainty associated with predicting the impact of climate change on \ngroundwater levels during groundwater droughts. The general approach may be \nused to predict the magnitude and return period of other extreme events \nassociated with groundwater level changes.  A quantitative method has also \nbeen developed as part of a larger project investigating source yield under \ndrought conditions(2), to predict the impact of climate change on annual minimum \ngroundwater levels. \nThere is increasing evidence to suggest that at least part of the observed \nrecent change in the global climate is due to a human-induced rise in \natmospheric concentrations of greenhouse gases(3). The inertia in global systems \n 3 \nmeans that this climate-forcing is likely to continue for the foreseeable future, \neven if the rate of greenhouse gas release to the atmosphere is reduced. The \nweather in the UK is not immune to these changes(3). The current UK climate, \nparticularly rainfall, is noted for its short-term variability around a relatively \nstationary mean, while sustained periods of very wet or very dry weather are \nrelatively rare. Historical observations show that this pattern has been \ncharacteristic of the last two centuries. \nRecent years, however, have seen two phenomena that suggest that the \nUK climate pattern may be changing. One is a trend of rising temperature, at a \nrate that is unlikely to be due solely to natural climatic variations. The 1990s (up \nuntil 1998) were almost consistently about 0.5 °C warmer than the 1961-1990 \naverage, and four of the five warmest years in the 340-year Central England \nTemperature series occurred between 1988 and 1997(3). The other phenomenon \nis the apparent increasing frequency of ‘extreme’ climatic events. For example, \nthe extended and marked reduction in effective rainfall across almost all of Britain \nduring 1984, 1989 and 1995 is one type of extreme event. These conditions \nwould be expected only once in 200 years(4) based on analysis of historical \nrecords. It should be noted that it is difficult to establish a causal association \nbetween anthropogenic induced climate change and specific ‘extreme’ events \n(add CEH \/ Met Office ref), however, the increased frequency of such events is \npredicted by many climate change models. Climate scenarios produced by the \nUK Climate Impacts Programme (UKCIP) suggest that these trends will \ncontinue(3). If they do continue, what are the implications for groundwater \n 4 \ndroughts in the UK during the next few decades? Is there any reason to suppose \nthat extreme events will increase in frequency and \/ or severity? \nTo date there have been few studies of the potential impacts of climate \nchange on groundwater resources and none that have provided robust \nquantitative methods or tools for investigating the effect of climate change on \ngroundwater levels across a range of hydrogeological settings. Most groundwater \nstudies have formed part of broader investigations that generally concentrate on \nthe potential impacts on surface water resources under different future climate \nscenarios(5,6). \nEarly studies reviewed the frequency and magnitude of both ‘winter’ and \n‘summer’ droughts induced by climate change and assessed their gross effects \non groundwater resources(7,8). More recently, a number of studies have used \nprocess-based recharge models to try and quantify the changes in groundwater \nresources under a range of climate change scenarios(9,10,11,12). They have \nemphasized how some aquifers may be more sensitive to climate changes than \nothers. For example, Price(4) noted that variation in groundwater storage \ncharacteristics is an important factor in mitigating the impacts of droughts caused \nby climate change.  Despite this work, however, it has proved difficult to develop \nflexible non-site specific models of groundwater level response to climate change \ndue to a reliance on process-based recharge models. This problem has been \navoided in the present study by using a statistical correlation between rainfall and \ngroundwater level data. The method described in this paper quantifies historical \nrelationships between groundwater levels and rainfall in such a way that \n 5 \nsynthetic rainfall data generated for a range of climate change scenarios can \nthen be used with calibrated groundwater hydrographs to predict future \ngroundwater levels. \n \nGroundwater droughts and the problem of predicting \nannual groundwater minima \n \nGroundwater droughts \n \nA range of rainfall-based drought indices have been developed to provide a \nmeans of quantifying drought based on monthly rainfall data. For example, the \nstandard precipitation index (SPI)(13) provides an estimate of the magnitude and \nseverity of rainfall droughts of selected durations. Estimation of groundwater \ndroughts, however, is not so simple. Groundwater droughts can be considered in \nterms of a period of minimum groundwater storage. They can be considered in \nenvironmental terms as a period of minimum baseflow, in terms of water supply \nas a period of minimum groundwater level at a supply source, or in terms of \nwater demand as a period of maximum stress at a groundwater source(2). \nFor the purposes of the present study a critical period groundwater \ndrought is defined as the groundwater level at a representative observation \nborehole that equals the 1 in x year annual minimum groundwater level, where x \nis specified by the operator or researcher. For example, a 1 in 20 year return \nperiod may be appropriate for operational planning at an observation borehole, \n 6 \nbut a 1 in 50, or even a 1 in 100 year groundwater drought might be used as the \ndesign criteria when planning new public supply sources or infrastructure. Given \nthis definition, graphs of minimum annual groundwater levels against return \nperiod (return period graphs) provide the most complete description of critical \nperiod groundwater droughts for a given borehole. Return period graphs have \nbeen used in this study to present the predicted groundwater levels for a range of \nclimate change scenarios.  \n \nPredicting annual groundwater level minima \n \nThe central problem in predicting the severity of groundwater droughts, and \nspecifically annual groundwater level minima, under different climate scenarios is \nhow to predict recharge. As noted earlier, reliance on process-based recharge \nmodels to predict changes in groundwater level have meant that it has not been \npossible to develop flexible non-site specific models of groundwater level \nresponse to climate change. The process-based recharge models have generally \nbeen based on assumptions regarding specific recharge process that may not be \nvalid under different climatic conditions. The studies were generally site specific \nand are not easy to apply over a wide range of hydrogeological settings and \nacross a variety of aquifer types. It is also difficult to undertake cross comparison \nof results from different studies. In addition, many use derived parameters such \nas potential evapotranspiration (PET) and soil moisture deficit (SMD). \n 7 \nUncertainties associated with these derived values are propagated through the \nmodels and are difficult to quantify. \nThe method adopted in the present study avoids these problems and is \nbased on a simple statistical correlation between groundwater levels and \nrainfall(14). It has the additional benefit that the errors associated with the \ncorrelation are easily quantified. The basic modelling strategy that has been \nadopted was developed by Bennett(14) and is a multiple linear regression (MLR) \nmodel that consists of a regression of monthly rainfall totals for a given period \nagainst values of minimum annual groundwater levels for the same period. The \nmodel is flexible and could be extended to include other regression parameters \nsuch as mean monthly temperature or evapotranspiration if these time series are \navailable. The statistical approach enables the effects of different climate \nscenarios to be modelled using different synthetic rainfall series. The following \nsection describes the MLR method and shows how the calibrated regression can \nbe used to predict annual groundwater minima and construct groundwater \ndrought return curves. \nMethodology \nMLR method \n \nThe MLR method uses groundwater level data based on the hydrometric year. \nThe hydrometric year usually runs from April to March so that nearly all the \nminima occur near the middle of the hydrometric year. The annual groundwater \nlevel minima are recorded for each hydrometric year. As the MLR method uses \n 8 \nmonthly rainfall data, daily or weekly rainfall data can be lumped into cumulative \nmonthly values. In this regression analysis a number of predictors (i.e. monthly \nrainfall) are used to predict the dependent variable (i.e. annual minimum \ngroundwater level), but care must be taken when using the MLR approach. The \npredictors used in the regression analysis must be independent; i.e. one month’s \nrainfall should not be highly correlated with rainfall during the subsequent month. \nA Pearson correlation matrix18 is generated to characterize the degree of \ncorrelation between rainfall in successive months and each correlation is tested \nfor significance using the t-test.  If significant correlation is found between \nsuccessive monthly rainfall data then the assumptions behind the MLR no longer \nhold. One way round this problem is to add two months rainfall where there is a \nsignificant correlation and test for correlation between the summed rainfall and \nrainfall for the subsequent month. If this correlation is not significant then the \nsummed rainfall can be used instead of the monthly rainfall.  In addition, the \ndependent variable should not show significant autocorrelation.  This is tested by \ncalculating an autocorrelation function for the annual groundwater level minima. \nIf these assumptions can be satisfied the MLR can be performed. For the \npurposes of this study the annual minimum groundwater level was taken to be \nlinearly dependent on fifteen monthly rainfall measurements, usually between \nJanuary in one year and March the following year (the hydrometric year plus the \nthree preceding months). An expression with the following form is obtained; \n \nZmin = β1RJan0 + β2RFeb0 + β3RMar0 + β4RApr … + β15RMar + c \n \n 9 \nwhere Zmin is the minimum annual groundwater level in the hydrometric year, RApr \n… RMar are the monthly rainfalls throughout the hydrometric year and RJan0, RFeb0, \nand RMar0 are the rainfall in last three months of the preceding year. β1 to β15 are \nthe fifteen regression coefficients and c is a constant. \nFor each regression, a measure of the fit of the regression to the \nobservations is given by the value of R2. This indicates what percentage of the \nvariance is accounted for by the model. In multiple linear regression models the \nR2 statistic can be improved by using more predictors, i.e. more months rainfall, \nbut even though a better fit may be obtained with the calibrated data the resulting \nmodel may not be any better at predicting future water levels. It is, therefore, \ncommon to quote the adjusted R2 statistic, Ra2. This statistic takes into account \nboth the goodness of fit of the model and the number of predictors used. \nA smaller number of predictors could be used in the MLR model. For \nexample, a systematic approach to the selection of the number of predictors \nwould be to investigate the Pearson correlation between monthly rainfall and \nminimum groundwater levels to see how many months rainfall prior to a \ngroundwater level minimum are significant. This approach, however, could not be \nused for forward modelling purposes because, for any given future year, there is \nno way of predicting in which month the annual groundwater level minimum \nwould occur and which months predicted rainfall should be used. Hence, a \nminimum of twelve months rainfall, i.e. twelve predictors, are needed for the \nforward model. Given the unlikely event that the annual minimum may fall right at \nthe start of a hydrometric year, the addition of three other predictors at the end of \n 10 \nthe preceding hydrometric year provide a robust fifteen-month MLR model for \nprediction.  Because fifteen predictors are being used the model requires a \nminimum of 16 years of rainfall and groundwater level data, although additional \nstudies not reported here suggest that at least 20 years of time series data are \nrequired for this approach to be effective. \nOnce a regression has been obtained the observed monthly rainfall can \nbe used with the regression coefficients and constant to calculate annual \ngroundwater level minima. These calculated values can be compared with \nobserved annual minima to give an estimate of the accuracy of the model. \n \nPrediction of climate change impacts \n \nTo predict annual groundwater level trends under different climate change \nscenarios it is necessary to generate synthetic rainfall series. These are obtained \nby perturbing historic rainfall data using changes in long-term mean rainfall and \nchanges in the rainfall variability for different UKCIP scenarios. Using this \ntechnique, sufficiently long synthetic rainfall series, of the order of 10,000 years, \nare generated. These long synthetic rainfall series are needed to enable return \nperiods of up to 1 in 200 year drought events to be estimated with a probability of \n0.05% or better. Once the long synthetic rainfall time series have been obtained, \nthe synthetic rainfall data can be used with the MLR regression coefficients and \nconstant to calculate predicted annual groundwater level minima. The return \n 11 \nperiod analysis of the annual groundwater level minima is simply based on the \ncumulative distribution function of the predicted annual minima(2). \n \nSite descriptions and results \n \nThe sites \n \nThe model has been applied to three sites, one on the Chalk aquifer at Little \nBucket Farm (TR 1225 4690), one on the Permo-Triassic sandstone aquifer at \nBussels No.7A (SX 9528 9872), and one on the Jurassic Limestones at New Red \nLion (TF 0885 3034) (Figure 1).  \nThe borehole at Little Bucket Farm is sited on Middle Chalk. The \nmaximum recorded water level is +86.87 m OD, less than 0.5 m below the top of \nthe borehole that is 0.6 m above the ground surface. The minimum recorded rest \nwater level is +56.77 m OD, close to the bottom of the borehole. These levels are \nconsistent with those seen in other boreholes in the area. The hydrograph has an \nannual sinusoidal appearance with a mean annual range of 13.17 m. There are \nno licensed groundwater abstractions within 2 km of the well. \nThe borehole at Bussels No.7A is sited on a river terrace above the \nDawlish Sandstone (part of the Exeter Group of Permian age). The maximum \nrecorded rest water level is +25.28 m OD and the minimum +22.91 m OD. This is \nconsistent with water levels recorded in other boreholes in the region. The \nhydrograph has an annual sinusoidal appearance with an annual range of 2.2 m. \n 12 \nThere are ten licensed groundwater abstractions from within 2 km of the \nborehole. Their effects on the Bussels No.7A hydrograph are unknown.  \nThe New Red Lion borehole is lined from the surface to a depth of 25.0 m \nwhere it penetrates the Lincolnshire Limestone beneath the Blisworth Limestone. \nThe Lincolnshire Limestone is about 28 m thick in this area, with its top at about \n+ 9m OD. The maximum recorded rest water level for New Red Lion is +20.7 m \nOD and the minimum + 5.68 m OD. The highest water levels, therefore, rise to a \nlevel within the overlying Blisworth Limestone, which is cased out; but the \nminimum levels are within the Lincolnshire Limestone. The hydrograph has a \nwell-defined annual sinusoidal appearance with a mean annual range of 7.9 m. \nThere is one licensed groundwater abstraction within 2 km and is not thought to \naffect water levels in the observation well. \n \n \n \nData sets used in the study \n \nThree data sets have been used in the study; groundwater level data, historic \nrainfall data, and UKCIP climate change scenarios. The groundwater level data \nhas been taken from the National Groundwater Level Archive held by the British \nGeological Survey (BGS) in Wallingford.  The Archive contains long-term \ngroundwater level records for a monitoring network of 175 boreholes each \nmeasured either weekly or monthly to the nearest 10 mm or better. Data and \n 13 \nstatistics that are available for each borehole include a site name, hydrometric \narea (river catchment), national grid reference, measured groundwater level, \nperiod of record, and mean, maximum, and minimum annual groundwater level \nranges. Full listings of sites in the archive can be found in the Hydrogeological \nData UK Yearbook(15) and have been described by Doorgakant (16). \nTwo types of rainfall data were used; rain gauge data and catchment \naveraged data. A long-term rain gauge record was supplied by the Environment \nAgency for the Street End gauge (ref. no. 664420001) for use with the Little \nBucket Farm groundwater hydrograph. At the other two sites catchment \naveraged rainfall was used. This was supplied by the Centre for Ecology and \nHydrology. The two catchments that were used were CMR 45001 Exe at \nThorverton and CMR 30014 Pointon Lode at Pointon for Bussels No.7A and New \nRed Lion respectively(15). \nThe synthetic rainfall data was generated using climate change (rainfall) \nscenarios taken from the UKCIP 10 km grid data on the UKCIP CD ROM(17). Four \nscenarios have been used in the modelling, the 2020s, 2050s and 2080s medium \nhigh (MH) scenarios and the 2080s high scenario. \n \nResults \n \nRa2 values of 0.47, 0.51, and 0.84 have been obtained for the regression models \nfor Little Bucket Farm, New Red Lion and Bussels No.7A respectively. These \nindicate that between about 50% and 85% of the variance in the data is \n 14 \nexplained by the MLR models. Because, however, the models are based on \ndifferent length time series it is not possible to directly compare them using their \nrespective Ra2 values. One way to contrast the relative effectiveness of the MLR \nresults between the sites is to compare the observed and calculated annual \ngroundwater level minima for each of the three sites, Figure 2. The figure shows \nthat the MLR models appear to provide good fits to the observed data. Averaged \nnormalized differences (where differences are normalized by dividing by the \nmaximum range in annual minima at a site) between observed and modelled \nannual groundwater level minima are 10%, 10% and 3% for Little Bucket Farm, \nNew Red Lion and Bussels No.7A respectively. Although the models provide \ngood fits to the historic data, it is not possible to quantify how well they perform \nwhen predicting groundwater levels outside the calibration period, i.e. how well \nthey describe future groundwater level minima that may lie outside the range of \nhistoric minima. However, this is true of most models used for forward prediction. \nFigure 3 shows the results of the return period analysis for annual \nminimum groundwater levels for the 2020s, 2050s and 2080s medium high, and \nfor the 2080s high scenarios as well as the observed historic data for the three \nsites. For example, the return period curves for Little Bucket Farm show that an \nannual minimum groundwater level of 57.7m AOD has a historic return period of \n10 years. This return period falls to between 9 and 5 years for the four climate \nchange scenarios under consideration. Generally, at any giving site there is a \nsmall fall in annual minimum groundwater levels for a specific return period (with \nthe exception of New Red Lion, where a small rise is predicted for annual \n 15 \nminimum groundwater levels for a specific return period for some of the climate \nchange scenarios). \nRelative changes in annual groundwater level minima can be mode clearly \nseen in Figure 4. This figure shows the relative changes in minimum groundwater \nlevels for the three sites (calculated as the difference between the predicted and \nobserved annual minima divided by the mean range in minima) for the three \nmedium high scenarios. For example, both New Red Lion and Bussels No.7A \nshow small predicted rises in average annual minima under all three medium \nhigh scenarios. At Little Bucket Farm a very small rise is predicted for the 2020s \nmedium high scenario but falls in annual groundwater level minima of about 4% \nand 1% are predicted for the 2050s and 2080s medium high scenarios. This \nindicates that this site may be more vulnerable under these climate change \nscenarios than the other two sites. \nThe results presented in Figures 3 and 4 are intended as illustrative. A \nmore systematic survey is being undertaken to investigate possible trends in \ngroundwater level response as a function of aquifer type, different climate \nchange scenarios and regional climatic variations across the UK, and site \nspecific factors. This work will be reported at a later date. The figures, however, \nillustrate that even given climate change scenarios where there is a small \npredicted overall increase in total annual rainfall, due to changes in seasonality \nand increased frequency of drought events, annual groundwater level minima \nmay fall in the future.  \n \n 16 \n \nConclusions \n \n1. Groundwater droughts may usefully be defined on the basis of \ngroundwater levels that are equivalent to a 1 in x year annual minimum \ngroundwater level, where x is a return period specified by the operator or \nresearcher. Given this definition, graphs of minimum annual groundwater \nlevels against return period (return period graphs) provide the most \ncomplete description of critical period groundwater droughts for a given \nborehole. \n2. A multiple linear regression (MLR) model that uses monthly rainfall levels \nas the independent variables and annual groundwater level minima as the \ndependent variables has been developed to predict annual groundwater \nlevel minima. For practical purposes, a minimum of 16 to 20 years of time \nseries data is required for this approach to be effective. \n3. MLR models for three sites on different aquifer types can be shown to  \nreproduce annual groundwater level minima to within 10 % or better of the \nrange of annual minima. \n4. Using the MLR calibrated models and applying five different UKCIP \nclimate change scenarios (2020s, 2050s and 2080s medium high and the \n2080s high scenarios), groundwater drought return period analyses have \nbeen produced for up to 1 in 200 year events. On the basis of these \nforward models it is inferred that despite an overall increase in rainfall \n 17 \npredicted by some climate change scenarios, changes in the seasonality \nand frequency of extreme events could lead to an increase in the \nfrequency and intensity of groundwater droughts in some areas of the UK. \nThe Chalk aquifer in southern and eastern England may be most \nsusceptible to these effects. \n5. The method presented in this paper, unlike previous recharge-based \napproaches, makes no assumptions regarding recharge processes. \nConsequently, it is applicable to a wide range of hydrologic, geological \nand hydrogeological settings. In addition, the method is flexible and could \nbe used to investigate year-on-year effects or to include other independent \nvariables such monthly temperature variations. \n \nAcknowledgements \n \nWe would like to thank Dave Allen, Brighid O’Dochartaigh and Nick Robins for \ntheir helpful review comments. The work described in this paper formed part of \nthe Critical Period Groundwater Yield study (AK2653\/010\/DG\/027) sponsored by \nUKWIR and the Environment Agency. The UKCIP98 Climate Scenario CD-ROM \nwas supplied under license by the Climate Impacts LINK Project (DETR Contract \nEPG 1\/1\/68) on behalf of the UKCIP and The Met. Office (Hadley Centre).  This \npaper is published with the permission of the Director of the British Geological \nSurvey, NERC.  \n \n 18 \n \n \nReferences \n \n(1) Grey, D.R.C., Kinniburgh, D. G., Barker, J.A. and Bloomfield J. P. \nGroundwater in the UK: A strategic study. Issues and research needs. \nGroundwater Forum Report FR\/GF1, Foundation for Water Research, \nMarlow, Buckinghamshire, 1995, 69. \n(2)  Gray R., Wade, S.D., Bloomfield, J.P., I Gaus and Allen D J. Critical \nperiod groundwater yield. Report to UKWIR\/EA, AK\/2653\/010\/DG\/027, \n2001. \n(3) Hulme, M and Jenkins, G. Climate change scenarios for the United \nKingdom: Summary Report. UKCIP, 1998. \n(4) Price, M. Water storage and climate change in great Britain – the role of \ngroundwater. Proc. Instn. Civ. Engrs. Wat. Marit. & Energy, 1998, 130, \nMarch, 42. \n(5) Arnell, N.W. Climate change and water resources in Britain. Climatic \nChange, 1998, 39, (1), 83.  \n(6) Arnell, N.W., Reynard, N.S., King, R., Prudhomme, C. and Branson, J.  \nThe effect of climate change on river flows and groundwater recharge: \nguidelines for resource assessment. Report to UKWIR\/EA, \n97\/CL\/04\/11997. 1997, 55 \n 19 \n(7) Vaccaro, J.J. Sensitivity of groundwater recharge estimates to climate \nvariability and change, Columbia Plateau, Washington. J. Geophys.  Res. \nAtmos., 1992, 97, (D3), 2821. \n(8) Thomsen, R. Future droughts, water shortages in parts of Western \nEurope. EOS. Trans. Am. Geophys. Union, 1993, 74, 14. \n(9) Henriksen, H.J. Climate change and available groundwater resources – \nthe National Water Resources Model for Denmark. Proc. 2nd Internat. \nConf. On Climate and Water, Espoo, Finland, 17-20 August, 1998, 1459. \n(10) Younger, P.L., Teutsh, G., Custodio, E., Elliot, T., Sauter, M., Manzano, \nM., Liedl, R., Clemens, T., Huckinghaus, D., Tore, C.S., Lambán, J. and \nCardaso da Silva, G. Groundwater resources and climate change effects – \nGRACE: Final Report to the European Union RTD EV5V-CT94-0471, \nUniversity of Newcastle, 1997. \n(11) Wilkinson, W.B. and Cooper, D.M. The response of idealized aquifer\/river \nsystems to climate change. Hydrological Sciences Journal\/Journal des \nSciences Hydrologiques, 1993, 38, (5), 379. \n(12) Demuth, S and Stahl, K. (editors). Assessment of the regional impact of \ndroughts in Europe. Final Report to the European Union ENV-CT97-0553, \nInstitute of Hydrology, University of Freiburg, Germany, 2001. \n(13) McKee, T.B., Doeskin, N.J. and Kleist, J. The relationship of drought \nfrequency and duration to time scales. Proc. 8th Conf. On Applied \nClimatology, January 17-22, 1993, American Meteorological Society, \nBoston, Massachusetts, 179. \n 20 \n(14) Bennett, J. A scoping report on statistical methods for predicting \ngroundwater levels in the UK from rainfall data, with particular emphasis \non predicting annual minimum water levels from monthly rainfall data. \nBritish Geological Survey Report WD\/96\/50, BGS, Keyworth, \nNottingham,1996. \n(15) Hydrological Data UK. Hydrometric register and statistics 1991-1995. \nNERC, Wallingford, 1998, 207. \n(16) Doorgakant, P. Groundwater level archive for England and Wales. In: \nGiles, J.G.R. Geological Data Management. Geol. Soc. Special Pub., \n1995, 97, 137. \n(17) UKCIP98 Climate Scenario CD-ROM, Climate Impacts Project, The \nHadley Centre, The Meterological Office, UK. 1998 \n(18) Swan A R H and Sandilands M. Introduction to Geological Data Analysis. \nBlackwell Science, Oxford, UK. 1995 \n \n 21 \nFigure captions \n \nFigure 1. Location map. \nFigure 2. Fitted annual minima for the Little Bucket Farm (LBF), Bussels No \n7A (B No.7) and for the New Red Lion (NRL) sites. Observed \nminimum annual groundwater levels are shown as solid symbols \nand modelled values are shown as open symbols.  \nFigure 3. Return period analysis plots for the Little Bucket Farm, Bussels No \n7A and for the New Red Lion sites. \nFigure 4.  Percentage change in annual minimum levels at the three sites. \n \n 22 \nFigure 1. \nTitle:\nCreator:\nArcView Version 3.0\nPreview:\nThis EPS picture was not saved\nwith a preview included in it.\nComment:\nThis EPS picture will print to a\nPostScript printer, but not to\nother types of printers.\n 23 \nFigure 2. \n \n \n \n \nYear\n1960 1970 1980 1990 2000\nAn\nnu\nal\n m\nin\nim\num\n g\nro\nun\ndw\nat\ner\n le\nve\nl (\nm\n a\nO\nD\n)\n0\n10\n20\n30\n50\n60\n70\n80\nLBF\nNRL\nB No.7\n 24 \nFigure 3.  \nNew Red Lion\nReturn period (1 in x years)\n1 10 100\nA\nnn\nua\nl m\nin\nim\num\n le\nve\nl (\nm\n O\nD\n)\n0\n5\n10\n15\n20\n25\n30\nLittle Bucket Farm\nA\nnn\nua\nl m\nin\nim\num\n le\nve\nl (\nm\n O\nD\n)\n55\n60\n65\n70\n75\n2020s MH \n2050s MH \n2080s MH \n2080s High \nObserved\nBussels No 7A\nA\nnn\nua\nl m\nin\nim\num\n le\nve\nl (\nm\n O\nD\n)\n22.5\n23.0\n23.5\n24.0\n24.5\n 25 \nFigure 4.  \n \n \nCC scenario\n2020s MH 2050s MH 2080s MH\nC\nha\nng\ne \nin\n a\nnn\nua\nl m\nin\nim\na \n(%\n)\n-4\n-2\n0\n2\n4\n6\n8\n10\n12\n14\nLittle Bucket Farm \nBussels No7A \nNew Red Lion \n"}