{"doi":"10.1063\/1.2345615","coreId":"100935","oai":"oai:epubs.surrey.ac.uk:336","identifiers":["oai:epubs.surrey.ac.uk:336","10.1063\/1.2345615"],"title":"Polymer supported carbon nanotube arrays for field emission and sensor devices","authors":["Watts, PCP","Lyth, SM","Mendoza, E","Silva, SRP"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-09-04","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:336<\/identifier><datestamp>\n      2017-10-31T13:57:51Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/336\/<\/dc:relation><dc:title>\n        Polymer supported carbon nanotube arrays for field emission and sensor devices<\/dc:title><dc:creator>\n        Watts, PCP<\/dc:creator><dc:creator>\n        Lyth, SM<\/dc:creator><dc:creator>\n        Mendoza, E<\/dc:creator><dc:creator>\n        Silva, SRP<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2006-09-04<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/336\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Watts, PCP, Lyth, SM, Mendoza, E and Silva, SRP  (2006) Polymer supported carbon nanotube arrays for field emission and sensor devices   APPLIED PHYSICS LETTERS, 89 (10), ARTN 1.       <\/dc:identifier><dc:relation>\n        10.1063\/1.2345615<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/336\/","10.1063\/1.2345615"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"APPLIED PHYSICS LETTERS 89, 103113 \u00012006\u0002Polymer supported carbon nanotube arrays for field emission\nand sensor devices\nPaul C. P. Watts,a\u0001 Stephen M. Lyth, Ernest Mendoza, and S. Ravi P. Silva\nNano-Electronics Centre, Advanced Technology Institute, University of Surrey, Guildford,\nSurrey GU2 7XH, United Kingdom\n\u0001Received 6 March 2006; accepted 16 July 2006; published online 8 September 2006\u0002\nThe authors report a simple method for providing a polymer support structure for carbon nanotube\n\u0001CNT\u0002 arrays for device applications. This method has a twofold effect: firstly it secures the\nnanotubes to the substrate and secondly it significantly decreases the threshold field for field\nemission from 26.2 to 9.7 V\/\u0001m. This method ensures that the main body and tips of the CNTs are\npolymer-free and therefore can also be applied to CNT sensor array device fabrication. © 2006\nAmerican Institute of Physics. \u0003DOI: 10.1063\/1.2345615\u0004Aligned carbon nanotube \u0001CNT\u0002 arrays1,2 are attracting\nincreased interest for sensing applications and are currently\nstudied as platforms for a variety of sensor devices3–5 and\nfield emission \u0001FE\u0002 sources in flat screen displays.6,7 An un-\nderlying drawback for CNT arrays being used as sensing\nplatforms is the fact that the nanotubes are weakly bound to\nthe silicon substrate and are susceptible to facile detachment\n\u0003Fig. 1\u0001a\u0002: effect from scratching\u0004, which reduces perfor-\nmance and lifetime, when incorporated in sensor and display\ntechnologies. Recently, there has been much investigation\ninto the possible toxicological effects of carbon nanotubes\nwith biological systems.8,9 In the case of CNT electrophysi-\nological sensors,10 nanotube detachment from the substrate\nbecomes an important issue.\nThere are several additional issues to be tackled if CNTs\nare to become viable FE materials, such as improvement of\nturn on fields, mechanical stability, and the robustness of the\nsubstrates. Degradation of CNT arrays during FE occurs\nmainly due to mechanical failure at the tube-substrate con-\ntact and resistive heating.11 Plasma post-treatment with O2,12\nCF4,13 Ar,14 and H2 \u0001Ref. 15\u0002 has been used to alter the FE\nproperties of CNT arrays by removing surface amorphous\ncarbon impurities,16,17 introducing defects,15 and by modify-\ning the work function of the surface of the CNTs.12 Previous\nwork has shown that O2 impurities etch the base of the CNTs\nduring FE characterization due to large contact resistances\nbetween the substrate and CNTs, resulting in an increase in\nthreshold field.18\nOur previous work has revealed that polystyrene\n\u0001PS\u0002-multiwall carbon nanotube \u0001MWNT\u0002 composite films\nexhibit excellent FE properties \u0001low threshold fields:\n1.6 V\/\u0001m\u0002 from the fracture surface at relatively low CNT\nconcentrations \u0001ca. 12 wt. %\u0002.19,20 Further investigation of\nthe fracture surface by scanning electron microscopy \u0001SEM\u0002\nshows that after the MWNTs have been pulled out of the PS\nmatrix, there remains polymer attached to the nanotube sur-\nface, indicating good adhesion between the tubes and poly-\nmer \u0003Fig. 1\u0001b\u0002\u0004.\nWe have developed a facile method for the fabrication of\na thin PS support, which holds the tubes securely to the\nsubstrate surface while ensuring that the nanotubes are free\na\u0002Author to whom correspondence should be addressed; electronic mail:\np.watts@surrey.ac.uk\n0003-6951\/2006\/89\u000210\u0001\/103113\/3\/$23.00 89, 10311\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject toof polymer and available for FE and chemical\/biological\nfunctionalization. We demonstrate that the FE properties are\nnoticeably enhanced after the polymer layer has been fabri-\ncated due to the oxygen plasma treatment step. Threshold\nfields decrease from 26.2 to 9.7 V\/\u0001m for MWNT arrays\nwithout and with the PS support, respectively.\nThe MWNT arrays were grown on highly doped silicon\nsubstrates using plasma enhanced chemical vapor deposition\nof acetylene over an iron catalyst. An iron film \u000120 nm\u0002 was\nsputtered onto the silicon wafer and heated to 650 °C for\n20 min in vacuum, resulting in Fe islands between 50 and\n100 nm in diameter.2 During the growth process the substrate\nwas maintained at 650 °C and acetylene was introduced to\nthe chamber at a concentration of 5.0% with N2 as the carrier\ngas. The length of the as-grown MWNTs \u0001diameter of ca.\n50 nm\u0002 depends on growth time. Typically, the length of the\nMWNTs for a 15 min growth process is 1–2 \u0001m, but we\nhave achieved lengths of \u000210 \u0001m.\nThe MWNT array was first immersed in a PS \u0001Aldrich,\nUK, Mn=280 000\u0002\/toluene \u00010.03 wt. % \u0002 solution at 40 °C\nfor 24 h in order to increase the absorption of the solution\ninto the arrays. It was then removed from the solution and\nspin coated at 6000 rpm for 30 s. The array was heated to\njust above the glass transition temperature of PS, 120 °C \u0001Tg\nof PS=110 °C\u0002, in order for the polymer chains to slide\nFIG. 1. \u0001a\u0002 CNT detachment after the array was scratched. \u0001b\u0002 SEM image\nof the fracture surface of a PS\/MWNT composite film. SEM of the MWNT\narrays after sonication \u0001c\u0002 with a PS support and \u0001e\u0002 and without a PS\nsupport. Insert \u0001d\u0002: magnification of destructed region.\n© 2006 American Institute of Physics3-1\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n103113-2 Watts et al. Appl. Phys. Lett. 89, 103113 \u00022006\u0001down onto the silicon substrate. A layer of PS remained on\nthe tube tips; therefore oxygen plasma etching \u0003Plasma-Preen\nI, 180 W, 60 s, and O2 flow of 2.5 SCCM \u0001SCCM denotes\ncubic centimeter per minute at STP\u0002\u0004 was carried out to oxi-\ndize the PS and expose the tube ends for functionalization.\nThe resulting MWNT array with PS support structure and\nexposed tube tips were characterized by SEM \u0001FEI Quanta\n200F\u0002.\nThe samples were subjected to field emission character-\nization at 10−6 mbar. A 5 mm diameter spherical stainless\nsteel anode was placed typically 70 \u0001m above the substrate.\nThe threshold field was arbitrarily taken to be the macro-\nscopic electric field at which an emission current of 1 nA\nwas detected. Six different sites were probed on each sample\nand the current was cycled up and down six times at each of\nthese sites to obtain average threshold field.\nPS was chosen as the polymer material for the support\ndue to its ease of handling and low cost. In the absence of\ncovalent bonding between nanotubes and a PS matrix, the\nnonbonded interactions consist of electrostatic and van der\nWaals interactions.21 In a previous report on molecular me-\nchanics of a CNT pullout simulation the authors calculated\nthat the interfacial shear stress of the CNT-PS system was ca.\n160 MPa.21 Figure 1\u0001b\u0002 shows a SEM of a fracture surface of\na MWNT-PS composite showing that the nanotubes, which\nare pulled out of the PS matrix, are coated with PS \u0001arrows\u0002.\nThis indicates that the van der Waals and electrostatic inter-\nactions between the nanotubes and polymer chains are stron-\nger than the chain-chain nonbond interactions, suggesting PS\nFIG. 2. \u0001a\u0002 TGA for PS and MWNTs. \u0001b\u0002 FE from the MWNT array with\nand without the polymer support.as an appropriate reinforcing material for CNT arrays.\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject toMWNTs are more oxidatively stable than PS, as shown\nby thermogravimetric analysis \u0001TGA, Perkin Elmer 7\u0002 \u0003Fig.\n2\u0001a\u0002\u0004. PS oxidizes in air at ca. 380 °C whereas MWNTs oxi-\ndize at ca. 625 °C, demonstrating that MWNTs are more\nresistant to oxidation than PS. After heating the array to\n120 °C, much of the PS has sunk to the substrate surface\naffording a thin PS support ca. 400 nm. In addition, there\nremains a thin coating \u0001ca. \u00025 nm\u0002 of PS on the section of\nnanotubes which is not embedded in the support. During the\nplasma etching the PS is preferentially oxidized due to its\nlower oxidative stability compared to the MWNTs and the\ntube ends become exposed. The thin support structure is also\nsubject to oxidation from the plasma but only ca. 5–10 nm;\ntherefore the bulk of the support remains.\nFigure 3\u0001a\u0002 shows a SEM image of a fractured edge of\nan array with a PS support structure. The tubes are ca. 2 \u0001m\nin length and have an intertube spacing of ca. 3 \u0001m. The PS\nsupport is clearly evident and the thickness is ca. 400 nm.\nFigure 3\u0001b\u0002 is a higher magnification image showing that the\nMWNT is attached to the silicon substrate and that the PS\nsupport layer has embedded the end of the tube attached to\nthe substrate.\nFigure 2\u0001b\u0002 shows typical field emission current versus\napplied electric field characteristics of the MWNT arrays be-\nfore and after PS coating and oxygen plasma treatment. The\nthreshold field is reduced from 26.2 to 9.7 V\/\u0001m after oxy-\nFIG. 3. \u0001a\u0002 SEM of the fracture edge of a PS supported MWNTs array. \u0001b\u0002\nshows the tube attached to the silicon substrate, embedded in 400 nm of the\nPS support structure.gen plasma treatment, corresponding to a 63% improvement.\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n103113-3 Watts et al. Appl. Phys. Lett. 89, 103113 \u00022006\u0001The high threshold field before treatment is attributed to a\nlayer of insulating amorphous carbon coating the CNTs,\nleading to inefficient electron emission. O2 plasma treatment\nremoves the insulating amorphous layer16,17 as well as in-\ncreases the number of defects in the CNT structure, resulting\nin improved emission characteristics.\nIn order to gain some information regarding the me-\nchanical nature of the PS support we carried out ultrasonica-\ntion treatment on the arrays. Figure 1 shows the effect after\nultrasonication an array without \u0003\u0001c\u0002 and \u0001d\u0002\u0004 and with \u0001e\u0002 a\nPS support. Figure 1\u0001c\u0002 clearly shows destructed patches on\nthe array. Closer investigation \u0003Fig. 1\u0001d\u0002\u0002 reveals that the\ntubes completely detached from the arrays in the patch re-\ngions. PS supported arrays show no sign of destructed re-\ngions or nanotube detachment, indicating that the PS support\nprotects against nanotube detachment during ultrasonication\ntreatment.\nWe demonstrate a facile method for providing CNT ar-\nrays with a PS support structure of ca. 400 nm thickness,\nwhich secures the tubes effectively to the substrate and sub-\nsequent O2 plasma treatment ensures that the tube ends are\nwithout a polymer. A decrease in threshold field from 26.2 to\n9.7 was recorded for the arrays with the PS support. Ultra-\nsonication treatment of the arrays with and without a PS\nsupport reveals that the support protects against CNT detach-\nment. This method for providing CNT arrays with a support\nstructure noticeably enhances FE properties while protecting\nagainst CNT detachment, hence dramatically improving the\nlifetime of the array during FE. These polymer supported\narrays can also be applied to sensor technologies by func-\ntionalization with active sensing materials.\nThe authors would like to thank the EPSRC \u0001Grant No.\nRB3553\u0002 \u0001U.K.\u0002 for funding this work.Downloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject to1Z. F. Ren, Z. P. Huang, J. W. Xu, J. H. Wang, P. Bush, M. P. Siegal, and P.\nN. Provencio, Science 282, 1105 \u00011998\u0002.\n2E. Mendoza, S. J. Henley, C. H. P. Poa, G. Y. Chen, C. E. Giusca, A.\nAdikaari, J. D. Carey, and S. R. P. Silva, Sens. Actuators B 109, 75\n\u00012005\u0002.\n3K. H. An, S. Y. Jeong, H. R. Hwang, and Y. H. Lee, Adv. Mater. \u0001Wein-\nheim, Ger.\u0002 16, 1005 \u00012004\u0002.\n4M. Gao, L. M. Dai, and G. G. Wallace, Electroanalysis 15, 1089 \u00012003\u0002.\n5J. Li, H. T. Ng, A. Cassell, W. Fan, H. Chen, Q. Ye, J. Koehne, J. Han, and\nM. Meyyappan, Nano Lett. 3, 597 \u00012003\u0002.\n6W. A. Deheer, A. Chatelain, and D. Ugarte, Science 270, 1179 \u00011995\u0002.\n7Y. Saito, S. Uemura, and K. Hamaguchi, Jpn. J. Appl. Phys., Part 2 37,\nL346 \u00011998\u0002.\n8C. M. Sayes, F. Liang, J. L. Hudson, J. Mendez, W. Guo, J. M. Beach, V.\nC. Moore, C. D. Doyle, J. L. West, W. E. Billups, K. D. Ausman, and V.\nL. Colvin, Toxicol. Lett. 161, 135 \u00012006\u0002.\n9A. A. Shvedova, V. Castranova, E. R. Kisin, D. Schwegler-Berry, A. R.\nMurray, V. Z. Gandelsman, A. Maynard, and P. Baron, J. Toxicol. Environ.\nHealth 66, 1909 \u00012003\u0002.\n10G. Ruffini, S. Dunne, E. Farres, J. Marco, C. Ray, E. Mendoza, R. Silva,\nand C. Grau, Proceedings of Eurosensors XIX Barcelona, Spain, 2005,\nhttp:\/\/arxiv.org\/abs\/physics\/0510145 \u0003Sens. Actuators\u0004.\n11J. M. Bonard, C. Klinke, K. A. Dean, and B. F. Coll, Phys. Rev. B 67,\n115406 \u00012003\u0002.\n12Z. Chen, D. den Engelsen, P. K. Bachmann, V. van Elsbergen, I. Koehler,\nJ. Merikhi, and D. U. Wiechert, Appl. Phys. Lett. 87, 243104 \u00012005\u0002.\n13Y. W. Zhu, F. C. Cheong, T. Yu, X. J. Xu, C. T. Lim, J. T. L. Thong, Z. X.\nShen, C. K. Ong, Y. J. Liu, A. T. S. Wee, and C. H. Sow, Carbon 43, 395\n\u00012005\u0002.\n14K. S. Ahn, J. S. Kim, C. O. Kim, and J. P. Hong, Carbon 41, 2481 \u00012003\u0002.\n15C. Y. Zhi, X. D. Bai, and E. G. Wang, Appl. Phys. Lett. 81, 1690 \u00012002\u0002.\n16Chuan-Ping Juan, C.-C. Tsai, Kuei-Hsien Chen, Li-Chyong Chen, and\nHuang-Chung Cheung, Jpn. J. Appl. Phys., Part 1 44, 8231 \u00012005\u0002.\n17K. Yu, Z. Q. Zhu, M. Xu, Q. Li, and W. Lu, Chem. Phys. Lett. 373, 109\n\u00012003\u0002.\n18J. H. Han, S. H. Lee, A. S. Berdinsky, Y. W. Kim, J. B. Yoo, C. Y. Park,\nJ. J. Choi, T. Jung, I. T. Han, and J. M. Kim, Diamond Relat. Mater. 14,\n1891 \u00012005\u0002.\n19C. H. Poa, S. R. P. Silva, P. C. P. Watts, W. K. Hsu, H. W. Kroto, and D.\nR. M. Walton, Appl. Phys. Lett. 80, 3189 \u00012002\u0002.\n20C. H. P. Poa, R. C. Smith, S. R. P. Silva, P. C. P. Watts, W. K. Hsu, H. W.\nKroto, and D. R. M. Walton, J. Vac. Sci. Technol. B 21, 1715 \u00012003\u0002.\n21K. Liao and S. Li, Appl. Phys. Lett. 79, 4225 \u00012001\u0002. AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}