{"doi":"10.1017\/S0008197309000579","coreId":"103184","oai":"oai:epubs.surrey.ac.uk:3044","identifiers":["oai:epubs.surrey.ac.uk:3044","10.1017\/S0008197309000579"],"title":"Homophobic harassment where no one is gay. Case note on English v Sanderson","authors":["Connolly, M"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:3044<\/identifier><datestamp>\n      2017-10-31T14:07:44Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:6C617770756273<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/3044\/<\/dc:relation><dc:title>\n        Homophobic harassment where no one is gay. Case note on English v Sanderson<\/dc:title><dc:creator>\n        Connolly, M<\/dc:creator><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:date>\n        2009<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/3044\/4\/licence.txt<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        attached<\/dc:rights><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/3044\/6\/homophobic%20harrassment.pdf<\/dc:identifier><dc:identifier>\n          Connolly, M  (2009) Homophobic harassment where no one is gay. Case note on English v Sanderson   Cambridge Law Journal, 68 (2).  pp. 265-268.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0008197309000579<\/dc:relation><dc:relation>\n        10.1017\/S0008197309000579<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/3044\/","http:\/\/dx.doi.org\/10.1017\/S0008197309000579","10.1017\/S0008197309000579"],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"HOMOPHOBIC HARASSMENT WHERE NO ONE IS GAY  \n \n \nEnglish v Thomas Sanderson [2008] EWCA 1421 \n \nEmployment Equality (Sexual Orientation) Regulations 2003 SI 2003\/1661 \n \n \n \n \nMr English was harassed by colleagues using sexual innuendo suggesting he was \nhomosexual. This conduct was rooted, apparently, in two things: he lived in Brighton \n(a well known centre of the gay scene) and had attended boarding school. What made \nthis case unusual is that Mr English was heterosexual, and his tormentors neither \nassumed nor perceived Mr English to be gay. Mr English was aware throughout that \nhis tormentors never mistook him for being homosexual. For these reasons the EAT \nfound that the mockery did not amount to unlawful harassment on the grounds of \nsexual orientation. However, by a 2-1 majority, the Court of Appeal reversed.   \nThe technical issue in this case was whether someone could be liable for \nharassment ‘on the grounds of’ sexual orientation, under regulation 5 of the \nEmployment Equality (Sexual Orientation) Regulations 2003 SI 2003\/1661, when the \ntreatment was unrelated to any particular person’s sexual orientation. The outcome is \nrelevant to the many the statutory definitions employing the phrase on grounds of’, \nsuch as harassment (and direct discrimination), on grounds of sex, religion or belief, \nrace, age and disability, and gender reassignment. \nThere are two versions of the phrase, one narrow and one broad. Harassment \nis unlawful either ‘on grounds of’ a protected status (broad), or ‘on grounds of’ his \nprotected status (narrow). It is, for example, the difference between ‘on grounds of \nrace’, or ‘on grounds of his race’. At present, the UK legislation provides a broad \ndefinition for race, sexual orientation, and religion or belief. The narrow definition \ncovers gender reassignment and age. For sex, the harassment need only be related to \nher sex, an even broader phrase used to resolve a problem particular to gender (see \nEOC v Secretary of State for Trade and Industry [2007] ICR 1234 (HC Admin)). The \nDisability Discrimination Act 1995 carries the narrow definition, but this is unlikely \nto survive the ECJ’s ruling that the parent ‘Framework’ Directive 2000\/78\/EC \nimposes the broad version (Coleman v Attridge Law Case C-303\/06 [2008] IRLR 722 \n(ECJ)). Direct discrimination suffers from similar, albeit slightly varied, \ndiscrepancies. \nThe significance of the broad definition is that it extends the coverage to \nharassment or discrimination on the ground of a third party’s protected status (e.g. \nharassing a white woman for marrying a black man), and to ‘perceived’ \ndiscrimination (e.g. harassing an Asian man on the mistaken belief that he is Muslim \nor a straight man on the mistaken belief he is gay).  \nThe phrase ‘on the ground of sexual orientation’ lends itself to cover the \nscenario in the instant case. As Sedley LJ observed, the distance between perceived \nharassment and harassing a man as if he were gay when he is not ‘is barely \nperceptible’ ([38]). However, less technical considerations were prevalent in his \nreasoning ([39]): \n[People] ...  may desire to keep their orientation to themselves but still be vulnerable to \nharassment by people who know or sense what their orientation is. It cannot possibly have \nbeen the intention, when legislation was introduced to stop sexual harassment in the \nworkplace, that such a claimant must declare his or her true sexual orientation in order to \nestablish that the abuse was ‘on grounds of sexual orientation’. ... The case would have been \nexactly the same if Mr English had elected ... to remain silent about his actual sexual \norientation.... And the same would be the case if he were actually gay or bisexual but \npreferred not to disclose it.  \n \nThe underlying consideration here is to protect homosexual (or bisexual) workers \nfrom being ‘outed’ by a systematic campaign of abuse. In such a pernicious scenario, \nthe worker would have to suffer the abuse in silence unless or until he ‘came out’. As \nsuch, this decision helps preserve the dignity of workers that discrimination law is \nsupposed to enshrine (see the text of regulation 5 and Coleman v Attridge Law, ibid \nAG[8]-[15]). \nIn addition to harassment on protected grounds, sexual harassment is unlawful. \nThe Sex Discrimination Act 1975, section 4A, prohibits ‘conduct of a sexual nature \nthat has the purpose or effect of violating her dignity or, of creating an intimidating, \nhostile, degrading, humiliating or offensive environment for her ...’ Although this is \nprovided by the Sex Discrimination Act, its scope is not limited to male-to-female \nconduct, or the reverse. The perpetrator is ‘a person’ while the victim is ‘her’ or ‘him’ \n(s 4A(5)). Thus ‘same-sex’ sexual harassment is covered by this provision and even \nbefore the English decision, victims of sexual harassment were under no obligation to \nreveal their sexual orientation. The abuse of Mr English included ‘sexual innuendo’ \nand ‘lurid comments’ ([3]), and so the abuse would appear to amount to sexual \nharassment as well as sexual orientation harassment. No mention of this apparent \noversight was made in the judgment. Indeed, Sedley LJ (see the extract above) \nappeared to confuse sexual harassment with harassment on the ground of sexual \norientation. That said, not all cases of homophobic abuse will be of a sexual nature, \nand so regulation 5 and this decision are not redundant.  \nThe most obvious principle to emerge from this decision is that victims of \nsexual orientation harassment are under no obligation to disclose their sexual \norientation to succeed. Thus, workers cannot be ‘outed’ by a campaign of harassment.  \nAccordingly, victims of religious harassment should not be obliged to disclose their \nreligion, and so on. \nMore broadly, the case draws attention to the numerous possibilities when \ndefining harassment (or direct discrimination), which could be restricted to the \nclaimant’s protected status, or extended to cover perhaps, ‘third-party’ discrimination, \nperceived discrimination, and conduct unrelated to any particular person’s condition. \nVarious versions appear inconsistently and incoherently across the domestic \nlegislation, and those definitions falling short of the broad possibility confirmed in \nEnglish, fall short of the consistently broad definition provided by the predominant \nEC Directives. \n \nMichael Connolly \nUniversity of Surrey \n \n \n"}