{"doi":"10.1046\/j.1365-8711.2003.06593.x","coreId":"66382","oai":"oai:dro.dur.ac.uk.OAI2:1647","identifiers":["oai:dro.dur.ac.uk.OAI2:1647","10.1046\/j.1365-8711.2003.06593.x"],"title":"The unusual supernova remnant surrounding the ultraluminous X-ray source IC 342 X-1.","authors":["Roberts, T. P.","Goad, M. R.","Ward, M. J.","Warwick, R. S."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-07","abstract":"We report the results of an observation of a large-diameter (110 pc) supernova remnant (SNR) found to encircle the position of the ultraluminous X-ray source (ULX) IC 342 X-1. The inferred initial energy input to the SNR is at least 2-3 times greater than the canonical energy for an `ordinary' SNR. Two regions on the inside of the shell are bright in [O III]λ5007 emission, possibly as the result of X-ray photoionization by the ULX. If this is the case, then the morphology of this nebulosity implies that the X-ray emission from the ULX is anisotropic. The presence of the ULX, most probably a black hole X-ray binary, within an unusually energetic SNR suggests that we may be observing the aftermath of a gamma-ray burst, although other origins for the energetic nebula are discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66382.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1647\/1\/1647.pdf","pdfHashValue":"a8e566f0433950d2acda6a7989710ad14828141e","publisher":"Blackwell","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1647<\/identifier><datestamp>\n      2014-07-24T15:53:11Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The unusual supernova remnant surrounding the ultraluminous X-ray source IC 342 X-1.<\/dc:title><dc:creator>\n        Roberts, T. P.<\/dc:creator><dc:creator>\n        Goad, M. R.<\/dc:creator><dc:creator>\n        Ward, M. J.<\/dc:creator><dc:creator>\n        Warwick, R. S.<\/dc:creator><dc:description>\n        We report the results of an observation of a large-diameter (110 pc) supernova remnant (SNR) found to encircle the position of the ultraluminous X-ray source (ULX) IC 342 X-1. The inferred initial energy input to the SNR is at least 2-3 times greater than the canonical energy for an `ordinary' SNR. Two regions on the inside of the shell are bright in [O III]λ5007 emission, possibly as the result of X-ray photoionization by the ULX. If this is the case, then the morphology of this nebulosity implies that the X-ray emission from the ULX is anisotropic. The presence of the ULX, most probably a black hole X-ray binary, within an unusually energetic SNR suggests that we may be observing the aftermath of a gamma-ray burst, although other origins for the energetic nebula are discussed.<\/dc:description><dc:subject>\n        Black hole physics<\/dc:subject><dc:subject>\n         Supernova remnants<\/dc:subject><dc:subject>\n         Galaxies<\/dc:subject><dc:subject>\n         IC 342<\/dc:subject><dc:subject>\n         X-rays.<\/dc:subject><dc:publisher>\n        Blackwell<\/dc:publisher><dc:source>\n        Monthly notices of the Royal Astronomical Society, 2003, Vol.342(3), pp.709-714 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1647<\/dc:identifier><dc:identifier>\n        issn:0035-8711<\/dc:identifier><dc:identifier>\n        issn: 1365-2966<\/dc:identifier><dc:identifier>\n        doi:10.1046\/j.1365-8711.2003.06593.x<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1647\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1046\/j.1365-8711.2003.06593.x<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1647\/1\/1647.pdf<\/dc:identifier><dc:rights>\n        The definitive version is available at www.blackwell-synergy.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1365-2966"," 1365-2966","0035-8711","issn:0035-8711"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":["Black hole physics","Supernova remnants","Galaxies","IC 342","X-rays."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n29 April 2008\nVersion of attached file:\nOther\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nRoberts, T. P. and Goad, M. R. and Ward, M. J. and Warwick, R. S. (2003) ’The unusual supernova remnant\nsurrounding the ultraluminous X-ray source IC 342 X-1.’, Monthly notices of the Royal Astronomical Society.,\n342 (3). pp. 709-714.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1046\/j.1365-8711.2003.06593.x\nPublisher’s copyright statement:\nThe definitive version is available at www.blackwell-synergy.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 3042 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online 25 April 2008 \n \nCitation for item:  \nRoberts, T. P. and Goad, M. R. and Ward, M. J. and Warwick, R. S. (2003) 'The \nunusual supernova remnant surrounding the ultraluminous X-ray source IC 342 X-1.' , \nMonthly notices of the Royal Astronomical Society., 342 (3), pp. 709-714. \n \nDefinitive version available at:  \nhttp:\/\/dx.doi.org\/10.1046\/j.1365-8711.2003.06593.x \nar\nX\niv\n:a\nstr\no-\nph\n\/0\n30\n31\n10\nv1\n  5\n M\nar\n 2\n00\n3\nMon. Not. R. Astron. Soc. 000, 000–000 (0000) Printed 2 February 2008 (MN LATEX style file v2.2)\nThe unusual supernova remnant surrounding the\nultraluminous X-ray source IC 342 X-1\nT. P. Roberts1,∗, M. R. Goad2, M. J. Ward1 & R. S. Warwick1\n1 X-ray and Observational Astronomy Group, Dept. of Physics & Astronomy, University of Leicester, University Road, Leicester, LE1 7RH\n2 Dept. of Physics & Astronomy, University of Southampton, Highfield, Southampton, Hants., SO17 1BJ\n∗E-mail: tro@star.le.ac.uk\nABSTRACT\nWe report the results of an observation of a large diameter (110 pc) supernova remnant\n(SNR) found to encircle the position of the ultraluminous X-ray source (ULX) IC 342\nX-1. The inferred initial energy input to the SNR is at least 2 – 3 times greater than the\ncanonical energy for an “ordinary” supernova remnant. Two regions on the inside of the\nshell are bright in [OIII] λ5007 emission, possibly as the result of X-ray photoionization\nby the ULX. If this is the case, then the morphology of this nebulosity implies that the\nX-ray emission from the ULX is anisotropic. The presence of the ULX, most probably\na black hole X-ray binary, within an unusually energetic supernova remnant suggests\nthat we may be observing the aftermath of a gamma-ray burst, though other origins\nfor the energetic nebula are discussed.\nKey words: Galaxies: individual: IC 342 – ISM: supernova remnants – X-rays:\ngalaxies – X-rays: binaries – Black hole physics\n1 INTRODUCTION\nUltraluminous X-ray Sources (ULX) are the most lumi-\nnous point-like extra-nuclear X-ray sources found in nearby\ngalaxies, with observed X-ray luminosities in excess of\n1039 erg s−1. Whilst some recent supernovae can appear as\nULX (e.g. SN 1986J, Bregman & Pildis 1992; SN 1979C,\nImmler et al. 1998), the majority of ULX are believed to\nbe accreting systems, and indeed ASCA studies have shown\nthat many ULX display the characteristics of accreting black\nholes (e.g. Makishima et al. 2000; Mizuno, Kubota & Mak-\nishima 2001). Several competing models currently provide\nplausible physical descriptions of these systems, and explain\nhow they apparently reach, and in many cases greatly ex-\nceed, the Eddington luminosity for a 10 M⊙ black hole.\nThese include accretion onto a new class of 102 − 105 M⊙\nintermediate-mass black holes (e.g. Colbert & Mushotzky\n1999; Miller & Hamilton 2002), possible examples of which\nwere recently inferred to be present in the globular clus-\nters G1 and M15 (Gebhardt, Rich & Ho 2002 and refer-\nences therein); truly super-Eddington X-ray emission from\n“ordinary” X-ray binaries (Begelman 2002); and anisotropic\nemission from X-ray binaries (King et al. 2001), perhaps rel-\nativistically beamed if we are looking down the jets of mi-\ncroquasars (e.g. Ko¨rding, Falcke & Markoff 2002). Current\nobservations do not rule out any of these models, but they\ndo suggest a heterogeneous population, with ULX associ-\nated with both the nascent stellar populations found in star\nforming regions, and the old stellar population found in el-\nliptical galaxies (c.f. Roberts et al. 2002; Sarazin, Irwin &\nBregman 2001 - see King 2002 for further discussion).\nIC 342 X-1 is one of the nearest and most\ncomprehensively-studied ULX1. It was originally detected in\nan Einstein IPC observation of IC 342 with a 0.2 – 4 keV X-\nray luminosity of 3.0× 1039 erg s−1 (Fabbiano & Trinchieri\n1987). A subsequent ROSAT observation also detected the\nsource in an ultraluminous state (Bregman, Cox & Tomisaka\n1993; Roberts & Warwick 2000). An ASCA observation ob-\ntained in September 1993 showed IC 342 X-1 to be in a\nvery luminous state (LX > 1.5 × 10\n40 erg s−1, 0.5 - 10\nkeV), in which it displayed large amplitude, short timescale\n(∼ 1000 s) variability (Okada et al. 1997), and possessed\nan X-ray spectral form characteristic of black hole accretion\ndisc spectra in the high\/soft state (Makishima et al. 2000).\nConversely, a deep follow-up ASCA observation in February\n2000 showed the ULX to have dimmed to 6 × 1039 erg s−1\n(0.5 - 10 keV) and undergone a spectral transition into a\nlow\/hard state, similar behaviour to that observed in many\n1 The precise distance to IC 342 remains quite uncertain, due to\nhigh foreground obscuration. Previous X-ray analyses assume dis-\ntances of ∼ 4 Mpc, consistent with the distance of 3.9 Mpc quoted\nby Tully (1988), which is itself supported by a later analysis plac-\ning the IC 342\/Maffei group at a distance 3.6 ± 0.5 Mpc (Kris-\nmer, Tully & Gioia 1995). However, other studies have placed\nthe galaxy much closer. For example, photometry of supergiant\nstars in IC 342 imply a distance of only 2.1 Mpc (Karachentsev &\nTikhonov 1993). In this paper we assume a distance of 3.9 Mpc.\n2 T.P. Roberts et al.\nFigure 1. INTEGRAL images of the IC 342 X-1 field. The greyscale is in units of observed surface brightness, and ranges between\n0 (black) and 2.5 × 10−17 erg cm−2 s−1 A˚−1 arcsec−2 (white) for the 5300 - 5500 A˚ continuum and [SII] images, and 0 to 5 ×\n10−17 erg cm−2 s−1 A˚−1 arcsec−2 for the Hα+[NII] image. The circle represents the uncertainty in the position of IC 342 X-1.\nGalactic and Magellanic black hole binary systems (Kubota\net al. 2001; Mizuno, Kubota & Makishima 2001). An alter-\nnate view is that IC 342 X-1 could have been in the very\nhigh\/anomalous state during this observation, which is also\nseen in many Galactic black hole binaries (Kubota, Done &\nMakishima 2002). IC 342 X-1 is therefore one of the best\ncandidates for a bona fide black hole X-ray binary ULX.\nMulti-wavelength studies are crucial to understanding\nthe nature of ULX, through the identification of potential\ncounterparts and the investigation of their immediate en-\nvironment. Several ULX have been shown to be associated\nwith structures apparent in other bands. For example, a star\nforming complex on the edge of NGC 4559 is host to the\nluminous ULX NGC 4559 X-7 (Vogler, Pietsch & Bertoldi\n1997), and M81 X-9 is located within a shock-heated giant\nnebula, possibly a supershell formed by one very energetic\nsupernova, or multiple supernovae (Miller 1995; Wang 2002).\nHowever, the precise identification of possible counterparts,\nor the exact location of ULX within larger structures, has\nonly been possible in the new era of sub-arcsecond X-ray\nastrometry provided by Chandra. This has led to the first\nidentification of possible stellar counterparts to ULX, in par-\nticular with the identification of three young (< 10 Myr\nold) compact stellar clusters associated with NGC 5204 X-1\n(Roberts et al. 2001; Goad et al. 2002), the coincidence of\na ULX in NGC 4565 with a faint globular cluster (Wu et\nal. 2002), and the identification of an O-star counterpart to\nM81 X-6 (≡ NGC 3031 X-11; Liu, Bregman & Seitzer 2002).\nThe presence of optical emission-line nebulae at, or\nclose to, the positions of several ULX has recently been re-\nported in a conference proceedings paper by Pakull & Miri-\noni (2003a; hereafter PM03). This includes the identification\nof a nebula coincident with the ROSAT HRI position of IC\n342 X-1, that they christen the “tooth” nebula on the ba-\nsis of its morphology. Their optical spectroscopy shows the\nnebula to display “extreme SNR-like emission line ratios:\n[SII]\/Hα = 1.2 and [OI]λ6300\/Hα = 0.4”. In this letter we\nreport new X-ray and optical observations that locate the\nsuspected black hole X-ray binary ULX IC 342 X-1 at the\nheart of this unusual nebula.\n2 OBSERVATIONS & RESULTS\nThe optical data were obtained on the night of 2001 Febru-\nary 1 using the INTEGRAL field spectrograph on the\nWilliam Herschel Telescope (Arribas et al. 1998). A sum-\nmary of the instrumental set-up is given in Roberts et al.\n(2001) and the data analysis will be detailed in Roberts\net al. (in preparation). In short, the INTEGRAL data\nprovided us with spectroscopy in 189 fibres and, through\nthe relative fibre positions, simultaneous imaging within a\n16.5′′ × 12.3′′ field-of-view. The IC 342 X-1 follow-up obser-\nvation was targetted on 03h45m55.2s,+68◦04′56′′, which is\nthe ROSAT HRI position after applying an astrometric cor-\nrection, calculated from the field X-ray source positions and\ntheir possible optical counterparts in the USNO catalogue2.\nA new 9.9 ks Chandra X-ray observation of IC 342 X-1\nwas obtained on 2002 April 29. The ULX was positioned on\nthe ACIS-S3 chip, which was operated in the 1\/8 sub-array\nmode to mitigate the anticipated effects of pile-up. Initial\nanalysis of the cleaned data (reduced using CIAO v2.2) de-\ntected IC 342 X-1 at a position 03h45m55.68s,+68◦04′54.9′′.\nAn investigation of the radial profile of the source indicates\nthat it is point-like at the 0.5′′ resolution of Chandra. Un-\nfortunately, only one other source was detected on the S3\nchip (at 03h46m32.90s,+68◦03′56.0′′), and this faint source\ndoes not have an optical counterpart, hence a direct check\nof the astrometry was not possible. We therefore adopt the\nChandra position for IC 342 X-1, and assume a conserva-\ntive accuracy of ±1′′ for the X-ray position (c.f. Goad et al.\n2002). We defer further analysis of the X-ray emission of IC\n342 X-1 to a future paper; for the remainder of this letter\nwe concentrate upon the interpretation of the INTEGRAL\ndata in the context of the precise determination of the X-ray\nposition.\nSeveral optical continuum sources and an emission-line\nnebula are evident in the INTEGRAL field-of-view. We show\na continuum image, plus continuum-subtracted emission-\nline images in Hα+[NII] and [SII] in Figure 1. The nebula\nis characterised by a shell-like morphology, and has a high\n[SII]\/Hα emission-line flux ratio of ∼ 1.1 throughout its ex-\ntent, hence we interpret it as a supernova remnant (SNR),\nconsistent with the comments of PM03 (c.f. Matonick &\nFesen 1997 and references therein). This remnant was not\nreported in a previous search for such objects in IC 342\nby D’Odorico, Dopita & Benvenuti (1980). In Figure 1 we\nillustrate the uncertainty in the position of IC 342 X-1 us-\ning a circle of radius 1.5′′; this is a conservative estimate\n2 All co-ordinates in this letter are quoted in epoch J2000.\nThe unusual supernova remnant surrounding the ultraluminous X-ray source IC 342 X-1 3\nFigure 2. The total flux-calibrated INTEGRAL spectrum of the\nSNR. This spectrum is not corrected for Galactic extinction.\nSmall portions of the spectrum are excluded around the Na-D,\nHeI and [OI] sky lines to remove residual contamination.\nTable 1. Integrated emission-line fluxes, corrected for reddening.\nSpecies λ (A˚) Flux (×10−15 erg cm−2 s−1)\nHβ 4861 1.7± 0.5\n[OIII] 4959 0.4± 0.2\n5007 1.2± 0.2\n[NII] 5755 0.4± 0.2\n6548 1.6± 0.2\n6583 4.6± 0.2\nHα 6563 5.8± 0.1\n[SII] 6717 3.7± 0.1\n6731 2.6± 0.1\nbased on the intrinsic Chandra astrometry error discussed\nabove, with an additional contribution of ±1′′ corresponding\nto the uncertainty in the INTEGRAL astrometry. The ULX\nis clearly not associated with the bright continuum source at\nthe eastern edge of the image, but is in fact positionally co-\nincident with the central regions of the supernova remnant.\nThis raises the intriguing possibility that the ULX may be\nphysically related to the supernova remnant.\nIn Figure 2 we show the INTEGRAL spectrum of the\nsupernova remnant, integrated over the whole spatial extent\nof the nebulosity (58 out of 189 fibres) within the field-of-\nview. It is immediately obvious that the spectrum suffers\nfrom a high degree of reddening; in fact the line-of-sight\nto IC 342 has an extinction of E(B − V ) = 0.6, a conse-\nquence of its low Galactic latitude (b ∼ 10◦). This severely\nlimits the sensitivity at the blue end of our spectrum. The\nresidual contamination from sky lines is removed from Fig-\nure 2. Large positive residuals were found in the data at\nthe positions of the [OI] λ6300 and λ6363 lines, but the\nrelatively low spectral resolution (∼ 6 A˚) of the data and\nthe added complication of excluding spatially-variable sky\nlines from fibre data implies that any physical measurements\nfrom these residuals would be very uncertain. We therefore\nremove them from our analysis. The reddening-corrected in-\ntegrated fluxes of the diagnostically important emission lines\nare given in Table 1.\nThe inferred characteristics of the supernova remnant\nare listed in Table 2. Both the radius of the bright northern\nTable 2. The properties of the supernova remnant.\nRadius Rneb 55 pc\nShell velocity Vs < 180 km s−1\nAge τneb > 92000 yr\nInitial energy (×1051 erg) E51 > 2\nAmbient ISM density n0 > 0.12 cm−3\nElectron density a Ne < 40 cm−3\nElectron temperature b Te < 3× 104 K\nNotes: a from [SII] λ6731\/λ6717 = 1.4± 0.1.\nb From [NII] (λ6548 + λ6583)\/λ5755 < 15.5.\npart of the supernova shell3, Rneb, and the velocity of the\nmaterial in the shell, Vs, are directly derived from our INTE-\nGRAL observations (Vs is a 3σ upper limit on the velocity\nof the Hα emitting region, determined from a comparison of\nthe Hα line FWHMwith that of the sky lines). However, the\nlow [OIII]\/Hβ ratio of ∼ 1 suggests that the actual velocity\nmay indeed be lower, probably < 100 km s−1 (Dopita et al.\n1984). To derive the age of the SNR and its initial explosion\nenergy we follow the method shown in PM03, who use the\npressure-driven snowplough phase equations of Cioffi, Mc-\nKee & Bertschinger (1988) to describe the current expansion\nof an old, very large SNR. As with PM03, this relies on an\nestimate of the ambient ISM density around the supernova\nprogenitor as determined from the total radiative Hβ flux\nof the nebula (in our case a luminosity of 3× 1036 erg s−1),\nusing the equations of Dopita & Sutherland (1995). The lim-\nits derived from these equations are shown in Table 2. We\nalso show limits on the electron density and temperature in\nthe shocked region calculated from the [SII] λ6731\/λ6717\n(density) and [NII] (λ6548 + λ6583)\/λ5755 (temperature)\nratios, as per Osterbrock (1989). Table 2 indicates that the\nsupernova remnant is unusually large, having a projected\ndiameter of at least 110 pc. For comparison, Matonick &\nFesen (1997) argue that a typical single supernova remnant\nwill not remain visible once it has expanded beyond a diam-\neter of 100 pc, for a canonical energy input of 1051 erg. One\nway in which a single supernova remnant could reach the ob-\nserved size is if the initial explosion energy exceeds 1051 erg,\nwhich appears to be the case for this nebula since we calcu-\nlate a lower limit on the initial energy input of ∼ 2 × 1051\nerg. We discuss this possibility further in Section 4.\n3 EVIDENCE FOR AN X-RAY IONIZED\nNEBULA INSIDE THE SUPERNOVA\nREMNANT?\nA remarkable spatial feature of this supernova remnant is re-\nvealed upon closer inspection of the continuum-subtracted\nemission-line images. Whilst the Hα, [NII] and [SII] images\nall trace the same shell structure, an image created from\nthe faint [OIII] line shows a distinctly different morphology,\n3 We conservatively use the brightest (and hence the densest)\npart of the shell, since it provides the best emission line con-\nstraints. We note that the lower surface brightness extension of\nthe nebula, particularly to the south of the shell structure, may\nbe due to density gradients in the ambient ISM allowing faster\nexpansion in this direction.\n4 T.P. Roberts et al.\nFigure 3. The unusual ionization structure of the IC 342 X-\n1 SNR. The three colours represent 5300 – 5500 A˚ continuum\nemission (green), continuum-subtracted Hα+[NII] emission (red),\nand continuum-subtracted [O III] emission (blue). The [O III]\nemission is highlighted by blue contours showing the 3 and 3.5σ\nconfidence levels above the background noise. The uncertainty in\nthe position of IC 342 X-1 is shown by the circle.\nillustrated in Figure 3. The faint [OIII] emission appears\nconcentrated on the inside of the supernova remnant, and\ntraces the inside of the shell, both within the positional er-\nror circle of the ULX and to the north-west of this position.\nHowever, this [OIII] nebula does not appear to follow the\nentire structure of the inside of the shell, with no emission\ndetected along the inside of the northern part of the shell.\nThe presence of enhanced [OIII] emission on the inner-edge\nof the shell is confirmed by extracting spectra from indi-\nvidual fibres in both the [OIII] region and to the north of\nthis position, which confirm a higher average [OIII]\/Hβ ra-\ntio in the former (1.0 vs 0.5 in the respective reddening-\ncorrected ratios)4. It therefore appears that there is a con-\ncentration of highly-excited oxygen located on the inside\nof the much larger supernova remnant. Furthermore, given\nthat the shock front passed through this region of the neb-\nula at least half the SNR lifetime ago (assuming a physically\nunrealistic constant expansion velocity), and that the [OIII]\nrecombination time is much shorter than the age of the neb-\nula (τrec > 150 years for Ne < 40 cm\n−3)5, it is possible\nthat a process other than the supernova blast wave may be\nenergising the [OIII] emission. If this is so, what could be\nproducing it?\nOne possibility is that this high-excitation emission is\nproduced by the ULX. In particular, it could potentially\nbe photoionized by the > 1039 erg s−1 X-ray flux to pro-\nduce an “X-ray ionized nebula” (XIN). Relatively few ex-\namples of this phenomenon are currently known. Two ex-\namples are the XIN associated with the high-mass X-ray\nbinary LMC X-1 (Pakull & Angebault 1986) and the super-\n4 These [OIII]\/Hβ ratios are not indicative of high excitation\nregions. However, given the spatial resolution of ∼ 20 pc per\nfibre, this of course does not preclude smaller parsec-scale high-\nexcitation regions within the nebula.\n5 We note that Ne may be a factor 100 smaller, and thus τrec\n100 times larger, if the temperature exceeds 15000 K. This is still\nmuch less than the age of the remnant.\nsoft X-ray source CAL 83 (Remillard, Rappaport & Macri\n1995), both in the Large Magellanic Cloud. Also, an XIN was\nrecently discovered associated with the ULX in Holmberg II\n(PM03). On first appearances, our [OIII] nebula bears re-\nmarkable similarities to the [OIII] nebula surrounding CAL\n83, which is also located on the inside of an incomplete\nHα shell. However, our observed [OIII]\/Hβ flux ratio is\nmuch smaller than that observed around CAL 83, which\nhas a ratio [OIII]\/Hβ = 15± 2, indicative of a very high ex-\ncitation state (though see footnote 4). This difference may\nperhaps be a result of the very different X-ray spectra of\nCAL 83 and IC 342 X-1. CAL 83 is a classic supersoft X-\nray source, with a very soft X-ray spectrum that produces\na large flux of UV and very soft X-ray photons, that are\nideally suited to photoionizing its immediate environment\n(Remillard et al. 1995), whereas IC 342 X-1 displays the\nmuch harder X-ray spectrum characteristic of a black hole\nX-ray binary. Also, in the case of CAL 83 the surrounding\nmedium is very different, with the XIN being produced in\nthe ISM in the vicinity of the X-ray source, as opposed to\nin the inner parts of a supernova shell.\nIt is therefore informative to consider other possible\nsignatures of X-ray ionization. The XIN around LMC X-\n1 and the Holmberg II ULX were primarily identified by the\npresence of relatively faint HeII λ4686 lines in their opti-\ncal spectra. Unfortunately, the high extinction towards IC\n342 means that our INTEGRAL spectrum is dominated by\nnoise at short wavelengths, so we are not sensitive to faint\nline emission below Hβ. The observational evidence for the\n[OIII] nebula being X-ray ionized is therefore inconclusive,\nat least on the basis of the INTEGRAL data alone.\nAnother method of addressing whether the [OIII] neb-\nulosity is an XIN is simply to consider whether we would\nexpect the ULX to create a photoionized zone consistent\nwith the size of the nebula. We estimate the number of\navailable photoionizing X-ray photons using the best-fit to\nthe ASCA data for IC 342 X-1 in its high state, namely\na multi-colour disc blackbody model (Kubota et al. 2001).\nBy extrapolation this gives a hydrogen ionizing flux of\nQ = 2.3 × 1048 photon s−1 in the 13.6 – 300 eV range,\noriginating in the ULX and not escaping the nebula (cal-\nculated in XSPEC, assuming a hydrogen density of of 0.12\natom cm−3 in the nebula, and that the nebula becomes\nessentially transparent to X-ray photons at 300 eV). This\nionizing flux will create a Stromgren sphere in Hα up to\n170 pc in radius for a low density (0.12 atom cm−3,≡ n0),\nhomogeneous medium. However, for IC 342 X-1 we should\nconsider the case in which a higher density medium (the\nSNR shell) surrounds a low density cavity. Assuming that\nIC 342 X-1 is located in the centre of the cavity, placing it\n∼ 20 pc from the nebula, and that the cavity is essentially\nempty whilst the edge of the nebula has a density of e.g. 3\natom cm−3, then a similar calculation shows that the ULX\nwill photoionize the surface of the nebula, penetrating up\nto 7 pc into the denser gas. Of course, in reality the den-\nsity of 3 atom cm−3 is higher than the predicted post-shock\ndensity6, and the edge of the nebula may not be tightly de-\n6 The density in the post-shock regions may be estimated as\nNS = 4n0 (Osterbrock 1989), implying NS ∼ 0.5 cm\n−3 in this\ncase.\nThe unusual supernova remnant surrounding the ultraluminous X-ray source IC 342 X-1 5\nfined, which should act to increase the physical size of the\nionized zone. Finally, we note that following the well-known\nrelation L(Hα) = 1.3× 10−12Q erg s−1 implies that a maxi-\nmum Hα luminosity of ∼ 3× 1036 erg s−1 originates in the\nXIN, though this probably has a large error margin due to\nthe uncertainty inherent in extrapolating the ULX spectrum\nbelow 300 eV, and in using a relation that is strictly valid for\nstellar EUV sources. This is below the observed Hα lumi-\nnosity of 1× 1037 erg s−1, supporting the scenario in which\nan XIN sits on the inner edge of a larger SNR which has\nproduced the bulk of the Hα excitation.\nAn alternative interpretation is that the large uncer-\ntainty in the errors could be consistent with the entire\nHα luminosity originating in X-ray ionization. It would im-\nply the whole nebula is X-ray ionized, and not a supernova\nremnant. In this paper we interpret the object as a super-\nnova remnant on the basis of a high [SII]\/Hα ratio imply-\ning a shock excited nebula. We note that Pakull & Mirioni\n(2003b) suggest that X-ray ionized nebulae may contain an\nextended warm (Te = 10\n4K) low-ionization region which\nwould excite strong lines of near-neutral species such as [OI]\nand [SII], thereby mimicking the emission-line ratios of a\nshock-excited nebula. Further work to confirm this model\nwould be of great importance.\nThe above discussion assumes that the X-ray emission\nof the ULX is isotropic. In this case the morphology of the\nphotoionized nebula should reflect the distribution of the\nsurrounding material. However, the discrepancy between the\nbi-modal [OIII] distribution and the half-shell distribution in\nthe supernova remnant suggests that the nebula is not see-\ning an isotropic photoionizing source. This implies that the\nX-ray emission of the ULX is anisotropic, as has been sug-\ngested to explain the apparent super-Eddington luminosities\nof ULX (King et al. 2001).\nA potential alternative source of ionization for the [OIII]\nnebulosity is one or more young stars. The presence of the\nsupernova remnant and the ULX suggest that young stars\nexist in this region of IC 342 (a link between many ULX\nand young stellar populations appears increasingly likely; see\ne.g. Roberts et al. 2002). The total [OIII] luminosity in the\ncentral regions of the supernova remnant (L[OIII],λ5007 ∼ 9×\n1035 erg s−1) is consistent with the observed luminosities of\nnearby HII regions in our Galaxy. Indeed, the Orion nebula\nhas a luminosity of L[OIII],λ5007 ∼ 2 × 10\n37 erg s−1 (Pogge,\nOwen & Atwood 1992), with the ionisation originating in\na single O7V star, θ1 Ori C, possessing an ionising flux of\nQ = 1049−50 photon s−1 (Ferland 2001). Curiously, if ULX\nare black-hole X-ray binaries containing a young secondary\nstar (c.f. King et al. 2001), then it is plausible that the [OIII]\nexcitation might originate in the secondary star in the ULX\nsystem, though we note that the morphology of the [OIII]\nnebula might argue against a single stellar excitation source.\nThe presence of one or more O-stars is not ruled out by our\ncontinuum images, which only probe down to MV ∼ −9 in\nIC 342 due, in part, to the heavy line-of-sight reddening.\nDeeper optical continuum observations of the environment\nof IC 342 X-1 will provide the crucial constraints on the\npresence of young stars.\n4 A BLACK HOLE FORMED IN A\nHYPERNOVA EXPLOSION?\nAs alluded to in Section 2, the idea that the ULX may be\ncausally related to an unusually energetic supernova rem-\nnant is an intriguing one. The case for a physical link (as\nopposed to a line-of-sight coincidence) between the two is\nmade stronger if we can attribute the [OIII] nebular emis-\nsion within the SNR to the ULX at its centre. As discussed\nin the introduction, this particular ULX is one of the best\ncandidates for a bona fide black hole X-ray binary, hence\nwe have a scenario in which a black hole system sits inside\nan energetic supernova remnant. This appears to satisfy the\nconditions for the aftermath of a gamma-ray burst, in which\nthe collapse of a massive star to a black hole triggers a su-\npernova explosion with an unusually high input energy, i.e.\na “hypernova” (e.g. Paczyn´ski 1998; Fryer & Woosley 1998).\nIf so, this system may be direct evidence that gamma-ray\nbursts do form black holes.\nThis hypothesis requires further examination. In par-\nticular, it is important to establish that this supernova rem-\nnant really is a hypernova remnant (assuming even that it\nis a supernova remnant - see previous section). Following\nthe methods adopted by PM03 we derived an initial input\nenergy of E51 > 2 (see Section 2), assuming a velocity of\n180 km s−1. If the actual velocity is < 100 km s−1, as sug-\ngested by the [OIII]\/Hβ ratio, then E51 increases, though\nonly to > 3. If we accept the same convention as Chen et al.\n(2002) and define a hypernova remnant as a supernova rem-\nnant possessing an input energy in excess of 1052 erg, the\nsupernova remnant clearly does not meet this strict criterion\n(though it could be met if the actual nebular density is closer\nto the value of < 40 cm−3 inferred from the [SII] ratio than\nthe assumed density in Table 2). However this remnant, if\nit originates in a single supernova explosion, still appears to\nbe more energetic than an “ordinary” supernova by a factor\nat least 2 – 3.\nOther scenarios for the creation of this energetic su-\npernova remnant should also be considered. In particular,\nthis remnant is morphologically very similar to the shell sur-\nrounding the ULXM81 X-9, albeit smaller in size (c.f. Miller\n1995), which is suggested to be the result of multiple super-\nnovae. A “superbubble” of this size might be distinguishable\nfrom a single energetic supernova remnant by their contrast-\ning velocities (≪ 100 km s−1 for a superbubble; c.f. Chen\net al. 2002). In this case a minimum of only 2 – 3 “ordi-\nnary” supernova events occuring inside the bubble within a\nrelatively short time (∼ 105 years) could inject sufficient en-\nergy to expand the bubble to its current size. This relatively\nhigh incidence of supernovae would require a population of\nyoung stars to reside inside the bubble, which again should\nbe unveiled by deeper optical observations.\nA further source of power that could expand the neb-\nula is a jet and\/or stellar wind originating from the ULX\nsystem. If we follow PM03, who note that the total energy\nrequirements and lifetime of a system inflated by such a\nprocess would be quantitatively similar to that from a SNR,\nthen the energetics of the nebula imply that an average of\n∼ 1039 erg s−1 would need to be injected over its lifetime.\nThis would require a mechanical energy of the wind similar\nto the radiation energy of the ULX. This is consistent with\nthe average energy input of 3×1039 erg s−1 estimated to be\n6 T.P. Roberts et al.\nrequired to inflate the W50 system in our own galaxy, prob-\nably originating in the relativistic jets of the microquasar SS\n433 (Dubner et al. 1998). PM03 also note that mildly rela-\ntivistic jets, similar to those of SS 433, could be responsible\nfor inflating many of the nebulae in their sample. This sce-\nnario could therefore constitute a very credible alternative\nto an energetic supernova event.\nFinally, is the presence of the ULX consistent with a\nblack hole possibly formed only ∼ 105 years ago? If the\nblack hole has formed in isolation it could be accreting di-\nrectly from the ISM in its vicinity via Bondi-Hoyle accre-\ntion. However, this accretion mode is unlikely to produce\nthe required X-ray luminosity, even if any “kick” it received\non formation was sufficient to move the black hole into the\ndenser nebular regions (c.f. Miller & Hamilton 2002). It is\ntherefore much more likely that the black hole is in an ac-\ncreting binary system. Such a system might expect to re-\nceive a kick on its formation in a supernova explosion. If we\nassume a similar kick to that experienced by the Galactic\nblack hole system GRO 1655-40 of ∼ 100 km s−1 (Mirabel\net al. 2002), then it will have travelled no more than ∼ 10\npc. It should clearly still be located close to the centre of\nthe supernova remnant, which is consistent with Figures 1\n& 3. However, to produce a luminous accreting binary sys-\ntem ∼ 105 years after the black hole was formed requires\nthat both the primary (black hole progenitor) and the sec-\nondary (donor) stars have very similar, large initial masses\n(c.f. Verbunt & Van den Heuvel 1995). The formation of\nsuch a binary system appears unlikely to occur in isolation,\nand may imply the presence of a young, dense cluster similar\nto those seen close to ULX in NGC 5204 (Goad et al. 2002)\nand the Antennae (Zezas et al. 2002), albeit one not bright\nenough to be detected in our observation of this field.\nACKNOWLEDGMENTS\nWe thank the referee, Manfred Pakull, for his many use-\nful comments that have greatly improved this paper. TPR\ngratefully acknowledges financial support from PPARC.\nTPR and MJW thank the Aspen Center for Physics for their\nhospitality during the drafting of this paper.\nREFERENCES\nArribas S. et al., 1998, Proc. SPIE, 3355, 821\nBegelman M.C., 2002, ApJ, 568, L97\nBregman J.N., Cox C.V., Tomisaka K., 1993, ApJ, 415, L79\nBregman J.N., Pildis R., 1992, ApJ, 398, L107\nChen C.-H.R., Chu Y.-H., Gruendl R., Lai S.-P., Wang Q.D.,\n2002, AJ, 123, 2462\nCioffi D.F., McKee C.F., Bertschinger E., 1988, ApJ, 334, 252\nColbert E.J.M., Mushotzky R.F., 1999, ApJ, 519, 89\nD’Odorico S., Dopita M.A., Benvenuti P., 1980, A&AS, 40, 67\nDopita M.A., Binette L., D’Odorico S., Benvenuti P., 1984, ApJ,\n276, 653\nDopita M.A., Sutherland R.S., 1995, ApJ, 455, 468\nDubner G.M., Holdaway M., Goss W.M., Mirabel I.F., 1998, AJ,\n116, 1842\nFabbiano G., Trinchieri G., 1987, ApJ, 315, 46\nFerland G.J., 2001, PASP, 113, 41\nFryer C., Woosley S., 1998, ApJ, 502, L9\nGalarza V.C., Walterbos R.A.M., Braun R., 1999, AJ, 118, 2775\nGebhardt K., Rich R.M., Ho L.C., 2002, ApJ, 578, L41\nGoad M.R., Roberts T.P., Knigge C., Lira P., 2002, MNRAS, 335,\nL67\nImmler S., Pietsch W., Aschenbach B., 1998, A&A, 331, 601\nKarachentsev I.D., Tikhonov N.A., 1993, A&AS, 100, 227\nKing A., 2002, MNRAS, 335, L13\nKing A., Davies M.B., Ward M.J., Fabbiano G., Elvis M., 2001,\nApJ, 552, L109\nKo¨rding E., Falcke H., Markoff S., 2002, A&A, 382, L13\nKrismer M., Tully R.B., Gioia I.M., 1995, AJ, 110, 1548\nKubota A., Done C., Makishima K., 2002, MNRAS, 337, L11\nKubota A., Mizuno T., Makishima K., Fukazawa Y., Kotoku J.,\nOhnishi T., Tashiro M., 2001, ApJ, 547, L119\nLiu J.-F., Bregman J.N., Seitzer P., 2002, ApJ, 580, L31\nMakishima K. et al., 2000, ApJ, 535, 632\nMatonick D.M., Fesen R.A., 1997, ApJS, 112, 49\nMiller B.W., 1995, ApJ, 446, L75\nMiller M.C., Hamilton D.P., 2002, MNRAS, 330, 232\nMirabel I.F., Mignani R., Rodrigues I., Combi J.A., Rodr´iguez\nL.F., Guglielmetti F., 2002, A&A, 395, 595\nMizuno T., Kubota A., Makishima K., 2001, ApJ, 554, 1282\nOkada K., Dotani T., Makishima K., Mitsida K., Mihara T., 1998,\nPASJ, 50, 25\nOsterbrock D.E., 1989, Astrophysics of Gaseous Nebulae and Ac-\ntive Galactic Nuclei, California: University Science Books\nPaczyn´ski B., 1998, ApJ, 494, L45\nPakull M.W., Angebault L.P., 1986, Nature, 322, 511\nPakull M.W., Mirioni L., 2003a, in Proceedings of the Sympo-\nsium “New Visions of the Universe in the XMM-Newton and\nChandra era”, ed. F. Jansen, ESA SP-488 (PM03)\nPakull M.W., Mirioni L., 2003b, RMxAC, 15, 197\nPogge R.W., Owen J.M., Atwood B., 1992, ApJ, 399, 147\nRemillard R.A., Rappaport S., Macri L.M., 1995, ApJ, 439, 646\nRoberts T.P., Goad M.R., Ward M.J., Warwick R.S., O’Brien\nP.T., Lira P., Hands A.D.P., 2001, MNRAS, 325, L7\nRoberts T.P., Warwick R.S., 2000, MNRAS, 315, 98\nRoberts T.P., Warwick R.S., Ward M.J., Murray S.S., 2002, MN-\nRAS, 337, 677\nSarazin C.L., Irwin J.A., Bregman J.N., 2000, ApJ, 544, L101\nTully R.B., 1988, Nearby Galaxies Catalog, Cambridge: Cam-\nbridge University Press\nVerbunt F., van den Heuvel E.P.J., 1995, in “X-ray Binaries”,\nEds. W.H.G. Lewin, J. van Paradijs & E.P.J. van den Heuvel,\nCambridge University Press: Cambridge\nVogler A., Pietsch W., Bertoldi F., 1997, A&A, 318, 768\nWang Q.D., 2002, MNRAS, 332, 764\nWu H., Xue S.J., Xia X.Y., Deng Z.G., Mao S., 2002, 576, 738\nZezas A., Fabbiano G., Rots A.H., Murray S.S., 2002, ApJ, 577,\n710\n"}