{"doi":"10.1016\/j.geb.2009.11.008","coreId":"214535","oai":"oai:eprints.lse.ac.uk:27653","identifiers":["oai:eprints.lse.ac.uk:27653","10.1016\/j.geb.2009.11.008"],"title":"Leadership games with convex strategy sets","authors":["von Stengel, Bernhard","Zamir, Shmuel"],"enrichments":{"references":[{"id":17296492,"title":"A price leadership method for solving the inspector’s non-constant-sum game.","authors":[],"date":"1966","doi":"10.1002\/nav.3800130103","raw":"Maschler, M. (1966), A price leadership method for solving the inspector’s non-constant-sum game. Naval Research Logistics Quarterly 13, 11–33.","cites":null},{"id":17296500,"title":"Computing equilibria for two-person games. In:","authors":[],"date":"2002","doi":"10.1111\/1468-0262.00300","raw":"von Stengel, B. (2002), Computing equilibria for two-person games. In: Handbook of Game Theory, Vol. 3, eds. R. J. Aumann and S. Hart, North-Holland, Amsterdam, 1723–1759.","cites":null},{"id":17296484,"title":"Constrained games and linear programming.","authors":[],"date":"1953","doi":"10.1073\/pnas.39.7.639","raw":"Charnes, A. (1953), Constrained games and linear programming. Proc. National Academy of Sciences of the U.S.A. 39, 639–641.","cites":null},{"id":17296473,"title":"Dynamic Noncooperative Game Theory.","authors":[],"date":"1982","doi":"10.1016\/s0076-5392(08)62951-3","raw":"Bas ¸ar, T., Olsder, G. J. (1982), Dynamic Noncooperative Game Theory. Academic Press, London.","cites":null},{"id":17296487,"title":"Endogenous timing in duopoly games: Stackelberg or Cournot equilibria.","authors":[],"date":"1990","doi":"10.1016\/0899-8256(90)90012-j","raw":"Hamilton, J., Slutsky, S. (1990), Endogenous timing in duopoly games: Stackelberg or Cournot equilibria. Games and Economic Behavior 2, 29–46. Kakutani,S.(1941),AgeneralizationofBrouwer’sﬁxedpointtheorem.DukeMath.J.8,457–459.","cites":null},{"id":17296468,"title":"Endogenous timing in two-player games: A counterexample.","authors":[],"date":"1995","doi":"10.1006\/game.1995.1018","raw":"Amir, R. (1995), Endogenous timing in two-player games: A counterexample. Games and Economic Behavior 9, 234–237.","cites":null},{"id":17296494,"title":"Equilibrium points in N-person games.","authors":[],"date":"1950","doi":"10.1073\/pnas.36.1.48","raw":"Nash, J. F. (1950), Equilibrium points in N-person games. Proc. National Academy of Sciences of the U.S.A. 36, 48–49.","cites":null},{"id":17296472,"title":"Inspection games. In:","authors":[],"date":"2002","doi":"10.1016\/s1574-0005(02)03014-x","raw":"Avenhaus, R., von Stengel, B., Zamir, S. (2002), Inspection games. In: Handbook of Game Theory with Economic Applications, Vol. 3, eds. R. J. Aumann and S. Hart, Elsevier, Amsterdam, 1947–1987.","cites":null},{"id":17296471,"title":"Inspector leadership with incomplete information.","authors":[],"date":"1991","doi":"10.1007\/978-3-662-07369-8_14","raw":"Avenhaus, R., Okada, A., Zamir, S. (1991), Inspector leadership with incomplete information. In: Game Equilibrium Models IV, ed. R. Selten, Springer, Berlin, 319–361.","cites":null},{"id":17296504,"title":"Leadership with Commitment to Mixed Strategies.","authors":[],"date":"2004","doi":null,"raw":"19von Stengel, B., Zamir, S. (2004), Leadership with Commitment to Mixed Strategies. Research Report LSE-CDAM-2004-01, London School of Economics.","cites":null},{"id":17296499,"title":"Marktform und Gleichgewicht.","authors":[],"date":"1934","doi":"10.2307\/2549070","raw":"von Stackelberg, H. (1934), Marktform und Gleichgewicht. Springer, Vienna.","cites":null},{"id":17296486,"title":"Oligopoly and the Theory of Games.","authors":[],"date":"1977","doi":"10.1017\/cbo9780511571893","raw":"Friedman, J. W. (1977), Oligopoly and the Theory of Games. North-Holland, Amsterdam.","cites":null},{"id":17296496,"title":"Perfect equilibrium in a bargaining model.","authors":[],"date":"1982","doi":"10.2307\/1912531","raw":"Rubinstein, A. (1982), Perfect equilibrium in a bargaining model. Econometrica 50, 97–109.","cites":null},{"id":17296485,"title":"Recherches sur les Principes Math´ ematiques de la Th´ eorie des Richesses.","authors":[],"date":null,"doi":"10.1017\/cbo9780511528231.006","raw":"Cournot, A. A. (1838), Recherches sur les Principes Math´ ematiques de la Th´ eorie des Richesses. Hachette, Paris.","cites":null},{"id":17296495,"title":"Reinterpreting mixed strategy equilibria: A uniﬁcation of the classical and Bayesian views.","authors":[],"date":"2004","doi":"10.1016\/j.geb.2003.09.009","raw":"Reny, P. J., Robson, A. J. (2004), Reinterpreting mixed strategy equilibria: A uniﬁcation of the classical and Bayesian views. Games and Economic Behavior 48, 355–384.","cites":null},{"id":17296493,"title":"Stackelberg problems: Subgame perfect equilibria via Tikhonov regularization. In: Advances","authors":[],"date":"2006","doi":"10.1007\/0-8176-4501-2_12","raw":"Morgan, J., Patrone, F. (2006), Stackelberg problems: Subgame perfect equilibria via Tikhonov regularization. In: Advances in Dynamic Games, eds. A. Haurie et al., Annals of the International Society of Dynamic Games, Vol. 8, Birkh¨ auser, Boston, 209–221. Moulin,H.,Vial,J.-P.(1978),Strategicallyzero-sumgames:Theclassofgameswhosecompletely mixed equilibria cannot be improved upon. International Journal of Game Theory 7, 201– 221.","cites":null},{"id":17296469,"title":"Stackelberg versus Cournot equilibrium.","authors":[],"date":"1999","doi":"10.1006\/game.1998.0650","raw":"18Amir, R., Grilo, I. (1999), Stackelberg versus Cournot equilibrium. Games and Economic Behavior 26, 1–21.","cites":null},{"id":17296506,"title":"Strategic Learning and its Limits.","authors":[],"date":"2004","doi":"10.1093\/acprof:oso\/9780199269181.001.0001","raw":"Young, H. P. (2004), Strategic Learning and its Limits. Oxford University Press, Oxford.","cites":null},{"id":17296470,"title":"Subjectivity and correlation in randomized strategies.","authors":[],"date":"1974","doi":"10.1016\/0304-4068(74)90037-8","raw":"Aumann, R. J. (1974), Subjectivity and correlation in randomized strategies. Journal of Mathematical Economics 1, 67–96.","cites":null},{"id":17296502,"title":"Team-maxmin equilibria.","authors":[],"date":"1997","doi":"10.1006\/game.1997.0527","raw":"von Stengel, B., Koller, D. (1997), Team-maxmin equilibria. Games and Economic Behavior 21, 309–321.","cites":null},{"id":17296497,"title":"The Strategy of Conﬂict.","authors":[],"date":"1960","doi":"10.1126\/science.132.3418.28","raw":"Schelling, T. C. (1960), The Strategy of Conﬂict. Harvard Univ. Press, Cambridge, Mass.","cites":null},{"id":17296498,"title":"Theories of oligopoly behavior.","authors":[],"date":"1989","doi":"10.1016\/s1573-448x(89)01009-5","raw":"Shapiro, C. (1989), Theories of oligopoly behavior. In: Handbook of Industrial Organization, Vol. I, eds. R. Schmalensee and R. D. Willig, North-Holland, Amsterdam, 329–414.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-07","abstract":"A basic model of commitment is to convert a two-player game in strategic form to a “leadership game” with the same payoffs, where one player, the leader, commits to a strategy, to which the second player always chooses a best reply. This paper studies such leadership games for games with convex strategy sets. We apply them to mixed extensions of finite games, which we analyze completely, including nongeneric games. The main result is that leadership is advantageous in the sense that, as a set, the leader's payoffs in equilibrium are at least as high as his Nash and correlated equilibrium payoffs in the simultaneous game. We also consider leadership games with three or more players, where most conclusions no longer hold","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/214535.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/27653\/1\/leadership_games_%28LSERO_version%29.pdf","pdfHashValue":"1232d695cd48cbecec0e5aebfe7e1fa0d7b9d33e","publisher":"Academic Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:27653<\/identifier><datestamp>\n      2017-05-04T09:35:29Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4D41<\/setSpec><setSpec>\n      74797065733D434F4C4C53:4C53455F435F454F<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/27653\/<\/dc:relation><dc:title>\n        Leadership games with convex strategy sets<\/dc:title><dc:creator>\n        von Stengel, Bernhard<\/dc:creator><dc:creator>\n        Zamir, Shmuel<\/dc:creator><dc:subject>\n        HB Economic Theory<\/dc:subject><dc:subject>\n        QA Mathematics<\/dc:subject><dc:description>\n        A basic model of commitment is to convert a two-player game in strategic form to a “leadership game” with the same payoffs, where one player, the leader, commits to a strategy, to which the second player always chooses a best reply. This paper studies such leadership games for games with convex strategy sets. We apply them to mixed extensions of finite games, which we analyze completely, including nongeneric games. The main result is that leadership is advantageous in the sense that, as a set, the leader's payoffs in equilibrium are at least as high as his Nash and correlated equilibrium payoffs in the simultaneous game. We also consider leadership games with three or more players, where most conclusions no longer hold.<\/dc:description><dc:publisher>\n        Academic Press<\/dc:publisher><dc:date>\n        2010-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/27653\/1\/leadership_games_%28LSERO_version%29.pdf<\/dc:identifier><dc:identifier>\n          von Stengel, Bernhard and Zamir, Shmuel  (2010) Leadership games with convex strategy sets.  Games and Economic Behavior, 69 (2).  pp. 446-457.  ISSN 0899-8256     <\/dc:identifier><dc:relation>\n        http:\/\/www.elsevier.com\/wps\/find\/journaldescription.cws_home\/622836\/description#description<\/dc:relation><dc:relation>\n        10.1016\/j.geb.2009.11.008<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/27653\/","http:\/\/www.elsevier.com\/wps\/find\/journaldescription.cws_home\/622836\/description#description","10.1016\/j.geb.2009.11.008"],"year":2010,"topics":["HB Economic Theory","QA Mathematics"],"subject":["Article","PeerReviewed"],"fullText":"  \nBernhard von Stengel and Shmuel Zamir \nLeadership games with convex strategy \nsets \n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nvon Stengel, Bernhard and Zamir, Shmuel (2010) Leadership games with convex strategy sets. \nGames and economic behavior, 69 (2). pp. 446-457. ISSN 0899-8256  \n \nDOI: 10.1016\/j.geb.2009.11.008 \n \n© 2009 Elsevier Inc.\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/27653\/\n \nAvailable in LSE Research Online: August 2010 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \nLeadership Games with Convex Strategy Sets∗\nBernhard von Stengel\nDepartment of Mathematics, London School of Economics,\nHoughton St, London WC2A 2AE, United Kingdom\nemail: stengel@maths.lse.ac.uk\nShmuel Zamir\nCenter for the Study of Rationality, The Hebrew University at Jerusalem,\nGivat Ram, Jerusalem 91904, Israel\nemail: zamir@math.huji.ac.il\nGames and Economic Behavior 69 (2010), 446–457.\nAbstract\nA basic model of commitment is to convert a two-player game in strategic form\nto a “leadership game” with the same payoffs, where one player, the leader, commits\nto a strategy, to which the second player always chooses a best reply. This paper\nstudies such leadership games for games with convex strategy sets. We apply them\nto mixed extensions of finite games, which we analyze completely, including non-\ngeneric games. The main result is that leadership is advantageous in the sense that,\nas a set, the leader’s payoffs in equilibrium are at least as high as his Nash and cor-\nrelated equilibrium payoffs in the simultaneous game. We also consider leadership\ngames with three or more players, where most conclusions no longer hold.\nKeywords: Commitment, correlated equilibrium, first-mover advantage, follower,\nleader, Stackelberg game.\nJEL Classification Number: C72\n∗Support by a STICERD Distinguished Visitorship for Shmuel Zamir to visit the London School of\nEconomics is gratefully acknowledged. We thank Jacqueline Morgan for comments on dynamic games,\na referee for suggesting the proof of Theorem 2, and another referee and the associate editor for helpful\ncomments.\n1\n1 Introduction\nThe possible advantage of commitment power is a game-theoretic result known to the gen-\neral public, ever since its popularization by Schelling (1960). Cournot’s (1838) duopoly\nmodel of quantity competition was modified by von Stackelberg (1934), who demon-\nstrated that a firm with the power to commit to a quantity of production profits from this\nleadership position. The leader-follower issue has been studied in depth in oligopoly the-\nory as “Stackelberg leadership”; see Friedman (1977), Hamilton and Slutsky (1990) and\nthe correction to that paper by Amir (1995), Shapiro (1989), or Amir and Grilo (1999) for\ndiscussions and references.\nWe define a leadership game as follows (for details see Section 2). Consider a game of\nk+1 players in strategic form. Declare one player as leader and let his strategy set be X .\nThe remaining k players are called followers. Let the set of their partial strategy profiles\n(with k strategies) be Y , so that X ×Y is the set of full strategy profiles. The leadership\ngame is the extensive game where the leader chooses x in X , the followers are informed\nabout x and choose simultaneously their strategies as f (x) in Y , and all players receive\ntheir payoffs as given by the strategy profile (x, f (x)). We only consider subgame perfect\nequilibria of the leadership game where for any x the followers play among themselves a\nNash equilibrium f (x) in the game induced by x, even off the equilibrium path. We call\nf (x) the response of the followers to x, which is simply a best reply in the original game\nif there is only one follower. (The set of equilibria that are not subgame perfect seems too\nlarge to allow any interesting conclusions.)\nOur aim is to analyze completely leadership games for the mixed extension of a bi-\nmatrix game, that is, of a finite two-player game in strategic form. Then there is only one\nfollower (k = 1). The leader commits to a mixed strategy x in the bimatrix game. The\nfollower’s response f (x) is also a mixed strategy. The pair of pure actions is then chosen\nindependently according to x and f (x) with the corresponding bimatrix game payoffs, and\nthe players maximize expected payoffs as normally.\nThe payoff to the leader in a subgame perfect equilibrium of the leadership game\nis called a leader payoff . His payoff in a Nash equilibrium of the simultaneous game is\ncalled a Nash payoff . When considering the simultaneous game, we often have to identify\nthe player who becomes leader in the corresponding leadership game; for simplicity of\nidentification, we call this player also “leader” in the simultaneous game.\nFor the mixed extension of a bimatrix game, our main result (Corollary 8) states that\nthe set of leader payoffs is an interval [L,H] so that H ≥ E for all Nash payoffs E, and\nL≥ E for at least one Nash payoff E. Furthermore, Theorem 12 states that H ≥C for any\ncorrelated equilibrium payoff C to the leader. In this sense, the possibility to commit, by\nchanging a simultaneous game to a leadership game, never harms the leader. However,\nthis no longer holds for two or more followers, where leadership can be disadvantageous\n(see Remark 5).\nOne motivation to consider commitment to mixed strategies is the “classical view” of\nmixed strategies (see also Reny and Robson 2004). This is the view of von Neumann and\nMorgenstern (1947), who explicitly define the leadership game corresponding to a zero-\n2\nsum game, first with commitment to pure strategies (p. 100) and then to mixed strategies\n(p. 149), as a way of introducing the max-min and min-max value of the game. They\nconsider the leader to be a priori at an obvious disadvantage. By the minimax theorem,\na player is not harmed even if his opponent learns his optimal mixed strategy. Hence, in\ntwo-person zero-sum games, commitment to a mixed strategy does not hurt the leader, in\nline with Corollary 8. The value of a zero-sum game is its unique leadership and Nash\npayoff.\nImportant applications of commitment to mixed strategies are inspection games. They\nmodel inspections for arms control treaties, tax auditing, or monitoring traffic violations;\nfor a survey see Avenhaus, von Stengel, and Zamir (2002). With costly inspections, such\ngames typically have unique mixed equilibria, and in the corresponding leadership games,\nthe inspector is a natural leader. As observed by Maschler (1966), commitment helps\nthe leader because the follower, who is inspected, acts legally in an equilibrium of the\nleadership game, but acts illegally with positive probability in the Nash equilibrium of the\nsimultaneous game.\nThe central observation about leadership games for mixed extensions of bimatrix\ngames is the following. When the leader commits to his mixed strategy in equilibrium, the\nfollower is typically indifferent between several pure best replies. However, the condition\nof subgame perfection implies that on the equilibrium path, the follower chooses the reply\nthat gives the best possible payoff to the leader; otherwise, the leader could improve his\npayoff by changing his commitment slightly so that the desired reply is unique (which is\npossible generically).\nFor inspection games, this reasoning based on subgame perfection was used by Aven-\nhaus, Okada, and Zamir (1991). Maschler (1966) still postulated a benevolent reaction of\nthe follower when she is indifferent (and called this behavior “pareto-optimal”), or else\nsuggested to look in effect at an ε-equilibrium in which the leader sacrifices an arbitrar-\nily small amount to induce the desired reaction of the follower. A similar observation\nis known for bargaining games, for example in the iterated offers model of Rubinstein\n(1982). In a subgame perfect equilibrium of this game, the first player makes the second\nplayer indifferent between accepting or rejecting the offer, but the second player never-\ntheless accepts.\nSome of our results apply to more general games than mixed extensions of bimatrix\ngames. In particular, we are indebted to a referee who suggested a short proof of Corol-\nlary 8 based on Kakutani’s fixed point theorem. Different parts of Corollary 8 hold under\nassumptions that can be weakened to varying extent. We therefore present these parts\nseparately, as follows.\nIn Section 2, we give a characterization in Theorem 1 of the lowest leader payoff, us-\ning standard assumptions so that Kakutani’s fixed point theorem can be applied, for games\nwith any number of followers. Suppose that they always choose their response to give the\nworst possible payoff to the leader. In other words, the leader maximizes his payoff under\nthe “pessimistic” view that the followers act to his disadvantage. (This pessimistic view is\nalso used to the define a “Stackelberg payoff” to the leader in dynamic games; see Bas¸ar\nand Olsder 1982, equation (41) on p. 136, and p. 141.) The resulting payoff function to\n3\nthe leader is typically discontinuous and has no maximum (see also Morgan and Patrone\n(2006) and references). However, the supremum of the “pessimistically” computed pay-\noff to the leader is obtained in a subgame perfect equilibrium of the leadership game, as\nwe show in Theorem 1. Subgame perfection implies that on the equilibrium path, the\nfollowers’ response is not according to the pessimistic assumption but instead yields the\nsupremum payoff to the leader.\nIn Section 3, we observe in Theorem 2 that the lowest leader payoff is no worse than\nthe lowest Nash payoff. This theorem requires strong assumptions that hold for mixed\nextensions of bimatrix games (Corollary 3), but not, for example, for mixed extensions of\nthree-player games (Remark 5). Furthermore, the highest leader payoff is obtained when\nthe followers always reply in the best possible way for the leader. It is easy to see that\nthis payoff is at least as high as any Nash payoff. Moreover, if the set of the followers’\nresponses is connected, then the set of leader payoffs is an interval (Proposition 7).\nIn Section 4, we consider mixed extensions of bimatrix games. We explicitly char-\nacterize the lowest and highest leader payoffs and show how to compute them by linear\nprogramming. For generic games, they are equal.\nIn Section 5, we show that the highest leader payoff H is at least as high as any\ncorrelated equilibrium payoff to the leader. This is no longer true for the coarse correlated\nequilibrium due to Moulin and Vial (1978) that involves commitment by both players,\nwhich may give a higher payoff than H.\n2 The lowest leader payoff\nOur main results concern finite two-player games with commitment to mixed strategies.\nWe regard such games via their mixed extension, where each mixed-strategy simplex\nbecomes a set of new pure strategies. Some of our results hold more generally for any\nfinite number of players with convex and compact strategy sets.\nFor the general case, we consider a game with finite player set N. Each player i∈N has\na convex and compact strategy set Si, and a continuous payoff function ui : ∏i∈N Si → R.\nLet S−i = ∏ j∈N−{i} S j. For sets X ,Y , the set of correspondences (set-valued mappings)\nX → 2Y is denoted by X ³ Y . Player i’s best-reply correspondence Bi : S−i ³ Si is given\nby\nBi(s−i) = argmax\nsi∈Si\nui(si,s−i), (1)\nwhere argmax gives the set of all maximizers. Suppose each player’s best-reply cor-\nrespondence is convex-valued and upper hemi-continuous (uhc), that is, it has a closed\ngraph\n⋃\ns−i∈S−i{s−i}×Bi(s−i). Then by the fixed point theorem of Kakutani (1941), there\nis a fixed point (si)i∈N with si ∈ Bi(s−i) for all i ∈ N. This is an equilibrium of the game\nwhere each player i plays a best reply si to the remaining strategies s−i. These conditions\nhold for the mixed extension of a finite game where Si is player i’s mixed strategy simplex\nand ui is his expected payoff function (Nash 1950).\n4\nConsider such a game with player set N = {1,2, . . . ,k+1}. The corresponding lead-\nership game is a two-stage game played as follows. Player 1 is called leader, and the k\nplayers 2, . . . ,k+1 are called followers. First, the leader chooses and commits to a strat-\negy s1 in S1, which is announced to all followers, who then simultaneously choose their\nstrategies s2, . . . ,sk+1, which are played together with s1. The players’ payoffs for the\nstrategy profile (s1, . . . ,sk+1) are as in the original game.\nFor convenience, we write X = S1, and let Y = S−1 be the set of partial strategy\nprofiles y = (s2, . . . ,sk+1) of the followers. For any strategy profile (x,y) ∈ X×Y , denote\nthe payoff to the leader by a(x,y) = u1(x,y). In the leadership game, y may depend on x,\nso a strategy profile in the leadership game is given by (x, f ) where x ∈ X and f : X → Y .\nWe consider only subgame perfect equilibria of leadership games. In such a subgame\nperfect equilibrium (x∗, f ∗), the followers’ response given by f ∗(x) in Y is a Nash equi-\nlibrium of the game induced by x, for any x in X . Moreover, the leader’s commitment x∗ is\noptimal, so a(x∗, f ∗(x∗))≥ a(x, f ∗(x)) for all x ∈ X . A leader payoff is the corresponding\npayoff a(x∗, f ∗(x∗)).\nFor x in X , let the subset E(x) of Y be the set of Nash equilibria of the game induced\nby x, which is nonempty by Kakutani’s theorem. Also, E(x) is the intersection of the fol-\nlowers’ best reply correspondences and therefore closed. When there is only one follower\n(k = 1), then E(x) is simply B2(x).\nWe define a new correspondence F : X ³ Y which expresses a “pessimistic” view of\nthe leader. The correspondence F is the sub-correspondence of E where the followers’\nresponse is the worst possible for the leader,\nF(x) = argmin\ny∈E(x)\na(x,y), (2)\nso F(x) is the set of all y in E(x) that minimize a(x,y). If k = 1, then F(x) contains the\nfollower’s best replies y to x that minimize the payoff to the leader.\n@\n@\n1\n2\nT\nB\na b c d e\n2 6 9 1 7\n4 4 0 2 4\n8 0 3 1 0\n4 4 6 5 0\nFigure 1 Example of a 2×5 game. In each cell, the payoffs to player 1 and 2 are shown\nin the bottom left and top right corner, respectively.\nWe illustrate our considerations with an example, shown in Figure 1, which will be\nused throughout the paper. We consider the mixed extension of this 2× 5 game, with\nplayer 2 as the only follower. The set X of mixed strategies of player 1 can be identified\nwith the interval [0,1] for the probability that player 1 plays strategy B.\n5\n(a)\n(b)\nprob(B)\n4\n55\n4\n3\n2\n1\n0\n6\nprob(B)\n5\n4\n3\n2\n1\n0\n8\n6\n7\n8\n9\n3\n1\n6\n0 1\n10 2\/3\n2\/3\n5\npayoff to player 2\npayoff to player 1\n1\/3\nba\nc\nd\ne\nd\ne\nc\nba\nFigure 2 (a) Expected payoffs to player 2, (b) expected payoffs to player 1, as functions\nof player 1’s mixed strategy, in the game of Figure 1. The bold line in (b),\nincluding the full dot at 2\/3, indicates the “pessimistic” leader payoff resulting\nfrom any reply in F(x) as in (3).\nFigure 2 shows the expected payoffs to the two players as a function of the mixed\nstrategy of player 1. The top graph (a) shows the expected payoffs to player 2, from\nwhich one can see that the pure best replies of player 2 are\na,b,e when prob(B) = 0,\na,b when 0 < prob(B)< 2\/3,\na,b,c,d when prob(B) = 2\/3,\nc when prob(B)> 2\/3.\nFor each of the pure strategies a, b, c, d, e chosen by player 2, the bottom graph (b) in\nFigure 2 shows the expected payoff to player 1 as a function of his mixed strategy x. The\n6\ncorrespondence F(x) in (2) chooses any best reply of player 2 that minimizes player 1’s\npayoff and is given by\na when prob(B)< 1\/3,\nany mixture of a,b when prob(B) = 1\/3,\nb when 1\/3 < prob(B)< 2\/3,\nd when prob(B) = 2\/3,\nc when prob(B)> 2\/3.\n(3)\nThe graph of the payoffs to player 1 when player 2 plays according to F is shown in\nFigure 2(b) with bold lines and the filled-in dot when prob(B) = 2\/3 where F(x) = {d}.\nAs this example shows, the graph of F is in general not closed so that F is not uhc.\nThe uhc correspondence F is defined via the closure of the graph of F , that is, for all\n(x,y) ∈ X ×Y ,\ny ∈ F(x) ⇐⇒ (x,y) ∈\n⋃\nx′∈X\n{x′}×F(x′). (4)\nIn the example, in order to obtain the uhc correspondence F from F according to (4), we\nhave to add the best replies b and c when prob(B) = 2\/3. The resulting payoffs to player 1\nare 2 for b and 5 for c, shown as the two white dots at the ends of the bold lines for b and c\nin Figure 2(b).\nIn the general setup, we define the following payoff to the leader:\nL = sup\nx∈X\nmin\ny∈E(x)\na(x,y). (5)\nBy (2) and (5), the payoff L is the supremum of a(x,y) for x ∈ X and y ∈ F(x). In Fig-\nure 2(b), it is given by L = 5 when prob(B) approaches 2\/3 from above, where player 2’s\nbest reply is c. However, this supremum is not achieved, because for prob(B) = 2\/3 the\nonly best reply in F(x) is d with payoff 1 to player 1.\nNevertheless, there is a leader payoff 5 where the leader commits to prob(B) = 2\/3\nand the follower chooses c, because c is a best reply to the commitment. Moreover,\nthere is no leadership equilibrium with payoff less than 5. Suppose that there is such an\nequilibrium with leader payoff 5−ε for some ε > 0. If the leader plays prob(B) = 2\/3+δ\nfor δ > 0, the only best reply of the follower is c, with payoff higher than 5− ε for\nsufficiently small δ . So the leader can profitably deviate. Hence, this is not an equilibrium.\nThe following central theorem of this section states that the lowest leader payoff is\ngiven by (5). Its proof generalizes the argument made for the preceding example.\nTheorem 1 The payoff L in (5) is the lowest leader payoff.\nProof. We have to prove that there is a leadership equilibrium with payoff L to the leader,\nand that there is no lower leader payoff.\nFirst, observe that by (2) which defines F , the payoff a(x,y) is a constant function of\ny on F(x), so that\nL = sup\nx∈X\nmax\ny∈F(x)\na(x,y). (6)\n7\nWe claim that\nL = max\nx∈X\nmax\ny∈F(x)\na(x,y). (7)\nNote that the first “max” in (7) does not have to be written as “sup” because F is uhc. Also,\nwhile a(x,y) is constant in y on F(x), it is no longer constant on F(x), so it may happen\nthat maxy∈F(x) a(x,y)> maxy∈F(x) a(x,y), as the example for prob(B) = 2\/3 shows.\nTo prove (7), let\nL = max\nx∈X\nmax\ny∈F(x)\na(x,y) = a(x∗,y∗)\nfor some x∗ ∈ X and y∗ ∈ F(x∗). Clearly, L ≤ L. Consider some sequence (xn,yn) that\nconverges to (x∗,y∗) with yn ∈ F(xn) for all n. Then L ≥ a(xn,yn) by (6) and, because a\nis continuous, L≥ a(x∗,y∗), which proves (7).\nNext, we show that there is a leadership equilibrium (x∗, f ∗) with L = a(x∗,y∗) as\nleader payoff. The correspondence E : X ³ Y is uhc because its graph is the intersection\nof the graphs of the followers’ best reply correspondences in the original game (as subsets\nof X ×Y ), so the graph of E is closed. Because F ⊆ E (in terms of the graphs of the\ncorrespondences), we therefore have\nF ⊆ E. (8)\nThe leadership equilibrium is given by f ∗(x∗) = y∗ and f ∗(x) in F(x) chosen arbitrarily\nfor any x 6= x∗. This defines a subgame perfect equilibrium because f ∗(x) ∈ F(x)⊆ E(x)\nfor all x, and because L = a(x∗,y∗) by (7).\nFinally, we claim there is no leadership equilibrium (xˆ, f ) with leader payoff less\nthan L. Suppose otherwise, that is, a(xˆ, f (xˆ)) = L− ε with ε > 0. Consider the above\nsequence (xn,yn) that converges to (x∗,y∗), and choose n large enough so that a(xn,yn)>\na(x∗,y∗)−ε . Then if player 1 commits to xn, he will get a payoff a(xn, f (xn))≥ a(xn,yn)>\nL−ε because a(xn,yn) ∈ F(xn), so he can improve his payoff by deviating from his com-\nmitment xˆ, which is a contradiction. So L is the lowest leader payoff.\n3 Leader payoff versus Nash payoff\nIn this section, we compare the leader payoffs with the Nash payoffs to the leader in\nthe simultaneous game. The following result states that the lowest leader payoff L is at\nleast as high as some Nash payoff in the simultaneous game; its proof is inspired by a\nsuggestion of a referee. Recall that E(x) is the set of Nash equilibria of the game among\nthe followers induced by x.\nTheorem 2 Suppose that\n(a) E(x) is convex for all x in X,\n(b) a(x,y) is a convex function of y on the convex domain E(x).\n8\nThen the lowest leader payoff L in (5) is at least as high as some Nash payoff to the leader\nin the simultaneous game.\nProof. Player 1’s best-reply correspondence B1 : Y ³ X is uhc and convex-valued. Let\nconv F(x) be the convex hull of F(x) for all x ∈ X , where F is the uhc correspondence\ndefined by (4). Consider the correspondence (x,y) 7→ B1(y)× conv F(x). By Kakutani’s\ntheorem, it has a fixed point (xˆ, yˆ) ∈ X ×Y , that is, xˆ ∈ B1(yˆ) and yˆ ∈ conv F(xˆ). Because\nE(xˆ) is convex by assumption (a) and F(xˆ) ⊆ E(xˆ) by (8), it follows that yˆ ∈ E(xˆ), so\n(xˆ, yˆ) is a Nash equilibrium of the simultaneous game.\nFurthermore, yˆ=∑ki=1 λiyi for some points y1, . . . ,yk in F(xˆ) and nonnegative weights\nλ1, . . . ,λk with ∑ki=1 λi = 1. Then, since a(x,y) is convex in y by assumption (b),\na(xˆ, yˆ)≤\nk\n∑\ni=1\nλia(xˆ,yi)≤ max\ny∈F(xˆ)\na(xˆ,y)≤max\nx∈X\nmax\ny∈F(x)\na(x,y) = L\nby (7).\nAssumptions (a) and (b) of Theorem 2 are not required for Theorem 1. They are\ntrivially satisfied for the mixed extension of a bimatrix game:\nCorollary 3 For the mixed extension of a bimatrix game, the lowest leader payoff L is at\nleast as high as some Nash payoff to the leader in the simultaneous game.\nProof. Assumption (a) of Theorem 2 holds because for one follower E = B2 and the best-\nreply correspondence B2 is convex-valued. Assumption (b) holds because the expected\npayoff a(x,y) is linear in y.\nAnother case in which (a) and (b) are trivially satisfied is when E(x) is always a\nsingleton. For example, in a two-player Cournot game, the follower’s best reply is often\nunique. The following remark shows that Theorem 2 can fail without condition (b).\nRemark 4 There is a two-player game with continuous payoffs and convex-valued best-\nreply correspondences so that E(x) is convex for all x, but L is less than any Nash payoff.\nProof. Suppose that the strategy sets of the two players are X = Y = [−1,1], that the\npayoff to player 2 is constant (so any y is a best reply), and that the payoff to player 1 is\na(x,y) = xy− y2. Both players’ payoffs are linear in their own strategy variable, so the\nbest-reply correspondences are convex-valued. We have E(x) = Y for all x, but a(x,y) is\nnot convex in y.\nFor any y ∈ [−1,1], we have a Nash equilibrium (x,y) if x is a best reply to y, that is,\nx = −1 if y < 0, arbitrary x for y = 0, and x = 1 for y > 0. The resulting Nash payoff to\nplayer 1 is |y|− y2 which is |y|(1−|y|) and therefore always nonnegative.\nThe lowest leader payoff, however, results from player 2 always choosing the worst\naction for player 1 (which player 1 cannot force to be to his liking because player 2 is\n9\nindifferent). This worst reply y, which defines F(x), is y = 1 if x < 0, it is y ∈ {1,−1}\nif x = 0, and y = −1 if x > 0, so that the resulting payoff is x− 1 if x ≤ 0 and −x− 1 if\nx ≥ 0, that is, −1−|x|, which is always negative. The best possible case is x = 0 where\nthe leader payoff is −1, worse than any Nash payoff.\nIn the example in Remark 4, player 2 has a constant payoff, so the leadership game\nwhere the follower chooses the worst payoff to the leader is effectively a zero-sum with\npayoff xy− y2 to the leader. In this game, the max-min value is less than the min-max\nvalue. Hence, leadership is disadvantageous compared to playing simultaneously.\nA similar situation arises in mixed extensions of games with more than two players.\nAn example are team games as investigated by von Stengel and Koller (1997), where k\nplayers form a team and receive identical payoffs, which are the negative of the payoffs\nto player 1. Here, commitment generally hurts player 1 since it allows the opposing team\nplayers to coordinate their actions, which is not the case in the simultaneous game.\nRemark 5 There is a mixed extension of a finite three-player game so that L in (5) is less\nthan any Nash payoff.\n@\n@\n2\n3\nP\nQ\np q\n−1,1,1 0,0,0\n0,0,0 −4,4,4\nl1 :\n@\n@\n2\n3\nP\nQ\np q\n−4,4,4 0,0,0\n0,0,0 −1,1,1\nr\nFigure 3 Game between player 1 against the team of player 2 and 3 which has leader\npayoffs that are worse than any Nash payoff.\nProof. Consider Figure 3. Player 1 chooses the left (l) or right (r) panel, and play-\ners 2 and 3 form the team and have two strategies each. The Nash equilibria in this\ngame are the pure equilibria (l,P, p) and (r,Q,q), both with payoffs (−1,1,1), the semi-\nmixed equilibria (l,(0.8,0.2),(0.8,0.2)) and (r,(0.2,0.8),(0.2,0.8)), both with payoffs\n(−0.8,0.8,0.8), and the completely mixed equilibrium ((0.5,0.5),(0.5,0.5),(0.5,0.5))\nwith payoffs (−1.25,1.25,1.25).\nSuppose that the leader commits to the mixed strategy (1− x,x) in the leadership\ngame. In the correspondence F in (2), players 2 and 3 can coordinate to play their favor-\nable response, namely (Q,q) with payoffs (3x−4,4−3x,4−3x) if 0≤ x≤ 0.5 and (P, p)\nwith payoffs (−1−3x,1+3x,1+3x) if 0.5< x≤ 1 (for x= 0.5 the choice between (Q,q)\nand (P, p) is arbitrary). The optimal commitment is then x = 0.5. This defines a subgame\nperfect equilibrium with leader payoff L = −2.5, which is much worse for player 1 than\nin any Nash equilibrium of the simultaneous game.\n10\nIn addition to Remark 5, note that the highest leader payoff in the game in Figure 3\nis −0.8, which results when the leader commits to either l or r and the followers respond\nby playing the mixed equilibrium in the corresponding panel in Figure 3. Because this\ndefines also a Nash equilibrium, the highest leader payoff is not higher than the highest\nNash payoff.\nThe game in Figure 3 is nongeneric. However, the same arguments apply for any other\ngeneric game with payoffs nearby.\nOur next observation concerns the highest leader payoff, for any number of followers\nand our standard assumptions from Section 2.\nProposition 6 Let\nH = max\nx∈X\nmax\ny∈E(x)\na(x,y). (9)\nThen H is the highest leader payoff, and H ≥ a(x∗,y∗) for any Nash equilibrium (x∗,y∗)\nof the simultaneous game.\nProof. Clearly, y∗ ∈ E(x∗), which implies\nH ≥ max\ny∈E(x∗)\na(x∗,y)≥ a(x∗,y∗).\nNext, we note that under certain assumptions the set of leader payoffs is an interval\n[L,H].\nProposition 7 Suppose that E(x) is connected for all x in X. Then any payoff in [L,H]\nwith L and H as in (5) and (9) is a possible leader payoff.\nProof. Let\nxˆ ∈ argmax\nx∈X\nmax\ny∈E(x)\na(x,y),\nso that H = maxy∈E(xˆ) a(xˆ,y). Clearly,\nmin\ny∈E(xˆ)\na(xˆ,y)≤ sup\nx∈X\nmin\ny∈E(x)\na(x,y) = L,\nso let yˆ ∈ E(xˆ) with a(xˆ, yˆ) ≤ L. Because E(xˆ) is connected, and a(xˆ,y) is continuous\nin y, the set {a(xˆ,y) | y ∈ E(xˆ)} contains all reals in [a(xˆ, yˆ),H] and hence in [L,H]. Any\na(xˆ,y) ∈ [L,H] is a leader payoff in the subgame perfect equilibrium (xˆ, f ) where the\nfollowers’ response is f (xˆ) = y and f (x) ∈ F(x) as in (2) for x 6= xˆ.\nThe following corollary summarizes our main results for mixed extensions of bimatrix\ngames. An explicit characterization of L and H is given in the next section.\nCorollary 8 For the mixed extension of a bimatrix game, the set of leader payoffs is an\ninterval [L,H] with L and H as in (5) and (9). If l and h are the lowest and highest Nash\npayoff to the leader in the simultaneous game, then l ≤ L and h≤ H.\nProof. The set E(x) is the set of mixed strategies of player 2 that are best replies to x,\nwhich is connected, so Proposition 7 applies.\n11\n4 Leadership in mixed extensions of bimatrix games\nIn this section, we consider the mixed extension of a bimatrix game. We explicitly char-\nacterize the lowest and highest leader payoff L and H in Corollary 8 and show how to\ncompute them by linear programming. For generic bimatrix games, we show that L = H.\nWe consider a bimatrix game with m×n matrices A and B of payoffs to player 1 and 2,\nrespectively. The players’ sets of pure strategies are\nM = {1, . . . ,m}, N = {1, . . . ,n}.\nTheir sets of mixed strategies are denoted by X and Y . For mixed strategies x and y, we\nwant to write expected payoffs as matrix products xAy and xBy, so that x should be a row\nvector and y a column vector. That is,\nX = {(x1, . . . ,xm) | ∀i ∈M xi ≥ 0, ∑\ni∈M\nxi = 1 }\nand\nY = {(y1, . . . ,yn)> | ∀ j ∈ N y j ≥ 0, ∑\nj∈N\ny j = 1 }\nAs elements of X , the pure strategies of player 1 are the unit vectors, which we denote by\nei for i ∈M.\nFor any pure strategy j of player 2, the payoffs to both players depending on x ∈ X\nwill be of interest. We denote the columns of the matrix A by A j and those of B by B j,\nA = [A1 · · ·An], B = [B1 · · ·Bn]. (10)\nAn inequality between two vectors, for example B j < By for some j ∈N and y∈Y (which\nstates that the pure strategy j is strictly dominated by the mixed strategy y), is understood\nto hold in each component.\nFor j in N, we denote by X( j) the best reply region of j. This is set of those x in X to\nwhich j is a best reply:\nX( j) = {x ∈ X | ∀k ∈ N−{ j} xB j ≥ xBk }. (11)\nLet X◦( j) denote the interior of X( j) relative to X . Call X( j) full-dimensional if X◦( j)\nis not empty. Any best reply region X( j) is a closed convex polytope. If it is full-\ndimensional, then\nX◦( j) = X( j). (12)\nBecause any x in X has at least one best reply j, we also have\nX =\n⋃\nj∈N\nX( j). (13)\nIn the example in Figure 1, we can identify X with the interval [0,1] for the probability\nthat player 1 plays the bottom row B. Then Figure 2(a) shows that the best reply region of\ncolumns a and b is [0,2\/3], of c is [2\/3,1], of d is {2\/3} and of e is {0}. The best reply\nregions of d and e are not full-dimensional.\n12\nTheorem 9 Consider the mixed extension of a bimatrix game (A,B) with A j,B j as in (10)\nand X( j) as in (11), for j ∈ N. Let D = { j ∈ N | X( j) is full-dimensional}. Then the\ninterval [L,H] of all leader payoffs in Corollary 8 is given by\nL = max\nj∈D\nmax\nx∈X( j)\nmin\nk∈N :Bk=B j\nxAk , H = max\nj∈N\nmax\nx∈X( j)\nxA j . (14)\nWe shall first explain Theorem 9 with our example, discuss the easy parts of its proof,\nand give the full proof afterwards. First consider H in (14). If the leader chooses x in X( j),\nthen the follower can respond with a mixed strategy that assigns positive probability to j,\nin particular the pure strategy j itself. Then xA j is the expected payoff to the leader. The\nhighest payoff to the leader is certainly attained with a pure strategy of the follower, and\nthe expression for H in (14) is the highest leader payoff. In the example, Figure 2(b)\nshows that H = 7 where the leader commits to prob(B) = 0 and the follower responds\nwith e.\nThe characterization of L in (14) is more involved. It states that for the lowest leader\npayoff L, best reply regions that are not full-dimensional can be ignored. In the example,\nthis concerns both the best reply region of d which has a low payoff to the leader, and\nthe best reply region of e which has a high payoff. The full-dimensional regions of a\nand b are identical because their two payoff columns are identical, denoted by Bk = B j\nin (14), with k, j standing for the columns a,b. Similar to our comments after Remark 4,\nthe leader plays essentially a zero-sum game against the follower on regions X( j) with\nmultiple best replies of the follower, which leads to the inner max-min expression for L\nin (14). As Figure 2(b) shows, that max-min payoff for the region with best replies a,b is\n4 and attained when the leader commits to prob(B) = 1\/3, and for the best reply region\nof c that payoff is 5 and attained for prob(B) = 2\/3; this is the lowest leader payoff L.\nNote that the highest and lowest leader payoff are not obtained for the same commitment\nof the leader. However, it may happen that the same commitment is used, for example\nif strategy e was absent in this game, in which case H = 6 (shown as a small triangle in\nFigure 2(b)) where the leader commits to prob(B) = 2\/3 and the follower responds with a.\nProof of Theorem 9. In (9), E(x) is the set of best replies to x. Among them, the\nmaximum is already attained for the pure strategies j so that x ∈ X( j). Hence,\nH = max\nx∈X\nmax\ny∈E(x)\nxAy = max\nj∈N\nmax\nx∈X( j)\nxA j\nas claimed in (14).\nIt remains to prove the expression for L. First, we show\nX =\n⋃\nj∈D\nX( j). (15)\nTo see this, let k ∈ N−D, and consider the open set S = X −⋃ j∈N−{k}X( j). Then by\n(13), S is a subset of X(k) and hence of the set X◦(k), which is empty because k 6∈D, so S\nis empty. This shows X =\n⋃\nj∈N−{k}X( j) which we now use instead of (13), and continue\nin this manner for the elements of N−D other than k, to eventually obtain (15).\n13\nSecondly, for j,k ∈ N,\nx ∈ X◦( j) and x ∈ X(k) =⇒ Bk = B j. (16)\nTo see this, let x∈ X◦( j) and x∈X(k). For all i∈M consider the points zi = (1−ε)x+εei\nobtained by moving from x in the direction of the unit vectors ei. The points zi also\nbelong to X◦( j) for sufficiently small ε > 0. By representing x as a convex combination\nof z1, . . . ,zm, we prove that not only j but also k is a best reply to zi for each i∈M: Clearly,\nziB j ≥ ziBk. Suppose that ziB j > ziBk for some i. Then x= (x1, . . . ,xm) = x1z1+ · · ·+xmzm\nand xB j = x1z1B j + · · ·+ xmzmB j > xBk because xi > 0 (since x is in the interior of X), in\ncontradiction to x ∈ X(k). So ziB j = ziBk for all i ∈M, and of course xB j = xBk. That is,\n((1− ε)x+ εei)B j = ((1− ε)x+ εei)Bk, and therefore eiB j = eiBk, for all i ∈M. So the\ncolumn vectors B j and Bk agree in all components, as claimed.\nUsing (5), and the fact that minimum payoffs are already obtained among pure best\nreplies, and (15),\nL = sup\nx∈X\nmin\ny∈E(x)\nxAy = sup\nx∈X\nmin\nk∈N :x∈X(k)\nxAk = max\nj∈D\nsup\nx∈X( j)\nmin\nk∈N :x∈X(k)\nxAk . (17)\nChanging X( j) to the smaller set X◦( j) and using (16), we get\nL≥max\nj∈D\nsup\nx∈X◦( j)\nmin\nk∈N :x∈X(k)\nxAk = max\nj∈D\nsup\nx∈X◦( j)\nmin\nk∈N :Bk=B j\nxAk .\nGiven j, the function on the right is the minimum of a fixed finite set of linear functions\nand therefore continuous. By (12), we obtain\nL≥max\nj∈D\nsup\nx∈X◦( j)\nmin\nk∈N :Bk=B j\nxAk = max\nj∈D\nsup\nx∈X( j)\nmin\nk∈N :Bk=B j\nxAk\n≥max\nj∈D\nsup\nx∈X( j)\nmin\nk∈N :x∈X(k)\nxAk = L\nwhere the last inequality holds because the minimum is taken over a larger set of pure\nstrategies k; the last equation is just (17). So all inequalities hold as equalities, giving\nL = max\nj∈D\nsup\nx∈X( j)\nmin\nk∈N :Bk=B j\nxAk = max\nj∈D\nmax\nx∈X( j)\nmin\nk∈N :Bk=B j\nxAk\nas claimed in (14).\nNext, we show how to compute L and H in (14) by linear programming. In contrast\nto the problem of finding all Nash equilibria of the simultaneous game, the leadership\ngame is therefore easy to solve computationally. In addition, Corollary 8 provides quickly\ncomputable bounds on the Nash payoffs.\nThe computation of H in (14) is straightforward: For each j ∈ N, solve the linear\nprogram\nmax{xA j | x ∈ X( j)} (18)\nwhere X( j) is the polyhedral set in (11) defined by the constraints x≥ 0, ∑i∈M xi = 1, and\nxB j ≥ xBk for k 6= j. If these are infeasible, then X( j) is empty and j is never a best reply.\nThe maximum over j with nonempty X( j) of the values obtained in (18) is H.\nThe following proposition shows how to find L in (14).\n14\nProposition 10 The lowest leader payoff L in Theorem 9 is computed as follows:\n(a) For each j ∈ N, identify the set N j = {k ∈ N | Bk = B j}.\n(b) For each j ∈ N, we have j ∈D if and only if the following linear program has strictly\npositive value:\nmax{ε | x ∈ X , xB j ≥ xBk + ε (k ∈ N−N j) }. (19)\n(c) For each j ∈ D, the max-min expression for L in (14) is the value u j of the following\nlinear program:\nmax\nx∈X( j)\nmin\nk∈N j\nxAk = u j = max{u | xAk ≥ u (k ∈ N j), x ∈ X( j)} , (20)\ngiving L = max j∈D u j.\nProof. Finding N j as in (a) is trivial. According to (16), if X( j) has nonempty interior,\nthen any point x in X◦( j) has best reply k only if k ∈ N j, so (19) has a solution (ε∗,x∗)\nwith ε∗ > 0. Conversely, x∗B j > x∗Bk for k ∈ N−N j implies that these inequalities hold\nalso for any x in a neighborhood of x∗, that is, for some x ∈ X◦( j). This shows (b).\nIf j ∈ D and x ∈ X( j), then xAk ≥ u for all k ∈ N j is equivalent to mink∈N j xAk ≥ u,\nand the largest u subject to these inequalities is equal to mink∈N j xAk. Furthermore, the\nmaximum such u for all x∈X( j) equals u j in (20), which shows that L in (14) is max j∈D u j\nas claimed in (c).\nWe have proved that the lowest leader payoff L is at least as high as some Nash payoff\n(Theorem 2) with the help of Kakutani’s fixed point theorem. For the mixed extension of a\nbimatrix game, one can instead consider for each j in D the “constrained game” (Charnes\n1953) where player 1 chooses x in X( j) and player 2 mixes over the set N j, with zero-sum\npayoff columns Ak to player 1 for k ∈ N j. The respective min-max strategies for player 2,\nfor each j obtained as the solution to the dual linear program to (20), can be combined\nto give a Nash equilibrium with payoff at most L; for details see von Stengel and Zamir\n(2004, Theorem 11).\nMost of our observations simplify drastically for generic bimatrix games. Generically,\npayoff matrices do not have identical columns, and best reply regions are either empty or\nfull-dimensional. This is asserted in the following proposition. We use “generic” in the\nsense that any statement about the game holds also for any game with payoffs sufficiently\nnearby. For bimatrix games, an explicit alternative definition is nondegeneracy, which\nsays that no mixed strategy has more pure best replies than the size of its support (see von\nStengel, 2002); nondegeneracy is a generic property.\nProposition 11 For the mixed extension of a generic bimatrix game, the lowest and high-\nest leader payoff coincide, that is, L = H.\nProof. Consider a generic bimatrix game (A,B). Then clearly Bk 6= B j for any k 6= j\nand in Proposition 10 we have N j = { j} for j ∈ N. By (14), L = max j∈D maxx∈X( j) xA j.\n15\nWe claim that any best reply region X( j) is either empty or full-dimensional. To see\nthis, consider the optimal value ε∗ of the linear program in (19). If ε∗ > 0, then X( j)\nis full-dimensional (so j ∈ D), and if ε∗ < 0, then X( j) is empty because j is never a\nbest reply. The case ε∗ = 0 does not hold generically, because the constraints in (19)\nare independently defined by the payoff columns in B, and the hyperplane defined by the\noptimal value of ε would change (to positive or negative if the optimum was zero) for any\nslight variation of a suitable payoff. Because pure strategies where X( j) is empty can be\nomitted, we have L = max j∈D maxx∈X( j) xA j = max j∈N maxx∈X( j) xA j = H as claimed.\n5 Correlated equilibria\nIn this section, we consider correlated equilibria (Aumann 1974) for bimatrix games. We\nfirst show that the highest leader payoff H as defined in (14) is greater than or equal\nto the highest correlated equilibrium payoff to the leader. This strengthens Corollary 8.\nTrivially, the lowest leader payoff L in (14) is at least as high as some correlated payoff,\nbecause it is at least as high as some Nash payoff.\nWe consider the canonical form of a correlated equilibrium, which is a distribution on\nstrategy pairs. With the notation of the previous section, this is an m× n matrix z with\nnonnegative entries zi j for i ∈M, j ∈ N that sum to one. They have to fulfill the incentive\nconstraints that for all i,k ∈M and all j, l ∈ N,\n∑\nj∈N\nzi j ai j ≥ ∑\nj∈N\nzi j ak j , ∑\ni∈M\nzi j bi j ≥ ∑\ni∈M\nzi j bil . (21)\nWhen a strategy pair (i, j) is drawn with probability zi j according to this distribution by\nsome device or mediator, player 1 is told i and player 2 is told j. The first constraints\nin (21) state that player 1, when recommended to play i, has no incentive to switch from\ni to k, given (up to normalization) the conditional probabilities zi j on the strategies j of\nplayer 2. Analogously, the second inequalities in (21) state that player 2, when recom-\nmended to play j, has no incentive to switch to l.\nTheorem 12 In the mixed extension of a bimatrix game, the highest leader payoff H in\n(14) is greater than or equal to any correlated equilibrium payoff to the leader.\nProof. Assume that the leader is player 1. Consider a correlated equilibrium z with prob-\nabilities zi j fulfilling (21) above. Define the marginal probabilities on N by\ny j = ∑\ni∈M\nzi j for j ∈ N, (22)\nand let S be the support of this marginal distribution, S= { j ∈N | y j > 0}. For each j in S,\nlet c j be the conditional expected payoff to player 1 given that player 2 is recommended\nto (and does) play j,\nc j = ∑\ni∈M\nzi jai j\/y j .\n16\nFinally, let s in S be a strategy so that cs = max j∈S c j .\nWe claim that H ≥ cs, and that cs is greater than or equal to the payoff to player 1\nin the correlated equilibrium z, which proves the theorem. To see this, define x in X\nby xi = zis\/ys for i ∈ M. Let player 1 commit to x in the leadership game. Then s is\na best reply to x by player 2’s incentive constraints (21) for j = s, multiplied by the\nnormalization factor 1\/ys. The corresponding payoff xAs to player 1 is cs. This may\nnot necessarily define a leadership equilibrium since player 1 may possibly improve his\npayoff by a different commitment. At any rate, the payoff cs to player 1 when leader and\nfollower play as described fulfills cs ≤H. Furthermore, the correlated equilibrium payoff\nto player 1 is an average of the conditional payoffs c j for j ∈ S and therefore not higher\nthan their maximum cs:\n∑\nj∈N, i∈M\nzi jai j = ∑\nj∈S, i∈M\ny j zi jai j\/y j = ∑\nj∈S\ny j c j ≤ cs ≤ H,\nas claimed.\nWe conclude this paper by considering a generalization of correlated equilibria which\ninvolves a commitment by both players. This is the “simple extension” of a correlated\nequilibrium defined by Moulin and Vial (1978, p. 203), which, following Young (2004),\nwe call coarse correlated equilibrium. We show that such a coarse correlated equilibrium\nmay give a payoff to the leader which is higher than any leader payoff in the leadership\ngame.\nA coarse correlated equilibrium is given by a distribution z on strategy profiles, which\nare chosen according to this commonly known distribution by a mediator. Each player\nmust decide either to be told the outcome of the lottery z and to commit himself to playing\nthe recommended strategy, or not to be told the outcome and play some mixed strategy. In\nequilibrium, the players commit themselves to playing the mediator’s recommendation,\nand do not gain by unilaterally choosing not to be told the recommendation. So a uni-\nlaterally deviating player knows only the marginal probabilities under z of the choices of\nthe other players. For two players, the respective inequalities are, for all k ∈M and l ∈ N,\n∑\ni, j\nzi j ai j ≥∑\nj\n(\n∑\ni\nzi j\n)\nak j , ∑\ni, j\nzi j bi j ≥∑\ni\n(\n∑\nj\nzi j\n)\nbil . (23)\nThese inequalities are obviously implied by the incentive constraints (21); that is, any\ncorrelated equilibrium according to Aumann fulfills (23).\nRemark 13 The payoff to a player in a coarse correlated equilibrium of a two-player\ngame can be higher than any leader payoff in the corresponding mixed extension of the\ngame.\nProof. Figure 4 shows a variation of the “paper–scissors–rock” game. This game is sym-\nmetric between the two players, and does not change under any cyclic permutation of\nthe three strategies. The players’ strategies beat each other cyclically, inflicting a loss\n17\n@\n@\n0\n0\n−2\n1\n1\n−2\n1\n−2\n0\n0\n−2\n1\n−2\n1\n1\n−2\n0\n0\n1\n2\nP\nQ\nR\np q r\nFigure 4 Game with payoff 0 in a coarse correlated equilibrium, which is higher than\nany leader payoff.\n−2 on the loser which exceeds the gain 1 for the winner. The game has a unique mixed\nNash equilibrium where each strategy is played with probability 1\/3 and each player gets\nexpected payoff −1\/3.\nFor the game in Figure 4, one coarse correlated equilibrium with payoff (0,0) is a lot-\ntery that chooses each of (P, p), (Q,q) and (R,r) with probability 1\/3, and any other pure\nstrategy pair with probability zero. This fulfills (23), but is not a correlated equilibrium.\nIn the leadership game for Figure 4, it suffices to consider only one best reply re-\ngion, say for the first strategy p of player 2. The best reply region for p is the convex\nhull of the points (in X , giving the probabilities for P,Q,R), (1\/3,1\/3,1\/3), (3\/4,0,1\/4),\n(0,1\/4,3\/4), and (0,0,1), with respective payoffs−1\/3,−1\/2,−5\/4, and−2 to player 1.\nThe maximum of these leader payoffs is therefore −1\/3, which is the same for any best\nreply region because of the symmetry in the three strategies. In this game, leader and Nash\npayoff coincide. By Theorem 12, the highest correlated equilibrium payoff is also −1\/3,\nwhich is also the lowest correlated equilibrium payoff since it is the max-min payoff.\nWe have shown that in the game in Figure 4, there is a coarse correlated equilibrium\nwhich gives a payoff which is higher than the (unique) leader payoff of the mixed exten-\nsion of the game. The coarse correlated equilibrium concept involves a commitment by\nboth players to a correlated device. However, this concept does not generalize the sub-\ngame perfect equilibrium of a leadership game, because it has correlated and Nash equilib-\nria of the simultaneous game as special cases, whereas leadership payoffs are generically\nunique.\nReferences\nAmir, R. (1995), Endogenous timing in two-player games: A counterexample. Games and Eco-\nnomic Behavior 9, 234–237.\n18\nAmir, R., Grilo, I. (1999), Stackelberg versus Cournot equilibrium. Games and Economic Behav-\nior 26, 1–21.\nAumann, R. J. (1974), Subjectivity and correlation in randomized strategies. Journal of Mathe-\nmatical Economics 1, 67–96.\nAvenhaus, R., Okada, A., Zamir, S. (1991), Inspector leadership with incomplete information. In:\nGame Equilibrium Models IV, ed. R. Selten, Springer, Berlin, 319–361.\nAvenhaus, R., von Stengel, B., Zamir, S. (2002), Inspection games. In: Handbook of Game Theory\nwith Economic Applications, Vol. 3, eds. R. J. Aumann and S. Hart, Elsevier, Amsterdam,\n1947–1987.\nBas¸ar, T., Olsder, G. J. (1982), Dynamic Noncooperative Game Theory. Academic Press, London.\nCharnes, A. (1953), Constrained games and linear programming. Proc. National Academy of Sci-\nences of the U.S.A. 39, 639–641.\nCournot, A. A. (1838), Recherches sur les Principes Mathe´matiques de la The´orie des Richesses.\nHachette, Paris.\nFriedman, J. W. (1977), Oligopoly and the Theory of Games. North-Holland, Amsterdam.\nHamilton, J., Slutsky, S. (1990), Endogenous timing in duopoly games: Stackelberg or Cournot\nequilibria. Games and Economic Behavior 2, 29–46.\nKakutani, S. (1941), A generalization of Brouwer’s fixed point theorem. Duke Math. J. 8, 457–459.\nMaschler, M. (1966), A price leadership method for solving the inspector’s non-constant-sum\ngame. Naval Research Logistics Quarterly 13, 11–33.\nMorgan, J., Patrone, F. (2006), Stackelberg problems: Subgame perfect equilibria via Tikhonov\nregularization. In: Advances in Dynamic Games, eds. A. Haurie et al., Annals of the Inter-\nnational Society of Dynamic Games, Vol. 8, Birkha¨user, Boston, 209–221.\nMoulin, H., Vial, J.-P. (1978), Strategically zero-sum games: The class of games whose completely\nmixed equilibria cannot be improved upon. International Journal of Game Theory 7, 201–\n221.\nNash, J. F. (1950), Equilibrium points in N-person games. Proc. National Academy of Sciences of\nthe U.S.A. 36, 48–49.\nReny, P. J., Robson, A. J. (2004), Reinterpreting mixed strategy equilibria: A unification of the\nclassical and Bayesian views. Games and Economic Behavior 48, 355–384.\nRubinstein, A. (1982), Perfect equilibrium in a bargaining model. Econometrica 50, 97–109.\nSchelling, T. C. (1960), The Strategy of Conflict. Harvard Univ. Press, Cambridge, Mass.\nShapiro, C. (1989), Theories of oligopoly behavior. In: Handbook of Industrial Organization, Vol.\nI, eds. R. Schmalensee and R. D. Willig, North-Holland, Amsterdam, 329–414.\nvon Neumann, J., Morgenstern, O. (1947), Theory of Games and Economic Behavior, 2nd ed.\nPrinceton Univ. Press, Princeton, NJ.\nvon Stackelberg, H. (1934), Marktform und Gleichgewicht. Springer, Vienna.\nvon Stengel, B. (2002), Computing equilibria for two-person games. In: Handbook of Game The-\nory, Vol. 3, eds. R. J. Aumann and S. Hart, North-Holland, Amsterdam, 1723–1759.\nvon Stengel, B., Koller, D. (1997), Team-maxmin equilibria. Games and Economic Behavior 21,\n309–321.\n19\nvon Stengel, B., Zamir, S. (2004), Leadership with Commitment to Mixed Strategies. Research\nReport LSE-CDAM-2004-01, London School of Economics.\nYoung, H. P. (2004), Strategic Learning and its Limits. Oxford University Press, Oxford.\n20\n"}