{"doi":"10.1103\/PhysRevD.71.014015","coreId":"66467","oai":"oai:dro.dur.ac.uk.OAI2:1390","identifiers":["oai:dro.dur.ac.uk.OAI2:1390","10.1103\/PhysRevD.71.014015"],"title":"New results on B→π,K,η decay form factors from light-cone sum rules.","authors":["Ball, P.","Zwicky, R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-01","abstract":"We present an improved calculation of B--> light pseudoscalar form factors from light-cone sum rules, including one-loop radiative corrections to twist-2 and twist-3 contributions, and leading-order twist-4 corrections. The total theoretical uncertainty of our results at zero momentum transfer is 10 to 13% and can be improved, at least in part, by reducing the uncertainty of hadronic input parameters, in particular, those describing the twist-2 distribution amplitudes of the pi, K, and eta. We present our results in a way which details the dependence of the form factors on these parameters and facilitates the incorporation of future updates of their values from, e.g., lattice calculations.\\ud\n\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66467.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1390\/1\/1390.pdf","pdfHashValue":"2b592e240e96ae928a5516f1e7da2a3451b1b6c8","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1390<\/identifier><datestamp>\n      2013-01-08T16:33:25Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        New results on B→π,K,η decay form factors from light-cone sum rules.<\/dc:title><dc:creator>\n        Ball, P.<\/dc:creator><dc:creator>\n        Zwicky, R.<\/dc:creator><dc:description>\n        We present an improved calculation of B--> light pseudoscalar form factors from light-cone sum rules, including one-loop radiative corrections to twist-2 and twist-3 contributions, and leading-order twist-4 corrections. The total theoretical uncertainty of our results at zero momentum transfer is 10 to 13% and can be improved, at least in part, by reducing the uncertainty of hadronic input parameters, in particular, those describing the twist-2 distribution amplitudes of the pi, K, and eta. We present our results in a way which details the dependence of the form factors on these parameters and facilitates the incorporation of future updates of their values from, e.g., lattice calculations.\\ud\n\\ud\n<\/dc:description><dc:subject>\n        Pions distribution amplitude<\/dc:subject><dc:subject>\n         Perturbative QCD correction<\/dc:subject><dc:subject>\n         Asterisk-B-Pi<\/dc:subject><dc:subject>\n         Quantum chromodynamics<\/dc:subject><dc:subject>\n         Asymptotic-behavior<\/dc:subject><dc:subject>\n         Exclusive processes<\/dc:subject><dc:subject>\n         Wave-function<\/dc:subject><dc:subject>\n         Heavy-quark<\/dc:subject><dc:subject>\n         2nd moment<\/dc:subject><dc:subject>\n         Resonance physics.<\/dc:subject><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review D : particles and fields, 2005, Vol.71, pp.014015 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1390<\/dc:identifier><dc:identifier>\n        issn:0556-2821<\/dc:identifier><dc:identifier>\n        issn: 1089-4918<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevD.71.014015<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1390\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevD.71.014015<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1390\/1\/1390.pdf<\/dc:identifier><dc:rights>\n        © 2005 by The American Physical Society. All rights reserved.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0556-2821","issn:0556-2821"," 1089-4918","issn: 1089-4918"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Pions distribution amplitude","Perturbative QCD correction","Asterisk-B-Pi","Quantum chromodynamics","Asymptotic-behavior","Exclusive processes","Wave-function","Heavy-quark","2nd moment","Resonance physics."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n28 April 2008\nVersion of attached file:\nOther\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBall, P. and Zwicky, R. (2005) ’New results on B,K, decay form factors from light-cone sum rules.’, Physical\nreview D., 71 . 014015.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevD.71.014015\nPublisher’s copyright statement:\n2005 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nar\nX\niv\n:h\nep\n-p\nh\/\n04\n06\n23\n2v\n1 \n 2\n1 \nJu\nn \n20\n04\nIPPP\/04\/23\nDCPT\/04\/46\nTPI-MINN-04\/25\nNew Results on B → pi,K, η Decay Formfactors\nfrom Light-Cone Sum Rules\nPatricia Ball\n∗,1\nand Roman Zwicky\n†,2\n1 IPPP, Department of Physics, University of Durham, Durham DH1 3LE, UK\n2 William I. Fine Theoretical Physics Institute,\nUniversity of Minnesota, Minneapolis, MN 55455, USA\nAbstract:\nWe present an improved calculation of B → light pseudoscalar formfactors from light-cone\nsum rules, including one-loop radiative corrections to twist-2 and twist-3 contributions,\nand leading order twist-4 corrections. The total theoretical uncertainty of our results at\nzero momentum transfer is 10 to 13% and can be improved, at least in part, by reducing\nthe uncertainty of hadronic input parameters, in particular those describing the twist-2\ndistribution amplitudes of the π, K and η. We present our results in a way which details\nthe dependence of the formfactors on these parameters and facilitates the incorporation\nof future updates of their values from e.g. lattice calculations.\nSubmitted to Physical Review D\n∗Patricia.Ball@durham.ac.uk\n†zwicky@physics.umn.edu\n1 Introduction\nThis paper aims to give a new and more precise determination of the decay formfactors\nof B mesons into light pseudoscalar mesons, i.e. π, K and η. We do not include the η′\nwhich is too heavy to be treated in this framework. The calculation uses the method of\nQCD sum rules on the light-cone, which in the past has been rather successfully applied\nto various problems in heavy-meson physics, cf. Refs. [1, 2, 3, 4, 5]1; an outline of the\nmethod will be given below. Our calculation improves on our previous papers [3, 4] by\n• including radiative corrections to twist-3 contributions to one-loop accuracy, for all\nformfactors;\n• a precisely defined method for fixing the sum rule specific parameters;\n• using updated values for input parameters;\n• a careful analysis of the uncertainties of the formfactors at zero momentum transfer;\n• a new parametrization of the dependence of the formfactors on momentum transfer,\nwhich is consistent with the constraints from analyticity and heavy-quark expansion;\n• detailing the dependence of formfactors on nonperturbative hadronic parameters\ndescribing the π, K, η mesons, the so-called Gegenbauer moments, which facilitates\nthe incorporation of future updates of their numerical values and also allows a con-\nsistent treatment of their effect on nonleptonic decays treated in QCD factorisation.\nThe motivation for this study is twofold and related to the overall aim of B physics\nto provide precision determinations of quark flavor mixing parameters in the Standard\nModel. Quark flavor mixing is governed by the unitary CKM matrix which depends on\nfour parameters: three angles and one phase. The constraints from unitarity can be\nvisualized by the so-called unitarity triangles (UT); the one that is relevant for B physics\nis under intense experimental study. The over-determination of the sides and angles of\nthis triangle from a multitude of processes will answer the question whether there is new\nphysics in flavor-changing processes and where it manifests itself. One of the sides of the\nUT is given by the ratio of CKM matrix elements |Vub\/Vcb|. |Vcb| is known to about 2%\naccuracy from both inclusive and exclusive b → cℓν transitions [7], whereas the present\nerror on |Vub| is much larger and around 15%. Its reduction requires an improvement of\nexperimental statistics, which is under way at the B factories BaBar and Belle, but also\nand in particular an improvement of the theoretical prediction for associated semileptonic\nspectra and decay rates. This is the first motivation for our study of the B → π decay\nformfactor fB→pi+ , which, in conjunction with alternative calculations, in particular from\nlattice [8], will help to reduce the uncertainty from exclusive semileptonic determinations\nof |Vub|. Secondly, formfactors of general B → light meson transitions are also needed\nas ingredients in the analysis of nonleptonic two-body B decays, e.g. B → Kπ, in the\nframework of QCD factorization [9], again with the objective to extract CKM parameters.\nOne issue calling for particular attention in this context is the effect of SU(3) breaking,\nwhich enters both the formfactors and theK and η meson distribution amplitudes figuring\n1See also Ref. [6] for reviews.\n1\nin the factorization analysis. We would like to stress here that the implementation of\nSU(3) breaking in the light-cone sum rules approach to formfactors is precisely the same\nas in QCD factorization and is encoded in the difference between π, K and η distribution\namplitudes, so that the use of formfactors calculated from light-cone sum rules together\nwith the corresponding meson distribution amplitudes in factorization formulas allows a\nunified and controlled approach to the assessment of SU(3) breaking effects in nonleptonic\nB decays.\nAs we shall detail below, QCD sum rules on the light-cone allow the calculation of\nformfactors in a kinematic regime where the final state meson has large energy in the rest-\nsystem of the decaying B, E ≫ ΛQCD. This is in contrast to lattice calculations which\npresently are available only for B → π and q2 > 15GeV2, due to the restriction to π\nenergies smaller than the inverse lattice spacing.2 First unquenched results are underway\n[10, 11], which, once published, will allow one to exploit the complementarity of lattice\nsimulations and light-cone sum rules in more detail.\nThe physics underlying B decays into light mesons at large momentum transfer can be\nunderstood qualitatively in the framework of hard exclusive QCD processes, pioneered by\nBrodsky and Lepage et al. [12]. The hard scale in B decays is mb and one can show that\nto leading order in 1\/mb the decay is described by two different parton configurations:\none where all quarks have large momenta and the momentum transfer happens via the\nexchange of a hard gluon, the so-called hard-gluon exchange, and a second one where\none quark is soft and does interact with the other partons only via soft-gluon exchange,\nthe so-called soft or Feynman-mechanism. The consistent treatment of both effects in a\nframework based on factorization, i.e. the clean separation of perturbatively calculable\nhard contributions from nonperturbative “wave functions”, is highly nontrivial and has\nspurred the development of SCET, an effective field theory which aims to separate the\ntwo relevant large mass scales mb and\n√\nmbΛQCD in a systematic way [13]. In this ap-\nproach formfactors can indeed be split into a calculable factorizable part which roughly\ncorresponds to the hard-gluon exchange contributions, and a nonfactorizable one, which\nincludes the soft contributions and cannot be calculated within the SCET framework [14].\nPredictions obtained in this approach then typically aim to eliminate the soft part and\ntake the form of relations between two or more formfactors whose difference is expressed\nin terms of factorizable contributions.\nThe above discussion highlights the need for a calculational method that allows nu-\nmerical predictions while treating both hard and soft contributions on the same footing.\nIt is precisely QCD sum rules on the light-cone (LCSRs) that accomplish this task. LC-\nSRs can be viewed as an extension of the original method of QCD sum rules devised by\nShifman, Vainshtein and Zakharov (SVZ) [15], which was designed to determine proper-\nties of ground-state hadrons at zero or low momentum transfer, to the regime of large\nmomentum transfer. QCD sum rules combine the concepts of operator product expan-\nsion, dispersive representations of correlation functions and quark-hadron duality in an\ningenuous way that allows the calculation of the properties of non-excited hadron-states\nwith a very reasonable theoretical uncertainty. In the context of weak-decay formfac-\n2This situation may change in the future with the successful implementation of “moving NRQCD”\n[10], where the B decays while moving “backwards”, which gives access to smaller values of q2 without\nincreasing the discretisation error.\n2\ntors, the basic quantity is the correlation function of the weak current and a current\nwith the quantum numbers of the B meson, evaluated between the vacuum and a light\nmeson. For large (negative) virtualities of these currents, the correlation function is, in\ncoordinate-space, dominated by distances close to the light-cone and can be discussed\nin the framework of light-cone expansion. In contrast to the short-distance expansion\nemployed by conventional QCD sum rules a` la SVZ where nonperturbative effects are en-\ncoded in vacuum expectation values of local operators with vacuum quantum numbers, the\ncondensates, LCSRs rely on the factorization of the underlying correlation function into\ngenuinely nonperturbative and universal hadron distribution amplitudes (DAs) φ which\nare convoluted with process-dependent amplitudes T . The latter are the analogues of the\nWilson-coefficients in the short-distance expansion and can be calculated in perturbation\ntheory. The light-cone expansion then reads, schematically:\ncorrelation function ∼\n∑\nn\nT (n) ⊗ φ(n). (1)\nThe sum runs over contributions with increasing twist, labelled by n, which are suppressed\nby increasing powers of, roughly speaking, the virtualities of the involved currents. The\nsame correlation function can, on the other hand, be written as a dispersion-relation, in\nthe virtuality of the current coupling to the B meson. Equating dispersion-representation\nand the light-cone expansion, and separating the B meson contribution from that of higher\none- and multi-particle states using quark-hadron duality, one obtains a relation for the\nformfactor describing the decay B → light meson.\nOur paper is organized as follows: in Sec. 2 we define all relevant quantities, in par-\nticular correlation functions and meson distribution amplitudes. In Sec. 3 we outline our\ncalculations and derive the light-cone sum rules. In Sec. 4 we present our numerical re-\nsults and Sec. 5 contains a summary and conclusions. Detailed expressions for distribution\namplitudes and explicit formulas for the light-cone sum rules are given in the appendices.\n2 Definitions\nThe formfactors fP+ , f\nP\n0 and f\nP\nT which are relevant for the B → P transition, where P\nstands for π, K or η, are defined as follows:3\n〈P (p)|V Pµ |B(pB)〉 =\n{\n(p+ pB)µ −\nm2B −m\n2\nP\nq2\nqµ\n}\nfP+ (q\n2) +\n{m2B −m2P\nq2\nqµ\n}\nfP0 (q\n2), (2)\n〈P (p)|JP,σµ |B(pB)〉=\ni\nmB +mP\n{\nq2(p+ pB)µ − (m\n2\nB −m\n2\nP )qµ\n}\nfPT (q\n2, µ), (3)\nwhere V pi,ηµ = u¯γµb is the standard weak current, V\nK\nµ is given by V\nK\nµ = s¯γµb and J\npi(η),σ\nµ =\nd¯σµνq\nνb, JK,σµ = s¯σµνq\nνb are penguin currents. The momentum transfer is given by\nq = pB − p and the physical range in q\n2 is 0 ≤ q2 ≤ (mB −mP )\n2. The formfactors fP+\nand fP0 are independent of the renormalization scale µ since Vµ is a physical current, in\ncontrast to the penguin current Jσµ . Note that f\nP\n+ (0) = f\nP\n0 (0) which is a consequence of\n3The following notations are frequently used in the literature: f+ = F1 and f0 = F0.\n3\nthe parametrization chosen in Eq. (2). We assume SU(2) isospin symmetry throughout\nthis work, i.e. we do not distinguish B¯0 → π+ and B− → π0 formfactors etc.\nIn the semileptonic decay B → πlνl the formfactor f\npi\n0 enters proportional to the lepton\nmass m2l and hence is irrelevant for light leptons (l = e, µ), where only f\npi\n+ matters. The\nsemileptonic decay can be used to determine the size of the CKM matrix element |Vub|\nfrom the spectrum\ndΓ\ndq2\n(B → πlνl) =\nG2F |Vub|\n2\n192π3m3B\nλ(q2)3\/2|fpi+(q\n2)|2 , (4)\nwhere λ(x) = (x+m2B −m\n2\npi)\n2 − 4m2Bm\n2\npi. The formfactor f\npi\n0 will be relevant in and can\nbe measured from the decay B → πτντ . f\npi\nT is relevant for the rare decay B → πl\n+l−,\nwhere the penguin current features in the effective Hamiltonian of the process.\nOur starting point for calculating the formfactors fpi+,0 is the correlation function\nΠµ(q, pB) = i\n∫\nd4xeiq·y〈π(p)|TVµ(x)j\n†\nB(0)|0〉 (5)\n= Π+(q\n2, p2B)(p+ pB)µ +Π−(q\n2, p2B)qµ ,\nwhere jB = mbd¯iγ5b is the interpolating field for the B meson. For the calculation of f\npi\nT ,\nVµ has to be replaced by J\nσ\nµ . For virtualities\nm2b − p\n2\nB ≥ O(ΛQCDmb), m\n2\nb − q\n2 ≥ O(ΛQCDmb), (6)\nthe correlation function (5) is dominated by light-like distances and therefore accessible\nto an expansion around the light-cone. The above conditions can be understood by de-\nmanding that the exponential factor in (5) vary only slowly. The light-cone expansion is\nperformed by integrating out the transverse and “minus” degrees of freedom and leaving\nonly the longitudinal momenta of the partons as relevant degrees of freedom. The inte-\ngration over transverse momenta is done up to a cutoff, µIR, all momenta below which\nare included in a so-called hadron distribution amplitude φ, whereas larger transverse\nmomenta are calculated in perturbation theory. The correlation function is hence decom-\nposed, or factorized, in perturbative contributions T and nonperturbative contributions\nφ, which both depend on the longitudinal parton momenta and the factorization scale\nµIR. If the π is an effective quark-antiquark bound state, as is the case to leading order\nin the light-cone expansion, we can write the corresponding longitudinal momenta as up\nand (1 − u)p, p being the momentum of the π. The schematic relation (1) can then be\nwritten in more explicit form as\nΠ+(q\n2, p2B) =\n∑\nn\n∫ 1\n0\ndu T (n)(u, q2, p2B, µIR)φ\n(n)(u, µIR). (7)\nAs Π+ itself is independent of the arbitrary scale µIR, the scale-dependence of T\n(n) and\nφ(n) must cancel each other.4 If φ(n) describes the meson in a two-parton state, it is called\n4If there are more than one contributions of a given twist, they will mix under a change of the\nfactorization scale µIR and it is only in the sum of all such contributions that the residual µIR dependence\ncancels.\n4\na two-particle distribution amplitude (DA), if it describes a three-parton, i.e. quark-\nantiquark-gluon state, it is called three-particle DA. In the latter case the integration\nover u gets replaced by an integration over two independent momentum fractions, say\nα1 and α2. Eq. (7) is called a “collinear” factorization formula, as the momenta of the\npartons in the π are collinear with the π’s momentum, and its validity actually has to be\nverified. We will come back to that issue in the next section.\nLet us now define the distribution amplitudes to be used in this paper. Again we only\nquote formulas for the π meson, those for the K and η are analogous. All definitions\nand formulas are well-known and can be found in Ref. [16]. In general, the distribution\namplitudes we are interested in are related to nonlocal matrix elements of type\n〈0|u¯(x)Γ[x,−x]d(−x)|π(p)〉 or 〈0|u¯(x)[x, vx]ΓGaµν(vx)λ\na\/2[vx,−x]d(−x)|π(p)〉.\nx is light-like or close to light-like and the light-cone expansion is an expansion in x2; v\nis a number between 0 and 1 and Γ a combination of Dirac matrices. The expressions\n[x,−x] etc. denote Wilson lines that are needed to render the matrix elements, and hence\nthe DAs, gauge-invariant. One usually works in the convenient Fock-Schwinger gauge\nxµAaµ(x)λ\na\/2 = 0, where all Wilson lines are just 1; we will suppress them from now\non. The DAs are ordered by twist, i.e. the difference between spin and dimension of the\ncorresponding operators. We will include DAs of twist-2 (the leading twist), 3 and 4. The\nleading-twist DA φpi is defined as\n〈0|u¯(x)γµγ5d(−x)|π\n−(p)〉 = ifpipµ\n∫ 1\n0\ndu eiζp·x\n[\nφpi(u) +\n1\n4\nm2pix\n2\nA(u)\n]\n+ ifpi\nm2pi\npx\nxµ\n∫ 1\n0\ndu eiζp·x gpi(u) +O(xµx\n2) (8)\nwith ζ ≡ 2u− 1 and p2 = 0. The above matrix element also contains two twist-4 DAs, gpi\nand A. The variable u can be interpreted as the momentum fraction carried by the quark\n(as opposed to the antiquark) in the meson.\nThere are two two-particle twist-3 DAs, φp and φσ, which are defined as\n〈0|u¯(x)iγ5d(−x)|π(p)〉 = µ\n2\npi\n∫ 1\n0\ndu eiζp·xφp(u) , (9)\n〈0|u¯(x)iσµνγ5d(−x)|π(p)〉 = −\ni\n3\nµ2pi(1− ρ\n2\npi)(pµxν − xµpν)\n∫ 1\n0\ndu eiζp·xφσ(u) , (10)\nwhere µ2pi ≡ fpim\n2\npi\/(mu +md) and ρ\n2\npi ≡ (mu +md)\n2\/m2pi.\nThe precise definitions of three-particle DAs are a bit cumbersome and given in App. B.\nThe salient feature is that there is one three-particle DA of twist-3 and four of twist-4.\nAlthough we have introduced not less than 10 different DAs, which are all nonper-\nturbative quantities, it may seem, at first glance, that light-cone sum rules do not retain\nmuch predictive power. Fortunately, however, it turns out that the DAs are highly con-\nstrained functions which can be analysed in the framework of conformal expansion, a\ntopic being discussed in App. B. The main result is that, to next-to-leading order in\n5\n(0)T TSE TW TB Tbox\nFigure 1: Perturbative contributions to the correlation function Π. The external quarks\nare on-shell with momenta up and (1− u)p, respectively.\nconformal expansion, which is sufficient for the accuracy we are aiming at, all 10 DAs can\nbe expressed in terms of 7 independent hadronic parameters.\nThis completes the definitions necessary for the calculation of formfactors.\n3 The Sum Rules\nThe diagrams to be calculated to O(αs) for two-particle DAs are shown in Fig. 1. The\nquark (antiquark) is collinear with the light meson and carries momentum up ((1− u)p).\nQuarks are projected onto the corresponding distribution amplitudes using the complete-\nness relation\nu¯adb =\n1\n4\n(1)ba(u¯d)−\n1\n4\n(iγ5)ba(u¯iγ5d) +\n1\n4\n(γµ)ba(u¯γ\nµd)−\n1\n4\n(γµγ5)ba(u¯γ\nµγ5d)\n+\n1\n8\n(σµν)ba(u¯σ\nµνd)︸ ︷︷ ︸\n≡− 1\n8\n(σµν iγ5)ba(u¯σµν iγ5d)\n.\nThe diagrams are calculated in momentum space. The terms in xµ in the contribution of\nφσ, Eq. (10), are rewritten in terms of derivatives\nxµ → −i\n∂\n∂(up)µ\n.\nIn the previous section we mentioned that the fact that Π can be written in factorized\nform can not be taken for granted, but requires proof. We do not attempt to give a\nproof to all orders in αs, although that should be possible using the techniques of SCET,\nbut restrict ourselves to O(αs) in twist-2, to all orders in the conformal expansion, and\nto O(αs) and leading order in the conformal expansion for twist-3. The proof essentially\nrelies on the cancellation of singularities, of which there are several possible types: infrared\nand ultraviolet singularities arising from loop calculations and so-called soft singularities\nwhich occur when the integral over u in Eq. (7) does diverge at the endpoints. The latter\ndivergences have actually posed a severe problem in early attempts to treat fpi+ in QCD\nfactorization: in Ref. [17] only the hard gluon exchange was included, which yields a\nlogarithmic divergence for the parton configuration where the u quark emerging from the\n6\nweak decay carries essentially all pion momentum. As we understand now, this divergence\ndisappears when contributions from the Feynman-mechanism are added. In our case, it\nturns out that all T are regular at the endpoints u = 0, 1, so there are no soft divergences,\nindependent of the end-point behavior of the distribution amplitudes. As for infrared and\nultraviolet singularities, they can be treated in dimensional regularisation. Using the\nlowest-order expression of the Brodsky-Lepage evolution kernel for φpi derived in [12], we\nhave followed the strategy outlined in [18] to check that the infrared divergences precisely\ncancel those contained in the bare DA φbarepi . As for twist-3, the evolution kernel is not\nknown, so we have only checked the cancellation of infrared divergences of the lowest\norder term in the conformal expansion, whose divergent behavior is well known – in fact,\nonly the one-loop renormalisation of the quark condensate is needed. The ultraviolet\ndivergences cancel for f+ and f0, which are physical formfactors and hence do not depend\non the ultraviolet renormalisation scale; for fT , we reproduce the well-known one-loop\nanomalous dimension.\nWe then have used the explicit expressions for the twist-2 and 3 two-particle DAs\ngiven in App. B to perform the integration over u analytically. Actually it is not the\ncorrelation function Π itself that is needed, but its imaginary part, see below. Π has\na cut in p2B starting at m\n2\nb and taking the imaginary part after integration over u is\nstraightforward. The strategy outlined here is different from the procedure we followed\nin our previous papers [3, 4], where we took the imaginary part before integrating over u.\nThis latter procedure resulted in expressions with a very complicated analytical structure\nwhich made it impossible to give explicit formulas for the imaginary parts. With our new\nprocedure we obtain lenghty, but not very complicated expressions; the complete set of\nspectral densities ρ = (ImΠ)\/π for the sum rule for the formfactor f+ is given in App. C.\nArmed with the spectral densities, we can derive the LCSR for e.g. the formfactor f+.\nThe basic quantity is Π+, which is calculated in two ways. In light-cone expansion, it can\nbe written in dispersive representation as\nΠLC+ (p\n2\nB, q\n2) =\n∫ ∞\nm2\nb\nds\nρLC+ (s, q\n2)\ns− p2B\n(11)\nwith the explicit expression for the spectral density ρLC+ (s) given in App. C. This expres-\nsion has to be compared to the physical correlation function, which also features a cut in\np2B, starting at m\n2\nB:\nΠphys+ (p\n2\nB, q\n2) =\n∫ ∞\nm2\nB\nds\nρphys+ (s, q\n2)\ns− p2B\n; (12)\nthe spectral density is given by hadronic contributions and reads\nρphys+ (s, q\n2) = fBm\n2\nBf+(q\n2)δ(s−m2B) + ρ\nhigher−mass states\n+ (s, q\n2). (13)\nHere fB is the B meson decay constant defined as\n〈0|q¯γµγ5b|B〉 = ifBpµ or (mb +mq)〈0|q¯iγ5b|B〉 = m\n2\nBfB. (14)\nTo obtain a light-cone sum rule for f+, one equates the two expressions for Π+ and uses\nquark-hadron duality to approximate\nρhigher−mass states+ (s, q\n2) ≈ ρLC+ (s, q\n2)Θ(s− s0), (15)\n7\nwhere s0, the so-called continuum threshold is a parameter to be determined within the\nsum rule approach itself. In principle one could now write a sum rule\nΠphys+ (p\n2\nB, q\n2) = ΠLC+ (p\n2\nB, q\n2)\nand determine f+ from it. However, in order to suppress the impact of the approximation\n(15), one subjects both sides of the equation to a Borel transformation\n1\ns− p2B\n→ Bˆ\n1\ns− p2B\n=\n1\nM2\nexp(−s\/M2)\nwhich ensures that contributions from higher-mass states be sufficiently suppressed and\nimproves the convergence of the OPE. We then obtain\ne−m\n2\nB\/M\n2\nm2BfB f+(q\n2) =\n∫ s0\nm2\nb\nds e−s\/M\n2\nρLC+ (s, q\n2). (16)\nThis is the final sum rule for f+; expressions for the other formfactors are obtained\nanalogously. The task now is to find sets of parameters M2 (the Borel parameter) and s0\n(the continuum threshold) such that the resulting formfactor does not depend too much\non the precise values of these parameters; in addition the continuum contribution, that is\nthe part of the dispersive integral from s0 to∞ that has been subtracted from both sides\nof (16), should not be too large, say less than 30% of the total dispersive integral.\n4 Numerics\nIn this section we obtain numerical results from the sum rules (16). The section is organ-\nised as follows: in Sec. 4.1 we explain how we determine the sum rule specific parameters,\ni.e. the Borel parameter M2 and the continuum threshold s0. We also determine fB,\nwhich is a necessary ingredient in (16). In Sec. 4.2 we explain in more detail how we fix\nthe hadronic input parameters, in particular the Gegenbauer moments a1,2,4 that describe\nthe final state mesons. In Sec. 4.3 we calculate the formfactors at q2 = 0 and discuss their\nuncertainties. In Sec. 4.4 we present the formfactors for central input-values of the pa-\nrameters and provide a simple parametrization valid in the full kinematical regime of q2.\nThe results for q2 = 0 are collected in Tab. 2 and Eq. (27), central results for arbitrary q2\nin Tab. 3. More detailed results that allow one to determine the formfactors for arbitrary\nvalues of mb and the Gegenbauer moments a1,2,4 are collected in App. A.\n4.1 Fixing the Borel Parameter and the Continuum Threshold\nWe illustrate our procedure to determine M2 and s0 with the comparatively simple ex-\nample of fB, the B decay constant defined in (14). This example is actually of immediate\npractical use, as fB enters our determination of the formfactors from Eq. (16). Since it is\nnot known from experiment, its value has to be taken from theoretical calculations – which\nbasically means either lattice determinations [19] or (local) QCD sum rules [20, 21]. To\nensure consistency of our calculations, we use the values of fB as determined from QCD\nsum rules to O(αs) accuracy [20]. The reason for this choice is twofold: firstly, it is\n8\nwell-known that the use of fB from sum rules reduces the dependence of the formfactors\non input-parameters, in particular mb [1]; secondly, O(α\n2\ns) corrections to fB turn out\nto be rather large [21], which was anticipated in the second reference in [20], where it\nwas argued that these corrections are dominated by Coulombic corrections. Precisely the\nsame corrections also enter the light-cone expansion of the correlation function Π, but\nwill largely cancel in the ratio f+ ∼ Π\/fB. In conclusion, we expect a cancellation of\nboth large radiative corrections and parameter dependence in the formfactors when fB\nis replaced by its sum rule to O(αs) accuracy; we do not expect the resulting numerical\nvalues of fB to be “good” predictions for that quantity.\nThe sum rule for fB reads [20]\n5\nf 2Bm\n2\nBe\n−\nm2\nB\nM2 =\n∫ s0\nm2\nb\nds ρpert(s)e−\ns\nM2 + Cq¯q〈q¯q〉+ Cq¯Gq〈q¯σgGq〉 ≡\n∫ s0\nm2\nb\nds ρtot(s)e−\ns\nM2 .(17)\nThe C are the Wilson coefficients multiplying the condensates, for which we use the\nfollowing numerical values at µ = 1GeV:\n〈q¯q〉 = −(0.24± 0.01)3GeV3 and 〈q¯σgGq〉 = 0.8GeV2〈q¯q〉. (18)\nThe condensates (and αs) are actually evaluated at the scale M\n2. The criteria for deter-\nmining M2 and s0 are often not stated very precisely. In the present context, with many\ndifferent formfactors to calculate, which entails the need for a well-defined procedure to\ndetermine the input-parameters for each of them, we decide to opt for a precisely defined\nmethod to fix the pair (M2, s0) and impose the following criteria on the sum rule for fB\n(and, later on, the formfactors):\n• the derivative of the logarithm of Eq. (17) with respect to 1\/M2 gives a sum rule\nfor the B meson mass mB:\nm2B =\n∫ s0\nm2\nb\nds s ρtot(s)\/\n∫ s0\nm2\nb\nds ρtot(s).\nWe require this sum rule to be fullfilled to high accuracy ∼ 0.1%.\n• the sum rule for fB is required to exhibit an extremum for a given pair (M\n2, s0).\nThese criteria define a set of parameters for each value ofmb, which are collected in Tab. 1,\ntogether with the resulting fB. For all these parameter sets the continuum contribution\n(i.e. the integral\n∫∞\ns0\n) is between 25% and 30% of the B contribution and hence well under\ncontrol.\nFor the formfactors fpi+, f\npi\n0 and f\npi\nT we follow the same procedure which results in\ndifferent values of M2 and s0 for formfactors and fB. For K and η we use the same\nvalues for the Borel parameter and the continuum threshold. From the explicit formulas\nof the tree-level sum rules for the formfactors quoted in e.g. the 3rd reference in [1], one\nfinds that the effective Borel parameter is uM2LC rather than M\n2\nLC.\n6 In order to keep this\n5The contribution of the gluon condensate is not sizable and we therefore neglect it.\n6We denote the Borel parameter of the LCSR (16) by M2LC and the Borel parameter of the SR (17)\nby M2.\n9\nmb s0 M\n2 fB s\n+\n0 ≈ s\n0\n0 c\n+\nc s\nT\n0 c\nT\nc\nset 1 4.85 33.8 3.8 0.150 33.3 2.00 33.6 2.4\nset 2 4.80 34.2 4.1 0.162 33.9 2.25 34.3 2.5\nset 3 4.75 34.6 4.4 0.174 34.5 2.50 35.1 2.6\nset 4 4.60 35.7 5.1 0.210 36.8 3.00 37.8 2.9\nTable 1: Parameter sets for fB and f(0); we use the same values of cc and s0 for π, K\nand η. mb and fB are given in GeV, s0 and M\n2 in GeV2.\nproduct constant, we rescale the Borel parameter by 〈u〉−1 by\n〈u〉(q2) ≡\n∫ ∞\nu0\ndu u φpi(u)e\n−\nm2\nb\n−(1−u)q2\nuM2 \/\n∫ ∞\nu0\ndu φpi(u)e\n−\nm2\nb\n−(1−u)q2\nuM2 , u0 =\nm2b − q\n2\ns0 − q2\n,\nresulting in the approximate values 〈u〉(0GeV2) = 0.86 and 〈u〉(14GeV2) = 0.77. Para-\nmetrising the relation between the Borel parameters by\nM2LC ≡ ccM\n2\/〈u〉, (19)\nwe obtain the values and continuum thresholds given in Tab. 1.\n4.2 Hadronic Input Parameters\nThe hadronic parameters needed are, for each meson, 7 parameters characterising the\ntwist-2, 3 and 4 distribution amplitudes to NLO in the conformal expansion, cf. App. B,\nthe decay constants of the π, K and η and B, the factorization scale µIR, the b quark\nmass mb and the strong coupling αs. As for the latter, we fix αs(mZ) = 0.118 and\nuse NLO evolution down to the required scale. The quark mass parameter entering our\nformulas is the one-loop pole mass mb for which we use mb = (4.80 ± 0.05)GeV (cf.\nTable 6 in the recent review [6] and references therein). We also include results for\nmb = 4.6GeV. The infrared factorization scale separating contributions to be included\nin DAs and perturbatively calculable terms is chosen to be µ2IR = m\n2\nB −m\n2\nb , which also\nsets the scale of αs; we will discuss the residual scale-dependence of our results below.\nThe decay constants for the π and K are very well known experimentally; for the η the\nsituation is complicated due to η–η′ mixing. We use the following values:\nfpi = 131MeV, fK = 160MeV, fη = 130MeV. (20)\nfB has been discussed in the previous subsection.\nAs for the meson DAs, we quote the preferred values for the twist-3 and 4 parameters\nin Tab. G; the form factors are not too sensitive to their precise values. The situation is\ndifferent, however, for the Gegenbauer moments a1,2,4(µ) parametrizing the twist-2 DAs\nφpi,K,η, and so we shall discuss in a bit more detail what is presently known about these\nparameters.\nBoth theoretical calculations and experimental determinations focus mainly on the\nπ DA (for which all odd Gegenbauer moments vanish due to G-parity; in particular\n10\napi1 = 0). The probably earliest calculation of the lowest Gegenbauer moment a2 was done\nby Chernyak and Zhitnitsky (CZ), yielding [22]\naCZ2 (0.5GeV) = 2\/3.\nThis result was obtained from local QCD sum rules, where an is extracted from the\ncorrelation function of the (local) interpolating field u¯γνγ5(\n↔\nD ·x)nd, where x defines the\nlight-cone, x2 = 0, and the usual interpolating current for the π, u¯γµγ5d. The price to\npay for the expansion of an intrinsically nonlocal quantity like φpi in contributions of local\noperators is an increasing sensitivity to nonperturbative effects, i.e. the precise values of\nthe condensates. As the coefficients of the condensates in the sum rule for an increase with\npowers of n and, for sufficiently large n, dominate over the perturbative contributions, it\nis clear that this method is inappropriate for calculating high moments, but one might\nexpect it to be reliable at least for the lowest moment with n = 2.\nThe DA obtained by CZ has the remarkable feature that φpi(1\/2, 0.5GeV) = 0, which\nis of course an artifact of neglecting all contributions from an≥4. It was subsequently\nshown by Braun and Filyanov (BF) [23] that both the pion-nucleon-nucleon coupling\ngpiNN and its mesonic equivalent gρωpi, when calculated from LCSRs, require a value of\nφpi(1\/2) significantly different from 0 (albeit at a slightly different scale):\nφpi(1\/2, 1GeV) = 1.2± 0.3 =\n3\n2\n−\n9\n4\na2(1GeV) +\n45\n16\na4(1GeV) + . . . , (21)\nwhere the dots denote neglected terms in an≥6. The large error is due to a large sensitivity\nof this result to twist-4 corrections to the sum rules. BF also redetermined a2, using the\nsame procedure as CZ, and combining their result, which is consistent with aCZ2 , with the\nabove constraint from φpi(1\/2), they obtained\naBF2 (1GeV) = 0.44, a\nBF\n4 (1GeV) = 0.25.\nAn alternative calculation aims to cure the problem of increasing condensate contri-\nbutions by resumming them into nonlocal condensates [24]. The Gegenbauer moments in\nthis approach are mostly sensitive to the ratio\nλ2q = 〈q¯σgGq〉\/(2〈q¯q〉) = (0.4± 0.1)GeV\n2 (µ = 1GeV)\nand have moderate to small values. The most recent paper on that topic, Ref. [25], quotes\na2(1.16GeV) = 0.19, a4(1.16GeV) = −0.13, a6,8,10 ∼ 10\n−3. (22)\nThere are not too many lattice calculations of moments of the π DA. The fairly old\nvalues quoted in [26] for the 2nd moment suffer from large uncertainties. This quantity has\nbeen investigated again recently [27], but the results, obtained in quenched approximation,\nare still preliminary.\nAlternative determinations of Gegenbauer moments rely on the analysis of experimen-\ntal data, in particular the pion-photon transition formfactor γ + γ∗ → π, measured at\nCLEO and Cello, and the electromagnetic formfactor of the pion. The results of these\nanalyses are typically either determinations of a2 (setting an≥4 to 0) or constraints on\n11\na linear combination of a2 and a4 (setting an≥6 to 0).\n7 These determinations are lim-\nited by mainly two problems: large experimental errors and the contamination by poorly\nknown twist-4 and higher effects, which are usually estimated from QCD sum rules. As\nfor the pion-photon transition formfactor, which has been measured by CLEO and Cello,\nthe technique used to extract a2 and a4 has been pioneered by Khodjamirian [29], re-\nfined by Schmedding and Yakovlev [30], with subsequent further refinements by Bakulev,\nMikhailov and Stefanis [31]. The upshot is that for not too small Q2 the pion-photon\ntransition is mostly sensitive to a like-sign combination of a2 and a4. Summarizing the\nanalyses of this process, we conclude from Tab. I in [25] that\na2(1GeV) + a4(1GeV) = 0.1± 0.1 (23)\nis a fair reflection of the current state of knowledge of a2,4 from that process.\nAs for the pion electromagnetic formfactor, the authors of Ref. [32] unfortunately only\nobtain a value for a2 and set a4 to zero. A very recent analysis of that formfactor, Ref. [25],\nconcludes that calculations using the nonlocal-condensate model are in good agreement\nwith data.\nSo what then do we actually know about a2 and a4? It seems to us that, taking ev-\nerything together, and with due consideration of the respective strengths and weaknesses\nof different approaches, the most reliable constraints for these quantities are (21) and\n(23). These two constraints contain opposite-sign combinations of a2 and a4 and hence\nare about equally sensitive to both parameters. The resulting allowed area for a2 and a4\nis shown in Fig. 2; its center is at\na2(1GeV) = 0.115, a4(1GeV) = −0.015,\na2(2.2GeV) = 0.080, a4(2.2GeV) = −0.0089.\n(24)\nThese are the central values we will use in our calculation of formfactors. The figure also\nshows that the remaining uncertainties are still considerable. Anticipating a future better\ndetermination of these parameters, from lattice or else, we will present our final results\nin such a way as to facilitate the inclusion of any shift in these values. Since much less\nis known about the Gegenbauer moments of the other pseudoscalar mesons K and η, we\nresort to SU(3) symmetry and use the same Gegenbauer moments.\nEq. (24) and Fig. 2 confirm the findings of previous analyses that the CZ DA is strongly\ndisfavored; the same applies to the values obtained by BF and to the local QCD sum rule\nfor a2, which favors a large positive a2 ∼ 0.4. One explanation for the failure of the\ncorresponding QCD sum rule could be that already the case n = 2 may be too “nonlocal”\nfor sum rules to work. Another one could be that the treatment of a1 and other resonances\ncontributing to that sum rule may be insufficient. We leave a further discussion of that\nquestion to future work. The result from sum rules with nonlocal condensates [24, 25, 31],\nshown as black square in Fig. 2, is also outside the favored area in Fig. 2, which is mainly\ndue to the large value of |a4|. It would definitely be very interesting to see all these results\nand constraints on a2,4 be supplemented by lattice determinations.\n7In principle it is possible to determine a2, a4 and even higher moments separately from the Q\n2\ndependence of their respective contributions. However, such an analysis requires accurate measurements\nof the formfactors over a large enough range of Q2, which are presently not available. See also Ref. [28],\nin particular Fig. 4.\n12\n0.1 0.2 0.3 0.4\n-0.4\n-0.3\n-0.2\n-0.1\n0.1\n0.2\n0.3a4\na2\n\u0000\n\u0000\n\u0001\n\u0001\n\u0000\u0000\n\u0000\u0000\n\u0001\u0001\n\u0001\u0001\nBMS\nBF\nBZ\nFigure 2: a2(1GeV) and a4(1GeV) as determined from the constraints (21) and (23).\nSolid line: central values, dashed lines: uncertainties. The black square labeled BZ\ndenotes the central values used in this paper, Eq. (24), BMS the prediction of the nonlocal\ncondensate model, Eq. (22), rescaled to µ = 1GeV, and BF is the central value obtained\nin Ref. [16].\nThe only parameter left to discuss is a1 for the K meson (by which we understand\nan sq¯ bound state), which is a G-parity breaking parameter. Here the situation is even\nworse than for a2,4, as neither size nor even sign of that quantity are reliably known.\nThe facts at hand are the following: the intuitive expectation is that a1 (i.e. the moment\nwith a weight-function proportional to 2u− 1) should be positive, as the DA is expected\nto be slightly tilted towards larger values of u which is the momentum fraction carried\nby the (heavier) s quark in the meson – the heavier the quark, the more the DA is\nexpected to peak at large u, the extreme case being a bq¯ bound state whose DA should\nbe close to δ(1−u). The (tree-level) QCD sum rule calculation in [22] seemed to confirm\nintuition, but was challenged, when Ref. [33] found a sign-mistake in that calculation and,\nincluding two-loop radiative corrections, obtained a negative sign for aK1 . For this paper,\nwe first decided to stick to that result and use the central value aK1 (1GeV) = −0.18. It\nturned out, however, that this value tends to produce formfactors with an unfavorable\nq2-dependence.8 We therefore decided to revert to the original result by CZ [22] and use\naK1 (1GeV) = 0.17 ↔ a\nK\n1 (2.2GeV) = 0.135. (25)\nThe conclusion from that inconclusive situation can only be that a second opinion has to\nbe sought, and we urge our colleagues from the lattice community to take up the challenge\nand provide the first-ever lattice determination of aK1 . For the time being, we will present\nour results in a way that makes it possible to obtain the formfactors also for different\nvalues of aK1 .\n4.3 Results for q2 = 0\nLet us first discuss the sum rule results for q2 = 0. They are collected in Tab. 2, for all\n4 parameter sets from Tab. 1.9 Including the uncertainty of mb, mb = (4.80± 0.05)GeV,\nthe final central values and uncertainties of the formfactors are given in Eq. (27).\n8That is: formfactors not very compatible with the parametrization discussed in Sec. 4.4, which is\nbased on generic analytic properties of the formfactors.\n9f0(0) is not included as f0(0) ≡ f+(0).\n13\n4.6 4.65 4.7 4.75 4.8 4.85mb\n0.22\n0.24\n0.26\n0.28\n0.3\nf+H0L = f0H0L for Π\n4.6 4.65 4.7 4.75 4.8 4.85mb\n0.3\n0.32\n0.34\n0.36\n0.38\nf+H0L = f0H0L for K\n4.6 4.65 4.7 4.75 4.8 4.85mb\n0.24\n0.26\n0.28\n0.3\n0.32\nf+H0L = f0H0L for Η\n4.6 4.65 4.7 4.75 4.8 4.85mb\n0.22\n0.24\n0.26\n0.28\n0.3\nfTH0L for Π\n4.6 4.65 4.7 4.75 4.8 4.85mb\n0.32\n0.34\n0.36\n0.38\n0.4\nfTH0L for K\n4.6 4.65 4.7 4.75 4.8 4.85mb\n0.26\n0.28\n0.3\n0.32\n0.34\nfTH0L for Η\nFigure 3: Central values of the formfactors f(0) and uncertainties ∆. Numbers from\nTab. 2.\n0.1 0.2 0.3 0.4 0.5\n-0.2\n-0.1\n0.1\n0.2\nBZ\nBMS\nBF\n0.24\n0.28\n0.30\n0.26\na2\na\n4 fpi+(0) =\nFigure 4: Dependence of fpi+(0) on a2(µIR) and a4(µIR), for parameter set 2. The lines\nare lines of constant fpi+(0). The dot labeled BZ denotes our preferred values of a2,4, BMS\nthe values from the nonlocal condensate model and BF from the sum rule calculations of\nRef. [16].\n-0.2 -0.1 0.1 0.2\n0.24\n0.26\n0.28\n0.32\n0.34\nfK+ (0)\na1(µIR)\n(a)\n2 4 6 8 10 12 14\nq2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\nf+ for K (b)\nFigure 5: (a) Dependence of fK+ (0) on the Gegenbauer moment a1(µIR). (b) f\nK\n+ (q\n2) as\nfunction of q2 for different values of a1: solid line: a\nK\n1 (1GeV) = 0.17, short dashes:\naK1 (1GeV) = 0, long dashes: a\nK\n1 (1GeV) = −0.18. Input parameters: set 2.\n14\nset 1 set 2 set 3 set 4 ∆as ∆a2,a4 ∆ ∆a1\nfpi+(0) 0.250 0.258 0.263 0.274 0.023 0.019 0.030 −\nfpiT (0) 0.244 0.253 0.260 0.273 0.013 0.022 0.026 −\nfK+ (0) 0.324 0.331 0.335 0.339 0.033 0.023 0.040 0.25δa1\nfKT (0) 0.347 0.358 0.367 0.381 0.022 0.027 0.035 0.31δa1\nf η+(0) 0.269 0.275 0.278 0.286 0.029 0.019 0.035 −\nf ηT (0) 0.277 0.285 0.292 0.305 0.018 0.022 0.028 −\nTable 2: Final central values of the formfactors at q2 = 0 for the parameter sets of Tab. 1.\nf0(0) ≡ f+(0). The errors ∆as, ∆a2,a4 and ∆a1 are described in the text. ∆ is defined as\n∆ = (∆2as+∆\n2\na2,a4)\n1\/2 and δa1 as δa1 = a1(1GeV)−0.17. Note that δa1 carries information\non the sign of a1 and can become negative.\nThe formfactors are calculated from Eq. (16) using the parameter sets given in Tab. 1\nand the hadronic input parameters given in Eqs. (24) and (25) and Tab. G. The depen-\ndence of the formfactors on mb, i.e. the set, is shown in Fig. 3. It is evident that the\nresidual dependence of f(0) on mb is much smaller than the one of fB in Tab. 2, which\nconfirms our expectation that the calculation of fB from a sum rule reduces the parameter\ndependence of the formfactors. fpi+(0) depends sensitively on a2 and a4 as illustrated in\nFig. 4. The formfactors show moderate SU(3) breaking between π and η, which is due to\nterms in the LCSRs proportional to the meson mass. ForK, the situation is different, and\nwe observe a strong enhancement of the formfactor due to the combination of two effects:\nthe fact that fK is larger than fpi and the positive contribution of the Gegenbauer moment\na1 to the formfactor. As discussed in the previous subsection, the numerical value of a1,\nand even its sign, is not precisely known. Fig. 5(a) illustrates the dependence of fK+ (0)\non a1, which is quite strong. Fig. 5(b) shows the dependence of f\nK\n+ (q\n2) on q2 for different\nvalues of a1. It is evident that a1 mainly determines the normalisation of the formfactor,\nbut has only minor impact on its shape. The uncertainty of fK+ (0) induced by a1 will\nbe discussed below. The dependence of fpi+(0) on the sum rule parameters M\n2 and s0 is\nillustrated in Fig. 6 and is very mild, thanks to the optimized criteria for choosingM2 and\ns0 outlined in Sec. 4.1. The behavior of the other formfactors is very similar. In Fig. 7 we\nshow the variation of fpi+(0) with a change of the factorization scale µIR in the large range\n1GeV ≤ µIR ≤ mb. The curve is remarkably flat which can be understood from the fact\nthat radiative corrections cancel to a certain extent between Π+ and fB and that large\nlogarithms of type lnmb\/µIR occur only at subleading order in the conformal expansion of\nthe DAs, which is numerically suppressed with respect to the leading (µIR-independent)\nterm, and at subleading twist, which is also suppressed.\nLet us now turn to the uncertainties of the formfactors induced by a variation of\nthe input parameters. It is convenient to split the formfactors into contributions from\ndifferent Gegenbauer moments,\nf(q2) = fas(q2) + a1f\na1(q2) +\n{\na2f\na2(q2) + a4f\na4(q2)\n}\n, (26)\nwhere fas contains the contributions to the formfactors from the asymptotic DA and also\n15\n3 4 5 6 7 M\n2\n0.252\n0.254\n0.256\n0.258\n0.262\n0.264\nf+ H0 GeV2L (a)\n33.4 33.6 33.8 34 34.2 34.4\ns0\n0.256\n0.258\n0.26\n0.262\nf+H0L for Π (b)\nFigure 6: Dependence of fpi+(0) on (a) the Borel parameter M\n2 and (b) the continuum\nthreshold s0. Input parameters: set 2 in Tab. 1.\n5 10 15 20 Μ\n2\n0.25\n0.26\n0.27\n0.28\nf+ H0GeV2L for Π\nFigure 7: Dependence of fpi+(0) on the factorization scale µIR. Same input parameters as\nin Fig. 6.\nall higher-twist effects from three-particle quark-quark-gluon matrix elements. Explicit\nexpressions for the functions fas,a1,a2,a4 can be obtained from Tab. C in App. A; in par-\nticular fai(0) is just given by the parameters a in that table. We calculate separately the\nuncertainties ∆as,a1 of the first and second term and the combined uncertainty ∆a2,a4 of\nthe term in curly brackets. We start with ∆as. To estimate its value we vary the following\nquantities:\n• the threshold s0 by ±0.5GeV\n2;\n• the Borel parameter M2 in Eq. (19) by ±1.2GeV2;\n• the infrared factorization scale µ2IR = m\n2\nB −m\n2\nb by ±2GeV\n2;\n• the quark condensate and the mixed condensate as indicated in Eq. (18);\n• the twist-3 matrix-element η3 by ±50%.\nmb is kept fixed and we calculate the uncertainty separately for each parameter set; for\na given formfactor, ∆as is then the largest uncertainty of the 4 sets. The errors are\n16\ncorrelated and we therefore scan the five-parameter space for the largest deviations from\nthe central values. The resulting ∆as are given in Tab. 2.\nThe uncertainty of fK(0) induced by a1 is dominated by a1 itself, so we do not attempt\nto determine the uncertainty of fa1 arising from varying M2, s0 etc., but just take the\nmaximum value of fa1(0) ≡ a from Tab. C in App. A and multiply it by δ1 = a1(1GeV)−\n0.17 and the leading-order scaling factor from 1GeV to µIR, which gives the entry labeled\n∆a1 in Tab. 2.\nAs the allowed input values of a2 and a4 are correlated and given by the rhomboid\nshown in Fig. 2, we only determine the combined uncertainty ∆a2,a4 arising from the\ncorresponding variation of the Gegenbauer moments, separately for each parameter set.\nThe resulting uncertainties depend strongly on the precise values of M2 and s0, so for a\nconservative estimate of the uncertainty we scan the full 7-parameter space in a2, a4, M\n2\netc. and quote the largest deviation from the central value as uncertainty, which yields\nthe ∆a2,a4 quoted in Tab. 2. Taking everything together, and including the variation of\nmb = (4.80± 0.05)GeV in the error estimate, adding errors in quadrature, we find (δa1 is\ndefined in Tab. 2):\nfpi+(0) = 0.258± 0.031, f\npi\nT (0) = 0.253± 0.028,\nfK+ (0) = 0.331± 0.041 + 0.25δa1, f\nK\nT (0) = 0.358± 0.037 + 0.31δa1 ,\nf η+(0) = 0.275± 0.036, f\nη\nT (0) = 0.285± 0.029. (27)\nThese are our final results for the formfactors at q2 = 0. For fpi,η the total theoretical\nuncertainty is 10% to 13%, for fK it is 12%, plus the uncertainty in a1, which hopefully\nwill be clarified through an independent calculation in the not too far future. These\nuncertainties include a variation of both the external input parameters and the sum rule\nspecific parameters, but they do not include an additional “systematic” uncertainty of\nthe sum rule method itself. To a certain extent, this intrinsic sum rule uncertainty is\nincluded by the variation of the sum rule specific parameters M2 and s0, which sets the\nminimum uncertainty of the result: all external hadronic parameters fixed, this variation\ninduces a ∼ 7% uncertainty of fpi+(0) quoted in Eq. (27). Realistically, one may hope to\nreduce the ∼ 12% uncertainty quoted to ∼ 10% by reducing the errors on the Gegenbauer\nmoments a2,4 by a factor of 2. Further improvement will then have to come from a better\ncontrol over higher-twist matrix elements, dominated by the quark condensate and the\nquark-quark-gluon matrix element η3 discussed in App. B.\n4.4 Results for q2 6= 0, Fits and Extrapolations\nIn this subsection we calculate the q2-dependence of the formfactors for central values of\nthe input parameters and cast them into a three-parameter parametrization that is valid\nfor all q2. The results are given in Tab. 3 which is to be used together with Eq. (30).\nThe fit parameters for other sets of input parameters are given in App. A. We refrain\nfrom a complete analysis of the uncertainty of the q2-dependence of the formfactors, but\njust mention that it is likely to be smaller than that at q2 = 0, which is indicated by a\ndecrease of the spread between the formfactors calculated from the different parameter\nsets in Tab. 1, cf. Fig. 9.\n17\nThe validity of the LCSR approach is restricted to the kinematical regime of large\nmeson energies, EP ≫ ΛQCD, which via the relation\nq2 = m2B − 2mBEP\nimplies a restriction to small and moderate q2; specifically, we evaluate the sum rules\nonly for 0 ≤ q2 ≤ 14GeV2. The resulting formfactors are plotted in Fig. 8, using the\nparameter set 2 in Tab. 1 and the hadronic input parameters given in Eqs. (24) and (25)\nand Tab. G. As expected from LEET [34], f+ and fT nearly coincide. Although this\nagreement is expected to be best for small q2, i.e. large energies of the light meson, it is\nseen to hold for all q2. From the LCSR point of view, this agreement is due to the fact\nthat the leading twist-2 contributions to the corresponding correlation functions coincide\nat tree-level. The figure also shows that the q2-dependence of f0 is weaker than that of the\nother formfactors. This is can be understood from the fact that, if f+ is represented as a\ndispersion relation over hadronic states, these states have quantum numbers JP = 1− and\nhence zero orbital angular momentum, whereas for f0 the quantum number is J\nP = 0+\nand thus the coupling of these states or, in the language of potential-models, their wave-\nfunction at the origin, is suppressed as it corresponds to a state with orbital angular\nmomentum L = 1. Fig. 8 also shows sizable SU(3) breaking for the K, but a moderate\none for η, which is due to the same effects discussed for the formfactors at q2 = 0. In Fig. 9\nwe show fpi+(q\n2) as function of q2, calculated for sets 1, 3 and 4 and normalized to set 2. It\nis evident that the uncertainties induced by mb, which amount to 6% at q\n2 = 0, become\nless important for larger q2, so that for instance the branching ratio of the semileptonic\ndecay B → πeν will be less dependent on the precise value of mb than f\npi\n+(0).\nOne of the main goals of this paper is to give simple expressions for the formfactors\nin the full physical regime 0 ≤ q2 ≤ (mB − mP )\n2 ≈ 23GeV2. We thus have to find a\nparametrization that\n• reproduces the data below 14GeV2 with good accuracy;\n• provides an extrapolation to q2 > 14GeV2 that is consistent with the expected\nanalytical properties of the formfactors and reproduces the lowest-lying resonance\n(pole) with JP = 1− for f+ and fT .\n10\nIt is actually not very difficult to find good fits: the parametrization\nf(q2) =\nf(0)\n1− aF q2\/m2B − bF (q\n2\/m2B)\n2\n(28)\nadvocated in previous works, e.g. [4], is one example for an excellent fit to the results\nof the sum rules for q2 < 14GeV2. In the present context, however, it turns out to be\nunsuitable as it produces, for fpi+, a pole at q\n2 ≈ 23GeV2, which is below the physical\npole at q2 = m2B∗ = (5.32GeV)\n2. In our previous paper [4] we argued that the above\nparametrization should be matched to a simple pole-dominance formula f+ ∼ 1\/(m\n2\nB∗−q\n2)\nfor q2 above a certain threshold q20 ∼ 15GeV\n2, defined as the value of q2 that would allow a\n10For f0, the lowest pole with quantum numbers 0\n+ lies above the two-particle threshold starting at\n(mB +mP )\n2 and hence is not expected to feature prominently.\n18\n2 4 6 8 10 12 14 q\n2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\nf+ , fo , fT for Π\n2 4 6 8 10 12 14 q\n2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\nf+ , fo , fT for K\n2 4 6 8 10 12 14 q\n2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\nf+ , fo , fT for Η\nFigure 8: f+ (solid lines), f0 (short dashes) and fT (long dashes) as functions of q\n2 for π,\nK and η. The renormalisation scale of fT is chosen to be mb. Input parameters: set 2 in\nTab. 1.\nsmooth transition11 from one parametrization to the other. This procedure unfortunately\ndoes not work for our new formfactors, as the optimum q20 turns out to be far outside the\nphysical regime. We therefore decide to follow, as far as possible, the procedure advocated\nby Becirevic and Kaidalov [35], who suggested to write the formfactor f+ as dispersion\nrelation in q2 with a lowest-lying pole plus a contribution from multiparticle states, which\nin turn is to be replaced by an effective pole at higher mass:\nf+(q\n2) =\nr1\n1− q2\/m21\n+\n∫ ∞\n(mB+mP )2\nds\nρ(s)\ns− q2\n(29)\n→\nr1\n1− q2\/m21\n+\nr2\n1− q2\/m2fit\n. (30)\nThe lowest-lying resonance in the bu¯ channel is well known experimentally: it the B∗(1−)\nvector meson with mass 5.32 GeV; this is also the mass to be used for the η, as the\nB → η formfactors calculated in this paper refer to a b → u transition. For the K we\nhave calculated the mass of the B∗s resonance in the heavy-quark limit and find\nm2B∗s −m\n2\nBs = m\n2\nB∗ −m\n2\nB → m\nK\n1 = mB∗s = 5.41GeV.\nFor Eq. (30) to describe all f+ and also fT , which feature the same 1\n− resonance,\nin terms of three fit parameters, r1, r2 and mfit, it is crucial that the position of the\n11That is equality of both the parametrization formulas and their first derivatives in q20 .\n19\n2 4 6 8 10 12 14\n0.96\n0.98\n1.02\n1.04\n1.06\nFigure 9: Ratio of f\npi(seti)\n+ (q\n2)\/f\npi(set2)\n+ (q\n2) as function of q2. Solid line: set 1; long dashes:\nset 3; short dashes: set 4.\nq\nmax\n28 10 12 14\n0.92\n0.94\n0.96\n0.98\nFigure 10: Variation of the total semileptonic rate Γ(B → πeν) as function of q2max, the\nmaximum q2 for which LCSR results are included in the fits. The rate is normalized to\n1 for q2max = 14GeV\n2 and fit 1. Solid line: fit 1, long dashes: fit 2, short dashes: fit 3.\nInput parameters: set 2.\nlowest pole is sufficiently below the two-particle cut starting at (mB + mP )\n2. We find\nthat indeed most fpi+,T formfactors, with the exception of f\npi(set 4)\nT , are described very well\nby (30). For f\npi(set 4)\nT , however, and all f\nK,η\n+,T , mfit gets too close to m1, so that the fit\nbecomes numerically unstable. In this case, it is appropriate to expand (30) to first order\nin mfit −m1, which yields\nfK,η+,T (q\n2) =\nr1\n1− q2\/m21\n+\nr2\n(1− q2\/m21)\n2\n(31)\nwith fit parameters r1 and r2, and m1 = mB∗,B∗s fixed.\nFor f0, one can write a decomposition similar to (29), but here the lowest-lying pole\nwith quantum numbers 0+ lies either above the two-particle threshold (for π and η) or is\nvery close to it (for K, cf. Tab. D), so that the pole is effectively hidden under the cut\nand only the dispersive term survives in (29). We again follow the suggestion of Becirevic\nand Kaidalov and replace this term by an effective pole, i.e. we set\nf0(q\n2) =\nr2\n1− q2\/m2fit\n. (32)\nThe accuracy of the fits of the LCSR results to the above parametrizations is generally\nvery high and best for sets 1 to 3 of Tab. 1 with mb = (4.80±0.05)GeV, with a maximum\n20\nr1 r2 (m1)\n2 m2fit\nfpi+ 0.744 −0.486 (m\npi\n1 )\n2 40.73\nfpi0 0 0.258 − 33.81\nfpiT 1.387 −1.134 (m\npi\n1 )\n2 32.22\nfK+ 0.162 0.173 (m\nK\n1 )\n2 −\nfK0 0 0.330 − 37.46\nfKT 0.161 0.198 (m\nK\n1 )\n2 −\nf η+ 0.122 0.155 (m\nη\n1)\n2 −\nf η0 0 0.273 − 31.03\nf ηT 0.111 0.175 (m\nη\n1)\n2 −\nTable 3: Fit parameters for Eq. (30) for set 2 in Tab. 1 and central values of the input\nparameters of the DAs, Eqs. (24), (25) and Tab. G. m1 is the vector meson mass in the\ncorresponding channel: mpi,η1 = mB∗ = 5.32GeV and m\nK\n1 = mB∗s = 5.41GeV. The scale\nof fT is µ = 4.8GeV.\nset 1 set 2 set 3 set 4\nfit 1 0.97 1 1.01 1.05\nfit 2 0.97 0.98 0.99 1.00\nfit 3 0.95 0.98 1.00 1.04\nTable 4: Total semileptonic decay rates Γ(B → πeν) normalised to 1 for set 2, fit 1, for\ndifferent formfactor parametrizations and input parameter sets.\n1.2% deviation; set 4 fares slightly worse with an accuracy of 2% or better. The quality\nof the fits is discussed in more detail in App. A. The uncertainty introduced by fitting\nis much smaller than the actual uncertainty of the sum rule calculation, which we have\nfound to be around 10% at q2 = 0, and also much smaller than the intrinsic and irreducible\nsum rule uncertainty, which we have estimated to be ∼ 7%. Nevertheless it is legitimate\nto ask whether the extrapolation of the fits to q2 > 14GeV2, or the variation of the\n“cutoff” q2max = 14GeV\n2, introduce an additional uncertainty. In answering this question,\nwe first would like to recall that for most applications it is actually sufficient to know the\nformfactors for q2 < 14GeV2 only — these include in particular nonleptonic B decays\ntreated in QCD factorization, and also the rare decays B → (π,K, η)ℓ+ℓ−, as the spectrum\nfor invariant lepton masses above the cc¯ threshold, i.e. q2 ≥ m2J\/ψ ≈ 10GeV\n2, is dominated\nby long-distance processes unrelated to B → (π,K, η) formfactors. The only, but very\nimportant case where the formfactor is needed over the full range of q2 is the semileptonic\ndecay B → πℓν, which depends on fpi+ and (for decays into τ) on f\npi\n0 . We discuss the effect\nof the extrapolation on this decay by studying three different parametrizations of fpi+:\nfit 1: Eq. (30), our standard parametrization;\n21\nfit 2: a modified version of (28), with one zero of the denominator fixed at m21 = m\n2\nB∗ :\nfpi+(q\n2) =\nfpi+(0)\n(1− q2\/m21)(1− q\n2\/m2fit)\n;\nfit 3: a parametrization similar to (31), but with the pole mass as fit parameter:\nfpi+(q\n2) =\nr1\n1− q2\/m2fit\n+\nr2\n(1− q2\/m2fit)\n2\n.\nWe quantify the difference between these parametrizations by calculating the semileptonic\ndecay rate, the integral of Eq. (4) over q2 from 0 to (mB − mpi)\n2, normalizing to our\ncentral values, set 2 and fit 1. The results are collected in Tab. 4. It is evident that the\ndependence of the rate on the fit is rather mild, despite the double-pole of fit 3, which is\nhowever sufficiently far away from the endpoint of the spectrum, mfit = (5.6± 0.1)GeV,\nand hence has only moderate impact on the rate. We conclude that the extrapolation\nof fpi+ causes an uncertainty in the total semileptonic decay rate Γ(B → πeν) which is\nconsiderably less than the expected intrinsic sum rule uncertainty of ∼ 14%.\nWe conclude the discussion of the uncertainty of the extrapolations by studying the\neffect of changing the maximum value of q2 for which the sum rules results are included\nin the fits. Our default value q2max is 14GeV\n2; lowering q2max changes the fit parameters of\nall three parametrizations and hence the predictions for the total semileptonic decay rate.\nFig. 10 shows the corresponding change in the rate, normalised to our central values fit 1\nand q2max = 14GeV\n2. Again the dependence of the rate on q2max is mild, which corroborates\nour conclusion that the precise shape of the formfactor is not that relevant, as long as it\ndoes not exhibit too strong a singularity at q2 = (5.32GeV)2.\nThere are also other tests and checks for the validity of the extrapolation of (30) to\nthe full physical regime q2 < (mB −mP )\n2: firstly, the coefficient r1 for f\npi\n+ is related to\nthe coupling gBB∗pi as\nr1 =\nfB∗gBB∗pi\n2mB∗\n. (33)\nAt the upper end of the physical range in q2 we can expect vector-meson dominance to be\neffective and therefore the fit-parameter should be close to the above value. In fact lattice\n[36] and meson-loop calculations (cf. the first reference in [6]) yield r1 ≈ 0.8, but are at\nvariance with a determination of gBB∗pi from LCSRs which yields r1 ≈ 0.44 [5]. The lattice\nand meson-loop calculations are further supported by the agreement of their predictions\nfor gDD∗pi with experimental measurements, whereas LCSRs again give a value that is too\nlow by almost a factor of two. The author of [37] speculates that this discrepancy may be\nexplained by a violation of quark-hadron duality in the LCSRs used for the determination\nof gDD∗pi and gBB∗pi, which would preclude a clean determination of these couplings from\nLCSRs. Another possible solution of the problem was suggested in Ref. [38], where it was\nshown that the value of r1 from LCSRs increases once a radial excitation with negative\nresidue is included in the hadronic parametrization of the correlation function.12 If we\ninterpret our fit results as determinations of gBB∗pi, we get the following values of r1 for\n12Note that the corresponding spectral function is not positive definite.\n22\nthe sets 1 to 4: (0.73,0.74,0.77,0.94) (cf. Tab. A), which is in reasonable agreement with\nlattice and meson-loop calculations.\nSecondly, there is one further constraint on the formfactor f0. As first pointed out in\nRef. [39], in the soft-pion limit p → 0 and m2pi → 0 (i.e. q\n2 = m2B) f\npi\n0 (m\n2\nB) is related to\nthe decay constants of the B and π as\nfpi0 (m\n2\nB) =\nfB\nfpi\n. (34)\nWe can compare this relation with our parametrization by solving it for fB. For the\nfour parameter sets of Tab. 1, we get from Eq. (34) f set1B = 201MeV, f\nset2\nB = 193MeV,\nf set3B = 190MeV and f\nset4\nB = 207MeV, which is in good agreement with lattice and sum\nrule calculations.\nLet us conclude with one more remark. In LEET, f+ and f0 are related as [34]:\nf0 =\n2E\nmB\nf+ , (35)\nwhich is valid in the combined limits mB → ∞ and E → ∞. This constraint was used\nin Ref. [35] to reduce the number of fit parameters to two as necessitated by the limited\naccuracy of the lattice formfactors. We do not impose this constraint explicitly, but find\nthat it is valid to 4% accuracy for our formfactors, for not too large q2.\nSummarizing, we conclude that, for all formfactors, the three-parameter formula (30)\nprovides both an excellent fit to the LCSR results for q2 < 14GeV2 and a smooth extrap-\nolation to 14GeV2 < q2 < (mB −mP )\n2, and is consistent with all known constraints.\n5 Summary & Conclusions\nIn this paper we have given a thorough and careful examination of the predictions of QCD\nsum rules on the light-cone for the formfactors f+, f0 and fT for the decays B → π,K, η.\nWe have not discussed B → η′, which is not accessible within the method due to its large\nmass.\nThe main improvements of our results with respect to our previous publications [3, 4]\nare:\n• predictions for all formfactors of B → π,K, η transitions to O(αs) accuracy for\ntwist-2 and 3 two-particle contributions;\n• a well-defined and precise method for fixing sum rule specific parameters (cf. Sec. 4.1);\n• a careful assessment of uncertainties at zero momentum transfer (cf. Sec. 4.2 and\n4.3);\n• a detailed breakdown of the contributions of different Gegenbauer moments ai to\nthe formfactors (cf. App. A), which\n– renders straightforward the implementation of future updates of these param-\neters;\n23\n– allows the assessment of the impact of nonasymptotic twist-2 distribution am-\nplitudes on QCD factorised nonleptonic B decays in a coherent way, to 4th\norder in the conformal expansion;\n• a parametrization of the q2-dependence of formfactors valid in the full physical\nregime of momentum transfer that reproduces all relevant analytical properties of\nthe formfactors (cf. Sec. 4.4).\nOur main results for q2 = 0 are collected in Tab. 2 and Eq. (27). They depend crucially\non the values of the Gegenbauer moments describing the twist-2 distribution amplitudes\nof π, K and η, cf. App. B. We have determined these parameters as discussed in Sec. 4.2,\nbut a better determination from an independent source, e.g. lattice calculations, would be\nextremely useful. This applies in particular to the SU(3) breaking parameter aK1 , whose\nsize and even sign is under discussion (cf. Ref. [33]). Once more precise values for these\nparameters will be available, it is straightforward to obtain the corresponding formfactors\nfrom the data collected in App. A. Setting aside a1, the total theoretical uncertainty of the\nformfactors at q2 = 0 is 10% to 13%, which includes a variation of all input parameters.\nIt can be further improved by reducing the uncertainties of, in particular, a2, a4, the\nquark condensate and η3, the dominant quark-quark-gluon matrix element. A reduction\nof the uncertainty of a2,4 by a factor of two will give a ∼ 2% gain in accuracy, reducing\nthe uncertainty of the quark condensate and η3 by the same factor will give another 2%.\nThe uncertainty due to the variation of only the sum rule specific parameters is 7%,\nwhich cannot be reduced any further and hence sets the minimum theoretical uncertainty\nthat can be achieved within this method. Comparing with the uncertainties quoted in\nour previous publications, we have achieved a reduction of the global estimate ∼ 15%\nquoted in [3] and also of the 20% uncertainty for fpi+(0) quoted in [4]. This is partially\ndue to a reduction of the uncertainties of the hadronic input parameters, in particular\nmb, and partially due to a refinement of the assessment of sum rule specific uncertainties\nas discussed in Sec. 4.1.\nWe have also calculated all formfactors for 0 ≤ q2 ≤ 14GeV2; the upper bound on q2 is\ndue to the limitations of the light-cone expansion which requires the final-state meson to\nhave energies E ≫ ΛQCD: for q\n2\nmax = 14GeV\n2 the meson energy is E = 1.3GeV. In order\nto allow a simple implementation of our results, we have given a parametrisation that\nincludes the main features of the analytical properties of the formfactors and is valid in\nthe full physical regime 0 ≤ q2 ≤ (mB−mP )\n2. The corresponding results for our preferred\nset of input parameters are given in Tab. 3; a detailed breakdown of the contributions of\ndifferent parameters to the full formfactors is given in App. A. The main features of the\nresults are that the formfactors f+ and fT are nearly equal as predicted by LEET and\nthat f0 is very well described by a single-pole formula. The uncertainty induced by the\nextrapolation of the parametrization to larger momentum transfers is an issue only for\nthe semileptonic decay B → πeν; we have checked that the change of the total rate is at\nmost 5% for three different extrapolations of the light-cone sum rule results.\nOur approach is complementary to standard lattice calculations, in the sense that\nit works best for large energies of the final state meson (i.e. small q2), whereas lattice\ncalculations work best for small energies – a situation that may change in the future with\nthe implementation of moving NRQCD [10]. Previously, the LCSR results for fpi+,0 at\n24\nset 2, mb = 4.8GeV set 4, mb = 4.6GeV\nr1 m\n2\n1 r2 m\n2\nfit ∆ r1 m1 r2 m\n2\nfit ∆\nfpi+ 0.744 (m\npi\n1 )\n2 −0.486 40.73 0.3 0.944 (mpi1 )\n2 −0.669 34.27 0.3\nfpi0 0 − 0.258 33.81 0.1 0 − 0.270 33.63 1.2\nfpiT 1.387 (m\npi\n1 )\n2 −1.134 32.22 0.5 use (A.2) with r1 = 0.152,\nr2 = 0.122, m1 = m\npi\n1 ,∆ = 0.4\nfpi,as+ 0.918 (m\npi\n1 )\n2 −0.675 38.20 0.1 0.711 (mpi1 )\n2 −0.441 44.31 0.1\nfpi,as0 0 − 0.244 30.46 0.8 0 − 0.270 31.93 0.1\nfpi,asT 1.556 (m\npi\n1 )\n2 −1.321 32.56 0.2 1.331 (mpi1 )\n2 −1.061 33.43 0.4\nTable A: Fit parameters for the π Eq. (A.1) for both the full formfactors and the asymp-\ntotic ones, fas, Eq. (A.5), using the sets 2 and 4 in Tab. 1. The formfactor f0 is fitted to\nthe parametrization (A.3). The mass parameters mx1 are given in Tab. D. ∆ is a measure\nof the quality of the fit and is defined in (A.4).\nsmall and moderate q2 were found to nicely match the lattice results obtained for large\nq2 [42]. The situation will have to be reassessed in view of our new results and it will be\nvery interesting to see if and how it will develop with further progress in both lattice and\nLCSR calculations.\nAcknowledgements\nR.Z. is greatful to M.B. Voloshin for clarifications; he is supported by the Swiss National\nScience Foundation. P.B. would like to thank the W.I. Fine Theoretical Physics Institute\nat the University of Minnesota in Minneapolis for hospitality while this paper was semi-\nfinalised.\nAppendix\nA Fit Parameters and Comments\nThis appendix extends the discussion of Sec. 4.4.\nFull formfactors. As discussed in Sec. 4.4, we fit the LCSR results to the following\nparametrizations:\n• for fpi+,T :\n13\nf(q2) =\nr1\n1− q2\/m21\n+\nr2\n1− q2\/m2fit\n, (A.1)\n13Apart from fpiT for set 4, which shows the same behavior as f\nK,η\n+,T and hence is parametrised the same\nway, i.e. according to (A.2).\n25\nset 2, mb = 4.8GeV set 4, mb = 4.6GeV\nr1 r2 mfit(m1) ∆ r1 r2 mfit(m1) ∆\nfK+ 0.1616 0.1730 (m\nK\n1 )\n2 1.2 0.1903 0.1478 (mK1 )\n2 1.0\nfK0 0 0.3302 37.46 1.0 0 0.3338 38.98 1.9\nfKT 0.1614 0.1981 (m\nK\n1 )\n2 0.5 0.1851 0.1905 (mK1 )\n2 1.7\nf η+ 0.1220 0.1553 (m\nη\n1)\n2 1.0 0.1380 0.1462 (mη1)\n2 0.9\nf η0 0 0.2734 31.03 0.5 0 0.2799 30.46 2.0\nf ηT 0.1108 0.1752 (m\nη\n1)\n2 0.5 0.1160 0.1841 (mη1)\n2 1.6\nfK,as+ 0.0541 0.2166 (m\nK\n1 )\n2 0.2 0.0991 0.2002 (mK1 )\n2 0.6\nfK,as0 0 0.2719 30.33 0.7 0 0.2984 31.99 0.5\nfK,asT 0.0244 0.2590 (m\nK\n1 )\n2 0.8 0.0660 0.2621 (mK1 )\n2 1.3\nf η,as+ 0.0802 0.1814 (m\nη\n1)\n2 1.0 0.1201 0.1636 (mη1)\n2 0.6\nf η,as0 0 0.2604 28.80 0.5 0 0.2803 29.59 0.8\nf η,asT 0.0570 0.2115 (m\nη\n1)\n2 0.3 0.0914 0.2096 (mη1)\n2 1.0\nTable B: Fit parameters for K and η for Eq. (A.2), for both the full formfactors and the\nasymptotic ones, fas, Eq. (A.5), using the sets 2 and 4 in Tab. 1. The formfactor f0 is\nfitted to the parametrisation A.3. The mass parameters m1 are given in Tab. D. ∆ is a\nmeasure of the quality of the fit and is defined in (A.4).\nwhere mpi1 is the mass of B\n∗(1−), mpi1 = 5.32GeV; the fit parameters are r1, r2 and\nmfit;\n• for fK,η+,T and f\npi\nT (set 4):\nf(q2) =\nr1\n1− q2\/m21\n+\nr2\n(1− q2\/m21)\n2\n, (A.2)\nwhere m1 is the mass of the 1\n− meson in the corresponding channel, cf. Tab. D; the\nfit parameters are r1 and r2;\n• for f0:\nf0(q\n2) =\nr2\n1− q2\/m2fit\n, (A.3)\nthe fit parameters are r2 and mfit.\nThe fit parameters are collected in the upper halves of Tabs. A and B. ∆ is a measure of\nthe quality of the fit and defined as\n∆ = 100 max\nt\n∣∣∣∣f(t)− ffit(t)f(t)\n∣∣∣∣ , t ∈ {0, 12 , . . . , 272 , 14}GeV2, (A.4)\ni.e. it gives, in per cent, the maximum deviation of the fitted formfactors from the original\nLCSR result for q2 < 14GeV2. From the ∆ given in the table we conclude that the overall\nquality of the fits is very good and best for the pion and also that they work better for\nour preferred set 2 than for set 4.\n26\nset 2, mb=4.8 GeV set 4, mb=4.6 GeV\na b× 102 c× 102 d× 103 δ a b× 102 c× 102 d× 103 δ\nfK+ (a1) 0.310 0.930 0.139 −0.083 0.3 0.276 0.060 0.151 −0.157 0.7\nfK0 (a1) 0.308 0.106 0.026 −0.048 0.2 0.273 −0.433 0.0001 −0.051 0.2\nfKT (a1) 0.381 1.056 0.167 −0.108 0.3 0.354 0.027 0.178 −0.194 0.7\nfpi+(a2) 0.187 −0.517 0.014 −0.117 0.5 0.040 −0.762 −0.201 0.050 1.5\nfpi0 (a2) 0.185 −0.841 −0.075 −0.005 0.4 0.041 −1.078 −0.123 0.068 1.2\nfpiT (a2) 0.203 −0.659 −0.008 −0.118 0.3 0.038 −0.944 −0.244 0.073 1.5\nfK+ (a2) 0.228 −0.632 0.017 −0.143 0.5 0.049 −0.931 −0.245 0.061 1.5\nfK0 (a2) 0.226 −1.031 −0.092 −0.005 0.4 0.050 −1.32 −0.150 0.083 1.2\nfKT (a2) 0.264 −0.858 −0.011 −0.153 0.3 0.049 −1.228 −0.318 0.095 1.5\nf η+(a2) 0.185 −0.514 0.014 −0.116 0.5 0.039 −0.757 −0.199 0.049 1.5\nf η0 (a2) 0.183 −0.829 −0.076 −0.002 0.4 0.041 −1.068 −0.122 0.069 1.2\nf ηT (a2) 0.216 −0.722 −0.007 −0.128 0.3 0.040 −1.019 −0.259 0.076 1.4\nfpi+(a4) −0.141 −0.775 0.004 0.161 0.7 −0.054 −0.506 0.621 −0.326 5.2\nfpi0 (a4) −0.139 −0.687 0.170 0.002 1.5 −0.061 0.703 0.323 −0.209 2.9\nfpiT (a4) −0.167 −0.895 0.077 0.143 1.1 −0.047 −0.327 0.698 −0.394 4.9\nfK+ (a4) −0.173 −0.947 0.005 0.196 0.7 −0.067 −0.618 0.759 −0.398 5.2\nfK0 (a4) −0.170 −0.838 0.209 0.001 1.5 −0.075 0.871 0.392 −0.254 2.9\nfKT (a4) −0.217 −1.165 0.101 0.187 1.1 −0.061 −0.426 0.909 −0.513 4.9\nf η+(a4) −0.140 −0.770 0.004 0.159 0.7 −0.054 −0.502 0.616 −0.323 5.2\nf η0 (a4) −0.138 −0.681 0.170 0.0005 1.5 −0.061 0.710 0.318 −0.206 2.9\nf ηT (a4) −0.178 −0.955 0.083 0.153 1.1 −0.050 −0.349 0.745 −0.421 4.9\nTable C: Fit parameters for Eq. (A.6) for the functions fai defined in (A.5). δ is a measure\nof the quality of the fit and defined in (A.7).\nSplit formfactors. As discussed in Sec. 4.2, the values of the Gegenbauer moments\na1,2,4 are not very well known. In Sec. 4.4 and Tabs. A, B we have presented results only\nfor our preferred choice of these parameters, i.e.\naK1 (1GeV) = 0.17 , a\npi,K,η\n2 (1GeV) = 0.115 , a\npi,K,η\n4 (1GeV) =−0.015,\naK1 (2.2GeV) = 0.135 , a\npi,K,η\n2 (2.2GeV) = 0.080 , a\npi,K,η\n4 (2.2GeV) =−0.0089;\nfor set 4, the ai are scaled up to µIR = 2.6GeV. In order to allow the inclusion of\nfuture updates of these values, we split the formfactors into contributions from different\nGegenbauer moments. We define14\nf(q2) = fas(q2) + a1(µIR)f\na1(q2) + a2(µIR)f\na2(q2) + a4(µIR)f\na4(q2), (A.5)\n14Note that this splitting is exact and valid for arbitrarily large ai — there are no nonlinear terms in\nai.\n27\nm21 (1\n−) m21∗ (0\n+) q2max\nπ (η) 5.322= 28.4 5.632= 31.7 26.4 (22.8)\nK 5.412= 29.3 5.722= 32.7 23.8\nTable D: Masses of 1− and 0+ resonances in the bu¯ and bs¯ channels. The 1− masses\nare obtained from experiment and heavy-quark relations, the 0+ masses from a potential\nmodel [40]. All numbers in units GeV2.\nwhere fas contains twist-2 contributions from the asymptotic DA and also all higher-twist\ncontributions not proportional to a1,2,4. The task is now to fit all functions f\nas,a1,a2,a4 , in\nthe interval 0 < q2 < 14GeV2, to appropriate parametrizations.\nFor fas, which gives the dominant contribution to all formfactors, we use the same\nparametrisation as for the full formfactors. The results are collected in the lower halves\nof Tabs. A and B. Again, the fits are very good and best for the pion and set 2.\nThe fai turn out to be slowly varying functions of q2, which can be fitted by a poly-\nnomial of 3rd degree:\nfai(q2) = a+ b (q2) + c (q2)2 + d (q2)3 . (A.6)\nThe measure of the quality of the fit has now to be defined in a slightly different way, as\nthe fai have zeros in the fit interval. We define the fit-quality δ as\nδ = 100\n∑\nt |f(t)− f\nfit(t)|∑\nt |f(t)|\n, t ∈ {0, 1\n2\n, . . . , 27\n2\n, 14}GeV2 , (A.7)\ni.e. as the average deviation of the fit from the true value, in per cent. The fit parameters\nare given in Tab. C. As one can read off from the δ’s, the fits are best for fa1, still good\nfor fa2 and worst for fa4 . The limited quality of the fits for fa4 is due to a change of sign\nof its derivative at the upper end of the fit interval, which cannot be reliably reproduced\nby a polynomial of 3rd degree.\nWe would like to stress that none of the split-formfactor parametrizations must be\nused for q2 larger than 14GeV2. For calculating the full formfactors for arbitrary a1,2,4,\nthe following procedure should be followed:\n• determine a1,2,4 at the scale µ\n2\nIR = m\n2\nB −m\n2\nb ; the scaling factors from µ = 1GeV up\nto 2.2GeV (i.e. mb = 4.8GeV) are (0.793, 0.696, 0.590) for (a1, a2, a4);\n• choose set 2 (preferred) or set 4;\n• calculate fas from the appropriate formula (A.1), (A.2) or (A.3), using the fit pa-\nrameters from Tab. A or B;\n• calculate fa1,2,4 from (A.6), using the fit parameters from Tab. C;\n• calculate the total formfactor from (A.5);\n• extend the formfactor to the full kinematical regime by fitting it to (A.1), (A.2) or\n(A.3).\n28\nB Distribution Amplitudes\nIn this appendix we collect explicit expressions for all the DAs that enter the formfactors.\nThese expressions are well known and have been taken from Ref. [16].\nThe key point is that, to leading order in QCD, DAs can be expressed as a partial wave\nexpansion in terms of contributions of increasing conformal spin, the so-called conformal\nexpansion. The coefficients of different partial waves renormalize multiplicatively to LO\nin QCD, but mix at NLO, the reason being that the symmetry underlying the confor-\nmal expansion, the conformal symmetry of massless QCD, is anomalous and broken by\nradiative corrections.\nThe two-particle twist-2 amplitude (8) is expanded as\nφ(u, µ) = φas(u)\n∑\nn≥0\nan(µ)C\n3\/2\nn (ζ) (A.8)\nwith ζ ≡ 2u− 1 and a0 = 1 from normalization:∫ 1\n0\ndu φ(u, µ) = 1.\nThe C\n3\/2\nn (ζ) are Gegenbauer polynomials. The conformal spin of the term in C\n3\/2\nn is\nj = n + 2. For the π and η one has a2n+1 = 0 due to G-parity, but a\nK\n1 ∼ (ms −mq) for\nthe K [33], which is one source of SU(3) breaking for the formfactors.\nAs only the first few Gegenbauer moments an are known numerically, we truncate the\nseries at n = 4; the values of the conformal spins included are listed in Tab. E, whereas the\nnumerical values of the ai are discussed in Sec. 4. The truncation is justified as long as the\nperturbative kernels T with which the DAs are convoluted are slowly varying functions\nof u, so that the rapidly oscillating Gegenbauers suppress terms with high n. In our case\nthe T are nonsingular for all u, including the endpoints u = 0, 1, so the truncation of the\nseries is justified. The term labeled φas in (A.8) is the asymptotic DA which is reached\nfor large scales µ→∞; it is completely determined by perturbation theory and given by\nφas(u) = 6u(1− u);\nit is the same for all mesons. The Gegenbauer moments an become relevant at moderate\nscales and depend on the hadron in question.\nLet us now define the three-particle DAs. To twist-3 accuracy, there is only one:\n〈0|u¯(x)σµνγ5gGαβ(vx)d(−x)|π\n−(p)〉 =\n= i\nfpim\n2\npi\nmu +md\n(pαpµgνβ − pαpνgµβ − pβpµgνα + pβpνgαµ) T (v, p · x) + . . . , (A.9)\nwhere the ellipses stand for Lorentz structures of twist-5 and higher and where we used\nthe following short-hand notation for the integral defining the three particle DA:\nT (v, p · x) =\n∫\nDα e−ip·x(αu−αd+vαg)T (αd, αu, αg). (A.10)\n29\nHere α is the set of three momentum fractions αd (d quark), αu (u quark) and αg (gluon).\nThe integration measure is defined as∫\nDα =\n∫ 1\n0\ndαddαudαgδ(1− αu − αd − αg).\nThere are also four three-particle DAs of twist-4, defined as\n〈0|u¯(x)γµγ5gGαβ(vx)d(−x)|π\n−(p)〉 =\n= pµ(pαxβ − pβxα)\n1\np · x\nfpim\n2\npiA‖(v, p · x) + (pβg\n⊥\nαµ − pαg\n⊥\nβµ)fpim\n2\npiA⊥(v, p · x),(A.11)\n〈0|u¯(x)γµigG˜αβ(vx)d(−x)|π\n−(p)〉 =\n= pµ(pαxβ − pβxα)\n1\np · x\nfpim\n2\npiV‖(v, p · x) + (pβg\n⊥\nαµ − pαg\n⊥\nβµ)fpim\n2\npiV⊥(v, p · x);(A.12)\ng⊥µν is defined as\ng⊥µν = gµν −\n1\np · x\n(pµxν + pνxµ).\nTo next-to-leading conformal spin (j = 7\/2, 9\/2), the twist-3 three-particle distribution\namplitude T is given by15\nT (αu, αd, αg) = 360η3αuαdα\n2\ng{1 + ω3\n1\n2\n(7αg − 3)} .\nThe two-particle twist-3 distribution amplitudes φp and φσ in Eqs. (9) and (10) depend\non T through the equations of motions [16],16 which implies that their coefficients are not\nindependent from each other. The expansion up to NNL order (j = 3\/2, 7\/2, 9\/2) reads17\nφp(u) = 1 + {30η3 −\n5\n2\nρ2pi}C\n1\/2\n2 (ζ) + {−3η3ω3 −\n27\n20\nρ2pi −\n81\n10\nρ2pia2}C\n1\/2\n4 (ζ),\nφσ(u) = 6u(1− u)\n{\n1 + {5η3 −\n1\n2\nη3ω3 −\n7\n20\nρ2pi −\n3\n5\nρ2pia2}C\n3\/2\n2 (ζ) .\nThe two-particle twist-4 corrections gpi and A in Eq. (8) are given to NNL conformal spin\n15In the literature the notation f3pi = fpiη3 is also widely used.\n16An explicit expression for φp in terms of T is given in Ref. [41], Eq. (16).\n17At first glance it seems that φp is taken to a higher order in conformal expansion than φσ, but as\ndiscussed in the first reference of [16], φp and φσ are not pure spin projections, which means that the\ncoefficients of a given Gegenbauer polynomial contain contributions from different partial waves.\n30\n(j = 1, 3, 5) by18\ngpi(u) = 1 + {1 +\n18\n7\na2 + 60η3 +\n20\n3\nη4}C\n1\/2\n2 (ζ) + {−\n9\n28\na2 − 6η3ω3}C\n1\/2\n4 (ζ),\nA(u) = 6uu¯\n{\n16\n15\n+\n24\n35\na2 + 20η3 +\n20\n9\nη4\n+\n(\n−\n1\n15\n+\n1\n16\n−\n7\n27\nη3ω3 −\n10\n27\nη4\n)\nC\n3\/2\n2 (ξ) +\n(\n−\n11\n210\na2 −\n4\n135\nη3ω3\n)\nC\n3\/2\n4 (ξ)\n}\n+\n(\n−\n18\n5\na2 + 21η4ω4\n){\n2u3(10− 15u+ 6u2) ln u+ 2u¯3(10− 15u¯+ 6u¯2) ln u¯\n+uu¯(2 + 13uu¯)} .\nFinally the three-particle twist-4 DAs are to NL spin (j = 3, 5) given by\nA‖(α) = 120αuαdαg(a10(αd − αu)},\nV‖(α) = 120αuαdαg(v00 + v10(3αg − 1)},\nA⊥(α) = 30α\n2\ng(αu − αd)[h00 + h01αg + h10(5αg − 3)\/2},\nV⊥(α) = − 30α\n2\ng{h00αg + h01[αgαg − 6αuαd] + h10[αgαg − 3\/2(α\n2\nu + α\n2\nd)]} ,\nwhere α = 1 − α and the aij , vij and hij are related to hadronic matrix elements η4, ω4\nand a2 as\na10 =\n21\n8\nη4ω4 −\n9\n20\na2 , v10 =\n21\n8\nη4ω4 , v00 = −\n1\n3\nη4 ,\nh01 =\n7\n4\nη4ω4 −\n3\n20\na2 , h10 =\n7\n2\nη4ω4 +\n3\n20\na2 , v00 = −\n1\n3\nη4 .\nTaking everything together, we have 7 hadronic parameters {ci} = {a1, a2, a4, η3, ω3, η4, ω4}\nwhich parametrize all DAs to twist-4 and NLO in conformal spin. The ci are scale-\ndependent and are usually given at the scale 1GeV. To LO in QCD, they do not mix\nunder renormalisation, so that the scaling up to µIR =\n√\nm2B −m\n2\nb is given by\nci(µIR) = L\nγci\/β0ci(1GeV),\nwith L = αs(µIR)\/αs(1GeV), β0 = 11 − 2\/3Nf . The one-loop anomalous dimensions\nγci are given in Tab. F. Note that the anomalous dimension increases with increasing\nconformal spin, γ ∼ log j, which implies that the truncation of the conformal expansion\nbecomes the better the high the scale. The numerical values for all these parameters at\nthe scale µ = 1GeV are collected in Tab. G, taken from Ref. [16].\n18Note that, contrary to appearances, the contributions of gpi and A to (8) do not vanish for zero meson\nmass: η4 implicitly contains a factor 1\/m\n2\npi and survives in the limit m\n2\npi → 0.\n31\ntree O(αs)\ntwist 2 3 4 2 3 4\nx-particle 2 2 3 2 3 2 2 3 2 3\njL 2\n3\n2\n7\n2\n1 3 2 3\n2\n- - -\njNL 4\n7\n2\n9\n2\n3 5 4 7\n2\n- - -\njNNL 6\n9\n2\n- 5 - 6 - - - -\nTable E: Overview of the contributions included in the calculations. For the K we also\ninclude conformal spin j = 3 for twist-2 which explicitly parametrizes SU(3) flavor break-\ning.\nγan γη3 γω3 γη4 γω4\nCF\n(\n1−\n2\n(n + 1)(n+ 2)\n−\nn+1∑\nm=2\n1\nm\n)\n16\n3\nCF + CA −\n25\n6\nCF +\n7\n3\nCA\n8\n3\nCF −\n8\n3\nCF +\n10\n3\nCA\nTable F: One-loop anomalous dimensions of hadronic parameters in DAs.\nπ K η\nη3 0.015 0.015 0.013\nω3 −3 −3 −3\nη4 10 0.6 0.5\nω4 0.2 0.2 0.2\nTable G: Input parameters for twist-3 and 4 DAs, calculated from QCD sum rules. The\naccuracy is about 50%. Renormalization scale is 1 GeV.\nC Spectral Densities for f+\nThe total spectral density of Π+ is obtained as sum of all the contributions listed below,\ni.e.\nρΠ+ = ρT2 + ρT3 + ρσ + ρp + ρ\n2p\nT4 + ρ\n3p\nT4.\nρT2 is the contribution from the twist-2 DA, ρT3 from the twist-3 three-particle DA, ρσ(p)\nfrom the twist-3 two-particle DA φσ(p) and ρ\n2(3)p\nT4 from the two(three)-particle DAs of\ntwist-4. There is also one constant term, T4c, which is due to twist-4 corrections that\ncannot be expressed via a dispersion relation, so that the total Borel-transformed Π+ is\ngiven as\nBˆΠ+ =\n∫ ∞\nm2\nb\nds ρΠ+(s) e\n−s\/M2 + T4c.\n32\nρT2 =\n3 fpimb\n(q2 − s)\n7\n(m2b − q\n2) (m2b − s) (15 a4 (42m\n8\nb + q\n8 + 10 q6 s+ 20 q4 s2 + 10 q2 s3 + s4\n− 84m6b (q\n2 + s) + 28m4b (2 q\n2 + s) (q2 + 2 s)− 14m2b (q\n2 + s) (q4 + 4 q2 s+ s2)) + (q2 − s)\n2\n× (6 a2 (5m\n4\nb + q\n4 + 3 q2 s+ s2 − 5m2b (q\n2 + s)) + (q2 − s) (a0 (q\n2 − s) + 3 a1 (−2m\n2\nb + q\n2 + s))))\n+ as\n{3 a0 fpimb\ns(q2 − s)\n3\n((m2b − s) (−2m\n2\nb q\n2 + 2 q4 +m2b (4 + pi\n2) s− (1 + pi2) q2 s− 3 s2) + (m2b − q\n2)\n× (s (s−m2b) log(1−\nq2\nm2b\n)\n2\n+ s log(\ns\nm2b\n) (−2 s+ (m2b − s) log(\ns\nm2b\n)) + 2 (m2b − s) (2m\n2\nb − 5 s\n+2 s log(\ns\nm2b\n)) log(\ns\nm2b\n− 1) + 2 s (s−m2b) log(\ns\nm2b\n− 1)\n2\n− 2 (m2b − s) log(1−\nq2\nm2b\n) (m2b\n+ s+ s log(\ns\nm2b\n)− 2 s log(\ns\nm2b\n− 1))) + 2 (m2b − q\n2) (m2b − s) (Li2(\nq2\nq2 −m2b\n) + Li2(1−\nm2b\ns\n)\n+ 4Li2(1−\ns\nm2b\n))) +\na1 fpimb\ns(q2 − s)\n4\n((m2b − s) (6 q\n2 (6m4b − 6m\n2\nb q\n2 + q4) + (−2m4b (95 + 9 pi\n2)\n+ 27m2b (6 + pi\n2) q2 + (3− 9 pi2) q4) s+ (m2b (158 + 9 pi\n2)− 3 (50 + 3 pi2) q2)s2 − 13 s3) + 3 (8 (m2b − s)\n× (q2 −m2b) (2m\n2\nb − q\n2 − s) s log(\nµ2\nm2b\n) + 3 (m2b − q\n2) (m2b − s) (2m\n2\nb − q\n2 − s) s log(1−\nq2\nm2b\n)\n2\n+ s log(\ns\nm2b\n) (12m4b (q\n2 + s) + 14 q2 s (q2 + s)− 2m2b (4 q\n4 + 19 q2 s+ 7 s2)− 3 (m2b − q\n2) (m2b − s)\n× (2m2b − q\n2 − s) log(\ns\nm2b\n))− 2 (m2b − q\n2) (s−m2b) (−2m\n2\nb + q\n2 + s) (6m2b − 23 s+ 6 s log(\ns\nm2b\n))\n× log(\ns\nm2b\n− 1) + 6 (m2b − q\n2) s (s−m2b) (−2m\n2\nb + q\n2 + s) log(\ns\nm2b\n− 1)\n2\n+ 6 (m2b − q\n2)\n× (m2b − s) (2m\n2\nb − q\n2 − s) log(1−\nq2\nm2b\n) (m2b − s+ s log(\ns\nm2b\n)− 2 s log(\ns\nm2b\n− 1)))− 18 (m2b − q\n2)\n× (m2b − s) (2m\n2\nb − q\n2 − s) (Li2(\nq2\nq2 −m2b\n) + Li2(1−\nm2b\ns\n) + 4Li2(1−\ns\nm2b\n)))\n+\na2 fpimb\n4 s(q2 − s)\n5\n((m2b − s) (−24 (m\n2\nb − q\n2) q2 (30m4b − 15m\n2\nb q\n2 + q4) + (5m6b (1183 + 72 pi\n2)\n− 20m4b (407 + 36 pi\n2) q2 + 12 (5− 6 pi2) q6 + 216m2b (11 + 2 pi\n2) q4) s− (5m4b (1525 + 72 pi\n2)\n− 16m2b (575 + 36 pi\n2) q2 + 36 (73 + 6 pi2) q4 ) s2 + (m2b (2083 + 72 pi\n2)− 8 (260 + 9 pi2) q2) s3 − 61 s4)\n33\n+12 (25 (m2b − q\n2) (m2b − s) s (5m\n4\nb + q\n4 + 3 q2 s+ s2 − 5m2b (q\n2 + s)) log(\nµ2\nm2b\n)− 6 (m2b − q\n2)\n× (m2b − s) s (5m\n4\nb + q\n4 + 3 q2 s+ s2 − 5m2b (q\n2 + s)) log(1−\nq2\nm2b\n)\n2\n+ s log(\ns\nm2b\n) (−60m6b (q\n2 + s)\n+37 q2 s (q4 + 3 q2 s+ s2) + 30m4b (3 q\n4 + 8 q2 s+ 3 s2)−m2b (25 q\n6 + 237 q4 s+ 261 q2 s2 + 37 s3)\n+6 (m2b − q\n2) (m2b − s) (5m\n4\nb + q\n4 + 3 q2 s+ s2 − 5m2b (q\n2 + s)) log(\ns\nm2b\n)) + 2 (m2b − q\n2) (m2b − s)\n× (5m4b + q\n4 + 3 q2 s+ s2 − 5m2b (q\n2 + s)) (12m2b − 55 s+ 12 s log(\ns\nm2b\n)) log(\ns\nm2b\n− 1) + 12 s\n× (m2b − q\n2) (s−m2b) (5m\n4\nb + q\n4 + 3 q2 s+ s2 − 5m2b (q\n2 + s)) log(\ns\nm2b\n− 1)\n2\n− 12 (m2b − q\n2)\n× (m2b − s) (5m\n4\nb + q\n4 + 3 q2 s+ s2 − 5m2b (q\n2 + s)) log(1−\nq2\nm2b\n) (m2b − s+ s log(\ns\nm2b\n)− 2 s\n× log(\ns\nm2b\n− 1))) + 144 (m2b − q\n2) (m2b − s) (5m\n4\nb + q\n4 + 3 q2 s+ s2 − 5m2b (q\n2 + s))\n× (Li2(\nq2\nq2 −m2b\n) + Li2(1 −\nm2b\ns\n) + 4Li2(1−\ns\nm2b\n)))\n+\na4 fpimb\n10 s(q2 − s)\n7\n(−((m2b − s) (30 (m\n2\nb − q\n2) q2 (1260m8b − 1890m\n6\nb q\n2 − 105m2b q\n6 + 2 q8\n+840m4b q\n4)− (21m10b (23207 + 900 pi\n2)− 63m8b (18827 + 900 pi\n2) q2 − 700m4b (439 + 45 pi\n2) q6\n+150m2b (176 + 45 pi\n2) q8 + 30 (19− 15 pi2) q10 + 175m6b (5603 + 360 pi\n2) q4) s+ 84 (m8b\n× (13051 + 450 pi2)− 112m6b (22157 + 900 pi\n2) q2 − 800m2b (616 + 45 pi\n2) q6 + 150 (283 + 30 pi2) q8\n+525m4b (3523 + 180 pi\n2) q4) s2(−7m6b (119363 + 3600 pi\n2) + 756m4b (2131 + 75 pi\n2) q2 + 200 (848\n+45 pi2) q6 − 10125m2b (89 + 4 pi\n2) q4) s3 + (7m4b (34967 + 900 pi\n2)− 6m2b (57989 + 1800 pi\n2) q2\n+125 (1075+ 36 pi2) q4) s4 + (−2m2b (10553 + 225 pi\n2) + (21461 + 450 pi2) q2) s5 + 181 s6)) + 30\n× (91 (m2b − q\n2) (m2b − s) s (42m\n8\nb + q\n8 + 10 q6 s+ 20 q4 s2 + 10 q2 s3 + s4 − 84m6b (q\n2 + s)\n+28m4b (2 q\n2 + s) (q2 + 2 s)− 14m2b (q\n2 + s) (q4 + 4 q2 s+ s2)) log(\nµ2\nm2b\n)− 15 (m2b − q\n2) (m2b − s) s\n× (42m8b + q\n8 + 10 q6 s+ 20 q4 s2 + 10 q2 s3 + s4 − 84m6b) (q\n2 + s) + 28m4b (2 q\n2 + s) (q2 + 2 s)− 14m2b\n× (q2 + s) (q4 + 4 q2 s+ s2)) log(1−\nq2\nm2b\n)\n2\n+ s log(\ns\nm2b\n) (−1260m10b (q\n2 + s) + 630m8b (5 q\n4\n34\n+12 q2 s+ 5 s2)− 210m6b (q\n2 + s) (13 q4 + 48 q2 s+ 13 s2) + 121 q2 s (q8 + 10 q6 s+ 20 q4 s2\n+10 q2 s3 + s4) + 105m4b (9 q\n8 + 82 q6 s+ 160 q4 s2 + 82 q2 s3 + 9 s4)−m2b (91 q\n10\n+2305 q8 s+ 9400 q6 s2 + 9700 q4 s3 + 2575 q2 s4 + 121 s5) + 15 (m2b − q\n2) (m2b − s)\n× (42m8b + q\n8 + 10 q6 s+ 20 q4 s2 + 10 q2 s3 + s4 − 84m6b (q\n2 + s) + 28m4b (2 q\n2 + s) (q2 + 2 s)\n− 14m2b (q\n2 + s) (q4 + 4 q2 s+ s2)) log(\ns\nm2b\n)) + 4 (m2b − q\n2) (m2b − s) (42m\n8\nb + q\n8 + 10 q6 s\n+20 q4 s2 + 10 q2 s3 + s4 − 84m6b (q\n2 + s) + 28m4b (2 q\n2 + s) (q2 + 2 s)− 14m2b (q\n2 + s)\n× (q4 + 4 q2 s+ s2)) (15m2b − 83 s+ 15 s log(\ns\nm2b\n)) log(\ns\nm2b\n− 1) + 30 (m2b − q\n2) s (s−m2b)\n× (42m8b + q\n8 + 10 q6 s+ 20 q4 s2 + 10 q2 s3 + s4 − 84m6b (q\n2 + s) + 28m4b (2 q\n2 + s) (q2 + 2 s)\n− 14m2b (q\n2 + s) (q4 + 4 q2 s+ s2)) log(\ns\nm2b\n− 1)\n2\n− 30 (m2b − q\n2) (m2b − s) (42m\n8\nb + q\n8\n+10 q6 s+ 20 q4 s2 + 10 q2 s3 + s4 − 84m6b (q\n2 + s) + 28m4b (2 q\n2 + s) (q2 + 2 s)− 14m2b\n× (q2 + s) (q4 + 4 q2 s+ s2)) log(1−\nq2\nm2b\n) (m2b − s+ s log(\ns\nm2b\n)− 2 s log(\ns\nm2b\n− 1)))\n+900s (m2b − q\n2) (m2b − s) (42m\n8\nb + q\n8 + 10 q6 s+ 20 q4 s2 + 10 q2 s3 + s4 − 84m6b (q\n2 + s)\n+28m4b (2 q\n2 + s) (q2 + 2 s)− 14m2b (q\n2 + s) (q4 + 4 q2 s+ s2)) (Li2(\nq2\nq2 −m2b\n) + Li2(1−\nm2b\ns\n)\n+4Li2(1−\ns\nm2b\n))\n}\nρT3 =\n−15 η3 µpi\n2\n(q2 − s)\n6\n(m2b − q\n2)\n2\n(m2b − s) (2 (q\n2 − s) (−5m2b + 2 q\n2 + 3 s) + (7m4b − 6m\n2\nb q\n2 + q4 − 8m2b s\n+4 q2 s+ 2 s2)ω3)\n35\nρp =\na0µpi\n2 (3m2b s− 3 q\n2 s)\n6 (q2 − s)\n2\ns\n+\n5η3µ\n2\npi\n(q2 − s)\n4\ns\n(18m6b s− 36m\n4\nb q\n2 s− 3 q6 s+ 21m2b q\n4 s− 18m4b s\n2\n+30m2b q\n2 s2 − 12 q4 s2 + 3m2b s\n3 − 3 q2 s3) + as\n{ a0 µpi2\n6 (q2 − s)\n2\ns\n((q2 + s) (s− 3m2b)\n− 3 (m2b − 4 q\n2) s log(\nq2\nm2b\n)\n2\n− 18 s (3m2b − 3 q\n2 + s) log(1−\nq2\nm2b\n)\n2\n(m2b − 4 q\n2) s log(\nq2\nm2b\n)\n× (log(1−\nq2\nm2b\n)− log(\ns− q2\nm2b\n)) + 6 log(1−\nq2\nm2b\n) (m2b q\n2 + 3m2b s− q\n2 s+ s ((2m2b − 3 q\n2)\n× log(\nµ2\nm2b\n) + q2 log(\ns\nm2b\n)(m2b + q\n2 + s) log(\ns− q2\nm2b\n)− (m2b − 2 q\n2) log(\ns\nm2b\n− 1))) + 3 (m2b s\n× log(\ns\nm2b\n)\n2\n− log(\ns− q2\nm2b\n)\n2\ns (5 q2 + s) + log(\ns\nm2b\n) (2m2b q\n2 +m2b s− 3 q\n2 s− 4 q2 s log(\ns\nm2b\n− 1))\n+2 log(\ns− q2\nm2b\n) (2 q2 s−m2b (q\n2 + s)− s (2m2b − 3 q\n2 + s) log(\nµ2\nm2b\n) + s (3m2b − 2 q\n2 + 2 s)\n× log(\ns\nm2b\n− 1)) + 2 log(\ns\nm2b\n− 1) (2 q2 s−m2b (q\n2 + 4 s) + s (s log(\nµ2\nm2b\n)− (m2b + 2 s) log(\ns\nm2b\n− 1))))\n+6 s (m2b Li2(\nq2\nq2 −m2b\n) + (2m2b − 3 q\n2 + s) Li2(1 −\nq2\nm2b\n) +m2b Li2(1−\nm2b\ns\n)− (m2b + q\n2 + s)\n×Li2(1−\nq2\ns\n)− (5 q2 + s)Li2(\nm2b − s\nm2b − q\n2\n)− (m2b + q\n2 + s) Li2(\nm2b − s\nq2 − s\n)− (m2b + q\n2 + s)\n×Li2(\n(q2 −m2b) s\nm2b (q\n2 − s)\n) + (2m2b − 3 q\n2 + s) Li2(\nm2b − q\n2\ns− q2\n) + 2 (m2b − q\n2) Li2(1−\ns\nm2b\n) + (m2b − 4 q\n2)\n×Li2(1−\ns\nq2\n)))6 (q2 − s)\n2\ns+\n5 η3 µpi\n2\n(q2 − s)\n4\ns\n(−3m2b (q\n2 − 12m2b) q\n4 − 6m6b (pi\n2 − 47) s− 18m4b (24\n+pi2) q2 s+ (3 + 2 pi2) q6 s+ 3m2b (8 pi\n2 − 17) q4 s+ 6m4b (pi\n2 − 60) s2 + 3m2b (205 + 6 pi\n2) q2 s2\n− (3 + 26 pi2) q4 s2 + 69m2b s\n3 − (147 + 2 pi2) q2 s3 + (−9 + 2 pi2) s4 + 3 (m2b − 4 q\n2) (q2 − s)\n2\ns log(\nq2\nm2b\n)\n2\n+6 (m2b − 4 q\n2) (q2 − s)\n2\ns log(\nq2\nm2b\n) (log(1−\nq2\nm2b\n)− log(\ns− q2\nm2b\n)) + 6 s log(\nµ2\nm2b\n) (15m6b − 15m\n4\nb (2 q\n2 + s)\n− 3 q2 s (q2 + 4 s) +m2b (9 q\n4 + 30 q2 s+ 6 s2) + (6m6b − 6m\n4\nb s− 3 q\n2 (q4 − 4 q2 s+ s2) +m2b (−4 q\n4 − 4 q2 s\n36\n+2 s2)) log(1−\nq2\nm2b\n)− (q2 − s)\n2\n(2m2b − 3 q\n2 + s) log(\ns− q2\nm2b\n) + (−6m6b + 6m\n2\nb q\n4 + 6m4b s+ s (−5 q\n4\n− 2 q2 s+ s2) ) log(\ns\nm2b\n− 1)) + 3 (−(s (6m6b − (q\n2 − s)\n2\n(3 q2 − s)− 6m4b (q\n2 + s) + 3m2b (q\n4 + s2))\n− log(1−\nq2\nm2b\n)\n2\n) +m2b s (6m\n4\nb + q\n4 + 4 q2 s+ s26m2b (q\n2 + s)) log(\ns\nm2b\n)\n2\n− (q2 − s)\n2\nlog(\ns− q2\nm2b\n)\n× (2 (−2 q2 s+m2b (q\n2 + s)) + s (5 q2 + s) log(\ns− q2\nm2b\n))2 (6m6b (2 q\n2 + 9 s)− 6m4b (2 q\n4 + 18 q2 s+ 9 s2)\n− 2 q2 s (q4 + 7 q2 s+ 13 s2) +m2b (q\n6 + 44 q4 s+ 89 q2 s2 + 16 s3)(−3m2b + 2 q\n2 − 2 s) (q2 − s)\n2\ns\n× log(\ns− q2\nm2b\n)) log(\ns\nm2b\n− 1)− 2 s (−6m6b − 6m\n4\nb (q\n2 − s) + 2 s (−5 q4 − 2 q2 s+ s2)m2b (13 q\n4 + 4 q2 s\n+ s2)) log(\ns\nm2b\n− 1)\n2\n+ log(\ns\nm2b\n) (−12m4b s\n2 − 3 q2 s (q2 + 3 s)\n2\n+m2b (2 q\n6 + 21 q4 s+ 12 q2 s2 + 13 s3)\n− 4 q2 s (6m4b + q\n4 + 4 q2 s+ s2 − 6m2b (q\n2 + s)) log(\ns\nm2b\n− 1)) + 2 log(1−\nq2\nm2b\n) (6m6b (q\n2 + 2 s)\n− q2 s (q4 − 8 q2 s+ s2)− 6m4b (q\n4 + 2 q2 s+ 2 s2) +m2b (q\n6 + q4 s+ q2 s2 + 3 s3) + s (q2 (6m4b + q\n4\n+4 q2 s+ s2 − 6m2b (q\n2 + s)) log(\ns\nm2b\n) + (q2 − s)\n2\n(m2b + q\n2 + s) log(\ns− q2\nm2b\n) + (−12m4b q\n2 +m2b (11 q\n4\n+14 q2 s− s2) + 2 q2 (q4 − 8 q2 s+ s2)) log(\ns\nm2b\n− 1)))) + 6 s (m2b (6m\n4\nb + q\n4 + 4 q2 s+ s2 − 6m2b\n× (q2 + s)) Li2(\nq2\nq2 −m2b\n) + (q2 − s)\n2\n(2m2b − 3 q\n2 + s) Li2(1−\nq2\nm2b\n) +m2b (6m\n4\nb + q\n4 + 4 q2 s+ s2\n− 6m2b (q\n2 + s)) Li2(1−\nm2b\ns\n)(q2 − s)\n2\n(m2b + q\n2 + s) Li2(1−\nq2\ns\n)− (q2 − s)\n2\n(5 q2 + s) Li2(\nm2b − s\nm2b − q\n2\n)\n− (q2 − s)\n2\n(m2b + q\n2 + s) Li2(\nm2b − s\nq2 − s\n)− (q2 − s)\n2\n(m2b + q\n2 + s) Li2(\n(q2 −m2b) s\nm2b (q\n2 − s)\n) + (q2 − s)\n2\n(2m2b\n− 3 q2 + s) Li2(\nm2b − q\n2\ns− q2\n) + 2 (m2b − q\n2) (6m4b + q\n4 + 4 q2 s+ s2 − 6m2b (q\n2 + s)) Li2(1−\ns\nm2b\n) + (m2b\n− 4 q2) (q2 − s)\n2\nLi2(1−\ns\nq2\n))\n}\n37\nρσ =\nµ2pi\n2 (q2 − s)5\n(a0 (q\n2 − s)\n2\n(−(m2b (3 q\n2 + s)) + q2 (q2 + 3 s))− 30 η3 (10m\n8\nb + 10m\n6\nb (q\n2 − s)\n− 30m4b q\n2 (q2 + s) +m2b (13 q\n6 + 45 q4 s+ 21 q2 s2 + s3)− q2 (q6 + 11 q4 s+ 15 q2 s2 + 3 s3)))\n+ as\n{ a0 µpi2\n6 (q2 − s)\n3\ns\n(3m2b q\n4 + q2 (−4m2b (−9 + pi\n2) + (−3 + 2 pi2) q2) s+ (m2b (21− 4 pi\n2)\n+ 4 (−15 + pi2) q2) s2 + (3 + 2 pi2) s3 + 6 s (−4 q2 s+m2b (3 q\n2 + s)) log(1−\nq2\nm2b\n)\n2\n+ 6 s log(\nµ2\nm2b\n)\n× (3 (−2 q2 s+m2b (q\n2 + s)) + (q2 − s) (−((m2b + q\n2) log(1−\nq2\nm2b\n))− (m2b + q\n2 + s) log(\nm2b − s\nq2 − s\n)\n− (m2b − 4 q\n2) log(\nm2b − q\n2\ns− q2\n) + (m2b + q\n2) log(\ns\nm2b\n− 1))) + 3 (−2 (q2 − s) s (m2b + q\n2 + s) log(\ns\nm2b\n)\n2\n+2 (q2 − s) log(\nm2b − s\nq2 − s\n) (−(m2b (q\n2 + 2 s)) + s (m2b + q\n2 + s) log(\ns− q2\nm2b\n)) + (q2 − s) s ((m2b\n+ q2 + s) log(\nm2b − q\n2\ns− q2\n)\n2\n− (m2b + q\n2 + s) log(\n(m2b − q\n2) s\nm2b (s− q\n2)\n)\n2\n− 2 (m2b + q\n2 + s) log(\n(m2b − q\n2) s\nm2b (s− q\n2)\n)\n× log(\ns− q2\nm2b\n) + 2 (2m2b − 3 q\n2 + s) log(\ns− q2\nm2b\n)\n2\n+ 2 log(\nm2b − q\n2\ns− q2\n) (−3m2b + 6 q\n2 + (2m2b\n− 3 q2 + s) log(\ns− q2\nm2b\n)))− 2 (4m4b (q\n2 + s) + 2 q2 s (q2 + 3 s)− 2m2b q\n2 (q2 + 7 s) + (q2 − s) s\n× (5m2b − 5 q\n2 + 3 s) log(\ns− q2\nm2b\n)) log(\ns\nm2b\n− 1) + 2 s (−2 s (q2 + s) +m2b (3 q\n2 + s)) log(\ns\nm2b\n− 1)\n2\n+ log(\ns\nm2b\n) (q2 s (3 q2 + s)−m2b (q\n2 − s) (2 q2 + 5 s)− 2 (q2 − s) s (m2b + q\n2 + s) (log(\nm2b − q\n2\ns− q2\n)\n− log(\n(m2b − q\n2) s\nm2b (s− q\n2)\n)− log(\ns− q2\nm2b\n)) + 2 s (−5m2b q\n2 + q4 − 3m2b s+ 6 q\n2 s+ s2) log(\ns\nm2b\n− 1)))\n+ 6 log(1−\nq2\nm2b\n) (−(q2 (q2 − 7 s) s) + 2m4b (q\n2 + 2 s)−m2b (q\n4 + 9 q2 s+ 2 s2) + s ((4 q2 s−m2b (3 q\n2\n+ s)) log(\nq2\nm2b\n) + (2m2b (q\n2 + s)− q2 (q2 + 3 s)) log(\ns\nm2b\n) + (q2 − s) (−((m2b + q\n2 + s) (log(\nm2b − q\n2\ns− q2\n)\n− log(\n(m2b − q\n2) s\nm2b (s− q\n2)\n))) − (m2b − 4 q\n2) log(\ns− q2\nm2b\n))− 2 (q2 (3 q2 − 7 s) +m2b (q\n2 + 3 s)) log(\ns\nm2b\n− 1)))\n+ 6 s ((4 q2 s−m2b (3 q\n2 + s)) Li2(1−\nq2\nm2b\n)− (m2b − 4 q\n2) (q2 − s) (2 Li2(\nm2b − s\nm2b − q\n2\n) + Li2(\nm2b − s\nq2 − s\n)\n38\n−Li2(\nq2 (m2b − s)\nm2b (q\n2 − s)\n))− (3m2b (3 q\n2 + s)− (q2 + s) (5 q2 + s) ) Li2(1−\ns\nm2b\n))) +\n5 η3 µpi\n2\n6 (q2 − s)\n5\ns\n(18m2b q\n4\n× (40m4b − 40m\n2\nb q\n2 + q4) + (5m8b (−359 + 24 pi\n2)− 30m6b (127 + 16 pi\n2) q2 + 30m4b (129 + 20 pi\n2) q4\n+24m2b (40− 11 pi\n2) q6 + 6 (−3 + 2 pi2) q8) s+ 2 (5m6b (295− 36 pi\n2) + 30m4b (129 + 16 pi\n2) q2 − 6m2b\n× (609 + 68 pi2) q4 + 6 (−27 + 20 pi2) q6) s2 + 6 (5m4b (−25 + 8 pi\n2)− 19m2b (39 + 4 pi\n2) q2 + 9 (55\n+4 pi2) q4) s3 − 4 (m2b (71 + 6 pi\n2)− 66 q2) s4 + (−37 + 12 pi2) s5 + 36 s (10m8b − 10m\n6\nb s− 10m\n4\nb q\n2\n× (q2 + 2 s)− 4 q2 s (q4 + 3 q2 s+ s2) +m2b (3 q\n6 + 25 q4 s+ 21 q2 s2 + s3)) log(1−\nq2\nm2b\n)\n2\n+ 12 s\n× log(\nµ2\nm2b\n) (−(m2b (5m\n2\nb − 2 q\n2) (5m4b + 20m\n2\nb q\n2 − 28 q4)) + (40m6b + 135m\n4\nb q\n2 − 249m2b q\n4 + 47 q6) s\n− 3 (5m4b + 18m\n2\nb q\n2 − 32 q4) s2 + 9 (m2b − 2 q\n2) s3 − 3 (10m8b − 20m\n6\nb (q\n2 + s) + 10m4b (q\n2 + s)\n× (2 q2 + s) + q2 (q6 + 7 q4 s+ 3 q2 s2 − s3)−m2b (9 q\n6 + 23 q4 s+ 7 q2 s2 + s3)) log(1−\nq2\nm2b\n)\n+3 (q2 − s)\n3\n(−((m2b + q\n2 + s) log(\nm2b − s\nq2 − s\n))− (m2b − 4 q\n2) log(\nm2b − q\n2\ns− q2\n)) + 3 (10m8b − 20m\n6\nb (q\n2 + s)\n+10m4b (q\n2 + s) (2 q2 + s) + q2 (q6 + 7 q4 s+ 3 q2 s2 − s3)−m2b (9 q\n6 + 23 q4 s+ 7 q2 s2 + s3))\n× log(\ns\nm2b\n− 1)) + 36 log(1 −\nq2\nm2b\n) (20m8b q\n2 − 10m6b q\n2 (3 q2 + 5 s) + 2m4b (q\n2 + 2 s) (6 q4 + 13 q2 s\n+ s2)− q2 s (q6 + q4 s− 15 q2 s2 − 7 s3)−m2b (q\n8 + 7 q6 s+ 35 q4 s2 + 35 q2 s3 + 2 s4) + s ((−10m8b\n+10m6b s+ 10m\n4\nb q\n2 (q2 + 2 s) + 4 q2 s (q4 + 3 q2 s+ s2)−m2b (3 q\n6 + 25 q4 s+ 21 q2 s2 + s3)) log(\nq2\nm2b\n)\n+ (10m6b (2 q\n2 + s)− 10m4b (3 q\n4 + 5 q2 s+ s2) + 2m2b (6 q\n6 + 24 q4 s+ 14 q2 s2 + s3)− q2 (q6 + 11 q4 s\n+15 q2 s2 + 3 s3)) log(\ns\nm2b\n) + (q2 − s)\n3\n(−((m2b + q\n2 + s) (log(\nm2b − q\n2\ns− q2\n)− log(\n(m2b − q\n2) s\nm2b (s− q\n2)\n)))− (m2b\n− 4 q2) log(\ns− q2\nm2b\n))− 2 (10m6b (2 q\n2 + s)− 10m4b (3 q\n4 + 5 q2 s+ s2) + q2 (3 q6 − 23 q4 s− 3 q2 s2 − 7 s3)\n+m2b (11 q\n6 + 51 q4 s+ 25 q2 s2 + 3 s3)) log(\ns\nm2b\n− 1))) + 6 (−6 (q2 − s)\n3\ns (m2b + q\n2 + s) log(\ns\nm2b\n)\n2\n+6 (q2 − s)\n3\nlog(\nm2b − s\nq2 − s\n) (−(m2b (q\n2 + 2 s)) + s (m2b + q\n2 + s) log(\ns− q2\nm2b\n)) + 3 (q2 − s)\n3\ns ((m2b + q\n2 + s)\n39\n×log(\nm2b − q\n2\ns− q2\n)\n2\n− (m2b + q\n2 + s) log(\n(m2b − q\n2) s\nm2b (s− q\n2)\n)\n2\n− 2 (m2b + q\n2 + s) log(\n(m2b − q\n2) s\nm2b (s− q\n2)\n) log(\ns− q2\nm2b\n)\n+ 2 (2m2b − 3 q\n2 + s) log(\ns− q2\nm2b\n)\n2\n+ 2 log(\nm2b − q\n2\ns− q2\n) (−3m2b + 6 q\n2 + (2m2b − 3 q\n2 + s) log(\ns− q2\nm2b\n)))\n+ 2 (m8b (−120 q\n2 + 170 s) + 20m6b (9 q\n4 + 24 q2 s− 10 s2)− 6m4b (12 q\n6 + 148 q4 s+ 123 q2 s2 − 3 s3)\n− 2 q2 s (3 q6 + 98 q4 s+ 195 q2 s2 + 9 s3) + 2m2b q\n2 (3 q6 + 140 q4 s+ 531 q2 s2 + 216 s3) + 3 s (s− q2)\n3\n× (5m2b − 5 q\n2 + 3 s) log(\ns− q2\nm2b\n)) log(\ns\nm2b\n− 1)− 6 s (10m8b − 10m\n6\nb (4 q\n2 + 3 s) + 2 s (q2 + s)\n× (11 q4 − 2 q2 s+ s2) + 10m4b (5 q\n4 + 8 q2 s+ 2 s2)−m2b (23 q\n6 + 65 q4 s+ 41 q2 s2 + s3)) log(\ns\nm2b\n− 1)\n2\n+ log(\ns\nm2b\n) (−6m2b q\n8 + q4 (120m4b − 157m\n2\nb q\n2 + 9 q4) s+ (60m6b + 60m\n4\nb q\n2 − 243m2b q\n4 + 205 q6) s2\n− 3 (10m4b + 43m\n2\nb q\n2 − 121 q4) s3 + 3 (5m2b + q\n2) s4 − 6 (q2 − s)\n3\ns (m2b + q\n2 + s) (log(\nm2b − q\n2\ns− q2\n)\n− log(\n(m2b − q\n2) s\nm2b (s− q\n2)\n)− log(\ns− q2\nm2b\n)) + 6 s (q8 + 24 q6 s+ 30 q4 s2 + 4 q2 s3 + s4 − 20m6b (2 q\n2 + s)\n+ 20m4b (3 q\n4 + 5 q2 s+ s2)−m2b (25 q\n6 + 93 q4 s+ 59 q2 s2 + 3 s3)) log(\ns\nm2b\n− 1))) + 36 s ((−10m8b\n+10m6b s+ 10m\n4\nb q\n2 (q2 + 2 s) + 4 q2 s (q4 + 3 q2 s+ s2)−m2b (3 q\n6 + 25 q4 s+ 21 q2 s2 + s3)) Li2(1 −\nq2\nm2b\n)\n− (m2b − 4 q\n2) (q2 − s)\n3\n(2 Li2(\nm2b − s\nm2b − q\n2\n) + Li2(\nm2b − s\nq2 − s\n)− Li2(\nq2 (m2b − s)\nm2b (q\n2 − s)\n))− (10m8b − 5 q\n8 − 16 q6 s\n− 54 q4 s2 − 4 q2 s3 − s4 + 10m6b (4 q\n2 + s)− 10m4b (7 q\n4 + 12 q2 s+ 2 s2) +m2b (29 q\n6 + 115 q4 s+ 83 q2 s2\n+3 s3)) Li2(1−\ns\nm2b\n))\n}\nρ2p\nT4\n=\nfpimb µ\n2\npi\n120 (q2 − s)\n7\n(27 a2 (2880m\n10\nb − 25m\n8\nb (215 q\n2 + 229 s) + 20m6b (149 q\n4 + 447 q2 s+ 184 s2)\n− 10m4b (38 q\n6 + 352 q4 s+ 427 q2 s2 + 83 s3) + 5 q2 (q8 + 17 q6 s+ 42 q4 s2 + 22 q2 s3 + 2 s4)\n+m2b (−76 q\n8 + 84 q6 s+ 584 q4 s2 + 584 q2 s3 + 24 s4)) + 5 (16128 η3m\n10\nb ω3 − 2520 η3m\n8\nb (15 q\n2\n+13 s)ω3 + 8 q\n2 ((3 + 90 η3 + 10 η4) (q\n2 − s)\n2\n(q4 + 5 q2 s+ 2 s2)− 9 η3 (q\n8 + 17 q6 s+ 42 q4 s2\n40\n+22 q2 s3 + 2 s4)ω3) + 3m\n2\nb (20 q\n4 s2 (3 − 16 η4 + 144 (η3 + 2 η3 ω3)) + q\n6 s (69 + 320 η4 + 240 η3 (6 + 19ω3)\n− 420 η4 ω4) + 3 q\n2 s3 (−9 + 240 η3 (−2 + 3ω3)− 140 η4 ω4) + 5 q\n8 (−15− 16 η4 + 144 η3 (−3 + ω3) + 84 η4 ω4)\n+ s4 (−27 + 80 η4 + 240 η3 (−3 + ω3) + 420 η4 ω4)) + 5m\n6\nb (s\n2 (−33 + 352 η4 + 144 η3 (−8 + 33ω3) + 756 η4 ω4)\n+ q4 (−33 + 352 η4 + 144 η3 (−8 + 47ω3) + 756 η4 ω4) + 2 q\n2 s (33 + 576 η3 (2 + 11ω3)− 4 η4 (88 + 189ω4)))\n+ 3m4b (−15 q\n2 s2 (1 + 48 (η3 + 16 η3 ω3)− 12 η4 (4 + 7ω4))− 3 q\n4 s (53 + 1680 (η3 + 3 η3 ω3)− 20 η4 (4 + 21ω4))\n+ q6 (111 + 240 η3 (15− 19ω3)− 20 η4 (20 + 63ω4)) + s\n3 (240 η3 (9− 10ω3)− 7 (−9 + 20 η4 (4 + 9ω4)))))\n+ 1080m2b (m\n2\nb − q\n2) (m2b − s) (2m\n2\nb − q\n2 − s) (q2 − s) (6 a2 − 35 η4 ω4) (− log(\nm2b − s\nq2 − s\n) + log(\nm2b − q\n2\ns− q2\n)))\nρ3p\nT4\n=\n−fpimb µ\n2\npi\n24 (q2 − s)\n6\n(m2b − q\n2) (80 η4 (q\n2 − s) (−8m4b + q\n4 − 3 q2 s− 6 s2 +m2b (q\n2 + 15 s)) + 27 a2 (45m\n6\nb + q\n6 − 4 q4 s\n− 30 q2 s2 − 12 s3 − 5m4b (7 q\n2 + 20 s) +m2b (q\n4 + 68 q2 s+ 66 s2)))\nT4c=\n−fpim\n2\nb mb µ\n2\npi\n160(m2b − q\n2)\n2\ne\n−m\n2\nb\nM2 (12 a2 + 5 (−25 + 48 η3 (−10 + ω3)))\nReferences\n[1] V.M. Belyaev, A. Khodjamirian and R. Ru¨ckl, Z. Phys. C 60 (1993) 349 [hep-\nph\/9305348];\nA. Khodjamirian et al., Phys. Lett. B 410 (1997) 275 [hep-ph\/9706303];\nE. Bagan, P. Ball and V.M. Braun, Phys. Lett. B 417 (1998) 154 [hep-ph\/9709243];\nA. Khodjamirian et al., Phys. Rev. D 62 114002 (2000) [hep-ph\/0001297].\n[2] P. Ball and V. M. Braun, Phys. Rev. D 58 (1998) 094016 [arXiv:hep-ph\/9805422].\n[3] P. Ball, JHEP 9809 (1998) 005 [hep-ph\/9802394].\n[4] P. Ball and R. Zwicky, JHEP 0110 (2001) 019 [arXiv:hep-ph\/0110115].\n[5] V.M. Belyaev et al., Phys. Rev. D 51 (1995) 6177 [hep-ph\/9410280];\nA. Khodjamirian et al., Phys. Lett. B 457 (1999) 245 [hep-ph\/9903421].\n[6] P. Colangelo and A. Khodjamirian, hep-ph\/0010175;\nA. Khodjamirian, hep-ph\/0108205.\n[7] 2nd Workshop on the CKM Unitarity Triangle, Durham, England, Apr 2003. Pro-\nceedings published as eConf C0304052.\n[8] T. Onogi, Talk at 2nd Workshop on the CKM Unitarity Triangle, arXiv:hep-\nph\/0309225, and references therein.\n41\n[9] H. Li, hep–ph\/0103305, and references therein;\nM. Beneke et al., Phys. Rev. Lett. 83 (1999) 1914 [hep-ph\/9905312]; Nucl. Phys. B\n606 (2001) 245 [hep-ph\/0104110].\n[10] C.H. Davies, talk at UK BaBar meeting, Durham April 2004.\n[11] J. Shigemitsu et al., Nucl. Phys. Proc. Suppl. 129-130 (2004) 331 [arXiv:hep-\nlat\/0309039].\n[12] V. L. Chernyak and A. R. Zhitnitsky, JETP Lett. 25 (1977) 510 [Pisma Zh. Eksp.\nTeor. Fiz. 25 (1977) 544];\nSov. J. Nucl. Phys. 31 (1980) 544 [Yad. Fiz. 31 (1980) 1053];\nA.V. Efremov and A.V. Radyushkin, Phys. Lett. B 94 (1980) 245; Theor. Math.\nPhys. 42 (1980) 97 [Teor. Mat. Fiz. 42 (1980) 147];\nG.P. Lepage and S.J. Brodsky, Phys. Lett. B 87 (1979) 359; Phys. Rev. D 22 (1980)\n2157;\nV.L. Chernyak, A.R. Zhitnitsky and V.G. Serbo, JETP Lett. 26 (1977) 594 [Pisma\nZh. Eksp. Teor. Fiz. 26 (1977) 760]; Sov. J. Nucl. Phys. 31 (1980) 552 [Yad. Fiz. 31\n(1980) 1069].\n[13] C. W. Bauer et al., Phys. Rev. D 63 (2001) 114020 [arXiv:hep-ph\/0011336].\n[14] C.W. Bauer, D. Pirjol and I.W. Stewart, Phys. Rev. D 67 (2003) 071502 [arXiv:hep-\nph\/0211069].\n[15] M.A. Shifman, A.I. Vainshtein and V.I. Zakharov, Nucl. Phys. B 147 (1979) 385;\nibd. 147 (1979) 448.\n[16] V. M. Braun and I. E. Filyanov, Z. Phys. C 44, 157 (1989) [Sov. J. Nucl. Phys. 50];\nP. Ball, JHEP 9901 (1999) 010 [hep-ph\/9812375].\n[17] A. Szczepaniak, E. M. Henley and S. J. Brodsky, Phys. Lett. B 243 (1990) 287.\n[18] E. Braaten, Phys. Rev. D 28 (1983) 524.\n[19] A. S. Kronfeld, Nucl. Phys. Proc. Suppl. 129 (2004) 46 [arXiv:hep-lat\/0310063].\n[20] For instance, T. M. Aliev and V. L. Eletsky, Sov. J. Nucl. Phys. 38 (1983) 936 [Yad.\nFiz. 38 (1983) 1537];\nE. Bagan et al., Phys. Lett. B 278 (1992) 457.\n[21] A. A. Penin and M. Steinhauser, Phys. Rev. D 65, 054006 (2002) [arXiv:hep-\nph\/0108110];\nM. Jamin and B. O. Lange, Phys. Rev. D 65, 056005 (2002) [arXiv:hep-ph\/0108135].\n[22] V. L. Chernyak and A. R. Zhitnitsky, Phys. Rept. 112 (1984) 173.\n[23] V. M. Braun and I. E. Filyanov, Z. Phys. C 44 (1989) 157 [Sov. J. Nucl. Phys. 50\n(1989) 511].\n[24] S. V. Mikhailov and A. V. Radyushkin, Phys. Rev. D 45 (1992) 1754.\n42\n[25] A. P. Bakulev, S. V. Mikhailov and N. G. Stefanis, arXiv:hep-ph\/0405062.\n[26] G. Martinelli and C. T. Sachrajda, Phys. Lett. B 190 (1987) 151;\nT. A. DeGrand and R. D. Loft, Phys. Rev. D 38 (1988) 954;\nD. Daniel, R. Gupta and D. G. Richards, Phys. Rev. D 43 (1991) 3715.\n[27] L. Del Debbio et al. [UKQCD collaboration], Nucl. Phys. Proc. Suppl. 83 (2000) 235\n[arXiv:hep-lat\/9909147];\nL. Del Debbio, M. Di Pierro and A. Dougall, Nucl. Phys. Proc. Suppl. 119 (2003)\n416 [arXiv:hep-lat\/0211037].\n[28] J. Bijnens and A. Khodjamirian, Eur. Phys. J. C 26 (2002) 67 [arXiv:hep-\nph\/0206252].\n[29] A. Khodjamirian, Eur. Phys. J. C 6 (1999) 477 [arXiv:hep-ph\/9712451].\n[30] A. Schmedding and O. Yakovlev, Phys. Rev. D 62 (2000) 116002 [hep-ph\/9905392].\n[31] A. P. Bakulev, S. V. Mikhailov and N. G. Stefanis, Phys. Rev. D 67 (2003) 074012\n[arXiv:hep-ph\/0212250]; Phys. Lett. B 578 (2004) 91 [arXiv:hep-ph\/0303039].\n[32] V.M. Braun, A. Khodjamirian and M. Maul, Phys. Rev. D 61 (2000) 073004 [hep-\nph\/9907495].\n[33] P. Ball and M. Boglione, Phys. Rev. D 68 (2003) 094006 [arXiv:hep-ph\/0307337].\n[34] J. Charles et al., Phys. Rev. D 60 (1999) 014001 [arXiv:hep-ph\/9812358].\n[35] D. Becirevic and A. B. Kaidalov, Phys. Lett. B 478 (2000) 417 [arXiv:hep-\nph\/9904490].\n[36] A. Abada et al, JHEP 0402 (2004) 016 [arXiv:hep-lat\/0310050].\n[37] A. Khodjamirian, AIP Conf. Proc. 602 (2001) 194 [arXiv:hep-ph\/0108205].\n[38] D. Becirevic et al., JHEP 0301 (2003) 009 [arXiv:hep-ph\/0212177].\n[39] M. B. Voloshin, Sov. J. Nucl. Phys. 50 (1989) 105 [Yad. Fiz. 50 (1989) 166].\n[40] W. A. Bardeen, E. J. Eichten and C. T. Hill, Phys. Rev. D 68 (2003) 054024\n[arXiv:hep-ph\/0305049].\n[41] P. Ball, arXiv:hep-ph\/0308249.\n[42] D. Becirevic, arXiv:hep-ph\/0211340.\n43\n"}