{"doi":"10.1088\/0305-4470","coreId":"70931","oai":"oai:eprints.lancs.ac.uk:9405","identifiers":["oai:eprints.lancs.ac.uk:9405","10.1088\/0305-4470"],"title":"A crisis in the dissipative Fermi accelerator model","authors":["Leonel, Edson D.","McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-06-10","abstract":"The dynamics of the full, dissipative, Fermi accelerator model is shown to exhibit crisis events as the damping coefficient is varied. The investigation, based on analysis of a two-dimensional nonlinear map, has also led to a numerical determination of the basin of attraction for its chaotic attracto","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70931.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/9405\/1\/crisisPostPrint.pdf","pdfHashValue":"bf743b966a3bafbdc43e0686501578e5c9b59c19","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:9405<\/identifier><datestamp>\n      2018-01-24T03:21:45Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A crisis in the dissipative Fermi accelerator model<\/dc:title><dc:creator>\n        Leonel, Edson D.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        The dynamics of the full, dissipative, Fermi accelerator model is shown to exhibit crisis events as the damping coefficient is varied. The investigation, based on analysis of a two-dimensional nonlinear map, has also led to a numerical determination of the basin of attraction for its chaotic attractor<\/dc:description><dc:date>\n        2005-06-10<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/9405\/1\/crisisPostPrint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1088\/0305-4470\/38\/23\/L02<\/dc:relation><dc:identifier>\n        Leonel, Edson D. and McClintock, Peter V. E. (2005) A crisis in the dissipative Fermi accelerator model. Journal of Physics -London- a Mathematical and General, 38 (23). L425-L430. ISSN 0305-4470<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/9405\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1088\/0305-4470\/38\/23\/L02","http:\/\/eprints.lancs.ac.uk\/9405\/"],"year":2005,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"LETTER\nA crisis in the dissipative Fermi accelerator model\nEdson D. Leonel and P.V.E. McClintock\nDepartment of Physics, Lancaster University, Lancaster, LA1 4YB, UK\nAbstract. The dynamics of the full, dissipative, Fermi accelerator model is shown to\nexhibit crisis events as the damping coefficient is varied. The investigation, based on\nanalysis of a two-dimensional nonlinear map, has also led to a numerical determination\nof the basin of attraction for its chaotic attractor.\nSubmitted to: J. Phys. A: Math. Gen.\nA major challenge in the investigation of nonlinear systems is that of explain-\ning\/predicting the often unexpected phenomena that they exhibit. A closely related\ngoal is to characterise their dynamical properties. Chaotic behaviour appears quite fre-\nquently in such systems, both in the presence and the absence of dissipation [1, 2, 3].\nFor the dissipative case, the area-contracting property leads to time evolution of ini-\ntial conditions towards a range of different asymptotic behaviours, e.g. fixed points,\nlimit cycles (sometimes of high order) as well as chaotic attractors. There also exist\nsystems with more than one chaotic attractor [4] where interest frequently centres on\ndetermination of the basins of attraction for each chaotic attractor, whose boundaries\ncan be either continuous or fractal. Particular cases can also be observed where the\nasymptotic behaviour wanders in an erratic way but is not characterised by a positive\nLyapunov exponent (the commonest tool for classification of the behaviour as chaotic)\n[5]. For the non-dissipative case, the characteristic structure of Hamiltonian systems is\nobserved, often with a mixed phase space structure is commonly present in the sense\nthat Kolmogorov-Arnol’d-Moser (KAM) islands exist, together with invariant spanning\ncurves separating different portions of the phase space, and chaotic seas [6, 7, 8, 9].\nThe tools developed to study both the dissipative and non-dissipative cases are widely\napplicable in many different fields of physics, including astrophysics, plasma physics,\nfluids, accelerators, and planetary motion.\nIn this Letter we revisit the classical problem of the bouncing ball, a model originally\nproposed by Enrico Fermi [10] in an attempt to describe the acceleration of cosmic\nrays. It provides a mechanism through which charged particles can be accelerated by\ncollisions with moving magnetic field structures. The model was later modified and\nstudied in different variants. The Fermi-Ulam approach [11] considers the dynamics\nof a classical particle bouncing between two rigid walls, one of which is fixed and\nPublished in J. Phys. A Math. Gen. 38, L425-L430 (2005).\nA crisis in the dissipative Fermi accelerator model 2\nthe other moves in time. The main result for periodic oscillation is that the phase\nspace presents KAM islands surrounded by a chaotic sea. Unlimited energy growth (i.e.\nthe condition for observing Fermi acceleration) is not, however, observed because the\nphase space exhibits a set of invariant spanning curves. An alternative version of this\nmodel proposed by Pustylnikov [12], often referred to as a bouncer [13], consists of a\nclassical particle falling in a constant gravitational field, on a moving platform. Its most\nimportant property is that, in contradistinction to the Fermi-Ulam model, depending\non both the initial conditions and control parameters, there could be no bound to the\nenergy gained by the bouncing particle. The distinctive difference between the models\nwas later clarified by Lichtenberg et. al. [14]. The corresponding quantum versions of\nboth the bouncer and Fermi-Ulam models have also been studied [15, 16, 17, 18, 19].\nRecently, we have proposed a hybrid version of these two models [20]. It considers the\nmotion of a classical particle in a gravitational field, with the motion confined between\ntwo rigid walls, one of which is fixed while the other one moves in time. We showed\nthat our model recovers the well know Fermi-Ulam model results in the limit of zero\nexternal field and shows properties of the bouncer model for intense gravitational field.\nWithin a certain range of control parameters, however, we found that properties that\nare individually characteristic of either the Fermi-Ulam or bouncer models can come\ntogether and coexist in their hybrid.\nWe now consider here a classical particle in the Fermi-Ulam model suffering an\ninelastic collision with the fixed wall, and we analyse the full model rather than the\nsimplified system that is commonly considered where the so-called successive collisions\nare ignored (see references [21, 22, 23] for previous results in the simplified and dissipative\nversion of the model). We will show, however, that the model is area-contracting only in\nrelation to non-successive collision; in contrast, the map describing successive collisions\nretains the area-preserving property (because collisions with the moving wall are elastic\nin the moving frame of reference). We also show that dissipation destroys the mixed\nphase space structure seen in the non-dissipative case. We observe a chaotic attractor,\ncharacterized by a positive Lyapunov exponent and, of particular interest, we identify\nand characterize a crisis event [24, 25] for this version of the problem. In addition,\nthe basin of attraction for the chaotic attractor is located and the manifold branches\nobtained.\nThe model thus consists of a classical particle confined to move between two rigid\nwalls in the absence of gravitational or other fields. One wall is fixed at x = l and the\nother moves according to the equation xw(t) = ǫ\n′ cos(ωt), where ǫ′ and ω are respectively\nthe amplitude and angular frequency of the motion. We assume that collisions with the\nfixed wall are perfectly elastic in the frame of reference of the wall, but that those with\nthe fixed wall are inelastic. In a collision with the fixed wall, the particle’s velocity is\ninverted but, in addition, it is also reduced by a factor depending on the coefficient of\nrestitution α which assumes a value in the interval α ∈ [0, 1]: α = 1, corresponding\nto perfect elasticity, obviously leads to recovery of all the results of the non-dissipative\ncase; α = 0 corresponds to the completely inelastic case where a single collision with\nA crisis in the dissipative Fermi accelerator model 3\nthe wall is enough to terminate the particle’s dynamics. Our interest relates to cases\nlying between these two limits.\nIn constructing a map to describe the dynamics of this model, it is convenient to\nuse dimensionless variables. We define that Vn = vn\/(ωl), ǫ = ǫ\n′\/l and measure time in\nterms of the number of oscillations of the moving wall, i.e. φn = ωt. Starting with the\ninitial conditions (Vn, φn), with the particle’s initial position given by xp(φn) = ǫ cos(φn),\nthe map describing the model dynamics is\nT :\n{\nVn+1 = V\n∗\nn − 2ǫ sin(φn+1)\nφn+1 = φn +∆Tn mod(2π)\nwhere the expressions to be used for V ∗n and ∆Tn depend on which kind of collision\noccurs. For successive collisions, the expressions are V ∗n = −Vn and ∆Tn = φc. The\nphase φc is obtained as the smallest solution of the equation G(φc) = 0 for φc ∈ (0, 2π].\nThe physical interpretation of G(φc) = 0 is equivalent to having the condition xp = xw,\ni.e. the position of the particle is the same as the position of the moving wall, which\nobviously corresponds to a collision. The function G(φ) is given by\nG(φ) = ǫ cos(φn + φ)− ǫ cos(φn)− Vnφ . (1)\nIf the function G(φ) does not have a root in the interval φ ∈ (0, 2π], thus we can conclude\nthat the particle leaves the collision zone without suffering a successive collision. The\ncollision zone is defined as the interval x ∈ [−ǫ, ǫ]. The Jacobian matrix for successive\ncollisions yields a determinant given by\nDetJ =\nVn + ǫ sin(φn)\nVn+1 + ǫ sin(φn+1)\n.\nThis result shows that the mapping preserves the measure of phase space dµ =\n(V + ǫ sin(φ))dV dφ; it is the same as the measure obtained for the breathing circle\nbilliard [26]. Note that the results for a diametrical orbit in such a billiard necessarily\nrecovers the results of the Fermi-Ulam model itself. For the case of non-successive\ncollisions, the expressions are given by V ∗n = αVn and ∆Tn = φr + φl + φc where the\nauxiliary terms take the form:\nφr =\n1− ǫ cos(φn)\nVn\n, φl =\n1− ǫ\nαVn\n.\nThe term φr indicates the time spent by the particle in travelling towards the fixed\nwall, while φl gives the time the particle spends before reaching the collision zone after\nsuffering an inelastic collision with the fixed wall. Finally the term φc is obtained\nnumerically as the smallest solution of the equation F (φc) = 0 where the function F (φ)\nis given by\nF (φ) = ǫ cos(φn + φr + φl + φ)− ǫ+ αVnφ . (2)\nEquation (2) is obtained in the attempt to meet the condition xp = xw. The Jacobian\nmatrix for this case yields the determinant\nDetJ = α2\nVn + ǫ sin(φn)\nVn+1 + ǫ sin(φn+1)\n,\nA crisis in the dissipative Fermi accelerator model 4\nwhich obviously implies that area preservation is observed only if α = 1.\nThe expression −2ǫ sin(φn+1) (see the map T ) is obtained by conservation of energy\nand momentum in the reference frame of the moving wall at the instant of impact, for\nwhich it is instantaneously at rest.\nFigure 1 shows the stable and unstable manifolds for a hyperbolic fixed point (also\ncalled as saddle) given by\nV =\n2ǫ\nα− 1 sin(φ) , φ = −arcos\n[\nǫ− β√β2 + ǫ2 − 1\nǫ2 + β2\n]\n(3)\nwith β = 4πǫα\/(α2 − 1) in this version of the dissipative Fermi-Ulam model. Figure\n1(a) shows the results for α = 0.93 and ǫ = 0.04. The two branches of the unstable\nmanifold evolve as follows: the upward branch generates the attracting fixed point while\nthe downward branch generates the chaotic attractor. The two branches of the stable\nmanifold establish boundaries for both the chaotic and fixed point attractors (the details\nof the corresponding basin boundaries are shown in figure 2(b)). Increasing the value of\nthe control parameter α, which is equivalent to reducing the strength of the dissipation,\ncauses a homoclinic orbit to be generated at α ≈ 0.93624 . . .. Since the two branches\nof the stable manifold establish the edges of the basin boundaries, the generation of\nthe homoclinic orbit also results in a collision of the chaotic attractor with the border\nof its basin boundary. Such a collision is often called a boundary crisis [24, 25, 27].\nSimultaneously, the chaotic attractor and its basin of attraction are destroyed. Figure\n1(b) shows the stable and unstable manifolds for the control parameters ǫ = 0.04 and\nα = 0.9375 immediately after the boundary crisis. The birth of the homoclinic orbit is\nclearly evident.\nThe chaotic attractor is shown in figure 2(a). The control parameters used in\nconstructing the figure were ǫ = 0.04, α = 0.93624. The asymptotic positive Lyapunov\nexponent, obtained via a triangularisation algorithm [28], is given by λ = 1.7743±0.0005.\nWe used an ensemble of 10 different initial conditions randomly chosen in the basin\nof attraction of the chaotic attractor. Each initial condition was evolved through up\nto 108 iterations. The error represents the standard deviation of the ten samples.\nIt is interesting to note that the lower bound of the chaotic attractor has a simple\nphysical interpretation. It is, in fact, limited by the velocity of the moving wall, i.e.\nVw = dxw\/dφ = −ǫ sin(φ): the line generated by Vw is shown in the figure. The\nattracting fixed point is indicated by a × in figure 2(a). The basins of attraction for both\nthe chaotic and fixed point attractors are shown in figure 2(b) for the same parameters\nas used in figure 2(a). We set a range for the initial conditions as V ∈ [−ǫ, 0.6] and\nφ ∈ [0, 2π]. We thus divide both windows of V and φ in 200 parts each, leading\nthen to a total of 4 × 104 initial conditions. Each initial condition was iterated up\nto nx = 5 × 105 iterations, which is quite enough to disregard transient effects for\nthe particular combination of control parameters used. The basins of attraction of\nthe chaotic and fixed point attractors are shown in black and grey respectively. The\nborder of the boundary is obtained by iteration of the stable manifolds of the fixed\npoint given by equation (3). Immediately after the the birth of the homoclinic orbit,\nA crisis in the dissipative Fermi accelerator model 5\n0 2 4 6φ\n0\n0.3\n0.6\nV\n0 2 4 6φ\n0\n0.3\n0.6\nV\n(a)\n(b)\nFigure 1. Stable and unstable manifolds for the dissipative Fermi-Ulam model with\nǫ = 0.04: (a) for α = 0.93, just before the crisis, and (b) for α = 0.9375, just after\nthe crisis. The saddle is indicated by an S. Note that in (b), unlike (a), the manifolds\ncross.\nand the destruction of the chaotic attractor and its basin, some initial conditions may\nlead to very long transients before the attracting fixed point is reached, even compared\nto nx = 5 × 105. For such initial conditions, we therefore extend the simulation to\nnx = 1 × 107 or longer in order to guarantee convergence to the attracting fixed point.\nOther periodic attracting orbits could in principle also exist in this version of the model.\nWe therefore stress that for the control parameters used in fig. 2, for the range of V and\nφ considered and for the steps used in the basin boundary construction, no such orbits\nwere observed: if they exist their basins of attraction must be very small.\nIn summary, we have studied a dissipative version of the well known Fermi-Ulam\nA crisis in the dissipative Fermi accelerator model 6\n0 2 4 6φ\n0\n0.1\n0.2\n0.3\nV\n0 2 4 6φ\n0\n0.2\n0.4\n0.6\nV\n(a)\n(b)\nAttracting fixed point\nLower limit of the CA\nFigure 2. (a) The chaotic attractor and the coexisting attracting fixed point for the\nparameters ǫ = 0.04 and α = 0.93624. (b) Their corresponding basin boundaries. The\nbasin boundary of the chaotic attractor is shown in black, while that of the attracting\nfixed point is in grey. The border was obtained as the stable manifolds of the fixed\npoint given by equation (3).\nmodel. It considers inelastic collisions with the fixed wall while assuming elastic\ncollisions with the moving wall. We find that, depending on the type of collision,\nthe mapping may show either area-preservation or area-contraction. We show that\ncrisis events arise as a function of the magnitude of the coefficient of restitution. Basin\nboundaries were obtained for both the chaotic and fixed point attractors.\nThe authors thanks S. Beri for helpful discussions. The research was supported\nby a grant from Conselho Nacional de Desenvolvimento Cient´ıfico e Tecnolo´gico –\nCNPq, Brazilian agency. The numerical results were obtained in the Centre for High\nA crisis in the dissipative Fermi accelerator model 7\nPerformance Computing in Lancaster University. The work was supported in part by\nthe Engineering and Physical Sciences Research Council (UK).\nReferences\n[1] Lichtenberg A J, Lieberman M A 1992 Regular and Chaotic Dynamics, Applied Mathematical\nSciences vol 38 (New York: Springer-Verlag)\n[2] Bai-Lin H 1990 Chaos II (Singapore: World Scientific Publishing)\n[3] Guckenheimer J, Holmes P 2000 Nonlinear Oscillations, Dynamical Systems, and Bifurcations of\nVector Fields, Applied Mathematical Sciences vol 42 (New York: Springer-Verlag)\n[4] Nusse H E, Yorke J A 1991 DYNAMICS: Numerical Explorations, Applied Mathematical Sciences\nvol 101 (New York: Springer-Verlag)\n[5] Grebogi C, Ott E, Pelikan S, Yorke J A 1984 Physica D 13 261\n[6] Leonel E D, da Silva J K L 2003 Physica A 323 181\n[7] Leonel E D, da Silva J K L, Kamphorst S O 2004 Physica A 331 435\n[8] Leonel E D, McClintock P V E 2004 J. Phys. A: Math. Gen. 37 8949\n[9] Leonel E D, McClintock P V E 2004 Phys. Rev. E 70 016214\n[10] Fermi E 1949 Phys. Rev. 75 1169\n[11] Lieberman M A, Lichtenberg A J 1971 Phys. Rev. A 5 1852\n[12] Pustilnikov L D 1983 Theor. Math. Phys. 57 1035; Pustilnikov L D 1987 Sov. Math. Dokl. 35 88;\nPustilnikov L D 1995 Russ. Acad. Sci. Sb. Math. 82 231\n[13] Holmes P J 1982 J. Sound and Vibr. 84 173\n[14] Lichtenberg A J, Lieberman M A, Cohen R H 1980 Physica D 1 291\n[15] Karner G 1994 J. Stat. Phys. 77 867\n[16] Dembinski S T, Makowski A J, Peplowski P 1983 Phys. Rev. Lett. 70 1093\n[17] Jose´ J V, Cordery R 1986 Phys. Rev. Lett. 56 290\n[18] Seba P 1990 Phys. Rev. A 41 2306\n[19] Jain S R 1993 Phys. Rev. Lett. 70 3553\n[20] Leonel E D, McClintock P V E 2005 J. Phys. A: Math. Gen. 38 823\n[21] Tsang K Y, Lieberman M A 1984 Physics Letters A 103 175\n[22] Tsang K Y, Lieberman M A 1984 Physica D 11 147\n[23] Tsang K Y, Lieberman M A 1986 Physica D 21 401\n[24] Grebogi C, Ott E, Yorke J A 1982 Phys. Rev. Lett. 48 1507\n[25] Grebogi C, Ott E, Yorke J A 1983 Physica D 7 181\n[26] Kamphorst S O, de Carvalho S P 1999 Nonlinearity 12 1363\n[27] McDonald S W, Grebogi C, Ott E, Yorke J A 1985 Physics Letters A 107 51\n[28] Eckmann J P, Ruelle D 1985 Rev. Mod. Phys. 57 617\n"}