{"doi":"10.1080\/00207170310001640116","coreId":"193902","oai":"oai:lra.le.ac.uk:2381\/2005","identifiers":["oai:lra.le.ac.uk:2381\/2005","10.1080\/00207170310001640116"],"title":"A new perspective on static and low-order anti-windup synthesis","authors":["Turner, Matthew C.","Postlethwaite, Ian"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004","abstract":"By viewing the anti-windup problem as a decoupled set of subsystems and relating this configuration to a general static anti-windup set-up, LMI conditions are established which guarantee stability and performance of the resulting closed-loop system. The approach taken, and the mapping used for the performance index, are logical and intuitive--and, it is argued, central to the 'true' anti-windup objective. The approach enables one to construct static anti-windup compensators in a systematic and numerically tractable manner. The idea is extended to allow low-order anti-windup compensators to be synthesized, which, while being sub-optimal, can improve transient performance and possess several desired properties (such as low computational overhead and sensible closed-loop pole locations). In addition, low-order anti-windup synthesis is often feasible when the corresponding static synthesis is not.Peer reviewedPost prin","downloadUrl":"http:\/\/www.informaworld.com\/smpp\/content~db=all?content=10.1080\/00207170310001640116.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/2005\/1\/alt_aw_IJCrev2.pdf","pdfHashValue":"0d4c0aab66e8edf5cb12c592af7c7d18116b99a7","publisher":"Taylor & Francis","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/2005<\/identifier><datestamp>\n                2016-01-05T09:27:57Z<\/datestamp><setSpec>\n                com_2381_171<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_835<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nA new perspective on static and low-order anti-windup synthesis<\/dc:title><dc:creator>\nTurner, Matthew C.<\/dc:creator><dc:creator>\nPostlethwaite, Ian<\/dc:creator><dc:description>\nBy viewing the anti-windup problem as a decoupled set of subsystems and relating this configuration to a general static anti-windup set-up, LMI conditions are established which guarantee stability and performance of the resulting closed-loop system. The approach taken, and the mapping used for the performance index, are logical and intuitive--and, it is argued, central to the 'true' anti-windup objective. The approach enables one to construct static anti-windup compensators in a systematic and numerically tractable manner. The idea is extended to allow low-order anti-windup compensators to be synthesized, which, while being sub-optimal, can improve transient performance and possess several desired properties (such as low computational overhead and sensible closed-loop pole locations). In addition, low-order anti-windup synthesis is often feasible when the corresponding static synthesis is not.<\/dc:description><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPost print<\/dc:description><dc:date>\n2009-12-08T16:16:04Z<\/dc:date><dc:date>\n2009-12-08T16:16:04Z<\/dc:date><dc:date>\n2004<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nInternational Journal of Control, 2004, 77 (1), pp.27-44<\/dc:identifier><dc:identifier>\n0020-7179<\/dc:identifier><dc:identifier>\nhttp:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/00207170310001640116<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/2005<\/dc:identifier><dc:identifier>\n10.1080\/00207170310001640116<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:rights>\nCopyright 2004 Taylor & Francis Ltd.  Deposited with reference to the publisher's archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:rights>\nThis is the author's final draft of the paper published as International Journal of Control, 2004, 77 (1), pp.27-44.  The final version is available from http:\/\/www.informaworld.com\/smpp\/content~db=all?content=10.1080\/00207170310001640116.  Doi: 10.1080\/00207170310001640116<\/dc:rights><dc:publisher>\nTaylor & Francis<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0020-7179","issn:0020-7179"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007"],"year":2004,"topics":[],"subject":["Article"],"fullText":"A new perspective on static and low order anti-windup synthesis\nMatthew C. Turner \u0000\u0002\u0001 and Ian Postlethwaite\n\u0003\n\u0001\nControl and Instrumentation Research Group,\nDepartment of Engineering,\nUniversity of Leicester,\nLeicester,\nLE1 7RH, UK.\nAbstract\nBy viewing the anti-windup problem as a decoupled set of subsystems and relating this configuration to a\ngeneral static anti-windup set-up, LMI conditions are established which guarantee stability and performance\nof the resulting closed-loop system. The approach taken, and the mapping used for the performance index, are\nlogical and intuitive - and, it is argued, central to the ‘true’ anti-windup objective. The approach enables one\nto construct static anti-windup compensators in a systematic and numerically tractable manner. The idea is\nextended to allow low-order anti-windup compensators to be synthesised, which, while being sub-optimal, can\nimprove transient performance and possess several desired properties (such as low computational overhead\nand sensible closed-loop pole locations). In addition, low-order anti-windup synthesis is often feasible when\nthe corresponding static synthesis is not.\nKeywords: Anti-windup compensation; saturation; linear systems.\n1 Introduction\nThe problem of actuator saturation is well-documented in the literature 1 and many researchers have sought\nto address the problems associated with its presence. It has been tackled from various different perspectives\nwhich include synthesising controllers which directly account for saturation constraints (see Garcia et al. (1999),\nDe Dona et al. (2000), Turner et al. (2000) or Saberi et al. (1996) for example); model predictive control strate-\ngies where the control constraints are incorporated into the resulting optimisation procedure; and anti-windup\ntechniques, which this paper considers.\nOne of the most successful methodologies used to cope with actuator saturation is anti-windup compensation\nor conditioning (see Kothare et al. (1994) or Astrom & Rundqwist (1989) for example). This well-known\ntechnique involves a two-step procedure whereby a controller is first synthesised for a nominal, usually linear,\n\u0004\nCorresponding author. Email: mct6@le.ac.uk. Tel.: +44 (0)116 2522548\n\u0005\nEmail: ixp@le.ac.uk. Tel.: +44 (0)116 2522547\n\u0006\nWork supported by the UK Engineering and Physical Science Research Council\n1The literature on this subject is now vast and any attempt we make to summarise it would inevitably omit valuable contributions\nmade by many scholars.\n1\n2system ignoring saturation. An anti-windup compensator is then designed such that, when the control signal\nundergoes saturation, this compensator becomes active and leads to improved behaviour during this period. This\nhas the advantage that the small signal response of the system is left as intended and that the local performance\nof the controller is not restricted.\nBuilding upon the success achieved in guaranteeing stability of stable plants subject to actuator saturation, there\nhas been some recent activity aimed at securing performance guarantees for such systems. Although this has\nalways been sought informally, one of the first forays into establishing this notion concretely was made in\nMulder et al. (2001) (see also Wada & Saeki (1999) for a similar, but less general, treatment), where the \u0000\u0002\u0001 gain\nwas picked as an appropriate induced system norm to measure an anti-windup compensator’s performance.\nFurthermore, Mulder et al. (2001) gave existence conditions, in terms of a set of linear matrix inequalities\n(LMI’s), by which anti-windup compensators could be synthesised. Mulder et al. (2001) only tackled static anti-\nwindup synthesis: the synthesis of anti-windup compensators which were themselves not dynamic, although\ntheir inclusion altered the dynamics of the “effective” controller.\nThis line of research was continued in more generality in Grimm et al. (2001b) and Grimm et al. (2003) where it\nwas shown that, for stable plants, there always exists an anti-windup compensator of order greater than or equal\nto that of the plant which, in addition satisfies a finite \u0000\u0003\u0001 gain constraint. The results of Grimm et al. (2001b)\nand Grimm et al. (2003) served to complement known results on the existence of globally stabilising full order\nanti-windup compensators found in, for example, Teel & Kapoor (1997), Weston & Postlethwaite (2000) and\nMiyamoto & Vinnicombe (1996). Furthermore, the work in Grimm et al. (2001b) gave a characterisation of all\noptimal linear anti-windup compensators meeting an \u0000 \u0001 performance constraint and a procedure by which to find\na certain, possibly reduced order, compensator. Generally this problem was cast as a non-convex optimisation\nprocedure, although in the full-order and static cases the problem is actually convex, which makes the results of\nMulder et al. (2001) a special case of the general result in Grimm et al. (2001b).\nBoth the works of Mulder et al. (2001) and those of Grimm et al. (2003) were successful at synthesising com-\npensators which yielded improved performance, particularly when compared to ad hoc methods in existence and\nwhen compared to internal model control (IMC), yet in a certain way, they both failed to achieve the true goal of\nan anti-windup compensator.\nThe “true goal” of an anti-windup compensator is, of course, subjective, but a notion of this which has been held\ninformally since the methodology’s inception is the notion of a swift return to linear behaviour. This was really\nonly formalised in Teel & Kapoor (1997) (see also Kapoor et al. (1998)), although it was first recognised in the\nwork of Miyamoto & Vinnicombe (1996) and, independently, in Weston & Postlethwaite (1998). In all of these\nworks the performance of an anti-windup compensator was based on it returning the output of the system to the\nnominal, that is, what it would have been had saturation not been present.\nIn the works of Grimm et al. (2003) and Mulder et al. (2001), the \u0000 \u0001 gain condition is not directly related to\nthe system’s return to linear behaviour; indeed there is no direct way of capturing this into the formulae in those\npapers. Instead, attention there is focused on the minimisation of a certain closed-loop induced norm, which is\ndeemed appropriate to capture the performance of the system. In our paper, we re-visit the work of Weston &\nPostlethwaite (1998) (see also Weston & Postlethwaite (2000)) and use the decoupled structure derived in that\npaper to formulate conditions which encapsulate the return to linear behaviour of a stable system containing\nan anti-windup compensator. At first we consider purely static anti-windup compensators, which are, from\n3a practical point of view, most desirable. Then these ideas are extended to the sub-optimal synthesis of “low-\norder” compensators, which are often feasible for problems for which static compensators are not. It is important\nto remark that our work assumes that linear behaviour is desirable, and hence a return to linear behaviour marks\na return to ‘good’ performance; in most cases this is a valid assumption.\nOther work related to these results, and to this paper, can be found in Crawshaw & Vinnicombe (2000) and\nKapoor et al. (1998), both of which take the return to linear behaviour as a central objective. The work of\nCrawshaw & Vinnicombe (2000) builds on the work of Miyamoto & Vinnicombe (1996) but uses a novel loop-\ntransformation to convert a small gain condition into, effectively, the less conservative Circle Criterion. Kapoor\net al. (1998) use an observer-based anti-windup compensator, a special case of static compensator (early work on\nthis subject was contributed by Walgama & Sternby (1990)), and a subspace algorithm to make a certain triplet\npassive, which ensures recovery of linear behaviour. This latter technique has the advantage of computational\nsimplicity although it does not explicitly tackle an \u0000 \u0001 gain objective, as we propose here.\nThe notation used in the paper is mainly standard throughout. We denote the \u0000\u0001\u0000 norm of a time-varying vector\n\u0002\u0004\u0003\u0006\u0005\b\u0007\n\t\f\u000b\u000e\r\u0010\u000f as \u0011 \u0002 \u0011 \u0000 and the induced \u0000 \u0000 norm of a possibly nonlinear operator \u0012\u0014\u0013\u0016\u0015\u0018\u0017\n\u0019\u001aff\u0015 \u0001 from one Lebesgue\nspace to another, as \u0011fi\u0012fl\u0011\u001fffi\u0006 \u0000 . To avoid notational clutter, we often omit the time variable ( \u0005 ) or Laplace argument\n( ! ) of a vector or transfer function if we think that no confusion will arise. Likewise, we often do not distinguish\nbetween a system’s transfer function and its associated linear operator in the time domain. \u0011 \u0002\u0004\u0003\u0006\u0005\b\u0007 \u0011\n\"$# \u0002%\u0003\u0006\u0005&\u0007(')\u0002%\u0003\u0006\u0005&\u0007\nis the Euclidean norm of the vector \u0002%\u0003\u0006\u0005\b\u0007 . The distance between a vector \u0002%\u0003\u0006\u0005&\u0007 and a compact set, \u0012 , is denoted\n*\u0016+\n!\n\u0005,\u0003\u0006\u0002.-\n\u0012\n\u0007\n\u0013\/\"1032547698;:<\u0011\n\u0002>=@?\n\u0011 . A\nffiCB\u0010D\nrepresents the space of all real rational transfer function matrices of\ndimension\n+.EGF\n; AIH\fJ denotes the set of real rational transfer function matrices, analytic in the closed right-half\ncomplex plane and with norm with supremum on the imaginary axis.\n2 Problem Formulation\n2.1 System Description\nWe consider the stabilisable, detectable and finite dimensional linear-time-invariant (FDLTI) plant subject to\ninput saturation:\nK\n\u0003\n!\n\u0007MLON P\nQ\n\u0000 \" R\u0001\u0000\nQ\n\u0000TSVU\n\u0000;WYXZSVU\n\u0000\\[\n*\n\u0002\n\" ]^\u0000\nQ\n\u0000TSZ_`\u0000\u0010WYXaSV_\n\u0000b[\n*\n(1)\nwith Q \u0000 \t\f\u000bc\rbde- WYX \t\f\u000b X -&\u0002f\t>\u000b\u000eg and\n*\n\t\f\u000bc\r;h\n. From this we define the following transfer function matrices to\nrepresent the disturbance feedforward and feedback parts of\nK\n\u0003\n!\n\u0007 :\nK\n\u0017\n\u0003\n!\n\u0007iLkj\nRl\u0000 U\n\u0000\\[\n]^\u0000 _\n\u0000\\[\fm\nK\n\u0001\n\u0003\n!\n\u0007cLkj\nR\u0001\u0000 U\n\u0000\n]^\u0000 _`\u0000\nm\n(2)\nAs the work here is seeking global results, we are necessarily forced to assume that\nK\n\u0003\n!\n\u0007 is asymptotically stable;\nthat is\nK\n\u0003\n!\n\u0007n\t\nAoH\nJ\n. This is necessary in the approach we take, as will be clear later.\nWe assume the following stabilisable, detectable, linear controller has been designed to control the plant\nK\n\u0003\n!\n\u0007\n,\np\n\u0003\n!\n\u0007cLON\nP\nQeq\n\" R\nqrQeq\nSZU\nq7\u0002\nSVU\nqtsvu\n\u0002\nq\n\" ]\nq\nQ\nq\nSV_\nq\n\u0002\nSV_\nqts\nu\n(3)\n4where Q q \t\f\u000b \r\u0001\u0000 and u \t\f\u000b \r\u0003\u0002 . From this we designate the following transfer functions\np\n\u0017\n\u0003\n!\n\u0007ML j\nR\nq\nU\nq s\n]\nq\n_\nqts\nm\np\n\u0001\n\u0003\n!\n\u0007ML j\nR\nq\nU\nq\n]\nq\n_\nq\nm\n(4)\nAs is the convention in anti-windup design, we assume that the plant input, W X , is given by WeX \" \u0004\u0006\u0005\u0003\u0007 \u0003 W \u0007 , where\n!\t\b\n\u0005 \u0003\nW\n\u0007\n\"\u000b\n !\f\b\n\u0005,\u0003\nW \u0017\n\u0007\u001f-\u000e\r\u000e\r\u000e\rb-\n!\t\b\n\u0005 \u0003\nWYX\n\u0007\u0010\u000f (5)\nand !\t\b \u0005,\u0003 W ffi \u0007 \" \u0004 0\u0012\u0011\u00162 \u0003 W ffi \u0007\nE\u0014\u0013\n032\u0016\u0015\u0018\u0017 W ffi \u0017\n-\u001a\u0019\nW ffififf\n- \u0019\nW ffi fl \u001f !\n+\n\t\n\u0015#\"\n-\u000e\r\u000e\r\u000e\r -%$\nff . If there is no saturation present (i.e.\nWYX\u0014\" W ), we call the system in which this is the case the nominal closed loop system. Furthermore, we assume\nthat either WeX is available for direct measurement, or that a good estimate of it is available. For convenience we\ndefine the compact set &(' \u000b X\n& \u0013\/\")\n\n=*\u0019\nW \u0017\n-\u001a\u0019\nW \u0017\n\u000f\nE\n\r\u000e\r\u000e\r\nE\n\n\n=*\u0019\nWYX\n-\u001a\u0019\nWYX\n\u000f (6)\nNote that ! W \t & - !\t\b \u0005,\u0003 W \u0007 \"\u0014W . This definition is similar to that in Teel & Kapoor (1997), but not exactly the\nsame as we only consider asymptotically stable plants. The deadzone function is given by the identity\n_,+\n\u0003\nW\n\u0007\n\" W\n=\n!\t\b\n\u0005,\u0003\nW\n\u0007 (7)\nNote that ! W \t & - _-+ \u0003 W \u0007 \" \u001f . Central to our results will be the fact that the deadzone function satisfies the\nfollowing sector property.\nDefinition 1 The decentralised nonlinearity . \"\u000b\/ 0 \u0005 \u0011 \u000310 \u0017 -\u000e\r\u000e\r\u000e\r\\-%0 X \u0007 is said to belong to 2\u0018354 \u0007%6\u001a7 \n \u001f -\u000689\u000f if the fol-\nlowing inequality holds:\n0\n\u0017\n\u0003\nWYffi\n\u0007\n\u0001;:\n0\nffi\n\u0003\nWYffi\n\u0007\nWYffi\n:\nW\n\u0001\nffi\n!\n+\n\t\n\u0015<\"\n-\u000e\r\u000e\r\u000e\r -%$\nff (8)\nThis definition is specialised to the 2\u0018354 \u0007%6\u001a7 \n \u001f -\u000689\u000f case from the more general definition given in Khalil (1996),\nDefinition 10.1 - this less general sector bound is sufficient for our purposes.\nWe make the following assumption on the nominal closed loop system.\nAssumption 1 = The poles of j\n8 =\np\n\u0001\n\u0003\n!\n\u0007\n=\nK\n\u0001\n\u0003\n!\n\u0007 8\nm\n>\n\u0017\nare in the open left-half complex plane.\n= The limit ?30\n\u0013A@fiB\nJ\n\u0003C8 =\np\n\u0001\n\u0003\n!\n\u0007\nK\n\u0001\n\u0003\n!\n\u0007&\u0007\n>\n\u0017\nexists. D\nThe first statement ensures the nominal closed-loop system is stable; the second ensures it is mathematically\nwell-posed and, in state-space terms, is equivalent to the existence of the matrices E \u0013\/\" \u0003C8 = _ \u0000 _ qfi\u0007 > \u0017 and\nF\nEO\u0013\/\"\n\u0003C8 =\n_\nq\n_`\u0000\n\u0007\n>\n\u0017\n5y\nuu\nG(s)K(s)\nd\nr m\n-+\n-\n+\n+\n+\nθ 2 (s)Θ\n1θ\nFigure 1: Generic anti-windup scheme\n2.2 Anti-windup configuration\nWe consider the problem of designing an anti-windup compensator, \u0000 \u0003 ! \u0007 , as depicted in Figure 1. The anti-\nwindup compensator emits two signals, \u0001 \u0017 \t \u000b X and \u0001 \u0001 \t\f\u000bcg which enter the control input and the plant output\nrespectively. This is less general than in the work of Grimm et al. (2003), where \u0001 \u0001 is permitted to enter the\ncontroller state directly (i.e. \u0001 \u0001 \tZ\u000bc\r \u0000 \u0007 . This is because the current paper has been motivated by engineering\nproblems where it may not always be plausible to inject \u0001 \u0001 directly into the controller state equation 2. There is\nalso some similarity to the work of Kapoor et al. (1998), although only observer-based synthesis is considered\nthere ( \u0001\n\u0017\n\"\n\u001f ).\nK(s)\nM-I\nG(s)\nd\n-+\nu mulin\nu\n+\nyd\n+\n+\nliny\nr y\nu\nd\n~\nu\nG M2\n-\nFigure 2: Conditioning with \u0002 \u0003 ! \u0007\nA novel way of representing most anti-windup configurations was introduced in Weston & Postlethwaite (1998),\nwhere one interprets the conditioning of controllers in terms of a single transfer function \u0002 \u0003 ! \u0007 ; this is shown in\nFigure 2. In Weston & Postlethwaite (1998) it was shown that, with all signals labelled identically and noting\nthat _-+ \u0003 W \u0007 \" W = !\t\b \u0005 \u0003 W \u0007 , Fig 2 can be re-drawn as Fig 3. This configuration reveals an attractive decoupling\ninto nominal linear system, nonlinear loop and disturbance filter. Note that if no saturation occurs, then the\nnominal linear system is all that is required to determine the system’s behaviour. However if saturation occurs,\nthe nonlinear loop and disturbance filter become active. Using this representation, note that the question of\nnonlinear stability for the complete system is translated into determining whether the nonlinear loop is stable.\nThe dynamics of the disturbance filter determine the manner in which the nominal linear behaviour is affected\nduring and after saturation.\nThe representation in Figure 3 was analysed in terms of existing schemes in Weston & Postlethwaite (2000)\n2For example, in some embedded applications this is frequently the case.\n6Nominal Linear Transfer Function\nDisturbance\nFilter\nNonlinear Loop\ny\ny\nK(s) G(s) +\n+\nu\nM−I\nu\ny\nd\nlin\nlin\n~\nr\nd\nd\nu\nG M2\n−\n−\nFigure 3: Equivalent representation of conditioning with \u0002 \u0003 ! \u0007\nand ways of analysing stability and performance were also suggested. In particular, stability and performance\nsynthesis for anti-windup compensators of order greater than or equal to that of the plant can be conveniently\nperformed using an LMI formulation of the Circle Criterion.\nAlthough such a treatment yielded attractive results, from a computational point of view, the method still has\ndeficiencies: normally one would like to keep the dynamics introduced by a conditioning scheme to a minimum.\nAlso the treatment tackled stability of the nonlinear loop and performance of the disturbance filter separately,\nleading to the likelihood of sub-optimality. The topic of this paper is to address the synthesis issues of static and\nlow-order anti-windup compensators using the Weston & Postlethwaite (1998) representation.\nIn this formulation, the mapping \u0000 \u0013 W\u0002\u0001\nffi\n\r\n\u0019\u001a\n\u0002\n[\ndetermines the deviation of the conditioned system from the\nnominal system, so keeping \u0011\u0003\u0000>\u0011vffi  \u0000 small in some appropriate \u0000c\u0000 norm yields, in some sense, good anti-windup\nperformance. Note that this type of performance is not captured explicitly in the formulations of Grimm et al.\n(2001b) and Mulder et al. (2001): the performance index in these papers is taken as something which is defined\non the system as a whole, which allows Grimm et al. (2001b) to conclude that the anti-windup performance is at\nbest, greater than that of the nominal open and closed loop linear systems. Here, we do not have this constraint,\nand indeed, our performance index is purely defined on the saturated system. We now formally define the\nanti-windup problem we will consider in the remainder of the paper.\nDefinition\nThe anti-windup compensator \u0000 \u0003 ! \u0007 is said to solve the anti-windup problem if the closed loop system in Figure\n3 is well-posed and the following hold:\n1. If \/Y0 \u0004%\u0007 \u0003 W\u0004\u0001\nffi\n\r\n-\n&\n\u0007\n\"\n\u001f\n-\n!\n\u0005\u0006\u0005\n\u001f , then \u0002\n[\n\"\n\u001f\n-\n!\n\u0005\u0006\u0005\n\u001f (assuming zero initial conditions for \u0000 \u0003 ! \u0007 ).\n2. If \/Y0 \u0004%\u0007 \u0003 W\u0004\u0001\nffi\n\r\n-\n&\n\u0007n\t\n\u0000 \u0000 , then \u0002\n[\n\t\n\u0000^\u0000 for some integer \u0007 \t \n \" -\t\b \u0007 .\nThe anti-windup compensator \u0000 \u0003 ! \u0007 is said to solve strongly the anti-windup problem if, in addition, the following\ncondition is satisfied:\n3. The operator \u0000 \u0013\u0016W\n\u0001\nffi\n\r\n\u0019\u001a\n\u0002\n[\nis well-defined and finite gain \u0000 \u0000 stable for some integer \u0007 \t \n \" -\t\b \u0007 .\n7D\nRemark 1: In this paper, we only deal with the strong version of the anti-windup problem. The weaker version\nis included to enable the reader to make comparisons with other techniques in the literature, such as that in Teel\n& Kapoor (1997), partly on which this definition is based. Note that Condition 3 implies Condition 2. D\nRemark 2: We exclude the consideration of \u0000TJ performance as \u0000 could be \u0000 J stable yet the output could\nexhibit a limit cycle. D\nRemark 3: It is important to stress that the work in this paper, and most other papers concerning anti-windup\ncompensation, assumes that the model of the plant is reasonably accurate, that is\nK\n\u0001 is known precisely. It is not\ntrivial to incorporate a robustness analysis into anti-windup compensation design, although some steps in this\ndirection are described by (Turner et al.2003).\n3 Static anti-windup synthesis\n3.1 Representing \u0000\u0002\u0001\u0004\u0003\u0006\u0005\nIn order to analyse linear conditioning in terms of Figure 3, it is necessary to derive an expression for \u0002 \u0003 ! \u0007 in\nterms of \u0000 . Partitioning \u0000 as\nj\n\u0001\n\u0017\n\u0001 \u0001\nm\n\" \u0000\nF\nW\f\"\nj\n\u0000\n\u0017\n\u0000 \u0001\nm\nF\nW\n- j\n\u0001\n\u0017\n\u0001 \u0001\nm\n\t\f\u000b\nX\b\u0007\ng\n-\nF\nW\n\t\f\u000b\nX (9)\nfrom Figures 1 and 2, W can be derived, respectively, as\nW \"\np\n\u0017\nu\nS\np\n\u0001\n\u0002\nS\n\u0003\np\n\u0001 \u0000 \u0001\n=\n\u0000\n\u0017\n\u0007\nF\nW (10)\nW \"\np\n\u0017\nu\nS\np\n\u0001\n\u0002\nS\n=\n\n\n\u0003C8 =\np\n\u0001\nK\n\u0001\n\u0007\n\u0002\n=\u001489\u000f\nF\nW (11)\nObviously, for the two schemes to be equivalent, we must have\n\u0002 \"\n\u0003C8 =\np\n\u0001\nK\n\u0001\n\u0007\n>\n\u0017\n\u0003r=\np\n\u0001 \u0000 \u0001MS \u0000\n\t\n\u0007 (12)\nwhere \u0000 \t \u0013\/\" \u0000 \u0017 S 8 . Note that \u0002 \u0003 ! \u0007 is well defined by virtue of Assumption 1.\nFrom Figure 3, note that we must consider \u0002 = 8 for stability of \u0000 and\nK\n\u0002 for the system’s recovery after\nsaturation. We will do this using LMI’s, but before that we must derive a state-space representation of these\ntwo transfer functions. It is easy to derive a non-minimal realisation but for numerical robustness we desire a\n“minimal realisation”, such as is given in Appendix A 3. Thus we assume that we have the following state space\nrepresentation for the transfer functions \u0002 \u0003 ! \u0007\u000e= 8 and\nK\n\u0001\n\u0003\n!\n\u0007\n\u0002\n\u0003\n!\n\u0007 :\nj\n\u0002\n\u0003\n!\n\u0007\u000e=\u00148\nK\n\u0001\n\u0003\n!\n\u0007\n\u0002\n\u0003\n!\n\u0007\nm\nL\n\u000b\f\n\f\n\r\n\f\n\f\u000e\nP\n\u0019Q\n\"\n\u0019\nR\n\u0019Q\nS\n\u0003\nU\u0010\u000fiS\n\u0019\nU \u0000\n\u0007\nF\nW\nW\n[\n\"\n\u0019\n]\n\u0017\n\u0019Q\nS\n\u0003\n_\u0011\u000f\n\u0017\nS\n\u0019\n_\n\u0017\n\u0000\n\u0007\nF\nW\n\u0002\n[\n\"\n\u0019\n]\n\u0001\n\u0019Q\nS\n\u0003\n_\n\u000f \u0001\nS\n\u0019\n_\n\u0001\n\u0000\n\u0007\nF\nW\n(13)\nwhere \u0000 is a static matrix by virtue of \u0000 \u0017 - \u0000 \u0001 being static and the precise form of the state-space matrices is\ndescribed in Appendix A.\n3This realisation is minimal iff (if and only if) the realisations for \u0012\u0014\u0013 and \u0015\u0016\u0013 are minimal; if this is not the case then there will be the\nsame number of extra modes as there are in \u0012 \u0013 and \u0015 \u0013 .\n83.2 Stability and Performance Analysis\nThe aforementioned stability and performance problem can be captured by ensuring that \u0000 \u0013\u0016W \u0001 ffi\n\r\n\u0019\u001a\n\u0002\n[ is small\nin some sense. We now state a condition which ensures finite gain \u0000 \u0001 performance of the compensator; further-\nmore, the result allows the synthesis of an optimal compensator using standard convex optimisation routines.\nTheorem 1 There exists a static anti-windup compensator \u0000 \"(\n \u0000 '\n\u0017\n\u0000\n'\n\u0001\n\u000f\n'\n\t \u000b\u0001\u0000\nX \u0007\ng\u0003\u0002\nB X\nwhich solves strongly\nthe anti-windup problem for \u0007 \"\u0005\u0004 if there exist matrices \u0006 fl \u001f , \u0007 \" \/ 0 \u0005 \u0011 \u0003\t\b \u0017 -\u000e\r\u000e\r\u000e\r\\-\u0003\b X \u0007 fl \u001f , \n \t \u000b \u0000 X \u0007 g\f\u0002 B X\nand a postive real scalar \r such that the following LMI is satisfied\n\u000e\u000f\n\u000f\n\u000f\n\u000f\n\u000f\n\u0010\n\u0006\n\u0019\nR\n'\nS\n\u0019\nR\u0011\u0006 U \u000f \u0007 S\n\u0019\nU\u0012\n\n=\n\u0006\n\u0019\n]\n'\n\u0017\n\u001f \u0006 ]\n'\n\u0001\n\u0013\n=\n\u0004\u0014\u0007\n=\n\u0007 _\n'\n\u000f \u0017\n=\n_\u0011\u000f \u0017 \u0007\n=\n\n\n'\n\u0019\n_\n'\n\u0017\n=\n\u0019\n_ \u0017 \n\n8\n\u0007 _\n'\n\u000f \u0001\nS\u0015\n\n'\n\u0019\n_\n'\n\u0001\n\u0013 \u0013\n=\n\r\n8\n\u001f\n\u0013 \u0013 \u0013\n=\n\r\n8\n\u0016\u0018\u0017\n\u0017\n\u0017\n\u0017\n\u0017\n\u0019ff\u001a\n\u001f (14)\nFurthermore, if this inequality is satisfied, a suitable \u0000 achieving \u0011\u0003\u0000<\u0011bffi  \u0001\n\u001a\n\r is given by \u0000 \"fi\nfl\u0007 > \u0017 . D\nProof: First note that as \u0000 is linear, the first condition in the definition of the anti-windup problem is guaranteed\ntrivially. Next, as _-+ \u0003fi\r\/\u0007\n\t 2\u0018354 \u0007%6\u001a7 \n \u001f -\u0003ffi\u0010\u000f , we have\nF\nWeffi Weffi\n\u0005\nF\nW\n\u0001\nffi\n-\n!\n+\n\t\n\u0015#\"\n-\u000e\r\u000e\r\u000e\rb-%$\nff (15)\nFrom this it follows that for some matrix \u001f \" \/Y0 \u0005 \u0011 \u0003\u0006? \u0017 -\u000e\r\u000e\r\u000e\r\\-&? X \u0007 fl \u001f\nF\nW\n'\n\u001f\n\u0003\nW\n=\nF\nW\n\u0007 \u0005\n\u001f (16)\nNext assume  \"! \u0003 \u0019Q\u0004\u0007 \" \u0019Q '$# \u0019Q fl \u001f , then if\n*\n*\n\u0005\n\u0019Q\n'\n#\n\u0019Q\nS \u0011\n\u0002\n[\n\u0011\n\u0001\n=\n\r\n\u0001\n\u0011\bW \u0001\nffi\n\r\n\u0011\n\u0001\n\u001a\n\u001f (17)\nit follows that \u0011 \u0002\n[\n\u0011 \u0001\n\u001a\n\rl\u0011\bW \u0001\nffi\n\r\n\u0011 \u0001 and hence that \u0011\u0003\u0000<\u0011\u001fffi  \u0001\n\u001a\n\r ; in other words, the anti-windup problem is solved\nin the \u0000 \u0001 sense. Next, as FW ' \u001f \u0003 W = FW \u0007\u0006\u0005 \u001f , if\n*\n*\n\u0005\n\u0019Q\n'\n#\n\u0019Q\nS\u0014\u0011\n\u0002\n[\n\u0011\n\u0001\n=\n\r\n\u0001\n\u0011\bW \u0001\nffi\n\r\n\u0011\n\u0001\nS%\u0004\nF\nW\n'\n\u001f\n\u0003\nW\n=\nF\nW\n\u0007\n\u001a\n\u001f (18)\nthen inequality (17) will be satisfied and hence \u0011\u0003\u0000<\u0011 ffi\u0006 \u0001\n\u001a\n\r . Thus we consider inequality (18), which after\nevaluating the derivative with respect to time and substituting for\nP\n\u0019Q9-&\u0002\n[ and \u0019W , becomes\n&'\n'( )\n* +\n,\n,.-0\/21\n304\n4\n5\n6\n&'\n'(\n)\n7\n6\u00188:9;8\n)\n7\n9\n)\n<\n6\n=\n)\n<\n=\n8\u000b>@?A9;8\n)\n>CBEDGF\n)\n<\n6\nH\n9\n)\n<\n6\n=JILK\n?\n=\n9\n)\nK\n=\nB\u0001M N\nO\nDQPRFS9\nITK\n?\n=\n9\n)\nK\n=\nB\u0001M\n6\nITK\n?\n=\n9\n)\nK\n=\nB\u0001M\n6\nDUF\nITK\n?\nH\n9\n)\nK\nH\nB\u0001MVD\nILK\n?\nH\n9\n)\nK\nH\nB\u0001M\n6\nF F\nO O\nDXW\n=ZY\n304\n4\n5\n&'\n'( )\n* +\n,\n,.-0\/\u00181\n304\n4\n5:[\nN\nThe LMI in the theorem then follows using standard Schur complement and congruency transformation argu-\nments, as reported, for example, in Mulder et al. (2001) (although the details are not the same).\nWe must now prove that such a compensator guarantees that the system is well-posed. To assist in proving\nexistence, we use the following lemma, based on a result from Grimm et al. (2001b) (proof deferred to the\nappendix C)\n9Lemma 1 Assume that = \u0004\u0001\u0000 =\nF\n_\u0002\u0000\n=\n\u0000\nF\n_\n'\n\u001a\n\u001f for some diagonal positive definite matrix \u0000 fl \u001f . Also assume\nthat the map \u0003 \u0003\u0006? \u0003\u0006\u0005&\u0007&\u0007 \u0013 \u000b \u0001 \u0019\u001a \u000b \u0001 B \u0001 is unique for all ? \u0003\u0006\u0005&\u0007 . Then 8 S\nF\n_\u0004\u0003\n\u0003\u0006? \u0003\u0006\u0005&\u0007&\u0007 is nonsingular for all matrices\n\u0003\n\t\u0006\u0005\n, where\n\u0005\n\u0013\/\" \u0015\u0007\u0003\n\u0003\u0006? \u0003\u0006\u0005\b\u0007&\u0007\n\u0013\b\u0003 \" \/Y0\n\u0005\n\u0011\n\u0003\n\t\n\u0017\n\u0003\u0006?\n\u0017\n\u0003\u0006\u0005\b\u0007&\u0007\u001f-\u000e\r\u000e\r\u000e\r -\u000b\t\n\u0001\n\u0003\u0006?\n\u0001\n\u0003\u0006\u0005\b\u0007&\u0007\u001f-\f\t\nffi\n\u0003\u0006?\nffi\n\u0003\u0006\u0005\b\u0007&\u0007\n\t\n\n \u001f\n-\n\"\n\u000f\nff (19)\nD\nNote that in order for the anti-windup system to be well-posed, we must have existence and uniqueness of the\nequations in the nonlinear loop. For this, we must be able to determine W [ uniquely from the expression\nW [\n\u0003\u0006\u0005\b\u0007\n\"\n\u0019\n] \u0017\n\u0019Q\u000e\u0003\u0006\u0005&\u0007\nS\n\u0003\n_\u0011\u000f \u0017 S\n\u0019\n_ \u0017 \u0000\n\u0007\nF\nW\n\u0003\u0006\u0005\b\u0007 (20)\nwhere FW \" _-+ \u0003 W \u0007 , or, equivalently, for some time varying, diagonal gain p \u0003 W \u0003\u0006\u0005\b\u0007&\u0007 \"\n* +\n\b\u0001\r\n\u0003\u000f\u000e\n\u0017\n\u0003\nW \u0017\n\u0003\u0006\u0005\b\u0007&\u0007\u001f-\u000e\r\u000e\r\u000e\r;-\u0010\u000e\nX\n\u0003\nWeX\n\u0003\u0006\u0005\b\u0007&\u0007\nwe can write FW \u0003\u0006\u0005&\u0007 \"\np\n\u0003\nW\n\u0003\u0006\u0005&\u0007&\u0007,\u0003\nW\n\u0001 ffi\n\r\n\u0003\u0006\u0005\b\u0007 =\nW [\n\u0003\u0006\u0005\b\u0007&\u0007\n, where \u000e ffi \u0003 WYffi \u0003\u0006\u0005&\u0007&\u0007 \t \n \u001f - \" \u000f - ! Weffi \u0003\u0006\u0005\b\u0007 by virtue of _-+ \u0003fi\r\/\u0007 \t\n2\u0018354\n\u0007%6\u001a7\n\n \u001f\n-\u000689\u000f\n. Furthermore, by Lipschitz continuity of _,+ \u0003fi\r\/\u0007 we know that p \u0003 W \u0003\u0006\u0005\b\u0007&\u0007 is unique for each W \u0003\u0006\u0005\b\u0007 .\nHence existence and uniqueness of solutions to (20) are equivalent to studying existence and uniqueness of\nsolutions to\nW\n[\n\u0003\u0006\u0005&\u0007\n\"\n\u0019\n]\n\u0017\n\u0019Q\u000e\u0003\u0006\u0005&\u0007\nS\nF\n_\np\n\u0003\nW\n\u0003\u0006\u0005\b\u0007&\u0007\nW \u0001\nffi\n\r\n\u0003\u0006\u0005\b\u0007\u000e=\nF\n_\np\n\u0003\nW\n\u0003\u0006\u0005&\u0007&\u0007\nW\n[\n\u0003\u0006\u0005\b\u0007 (21)\nwhere we have defined\nF\n_ \u0013\/\"\n\u0003\n_\u0011\u000f\n\u0017\nS\n\u0019\n_\n\u0017\n\u0000\n\u0007\n. A solution (or solutions) exist iff 8 S\nF\n_\np\n\u0003\nW\n\u0003\u0006\u0005&\u0007&\u0007 is invertible for\nall W \u0003\u0006\u0005\b\u0007 . Note that, in terms of Lemma 1,\np\n\u0003\nW\n\u0003\u0006\u0005&\u0007&\u0007 \t\u0011\u0005\n, and hence 8 S\nF\n_\np\n\u0003\nW\n\u0003\u0006\u0005&\u0007&\u0007 will be invertible for W \u0003\u0006\u0005\b\u0007 , as\nthe map\np\n\u0003fi\r\/\u0007\n\u0013\n\u000b\nX\n\u0019\u001a\n\u000b\nX\u0018B X is unique, if = \u0004\u0001\u0000 =\nF\n_\u0002\u0000\n=\n\u0000\nF\n_\n'\n\u001a\n\u001f for some positive definite diagonal matrix\n\u0000 : but this will be the case if the LMI (14) is satisfied for \u0000 \" \n\u000b\u0007 > \u0017 (from looking at the 2,2 term). This has\nproved that solutions exist, to further prove uniqueness is somewhat harder and is therefore deferred to appendix\nD. D D\nIf only stability of the anti-windup scheme is required, and finite-gain \u0000 \u0001 performance is not a priority, one can\nignore the last two rows and columns of the LMI in Theorem 1 and instead consider the corollary below.\nCorollary 1 There exists a static anti-windup compensator \u0000 \")\n \u0000 '\n\u0017\n\u0000\n'\n\u0001\n\u000f\n'\n\t\f\u000b\u0001\u0000\nX \u0007\ng\u0003\u0002\nB X\nwhich solves strongly\nthe anti-windup problem for all \u0007 \t \n \" -\t\b \u0007 if there exist matrices \u0006 fl \u001f , \u0007 \" \/ 0 \u0005 \u0011 \u0003\t\b \u0017 -\u000e\r\u000e\r\u000e\r\\-\u0003\b X \u0007 fl \u001f and\n\n\n\t\f\u000b\u0001\u0000\nX \u0007\ng\u0003\u0002\nB X\nsuch that the following LMI is satisfied\nj\n\u0006\n\u0019\nR\n'\nS\n\u0019\nR\u0011\u0006 U\n\u000f\n\u0007 S\n\u0019\nU \n\n=\n\u0006\n\u0019\n]\n'\n\u0017\n\u0013\n=\n\u0004\u0014\u0007\n=\n\u0007 _\n'\n\u000f\n\u0017\n=\n_\u0011\u000f\n\u0017\n\u0007\n=\n\n\n'\n\u0019\n_\n'\n\u0017\n=\n_\n\u0017\n\n\nm\n\u001a\n\u001f (22)\nFurthermore, if this inequality is satisfied, then a suitable \u0000 achieving \u0011\u0003\u0000>\u0011\\ffi\u0006 \u0000\n\u001a\n\r , for some \r fl \u001f and all\nintegers \u0007 \t \n \" -\t\b \u0007 , is given by \u0000 \"fi\nfl\u0007 > \u0017 . D\nProof: The proof of the LMI is much the same as before, except that we do not consider the performance term\n\u0011\n\u0002\n[\n\u0011\n\u0001\n=\n\r\n\u0001\n\u0011\bW \u0001\nffi\n\r\n\u0011\n\u0001 in the derivation. To prove that it still satisfies the strong anti-windup problem, we must prove\nthat \u0011\u0003\u0000>\u0011\bffi\u0006 \u0000\n\u001a\n\r , for some \r fl \u001f . To see this, note that the LMI (22) gives sufficient conditions for the existence\nof a quadratic Lyapunov function, ! \u0003 \u0019Q\u0004\u0007 \" \u0019Q ' # \u0019Q fl \u001f such that\nP\n!\n\u0003 \u0019Q%\u0007\n\u001a\n=\u0013\u0012\n\u0011\n\u0019Q\n\u0011\n\u0001\n, when W\u0004\u0001 ffi\n\r\n\"\n\u001f . This implies\n10\nthat the origin of (13) with FWa\" _-+ \u0003 W [ \u0007 - the state equation of \u0000 - is exponentially stable. Now note that the\nfunctions\n\u0000\n\u0003 \u0019Q -\nW\u0004\u0001 ffi\n\r\n\u0007\n\"\n\u0019\nR\n\u0019Q\nS\n\u0003\nU\u0010\u000fiS\n\u0019\nU \u0000\n\u0007\n_-+\n\u0003\nF\nW\n\u0007 (23)\n\u0001\n\u0003 \u0019Q -\nW\u0004\u0001 ffi\n\r\n\u0007\n\"\n\u0019\n] \u0001\n\u0019Q\nS\n\u0003\n_ \u000f \u0001 S\n\u0019\n_ \u0001 \u0000\n\u0007\n_-+\n\u0003\nF\nW\n\u0007 (24)\nare globally Lipschitz in both \u0019Q and W\u0002\u0001 ffi\n\r\n(refer to (13) for a description of FW and note well-posedness of the\ninterconnection). Then Theorem 6.1 in Khalil (1996) can be applied to establish that \u0011\u0003\u0000<\u0011 ffi\u0006 \u0000\n\u001a\n\r for some \r fl \u001f\nand all \u0007 \t \n \" -\t\b \u0007 , or, in other words, that the anti-windup problem is solved strongly. D D\nRemark 4: One may wonder about the point of Theorem 1 in the presence of Corollary 1 as they both solve\nstrongly the anti-windup problems but with Corollary 1 having less constraints and thus being more tractable\nnumerically. However, Corollary 1 gives no direct way of optimising the size of \u0000 , whereas in Theorem 1 this is\naddressed directly by introducing \r into the LMI, for the case of \u0007 \" \u0004 at least. On the other hand, for large or\nill-conditioned problems, the said numerical superiority of the LMI in Corollary 1 may well make it preferable.\nD\n4 Low-order anti-windup compensator synthesis\nThus far the work has focused on synthesising conditioning schemes of the form \u0001I\" \u0000 FW , with \u0000 being static.\nThis can often lead to satisfactory performance, but does not use any frequency information in the synthe-\nsis of the compensators. In particular, we are normally interested in reacting to saturation at low frequencies\ni.e. when \u001f\n\u0017\n\u0003\n!\n\u0007\nF\nW is large, \u001f\n\u0017\n\u0003\n!\n\u0007 being some low-pass filter. For example, it is not desirable, or even physi-\ncally\/computationally possible, to react to saturation caused by a very high frequency sinusoidal disturbance at\nthe controller input, say at \" \u001f \u0017 \u0001 radians\/s. Moreover it is well documented (see Doyle et al. (1987) or Grimm et\nal. (2001a) ) that static compensation can be infeasible in situations where dynamic compensation may well be\nfeasible.\nIn contrast, most dynamic schemes available with some sort of stability guarantees, are of order at least equal to\nthat of the plant (for example the IMC scheme, the \u0000 \u0001 scheme of Teel & Kapoor (1997), the normalised coprime\nfactor scheme of Weston & Postlethwaite (2000)). For many applications this can lead to a prohibitively high\ncomputational overhead, both for synthesis and implementation. Hence it is logical to address the synthesis of\nlow-order compensators.\nIn principle, the results of Grimm et al. (2001b) may be used to derive low order compensators achieving a\nprescribed \u0000 \u0001 gain (although, as stated in the introduction, this \u0000 \u0001 gain is defined on a different system, and\nis less helpful than the one we consider here), although the resulting optimisation problem is, generally, non-\nconvex, meaning that iterative algorithms for computing fixed-order optimal compensators are prone to becoming\nstuck at local minima. The approach we propose is definitely sub-optimal, but we have found it to give good\nresults in practice.\n11\n4.1 A sub-optimal approach\nThe proposal retains much of the simplicity of the static approach, except we now let our compensator be\ndescribed by the dynamic equations\n\u0000\n\u0003\n!\n\u0007\n\"\nj\n\u0000 \u0017\n\u0003\n!\n\u0007\n\u0000 \u0001\n\u0003\n!\n\u0007\nm\n\t\nA\n\u0000\nX \u0007\ng\f\u0002\nB X (25)\nwhere\n\u0000 \u0017\n\u0003\n!\n\u0007\n\u0013\/\" \u0000 \u0017\n\u0003\n!\n\u0007\nF\n\u0000 \u0017 (26)\n\u0000 \u0001\n\u0003\n!\n\u0007\n\u0013\/\" \u0000 \u0001\n\u0003\n!\n\u0007\nF\n\u0000 \u0001 (27)\nwhere \u0000 \u0017 \u0003 ! \u0007T\t A X B X and \u0000 \u0001 \u0003 ! \u0007G\t A g B g are transfer function matrices and\nF\n\u0000 \u0017\n\t \u000b\nX`B X\nand\nF\n\u0000 \u0001\n\t \u000bMg\nB X\nare\nconstant matrices. Obviously, \u0000 \u0017 \u0003 ! \u0007 and \u0000 \u0001 \u0003 ! \u0007 could be sythesised in an optimal fashion directly, but this could\nbe computationally expensive; lead to unsuitable compensators (large poles, sensitive to parameter variations -\nwell known from H J based LMI synthesis); and leave little room for intuition.\nInstead we propose that \u0000\n\u0017\n\u0003\n!\n\u0007\u001f-\n\u0000 \u0001\n\u0003\n!\n\u0007 be chosen using intuition and experience, and then\nF\n\u0000\n\u0017\n-\nF\n\u0000 \u0001 are syntheised\nin an optimal way, similar to the pure static synthesis described earlier. Obviously the resulting compensator\nwill be sub-optimal in terms of its \u0000 \u0001 gain but simulation results have shown that using relatively simple choices\nfor \u0000\n\u0017\n\u0003\n!\n\u0007\u001f-\n\u0000 \u0001\n\u0003\n!\n\u0007\n, such as first order low pass filters (which suppress high frequency signals in \u0002 [ ), very good\nresponses can be obtained. In the scalar case, \u0000 \u0017 \u0003 ! \u0007\u001f- \u0000 \u0001 \u0003 ! \u0007 can be chosen, guided by the graphical Circle Crite-\nrion. Typically, the modulus of the poles of \u0000n\u0017 \u0003 ! \u0007\u001f- \u0000 \u0001 \u0003 ! \u0007 should be less than or equal to those of the controller,\notherwise implementational difficulties can arise.\n4.2 A sub-optimal synthesis routine\nAs before we obtain that\n\u0002 \"\n\u0003C8 =\np\n\u0001\nK\n\u0001\n\u0007\n>\n\u0017\n\u0003r=\np\n\u0001\n\u0000\n\u0001\nS \u0000\n\t\n\u0007 (28)\nexcept that this time \u0000\n\u0017\n\u0003\n!\n\u0007\n\"\u0001\u0000\n\u0017\n\u0003\n!\n\u0007\nF\n\u0000\n\u0017\nand \u0000 \u0001 \u0003 ! \u0007 \"\u0001\u0000 \u0001 \u0003 ! \u0007\nF\n\u0000 \u0001 are dynamic. Also as before this implies that\n\u0002\n= 8\n\"\n\u0003C8 =\np\n\u0001\nK\n\u0001\n\u0007\n>\n\u0017\n\u0003r=\np\n\u0001 \u0000 \u0001MS \u0000\n\t\n\u0007c= 8 (29)\nK\n\u0001 \u0002 \"\nK\n\u0001\n\u0003C8 =\np\n\u0001\nK\n\u0001\n\u0007\n>\n\u0017\n\u0003r=\np\n\u0001 \u0000 \u0001iS \u0000\u0010\t\n\u0007 (30)\nA minimal state-space realisation for these expressions can be derived as\nj\n\u0002\n\u0003\n!\n\u0007\u000e=\u00148\nK\n\u0001\n\u0003\n!\n\u0007\n\u0002\n\u0003\n!\n\u0007\nm\nL\n\u000b\n\f\n\f\n\r\n\f\n\f\n\u000e\nP\n\u0019Q\n\"\n\u0019\nR\n\u0019Q\nS\n\u0003\nU\u0010\u000fiS\n\u0019\nU\nF\n\u0000\n\u0007\nF\nW\nW\n[\n\"\n\u0019\n]\n\u0017\n\u0019Q\nS\n\u0003\n_\u0011\u000f\n\u0017\nS\n\u0019\n_\n\u0017\nF\n\u0000\n\u0007\nF\nW\n\u0002\n[\n\"\n\u0019\n] \u0001\n\u0019Q\nS\n\u0003\n_\u0011\u000f \u0001iS\n\u0019\n_ \u0001\nF\n\u0000\n\u0007\nF\nW\n(31)\nwhere the matrices4 are described in Appendix B and\nF\n\u0000 is given as\nF\n\u0000O\u0013\/\" \n\nF\n\u0000\n'\n\u0017\nF\n\u0000\n'\n\u0001\n\u000f\n'\n. Similar to the static case\nwe have the following theorem:\n4The matrices \u0002\n\u0003\netc. are different from those in the previous section because they also incorporate the dynamics of \u0004\u0006\u0005\b\u0007\n\t in addition.\n12\nTheorem 2 Given \u0000 \u0017 \u0003 ! \u0007\u001f- \u0000 \u0001 \u0003 ! \u0007 , where \/ 3\u000e\u0011 \u0003 \u0000 \u0017 \u0003 ! \u0007&\u0007 \"\u0001\u0000 \u0017 and \/ 3\u000e\u0011 \u0003 \u0000 \u0001 \u0003 ! \u0007&\u0007 \"\u0002\u0000 \u0001 , and\nF\n\u0000 \" \n\nF\n\u0000\n'\n\u0017\nF\n\u0000\n'\n\u0001\n\u000f\n'\n\t\n\u000b\u0001\u0000\nX \u0007\ng\f\u0002\nB X\n, then there exists an \u0003 \u0000M\u0017 S\u0003\u0000 \u0001 \u0007 ’th order anti-windup compensator of the form\n\u0000\n\u0003\n!\n\u0007\n\"\nj\n\u0000 \u0017\n\u0003\n!\n\u0007\nF\n\u0000 \u0017\n\u0000 \u0001\n\u0003\n!\n\u0007\nF\n\u0000 \u0001\nm\n(32)\nwhich solves strongly the anti-windup problem if there exist matrices \u0006 fl \u001f , \u0007 \" \/ 0 \u0005 \u0011 \u0003\t\b \u0017 -\u000e\r\u000e\r\u000e\rb-\u0003\b X \u0007 fl \u001f ,\n\n\n\t \u000b \u0000\nX \u0007\ng\f\u0002\nB X\nand a positive real scalar \r such that the LMI (14) is satisfied (with the state-space realisation\nof equation (31)). Furthermore, if inequality (14) is statisfied, a suitable\nF\n\u0000 achieving \u0011\u0003\u0000<\u0011fiffi\u0006 \u0001\n\u001a\n\r is given by\nF\n\u0000 \"fi\n\u000b\u0007\n>\n\u0017\n. D\nProof: The proof is similar, mutatis mutandis, to that of Theorem 1.\nCorollary 2 Given \u0000 \u0017 \u0003 ! \u0007\u001f- \u0000 \u0001 \u0003 ! \u0007 , where \/ 3\u000e\u0011 \u0003 \u0000 \u0017 \u0003 ! \u0007&\u0007 \"\u0004\u0000 \u0017 and \/ 3\u000e\u0011 \u0003 \u0000 \u0001 \u0003 ! \u0007&\u0007 \"\u0004\u0000 \u0001 , and\nF\n\u0000 \" \n\nF\n\u0000\n'\n\u0017\nF\n\u0000\n'\n\u0001\n\u000f\n'\n, then\nthere exists an \u0003 \u0000c\u0017^S\u0005\u0000 \u0001 \u0007 ’th order anti-windup compensator of the form\n\u0000\n\u0003\n!\n\u0007\n\"\nj\n\u0000 \u0017\n\u0003\n!\n\u0007\nF\n\u0000 \u0017\n\u0000 \u0001\n\u0003\n!\n\u0007\nF\n\u0000 \u0001\nm\n(33)\nwhich solves the anti-windup problem for all integers \u0007 \t \n \" -\t\b \u0007 if there exist matrices \u0006 fl \u001f , \u0007 \" \/Y0 \u0005 \u0011 \u0003\t\b \u0017 -\u000e\r\u000e\r\u000e\r -\u0003\b X \u0007 fl\n\u001f and \n \t\f\u000b\u0001\u0000 X \u0007 g\u0003\u0002 B X such that the LMI (22) is satisfied (with the state-space reaslisation of equation (31)). Fur-\nthermore, if inequality (22) is satisfied, a suitable\nF\n\u0000 achieving \u0011\u0003\u0000>\u0011fiffi\u0006 \u0000\n\u001a\n\r , for some \r fl \u001f and all integers\n\u0007\n\t\n\n \"\n-\t\b \u0007\n, is given by\nF\n\u0000 \"fi\nfl\u0007\n>\n\u0017\n. D\nProof: The proof is similar, mutatis mutandis, to that of Corollary 1. D D\nRemark 5: Note that throughout the paper so far, stability and dissipativity have been established through the\nuse of a purely quadratic Lyapunov function, ! \u0003 \u0019Q \u0007 \" \u0019Q ' # \u0019Q fl \u001f . In order to reduce the conservatism inherent in\nsuch an approach it would be preferable to use a different type of Lyapunov function; in particular a function of\nthe Lur’e type seems appropriate i.e.\n!\n\u0003 \u0019Q%\u0007\n\"\n\u0019Q\n'\n#\n\u0019Q\nS%\u0004\nX\n\u0006\nffi\b\u0007\n\u0017\n0\nffi\n\t\f\u000b\n\r\u000f\u000e\n\u000f\n_,+\\ffi\n\u0003\u0011\u0010 \u0007\n*\n\u0010 (34)\nUnfortunately, as pointed out in Weston & Postlethwaite (2000), such a choice of Lyapunov function generally\ndoes not lead to a convex problem for anti-windup compensator synthesis5 , and hence the determination of a\ncompensator becomes more difficult.\n5 Examples\nWe demonstrate our results on known examples in the literature and compare our anti-windup solutions with\nother optimal methods. As most of these techniques require the use of LMI’s in the synthesis of compensators\nwe decided to use one LMI solver, the Matlab LMI toolbox (Gahinet et al. (1995)), exclusively. This seemed\nreasonably robust, in a numerical sense, although it did seem to be “cautious” compared to some solvers. We\nalso tried solving the problems using the SDPHA LMI solver of Potre et al. (1997). Although this tended to\nbe less cautious than the LMI toolbox, and in many cases led to systems with better time responses, it also had\ninstances of finding problems feasible, which were not strictly feasible, thus leading to erroneous results.\n5For analysis purposes, more general Lyapunov functions can be used\n13\n5.1 Simple dynamic compensator example\nWe consider the example introduced in Mulder & Kothare (2000) and also considered in Grimm et al. (2001a)\nfor which static anti-windup compensation is not feasible (in the sense that the LMI’s associated with static\nsynthesis are infeasible). This rules out our static results, but we find that our low-order results are feasible. We\ncompare this with the full-order dynamic compensation results of Grimm et al. (2001b) and the well-known IMC\nsolution, which for stable plants\nK\n\u0001\n\u0003\n!\n\u0007 always leads to a stable, full-order compensator.\nThe plant is described by\nRl\u0000 \"\nj\n=\n\u001f\n\r\n\u0004\n=\n\u001f\n\r\n\u0004\n\" \u001f\nm\n-\nU\n\u0000 \"\nj\n\"\n\u001f\nm\n-\nU \u0000\\[ \"\nj\n\u001f\n\u001f\nm\n(35)\n]^\u0000 \" \n\n=\n\u001f\n\r\u0001\u0000 =\n\u001f\n\r\u0003\u0002\t\u000f -\n_`\u0000 \"\n=\n\u001f\n\r\u0003\u0004 -\n_ \u0000\\[ \"\n\u001f (36)\nThe saturation limits are fixed at \u0005 \u001f \r\u0003\u0004 and the controller is described by\nR\nq\n\" \u001f\n-\nU\nq\n\"\n=\nU\nq s\n\" \" (37)\n]\nq\n\" \u0004\n-\n_\nq\n\"\n=\n_\nqts\n\" \u0004 (38)\nFor our low-order synthesis we chose our dynamic parts as first order low-pass filters:\n\u0000\n\u0017\n\u0003\n!\n\u0007\n\"\n\"\n\u001f\u001a\u001f\u001a\u001f\n!\nS \"\n\u001f\u001a\u001f\u001a\u001f\n-\n\u0000 \u0001\n\u0003\n!\n\u0007\n\"\n\u001f\n\r\u0001\u0000\n!\u0001S\n\u001f\n\r\u0001\u0000\n(39)\nThese values for \u0000 \u0017 \u0003 ! \u0007 and \u0000 \u0001 \u0003 ! \u0007 were arrived at after several iterations. After solving the LMI in Theorem 2,\nthe optimal value of\nF\n\u0000 returned was\nF\n\u0000 \"\nj\nF\n\u0000\n\u0017\nF\n\u0000\n\u0001\nm\n\"\nj\n=\n\u001f\n\r\u0003\u0002\u0007\u0006\u0007\b\n\u001f\n=\n\u001f\n\r\n\t\u0007\t\u000b\u0000\f\t\nm\n-\n\u0011\u0003\u0000>\u0011\nffi\u0006 \u0001\n\u001a\n\r\u000e\r \" \u0004\n\r\n\t\n\"\n\u0002\n\u0004 (40)\nFigure 4 shows the responses of the various anti-windup compensators. Clearly, the low-order compensator\nof Theorem 2 shows the most desirable response with a fast settling time and little oscillation. The dynamic\ncompensation of Grimm et al. (2001b) is also good, but it exhibits a slower return to linear behaviour and a\nslightly more oscillatory response. The IMC compensation, which had yielded \u0011\u0003\u0000>\u0011 ffi\u0006 \u0001 \" \u0011\nK\n\u0001\n\u0011\nJ\n\r \"\n\u001f\n\r\n\t\n\u0004 , leads\nto a stable but slow response and obviously the worst behaviour is observed when no anti-windup compensation\nis present. No static responses are shown due to infeasibility.\nIt is worth noting that in this case the “low-order” example is not really low order as the dimension of \u0001 is the\nsame as the number of plant states. Hence the compensator returned by Theorem 2 is of the same order as the\nfull-order dynamic compensator obtained using the technique of Grimm et al. (2001b). However, it is important\nto remark that the Grimm et al. (2001b) compensator leads to a markedly worse reponse than that of Theorem\n2; this is because Theorem 2 leads to a direct minimisation of \u0011\u0003\u0000<\u0011\\ffi\u0006 \u0001 , whereas the formulae of Grimm et al.\n(2001b) concentrate on a closed-loop transfer function.\n5.2 A more realistic example: missile auto-pilot\nIn this section, we consider a more realistic application: a missile auto-pilot. This example was introduced\ninto the wider literature in Rodriguez & Cloutier (1994) to demonstrate the effectiveness of an ‘error governor’,\n14\n0 5 10 15 20 25 30 35 40\n0\n0.5\n1\n1.5\n2\n2.5\n3\n3.5\nTime − seconds\nO\nut\npu\nt\nnominal linear\nTheorem 2\nIMC\nno anti−windup\nGrimm dynamic\nFigure 4: Comparison of different anti-windup schemes for low-order example\n0 1 2 3 4 5 6 7 8 9 10\n−5\n−4\n−3\n−2\n−1\n0\n1\n2\n3\n4\n5\nTime − seconds\nO\nut\npu\nt\nOutput Response\n0 1 2 3 4 5 6 7 8 9 10\n−12\n−10\n−8\n−6\n−4\n−2\n0\n2\nTime − seconds\nCo\nnt\nro\nl\nControl Reponses\nFigure 5: Nominal linear response of missile\noriginally proposed by Kapasouris et al. (1988). Romanchuk (1999) also notes the interest of this example. The\nplant in question is a simplified model of the dynamics of the roll-yaw channels of a bank-to-turn missile. The\ncontroller used is of the LQG\/LTR type which yields excellent nominal closed-loop response types in both time\nand frequency domains. The state-space data of these systems are described in Appendix E. In accordance with\nRodriguez & Cloutier (1994), the actuator limits are set at \u0005 8 in both channels.\nFigure 5 shows the nominal linear responses of the closed-loop system for a pulse of u \"\u000b\n \u0000 \r \u0004 = \u0000 \r \u0004 \u000f ' . Note the\n0 1 2 3 4 5 6 7 8 9 10\n−12\n−10\n−8\n−6\n−4\n−2\n0\n2\n4\n6\n8\nTime − seconds\nCo\nnt\nro\nl\nOutput Response\n0 1 2 3 4 5 6 7 8 9 10\n−8\n−7\n−6\n−5\n−4\n−3\n−2\n−1\n0\n1\nTime − seconds\nCo\nnt\nro\nl\nControl Reponses\nFigure 6: Uncompensated saturated response of missile\n15\nexcellent decoupling, but observe that the control effort strays outside the set & \" 4 6 \u0015 \u0003r= \u0000 -\\= \u0000 \u0007\u001f-b\u0003r= \u0000 - \u0000 \u0007\u001f-b\u0003 \u0000 - \u0000 \u0007\u001f-b\u0003 \u0000 - = \u0000 \u0007 ff\nfor some time, meaning that we can expect a poor response if actuator saturation were to be introduced. This\nintuition is verified in Figure 6, where it can be observed that the decoupling in the nominal response is destroyed\nby the introduction of actuator limits. Also notice that even in the first channel, tracking performance is lost due\nto the so-called infeasibility of the reference 6.\n0 1 2 3 4 5 6 7 8 9 10\n−5\n−4\n−3\n−2\n−1\n0\n1\n2\n3\n4\n5\nTime − seconds\nO\nut\npu\nt\nFigure 7: Static compensation of Grimm et al. = compensated; =\u0018= nominal linear\nFigure 7 shows the missile response with the static anti-windup compensation of Grimm et al. (2001b), which\nis also equivalent to that described by Mulder et al. (2001). The dynamic compensation is not shown for two\nreasons: it leads to responses almost identical to the static compensation; also, it leads to numerical problems as\nthe compensators it generated had large poles and hence required a very small sample time for simulation (this\nproblem with large poles also occurs with LMI-based H J synthesis). The optimal static compensator leads to\nan optimal performance index from the reference, u to the objective +I\" u\u0018= \u0002 of \u0004\u0002\u0001\u0004\u0003 s\n8\u0006\u0005\n\u0013\n\u0007\t\b\n\u0007\n\u0013\n\u0007\ns\n\u0007\n\u0013\n\u001a\n\r \" \u0004\n\r\n\u0004\n\u0002\u0007\b \t\n(the dynamic compensation led to a slightly smaller \r \" \" \r\n\t \u0000 \b \u0000 ) 7. From the figure it is obvious that this\ncompensation leads to improved performance compared to the uncompensated system, although the second\nchannel still has some significant differences to the linear response. Note that in both channels there is still some\nerror during the pulse due to the infeasibility of the reference.\nFigure 8 shows the missile responses with the IMC based anti-windup compensation. The performance, as\nmeasured by the \u0000 \u0001 induced norm of the mapping of \u0000 , is \r \r \b \t \u0006\u0018\r \u0004 \u0004 . Although the first channel behaves\nacceptably, the second channel does not and is scarcely better than the uncompensated response.\nFigure 9 shows the missile response with the static anti-windup scheme proposed in this paper. Theorem 1 was\nused to obtain the optimal \u0000 as\n\u0000 \"\n\u000e\u000f\n\u000f\n\u000f\n\u000f\n\u000f\n\u0010\n=\n\u001f\n\r\u0003\u0002\u0007\u0002\u0007\u0002\n\u0004\n=\n\u001f\n\r\n\u001f\u001a\u001f\n\b\u0007\u0002\n\u001f\n\r\n\u001f\n\"\n\t \b =\n\u001f\n\r\u0003\u0006\u0007\u0002\n\u0004\n\u001f\n=\n\u001f\n\r\n\u001f\n\"\u001a\" \u0004\n=\n\u001f\n\r\u0003\u0004\u0007\u0004 \t \b\n=\n\u001f\n\r\n\u0004\n\u001f\n\u0004 \u0004\n=\n\u001f\n\r\u0003\b \u0000\n\u001f\n\u0000\n\u0016\u0018\u0017\n\u0017\n\u0017\n\u0017\n\u0017\n\u0019\n-\n\u0011\u0003\u0000<\u0011\bffi\u0006 \u0001\n\u001a\n\r \r\n\b \t\n\u0000\n\r\n\u0004\n\u0004 (41)\n6A reference is called infeasible if, in the steady state it leads to a control signal which is permanently above the actuator saturation\nthreshold.\n7NB - these values of \u000b are not comparable with those associated with \f\u000e\r\u000f\f \u000e\u0011\u0010 \u0013\n16\n0 1 2 3 4 5 6 7 8 9 10\n−5\n0\n5\n10\nTime − seconds\nO\nut\npu\nt\nFigure 8: IMC compensation: = compensated; =\u0018= nominal linear\n0 1 2 3 4 5 6 7 8 9 10\n−5\n−4\n−3\n−2\n−1\n0\n1\n2\n3\n4\n5\nTime − seconds\nO\nut\npu\nt\nFigure 9: Static compensation of Theorem 1: = compensated; = = nominal linear\nThe response of the first channel is again acceptable and channel 2 exhibits an improved response over the IMC\nand uncompensated responses. However as with the performance obtained with static scheme of Grimm et al.\n(2001b), there is some significant deviation from the linear response. Somewhat surprisingly, the bound on\n\u0011\u0003\u0000<\u0011\bffi\u0006 \u0001 is actually higher for the optimal static compensator than for the IMC compensator.\nFigure 10 shows the missile response with a low-order static compensator. As the designer has several tuning\nparameters, four or five iterations were performed in order to obtain the best response. For this problem we chose\n\u0000i\u0017\n\u0003\n!\n\u0007\n\" \/ 0\n\u0005\n\u0011\n\u0003\n\u0004\n!\nS%\u0004\n-\n\"\n\u0007\n\u0000\n\u0001\n\u0003\n!\n\u0007\n\"\n8\n\u0001 (42)\nand, according to Theorem 2,\nF\n\u0000 was calculated as\nF\n\u0000 \"\n\u000e\u000f\n\u000f\n\u000f\n\u000f\n\u000f\n\u0010\n=\n\u001f\n\r\n\u0000 \u0000\n\u0000 \b\n\"\n\r\n\"\n\b\n\"\n\u0006\n\u0004\n\r\u0003\u0006\n\u001f\n\u0006\n\u0004\n\u0006\u0007\b\u0018\r\u0003\u0002\u0007\b\u0007\b \t\n= \u0006\u0018\r\n\u0004 \u0004\n\u0000\n\"\n= \b\n\u001f\n\u0000 \r\u0001\u0000\n\u001f\n\u0004\u0007\u0006\n=\n\"\u001a\"\n\u0006\u0018\r\u0003\u0002\n\u0004\n\u0004\u0007\b = \u0002\u0018\r\u0001\u0000\u0007\u0000\n\u0004\n\t\n\u0016\u0018\u0017\n\u0017\n\u0017\n\u0017\n\u0017\n\u0019\n-\n\u0011\u0003\u0000 \u0011\nffi  \u0001\n\u001a\n\r>\"\n\b \t \u0006\u0018\r\n\t\n\u0004 \u0004\n\u0006 (43)\nThis response is the best exhibted by the anti-windup compensators demonstrated here. Both channels behave\nwell when compared to the linear response, the second being almost identical. There is, of course, some deviation\n17\n0 1 2 3 4 5 6 7 8 9 10\n−5\n−4\n−3\n−2\n−1\n0\n1\n2\n3\n4\n5\nTime − seconds\nO\nut\npu\nt\nFigure 10: Dynamic compensation of Theorem 2: = compensated; = = nominal linear\ndue to the infeasibility of the reference variable which results in a temporary error, but return to linear behaviour\nis swift after this occurrence. The order of this anti-windup compensator is 1, as \u0000 \u0001 \u0003 ! \u0007 and one channel of \u0000 \u0017 \u0003 ! \u0007\nwas chosen to be static, making it more attractive than the IMC and dynamic compensators of Grimm et al.\n(2001b) from a computational point of view. The choice of the compensator dynamics was also found helpful\nand by sensible selection it is easy to avoid large poles which may result from the synthesis procedure of Grimm\net al. (2001b).\n6 Conclusion\nThis paper has considered the static anti-windup synthesis problem from a new perspective, and one which,\nwe believe is conceptually appealing and central to the “true” anti-windup problem. We have also proposed,\nwe believe, the first constructive, numerically tractable procedure, for the synthesis of low order anti-windup\ncompensators, for which stability and performance of the overall system are guaranteed. Simple examples have\nshown the effectiveness of these schemes, although we think the true worth of these results will be greater when\ndemonstrated on more realistic and complex systems. In such cases, it is often imperative to have an intuitive\nscheme to which one can consult if there are problems with initial designs. For this reason there needs to be\nfurther work on the choice of dynamics for the low order scheme. This is the subject of continuing research.\nIt is still necessary to re-examine some of the more traditional techniques in the light of these new results.\nAlthough we think our work on low-order dynamic compensators may help to explain why simple compensators\ncan work in many cases, there is still some way to go before we can justify why some of these techniques\nsometimes work better than optimal techniques. Some insight to this problem is also found in Mulder & Kothare\n(2000), where it is shown that quadratic Lyapunov functions are sometimes not always sufficiently general for\nthe anti-windup problem, but, again, more research remains to be conducted.\n18\n7 Acknowledgements\nThe authors would like to thank Dr. Guido Herrmann of University of Leicester for pointing out an error in the\nuniqueness part of the proof of Theorem 1 in an early draft, and for other useful comments.\nReferences\nAstrom, K.J. & Rundqwist, L. (1989), ‘Integrator windup and how to avoid it’, Proc. American Control Confer-\nence 2, 1693–1698.\nCrawshaw, S. & Vinnicombe, G. (2000), ‘Anti-windup synthesis for guaranteed \u0000 \u0001 performance’, Proc. IEEE\nConference on Decision and Control.\nDe Dona, J.A., Moheimani, S.O.R. & Goodwin, G.C. (2000), ‘Robust combined PLC\/LHG controller with\nallowed over-saturation of the input signal’, Proc. American Control Conference pp. 750–751.\nDoyle, J.C., Enns, D.F. & Smith, R.S. (1987), ‘Control of plants with input saturation nonlinearities’, Proc.\nAmerican Control Conference pp. 2147–2152.\nGahinet, P., Nemirovski, A., Laub, A.J. & Chilali, M. (1995), LMI Control Toolbox, The MathWorks Inc.\nGarcia, G., Tarbouriech, S., Suarez, R. & Alvarez-Ramirez, J. (1999), ‘Nonlinear bounded control for norm-\nbounded uncertain systems’, IEEE Transactions on Automatic Control 44(8), 1254–1258.\nGrimm, G., Hatfield, J., Postlethwaite, I., Teel, A.R., Turner, M.C. & Zaccarian, L. (2003), ‘Anti-windup for\nstable linear systems with input saturation: an LMI based synthesis’, IEEE Transactions on Automatic\nControl 48(9), 1509–1525.\nGrimm, G., Postlethwaite, I., Teel, A.R., Turner, M.C. & Zaccarian, L. (2001a), ‘Case studies using linear matrix\ninequalities for optimal anti-windup compensator synthesis’, Proc. European Control Conference.\nGrimm, G., Postlethwaite, I., Teel, A.R., Turner, M.C. & Zaccarian, L. (2001b), ‘Linear matrix inequalities for\nfull and reduced order anti-windup synthesis’, Proc. American Control Conference.\nKapasouris, P., Athans, M. & Stein, G. (1988), ‘Design of feedback control systems for stable plants with\nsaturating actuators’, Proc. IEEE Conference on Decision and Control.\nKapoor, N., Teel, A.R. & Daoutidis, P. (1998), ‘An anti-windup design for linear systems with input saturation’,\nAutomatica 34(5), 559–574.\nKhalil, H.K. (1996), Nonlinear Systems, Prentice Hall, New Jersey.\nKothare, M.V., Campo, P.J., Morari, M. & Nett, C.N. (1994), ‘A unified framework for the study of anti-windup\ndesigns’, Automatica 30(12), 1869–1883.\nMiyamoto, S. & Vinnicombe, G. (1996), ‘Robust control of plants with saturation nonlinearity based on com-\nprime factor representations’, Proc. IEEE Conference on Decision and Control pp. 2838–2840.\n19\nMulder, E.F. & Kothare, M.V. (2000), ‘Synthesis of stabilising anti-windup controllers using piecewise quadratic\nLyapunov functions’, Proc. American Control Conference pp. 3239–3243.\nMulder, E.F., Kothare, M.V. & Morari, M. (2001), ‘Multivariable anti-windup controller synthesis using linear\nmatrix inequalities’, Automatica 37(9), 1407–1416.\nPotre, F., Sheng, R. & Brixius, N. (1997), ‘SDPHA: A code for semidefinite programming’,\nhttp:\/\/www.math.uiowa.edu\/ rsheng\/SDPHA\/sdpha.html.\nRodriguez, A.A. & Cloutier, J. R. (1994), ‘Control of a bank-to-turn missile with saturating actuators’, Proc.\nAmerican Control Conference.\nRomanchuk, B.G. (1999), ‘Some comments on anti-windup synthesis using LMI’s’, International Journal of\nRobust and Nonlinear Control 9(10), 717–734.\nSaberi, A., Lin, Z. & Teel, A.R. (1996), ‘Control of linear systems with saturating actuators’, IEEE Transactions\non Automatic Control 41(3), 368–378.\nTeel, A.R. & Kapoor, N. (1997), ‘The \u0000 \u0001 anti-windup problem: Its definition and solution’, Proceedings of the\nEuropean Control Conference.\nTurner, M.C., Herrmann, G. & Postlethwaite, I. (2003), ‘Accounting for uncertainty in anti-windup synthesis’,\nsubmitted.\nTurner, M.C., Postlethwaite, I. & Walker, D.J. (2000), ‘Nonlinear tracking control for multivariable constrained\ninput linear systems’, International Journal of Control 73(12), 1160–1172.\nWada, N. & Saeki, M. (1999), ‘Design of a static anti-windup compensator which guarantees robust stability’,\nTransactions of the Institute of Systems, Control and Instrumentation Enigneers 12(11), 664–670.\nWalgama, K.S. & Sternby, J. (1990), ‘Inherent observer property in a class of anti-windup compensators’, Inter-\nnational Journal of Control 52, 705–724.\nWeston, P.F. & Postlethwaite, I (1998), ‘Analysis and design of linear conditioning schemes for systems contain-\ning saturating actuators’, IFAC Nonlinear Control System Design Symposium.\nWeston, P.F. & Postlethwaite, I (2000), ‘Linear conditioning for systems containing saturating actuators’, Auto-\nmatica 36(9), 1347–1354.\n20\nA State-space derivation for static anti-windup compensator\nSome tedious algebra yields the state space matrices for a minimal realisation of \n \u0002 ' = 8 \u0003\nK\n\u0001 \u0002\n\u0007\n'\n\u000f\n'\nas\n\u0019Q\n\u0013\/\"\nj\nQ\n\u0000\nQ q\nm\n-\n\u0019\nR\u0014\u0013\/\"\nj\nRl\u0000TSZU\u0001\u0000\nF\nEfl_\nq\n]^\u0000 U\n\u0000\nF\nEo]\nq\nU\nq\nEo]^\u0000 R\nq\nSVU\nq\nE _`\u0000 ]\nq\nm\n-\nU\u0010\u000f \u0013\/\"\nj\nU\n\u0000\nF\nE\nU\nq\nEfl_`\u0000\nm\n- (44)\n\u0019\nU \u0013\/\"\nj\nU\n\u0000\nF\nE\n=\nU\n\u0000\nF\nE _\nq\nU\nq\nE _ \u0000\n=\nU\nq\nE m\n-\n\u0000 \u0013\/\"\nj\n\u0000 \u0017\n\u0000 \u0001\nm\n- (45)\n\u0019\n] \u0017 \u0013\/\" \n\nF\nE _\nq\n]^\u0000\nF\nEo]\nq \u000f -\n_\u0011\u000f \u0017 \u0013\/\"\nF\nE _\nq\n_`\u0000\n-\n\u0019\n_ \u0017 \u0013\/\")\n\nF\nE\n=\nF\nE _\nq \u000f - (46)\n\u0019\n] \u0001 \u0013\/\" \n Eo]^\u0000 E _`\u0000 ]\nq \u000f -\n_\u0011\u000f \u0001`\u0013\/\" E _`\u0000\n-\n\u0019\n_ \u0001 \u0013\/\")\n E _`\u0000\n=\nE _`\u0000 _\nq \u000f (47)\nB State-space derivation for dynamic anti-windup compensator\nAs \u0000 \u0017 \u0003 ! \u0007 \"\u0001\u0000 \u0017 \u0003 ! \u0007\nF\n\u0000 \u0017 and \u0000 \u0001 \u0003 ! \u0007 \"\u0001\u0000 \u0001 \u0003 ! \u0007\nF\n\u0000 \u0001 , we assign the state-space realisations\n\u0000\n\t\n\u0003\n!\n\u0007\n\" \u0000\n\u0017\n\u0003\n!\n\u0007\nS\n8 L N P\nQ\n\u0017 \" R\u0018\u0017\nQ\n\u0017 SVU \u0017\nF\n\u0000 \u0017\nF\nW\nF\n\u0000 \" ]\n\u0017\nQ\n\u0017\nS\n\u0003\n_\n\u0017\nF\n\u0000\n\u0017\nS\n8 \u0007\nF\nW\n(48)\n\u0000 \u0001\n\u0003\n!\n\u0007 L N\nP\nQ\n\u0001 \" R \u0001\nQ\n\u0001iSVU \u0001\nF\n\u0000 \u0001\nF\nW\nF\nu\n\" ] \u0001\nQ\n\u0001iSV_ \u0001\nF\n\u0000 \u0001\nF\nW\n(49)\nwhere Q \u0017 \t \u000b \r \u0000 -&Q \u0001 \t>\u000b \r \u0013 . Some tedious algebra then yields the state-space matrices for a minimal realisation\nof \n \u0002 ' = 8 \u0003\nK\n\u0001 \u0002\n\u0007\n'\n\u000f\n'\nas\n\u0019\nR \"\n\u000e\u000f\n\u000f\n\u000f\n\u000f\n\u000f\n\u0010\nR\u0001\u0000TSVU\n\u0000\nF\nE _\nq\n]^\u0000 U\n\u0000\nF\nEo]\nq\nU\u0001\u0000\nF\nEI]\n\u0017\n=\nU\n\u0000\nF\nE _\nq\n] \u0001\nU\nq\nEI]^\u0000 R\nq\nSVU\nq\nE _`\u0000 ]\nq\nU\nq\nEfl_`\u0000 ]\n\u0017\n=\nU\nq\nEI] \u0001\n\u001f \u001f\nR\n\u0017\n\u001f\n\u001f \u001f \u001f\nR \u0001\n\u0016\u0018\u0017\n\u0017\n\u0017\n\u0017\n\u0017\n\u0019\n(50)\nU\u0010\u000f \"\n\u000e\u000f\n\u000f\n\u000f\n\u000f\n\u000f\n\u0010\nU\n\u0000\nF\nE\nU\nq\nE _`\u0000\n\u001f\n\u001f\n\u0016\u0018\u0017\n\u0017\n\u0017\n\u0017\n\u0017\n\u0019\n\u0019\nU \"\n\u000e\u000f\n\u000f\n\u000f\n\u000f\n\u000f\n\u0010\nU\n\u0000\nF\nE _\n\u0017\n=\nU\n\u0000\nF\nEfl_\nq\n_ \u0001\nU\nq\nE _`\u0000 _\n\u0017\n=\nU\nq\nE _ \u0001\nU\n\u0017\n\u001f\n\u001f\nU \u0001\n\u0016\u0018\u0017\n\u0017\n\u0017\n\u0017\n\u0017\n\u0019\nF\n\u0000 \"\nj\nF\n\u0000\n\u0017\nF\n\u0000 \u0001\nm\n(51)\n\u0019\n]\n\u0017\n\"\n\u0001\nF\nE\n_\nq\n]^\u0000\nF\nE\n]\nq\nF\nE\n]\n\u0017\n=\nF\nE\n_\nq\n] \u0001\u0003\u0002\n(52)\n\u0019\n] \u0001 \"\n\u0001\nEo]^\u0000 Efl_`\u0000 ]\nq\nE _`\u0000 ]\n\u0017\n=\nE _`\u0000\u0010_\nq\n] \u0001\u0003\u0002\n(53)\n_\u0011\u000f\n\u0017\n\" \n\nF\nE _\nq\n_`\u0000\n\u000f\n\u0019\n_\n\u0017\n\"\n\u0001\nF\nE _\n\u0017\n=\nF\nE _\nq\n_ \u0001\n\u0002\n(54)\n_\u0011\u000f \u0001 \" \n E _`\u0000\n\u000f\n\u0019\n_ \u0001T\"\n\u0001\nEfl_`\u0000;_\n\u0017\n=\nE _`\u0000\u0010_\nq\n_ \u0001\u0004\u0002\n(55)\nwhere\n\u0019\nR\n\t\f\u000b\u000e\r\u0006\u0005\nB\n\r\u0007\u0005\n, U\u0010\u000f\n\t\f\u000b\t\b\nB X\n,\n\u0019\nU\n\t\f\u000b\n\b\nB\n\u0000\nX \u0007\ng\u0003\u0002\n,\n\u0019\n]\n\u0017\n\t \u000b\nX`B\n\r\u0007\u0005\n, _\u0011\u000f\n\u0017\n\t<\u000b\nX\u0018B X\n,\n\u0019\n_\n\u0017\n\t\f\u000b\nX`B\n\u0000\nX \u0007\ng\f\u0002\n,\n\u0019\n] \u0001\n\t<\u000bMg\nB\n\r\u0007\u0005\n,\n_\u0011\u000f \u0001\n\t \u000b\ng\nB X\n,\n\u0019\n_ \u0001\n\t\f\u000b\ng\nB\n\u0000\nX\b\u0007\ng\u0003\u0002 and \u0000\n\b\n\u0013\/\" \u0000 \u0000nS \u0000\nq\nS\u0003\u0000\n\u0017\nS\u0003\u0000 \u0001 .\n21\nC Proof of Lemma 1\nThis proof is virtually the same as the lemma in Grimm et al. (2001b). The difference here is that we allow the\nmatrix \u0003 \u0003\u0006? \u0003\u0006\u0005\b\u0007&\u0007 to be varying. To prove the lemma, note that for all ? \u0003\u0006\u0005\b\u0007 we have that\nF\n_\u0004\u0003\n\u0003\u0006? \u0003\u0006\u0005&\u0007&\u0007(? \u0003\u0006\u0005&\u0007 is well\ndefined; hence, it follows that the operator 8 S\nF\n_\u0004\u0003\n\u0003\u0006? \u0003\u0006\u0005&\u0007&\u0007 is also well defined. Now assume that 8 S\nF\n_ \u0003\n\u0003\u0006? \u0003\u0006\u0005\b\u0007&\u0007\nis singular for some ? \u0003\u0006\u0005&\u0007 , which implies  ?\u0001\u0000\" \u001f such that\n\n\n8\nS\nF\n_\u0004\u0003\n\u0003\u0006? \u0003\u0006\u0005&\u0007&\u0007\u0010\u000f3?\n\" \u001f (56)\n\u0002\n?\n'\n\u0003\n\u0003\u0006? \u0003\u0006\u0005&\u0007&\u0007\n\u0000 \n\n8\nS\nF\n_\u0004\u0003\n\u0003\u0006? \u0003\u0006\u0005&\u0007&\u0007\u0010\u000f3?\n\" \u001f (57)\nfor some diagonal positive definite \u0000 fl \u001f . Define \u0019? \u0013\/\" \u0003 \u0003\u0006? \u0003\u0006\u0005\b\u0007&\u0007(? and note that we have\n\u0019?\n'\n\u0000\n?\nS\n\"\n\u0004\n\u0019?\n\u0000\nF\n_\n\u0019?\nS\n\"\n\u0004\n\u0019?\n'\nF\n_\n'\n\u0000\n\u0019?\n\" \u001f (58)\nAs \u0000 is diagonal and as \tM\u0003\u0006? ffi \u0003\u0006\u0005&\u0007&\u0007\n\t \n \u001f - \" \u000f it then follows that\n\u0019?\n'\n\u0000\n?\n\"\n\u0001\n\u0006\nffi\b\u0007 \u000f\n\t\nffi\n\u0003\u0006?\nffi\n\u0003\u0006\u0005&\u0007&\u0007\n!\u0010ffi\n?\n\u0001\nffi\n\u0005\n\u0001\n\u0006\nffi\b\u0007 \u000f\n\t\n\u0001\nffi\n\u0003\u0006?\nffi\n\u0003\u0006\u0005&\u0007&\u0007\n!\u0010ffi\n?\n\u0001\nffi\n\"\n\u0019?\n'\n\u0000\n\u0019? (59)\nUsing this in equation (58) we have that\n= \u0019?\n'\n\u0000\n\u0019? =\n\"\n\u0004\n\u0019?\n\u0000\nF\n_\n\u0019? =\n\"\n\u0004\n\u0019?\n'\nF\n_\n'\n\u0000\n\u0019? \u0005\n\u001f (60)\nbut as we have assumed = \u0004\u0001\u0000 =\nF\n_\n'\n\u0000\n=\n\u0000\nF\n_\n\u001a\n\u001f we have a contradiction, showing that 8 S\nF\n_\u0004\u0003\n\u0003\u0006? \u0003\u0006\u0005&\u0007&\u0007 is\nnonsingular for all \u0003 \t\u0006\u0005 .\nD Proof of uniqueness of solutions\nThe following Lemma will be needed in establishing uniqueness of solutions.\nLemma 2 Let \u0005 be defined as in Lemma 1. If 8 S \u0019_ p \u0003fi\r\/\u0007 is invertible for all p \u0003fi\r\/\u0007\n\t\u0011\u0005 , then\n= \"iS\n*\nffi)ffi\np\nffi\n\u0003fi\r\/\u0007 is invertible !\n+\nand ! p \u0003fi\r\/\u0007n\t\u0011\u0005 , where * ffi)ffi is the\n+C+\n’th element of \u0019_ .\n= Any \u000e\nE\n\u000e%\u0003\u000f\u000e\n:\n$ \u0007 minor of 8 S \u0019_ p \u0003fi\r\/\u0007 is invertible ! p \u0003fi\r\/\u0007\n\t\u0006\u0005 .\nProof:\n= Assume that for\n+\n\t\n\u0015 \u0004\n- \b -\u000e\r\u000e\r\u000e\r;-%$\nff we have that\np\nffi\n\u0003fi\r\/\u0007\n\"\n\u001f . Then we have\n8\nS\n\u0019\n_\np\n\u0003fi\r\/\u0007\n\"\nj\n\"iS\n*\n\u0017&\u0017\np\n\u0017\n\u0003fi\r\/\u0007\n\u001f\n\u001f\n8\n\u0000\nX\n>\n\u0017\n\u0002\nB\n\u0000\nX\n>\n\u0017\n\u0002\nm\n(61)\nFor this to be invertible we therefore must have \" S\n*\nffi)ffi\np\nffi\n\u0003fi\r\/\u0007 invertible. A similar argument can be followed\nfor\n+\n\u0000\n\" \" .\n22\n= Assume that\np\nffi\n\u0000\n\" \u001f\n+\n\t\n\u0015#\"\n-\u000e\r\u000e\r\u000e\rb-\u0010\u000e\nff (62)\np\nffiff\" \u001f\n+\n\t\n\u0015\n\u000e\nS \"\n-\u000e\r\u000e\r\u000e\r -%$\nff (63)\nThen, denoting \n \u0002 \u000f\u0001\u0000 B \u0000 as the \u000e\nE\n\u000e\n’th submatrix of \u0002 , we have\n8\nS\n\u0019\n_\np\n\u0003fi\r\/\u0007\n\"\nj\n8\u0002\u0000\nB\n\u0000\nS \n\n\u0019\n_\np\n\u0003fi\r\/\u0007\u0010\u000f\u0003\u0000\nB\n\u0000\n\u001f\n\u001f\n8\n\u0000\nX\n>\n\u0000\n\u0002\nB\n\u0000\nX\n>\n\u0000\n\u0002\nm\n(64)\nObviously for this matrix to be invertible we must have that\n8\u0002\u0000\nB\n\u0000\nS \n\n\u0019\n_\np\n\u0003fi\r\/\u0007\u0010\u000f\u0003\u0000\nB\n\u0000\n\" \n\n8\nS\n\u0019\n_\np\n\u0003fi\r\/\u0007\u0010\u000f\u0003\u0000\nB\n\u0000 (65)\nis invertible too, which proves the result when the last $ = \u000e elements of p \u0003fi\r\/\u0007 are zero. More generally,\nafter a suitable co-ordinate change we can write\n8\nS\n\u0019\n_\np\n\u0003fi\r\/\u0007\n\" \u0000\n>\n\u0017\nj\n8\u0002\u0000\nB\n\u0000\nS \n\n\u0019\n_\np\n\u0003fi\r\/\u0007\u0010\u000f\u0003\u0000\nB\n\u0000\n\u001f\n\u001f\n8\n\u0000\nX\n>\n\u0000\n\u0002\nB\n\u0000\nX\n>\n\u0000\n\u0002\nm\n\u0000 (66)\nand thus the same argument can be used to show nonsingularity. D D .\nTo prove well-posedness we need to prove that the equation\nW\n[\n\"\n\u0019\n]\n\u0017\n\u0019Q\nS\nF\n_f_-+\n\u0003\nW\u0004\u0001\nffi\n\r\n=\nW\n[\n\u0007 (67)\nhas a unique solution, W [ . Without loss of generality, but for considerably more simplicity, we set W \u0001 ffi\n\r\n\"\n\u001f . So\nwe actually consider\nW\n[\n\"\n\u0019\n]\n\u0017\n\u0019QI=\nF\n_I_,+\n\u0003\nW\n[\n\u0007 (68)\nor, after re-arranging,\nW\n[\nS\nF\n_I_,+\n\u0003\nW\n[\n\u0007\n\"\n\u0019\n]\n\u0017\n\u0019Q\n\" \u00139+ (69)\nFrom the main proof of Theorem 1, we can set _-+ \u0003 W [ \u0007 \"\np\n\u0003\nW\n[\n\u0007\nW\n[ , where\np\n\u0003\nW\n[\n\u0007\n\"\n*\u0016+\n\b \r \u0015\n\u000e\n\u0017\n\u0003\nW\n[, \n\u0017\n\u0007\u001f-\u000e\r\u000e\r\u000e\r -\u0010\u000e\nX\n\u0003\nW\n[, X\n\u0007\nff\n- \u000e\nffi\n\t\n\n\n\u001f\n-\n\"\n\u000f (70)\nBy Lipschitz continuity of _-+ \u0003fi\r\/\u0007 we know that\np\n\u0003fi\r\/\u0007 is also Lipschitz continuous. Also, by Lemma 1, we know\nthat the matrix\n\u0003C8\nS\nF\n_\np\n\u0003\nW\n[\n\u0007&\u0007\n>\n\u0017 (71)\nexists for all W\n[\n. To prove that a unique solution exists we use a contradiction argument.\n23\nD.1 Proof by contradiction\nAssume there exist two solutions to (69), that is W [ \"@W\u0001\u0000 and W [ \"@W\u0003\u0002 . Assume further that, after any necessary\nco-ordinate change, we can isolate the zero components of W \u0000 as\nW\u0003\u0000 \"\nj\nW \u0000 \u0017\nW\u0003\u0000 \u0001\nm\n\"\nj\nW \u0000 \u0017\n\u001f\nm\n(72)\nthat is \u001f \u0000\" W\u0001\u0000 \u0017 \t \u000b\n\u0000\n- \u0003\u000f\u000e\n:\n$ \u0007 and \u001f \" W\u0001\u0000 \u0001 \t \u000b X >\n\u0000\n. Now as W\u0001\u0000 \u0017 \u0000\" \u001f , it follows that we can write W\u0004\u0002\n\u0017\nas\nW\u0003\u0002\n\u0017\n\"\n\u0005\n\u0017 W\u0001\u0000 \u0017\n-\n\u0005\n\u0017 \" \/ 0\n\u0005\n\u0011\n\u0003\u0007\u0006\n\u0017\n-\u000e\r\u000e\r\u000e\rb-\b\u0006 \u0000 \u0007 (73)\nwhere W\u0001\u0002 has been partitioned as\nW\u0001\u0002i\"\nj\nW\u0003\u0002\n\u0017\nW\u0003\u0002 \u0001 m\n-\nW\u0001\u0002\n\u0017\n\t\f\u000b\n\u0000\n-\nW\u0003\u0002 \u0001\n\t\f\u000b\nX\n>\n\u0000\n(74)\nPartitioning (69) compatibly with W\u0004\u0000 and W\u0003\u0002 we get\nj\nW\u0001\u0000\n\u0017\nS\nF\n_\n\u0017&\u0017\np\n\u0017\n\u0003\nW\u0003\u0000\n\u0017\n\u0007\nW\u0001\u0000\n\u0017\nF\n_ \u0001\n\u0017\np\n\u0017\n\u0003\nW\u0003\u0000\n\u0017\n\u0007\nW\u0003\u0000\n\u0017\nm\n\"\nj\n+\n\u0017\n+ \u0001\nm\n(75)\nand also\nj\nW\u0001\u0002\n\u0017\nS\nF\n_\n\u0017&\u0017\np\n\u0017\n\u0003\nW\u0001\u0002\n\u0017\n\u0007\nW\u0003\u0002\n\u0017\nS\nF\n_\n\u0017\n\u0001\np\n\u0001\n\u0003\nW\u0001\u0002\n\u0001\n\u0007\nW\u0003\u0002\n\u0001\nW\u0003\u0002\n\u0001\nS\nF\n_ \u0001\n\u0017&\u0017\np\n\u0017\n\u0003\nW\u0003\u0002\n\u0017\n\u0007\nW\u0003\u0002\n\u0017\nS\nF\n_ \u0001 \u0001\np\n\u0001\n\u0003\nW\u0003\u0002\n\u0001\n\u0007\nW\u0001\u0002\n\u0001\nm\n\"\nj\n+\n\u0017\n+ \u0001\nm\n(76)\nSo, after re-arranging we must have,\n\n\n8\nS\nF\n_f\u0017&\u0017\np\n\u0017\n\u0003\nW\n\u0000\n\u0017\n\u0007\u0010\u000f\nW\n\u0000\n\u0017 \" \n\n8\nS\nF\n_f\u0017&\u0017\np\n\u0017\n\u0003\nW\u0003\u0002\n\u0017\n\u0007\u0010\u000f\nW\u0001\u0002\n\u0017\nS\nF\n_f\u0017\n\u0001\np\n\u0001\n\u0003\nW\u0001\u0002\n\u0001\n\u0007\nW\u0003\u0002\n\u0001\n(77)\nF\n_ \u0001\n\u0017\np\n\u0017\n\u0003\nW\u0003\u0000\n\u0017\n\u0007\nW\u0003\u0000\n\u0017\n\" \n\n8\nS\nF\n_ \u0001 \u0001\np\n\u0001\n\u0003\nW\u0003\u0002\n\u0001\n\u0007\u0010\u000f\nW\u0001\u0002\n\u0001\nS\nF\n_ \u0001\n\u0017\np\n\u0017\n\u0003\nW\u0001\u0002\n\u0017\n\u0007\nW\u0003\u0002\n\u0017\n(78)\nFrom equation (78) we have that\n\n\n8\nS\nF\n_ \u0001 \u0001\np\n\u0001\n\u0003\nW\u0001\u0002\n\u0001\n\u0007\u0010\u000f\nW\u0003\u0002\n\u0001\n\"\nF\n_ \u0001\n\u0017\n\n\np\n\u0017\n\u0003\nW\u0003\u0000\n\u0017\n\u0007\nW\u0001\u0000\n\u0017\n=\np\n\u0017\n\u0003\nW\u0003\u0002\n\u0017\n\u0007\nW\u0001\u0002\n\u0017\n\u000f (79)\nNext, because p \u0003fi\r\/\u0007 \t \u0005 and, from Lemma 2, we have that each \u000e E \u000e minor of \n 8 S\nF\n_\np\n\u0003fi\r\/\u0007\u0010\u000f is invertible, it\nfollows that\nW\u0003\u0002\n\u0001\n\")\n\n8\nS\nF\n_ \u0001 \u0001\np\n\u0001\n\u0003\nW\u0001\u0002\n\u0001\n\u0007\u0010\u000f\n>\n\u0017\nF\n_ \u0001\n\u0017\n\n\np\n\u0017\n\u0003\nW\u0003\u0000\n\u0017\n\u0007\nW\u0003\u0000\n\u0017\n=\np\n\u0017\n\u0003\nW\u0001\u0002\n\u0017\n\u0007\nW\u0003\u0002\n\u0017\n\u000f (80)\nUsing this expression in equation (77) and defining\n24\n\u0000\n\u0003\nW\u0001\u0002 \u0001\n\u0007\n\u0013\/\"\nF\n_f\u0017 \u0001\np\n\u0001\n\u0003\nW\u0001\u0002 \u0001\n\u0007\n\n\n8\nS\nF\n_ \u0001 \u0001\np\n\u0001\n\u0003\nW\u0003\u0002 \u0001\n\u0007\u0010\u000f\n>\n\u0017\nF\n_ \u0001 \u0017 (81)\nwe obtain\n\n\n8\nS\nF\n_ \u0017&\u0017\np\n\u0017\n\u0003\nW\u0003\u0000 \u0017\n\u0007\u0010\u000f\nW\u0001\u0000 \u0017 \"\u000b\n\n8\nS\nF\n_ \u0017&\u0017\np\n\u0017\n\u0003\nW\u0003\u0002\n\u0017\n\u0007\u0010\u000f\nW\u0003\u0002\n\u0017\nS\n\u0000\n\u0003\nW\u0001\u0002 \u0001\n\u0007\n\n\np\n\u0017\n\u0003\nW\u0003\u0000 \u0017\n\u0007\nW\u0003\u0000 \u0017\n=\np\n\u0017\n\u0003\nW\u0001\u0002\n\u0017\n\u0007\nW\u0003\u0002\n\u0017\n\u0007\u0010\u000f (82)\nRe-arranging this yields\n\n\n8\nS\nF\n_ \u0017&\u0017\np\n\u0017\n\u0003\nW\u0003\u0000 \u0017\n\u0007\u000e=\n\u0000\n\u0003\nW\u0001\u0002 \u0001\n\u0007\np\n\u0017\n\u0003\nW\u0001\u0000 \u0017\n\u0007\u0010\u000f\nW\u0001\u0000 \u0017 \")\n\n8\nS\nF\n_ \u0017&\u0017\np\n\u0017\n\u0003\nW\u0001\u0002\n\u0017\n\u0007\u000e=\n\u0000\n\u0003\nW\u0001\u0002 \u0001\n\u0007\np\n\u0017\n\u0003\nW\u0001\u0002\n\u0017\n\u0007\u0010\u000f\nW\u0003\u0002\n\u0017\n(83)\nHowever, by construction we have that W \u0002\n\u0017\n\"\n\u0005\n\u0017 W\u0003\u0000 \u0017 so we have\n\n\n8\nS\nF\n_ \u0017&\u0017\np\n\u0017\n\u0003\nW\u0003\u0000 \u0017\n\u0007^=\n\u0000\n\u0003\nW\u0003\u0002 \u0001\n\u0007\np\n\u0017\n\u0003\nW\u0003\u0000 \u0017\n\u0007\u0010\u000f\nW\u0001\u0000 \u0017 \"\u000b\n\n8\nS\nF\n_ \u0017&\u0017\np\n\u0017\n\u0003\n\u0005\n\u0017 W\u0003\u0000 \u0017\n\u0007c=\n\u0000\n\u0003\nW\u0001\u0002 \u0001\n\u0007\np\n\u0017\n\u0003\n\u0005\n\u0017 W\u0001\u0000 \u0017\n\u0007\u0010\u000f\n\u0005\n\u0017 W\u0003\u0000 \u0017 (84)\nTherefore we must have\n8\nS\nF\n_\n\u0017&\u0017\np\n\u0017\n\u0003\nW\u0003\u0000\n\u0017\n\u0007c=\n\u0000\n\u0003\nW\u0001\u0002\n\u0001\n\u0007\np\n\u0017\n\u0003\nW\u0003\u0000\n\u0017\n\u0007\n\"\n\u0005\n\u0017\nS\nF\n_\n\u0017&\u0017\np\n\u0017\n\u0003\n\u0005\n\u0017\nW\u0003\u0000\n\u0017\n\u0007\n\u0005\n\u0017\n=\n\u0000\n\u0003\nW\u0001\u0002\n\u0001\n\u0007\np\n\u0017\n\u0003\n\u0005\n\u0017\nW\u0001\u0000\n\u0017\n\u0007\n\u0005\n\u0017 (85)\nWe shall now show that a necessary and sufficient condition for this to hold is that \u0005 \u0017 \" 8 .\nSufficiency: It is easy to see that setting \u0005 \u0017 \" 8 is sufficient for equation (85) to hold.\nNecessity: Equation (85) can equivalently be written as\n8\nS\n\u0003\nF\n_\n\u0017&\u0017\n=\n\u0000\n\u0003\nW\u0003\u0002\n\u0001\n\u0007&\u0007\np\n\u0017\n\u0003\nW\u0003\u0000\n\u0017\n\u0007\n\"\n\u0005\n\u0017\nS\n\u0003\nF\n_\n\u0017&\u0017\n=\n\u0000\n\u0003\nW\u0001\u0002\n\u0001\n\u0007&\u0007\np\n\u0017\n\u0003\n\u0005\nW\u0001\u0000\n\u0017\n\u0007\n\u0005\n\u0017\n(86)\nA necessary condition for this to hold is that\n\"\u0001S\n\u0003\n*\nffi)ffi\n= Q\nffi)ffi\n\u0003\nW\u0003\u0002\n\u0001\n\u0007&\u0007 \u000e\n\u0017\n ffi\n\u0003\nW\n\u0000\n\u0017\n ffi\n\u0007\n\"\n\u0006\nffi\nS\n\u0003\n*\nffi)ffi\n= Q\nffi)ffi\n\u0003\nW\u0003\u0002\n\u0001\n\u0007&\u0007 \u000e\n\u0017\n ffi\n\u0003\u0007\u0006\nffi\nW\n\u0000\n\u0017\n ffi\n\u0007 \u0006\nffi !\n+ (87)\nDefining \u0001\bffi)ffi\u000e\u0013\/\"\n*\nffi)ffi\n= Q\nffi)ffi\n\u0003\nW\u0003\u0002\n\u0001\n\u0007\n, a necessary condition for equation (87) to hold is that\n\u0017 \"iS\u0002\u0001&ffi)ffi\n\u000e\n\u0017\n ffi\n\u0003\nW\u0003\u0000\n\u0017\n ffi\n\u0007\n\u0017 \"\u000b\u0017\n\u0006\nffi\u0006\u0017\u0012\u0017 \"lS\u0002\u0001\bffi ffi\n\u000e\n\u0017\n ffi\n\u0003\u0007\u0006\nffi W\u0001\u0000\n\u0017\n ffi\n\u0007\n\u0017\n!\n+ (88)\nSo assume that \u0006 ffi \u0000\" \" for some\n+ (this is necessary for W \u0000 \u0000\" W\u0001\u0002 ), and at first we assume that \u001f : \u0006 ffi\n\u001a\n\" (this is\nequivalent to W\u0001\u0000\\ ffi fl W\u0003\u0002\n ffi\n, and will be removed later) which, as \u000e ffi \u0003fi\r\/\u0007 is monotonically nondecreasing, implies that\n\u0017\n\u0006\nffi W\u0003\u0000\n\u0017\n ffi%\u0017\n\u001a\n\u0017 W\u0003\u0000\n\u0017\n ffi \u0017 (89)\n\u0017\n\u000e\n\u0017\n ffi\n\u0003\u0007\u0006\nffi\u0006W\u0003\u0000\n\u0017\n ffi\n\u0007\n\u0017\n:\n\u0017\n\u000e\n\u0017\n ffi\n\u0003\nW\n\u0017\n\u0000\\ ffi\n\u0007\n\u0017 (90)\nNow we shall consider three cases and show that for \u001f : \u0006 ffi\n\u001a\n\" , equation (88) is contradicted in all cases.\n25\n= Assume \u0001\bffi ffi fl \u001f\nWe have that\n\u0017 \"\u0001S\u0002\u0001 ffi)ffi\n\u000e\nffi\n\u0003\nW \u0017 \u0000  ffi\n\u0007\n\u0017O\" \"iS \u0017 \u0001 ffi)ffi \u0017\u0012\u0017\n\u000e\n\u0017  ffi\n\u0003\nW \u0017 \u0000\\ ffi\n\u0007\n\u0017 (91)\n\u0005\n\"iS \u0017 \u0001&ffi)ffi \u0017\u0012\u0017\n\u000e\n\u0017  ffi\n\u0003\u0007\u0006\nffi W \u0017 \u0000  ffi\n\u0007\n\u0017 (92)\nfl\n\u0006\nffi\n\u0003\n\"lS \u0017 \u0001\bffi ffi\u0006\u0017\u0012\u0017\n\u000e\n\u0017  ffi\n\u0003\u0007\u0006\nffi W \u0017 \u0000  ffi\n\u0007\n\u0017\n\u0007 (93)\nThis contradicts equation (88)\n= Assume = \"\n\u001a\n\u0001\bffi)ffi\n\u001a\n\u001f\nWe have\n\u0017 \"iS\u0002\u0001 ffi)ffi\n\u000e\n\u0017  ffi\n\u0003\nW \u0000 \u0017  ffi\n\u0007\n\u0017 \"\nN\n\" \u0017 W\u0001\u0000 \u0017  ffi \u0017\n\u001a\n\u0019\nWeffi\n\u0017 \"lS\u0002\u0001\bffi)ffi\n\u0003\u0001\u0000\n\r\u0003\u0002\n\u0000\n\u0010 \u000e\n\u0000\n>\n\u000b\n\r\u000f\u000e\n\u0000\n\r\u0004\u0002\n\u0000\n\u0010 \u000e\n\u0000\n\u0007\n\u0017 \u0017 W\u0001\u0000 \u0017  ffi \u0017\n\u0005 \u0019\nWeffi\n(94)\n\"\nN\n\" \u0017 W\u0003\u0000\n\u0017\n ffi \u0017\n\u001a\n\u0019\nWYffi\n\"\n=\n\u0017\n*\nffi ffi \u0017\\S\n\u0000 \u0005\n\u000e \u000e\n\u0000\n\u000b\n\r \u000e\n\u0000\n\r\u0003\u0002\n\u0000\n\u0010 \u000e\n\u0000\n\u0017 W\u0003\u0000\n\u0017\n ffi \u0017\n\u0005)\u0019\nWYffi\n(95)\nfl\nN\n\u0006\nffi \u0017 W\u0003\u0000\n\u0017\n ffi \u0017\n\u001a\n\u0019\nWYffi\n\u0006\nffi\n\u0003\n\"\n=\n\u0017 \u0001\bffi)ffi%\u0017\n\u0007\nS\n\u0000 \u0005\n\u000e \u000e\n\u0000\n\u000b\n\r\u000f\u000e\n\u0000\n\r\u0003\u0002\n\u0000\n\u0010 \u000e\n\u0000\n\u0017 W\u0003\u0000\n\u0017\n ffi \u0017\n\u0005)\u0019\nWYffi\n(96)\n\"\nN\n\u0006\nffi \u0017 W\u0001\u0000\n\u0017\n ffi \u0017\n\u001a\n\u0019\nWeffi\n\u0006\nffi\n= \u0006\nffi%\u0017 \u0001\bffi ffi \u0017\n\u0003\n\"\n=\n\u000b\n\r \u000e\n\u0006\n\u000e\n\u0000\n\r\u0003\u0002\n\u0000\n\u0010 \u000e\n\u0000\n\u0007\n\u0017 W\u0001\u0000\n\u0017\n ffi \u0017\n\u0005 \u0019\nWeffi\n(97)\n\"\nN\n\u0006\nffi\n\u0017 W\n\u0000\n\u0017\n ffi\n\u0017\n\u001a\n\u0019\nW\nffi\n\u0006\nffi\n= \u0006\nffi%\u0017 \u0001\bffi ffi \u0017\n\u0003\n\u0006\n\u000e\n\u0000\n\r\u0003\u0002\n\u0000\n\u0010 \u000e\n\u0000\n>\n\u000b\n\r\u000f\u000e\n\u0006\n\u000e\n\u0000\n\r\u0003\u0002\n\u0000\n\u0010 \u000e\n\u0000\n\u0007\n\u0017 W\u0003\u0000\n\u0017\n ffi \u0017\n\u0005\u000b\u0019\nWeffi\n(98)\n\"\nN\n\u0006\nffi\n\u0017 W\n\u0000\n\u0017\n ffi\n\u0017\n\u001a\n\u0019\nW\nffi\n\u0006\nffi\u0006\u0017 \"\n=\n\u0017 \u0001\bffi)ffi%\u0017\n\u0003\n\u0006\n\u000e\n\u0000\n\r\u0003\u0002\n\u0000\n\u0010 \u000e\n\u0000\n>\n\u000b\n\r\u000f\u000e\n\u0006\n\u000e\n\u0000\n\r\u0003\u0002\n\u0000\n\u0010 \u000e\n\u0000\n\u0007\n\u0017 \u0017 W\u0003\u0000\n\u0017\n ffi%\u0017\n\u0005\u000b\u0019\nWYffi\n(99)\nfl\n\u000b\n\f\n\f\n\r\n\f\n\f\u000e\n\u0006\nffi\n\u0017 W\n\u0000\n\u0017\n ffi\n\u0017\n\u001a\n\u0019\nW\nffi\n\u0006\nffi\n\u0019\nWeffi\n:\n\u0017 W\u0003\u0000\n\u0017\n ffi\u0006\u0017\n\u001a\n\u0019\nWeffi\n\u0006\n>\n\u0017\nffi\n\u0006\nffi\u0006\u0017 \"\n=\n\u0017 \u0001&ffi)ffi \u0017\n\u0003\n\u0006\n\u000e\n\u0000\n\r\u0003\u0002\n\u0000\n\u0010 \u000e\n\u0000\n>\n\u000b\n\r\u000f\u000e\n\u0006\n\u000e\n\u0000\n\r\u0004\u0002\n\u0000\n\u0010 \u000e\n\u0000\n\u0007\n\u0017 \u0017 W\u0001\u0000\n\u0017\n ffi \u0017\n\u0005)\u0019\nWYffi\n\u0006\n>\n\u0017\nffi\n(100)\n\"\nN\n\u0006\nffi\n\u0006\nffi\u0006\u0017 W\u0003\u0000\n\u0017\n ffi\u0006\u0017\n\u001a\n\u0019\nWYffi\n\u0006\nffi\u0006\u0017 \"\n=\n\u0017 \u0001\bffi)ffi%\u0017\n\u0003\n\u0006\n\u000e\n\u0000\n\r\u0003\u0002\n\u0000\n\u0010 \u000e\n\u0000\n>\n\u000b\n\r\u000f\u000e\n\u0006\n\u000e\n\u0000\n\r\u0003\u0002\n\u0000\n\u0010 \u000e\n\u0000\n\u0007\n\u0017\n\u0006\nffi\u0006\u0017 W\u0003\u0000\n\u0017\n ffi\u0006\u0017\n\u0005\u000b\u0019\nWYffi\n(101)\n\"\n\u0006\nffi\u0006\u0017 \"\n=\n\u0017 \u0001\bffi)ffi%\u0017\n\u000e\nffi\n\u0003\u0007\u0006\nffi W\u0003\u0000\n\u0017\n ffi\n\u0007\n\u0017 (102)\nThis contradicts equation (88). Note that there is some quite extensive algebra between equation (99) and\ninequality (100).\n= Assume \u0001\bffi ffi : = \"\nWe have that\n\u0017 \"\u0001S\u0002\u0001\nffi)ffi\n\u000e\n\u0017\n ffi\n\u0003\nW\n\u0000\n\u0017\n ffi\n\u0007\n\u0017\nfl\n\u0006\nffi\n\u0017 \"lS\u0002\u0001\nffi ffi\n\u000e\nffi\n\u0003\nW\n\u0000\n\u0017\n ffi\n\u0007\n\u0017 (103)\n26\n\"\n\u0006\nffi \u0017\u0012\u0017 \u0001&ffi)ffi\n\u000e\nffi\n\u0003\nW\u0003\u0000 \u0017  ffi\n\u0007\n\u0017\n=\n\"<\u0017 (104)\n\u0005 \u0006\nffi \u0017\u0012\u0017 \u0001 ffi)ffi\n\u000e\nffi\n\u0003\u0007\u0006\nffi W \u0000 \u0017  ffi\n\u0007\n\u0017\n=\n\"<\u0017 (105)\n\"\n\u0006\nffi\u0006\u0017 \"lS\u0002\u0001\bffi ffi\n\u000e\nffi\n\u0003\u0007\u0006\nffi W\u0001\u0000 \u0017  ffi\n\u0007\n\u0017 (106)\nwhich contradicts (88).\nIn other words we have proved that for equation (87) to hold, we cannot have \u0006 ffi\n\u001a\n\" . Now we remove the\nassumption that \u0006 ffi\n\u001a\n\" : if \u0006 ffi fl \" , we have that W\u0001\u0000 \u0017  ffi\n\u001a\nW\u0003\u0002\n\u0017  ffi\nand the same argument as above can be applied.\nWe have proved that for equation (87) to hold we must have \u0017 \u0006 ffi%\u0017 \" \" . To prove that the solution is unique, we\nmust prove that equation (87) holds only with \u0006 ffil\" \" (and not = \" ). To see this note that a necessary condtion\nfor equation (87) to hold is that\n\u0004\n0\u0012\u0011\u00162 \u0015<\"lS\u0002\u0001 ffi)ffi\n\u000e\n\u0017  ffi\n\u0003\nW \u0000 \u0017  ffi\n\u0007\nff \"\n\u0004\n0 \u0011\u00162\u0016\u0015\n\u0006\nffi ff\n\u0004\n0\u0012\u0011\u00162\u0016\u0015<\"\u0001S\u0002\u0001 ffi)ffi\n\u000e\n\u0017  ffi\n\u0003\u0007\u0006\nffi W \u0017 \u0000\\ ffi\n\u0007\nff (107)\nAs \u0004 0 \u0011\u00162\u0016\u0015#\"iS\u0002\u0001\bffi ffi \u000e \u0017  ffi \u0003\u0007\u0006 ffi W \u0017 \u0000  ffi \u0007 ff \" \u0004 0\u0012\u0011\u00162\u0016\u0015#\"lS \u0001\bffi ffi \u000e \u0017  ffi \u0003 W \u0017 \u0000  ffi \u0007 ff ! W\u0001\u0000 \u0017  ffi (because \u000e \u0017  ffi \u0003fi\r\/\u0007 \t \n \u001f - \" \u000f ), it follows that for\nequation (107) to hold, we must have \u0004 0\u0012\u0011\u00162 \u0003\u0007\u0006 ffi \u0007 \" \" . Or in other words we must have \u0006 ffi \" \" for a unique\nsolution. In other words we have proved the W \u0000\n\u0017\n\" W\u0001\u0002\n\u0017\n. To prove that W\u0001\u0002\n\u0001\n\"@W\u0003\u0000 \u0001 consider equation (79) and note\nthat as we now have that W\u0004\u0000 \u0017 \" W\u0001\u0002\n\u0017\n, this equation becomes\n\n\n8\nS\nF\n_ \u0001 \u0001\np\n\u0001\n\u0003\nW\u0001\u0002\n\u0001\n\u0007\u0010\u000f\nW\u0003\u0002\n\u0001\n\"\n\u001f (108)\nFrom Lemma 2 we know that \n 8 S\nF\n_ \u0001 \u0001\np\n\u0001\n\u0003\nW\u0001\u0002\n\u0001\n\u0007\u0010\u000f has full rank !\np\n\u0001\n\u0003fi\r\/\u0007 \t \u0005\n, which implies W \u0002\n\u0001\n\"\n\u001f . Therefore\nwe have W\u0001\u0002 \u0001 \" W\u0001\u0000 \u0001T\" \u001f . Thus W\u0001\u0000 \" W\u0001\u0002 which implies the solutions are unique. D D .\nE Missile dynamics\nThe simplified roll-yaw dynamics of the missile are given by\nRl\u0000 \"\n\u000e\u000f\n\u000f\n\u0010\n=\n\u001f\n\r\n\u0000\n\"\n\u0000\n=\n\u001f\n\r\u0003\u0002\u0007\u0002\u0007\u0002\n\u001f\n\r\u0003\b \u0000 \u0002\n\u0000\n\u001f\n\r\n\u0004\n\u0002 =\n\u001f\n\r\u0003\u0004 \t \u0002\n\u001f\n\r\n\u001f\u001a\u001f\n\u0002\n=\n\u0004\n\t \b \u0000\n\u001f\n\r\n\u001f\n\u0004\u0007\u0006\n\u0004 \"\n=\n\u0004\n\r\n\"\n\u001f\n\u0016\u0018\u0017\n\u0017\n\u0019\n-\nU\u0001\u0000 \"\n\u000e\u000f\n\u000f\n\u0010\n\u001f\n\r\n\"\n\u0000\f\t\n\u001f\n\r\n\u001f\n\" \u0004\n=\n\"\n\u0002 \u0000 \r\u0001\u0000 \b \t#\r\u0003\u0006\n\"\n=\n\u0004\n\t\n\"\n\u0006 =\n\"\n\u001f\n\u0002\u0007\b\n\u0016\u0018\u0017\n\u0017\n\u0019\n-\nU\n\u0000\\[\n\"\n\u000e\u000f\n\u000f\n\u0010\n\u001f \u001f\n\u001f \u001f\n\u001f \u001f\n\u0016\u0018\u0017\n\u0017\n\u0019\n(109)\n]^\u0000 \"\nj\n\"\n\u001f \u001f\n\u001f\n\"\n\u001f\nm\n-\n_`\u0000 \"@_\n\u0000b[\n\"\nj\n\u001f \u001f\n\u001f \u001f\nm\n(110)\nThe LQG\/LTR controller used is described by\nR\nq\n\"\nj\nR\nq\n\u0017\nU\nq\n\u0017\n\u001f \u001f\nm\n-\nU\nq\n\"\n=\nU\nqts\n\"\n= j\n\u001f\n8\nm\n-\n]\nq\n\")\n ]\nq\n\u0017\n\u001f\n\u000f -\n_\nq s\n\"@_\nq\n\"\n\u001f (111)\nwhere\n27\nR\nq\n\u0017 \"\n\u000e\u000f\n\u000f\n\u000f\n\u000f\n\u000f\n\u000f\n\u000f\n\u0010\n=\n\u001f\n\r\n\u0004\n\u0002 =\n\" \u001f\n\t#\r\n\u0000\n\u0006\u0018\r\u0003\u0006 \t =\n\u0004\n\r\u0003\u0004\n\u0000\n=\n\u001f\n\r\u0001\u0000\n\" \u001f\n\t#\r\u0003\u0006\n\u0000\n= \u0002 \t#\r\n\u0000\n\"\n\u0006\u0007\b\u0018\r\u0003\u0002\u0007\u0004 = \u0000 \r\u0003\u0004\n\u0004\n= \u0004\u0018\r\u0003\b\u0007\u0004\n= \u0006\u0018\r\n\t\n\u0004\n\u0006 \u0000 \r\n\u0000\n\u0004\n= \u0004 \u0000 \r\n\"\n\u0002 = \u0000\n\u001f\n\r\n\t \u0002 \u0004\u0018\r\n\"\u001a\"\n\b\u0018\r\n\u0004 \" \u0004\n\r\n\" \u0004\n\u0002\u0018\r\u0003\u0004\u0007\u0006 = \u0006\u0007\b\n\"\n\r\n\"\n\u0004 \u0000\n\u0004\n\u0002\u0018\r\n\u0000\n\u0002\n\u001f\n\r\u0003\b\u0007\u0006 = \b\u0018\r\u0003\b\u0007\u0002 \b\u0018\r\n\u001f\n\u0002 = \u0000 \u0006\n\u001f\n\r\n\u001f\n\b =\n\u001f\n\r\n\t\u000b\u0000\n\u0016\u0018\u0017\n\u0017\n\u0017\n\u0017\n\u0017\n\u0017\n\u0017\n\u0019\n-\nU\nq\n\u0017 \"\n\u000e\u000f\n\u000f\n\u000f\n\u000f\n\u000f\n\u000f\n\u000f\n\u0010\n\u0004\n\r\n\u0004\n\u0000\n\u001f\n\r\u0001\u0000\n\u0000\n= \u0000\n\u001f\n\r\n\t \u0004\n\u0004\n\r\n\"\n\b\n\"\n\u0000\n\r\u0001\u0000\f\t =\n\u001f\n\r\n\u0004 \u0004\n=\n\u0004\n\r\n\u001f\n\t = \u0000\u0007\u0000 \r\u0003\u0006\n\u0000\n=\n\u001f\n\r\u0003\u0002\n\u0000\n=\n\"\n\r\n\"\n\u0000\n\u0016\u0018\u0017\n\u0017\n\u0017\n\u0017\n\u0017\n\u0017\n\u0017\n\u0019\n(112)\n]\nq\n\u0017 \"\nj\n\u001f\n\r\n\u0000\n\u0006\n\u0000\n\r\u0003\u0004 \u0000 =\n\"\n\r\n\t\n\"\n\u0000 \b\u0018\r\u0003\u0002\n\" \"\n\r\n\" \u0004\n\u0004\n\r\n\"\n\t \b\u0007\u0002\u0018\r\u0003\u0002\n\"\n=\n\"\n\u0000\n\r\u0003\b\u0007\u0002 =\n\u0000\n\r\u0003\u0004\n\" \"\n\r\n\u001f\n\b\nm\n(113)\n"}