{"doi":"10.1162\/comj.2007.31.2.10","coreId":"69114","oai":"oai:eprints.lancs.ac.uk:28292","identifiers":["oai:eprints.lancs.ac.uk:28292","10.1162\/comj.2007.31.2.10"],"title":"Creating sonic spaces : an interview with Natasha Barrett.","authors":["Otondo, Felipe"],"enrichments":{"references":[{"id":937678,"title":"Composition and Diffusion: Space","authors":[],"date":"1999","doi":"10.1017\/S1355771898002076","raw":"Truax, B. 1999. “Composition and Diffusion: Space in Sound in Space.” Organised Sound 3(2):141–146.","cites":null},{"id":937599,"title":"Some Considerations for Spatial Design and","authors":[],"date":"2005","doi":null,"raw":"Otondo, F. 2005. “Some Considerations for Spatial Design and Concert Projection with Surround 5.1.” Paper presented at the 2005 Digital Music Research Network Summer Conference, 21 December, Glasgow.","cites":null},{"id":937081,"title":"Sound Diffusion in Composition and Performance: An Interview with Denis Smalley.”","authors":[],"date":"2000","doi":"10.1162\/014892600559272","raw":"Austin, L. 2000. “Sound Diffusion in Composition and Performance: An Interview with Denis Smalley.” Computer Music Journal 24(2):10–21.","cites":null},{"id":937411,"title":"Sound, Space, Sculpture: Some Thoughts on the ‘What,’ ‘How,’ and (Most Importantly)","authors":[],"date":"1998","doi":"10.1017\/S1355771898002040","raw":"Harrison, J. 1998. “Sound, Space, Sculpture: Some Thoughts on the ‘What,’ ‘How,’ and (Most Importantly) ‘Why’ of Diffusion . . . and Related Topics.” Journal of Electroacoustic Music 11:12–20.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69114.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/28292\/1\/CMJ_FINAL_ARTICLE_BARRETT2007.pdf","pdfHashValue":"06f68fc86f46c8d2ec351caef5b59181db02f847","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:28292<\/identifier><datestamp>\n      2018-01-24T02:53:05Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4D:4D31<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Creating sonic spaces : an interview with Natasha Barrett.<\/dc:title><dc:creator>\n        Otondo, Felipe<\/dc:creator><dc:subject>\n        M Music<\/dc:subject><dc:date>\n        2007<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/28292\/1\/CMJ_FINAL_ARTICLE_BARRETT2007.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1162\/comj.2007.31.2.10<\/dc:relation><dc:identifier>\n        Otondo, Felipe (2007) Creating sonic spaces : an interview with Natasha Barrett. Computer Music Journal, 31 (2). pp. 10-19. ISSN 1531-5169<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/28292\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1162\/comj.2007.31.2.10","http:\/\/eprints.lancs.ac.uk\/28292\/"],"year":2007,"topics":["M Music"],"subject":["Journal Article","PeerReviewed"],"fullText":"Felipe Otondo\nDepartment of Music\nUniversity of York\nYork Y010 5DD United Kingdom\nhttp:\/\/music.york.ac.uk\/\nfo500@york.ac.uk\n10 Computer Music Journal\nNatasha Barrett is a freelance composer who cur-\nrently lives in Norway. Her compositional output\nconsists of works for instruments and live electron-\nics, sound installations, dance, theatre, and anima-\ntion projects, but all her energy seems to stem from\nher acousmatic composition. In 2006, she received\nthe Nordic Council Music Prize—the most presti-\ngious recognition for a Nordic composer. She has\nalso received awards from the Bourges International\nElectroacoustic Music Competition (1995, 1998,\n2004), Concurso Internacional de Música Elec-\ntroacústica de São Paulo (2001), the International\nRostrum for Electroacoustic Music (2002), and the\nNoroit Electroacoustic Music Competition in France\n(1998, 2002), among others. Barrett’s projects are fre-\nquently commissioned by international organiza-\ntions, and her music is available on the Empreintes\nDIGITALes, Cultures electroniques\/Mnemosyne\nMusique Media, Centaur, Computer Music Journal\nSound Anthology, Prix Noroit, and Aurora labels.\nHer studies include a master’s degree at Birm-\ningham University with Jonty Harrison and a doc-\ntoral degree supervised by Denis Smalley at City\nUniversity, London. Table 1 provides a list of her\ncompositions.\nThis interview took place at the International\nComputer Music Conference in Barcelona, Spain,\non 8 September 2005, and was focused primarily on\nthe composer’s thoughts on spatialization. Since\nthis interview took place, the transcription has been\naugmented with additional information in subse-\nquent communication with Ms. Barrett.\nThe Listening Space\nFelipe Otondo: You have been dealing with spatial\ndesign for quite some time. What is your approach\ntoward the use of space in electroacoustic music?\nNatasha Barrett: It depends on your listening\nspace. If for now you think about space away from\nthe context of the listener—for example, if you are\nalone in the studio—I think you can compose a\nthree-dimensional impression of space, even when\nyou manipulate phantom images with two loud-\nspeakers. In stereo, you can then create a great\ndeal of depth—you can work with many degrees\nof middle-, fore-, and background. This sense of\nspace is often captured through a careful recording\ntechnique. But then, of course, as soon as you\nleave that private listening space, your composed\nspace may collapse because you are no longer in\ncontrol of your environment. At this point, I find\nthat spatial information suggesting simple room\nacoustics can be quite stable, whereas other types\nof spatial information that create, for example, a\nsense of perspective, occupation, or embodiment,\nare fragile.\nSo then you need to think, “How is my space go-\ning to function?”—and you might like to try alter-\nnative spatialization techniques. Furthermore, you\nneed to decide whether you are aiming at home or\nconcert listeners, in which case I think you need to\napproach these situations in different ways. One\nway in which I have found common ground for con-\ncert and home listening has been with surround and\nambisonics spatialization.\nOtondo: Don’t you see a contradiction there—a\nproblem that many people don’t seem to be aware\nof—a conflict between this space you can create in\nthe studio and this open space in a concert?\nBarrett: Well, as soon as you take your stereo work\ninto a concert, you can make it sound multichannel\nand occupy the room. I expect other people you\nhave interviewed have said the same thing. Often,\nwhen I talk to someone outside our field, they ask\nhow many channels I have in the source. They don’t\nbelieve me when I say it is stereo. If the loudspeak-\ners are set up correctly, if you have the right space\nand you know what you are doing, then you can\nCreating Sonic Spaces:\nAn Interview with\nNatasha Barrett\nComputer Music Journal, 31:2, pp. 10–19, Summer 2007\n© 2007 Massachusetts Institute of Technology.\nOtondo 11\nTable 1. Compositions by Natasha Barrett\nTitle Instrumentation\/Medium Year\nCrack Process Percussion, trumpet, electric guitar, and computer 2006\n(ambisonics and conventional multichannel)\nDeep Sea Creatures Acousmatic (stereo, 5.1, 12-ch, or 16-ch) (ambisonics 2006\nand conventional multichannel)\nMobilis in Mobili Acousmatic (stereo, 5.1, 12-ch, or 16-ch) (ambisonics 2006\nand conventional multichannel)\nTrade Winds Acousmatic (stereo, 5.1, 12-ch, or 16-ch) (ambisonics 2006\nand conventional multichannel)\nHommage à Parmerud Acousmatic (stereo and 5.1) 2005\nAbemolpas (Avoid being eaten by mimicking Acousmatic (5.1, ambisonics, and conventional 2004\nother less palatable species) multichannel)\nWhere shadows pass for bodies stand Classical guitar and computer (stereo) 2004\nExploratio Invisibilis Acousmatic (ambisonics and stereo) 2003\nSymbiosis Cello and computer (stereo) 2002\nPrince Prospero’s Party Acousmatic (ambisonics and stereo) 2002\nAngels & Devils Acousmatic (stereo) 2002\n. . . fetters of a dream . . . (Fetters) Acousmatic (stereo and 5.1) 2002\nAgora Electroacoustic Theatre (16-ch acousmatic, 2002\nsound-making installation, and soprano)\nPush-me-Pull-me Cello, violin and computer (stereo) 2001\nIndustrial Revelations Acousmatic (stereo) 2001\nDisplaced : Replaced Installation (ambisonics cubic array) 2000\nRain Forest Cycle Installation (triangular pyramid array) 2000\nRAS Percussion quartet and computer (stereo) 2000\nUtility of Space Acousmatic (ambisonics and stereo) 2000\nLiquid Crystal Clarinet and computer (stereo and multichannel) 2000\nThree Fictions Acousmatic (stereo) 2000\nCircadian Cycles Sinfonietta and computer (stereo and multichannel) 1999\nViva la Selva! Acousmatic (stereo) 1999\nDiabolus Percussion, voice, computer (stereo) 1999\nOutspan Acousmatic (stereo) 1999\nMimetic Dynamics Installation (quadraphonic) 1999\nMicroclimate II: Red Snow Acousmatic (stereo) 1998\nMicroclimate I: Snow & Instability Double bass, alto flute, percussion, and computer (stereo) 1998\nBuoyant Charm Acousmatic (stereo) 1997\/2001\nLittle Animals Acousmatic (stereo) 1997\nSurf For two classical guitars and computer (stereo) 1997\nSt Paul’s Descending into the Acousmatic (stereo) 1997\nAutumn mist\nRacing Unseen Acousmatic (stereo) 1996\nRacing Through, Racing Unseen Acousmatic (stereo) 1996\nEarth Haze Acousmatic (stereo) 1995\nSwaying to See Acousmatic (stereo) 1995\nImago Clarinets and computer (stereo) 1995\nPuzzle Wood Acousmatic (stereo) 1994\nmake a good diffusion performance sound ex-\ntremely multichannel and multilayered.\nOtondo: You are good at diffusion performance.\nBarrett: I started in Birmingham during a master’s\ndegree supervised by Jonty Harrison and have been\npracticing ever since. I can play okay—I enjoy it and\nI know that I can project the right thing in the music.\nOtondo: But it was not enough for you? Why did you\nfeel you needed more?\nBarrett: There are some limits to sound diffusion in\nthe concert. Yet there are also some advantages.\nSound diffusion is a performance practice involving\ninterpretation, and you can tailor the spatialization\nto work within the space of the concert hall. Some\ncompositions demand a specific diffusion perfor-\nmance for the musical structure to be clear. Other\nmusic gives the performer a greater degree of inter-\npretation. But whatever the intentions from the\ncompositional side, you cannot project the simulta-\nneous spatialization of different sound streams, do\nthings that are impossible to do with one pair of\nhands, work with the idea of spatialization as a\nstructuring method reliant on details a performer\nmay miss, and so forth.\nThe last point is maybe most important for me.\nIf the diffusion interpretation does not convey the\ncomposed spatial intentions, then you could say that\nthe spatial musical structure becomes a bit less accu-\nrate and takes a direction other than that intended.\nNot surprisingly, I have experienced this scenario\nmostly at events where diffusion as a performance\npractice is a rarity, even though the performer may\nhave an understanding of the music. However, with\nambisonics, because you can accurately compose the\nspatial information, you gain tighter control over\nthe spatial musical structure and therefore allow it\nto play a more important role. With sound diffusion\nperformance, you really have to accept some chance.\nOtondo: And then the performer plays a big part in\nit, giving a unique interpretation of the piece with\nwhatever style or assumption is desired.\nBarrett: Exactly, and this performance can make a\n“not-so-good” piece sound fantastic, but it can de-\nstroy a great piece if it goes against the spatial musi-\ncal structure present in the music. So when you\nwant to go further than spatial generalizations—if\nyou want to work with spatial hierarchy where tiny\nmovements in space and spatial relationships con-\ntribute to sound identity—you need a technique\nthat is not going to break in performance. This is\nthe point where I started to move into ambisonics.\nAmbisonics can also result in a concert disaster, but\nthat is a technical rather than a performance inter-\npretation issue. It has, however, meant that since\nmy sudden burst of ambisonics compositions in\n2000–2003, I am now more selective when I choose\nto use the technique.\nOtondo: Can you explain a little more about\nambisonics?\nBarrett: I’ll try to give an easy introduction. At the\nmoment there are two main ways to create and ma-\nnipulate a virtual three-dimensional sound field, or\na sound field that mimics the properties of our real\nacoustic sound field: ambisonics and wavefield syn-\nthesis. Each involves quite different methods, but in\na perfect world would produce the same result. To\ncapture or encode the spatial information in the\nfirst place, we have two choices: either we can at-\ntempt to capture the real sound field via recording,\nsuch as by using a Soundfield microphone, or we\ncan synthesize the spatial information using the\nmath of either ambisonics or wavefield synthesis.\nWith ambisonics, higher-order representations pres-\nent a more accurate description, where each order\ncorresponds to an order of spherical harmonics.\nOtondo: Can you explain a little more about the\nhigher-order representations?\nBarrett: You can make a comparison to spectral rep-\nresentation, where if you try to represent a complex\nsound with one sine tone you don’t get very far. But\nthe more harmonics you add, the closer your repre-\nsentation will be to the original. The same goes for\ncapturing the three-dimensionality of sound using\nspherical harmonics. The Soundfield microphone\ncan capture a first-order representation, otherwise\nknown as B-format. This is not a very accurate de-\nscription of the sound field compared to higher-\norder representations. Therefore I choose to work\nmore with the latter.\n12 Computer Music Journal\nOtondo\nOtondo: So once you have captured or encoded the\nspatial information, what next?\nBarrett: Then we need to reproduce, or decode, the\nsoundfield information over our chosen speaker\narrangements. It is here that more compromise is\nneeded. The higher the order of the encoding, the\nmore loudspeakers we need in the decoding. But a\nnice compromise is to use a third-order encoding,\nwhich in the horizontal axis requires a minimum of\neight loudspeakers and fits quite nicely into a small\nconcert situation.\nWorking practically with compromise is the nice\nthing about ambisonics over wavefield synthesis.\nFor wavefield synthesis to recreate a soundfield,\nlittle compromise is possible, and large numbers of\nadjacent loudspeakers are required. Other compro-\nmises involve considering our perceptual interpreta-\ntion. How much accuracy of spatial information is\nperceptually relevant? How can we treat the sound\nmaterial to enhance the perception of spatial cues\nthrough filtering, loudness, and pitch changes? In\nmany situations I begin with stereo sources and\nthen relocate the sound image within my composed\nambisonics soundfield. This sometimes involves\nsplitting the sound into different frequency layers,\neach located in a slightly different spatial position.\nCreating Spaces\nOtondo: Listening to your music, one gets the feel-\ning that you are quite concerned with the issue of\ncreating spaces. You are very good at making the lis-\ntener perceive both tiny and large spaces; sometimes\nwith small objects you can create a huge space. Is\nthis related to the idea of allusion that you wrote\nabout in articles (Barrett 1999, 2002), working with\nthe material as a way to create space?\nBarrett: Creating spaces is strongly connected to\nthe experience of our surroundings, and in this re-\nspect, spatial mimicry made possible with ambi-\nsonics can be a useful approach. But you are correct,\nit is also very much connected with the idea of allu-\nsion. When you consider very tiny sounds building\nup an impression of space, then you can begin to\nimply a space within which these sounds should\nlive. If you use abstract sound material, it can be dif-\nficult for the listener to find the spatial context. If\nyou don’t want to use reverberation, you don’t have\na clear spatial context to start off with, either. But\ngradually, as the sound material unfolds, its behav-\nior, its motion behavior—the relation between\nmany things happening at once—imply space, even\nthough you are not using reverberation or clear\nsound identities. This is something I find very inter-\nesting because I don’t like using reverb. When I do, I\ntry to calculate a realistic room model using ambi-\nsonics reflections.\nOtondo: How does that work?\nBarrett: I calculate the early reflections as ambi-\nsonics reflections in the virtual space. But, as I said,\nI try not to use reverberation. I prefer to use convo-\nlution in a way that doesn’t explicitly say “this is a\nsmall room” or “this is a big room.” I find normal\nreverberation distracts too much from something\nelse you might be trying to do.\nOtondo: Has this to do with the idea of putting a\nroom inside another room as Dennis Smalley\n(Austin 2000) suggests?\nBarrett: That’s one part of it, the problem of com-\nbining the listener’s space with the space in the mu-\nsic. But I think it also has to do with the fact that a\n13\nFigure 1. Natasha Barrett.\nclear reverberation effect can dominate what you\nare doing. It blurs spectral detail and “messes up”\ntextural information. It can distract the ear from\nsomething more important, such as the indirect im-\nplication of space. For me, it is at that moment of\nimplication and ambiguity that music starts to\ncome through. The listeners start to use their imag-\nination and their own experience to find a place in\nthe music.\nAmbisonics and the Hybrid Approach\nOtondo: Going further into ambisonics, do you\nthink that aside from the advantages of three-\ndimensional sound, these systems are still restric-\ntive for most composers? They can be complex and\nquite expensive . . . you need very specific studio\nsoftware and hardware.\nBarrett: First of all, ambisonics is not expensive,\nand, for the user, it is not technically challenging.\nProvided you don’t want to program the math, it is\nnot technically challenging at all. The software I\nuse is free, and there are in fact quite a few com-\nputer music centers working with ambisonics, but\nmaybe not so many full-time composers. There are,\nhowever, problems with the stability of the ambi-\nsonics sound field that I touched on. Because ambi-\nsonics is an encoding and decoding system where\nyou encode the spatial information and decode the\nresult for the locations of your loudspeakers, this\nmeans that if you decode in advance, you have to\nplace your speakers in the exact locations for which\nyou decoded. Unless the hall is completely flat and\nof correct geometry, it is very difficult to place the\nloudspeakers correctly.\nNow, with ambisonics, the nice thing is that you\ncan decode your encoded information for (theoreti-\ncally) any loudspeaker geometry, and so you might\nthink it would be easy to decode on site. But in\npractice, that doesn’t always work, because the de-\ncoding algorithms currently do not cope well with\nasymmetry in loudspeaker placements and loud-\nspeaker responses. So as soon as you change a circle\nto an oval—just that compression along one axis—\nthe decoding algorithms will not work as well.\nOtondo: What happens then?\nBarrett: When loudspeakers are different distances\nfrom the central point, you have to think about phase\nproblems throughout the spectrum and volume dif-\nferences. The sound field will be distorted and will\nbreak down. In practice, when listening, this can re-\nsult in an uneven sound distribution, front–back re-\nversal, or simply a feeling of spatial mono or spatial\n“meaninglessness.” In my successful ambisonics\nconcerts, I’ve carefully set up the loudspeakers just\nfor this music. However, if you setup a diffusion rig\nin the standard European diffusion format, such as\nthe BEAST format (Harrison 1998), stereo diffusion\nwill work much better than ambisonics. Currently, I\nnormally only set up an ambisonics concert array if\nI am playing only ambisonics works, or if the project\nis an installation where I can exactly locate the equip-\nment. Despite my faith in soundfield recreation tech-\nniques, I also need to be realistic about my demands!\nOtondo: But it does fit well with 5.1 surround?\nBarrett: Yes. Even though 5.1 is asymmetric, the\nloudspeakers are the same distance from the center\npoint, which makes decoding easier than, for example,\nfor an oval. When composing for a fixed speaker array\nsuch as 5.1, I sometimes use normal panning as well.\nOne of the great things about ambisonics is that it is\neasy to make a feeling of space and to make clear tra-\njectories. But when a sound is stationary, then the\nlocation is not quite as clear, and it is better to place\nthe sound in a conventional way. Straightforward\n5.1 for home listening is not a problem, but I don’t\nthink 5.1 works that well in the concert where the\nlistener is not sitting in the perfect location. In con-\ncerts where it has been necessary to play from a 5.1\nsource, I have used at least two 5.0 configurations—\none 5.0 configuration close and one distant or one\nelevated, and manually diffused between the two\nwith careful control over the subwoofer channel.\nOtondo: So you create the piece in ambisonics and\nthen you do the mix again in 5.1?\nBarrett: Actually, I first create the piece in quad or\nstereo while listening in the perfect position. With\nmy first ambisonics piece (The Utility of Space), I\nworked in a second-order, nine-channel ambisonics\n14 Computer Music Journal\nOtondo\nformat from the beginning, and my computer was\nnot fast enough to do all the multichannel mixing\nand decoding in real time. I had to encode and then\ndecode out of real time and then mix and listen. It\nwas a big piece that took too long sitting and wait-\ning for the computer to complete the task. Now ma-\nchines are faster, and software has changed. With\nmany of my ambisonics pieces, I spatialize maybe\n20 simultaneous items, which still puts a strain on\nthe computer if also simulating air absorption, the\nDoppler effect, and maybe a few early reflections.\nOtondo: So, what do you do then?\nBarrett: Then I use scripting software that allows\nme to script as many simultaneous objects as I\nwant, but as a non-real-time process. Then we are\nback to first working in stereo or quad, getting a\ngood sense of potentially three-dimensional infor-\nmation, and—when all other aspects of the compo-\nsition are correct—implementing spatial ideas that\nI could only plan or imagine in the earlier stages.\nYou could say that I render the high-quality ver-\nsion at the end once I’ve got the composition “right.”\nTo some people, it may sound strange that I compose\nfirst in stereo or normal quad and then realize the\nambisonics version once the materials, the timing,\nthe counterpoint, and the flow are correct. Things\ndo change when you compose the ambisonics field,\nobviously—when calculating Doppler shifts and fil-\ntering, pitch and volume changes! Then you have to\ngo back and change the material—but to do most of\nthe composition first in the more traditional format\nmakes the complete process manageable.\nOtondo: So you have developed a sort of hybrid\napproach . . .\nBarrett: Yes, I have from the compositional point of\nview, because the technical aspects of ambisonics\nwere starting to get in the way of the compositional\nprocess.\nOtondo: This allows you to work with more tradi-\ntional spatial formats. I guess you spend some time\ndoing all this.\nBarrett: Well, it’s quicker now because software is\neasier to use and more accommodating to multi-\nchannel formats.\nOtondo: How do you compensate in ambisonics for\nthe size and the acoustics of the hall?\nBarrett: If it is a very reverberant space, you don’t use\nambisonics. In a large-room acoustic, the music needs\ncare to bring out the detail. In that case, I would go\nfor diffusion, and I would go for the diffusion of stereo\nrather than multichannel. This is because you can con-\ntrol the piece better and adjust for the changes that hap-\npen due to the sound moving in a big acoustic with a\nstrange coloration. In a very reverberant room, the only\nreason I would use a multichannel version is if the\npiece were to be divided into layers that I would diffuse\nsimultaneously, and not as, for example, eight fixed\nchannels. You could call it multiple-stereo diffusion.\nMultichannel and 5.1 Surround\nOtondo: Just about that, what is your opinion about\nthe conventional approach of multichannel diffusion?\nHave you made pieces that are just multichannel?\nBarrett: Not multichannel in a conventional sense.\nMy first multichannel piece was in fact an ambi-\nsonics work (The Utility of Space), and was later\nmixed to stereo for practical reasons.\n15\nFigure 2. Dodecahedron\nsetup from the ambisonics\nversion of Exploratio\nInvisibilis.\nOtondo: Do you think purely multichannel compo-\nsition is restrictive?\nBarrett: It depends how you work. For example,\nBarry Truax has worked in a way where his compo-\nsitional approach is partly dependent on the multi-\nchannel setup (Truax 1999). So, it depends on the\nkind of music and the approach that you have, and\nmy approach is not like that. It would therefore be\ninappropriate for me to start that way.\nOtondo: It is very difficult to monitor with eight\nspeakers in a conventional studio.\nBarrett: That’s right, it is difficult. I think Annette\nVande Gorne has a studio where they monitor in\neight. I remember it’s very nice there. I sometimes\nmonitor in an octagonal setup, but only in the last\nstages of the composition. If you are not working\nwith speakers as independent voices, then there is\nless reason to monitor over eight speakers—at least\nin the horizontal axis. As long as you are sitting in\nthe perfect position, four speakers are enough. In\nthat respect, I have composed directly into quad for\nsome parts of a piece, and then converted the mix to\neight channels or multiples thereof, or separate near\nand far layers, and near and far multichannel mixes.\nOtondo: Don’t you think one could combine both\nmultichannel techniques? Maybe surround 5.1 is a\ngood example of that.\nBarrett: Of course, you can combine any tech-\nnique—there is no limit. It just depends on the mu-\nsic and your intention. In a way, 5.1 surround is a\nhybrid combining the idea of the center speaker as a\nvoice with normal phantom images.\nOtondo: I have been working a bit with surround\n5.1 trying to get an idea of the transition from the\nliving room or studio situation to the concert hall\nsituation, and I have found that it is a very complex\ntransition in terms of spatial experience for the lis-\ntener (Otondo 2005). What is your approach towards\nsurround 5.1? Do you think it is something fashion-\nable that will disappear in some time?\nBarrett: No, I don’t think it will disappear at home,\nbecause in a way it is a practical setup. Some home-\naudio consumers don’t listen in 5.1—they listen in\nquad and drop the center channel or pan it center\nfront. But, if I am thinking in a practical way, then I\nhave to understand that most people who buy a 5.1\nsetup are not audio experts—they have a home cin-\nema system. The 5.1 layout does not fit into all liv-\ning rooms, but it can, if you reorient furniture and\nchange your life a little bit! But to contradict my-\nself, playing ambisonics goes “out the window”\nwhen the 5.1 system consists of three unknown and\ndifferent types of loudspeakers.\nOtondo: But what happens with 5.1 in the concert\nhall?\nBarrett: In the concert hall there are two problems\nwith 5.1—maybe more than two problems, but two\nmain problems. The first problem is that in a large\nconcert hall, the five speakers are far away from the\naudience, so you loose a sense of intimacy. With dif-\nfusion, of course, you place speakers at different dis-\ntances to the audience, whereas in concert playback\nof 5.1, because the speakers are far away, the rever-\nberant field blurs the direct source early on, and\nthere is nothing you can do about it.\nThe second problem has simply to do with five\nspeakers not being enough for a large space. If you\nare not sitting in the center, then you get a biased\nsound picture, and of course all the big cinemas use\nmore than just five loudspeakers. Often there will\nbe a large array at the front, and then extra loud-\nspeakers at the sides and back. This doesn’t solve\nthe loss of intimacy, but as large cinemas are rather\ndry, reverberation does not cause so much of a prob-\nlem. As I mentioned earlier, my own solution is to\nwork with multiple 5.0 configurations and diffuse\namong them.\nOtondo: So you also have this problem when you\ngo from ambisonics in a 5.1-channel arrangement in\nthe studio and you play it in a 5.1-channel system in\na concert hall?\nBarrett: Same problems—interference from re-\nverberation and not enough speakers to fill in the\nspace.\nOtondo: Let’s pretend I am a millionaire, and I will\ngive you the chance to play your music in a perfect\nenvironment. What would you want?\n16 Computer Music Journal\nOtondo\nBarrett: Well, then I would tell you to build a con-\ncert hall! Well, to be realistic, then I would say to\nbuy some good loudspeakers.\nOtondo: How many speakers would you use then?\nBarrett: Depends on the size of the space.\nOtondo: A normal concert hall.\nBarrett: A normal concert hall for ambisonics? Six-\nteen would be good. Maybe another sixteen for ele-\nvation. And then you could probably create a good\nsound field. But again, you need to have the right\nkind of speakers.\nOtondo: Do you need the same type of speakers?\nBarrett: For ambisonics, yes. If not, different speaker\ncolorations and diffusion angles will distort the\nrecreation of the sound field.\nSpace and Composers\nOtondo: Now I’d like to get into something more\ngeneral. Do you think there has been a change in\nthe approach toward space lately by electroacoustic\nmusic composers due to cheaper and more sophis-\nticated equipment?\nBarrett: [Laughs] Depends what country you are in.\nOtondo: In general.\nBarrett: Not as much change as there could have\nbeen. The main difference is that composers are us-\ning better reverberation effects. But the understand-\ning of spatial issues, at least among composers, is\nstill not so advanced.\nOtondo: Don’t you think that cheaper sound cards\nand the spatial possibilities of programs like Max\/\nMSP, pd, Spat, and others have opened new possibil-\nities for spatial design?\nBarrett: Well, many people are working with multi-\nchannel music. The problem is that some appear\nunclear as to why they are doing it. Maybe they work\nwith multichannel because it is “the thing to do.” I\nhave, however, unfortunately been seated in bad lis-\ntening positions in many multichannel concerts—\nstuck on an end with one loudspeaker pointed at my\near. I have experienced stereo diffusion that sounds\nmore “multichannel” than some real multichannel\npieces. One assumes that with multichannel you\ncan easily play with independent spatial trajectories,\nbut getting that to function in the concert space is\ndifficult once the music is fixed to maybe eight\nchannels. When the sound just gets stuck at the\nback due to the room acoustics, speaker characteris-\ntics, or inaccurate speaker placement, there is little\nthat can be done. In part I think the spatialization\nequipment and technology have become readily\navailable, but the users haven’t caught up.\nOtondo: Why? Because it is difficult?\nBarrett: I would not say it is difficult, only that it\nrequires a level of understanding, as all skills do.\nWhen you first begin, the temptation to swing\nsounds around the room is enormous! It feels physi-\n17\nFigure 3. Sound-making el-\nements from the installa-\ntion part of Barrett’s work\nAgora.\ncal and immediate. But spatialization is about so\nmuch more than that.\nOtondo: So new means imply new complexities,\nbut people are not really aware of it, they are just\nusing and abusing this technology?\nBarrett: That is what I sometimes hear.\nInstrumental Pieces\nOtondo: I have listened to your piece Symbiosis for\ncello and live electronics in one of the listening\nrooms here at the ICMC and wanted to ask you,\nwhat is the difference in the spatial approach when\nyou work with instruments compared to those\npurely electroacoustic works that you mostly write?\nBarrett: Well, I think my opinion is the traditional\none. When a performer is on stage, the visual aspect\nmeans you hear in a different way. And so in Sym-\nbiosis, you see the cellist on stage. She is not just\nsitting there playing—she is moving around a little\nbit and using her voice. It is a dynamic piece, and so\nher whole physical presence is quite spectacular.\nWhat you are seeing ties you down; it provides a\nconstant reference point regardless of whether the\nsound is moving through the space. One has to take\nadvantage of this fact and not experience it as a\nproblem. Although the electroacoustic part of Sym-\nbiosis contains some spatially relevant non-cello\nsound material, the cello is the center of that sound\nworld, and the performer is articulating the struc-\nture, visually emphasizing the aural totality. In par-\nticular, sound propagates from the performer and\naway throughout the space.\nOtondo: So you take a completely different spatial\napproach than with the purely electroacoustic\npieces—you try to understand things from a perfor-\nmance perspective.\nBarrett: The thing is that in reality, when you com-\npose a piece for a performer, normally the per-\nformer has commissioned the work and therefore\nyou should write something that is good to be per-\nformed, something that takes full advantage of that\nperfomer’s skills. Often you may have a musical\nagenda that is not the same as the performer’s\nagenda, especially coming from an acousmatic point\nof view, and you need to balance these agendas and\nfind things that work.\nOtondo: You have different goals you want to\nachieve with the piece?\nBarrett: Sometimes. For example, unless I am com-\nposing a purely theatrical work, my initial agenda is\nsound, whereas the performers’ primary agenda is\nperformance, and they are not necessarily the same\nthing. This is, of course, not always the case, but ei-\nther way we need to integrate the demands of both\nperformance and sound. For example, in Symbiosis,\nthere is—toward the end—a stretch of three min-\nutes for solo computer.\nOtondo: There are also parts where it is almost\npurely instrumental.\nBarrett: Exactly, and in Symbiosis, this is one way\nin which I balance the elements: to give both parts\nsolos and to have both coming together at important\nmeeting points. In those three minutes of solo com-\nputer, the performer has to find a way to “compose”\nherself. Everybody is looking at her, and she is a per-\nformer having to listen. In that section the theater\nemerges as she demonstrates the act of listening and\nnot just sitting there waiting for the next thing to\nhappen. You see a string quartet play a piece with\ncomputer or tape, particularly when they play with\na click track, and they look like they are thinking,\n“When do I come in next? What time is it?”\nOtondo: It looks like they are really uncomfortable.\nBarrett: That’s right, so one trick is to find a way\nfor both parties to feel comfortable when the other\nis soloing. For me, it is the potential in the sound\nthat makes the integration of the reality of the per-\nformance and the reality of the sound possible.\nOtondo: When you play a piece like this one live,\nare you concerned with the issue of the balance of\nthe reproduced sound and the radiated sound from\nthe instrument? I feel that most live-electronics and\ninstrument-plus-tape pieces that I have listened to\nin concerts have a problem in this respect. The lis-\ntener gets a very fragmented spatial experience with\n18 Computer Music Journal\nOtondo\nthe sound radiated from the instrument coming di-\nrectly from the center and the sound coming from\nthe speakers from the sides. It is hard to integrate\neverything spatially.\nBarrett: Yes—well, integration is a two-fold problem.\nThere is the issue of composition, where you have\nto consider spectra, gesture, and articulation, and\nthere is the issue of concert loudspeaker setup—\nplacing the equipment correctly in relation to the\nperformer and the space. You could refer to some\nwell-known pieces by Dennis Smalley, and you can\nsay they demonstrate a spectromorphological unity.\nBut then when it comes to the concert, if you use\nspeakers in one part of the hall and place the per-\nformers elsewhere, this will result in a detachment\nof sound sources. There is the practical aspect of\nsetting up the speaker rig so that these two layers of\nacoustic and electroacoustic elements—of composi-\ntion and performance—function. For this, it is nor-\nmal to place a pair of speakers quite close to the\nperformers on stage as the primary projection of the\namplified acoustic sound (if this sound is amplified\nat all), or for the primary projection of live sound\ntransformation.\nOver these speakers, we can also balance some of\nthe pre-made electroacoustic sound material. As\nmore speakers are spread around the hall, then I dis-\ntribute a little of the acoustic or live transformation\nalong with more of the other types of sound—such\nas non-instrumental sound material or material\nthat if heard toward the back or in the surroundings\nwon’t feel detached from the performance. This\nmeans we can build a sound world where the instru-\nmental sounds come from the direction of the per-\nformers, unless the conceptual aspect of the\ncomposition demands otherwise.\nOtondo: But don’t you think that is the easiest thing\nto do—most composers detach the transformed\nsound from the instrument’s sound. Like most of\nthe pieces we have listened to here at the ICMC in\nBarcelona, we have sounds totally detached from\nthe radiated sound of the instruments. Don’t you\nthink that the hard thing to do is to try to integrate\nthe sound spatially and at a level of timbre? It is\nhard to find pieces where it is done properly.\nBarrett: I think we are looking at a difference in\naesthetic. In performance I often find that the North\nAmerican style is somewhat different from the Eu-\nropean style. Yet on a recording, I suppose it’s the\nluxury of studio editing that maybe blurs these dif-\nferences in aesthetic.\nOtondo: You are quite skeptical about this.\nBarrett: Not at all. It’s a matter of taste. The style\nthat I hear at this ICMC uses the tape and computer\nparts as if they were two separate “acoustic” instru-\nments. The electroacoustic part contains articula-\ntions and sounds which are strongly instrumental\nin character. This type of material allows you to\nspatially detach the electroacoustic from the live\npart in that the electroacoustic becomes an “invis-\nible acoustic” performer. Whereas a conjunction of\ntextures and sound fields, of articulations and tra-\njectories, I believe, stems from a different aesthetic\nand a different compositional approach. Although\nmy personal taste is with the latter (probably stem-\nming from my admiration of Varèse), I can defi-\nnitely appreciate a good piece of music working\nwith the former aesthetic. After all, it’s the music\nthat counts.\nReferences\nAustin, L. 2000. “Sound Diffusion in Composition and\nPerformance: An Interview with Denis Smalley.” Com-\nputer Music Journal 24(2):10–21.\nBarrett, N. 1999. “Little Animals.” Computer Music Jour-\nnal 21(3):13–15.\nBarrett, N. 2002. “Spatio-Musical Compositional Strate-\ngies.” Organised Sound 7(3):313–323.\nHarrison, J. 1998. “Sound, Space, Sculpture: Some\nThoughts on the ‘What,’ ‘How,’ and (Most Importantly)\n‘Why’ of Diffusion . . . and Related Topics.” Journal of\nElectroacoustic Music 11:12–20.\nOtondo, F. 2005. “Some Considerations for Spatial De-\nsign and Concert Projection with Surround 5.1.”\nPaper presented at the 2005 Digital Music Research\nNetwork Summer Conference, 21 December,\nGlasgow.\nTruax, B. 1999. “Composition and Diffusion: Space in\nSound in Space.” Organised Sound 3(2):141–146.\n19\n"}