{"doi":"10.1007\/s11158-007-9028-9","coreId":"71285","oai":"oai:eprints.lancs.ac.uk:4350","identifiers":["oai:eprints.lancs.ac.uk:4350","10.1007\/s11158-007-9028-9"],"title":"Society Against Societies: the possibility of transcultural criticism.","authors":["Clark, Samuel"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-06","abstract":"This paper argues against particularism about social criticism of the form presented by Walzer. I contend that while limitation of the scope of criticism depends on the existence of our shared meanings, which are not shared by them, shared meaning itself depends on society. So, an account of society showing that societies are not discrete and mutually inaccessible refutes particularism. I argue for such an account. I deal with the objection that the focus of particularism is culture, not society, and conclude that the conditions of possibility of shared meaning have anti-particularist consequences","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71285.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/4350\/1\/Society_Against_Societies.pdf","pdfHashValue":"6d1fc76f66c99828e71034c9da7b6a67d6acb4a3","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:4350<\/identifier><datestamp>\n      2018-01-24T03:12:12Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4A:4A43<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Society Against Societies: the possibility of transcultural criticism.<\/dc:title><dc:creator>\n        Clark, Samuel<\/dc:creator><dc:subject>\n        JC Political theory<\/dc:subject><dc:description>\n        This paper argues against particularism about social criticism of the form presented by Walzer. I contend that while limitation of the scope of criticism depends on the existence of our shared meanings, which are not shared by them, shared meaning itself depends on society. So, an account of society showing that societies are not discrete and mutually inaccessible refutes particularism. I argue for such an account. I deal with the objection that the focus of particularism is culture, not society, and conclude that the conditions of possibility of shared meaning have anti-particularist consequences.<\/dc:description><dc:date>\n        2007-06<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/4350\/1\/Society_Against_Societies.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s11158-007-9028-9<\/dc:relation><dc:identifier>\n        Clark, Samuel (2007) Society Against Societies: the possibility of transcultural criticism. Res Publica, 13 (2). pp. 107-125. ISSN 1356-4765<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/4350\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1007\/s11158-007-9028-9","http:\/\/eprints.lancs.ac.uk\/4350\/"],"year":2007,"topics":["JC Political theory"],"subject":["Journal Article","PeerReviewed"],"fullText":"Society against societies: the possibility of transcultural criticism1\nSamuel Clark\nPenultimate draft; for final version, see Res Publica 13(2007): 107-125\nIt is often supposed that we should not impose ‘our’ constructions, understandings \nand values on ‘other’ cultures. Sometimes, this is because it is thought that to do so is \nanalogous, or even causally related, to tyrannical imperial and colonial politics, and \ntherefore morally bad in the same way that they are morally bad. I shall approach this \nclaim via a further, and in some ways stronger claim, that there is something \nepistemically as well as morally problematic about transcultural understanding. \nSpecifically, that it is impossible for (meaningful) moral criticism, which requires \nunderstanding, to reach outside ‘our’ culture.\nThe wider context of this idea is the question of global justice: What is the \npractical, moral and epistemic significance of boundaries between cultures, societies, \nnations or states?2 My target here is one of several positions which claim that the \nscope of justice is, or should be, restricted by one of these kinds of boundary. Realists \nsuch as Kenneth Waltz, for instance, have argued that the only duty of a state in the \ninternational system is to pursue its own strategic interests, and therefore that state \nboundaries are the limit of international morality3. Nationalists such as David Miller, \nfor another instance, argue that the demands of (at least) distributive justice apply \nonly within the nation understood as a distinctive, valuable, and necessarily size-\nlimited form of human association4. The position I criticise here, particularism, also \nclaims that the scope of justice is limited, in this case by a shared culture which makes \nmoral understanding and criticism possible. It is importantly distinct from realism and \n                                                \n1 This paper draws on Samuel Clark, Living Without Domination: The possibility of \nan anarchist utopia (Aldershot: Ashgate, forthcoming 2007), chapter 2. I would like \nto thank Gideon Calder, and two anonymous referees for Res Publica, for their \nhelpful comments on an earlier draft.\n2 For more on boundaries, see Onora O’Neill, ‘Identities, Boundaries and States’ in \nBounds of Justice (Cambridge: CUP, 2000), pp. 168-85. For the global justice debate \nin general, Simon Caney, Justice Beyond Borders: A global political theory (Oxford: \nOUP, 2006).\n3 Kenneth Waltz, Theory of International Politics (Reading Mass.: Addison Wesley, \n1979).\n4 David Miller, On Nationality (Oxford: Clarendon Press, 1995); Miller, ‘Bounded \nCitizenship’ in Citizenship and National Identity (Cambridge: Polity, 2000), pp. 81-\n96.\nnationalism, however, in that it grounds that claim on epistemic rather than on \nnormative or practical arguments. For the particularist, moral knowledge, the \nnormativity of morality, and the possibility of moral criticism, all derive from the \nshared meanings generated by culture. So, criticism cannot reach across boundaries \nbetween cultures, because there is no substrate of shared meaning by which \nintercultural criticism could be sustained. My analysis and criticism of this position \nfocusses especially on work by Michael Walzer, as perhaps the most prominent \nmodern particularist.\nIn Spheres of Justice5, Walzer offers an account of the nature and scope of \njustice which is quite distinct from familiar egalitarian, desert-based and rights-based \ntheories. His account is pluralist in three linked senses. First, justice is not universal \neither in space or in time, but is a local and temporary creation of particular political \ncommunities. Second, there are multiple kinds of good, each with its own criteria of \njust distribution deriving from how a particular community understands that good. At \nleast for modern liberal societies, the goods are security and welfare, money and \ncommodities, office, hard work, free time, education, kinship and love, divine grace, \nrecognition, and political power. Third, there is no underlying, unifying or \nfundamental principle which either determines justice for all communities, or entails a \njust distribution of all goods. Justice is grounded differently for different \ncommunities. That is, the Walzer of Spheres of Justice is an anti-universalist about \njustice, an anti-monist about the good, and an anti-foundationalist about justification. \nWalzer calls the theory of justice which he derives from these basic commitments \ncomplex equality: it is satisfied, and a community is therefore just, when each good is \ndistributed according to its own, distinctive criteria in its own sphere, and when \nadvantage in any one sphere does not translate into advantage in any another. So, for \n                                                \n5 Michael Walzer, Spheres of Justice: A defence of pluralism and equality (New \nYork: Basic Books, 1983). See also Walzer, Interpretation and Social Criticism\n(Cambridge Mass.: Harvard University Press, 1987). Walzer’s views have changed \nsomewhat since the publication of Spheres of Justice. In Thick and Thin: Moral \nArgument at Home and Abroad (Notre Dame: University of Notre Dame Press, 1994), \nWalzer wants ‘to endorse the politics of difference and, at the same time, to describe \nand defend a certain sort of universalism’ (p. x). However, since my target is a widely \nheld view of which Spheres of Justice gives a particularly elegant statement, and not \nWalzer himself, this complication need not detain us here. The general account of \nSpheres of Justice which I give here draws on David Miller, ‘Introduction’ to David \nMiller & Michael Walzer eds, Pluralism, Justice, and Equality (Oxford: OUP, 1995), \npp. 1-16.\ninstance, justice is achieved in the sphere of money, in ‘our’ liberal democratic \ncommunity, when it is distributed according to skill and luck in the market, and when \nwealth cannot buy political power.\nOn the basis of this theory of justice, Walzer argues that only internal criticism \nis possible, and that since our only moral resources are in our shared ‘social \nmeanings’6, the shared meanings and ways of life of others are neither available to us  \nfor comparison nor vulnerable to criticism from us. For Walzer, there is no \ntranscultural point of view from which we could judge all, or even our own \ninstitutions: there cannot be a view from no culture7. All one can do is ‘interpret to \none’s fellow citizens the world of meanings that we share’8. So, all criticism of ways \nof life is internal criticism, which shows us that we are not living up to our own best \nunderstanding of justice. Social criticism must be connected criticism – a matter of \nexpressing our own standards and highlighting our hypocrisy and failure to live up to \nthem, not a matter of deriving prescriptions from universal axioms9. Comparison with \nsome other social form is irrelevant to that task, and delusive in its pretence that we \ncould stand back from our own and compare it with another’s understanding. ‘A \ngiven society is just if its substantive life is lived in a certain way – that is, in a way \nfaithful to the shared understandings of [its] members’10; it is unjust if not. It cannot \nbe praised or condemned according to how it compares to values or understandings\nexternal to it. A caste society cannot be criticised for not living up to egalitarian ideals \n(nor vice versa). The moral and political understandings of other societies are not \navailable to us: our political imaginations must be expanded, if at all, by the discovery \nand imaginative interpretation of our own best selves. The politics which Walzer \nuncovers and interprets for us is radically egalitarian and democratic, but his \nmethodology is ‘radically particularist’, and so ‘If such a society isn’t already here –\n                                                \n6 Walzer, Spheres of Justice, p. 9\n7 The allusion here is, of course, to Thomas Nagel, The View From Nowhere (Oxford: \nOUP, 1986).\n8 Ibid., p. xiv.\n9 In The Company of Critics: Social criticism and political commitment in the \ntwentieth century (New York: Basic Books, 1988), Walzer investigates some \nexemplary critics in this style, including, for instance, George Orwell, Martin Buber, \nAlbert Camus and Herbert Marcuse.\n10 Walzer, Spheres of Justice, p. 313.\nhidden, as it were, in our concepts and categories – we will never know it concretely \nor realize it in fact.’11\nWalzer’s argument has been criticised on the grounds that the social meanings \nof at least some goods do not uniquely determine criteria for their distribution. Brian \nBarry12, for instance, argues that the meaning of money for us is just that it is an \nanonymous claim on other goods and services, and that meaning entails no particular \ncriteria for just distribution. Ronald Dworkin13 further argues that in our tradition, not \nonly do the social meanings of goods not uniquely determine justice in their \ndistribution, but Walzer’s appeal to social meaning is self-effacing. Our tradition is \nthat the just distribution of goods, for instance medical care, is a matter of continuing \nargument rather than consensus; and that argument is explicitly foundationalist. \nEquality, need, desert or rights, rather than the meaning of goods, determine justice. \nSo, if Walzer really wants to rely on shared meanings, he should accept that shared \nmeanings are the wrong place to look for a theory of justice.\nThis paper adopts a different critical strategy. I shall assume, for the sake of \nargument, that justice does arise from the shared social meanings of goods, and that \nthose goods have a sufficiently determinate shared meaning to give concrete \ndistributive prescriptions; and then show that, even given these assumptions, Walzer’s \nparticularism does not follow. Even if justice is a creation of culture, it is not therefore \nparticular or bounded: that the grounds of justice are to be found in culture does not \nentail that the scope of justice is limited. I shall make a kind of negative \ntranscendental argument for this conclusion: the conditions of possibility of Walzer’s \nshared meanings do not respect his community boundaries; so, if there are shared \nmeanings at all, Walzer’s particularism is refuted.\nWalzer’s argument requires that there are such things as ‘shared meanings’ \nwhich can be interpreted for critical and political purposes. The possibility of shared \nmeanings depends on the fact of human society: a permanently isolated human could \nnot share meaning. Walzer’s argument further depends on a particular understanding \nof the sharing of meaning, and therefore of society. For Walzer, we share some set of \nmeanings (democratic, pluralist, complex-egalitarian), and they share some different \n                                                \n11 Ibid., p. xiv.\n12 Brian Barry, ‘Spherical Justice and Global Injustice’ in Miller & Walzer eds, \nPluralism, Justice, and Equality, pp. 67-80.\n13 Ronald Dworkin, ‘What Justice Isn’t’ in A Matter of Principle (Oxford: Clarendon \nPress, 1986), pp. 214-20. \nset, such that our goods are different and incommensurable. There must be at least \ntwo distinct human societies, and therefore at least two distinguishable sets of \nmeanings, if there are to be examples of human sociability which are not available to \nus for comparison and example. It seems obvious, of course, that this is the case: I \nshall argue that it is not. Although individual humans are certainly different from one \nanother, and certainly encounter mutual difficulties in understanding, there are no \ndiscrete, mutually exclusive societies to make discrete, incommensurable meanings \npossible. Walzer’s argument fails, because its foundation is a faulty theory of society. \nI shall now set out and argue for the alternative theory which refutes Walzer’s.\nA theory of society14\nA theory of society could be an attempt at a complete general account, or even a \ncomplete explanation of society, but I do not intend anything so ambitious here. As I \ndiscuss further under ‘Culture and shared meaning’, Walzer’s particularism is best \nunderstood as part of the interpretative turn in the human sciences, which (putting the \npoint crudely) tried to make meaning rather than causal explanation central to \nanthropology, political science, psychology, historiography and philosophy. Part of \nwhat the partisans of this shift wanted to do was to turn away from what they \nregarded as scientism, reductionism and positivism in favour of interpretation of \nmeaning, situated investigation, and participation in ongoing practices and \nnarratives15.\nIn line with my strategy of assuming most of Walzer’s theory for the sake of \nargument, I do not intend to reject this style of working, nor therefore to take on a \nreductive project. I do not claim that the features of human sociability on which I \nfocus are real, fundamental or deep in comparison to other features, nor that they are \nfinally explanatory. In particular, I claim only that society makes shared meaning \npossible, not that shared meaning is an epiphenomenon of society. Shared meanings \nmay well have independent causal powers (I do not need to consider whether or not \n                                                \n14 The theory I develop here is deeply indebted, as ongoing citation should make \nclear, to the work of Eric R. Wolf in Europe and the People Without History\n(Berkeley: University of California Press, 1997) and Michael Mann in Sources of \nSocial Power (2 vols, Cambridge: Cambridge University Press, 1986 & 1993).\n15 See David R. Hiley, James F. Bohman & Richard Shusterman eds, The Interpretive \nTurn: Philosophy, Science, Culture (Ithaca: Cornell University Press, 1991); and, \nmore generally, Ian Shapiro, The Flight From Reality in the Human Sciences\n(Princeton: Princeton University Press, 2005).\nthey do, here). My argument is that the possibility of shared human meaning depends \non human society: the possibility of shared meaning has society as a necessary, but \nperhaps not a sufficient, condition. The truth of a theory of society which makes \nWalzer’s appeal to incommensurable meanings impossible therefore refutes his \ntheory. To repeat, the strategy can be understood as a kind of negative transcendental \nargument: the conditions of possibility of shared meaning have anti-particularist \nconsequences. Now that I have described what kind of theory is presented here, we \ncan proceed to the theory itself.\nHumans, pursuing a wide variety of interests, create, discover, modify and \ndestroy social organisations. These organisations consist of networks of humans \ninteracting in modes including cooperation, negotiation, production, exchange, \ncoercion, hierarchy, friendship, enmity, violence, ritual and play. Interactions are \ncarried out both face-to-face and through various media. Almost all humans are \ninvolved in many such networks, in many roles, and these networks overlap, \ninterpenetrate and sometimes include one another. Networks change in response to \nchanges in or discoveries of interests, to the effects of other networks, and to \nchanging environments and the opportunities and demands they create.\nAlthough it is perhaps possible that some humans could organise themselves \ninto a single, unified and discrete organisation in and through which they carried out \nall of their social activity, this has never in fact happened. There are, and have been, \nno social totalities: ‘We can never find a single bounded society in geographical or \nsocial space.’16 ‘Society’ names not a kind of organism, but an activity, apparently \nnatural for humans as for many other animals. It importantly involves the cooperative \ncreation and assignment of capacities (especially capacities to attain and distribute \ngoods, organise cooperation, manage conflict, dominate others and resist domination). \nHuman social life consists of ‘overlapping networks of social interaction’ which are \nalso ‘organisations, institutional means of attaining human goals’17.\nHuman social life has historically been both various, and sometimes quite \nstable, and I therefore use ‘social form’ as a term of convenience for any relatively \nstable and persistent bundle of networks, where it is useful to have a shorthand for \nsuch a distinguishable way of life. However, I do not intend to imply that any such \n                                                \n16 Mann, Sources of Social Power, vol. 1, p. 1.\n17 Ibid., p. 2.\nsocial form is a fully discrete society, nor that it is a higher-order entity than the \nindividuals and networks of which it consists.\nHuman society depends on general human capacities18. Humans share a \nnumber of such capacities, including capacities to learn and use language; to create, \nunderstand and use symbols; to act on reasons and explain (or conceal) those reasons; \nto have and act on a variety of emotional and dispositional states apart from reasons; \nto make and use tools; to create and challenge hierarchies; to act in, and by using, \nsocial networks; to make decisions; to be selfish or altruistic; to be violent or friendly; \nto perceive oneself as a self in the context of other selves; and to create, internalise, \nperform and find significance in rituals. Many of these capacities are shared in some \nform or degree by our close relatives, including Chimpanzees, Gorillas, Orang-Utans \nand other primates. For the same reason that we are a particular kind of evolved \ncreature, humans also share some general interests19. They include interests in food, \nshelter, company, continued life, the respect of peers and the absence of (threatened \nor actual) violence. These interests can be trumped by other, often socially \nconstructed demands, but are typical of humans and very strong. So, an appeal to such \ninterests, to a stranger, can often be effective. Individual humans’ interests can clash \nat least because they sometimes differ, and because although you and I both have \ninterests in food, for instance, our interests clash in conditions of scarcity.20\nIf this theory that human society consists in overlapping and interpenetrating \nnetworks, not discrete and mutually exclusive societies, is true, then Walzer’s theory \n(and the similar theories and beliefs of which his are an exemplar) cannot get off the \nground. Although we do share meaning, the possibility of doing so is dependent on \nsociety, and society is not such that it could make one set of meanings for us, and \n                                                \n18 ‘All human beings have various generic capacities to acquire skills, which, though \nthey differ in their specific forms from tribe to tribe, are nevertheless of the same \ngeneral kind’. Rom Harré, Social Being (2nd edn, Oxford: Blackwell, 1993), p. 3.\n19 I intend ‘interests’ here to refer to common necessary conditions of not being \nharmed or suffering deprivation, consequent on our nature as evolved creatures in a \nunfriendly physical world (compare David Wiggins’s analysis of ‘needs’: ‘Claims of \nNeed’ in Needs, Values, Truth: Essays in the philosophy of value (2nd edn, Oxford: \nBlackwell, 1991), pp. 1-57). I do not intend any particular moral claim.\n20 This paragraph sets out a conception of human nature which is minimalist by \ncomparison with many other such conceptions. It is minimalist in particular because I \ndo not suggest that it stands as a norm for humans: it is an account of (some of) the \n(biological and cognitive) capacities which make society possible, not an ideal to live \nup to.\nanother incommensurable set for them. However, we still need to show that this \nnetwork theory is true. I shall argue for it by contrasting it with a familiar, alternative \nway of characterising human society, on which Walzer’s theory would work.\nAgainst social totalities\nTo the extent that it is not simply a careless way of talking or a traditional working \nassumption, the assertion of the existence of social totalities is the claim that humans \nare typically found in discrete, unified social ‘boxes’, which have boundaries, \nsubsystems, levels or dimensions, and perhaps an internal ‘evolutionary’ dynamic, \nand within which the society’s members share meaning which is inaccessible to those \noutside. On this view, social change and conflict can be divided into endogenous and \nexogenous types, human behaviour can be explained by reference to ‘social structure \nas a whole’21, and there are two distinct, but analogous, problems for political \nphilosophy: one about how individuals within a society should organise themselves, \nand another, at a ‘second level’, about how distinct societies should organise their \ninterrelations. These problems have been thought sufficiently analogous by Kant and \nby Rawls, for instance, that they have attempted to answer both with the device of a \nhypothetical contract22.\nIt is unclear to me what these claims could be except empirical ones about \nhow humans now, or always, live23. But they are false. As Michael Mann argues:\nEmpirical proof can be seen in the answer to a simple question: In which society \ndo you live? Answers are likely to start at two levels. One refers to national states: \nMy society is “the United Kingdom,” “the United States,” “France,” or the like. \nThe other is broader: I am a citizen of “industrial society” or “capitalist society” or \npossibly “the West” or “the Western alliance.” We have a basic dilemma – a \nnational state society versus a wider “economic society.” For some important \n                                                \n21 Mann, Sources of Social Power, vol. 1, p. 1-2.\n22 Kant, ‘Perpetual Peace: A philosophical sketch’ in Hans Reiss (ed.), Political \nWritings, trans. H. B. Nisbet (2nd edn, Cambridge: Cambridge University Press, \n1991), pp. 93-130. Rawls, The Law of Peoples with The Idea of Public Reason \nRevisited (Cambridge Mass.: Harvard University Press, 1999).\n23 Perhaps the point should be put as follows: if they are not such empirical claims, it \nis very unclear why we should pay any attention to them, or, in particular, why we \nshould suppose that anything follows from them for our epistemic and critical \ncapacities.\npurposes, the national state represents a real interaction network with a degree of \ncleavage at its boundaries. For other important purposes, capitalism unites all three \ninto a wider interaction network, with cleavage at its edge. They are both \n“societies.” Complexities proliferate the more we probe. Military alliances, \nchurches, common language, and so forth, all add powerful, sociospatially \ndifferent networks of interaction. We could only answer after developing a \nsophisticated understanding of the complex interconnections and powers of these \nvarious crosscutting interaction networks. The answer would certainly imply a \nconfederal rather than a unitary society.24\nThe argument so far is that we in particular do not live in unitary and discrete \nsocieties, despite the enormous power and reach of modern states which try to divide \nus up into such boxes. This is shown, especially, by the overlapping coexistence of \ntwo different kinds of social network, national states and capitalism, and emphasised \nby the range of other, sociospatially different networks in which we are also involved. \nMann continues by arguing that this confederal situation is typical of human life, not \njust of our life. Empires, trade-and-cultural networks, world religions, all cut across \none another: ‘Overlapping interaction networks are the historical norm … The forms \nof overlap and intersection have varied considerably, but they have always been \nthere.’25 It is not only we who live in a confederal situation: most humans have \nalways lived like that. The belief in social totalities badly misrepresents the current \nand historical experience of social humans, and should therefore be abandoned. In its \nplace, we need to recognise the typical human situation of being involved in multiple, \ncross-cutting networks of interaction, with particular and different spatial and social \nreaches, tactics and dynamics. Humans ‘are social, but not societal, animals’26.\nGeneral names for social totalities like ‘culture’, ‘nation’ or ‘tribe’, and \nparticular ones like ‘Iroquois, Greece, Persia, or the United States’27 distort our \nperception of human social organisation. They need not therefore be abandoned (they \nare occasionally useful), but they obscure complex and cross-cutting inter-relations, \nand must not be hypostasised.\n                                                \n24 Mann, Sources of Social Power, vol. 1, p. 16.\n25 Mann, Sources of Social Power, vol. 1, p. 16; p. 17.\n26 Ibid., p. 14.\n27 Wolf, Europe and the People Without History, p. 7.\nSociety against societies\nI have mapped human society as a notably flat landscape, without impermeable \nboundaries. Humans, pursuing various ends and interests, create, discover, modify \nand destroy social organisations, which are networks of humans interacting in various \nways, and creating and assigning capacities. These networks overlap and \ninterpenetrate one another. Networks change in response to changes in, or discoveries \nof, interests; to the effects of other networks; and to changing environments and the \nopportunities and demands they create. Humans do not organise themselves into \nunitary and discrete social totalities, but live in confederal social situations.\nThis refutes Walzer’s claim that our only moral and critical resources are to be \nfound in our discrete shared meanings, by showing that it relies on a faulty theory of \nsociety. Since there are no discrete societies, but only cross-cutting networks, there \ncan be no such conflicts of incommensurable meaning between home and abroad, \nbetween us and them. The social meanings and forms of others are available to us for \nwarning, emulation, criticism and utopian construction. I have not argued that humans \nnever face each other across divides in understanding: that would be merely silly. I \nhave argued that the divides do not separate us into discrete bodies of people who \nshare meanings internally, but have no access or understanding externally. Each of us \nhas many networks in which we share meaning, and many boundaries at which we \ncurrently do not. I say currently, because humans clearly do have capacities to cross \nsuch boundaries: we have the capacity to create shared meaning with strangers. If we \ndid not, it is difficult to see how the shared meanings to which Walzer appeals could \nhave come about, since all of us frequently meet and deal with strangers, beginning \nwith our parents. That is: the capacity which makes Walzer’s shared meanings \npossible also makes his mutually incomprehensible bodies of meaning-sharers \nimpossible. Humans can only share meaning because we can reach across divides in \nunderstanding, and if there could be permanent strangers, there could not be \ncommunities of meaning-sharers. There is no permanent ‘we’ and incomprehensible \n‘they’.\nTo recap: I have argued that the possibility of shared meaning depends on \nsociety; that society is not such as could support the existence of incommensurable \nmeanings; and further, that the very social capacity which creates shared meanings \nmakes permanently separate societies of us and them impossible.\nCulture and shared meaning\nIt may be suggested that I have missed the point. Walzer is talking about cultures, not \nsocieties, as his appeal to shared meaning indicates. As I have already suggested, \nWalzer is part of the large post-interpretive turn camp – he is to political philosophy \nwhat Jerome Bruner is to psychology28 – and his central focus is on the interpretation \nof meaning: ‘One characteristic above all is central to my argument. We are (all of us) \nculture-producing creatures; we make and inhabit meaningful worlds.’29 In making \nthis central commitment, Walzer is following the anthropologist (and his late \ncolleague in the Institute of Advanced Studies at Princeton) Clifford Geertz in \nbelieving that ‘man is an animal suspended in webs of significance he himself has \nspun’ and taking ‘culture to be those webs, and the analysis of it to be therefore not an \nexperimental science in search of law but an interpretive one in search of meaning’30. \nWalzer’s interpretation of shared meanings and consequent critical practice are \ninterpretive, and he has taken to heart the idea that there is something especially \ndifficult about interpretation abroad, as opposed to at home. This is not a counter-\nargument to what I have claimed, unless we are prepared to suppose that culture is \nindependent of the social interactions of the people who are its carriers and makers. In \nthe absence of such an claim (which would surely be bizarre), the fact that humans do \nnot live in discrete, mutually exclusive societies means that their cultures are not \ndiscrete or mutually exclusive either.\nHowever, the point about culture, and Geertz’s semiotic understanding of it in \nparticular, is important. Walzer has adopted Geertz, and his work does appear to \n                                                \n28 See for instance Jerome Bruner, Acts of Meaning (Cambridge Mass.: Harvard \nUniversity Press, 1990).\n29 Walzer, Spheres of Justice, p. 314.\n30 Geertz, ‘Thick Description: Toward an interpretive theory of culture’ in The \nInterpretation of Cultures (London: Fontana Press, 1993), pp. 3-30. p. 5. Walzer \nexplicitly makes reference to Geertz and to his notion of thick description in Thick \nand Thin, p. xi n. 1. The claim that mutual human understanding must be interpretive \nrather than (what is called) naturalistic will be most familiar, to philosophers, from the \nwork of Charles Taylor: see, for instance, ‘Interpretation and the Sciences of Man’ in \nPhilosophy and the Human Sciences: Philosophical papers 2 (Cambridge: Cambridge \nUniversity Press, 1985), pp. 15-57. It is therefore worth noting that Geertz is not as \nsympathetic to Taylor’s work as might, at first glance, be expected: see ‘The Strange \nEstrangement: Charles Taylor and the natural sciences’ in Available Light: \nAnthropological reflections on philosophical topics (Princeton: Princeton University \nPress, 2000), pp. 143-59.\nsupport particularist claims: but, I shall argue, it does not (and, consequently, \nanthropological theory does not support the particularist theories I am using Walzer to \nexemplify).\nGeertz is importantly a deflator of the pretensions of scientific anthropology. \nIt had been believed that one could (for instance) travel from England to the Sudan, \ndescribe the social form of the Nuer as a ‘segmentary lineage’, and thereby \nunderstand the Nuer themselves (this is of course a pastiche, but it will do to make the \npoint). The understanding gained would help one to predict Nuer behaviour, to bring \nthem under ‘rational’ adminstration as part of an empire, and to place and explain \nthem in a wider taxonomy of human social forms and their historical development (as \n‘primitive’, as an acephalous tribe, as operating a certain kind of kinship system). \nGeertz argues that, on the contrary, understanding the Nuer or anyone else is an \nintensely difficult and never complete process of interpretation. Encounters with \nothers are attempts at reading: ‘Doing ethnography is like trying to read (in the sense \nof “construct a reading of”) a manuscript – foreign, faded, full of elipses, \nincoherencies, suspicious emendations, and tendentious commentaries.’31 What one \nreads or interprets is always already an interpretation. There is no bedrock of \nuninterpreted data: the ethnographer is always ‘explicating explications’32.\nTwo things have lent themselves to misinterpretation of this argument. The \nfirst is that Geertz’s examples are all, unsurprisingly, from ethnographic fieldwork. \nHe describes, for instance, a complex ‘confusion of tongues’ between Jewish, Berber \nand French ‘frames of interpretation’ in Morocco, in 1912 (as reported to him in \n1968)33. This may give rise to the thought – in my view, has given rise to it – that \nthere is something especially difficult about going abroad and attempting to \nunderstand them, or in attempting to translate between Jewish, Berber and French \nself-understandings, but that no such difficulty applies when we are at home, or when \nJews, Berbers or French people talk amongst themselves. The second thing which \nlends itself to misunderstanding is Geertz’s emphasis on the incompleteness of \ninterpretation. There is no final reading of culture, only an ongoing process of \nrereading, of attempting to reunderstand what is already understood. This may give \n                                                \n31 Geertz, ‘Thick Description’, p. 10.\n32 Ibid., p. 9.\n33 Ibid.\nrise to the thought that interpretation (when abroad) cannot be done at all, because it \ncannot be finished34.\nNeither of these thoughts seems to me to do justice to what Geertz says. \nGeertz is importantly influenced by the later Wittgenstein35, and his method is best \nunderstood as an application and development of Wittgenstein’s approach to \nlanguage. Culture, like language, is public, and understanding it does not consist in \ndiscovering its logical form or subsuming it under a concept (‘segmentary lineage’). It \nconsists in learning to go on in the right way. So, ‘finding our feet’ in someone’s \nculture is a matter of ‘seeking, in the widened sense of the term in which it \nencompasses very much more than talk, to converse with them, a matter a great deal \nmore difficult, and not only with strangers, than is commonly recognised’36. Geertz’s \npoint is not that there is something fundamentally problematic about conversing when \nabroad, but that there is something mysterious about conversing at all. Nonetheless, \nwe do manage to converse. ‘The famous anthropological absorption with the (to us) \nexotic [is] essentially a device for displacing the dulling sense of familiarity with \nwhich the mysteriousness of our own ability to relate perceptively to one another is \nconcealed from us.’37\nSo: Geertz’s point is not that, when we venture abroad, we leave behind a \npeople and a culture which we understand, and encounter a people and a culture \nwhich is and must remain wholly opaque to us. It is that our interpretations of one \nanother are always tentative and ongoing, wherever we are: ‘Foreignness does not \n                                                \n34 We might be reminded of the David Lodge character who plans ‘a series of \ncommentaries on Jane Austen which would work through the whole canon, one novel \nat a time, saying absolutely everything that could possibly be said about them. The \nidea was to be utterly exhaustive, to examine the novels from every conveivable \nangle, historical, biographical, rhetorical, mythical, Freudian, Jungian, existentialist, \nMarxist, structuralist, Christian-allegorical, ethical, exponential, linguistic, \nphenomenological, archetypal, you name it; so that when each commentary was \nwritten there would be simply nothing further to say about the novel in question.’ –\nChanging Places (London: Penguin, 1975), p. 44.\n35 See ‘Passage and Accident: A life of learning’ in Available Light, pp. 3-20. For \nconsideration of the application of Wittgenstein to the human sciences, see for \ninstance Peter Winch, The Idea of a Social Science and its Relation to Philosophy\n(London: Routledge, 1958); David Bloor, Wittgenstein: A social theory of knowledge\n(London: Macmillan, 1983).\n36 Geertz, ‘Thick Description’, p. 13, my emphasis.\n37 Ibid., p. 14.\nstart at the water’s edge but at the skin’s… The wogs begin long before Calais.’38 The \nanthropological exotic (apart from its intrinsic interest) is a way of bringing home to \nourselves both the difficulty and the surprising possibility of mutual understanding. \nGeertz’s interpretive anthropology, far from supporting the Walzerian claim that \nunderstanding and critique cannot leave home, emphasises the fact that, necessarily,\nwe continuously cross our own boundaries, encounter strangers, and half-successfully \nengage with them.\nEpistemic colonialism\nI have already pastiched one kind of anthropology, which attempts to understand \nothers by discovering the logical form of their culture, or by subsuming it under  \nabstract concepts. This kind of anthropology certainly was involved in colonial \nprojects: E. E. Evans-Pritchard’s pioneering work with the Nuer39, for instance, was \ninvolved with British colonialism. When Evans-Pritchard lived with and studied them \nin the 1930s, the Nuer were a group of perhaps two or three hundred thousand people \nliving around the Nile, in what was then the Anglo-Egyptian Sudan, in East Africa. At \nthat time, they were having to deal rapidly with invasion by British military forces \nand the consequent imposition of new administrative and political institutions, \nincluding, for instance, a colonial governor who argued that the Nuer ‘are slow to \nappreciate the blessings of European civilization and the benefits arising from an \nordered administration of their country. Although this outspoken self-consciousness \nwas bound to lead to conflicts, it must be admitted that the personal qualities of the \npeople that caused these conflicts are of a kind that ought to be cultivated and guided \nrather than blamed and suppressed.’40 Evans-Pritchard ‘was profoundly aware of “the \ncolonial encounter” and was, in fact, part of it’41, having been commissioned by the \n                                                \n38 Geertz, ‘The Uses of Diversity’ in Available Light, pp. 68-88. p. 76.\n39 Evans-Pritchard, The Nuer: A description of the modes of livelihood and political \ninstitutions of a Nilotic people (Oxford: Clarendon Press, 1940); ‘The Nuer of the \nSouthern Sudan’ in Meyer Fortes & Evans-Pritchard (eds.), African Political Systems\n(London: Oxford University Press, 1940), pp. 272-96; Kinship and Marriage Among \nthe Nuer (Oxford: Clarendon Press, 1951); Nuer Religion (Oxford: Clarendon Press, \n1956). On the vast literature sparked by Evans-Pritchard’s work, see Sharon E. \nHutchinson, Nuer Dilemmas: Coping with money, war, and the state (Berkeley: \nUniversity of California Press, 1996).\n40 Diedrich Westermann, Introduction to Ray Huffman, Nuer Customs and Folk-Lore\n(London: Frank Cass & Co., 1970; first published 1931), pp. v-xi. p. v.\n41 Hutchinson, Nuer Dilemmas, p. 30.\ncolonial government in the Sudan to investigate the Nuer. We should be wary of \nascribing crudely colonial motives to him personally, but should be aware that at least \npart of the point of his investigations was to render the Nuer transparent to \nbureaucratic surveillance and thereby take them under imperial state control.\nSo, one sort of attempt to understand others – the Nuer, in this case – is clearly \nrelated to one sort of colonial project. The two are also analogous, at least in that both \nare one-sided and probably self-interested (they involve the imposition of structures \nof understanding or control by one side on the other, apparently for purposes of \nexploitation). Perhaps the thinking which leads to positions like Walzer’s is this: \n(attempted) understanding of other cultures was part of morally disastrous colonial \nprojects; we should never have undertaken such projects (we should have stayed at \nhome); critiques of this kind of understanding (such as Geertz’s) are therefore \ncritiques of ‘going abroad’ in understanding, and of the consequent attempt to criticise \nand transform local arrangements in terms of the putative ‘blessings of European \ncivilization’. However, as I argued above, this misunderstands Geertz’s critique. We \ncan certainly reject attempts to impose our own social arrangements on others, \nespecially when doing so requires violence and oppression, but we are unwise to do \nso in terms of a rejection of the possibility of understanding strangers sufficiently that \nwe could share goods with them. Not all transcultural understanding takes that form; \nif Geertz is right, no genuine understanding of humans could take it, for reasons \nanalogous to Wittgenstein’s reasons for denying the possibility of private language \n(although we should note that rendering local, opaque systems of punishment, land \ntenure and measurement transparent to bureaucratic surveillance has historically been \nan effective method of control, and therefore that something is apparently being \nunderstood in such cases42).\nConclusion: the ethics of engagement with strangers\nI began by setting out a view about the possibility of transcultural understanding and \ncriticism, using Michael Walzer’s Spheres of Justice as a exemplar. I have shown that \nit depends on an untenable account of the nature of human society, and therefore that \nit ought to be abandoned. I then went on to consider the relations between this view \nand Clifford Geertz’s influential account of the interpretation of culture, and \n                                                \n42 See James C. Scott, Seeing Like a State: How certain schemes to improve the \nhuman condition have failed (New Haven: Yale University Press, 1998).\ndistinguished two putative kinds of understanding, only the first of which seems \nlinked or analogous to colonial projects. Where does this leave us in relation to the \nworry I raised at the start of this paper, that there is something immoral about \nunderstanding others in our own terms? I suggest that it leaves us with the (obvious?) \nthought that it depends very much on what we mean by ‘understanding’. There is a \nsort of (attempted) understanding of others, which is exemplified by the colonial \npractice of investigation for purposes of surveillance and exploitation, and which is, at \nbest, morally tainted by its association with oppression. However, there is another sort \nof understanding, exemplified by the interpretive practice urged by Geertz, on which \nthe process of coming to converse with strangers is difficult, never finished, and vital. \nThis does not seem morally problematic: indeed, it seems to me to be morally \nrequired. It is certainly pragmatically required, given that meeting strangers is not \nsomething we can avoid.\nThis second kind of understanding does not involve (merely) imposing our \nown categories on others who have different understandings of themselves: it involves \n‘finding our feet’ with others. That is, it involves being able to go on in a practice (or \naccording to the rules of some game) which has become shared. Peter Winch has \nargued that ‘Seriously to study another way of life is necessarily to seek to extend our \nown – not simply to bring the other way within the already existing boundaries of our \nown.’43 I claim that seriously to attempt to understand another person is to change \noneself, because the actual world does not consist of discrete societies or cultures \nwhich meet and clash at their boundaries. It consists (in part) of social and variously \ncultured individual humans who must unendingly interpret one another. This process \nis not (cannot be) one-sided. Mutual criticism, including self-criticism, must \nsometimes be a part of meeting and interpreting strangers, and part of the importance \nof the shock of the different which anthopological data provides is that it is also an \nethical shock. Our encounters with strangers who need not remain strangers can \nremind us of the basic ethical truth44 that our ways are not inevitable, and could be \nmistaken. That possibility is an important basis for (moral, social, political) criticism, \n                                                \n43 ‘Understanding a Primitive Society’ in Bryan R. Wilson ed., Rationality (Oxford: \nBasil Blackwell, 1970), pp. 78-111. p. 99.\n44 I have not intended to assert any meta-ethical theory. If anyone is troubled by the \nphrase ‘basic ethical truth’, she should substitute ‘good advice’.\nand we would be ill-advised in practice, as well as mistaken in theory, to rule it out of \ncourt as not part of ‘our’ shared meanings.\nThe central point I have made against particularism, as exemplified by Walzer, \nis that we can get to a kind of universalism about justice without assuming the \npossibility of a view from nowhere. The facts of human sociability mean that \nunderstanding can start from where we are, and have no need to stop at community \nboundaries. That is, the conditions of possibility of the shared meanings to which \nWalzer appeals have anti-particularist consequences. The point of later sections has \nbeen to argue that we are not faced with a choice between, on one hand, staying at \nhome and leaving other cultures alone in their incomprehensible (to us) shared \nmeanings; and, on the other, becoming imperialists. The third, morally and practically \nvital option is engagement with strangers, and it need not stop at any impermeable \ncultural boundary, because there are no such boundaries.\nA final recap: I have argued that, even if we accept a great deal of the\ninterpretive approach to philosophical, anthropological and other human science \npractice in general, and Walzer’s derivation of justice from the social meaning of \ngoods in particular, we can nonetheless resist Walzer’s anti-universalism. Even if \njustice must come from shared meaning, this does not entail that no transcultural \ncriticism in the name of justice is possible, because the conditions of possibility of \nshared meaning – the facts of human sociability – make discrete, mutually-\nincomprehensible cultures impossible. This leaves us with the difficult problem of \ncoming to understand those who are currently strangers to us, rather than the \ncongenial certainty of shared understanding at home; but it also defends the vital \npossibility of transcultural criticism.\n"}