{"doi":"10.2167\/jht056.0","coreId":"101703","oai":"oai:epubs.surrey.ac.uk:1133","identifiers":["oai:epubs.surrey.ac.uk:1133","10.2167\/jht056.0"],"title":"World heritage: exploring the tension between the universal and the national","authors":["Chambers, DP","Rakic, T"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"The complex issues of conservation, politics, tourism management and ownership have emerged as critical issues within the World Heritage debate and specifically within heritage tourism research. Within this context, this paper focuses on issues of ownership and belonging and argues that there exists a link between the conceptual inconsistencies inherent in the World Heritage idea and the tensions between the national and the 'universal' evident at a number of World Heritage Sites. That is, heritage sites that are deemed to be of 'outstanding universal value' and are bestowed with the World Heritage accolade are consequently no longer expected to be perceived as symbols of particular national identities, but as heritage belonging to all humankind. This, of course, provokes a series of debates over the issues of ownership and belonging of such heritage, namely between the national and the 'universal' suggesting that it is possible to perceive World Heritage as synonymous with contested heritage. The paper explores these issues of ownership and focuses on the Acropolis, symbol of the World Heritage idea, as a case study utilising an exploratory semiotic analysis of the promotional material released by the Greek National Tourism Organisation over the last five years","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1133<\/identifier><datestamp>\n      2017-10-31T14:00:46Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:746F757269736D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1133\/<\/dc:relation><dc:title>\n        World heritage: exploring the tension between the universal and the national<\/dc:title><dc:creator>\n        Chambers, DP<\/dc:creator><dc:creator>\n        Rakic, T<\/dc:creator><dc:description>\n        The complex issues of conservation, politics, tourism management and ownership have emerged as critical issues within the World Heritage debate and specifically within heritage tourism research. Within this context, this paper focuses on issues of ownership and belonging and argues that there exists a link between the conceptual inconsistencies inherent in the World Heritage idea and the tensions between the national and the 'universal' evident at a number of World Heritage Sites. That is, heritage sites that are deemed to be of 'outstanding universal value' and are bestowed with the World Heritage accolade are consequently no longer expected to be perceived as symbols of particular national identities, but as heritage belonging to all humankind. This, of course, provokes a series of debates over the issues of ownership and belonging of such heritage, namely between the national and the 'universal' suggesting that it is possible to perceive World Heritage as synonymous with contested heritage. The paper explores these issues of ownership and focuses on the Acropolis, symbol of the World Heritage idea, as a case study utilising an exploratory semiotic analysis of the promotional material released by the Greek National Tourism Organisation over the last five years.<\/dc:description><dc:date>\n        2007<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1133\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Chambers, DP and Rakic, T  (2007) World heritage: exploring the tension between the universal and the national   Journal of Heritage Tourism, 2 (3).  pp. 145-155.      <\/dc:identifier><dc:relation>\n        10.2167\/jht056.0<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1133\/","10.2167\/jht056.0"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" 1 \nWorld Heritage: exploring the tension between the national and the \n‘universal’  \n \n \nTijana Rakic \n Donna Chambers \nNapier University \n \n \nContact author: Tijana Rakic, tijana224@gmail.com \n \n \nPostal addresses: Ms Tijana Rakic, School of Marketing, Tourism and Languages, \nNapier University, Craiglockhart Campus, 219 Colinton Road, EH14 1DJ, Edinburgh, \nUK; Dr Donna Chambers, School of Marketing, Tourism and Languages, Napier \nUniversity, Craiglockhart Campus, 219 Colinton Road, EH14 1DJ, Edinburgh, UK \n \n \n \nAbstract: \nThe complex issues of conservation, politics, tourism management and ownership have \nemerged as critical issues within the World Heritage debate and specifically within \nheritage tourism research.  Within this context, this article focuses on issues of ownership \nand belonging and argues that there exists a link between the conceptual inconsistencies \ninherent in the World Heritage idea and the tensions between the national and the \n‘universal’ evident at a number of World Heritage Sites. That is, heritage sites which are \ndeemed to be of ‘outstanding universal value’ and are bestowed with the World Heritage \naccolade are consequently no longer expected to be perceived as symbols of particular \nnational identities, but as heritage belonging to all humankind.  This, of course, provokes \na series of debates over the issues of ownership and belonging of such heritage, namely \nbetween the national and the ‘universal’ suggesting that it is possible to perceive World \nHeritage as synonymous with contested heritage. The paper explores these issues of \nownership and focuses on the Acropolis, symbol of the World Heritage idea (UNESCO, \n2006d) as a case study utilising an exploratory semiotic analysis of the promotional \nmaterial released by the Greek National Tourism Organisation over the last five years. \n \n \nKeywords: World Heritage, tourism, Acropolis, ownership, semiotics  \n \n \n 2 \nIntroduction \nWorld Heritage has recently become one of the major topics within heritage tourism \nresearch and this is so whether this research is dealing with tourism management and \nmarketing issues (i.e. Hall and Piggin, 2003; Leask and Fyall, 2006; Shackley, 2001), is \nexploring policy and conservation issues (i.e. Harrison and Hitchock, 2005; Kavoura, \n2001; Rakic and Leask, 2006; van der Aa, 2005) or is dealing with tourists’ understanding \nof the significance of the World Heritage Site status (i.e. Moscardo et al, 2001; Smith, \n2002). The reason for this growth in scholarly research is that World Heritage Site status \nhas become a ‘highly appreciated accolade’ (Smith, 2002:137) in the tourism world and \nhas also emerged as one of the major promotional tools for site managers (Hall and \nPiggin, 2003; Rakic and Leask, 2006; van der Aa, 2006). Indeed, this is of such \nimportance to the tourism industry that marketing strategy commentators are now \nspeaking of ‘the future markets for World Heritage Sites’ (Fyall and Rakic, 2006).  \n \nThe World Heritage Convention was adopted by UNESCO in 1972 and became effective \non 17 December 1975. Since then, States Parties, as  signatories to the Convention, are \nobliged to identify, protect and preserve heritage of ‘outstanding universal value’ \n(UNESCO, 2006b). Currently, the prestigious World Heritage List includes 812 heritage \nsites (UNESCO, 2006d).  Importantly, the World Heritage idea, the idea of creating an \ninternational movement for the protection of heritage was in fact born just after the First \nWorld War (UNESCO, 2006a) and was underpinned by modernistic values.  Fifty years \nlater it was being used as a tool for the conservation of heritage sites of ‘outstanding \nuniversal value’ (UNESCO, 2006b), although today, in what can be described as a \npostmodern tourism industry, World Heritage Site status is being used as an accreditation \nscheme for heritage tourism attractions. \n \nSince its creation and irrespective of a number of problematics that emerged, the List \nmanaged to achieve significant global success and World Heritage Site status is now \nperceived as a prestigious acknowledgement of the quality and uniqueness of heritage \nsites.  In addition, both the List and the World Heritage Site status became a reference \npoint for the cultural\/heritage tourist, an equivalent of a constantly updated list of \n‘authentic’ heritage sites worth visiting.  For their part, countries or States Parties to the \n 3 \nConvention, are competing to get sites listed (Rakic, 2005).  Indeed, World Heritage Site \nstatus has become a measure of quality assurance, a trademark and an ‘authenticity stamp’ \nfor the heritage tourist and an arena for the presentation of prestigious national heritage, \nintegral to the nation building projects of States Parties. In this sense the concept of World \nHeritage has drifted away from its original intention. That is, having begun as a system of \nidentifying, protecting and preserving heritage of ‘outstanding universal value’, which \nrepresent and belong to all humankind, it has essentially become an accreditation scheme \nfor heritage sites, used either to serve the purposes of the tourism industry or for the \npurposes of nation building.    \n \nAs indicated, the original idea of World Heritage, born just after the First World War, had \na particular emphasis on the modernistic notions of heritage as having universality and \nuniversal values which required protection and conservation for the benefit of future \ngenerations of humankind. Since the adoption of the Convention in 1972 until today, in an \nera many would define as postmodern, the World Heritage concept has been celebrated, \nhonoured and used for the purposes of not only conservation but also tourism. \nImportantly, it was in this period that its marketing potential was discovered by the \ntourism industry and the concept of World Heritage has consequently become more \nimportant for the purposes of tourism promotion than conservation. World Heritage Sites, \nalong with other heritage sites, are increasingly being commercialised, commodified and \nused for postmodern forms of leisure (Harvey, 2001) such as heritage and cultural tourism \n(Hannabuss, 1999).  \n \nUsing the Acropolis, a World Heritage Site and a symbol of the World Heritage idea \n(UNESCO, 2006d) as a case study, this paper argues that it is not only the widespread \ncommercialisation through tourism that has caused the original idea of World Heritage to \ndrift away from its original intention, but also the conceptual inconsistencies that are \ninherent in the very idea of World Heritage.  \n \nThe World Heritage Concept: tensions between the national and the ‘universal’  \nThe concept of World Heritage is based on the idea of ‘outstanding universal value’ where \nsites are perceived as symbols of the ‘common identity of humankind.’  Not only is this \n 4 \ninherently paradoxical, but the idea ignores the strong link between heritage and national \nidentity. That is, the concept of heritage, similar to the concept of nation, is a modern \nconstruct and as such strongly linked with the project of nation building (Chambers, 2005; \nGraham, 2002; Hewison, 1987; Walsh, 1999).  This indicates that all heritage is \nessentially about the construction of particular localised identities rather than ‘universal \nidentities’ (i.e. identities shared by humankind). It is in this sense that the World Heritage \nidea carries a conceptual inconsistency which has arguably resulted in the tensions \nbetween the national and the ‘universal’ at a number of World Heritage Sites. \n \nSeveral previous studies have examined these particular tensions, some in a broad context \nand others in a more site specific sense. Ashworth (1997:12) in his essay titled “Is there a \nWorld Heritage?” discusses ‘the need to believe in the existence of World Heritage as the \ncommon property of all humankind’.   However, later on in the same work he claims that \n‘if all heritage by being someone’s, must disinherit someone else, then a world heritage is \nnot a happy summation of local and national heritage, but rather a denial of them’. He \nthen goes on to discuss how these problems extend to the questions of ownership, \nspecifically in the context of whether World Heritage is seen as nationally or \necumenically owned. Although mentioning that UNESCO is actually reinforcing the \nsuperiority of national ownership of World Heritage Sites, Ashworth nevertheless argues \nthat until ownership of these sites is ‘collectivised on a world scale, rather than \nnationalised or localised, then [World] heritage will be more a cause of national and local \nconflict that of global reconciliation’ (ibid: 12.). In other words, Ashworth (1997) \nquestions the very existence of World Heritage as it was intended by UNESCO in 1972 \nwhen the World Heritage Convention was adopted.    \n \nFurther verifying the arguments raised by Ashworth in 1997 is the commentary of \nAshworth and van der Aa in 2002 surrounding the destruction of the Buddhist statues at \nBayman, Afghanistan by the Taliban, where they claim that ‘the idea of world heritage, \nand its manifestation in international tourism, may conflict with heritage used for local \nand national purposes’ (ibid: 447). Indeed, as noted by Ashworth and van der Aa (2002), \nalthough UNESCO promotes the existence and the need for humanity to have a ‘World’ \n[category of] heritage, where such heritage is promoted as ‘belonging’ to all humankind, \n 5 \nUNESCO itself seems to hold a contradictory position with a number of its policies \nfavouring the rights of national ownership. World Heritage can thus be seen as \nsynonymous to ‘contested heritage’, with a great number of interested parties ranging \nfrom local, regional, national and international stakeholders exercising conflicting claims \nand rights of ownership, use and interpretation over a single heritage site.     \n \nHowever, there are a number of claims that heritage can exist on several levels and have \nmultiple roles. Timothy (1997) argued that heritage tourism attractions and experiences \nexist on personal, local, national and world levels. It seems that it is not only members of \nthe tourism academia or UNESCO that share this opinion, but also professional \narchaeologists and physical anthropologists, who in Skeates’s (2000: 20) view ‘accept the \noverlapping concepts of national and universal ownership [of UNESCO’s World \nHeritage]’. \n \nSimilar contradictions stemming from the conceptual inconsistencies of the World \nHeritage idea seem to be reflected in the marketing world where some States Parties \nadvertise their World Heritage Sites and emphasise their status (i.e. Spain with its 2006 \n“Smile you are in Spain” campaign (Spanish Tourist Office, 2006) promoting its World \nHeritage cities) while others choose to promote their sites but fail to ever mention their \nWorld Heritage Site status (i.e. the promotional material released by the Greek National \nTourism Organisation over the last 5 years).  \n \nMethodology \nIn order to explicate the issues surrounding the  national versus ‘universal’ debate in \nWorld Heritage, this paper examined the case study of the Acropolis in Athens, Greece, \nsince the Acropolis is said to be the symbol of the World Heritage idea (UNESCO, 2006d) \nand at the same time is seen as a key symbol of Greekness (Yalouri, 2001). In order to do \nso, the paper will first review the existing literature on the Acropolis which discusses \nsome of the national versus ‘universal’ debate and will then focus on the findings of an \nexploratory semiotic analysis of official representations of the Acropolis within the \npromotional texts and images released by the Greek National Tourism Organisation \n(GNTO) over the last five years. This will provide a brief insight into the extent to which \n 6 \nthe tensions between the national and the ‘universal’ are manifested within official \nrepresentations of the Acropolis, one of the key World Heritage Sites. \n \nSemiotics, or the [modern] study of signs which seeks to uncover the ‘system of signs’ \nand the ‘deep structure’ of meaning, was founded by the linguist Ferdinand du Saussure \n(1857-1913) and the philosopher Charles Sanders Peirce (1839-1914) (Echtner, 1999: 47). \nDespite the fact that the two founders, Saussure and Peirce, had significantly different \napproaches due to their background, semiotics has developed as a single approach \nconstituted of various methods of analysis. Much of the later work in semiotics, \nparticularly in literary theory and philosophy, was done by Roland Barthes (see for \nexample Barthes 1977; 1988; and 1993). However, further influential contributions were \nalso made by Charles W. Morris, Claude Lévi-Strauss, Julia Kristeva, Umberto Eco, Jean \nBaudrillard and others. In tourism studies, the semiotic approach has been utilised to \naddress various research questions in a number of studies.  Namely, following the article \npublished by Culler in 1981 which looked at tourism and semiotics, Uzzell (1984) used \nsemiotics in his analysis of tourism marketing, Cohen (1989) in his analysis of the hill \ntribe trekking promotional material in Northern Thailand and Bhattacharyya (1997) in her \nanalysis of a Lonely Planet guide book to India.  \n \nWith particular reference to the potential methods and modes of utilisation of the semiotic \napproach in tourism research, Echtner (1999) proposes six stages of analysis. She does \nindicate however that these stages are in no way prescriptive as semiotic analysis ‘allows \nconsiderable analytic freedom and creativity in terms of methods and procedures’ (1999: \n55). As such these stages were adapted to fit this particular research question.  First the \ndata set to be analysed was identified and collected, namely the promotional material \nreleased by the Greek National Tourism Organisation for the years 2002, 2003, 2004, \n2005 and 2006. Second, specific units such as the promotional material containing \nreference to the Acropolis were selected for analysis. Third, the consistency of occurrence \nof certain elements such as phrases or images which pointed to the tensions between the \nnational and the ‘universal’ were identified.  Finally, underlying or ‘deep’ meanings were \nextracted and debated.  \n \n 7 \nThe Athenian Acropolis: whom does it belong to? \nTo whom the Athenian Acropolis belongs, whom it represents and whose identity it \nsymbolises is a discussion dating back to 1802 when Lord Elgin, the then British \nambassador to the declining Ottoman Empire, had removed twelve statues from the \npediments, fifty six slabs and fifteen metopes from the frieze of the Parthenon \n(Kondaratos, 1994; Hitchens 1997) and transported them to Britain.  In 1816 he sold \nthem to the British Museum in London where they still remain. This event not only \nprovoked a series of discussions over the ownership of the Parthenon Marbles, also \nknown as ‘Elgin Marbles’, but has resulted in fierce international political and legal \nbattles (see Hellenic Ministry of Culture, 2000; The British Museum, 2006a; 2006b; \n2006c; 2006d; Hitchens, 1997; The British Committee for the Restitution of Parthenon \nMarbles, 2002).  \n \nHowever, the rise of the Acropolis as both the key symbol of Greek national identity and \na monument of ‘universal’ significance was a gradual process. Despite the growth of \nhumanistic studies in the 15th and the 16th century, the Acropolis, the sacred rock of \nAthens and the physical remains of Greek antiquity seem to have been of little \nimportance to European scholars at the time (Athanassopoulou, 2001). Nonetheless, that \nwas soon to change. According to Travlou (2001: 44-45), the first travellers to Greece in \nthe 16th and the 17th century were mainly ‘English and French botanists, amateur \narchaeologists, or merchants’, in the 17th and the early 18th century there was a growth of \nvisiting ‘scholars, poets, members of the Society of the Dilettanti and young aristocrats \nin their Grand Tour’ while the 19th century saw ‘the most influential of all travellers’, \nvisiting Greece, namely writers such as ‘Lord Byron, Shelley, Chateaubriand, Flaubert \nand Lamartine’.  \n \nWhile the Ottoman Empire was in its decline, the fame of the Acropolis was spreading \nin Europe. This was partly due to the Parthenon (or ‘Elgin’) Marbles being exhibited in \nBritain provoking the increasing interest of scholars into the physical remains of Ancient \nGreece, and partly due to the fact that many travellers to Athens were classically \neducated, which ‘heightened their sense of the Acropolis as a holy place’ (Leontis, 1995: \n42). One of the most commonly quoted travellers to Athens, Lord Byron a British \n 8 \nPhilhellene, who was actively propagating the ‘Greek cause’ wrote a poem in 1812 titled \nChilde Harold’s Pilgrimage, which was to become one of the most popular poems at the \ntime and which helped establish the Parthenon as a symbol of Greek National Identity \n(Skeates, 2000). \n \nThe rise of the Acropolis as a ‘dual’ symbol, of both Greekness and the Western world, \nwas greatly influenced by Philhellenism, Classical Scholarship and the travellers to \nGreece. During the process of the making of the Modern Greek state, the Acropolis \nbecame the ultimate symbol of Greekness now perceived as the embodiment of the \nGreek nation (Yalouri, 2001). However, once the Greek state adopted the World \nHeritage Convention in 1981, the Acropolis, the cradle of democracy, was one of the \nfirst Greek heritage sites to be listed on the World Heritage List. Although it was with \nthis act that its ‘universal’ significance and belonging was recognised not only by the \nGreek State but also by UNESCO, this did not result in international reconciliation over \nthe issue of the legal ownership of the Parthenon Marbles or in recognition that the \nAcropolis ‘belongs’ both to the world and to the Greek nation. Instead, the Acropolis \ncontinues to be a contested heritage site, torn between the national and the ‘universal’.  \n    \nA study by Eleana Yalouri, published in 2001 which examined the significance of the \nAcropolis as a symbol of Greek national identity found that the Acropolis, a World \nHeritage Site is, similar to the Greek flag, a key concept of the Greek nation over which \ncontestations about national ownership are constantly emerging. In looking at these dual \nownership claims, the ‘global’ and the ‘local’, Yalouri states that: \n“…the Athenian Acropolis, ‘the corner stone of the Classical Greek era’, in becoming a \n‘world monument’ also became the national monument of Greece par excellence. The \nquestion is how these two local\/national and global meanings of the same monument can \nco-exist and interrelate and how Greeks cope with this double-faceted aspect of their \nheritage, especially in an era which on the one hand promotes the idea of global \ncommunity and on the other encourages national difference.”   \n    (Yalouri, 2001:8)   \n \nAnother study, undertaken by Androniki Kavoura (2001) which investigated the state \npolicy for the presentation of Greek National Heritage focused in particular at the cultural \nWorld Heritage Sites. Kavoura interestingly found that the two Greek governmental \nbodies, the Greek Archaeological Council and the Greek Ministry of Culture, which are \n 9 \nalso the bodies determining sites to be nominated for inclusion on the World Heritage \nList, perceive the List as an arena for the promotion of Greek national identity represented \nthrough a selection of Classical and Byzantine sites, rather than a representation of sites of \n‘outstanding universal value’ located in Greece. Thus, perceiving the World Heritage \nSites belonging to the nation rather that the world. \n \nThis point is supported in the exploratory semiotic analysis of the representations of the \nAcropolis within the promotional material of the GNTO over the last five years (2002-\n2006).  Specifically, within the current GNTO website (2006) although the Acropolis is \nfeatured as the most dominant image, its World Heritage Site status fails to be mentioned, \nas is the case with the remainder of the promotional material. By constantly omitting to \nmention the World Heritage Status of the Acropolis in their promotional material, the \nGNTO, accidentally or intentionally, presents the Acropolis as belonging to the Greek \nnation, exhibited both for the Greek and foreign visitors.     \n \nFor example the 2005 Athens and Attica guide states:  \n \nThe Acropolis is the symbol of Athens, the sacred rock, linking the fabulous ancient \ncivilisation with the modern city. The monuments on the Sacred Rock date back to the \nprehistoric era and antiquity. The grandeur and the beauty of the Sacred Rock attract both \nGreek and foreign visitors.  \n (GNTO, 2005) \n \nWhen this text is examined carefully, it is possible to see that the reader is told that the \nAcropolis is the symbol of Athens, meaning that it represents the Athenians in particular \nand the Greeks in general. In other words the Acropolis is a signifier of Athenian and \nGreek identity (the signified).  Its ‘universal’ or global significance as the cradle of \ndemocracy as well as its World Heritage Site Status are omitted. Occluding such \nimportant details about the Acropolis suggests that the Acropolis is above all a symbol of \nAthenian and Greek identity rather than having a universal application.  Further on, the \nreader is told that the Acropolis is a sacred rock, but what the reader is not explicitly told \nis whose sacred rock it is. However, as this statement comes right after the text which \nestablishes the fact that the Acropolis is the symbol of Athens it inclines the reader to \nbelieve that the Acropolis is a sacred rock primarily for the Athenians and, by extension, \nfor the Greeks.  Indeed the use of the word sacred adds a religious or spiritual dimension \n 10 \nto the Acropolis which means sacrosanct or something beyond human understanding and \nquestioning, while the use of the word rock connotes stability.  So that, for the Athenians \nand for the Greeks, the Acropolis is represented in this text as an unquestionable and \nimmutable component of their national identity.  The rest of the world is not referred to \nuntil the part in the text which states that the monument’s beauty and grandeur attract \n‘both Greek and foreign visitors’. An interpretation of this section of the text is that the \nAcropolis attracts both the Greek and the foreign visitors, where for all of them it is a \n‘unique experience’: It is unique for the foreign visitors who can admire the grandeur of \nthe monument and it is unique for the Greeks for whom not only is it grand, but also \nsacred, and a visit would be akin to a pilgrimage. The Acropolis thus signifies different \nthings to different people and it cannot therefore have a universal meaning.    \n \nIn the promotional campaign for the years 2002 and 2003, GNTO used the concept of  \n‘Greek roots’ in a linguistic sense where the theme of this campaign was dominated by \ninternational words of Greek origin such as antithesis, architecture, athletic, echo, energy, \nepic, Eros, euphoria, gastronomy, gymnasium, horizon, logic, magnetism, mathematics, \nphenomenon, symposium, tactics and theatre. The Acropolis is depicted under the word \n‘Architecture’, and here the text states: \n \nArchitecture. Word of Greek Origin. It connects science and art. Greece owns more \nshining architectural points of glance than any other European country. Simply come \nand discover these!      \n                                                                  (GNTO, 2002: translated from German, italics added) \n \nThis is an explicit reference to the fact that the Acropolis is owned by Greece and thus not \nby the world, again highlighting its national rather than universal context and ownership. \n \nIn the years 2005 and 2006, within the campaign ‘live your myth in Greece’ (GNTO, \n2006) and its print advertisements, the Acropolis, or to be more precise the Parthenon, \nappears as a subliminal image, depicting a dream like state and the ‘mythical’ experience \nof Greece and its ancient world through a visit to Greece and the Acropolis. In the videos \nreleased under the same campaign, the image of either the Acropolis or the Parthenon \nappears regularly and although not a subliminal image anymore, the Acropolis is still \ndepicted as a dream like, mythical place. For example in the video ‘history’ released in \n 11 \n2005, Elena Paparizou (2005 Eurovision Song Contest Winner) takes her viewers on a \ntour of Greece and says:  \n…Welcome to a land of mythical dimensions and great sightseeing. Welcome to \nGreece…[followed by a postcard like video slide show where the Acropolis features \nfirst]…come to Greece, live your own myth and relive the history of the mythical \ncivilisation…. \n(GNTO, 2006) \n \nWhat is particularly interesting to notice is that although the Acropolis is said to be a \ncontested heritage site torn between its ‘global fame’ and ‘local claim’ (Yalouri, 2001) \nand especially taking into consideration the widely known international legal battle over \nthe ownership of the Parthenon or ‘Elgin’ marbles, these evident tensions between the \nnational and the ‘universal’ are not leaving an obvious mark in the promotional material \nof the GNTO. This absence of an explicit tension in the promotional material might, on \nthe other hand, be perfectly understandable, since an obvious reference to the existing \nconflict between the national and the ‘universal’ in the case of Acropolis could have an \nadverse effect on some of the potential visitors to Greece, who might perceive such \nconflict as politically incorrect. However, what is significant for the discussion in this \npaper is not what is being obviously put forward, but what is omitted by the GNTO in \ntheir promotional material. Indeed, the 2004 promotional campaign, in the light of the \nOlympics which were to be held in Athens that year, focused on ‘records’, such as ‘the \nEuropean record for the widest smile’,  ‘…world record for standing in still amazement’, \n‘fastest time for being transported back to the ancient world’ and ‘all-time European for \nthe most sunshine’ (GNTO, 2004) and despite the reference made to visitors to Greece \n‘being transported back to the ancient world’ by visiting Athens, neither the Acropolis, \nnor its World Heritage Site status were mentioned.  \n \nSeveral questions emerge from this exploratory analysis: Why is it that in the 2004 \nOlympic campaign the Acropolis is not mentioned as a key heritage site and attraction in \nAthens?  Why is it that in the other campaigns, which as noted earlier often use the \nAcropolis in their promotional material, there is a failure to mention the World Heritage \nSite status of this monument? Why is it that within the promotional materials of the \nGNTO the World Heritage Site status of the Acropolis is hinted at only once in a \ndocument of the Ministry of Culture accessible through the GNTO website (GNTO, 2006) \nwhich features a small World Heritage Site symbol recognisable only to those who are \n 12 \nfamiliar with this symbol? Certainly a plausible answer to these questions is that the \nAcropolis, despite its World Heritage Site Status, is perceived by the GNTO, the official \ntourism promotional body of Greece, as belonging to, and representing the Greek nation \nrather than the world.  \n \nConclusion  \nThis study discussed the tension that exists between the national and ‘universal’ within the \nidea of World Heritage and suggested that this tension stems from the conceptual \ninconsistencies inherent in the very idea of World Heritage.   It was argued that this \ntension is manifested at particular World Heritage sites where issues of national versus \n‘universal’ ownership become problematic.  Using the Acropolis as a case study, the \nresearch, through an exploratory semiotic analysis of promotional material published by \nthe GNTO over the last five years, demonstrated that while the Acropolis is a World \nHeritage Site and thus of ‘universal’ value and significance, it is, paradoxically, perceived \nprimarily as a symbol of Greek national identity with little reference to its ‘universal’ \nstatus.     \n \nHowever, the case study does have its limitations.  The first is that in seeking to \ndemonstrate the tensions between the national and the ‘universal’ apparent in the official \nrepresentations of the Acropolis, it focused only on the promotional material released by \nthe GNTO over the last five years. While this does go further than traditional semiotic \nanalyses that tend to be synchronous in nature, an analysis of a longer historical period \nmight have gleaned further insights into this issue.  Second, it did not examine other \nrepresentations of the Acropolis in unofficial tourism publications such as guidebooks \nwhich might have been useful for comparative purposes.  Third, it did not address the \ninterpretant or the interpretation of the Acropolis by local and international visitors to the \nsite.  These limitations also constitute potential areas of further research.   \n \nIn terms of the conceptual inconsistencies of the World Heritage idea, although these have \nbeen explored by the members of the academic community in the past, this remains to be \nan under researched area with more contributions needing to be made in order to shed \nfurther light on what seems to be emerging as a crucial issue within World Heritage \n 13 \nresearch.  Such research would prove vital not only for the academic community, but also \nfor the members of UNESCO, the IUCN and ICOMOS.   Indeed, as the World Heritage \nList and the processes of inscription, conservation and management of these properties \ncontinue to be problematic, further research is needed which would investigate whether \nthese problems result from. commercialisation, tourism, nomination politics and \nconservation, or result from the conceptual inconsistencies in the idea of World Heritage \nmanifested in the tensions between the national and the ‘universal’ evident at a number of \nWorld Heritage Sites, including the Acropolis - ‘the symbol of the world heritage idea’ \n(UNESCO, 2006d).   \n \nReferences  \nAshworth, G. J. (1997) Is there a World Heritage? Urban Age, 4, (4), 12. \n \nAshworth, G. J. and VAN DER AA, B. J. M. (2002) Bayman: Whose Heritage Was It and \nWhat Should We Do About it? Current Issues in Tourism, 5, (5), 447-457. \n \nAthanassopoulou, E. F. (2001) An \"Ancient\" Landscape: European Ideals, Archaeology, \nand Nation Building in Early Modern Greece. Journal of Modern Greek Studies, 20, (2), \n273-305. \n \nBarthes, R. (1993) Mythologies. London: Random House.  \n \nBarthes, R. (1988) The semiotic challenge. New York: Hill and Wang. \n \nBarthes, R. (1977) Elements of Semiology. New York: Hill and Wang.  \n \nBhattacharyya, D. P. (1997) Mediating India: An analysis of a guidebook. Annals of \nTourism Research, 24, (2), 371-389. \nChambers, D. (2005) Heritage and the Nation: an exploration of a discursive relationship. \nTourism Analysis, 9, 241-254. \n \nCuller, J. (1981) Semiotics of Tourism. American Journal of Semiotics, 1, 127-40. \n \nCohen, E. (1989) Primitive and remote: Hill tribe trekking in Thailand. Annals of Tourism \nResearch, 16, (1), 30-61. \n \nEchtner, C. M. (1999) The semiotic paradigm: implications for tourism research. Tourism \nManagement, 20, 47-57. \n \nFyall, A. and Rakic, T. (2006) The Future Market for World Heritage Sites. In A. Leask \nand A. (Eds.) Managing World Heritage Sites. Oxford: Butterworth Heinemann. \n \n 14 \nGNTO (2006), “Greek National Tourism Organisation’s website”. Online documents at \nURL http:\/\/www.gnto.gr\/?langID=2 [15th September 2006]. \n \nGNTO (2005) Athens – Attica: Greece, Athens: Greek National Tourism Organisation.    \n \nGNTO (2004) Campaign 2004: print advertisements. Athens: Greek National Tourism \nOrganisation.    \n \nGNTO (2002) Architecture: print advertisement. Athens: Greek National Tourism \nOrganisation.   \n \nGraham, B. (2002) Heritage as Knowledge: Capital or Culture? Urban Studies, 39, (5-6) \n1003-10017. \n \nHall, C. M. and Piggin, R. (2003) World Heritage Sites: Managing the brand. In A. Fyall, \nB. Garrod and A. Leask (Eds.) Managing Visitor Attractions: New Directions. Oxford: \nButterworth Heinemann. \n \nHannabuss, S. (1999) Postmodernism and the Heritage Experience. Library Management, \n20, (5), 295-302. \n \nHarrison, D. and Hitchock, M. (2005) The Politics of World Heritage: Negotiating \nTourism and Conservation. Clevedon: Channel View Publications. \n \nHarvey, D. C. (2001) Heritage Pasts and Heritage Presents: temporality, meaning and the \nscope of heritage studies. International Journal of Heritage Studies, 7, (4), 319-339. \n \nHellenic Ministry of Culture (2000) Memorandum on the Parthenon Marbles, submitted \nby the Government of Hellenic Republic to the House of Commons Select Committee of \nCulture, Media and Sport. Online documents at URL \nhttp:\/\/www.culture.gr\/6\/68\/682\/memorandum.pdf  [20th August 2006]. \n \nHewison, R. (1987) Heritage Industry. London: Methuen. \n \nHitchens, C. (1997) The Elgin Marbles: should they be returned to Greece? \nLondon:Verso. \n \nKavoura, A. (2001) State policy for the presentation of Greek national heritage: the case \nof the cultural world heritage sites. PhD Thesis. University of Stirling. \n \nKondaratos, S. (1994) The Parthenon as Cultural Ideal. In P. Turnikiotis (Eds) The \nParthenon and its impact in modern times. Athens: Melissa. \n \nLeask, A. and Fyall, A. (2006) Managing World Heritage Sites. Oxford: Butterworth-\nHeinemann. \n \nLeontis, A. (1995) Topographies of Hellenism. New York: Cornell University Press. \n \n 15 \nMoscardo, G. Green, D. and Greenwood, T. (2001) How Great is the Great Barrier Reef! \nTourists's Knowledge and Understanding of the World Heritage Status of the Great \nBarrier reef. Tourism Recreation Research, 26, 19-25. \n. \nRakic, T. (2005) The Future of UNESCO's World Heritage List. Unpublished Thesis, \nNapier University. \n \nRakic, T. and Leask, A. (2006) World Heritage List: historical development, current status \nand future scenarios. Cutting Edge Research in Tourism Conference - New Directions \nChallenges and Applications Conference Proceedings. University of Surrey, 6-9th June. \n \nShackley, M. (2001) Sacred World Heritage Sites: Balancing Meaning With Management. \nTourism Recreation Research, 26, (1), 5-10. \n \nSkeates, R. (2000) Debating the Archaeological Heritage. Eastbourne: Duckworth. \n \nSmith, M. K. (2002) A Critical Evaluation of the Global Accolade: the significance of \nWorld Heritage Site status for Maritime Greenwich. International Journal of Heritage \nStudies, 8, (2), 137-151. \n \nSpanish Tourist Office (2006) “Smile. You are in Spain” Campaign. Online documents at \nURL http:\/\/www.spain.info\/uk\/TourSpain\/Spain%20Marks\/?language=EN  [27th \nSeptember 2006] \n  \nThe British Committee for the restitution of Parthenon Marbles (2002) The Case for \nReturn. Online documents at URL. \nhttp:\/\/www.parthenonuk.com\/the_case_for_the_return.php [14th July 2006]. \n \nThe British Museum (2006a) The Parthenon Sculptures: Facts and Figures. Online \ndocuments at URL. http:\/\/www.thebritishmuseum.ac.uk\/gr\/debate.html [5th April 2006]. \n \nThe British Museum (2006b) Why are the Parthenon Sculptures always in the news? \nOnline documents at URL. \nhttp:\/\/www.thebritishmuseum.ac.uk\/newsroom\/current2003\/parsculpt.htm [19th April \n2006]. \n \nThe British Museum (2006c) The Parthenon and its sculptures. Online documents at URL. \nhttp:\/\/www.thebritishmuseum.ac.uk\/gr\/grparth.html [19th April 2006]. \n \nThe British Museum (2006d) Parthenon: Cleaning the Parthenon Sculptures. Online \ndocuments at URL.http:\/\/www.thebritishmuseum.ac.uk\/gr\/collo.html [19th April 2006]. \n \nTimothy, D. J. (1997) Tourism and the personal heritage experience. Annals of Tourism \nResearch, 24, (3), 751-754. \n \nTravlou, P. S. (2001), Urban Tourism in Athens: Tourist Myths and Images, PhD Thesis. \n \n 16 \nUNESCO (2006a) Brief History of World Heritage. Online documents at URL. \nhttp:\/\/whc.unesco.org\/pg.cfm?cid=169  [9th February 2006]. \n \nUNESCO (2006b) World Heritage Convention text. Online documents at URL. \nhttp:\/\/whc.unesco.org\/pg.cfm?cid=175 [9th February 2006]. \n \nUNESCO (2006d) World Heritage List. Online documents at URL. \nhttp:\/\/whc.unesco.org\/en\/list [9th February 2006].  \n \nUzzel, D. (1984) An alternative structuralist approach to the psychology of tourism \nmarketing. Annals of Tourism Research, 11, 79-99. \n \nvan der Aa, B. J. M. (2005) Preserving the heritage of humanity? Obtaining world \nheritage status and the impacts of listing. Groningen: University Library Groningen. \n \nWalsh, K. (1992) The Representations of the Past: Museums and heritage in the post-\nmodern world. London: Rutledge. \n \nYalouri, E. (2001) The Acropolis: global fame, local claim. Oxford: Berg. \n \n"}