{"doi":"10.1029\/2009JF001306","coreId":"97876","oai":"oai:nora.nerc.ac.uk:13759","identifiers":["oai:nora.nerc.ac.uk:13759","10.1029\/2009JF001306"],"title":"In situ measurements of Antarctic snow compaction compared with predictions of models","authors":["Arthern, Robert J.","Vaughan, David G.","Rankin, Andrew M.","Mulvaney, Robert","Thomas, Elizabeth R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"We describe in situ measurements of the compaction of Antarctic snow. At three different sites in Antarctica, the rate of compaction was measured hourly, over various depth intervals, for up to two years. These measurements show that compaction at each of the sites occurs through slow, viscous deformation of the snowpack, with no significant contribution from sudden collapse of weak layers. The measured rates of compaction at the coldest site exhibit a strong seasonality, consistent with a temperature-dependent sintering mechanism having activation energy of 70 kJ mol(-1). At the two warmer sites, activation energies of 80 and 120 kJ mol(-1) provide slightly better agreement with the observations. Published models of snow compaction underestimate the temperature sensitivity. A good match to our observations is provided by a semi-empirical model, based on rate equations for lattice-diffusion (Nabarro-Herring) creep of material around pores, combined with normal grain growth. This model also provides a theoretical basis for a widely used empirical model of snow compaction. The rate coefficient for lattice-diffusion inferred from our measurements is considerably higher than published values, however, and other creep mechanisms cannot be ruled out","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/97876.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/13759\/1\/jgrf643.pdf","pdfHashValue":"98fff238c453001e006722e1a252d259fcd6d62f","publisher":"American Geophysical Union","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:13759<\/identifier><datestamp>\n      2013-10-02T14:28:47Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533135<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/13759\/<\/dc:relation><dc:title>\n        In situ measurements of Antarctic snow compaction compared with predictions of models<\/dc:title><dc:creator>\n        Arthern, Robert J.<\/dc:creator><dc:creator>\n        Vaughan, David G.<\/dc:creator><dc:creator>\n        Rankin, Andrew M.<\/dc:creator><dc:creator>\n        Mulvaney, Robert<\/dc:creator><dc:creator>\n        Thomas, Elizabeth R.<\/dc:creator><dc:subject>\n        Glaciology<\/dc:subject><dc:description>\n        We describe in situ measurements of the compaction of Antarctic snow. At three different sites in Antarctica, the rate of compaction was measured hourly, over various depth intervals, for up to two years. These measurements show that compaction at each of the sites occurs through slow, viscous deformation of the snowpack, with no significant contribution from sudden collapse of weak layers. The measured rates of compaction at the coldest site exhibit a strong seasonality, consistent with a temperature-dependent sintering mechanism having activation energy of 70 kJ mol(-1). At the two warmer sites, activation energies of 80 and 120 kJ mol(-1) provide slightly better agreement with the observations. Published models of snow compaction underestimate the temperature sensitivity. A good match to our observations is provided by a semi-empirical model, based on rate equations for lattice-diffusion (Nabarro-Herring) creep of material around pores, combined with normal grain growth. This model also provides a theoretical basis for a widely used empirical model of snow compaction. The rate coefficient for lattice-diffusion inferred from our measurements is considerably higher than published values, however, and other creep mechanisms cannot be ruled out.<\/dc:description><dc:publisher>\n        American Geophysical Union<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/13759\/1\/jgrf643.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Arthern, Robert J.; Vaughan, David G.; Rankin, Andrew M.; Mulvaney, Robert; Thomas, Elizabeth R..  2010  In situ measurements of Antarctic snow compaction compared with predictions of models.   Journal of Geophysical Research: Earth Surface, 115 (F3), FO3011. 12, pp.  10.1029\/2009JF001306 <http:\/\/doi.org\/10.1029\/2009JF001306>     \n <\/dc:identifier><dc:relation>\n        10.1029\/2009JF001306<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/nora.nerc.ac.uk\/13759\/","10.1029\/2009JF001306"],"year":2010,"topics":["Glaciology"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Click\nHere\nfor\nFull\nArticle\nIn situ measurements of Antarctic snow compaction\ncompared with predictions of models\nRobert J. Arthern,1 David G. Vaughan,1 Andrew M. Rankin,1 Robert Mulvaney,1\nand Elizabeth R. Thomas1\nReceived 11 March 2009; revised 24 February 2010; accepted 30 March 2010; published 29 July 2010.\n[1] We describe in situ measurements of the compaction of Antarctic snow. At three\ndifferent sites in Antarctica, the rate of compaction was measured hourly, over various depth\nintervals, for up to two years. These measurements show that compaction at each of the\nsites occurs through slow, viscous deformation of the snowpack, with no significant\ncontribution from sudden collapse of weak layers. The measured rates of compaction at the\ncoldest site exhibit a strong seasonality, consistent with a temperature‐dependent sintering\nmechanism having activation energy of 70 kJ mol−1. At the two warmer sites, activation\nenergies of 80 and 120 kJ mol−1 provide slightly better agreement with the observations.\nPublished models of snow compaction underestimate the temperature sensitivity. A good\nmatch to our observations is provided by a semi‐empirical model, based on rate equations\nfor lattice‐diffusion (Nabarro‐Herring) creep of material around pores, combined with\nnormal grain growth. This model also provides a theoretical basis for a widely used empirical\nmodel of snow compaction. The rate coefficient for lattice‐diffusion inferred from our\nmeasurements is considerably higher than published values, however, and other creep\nmechanisms cannot be ruled out.\nCitation: Arthern, R. J., D. G. Vaughan, A. M. Rankin, R. Mulvaney, and E. R. Thomas (2010), In situ measurements of\nAntarctic snow compaction compared with predictions of models, J. Geophys. Res., 115, F03011, doi:10.1029\/2009JF001306.\n1. Introduction\n[2] In the porous upper layers of the ice sheets that cover\nGreenland and Antarctica the density can fluctuate over time.\nThis can introduce errors when satellite altimeters are used to\nassess the contribution made by the ice sheets to global sea\nlevel change [Braithwaite et al., 1994;Arthern andWingham,\n1998; Zwally et al., 2005; Helsen et al., 2008]; it can also\naffect the interpretation of samples of the past atmosphere\ntrapped in ice cores [Barnola et al., 1991]. In both cases,\ncorrections are applied to account for density changes, and\nthese rely on models of the rate of snow compaction [Barnola\net al., 1991; Arthern and Wingham, 1998; Wingham, 2000;\nMcConnell et al., 2000; Zwally and Li, 2002; Li and Zwally,\n2004; Zwally et al., 2005; Helsen et al., 2008; Reeh, 2008].\nUncertainty in these models limits the accuracy of dates\napplied to atmospheric samples from ice cores, and of mea-\nsured changes in the mass of the ice sheets. More generally,\ntheories of sintering have wider industrial applications [e.g.,\nWilkinson, 1988]. To test the available models, we performed\nexperiments to measure the rate of compaction of Antarctic\nsnow.\n[3] In regions of Antarctica and Greenland that are too cold\nfor summer melting, surface snow is buried and crushed by\nsubsequent snowfall. The compacted snow is slowly trans-\nformed into glacier ice, via an intermediate state called “firn.”\nDuring this transformation the firn undergoes a slow burial\nand compression under ever increasing load. Air is squeezed\nout, and density increases with depth. Near the surface (after\nsome drifting, disintegration and initial settling of snow\ncrystals) the volume ratio is typically one part ice to two parts\nair. Centuries or millennia can pass before 90% ice density is\nreached. At such a high density, the remaining air becomes\ntrapped as isolated bubbles. By that time the firn may have\nbeen buried to a depth of a hundred meters or so.\n[4] The rate at which a parcel of snow compacts under a\ngiven stress depends upon its rheology. This is partly con-\ntrolled by the viscosity of ice, but also by the arrangement\nof snow grains. Stresses are concentrated at grain contacts,\nwhere various sintering processes cause deformation, leading\nto densification. Reviews by Maeno and Ebinuma [1983],\nPaterson [1994], Colbeck [1998], and Blackford [2007]\ndescribe the process of firn compaction in more detail.\n[5] Samples taken from ice cores and snowpits can reveal\nthe profile of density r as a function of depth z. Many in-\nvestigations have parameterized the density‐depth profile\nr(z) in terms of local climatological parameters, such as mean\nannual temperature Tav, mass accumulation rate _b, and the\ndeposition density at the surface rs [e.g., Bader, 1960, 1962;\nKojima, 1964; Herron and Langway, 1980; Alley, 1987;\nBarnola et al., 1991; Spencer et al., 2001].\n[6] By itself, the density‐depth profile r(z) provides no\ninformation about the rate of compaction. To estimate com-\npaction rates it is often assumed that there are no sources or\n1British Antarctic Survey, Cambridge, UK.\nCopyright 2010 by the American Geophysical Union.\n0148‐0227\/10\/2009JF001306\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 115, F03011, doi:10.1029\/2009JF001306, 2010\nF03011 1 of 12\nsinks of mass within the snow, and that the density‐depth\nprofile equilibrates to an unchanging ‘steady state’. From\nmass conservation, the vertical velocity of a parcel relative to\nthe surface is then v(z) ≈ _b\/r(z), sometimes referred to as\n‘Sorge’s Law’ [Bader, 1960, 1962]. Differentiation with\nrespect to depth provides an estimate for the strain rate of\ncompaction: _\u0001 ≡ ∂v\/∂z ≈ −(∂r\/∂z) _b\/r2. This expression allows\ncompaction rates to be estimated from quantities that can be\nmeasured from an ice core or snow‐pit [Bader, 1960, 1962;\nKojima, 1964; Herron and Langway, 1980].\n[7] There is no universally accepted expression for snow\nrheology that reconciles field observations, laboratory mea-\nsurements, and sintering theories, although many have been\nproposed in the literature [e.g., Bader, 1960, 1962; Kojima,\n1964; Herron and Langway, 1980; Alley, 1987; Barnola\net al., 1991; Gray and Morland, 1995; Spencer et al., 2001;\nLi and Zwally, 2004; Helsen et al., 2008]. Some of these are\npurely empirical; others are based upon sintering theories,\nwith rate coefficients selected to match laboratory experi-\nments, or density‐depth profiles recovered from ice cores.\nGenerally the models agree fairly well with ice core data, but\neach predicts different sensitivity to important physical con-\nditions, such as temperature, deposition density, accumula-\ntion rate, grain‐size, and the weight of overlying snow.\n[8] Herron and Langway [1980] used the assumption of\nsteady state compaction, and density‐depth profiles from\nmany different sites to derive a widely used empirical\nparameterization of firn rheology. However, the functional\nform and temperature sensitivity of this parameterization\ndiffers from alternatives that have their origin in the rate\nequations used to model sintering mechanisms [Coble, 1970;\nMaeno and Ebinuma, 1983; Alley, 1987; Wilkinson, 1988;\nColbeck, 1998]. This leaves open the possibility that the\nHerron and Langway [1980] model may not describe\ndynamical variations in density as accurately as it describes\nsteady state compaction. Alternative models, broadly based\nupon theHerron and Langway [1980] parameterization, have\nemployed different formulations for the sensitivity to tem-\nperature [Li and Zwally, 2004; Helsen et al., 2008].\n[9] Changes in weather and climate can cause temperature,\naccumulation rate, and depositional density to vary. Conse-\nquently, and in violation of Sorge’s Law, the density profile\nr(z, t) will fluctuate with time t. As outlined above, knowl-\nedge of these fluctuations is needed to study the Earth’s cli-\nmate, and to estimate the contribution of ice sheets to sea level\nrise. There are many alternative models of snow compaction\nto choose from, but to discriminate among them there are\nsurprisingly few in situ observations of how the rate of\nAntarctic snow compaction varies from month‐to‐month or\nyear‐to‐year. Surface height variations relative to snow‐\nstakes, combined with density observations from shallow\npits, reveal evidence for enhanced compaction in the summer\nmonths [Kotlyakov, 1961; Dibb and Fahnestock, 2004].\nHowever, to our knowledge, compaction rates have not\nbeen measured continuously by direct instrumentation of the\nsnowpack.\n[10] To investigate the temporal evolution of density we\nperformed field experiments to obtain direct in situ mea-\nsurements of the rate of snow compaction. As well as pro-\nviding time series for the validation of models, we develop\nsome explanatory investigations of the key sensitivities and\nrate constants. Initially, we concentrate upon models that are\nbased upon the empirical Herron and Langway [1980]\nparameterization, because of its simplicity, and its wide-\nspread use in the interpretation of gases trapped in ice cores,\nand elevation changes measured by satellites. Zwally and Li\n[2002] have suggested that compaction is much more sensi-\ntive to temperature than earlier studies [e.g. Herron and\nLangway, 1980; Alley, 1987; Arthern and Wingham, 1998].\nFor this reason, we pay particular attention to characterizing\nthe temperature sensitivity.\n[11] In Section 2 we describe experimental methods. In\nSection 3 we compare results with the predictions of models\nfrom the literature. In Section 4 we interpret those results in\nthe context of physical mechanisms of snow compaction.\nSection 5 summarizes our findings.\n2. Methods\n[12] Between January 2004 and February 2007, strain-\nmeters were installed in the Antarctic snowpack, at locations\nshown in Figure 1. The Jurassic and Dyer Plateau sites lie on\nthe ice divide that forms the spine of the Antarctic Peninsula,\nwhile Gomez lies on its western flank. The Gomez and\nJurassic sites are close to nunataks of the same name, and the\nBerkner Island site lies atop the southern dome of that ice rise.\nAll sites except Jurassic were placed close to ice core drilling\nsites, and all are free from melt, even in summer. Similar\nequipment was also installed on the Wormold Glacier near to\nRothera Station, which does experience melt, but in this paper\nwe consider just the sites in the dry snow zone.\n[13] The instruments took hourly recordings of vertical\nstrain, using an automatic sensor that detected changes in the\nlength of a bowstring connecting top and bottom of a bore-\nhole (Figure 2). The approach is an automated version of\nthe ‘coffee‐can’ method for measuring thickness changes,\ndescribed by Hamilton et al. [1998].\nFigure 1. Location map showing sites mentioned in text.\nARTHERN ET AL.: SNOW COMPACTION F03011F03011\n2 of 12\n[14] The bowstring was made from a composite of Ultra\nHigh Molecular Weight Polyethylene (Dyneema) and Liquid\nCrystal Polymer (Vectran) to minimize any change in its\nlength from elastic, creep or thermal effects. The attachment\npoint at the bottom of the borehole was a length of steel bar\ndrilled through with an eyelet connected to the bowstring.\nThe bar was heated in a flask of hot water, then lowered down\nthe borehole and frozen in place at the bottom. Subsequent\nintroduction of ice‐chippings and a small amount of hot water\nfurther cemented it in place. To minimize any tendency of the\nsteel bar to move relative to the surrounding snow, its weight\nwas selected to approximately compensate for tension within\nthe bowstring.\n[15] At the top of the borehole, a position transducer\n(Ametek, P50‐A) kept the bowstring under tension and\nrecorded the amount of slack taken up as compaction of the\nsurrounding snow proceeded. The position transducer oper-\nated as a potentiometer, recording the extension and retrac-\ntion of a spring‐tightened sensor cable to sub‐millimeter\nprecision. It was mounted in an aluminum case to protect it\nfrom weather, and from the weight of snowfall during burial.\n[16] Boreholes were approximately 10cm in diameter,\nand appeared sufficiently straight to avoid contact between\nthe bowstring and the sides, although the full depth was\nnot observed directly. Upon deployment the case was placed\ndirectly over the borehole, with the bowstring passing\nthrough a small hole in its floor. The bowstring was clipped\nonto the extended sensor cable, and pulleys within the case\nallowed the sensor cable to retract, so that slack could be\ntaken up andmeasured as compaction proceeded. The pulleys\nand position transducer were mounted on a rigid aluminum\nframe inside the case, to resist deformation during burial (the\narrangement is shown in Figure 3).\n[17] At each site, three separate strain recording systems\nwere installed, with steel bars placed at depths of five, 10, and\n20 meters below the surface, each in a separate borehole.\nOutput from the three position sensors was recorded by a\ndata‐logger (Campbell, CR10X) powered by a 100Ah lead\nacid battery. The loggers and batteries were housed in sepa-\nrate fibreglass enclosures (not shown in Figure 3), with\nconnecting cables running to each of the three strainmeters.\nFigure 2. Equipment deployed at each site.\nFigure 3. The arrangement of pulleys and position sensor\nwithin the aluminum case. The borehole lies directly beneath\nthe right‐hand pulley. The photo was taken upon recovery of\nthe equipment. The attachment point between the bowstring\nand sensor wire is visible, and has just passed around the\nleft‐hand pulley.\nARTHERN ET AL.: SNOW COMPACTION F03011F03011\n3 of 12\nThe battery lasted two years at the Gomez site, around seven\nmonths at the Jurassic site. At the Berkner Island site, two\nyears of data were recovered, with the battery changed after\none year. Data were stored on site until recovery of the\nequipment.\n[18] We performed a number of checks. We maintained an\neight‐meter length of bowstring in a loft‐space under the\nsame tension used in the field experiments, and recorded the\nchange in its length using the position transducer. After an\ninitial extension of approximately 3 mm, negligible rate of\ncreep was observed (<0.01 mm day−1 over 18 days). Tem-\nperature varied in the range 22–30°C during this test, but any\nstrain from thermal effects was less than 0.2mm.We assessed\nthe temperature‐dependent bias in the assembled system of\nposition transducers and loggers by moving them from an\nambient temperature of 22°C into a cold‐room at −25°C,\nallowing all equipment to equilibrate at the new temperature:\nrecorded positions changed by less than 3 mm across the\noperating range. We checked the calibration of the posi-\ntion transducers during deployment, by recording the output\nvoltage with the sensor wire fully retracted, fully extended,\nand at an intermediate position (the white pulley shown in\nFigure 3). We also performed physical measurements of the\nremaining length of travel, during deployment and recovery\nof the equipment, to guard against failure of the automatic\nlogging system.\n[19] Several auxiliary measurements were made at each site\nto supply initial conditions and boundary conditions for\nmodeling the rate of snow compaction. Hourly temperatures\nat various depths within the upper ten meters of the snowpack\nwere measured using a chain of thermistors, and stored\non a second data‐logger. An automatic weather station\n(AWS) provided hourly meteorological measurements (air‐\ntemperature, humidity, wind speed and direction). The AWS\nmast was guyed for stability, and fitted with two Campbell\nSR50 sonic ranging devices, mounted from a cross‐mast.\nThese monitored the arrival of snow at the site, logged hourly\nby the AWS unit. The weather station mast was 5 m high,\nwith approximately 4.5 m above the surface at time of\ninstallation. At each location, the ice core from the twenty\nmeter borehole was analyzed for density at approximately\nten‐centimeter depth resolution. Samples of meltwater from\neach core section were recovered from the field and analyzed\nusing a Dionex ICS‐2500 ion chromatograph. The annual\naccumulation record for each core was derived using the\nsummer‐summer maxima of two seasonally varying anions,\none from methanesulphonic acid (MSA; CH3SO3H) and\nsulphate (SO4\n2−), to provide the accumulation at the site prior\nto installation of the equipment. At the Berkner Island site,\naccumulation rate and densities from a pre‐existing ice core\nwere used [Gerland et al., 1999; Mulvaney et al., 2002].\n[20] The strainmeters recorded vertical separation between\nsnow‐layers at either end of their respective boreholes. To tie\nthis relative motion into geocentric coordinates, the precise\nlocation was determined at the start and end of the occupation\nusing dual frequency global positioning system (GPS)\nrecorders. The position of the snow surface, and of reference\nmarks on the aluminum cases that contained the strain sen-\nsors, were surveyed using tape measures and trigonometric\ntriangulation, to locate them relative to the GPS antenna. This\nlocal surveying was performed at installation and at recovery.\nThe location of the AWS mast, and of the thermistor string,\nwere surveyed relative to the GPS antenna in the same way.\nTo estimate the component of the vertical motion due to\ndownslope flow, the local slope was measured by differential\nGPS survey between the central location and three outlying\nsites, arranged in an equilateral triangle, each about one\nkilometer distant from the central site. Although not\ndescribed further here these data will eventually allow point‐\nestimates of the change in mass of ice per unit area [cf.\nHamilton et al., 1998].\n3. Results\n[21] The climatic parameters recovered from the ice cores,\nand the automatic weather stations, are shown in Table 1.\nFigure 4. Densities from shallow ice cores: Dyer Plateau\n(blue); Jurassic (red, offset to the right by 100 kg m−3);\nGomez (green, offset to the right by 200 kg m−3). Arrows\nindicate summer horizons identified from the concentration\nof two seasonally varying anions. For Berkner Island, accu-\nmulation rate and densities from a pre‐existing ice core were\nused [Gerland et al., 1999; Mulvaney et al., 2002].\nTable 1. Climatic Parameters for the Four Study Sitesa\nSite Latitude, Longitude Mean Annual Temperature Tav (K) Accumulation Rate _b (kg m\n−2 a−1)\nJurassic −74.43°N, −74.43°E 252.5 ± 0.1 950 ± 160\nGomez −74.00°N, −70.61°E 256.6 ± 0.1 1040 ± 160\nBerkner Island −79.57°N, −45.79°E 247.4 ± 0.2 130 ± 40\nDyer Plateau −70.67°N, −64.87°E 252.8 ± 0.1 680 ± 120\naMean annual temperatures were estimated from the average snow temperature at 10 m depth. Accumulation rates were estimated\nfrom shallow ice cores from Jurassic and Gomez, and Dyer Plateau Sites, and from Mulvaney et al. [2002] for Berkner Island. The\nstandard deviation of seasonal fluctuations in 10m temperature, and of interannual fluctuations in accumulation rate are also listed.\nARTHERN ET AL.: SNOW COMPACTION F03011F03011\n4 of 12\nFigure 4 shows density profiles from the shallow ice cores;\nJurassic and Gomez densities are offset by 100 and 200 kg\nm−3 respectively for clarity of display. Figure 5 shows the\ntotal amount of compaction over three depth intervals 0–5 m,\n0–10 m, and 0–20 m, at three sites, Jurassic, Gomez, and\nBerkner Island. Figure 6 shows daily thinning rates obtained\nby differentiating these curves. These rates are differences\nbetween successive daily averages recorded by the position\nsensors. No other smoothing was applied. We have plotted\nthe total thinning rate over each depth interval, rather than\nthe strain rate, because this is the quantity most relevant to\ninterpretation of radar altimeter observations. The strain rate\ncan be recovered by dividing the thinning rates by 5 m, 10 m\nor 20 m, as appropriate for each borehole. Although the total\nthinning rate is higher for the 20 m borehole, the average\nstrain rate is lower. The data are overlain by curves showing\nmodeled compaction rates computed using the following\nformula,\ndt\u0003 ¼ c0 \u0003i \u0002 \u0003ð Þ; \u0003 <¼ 550kgm\n\u00023;\nc1 \u0003i \u0002 \u0003ð Þ; \u0003 > 550 kgm\u00023;\n\u0001\nð1Þ\nin which ri = 917 kg m\n−3 is the density of solid ice, and c0,\nand c1 are rate parameters whose values were defined using\nmodels of snow compaction from the literature [Herron and\nLangway, 1980; Li and Zwally, 2004; Helsen et al., 2008].\nThe models are described in more detail below. Different rate\nconstants were used in each density range to allow for the\nenhancement in compaction caused by sliding of grains rel-\native to each other.\n[22] The total derivative dtr ≡ ∂tr + v∂zr is the rate of\nchange of density of a material parcel. To compute the\nmodeled thinning rates, we integrated equation (1) numeri-\ncally. The initial density r0 for each section of the ice core was\nspecified at the density measured for that section; the initial\nlength l0 of each section (roughly 10 cm) was also recorded\nduring core processing. To compute the change in length,\nwe updated the density r for each hourly time step using\nequation (1), and recomputed the length l, assuming mass\nconservation and vertical compression (i.e. l = l0r0\/r). We\ncomputed the total amount of thinning from sections that\noriginally spanned 0–5 m, 0–10 m, and 0–20 m by summing\nthe compaction (l0 − l) over those sections. Curves show daily\naverages of the thinning rates in mm day−1.\nFigure 5. Total compaction in mm for different depth ranges: (left) 0–5m, (middle) 0–10m, and (right) 0–\n20 m, from three sites: (top) Jurassic, (middle) Gomez, and (bottom) Berkner Island. Dates are in month‐\nyear format (e.g., Jan04 is January 2004). Data collected as the attachment point passed around the pulley,\nor reached the end of travel, are less reliable and are shown in gray. At the Jurassic site, two sensors seized\nduring the experiment are indicated by question marks.\nARTHERN ET AL.: SNOW COMPACTION F03011F03011\n5 of 12\n[23] The rate parameters c0, and c1 in equation (1) were\nevaluated as follows, according to different models from the\nliterature:\nHerron and Langway 1980½ \u0003\nc0 ¼ 11 _b=\u0003w\n\u0003 \u0004\nexp \u0002 10160RT\n\u0005 \u0006\n;\nc1 ¼ 575\nffiffiffiffiffiffiffiffiffiffi\n_b=\u0003w\nq\nexp \u0002 21400RT\n\u0005 \u0006\n;\n(\nLi and Zwally 2004½ \u0003\nc0 ¼ c1 ¼ _b=\u0003i\n\u0003 \u0004\n139:21\u0002 0:542Tavð Þ8:36 273:15\u0002 Tð Þ\u00022:061;\nn\nHelsen et al: 2008½ \u0003\nc0 ¼ c1 ¼ _b=\u0003i\n\u0003 \u0004\n76:138\u0002 0:28965Tavð Þ8:36 273:15\u0002 Tð Þ\u00022:061:\nn\nð2Þ\nIn these expressions, rw = 1000 kg m\n−3 is the density of water\nand R = 8.314 J mol−1 K−1 is the gas constant. The mass\naccumulation rate _b (kg m−2 yr−1) was taken from the shallow\nice cores for Jurassic and Gomez, and from Mulvaney et al.\n[2002] for Berkner Island. The mean annual temperature\nTav (K) was estimated at each site from the average temper-\nature of the deepest thermistor, at approximately 10‐m depth.\n[24] The Herron and Langway [1980] parameterization\nwas defined using steady state density profiles from Green-\nland and Antarctica, assuming an Arrhenius type temperature\nsensitivity for compaction. The Li and Zwally [2004]\nparameterization, which was originally informed by experi-\nments on grain growth, has a different temperature sensitivity\nto the Herron and Langway [1980] model, and was fur-\nther constrained by fits to steady state density profiles in\nGreenland. The Helsen et al. [2008] model was derived by\nmodifying the Li and Zwally [2004] model, constraining it to\nmatch steady state profiles for Antarctic sites. FollowingReeh\n[2008, equation 4], a simplified version of the Li and Zwally\n[2004] and Helsen et al. [2008] models is used here.\n[25] Estimates for the instantaneous temperature field\nT(z, t) were provided by solving the one‐dimensional heat\nconduction equation (rc dtT ≡ rc[∂tT + v∂zT] = ∂z[\u0004∂zT],\nwith heat capacity c = 2009 J kg−1 K−1, and conductivity \u0004 =\n2.1(r\/ri)\n2Wm−1 K−1), as described by Arthern andWingham\n[1998]. The upper boundary condition for temperature was\nFigure 6. Thinning rates in mm day−1 for different depth ranges: (left) 0–5m, (middle) 0–10m, and (right)\n0–20 m, from three sites: (top) Jurassic, (middle) Gomez, and (bottom) Berkner Island. Dates are in month‐\nyear format (e.g., Jan04 is January 2004). Curves show thinning rates predicted by various parameteriza-\ntions of snow compaction: Herron and Langway [1980] (blue, dot‐dashed); Li and Zwally [2004]\n(magenta, dotted); Helsen et al. [2008] (green, dashed); local ‘best‐fit’ models used to derive parameters\nin Table 2 (red, solid); a semi‐empirical model based upon rate equations for Nabarro‐Herring creep and\nnormal grain growth (cyan, dashed) (equation (4)).\nARTHERN ET AL.: SNOW COMPACTION F03011F03011\n6 of 12\nspecified from thermistors within the aluminum cases at the\ntop of the borehole. For the lower boundary condition, the\ntemperature of the deepest layer, at about 20‐m depth, was set\nequal to Tav. Temperatures were updated at each hourly time\nstep, and used to recompute rate constants c0, and c1. We\ntested temperatures from the thermal model against ther-\nmistors at intermediate depths: these agreed within an r.m.s.\nerror of 0.2 K at Jurassic and Gomez sites, and 0.7 K at the\nBerkner Island site.\n[26] To further investigate the sensitivity of the compaction\nrate to temperature, we derived estimates of the activation\nenergy E, by fitting a model of the form:\n‘Best-fit’\nc0 ¼ a0 exp \u0002 ERT\n\u0005 \u0006\nc1 ¼ a1 exp \u0002 ERT\n\u0005 \u0006( : ð3Þ\nThe parameters a0, a1 and E, were selected at each site to\nminimize the discrepancy with the observations of thinning.\nDetails of this fitting procedure are given in Appendix A.\nThe parameters that define the ‘best‐fit’ model are shown in\nTable 2 for each site. The red curves of Figure 6 show the\ncorresponding time series. The r.m.s. errors of the best fits for\nthe Jurassic, Gomez and Berkner sites are respectively 0.19,\n0.15 and 0.07 mm day−1. Figure 7 illustrates the modeled\ntemperature and strain rate of compaction in the upper ten\nmeters at the Gomez site, based on the ‘best‐fit’ model.\n[27] A reasonable fit to the data can be made for other\nactivation energies. Table 2 also lists a*0 and a*1, the values of\na0 and a1 that give the best fit to our observations when the\nactivation energy E is constrained to be 60 kJ mol−1, a\ncommonly used value for activation energy for ice defor-\nmation [Paterson, 1994]. Using these parameters, the r.m.s.\nerrors for the Jurassic, Gomez and Berkner sites are respec-\ntively 0.21, 0.19 and 0.07mm day−1, not much worse than the\nminimum error values.\n[28] Laboratory experiments have shown that there is an\nenergy barrier of approximately 60 kJ mol−1 for molecular\ndiffusion through the lattice of the ice crystal [Petrenko and\nWhitworth, 1999], so this is a potential mechanism that\ncould explain our observations. Creep caused by lattice dif-\nFigure 7. Temperature and snow accumulation at the Gomez Site: (top) air temperature (°C), (middle)\nsnow temperatures from the thermal model, (bottom) strain rates from the ‘best fit’ compaction model\n(see text). Gray shading represents fresh snow accumulation, as measured by the sonic depth rangers,\nand was not included in the model.\nTable 2. Activation Energy and Rate Constants That Define the Best‐Fit Model That Produced the Red Solid Curves Plotted in Figure 6a\nSite Activation Energy E (kJ mol−1) a0 (a\n−1) a1 (a\n−1) Activation Energy E* (kJ mol−1) a*0 (a\n−1) a*1 (a\n−1)\nJurassic 80 5.43 × 1015 2.01 × 1015 60 4.43 × 1011 1.48 × 1011\nGomez 120 3.86 × 1023 1.79 × 1023 60 3.20 × 1011 1.10 × 1011\nBerkner Island 70 7.91 × 1012 4.21 × 1012 60 6.89 × 1010 4.06 × 1010\naThe values a*0 and a*1 produce the best match when the activation energy is constrained to be 60 kJ mol\n−1.\nARTHERN ET AL.: SNOW COMPACTION F03011F03011\n7 of 12\nfusion is known as Nabarro‐Herring creep. Appendix B\nshows that by coupling rate equations for Nabarro‐Herring\ncreep [Coble, 1970] and normal grain‐growth [Gow et al.,\n2004] a semi‐empirical expression for the rate coefficients\nc0 and c1 can be obtained:\n‘Nabarro-Herring’\nc0 ¼ 0:07 _bg exp \u0002Ec=RT þ Eg=RTav\n\u0003 \u0004\nc1 ¼ 0:03 _bg exp \u0002Ec=RT þ Eg=RTav\n\u0003 \u0004( : ð4Þ\nThe coefficients 0.07 and 0.03 were determined empirically\nfrom a*0 and a*1 as described in Appendix B. Values of 60 kJ\nmol−1 for Ec, and 42.4 kJ mol\n−1 for Eg were used to produce\nthe cyan curves shown in Figure 6.\n[29] At four sites, the total thinning in three depth intervals\nwas recorded over at least two‐years either from physical\nmeasurements or from the position transducer: the average\nrates are shown in Table 3, where they are compared with\nthinning rates predicted by Sorge’s Law, i.e. v(z1) − v(z2) =\n_b(1\/r(z1) − 1\/r(z2)). Densities for 0, 5, 10 and 20 m were\nestimated from averages over the intervals [0–1 m],[4.5–\n5.5 m],[9.5–10.5 m], and [19–20 m] respectively.\n4. Discussion\n[30] The measured compaction rates are consistent with\na slow viscous deformation of the snowpack. Strain rate\ndecreases with depth, despite increasing load. Total thinning\nrates over 0–20 m are less than five mm day−1 at all study\nsites, and agree with those predicted by Sorge’s Law to within\nabout 30% or 0.3 mm day−1. We characterized the observa-\ntional error in our measurements using residuals from the best\nfit model and Monte‐Carlo simulation: multiple simulations\nof the observational error were generated by fitting an auto-\nregressive process to the residuals. These simulations suggest\nthat thinning rates averaged over 2‐years should be accurate\nto around 0.04 mm day−1; a similar accuracy is indicated by\ncomparing the physical measurements and the electronically\nrecorded data. The densities and accumulation rates used to\ncompute thinning rates from Sorge’s Lawmay be uncertain to\nabout 10%, perhaps more at the Berkner Island site where an\nearlier ice core was used. For a typical density profile, these\nuncertainties would compound to givemore than 20% error in\nthe thinning rates derived from Sorge’s Law, so the differ-\nences in Table 3 are not highly significant. Compaction is\nfaster at the Jurassic and Gomez Sites than at the Berkner\nIsland site. This is because the snow is warmer, and the\naccumulation rates are higher, both of which promote faster\ncompaction.\n[31] There are fluctuations in the rate of compaction, but\nthere is little evidence for sudden collapse of weak layers or\nnaturally occurring ‘firn quakes’ within the snowpack at any\nof our sites. For a single day (21st March, 2004) the strain-\nmeters at the Berkner Island site briefly recorded higher rates\nthan shown in Figure 6, and then only at 2.4 mm day−1.\n[32] A strong seasonal cycle is apparent in the rate of snow\ncompaction at the Berkner Island site. This site has lower\naccumulation rate, so the strainmeters are buried less quickly,\nand sample two seasonal cycles at depths shallow enough to\nbe strongly affected by the summer warming. The highest\nthinning rates at Berkner Island are in late January, in the\naustral summer, when the summer warmth has had time to\nconduct into the snowpack, as noted by Zwally and Li [2002].\nThinning rates during the second year of the record are more\nmuted, because seasonal warming is attenuated with depth.\nThe amplitudes of the seasonal cycles are similar for 0–5m,\n0–10m, and 0–20m, indicating that seasonal variations in\ncompaction are largely confined to the upper 5 m.\n[33] At the Gomez site the influence of the summer\nwarming in the second year is reduced, because the strain-\nmeters were buried faster there than at Berkner Island. This\neffect masks the seasonal cycle at the higher accumulation\nsites. Figure 7 shows how the high burial rate at Gomez\ninsulates the instrumented snow from summer warming in the\nsecond year, and how this affects the strain rates.\n[34] At the Jurassic and Berkner Island sites, the three\nmodels from the literature compare reasonably well with the\nobservations: thinning rates agree within a factor of three, and\nthe fit becomes progressively better over time, as the snow\nsampled by the strainmeters is buried deeper. All three\nmodels underestimate the amplitude of the seasonal cycle\nin thinning rates at the Berkner Island site, which suggests\nthey are not sufficiently sensitive to temperature. The Li\nand Zwally [2004] and Helsen et al. [2008] models perform\nbetter in this respect than the Herron and Langway [1980]\nparameterization.\n[35] As noted by Helsen et al. [2008], the parameterization\nof Li and Zwally [2004] predicts non‐physical, negative\ncompaction rates for sites with mean annual temperature\ngreater than 256.8 K. The modification made to the Li and\nZwally [2004] parameterization by Helsen et al. [2008]\nclearly improves the fit at the Gomez site, but even the\nmodified formula predicts non‐physical, negative compac-\ntion rates for mean annual temperature greater than 262.9 K.\nAs a separate issue, strong summer melting would become a\nserious concern for sites as warm as this [Reeh, 2008].\n[36] Firn compaction can proceed via a number of different\nmicrophysical mechanisms [Wilkinson, 1988; Arthern and\nWingham, 1998]. Nevertheless, under specified conditions\none or other of these mechanisms will usually dominate\n[Maeno and Ebinuma, 1983]. For the two colder sites, the\nsensitivity of measured compaction rates to temperature is\nconsistent with a dominant process that has an activation\nenergy of around 70–80 kJ mol−1.\nTable 3. Thinning Rates Measured Over Various Depth Ranges From Physical Measurementsa\nSite Start Date End Date 0–5 m (mm day−1) 0–10 m (mm day−1) 0–20 m (mm day−1)\nJurassic 8 Feb 2005 21 Jan 2007 0.89 (1.15) 1.13 (1.50) 1.70 (1.86)\nGomez 1 Feb 2005 1 Jan 2007 0.94 0.97b (1.11) 1.34 (1.71) 1.76 (2.14)\nBerkner Island 14 Feb 2003 27 Jan 2006 0.30b (0.16) 0.46b (0.30) 0.57b (0.38)\nDyer Plateau 21 Jan 2005 8 Jan 2007 0.81 (0.73) 1.13 (1.05) 1.47 (1.28)\naValues in brackets are predicted using Sorge’s Law.\nbThinning rates from automatic strainmeter.\nARTHERN ET AL.: SNOW COMPACTION F03011F03011\n8 of 12\n[37] At the warmer Gomez site a larger activation energy of\n120 kJ mol−1 gives a slightly better fit. Increased activation\nenergy at warmer temperatures has been noted by Jacka and\nLi [1994] and Paterson [1994]. A different microphysical\nprocess may operate at such high temperatures. However, if\nwe constrain the activation energy to be 60 kJ mol−1 (fol-\nlowing Petrenko and Whitworth [1999]), the r.m.s. error\nincreases by only about 0.04 mm day−1, even at the Gomez\nsite, so we cannot be certain that the mechanism of com-\npaction there is different.\n[38] In any event, our best estimates of the activation\nenergy are considerably higher than other models of snow\ncompaction [Kojima, 1964; Alley, 1987; Herron and\nLangway, 1980; Arthern and Wingham, 1998]. This sup-\nports the observation by Zwally and Li [2002] that snow\ncompaction is more sensitive to temperature than assumed by\nthese earlier models. The disagreement between our obser-\nvations and the very low value of around 10–20 kJ mol−1\nderived by Herron and Langway [1980] is noteworthy, since\nthe models are otherwise comparable. This discrepancy\ncauses the Herron and Langway [1980] model to underesti-\nmate the seasonal changes (Figure 6).\n[39] The higher activation energy that we recover indicates\nthat the dominant mechanism has a relatively high energy\nbarrier. Petrenko and Whitworth [1999] give a value of 60 kJ\nmol−1 for the activation energy of molecular diffusion within\nthe ice lattice, comparable to the values recovered from our\ndata, so this is a potential mechanism that could explain our\nobservations. Appendix B describes a semi‐empirical model\nderived by coupling rate equations for lattice‐diffusion\n(Nabarro‐Herring) creep and normal grain‐growth [Gow\net al., 2004; Burton, 1993]. This simple model can repro-\nduce the low‐density part of theHerron and Langway [1980]\nmodel, and explains its low temperature sensitivity.\n[40] Comparing the coefficients recovered from the semi‐\nempirical model with laboratory data, we find that compac-\ntion of polar firn occurs faster than would be expected from a\nsimple theory based on lattice diffusion creep around cylin-\ndrical pores. Possible reasons include experimental uncer-\ntainty in material parameters, errors introduced by our simple\ntreatment of grain growth, oversimplification of geometric\neffects such as stress concentration within the necks between\ngrains, dependence upon other details of the microstructure\n[Alley et al., 1982; Freitag et al., 2004; Fujita et al., 2009],\nor contributions from other densification mechanisms. Our\nsimplemodel parameterizes grain rearrangement by enhancing\nthe compaction rate at densities below 550 kg m−3. Alterna-\ntively, the granular rearrangement model of Alley [1987]\ncould be tested against our data. Other mechanisms, such as\ngrain‐boundary diffusion creep [Coble, 1970; Colbeck,\n1998], ‘Harper‐Dorn’ [Kassner et al., 2007], or ‘power law’\ndislocation creep [Wilkinson, 1988], may also contribute\nsignificantly. A separate analysis, similar to that presented\nhere, would have to be performed for each candidate mech-\nanism before unambiguously attributing the mechanism of\nsintering.\n[41] The semi‐empirical model, defined by equations (1)\nand (4) reproduces our observations fairly closely, and\nshould prove useful in interpreting altimetry observations in\ncoastal regions with temperature and accumulation rate\ncomparable to our sites. Nevertheless, for the reasons dis-\ncussed above, it may oversimplify the physics of compac-\ntion in polar firn, and should be tested further before being\napplied to other climatic regimes such as the cold interior of\nAntarctica.\n[42] Although we have recovered many years of hourly\nstrain data, the design of equipment could have been\nimproved to increase the quantity and quality of data: battery\nfailure and loose connections caused loss of data at the\nBerkner Island, Dyer Plateau, and Jurassic sites, and two of\nthe position transducers at the latter site physically seized up.\n[43] Experiments in such high accumulation risk complete\nburial with loss of data. The weather station masts were 5 m\nhigh, with approximately 4.5 m above the surface at time of\ninstallation. Gomez was buried a few centimeters beneath the\nsurface after two years, but the equipment and data were\nrecovered, based on a flow‐corrected estimated position,\nusing a ground penetrating radar. Only the wind vane of the\nJurassic site was protruding at recovery. Satellite transmis-\nsion of data, or taller masts, would lessen the risk of data loss.\n[44] The quality of data was affected as the attachment\npoint between bowstring and sensor wire passed around the\npulley, and the end of travel was reached on some of the\nposition transducers. Interference from the pulley could have\nbeen avoided by using a longer enclosure for the sensor cable.\nPulleys could have been eliminated entirely by using vertical\nhousings for the sensor cables, instead of the aluminum cases,\nalthough this would make the instruments more susceptible to\ndisturbance by wind.\n5. Conclusions\n[45] We have presented a relatively simple and effective\ntechnique for the in situ measurement of snow compaction\nover periods of years. The histories of snow compaction rate\nwere measured at sites in the Antarctic Peninsula and Berkner\nIsland with snow accumulation ranging from 130 to 1040 kg\nm−2 a−1, and mean annual temperature from −26 to −17°C. At\nthese sites, the snow compacts steadily. No sudden failure or\ncollapse in the upper twenty meters exceeded a few milli-\nmeters. For the most part, the rate of compaction changes\nslowly on seasonal, monthly and weekly timescales.\n[46] The observed changes are described quite well by a\nsimple model ([based upon that of Herron and Langway\n[1980]) with three adjustable parameters (one rate constant\nfor low density, another for high, and an activation energy\nthat determines the sensitivity to temperature). The amplitude\nand phasing of changes in compaction rate can be explained\nby coupling this simple model to a one‐dimensional model\nof heat flow within the snowpack. This suggests that the\nobserved changes in the rate of compaction were driven\nprincipally by seasonal and weather‐related fluctuations in\nthe temperature of the snow.\n[47] Three models of snow compaction from the literature\n[Herron and Langway, 1980; Li and Zwally, 2004; Helsen\net al., 2008] were compared with the measured rates. At the\nwarmest site the model described by Li and Zwally [2004]\npredicts unrealistically low compaction rate. Elsewhere, the\nthree models agree fairly closely, but they under‐predict the\namplitude of the seasonal cycle in compaction rate, mainly\nbecause they underestimate the compaction rate of near‐\nsurface snow in summer. This suggests they are not sensitive\nenough to temperature. The modified version of the Li and\nZwally [2004] model described by Helsen et al. [2008]\nARTHERN ET AL.: SNOW COMPACTION F03011F03011\n9 of 12\nseems to capture the seasonal cycle best overall, but the\nHerron and Langway [1980] model seems especially insen-\nsitive to temperature.\n[48] The activation energies recovered from our simple\nmodel lie in the range 70–80 kJ mol−1 at the colder sites, and\nreach 120 kJ mol−1 at the warmest site, much larger than the\nvalue of 10–21 kJ mol−1 found by Herron and Langway\n[1980]. This apparent discrepancy can be reconciled if\ncompaction occurs by grain‐size dependent creep of material\naround pores, combined with normal grain‐growth. Coupling\nrate equations for these processes reproduces the functional\nform of our simple model, and of the empirical Herron and\nLangway [1980] model, while explaining their different\nsensitivities to temperature. However, the molecular diffu-\nsivity inferred from our data is higher than published values,\nso we cannot unambiguously determine the mechanism of\nsintering.\nAppendix A: Parameter Estimation\n[49] To recover the parameters of the model defined by\nequation (3), simulations were performed for various com-\nbinations of E, a0 and a1. The best values were found by trial‐\nand‐error comparison with the time series of compaction rate.\n[50] The activation energy E was varied in steps of\n10 kJ mol−1 from 30 to 150 kJ mol−1. To provide an initial\nguess for the other parameters, we first derived a rough\nestimate ea1 using the steady state assumption. Rearrangement\nof equation (1) gives\ndt \u0002ln \u0003i \u0002 \u0003ð Þ½ \u0003 ¼ c1; \u0003 > 550 kgm\u00023: ðA1Þ\nAssuming a steady state allows a rough estimate ec1 ≈ c1 to be\nderived from the slope of a plot of −ln(ri − r) against time\nsince deposition t [cf. Herron and Langway, 1980]. Since\nthe deeper snow is almost isothermal at the mean annual\ntemperature Tav, the approximation ea1 ≈ ec1 exp(E\/RTav) is\nobtained.\n[51] Compaction is enhanced in the low density range,\nmost likely from sliding of grains relative to each other [Alley,\n1987], so a0 > ea1 provides the best match. To search a rea-\nsonable span of values for a0, we performed separate simu-\nlations using a0 = F ea1, with each value of F from 1 to 4 in\nsteps of 0.05. Figure A1 shows how the r.m.s. error varied\nwith the choice of activation energy E and non‐dimensional\nrate factor F for each site. The minima locate the parameter\nchoices that define the ‘best‐fit’model at each site. The heavy\ncontour indicates the minimum value plus two standard\ndeviations of r.m.s. error, derived by fitting an autoregressive\nmodel to residuals from the best fit model, then using these to\ngenerate an ensemble for the r.m.s. error. This contour gives\na rough indication of the range of parameter space that could\nbe reached as a consequence of measurement errors and\nunmodeled fluctuations. As well as varying a0 we tried\ncombinations a1 = 0.8 ea1, a1 = ea1, and a1 = 1.2 ea1 for the\ndeeper, denser snow.\nAppendix B: A Semi‐empirical Model for Snow\nCompaction\n[52] To derive the semi‐empirical model (equation (4)) we\ncombine an expression for creep in a mediumwith cylindrical\npores [Wilkinson and Ashby, 1975, equation 20], with an\nexpression for lattice‐diffusion (Nabarro‐Herring) creep of\nconsolidated ice [Coble, 1970, equation 22] to give the den-\nsification rate:\ndt\u0003 ¼ kc \u0003i \u0002 \u0003ð Þ exp \u0002Ec=RTð Þ\u0005=r2; ðB1Þ\nwith r being grain radius, s the overburden pressure from\nsnow loading, Ec the activation energy for self‐diffusion\nof water molecules through the ice lattice, and kc constant.\nEquation (B1) for the rate of Nabarro‐Herring creep describes\ngranular sliding, accommodated by molecular diffusion\nthrough the crystal lattice, across dimensions comparable to\nthe grain size. Use of equation (B1) to represent granular\nFigure A1. Selection of parameters for the ‘best‐fit’ models. Contours show the root mean square dis-\nagreement between model and measured thinning rates (mm day−1) and how this changes as the Activation\nEnergy (E) and non‐dimensional rate factor (F) are varied. The contour interval is 0.01 mm day−1. The com-\nparison was carried out over the range 0–5m depth at three sites: (left) Jurassic, (middle) Gomez, and (right)\nBerkner Island. The parameters corresponding to the minimum error are listed in Table 2, and produce the\nred, solid curves on Figure 6.\nARTHERN ET AL.: SNOW COMPACTION F03011F03011\n10 of 12\nsliding assumes a jammed configuration of grains around the\ncylindrical pore, so that diffusion must occur before any\nsliding can take place [Onaka et al., 2001].\n[53] A complete dynamical model would evolve the grain‐\nsize and snow‐load as state variables, coupling equation (B1),\nwith the heat‐conduction, normal grain‐growth and snow‐\nloading equations,\n\u0003c dtT ¼ @z \u0004@zT½ \u0003;\ndtr2 ¼ kg exp \u0002Eg=RT\n\u0003 \u0004\n;\ndt\u0005 ¼ _bg:\nðB2Þ\nInitial conditions r = r0, T = T0, r\n2 = r0\n2 and s = s0, would then\nneed to be specified for each snow parcel, along with upper\nand lower boundary conditions for temperature T.\n[54] Rather than solve the full system of equations, we\nmake some simplifying assumptions. For steady accumula-\ntion rate _b, and gravity g, the snow load can be approximated\nby s = _bgt. Near the surface, fluctuations in temperature Twill\naffect the rate of grain growth in a non‐linear way, and other\neffects such as temperature gradient metamorphism may\noccur; nevertheless, for simplicity, we assume that these\neffects can be neglected once the growth rate is integrated\nover sufficient time. Following Gow et al. [2004], we replace\nT with the mean annual temperature Tav in the grain‐growth\nequation and integrate to give,\nr2 \u0004 r2s þ kg exp \u0002Eg=RTav\n\u0003 \u0004\nt; ðB3Þ\nwith rs the initial surface value, kg a constant and Eg the\nactivation energy for grain growth. For small initial grain size,\nafter sufficient time, r2 ≈ kgexp(−Eg\/RTav)t. Combined with\nequation (B1), this gives an approximate expression for the\ndensification rate,\ndt\u0003 \u0004 _bgkc=kg\n\u0003 \u0004\n\u0003i \u0002 \u0003ð Þ exp \u0002Ec=RT þ Eg=RTav\n\u0003 \u0004\n: ðB4Þ\nEquation (B4) has the same form as the ‘best‐fit’ models\ndefined by equations (2) and (3). Assuming a value of 60 kJ\nmol−1 for Ec, and 42.4 kJ mol\n−1 for Eg (following Paterson\n[1994]), the ratio kc\/kg can be estimated for high and low\ndensity ranges from a plot of _bgexp(Eg\/RTav) against a0* and\na1*, using values from Table 2. The gradients of the regression\nlines (Figure B1) provide an estimate of kc\/kg = 0.0709 m s\n2\nkg−1 for low density snow and 0.0291 m s2 kg−1 for high\ndensity snow. These values were used to define the semi‐\nempirical model, equation (4). The predictions made using\nthis model are shown in Figure 6.\n[55] Assuming spherical grains with average cross‐\nsectional area 2pr2\/3, data provided by Paterson [1994] can\nbe used to estimate the grain growth coefficient as kg ≈ 1.3 ×\n10−7 m2 s−1. Thus, we obtain estimates of the creep coeffi-\ncients kc ≈ 9.2 × 10−9 kg−1 m3 s and kc ≈ 3.7 × 10−9 kg−1 m3 s\nfor low and high density snow respectively.\n[56] The remaining question is how closely the values of kc\nrecovered from our data agree with experimental values for\nthe rate of molecular diffusion in ice. According to Coble\n[1970] and Wilkinson [1988], we expect kc ≈ 13WD0\/kBT\nwith molecular volume W = 3.6 × 10−29 m3, kB = 1.38 ×\n10−23 J K−1, and D0 = 0.0011 m\n2 s−1 [Petrenko and\nWhitworth, 1999]. These values provide a laboratory‐based\nestimate kc ≈ 1.6 × 10−10 kg−1 m3 s. Our values of kc for high\nand low density snow are respectively 20, and 60 times higher\nthan this estimate.\n[57] Equation (B4) has the same form as the low‐density\npart of theHerron and Langway [1980] parameterization, and\ncan explain its low sensitivity to temperature. When consid-\nering different sites, snow deep enough to be insulated from\nseasonal changes has T ≈ Tav, so the exponential term can be\napproximated as exp(−(Ec − Eg)\/RTav). To reproduce the low\ndensity part of the Herron and Langway [1980] model with\nEc = 60 kJ mol\n−1 would require kc\/kg = 1.1 × 10\n−3 m s2 kg−1,\nand Eg = 49.8 kJ mol\n−1. Adjusting kg = 6.3 × 10\n−6 m2 s−1 to\nmatch grain growth data of Paterson [1994] for this revised\nactivation energy, gives a value of kc ≈ 6.9 × 10−9 kg−1 m3 s,\naround 40 times higher than the laboratory‐based estimate.\n[58] Our use of equation (B3) is an approximation. If\ndepartures of temperature T from the average Tav are large\nenough, or persist for long enough, it would be more accurate\nto derive the grain size by solving the coupled system B2.\n[59] Acknowledgments. We would like to thank Dougal Ranford,\nAndrew Barker and Neil Farnell, for invaluable assistance in the field.\nThanks to all at British Antarctic Survey operations for logistic support, to\nPhil Anderson, Russ Ladkin and Cathy Moore for weather station support,\nto Keith Nicholls for logger software, Triona McGrath for ice core chem-\nical analyses, and Gordon Hamilton for helpful advice. The research was\nfunded under the Natural Environment Research Council, Antarctic Funding\nInitiative.\nReferences\nAlley, R. (1987), Firn densification by grain‐boundary sliding: A 1st\nmodel, J. Phys., 48(C‐1), 249–256.\nFigure B1. Parameterization of rate constants in terms of\nmean accumulation rate _b and mean annual temperature\nTav. Values from Table 2 are shown as a0* (red circles) and\na1* (blue crosses) for the compaction of snow and firn\nwith low (≤550 kg m−3) and high (>550 kg m−3) density\nrespectively. The regression lines show a0* = 0.0709 _bgexp\n(Eg\/RTav) (red dashed) and a1* = 0.0291 _bgexp(Eg\/RTav)\n(blue solid).\nARTHERN ET AL.: SNOW COMPACTION F03011F03011\n11 of 12\nAlley, R. B., J. F. Bolzan, and I. M. Whillans (1982), Polar firn densifica-\ntion and grain growth, Ann. Glaciol., 3, 7–11.\nArthern, R., and D. Wingham (1998), The natural fluctuations of firn den-\nsification and their effect on the geodetic determination of ice sheet mass\nbalance, Clim. Change, 40(3–4), 605–624.\nBader, H. (1960), Theory of densification of snow on high polar glaciers 1,\nTech. Rep. 69, Cold Reg. Res. and Eng. Lab., Hanover, N. H.\nBader, H. (1962), Theory of densification of snow on high polar glaciers 2,\nTech. Rep. 108, Cold Reg. Res. and Eng. Lab., Hanover, N. H.\nBarnola, J., P. Pimienta, D. Raynaud, and Y. Korotkevich (1991), CO2‐\nClimate relationship as deduced from the Vostok ice core: A reexamina-\ntion based on new measurements and on a reevaluation of the air dating,\nTellus Ser. B, 43(2), 83–90.\nBlackford, J. R. (2007), Sintering and microstructure of ice: A review,\nJ. Phys. D Appl. Phys., 40(21), R355–R385, doi:10.1088\/0022-3727\/\n40\/21\/R02.\nBraithwaite, R., M. Laternser, and W. Pfeffer (1994), Variations of near‐\nsurface firn density in the lower accumulation area of the Greenland\nice‐sheet, Pakitsoq, West Greenland, J. Glaciol., 40(136), 477–485.\nBurton, B. (1993), A theoretical upper limit to Coble creep strain resulting\nfrom concurrent grain‐growth, J. Mater. Sci., 28(18), 4900–4903.\nCoble, R. (1970), Diffusion models for hot pressing with surface energy\nand pressure effects as driving forces, J. Appl. Phys., 41(12), 4798.\nColbeck, S. (1998), Sintering in a dry snow cover, J. Appl. Phys., 84(8),\n4585–4589.\nDibb, J., and M. Fahnestock (2004), Snow accumulation, surface height\nchange, and firn densification at Summit, Greenland: Insights from\n2 years of in situ observation, J. Geophys. Res., 109, D24113,\ndoi:10.1029\/2003JD004300.\nFreitag, J., F. Wilhelms, and S. Kipfstuhl (2004), Microstructure‐dependent\ndensification of polar firn derived from X‐ray microtomography,\nJ. Glaciol., 50(169), 243–250.\nFujita, S., J. Okuyama, A. Hori, and T. Hondoh (2009), Metamorphism of\nstratified firn at Dome Fuji, Antarctica: A mechanism for local insolation\nmodulation of gas transport conditions during bubble close off,\nJ. Geophys. Res., 114, F03023, doi:10.1029\/2008JF001143.\nGerland, S., H. Oerter, J. Kippstuhl, F. Wilhelms, H. Miller, and W. Miners\n(1999), Density log of a 181 m long ice core from Berkner Island,\nAntarctica, Ann. Glaciol., 29, 215–219.\nGow, A., D. Meese, and R. Bialas (2004), Accumulation variability, den-\nsity profiles and crystal growth trends in ITASE firn and ice cores from\nWest Antarctica, Ann. Glaciol., 39, 101–109.\nGray, J., and L. Morland (1995), The compaction of polar snow packs,\nCold Reg. Sci. Technol., 23(2), 109–119.\nHamilton, G., I. Whillans, and P. Morgan (1998), First point measurements\nof ice‐sheet thickness change in Antarctica, Ann. Glaciol., 27, 125–129.\nHelsen, M., M. van den Broeke, R. van de Wal, W. van de Berg, E. van\nMeijgaard, C. Davis, Y. Li, and I. Goodwin (2008), Elevation changes\nin Antarctica mainly determined by accumulation variability, Science,\n320(5883), 1626–1629, doi:10.1126\/science.1153894.\nHerron, M. M., and C. C. Langway (1980), Firn densification: An empirical‐\nmodel, J. Glaciol., 25(93), 373–385.\nJacka, T., and J. Li (1994), The steady‐state crystal size of deforming ice,\nAnn. Glaciol., 20, 13–18.\nKassner, M. E., P. Kumar, and W. Blum (2007), Harper‐Dorn creep, Int. J.\nPlast., 23(6), 980–1000, doi:10.1016\/j.ijplas.2006.10.006.\nKojima, K. (1964), Densification of snow in Antarctica, in Antarctic\nSnow and Ice Studies, Antarc. Res. Ser., vol. 2, edited by M. Mellor,\npp. 157–218, AGU, Washington, D. C.\nKotlyakov, V. M. (1961), The Snow Cover of the Antarctic and Its Role in\nthe Preset‐Day Glaciation of the Continent (in Russian), Izdatel’stvo\nAkademii Nauk SSSR, Moskva, English translation, Isr. Program for\nSci. Transl., Jerusalem, 1966.\nLi, J., and H. Zwally (2004), Modeling the density variation in the shallow\nfirn layer, Ann. Glaciol., 38, 309–313.\nMaeno, N., and T. Ebinuma (1983), Pressure sintering of ice and its impli-\ncation to the densification of snow at polar glaciers and ice sheets,\nJ. Phys. Chem., 87(21), 4103–4110.\nMcConnell, J., R. Arthern, E. Mosley‐Thompson, C. Davis, R. Bales,\nR. Thomas, J. Burkhart, and J. Kyne (2000), Changes in Greenland ice\nsheet elevation attributed primarily to snow accumulation variability,\nNature, 406(6798), 877–879.\nMulvaney, R., H. Oerter, D. Peel, W. Graf, C. Arrowsmith, E. Pasteur,\nB. Knight, G. Littot, and W. Miners (2002), 1000 year ice‐core records\nfrom Berkner Island, Antarctica, Ann. Glaciol., 35, 45–51.\nOnaka, S., A. Madgwick, and T. Mori (2001), Kinetics of diffusional creep\ndiscussed by energy dissipation and effect of grain‐size distribution on\nthe rate equations, Acta Mater., 49(12), 2161–2168.\nPaterson, W. (1994), Physics of Glaciers, 3rd ed., Pergamon, Oxford, U. K.\nPetrenko, V. F., and R. W. Whitworth (1999), Physics of Ice, Oxford Univ.\nPress, New York.\nReeh, N. (2008), A nonsteady‐state firn‐densification model for the perco-\nlation zone of a glacier, J. Geophys. Res., 113, F03023, doi:10.1029\/\n2007JF000746.\nSpencer, M., R. Alley, and T. Creyts (2001), Preliminary firn‐densification\nmodel with 38‐site dataset, J. Glaciol., 47(159), 671–676.\nWilkinson, D. (1988), A pressure sintering model for densification of polar\nfirn and glacier ice, J. Glaciol., 34, 40–45.\nWilkinson, D., and M. Ashby (1975), Pressure sintering by power law\ncreep, Acta Metall., 23(11), 1277–1285.\nWingham, D. (2000), Small fluctuations in the density and thickness of a\ndry firn column, J. Glaciol., 46(154), 399–411.\nZwally, H., and J. Li (2002), Seasonal and interannual variations of firn\ndensification and ice‐sheet surface elevation at the Greenland summit,\nJ. Glaciol., 48(161), 199–207.\nZwally, H. J., M. B. Giovinetto, J. Li, H. G. Cornejo, M. A. Beckley, A. C.\nBrenner, J. L. Saba, and D. Yi (2005), Mass changes of the Greenland\nand Antarctic ice sheets and shelves and contributions to sea‐level rise:\n1992–2002, J. Glaciol., 51(175), 509–527.\nR. J. Arthern, R. Mulvaney, A. M. Rankin, E. R. Thomas, and D. G.\nVaughan, British Antarctic Survey, Natural Environment Research\nCouncil, High Cross, Madingley Rd., Cambridge CB3 0ET, UK. (rart@\nbas.ac.uk)\nARTHERN ET AL.: SNOW COMPACTION F03011F03011\n12 of 12\n"}