{"doi":"10.1243\/0954405011518467","coreId":"53177","oai":"oai:eprints.lincoln.ac.uk:3205","identifiers":["oai:eprints.lincoln.ac.uk:3205","10.1243\/0954405011518467"],"title":"The characteristics of a high-power diode laser fired enamel coating on a carbon steel","authors":["Lawrence, Jonathan","Li, Lin"],"enrichments":{"references":[{"id":18432169,"title":"Wettability between zirconia ceramics and the liquid metals copper, nickel and","authors":[],"date":"1987","doi":"10.1007\/bf01689311","raw":"Nikopoulos, P. and Sotiropoulou, D. Wettability between zirconia ceramics and the liquid metals copper, nickel and cobalt. J. Mater. Sci. Lett., 1987, 6, 1429± 1430.","cites":null},{"id":18432167,"title":"Wettability of some metals against zirconia coatings,","authors":[],"date":null,"doi":"10.1007\/bf01729384","raw":"Ueki, M., Naka, M. and Okamoto, I. Wettability of some metals against zirconia coatings, J. Mater. Sci. Lett.,","cites":null},{"id":761134,"title":"Wettability of somemetals against zirconia coatings,","authors":[],"date":"1987","doi":"10.1007\/BF01729384","raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001","abstract":"Significant changes to the wettability characteristics of a common engineering carbon steel(EN8) were effected after high power diode laser (HPDL) surface treatment. These modifications havebeen investigated in terms of the changes in the surface roughness of the steel, the presence of any\\ud\nsurface melting, the polar component of the steel surface energy and the relative surface O2 content of the steel. The morphological and wetting characteristics of the mild steel and the enamel were determined using optical microscopy, scanning electron microscopy, X-ray photoemission spectroscopy, energy-dispersive X-ray analysis and wetting experiments by the sessile drop\\ud\ntechnique. This work has shown that HPDL radiation can be used to alter the wetting characteristics of carbon steel so as to facilitate improved enamelling. Furthermore, standard mechanical, physical and chemical testing of the HPDL-fired enamel glaze revealed the glaze to possess similar properties to those of a conventionally fired enamel glaze in terms of bond strength, rupture \/impact strength, wear and corrosion resistance. Such similar performance can be attributed to the two glazes possessing the same mechanical properties and similar amorphous structure, despite their very different firing techniques","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/53177.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/3205\/1\/Paper_25.pdf","pdfHashValue":"044623ccc968314fd65abe61ecbabda40662a8e0","publisher":"Professional Engineering Publishing","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:3205<\/identifier><datestamp>\n      2013-03-13T08:44:44Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363830<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48373030<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/3205\/<\/dc:relation><dc:title>\n        The characteristics of a high-power diode laser fired enamel coating on a carbon steel<\/dc:title><dc:creator>\n        Lawrence, Jonathan<\/dc:creator><dc:creator>\n        Li, Lin<\/dc:creator><dc:subject>\n        H680 Optoelectronic Engineering<\/dc:subject><dc:subject>\n        H700 Production and Manufacturing Engineering<\/dc:subject><dc:description>\n        Significant changes to the wettability characteristics of a common engineering carbon steel(EN8) were effected after high power diode laser (HPDL) surface treatment. These modifications havebeen investigated in terms of the changes in the surface roughness of the steel, the presence of any\\ud\nsurface melting, the polar component of the steel surface energy and the relative surface O2 content of the steel. The morphological and wetting characteristics of the mild steel and the enamel were determined using optical microscopy, scanning electron microscopy, X-ray photoemission spectroscopy, energy-dispersive X-ray analysis and wetting experiments by the sessile drop\\ud\ntechnique. This work has shown that HPDL radiation can be used to alter the wetting characteristics of carbon steel so as to facilitate improved enamelling. Furthermore, standard mechanical, physical and chemical testing of the HPDL-fired enamel glaze revealed the glaze to possess similar properties to those of a conventionally fired enamel glaze in terms of bond strength, rupture \/impact strength, wear and corrosion resistance. Such similar performance can be attributed to the two glazes possessing the same mechanical properties and similar amorphous structure, despite their very different firing techniques.<\/dc:description><dc:publisher>\n        Professional Engineering Publishing<\/dc:publisher><dc:date>\n        2001<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/3205\/1\/Paper_25.pdf<\/dc:identifier><dc:identifier>\n          Lawrence, Jonathan and Li, Lin  (2001) The characteristics of a high-power diode laser fired enamel coating on a carbon steel.  Proceedings of the Institution of Mechanical Engineers Part B: Journal of Engineering Manufacture, 215  (4).   pp. 509-519.  ISSN 0953-4054  <\/dc:identifier><dc:relation>\n        http:\/\/pep.metapress.com\/content\/y7430817j75q451u\/<\/dc:relation><dc:relation>\n        10.1243\/0954405011518467<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/3205\/","http:\/\/pep.metapress.com\/content\/y7430817j75q451u\/","10.1243\/0954405011518467"],"year":2001,"topics":["H680 Optoelectronic Engineering","H700 Production and Manufacturing Engineering"],"subject":["Article","PeerReviewed"],"fullText":"The characteristics of a high-power diode laser ® red\nenamel coating on a carbon steel\nJ Lawrence* and L Li\nLaser Processing Research Centre, Department of Mechanical Engineering, University of Manchester Institute of\nScience and Technology, UK\nAbstract: Signi® cant changes to the wettability characteristics of a common engineering carbon steel\n(EN8) were eVected after high power diode laser (HPDL) surface treatment. These modi® cations have\nbeen investigated in terms of the changes in the surface roughness of the steel, the presence of any\nsurface melting, the polar component of the steel surface energy and the relative surface O2 content\nof the steel. The morphological and wetting characteristics of the mild steel and the enamel were\ndetermined using optical microscopy, scanning electron microscopy, X-ray photoemission\nspectroscopy, energy-dispersive X-ray analysis and wetting experiments by the sessile drop\ntechnique. This work has shown that HPDL radiation can be used to alter the wetting\ncharacteristics of carbon steel so as to facilitate improved enamelling. Furthermore, standard\nmechanical, physical and chemical testing of the HPDL-® red enamel glaze revealed the glaze to\npossess similar properties to those of a conventionally ® red enamel glaze in terms of bond strength,\nrupture \/impact strength, wear and corrosion resistance. Such similar performance can be attributed\nto the two glazes possessing the same mechanical properties and similar amorphous structure,\ndespite their very diVerent ® ring techniques.\nKeywords: laser, steel, enamel, wettability, surface modi® cation, mechanical, physical, chemical, testing\nNOTATION\na constant\nb constant\nDR Wenzel type of surface roughness\nFR Cassie ± Baxter type of surface roughness\nr roughness factor\nWad work of adhesion\nWdad dispersive component of the work of adhesion\nWpad polar component of the work of adhesion\n® total surface energy\n®d dispersive component of surface energy\n®p polar component of surface energy\n®lv liquid surface energy\n®dsv dispersive component of solid substrate surface\nenergy\n®psv polar component of solid substrate surface energy\n³ contact angle\n³rad radial contact angle\n³th theoretical contact angle\n³w contact angle for the wetting of a rough surface\n1 INTRODUCTION\nThe interfacial phenomena between vitreous enamels\nand carbon steels are of great interest to scientists and\nengineers alike. This is due primarily to the fact that, in\nmany practical applications where vitreous enamels are\n® red onto carbon steels, the performance of the article\nis directly linked to the nature of the enamel ± steel inter-\nface. Many studies to investigate these phenomena have\nbeen carried out; however, they have been principally\nconcerned with the wettability of zirconia and other\noxide ceramics on metals [1 ± 5] as well as the adhesion\nof silicone sealants to aluminium [6] and the coating of\naluminium alloys with ceramic materials [7, 8]. The inter-\nfacial mechanisms investigated have centred principally\naround the thermodynamic criterion [2, 3, 5], the elec-\ntronic theory [4] and the occurrence of oxidation [1, 9].\nTo date, very little published work exists pertaining to\nthe use of lasers for altering the surface properties of\nmaterials in order to improve their wettability character-\nistics. Notwithstanding this, it is recognized within the\n509\nB00800 # IMechE 2001 Proc Instn Mech Engrs Vol 215 Part B\nThe MS was received on 14 February 2000 and was accepted after\nrevision for publication on 28 July 2000.\n*Corresponding author: Laser Processing Research Centre, Department\nof Mechanical Engineering, University of Manchester Institute of Science\nand Technology (UMIST), PO Box 88, Manchester M60 1QD, UK.\ncurrently published work that laser irradiation of a metal\nsurface can bring about changes in the metal’s wettability\ncharacteristics. Previously Zhou and de Hosson [7, 8]\ncarried out work on the laser coating of aluminium\nalloys with ceramic materials (SiO2, Al2O3, etc.), report-\ning on the well-documented fact that generated oxide\nlayers often promote metal ± oxide wetting. Further,\nHeitz et al. [10], Henari and Blau [11] and Olfert et al.\n[12] have found that excimer laser treatment of metals\nresults in improved coating adhesion. The improvements\nin adhesion were attributed to the fact that the excimer\nlaser treatment resulted in a smoother surface and as\nsuch enhanced the action of wetting. However, the\nreasons for these changes with regard to changes in the\nmaterial’s surface morphology, surface composition\nand surface energy are not reported. In contrast, in a\nmore comprehensive study by Lawrence and Li [13],\nwhich compared the eVects of CO2, Nd:YAG, excimer\nand high power diode laser (HPDL) radiation on the\nwettability characteristics of a mild steel, it was found\nthat changes in the wettability characteristics of the\nsteel varied depending on the laser type.\nThe present work details the use of a novel 1.2 kW\nHPDL to alter the wettability characteristics of a\ncommon engineering carbon steel (EN8) and the eVects\nthereof on the adhesion and bonding characteristics\nwith a vitreous enamel. The intention is to facilitate the\nhitherto impossible task of enamelling carbon steel in\nnormal atmospheric conditions without pre-treatment\nchemical cleaning of the steel. Indeed, such a process\nhas been employed by the present authors to facilitate\nthe sealing, by means of laser enamelling, of ceramic\ntile grouts [14 ± 17].\n2 EXPERIMENTAL PROCEDURES\nThe laser used in the study was a 1.2 kW HPDL (Ro® n-\nSinar, DL-012), emitting at 940 nm wavelength. The\nlaser beam was focused directly onto the samples with\na 6 £ 20mm2 rectangular beam at a ® xed power of\n500W. The laser was operated in the continuous wave\nmode. The beam was traversed across the samples by\nmounting the assembly head onto the z axis of a three-\naxis CNC table. The focused laser beam was thus ® red\nacross the surface of the mild steel, and then subse-\nquently the enamel frit, by traversing the samples\nbeneath the laser beam using the x and y axes of the\nCNC table at speeds of 250 ± 2000mm\/min, while O2\ngas was pumped into a gas box in order to assist the\nsurface treatment process.\nThe liquids used for the wetting experiments were\nhuman blood, human blood plasma, glycerol and 4-\noctanol. The test liquids, along with their total surface\nenergy (®2) as well as the dispersive (®\nd) and polar (®p)\ncomponents, are detailed in Table 1. An additional set\nof wetting experiments was conducted simply to\ndetermine the contact angle between the enamel and\nthe mild steel before and after laser treatment.\nThe solid materials used as substrates in the wetting\nexperiments were rectangular billets (50 £ 100 mm2\nwith a thickness of 3mm) of common engineering low\ncarbon mild steel (EN8). The contact surfaces of the\nmaterials were used as received in the experiments. The\nenamel used was commercially available enamel frit\n(Ferro) which, in order to form a manageable paste,\nwas mixed with 20 wt % white spirit. The composition\nof the enamel consisted mainly of the following: SiO2,\nB2O3, Na2O, Mn and small quantities of Pb, Ba, MgO,\nAl2O3 and Ni; the powder size was less than 25 mm\nmedium size. The morphological and physical character-\nistics of the mild steel and the enamel were determined\nusing optical microscopy, scanning electron microscopy\n(SEM), X-ray photoemission spectroscopy (XPS) and\nenergy-dispersive X-ray (EDX) analysis.\nThe wetting experiments were carried out in atmos-\npheric conditions at a temperature of 20 8C. The droplets\nwere released in a controlled manner onto the surface of\nthe mild steel substrate (treated and untreated) from the\ntip of a micropipette, with the resultant volume of the\ndrops being approximately 6 £ 10¡3 cm3. Each experi-\nment lasted for 3min with pro® le photographs of the\nsessile drops being obtained every minute, with the\ncontact angle subsequently being measured. The experi-\nmental results showed that throughout the period of\nthe tests no discernible change in the magnitude of the\ncontact angle occurred.\n3 GLAZE GENERATION CHARACTERISTICS\n3.1 Enamel glaze characteristics\nIt was observed that, prior to laser irradiation, it was not\npossible to ® re the enamel onto the as-received surface of\nthe mild steel. Indeed, laser interaction with the enamel\nwhen it was placed on the untreated mild steel surface\nsimply resulted in the `balling’ of the enamel (the forma-\ntion of small spheres approximately the diameter of the\nlaser beam itself). Such observations are in accord with\nthose of Bourell et al. [18] and Agarwala et al. [19],\nwho noted the balling phenomenon during laser sintering\nwork of silica-based materials. After HPDL surface\nTable 1 Total surface energy (®lv) and the dispersive (®\nd\nlv) and\npolar (®\np\nlv) components for the selected test liquids\n[15]\n® ®dlv ®\np\nlv\nLiquid (mJ\/m2) (mJ\/m2) (mJ\/m2)\nHuman blood 47.5 11.2 36.3\nHuman blood plasma 50.5 11.0 39.5\nGlycerol 63.4 37.0 26.4\n4-Octanol 27.5 7.4 20.1\n510 J LAWRENCE AND L LI\nProc Instn Mech Engrs Vol 215 Part B B00800 # IMechE 2001\ntreatment of the mild steel, however, it was possible to\n® re the enamel directly onto the mild steel. The mechan-\nism of this phenomenon is based entirely on the wettabil-\nity characteristics of the mild steel.\nFigure 1 shows the typical surface morphology of the\nHPDL-® red enamel glaze on the mild steel. The glaze\nwas typically slightly undulating, with the undulations\nbeing regular in both periodicity and intensity. The\nthickness of the glaze was regular across the surface,\nbeing typically around 450 mm. Moreover, the glaze\ndisplayed no cracks or porosities. Such glazes could be\ngenerated within a small laser parameter operating\nwindow of 1.75 ± 2.5 kW\/cm2 power density and 480 ±\n600 mm\/min traverse speed.\n3.2 Contact angle and wettability characteristics\nWhen a drop of liquid is in contact with a solid surface,\nthe ® nal shape taken by the drop, and thus whether it will\nwet the surface or not, depends on the relative magni-\ntudes of the molecular forces that exist within the\nliquid (cohesive) and between the liquid and the solid\n(adhesive) [20]. The index of this eVect for an ideal sur-\nface is the contact angle, ³, which the liquid subtends\nwith the solid. The adhesion intensity of a liquid to a\nsolid surface is known as the work of adhesion, Wad,\nand is related to the liquid surface energy, ®lv, by the\nYoung ± Dupre equation:\nWad ˆ ®lv…1 ‡ cos ³† …1†\nIt is important to consider also the in¯ uence of the sub-\nstrate surface roughness on the wetting contact angle.\nRough grooves on a surface, which may contribute to\nthe in¯ uence of contact angles, can be categorized as\neither radial or circular grooves. Any practical rough\nsurface can be represented by a combination of these\ntwo cases [21]. In fact two roughness parameters can be\nde® ned: the Wenzel type, DR [22], and the Cassie ±\nBaxter type, FR [23]. In the case that wetting spreads\nradially, as is the likely case with the mild steel, then\nthe resulting radial contact angle, ³rad, is related to the\ntheoretical contact angle, ³th, by\ncos ³rad ˆ DR…1 ¡ FR† cos ³th ¡ FR …2†\nAccording to Neumann and Good [24], only if FR is\nequal to zero can a model similar to that for hetero-\ngeneous solid surfaces be developed in order to account\nfor surface irregularities, being given by Wenzel’ s\nequation:\nr…®sv ¡ ®sl† ˆ ®lv cos ³w …3†\nwhere r is the roughness factor de® ned as the ratio of the\nreal and apparent surface areas and ³w is the contact\nangle for the wetting of a rough surface. It is important\nto note that Wenzel’ s treatment is only eVective at the\nposition of the wetting triple line [21]. Nevertheless,\nequation (3) shows clearly that the in¯ uence of surface\nroughness on the contact angle is to cause an increase\nin the contact angle. Thus, the smoother the contact sur-\nface is, then the smaller the contact angle will be.\nOptical micrographs of a sessile drop of enamel (20 8C)\nplaced on the surface of the mild steel before and after\nHPDL irradiation with the contact angle superimposed\nare shown in Figs 2a and 2b respectively. As one can\nsee from Fig. 2, HPDL irradiation of the mild steel\nsurface eVected a considerable reduction in the enamel\ncontact angle.\nOne explanation for this observed reduction in the\nenamel contact angle is that the surface obtained after\nlaser treatment was somewhat smoother than the origi-\nnal untreated surface. The mean surface roughness (Ra)\nvalue of the surface of the as-received mild steel was\n1.46 mm, while for the HPDL-treated mild steel surface\nthe mean Ra value was 1.12mm. Similar laser-induced\nsurface smoothing eVects were obtained by Nicolas\net al. [25] and Henari and Blau [11], who observed that\nexcimer laser treatment of ceramics and metals could\nresult in the generation of a smoother surface. Thus,\naccording to equation (2), the smoother surface will\ninherently result in a reduction in the contact angle.\nIndeed, this fact is borne out somewhat by Fig. 3,\nwhich shows that the surface condition of the mild\nsteel resulting from HPDL modi® cation (with a\nnumber of diVerent traverse speeds) greatly aVected the\nmeasured contact angle.\nAs can be seen from Fig. 3, at relatively low traverse\nspeeds excess energy is deposited on the surface of the\nmild steel resulting in a high level of surface melting.\nThis in turn causes porosities and a generally rough\nsurface pro® le. As the traverse speed increases, however,\nthe energy deposited on the surface of the mild steel\ndecreases. Accordingly the degree of surface melting\ndecreases ultimately to the optimum degree, resulting\n1mm\nFig. 1 Typical surface morphology of the HPDL-® red enamel\nglaze on the mild steel (2 kW\/cm2 power density,\n480 mm\/min traverse speed)\nTHE CHARACTERISTICS OF A HIGH-POWER DIODE LASER FIRED ENAMEL COATING 511\nB00800 # IMechE 2001 Proc Instn Mech Engrs Vol 215 Part B\nin the minimum surface roughness, and contact angle, at\naround 1500mm\/min. Beyond this point the surface\nroughness, and contact angle, can be seen to increase,\nindicating that insuYcient melting, and consequently\nsmoothing, was achieved.\nSuch results are in accord with those obtained by Feng\net al. [26], who noted that, under certain surface condi-\ntions, contact angle reduction was inversely proportional\nto surface roughness. Moreover, Olfert et al. [12] found\nthat excimer laser treatment of steel surfaces greatly\nimproved the adhesion of a zinc coating. They asserted\nthat laser treatment occasioned the smoothing of many\nof the high frequency surface features, resulting in\nmore complete wetting by the zinc.\nIn addition, the improvement in the wetting action\nexperienced by the mild steel can be ascribed in some\npart to the increase in the surface O2 content of the\nmild steel following HPDL treatment, since this is\nknown to increase the likelihood of wetting [1, 9].\nIndeed, since wetting is governed by the ® rst atomic\nlayers of the surface of a material, the O2 content at\nthe surface of the mild steel before and after HPDL treat-\nment was determined using XPS. The surface O2 content\nwas found to have increased after HPDL treatment from\n34 to 40 at%. Clearly, oxidization of the HPDL-treated\nsurface of the mild steel has occurred, thus indicating\nthat O2 enrichment of the laser-treated mild steel surface\nwas active in promoting wetting and adhesion [1, 9].\n3.3 Mild steel surface energy and its dispersive ± polar\ncharacteristics\nThe intermolecular attraction which is responsible for\nsurface energy, ®, results from a variety of intermolecular\nforces whose contribution to the total surface energy is\n=640 =230\n(a) (b)\nFig. 2 Contact angles for the enamel on (a) the as-received mild steel surface and (b) the HPDL-treated mild\nsteel surface (1500mm\/min traverse speed)\nFig. 3 Relationship between surface roughness, contact angle and traverse speed for the mild steel\n512 J LAWRENCE AND L LI\nProc Instn Mech Engrs Vol 215 Part B B00800 # IMechE 2001\nadditive [27]. The majority of these forces are functions\nof the particular chemical nature of a certain material,\nand as such the total surface energy (®) comprises ®p\n(polar or non-dispersive interaction) and ®d (dispersive\ncomponent). Therefore, the surface energy of any\nsystem may be described by [15]\n® ˆ ®d ‡ ®p …4†\nAs such,Wad can be expressed as the sum of the diVerent\nintermolecular forces that act at the interface [27]:\nWad ˆ Wdad ‡Wpad ˆ 2…®dsv®dlv†1=2 ‡ 2…®psv®plv†1=2 …5†\nBy equating equation (5) with equation (1), the contact\nangle for solid ± liquid systems can be related to the sur-\nface energies of the corresponding liquid and solid by\ncos ³ ˆ 2…®\nd\nsv®\nd\nlv†1=2 ‡ 2…®psv®plv†1=2\n®lv\n¡ 1 …6†\nIt is possible to estimate the dispersive component of the\nmild steel’s surface energy, ®dsv, by using equation (6) and\nplotting the graph of cos ³ against (®dlv†1=2=®lv (Fig. 4).\nThus the value of ®dsv is estimated by the gradient\n‰ˆ 2…®dsv†1=2Š of the line which connects the origin\n…cos ³ ˆ ¡1† to the intercept point of the straight line\n[cos ³ against (®dlv†1=2=®lv] correlating the data point\nwith the abscissa at cos ³ ˆ 1 [28]. The value of ®dsv for\nthe untreated and HPDL-treated (1500mm\/min traverse\nspeed) mild steel is shown in Table 2. From the best-® t\nplots of cos ³ against (®dlv†1=2=®lv, it was found that the\nordinate intercept point of the untreated mild steel ±\nliquid system was closer to cos ³ ˆ ¡1 than that of the\nHPDL-treated mild steel ± liquid system. This indicates\nthat, in principle, dispersion forces are acting mainly at\nthe mild steel ± liquid interface, resulting in poor adhesion\n[28, 29]. In contrast, the best-® t straight line for the\nHPDL-treated mild steel ± liquid system intercepted the\nordinate considerably higher above the origin. This is\nindicative of the action of polar forces across the inter-\nface, in addition to dispersive forces, and hence improved\nwettability and adhesion is promoted [28, 29].\nIt is not possible to determine the value of the polar\ncomponent of the mild steel’s surface energy, ®psv, directly\nfrom plots of cos ³ against …®dlv†1=2=®lv. This is because the\nintercept of the straight line [cos ³ against …®dlv†1=2=®lv] is\nat 2…®psv®plv†1=2=®lv, and thus refers only to individual\ncontrol liquids and not to the control liquid system.\nHowever, it has been established that the entire amount\nof the surface energies due to dispersion forces either of\nthe solids or the liquids is active in the wettability perfor-\nmance [28, 30]. It is therefore possible to calculate the\ndispersive component of the work of adhesion, Wdad,\nusing only the relevant part of equation (5) thus:\nWdad ˆ 2…®dsv®dlv†1=2 …7†\nThe results revealed that, for each particular control\nliquid in contact with both the untreated and laser\nFig. 4 Plot of cos ³ against …®dlv†1=2=®lv for the untreated and HPDL-treated mild steel in contact with the\nwetting test control liquids\nTable 2 Determined surface energy values for the mild steel\nbefore and after laser irradiation\nSurface energy\ncharacteristic\nUntreated mild\nsteel (mJ\/m2)\nHPDL-treated mild\nsteel (mJ\/m2)\nDispersive component, ®dsv 64.6 66.2\nPolar component, ®psv 4.2 6.6\nTHE CHARACTERISTICS OF A HIGH-POWER DIODE LASER FIRED ENAMEL COATING 513\nB00800 # IMechE 2001 Proc Instn Mech Engrs Vol 215 Part B\ntreated mild steel surfaces,Wad could be correlated with\nWdad by the straight line relationship\nWad ˆ aW dad ‡ b …8†\nwhere a and b are constants unique to each control liquid\nsystem. Also, for the control test liquids used, a linear\nrelationship between the dispersive and polar compo-\nnents of the control test liquids surface energies has\nbeen deduced which satis® es the equation\n…®plv†1=2 ˆ 1:3…®dlv†1=2 ‡ 1:15 …9†\nBy introducing equation (8) into equation (5) and re-\narranging,\nWpad ˆ …a ¡ 1†Wdad ‡ b …10†\nBy combining equation (10) with equation (5) and diVer-\nentiating with respect to …®dlv†1=2, the following can be\nderived:\n…®psv†1=2 ˆ\n…®dsv†1=2…a ¡ 1†\n1:3\n…11†\nFrom a plot of the linear relationship between Wadand\nWdad, a (the gradient of the relationship between Wad\nand Wdad) was determined for the untreated and laser-\ntreated mild steel. Since ®dsv has already been determined\nfor the untreated and laser-treated mild steel from the\nplots of equation (6), it is possible to calculate ®psv for\nuntreated and laser-treated mild steel using equation\n(11) (see Table 2).\nAs Table 3 shows clearly, HPDL treatment of the sur-\nface of the mild steel has led to a small increase in the\npolar component of the surface energy,®psv, thus improv-\ning the action of wetting and adhesion. It is surmised that\nthis increase may be due to HPDL-induced changes in\nthe surface microstructure of the mild steel.\nIt is important to note that, because of the long-range\nionic interactions in the mild steel and the nature of the\ninterfaces between the mild steel and the control liquids,\nit is highly likely that the thermodynamically de® ned\ntotal solid surface energy, ®2, as de® ned in equation\n(4), will be higher than the sum of the dispersive, ®d,\nand the polar, ®p, components of the surface energy.\nAlthough the increase in (excess) surface free energy\nwill probably be less than the increase in the total lattice\nenergy, on the other hand an absorbed liquid layer may\nshield the ionic ® elds substantially. As such, all the data\nderived from equations (5) to (11) should be considered\nas being semi-empirical. Notwithstanding this, as the\nstudies by Gutowski et al. [6] and Agathopoulos and\nNikolopoulos [27] found, it is reasonable to conclude\nfrom the data obtained from equations (5) to (11) that\nHPDL treatment of the mild steel surface has caused a\nsmall increase in the polar component, ®p, of the surface\nenergy.\n3.4 Bonding mechanisms\nOn the basis of the nature of the attractive forces existing\nacross a liquid± solid interface, wetting can be classi® ed\ninto the two broad categories of physical wetting and\nchemical wetting. In physical wetting the attractive\nenergy required to wet a surface is provided by the rever-\nsible physical forces (van der Waals). In chemical wetting\nadhesion is achieved as a result of reactions occurring\nbetween the mating surfaces, giving rise to chemical\nbonds [31].\nIn practice, complex combinations of various bonding\nmechanisms actually occur, varying according to the\ntypes of materials used [31]. For the mild steel and the\nenamel, the mechanisms involved in the bonding are\nprincipally physical bonding (van der Waals forces),\nmechanical bonding, chemical bonding (oxide trans-\nformation and O2 bridging) and, on a very small scale,\nelectrochemical reactions such as the electrolytic\n(redox) eVect due to the presence of ferric oxides within\nthe mild steel reacting with other oxides in the enamel\n[31]. Invariably, the preponderant bonding mechanisms\nbetween mild steels and enamels are physical and\nmechanical bonding [32]. However, an EDX analysis\nconducted at the interface between the mild steel and\nthe enamel revealed the presence of a small diVusion\nregion which contained elements unique to both the\nmild steel and the enamel. This is perhaps to be expected\nsince enamel glazes on steels are typically bonded as a\nresult of some of the base material dissolving into the\nglaze [31], with wetting characteristics often being\nachieved or enhanced by a reaction at the interface at\nan elevated temperature [33]. Indeed, when an oxide\nlayer is present on the surface of a metal, as was the\ncase for the HPDL-treated mild steel, then typically the\n® red enamel dissolves this oxide layer. Subsequently a\nredox reaction has to occur at the interface to form\nmore metal oxide [33]. In the case of the HPDL-treated\nmild steel and the enamel, which is an Fe± CoO±\nsodium silicate glass system, because the oxidation\npotential for Fe is higher than that for Co, the redox\nreaction forms FeO at the interface. Thus a layer of\nFeO continually remains at the interface and acts as\nTable 3 Measured wettability characteristic values for the\nmild steel before and after HPDL treatment\n(1500 mm\/min traverse speed)\nCharacteristics\nUntreated\nmild steel\nHPDL-treated\nmild steel\nContact angle (deg) 64 23\nSurface roughness (Ra) (mm) 1.46 1.12\nRelative O2 content (%) 34 40\nDispersive component, ®dsv (mJ\/m\n2) 64.6 66.2\nPolar component, ®psv (mJ\/m\n2) 4.2 6.6\n514 J LAWRENCE AND L LI\nProc Instn Mech Engrs Vol 215 Part B B00800 # IMechE 2001\nthe compatible oxide phase that provides the chemical\nbonding between the HPDL-treated mild steel and the\nenamel [33]. In addition, intrinsic within the redox\nreaction formation of FeO is the alloying of the Fe\nwith the reduced Co to form dendrites in the interfacial\nzone by means of a microgalvanic cell mechanism [32,\n33]. Furthermore, this alloying has a negative free\nenergy which therefore contributes to the driving force\nfor the net redox reaction formation of FeO [33].\nAs one can see from Fig. 5, it is not possible to discern\nany dendritic growth within the enamel glaze in the bond\nregion, which is characteristic of enamels ® red onto\nsubstrates containing Fe, Si and in particular Co [32].\nHowever, it can be seen that enamel is held ® rm in the\nsurface irregularities, thus ensuring sound adhesion.\nAgain, such mechanical bonding is typical of enamel\nglazes on metals [32].\n4 MECHANICAL, PHYSICAL AND CHEMICAL\nCHARACTERISTICS\n4.1 Bond strength\nTo determine the strength of the bond between the con-\nventionally ® red and HPDL-® red enamel glazes, pull-oV\ntests based on ASTM C 313-59 [34] were conducted as\nshown in Fig. 6. For the tests, small samples were pre-\npared (20 mm £ 20mm). Highly tensile aluminium test\ndollies were then attached on to both the glazed surface\n12000x 1 m \nedtelStraeHPDLiredaele\nFig. 5 Typical cross-sectional SEM image of the bond region between the enamel and the HPDL-treated mild\nsteel\n \n \n \n \n \nMovable jaw\nTest dollies\nFixed jaw\nHPDL\/conventionally fired enamel glaze\nSteel substrate\nFixed base\nFig. 6 Schematic of the experimental set-up for the pull-oV tests\nTHE CHARACTERISTICS OF A HIGH-POWER DIODE LASER FIRED ENAMEL COATING 515\nB00800 # IMechE 2001 Proc Instn Mech Engrs Vol 215 Part B\nand to the axially opposite steel substrate surface using\nAraldite epoxy and left to cure for 24 h. In order to\nensure axial accuracy (essential for true results), the\ntest dollies were set in position using identical V-\nblocks. The samples were placed into an Instron 4507\ntensile\/compressive test rig by mounting the test dollies\ninto the jaws of the rig. A tensile force was then applied\nuntil failure with the energy being simultaneously\nrecorded.\nThe mean maximum bond strength of the convention-\nally ® red enamel glaze was recorded as 77MPa, while\nthat of the HPDL-generated glaze was 70MPa, as\nshown in Table 4. In addition, no discernible diVerence\nin the results obtained was observed within the optimum\nlaser operating parameters, indicating that neither the\npower density nor the traverse speed in¯ uenced the\nbond strength of the enamel glaze. Furthermore, a\npost-test analysis of both the conventionally ® red and\nthe HPDL-® red enamel glazes revealed that the glazes\nfailed mainly around the enamel ± steel interface. How-\never, as is typical of well-bonded enamel glazes on steel\nsubstrates, small amounts of the enamel glaze remained\nbonded to the steel. Notwithstanding this, according to\nVargin [32] it is still reasonable to assume that bond\nstrength values obtained are valid, since most of the\nglaze failed at the interface rather than within the glaze\nitself.\nIt is proposed that the close agreement of the recorded\nmean maximum bond strength of the conventionally\n® red and the HPDL-generated enamel glazes can be\nattributed to the fact that the HPDL-generated glaze\ndisplayed bonding mechanisms similar to those of a con-\nventionally ® red glaze.\n4.2 Rupture\/impact strength\nTests were conducted to determine the rupture\/impact\nstrength of the conventionally ® red and HPDL-® red\nenamel glazes. The tests were carried out as shown in\nFig. 7, while the test samples were prepared as described\nabove. The samples were placed onto the sample stage of\nthe Instron 4507 tensile\/compressive test rig and then\nsubjected to a compressive rupture\/impact force until\nthe enamel glazes failed (cracked), with the energy\nbeing simultaneously recorded. The rupture\/impact\nforce was applied by means of a highly tensile steel inden-\nter with a 1mm radius point.\nThe results of the tests are given in Table 4. As can be\nseen, there was little diVerence in the recorded values of\naverage rupture strength for the conventionally ® red\nenamel glaze and the HPDL-generated glaze, 4.8 and\n4.3 J respectively. Again, no discernible diVerence in\nthe results obtained was observed within the optimum\nlaser operating parameters, indicating that neither the\npower density nor the traverse speed in¯ uenced the\nrupture\/impact strength of the enamel glaze.\nIt is suggested that such similar values of rupture\/\nimpact strength were the result of both the convention-\nally ® red and the HPDL-generated glaze possessing\nvery similarly shaped cross-sections, that is a ¯ at inter-\nface with the steel substrate and an almost ¯ at upper\nsurface. Indeed, the relatively small diVerence between\nthe recorded rupture\/impact strengths of the convention-\nally ® red and HPDL-generated glazes is probably due\nmainly to the fact that the upper surface of the HPDL-\n® red glaze exhibited a very slightly concave surface\ngeometry. Thus, the strains within the enamel layer\nwere marginally higher and thus reduced the strength\nin comparison with an enamel seal with a ¯ at upper\nTable 4 Recorded values for selected mechanical and physical\nproperties of a conventional and an HPDL-® red\nenamel glaze\nEnamel glaze ® ring technique\nMechanical physical property Conventional HPDL\nMean bond strength (MPa) 77 70\nMean rupture\/impact strength (J) 4.8 4.3\nMean surface roughness (Ra) (mm) 0.55 1.88\nWear (after 8 h) (mg\/cm2) 93 85\n \nTensile steel indenter\nFixed jaw\nHPDL\/conventionally fired enamel glaze\nSteel substrate\nFixed base\nTest dolly\nMovable jaw\nFig. 7 Schematic of the experimental set-up for the rupture\/impact tests\n516 J LAWRENCE AND L LI\nProc Instn Mech Engrs Vol 215 Part B B00800 # IMechE 2001\nsurface pro® le, as was the case with the conventionally\n® red enamel glaze [32].\n4.3 Surface roughness\nAn important feature of any enamel glaze is its surface\nroughness, since it is this property that invariably deter-\nmines the functionality and cleanability of the surface.\nUsing a Taylor-Hobson Surtronic 31 surface texture\nmeasuring instrument, a series of measurements was\ntaken on the conventionally ® red and HPDL-® red\nenamel glazes. On each sample four measurements\nwere made in diVerent positions and in diVerent direc-\ntions on the surface, with an average being taken.\nTable 4 summarizes the surface roughness (Ra) measure-\nment results.\nAs is apparent from Table 4, the surface roughness of\nthe conventionally ® red enamel glaze was signi® cantly\nless than that of the HPDL-® red enamel glaze, 0.55 mm\ncompared with 1.88 mm respectively. Clearly, in this\nsituation the surface roughness, and therefore the clean-\nability, of the conventionally ® red enamel glaze will be\nconsiderably better. It is believed that this variation in\nsurface roughness is due to the vastly diVerent ® ring\ntimes of the two processes (hours in the conventional\nmanner and seconds for the HPDL technique) and the\nparticle size of the enamel frit itself. Since the ® ring\ntimes are somewhat ® xed, it is postulated that the prob-\nlem of a rougher surface resulting from the HPDL tech-\nnique could be overcome by using smaller enamel\nparticles, an approach that would not greatly improve\nthe result when ® ring in the conventional manner.\n4.4 Wear life\nPrimarily, the wear resistance of a material is in general\ndetermined by the hardness of the material in compari-\nson with the hardness of other materials with which it\nsubsequently comes into contact [35]. However, wear\nresistance does not always increase with hardness [36].\nTests were therefore conducted in accordance with the\nprocedure detailed by Lawrence and Spencer [16],\nbased on ASTM C 448-64 [37], to determine the exact\ndiVerence in the wear resistance characteristics of the\nconventionally ® red and the HPDL-generated enamel\nglazes (Fig. 8). For experimental purposes the glazed\nsamples were cut into smaller pieces (25mm £ 25mm).\nAll the samples were then weighed and subjected to a\nfriction force for 8 h, being removed from the machine\nand weighed at 2 h intervals.\nFigure 9 shows the relationship between weight loss\nand the friction time for the laser-generated OPC glazes\nand the untreated OPC. As is evident from Fig. 9, both\nglazes displayed an exceedingly high degree of wear\nresistance. Further, practically no diVerence in the wear\nresistance of the two glazes was observed. Arguably,\nthis indicates that the two glazes possess the same\nmechanical properties and similar amorphous structure,\ndespite their very diVerent ® ring techniques. This is, per-\nhaps, a valid argument when one considers the previous\n® ndings of this work.\n4.5 Corrosion resistance\nEnamelled surfaces are often subjected to corrosive sub-\nstances, as part of the normal service environment and\/\nor as a result of routine cleaning. Corrosion resistance\ntests based on BS 6428 [38] were therefore conducted\nusing nitric acid, sodium hydroxide and Premier\nProducts MP9 detergent cleaner. The experiments were\ncarried out by dropping small amounts of the corrosive\nagents, in the concentration ratios of 80, 60, 40, 20 and\n10 per cent, onto the surfaces of the conventionally\n® red and HPDL-generated enamel glazes at hourly inter-\nvals for 4 h. The samples were then examined optically\nand mechanically tested in terms of bond strength, rup-\nture\/impact strength and wear life. High concentrations\nof the various corrosive agents were used principally to\naccelerate the tests.\nBoth the conventionally ® red and the HPDL-\ngenerated enamel glazes displayed complete resistance\nto all three substances, even at the highest concentra-\ntions. However, perhaps more importantly, even when\nexposed to the highest concentrations, no discernible\neVect on the bond strength, rupture\/impact strength\nand wear life of either enamel glaze was observed.\n6 mm\n180 mm\/min\nF = 60 N \nFloating machine head\nRubber abrader\nHPDL\/conventionally\nfired enamel glaze\nSteel substrate\nVice\nMachine bed\nFig. 8 Schematic of the experimental set-up for the wear tests\nTHE CHARACTERISTICS OF A HIGH-POWER DIODE LASER FIRED ENAMEL COATING 517\nB00800 # IMechE 2001 Proc Instn Mech Engrs Vol 215 Part B\nFurthermore, no discernible microstructural changes or\nsigns of devitri® cation due to corrosion were seen in\neither glaze. Again, this is perhaps a strong indication\nthat the two glazes possess a similar amorphous struc-\nture, despite their very diVerent ® ring techniques.\n5 CONCLUSIONS\nHPDL surface treatment of the mild steel eVected signi® -\ncant changes in the wettability characteristics of the mild\nsteel. Moreover, the HPDL surface treatment made it\npossible to ® re an enamel glaze directly onto the EN8\ncarbon steel substrate in normal atmospheric conditions\nafter HPDL surface pre-treatment, but without pre-\ntreatment chemical cleaning of the steel. Furthermore,\nthrough the employment of the HPDL, the whole\nenamel ® ring process was reduced from one taking\nhours to complete to one that was complete in minutes.\nTable 4 summarizes the eVects of HPDL surface treat-\nment on the steel. Improvements in the wetting action\nof the mild steel after HPDL treatment were identi® ed\nas being due to (a) the HPDL-induced melting of the\nmild steel surface which brought about a reduction of\nthe surface roughness, thus directly reducing the contact\nangle,³, (b) the small increase in the polar component of\nthe surface energy,®psv, after HPDL treatment (which is\nthought to be due to the HPDL-eVected microstructural\nchanges), thus improving the action of wetting and\nadhesion, and (c) the increase in the surface O2 content\nof the mild steel resulting from HPDL treatment identi-\n® ed as further promoting the action of wetting.\nMechanical, physical and chemical testing of the\nHPDL-® red enamel glaze revealed the glaze to possess\nsimilar properties to those of a conventionally ® red\nenamel glaze. The mean average bond strength of the\nHPDL-® red enamel glaze was recorded as 70MPa; this\ncompares with 77MPa for a conventionally ® red\nenamel glaze. The average rupture strength for the con-\nventionally ® red enamel glaze and the HPDL-generated\nglaze were recorded as 4.8 and 4.3 J respectively. Excep-\ntional wear and corrosion resistance was displayed by\nboth the HPDL- and the conventionally ® red enamel\nglazes, with both only wearing by around 2.8mg\/cm2\nafter 8 h and both showing complete resistance to\nacid, alkali and detergent attack. It is believed that\nsuch results are due to the two glazes possessing the\nsame mechanical properties and similar amorphous\nstructure, despite their very diVerent ® ring techniques.\nThe surface roughness, however, of the conventionally\n® red enamel glaze was signi® cantly less than that of the\nHPDL-® red enamel glaze, 0.55 mm compared with\n1.88 mm respectively. It is believed that this variation in\nsurface roughness is due to the vastly diVerent ® ring\ntimes of the two processes (hours in the conventional\nmanner and seconds for the HPDL technique) and the\nparticle size of the enamel frit itself. It is postulated\nthat the problem of a rougher surface resulting from\nthe HPDL technique could be overcome by using smaller\nenamel particles.\nREFERENCES\n1 Ueki, M., Naka, M. and Okamoto, I. Wettability of some\nmetals against zirconia coatings, J. Mater. Sci. Lett.,\n1986, 5, 1261 ± 1262.\n2 Nikopoulos, P. and Sotiropoulou, D. Wettability between\nzirconia ceramics and the liquid metals copper, nickel and\ncobalt. J. Mater. Sci. Lett., 1987, 6, 1429 ± 1430.\nFig. 9 Relationship between mass loss and friction time for the conventionally ® red and HPDL-generated\nenamel glazes\n518 J LAWRENCE AND L LI\nProc Instn Mech Engrs Vol 215 Part B B00800 # IMechE 2001\n3 Chidambaram, P. R., Edwards, G. R. and Olson, D. L. A\nthermodynamic criterion to predict wettability at metal±\nalumina interfaces.Metallurgical Trans. B, 1992, 23, 215± 222.\n4 Li, J. G.Role of electron density of liquid metals and band-\ngap energy of solid ceramics on the work of adhesion and\nwettability of metal± ceramic systems. J. Mater. Sci. Lett.,\n1992, 11, 903± 905.\n5 Li, J. G. Chemical trends in the thermodynamic adhesion of\nmetal\/ceramic systems. Mater. Lett., 1995, 22, 169± 174.\n6 Gutowski, V. W., Russell, L. and Cerra, A. Adhesion of\nsilicone sealants to organic-coated aluminium. In Science\nand Technology of Building Seals, Sealants, Glazing and\nWaterprooWng (Ed. J. M. Klosowski), 1992, pp. 144 ± 159\n(American Society for Testing and Materials, Philadelphia,\nPennsylvania).\n7 Zhou, X. B. and de Hosson, J. Th. M. Microstructure and\ninterfaces of a reaction coating on aluminium alloys by\nlaser processing. J. Phys. Paris, IV, 1993, 3, 1007 ± 1011.\n8 Zhou, X. B. and de Hosson, J. Th. M. Metal± ceramic\ninterfaces in laser coated aluminium alloys. Acta Metall.\nMater., 1994, 42, 1155 ± 1162.\n9 Li, J. G. Microscopic approach of adhesion and wetting of\nliquid metal on solid ionocovalent oxide surface. Rare\nMetals, 1993, 12, 84 ± 96.\n10 Heitz, J., Arenholz, E., Kefer, T., BaÈ uerle, D., Hibst, H. and\nHagemeyer, A. Enhanced adhesion of metal ® lms on PET\nafter uv-laser treatment. Appl. Phys. A, 1992, 55, 391± 392.\n11 Henari, F. and Blau, W. Excimer laser surface treatment of\nmetals for improved adhesion.Appl. Opt., 1995, 34, 581± 584.\n12 Olfert, M., Duley, W. and North, T. Laser treatment for\nadhesive bonding in coated steels. In Laser Processing (Ed.\nJ. Mazumder), 1996, pp. 479 ± 490 (Kluwer, Amsterdam).\n13 Lawrence, J. and Li, L.Wettability characteristics of a mild\nsteel modi® ed with CO2, Nd:YAG, excimer and high power\ndiode lasers. J. Phys. D, 1999, 32, 2311 ± 2318.\n14 Lawrence, J., Li, L. and Spencer, J. T. Ceramic tile grout\nremoval and tile sealing using high power lasers. In Pro-\nceedings of ICALEO’96 on Laser Materials Processing,\nDetroit, Michigan, 1996, pp. 138 ± 148 (Laser Institute of\nAmerica, Orlando, Florida).\n15 Lawrence, J., Li, L. and Spencer, J. T. A two-stage ceramic\ntile grout sealing process using a high power diode laser.\nPart I: grout development and materials characteristics.\nOpt. Laser Tech., 1998, 30, 205± 214.\n16 Lawrence, J., Li, L. and Spencer, J. T. A two-stage ceramic\ntile grout sealing process using a high power diode laser.\nPart II: mechanical, chemical and physical properties.\nOpt. Laser Tech., 1998, 30, 215± 223.\n17 Lawrence, J. PhD thesis, University ofManchester Institute\nof Science and Technology, 1999.\n18 Bourell, D. L., Marcus, H. L., Barlow, J. W. and Beaman,\nJ. J. Selective laser sintering of metals and ceramics. Int.\nJ. Powder Metall., 1992, 28, 369± 381.\n19 Agarwala, M., Bourell, D. L., Beaman, J. J., Marcus, H. L.\nand Barlow, J. W. Direct laser sintering of metals. Rapid\nPrototyping J., 1995, 1, 26 ± 36.\n20 Jaycock, M. J. and Par® tt, G. D. Chemistry of Interfaces,\n1984 (John Wiley, London).\n21 Wenzel, R. N. Resistance of solid surfaces to wetting by\nwater. Ind. Engng Chem., 1936, 28, 988± 994.\n22 Cassie, A. B. D. and Baxter, S. Wettability of porous\nsurfaces. Trans. Faraday Soc., 1944, 40, 546± 551.\n23 Zhou, X. B. and de Hosson, J. Th. M. In¯ uence of surface\nroughness on the wetting angle. J. Mater. Res., 1995, 10,\n1984± 1992.\n24 Neumann, A. W. and Good, R. J. Thermodynamics of\ncontact angles. I: heterogeneous solid surfaces. J. Colloid\nInterface Sci., 1972, 38, 341± 358.\n25 Nicolas, G., Autric, M., Marine, W. and Shafeev, G. A.\nLaser induced surface modi® cations on ZrO2 ceramics.\nAppl. Surf. Sci., 1997, 109± 110, 289± 292.\n26 Feng, A., McCoy, B. J., Munir, M. A. and Cagliostro, D.\nWettability of transition metal oxide surfaces. Mater. Sci.\nEngng A, 1998, 1± 2, 50 ± 56.\n27 Agathopoulos , S. and Nikolopoulos, P. Wettability and\ninterfacial interactions in bioceramic-body± liquid systems.\nJ. Biomed. Mater. Res., 1995, 29, 421± 429.\n28 Fowkes, F. M. Attractive forces at interfaces. Ind. Engng\nChem., 1964, 56, 40 ± 52.\n29 Chattoraj, D. K. and Birdi, K. S. Adsorption and the Gibbs\nSurface Excess, 1984, p. 95 (Plenum, New York).\n30 Girifalco, L. A. and Good, D. J.A theory for the estimation\nof surface and interfacial energies. III: estimation of surface\nenergies of solids from contact angle data. J. Phys. Chem.,\n1960, 64, 561± 565.\n31 Greenhut, V. A. Surface considerations for joining ceramics\nand glasses. In Engineered Materials Handbook: Adhesives\nand Sealants (Ed. H. F. Brinson), 1991, pp. 298 ± 311\n(ASM International, Metals Park, Ohio).\n32 Vargin, V. V. Technology of Vitreous Enamels, 1968\n(Academic, New York).\n33 Pask, J. A. and Tomisa, A. P. Wetting, surface energies,\nadhesion and interface reaction thermodynamics. In Engi-\nneered Materials Handbook: Ceramics and Glasses (Ed.\nS. J. Schneider), 1991, pp. 482 ± 492 (ASM International,\nMetals Park, Ohio).\n34 ASTM C 313-59: Part 17: 1977 Adherence of Porcelain\nEnamels and Ceramic Coatings to Sheet Metal, 1977\n(American Society for Testing and Materials, Philadelphia,\nPennsylvania).\n35 Dickson, J. H. Glass: A Handbook for Students and Techni-\ncians, 1951, p. 148 (Hutchinsons Scienti® c and Technical\nPublications, London).\n36 Petitbon, A., Boquet, L. and Delsart, D. Laser surface seal-\ning and strengthening of zirconia coatings. Surf. Coatings\nTechnol., 1991, 49, 57 ± 61.\n37 ASTM C 448-64: Part 17: 1977 Abrasion Resistance of\nPorcelain Enamels, 1977 (American Society for Testing\nand Materials, Philadelphia, Pennsylvania).\n38 BS 6428: Part 8: 1985 Porcelain Enamels on Steel: AMethod\nfor Determination of Chemical Resistance, 1985 (British\nStandards Institution, London).\nTHE CHARACTERISTICS OF A HIGH-POWER DIODE LASER FIRED ENAMEL COATING 519\nB00800 # IMechE 2001 Proc Instn Mech Engrs Vol 215 Part B\n\n"}