{"doi":"10.1109\/VPPC.2005.1554646","coreId":"54509","oai":"oai:eprints.lincoln.ac.uk:2553","identifiers":["oai:eprints.lincoln.ac.uk:2553","10.1109\/VPPC.2005.1554646"],"title":"Observer techniques for estimating the state-of-charge and state-of-health of VRLABs for hybrid electric vehicles","authors":["Bhangu, B S","Bentley, P","Stone, D A","Bingham, Chris"],"enrichments":{"references":[{"id":977310,"title":"A frequency-domain approach to dynamical modelling of electrochemical power sources.","authors":[],"date":"2002","doi":"10.1016\/S0013-4686(02)00091-9","raw":"E. Karden, S. Buller, R. W. De Donker. (2002). A frequency-domain approach to dynamical modelling of electrochemical power sources. Pergamon. Electrochimica Acta. Vol. 47. pages 2347-2356.","cites":null},{"id":975582,"title":"A fuzzy logic approach to state-of-charge determination in high performance batteries with applications to electric vehicles.” Electric Vehicle Symposium 15.","authors":[],"date":"1998","doi":null,"raw":"P. Singh, C. Fennie, D. Reisner, A. Salkind. (1998). “A fuzzy logic approach to state-of-charge determination in high performance batteries with applications to electric vehicles.” Electric Vehicle Symposium 15. CD-ROM.","cites":null},{"id":976519,"title":"A new approach to linear filtering and prediction problems.”","authors":[],"date":"1982","doi":"10.1115\/1.3662552","raw":"R. E. Kalman, (1982) “A new approach to linear filtering and prediction problems.” Transactions of the ASME - Journal of Basic Engineering, Series D, pp 35-45..","cites":null},{"id":974627,"title":"A review of impedance measurements for determination of the state-of-charge or state of health of secondary batteries.”","authors":[],"date":"1998","doi":"10.1016\/s0378-7753(97)02665-7","raw":"F. Huet. (1998). “A review of impedance measurements for determination of the state-of-charge or state of health of secondary batteries.” Elsevier. Journal of Power Sources. Vol. 70. pp. 59-69.","cites":null},{"id":975085,"title":"A review of state-of-charge indication of batteries by means of a.c. impedance measurements.” Elsevier.","authors":[],"date":"2000","doi":"10.1016\/s0378-7753(99)00351-1","raw":"S. Rodrigues, N. Munichandraiah, A. K. Shukla. (2000). “A review of state-of-charge indication of batteries by means of a.c. impedance measurements.” Elsevier. Journal of Power Sources. Vol.87. pp. 12-20.","cites":null},{"id":974208,"title":"An optimised state of charge algorithm for lead-acid batteries in electric vehicles.” Electric Vehicle Symposium,","authors":[],"date":"1998","doi":"10.1109\/60.875503","raw":"O. Caumont, P. Le Moigne, X. Muneret, P. Lenain, C. Rombaut. (1998). “An optimised state of charge algorithm for lead-acid batteries in electric vehicles.” Electric Vehicle Symposium, EVS-15, 1998, CD-ROM.","cites":null},{"id":976737,"title":"Comment on the Kalman filter and nonlinear estimates of multivariate normal processes.”","authors":[],"date":"1965","doi":"10.1109\/tac.1965.1098094","raw":"R. Bucy, R. Kalman, I. Selin. (1965) “Comment on the Kalman filter and nonlinear estimates of multivariate normal processes.” IEEE Transactions on Automatic Control, 10(1), pp.118-119.","cites":null},{"id":977815,"title":"Dynamic characterization of small lead-acid cells.","authors":[],"date":"2001","doi":"10.1016\/S0378-7753(01)00561-4","raw":"A. Salkind, T. Atwater, P. Singh, S. Nelatury, S. Damodar, C. Fennie Jr., D. Reisner. (2001). Dynamic characterization of small lead-acid cells. Elsevier. Journal of Power Sources. Vol.96. pages 151-159.","cites":null},{"id":976270,"title":"Dynamic modelling of lead\/acid batteries using impedance spectroscopy for parameter identification.","authors":[],"date":"1997","doi":"10.1016\/s0378-7753(97)02498-1","raw":"P. Mauracher, E. Karden. (1997). Dynamic modelling of lead\/acid batteries using impedance spectroscopy for parameter identification. Elsevier. Journal of Power Sources. Vol. 67. pp. 69-84.","cites":null},{"id":973858,"title":"Early results from a systems approach to improving the performance and lifetime of lead acid batteries.” Elsevier.","authors":[],"date":"2003","doi":"10.1016\/s0378-7753(02)00714-0","raw":"M. J. Kellaway, P. Jennings, D. Stone, E. Crowe, A. Cooper. (2003) “Early results from a systems approach to improving the performance and lifetime of lead acid batteries.” Elsevier. Journal of Power Sources. Vol.116. pp. 110-117.","cites":null},{"id":977150,"title":"Impedance Spectroscopy: Emphasizing Solid Materials and Systems.","authors":[],"date":"1987","doi":"10.1002\/nadc.19880360311","raw":"J. Ross Macdonald, W. R. Kenan. (1987). Impedance Spectroscopy: Emphasizing Solid Materials and Systems. Wiley. ISBN: 0-471-83122-0.","cites":null},{"id":977567,"title":"Impedancebased non-linear dynamic battery modeling for automotive applications.","authors":[],"date":"2003","doi":"10.1016\/S0378-7753(02)00558-X","raw":"S. Buller, M. Thele, E. Karden, R. W. De Doncker. (2003). Impedancebased non-linear dynamic battery modeling for automotive applications. Elsevier. Journal of Power Sources. Vol.113. pages 422-430.","cites":null},{"id":978079,"title":"ImpedanceBased Online Monitoring of Automotive Batteries.","authors":[],"date":"2002","doi":null,"raw":"S. Buller; J. Walter; E. Karden; R.W. De Doncker. (2002). ImpedanceBased Online Monitoring of Automotive Batteries. Advanced Automotive Battery Conference (AABC 02), 4 th-7 th February 2002. Las Vegas, USA.","cites":null},{"id":974412,"title":"Lead acid Batteries.” Wiley.","authors":[],"date":"1977","doi":"10.1002\/bbpc.197800141","raw":"H. Bode. (1977). “Lead acid Batteries.” Wiley. ISBN 0-471-08455-7.","cites":null},{"id":18442411,"title":"Lessons learned using Ohmic techniques for battery modelling.","authors":[],"date":"2001","doi":"10.1109\/bcaa.2001.905107","raw":"C. S. C. Bose, D. Williams, S. McCluer, M. J. Model. (2001). Lessons learned using Ohmic techniques for battery modelling. IEEE. 16 th annual battery conference on applications and advances. pages 99-104.","cites":null},{"id":978014,"title":"Lessons learned using Ohmic techniques for battery modelling. IEEE. 16th annual battery conference on applications and advances.","authors":[],"date":"2001","doi":"10.1109\/bcaa.2001.905107","raw":null,"cites":null},{"id":978240,"title":"Lifetime extension of Valve regulated lead acid (VRLA) batteries under hybrid vehicle duty.","authors":[],"date":"2004","doi":"10.1049\/cp:20040258","raw":"P. Bentley, D.A. Stone. (2004). Lifetime extension of Valve regulated lead acid (VRLA) batteries under hybrid vehicle duty. IEE. Proceedings of the 2 nd international power electronics machines and drives conference. PEMD2004. Edinburgh, Scotland. Vol. 1. pages 49-54.","cites":null},{"id":977369,"title":"Measurement of the ultralow frequency impedance of lead acid batteries.","authors":[],"date":"1996","doi":null,"raw":"P. Mauracher, E. Karden, K. Rembe. (1996). Measurement of the ultralow frequency impedance of lead acid batteries. Proceedings of LABAT ’96. Varna , Bulgaria. pages 91-94.","cites":null},{"id":973990,"title":"Methods for state-of-charge determination and their applications.”","authors":[],"date":"2001","doi":"10.1016\/s0378-7753(01)00560-2","raw":"S. Piller, M. Perrin, A. Jossen. (2001). “Methods for state-of-charge determination and their applications.” Elsevier. Journal of Power Sources. Vol. 96. pp. 113-120.","cites":null},{"id":975821,"title":"Neural network adaptive modelling of battery discharge behavior.”","authors":[],"date":"1997","doi":"10.1007\/bfb0020299","raw":"G. O. Patillon J. N. d’Alché-Buc. (1997). “Neural network adaptive modelling of battery discharge behavior.” Artificial Neural Networks ICANN’97 7 th International Conference, Springer-Verlag, Berlin, Lecture notes in computerscience. Vol.1327. pp. 1095-1100.","cites":null},{"id":976080,"title":"Neural network based energy storage system modelling for hybrid electric vehicles.” National Renewable Energy Laboratories,","authors":[],"date":"1999","doi":"10.2172\/935117","raw":"S. R. Bhatikar, R.L. Mahajan, K. Wipke, V. Johnson. (1999). “Neural network based energy storage system modelling for hybrid electric vehicles.” National Renewable Energy Laboratories, August 1999.","cites":null},{"id":976956,"title":"Nonlinear Observers for Predicting State-of-Charge and State-of-Health of Lead-acid Batteries for Hybrid Electric Vehicles”,","authors":[],"date":"2005","doi":"10.1109\/epe.2005.219601","raw":"B. S. Bhangu, P. Bentley, D. A. Stone, C. M. Bingham. (2005) “Nonlinear Observers for Predicting State-of-Charge and State-of-Health of Lead-acid Batteries for Hybrid Electric Vehicles”, IEEE Trans. Vehicular Technology Vol. 54, No. 3, pp. 783-794.","cites":null},{"id":975334,"title":"The available capacity computation model based on artificial neural network for lead acid batteries in electric vehicles.”","authors":[],"date":"2000","doi":"10.1016\/s0378-7753(99)00502-9","raw":"C. C. Chan, E.W.C. Lo, S. Weixiang. (2000). “The available capacity computation model based on artificial neural network for lead acid batteries in electric vehicles.” Elsevier. Journal of Power Sources. Vol. 87. pp. 201-204.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005","abstract":"The paper describes the application of observer-based state-estimation techniques for the real-time prediction of state-of-charge (SoC) and state-of-health (SoH) of lead-acid cells. Specifically, an approach based on the well-known Kalman filter, is employed, to estimate SoC, and the subsequent use of the EKF to accommodate model non-linearities to predict battery SoH. The underlying dynamic behaviour of each cell is based on a generic Randles' equivalent circuit comprising of two-capacitors (bulk and surface) and three resistors, (terminal, transfer and self-discharging). The presented techniques are shown to correct for offset, drift and long-term state divergence-an unfortunate feature of employing stand-alone models and more traditional coulomb-counting techniques. Measurements using real-time road data are used to compare the performance of conventional integration-based methods for estimating SoC, with those predicted from the presented state estimation schemes. Results show that the proposed methodologies are superior with SoC being estimated to be within 1% of measured. Moreover, by accounting for the nonlinearities present within the dynamic cell model, the application of an EKF is shown to provide verifiable indications of SoH of the cell pack","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/54509.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2553\/1\/bhangu_3.pdf","pdfHashValue":"be3198538a204b52262b038b61fbea65b87185f1","publisher":"Institute of Electronic and Electrical Engineering","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2553<\/identifier><datestamp>\n      2014-08-28T09:24:57Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363030<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2553\/<\/dc:relation><dc:title>\n        Observer techniques for estimating the state-of-charge and state-of-health of VRLABs for hybrid electric vehicles<\/dc:title><dc:creator>\n        Bhangu, B S<\/dc:creator><dc:creator>\n        Bentley, P<\/dc:creator><dc:creator>\n        Stone, D A<\/dc:creator><dc:creator>\n        Bingham, Chris<\/dc:creator><dc:subject>\n        H600 Electronic and Electrical Engineering<\/dc:subject><dc:description>\n        The paper describes the application of observer-based state-estimation techniques for the real-time prediction of state-of-charge (SoC) and state-of-health (SoH) of lead-acid cells. Specifically, an approach based on the well-known Kalman filter, is employed, to estimate SoC, and the subsequent use of the EKF to accommodate model non-linearities to predict battery SoH. The underlying dynamic behaviour of each cell is based on a generic Randles' equivalent circuit comprising of two-capacitors (bulk and surface) and three resistors, (terminal, transfer and self-discharging). The presented techniques are shown to correct for offset, drift and long-term state divergence-an unfortunate feature of employing stand-alone models and more traditional coulomb-counting techniques. Measurements using real-time road data are used to compare the performance of conventional integration-based methods for estimating SoC, with those predicted from the presented state estimation schemes. Results show that the proposed methodologies are superior with SoC being estimated to be within 1% of measured. Moreover, by accounting for the nonlinearities present within the dynamic cell model, the application of an EKF is shown to provide verifiable indications of SoH of the cell pack.<\/dc:description><dc:publisher>\n        Institute of Electronic and Electrical Engineering<\/dc:publisher><dc:date>\n        2005<\/dc:date><dc:type>\n        Conference or Workshop contribution<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2553\/1\/bhangu_3.pdf<\/dc:identifier><dc:identifier>\n          Bhangu, B S and Bentley, P and Stone, D A and Bingham, Chris  (2005) Observer techniques for estimating the state-of-charge and state-of-health of VRLABs for hybrid electric vehicles.  In: Vehicle Power and Propulsion, 2005 IEEE Conference, 7-9 Sept 2005, USA.  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/VPPC.2005.1554646<\/dc:relation><dc:relation>\n        10.1109\/VPPC.2005.1554646<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2553\/","http:\/\/dx.doi.org\/10.1109\/VPPC.2005.1554646","10.1109\/VPPC.2005.1554646"],"year":2005,"topics":["H600 Electronic and Electrical Engineering"],"subject":["Conference or Workshop contribution","PeerReviewed"],"fullText":" \n \n \n  \nAbstract—The paper describes the application of observer-\nbased state-estimation techniques for the real-time prediction of \nstate-of-charge (SoC) and state-of-health (SoH) of lead-acid cells.  \nSpecifically, an approach based on the well-known Kalman \nFilter, is employed, to estimate SoC, and the subsequent use of \nthe EKF to accommodate model non-linearities to predict battery \nSoH.  The underlying dynamic behaviour of each cell is based on \na generic Randles’ equivalent circuit comprising of two-\ncapacitors (bulk and surface) and three resistors, (terminal, \ntransfer and self-discharging).  The presented techniques are \nshown to correct for offset, drift and long-term state \ndivergence—an unfortunate feature of employing stand-alone \nmodels and more traditional coulomb-counting techniques.  \nMeasurements using real-time road data are used to compare the \nperformance of conventional integration-based methods for \nestimating SoC, with those predicted from the presented state \nestimation schemes. Results show that the proposed \nmethodologies are superior with SoC being estimated to be \nwithin 1% of measured.  Moreover, by accounting for the \nnonlinearities present within the dynamic cell model, the \napplication of an EKF is shown to provide verifiable indications \nof SoH of the cell pack. \n \nIndex Terms— Batteries, Energy management, Energy storage \nNonlinear estimation, State estimation. \n \nI. INTRODUCTION \nells employed in hybrid electric vehicles (HEVs) as peak \npower buffers operate under arduous conditions, being \nsubjected to both large dynamic transients in current and \npower demand over a wide temperature range.  Moreover, the \ncells are mostly operated at a Partial State-of-Charge (PSoC) \ni.e. the cell is never cycled over its full SoC range.  An \nexample is given by the RHOLAB driving cycle requirements, \nwhich shows road data collected from a Honda Insight HEV, \nFig. 1, where peak charge- and discharge-current demands of \n≈60A and ≈100A, respectively, are required from the battery \npack, Fig. 2 [1]. \nThe accommodation of such operating conditions requires \n \n \nthat the management system has accurate knowledge of the \npeak power buffer’s SoC to facilitate safe and efficient \nutilisation of the battery for HEVs, by preventing under- or \nover-charging conditions, thereby extending the lifetime and \npreventing progressive permanent damage to the battery. \nMoreover, failure to control SoC can also degrade the ability \nof the pack to source\/sink subsequent power transients.  \nAn assortment of techniques have previously been reported \nto measure or monitor the SoC of a cell or battery, each \nhaving its relative merits, as reviewed by Piller et al [2].  \nCharge counting or current integration techniques, are, at \npresent, the most commonly used strategy, requiring \nmeasurement of the cell\/battery current, the time-integral of \nwhich is considered to provide a direct indication of SoC [3].  \nHowever, due to the reliance on integration, errors in terminal \nmeasurements due to noise, resolution and rounding are \ncumulative, and large SoC errors can result.  A reset or \nrecalibration action is therefore required at regular intervals—\nin electric vehicles (EVs) this may be carried out during a full \ncharge or conditioning discharge, but is less appropriate for \nstandard HEV operation where full SoC is rarely achieved.  \nOther factors that ultimately influence the accuracy of SoC \nestimates, and create additional complications for the \ntraditional integration-based techniques, are the variation of \ncell capacity with discharge rate, temperature and Coulombic \nefficiency losses.  \nWhen considering flooded lead-acid cells, the specific \ngravity of the electrolyte is known to be a good measure of \nSoC.  However, estimates of SoC are complicated when using \nvalve regulated lead-acid (VRLA) cells due to the nominal \namount of electrolyte being immobilised in the glass fiber \nseparator mat or gel. Nevertheless, since the open-circuit \nterminal voltage of a VRLA battery varies almost linearly \nover the majority of the battery’s SoC [4], it has been used in \nmany SoC estimators. For the method to be effective, \nhowever, corrections must be made for temperature and \nelectrolyte concentration gradients (long settling times may be \nrequired to allow such concentration gradients to disperse \nprior to making an open circuit voltage reading [4]). More \nObserver techniques for estimating the State-of-\nCharge and State-of-Health of VRLABs for \nHybrid Electric Vehicles  \nB. S. Bhangu (MIEEE), P. Bentley, D. A. Stone, C. M. Bingham (MIEEE) \n \nDepartment of Electronic and Electrical Engineering \nUniversity of Sheffield, Mappin Street, \nSheffield, S1 3JD, UK. \nCorresponding author:  b.bhangu@sheffield.ac.uk \nC\n0-7803-9280-9\/05\/$20.00 ©2005 IEEE. 780\n \n \n \ncommonly therefore, the measured open-circuit voltage is \nused to periodically correct the estimated SoC derived from \nother charge integration techniques. However, as with \nmeasurements of specific gravity, suitable periods of \noperational inactivity may not occur frequently enough in \nHEV driving duties for this to be successfully utilised.  \nCell impedance measurements have also been reported as a \nuseful technique for resetting or adjusting SoC estimates from \nintegration-based methods.  However, from results of various \nstudies undertaken to identify the impedance variation of \ncells\/batteries, with SoC  [5,6], contradictory views to their \nusefulness in practical systems currently remain unresolved \n[2]. \nOther reported methods for estimating SoC have been based \non artificial neural networks [7] and fuzzy logic [8] principles, \nalthough the latter was reported to have relative poor \nperformance. Although such techniques incur large \ncomputation overhead on the battery pack controller, which \nwould in the past have led to problems for online \nimplementation, the increasing computational power of digital \nsignal processing chips, and the accompanying fall in device \ncosts may, in the near future, make their application an \nattractive alternative.  Neural networks, in particular, have \nbeen used to avoid the need for the large number of \nempirically derived parameters required by other methods \n[9,10].  Indeed, for application to the less demanding task of \nprediction of SoC in portable equipment, a neural network \nmodelling approach has been shown to give mean errors of \n≈3% [9].  Also, a neural network model for predicting battery \npower capacity during driving cycles has been added to the \nADVISOR EV and HEV modelling environments [10]. \nVarious electric equivalent circuit models have been \napplied to lead-acid batteries to determine SoC [11].  \nHowever, the complex nonlinear electro-chemical processes \nthat occur during power transfer to\/from the battery has, in the \npast, proven difficult to accurately describe dynamically.  \nThese processes include the flow of ions, amount of stored \ncharge, ability to deliver instantaneous power and the effects \nof temperature and internal pressure, to name a few.  \nAlthough, in theory, the SoC of a battery can be determined \nfrom terminal quantities in conjunction with an appropriate \nbattery model, inaccuracies and measurement noise ultimately \nintroduce errors that can become significant over time.   \nHere then, an alternative technique is proposed for \npredicting the states of a cell that would normally be difficult \nor expensive to measure, or are subject to the significant \nproblems, as described previously—the SoC being the key \nstate in this case. Such model-based state-estimation \ntechniques employ an error-correction mechanism to provide \nreal-time predictions of SoC.  Specifically, the well-known \nKalman Filter (KF), developed during the 1960’s to provide a \nrecursive solution to optimal linear filtering for both state \nobservation and prediction problems [12,13,14], is used for \nthis study; a unique feature of the KF being that it optimally \n(minimum variance) estimates states affected by broad-band \nnoise contained within the system bandwidth i.e. that cannot \notherwise be filtered out using classical techniques, and \nenables empirical trade-offs between modelling errors and the \ninfluence of noise.   \nFinally, manufacturers of HEVs would like predictions of \nthe State-of-Health (SoH) or State-of-Function (SoF) of a \nbattery pack, since the increasing reliance on drive-by-wire \ntechnologies is making the battery a key safety-critical \ncomponent of the vehicle.  Knowledge of whether a battery \nwill fail when subject to high transient loadings, as may be \nexperienced in emergency braking, for instance, is therefore \nessential.  However, SoH monitoring techniques are currently \nin their infancy, with little being reported to-date. The \nproposed technique is therefore extended to accommodate \nestimation of SoH. Due to the resulting nonlinearities of the \nunderlying dynamic model, an EKF is considered for real-time \nestimation of SoH.  \nThe cell tested in this paper is a novel, spiral wound, 8Ah \nsealed lead-acid cell, with terminals on either end, developed \nby Hawker (ENERSYS Inc), for the RHOLAB project, Fig. 3. \nThe double terminal encapsulation is introduced to lower grid \ncurrents, and hence, thermal gradients, and thereby promote \nefficient utilisation of the active materials in the cell, thus \nleading to a battery that is optimised for the high-power duties \ntypical of hybrid driving cycles. \n \n \n \n \nFig. 1.  RHOLAB Honda Insight HEV employed to gather test data. \n \nFig. 2.  Typical RHOLAB [1] driving cycle cell current. \n781\n \n \n \nII. LEAD ACID BATTERY MODEL \nA. Dynamic modeling  \nA dynamic model of the lead acid cell, Fig 4, shows a \nsimplified equivalent circuit accredited to Randles [16]. A \nmodel of this form is employed in union with an observer-\nbased technique to simulate the response of VRLA cells to \nconstant current and dynamic power cycles. The parameters of \nthe simple equivalent circuit featuring lumped parameters for \nthe two plates, are estimated using the voltage response and \ncurve fits to data collected during current pulses applied to the \nVRLA double terminal cells, and is described in Sect. II-B.  \nThe cell terminal voltage is represented by Vo, and Ri is a \nlumped resistance due to cell interconnections etc. A double \nlayer capacitance Csurface is shown in parallel with the charge \ntransfer polarisation represented by Rt.  This double layer \ncapacitor is the result of charge separation at the \nelectrolyte\/electrode interface [15]. A charge double layer \nexists at both electrodes of the cell, and there may be more \nthan one species of ion or molecular dipole contributing to its \ncreation. In Fig. 4, Csurface represents a lumped capacitance \nparameter for the interfaces at both the cell plates. \nFurthermore, Cbulk models the cell’s open circuit voltage, and \nRd is included to represent the self-discharge of the cell. The \nvoltages across the bulk- and surface- capacitors are denoted \nVCb and VCs, respectively. \nB. Cell Parameter Characterization \nImpedance techniques provide a means of obtaining the \nparameters of the equivalent circuit, an example being shown \nin Fig. 5. The impedance is commonly measured using an \napplied excitation signal at the frequencies of interest [15,16]. \nImpedance spectroscopy has been used to identify \nelectrochemical parameters for complex models of electric \nvehicle batteries [11,17], such as the double layer capacitance, \ncharge transfer resistance and Warburg impedances. The \napplication of impedance spectroscopy to large industrial \nbatteries at low frequencies is discussed in [18], however, the \nresulting low frequency data is not directly applicable to HEV \nuse due to the dynamic nature of driving patterns and the \nextremely long time constant involved in the measurements. \nFurthermore, impedance techniques to model parameter \nquantities for a 36V mild hybrid battery, is discussed in [19], \nand the impedance measurement of small to medium sized \nlead acid cells in [20]. \nUsing a polar plot for a range of applied frequencies, an \nideal capacitor and resistor in parallel will produce \nsemicircular characteristics, with a diameter in the real axis \nequal to the resistance Rt, and radius in the imaginary axis \ncorresponding to a value of Csurface calculated from (1) [15]. \nfX\nCsurface π2\n1=  (1) \nThis leads to the standard method for deriving the value of \nthe double layer capacitance, employing the value of the \ncomplex impedance at the peak of the capacitive semicircular \narc. The high frequency intercept of the semicircle with the \nreal axis corresponds to the value of Ri, whilst the low \nfrequency intercept corresponds to the sum of Ri and Rt.  \nHowever, the capacitive arc is often not well defined within \na real cell, as demonstrated by the characteristics of the double \nterminal cell in Fig. 5, making it difficult to determine the \nmagnitude of the double layer capacitance directly. This is due \nto the capacitance having contributions from both positive and \nnegative electrodes; therefore the arc is rarely semicircular \ndue to the dispersed and non-homogeneous properties of the \ncell plates. Hence, in practice the calculation of a value for \nCsurface is often not straightforward.  \nCurrent interrupt techniques have also been used by some \ninvestigators for internal resistance measurement, typically \nutilising a relatively few points throughout the \ncharge\/discharge profile [21]. Others have shown that the \nelectrical noise generated at the terminals of an SLI (Starting \nLighting Ignition) battery during engine cranking may be \nprocessed to give internal resistance measurements, and \nhence, assess the SoC and SoH of the battery [22]. This \napproach may prove useful in HEV batteries, although, as is \n-0.025\n-0.020\n-0.015\n-0.010\n-0.005\n0.000\n0.005\n0 0.01 0.02 0.03 0.04\nRs \/Ω\nX\n \/ Ω 1Hz\n10Hz\n0.1Hz\n300Hz\n10kHz\n \nFig. 5.  Polar plot for a double terminal cell at 100% SoC.  \n \n \nFig. 3. 8Ah sealed VRLA test cell. \n \nRdCsurface\nRt\nRi\nCbulk VCb\nVCs\nVo\nI\nI3\nI4\nI1\nI2\n \nFig. 4.  Randles’ type equivalent circuit of a lead acid cell  [11]. \n782\n \n \n \nillustrated in Fig.7, the variation in Ri and Rt over much of the \ncell’s SoC is relatively small, implying that resistance \nmeasurement can only usefully be used to detect low SoC. \nThe variation of the voltage and current response of the \ncell, with SoC, is explored using a current interrupt technique \nduring discharge. A short 10ms interrupt is used to minimise \nthe effect on the underlying discharge rate, whilst a relatively \nhigh number of measurements are made throughout the \ndischarge. The cells are discharged from a 100% SoC using a \nconstant current of 8A. During the discharge, 10ms \ninterruptions are periodically applied to the constant current, \nto facilitate the calculation of internal resistance. During each \ninterrupt the cell voltage and current are sampled at 1kHz, to \nexclude the effects due to low frequency polarisation. This \nhigh sampling rate data is then processed offline following \neach test to allow calculation of the cell’s parameters. Figure \n6, shows an example of the voltage perturbation occurring \nduring a current interrupt pulse. \nPrior to testing, the cells are cycled on four full \ncharge\/discharge cycles, to bring them to a full and stable \ncapacity. The discharge tests are then carried out at current \nlevel of 8A. Between each test, the cells are subjected to a full \n16-hour 10A current limited, 2.45V constant voltage charge at \n25ºC.  \nA Labview routine is created to allow rapid offline \ncalculation of the internal resistance for each of these \ninterruptions. An automated routine is employed to process \nthe data for 250 pulses applied during each discharge run to \nidentify the parameters that fit the model, Fig. 4, according to \nthe voltage and current changes seen on the trailing edge of \neach current interrupt pulse, as shown in Fig. 6. \nOn application of a transient signal, Csurface will initially \nappear as a short circuit, and hence, the value of Ri may be \ncalculated from the initial voltage drop. The discharge of the \ndouble layer capacitor produces an exponential fall in voltage, \nuntil the voltage across the parallel combination of Csurface and \nRt is equal to IRt, the steady state voltage drop across Rt. An \nexponential fit is made to the portion of data following the \ninitial IR drop to determine the time constant, RC, of the \nparallel combination, and hence, Csurface. The results for the \ntest are plotted in Fig. 7, where Ri rises slowly throughout the \ndischarge until approximately 20% SoC is attained, and then \nincurs a sharp rise, whilst the Rt remains relatively constant \nthroughout most of the discharge period, and rises abruptly at \nthe end.  There is an underlying trend that the surface \ncapacitor value falls rapidly at the onset of discharge, then \nrising to maxima, prior to falling again at the end of discharge. \nThe complete cell parameters are as follows: \nIII. STATE VARIABLE DESCRIPTION OF BATTERY MODEL \nA. State variables CbV , CsV  and 0V  \nVoltages and currents describing the characteristics of the \nnetwork shown in Fig. 4, are given by  (note:  by convention, \ncurrent flowing into the cell is considered positive): \nCbti VRIIRV ++= 10  (1) \nCbCsi VVIRV ++=0  (2) \ndti RIRIIRV 310 ++=  (3) \ndCsi RIVIRV 30 ++=  (4) \nMoreover, taking the time-derivative of the output voltage, \n(2), and assuming 0≈dtdI  (the rate of change of terminal \ncurrent, per sampling interval when implemented digitally, is \nnegligible) gives the complete state variable description (5). \nFurthermore, observability is satisfied under the mild \nconditions that tsurfacedbulk RCRC ≠ , 1≠dbulk RC and \n1≠tsurface RC . \n0\n0.003\n0.006\n0.009\n0 1000 2000 3000\ntime\/s\nre\nsi\nst\nan\nce\n \/Ω\n0\n20\n40\nca\npa\nci\nta\nnc\ne \n\/F\nRi\nRt\nCsurface\nre\nsi\nst\nan\nce\n \/Ω\nca\npa\nci\nta\nnc\ne \n\/F\n \nFig. 7. Variation of model parameters over an 8A discharge \nTABLE I \nDERIVED PARAMATERS FOR LEAD ACID CELL MODEL \n \nCbulk 88372 F \nCsurface 23 F \nRi 0.0026 Ω \nRt 0.0005 Ω \nRd 10000 Ω \n \n2.05\n2.06\n2.07\n2.08\n2.09\n500 600 700 800 900 1000\ntime \/ms\nvo\nlta\nge\n \/V\nI×Ri\nI×R\nτ = Rt ×Cτ\n0.67(I×Rt )\nexponential fit\nvo\nlta\nge\n \/V\ntvo\nlta\nge\n \/V\nvo\nlta\nge\n \/V\nsurface\nvo\nlta\nge\n \/V\nvo\nlta\nge\n \/V\nvo\nlta\nge\n \/V\nvo\nlta\nge\n \/V\nFig. 6.  Method of calculation of model parameters. \n783\n \n \n \nI\nCC\nC\nC\nV\nV\nV\nRCRC\nRC\nRC\nV\nV\nV\nsurfacebulk\nsurface\nbulk\nCs\nCb\ntsurfacedbulk\ntsurface\ndbulk\nCs\nCb\n⎥⎥\n⎥⎥\n⎥⎥\n⎥⎥\n⎥⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎢⎢\n⎢⎢\n⎢⎢\n⎣\n⎡\n+\n+\n⎥⎥\n⎥⎥\n⎥⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎢⎢\n⎣\n⎡\n⋅\n⎥⎥\n⎥⎥\n⎥⎥\n⎥⎥\n⎥⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎢⎢\n⎢⎢\n⎢⎢\n⎣\n⎡\n−−\n−\n−\n=\n⎥⎥\n⎥⎥\n⎥⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎢⎢\n⎣\n⎡\n11\n1\n1\n011\n010\n001\n00\n&\n&\n&\n (5) \nIV. VALIDATION OF LEAD ACID BATTERY MODEL \nA. High power cell test bench  \nA high-power cell test-bench has been constructed to allow \ncontinuous cycling of individual cells using custom power- \nand current- profiles, thereby permitting the characterisation \nof individual cells over closely managed operating duties.  \nThe cells are contained within a thermally controlled \nenvironmental chamber to provide known environmental \nconditions, Fig. 8(a).   \nPower for cell charging is supplied from a rectified 3φ, \n500A power supply via a smoothing capacitor bank. The \ncharge\/discharge circuits employ an analogue PI controller \ndriving two parallel arrays of MOSFET power devices, acting \nas variable resistors.  One array of MOSFETs controls \ncharging current to the cell, and the other, the discharge \ncurrent, and both are forced air-cooled.  The demand signal is \nprovided via a PC-based Labview hardware development \nplatform. Furthermore, a dSPACE system is employed in \nparallel with the LABview hardware. Measurements of the \ncell voltages and currents are sampled by 16-bit ADCs, from \nwhich the observer algorithms estimate SoC (and ultimately, \nSoH). Figure 8(b) shows a schematic of one channel of the \ntest bench. \nB. Behaviour of lead acid battery model \nPrior to the design of the observers, the validity of the \nproposed model is undertaken by subjecting both the cell \n(shown by Fig. 3) and the model, Fig. 4, to a discharge pulse \nof 1.53A, for a comparison of the modelled voltage to the \nmeasured cell voltage, Fig. 9.  In addition, the behaviour of \nthe bulk- and surface-capacitor voltages is also shown.  \nAlthough there exists some discrepancy between the measured \nand modelled voltages, the underlying dynamic characteristics \nare essentially the same, with the principle difference being \nthe voltage response between discharge pulses.  The offset \nand drift are due to errors in initial condition estimates, and \nthe effect of employing the model in an open-loop state over a \nprolonged period. \nV. KALMAN FILTER (KF) FOR SOC ESTIMATION  \nA discrete-time equivalent model of the system (5), can be \nobtained by assuming the applied input, u, is constant during \neach sampling interval [14]: \n11\n1\n++\n+\n=\n+=\nkk\nkkk\nxy\nuxx\nd\ndd\nC\nBA\n (6) \nwhere \n⎥⎥\n⎥⎥\n⎥⎥\n⎥⎥\n⎥⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎢⎢\n⎢⎢\n⎢⎢\n⎣\n⎡\n−−\n−\n−\n=\n111\n010\n001\ntsurfacedbulk\ntsurface\nc\ndbulk\nc\nRCRC\nRC\nT\nRC\nT\ndA , \n⎥⎥\n⎥⎥\n⎥⎥\n⎥⎥\n⎥⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎢⎢\n⎢⎢\n⎢⎢\n⎣\n⎡\n+\n=\nsurface\nc\nbulk\nc\nsurface\nc\nbulk\nc\nC\nT\nC\nT\nC\nT\nC\nT\ndB , \nCCd =  (7) \nand Tc is the sampling period.  For notational purposes, )\/(ˆ jix  \nrepresents an estimate of x at step ‘i’ based on all the \ninformation up to, and including, time step ‘j’. \nThe stochastic principles underpinning the KF are \nappealing for this investigation, since it is recognised that the \npresence of disturbances stemming from sensor noise on the \ncell terminal measurements, and the use of non-ideal dynamic \nmodels, make it impossible to predict with certainty the states \nof the system over prolonged time periods—a statistical \npredictor\/corrector formulation thereby provides obvious \nadvantages.  \n                     \n500 A\nPower supply\nLabView PC control\nand data logger\nParallel MOSFET\ndischarge bank\nParallel MOSFET\ncharge bank\nI Demand\nAnalogue\nPI control\nV\n te\nrm\nin\nal\nI c\nel\nl\nTe\nm\npe\nra\ntu\nre\nCell\nV terminal\nI cell\nObserver algorithm\nSoC estimate\nSoH estimate\ndSPACE system\nV terminal\nI cell\n \n \n(a) (b) \n \nFig. 8. (a) Picture of cell contained within a thermally controlled environmental chamber (b) High power cell test bench schematic. \n. \n784\n \n \n \nSince only terminal quantities of the battery can be \nmeasured, the input is defined as Iu = , and the measured \noutput is 0Vy = . The predictor\/corrector stages of the \nrecursive KF algorithm applied is discussed in [14]. \nAlthough no formal stability and tuning methods are \navailable for initialising the KF, and recourse to empirical \ntuning is normally required, its use is nevertheless widespread. \nInformation about the system noise contribution is contained \nin matrices Q and R, and in essence, the selection of Q and R \ndetermines the accuracy of the filter’s performance, since they \nmutually determine the action of the KF gain matrix, 1+kK , \nand estimation error covariance matrix, 1\/1 ++ kkP , [14]. The \ncovariance matrix representing measurement noise, R, can be \nestimated from knowledge of the battery terminal voltage.  \nThe variance is obtained from the square of the RMS noise on \neach cell, and is assumed to be Gaussian distributed and \nindependent.  \nInitialisation of the covariance matrix describing \ndisturbances on the plant, Q, is complicated by the fact that \nknowledge of model inaccuracies and system disturbances is \nlimited, particularly as each cell has different characteristics.  \nA judicious choice of Q is therefore obtained from \nexperimental studies under the simplifying assumption that \nthere is no correlation between the elements of kσ  and the \nnoise present on each cells voltage transducer, thereby leading \nto a diagonal Q.  The initial covariance matrix, P0, together \nwith Q and R are ultimately chosen to be: \n \n(a) \n(b) \n(c) \nFig. 9. Dynamic behaviour of lead acid battery model in response to discharge\npulses of 1.53A (a) current and voltage of cell (b) measured and modelled cell\nvoltage (c) modelled voltages across bulk and surface capacitors. \n(a) \n(b) \n \n(c) \nFig. 10.  Dynamic behaviour of KF estimator to discharge pulses of 1.53A  \n(a) actual and estimated cell voltage and voltage error from KF and cell model \n(b) estimated bulk and surface capacitor voltages  (c) comparison of predicted\nSoC by method of current integration and KF respectively. \n  \n785\n \n \n \n⎥⎥\n⎥\n⎦\n⎤\n⎢⎢\n⎢\n⎣\n⎡\n=\n100\n010\n001\n0P ,\n⎥⎥\n⎥⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎣\n⎡\n=\n−\n8143.000\n04191.00\n0010549.1 5x\nQ , 10=R  (8) \nA. Practical Implementation of the Kalman Filter \nThe benefits of employing an observer-based technique, as \nopposed to the battery model (5), are now shown. As \ndescribed previously (Sect. IV-B) a discharge pulse of 1.53A \nis applied to both the experimental test battery and to the real-\ntime KF, with feedback of terminal current as its input.  A \ncomparison of the actual and estimated output cell voltage, \nand the error associated in the calculation of voltage using a \nmodel-based technique, compared to an observer, is shown in \nFig. 10(a). In particular, the KF shows excellent convergence \nof the states, and the output voltage, with negligible error.  \nThe voltages across the bulk and surface capacitors, \nobtained from the KF, is shown in Fig. 10(b). The discharge \npulses are applied until the cell is completely discharged, \nwhere the SoC as predicted by the current integration method \nincurs a large error. However, the KF demonstrates improved \nperformance by accurately estimating the SoC=0 at this point, \nFig. 10(c). Note that SoC = 1 is a normalized value used to \ndefine a fully-charged cell and is proportional to the bulk \ncapacitor voltage. \nIt is notable that, for linear systems, after several iterations, \n1+kK  converges to a constant matrix, and, in such cases 1+kK  \ncan be pre-calculated off-line, thereby presenting significant \nsavings in computational load at the expense of potentially \nincurring a loss of accuracy during transients [14].  \nThe impact of the covariance matrix R on the estimation \nperformance of the KF, has been previously considered [14] \nwhere it is seen that although significant noise is present on \nthe cell terminal voltage measurements, careful selection of R \ncan provide estimates with enhanced noise immunity. \nB.  Comparison of SoC Estimation Techniques \nThe KF is now applied to a driving cycle (RHOLAB, Fig. \n2) from which, the real-time estimation of SoC of a single cell \nis determined. Prior to the RHOLAB driving cycle the cell is \ndischarged to SoC≈0.8, this being the defined operating point \nfor Partial State-of-Charge (PSoC) on the HEV driving \nprofile; with the current profile is shown by Fig. 11(a). \nFigure 11(b) shows a comparison of the actual- and \nestimated- output voltage, and the negligible voltage error \nfrom the use of the KF. The voltages across the bulk and \nsurface capacitors are shown in Fig. 11(c). Furthermore, Fig. \n11(d) shows results using conventional SoC estimation, by the \nintegration of current method, with charging efficiency of 0.97 \n[1], and those from the proposed KF scheme. Having been \nsubjected to a RHOLAB driving cycle, at t=1400s (time from \nstart of the RHOLAB profile) the tests are terminated, and the \nremnant charge in the cell is measured using a 1.53A \ndischarge, to a terminal voltage of 1.7V and noting the \nremaining Ampere-hours, Fig. 12, (1.87 Ah). This \ncorresponds to a final SoC of the cell of 0.283. From Fig. 12, \n(a) \n(b) \n \n(c) \n(d) \n \nFig. 11.  Implementation of KF on RHOLAB cycle (a) Discharging a cell from\nSoC of 1 to 0.8 using 1.53A discharge subsequent to a RHOLAB driving\nprofile as shown by Fig 2 (b) measured and estimated cell voltage and cell\nvoltage error (c) estimated bulk and surface capacitor voltage (d) comparison\nof SoC determined by conventional means (integration of current) and from\nestimated bulk capacitor voltage.  \n786\n \n \n \nand Table II, it can be seen that the performance of the KF is \nexcellent, and, although both SoC estimation techniques \nfollow the correct profile, the integration-based method \ndemonstrates significant drift over time, with an error of ≈4% \nensuing, whereas the KF consistently provides estimates \nwithin ≈1% of the measured values. \nVI. STATE OF HEALTH ESTIMATION  \nSoH is the ability of a cell to store energy, source and sink \nhigh currents and retain charge over extended periods, relative \nto its initial or nominal capabilities. The available charge \nstored within a fully-charged cell is expected to fall with cell \nusage, as active material on the cell plates gradually degrades \nby mechanisms such as, loss of plate active surface area due to \nrepeated dissolution and re-crystallisation, loss of electrical \ncontact between metallic grids and active materials, and \ngrowth of large inactive crystals of lead sulphate. Such \ncapacity-loss mechanisms generally occur slowly in VRLA \nbatteries that are cycled at low-rates over their full SoC range.  \nHowever, when operated as a peak power buffer, in a HEV \nsystem, the cells are operated at a PSoC i.e. the cell is never \ncycled over its full SoC range, and is subjected to both high \ncharge and discharge currents.  Studies have shown that this \nPSoC operation can lead to truncated service life in VRLA \ncells due to build-up of sulphate within the plate structures, as \na result of inefficient recharge of plate material [23,24]. Such \ncapacity loss can be deemed a loss of cell SoH.  Early \ndetection of SoH degradation would allow a ‘smart’ battery \npack to take remedial action, such as the application of \nconditioning routines to the cell, to remove small sulphate \ncrystals before they form large inactive crystals, thereby \nrestoring the cells capacity.  Measuring cell capacity by the \nstandard means of a low current discharge is impractical for \nHEV applications, and online techniques that utilise only cell \nterminal measurements, made whilst the HEV is driven, are \ntherefore required.  \nA. EKF-based Estimation of SoH \nA means of estimating bulk capacitance bulkC , requires \nadding an extra state, 0=dtdCbulk , into the observer \nstructure (10) and assuming the rate-of-change of bulkC , over \na sampling interval, is negligible.  Since the derivatives of CbV  \nand 0V  are coupled by non-linear elements, an EKF is now \nrequired for effective estimation of state variables.  It should \nbe noted, however, that the realisation results in an increase in \norder of the resulting Jacobians, covariance, noise and \ndisturbance matrices, with a consequential increase in \ncomputation overhead. The proposed non-linear battery model \nis written in the form: ( )\n)(\n,\nxCy\nuxfx\n=\n=&  (9) \nwhere ( )uxf ,  is given by (10). \n \n[ ]TCsCb VVVx α,,, 0=  \n,\n0\n1\n),(\n⎥⎥\n⎥⎥\n⎥⎥\n⎥⎥\n⎥⎥\n⎥⎥\n⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎢⎢\n⎢⎢\n⎢⎢\n⎢⎢\n⎢\n⎣\n⎡\n⎟⎟⎠\n⎞\n⎜⎜⎝\n⎛ ++−−\n+−\n+−\n=\nI\nCRC\nV\nR\nV\nC\nI\nRC\nV\nI\nR\nV\nuxf\nsurfacetsurface\nCs\nd\nCb\nsurfacetsurface\nCs\nd\nCb\nαα\nαα\n (10) \nand 0)( VxC = , bulkC1=α . \nThe EKF requires a small-signal model of the system, at \neach sample step, by linearising (10) about the current \noperating point, x0, u0.  From a Taylor series expansion, \n(ignoring the presence of noise): \nxyuxxx δδδδδ CΒF =+= ,)(&  (11) \nwhere, \n0xxx −=δ    0uuu −=δ  \n⎥⎥\n⎥⎥\n⎥⎥\n⎥⎥\n⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎢⎢\n⎢⎢\n⎢\n⎣\n⎡\n+−−−\n−\n+−−\n=∂\n∂=\n0000\n01\n001\n00\n)(\n)(),(\nI\nR\nV\nRCR\nRC\no\nI\nR\nV\nR\nx\nfx\nd\nCb\ntsurfaced\ntsurface\nd\nCb\nd\ntutx α\nα\nF  (12) \nT\nsurfacesurfacetutx CCu\nf\n⎥⎥⎦\n⎤\n⎢⎢⎣\n⎡ +=∂\n∂= 011\n)(),(\nααB  \n \n[ ]0100\n)(),(\n=∂\n∂=\ntutxx\nCC  \n \nFig. 12.  Cell discharge characteristic to 0% SoC. \nTABLE II \nCOMPARISON OF STATE OF CHARGE ESTIMATION FROM \nCURRENT INTEGRATION METHODAND KF \n \n Final SoC estimation \nMeasured SoC 0.283 \nCurrent integration SoC 0.3177 \nKalman Filter SoC 0.2793 \n \n787\n \n \n \nThe resulting small signal model, about the operating point \nx0, u0, is given by:  \nxyuxx kk δδδδδ CΒA =+= ,&  (13) \n(where \nkk uxk\nx ,)(FA = ) that can be discretized, to give: \n111 +++ =+= kkkkk xyuxx ddd CBA  (14) \nand used in the KF algorithm described previously in [14]. \nB.  Online implementation of SoH monitoring \nThe SoH of known cells has previously been evaluated [23] \nby performing continuous power cycling tests (using the \nRHOLAB profile shown in Fig. 2, on two separate battery \npacks, each consisting of 18 cells.  Results of the tests have \ndemonstrated similar pack lifetimes in each case, over 77 and \n74 power cycles, respectively.  During the tests, the cells of \nboth packs suffered a measurable mean loss in cell capacity of \n≈0.01Ah, per power cycle [23].  Whilst performing the tests, \nthe EKF is employed, and the variation of bulkC  is estimated.  \nThe results, shown in Fig. 13(a), demonstrate the ability of the \nstate observer scheme to estimate bulkC , over time, ultimately \nindicating a reduction of ≈10% during the tests, corresponding \nto an average loss of cell capacity of 0.8Ah for a nominal 8Ah \ncell.  This, therefore, compares well to the measured loss of \ncapacity of ≈0.77Ah from the packs under test. Figure 13(b) \nshows the applied cell terminal voltage profile. \nAn additional test to determine SoH is performed on a \nnewly conditioned Hawker cell, Fig. 3. Subsequent to the \nconditioning routine, the cell undergoes a series of operational \nprofiles, as shown in Fig. 14. It should be noted that the term \n“full discharge” is used to signify a complete discharge to \n1.7V at rate of 1.53A, and “full charge” describes charging for \n16 hours at 2.45V with a 10A current limit.  \nFigure 15(a) shows the cell terminal current and voltage \nprofile. Notably, from Fig. 15(b) it is seen that the SoH is \nimpervious to the full charge\/discharge routines applied to the \ncell, with negligible degradation in SoH occurring. However, \non demanding 18 repetitive RHOLAB profiles, Fig. 2, the \nSoH is seen to rapidly decline, Fig. 15(b). Furthermore, from a \ncomparison with results from Fig 13, it can be seen that the \ncell fails to perform an additional complete RHOLAB profile, \ndue to cell capacity loss of ≈10%. \n(a) \n(b) \nFig. 13. EKF employed to predict SoH of cell pack (a) estimated bulk\ncapacitance bulkC (b) cell terminal voltage  \nFull discharge\nFull charge\nFull discharge\nFull charge\nDischarge to PSoC=0.8\nDemand 18 Rholab profile\nCell failed to perform a\ncomplete Rholab profile\nn = 2\nBegin with conditioned\ncell n = 1\nn = n+1\nyes\nno\n \n \nFig. 14.  Profile subject to a RHOLAB cell  \n(a) \n(b) \nFig. 15. EKF employed to predict SoH of cell pack (a) cell terminal current \nand voltage (b) estimated bulk capacitance bulkC  \n788\n \n \n \nVII. CONCLUSION \nThe paper presents an alternative approach for estimating \nthe SoC and SoH of a cell pack using KF, and EKFs, \nrespectively, by modelling the dynamic behaviour of each cell \nbased on a generic Randle’s equivalent circuit comprising of \ntwo-capacitors (bulk and surface) and three resistors, \n(terminal, transfer and self-discharging). Although it is shown \nthat the model is not an accurate representation of the cell \nmodel, rather than increasing the complexity of the cell model \nto closely match the real system, the application of a KF, with \nits inherent predictor-corrector mechanism, is shown to be \nrobust to such modelling deficiencies. In particular, a \ncomparison of SoC estimates using the presented KF \ntechnique, and the more conventional coulomb-counting \ntechniques, is undertaken using “road data” collected from a \nHonda Insight HEV driven on a test track.  The presented \nresults show a significant improvement in SoC estimation \nfrom the proposed KF methodology. \nFurthermore, extensions for SoH monitoring, by employing \nan EKF, have also been presented—using only measurements \nof cell terminal quantities as input.  Such data is extremely \nimportant for HEV manufacturers since the ability to analyze \nState-of-Function (SoF), which is dependent on both SoC and \nSoH information, is feasible. The SoF ultimately describes the \nability of a cell to perform adequately under HEV demands, \nproviding prediction of available capacity, and discharge and \nrecharge capability, thereby allowing a ‘smart’ battery to \nforecast the response of the cell to driving demands, and \nleading to optimal utilisation of the battery pack with regard to \nperformance and lifetime, and therefore, better overall energy \nmanagement within the vehicle. \nACKNOWLEDGMENT \nThe authors wish to acknowledge the financial assistance \nprovided by the UK's DTI Foresight Vehicle Link Program, \nand the EPSRC, who have funded the RHOLAB project \njointly with the European Advanced Lead Acid Battery \nConsortium, and Hawker Batteries. They would also like to \nacknowledge the support given by the other partners in the \nproject, namely, Provector Ltd, the University of Warwick \nand Hawker Batteries (now part of Enersys Inc.). \nREFERENCES \n[1] M. J. Kellaway, P. Jennings, D. Stone, E. Crowe, A. Cooper. (2003) \n“Early results from a systems approach to improving the performance \nand lifetime of lead acid batteries.” Elsevier. Journal of Power Sources. \nVol.116. pp. 110-117. \n[2] S. Piller, M. Perrin, A. Jossen. (2001). “Methods for state-of-charge \ndetermination and their applications.” Elsevier. Journal of Power \nSources. Vol. 96. pp. 113-120. \n[3] O. Caumont, P. Le Moigne, X. Muneret, P. Lenain, C. Rombaut. (1998). \n“An optimised state of charge algorithm for lead-acid batteries in electric \nvehicles.” Electric Vehicle Symposium, EVS-15, 1998, CD-ROM. \n[4] H. Bode. (1977). “Lead acid Batteries.” Wiley. ISBN 0-471-08455-7. \n[5] F. Huet. (1998). “A review of impedance measurements for \ndetermination of the state-of-charge or state of health of secondary \nbatteries.” Elsevier. Journal of Power Sources. Vol. 70. pp. 59-69. \n[6] S. Rodrigues, N. Munichandraiah, A. K. Shukla. (2000). “A review of \nstate-of-charge indication of batteries by means of a.c. impedance \nmeasurements.” Elsevier. Journal of Power Sources. Vol.87. pp. 12-20. \n[7] C. C. Chan, E.W.C. Lo, S. Weixiang. (2000). “The available capacity \ncomputation model based on artificial neural network for lead acid \nbatteries in electric vehicles.” Elsevier. Journal of Power Sources. Vol. \n87. pp. 201-204. \n[8] P. Singh, C. Fennie, D. Reisner, A. Salkind. (1998). “A fuzzy logic \napproach to state-of-charge determination in high performance batteries \nwith applications to electric vehicles.” Electric Vehicle Symposium 15. \nCD-ROM. \n[9] G. O. Patillon J. N. d’Alché-Buc. (1997). “Neural network adaptive \nmodelling of battery discharge behavior.” Artificial Neural Networks \nICANN’97 7th International Conference, Springer-Verlag, Berlin, \nLecture notes in computerscience. Vol.1327. pp. 1095-1100. \n[10] S. R. Bhatikar, R.L. Mahajan, K. Wipke, V. Johnson. (1999). “Neural \nnetwork based energy storage system modelling for hybrid electric \nvehicles.” National Renewable Energy Laboratories, August 1999. \n[11] P. Mauracher, E. Karden. (1997). Dynamic modelling of lead\/acid \nbatteries using impedance spectroscopy for parameter identification. \nElsevier. Journal of Power Sources. Vol. 67. pp. 69-84. \n[12] R. E. Kalman, (1982) “A new approach to linear filtering and prediction \nproblems.” Transactions of the ASME - Journal of Basic Engineering, \nSeries D, pp 35-45.. \n[13] R. Bucy, R. Kalman, I. Selin. (1965) “Comment on the Kalman filter and \nnonlinear estimates of multivariate normal processes.” IEEE \nTransactions on Automatic Control, 10(1), pp.118-119. \n[14] B. S. Bhangu, P. Bentley, D. A. Stone, C. M. Bingham. (2005) \n“Nonlinear Observers for Predicting State-of-Charge and State-of-Health \nof Lead-acid Batteries for Hybrid Electric Vehicles”, IEEE Trans. \nVehicular Technology Vol. 54, No. 3, pp. 783-794. \n[15] D. Linden. (1995). Handbook of Batteries. McGraw-Hill inc. 2nd Ed. \nISBN 0-07-037921-1. \n[16] J. Ross Macdonald, W. R. Kenan. (1987). Impedance Spectroscopy: \nEmphasizing Solid Materials and Systems. Wiley. ISBN: 0-471-83122-\n0. \n[17] E. Karden, S. Buller, R. W. De Donker. (2002). A frequency-domain \napproach to dynamical modelling of electrochemical power sources. \nPergamon. Electrochimica Acta. Vol. 47. pages 2347-2356. \n[18] P. Mauracher, E. Karden, K. Rembe. (1996). Measurement of the ultra-\nlow frequency impedance of lead acid batteries. Proceedings of LABAT \n’96. Varna , Bulgaria. pages 91-94. \n[19] S. Buller, M. Thele, E. Karden, R. W. De Doncker. (2003). Impedance-\nbased non-linear dynamic battery modeling for automotive applications. \nElsevier. Journal of Power Sources. Vol.113. pages 422-430.  \n[20] A. Salkind, T. Atwater, P. Singh, S. Nelatury, S. Damodar, C. Fennie Jr., \nD. Reisner. (2001). Dynamic characterization of small lead-acid cells. \nElsevier. Journal of Power Sources. Vol.96. pages 151-159. \n[21] C. S. C. Bose, D. Williams, S. McCluer, M. J. Model. (2001). Lessons \nlearned using Ohmic techniques for battery modelling. IEEE. 16th annual \nbattery conference on applications and advances. pages 99-104. \n[22] S. Buller; J. Walter; E. Karden; R.W. De Doncker. (2002). Impedance-\nBased Online Monitoring of Automotive Batteries. Advanced \nAutomotive Battery Conference (AABC 02), 4th-7th February 2002. Las \nVegas, USA. \n[23] P. Bentley, D.A. Stone. (2004). Lifetime extension of Valve regulated \nlead acid (VRLA) batteries under hybrid vehicle duty. IEE. Proceedings \nof the 2nd international power electronics machines and drives \nconference. PEMD2004. Edinburgh, Scotland. Vol. 1. pages 49-54. \n[24] J. Jones. (1991, May 10). Networks (2nd ed.) [Online]. Available:  \nHollenkamp, Baldsing, Lim et al. “Overcoming negative-plate capacity \nloss in VRLA batteries cycled under partial state-of-charge duty,” \nALABC Investigation report ET\/IR398R, 2001. \n \n \n789\n"}