{"doi":"10.1126\/science.1165373","coreId":"69158","oai":"oai:eprints.lancs.ac.uk:28101","identifiers":["oai:eprints.lancs.ac.uk:28101","10.1126\/science.1165373"],"title":"Stretching the envelope of past surface environments : Neoproterozoic glacial lakes from Svalbard.","authors":["Bao, Huiming","Fairchild, Ian J.","Wynn, Peter M.","Spotl, Christoph"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-01-02","abstract":"The oxygen isotope composition of terrestrial sulfate is affected measurably by many Earth- surface processes. During the Neoproterozoic, severe \" snowball\" glaciations would have had an extreme impact on the biosphere and the atmosphere. Here, we report that sulfate extracted from carbonate lenses within a Neoproterozoic glacial diamictite suite from Svalbard, with an age of similar to 635 million years ago, falls well outside the currently known natural range of triple oxygen isotope compositions and indicates that the atmosphere had either an exceptionally high atmospheric carbon dioxide concentration or an utterly unfamiliar oxygen cycle during deposition of the diamictites","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69158.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/28101\/1\/Stretching_the_envelope_of_past_surface_environments_e%2Dprints.pdf","pdfHashValue":"91cf72a22f149efc24be0c7fd57c4368684b4009","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:28101<\/identifier><datestamp>\n      2018-01-24T02:52:24Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4745<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Stretching the envelope of past surface environments : Neoproterozoic glacial lakes from Svalbard.<\/dc:title><dc:creator>\n        Bao, Huiming<\/dc:creator><dc:creator>\n        Fairchild, Ian J.<\/dc:creator><dc:creator>\n        Wynn, Peter M.<\/dc:creator><dc:creator>\n        Spotl, Christoph<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        The oxygen isotope composition of terrestrial sulfate is affected measurably by many Earth- surface processes. During the Neoproterozoic, severe \" snowball\" glaciations would have had an extreme impact on the biosphere and the atmosphere. Here, we report that sulfate extracted from carbonate lenses within a Neoproterozoic glacial diamictite suite from Svalbard, with an age of similar to 635 million years ago, falls well outside the currently known natural range of triple oxygen isotope compositions and indicates that the atmosphere had either an exceptionally high atmospheric carbon dioxide concentration or an utterly unfamiliar oxygen cycle during deposition of the diamictites.<\/dc:description><dc:date>\n        2009-01-02<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/28101\/1\/Stretching_the_envelope_of_past_surface_environments_e%2Dprints.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1126\/science.1165373<\/dc:relation><dc:identifier>\n        Bao, Huiming and Fairchild, Ian J. and Wynn, Peter M. and Spotl, Christoph (2009) Stretching the envelope of past surface environments : Neoproterozoic glacial lakes from Svalbard. Science, 323 (5910). pp. 119-122. ISSN 0036-8075<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/28101\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1126\/science.1165373","http:\/\/eprints.lancs.ac.uk\/28101\/"],"year":2009,"topics":["GE Environmental Sciences"],"subject":["Journal Article","PeerReviewed"],"fullText":" 1 \nRevised on 11-25-2008 after “pre-edit Bao2” by editor 1 \nStretching the envelope of past surface environments: Neoproterozoic glacial lakes 2 \nfrom Svalbard 3 \n 4 \nHuiming Bao\n1\n, Ian J. Fairchild\n2\n, Peter M. Wynn\n3\n & Christoph Spötl\n4\n 5 \n 6 \n 7 \n1\nDepartment of Geology & Geophysics, E235 Howe-Russell Complex, Louisiana State 8 \nUniversity, Baton Rouge, LA 70803, USA. \n2\nSchool of Geography, Earth and 9 \nEnvironmental Sciences, University of Birmingham, Birmingham B15 2TT, UK. 10 \n3\nDepartment of Geography, University of Lancaster, Lancaster, LA1 4YQ, UK Lancaster 11 \nUniversity, UK.  \n4\nInstitut für Geologie und Paläontologie, Leopold-Franzens-Universität 12 \nInnsbruck, Innrain 52, 6020 Innsbruck, Austria 13 \n 14 \nOne-sentence summaries: 15 \nExtreme multi-stable isotope compositions of sulfate and its host carbonates from 16 \nSvalbard reveal an extraordinary atmosphere-biosphere condition during the deposition 17 \nof a Neoproterozoic glacial diamictites. 18 \n 19 \nAbstract 20 \nThe oxygen isotope composition of terrestrial sulfate is affected measurably by 21 \nmany Earth surface processes. During the Neoproterozoic, severe “Snowball” 22 \nglaciations would have had an extreme impact on the biosphere and the atmosphere. 23 \nHere, we report that sulfate extracted from carbonate lenses within a 24 \nNeoproterozoic glacial diamictite suite from Svalbard, with an age of ~ 635 Ma, falls 25 \nwell outside the currently known natural range of triple oxygen isotope 26 \ncompositions, and indicates that the atmosphere had either an exceptionally high 27 \natmospheric CO2 concentrations or an utterly unfamiliar O2 cycle during deposition 28 \nof the diamictites.  29 \n 2 \nTerrestrial sulfate (SO4\n-2\n) has diverse origins and participates in many important 30 \nphysicochemical and biological processes that can be inferred from large ranges in stable 31 \nsulfur and oxygen isotope compositions (1). The δ18O (2) of sulfate ranges from ~+8‰ to 32 \n~+27‰ (VSMOW) (3) for marine sulfate of different geological ages (4) and down to 33 \n~−18‰ for sulfate formed in continental Antarctica (5). In recent years, the sulfate 34 \noxygen isotope composition has been found to vary along another dimension, the ∆17O [≡ 35 \nln (δ17O+1) − 0.52ln (δ18O+1)]. The ∆17O is close to zero for most samples, but positive 36 \n(up to ~+5.94‰) for those of atmospheric origin (6, 7). Most recently, small but negative 37 \n∆17O values have been reported for sulfate derived from oxidative weathering by 38 \natmospheric oxygen, with a conspicuous spike (down to −0.70‰) in the immediate 39 \naftermath of a Marinoan glaciation at ~ 635 Myrs ago (8). Here we report that these 40 \nranges are surpassed dramatically by carbonate-associated sulfate (CAS) extracted from a 41 \nNeoproterozoic Marinoan (9, 10) carbonate unit from Svalbard, Arctic Ocean. This 42 \ncarbonate member (W2) is from the Wilsonbreen Formation (Polarisbreen Group), a 43 \nformation dominated by diamictites representing a continental-scale glaciation (ref. 9, 11). 44 \nW2 contains both limestones and primary dolostones with exceptionally preserved 45 \ngeochemistry (12). We have greatly extended the previous geochemical database, 46 \nincluding isotope compositions of CAS (13) (Fig. S1, Table S1). Note that the “cap 47 \ncarbonate”, the lower Dracoisen Formation, is ~ 80 m above W2, and is not the subject of 48 \nthis study. 49 \nTwo features of the dataset are exceptional in terms of what we know about sulfate 50 \non Earth (Fig. 1): 1) The ∆17OCAS reaches as low as −1.64‰, the most negative anomaly 51 \never reported for terrestrial (vs. extraterrestrial) minerals; 2) The δ18OCAS reaches as high 52 \n 3 \nas ~ +37.7‰, the most positive value ever reported for natural sulfate oxygen. Additional 53 \nfeatures are also intriguing. For example: 3) CAS with a distinct \n17\nO anomaly is 54 \ninvariably from a limestone phase whilst CAS from the dolostone phase does not have 55 \nsuch a distinct \n17\nO anomaly (Fig. 1); 4) Amongst CAS from the limestones, there is a 56 \nstrong positive correlation in ∆17O−δ34S space and the trend line connects with CAS from 57 \nthe immediately pre-glacial dolostone (member E4) (Fig. 1b); 5) The positively 58 \ncorrelated δ18O and δ13C of dolomite ranges from ~−11‰ to +15‰ (VPDB) (3) and from 59 \n~−2 to +5‰ (VPDB) respectively. This δ18OCO3 is the most positive value ever reported 60 \n(Fig. 2a); 6) Excluding pre-glacial samples, a slope of ~ 1 links two clusters of data in 61 \nδ18OCAS − δ\n18\nOCO3 space (Fig. 3); and 7) those calcite samples with negative ∆\n17\nOCAS 62 \nhave a ∆17OCO3 value close to zero, indicating the evaporated water itself did not bear a 63 \n17\nO anomaly (Table S1). 64 \nWe propose the following model to account for this unusual carbonate paragenesis. 65 \nThe environment consisted of lacustrine oases within a continental ice sheet. The lakes 66 \nwere dominantly suboxic and, where local meltwater inflow was low, they and their near-67 \nsurface porewaters were driven to high salinities by extreme evaporation, accompanied 68 \nby intense microbial sulfate redox reactions. Sulfate with negative ∆17O values was 69 \nproduced by oxidative weathering involving atmospheric O2 on the land surface, and was 70 \nwashed into the lakes, along with pre-existing sulfate in rocks undergoing weathering. 71 \nThis mixed sulfate was reduced to sulfides (H2S or HS\n−\n) by bacteria and subsequently 72 \nreoxidized to sulfate by a different microbial community in an oxic to suboxic condition. 73 \nThe re-oxidation was highly efficient, thus causing sulfur isotope mass-balance and 74 \nresulting in a change in the δ34SSO4 much smaller than in the corresponding δ\n18\nOSO4 or 75 \n 4 \nδ18OCO3 value (which should be heavily influenced by the changing δ\n18\nOH2O due to 76 \nvariable degrees of evaporation). No atmospheric O2 signal was incorporated into the 77 \nnewly regenerated sulfate in the water column, as abundant Mn and Fe (Table S1) would 78 \nshuttle electrons between sulfite and dissolved O2 in ambient solution (14-16) without 79 \ndirect contact between reduced sulfur species and O2. Such redox cycling effectively 80 \neliminated the initial sulfate \n17\nO–anomalous oxygen and replaced it with 17O–normal 81 \noxygen from the ambient water during the precipitation of dolostones. The sulfate in 82 \nlimestones however appears not to have been subjected to such intense redox cycling, 83 \nthus enabling them to retain their \n17\nO-anomalous signature. Intensive evaporation 84 \nresulted in highly positive δ18O values for the remaining water in a restricted lake or 85 \nbasin. Carbonate formed in the water would also therefore carry extremely positive δ18O 86 \nvalues. Both the dolomite mineralogy and the ranges of δ13CCO3 and δ\n18\nOCO3 (displaying 87 \nheavier-than-marine values) are characteristic of restricted evaporitic settings (17). 88 \nThe evaporative dolomite-precipitating environments are evidence of microbial 89 \nactivity because they contain microbial laminites (12) and due to the intense redox 90 \ncycling required to explain both the extremely high δ18OCAS values and the disappearance 91 \nof the negative \n17\nO anomalies in these dolomites. As δ18OCAS increases at the same 92 \nmagnitude as δ18OCO3 (Fig. 3), this suggests that almost all the oxygen in the sulfate was 93 \nreplaced by oxygen from ambient water after microbially-mediated sulfur redox cycling. 94 \nThe highly positive δ18OSO4 (up to +37.7‰) therefore should be correlated with the 95 \nhighly positive δ18OH2O in the lakes. The δ\n18\nO of evaporated H2O can be estimated from 96 \nthe highly positive δ18Odolomite, which is unlikely the result of late alteration. Taking into 97 \naccount the uncertainties in precipitation temperature, precipitation kinetics, and 98 \n 5 \ndiagenetic imprint, we estimate (from Fig. 3) a difference between δ18OCAS and δ\n18\nOH2O 99 \nranging from ~20‰ to 30‰, which is similar to the ~ 25‰ to 30‰ recently obtained 100 \nfrom an experimental studies of sulfate reduction (18). We know of no other 101 \nenvironments where the microbial sulfate redox cycling has reached a complete steady 102 \nstate with highly evaporitic ambient water. The closest analog is modern hypersaline 103 \nlagoons near Rio de Janeiro, Brazil, where the δ18OSO4 reaches +21.3‰ in pore waters 104 \nand +20.8‰ in surface brines with an apparent ∆δ18OSO4−H2O at ~+20‰ (19). 105 \nThe most negative value of ∆17OSO4 (−1.64‰) extends greatly the magnitude and 106 \ngeographic occurrence of the negative ∆17OSO4 following the Marinoan glaciation as first 107 \nreported in Bao et al. (8). Bao et al proposed the negative ∆17O was derived from that of 108 \natmospheric O2 involved in the oxidative weathering of sulfur compounds on the surface 109 \nof the Earth (8). Pre-existing ocean sulfate may not have a distinct negative ∆17O value 110 \nbecause continuous microbial sulfur redox cycling tends to replace sulfate oxygen with a 111 \nwater oxygen signal. Thus, sulfate in a restricted continental basin could have the most 112 \nnegative ∆17OSO4 where a significant portion of the sulfate was derived from non-marine 113 \nsources. The value −1.64‰ is more than twice the magnitude of the −0.70‰ reported for 114 \nbarites from Marinoan cap carbonates from South China (8). This is consistent with W2‟s 115 \nsetting, where much if not all the drainage could have been internal.  116 \nWe interpret the strong correlation between ∆17OCAS and δ\n34\nSCAS in limestones (data 117 \nfeature 4, Fig. 1b) as a mixing line between two sulfate endmembers: a pre-existing 118 \nmarine sulfate and a sulfate newly supplied from continental weathering, rather than an 119 \nevaporative trend for an already mixed sulfate in the lakes. This can be justified because 120 \nof the absence of evaporative characteristics in the limestones and their much narrower 121 \n 6 \nscatter of δ18O value (from −13‰ to −4‰VPDB) (Fig. 2b, Fig. 3) compared with that of 122 \nthe evaporative dolomites (from −11‰ to +15‰VPDB) (Fig. 2a). The “mixing” scenario 123 \nis also supported by the isotope compositions of CAS in the pre-glacial carbonates, which 124 \nfall close to the \n34\nS-high end of the line (Fig. 1b). Since sulfate evaporite relics are 125 \nknown to occur in the underlying E4 tidal-flat carbonates (20) it is likely that weathering 126 \nof coeval nodular or bedded sulfate from lateral equivalents of E4 helped stabilize the 127 \nposition of the mixing line.  128 \nIf sulfate derived from oxidative weathering of sulfides in glacial rock flour had a 129 \nglobal average crustal δ34S value of ~ 0‰, the mixing line (Fig. 1b) would point to a 130 \n∆17O of ~−4.2‰ for the non-marine sulfate endmember. This would imply an 131 \natmospheric ∆17O(O2) at ~ −42‰ if only 10% of the oxygen in sulfate came from 132 \natmospheric O2 (8). This estimate contains two large uncertainties − the end-member 133 \nδ34Ssulfides value and the fraction of sulfate oxygen derived from atmospheric O2 − and is 134 \nlikely the most negative bound. If the non-marine sulfate endmember had a δ34S of ~ 135 \n+18‰, as seen near the low end of the data array (Fig. 1b), the atmospheric ∆17O(O2) 136 \nwould be ~ −6.6‰ assuming 1\/4 of the oxygen in sulfate (a probable maximum) came 137 \nfrom atmospheric O2 during surface sulfide oxidation (16, 21). A realistic ∆\n17\nO(O2) value 138 \nprobably lies somewhere between −42‰ and −6.6‰ at the time of W2 deposition. Note 139 \nthat the modern ∆17O(O2) is only ~ −0.10 to −0.20‰ depending on reference slope value 140 \n(ln\n17\n\/ln\n18\n) used for calculation (22, 23). 141 \nThere may be alternative scenarios where a large negative ∆17O(O2) could occur 142 \nmathematically, although geologically there are far fewer scenarios that are viable. The 143 \nmagnitude of the negative ∆17O value of atmospheric O2 is determined by parameters 144 \n 7 \nsuch as stratosphere O3-CO2-O2 reactions, the size of the atmospheric O2 and CO2 145 \nreservoirs, stratosphere-troposphere flux, and troposphere O2 fluxes (8). The controlling 146 \nparameters are often hard to determine, especially for an unfamiliar Earth system, but 147 \nsome constraints exist. Other things being equal, higher CO2 concentrations lead to a 148 \nmore negative ∆17O(O2) value as the CO2 develops a positive anomaly by exchange with 149 \noxygen. Assuming a steady-state O2 reservoir and modern gas fluxes, the 1-D model in 150 \nBao et al (8) would predict a pCO2 level of ~12,500 to ~ 80,000 ppm during W2 151 \ndeposition, consistent with the Earth having gone through a prolonged,  ice-covered 152 \nperiod, i.e. a „snowball‟ Earth (24). It should be noted that a much lower pO2 and a 153 \nmoderately high pCO2 also could produce a similarly negative ∆\n17\nO(O2), but only if the 154 \ncorresponding O2 residence time (i.e. pO2\/flux) were disproportionally long. Prolongation 155 \nof the residence time whilst keeping oxygen concentrations low implies much lower rates 156 \nof both O2 removal by respiration\/decomposition and input by photosynthesis, a balance 157 \nthat is consistent with near-global glaciations. Other non-steady-state scenarios can also 158 \nbe imagined where bizarre combinations of changes in reservoirs and fluxes of 159 \natmospheric O2 and CO2 could have resulted in the observed large negative ∆\n17\nO(O2) in 160 \ncertain time windows. These scenarios could be explored by combining models and 161 \nfurther empirical data, but geology offers a stronger constraint since circumstances under 162 \nwhich sulfate can be preserved in terrestrial sedimentary records are uncommon.  163 \nAlthough various aspects of Neoproterozoic glaciations are intensely disputed (25), 164 \nour results confirm a profound difference from Phanerozoic ice ages. A near-global 165 \ndistribution of glaciated continents during a „Marinoan‟ phase ending 635-630 Myr ago is 166 \nsupported by evidence of low palaeomagnetic latitudes (26). The „snowball‟ Earth model 167 \n 8 \n(27) predicts a progressive accumulation of volcanic volatiles in the atmosphere which 168 \nare not removed by weathering until the rapid demise of the ice age as the ice-albedo 169 \nfeedback reverses. If sulfate with large negative ∆17O signals derived from oxidative 170 \nweathering could only be generated in significant quantity after melting of the “snowball” 171 \nand exposure of continents, then the diamictites above W2 had to be deposited during 172 \nfinal glacial retreat, a hypothesis that should prompt a re-examination of their 173 \nsedimentology. The alternative “slushball” model, in which parts of the ocean area are 174 \nice-free (28), would also permit accumulation of sulfate from prolonged oxidative 175 \nweathering in certain continental “oases” where arid but cold conditions prevailed. This 176 \nstudy provides an effective way to study the dynamics of sedimentation and atmospheric-177 \nhydrosphere-biosphere interactions during a global glaciation and highlights the need for 178 \nfurther stratigraphically constrained ∆17OSO4 data on continental carbonate precipitates to 179 \nground-truth flux-balance models. 180 \n 181 \n 9 \n References and Notes 182 \n1. H. M. Bao, D. Rumble, D. R. Lowe, Geochimica et Cosmochimica Acta 71, 4868 183 \n(2007). 184 \n2. δ18O or δ17O ≡ Rxsample\/R\nx\nstandard − 1 and R\nx\n = \n18\nO\/\n16\nO or \n17\nO\/\n16O; the same δ 185 \nnotation applies to δ13C or δ34S in this paper. 186 \n3. Reference units for stable isotope compositions: Vienna Standard Mean Ocean 187 \nWater (VSMOW) for sulfate δ18O, δ17O, and ∆17O, Vienna PeeDee Belemnite 188 \n(VPDB) for carbonate δ13C and δ18O, and Vienna Canyon Diablo Troilite (VCDT) 189 \nfor sulfate δ34S. 190 \n4. G. E. Claypool, W. T. Holser, I. R. Kaplan, H. Sakai, I. Zak, Chemical Geology 191 \n28, 199 (1980). 192 \n5. R. A. Socki, R. P. Harvey, D. L. Bish, E. Tonui, H. Bao, in Lunar and Planetary 193 \nScience Conference. (NASA, Houston, 2008), vol. XXXIX, pp. 1964. 194 \n6. H. M. Bao, Chemical Geology 214, 127 (2005). 195 \n7. H. M. Bao, M. H. Thiemens, D. B. Loope, X. L. Yuan, Geophysical Research 196 \nLetters 30, 1843; 10.1029\/2003GL016869 (2003). 197 \n8. H. M. Bao, J. R. Lyons, C. M. Zhou, Nature 453, 504 (2008). 198 \n9. G. P. Halverson, A. C. Maloof, P. F. Hoffman, Basin Research 16, 297 (2004). 199 \n10. G. P. Halverson, in Neoproterozoic Geobiology and Paleobiology S. Xiao, A. J. 200 \nKaufman, Eds. (Springer, New York, 2006) pp. 231-271. 201 \n11. I. J. Fairchild, M. J. Hambrey, Precambrian Research 73, 217 (1995). 202 \n12. I. J. Fairchild, M. J. Hambrey, B. Spiro, T. H. Jefferson, Geological Magazine 203 \n126, 469 (1989). 204 \n 10 \n13. Materials and methods are available as supporting material on Science Online. 205 \n14. G. W. Luther, Geochimica et Cosmochimica Acta 51, 3193 (1987). 206 \n15. C. O. Moses, J. S. Herman, Geochimica et Cosmochimica Acta 55, 471 (1991). 207 \n16. N. Balci, W. C. Shanks, B. Mayer, K. W. Mandernack, Geochimica et 208 \nCosmochimica Acta 71, 3796 (2007). 209 \n17. M. R. Talbot, Chemical Geology 80, 261 (1990). 210 \n18. J. Farquhar, D. E. Canfield, A. Masterson, H. Bao, D. Johnston, Geochimica et 211 \nCosmochimica Acta 72, 2805 (2008). 212 \n19. N. F. Moreira, L. M. Walter, C. Vasconcelos, J. A. McKenzie, P. J. McCall, 213 \nGeology 32, 701 (2004). 214 \n20. I. J. Fairchild, M. J. Hambrey, Precambrian Research 26, 111 (1984). 215 \n21. B. J. Reedy, J. K. Beattie, R. T. Lowson, Applied Spectroscopy 48, 691 (1994). 216 \n22. A. Angert, S. Rachmilevitch, E. Barkan, B. Luz, Global Biogeochemical Cycles 217 \n17, #1030 (2003). 218 \n23. B. Luz, E. Barkan, Geochimica et Cosmochimica Acta 69, 1099 (2005). 219 \n24. R. T. Pierrehumbert, Journal of Geophysical Research-Atmospheres 110 (2005). 220 \n25. I. J. Fairchild, M. J. Kennedy, Journal of the Geological Society 164, 895 (2007). 221 \n26. D. A. D. Evans, American Journal of Science 300, 347 (2000). 222 \n27. P. F. Hoffman, D. P. Schrag, Terra Nova 14, 129 (2002). 223 \n28. T. J. Crowley, W. T. Hyde, W. R. Peltier, Geophysical Research Letters 28, 283 224 \n(2001). 225 \n 226 \n 227 \n 11 \n29.  H.B. and I.J.F. designed research and led the writing of the manuscript. H.B. 228 \nperformed CAS extraction and triple oxygen isotope measurements. I.J.F secured 229 \nsamples from field expeditions, and conducted sedimentological, petrographic, 230 \nmineralogical and elemental studies. P.M.W. conducted preliminary CAS 231 \nextraction and performed δ34SCAS analysis; C.S. carried out δ\n13C and δ18O analysis 232 \nof host carbonates. We thank Galen Halverson for discussion and Yongbo Peng 233 \nfor analytical assistance. Financial and facility supports are provided by LSU, 234 \nNSF, and Chinese Academy of Science (H.B.), NERC standard grant 235 \n(GR3\/C511805\/1) and NERC ICP-MS facilities (I.J.F.), and Austrian Science 236 \nFunds (C.S.).  237 \n 238 \nAuthor Information  239 \nThe authors declare no competing financial interests. 240 \nCorrespondence should be addressed to H.B. (bao@lsu.edu). 241 \n 242 \nFigures; 243 \n 244 \n 245 \n 246 \n 247 \n 248 \n 249 \n 250 \n 12 \nFigure 1 251 \n 252 \n 253 \n 254 \nFigure 2 255 \n 256 \n 257 \n 258 \n 13 \nFigure 3 259 \n 260 \n 261 \n 262 \n 263 \n 264 \n 265 \n 266 \n 267 \n 268 \n 269 \n 14 \nSupporting Online Material 270 \n1. Methods  271 \n2. The Middle Carbonate Member (W2) the Wilsonbreen Formation, Neoproterozoic 272 \nSvalbard 273 \nTable S1 274 \nTable S2 275 \n 276 \n 277 \n"}