{"doi":"10.1103\/PhysRevE.66.051909","coreId":"68650","oai":"oai:eprints.lancs.ac.uk:31815","identifiers":["oai:eprints.lancs.ac.uk:31815","10.1103\/PhysRevE.66.051909"],"title":"Regions of cardiorespiratory synchronization in humans under paced respiration.","authors":["Rzeczinski, S.","Janson, N. B.","Balanov, A. G.","McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-11-19","abstract":"Cardiorespiratory synchronization under paced respiration is studied systematically as the respiration frequency is changed between 3 and 30 breaths per min. We plot a one-dimensional cut of the classical picture of synchronization regions along the line defining the current breathing amplitude. The existence of n:m synchronization regions of finite width is demonstrated for each of six subjects studied. The statistics of the different types of synchronization and their stability are discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68650.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/31815\/1\/PRE2002PacedResp.pdf","pdfHashValue":"b98810e26011cdddd7fe32978dbfb89b02b55c4a","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:31815<\/identifier><datestamp>\n      2018-01-24T02:56:55Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Regions of cardiorespiratory synchronization in humans under paced respiration.<\/dc:title><dc:creator>\n        Rzeczinski, S.<\/dc:creator><dc:creator>\n        Janson, N. B.<\/dc:creator><dc:creator>\n        Balanov, A. G.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        Cardiorespiratory synchronization under paced respiration is studied systematically as the respiration frequency is changed between 3 and 30 breaths per min. We plot a one-dimensional cut of the classical picture of synchronization regions along the line defining the current breathing amplitude. The existence of n:m synchronization regions of finite width is demonstrated for each of six subjects studied. The statistics of the different types of synchronization and their stability are discussed.<\/dc:description><dc:date>\n        2002-11-19<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31815\/1\/PRE2002PacedResp.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevE.66.051909<\/dc:relation><dc:identifier>\n        Rzeczinski, S. and Janson, N. B. and Balanov, A. G. and McClintock, Peter V. E. (2002) Regions of cardiorespiratory synchronization in humans under paced respiration. Physical Review E, 66 (5). 051909. ISSN 1539-3755<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/31815\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1103\/PhysRevE.66.051909","http:\/\/eprints.lancs.ac.uk\/31815\/"],"year":2002,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"PHYSICAL REVIEW E 66, 051909 ~2002!Regions of cardiorespiratory synchronization in humans under paced respiration\nS. Rzeczinski, N. B. Janson, A. G. Balanov, and P. V. E. McClintock\nDepartment of Physics, Lancaster University, Lancaster, LA1 4YB, United Kingdom\n~Received 21 June 2002; published 19 November 2002!\nCardiorespiratory synchronization under paced respiration is studied systematically as the respiration fre-\nquency is changed between 3 and 30 breaths per min. We plot a one-dimensional cut of the classical picture of\nsynchronization regions along the line defining the current breathing amplitude. The existence of n:m syn-\nchronization regions of finite width is demonstrated for each of six subjects studied. The statistics of the\ndifferent types of synchronization and their stability are discussed.\nDOI: 10.1103\/PhysRevE.66.051909 PACS number~s!: 87.19.Hh, 87.80.Vt, 87.80.Tq, 05.45.XtI. INTRODUCTION\nIt has long been known that cardiorhythm is influenced by\nrespiration, a phenomenon called respiratory sinus arrhyth-\nmia ~RSA! @1–4#. RSA is a modulation of the heart rate\nresulting from interaction between the processes of respira-\ntion and heart rhythm generation. This interaction can some-\ntimes cause the related but different phenomenon of synchro-\nnization @5–9#. Cardiorespiratory synchronization ~CRS!\nmanifests itself through entrainment between heart and res-\npiration rates @10–13#, and has been shown to be useful for\nmedical diagnostics in humans @14# and in rats @15#.\nRSA has been widely studied, both in freely breathing\nsubjects, and in subjects performing paced respiration where\nbreathing is synchronized with some external signal @16,17#.\nPaced respiration is now a well-established tool for relax-\nation and for the treatment of chronic pain and insomnia,\ndental and facial pain, etc. @18–20#. Modulation of heart rate\ndue to paced respiration was systematically studied in Refs.\n@21,22#: in Ref. @21# three values of respiration frequency,\nand in Ref. @22#, the frequency range between 0.083 Hz to\n0.2 Hz, were examined. CRS has been detected in subjects\nundergoing paced respiration @23# and the cardiorespiratory\ninteraction has been used as a diagnostic tool @24#. In clinical\npractice, and occasionally in everyday life, the need can arise\nto control the heart rate without involving invasive or com-\nplex techniques. It is known that a change of respiration\nparameters can lead, not only to modulation of the heart rate,\nbut also to a shift in its average value. In this context paced\nrespiration would appear to be a promising technique for the\ncontrol of heart rate. However, there have been no systematic\nstudies of the synchronization of heart rate by paced respira-\ntion, and a number of important questions remain open. For\nexample, it is important to know whether CRS is stable un-\nder variation of the frequency of paced respiration. Does this\nphenomenon occur randomly, or are there ranges of paced\nrespiration frequency when synchronization is to be expected\nwith a larger probability, in spite of noise and nonstationar-\nity? What types of n:m synchronization appear most fre-\nquently during paced respiration? The present work is an\nattempt to answer these questions.\nFrom the viewpoint of oscillation theory, the cardiovascu-\nlar system ~CVS! can be treated as a self-sustained oscillator\nwhose basic frequency is the average heart rate, and where\nrespiration can be regarded as an external forcing. According\nto theory, the average frequency of self-oscillation can1063-651X\/2002\/66~5!\/051909~9!\/$20.00 66 0519change whenever external forcing is applied, regardless of\nwhether or not synchronization takes place. However, syn-\nchronization preserves a constant ratio between the forcing\nand response frequencies while either the forcing or the sys-\ntem parameters are varied. Thus, to predict the effect of forc-\ning, one needs to know in detail how the CVS responds to a\nchange in the parameters of forcing, the latter being paced\nrespiration. In mathematical terms, one needs a bifurcation\ndiagram ~map of regimes! in a plane of the control param-\neters, for example, the respiration-amplitude versus\nrespiration-frequency plane, delineating the synchronous and\nasynchronous regimes for every individual. This is an ideal-\nized and ambitious goal which will not be addressed here in\nview of the unavoidable restrictions imposed on the study of\nany living system. The more modest aim of the present work\nis to reveal a one-dimensional cut of the complete map of\nregimes defined by the frequency of paced respiration. Even\na rough picture of this kind, showing the transitions through\ndifferent synchronous and asynchronous regimes as just one\ncontrol parameter is increased, can provide some indication\nof the global structure.\nIn contrast to experiments with, e.g., electronic oscilla-\ntors, the parameters of a living system cannot be kept con-\nstant but continuously vary. The CVS is influenced by a huge\nnumber of factors that change in time. Such changes cannot\nbe eliminated, even when the subject is fully relaxed, but\nconstitute unavoidable manifestations of noise and nonsta-\ntionarity. In this situation, even the existence of synchroni-\nzation that is stable under variation of forcing parameters\nbecomes questionable.\nThe structure of this paper is as follows. In Sec. II basic\ndefinitions are given and assumptions about the system under\nstudy are formulated, allowing the problem to be considered\nin terms of oscillation theory. Section III describes experi-\nments. Section IV describes the techniques used for data pro-\ncessing. The results obtained are given in Sec. V. Section VI\ncontains a discussion and Section VII some conclusions.\nII. THEORETICAL BACKGROUND\nSynchronization between two or more interacting oscilla-\ntory systems is a fundamental phenomenon @5–9#. For two\ninteracting, self-sustained ~dissipative, nonlinear!, systems it\nmanifests itself as an adjustment of their basic frequencies\nf 1 , f 2 so as to satisfy the relation n f 15m f 2, where n and m\nare integers. Synchronization with the given values of n and©2002 The American Physical Society09-1\nRZECZINSKI et al. PHYSICAL REVIEW E 66, 051909 ~2002!m is called ‘‘n:m synchronization.’’ Another manifestation of\nsynchronization is adjustment of the phases w1(t) and w2(t)\nof the interacting systems so as to satisfy\nuunw1~ t !2mw2~ t !u2Cu,e , ~1!\nwhere t is ~continuous! time, C is some constant and e\n,2p . Synchronization can occur either when the two sys-\ntems mutually influence each other ~bidirectional coupling!,\nor when one system forces the other without feedback ~uni-\ndirectional coupling!. According to the theory of synchroni-\nzation of periodic @25# ~and even chaotic! oscillations, syn-\nchronization occurs when certain conditions on both the\nfrequency and amplitude of forcing are satisfied. Let the ba-\nsic frequency of unforced oscillations in the system be f 0,\nthe amplitude and frequency of forcing be A and f f , respec-\ntively, and the basic frequency of forced oscillations be f.\nThe quantity D f 5( f f \/ f 0)2(n\/m) is the frequency detuning\nbetween the system and the forcing, and f f \/ f 0 is their fre-\nquency ratio. Then, the larger D f is, the larger the A that is\nneeded to synchronize the system. For a periodic system\nforced periodically, a common structure for the n:m synchro-\nnization regimes in the ‘‘forcing amplitude’’—‘‘frequency\nratio’’ parameter plane, for relatively small values of A, is\nshown in Fig. 1 @25#. Synchronization regions have the shape\nof horns. They are now commonly referred to as Arnol’d\ntongues. Each tongue begins with a point on the abscissa axis\nwhich is equal to the corresponding n:m value. For weak\nforcing, the larger the value of m, the narrower is the syn-\nchronization tongue, at least for m.4 @26#. For weak forcing\nthe transition from an asynchronous to a synchronous regime\nis associated with the transition from an ergodic to a resonant\ntorus in the phase space. If m,4, the synchronization is\ncalled a ‘‘strong resonance,’’ and if m>4 the resonance is\ncalled ‘‘weak.’’ A very important feature of the synchroniza-\ntion phenomenon is its robustness: that is, if one is inside the\nsynchronization tongue, a small variation of D f and ~or! or A\nshould not lead to disappearance of the effect. A qualitatively\nsimilar picture of synchronization regions was also observed\nfor chaotic @27# and even for stochastic @28# oscillations.\nIf the interacting systems are periodic and subject to noise\n@29#, or chaotic ~maybe, also with noise! @30#, Eq. ~1! can\nonly remain satisfied during finite time intervals. In this case,\nthere is no strict definition of either synchronization or syn-\nchronization regions. Whether or not to treat an observed\nFIG. 1. Sketch of the structure of the synchronization ~Arnold!\ntongues on the parameter plane: frequency-ratio versus forcing am-\nplitude. The dashed line shows the kind of one-dimensional cut\nthrough this map of regimes that was sought in the experiments.05190regime as synchronous depends solely on the judgement of\nthe observer. Usually, a regime is considered to be synchro-\nnous when the duration of the plateau defined by Eq. ~1!\nexceeds some predefined number of basic oscillation periods.\nSynchronization persisting only during a finite time interval\nis known as effective synchronization @31#. Following this\nnotation, we will hereinafter refer to the average relative du-\nration of synchronization epochs as the effectiveness of the\nsynchronization, for brevity.\nIt is known that an isolated heart can continue to contract\nrhythmically for a long time at a very stable frequency, that\nis, it behaves as a self-sustained oscillator. It is also known\nthat respiration affects heart rate much more strongly than\nthe heart activity affects respiration @32#. Thus, as a good\napproximation, one can assume that respiration forces heart\nrate in a unidirectional manner. This forcing can be easily\nbrought very close to being periodic through paced respira-\ntion. With these assumptions, we can treat the CVS of a\nhuman undergoing paced respiration as a generator under\nperiodic forcing, affected by noise and nonstationarity. Syn-\nchronization theory should therefore be applicable.\nWe change the frequency of paced respiration gradually\nbetween the feasible extreme frequencies of 0.05–0.5 Hz. It\nis known ~ @32#, and references therein! that normally, the\nsmaller the breathing frequency, the larger its amplitude,\nsince the average volume of air required to go through the\nsystem per unit time is roughly the same. We aim to establish\nwhether n:m synchronization between respiration and heart\nrate took place for the given respiration frequency by com-\nparing the forcing and response signals. In this way, we aim\nto plot a one-dimensional cut of the map of regimes along\nthe curve formed by the current values of forcing amplitude,\nsketched in Fig. 1 as a dashed line.\nIII. DESCRIPTION OF MEASUREMENTS\nSix volunteers participated in the measurements. They\nwere young men aged 22–29 years, non-smokers, without\nany history of cardiopulmonary disease. The sessions were\nperformed 3–4 h after the last meal, and no caffeinated bev-\nerage was taken on the day of the experiment.\nEach subject was asked to lie on a bed in a comfortable\nposition, with his head on a pillow, slightly tilted. An interval\nof about 20 min followed in order to achieve full relaxation.\nValues of heart rate were measured and compared several\ntimes during this period, to establish that relaxation had\ntaken place. A signal with which to synchronize respiration\nwas generated by computer and presented to the subject as a\nseries of light and sound pulses of duration 0.1 sec as de-\nscribed in Ref. @33#: he was able to see a red square on the\ncomputer screen and hear the sound. He was asked to inhale\nwhen the sound and light signal appeared, and to exhale at\nhis convenience before being prompted to inhale again by\nthe next signal. We did not impose any restrictions on the\namplitude of breathing, and suggested to subjects that they\nshould breathe to whatever depth felt most comfortable for\nthe given frequency.\nAfter about 20 sec, the subject was breathing as pre-\nscribed by the generated signal and had become accustomed9-2\nREGIONS OF CARDIORESPIRATORY . . . PHYSICAL REVIEW E 66, 051909 ~2002!to the regime being imposed. Simultaneous measurements of\nthe ECG and the respiration signals were then initiated, and\ncontinued for 180 sec. The respiration signal was measured\nusing a respiratory effort transducer by Biopac Systems Inc.,\nand the ECG signal by positioning three electrodes on the\nright and left shoulder and on the last rib on the subject’s left.\nFor each new measurement, the respiration frequency f resp\nwas increased by 1 breath per min ~i.e., by 1 min21). The\nminimal and maximal respiration frequencies were selected\nexperimentally to be 3 and 30 min21, respectively, so that\nthey should not be too difficult for the subject. Thus, 28\ndataset pairs were measured for each subject. In between\nmeasurements the subject was allowed to relax for about 5\nmin until his heart rate, averaged over 1 min, had stopped\nchanging. The average heart rate at rest was recorded to pro-\nvide the current value of f 0 before each new measurement.\nThe measurements for each subject were completed in a\nsingle continuous session ~except for subject 2! lasting for\nabout 4 h in total. This procedure was adopted because, to\nplot a map of regimes, we were interested in ensuring that\nthe experimental conditions ~weather, room temperature,\ntime of the day, etc.! and the physical and mental state of the\nsubject, remained as constant as possible. The relatively\nlarge number of datapoints needed to create the map of re-\ngimes, and the necessity of completing the measurements for\na given subject in one session, imposed restrictions on the\ntime per measurement. On the one hand, the time of one\nmeasurement should not be too short. In practice, however,\nour preliminary experiments have shown that a session can-\nnot reasonably exceed 3–4 h, because a longer time is ex-\nhausting for the volunteer. Compromise was obviously nec-\nessary, and 3 min was selected as being the optimal time per\nmeasurement.\nFor any given subject, the respiratory effort transducer\nand ECG electrodes were positioned once at the beginning of\nthe measurements, and not adjusted subsequently during the\nrest of the session. We can therefore make meaningful com-\nparisons between the relative amplitudes of respiration\nthroughout the whole session for that particular subject.\nFor two of the six subjects we repeated the measurements\nseveral days after the first session. This was done in order to\nlearn whether the effect of cardiorespiratory synchronization\ncan easily be reproduced when the experimental conditions\nand the state of the subject ~mood, food taken, previous ac-\ntivities, etc.! would all have been slightly different.\nThe first session with subject 2 was an exception, how-\never: it was split into two parts. Measurements for respira-\ntion frequencies f resp of 3–15 min21 inclusive were com-\npleted on the first day, and those for f resp of 16–30 min21\ninclusive were done on the next day.\nIV. DATA PROCESSING TECHNIQUES\nThe ultimate goal of our study was to plot a curve split\ninto segments of nonsynchronized and n:m synchronized ac-\ntivity on the plane of the two control parameters f resp \/ f 0 and\nA resp ~see Fig. 1 for a sketch of the curve!, where A resp and\nf resp are the amplitude and frequency of paced respiration,\nrespectively. Following the representation in Fig. 1, we chose05190to normalize the respiration frequency f resp to the average\nheart rate before measurement f 0, for two reasons. First, the\naverage heart rate in relaxation differs between subjects, im-\nplying that the same respiration frequency can lead to differ-\nent synchronization orders in them. Normalization allows us\nto compare the synchronization regions of different subjects.\nSecond, the average heart rate changes slightly in the course\nof experiments, in spite of all precautions, so that f 0 will not\nbe quite constant in a given subject before different measure-\nments within the same session.\nThe ratio of the two numbers f resp and f 0 is readily com-\nputed to find the coordinate on the horizontal axis. The co-\nordinate A resp on the vertical axis is the amplitude of the\nrespiration signal. Strictly speaking, its amplitude was not\nconstant from one breath to the next. By amplitude we there-\nfore mean an average amplitude. We define A resp as the\nsquare root of the signal power, assessed by integration over\nits Fourier power spectrum. A one-dimensional cut of the\nmap of regimes is thus straightforward to plot.\nThe next step is to split this curve into segments corre-\nsponding to synchronized and nonsynchronized regimes. The\nabsence or presence of n:m phase synchronization is de-\ntected by introducing phases for both respiration and ECG\nand computing the phase difference\nDw~ t !5\nn\nm\nwecg~ t !2w resp~ t !. ~2!\nIn order to establish the values of n and m, we first find a\nrough approximation of the synchronization order n:m by\ncomputing the Fourier spectra of the respiration and ECG\nsignals and finding the ratio of their basic frequencies j\n5 f resp \/ f ecg . After that we try several values of n which,\nbeing multiplied by j will be close to some integer value m.\nIn doing so, we try to find n and m values that are not larger\nthan 15 because, according to the theory, the larger the de-\nnominator of the synchronization order, the narrower is the\nsynchronization tongue. In the presence of noise ~which is\ninevitable in real systems! these tongues will be smeared.\nFurthermore, the relatively rough sampling provided by our\n28-point curve made it quite improbable that points would\nfall within the narrow tongues.\nThe presence of n:m synchronization was arbitrarily de-\nfined by the condition that\nuDw~ t !2Cu,\np\nm\n, ~3!\nduring 5 periods of respiration, or longer. In practice, how-\never, for all respiration frequencies larger than 0.25 Hz\n(15 min21) we seek for plateaus lasting 20 sec or longer.\nThere may be several such plateaus during the same mea-\nsurement. If at least one plateau of sufficient duration is de-\ntected, we attribute that measurement to the corresponding\nn:m synchronization region.\nSometimes ~but rarely! during the same measurement\nswitchings between synchronization regimes of different or-\nders n:m occur. We then attribute the same measurement to\ntwo different synchronization tongues. Where several succes-\nsive values of respiration frequency lead to the same syn-9-3\nRZECZINSKI et al. PHYSICAL REVIEW E 66, 051909 ~2002!chronization order n:m , they form the required segment of\nthe curve belonging to the same tongue.\nThere are several different ways for introducing phases\nfrom one-dimensional signals @34#. One way is to store all\ntime moments t i when the signal x(t) crosses some threshold\nlevel u in one direction ~e.g., from above to below! and then\nattribute to each such crossing a phase increase of 2p . An\nillustration of this technique is given in Fig. 2, where an\nECG of one of our healthy volunteers @Fig. 2~a!# is given\ntogether with his simultaneously measured respiration signal\n@Fig. 2~b!#. For the ECG, following the usual convention, we\ncount only intersections of the so-called R peak @the highest\nand narrowest peak, negative going as plotted in Fig. 2~b!#\nwith the threshold. If threshold levels are crossed at the time\nmoments t i\necg and t i\nresp\n, the phases for ECG and respiration\nare defined as follows:\nwecg~ t !52p\nt2t i\necg\nt i11\necg 2t i\necg 12pi , tP]t i\necg ;t i11\necg ]\nw resp~ t !52p\nt2t i\nresp\nt i11\nresp 2t i\nresp 12pi , tP]t i\nresp ;t i11\nresp ], ~4!\nwhere i is the number of the crossing.\nAnother method is to reconstruct the phase portrait from a\nsignal, project it onto the phase plane and introduce phase as\na phase angle on this plane. For the reconstruction of the\nphase plane one can use various methods, including the Hil-\nbert transform @7# and delay embedding @35#. Delay embed-\nding is easier to implement and requires much less compu-\ntation time and resources than the Hilbert transform. It is\nknown that for an ~almost! periodic signal, the optimal time\ndelay t is equal to a quarter of a period. In Fig. 3, delay\nFIG. 2. Illustration of the first method of phase definition, using\nEq. ~4!. ~a! ECG of subject No. 4 breathing with frequency\n21 min21 ~0.35 Hz!. ~b! The corresponding respiration signal. Both\nsignals are given in arbitrary units. Horizontal lines indicate the\nchosen threshold levels. In each case, the filled circles show inter-\nsections of the signal with the level from above, at the moments of\ntime t i\necg in ~a! for the R peak in the ECG, and t i\nresp in ~b! for the\nrespiration signal, respectively.05190embedding of the respiration signal shown in Fig. 2~b! is\nillustrated for the optimal time delay. The phase of respira-\ntion is then\nw resp~ t !5arctan2\nx resp~ t1t!\nx resp~ t !\n12pi , ~5!\nwhere, emulating Fortran, we denote by arctan2 the arctan\nfunction unwrapped from the interval @2p;p# ~rather than\nthe conventional @2p\/2;p\/2# interval!; i is the number of\ncomplete revolutions which have taken place by the time t.\nIn our study we introduced phase for the ECG using Eq. ~4!,\nand tried both Eqs. ~4! and ~5! for respiration signal. As\nexpected, the results obtained were independent of the\nmethod by which phase was introduced for the respiration\nsignal.\nV. RESULTS\nIn Fig. 4 values of R-R intervals are given for all sessions\nof measurements for all six subjects. The horizontal axis is\nsplit by vertical lines into segments of duration 180 sec, be-\ning the duration of one measurement. R-R intervals within\nseparate neighboring measurement are also marked by differ-\nent shades to help to distinguish between them. The integers\nbeneath segments mark the frequency of paced respiration in\nbreaths per minute. In the first plot for subject 2 one can see\na discontinuity between the measurements for respiration fre-\nquencies 15 and 16 min21. This was due to the break of 1\nday between these measurements. All other sets of measure-\nments were done in single sessions, and there are no abrupt\njumps in the series of R-R intervals between successive mea-\nsurements.\nBy average heart rate we will mean the reciprocal of the\naverage R-R interval during the time of one measurement.\nFigure 5 plots ~a! the average values and ~b! the variance of\nthe R-R intervals shown in Fig. 4, as functions of the respi-\nration frequency. Designations for the different subjects are\ngiven in the figure caption. It is interesting to note that, with\nthe exception of subject 2, average heart rate either did not\nchange much with increasing respiration frequency ~subject\n4!, or it slightly decreased. In subject 2, the average heart\nrate increased markedly during the first half of the session,\nFIG. 3. Projection onto the phase plane of the phase portrait,\nrestored by delay embedding from the respiration signal shown in\nFig. 2~b!. The signal is given in arbitrary units. The time delay t is\nequal to a quarter of the respiration period and w(t) is the phase\nangle.9-4\nREGIONS OF CARDIORESPIRATORY . . . PHYSICAL REVIEW E 66, 051909 ~2002!FIG. 4. R-R intervals for all measurement sessions with different frequencies of paced respiration, for all six subjects. The horizontal axes\nare split by vertical lines into segments of duration 180 sec ~the time of one measurement!. The integers below segments mark the\ncorresponding frequency of paced respiration in breaths per minute.the average value of the R-R interval decreasing almost lin-\nearly. However, in the second half of the session the behavior\nof the average heart rate is qualitatively the same as for the\nother subjects. An increase in the frequency of paced respi-\nration led to a decrease in heart rate variability in all subjects.\nIn Fig. 6~a! the amplitude of the respiration signal A resp is\nplotted as a function of respiration frequency f resp for all six\nsubjects, who are indicated by different symbols. The respi-\nration amplitude is expressed in arbitrary units and its abso-\nlute magnitude is not comparable between different subjects.\nAs predicted, the larger the frequency of breathing, the\nsmaller its amplitude is, on average. In Fig. 6~b! A resp is\nshown as a function of the frequency ratio f resp \/ f 0. We use\nthe same designations for individual subjects in Figs. 6~a!\nand 6~b! as those in Fig. 5.\nSome typical plots of phase difference Dw(t) are shown\nin Figs. 7~a!, 7~b!, and 7~c!. Horizontal lines mark the limits\nof the plateaus defined by Eq. ~3!. In Fig. 7~a! Dw(t) is\nshown for subject number 4 breathing with frequency\n26 min21 (0.433. . . Hz) for n:m52:5. One can observe a\n75 sec plateau, demonstrating the presence of 2:5 phase syn-\nchronization between respiration and heart rate. Figure 7~b!\nFIG. 5. ~a! Average value and ~b! variance of the R-R intervals\nshown in Fig. 4 for the first or only measurements for: subject No.\n1 ~circles!; 2 ~squares!; 3 ~diamonds!; 4 ~up-pointing triangles!; 5\n~left-pointing triangles!; and 6 ~down-pointing triangles!.05190shows Dw(t) for subject number 5 breathing with frequency\n17 min21 (0.2833. . . Hz) for n:m51:3. One can see two\nplateaus lasting 40 sec and 70 sec, between which switching\noccurs. Figure 7~c! shows three plateaus of Dw(t) for\nsubject number 4 breathing with the frequency 28 min21\n(0.4666. . .Hz). The first and the third segments correspond\nto n:m52:5 ~black curve!, while the second segment corre-\nsponds to n:m53:7 ~gray curve!. This picture shows that\nswitching from 2:5 to 3:7 synchronization and back took\nplace during the period of observation.\nThe right-hand column of Fig. 7 shows the corresponding\ntime dependences of the R-R interval, and of the respiration\nsignal at the moment when the R peak occurs. Thus, strobo-\nscopic sections of the respiration signals are taken at the time\nmoment when the phase of ECG changes by 2p . In Figs.\n7~d!, 7~e!, and 7~f!, the R-R intervals are rescaled so that\ntheir dynamics can be compared with that of the respiration\nsignal.\nNext, synchronization regions were plotted for each of the\nsix subjects ~Fig. 8!. In the first column, data for subjects 1,\n2, and 3 are presented for the first ~or only! measurement\nFIG. 6. Amplitude of respiration versus ~a! respiration fre-\nquency in breaths per minute (min21); ~b! ratio of respiration fre-\nquency f resp to the average heart rate before measurement f 0, for\nthe first or only measurements with all six subjects. Designations of\nthe symbols are the same as in Fig. 5.9-5\nRZECZINSKI et al. PHYSICAL REVIEW E 66, 051909 ~2002!session. The second column shows plots for the second ses-\nsions with subjects 2 and 3. The third column contains data\nfor subjects 4, 5, and 6.\nIn each plot of Fig. 8, the horizontal axis gives the value\nof the paced respiration frequency f resp divided by average\nheart rate immediately before measurement f 0. The vertical\naxis is the average amplitude of respiration A resp . The\ndashed line connects the positions of the measurement points\nmarked by circles @which for complete measurements are the\nsame as those shown in Fig. 6~b!#. Empty circles indicate the\nabsence of any synchronization, while filled circles mark\nsynchronous regimes.\nFrom the theory we know that a synchronization region\nshould grow from a point (n:m) at zero forcing amplitude,\nand as the latter increases, their widths should increase, too.\nWe have no precise information about how the boundaries of\nthe synchronization regions evolve. We only know that, for\nvery small forcing amplitude, they are straight lines rising\nfrom the horizontal axis. To estimate roughly the limits of\neach synchronization region, we connect the theoretical start-\ning point (n:m) on the horizontal axis with the bounding\npoints of the same region on the experimental curve. The\nexperimental synchronization tongues, estimated in this way,\nare shown as the shaded regions in Fig. 8.\nTo estimate the effectiveness ~see Sec. II! of the synchro-\nnization observed under different conditions, we count the\ntotal duration tpl of all plateaus of phase difference Dw(t)\nfor the particular value of respiration frequency f resp and syn-\nchronization order n:m . We denote the observation time\n~here 180 sec! as tobs . The ratio tpl \/tobs3100% gives us the\nfraction of time during which the heart rate is synchronized\nby respiration at the given n:m . Figure 9 shows the ratio\nFIG. 7. Left-hand column: typical plots of phase difference\nDw(t) for different frequencies of paced respiration. ~a! 2:5 phase\nsynchronization during 75 sec for f resp526 min21; ~b! 1:3 phase\nsynchronization during 150 sec for f resp517 min21; ~c! transitions\nbetween 2:5 and 3:7 synchronization for the same frequency of\npaced respiration for f resp528 min21. Horizontal lines mark the\nlimits defined by condition ~3!. Right-hand column: plots of RR\nintervals ~above! and the values of respiration signal ~below! at the\ntime moments when the R peak occurs, that is, stroboscopic sec-\ntions of respiration. In each row the same measurement is illus-\ntrated.05190tpl \/tobs3100% versus frequency ratio f resp \/ f 0 for all sub-\njects. Figure 10~a! summarizes the data of Fig. 9. The verti-\ncal axis indicates the relative durations of plateaus for the\nmost frequently encountered orders of synchronization n:m ,\naveraged over all subjects and all measurements in which\nthis synchronization occurs. The numbers over the datapoints\ngive the number of subjects who demonstrated this particular\nsynchronization regime.\nFinally, we estimate the robustness of synchronization.\nWe compute the tongue width as the difference of frequency\nratios D( f resp \/ f 0) at its boundaries, for each of the com-\nmoner synchronization orders. If the tongue consists of only\none point, we define its width as the step in respiration fre-\nquency, 1 min21, divided by the average heart rate prior to\npaced respiration f 0. Note, that this is not the tongue width at\nthe same level of respiration amplitude. This estimate reflects\nthe width of synchronization region along the cut of the pa-\nrameter plane at the current value of frequency, which, in\nturn, defines the optimal amplitude. Figure 10~b! gives the\nvalues of tongue width for the commoner synchronization\norders, averaged over all subjects.\nVI. DISCUSSION\nOur observation that heart rate variability, as expressed\nthrough the variance of R-R intervals, decreases as the res-\npiration frequency increases ~Figs. 4,5! is in a good agree-\nment with earlier observations @1,17#. The fact that the larger\nthe frequency of paced respiration, the smaller on average its\namplitude becomes ~Fig. 6!, accords with common sense\n~because of the need to maintain a particular oxygenation\nlevel! and is consistent with earlier experiments @32#.\nThe experimental maps of regimes in Fig. 8 are to be\ncompared with the theoretical one in Fig. 1. The qualitative\nstructure of the theoretical Arnold tongues is reproduced in\nour experiments, notwithstanding the inevitable real-life cir-\ncumstances affecting the possibility of synchronization. This\nallows us to infer that the system governing the heart rate of\na healthy human can be treated as a generator in a physical\nsense, and that paced respiration acts as an external periodic\nforcing of this system. However, the widths of the synchro-\nnization tongues do not seem to be as predicted by the theory\nof a periodic oscillator forced periodically @Fig. 10~b!#. In\nparticular, the synchronization regions found do not exhibit\nan obvious decrease of the tongue width with the increase of\ndenominator m of synchronization order n:m . It is not obvi-\nous what rule, if any, governs the width of the tongue. Such\na rule may perhaps be hidden because the actual strength\nwith which heart rate generator is forced is not simply pro-\nportional to the amplitude of breathing, as measured by our\ntechnique, but may be due to some specific features of the\nnonlinearity of the system. Consistent with the classical\ntheory, however, we failed to find any synchronization re-\ngions with m.10, in full agreement with predictions about\nthe improbability of falling within them under the given ex-\nperimental conditions.\nComparison between experiments conducted with the\nsame subjects on different days have shown that, even where\nthe detuning and amplitude are quite close, the structure of9-6\nREGIONS OF CARDIORESPIRATORY . . . PHYSICAL REVIEW E 66, 051909 ~2002!FIG. 8. Regions of cardiorespiratory synchronization for all subjects and all sessions. The first column gives results from the first session\nwith subjects 1, 2, and 3; the second column gives results from the second session with subjects 2 and 3; and the third column gives the\nresults for subjects 4, 5, and 6. Dashed lines mark the amplitude of respiration versus the frequency ratio and, for first ~or only! sessions, are\nprecisely the same as in Fig. 6~b!. Shaded tongues show the inferred synchronization regions, their tips pointing to the corresponding n:m\nrotation number. These results are to be compared with the predictions of the classical theory as sketched in Fig. 1. Details are given in the\ntext.the synchronization regions is not precisely reproduced: Sub-\nject 3 reproduced four out of eight synchronization regions\nduring his second session; whereas subject 2 reproduced\nonly one of seven synchronization regions. The second sets\nof measurements also demonstrated synchronization orders\nthat were absent during the first sessions.\nNevertheless, regimes of synchronization with certain\nn:m are realized in particular subjects more frequently than\nin others. Namely, 2:5 synchronization was induced in all 6\nsubjects, 1:2 and 1:3 in 4, 1:7 and 3:5 in 3. Other types of\nsynchronization appear occasionally. Cardiorespiratory syn-\nchronization can be induced with greatest probability in the\nrange of paced respiration frequency 0.15–0.5 Hz.\nAs to the effectiveness of synchronization of different or-\nders, one can note from Fig. 10~a! that the most effective\nsynchronization was 1:3 in those subjects where it was in-\nduced. This means that the average duration of the corre-\nsponding plateaus was the longest of all synchronization or-\nders. It is known that the typical range of breathing\nfrequencies in the relaxed state lies between 1\/6 and 1\/3 of\nthe average heart rate @16#. Note, that the breathing fre-\nquency inducing 1:3 synchronization is on the borderline of05190those which are most common in the relaxed state. Although\nbeing the most effective, 1:3 synchronization was encoun-\ntered in only 2\/3 of all subjects. The next most effective\nregime was 1:2 synchronization, which requires an even less\nnatural breathing frequency. The next regime was 2:5 which\nwas found in all subjects studied. Although being the most\nprevalent, the 2:5 synchronization appeared to be less effec-\ntive than the 1:3 and 1:2 ones. Note that the denominator of\nthis synchronization order is larger than 4 which means that\nthis resonance is weak. The corresponding tongue is ex-\npected to be narrower than those for 1:2 and 1:3, which is\nindeed observed in our experiments. The remaining two\ncommon orders of synchronization were 1:7 and 3:5, both\nclassified as weak resonances. Synchronization of orders 1:6,\n1:5 and 1:4 appeared much more rarely, namely, 1:4 and 1:6\nin 1\/3 and 1:5 in 1\/6 of all subjects.\nVII. CONCLUSIONS\nWe note that to draw global conclusions, a larger study\nwill be required, and that it will be interesting to study how\nthe synchronization phenomena depend on, for example, the9-7\nRZECZINSKI et al. PHYSICAL REVIEW E 66, 051909 ~2002!FIG. 9. Relative durations of the plateaus of phase difference Dw(t) for the given frequency ratio f resp \/ f 0 ~see text!. The order of\nsynchronization n:m is marked above or near the corresponding region.ages of the subjects. Nevertheless, several features of the\nresults already seem clear. In particular,\n~1! All six of the subjects studied demonstrated an ability\nto synchronize their cardiorhythm through paced respiration.\n~2! Each subject studied revealed between three and nine\ndistinct synchronization regions.\n~3! For about half of the detected n:m synchronization\nregimes the existence of an individual synchronization re-\ngion was indicated by two or more data points.\n~4! No obvious rule governing the width of the tongue\ncould be inferred. Contrary to theoretical predictions, at least\nFIG. 10. ~a! Effectiveness of the more common orders of syn-\nchronization n:m , estimated as the average duration of the plateaus\nof phase difference Dw(t). Averaging is made over all subjects and\nall datapoints within each synchronization region for the corre-\nsponding n:m . ~b! Average width of the synchronization region for\nthe same n:m as in ~a!. Averaging is taken over all subjects. The\nnumber of subjects involved in each average is given above the\ncorresponding bar. Details are given in the text.05190for weak resonances, the widths of the synchronization\ntongues detected are not inversely proportional to the de-\nnominator m of synchronization order n:m .\n~5! For a suitable choice of breathing frequency, 2:5 car-\ndiorespiratory synchronization seems likely to be achieved in\nall healthy subjects. The 1:3 synchronization, which was\nachieved in 2\/3 of all cases, tends to have the epochs of\nlongest duration.\nWe believe that besides their practical importance, the re-\nsults obtained may be also valuable for modeling purposes.\nIn particular, if one creates a model of the cardiorespiratory\ninteraction, its properties can be compared with the experi-\nmental observations of the structure of the synchronization\ntongues. For example, it will be interesting to compare our\nresults with a recent model @36# in order to test its applica-\nbility to the human CVS.\nACKNOWLEDGMENTS\nWe are grateful to Aneta Stefanovska and Janko Petrovic\nfor help in designing, building, and installing the experimen-\ntal setup, to Igor Kaufman and Andriy Bandrivskiy for writ-\ning the program for data acquisition, and to all the volunteers\nwho participated in the measurements. The work was sup-\nported by the Engineering and Physical Sciences Research\nCouncil ~UK!, the Leverhulme Trust ~UK!, and INTAS ~un-\nder Grant No. 01-2061!.9-8\nREGIONS OF CARDIORESPIRATORY . . . PHYSICAL REVIEW E 66, 051909 ~2002!@1# A. Angelone and N. A. Coulter, J. Appl. Physiol. 19, 479\n~1964!.\n@2# J. Brener and D. Hothersall, Psychophysiology 4, 1 ~1967!.\n@3# M. W. Headrick and F. K. Graham, J. Exp. Psychol. 79, 486\n~1969!.\n@4# H. Bettermann, P. Engelke, P. Van Leeuwen, and C. Heck-\nmann, Biomed. Tech. 41, 319 ~1996!.\n@5# C. Hayashi, Nonlinear Oscillations in Physical Systems\n~McGraw-Hill, New York, 1964!.\n@6# I. I. Blekhman, Synchronization of Dynamical Systems ~Nauka,\nMoscow, 1971!, in Russian; Synchronization in Science and\nTechnology ~ASME Press, New York, 1988!.\n@7# A. Pikovsky, M. Rosenblum, and J. Kurths, Synchronization: A\nUniversal Concept in Nonlinear Science ~Cambridge Univer-\nsity Press, Cambridge, 2001!.\n@8# V. S. Anishchenko, V. V. Astakhov, A. B. Neiman, T. E. Vadi-\nvasova, and L. Schimansky-Geier, Nonlinear Dynamics of\nChaotic and Stochastic Systems ~Springer, Berlin, 2002!.\n@9# E. Mosekilde, Yu. Maistrenko, and D. Postnov, Chaotic Syn-\nchronization, Applications to Living Systems, Series A, Vol. 42\n~World Scientific, Singapore, 2002!.\n@10# V. A. Kuz’menko, A. M. Badanova, and I. M. Syrkina, Hum.\nPhysiol. 6, 936 ~1980!.\n@11# C. Scha¨fer, M. G. Rosenblum, J. Kurths, and H.-H. Abel, Na-\nture ~London! 392, 239 ~1998!.\n@12# M. Bracˇicˇ-Lotricˇ and A. Stefanovska, Physica A 283, 451\n~2000!.\n@13# E. Toledo, S. Akselrod, I. Pinhas, and D. Aravot, Med. Eng.\nPhys. 24, 45 ~2002!.\n@14# V. M. Pokrovski, V. G. Abushkevich, A. I. Deshkovski, V. V.\nSkibitski, and I. A. Diak, Kardiologiia, 31, 74 ~1991!.\n@15# A. Stefanovska, H. Haken, P. V. E. McClintock, M. Hozˇicˇ, F.\nBajrovicˇ, and S. Ribaricˇ, Phys. Rev. Lett. 85, 4831 ~2000!.\n@16# S. Akselrod, D. Gordon, J. B. Madwed, N. C. Snidman, D. C.\nShannon, and R. J. Cohen, Am. J. Physiol. 249, H867 ~1985!.\n@17# M. V. Pitzalis, F. Mastropasqua, F. Massari, A. Passantino, R.\nColombo, A. Mannarini, C. Forleo, and P. Rizzon, Cardiovasc.\nRes. 38, 332 ~1998!.\n@18# M. Clark and R. Hirschman, Biofeedback Self Regul. 15, 273\n~1990!.\n@19# M. Clark and R. Hirschman, J. Dent. Res. 59, 1533 ~1980!.\n@20# R. R. Freedman and S. Woodward, Am. J. Obstet. Gynecol.\n167, 436 ~1992!.\n@21# P. Z. Zhang, W. N. Tapp, S. S. Reisman, and B. H. Natelson,05190I&EC Process Des. Dev. 44, 321 ~1997!.\n@22# M. Schiek, F. R. Drepper, R. Engbert, H.-H. Abel, and K.\nSuder, Transition Between Two Different Cardiorespiratory\nSynchronization Regimes During Paced Respiration ~Jahr-\neskongress der DPG, Rostock, 1997!, Vol. 76.\n@23# A. V. Pomortsev, A. A. Zubakhin, V. G. Abdushkevitch, and L.\nF. Sedunova, in Proceedings of XVII Congress of Physiologists\nof Russia, 1998, edited by G. A. Kuraev ~Rostov State Univer-\nsity, Rostov, 1998!, p. 316.\n@24# M. Schiek, F. Drepper, H. Halling, K. Markus, M. Zarse, D.\nNguyen, C. Stellbrink, P. Hanrath, T. Peschgens, and H.\nHo¨rnchen ~unpublished!.\n@25# V. I Arnold, Geometrical Methods in the Theory of Ordinary\nDifferential Equations ~Springer, New York, 1983!.\n@26# The statement that the larger m is, the narrower the tongue is\n@25#, has been rigorously proved for m.4, that is, for weak\nresonances. There are no proven regularities as to the tongue\nwidth for strong resonances, that is, with m<4. However, ex-\nperiment and numerical simulations demonstrate that, as a rule,\nthe same law also applies for strong resonances as well.\n@27# V. S. Anishchenko, Dynamical Chaos–Models and Experi-\nments, Appearance Routes and Structure of Chaos in Simple\nDynamical Systems Series A, Vol. 8 ~World Scientific, Sin-\ngapore, 1995!.\n@28# L. Schimansky-Geier, V. S. Anishchenko, and A. Neiman, in\nHandbook of Biological Physics, edited by F. Moss and S.\nGielen ~Elsevier Science B.V., Amsterdam, 2001!, Vol. 4.\n@29# R. L. Stratonovich, Topics in the Theory of Random Noise\n~Gordon and Breach, New York, 1967!, Vol. 2.\n@30# T. E. Vadivasova, A. G. Balanov, O. V. Sosnovtseva, D. E.\nPostnov, and E. Mosekilde, Phys. Lett. A 253, 66 ~1999!.\n@31# A. N. Malakhov, Fluctuations in Self-Oscillatory Systems\n~Nauka, Moscow, 1968!.\n@32# J. P. Saul, B. D. Berger, M. H. Chen, and R. J. Cohen, Am. J.\nPhysiol. 256, H142 ~1989!.\n@33# V. S. Anishchenko, A. G. Balanov, N. B. Janson, N. B. Igo-\nsheva, and G. V. Bordjugov, Int. J. Bifurcation Chaos Appl.\nSci. Eng. 10, 2339 ~2000!.\n@34# A. S. Pikovsky, M. G. Rosenblum, G. V. Osipov, and J. Kurths,\nPhysica D 104, 219 ~1997!.\n@35# F. Takens in Dynamical Systems and Turbulence, edited by D.\nA. Rang and L. S. Young, Lecture Notes in Mathematics Vol.\n898 ~Springer, Berlin, 1981!, p. 366.\n@36# K. Kotani, K. Takamasu, Y. Ashkenazy, H. E. Stanley, and Y.\nYamamoto, Phys. Rev. E 65, 051923 ~2002!.9-9\n"}