{"doi":"10.1109\/ISCE.2008.4559433","coreId":"102573","oai":"oai:epubs.surrey.ac.uk:2058","identifiers":["oai:epubs.surrey.ac.uk:2058","10.1109\/ISCE.2008.4559433"],"title":"An enhanced reconstruction algorithm for unidirectional distributed video coding","authors":["Weerakkody, WARJ","Fernando, WAC","Kondoz, AM"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-01-01","abstract":"Distributed Video Coding (DVC) is an emerging video coding technology that utilizes the distributed source coding principles to build very low cost video encoders, yet with remarkable error resilience. In the common DVC framework, the reconstruction function plays a vital role that has a direct impact on the output video quality. In this paper, a novel algorithm is proposed for the reconstruction function, particularly focusing on the unidirectional DVC architecture. The proposed technique exploits the variations of the bit error rate of the Wyner-Ziv decoded bit stream and the side information stream. The simulation results show that the proposed algorithm yields a significant improvement of the objective and subjective video quality at no additional bit rate cost","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2058<\/identifier><datestamp>\n      2017-01-04T11:10:33Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:63637372<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2058\/<\/dc:relation><dc:title>\n        An enhanced reconstruction algorithm for unidirectional distributed video coding<\/dc:title><dc:creator>\n        Weerakkody, WARJ<\/dc:creator><dc:creator>\n        Fernando, WAC<\/dc:creator><dc:creator>\n        Kondoz, AM<\/dc:creator><dc:description>\n        Distributed Video Coding (DVC) is an emerging video coding technology that utilizes the distributed source coding principles to build very low cost video encoders, yet with remarkable error resilience. In the common DVC framework, the reconstruction function plays a vital role that has a direct impact on the output video quality. In this paper, a novel algorithm is proposed for the reconstruction function, particularly focusing on the unidirectional DVC architecture. The proposed technique exploits the variations of the bit error rate of the Wyner-Ziv decoded bit stream and the side information stream. The simulation results show that the proposed algorithm yields a significant improvement of the objective and subjective video quality at no additional bit rate cost.<\/dc:description><dc:publisher>\n        IEEE<\/dc:publisher><dc:date>\n        2008-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2058\/1\/SRF002175.pdf<\/dc:identifier><dc:identifier>\n          Weerakkody, WARJ, Fernando, WAC and Kondoz, AM  (2008) An enhanced reconstruction algorithm for unidirectional distributed video coding   2008 IEEE INTERNATIONAL SYMPOSIUM ON CONSUMER ELECTRONICS, VOLS 1 AND 2.  pp. 47-50.      <\/dc:identifier><dc:relation>\n        http:\/\/ieeexplore.ieee.org\/xpls\/abs_all.jsp?arnumber=4559433<\/dc:relation><dc:relation>\n        10.1109\/ISCE.2008.4559433<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2058\/","http:\/\/ieeexplore.ieee.org\/xpls\/abs_all.jsp?arnumber=4559433","10.1109\/ISCE.2008.4559433"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"AN ENHANCED RECONSTRUCTION ALGORITHM FOR UNIDIRECTIONAL \nDISTRIBUTED VIDEO CODING \n \nW.A.R.J.Weerakkody, W.A.C.Fernando, A.M.Kondoz \n \nUniversity of Surrey, Guildford, Surrey GU2 7XH, UK \nEmail: R.Weerakkody@surrey.ac.uk \n \nABSTRACT \n \nDistributed Video Coding (DVC) is an emerging video \ncoding technology that utilizes the distributed source coding \nprinciples to build very low cost video encoders, yet with \nremarkable error resilience. In the common DVC \nframework, the reconstruction function plays a vital role that \nhas a direct impact on the output video quality. In this paper, \na novel algorithm is proposed for the reconstruction \nfunction, particularly focusing on the unidirectional DVC \narchitecture. The proposed technique exploits the variations \nof the bit error rate of the Wyner-Ziv decoded bit stream and \nthe side information stream. The simulation results show that \nthe proposed algorithm yields a significant improvement of \nthe objective and subjective video quality at no additional \nbit rate cost. \n \nIndex Terms— Distributed Video Coding, Wyner-Ziv \ncoding \n \n1. INTRODUCTION \n \nWith the increasing potential for video sensor networks \nand communications systems for a variety of diverse \napplications, there is a huge demand for more efficient and \ncost effective video coding solutions. Distributed Video \nCoding (DVC) has been widely acclaimed as a potential \nenabling technology for future video surveillance \napplications due to its flexibility for building low cost \nencoders and the significantly high built-in error resilience. \nIn the existing common DVC framework, reconstruction \nmodule plays a significant role as much as the quantization \nplays in contributing to the compression efficiency. When \nthe pixel domain DVC architecture is concerned, while \nquantization effectively means limiting the number of bit \nplanes transmitted per pixel, reconstruction is the inverse \nprocess that increase the precision of the decoded quantized \npixels without an additional bit rate burden. This process \nutilizes the side information estimated at the DVC decoder \nfor the Wyner-Ziv frames. The simple reconstruction model \nproposed by Aaron et al. [1] has been widely used in the \nDVC architectures. However, this approach lacked the \nconsideration of the statistical properties of the input, \ndecoded, and side information bit streams. Further \nenhancements to the reconstruction algorithm were proposed \nin [2] and [3] which concentrated on the calculation of the \nexpected value for the reconstructed pixel (or the DCT \ncoefficient in transform domain coding) based on the \nLaplacian distribution properties of the residual error in side \ninformation with respect to the original video signal. \nHowever, it is observed that these techniques are \noptimized for a DVC framework with a reverse channel, that \nformulates a closed loop feedback mechanism for \ndetermining the optimum parity bit rate, thus yielding a \ncontrolled very low bit error rate (BER) in the Wyner-Ziv \ndecoded bit stream. However, having considered the \npractical constraints in involving a reverse feedback channel \nin video communication systems, increasing attention is \nfocused on unidirectional DVC architectures; with no \nreverse channel. This development inevitably results in a \nhigher, possibly uncontrolled, BER in the decoded bit \nstream. In this case, the reconstruction process could be \nbetter modeled as a statistical process involving the finite \nBER of the decoded bit stream as well as the side \ninformation stream. The objective of this paper is to propose \na novel reconstruction algorithm for this scenario. A pixel \ndomain DVC framework is utilized for the simulations, yet \nthe concept is expandable for reconstructing the transform \ncoefficients in transform domain coding. \n \n2. BACKGROUND AND RELATED WORK \n \nDVC technology is designed upon the distributed source \ncoding principles established by Slepian and Wolf in 1973 \nin the so called Slepian-Wolf theorem [4], which explains \nthe rate conditions for the independent encoding and joint \ndecoding of statistically dependant discrete random \nsequences for lossless coding. Wyner-Ziv [5] extended this \nscenario for lossy coding in 1976 considering side \ninformation at the decoder, as followed in the current DVC \narchitectures. Based on the above, a number of distinct DVC \nframeworks have been proposed in literature. The pixel \ndomain design using turbo coding proposed by Aaron et al. \ncommonly referred as the Stanford architecture [1] has been \nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 09:31:16 UTC from IEEE Xplore.  Restrictions apply. \nfollowed and further enhanced, primarily in the side \ninformation estimation process in a number of research \npublications. Transform domain coding has also been \nproposed for enhanced compression efficiency even though \nwith a little compromise of encoder complexity [6].  Other \npossible DVC implementations have also been proposed, \nincluding the PRISM architecture [7].  \nIn the Stanford proposal for DVC, a basic algorithm was \nproposed for the reconstruction of pixels at the decoder \nutilizing the decoded bit planes of the pixels and the locally \nestimated side information. In this algorithm, the \nreconstructed pixel xˆ  is calculated considering the \ncorresponding side information value y  and the \ncorresponding quantization bin boundaries as: \n++\n+−\n−−\n>\n<<\n<\n\n\n\n\n\n=\nzyz\nzyzy\nzyz\nx\n,\n,\n,\nˆ\n \nwhere −z and +z represent the lower and upper edges of \nthe quantization bin. This algorithm is widely utilized for its \nsimplicity and reasonable performance.  \nMore enhanced approaches for this purpose were \npresented in [2] and [3] known as the minimum mean square \nerror (MMSE) techniques. In [2], Vatis et al. made use of \nthe average statistical distribution of the transform \ncoefficients. In other notable proposal, Kubasov et al. \ndeveloped an algorithm to compute the reconstructed value \nxˆ as the expectation ]),,[|[ yzzxxE +−∈  of the random \nvariable x . It is noted that both these approaches were \noptimized for systems with very small BER of the decoded \nbit stream achieved by involving the reverse channel for \noptimum parity bit requests. \n \n3. PROPOSED SOLUTION \n \nThe proposed modification to the reconstruction \nalgorithm is built upon the hypothesis that, when the BER of \nthe decoded output increases, the relative significance of the \nside information increases in the reconstruction process. \nThus the proposed algorithm is designed with particular \nfocus on unidirectional architectures, unlike the previous \nproposals. This effect could be quantified considering the \nnoise distributions of side information and the decoded \noutput. Let’s consider the case where the decoded quantized \npixel falls outside the quantized side information bin. In this \ncase, based on the above hypothesis, it is considered that the \nreconstructed pixel value can be modeled as a function of \nthe side information value and the corresponding \nquantization bin boundaries as: \n\n\n\n>−+\n<−+\n=\n+++\n−−−\nzyzykz\nzyzykz\nx\n,)(\n,)(\nˆ\n \nwhere k is an index reflecting the noise distribution of \nthe decoded bit stream and the side information. A gross \nillustration of the proposed reconstruction model is shown in \nFigure 1. Based on this model, the derivation of the \noptimized gradient for the reconstruction line (call this recon \nangle) formulates an important research problem. This \nproblem could be addressed by considering the statistical \nproperties of the decoded and side information bit streams. It \nis further noted that these statistical properties varies \nsignificantly within each frame based on the regional motion \nactivity. To exploit this, the recon angle is optimized for \nblocks of pixels. A training sequence is performed for \nexperimentally determining the optimum recon angle for \ndifferent BER levels of the decoded bit stream. Figure 2 \nshows the scatter plot of recon angles that yielded optimum \nPSNR for each block with the corresponding BER. Once \nthis learning process is over, the resultant regression line is \nused to determine the recon angle for each block in a frame \ndepending on the achieved BER for the block. \nR\ne\nc\no\nn\ns\ntr\nu\nc\nti\no\nn\n X\n’ i\n \nFigure 1: Proposed reconstruction model for 4 quantization \nlevels \n0\n20\n40\n0 0.02 0.04 0.06 0.08 0.1 0.12 0.14 0.16\nBit Error Rate\nBe\nst\n \nR\ne\nco\nn\n \nAn\ngl\ne\n \n(D\ne\ng)\n \nFigure 2: Scatter plot for the optimum recon angle for each \nblock and the corresponding BER.  \n(Foreman sequence: 20 frames) \nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 09:31:16 UTC from IEEE Xplore.  Restrictions apply. \n Figure 3: System block diagram \n \n \nThe proposed algorithm is tested on the pixel domain \nunidirectional DVC framework illustrated in Figure 3. Note \nthat each frame is divided into blocks before encoding to \nexploit the regional variations of the statistical properties of \nthe noise in the decoded bit stream.  \n \n4. SIMULATION RESULTS \n \nThe proposed reconstruction algorithm incorporated in \nto the pixel domain unidirectional DVC codec is tested for \nForeman and Hall Monitor test video sequences, both QCIF \nat 15 Hz frame rate. Key frames are H.264-I coded \n(QP=26). The Wyner-Ziv bit rate is fixed at 1 bit per pixel \n(bpp). The optimum recon angle for each pixel is calculated \nbased on the regression line described above in section 3 for \neach block. The block size is set to 352 bits. The \nperformance is compared with the same DVC system \nincorporating the basic reconstruction model proposed in \n[1]. Figures 4 and 5 depict the comparative results for \nForeman and Hall Monitor sequences respectively. Figure 6 \ngraphically illustrates the perceptual quality improvement \nusing a selected frame from the Foreman sequence. \nThe simulation results show a very promising and \nconsistent improvement in PSNR of up to 4 dB for the \nForeman and up to 2dB for the Hall Monitor sequences. It is \nnoted that, in the unidirectional architecture, the decoded bit \nstream has residual errors that yield a notable degradation of \nvideo quality as seen in Figure 6. The proposed algorithm \nhelps to solve these irritating effects by biasing the pixels \nwith higher error probability towards the side information. \nThis solution improves both objective (Figures 4 and 5) and \nsubjective (Figure 6) video quality. \n \n5. CONCLUSION \n \nIt is noted that when the Unidirectional DVC \nimplementations are concerned, the decoded output tend to \ncontain a notable BER that results in significant distortion \non the reconstructed frame. In this paper, a novel \nreconstruction model was presented by considering the \nstatistical noise distribution of the decoded output of the \nDVC decoder. The performance of the proposed algorithm \nwas verified for test video sequences and a notable gain in \nobjective and subjective video quality is demonstrated. \n \n20\n24\n28\n32\n36\n40\n1 11 21 31 41 51 61 71\nWyner-Ziv Frame no.\nPS\nN\nR\n \n(dB\n)\nProposed\nBasic Reconstruction [1]\n \n \nFigure 4: Performance comparison of the proposed \nalgorithm (Foreman sequence) \n \n30\n34\n38\n42\n1 11 21 31 41 51 61 71\nWyner-Ziv Frame no.\nPS\nN\nR\n \n(dB\n)\nProposed\nBasic Reconstruction [1]\n \n \nFigure 5: Performance comparison of the proposed \nalgorithm (Hall Monitor sequence) \nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 09:31:16 UTC from IEEE Xplore.  Restrictions apply. \n  \n        (a)    (b) \nFigure 6: Performance comparison of the proposed \nalgorithm (Foreman sequence: frame no.3) \n(a) without proposed model \n(b) with proposed model \n \n \n \n \nACKNOWLEDGEMENTS \n \nThe work presented was developed as a part of VISNET \nII, a European Network of Excellence (http:\/\/www.visnet-\nnoe.org), funded under the European Commission IST FP6 \nprogramme. \n \nREFERENCES \n \n[1] A. Aaron, R. Zhang, B. Girod, \"Wyner-Ziv coding of motion \nvideo,\" Proceedings of Asilomar Conference on Signals and \nSystems, Pacific Grove, CA, Nov. 2002. \n[2] Y. Vatis, S. Klomp, J. Ostermann, \"Enhanced reconstruction of \nthe quantized transform coefficients for Wyner-Ziv coding\", \nProceedings of Int. Conf. on Multimedia & Expo (ICME), \nBeijing, China, July 2007. \n[3] Denis Kubasov, Jayanth Nayak, Christine Guillemot, “Optimal \nReconstruction in Wyner-Ziv Video Coding with Multiple \nSide Information,” Proceedings of Int. workshop on MMSP, \nGreece, October 2007. \n[4] D. Slepian, J.K. Wolf, “Noiseless coding of correlated \ninformation sources,” IEEE Trans. on Inform. Theory, vol. IT-\n19, pp. 471–480, July 1973.  \n[5] D.Wyner, J. Ziv, “The rate-distortion function for source \ncoding with side information at the decoder,” IEEE Trans. on \nInform. Theory, vol. IT-22, pp. 1–10, Jan. 1976. \n[6] C. Brites, J. Ascenso, F. Pereira, “Improving Transform \nDomain Wyner-Ziv Video Coding Performance,” Proceedings \nof IEEE ICASSP, Vol 2, pp.II-525 - II-528,  May 2006. \n[7] R. Puri and K. Ramachandran, “PRISM: A new robust video \ncoding architecture based on distributed compression \nprinciples,” Proceedings of Allerton Conference on \nCommnications, Oct 2002. \n \nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 09:31:16 UTC from IEEE Xplore.  Restrictions apply. \n"}