{"doi":"10.1186\/1471-2229-4-19","coreId":"71916","oai":"oai:eprints.lancs.ac.uk:91","identifiers":["oai:eprints.lancs.ac.uk:91","10.1186\/1471-2229-4-19"],"title":"Use of a highly sensitive two-dimensional luminescence imaging system to monitor endogenous bioluminescence in plant leaves.","authors":["Flor-Henry, Michel","McCabe, Tulene C","De Bruxelles, Guy L.","Roberts, Michael R"],"enrichments":{"references":[{"id":16450215,"title":"Biophotons: Ultraweak light emission from living systems. Curr Opin Solid State Mat Sci","authors":[],"date":"1997","doi":"10.1016\/s1359-0286(97)80064-2","raw":"Devaraj B, Usa M, Inaba H: Biophotons: Ultraweak light emission from living systems.  Curr Opin Solid State Mat Sci 1997, 2:188-193.","cites":null},{"id":16450236,"title":"DJ: Chemi-luminescence from mechanically injured soybean root tissue. Photobiochem Photobiophys","authors":[],"date":"1985","doi":null,"raw":"Salin ML, Quince KL, Hunter DJ: Chemi-luminescence from mechanically injured soybean root tissue.  Photobiochem Photobiophys 1985, 9:271-279.","cites":null},{"id":16450232,"title":"Early detection of salt stress damage by biophotons in red bean seedling.","authors":[],"date":"2000","doi":"10.1143\/jjap.39.3696","raw":"Ohya T, Kurashige H, Okabe H, Kai S: Early detection of salt stress damage by biophotons in red bean seedling. Jpn J Appl Phys 2000, 39:3696-3700.","cites":null},{"id":16450240,"title":"Effect of chlorophyll reduction in Arabidopsis thaliana by methyl jasmonate or norflurazon on antioxidant systems. Plant Physiol Biochem","authors":[],"date":"2004","doi":"10.1016\/j.plaphy.2004.01.001","raw":"Jung S: Effect of chlorophyll reduction in Arabidopsis thaliana by methyl jasmonate or norflurazon on antioxidant systems. Plant Physiol Biochem 2004, 42:225-231.","cites":null},{"id":16450218,"title":"He YH: Imaging of ultraweak bio-chemiluminescence and singlet oxygen generation in germinating soybean in response to wounding. Luminescence","authors":[],"date":"2003","doi":"10.1002\/bio.703","raw":"Chen WL, Xing D, Tan SC, Tang YH, He YH: Imaging of ultraweak bio-chemiluminescence and singlet oxygen generation in germinating soybean in response to wounding. Luminescence 2003, 18:37-41.","cites":null},{"id":16450222,"title":"Inaba H: 2-dimensional imaging and counting of ultraweak emission patterns from injured plant seedlings.","authors":[],"date":"1991","doi":"10.1016\/1011-1344(91)80153-9","raw":"Suzuki S, Usa M, Nagoshi T, Kobayashi M, Watanabe N, Watanabe H, Inaba H: 2-dimensional imaging and counting of ultraweak emission patterns from injured plant seedlings. J Photochem Photobiol B 1991, 9:211-217.","cites":null},{"id":16450230,"title":"Inaba H: In vivo imaging of spontaneous ultraweak photon emission from a rat's brain correlated with cerebral energy metabolism and oxidative stress. Neurosci Res","authors":[],"date":"1999","doi":"10.1016\/s0168-0102(99)00040-1","raw":"Kobayashi M, Takeda M, Sato T, Yamazaki Y, Kaneko K, Ito K, Kato H, Inaba H: In vivo imaging of spontaneous ultraweak photon emission from a rat's brain correlated with cerebral energy metabolism and oxidative stress. Neurosci Res 1999, 34:103-113.","cites":null},{"id":16450238,"title":"Oxidative stress, antioxidants and stress tolerance. Trends Plant Sci","authors":[],"date":"2002","doi":"10.1016\/s1360-1385(02)02312-9","raw":"Mittler R: Oxidative stress, antioxidants and stress tolerance. Trends Plant Sci 2002, 7:405-410.","cites":null},{"id":16450234,"title":"S: Biophoton emission induced by osmotic stress in adzuki bean roote.","authors":[],"date":"2003","doi":"10.1143\/jjap.42.7625","raw":"Ohya T, Oikawa N, Kawabata R, Okabe H, Kai S: Biophoton emission induced by osmotic stress in adzuki bean roote. Jpn J Appl Phys 2003, 42:7625-7628.","cites":null},{"id":16450242,"title":"Spontaneous and thermoinduced photon emission: new methods to detect and quantify oxidative stress in plants. Trends Plant Sci","authors":[],"date":"2003","doi":"10.1016\/s1360-1385(03)00185-7","raw":"Havaux M: Spontaneous and thermoinduced photon emission: new methods to detect and quantify oxidative stress in plants. Trends Plant Sci 2003, 8:409-413.","cites":null},{"id":16450226,"title":"Twodimensional imaging of ultraweak photon emission from germinating soybean seedlings with a highly sensitive CCD camera. Photochem Photobiol","authors":[],"date":"1997","doi":"10.1111\/j.1751-1097.1997.tb08600.x","raw":"Kobayashi M, Devaraj B, Usa M, Tanno Y, Takeda M, Inaba H: Twodimensional imaging of ultraweak photon emission from germinating soybean seedlings with a highly sensitive CCD camera. Photochem Photobiol 1997, 65:535-537.","cites":null},{"id":16450228,"title":"Ultraweak biophoton emission imaging of transplanted bladder cancer. Urol Res","authors":[],"date":"1995","doi":"10.1007\/bf00300020","raw":"Amano T, Kobayashi M, Devaraj B, Usa M, Inaba H: Ultraweak biophoton emission imaging of transplanted bladder cancer. Urol Res 1995, 23:315-318.","cites":null},{"id":16450220,"title":"Ultraweak light emission is a common response of bacterial cells to chemico-physical stress.","authors":[],"date":"1998","doi":"10.1002\/(sici)1099-1271(1998090)13:5<287::aid-bio489>3.3.co;2-1","raw":"Maccarrone M, Finazzi AA, Rosato N: Ultraweak light emission is a common response of bacterial cells to chemico-physical stress. J Biolumin Chemilumin 1998, 13:287-293.","cites":null},{"id":16450224,"title":"Ultraweak luminescence generated by sweet potato and Fusarium oxysporum interactions associated with a defense response. Photochem Photobiol","authors":[],"date":"1996","doi":"10.1111\/j.1751-1097.1996.tb01860.x","raw":"Makino T, Kato K, Iyozumi H, Honzawa H, Tachiiri Y, Hiramatsu M: Ultraweak luminescence generated by sweet potato and Fusarium oxysporum interactions associated with a defense response. Photochem Photobiol 1996, 64:953-956.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-11-18","abstract":"Background All living organisms emit spontaneous low-level bioluminescence, which can be increased in response to stress. Methods for imaging this ultra-weak luminescence have previously been limited by the sensitivity of the detection systems used. Results We developed a novel configuration of a cooled charge-coupled device (CCD) for 2-dimensional imaging of light emission from biological material. In this study, we imaged photon emission from plant leaves. The equipment allowed short integration times for image acquisition, providing high resolution spatial and temporal information on bioluminescence. We were able to carry out time course imaging of both delayed chlorophyll fluorescence from whole leaves, and of low level wound-induced luminescence that we showed to be localised to sites of tissue damage. We found that wound-induced luminescence was chlorophyll-dependent and was enhanced at higher temperatures. Conclusions The data gathered on plant bioluminescence illustrate that the equipment described here represents an improvement in 2-dimensional luminescence imaging technology. Using this system, we identify chlorophyll as the origin of wound-induced luminescence from leaves","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71916.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/91\/1\/BMC_Plant_Biol_Lumi.pdf","pdfHashValue":"c9fd5f61c48fa2b6be443978311a20aa466de18f","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:91<\/identifier><datestamp>\n      2018-01-24T03:20:03Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5148:5148333031<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Use of a highly sensitive two-dimensional luminescence imaging system to monitor endogenous bioluminescence in plant leaves.<\/dc:title><dc:creator>\n        Flor-Henry, Michel<\/dc:creator><dc:creator>\n        McCabe, Tulene C<\/dc:creator><dc:creator>\n        De Bruxelles, Guy L.<\/dc:creator><dc:creator>\n        Roberts, Michael R<\/dc:creator><dc:subject>\n        QH301 Biology<\/dc:subject><dc:description>\n        Background All living organisms emit spontaneous low-level bioluminescence, which can be increased in response to stress. Methods for imaging this ultra-weak luminescence have previously been limited by the sensitivity of the detection systems used. Results We developed a novel configuration of a cooled charge-coupled device (CCD) for 2-dimensional imaging of light emission from biological material. In this study, we imaged photon emission from plant leaves. The equipment allowed short integration times for image acquisition, providing high resolution spatial and temporal information on bioluminescence. We were able to carry out time course imaging of both delayed chlorophyll fluorescence from whole leaves, and of low level wound-induced luminescence that we showed to be localised to sites of tissue damage. We found that wound-induced luminescence was chlorophyll-dependent and was enhanced at higher temperatures. Conclusions The data gathered on plant bioluminescence illustrate that the equipment described here represents an improvement in 2-dimensional luminescence imaging technology. Using this system, we identify chlorophyll as the origin of wound-induced luminescence from leaves.<\/dc:description><dc:date>\n        2004-11-18<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/91\/1\/BMC_Plant_Biol_Lumi.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1186\/1471-2229-4-19<\/dc:relation><dc:identifier>\n        Flor-Henry, Michel and McCabe, Tulene C and De Bruxelles, Guy L. and Roberts, Michael R (2004) Use of a highly sensitive two-dimensional luminescence imaging system to monitor endogenous bioluminescence in plant leaves. BMC Plant Biology, 4 (9).<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/91\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1186\/1471-2229-4-19","http:\/\/eprints.lancs.ac.uk\/91\/"],"year":2004,"topics":["QH301 Biology"],"subject":["Journal Article","PeerReviewed"],"fullText":"BioMed CentralBMC Plant Biology\nssOpen AcceMethodology article\nUse of a highly sensitive two-dimensional luminescence imaging \nsystem to monitor endogenous bioluminescence in plant leaves\nMichel Flor-Henry†1, Tulene C McCabe2, Guy L de Bruxelles2 and \nMichael R Roberts*†2\nAddress: 1Biolumonics Ltd., Staveley Mill Yard, Staveley, nr. Kendal, Cumbria, LA8 9LS, UK and 2Department of Biological Sciences, Lancaster \nEnvironment Centre, Lancaster University, Bailrigg, Lancaster, LA1 4YQ, UK\nEmail: Michel Flor-Henry - michel@biolumonics.com; Tulene C McCabe - t.mccabe@lancaster.ac.uk; Guy L de Bruxelles - gldb1@hotmail.com; \nMichael R Roberts* - m.r.roberts@lancaster.ac.uk\n* Corresponding author    †Equal contributors\nAbstract\nBackground: All living organisms emit spontaneous low-level bioluminescence, which can be\nincreased in response to stress. Methods for imaging this ultra-weak luminescence have previously\nbeen limited by the sensitivity of the detection systems used.\nResults: We developed a novel configuration of a cooled charge-coupled device (CCD) for 2-\ndimensional imaging of light emission from biological material. In this study, we imaged photon\nemission from plant leaves. The equipment allowed short integration times for image acquisition,\nproviding high resolution spatial and temporal information on bioluminescence. We were able to\ncarry out time course imaging of both delayed chlorophyll fluorescence from whole leaves, and of\nlow level wound-induced luminescence that we showed to be localised to sites of tissue damage.\nWe found that wound-induced luminescence was chlorophyll-dependent and was enhanced at\nhigher temperatures.\nConclusions: The data gathered on plant bioluminescence illustrate that the equipment described\nhere represents an improvement in 2-dimensional luminescence imaging technology. Using this\nsystem, we identify chlorophyll as the origin of wound-induced luminescence from leaves.\nBackground\nIt is well documented that essentially all living systems\nspontaneously generate and emit very low levels of light\n(reviewed in [1]). This ultra-weak bioluminescence is gen-\nerally characterized by emission of photons (sometimes\ntermed \"biophotons\") at an intensity less than 10-14\nW.cm-2 (< 1000 photons.sec-1.cm-2). This is in contrast to\nthe more widely known bioluminescence from animals\nthat visibly glow, such as certain species of jellyfish, fire-\nflies and beetles, which employ fluorescent proteins and\/\nor luciferase enzymes to catalyse reactions that result in\nchemiluminescence. Ultra-weak bioluminescence is gen-\nerally considered to result from oxidative chemistry occur-\nring within cells [1,2], though in most cases, the source of\nobserved emissions has not been identified. Nevertheless,\nchanges in emission levels in response to stress – particu-\nlarly oxidative stress – have been observed in many sys-\ntems, including bacteria [3], plants (e.g. [2,4-6]) and\nanimals [7,8]. For this reason, measurement of ultra-weak\nbioluminescence may be a useful non-invasive technique\nPublished: 18 November 2004\nBMC Plant Biology 2004, 4:19 doi:10.1186\/1471-2229-4-19\nReceived: 07 July 2004\nAccepted: 18 November 2004\nThis article is available from: http:\/\/www.biomedcentral.com\/1471-2229\/4\/19\n© 2004 Flor-Henry et al; licensee BioMed Central Ltd. \nThis is an Open Access article distributed under the terms of the Creative Commons Attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), \nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.Page 1 of 8\n(page number not for citation purposes)\nBMC Plant Biology 2004, 4:19 http:\/\/www.biomedcentral.com\/1471-2229\/4\/19to monitor rapid perturbations to cellular activity and for\nearly detection of diseased and damaged cells.\nIn plants, increases in spontaneous low-level lumines-\ncence have been observed in response to pathogen infec-\ntion [5], salt stress [9], osmotic stress [10] and mechanical\ndamage or wounding [2,4,6,11]. It is suggested that lumi-\nnescence is produced by singlet oxygen and excited carbo-\nnyl species generated as a result of lipid peroxidation\nreactions [2,11]. Lipid peroxidation in wounded and\npathogen-infected plant tissues is a common consequence\nof the generation of ROS, which also act as signals to\ninduce plant defence responses [12].\nQuantitative measurements of such ultra-weak photon\nemissions are normally obtained using sensitive photom-\nultiplier tubes as photon counting devices. However,\nmore recently, 2-dimensional photomultiplier tubes and\ncooled charge-coupled device (CCD) cameras have also\nbeen employed as a means of imaging the spatial distribu-\ntion of light emission from diseased and damaged plant\ntissues [2-6,9]. The clearest images were obtained by Chen\net al., [2], using a micro-channel plate coupled to a cooled\nCCD to image light captured through a lens. However, the\nacquisition time required for what is a relatively weak sig-\nnal, was 1 hour, preventing a detailed temporal investiga-\ntion of stress-induced bioluminescence.\nHere, we present a novel configuration of a cooled CCD\nthat enables high sensitivity, high resolution 2-dimen-\nsional imaging with short integration times. We demon-\nstrate the utility of the system to image and quantify\ndelayed chlorophyll fluorescence and wound-induced\nluminescence from plant leaves.\nResults and Discussion\nConstruction of a luminescence imager\nThe experimental imaging set-up, shown in Figure 1,\nessentially consists of a glass sample stage coupled to a\ncooled CCD with fibre optics. This configuration enables\nmaximal capture of light emitted from one side of a flat\nsample placed on the stage by avoiding the inevitable\nlight dispersal associated with lens-based systems. The\nsystem is useful for imaging bioluminescence from flat\nsamples such as plant leaves or cells grown transparent\nculture vessels or on solid supports such as microscope\nslides or membranes. By analysing the data captured from\nthe CCD, it is possible to estimate the number of photons\ndetected per unit area over a very wide dynamic range. We\nroutinely measured emission levels in the region of 1000\nphotons\/sec\/mm2 from wounded leaves (see below). In\naddition to its high sensitivity, the imager is significantly\nless expensive than equipment based on photomultiplier\ntubes.\nImaging delayed chlorophyll fluorescence\nDelayed chlorophyll fluorescence is a well known phe-\nnomenon that is the result of emission of photons from\nexcited chlorophyll molecules following transfer of leaves\nto the dark. It is generally measured using devices such as\nphotomultiplier tubes and in principle, can be detected by\nexisting lens-based CCD imaging systems. We first tested\nthe spatial and temporal resolution of our system by\nimaging delayed chlorophyll fluorescence from leaves of\nArabidopsis thaliana and Tradescantia albiflora (Figure 2).\nThe image of a leaf from a variegated T. albiflora plant\nclearly indicates a dependence on chlorophyll for the\nemission to occur, since white, non-pigmented regions of\nthe leaf do not emit light (compare Figure 2B and 2C).\nBright images could be obtained with relatively short\nexposure times of 1–5 minutes. Delayed chlorophyll fluo-\nrescence rapidly subsided between 5 and 10 minutes after\ntransfer to dark. The absolute level of delayed chlorophyll\nfluorescence in Arabidopsis leaves varied greatly, generally\nappearing to be lower later in the day.\nSpatial and temporal resolution of ultra-weak \nluminescence in wounded leaves\nDelayed chlorophyll fluorescence produces relatively\nstrong light emission compared to typical levels of ultra-\nweak bioluminescence. To test the sensitivity of our\nequipment, we wanted to try to image these lower level\nemissions. Several previous reports had indicated that\nmechanical wounding increases ultra-weak luminescence\nfrom plant leaves, but studies on the temporal and spatial\nnature of this phenomenon are limited. We used a hae-\nmostat to inflict crushing wounds on Arabidopsis leaves\nand imaged them over a time course by making successive\n5-minute exposures. In many experiments, no wound-\ninduced luminescence could be seen in the first 5 minutes\nafter transfer to the imager, since it was masked by delayed\nchlorophyll fluorescence. After this initial period how-\never, photon emission was much more intense around the\nwounded tissue. In other experiments, where delayed\nchlorophyll fluorescence was lower, signals could be seen\neven in the first exposure. Results from such an experi-\nment are shown in Figure 3 and in an accompanying\nextended animation (Additional File 1). In the first image,\nwhich includes an unwounded control leaf and two leaves\neach wounded twice across the lamina, striking wound-\ninduced luminescence can be seen above a general back-\nground of delayed chlorophyll fluorescence (Figure 3A).\nIn the two subsequent 5 min exposures, chlorophyll fluo-\nrescence has subsided, whilst the wound-induced lumi-\nnescence remains high (Figure 3B,3C). The serrated\npattern of the haemostat surface is clearly reflected in the\npattern of luminescence from the leaf, with areas of\ngreater damage exhibiting maximal photon emission. In\ngeneral, we observed that induced luminescence isPage 2 of 8\n(page number not for citation purposes)\nBMC Plant Biology 2004, 4:19 http:\/\/www.biomedcentral.com\/1471-2229\/4\/19strongest immediately after wounding and then gradually\ndecays over a period of an hour or more.\nOrigin of wound-induced luminescence\nIn order to understand more about the origin of the lumi-\nnescence emitted by wounded leaves, we used coloured\nfilters to investigate its spectral characteristics. The results\nare shown in Figure 4. A red filter (LEE 182), which trans-\nmits visible light of wavelengths greater than 600 nm, was\neffectively transparent with respect to the light emitted\nfrom wound sites, whereas blue and green filters (LEE 183\nand LEE 735), which absorb light in the region of 550 –\n750 nm, caused a significant reduction in signal reaching\nthe detector when placed between the wounded leaf and\nthe sample stage. Interestingly, a different blue filter (LEE\n118), which transmits light above 700 nm, did not signif-\nicantly affect luminescence (Figure 4). These results sug-\ngest that light emitted from wounded Arabidopsis leaves\nhas a wavelength between 700 and 750 nm, i.e. the red\nregion of the visible spectrum. This is consistent with typ-\nical fluorescence from chlorophyll (730 nm). To test\nwhether chlorophyll might be the source of wound-\ninduced photon emission, we used the carotenoid biosyn-\nthesis inhibitor, norflurazon, to generate photobleached\nleaves lacking chlorophyll [13]. Compared with equiva-\nlent leaves from control plants, these white leaves failed to\nluminesce following wounding, except in remaining chlo-\nrophyll-containing areas (Figure 5). Together, these\nresults demonstrate that light emission from wounded\nleaves is chlorophyll-dependent. Since luminescence\noccurs in the dark, and extends for times well beyond\ndelayed chlorophyll fluorescence, we conclude that excita-\ntion energy produced by some wound-induced process is\ntransferred to chlorophyll and emitted as light. One pos-\nsible source of such energy might be products of oxidative\ndamage, such as excited triplet carbonyls produced during\nlipid peroxidation [14].\nTemperature-dependence of wound-induced \nluminescence\nThat delayed chlorophyll fluorescence exhibits tempera-\nture-dependence has been shown previously in several\nsystems [15]. Since we determined that chlorophyll is the\nmajor source of light emission from wounded leaves, we\nConfiguration of the PiXx*ell 1A imagerFigure 1\nConfiguration of the PiXx*ell 1A imagerPage 3 of 8\n(page number not for citation purposes)\nBMC Plant Biology 2004, 4:19 http:\/\/www.biomedcentral.com\/1471-2229\/4\/19investigated whether wound-induced luminescence\nmight also be affected by temperature. Application of heat\nto the sample via a foil heater in the lid of the sample\nchamber significantly increased the intensity of lumines-\ncence over the tested temperature range. Without applied\nheat, the temperature of the sample stage was approxi-\nmately 7°C, when only low levels of luminescence could\nbe detected. Luminescence increased significantly upon\nactivation of the heater, resulting in an increase in the\ntemperature of the sample stage to something in the\nregion of 20°C. This phenomenon is illustrated in Figure\n6, and in an accompanying extended animation (see\nAdditional file 2).\nFurthermore, we found that heating could activate lumi-\nnescence in leaves wounded up to 3 hours before imaging.\nFor example, Figure 7 shows a series of images from an\nexperiment in which leaves were wounded at different\ntimes before imaging. Without heating, only the leaf\nwounded immediately before imaging showed detectable\nwound-induced luminescence, and this emission decayed\nto very low levels within 20 min. After 45 mins, heating\nwas applied to the sample chamber, and within 10 min-\nutes, wounds applied immediately, 15 mins and 1 hour\nbefore the start of imaging were clearly visible, with a faint\nemission also detectable from a wound applied to the leaf\n2 hours before the start of imaging (therefore the image\nshown here (t = 65) was captured over 3 hours after\nwounding this particular leaf). This phenomenon is rem-\niniscent of the light emission measured during thermolu-\nminometry [14]. Thermoluminescence is a chlorophyll-\ndependent light emission observed at high temperatures\n(maxima at 70–90°C and 120–140°C), which, like ultra-\nweak bioluminescence, is attributed to singlet oxygen and\ntriplet carbonyls produced by lipid peroxidation during\noxidative stress [14]. Coupled with the results above,\nthese data suggest that temperature increases the rate of\ndecay of excited triplet carbonyls, and that the energy\nreleased is transferred to chlorophyll and emitted as light.\nThere may also be an additional temperature-dependent\ncomponent in the rate of emission of light from excited\nchlorophyll, as observed for delayed fluorescence [15].\nDelayed chlorophyll fluorescence imagesFigur  2\nDelayed chlorophyll fluorescence images. Luminescence from leaves of Arabidopsis (A) and Tradescantia (B). Images are 5-\nminute exposures taken as soon as possible after transfer of leaves to the equipment. A conventional photograph of the Trades-\ncantia leaf imaged in (B) is shown to illustrate the pattern of variegation (C).Page 4 of 8\n(page number not for citation purposes)\nBMC Plant Biology 2004, 4:19 http:\/\/www.biomedcentral.com\/1471-2229\/4\/19Conclusions\nThe novel configuration of cooled CCD that we have used\nin this study to capture 2-dimensional images of plant\nleaves provides excellent temporal and spatial resolution\nof bioluminescence\/chemiluminescence processes in bio-\nlogical materials, which are important markers of various\nforms of stress and disease. Using this system, we are able\nto define the origin of wound-induced luminescence from\nplant leaves as chlorophyll, and suggest that this arises via\nthe temperature-dependent release of energy from excited\ntriplet carbonyls produced by oxidative stress.\nWound-induced bioluminescence in ArabidopsisFig re 3\nWound-induced bioluminescence in Arabidopsis. \nSequential 5-minute exposures of wounded Arabidopsis \nleaves, showing strong luminescence from wound sites. \"t = \n5\" represents an exposure from 0–5 mins after the start of \nthe experiment; \"t = 10,\" 5–10 mins and \"t = 15,\" 10–15 \nmins. The image from t = 5 min also includes a control, \nunwounded leaf, which is omitted from subsequent images \nfor brevity.\nSpectral characteristics of wound-induced luminescenceFigure 4\nSpectral characteristics of wound-induced lumines-\ncence. Luminescence images of wounded Arabidopsis leaves \nin the presence of spectral filters. Pairs of wounded leaves \nare shown imaged with no filter, or with emitted light filtered \nthrough green (LEE 735), blue (LEE 183 and LEE 118) or red \n(LEE 182) filters.Page 5 of 8\n(page number not for citation purposes)\nBMC Plant Biology 2004, 4:19 http:\/\/www.biomedcentral.com\/1471-2229\/4\/19Methods\nPlant material\nPlants of Arabidopsis thaliana, Columbia ecotype, were\ngrown in soil in a glasshouse at 22°C with a 16-hour pho-\ntoperiod. Wounding was performed by crushing leaves\nwith a haemostat. To generate leaves lacking chlorophyll,\nArabidopsis plants grown for 3 weeks under 16 h light\/8 h\ndark, were watered with 0.1 mM norflurazon (Sigma\nAldrich PS1044) and grown under constant illumination\nat 120 µmol\/m2\/sec. Under these conditions, newly\nemerging leaf tissue was white. Leaves with white regions\nwere taken 15 days after the start of norflurazon treat-\nment, and used for luminescence imaging.\nTwo dimensional luminescence imaging apparatus\nThe imager used is a two-dimensional imaging system\nbased on a slow-scan 'scientific grade' Silicon Photo Area-\nDetector [SPAD] (Integrated SPAD Imaging System –\nPiXx*ell 1A, Biolumonics Ltd), which consists of a cooled\nultra-sensitive area photo-detector within a stainless steel\nvacuum vessel and associated image acquisition electron-\nics. The input image is coupled to the detector with optical\nfibres (numerical aperture = 1). The detector contains\n222,336 pixels, and in the experiments presented here,\nran at an operating temperature of -58°C. The combina-\nChlorophyll is required for wound-induced luminescenceFigu e 5\nChlorophyll is required for wound-induced lumines-\ncence. Luminescence imaging of leaves containing or lacking \nchlorophyll. The figure shows luminescence images (5 minute \nexposures) of wounded control (top) and photobleached, \nnorflurazon-treated (bottom), leaves of Arabidopsis. Conven-\ntional photographs of the leaves imaged are shown at left.\nTemperature-dependence of luminescenceFigur  6\nTemperature-dependence of luminescence. Images of \nthe same wounded Arabidopsis leaf taken at different times \nfollowing wounding, before and after the application of heat \nto the sample. \"t = 5\" represents an exposure from 0–5 mins \nafter the start of the experiment; \"t = 10,\" 5–10 mins and \"t = \n25,\" 20–25 mins. The heater in the lid of the sample stage \nwas switched on after 15 mins.Page 6 of 8\n(page number not for citation purposes)\nBMC Plant Biology 2004, 4:19 http:\/\/www.biomedcentral.com\/1471-2229\/4\/19tion of the proprietary low read-out noise electronics,\ncooling of the detector and the optical fibre coupling\nresults in a sensitive imaging system capable of recording\nthe faintest luminescences at high resolution, (40 µm to\n200 µm depending on geometry of sample and integra-\ntion time). The spectral absorption response of the SPAD\nranges from the near UV to IR, thus including the entire\nvisible spectrum up to the band-gap energy barrier of Sili-\nHeating re-activates luminescence hours after woundingFigure 7\nHeating re-activates luminescence hours after wounding. 5-minute exposures taken at different times during an exper-\niment showing a control Arabidopsis leaf (C) and leaves wounded immediately before (0) and 15, 60 and 120 minutes before \nimaging. The first frame shows the luminescence image using a different display palette from the rest of the images, since it \nmore clearly shows the strong delayed chlorophyll fluorescence emitted by all leaves over the first 5 minutes of the time \ncourse, which is absent from the dehydrated areas of the old wounds (but not the freshest wound applied immediately before \nimaging). All other images are displayed using the same colour palette, which is included in the figure for reference. Times indi-\ncated in the upper left corner of each panel represent the time (in minutes) relative to the start of the experiment at which \neach 5-minute exposure was completed. Heating began at 45 minutes.Page 7 of 8\n(page number not for citation purposes)\nBMC Plant Biology 2004, 4:19 http:\/\/www.biomedcentral.com\/1471-2229\/4\/19Publish with BioMed Central   and  every \nscientist can read your work free of charge\n\"BioMed Central will be the most significant development for \ndisseminating the results of biomedical research in our lifetime.\"\nSir Paul Nurse, Cancer Research UK\nYour research papers will be:\navailable free of charge to the entire biomedical community\npeer reviewed and published immediately upon acceptance\ncited in PubMed and archived on PubMed Central \nyours — you keep the copyright\nSubmit your manuscript here:\nhttp:\/\/www.biomedcentral.com\/info\/publishing_adv.asp\nBioMedcentral\ncon (1.1 eV) i.e. at approx 1100 nm; however, for ultimate\nsensitivity the detector output is monochrome, i.e. there is\nno wavelength selectivity in the present instrument. Fur-\nther information is available on request from Michel Flor-\nHenry, Biolumonics Ltd.\nFilters\nColoured filters were obtained from Lee Filters (Andover,\nUK). We used lighting effect filters LEE 182 – \"light red,\"\nLEE 118 – \"light blue,\" LEE 183 – \"moonlight blue\" and\nLEE 735 – \"velvet green.\" Spectral characteristics of the fil-\nters can be viewed at http:\/\/www.leefilters.com, though\nreaders should note that the transmittance spectra\nprovided with the filters covers the range 300–800 nm,\nrather than the more limited 400–700 nm spectra shown\non the web site. Filters were placed between the leaf and\nthe sample stage prior to imaging.\nAuthors' contributions\nMF-H designed the PiXx*ell 1A luminescence imager. MF-\nH and MRR conceived of the current study, participated in\nits design and coordination, carried out experiments and\nwrote the manuscript. MF-H performed data analysis.\nTCM performed the norflurazon experiment, and both\nTCM and GLdB participated in some experimental design\nand execution. All authors read and approved the final\nmanuscript.\nAdditional material\nReferences\n1. Devaraj B, Usa M, Inaba H: Biophotons: Ultraweak light emis-\nsion from living systems. Curr Opin Solid State Mat Sci 1997,\n2:188-193.\n2. Chen WL, Xing D, Tan SC, Tang YH, He YH: Imaging of ultra-\nweak bio-chemiluminescence and singlet oxygen generation\nin germinating soybean in response to wounding. Luminescence\n2003, 18:37-41.\n3. Maccarrone M, Finazzi AA, Rosato N: Ultraweak light emission is\na common response of bacterial cells to chemico-physical\nstress. J Biolumin Chemilumin 1998, 13:287-293.\n4. Suzuki S, Usa M, Nagoshi T, Kobayashi M, Watanabe N, Watanabe H,\nInaba H: 2-dimensional imaging and counting of ultraweak\nemission patterns from injured plant seedlings. J Photochem\nPhotobiol B 1991, 9:211-217.\n5. Makino T, Kato K, Iyozumi H, Honzawa H, Tachiiri Y, Hiramatsu M:\nUltraweak luminescence generated by sweet potato and\nFusarium oxysporum interactions associated with a defense\nresponse. Photochem Photobiol 1996, 64:953-956.\n6. Kobayashi M, Devaraj B, Usa M, Tanno Y, Takeda M, Inaba H: Two-\ndimensional imaging of ultraweak photon emission from\ngerminating soybean seedlings with a highly sensitive CCD\ncamera. Photochem Photobiol 1997, 65:535-537.\n7. Amano T, Kobayashi M, Devaraj B, Usa M, Inaba H: Ultraweak bio-\nphoton emission imaging of transplanted bladder cancer.\nUrol Res 1995, 23:315-318.\n8. Kobayashi M, Takeda M, Sato T, Yamazaki Y, Kaneko K, Ito K, Kato\nH, Inaba H: In vivo imaging of spontaneous ultraweak photon\nemission from a rat's brain correlated with cerebral energy\nmetabolism and oxidative stress. Neurosci Res 1999, 34:103-113.\n9. Ohya T, Kurashige H, Okabe H, Kai S: Early detection of salt\nstress damage by biophotons in red bean seedling. Jpn J Appl\nPhys 2000, 39:3696-3700.\n10. Ohya T, Oikawa N, Kawabata R, Okabe H, Kai S: Biophoton emis-\nsion induced by osmotic stress in adzuki bean roote. Jpn J Appl\nPhys 2003, 42:7625-7628.\n11. Salin ML, Quince KL, Hunter DJ: Chemi-luminescence from\nmechanically injured soybean root tissue. Photobiochem\nPhotobiophys 1985, 9:271-279.\n12. Mittler R: Oxidative stress, antioxidants and stress tolerance.\nTrends Plant Sci 2002, 7:405-410.\n13. Jung S: Effect of chlorophyll reduction in Arabidopsis thaliana\nby methyl jasmonate or norflurazon on antioxidant systems.\nPlant Physiol Biochem 2004, 42:225-231.\n14. Havaux M: Spontaneous and thermoinduced photon emis-\nsion: new methods to detect and quantify oxidative stress in\nplants. Trends Plant Sci 2003, 8:409-413.\n15. Radenovic C, Markovic D, Jeremic M: Delayed chlorophyll fluo-\nrescence in plant models. Photosynthetica 1994, 30:1-24.\nAdditional File 1\nAnimated gif file showing images from five sequential 5-minute exposures \nof one control leaf (bottom) and four wounded Arabidopsis leaves.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1471-\n2229-4-19-S1.gif]\nAdditional File 2\nAnimated gif file showing images from seven sequential 5-minute expo-\nsures of two control leaves (bottom) and four wounded Arabidopsis \nleaves. Images were initially captured from samples on a cold imaging \nstage, but the heater in the lid of the sample stage was switched on when \nindicated.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1471-\n2229-4-19-S2.gif]Page 8 of 8\n(page number not for citation purposes)\n"}