{"doi":"10.1029\/2003GL018469","coreId":"71165","oai":"oai:eprints.lancs.ac.uk:6633","identifiers":["oai:eprints.lancs.ac.uk:6633","10.1029\/2003GL018469"],"title":"First tristatic studies of meso-scale ion-neutral dynamics and energetics in the high-latitude upper atmosphere using collocated fpis and EISCAT radar","authors":["Aruliah, A. L.","Griffin, E. M.","McWhirter, I.","Aylward, A. D.","Ford, E. A. K.","Charalambous, A.","Kosch, M. J.","Davis, C. J.","Howells, V. S. C."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-02","abstract":"A unique experiment was undertaken during the nights of 27 and 28 February 2003. Tristatic Fabry-Perot Interferometer (FPI) measurements of the upper thermosphere were co-located with tristatic EISCAT radar measurements of the ionosphere. Tristatic measurements should remove assumptions of uniform wind fields and ion drifts, and zero vertical winds. The FPIs are located close to the 3 radars of the EISCAT configuration in northern Scandinavia. Initial studies indicate that the thermosphere is more dynamic and responsive to ionospheric forcing than expected. Mesoscale variations are observed on the scales of tens of kilometers and minutes. The magnitude of the upper thermosphere neutral wind dynamo field is on average 50% of the magnetospheric electric field and contributes an average magnitude of 41% of in-situ Joule heating. The relative orientations of the 2 dynamo field vectors produce a standard deviation of ±65% in the contribution of the neutral wind dynamo","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71165.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/6633\/1\/art_632.pdf","pdfHashValue":"77ada2df1b23e51698545aebf23e95efea274b16","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:6633<\/identifier><datestamp>\n      2018-01-24T03:15:04Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5431<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        First tristatic studies of meso-scale ion-neutral dynamics and energetics in the high-latitude upper atmosphere using collocated fpis and EISCAT radar<\/dc:title><dc:creator>\n        Aruliah, A. L.<\/dc:creator><dc:creator>\n        Griffin, E. M.<\/dc:creator><dc:creator>\n        McWhirter, I.<\/dc:creator><dc:creator>\n        Aylward, A. D.<\/dc:creator><dc:creator>\n        Ford, E. A. K.<\/dc:creator><dc:creator>\n        Charalambous, A.<\/dc:creator><dc:creator>\n        Kosch, M. J.<\/dc:creator><dc:creator>\n        Davis, C. J.<\/dc:creator><dc:creator>\n        Howells, V. S. C.<\/dc:creator><dc:subject>\n        T Technology (General)<\/dc:subject><dc:description>\n        A unique experiment was undertaken during the nights of 27 and 28 February 2003. Tristatic Fabry-Perot Interferometer (FPI) measurements of the upper thermosphere were co-located with tristatic EISCAT radar measurements of the ionosphere. Tristatic measurements should remove assumptions of uniform wind fields and ion drifts, and zero vertical winds. The FPIs are located close to the 3 radars of the EISCAT configuration in northern Scandinavia. Initial studies indicate that the thermosphere is more dynamic and responsive to ionospheric forcing than expected. Mesoscale variations are observed on the scales of tens of kilometers and minutes. The magnitude of the upper thermosphere neutral wind dynamo field is on average 50% of the magnetospheric electric field and contributes an average magnitude of 41% of in-situ Joule heating. The relative orientations of the 2 dynamo field vectors produce a standard deviation of ±65% in the contribution of the neutral wind dynamo.<\/dc:description><dc:date>\n        2004-02<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/6633\/1\/art_632.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2003GL018469<\/dc:relation><dc:identifier>\n        Aruliah, A. L. and Griffin, E. M. and McWhirter, I. and Aylward, A. D. and Ford, E. A. K. and Charalambous, A. and Kosch, M. J. and Davis, C. J. and Howells, V. S. C. (2004) First tristatic studies of meso-scale ion-neutral dynamics and energetics in the high-latitude upper atmosphere using collocated fpis and EISCAT radar. Geophysical Research Letters, 31 (3). pp. 1-4. ISSN 0094-8276<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/6633\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1029\/2003GL018469","http:\/\/eprints.lancs.ac.uk\/6633\/"],"year":2004,"topics":["T Technology (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"First tristatic studies of meso-scale ion-neutral dynamics and energetics\nin the high-latitude upper atmosphere using collocated FPIs and\nEISCAT radar\nA. L. Aruliah, E. M. Griffin, I. McWhirter, A. D. Aylward, E. A. K. Ford,\nand A. Charalambous\nAtmospheric Physics Laboratory, University College London, London, UK\nM. J. Kosch\nUniversity of Lancaster, UK\nC. J. Davis and V. S. C. Howells\nRutherford Appleton Laboratory, Chilton, Didcot, Oxfordshire, UK\nReceived 21 August 2003; revised 19 November 2003; accepted 3 December 2003; published 3 February 2004.\n[1] A unique experiment was undertaken during the nights\nof 27 and 28 February 2003. Tristatic Fabry-Perot\nInterferometer (FPI) measurements of the upper\nthermosphere were co-located with tristatic EISCAT radar\nmeasurements of the ionosphere. Tristatic measurements\nshould remove assumptions of uniform wind fields and ion\ndrifts, and zero vertical winds. The FPIs are located close to\nthe 3 radars of the EISCAT configuration in northern\nScandinavia. Initial studies indicate that the thermosphere is\nmore dynamic and responsive to ionospheric forcing than\nexpected. Mesoscale variations are observed on the scales of\ntens of kilometers and minutes. The magnitude of the upper\nthermosphere neutral wind dynamo field is on average\n50% of the magnetospheric electric field and contributes\nan average magnitude of 41% of in-situ Joule heating.\nThe relative orientations of the 2 dynamo field vectors\nproduce a standard deviation of ±65% in the contribution of\nthe neutral wind dynamo. INDEX TERMS: 0310 Atmospheric\nComposition and Structure: Airglow and aurora; 0358 Atmospheric\nComposition and Structure: Thermosphere—energy deposition;\n2407 Ionosphere: Auroral ionosphere (2704); 2411 Ionosphere:\nElectric fields (2712); 2427 Ionosphere: Ionosphere\/atmosphere\ninteractions (0335). Citation: Aruliah, A. L., E. M. Griffin,\nI. McWhirter, A. D. Aylward, E. A. K. Ford, A. Charalambous,\nM. J. Kosch, C. J. Davis, and V. S. C. Howells (2004), First\ntristatic studies of meso-scale ion-neutral dynamics and energetics\nin the high-latitude upper atmosphere using collocated FPIs\nand EISCAT radar, Geophys. Res. Lett., 31, L03802, doi:10.1029\/\n2003GL018469.\n1. Introduction\n[2] The EISCAT radar is notable for being the only radar\nsystem producing true tristatic ionospheric measurements.\nOther radar systems with only one or two beams rely on\nbeam-swinging techniques to determine orthogonal compo-\nnents. This assumes an unchanging plasma velocity during\na scan. Discussion of the assumptions required by beam-\nswinging is presented by Etemadi et al. [1989].\n[3] There are still outstanding questions in ion-neutral\ndynamics that can only be resolved by common volume\ntristatic measurements of the meso-scale behavior of the\nionosphere and thermosphere. The role of the thermo-\nsphere is undervalued owing to assumptions of large\nspatial and temporal scale sizes. It is recognized that there\nis a significant element missing from the energy budget\nthat is likely to be attributable to mesoscale phenomena\nsuch as gravity waves [Innis et al., 1998] and plasma\nvelocity variability [Codrescu et al., 2000]. Yet there are\nfew measurements. Co-located ion-neutral observations\nwere first made by the Dynamics Explorer satellites\n[e.g., Killeen et al., 1984]. Only a few groups have\nperformed experiments using both FPIs and radar to\ninvestigate large-scale ion-neutral energetics and dynamics\nover a scale size of hundreds of kilometers [e.g., Cierpka\net al., 2000; Aruliah and Griffin, 2001]. There are also\nonly a few published investigations of mesoscale spatial\nvariations using two FPIs in close proximity [e.g., Greet et\nal., 1999; Ishii et al., 2001]. In general the radar commu-\nnity derives neutral parameters from ionospheric measure-\nments by way of models of the thermosphere. Such\nmodels have great value for determining climatologies,\nbut should be treated with care for modeling specific\nbehavior [e.g., Griffin et al., 2003].\n2. The Case for Tristatic Observations\n[4] Tristatic measurements of thermospheric winds allow\ntrue determination of the velocity vector. The thermospheric\nwind velocity vector U appears in several fundamental\nequations such as the calculation of current j = Neq(V \u0001 U)\nwhere Ne is the electron density, q is the electron charge, V is\nthe plasma velocity; or the effective electric field E0 = V \u0003\nB + U \u0003 B, which includes a term for the neutral wind\ndynamo, U \u0003 B, as well as the magnetospheric electric\nfield E (=V \u0003 B). Both these equations may be used to\ncalculate Joule heating, which is the second largest sink for\ndissipation of magnetospheric energy [e.g., Thayer et al.,\n1995]. However, the majority of existing studies ignore or\ngrossly simplify the influence of the thermosphere because\nat high latitudes the neutral wind dynamo is assumed to be an\nGEOPHYSICAL RESEARCH LETTERS, VOL. 31, L03802, doi:10.1029\/2003GL018469, 2004\nCopyright 2004 by the American Geophysical Union.\n0094-8276\/04\/2003GL018469$05.00\nL03802 1 of 4\norder of magnitude smaller than the magnetospheric dynamo\n[e.g., Mozer, 1973].\n[5] Further thermospheric influence comes from the neu-\ntral temperature and vertical wind component which can\nmodify the chemical composition. Changes in temperature\naffect rates of chemical reactions; while up-welling or\ndown-welling alters the ratio of molecular to atomic par-\nticles, which consequently affects the production and loss\nmechanisms for plasma densities. Killeen et al. [1984] have\nshown that the large-scale nighttime response time can be\nbetween 1–3 hours. This experiment shows a more rapid\nresponse on the meso-scale than previously assumed. Thus\ncompositional changes in the thermosphere due to rapid up-\nor down-welling are currently not well modeled during\ngeomagnetically active conditions owing to underestimation\nof the response time.\n3. The Instruments\n[6] The Atmospheric Physics Laboratory (APL) at Uni-\nversity College London operates a FPI at the Kiruna\nEsrange Optical Platform System (KEOPS) in Sweden\n(67.8\u0001N, 20.4\u0001E) and in November 2002 installed another\nat the Sodankyla¨ Geophysical Observatory in Finland\n(67.4\u0001N, 26.6\u0001E). The first tristatic observations of thermo-\nspheric winds were achieved through collaboration with the\nUniversity of Lancaster, which has a FPI at Skibotn in\nNorway (69.3\u0001N, 20.4\u0001E). The three FPIs are located close\nto the three EISCAT radar receivers.\n[7] The FPI observes the red line aurora and airglow\nemission at 630 nm wavelength. Measurement of the\nDoppler shift and Doppler broadening of the emission line\nallows calculation of thermospheric wind speeds and tem-\nperatures at an altitude of around 240 km. The FPI line-of-\nsight measurement has a 1\u0001 field-of-view which is directed\nby a pointing mirror using a fixed elevation angle. All the\nFPIs view the common volume tristatic position called\nposition A (69.3\u0001N, 25.0\u0001E) and 4 cardinal positions (north,\neast, south, west), as well as the vertical and a calibration\nlamp. The elevation angles are 45\u0001 for the KEOPS and\nSodankyla¨ FPIs, and 51.5\u0001 for the Skibotn FPI. Combining\nall these line-of-sight observations provides a grid of\nobservations and thus a useful wider spatial context to the\nthermospheric wind, intensity and temperature fields.\n[8] The FPIs collect data continually throughout the\nperiod September–April. The only requirement is that\nobservations are made during the night owing to the low\nintensities of the airglow and auroral emissions, and during\nclear skies because light scattered by cloud loses directional\ninformation.\n[9] Meanwhile the EISCAT radar at Tromsø and the\nreceivers at Sodankyla¨ and Kiruna were aimed in the direc-\ntion of Position A and a fixed beam CP1-like mode was used\nto make simultaneous tristatic observations of a common\nvolume with the FPIs. The radar-FPI campaign covered\n24 hours over two consecutive nights: 1630-0430 UT for\nthe nights of 27–28 February 2003 and 28 February–\n01 March 2003. This paper concentrates on the first night.\n4. Results\n[10] The upper atmosphere at high-latitudes can be very\ndynamic. This makes it difficult to ensure that the FPIs and\nradars are viewing the same volume. The footprint of the\nradar at the tristatic A position is about 3 km wide and its\nposition is known precisely. The Tromsø radar is the active\nradar, which means that measurements are taken at all\naltitudes along its line-of-sight. This allows measurement\nof the height of the F2 electron density peak, hmF2. The peak\nemission height for the 630 nm emission is approximately\n1 scale height below hmF2, which in this altitude region is\napproximately 50 km. The tristatic A position was chosen\nassuming that the quiet steady state 630 nm emission peak\nheight is 240 km. In reality the two nights were geomag-\nnetically active (Kp \u0004 4). EISCAT measurements show that\nhmF2 varies between 280 km and 400 km, with a consid-\nerable variability of around ±50 km. As a result the 630 nm\nemission height is probably not 240 km for large periods\nof the night. However, there is a close correspondence\nbetween the intensity variations of the three FPIs for the\nmajority of the time as shown in Figure 1c. This implies that\nthe deviation from 240 km is not large, which is consistent\nFigure 1. (a) Zonal winds on 27 February 2003 calculated\nusing line-of-sight measurements interpolated to 15 minute\nintervals from all 3 FPIs which is compared with a calculation\nusing only 2 FPIs with the assumption of a zero vertical wind\ncomponent. (b) Comparison of the actual vertical wind\ncomponents above each of the 3 FPI sites showing\nconsiderable though consistent meso-scale structure. Note\nthe different time resolutions: KEOPS has 3.5 minutes,\nSodankyla has 8.7 minutes and Skibotn has 13.9 minutes.\n(c) Comparison of the intensities from the 3 FPIs, where the\nSodankyla and Skibotn intensities are multiplied by 11.4 and\n1.49, respectively, to scale with KEOPS.\nL03802 ARULIAH ET AL.: FIRST TRISTATIC ION-NEUTRAL STUDY CONVECTION L03802\n2 of 4\nwith the fact that the 630 nm emission peak is very broad,\nwith a full width half maximum value of up to 100 km [e.g.,\nSolomon et al., 1988]. By calculating the gradient in the\nwind speeds across the field-of-view of the FPIs, it is\npossible to estimate that if the emission height increases\nby 50 km (thus increasing the radial extent of the line-of-\nsight measurement) the change in magnitude is about\n11 ms\u00011. In comparison, the average error on the individual\nwind measurements is about ±15 ms\u00011 for all the FPIs,\nsince the integration times are chosen to compensate for the\nsensitivity of the detectors while maximizing time resolu-\ntion. As can be seen from Figures 1b and 1c, Skibotn has\nthe lowest time resolution which smoothes out large, rapid\nvariations.\n[11] Figure 1a compares the calculation of the zonal\ncomponent of the wind vector measured at position A using\nall three FPIs, with a calculation using only the two FPIs at\nKEOPS and Sodankyla¨. The bistatic calculation requires the\nassumption that the vertical component is zero. This is a\ncommonly used assumption since the vertical component is\nusually an order of magnitude smaller than the horizontal\ncomponent. The average difference between the tristatic and\nbistatic calculations of the zonal winds is 25ms\u00011 with a\nstandard deviation of ±18 ms\u00011. The difference is consistent\nwith the observation that the individual FPI measurements\nof vertical winds above each site are not zero, but generally\nvary between ±40 ms\u00011 (Figure 1b), and thus contribute to\nthe line-of-sight measurement.\n[12] The three independent sets of vertical wind measure-\nments shown in Figure 1b also reveal how spatially variable\nthe winds are on the meso-scale, since the observations are\nseparated by only 200–300 km. KEOPS and Skibotn are on\na similar longitude and KEOPS and Sodankyla are on a\nsimilar latitude. Similar clear structures appear at the dif-\nferent sites, sometimes separated by a time lag, e.g., there\nis a large downwelling followed by an upwelling between\n21–23 UT seen at KEOPS and Skibotn, with a 15 minute\ntime delay between the sites. KEOPS shows a vertical wind\ncomponent rising to 95 ms\u00011 upwards at 2210 UT that then\ndrops in magnitude during the period 2200–2230 UT.\nSkibotn, which lies on a similar meridian, shows a\nsimilarly large and rapid upwelling that is sustained\nbetween 22–23 UT. It is unlikely that these large changes\nin wind speeds are due to altitude changes of the 630 nm\nemission height since hmF2 shows only a steady decline in\naltitude from 380 km to 315 km between 21–23 UT.\n[13] The source of the upwelling can be seen in Figure 2\nwhich shows the component of the EISCAT plasma\nvelocities in the northward direction perpendicular to the\nmagnetic field. These velocities are highly variable, with a\nstandard deviation of over ±500 ms\u00011. There is a sudden\nspike when the velocity jumps from +262 ms\u00011 at 2155 UT\nto \u00014909 ms\u00011 at 2156 UT and then drops rapidly back\ntowards zero. Several intermediate data points confirm this\nas a real observation rather than noise. The all-sky camera\nimage from Sodankyla¨ at 21:59:20 UT shows an auroral\nfeature in the near vicinity which is the likely source of\nlocalized high electric fields causing this velocity spike.\n[14] Overlaid on this plot is the line-of-sight observation\nof tristatic A from KEOPS. This is the FPI with the highest\ntime resolution (integration time is 20 seconds). The wind\nspeeds have been multiplied by 30 to show them on the\nsame scale. There is a large and clear increase in the line-of-\nsight neutral wind component that corresponds quite closely\nto the increase in plasma velocity around 22 UT. Between\n2151–2154 UT the KEOPS line-of-sight winds show an\nacceleration of 25 ms\u00012. This compares with an average\nacceleration of\u0001121 ms\u00012 for the plasma velocities between\n2148–2156 UT. The importance of this figure is the rapid\nspeed of the thermospheric response on the meso-scale. At\nthese accelerations it would take around 72 seconds for the\nneutral wind to accelerate from zero to 1\/e times the\nmaximum plasma velocity. Consequently this acceleration\nis predominantly due to the vertical wind component, as\nshown in Figure 1b, rather than horizontal ion drag, since the\ne-folding response time for ion-drag calculated from the\nEISCAT electron density measurement is over 1 hour, using\nthe definition from Killeen et al. [1984], for example. There\nis also a large amount of in-situ Joule heating between\n2130–2230 UT which will cause up-welling.\n[15] The FPIs also measure thermospheric temperatures.\nComparison with the EISCAT ion temperatures has proved\ninteresting and points to problems in the assumptions used\nin the standard analysis routine. These temperature obser-\nvations will be discussed in a companion paper by Griffin et\nal. [in preparation, 2004].\n[16] Theoretical models, such as the Coupled Thermo-\nsphere Ionosphere Plasmasphere model (CTIP), have\nseverely underestimated thermospheric temperatures.\nCodrescu et al. [2000] attribute this to ignoring the variability\nof the ionospheric velocities and therefore underestimating\nJoule heating. Our own studies have shown significant meso-\nscale variability in the thermosphere as well [Aruliah and\nGriffin, 2001]. One aim of this collocated tristatic experiment\nis to investigate how much thermospheric variability adds to\nthe effects of ionospheric variability on Joule heating. Joule\nheating peaks at around 150 km altitude and most studies\ndeal with the height-integrated Joule heating. This experi-\nment measures only the nighttime F-region. However, at\nFigure 2. Plasma velocities from the EISCAT radar on\n27 February 2003 at position A (grey line). Superposed are\nthe line-of-sight neutral winds from the KEOPS FPI multi-\nplied by 30 to appear on the same scale (black line). There is\na sharp increase and decrease in the plasma velocities at\naround 2200UT and also a rapid peaking of the line-of-sight\nwind in the direction from KEOPS to position A.\nL03802 ARULIAH ET AL.: FIRST TRISTATIC ION-NEUTRAL STUDY CONVECTION L03802\n3 of 4\nnighttime it is expected that the currents and Joule heating\nin the F-region become very significant in importance\nbecause the E-region becomes relatively weak. This is\nbecause there is no photoionization and, since recombination\nis rapid at E-region heights owing to the greater particle\ndensity, the ions and electrons are removed, and are only\nreplenished by particle precipitation. However, nighttime\nparticle precipitation is more intense than at daytime,\nresulting in sporadic enhancement of the E-region which\ncomplicates the interpretation of the data; producing ques-\ntions about where the main source of heating is etc. These\nwill be considered in a further study.\n[17] The calculation of the in-situ Joule heating for the\nnight of 27 February 2003 has been done both with and\nwithout the neutral wind dynamo. This assumes that Joule\nheating is proportional to Ne*E\n02\nperp, where E\n0\nperp is the\ncomponent of the effective electric field perpendicular to\nB. The average of the magnitudes of the percentage differ-\nences for the whole night, j(E02perp \u0001 E2perp)j\/E02perp, is 41% of\nthe total in-situ Joule heating. This is consistent with a\nmodel simulation by Thayer et al. [1995] that has shown\nthat ignoring the flywheel effect can introduce a 40% error\nin the calculation of height-integrated polar cap Joule\nheating during steady state moderately active conditions.\nCierpka et al. [2000] made simultaneous FPI and EISCAT\nmeasurements of neutral and plasma velocities and temper-\natures to study the effect of neglecting the neutral atmo-\nsphere and found errors of at least 60% in calculating Joule\nheating in the F-layer.\n[18] The magnitude of the neutral wind dynamo electric\nfield in the upper thermosphere is on average 50% of the\nmagnetospheric dynamo, which is consistent with Killeen et\nal. [1984]. The relative orientation of the fields is also vital.\nThe neutral wind dynamo electric field varies fairly smoothly\nwhile the magnetospheric electric field is highly variable.\nThe vector sum of the two fields results in a standard\ndeviation of ±65% for the difference in the Joule heating\nterm due to the neutral wind dynamo. There is also a definite\ntrend with respect to geomagnetic activity, so that the largest\ndifferences occur during the quiet post-storm conditions.\nThis is due to the inertia of the thermosphere, which main-\ntains the high storm time winds [Aruliah et al., 1999] while\nthe plasma velocities respond immediately to the reduction in\nthe magnetospheric electric field.\n5. Conclusion\n[19] Tristatic FPI measurements allow a very detailed\nstudy of the meso-scale structure of the upper thermosphere\nthat complement radar studies of the ionosphere. The initial\nresults presented here show a spatially variable thermo-\nsphere at high latitudes, which is also capable of rapid\nresponse to ion forcing over meso-scale distances. The\ncontribution of the neutral wind dynamo to Joule heating\nappears to be highly variable and can increase and decrease\nthe effective electric field considerably since it is on average\n50% of the magnitude of the magnetospheric electric field.\nOn the first night of this experiment the contribution of the\nupper thermosphere neutral wind dynamo to in-situ Joule\nheating is 41% (±65%).\n[20] Acknowledgments. The APL team would like to acknowledge\nfunding from the Lapbiat grant, administered by the Sodankyla¨ Geophys-\nical Observatory, together with their generous help in logistics. Also\nacknowledging PPARC grant PPA\/G\/O\/2001\/00484. EISCAT is an Inter-\nnational Association supported by Finland (SA), France (CNRS), the\nFederal Republic of Germany (MPG), Japan (NIPR), Norway (NFR),\nSweden (NFR) and the United Kingdom (PPARC). We thank the institutes\nwho maintain the IMAGE magnetometer array and ESRANGE KEOPS\nfacility. Finally, we would like to dedicate this paper to the memory of\nProfessor Phil Williams who has been a leading light in the inception of\nEISCAT and the exploitation of this important facility.\nReferences\nAruliah, A. L., I. C. F. Mu¨ller-Wodarg, and J. Schoendorf (1999), The\nconsequences of geomagnetic history on the high-latitude thermosphere\nand ionosphere: Averages, J. Geophys. Res., 104(A12), 28,073–28,088.\nAruliah, A. L., and E. Griffin (2001), Meso-scale structure in the high-\nlatitude thermosphere, Annales Geophys., 19, 37–46.\nCierpka, K., M. J. Kosch, M. Rietveld, K. Schlegel, and T. Hagfors (2000),\nIon-neutral coupling in the high-latitude F-layer from incoherent scatter\nand Fabry-Perot interferometer measurements, Annales Geophys., 18,\n1145–1153.\nCodrescu, M. V., T. J. Fuller-Rowell, J. C. Foster, J. M. Holt, and S. J.\nCariglia (2000), Electric Field variability associated with the Millstone\nHill electric field model, J. Geophys. Res., 105(A3), 5265–5273.\nEtemadi, A., S. W. H. Cowley, and M. Lockwood (1989), The Effect of\nRapid Changes in Ionospheric Flow on Velocity Vectors Deduced From\nRadar Beam-Swinging Experiments, J. Atmos. Terr. Phys., 51, 125–138.\nGreet, P. A., M. G. Conde, P. L. Dyson, J. L. Innis, A. M. Breed, and D. J.\nMurphy (1999), Thermospheric wind field over Mawson and Davis,\nAntarctica: simultaneous observations by two Fabry-Perot spectrometers\nof 630 nm emission, J. Atmos. Terr. Phys, 61, 1025–1045.\nGriffin, E. M., A. L. Aruliah, I. C. F. Mu¨ller-Wodarg, and A. D. Aylward\n(2003), Comparison of High-Latitude Thermospheric Meridional Winds\nI: Optical and Radar Experimental Comparisons, Ann. Geophys, in press.\nGriffin, E. M., A. L. Aruliah, I. McWhirter, A. D. Aylward, E. A. K. Ford,\nA. Charalambous, M. J. Kosch, C. J. Davis, and V. S. C. Howells (2004),\nInvestigation of simultaneous, co-located ion and neutral temperatures\nfrom the tristatic FPI-EISCAT radar experiment, Geophys. Res. Lett, in\npreparation.\nInnis, J. L., P. A. Greet, and P. L. Dyson (1998), Are polar cap gravity\nwaves a heat source for the high-latitude thermosphere?, Geophys. Res.\nLett., 25, 1487–1490.\nIshii, M., M. Conde, R. W. Smith, M. Krynicki, E. Sagawa, and S. Watari\n(2001), Vertical wind observations with two Fabry-Perot interferometers\nat Poker Flat Alaska, J. Geophys. Res, 106(A6), 10,537–10,551.\nKilleen, T. L., P. B. Hays, G. R. Carignan, R. A. Heelis, W. B. Hanson,\nN. W. Spencer, and L. H. Brace (1984), Ion-Neutral Coupling in the High\nLatitude F-Region: Evaluation of Ion Heating Terms from Dynamics\nExplorer 2, J. Geophys. Res, 89, 7495–7508.\nMozer, F. S. (1973), Analysis of Techniques for Measuring DC and AC\nElectric Fields in the Magnetosphere, Space Sci. Rev, 14, 272.\nSolomon, S. C., P. B. Hays, and V. J. Abreu (1988), The auroral 6300A\nemission: Observations and modeling, J. Geophys. Res., 93(A9), 9867–\n9882.\nThayer, J. P., J. F. Vickrey, R. A. Heelis, and J. B. Gary (1995), Interpreta-\ntion and modelling of the high-latitude electromagnetic energy flux,\nJ. Geophys. Res., 100(A10), 19,715–19,728.\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\nA. L. Aruliah, A. D. Aylward, A. Charalambous, E. A. K. Ford, E. M.\nGriffin, and I. McWhirter, Atmospheric Physics Laboratory, University\nCollege London, 67–73, Riding House Street, London, UK. (a.aruliah@\nucl.ac.uk)\nM. J. Kosch, University of Lancaster, UK.\nC. J. Davis and V. S. C. Howells, Rutherford Appleton Laboratory,\nChilton, Didcot, Oxfordshire, UK.\nL03802 ARULIAH ET AL.: FIRST TRISTATIC ION-NEUTRAL STUDY CONVECTION L03802\n4 of 4\n"}