{"doi":"10.1016\/S0301-4215(01)00045-3","coreId":"207986","oai":"oai:eprints.lse.ac.uk:17879","identifiers":["oai:eprints.lse.ac.uk:17879","10.1016\/S0301-4215(01)00045-3"],"title":"Can natural factors explain any cross-country differences in carbon dioxide emissions?","authors":["Neumayer, Eric"],"enrichments":{"references":[{"id":17233842,"title":"A","authors":[],"date":"1998","doi":"10.1162\/003465398557294","raw":"Schmalensee, R, Stoker, T M and Judson, R A (1998) ‘World carbon dioxide emissions: 1950-2050’, Review of Economics and Statistics 80, 15-27.","cites":null},{"id":17233844,"title":"Carbon emissions and income inequality’.","authors":[],"date":"2000","doi":"10.1093\/oep\/52.4.651","raw":"Ravallion, M, Heil, M and Jalan, J (2000) ‘Carbon emissions and income inequality’. Oxford Economic Papers 52, 651-669.","cites":null},{"id":17233840,"title":"Climate Change","authors":[],"date":"1995","doi":"10.1093\/jel\/8.1.211","raw":"IPCC  (1995)  Climate  Change  1995  –  economic  and  social  dimensions  of  climate change. Oxford: Oxford University Press.","cites":null},{"id":17233833,"title":"Data on Land Area Impacted by Human Activities as a Percentage of Total Land Area.","authors":[],"date":"2001","doi":null,"raw":"CIESIN (2001) Data on Land Area Impacted by Human Activities as a Percentage of Total  Land  Area.  New  York.  Center  for  International  Earth  Science  Information Network.","cites":null},{"id":17233848,"title":"Economic development and environmental quality: an econometric analysis’.","authors":[],"date":"1994","doi":null,"raw":"Shafik, N. (1994) ‘Economic development and environmental quality: an econometric analysis’. Oxford Economic Papers 46 (0), 757-773. Natural factors and carbon dioxide emissions    Energy Policy Summers, R and Heston, A (1991) ‘The Penn World Table (Mark 5): An expanded set of international comparisons, 1950-1988’. Quarterly Journal of Economics 106 (2), 327-368.","cites":null},{"id":17233836,"title":"Economic Growth and the Environment’.","authors":[],"date":"1995","doi":"10.3386\/w4634","raw":"Grossman, G M. and Krueger, A B (1995) ‘Economic Growth and the Environment’.","cites":null},{"id":17233832,"title":"Energy needs and CO2 emissions – constructing a formula for just distributions’.","authors":[],"date":"1994","doi":"10.1016\/0301-4215(94)90048-5","raw":"Benestad, O (1994) ‘Energy needs and CO2 emissions – constructing a formula for just distributions’. Energy Policy 22 (4), 725-734.","cites":null},{"id":17233835,"title":"Geography and economic development’, Consulting Assistance on Economic Reform (CAER) II Discussion Paper 39. Cambridge (Mass.),","authors":[],"date":"1999","doi":null,"raw":"Gallup, J L and Sachs, J D (1999) ‘Geography and economic development’, Consulting Assistance  on  Economic  Reform  (CAER)  II  Discussion  Paper  39.  Cambridge (Mass.), Harvard International Institute for Development.","cites":null},{"id":17233843,"title":"In defence of historical accountability for greenhouse gas emissions’.","authors":[],"date":"2000","doi":"10.1016\/s0921-8009(00)00135-x","raw":"Neumayer,  E  (2000)  ‘In  defence  of  historical  accountability  for  greenhouse  gas emissions’. Ecological Economics 33, 185-192.","cites":null},{"id":17233837,"title":"Natural factors and carbon dioxide emissions Energy Policy","authors":[],"date":"1992","doi":null,"raw":"Quarterly Journal of Economics 110 (2), 353-377. Natural factors and carbon dioxide emissions    Energy Policy Grubb, M., Sebenius, J, Magalhaes A  and Subak, S (1992) ‘Sharing the burden’ in Mintzer,  I M (ed) Confronting climate  change: risks, implications and responses. Cambridge, Cambridge University Press, 305-322.","cites":null},{"id":17233831,"title":"Regression diagnostics.","authors":[],"date":"1980","doi":"10.1002\/0471725153","raw":"Belsley, D A, Kuh E and Welsch, R E (1980) Regression diagnostics. New York, John Wiley.","cites":null},{"id":17233834,"title":"Richer and cleaner? A study on carbon dioxide emissions in developing countries’.","authors":[],"date":"1999","doi":"10.1016\/s0301-4215(99)00047-6","raw":"Galeotti,  M  and  Lanza,  A  (1999)  ‘Richer  and  cleaner?  A  study  on  carbon  dioxide emissions in developing countries’. Energy Policy 27 (10), 565-573.","cites":null},{"id":17233839,"title":"Stoking the fires? CO2 emissions and economic growth’.","authors":[],"date":"1995","doi":"10.3386\/w4248","raw":"Holtz-Eakin,  D  and  Selden,  T  M  (1995)  ‘Stoking  the  fires?  CO2  emissions  and economic growth’. Journal of Public Economics 57 (1), 85-101.","cites":null},{"id":17233838,"title":"Weather to travel. London, Tomorrow’s Guides.","authors":[],"date":"1998","doi":null,"raw":"Harding, M. (1998) Weather to travel. London, Tomorrow’s Guides.","cites":null},{"id":17233850,"title":"World Development Indicators.","authors":[],"date":"2000","doi":"10.1596\/0-8213-4553-2","raw":"World Bank (2000) World Development Indicators. Washington DC, World Bank.","cites":null},{"id":17233851,"title":"World Resources 1996-1997. Washington DC, World Resources Institute.","authors":[],"date":"1996","doi":null,"raw":"WRI (1996) World Resources 1996-1997. Washington DC, World Resources Institute.","cites":null},{"id":17233841,"title":"World Road Statistics","authors":[],"date":"2000","doi":null,"raw":"International Road Federation (2000) World Road Statistics 2000. Geneva: International Road Federation.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2002-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/207986.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/17879\/1\/__Libfile_repository_Content_Neumayer%2C%20E_Can%20natural%20factors%20explain%20any%20cross-country%20differences%20in%20carbon%20dioxide%20emissions_Can%20natural%20factors%20explain%20any%20cross-country%20differences%20in%20carbon%20dioxide%20emissions%20%28LSE%20RO%29.pdf","pdfHashValue":"8e851d711ab47a730e62b7aed58e8ce6a13c1328","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:17879<\/identifier><datestamp>\n      2012-08-14T09:21:06Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/17879\/<\/dc:relation><dc:title>\n        Can natural factors explain any cross-country differences in carbon dioxide emissions?<\/dc:title><dc:creator>\n        Neumayer, Eric<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2002-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/17879\/1\/__Libfile_repository_Content_Neumayer%2C%20E_Can%20natural%20factors%20explain%20any%20cross-country%20differences%20in%20carbon%20dioxide%20emissions_Can%20natural%20factors%20explain%20any%20cross-country%20differences%20in%20carbon%20dioxide%20emissions%20%28LSE%20RO%29.pdf<\/dc:identifier><dc:identifier>\n          Neumayer, Eric  (2002) Can natural factors explain any cross-country differences in carbon dioxide emissions?  Energy Policy, 30 (1).  pp. 7-12.  ISSN 0301-4215     <\/dc:identifier><dc:relation>\n        http:\/\/www.elsevier.com\/wps\/find\/journaldescription.cws_home\/30414\/description#description<\/dc:relation><dc:relation>\n        10.1016\/S0301-4215(01)00045-3<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/17879\/","http:\/\/www.elsevier.com\/wps\/find\/journaldescription.cws_home\/30414\/description#description","10.1016\/S0301-4215(01)00045-3"],"year":2002,"topics":["GE Environmental Sciences"],"subject":["Article","PeerReviewed"],"fullText":"  \nEric Neumayer \nCan natural factors explain any cross-\ncountry differences in carbon dioxide \nemissions? \n \nArticle (Accepted version) \n(Refereed) \n \nOriginal citation: \nNeumayer, Eric (2002) Can natural factors explain any cross-country differences in carbon \ndioxide emissions? Energy policy, 30 (1). pp. 7-12. ISSN 0301-4215  \n \nDOI: 10.1016\/S0301-4215(01)00045-3  \n \n© 2001 Elsevier Science \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/17879\/  \nAvailable in LSE Research Online: August 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \nNatural factors and carbon dioxide emissions  Energy Policy \n1 \nCan natural factors explain any cross-country \ndifferences in carbon dioxide emissions? \n \nPublished in: \nEnergy Policy, 30 (1), 2002, pp. 7-12 \n \n \nEric Neumayer \nDepartment of Geography and Environment, London School of Economics and Political \nScience, Houghton Street, London WC2A 2AE, UK \nPhone: 0207-955-7598. Fax: 0207-955-7412. Email: e.neumayer@lse.ac.uk \nNatural factors and carbon dioxide emissions  Energy Policy \n2 \nThis articles examines what role natural factors play in explaining cross-country \ndifferences in carbon dioxide emissions. Natural factors mean here differences in the \nclimatic conditions, the availability of renewable and fossil fuel resources and the \ntransportation requirements of countries. While income remains the main variable, \nregression results show that natural factors contribute significantly to an explanation of \ncross-country differences in carbon dioxide emissions. Furthermore, drastic differences \nin natural conditions can lead to substantial differences in predicted emission \nrequirements for individual countries at approximately the same level of income. \n \nShort title: Natural factors and carbon dioxide emissions \n \nKey words: temperature, renewable and fossil resources, transportation \n \n1. Introduction \n \nMany studies have examined the empirical relationship between carbon dioxide (CO2) \nemissions and income, as traditionally measured by gross national product (GNP) or \ngross domestic product (GDP). These studies differ in the functional form as well as in \nthe independent variables employed to explain cross-country differences in CO2 \nemissions. For example, while the early pioneering studies such as Grossman and \nKrueger (1995), Shafik (1994) and Holtz-Eakin and Selden (1995) concentrated on \nNatural factors and carbon dioxide emissions  Energy Policy \n3 \nincome as the explaining variable and used standard estimation techniques, later studies \nhave taken into account additional explanatory factors such as, for example, income \ninequality (Ravallion, Heil and Jalan 2000) or have employed more complex \neconometric estimation techniques (see, for example, Schmalensee, Stoker and Judson \n1998; Galeotti and Lanza 1999). \nWhat has been somewhat neglected so far is the question to what extent natural \nfactors can explain any cross-country differences in CO2 emissions. Natural factors \nmean here differences in the climatic conditions, the availability of renewable and fossil \nenergy resources and the transportation requirements that could explain such cross-\ncountry differences even after controlling for the effect of income. Theoretically, we \nwould expect cold countries to have greater heating requirements and hot countries to \nhave greater cooling requirements, all other things equal. We would expect big \ncountries with higher transportation requirements to have higher emissions than small \ncountries. Similarly, we would expect countries that have access to domestic renewable \nenergy resources to have lower emissions than countries that lack such resources. \nFinally, countries without major fossil fuel reserves should have lower CO2 emissions \nthan countries that are rich in such reserves. This is for two reasons: First, because of \nthe emissions generated in the extraction and possibly – for example, in the case of oil – \nprocessing of such resources. Second, and probably more importantly, because \ncountries that have lacked historically major domestic fossil fuel reserves have had \nstrong incentives to develop in a less fossil fuel intensive way in order to cut down on \nenergy import costs. The classical example for this is fossil fuel poor Japan. \nThis short article tries to examine these issues. Apart from a better positive \nunderstanding of what determines cross-country differences in CO2 emissions, this \nstudy is also motivated by the role natural factors have played in normative discussions \nNatural factors and carbon dioxide emissions  Energy Policy \n4 \non an internationally just distribution of CO2 emission rights (see, more generally, also \nNeumayer 2000). For example, Grubb et al. (1992, p. 314) examine, without endorsing, \n“reasonable emissions” as one criterion for an internationally just allocation rule. They \ndefine a ‘reasonable level of emissions for each country’ as the ‘level that would \nsupport a consistent, modest standard of living, given the national climatic and other \nconditions [emphasis added]. Permits would be granted for emissions at this level, but \nnot for those “luxury” emissions in excess of this amount’. The Intergovernmental Panel \non Climate Change (IPCC 1995, p. 104) contemplates a similar allocation rule under the \nheading “basic needs”. Such a rule would allow countries ‘the right to emit the \nminimum levels of greenhouse gases needed to meet the basic needs of their citizens \n(…). It would perhaps be close to the allocation of emission permits according to \npopulation, although basic needs could vary from country to country depending on \nclimate and other matters [emphasis added]’. As a final example, consider the attempt \nby Benestad (1994) to construct a formula for just allocation of CO2 emission rights \naccording to energy needs, including such things as a country’s heating and cooling \nrequirements, transportation needs as well as renewable energy sources potential. Since \nthis study examines the relative importance of a number of natural factors explaining \ncross-country differences in CO2 emissions, it can also shed some light on the relevance \nof normative allocation rules that refer to such natural factors. \n \n2. Methodology and data \n \nVariants of the following basic model were estimated:1 \n \nEit = β0 + β1Yit + β2(Yit)2 + β3Li + β4Hi + β5Ai + β6Ri + β7Fi + β8Tt + eit \nNatural factors and carbon dioxide emissions  Energy Policy \n5 \n \nE are logged CO2 emissions per capita, Y is logged income per capita, L is the lowest \naverage minimum temperature, H is the highest average maximum temperature, A is the \nlog of the percentage of total land area impacted by human activities, R is the \npercentage of renewable energy sources of total energy use, F is the log of combined oil \nand gas reserves, T is a time trend and e is a stochastic error term. \nThe data consisted of a panel covering 1960-1988. The latter date was chosen in \norder to avoid biases introduced by either awakening policy responses to combat global \nwarming or by the collapse of the Communist system and the drastic falls in CO2 \nemission in these countries. Emission and income data were available for 148 countries \nwith a total of 3673 observations. However, the poor availability of data on renewable \nand fossil energy resources meant that the estimations could use only 106 countries with \n2647 observations. Data are missing mainly for very small countries, but also for a few \npoor developing countries particularly in Sub-Saharan Africa. Note that not all countries \nhave observations over the whole time period.  \nA fixed effects model could not be estimated as all of the explanatory variables apart \nfrom income do not vary over time and would have therefore been dropped. A random \neffects model avoids this problem, but a Hausman specification test rejected it. \nVariations of equation (1) were therefore estimated via ordinary least squares (OLS). It \nis unlikely that more complex estimation techniques would lead to drastically different \nresults. Since Cook-Weisberg tests rejected the hypothesis of constant variance, \nheteroscedasticity robust standard errors were used throughout. \nPer capita CO2 emissions from fossil fuel burning and cement manufacturing, the \ndependent variable, is based on the data set used by Shafik (1994). Where necessary, it \nhas been extended using data in Marland, Boden and Andres (2000). Income is \nNatural factors and carbon dioxide emissions  Energy Policy \n6 \nmeasured as real per capita GDP in purchasing power parity taken from the Penn World \nTable 5.6 (an earlier version of which is described in Summers and Heston 1991). As a \nproxy for heating requirements a country’s lowest average minimum temperature was \ntaken from Harding (1998). Similarly, a country’s highest average maximum \ntemperature was taken from the same source as a proxy for cooling requirements. For \nmost country’s this source states the climatic conditions in the capital city. For the \nbigger countries and the ones attractive to tourists, temperatures are given for several \ncities. In these cases, the simple average was taken. As an alternative proxy for heating \nrequirements, the average number of frost days in winter months as listed in Masters \nand McMillan (2000) could have been taken as well. However, the absolute value of the \nPearson correlation coefficient between a country’s lowest average minimum \ntemperature and its average number of frost days is very high (.88). This together with \nthe fact that minimum temperatures were available for more countries made it the \npreferred choice. \nBig countries have higher transportation requirements as goods and people are \ntypically moved over longer distances. However, it would be misleading to simply take \na country’s total land area as a proxy for its transportation requirements. This is because \noften huge parts of big countries are sparsely inhabited, if at all. CIESIN (2001) \nprovides data on the percentage of total land area impacted by human beings, that is \neither urbanized (as indicated by lights at night) or used for agriculture. This provides a \ngood proxy to the share of total land area inhabited by human beings, the idea being that \npeople live in urban areas or where agriculture takes place. The proxy for a country’s \ntransportation requirements is then the share of total land area impacted by human \nactivities (data for land area taken from World Bank 2000).2 \nNatural factors and carbon dioxide emissions  Energy Policy \n7 \nRenewable resource use was measured in per cent of total energy consumption from \nall sources in 1997, taken from WRI (2000). Ideally, it would have been desirable to \nemploy panel data for the sample period. Unfortunately, such data are unavailable so \nthat the 1997 data, the only ones available, were simply taken for the whole period \n1960-1989. While this leads to biased estimates, nothing can be done about it. \nRenewable resources encompass hydroelectric, geothermal, solar and wind resources as \nwell as “fuel and waste”, which comprise biomass and animal products, gas\/liquids \nfrom biomass, industrial waste, and municipal waste. Fuel and waste renewable energy \nsources in the form of biomass are much used by poor developing countries. While \n“fuel and waste” partly create CO2 (and other greenhouse gas) emissions, they are \nusually not included in CO2 emission data, which derive exclusively from estimates of \nfossil fuel burning and cement manufacturing. In as much as fuel and waste substitute \nfor fossil fuels, which would have otherwise been used, their consumption should lead \nto lower CO2 emissions thus measured. In this respect, they do not differ from other \nsubstitute renewable energy sources that entail few CO2 emissions, such as \nhydroelectricity. It is therefore correct to include them for the purposes of explaining \ncross-country CO2 emissions here. \nFossil fuel reserves were measured as the log of British Thermal Units (BTUs) per \ncapita proven crude oil and natural gas reserves in 1993, taken from Gallup and Sachs \n(1999), with WRI (1996) as the original source. As with the renewable resource \nvariable, it would have been desirable to use panel data from the period 1960 to 1988, \nbut such data are not readily available. \n \n3. Results \n \nNatural factors and carbon dioxide emissions  Energy Policy \n8 \nTable 1 shows the results of OLS estimation, starting with a model that includes only \nincome as explanatory variables. This model is augmented by each of the additional \nexplanatory variables in isolation. Finally, the full model is estimated, excluding the H \nvariable for reasons explained further below. \n \n< Insert table 1 here > \n \nRegression 1 reproduces the typical Environmental Kuznets Curve (EKC) result. CO2 \nemissions per capita rise first with higher GDP per capita, but at a decreasing rate, until \na threshold is reached after which emissions fall. Note that in accordance with earlier \nstudies (for example, Shafik 1994) the turning point, while theoretically existent, is way \nbeyond the relevant range of GDP per capita so that throughout the sample per capita \nCO2 emissions are predicted to increase with higher income levels. \nRegression 2 adds L to the explanatory variables. It has the expected sign and is \nhighly statistically significant. The lower is the lowest average minimum temperatures \nthe higher are CO2 emissions per capita. Regression 3 adds H instead. Unexpectedly, the \nestimated coefficient is significantly negative indicating that the higher is the highest \naverage maximum temperatures the lower are CO2 emissions per capita. Regressions 4 \nto 6 add A, R and F respectively. All estimates have the expected signs and are strongly \nsignificant. A larger land area impacted by human activities leads to higher CO2 \nemissions per capita. A higher share of renewable energy sources and lower per capita \nreserves of oil and gas lead to lower CO2 emissions per capita. \nThe estimated coefficient for H presents a puzzle. Hotter countries are estimated to \nhave lower instead of higher emissions. How can this be explained? Probably the reason \nfor this counter-intuitive result is a combination of hotter countries being poorer on \nNatural factors and carbon dioxide emissions  Energy Policy \n9 \naverage than less hot countries and the demand for cooling being a luxury good. That \nthe hot countries close to the equator on average have lower GDP per capita than \ncountries in more temperate climate zones is a well documented fact (see, for example, \nGallup and Sachs 1999; Masters and McMillan 2000). Table 2 lists the partial Pearson \ncorrelation coefficients of the variables used, which confirms this result. It can be seen \nthat logged GDP per capita is highly negatively correlated to the lowest average \nminimum temperature (-.52) and to the highest average maximum temperature (-.41), \nindicating that colder and less hot countries have higher incomes. Furthermore, whereas \nheating represents a necessity good in cold climates with consumers having few \nalternatives if they do not want to freeze to death, cooling is likely to be a luxury good \nin hot climates. Those who can afford will have air conditioning and other cooling \ndevices, those who cannot will not. Supportive of this hypothesis is the fact that the sign \nof the coefficient of H changes to positive in regression 3 if the sample is restricted to \nobservations with a GDP per capita greater than US$5000 (results not reported). The \nsmall relevance of adding the maximum average temperature as an explanatory variable \ncan also be appreciated by the fact that R2 rises only from .7657 to .7738 after H \nbecomes included in the estimated equation. \n \n<Insert Table 2 here> \n \nBecause of the unexpected sign of the H variable in the full sample, regression 6 in \ntable 1 estimates the full model excluding H. As can be seen, all variables keep their \nexpected signs and remain statistically significant. Also, coefficients and their \nsignificance do not change dramatically in comparing regression 6 with the other five \nregressions. This might be interpreted to mean that multicollinearity, which could be a \nNatural factors and carbon dioxide emissions  Energy Policy \n10 \nproblem looking at the partial correlation coefficients in table 2, is actually not so much \nof a problem. \nHow relevant are natural factors in explaining cross-country differences in \nemissions? The results in table 1 suggest that they are of relevance, but limited so. \nThere are two ways to see this. First, note that the improvement in R2 due to including \nthe natural factor variables is relatively small: It rises from .7657 to .8349, that is by \nabout 9 per cent. Second, to allow comparison of the estimated coefficients, which are \nheld in different units, the last column in table 1 reports standardised coefficients. These \nindicate by how many standard deviations the explained variable changes for a one \nstandard deviation increase in one of the explanatory variables. It can be seen that the \nstandardised coefficients for the income variables are much higher than the ones for the \nnatural factor variables. In other words, income is a much more potent predictor of \ncross-country differences in emissions than natural factors are. Income is the main \nexplanatory variable to which natural factors merely add some explanatory power. \nBelsley, Kuh and Welsch (1980) suggest excluding observations as outliers that have \nboth high residuals and a high leverage. Applying their criterion together with their \nsuggested cutoff point would exclude another 188 observations.3 Table 3 repeats the \nestimation of the pure income and the full model using the restricted sample. It can be \nseen that the estimated coefficients in regressions 7 and 8 do not change dramatically in \ncomparison to regressions 1 and 6. Only F becomes insignificant, which sheds some \ndoubt on whether cross-country differences in fossil fuel reserves have any impact on \ndifferences in emissions. Importantly, the major result that income is the main \nexplanatory variable of cross-country differences in CO2 emissions remains valid if the \noutliers are excluded. \n \nNatural factors and carbon dioxide emissions  Energy Policy \n11 \n<Insert Table 3 here> \n \n4. Implications and concluding observations \n \nCan natural factors explain any cross-country differences in CO2 emissions? Yes, they \ncan, but only to some limited extent. A country’s income level is and remains the main \nexplanatory variable. Countries with, for example, colder climates or a lower \navailability of renewable resources can claim that they have higher fossil fuel \nrequirements than comparable countries with warmer climates or higher availability of \nrenewable resources. However, given that an international allocation of emission rights \nwill have to deal with the fact that countries have hugely different income levels and \nthat countries at different income levels have hugely different emissions per capita, \nnatural factors are bound to play a minor role only. \nThis does not mean that for individual countries natural factors cannot play an \nimportant role in determining their CO2 emissions. The cold, big, fossil fuel rich, but \nrenewable resource poor Soviet Union had of course higher emission requirements than \nwarm, comparatively small, fossil fuel poor, but renewable resource rich Ethiopia, for \nexample. To see the impact of natural factors, assume for a moment that both countries \nwere at the same income level, say, the sample mean in 1997, which is US$5233. The \nSoviet Union would then have predicted per capita CO2 emissions of 2.97 metric tons, \nwhereas Ethiopia would have .53 metric tons per capita emissions. The Soviet Union \nemissions would therefore be almost six times higher than Ethiopia’s emissions. This \ndramatic difference would entirely be due to differences in natural factors. Countries \nwith drastically disadvantageous natural conditions will therefore demand higher \nNatural factors and carbon dioxide emissions  Energy Policy \n12 \nemission rights than countries at roughly the same income levels and rightly so if one \nthinks that natural factors should impact upon a just allocation of such rights. \n \nAcknowledgements \nI would like to thank Francesca Pozzi from the Center for International Earth Science \nInformation Network (CIESIN), Columbia University, for providing data on one of the \nvariables. \n \nReferences \n \nBelsley, D A, Kuh E and Welsch, R E (1980) Regression diagnostics. New York, John \nWiley. \nBenestad, O (1994) ‘Energy needs and CO2 emissions – constructing a formula for just \ndistributions’. Energy Policy 22 (4), 725-734. \nCIESIN (2001) Data on Land Area Impacted by Human Activities as a Percentage of \nTotal Land Area. New York. Center for International Earth Science Information \nNetwork. \nGaleotti, M and Lanza, A (1999) ‘Richer and cleaner? A study on carbon dioxide \nemissions in developing countries’. Energy Policy 27 (10), 565-573. \nGallup, J L and Sachs, J D (1999) ‘Geography and economic development’, Consulting \nAssistance on Economic Reform (CAER) II Discussion Paper 39. Cambridge \n(Mass.), Harvard International Institute for Development. \nGrossman, G M. and Krueger, A B (1995) ‘Economic Growth and the Environment’. \nQuarterly Journal of Economics 110 (2), 353-377. \nNatural factors and carbon dioxide emissions  Energy Policy \n13 \nGrubb, M., Sebenius, J, Magalhaes A and Subak, S (1992) ‘Sharing the burden’ in \nMintzer, I M (ed) Confronting climate change: risks, implications and responses. \nCambridge, Cambridge University Press, 305-322. \nHarding, M. (1998) Weather to travel. London, Tomorrow’s Guides. \nHoltz-Eakin, D and Selden, T M (1995) ‘Stoking the fires? CO2 emissions and \neconomic growth’. Journal of Public Economics 57 (1), 85-101. \nIPCC (1995) Climate Change 1995 – economic and social dimensions of climate \nchange. Oxford: Oxford University Press. \nInternational Road Federation (2000) World Road Statistics 2000. Geneva: International \nRoad Federation. \nMarland, G, Boden, T and Andres, R J (2000) National CO2 Emissions from Fossil-Fuel \nBurning, Cement Manufacture, and Gas Flaring: 1751-1997. Oak Ridge: Oak Ridge \nNational Laboratory. \nMasters, W A and McMillan, M A (2000) ‘Climate and scale in economic growth’, CID \nWorking Paper 48. Cambridge (Mass.): Harvard International Institute for \nDevelopment. \nNeumayer, E (2000) ‘In defence of historical accountability for greenhouse gas \nemissions’. Ecological Economics 33, 185-192. \nRavallion, M, Heil, M and Jalan, J (2000) ‘Carbon emissions and income inequality’. \nOxford Economic Papers 52, 651-669. \nSchmalensee, R, Stoker, T M and Judson, R A (1998) ‘World carbon dioxide emissions: \n1950-2050’, Review of Economics and Statistics 80, 15-27. \nShafik, N. (1994) ‘Economic development and environmental quality: an econometric \nanalysis’. Oxford Economic Papers 46 (0), 757-773. \nNatural factors and carbon dioxide emissions  Energy Policy \n14 \nSummers, R and Heston, A (1991) ‘The Penn World Table (Mark 5): An expanded set \nof international comparisons, 1950-1988’. Quarterly Journal of Economics 106 (2), \n327-368. \nWorld Bank (2000) World Development Indicators. Washington DC, World Bank. \nWRI (1996) World Resources 1996-1997. Washington DC, World Resources Institute. \nWRI (2000) World Resources 2000-2001. Washington DC, World Resources Institute. \nNatural factors and carbon dioxide emissions  Energy Policy \n15 \nNOTES \n1\n Inclusion of logged income in cubic form was tried as well. However, it was left out because its \ninclusion rendered all income variables insignificant in some estimations due to strong multicollinearity. \n2\n A country’s total length of road network, both paved and unpaved (taken from International Road \nFederation 2000), failed as an alternative proxy variable because of strong positive correlation with GDP \nper capita: rich countries tend to have more roads, but there is no reason why richer countries should have \nhigher natural transport requirements. \n3\n The criterion is to exclude an observation if its so-called DFITS is greater than twice the square root of \n(k\/n), where k is the number of independent variables and n the number of observations. DFITS is defined \nas the square root of (hi\/(1-hi)), where hi is an observation’s leverage, multiplied by its studentized \nresidual. \nNatural factors and carbon dioxide emissions  Energy Policy \n16 \nTable 1. Regression results, full sample. \n \n \nRegression 1 2 3 4 5 6 7 Stand. \ncoeff. \nConstant -11.19 \n(2.65) \n-20.50 \n(5.55) \n-13.63 \n(3.24) \n-14.44 \n(3.79) \n-15.17 \n(3.75) \n-15.17 \n(3.75) \n-22.28 \n(6.54) \n \nY (lnGDP) 2.47 \n(8.74) \n2.72 \n(10.60) \n2.52 \n(7.78) \n1.36 \n(4.64) \n2.85 \n(10.57) \n2.85 \n(10.57) \n2.01 \n(8.13) \n1.20 \nY2 -.06 \n(3.65) \n-.09 \n(5.88) \n-.07 \n(3.94) \n-.01 \n(.51) \n-.07 \n(4.15) \n-.09 \n(5.31) \n-.06 \n(3.74) \n-.53 \nL (mintemp)  -.04 \n(16.56) \n    -.03 \n(11.83) \n-.16 \nH (maxtemp)   -.02 \n(8.11) \n     \nR (renewable)    -.01 \n(16.10) \n  -.01 \n(13.04) \n-.19 \nF (lnfossil)     .03 \n(9.06) \n .01 \n(3.80) \n.04 \nA (lnarea)      .11 \n(10.40) \n.06 \n(6.48) \n.06 \nT (time trend) -.003 \n(1.41) \n.002 \n(1.25) \n-.001 \n(.59) \n.002 \n(1.07) \n-.002 \n(1.14) \n-.002 \n(1.11) \n.004 \n(2.80) \n.02 \nN 2647 2647 2647 2647 2647 2647 2647  \nR2 .7657 .8083 .7738 .8083 .7762 .7862 .8349  \n \nDependent variable is E (lnCO2); OLS estimation 1960-1988 panel; absolute t-values in parentheses; \nheteroscedasticity-robust standard errors \n \nNatural factors and carbon dioxide emissions  Energy Policy \n17 \nTable 2. Pearson correlation coefficients. \n \n E (lnCO2) Y L H R F \nY (lnGDP) .88      \nL (mintemp) -.62 -.52     \nH (maxtemp) -.42 -.41 .48    \nR (renewable) -.68 -.59 .50 .20   \nF (lnfossil) .28 .23 -.15 .12 -.24  \nA (lnarea) .10 -.02 -.26 -.06 -.04 .36 \n \nNatural factors and carbon dioxide emissions  Energy Policy \n18 \nTable 3. Regression results, restricted sample excluding outliers. \n \n \nRegression 7 8 Standardised \ncoefficients \nConstant -12.59 \n(3.77) \n-22.37 \n(8.86) \n \nY (lnGDP) 2.20 \n(10.38) \n1.39 \n(7.81) \n.87 \nY2 -.05 \n(3.55) \n-.02 \n(1.83) \n-.20 \nL (mintemp)  -.02 \n(17.38) \n-.14 \nR (renewable)  -.01 \n(20.85) \n-.01 \nF (lnfossil)  .00 \n(.31) \n.00 \nA (lnarea)  .09 \n(12.86) \n.09 \nT (time trend) -.001 \n(.91) \n.006 \n(4.92) \n.03 \nN 2459 2459  \nR2 .8350 .9021  \n \nDependent variable is E (lnCO2); OLS estimation 1960-1988 panel; absolute t-values in parentheses; \nheteroscedasticity-robust standard errors \n \n \n"}