{"doi":"10.1017\/S0013091508000618","coreId":"68077","oai":"oai:eprints.lancs.ac.uk:33519","identifiers":["oai:eprints.lancs.ac.uk:33519","10.1017\/S0013091508000618"],"title":"The group of endotrivial modules for the symmetric and alternating groups.","authors":["Carlson, Jon","Hemmer, Dave","Mazza, Nadia"],"enrichments":{"references":[{"id":854845,"title":"Endo-permutation modules over p-groups,","authors":[],"date":"1978","doi":null,"raw":"E. C. Dade, Endo-permutation modules over p-groups, I, Annals Math. 107 (1978), 459–494.","cites":null},{"id":854093,"title":"Endotrivial modules for ﬁnite groups of Lie type,","authors":[],"date":"2006","doi":null,"raw":"J. Carlson, N. Mazza and D. Nakano, Endotrivial modules for ﬁnite groups of Lie type, J. Reine Angew. Math. 595 (2006) 93–120.","cites":null},{"id":854314,"title":"Endotrivial modules for the symmetric and alternating groups,","authors":[],"date":"2009","doi":null,"raw":"J. Carlson, N. Mazza and D. Nakano, Endotrivial modules for the symmetric and alternating groups, Proc. Edinb. Math. Soc. 52 (2009), 45–66.","cites":null},{"id":856415,"title":"McKay numbers and heights of characters,","authors":[],"date":"1976","doi":null,"raw":"J. Olsson, McKay numbers and heights of characters, Math. Scand. 38(1) (1976), 25–42.","cites":null},{"id":856212,"title":"On p-Kostka numbers and Young modules,","authors":[],"date":"2005","doi":"10.1016\/j.ejc.2004.06.006","raw":"A. Henke, On p-Kostka numbers and Young modules, Eur. J. Comb. 26(6) (2005), 923–","cites":null},{"id":855909,"title":"On the p-length of p-soluble groups and reduction theorems for Burnside’s problem,","authors":[],"date":"1956","doi":"10.1112\/plms\/s3-6.1.1","raw":"P. Hall and G. Higman, On the p-length of p-soluble groups and reduction theorems for Burnside’s problem, Proc. Lond. Math. Soc. 3 6 (1956), 1–42.","cites":null},{"id":855391,"title":"Symmetric and exterior powers, linear source modules and representations of Schur superalgebras,","authors":[],"date":"2001","doi":null,"raw":"S. Donkin, Symmetric and exterior powers, linear source modules and representations of Schur superalgebras, Proc. Lond. Math. Soc. 3(3) (2001), 647–680.","cites":null},{"id":854623,"title":"The classiﬁcation of endo-trivial modules,","authors":[],"date":"2004","doi":null,"raw":"J. Carlson and J. Th´ evenaz, The classiﬁcation of endo-trivial modules, Invent. Math. 158(2) (2004), 389–411.","cites":null},{"id":853534,"title":"The Dade group of a p-group,","authors":[],"date":"2006","doi":null,"raw":"S. Bouc, The Dade group of a p-group, Invent. Math. 164 (2006), 189–231.","cites":null},{"id":853807,"title":"The integral cohomology of the symmetric group Sp2","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":16641755,"title":"The integral cohomology of the symmetric group Sp2,","authors":[],"date":"1990","doi":null,"raw":"H. C´ ardenas and E. Lluis, The integral cohomology of the symmetric group Sp2, Commun. Alg. 18 (1990), 4103–4120.Endotrivial modules for symmetric and alternating groups 95","cites":null},{"id":853257,"title":"Weights for symmetric and general linear groups,","authors":[],"date":"1990","doi":null,"raw":"J. Alperin and P. Fong, Weights for symmetric and general linear groups, J. Alg. 131(1) (1990), 2–22.","cites":null},{"id":855669,"title":"Young modules for symmetric groups,","authors":[],"date":"2001","doi":null,"raw":"K. Erdmann, Young modules for symmetric groups, J. Austral. Math. Soc. 71 (2001), 201–210.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-02","abstract":"We complete a classification of the groups of endotrivial modules for the modular group algebras of symmetric groups and alternating groups. We show that, for n ≥ p2, the torsion subgroup of the group of endotrivial modules for the symmetric groups is generated by the sign representation. The torsion subgroup is trivial for the alternating groups. The torsion-free part of the group is free abelian of rank 1 if n ≥ p2 + p and has rank 2 if p2 ≤ n < p2 + p. This completes the work begun earlier by Carlson, Mazza and Nakano","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68077.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/33519\/1\/download2.pdf","pdfHashValue":"a31e7ec010973b10cb36f4b11c7314b591a36403","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:33519<\/identifier><datestamp>\n      2018-01-24T03:01:23Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The group of endotrivial modules for the symmetric and alternating groups.<\/dc:title><dc:creator>\n        Carlson, Jon<\/dc:creator><dc:creator>\n        Hemmer, Dave<\/dc:creator><dc:creator>\n        Mazza, Nadia<\/dc:creator><dc:subject>\n        QA Mathematics<\/dc:subject><dc:description>\n        We complete a classification of the groups of endotrivial modules for the modular group algebras of symmetric groups and alternating groups. We show that, for n ≥ p2, the torsion subgroup of the group of endotrivial modules for the symmetric groups is generated by the sign representation. The torsion subgroup is trivial for the alternating groups. The torsion-free part of the group is free abelian of rank 1 if n ≥ p2 + p and has rank 2 if p2 ≤ n < p2 + p. This completes the work begun earlier by Carlson, Mazza and Nakano.<\/dc:description><dc:date>\n        2010-02<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/33519\/1\/download2.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0013091508000618<\/dc:relation><dc:identifier>\n        Carlson, Jon and Hemmer, Dave and Mazza, Nadia (2010) The group of endotrivial modules for the symmetric and alternating groups. Proceedings of the Edinburgh Mathematical Society, 53 (1). pp. 83-95. ISSN 0013-0915<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/33519\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0013091508000618","http:\/\/eprints.lancs.ac.uk\/33519\/"],"year":2010,"topics":["QA Mathematics"],"subject":["Journal Article","PeerReviewed"],"fullText":"Proceedings of the Edinburgh Mathematical Society (2010) 53, 83–95 c©\nDOI:10.1017\/S0013091508000618 Printed in the United Kingdom\nTHE GROUP OF ENDOTRIVIAL MODULES FOR\nTHE SYMMETRIC AND ALTERNATING GROUPS\nJON F. CARLSON1, DAVID J. HEMMER2 AND NADIA MAZZA3∗\n1Department of Mathematics, University of Georgia, Athens, GA 30602, USA\n2Department of Mathematics, University at Buffalo SUNY, 244 Mathematics Building,\nBuffalo, NY 14260, USA (dhemmer@math.buffalo.edu)\n3Department of Mathematical Sciences, University of Aberdeen,\nAberdeen AB24 3UE, UK\n(Received 31 May 2008)\nAbstract We complete a classification of the groups of endotrivial modules for the modular group\nalgebras of symmetric groups and alternating groups. We show that, for n \u0001 p2, the torsion subgroup of\nthe group of endotrivial modules for the symmetric groups is generated by the sign representation. The\ntorsion subgroup is trivial for the alternating groups. The torsion-free part of the group is free abelian\nof rank 1 if n \u0001 p2 + p and has rank 2 if p2 \u0002 n < p2 + p. This completes the work begun earlier by\nCarlson, Mazza and Nakano.\nKeywords: endotrivial module; endopermutation module; symmetric groups; alternating groups\n2000 Mathematics subject classification: Primary 20C20; 20C30\n1. Introduction\nEndotrivial modules were first defined for p-groups by Dade [8, 9], though they had\nappeared earlier in a celebrated paper of Hall and Higman [12]. Early work saw them\nas the building blocks for the endopermutation modules which are the sources, in the\nsense of Green’s theory of vertices and sources, of the irreducible modules of p-solvable\ngroups. These modules occur in several other situations in modular representation theory.\nFor p-groups a classification of the endotrivial modules was completed by Carlson and\nThe´venaz [7], building on the work of several others. Subsequently, the endopermutation\nmodules were classified by Bouc [3].\nIn this paper, we consider endotrivial modules for symmetric and alternating groups.\nOur motivation comes from the fact that taking the tensor product with an endotrivial\nmodule is a self-equivalence (functor) on the stable module category, that is, the local-\nized category of modules modulo projectives. Thus, the endotrivial modules define a\ndistinguished subgroup of the Picard group of all self-equivalences of the stable module\n∗ Present address: Department of Mathematics and Statistics, Lancaster University, Lancaster\nLA1 4YF, UK.\n83\n84 J. F. Carlson, D. J. Hemmer and N. Mazza\ncategory. With that in mind, Carlson et al . determined the group of endotrivial modules\nfor finite groups of Lie type [5] and made some progress on the symmetric and alternating\ngroups. Specifically, the group of endotrivial modules for all symmetric and alternating\ngroups in characteristic 2 and for all Sn and An for n < p2 in the case in which p is odd\nwas found in [6].\nOur main result is that, in almost all cases for n \u0001 p2, the group of endotrivial modules\nfor the symmetric group Sn is isomorphic to Z ⊕ Z\/2, and for the alternating group An\nis isomorphic to Z. The only exception is for p2 \u0002 n < p2 +p, where the torsion-free part\nof both groups is the sum of two copies of Z rather than only one. The class of the sign\nrepresentation generates the copy of Z\/2 in the case of the symmetric groups. The class\nof the Heller shift Ω(k) of the trivial module k is a generator for the torsion-free part of\nboth groups. In the case in which p2 \u0002 n < p2 + p, there is another generator for the\ntorsion-free part of the group of endotrivial modules which remains somewhat elusive.\nWe have some information on the structure of this generator, but it is not precise. A\ngeneral discussion is given in the last section.\n2. Notation and definitions\nLet k be a field of characteristic p which is a splitting field for the symmetric group Sn\nand all of its subgroups. When defining subgroups of the symmetric group we assume\nthe natural ordering on the letters unless otherwise indicated. For example, Sa is the\ncollection of all permutations on {1, . . . , a}.\nFor two subgroups H and K of a finite group G, we let [G\/H] denote a complete set\nof representatives for the left H-cosets in G and we let [H \\ G\/K] be a complete set of\nrepresentatives for the H–K double cosets in G. For elements g, h of a group G and for\na subgroup H of G, we write gh instead of ghg−1 and gH for gHg−1.\nWe consider finitely generated left modules over group algebras. We denote by mod(kG)\nthe category of finitely generated kG-modules and by stmod(kG) the corresponding stable\nmodule category. Given a group inclusion H ↪→ G we denote the induction and restriction\nfunctors between mod(kG) and mod(kH) by IndGH and Res\nG\nH , respectively. If M and N\nare kG-modules, we write Homk(M,N) for the kG-module of all k-linear maps from M\nto N . If N = M , we write Endk M instead of Homk(M,M) and if N = k is the trivial\nkG-module, we write M∗ = Homk(M,k) for the k-linear dual of M . Let M ⊗ N be the\ntensor product of two modules M and N over the base field k with diagonal action of\nthe group G. We write M | N to mean that the module M is isomorphic to a direct\nsummand of N .\nFor a kG-module M , let Ωn(M) be the kernel of a projective cover P → M of M\nand let Ω−1(M) be the cokernel of the injective hull M ↪→ Q. Iterating, we define\nΩn(M) = Ω(Ωn−1(M)) and Ω−n(M) = Ω−1(Ωn−1(M)). We remind the reader that kG\nis a self-injective ring, and hence injective modules are also projective.\nDefinition 2.1. A kG-module M is endotrivial provided that Endk M ∼= k ⊕ (proj)\nor, equivalently, Endk M ∼= k in stmod(kG).\nEndotrivial modules for symmetric and alternating groups 85\nRecall that Homk(M,N) ∼= M∗ ⊗N as kG-modules. Consequently, the tensor product\nof two endotrivial modules is endotrivial. This allows us to define the group of endotrivial\nmodules whose elements are equivalence classes of endotrivial modules.\nDefinition 2.2. Two endotrivial kG-modules are equivalent if they are isomorphic in\nstmod(kG). That is, [M ] = [N ] if M ⊕P ∼= N ⊕Q for projective modules P and Q. The\ngroup of endotrivial kG-modules is the set T (G) of equivalence classes [M ] of endotrivial\nkG-modules M , with the operation given by the rule [M ] + [N ] = [M ⊗ N ].\nClearly, T (G) is abelian, and we have that 0 = [k] and −[M ] = [M∗]. Furthermore,\nif p does not divide the order of G, then every module is projective. In this case, the\ndefinition of an endotrivial module does not have much meaning, as every object in the\nstable category is equivalent to the zero object, and also every module is an endotrivial\nmodule, by a strict interpretation of the definition. In that case, we set T (G) = {0}.\n3. Properties of endotrivial modules\nIn this section we recall some basic properties of the group T (G) that will be of use to\nus.\nTheorem 3.1. Let G be a finite group. The group T (G) is finitely generated. Thus,\nthe torsion subgroup TT (G) of T (G) is finite and there is a torsion-free subgroup TF (G)\nof T (G) of finite rank, such that T (G) ∼= TT (G) ⊕ TF (G).\n(a) The modules Ωn(k) are endotrivial and their classes form a cyclic direct summand\nof T (G) [6, Theorem 2.3 (a)].\n(b) Let n denote the number of conjugacy classes of maximal elementary abelian p-\nsubgroups of p-rank 2 in G [6, Theorem 2.3 (b)]. Then the rank of TF (G) is n if G\nhas p-rank at most 2 and is n + 1 if the p-rank of G is greater than 2.\n(c) Let P be a Sylow p-subgroup of G [6, Theorem 2.3 (d)].\n(i) The torsion subgroup TT (P ) is trivial except in the case in which P is cyclic,\nquaternion or semi-dihedral.\n(ii) If TT (P ) is trivial, then TT (G) is generated by the classes [M ] of indecom-\nposable endotrivial kG-modules M such that ResGP M ∼= k ⊕ (proj), for a\nprojective kP -module (proj).\nNote that, in general, a module with vertex P and trivial source is not endotrivial.\nNevertheless, for a subgroup H which contains a Sylow p-subgroup, the groups T (G) and\nT (H) are related to each other by the following.\nProposition 3.2 (Carlson et al . [5, Proposition 2.6]). Let H be a subgroup of G\nthat contains a Sylow p-subgroup P of G, and let M be an indecomposable endotrivial\nkG-module. The following hold.\n86 J. F. Carlson, D. J. Hemmer and N. Mazza\n(a) If NG(P ) \u0002 H, then the restriction map ResGH : T (G) → T (H) is injective. The\nkH-module ResGH M is endotrivial and has a unique indecomposable non-projective\ndirect summand. This summand has vertex P and is isomorphic to the kH-Green\ncorrespondent of M .\n(b) Suppose that H is a normal subgroup of G. Then ResGH M is endotrivial and\nindecomposable. Thus, if P is non-cyclic and is a normal Sylow p-subgroup\nof G, then TT (G) is isomorphic to the group of one-dimensional kG-modules,\ni.e. TT (G) ∼= G\/G′P .\nMore generally, for any indecomposable endotrivial kG-module M and for any sub-\ngroup H of G, we have that ResGH M ∼= M0 ⊕ (proj), where M0 is an indecompos-\nable endotrivial kH-module and (proj) is a projective kH-module. In particular, for any\nendotrivial kG-module M , there is a unique indecomposable endotrivial direct summand\nM0 of M such that M ∼= M0 in stmod(kG). Notice also that DimM ≡ ±1mod |P | if p\nis odd, whereas DimM ≡ ±1mod |P |\/2 if p = 2.\n4. Subgroup structure\nIn this section we collect some information concerning the p-local structure of the sym-\nmetric and alternating groups for p an odd prime. We write G for the symmetric group\nSn of degree n, for an integer n greater than or equal to p2, and we write A for the\nalternating subgroup of the same degree n as G. Hence, the Sylow p-subgroups of G are\nnot abelian and are all contained in A.\nFor H and W two finite groups, with W a transitive subgroup of some symmetric\ngroup Sn, the wreath product of H and W is the group G = H \u0006 W , isomorphic to a\nsemidirect product\n(H(1) × · · · × H(n)) \u0001 W with H(i) ∼= H for all i\nand with W acting on the set {H(i) | 1 \u0002 i \u0002 n} by permutation of the superscripts\n{1, . . . , n}. The normal subgroup H(1) × · · · × H(n) of G is called the base subgroup.\nMore generally, we define inductively iterated wreath products H \u0003i = (H \u0003(i−1)) \u0006 H, for all\ni \u0001 2, and for all transitive subgroups H of some symmetric group.\nSome detail of the structure of the Sylow p-subgroup of G and its normalizer can be\nfound in [1]. Let N be the normalizer of a Sylow p-subgroup P of G. The normalizer\nNA of P in A has index 2 in N . For i \u0001 0, write Ni = NSpi (Pi) for the normalizer of\na Sylow p-subgroup Pi ∼= Cp\u0003i in Spi . Then, Ni ∼= P \u0001 (Cp−1)i. In the general case, we\nwrite\nn =\n∑\n0\u0002i\u0002s\naip\ni with s \u0001 2 and as \u0007= 0\nfor the p-adic expansion of n. There are isomorphisms\nP ∼=\n∏\n1\u0002i\u0002s\n(P aii ) and N ∼=\n∏\n0\u0002i\u0002s\n(Ni \u0006 Sai).\nEndotrivial modules for symmetric and alternating groups 87\nFor a group H, let us denote by H ′ its derived subgroup. (We thank Jørn Olsson for\nproviding the proof of the next lemma.)\nLemma 4.1. Assume that n = pt for some integer t \u0001 1 and set N = Nt and P = Pt.\nThen, N ′ = P and NA′ = P .\nProof. Since the factor group N\/P is abelian, we have that P contains N ′.\nConversely, we need to show that N\/N ′ has order prime to p. We proceed by induction\non t for t \u0001 1. If t = 1, then N1 ∼= P1 \u0001 Cp−1 and we can easily verify that the p-cycle\ngenerating P1 is a commutator in N1. So P ⊆ N ′. Assume now that t > 1 and set\nQ = Qt for the base subgroup of Pt. That is Qt ∼= P pt−1. By [14, Lemma 4.2], we have\nthat Qt \u0003 Nt, which implies that Nt = NHt(Pt−1 \u0006 P1), where Ht is the subgroup of G\ncontaining Pt and which is isomorphic to Spt−1 \u0006 Sp. Now, by [14, Proposition 1.5], the\nfactor group Nt\/Q′t is isomorphic to NSpt−1 (Pt−1)\/P\n′\nt−1 × N1. Since Q′t \u0002 N ′t , we obtain,\nby induction, that Nt\/N ′t ∼= (Cp−1)t−1 × Cp−1.\nThe statement for the alternating group is immediate. \u0003\nWe end with an important observation that will be useful in the next section.\nProposition 4.2. Consider the above notation and assume that n = ps for s \u0001 1. Let\nH be a subgroup of G isomorphic to Sn−1. There exist elements σ1, σ2, . . . , σs ∈ H, each\nof order p − 1, such that\nN = 〈P, σ1, σ2, . . . , σs〉 ∼= Ps \u0001 (Cp−1)s.\nFurthermore, if σi,j = σiσj for all 1 \u0002 i, j \u0002 s, then NA = 〈P, σi,j , 1 \u0002 P, σi,j ; 1 \u0002 i, j \u0002\ns〉, and the in a given subgroup of A isomorphic to An−1.\nProof. We proceed by induction on s. Clearly, the statement holds in the case when\ns = 1, where σ1 is just a (p − 1)-cycle. Assume that s \u0001 1 and that the statement holds\nfor n = ps−1. By [1, (1.3)],\nNSps (Ps)\nPs\n=\nNSps−1·p(Ps−1 \u0006 P1)\nPs−1 \u0006 P1 =\nNSps−1 (Ps−1)\nPs−1\n× NSp(P1)\nP1\n.\nWith the above inductive statement we can construct specific instances of the normal-\nizer of the Sylow subgroup. That is, the normalizer of P1 is generated by the cycles\nσ1 = (1, 2, . . . , p) and µ1,1 = (σ1 \f→ σ\u00011),\nwhere \u0005 generates the group of units in Fp. For example, if p = 5, we can take \u0005 = 2 and\nhence µ1,1 = (1, 2, 4, 3), which fixes the letter 5. In general, µ1,1 can be taken to be the\n(p − 1)-cycle, (1, \u0005, \u00052, . . . , \u0005p−1), where \u0005i should be read as the residue of \u0005i modulo p,\nor as the element in Fp. The cycle fixes the letter p (which is zero in Fp).\nThen NSp2 (P2) is generated by\nσ1, σ2 =\np∏\ni=1\n(i, i + p, . . . , i + (p − 1)p), µ2,1 =\np−1∏\ni=0\nσi2µ1,1σ\n−i\n2 and µ2,2 = (σ2 \f→ σ\u00012).\n88 J. F. Carlson, D. J. Hemmer and N. Mazza\nHere σ1 and µ1,1 are the cycles given exactly as above, but they are now considered to\nbe elements of Sp2 . The elements σ1 and σ2 generate P2. The element µ2,1 is the product\nof the conjugates of µ1,1 by powers of σ2. These conjugates are disjoint cycles and hence\nµ2,1 commutes with σ2 and normalizes the normal subgroup of P2 generated by σ1 and\nits conjugates by powers of σ2. The elements σ2 and µ2,2 generate a subgroup isomorphic\nto NSp(P1).\nThe general case is similar. The group Ps is generated by σ1, . . . , σs, where σs is the\nproduct of ps−1 disjoint p-cycles:\nσs =\nps−1∏\ni=1\n(i, i + ps−1, . . . , i + (p − 1)ps−1).\nThen the normalizer NSps (Ps) is generated by Ps, by\nµs,j =\np−1∏\ni=0\nσisµs−1,jσ\n−i\ns for j = 1, . . . , s − 1 and by µs,s = (σs \f→ σ\u0001s).\nThe element µs,s is a product of ps−1 (p − 1)-cycles, conjugation by each one of which\ntakes the corresponding p-cyclic factor of σs to its \u0005th power and fixes the other factors.\nThe elements σ1, . . . , σs in the statement of the proposition can be taken to be the\nelements µs,1, . . . , µs,s in the above construction. It is a straightforward exercise to show\nthat these elements commute with one another. It is also clear that every one of these\nelements stabilizes the letter n = ps, and hence they are contained in Sps−1 as asserted.\nThe normalizer of any other Sylow p-subgroup is conjugate to this one, and hence the\nconjugate elements stabilize some letter.\nThe last statement of the proposition is straightforward from this analysis and from [1,\nEquation (2.1)]. \u0003\n5. The torsion subgroup\nLet H be a subgroup of G = Sn isomorphic to Sn−1. Let N be the normalizer of a Sylow\np-subgroup P of G. We let A, NA, HA = H ∩ A be as in the previous section.\nBy Proposition 3.2, the indecomposable torsion endotrivial kG-modules are among the\nGreen correspondents of the one-dimensional kN -modules. So suppose that χ is a one-\ndimensional kN -module which has an endotrivial kG-Green correspondent M . In this\nsection we show that χ, and thus M , is necessarily either k or ε, where ε denotes the\none-dimensional sign representation.\nThroughout this section let χ and M be as above. Assume that χA is a one-dimensional\nkNA-module with kA-Green correspondent MA which we assume to be endotrivial.\nWe recall the results from [5, Theorems A and B].\nProposition 5.1. TT (Sn) = 〈[ε]〉 and TT (An) = {[k]} for all 3p \u0002 n < p2.\nOur objective is to prove the following theorem.\nEndotrivial modules for symmetric and alternating groups 89\nTheorem 5.2. Let p \u0007= 2 and assume that n \u0001 p2. Then TT (Sn) = 〈[ε]〉 and\nTT (An) = {[k]}.\nWe proceed by an inductive argument which varies depending on the p-adic expansion\nof n. The most difficult cases are those in which the expansion has only one term. These\nsituations are treated first. The base case of the induction is given by Proposition 5.1.\nSuppose that n = ps. The next result is needed for this case.\nLemma 5.3.\n(a) There are exactly (p− 1)s one-dimensional kN -modules, corresponding to a choice\nof a (p − 1)st root of unity for each σi.\n(b) The restrictions to H ∩ N of the one-dimensional kN -modules remain pairwise\nnon-isomorphic.\n(c) There are exactly (p−1)s\/2 one-dimensional kNA-modules, all of which are pairwise\nnon-isomorphic upon restriction to HA ∩ NA.\nProof. The first statement is straightforward from Proposition 3.2 and Lemma 4.1.\nThe second claim follows from the choice of the elements σi that determine the action of\nN on any one-dimensional kN -module. Namely, by Proposition 4.2, σi ∈ H ∩N for all i.\nPart (c) follows from parts (a) and (b). \u0003\nThe case when p = 3 and n = 9 is treated separately, because Proposition 5.1 does\nnot apply and S8 has torsion endotrivial modules which are not one dimensional. In\nthis case, N has four one-dimensional modules. Explicitly, we checked using the algebra\nsoftware Magma [2] that the Green correspondents for these modules are k, ε, M and\nM ⊗ ε, where M has dimension 118, which is not congruent to ±1mod 81. Hence, M is\nnot endotrivial. A similar statement holds for MA.\nThus, we have proved the smallest case (ps = 9) of the following.\nProposition 5.4. Let s \u0001 2. If ps > 9, then assume also that TT (Sps−1) = 〈[ε]〉, and\nTT (Aps−1) = {[k]}. We have that TT (Sps) = 〈[ε]〉 and TT (Aps) = {[k]}.\nProof. Assume that ps > 9. We know that M | IndGN χ. Tensoring by ε if necessary,\nwe can assume without loss of generality that ResGH M ∼= k ⊕ (proj), and so there is\na non-trivial map in HomkH(k,ResGH M). Likewise, HomkHA(k,Res\nA\nHA MA) is non-zero.\nUsing the Mackey Formula and the Eckmann–Shapiro Lemma, we get that\n0 \u0007= HomkH(k,ResGH IndGN χ)\n∼= HomkH\n(\nk,\n⊕\nx∈[H\\G\/N ]\nIndHxN∩H Res\nxN\nxN∩H\nxχ\n)\n∼=\n∏\nx∈[H\\G\/N ]\nHomk(xN∩H)(k,Res\nxN\nxN∩H\nxχ). (5.1)\nBy Lemma 5.3 (b), the latter is non-zero only if χ = k, in which case M ∼= k. Thus,\nTT (G) = 〈[ε]〉, as desired. Similarly, HomkHA(k,ResAHA IndANA χA) is non-zero if and only\nif χA = k. \u0003\n90 J. F. Carlson, D. J. Hemmer and N. Mazza\nSuppose that n = 2ps and s \u0001 2. The normalizer of the Sylow p-subgroup P has the\nform N ∼= Ns \u0006 S2, where Ns is the normalizer of the Sylow p-subgroup of Sps . Let J be\nthe subgroup of G containing N and which is isomorphic to a wreath product Sps \u0006 S2.\nWe proceed as in [6, §§ 6 and 8]. Let S = Sps × Sps be the Young subgroup of G for the\npartition (ps, ps). Note that J = SN and S is a normal subgroup of index 2 in J . Write\nNS = N ∩ S. Likewise, let us set A = A2ps and JA = J ∩ A.\nProposition 5.5. Assume that TT (Sps) = 〈[ε]〉, TT (Aps) = {[k]}. Assume also that\nTT (S2ps−2) = 〈[ε]〉. Then we have that TT (S2ps) = 〈[ε]〉 and TT (A2ps) = {[k]}.\nProof. Let χ be a one-dimensional kN -module with an endotrivial kJ-Green corre-\nspondent L. By the Green correspondence and the Mackey Formula, we have that\nResJS L | ResJS IndJN χ ∼= IndSNS χNS\nsince J = SN , and where χNS = Res\nN\nNS χ. Therefore, Res\nJ\nS L is a direct summand of\nIndSNS χNS .\nNow, the conditions that S is normal in J and that L is an indecomposable endotrivial\nmodule imply that ResJS L is an indecomposable endotrivial module, by Proposition 3.2.\nThus, LS = ResJS L is the kS-Green correspondent of χNS . Note that the Green corre-\nspondence is well defined in this case, since NS = NS(P ).\nLet K be a subgroup of S containing NS and which is isomorphic to a direct prod-\nuct Sps × Ns, where Ns is the normalizer of the Sylow p-subgroup of Sps . By our\nassumption, LS is an indecomposable endotrivial module. So ResSK LS ∼= U ⊕ (proj) for\nsome indecomposable endotrivial kK-module U which also satisfies the condition that\nResKNS U\n∼= χS ⊕ (proj). Now, because K has a non-trivial normal p-subgroup, ResKNS U\nhas no non-zero projective summand. That is, U must be a direct summand of χS induced\nto K, and the restriction back to NS consists entirely of modules whose vertices contain\nthat normal subgroup. Therefore, ResKNS U\n∼= χS and U has dimension 1. A similar argu-\nment, using the fact that a set of coset representatives of K in S can be taken to normalize\na p-subgroup of K, shows that ResSK LS ∼= U , and so LS and L also have dimension 1.\nLikewise, the indecomposable torsion endotrivial kJA-modules have dimension 1.\nWe first handle the case of the symmetric groups. There are exactly four one-dimen-\nsional kJ-modules, which form a Klein four-group. That is, TT (J) is generated by the\nsign representation and χ = k \u0006 ε, which is the one-dimensional module on which S acts\nby the trivial representation and elements not in S act by multiplication by −1. Relative\nprojectivity shows that the kG-Green correspondent M of χ is a Young module. Namely,\nM is isomorphic to a direct summand of the permutation module IndGS k = M\n(ps,ps).\nIt is well known that the indecomposable summands of a permutation module Mλ are\nYoung modules labelled by partitions greater than or equal to λ in the dominance order.\nIn addition, the Young module Y λ occurs exactly once. Now, S is the only proper Young\nsubgroup of G of index prime to p, and therefore Y (p\ns,ps) is the only indecomposable\ndirect summand of M (p\ns,ps) with vertex P . By the Krull–Schmidt Theorem, we conclude\nthat M is isomorphic to Y (p\ns,ps).\nEndotrivial modules for symmetric and alternating groups 91\nTherefore, the question is reduced to determining whether Y (p\ns,ps) is an endotrivial\nmodule. From [13, Theorem 5.1] we prove that this is not the case. Explicitly, if L is a\nsubgroup of G isomorphic to S2ps−1, then ResGL Y\n(ps,ps) has a direct summand V of the\nform\nV =\n⊕\n0\u0002i\u0002s\nY (p\ns+pi−1,ps−pi).\nRecall that s \u0001 2 and that a Young module Y λ is projective if and only if λ is p-\nrestricted; that is, the difference of any two consecutive parts of λ is less than p (cf. [11,\nTheorem 2]). In particular, V has at least two direct summands which are not projective,\nand so ResGL Y\n(ps,ps) is not endotrivial. A fortiori, neither is Y (p\ns,ps). This shows that\nTT (G) = 〈[ε]〉 ∼= Z\/2, whenever G = S2ps , with s \u0001 2.\nWe now turn to the alternating groups. As in [6], the above argument does not apply to\nthe non-trivial one-dimensional kJA-modules. These form a Klein four-group, generated\nby the restriction of a two-dimensional kJ-module. Namely, let V be the subgroup of\nJ of index 8 that is isomorphic to a direct product Aps × Aps . Then V is normal in\nJ . Because the factor group J\/V is dihedral of order 8, there is a simple kJ-module\nU of dimension 2. The same argument in [6, § 8] says that ResJJA U splits as the direct\nsum of two one-dimensional conjugate modules χ ⊕ xχ, and that ResJS U ∼= λ ⊕ (ελ),\nwhere λ ∼= kSsp ⊗ εps affords a signed permutation module, usually denoted as M (p\ns|ps),\nand with Young vertex S, in the sense of Grabmeier (cf. [10, § 1.3]). Moreover, M (ps|ps)\ncontains the kG-Green correspondent Y of U (in fact, Y = M (p\ns|ps), as the latter is\nindecomposable). We have that ResGA Y = YA ⊕ xYA, where YA is isomorphic to the kA-\nGreen correspondent of χ. Now, if YA is endotrivial, then so is ResAB YA, for any subgroup\nB of A. Hence, take B ∼= S2ps−2 and assume that ResAB YA is endotrivial. By hypothesis,\nwe have that ResAB YA ∼= µ ⊕ (proj), where µ ∼= ε, or µ ∼= k. In particular, it follows that\n0 \u0007= HomB(µ,ResAB YA). By the Mackey Formula and the Eckmann–Shapiro Lemma and\nusing the fact that A = JAB, we obtain\n0 \u0007= HomB(µ,ResAB IndAJA χ)\n∼= HomB(µ, IndBJA∩B ResJAJA∩B χ)\n∼= HomJA∩B(k,ResJAJA∩B χ),\nsince ResBJA∩B µ = k. However, a direct computation shows that Res\nJA\nJA∩B χ is not trivial.\nSo we have a contradiction to the assumption that YA is endotrivial. \u0003\nSuppose that n = aps for 3 \u0002 a < p and s \u0001 2. Again, we assume without loss of gen-\nerality and by induction that ResGH M ∼= k ⊕ (proj) and that ResAHA MA ∼= k ⊕ (proj),\nwhere H ∼= Saps−1 as before. Moreover, ResGN M ∼= χ ⊕ (proj) and ResANA MA ∼=\nχA ⊕ (proj), by the Green correspondence. In this case, N ∼= Ns \u0006Sa, which has 2(p − 1)s\nmodules of dimension 1, as in the previous case. However, these modules are distinguished\nby their restrictions to the two subgroups Ns and Sa−1. Both of these subgroups are con-\ntained in H, and hence the restrictions of M to both of these subgroups must be a trivial\nmodule plus a projective module. We conclude that χ = k is the trivial kN -module and\nits Green correspondent M is the trivial kG-module.\n92 J. F. Carlson, D. J. Hemmer and N. Mazza\nSuppose the p-adic expansion of n has two or more terms. We write\nn = a0 + a1p + · · · + asps for s \u0001 2, as \u0007= 0 and n \u0007= asps.\nRecall that\nN ∼=\n∏\ni\u00010\n(Ni \u0006 Sai).\nWe know that the kN -Green correspondent of M has dimension 1. Without loss of\ngenerality, we assume by induction that\nResGSasps M\n∼= k ⊕ (proj) and ResAA′ MA ∼= k ⊕ (proj),\nwhere A′ = Sasps ∩ A. Now, each of the subgroups Ni \u0006 Sai for i < s is conjugate to a\nsubgroup of Sasps , and the corresponding claim holds for the corresponding subgroups\nof NA. Thus, ResGN M ∼= k ⊕ (proj) and ResANA MA ∼= k ⊕ (proj). Hence, M and MA are\nthe Green correspondents of k and are trivial modules.\nWith all of this we can complete the proof of the main theorem.\nProof of Theorem 5.2. We perform induction on s, where s is the largest degree in\nthe p-adic expansion of n, beginning with s = 2. For n = p2, we invoke Propositions 5.1\nand 5.4. We use the proof of the case in which the p-adic expansion of n has more than\none term to prove the theorem for n < 2ps. Then we apply Proposition 5.5. Now we use\nthe proof for the case in which n = aps for a \u0001 3 and the proof for the case of more than\none term in the p-adic expansion of n. Applied in the proper order, these results prove\nthe theorem for all n such that n < ps+1. We can now use Proposition 5.4 to prove the\ntheorem for n = ps+1. The latter is the induction step. \u0003\n6. Torsion-free complements\nRecall our assumption that p > 2. It is an easy calculation to see that, for n \u0001 p2+p, the\ngroups G = An and G = Sn have no maximal elementary abelian p-subgroups of p-rank 2.\nAs a consequence, by Theorem 3.1, the torsion-free part TF (G) of the group T (G) is\nisomorphic to Z and is generated by [Ω(k)]. This is the major part of our investigation\nof TF (G).\nIn the case when p2 \u0002 n < p2+p, a Sylow p-subgroup P of G has the form Cp \u0006Cp, and\nP has two conjugacy classes of maximal elementary abelian subgroups. These are the\nbase subgroup E1 ∼= Cpp , which is normal in P , and E2 = 〈x, y〉 ∼= C2p , where 〈x〉 = E1∩E2\nis the centre of P and y is a non-central p-element not in E1. We can take y to be a\ngenerator of the second Cp in the wreath product expression for P .\nWe have proved the first part of the following.\nTheorem 6.1. Let G denote either the symmetric group Sn or the alternating An.\n(i) If n \u0001 p2 + p, then TF (G) = 〈[Ω(k)]〉 ∼= Z.\n(ii) Suppose that p2 \u0002 n < p2 + p. Then TF (G) ∼= Z2. The class [Ω(k)] generates one\ndirect summand of TF (G). The other summand is generated by the class [M ] of\nEndotrivial modules for symmetric and alternating groups 93\nan indecomposable endotrivial kG-module M , having the property that\nResGE1 M\n∼= k ⊕ (proj) and ResGE2 M ∼= Ω2pr(k) ⊕ (proj)\nfor some integer r with 1 \u0002 r \u0002 p − 1.\nProof. Theorem 3.1 shows that the rank of TF (G) in case (ii) is 2, once we have\nverified that E1 and E2 are maximal elementary abelian p-subgroups of G. That is,\nthe only question is whether or not E2 is conjugate to a subgroup of E1 in Sn. This\nis not possible because of the cycle structure of the elements of E2. Specifically, every\nnon-identity element of E2 is the product of p p-cycles. On the other hand, there is\na subgroup F of index p in E1 which has no element that is a product of p p-cycles.\nExplicitly, consider H = E1 ∩ Sp2−p. Then, any subgroup of order p2 in E1 has a non-\ntrivial intersection with H and hence contains a non-identity element which does not\nhave the cycle structure of the non-identity elements of E2.\nIn case (ii) we know that the class of Ω(k) generates a summand of TF (G). The sum\nof the restriction maps\nTF (G) → TF (E1) ⊕ TF (E2) ∼= Z ⊕ Z\nis an injection. Let [M ] be the other generating class. By replacing M with a suitable\nHeller translate, we may assume that the restriction of the class of M to E1 is zero in\nTF (E1). Hence, we can assume that the restriction of M to E1 is the direct sum of k\nplus a projective module. The restriction to E2 is isomorphic to the direct sum of Ωt(k)\nplus a projective module, with t \u0007= 0. By taking a dual if necessary we can assume that\nt > 0.\nThe restriction map ResGE2 factors through the restriction map Res\nG\nP to the Sylow p-\nsubgroup P of G that contains E1 and E2. Consequently, t is bounded below by the same\nvalue that is obtained for TF (P ). This value is 2p by [7]. It also follows that t = 2pr\nis a multiple of 2p. On the other hand, t is bounded above by the minimal degree of a\ncohomology element of H∗(G, k) whose restriction to the centre Z of P is not nilpotent\n(see the proof of [5, Theorem 3.1]). Now, by the analysis of [4, Proposition 5.1], there is\nan element γ of degree 2p(p−1) in the integral cohomology whose restriction to Z is not\nzero. Because Z is cyclic and γ has even degree, this element is not nilpotent and thus γ\nrestricts to a non-zero element in the mod-p cohomology. Therefore, 2p \u0002 t \u0002 2p(p − 1)\nand t is divisible by 2p, as asserted. \u0003\nWe conclude with some partial information on the missing generator. From [5,7], we\ncan find explicit generators for T (NG(P )). In the case of the symmetric group Sn, with\np2 \u0002 n < p2 + p, this latter result can be improved in the following way. Consider P , E1\nand E2 = 〈x, y〉 as above. Set H = NG(E1). Then, H contains NG(P ) and has the form\nH ∼= (N1 \u0006 Sp) × Sa, with a = n − p2, in the notation of § 4. Notice that the inflation\nof an endotrivial module from N1 \u0006 Sp to H is endotrivial, and that any endotrivial kH\nmodule can be obtained up to equivalence in this way. Thus, our task is reduced to\n94 J. F. Carlson, D. J. Hemmer and N. Mazza\nfinding generators for T (H) in the case in which n = p2, which we assume henceforth.\nNow, [7, Theorem 3.1] gives us that\nT (P ) = 〈[Ω(k)], [M ]〉 with M = Ω−2(Ω2P\/〈y〉(k)).\nHere, Ω2P\/〈y〉(k) is the unique indecomposable direct summand of the tensor product\nΩP\/〈y〉(k) ⊗ ΩP\/〈y〉(k), where ΩP\/〈y〉(k) is the kernel of the map k[P\/〈y〉] → k which\nsends a coset u〈y〉 ∈ P\/〈y〉 to 1. We observe that ΩP\/〈y〉(k) extends to H. Indeed,\nlet C be a complement of E1 in the base subgroup of H. Thus, C ∼= Cpp−1. In fact,\nH = E1 \u0001 CSp, with 〈y〉 \u0002 H. Consider the permutation module L = k[H\/CSp]. Then\nResHP L ∼= ResHP IndHCSp k ∼=\n⊕\nx∈[P\\H\/CSp]\nIndPx(CSp)∩P k\n∼= k[P\/〈y〉]\nby the Mackey Formula and since H = PCSp. Thus, the relative syzygy ΩH\/CSp(k), that\nis, the kernel of the map L → k, restricts to P to an indecomposable module, isomorphic\nto ΩP\/〈y〉(k). Consequently, Ω2P\/〈y〉(k) extends to Ω\n2\nH\/CSp\n(k), proving simultaneously\nthat the latter is endotrivial. The same holds for the translate M = Ω−2(Ω2H\/CSp(k)).\nObviously, the restriction of M to A∩H is an indecomposable endotrivial module. This\nproves the following.\nProposition 6.2. Consider the symmetric group G = Sn and the alternating group\nA = An, with p2 \u0002 n < p2 + p. In the same notation as above, with H = NG(E1) and\nHA = NA(E1), we have that\nT (H) = TT (H) ⊕ 〈[Ω(k)], [M ]〉 and T (HA) = TT (HA) ⊕ 〈[Ω(k)], [ResHHA M ]〉,\nwhere TT (H) and TT (HA) are generated by the one-dimensional modules, and where\nthe module M satisfies\nResHE1 M\n∼= k ⊕ (proj) and ResHE2 M ∼= Ω2p(k) ⊕ (proj).\nAcknowledgements. This paper was written while all three authors were visiting\nthe Mathematical Sciences Research Institute in Berkeley in the spring of 2008. The\nauthors wish to thank the MSRI for support and for its very stimulating atmosphere.\nJ.F.C. was supported in part by NSF Grant no. DMS-0654173. D.J.H. was supported in\npart by NSF Grant no. DMS-0556260. N.M. was supported in part by Swiss National\nFoundation Research Fellowship PA002-113164\/1.\nReferences\n1. J. Alperin and P. Fong, Weights for symmetric and general linear groups, J. Alg.\n131(1) (1990), 2–22.\n2. W. Bosma and J. Cannon, Handbook on Magma functions (Sydney University Press,\n1996).\n3. S. Bouc, The Dade group of a p-group, Invent. Math. 164 (2006), 189–231.\n4. H. Ca´rdenas and E. Lluis, The integral cohomology of the symmetric group Sp2 ,\nCommun. Alg. 18 (1990), 4103–4120.\nEndotrivial modules for symmetric and alternating groups 95\n5. J. Carlson, N. Mazza and D. Nakano, Endotrivial modules for finite groups of Lie\ntype, J. Reine Angew. Math. 595 (2006) 93–120.\n6. J. Carlson, N. Mazza and D. Nakano, Endotrivial modules for the symmetric and\nalternating groups, Proc. Edinb. Math. Soc. 52 (2009), 45–66.\n7. J. Carlson and J. The´venaz, The classification of endo-trivial modules, Invent. Math.\n158(2) (2004), 389–411.\n8. E. C. Dade, Endo-permutation modules over p-groups, I, Annals Math. 107 (1978),\n459–494.\n9. E. C. Dade, Endo-permutation modules over p-groups, II, Annals Math. 108 (1978),\n317–346.\n10. S. Donkin, Symmetric and exterior powers, linear source modules and representations of\nSchur superalgebras, Proc. Lond. Math. Soc. 3(3) (2001), 647–680.\n11. K. Erdmann, Young modules for symmetric groups, J. Austral. Math. Soc. 71 (2001),\n201–210.\n12. P. Hall and G. Higman, On the p-length of p-soluble groups and reduction theorems\nfor Burnside’s problem, Proc. Lond. Math. Soc. 3 6 (1956), 1–42.\n13. A. Henke, On p-Kostka numbers and Young modules, Eur. J. Comb. 26(6) (2005), 923–\n942.\n14. J. Olsson, McKay numbers and heights of characters, Math. Scand. 38(1) (1976), 25–42.\n"}