{"doi":"10.1029\/2003JA009936","coreId":"71169","oai":"oai:eprints.lancs.ac.uk:6629","identifiers":["oai:eprints.lancs.ac.uk:6629","10.1029\/2003JA009936"],"title":"Sublimation of ice particles from rocket exhausts in the upper atmosphere","authors":["Platov, Y. V.","Kosch, Mike J."],"enrichments":{"references":[{"id":16360189,"title":"Absorption and Scattering of Light by Small Particles,","authors":[],"date":"1982","doi":"10.1002\/9783527618156","raw":"Bohren, C. F., and D. R. Huffman, Absorption and Scattering of Light by Small Particles, John Wiley, New York, 1982.","cites":null},{"id":16360201,"title":"Applied Optics of the Atmosphere,","authors":[],"date":"1997","doi":null,"raw":"Smerkalov, V. A., Applied Optics of the Atmosphere, Hidrometizdat, St. Petersburg, Russia, 1997.","cites":null},{"id":16360187,"title":"Astrophysical Quantities,","authors":[],"date":"1973","doi":"10.1063\/1.3051481","raw":"Allen, C. W., Astrophysical Quantities, Athlone Press, London, 1973. Bajbulatov, F. H., and S. P. Ivanija, Numerical researches of temperature of aerosol particles in the upper layers of the atmosphere (in Russian), Phys.","cites":null},{"id":16360205,"title":"Atmospheric optical phenomena caused by powerful rocket launches,","authors":[],"date":"2000","doi":"10.2514\/2.3639","raw":"Tagirov, V. R., V. A. Arinin, U. Bra ¨ndstro ¨m, A. Pajunpa ¨a ¨, and V. V. Klimenko, Atmospheric optical phenomena caused by powerful rocket launches, J. Spacecraft Rockets, 37(6), 812–821, 2000.","cites":null},{"id":16360190,"title":"Atmospheric Radiation,","authors":[],"date":"1964","doi":"10.1175\/1520-0469(1964)021<0575:ttorta>2.0.co;2","raw":"Goody, R. M., Atmospheric Radiation, Clarendon, Oxford, U.K., 1964.","cites":null},{"id":16360196,"title":"Dynamics of gas-dust formations in the upper atmosphere, connected with rocket exhausts,","authors":[],"date":"2001","doi":"10.2514\/1.11951","raw":"Platov, Y. V., Dynamics of gas-dust formations in the upper atmosphere, connected with rocket exhausts, in Proceedings of the 15th ESA Symposium on European Rocket and Balloon Programmes and Related Research, Biarritz, France, 28–31 May 2001, ESA SP-471, pp. 213–217, Eur. Space Agency, Paris, 2001.","cites":null},{"id":16360207,"title":"Light Scattering by Small Particles,","authors":[],"date":"1957","doi":"10.1063\/1.3060205","raw":"Van de Hulst, H. C., Light Scattering by Small Particles, John Wiley, New York, 1957.","cites":null},{"id":16360209,"title":"Optical phenomena in the near earth environment due engines of rocket and satellites. I. Groundbased and satellite supervision of artificial formations during the rocket launches (in Russian),","authors":[],"date":"1993","doi":null,"raw":"Vetchinkin, N. V., L. V. Granitskij, J. V. Platov, and A. I. Sheichet, Optical phenomena in the near earth environment due engines of rocket and satellites. I. Groundbased and satellite supervision of artificial formations during the rocket launches (in Russian), Space Res., 31(1), 93–100, 1993.","cites":null},{"id":16360211,"title":"Possible water vapor condensation in rocket exhaust plumes,","authors":[],"date":"1975","doi":"10.2514\/3.60440","raw":"Wu, J. C., Possible water vapor condensation in rocket exhaust plumes, AIAA J., 13(6), 797–802, 1975. M. J. Kosch, Department of Communication Systems, Lancaster University, Lancaster LA1 4YR, UK. (m.kosch@lancaster.ac.uk) Y. V. Platov, Institute of Terrestrial Magnetism, Ionosphere and Radiowaves Propagation, Russian Academy of Sciences, Moscow 142190, Russia. (yplatov@izmiran.troitsk.ru) PLATOV AND KOSCH: SUBLIMATION OF ICE PARTICLES IN THE UPPER ATMOSPHERE SIA 8 - 5","cites":null},{"id":16360198,"title":"Rocket Exhaust Plume Phenomenology,","authors":[],"date":"2000","doi":null,"raw":"Simmons, F. S., Rocket Exhaust Plume Phenomenology, Aerospace Press, El Segundo, Calif., 2000.","cites":null},{"id":16360193,"title":"Solar scattering from condensation in Apollo translunar injection plume,","authors":[],"date":"1975","doi":"10.2514\/3.49725","raw":"Kung, R. T. V., L. Cianciolo, and J. A. Myer, Solar scattering from condensation in Apollo translunar injection plume, AIAA J., 13(4), 432–437, 1975.","cites":null},{"id":16360203,"title":"Structure of water and carbon dioxide formed via homogeneous nucleation in nozzle beams,","authors":[],"date":"1973","doi":"10.1063\/1.1679463","raw":"Stein, G. D., and J. A. Armstrong, Structure of water and carbon dioxide formed via homogeneous nucleation in nozzle beams, J. Chem. Phys., 58(5), 1999–2003, 1973.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-12","abstract":"The process of sublimation of ice particles from a rocket exhaust in the upper atmosphere is examined. Heating by solar radiation and losses of energy by means thermal radiation and sublimation are taken into account in the thermal balance of the ice particles. The time dependences of size and temperature of the ice particles are obtained. An estimation of water vapor concentration around the rocket trajectory is made. The process of sublimation of the rocket exhaust ice particles may be important for the interpretation of optical phenomena in the upper atmosphere connected with rocket launches and for propagation of disturbances at a large distance from the rocket","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71169.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/6629\/1\/art_569.pdf","pdfHashValue":"eb3a1d2cd458f113cbc049b5891f5ee47f2528df","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:6629<\/identifier><datestamp>\n      2018-01-24T03:15:00Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5431<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Sublimation of ice particles from rocket exhausts in the upper atmosphere<\/dc:title><dc:creator>\n        Platov, Y. V.<\/dc:creator><dc:creator>\n        Kosch, Mike J.<\/dc:creator><dc:subject>\n        T Technology (General)<\/dc:subject><dc:description>\n        The process of sublimation of ice particles from a rocket exhaust in the upper atmosphere is examined. Heating by solar radiation and losses of energy by means thermal radiation and sublimation are taken into account in the thermal balance of the ice particles. The time dependences of size and temperature of the ice particles are obtained. An estimation of water vapor concentration around the rocket trajectory is made. The process of sublimation of the rocket exhaust ice particles may be important for the interpretation of optical phenomena in the upper atmosphere connected with rocket launches and for propagation of disturbances at a large distance from the rocket.<\/dc:description><dc:date>\n        2003-12<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/6629\/1\/art_569.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2003JA009936<\/dc:relation><dc:identifier>\n        Platov, Y. V. and Kosch, Mike J. (2003) Sublimation of ice particles from rocket exhausts in the upper atmosphere. Journal of Geophysical Research, 108 (A12). 8\/1-8\/5. ISSN 0148-0227<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/6629\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/2003JA009936","http:\/\/eprints.lancs.ac.uk\/6629\/"],"year":2003,"topics":["T Technology (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Sublimation of ice particles from rocket exhausts in the upper\natmosphere\nY. V. Platov\nInstitute of Terrestrial Magnetism, Ionosphere and Radiowaves Propagation, Russian Academy of Science,\nMoscow, Russia\nM. J. Kosch\nDepartment of Communication Systems, Lancaster University, Lancaster, UK\nReceived 14 March 2003; revised 24 September 2003; accepted 2 October 2003; published 12 December 2003.\n[1] The process of sublimation of ice particles from a rocket exhaust in the upper\natmosphere is examined. Heating by solar radiation and losses of energy by means thermal\nradiation and sublimation are taken into account in the thermal balance of the ice particles.\nThe time dependences of size and temperature of the ice particles are obtained. An\nestimation of water vapor concentration around the rocket trajectory is made. The process\nof sublimation of the rocket exhaust ice particles may be important for the interpretation of\noptical phenomena in the upper atmosphere connected with rocket launches and for\npropagation of disturbances at a large distance from the rocket. INDEX TERMS: 7853 Space\nPlasma Physics: Spacecraft\/atmosphere interactions; 7803 Space Plasma Physics: Active perturbation\nexperiments; 2403 Ionosphere: Active experiments; 2435 Ionosphere: Ionospheric disturbances; KEYWORDS:\nupper atmosphere, rocket exhausts, ice particles, sublimation\nCitation: Platov, Y. V., and M. J. Kosch, Sublimation of ice particles from rocket exhausts in the upper atmosphere, J. Geophys. Res.,\n108(A12), 1434, doi:10.1029\/2003JA009936, 2003.\n1. Introduction\n[2] Optical phenomena in the upper atmosphere resulting\nfrom rocket engine operation are caused by the scattering of\nsunlight on dispersed components of the combustion prod-\nucts. Combustion products of solid fuel rocket engines\nalways contain cindery particles, whose composition (soot,\nAl, Al2O3) is determined by the components of the solid\nfuel. However, such phenomena are observed during oper-\nation of liquid fuel rocket engines including simple hydro-\ngen-oxygen fuel. The only mechanism of dispersed particle\nformation in the jets of these motors is a process of water\nvapor condensation [Wu, 1975] due to rapid expansion of\nthe combustion products.\n[3] The dynamics of a gas-dust cloud formed by a rocket\nengine exhaust in the upper atmosphere and features of the\nassociated optical phenomena is determined by the size\ndistribution of the dispersed particles, their lifetime and\ninitial velocities. The sizes of particles, in turn, depend on\nthe process of heat exchange and their evaporation.\n[4] The question of thermal balance and evolution of the\nice particles in the upper layers of the atmosphere has been\nexamined in a number of articles [e.g., Bronshten and\nGrishin, 1970; Kung et al., 1975; Bajbulatov and Ivanija,\n1976]. Bronshten and Grishin [1970] considered the ques-\ntion of thermal balance with reference to noctilucent clouds.\nBajbulatov and Ivanija [1976] examined this problem in\nmore detail for different solid particles (Cu, Fe, C, ice, SiO2,\nMgO) at heights of 60–160 km; however, they did not take\ninto account the loss of energy and change of particle size as\na result of sublimation.\n[5] Kung et al. [1975] were probably the first to offer a\nmechanism of sunlight scattering from the condensed phase\nof combustion products as an explanation of the optical\nphenomena observed during rocket engine operation\n(Saturn IV launcher in the Apollo 8 program). In particular,\nthey considered the process of sublimation of ice particles\nunder conditions prevailing in the upper atmosphere and\nestimated their lifetime. In the equation for thermal balance,\nthe authors took into account heating of particles by IR\nradiation from the Earth in two windows of atmospheric\ntransparency (\u00013.08 and \u00016.1 mm) only and losses of\nenergy from sublimation. These assumptions are valid for\nnighttime conditions; however, as the scattering of sunlight\ncauses the observed optical phenomena, it is necessary to\ntake into account heating of the particles due to absorption\nof sunlight and radiation from the Earth-atmosphere system.\nIn addition, it is necessary to take into account energy losses\ndue to thermal radiation of the particles.\n[6] The process of ice particle sublimation during their\nfast dispersion is important for explaining the propagation\nof a disturbance in the upper atmosphere at large distances\nfrom the rocket trajectory with speeds much greater than\ndiffusion.\n[7] In this work the thermal balance of ice particles in the\nupper atmosphere is examined in view of heating by\nsunlight, radiation from the Earth-atmosphere system and\nenergy losses from thermal radiation and sublimation. The\ninclusion of these processes allows computation of the time\ndependence of size and temperature of the ice particles and\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 108, NO. A12, 1434, doi:10.1029\/2003JA009936, 2003\nCopyright 2003 by the American Geophysical Union.\n0148-0227\/03\/2003JA009936$09.00\nSIA 8 - 1\nto estimate the concentration of water vapor around rocket\nat distances up to \u0001200–300 km.\n2. Calculations\n[8] The evolution of ice particles is described by the\nthermal and mass balance equations of a particle. The\nequation of thermal balance of an ice particle may be\nexpressed as:\n4=3 p r3 r qT dT ¼¼ p r2\nZl2\nl1\nc r;lð Þ\n8<\n: Fs lð Þ þ FE-A lð Þ½\nþ FE-T lð Þ\u0007dl \b 4 p r2 s T4\nZl2\nl1\nc r;lð Þ\n\t Pl l;Tð Þdl\b QSUB\n)\ndt; ð1Þ\nwhere\nr(t) is the particle radius;\nr is particle density;\nT(t) is particle temperature;\nc(r, l) is the absorption factor\nof ice;\nFs(l) is the energy flux of\nsunlight outside the ter-\nrestrial atmosphere;\nFE-A(l) is the energy flux from\nthe Earth-atmosphere\nsystem;\nFE-T(l) is terrestrial thermal\nradiation;\nB(r, T) =\nRl2\nl1\nc (r, l) Pl (l, T) dl is the radiating capacity\nof ice;\nPl (l, T) the spectral dependence\nof thermal radiation, i.e.\nthe Planck function;\ns = 5.67 10\b8 W m\b2 K\b4 is Stefan-Boltzmann’s\nconstant;\nQSUB is the energy loss asso-\nciated with sublimation\ndescribed as QSUB == 4\np r2 (P1 (T) \b P) m qS\/\n(2p m k T)1\/2 in accor-\ndance with Landau and\nLifshits [1982];\nm = 3 \u000b 10\b26 kg is the molecular mass of\nwater;\nk = 1.38 \u000b 10\b23 J K\b1 is Boltzmann’s constant;\nqT = 2.09 \u000b 103 J kg\b1 is the specific thermal\ncapacity of ice;\nqS = 2.59 \u000b 106 J kg\b1 is the latent heat of ice\nsublimation;\nP1(T) is the saturated water\nvapour pressure and P\nis the water vapour pres-\nsure around a particle.\n[9] The absorption factor c(r, l) is given by Van de Hulst\n[1957] as c (r, l) = Re {i 8p r (m2 \b 1)\/l (m2 + 2)}, where\nm = n \b ik is a complex parameter of the refraction of ice.\nThe dependence of n and k on l, calculated from the data of\nBohren and Huffman [1982], is shown in Figure 1. Here\nl1 = 0.1 mm and l2 = 10 mm are the limits of integration\ndetermined by the wavelengths for which c(r, l) is known.\nAbsorption is negligible outside the range l1 to l2.\n[10] The equation of a mass balance is\n4p r2 r dr ¼¼ \b4p r2 P1 Tð Þpm=2 p k Tf gdt: ð2Þ\nThe following data were used in the solution of the above\nequations. For heating by sunlight, the dependence of solar\nradiation flux on the Earth atmosphere boundary Fs(l) was\ninterpolated according to Allen [1973]. For heating by\nradiation of the Earth-atmosphere system, radiating models\nof the atmosphere and the Earth-atmosphere system\nconstructed for various fixed values of albedo give different\nestimates of brightness of the Earth-atmosphere system,\nwhich diverge by more than an order of magnitude. The\ndata received from satellite measurements also strongly\ndepend on many parameters (radiation, climate, synoptic,\netc.). Nevertheless, it is possible to take advantage of typical\nvalues of radiation intensity to account for the Earth-\natmosphere’s contribution to the process of sublimation.\nThe spectral brightness data of the Earth-atmosphere system\n[Smerkalov, 1997] within the 0.4–0.8 mm wavelength range\ncan be represented with sufficient accuracy by \u0001(l) = A(z)\n(l0\/l)\n3.1, where A(z) is the peak value of spectral brightness\nas a function of solar zenith angle and l0 = 0.4 mm. It is\npossible to neglect radiative heating of the Earth-atmosphere\nsystem with wavelengths less than l0 because the transpar-\nency of the atmosphere and absorption by water at short\nwavelengths is small.\n[11] The flow of the energy absorbed by ice particles may\nbe expressed as\ndQE-A ¼ dt\nZl2\nl1\n\u0001* lð Þ\u0002 c r;lð Þdl;\nwhere \u0002 is the solid angle of the sunlit part of the Earth’s\nsurface and \u0001*(l) is the average value of spectral brightness.\nFigure 1. The dependence of the imaginary and real part\nof the refraction factor of water with wavelength calculated\nfrom the data of Bohren and Huffman [1982].\nSIA 8 - 2 PLATOV AND KOSCH: SUBLIMATION OF ICE PARTICLES IN THE UPPER ATMOSPHERE\n[12] As the phenomena associated with scattering of\nsunlight from the combustion products of rocket engines\nare observed in twilight conditions for solar zenith angles\n>85\u0007, the average peak values of spectral brightness will be\n3–7 W m\b2 sr\b1, depending on the type of scattering\nsurface, in agreement with Smerkalov [1997]. In this case,\nthe solid angle in which the diffused light occurs does not\nexceed 0.8p for heights >150 km. Under these conditions,\nthe quantity of energy absorbed by ice particles due to\nradiation of the Earth-atmosphere system does not exceed\n0.5% of the energy due to absorption of sunlight. Thus\nexcluding any special cases, heating by radiation of the\nEarth-atmosphere system can be neglected.\n[13] We now consider heating by thermal radiation of the\nEarth. Thermal radiation of the Earth in the IR range is\npractically completely absorbed in the atmosphere except\nfor several transparent windows. The basic pass band of the\natmosphere occurs in the wavelength range 8–13 mm. If the\nthermal radiation spectrum of the Earth can be presented as\na black body with a temperature \u000f300\u0007K, it becomes easy\nto estimate the quantity of energy from this source, which is\nabsorbed by the ice particles:\ndQET ¼ dt p r2\nZl2\nl1\nc r;lð ÞPl l; 300ð Þdl \u000f 0:3 dQS\n¼ 0:3 dt p r2\nZl2\nl1\nc r;lð ÞFS lð Þdl\n[14] To account for the loss of energy by emission from\nthe ice particles as a function of temperature, the interpolated\nvalues\nRl2\nl1\nc(r, l) P(l, T) dl, calculated for the range 130–\n270\u0007K were used.\n[15] To account for loss of energy by sublimation, equa-\ntion (2) is inspected. (P(T) \b P)\/(2p m k T)1\/2 is the number\nof molecules sublimating in unit time from a unit surface of\na particle. For the conditions prevailing in the upper\natmosphere, evaporation occurs in a vacuum and P = 0.\n[16] The temperature dependence of water vapor pressure\nin the range 0 to \b100\u0007C may be expressed in accordance\nwith data from Goody [1964] as:\nP1 Tð Þ ¼¼ P T0ð Þ T=T0ð Þ28:5;\nwhere T0 = 273 K and P(T0) = P0 = 610 Pa.\n[17] Using dimensionless variables x = T\/T0, h = r\/r0 and\nt = t\/t0, we get:\ndx=dt ¼¼ a\b b B xð Þx4 \b g P0 x28=h ð3Þ\ndh=dt ¼¼ \bd x28 ð4Þ\nThe numerical factors used in expression are shown in\nTable 1. Wu [1975] estimated the size of average mass ice\nparticles condensed in a rocket engine exhaust to be about\n20 A˚. Stein and Armstrong [1973] made an estimate of 55 A˚.\nHowever, estimates of the possible size of the condensed\nparticles ranges up to several microns [Simmons, 2000]. As\nno measurement data of the size distribution of the\ncondensed particles is available, it is necessary to consider\na wide range of initial sizes of the ice particles, at least from\n0.05 up to 1 mm.\n[18] The solution of equations (3) and (4) are given in\nFigures 2 and 3, respectively. We have assumed the initial\ncondition that the expansion of the combustion products\nresult in condensing water vapor forming ice particles with\na temperature of 273\u0007K. From the solution of the equations\nit follows that this assumption does not substantially influ-\nence the results. This is because the strong dependence of\nTable 1. Numerical Factors Used in Expressions\nConstant Expression Value\na \u0001(3\/4 r0 r qT)\nRl2\nl1\nc (r, l) [Fs (l) + FE-A (l) + FE-T (l)] dl 0.175\nb 3 s T0\n3\/r0 r qT 1.65\ng 3 qS P0 (m\/2p k To\n3\/2)1\/2\/r0 r qT \u000f9.36 103\nd P0 (m\/2p k To)\n1\/2\/r0 r 6.9 10\n2\nr0 Scale of particle radius 10\n\b6 m\nFigure 2. The time change of ice particle size for various\ninitial sizes during the process of sublimation.\nPLATOV AND KOSCH: SUBLIMATION OF ICE PARTICLES IN THE UPPER ATMOSPHERE SIA 8 - 3\nthe energy losses due to sublimation on T. The temperature\nof the ice particles very quickly (\u00010.2 s) reach a quasi-\nstationary value of \u00010.7 To. The subsequent change in\ntemperature of a particle occurs smoothly in the range\n0.7–0.55 To. The change in size of the particles has a\ngreater dependence on the initial size.\n3. Discussion of Results\n[19] The characteristic time of size reduction of the\nparticles to one-third of the original size, corresponding to\nan intensity decreasing of Rayleigh scattered light of \u0001103,\nis from \u0001120 s for rather small particles (r = \u00010.005 mm) up\nto >200 s for particles with a characteristic size of about\n1 mm. As the dynamic range of optical recording systems\nusually does not exceed 3–4 orders of magnitude, the\ncharacteristic sizes of observable rocket exhaust formations\nin the upper atmosphere are limited to about 300–600 km,\ndepending on the size of the particles. This result is\nsubstantiated by several observations [e.g., Vetchinkin et\nal., 1993; Simmons, 2000; Platov, 2001]. Cases of gas-dust\nformations with much greater sizes [Tagirov et al., 2000;\nPlatov, 2001] are associated with special modes of operation\nof solid fuel rocket engines (engine switch-off) and by\npresence of nonevaporating particles (soot, Al, Al2O3) in\nthe combustion products.\n[20] As the expansion velocity of the ice particles in the\nupper atmosphere is much greater than the diffusion speed,\na fast transfer of substances actively participating in\nion-molecular reactions in the ionosphere, connected in\nparticular with formation of large-scale ionosphere holes,\noccurs. We now estimate the distribution of water vapor\nconcentration in the atmospheric region around a rocket.\nAssume M0 is the mass of ice particles with the charac-\nteristic size r0 injected into the atmosphere in unit time by\na rocket engine. The number of molecules evaporated\nduring time interval dt is\ndN ¼ M0 dt= 4=3 p r30 r\n\u0007 \b\t \n\n4p r tð Þ2 P1 Tð Þpm=2 p k Tf gdt:\nIf we accept that the axial velocity of combustion products\nin the atmosphere is V0, which is the rocket velocity, and\nthe radial velocity is U0, it is easy to determine that the\nevaporated mass of water vapor will occupy a volume dW =\np U0 t U0 dt V0 dt. Thus the concentration of water\nmolecules is\nn tð Þ ¼ dN=dW\n¼ M0= 4=3 p r0 rð Þ½ \u00074p h tð Þ2P0 x28pm=2 p k T0\nn o\n=pU0 V0 R tð Þ;\nwhere R(t) = U0t is the distance from the rocket trajectory.\nThe solution of this equation for characteristic values of\nparticle sizes r0 = 1 and r0 = 0.1 mm and M0 = 100 kg s\n\b1,\nV0 = 3000 m s\n\b1 and U0 = 1000 m s\n\b1 is given in Figure 4\nas a dependence upon R(t). As the electron concentration in\nthe ionospheric F layer is 1012 m\b3, it becomes obvious that\nfor radial distances up to 200 km from the rocket trajectory\nthe water molecules concentration as a result of sublimation\nof large enough ice particles (r = \u00010.5 mm) is sufficient to\nperturbate the ionospheric electron density.\n[21] We now examine the validity of the assumptions and\napproximations made earlier. It was assumed that sublima-\ntion in the upper atmosphere occurs practically in vacuum.\nThe water vapor pressure at \u0001160 K amounts to \u00011.5 \u000b\n10\b4 Pa. In the upper atmosphere at heights greater than\n250 km the gas pressure is less than this value [Allen, 1974].\nWater vapor pressure can be neglected above 120 km; hence\nthe assumption made above is good.\n[22] It is implicitly assumed that the ice particles formed\nby the condensation of combustion products have a spher-\nical form. However, this is most unlikely as homogeneous\ncondensation would form crystals of hexagonal or cubic\nshape. However, as the size of the particles considered here\nare small in comparison with the wavelength of the\nabsorbed radiation, our assumption is justified [Van de\nHulst, 1957].\n[23] The extrapolation of water vapor pressure data at\ntemperatures is below 170 K introduces some uncertainty in\nthe calculations. However, this extrapolation is acceptable\nprovided the quasi-static temperature of the particles, deter-\nmined by the balance between heating by sunlight and\nthermal radiation energy losses, does not deviate too much\nfrom this value (T = \u0001150 K).\nFigure 3. The time change in temperature of ice particles\nfor its initial sizes of 0.5, 0.05, and 0.005 m.\nFigure 4. Water molecules concentration as a function of\ndistance from the flight trajectory of a rocket for initial\nparticle radii of 0.5 and 0.1 mm.\nSIA 8 - 4 PLATOV AND KOSCH: SUBLIMATION OF ICE PARTICLES IN THE UPPER ATMOSPHERE\n[24] The greatest uncertainty is associated with the lack of\ndata for ice particle sizes condensed from the rocket exhaust\nat different heights and different modes of engine operation.\nPrevious theoretical work devoted to this problem is sparse.\nExperimental observations of the scattered light, in partic-\nular the spectral characteristics of the diffuse light, are\nneeded for the special conditions of rocket launches.\n4. Conclusion\n[25] The time of sublimation of ice particles condensed in\nrocket exhaust is enough for formation of a large-scale gas-\ndust cloud in the upper atmosphere that may be seen as a\nresult of scattering of sunlight in twilight conditions. During\nexpansion of this cloud water vapor is transported some\nhundreds of kilometers from the area of the rocket flight at\nspeeds of \u00012 km s\b1, which considerably exceeds the\ndiffusion speeds of gas components from the combustion\nproducts. The subsequent interaction of water vapor with\natmospheric components results in rapid development of\nlarge-scale disturbances in the ionosphere (formation of\nionospheric holes).\n[26] Acknowledgments. This work is supported by the International\nScientific and Technology Center under Project 1328.\n[27] Shadia Rifai Habbal thanks Ching-I. Meing and another reference\nfor their assistance in evaluating this paper.\nReferences\nAllen, C. W., Astrophysical Quantities, Athlone Press, London, 1973.\nBajbulatov, F. H., and S. P. Ivanija, Numerical researches of temperature of\naerosol particles in the upper layers of the atmosphere (in Russian), Phys.\nAtmos. Ocean, 12(5), 523–530, 1976.\nBohren, C. F., and D. R. Huffman, Absorption and Scattering of Light by\nSmall Particles, John Wiley, New York, 1982.\nBronshten, V. A., and N. I. Grishin, Noctilucent Clouds, Science, Enfield,\nN. H., 1970.\nGoody, R. M., Atmospheric Radiation, Clarendon, Oxford, U.K., 1964.\nKung, R. T. V., L. Cianciolo, and J. A. Myer, Solar scattering from con-\ndensation in Apollo translunar injection plume, AIAA J., 13(4), 432–437,\n1975.\nLandau, L. D., and E. M. Lifshits, Statistical Physics, Science, Enfield,\nN. H., 1982.\nPlatov, Y. V., Dynamics of gas-dust formations in the upper atmosphere,\nconnected with rocket exhausts, in Proceedings of the 15th ESA Sympo-\nsium on European Rocket and Balloon Programmes and Related Re-\nsearch, Biarritz, France, 28–31 May 2001, ESA SP-471, pp. 213–217,\nEur. Space Agency, Paris, 2001.\nSimmons, F. S., Rocket Exhaust Plume Phenomenology, Aerospace Press,\nEl Segundo, Calif., 2000.\nSmerkalov, V. A., Applied Optics of the Atmosphere, Hidrometizdat, St.\nPetersburg, Russia, 1997.\nStein, G. D., and J. A. Armstrong, Structure of water and carbon dioxide\nformed via homogeneous nucleation in nozzle beams, J. Chem. Phys.,\n58(5), 1999–2003, 1973.\nTagirov, V. R., V. A. Arinin, U. Bra¨ndstro¨m, A. Pajunpa¨a¨, and V. V.\nKlimenko, Atmospheric optical phenomena caused by powerful rocket\nlaunches, J. Spacecraft Rockets, 37(6), 812–821, 2000.\nVan de Hulst, H. C., Light Scattering by Small Particles, John Wiley, New\nYork, 1957.\nVetchinkin, N. V., L. V. Granitskij, J. V. Platov, and A. I. Sheichet, Optical\nphenomena in the near earth environment due engines of rocket and\nsatellites. I. Groundbased and satellite supervision of artificial formations\nduring the rocket launches (in Russian), Space Res., 31(1), 93–100, 1993.\nWu, J. C., Possible water vapor condensation in rocket exhaust plumes,\nAIAA J., 13(6), 797–802, 1975.\n\b\b\b\b\b\b\b\b\b\b\b\b\b\b\b\b\b\b\b\b\b\b\nM. J. Kosch, Department of Communication Systems, Lancaster\nUniversity, Lancaster LA1 4YR, UK. (m.kosch@lancaster.ac.uk)\nY. V. Platov, Institute of Terrestrial Magnetism, Ionosphere and\nRadiowaves Propagation, Russian Academy of Sciences, Moscow\n142190, Russia. (yplatov@izmiran.troitsk.ru)\nPLATOV AND KOSCH: SUBLIMATION OF ICE PARTICLES IN THE UPPER ATMOSPHERE SIA 8 - 5\n"}