{"doi":"10.1111\/1475-4754.00048","coreId":"65456","oai":"oai:dro.dur.ac.uk.OAI2:5785","identifiers":["oai:dro.dur.ac.uk.OAI2:5785","10.1111\/1475-4754.00048"],"title":"Bayesian approach to sapwood estimates and felling dates in dendrochronology.","authors":["Millard,  A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-02-01","abstract":"An improved method of generating sapwood estimates for oak is developed. This suggests a revision of the 95% confidence range from 10–40 to 9–36 rings for trees from southern England. Current methods for estimating felling dates on timbers with incomplete sapwood do not generate true 95% confidence limits, and a Bayesian method for deriving such limits is presented. For timbers with no sapwood, the addition of 12 years to the date of the final ring is shown to give a 95% confidence limit on the terminus post quem for felling. The further application of these methods is illustrated by calculation of the common felling date for timbers from the Great Kitchen at Windsor Castle","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65456.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5785\/1\/5785.pdf","pdfHashValue":"5d2fbaa2e28ea06b9ad8c3a137752e23092d3962","publisher":"Blackwell","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5785<\/identifier><datestamp>\n      2011-11-15T09:29:08Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Bayesian approach to sapwood estimates and felling dates in dendrochronology.<\/dc:title><dc:creator>\n        Millard,  A.<\/dc:creator><dc:description>\n        An improved method of generating sapwood estimates for oak is developed. This suggests a revision of the 95% confidence range from 10–40 to 9–36 rings for trees from southern England. Current methods for estimating felling dates on timbers with incomplete sapwood do not generate true 95% confidence limits, and a Bayesian method for deriving such limits is presented. For timbers with no sapwood, the addition of 12 years to the date of the final ring is shown to give a 95% confidence limit on the terminus post quem for felling. The further application of these methods is illustrated by calculation of the common felling date for timbers from the Great Kitchen at Windsor Castle.<\/dc:description><dc:subject>\n        Dendrochronology<\/dc:subject><dc:subject>\n         Bayesian statistics<\/dc:subject><dc:subject>\n         Sapwood estimates<\/dc:subject><dc:subject>\n         Felling dates.<\/dc:subject><dc:publisher>\n        Blackwell<\/dc:publisher><dc:source>\n        Archaeometry, 2002, Vol.44(1), pp.137-143 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2002-02-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5785<\/dc:identifier><dc:identifier>\n        issn:0003-813X<\/dc:identifier><dc:identifier>\n        issn: 1475-4754<\/dc:identifier><dc:identifier>\n        doi:10.1111\/1475-4754.00048 <\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5785\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1111\/1475-4754.00048<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5785\/1\/5785.pdf<\/dc:identifier><dc:rights>\n        The definitive version is available at www.blackwell-synergy.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1475-4754","issn: 1475-4754","0003-813x","issn:0003-813X"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2002,"topics":["Dendrochronology","Bayesian statistics","Sapwood estimates","Felling dates."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n14 December 2009\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nMillard, A. (2002) ’Bayesian approach to sapwood estimates and felling dates in dendrochronology.’,\nArchaeometry., 44 (1). pp. 137-143.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1111\/1475-4754.00048\nPublisher’s copyright statement:\nThe definitive version is available at www.blackwell-synergy.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n14 December 2009 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nAccepted for publication version \n \nCitation for published item: \nMillard, A. (2002) 'Bayesian approach to sapwood estimates and felling dates in \ndendrochronology.', Archaeometry., 44 (1). pp. 137-143. \n \nFurther information on publishers website: \nhttp:\/\/dx.doi.org\/10.1111\/1475-4754.00048 \n \nPublisher’s statement: \nThe definitive version is available at www.blackwell-synergy.com. \n \n \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nA Bayesian approach to sapwood estimates and felling dates in \ndendrochronology \nAndrew Millard \nDepartment of Archaeology, University of Durham, South Road, Durham.  DH1 3LE.  UK \nAbstract \nAn improved method of generating sapwood estimates for oak is developed.  This suggests a \nrevision of the 95% confidence range from 10-40 to 9-36 rings for trees from Southern \nEngland.  Current methods for estimating felling dates on timbers with incomplete sapwood \ndo not generate true 95% confidence limits, and a Bayesian method for deriving such limits is \npresented.  For timbers with no sapwood the addition of 12 years to the date of the final ring \nis shown to give a 95% confidence limit on the terminus post quem for felling.  The further \napplication of these methods is illustrated by calculation of the common felling date for \ntimbers from the Great Kitchen at Windsor Castle. \nIntroduction \nIn dendrochronology dates are produced by matching ring-width sequences of timbers to \nmaster chronologies to give the year of growth of each ring.  The method has the potential to \ngive extremely precise dates for archaeological events, if suitable timbers are available with \nthe bark on them.  Frequently, however, the bark is not present and a felling date has to be \nestimated as a 95% confidence interval using the date of the heartwood-sapwood boundary \nand an estimate for the number of sapwood rings in a tree. (Baillie 1982; Hillam 1998). \nVarious sapwood estimates have been suggested on the basis of studies of modern trees \n(Hughes et al. 1981), and archaeological samples with complete sapwood (Hillam et al. 1987; \nMiles 1997; Hillam 1998, 11).  The distribution of number of sapwood rings in these samples \nof trees has been found to conform to a log-normal distribution (Hillam et al. 1987), and a \n95% confidence interval on the log values is used to give the sapwood estimate.  Hence the \nstandard procedure is that if the date of the heartwood-sapwood boundary on a timber can be \nestablished but little or no sapwood survives, then the felling date is estimated as 10-55 years \nlater (using the Sheffield sapwood estimate of Hillam et al. (1987), though others are used \nelsewhere - see the review of Miles (1997)).  If a number of sapwood rings survive, e.g. 25, \nthe felling date is estimated a between then and the end of the standard sapwood estimate, in \nthis case 25-55 years after the heartwood-sapwood boundary (Laxton and Litton 1988, 53-54; \nHillam 1998, 27).  If the heartwood-sapwood boundary is missing then the lower limit of the \nsapwood estimate is added to the last ring to give a terminus post quem for felling. \nThis paper seeks to view these estimates from a Bayesian perspective (Buck et al. 1996), \nrevising the normal sapwood estimate, suggesting how the extra available data of the \nobserved number of sapwood rings should be incorporated into the date and suggesting a \nrevised method for calculating a terminus post quem for felling.  By generating probability \ndensity functions for dates they can be incorporated into Bayesian analyses, and this is \nillustrated by the development of a more rigorous analysis of the felling date of a group of \ntimbers which are assumed to have been felled contemporaneously. \nSimple sapwood estimates \nSapwood estimates are usually derived by the method of Hughes et al. (1981) which \ncalculates a 95% confidence interval on the normally-distributed log-transformed sapwood \nring count data for a group of trees and then converts this back into a confidence interval \nexpressed in numbers of rings, which are finally rounded to the nearest integer to give the \nworking values.  If the number of sapwood rings was a continuous variable this would be \nsatisfactory, but in fact it is a discrete variable.  Having made a log-normal approximation to \nthe distribution, the best estimate of the probability of having n rings is the integral of the log-\nnormal distribution from n-½ to n+½ and these values for discrete numbers of rings should be \nused in subsequent evaluation of confidence intervals. \nFor the purposes of illustrating the method the data of Miles (1997) for the numbers of \nsapwood rings in 406 medieval and post-medieval oak timbers from Southern England is used \nhere.  Thus the results only apply when this collection is the appropriate comparator for the \nparticular timber(s) under consideration.  However the method can be transferred to other \ndatasets relatively easily, so that other workers can produce sapwood estimates for the regions \nthat interest them. \nFigure 1 shows the data from Miles together with the probabilities calculated from a normal \ndistribution with the same mean and standard deviation as the log-transformed data.  The \n“95% mid-range” calculated by the method of Hughes et al. (1981) is 10-40 rings.  It is clear \nfrom the figure that 9 rings are more likely than 37, 38, 39 or 40 rings.  The preferred 95% \nconfidence interval from a Bayesian perspective is the highest probability density (hpd) \nregion, which in this case is 9-36 rings (95.2% confidence).  Working with a discrete \nprobability function means that it is not always possible to calculate a hpd region with exactly \n95% confidence, so in this paper, the smallest hpd with at least 95% confidence is calculated \nand the actual confidence indicated in parenthesis. \nSapwood estimates with surviving sapwood \nThe standard method of simply truncating the sapwood estimate at the observed number of \nrings does not yield an interval with a fixed confidence level.  Hillam (1998, 27) states that \nthe truncated “felling date range” is a 95% confidence estimate, but this is not necessarily the \ncase.  Such truncated date ranges represent confidence limits whose level depends on the \nobserved number of rings.  Thus it is not possible to compare two felling date ranges on the \nbasis that they have the same confidence level.  A Bayesian approach to this problem may be \ndeveloped as follows.  If we wish to estimate the number of sapwood rings then a priori the \nprobability density is given by the log-normal distribution as discussed above, i.e., \n \n½+n\n-½n\n2\n2\n2\n)(ln\nexp\n2\n1\n = ),\nx\nx\np(n|  (1) \nwhere  and are the parameters of the distribution.  In addition we know that there are a \nrings present, and thus the likelihood is given by \n \nand thus the posterior probability is given by \n  \nThis distribution can be numerically normalised to give probabilities and hence 95% hpd \nranges.  This is illustrated in Figure 2, which shows the effect of a=25 on the distribution of \nFigure 1.  The hpd region is now 25-43 rings (95.5%) rather than the 25-40 rings (92.5%) of \nthe truncation method. \nEstimating a terminus post quem \nCurrently the terminus post quem (tpq) for the felling date of a tree without a heartwood-\nsapwood boundary is estimated by adding the lower limit of the sapwood estimate to the date \nof the latest ring.  This gives a tpq with a confidence of more than 95%, the precise amount \ndepending on the parameters of the distribution of sapwood ring numbers.  For example, with \nna\nna\nnal\nfor  0\nfor  1\n);(\n),|()()|( npna;lanp\nthe distribution shown in Figure 1, adding 10 years (rings) gives a tpq with 98.6% confidence, \nadding the new, lower limit of 9 rings gives a tpq with 99.4% confidence.  Adding 12 years \ngives a tpq with 94.9% confidence, and is thus recommended as the closest to a 95% \nconfidence limit that can be achieved given the discrete nature of the distribution. \nObtaining felling date ranges \nAs the new method outlined in this paper gives probability density functions for felling dates \nbased on sapwood estimates, these can be used to incorporate dendrochronological dates into \na wide range of other Bayesian analyses (e.g. using the program OxCal (Bronk Ramsey \n1995)).  This is demonstrated here using a purely dendrochronological example: the \nestimation of the single year of felling of a group of timbers with and without sapwood.   \nThose timbers with no heartwood-sapwood boundary give a tpq for the felling.  If Hi is the \nfinal observed heartwood ring in timber i, then the likelihood is given by\n1\n: \n \n Those timbers with a heartwood-sapwood boundary, but no sapwood rings have a likelihood \ngiven by: \n l ; H\np H H\nH\ni\ni i\ni\n( )\n( | , )  for \n                       for 0\n \nwith  ),|p(n as in equation 1.  For those timbers with ai sapwood rings, the likelihood is \ngiven by: \ni\ni\ni\nH\nH\nHl\nfor     0\nfor      1\n);(\nii\niii\ni\nHa\nHaHp\nHl\nfor                           0\nfor      ),|(\n);(\n  \nTaking a vague prior (i.e. preferring no year above another initially), the combined posterior \nis given by: \n \nThe usefulness of this approach may be illustrated by an example.  Table 1 summarises the \ndate of the last heartwood ring and the extent of surviving sapwood for 14 timbers from the \nGreat Kitchen at Windsor Castle (Hillam 1998).  The closeness of the end years or \nheartwood-sapwood boundaries suggests that the timbers are all contemporary.  The historical \nquestion is: What was the year of felling? \nFigure 3 shows the probability distributions for the felling dates of those timbers with \nheartwood\/sapwood boundaries and the combined posterior probability density.  In this case \nthe timbers with no sapwood do not contribute anything to the result and are therefore not \nshown.  The estimated date of felling is 1574-1582 (97.5% confidence).  Using the method of \nHillam (1998, 11) and the sapwood estimate of 10-40 years derived from the method of \nHughes et al. (1981) on Miles (1997) data would have resulted in a range of 1576-1588.  It so \nhappens that in this structure the true date is known because an additional timber with bark \n(12070B, not included in the dataset here) gives a felling date of 1577 AD and this is \nconfirmed by documentary records of repairs in that year (Hillam 1998, 16).  Both \ncalculations give ranges which agree with the known date, but the Bayesian method is \npreferable because the results are a statistically well defined hpd region with specific \nconfidence limits.  The new method yields a 95% confidence range of 9 years compared to 13 \ni\nii aHlp );,(),|( aH\nyears from the previous method.  As Pearson (1997) observed with regard to a 5 year revision \nof the sapwood estimate for Kent “If one is going in for accurate dating, this matters”. \nHowever although the results are statistically more meaningful the quality of sapwood \nestimates and felling dates so obtained is still subject to caveats.  Notable assumptions are (a) \nthe appropriateness of the known sapwood sample in both its geographical and temporal \nrange, and (b) the absence of a plantation effect, where the numbers of sapwood rings of \ndifferent timbers are correlated due to similar growing conditions.  Additionally, the use of a \nlog-normal distribution is empirically based without any explicit basis in plant physiology.  \nFurther improvements in sapwood estimates will come from increased understanding of \nbiological, geographical and temporal variation in sapwood ring numbers.   \nConclusion \nBayesian statistical methods are finding increasing application in chronometric and \narchaeological studies (Litton and Buck 1995).  This note has demonstrated how they may be \napplied to sapwood estimates in dendrochronology to provide statistically more rigorous \ndescriptions of estimated felling dates for both individual timbers and groups of timbers.  \nThey have the advantage, in many cases, of also producing shorter ranges for estimated dates, \nwhich makes them attractive to the end user, who can know that the new methods are both \nstatistically better and more precise.  In addition the production ofprobability distributions \nnow allows the dates to be integrated with other dating evidence (e.g. radiocarbon dates) \nwithin a Bayesian framework. \nNote \n1. This formula is a simplification.  In principle one could use the information embodied in \nequation 1 to generate a more complex probability distribution but simple combination of \nthese leads to a bias to later dates which worsens as the number of tpqs increases.  The \nsolution to this problem is not clear at present.  I am grateful to C Bronk Ramsey for pointing \nout this problem with multiple complex tpq. \nReferences \nBaillie, M. G. L., 1982, Tree-ring dating and archaeology, University of Chicago Press, \nLondon. \nBronk Ramsey, C., 1995, Radiocarbon calibration and stratigraphy: the OxCal program, \nRadiocarbon, 37, 425-430 \nBuck, C. E., Cavanagh, W. G., and Litton, C. D., 1996, Bayesian approach to interpreting \narchaeological data, John Wiley, Chichester. \nHillam, J., 1998, Dendrochronology: guidelines on producing and interpreting \ndendrochronological dates, English Heritage, London. \nHillam, J., Morgan, R. A., and Tyers, I., 1987, Sapwood estimates and the dating of short ring \nsequences, in Applications of tree-ring studies: current research in dendrochronology \nand related areas (ed. R. G. W. Ward), British Archaeological Reports International \nSeries, S333, 165-185 \nHughes, M. K., Milsom, S. J., and Leggett, P. A., 1981, Sapwood estimates in the \ninterpretation of tree-ring dates, Journal of Archaeological Science, 8, 381-390 \nLaxton, R. R., and Litton, C. D., 1988, An East Midlands master tree-ring chronology and its \nuse for the dating of vernacular buildings, University of Nottingham, Department of \nClassical and Archaeological Studies, Monograph Series, III. \nLitton, C. D., and Buck, C. E., 1995, The Bayesian approach to the interpretation of \narchaeological data, Archaeometry, 37, 1-24. \nMiles, D., 1997, The interpretation, presentation and use of tree-ring dates, Vernacular \nArchitecture, 28, 40-56.  (As amended by erratum slip in Vernacular Architecture 29.) \nPearson, S., 1997, Tree-ring dating: a review, Vernacular Architecture 28, 25-39. \nTable 1  \nSummary of dendrochronological data of timbers from the Great Kitchen, Windsor Castle.  \n(Derived from Hillam (1998) Figure 12.) \nSample last heartwood  \nring (AD) \nheartwood-\nsapwood \nboundary? \nsurviving \nsapwood \nrings \n12013 1535 N  \n12055 1537 N  \n12009 1548 N  \n12054 1549 Y 0 \n12062 1550 N  \n12057 1552 Y 2 \n12049 1552 Y 14 \n12003 1553 N  \n12066 1553 N  \n12067 1554 Y 0 \n12017 1557 N  \n12060 1559 Y 12 \n12051 1565 N  \n12024 1566 Y 7 \n \nFigure captions \n \n \nFigure 1: Distribution of number of sapwood rings.  Bars show frequency data of Miles \n(1997) for southern England, dashes show probabilities calculated as described in the text. \n \nFigure 2: Posterior probability distribution for number of sapwood rings, given that 25 \nsapwood rings have been observed. \n \nFigure 3: Probability distributions for the felling date of timbers from the Great Kitchen, \nWindsor Castle. \n \n05\n10\n15\n20\n25\n30\n35\n0 5 10 15 20 25 30 35 40 45 50 55 60\nNumber of sapwood rings\n0\n0.01\n0.02\n0.03\n0.04\n0.05\n0.06\n0.07\n0.08\n9 - 36: 95% highest probability density\n10 - 40: “95% mid-range”\nProbabilityFrequency\n \nFigure 1: Distribution of number of sapwood rings.  Bars show frequency data of Miles \n(1997) for southern England, dashes show probabilities calculated as described in the text. \n Figure 2: Posterior probability distribution for number of sapwood rings, given that 25 \nsapwood rings have been observed. \n \n0\n0.02\n0.04\n0.06\n0.08\n0.1\n0.12\n0.14\n0.16\n0 5 10 15 20 25 30 35 40 45 50 55 60\nNumber of sapwood rings\nProbability\n25 - 43: 95% hpd for felling\n25 - 40: “felling date range” (92.5%)\n1520AD 1540AD 1560AD 1580AD 1600AD 1620AD\nCalendar date\nSample 12054:  1558 - 1586 AD\nSample 12057  1561 - 1589 AD\nSample 12067  1563 - 1591 AD\nSample 12049  1567 - 1589 AD\nSample 12060  1572 - 1596 AD\nSample 12024  1575 - 1603 AD\nCombined date  1574 - 1582 AD\nHillam (1998) method 1576 - 1588 AD\n \nFigure 3: Probability distributions for the felling date of timbers from the Great Kitchen, \nWindsor Castle. \n \n"}