{"doi":"10.1161\/01.RES.0000148634.47095.ab","coreId":"193441","oai":"oai:lra.le.ac.uk:2381\/1764","identifiers":["oai:lra.le.ac.uk:2381\/1764","10.1161\/01.RES.0000148634.47095.ab"],"title":"Caveolae localise protein kinase A signalling to arterial ATP-sensitive potassium channels.","authors":["Sampson, Laura J.","Hayabuchi, Yasunobu","Standen, Nick B.","Dart, Caroline"],"enrichments":{"references":[{"id":44673687,"title":"AKAPs: from structure to function. Trends Cell Biol.","authors":[],"date":"1999","doi":"10.1016\/s0962-8924(99)01558-5","raw":"Colledge M, Scott JD. AKAPs: from structure to function. Trends Cell Biol. 1999;9:216–221.","cites":null},{"id":44673660,"title":"Angiotensin II inhibits rat arterial K-ATP channels by inhibiting steady-state protein kinase A activity and activating protein kinase Ca.","authors":[],"date":null,"doi":"10.1111\/j.1469-7793.2001.0193l.x","raw":"Hayabuchi Y, Davies NW, Standen NB. Angiotensin II inhibits rat arterial K-ATP channels by inhibiting steady-state protein kinase A activity and activating protein kinase Ca. J Physiol. 2001;530:193–205.","cites":null},{"id":44673668,"title":"Angiotensin II type 1 receptor: relationship with caveolae and caveolin after initial agonist stimulation. Hypertension.","authors":[],"date":"1998","doi":"10.1161\/01.hyp.32.3.459","raw":"Ishizaka N, Griendling KK, Lassegue B, Alexander RW. Angiotensin II type 1 receptor: relationship with caveolae and caveolin after initial agonist stimulation. Hypertension. 1998;32:459–466.","cites":null},{"id":44673622,"title":"ATP-sensitive and inwardly rectifying potassium channels in smooth muscle. Physiol Rev.","authors":[],"date":null,"doi":null,"raw":"Quayle JM, Nelson MT, Standen NB. ATP-sensitive and inwardly rectifying potassium channels in smooth muscle. Physiol Rev. 1997;77: 1165–1232.","cites":null},{"id":44673620,"title":"ATP-sensitive K channels in pancreatic, cardiac, and vascular smooth muscle cells.","authors":[],"date":"1998","doi":"10.1097\/00005344-199910000-00003","raw":"Yokoshiki H, Sunagawa M, Seki T, Sperelakis N. ATP-sensitive K channels in pancreatic, cardiac, and vascular smooth muscle cells. Am J Physiol. 1998;43:C25–C37.","cites":null},{"id":44673679,"title":"ATPsensitive potassium channel is essential to maintain basal coronary vascular tone in vivo.","authors":[],"date":"1992","doi":null,"raw":"Samaha FF, Heineman FW, Ince C, Fleming J, Balaban RS. ATPsensitive potassium channel is essential to maintain basal coronary vascular tone in vivo. Am J Physiol. 1992;262:C1220–C1227.","cites":null},{"id":44673689,"title":"Caveolae from canine airway smooth muscle contain the necessary components for a role in Ca2 handling.","authors":[],"date":"2000","doi":null,"raw":"Darby PJ, Kwan CY, Daniel EE. Caveolae from canine airway smooth muscle contain the necessary components for a role in Ca2 handling. Am J Physiol. 2000;279:L1226–L1235.","cites":null},{"id":44673644,"title":"Caveolae: from cell biology to animal physiology. Pharmacol Rev.","authors":[],"date":"2002","doi":"10.1124\/pr.54.3.431","raw":"Razani B, Woodman SE, Lisanti MP. Caveolae: from cell biology to animal physiology. Pharmacol Rev. 2002;54:431–467.","cites":null},{"id":44673654,"title":"Cellular cholesterol effect mediated by cyclodextrins: demonstration of kinetic pools and mechanism of efflux.","authors":[],"date":"1996","doi":"10.1074\/jbc.271.27.16026","raw":"Yancey PG, Rodriqueza WV, Kilsdonk EPC, Stoudt GW, Johnson WJ, Phillips MC, Rothblat GH. Cellular cholesterol effect mediated by cyclodextrins: demonstration of kinetic pools and mechanism of efflux. J Biol Chem. 1996;271:16026–16034.","cites":null},{"id":44673656,"title":"Cellular cholesterol efflux mediated by cyclodextrins.","authors":[],"date":"1995","doi":"10.1074\/jbc.270.29.17250","raw":"Kilsdonk EPC, Yancey PG, Stoudt GW, Bangerter FW, Johnson WJ, Phillips MC, Rothblat GH. Cellular cholesterol efflux mediated by cyclodextrins. J Biol Chem. 1995;270:17250–17256.","cites":null},{"id":44673642,"title":"Characterization of caveolin-rich membrane domains isolated from an endothelial-rich source: implications for human-disease.","authors":[],"date":"1994","doi":null,"raw":"Lisanti MP, Scherer PE, Vidugiriene J, Tang Z, Hermanowski-Vosatka A, Tu YH, Cook RF, Sargiacomo M. Characterization of caveolin-rich membrane domains isolated from an endothelial-rich source: implications for human-disease. J Cell Biol. 1994;126:111–126.","cites":null},{"id":44673675,"title":"Cholesterol depletion disrupts caveolae and differentially impairs agonist-induced arterial contraction. Arterioscler Thromb Vasc Biol.","authors":[],"date":"2002","doi":"10.1161\/01.atv.0000023438.32585.a1","raw":"Dreja K, Voldstedlund M, Vinten J, Tranum-Jensen J, Hellstrand P, Sward K. Cholesterol depletion disrupts caveolae and differentially impairs agonist-induced arterial contraction. Arterioscler Thromb Vasc Biol. 2002;22:1267–1272.","cites":null},{"id":44673676,"title":"Cholesterol detection inhibits epidermal growth factor receptor transactivation by angiotensin II in vascular smooth muscle cells: role of cholesterol-rich microdomains and focal adhesions in angiotensin II signaling.","authors":[],"date":null,"doi":"10.1074\/jbc.a113.105901","raw":"Ushio-Fukai M, Hilenski L, Santanam N, Becker PL, Ma YX, Griendling KK, Alexander RW. Cholesterol detection inhibits epidermal growth factor receptor transactivation by angiotensin II in vascular smooth muscle cells: role of cholesterol-rich microdomains and focal adhesions in angiotensin II signaling. J Biol Chem. 2001;276:48269–48275.","cites":null},{"id":44673652,"title":"Co-purification and direct interaction of Ras with caveolin, an integral membrane protein of caveolae microdomains. Detergent-free purification of caveolae membranes.","authors":[],"date":"1996","doi":"10.1074\/jbc.271.16.9690","raw":"Song KS, Li SW, Okamoto T, Quilliam LA, Sargiacomo M, Lisanti MP. Co-purification and direct interaction of Ras with caveolin, an integral membrane protein of caveolae microdomains. Detergent-free purification of caveolae membranes. J Biol Chem. 1996;271:9690–9697.","cites":null},{"id":44673618,"title":"Correlating structure and function in ATPsensitive K channels. Trends Neurosci.","authors":[],"date":"1998","doi":"10.1016\/s0166-2236(98)01225-9","raw":"Ashcroft FM, Gribble FM. Correlating structure and function in ATPsensitive K channels. Trends Neurosci. 1998;21:288–294.","cites":null},{"id":44673650,"title":"Direct interaction between the actinbinding protein filamin-A and the inwardly rectifying potassium channel,","authors":[],"date":null,"doi":"10.1074\/jbc.m307479200","raw":"Sampson LJ, Leyland ML, Dart C. Direct interaction between the actinbinding protein filamin-A and the inwardly rectifying potassium channel, Kir2.1. J Biol Chem. 2003;278:41988–41997.","cites":null},{"id":44673662,"title":"Discrete microdomains with high concentration of cAMP in stimulated rat neonatal cardiac myocytes.","authors":[],"date":null,"doi":"10.1126\/science.1069982","raw":"Zaccolo M, Pozzan T. Discrete microdomains with high concentration of cAMP in stimulated rat neonatal cardiac myocytes. Science. 2002;295: 1711–1715.","cites":null},{"id":44673682,"title":"Effect of ATP-sensitive potassium channel inhibition on resting coronary vascular responses in humans. Circ Res.","authors":[],"date":"2002","doi":"10.1161\/hh0202.103713","raw":"Farouque HM, Worthley SG, Meredith IT, Skyrme-Jones RA, Zhang MJ. Effect of ATP-sensitive potassium channel inhibition on resting coronary vascular responses in humans. Circ Res. 2002;90:231–236.","cites":null},{"id":44673683,"title":"Effects of glibenclamide on systemic and splanchnic haemodynamics in conscious rats.","authors":[],"date":"1994","doi":"10.1111\/j.1476-5381.1994.tb13124.x","raw":"Moreau R, Komeichi H, Kirstetter P, Yang S, Aupetit-Faisant B, Cailmail S, Lebrec D. Effects of glibenclamide on systemic and splanchnic haemodynamics in conscious rats. Br J Pharmacol. 1994;112:649–653.","cites":null},{"id":44673684,"title":"Effects of glibenclamide on the regional haemodynamic actions of alpha-trinositol and its influence on responses to vasodilators in conscious rats.","authors":[],"date":"1996","doi":"10.1111\/j.1476-5381.1996.tb15219.x","raw":"Gardiner SM, Kemp PA, March JE, Fallgren B, Bennett T. Effects of glibenclamide on the regional haemodynamic actions of alpha-trinositol and its influence on responses to vasodilators in conscious rats. Br J Pharmacol. 1996;117:507–515.","cites":null},{"id":44673632,"title":"Episodic coronary artery vasospasm and hypertension develop in the absence of SUR2 K-ATP channels. J Clin Invest.","authors":[],"date":"2002","doi":"10.1172\/jci0215672","raw":"Chutkow WA, Pu JL, Wheeler MT, Wada T, Makielski JC, Burant CF, McNally EM. Episodic coronary artery vasospasm and hypertension develop in the absence of SUR2 K-ATP channels. J Clin Invest. 2002; 110:203–208.","cites":null},{"id":44673664,"title":"Evidence for involvement of A-kinase anchoring protein in activation of rat arterial K-ATP channels by protein kinase","authors":[],"date":"2001","doi":"10.1111\/j.1469-7793.2001.0421c.xd","raw":"Hayabuchi Y, Dart C, Standen NB. Evidence for involvement of A-kinase anchoring protein in activation of rat arterial K-ATP channels by protein kinase A. J Physiol. 2001;536:421–427.","cites":null},{"id":44673626,"title":"Functional roles of cardiac and vascular ATP-sensitive potassium channels clarified by Kir6.2-knockout mice. Circ Res.","authors":[],"date":"2001","doi":"10.1161\/01.res.88.6.570","raw":"Suzuki M, Li RA, Miki T, Uemura H, Sakamoto N, Ohmoto-Sekine Y, Tamagawa M, Ogura T, Seino S, Marban E, Nakaya H. Functional roles of cardiac and vascular ATP-sensitive potassium channels clarified by Kir6.2-knockout mice. Circ Res. 2001;88:570–577.","cites":null},{"id":44673666,"title":"Homcy CJ. The adenylyl cyclases as integrators of transmembrane signal transduction. Circ Res.","authors":[],"date":"1997","doi":"10.1161\/01.res.80.3.297","raw":"Ishikawa Y, Homcy CJ. The adenylyl cyclases as integrators of transmembrane signal transduction. Circ Res. 1997;80:297–304.","cites":null},{"id":44673673,"title":"Identification of peptide and protein ligands for the caveolin-scaffolding domain. Implications for the interaction of caveolin with caveolae-associated proteins.","authors":[],"date":"1997","doi":"10.1074\/jbc.272.10.6525","raw":"Couet J, Li SW, Okamoto T, Ikezu T, Lisanti MP. Identification of peptide and protein ligands for the caveolin-scaffolding domain. Implications for the interaction of caveolin with caveolae-associated proteins. J Biol Chem. 1997;272:6525–6533.","cites":null},{"id":44673685,"title":"Isoform-specific localization of voltage-gated K channels to distinct lipid raft populations: targeting of Kv1.5 to caveolae.","authors":[],"date":null,"doi":"10.1074\/jbc.m009948200","raw":"Martens JR, Sakamoto N, Sullivan SA, Grobaski TD, Tamkun MM. Isoform-specific localization of voltage-gated K channels to distinct lipid raft populations: targeting of Kv1.5 to caveolae. J Biol Chem. 2001;276:8409–8414.","cites":null},{"id":44673634,"title":"K-ATP-channel inhibition improves hemodynamics and cellular energetics in hemorrhagic shock.","authors":[],"date":"1997","doi":null,"raw":"Salzman AL, Vromen A, Denenberg A, Szabo C. K-ATP-channel inhibition improves hemodynamics and cellular energetics in hemorrhagic shock. Am J Physiol. 1997;272:H688–H694.","cites":null},{"id":44673677,"title":"Lipid rafts and signal transduction. Nat Rev Mol Cell Biol.","authors":[],"date":"2000","doi":"10.1038\/35036052","raw":"Simons K, Toomre D. Lipid rafts and signal transduction. Nat Rev Mol Cell Biol. 2000;1:31–39.","cites":null},{"id":44673691,"title":"Localization and turnover of phosphatidylinositol 4,5-bisphosphate in caveolin-enriched membrane domains.","authors":[],"date":"2004","doi":"10.1074\/jbc.271.43.26453","raw":"Pike LJ, Casey L. Localization and turnover of phosphatidylinositol 4,5-bisphosphate in caveolin-enriched membrane domains. J Biol Chem. 1996;271:26453–26456. 1018 Circulation Research November 12, 2004 at University of Leicester (lei) \/ England on August 19, 2013http:\/\/circres.ahajournals.org\/Downloaded from","cites":null},{"id":44673638,"title":"Localization of adenylyl cyclase Isoforms and G protein-coupled receptors in vascular smooth muscle cells: expression in caveolin-rich and noncaveolin domains. Mol Pharmacol.","authors":[],"date":"2002","doi":"10.1124\/mol.62.5.983","raw":"Ostrom RS, Liu XQ, Head BP, Gregorian C, Seasholtz TM, Insel PA. Localization of adenylyl cyclase Isoforms and G protein-coupled receptors in vascular smooth muscle cells: expression in caveolin-rich and noncaveolin domains. Mol Pharmacol. 2002;62:983–992.","cites":null},{"id":44673630,"title":"Mouse model of Prinzmetal angina by disruption of the inward rectifier Kir6.1. Nat Med.","authors":[],"date":"2002","doi":"10.1038\/nm0502-466","raw":"Miki T, Suzuki M, Shibasaki T, Uemura H, Sato T, Yamaguchi K, Koseki H, Iwanaga T, Nakaya H, Seino S. Mouse model of Prinzmetal angina by disruption of the inward rectifier Kir6.1. Nat Med. 2002;8:466–472.","cites":null},{"id":44673688,"title":"Multisite phosphorylation mechanism for protein kinase A activation of the smooth muscle ATP-sensitive potassium channel. Circ Res.","authors":[],"date":"2004","doi":"10.1161\/01.res.0000128513.34817.c4","raw":"Quinn KV, Giblin JP, Tinker A. Multisite phosphorylation mechanism for protein kinase A activation of the smooth muscle ATP-sensitive potassium channel. Circ Res. 2004;94:1359–1366.","cites":null},{"id":44673658,"title":"N-terminal protein acylation confers localization to cholesterol, sphingolipid-enriched membranes but not to lipid rafts\/caveolae. Mol Biol Cell.","authors":[],"date":"2001","doi":"10.1091\/mbc.12.11.3601","raw":"McCabe JB, Berthiaume LG. N-terminal protein acylation confers localization to cholesterol, sphingolipid-enriched membranes but not to lipid rafts\/caveolae. Mol Biol Cell. 2001;12:3601–3617.","cites":null},{"id":44673672,"title":"Physiological and pathophysiological roles of ATPsensitive K channels. Prog Biophys Mol Biol.","authors":[],"date":"2003","doi":null,"raw":"Seino S, Miki T. Physiological and pathophysiological roles of ATPsensitive K channels. Prog Biophys Mol Biol. 2003;81:133–176.","cites":null},{"id":44673628,"title":"Potassium channel openers: therapeutic potential in cardiology and medicine. Expert Opin Pharmacother.","authors":[],"date":"2001","doi":"10.1517\/14656566.2.12.1995","raw":"Janhangir A, Terzic A, Shen WK. Potassium channel openers: therapeutic potential in cardiology and medicine. Expert Opin Pharmacother. 2001; 2:1995–2010.","cites":null},{"id":44673624,"title":"Potassium channels in the vasculature. Curr Opin Nephrol Hypertens.","authors":[],"date":"1998","doi":null,"raw":"Clapp LH, Tinker A. Potassium channels in the vasculature. Curr Opin Nephrol Hypertens. 1998;7:91–98.","cites":null},{"id":44673636,"title":"Regional haemodynamic responses to infusion of lipopolysaccharide in conscious rats: effects of pre- or post-treatment with glibenclamide.","authors":[],"date":null,"doi":"10.1038\/sj.bjp.0702985","raw":"Gardiner SM, Kemp PA, March JE, Bennett T. Regional haemodynamic responses to infusion of lipopolysaccharide in conscious rats: effects of pre- or post-treatment with glibenclamide. Br J Pharmacol. 1999;128: 1772–1778.","cites":null},{"id":44673640,"title":"Regulation and organization of adenylyl cyclases and cAMP.","authors":[],"date":null,"doi":"10.1042\/bj20031061","raw":"Cooper DMF. Regulation and organization of adenylyl cyclases and cAMP. Biochem J. 2003;375:517–529.","cites":null},{"id":44673678,"title":"Regulation of the Ca2-inhibitable adenylyl cyclase type VI by capacitative Ca2 entry requires localization in cholesterol-rich domains.","authors":[],"date":null,"doi":"10.1074\/jbc.m001369200","raw":"Fagan KA, Smith KE, Cooper DMF. Regulation of the Ca2-inhibitable adenylyl cyclase type VI by capacitative Ca2 entry requires localization in cholesterol-rich domains. J Biol Chem. 2000;275:26530–26537.","cites":null},{"id":44673680,"title":"Role of KATP channels in regulation of systemic, pulmonary, and coronary vasomotor tone in exercising swine.","authors":[],"date":"2001","doi":null,"raw":"Duncker DJ, Oei HH, Hu F, Stubenitsky R, Verdouw PD. Role of KATP channels in regulation of systemic, pulmonary, and coronary vasomotor tone in exercising swine. Am J Physiol. 2001;280:H22–H33.","cites":null},{"id":44673690,"title":"Smooth muscle excitation-contraction coupling: a role for caveolae and caveolins? News Physiol Sci.","authors":[],"date":"2001","doi":null,"raw":"Taggart MJ. Smooth muscle excitation-contraction coupling: a role for caveolae and caveolins? News Physiol Sci. 2001;16:61–65.","cites":null},{"id":44673686,"title":"The biological functions of A-kinase anchor proteins.","authors":[],"date":null,"doi":"10.1006\/jmbi.2001.4585","raw":"Feliciello A, Gottesman ME, Avvedimento EV. The biological functions of A-kinase anchor proteins. J Mol Biol. 2001;308:99–114.","cites":null},{"id":44673648,"title":"The caveolae membrane system. Ann Rev Biochem.","authors":[],"date":"1998","doi":"10.1146\/annurev.biochem.67.1.199","raw":"Anderson RGW. The caveolae membrane system. Ann Rev Biochem. 1998;67:199–225.","cites":null},{"id":44673670,"title":"Toward understanding the assembly and structure of K-ATP channels. Physiol Rev.","authors":[],"date":"1998","doi":null,"raw":"Aguilar-Bryan L, Clement JP, Gonzalez G, Kunjilwar K, Babenko A, Bryan J. Toward understanding the assembly and structure of K-ATP channels. Physiol Rev. 1998;78:227–245.","cites":null},{"id":44673646,"title":"Unbiased quantitative proteomics of lipid rafts reveals high specificity for signaling factors.","authors":[],"date":null,"doi":"10.1073\/pnas.0631608100","raw":"Foster LJ, de Hoog CL, Mann M. Unbiased quantitative proteomics of lipid rafts reveals high specificity for signaling factors. Proc Natl Acad Sci U S A. 2003;100:5813–5818.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-10-21","abstract":"Peer-reviewedPublisher Versio","downloadUrl":"http:\/\/circres.ahajournals.org\/content\/95\/10\/1012","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/1764\/1\/10.1161_01.RES.0000148634.47095.ab.pdf","pdfHashValue":"13644b7784f9d233d76c2fd5a7737022e18ad1a8","publisher":"American Heart Association, Inc.","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/1764<\/identifier><datestamp>\n                2013-11-21T02:01:49Z<\/datestamp><setSpec>\n                com_2381_112<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_113<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nCaveolae localise protein kinase A signalling to arterial ATP-sensitive potassium channels.<\/dc:title><dc:creator>\nSampson, Laura J.<\/dc:creator><dc:creator>\nHayabuchi, Yasunobu<\/dc:creator><dc:creator>\nStanden, Nick B.<\/dc:creator><dc:creator>\nDart, Caroline<\/dc:creator><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPublisher Version<\/dc:description><dc:date>\n2009-12-08T16:11:18Z<\/dc:date><dc:date>\n2009-12-08T16:11:18Z<\/dc:date><dc:date>\n2004-10-21<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nCirculation Research, 2004, 95, pp. 1012-1018<\/dc:identifier><dc:identifier>\n0009-7330<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/1764<\/dc:identifier><dc:identifier>\nhttp:\/\/circres.ahajournals.org\/content\/95\/10\/1012<\/dc:identifier><dc:identifier>\n10.1161\/01.RES.0000148634.47095.ab<\/dc:identifier><dc:identifier>\n1524-4571<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:rights>\nCopyright © 2004, American Heart Association, Inc. Deposited with reference to the publisher’s archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nAmerican Heart Association, Inc.<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0009-7330","issn:1524-4571","0009-7330","1524-4571"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007"],"year":2004,"topics":[],"subject":["Article"],"fullText":"Caveolae Localize Protein Kinase A Signaling to Arterial\nATP-Sensitive Potassium Channels\nLaura J. Sampson, Yasunobu Hayabuchi, Nick B. Standen, Caroline Dart\nAbstract—Arterial ATP-sensitive K\u0001 (KATP) channels are critical regulators of vascular tone, forming a focal point for\nsignaling by many vasoactive transmitters that alter smooth muscle contractility and so blood flow. Clinically, these\nchannels form the target of antianginal and antihypertensive drugs, and their genetic disruption leads to hypertension and\nsudden cardiac death through coronary vasospasm. However, whereas the biochemical basis of KATP channel modulation\nis well-studied, little is known about the structural or spatial organization of the signaling pathways that converge on\nthese channels. In this study, we use discontinuous sucrose density gradients and Western blot analysis to show that KATP\nchannels localize with an upstream signaling partner, adenylyl cyclase, to smooth muscle membrane fractions containing\ncaveolin, a protein found exclusively in cholesterol and sphingolipid-enriched membrane invaginations known as\ncaveolae. Furthermore, we show that an antibody against the KATP pore-forming subunit, Kir6.1 co-immunoprecipitates\ncaveolin from arterial homogenates, suggesting that Kir6.1 and caveolin exist together in a complex. To assess whether\nthe colocalization of KATP channels and adenylyl cyclase to smooth muscle caveolae has functional significance, we\ndisrupt caveolae with the cholesterol-depleting agent, methyl-\u0001-cyclodextrin. This reduces the cAMP-dependent protein\nkinase A–sensitive component of whole-cell KATP current, indicating that the integrity of caveolae is important for\nadenylyl cyclase–mediated channel modulation. These results suggest that to be susceptible to protein kinase\nA–dependent activation, arterial KATP channels need to be localized in the same lipid compartment as adenylyl cyclase;\nthe results also provide the first indication of the spatial organization of signaling pathways that regulate KATP channel\nactivity. (Circ Res. 2004;95:1012-1018.)\nKey Words: KATP channel \u0001 adenylyl cyclase \u0001 caveolae \u0001 compartmentation \u0001 protein kinase A\nAdenosine triphosphate (ATP)–sensitive potassium (KATP)channels respond to fluctuations in intracellular levels of\nATP and adenosine diphosphate (ADP) and thus couple changes\nin cellular metabolism to membrane excitability.1,2 In the vas-\nculature, KATP channels provide a background potassium con-\nductance critical for the regulation of arterial tone, and, there-\nfore, blood flow, in response to local metabolic need and\nvasoactive transmitters.3–5 In clinical practice, they form the\ntarget for drugs used to treat angina pectoris and hypertensive\ncrises.6 Mice in which the genes encoding vascular KATP channel\nsubunits are disrupted show arterial hypercontractility, vasocon-\nstrictor intolerance, and hypertension and succumb to sudden\ncardiac death resulting from coronary vasospasm.7,8 Further-\nmore, pathological activation of KATP channels has been impli-\ncated in the catastrophic vasodilation of septic and hemorrhagic\nshock.4,9,10 Many endogenous vasodilators, including calcitonin\ngene-related peptide (CGRP) and adenosine, act at receptors\ncoupled to the G protein Gs to elevate KATP channel activity via\nactivation of cAMP-dependent protein kinase A (PKA).3 Up-\nstream of PKA, the formation of cAMP is catalyzed by the\nGs-stimulated enzyme adenylyl cyclase. Of the nine transmem-\nbrane isoforms of adenylyl cyclase, the Ca2\u0001-sensitive isoforms\n3, 5, and 6 are expressed in smooth muscle, where they reside\nprimarily in small (50 to 100 nm) cholesterol and sphingolipid-\nenriched invaginations of the surface membrane termed caveo-\nlae.11,12 These specialized “cave”-like lipid microdomains com-\nprise approximately 20% of the smooth muscle cell’s total\nsurface area and have the ability to selectively exclude or\nconcentrate signaling proteins.13–15 Although the physiological\nroles of caveolae are open to debate, it has been suggested that\nby aggregating interacting proteins they generate functional\nsubcellular signaling compartments that confer a degree of\nspatial organization on signal transduction pathways.13,14,16 In\nthis study, we show that PKA-dependent regulation of arterial\nKATP channels depends on the compartmentation of KATP chan-\nnels with adenylyl cyclase in smooth muscle caveolae, and\nsuggest that the utilization of these lipid microdomains may be\nimportant for segregating and organizing the complex signaling\npathways that converge on KATP channels.\nMaterials and Methods\nAnimals\nArterial tissues were obtained from adult male Wistar rats (\u0002300 g)\n(Charles River Laboratories, Inc, Margate, UK) killed by stunning\nOriginal received August 6, 2004; revision received October 7, 2004; accepted October 12, 2004.\nFrom the Department of Cell Physiology and Pharmacology, University of Leicester, Leicester, United Kingdom.\nCorrespondence to C. Dart, Department of Cell Physiology and Pharmacology, University of Leicester, PO Box 138, Leicester LE1 9HN, UK. E-mail\ncd12@le.ac.uk\n© 2004 American Heart Association, Inc.\nCirculation Research is available at http:\/\/www.circresaha.org DOI: 10.1161\/01.RES.0000148634.47095.ab\n1012\n at University of Leicester (lei) \/ England on August 19, 2013http:\/\/circres.ahajournals.org\/Downloaded from \nand rapid cervical dislocation. The care and euthanasia of animals\nconformed to the requirements of the UK Animals (Scientific\nProcedures) Act 1986.\nAntibodies, Polyacrylamide Gel Electrophoresis,\nand Immunoblotting\nThe following primary antibodies were used: anti-adaptin, anti-\ncaveolin 1, anti-caveolin 2, anti-caveolin 3, and anti-protein kinase\nRII\u0001 (BD Transduction Laboratories); anti-adenylyl cyclase 3, anti-\nadenylyl cyclase 5\/6, anti-Kir6.1 (R-14; sc-11224), and associated\nblocking peptide (sc-11224P) and anti-protein kinase RII\u0002 (Santa\nCruz Biotechnology); anti-smooth muscle \u0002-actin (Sigma-Aldrich).\nHorseradish peroxidase-conjugated anti-mouse and anti-rabbit sec-\nondary antibodies were from Jackson Immunochemical Laborato-\nries. HRP-conjugated anti-goat secondary was from Sigma-Aldrich.\nProtein extracts were resolved by SDS-polyacrylamide gel electro-\nphoresis on 12% polyacrylamide-Tris gels and transferred electro-\nphoretically onto nitrocellulose membranes (Hybond ECL, Amer-\nsham Pharmacia Biotech). Immunoblotting was performed as\ndescribed previously.17\nFractionation of Caveolin-Enriched Membrane\nand Assay for Cholesterol\nRat aortic smooth muscle cells were isolated enzymatically using\nmethodology described previously.17 Cells were cultured in high-\nglucose Dulbecco Modified Eagle Media (D-MEM) supplemented\nwith 15% fetal calf serum, penicillin (50 U\/mL), streptomycin (50\n\u0003g\/mL), and fungizone (2.5 \u0003g\/mL). All media and reagents were\nfrom Life Technologies, Inc. Cells were maintained at 37°C in a\nhumidified atmosphere (10% CO2) and harvested between passages\n12 to 15. Smooth muscle cell identity was confirmed by immuno-\ncytochemical staining with a smooth muscle–specific \u0002-actin\nantibody.\nBuoyant caveolae-enriched membrane fractions were isolated\nunder detergent-free conditions from rat aortic smooth muscle cell\nhomogenates by ultracentrifugation on discontinuous sucrose gradi-\nents using a method adapted from18 as described by.11 Briefly, four\nlarge (175 cm2) flasks of confluent aortic smooth muscle cells were\nwashed twice in ice-cold PBS and scraped into 2 mL of sodium\ncarbonate (500 mmol\/L; pH 11). Cells were disrupted by ten strokes\nin a hand-operated homogenizer and sonication (3\u000320-second\nbursts). The homogenate was made up to 45% sucrose by addition of\nan equal volume of 90% sucrose in MBS (25 mmol\/L MES and\n150 mmol\/L NaCl, pH 6.5) and loaded in a polyethylene-\nterephthalate thin-walled ultracentrifuge tube. The sample was over-\nlaid with 4 mL of 35% sucrose prepared in MBS with 250 mmol\/L\nsodium carbonate then 4 mL of 5% sucrose again prepared in MBS\nwith 250 mmol\/L sodium carbonate. Buoyant and nonbuoyant\nmembrane fractions were isolated by centrifugation at 39 000 rpm\nfor 18 hours at 4°C in a Sorvall ultracentrifuge equipped with\nTH-641 rotor. To evaluate the fractionation procedure, ten 1-mL\nfractions were collected from the top to the bottom of the gradient.\nEqual volumes of the fractions were separated by SDS-PAGE and\nanalyzed by immunoblotting. Cholesterol levels in each of the\nfractions were determined by analysis with the Amplex Red choles-\nterol assay kit (Molecular Probes) according to the manufacturer’s\nprotocol. In subsequent experiments, the top 2 mL of the sucrose\ngradient was discarded, and a light-scattering band representing the\ncholesterol-enriched, caveolin-containing membranes was collected\nfrom the 5% to 35% sucrose interface. The bottom 4 mL of 45%\nsucrose were collected as nonbuoyant, noncaveolar membranes.\nCholesterol Depletion and Filipin Staining\nCholesterol was depleted from smooth muscle membranes by incu-\nbation of cell suspensions or strips of rat thoracic aorta with 2%\nmethyl-\u0001-cyclodextrin (Sigma-Aldrich) for 1 to 2 hours.19,20\n\u0001-Cyclodextrins are noninvasive, water-soluble cyclic heptasaccha-\nrides containing a hydrophobic core capable of solubilizing choles-\nterol and extracting it from membranes. After treatment with\nmethyl-\u0001-cyclodextrin, the degree of cholesterol depletion was\nassessed by staining a sample of smooth muscle cells with the\ncholesterol-binding agent filipin according to methodology de-\nscribed previously.21\nCoimmunoprecipitation\nControl or cholesterol-depleted rat thoracic aorta was homogenized\nin ice-cold lysis buffer (20 mmol\/L Tris-HCl; 250 mmol\/L NaCl;\n3 mmol\/L EDTA; 3 mmol\/L EGTA; pH 7.6) containing 1% Triton\nX100 and protease inhibitors (1:100 dilution, Sigma Protease Inhib-\nitor Cocktail containing AEBSF, aprotinin, bestatin, leupeptin, pep-\nstatin A). Insoluble material was pelleted by centrifugation and the\nlysate precleared by incubation with protein-A agarose (Santa Cruz\nBiotechnology; 1 hour, 4°C). 500 \u0003L of cleared lysate was incubated\nwith 5 \u0003g of anti-Kir6.1, 5 \u0003g of anti-adaptin, 5 \u0003g of anti-adenylyl\ncyclase 5\/6, or 5 \u0003g of appropriate nonimmune control serum\novernight at 4°C. Antigen-antibody complexes were captured with\nprotein-A agarose (4°C, 2 hours). Agarose beads were washed\nextensively before removal of bound proteins by boiling in SDS\nsample buffer. Samples were resolved by SDS-PAGE, transferred\nonto nitrocellulose membrane, and analyzed by immunoblotting.\nElectrophysiology\nSingle smooth muscle cells were isolated enzymatically from small\nbranches of the rat mesenteric artery, as described previously.22 Cells\nwere stored at 4°C, and used on the day of preparation. Whole-cell\nK\u0001 currents were recorded from single smooth muscle cells using an\nAxopatch 200B amplifier (Axon Instruments). Recorded membrane\ncurrents were filtered at 5 kHz, digitized using a Digidata 1320A\ninterface (Axon Instruments), and analyzed using pCLAMP soft-\nware. Patch pipettes were pulled from borosilicate glass (outer\ndiameter 1.5 mm, inner diameter 0.86 mm; Clarke Electromedical)\nand fire polished to give a final resistance of \u00025 M\u0004 when filled.\nThe pipette-filling solution contained (in mmol\/L) 110 KCl, 30\nKOH, 10 HEPES, 10 EGTA, 1 MgCl2, 1 CaCl2, 1 Na2ATP, 0.1 ADP,\n0.5 GTP; adjusted to pH 7.2. The 6 mmol\/L K\u0001 extracellular solution\ncontained (in mmol\/L) 134 NaCl, 6 KCl, 1 MgCl2, 0.1 CaCl2, 10\nHEPES, 10 glucose; adjusted to pH 7.4. To separate KATP currents,\nwe recorded at\u000560 mV to minimize activation of voltage-dependent\nK\u0001 channels, and raised extracellular [K\u0001] to 140 mmol\/L to give a\nsubstantial inward driving force for K\u0001. In addition, 140 mmol\/L K\u0001\nextracellular solution contained (in mmol\/L) 140 KCl, 1 MgCl2, 0.1\nCaCl2, 10 HEPES, 10 glucose; pH 7.4. Pinacidil, glibenclamide,\nGDP\u0001S, propranolol, 8-SPT, and CGRP 8-37 were from Sigma-Al-\ndrich. 2\u0006,5\u0006-Dideoxyadenosine and Rp-cAMPS (the Rp isomer of\nadenosine 3\u0006,5\u0006-cyclic monophosphorothioate triethylammonium\nsalt) were from Calbiochem. Pinacidil and glibenclamide were\ndissolved in dimethylsulphoxide (DMSO). The final concentration of\nDMSO was less than 0.2%. Experiments were conducted in a\ntemperature-controlled bath at 25°C. Results are expressed as\nmean\u0007SEM. Intergroup differences were analyzed using ANOVA\nfollowed by the Student-Newman-Keuls test for multiple compari-\nsons or Student t test for simple comparisons.\nResults\nWe have shown previously that, even in the absence of\nvasodilators, PKA exerts a sustained, steady-state activation\nof KATP channels.22 This tonic drive could originate at a\nnumber of different levels in the PKA signaling pathway;\nnamely constitutive activity of a G protein–coupled receptor\n(GPCR), of the G proteins, or of adenylyl cyclase itself. To\ninvestigate where this sustained activity originates, we com-\npared the effects of the PKA inhibitor Rp-cAMPS on whole\ncell KATP currents in cells where the PKA signaling pathway\nhad been arrested at specific points. Under control conditions,\nthe addition of 100 \u0003mol\/L Rp-cAMPS caused a 21.2\u00073.7%\ninhibition (mean\u0007SEM; n\b8) of whole cell current induced\nby the KATP channel opener pinacidil (10 \u0003mol\/L) in cells\nSampson et al Arterial KATP Channels Localize to Caveolae 1013\n at University of Leicester (lei) \/ England on August 19, 2013http:\/\/circres.ahajournals.org\/Downloaded from \nisolated from rat mesenteric artery (Figure 1A). This PKA-\nsensitive component was not affected by intracellular appli-\ncation of the nonhydrolyzable GDP analogue, GDP\u0001S (1\nmmol\/L) (Figure 1B), or by exposure to a cocktail of\nantagonists to the major Gs-coupled receptors that function-\nally regulate KATP channels (1 \u0003mol\/L CGRP 8-37 for the\nCGRP receptor, 10 \u0003mol\/L 8-SPT for adenosine receptors,\n100 \u0003mol\/L propanolol for the \u0001-adrenergic receptor; Figure\n1C). These data suggest that the sustained PKA-dependent\ndrive on KATP channels does not originate from constitutive\nreceptor or G-protein activity. In contrast, intracellular appli-\ncation of the adenylyl cyclase inhibitor 2\u0006,5\u0006-dideoxyadeno-\nsine (500 \u0003mol\/L) significantly reduced pinacidil-evoked\nKATP current (Figure 1F), and rendered it nearly insensitive to\ninhibition of PKA (RpcAMPs inhibition 1.0\u00070.5%, n\b6,\nFigure 1D and 1E). These findings indicate that the tonic\nPKA-dependent activation of KATP channels arises from\nsustained cAMP production originating from basal adenylyl\ncyclase turnover. In cardiac myocytes, where adenylyl cy-\nclase also exhibits constitutive activity, basal intracellular\ncAMP levels are controlled through the activity of phos-\nphodiesterases (PDEs), which limit not only the signaling\nlifespan of cAMP but also the distance it can diffuse from its\nsite of production.23 We have previously demonstrated that\nthe downstream target of cAMP, PKA, is anchored in\nproximity to KATP channels through the action of an A-kinase\nanchoring protein.24 If the diffusion range of cAMP is\nrestricted within smooth muscle cells, it follows that KATP\nchannels and their associated kinases must be in the vicinity\nof cAMP production. Adenylyl cyclase is a comparatively\nrare component of the plasma membrane, constituting only\n0.001% of the total membrane protein,25 and in smooth\nmuscle is found predominantly in caveolae.11,12 We therefore\ninvestigated whether KATP channels also localize to these lipid\nmicrodomains.\nThe unusual lipid composition of caveolae (enriched with\ncholesterol and sphingolipids) gives them distinct properties\nas compared with the bulk of the plasma membrane—namely\na highly reduced “buoyant” density. We isolated buoyant\nmembrane fractions under detergent-free conditions from rat\naortic smooth muscle cell homogenates by ultracentrifugation\non discontinuous sucrose gradients.11,18 To assess the purity\nof caveolar and noncaveolar fractions, we used Western blot\nanalysis to determine the distribution of specific marker\nproteins, and an assay to determine the level of cholesterol\nwithin each fraction. As a marker for the buoyant caveolar\nfraction, we used the protein caveolin. Caveolins bind cho-\nlesterol and represent the major structural components of\ncaveolae, coating the whole of the cytoplasmic surface of\nthese organelles. They comprise a family of three distinct 21-\nto 24-kDa isoforms; caveolin-1 and -2 are widely expressed\nand most likely form a heterooligomeric complex, whereas\ncaveolin-3 is a muscle-specific isoform.14,16 Figure 2A shows\nWestern blot analysis of ten 1-mL fractions collected from\ntop to bottom of the sucrose density gradient. Caveolin-1, was\nfound predominantly in fraction 4 of the gradient, with small\nresidual amounts either side of this layer in fractions 3 and 5.\nIn contrast, \u0001-adaptin, a marker protein for clathrin-coated\npits, was largely excluded from the caveolar fractions and\nlocalized to the bottom layers of the gradient. Measurement\nFigure 1. Tonic PKA-dependent activa-\ntion of KATP channels originates from\nbasal adenylyl cyclase turnover. Whole\ncell current recorded from a single iso-\nlated rat mesenteric smooth muscle cell\nheld at \u000560 mV under control conditions\n(A) or in the presence of the nonhydro-\nlyzable GDP analogue, GDP\u0001S\n(1 mmol\/L) (B), a cocktail of antagonists\nto Gs-coupled receptors (1 \u0003mol\/L\nCGRP 8-37 and 10 \u0003mol\/L 8-SPT,\n100 \u0003mol\/L propanolol) (C), or\n500 \u0003mol\/L of the adenylyl cyclase inhib-\nitor 2\u0006,5\u0006-dideoxyadenosine (D). Dashed\nline indicates the zero current level. In all\nrecordings, the cells were dialyzed with a\n140 mmol\/L K\u0001\/1 mmol\/L ATP intracellu-\nlar solution. At a point indicated by the\nvertical arrow, the extracellular solution\nwas changed from 6 to 140 mmol\/L K\u0001\nto increase the inward driving force for\nK\u0001. Pinacidil (10 \u0003mol\/L), Rp-cAMPS\n(100 \u0003mol\/L), and the KATP channel\nblocker, glibenclamide (10 \u0003mol\/L) were\napplied as indicated. E, Mean inhibition\nby Rp-cAMPS, and F, mean amplitude of\nglibenclamide-sensitive current in experi-\nments like those of A through D.\n(n\b8,7,7,6 cells; **P\t0.001 *P\t0.05,\nANOVA followed by Student-Newman-\nKeuls test).\n1014 Circulation Research November 12, 2004\n at University of Leicester (lei) \/ England on August 19, 2013http:\/\/circres.ahajournals.org\/Downloaded from \nof cholesterol levels within each fraction showed cholesterol\nto be enriched in fractions 3 and 4 (Figure 2B), consistent\nwith the idea that fraction 4 represents the caveolae-\ncontaining layer of the density gradient. Having established\nthat cholesterol-enriched caveolar membranes can be sepa-\nrated from the noncaveolar membranes by this fractionation\nprocedure, we set out to determine the distribution of various\nproteins between caveolar and noncaveolar fractions. Consis-\ntent with previous studies, we found caveolin-1, -2, and -3\nexpressed in rat aortic smooth muscle cell lysates and also in\nthe caveolar membrane fractions11,26 (Figure 3A). In agree-\nment with the work of Ostrom et al,11 adenylyl cyclase\nisoforms 3 and 5\/6 also localized primarily to the caveolar\nmembrane fractions (Figure 3B). Other proteins such as the\nregulatory subunit of PKA were more evenly distributed\nbetween the caveolar and noncaveolar membrane regions.\nKATP channels form as 4\u00014 octomers of Kir6 pore-forming\nsubunits and sulfonylurea receptor (SUR) proteins.27 The\ndominant channel in most vascular smooth muscle most\nlikely comprises Kir6.1\/SUR2B subunits.28 To determine the\ndistribution of KATP channels between the isolated membrane\nfractions, we used an antibody directed against the Kir6.1\nsubunit. We detected the presence of Kir6.1 predominantly in\nthe buoyant, caveolin-enriched fraction of the membrane\n(Figure 4A, top). Importantly, preincubation of the Kir6.1\nantibody with a blocking peptide representing the unique\nantigenic carboxyl-terminal sequence of Kir6.1 specifically\nreduced the ability of the antibody to detect this protein band\n(Figure 4A, bottom).\nTo verify our membrane fractionation results by an inde-\npendent method, we undertook coimmunoprecipitation exper-\niments. Aside from being the major structural component of\ncaveolae, caveolins also act as scaffold proteins that interact\nwith many caveolae-localized signaling molecules.29 We\ntherefore hypothesized that if Kir6.1 was indeed resident\nwithin caveolae it might be possible to coimmunoprecipitate\nKir6.1 with caveolin. Figure 4B shows that antibodies spe-\ncific to Kir6.1 were able to isolate all three isoforms of\ncaveolin from rat aortic homogenates, suggesting that Kir6.1\nand caveolin exist together in a complex in intact cells. This\ncomplex may arise through direct protein-protein interaction\nbetween Kir6.1 and caveolin or by virtue of the fact that these\nproteins localize to a membrane microdomain that remains\nintact throughout the immunoprecipitation process. If this\nlatter case is true, the interaction between Kir6.1 and caveolin\nshould be abolished by the disruption of the caveolar mem-\nbrane compartment. The integrity of lipid microdomains such\nas caveolae is heavily dependent on cholesterol. Cholesterol\ndepletion profoundly alters caveolar structure leading to a\nflattening, or total disappearance, of these membrane invagi-\nnations30,31 and dissociation of sequestered proteins from\nthese domains.15,32 We pretreated strips of rat aorta with the\ncholesterol-depleting agent, methyl-\u0001-cyclodextrin19,20 for 1\nto 2 hours before performing the coimmunoprecipition assay\nand found that cholesterol depletion had no effect on the\nability of the antibody against Kir6.1 to isolate caveolin\n(Figure 4B, bottom), suggesting that association between\nKir6.1 and caveolin may be via specific protein-protein\ninteractions. This ability to isolate caveolin from smooth\nmuscle homogenates was specific to the Kir6.1 antibody\nbecause antibodies directed against the clathrin-coated pit\nFigure 2. Separation of caveolar and noncaveolar membrane\nfractions from rat aortic smooth muscle cells. A, Western blot\nanalysis of ten 1-mL fractions collected from the top to the bot-\ntom of a discontinuous sucrose density gradient to determine\nthe localization of the caveolae membrane marker, caveolin-1\n(top) and the noncaveolar, clathrin-coated pit protein, \u0001-adaptin\n(bottom). B, Relative cholesterol levels in each of the fractions\nshown in A.\nFigure 3. Adenylyl cyclase localizes to caveolar membrane frac-\ntions. A and B, Western blot analysis of whole cell lysates\n(WCL), cholesterol-rich, caveolin-containing (Cav), and non-\ncaveolin (Non-Cav) membrane fractions isolated from cultured\nrat aortic smooth muscle cells. Caveolae marker protein, caveo-\nlin (isoforms 1, 2, and 3) sedimented to the buoyant, caveolar\nfraction, whereas \u0001-adaptin, a protein associated with clathrin-\ncoated pits, was primarily localized to the noncaveolar mem-\nbranes (A). Adenylyl cyclase (AC) isoforms 3 and 5\/6 localized\npredominantly to the buoyant caveolin-enriched membrane frac-\ntions (B). The antibody used to detect AC5\/6 cannot distinguish\nbetween these isoforms. Other proteins such as the regulatory\nsubunit of PKA (RII\u0002 and RII\u0001) were more evenly distributed\nbetween caveolar and noncaveolar membranes.\nSampson et al Arterial KATP Channels Localize to Caveolae 1015\n at University of Leicester (lei) \/ England on August 19, 2013http:\/\/circres.ahajournals.org\/Downloaded from \nprotein \u0001-adaptin failed to coprecipitate any caveolin iso-\nforms (Figure 4C).\nBiochemical data therefore suggest compartmentation of\nboth KATP channels and adenylyl cyclase in smooth muscle\ncaveolae. To determine whether this colocalization has func-\ntional significance, we investigated the effect of disrupting\ncaveolae on the PKA-dependent tonic activation of KATP\nchannels. We pretreated suspensions of isolated smooth\nmuscle cells with methyl-\u0001-cyclodextrin for 1 to 2 hours\nbefore recording whole-cell currents induced by the KATP\nchannel opener, pinacidil (10 \u0003mol\/L). In these experiments,\nthe application of 100 \u0003mol\/L of the PKA inhibitor Rp-\ncAMPS to control cells caused a 41.4\u00075.8% (n\b7) inhibition\nof the whole cell pinacidil-induced current (Figure 5A). This\nPKA-sensitive component of the whole cell KATP current was\nsignificantly reduced in cholesterol-depleted cells, where\napplication of 100\u0003mol\/L Rp-cAMPS inhibited only\n11.7\u00075.0% of the evoked current (Figure 5B, n\b7, P\t0.01).\nThis suggests that in cholesterol-depleted cells, KATP channels\nare no longer subject to a high level of tonic PKA-dependent\nactivation. Depletion of cholesterol with methyl-\u0001-\ncyclodextrin has previously been shown to have no effect on\nforskolin-stimulated adenylyl cyclase activity.33 Similarly,\nthe ability of the KATP channel to respond to the opener\npinacidil was essentially the same in control and depleted\ncells, suggesting that the channel itself was largely unaffected\nby reduced cholesterol levels. Although we did not observe a\nsignificant reduction in current density in cholesterol-\ndepleted cells as might be expected if a sustained background\ndrive on the channel has been reduced (Figure 5D), such a\nchange would be hard to detect because of the high cell-to-\ncell variability of whole cell current amplitudes induced by\npinacidil. Near complete inhibition of tonic PKA drive by the\npotent blocker of adenylyl cyclase, 2\u0006,5\u0006-dideoxyadenosine,\ndid produce a significant reduction in evoked KATP current\n(Figure 1F). We suggest that to be susceptible to PKA-\ndependent regulation, KATP channels need to be localized in\nthe same lipid compartment as adenylyl cyclase, and that\ndisruption of the caveolae by cholesterol depletion reduces\nthe PKA-sensitive component of the KATP current by func-\ntionally uncoupling adenylyl cyclase and the channel.\nDiscussion\nOur findings suggest a functional compartmentation of KATP\nchannels and their upstream signaling partner adenylyl cy-\nclase in specialized signaling “pockets” formed on the surface\nof smooth muscle cells by caveolae. Arterial KATP channels\nare subject to sustained tonic activation by cAMP-dependent\nprotein kinase (PKA), which we show originates from the\nconstitutive activity of the enzyme adenylyl cyclase. Physio-\nlogically, this tonic KATP channel activation is likely to\nmaintain a background level of channel activity that contrib-\nutes a vasodilating drive to resting vascular tone. The evi-\ndence that KATP channel activity lowers resting vascular\nresistance is especially clear in the coronary circulation,\nwhere KATP channel blockade increases vascular resistance\nand reduces coronary blood flow in several species including\nman.34–36 Similar findings have been reported in the systemic\ncirculation.37,38 Furthermore, removal of the resting vasodi-\nlator contribution of KATP channels in transgenic mice leads to\narterial hypercontractility and hypertension.7,8\nIn smooth muscle cells, adenylyl cyclase resides predom-\ninantly in caveolae, small vesicular invaginations of the\nplasma membrane that associate with the cholesterol-binding\nprotein caveolin.11,12 These specialized lipid microdomains\nhave previously been implicated in generating subcellular\nsignaling compartments by aggregating interacting signaling\nmolecules.13–16 We find that, like adenylyl cyclase, KATP\nchannels localize to the same cholesterol-enriched smooth\nmuscle membrane fractions as the caveolae marker caveolin.\nAdditionally, an antibody specific to the pore-forming sub-\nunit of KATP channels coimmunoprecipitates caveolin from\narterial homogenates, suggesting that KATP channels and\ncaveolin exist together in a complex within cells. This\nassociation could be via specific protein-protein interactions\nbetween Kir6.1 and caveolin, a known scaffold protein that\ninteracts with many caveolae-localized signaling molecules,29\nFigure 4. A, Kir6.1 localizes primarily to the caveolin-rich (Cav)\nmembrane fraction of rat aortic smooth muscle lysates. B,\nCaveolin isoforms 1, 2, and 3 coimmunoprecipitate with Kir6.1.\nCoimmunoprecipitation was performed by incubation of pre-\ncleared rat aortic homogenates with antibodies directed against\nKir6.1 or preimmune IgG, followed by precipitation of immuno-\ncomplexes with protein-A agarose. Precipitated proteins were\nimmunoblotted with antibodies against the caveolin isoforms.\n10% of whole cell lysates was run in the input lane. Pretreat-\nment of rat aorta with methyl-\u0001-cyclodextrin (2%) before ho-\nmogenization did not affect the ability of anti-Kir6.1 antibodies\nto coprecipitate caveolin-1. C, Caveolin isoforms failed to\ncoprecipitate with antibodies directed against the clathrin-\ncoated pit protein \u0001-adaptin.\n1016 Circulation Research November 12, 2004\n at University of Leicester (lei) \/ England on August 19, 2013http:\/\/circres.ahajournals.org\/Downloaded from \nor by virtue of the fact that both proteins reside in a lipid\ncompartment that remains intact throughout the immunopre-\ncipitation process. The voltage-gated potassium channel, Kv1.5,\nfor example, targets to caveolae and coimmunoprecipitates with\ncaveolin-139 through Kv1.5-mediated immunoisolation of a\nprotein-lipid complex harboring caveolin. Our results show that\nexposure to the cholesterol-depleting agent methyl-\u0001-\ncyclodextrin has no effect on the ability of antibodies directed\nagainst Kir6.1 to coprecipitate caveolin, suggesting a tight\nassociation between the proteins is maintained following disrup-\ntion of their native lipid environment. This points to a direct\nprotein-protein interaction between Kir6.1 and caveolin, an idea\nthat is supported by the finding that antibodies against another\ncaveolae-resident protein, adenylyl cyclase, failed to coprecipi-\ntate caveolin (data not shown).\nThe integrity of the membrane compartments generated by\ncaveolae seems important in maintaining normal KATP channel\nregulation. This is demonstrated by the finding that disruption of\ncaveolae by cholesterol depletion significantly reduces the PKA-\nsensitive component of KATP channel current, indicating that\ntonic PKA-dependent channel activation may rely on the spatial\nconfinement of adenylyl cyclase and KATP channels. This would\nbe consistent with previous findings in cardiac muscle that show\nthat the distance cAMP can diffuse from its site of production\n(ie, adenylyl cyclase) is severely restricted by the action of\nphosphodiesterases.23 The major target for cAMP, PKA, is\ngenerally anchored in close proximity to its intended substrate\nthrough the action of A-kinase anchoring proteins or\nAKAPs,40–42 and we have previously demonstrated the involve-\nment of an unidentified AKAP in both steady state and receptor-\ndriven activation of KATP channels.24 Recent evidence suggests\nthat PKA phosphorylates sites on the channel subunits them-\nselves to cause activation.43 It seems likely that efficient PKA-\ndependent channel regulation will depend on KATP channels and\ntheir associated kinases being in the vicinity of cAMP produc-\ntion and therefore adenylyl cyclase.\nThe compartmentation of adenylyl cyclase and KATP channels\npresumably represents just one element of the signaling machin-\nery surrounding these channels. Opening of arterial KATP chan-\nnels causes membrane hyperpolarization, a decrease in Ca2\u0001\ninflux through voltage-dependent L-type Ca2\u0001 channels and\nvasorelaxation. Thus, vasodilators open KATP channels, whereas\nvasoconstrictors close them, and such modulation probably\nrepresents a major component of their physiological regulation.\nMany vasodilators elevate KATP channel activity by acting at\nGs-coupled receptors to stimulate adenylyl cyclase and activate\nPKA.3 Additionally, vasoconstrictors such as angiotensin II that\nactivate Gq\/11-coupled receptors to inhibit KATP channels via\nstimulation of protein kinase C may also suppress KATP channel\nactivity by Gi\/o-mediated inhibition of adenylyl cyclase and a\nreduction in steady-state PKA-dependent channel phosphoryla-\ntion.22 Adenylyl cyclase is therefore a pivotal enzyme in both\ntonic and receptor-driven regulation of KATP channels, and its\nlocalization to caveolae, which in other tissues have been shown\nto be highly enriched with both G protein–coupled receptors and\nG proteins,14,16 makes it likely that larger, more elaborate\nsignaling complexes exist within these domains. Caveolae have\nalready been implicated as integration sites for smooth muscle\nCa2\u0001 signaling because of their ability to aggregate proteins\ninvolved in Ca2\u0001 regulation and excitation-contraction cou-\npling.44,45 The subcellular distribution of the major receptors that\ncouple to arterial KATP channels is largely unknown, but acti-\nvated receptors for angiotensin II have been shown to congregate\nin caveolae of rat aortic smooth muscle.26,31 Finally, it is worth\nnoting that phosphatidylinositol-4,5-bisphosphate (PIP2), an im-\nportant determinant of KATP channel activity and otherwise\nminor phospholipid component of the bilayer, is greatly concen-\ntrated in caveolae.46 Thus, by sequestering both proteins and\nlipids necessary for normal channel function, caveolae may be\nused by smooth muscle as a means of compartmentalizing and\norganizing the complex regulatory pathways that modulate KATP\nchannel activity and so vascular tone.\nAcknowledgments\nWe thank the British Heart Foundation, The Royal Society, and the\nWellcome Trust for their support. We also thank Diane Everitt for\ntechnical assistance.\nFigure 5. Functional uncoupling of adenylyl\ncyclase regulation of KATP channels by cholesterol\ndepletion. Whole cell current recorded under iden-\ntical conditions to Figure 1 from a single isolated\nrat mesenteric smooth muscle cell under control\n(A) or cholesterol-depleted conditions (B). Choles-\nterol was depleted from smooth muscle mem-\nbranes by incubation of cell suspensions with 2%\nmethyl-\u0001-cyclodextrin. C, Mean inhibition by\nRp-cAMPS, and D, mean amplitude of\nglibenclamide-sensitive current in experiments like\nthose of A and B. (C, n\b7,7 cells; **P\t0.01, t test;\nD, n\b10, 8).\nSampson et al Arterial KATP Channels Localize to Caveolae 1017\n at University of Leicester (lei) \/ England on August 19, 2013http:\/\/circres.ahajournals.org\/Downloaded from \nReferences\n1. Ashcroft FM, Gribble FM. Correlating structure and function in ATP-\nsensitive K\u0001 channels. Trends Neurosci. 1998;21:288–294.\n2. Yokoshiki H, Sunagawa M, Seki T, Sperelakis N. ATP-sensitive K\u0001\nchannels in pancreatic, cardiac, and vascular smooth muscle cells. Am J\nPhysiol. 1998;43:C25–C37.\n3. Quayle JM, Nelson MT, Standen NB. ATP-sensitive and inwardly rec-\ntifying potassium channels in smooth muscle. Physiol Rev. 1997;77:\n1165–1232.\n4. Clapp LH, Tinker A. Potassium channels in the vasculature. Curr Opin\nNephrol Hypertens. 1998;7:91–98.\n5. Suzuki M, Li RA, Miki T, Uemura H, Sakamoto N, Ohmoto-Sekine Y,\nTamagawa M, Ogura T, Seino S, Marban E, Nakaya H. Functional roles\nof cardiac and vascular ATP-sensitive potassium channels clarified by\nKir6.2-knockout mice. Circ Res. 2001;88:570–577.\n6. Janhangir A, Terzic A, Shen WK. Potassium channel openers: therapeutic\npotential in cardiology and medicine. Expert Opin Pharmacother. 2001;\n2:1995–2010.\n7. Miki T, Suzuki M, Shibasaki T, Uemura H, Sato T, Yamaguchi K, Koseki\nH, Iwanaga T, Nakaya H, Seino S. Mouse model of Prinzmetal angina by\ndisruption of the inward rectifier Kir6.1. Nat Med. 2002;8:466–472.\n8. Chutkow WA, Pu JL, Wheeler MT, Wada T, Makielski JC, Burant CF,\nMcNally EM. Episodic coronary artery vasospasm and hypertension\ndevelop in the absence of SUR2 K-ATP channels. J Clin Invest. 2002;\n110:203–208.\n9. Salzman AL, Vromen A, Denenberg A, Szabo C. K-ATP-channel inhi-\nbition improves hemodynamics and cellular energetics in hemorrhagic\nshock. Am J Physiol. 1997;272:H688–H694.\n10. Gardiner SM, Kemp PA, March JE, Bennett T. Regional haemodynamic\nresponses to infusion of lipopolysaccharide in conscious rats: effects of\npre- or post-treatment with glibenclamide. Br J Pharmacol. 1999;128:\n1772–1778.\n11. Ostrom RS, Liu XQ, Head BP, Gregorian C, Seasholtz TM, Insel PA.\nLocalization of adenylyl cyclase Isoforms and G protein-coupled\nreceptors in vascular smooth muscle cells: expression in caveolin-rich and\nnoncaveolin domains. Mol Pharmacol. 2002;62:983–992.\n12. Cooper DMF. Regulation and organization of adenylyl cyclases and\ncAMP. Biochem J. 2003;375:517–529.\n13. Lisanti MP, Scherer PE, Vidugiriene J, Tang Z, Hermanowski-Vosatka A,\nTu YH, Cook RF, Sargiacomo M. Characterization of caveolin-rich\nmembrane domains isolated from an endothelial-rich source: implications\nfor human-disease. J Cell Biol. 1994;126:111–126.\n14. Razani B, Woodman SE, Lisanti MP. Caveolae: from cell biology to\nanimal physiology. Pharmacol Rev. 2002;54:431–467.\n15. Foster LJ, de Hoog CL, Mann M. Unbiased quantitative proteomics of\nlipid rafts reveals high specificity for signaling factors. Proc Natl Acad\nSci U S A. 2003;100:5813–5818.\n16. Anderson RGW. The caveolae membrane system. Ann Rev Biochem.\n1998;67:199–225.\n17. Sampson LJ, Leyland ML, Dart C. Direct interaction between the actin-\nbinding protein filamin-A and the inwardly rectifying potassium channel,\nKir2.1. J Biol Chem. 2003;278:41988–41997.\n18. Song KS, Li SW, Okamoto T, Quilliam LA, Sargiacomo M, Lisanti MP.\nCo-purification and direct interaction of Ras with caveolin, an integral\nmembrane protein of caveolae microdomains. Detergent-free purification\nof caveolae membranes. J Biol Chem. 1996;271:9690–9697.\n19. Yancey PG, Rodriqueza WV, Kilsdonk EPC, Stoudt GW, Johnson WJ,\nPhillips MC, Rothblat GH. Cellular cholesterol effect mediated by cyclo-\ndextrins: demonstration of kinetic pools and mechanism of efflux. J Biol\nChem. 1996;271:16026–16034.\n20. Kilsdonk EPC, Yancey PG, Stoudt GW, Bangerter FW, Johnson WJ,\nPhillips MC, Rothblat GH. Cellular cholesterol efflux mediated by cyclo-\ndextrins. J Biol Chem. 1995;270:17250–17256.\n21. McCabe JB, Berthiaume LG. N-terminal protein acylation confers local-\nization to cholesterol, sphingolipid-enriched membranes but not to lipid\nrafts\/caveolae. Mol Biol Cell. 2001;12:3601–3617.\n22. Hayabuchi Y, Davies NW, Standen NB. Angiotensin II inhibits rat arte-\nrial K-ATP channels by inhibiting steady-state protein kinase A activity\nand activating protein kinase Ca. J Physiol. 2001;530:193–205.\n23. Zaccolo M, Pozzan T. Discrete microdomains with high concentration of\ncAMP in stimulated rat neonatal cardiac myocytes. Science. 2002;295:\n1711–1715.\n24. Hayabuchi Y, Dart C, Standen NB. Evidence for involvement of A-kinase\nanchoring protein in activation of rat arterial K-ATP channels by protein\nkinase A. J Physiol. 2001;536:421–427.\n25. Ishikawa Y, Homcy CJ. The adenylyl cyclases as integrators of trans-\nmembrane signal transduction. Circ Res. 1997;80:297–304.\n26. Ishizaka N, Griendling KK, Lassegue B, Alexander RW. Angiotensin II\ntype 1 receptor: relationship with caveolae and caveolin after initial\nagonist stimulation. Hypertension. 1998;32:459–466.\n27. Aguilar-Bryan L, Clement JP, Gonzalez G, Kunjilwar K, Babenko A,\nBryan J. Toward understanding the assembly and structure of K-ATP\nchannels. Physiol Rev. 1998;78:227–245.\n28. Seino S, Miki T. Physiological and pathophysiological roles of ATP-\nsensitive K\u0001 channels. Prog Biophys Mol Biol. 2003;81:133–176.\n29. Couet J, Li SW, Okamoto T, Ikezu T, Lisanti MP. Identification of\npeptide and protein ligands for the caveolin-scaffolding domain. Impli-\ncations for the interaction of caveolin with caveolae-associated proteins.\nJ Biol Chem. 1997;272:6525–6533.\n30. Dreja K, Voldstedlund M, Vinten J, Tranum-Jensen J, Hellstrand P,\nSward K. Cholesterol depletion disrupts caveolae and differentially\nimpairs agonist-induced arterial contraction. Arterioscler Thromb Vasc\nBiol. 2002;22:1267–1272.\n31. Ushio-Fukai M, Hilenski L, Santanam N, Becker PL, Ma YX, Griendling\nKK, Alexander RW. Cholesterol detection inhibits epidermal growth\nfactor receptor transactivation by angiotensin II in vascular smooth\nmuscle cells: role of cholesterol-rich microdomains and focal adhesions\nin angiotensin II signaling. J Biol Chem. 2001;276:48269–48275.\n32. Simons K, Toomre D. Lipid rafts and signal transduction. Nat Rev Mol\nCell Biol. 2000;1:31–39.\n33. Fagan KA, Smith KE, Cooper DMF. Regulation of the Ca2\u0001-inhibitable\nadenylyl cyclase type VI by capacitative Ca2\u0001 entry requires localization\nin cholesterol-rich domains. J Biol Chem. 2000;275:26530–26537.\n34. Samaha FF, Heineman FW, Ince C, Fleming J, Balaban RS. ATP-\nsensitive potassium channel is essential to maintain basal coronary\nvascular tone in vivo. Am J Physiol. 1992;262:C1220–C1227.\n35. Duncker DJ, Oei HH, Hu F, Stubenitsky R, Verdouw PD. Role of KATP\nchannels in regulation of systemic, pulmonary, and coronary vasomotor\ntone in exercising swine. Am J Physiol. 2001;280:H22–H33.\n36. Farouque HM, Worthley SG, Meredith IT, Skyrme-Jones RA, Zhang MJ.\nEffect of ATP-sensitive potassium channel inhibition on resting coronary\nvascular responses in humans. Circ Res. 2002;90:231–236.\n37. Moreau R, Komeichi H, Kirstetter P, Yang S, Aupetit-Faisant B, Cailmail\nS, Lebrec D. Effects of glibenclamide on systemic and splanchnic hae-\nmodynamics in conscious rats. Br J Pharmacol. 1994;112:649–653.\n38. Gardiner SM, Kemp PA, March JE, Fallgren B, Bennett T. Effects of\nglibenclamide on the regional haemodynamic actions of alpha-trinositol\nand its influence on responses to vasodilators in conscious rats. Br J\nPharmacol. 1996;117:507–515.\n39. Martens JR, Sakamoto N, Sullivan SA, Grobaski TD, Tamkun MM.\nIsoform-specific localization of voltage-gated K\u0001 channels to distinct\nlipid raft populations: targeting of Kv1.5 to caveolae. J Biol Chem.\n2001;276:8409–8414.\n40. Feliciello A, Gottesman ME, Avvedimento EV. The biological functions\nof A-kinase anchor proteins. J Mol Biol. 2001;308:99–114.\n41. Colledge M, Scott JD. AKAPs: from structure to function. Trends Cell\nBiol. 1999;9:216–221.\n42. Dodge K, Scott JD. AKAP79 and the evolution of the AKAP model.\nFEBS Lett. 2000;476:58–61.\n43. Quinn KV, Giblin JP, Tinker A. Multisite phosphorylation mechanism for\nprotein kinase A activation of the smooth muscle ATP-sensitive\npotassium channel. Circ Res. 2004;94:1359–1366.\n44. Darby PJ, Kwan CY, Daniel EE. Caveolae from canine airway smooth\nmuscle contain the necessary components for a role in Ca2\u0001 handling.\nAm J Physiol. 2000;279:L1226–L1235.\n45. Taggart MJ. Smooth muscle excitation-contraction coupling: a role for\ncaveolae and caveolins? News Physiol Sci. 2001;16:61–65.\n46. Pike LJ, Casey L. Localization and turnover of phosphatidylinositol\n4,5-bisphosphate in caveolin-enriched membrane domains. J Biol Chem.\n1996;271:26453–26456.\n1018 Circulation Research November 12, 2004\n at University of Leicester (lei) \/ England on August 19, 2013http:\/\/circres.ahajournals.org\/Downloaded from \n"}