{"doi":"10.1109\/ICSPS.2009.71","coreId":"102782","oai":"oai:epubs.surrey.ac.uk:2320","identifiers":["oai:epubs.surrey.ac.uk:2320","10.1109\/ICSPS.2009.71"],"title":"Conditional Probability Based Steganalysis for JPEG Steganography","authors":["Wahab, AWA","Briffa, JA","Schaathun, HG","Ho, Anthony"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-07-17","abstract":"Inspired by works on the Markov process based steganalysis proposed in [13], we propose a new steganalysis technique based on the conditional probability statistics. Specifically we focus on its performance against the F5 software. In our experiment, we prove that the proposed technique works as well or better than the Markov process based technique in terms of classification accuracy on F5. Our main advantage is a much better computational efficiency. With different number of messages embedded, it can also be seen that the performance of steganalyis depends on the message size embedded. This paper includes the introduction to conditional probability features, how\\ud\nthe experiment works, and the discussion of the results","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2320<\/identifier><datestamp>\n      2017-06-30T14:43:35Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:63637372<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2320\/<\/dc:relation><dc:title>\n        Conditional Probability Based Steganalysis for JPEG Steganography<\/dc:title><dc:creator>\n        Wahab, AWA<\/dc:creator><dc:creator>\n        Briffa, JA<\/dc:creator><dc:creator>\n        Schaathun, HG<\/dc:creator><dc:creator>\n        Ho, Anthony<\/dc:creator><dc:description>\n        Inspired by works on the Markov process based steganalysis proposed in [13], we propose a new steganalysis technique based on the conditional probability statistics. Specifically we focus on its performance against the F5 software. In our experiment, we prove that the proposed technique works as well or better than the Markov process based technique in terms of classification accuracy on F5. Our main advantage is a much better computational efficiency. With different number of messages embedded, it can also be seen that the performance of steganalyis depends on the message size embedded. This paper includes the introduction to conditional probability features, how\\ud\nthe experiment works, and the discussion of the results.<\/dc:description><dc:date>\n        2009-07-17<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2320\/1\/SRF002296.pdf<\/dc:identifier><dc:identifier>\n          Wahab, AWA, Briffa, JA, Schaathun, HG and Ho, Anthony  (2009) Conditional Probability Based Steganalysis for JPEG Steganography  In: International Conference on Signal Processing Systems 2009, 15 - 17 May 2009, Singapore.     <\/dc:identifier><dc:relation>\n        http:\/\/ieeexplore.ieee.org\/xpls\/abs_all.jsp?arnumber=5166776<\/dc:relation><dc:relation>\n        10.1109\/ICSPS.2009.71<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2320\/","http:\/\/ieeexplore.ieee.org\/xpls\/abs_all.jsp?arnumber=5166776","10.1109\/ICSPS.2009.71"],"year":2009,"topics":[],"subject":["Conference or Workshop Item","PeerReviewed"],"fullText":"Conditional Probability Based Steganalysis for\nJPEG Steganography\nAinuddin Wahid Wahab1,2, Johann A Briffa1, Hans Georg Schaathun1 and Anthony TS Ho1\n1Department of Computing\nUniversity of Surrey\nSurrey, United Kingdom\n2Department of Computer System and Technology\nUniversity of Malaya\nKuala Lumpur, Malaysia\nEmail: a.abdulwahab@surrey.ac.uk\nAbstract—Inspired by works on the Markov process based\nsteganalysis proposed in [13], we propose a new steganalysis\ntechnique based on the conditional probability statistics. Specif-\nically we focus on its performance against the F5 software. In\nour experiment, we prove that the proposed technique works\nas well or better than the Markov process based technique in\nterms of classification accuracy on F5. Our main advantage is a\nmuch better computational efficiency. With different number of\nmessages embedded, it can also be seen that the performance of\nsteganalyis depends on the message size embedded. This paper\nincludes the introduction to conditional probability features, how\nthe experiment works, and the discussion of the results.\nI. INTRODUCTION\nSteganography allows a user to hide a secret message in\nsuch a way that an adversary will not be able to detect the\nexistence of the secret. Steganography can be dated back to\n440 BC, where the tale of Demaratus sending a warning by\nusing a wax tablet and Histiaeus using a tattoo on his slave’s\nshaved head were mentioned by Herodotus in The Histories\nof Herodotus [11].\nA steganography system can be considered defeated if an\nattacker is able to prove the existence of a secret message\n[9]. If a steganography system fails to disguise the embedded\ninformation, there is no point in using it since the aim for\nhaving a secretive communication has now been exposed.\nOver the last decade a wide range of steganography tech-\nniques have appeared in the literature. Similarly, a wide range\nof steganalysis techniques were also made available, intended\nto let an adversary determine whether an intercepted image\ncontains a secret message. In particular, a number of steganal-\nysis techniques based on machine learning have also emerged\n[10] [13]. Such techniques tend to be blind, in the sense that\nthey do not assume any particular steganography algorithm\nand can usually break a variety of algorithms. Other methods\nthat are specific to certain technique of steganography, such\nas proposed in [7], are categorized as non-blind techniques.\nIn this paper, the focus is on the steganalysis of JPEG\nsteganography [2], particularly because JPEG is the most\npopular image format on the Internet. Steganographic images\ncan be shared by employing a sending and receiving process,\nor just by placing it on a web page for the receiver to browse\nand extract the message without being noticed. By focusing\non steganalysis for JPEG steganography, this research should\nbe of benefit in the general steganalysis research domain and\nalso be of relevance to the real world implementation of\nsteganalysis, such as in digital forensic investigation.\nThis paper consists of four sections, and starts with a review\non estimated conditional probability features. Following that,\nSection 2 presents the description of our works. Section\n3 contains the findings and finally Section 4 discusses the\nconclusion of the research.\nII. CONDITIONAL PROBABILITY FEATURES\nThe revised probability of B when it is known that A has\noccurred is called the conditional probability of B given A [3]\nand is defined by the formula\nP (B | A) = P (AB)\nP (A)\nFigure 1 illustrates P (A), P (B) and P (AB) using a Venn\ndiagram. Based on the concept of conditional probability,\nthe features for our experiment are collected in horizontal,\nvertical and diagonal directions from JPEG coefficient values\nas shown in Figure 2. For each direction, p, q, r, x, y and z\nwill traverse throughout the JPEG coefficient (8×8 block) in\nhorizontal, vertical and diagonal directions, accordingly. This\nnew approach is different than the Markov process approach\n[13], where the statistics are calculated by considering each\nentity in JPEG coefficient.\nDefinition 1: The JPEG coefficient values consists of all\nthe JPEG coefficients which have been quantized with the\nJPEG quantization table but have not been zig-zag scanned,\nrun-length coded and Huffman coded from JPEG encoding\nprocess.\nIn the Markov process approach [13], the features are col-\nlected by comparing all the values in the JPEG 2-D coefficient\narray. In this new technique, the statistics are collected in\nblock basis and only certain values from the block were used\nto generate the statistics. We also exclude the DC coefficient\nvalue for each block as can be seen in Figure 2.\n2009 International Conference on Signal Processing Systems\n978-0-7695-3654-5\/09 $25.00 © 2009 IEEE\nDOI 10.1109\/ICSPS.2009.71\n205\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 16:22:10 UTC from IEEE Xplore.  Restrictions apply. \nFig. 1: Venn diagram illustrates P (A), P (B), and P (AB)\nFig. 2: Conditional probability directions : horizontal, vertical and diagonal\nFor our experiment (Figure 2), we consider six precondi-\ntions (event A)\nA1 : p < q, A4 : x < y,\nA2 : p > q, A5 : x > y,\nA3 : p = q, A6 : x = y.\nNext, we consider six probabilities (event B)\nB1 : r < q, B4 : z < y\nB2 : r > q, B5 : z > y\nB3 : r = q, B6 : z = y\nFor three different directions, we calculate 54 statistics (18\nstatistics for each horizontal, vertical and diagonal directions)\nvalues in total\nXi,j = p̂(Bi | Aj),\nj = 1,2,3,4,5,6 and\ni =\n{\n1, 2, 3 j≤3,\n4, 5, 6 j≥4.\nIII. TASK\nTo evaluate the performance of the proposed steganalysis\nalgorithm on F5 [2], we used a combination of online database\nand our own captured images to have a sufficient number of\ntraining and testing images. All images were decompressed,\ncropped to the center of 640x480 pixels, and then compressed\nwith a quality factor of 75 in JPEG image format. The crop-\nping technique can help to ensure that the image dimensions\nare not correlated with spatial characteristics, such as noise or\nlocal energy [4]\nAfter the image preparation process, all the images under-\ngone the F5 encoding process to produce sets of stego images\nbased on the size of the embedded message. The message is\nan image with variable file sizes, ranging from 4096 bytes,\n1848 bytes, and the smallest is 618 bytes. These contribute to\nthree different sets of stego images as shown in Table I. With\nthe cover and stego images ready, the proposed technique is\nconducted to produce the features for the subsequent classi-\nfication process. The freely available LibSVM [5] was then\nused as the classifier.\nFor SVM, the soft margin and γ parameters are determined\nusing parameter selection tool, ’grid.py’ that was available\nfrom the LibSVM package. Figure 3 shows the result of\n’grid.py’ (contour of cross-validation accuracy) for our pro-\nposed method.\nIV. RESULTS AND DISCUSSIONS\nAs reported in [6] and [10], classification accuracy was used\nto measure the performance of the proposed technique. From\nTable I, it can be seen that our proposed technique works\non F5 steganography method. While having a classification\naccuracy of 97.2% for a message size of 4096 bytes, the\naccuracy increased with the rate of 99.6% for a message size of\n1848 bytes and 99.8% for a message size of 618 bytes. Using\nconfidence interval estimation technique [3], we also have\ncomputed with 95.0% confidence intervals for the accuracy\nof the steganalysis technique.\nFor comparison purposes, we implemented two previously\nproposed steganalysis methods. The first one is based on the\nMarkov process proposed in [13], and the second technique\nis based on the higher-order statistic of wavelet component\n(wavelet decomposition) proposed by Lyu and Farid in [10].\n206\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 16:22:10 UTC from IEEE Xplore.  Restrictions apply. \n(a) (b)\n(c)\nFig. 3: Conditional probability based steganalysis classification parameters selection process with different embedded message\nsize; (a)4096 bytes, (b)1848 bytes and (c)618 bytes.\nUsing a total of 5235 images with size of 640×480 pixels\nand message sizes of 4096, 1848 and 618 bytes, the perfor-\nmance of the three steganalysis approaches were measured\n(Table I).\nFor reference purposes, we have made our own simulation\nof Lyu-Farid’s algorithm, and we note that our results are\nconsistent with those of [1]. Our results also consistent with\nwhat published in [13] for Markov process based steganalysis.\nIn Table I, for message size of 618 bytes, we note that\nthe 95% confidence intervals do not overlap, which clearly\nmeans that our algorithm is significantly more accurate in this\ncase. However, there is an overlap on confidence intervals for\nmessage size of 1848 bytes. Although, there is no statistically\nsignificant conclusion in this case, this result still shows\nthat our proposed method is more accurate for the predicted\naccuracy.\nFurthermore, it can be seen from Table II that our pro-\nposed method needs only 1140 CPU-milliseconds compared to\n130260 CPU-milliseconds by the Markov process and 10910\nCPU-milliseconds by wavelet decomposition techniques for\nfeatures extraction process of 10 sample images on a standard\nDell Optiplex 755 machine with 2.33GHz Intel Core2 Duo\nprocessor.\nDefinition 2: The CPU-milliseconds is the amount of time\nthe central processing unit (CPU) executes a particular instruc-\ntion within a computer program.\nThere is still another advantage, where our proposed method\nonly used 54 feature vectors compared to 324 features in\n207\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 16:22:10 UTC from IEEE Xplore.  Restrictions apply. \n(a) (b)\n(c)\nFig. 4: Markov process based steganalysis classification parameters selection process with different embedded message size;\n(a)4096 bytes, (b)1848 bytes and (c)618 bytes.\nTABLE I: Classification accuracy with confidence intervals (optimal soft margin and γ parameters)\nMessage Size (bytes)\n4096 1848 618\nConditional Probability 97.2% 99.6% 99.8%\n(95.3%,99.2%) (98.8%,100.0%) (99.3%,100.0%)\nMarkov Model 97.2% 97.2% 97.2%\n(95.3%,99.2%) (95.3%,99.2%) (95.3%,99.2%)\nWavelet Decomposition 60.0% 60.5% 61.5%\n(54.0%,66.1%) (54.4%,66.6%) (55.4%,67.6%)\n208\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 16:22:10 UTC from IEEE Xplore.  Restrictions apply. \nTABLE II: Features Extraction, Training and Classification Time (CPU-milliseconds)\nSteganalysis Techniques\nConditional\nProbability\nMarkov\nProcess\nWavelet Decom-\nposition\nFeatures Extraction (10 images) 1140 130260 10910\nTraining (2480 images) 770 150 2110\nClassification (500 images) 100 100 180\nMarkov process [13] and 72 features in wavelet decomposi-\ntion [10] based steganalysis techniques. This could help to\nreduce the time needed for training and testing, especially\nfor real world implementation. Using SVMLight [8] as the\nclassification tool, our proposed method was shown to be\nfaster in the SVM training (2480 images) and classification\n(500 images) process compared to Farid’s technique (Table II).\nIn addition, the proposed technique works directly on JPEG\ncoefficient values which also means less time spent on the\nfeatures extraction process.\nV. CONCLUSION\nIn this study, we developed a new steganalysis method based\non conditional probability statistics. Based on the hypothesis\nthat F5 steganography leaves statistical artifacts on JPEG\ncoefficient values, our steganalysis technique has shown to\nbe able to exploit those artifacts for the detection process.\nThe feature set was obtained by using estimated conditional\nprobability features that was able to record different patterns in\nthe neighboring pixels in JPEG coefficient values of an image.\nA total of 54 features for each image were collected and then\nused for the classification process. Based on the results espe-\ncially in terms of the computational efficiency, the proposed\nmethod shown to have a better performance compared to the\nMarkov and wavelet decomposition steganalysis techniques on\nF5. Furthermore, the proposed technique also simplifies the\nsteganalysis process by using a smaller number of features and\neasier feature extraction process. The next experiment planned\nfor this research is the testing of this proposed method with\nanother JPEG based steganography techniques such as JSteg\n[15] and Outguess [12]. Since our proposed method works in\nblocking approach, we also look forward for the performance\nof our proposed method with JPEG steganography technique\nthat works on block basis such as YASS [14].\nREFERENCES\n[1] I. Avcibas, M. Kharrazi, N. Memon, and B. Sankur. Image steganalysis\nwith binary similarity measures. EURASIP Journal on Applied Signal\nProcessing 2005:17, 2005.\n[2] A.Westfeld. F5. Software available at http:\/\/www.inf.tu-dresden.de\/\n∼westfeld\/f5.\n[3] G. K. Bhattacharyya and R. A. Johnson. Statistical Concepts and\nMethods. Wiley, 1977.\n[4] R. Bo¨hme. Assessment of steganalytic methods using multiple regres-\nsion models. In Information Hiding, pages 278–295, 2005.\n[5] C.-C. Chang and C.-J. Lin. LIBSVM: a library for support vector\nmachines, 2001. Software available at http:\/\/www.csie.ntu.edu.tw\/∼cjlin\/\nlibsvm.\n[6] H. Farid. Detecting hidden messages using higher-order statistical\nmodels. In International Conference on Image Processing, Rochester,\nNY, 2002.\n[7] J. Fridrich, M. Goljan, and D.Hogea. Steganalysis of jpeg images:\nbreaking the f5 algorithm. in Proc. 5th International Workshop on\nInformation Hiding(IH ’02), pages 310–323, October 2002.\n[8] T. Joachims. SVMLight Support Vector Machine, version 6.01, 2004.\nSoftware available at http:\/\/svmlight.joachims.org\/.\n[9] S. Katzenbeisser and A. P. Fabien. Information Hiding Techniques for\nSteganography and Digital Watermarking. Artech House, 2000.\n[10] S. Lyu and H. Farid. Detecting hidden message using higher-order\nstatistics and support vector machines, 2002.\n[11] F. A. P. Petitcolas, R. J. Anderson, and M. G. Kuhn. Information hiding:\nA survey. Proceedings of the IEEE, special issue on protection of\nmultimedia content, 87(7), pages 1062–1078, July, 1999.\n[12] N. Provos. Defending against statistical steganalysis. 10th USENIX\nSecurity Symposium, pages 323–335, 2001.\n[13] Y. Q. Shi, C. Chen, and W. Chen. A markov process based approach\nto effective attacking jpeg steganography. In Information Hiding, pages\n249–264, 2006.\n[14] K. Solanki, A. Sarkar, and B. S. Manjunath. Yass: Yet another stegano-\ngraphic scheme that resists blind steganalysis. In 9th International\nWorkshop on Information Hiding, Jun 2007.\n[15] D. Upham. Jpeg-jsteg-v4. http:\/\/www.nic.funet.fi\/pub\/crypt\/\nsteganography.\n209\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 16:22:10 UTC from IEEE Xplore.  Restrictions apply. \n"}