{"doi":"10.1088\/0953-4075","coreId":"66415","oai":"oai:dro.dur.ac.uk.OAI2:1564","identifiers":["oai:dro.dur.ac.uk.OAI2:1564","10.1088\/0953-4075"],"title":"Single-impulse magnetic focusing of launched cold atoms.","authors":["Pritchard, M. J.","Arnold, A. S.","Smith, D. A.","Hughes, I. G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-11","abstract":"We have theoretically investigated the focusing of a launched cloud of cold atoms. Time-dependent spatially-varying magnetic fields are used to impart impulses leading to a three-dimensional focus of the launched cloud. We discuss possible coil arrangements for a new focusing regime: isotropic 3D focusing of atoms with a single-impulse magnetic lens. We investigate focusing aberrations and find that, for typical experimental parameters, the widely used assumption of a purely harmonic lens is often inaccurate. The baseball lens offers the best possibility for isotropically focusing a cloud of weak-field-seeking atoms in 3D","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66415.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1564\/1\/1564.pdf","pdfHashValue":"87aec390e7263925ccd4c083b0b9cc382f72a100","publisher":"Institute of Physics","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1564<\/identifier><datestamp>\n      2011-08-09T09:42:02Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Single-impulse magnetic focusing of launched cold atoms.<\/dc:title><dc:creator>\n        Pritchard, M. J.<\/dc:creator><dc:creator>\n        Arnold, A. S.<\/dc:creator><dc:creator>\n        Smith, D. A.<\/dc:creator><dc:creator>\n        Hughes, I. G.<\/dc:creator><dc:description>\n        We have theoretically investigated the focusing of a launched cloud of cold atoms. Time-dependent spatially-varying magnetic fields are used to impart impulses leading to a three-dimensional focus of the launched cloud. We discuss possible coil arrangements for a new focusing regime: isotropic 3D focusing of atoms with a single-impulse magnetic lens. We investigate focusing aberrations and find that, for typical experimental parameters, the widely used assumption of a purely harmonic lens is often inaccurate. The baseball lens offers the best possibility for isotropically focusing a cloud of weak-field-seeking atoms in 3D. <\/dc:description><dc:subject>\n        Current-carrying wires<\/dc:subject><dc:subject>\n         Guiding neutral atoms<\/dc:subject><dc:subject>\n         Cesium atoms<\/dc:subject><dc:subject>\n         Floppy disk<\/dc:subject><dc:subject>\n         Mirror<\/dc:subject><dc:subject>\n         Optics<\/dc:subject><dc:subject>\n         Laser<\/dc:subject><dc:subject>\n         Trap<\/dc:subject><dc:subject>\n         Manipulation<\/dc:subject><dc:subject>\n         Propagation.<\/dc:subject><dc:publisher>\n        Institute of Physics<\/dc:publisher><dc:source>\n        Journal of physics B : atomic, molecular and optical physics, 2004, Vol.37(22), pp.4435-4450 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2004-11<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1564<\/dc:identifier><dc:identifier>\n        issn:0953-4075<\/dc:identifier><dc:identifier>\n        issn: 1361-6455<\/dc:identifier><dc:identifier>\n        doi:10.1088\/0953-4075\/37\/22\/004<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1564\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1088\/0953-4075\/37\/22\/004<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1564\/1\/1564.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1361-6455"," 1361-6455","0953-4075","issn:0953-4075"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Current-carrying wires","Guiding neutral atoms","Cesium atoms","Floppy disk","Mirror","Optics","Laser","Trap","Manipulation","Propagation."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n07 May 2008\nVersion of attached file:\nOther\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nPritchard, M. J. and Arnold, A. S. and Smith, D. A. and Hughes, I. G. (2004) ’Single-impulse magnetic\nfocusing of launched cold atoms.’, Journal of physics B : atomic, molecular and optical physics., 37 (22). pp.\n4435-4450.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1088\/0953-4075\/37\/22\/004\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 3042 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online 25 April 2008 \n \nCitation for item:  \nPritchard, M. J. and Arnold, A. S. and Smith, D. A. and Hughes, I. G. (2004) 'Single-\nimpulse magnetic focusing of launched cold atoms.' , Journal of physics B : atomic, \nmolecular, and optical physics., 37 (22), pp. 4435-4450. \n \nDefinitive version available at:  \nhttp:\/\/dx.doi.org\/10.1088\/0953-4075\/37\/22\/004 \nar\nX\niv\n:p\nhy\nsic\ns\/0\n70\n12\n72\nv3\n  [\nph\nys\nics\n.at\nom\n-p\nh]\n  2\n O\nct \n20\n07 Experimental Single-Impulse Magnetic Focusing of\nLaunched Cold Atoms\nDavid A Smith†, Aidan S Arnold‡, Matthew J\nPritchard† and Ifan G Hughes†\n† Department of Physics, Rochester Building, University of Durham, South\nRoad, Durham, DH1 3LE, UK\n‡ SUPA, Department of Physics, University of Strathclyde, Glasgow, G4 0NG,\nUK\nE-mail: i.g.hughes@durham.ac.uk\nAbstract. Single-impulse three-dimensional magnetic focusing of vertically\nlaunched cold atoms has been observed. Four different configurations of the lens\nwere used to vary the relative radial and axial focusing properties. Compact\nfocused clouds of 85Rb were seen for all four configurations. It is shown that an\natom-optical ray matrix approach for describing the lensing action is insufficient.\nNumerical simulation using a full approximation to the lens’s magnetic field shows\nvery good agreement with the radial focusing properties of the lens. However, the\naxial (vertical direction) focusing properties are less well described and the reasons\nfor this are discussed.\nPACS numbers: 03.75.Be, 32.80.Pj, 39.25.+k\n1. Introduction\nLaser-cooled atoms [1] are extensively used in a range of experiments spanning\nfundamental physics and technological applications. As the kinetic energy of ultracold\natoms is many orders of magnitude lower than conventional atomic beams, relatively\nmodest electromagnetic forces are now routinely used to gain complete control over\nthe external degrees of freedom of atomic motion[2, 3]; these developments heralded\nan upsurge of interest in the field of atom optics [4]. One of the goals in this\nfield is to realise atom-optical elements that are analogues of conventional optical\ndevices, such as mirrors and lenses. An atom mirror reverses the component of\nvelocity perpendicular to the surface and maintains the component parallel to the\nsurface, whereas an atom lens can modify both the transverse and longitudinal velocity\ncomponents. In addition to atom-light interactions the Stern-Gerlach force has been\nused to realise flat atomic mirrors [5], curved atomic mirrors [6], and pulsed mirrors\nfor both cold (thermal) [7] and Bose-condensed atoms [8].\nThere are numerous reasons for studying the focusing of cold atoms using lenses\nor curved mirrors, including: transferring cold atoms from a magneto-optical trap\n(MOT) to a spatially-separated vacuum chamber of lower background pressure [9];\natom lithography [10]; or loading miniature magnetic guides [11] and atom chips [12].\nIn comparison to an unfocused cloud, the atom density can be significantly increased\nafter magnetic focusing.\nExperimental Single-Impulse Magnetic Focusing of Launched Cold Atoms 2\nPulsed magnetic lenses for 3D atom focusing were first demonstrated by Cornell et\nal. [13] using the alternate-gradient technique. The group of Gorceix has performed\nexperiments demonstrating the longitudinal Stern-Gerlach effect with an atomic cloud\nusing pulsed magnetic forces [14], and an experimental and theoretical study of cold\natom imaging by alternate-gradient magnetic forces [15]. Previously we have studied\nthe theoretical performance of both single [16] and double-impulse focusing [17]. In this\npaper we demonstrate a single-impulse strategy with a baseball lens. The advantages\nof this scheme are the simplicity of the design, and the theoretical prediction that this\nscheme is ideal for achieving the goal of minimizing the root-mean-square (rms) image\nvolume of a launched cloud [17].\nThe remainder of the paper is organised as follows: Section 2 outlines the theory\nand construction of the baseball lens; Section 3 discusses the experimental details; in\nSection 4 the results are presented and analysed; finally, in Section 5, conclusions are\ndrawn. The reader interested in the theory of atom focusing with pulsed magnetic\nfields is referred to earlier work [15, 16, 17].\n2. The Baseball Lens – construction and characterization\nAs it is impossible to create a static magnetic field maximum [18], there is only one\nstrategy for producing a focused cloud with a single magnetic impulse – one uses atoms\nin weak-field-seeking states, and a lens potential with a minimum at the centre and\npositive curvature along all three Cartesian axes. This is essentially the requirement\nfor a magnetic trap, for which many designs exist. A magnetic trap\/lens also requires\na non-zero minimum field, to avoid spin-flip losses [19]. In [16] we analysed the\naberrations expected from different magnetic lenses and concluded that a baseball\nlens would be ideal for achieving single-impulse three-dimensional focusing.\nThe baseball lens is a variant of the Ioffe-Pritchard trap [20]. Figure 1 part\n(a) shows the geometry. Previous work with quadrupole and Ioffe-Pritchard devices\n(for cold atoms and BECs [7, 8]) led to strong focusing in two dimensions. A novel\nfeature of our work is that the lens provides an isotropic potential. The baseball\nlens used here has two components: a nine-turn baseball coil carrying a current I ′,\nand a pair of two-turn circular bias coils which carry the same current I in the same\nsense. The baseball coil consists of eight straight current-carrying segments of length\nw = 10 cm along x, y, and ℓ = 10 cm along z. The bias coils have radius a = 5 cm\nand are separated by s = 5 cm. The coils were constructed from enamel-coated 3mm-\ndiameter cylindrical copper. The ratio of the axial and radial magnetic curvatures can\nbe tuned via the current ratio I\/I ′. The bias field is needed because it is impossible\nto realise a 3D isotropic lens with a baseball coil alone. Four configurations of the\nbaseball lens were used in this experiment, i.e. four ratios between the axial and radial\ncurvatures. The baseball lens was designed to run with hundreds of Amps for tens of\nmilliseconds; consequently, the coils were not water-cooled.\nThree 12 V truck batteries in series provided the current pulse. An integrated\ngate bipolar transistor (IGBT) was used to control the current pulse, and a reverse-\nbiased Schottky diode in parallel with the load prevented oscillatory currents in the\nlens after switch-off. The baseball and bias coils have resistances of 18mΩ and 3mΩ,\nwith impedances of 32µH and 2µH, respectively. The turn on(off) time for the current\nis ∼ 2ms. Further details of the lens construction and circuit can be obtained in [21].\nThe second-order expansion of the magnetic field magnitude of a baseball lens\nrequires five parameters: the axial bias field and field curvature from the bias coils,\nExperimental Single-Impulse Magnetic Focusing of Launched Cold Atoms 3\nand the axial bias field, gradient and curvature from the baseball coil. Theoretical\nexpressions for these quantities in terms of the currents and dimensions of the baseball\nand bias coils can be found in [16]. These parameters were measured with a 10 A test\ncurrent, and the measured and theoretical values are in good agreement [21].\n3. Experimental Setup and Procedure\nFigure 1 (b) and (c) show the principle of the experiment, comparing unfocused and\nfocused atomic trajectories; part (a) is a schematic of the apparatus. The experiment\nutilised a custom-made stainless steel vacuum chamber having 12 ports, composed\nof two intersecting 6-way crosses. One cross had two sets of orthogonal ports in the\nhorizontal plane, and one vertical pair. The other cross had 3 mutually orthogonal\naxes, symmetrically disposed about the vertical (at an angle cos−1(1\/\n√\n3)), along\nwhich the MOT beams propagated. The advantage of this setup is that only two laser\nFigure 1. Image (a) is a schematic of the experimental apparatus. The MOT is\nrealised at the centre of the intersecting six-way crosses. After a vertical moving-\nmolasses launch the baseball lens is pulsed on at the appropriate time to focus\nthe atoms in the quartz cell. Image (b) shows pictures of a launched cloud at\nequal time intervals; in the absence of a focusing pulse the cloud volume grows\ncubically with time, with a corresponding decrease in atom density. Image (c)\nshows the effect of a magnetic impulse - the final cloud volume is decreased with\na concomitant increase of density. Parts (b) and (c) are scaled diagrams for the\ndimensions used in the experiment discussed in this paper.\nExperimental Single-Impulse Magnetic Focusing of Launched Cold Atoms 4\nfrequencies are required to achieve vertical moving molasses, and the propagation\ndirection of the atoms is free for a probe beam. The chamber was pumped with a\nmagnetically-shielded 40 l\/s ion pump and the background pressure was 9×10−11 Torr.\nThe centre of a square-cross-section glass cell was located 20.5 cm above the MOT to\nenable the focused atoms to be observed. Three pairs of mutually orthogonal magnetic\nfield coils were used to cancel ambient fields in the chamber.\nA MOT containing 7×107 85Rb atoms was achieved using 6 independent\ncircularly-polarised beams, each of 10mm (1\/e2) radius and power P = 3mW,\nred-detuned 11MHz from the 85Rb 5S1\/2 F = 3 → 5P3\/2 F ′ = 4 transition.\nApproximately 5mW of repumping light was shared amongst the 6 MOT beams.\nThe trapping and repumping beams were produced by two grating-stabilized,\nexternal-cavity diode lasers locked using polarization spectroscopy [22] with hyperfine\npumping\/saturated absorption spectroscopy as a frequency reference [23]. Rb vapour\nwas provided by an SAES dispenser. The magnetic quadrupole field had an axial\ngradient of 15G\/cm.\nAfter collection in the MOT, the atoms underwent a 10ms 28MHz-red-detuned\noptical molasses stage with 25% trap laser intensity, which gave a temperature of\n(25±2) µK. A frequency difference of δν = 1.48MHz between the upwards and\ndownwards propagating laser beams then launched the atoms vertically in moving\nmolasses at a speed of 2.0m\/s. The frequency ramp of δν took 3ms and the\nfinal value was held for a further 1ms. These values were optimised by studying\nimages of the launched cloud up to 20ms after the launch process. The initial cloud\nstandard deviations were measured to be σx =1.01±0.01 mm and σz =0.97±0.01 mm.\nAfter launch, the atoms were optically pumped into the weak-field-seeking 5S1\/2\n|F = 3,MF = 3〉 state using a 300mG vertical magnetic field and a 50µs pulse of\n350µW retro-reflected, vertically-propagating, circularly-polarised light resonant with\nthe 85Rb 5S1\/2 F = 3 → 5P3\/2 F\n′\n= 4 transition. Repumping light resonant with\nthe 85Rb 5S1\/2 F = 2 → 5P3\/2 F\n′\n= 3 transition was present to prevent atoms from\naccumulating in undesired states.\nFluorescence images of the launched clouds were taken at the apex of flight\n(204ms after launch) using the same beams that were used for optical pumping,\nbut with a duration of 2ms and a power of 6mW. We were careful to ensure that\nthe imaging pulse did not blur or displace the image of the cloud by virtue of the\nradiation pressure exerted on the atoms. The centre of the baseball lens was located\n16.5±0.2 cm above the MOT. The unfocused cloud came to rest in (approximately)\nthe centre of the image. For each pulsed magnetic lens duration, τ , the lens turn-on\ntime was adjusted to centre the focused cloud in the image, which was taken 204 ms\nafter launch. The area seen in the image was (x=18.1 mm)×(z=25.8 mm).\n4. Results and Analysis\nFour different lens configurations were realised, each with a different ratio between the\naxial and radial frequencies. The parameters of these lens configurations (labelled ‘1,’\n‘2,’ ‘3,’ ‘4’) are shown in Table 1.\nFigure 2 shows a sequence of images obtained with increasing baseball pulse\nduration, τ , using lens configuration 1. A background image with no atoms launched\nis shown in (a). In (b) a cloud of atoms was launched but not focused. For the\nlaunch temperature, it is expected that the width of the unfocused Gaussian cloud is\nExperimental Single-Impulse Magnetic Focusing of Launched Cold Atoms 5\nLens Config. I ′ (A) I (A) ωx (rad s\n−1) ωz (rad s\n−1)\n1 832± 4 832± 4 30± 1 38± 2\n2 872± 4 446± 3 38± 1 39± 1\n3 898± 4 304± 2 41± 2 39± 2\n4 947± 5 0 50± 2 40± 2\nTable 1. Parameters for different lens configurations. The angular frequencies\nare deduced from field measurements. The slight variation of ωz is due to the\nvarying value of the baseball current I′, since the same current is used to feed\nboth the bias coils and the baseball coil.\nsignificantly larger than the area imaged onto the CCD chip. Images (c) - (i) show\nthe variation of the focused cloud as a function of τ . The cloud comes to a focus in\nthe x-direction between 16 and 20ms, and in the z-direction between 28 and 32ms.\nThree-dimensional focusing of a launched cloud with a single impulse from a baseball\nlens is clearly seen.\nFigure 3 shows the cloud sizes (standard deviations) along the x− and z-directions\nfor different durations of the impulse, τ , for all four lens configurations. Three-\ndimensional magnetic focusing with a single magnetic impulse has been observed for\nall four configurations, most notably using lens configuration 1. The radial frequency\nof a Ioffe-Pritchard trap increases with decreasing bias field. This is reflected in the\ndata: as we change from lens configuration 1 to lens configuration 4, the radial angular\nfrequency increases and the pulse duration required to achieve the minimum x-focus\ndecreases. The minimum measured value of the standard deviation in the x-direction\nof a focused cloud was 2.43±0.07mm, using lens configuration 4 with a pulse duration\nτ = 8ms. The minimum measured value of the standard deviation in the z-direction\nFigure 2. A sequence of images for increasing baseball lens duration, τ , using\nlens configuration 1. (a) Image taken, but no atoms launched; (b) typical image\nof launched atoms, without lensing (τ = 0); (c) - (i) τ increases from 12ms to\n36ms in 4ms steps. The x and z axes are in mm.\nExperimental Single-Impulse Magnetic Focusing of Launched Cold Atoms 6\n0 5 10 15 20 25 30 35 40 45 50\n0\n2\n4\n6\n8\n10\n0 5 10 15 20 25 30 35 40 45 50\n0\n2\n4\n6\n8\n10\n0 5 10 15 20 25 30 35 40 45 50\n0\n2\n4\n6\n8\n10\n0 5 10 15 20 25 30 35 40 45 50\n0\n2\n4\n6\n8\n10\nC\nlo\nud\n S\nta\nnd\nar\nd \nD\nev\nia\ntio\nn \n  σ\n  \/\n  m\nm\nConfiguration 1 Configuration 3\nPulse Duration     \/  ms\nConfiguration 2\n x\n z\nConfiguration 4\nFigure 3. Plots of the cloud sizes along the x− and z−directions, as functions of\npulse duration, τ , for the four lens configurations. Where the error-bars are not\nshown they are smaller than the symbols.\nof a focused cloud was 4.57±0.03 mm, using lens configuration 3 and a pulse duration\nof τ = 36ms. For all four lens configurations, the minimum radial cloud width is\nsmaller than the minimum axial width.\n4.1. Analysis of cloud size for different lens configurations\nTwo methods of predicting the expected cloud size were employed. First, an ABCD-\nmatrix analysis was carried out [15, 16, 17], characterising the lens as being perfectly\nparabolic with a finite-duration impulse. This analysis is easy to perform, but as\nwas pointed out in [16], the limit of the validity of the assumptions underlying this\nmethod are unlikely to extend to a realistic experiment. The second method is a\nbrute-force numerical simulation of the trajectories of many atoms subject to the\nforces of gravity and a pulsed Stern-Gerlach force. In this model, the magnetic\nfield was calculated by taking the baseball coil to be constructed from eight equal-\nlength, straight, infinitesimally-thin conductors, which ignored the finite extent of the\nconductors in the 3 ×3 array of the real lens. The bias coils were modelled as single\ncurrent loops, rather than the 2-turn coils in the experimental lens. Further details of\nthe numerical simulation can be found in [16]. Figure 4 compares the experimentally\nobtained cloud size along the x-direction with the matrix and numerical simulations.\nFor the matrix analysis, the initial cloud position and velocity standard deviations\nare required as input - these were deduced from experimental measurements. It is\nthen possible to obtain analytic predictions for the cloud-size dependence on τ as a\nExperimental Single-Impulse Magnetic Focusing of Launched Cold Atoms 7\n0 5 10 15 20 25 30 35 40\n0\n2\n4\n6\n8\n10\n0 5 10 15 20 25 30\n0\n2\n4\n6\n8\n10\n0 5 10 15 20 25 30\n0\n2\n4\n6\n8\n10\n0 5 10 15 20 25 30\n0\n2\n4\n6\n8\n10 Configuration 4\nConfiguration 3\nConfiguration 2\nConfiguration 1\nC\nlo\nud\n S\nta\nnd\nar\nd \nD\nev\nia\ntio\nn \n  σ\nx  \n \/ \n m\nm\nPulse Duration  τ  \/  ms\n Numerical Simulation\n Matrix Solution\n Experimental Data\nFigure 4. Plots of the cloud size along the x-direction as a function of the\npulse duration, τ , and comparison with an ABCD-matrix analysis and a numerical\nsimulation. Where the error-bars are not shown they are smaller than the symbols.\nfunction of ωx. A least-squares comparison of the data and matrix prediction were\nmade, and the results are summarised in table 2. The values for ωx deduced from\nthe experimental data are seen to be in good agreement with those predicted from\nknowledge of the geometry and currents passed through the baseball lens.\nAlthough the radial frequencies deduced are in good agreement with the expected\nvalues, the matrix analysis consistently predicts minimum cloud sizes which are\nsmaller than those measured experimentally. The numerical analysis is seen to show\nfar better agreement with the minimum cloud size. This confirms the predictions\npresented in [16] that aberrations arising from terms beyond the ideal parabolic lens\napproximation are significant. It should also be noted that the optical pumping of\natoms into the state with the largest magnetic moment will not have been complete;\nconsequently some atoms with smaller magnetic moments will have experienced a\nLens Predicted ωx (rad s\n−1) Fitted ωx (rad s\n−1)\n1 30± 1 33\n2 38± 1 39\n3 41± 2 44\n4 50± 2 50\nTable 2. Predicted and fitted values of ωx, the radial angular frequency.\nExperimental Single-Impulse Magnetic Focusing of Launched Cold Atoms 8\nsmaller magnetic impulse, and will contribute to the larger-than-expected minimum\ncloud size.\nA similar analysis was performed for the size of the cloud measured along the z-\ndirection. However, these data do not show good agreement with either the matrix or\nnumerical simulations, and we now clarify the reasons for this unexpected behaviour.\nFigure 5 shows the form of the axial field gradient, the radial angular frequency and\nthe magnitude of the axial angular frequency as a function of axial position for our\nlens. The axial field gradient is zero at the centre and finite along the axis. A finite\nvalue gives the cloud an additional impulse, which shifts the centre of the image\nslightly. It is seen that the radial curvature changes very little over the extent of the\ncloud, whereas there is considerable variation of the axial curvature; indeed, the axial\ncurvature changes sign approximately 2 cm from the centre of the lens. Aligning the\ncentre of the cloud radially with respect to the centre of the lens is significantly easier\nthan aligning the centre axially. As expected, numerical simulations show that the\nfocusing properties in the z-direction are far more sensitive to slight misalignment\nof the centre of the cloud with respect to the centre of the lens than for the radial\ndirection. There is also evidence (see below) that the extent of the cloud is longer\naxially than radially, which will also cause an average over the cloud of the axial\nfocussing properties of the lens. We believe that these reasons explain the poor axial\nperformance of the lens.\nIt is possible to infer from figure 3 the properties of the cloud in the limit of\nthe pulse duration, τ , going to zero. The asymptotic values radially are in good\nagreement with what is expected from a ballistically expanding sample of cold atoms\nat a temperature of 30 µK, whereas the axial size is consistently 3 times larger. This\nsuggests the implementation of moving-molasses perhaps caused axial heating of the\ncloud.\nIt is interesting to compare the relative density increase of the focused cloud in\ncomparison with the unfocused cloud. Although the density at the apex is not as\nhigh as for the initial cloud, we have demonstrated a build up by a factor of ∼120 in\n-3 -2 -1 0 1 2 3\nzHcmL\n-40\n-20\n0\n20\n40\n60\nd \nB z\n\u0090d\nzH\nG\n\u0090c\nm\nL,\nΩ\nx\n,\nÈΩ\nzÈ\nHr\nad\n\u0090s\nL\nFigure 5. Plots of the axial field gradient (black), radial lens frequency (blue)\nand magnitude of the axial lens frequency (red) as a function of axial position, for\nconfigurations 1 (solid) to 4 (dashed). The axial lens curvature becomes negative\nat z ≈ ±2 cm.\nExperimental Single-Impulse Magnetic Focusing of Launched Cold Atoms 9\ncomparison to the unfocused cloud.\n5. Discussion and conclusion\nIn addition to a study of atom focusing, the results presented here demonstrate a\nmethod of transferring atoms from a MOT to a remote vacuum chamber. Many cold\natom experiments employ a double-chamber system where the first chamber generally\nemploys a high pressure (∼ 10−9 Torr) MOT to collect a large number of cold atoms\nwhich are subsequently transported to a lower pressure ‘science’ chamber to allow for\nlonger trap lifetimes. The act of moving the atoms between the two regions results in\nan undesired density decrease unless steps are taken to counteract the cloud’s ballistic\nexpansion. One approach is to catch atoms launched into the science chamber in a\nsecond MOT. However, an undesirable feature is the restriction placed on subsequent\nexperiments by the laser beams and magnetic-field coils required to realise the second\nMOT. An alternative approach is to focus or guide the launched atoms such that they\ncan be collected in a conservative trap. Atomic confinement in the transfer process has\nbeen realised both with optical and magnetic forces. Laser guiding between chambers\nhas been achieved in free space [9, 24, 25, 26], within optical fibers [27], and a BEC has\nbeen transported with an optical tweezer [28]. In a second category of experiments\natoms are loaded into a magnetic trap in the first chamber, and transported using\neither time-dependent currents in an array of static coils [29], or trap coils mounted\non a motorised stage [30]. The disadvantage of a scheme with static coils is the large\nnumber of coils and power supplies required, and the time-dependent currents. Initial\nexperiments with moving coils used a three-dimensional quadrupole trap, which has\na magnetic zero at its centre. For certain applications, a trap with a finite minimum\nis required, and recently transport of atom packets in a train of Ioffe-Pritchard traps\nwas demonstrated [31]. Using moving coils does, however, place limitations on vacuum\nchamber design since sufficient space must be allowed for the translation mechanism.\nThe advantage of the pulsed magnetic lens presented in this work is that only space\nfor the lens itself is needed. However, in contrast to this work, there is no significant\nincrease in cloud size with the two magnetic transport schemes described above. The\ncombination of pulsed magnetic focusing combined with laser guiding looks promising\n[32]\nIn this work, spatial focusing was considered. A possible future extension would\nbe to study velocity focusing, and recently a Ioffe-Pritchard lens was used for this\npurpose [33]. A wavepacket with a very narrow momentum distribution is ideal for\nstudying quantum tunnelling, and a 1-dimensional narrow momentum distribution\ncould also be useful for other atom optics experiments, such as studying quantum\naccelerator modes.\nAcknowledgments\nThis work is supported by EPSRC. We thank Charles Adams and Simon Cornish for\nfruitful discussions. Kevin Weatherill designed the external-cavity laser.\nReferences\n[1] Chu S 1998 Rev. Mod. Phys. 70 685; Cohen-Tannoudji C N 1998 Rev. Mod. Phys. 70 707;\nPhillips W D 1998 Rev. Mod. Phys. 70 721\nExperimental Single-Impulse Magnetic Focusing of Launched Cold Atoms 10\n[2] Adams C S and Riis E 1997 Prog. Quant. Elec. 21 1\n[3] Hinds E A and Hughes I G 1999 J. Phys. D 32 R119\n[4] Adams C S, Sigel M and Mlynek J 1994 Phys. Rep. 240 143\n[5] Roach T M et al. 1995 Phys. Rev. Lett. 75 629; Sidorov A I et al. 1996 Quantum Semiclass.\nOpt. 8 713; Lau D C et al. 1999 Eur. Phys. J. D 5 193; Sidorov A I et al. 2002 Acta Physica\nPolonica B 33 2137; Lev B et al. 2003 Applied Physics Letters 83 395; Mohapatra A K and\nUnnikrishnan C S 2006 Europhys. Lett. 73 839\n[6] Hughes I G et al. 1997 J. Phys. B: At. Mol. Opt. Phys. 30 647; ibid 30 2119; ibid 34 2869;\nSaba C V et al. 1999 Phys. Rev. Lett. 82 468\n[7] Kadio D, Houde O and Pruvost L 2001 Europhys. Lett. 54 417\n[8] Bloch I et al. 2001 Phys. Rev. Lett. 87 030401; Arnold A S, MacCormick C and Boshier M G\n2002 Phys. Rev. A 65 031601(R); Arnold A S, MacCormick C and Boshier M G 2004 J. Phys.\nB 37 485; Ko¨hl M et al. 2005 Phys. Rev. A 72 063618\n[9] Szymaniec K, Davies H J and Adams C S 1999 Europhysics Letters 45 450; Davies H J,\nSzymaniec K and Adams C S 2000 Phys. Rev. A 62 013412\n[10] Meschede D and Metcalf H 2003 J. Phys. D 36 R17\n[11] Mu¨ller D et al. 1999 Phys. Rev. Lett. 83 5194; Dekker N H et al. 2000 Phys. Rev. Lett. 84 1124;\nKey M et al. 2000 Phys. Rev. Lett. 84 1371\n[12] Folman R et al. 2002 Adv. At. Mol. Opt. Phys. 48 263; Fortagh J and Zimmermann C 2007\nRev. Mod. Phys. 79 235\n[13] Cornell E A, Monroe C and Wieman C E 1991 Phys. Rev. Lett. 67 2439\n[14] Mare´chal E, Guibal S, Bossennec J L, Gorza M P, Barbe´ R, Keller J C and Gorceix O 1998 Eur.\nPhys. J. D 2 195; Mare´chal E, Guibal S, Bossennec J L, Barbe R, Keller J C and Gorceix O\n1999 Phys. Rev. A 59 4636\n[15] Miossec T, Barbe´ R, Keller J-C and Gorceix O 2002 Opt. Commun. 209 349\n[16] Pritchard M J, Arnold A S, Smith D A and Hughes I G 2004 J.Phys.B 37 4435\n[17] Arnold A S, Pritchard M J, Smith D A and Hughes I G 2006 New Journal of Physics 8 53\n[18] Earnshaw S 1842 Trans. Cambridge Philos. Soc. 7 97; Wing W H 1984 Prog. Quant. Electr. 8\n181\n[19] Petrich W et al. 1995 Phys. Rev. Lett. 74 3352\n[20] Gott Y V, Ioffe M S and Tel’kovskii V G 1962 Nucl. Fusion Suppl. 3 1045; Pritchard D E 1983\nPhys. Rev. Lett. 51 1336\n[21] Smith D A 2005 PhD. Thesis, University of Durham, UK (unpublished)\n[22] Wieman C and Ha¨nsch T W 1976 Phys. Rev. Lett. 36 1170; Pearman C P et al. 2002 J. Phys.\nB 35 5141; Harris M L et al. 2006 Phys. Rev. A 73 0625509\n[23] MacAdam K B, Steinbach A and Wieman C E 1992 Am. J. Phys. 60 1098; Smith D A and\nHughes I G 2004 Am. J. Phys. 72 631\n[24] Pruvost L, Marescaux D, Houde O and Duong H T 1999 Opt. Comm. 166 199\n[25] Noh H R, Xu X and Jhe W 2002 Adv. At. Mol. Opt. Phys. 48 153\n[26] Dimova E et al. 2007 Eur. Phys. J. D 42 299\n[27] Renn M J, Montgomery D, Vdovin O, Anderson D Z, Wieman C E and Cornell E A 1995 Phys.\nRev. Lett. 75 3253; Renn M J, Donley E A, Cornell E A, Wieman C E and Anderson D Z\n1996 Phys. Rev. A 53 R648; Renn M J, Zozulya A A, Donely E A, Cornell E A and Anderson\nD Z 1997 Phys. Rev. A 55 3684; Ito H, Sakaki K, Ohtsu M and Jhe W 1997 Appl. Phys. Lett.\n70 2496\n[28] Gustavson T L, Chikkatur A P, Leanhardt A E, Go¨rlitz A, Gupta S, Pritchard D E and Ketterle\nW 2002 Phys. Rev. Lett. 88 020401\n[29] Greiner M, Bloch I, Ha¨nsch T W and Esslinger T 2001 Phys. Rev. A 63 031401\n[30] Lewandowski H J et al. 2003 J. Low Temp. Phys. 132 309; Goldwin J, Inouye S, Olsen M L,\nNewman B, DePaola B D and Jin D S 2004 Phys. Rev. A 70 021 601(R); Nakagawa K et al.\n2005 Appl. Phys. B 81 791-794\n[31] Lahaye T, Reinaudi G, Wang Z, Couvert A and Gue´ry-Odelin D 2006 Phys. Rev. A 74 033622\n[32] Pritchard M J et al. 2006 New J. Phys. 8 309\n[33] Aoki T, Kato T, Tanami Y and Nakamatsu H 2006 Phys. Rev. A 73 063603\n"}