{"doi":"10.1002\/eet.265","coreId":"208495","oai":"oai:eprints.lse.ac.uk:18894","identifiers":["oai:eprints.lse.ac.uk:18894","10.1002\/eet.265"],"title":"A blueprint for making the prospective Mediterranean free trade zone an environmental role model","authors":["Neumayer, Eric"],"enrichments":{"references":[{"id":17235806,"title":"12 steps towards a sustainable MEDA. World Wide Fund for Nature:","authors":[],"date":"2000","doi":"10.1007\/springerreference_75919","raw":"WWF. 2000. 12 steps towards a sustainable MEDA. World Wide Fund for Nature: Brussels.","cites":null},{"id":17235776,"title":"Billions for sustainability? The use of EU pre-accession funds and their environmental and social implications – first briefing. Friends of the Earth","authors":[],"date":"2000","doi":null,"raw":"FoEE. 2000. Billions for sustainability? The use of EU pre-accession funds and their environmental  and  social  implications  –  first  briefing.  Friends  of  the  Earth Europe: Brussels.","cites":null},{"id":17235774,"title":"Communication from the Commission on the precautionary principle, COM(2000) 1. Commission of the European Communities:","authors":[],"date":"2000","doi":"10.1017\/cbo9780511610851.008","raw":"European  Commission.  2000.  Communication  from  the  Commission  on  the precautionary  principle,  COM(2000)  1.  Commission  of  the  European Communities: Brussels.","cites":null},{"id":17235773,"title":"Energy interdependence in the Western Mediterranean.","authors":[],"date":"1996","doi":"10.1080\/13629399608414590","raw":"Brauch,  H.G.  1996.  Energy  interdependence  in  the  Western  Mediterranean. Mediterranean Politics 1(3): 295-319.","cites":null},{"id":17235778,"title":"Euro-Mediterranean Free Trade Zone – implications for sustainability: Case studies, assessments and recommendations. Friends of the Earth Middle East: Amman and Jerusalem.","authors":[],"date":"2000","doi":null,"raw":"FoEME.  2000.  Euro-Mediterranean  Free  Trade  Zone  –  implications  for sustainability: Case studies, assessments and recommendations. Friends of the Earth Middle East: Amman and Jerusalem.","cites":null},{"id":17235785,"title":"Free trade and the environment in the Euro-Mediterranean context. Plan Bleu and Mediterranean Action Plan: Valbonne and Athens.","authors":[],"date":"2000","doi":null,"raw":"MCSD. 2000. Free trade and the environment in the Euro-Mediterranean context. Plan Bleu and Mediterranean Action Plan: Valbonne and Athens.","cites":null},{"id":17235782,"title":"Friends of the Earth Middle East: Amman","authors":[],"date":"1999","doi":null,"raw":"Friends of the Earth Middle East: Amman and Jerusalem. 25 Mabey, N. and R. McNally. 1999. Foreign direct investment and the environment: From  pollution  havens  to  sustainable  development.  World  Wide  Fund  for Nature United Kingdom: Surrey.","cites":null},{"id":17235798,"title":"Greening investment and trade – environmental protection without protectionism. Earthscan: London (forthcoming). 26 OECD.","authors":[],"date":"2001","doi":"10.1002\/csr.34","raw":"Neumayer,  E.  2001c.  Greening  investment  and  trade  –  environmental  protection without protectionism. Earthscan: London (forthcoming). 26 OECD. 2000. The OECD guidelines for multinational enterprises. Organisation for Economic Co-operation and Development: Paris.","cites":null},{"id":17235794,"title":"Greening the WTO agreements: can the Treaty establishing the European Community be of guidance?.","authors":[],"date":"2001","doi":null,"raw":"Neumayer, E. 2001a. Greening the WTO agreements: can the Treaty establishing the European  Community  be  of  guidance?.  Journal  of  World  Trade  35(1) (forthcoming).","cites":null},{"id":17235804,"title":"Middle East and North Africa environmental strategy – towards sustainable development,","authors":[],"date":"1995","doi":null,"raw":"World Bank. 1995. Middle East and North Africa environmental strategy – towards sustainable development, Report No. 13601-MNA. World Bank: Washington D.C. WTO. 1998. EC measures concerning meat and meat products (hormones), Appellate body report, WT\/DS26\/AB\/R and WT\/DS48\/AB\/R. World Trade Organization: Geneva.","cites":null},{"id":17235787,"title":"Multinational enterprises and the law.","authors":[],"date":"1995","doi":"10.1093\/law:iic\/9780199227969.book.1","raw":"Muchlinski, P. 1995. Multinational enterprises and the law. Blackwell: Oxford.","cites":null},{"id":17235796,"title":"Pollution havens: an analysis of policy options for dealing with an elusive phenomenon.","authors":[],"date":"2001","doi":null,"raw":"Neumayer, E. 2001b. Pollution havens: an analysis of policy options for dealing with an  elusive  phenomenon.  Journal  of  Environment  &  Development  10(2) (forthcoming).","cites":null},{"id":17235802,"title":"Protecting the European environment: enforcing EC environmental law.","authors":[],"date":"1996","doi":null,"raw":"Somsen,  H.  (ed.).  1996.  Protecting  the  European  environment:  enforcing  EC environmental law. Blackstone: London.","cites":null},{"id":17235783,"title":"The enforcement of Community environmental laws: some critical issues.","authors":[],"date":"1992","doi":null,"raw":"Macrory, R. 1992. The enforcement of Community environmental laws: some critical issues. Common Market Law Review 29: .347-369.","cites":null},{"id":17235780,"title":"The environment and NAFTA – understanding and implementing the new continental law.","authors":[],"date":"1996","doi":"10.2307\/3551894","raw":"Johnson, P.M. and A. Beaulieu. 1996. The environment and NAFTA – understanding and implementing the new continental law. Island Press: Washington D.C. Katz, D. 1998. The Mediterranean Free Trade Zone: Lessons from NAFTA, mimeo.","cites":null},{"id":17235808,"title":"The third generation of Euro-Mediterranean association agreements: a view from the South.","authors":[],"date":"1999","doi":"10.1080\/13629399908414685","raw":"Zaim, F. 1999. The third generation of Euro-Mediterranean association agreements: a view from the South. Mediterranean Politics 4(2): 36-52.","cites":null},{"id":17235800,"title":"Towards a Euro-Mediterranean partnership in renewable energy.","authors":[],"date":"1997","doi":"10.1080\/13629399708414632","raw":"Rhein,  E.  1997.  Towards  a  Euro-Mediterranean  partnership  in  renewable  energy. Mediterranean Politics 2(3): 102-113.","cites":null},{"id":17235810,"title":"Trade and environmental law in the European Community,","authors":[],"date":"1996","doi":"10.2307\/2997978","raw":"Ziegler,  A.R.  1996.  Trade  and  environmental  law  in  the  European  Community, Clarendon Press: Oxford.","cites":null},{"id":17235792,"title":"Trade and the environment: a critical assessment and some suggestions for reconciliation.","authors":[],"date":"2000","doi":"10.1177\/107049650000900203","raw":"Neumayer,  E.  2000b.  Trade  and  the  environment:  a  critical  assessment  and  some suggestions  for  reconciliation.  Journal  of  Environment  &  Development  9(2): 138-159.","cites":null},{"id":17235791,"title":"Trade measures in multilateral environmental agreements and WTO rules: potential for conflict, scope for reconciliation.","authors":[],"date":"2000","doi":"10.1787\/9789264180611-en","raw":"Neumayer, E. 2000a. Trade measures in multilateral environmental agreements and WTO  rules:  potential  for  conflict,  scope  for  reconciliation.  Aussenwirtschaft 55(3): 1-24.","cites":null},{"id":17235789,"title":"Weak versus strong sustainability – exploring the limits of two opposing paradigms. Edward Elgar:","authors":[],"date":"1999","doi":"10.1177\/03091325080320020905","raw":"Neumayer, E. 1999. Weak versus strong sustainability – exploring the limits of two opposing paradigms. Edward Elgar: Cheltenham.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001","abstract":"If not accompanied by strong environmental provisions, the prospective Mediterranean Free Trade Zone (MFTZ) is bound to increase existing pressures on scarce natural resources in the region. This article argues that the existing bilateral association agreements between the European Union and Southern Mediterranean countries are clearly insufficient from an environmental perspective. If the MFTZ were to be based upon those agreements, then it would represent a free trade agreement environmentally inferior to the North American Free Trade Agreement and even the World Trade Organization. To turn the MFTZ into an environmental role model instead, a number of provisions are indispensable: environmentally friendly preambular language, upward harmonization of environmental standards, a comprehensive general exceptions clause, a prominent role given to the precautionary principle and the allocation of the burden of proof on the party challenging an environmental measure. Equally importantly, the European Union needs to step up financial, technical and other assistance as part of a wider regional environmental strategy and partnership. Doing so would ensure that the prospective MFTZ becomes a promoter not only of trade and economic growth, but also environmental protection in the Southern Mediterranean region","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/208495.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/18894\/1\/__Libfile_repository_Content_Neumayer%2C%20E_A%20blueprint%20for%20making%20the%20prospective%20Mediterranean%20free%20trade%20zone%20an%20environmental%20role%20model_A%20blueprint%20for%20making%20the%20prospective%20Mediterranean%20free%20trade%20zone%20an%20environmental%20role%20model%20%28LSE%20RO%29.pdf","pdfHashValue":"f95fb58a98c8c0c055c9f57ed0b34018fe27c5bf","publisher":"John Wiley & Sons in association with European Research Press ( ERP Environment )","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:18894<\/identifier><datestamp>\n      2012-08-16T10:57:20Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/18894\/<\/dc:relation><dc:title>\n        A blueprint for making the prospective Mediterranean free trade zone an environmental role model<\/dc:title><dc:creator>\n        Neumayer, Eric<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        If not accompanied by strong environmental provisions, the prospective Mediterranean Free Trade Zone (MFTZ) is bound to increase existing pressures on scarce natural resources in the region. This article argues that the existing bilateral association agreements between the European Union and Southern Mediterranean countries are clearly insufficient from an environmental perspective. If the MFTZ were to be based upon those agreements, then it would represent a free trade agreement environmentally inferior to the North American Free Trade Agreement and even the World Trade Organization. To turn the MFTZ into an environmental role model instead, a number of provisions are indispensable: environmentally friendly preambular language, upward harmonization of environmental standards, a comprehensive general exceptions clause, a prominent role given to the precautionary principle and the allocation of the burden of proof on the party challenging an environmental measure. Equally importantly, the European Union needs to step up financial, technical and other assistance as part of a wider regional environmental strategy and partnership. Doing so would ensure that the prospective MFTZ becomes a promoter not only of trade and economic growth, but also environmental protection in the Southern Mediterranean region.<\/dc:description><dc:publisher>\n        John Wiley & Sons in association with European Research Press ( ERP Environment )<\/dc:publisher><dc:date>\n        2001<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/18894\/1\/__Libfile_repository_Content_Neumayer%2C%20E_A%20blueprint%20for%20making%20the%20prospective%20Mediterranean%20free%20trade%20zone%20an%20environmental%20role%20model_A%20blueprint%20for%20making%20the%20prospective%20Mediterranean%20free%20trade%20zone%20an%20environmental%20role%20model%20%28LSE%20RO%29.pdf<\/dc:identifier><dc:identifier>\n          Neumayer, Eric  (2001) A blueprint for making the prospective Mediterranean free trade zone an environmental role model.  European Environment, 11 (4).  pp. 173-184.  ISSN 0961-0405     <\/dc:identifier><dc:relation>\n        http:\/\/www3.interscience.wiley.com\/journal\/5299\/home<\/dc:relation><dc:relation>\n        10.1002\/eet.265<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/18894\/","http:\/\/www3.interscience.wiley.com\/journal\/5299\/home","10.1002\/eet.265"],"year":2001,"topics":["GE Environmental Sciences"],"subject":["Article","PeerReviewed"],"fullText":"  \nEric Neumayer \nA blueprint for making the prospective \nMediterranean free trade zone an \nenvironmental role model \n \nArticle (Accepted version) \n(Refereed) \n \nOriginal citation: \nNeumayer, Eric (2001) A blueprint for making the prospective Mediterranean free trade zone an \nenvironmental role model. European environment, 11 (4). pp. 173-184. ISSN 0961-0405  \n \nDOI: 10.1002\/eet.265  \n \n© 2001 John Wiley & Sons and ERP Environment \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/18894\/  \nAvailable in LSE Research Online: August 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n1 \nA blueprint for making the prospective Mediterranean Free \nTrade Zone an environmental role model \n \n \nPublished in: \nEuropean Environment, 11 (4), 2001, pp. 173-184 \n \n \nEric Neumayer \nDepartment of Geography and Environment, London School of Economics and \nPolitical Science, Houghton Street, London WC2A 2AE, UK \nPhone: 0207-955-7598. Fax: 0207-955-7412. Email: e.neumayer@lse.ac.uk \n2 \nA blueprint for making the prospective Mediterranean Free \nTrade Zone an environmental role model \n \nIf not accompanied by strong environmental provisions, the prospective \nMediterranean Free Trade Zone (MFTZ) is bound to increase existing pressures on \nscarce natural resources in the region. This article argues that the existing bilateral \nassociation agreements between the European Union and Southern Mediterranean \ncountries are clearly insufficient from an environmental perspective. If the MFTZ \nwere to be based upon those agreements, then it would represent a free trade \nagreement environmentally inferior to the North American Free Trade Agreement and \neven the World Trade Organization. To turn the MFTZ into an environmental role \nmodel instead, a number of provisions are indispensable: environmentally friendly \npreambular language, upward harmonisation of environmental standards, a \ncomprehensive general exceptions clause, a prominent role given to the precautionary \nprinciple and the allocation of the burden of proof on the party challenging an \nenvironmental measure. Equally importantly, the European Union needs to step up \nfinancial, technical and other assistance as part of a wider regional environmental \nstrategy and partnership. Doing so would ensure that the prospective MFTZ becomes \na promoter not only of trade and economic growth, but also environmental protection \nin the Southern Mediterranean region. \n \n3 \nINTRODUCTION \nThe promise to establish a Mediterranean Free Trade Zone (MFTZ) by 2010 forms, \nbesides political and security issues, the most important aspect of the so-called Euro-\nMediterranean partnership since its incorporation in the Barcelona Declaration \nadopted at the first Euro-Mediterranean conference in 1995. At the third conference in \nStuttgart in 1999 ministers reaffirmed that the MFTZ ‘remains at the heart of the \nPartnership’ (Art. 19 of the Chairman’s Formal Conclusions). Such a zone would \nencompass the EU member states plus the Southern Mediterranean countries \nincluding Jordan and a potential future Palestinian state, but excluding Libya, at least \nfor the time being. \nHowever, at the beginning of this decade the prospects for the MFTZ becoming \nreality are unclear. With the European Union (EU) deeply involved in and occupied \nwith enlargement, particularly towards Central and Eastern European countries, and \nstruggling to come to terms with the necessary institutional reforms to accommodate \nmany more members, it does not seem out of the question that the MFTZ will never \nmaterialise. At the least, it seems fair to say that the MFTZ is far from being a top \npriority concern for the EU. On the other hand, the date 2010 is still far away and in \npolitics deadlines matter a lot, but only if they come close enough to enter the rather \nshort-sighted perspectives of policy makers. In other words, it is far too early to write \noff the MFTZ and this would remain true even if no substantial steps towards such a \nfree trade zone were undertaken within the next five years or so. \nEven if the eventual establishing of the MFTZ by 2010 could be taken as a matter \nof fact, it is far from clear, however, what it would look like. If the few bilateral Euro-\nMediterranean Association Agreements, which have so far been signed and ratified \nand which are to form the basis for the MFTZ to build upon, were to provide the \n4 \nblueprint for such a regional free trade agreement (FTA), then it will have three major \ncharacteristics: \n \n* it would not be a comprehensive agreement as concerns binding provisions. The \ngradual abolition of tariffs on EU industrial exports and the opening of Mediterranean \ncountries towards foreign investment by EU investors would form its only major \nobjectives. Trade liberalisation in agricultural products would remain very limited, \nmuch to the frustration of Southern Mediterranean countries. \n* it would cover a comprehensive list of aspects of economic, financial, social, \nenvironmental and cultural cooperation. However, cooperation would be based on \nmostly non-binding, general promises. \n* it would have a rather rudimentary institutional structure only. \n \nIf, on the other hand, the only currently existing regional FTA to speak of between \ndeveloped countries and a developing country – namely the North American Free \nTrade Agreement (NAFTA) – is of any guidance on how the MFTZ could eventually \nlook like, then there will be many more detailed and comprehensive rules on, for \nexample, sanitary and phytosanitary (SPS) measures as well as technical barriers to \ntrade and there will be a stronger institutional structure dealing with, amongst other \nthings, environmental matters. \nThis article focuses on environmental aspects of the proposed MFTZ in the context \nof a wider European regional environmental strategy. It assesses the existing bilateral \nassociation agreements from an environmental perspective and highlights their \ndeficiencies. Modern agreements have so far been negotiated with Egypt, Israel, \nJordan, Morocco, Tunisia, and the Palestinian Authority and they hardly differ from \n5 \ncountry to country.1 The article demonstrates how the MFTZ could become an \nenvironmentally friendly regional FTA that could serve as a model for similar \nundertakings elsewhere and how it could form the heart of an ambitious regional \nenvironmental strategy. \n \nTHE IMPORTANCE OF AN ENVIRONMENTALLY FRIENDLY MFTZ \nWhy worry about the environmental friendliness or not of the prospective MFTZ? \nFirst, it could become a test case for judging the credibility of the EU’s commitment \nto integrate environmental and wider sustainability concerns in its quest for further \ntrade liberalisation. This article argues that if the weak environmental provisions in \nthe existing bilateral association agreements were simply taken over into the MFTZ \nwithout amendments and additions, this would render the MFTZ an anachronism as it \nwould establish a FTA environmentally inferior to NAFTA and even the World Trade \nOrganization (WTO), which itself is hardly known for being an environmentally \nadvanced agreement. Even the recently negotiated bilateral US-Jordan FTA contains \nsubstantially stronger environmental provisions than the typical bilateral FTA between \nthe EU and Southern Mediterranean countries, including Jordan. \nSecond, as experience with the failed negotiations for a Multilateral Agreement on \nInvestment (MAI) and the chaotic circumstances at the last WTO meeting in Seattle \nhave shown, NGOs might successfully mount enough resistance to bring down \nagreements that they oppose. Whether ‘civil society’, as it is sometimes called, would \nbe strong enough to bring down a non-environmentally friendly MFTZ is unclear, \n                                                 \n1\n The association agreement with Turkey is somewhat different as it implements the final phase \nof a Customs Union and Turkey has been awarded the status of a potential candidate for EU \nmembership. \n6 \nhowever, since NGOs in Southern Mediterranean countries are relatively weak and the \nones in EU countries might not have the resources available to mount enough \nresistance on their own. But the experience referred to above should give the EU a \nclear warning about what might happen should it choose to ignore the demands from \n‘civil society’. \nThird, the Southern Mediterranean region suffers from immense environmental \nproblems in terms of natural resource degradation and environmental pollution. The \nWorld Bank (1995, p. 10) estimates that the implied monetary costs are in the range of \nUS$ 12-14 bn per year or roughly 3 per cent of regional Gross Domestic Product. If it \nis not ensured that the MFTZ will become an environmentally friendly FTA, then the \nincrease in economic growth following from trade liberalisation will likely worsen the \nsituation with respect to, for example, scarcity of water resources, soil erosion, \npressure on coastal areas, the marine environment and the urban infrastructure as well \nas air and water pollution. Water scarcity in particular represents a problem. If it is not \ncomprehensively addressed it will become a drag on agricultural productivity and \neconomic development more generally and will remain a security problem \ndestabilising the whole region. \nA properly designed MFTZ could do more than mitigate negative environmental \nimpacts, however. Meaningful regional environmental cooperation would open the \nprospect for positively improving environmental conditions in the whole area. In a \nmore long-term and visionary perspective, the MFTZ could form the basis for a \nrenewable energy partnership, where Southern Mediterranean countries use their solar \npotential to replace their own fossil fuel dependency, but more importantly that of the \nEU member countries as well (Brauch 1996; Rhein 1997). \n \n7 \nPREAMBULAR LANGUAGE \nEvery FTA starts with a preamble, which lays down its objectives and guiding \nprinciples. Astonishingly, there is typically no environmentally friendly preambular \nlanguage in the Euro-Mediterranean association agreements as there is, for example, \nin the Treaty establishing the EU, the NAFTA or even in the Agreement establishing \nthe WTO. There is no talk of ‘a harmonious, balanced and sustainable development of \neconomic activities’, let alone ‘a high level of protection and improvement of the \nquality of the environment’ (Art. 2 Treaty establishing the EU), as the guiding \nprinciples of these agreements. No promotion of sustainable development and no \nstrengthening of the development and enforcement of environmental laws and \nregulations is promised as in the preamble of NAFTA, no assurance of the importance \nof environmental protection and preservation is given as in the preamble of the \nAgreement establishing the WTO. Instead all there currently is, are two clauses within \nthe non-binding sections on economic cooperation, which list ‘sustainable economic \nand social development’ among the objectives and ‘the preservation of the \nenvironment and ecological balances’ as a central component of economic \ncooperation (for example, Art. 42:2 and 43:4 of the association agreement with \nMorocco). \nNeither the wording of these two clauses, nor their location within and restricted to \nthe section of economic cooperation is satisfactory. Instead, the MFTZ should \nadditionally contain environmentally friendly language in its preamble, embracing \nsustainable development and the achievement of a high level of environmental \nprotection as objectives combined with progressive environmental improvements as a \nguiding target. NAFTA’s reference to a strengthening of the development and \nenforcement of environmental laws and regulations is also laudable and should be \n8 \nfollowed in the MFTZ, as the non-enforcement of laws and regulations is responsible \nfor a great many environmental problems, even within the EU (see Macrory (1992) \nand Somsen (1996)). \n \nPOTENTIAL HARMONISATION AND THE LEVEL OF ENVIRONMENTAL \nPROTECTION \nAs mentioned above, it is not entirely clear how far reaching the MFTZ will become. \nThe existing association agreements do not contain harmonisation provisions beyond \na general clause stating that cooperation should help the associated countries bringing \ntheir legislation closer to that of the Community (for example, Art. 52 of the \nagreement with Morocco). It seems inevitable, however, that the MFTZ will contain \nmore far reaching, if rudimentary, provisions for the harmonisation of, amongst \nothers, environmental laws and regulations, as harmonisation facilitates the free \nmovement of goods. In principle, harmonisation of national standards can occur at \nhigh, medium or low standards. From an environmental perspective, the MFTZ should \nencourage harmonisation at high environmental standards and should call for the \ncontinuous improvement of these standards. \nThe Treaty establishing the EU itself contains such provisions in its Art. 95 and \n174. In NAFTA, upward harmonisation is not explicitly encouraged. Art. 714:1 \nmerely states that ‘without reducing the level of protection of human, animal or plant \nlife or health, the Parties shall, to the greatest extent practicable (…), pursue \nequivalence of their respective sanitary and phytosanitary measures’ (similarly Art. \n906:1 for technical standards). At the WTO level, while GATT itself does not contain \nany relevant provisions, two other WTO agreements do. The Agreement on Technical \nBarriers to Trade (TBT Agreement) encourages the adoption of international technical \n9 \nregulations (Art. 2:4), the harmonisation of regulations (Art. 2:6) and even the \nadoption of foreign regulations (Art. 2:7) to prevent such regulations from hindering \nthe free flow of goods. Similarly, Art. 3:1 of the Agreement on Sanitary and \nPhytosanitary Measures (SPS Agreement) encourages the harmonisation of standards \nand the adoption of international standards, guidelines or recommendations. \nImportantly, none of these articles contain any provision calling for a ‘high level of \nenvironmental protection’ as a base or aim for harmonisation. The MFTZ should go \nbeyond the provisions in the WTO agreements and in NAFTA and should embrace \nupward harmonisation of environmental standards as an objective. As this would \npractically always mean to raise standards in Southern Mediterranean countries to EU \nlevels, this would be compatible with the requirement in the existing association \nagreements that the associated countries should bring their legislation closer to that of \nthe Community. \n \nTHE WORDING OF THE GENERAL EXCEPTIONS CLAUSE \nThe association agreements contain a general exceptions clause stating that the \nagreement ‘shall not preclude prohibitions on imports, exports or goods in transit \njustified on grounds of (…) the protection of health and life of humans, animals or \nplants’ (Art. 28 of the agreement with Morocco, identical wording in other \nagreements). This safeguard is, however, subject to the requirement that ‘such \nprohibitions or restrictions shall not (…) constitute a means of arbitrary discrimination \nor a disguised restriction on trade between the Parties’ (ibid.). This clause, which does \nnot explicitly mention environmental measures, is practically identical in wording to \nArt. 30 of the Treaty establishing the EU. For the EU, it is not particularly relevant \nthat its Art. 30 does not cover environmental protection measures in general and \n10 \nmeasures aimed at the conservation of exhaustible natural resources in particular. This \nis because the relevant case law of the European Court of Justice (ECJ) has made it \nclear in the wake of the so-called Cassis de Dijon doctrine that environmental \nprotection constitutes a mandatory requirement potentially justifying trade restrictive \nmeasures (see Neumayer 2001a). The ECJ case law would not necessarily be valid for \nthe MFTZ, however, so that the wording spelling out the coverage of the general \nexceptions clause does matter. The formulation chosen in the general exceptions \nclause of the MFTZ should therefore explicitly encompass all measures aimed at \nenvironmental protection in general and the conservation of living and non-living \nexhaustible natural resources in particular. \n \nTHE ROLE OF THE PRECAUTIONARY PRINCIPLE \nScientific uncertainty poses a great problem for environmental protection measures. \nUncertainty refers to a situation where the probability distribution over a set of \npossible states of the world and the resulting consequences cannot be known \nobjectively (cf. Neumayer 1999, pp. 99-101). Because they cannot be known \nobjectively, there cannot be definite scientific evidence. In these cases scientists can \nmerely provide best guesses based on judgements – sophisticated and informed \njudgements, but guesses nevertheless. Scientists themselves will differ in cases of \nscientific uncertainty, and sometimes quite dramatically so, with respect to an \nassessment of the dangers posed by uncertainties. \nUnfortunately, uncertainties do not merely exist on the fringe. Instead they are a \ncentral characteristic of modern life. Be it the potential danger that ‘mad cow disease’ \n(BSE) poses to human beings as well, or the potential health dangers from beef \nstemming from cattle raised with growth hormones, or the dangers from genetically \n11 \nmodified organisms (GMOs) – the central characteristic of these and other cases is the \nuncertainty of the danger posed. There is no scientific consensus on either the \nlikelihood of the dangers occurring or the severity of the consequences should they \noccur. In order to deal with scientific uncertainty, policy makers may take recourse to \nthe so-called precautionary principle. It says that preventive measures to avoid \nenvironmental harm should (or at least can) be undertaken before there is definite \nscientific evidence proving that certain activities cause environmental harm. \nNeither NAFTA, nor the WTO agreements have fully integrated the precautionary \nprinciple. The SPS Agreement, for example, allows preventive action only \nprovisionally until a ‘more objective (sic!) assessment of risk’ (Art. 5:7) is provided. \nNot surprisingly then, a WTO panel and appellate body have ruled against an \nEuropean Communities (EC) import ban on beef from cattle raised with growth \nhormones, which is based on a precautionary approach given the difficulties in \nproviding an “objective” assessment of risk for growth hormones (WTO 1998). \nThe Treaty establishing the EU is more advanced than the WTO’s SPS Agreement \nor NAFTA in explicitly embracing the precautionary principle. Nominally, it can only \nbe found at one point, namely in its Environment Chapter in Art. 174:2, which states \nthat Community policy on the environment ‘shall be based on the precautionary \nprinciple and on the principles that preventive action should be taken…’. The \nCommission itself insists, however, that the principle and its application must not be \nconfined to this article (European Commission 2000, p. 10). Indeed, in various \ncommunications, the Commission has emphasised the relevance of the precautionary \nprinciple, especially with respect to consumer health and food safety. The case law of \nthe European Court of Justice (ECJ) has tended to confirm the relevance of the \nprinciple in disputes over internal barriers to trade (Neumayer 2001a). \n12 \nThe MFTZ should follow the lead of the Treaty establishing the EU in embracing \nthe precautionary principle. However, it should give it a more prominent and central \nrole, making it clear that the precautionary principle can be invoked to justify \nenvironmentally motivated measures in general and with respect to SPS measures and \ntechnical standards and regulations in particular. \n \nTHE BURDEN OF PROOF \nNormally, free trade agreements require the party enacting a trade restrictive measure \nto prove, if challenged before a dispute panel, that the measure is either consistent \nwith the free trade obligations of the agreement or can be subsumed under one of the \nexception clauses. That the burden of proof need not necessarily rest with the party \nimposing the measure can be deduced from NAFTA, however, where the burden of \nestablishing the inconsistency lies with the party asserting that a SPS measure (Art. \n723(6)) or technical standards-related measure (Art. 914(4)) is inconsistent with the \nrelevant NAFTA provisions. To require that a measure is deemed consistent until \nproven otherwise is in accordance with a fundamental principle in criminal law that \nthe defendant is deemed innocent until proven guilty. As in criminal law, there will \nthen certainly be cases where measures cannot be proven to be inconsistent with the \nfree trade agreement even though they actually are. The justification would again be \nanalogous to criminal law, namely to protect the defendant, here the country imposing \nthe environmental measure: in case of doubt the defendant’s rights trump those of the \nplaintiff’s. This allocation of the burden of proof would grant environmental \nprotection measures some special protection. The MFTZ should therefore allocate the \nburden of proof on the complaining party similar to NAFTA’s provisions. \n \n13 \nTHE POLLUTION HAVEN PROBLEM IS EXAGGERATED \nMany environmentalists are afraid that multinational corporations (MNCs) take \nadvantage of low environmental standards in developing member countries of FTAs \nto re-locate their business in these so-called pollution havens (WWF 2000; FoEME \n2000). They sometimes fear that those potential hosts of foreign investment will even \nlower their environmental standards in order to attract more investment. Most \nempirical evidence suggests, however, that the pollution haven phenomenon is largely \nexaggerated. For a whole range of reasons, which cannot be discussed here, \ndifferences in environmental standards do not induce MNCs to any significant amount \nto re-locate their business operations (see Neumayer (2001b) for detail). Nonetheless, \nit would do no harm if the MFTZ included a non-binding clause following the \nexample set by NAFTA Art. 1114:2, which dissuades parties from encouraging \ninvestment ‘by relaxing domestic health, safety or environmental measures’. \nFurthermore, the MFTZ could explicitly encourage MNCs to adhere to the Guidelines \non Multinational Enterprises from the Organisation for Economic Co-operation and \nDevelopment (OECD 2000), which calls inter alia for environmental management \nsystems and a precautionary approach towards environmental uncertainty. \nThe last paragraph implicitly refers to manufacturing industries. Things are \nsomewhat different, however, with respect to resource extracting industries. Instead of \nre-locating business from developed countries, their very aim is to establish business \nfrom scratch in developing countries if there are natural resources to be exploited. \nExperience with oil extraction in Nigeria and mining in Indonesia and Papua New \nGuinea shows that at times MNCs operate business with significantly negative \nenvironmental impacts either because environmental standards in those countries are \nlow or because they are not enforced (Mabey and McNally 1999). Environmentalists \n14 \nsometimes suggest that this can be avoided in requiring MNCs to apply the \nenvironmental standards of their home countries in the country of their investment \n(FoEME 2000, p. 22). While doing so is in principle possible, at least according to \none legal doctrine, it would cause considerable difficulties in practice as it would \nextend the scope of domestic legislation beyond the territory of the home country and \nthereby override the legislative powers of the host country (Muchlinski 1995, pp. \n123f.). Inevitably, this would be regarded by host countries as ‘eco-imperialism’. The \nonly way around this would therefore be to ensure that environmentally unfriendly \noperations by MNCs receive significant media attention and to put sufficient pressure \non them to voluntarily refrain from such operations. \n \nA MEA SAVINGS CLAUSE? \nNAFTA was the first regional FTA to contain a savings clause for multilateral \nenvironmental agreements (MEAs). Art. 104 explicitly states that in the event of any \ninconsistency between NAFTA and a number of MEAs the provisions and obligations \ncontained in the latter prevail provided that ‘where a Party has a choice among equally \neffective and reasonably available means of complying with such obligations, the \nParty chooses the alternative that is the least inconsistent with the other provisions of \nthis Agreement’. While this savings clause is often seen as a landmark event \nproviding some credibility to the claim of NAFTA’s environmental friendliness, I \nwould argue that for a regional FTA such a savings clause is not necessary. This is for \ntwo reasons: First, the likelihood of a trade restrictive measure taken in pursuance of a \nMEA becoming challenged is very small even at the WTO level with a much more \ndiverse membership than amongst the partners to a regional FTA, where such \nconflicts can be solved more easily (Neumayer 2000a). Second, and more importantly, \n15 \nif there is potential for conflict between MEA provisions and free trade obligations, \nthen this conflict must also be solved at the multilateral, rather than regional, level. In \nother words, the potential for conflict needs to be solved at the WTO level. I would \ntherefore argue that the MFTZ should not include a MEA savings clause. \n \nA SANCTIONED ENFORCEMENT CLAUSE MAY BACKFIRE \nApart from the MEA savings clause, NAFTA or rather the North American \nAgreement on Environmental Cooperation (NAAEC), NAFTA’s environmental side \nagreement, is famous for its enforcement clause. Art. 5 of the NAAEC requests each \nNAFTA party to ‘effectively enforce its environmental laws and regulations’. This \nenforcement is subject to monitoring by the NAFTA parties, which may request \nbilateral consultations, a NAAEC Council meeting and eventually even an arbitration \npanel to establish whether ‘there has been a persistent pattern of failure by that other \nParty to effectively enforce its environmental law’ (Art. 22). \nThese provisions have been criticised for a number of reasons: First, the process is \na very slow one with many hurdles set up until an arbitral panel would issue a final \nreport on a NAFTA party’s alleged persistent failure of environmental enforcement \nand would impose monetary fines or, as a means of last resort, even the suspension of \ntrade benefits if a party was found guilty and failed to implement the panel’s \nrecommendations (Part Five of the NAAEC). Second, the requirement that the failure \nof environmental enforcement needs to be ‘persistent’ in order to be eligible for a \nchallenge has been criticised as ‘leaving victims of one-time offenders with no \nrecourse’ (Katz 1998, p. 15). Third, while anybody may submit information asserting \na NAFTA party’s failure to enforce its environmental law, which under certain \nconditions could lead to investigations and a factual record prepared by the Secretariat \n16 \nof the NAAEC’s Commission for Environmental Cooperation, only NAFTA parties \nthemselves have the right to initiate the formal procedure mentioned above. It is thus a \npurely inter-governmental process. Fourth, the Secretariat has substantial discretion in \ndeciding on whether a submission from a private person or an NGO merits a response \nfrom the affected NAFTA party. The establishing of a factual record presupposes a \ntwo-thirds vote by NAFTA parties and it is only them who can provide information \nand comments on the record and decide, again by two-third majority, whether to make \nthe record publicly available (Art. 14 and 15 of NAAEC). Of course, as mentioned \nabove, only a NAFTA party would have the right to initiate a formal procedure \nfollowing such a factual report. \nThese criticisms have some validity. However, I would argue here that the whole \nconcept of threatening sanctions with regard to a failure to enforce environmental \nlaws and regulations is fundamentally flawed, as it does not address the root cause of \nthe failure, and may backfire, as policy makers might become deterred from enacting \nstringent environmental laws and regulations. On the first aspect, Neumayer (2001b) \nargues in great detail that the root cause of a failure to enforce environmental laws and \nregulations is likely to stem from political-institutional deficiencies rather than from a \ndeliberate intent not to enforce. These deficiencies are not cured by threatening a \ncountry with sanctions for enforcement failure. Rather, what is needed is financial, \ntechnical and other assistance to help those countries in building enforcement \ncapacity. On the second aspect, rational policy makers aware of deficiencies in their \ncountry’s enforcement capacity will be deterred from enacting stringent laws and \nregulations if they have to fear that non-enforcement becomes punished. As more \nstringent laws and regulations are more difficult to enforce, there is a clear incentive \nto pass less stringent ones, which are easier to enforce. \n17 \nIt is this author’s opinion therefore that while a MFTZ should contain a clause \ndemanding enforcement of environmental laws and regulations, no sanctions should \nbe threatened for non-enforcement. It should contain provisions for an appropriate \ninstitution undertaking investigations and writing a factual report and there should be \nmuch less obstacles to private persons and NGOs for an initiation of such \nundertakings than is currently the case in NAFTA and parties should not have a right \nto veto against them. Furthermore, the MFTZ should require parties to provide their \nown citizens and NGOs with the right to challenge their own government’s failure to \nenforce environmental laws and regulations. But it should not threaten a MFTZ party \nwith sanctions imposed by other parties. Instead, measures accompanying the MFTZ \nshould provide assistance to building the capacity in the Southern Mediterranean \ncountries to effectively enforce their environmental laws and regulations. This brings \nus to the next section, which deals with institutional and financial issues. \n \nINSTITUTIONAL AND FINANCIAL ISSUES WITHIN A WIDER \nREGIONAL ENVIRONMENTAL STRATEGY \nTo leave member countries with substantial leeway in setting their own domestic level \nof environmental protection and to encourage the sustained improvement of \nenvironmental standards, represents an important part required to make the MFTZ an \nenvironmentally friendly FTA. Because the relationship between trade liberalisation \nand environmental harm is a very complex one (MCSD 2000), member countries need \nto be free in setting the environmental standards they deem appropriate. Of at least \nequal importance, however, are provisions on institutional and financial matters that \nwould foster regional cooperation within a wider environmental strategy. \n18 \nExisting financial assistance to the Southern Mediterranean countries has been \nroundly criticised by environmentalists as too limited in general with too little being \ndone for the environment in particular. The process has also been criticised as slow, \nnon-transparent and too heavily focused on the bilateral instead of regional level \n(WWF 2000, Wandel et al. 2000). \nWith the Euro-Mediterranean partnership, the EU, to some extent in exchange for \ngaining duty free access for its industrial products over time, stepped up its financial \naid to Southern Mediterranean countries. Between 1995 and 1999 some 900 million \nEuros were thus dedicated as part of the so-called MEDA programmes.2 While this \nmight seem a lot, Zaim (1999, p. 43) rightly points out that it translates into a mere 4.1 \nEuro per inhabitant per year in those countries, which is only about one third of the \nfinance per inhabitant going into Central and Eastern European countries. Less than \n10% of the financial assistance to Southern Mediterranean countries goes into the \nfinancing of environmental projects in a wider sense including water supply \ninstallations and the like. In addition, the Short and Medium-term Action Programme \nfor the Environment (SMAP) provides finance for specifically environmental projects. \nThe financial base of this programme is extremely limited, however, amounting to \nabout 10 million Euros a year. \nOn top of this financial aid comes lending on concessional terms to Southern \nMediterranean countries by the European Investment Bank (EIB), which was charged \nwith lending up to 4 billion Euro between 1995 and 1999. While some of this money \ngoes into environmental projects in a wider sense such as water supply and treatment \nfacilities, the vast majority goes into projects with potential detrimental environmental \n                                                 \n2\n MEDA is an acronym for measures d’accompagnement, i.e. accompanying measures. \n19 \nimpacts such as road infrastructure (FoEME 2000, p. 20). In another, but related \ncontext, EIB lending to Central and Eastern European countries encountered heavy \ncriticism in a report from Friends of the Earth Europe (FoEE 2000). In order to avoid \nfinancial aid or concessional lending from having severe negative environmental \nimpacts, all financial transactions should therefore become subject to comprehensive \nenvironmental impact assessment. \nIn order to make a real difference, the financial assistance in general and for \nenvironmental purposes in particular would also need to be increased substantially. \nThe World Bank (1995, pp. 70ff.) estimates that at least $58-78 bn would need to be \ninvested over a period of ten years to promote more environmentally sustainable \ndevelopment in Southern Mediterranean countries. While some of these financial \nresources could come from introducing and raising charges and fees on domestic \nconsumers of scarce natural resources, the great poverty of the vast majority of the \npopulation in these countries puts clear constraints on raising these resources \ndomestically. More external financial, but also technical and other assistance, is \ntherefore urgently needed to finance environmentally friendly projects and to build \ncapacity in Southern Mediterranean countries to develop and enforce stringent \nenvironmental laws and regulations as part of a national sustainability strategy. An \nanalysis undertaken by Friends of the Earth Middle East has, not surprisingly, shown \nthat Southern Mediterranean countries suffer from substantial gaps in this capacity, \nnoting that ‘while economic regulations will converge, there is no incentive within the \nEuro-Med framework to reduce the gap between EU and Southern Mediterranean \nenvironmental legislation’ (FoEME 2000, p. 67). Assistance is also needed if the \nsustainability assessment of the MFTZ, which the EU has promised but still not \ncommissioned, is to be accompanied by similar, but more focused, assessments in \n20 \neach of the Southern Mediterranean countries. If undertaken, these sustainability \nassessment should not be undertaken merely once, but should form the starting point \nfor a continuous assessment as the MFTZ develops. \nOn the institutional side of finance, it is striking that the finance is completely \ncontrolled by the EU and its institutions. There is very limited involvement on the side \nof the Southern Mediterranean countries and from NGOs. This would need to become \nrectified. In terms of participation from the weaker countries, NAFTA can again \nprovide a role model. Both the North American Development Bank (NADB) and the \nBorder Environment Cooperation Commission (BECC) are characterised by equal \nMexican involvement. However, for the case of the MFTZ, the Southern \nMediterranean countries should not be required to contribute approximately half the \nfunding, as is the case with Mexico for the NADB. Indeed, they should not be \nrequired to contribute any funding at all. As concerns participation from NGOs, this \ncould help making the management of finance a more open and transparent process. It \ncould also help reducing allegations of corruption and mismanagement of European \nfunds that have put the reputation of the EU and its institutions in so much doubt \nrecently. \nIn order to facilitate and spur regional environmental cooperation, a comprehensive \nenvironmental regime needs to be in place. Currently, the Mediterranean Action Plan \n(MAP) provides the overall framework for environmental action in the region. A \nMediterranean Commission for Sustainable Development (MCSD) and six regional \nactivity centres form part of MAP. In addition, there is a Mediterranean \nEnvironmental Technical Assistance Program (METAP). Critics argue that the \nexisting regime has not had any significant positive environmental impact so far. \nHowever, rather than creating a new environmental regime with new institutions, the \n21 \nexisting regime would need to become restructured to allow for stronger integrative \ncoordination and the mandate of existing institutions would need to become extended. \nWhether this restructured environmental regime were to be part of the MFTZ \nagreement itself or would come in the form of an environmental side agreement, does \nnot really matter. What matters is that the regime becomes better integrated with the \nprospective functions and operations of the MFTZ and that it can provide a platform \non which regional environmental cooperation is based. \nAt the moment, there is just one article among the 100 or so typically contained in \nan association agreement that deals with matters of environmental cooperation. \nWithout exception, this article contains merely non-binding provisions. For example, \nArt. 48 of the agreement with Morocco states that ‘the aim of cooperation shall be to \nprevent deterioriation of the environment, to improve the quality of the environment, \nto protect human health and to achieve rational use of natural resources for sustainable \ndevelopment’. The specific areas, for which environmental cooperation is promised, \ndiffer then from country to country. For example, while the agreements with Morocco \nand Tunisia merely mention soil and water quality, safety of industrial installations \nand waste as well as a monitoring and prevention of pollution of the sea, the \nagreement with the Palestinian Authority also places priority on matters relating to \ndesertification, water resource management, salinization, environmental education and \nawareness and explicitly promises cooperation on the use of environmental tools such \nas environmental information systems (EIS) and environmental impact assessment \n(EIA). If regional environmental cooperation were to become a serious undertaking, \nthen these rather rudimentary provisions would need to become integrated in a more \ncomprehensive and binding framework. There would also need to be regular meetings \n22 \nof the Environment Ministers from MFTZ countries to coordinate these cooperation \nefforts. \nFurthermore, environmental issues would need to become integrated into other \nareas of cooperation as well, especially agriculture, coastal zone management, \ntransport and energy, for which the already mentioned long-term oriented renewable \nenergy partnership would hold great potential. The importance of this point must not \nbe under-estimated. Experience from NAFTA shows that if environmental issues are \nmerely treated separately instead of integrated into other issue negotiations, then the \nenvironment is likely to lose out in the end (Katz 1998). \n \nCONCLUSION \nThe year 2010, the deadline for the MFTZ to be in place, is still some time away. As \nmentioned, it does not currently seem to be a top priority for the EU to transform the \nbilateral negotiations into multilateral ones. Indeed, keeping the negotiations on a \nbilateral rather than multilateral level is somewhat convenient for the EU as this \nmaintains a rather unequal balance of power in its favour. It will therefore depend to \nsome extent on the Southern Mediterranean countries to press for multilateral \nnegotiations for a MFTZ to begin. \nIt is not too early to start thinking about how the MFTZ could be turned into an \nenvironmentally friendly FTA. If the deadline of 2010 bears any meaning, then \nnegotiations will have to start some time in the near future. It will be important that \nenvironmental concerns are imputed into the negotiating process right from the start. \nIt would be much more difficult to add them afterwards onto the negotiation outcomes \nand it would be next to impossible then to integrate environmental concerns into other \npolicy areas. \n23 \nIf negotiators followed the blueprint outlined in this article, the MFTZ could \nbecome a green regional FTA. It would contain environmentally friendly preambular \nlanguage and a comprehensive general exceptions clause, would aim for upward \nharmonisation of environmental standards, would give a prominent role to the \nprecautionary principle and put the burden of proof on the party challenging an \nenvironmental measure. A MEA savings clause, on the other hand, is not necessary. \nAlso, while the MFTZ should contain uncomplicated provisions for investigating \nenforcement efforts by parties and should require them to give their citizens the \nopportunity to challenge non-enforcement before domestic courts, it should not \nthreaten parties with sanctions for non-enforcement. Sanctions do not target the root \ncauses of non-enforcement, which should be addressed via financial, technical and \nother assistance to help the Southern Mediterranean countries to enforce their own \nlaws and regulations. Even if sanctions were desirable, it would be highly unlikely \nthat they could become incorporated in a MFTZ as Southern Mediterranean might \nregard them as a non-acceptable encroachment into their sovereignty. More generally, \nit seems important in an attempt to design a green MFTZ not to overburden the \nagenda with items that do not seem to be strictly necessary. Developing countries are \ngenerally resistant towards efforts to green FTAs and one needs to take into account \ntheir sensitivities if one wants to succeed (Neumayer 2000d; 2001).3 The only way to \novercome this resistance will be to make a green MFTZ also in the interest of \nSouthern Mediterranean countries. Substantial financial and other assistance as part of \na wider regional environmental strategy will be a precondition for making this happen. \n                                                 \n3\n For example, Egypt, the most important Southern Mediterranean economy, is one of the \nleading developing countries resisting a greening of the WTO agreements \n24 \n \nACKNOWLEDGEMENTS \nThis article would not have been possible without the willingness of others to be \ninterviewed and to provide helpful comments on earlier drafts as well as information, \nwhich is not publicly available. My thanks go to Vito Custelli from Plan Bleu, Simone \nFerreira, Mikel Insausti from World Wide Fund for Nature, David Katz from Friends \nof the Earth Middle East, Catherine-Zoi Varfis and Alexandra Wandel from Friends \nof the Earth Europe. \n \nREFERENCES \nBrauch, H.G. 1996. Energy interdependence in the Western Mediterranean. \nMediterranean Politics 1(3): 295-319. \nEuropean Commission. 2000. Communication from the Commission on the \nprecautionary principle, COM(2000) 1. Commission of the European \nCommunities: Brussels. \nFoEE. 2000. Billions for sustainability? The use of EU pre-accession funds and their \nenvironmental and social implications – first briefing. Friends of the Earth \nEurope: Brussels. \nFoEME. 2000. Euro-Mediterranean Free Trade Zone – implications for \nsustainability: Case studies, assessments and recommendations. Friends of the \nEarth Middle East: Amman and Jerusalem. \nJohnson, P.M. and A. Beaulieu. 1996. The environment and NAFTA – understanding \nand implementing the new continental law. Island Press: Washington D.C. \nKatz, D. 1998. The Mediterranean Free Trade Zone: Lessons from NAFTA, mimeo. \nFriends of the Earth Middle East: Amman and Jerusalem. \n25 \nMabey, N. and R. McNally. 1999. Foreign direct investment and the environment: \nFrom pollution havens to sustainable development. World Wide Fund for \nNature United Kingdom: Surrey. \nMacrory, R. 1992. The enforcement of Community environmental laws: some critical \nissues. Common Market Law Review 29: .347-369. \nMCSD. 2000. Free trade and the environment in the Euro-Mediterranean context. \nPlan Bleu and Mediterranean Action Plan: Valbonne and Athens. \nMuchlinski, P. 1995. Multinational enterprises and the law. Blackwell: Oxford. \nNeumayer, E. 1999. Weak versus strong sustainability – exploring the limits of two \nopposing paradigms. Edward Elgar: Cheltenham. \nNeumayer, E. 2000a. Trade measures in multilateral environmental agreements and \nWTO rules: potential for conflict, scope for reconciliation. Aussenwirtschaft \n55(3): 1-24. \nNeumayer, E. 2000b. Trade and the environment: a critical assessment and some \nsuggestions for reconciliation. Journal of Environment & Development 9(2): \n138-159. \nNeumayer, E. 2001a. Greening the WTO agreements: can the Treaty establishing the \nEuropean Community be of guidance?. Journal of World Trade 35(1) \n(forthcoming). \nNeumayer, E. 2001b. Pollution havens: an analysis of policy options for dealing with \nan elusive phenomenon. Journal of Environment & Development 10(2) \n(forthcoming). \nNeumayer, E. 2001c. Greening investment and trade – environmental protection \nwithout protectionism. Earthscan: London (forthcoming). \n26 \nOECD. 2000. The OECD guidelines for multinational enterprises. Organisation for \nEconomic Co-operation and Development: Paris. \nRhein, E. 1997. Towards a Euro-Mediterranean partnership in renewable energy. \nMediterranean Politics 2(3): 102-113. \nSomsen, H. (ed.). 1996. Protecting the European environment: enforcing EC \nenvironmental law. Blackstone: London. \nWandel, A., Katz D., Mehyar M. and Walker-Leigh V. (eds.). 2000. Euro-\nMediterranean Free Trade Zone: can it be sustainable?, Conference \nproceedings, 17 April 2000. European Parliament: Brussels. \nWorld Bank. 1995. Middle East and North Africa environmental strategy – towards \nsustainable development, Report No. 13601-MNA. World Bank: Washington \nD.C. \nWTO. 1998. EC measures concerning meat and meat products (hormones), Appellate \nbody report, WT\/DS26\/AB\/R and WT\/DS48\/AB\/R. World Trade Organization: \nGeneva. \nWWF. 2000. 12 steps towards a sustainable MEDA. World Wide Fund for Nature: \nBrussels. \nZaim, F. 1999. The third generation of Euro-Mediterranean association agreements: a \nview from the South. Mediterranean Politics 4(2): 36-52. \nZiegler, A.R. 1996. Trade and environmental law in the European Community, \nClarendon Press: Oxford. \n"}