{"doi":"10.1029\/2009GL039442","coreId":"69351","oai":"oai:eprints.lancs.ac.uk:27143","identifiers":["oai:eprints.lancs.ac.uk:27143","10.1029\/2009GL039442"],"title":"Tracing solar wind plasma entry into the magnetosphere using ion-to-electron temperature ratio","authors":["Lavraud, B.","Borovsky, J.E.","Genot, V.","Schwartz, S.J.","Birn, J.","Fazakerley, A.N.","Dunlop, M.W.","Taylor, M.G.G.T.","Hasegawa, H.","Rouillard, A.P.","Berchem, J.","Bogdanova, Y.V.","Constantinescu, D.","Dandouras, I.","Eastwood, J.P.","Escoubet, C.P.","Frey, H.","Jacquey, C.","Panov, E.","Pu, Z.Y.","Shen, C.","Shi, J.","Sibeck, D.G.","Volwerk, M.","Wild, James A."],"enrichments":{"references":[{"id":16654667,"title":"(2001),The Cluster magnetic field investigation: Overview of in-flight performance and initial results,","authors":[],"date":null,"doi":null,"raw":"Balogh,A., et al. (2001),The Cluster magnetic field investigation: Overview of in-flight performance and initial results, Ann. Geophys., 19(10–12), 1207–1217.","cites":null},{"id":997848,"title":"(2007a), Temperature anisotropies of electrons and two component protons in the dusk plasma sheet,","authors":[],"date":null,"doi":null,"raw":"Nishino, M. N., M. Fujimoto, T. Terasawa, G. Ueno, K. Maezawa, T. Mukai, and Y. Saito (2007a), Temperature anisotropies of electrons and two component protons in the dusk plasma sheet, Ann. Geophys., 25(6), 1417–1432.","cites":null},{"id":998148,"title":"(2007b), Origin of temperature anisotropies in the cold plasma sheet: Geotail observations around the Kelvin-Helmholtz vortices,","authors":[],"date":null,"doi":null,"raw":"Nishino, M. N., M. Fujimoto, G. Ueno, T. Mukai, and Y. Saito (2007b), Origin of temperature anisotropies in the cold plasma sheet: Geotail observations around the Kelvin-Helmholtz vortices, Ann. Geophys., 25(9), 2069–2086.","cites":null},{"id":996462,"title":"Altered solar wind-magnetosphere interaction at low Mach numbers: Coronal mass ejections,","authors":[],"date":"2008","doi":null,"raw":"Lavraud, B., and J. E. Borovsky (2008), Altered solar wind-magnetosphere interaction at low Mach numbers: Coronal mass ejections, J. Geophys.","cites":null},{"id":997587,"title":"An extended study of the low-latitude boundary layer on the dawn and dusk flank of the magnetosphere,","authors":[],"date":"1987","doi":null,"raw":"Mitchell, D. G., F. Kutchko, D. J. Williams, T. E. Eastman, L. A. Frank, and C. T. Russell (1987), An extended study of the low-latitude boundary layer on the dawn and dusk flank of the magnetosphere, J. Geophys. Res., 92(A7), 7394–7404, doi:10.1029\/JA092iA07p07394.","cites":null},{"id":999707,"title":"An unusual giant spiral arc in the polar cap region during the northward phase of a coronal mass ejection,","authors":[],"date":"2007","doi":null,"raw":"Rosenqvist, L., A. Kullen, and S. Buchert (2007), An unusual giant spiral arc in the polar cap region during the northward phase of a coronal mass ejection, Ann. Geophys., 25, 507–517.","cites":null},{"id":994123,"title":"Anomalous aspects of magnetosheath flow and of the shape and oscillations of the magnetopause during an interval of strongly northward interplanetary magnetic field,","authors":[],"date":"1993","doi":null,"raw":"Chen, S.-H., M. G. Kivelson, J. T. Gosling, R. J. Walker, and A. J. Lazarus (1993), Anomalous aspects of magnetosheath flow and of the shape and oscillations of the magnetopause during an interval of strongly northward interplanetary magnetic field, J. Geophys. Res., 98(A4), 5727–5742, doi:10.1029\/92JA02263.","cites":null},{"id":994441,"title":"Characteristics of the magnetospheric boundary layer and magnetopause layer as observed by IMP 6,","authors":[],"date":"1979","doi":null,"raw":"Eastman, T. E., and E. W. Hones Jr. (1979), Characteristics of the magnetospheric boundary layer and magnetopause layer as observed by IMP 6, J. Geophys. Res., 84(A5), 2019–2028, doi:10.1029\/JA084iA05p02019.","cites":null},{"id":998419,"title":"Cluster observations of reconnection due to the Kelvin-Helmholtz instability at the dawnside magnetospheric flank,","authors":[],"date":"2006","doi":null,"raw":"Nykyri, K., et al. (2006), Cluster observations of reconnection due to the Kelvin-Helmholtz instability at the dawnside magnetospheric flank, Ann. Geophys., 24(10), 2619–2643.","cites":null},{"id":1000126,"title":"Electron heating and the potential jump across fast mode shocks,","authors":[],"date":"1988","doi":null,"raw":"Schwartz, S. J., M. F. Thomsen, S. J. Bame, and J. Stansberry (1988), Electron heating and the potential jump across fast mode shocks, J. Geophys. Res., 93(A11), 12,923–12,931, doi:10.1029\/JA093iA11p12923.","cites":null},{"id":996724,"title":"Evidence for newly closed magnetosheath field lines at the dayside magnetopause under northward IMF,","authors":[],"date":"2006","doi":null,"raw":"Lavraud, B., M. F. Thomsen, B. Lefebvre, S. J. Schwartz, K. Seki, T. D. Phan, Y. L. Wang, A. Fazakerley, H. Re `me, and A. Balogh (2006), Evidence for newly closed magnetosheath field lines at the dayside magnetopause under northward IMF, J. Geophys. Res., 111, A05211, doi:10.1029\/2005JA011266.","cites":null},{"id":999113,"title":"Evolution and characteristics of global Pc5 ULF waves during a high solar wind speed interval,","authors":[],"date":"2005","doi":null,"raw":"Rae, I. J., et al. (2005), Evolution and characteristics of global Pc5 ULF waves during a high solar wind speed interval, J. Geophys. Res., 110, A12211, doi:10.1029\/2005JA011007.","cites":null},{"id":999400,"title":"First multispacecraft ion measurements in and near the Earth’s magnetosphere with the identical Cluster Ion Spectrometry (CIS) experiment,","authors":[],"date":"2001","doi":null,"raw":"Re `me, H., et al. (2001), First multispacecraft ion measurements in and near the Earth’s magnetosphere with the identical Cluster Ion Spectrometry (CIS) experiment, Ann. Geophys., 19(10–12), 1303–1354.","cites":null},{"id":995276,"title":"Geotail observations of the dayside outer boundary region: Interplanetary magnetic field control and dawn-dusk asymmetry,","authors":[],"date":"2003","doi":null,"raw":"Hasegawa, H., M. Fujimoto, K. Maezawa, Y. Saito, and T. Mukai (2003), Geotail observations of the dayside outer boundary region: Interplanetary magnetic field control and dawn-dusk asymmetry, J. Geophys. Res., 108(A4), 1163, doi:10.1029\/2002JA009667.","cites":null},{"id":993541,"title":"High temporal resolution observations of electron heating at the bow shock,","authors":[],"date":"1979","doi":null,"raw":"Bame, S. J., et al. (1979), High temporal resolution observations of electron heating at the bow shock, Space Sci. Rev., 23, 75–92, doi:10.1007\/ BF00174112.","cites":null},{"id":994212,"title":"Interplanetary magnetic field and the auroral zones,","authors":[],"date":"1961","doi":null,"raw":"Dungey, J. W. (1961), Interplanetary magnetic field and the auroral zones, Phys. Rev. Lett., 6, 47–48, doi:10.1103\/PhysRevLett.6.47.","cites":null},{"id":1001499,"title":"Ion and electron heating at collisionless shocks near the critical","authors":[],"date":"1985","doi":"10.1029\/JA090iA01p00137","raw":"Thomsen, M. F., J. T. Gosling, S. J. Bame, and M. M. Mellott (1985), Ion and electron heating at collisionless shocks near the critical Mach number, J. Geophys. Res., 90(A1), 137–148, doi:10.1029\/JA090iA01p00137.                        J. Berchem, IGPP, UCLA, 3877 Slichter Hall, 405 Hilgard Avenue, Los Angeles, CA 90095-1567, USA. J. Birn and J. E. Borovsky, Space Science and Applications, Los Alamos National Laboratory, Los Alamos, NM 87545-0000, USA. Y. Bogdanova, Department of Physics, La Trobe University, PS1 Building, Melbourne, Vic 3086, Australia. L18109 LAVRAUD ET AL.: TRACING SOLAR WIND PLASMA ENTRY L18109 5o f6D. Constantinescu, Institut fu ¨r Geophysik und Extraterrestrische Physik, Technische Universita ¨t Braunschweig, Mendessohnstrasse 3, Braunschweig D-38106, Germany. I. Dandouras, V. Ge ´not, C. Jacquey, and B. Lavraud, Centre d’Etude Spatiale des Rayonnements, Universite ´ de Toulouse, 9 Avenue du Colonel Roche, BP 44346, F-31028 Toulouse CEDEX 4, France. (benoit.lavraud@cesr.fr) M. W. Dunlop and A. P. Rouillard, Rutherford Appleton Laboratory, Didcot OX11 0QX, UK. J. P. Eastwood and H. Frey, Space Sciences Laboratory, University of California, 7 Gauss Way, Berkeley, CA 94720-7450, USA.","cites":null},{"id":999754,"title":"ISEE-1 and -2 observations of laminar bow shocks: Velocity and thickness,","authors":[],"date":"1982","doi":null,"raw":"Russell, C. T., M. M. Hoppe, W. A. Livesey, J. T. Gosling, and S. J. Bame (1982), ISEE-1 and -2 observations of laminar bow shocks: Velocity and thickness, Geophys. Res. Lett., 9(10), 1171–1174, doi:10.1029\/ GL009i010p01171.","cites":null},{"id":16654719,"title":"Kinetic Alfve ´n waves and plasma transport at the magnetopause,","authors":[],"date":"1997","doi":null,"raw":"Johnson, J. R., and C. Z. Cheng (1997), Kinetic Alfve ´n waves and plasma transport at the magnetopause, Geophys. Res. Lett., 24(11), 1423–1426, doi:10.1029\/97GL01333.","cites":null},{"id":16654745,"title":"Kinetic Alfve ´n waves as a source of plasma transport at the dayside magnetopause,","authors":[],"date":"1994","doi":null,"raw":"Lee, L. C., J. R. Johnson, and Z. W. Ma (1994), Kinetic Alfve ´n waves as a source of plasma transport at the dayside magnetopause, J. Geophys. Res., 99(A9), 17,405–17,411, doi:10.1029\/94JA01095.","cites":null},{"id":995961,"title":"Kinetic Alfve´n waves and plasma transport at the magnetopause,","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":997252,"title":"Kinetic Alfve´n waves as a source of plasma transport at the dayside magnetopause,","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":16654716,"title":"me (2006), Single-spacecraft detection of rolled-up KelvinHelmholtz vortices at the flank magnetopause,","authors":[],"date":null,"doi":null,"raw":"Hasegawa, H., M. Fujimoto, K. Takagi, Y. Saito, T. Mukai, and H. Re `me (2006), Single-spacecraft detection of rolled-up KelvinHelmholtz vortices at the flank magnetopause, J. Geophys. Res., 111, A09203, doi:10.1029\/2006JA011728.","cites":null},{"id":1000619,"title":"Model of the formation of the lowlatitude boundary layer for strongly northward interplanetary magnetic field,","authors":[],"date":"1992","doi":null,"raw":"Song, P., and C. T. Russell (1992), Model of the formation of the lowlatitude boundary layer for strongly northward interplanetary magnetic field, J. Geophys. Res., 97(A2), 1411–1420, doi:10.1029\/91JA02377.","cites":null},{"id":1000909,"title":"Observation of three distinct ion populations at the Kelvin-Helmholtz-unstable magnetopause,","authors":[],"date":"2008","doi":"10.5194\/angeo-26-1559-2008","raw":"Taylor, M. G. G. T., and B. Lavraud (2008), Observation of three distinct ion populations at the Kelvin-Helmholtz-unstable magnetopause, Ann. Geophys., 26(6), 1559–1566.","cites":null},{"id":996205,"title":"PEACE: A plasma electron and current experiment,","authors":[],"date":"1997","doi":null,"raw":"Johnstone, A. D., et al. (1997), PEACE: A plasma electron and current experiment, Space Sci. Rev., 79, 351–398, doi:10.1023\/ A:1004938001388.","cites":null},{"id":994746,"title":"Plasma entry from the flanks of the near-Earth magnetotail: Geotail observations,","authors":[],"date":"1998","doi":null,"raw":"Fujimoto, M., T. Terasawa, T. Mukai, Y. Saito, T. Yamamoto, and S. Kokubun (1998), Plasma entry from the flanks of the near-Earth magnetotail: Geotail observations, J. Geophys. Res., 103(A3), 4391–4408, doi:10.1029\/97JA03340.","cites":null},{"id":1000372,"title":"Plasma transfer processes at the magnetopause,","authors":[],"date":"1999","doi":null,"raw":"Sibeck, D. G., et al. (1999), Plasma transfer processes at the magnetopause, Space Sci. Rev., 88, 207, doi:10.1023\/A:1005255801425.","cites":null},{"id":995501,"title":"Rolled-up Kelvin-Helmholtz vortices and associated solar wind entry at Earth’s magnetopause,","authors":[],"date":"2004","doi":null,"raw":"Hasegawa, H., et al. (2004), Rolled-up Kelvin-Helmholtz vortices and associated solar wind entry at Earth’s magnetopause, Nature, 430, 755–758, doi:10.1038\/nature02799.","cites":null},{"id":995746,"title":"Single-spacecraft detection of rolled-up KelvinHelmholtz vortices at the flank magnetopause,","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":1001399,"title":"Solar wind control of density and temperature in the near-Earth plasma sheet: Wind\/Geotail collaboration,","authors":[],"date":"1997","doi":"10.1029\/96GL04018","raw":"Terasawa, T., et al. (1997), Solar wind control of density and temperature in the near-Earth plasma sheet: Wind\/Geotail collaboration, Geophys. Res. Lett., 24(8), 935–938, doi:10.1029\/96GL04018.","cites":null},{"id":995014,"title":"Spacecraft potential effects on electron moments derived from a perfect plasma detector,","authors":[],"date":"2004","doi":null,"raw":"Ge ´not, V., and S. J. Schwartz (2004), Spacecraft potential effects on electron moments derived from a perfect plasma detector, Ann. Geophys., 22(6), 2073–2080.","cites":null},{"id":996978,"title":"Strong bulk plasma acceleration in Earth’s magnetosheath: A magnetic slingshot effect?,","authors":[],"date":"2007","doi":null,"raw":"Lavraud, B., J. E. Borovsky, A. J. Ridley, E. W. Pogue, M. F. Thomsen, H. Re `me, A. N. Fazakerley, and E. A. Lucek (2007), Strong bulk plasma acceleration in Earth’s magnetosheath: A magnetic slingshot effect?, Geophys. Res. Lett., 34, L14102, doi:10.1029\/2007GL030024.","cites":null},{"id":998660,"title":"Structure of the dayside magnetopause for low magnetic shear,","authors":[],"date":"1993","doi":null,"raw":"Paschmann, G., W. Baumjohann, N. Sckopke, T.-D. Phan, and H. Lu ¨hr (1993), Structure of the dayside magnetopause for low magnetic shear, J. Geophys. Res., 98(A8), 13,409–13,422, doi:10.1029\/93JA00646.","cites":null},{"id":993327,"title":"The Cluster magnetic field investigation: Overview of in-flight performance and initial results,","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":998906,"title":"The magnetosheath region adjacent to the dayside magnetopause:","authors":[],"date":"1994","doi":null,"raw":"Phan, T.-D., G. Paschmann, W. Baumjohann, N. Sckopke, and H. Lu ¨hr (1994), The magnetosheath region adjacent to the dayside magnetopause: AMPTE\/IRM observations, J. Geophys. Res., 99(A1), 121–141, doi:10.1029\/93JA02444.","cites":null},{"id":993861,"title":"The near-Earth plasma sheet: An AMPTE\/IRM perspective,","authors":[],"date":"1993","doi":null,"raw":"Baumjohann, W. (1993), The near-Earth plasma sheet: An AMPTE\/IRM perspective, Space Sci. Rev., 64, 141–163, doi:10.1007\/BF00819660.","cites":null},{"id":1001128,"title":"The plasma sheet and boundary layers under northward IMF: a multi-point and multi-instrument perspective,","authors":[],"date":"2008","doi":"10.1016\/j.asr.2007.10.013","raw":"Taylor, M. G. G. T., et al. (2008), The plasma sheet and boundary layers under northward IMF: a multi-point and multi-instrument perspective, Adv. Space Res., 41(10), 1619–1629, doi:10.1016\/j.asr.2007.10.013.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-09-25","abstract":"When the solar wind Mach number is low, typically such as in magnetic clouds, the physics of the bow shock leads to a downstream ion-to-electron temperature ratio that can be notably lower than usual. We utilize this property to trace solar wind plasma entry into the magnetosphere by use of Cluster measurements in the vicinity of the dusk magnetopause during the passage of a magnetic cloud at Earth on November 25, 2001. The ion-to-electron temperature ratio was indeed low in the magnetosheath (Ti\/Te ∼ 3). In total, three magnetopause boundary layer intervals are encountered on that day. They all show that the low ion-to-electron temperature ratio can be preserved as the plasma enters the magnetosphere, and both with and without the observation of Kelvin-Helmholtz activity. This suggests that the ion-to-electron temperature ratio in the magnetopause boundary layer, which is usually high, is not prescribed by the heating characteristics of the plasma entry mechanism that formed these boundary layers. In the future, this property may be used to (1) further trace plasma entry into inner regions and (2) determine the preferred entry mechanisms if other theoretical, observational and simulation works can give indications on which mechanisms may alter this ratio","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69351.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/27143\/1\/art_962.pdf","pdfHashValue":"de32f1512b72b0e923083689f2810e673831e086","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:27143<\/identifier><datestamp>\n      2018-01-24T02:50:17Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141:51413735<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Tracing solar wind plasma entry into the magnetosphere using ion-to-electron temperature ratio<\/dc:title><dc:creator>\n        Lavraud, B.<\/dc:creator><dc:creator>\n        Borovsky, J.E.<\/dc:creator><dc:creator>\n        Genot, V.<\/dc:creator><dc:creator>\n        Schwartz, S.J.<\/dc:creator><dc:creator>\n        Birn, J.<\/dc:creator><dc:creator>\n        Fazakerley, A.N.<\/dc:creator><dc:creator>\n        Dunlop, M.W.<\/dc:creator><dc:creator>\n        Taylor, M.G.G.T.<\/dc:creator><dc:creator>\n        Hasegawa, H.<\/dc:creator><dc:creator>\n        Rouillard, A.P.<\/dc:creator><dc:creator>\n        Berchem, J.<\/dc:creator><dc:creator>\n        Bogdanova, Y.V.<\/dc:creator><dc:creator>\n        Constantinescu, D.<\/dc:creator><dc:creator>\n        Dandouras, I.<\/dc:creator><dc:creator>\n        Eastwood, J.P.<\/dc:creator><dc:creator>\n        Escoubet, C.P.<\/dc:creator><dc:creator>\n        Frey, H.<\/dc:creator><dc:creator>\n        Jacquey, C.<\/dc:creator><dc:creator>\n        Panov, E.<\/dc:creator><dc:creator>\n        Pu, Z.Y.<\/dc:creator><dc:creator>\n        Shen, C.<\/dc:creator><dc:creator>\n        Shi, J.<\/dc:creator><dc:creator>\n        Sibeck, D.G.<\/dc:creator><dc:creator>\n        Volwerk, M.<\/dc:creator><dc:creator>\n        Wild, James A.<\/dc:creator><dc:subject>\n        QA75 Electronic computers. Computer science<\/dc:subject><dc:description>\n        When the solar wind Mach number is low, typically such as in magnetic clouds, the physics of the bow shock leads to a downstream ion-to-electron temperature ratio that can be notably lower than usual. We utilize this property to trace solar wind plasma entry into the magnetosphere by use of Cluster measurements in the vicinity of the dusk magnetopause during the passage of a magnetic cloud at Earth on November 25, 2001. The ion-to-electron temperature ratio was indeed low in the magnetosheath (Ti\/Te ∼ 3). In total, three magnetopause boundary layer intervals are encountered on that day. They all show that the low ion-to-electron temperature ratio can be preserved as the plasma enters the magnetosphere, and both with and without the observation of Kelvin-Helmholtz activity. This suggests that the ion-to-electron temperature ratio in the magnetopause boundary layer, which is usually high, is not prescribed by the heating characteristics of the plasma entry mechanism that formed these boundary layers. In the future, this property may be used to (1) further trace plasma entry into inner regions and (2) determine the preferred entry mechanisms if other theoretical, observational and simulation works can give indications on which mechanisms may alter this ratio.<\/dc:description><dc:date>\n        2009-09-25<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/27143\/1\/art_962.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2009GL039442<\/dc:relation><dc:identifier>\n        Lavraud, B. and Borovsky, J.E. and Genot, V. and Schwartz, S.J. and Birn, J. and Fazakerley, A.N. and Dunlop, M.W. and Taylor, M.G.G.T. and Hasegawa, H. and Rouillard, A.P. and Berchem, J. and Bogdanova, Y.V. and Constantinescu, D. and Dandouras, I. and Eastwood, J.P. and Escoubet, C.P. and Frey, H. and Jacquey, C. and Panov, E. and Pu, Z.Y. and Shen, C. and Shi, J. and Sibeck, D.G. and Volwerk, M. and Wild, James A. (2009) Tracing solar wind plasma entry into the magnetosphere using ion-to-electron temperature ratio. Geophysical Research Letters, 36. L18109. ISSN 0094-8276<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/27143\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/2009GL039442","http:\/\/eprints.lancs.ac.uk\/27143\/"],"year":2009,"topics":["QA75 Electronic computers. Computer science"],"subject":["Journal Article","PeerReviewed"],"fullText":"Tracing solar wind plasma entry into the magnetosphere using\nion-to-electron temperature ratio\nB. Lavraud,1,2 J. E. Borovsky,3 V. Ge´not,1,2 S. J. Schwartz,4 J. Birn,3 A. N. Fazakerley,5\nM. W. Dunlop,6 M. G. G. T. Taylor,7 H. Hasegawa,8 A. P. Rouillard,6 J. Berchem,9\nY. Bogdanova,10 D. Constantinescu,11 I. Dandouras,1,2 J. P. Eastwood,12 C. P. Escoubet,7\nH. Frey,12 C. Jacquey,1,2 E. Panov,13 Z. Y. Pu,14 C. Shen,15 J. Shi,15 D. G. Sibeck,16\nM. Volwerk,13 and J. A. Wild17\nReceived 5 June 2009; accepted 7 August 2009; published 25 September 2009.\n[1] When the solar wind Mach number is low, typically\nsuch as in magnetic clouds, the physics of the bow shock\nleads to a downstream ion-to-electron temperature ratio\nthat can be notably lower than usual. We utilize this\nproperty to trace solar wind plasma entry into the\nmagnetosphere by use of Cluster measurements in the\nvicinity of the dusk magnetopause during the passage of a\nmagnetic cloud at Earth on November 25, 2001. The ion-\nto-electron temperature ratio was indeed low in the\nmagnetosheath (Ti\/Te \u0001 3). In total, three magnetopause\nboundary layer intervals are encountered on that day. They\nall show that the low ion-to-electron temperature ratio can\nbe preserved as the plasma enters the magnetosphere, and\nboth with and without the observation of Kelvin-Helmholtz\nactivity. This suggests that the ion-to-electron temperature\nratio in the magnetopause boundary layer, which is usually\nhigh, is not prescribed by the heating characteristics of\nthe plasma entry mechanism that formed these boundary\nlayers. In the future, this property may be used to (1) further\ntrace plasma entry into inner regions and (2) determine\nthe preferred entry mechanisms if other theoretical,\nobservational and simulation works can give indications on\nwhich mechanisms may alter this ratio.Citation: Lavraud, B.,\net al. (2009), Tracing solar wind plasma entry into the\nmagnetosphere using ion-to-electron temperature ratio, Geophys.\nRes. Lett., 36, L18109, doi:10.1029\/2009GL039442.\n1. Introduction\n[2] The solar wind is decelerated and diverted at the bow\nshock that forms upstream of the Earth’s magnetosphere.\nThe bow shock creates a denser and hotter plasma region\nthat engulfs the magnetosphere: the magnetosheath. It is not\nthe pristine solar wind, but rather the processed magneto-\nsheath plasma, that interacts with the magnetosphere at the\nmagnetopause. Accurate knowledge of the characteristics of\nthe magnetosheath is thus crucial. In particular, its specific\nproperties during low Alfve´n Mach number (MA) drastically\nalter solar wind – magnetosphere coupling, as described by\nLavraud and Borovsky [2008].\n[3] For typical solar wind conditions, i.e., high MA (>6),\nenergy conversion at the bow shock leads to high ion-to-\nelectron (Ti\/Te) temperature ratio. From earlier works on\nthe magnetosheath close to the dayside magnetopause,\nTi\/Te appears variable and statistically in the range 6–12\n[Paschmann et al., 1993; Phan et al., 1994]. At lower MA,\nbow shock properties change. In addition to the decreased\ncompression ratio (<4), which affects the downstream\nmagnetosheath densities and magnetic field, lower MA\nleads to lower downstream Ti\/Te. Although with significant\nscatter in the datasets studied, this trend has been well\nestablished [e.g., Bame et al., 1979; Russell et al., 1982;\nThomsen et al., 1985; Schwartz et al., 1988].\n[4] With significant scatter as well, the Earth’s central\nplasma sheet and plasma sheet boundary layers have aver-\nage Ti\/Te \u0001 7 [Baumjohann, 1993], thus comparable to that\nin the magnetosheath. The magnetopause boundary layers,\ninside and directly attached to the magnetopause, contain\nheated ions and electrons of solar wind origin that have\nentered the magnetosphere [e.g., Eastman and Hones, 1979;\nMitchell et al., 1987]. The main processes that have been\ninvoked for their formation are related to magnetic recon-\nnection, diffusive entry and the Kelvin-Helmholtz (KH)\ninstability [e.g., Dungey, 1961; Song and Russell, 1992;\nLee et al., 1994; Terasawa et al., 1997; Fujimoto et al.,\n1998; Sibeck et al., 1999; Hasegawa et al., 2004; Nykyri et\nal., 2006; Lavraud et al., 2006]. A question that naturally\narises is whether Ti\/Te in the plasma sheet and boundary\nlayers is set (1) by the heating properties of the plasma entry\nGEOPHYSICAL RESEARCH LETTERS, VOL. 36, L18109, doi:10.1029\/2009GL039442, 2009\nClick\nHere\nfor\nFull\nArticle\n1Centre d’Etude Spatiale des Rayonnements, Universite´ de Toulouse,\nToulouse, France.\n2UMR 5187, Centre National de la Recherche Scientifique, Toulouse,\nFrance.\n3Space Science and Applications, Los Alamos National Laboratory, Los\nAlamos, New Mexico, USA.\n4Blackett Laboratory, Imperial College London, London, UK.\n5Mullard Space Science Laboratory, University College London,\nDorking, UK.\n6Rutherford Appleton Laboratory, Didcot, UK.\n7ESTEC, ESA, Noordwijk, Netherlands.\n8Institute of Space and Astronautical Science, JAXA, Sagamihara,\nJapan.\n9IGPP, UCLA, Los Angeles, California, USA.\n10Department of Physics, La Trobe University, Melbourne, Victoria,\nAustralia.\n11Institut fu¨r Geophysik und Extraterrestrische Physik, Technische\nUniversita¨t Braunschweig, Braunschweig, Germany.\n12Space Sciences Laboratory, University of California, Berkeley,\nCalifornia, USA.\n13Space Research Institute, Graz, Austria.\n14School of Earth and Space Sciences, Peking University, Beijing,\nChina.\n15Center for Space Science and Applied Research, Chinese Academy of\nSciences, Beijing, China.\n16NASA GSFC, Greenbelt, Maryland, USA.\n17Department of Communication Systems, Lancaster University,\nLancaster, UK.\nCopyright 2009 by the American Geophysical Union.\n0094-8276\/09\/2009GL039442$05.00\nL18109 1 of 6\nprocesses or (2) simply by the temperature ratio of the\nsource magnetosheath, if this ratio is preserved as magneto-\nsheath plasma enters the magnetosphere.\n[5] In this paper, we study a Cluster encounter with the\ndusk side magnetopause during the passage of a low MA\nmagnetic cloud. It demonstrates that a low ion-to-electron\ntemperature ratio may indeed be preserved upon entry into\nthe boundary layers.\n2. Instrumentation\n[6] We utilize data from the ion (CIS\/HIA [Re`me et al.,\n2001]), electron (PEACE [Johnstone et al., 1997]), and\nmagnetic field (FGM [Balogh et al., 2001]) instruments\nonboard Cluster spacecraft 1. We use 4 s onboard ion and\nelectron moments. Electron moments were corrected for the\nspacecraft potential and energy cutoffs as explained by\nGe´not and Schwartz [2004]; they are consistent with the\nlower resolution on-ground moments. We also use OMNI\nsolar wind data (from the ACE spacecraft) to provide the\ncontext of Cluster observations. Only GSM coordinates\nare used.\n3. Observations\n[7] Figure 1 shows the solar wind context of the Cluster\nobservations. A magnetic cloud passed by Earth between\n14 UT on November 24 and 11 UT on November 26, 2001\n(blue horizontal arrow). It was preceded by a strong shock\nand an extended sheath region with large dynamic pressure\n(Figure 1b). The magnetic field in the sheath was fluctu-\nating and strong, leading to an intense geomagnetic storm\n(Dst < \u0002200 nT; not shown). The magnetic cloud had a\nvery high speed (Figure 1c), explaining the strong com-\npression ahead of it. The leading portion of the core of the\nmagnetic cloud was less geoeffective since it had a less\nintense and northward magnetic field. The magnetic cloud\nis characterized by a strong magnetic field but a density\nsignificantly lower than the sheath; consequently MA was\nlow (\u00012–5; Figure 1d).\n[8] Cluster instrumentation was only operational during\nthe interval delimited by the vertical dashed lines in Figure 1,\ni.e., when MA was low. For reference, Cluster location was\n(\u00023.4, 18.0, \u00025.2) Earth Radii (GSM) around 09 UT on\nNovember 25, i.e., on the dusk-side southern flank just\ntailward of the dawn-dusk terminator. As will be obvious\nlater from the data, Cluster was always located near the\ndusk magnetopause, moving from north to south across the\nequatorial plane near its apogee.\n[9] Figures 2a–2f show Cluster data for the interval of\noperation. The spacecraft first observed wave activity,\nwhich we analyse in more detail later. Around 03:30 UT,\nthe spacecraft entered the magnetosheath, characterized by\nlarger tailward flow, higher density and northward magnetic\nfield (Figures 2e, 2b, and 2f). The low density (a few cm\u00023,\na result of the low MA) and northward magnetic field in the\nmagnetosheath were consistent with the solar wind con-\nditions (Figure 1). The spacecraft entered back into the\nmagnetosphere through the magnetopause on two more\noccasions, at the times indicated with vertical dashed lines.\nThese re-entries correlate with drops in the solar wind\ndensity, observed as short periods of MA \u0001 2 in Figure 1d.\n[10] The data that constitute the prime focus of the\npresent paper is the ion-to-electron temperature ratio plotted\nin Figure 2d. It shows that Ti\/Te was unusually low in the\nmagnetosheath. It was generally around 3, as compared to\ntypical values being well above 6 in this region for high MA\n[Paschmann et al., 1993; Phan et al., 1994]. A short period\nof larger density around 6:20 UT, which corresponds to a\nslightly higher MA (\u00015–6 in Figure 1), shows a localised\nincrease of Ti\/Te to about 5. A second high Ti\/Te period is\nobserved in the magnetosheath after \u000113:10 UT, which\nappears related to particle leakage from the magnetopause.\n[11] The key observation in Figure 2 is the low Ti\/Te in\nparts of the boundary layer intervals. Indeed, while fluctua-\ntions of Ti\/Te were measured during the wave activity of\nthe first boundary layer encounter, and in part of the\nsecond, the ratio is essentially unchanged at \u00013 during\nthe entire last boundary layer interval. This observation\ndemonstrates that Ti\/Te in the boundary layers during low\nFigure 1. Interplanetary observations during the passage of a magnetic cloud at Earth on November 24–26, 2001\nshowing the solar wind (a) IMF components in GSM, (b) ram pressure, (c) speed, and (d) Alfve´n Mach number.\nL18109 LAVRAUD ET AL.: TRACING SOLAR WIND PLASMA ENTRY L18109\n2 of 6\nFigure 2. Cluster observations during the period of operation on November 25, 2001. The top panels show (a) the ion\nomni-directional spectrogram (energy flux), (b) the total ion density, (c) the total ion temperature, (d) the ion-to-electron\ntotal temperature ratio, (e) the ion velocity components in GSM, and (f) the magnetic field components in GSM. Three\nboundary layer intervals were observed, with corresponding magnetopause crossings marked by vertical dashed lines. The\nbottom panels show (g–l) a zoom of Cluster data during the period of Kelvin-Helmholtz wave activity and (i) the ion and\n(j) electron temperatures, (k) the ion-to-electron temperature ratios (all for total, parallel and perpendicular components),\nand (l) the ion velocity component. Times of enhanced Ti\/Te due to the appearance of a hot magnetospheric population are\nmarked by vertical dashed lines. Times of clear boundary layer plasma with low Ti\/Te, similar to that of the magnetosheath\nare marked with red arrows in Figure 2k.\nL18109 LAVRAUD ET AL.: TRACING SOLAR WIND PLASMA ENTRY L18109\n3 of 6\nMA can be significantly lower than the typical values of\neither the magnetosheath or plasma sheet during high MA.\nAs discussed above, this boundary layer (centered at 12 UT)\ncorresponds to an effective MA \u0001 2 in the solar wind\n(Figure 1d). The actual magnetosheath Ti\/Te was not\nmeasured at this time. It might have had a somewhat\nlower Ti\/Te than during the observedmagnetosheath intervals\nwhere Ti\/Te \u0001 3, and which corresponded to MA \u0001 3–4.\nThese observations yet demonstrate that Ti\/Te inside the\nmagnetosphere can be anomalously low: whatever the\nplasma entry mechanism, it did not force this ratio to be high.\n[12] Wave activity, primarily seen in the magnetic field\nand flow (Figures 2e and 2f), was often detected in the\nmagnetosheath. Wave activity in the magnetosheath was\nobserved around 8 and 10 UT for instance, together with flow\nenhancements. No pronounced wave activity was seen inside\nthe last two boundary layer intervals, contrary to the clear\nactivity for the first magnetopause crossing. Figures 2g–2l\nshow a zoom of Cluster data for this crossing. Kelvin-\nHelmholtz (KH) waves are observed. The waves are charac-\nterized by typical anti-correlation between density and\ntemperature (Figures 2h and 2i), and associated flow and\nmagnetic field fluctuations (Figures 2e, 2f, and 2l). Periods\nwith a substantial component of magnetospheric plasma,\nwith low density but large temperatures (Figure 2i), were\nalso observed (vertical dashed lines). Periods of boundary\nlayer plasma, made of heated magnetosheath plasma inside\nthe magnetopause, are highlighted with red arrows. The\npristine cold magnetosheath was sampled towards the end\nof the interval.\n[13] Figure 2k shows that while Ti\/Te is high in the pre-\nexisting magnetospheric plasma (vertical dashed lines), in\nthe boundary layer (red arrows) it is of the order of that\nobserved later in the pristine magnetosheath. As explained\nnext, it is unclear whether the KH instability is the process\nthat permitted plasma entry during this event. However, as\nfor the case of the third boundary layer (\u000112 UT) Ti\/Te is\nsignificantly lower than usual at the times marked by red\narrows in this boundary layer. The solar wind MA is low and\nsteady during this crossing (Figure 1d). Therefore, Ti\/Te was\nessentially preserved upon entry through the magnetopause.\n4. Discussion\n[14] The KH waves observed at the first magnetopause\ncrossing on that day were nicely correlated with other\nspacecraft and ground observations of Pc5 waves in the\nmagnetosphere, as demonstrated by Rae et al. [2005]. They\nidentified the Cluster KH observations between 2 and 3 UT\nas the likely source of the Pc5 waves. For such low MA\nconditions, the enhanced tailward flows observed at times in\nthe magnetosheath (e.g., \u00013:30–4:00, 7:00–8:30, 9:30–\n10:00 UT) correspond to enhanced flows adjacent to the\nmagnetopause in the fashion of a slingshot as described in\nprevious works [Chen et al., 1993; Rosenqvist et al., 2007;\nLavraud et al., 2007]. As suggested by these authors, such\nenhanced flows may lead to stronger coupling through\nenhanced KH activity [cf. also Lavraud and Borovsky,\n2008].\n[15] Hasegawa et al. [2006] recently devised a single-\nspacecraft method to discern KH waves that have entered\na non-linear stage and are rolled-up. Using magneto-\nhydrodynamic simulations they showed that the low density\nplasma from themagnetospheric side is entrained in rolled-up\nvortices so as to lead to regions of low density (i.e., of\nmagnetopsheric origin) with tailward velocities larger than\nthe dense magnetosheath itself. They tested and confirmed\nthis property with spacecraft data [cf. also Taylor et al., 2008].\nFor the present KH wave observations, no clear such signa-\nture is found (not shown); it is thus not sure whether plasma\nentry was locally occurring owing to the KH activity.\n[16] Figures 2i–2k show the total, parallel and perpen-\ndicular components of the ion and electron temperatures, as\nwell as their ratios. Compatible with previous boundary\nlayer observations for higher MA [Hasegawa et al., 2003;\nNishino et al., 2007a], electrons show parallel temperature\nanisotropy in the boundary layers while ions are more\nisotropic. By contrast, ions have a perpendicular anisotropy\nin the magnetosheath while electrons are more isotropic.\nThis results in temperature ratios that follow similar trends\nfor both components (Figure 2k), with the ratio of the\nperpendicular temperatures being higher than that for\nparallel temperatures. As noted by previous authors [e.g.,\nLee et al., 1994; Johnson and Cheng, 1997; Nishino et al.,\n2007b], these characteristics are possibly the result of\nwave-particle interactions upon entry through the magne-\ntopause. However, Taylor and Lavraud [2008] recently\nfound that boundary layer ions at times may be composed\nof two superposed cold populations of solar wind origin,\neach with different temperature anisotropy. The mecha-\nnisms that may explain the boundary layer anisotropy\ncharacteristics, and that would maintain the low tempera-\nture ratios as evidenced here, remain to be fully identified.\n[17] Finally, high Ti\/Te (above 10 or so) in Figure 2k\nmarks the sampling of the plasma sheet. This high energy\npopulation was observed adjacent to and inside the bound-\nary layers; it was seen as a single population on several\noccasions (vertical dashed lines). The high Ti\/Te of this\npopulation may indicate that it was formed at earlier times\nunder higher MA conditions; remember that Baumjohann\n[1993] found large scatter in Ti\/Te in the plasma sheet. This\nhigh value is also related to the spacecraft being located in\nthe dusk-side magnetosphere. Indeed, high Ti\/Te is expected\nin the plasma sheet at dusk, and lower ones at dawn, owing\nto the differential gradient and curvature drifts of ions and\nelectrons in the tail. That a significant high energy ion\npopulation exists at dusk more than at dawn has been\nclearly established in previous works [e.g., Fujimoto et al.,\n1998; Nishino et al., 2007a]. Mixing of this high energy ion\npopulation with the newly entered cold plasma of solar wind\norigin is often observed, i.e., at times other than the vertical\ndashed lines and red arrows. The short high Ti\/Te interval in\nthe second boundary layer around 8:45 UTalso seems related\nto mixing. Such times correspond to intermediate values of\nTi\/Te, and can be explained by this mixing. This highlights\nthe potential impact of transport processes, in addition to\nentry mechanisms.\n5. Conclusions\n[18] We investigated the behavior of the ion-to-electron\ntemperature ratio (Ti\/Te) measured by Cluster in the dusk-\nside magnetosheath and magnetopause boundary layers for\nlow solar wind Alfve´n Mach number (MA), during the\nL18109 LAVRAUD ET AL.: TRACING SOLAR WIND PLASMA ENTRY L18109\n4 of 6\npassage of a magnetic cloud at Earth. The observations\nshowed Ti\/Te \u0001 3 in the magnetosheath, which is unusually\nlow compared to typical values of order 6–12 for higher\nMA. This ratio is similarly low in the magnetopause\nboundary layers observed during this event. Thus, assuming\nthat the plasma has recently entered these layers through the\nmagnetopause, it has essentially preserved this property. It\nwas not possible to determine with certainty which process\nformed these boundary layers, i.e., reconnection, diffusion\nor KH instability. These observations demonstrate, at least\nfor this event, that none of these entry mechanisms forced\nthe temperature ratio to be high. This opens the possibility\nto distinguish which plasma entry mechanism prevails, e.g.,\nif theoretical, simulation and other observational works can\nshed light on how each mechanism may influence this ratio.\nNo explicit temperature ratio predictions have been found\nfor these mechanisms in previous works; but it is acknowl-\nedged that the literature is prolific on those subjects. In the\nfuture, this property may also be used to trace solar wind\nplasma transport into the inner regions of the magneto-\nsphere, though keeping in mind that the ratio may evolve\nwith transport in the tail owing in particular to the mixing of\ndifferent populations in response to the differential drifts of\nion and electron.\n[19] Acknowledgments. The authors acknowledge the support of\nISSI (Bern, Switzerland) for the organization of a combined Cluster-\nTHEMIS study team. We are grateful for the use the AMDA\/CDPP tool\nwhich allowed conditional searches of low Mach number intervals. We\nthank the OMNI data team for providing the solar wind data, as well as the\nACE teams.\nReferences\nBalogh, A., et al. (2001), The Cluster magnetic field investigation: Overview\nof in-flight performance and initial results, Ann. Geophys., 19(10–12),\n1207–1217.\nBame, S. J., et al. (1979), High temporal resolution observations of electron\nheating at the bow shock, Space Sci. Rev., 23, 75–92, doi:10.1007\/\nBF00174112.\nBaumjohann, W. (1993), The near-Earth plasma sheet: An AMPTE\/IRM\nperspective, Space Sci. Rev., 64, 141–163, doi:10.1007\/BF00819660.\nChen, S.-H., M. G. Kivelson, J. T. Gosling, R. J. Walker, and A. J. Lazarus\n(1993), Anomalous aspects of magnetosheath flow and of the shape and\noscillations of the magnetopause during an interval of strongly northward\ninterplanetary magnetic field, J. Geophys. Res., 98(A4), 5727–5742,\ndoi:10.1029\/92JA02263.\nDungey, J. W. (1961), Interplanetary magnetic field and the auroral zones,\nPhys. Rev. Lett., 6, 47–48, doi:10.1103\/PhysRevLett.6.47.\nEastman, T. E., and E. W. Hones Jr. (1979), Characteristics of the magneto-\nspheric boundary layer and magnetopause layer as observed by IMP 6,\nJ. Geophys. Res., 84(A5), 2019–2028, doi:10.1029\/JA084iA05p02019.\nFujimoto, M., T. Terasawa, T. Mukai, Y. Saito, T. Yamamoto, and\nS. Kokubun (1998), Plasma entry from the flanks of the near-Earth mag-\nnetotail: Geotail observations, J. Geophys. Res., 103(A3), 4391–4408,\ndoi:10.1029\/97JA03340.\nGe´not, V., and S. J. Schwartz (2004), Spacecraft potential effects on elec-\ntron moments derived from a perfect plasma detector, Ann. Geophys.,\n22(6), 2073–2080.\nHasegawa, H., M. Fujimoto, K. Maezawa, Y. Saito, and T. Mukai (2003),\nGeotail observations of the dayside outer boundary region: Interplanetary\nmagnetic field control and dawn-dusk asymmetry, J. Geophys. Res.,\n108(A4), 1163, doi:10.1029\/2002JA009667.\nHasegawa, H., et al. (2004), Rolled-up Kelvin-Helmholtz vortices and\nassociated solar wind entry at Earth’s magnetopause, Nature, 430,\n755–758, doi:10.1038\/nature02799.\nHasegawa, H., M. Fujimoto, K. Takagi, Y. Saito, T. Mukai, and\nH. Re`me (2006), Single-spacecraft detection of rolled-up Kelvin-\nHelmholtz vortices at the flank magnetopause, J. Geophys. Res., 111,\nA09203, doi:10.1029\/2006JA011728.\nJohnson, J. R., and C. Z. Cheng (1997), Kinetic Alfve´n waves and plasma\ntransport at the magnetopause, Geophys. Res. Lett., 24(11), 1423–1426,\ndoi:10.1029\/97GL01333.\nJohnstone, A. D., et al. (1997), PEACE: A plasma electron and\ncurrent experiment, Space Sci. Rev., 79, 351 –398, doi:10.1023\/\nA:1004938001388.\nLavraud, B., and J. E. Borovsky (2008), Altered solar wind-magnetosphere\ninteraction at low Mach numbers: Coronal mass ejections, J. Geophys.\nRes., 113, A00B08, doi:10.1029\/2008JA013192.\nLavraud, B., M. F. Thomsen, B. Lefebvre, S. J. Schwartz, K. Seki,\nT. D. Phan, Y. L. Wang, A. Fazakerley, H. Re`me, and A. Balogh (2006),\nEvidence for newly closed magnetosheath field lines at the dayside\nmagnetopause under northward IMF, J. Geophys. Res., 111, A05211,\ndoi:10.1029\/2005JA011266.\nLavraud, B., J. E. Borovsky, A. J. Ridley, E. W. Pogue, M. F. Thomsen,\nH. Re`me, A. N. Fazakerley, and E. A. Lucek (2007), Strong bulk\nplasma acceleration in Earth’s magnetosheath: A magnetic slingshot\neffect?, Geophys. Res. Lett., 34, L14102, doi:10.1029\/2007GL030024.\nLee, L. C., J. R. Johnson, and Z. W. Ma (1994), Kinetic Alfve´n waves as a\nsource of plasma transport at the dayside magnetopause, J. Geophys.\nRes., 99(A9), 17,405–17,411, doi:10.1029\/94JA01095.\nMitchell, D. G., F. Kutchko, D. J. Williams, T. E. Eastman, L. A. Frank, and\nC. T. Russell (1987), An extended study of the low-latitude boundary\nlayer on the dawn and dusk flank of the magnetosphere, J. Geophys. Res.,\n92(A7), 7394–7404, doi:10.1029\/JA092iA07p07394.\nNishino, M. N., M. Fujimoto, T. Terasawa, G. Ueno, K. Maezawa,\nT. Mukai, and Y. Saito (2007a), Temperature anisotropies of electrons\nand two component protons in the dusk plasma sheet, Ann. Geophys.,\n25(6), 1417–1432.\nNishino, M. N., M. Fujimoto, G. Ueno, T. Mukai, and Y. Saito (2007b),\nOrigin of temperature anisotropies in the cold plasma sheet: Geotail\nobservations around the Kelvin-Helmholtz vortices, Ann. Geophys.,\n25(9), 2069–2086.\nNykyri, K., et al. (2006), Cluster observations of reconnection due to the\nKelvin-Helmholtz instability at the dawnside magnetospheric flank, Ann.\nGeophys., 24(10), 2619–2643.\nPaschmann, G., W. Baumjohann, N. Sckopke, T.-D. Phan, and H. Lu¨hr\n(1993), Structure of the dayside magnetopause for low magnetic shear,\nJ. Geophys. Res., 98(A8), 13,409–13,422, doi:10.1029\/93JA00646.\nPhan, T.-D., G. Paschmann, W. Baumjohann, N. Sckopke, and H. Lu¨hr\n(1994), The magnetosheath region adjacent to the dayside magnetopause:\nAMPTE\/IRM observations, J. Geophys. Res., 99(A1), 121 – 141,\ndoi:10.1029\/93JA02444.\nRae, I. J., et al. (2005), Evolution and characteristics of global Pc5 ULF\nwaves during a high solar wind speed interval, J. Geophys. Res., 110,\nA12211, doi:10.1029\/2005JA011007.\nRe`me, H., et al. (2001), First multispacecraft ion measurements in and near\nthe Earth’s magnetosphere with the identical Cluster Ion Spectrometry\n(CIS) experiment, Ann. Geophys., 19(10–12), 1303–1354.\nRosenqvist, L., A. Kullen, and S. Buchert (2007), An unusual giant spiral\narc in the polar cap region during the northward phase of a coronal mass\nejection, Ann. Geophys., 25, 507–517.\nRussell, C. T., M. M. Hoppe, W. A. Livesey, J. T. Gosling, and S. J. Bame\n(1982), ISEE-1 and -2 observations of laminar bow shocks: Velocity\nand thickness, Geophys. Res. Lett., 9(10), 1171–1174, doi:10.1029\/\nGL009i010p01171.\nSchwartz, S. J., M. F. Thomsen, S. J. Bame, and J. Stansberry (1988),\nElectron heating and the potential jump across fast mode shocks, J. Geo-\nphys. Res., 93(A11), 12,923–12,931, doi:10.1029\/JA093iA11p12923.\nSibeck, D. G., et al. (1999), Plasma transfer processes at the magnetopause,\nSpace Sci. Rev., 88, 207, doi:10.1023\/A:1005255801425.\nSong, P., and C. T. Russell (1992), Model of the formation of the low-\nlatitude boundary layer for strongly northward interplanetary magnetic\nfield, J. Geophys. Res., 97(A2), 1411–1420, doi:10.1029\/91JA02377.\nTaylor, M. G. G. T., and B. Lavraud (2008), Observation of three distinct\nion populations at the Kelvin-Helmholtz-unstable magnetopause, Ann.\nGeophys., 26(6), 1559–1566.\nTaylor, M. G. G. T., et al. (2008), The plasma sheet and boundary layers\nunder northward IMF: a multi-point and multi-instrument perspective,\nAdv. Space Res., 41(10), 1619–1629, doi:10.1016\/j.asr.2007.10.013.\nTerasawa, T., et al. (1997), Solar wind control of density and temperature in\nthe near-Earth plasma sheet: Wind\/Geotail collaboration, Geophys. Res.\nLett., 24(8), 935–938, doi:10.1029\/96GL04018.\nThomsen, M. F., J. T. Gosling, S. J. Bame, and M. M. Mellott (1985), Ion\nand electron heating at collisionless shocks near the critical Mach number,\nJ. Geophys. Res., 90(A1), 137–148, doi:10.1029\/JA090iA01p00137.\n\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\nJ. Berchem, IGPP, UCLA, 3877 Slichter Hall, 405 Hilgard Avenue, Los\nAngeles, CA 90095-1567, USA.\nJ. Birn and J. E. Borovsky, Space Science and Applications, Los Alamos\nNational Laboratory, Los Alamos, NM 87545-0000, USA.\nY. Bogdanova, Department of Physics, La Trobe University, PS1\nBuilding, Melbourne, Vic 3086, Australia.\nL18109 LAVRAUD ET AL.: TRACING SOLAR WIND PLASMA ENTRY L18109\n5 of 6\nD. Constantinescu, Institut fu¨r Geophysik und Extraterrestrische Physik,\nTechnische Universita¨t Braunschweig, Mendessohnstrasse 3, Braunschweig\nD-38106, Germany.\nI. Dandouras, V. Ge´not, C. Jacquey, and B. Lavraud, Centre d’Etude\nSpatiale des Rayonnements, Universite´ de Toulouse, 9 Avenue du\nColonel Roche, BP 44346, F-31028 Toulouse CEDEX 4, France.\n(benoit.lavraud@cesr.fr)\nM. W. Dunlop and A. P. Rouillard, Rutherford Appleton Laboratory,\nDidcot OX11 0QX, UK.\nJ. P. Eastwood and H. Frey, Space Sciences Laboratory, University of\nCalifornia, 7 Gauss Way, Berkeley, CA 94720-7450, USA.\nC. P. Escoubet and M. G. G. T. Taylor, ESTEC, ESA, Noordwijk\nNL-2200 AG, Netherlands.\nA. N. Fazakerley, Mullard Space Science Laboratory, University College\nLondon, RH5 6NT Dorking, UK.\nH. Hasegawa, Institute of Space and Astronautical Science, JAXA, 3-1-1\nYoshinodai, Sagamihara, 229-8510, Japan.\nE. Panov and M. Volwerk, Space Research Institute, Schmiedlstrasse 6,\nGraz A-8042, Austria.\nZ. Y. Pu, School of Earth and Space Sciences, Peking University, 5\nYiheyuan Street, Beijing 100871, China.\nS. J. Schwartz, Blackett Laboratory, Imperial College London SW7 2AZ,\nLondon, UK.\nC. Shen and J. Shi, Center for Space Science and Applied Research,\nChinese Academy of Sciences, Beijing 100080, China.\nD. G. Sibeck, NASA GSFC, Greenbelt, MD 20771, USA.\nJ. A. Wild, Department of Communication Systems, Lancaster\nUniversity, Lancaster LA1 4WA, UK.\nL18109 LAVRAUD ET AL.: TRACING SOLAR WIND PLASMA ENTRY L18109\n6 of 6\n"}