{"doi":"10.1109\/WCNC.2009.4917925","coreId":"69449","oai":"oai:eprints.lancs.ac.uk:26757","identifiers":["oai:eprints.lancs.ac.uk:26757","10.1109\/WCNC.2009.4917925"],"title":"Quality of Service consideration for the wireless telemedicine and e-health services.","authors":["Zvikhachevskaya, Anna","Markarian, Garik","Mihaylova, Lyudmila"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-04-06","abstract":"In this article we investigate the application of IEEE 802.11 wireless standard to QoS (Quality of Service) support within wireless e-health\/telemedicine services. The stringent requirements and real-time nature of medical application introduce the need for QoS provisioning in wireless medical networks. The quick delivery of a patient’s measurements is an extremely important as well as reliability in terms of data delivery in the emergency care. Another important issue for wireless e-health applications is the mobility support. An ambulance, which is moving through different e-health domains, supporting different e-health applications the connectivity between the monitoring applications with the medical data source may be assured by the different wireless technologies. An overview of the e-health technologies and wireless telemedicine systems are presented and some open research problems are identified. A survey on QoS provisioning in wireless e-health, handoff schemes for QoS support in wireless networks, the scheme of priority for elemedicine\/e-health services and techniques\/methods for IEEE 802.11 to guarantee QoS is also provided. The simple ehealth scenario is when the user has the possibility to have ‘communication anywhere’ within the mobile network. The technology which is in use has to provide services that would reduce patient journeys, hospital visits and hospital admissions, and would save the time of healthcare professionals, as well as would support individuals living at home and improve the quality or effectiveness of the care or treatment that is delivered. The basic requirements for the different types of application are presented spatially for the ehealth\/ telemedicine services. To this end, we present emergency situation scenarios, designed as a possible e-health emergency scenario. Resource allocation for e-health application is inherited in many aspects including the offered services, traffic requirements, propagation’s characteristics and network structure. Within medical networks [1] delay is a critical factor, since there are many cases in which a communication should be timely in order to save the life of critical patient. This paper presents architecture and novel scenarios for QoS provisioning in emergency telemedicine. Some performance evaluation results are obtained by simulations","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:26757<\/identifier><datestamp>\n      2018-01-24T02:05:04Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141:51413735<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Quality of Service consideration for the wireless telemedicine and e-health services.<\/dc:title><dc:creator>\n        Zvikhachevskaya, Anna<\/dc:creator><dc:creator>\n        Markarian, Garik<\/dc:creator><dc:creator>\n        Mihaylova, Lyudmila<\/dc:creator><dc:subject>\n        QA75 Electronic computers. Computer science<\/dc:subject><dc:description>\n        In this article we investigate the application of IEEE 802.11 wireless standard to QoS (Quality of Service) support within wireless e-health\/telemedicine services. The stringent requirements and real-time nature of medical application introduce the need for QoS provisioning in wireless medical networks. The quick delivery of a patient’s measurements is an extremely important as well as reliability in terms of data delivery in the emergency care. Another important issue for wireless e-health applications is the mobility support. An ambulance, which is moving through different e-health domains, supporting different e-health applications the connectivity between the monitoring applications with the medical data source may be assured by the different wireless technologies. An overview of the e-health technologies and wireless telemedicine systems are presented and some open research problems are identified. A survey on QoS provisioning in wireless e-health, handoff schemes for QoS support in wireless networks, the scheme of priority for elemedicine\/e-health services and techniques\/methods for IEEE 802.11 to guarantee QoS is also provided. The simple ehealth scenario is when the user has the possibility to have ‘communication anywhere’ within the mobile network. The technology which is in use has to provide services that would reduce patient journeys, hospital visits and hospital admissions, and would save the time of healthcare professionals, as well as would support individuals living at home and improve the quality or effectiveness of the care or treatment that is delivered. The basic requirements for the different types of application are presented spatially for the ehealth\/ telemedicine services. To this end, we present emergency situation scenarios, designed as a possible e-health emergency scenario. Resource allocation for e-health application is inherited in many aspects including the offered services, traffic requirements, propagation’s characteristics and network structure. Within medical networks [1] delay is a critical factor, since there are many cases in which a communication should be timely in order to save the life of critical patient. This paper presents architecture and novel scenarios for QoS provisioning in emergency telemedicine. Some performance evaluation results are obtained by simulations.<\/dc:description><dc:publisher>\n        IEEE<\/dc:publisher><dc:date>\n        2009-04-06<\/dc:date><dc:type>\n        Contribution in Book\/Report\/Proceedings<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/WCNC.2009.4917925<\/dc:relation><dc:identifier>\n        Zvikhachevskaya, Anna and Markarian, Garik and Mihaylova, Lyudmila (2009) Quality of Service consideration for the wireless telemedicine and e-health services. In: IEEE Wireless Communications and Networking Conference, 2009. WCNC 2009. IEEE, pp. 1-6. ISBN 978-1-4244-2947-9<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/26757\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1109\/WCNC.2009.4917925","http:\/\/eprints.lancs.ac.uk\/26757\/"],"year":2009,"topics":["QA75 Electronic computers. Computer science"],"subject":["Contribution in Book\/Report\/Proceedings","NonPeerReviewed"],"fullText":"Quality of Service consideration for the wireless \ntelemedicine and e-health services \nPhD Anna Zvikhachevskaya \nDepartment of Communication \nSystems (InfoLab21) \nLancaster University \nLancaster, UK \nzvikhach@unix.lancs.ac.uk \n \n \n \n \nProf. Garik Markarian \nDepartment of Communication \nSystems (InfoLab21) \nLancaster University \nLancaster, UK \ng.markarian@lancaster.ac.uk \n \n \n \nDr.Lyudmila Mihaylova \nDepartment of Communication \nSystems (INfoLab21) \nLancaster University \nLancaster, UK \nmila.mihaylova@lancaster.ac.uk \n \nAbstract—In this article we investigate the application of IEEE \n802.11 wireless standard to QoS (Quality of Service) support \nwithin wireless e-health\/telemedicine services. The stringent \nrequirements and real-time nature of medical application \nintroduce the need for QoS provisioning in wireless medical \nnetworks. The quick delivery of a patient’s measurements is \nan extremely important as well as reliability in terms of data \ndelivery in the emergency care. Another important issue for \nwireless e-health applications is the mobility support. An \nambulance, which is moving through different e-health \ndomains, supporting different e-health applications the \nconnectivity between the monitoring applications with the \nmedical data source may be assured by the different wireless \ntechnologies. An overview of the e-health technologies and \nwireless telemedicine systems are presented and some open \nresearch problems are identified. A survey on QoS \nprovisioning in wireless e-health, handoff schemes for QoS \nsupport in wireless networks, the scheme of priority for \ntelemedicine\/e-health services and techniques\/methods for \nIEEE 802.11 to guarantee QoS is also provided. The simple e-\nhealth scenario is when the user has the possibility to have \n‘communication anywhere’ within the mobile network. The \ntechnology which is in use has to provide services that would \nreduce patient journeys, hospital visits and hospital \nadmissions, and would save the time of healthcare \nprofessionals, as well as would support individuals living at \nhome and improve the quality or effectiveness of the care or \ntreatment that is delivered. The basic requirements for the \ndifferent types of application are presented spatially for the e-\nhealth\/telemedicine services. To this end, we present \nemergency situation scenarios, designed as a possible e-health \nemergency scenario. Resource allocation for e-health \napplication is inherited in many aspects including the offered \nservices, traffic requirements, propagation’s characteristics \nand network structure. Within medical networks [1] delay is a \ncritical factor, since there are many cases in which a \ncommunication should be timely in order to save the life of \ncritical patient. This paper presents architecture and novel \nscenarios for QoS provisioning in emergency telemedicine. \nSome performance evaluation results are obtained by \nsimulations. \n Keywords-component; Wireless healthcare information \nnetworks, QoS, architecture, modeling, performance evaluation, \nresource allocation, bandwidth control. \nI.  INTRODUCTION. TECHNOLOGIES AND E-HEALTH  \n    Information technology (IT) plays an important role in e-\nhealth [2]. The medical sector is the most important area in \nwhich recent technological development in wireless \nnetworking has been applied. The use of wireless networks is \nvery important for the information delivery in out-of-hospital \nincident because healthcare networks are expected to be able \nto operate at any time, allocating the available resources and \nensuring QoS provisioning for the specific healthcare \napplications. By the use of such applications (medical \ndatabases, electronic health records, routing \ntext\/audio\/video\/photo\/video medical information) medical \nservices may be supported in underserved locations, such as \nrural health center, ambulances, ships, aeroplanes as well as \nhome environments [3,4,5,6,7]. \n     In [7] D.D.Vargos discuss wireless healthcare information \nsystems in which he proposed several factors that should be \ntaken into account for data delivery in wireless healthcare \nnetwork: \n• Availability; \n• Confidentiality and privacy; \n• Data delivery latency; \n• Reliability, QoS Provision and Mobility Support. \n     The availability of resources is absolutely imperative in \nhealth networks, because the generated traffic may be crucial \nfor the patients’ health and life since. To this end, \nauthentication mechanisms are needed in order to preserve the \nconfidentiality and privacy of the patients’ data (these \nmechanisms are beyond the scope of this paper). The quick \ndelivery of a patient’s measurements is an extremely \nimportant issue (especially in emergency situations) as well as \nreliability in terms of data delivery in the emergency care. \nAnother important issue for wireless e-health applications is \n978-1-4244-2948-6\/09\/$25.00 ©2009 Crown\nThis full text paper was peer reviewed at the direction of IEEE Communications Society subject matter experts for publication in the WCNC 2009 proceedings.\nthe mobility support. An ambulance, which is moving through \ndifferent e-health domains (areas that include static or mobile \ntype of nodes during the simulation), supporting different e-\nhealth applications the connectivity between the monitoring \napplications with the medical data source may be assured by \nthe different wireless technologies [7]. \nII. QOS IN WIRELESS E-HEALTH \n      Mobile communication devices become more and more \npopular. Wireless Local Area Networks (WLAN\/IEEE \n802.11) are used in a lot of scenarios today as well as for easy \ncommunication between these devices and connection to the \nInternet. The number of WLANs in public facilities like \nofficial buildings and hospitals increases rapidly as well as the \nentire small private \"home\" WLANs. The increase in \npopularity of Wireless LANs led to considerations with \nrespect to multimedia traffic over WLANs. The most sensitive \ncase of multimedia traffic is the Internet telephony (Voice-\nover-IP) for a sufficient speech quality the mouth-to-ear delay \nmust be kept small and should be released of jitter at the \nreceiver [8]. \n     Qualities of Service guarantees are important if the network \ncapacity is insufficient. For real-time streaming multimedia \napplications (such as voice over IP and IP-TV) since these \noften require fixed bit rate and are delay sensitive, and in \nnetworks where the capacity is a limited resource (cellular \ndata communications). QoS is the ability to provide a different \npriority to different applications, users, or data flows, or to \nguarantee a certain level of performance to a data flow (a \nrequired bit rate, delay, jitter, packet dropping probability \nand\/or bit error rate) may be guaranteed \nThe model and evaluation of the traffic requirements for \ntelemedicine networks was presented in [1]. Martinez et al. [9] \nproposed a methodology for the technical evaluation of  QoS \ntraffic requirements in healthcare services based on \ntelemedicine, which includes the service description, \nconsidering both application requirements and network \ntopologies, and the service evaluation, implemented by an \nautomated tool. Hu et al. [26] have proposed a mobile sensor \nnetwork infrastructure to support the third-generation \ntelemedicine applications which uses an energy-efficient query \nresolution mechanism in large-scale mobile sensor networks \nand provides the guaranteed mobile QoS for arriving \nmultimedia calls.  \nIII. HANDOFF  SCHEMES FOR QOS SUPPORT FOR WIRELESS \nNETWORKS  \n       In cellular telecommunications, the term handoff refers to \nthe process of transferring an ongoing call or data session \nfrom one channel connected to the core network to another so \nit is the process of changing the channel (frequency, time slot, \nspreading code, or a combination of them) associated with the \ncurrent connection, while a call is in progress [29]. Handoff is \nalways implemented on the voice channel. The value of \nimplementing handoffs is dependent on the size of the cell. \nToday the size of cells becomes smaller in order to increase \ncapacity. Also people talk longer. The handoffs are very \nessential [11]. \nThere are different types of handoff [11] in digital systems: \n1) Hard handoff (break-before-make process and handoff \nbetween two frequencies.); \n2) Soft handoff (make-before-break process). The process \nneeds to secure two code channels during the handoff process; \n3) Softer handoff. Handoff occurring between sectors only \nat the serving cell. It is a make-before break type using \ncombined diversity of two code channels. \nThere are two decision-making parameters of handoff: (1) \nbased on signal strength and (2) based on carrier-to-\ninterference ratio [11]. \n     The idea of handoff was introduced in order to achieve the \nuninterrupted communication of an ongoing call. The handoff \nprocess is one of the most complex functions in a cellular \nnetwork since it ensures the continuity of connection and has a \ndirect impact on the QoS perceived by users as well as for the \nmobility support (which is the important factor of the QoS \nprovisioning in telemedicine\/e-health services). \nThe handoff process is managed by the so-called handoff \nschemes. Therefore, the level of QoS of wireless mobile \nnetworks depends on the handoff strategy. Several handoff \nschemes, that support different services and different traffic \nrequirements, can be found in the literature [e.g., in 11].  \nB. Non-Prioritized Schemes \n     There is no given priority to handoff calls over originating \ncalls for this scheme, the forced termination probability is \nrelatively higher than normally anticipated [12,13]. This \nscheme does not differentiate handoff and initial calls. An \ninitial or a handoff call will be served, as long as there is a \nchannel available in the cell; otherwise the request is blocked \nimmediately. This (non-prioritized) scheme is able to \nminimize the call rejection and has the advantage of efficient \nutilization of the available frequency spectrum but this scheme \nis not suitable for multi-service environments like healthcare \ninformation systems [7].  \n \nC. Prioritized Schemes \n     Handoff prioritizing schemes (PS) provide improved \nperformance at the expense of a reduction in the total admitted \ntraffic and an increase in the blocking probability of new calls \n[14]. The concept of all handoff prioritization approaches is to \ngive handoff requests precedence over the new session \nrequests [15], but the improvement in performance is related \nto the way that each scheme gives priorities to handoff calls. \nSeveral handoff prioritization schemes, that support different \nservices and different traffic requirements, may be found in \nthe literature [11]. These handoff prioritization schemes may \nbe further classified into channel reservation schemes (offer a \nmethod to increase the number of the accepted handoff \nrequests by reserving a number of channels exclusively for \nhandoff requests, in a predictive or non-predictive manner), \nhandoff queuing schemes (give priority to handoff attempts by \npermitting them to queue instead of denying access, if the \npotential new base station is busy), channel transferred \nThis full text paper was peer reviewed at the direction of IEEE Communications Society subject matter experts for publication in the WCNC 2009 proceedings.\nschemes (in the case that there are no available channels to \naccommodate a handoff call request, a channel from a \nneighboring cell may be transferred), subrating schemes (In \nthem, certain channels are allowed to be temporarily divided \ninto two channels at half the original rate to accommodate \nhandoff calls), genetic schemes (Using genetic algorithms to \nassign the channels by local state-based call admission double-\nthreshold policies), hybrid schemes (are combinations of \nchannel reservation, handoff queuing, channel transferred, \ngenetic and subrating schemes; the key idea is to combine the \ndifferent prioritization policies in order to further decrease the \nblocking probabilities or to improve the channel utilization) \n[7].  \n \nIV. THE SCHEME OF  PRIORITY FOR THE WIRELESS \nTELEMEDICINE\/E-HEALTH SERVICES \n \n      Within the telemedicine environment it is possible to \ndefine three types of call based on the level of urgency. First \nof all call from ambulances and emergency calls; secondly, \ncalls from serious patients (for example with chronic diseases, \netc); and finally other calls which don’t use real-time \napplications (request for the some statistical data, etc.). \n      Fei Hu and Sunil Kumar in [10] have presented three \ntypes of medical services for the sensor-based telemedicine \nnetwork: \n1)  Real-time calls from Ambulance Patients. These calls \nare given the highest priority because the level of urgency is \nthe  highest (using the video camera sensors, Global \nPositioning System (GPS) system, and other advanced medical \nsensors to establish a rate-guaranteed connection with the \nmedical center). Moving through different cells calls are treated \nas “handoff-guaranteed” since the wireless bandwidth should \nbe reserved in the next cell to guarantee their on-going \nconnections. \n2) Handoff-prioritized calls from potentially emergency \npatients (such as older people or patients with chronic \ndiseases). The second highest priority (the serious patients may \nneed to perform the direct two-way communication with the \nmedical center) to these calls when they need to handover to a \nnew cell.  \n3) Non-real-time calls from Cluster-heads who collect \nmedical data from wrist-worn super sensors of average patients \nor normal people. Sensors would “wake up” periodically or \nwhen urgent medical conditions are detected by the body \nsensors. The type of communications is the best-effort for these \nservices.  \nSome representative types of medical activities may include \noff-line and on-line applications [7]:  \n1) Off-line applications: administrative files and electronic \npatient report (EPR) transfer (from medical data exchange \nbetween centers and moving vehicles or specialty sections) \nclinical routine consults through accesses to databases, queries \nto medical report warehouse, etc.  \n2) On-line applications: multimedia connections including \naudio and video exchange, biomedical signals and vital \nparameters (such as ECG signal, blood pressure, oxygen \nsaturation, etc.) transmission, etc. \n  \nV. TECHNIQUES AND METHODS FOR IEEE 802.11 TO \nPROVIDE QOS \n      Different methods and techniques have been used to solve \nsimilar questions by others [28,16,17,18].  The QoS \nrequirements of real-time applications like voice and video \ndoes not provide any priority and there is no service \ndifferentiation between different flows. Generally, the QoS \nschemes proposed based on IEEE 802.11. There are primarily \nthree ways in which QoS are provided [16]: \n1. Most of the techniques use different Inter Frame \nSpace (IFSs) or different Contention Window (CWs) or both \n[19,20,21] for the Prioritisation among different classes of \ndata; \n2. By some distributed variant of Weighted Fair \nQueuing (WFQ) [19,22] will help to achieve the Resource \nallocation of prioritized classes of data: This is achieved. \n3. Measurement and model based to provide QoS are \nused for Admission control mechanisms [23, 24, 25]. \n \n     M.Mishra and A.Sahoo in [16] propose the method that \nprovides priority to real time flows by using contention \nwindow based service differentiation method. Dimitros J. \nVergados in [28] investigates a grand challenge to superiority \non the DiffServ (Differentiated Services) wireless networks is \nthat several e-health applications may be supported with \ndifferent QoS constraints. Yi Liu in [17] the emerging IEEE \n802.11e standard for Wireless Local Area Networks (WLANs) \nhas been proposed to support quality of service (QoS) by \nassigning different channel access parameters (CAPs) to \ndifferent access categories (ACs). D.Gao and J.Cai in [18] \nshow that the 802.11e standard provides a very powerful \nplatform for QoS supports in WLANs. They provide an \nextensive survey of recent advances in admission control \nalgorithms\/protocols in IEEE 802.11e WLANs.  \n \nVI. PROPOSED ARCHITECTURE AND SCENARIOUS \n      The research is particularly concerned about is to give to a \nuser (patient, doctor, etc.) possibility to have ‘communications \nanywhere’ within the mobile network (figure 2). The \ntechnologies which are in use should be able to provide \nservices that reduces patient journeys, hospital visits and \nhospital admissions, saves the time of healthcare \nprofessionals, supports individuals living at home, and \nimproves the quality or effectiveness of the care or treatment \nthat is delivered [28]. An example of the telemedicine\/e-health \ntechnology which is presented on figure 1: a patient takes \nmeasurements (at home, etc.), then data should be transmitted \nvia wired (phone lines) or wireless connection through the \nserver to the medical centre (stored to the database, etc.).  \nThis full text paper was peer reviewed at the direction of IEEE Communications Society subject matter experts for publication in the WCNC 2009 proceedings.\nTable 1 presents the basic requirements for the different types \nof applications especially for the e-health\/telemedicine \nservices. \nTABLE I.  CLASSIFICATION OF E-HEALTH QOS REQUIREMENTS [27] \n \n \nFigure 1.  E-Health homecare scenario \nThe communication signal strength [26] should be the \nstrongest within the hierarchical network (fig.2). A mobile user \ncan use soft handoff (where a cell phone is simultaneously \nconnected to two or more cells, or cell sectors, during a call). \n \nFigure 2.  A multi-layer hierarchical network structure that includes the  \nfollowing cell-sizes: pico-cell, micro-cell and macro-sell. \nWithin a wireless Telemedicine Environment [27] the \nlimitation of wireless interface (in conjunction with the \nincreased throughput requirement) are very important and lead \nto consider source management, because it is a key feature in \nQoS provisioning. There are many different scenarios for the e-\nhealth\/telemedicine services that can exist within the multi-\nlayer hierarchical mobile network structure.  \nVII. SCENARIOS AND REQUIREMENTS \nEvery recorded biomedical parameter has its own \nbandwidth requirements. Some of them are presented in table 2 \nsuch as respiratory rate and heart rate. \n \nTABLE II.  THE TYPICAL BIOSIGNAL BANDWIDTH REQUIREMENTS [27] \n \nA. Simulation Parameters and Performance Evaluation \nThe location of the patient (and supported ambulances during \nthe emergency situation) can vary rapidly.  Figure 3 gives an \noverview of possible scenarios when patients need emergency \nhelp form the hospital: \n \nFigure 3.  Simulation scenario with the moving ambulance (node) \nTwo base stations are connected to the hospital by wired \nconnection. When emergency situation happens the remote \nservices are in use: such as the information inquiry systems \n(IIS), sensing devices, etc. but databases physically can be \nlocated in two different ways within telemedicine\/e-health \nservices (figure 3). First of all into the “Hospital” or in a \nmedical centre interested in data, secondly, into an organization \nwith the permission to view, a statistic committee, etc. The \nscenario includes the local patients with sensing devices \n(wireless or wired connection), information can be collected \nand store as patients’ records within the doctors’ database. It \ncan be later reviewed by the third part (admin) anonymously or \nwith patients’ permission.  \nApplication \nType \nRequired \nThroughput \nSmall \ndelay \nSmall \njitter \nTeleconsultation High Yes Yes \nTelediagnostic High Yes No \nTelemonitoring Low No No \nTeleeducation High No No \nAccess to DB Low\/High No No \nThis full text paper was peer reviewed at the direction of IEEE Communications Society subject matter experts for publication in the WCNC 2009 proceedings.\nThe technical scenario: The moving wireless nodes are \nequipped with sensing\/medical devices. An ambulance (the \nnode) may generate different types of telemedicine traffic. \nPossible types of transmitted information for the emergency \nscenario: voice, video, picture, files, etc.  This traffic will use \non-line applications: multimedia connections for audio and \nvideo exchange, biomedical signals and vital parameters (such \nas electrocardiogram (ECG) signal, blood pressure, oxygen \nsaturation, etc.) transmission.  Also, this traffic is classified as \nurgent, according to the critical nature of the information that \nshould be transmitted. For the first scenario, non congested \nnetwork will be simulated: only one moving node (an \nambulance) and base stations will be simulated in the \nhierarchical mobile network structure. In the first simulation \nscenario the network operated in non-congestion condition. \nAfter running the simulation I have got 97% confident \ninterval. The IEEE 802.11 protocol is in use. The Basic Rate is \n1 Mb, Data Rate is 11 Mb. For an ambulance, the type of \ntransmitted information is considered voice, video, file. The \nduration of the simulation is 150 second. \n1) Experiment 1:   \nTo be sure that ambulances will have the priority to \nestablish [29] connections the blocking probability should be \nzero. It can be controlled by a Threshold parameter. The \nperformance was explored according different threshold (fig. \n4), which is used to reserve the bandwidth. So, connections \nwill be admitted as long as the sum of the total allocated \nbandwidth is less than Threshold. The number of (it is similar \nin real-life scenario to the number of follow-up patients, \nambulances) is a variable as well as the Threshold parameter. \nThe blocking probability of follow-up patients was measured \nfor different thresholds. \n0\n0.02\n0.04\n0.06\n0.08\n0.1\n0.12\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30\nNumber of followup patients\nFo\nllo\nw\nup\n c\non\nne\nct\nio\nn \nbl\noc\nki\nng\n p\nro\nba\nbi\nlit\ny\nThreshold 9.5Mb\/s\nThreshold 7.5Mb\/s\n \nFigure 4.  Number of Follow-up patients vs. Blocking Probability \nAs expected, the threshold has an impact on blocking \nprobability. In particular the larger is the Threshold (in number \nof follow-up connections) the higher the blocking probability \nof follow up connections is. \n2) Experiment 2: \n     The number clinics were fixed to 2 (and then 3) and \nobserve the variation in average delay with the number of \nconnections from clinics and ambulances (fig. 6.11). The \nimpact of the average delay on the image transfer (size of \nimage file size is 5Mb, which requires 100 seconds for \ntransmission at the rate of 200 kb\/s) from ambulance was \nstudied. On the figure 5 the dependences of the number of \nclinics (the variable parameter) on the number of follow-up \npatients that were involved in simulation are presented.  \n0\n10\n20\n30\n40\n50\n60\n70\n1 5 10 20 30 40 42 44 46 48 50\nNumber of followup patients\nA\nve\nra\nge\n d\nel\nay\n o\nf t\nra\nns\nm\nitt\nin\ng \nim\nag\nes\n (s\nec\n)\ntwo clinics\nthree clinics\n \nFigure 5.  Average delay of image transfer from ambulance to clinic \nAs expected, the transmission delay increases with \nincreasing the number of clinics that are involved in simulation \nVIII. CONCLUSION \nFor the medical networks [1] delay is a critical factor, since \nthere are many cases in which a communication should be \ntimely in order to save the life of critical patients.  \nScenarios when the prioritizing scheme is applied, the \naverage delay is more that without priority, because of the \nwaiting time for a free channel in order to transmit urgent data. \nExperiment when the priority is analyzed using the Threshold \nparameter show that the more bandwidth is reserved the more \nthe average delay, than without prioritization. The more \nbandwidth is available, the less is Threshold. \n \nREFERENCES \n[1] D.D.Vergados. Simulation and Modelling Bandwidth Control in \nWireless  Healthcare Information Systems. SIMULATION 2007. 2007. \n[2] L. Beecham, BMJ: “Medicopolitical digest” 1997 \n[3] IEEE, Part 11: Wireless LAN Medium Access Control (MAC) and \nPhysical Layer (PHY) specifications. Std 8802.11-1999. \n[4] N.Maglaveras, V.Koutkias, I. Chouvarda, D.G.Goulis, A.Avramides, \nD.Adamidis, G.Louridas, E.A.Balas. Home care delivery through the \nmobile telecommunications platform: the Citizen Health System (CHS) \nperspective. International Journal of Medical Informatics, 2002. Vol. 68: \np. 99-111. \n[5] N.S.Tripathi, Handoff in cellular systems. IEEE Personal \nCommunications, 1998. 5(6): p. 26-37. \n[6] H. LI and X.Yang. Evaluation of distributed admission control for the \n802.11e EDCA. IEEE Radio Communications, September 2004: p. S20-\nS24. \n[7] IEEE 802.11 WG, Draft Supplement to IEEE Standard 802.11-1999: \nMedium Access Control (MAC) Enhancements for Quality of \nService(QoS).IEEE 802.11e\/D5.0. 2003. \nThis full text paper was peer reviewed at the direction of IEEE Communications Society subject matter experts for publication in the WCNC 2009 proceedings.\n[8] Standard IEEE 802.11. Wireless LAN medium access control(MAC) \nand physical layer (PHY) specifications. 1997. \n[9] V. Rialle, J.B.Lamy, N. Nour; L. Bajolle, Telemonitoring of patients at \nhome: a software approach”, Computer Methods and Programs in \nBiomedicine. Computer Methods and Programs in Biomedicine, 2003. \nVol. 72(No 3): p. pp. 257-268. \n[10] K.Shimizu, Telemedicine by mobile communication. IEEE Engineering \nin Medicine and Biology Magazine 1999: p. 18(4):32–44. \n[11] A.Nafaa, A.Ksentini, and A.Mehaoua. Scw: Sliding contention window \nfor efficient service differentiation in 802.11 networks. The IEEE \nWireless Communication and Networking Conference. 2005. In Proc of. \nIEEE WCNC 2005. \n[12] IEEE, Part 11: Wireless LAN Medium Access Control (MAC) and \nPhysical Layer (PHY) specifications: High-speed Physical Layer in the 5 \nGHZ Band. std 802.11a-1999. \n[13] M.J.Sicklick, M.D., FAAAAI, FACAAI. Available from: \nhttp:\/\/yourtotalhealth.ivillage.com\/breathing-problems.html. \n[14] M.Engin, Y.Yamaner and E.Z.Engin. A biotelemetric system for human \nECG measurements. Measurement, 2005. Vol. 38(Issue 2): p. 148-153. \n[15] K.Holger, A.Willing. Protocols and Architectures for wireless sensor \nnetworks. 2005. \n[16] D. Gu, J. Zhang. QoS Enhancement in IEEE802.11 Wireless Local Area \nNetworks. July 2003. \n[17] http:\/\/www.omnest.com\/. OMNEST-Discrete Event Simulation. \n[18]  H. Schulzrinne, Requirements for Resource Priority Mechanisms for the \nSession Initiation Protocol (SIP). 2003. \n[19] N. Vaidya, P.Bahl, and S. Gupta., Distributed fair scheduling in a \nwireless lan, in Annual International Conference on Mobile Computing \nand Networking August 2000: Boston,USA. \n[20]  S. Wietholter, C.Hoene. Design and Verification of an IEEE 802.1e \nEDCF Model in ns-2.26, in The TKN technical reports series. 2003: \nBerlin. \n[21] S. Mangold, S.Coi, P.May, O.Klein, G.Hiertz, and L.Stibor, IEEE \n802.11e Wireless LAN for Quality of Serviced (invited paper), in In \nProceedings of the European Wireless. February 2002: Florence, Italy. p. \n32-39. \n[22] L. Cheng, I. Marsic. User-domain Multiservice Architecture for Wired \nand Wireless IP Networks. IEEE. 2000. \n[23] I. Martínez, J.Salvador, J. Fernández, J. García. Traffic requirements \nevaluation for a telemedicine network. International Congress on \nComputational Bioengineering, España, 2 2003 \n[24] P.Dudzik, M.Schotter, A.Kassler, A.Lupper, P.Schulthess. Wireless \nATM as a base for medical multimedia applications and telemedicine. \nComputer Systems and Applications - CSA'98, Irbid, Jordan. April \n1998. \n[25] Yi Liu, S.S.Pawar, C.Assi and A.Agarwal. Dynamic Admission and \nCongestion Control for Real-time Traffic in IEEE 802.11e Wireless \nLANs. . IEEE 2006. \n[26] F.Hu, S.Kumar, QoS Considerations in Wireless Sensor Networks for \nTelemedicine. Proceedings of SPIE ITCOM Conference, Orlando, FL, \n2003. \n[27]  D.J. Vergados, D.D.Vergados., I. Maglogiannis, Applying Wireless \nDiffServ for QoS Provisioning in Mobile Emergency Telemedicine. \nIEEE Communications Society subject matter experts for publication in \nthe IEEE GLOBECOM 2006 proceedings, 2006. \n[28] Study Report. The e-Health Innovation Professionals Group of IHM, \nThe Impact of e-Health and Assistive Technologies on Healthcare. 2005. \n[29] D.Niyato, E.Hossain, J.Diamond. IEEE 802.16\/WiMAX Based \nBroadband wireless access and its application for telemedicine\/e-health \nservices. IEEE Wireless communications. Accepted from Open Call. \nFebruary 2007. \n \n \n \n \nThis full text paper was peer reviewed at the direction of IEEE Communications Society subject matter experts for publication in the WCNC 2009 proceedings.\n"}