{"doi":"10.1016\/j.envpol.2008.07.019","coreId":"63648","oai":"oai:nora.nerc.ac.uk:3705","identifiers":["oai:nora.nerc.ac.uk:3705","10.1016\/j.envpol.2008.07.019"],"title":"Long term trends in mercury and PCB congener concentrations in gannet (Morus bassanus) eggs in Britain","authors":["Pereira, M. Glória","Walker, Lee A.","Best, Jennifer","Shore, Richard"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009","abstract":"Gannet (Morus bassanus) eggs from Bass Rock (North Sea) and Ailsa Craig (eastern\\ud\nAtlantic) were monitored for PCB congeners (1990-2004) and total mercury (1974-2004).\\ud\nCongener profiles for both colonies were dominated by PCBs 153, 138, 180, 118 and 170.\\ud\nAll declined in concentration at Ailsa Craig but some (153, 170, 180) remained stable or\\ud\nincreased slightly at Bass Rock. Egg congener concentrations at Bass Rock were typically\\ud\n10-fold higher than at Ailsa Craig by 2002, and Principal Component Analysis indicated\\ud\nthat colony differences were driven by the dominant congeners. Egg mercury\\ud\nconcentrations were significantly lower at Bass Rock than Ailsa Craig and temporal trends\\ud\ndiffered, there being a significant decline at Ailsa Craig but a marginal increase at Bass\\ud\nRock. Our results suggest there may be differences in contamination between the eastern\\ud\nAtlantic and North Sea and\/or there are colony differences in prey selection and associated\\ud\ncontaminant loads","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/63648.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/3705\/5\/PereiraEnvPollplusFigsPP.pdf","pdfHashValue":"e66e43c26d72a591b08b81197209fb751f6b1335","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:3705<\/identifier><datestamp>\n      2012-11-22T12:03:57Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533236<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      7375626A656374733D5337<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3705\/<\/dc:relation><dc:title>\n        Long term trends in mercury and PCB congener concentrations in gannet (Morus bassanus) eggs in Britain<\/dc:title><dc:creator>\n        Pereira, M. Glória<\/dc:creator><dc:creator>\n        Walker, Lee A.<\/dc:creator><dc:creator>\n        Best, Jennifer<\/dc:creator><dc:creator>\n        Shore, Richard<\/dc:creator><dc:subject>\n        Zoology<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:subject>\n        Chemistry<\/dc:subject><dc:description>\n        Gannet (Morus bassanus) eggs from Bass Rock (North Sea) and Ailsa Craig (eastern\\ud\nAtlantic) were monitored for PCB congeners (1990-2004) and total mercury (1974-2004).\\ud\nCongener profiles for both colonies were dominated by PCBs 153, 138, 180, 118 and 170.\\ud\nAll declined in concentration at Ailsa Craig but some (153, 170, 180) remained stable or\\ud\nincreased slightly at Bass Rock. Egg congener concentrations at Bass Rock were typically\\ud\n10-fold higher than at Ailsa Craig by 2002, and Principal Component Analysis indicated\\ud\nthat colony differences were driven by the dominant congeners. Egg mercury\\ud\nconcentrations were significantly lower at Bass Rock than Ailsa Craig and temporal trends\\ud\ndiffered, there being a significant decline at Ailsa Craig but a marginal increase at Bass\\ud\nRock. Our results suggest there may be differences in contamination between the eastern\\ud\nAtlantic and North Sea and\/or there are colony differences in prey selection and associated\\ud\ncontaminant loads.<\/dc:description><dc:date>\n        2009<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3705\/5\/PereiraEnvPollplusFigsPP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Pereira, M. Glória; Walker, Lee A.; Best, Jennifer; Shore, Richard.  2009  Long term trends in mercury and PCB congener concentrations in gannet (Morus bassanus) eggs in Britain.   Environmental Pollution, 157. 155-163.  https:\/\/doi.org\/10.1016\/j.envpol.2008.07.019 <https:\/\/doi.org\/10.1016\/j.envpol.2008.07.019>     \n <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.envpol.2008.07.019<\/dc:relation><dc:relation>\n        doi:10.1016\/j.envpol.2008.07.019<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/3705\/","http:\/\/dx.doi.org\/10.1016\/j.envpol.2008.07.019","doi:10.1016\/j.envpol.2008.07.019"],"year":2009,"topics":["Zoology","Ecology and Environment","Chemistry"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \n \n \nArticle (refereed) \n \n \n \nPereira, M. Glória; Walker, Lee A.; Best, Jennifer; Shore, \nRichard. 2009 Long term trends in mercury and PCB \ncongener concentrations in gannet (Morus bassanus) \neggs in Britain. Environmental Pollution, 157. 155-163. \n10.1016\/j.envpol.2008.07.019 \n \n \n \n \nCopyright ©  2008 Elsevier Ltd. \n \nThis version available at http:\/\/nora.nerc.ac.uk\/3705\/ \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the journal \narticle, incorporating any revisions agreed during the peer review \nprocess. Some differences between this and the publisher’s version \nremain. You are advised to consult the publisher’s version if you wish \nto cite from this article. \n \nwww.elsevier.com \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnora@ceh.ac.uk \n \n \n \nThe NERC and CEH  trade marks and logos (‘the Trademarks’) are registered trademarks of NERC in the UK and \nother countries, and may not be used without the prior written consent of the Trademark owner. \n 1 \nLong term trends in mercury and PCB congener concentrations \nin gannet (Morus bassanus) eggs in Britain. \n \nM. Glória Pereira1*, Lee A. Walker1, Jennifer Best2 & Richard F. Shore1 \n \n1NERC Centre for Ecology and Hydrology, Lancaster Environment Centre, Library \nAvenue, Bailrigg, Lancaster, LA1 4AP, UK. \n 2Natural England, Northminster House, Peterborough, PE1 1UA, UK. \n \n \n*Corresponding author: \nDr M. Glória Pereira \nNERC Centre for Ecology and Hydrology,  \nLancaster Environment Centre,  \nLibrary Avenue,  \nBailrigg,  \nLancaster, \nLA1 4AP,  \nUK \n \nTel: +44 (0) 01524 595963 \nFax: +44 (0) 01524 61536 \ne-mail: mdgds@ceh.ac.uk  \n \n \n \n \n \n \n \n \n 2 \nAbstract \nGannet (Morus bassanus) eggs from Bass Rock (North Sea) and Ailsa Craig (eastern \nAtlantic) were monitored for PCB congeners (1990-2004) and total mercury (1974-2004). \nCongener profiles for both colonies were dominated by PCBs 153, 138, 180, 118 and 170. \nAll declined in concentration at Ailsa Craig but some (153, 170, 180) remained stable or \nincreased slightly at Bass Rock. Egg congener concentrations at Bass Rock were typically \n10-fold higher than at Ailsa Craig by 2002, and Principal Component Analysis indicated \nthat colony differences were driven by the dominant congeners. Egg mercury \nconcentrations were significantly lower at Bass Rock than Ailsa Craig and temporal trends \ndiffered, there being a significant decline at Ailsa Craig but a marginal increase at Bass \nRock. Our results suggest there may be differences in contamination between the eastern \nAtlantic and North Sea and\/or there are colony differences in prey selection and associated \ncontaminant loads.   \n \nKeywords- Gannets, PCBs, mercury, Ailsa Craig, Bass Rock and temporal trends. \n \nCapsule:  Monitoring of PCBs and Hg in gannet eggs reveals contrasting temporal \npatterns between colonies on the eastern Atlantic and North Sea coasts of Britain.  \n \n1. Introduction \nPolychlorinated biphenyls (PCBs) were produced commercially between the 1930s \nand 1970s in most industrialised countries and were widely used in industry and in \n 3 \ncommercial products (Rice et al., 2003 and references therein). They are highly persistent \nand their use in open sources, release from damaged and degraded closed sources, and \nsubsequent atmospheric transport has resulted in contamination of foodchains throughout \nthe world. Similarly, mercury (Hg) frequently occurs in various environmental \ncompartments, partly due to its natural occurrence but mainly because of widespread \ncontamination from fossil fuel combustion, industry (such as chlor-alkali plants) and \nagriculture (Navarro et al., 1993; Carpi, 1997). PCBs and Hg are toxic, persistent, and are \nonly slowly metabolised by vertebrates (Walker and Livingstone, 1992). Consequently, \nthese contaminants progressively bioaccumulate in lipid rich organs in biota  (Moriarty, \n1990; Furness, 1993) and high levels of exposure have been related to various adverse \neffects (Giesy et al., 1994; Herzke et al., 2002), particularly on reproduction (Moriarty, \n1990; Furness, 1993; Walker, 1994; Grassman et al., 1998).  \nCoastal birds are an important part of the marine and coastal ecosystems (Furness \nand Monaghan, 1987). They tend to occupy high trophic levels and, as a result, \nbioacummulate a wide range of contaminants via their diet. Because of this, contamination \nlevels in their body tissues and eggs have been used as biomonitors of exposure to \npersistent pollutants (Fox et al., 1991; Bishop et al., 1995). Coastal birds are good \nbioindicators because they reveal current environmental exposure and respond relatively \nrapidly to contamination events (Lewis and Furness, 1991). Eggs are considered a \nparticularly favourable matrix for monitoring because the contents are highly consistent in \ncomposition and reflect the exposure of a consistent part of the population (breeding \nfemales). Egg production results in the excretion of environmental contaminants, \nparticularly hydrophilic pollutants, by females (Burger, 1994; Gochfeld and Burger, 1998; \nConnell et al., 2003; Lam et al., 2004) and several studies have shown that seabird eggs are \n 4 \nindicative of local contamination, reflecting pollutant intake by females foraging close to \nthe colony prior to laying (Walker, 1994; Becker et al., 1998). Previous winter intake and \nage-dependent bioaccumulation are only minor contributors to the overall contaminant \nconcentrations in eggs (Sell et al., 1974; Kambamanolidimou et al., 1991).  \nAir and soil concentrations of PCBs and Hg have fallen since PCB production \nceased and emission levels of Hg in Europe decreased (Lead et al., 1997; Fowler et al., \n2006). Although, PCB and Hg contaminant concentrations are reported to have fallen in \nsome terrestrial and aquatic biota during the 1970s and 1980s, concentrations after 1990 \nappear to have levelled off or may even be increasing (Cifuentes et al., 2003; Simpson, \n2007; Walker et al., 2007). One of the long term biomonitors of contaminant levels in \nmarine systems around Britain has been gannet (Morus bassanus) eggs (Newton et al., \n1990; Alcock et al., 2002; Shore et al., 2005). A previous study on eggs collected up until \n1987 from colonies off both the Atlantic and North Sea coasts of Britain revealed a decline \nin Hg concentrations in two colonies (including Ailsa Craig) but a significant increase in \nfour colonies (including Bass Rock) (Newton et al., 1990). This study also recorded  a \nsignificant decrease in total PCB concentrations in eggs from four colonies (includ ing Bass \nRock and Ailsa Craig) and an increase for two colonies, but temporal trends of individual \nPCB congeners were not reported (Newton et al., 1990). A subsequent study of gannet eggs \nfrom a colony from the Atlantic coast of Britain found that there typically had been an \norder of magnitude decrease in PCB congeners between 1977 and 1998;  PCB congener \nconcentrations in eggs from North Sea colonies were not reported (Alcock et al., 2002).  \nThe aim of our present study was to examine how PCB congener and Hg \nconcentrations in the eggs of gannets off the coast of Britain have changed over time. We \nhave used long-term data that included new measurements of PCB congener and Hg \n 5 \nconcentrations that cover the period 1987-2004. Furthermore, we aimed to determine if \nPCB congener profiles and temporal trends of major PCB congeners differed significantly \nbetween gannet eggs from the eastern Atlantic and North Sea coasts of Britain; such \ncomparisons have not previously been carried out.  \n \n2. Materials and Methods \n2.1. Egg collection \nGannet eggs were collected in two colonies, Ailsa Craig and Bass Rock. Ailsa Craig \nis a granite island situated in the outer part of the Firth of Clyde on the west coast of \nScotland (Figure 1). It is a Site of Special Scientific Interest, being a nesting ground for \nseabirds, especially gannets, and it has been estimated to contain around 9 % of the world’s \ngannet population during the breeding season (Mitchell et al., 2004). Bass Rock is an island \nin the outer part of the Firth of Forth on the east coast of Scotland in the North Sea (Figure \n1). It is also a Site of Special Scientific Interest due to its gannet colony which holds \napproximately 11% of the world population of gannets during the breeding season \n(Mitchell et al., 2004). Breeding gannets feed locally but also forage up to 150 Km away \nfrom the colonies (Tasker et al., 1985; Hamer et al., 2001).  However, gannets do not fly \noverland to feed and so the foraging areas of birds from Bass Rock and Ailsa Craig do not \noverlap; gannets from Bass Rock forage in the North Sea whereas birds from Ailsa Craig \nfeed in waters to the west of Britain.  \nThe eggs used in this study were collected under licence as part of the long-term \nmonitoring programme of the Predatory Bird Monitoring Scheme (PBMS; \n 6 \nhttp:\/\/pbms.ceh.ac.uk). Eight to twelve fresh eggs were taken during laying or the early \nincubation period from separate nests from each colony. Sampling was carried out \napproximately every two years between 1971 and 2004. The length, breadth and weight of \neach egg were measured. The contents were collected either by “blowing” (removed \nthrough a small hole or opening in the egg) or, in more recent years, by cracking the eggs \nopen. The contents were homogenised, kept at -200C for 6 to 9 months after collection, and \nthen analysed.   \n \n2.2. Chemical analyses \nA suite of 25 PCB congeners (8, 18, 28, 29, 31, 52, 77, 101, 105, 114, 118, 123, \n126, 128, 138, 149, 153, 156, 157, 167, 169, 170, 180, 189 and 209) were determined in \ngannet eggs using gas chromatography with electron capture detection (GC-ECD). These \nanalyses were only conducted from 1990 onwards and data are not available for eggs \ncollected before this date. A sub- sample of each egg (1-2 g) was thawed, weighed \naccurately, ground with sand, dried with anhydrous sodium sulphate, and cold extracted in \n50 ml of 1:1 acetone:hexane mixture. Half of the extract was evaporated to zero volume, \nthe lip id content determined gravimetrically, and the extract was then re-dissolved in \nhexane. Lipids were removed from the extract using an alumina glass column packed with \n1g of pre-treated alumina (4 h at 800°C) that had been deactivated with 5 % deionised \nwater (w\/w). Prior to analysis, dichlobenil was added as an internal standard. A 4 µl aliquot \nof each extract was injected into the gas chromtograph (Agilent, Wokingham, UK) using a \nsplitless injector, and a 50 m HT8 column (0.22 mm internal diameter and 0.25 µm film \nthickness, SGE Milton Keynes, UK). The injector temperature was set at 250°C and the \n 7 \ncarrier gas was helium (2.0 ml min-1). The temperature programme was: isothermal at 50°C \nfor 2 min, 45°C min-1 to 200°C, 1.5°C min-1 to 240°C, 2°C min-1 to 285°C, 50°C min-1 to \n325°C and isothermal at 325°C for 10 min. The detector temperature was set at 335°C. \nResidues were quantified using the internal standard method and also using calibration \ncurves of the standard PCBs (Greyhound Ltd, Birkenhead, UK).  \nTotal Hg concentrations were measured in approximately 1 g sub-samples from \neach homogeneised egg. Samples were dried to constant weight at 80°C for 24 hours, \nsolubilised at room temperature overnight in 2ml of (Analar) nitric acid, then heated at \n90°C for 20 minutes followed by 120°C for 1 hour. To further digest the organic matter, 0.5 \nml of 30 % hydrogen peroxide were added to the sample which was then heated at 120°C \nfor 15 minutes. Samples were diluted with double-deionised water to known volume and a \n10 % acid strength. Cold vapour atomic absorption spectrophotometry using 10% tin \nchloride in 20 % hydrochloric acid as a reducing agent, nitrogen as a carrier gas, and an \nabsorbance wavelength of 253.7 nm was used to determine total Hg concentrations.  \nFor quality control and assurance purposes, a sample blank, a sample of an \nuncontaminated chicken egg and second sample of chicken egg spiked with a known \nconcentration of PCB congeners or Hg were analysed with each batch of samples. \nRecovery values determined from the spike samples varied between 75% and 110% for the \nPCB congeners and between 70 % and 114 % for Hg.  Limits of detection (LoD), \ndetermined from the calibration curve and based on the mean weight of the egg contents \nthat were analysed, varied between 0.029 and 0.157 ng g_1 wet weight (wet wt.) for PCB \ncongeners and between 0.79 and 2.09 µg\/g dry weight (dry wt.) for different years for Hg; \nHg determinations in eggs were below the LoD. Recoveries and limits of detection did not \n 8 \nvary systematically over time for PCB congeners or Hg and data were not recovery \ncorrected. \n \n2.3. Statistical analysis \nIndividual PCB congeners and Hg concentrations are presented on a wet wt. and dry \nwt. basis, respectively. Wet weight concentrations were not corrected for fresh weight \n(Stickel et al., 1973) as all eggs were fresh on collection. For statistical purposes, non-\ndetected concentrations were assigned a value of half the limit of detection. Residue data \nhad skewed distributions and so average annual concentrations are presented as geometric \nmeans for each contaminant for each year in which eggs were analysed. These geome tric \nmean values were the data used in the statistical models used to test the significance of \nvariation in concentrations over time and between colonies. \nThe variation over time in PCB congener and Hg concentrations in eggs were \nanalysed separately for each colony by linear regression. To determine if overall absolute \nvalues and trends over time in contaminant concentrations varied significantly between \nAilsa Craig and Bass Rock, data for both colonies were analysed together using a general \nlinear model (GLM) in which colony was a factor and year a covariate. Inspection of the \nvariances in the contaminant concentration data and the residuals from the regressions and \nGLMs confirmed that the underlying assumptions of the statistical models were not \nviolated. We used Principal Component Analysis (PCA, Umetrics, Simca-P) to \ndiscriminate patterns of spatial variation in the PCB congeners. PCA was performed using \nall individual congener concentrations as input variables. The PCA is not sensitive to \ncovariance and uneven variance among the variables and does not require the analytical \n 9 \nerror in the predictor variables to be negligible. Before analysis, all variables were mean \ncentered and scaled to unit variance. \n \n3. Results \n3.1. PCB congener profile \nSome PCB congeners (8, 18, 28, 29, 77, 123, 126, 157, 189, 209) had annual mean \nconcentrations that were always or mostly below detection limits and are not reported \nfurther. The LoDs of these congeners were similar (within the same range) to those that had \nhigher mean concentrations. The remaining congeners (31, 52, 101, 105, 114, 118, 128, \n138, 149, 153, 156, 167, 169, 170 and 180) were detected more frequently and the \ngeometric mean and range of their concentrations are given in Table 1. These congeners \nwere detected in 15.4 to 100% of the samples (Table 1). Four congeners (PCB 31, 52, 101 \nand 169) were detected in <50% of the samples and five congeners (118, 138, 153, 170 and \n180) were detected in > 95% of the samples. \nPCBs in the eggs from both colonies were dominated by the same five congeners \n(Figure 2 and Table 1). PCB 153 was the most dominant, occurring in concentrations of up \nto 0.58 µg g-1 wet wt. and comprising approximately 30-40% of the congener summed total \nPCB concentration. PCBs 138 and 180 between them comprised another 30-40% of the \ncongener sum total PCBs and, like PCB 153, occurred in concentrations around 10 times \nhigher than those of other congeners. PCBs 118 and 170 together comprised a further 15-\n20% of the total PCB concentration and were present in concentrations up to 0.12 µg g-1 \nwet wt. A sixth congener, PCB 128, contributed less on average to the sum total PCB \n 10 \nconcentration than the other dominant congeners (Figure 2), but also occurred in \nconcentrations of up to 0.12 µg g-1 wet wt. when present. Congeners 31, 52, 101, 105, 114, \n149, 156, 167 and 169 were present in (geometric mean) concentrations of up to 0.05 µg g-1 \nwet wt.  \n3.2. Temporal trends in PCBs  \nAlthough the dominant congeners in eggs at Ailsa Craig and Bass Rock were \nsimilar, temporal trends in congener concentrations were not always consistent between the \ntwo colonies.  Concentrations of four congeners (PCBs 138, 128, 118 and 170) declined \nsignificantly over time in eggs from Ailsa Craig (R2 = 0.674, F(1,4) = 9.82, P= 0.05 in all \ncases; Figure 3). At  Bass Rock, PCBs 138 and 128 likewise decreased significantly during \nthe monitoring period (R2 = 0.653 F(1,4) = 8.52, P=0.05; Figure 3) and rates of decline did \nnot differ significantly from those at Ailsa Craig (F (1,,8)  = 2.69, P = 0.05). The half- lives for \nthese congeners, determined using linear regression analyses for data for the two colonies \ncombined, were 4.7 years (PCB 138) and 2.5 years (PCB 128). Concentrations of PCB 118 \nin Bass Rock eggs also decreased (Figure 3). Although this decline was not statistically \nsignificant (R2 = 0.141, F(1,5) = 0.84, P = 0.402), it  did not differ (F(1,10) = 0.18, P = 0.684) \nfrom the significant decline observed at Ailsa Craig. The overall half-life for PCB 118 (data \nfor both colonies combined) was 11.7 years.  \nIn contrast, the temporal trend for PCB 170 did differ significantly between the two \ncolonies (F 1,10=4.96, P=0.05). In eggs from Ailsa Craig, PCB 170 decreased with a half- life \nof 4.4 years whereas, in Bass Rock, the concentration of this congener appeared to be \nincreasing around 14 % (Figure 3), although not significantly (R2 = 0.06, F(1,5) = 0.32, P = \n0.598). The lack of any decline for PCB 170 in Bass Rock eggs precluded the calculation of \n 11 \na half- life for this congener at this location. The concentrations of the remaining dominant \ncongeners (153 and 180), appeared to remain constant or decline marginally (although not \nsignificantly; R2 = 0.313, F(1,5)= 2.27, P>0.05 in all cases) at both colonies. The half- lives \nfor PCBs 153 and 180, calculated using data pooled for the two colonies, were 47.8 and \n42.4 years, respectively.  \nOverall, differences between colonies in temporal trends were reflected by the fact \nthat the concentrations of most congeners were typically at most two-fold higher in Bass \nRock eggs than in Ailsa Craig eggs in 1992, but were typically 10- fold higher by 2002 \n(Table 1).  \n3.3. Spatial variability in PCBs \nMost of the spatial variation in PCB congeners was explained by the first two \nprincipal components in our PCA model (PC1: 83.0%; PC2: 12.4%). There was a certain \ndegree of separation along PC1, with the majority of eggs from Ailsa Craig grouped on the \nnegative side and most of the Bass Rock eggs spreading across the negative and positive \nsides (Figure 4A). The more evident clustering of the Ailsa Craig data suggests a higher \nsimilarity in PCB concentrations in eggs from this colony compared with those from Bass \nRock. PC2 also highlighted some separation between colonies, with most of Ailsa Craig’s \neggs having a positive score and Bass Rock eggs having negative and positive scores. The \nPCA loadings showed that the separation between Ailsa Craig and Bass Rock was driven \nmainly by the dominant congeners, with the main cluster of data for Ailsa Craig eggs \nappearing to be less influenced by these dominant congeners (Figure 4B). Samples with \npositive PC1 were highly influenced by PCBs 138, 153 and 180 and had high concentration \nof these PCBs, which included some eggs from Bass Rock and from Ailsa Craig. Samples \n 12 \nwith positive scores in PC2 were mostly influenced by congener 138 and those with \nnegative loadings were dominated mostly by congeners 180, 153, 118 and 170 (Figure 4B). \nThe dominant congeners driving the observed separation pattern between the two colonies \nwere also some of the heavier congeners (higher level of chlorination) that were analysed. \n3.4.TEQs \n The toxicity of individual congeners was assessed using the toxic equivalent \napproach (Van den Berg et al., 1998). We determined the concentrations of the TCDD toxic \nequivalents (TEQs) for each individual egg analysed between the years of 1998 to 2004. \nTEQs for eggs from previous years were not calculated because the suite of relevant \ncongeners that were analysed was incomplete. The minimum and maximum concentrations \nof the TCDD toxic equivalents (TEQs) in gannet eggs from Ailsa Craig varied between \n0.079 and 166.5 pg g-1 wet wt. and those from Bass Rock varied between 1.99 and 46.7 pg \ng-1 wet wt..  \n3.5. Hg \nGeometric mean Hg concentrations varied between 1.5 and 5.1 µg g-1 dry wt. in \neggs from Ailsa Craig, with the highest mean concentration in 1971 and the lowest in 1997. \nHg concentrations in eggs from Bass Rock varied between 0.8 µg g-1 dry wt. (in 1977) and \n2.7 µg g-1 dry wt. (1981) and, over the whole period of monitoring, were significantly lower \nthan in eggs from Ailsa Craig (F1,33=24.1, P<0.005). The temporal trends for Hg differed \nfor the two colonies. Hg concentrations in Ailsa Craig eggs declined significantly from the \n1970s to 2004 (R2=0.661 F(1,17)= 33.2, P<0.001), whereas Hg concentrations in eggs from \nBass Rock increased marginally over the same period, although the increase was not \n 13 \nstatistically significant (R2=0.073 F(1,16) = 1.27, P>0.05; Figure 5). The difference in \ntemporal trends between the two colonies was highly significant (F(1,,33) =23.8, P<0.001). \n \n4. Discussion \n4.1.  PCB congener profile \nThe PCB congeners profiles (Figure 2) suggest a marked similarity in \ncontamination in eggs between Ailsa Craig and Bass Rock. In both colonies, PCBs 153, \n138 and 180 predominated and accounted for more than 70% of the sum of total congeners. \nThe same dominant congeners were detected in gannet eggs from Ailsa Craig by Alcock et \nal. (2002), and other studies have shown that these same congeners account for most (70-\n90%) of the PCBs in the eggs of other raptors (Herzke et al., 2002). PCB contamination in \nthe eggs of white-tailed sea eagles (Haliaeetus albicilla ), another marine fish eating bird, is \nalso dominated by PCB 138 (Herzke et al., 2002). The similarity in egg PCB congener \nprofiles across species with different feeding habits and trophic status most probably reflect \nselective bioaccumulation of each congener across several trophic levels (Norstrom, 1988; \nBorlakoglu et al., 1990a). Studies that examined congener patterns in birds relative to their \nprey (Braune and Norstrom, 1989; Guruge and Tanabe, 1997) or to the original congener \ncomposition in Aroclor source mixtures (Borlakoglu et al., 1990b) revealed that PCBs can \nbe broadly classified into persistent or readily degraded congener groups. The more rapidly \neliminated compounds possess unsubstituted vicinal ortho-meta positions and the most \npersistent lack unsubstituted carbons in the meta-para positions (Walker, 2001). In our \nstudy all dominant congeners belonged to the latter group. Their recalcitrant nature is \n 14 \ntherefore, likely to account for the observed congener profile and the similarity between \ncolonies.  \n \n4.2. Spatio-temporal trends in PCB congeners and Hg \nSome individual PCB congeners in eggs from Ailsa Craig and Bass Rock were \ndeclining, continuing a trend observed since the 1970s (Alcock et al., 2002). An overall \ndecrease in PCB residues in gannet eggs was expected as rapid declines in \norganochlorinated compounds were observed in the 1970s and 1980s following their ban or \nreduced usage in the USA, Western Europe and Canada (Newton et al., 1990; Newton et \nal., 1999). However, while the calculated half- life of congener 138 for Ailsa Craig (3.2 \nyears; this study) was approximately two-fold lower than that estimated for the period \n1977-1998 (Alcock et al., 2002), the half- life of congener 118 was similar in both studies (5 \nyears in this study and 5.9 years in Alcock et al., 2002). In contrast, the half- life of \ncongener 153, estimated at 10.1 years by Alcock et al. (2002), almost doubled (18 years). \nThis increase in half- lives is not unique to gannets; other studies have also shown that the \nrate of decrease of PCBs has slowed over the last decade (Becker and Cifuentes, 2004; \nBraune et al., 2005). Variance in the temporal trends of half- lives for congeners may reflect \ndifferences in initial environmental inputs and remobilisation processes. \nThe temporal trends for some congeners varied spatially. The most marked was \nPCB 170, concentrations declining with a half- life of 4.4 years in eggs from Ailsa Craig but \nincreasing marginally in eggs from Bass Rock. The differences between colonies in \ntemporal trends for individual congeners were reflected by PCA, the more homogenous \npattern of decline across congeners in Ailsa Craig eggs being indicated by tighter clustering \n 15 \nin the PCA compared with eggs from Bass Rock (Figure 4A). The dominant congeners, \nwhich were some of the heavier congeners studied, appear to be the main drivers of the \nspatial distinction between colonies. The eggs from Bass Rock with higher concentrations \nof these congeners had positive scores in PC1 and the Ailsa Craig eggs appeared to be less \ninfluenced by these congeners (Figure 4B). The presence of higher concentrations of \nrecalcitrant congeners in Bass Rock eggs suggest that gannets in this colony could be \naffected by these contaminants for longer than those from Ailsa Craig. The lack of \ndegradation of these congeners can account for their relatively high concentrations, but \ncannot explain spatial differences in temporal trends.  \nThere was also spatial variation in both the absolute concentrations and temporal \ntrends for Hg residues in gannet eggs. Mercury concentrations were higher in eggs from \nAilsa Craig (west coast) than in those from Bass Rock (east coast), as found in earlier years \n(Newton et al., 1990).  An east-west gradient was observed in Hg concentrations in \ncommon loon (Gavia immer) eggs across North America that was consistent with Hg \ndeposition patterns (Evers et al., 2003). However, air Hg concentrations are currently \nhigher in eastern that western Scotland (Fowler et al., 2006), the opposite of the west-east \ndifference in Hg that we observed in the gannet eggs. Furthermore, temporal trends in egg \nHg also varied between Ailsa Craig and Bass Rock with a lo ng-term decline at Ailsa Craig \nbut a slight increase, though not statistically significant, at Bass Rock. A decline in Hg \nlevels in eggs, as seen at Ailsa Craig, may have been expected given  there has been a \ndecrease in the emission levels of Hg in Western Europe. However this has not occurred in \ngannet eggs at Bass Rock (this study) nor at some other colonies off the British coast \n(Newton et al., 1990).  It is notable that mercury concentrations in the eggs of thick-billed \n 16 \nmurres (Uria lomvia ) and Northen fulmars (Fulmarus glacialis) have also increased \nsignificantly between 1975 and 1998 (Braune et al., 2002; Lindberg et al., 2002).   \nVarious factors may account for the spatio-temporal differences in egg PCB and Hg \nconcentrations between Ailsa Craig and Bass Rock. Gannets forage within 150 km of their \ncolonies in the breeding season (Tasker et al., 1985; Hamer et al., 2001) and so pollutants in \ngannet eggs from Ailsa Craig and Bass Rock would be expected to reflect local \nenvironmental contamination (Thyen et al., 2000; Braune et al., 2001) of the eastern \nAtlantic\/Irish Sea and the North Sea, respectively. Our results indicate that contaminants in \ngannet prey that are then assimilated by females and mobilised into their eggs differ \nbetween these two areas. Contamination can occur via riverine inputs, direct discharges and \natmospheric deposition, the first two being largely coastal processes. Sediments from sites \ncloser to urban\/industrial storm runoff discharges have been found to have heavier PCBs \nthan those far away from the discharge site (Becker et al., 2001) and differences between \ncolonies in absolute concentrations and temporal trends may reflect differences between \nareas in contaminant inputs from coastal sources. However, redistribution from sinks, such \nas contaminated sediments, is also potentially a major source of higher chlorinated PCB \nand of re-suspended inorganic and methylated Hg.  \nAlthough gannets feed mainly on herring, mackerel and to a lesser extent sandeels \n(Hamer et al., 2001), they also exploit locally abundant fish (Martin, 1989). Differences in \nexposure pathways and trophic level between fish species are likely to affect their \ncontaminant uptake and the subsequent assimilation of contaminants by predators. Thus, \ninter-colony variation in feeding preferences could account for differences in contaminant \nlevels and trends between eggs from Ailsa Craig and Bass Rock. Furthermore, a study of \nBass Rock gannets in 2002-2003 found that discarded demersal fish were an important \n 17 \ncomponent of the diet (Kakela et al., 2007). If gannets feed substantially on discard from \ncommercial trawlers (Hamer et al., 2001), their exposure to contaminants via diet may not \nnecessarily reflect local contamination. Furthermore, demersal fish tend to have higher \nconcentrations of Hg than pelagic fish (Arcos et al., 2002) suggesting that gannets feeding \nin demersal fish would have a higher intake of Hg than those feeding on pelagic fish. Short \nand long term spatio -temporal variation in egg contaminant concentrations could in part \nsignal temporal variation and the importance of discard in the diet. \n \n4.4. Potential toxicity of PCBs and Hg in gannet eggs \n No Observable Effect Concentrations (NOECs) for toxic equivalents (TEQs) of \nbetween 1.5 and 200 pg TEQs g-1 wet wt. and Lowest Observed Effect Concentrations \n(LOECs) of between 10 and 2200 pg g-1 wet wt. have been established in the eggs of \nvarious experimental and wild birds (AMAP, 1998). The LD50 for embryo mortality in \nwhite leghorn chickens, one of the more sensitive species, has been shown to range \nbetween 115 and 147 pg g-1 TEQ wet wt (AMAP, 1998). Thus, there is considerable \noverlap between NOEC, LOEC and LD50 TEQ values which, in part, reflects species \nvariation in sensitivity. The (geometric mean) TEQ concentration in the gannet eggs in the \ncurrent study in both colonies were within the range of the NOEC values or were at the \nlower end of the established LOECs. Therefore based on the TEQ concentrations, it appears \nlikely that the levels of PCBs in gannet eggs are not toxicologically significant, and should \nnot affect reproduction. \nHg concentrations ranging between 1.5 and 18 µg g-1 dry wt. in bird eggs have been \nassociated with adverse effects, including decrease in egg weight, embryo malformations, \n 18 \nlower hatchability, decrease chick growth, and reduced survival of the young (Thompson, \n1996; Burger and Gochfeld, 1997). In our study, the levels of Hg measured in all gannet \neggs from Ailsa Craig were within the range of concern (1.5 to 5.1 µg g-1 dry wt.), as well \nas in some eggs from Bass Rock (0.8 to 2.7 µg g-1 dry wt.). Therefore, it is possible that \nsome gannet embryos from both colonies may experience adverse effects due to Hg. \nHowever, we have no specific evidence of Hg- induced toxicity from either colony, and, \nfurthermore, there is marked species variation in sensitivity to Hg. Seabirds naturally \naccumulate relatively high Hg tissue concentrations because the physical-chemical aquatic \nconditions can facilitate the conversion of inorganic Hg into bioavailable methyl-mercury \nwhich accumulates in fish and their predators (Monteiro and Furness, 2001; Wiener et al., \n2003), and may be relatively insensitive compared with other species.  \n \n5. Conclusions \nOur long term monitoring has demonstrated clear spatio-temporal differences in \nPCB congener and Hg contamination in gannet eggs between the Ailsa Craig and Bass \nRock colonies. Our results suggest that contamination levels may differ between the eastern \nAtlantic and the North Sea regions off the British coast.  However, some or all of the \nvariation between colonies may also be explained by variation in prey selection. Parallel \nanalysis of sediments, water and fish, together with food web studies using isotopic labelled \ncompounds (13C and 15N), are needed to elucidate the underlying factors controlling inter-\ncolony variation in PCB and Hg bioaccumulation by gannets. The lack of any decline in \nsome contaminants,  for example some of the heavier PCB congeners and Hg in gannets at \nBass Rock, highlights a need for further monitoring to determine future risk.  \n 19 \n \nAcknowledgements - This work is part of the Predatory Bird Monitoring Scheme \n(http:\/\/pbms.ceh.ac.uk) and is supported by Centre for Ecology & Hydrology (CEH), Joint \nNature Conservation Committee (JNCC) and Environment Agency (EA). \n \nReferences \nAlcock, R.E., Boumphrey, R., Malcolm, H.M., Osborn, D., Jones, K.C., 2002. Temporal \nand spatial trends of PCB congeners in UK Gannet eggs. Ambio 31, 202-206. \nAMAP, 1998. AMAP assessment report: arctic pollution issues. Arctic monitoring and \nassessment programme (AMAP), Oslo, Norway. \nArcos, J.M., Ruiz, X., Bearhop, S., Furness, R.W., 2002. Mercury levels in seabirds and \ntheir fish prey at the Ebro Delta (NW Mediterranean): the role of trawler discards as a \nsource of contamination. Marine Ecology-Progress Series 232, 281-290. \nBecker, P.H., Cifuentes, J.M., 2004. Contaminants in Bird Eggs in the Wadden Sea. Recent \nSpatial and Temporal Trends, Seabirds at Risk? Effects of Environmental Chemicals on \nReproductive Success and Mass Growth of Seabirds Breeding at the Wadden Sea in the \nMid 1990s. Wadden Sea Ecosystem, No 18. \nBecker, P.H., Cifuentes, J.M., Behrends, B., Schmieder, K.R., 2001. Contaminants in Bird \nEggs in the Wadden Sea. Spatial and temporal trends 1991-2000. Wadden Sea Ecosystem, \nNo 11, p. 68. \nBecker, P.H., Thyen, S., Mickstein, S., Sommer, U., Schmieder, K.R., 1998. Monitoring \npollutants in coastal bird eggs in the Wadden Sea. Wadden Sea ecosystem No 8 report, \nfinal report of the pilot study 1996-1997. Germany, pp. 59-98. \nBishop, C.A., Koster, M.D., Check, A.A., Hussell, D.J.T., Jock, K., 1995. Chlorinated \nhydrocarbons and mercury in the sediments, red-winged blackbirds (Agelaius Phoeniceus) \nand tree swallows (Tachycineta bicolor) from wetlands in the Great lakes- St Lawrence \nriver basin. Environmental Toxicology and Chemisty 14, 491-501. \nBorlakoglu, J., Wilkins, J., Walker, C., Dils, R., 1990a. Polychlorinated biphenyls (PCBs) \nin fish-eating sea birds. III. Molecular features and metabolic interpretations of PCB \nisomers and congeners in adipose tissues. Comparative Biochemistry and Physiology 97, \n173-177. \nBorlakoglu, J.T., Wilkins, J.P.G., Walker, C.H., Dils, R.R., 1990b. Polychlorinated \nbiphenyls (PCBs) in fish-eating seabirds - II. Molecular features of PCB isomers and \n 20 \ncongeners in adiposer tissue of male and female puffin (Fratercula arctica), guillemots \n(Uria aalge), shags (Phalacrocorax aristotelis) and cormorants (Phalacrocorax carbo) of \nBritish and Irish coastal waters. Comparative Biochemistry and Physiology 97C, 161-171. \nBraune, B., Norstrom, R., 1989. Dynamics of organochlorine compounds in herring-gulls - \n.3. Tissue distribution and bioaccumulation in Lake-Ontario Gulls. Environmental \nToxicology and Chemistry 8, 957-968. \nBraune, B.M., Donaldson, G.M., Hobson, K.A., 2001. Contaminant residues in seabird \neggs from the Canadian Arctic. Part I. Temporal trends 1975-1998. Environmental \nPollution 114, 39-54. \nBraune, B.M., Donaldson, G.M., Hobson, K.A., 2002. Contaminant residues in seabird \neggs from the Canadian Arctic. II. Spatial trends and evidence from stable isotopes for \nintercolony differences. Environmental Pollution 117, 133-145. \nBraune, B.M., Outridge, P.M., Fisk, A.T., Muir, D.C.G., Helm, P.A., Hobbs, K., Hoekstra, \nP.F., Kuzyk, Z.A., Kwan, M., Letcher, R.J., Lockhart, W.L., Norstrom, R.J., Stern, G.A., \nStirling, I., 2005. Persistent organic pollutants and mercury in marine biota of the Canadian \nArctic: An overview of spatial and temporal trends. Science of the Total Environment 351, \n4-56. \nBurger, J., 1994. Heavy metals in avian eggshells: another excretion method. Journal of \nToxicology and Environmental Health 41, 207-220. \nBurger, J., Gochfeld, M., 1997. Risk, mercury levels, and birds: relating adverse laboratory \neffects to field biomonitoring. Environmental Research 75, 160-172. \nCarpi, A., 1997. Mercury from combustion sources: a review of the chemical species \nemitted from their transport in the atmosphere. Water Air and Soil Pollution 98, 241 - 254. \nCifuentes, J.M., Becker, P.H., Sommer, U., Pacheco, P., Schlatter, R., 2003. Seabird eggs \nas bioindicators of chemical contamination in Chile. Environmental Pollution 126, 123-\n137. \nConnell, D.W., Fung, C.N., Minh, T.B., Tanabe, S., Lam, P.K.S., Wong, B.S.F., Lam, \nM.H.W., Wong, L.C., Wu, R.S.S., Richardson, B.J., 2003. Risk of breeding success of fish-\neating Ardeids due to persistent organic contaminants in Hong Long: evidence from \norganochlorine compounds in eggs. Water Research 37, 459-467. \nEvers, D.C., Taylor, K.M., Major, A., Taylor, R.J., Poppenga, R.H., Scheuhammer, A.M., \n2003. Common loon eggs as indicators of methylmercury availability in North America. \nEcotoxicology 12, 69-81. \nFowler, D., McDonald, A.G., Crossley, A., Nemitz, E., Leaver, D., Cape, J.N., Smith, R.I., \nAnderson, D., Rowland, P., Ainsworth, G., Lawlor, A.J., Guyatt, H., Harmens, H., 2006. \nUK Heavy Metal Monitoring Network. Centre for Ecology and Hydrology, p. 120. \nFox, G.A., Weseloh, D.V., Kubiak, T.J., Erdman, T.C., 1991. Reprodutive outcomes in \ncolonial fish-eating birds - A biomarker for developmental toxicants in Great-Lakes food \n 21 \nchains.1. Historical and ecotoxicological perspectives. Journal of Great Lakes Research 17, \n153-157. \nFurness, R.W., 1993. Birds as monitors of pollutants, in: Furness, R.W., Greenwood, J.J.D. \n(Eds.), Birds as monitors of environmental change. Chapman & Hall, London, pp. 86-143. \nFurness, R.W., Monaghan, P., 1987. Seabird ecology. Blacky & Son., Glasgow, London. \nGiesy, J.P., Ludwig, J.P., Tillitt, D.E., 1994. Deformities in birds of the Great Lakes region: \nassessing casualty. Environmental Science and Technology 28, 128-135. \nGochfeld, M., Burger, J., 1998. Temporal trends in metal levels in eggs of endangered \nRoseate tern (Sterna dougallii) in New York. Environmental Research Section A 77, 36-42. \nGrassman, K.A., Seanlon, P.F., Fox, G.A., 1998. Reproductive and physiological effects of \nenvironmental contaminants in fish-eating birds of the Great Lakes: a review of historical \ntrends. Environmental Monitoring Assessment 53, 117-145. \nGuruge, K., Tanabe, S., 1997. Congener specific accumulation and toxic assessment of \npolychlorinated biphenyls in common cormorants, Phalacrocorax carbo, from Lake Biwa, \nJapan Environmental Pollution 96, 425-433. \nHamer, K.C., Phillips, R.A., Hill, J.K., Wanless, S., Wood, A.G., 2001. Contrasting \nforaging strategies of gannet Morus bassanus at two North Atlantic colonies: foraging trip \nduration and foraging area fidelity. Marine Ecology Progress Series 224, 283-290. \nHerzke, D., Kallenborn , R., Nygård, T., 2002. Organochlorines in egg samples from \nNorwegian birds of prey: Congener-, isomer- and enantiomer specific considerations. The \nScience of the Total Environment 291, 59-71. \nKakela, A., Furness, R.W., Kelly, A., Strandberg, U., Waldron, S., Kakela, R., 2007. Fatty \nacid signatures and stable isotopes as dietary indicators in North Sea seabirds. Marine \nEcology-Progress Series 342, 291-301. \nKambamanolidimou, A., Kamarianos, A., KIilikidis, S., 1991. Transfer of methylmercuty \nto hens eggs after oral-admnistration Bulletin of Environmental Contamination and \nToxicology 46, 128-133. \nLam, J.C.W., Tanabe, S., Wong, B.S.F., Lam, P.K.S., 2004. Trace element residues in eggs \nof little egret (Epretta garzetta) and Black-crowned Night Heron (Nycticorax nycticorax) \nfrom Hong Kong, China. Marine Pollution Bulletin 48, 390-396. \nLead, W.A., Steinnes, E., Bacon, J.R., Jones, K.C., 1997. Polychlorinated biphenyls in UK \nand Norwegian soils: Spatial and temporal trends. Science of the Total Environment 193, \n229-236. \nLewis, S.A., Furness, R.W., 1991. Mercury accumulation and excretion in laboratory reared \nBlack-headed Gull Larus ridibundus chicks. Archives of Environmental Contamination and \nToxicology 21, 316-320. \n 22 \nLindberg, S., Brooks, S., Lin, C., Scott, K., Landis, M., Steven, R., Goodsite, M., Rihter, \nA., 2002. A dynamic oxidation of gaseous mercury in the Artic troposphere at polar \nsunrise. Environmental Science and Technology 36, 1245-1256. \nMartin, A.R., 1989. The diet of Atlantic Puffin Fratercula arctica and Northen Gannet Sula \nbassana chicks at a Shetland colony during a period of changing prey availabilty. Bird \nStudy 36. \nMitchell, P.I., Newton, S.F., Norman, R., Dunn, T.E., 2004. Seabird Populations of Britain \nand Ireland. T. & A. D. Poyser Publishers, London. \nMonteiro, L.R., Furness, R.W., 2001. Kinetics, dose-response, and excretion of \nmethylmercury in free- living adult Cory's shearwaters. Environmental Science & \nTechnology 35, 739-746. \nMoriarty, F., 1990. Ecotoxicology - the study of pollutants in ecosystems. Academic Press, \nLondon. \nNavarro, M., Lopez, H., Sanches, M., Lopez, M., 1993. The effect of industrial-pollution on \nmercury levels in water , soil, and sludge in the coastal area of Motril, Southeast Spain. \nArchives of Environmental Contamination and Toxicology 24, 11-15. \nNewton, I., Dale, L., Little, B., 1999. Trends in organochlorine and mercurial compounds \nin the eggs of British merlins Falco columbarius. Bird Study 46, 356-362. \nNewton, I., Haas, M.B., Freestone, P., 1990. Trends in organochlorine and mercury levels \nin gannet eggs. Environmental Pollution 63, 1-12. \nNorstrom, R., 1988. Bioaccumulation of polychlorinated biphenyls in Canadian wildlife., \nin: Crine, J. (Ed.), Hazards, decontaminations and replacement of PCB. Plenum New York, \nNY, pp. 85-100. \nRice, C.P., O'Keefe, P., Kubiak, T., 2003. Sources, pathways, and effects of PCBs, dioxins, \nand Dibenzofurans, in: Hoffman, D.J., Rattner, B.A., Burton Jr., G.A., Cairns Jr., J. (Eds.), \nHandbook of ecotoxicology. Lewis Publishers, London, New York, pp. 501-573. \nSell, J.L., Guenter, W., Sifri, M., 1974. Distribution of mercury among components of eggs \nfollowing admnistration of methylmercuricchloride to chickens. Journal of Agricultural and \nFood Chemistry 22, 248-251. \nShore, R. F., Malcolm, H.M, Wienburg, C.L, Turk, A., Walker, L.A, , Horne, J., 2005. \nWildlife and pollution: 2000\/01: Annual report, JNCC Report, No. 351. \nSimpson, V.R., 2007. Health status of otters in southern and south west England 1996-\n2003, Using science to create a better place. Environment Agency, Bristol, p. 91. \nStickel, L.F., Wiemeyer, S.N., Blus, L.J., 1973. Pesticide-Residues in Eggs of Wild Birds - \nAdjustment for Loss of Moisture and Lipid. Bulletin of Environmental Contamination and \nToxicology 9, 193-196. \nTasker, M.L., Jones, P.H., Blake, B.F., Dixon, T.J., 1985. The marine distribution of the \ngannet Sula bassana in the North Sea. Bird Study 32, 82-90. \n 23 \nThompson, D.R., 1996. Mercury in birds and terrestrial mammals, in: Beyer, W.N., Heinz, \nG.H., Redmon-Norwood, A.W. (Eds.), Environmental contaminants in wildlife: \ninterpreting tissue concentrations. CRC Lewis Publishers, Boca Raton, pp. 341-356. \nThyen, S., Becker, P.H., Behmann, H., 2000. Organochlorine and mercury contamination \nof Little Terns (Sterna albifrons) breeding at the western Baltic Sea, 1978-1996. \nEnvironmental Pollution 108, 225-238. \nVan den Berg, M., Birnbaum, L., Bosveld, A.T.C., Brunstrom, B., Cook, P., Feeley, M., \nGiesy, J.P., Hanberg, A., Hasegawa, R., Kennedy, S.W., Kubiak, T., Larsen, J.C., van \nLeeuwen, F.X.R., Liem, A.K.D., Nolt, C., Peterson, R.E., Poellinger, L., Safe, S., Schrenk, \nD., Tillitt, D., Tysklind, M., Younes, M., Waern, F., Zacharewski, T., 1998. Toxic \nequivalency factors (TEFs) for PCBs, PCDDs, PCDFs for humans and wildlife. \nEnvironmental Health Perspectives 106, 775-792. \nWalker, C., 2001. Organic pollutants: an ecotoxicological perspective. Taylor & Francis, \nNY. \nWalker, C., Livingstone, D.R., 1992. Persistent pollutants in marine ecosystems. Pergamon \nPress, Oxford. \nWalker, C.H., 1994. The ecotoxicology of persistent pollutants in marine fish-eating birds., \nin: Walker, C., Livingstone, D.R. (Eds.), Persistent pollutants in marine ecosystems. \nPergamon Press, Oxford, pp. 211-232. \nWalker, L.A., Simpson, V.R., Rockett, L., Wienburg, C.L., Shore, R.F., 2007. Heavy metal \ncontamination in bats in Britain. Environmental Pollution 148, 483-490. \nWiener, J.G., Krabbenhoft, D.P., Heinz, G.H., Scheuhammer, A.M., 2003. Ecotoxicology \nof mercury in: Hoffman, D.J., Rattner, B.A., Burton, G.A., Jr, Cairns, J., Jr (Eds.), The \nhandbook of Ecotoxicology. Lewis Publishers, New York, pp. 409-463. \n \n \n \n 24 \nFigure Legends \nFigure 1. Location of Ailsa Craig (West Scotland) and Bass Rock (East Scotland) colonies. \nFigure 2. Individual congeners as a percentge of the congener sum in gannet eggs from Bass Rock \nand Ailsa Craig for 2002. \nFigure 3. Time trends of dominant PCB congeners in gannet eggs from Bass Rock and Ailsa Craig. \nFigure 4. Scores (A) and loadings (B) of the two first principal components from a principal \ncomponent analysis of PCB congeners. \nFigure 5. Temporal trends in Hg concentration (µg g-1 wet weight) in gannet eggs from Bass Rock \n(A) and Ailsa Craig (B). \n \n \n \n \n \n \nTable Legends \nTable 1. PCB congener concentrations (geometric mean and range, ng g-1 wet weight) from 1990 to \n2004 in Gannet eggs collected from Bass Rock and Ailsa Craig. % detected – percent detected \nabove limit of detection; n - is the number of eggs analysed per year. ND - below detection limit; \nNot Deter – Not determined. \n \n \nFigure  1 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAilsa Craig \nBass Rock \nNorth Sea \nN \nIrish Sea \n 250 Km \nAtlantic \nOcean \nFigure  2 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAisla Craig\n0\n5\n10\n15\n20\n25\n30\n35\n40\nP\nC\nB\n15\n3\nP\nC\nB\n18\n0\nP\nC\nB\n13\n8\nP\nC\nB\n11\n8\nP\nC\nB\n17\n0\nP\nC\nB\n10\n5\nP\nC\nB\n11\n4\nP\nC\nB\n12\n8\nP\nC\nB\n16\n9\nP\nC\nB\n10\n1\nP\nC\nB\n03\n1\nP\nC\nB\n05\n2\nP\nC\nB\n15\n6\nP\nC\nB\n14\n9\nP\nC\nB\n16\n7\n%\nBass Rock \n0\n5\n10\n15\n20\n25\n30\n35\n40\nP\nC\nB\n15\n3\nP\nC\nB\n13\n8\nP\nC\nB\n18\n0\nP\nC\nB\n11\n8\nP\nC\nB\n17\n0\nP\nC\nB\n11\n4\nP\nC\nB\n12\n8\nP\nC\nB\n10\n5\nP\nC\nB\n14\n9\nP\nC\nB\n15\n6\nP\nC\nB\n16\n9\nP\nC\nB\n16\n7\nP\nC\nB\n03\n1\nP\nC\nB\n05\n2\nP\nC\nB\n10\n1\n%\nFigure  3 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPCB 138\ny = -0.0169x + 33.963\ny = -0.0277x + 55.446\n0.00\n0.10\n0.20\n0.30\n0.40\n1989 1994 1999 2004\nYears\nge\nom\net\nri\nc \nm\nea\nn \n(µ\ng \ng-\n1 w\n.w\n.) \n   \nPCB 128\ny = -0.0061x + 12.206\ny = -0.0035x + 6.9751\n0.00\n0.02\n0.04\n0.06\n0.08\n1989 1994 1999 2004\nYears\nge\nom\net\nri\nc \nm\nea\nn \n(µ\ng \ng-\n1 w\n.w\n.) \n   \nAisla Craig\nBass Rock\nPCB 118\ny = -0.0017x + 3.5106\ny = -0.0034x + 6.8675\n0.00\n0.03\n0.06\n0.09\n0.12\n1989 1994 1999 2004\nYears\nge\nom\net\nri\nc \nm\nea\nn \n(µ\ng \ng-\n1 w\n.w\n.) \n   \nPCB 153\ny = -0.0012x + 2.6849\ny = -0.0075x + 15.297\n0.00\n0.15\n0.30\n0.45\n0.60\n1989 1994 1999 2004\nYears\nge\nom\net\nri\nc \nm\nea\nn \n(µ\ng \ng-\n1 w\n.w\n.) \n   \nPCB 170\ny = 0.001x - 1.9452\ny = -0.0041x + 8.1282\n0.00\n0.03\n0.05\n0.08\n0.10\n1989 1994 1999 2004\nYears\nge\nom\net\nri\nc \nm\nea\nn \n(µ\ng \ng-\n1 w\n.w\n.) \n   \nPCB 180\ny = -0.0049x + 9.91\ny = 0.0002x - 0.2336\n0.00\n0.05\n0.10\n0.15\n0.20\n0.25\n1989 1994 1999 2004\nYears\nge\nom\net\nri\nc \nm\nea\nn \n(µ\ng \ng-\n1 w\n.w\n.) \n   \nFigure  4 \n \n  \n \n \n \n \n \n \n-0.2\n-0.1\n-0.0\n0.1\n0.2\n-0.4 -0.3 -0.2 -0.1 0.0 0.1 0.2 0.3 0.4 0.5 0.6 0.7\nAC\nAC\nAC\nACAC\nAC\nAC\nAC\nAC\nAC\nAC\nAC\nACAC\nAC\nAC\nAC\nAC\nAC\nAC\nACAC\nAC\nAC\nAC\nAC\nAC\nAC\nAC\nAC\nAC\nAC\nAC AC\nAC\nACAC\nACAC\nAC\nACAC\nAC\nAC\nACAC\nAC\nAC\nAC\nACAC\nAC\nAC\nAC\nAC\nAC\nBR\nBR\nBR\nBR\nBR\nBRBR\nBR\nBRBR\nBR BRBR BRBR\nBR\nBR\nBR\nBRBR\nBR\nBR\nBR\nBR\nBRBR\nBR\nBRBR\nBR\nBR\nBR\nBR\nBR\nBR\nBR\nBR\nBR\nBR\nBR\nBR BR\nBR\nBRBR\nBR\nBR\nBR\nBR\nBRBR\nBR\nBR\nBR\nBR\nBR\nBRBR\nBR\nBRBR\nBR\nBR\nBR\n  \n \n \n      \n \nP\nC\n2,\n 1\n2.\n4%\n \nPC1, 83.0% \n \n-0.4 \n-0.2 \n-0.0 \n0.2 \n0.4 \n0.6 \n0.8 \n-0.1 0.0 0.1 0.2 0.3  0.4 0.5 0.6  0.7 \nPCB031 \nPCB052  PCB101  PCB105 \nPCB114  \nPCB118 \nPCB128 \nPCB138 \nPCB149 \nPCB153 \nPCB156 \n67PCB169 \nPCB170 \nPCB180 \nB A \nFigure  5 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \ny = 0.0147x - 27.409\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\n1970 1980 1990 2000\nyear\nge\nom\net\nri\nc \nm\nea\nn \n(µ\ng \ng-\n1 \ndr\ny \nw\nei\ngh\nt)\n      A\ny = -0.0759x + 153.54\n0.0\n1.0\n2.0\n3.0\n4.0\n5.0\n6.0\n1970 1980 1990 2000\nyear\nge\nom\net\nri\nc \nm\nea\nn \n(µ\ng \ng-\n1 \ndr\ny \nw\nei\ngh\nt)    B\n Table 1.  \n  Ailsa Craig Bass Rock \nPCB \n% \ndete\ncted \n1990 \n(n=10) \n1992 \n(n=9) \n1994 \n(n=9) \n1997 \n(n=10) \n1998 \n(n=9) \n2000 \n(n=10) \n2002 \n(n=10) \n1990 \n(n=10) \n1992 \n(n=10) \n1994 \n(n=10) \n1996 \n(n=10) \n1998 \n(n=9) \n2002 \n(n=10) \n2004 \n(n=10) \n31 15.5 Not deter 0.3 ND-19.1 \n0.4 \nND-7.1 \nND \nND-ND \nND \nND-ND \nND \nND-ND \nND \nND-ND Not deter \n0.2 \nND-40.0 \n0.5 \nND-11.2 \nND \nND-ND \n0.2 \nND-6.1 \nND \nND-ND \nND \nND-ND \n52 15.4 ND ND-ND \n1.0 \nND-84.2 \n0.1 \nND-8.2 \nND \nND-ND \n0.1 \nND-6.1 \nND \nND-ND \nND \nND-ND \nND \nND-ND \n1.0 \nND-61.3 \nND \nND-ND \n2.9 \nND-66.2 \n0.2 \nND-11.0 \nND \nND-ND \n0.1 \nND-4.9 \n101 41.2 ND ND-ND \n2.1 \nND-33.2 \n1.9 \nND-7.7 \n0.4 \nND-91.2 \n0.2 \nND-3.2 \n0.5 \nND-139.1 \nND \nND-ND \nND \nND-ND \n0.3 \nND-47.1 \n2.0 \nND-22.1 \n0.9 \nND-148.1 \n2.2 \nND-22.2 \nND \nND-ND \n19.2 \n11.8-32.8 \n105 82.8 Not deter Not deter Not deter Not deter 6.7 5.6-9.0 \n0.6 \nND-873.4 \n3.7 \nND-41.0 Not deter Not deter Not deter Not deter \n21.6 \n6.3-46.4 \n16.4 \nND-44.1 \n18.1 \n12.8-30.2 \n114 55.2 Not deter Not deter Not deter Not deter 18.1 15.4-27.1 \nND \nND-ND \n1.0 \nND-24.1 Not deter Not deter Not deter Not deter \n30.8 \nND-296.2 \n36.5 \n16.3-74.4 \nND \nND-ND \n118 98.5 97.0 54.7-165.2 \n48.8 \n20.4-175.1 \n49.1 \n11.1-79.3 \n48.0 \n16.8-118.2 \n20.8 \n15.9-27.2 \n29.5 \nND-204.8 \n16.4 \nND-44.4  \n111.7 \n83.8-161.1 \n58.3 \n25.1-129.3 \n44.2 \n25.2-86.5 \n93.6 \n60.8-209.0 \n70.2 \n18.1-175.3 \n69.7 \n32.2-139.7 \n56.2 \n40.2-104.0 \n128 86.2 Not deter 55.7 23.0-133.6 \n46.8 \n8.7-86.5 \n15.1 \nND-75.5 \n13.6 \n11.3-20.1 \n2.3 \nND-70.2 \n0.2 \nND-21.2 Not deter \n62.2 \n33.4-126.2 \n40.8 \n22.8-86.2 \n53.6 \n36.1-130.4 \n40.8 \n12.3-95.1 \n5.6 \nND-60.2 \n28.6 \n20.4-57.5 \n138 98.3 Not deter 248.8 101.8-714.4 \n346.9 \n56.5-905.2 \n128.3 \n53.6-301.2 \n56.1 \n43.5-74.2 \n114.0 \n34.1-399.1 \n26.9 \nND-98.8 Not deter \n275.0 \n109.2-565.1 \n261.5 \n126.2-585.6 \n233.6 \n159.2-567.4 \n168.5 \n50.6-455.2 \n147.5 \n70.1-277.4 \n62.6 \nND-244.2 \n149 64.2 Not deter 17.3 ND-95.4 \n22.4 \n5.5-43.1 \n0.7 \nND-49.1 \n0.1 \nND-2.0 Not deter \nND \nND-ND Not deter \n26.8 \n8.0-55.3 \n28.4 \n13.4-59.2 \n4.9 \nND-91.3 \n2.0 \nND-64.1 \n1.3 \nND-56.1 \n6.1 \nND-43.2 \n153 100.0 138.8 79.8-244.2 \n312.7 \n134.0-873.2 \n356.2 \n64.6-1022.2 \n314.6 \n140.2-714.5 \n119.6 \n101.8-157.2 \n246.5 \n76.6-905.1 \n105.3 \n51.6-203.3 \n220.7 \n142.1-106.5 \n352.8 \n146.3-768.6 \n241.8 \n113.9-561.4 \n581.2 \n407.0 -1478.1 \n291.0 \n42.1-1059.4 \n285.1 \n133.0-542.4 \n251.2 \n161.7-461.9 \n156 60.3 Not deter Not deter Not deter Not deter 9.3 7.8-12.3 \n0.2 \nND-68.2 \nND \nND-ND Not deter Not deter Not deter Not deter \n23.3 \n7.2-56.3 \n1.2 \nND-34.2 \n20.1 \n13.3-33.7 \n167 53.4 Not deter Not deter Not deter Not deter 2.7 2.1-3.0 \n0.1 \nND-36.3 \nND \nND-ND Not deter Not deter Not deter Not deter \n9.0 \n2.2-24.4 \n0.2 \nND-20.3 \n9.7 \n7.4-13.6 \n169 28.3 Not deter ND ND-ND \n0.3 \nND-3.2 \nND \nND-ND \n4.1 \n2.0-6.4 \n0.2 \nND-70.6 \n0.2 \nND-17.2 Not deter \nND \nND-ND  Not deter \nND \nND-ND \n1.5 \nND-22.1 \n1.2 \nND-33.1 \nND \nND-ND \n170 96.3 48.7 21.6-102.3 \n59.7 \n26.1-206.5 \n49.9 \n10.7-116.3 \n55.0 \n23.8-134.2 \n24.6 \n20.3-33.6 \n10.8 \nND-161.4 \n8.5 \nND-48.1 \n49.2 \n15.5-106.2 \n30.6 \nND-114.3 \n24.6 \n3.2-59.3 \n88.5 \n53.8-232.3 \n59.8 \n21.7-129.2 \n56.1 \n26.6-95.2 \n46.4 \n27.1-78.8 \n180 100.0 116.6 57.2-262.5 \n144.5 \n64.5-480.2 \n159.6 \n29.7-499.6 \n155.3 \n66.6-346.4 \n64.8 \n50.1-85.8 \n107.8 \n31.3-524.6 \n74.1 \n34.1-128.0 \n148.0 \n84.2-273.5 \n135.2 \n50.3-257.8 \n85.1 \n25.0-167.7 \n229.5 \n139.4-617.1 \n151.6 \n50.3-341.5 \n145.7 \n65.1-239.3 \n129.6 \n79.5-217.6 \n \n \n"}