{"doi":"10.1016\/j.csr.2010.04.009","coreId":"57410","oai":"oai:nora.nerc.ac.uk:9950","identifiers":["oai:nora.nerc.ac.uk:9950","10.1016\/j.csr.2010.04.009"],"title":"Parameterization of near-bed processes under collinear wave and current flows from a two-phase sheet flow model","authors":["Amoudry, Laurent O","Liu, Philip L.-F"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-07-31","abstract":"Sediment transport models require appropriate representation of near-bed processes. We aim here to explore the parameterizations of bed shear stress, bed load transport rate and near-bed sediment erosion rate under the sheet flow regime. To that end, we employ a one-dimensional two-phase sheet flow model which is able to resolve the intrawave boundary layer and sediment dynamics at a length scale on the order of the sediment grain. We have conducted 79 numerical simulations to cover a range of collinear wave and current conditions and sediment diameters in the range 210–460 μm. The numerical results confirm that the intrawave bed shear stress leads the free stream velocity, and we assess an explicit expression relating the phase lead to the maximum velocity, wave period and bed roughness. The numerical sheet flow model is also used to provide estimates for the bed load transport rate and to inspect the near-bed sediment erosion. A common bed load transport rate formulation and two typical reference concentration approaches are assessed. A dependence of the bed load transport rate on the sediment grain diameter is observed and parameterized. Finally, the intrawave near-bed vertical sediment flux is further investigated and related to the time derivative of the bed shear stress.\\ud\n\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/57410.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/9950\/1\/Amoudry_-_Parameterization_of_near-bed.pdf","pdfHashValue":"c5aa1e5e16bf0e39325731dec33fca4bca7da0b6","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:9950<\/identifier><datestamp>\n      2012-11-22T12:18:02Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533230<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9950\/<\/dc:relation><dc:title>\n        Parameterization of near-bed processes under collinear wave and current flows from a two-phase sheet flow model <\/dc:title><dc:creator>\n        Amoudry, Laurent O<\/dc:creator><dc:creator>\n        Liu, Philip L.-F<\/dc:creator><dc:subject>\n        Marine Sciences<\/dc:subject><dc:description>\n        Sediment transport models require appropriate representation of near-bed processes. We aim here to explore the parameterizations of bed shear stress, bed load transport rate and near-bed sediment erosion rate under the sheet flow regime. To that end, we employ a one-dimensional two-phase sheet flow model which is able to resolve the intrawave boundary layer and sediment dynamics at a length scale on the order of the sediment grain. We have conducted 79 numerical simulations to cover a range of collinear wave and current conditions and sediment diameters in the range 210–460 μm. The numerical results confirm that the intrawave bed shear stress leads the free stream velocity, and we assess an explicit expression relating the phase lead to the maximum velocity, wave period and bed roughness. The numerical sheet flow model is also used to provide estimates for the bed load transport rate and to inspect the near-bed sediment erosion. A common bed load transport rate formulation and two typical reference concentration approaches are assessed. A dependence of the bed load transport rate on the sediment grain diameter is observed and parameterized. Finally, the intrawave near-bed vertical sediment flux is further investigated and related to the time derivative of the bed shear stress.\\ud\n\\ud\n<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2010-07-31<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9950\/1\/Amoudry_-_Parameterization_of_near-bed.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Amoudry, Laurent O; Liu, Philip L.-F.  2010  Parameterization of near-bed processes under collinear wave and current flows from a two-phase sheet flow model.   Continental Shelf Research, 30 (13). 1403-1416.  https:\/\/doi.org\/10.1016\/j.csr.2010.04.009 <https:\/\/doi.org\/10.1016\/j.csr.2010.04.009>     \n <\/dc:identifier><dc:relation>\n        10.1016\/j.csr.2010.04.009<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/9950\/","10.1016\/j.csr.2010.04.009"],"year":2010,"topics":["Marine Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Parameterization of near-bed processes under collinear wave and current\nflows from a two-phase sheet flow model.\nLaurent O. Amoudry∗,a, Philip L.-F. Liub\naNational Oceanography Centre, Joseph Proudman Building, 6 Brownlow Street, Liverpool, L3 5DA, UK\nbSchool of Civil and Environmental Engineering, Cornell University, Ithaca, New York, USA\nAbstract\nSediment transport models require appropriate representation of near-bed processes. We aim here to explore\nthe parameterizations of bed shear stress, bed load transport rate and near-bed sediment erosion rate under\nthe sheet flow regime. To that end, we employ a one-dimensional two-phase sheet flow model which is\nable to resolve the intrawave boundary layer and sediment dynamics at a length scale on the order of the\nsediment grain. We have conducted 79 numerical simulations to cover a range of collinear wave and current\nconditions and sediment diameters in the range 210 µm to 460 µm. The numerical results confirm that\nthe intrawave bed shear stress leads the free stream velocity, and we assess an explicit expression relating\nthe phase lead to the maximum velocity, wave period and bed roughness. The numerical sheet flow model\nis also used to provide estimates for the bed load transport rate and to inspect the near-bed sediment\nerosion. A common bed load transport rate formulation and two typical reference concentration approaches\nare assessed. A dependence of the bed load transport rate on the sediment grain diameter is observed and\nparameterized. Finally, the intrawave near-bed vertical sediment flux is further investigated and related to\nthe time derivative of the bed shear stress.\nKey words: sediment transport modelling, sheet flows, sediment erosion, bed load transport rate,\nboundary layer\n1. Introduction\nThe coastal, marine and offshore engineering communities require sediment transport models with\ndemonstrable predictive skills, the scales of which usually range from metres to tens of kilometres. Because\nof limitations on computing resources, small-scale processes can not always be resolved and instead need to\nbe accounted for via subgrid scale modelling. This is particularly pertinent for estimating sediment\ntransport, for which near-bed processes are predominant. Such processes usually occur within the wave\nboundary layer, which is on the order of 10 cm and thus may not be resolved. In addition, sediment\n∗Corresponding author.\nEmail addresses: laou@pol.ac.uk (Laurent O. Amoudry ), pll3@cornell.edu (Philip L.-F. Liu)\nPreprint submitted to Continental Shelf Research June 4, 2010\ntransport also involves very near bed processes such as bed load transport rate, which occurs at a scale on\nthe order of a centimetre. Subgrid scale modelling is then required to describe the near-bed\nhydrodynamics and sediment dynamics, and many different parameterizations have been introduced and\nimplemented. Nevertheless, near-bed results and sediment transport rates are still not very well predicted\n(e.g., Grasmeijer et al., 2005). Discrepancies between predictions and measurements of the order of a\nfactor of ten are common for near-bed concentration, suspended load transport (Grasmeijer et al., 2005)\nand bed load transport (Kleinhans and Grasmeijer, 2006). Such disparity in turn results in questionable\nmorphological predictions (Walstra et al., 2005). Further improvements on both transport formulations\nand on the near-bed description are necessary.\nThe most common modelling approach is to consider that sediment remains dilute and use an\nadvection-diffusion equation to obtain the suspended sediment concentration. Such an approach is used in\nmodels ranging from coastal area models (e.g., Lesser et al., 2004; Warner et al., 2008) to some intrawave\nsheet flow models (e.g., Ruessink et al., 2009; Hassan and Ribberink, 2010). In coastal models, the settling\nvelocity, the sediment diffusivity and the exchange of sediment between the bed and the suspension (i.e.,\nerosion and deposition) usually all need to be further specified. Sediment bed level changes are tracked by\napplying the sediment mass conservation between the bed and the suspension: first calculating the bed\nmass change due to erosion, deposition, and the divergence of the horizontal bed load fluxes, and then\ntranslating it into a bed level change. Near-bed processes are not resolved and thus have to be\nparameterized, usually in a wave-averaged manner. Such formulations need to provide information on bed\nload transport rate and erosion rate, which in turn requires appropriate description of the bed shear stress.\nFor intrawave models, the near-bed processes may not be entirely resolved and some parameterization may\nbe necessary. Most common is providing a mathematical formulation for the intrawave erosion rate,\nthrough a reference concentration for example (e.g., Amoudry et al., 2005; Ruessink et al., 2009; Hassan\nand Ribberink, 2010).\nSuch effort, both for intrawave and wave-averaged expressions, has traditionally been pursued through\nempirical means. But some advanced small-scale local models are now able to fully resolve near-bed\nsediment transport and could thus be used to gain insight on the parameterizations pertinent to larger\nscale models. For example, detailed process models are now able to represent very near bed sediment\nbehaviour under the sheet flow regime using descriptions of two-phase sediment fluid interactions (e.g.,\nDong and Zhang, 2002; Hsu et al., 2004; Li et al., 2008) and granular flow dynamics (e.g., Jenkins and\nHanes, 1998; Drake and Calantoni, 2001). Similar two-phase models have been developed for\nmulti-dimensional studies (e.g., Zhao and Fernando, 2007; Amoudry and Liu, 2009), but their applications\nremain limited to scour problems. Other multi-dimensional models typically aim to resolve complex\nhydrodynamic processes, such as vortex formation and shedding in oscillatory flows over rippled beds (e.g.,\nMalarkey and Davies, 2002; Zedler and Street, 2006) and coherent vortex structures (Zedler and Street,\n2\n2001; Vittori, 2003), so as to assess their influence on sediment transport.\nIn spite of the relatively advanced state of process modelling for sediment transport under sheet flow\nconditions, sucessful models that do not require near-bed empirical parameterizations are still too rarely\nused as investigative tools. We aim here to discuss the parameterization of near-bed hydrodynamic and\nsediment processes using small-scale numerical results obtained with a validated two-phase sheet flow\nmodel. This model has been introduced in Hsu et al. (2004) and Amoudry et al. (2008) and validated for\nsand transport under the sheet flow regime in Amoudry et al. (2008). It is based on a two-phase approach\nthat includes a modified k − ε closure accounting for the influence of the particles on the fluid turbulence,\nand a modified collisional theory to describe the inter-particle interactions. Common near-bed empirical\nparameterizations (e.g., bed load transport rate, reference concentration) are not employed and can\ninstead be assessed due to the good predictive ability of the model and the high level of physical\ndescription and resolution.\nIn this paper, we will focus on the bed shear stress, the bed load transport rate and the erosion flux (also\ncalled resuspension, or pick-up), which are three of the most important quantities commonly\nparameterized. We will first describe in further detail the implementation of the two-phase sheet flow\nmodel. We then discuss the numerical results and the subsequent parameterizations for the bed shear\nstress, the bed load transport rate and the erosion rate. In particular, the bed load transport rate is\ncompared to a common semi-empirical formulation and the erosion rate to two widely used formulations\nfor the reference concentration.\n2. Two-phase sheet flow sediment transport modelling\n2.1. Model description\nThe sheet flow model of Hsu et al. (2004) and Amoudry et al. (2008) solves concentration-weighted\naveraged mass and momentum conservation equations for both a sediment and a fluid phase. Fluid phase\nstresses are calculated using the turbulent viscosity hypothesis and a k − ε model that is modified to\naccount for the two-phase approach and for the influence of the sediment particles on the fluid turbulence.\nSediment phase stresses are calculated using a modified collisional theory that provides a mathematical\ndescription of the particle-particle interactions (see appendix and Amoudry et al. (2008) for more details).\nComputations are performed from within the sediment bed, in which there is no sediment motion,\nthroughout the bottom boundary layer (see figure 1). The time-dependent location of the bed is thus part\nof the model’s solution and is determined using a Coulomb failure criterion (Hsu et al., 2004).\nThis two-phase sheet flow model has already been described in detail in Hsu et al. (2004), Amoudry (2008)\nand Amoudry et al. (2008), and a detailed description is presented in the appendix. It has been validated\nagainst a number of independent data sets. Hsu et al. (2004) tested the sheet flow model for relatively\n3\nmassive particles against the data of Sumer et al. (1996) for steady flows, and against intrawave sediment\nvelocity and concentration data from Asano (1995) for oscillatory flows. Amoudry et al. (2008) validated\nthe model for sheet flow sand transport against data obtained in oscillatory water tunnels with\nConductivity Concentration Meters for intrawave sediment concentration in the sheet layer\n(Dohmen-Janssen, 1999; O’Donoghue and Wright, 2004) and for sediment velocities and fluxes in the sheet\nlayer (McLean et al., 2001). Data obtained from a boroscopic technique for sediment velocity under steady\nflows (Dudley, 2007) were also reproduced by the model. Overall, these numerous model-data comparisons\ndemonstrate the good predictive behaviour of the model for near-bed intrawave concentration, velocities\nand sediment fluxes.\nThe main characteristic of this model is its ability to represent and fully resolve near-bed sediment\ndynamics, including the sheet layer and the pick-up layer (layer where concentration is anti-phase with\nflow velocity), following theoretical physical considerations. In particular, the near-bed gradients can be\nresolved, and both bed load transport rate and erosion rate are not parameterized but rather are results of\nthe model. Near-bed information can thus be obtained and used to help assess near-bed parameterizations\nused in other models for the bed shear stress, bed load transport rates, and erosion flux. It differs in that\naspect from sheet flow models that use near-bed empirical parameterizations for the reference\nconcentration (e.g., Amoudry et al., 2005; Ruessink et al., 2009; Hassan and Ribberink, 2010) and for the\nbed load transport rate (e.g., Hassan and Ribberink, 2010). We also believe that it offers more insight on\nthe small-scale physics involved than models that employ an empirical formulation for the sediment phase\nstresses (e.g., Dong and Zhang, 2002; Li et al., 2008).\nHowever, limitations exist. The two main limiting issues concern the turbulence closure and the collisional\ngranular flow theory used to respectively calculate fluid and sediment stresses. The turbulence closure\nimplemented in Amoudry et al. (2008) reduces to a typical k − ε model for clear fluid (e.g., Justesen,\n1991). Such closure has been found to reproduce the intrawave wave boundary layer dynamics reasonably\nwell, even if some discrepancy in model-data comparisons usually remains in the decelerating stage\n(Justesen, 1991). Furthermore, turbulent bursts, which have been linked to strong suspension events for\nfine sand (D50 < 0.2 mm), cannot be resolved by the ensemble-averaged approach used in the model.\nShortcomings for the sediment stress formulations are mainly due to particle-particle interactions not\noccurring in the collisional regime (Amoudry et al., 2008), which typically happens for slower flows and\nfiner sediments. These issues combine to explain the poor behaviour of the model observed for fine sand.\n2.2. Model implementation\nIn this paper, we use this sheet flow model under a number of flow and sediment conditions that remain\nwithin the limitations just discussed. The model is implemented in one dimension using a finite-difference\ndiscretization with a variable vertical grid size, which has a minimum of 0.3 mm in the near-bed region.\n4\nThe model is driven by a horizontal pressure gradient (Hsu et al., 2004; Hsu and Hanes, 2004) leading to\nthe free stream velocities (fluid velocity 10 cm above the undisturbed bed location) represented by\nequation 1 and summarized in table 1. The top boundary condition has been kept as a rigid lid (Hsu\net al., 2004) in accordance with laboratory experiments used for model validation. The bottom boundary\ncondition is located within the sediment bed, the concentration is fixed at 0.635, the velocities are fixed at\nzero, and the turbulence is determined from a log-law. Other conditions have been tested and found not to\nimpact the results due to the bottom boundary location being within the sediment bed (Amoudry, 2008).\nBecause the model cannot accurately reproduce the initiation of sediment motion, an artificial initial\ncondition is specified (Hsu et al., 2004), following which the concentration decreases linearly with height\nand the flow is at rest. Computations are then performed with the vertical velocity remaining zero (Hsu\net al., 2004) before applying the time-dependent pressure gradient. All simulations were run for 20 wave\ncycles. The results were always found to reach a quasi-steady state quickly (less than 5 wave cycles) and\nthe last fifteen cycles were used for phase and wave averaging.\nA total of 79 arbitrarily chosen cases were simulated (table 1), spanning sediment grains of diameter from\n210 µm to 460 µm and of constant specific gravity s = 2.65. Flows consisted of combinations of currents\nand (dominant) waves for which the free stream velocity is prescribed as follows:\nU0(t) = U0c + U01 cos\n2πt\nT\n+ U02 cos\n4πt\nT\n(1)\nwith U0c being the current velocity, U01 and U02 the amplitudes of the first and second wave velocity\nharmonics (in all cases U01 > U02), and T the wave period. All cases simulated present values of\nU01ω\/(s− 1)g (ω ≡ 2π\/T ) below 0.3, thus corresponding to a quasi-steady regime (Sleath, 1994). Even\nthough several wave periods have been prescribed, little dependence of the results on the period has been\nobserved. Noticeably, cases 6 and 47 correspond to some experiments of Dohmen-Janssen (1999), cases 20\nand 76 to experiments of O’Donoghue and Wright (2004), and cases 51 and 52 to the experiments of\nMcLean et al. (2001), which were all used for the model validation in Amoudry et al. (2008).\n3. Bed shear stress\nNear-bed sediment transport parameterizations are commonly expressed in terms of the Shields parameter\nθ, which is the non-dimensional bed shear stress, θ = τb\/(ρ(s− 1)gd) where τb is the bed shear stress, ρ the\nfluid density, and d the sediment grain diameter. Appropriate bottom boundary layer models are crucial\nfor obtaining accurate θ values since vertical resolution will not be sufficient to resolve the near-bed\ngradients in coastal models. Most bottom boundary layer models use a friction coefficient to relate the bed\nshear stress to the flow velocity, usually through a quadratic law. In the case of pure currents and\nvelocities evolving on timescales much longer than the numerical time step (e.g., tidal currents), the\n5\nfriction coefficient is specified directly or by assuming a logarithmic velocity profile. The later case has\nbeen extensively studied in the past decades and was also discussed in Amoudry et al. (2008).\nFor wave and wave-current bottom boundary layers, hydrodynamic process studies usually find a phase\nlead of the bed shear stress with respect to the free stream velocity (e.g. Jensen et al., 1989; Guizien et al.,\n2003) and so do the present results (figures 2 and 3). For large-scale models, the aim is to account for the\neffects of the oscillatory flow without resolving individual waves. To that end, a common approach is to\nuse again a quadratic friction law for which the wave-current friction coefficient is specified either with an\nexplicit formula (e.g., Madsen, 1994) or with an implicit method (e.g., Grant and Madsen, 1979), and for\nwhich the bed roughness may be enhanced by the waves (e.g., Madsen, 1994). For intrawave modelling,\nquadratic laws are also used (e.g., Ribberink, 1998; Hsu et al., 2006; Gonzalez-Rodriquez and Madsen,\n2007). Usually, both a constant friction factor and bed shear stress in phase with the orbital velocity are\nassumed. However, neglecting the phase lead of the bed shear stress can lead to significant errors (e.g.,\nNielsen and Callaghan, 2003) and the constant friction factor is contrary to a simple conceptual model of\nthe intrawave bed shear stress (Gonzalez-Rodriquez and Madsen, 2007). This in turn requires better\nparameterization of both the phase lead and friction factor for intrawave modelling (e.g., Madsen, 1994;\nGonzalez-Rodriquez and Madsen, 2007).\nThe bed shear stress is calculated for the sheet flow simulations as the total shear stress at the undisturbed\nbed level (i.e., z = 0 and bed level for no flow condition). Five examples of the intrawave bed shear stress\nare shown in figure 2. The form of the intrawave bed shear stress is important for developing simple\nwave-averaged models, and while it can reasonably be approximated by a decomposition into mean and\nfirst two sinusoidal harmonics (i.e., θ(t) = θc + θw1 cos(ωt) + θw2 cos(2ωt)) for the example in the second\npanel of figure 2, it is generally not the case, as illustrated by the other examples in figure 2.\nThe bed shear stress is found to have a phase lead (φτ ) mostly in the range of 10 to 15 degrees with\nrespect to the free stream velocity (figure 3) and we observe a dependence on the wave parameters. Such a\nphase shift can for example be approximated from the results of a wave-current boundary layer model\n(Madsen, 1994), which gives φτ expressed in radians:\nφτ =\nπ\n60\n[\n11− 2.0 log10\n(\nU0max\nkNω\n)]\nfor 0.2 <\nU0max\nkNω\n< 103 (2)\nwhere kN is the equivalent roughness. Our numerical results provide an estimate of the phase lead, but the\nroughness is a priori unknown. One can then use equation 2 to obtain kN values from the phase lead. This\nyields roughnesses in the range d < kN < 10d, which is consistent with the previous findings of Wiberg and\nRubin (1989), Sumer et al. (1996), and Amoudry et al. (2008). One can also focus on the inverse problem\nand assess equation 2 in combination with a roughness predictor. For example, the numerical results are\nplotted in figure 3 using a roughness value calculated following Wiberg and Rubin (1989). Interestingly,\n6\nequation 2 represents relatively well the phase lead from the numerical simulations, including for the cases\nsuch that U0max\/kNω > 10\n3.\n4. Bed load transport rate\nSediment transport is supported by two main mechanisms: interactions between sediment grains and\nagitation of fluid turbulence. Bed load is usually defined as the region where sediment motions and\nsuspension are dominated by particle-particle interactions. Conversely, the primary mechanism in the\nsuspended load is turbulent suspension, which is due to the fluid agitation. As mentioned in Amoudry\net al. (2008), both the sediment stress gradient, which mathematically represents here the suspension term\ndue to inter-particle interactions, and the fluid turbulent suspension term can be explicitly calculated from\nthe numerical results (see appendix for more details). A comparison of their relative importance then\nenables distinction between bed load and suspended load and leads to information on the bed load layer\n(figure 4). We choose to define the bed load in our results as the region for which the sediment stress\ngradient is greater than the turbulent suspension. This corresponds to the layers as depicted in figure 4\nwhere the grey dashed line marks the limit between suspended load and bed load. Although continuous,\nthe transition from bed load to suspended load is observed to be rather sharp and thus provides reasonable\nprecision on the bed load layer (figure 4). In turn, such information helps determine various near-bed\nquantities such as the bed load transport rate, for which we expect reasonable predictions given the\nfavourable model-data comparisons for near-bed sediment fluxes in Amoudry et al. (2008).\n4.1. Current approaches\nAccurately predicting sediment transport rates has been an important issue for several decades. Bed load\ntransport rates have been measured experimentally using bed load traps, leading to empirical formulae\n(e.g., Meyer-Peter and Mu¨ller, 1948; Wilson, 1966; Ribberink, 1998). The most common formulations\nrelate the non-dimensional transport rate ΦB to the Shields parameter as:\nΦB =\n\n\nmθn (θ − θc)\np\nθ ≥ θc\n0 θ < θc\n(3)\nwhere θc is the critical Shields parameter for incipient motion, m is usually taken as a constant and\nn+ p ≈ 1.5 (table 2). While such a relationship was first developed for steady flows, it has since been\nextended to time-dependent transport rates in wave-current combinations as long as a quasi-steady\napproach is valid (Ribberink, 1998). In the case of coastal area models for which the wave oscillations are\nnot resolved, the net transport rate is related to some measure of the bed shear stress over a wave period.\nFor example, Soulsby and Damgaard (2005) integrated a vectorial time-dependent formula (equation 3)\n7\nover the wave period and expressed the bed load transport rate in terms of the mean and the amplitudes\nof the first and second harmonics of the bed shear stress.\nA crucial and problematic issue in experimental studies is the distinction between bed load and suspended\nload. Measurements of bed load transport rates usually rely on the assumption that the trap only catches\nsediment transported as bed load. While this may be reasonable for massive particles unlikely to get\nsuspended (as in Meyer-Peter and Mu¨ller (1948) for example), it will lead to an overestimation of the bed\nload transport rate for finer particles which are transported as suspended load in a significant manner\n(e.g., Hassan and Ribberink, 2010). In addition, sediment traps can induce important flow modifications\nand scour leading to measurement uncertainty. In contrast, the sheet flow model provides a new method\nfor which a clear distinction between bed load and suspended load can be made.\n4.2. Numerical predictions\nNumerical results for the bed load transport rate and the empirical formula (equation 3 used in a\nquasi-steady sense) are compared within a wave period in figure 5 for the same five examples as in figure 2.\nFor the purely sinusoidal case, the comparison is relatively good throughout the wave period. For the\nother cases, the comparison is in general reasonable during the positive cycle (especially in terms of the net\nhalf cycle transport rate) and improves with higher stresses, but there is a recurring discrepancy for the\nnegative half cycle. This is consistent with the lack of accuracy of the sediment flux predictions during the\nnegative half cycle observed in Amoudry et al. (2008). Such discrepancy is not seen in the top case of\nfigure 5 and is also found to increase with decreasing particle diameters. We thus believe that it is caused\nby the limitations of the collisional theory for weak forcing and small particles. In turn, this disparity will\nlead to a positive bias for the net bed load sediment transport obtained from the numerical sheet flow\nresults and will also cause higher errors for the net values in the Stokes waves cases simulated.\nThe wave-averaged expressions of Soulsby and Damgaard (2005) allow for easy implementation of bed load\ncalculation in large-scale sediment transport models under a fairly wide range of conditions and we choose\nto compare this semi-empirical model to the numerical results obtained with the model of Amoudry et al.\n(2008) (figure 6). The circles represent cases for sinusoidal waves superposed on a current, the squares\nrepresent cases for 2nd-order Stokes waves without any current, and the diamonds are for 2nd-order Stokes\nwaves superposed on a current. This last type of flow is of particular interest given the lack of\nexperimental data (Soulsby and Damgaard, 2005). Different grain diameters are represented by symbols of\ndifferent colour. The general agreement can be considered as quite good as most points fall within a factor\ntwo of perfect agreement. Following the previous discussion on the respective accuracies of the numerical\nand experimental methods, we expect a relative overestimation from the numerical results (points above\nthe diagonal) for 2nd-order Stokes waves and a relative overprediction from the semi-empirical\nformulations (points under the diagonal) for smaller sediment diameter, both of which are indeed observed.\n8\n4.3. Improved parameterization\nWhile there is a somewhat general agreement concerning the functional form of the bed load transport\nrate, there have been a number of different values proposed for m as shown in table 2. Detailed inspection\nof figure 6 reveals that transport rates for the smaller sediments generally are below the perfect agreement\nline while transport rates for the larger sediments are above. In a simple attempt to improve the bed load\npredictions, we calculated for each sediment diameter the best value for m by minimizing the\nroot-mean-square error between numerical results and the semi-empirical equations. We neglected the\ncases for second-order Stokes wave forcing for which the numerical model is expected to perform worse. A\ndistinct dependence on the sediment diameter is obtained and illustrated in figure 7 where a factor two\ndifference is observed between small and large diameters. With the exception of the largest diameter, the\nproportionality factor is found to decrease with decreasing grain diameter. This is consistent with\nsuspension criteria (e.g., Bagnold, 1966), which can be seen as expressing that at identical Shields\nparameter, large particles are transported as bed load, while fine particles are transported as suspended\nload (see also figure 1 of Amoudry et al. (2008)). Mathematically, this behaviour can be well approximated\nby the following relationship\nm = 17.75×\n\n1− exp\n(\n− exp\n(\nRp−15\n10\n))\nexp\n(\n− exp\n(\n− 1510\n))\n\n (4)\nwhere Rp = D50\n√\n(s− 1)gD50\/ν is the fall parameter. The positive bias of the numerical predictions is\nalso observed in the values numerically calculated for the larger diameters and the factor 17.75 in equation\n4. The improvement made by adding equation 4 to the formulation of Soulsby and Damgaard (2005) is\nshown in figure 8. There is indeed a better agreement when using equation 4, in particular for the larger\ntransport rates. The root-mean-square error between numerical results and the parameterization\ndiminishes from a factor 2 to a factor 1.86 when implementing equation 4. While this may seem modest,\nthe improvement is clearer for non-dimensional transport rate over 0.2, the error diminishes from a factor\n2.04 to a factor 1.85.\n5. Erosion rate\nThe net bottom boundary sediment flux is commonly divided in an upward part (erosion, E) that\nrepresents the exchange of sediment from the bed to the flow and a downward part due to gravitational\nsettling (deposition, D). A numerical erosion flux can thus be derived from collocated and simultaneous\nnumerical results of vertical sediment flux and sediment concentration, which in turn enables assessment of\ndiverse parameterizations. Both E and D hereafter will be taken to have the dimension of a velocity,\ncorresponding to a sediment mass flux divided by the sediment density.\n9\n5.1. Current approaches\nThe main method employed to express erosion of non-cohesive sediments in terms of flow and sediment\nparameters uses the assumption that the disequilibrium introduced by the unsteadiness remains mild, and\nthat the erosion flux is equal to the entrainment rate under equilibrium conditions (Garcia and Parker,\n1991). The erosion flux is then related to a reference concentration value through the settling velocity, i.e.\nE = crefWs (e.g., Harris and Wiberg, 2001; Lesser et al., 2004). This approach usually provides a formula\nfor the reference concentration at some reference level, i.e. Cref at zref , where both Cref and zref may be\nfunctions of flow and sediment parameters such as the Shields parameter (non dimensional bed shear\nstress), the sediment specific gravity and the sediment diameter. The deposition is then calculated using\nthe non-equilibrium concentration D = cbWs, where cb is the actual bottom concentration. Many reference\nconcentration relationships have been introduced and the most commonly used formulae in large-scale\nmodels remain that of Smith and McLean (1977), van Rijn (1984) (updated most recently to van Rijn\n(2007)) and Zyserman and Fredsoe (1994).\nWe explicitly introduce the formulations of Zyserman and Fredsoe (1994) and van Rijn (2007) since they\nare used in comparisons with numerical results in the following section. The expression of Zyserman and\nFredsoe (1994) relates the reference concentration to the Shields parameter at an elevation of two grain\ndiameters above the bed:\ncref =\n0.331 (θ − 0.045)\n1.75\n1 + 0.3310.46 (θ − 0.045)\n1.75 (5)\nComparatively, the expression of van Rijn (2007) relates the reference concentration for non-cohesive\nsediments to both the Shields parameter and the non-dimensional particle parameter\nD⋆ = d[(s− 1)g\/ν\n2]1\/3:\ncref = 0.015\nd\nzref\n(θ\/θcr − 1)\n1.5\nD0.3⋆\n(6)\nwhere θcr is the critical bed-shear stress according to Shields and the reference level is chosen as\nzref = 20d with a minimum value of 1 cm.\n5.2. Numerical predictions\nAlthough it is dimensionally consistent with a concentration, the reference concentration really aims to\nparameterize the erosion flux. As such, comparisons between existing formulas and the numerical results\nshould not use the numerical concentration per se but rather the ratio of the erosion flux over the settling\nvelocity. The erosion flux itself is calculated from the net vertical flux and gravitational settling. All cases\nstudied here present values for U0ω\/(s− 1)g below 0.3 (table 1), and are thus expected to exhibit\nquasi-steadiness (Sleath, 1994), following which erosion and deposition should be in quasi-equilibrium.\n10\nThis is indeed observed for all cases, with erosion and deposition being about an order of magnitude\ngreater than the net vertical flux and in quasi-equilibrium.\nNumerical values for the reference concentration were calculated at a height of one centimetre above the\nundisturbed bed (20d < 1 cm for all our cases) for comparison with the van Rijn (2007) formula and at a\nheight of twice the sediment diameter for comparison with the Zyserman and Fredsoe (1994) formula. Five\nexamples (identical cases to those in figures 2 and 5) of the intrawave comparisons are presented in figures\n9 and 10. There is a significant disagreement between the numerical results and the van Rijn (2007)\nformula, as neither the magnitude nor the phase of the reference concentration match. We attribute such\ndiscrepancy to the reference location employed being in the suspended region. It is always higher than\ntwenty grain diameters from the undisturbed bed, and at such elevation, the vertical flux, the erosion and\nthus the reference concentration exhibit a phase lag with respect to the bed shear stress as observed in\nfigure 9.\nComparatively, there is a rather good agreement for the Zyserman and Fredsoe (1994) formula. Still, there\nis a small tendency for overprediction from the Zyserman and Fredsoe (1994) formula with respect to the\nnumerical results for the higher bed shear stresses and there is a mismatch at flow reversals. The\nseemingly constant value for the numerical reference concentration is due to the combination of being in\nquasi-equilibrium between erosion and deposition, and the reference location being close to the top of the\npickup layer. The quasi-equilibrium implies that the reference concentration is close to the actual\nconcentration, which is somewhat constant at the top of the pickup layer (O’Donoghue and Wright, 2004).\nA wave-averaged reference concentration value can also be deduced from the wave-averaged erosion flux.\nModels then usually relate the reference concentration to some measure of the wave-current bed shear\nstress, usually the maximum value. Figure 11 presents the wave-averaged values for the numerical\nreference concentration and the comparison with Zyserman and Fredsoe (1994) and van Rijn (2007)\nformulas. While the Zyserman and Fredsoe (1994) formula gives values only modestly larger than the\nnumerical model, there is a significant disagreement between the numerical results and the formula of van\nRijn (2007). Such results for the reference concentration taken two diameters above the undisturbed bed\nare consistent with experimental results of O’Donoghue and Wright (2004) following which the\nconcentration at z = 2d is almost constant with time-averaged values ranging from about 0.2 to 0.25 for\nthe medium and coarse sands.\n5.3. Comments on erosion parameterization\nFollowing from general dimensional analysis on sediment transport (e.g., Yalin, 1977), the dimensionless\nerosion rate should depend on the specific gravity of the sediment, the Shields parameter, the fall\n11\nparameter Rp = d\n√\n(s− 1)gd\/ν, and a dimensionless parameter involving the flow period ΠT .\nE√\n(s− 1)gd\n= f(s, θ, Rp,ΠT ) (7)\nSince we are interested in sand transport in water, the specific gravity of the sediment is a constant. As\nmentioned previously we did not observe a significant dependence on the period in the range considered.\nThe numerical results in figure 11 for different sediment diameters and flow conditions almost all collapse\non a single curve, which seems to indicate that the relationship\nE\nWs\n= cref (θ) (8)\nis a reasonable parameterization. This does not mean that the erosion rate is independent of the fall\nparameter but rather that it will follow the dependence of the fall velocity, i.e.\nE =Ws (Rp) cref (θ) (9)\nIt also appears from figure 11 that the reference concentration taken two diameters above the bed reaches\na maximum with the bed shear stress that is smaller than the one incorporated in the Zyserman and\nFredsoe (1994) formula. For the range of Shields parameters studied, this is not observed for the reference\nconcentration one centimetre above the bed, for which there is a small linear increase of the reference\nconcentration value with the bed shear stress.\nIn the case of the reference concentration very close to the bed (zref = 2d), a formula following the form of\nAmoudry et al. (2005)\ncref (θ) =\n\n\n0 for θ < θc\ncmax\nθ−θc\nθs−θc\nfor θc < θ < θs\ncmax for θs < θ\n(10)\nwhere cmax = 0.2, θs = 1.08 and θc = 0.15 would give a reasonable approximation both of the Zyserman\nand Fredsoe (1994) formula for small to moderate Shields parameters and of the numerical results for high\nShields parameters. The main discrepancy between equation 10 and Zyserman and Fredsoe (1994) occurs\nfor small Shields parameter values, where the sheet flow numerical model can unfortunately not provide\ninformation. Using cmax = 0.2 as an upper-bound for the Zyserman and Fredsoe (1994) reference\nconcentration would also lead to better agreement with the numerical data for the intrawave erosion.\nIn the case of the reference concentration some distance from the bed (zref = 1cm), the linear dependence\nis best approximated by\ncref = 6.1× 10\n−3θmax + 7.9× 10\n−4 (11)\nNaturally, this equation is only valid for the range of maximum Shields parameters considered in this\npaper (i.e. 1.2 < θmax < 2). In particular, equation 11 obviously fails to represent the correct processes\n12\nboth for very small stresses by predicting non zero erosion for zero bed shear stress and for very large\nstresses since it lacks an upper bound. Interestingly, such linear dependence of the reference concentration\non the bed shear stress (in both cases) results in an erosion formulation similar to that for cohesive\nsediments E =M [τb − τc] where both M and the critical stress τc depend on the depth of erosion (e.g.,\nSanford and Maa, 2001).\nPerhaps more importantly than providing information on erosion and deposition, the sheet flow numerical\nmodel calculates the instantaneous net vertical sediment flux (i.e. erosion minus deposition). In turn, we\nuse these numerical results to attempt to directly model this quantity. Figure 12 shows ten examples for\nthe intrawave vertical sediment flux two diameters above the undisturbed bed, including the five examples\nalready shown in figures 2, 5, 9 and 10. The solid line represents an attempt at modelling such flux as a\nfunction of the bed shear stress multiplied by its time derivative with a phase lag:\nE −D = CF\n[\nθ\ndθ\ndt\n]\n(ωt+ φe) (12)\nwhere CF = 2.0× 10\n−4 m. The physical reason for the term θdθ\/dt is to consider that erosion can be due\nto accelerating flow independent of direction (i.e., for θ > 0 and dθ\/dt > 0 or for θ < 0 and dθ\/dt < 0). In\ngeneral, there is a good agreement between equation 12 and the numerical data (the examples in figure 12\ndo include some of the worst cases). At flow reversals, the agreement is poor but this corresponds to times\nwhere the numerical model is the least accurate (Amoudry et al., 2008). For each case, equation 12 was\ntested by choosing the optimal phase lag for best agreement. The phase lag in equation 12 is then found to\ndecrease with the value of the maximum bed shear stress (figure 13) following\nφe = Cφ1\nτbmax\nρ\n+ Cφ2 (13)\nwhere φe is given in radians and Cφ1 = −58.6 s\n2\/m2, Cφ2 = 0.86.\n6. Conclusion\nWe used a one-dimensional two-phase sheet flow model to study and discuss large-scale parameterizations\nof the bed shear stress, bed load transport rate and erosion rate. The model was validated in Amoudry\net al. (2008) against laboratory data acquired under the sheet flow regime. The influence of the sediment\ndiameter is investigated by varying the grain diameter within the range used previously for validation (i.e.,\n210 µm to 460 µm). Different collinear wave and current flows are simulated by changing the current, the\namplitude of the first two velocity harmonics, and the period.\nThe numerical bed shear stress results confirm several previous observations on the phase lead of the bed\nshear stress with respect to the free stream velocity. The formula of Madsen (1994) for the phase lead\ndescribes the present results well. Bed load transport rates are determined from the numerical results and\n13\nare found to agree reasonably well with existing empirical formulations. Dependence with the sediment\ndiameter is observed and investigated numerically. Bed load transport rates diminish with decreasing grain\ndiameter, and an improved formula for the bed load transport rate is proposed based on the numerical\nresults. The importance of the sediment bottom condition for intrawave modelling has already been\nmentioned (e.g., Hsu and Liu, 2004) and investigated (e.g., Amoudry et al., 2005). Here, the influence of\nthe sediment diameter on the erosion rate corresponds to that of the settling velocity and thus confirms\nthe applicability of the reference concentration. Furthermore, the numerical results are found to agree\nsignificantly better with the Zyserman and Fredsoe (1994) reference concentration formulation than with\nthat of van Rijn (2007). We attribute the poor agreement in the latter case to an inappropriate reference\nlocation for sheet flows. Such results are consistent with the observations of Amoudry et al. (2005) on the\nbottom boundary condition for dilute intrawave sheet flow modelling. The present numerical results\nfurther suggest that the reference concentration taken two grain diameters above the undisturbed bed may\nbe better represented by setting an upper limit at an approximate value of 0.2, which is consistent with\nthe experimental findings of O’Donoghue and Wright (2004).\nThese results can then be implemented in sediment transport models at a larger scale. The results\nconcerning the bed load transport rate vindicate the implementation of existing formulations such as that\nof Soulsby and Damgaard (2005) in both intrawave models and wave-averaged models. They further\nsuggest the use of a diameter-dependent multiplicating factor for the bed load transport rate, which would\nfollow the relationship expressed in equation 4. The present results on the reference concentration support\nthe use of the Zyserman and Fredsoe (1994) formula with an upper limit around 0.2 for intrawave models\naiming to resolve suspended sediment transport in the wave boundary layer under the sheet flow regime\n(e.g., Amoudry et al., 2005; Ruessink et al., 2009; Hassan and Ribberink, 2010). Alternatively, such models\nmay implement equations 12 and 13 for the net vertical flux instead of the reference concentration\napproach. For wave-averaged coastal models, implementation of the present results (e.g., equations 10 and\n11) may be less straightforward due to the sheet flow regime restriction and issues arising from the\nnear-bed resolution. Typically, in such models the bottom grid may well be large enough to induce\nsignificant corrections emanating from the difference between near-bed grid elevations and the reference\nlocation. Such corrections are crucial and may be derived assuming a Rouse profile for the concentration.\nFinally, it has to be noted that the present numerical results could strongly benefit from further theoretical\nimprovements. As mentioned in Amoudry et al. (2008), transport of sand under the sheet flow regime falls\nclose to or past the limit for reasonable use of the collisional theory. This leads to discrepancies in the\nnear-bed sediment fluxes and the inability of the model to reproduce fine sand (d < 200 µm) transport.\nWe believe that both issues would benefit from theoretical description of the particle-particle interactions\nmore complete than pure collisions.\n14\nAcknowledgments\nWe wish to thank two anonymous reviewers for their comments, which greatly helped to improve the\nmanuscript. L. O. Amoudry wishes to acknowledge the support of the Natural Environment Research\nCouncil (NERC), through core funding to the Proudman Oceanographic Laboratory. P. L.-F. Liu would\nlike to acknowledge the support from National Science Foundation, New York Sea Grant Institute through\nresearch grants to Cornell University. He would also like to thank the Humboldt Foundation for the\nResearch Award Fellowship.\nA. Two-phase sheet flow model description\nA.1. Two-phase flow governing equations\nThe model solves the following concentration-weighted averaged equations of motion for the sediment and\nfluid phase:\n∂ρf(1− c¯)\n∂t\n+\n∂ρf (1− c¯)u˜\nf\ni\n∂xi\n= 0 (A.1)\nfor the fluid phase continuity,\n∂ρsc¯\n∂t\n+\n∂ρsc¯u˜\ns\ni\n∂xi\n= 0 (A.2)\nfor the sediment phase continuity,\n∂ρf(1− c¯)u˜\nf\ni\n∂t\n= −\n∂ρf(1− c¯)u˜\nf\ni u˜\nf\nj\n∂xj\n+ ρf (1− c¯)gi\n−(1− c¯)\n∂P¯ f\n∂xi\n+\n∂τfij\n∂xj\n−βc¯\n(\nu˜fi − u˜\ns\ni\n)\n+ β\nνT\nσc\n∂c¯\n∂xi\n(A.3)\nfor the fluid phase momentum conservation and\n∂ρsc¯u˜\ns\ni\n∂t\n= −\n∂ρsc¯u˜\ns\ni u˜\ns\nj\n∂xj\n+ ρsc¯gi − c¯\n∂P¯ f\n∂xi\n+\n∂τsij\n∂xj\n+βc¯\n(\nu˜fi − u˜\ns\ni\n)\n− β\nνT\nσc\n∂c¯\n∂xi\n(A.4)\nfor the sediment phase momentum conservation. In these equations, c¯ is the ensemble averaged sediment\nconcentration, u˜fi = (1− c)u\nf\ni \/(1− c¯) and u˜\ns\ni = cu\ns\ni\/c¯ are respectively the i\nth component of the\nconcentration-weighted averaged fluid phase velocity and the concentration-weighted averaged sediment\nphase velocity. P¯ f is the ensemble-averaged fluid pressure, τfij and τ\ns\nij are the fluid and sediment stresses.\nThe last two terms in the momentum equations represent the interphase momentum transfer, where β is a\n15\ndrag coefficient expressed as a function of the particle Reynolds number Rer = Urd\/νf itself based on the\nrelative velocity magnitude Ur = |~u\ns − ~uf |:\nβ =\nµf\nd2\n(18.0 + 0.3Rer)\n1\n(1− c¯)n\n(A.5)\nwith µf the fluid viscosity. The concentration dependence expresses higher drag observed for a group of\nparticles than for single particles and follows the experimental findings of Richardson and Zaki (1954)\nwhere n is also a function of Rer. The second of these terms, containing the concentration gradient, is\noften called turbulent suspension; and it represents the turbulent flux of sediment as modelled following\nthe gradient diffusion hypothesis with νT the fluid turbulent eddy viscosity and σc the Schmidt number.\nThe two terms corresponding to the different mechanisms for sediment suspension, discussed in section 4,\nare explicitly given in equation A.4 when applied to the vertical sediment velocity. The term\nβ (νT \/σc) (∂c¯\/∂z) corresponds to turbulent suspension, while the term (∂τ\ns\nzz\/∂z) represents the\ninter-particle interactions. The ratios plotted in figure 4 are then each of these terms divided by their sum.\nA.2. Sediment stresses\nThe closure scheme for the sediment stresses is based on different descriptions of the inter-particle\ninteractions throughout the water column. In the sediment bed (below the solid line in figure 1), sediment\nparticles are stationary and sediment stresses are not calculated. Above the bed the sediment stresses are\ncalculated following a collisional granular flow theory (Jenkins, 1998) that is modified to account for the\ntransition between the sediment’s solid behaviour in the bed and the fluid-like behaviour above the bed.\nFar away from the bed, sediment concentration is dilute and the sediment stresses can be neglected.\nIn the collisional region, the sediment stresses are calculated using the constitutive relations derived for\ncollisional flows of identical, frictionless, nearly elastic spheres (Jenkins, 1998) and a balance equation for\nthe particle fluctuating energy ks derived from the sediment-phase momentum equations. The balance\nequation for ks is\n∂ρsc¯ks\n∂t\n+\n∂ρsc¯ksu˜\ns\nj\n∂xj\n= τsij\n∂u˜si\n∂xj\n−\n∂Qj\n∂xj\n−γ + 2βc¯ (αkf − ks) (A.6)\nwhere both the energy flux Qj and the dissipation γ are calculated using the collisional granular flow\ntheory and expressed as functions of the sediment concentration, ks and other sediment properties\n(Jenkins, 1998). α is a parameter that measures the degree of correlation between the fluid velocity\nfluctuations and the sediment velocity fluctuations and is a function of several time scales involved (Hsu\net al., 2004). The collisional sediment stress tensor is given by:\nτscij =\n(\n−pc + ω\n∂u˜sk\n∂xk\n)\nδij\n+µc\n(\n∂u˜si\n∂xj\n+\n∂u˜sj\n∂xi\n−\n2\n3\n∂u˜sk\n∂xk\nδij\n)\n(A.7)\n16\nwhere the collisional pressure pc, the bulk viscosity ω, and the shear viscosity µc are also functions of the\nsediment concentration, ks and other sediment properties such as the grain diameter and the mass density\n(Jenkins, 1998).\nFurthermore, the solid-like rigid structure of the bed is not broken at once to give rise to the fluid-like\nregion but rather follows a transition where the particles first move while staying in contact and\ninteracting frictionally with their neighbours. In this regime, which is taken to occur between the random\nclose-packing value c⋆ = 0.635 (also the maximum possible concentration) and the random loose-packing\nvalue (lowest concentration so that grains remain in contact) c⋆ = 0.57, the effects of the frictional bonds\nneed to be accounted for. In that concentration range, the collisional shear viscosity is greatly increased\n(Bocquet et al., 2001) and an extra normal stress component due to homogeneously packed identical\nspheres in Hertzian contact is also added to the total sediment stress (Hsu et al., 2004).\nA.3. Fluid turbulence closure\nThe concentration-weighted averaged fluid Reynolds stresses are modelled using the turbulent eddy\nviscosity hypothesis and, following from the concentration-weighted average, we scale here the eddy\nviscosity using kf , εf and the concentration:\nνT = Cµ\n(1 − c¯)k2f\nεf\n. (A.8)\nBalance equations for both kf and εf can be summarized as follows:\n∂K\n∂t\n+\n∂Ku˜fj\n∂xj\n= Pk +\n∂T kj\n∂xj\n− E −Dp, (A.9)\n∂E\n∂t\n+\n∂Eu˜fi\n∂xi\n= Cε1\nεf\nkf\nPk +\n∂T εj\n∂xj\n− Cε2\nεf\nkf\nE\n−Cε3\nεf\nkf\nDp, (A.10)\nwhere K = ρf (1− c¯)kf , E = ρf (1− c¯)εf . In the balance equations, Pk is the shear production of kinetic\nenergy, T k and T ε are transport terms both modelled following a gradient diffusion assumption:\nT kj =\n(\nν +\nνT\nσk\n)\n∂K\n∂xj\nand T εj =\n(\nν +\nνT\nσε\n)\n∂E\n∂xj\n(A.11)\nThe last term in equations A.9 and A.10, Dp, is due to the phase interaction drag terms in the fluid\nmomentum equation. It can be either an additional dissipative term (Dp > 0) for the turbulent energy or\nan extra production term (Dp < 0) and is expressed as\nDp = 2β(1 − α)c¯kf − β\nνT\nσc\n∂c¯\n∂z\n(w˜f − w˜s) (A.12)\nComplete closure of the turbulence model requires the specification of σc, Cµ, Cε1, Cε2, Cε3, σk and σε.\nCommon values for these coefficients are σc = 1.0, Cµ = 0.09, Cε1 = 1.44, Cε2 = 1.92, Cε3 = 1.2, σk = 1.0\n17\nand σε = 1.3, which are the same as the clear fluid values and a Cε3 value chosen based on sediment-laden\njets results (Elghobashi and Abou-Arab, 1983). Here, Cε2 is modified following Amoudry et al. (2008)\nCε2 = Cε20\n[\n1 + max\n(\nc1 ln\n(\nc2\nTF\nTp\n)\n, 0\n)\nc¯\nc⋆\n]\n, (A.13)\nwhere Cε20 = 1.92, c1 = 2.4 and c2 = 2.\nReferences\nAmoudry, L., Hsu, T.-J., Liu, P. L.-F., 2005. Schmidt number and near-bed boundary condition effects on a two-phase dilute\nsediment transport model. J. Geophys. Res. 110 (C09003).\nAmoudry, L., Hsu, T.-J., Liu, P. L.-F., 2008. Two-phase model for sand transport in sheet flow regime. J. Geophys. Res.\n113 (C03011).\nAmoudry, L. O., 2008. Two-phase modeling of granular sediment for sheet flows and scour. Ph.D. thesis, Cornell University.\nAmoudry, L. O., Liu, P. L.-F., 2009. Two-dimensional, two-phase granular sediment transport model with applications to\nscouring downstream of an apron. Coastal Eng. 56 (7), 693–702.\nAsano, T., 1995. Sediment transport under sheet-flow conditions. J. Waterw. Port Coastal Ocean Eng. 121 (5), 239–246.\nBagnold, R. A., 1966. An approach to the sediment transport problem from general physics. Geological Survey Professional\nPaper 422-I.\nBocquet, L., Losert, W., Schalk, D., Lubensky, T. C., Gollub, J. P., 2001. Granular shear flow dynamics and forces:\nexperiment and continuum theory. Phys. Rev. E 65.\nDohmen-Janssen, C. M., 1999. Grain size influence on sediment transport in oscillatory sheet flow, phase lags and mobile-bed\neffects. Ph.D. thesis, Delft Univiversity of Technology.\nDong, P., Zhang, K., 2002. Intense near-bed sediment motions in waves and currents. Coastal Eng. 45, 75–87.\nDrake, T. G., Calantoni, J., 2001. Discrete particle model for sheet flow sediment transport in the nearshore. J. Geophys. Res.\n106 (C9), 19,859–19,868.\nDudley, R. D., 2007. A boroscopic quantitative technique for sheet flow measurements. Master’s thesis, Cornell University.\nElghobashi, S. E., Abou-Arab, T. W., 1983. A two-equation turbulence model for two-phase flows. Phys. Fluids 26 (4),\n931–938.\nFernandez Luque, R., van Beek, R., 1976. Erosion and transport of bed-load sediment. J. Hydrau. Res. 14 (2), 127–144.\nGarcia, M., Parker, G., 1991. Entrainment of bed sediment into suspension. J. Hydraul. Eng. 117 (4), 414–435.\nGonzalez-Rodriquez, D., Madsen, O. S., 2007. Seabed stress and bedload transport due to asymmetric and skewed waves.\nCoastal Eng. 54, 914–929.\nGrant, W. D., Madsen, O. S., 1979. Combined wave and current interaction with a rough bottom. J. Geophys. Res. 84 (C4),\n1797–1808.\nGrasmeijer, B. T., Davies, A. G., Guizien, K., van der Werf, J. J., van Rijn, L. C., Walther, R., Sutherland, J., Biegowski, J.,\n2005. Intercomparison results of sand transport models based on blind benchmarking test cases. In: van Rijn, L. C.,\nSoulsby, R. L., Hoekstra, P., Davies, A. G. (Eds.), SANDPIT: Sand Transport and Morphology of Offshore Sand Mining\nPits. Aqua Publications, pp. AM1–AM10.\nGuizien, K., Dohmen-Janssen, C. M., Vittori, G., 2003. 1DV bottom boundary layer modeling under combined wave and\ncurrent: Turbulent separation and phase lag effects. J. Geophys. Res. 108 (3016).\nHarris, C. K., Wiberg, P. L., 2001. A two-dimensional, time-dependent model of suspended sediment transport and bed\nreworking for continental shelves. Computers and Geosciences 27, 675–690.\n18\nHassan, W. N. M., Ribberink, J. S., 2010. Modelling of sand transport under wave-generated sheet flows with a RANS\ndiffusion model. Coastal Eng. 57, 19–29.\nHsu, T.-J., Elgar, S., Guza, R. T., 2006. Wave-induced sediment transport and onshore sandbar migration. Coastal Eng. 53,\n817–824.\nHsu, T.-J., Hanes, D. M., 2004. Effects of wave shape on sheet flow sediment transport. J. Geophys. Res. 109 (C05025).\nHsu, T.-J., Jenkins, J. T., Liu, P. L.-F., 2004. On two-phase sediment transport: sheet flow of massive particles. Proc. Roy.\nSoc. London, Ser. A 460.\nHsu, T.-J., Liu, P. L.-F., 2004. Toward modeling turbulent suspension of sand in the nearshore. J. Geophys. Res.\n109 (C06018).\nJenkins, J. T., 1998. Kinetic theory for nearly elastic spheres. In: H.J. Herrmann, J.P. Hovi, S. Luding (Ed.), Physics of dry\ngranular media. Springer, Dordrecht, Netherland, pp. 353–369.\nJenkins, J. T., Hanes, D. M., 1998. Collisional sheet flows of sediment driven by a turbulent fluid. J. Fluid Mech. 370, 29–52.\nJensen, B. L., Sumer, B. M., Fredsøe, J., 1989. Turbulent oscillatory boundary layers at high reynolds numbers. J. Fluid\nMech. 206, 265–297.\nJustesen, P., 1991. A note on turbulence calculations in the wave boundary layer. J. Hydrau. Res. 29 (5), 699–711.\nKleinhans, M. G., Grasmeijer, B. T., 2006. Bed load transport on the shoreface by currents and waves. Coastal Eng. 53,\n983–996.\nLesser, G. R., Roelvink, J. A., van Kester, J., Stelling, G. S., 2004. Development and validation of a three-dimensional\nmorphological model. Coastal Eng. 51 (8-9), 883–915.\nLi, M., Pan, S., O’Connor, B. A., 2008. A two-phase numerical model for sediment transport prediction under oscillatory\nsheet flows. Coastal Eng. 55, 1159–1173.\nMadsen, O. S., 1994. Spectral wave-current bottom boundary layer flows. In: Coastal Engineering. Proceedings, 24th\nInternational Conference Coastal Engineering. pp. 384–398.\nMalarkey, J., Davies, A. G., 2002. Discrete vortex modelling of oscillatory flow over ripples. Applied Ocean Research 24,\n127–145.\nMcLean, S. R., Ribberink, J. S., Dohmen-Janssen, C. M., Hassan, W. N., 2001. Sand transport in oscillatory sheet flow with\nmean current. J. Waterw. Port Coastal Ocean Eng. 127 (3), 141–151.\nMeyer-Peter, E., Mu¨ller, R., 1948. Formulas for bed-load transport. In: Proc. 2nd IAHR Congress, Stockholm. pp. 39–64.\nNielsen, P., Callaghan, D. P., 2003. Shear stress and sediment transport calculations for sheet flow under waves. Coastal Eng.\n47, 347–354.\nO’Donoghue, T., Wright, S., 2004. Concentrations in oscillatory sheet flow for well sorted and graded sands. Coastal Eng. 50,\n117–138.\nRibberink, J. S., 1998. Bed-load transport for steady flows and unsteady oscillatory flows. Coastal Eng. 34, 59–82.\nRichardson, J. F., Zaki, W. N., 1954. Sedimentation and fluidization. Trans. Instn. Chem. Egnrs. 32, 35–53.\nRuessink, B. G., van der Berg, T. J. J., van Rijn, L. C., 2009. Modeling sediment transport beneath skewed-asymmetric\nwaves above a plane bed. J. Geophys. Res. 114 (C11021).\nSanford, L. P., Maa, J. P.-Y., 2001. A unified erosion formulation for fine sediments. Marine Geology 179, 9–23.\nSleath, J. F. A., 1994. Sediment transport in oscillatory flow. In: Belorgey, M., Rajaona, R., Sleath, J. (Eds.), Sediment\ntransport mechanisms in coastal environments and rivers. World Scientific.\nSmith, J. D., McLean, S. R., 1977. Spatially averaged flow over a wavy surface. J. Geophys. Res. 82 (12), 1735–1746.\nSoulsby, R. L., Damgaard, J. S., 2005. Bedload sediment transport in coastal waters. Coastal Eng. 52 (8), 673–689.\nSumer, B. M., Kozakiewicz, A., Fredsoe, J., Deigaard, R., 1996. Velocity and concentration profiles in sheet-flow layer of\nmovable bed. J. Hydraul. Eng. 122 (10), 549–558.\n19\nvan Rijn, L. C., 1984. Sediment transport, part II: Suspended load transport. J. Hydraul. Eng. 110 (11), 1613–1641.\nvan Rijn, L. C., 2007. Unified view of sediment transport by currents and waves. II: Suspended transport. J. Hydraul. Eng.\n133 (6), 668–688.\nVittori, G., 2003. Sediment suspension due to waves. J. Geophys. Res. 108 (3173).\nWalstra, D. J. R., Chesher, T., Davies, A. G., Ribberink, J., Sergent, P., Silva, P., Vittori, G., Walther, R., van Rijn, L. C.,\n2005. Intercomparison of the state of the morphological models. In: van Rijn, L. C., Soulsby, R. L., Hoekstra, P., Davies,\nA. G. (Eds.), SANDPIT: Sand Transport and Morphology of Offshore Sand Mining Pits. Aqua Publications, pp.\nAY1–AY23.\nWarner, J. C., Sherwood, C. R., Signell, R. P., Harris, C. K., Arango, H. G., 2008. Development of a three-dimensional,\nregional, coupled wave, current, and sediment transport model. Computers and Geosciences 34, 1284–1306.\nWiberg, P. L., Rubin, D. M., 1989. Bed roughness produced by saltating sediment. J. Geophys. Res. 94 (C4), 5011–5016.\nWilson, K. C., 1966. Bed-load transport at high shear stress. J. of the Hydraulics Division 92 (HY6), 49–59.\nYalin, M. S., 1977. Mechanics of sediment transport, 2nd Edition. Pergamon Press.\nZedler, E. A., Street, R. L., 2001. Large-eddy simulation of sediment transport: currents over ripples. J. Hydraul. Eng.\n127 (6), 444–452.\nZedler, E. A., Street, R. L., 2006. Sediment transport over ripples in oscillatory flow. J. Hydraul. Eng. 132 (2), 180–193.\nZhao, Z., Fernando, H. J. S., 2007. Numerical simulation of scour around pipelines using an euler-euler coupled two-phase\nmodel. Environmental Fluid Mech. 7, 121–142.\nZyserman, J. A., Fredsoe, J., 1994. Data analysis of bed concentration of suspended sediment. J. Hydraul. Eng. 120 (9),\n1021–1042.\n20\nTable 1: Characteristics of cases numerically simulated.\nCase number d (µm) T (s) U0c (m\/s) U01 (m\/s) U02 (m\/s) θmax\nU01ω\n(s−1)g\n1 210 7.2 0.00 1.40 0.24 2.14 0.08\n2 210 7.2 0.00 1.71 0.00 2.17 0.09\n3 210 7.2 0.12 1.20 0.00 1.66 0.06\n4 210 7.2 0.14 1.30 0.00 1.76 0.07\n5 210 7.2 0.17 1.41 0.00 1.87 0.08\n6 210 7.2 0.28 1.48 0.00 1.95 0.08\n7 210 7.2 0.33 1.41 0.00 2.01 0.08\n8 230 7.2 0.01 1.20 0.00 1.52 0.06\n9 230 7.2 0.11 1.20 0.00 1.57 0.06\n10 230 7.2 0.13 1.30 0.00 1.75 0.07\n11 230 7.2 0.17 1.41 0.00 1.80 0.08\n12 230 7.2 0.26 1.48 0.00 1.98 0.08\n13 230 7.2 0.32 1.41 0.00 1.96 0.08\n14 250 7.2 0.01 1.20 0.00 1.53 0.06\n15 250 7.2 0.10 1.20 0.00 1.57 0.06\n16 250 7.2 0.13 1.31 0.00 1.71 0.07\n17 250 7.2 0.15 1.41 0.00 1.75 0.08\n18 250 7.2 0.33 1.47 0.00 1.95 0.08\n19 250 7.2 0.30 1.41 0.00 1.87 0.08\n20 270 7.5 0.00 1.20 0.31 1.79 0.06\n21 270 7.2 0.01 1.21 0.00 1.48 0.07\n22 270 7.2 0.10 1.21 0.00 1.52 0.07\n23 270 7.2 0.12 1.31 0.00 1.63 0.07\n24 270 7.2 0.16 1.41 0.00 1.72 0.08\n25 270 7.2 0.33 1.48 0.00 1.88 0.08\n26 270 7.2 0.31 1.41 0.00 1.83 0.08\n27 300 7.2 0.00 1.21 0.00 1.47 0.07\n28 300 7.2 0.10 1.21 0.00 1.50 0.07\n29 300 7.2 0.13 1.31 0.00 1.61 0.07\n30 300 7.2 0.17 1.41 0.00 1.68 0.08\n(continued on next page)\n21\nTable 1: Characteristics of cases numerically simulated. (contin-\nued)\nCase number d (µm) T (s) U0c (m\/s) U01 (m\/s) U02 (m\/s) θmax\nU01ω\n(s−1)g\n31 300 7.2 0.33 1.48 0.00 1.81 0.08\n32 300 7.2 0.31 1.42 0.00 1.74 0.08\n33 320 7.2 0.00 1.11 0.13 1.47 0.06\n34 320 7.2 0.00 1.21 0.15 1.57 0.07\n35 320 7.2 0.00 1.31 0.19 1.66 0.07\n36 320 7.2 0.00 1.42 0.22 1.68 0.08\n37 320 7.2 0.00 1.55 0.48 1.84 0.08\n38 320 7.2 0.00 1.72 0.00 1.80 0.09\n39 320 7.2 -0.03 1.01 0.00 1.25 0.05\n40 320 7.2 -0.02 1.11 0.00 1.31 0.06\n41 320 7.2 0.04 1.52 0.41 1.83 0.08\n42 320 7.2 0.05 1.11 0.00 1.33 0.06\n43 320 7.2 0.06 1.21 0.00 1.47 0.07\n44 320 7.2 0.10 1.31 0.00 1.59 0.07\n45 320 7.2 0.14 1.42 0.00 1.66 0.08\n46 320 7.2 0.13 1.52 0.31 1.82 0.08\n47 320 7.2 0.33 1.48 0.00 1.76 0.08\n48 320 5.4 0.36 1.46 0.00 1.82 0.11\n49 320 9.0 0.32 1.50 0.00 1.69 0.06\n50 320 7.2 0.29 1.52 0.00 1.70 0.08\n51 320 7.2 0.34 1.53 0.00 1.72 0.08\n52 320 7.2 0.54 1.52 0.00 1.77 0.08\n53 320 7.2 0.64 1.53 0.00 1.73 0.08\n54 350 7.2 0.00 1.22 0.00 1.44 0.07\n55 350 7.2 0.09 1.22 0.00 1.47 0.07\n56 350 7.2 0.13 1.32 0.00 1.59 0.07\n57 350 7.2 0.17 1.42 0.00 1.65 0.08\n58 350 7.2 0.33 1.48 0.00 1.71 0.08\n59 350 7.2 0.31 1.42 0.00 1.72 0.08\n(continued on next page)\n22\nTable 1: Characteristics of cases numerically simulated. (contin-\nued)\nCase number d (µm) T (s) U0c (m\/s) U01 (m\/s) U02 (m\/s) θmax\nU01ω\n(s−1)g\n60 370 7.2 0.00 1.22 0.00 1.43 0.07\n61 370 7.2 0.08 1.22 0.00 1.46 0.07\n62 370 7.2 0.12 1.32 0.00 1.60 0.07\n63 370 7.2 0.16 1.42 0.00 1.62 0.08\n64 370 7.2 0.32 1.49 0.00 1.71 0.08\n65 370 7.2 0.30 1.42 0.00 1.68 0.08\n66 400 7.2 0.00 1.23 0.00 1.42 0.07\n67 400 7.2 0.08 1.23 0.00 1.46 0.07\n68 400 7.2 0.12 1.33 0.00 1.58 0.07\n69 400 7.2 0.16 1.43 0.00 1.62 0.08\n70 400 7.2 0.31 1.49 0.00 1.67 0.08\n71 400 7.2 0.30 1.43 0.00 1.67 0.08\n72 430 7.2 0.00 1.23 0.00 1.42 0.07\n73 430 7.2 0.08 1.23 0.00 1.47 0.07\n74 430 7.2 0.12 1.33 0.00 1.56 0.07\n75 430 7.2 0.30 1.49 0.00 1.65 0.08\n76 460 7.5 0.00 1.22 0.37 1.56 0.06\n77 460 7.2 0.00 1.24 0.00 1.44 0.07\n78 460 7.2 0.07 1.24 0.00 1.48 0.07\n79 460 7.2 0.11 1.33 0.00 1.53 0.07\n23\nTable 2: Coefficients in bed load predictors\nPredictor m n p\nMeyer-Peter and Mu¨ller (1948) 8 0 1.5\nWilson (1966) 12 1.5 0\nFernandez Luque and van Beek (1976) 5.7 0 1.5\nRibberink (1998) 11 0 1.65\nSoulsby and Damgaard (2005) 12 0.5 1\nKleinhans and Grasmeijer (2006) 1 0 1.5\n0\nz\nNo−flow bed location\nTime−dependent bed location\nNumerical bottom boundary\nNumerical top boundary\nFigure 1: Sketch of the numerical domain for the sheet flow model.\n24\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1−2\n0\n2\n−0.01\n0\n0.01\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n−2\n0\n2\n−0.01\n0\n0.01\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1−2\n0\n2\nU 0\n \n(m\n\/s)\n−0.01\n0\n0.01\nτ b\n \n\/ ρ\n \n(m\n2 \/s\n2 )\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1−2\n0\n2\n−0.01\n0\n0.01\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1−2\n0\n2\n−0.01\n0\n0.01\nt \/ T\nFigure 2: Free-stream velocity (solid lines) and non-dimensional bed shear stress (dashed lines) for five cases from\ntable 1. From top to bottom: case 38, pure oscillatory flow; cases 3 and 52, sinusoidal wave plus current; case 20,\n2nd-order Stokes wave; and case 46, 2nd-order Stokes wave and current.\n102 103 104\n0\n5\n10\n15\n20\n25\n30\n35\n40\n45\nU0max \/ (kN ω)\nφ τ \n(de\ngre\nes\n)\nFigure 3: Phase lead of the bed shear stress with respect to the free stream velocity for all numerically simulated\ncases (circles) and following the expression of Madsen (1994) (solid line).\n25\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n−5\n0\n5\n10\n15\n20\nz \n\/ D\n50\nRft, Rgc\nSUSPENDED LOAD\nBEDLOAD\nFigure 4: Example of ratio of total sediment suspension due to turbulent suspension Rft in the solid line and to the\nsediment stress gradient Rgc in the dashed line (see appendix for more details on the ratios). The transition between\nbed load and suspended load occurs at the intersection of the two curves.\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n−20\n0\n20\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n−20\n0\n20\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n−20\n0\n20\nΦ\nB\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n−20\n0\n20\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n−20\n0\n20\nt \/ T\nFigure 5: Bed load transport rate comparison between the numerical sheet flow model results (solid line) and the\nquasi-steady empirical formula of Soulsby and Damgaard (2005) (dashed line) for the five examples of figure 2.\n26\n10−2 10−1 100 101\n10−2\n10−1\n100\n101\nΦB (Soulsby and Damgaard, 2005)\nΦ\nB \n(sh\nee\nt fl\now\n m\nod\nel)\n \n \nD50 = 210 µm\nD50 = 230 µm\nD50 = 250 µm\nD50 = 270 µm\nD50 = 300 µm\nD50 = 320 µm\nD50 = 350 µm\nD50 = 370 µm\nD50 = 400 µm\nD50 = 430 µm\nD50 = 460 µm\nFigure 6: Net bed load transport rate comparison between numerical results using Amoudry et al. (2008) and Soulsby\nand Damgaard (2005)’s formula. Circles: current and sinusoidal wave. Squares: 2nd-order Stokes waves. Diamonds:\n2nd-order Stokes waves with superposed current. Dashed lines: factor two error.\n100 150 200 250 300 350 400 450 500\n0\n5\n10\n15\n20\nD50 (µm)\nm\nFigure 7: Bed load formula proportionality factor m as function of sediment diameter. The solid line represents\nequation 4.\n27\n10−2 10−1 100 101\n10−2\n10−1\n100\n101\nΦ\nb \n(sh\nee\nt fl\now\n m\nod\nel)\nΦb (Soulsby and Damgaard, 2005)\nFigure 8: Net bed load transport rate comparison between the sheet flow model numerical results and Soulsby and\nDamgaard (2005)’s formula without equation 4 (black) and with equation 4 (red).\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.05\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.05\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.05\nCo\nnc\nen\ntra\ntio\nn\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.05\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.05\nt \/ T\nFigure 9: Examples of intra-wave reference concentration for the numerical results (solid line) and for van Rijn (2007)\nformula (dashed lines) for the five examples of figure 2.\n28\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.2\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.2\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.2\nCo\nnc\nen\ntra\ntio\nn\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.2\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.2\nt \/ T\nFigure 10: Examples of intra-wave reference concentration for the numerical results (solid line) and for Zyserman and\nFredsoe (1994) formula (dashed lines) for the five examples of figure 2.\n0 0.2 0.4 0.6 0.8 1 1.2 1.4 1.6 1.8 2\n0\n0.1\n0.2\n0.3\nθ\nmax\nc r\ne\nf\n0 0.2 0.4 0.6 0.8 1 1.2 1.4 1.6 1.8 2\n0\n0.01\n0.02\n0.03\n0.04\n0.05\nθ\nmax\nc r\ne\nf\na)\nb)\nFigure 11: Wave-averaged reference concentration. a) Comparison between the numerical results (symbols with the\nsame colour legend as in figure 6) and Zyserman and Fredsoe (1994) formula (solid line), the dashed line shows\nc = 0.2. b) Comparison between the numerical results and van Rijn (2007) formula (solid lines, different colours\ncorresponding to different sediment diameters increasing to the left). The dashed line corresponds to the best linear\nfit to the numerical data (equation 11).\n29\n0 0.2 0.4 0.6 0.8 1\n−5\n0\n5\nx 10−4 Case 3\n0 0.2 0.4 0.6 0.8 1\n−5\n0\n5\nx 10−4 Case 11\n0 0.2 0.4 0.6 0.8 1\n−5\n0\n5\nx 10−4 Case 20\n0 0.2 0.4 0.6 0.8 1\n−5\n0\n5\nx 10−4 Case 28\n0 0.2 0.4 0.6 0.8 1\n−5\n0\n5\nx 10−4\nSe\ndi\nm\nen\nt v\ner\ntic\nal\n fl\nux\n (m\n\/s)\nCase 35\n0 0.2 0.4 0.6 0.8 1\n−5\n0\n5\nx 10−4 Case 38\n0 0.2 0.4 0.6 0.8 1\n−5\n0\n5\nx 10−4 Case 46\n0 0.2 0.4 0.6 0.8 1\n−5\n0\n5\nx 10−4 Case 52\n0 0.2 0.4 0.6 0.8 1\n−5\n0\n5\nx 10−4\nt \/ T\nCase 61\n0 0.2 0.4 0.6 0.8 1\n−5\n0\n5\nx 10−4\nt \/ T\nCase 67\nFigure 12: Examples of intra-wave net vertical sediment flux two diameters above the undisturbed bed: numerical\nresults (circles) and parameterization with equation 12 (solid line).\n30\n5 6 7 8 9 10 11 12\nx 10−3\n5\n10\n15\n20\n25\n30\n35\nτbmax \/ ρ (m\n2\/s2)\nφ e\nFigure 13: Phase lag of the vertical sediment flux with respect to the near-bed acceleration, numerical results (circles)\nand equation 13 (solid line).\n31\n"}