{"doi":"10.1016\/j.ijproman.2009.10.008","coreId":"139954","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5081","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5081","10.1016\/j.ijproman.2009.10.008"],"title":"The Titanic sunk, so what? Project manager response to unexpected events","authors":["Geraldi, Joana","Lee-Kelley, Liz","Kutsch, Elmar"],"enrichments":{"references":[{"id":37963922,"title":"A theoretical review of flexibility, agility and responsiveness in the operations management literature.","authors":[],"date":"2009","doi":"10.1108\/01443570910925352","raw":"Bernardes, E., Hanna, M., 2009. A theoretical review of flexibility, agility and responsiveness in the operations management literature. International Journal of Operations and Production Management 29 (1), 30-53.","cites":null},{"id":37963920,"title":"Behaviour under uncertainty and its implications for policy, in:","authors":[],"date":"1983","doi":"10.1007\/978-94-017-1590-4_3","raw":"Arrow, K.J., 1983. Behaviour under uncertainty and its implications for policy, in: Stigum, B.P., Wenstop, F. (Eds.), Foundations of Utility and Risk Theory with Applications, D. Reidel Publishing Company, Dordrecht, pp. 19 - 32.","cites":null},{"id":37963985,"title":"Challenger: Fine-tuning the odds until something breaks.","authors":[],"date":"1988","doi":"10.1111\/j.1467-6486.1988.tb00040.x","raw":"Starbuck, W.H., Milliken, F.J., 1988. Challenger: Fine-tuning the odds until something breaks. Journal of Management Studies 25 (4), 319-340.","cites":null},{"id":37963932,"title":"Cheetah teams in product development: the most extreme form of temporary organization?","authors":[],"date":"2004","doi":"10.1016\/j.scaman.2003.05.001","raw":"Engwall, M., Svensson, C., 2004. Cheetah teams in product development: the most extreme form of temporary organization? Scandinavian Journal of Management 20 (3), 297-317.","cites":null},{"id":37963931,"title":"Cheetah teams.","authors":[],"date":"2001","doi":"10.1016\/j.scaman.2003.05.001","raw":"Engwall, M., Svensson, C., 2001. Cheetah teams. Harvard Business Review 79 (2), 20.","cites":null},{"id":37963924,"title":"Cognitive mapping and repertory grids for qualitative survey research: some comparative observations.","authors":[],"date":"1992","doi":"10.1111\/j.1467-6486.1992.tb00666.x","raw":"Brown, S.M., 1992. Cognitive mapping and repertory grids for qualitative survey research: some comparative observations. Journal of Management Studies 29 (3), 287-307.","cites":null},{"id":37963935,"title":"Cognitive Underpinnings of Institutional Persistence and Change: a Framing Perspective.","authors":[],"date":"2006","doi":"10.5465\/amr.2006.20208685","raw":"George, E., Chattopadhyay, P., Sitkin, S.B., Barden, J., 2006. Cognitive Underpinnings of Institutional Persistence and Change: a Framing Perspective. Academy of Management Review 31 (2), 347-365.","cites":null},{"id":37963957,"title":"Crisis management in construction projects.","authors":[],"date":"2000","doi":"10.1061\/9780784404911","raw":"Loosemore, M., 2000. Crisis management in construction projects. American Society of Civil Engineers, Danvers.","cites":null},{"id":37963974,"title":"From crisis prone to crisis prepared: a framework for crisis management.","authors":[],"date":"1993","doi":"10.5465\/ame.1993.9409142058","raw":"Pearson, C.M., Mitroff, II, 1993. From crisis prone to crisis prepared: a framework for crisis management. Academy of Management Executive 7 (1), 48-59.","cites":null},{"id":37963926,"title":"How top management team behavioral integration and behavioral complexity enable organizational ambidexterity: The moderating role of contextual ambidexterity.","authors":[],"date":"2009","doi":"10.1016\/j.leaqua.2009.01.011","raw":"Carmeli, A., Halevi, M., 2009. How top management team behavioral integration and behavioral complexity enable organizational ambidexterity: The moderating role of contextual ambidexterity. The Leadership Quarterly 2 (1), 207-218.","cites":null},{"id":37963960,"title":"IT project managers' construction of successful project management practice: a repertory grid investigation.","authors":[],"date":"2009","doi":"10.1111\/j.1365-2575.2007.00264.x","raw":"Napier, N.P., Keil, M., Tan, F.B., 2009. IT project managers' construction of successful project management practice: a repertory grid investigation. Information Systems Journal 19, 255-282.","cites":null},{"id":37963992,"title":"Making Sense of the Organisation.","authors":[],"date":"1995","doi":null,"raw":"Weick, K.E., 1995. Making Sense of the Organisation. Sage.","cites":null},{"id":37963976,"title":"Managing incomplete knowledge: Why risk management is not sufficient.","authors":[],"date":"2001","doi":"10.1016\/s0263-7863(99)00052-6","raw":"Pender, S., 2001. Managing incomplete knowledge: Why risk management is not sufficient. International Journal of Project Management 19, 79 - 87.","cites":null},{"id":37963927,"title":"Managing Project Risk and Uncertainty.","authors":[],"date":"2002","doi":"10.1016\/s0263-7863(01)00080-1","raw":"Chapman, C., Ward, S., 2002. Managing Project Risk and Uncertainty. John Wiley & Sons, West Sussex.","cites":null},{"id":37963929,"title":"Managing project uncertainty: from variation to chaos. Engineering Management Review,","authors":[],"date":"2002","doi":"10.1109\/emr.2002.1032403","raw":"De Meyer, A., Loch, C.H., Pich, M.T., 2002. Managing project uncertainty: from variation to chaos. Engineering Management Review, IEEE 30 (3), 91-91. Eden, C., 1992. On the nature of cognitive maps. Journal of Management Studies 29 (3), 261-265.","cites":null},{"id":37963993,"title":"Managing the Unexpected: Assuring High Performance in an Age of Complexity. Jossey-Bass","authors":[],"date":"2001","doi":"10.1016\/s0263-2373(02)00124-x","raw":"Weick, K.E., Sutcliffe, K.M., 2001. Managing the Unexpected: Assuring High Performance in an Age of Complexity. Jossey-Bass San Francisco. Williams, T.J., 2005. Assessing and moving from the dominant project management discourse in the light of project overruns. IEEE Transactions on Engineering Management 52 (4), 497-508. The Titanic sunk, so what? Project manager response to unexpected events Joana G. Geraldi Liz Lee-Kelley Elmar Kutsch Abstract Projects are inherently uncertain and face unexpected events, from small changes in scope to unforeseen client’s bankruptcy.  This paper studies how project managers respond to such events and how successful and unsuccessful responses differ from the perspective of the practitioner.  We analysed 44 unexpected events faced by 22 experienced project managers in defence and defence-related organisations.  The project managers compared two unexpected events that they faced, one that they considered the response successful and the other, unsuccessful.  We identified three pillars supporting successful responses to unexpected events: (1) responsive and functioning structure at the organizational level, (2) good interpersonal relationship at the group level and (3) competent people at the individual level.  The events and respective responses analysed suggest that improvement in project management can be achieved by better managing these three pillars, allowing project and programme managers to “create their own luck”. *Title Page (WITH Author Details)The Titanic sunk, so what? Project manager response to unexpected events Variations Aleatory uncertainty Knownunknowns ‘Chaos’ Epistemic uncertainty Unknownunknowns Risk management process reduces the number of occurrences, but some risks were not prevented, and some even not identified (whether deliberately or not) These possible events were invisible to the project team –Unk-unks, and therefore risk management is not of help Consequence: Unexpected events will emerge (Events that impact the project. They could have been identified, but were not expected) Response and its perceived success What did project and programme managers do when faced with an unexpected event? How did successful responses differ from unsuccessful ones from the perspective of practitioner? Research Focus","cites":null},{"id":37963951,"title":"Managing the unknown: a new approach to managing high uncertainty and risk in projects.","authors":[],"date":"2006","doi":"10.1111\/j.1540-5885.2006.00227_2.x","raw":"Loch, C., DeMeyer, A., Pich, M., 2006. Managing the unknown: a new approach to managing high uncertainty and risk in projects. John Wiley & Sons, Inc. New York, NY, USA.","cites":null},{"id":37963921,"title":"Modelling global risk factors affecting construction cost performance.","authors":[],"date":"2003","doi":"10.1016\/s0263-7863(02)00017-0","raw":"Baloi, D., Price, A.D.F., 2003. Modelling global risk factors affecting construction cost performance. International Journal of Project Management 21 (4), 261-269.","cites":null},{"id":37963930,"title":"No project is an island: linking projects to history and context.","authors":[],"date":"2003","doi":"10.1016\/s0048-7333(02)00088-4","raw":"Engwall, M., 2003. No project is an island: linking projects to history and context. Research Policy 32 (5), 789-808.","cites":null},{"id":37963980,"title":"Normal Accidents: Living with High-Risk Technologies.","authors":[],"date":"1999","doi":"10.2307\/257982","raw":"Perrow, C., 1999. Normal Accidents: Living with High-Risk Technologies. Princeton University Press, Princeton.","cites":null},{"id":37963981,"title":"On uncertainty, ambiguity, and complexity in project management.","authors":[],"date":"2002","doi":"10.1287\/mnsc.48.8.1008.163","raw":"Pich, M.T., Loch, C.H., De Meyer, A., 2002. On uncertainty, ambiguity, and complexity in project management. Management Science, 1008-1023.","cites":null},{"id":37963955,"title":"Organisational behaviour during a construction crisis.","authors":[],"date":"1998","doi":"10.1016\/s0263-7863(97)00039-2","raw":"Loosemore, M., 1998a. Organisational behaviour during a construction crisis. International Journal of Project Management 16 (2), 115-121.","cites":null},{"id":37963928,"title":"Organizational Actions in Response to Threats and Opportunities.","authors":[],"date":"2001","doi":"10.2307\/3069439","raw":"Chattopadhyay, P., Glick, W.H., Huber, G.P., 2001. Organizational Actions in Response to Threats and Opportunities. Academy of Management Journal 44 (5), 937-955.","cites":null},{"id":37963933,"title":"Organizational crisis and change.","authors":[],"date":"1971","doi":null,"raw":"Fink, S.L., Beak, J., Taddeo, K., 1971. Organizational crisis and change. The Journal of Applied Behavioral Science 7 (1), 15-37.","cites":null},{"id":37963982,"title":"Organizational improvisation: what, when, how and why.","authors":[],"date":"1999","doi":"10.1111\/1468-2370.00017","raw":"Pina e Cunha, M., Vieira da Cunha, J., Kamoche, K., 1999. Organizational improvisation: what, when, how and why. International Journal of Management Reviews 1 (3), 299. PMBoK, P., 2004. A Guide to the Project Management Body of Knowledge (PMBOK Guide), Project Management Institute Newtown Square, PA.","cites":null},{"id":37963987,"title":"Plans and Situated Actions: The Problem of Human-Machine Communication.","authors":[],"date":"1987","doi":"10.1017\/cbo9780511808418.011","raw":"Suchman, L.A., 1987. Plans and Situated Actions: The Problem of Human-Machine Communication. Cambridge University Press, Cambridge.","cites":null},{"id":37963958,"title":"Preventative choices: Organizations' heuristics, decision processes and catastrophic risks.","authors":[],"date":"1999","doi":"10.1111\/1467-6486.00166","raw":"Meszaros, J.R., 1999. Preventative choices: Organizations' heuristics, decision processes and catastrophic risks. Journal of Management Studies 36 (7), 977-998.","cites":null},{"id":37963961,"title":"Project management by early warnings.","authors":[],"date":"2001","doi":"10.1016\/s0263-7863(00)00021-1","raw":"Nikander, I.O., Eloranta, E., 2001. Project management by early warnings. International Journal of Project Management 19 (7), 385-399.","cites":null},{"id":37963984,"title":"Project management of unexpected events.","authors":[],"date":"2008","doi":"10.1016\/j.ijproman.2007.08.016","raw":"Söderholm, A., 2008. Project management of unexpected events. International Journal of Project Management 26 (1), 80-86.","cites":null},{"id":37963943,"title":"Project Management Under Risk: Using the Real Options Approach to Evaluate Flexibility in R&D.","authors":[],"date":"2001","doi":"10.1287\/mnsc.47.1.85.10661","raw":"Huchzermeier, A., Loch, C.H., 2001. Project Management Under Risk: Using the Real Options Approach to Evaluate Flexibility in R&D. Management Science 47 (1), 85-101.","cites":null},{"id":37963970,"title":"Project troubleshooting: Tiger teams for reactive risk management.","authors":[],"date":"2004","doi":"10.1109\/emr.2005.25175","raw":"Pavlak, A., 2004. Project troubleshooting: Tiger teams for reactive risk management. Project Management Journal 35 (4), 5-14.","cites":null},{"id":37963990,"title":"Project Uncertainty Management as a Desirable Future,","authors":[],"date":"2002","doi":null,"raw":"Ward, S., Chapman, C., 2002a. Project Uncertainty Management as a Desirable Future, University of Southampton, Southampton.","cites":null},{"id":37963947,"title":"Prospect theory: An analysis of decision under risk.","authors":[],"date":"1979","doi":"10.2307\/1914185","raw":"Kahneman, D., Tversky, A., 1979. Prospect theory: An analysis of decision under risk. Econometrica 47 (2), 263 - 291.","cites":null},{"id":37963972,"title":"Reframing crisis management.","authors":[],"date":"1998","doi":"10.2307\/259099","raw":"Pearson, C.M., Clair, J.A., 1998. Reframing crisis management. Academy of Management Review, 59-76.","cites":null},{"id":37963937,"title":"Repertory grid technique, in: Partington,","authors":[],"date":"2002","doi":"10.4135\/9781848605305.n11","raw":"Goffin, K., 2002. Repertory grid technique, in: Partington, D. (Ed.), Essential Skills for Management Research, Sage, London, pp. 199-225.","cites":null},{"id":37963983,"title":"Social Practices: a Wittgensteinian approach to human activity and the social.","authors":[],"date":"1996","doi":"10.1017\/cbo9780511527470","raw":"Schatzki, T.R., 1996. Social Practices: a Wittgensteinian approach to human activity and the social. Cambridge University Press.","cites":null},{"id":37963945,"title":"Strategy as practice: A review ad future directions for the field.","authors":[],"date":"2009","doi":"10.1111\/j.1468-2370.2008.00250.x","raw":"Jarzabkowski, P., Spee, A.P., 2009. Strategy as practice: A review ad future directions for the field. International Journal of Management Reviews 11 (1), 69-95.","cites":null},{"id":37963988,"title":"Taxonomy for change causes and effects in construction projects.","authors":[],"date":"2008","doi":"10.1016\/j.ijproman.2008.10.005","raw":"Sun, M., Meng, X., 2008. Taxonomy for change causes and effects in construction projects. International Journal of Project Management 27 (6), 560-572.","cites":null},{"id":37963923,"title":"The Book of Risk.","authors":[],"date":"2001","doi":null,"raw":"Borge, D., 2001. The Book of Risk. John Wiley & Sons, New York.","cites":null},{"id":37963959,"title":"The convergence of planning and execution: improvisation in new product development.","authors":[],"date":"1998","doi":"10.2307\/1251740","raw":"Moorman, C., Miner, A., 1998. The convergence of planning and execution: improvisation in new product development. The Journal of Marketing, 1-20. Müller, R., Turner, J.R., 2007. Matching the project manager‟s leadership style to project type. International Journal of Project Management 25 (1), 21-32.","cites":null},{"id":37963978,"title":"The limits of safety: the enhancement of a theory of accidents.","authors":[],"date":"1994","doi":"10.1111\/j.1468-5973.1994.tb00046.x","raw":"Perrow, C., 1994. The limits of safety: the enhancement of a theory of accidents. Journal of Contingencies and Crisis Management 2 (4), 212-220.","cites":null},{"id":37963925,"title":"The Management of Innovation.","authors":[],"date":"1961","doi":"10.1093\/acprof:oso\/9780198288787.001.0001","raw":"Burns, T., Stalker, G.M., 1961. The Management of Innovation. Tavistock, London.","cites":null},{"id":37963939,"title":"The nature and management of crises in construction projects: Projects-as-practice observations.","authors":[],"date":"2008","doi":"10.1016\/j.ijproman.2007.10.005","raw":"Hällgren, M., Wilson, T.L., 2008. The nature and management of crises in construction projects: Projects-as-practice observations. International Journal of Project Management 26 (8), 830-838.","cites":null},{"id":37963949,"title":"The Psychology of Personal Constructs.","authors":[],"date":"1955","doi":"10.4324\/9780203405970","raw":"Kelly, G.A., 1955. The Psychology of Personal Constructs. W.W. Norton, New York.","cites":null},{"id":37963941,"title":"The quest for resilience.","authors":[],"date":"2003","doi":null,"raw":"Hamel, G., Valikangas, L., 2003. The quest for resilience. Harvard Business Review 81 (9), 52-65. Heckscher, C., 1994. Defining the post-bureaucratic type, in: Heckscher, C. (Ed.), The PostBureaucratic Organization: New Perspectives on Organizational Change, Sage, Newbury Park.","cites":null},{"id":37963989,"title":"The repertory grid technique: A method for the study of cognition in information systems.","authors":[],"date":"2002","doi":"10.2307\/4132340","raw":"Tan, F.B., Hunter, M.G., 2002. The repertory grid technique: A method for the study of cognition in information systems. Management Information Systems Quarterly 26 (1), 39-57.","cites":null},{"id":37963934,"title":"The techniques of risk analysis are insufficient in themselves.","authors":[],"date":"1997","doi":"10.1108\/09653569710172937","raw":"Frosdick, S., 1997. The techniques of risk analysis are insufficient in themselves. Disaster Prevention and Management 6 (3), 165 - 177.","cites":null},{"id":37963956,"title":"The three ironies of crisis management in construction projects.","authors":[],"date":"1998","doi":"10.1016\/s0263-7863(97)00041-0","raw":"Loosemore, M., 1998b. The three ironies of crisis management in construction projects. International Journal of Project Management 16 (3), 139-144.","cites":null},{"id":37963986,"title":"Threat-rigidity effects in organizational behavior: A multilevel analysis.","authors":[],"date":"1981","doi":"10.2307\/2392337","raw":"Staw, B.M., Sandelands, L.E., Dutton, J.E., 1981. Threat-rigidity effects in organizational behavior: A multilevel analysis. Administrative Science Quarterly 26 (4), 501-524.","cites":null},{"id":37963991,"title":"Transforming project risk management into project uncertainty management.","authors":[],"date":"2002","doi":"10.1016\/s0263-7863(01)00080-1","raw":"Ward, S., Chapman, C., 2002b. Transforming project risk management into project uncertainty management. International Journal of Project Management 21 (2), 97-105.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-08-31T00:00:00Z","abstract":"Projects are inherently uncertain and face unexpected events, from small changes\nin scope to unforeseen client's bankruptcy. This paper studies how project\nmanagers respond to such events and how successful and unsuccessful responses\ndiffer from the perspective of the practitioner. We analysed 44 unexpected\nevents faced by 22 experienced project managers in defence and defence-related\norganisations. The project managers compared two unexpected events that they\nfaced, one that they considered the response successful and the other\nunsuccessful. We identified three pillars supporting successful responses to\nunexpected events: (1) responsive and functioning structure at the\norganisational level, (2) good interpersonal relationship at the group level and\n(3) competent people at the individual level. The events and respective\nresponses analysed suggest that improvement in project management can be\nachieved by better managing these three pillars, allowing project and programme\nmanagers to \"create their own luck\". (C) 2009 Elsevier Ltd and IPMA. All rights\nreserved","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139954.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.ijproman.2009.10.008","pdfHashValue":"69ca3e9f855550aae6fd0ab5da71d2937f5b2478","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5081<\/identifier><datestamp>2011-10-21T09:19:34Z<\/datestamp><setSpec>hdl_1826_28<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>The Titanic sunk, so what? Project manager response to unexpected events<\/dc:title><dc:creator>Geraldi, Joana<\/dc:creator><dc:creator>Lee-Kelley, Liz<\/dc:creator><dc:creator>Kutsch, Elmar<\/dc:creator><dc:subject>Unexpected events Perceived success Organisational response Project management flexibility uncertainty decision crisis risk<\/dc:subject><dc:description>Projects are inherently uncertain and face unexpected events, from small changes\nin scope to unforeseen client's bankruptcy. This paper studies how project\nmanagers respond to such events and how successful and unsuccessful responses\ndiffer from the perspective of the practitioner. We analysed 44 unexpected\nevents faced by 22 experienced project managers in defence and defence-related\norganisations. The project managers compared two unexpected events that they\nfaced, one that they considered the response successful and the other\nunsuccessful. We identified three pillars supporting successful responses to\nunexpected events: (1) responsive and functioning structure at the\norganisational level, (2) good interpersonal relationship at the group level and\n(3) competent people at the individual level. The events and respective\nresponses analysed suggest that improvement in project management can be\nachieved by better managing these three pillars, allowing project and programme\nmanagers to \"create their own luck\". (C) 2009 Elsevier Ltd and IPMA. All rights\nreserved.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-04-04T23:02:59Z<\/dc:date><dc:date>2011-04-04T23:02:59Z<\/dc:date><dc:date>2010-08-31T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Joana Geraldi, Liz Lee-Kelley, Elmar Kutsch,\nThe Titanic sunk, so what? Project manager \nresponse to unexpected events, \nInternational Journal of Project Management\nVolume 28, Issue 6, August 2010, Pages \n547-558<\/dc:identifier><dc:identifier>0263-7863<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.ijproman.2009.10.008<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5081<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0263-7863","0263-7863"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Unexpected events Perceived success Organisational response Project management flexibility uncertainty decision crisis risk"],"subject":["Article"],"fullText":"International Journal of Project Management, Volume 28, Issue 6, August 2010, Pages 547-558\nThe Titanic sunk, so what?\nProject manager response to unexpected events\nJoana G Geraldi, Elmar Kutsch, Liz Lee-Kelley\nAbstract\nProjects are inherently uncertain and face unexpected events, from small changes in scope to\nunforeseen client’s bankruptcy. This paper studies how project managers respond to such\nevents and how successful and unsuccessful responses differ from the perspective of the\npractitioner. We analysed 44 unexpected events faced by 22 experienced project managers in\ndefence and defence-related organisations. The project managers compared two unexpected\nevents that they faced, one that they considered the response successful and the other,\nunsuccessful. We identified three pillars supporting successful responses to unexpected events: (1)\nresponsive and functioning structure at the organizational level, (2) good interpersonal\nrelationship at the group level and (3) competent people at the individual level. The events and\nrespective responses analysed suggest that improvement in project management can be achieved\nby better managing these three pillars, allowing project and programme managers to “create\ntheir own luck”.\nKeywords: Unexpected events, perceived success, organizational response, project management\n1 Introduction \n \nThe Titanic had an image of perfection.  The project to design and build the largest and most ro-\nbust passenger-liner in the world received much attention and admiration as an engineering feat.  \nHowever the benefit realisation of the project is arguable.  The superlatives sunk with the ship on \nits maiden voyage in 14\nth\n April 1912.  The unexpected event – hitting an iceberg – could actually \nhave been expected and avoided, yet probably considered unlikely to happen given its massive \nand sturdy structure.  It emerged subsequently that the resources necessary to cope with the crisis \nwere not available, which worsened the consequences of the unexpected event significantly. \n \nAs projects are inherently uncertain, they are prone to unexpected events (De Meyer et al., 2002; \nHuchzermeier and Loch, 2001; Sun and Meng, 2008), i.e. events that may have been predicted \n(or not), but are not expected to happen.  When they happen, they can have a considerable impact \nin the project.  Yet project management mainstream literature responds to this reality in a rational \nand deterministic way, opting for a routine-based reliability to eliminate situated human condi-\ntion as the cause of errors (Pender, 2001).  The conventional view is to emphasise protocols, \ndocumentation and processes as the underlying success to programme and project management \n(PPM).  Loch et al. (2006) opines that risk and its management is too front-loaded, focusing on \nthe tools and techniques for risk identification and their containment through active monitoring \nand documentation such as the risk log.  Typically, risk management attempts to prevent uncer-\ntain events from materialising in the first place, by offering strategies to contain their effects if \nthey still occur. \n \nHowever, such as approach can be dangerous as Loosemore  argues: \n \n“(…) the danger is that continual advances in proactive management techniques will \nproduce an over-reliance upon strategies of anticipation and deflect attention from the \nneed to build resilience into organisations to deal with the unexpected.” (p. 140) \n \nThere is an increasing awareness that unexpected events will happen (Hällgren and Wilson, \n2008; Söderholm, 2008; Sun and Meng, 2008).  With Perrow, we argue that it is not a question \nof „if‟ but „when‟ unexpected events will emerge.  In Perrow (1994)‟s words, \n“no matter how hard we try there will be serious accidents because of the interactive \ncomplexity (which allows the inevitable error to interact in unexpected ways and defeat \nsafety systems) and tight coupling (in which small error propagate into major ones) of \nmost risky systems”. (p. 212) \n \nLittle help can be found in the project management literature on how individuals respond to un-\nexpected events.  Unlike the literature in general management, there are only a few empirical \nstudies dedicated to preparing for and responding to such events.  Exceptions can be found in \nstudies mainly on crisis management in the construction industry (Hällgren and Wilson, 2008; \nLoosemore, 1998a; b; Söderholm, 2008).  Loosemore (1998a; b) studied practitioners‟ behav-\niours in a crisis and identified „ironies‟ in which important aspects such as mutual trust are \nthreatened or missing exactly in moments of crisis.  Hällgren and Wilson (2008) and Söderholm \n(2008) examine the practices used by project managers to cope with unexpected events, in a \nsimilar line as the practice approach developed in sociology and philosophy (e.g. Jarzabkowski \nand Spee, 2009; Schatzki, 1996). \n \nThere is also a lack of studies exploring the link between practices and success.  This paper aims \nto contribute to this gap by examining practitioners‟ perceptions of how successfully they re-\nsponded to unexpected events.  Building on the „ironies‟ identified by Loosemore (1998b), we \nexplored the enabling conditions that will support project managers‟ ability to cope with unex-\npected events.  That is, what organisational foundations are relevant to respond to unexpected \nevents successfully? \n \nWe explored three elements: (1) the event, (2) the response and (3) perceived success.  Three \nquestions were asked, respectively: “what happened?”, “what did project and programme man-\nagers do when faced with an unexpected event?” and “how did successful responses differ from \nunsuccessful ones from the perspective of the practitioner?”  The first two questions provided us \nwith a context of the change and participants‟ reactions when faced with an unexpected occur-\nrence.  The study is centred on the third question.  We have deliberately located our research on \nperceived success of response rather than the overall success of the project for two reasons.  \nFirstly, the overall project success is influenced by several other factors that we would not be \nable to control for.  Secondly, we aim to understand success as seen from the viewpoint of pro-\nject personnel faced with an unexpected event.  We believe that our study is amongst the firsts to \nexamine response success to unexpected events.  We compare and contrast successful and un-\nsuccessful responses to shed light on successful practices.  \n \n2 Literature review \n \nImportance of unexpected events and their response \nA project is a „vehicle of change‟ including a defined scope which needs to be delivered in a de-\nfined time and at an agreed cost (e.g. APM, 2006).  Projects are characterised by, among others, \nits uniqueness and inherent uncertainty; each differing from the other in some respect (e.g. APM, \n2006; Maylor, 2005; PMBoK, 2004).  Given project management‟s scientific management incli-\nnation, it is not surprising that systematic responses have been developed in the form of risk \nmanagement standards to provide order and predictability (Chapman and Ward, 2002; Ward and \nChapman, 2002a; b).  Hence, the purpose of risk management is to assess and manage uncer-\ntainty in advance - to define responses  to risks that may have a future adverse impact on the pro-\nject outcome before they materialise (Chapman and Ward, 2002).  Invariably, risk management \nis reliant on hindsight as a predicator for future risk events.  \n \nAlthough risk management seeks to identify much of the variations and provide for their mitiga-\ntion, it is simply impossible to totally de-risk a project.  De Meyer et al (2002) claim that projects \nface a continuum of unexpected change varying from simple variations (or aleatory uncertainty) \nto chaos (or epistemic uncertainty), as shown in the left side of Figure 1.  On the one side sits \naleatory uncertainty which refers to chance and describes a random process.  Throwing a dice \noften enough enables a decision maker to define outcome probabilities of one side of the dice \nshowing up.  We are uncertain about the number we will receive, but we are sure that each of the \nnumbers will occur with a probability.  The distribution of probabilities (chance) would not \nchange unless the dice itself would change its shape.  Changing its shape, the dice would have to \nbe thrown repeatedly in order to generate knowledge about the new distribution of chances.  \nHence simple variations in a well-defined and planned project, such as rain in the British Au-\ntumn can ground a construction project to a halt.  Alternatively, the project team may forget a \ndetail, make wrong calculations, etc; or, as the expected utility theory claims, they may decide \nthat the benefit  realised by avoiding the risk is lower than the effort or cost necessary to avoid it \n(Arrow, 1983; Borge, 2001; Kahneman and Tversky, 1979). \n \nOn the other end of the continuum, „chaos‟ is involved in exploratory projects, such as the devel-\nopment of new drugs in the combat of a disease.  This extreme faces epistemic uncertainty.  \nEpistemic uncertainty results from gaps in knowledge.  For example, one may be uncertain of an \noutcome because one has never used a particular technology before.  In many contexts, managers \nremain ignorant.  Aleatory and, in particular, epistemic uncertainty, demand that we have to try \nand make sense of incidents when they happen as unexpected events.  Uncertainty in projects \nmeans that managers‟ predictions such as the probabilistic conclusions about future risk are only \n„best guesses‟ and cannot be relied on unquestioningly (Frosdick, 1997; Pender, 2001).  \n \n \nVariations\nAleatory\nuncertainty\nKnown-\nunknowns\n‘Chaos’\nEpistemic \nuncertainty\nUnknown-\nunknowns\nRisk management process \nreduces the number of \noccurrences, but some risks \nwere not prevented, and some \neven not identified (whether \ndeliberately or not)\nThese possible events were invisible to the \nproject team – Unk-unks, and therefore \nrisk management is not of help\nConsequence:\nUnexpected events \nwill emerge\n(Events that impact \nthe project. They \ncould have been \nidentified, but were \nnot expected)\nResponse and its perceived \nsuccess\nWhat did project and \nprogramme managers do \nwhen faced with an \nunexpected event? How did \nsuccessful responses differ \nfrom unsuccessful ones \nfrom the perspective of \npractitioner? \nResearch Focus\n \nFigure 1: Focus of the Research \n \n \nUnexpected events: What are they? \nNotwithstanding project managers‟ efforts to predict all possible risks in projects, there are al-\nways residual uncertainties (as illustrated in Figure 1).  Unexpected events for the purpose of this \nstudy are the outcome of a range of residual uncertainties that can threaten the viability of a pro-\nject (see Figure 2)  \n \nProbability\nImpact\nPertinence\nTiming\nUnlikely\nHigh\nUntopical\nSudden\nLikely\nLow\nTopical\nCreeping\nUnexpected events\n \nFigure 2: Differentiating aspects of unexpected events \nLiterature often refers to unexpected events as low probability, high impact situations.  Yet, this \ndoes not necessarily mean that the event is purely unforeseeable or unknown (Pich et al., 2002).  \nRecent research has highlighted the aspect of attention; managers concentrating on some features \nof the environment to the (relative) exclusion of others (Weick, 1995).  In general, they learn to \nconcentrate on what is critical in their experience with the domain at hand and disregard any \nother events.  Reasons for the lack of attention are manifold but the cognitive exclusion of these \npossible events creates the effect of a surprise.  Despite being knowledgeable about the risks in a \nproject, they elect to shelve some under the rationale, „it will not happen to me‟.  For example, \npublic and relevant statistics are available to help us make a reasonable judgement about the like-\nlihood of been injured in a car accident.  Having subconsciously decided that „it will not happen \nto me‟, we continue to drive our cars.  Therefore, when an actual car accident occurs, we are sur-\nprised because the actual threat was not conceived pertinent at the given point in time.   \n \nAlthough the probabilistic, normative „management by planning‟ approaches such as risk man-\nagement suggest that uncertainty can be well planned in advance, we have incomplete knowl-\nedge about how projects will unfold (Pender, 2001). It is inevitable that unanticipated events will \noccur in projects, requiring a time-pressured response (Hällgren and Wilson, 2008; Loosemore, \n2000) and calling for a „management by organising‟ project management paradigm (Williams, \n2005).  As responding to unexpected events is a fundamental function in project management, \nparticipants in this study were asked to think of examples of „significant unforeseeable events‟ \nwhich took the project manager and his team „by surprise‟, whether these were effectively un-\nknown, unpredicted or merely residual risks that materialised. \n \nResponding to unexpected events and the impact on success \nStudies especially within crisis management explored a) individual, b) group and c) organisa-\ntional responses to unexpected events.  These are summarised in Table 1. \n \nIndividual behaviours in a crisis are widely researched, especially within psychological research.  \nMany of the studies were looking at how people behaved when faced with catastrophic events \nsuch as Tsunamis, earthquakes or war.  In the organisational context, researchers conclude that \n“cognitive limitations are inherent in individuals and that organization-based solutions constitute \nthe primary method for overcoming or minimising these limitations” (Pearson and Clair, 1998). \n \nResponses at the group level encompass practices based on interactions among stakeholders in-\nternally and externally, such as negotiations.  The majority of studies in the project management \nliterature are located at this level.  Organisational level responses regard broader activities and \norganisational culture in preparing individuals to cope with unexpected events as they material-\nise.  Some organisations are well equipped able to cope with unexpected events while responses \nfrom others can worsen the situation (Carmeli and Halevi, 2009).  Commentators debate on the \n„best‟ way to respond to a crisis but lack empirical validation.  Empirical studies in the project \nmanagement context identified responses that took place in companies but did not evaluate \nwhether these were perceived as successful or not (see Table 1).  The scant attention on individ-\nual perspective of responses to unexpected events prompts this project.  \nTable 1: Literature on practices related to unexpected events \n \nFocus Source Methodology Responses \nP\nro\nje\nct\n c\no\nn\nte\nx\nt \nIndividual \nand group \nlevel \nLoosemore \n(1998a) \nCase studies in construc-\ntion projects \nPreconceived beliefs and attitudes, level of uncertainty surrounding financial responsibility \nand pressure  \nLoosemore \n(1998b) \nCase studies in construc-\ntion projects \nNecessity but usual lack of team work and collective responsibility, effective communication \nand mutual sensitivity between project members \nGroup and \norganisatio-\nnal level \nSöderholm \n(2008) \nFour case studies of dif-\nferent project types in \ndifferent industries \nMost used practices were: Detaching strategies, setting up intensive meeting schedules and \nnegotiating project conditions \nEngwall and \nSvensson (2001; \n2004) \nThree case studies in \nproduct development \nprojects \nCheetah organisations: Abrupt emergence of ad hoc organisations composed to solve unex-\npected problems. They are explicitly sanctioned, have full-time members, are action-oriented \n accomplish a specific mission, and are smaller and more time limited than usual temporary \norganisations (the duration varies from 3 to 8 weeks). \nHällgren and \nWilson (2008) \n15 crises in construction Remedies draw on internal as well as external sources of expertise, intensive communication \nand both formal and informal practices. Practices included mainly negotiations with client \nand subcontractors and re-planning and re-organising – including overtime and re-work \nNikander and \nEloranta (2001) \nInterviews and case stud-\nies in construction pro-\njects \nComplementing traditional project management planning with attention to early warning \nsignals. 68 types of early warnings including gut feelings, conflicts, indecision. \nPavlak (2004) Conceptual with exam-\nples based on case stud-\nies \nTroubleshooting through creative problem solving in “tiger teams” – high performance \nteams solving problems based on uninhibited constructive conflict \nG\nen\ner\nal\n m\nan\nag\nem\nen\nt \nIndividual \nand group \nlevel \nMany studies in psychology, for example defensive mechanisms: shock, defensive, acknowledgement, adaptation (Fink et al., 1971), limited \ninformation processing capabilities, tendency for irrational and biased responses, shattered assumptions, victimisation (summarised by Pear-\nson and Clair, 1998), threat rigidity theory - individuals, groups and organisations behave rigidly in threatening crisis situations (Chat-\ntopadhyay et al., 2001; George et al., 2006; Meszaros, 1999; Starbuck and Milliken, 1988; Staw et al., 1981) \nGroup level Improvisation Improvisation can be defined as “the conception of action as it unfolds, by an organization and\/or its members, drawing \non available material. Cognitive, affective and social resources” (Pina e Cunha et al., 1999). Often conceptualised around \nthe Jazz metaphor, this concept had its peak in the 1990s and was considered a way to deal with unexpected events in \nsituations such as meetings.  \nOrganisa-\ntional level \nProne to pre-\npared \nPreparation to crisis developing an organisation from crisis prone to crisis prepared through identifying types of crisis, \nregarding early warnings, construct systems that enable, for example, facing faulty rationalisations and engaging with \nstakeholders (Pearson and Mitroff, 1993). \nResilience An organisation that can adapt to and respond to crisis and develop from crisis to success (e.g. Hamel and Valikangas, \n2003; Weick and Sutcliffe, 2001) \n3 Research design \nAn adapted Repertory Grid (RepGrid) method was used to explore the unexpected event and \ntheir respective responses, which together form the unit of analysis of this study.  RepGrid be-\nlongs to the family of cognitive mapping tools.  Despite the name, the proposition that cognitive \nmapping is able to predict behavior is arguably flawed as it ignores the role of emotion (Eden, \n1992).  The process of articulating cognition in itself instigates reflection that can influence ac-\ntion.  However it is reasonable to argue that  \n \n“[cognitive mapping] may represent subjective data more meaningfully than other mod-\nels and so have utility for researchers interested in subjective knowledge.” (Eden, 1992, \np. 262).  \n \nThis fits well with the goal of the present study as it facilitates the process of unfolding the dif-\nferences between a successful and unsuccessful response to unexpected events from the perspec-\ntive of project or programme manager. \n \nRepGrid is widely applied in IS research as summarised by Tan and Hunter (2002) and has \ngained some attention lately in project management research (Baloi and Price, 2003; Napier et \nal., 2009).  This method was developed by Kelly (1955) in psychological studies in the 1950‟s.  \nIt is based on the identification of characteristics (or “constructs”) by comparing and contrasting \ndifferent elements, in this study, responses to unexpected events.  Goffin (2002) applies this \ntechnique to management research and suggests that the method is adequate to articulate percep-\ntions about complex issues, so that explanations go beyond jargon, and new insights are likely to \nemerge.  Brown (1992) compared several cognitive mapping methods and RepGrid was posi-\ntively evaluated for its truthfulness and value-tapping capacity, but criticized it mainly for its de-\npendence on investigators‟ skills and ease to use.  The criticisms were evident in our pilot study, \nin particular as regards the number of comparative elements.  In order to facilitate the process \nand overcome both criticisms, we adapted the method by limiting comparative elements to two \ninstead of at least three (details as below). \n \nData collection \nData collection followed three steps.  The data collection instrument containing instructions on \nthe use of the RepGrid was first piloted with six participants who tested it for clarity, adequacy \nand methodological rigor.  Two were practitioners with over five years of experience in project \nmanagement; two were academics with no experience in project management, but with experi-\nence in using the RepGrid method, and the remaining two participants had no experience in \nmanagement or research.  A significant feedback was that participants unfamiliar with the Rep-\nGrid method found it difficult and confusing to compare three or more types of events.  They \nstruggled to distinguish the events, what happened in each of them and assess their own response \nat the same time.  We started the pilot considering five unexpected events and concluded with \nonly two.  As we were researching participants who are practising managers, we took the deci-\nsion to avoid academic jargon. Instead, we used common language nomenclatures in the research \ninstrument.  For example, calling „constructs‟, characteristics instead.  Finally, it was decided \nthat the instrument should be viewed and used by both participant and moderator.  This improved \ndiscussions, promoted shared understanding and increased face validity of the study. \n \nThe instrument comprised a table with four columns along the lines of a repertory grid: \n Characteristics (constructs, in academic terms): the process was triggered by the question \n“what makes the response to the event A different to the response to event B?”  The an-\nswer to this question was written down in the first column, the constructs.  As each of \nthese emerged, the moderator explored what they really meant, so that the constructs \nwere described adequately, avoiding misunderstandings. \n Poles: here the participants described what they considered to be extreme success and \nfailure for each of the constructs described in the first column.  This not only enhanced \nunderstanding in what was meant by each of the constructs but also provided us with a \nscale for each construct. \n Rating for event A and B: based on the scale produced in the second column, responses \nto events A and B are than rated from 1 (extremely successful) to 5 (extremely unsuc-\ncessful). \n \n22 experienced project managers from defence and defence-related organisations agreed to par-\nticipate in the study.  Eight are military officers involved in a number of transformation and \nequipment acquisition projects.  Five are Ministry of Defence (MOD) civilian managers working \non projects in the MOD‟s Integrated Project Teams (IPTs).  Nine are project managers from the \nprivate sector.  We started by explaining the goals of the research and the interview process (how \nrepertory grid works, including a demonstration of how the process unfolds). Then we asked the \nparticipant to choose responses to two comparable significant but not related unexpected events \n(event A and B) that happened in their projects.  One response was to be perceived by them to be \nsuccessful and the other to be unsuccessful.  The events and their respective responses were \nbriefly described in written form.  The second step comprised the repertory grid process per se.  \nThe responses to events A and B were compared and reported in written form through the in-\nstrument.  The responses to events A and B were compared through a dialogue between the indi-\nvidual project or programme manager and a moderator.  The moderator led the research exercise, \nand instigated the identification of different characteristics (constructs) and their underlining \nmeaning.  These were reported in written form on the instrument. \n \nThe process continued until the participants could not identify further constructs.  The repertory \ngrids had from one to six constructs.  The majority (12 participants) identified two constructs.  A \ntotal of 52 constructs were identified, and respondents took around 30 to 45 minutes to undertake \nthe entire process. \n \nAnalysing the data \nThe data analysis followed three steps undertaken by the three researchers involved in the study.  \nFirstly, we discussed each event and coded it according to the nature of what impacted the pro-\nject\/programme.  We strived to avoid a typology of risk events, but rather to derive an overview \nof what happened in each event.  The types emerged inductively.  The process was interactive \nand the events were revisited by the researchers until there was a consensus on the types and \ntheir classifications.   \n \nWe then followed the same process for the responses to these events.  Here the focus was on \nwhat successful responses had that were lacking in unsuccessful responses, and what unsuccess-\nful responses had that were not present in successful responses.  During this process, the con-\nstructs proposed in the repertory grid were grouped around six types of responses. \n \nFinally, we evaluated the internal validity of the data by checking whether the successful re-\nsponses were also considered more successful than the unsuccessful responses when using the \nsix constructs identified in the research.  The validity was confirmed. \n \n4 Empirical Results \nSeven different categories emerged from the 44 unexpected events analysed, namely technical \nissues, sponsor withdrawing support, external events, resource change or constraint, human be-\nhaviour and project scope.   \n \nTable 2 shows the number of responses to unexpected events that had successful and unsuccess-\nful responses according to the type of event.  The total number of events of each type varied \nfrom six to nine and consequently there was no type of event that was mentioned significantly \nmore often than others.  There were also a symmetric number of examples of successful and un-\nsuccessful responses for each type of event.  For example, we had three technical issues dealt \nwith successfully and three unsuccessfully.  Human behaviour was the only exception, and was \nmore often associated with failure than success.  This provided us with enough empirical data to \ndiscuss each of the types.   \n \n \n \n \nTable 2: Types of events \n Success-\nful \nUnsuc-\ncessful \n Example Total \nTechnical issues (TI) 3 3 Unexpected insufficient per-\nformance of a technical system \n6 \nSponsor withdrawing support (SS) 3 3 Project dismissed in senior man-\nagement meeting \n6 \nExternalities (external events out of \ninfluence of project) (EU) \n4 4 War in an Latin American coun-\ntry \n8 \nResource change and constraints \n(RC) \n5 4 Key resource pulled off to work \non other projects \n9 \nHuman behaviour – disregarding \nrules and protocols (HB) \n1 5 War protocol was neglected 6 \nProject scoping issues (PS) 6 3 Major changes in scope 9 \n \n \nTable 3 provides an overview of the six constructs that characterised the responses and which \nrepresented the differences between successful and unsuccessful responses.  The table also indi-\ncates the number of times each of the constructs was mentioned by participants.  Stakeholder en-\ngagement was mentioned by all the participants, followed by authority and capability of the team \nand flexibility of processes to respond to events.  One could be tempted to link the types of \nevents and these constructs but this would encourage misleading interpretations as the constructs \nwere identified in the comparison between two disassociated events that were usually of a differ-\nent type, and therefore the constructs cannot be attributed to a specific type of event. \n \n \n \n \n \nTable 3: Characteristics and examples of successful responses \nConstructs Examples of successful responses No. of times mentioned \nA. Stakeholders’ engage-\nment \nNegotiation of scope with client, reorganise stakeholders \nperception of risk 22 \nB. Capability of leader \nand team \nTrained team, „they know what they are doing‟ \n19 \nC. Processes Flexibility, no micro planning, contingency plan, control \nover decisions and resources 14 \nD. Behaviour Avoidance of panic and overreaction 8 \nE. Communication Availability and communication of information, ac-\nknowledge concerns of the team 8 \nF. Timing High speed of approval process, good sense of urgency 8 \n \n \n5 Findings \nOf interest is the difficulty of some of the participants to identify the truly „unknown-unknowns‟.  \nThey explained that it was difficult to recall events that had significant impact on their projects \nand were not identified and usually also part of the risk log.  In other words, the events were \n“known-unknowns” rather than “unknown-unknowns”.  Known-unknowns are circumstances, \noutcomes or events that actors  have identified as possibly existing, but do not know whether \nthey will take place or not.  Unknown-unknowns are those circumstances, events, outcomes that \nwere not identified in the first place.  \n \nThe ability to identify many possible risks reflects the experience of the participants as project \nand programme managers and the embeddedness of risk identification as an organisational rou-\ntine.  However, it also implies that identification may be relevant but it is not „the‟ answer to un-\ncertainty.  Although some of the events analysed were predicted, not all of them had successful \nresponses, prompting the question “is success in responding to unexpected events a matter of \nluck?”  In the next sections, we will discuss how project managers created their own luck and \nincreased the success of their responses to unexpected events.  \n \nThe three pillars \nThe six constructs identified in the RepGrid (Table 3) followed intuitively in the three domains \nof organisational responses distinguished in the literature: organisational, group and individual.  \nThey indicated that successful responses to unexpected events were organic and based on three \npillars: a responsive and functioning structure at the organisational level, interpersonal relation-\nship at the group level and competent people at the individual level.  Figure 3 portrays these pil-\nlars and respective constructs.  In the next sections, each pillar is discussed in detail. \n \nSuccessful Response to Unexpected Events\nOrganisational level\nResponsive and functioning \nstructure\n• High degree of freedom (C)\n• Pace to make and implement \ndecisions (F)\nIndividual level\nCompetent people\n• Competence of leader and team \n(B)\n• Behaviour, including self-\nawareness and ability to deal \nwith stressful situation (D)\nGroup level\nGood interpersonal relationship\n• Engagement with stakeholders, \nincluding ability to negotiate \nsolutions (A)\n• Communication, including \navailability of information as \nwell as its communication (E)\n \nFigure 3: Three Pillars to Successful Response to Unexpected Events \n \nResponsive and functioning structure \nNot surprisingly, the results indicate that the ability of organisations to respond to changes ap-\npropriately and quickly was present in successful responses but lacking in unsuccessful re-\nsponses to unexpected events.  This ability was mentioned by the majority of participants in \nterms of explicit management practices such as rapid decision making and implementation of \nthese decisions.  Successful responses characterised by top management involvement, provided \nprojects managers the necessary political support to act quickly and accordingly.  A sense of ur-\ngency and access availability to resources were perceived as success factors by, for example, a \nproject team responsible for investigating and coping with an aircraft accident.  The agility in \nscrambling a team to investigate the causes of the accident enabled quick and decisive processes, \nand the consequent solution of the issue with limited negative implications.  The people available \nwere not professionally trained, but the project manager was able to bridge the knowledge gap \nmore efficiently in that situation than if a sufficiently trained team were in place, but delayed, as \nit was the case in the unsuccessful project used for comparison. \n \nWe termed this ability „responsive organisation‟ after the definition proposed by Bernardes and \nHanna (2009).  The authors offer a distinction between flexibility, agility and responsiveness – \noften used interchangeably: flexibility is the ability to change within existing or pre-established \nparameters, agility relates to the ability to rapidly reconfigure within new parameters, and re-\nsponsiveness refers to the purposeful and timely response to change.  Based on this distinction, it \nis appropriate to term the organisation ability described as responsiveness. \n \nApart from being responsive, another relevant characteristic identified was empowerment.  Par-\nticipants as managers were allowed to decide what responses should be undertaken, how to do \nthem, the choice of resources deemed necessary for their budget, and so on.  This concept ap-\nproximates that of situated action (Suchman, 1987), which is based on the premise that people \ninvolved in the specific situation are most able to judge what needs to be done, how to do it, etc. \nSuchman advocates the shifting of responsibility and authority to the key people in each specific \nsituation.  \n \nWhile successful responses were characterised by a high degree of freedom, unsuccessful re-\nsponses exposed micro-management and excessive control by higher hierarchical levels within \nthe project.  Respondents  explained that much time was spent justifying what should be done, \nand reporting what was done (up to a daily report), leaving little time to actually undertake the \nactions to put the project or programme back on track.  For example, in a project to assist the \ntransition to independence in an African country, resource requests were slow and some times \nhad to be submitted several times.  This severely hindered the ability to response to the unex-\npected event successfully.  \n \nSome unsuccessful responses also suggested the relevance of functioning structures.  Here, the \nproject and programme managers mentioned that if the structure and processes are complicated \nand not working well before the event takes place, a good response is even more challenging.  As \nreported by one of the participants, B [unsuccessful event] had descended into chaos due to con-\nflicting PM approaches.  Thus, successful responses rely on structures that are on one hand flexi-\nble but on the other, provide clear and simple principles and processes to manage projects. \n \nOverall, the aspects of responsive and functioning structure remind project managers that a pro-\nject should not be driven in maximum speed, considering, for example, overtime a standard prac-\ntice, as unexpected event will most certainly happen, and the team needs buffer to cope with it \nsuccessfully.  As with the Titanic, it is more difficult to see and respond to icebergs when driving \nat maximum speed. \n \n \nGood interpersonal relationships \nThe second pillar is the relationships between people involved.  All respondents mentioned en-\ngagement with stakeholders as key for successful responses.  This was relevant in two instances.  \n \nFirstly, as expected, engagement with stakeholders played an important role in responding to un-\nexpected event; all participants identified this construct.  For example, in one of the unexpected \nevents studied, the beneficiary raised the issue with the project team, and made sure that all sides \ninvolved were aligned and committed to enable enough resources to solve the problem.  It was \nclear that the management of unexpected events needs to be recognised as a priority and esca-\nlated properly, and usually escalation per se is not necessarily an issue, but the type of support is.  \nSome participants complained of a support system based on a top-down control, more intensive \nreporting and even daily short conversations with top management.  This kind of response from \ntop management does not provide support, but rather consumes time and resource that could \nhave been used to cope with the impact of the unexpected event.  Interestingly, over zealous top-\ndown control was more apparent in private companies than in the military or MOD integrated \nproject teams. \n \nSecondly, negotiations with team members, clients and suppliers were another key characteristic \nof successful responses, lacking in unsuccessful responses.  An example was the negotiation of a \nship survey contract with a different provider who was better able to increase the availability of \nships necessary to cope with the unexpected event.  Similar instances have also been identified in \nother studies (Söderholm, 2008). \n \nParticipants also stressed the importance of communication and the flow of information.  The \ngeographical distance in some military projects particularly in times of war, requires the avail-\nability of technology to communicate.  Eight respondents stressed the relevance of availability \nand flow of information among team members, and one stressed the ability to listen and ac-\nknowledge the concerns of the team.  \n \n \nCompetent people \nThe third pillar relates to competent people.  Almost all respondents stressed the importance of \npeople along lines similar to these listed below: \n \nteam and leader “knew what they were doing” \n“having resource available with the right skills” \n“providing the right resource in a timely manner” \n“have cohesive teamwork” \n \nBeing able to trust the judgement of colleagues and their ability to resolve the situation also \nemerged as important.  One participant described the benefits of clear leadership to provide a \nnew direction after an unexpected event. \n Another aspect mentioned by several participants was the ability of managers to control their \nemotions in stressful situations.  Events where people „do not panic‟ resulted in successful re-\nsponses.  On the other hand, over-reaction was associated with unsuccessful responses.  This im-\nplies that project managers with high emotional intelligence (EQ) are more likely to respond to \nunexpected events successfully.  This finding is in line with that of Müller and Turner (2007), the \nestablished a strong relationship between managers with high emotional intelligence (EQ) and \nproject success. \n \n \n6 Organisational embeddness in response to crises  \nThe three pillars and their underlining concepts are closely related to other theories developed in \ngeneral management.  We have discussed them in relation to the theories and studies reviewed in \nthe literature review on responses to crises and unexpected events in project contexts.  The emer-\ngence of structure, people and relation as key constructs suggest that two additional topics (not \npreviously identified in the literature) – post bureaucratic organisations and improvisation - \nmight have relevance for this study.  \n \nThe characteristics present in successful responses to unexpected events resonates some of the \nprinciples proposed by the post-bureaucratic organisations.  Post-bureaucratic organisations \nemerged as an ideal type of organizing that functions as the opposite of bureaucracy, where the \nhierarchic, centralized and formalized bureaucratic organization is replaced by a flat, decentral-\nized organization, emphasizing flexibility rather than rule-following (Heckscher, 1994), resem-\nbling features of organic organizations (Burns and Stalker, 1961).  Today, post-bureaucratic or-\nganizations are understood as a trend, rather than a singular type, that encompasses changes ob-\nserved in the organizations, including the rhetoric of rapid change, globalization and competition \nin which survival depends on adaptation of organizations and flexibility, autonomy and com-\nmitment of employees – termed the fast capitalist story (Gee, 1996 in Alvesson and Thompson, \n2006). \n \nFlexibility, autonomy and commitment were identified as core constructs for successful re-\nsponses.  One potential area for future research would be to explore the relationship between \npost-bureaucratic organisations and the ability to respond to unexpected events.  Taken the tem-\nporality of crises as suggested by (Engwall & Svensson, 2004), it could be suggested that organi-\nsations approximate to post-bureaucratic principles in face of crises.  However, previous studies \nsuggest that the instability created by crises lead organisations to the opposite direction, increas-\ning direct control, reducing trust and intensifying organisational politics and lack of transparency \n(Loosemore, 1998b; Söderholm, 2008).  Thus, such transformation is unlikely. \n \nWhat previous research on crises management in project context suggests is that post-\nbureaucratic islands could be formed within organisations to respond to crises accordantly.  Cre-\nate an isolated team to cope with the crises is common, as the detaching strategies identified by \nSöderholm (2008), the „Cheetah organisations‟ proposed by Engwall and Svensson (2001), or the \ntiger teams (Pavlak, 2004).  These temporary organisations do not follow usual organisational \nmodus operanti, have more access to resources, autonomy, higher levels of stress and work over-\ntime. \nHowever, the responses identified in our study were far more embedded in the current organisa-\ntion, its mechanisms and available resources.  As discussed in the data analysis, the responses \ndemanded top management involvement in decisions, and draw on existing relationships with \nstakeholders, available competences, current structures and processes.  If these were not func-\ntioning, the responses are unlikely to be successful.  Thus, unlike previous studies, our partici-\npants did not stress the importance of the specific management action related to dealing with un-\nexpected events, such as detaching strategy, but rather showed that the management of such \nevents is widely embedded in the current structures and its ability to respond.  As projects \n(Engwall, 2003), responses to crises within projects cannot be seen as islands.  Future research \ncould further explore to what extend is the response to unexpected events are embedded in cur-\nrent conditions of the project, its structure, leaders and team, and it puts forward a third preposi-\ntion, that post-bureaucratic organisations are more able to respond to crises. \n \nAbility to respond is not as an island, but embedded in current forms is what has been put for-\nward in studies on improvisation and bricolage.  Pina e Cunha et al (2001) defined organisational \nimprovisation as “the conception of action as it unfolds, by an organizational and\/or its mem-\nbers, drawing on available material, cognitive, affective and social resources” (Pina e Cunha et \nal., 1999).  Similar to studies on crisis following the „Normal Accident Theory‟ (Perrow, 1999), \nkey in the discussions around improvisation is firstly the ability to act intelligently and accord-\nantly in real time, when conception and actions converge to the same point in time (Moorman \nand Miner, 1998).  Second aspect of improvisation is that it draws on available resources: “if im-\nprovisation means responding in real time, then it immediately follows that improvisers cannot \nwait for optimal resources to be deployed and have to tackle the issues at hand with those that \nare currently available” (Pina e Cunha et al., 1999).  The reconfiguration of resources to respond \nto current challenge is termed bricolage.  This was clear in some of the responses studied, where \nrapid deployment of resources overrides the optimal set of competences for the task.   \n \n \n7 The importance of the pillars \nContrary to what we expected, the data did not indicate that some types of change were usually \ndealt with more successfully than others.  Each type of event had a similar number of successful \nand unsuccessfully responses (see Table 2). \n \nIt could be argued that this symmetry is a consequence of the methodology applied in the study.  \nAs each participant was asked to provide an example of a successful and an unsuccessful re-\nsponse to unexpected events, it is likely that they may have thought about similar types of events.  \nHowever, a careful analysis of the data showed that this does not hold true, and the type of „event \nA‟ from each participant (dealt with successfully) was usually different than the type of „event \nB‟ (dealt with unsuccessfully).  This strengthens the argument that, at least for the 44 responses \nto unexpected events analysed, the three pillars are these that differentiate between success and \nfailure, regardless of the type of event that might impact the project or programme. \n \nWhile all other types of event could be either managed successfully or not, human behaviour is-\nsues predominantly led to failure (see Table 2).  Examples of such change were negligence of \nprocedures, bypassing milestones or agreement of other parties.  \n \nHuman behaviour issues straddle across the three pillars.  They can hamper a „responsive and \nfunctioning structure‟ (pillar 1) as structures rely on people‟s competence and appropriate behav-\niour.  Inappropriate or opportunistic behaviour can also damage the second pillar (good interper-\nsonal relationships).  Finally, behavioural issues can have a negative impact on pillar 3, as the \ncompetence of employees would be put into question.  Thus, people lay at the heart of the re-\nsponse to unexpected events. \n \nThus, the responses to unexpected events analysed suggest that improvement in project man-\nagement can be achieved by better managing these three pillars.  This enables project and pro-\ngramme managers to “create their own luck”, and encourages a lean approach to project and \nprogramme management.  The study findings indicate the need to refrain from merely adopting a \nprocess-based approach to predict all possible events and prescribe appropriate responses ab ini-\ntio.  It was the combination of structure, people and relationships that was more likely to enable a \nsuccessful response to an unexpected event. \n \n8 Conclusions \nNo matter how good risk management processes are, projects will invariably face unexpected \nevents.  The aim of this study was to identify what differentiated successful and unsuccessful re-\nsponses to unexpected events from the perspective of project and programme managers.  We in-\nterviewed 22 experienced project managers using Repertory Grid as a data collection method.  \n \nThe results indicated that structural solutions based on the creation of an isolated team to deal \nwith unexpected event such as the cheetah team (Engwall and Svensson, 2001), or detaching \nstrategies (Söderholm, 2008) are important, but not necessarily possible.  The examples of suc-\ncessful responses were much embedded and dependent on the current organisational structures \navailable to projects.  However, the heart of successful responses to unexpected responses lies \nwith people assets, especially in terms of stakeholder engagement, negotiation and leadership \nskills. \n \nThe research suggests that successful responses to unexpected events were built on three pillars: \nresponsive and functioning structures, good interpersonal relationship and competent people.  As \nthe Titanic sailed close to the unexpected iceberg, careful attention by organisations in allowing \nempowerment supported by these three pillars could have helped avoid or reduce adverse conse-\nquences – that is, people can “create their own luck”. \n \nThis has two important implications for current approaches to managing projects and teaching \nproject management.  It suggests that linear project management approaches could usefully be \ncomplemented with ways to deal with unexpected events.  Just as it is time to accept the impor-\ntance of people in projects, it is also vital that project personnel acknowledge that “the unex-\npected happens” and that front-end thinking alone is not going to be enough to develop success-\nful projects.  The study participants highlighted simple, responsive and functioning structures as \na fundamental pillar of success.  Further research could explore this in greater depth and identify \nthese structures in more detail by asking, “what (constructed) organisational responses would \nbest support project and programme managers to react to unexpected events successfully?” and \n“how do we construct resilient organisations that are able to avoid rigidity and „chaos‟?” \n \nSecondly, the results call for further studies focusing on the behavioural aspects of project man-\nagement, including how to prepare people to cope with the stress involved in unexpected events.  \nAlso further studies following the ideas of practice would shed light into what project and pro-\ngramme managers really do to respond to such events. \n \nThis research was of exploratory nature.  Further research could explore each of these pillars in \nmore detail.  Case studies could observe the actual reactions to unexpected events and how pro-\nject and programme managers used these pillars in fact to enable successful responses.  Loose-\nmore (1998b) argued that usually exactly those factors that would have been relevant in the mo-\nment of crisis are usually lacking.  This begs the question of whether and how organisations \ncould develop these pillars beforehand and still be sure they would not lose strength in the mo-\nment of need, i.e. how companies learn to be prepared for unexpected events. \n \n \n9 A reflection on study limitations \nHindsight offers a 20:20 vision of how we could do things better.  On reflection, this has been a \njourney of discovery for the researchers as well as the participants (who as busy managers, never \nreally stopped to reflect on the possible reasons for their actions and behaviours).  The motiva-\ntion for the present study is the limited understanding on individual perceptions and responses to \nunexpected events in the project environment.  Its function is exploratory as there is little in the \nproject literature to provide strong theoretical underpinning.  We drew on the literatures from \nsociology, psychology and management disciplines, in particular, from research on behaviours in \ncrisis.  Inductive data analysis and interpretation revealed other possible explanations, especially \nthe concepts of post-bureaucratic organisations and improvisation.  Hence, although the present \nstudy has given us an early appreciation of situated responses to unexpected events in projects \nand their evaluations as a success or failure, the findings can only be generally informative rather \nthan to provide specific solutions for various ad hoc events.   \n \nIn our effort to delve deep into the human cognition of their actions and consequences, we opted \nfor the Repertory Grid instead of straight-forward interviews.  The primary strength of the Rep-\nGrid method is comparability.  As relative novices and in view of the expressed difficulty by par-\nticipants of juggling events, responses and assessments, we had to adapt the Grid for easier par-\nticipant and moderator use.  We started with five constructs but had to be content with two.  We \naccept that reducing from five to two constructs and relating the findings mostly to the crisis \nmanagement studies, we could have constrained breadth of analysis and insights.  A small point \nin our favour is our discussion on the embeddedness of organisational practices in crisis using \norganisational theory and organisation behaviour literature.  \n \nAs we were working with practitioners who are unfamiliar with both the instrument and aca-\ndemic research, we attempted to avoid using any „jargon‟.  Arguably, this could lead to meaning \nbeing lost in translation, requiring explanation or clarification by the researcher (e.g. using the \nphrase „significant unforeseeable events‟ to draw out „unknowns-unknowns‟ as well as covering \n„known-unknowns‟).  Although some researchers might argue for the need to control individual \nbias and rationalising by participants, the import of the present study‟s objective of assessing \nsuccessful and non-successful responses as seen from the eyes of the participants lies in the fact \nthat perceptions underlines attitudes, emotions, and motivations.  To begin understanding how \nwell people see they have responded to any unexpected event, means having to accept that bias \nand post-event rationalisation are part of the „package‟.  The strength of this research is that we \nrefrained from judging participants‟ motives; instead we aimed to allow patterns to emerge.  This \ndoes not mean, however, that researchers‟ bias can be eradicated entirely.  \n \nOur sample consisted of experienced project and programme managers who are in the defence or \ndefence-related industry is sound but the split between groups could be more even.  Were we to \nrun this project again, we would direct participants to think of „real‟ projects that are fully \naligned with the standard definitions by PMI or APM of “what is a project”.  This does not mean \nthat the undertakings by the military participants (or indeed the analogy with the Titanic) are \n„non-projects‟.  Each was uncertain, unique to some extent, mission driven, temporary (had to be \nperformed in a timely fashion or by a set date) and involved clear outcome deliveries.  The main \ndeparture for the military is that money or budget is the least of the three primary constraints as \nachieving the mission is the key imperative.  Planning and scheduling are important activities for \nmilitary project managers as in the project to help an African nation transit to democratic gov-\nernance.  Likewise, the design and build of the Titanic was a major project even by present-day \nterms.   \n \n \n10 References  \nAlvesson, M., Thompson, P., 2006. Post-bureaucracy, in: Ackroyd, S., Batt, R., Thompson, P., \nTolbert, P.S. (Eds.), The Oxford Handbook of Work and Organization, Oxford University \nPress, Oxford, pp. 485–507. \nAPM, 2006. APM Body of Knowledge. 5th ed. Association for Project Management, Bucking-\nhamshire. \nArrow, K.J., 1983. Behaviour under uncertainty and its implications for policy, in: Stigum, B.P., \nWenstop, F. (Eds.), Foundations of Utility and Risk Theory with Applications, D. Reidel \nPublishing Company, Dordrecht, pp. 19 - 32. \nBaloi, D., Price, A.D.F., 2003. Modelling global risk factors affecting construction cost perform-\nance. International Journal of Project Management 21 (4), 261-269. \nBernardes, E., Hanna, M., 2009. A theoretical review of flexibility, agility and responsiveness in \nthe operations management literature. International Journal of Operations and Production \nManagement 29 (1), 30-53. \nBorge, D., 2001. The Book of Risk. John Wiley & Sons, New York. \nBrown, S.M., 1992. Cognitive mapping and repertory grids for qualitative survey research: some \ncomparative observations. Journal of Management Studies 29 (3), 287-307. \nBurns, T., Stalker, G.M., 1961. The Management of Innovation. Tavistock, London. \nCarmeli, A., Halevi, M., 2009. How top management team behavioral integration and behavioral \ncomplexity enable organizational ambidexterity: The moderating role of contextual ambi-\ndexterity. The Leadership Quarterly 2 (1), 207-218. \nChapman, C., Ward, S., 2002. Managing Project Risk and Uncertainty. John Wiley & Sons, \nWest Sussex. \nChattopadhyay, P., Glick, W.H., Huber, G.P., 2001. Organizational Actions in Response to \nThreats and Opportunities. Academy of Management Journal 44 (5), 937-955. \nDe Meyer, A., Loch, C.H., Pich, M.T., 2002. Managing project uncertainty: from variation to \nchaos. Engineering Management Review, IEEE 30 (3), 91-91. \nEden, C., 1992. On the nature of cognitive maps. Journal of Management Studies 29 (3), 261-\n265. \nEngwall, M., 2003. No project is an island: linking projects to history and context. Research Pol-\nicy 32 (5), 789-808. \nEngwall, M., Svensson, C., 2001. Cheetah teams. Harvard Business Review 79 (2), 20. \nEngwall, M., Svensson, C., 2004. Cheetah teams in product development: the most extreme form \nof temporary organization? Scandinavian Journal of Management 20 (3), 297-317. \nFink, S.L., Beak, J., Taddeo, K., 1971. Organizational crisis and change. The Journal of Applied \nBehavioral Science 7 (1), 15-37. \nFrosdick, S., 1997. The techniques of risk analysis are insufficient in themselves. Disaster Pre-\nvention and Management 6 (3), 165 - 177. \nGeorge, E., Chattopadhyay, P., Sitkin, S.B., Barden, J., 2006. Cognitive Underpinnings of Insti-\ntutional Persistence and Change: a Framing Perspective. Academy of Management Review \n31 (2), 347-365. \nGoffin, K., 2002. Repertory grid technique, in: Partington, D. (Ed.), Essential Skills for Man-\nagement Research, Sage, London, pp. 199-225. \nHällgren, M., Wilson, T.L., 2008. The nature and management of crises in construction projects: \nProjects-as-practice observations. International Journal of Project Management 26 (8), \n830-838. \nHamel, G., Valikangas, L., 2003. The quest for resilience. Harvard Business Review 81 (9), 52-\n65. \nHeckscher, C., 1994. Defining the post-bureaucratic type, in: Heckscher, C. (Ed.), The Post-\nBureaucratic Organization: New Perspectives on Organizational Change, Sage, Newbury \nPark. \nHuchzermeier, A., Loch, C.H., 2001. Project Management Under Risk: Using the Real Options \nApproach to Evaluate Flexibility in R&D. Management Science 47 (1), 85-101. \nJarzabkowski, P., Spee, A.P., 2009. Strategy as practice: A review ad future directions for the \nfield. International Journal of Management Reviews 11 (1), 69-95. \nKahneman, D., Tversky, A., 1979. Prospect theory: An analysis of decision under risk. Econo-\nmetrica 47 (2), 263 - 291. \nKelly, G.A., 1955. The Psychology of Personal Constructs. W.W. Norton, New York. \nLoch, C., DeMeyer, A., Pich, M., 2006. Managing the unknown: a new approach to managing \nhigh uncertainty and risk in projects. John Wiley & Sons, Inc. New York, NY, USA. \nLoosemore, M., 1998a. Organisational behaviour during a construction crisis. International \nJournal of Project Management 16 (2), 115-121. \nLoosemore, M., 1998b. The three ironies of crisis management in construction projects. Interna-\ntional Journal of Project Management 16 (3), 139-144. \nLoosemore, M., 2000. Crisis management in construction projects. American Society of Civil \nEngineers, Danvers. \nMaylor, H., 2005. Project Management. 3rd ed. Financial Times\/ Prentice Hall, Essex. \nMeszaros, J.R., 1999. Preventative choices: Organizations' heuristics, decision processes and \ncatastrophic risks. Journal of Management Studies 36 (7), 977-998. \nMoorman, C., Miner, A., 1998. The convergence of planning and execution: improvisation in \nnew product development. The Journal of Marketing, 1-20. \nMüller, R., Turner, J.R., 2007. Matching the project manager‟s leadership style to project type. \nInternational Journal of Project Management 25 (1), 21-32. \nNapier, N.P., Keil, M., Tan, F.B., 2009. IT project managers' construction of successful project \nmanagement practice: a repertory grid investigation. Information Systems Journal 19, 255-\n282. \nNikander, I.O., Eloranta, E., 2001. Project management by early warnings. International Journal \nof Project Management 19 (7), 385-399. \nPavlak, A., 2004. Project troubleshooting: Tiger teams for reactive risk management. Project \nManagement Journal 35 (4), 5-14. \nPearson, C.M., Clair, J.A., 1998. Reframing crisis management. Academy of Management Re-\nview, 59-76. \nPearson, C.M., Mitroff, II, 1993. From crisis prone to crisis prepared: a framework for crisis \nmanagement. Academy of Management Executive 7 (1), 48-59. \nPender, S., 2001. Managing incomplete knowledge: Why risk management is not sufficient. In-\nternational Journal of Project Management 19, 79 - 87. \nPerrow, C., 1994. The limits of safety: the enhancement of a theory of accidents. Journal of Con-\ntingencies and Crisis Management 2 (4), 212-220. \nPerrow, C., 1999. Normal Accidents: Living with High-Risk Technologies. Princeton University \nPress, Princeton. \nPich, M.T., Loch, C.H., De Meyer, A., 2002. On uncertainty, ambiguity, and complexity in pro-\nject management. Management Science, 1008-1023. \nPina e Cunha, M., Vieira da Cunha, J., Kamoche, K., 1999. Organizational improvisation: what, \nwhen, how and why. International Journal of Management Reviews 1 (3), 299. \nPMBoK, P., 2004. A Guide to the Project Management Body of Knowledge (PMBOK Guide), \nProject Management Institute Newtown Square, PA. \nSchatzki, T.R., 1996. Social Practices: a Wittgensteinian approach to human activity and the \nsocial. Cambridge University Press. \nSöderholm, A., 2008. Project management of unexpected events. International Journal of Pro-\nject Management 26 (1), 80-86. \nStarbuck, W.H., Milliken, F.J., 1988. Challenger: Fine-tuning the odds until something breaks. \nJournal of Management Studies 25 (4), 319-340. \nStaw, B.M., Sandelands, L.E., Dutton, J.E., 1981. Threat-rigidity effects in organizational behav-\nior: A multilevel analysis. Administrative Science Quarterly 26 (4), 501-524. \nSuchman, L.A., 1987. Plans and Situated Actions: The Problem of Human-Machine Communi-\ncation. Cambridge University Press, Cambridge. \nSun, M., Meng, X., 2008. Taxonomy for change causes and effects in construction projects. In-\nternational Journal of Project Management 27 (6), 560-572. \nTan, F.B., Hunter, M.G., 2002. The repertory grid technique: A method for the study of cogni-\ntion in information systems. Management Information Systems Quarterly 26 (1), 39-57. \nWard, S., Chapman, C., 2002a. Project Uncertainty Management as a Desirable Future, Univer-\nsity of Southampton, Southampton. \nWard, S., Chapman, C., 2002b. Transforming project risk management into project uncertainty \nmanagement. International Journal of Project Management 21 (2), 97-105. \nWeick, K.E., 1995. Making Sense of the Organisation. Sage. \nWeick, K.E., Sutcliffe, K.M., 2001. Managing the Unexpected: Assuring High Performance in \nan Age of Complexity. Jossey-Bass San Francisco. \nWilliams, T.J., 2005. Assessing and moving from the dominant project management discourse in \nthe light of project overruns. IEEE Transactions on Engineering Management 52 (4), 497-\n508. \n \n \nThe Titanic sunk, so what? \nProject manager response to unexpected events \n \nJoana G. Geraldi \nLiz Lee-Kelley \nElmar Kutsch \n \nAbstract \nProjects are inherently uncertain and face unexpected events, from small changes in \nscope to unforeseen client’s bankruptcy.  This paper studies how project managers re-\nspond to such events and how successful and unsuccessful responses differ from the \nperspective of the practitioner.  We analysed 44 unexpected events faced by 22 experi-\nenced project managers in defence and defence-related organisations.  The project \nmanagers compared two unexpected events that they faced, one that they considered \nthe response successful and the other, unsuccessful.  We identified three pillars sup-\nporting successful responses to unexpected events: (1) responsive and functioning \nstructure at the organizational level, (2) good interpersonal relationship at the group \nlevel and (3) competent people at the individual level.  The events and respective re-\nsponses analysed suggest that improvement in project management can be achieved by \nbetter managing these three pillars, allowing project and programme managers to “cre-\nate their own luck”. \n \n*Title Page (WITH Author Details)\nThe Titanic sunk, so what? \nProject manager response to unexpected events \n \n \nVariations\nAleatory \nuncertainty\nKnown-\nunknowns\n‘Chaos’\nEpistemic \nuncertainty\nUnknown-\nunknowns\nRisk management process \nreduces the number of \noccurrences, but some risks \nwere not prevented, and some \neven not identified (whether \ndeliberately or not)\nThese possible events were invisible to the \nproject team – Unk-unks, and therefore \nrisk management is not of help\nConsequence:\nUnexpected events \nwill emerge\n(Events that impact \nthe project. They \ncould have been \nidentified, but were \nnot expected)\nResponse and its perceived \nsuccess\nWhat did project and \nprogramme managers do \nwhen faced with an \nunexpected event? How did \nsuccessful responses differ \nfrom unsuccessful ones \nfrom the perspective of \npractitioner? \nResearch Focus\n \nFigure 1: Focus of the Research \n \n \nProbability\nImpact\nPertinence\nTiming\nUnlikely\nHigh\nUntopical\nSudden\nLikely\nLow\nTopical\nCreeping\nUnexpected events\n \nFigure 2: Differentiating aspects of unexpected events \n \n \nFigure\nSuccessful Response to Unexpected Events\nOrganisational level\nResponsive and functioning \nstructure\n• High degree of freedom (C)\n• Pace to make and implement \ndecisions (F)\nIndividual level\nCompetent people\n• Competence of leader and team \n(B)\n• Behaviour, including self-\nawareness and ability to deal \nwith stressful situation (D)\nGroup level\nGood interpersonal relationship\n• Engagement with stakeholders, \nincluding ability to negotiate \nsolutions (A)\n• Communication, including \navailability of information as \nwell as its communication (E)\n \nFigure 3: Three Pillars to Successful Response to Unexpected Events \n \nThe Titanic sunk, so what? \nProject manager response to unexpected events \nTable\nTable 1: Literature on practices related to unexpected events \n \nFocus Source Methodology Responses \nP\nro\nje\nct\n c\no\nn\nte\nx\nt \nIndividual \nand group \nlevel \nLoosemore \n(1998a) \nCase studies in construc-\ntion projects \nPreconceived beliefs and attitudes, level of uncertainty surrounding financial responsibility \nand pressure  \nLoosemore \n(1998b) \nCase studies in construc-\ntion projects \nNecessity but usual lack of team work and collective responsibility, effective communica-\ntion and mutual sensitivity between project members \nGroup and \norganisatio-\nnal level \nSöderholm \n(2008) \nFour case studies of dif-\nferent project types in \ndifferent industries \nMost used practices were: Detaching strategies, setting up intensive meeting schedules and \nnegotiating project conditions \nEngwall and \nSvensson \n(2001; 2004) \nThree case studies in \nproduct development \nprojects \nCheetah organisations: Abrupt emergence of ad hoc organisations composed to solve un-\nexpected problems. They are explicitly sanctioned, have full-time members, are action-\noriented  accomplish a specific mission, and are smaller and more time limited than usual \ntemporary organisations (the duration varies from 3 to 8 weeks). \nHällgren and \nWilson (2008) \n15 crises in construction Remedies draw on internal as well as external sources of expertise, intensive communica-\ntion and both formal and informal practices. Practices included mainly negotiations with \nclient and subcontractors and re-planning and re-organising – including overtime and re-\nwork \nNikander and \nEloranta (2001) \nInterviews and case \nstudies in construction \nprojects \nComplementing traditional project management planning with attention to early warning \nsignals. 68 types of early warnings including gut feelings, conflicts, indecision. \nPavlak (2004) Conceptual with exam-\nples based on case stud-\nies \nTroubleshooting through creative problem solving in “tiger teams” – high performance \nteams solving problems based on uninhibited constructive conflict \nG\nen\ner\nal\n m\nan\nag\ne-\nm\nen\nt \nIndividual \nand group \nlevel \nMany studies in psychology, for example defensive mechanisms: shock, defensive, acknowledgement, adaptation (Fink et al., 1971), lim-\nited information processing capabilities, tendency for irrational and biased responses, shattered assumptions, victimisation (summarised \nby Pearson and Clair, 1998), threat rigidity theory - individuals, groups and organisations behave rigidly in threatening crisis situations \n(Chattopadhyay et al., 2001; George et al., 2006; Meszaros, 1999; Starbuck and Milliken, 1988; Staw et al., 1981) \nGroup level Improvisation Improvisation can be defined as “the conception of action as it unfolds, by an organization and\/or its members, draw-\ning on available material. Cognitive, affective and social resources” (Pina e Cunha et al., 1999). Often conceptualised \naround the Jazz metaphor, this concept had its peak in the 1990s and was considered a way to deal with unexpected \nevents in situations such as meetings.  \nOrganisa-\ntional level \nProne to pre-\npared \nPreparation to crisis developing an organisation from crisis prone to crisis prepared through identifying types of crisis, \nregarding early warnings, construct systems that enable, for example, facing faulty rationalisations and engaging with \nstakeholders (Pearson and Mitroff, 1993). \nResilience An organisation that can adapt to and respond to crisis and develop from crisis to success (e.g. Hamel and Valikangas, \n2003; Weick and Sutcliffe, 2001) \n Table 2: Types of events \n Success-\nful \nUnsuc-\ncessful \n Example Total \nTechnical issues (TI) 3 3 Unexpected insufficient per-\nformance of a technical system \n6 \nSponsor withdrawing support (SS) 3 3 Project dismissed in senior man-\nagement meeting \n6 \nExternalities (external events out of \ninfluence of project) (EU) \n4 4 War in an Latin American coun-\ntry \n8 \nResource change and constraints \n(RC) \n5 4 Key resource pulled off to work \non other projects \n9 \nHuman behaviour – disregarding \nrules and protocols (HB) \n1 5 War protocol was neglected 6 \nProject scoping issues (PS) 6 3 Major changes in scope 9 \n \n \nTable 3: Characteristics and examples of successful responses \nConstructs Examples of successful responses No. of times mentioned \nA. Stakeholders’ en-\ngagement \nNegotiation of scope with client, reorganise stake-\nholders perception of risk 22 \nB. Capability of leader \nand team \nTrained team, „they know what they are doing‟ \n19 \nC. Processes Flexibility, no micro planning, contingency plan, \ncontrol over decisions and resources 14 \nD. Behaviour Avoidance of panic and overreaction 8 \nE. Communication Availability and communication of information, \nacknowledge concerns of the team 8 \nF. Timing High speed of approval process, good sense of ur-\ngency 8 \n \n \n"}