{"doi":"10.1177\/0583102405059054","coreId":"141058","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1029","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1029","10.1177\/0583102405059054"],"title":"Development of Acoustic Emission Technology for Condition Monitoring and\nDiagnosis of Rotating Machines; Bearings, Pumps, Gearboxes, Engines and Rotating\nStructures.","authors":["Mba, David","Rao, Raj B. K. N."],"enrichments":{"references":[{"id":37925247,"title":"A comparative experimental study on the diagnostic and prognostic capabilities of Acoustics Emission, Vibration and Spectrometric Oil Analysis for spur gears. Mechanical Systems and Signal Processing, Submitted and under review,","authors":[],"date":"2005","doi":"10.1016\/j.ymssp.2005.09.015","raw":"Tan, C. K., Phil Irving, David Mba, A comparative experimental study on the diagnostic and prognostic capabilities of Acoustics Emission, Vibration and Spectrometric Oil Analysis for spur gears. Mechanical Systems and Signal Processing, Submitted and under review, Jan 2005.","cites":null},{"id":37925183,"title":"A comparative experimental study on the use of Acoustic Emission and vibration analysis for bearing defect identification and estimation of defect size.","authors":[],"date":"2005","doi":"10.1016\/j.ymssp.2004.10.013","raw":"Abdullah M. Al-Ghamdi and D. Mba. A comparative experimental study on the use of Acoustic Emission and vibration analysis for bearing defect identification and estimation of defect size. Mechanical Systems and Signal Processing, Accepted MSSP04-98R2. 2005.   46","cites":null},{"id":37925324,"title":"A Critical Appraisal of Monitoring Elastic Waves as a Means of Detecting & Diagnosing Machine Faults.","authors":[],"date":"1999","doi":null,"raw":"Holroyd, T.J. & Brashaw, C. (1999). A Critical Appraisal of Monitoring Elastic Waves as a Means of Detecting & Diagnosing Machine Faults. Proceedings of COMADEM 1999. Coxmoor Publishing Co. UK. 491-497. 1 –","cites":null},{"id":37925186,"title":"Acoustic Emission analysis for bearing condition monitoring,","authors":[],"date":"1985","doi":"10.1016\/0043-1648(95)06591-1","raw":"Li, C. J, Li, S. Y., Acoustic Emission analysis for bearing condition monitoring, Wear, 185, 1985, 67-74.","cites":null},{"id":37925146,"title":"Acoustic emission and transient waves in an elastic plate,","authors":[],"date":"1979","doi":"10.1121\/1.382274","raw":"Pao, Y-H., Gajewski, R.R. and Ceranoglu, A.N. (1979), Acoustic emission and transient waves in an elastic plate, J. Acoust. Soc. Am., 1979, 65(1), 96 –","cites":null},{"id":37925195,"title":"Acoustic Emission as a basis for the condition monitoring of industrial machinery.","authors":[],"date":"2000","doi":"10.4028\/0-87849-420-0.45","raw":"Holroyd, T. J., Acoustic Emission as a basis for the condition monitoring of industrial machinery. Proceedings of the 18 th Machinery vibration seminar, Canadian Machinery vibration association, 27-29 April 2000, Halifax, Nova Scotia, Canada, p 125-131. ISBN 1-55131-045-7.","cites":null},{"id":37925323,"title":"Acoustic Emission as a Means of Dynamically Probing the Operation of Machines & Mechanisms.","authors":[],"date":"1996","doi":null,"raw":"Holroyd, T.J., Randall, N. & Lin, D. (1996). Acoustic Emission as a Means of Dynamically Probing the Operation of Machines & Mechanisms. COMADEM","cites":null},{"id":37925209,"title":"Acoustic Emission in Monitoring Extremely Slowly Rotating Rolling Bearing.","authors":[],"date":"1999","doi":null,"raw":"Miettinen, J. & Pataniitty, P. (1999). Acoustic Emission in Monitoring Extremely Slowly Rotating Rolling Bearing. Proceedings of COMADEM","cites":null},{"id":37925147,"title":"Acoustic Emission Inspection, Physical Acoustics Corporation,","authors":[],"date":"1989","doi":null,"raw":"Pollock AA, Acoustic Emission Inspection, Physical Acoustics Corporation, Technical Report, 1989, TR-103-96-12\/89.","cites":null},{"id":37925198,"title":"Acoustic Emission Monitoring of Grease Lubricated Rolling Bearings.","authors":[],"date":"2000","doi":"10.1016\/s0301-679x(00)00124-9","raw":"Miettinen, J. & Salmenperä, P. (2000). Acoustic Emission Monitoring of Grease Lubricated Rolling Bearings. Proceedings of COMADEM 2000. MFPT Society, USA. 21-30. ISBN 0 – 9635450 – 2 - 7","cites":null},{"id":37925165,"title":"Acoustic Emission monitoring of rolling element bearings,","authors":[],"date":"1988","doi":"10.1109\/ultsym.1988.49503","raw":"Hawman, M. W., Galinaitis, W. S, Acoustic Emission monitoring of rolling element bearings, Proceedings of the IEEE, Ultrasonics symposium, 1988, 885-889","cites":null},{"id":37925208,"title":"Acoustic Emission Monitoring of Slow Moving Bearings.","authors":[],"date":"1993","doi":null,"raw":"Holroyd, T.J. (1993). Acoustic Emission Monitoring of Slow Moving Bearings. Proceedings of COMADEM 1993. University of West of England, Bristol. 518. ISBN 1 – 871056 – 72 - 1","cites":null},{"id":37925221,"title":"Acoustic Emission of bending fatigue process of spur gear teeth.","authors":[],"date":null,"doi":"10.1299\/kikaic.71.2392","raw":"Miyachika, K., Oda, S. and Koide, T. Acoustic Emission of bending fatigue process of spur gear teeth. Journal of Acoustic Emission. 13(1\/2). S47-S53.","cites":null},{"id":37925222,"title":"Acoustic Emission of bending fatigue process of super-carburised spur gear teeth. Progress in Acoustic Emission XI. The Japanese Society for NDI.","authors":[],"date":"2002","doi":null,"raw":"Miyachika, K., Zheng, Y., Tsubokura, K., Oda, S., Kanayama, Y., Koide, T., Namba, C. and Hayashi, T. Acoustic Emission of bending fatigue process of super-carburised spur gear teeth. Progress in Acoustic Emission XI. The Japanese Society for NDI. 304-310. 2002.","cites":null},{"id":37925199,"title":"Acoustic emission of rolling bearings lubricated with contaminated grease, Tribology International,","authors":[],"date":"2000","doi":"10.1016\/s0301-679x(00)00124-9","raw":"Miettinen J, Andersson, P. Acoustic emission of rolling bearings lubricated with contaminated grease, Tribology International, 2000,","cites":null},{"id":37925251,"title":"Acoustic emission source at the gear mesh,","authors":[],"date":"2004","doi":"10.1111\/j.1475-1305.2010.00769.x","raw":"Tan, C. K and Mba, D, Acoustic emission source at the gear mesh, Proceedings of the 17 th International congress on Condition Monitoring and Diagnostic Engineering management, COMADEM, p 145-151, Aug 2004. ISBN 0-954 1307-1-5.","cites":null},{"id":37925337,"title":"Acoustic Emission testing of bolted connections under tensile stress. 22 nd European conference on Acoustic Emission Testing. The Robert Gordon University,","authors":[],"date":"1996","doi":null,"raw":"Hanel, V.; Thelen, W. Acoustic Emission testing of bolted connections under tensile stress. 22 nd European conference on Acoustic Emission Testing. The Robert Gordon University, Aberdeen. 29-31 May 1996;p 185-188.","cites":null},{"id":37925205,"title":"Acoustic emission tranducers for the vibration monitoring of bearings at low speeds, Report no. CUED\/CMech\/TR29","authors":[],"date":"1983","doi":null,"raw":"McFadden, P. D., and Smith, J. D. Acoustic emission tranducers for the vibration monitoring of bearings at low speeds, Report no. CUED\/CMech\/TR29 1983.","cites":null},{"id":37925149,"title":"Acoustic emission,","authors":[],"date":"1983","doi":null,"raw":"Mathews, J. R. Acoustic emission, Gordon and Breach Science Publishers Inc., New York. 1983, ISSN 0730-7152.","cites":null},{"id":37925231,"title":"AE in Tooth Surface Failure Process of Spur Gears.","authors":[],"date":"1998","doi":null,"raw":"Sentoku, H. AE in Tooth Surface Failure Process of Spur Gears. Progress in Acoustic Emission IX. AEWG & AE Group. S19-S24. 1998.","cites":null},{"id":37925335,"title":"Applicability of acoustic emissions to monitoring the mechanical integrity of bolted structures in low speed rotating machinery: case study.","authors":[],"date":"2002","doi":"10.1016\/s0963-8695(01)00053-6","raw":"Mba, D., Applicability of acoustic emissions to monitoring the mechanical integrity of bolted structures in low speed rotating machinery: case study. NDT and E International. Vol. 35, No. 5, pp. 293-300. 2002   57","cites":null},{"id":37925171,"title":"Application of acoustic emission technique for the detection of defects in rolling element bearings, Tribology International,","authors":[],"date":"2000","doi":"10.1016\/s0301-679x(00)00012-8","raw":"Choundhury, A. and Tandon, N., Application of acoustic emission technique for the detection of defects in rolling element bearings, Tribology International, 2000; 33, 39-45","cites":null},{"id":37925163,"title":"Application of acoustic emission technique to detection of rolling bearing failure,","authors":[],"date":"1984","doi":null,"raw":"Yoshioka T, Fujiwara T. Application of acoustic emission technique to detection of rolling bearing failure, American Society of Mechanical Engineers, Production Engineering Division publication PED, 1984, 14,","cites":null},{"id":37925177,"title":"application of Acoustic Emission to condition monitoring of rolling element bearings.","authors":[],"date":"2001","doi":"10.1177\/002029400103400805","raw":"Kaewkongka, T and Au, Y. H. J., application of Acoustic Emission to condition monitoring of rolling element bearings. Measurement and Control, Vol 34, no. 8, 254-247, 2001.","cites":null},{"id":37925172,"title":"Application of acoustic emission to the detection of bearing failures.","authors":[],"date":"1990","doi":null,"raw":"Tan, C.C. Application of acoustic emission to the detection of bearing failures. The Institution of Engineers Australia, Tribology conference, Brisbane, 3-5 December 1990, 110-114.","cites":null},{"id":37925179,"title":"Application of high frequency monitoring for classification of rolling element bearing failures.","authors":[],"date":"2001","doi":"10.4028\/www.scientific.net\/kem.204-205.173","raw":"Price, E. D., Lees, A. W., M.I. Friswell, Application of high frequency monitoring for classification of rolling element bearing failures. Key Engineering Materials, Vol 204-205, 173-182, 2001","cites":null},{"id":37925211,"title":"Bannister Condition monitoring of slowspeed rolling element bearings using stress waves.","authors":[],"date":"2001","doi":"10.1243\/0954408011530488","raw":"N. Jamaludin, Dr. D. Mba, Dr. R. H. Bannister Condition monitoring of slowspeed rolling element bearings using stress waves. Journal of Process Mechanical Engineering, Pro. Inst. Mech Eng., 2001, 215(E):, Issue E4, 245-","cites":null},{"id":37925180,"title":"Bearing condition via vibration and acoustics emission measurements.","authors":[],"date":"1997","doi":"10.1006\/mssp.1997.0113","raw":"Shiroishi, J., Li, Y., Liang, L. S., Kurfess, T., Danyluk, S., Bearing condition via vibration and acoustics emission measurements. Mechanical Systems and Signal Processing, Vol. 11, no. 5, 1997, 693-705.","cites":null},{"id":37925175,"title":"Bearing defect diagnosis and acoustic emission,","authors":[],"date":"2003","doi":"10.1243\/135065003768618614","raw":"Morhain, A, Mba, D, Bearing defect diagnosis and acoustic emission, Journal of Engineering Tribology, I Mech E, Vol 217, No. 4,  Part J, p 257-272,  2003. ISSN 1350-6501.   45","cites":null},{"id":37925255,"title":"Cavitation inception in pumps,","authors":[],"date":"1962","doi":"10.1115\/1.3240865","raw":"P. J. McNulty and I.S. Pearsall, Cavitation inception in pumps, Journal of Fluids Engineering, Vol. 104, p 99 – 104, March 1962.","cites":null},{"id":37925169,"title":"Comparison of accelerometer and acoustic emission signals as diagnostic tools in assessing bearing.","authors":[],"date":null,"doi":null,"raw":"Bagnoli, S., Capitani, R. and Citti, P. Comparison of accelerometer and acoustic emission signals as diagnostic tools in assessing bearing. Proceedings of 2nd International Conference on Condition Monitoring, London, UK, May","cites":null},{"id":37925316,"title":"Comparison of signal processing techniques for detecting pump cavitation inception,","authors":[],"date":null,"doi":null,"raw":"S. Al-Sulti, B. Samanta, K. R. Al-Balushi, M. Al-Zedjali,  S. A. Al-Araimi, and R. A. Siddiqi, Comparison of signal processing techniques for detecting pump cavitation inception, 18 th  International Congress and Exhibition on Condition Monitoring and Diagnostic Engineering Management (COMADEM","cites":null},{"id":37925196,"title":"Computerisation preventive maintenance systems using modified Acoustic Emission techniques,","authors":[],"date":"1980","doi":null,"raw":"Finley, R. W, Computerisation preventive maintenance systems using modified Acoustic Emission techniques, Materials Evaluation, 38(8), p 15-20, August 1980.","cites":null},{"id":37925225,"title":"Condition Monitoring of a Gear Box Using Acoustic Emission Testing. Material Evaluation.","authors":[],"date":"1997","doi":null,"raw":"Siores, E. and Negro, A.A. Condition Monitoring of a Gear Box Using Acoustic Emission Testing. Material Evaluation. 183-187. 1997.","cites":null},{"id":37925341,"title":"Condition Monitoring of Low Speed Rotating Machinery.","authors":[],"date":"1996","doi":"10.1243\/0954408991529906","raw":"Mba, D.U., Bannister, R.H., Leslie, J.T. & Findlay, G.E. (1996). Condition Monitoring of Low Speed Rotating Machinery. Proceedings of COMADEM","cites":null},{"id":37925194,"title":"Condition monitoring of rolling element bearings using advanced acoustic emission signal analysis technique,","authors":[],"date":null,"doi":"10.1115\/esda2006-95006","raw":"Yibo Edward Fan, Fengshou Gu and Andrew Ball, Condition monitoring of rolling element bearings using advanced acoustic emission signal analysis technique, 18 th  International Congress and Exhibition on Condition Monitoring and Diagnostic Engineering Management (COMADEM 2005), Cranfield, UK, August 31 st – 2 nd September 2005.","cites":null},{"id":37925168,"title":"Condition monitoring of very slowly rotating machinery using AE techniques.","authors":[],"date":null,"doi":"10.1016\/b978-008044036-1\/50004-4","raw":"Holroyd, T. Condition monitoring of very slowly rotating machinery using AE techniques.  14th International congress on Condition monitoring and Diagnostic engineering management (COMADEM'2001), Manchester, UK, 4-","cites":null},{"id":37925253,"title":"Correlation between Acoustic Emission activity and asperity contact during meshing of spur gears under partial elastohydrodynamic lubrication. Accepetd, TRIBOLOGY LETTERS,","authors":[],"date":"2005","doi":"10.1007\/s11249-005-7793-1","raw":"C K Tan and D Mba, Correlation between Acoustic Emission activity and asperity contact during meshing of spur gears under partial elastohydrodynamic lubrication. Accepetd, TRIBOLOGY LETTERS, 2005","cites":null},{"id":37925170,"title":"Defect Detection of Rolling Element Bearings by Acoustic Emission Method,","authors":[],"date":"1990","doi":"10.1016\/0003-682x(90)90019-q","raw":"Tandon, N. and Nakra, B.C, Defect Detection of Rolling Element Bearings by Acoustic Emission Method, Journal of Acoustic Emission, 1990; 9(1) 25-28.","cites":null},{"id":37925193,"title":"Defect Diagnosis of Lightly Loaded Bearings with Acoustic Emissions.","authors":[],"date":"2002","doi":null,"raw":"Morhain, A. & Mba, D. (2002). Defect Diagnosis of Lightly Loaded Bearings with Acoustic Emissions. Proceedings of COMADEM 2002. COMADEM International, Birmingham. 492-502. ISBN 0 – 9541307 – 0 – 7.","cites":null},{"id":37925271,"title":"Detecting Acoustic Emission in Presence of Hydraulic Noise. Non Destrictive testing","authors":[],"date":"1969","doi":"10.1016\/0029-1021(69)90156-x","raw":"P. H. Hutton (1969). Detecting Acoustic Emission in Presence of Hydraulic Noise. Non Destrictive testing May 1969.","cites":null},{"id":37925224,"title":"Detecting Gear Tooth Breakage Using Acoustic Emission: A Feasibility and Sensor Placement Study.","authors":[],"date":"1999","doi":"10.1115\/1.2829503","raw":"Singh, A., Houser, D. R., and Vijayakar, S. Detecting Gear Tooth Breakage Using Acoustic Emission: A Feasibility and Sensor Placement Study. Journal of Mechanical Design. 121. 587-593. 1999.","cites":null},{"id":37925312,"title":"Detecting of cavitation in centrifugal pump using acoustic emission.","authors":[],"date":"1984","doi":null,"raw":"A. Almaskari (1984).  Detecting of cavitation in centrifugal pump using acoustic emission. MSc. Thesis, Cranfield University.","cites":null},{"id":37925314,"title":"detection of cavitation phenomenon in a centrifugal pump using audible sound,","authors":[],"date":null,"doi":"10.1006\/mssp.2002.1514","raw":"Cudina, M., detection of cavitation phenomenon in a centrifugal pump using audible sound, Mechanical Systems and Signal Processing, 17(6), 1335-1347,","cites":null},{"id":37925233,"title":"Detection of Defects in Gears by Acoustic Emission Measurements.","authors":[],"date":"1999","doi":null,"raw":"Tandon, N. and Mata, S. Detection of Defects in Gears by Acoustic Emission Measurements. Journal of Acoustic Emission. 17(1-2). 23-27. 1999.","cites":null},{"id":37925320,"title":"Detection of incipient cavitation and determination of the best efficiency point for centrifugal pumps using Acoustic Emission.","authors":[],"date":"2005","doi":"10.1243\/095440805x33225","raw":"L. Alfayez, D. Mba, Detection of incipient cavitation and determination of the best efficiency point for centrifugal pumps using Acoustic Emission. Journal of Mechanical Process Engineering, Part E, IMechE, 2005.","cites":null},{"id":37925264,"title":"Detection of Incipient Cavitation in Pumps using Acoustic Emission.","authors":[],"date":"1996","doi":"10.1243\/0954408971529737","raw":"Neill, G.D., Reuben, R.L., Sandford, P.M., Brown, E.R. and Steel, J.A. (1996). Detection of Incipient Cavitation in Pumps using Acoustic Emission. Proceedings of COMADEM 1996. Sheffield Academic Press, Sheffield. 391-","cites":null},{"id":37925270,"title":"Detection of Recirculation in Pumps using Acoustic Emission.","authors":[],"date":"1998","doi":"10.1243\/0954408971529737","raw":"Neill, G.D., Brown, E.R., Reuben, R.L., Sandford, P.M.and Steel, J.A. (1998). Detection of Recirculation in Pumps using Acoustic Emission. COMADEM","cites":null},{"id":37925246,"title":"Detection of severe sliding and pitting fatigue wear regimes through the use of broadband acoustic emission. 52","authors":[],"date":"2005","doi":"10.1243\/135065005x9817","raw":"Price, E. D., Lees, A. W., Friswell, M. I., Detection of severe sliding and pitting fatigue wear regimes through the use of broadband acoustic emission.   52 Proceedings of the I MECH E Part J Journal of Engineering Tribology, 219 (2), 85-98, 2005.","cites":null},{"id":37925338,"title":"Determination of load condition of standard screws during tensile tests using Acoustic Emission analysis.","authors":[],"date":"1995","doi":"10.1109\/imtc.1995.515143","raw":"Hanel,V.;Thelen,W.   Determination of load condition of standard screws during tensile tests using Acoustic Emission analysis. Instrumentation and Measurement Technology Conference, 1995. IMTC\/95. Proceedings. Integrating Intelligent Instrumentation and Control, IEEE 1995; p284.","cites":null},{"id":37925178,"title":"Development and application of stress-wave acoustic diagnostics for roller bearings,","authors":[],"date":"2000","doi":"10.1117\/12.388145","raw":"Schoess, J. N.; Development and application of stress-wave acoustic diagnostics for roller bearings, Proceedings of SPIE, The International society for optical engineering, Vol 3986, 58-70, 2000.","cites":null},{"id":37925204,"title":"Development of Low Speed Bearing Diagnosis Technique,","authors":[],"date":null,"doi":null,"raw":"Kuboyama, K., Development of Low Speed Bearing Diagnosis Technique, NKK Fukuyama Works, Fukuyama City, Hiroshima, Japan.   49","cites":null},{"id":37925219,"title":"Diagnosis of plain bearings by Acoustic Emission analysis,","authors":[],"date":"1985","doi":"10.1016\/0263-2241(85)90030-2","raw":"Sturm A, Uhlemann, S., Diagnosis of plain bearings by Acoustic Emission analysis, Measurements, 3(4), 185-191, 1985.   50","cites":null},{"id":37925174,"title":"Diagnosis of rolling bearing by measuring time interval of Acoustic Emission generation.","authors":[],"date":"1999","doi":"10.1115\/1.2834091","raw":"Yoshioka, T., korenaga, A., Mano, H. and Yamamoto, T. Diagnosis of rolling bearing by measuring time interval of Acoustic Emission generation. Journal of Tribology, Transactions of ASME, Vol. 121, July 1999, 468-472.","cites":null},{"id":37925250,"title":"Diagnostics and prognostics with Acoustic Emission, Vibration and Spectrometric Oil Analysis for spur gears; a comparative study,","authors":[],"date":"2005","doi":"10.1784\/insi.2005.47.8.478","raw":"Chee Keong Tan, Phil Irving and David Mba, Diagnostics and prognostics with Acoustic Emission, Vibration and Spectrometric Oil Analysis for spur gears; a comparative study, INSIGHT, Vol. 47 No. 8, August 2005","cites":null},{"id":37925184,"title":"Dynamic prognostic predicition of defect propagation on rolling element bearings.","authors":[],"date":"1998","doi":"10.1080\/10402009908982232","raw":"Li, Y., Billington, S., Zhang, C., Kurfess, T., Danyluk, S., Dynamic prognostic predicition of defect propagation on rolling element bearings. ASME\/STLE Tribology conference, Toronto, Ontario, Canada, Oct 26-28, 1998, 385-392.","cites":null},{"id":37925318,"title":"Dyson The application of Acoustic Emission for detecting incipient cavitation and the best efficiency point of a 60KW 55 centrifugal pump; case study.","authors":[],"date":null,"doi":"10.1016\/j.ndteint.2004.10.002","raw":"L. Alfayez, D. Mba, G. Dyson The application of Acoustic Emission for detecting incipient cavitation and the best efficiency point of a 60KW   55 centrifugal pump; case study. NDT & E International, Vol 38, no. 5, 354-358.","cites":null},{"id":37925226,"title":"Early Detection of Gear Pitting.","authors":[],"date":null,"doi":null,"raw":"Singh, A., Houser, D. R., and Vijayakar, S. Early Detection of Gear Pitting. Power Transmission and Gearing Conference, ASME. DE-Vol. 88, 673-678.","cites":null},{"id":37925182,"title":"Estimation of bearing defect size with Acoustic Emission,","authors":[],"date":null,"doi":"10.1784\/insi.46.12.758.54491","raw":"Abdullah M. Al-Ghamdi, P. Cole, Rafael Such, D. Mba, Estimation of bearing defect size with Acoustic Emission, INSIGHT, Vol. 46, no. 12, 758-761, Dec","cites":null},{"id":37925232,"title":"Fault classification of a model drive-line using time domain data. COMADEM","authors":[],"date":"1996","doi":null,"raw":"Badi, M.N.M., Engin, S.N. and Schonfeld, D. Fault classification of a model drive-line using time domain data. COMADEM 1996.  Sheffield, UK. 43-50.","cites":null},{"id":37925325,"title":"Field Application of Acoustic Emission to Machinery Condition Monitoring.","authors":[],"date":"1993","doi":null,"raw":"Holroyd, T.J. & Randall, N. (1993). Field Application of Acoustic Emission to Machinery Condition Monitoring. Proceedings of COMADEM 1993. University of West of England, Bristol. 217-222. 1 – 871056 – 72 - 1","cites":null},{"id":37925263,"title":"Flow recirculation in centrifugal pumps,","authors":[],"date":"1981","doi":null,"raw":"Fraser, W. H., Flow recirculation in centrifugal pumps, Proceedings of the 10 th annual turbomachinery symposium, Turbomachinery laboratory, Texas, USA., p 95-100, 1981.","cites":null},{"id":37925331,"title":"Gaseous Air-Fuel Quality Identification for a Spark Ignition Gas Engine using Acoustic Emission Analysis.","authors":[],"date":"1998","doi":null,"raw":"El-Ghamry, M.H., Brown, E., Ferguson, I.G., Gill, J.D., Reuben, R.L., Steel, J.A., Scaife, M. and Middleton, S. (1998). Gaseous Air-Fuel Quality Identification for a Spark Ignition Gas Engine using Acoustic Emission Analysis. Proceedings of COMADEM 1998. Monash University, Australia.","cites":null},{"id":37925235,"title":"Gear Fault Diagnostics using Wavelets and Artificial Neural Networks. COMADEM","authors":[],"date":"2000","doi":null,"raw":"Al-Balushi, K.R. & Samanta, B. (2000). Gear Fault Diagnostics using Wavelets and Artificial Neural Networks. COMADEM 2000. 1001-1010. 0 –","cites":null},{"id":37925234,"title":"Gear Faults Diagnosis Using Energy-Based Features of Acoustic Emission.","authors":[],"date":null,"doi":"10.1243\/095965102320005418","raw":"Al-Balushi, K. R. and Samanta, B. Gear Faults Diagnosis Using Energy-Based Features of Acoustic Emission. Journal of Systems and Control Engineering.","cites":null},{"id":37925223,"title":"Gear tooth bending fatigue crack detection by Acoustic Emissions and tooth compliance. ASME","authors":[],"date":null,"doi":null,"raw":"Wheitner, J., Houser, D. and Blazakis, C. Gear tooth bending fatigue crack detection by Acoustic Emissions and tooth compliance. ASME technical paper","cites":null},{"id":37925236,"title":"Identification of the Acoustic Emission source during a comparative study on diagnosis of a spur gearbox,","authors":[],"date":"2005","doi":"10.1016\/j.triboint.2004.10.007","raw":"Tan, C. K and Mba, D., Identification of the Acoustic Emission source during a comparative study on diagnosis of a spur gearbox, Tribology International, Volume 38, Issue 5,  Pages 469-480 , May 2005.","cites":null},{"id":37925332,"title":"Indirect measurement of cylinder pressure from diesel engines using acoustic emission,","authors":[],"date":null,"doi":"10.1016\/j.ymssp.2004.09.004","raw":"El-Ghamry, M., Steel, J.A.; Reuben, R.L.; Fog, T.L., Indirect measurement of cylinder pressure from diesel engines using acoustic emission, Mechanical Systems and Signal Processing, v 19(4),2005, 751-765.","cites":null},{"id":37925237,"title":"Limitation of Acoustic Emission for identifying seeded defects in gearboxes.","authors":[],"date":"2005","doi":"10.1007\/s10921-005-6657-9","raw":"Tan, C. K and Mba, D, Limitation of Acoustic Emission for identifying seeded defects in gearboxes. Journal of Non-Destructive Evaluation, Vol. 24, Issue 2, June 2005.","cites":null},{"id":37925197,"title":"Lubrication Monitoring in a Low Speed Bearing Using Acoustic Emission Technique.","authors":[],"date":"2002","doi":null,"raw":"Jamaludin, N., Jailani, M. & Nor, M. (2002). Lubrication Monitoring in a Low Speed Bearing Using Acoustic Emission Technique. Proceedings of   48 COMADEM 2002. COMADEM International, Birmingham. 521-527. ISBN 0 – 9541307 – 0 - 7","cites":null},{"id":37925340,"title":"Machine Condition Monitoring using Multi-Parameter Measurements.","authors":[],"date":"1994","doi":null,"raw":"Smulders, A. and Loob, C. (1994). Machine Condition Monitoring using Multi-Parameter Measurements. Proceedings of COMADEM 1994. Tata McGraw-Hill Publishing Co. India. 147- 152. 0 – 07 – 462360 - 5","cites":null},{"id":37925176,"title":"Measurement of Acoustic Emisión and vibration of rolling bearings with an artificial defect,","authors":[],"date":"2000","doi":"10.2219\/rtriqr.41.127","raw":"Kakishima, H., Nagatomo, T., Ikeda, H., Yoshioka,, T., Korenaga, A., Measurement of Acoustic Emisión and vibration of rolling bearings with an artificial defect, QR of RTRI, Vol 41, No. 3,127-130, 2000.","cites":null},{"id":37925261,"title":"Measurement Techniques and Analysis of Fluid-Borne Noise in Pumps. National Engineering Laboratory.","authors":[],"date":"1981","doi":null,"raw":"P. J. McNulty (1981) Measurement Techniques and Analysis of Fluid-Borne Noise in Pumps. National Engineering Laboratory. NEL Report No 674.","cites":null},{"id":37925187,"title":"Monitoring Acoustic Emission to detect mechanical defects, InTech,","authors":[],"date":"1979","doi":null,"raw":"Sundt, P. C, Monitoring Acoustic Emission to detect mechanical defects, InTech, December 1979, 43 – 44","cites":null},{"id":37925330,"title":"Monitoring Exhaust Valve Leaks and Misfire in Marine Diesel Engines.","authors":[],"date":"2001","doi":"10.1016\/b978-008044036-1\/50076-7","raw":"Friis-Hausen, A. and Fog, T.L. (2001). Monitoring Exhaust Valve Leaks and Misfire in Marine Diesel Engines. Proceedings of COMADEM 2001. Elsevier, Oxford. 641-648. 0 – 08 – 044036 - 3","cites":null},{"id":37925329,"title":"Monitoring of a Large Reciprocating Compressor.","authors":[],"date":"1998","doi":null,"raw":"Gill, J.D., Brown, E.R., Twite, M., Horner, G., Reuben, R.L.  Steel, J.A. (1998). Monitoring of a Large Reciprocating Compressor. Proceedings of COMADEM 1998. Monash University, Australia. 317-326. 0 – 7326 – 2027-9   56","cites":null},{"id":37925336,"title":"Monitoring screws under tensile load using acoustic emission analysis. Instrumentation and Measurement,","authors":[],"date":"1996","doi":"10.1109\/19.492784","raw":"Hanel, V.; Thelen, W. Monitoring screws under tensile load using acoustic emission analysis. Instrumentation and Measurement, IEEE Transactions, April 1996 ; 45(2): 547 –550.","cites":null},{"id":37925342,"title":"Monitoring the Integrity of Low Speed Rotating Machines. COMADEM","authors":[],"date":"2001","doi":"10.1016\/b978-008044036-1\/50083-4","raw":"Mba, D. & Hall, L. (2001). Monitoring the Integrity of Low Speed Rotating Machines. COMADEM 2001. 697-707.0 – 08 – 04436 - 3","cites":null},{"id":37925188,"title":"Multi-parameter condition monitoring, Noise and vibration worldwide,","authors":[],"date":"1992","doi":"10.1016\/0963-8695(94)90498-7","raw":"Barclay, J., Bannach, R, Multi-parameter condition monitoring, Noise and vibration worldwide, March 1992, 17 – 20.","cites":null},{"id":37925190,"title":"Neural Networks based System for Rotating Machinery.","authors":[],"date":"1993","doi":null,"raw":"Javed, M. & Littlefair, G. (1993). Neural Networks based System for Rotating Machinery. Proceedings of COMADEM 1993. University of West of England, Bristol. 418-23. ISBN 1 – 871056 – 72 - 1","cites":null},{"id":37925161,"title":"New acoustic emission source locating system for the study of rolling contact fatigue,","authors":[],"date":null,"doi":"10.1016\/0043-1648(82)90314-3","raw":"Yoshioka T, Fujiwara T. New acoustic emission source locating system for the study of rolling contact fatigue, Wear, 81(1), 183-186.","cites":null},{"id":37925153,"title":"Non-destructive testing handbook, Volume 5 – Acoustic Emissions. (Published by the","authors":[],"date":null,"doi":null,"raw":"Non-destructive testing handbook, Volume 5 – Acoustic Emissions. (Published by the American Society of Non-destructive testing) ISBN 0-","cites":null},{"id":37925238,"title":"Observation of Acoustic Emission Activity During Gear Defect Diagnosis.","authors":[],"date":null,"doi":"10.1016\/s0963-8695(03)00063-x","raw":"Toutountzakis, T. and Mba, D. Observation of Acoustic Emission Activity During Gear Defect Diagnosis. NDT and E International. 36(7). 471-477.","cites":null},{"id":37925230,"title":"On the comparison of the use of AE and vibration analysis for early gear fault detection.","authors":[],"date":"2003","doi":null,"raw":"Raad, A., Zhang, F., Randall, B. and Sidahmed, M. On the comparison of the use of AE and vibration analysis for early gear fault detection. The 8 th Western Pacific Acoustics Conference. Melbourne, Australia. 7-9 April 2003.   51","cites":null},{"id":37925249,"title":"Opportunities offered by acoustic emission (AE) for prognosis of spur gears,","authors":[],"date":"2004","doi":null,"raw":"Tan, C. K., Phil Irving and David Mba, Opportunities offered by acoustic emission (AE) for prognosis of spur gears, Proceedings of the 17 th International congress on Condition Monitoring and Diagnostic Engineering management, COMADEM, p 152-163, Aug 2004. ISBN 0-954 1307-1-5.","cites":null},{"id":37925151,"title":"Physical theory and application,","authors":[],"date":"1967","doi":"10.1007\/978-1-4899-5681-1_1","raw":"Viktorov. I. A., Rayleigh and Lamb Waves; Physical theory and application, Plenum press, New York,, USA. 1967.   43","cites":null},{"id":37925262,"title":"Pressure pulsations in centrifugal pumps,","authors":[],"date":null,"doi":"10.1115\/1.2930257","raw":"Guelich, J. F and Bolleter, U., Pressure pulsations in centrifugal pumps, Journal of Vibration and Acoustics, Transactions of  the ASME, Vol. 114, p","cites":null},{"id":37925248,"title":"Prognostic potential of the Acoustic Emission technique for spur gears, ‘Essential technologies for successful prognostics’,","authors":[],"date":null,"doi":null,"raw":"Tan, C.K., P. Irving and D. Mba, Prognostic potential of the Acoustic Emission technique for spur gears, ‘Essential technologies for successful prognostics’, Proceedings of the 59 th Meeting of the Society for Machinery Failure Prevention Technology (MFPT), Virginia Beach, Virginia, USA, April","cites":null},{"id":37925185,"title":"Quality inspection of rolling element bearing using acoustic emission technique,","authors":[],"date":null,"doi":"10.1016\/0963-8695(94)90527-4","raw":"Vibha Bansal, Gupta, B.C, Arun Prakash, Eshwar, V. A, Quality inspection of rolling element bearing using acoustic emission technique,","cites":null},{"id":37925334,"title":"Recent developments in monitoring of engines using acoustic emission,","authors":[],"date":null,"doi":"10.1243\/030932405x7647","raw":"Steel, J.A. Reuben, R.L., Recent developments in monitoring of engines using acoustic emission, Journal of Strain Analysis for Engineering Design, 40(1),","cites":null},{"id":37925200,"title":"Required vibration analysis techniques and instrumentation on low speed machines ( particularly 30 to 300 RPM machinery ), Technical Associates of Charlotte Inc.,Advanced Vibration Diagnostic and Reduction Techniques.","authors":[],"date":"1992","doi":null,"raw":"Berry, J. E., 1992  Required vibration analysis techniques and instrumentation on low speed machines ( particularly 30 to 300 RPM machinery ), Technical Associates of Charlotte Inc.,Advanced Vibration Diagnostic and Reduction Techniques.","cites":null},{"id":37925207,"title":"Review of bearing monitoring – Application of Acoustic Emission, 1 st International conference on Acoustic Emission in Manufacturing; Edited by Vahaviolos,","authors":[],"date":"1991","doi":null,"raw":"Tavakoli, M. S., Review of bearing monitoring – Application of Acoustic Emission, 1 st International conference on Acoustic Emission in Manufacturing; Edited by Vahaviolos, S. J., 16 – 19 Sept, 1991, Boston, Massachusetts, USA.","cites":null},{"id":37925220,"title":"Rolling element bearing diagnosis in run-to-failure lifetime testing.","authors":[],"date":"2001","doi":"10.1006\/mssp.2001.1418","raw":"Willaims, T., Ribadeneira, X., Billington, S. and Kurfess, T., Rolling element bearing diagnosis in run-to-failure lifetime testing. Mechanical Systems and Signal Processing, Vol 15, no. 5, 2001, 979-993.","cites":null},{"id":37925181,"title":"Rolling Element bearing fatigue damage propagation,","authors":[],"date":"1992","doi":"10.1115\/1.2920891","raw":"Hoeprich, M. R., Rolling Element bearing fatigue damage propagation, Transactions of ASME, Journal of Tribology, Vol. 114, April 1992, 328-333.","cites":null},{"id":37925213,"title":"Rotating machinery diagnosis with acoustic emission techniques, Electrical engineering in Japan,","authors":[],"date":"1990","doi":"10.1002\/eej.4391100211","raw":"Sato, I. Rotating machinery diagnosis with acoustic emission techniques, Electrical engineering in Japan, 1990; 10(2):115-127.","cites":null},{"id":37925257,"title":"Scaling of Non-Cavitating and Cavitating Pump Noise Acoustic for Pumps,","authors":[],"date":"1978","doi":null,"raw":"McNulty P.J, W M Deeprose, Scaling of Non-Cavitating and Cavitating Pump Noise Acoustic for Pumps, 1978. Risley, UK. paper 3, 1-17. ISBN 10185621","cites":null},{"id":37925322,"title":"Sikorska and M.Hodkiewicz, Comparison of acoustic emission, vibration and dynamic pressure measurements for detecting change in flow conditions on a centrifugal pump.","authors":[],"date":null,"doi":null,"raw":"J. Z. Sikorska and M.Hodkiewicz, Comparison of acoustic emission, vibration and dynamic pressure measurements for detecting change in flow conditions on a centrifugal pump. 18 th  International Congress and Exhibition on Condition Monitoring and Diagnostic Engineering Management (COMADEM","cites":null},{"id":37925343,"title":"Simplifying the Condition Monitoring of Machines & Structures using Acoustic Emission.","authors":[],"date":"2002","doi":null,"raw":"Holroyd, T.J. (2002). Simplifying the Condition Monitoring of Machines & Structures using Acoustic Emission. Proceedings of COMADEM 2002. COMADEM International, Birmingham. 180-188. 0 – 9541307 – 0 – 7.","cites":null},{"id":37925192,"title":"Test Equipment & Diagnostic System for Determining Lubrication Condition & Running Clearance of Rolling Bearings.","authors":[],"date":"2002","doi":null,"raw":"Parikka, R., Vidqvist, V., Vaajoensuu, E. & Tervo, J. (2002). Test Equipment & Diagnostic System for Determining Lubrication Condition & Running Clearance of Rolling Bearings. Proceedings of COMADEM 2002. COMADEM International, Birmingham. 153-162. ISBN 0 – 9541307 – 0 - 7","cites":null},{"id":37925159,"title":"The application of vibration analysis and acoustic emission source location to on-line condition monitoring of anti-friction bearings. Tribology International,","authors":[],"date":"1979","doi":"10.1016\/0301-679x(79)90001-x","raw":"Rogers, L. M., The application of vibration analysis and acoustic emission source location to on-line condition monitoring of anti-friction bearings. Tribology International, 1979; 51-59.","cites":null},{"id":37925157,"title":"The detection of incipient failure in bearings,","authors":[],"date":"1969","doi":null,"raw":"Balerston, H. L., The detection of incipient failure in bearings, Materials Evaluation, Vol 27, 121-128, 1969.","cites":null},{"id":37925202,"title":"The development of a data collector for low-speed machinery.","authors":[],"date":"1992","doi":"10.1007\/978-94-011-1616-9_23","raw":"Murphy, T.J., 1992 The development of a data collector for low-speed machinery. 4th international Conference on Profitable Condition Monitoring, bH r Group Ltd., pp 251-258, 8-10 Dec., Stratford-upon-Avon, UK.","cites":null},{"id":37925333,"title":"The development of automated pattern recognition and statistical feature isolation techniques for the diagnosis of reciprocating machinery faults using acoustic emission,","authors":[],"date":"2003","doi":"10.1006\/mssp.2002.1473","raw":"El-Ghamry, M.H., Reuben, R.L.; Steel, J.A., The development of automated pattern recognition and statistical feature isolation techniques for the diagnosis of reciprocating machinery faults using acoustic emission, Mechanical Systems and Signal Processing, 17(4), 2003, 805-823.","cites":null},{"id":37925191,"title":"The Relative Merits of Acoustic Emission & Acceleration Monitoring for the Detection of Bearing Defects.","authors":[],"date":"1998","doi":null,"raw":"Neill, G.D., Benzie, S., Gill, J.D., Sandford, P.M., Brown, E.R., Steel, J.A. & Reuben, R.L. (1998). The Relative Merits of Acoustic Emission & Acceleration Monitoring for the Detection of Bearing Defects. Proceedings of COMADEM 1998.Monash University, Australia. 651-659.   47","cites":null},{"id":37925252,"title":"The source of Acoustic Emission during meshing of spur gears,","authors":[],"date":"2004","doi":"10.1007\/s11249-005-7793-1","raw":"Tan, C. K and Mba, D, The source of Acoustic Emission during meshing of spur gears, The 26 th European conference on Acoustic Emission testing, EWGAE, Sept 15 – 17, 2004, p 559-565. ISBN 3-931381-58-7   53","cites":null},{"id":37925273,"title":"The use of Acoustic Emission for condition monitoring in high-pressure hydraulic pumps, paper","authors":[],"date":"1991","doi":"10.1016\/0963-8695(94)90462-6","raw":"Darling, J. and Johnston, D. N, The use of Acoustic Emission for condition monitoring in high-pressure hydraulic pumps, paper C414\/011, EUROTECH Direct 91, IMechE, 2-4 July, 1991, Birmingham, UK. P 137-143.","cites":null},{"id":37925189,"title":"The Use of Stress Wave Sensors for the Diagnosis of Bearing Faults.","authors":[],"date":"1990","doi":"10.1007\/978-94-009-0431-6_4","raw":"Badi, M.N.M., Johnson, D.E. & Trmal, G.J. (1990). The Use of Stress Wave Sensors for the Diagnosis of Bearing Faults. Proceedings of COMADEM","cites":null},{"id":37925155,"title":"The Use of ultrasonic diagnostic technique to detect rolling element bearing defects. Proceeding of Machinery and Vibration Monitoring and Analysis Meeting, Vibration Institute,","authors":[],"date":"1983","doi":null,"raw":"Catlin Jr., J.B. The Use of ultrasonic diagnostic technique to detect rolling element bearing defects. Proceeding of Machinery and Vibration Monitoring and Analysis Meeting, Vibration Institute, USA, April 1983,","cites":null},{"id":37925167,"title":"Use of Acoustic Emission for Machine Condition Monitoring,","authors":[],"date":"1993","doi":"10.1016\/0963-8695(94)90465-0","raw":"Holroyd, T.J. and Randall, N., (1993), Use of Acoustic Emission for Machine Condition Monitoring, British Journal of Non-Destructive Testing, 1993,","cites":null},{"id":37925173,"title":"Use of acoustic emission to identify damage modes in glass fibre reinforced polyester.","authors":[],"date":"2002","doi":"10.1016\/s0266-3538(02)00087-8","raw":"Huguet, S, Godin, N, Gaertner, R, Salmon, L, Villard, D. Use of acoustic emission to identify damage modes in glass fibre reinforced polyester. Composites Science and Technology, 2002, 62, 1433-1444.","cites":null},{"id":37925201,"title":"Vibration measurements on slow speed machinery.","authors":[],"date":"1995","doi":null,"raw":"Canada, R.G., and Robinson, J.C., 1995 Vibration measurements on slow speed machinery. Predictive Maintenance Technology National Conference (P\/PM Technology), pp 33-37, Vol. 8, no. 6. Indianapolis, Indiana.","cites":null},{"id":37925206,"title":"Vibration monitoring of bearings at low speeds, Tribiology International,","authors":[],"date":"1982","doi":"10.1016\/0301-679x(82)90130-x","raw":"Smith, J.D. 1982 Vibration monitoring of bearings at low speeds, Tribiology International, pp 139-144.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2006-01-01T00:00:00Z","abstract":"One of the earliest documented applications of Acoustic Emission Technology\n(AET) to rotating machinery monitoring was in the late 1960s. Since then there\nhas been an explosion in research and application based studies covering\nbearings, pumps, gearboxes, engines and rotating structures. This paper presents\na comprehensive and critical review to date on the application of Acoustic\nEmission Technology to condition monitoring and diagnostics of rotating\nmachinery","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/141058.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1177\/0583102405059054","pdfHashValue":"e7cc4a30bfcddcd1cfb288be152b13392f95c676","publisher":"Vibration Institute","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1029<\/identifier><datestamp>2014-02-18T15:02:54Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Development of Acoustic Emission Technology for Condition Monitoring and\nDiagnosis of Rotating Machines; Bearings, Pumps, Gearboxes, Engines and Rotating\nStructures.<\/dc:title><dc:creator>Mba, David<\/dc:creator><dc:creator>Rao, Raj B. K. N.<\/dc:creator><dc:description>One of the earliest documented applications of Acoustic Emission Technology\n(AET) to rotating machinery monitoring was in the late 1960s. Since then there\nhas been an explosion in research and application based studies covering\nbearings, pumps, gearboxes, engines and rotating structures. This paper presents\na comprehensive and critical review to date on the application of Acoustic\nEmission Technology to condition monitoring and diagnostics of rotating\nmachinery.<\/dc:description><dc:publisher>Vibration Institute<\/dc:publisher><dc:date>2011-11-28T23:06:47Z<\/dc:date><dc:date>2011-11-28T23:06:47Z<\/dc:date><dc:date>2006-01-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Mba, D., Rao, Raj B. K. N. Development of Acoustic Emission Technology for\nCondition Monitoring and Diagnosis of Rotating Machines: Bearings, Pumps,\nGearboxes, Engines, and Rotating Structures. The Shock and Vibration Digest,\n2006, Vol 38(1), pp3-16<\/dc:identifier><dc:identifier>0583-1024<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1177\/0583102405059054<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1029<\/dc:identifier><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0583-1024","issn:0583-1024"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":[],"subject":["Article"],"fullText":" 1\nDevelopment of Acoustic Emission Technology for Condition \nMonitoring and Diagnosis of Rotating Machines; Bearings, Pumps, \nGearboxes, Engines and Rotating Structures \n \nD. Mba1 & Raj B.K.N. Rao2 \n1School of Engineering, Cranfield University, UK \n2COMADEM International, UK \nAbstract \nOne of the earliest documented applications of Acoustic Emission Technology (AET) \nto rotating machinery monitoring was in the late 1960s. Since then there has been an \nexplosion in research and application based studies covering bearings, pumps, \ngearboxes, engines and rotating structures. This paper presents a comprehensive and \ncritical review to date on the application of Acoustic Emission Technology to \ncondition monitoring and diagnostics of rotating machinery. \n \nKeywords: Acoustic Emission, condition monitoring, machine diagnosis, rotating \nmachines. \n \n1. Introduction \n \nAcoustic emissions (AE) are defined as transient elastic waves generated from a rapid \nrelease of strain energy caused by a deformation or damage within or on the surface \nof a material [1, 2, 3]. In the application to rotating machinery monitoring, AE are \ndefined as transient elastic waves generated by the interaction of two media in relative \n 2\nmotion. Sources of AE in rotating machinery include impacting, cyclic fatigue, \nfriction, turbulence, material loss, cavitation, leakage, etc. For instance, the interaction \nof surface asperities and impingement of the bearing rollers over a defect on an outer \nrace will result in the generation of acoustic emission. These emissions propagate on \nthe surface of the material as Rayleigh waves and the displacement of these waves is \nmeasured with an AE sensor. Rayleigh waves are a combination of longitudinal and \ntransverse waves [4]. It should be noted that surface defects such as cracks and \nscratches attenuate rayleigh waves, in addition, the surface finish of metals can also \ninfluence attenuation [4]. \n \nJudicious application of well-tried and tested acoustic emission technology can \nprovide powerful diagnostic capabilities, which are safe, efficient and cost-effective. \nThis paper reviews the research and development activities that are being pursued in \nthe following subject areas; bearings (roller and hydrodynamic), gearboxes, pumps, \nmachinery and mechanical seals. \n \nAcoustic emission (AE) was originally developed for non-destructive testing of static \nstructures, however, over the last 35 years its application has been extended to health \nmonitoring of rotating machines, including bearings, gearboxes, pumps, etc. It offers \nthe advantage of earlier defect\/failure detection in comparison to vibration analysis \ndue to the increased sensitivity offered by AE. However, limitations in the successful \napplication of AE technique for monitoring the performance of a wide range of \nrotating machinery have been partly due to the difficulty in processing, interpreting \nand classifying the intelligent information from the acquired data. The main drawback \nwith the application of the AE technique is the attenuation of the signal and as such \n 3\nthe AE sensor has to be close to its source. However, it is often practical to place the \nAE sensor on the non-rotating member of the machine, such as the bearing or gear \ncasing. Therefore, the AE signal originating from the defective component will suffer \nsevere attenuation, and reflections, before reaching the sensor. \n \nAE covers a wide frequency range (100 kHz to 1MHz) and time domain waveforms \nassociated with AE are of two types; burst and continuous. A continuous type AE \nrefers to a waveform where transient bursts are not discernible [5]. Both waveform \ntypes are associated with rotating machinery, for instance, a continuous type emission \nmay be as a result of turbulent fluid flow within a peep while a burst type could be \nassociated with transient rolling action of meshing bears. On rotating machinery \ntypical background operational noise is of a continuous type. Traditionally the most \ncommonly measured AE parameters for diagnosis are amplitude, r.m.s, energy, \nkurtosis, crest factor, counts and events [3]. Observations of the frequency spectrum, \nwhilst informative for traditional non-destructive evaluation, have only found limited \nsuccess in machinery monitoring. This is primarily due to the broad frequencies \nassociated with the sources of generation of AE in rotating machinery. For example, \nthe transient impulse associated with the breakage of contacting surface asperities \nexperiencing relative motion will excite a broad frequency range. \n \n \n2. Acoustic Emission and bearing defect diagnosis \n \nFrom the moment bearings leave the factory, they encounter many harsh \nenvironmental hazards, which in turn induce a number of failure modes. It is well \n 4\nknown how these failure modes reduce the life expectancy of the bearings. Some of \nthe events responsible for the bearing failures include; incorrect applications, poor \nmaintenance, poor lubrication, overload, over-speed, misalignment, imbalance, harsh \nenvironmental conditions (temp\/humidity\/dust\/dirt\/altitude), etc. Bearing failure \nmodes include; friction\/wear processes producing flaking, brinelling, fluting, spalling, \npitting, seizure, etc. All these modes are known sources of AE. However, the most \nwidely employed technique for condition monitoring and diagnostics of bearings is \nvibration monitoring. This method has been successful where the energy from other \ncomponents (shaft, gears, etc) does not overwhelm the lower energy content from the \ndefect bearing. In addition, by the time a significant change in vibration has been \nobserved the remaining operational or useful life of the bearing is very short. This is \nwhere the AE technology offers a significant advantage. The formation of subsurface \ncracks due to the Hertzian contact stress induced by the rolling action of the bearing \nelements in contact with the inner and outer races, and, the rubbing between damaged \nmating surfaces within the bearing will generate acoustic emission activity. Other \nreasons for the generation of AE include the breakdown of the oil film, foreign matter \nin the lubricating medium and excessive temperatures. It must be noted that the \npropagation of the acoustic emission is affected by material microstructure, non-\nhomogeneities, geometrical arrangement of free surfaces, loading conditions and \nnumber of component interfaces. Almost all research on the application of AE to \nbearing defect analysis has been undertaken on experimental test-rigs   specifically \ndesigned to reduce AE background noise.  \n \nCatlin [6] reported AE activity from bearing defects were attributed to four main \nfactors including numerous transient and random AE signals associated with bearing \n 5\ndefects. Furthermore, it was stated that the signals detected in the AE frequency range \nrepresented bearing defects rather than other defects such as imbalance, misalignment, \nlooseness, shaft bending as well as the other major structural component resonance’s. \nIn addition, Catlin noted that high frequency AE signatures attenuate rapidly; \ntherefore, if the transducer was placed close to the bearing, it was possible to detect \nthe high frequency content induced mainly by the bearing fault since signatures \noriginating from other machine components are highly attenuated upon reaching the \nsensor. Balerston [7] published the first document that applied the AE technology to \nidentification of artificially seeded defects in rolling element bearings. Interestingly \nthis is probably one of the earliest applications of AE to monitoring bearings. Defect \nsimulated included outer and inner race defects, ball defects and lack of lubrication. \nBalerston compared vibrations in the audible range, resonant range and AE, \ncommenting on the advantages that monitoring of the resonant frequency range \noffered over the audible vibration range. The resonant technique involved \nmeasurement of bearing component natural frequencies initiated by shock excitation \nassociated with minor structural irregularities. These resonant frequencies are a \nfunction of the mass configuration and type of material involved. The frequencies and \namplitudes at resonance are much higher than bearing element rotations, so they are \nideal under conditions of high background noise. Moreover, the resonant frequencies \nare independent of rotational speed, however, their amplitudes will vary directly with \nrotational speed, as will the impact energy. Resonant frequencies can be as high as \n300 kHz for ball rollers, and up to 140 kHz for the inner race, depending on the mode \nof vibration [7]. Balderstone suggested that the 'free' resonant frequencies of the \nindividual components were not changed significantly after assembly, though, the \nassembly created a damping effect. Furthermore, it was suggested that because of the \n 6\ninteraction between the components of a bearing, a defect in any component would \ncause resonant frequency ringing in all components, making interpretation difficult. \nMoreover, at low rotational speeds the impact energy generated will be very low and \nthis might explain why there have been limited applications of this technique to low-\nspeed bearings. The principal of the shock pulse meter (SPM) is similar to the \nresonant technique as both respond to minute transient pressure waves generated from \nfault impacts in regions of contact, however, the SPM resonates itself.  \n \nBalerston noted that two types of AE signatures were observed during experimental \ntesting; burst type emissions associated with the seeded defects on the inner, outer \nrace and ball element. Continuous type AE signatures were noted when the bearing \nwas run dry (starved of lubrication). In one particular bearing defect simulations (dry \nrun) AE counts were noted to increase prior to bearing failure. In summary Balerston \nstated that the resonant frequency technique was very successful and it offered a \ndirect correlation between defect severity and increase in amplitude level of the \nresonant frequencies, though it was concluded the AE technique would become \nimportant with development of sensors. This was the earliest assessment on the \napplication of AE to bearing monitoring. \n \nAbout 10 years after Balerston, Rogers [8] utilised the AE technique for monitoring \nslow rotating anti-friction slew bearings on cranes employed for gas production and \nobtained some encouraging results compared to vibration monitoring techniques. \nRubbing of the crack faces, grinding of the metal fragments in the bearing and \nimpacts between the rolling elements and the damaged parts in the loaded zone were \nidentified as sources of detectable AE signatures. Roger stated \"because of the slow \n 7\nrotational speed of the crane, application of conventional vibration analysis (0-\n20KHz) was of limited value for on-line condition monitoring\". AE resonant \ntransducers between 100 kHz to 300 kHz were found to be informative for on-line \nmonitoring of bearings using kurtosis at different frequency bands.  \n \nYoshioka and Fujiwara [9, 10] have shown that AE parameters identified bearing \ndefects before they appeared in the vibration acceleration range. In addition, sources \nof AE generation were identified during fatigue life tests on thrust loaded ball \nbearings. Hawman and Galinaitis [11] reinforced Yoshioka’s observation that AE \nprovided earlier detection of bearing faults than vibration analysis and noted that \ndiagnosis of defect bearings was accomplished due to modulation of high frequency \nAE bursts at the outer race defect frequency. Hawman and Galinaitis placed the AE \nreceiving sensor directly onto the bearing outer race. The modulation of AE \nsignatures at bearing defect frequencies has also been observed by other researchers \n[12, 13]. In addition, Bagnoli et al [14] investigated demodulation of AE signatures at \nthe defect rotational frequency (outer race) of a bearing. It was noted that when the \ndefect was absent, the periodicity of the passage of the balls beneath the load could be \nreadily identified by observing the frequency spectrum of demodulated AE signatures, \nhowever, it was reported that the AE intensity was less without the defect present. \nThere was no mention of trigger levels employed, load applied on the test bearing, \nmethod of attaching the transducers to the rig nor any information on background \nnoise.  \n \nTandon and Nakra [15] investigated AE counts and peak amplitudes for an outer race \ndefect using a resonant type transducer. It was concluded that AE counts increased \n 8\nwith increasing load and rotational speed. However, it was observed that AE counts \ncould only be used for defect detection when the defect was less than 250µm in \ndiameter, though AE peak amplitude provided an indication of defects irrespective of \nthe defect size. Loads applied ranged from 8 to 50% of the bearing static load rating. \nChoudhary and Tandon [16] employed AE for bearing defect identification on various \nsized bearings and rotational speeds ranging from 500 to 1500rpm. It was observed \nthat AE counts were low for undamaged bearings. In addition, it was observed that \nAE counts increased with increasing speed for damaged and undamaged bearings \nwhilst an increase in load did not result in any significant changes in AE counts for \nboth damaged and undamaged bearings. \n \nTan [17] used a variation of the standard AE count parameter for diagnosis of \ndifferent sized ball bearings. In addition to the difficulty of selecting the most \nappropriate threshold level for standard AE counts, Tan cited a couple of other \ndrawbacks with the conventional AE count technique. This included dependence of \nthe count value on the signal frequency. Secondly, it was commented that the count \nrate was indirectly dependent upon the amplitude of the AE pulses. Tan’s variation to \nthe standard AE counts technique involved computing the accumulated area under the \namplitude-time curve of the AE waveform over a specified time period. This was \naccomplished by setting four trigger levels with amplitude multiples of 1, 2, 4 and 8, \nand calculating the area under the amplitude-time AE waveform. The final count \nassigned was weighted by the multiple of the amplitude ratio between these levels. It \nwas concluded that the ‘new’ count rates increased exponentially with increasing \ndefect sizes and increasing rotational speed. The dependence of AE counts on \nthreshold levels was also noted by Huguet et al [18] during investigations on the use \n 9\nof AE for identifying damage modes in specific materials, in this instance, a trigger \nlevel of 10% of the maximum amplitude was employed. \n \nYoshioka et al [19] undertook an investigation of vibration and AE on naturally \nfatigued deep groove ball bearings (bore diameter 20mm). By removing the groove on \nthe inner race Yoshioka claimed the stresses in the area of contact were increased and \nthis accelerated fatigue failure. Vibration r.m.s levels were recorded continuously \nthrough the fatigue tests which lasted approximately 130 hours. The presence of spalls \non the inner race resulted in a rapid increase in vibration r.m.s levels. However, AE \n(counts per minute) showed a steadily increasing value at least 5 hours before the \nobserved rapid increase in vibration. A total of sixteen fatigue tests were undertaken \nand the authors commented that they could predict the appearance of a spall by \nobserving the AE response. \n \nWhilst AE counts maybe highlight changes in machine state it will not be able to \nidentify the origins of defect, e.g., outer race. The successful use of AE counts for \nbearing diagnosis is dependent on the particular investigation, and, the method of \ndetermining the trigger level is at the discretion of the investigator. Moreover, it has \nbeen shown that AE counts are sensitive to the level and grade of lubricant within the \nbearing, adding to the complexity of this measure. Morhain and Mba [20] undertook \nan investigation to ascertain the most appropriate threshold level for AE count \ndiagnosis in rolling element bearings. Results showed values of AE maximum \namplitude did correlate with increasing speed but not with load and defect size. In \naddition, it has been shown that the relationship between bearing mechanical integrity \nand AE counts is independent of the chosen threshold level, although a threshold of at \n 10\nleast 30% of the maximum amplitude for the lowest speed and load operating \ncondition was advised. Furthermore Morhain and Mba commented that unlike the \nresults reported by Tandon and Nakra [15] it was observed that AE counts could be \nused for defect size detection for lengths of up to 15mm and widths of 1mm. In \naddition Morhain validated the observations of Choudhary and Tandon [16].  \n \nKakishima et al [21] undertook a comparative experimental study on the assessment \nof Acoustic Emission and vibration for monitoring\/detecting seeded defect \nsimulations on the inner race of a roller and ball bearing. Defects were seeded with an \nelectron discharge machine (EDM). Analysis of the AE was based on the spectrum of \nthe enveloped AE signals. It was concluded that the threshold at which the AE \ntechnique was able to identify the defect was similar to vibration monitoring. \nFurthermore, for both AE and vibration, it was noted that an increase in defect size \nresulted in an increase of both AE and vibration levels on the envelope spectrum. \nKaewkongka and Au [22] applied the AE technique on a rotor dynamic system onto \nwhich multiple defects were seeded, including a seeded defect on one of the bearings. \nIt was shown the AE technique offered high sensitivity thereby allowing for \ndiscrimination of the multiple defect conditions. Success was based on minimum \ndistance classifier. Schoess [23] presented results of an assessment of six different but \nrelevant technologies for onboard monitoring of a railcar bearing. It was concluded \nthat the AE technique offered the highest potential payoff. Schoess successfully \nevaluated the AE technique on an artificially damaged bearing on a railcar, \nconcluding that the AE technique offered potential for condition based maintenance in \nthe railroad industry. Price et al [24] assessed the vibration and AE techniques for \nmonitoring rolling element bearing failures. Prices’s experimental study focused on a \n 11\n4-ball machine from which AE activity, vibration, temperature, friction, etc were \nmonitored as a function of time. It was noted that AE could detect distress within the \ntest balls before the friction in the contact area increased noticeably. It was stated that \nincreasing damaging results in increasing friction at the contact area. \n \nShiroishi et al [25] compared vibration and AE on seeded defective bearings operating \nat 1200rpm. Interestingly, Shiroishi defined the industry bearing failure criteria as \nbeing reached when a defect size reached 6.45mm2; this value was cited from the \npublished article of Hoeprich [26]. Defects of varying sizes were seeded on the outer \nand inner races. Shiroishi noted that the vibration offered better detection than the AE \ntechnique, and that the AE sensor was insensitive to inner race defects. In addition, on \nthe parameters extracted from vibration and AE measurements, Shirosihi et al [25] \nnoted that the peak ratio was the most reliable indicator of the presence of a localised \ndefect with the r.m.s, kurtosis and crest factor showing decreasing reliability. The \nmost significant observation from Shiroishi’s investigation was the correlation \nbetween acceleration peak value and defect width. This correlation was first noted \nback in 1969 by Balerston [7] employing a monitoring system based on observations \nof bearing resonant frequencies. The most recent correlation between defect size and \nmeasuring parameter (AE) was noted by Al-Ghamdi et al [27,28]. A direct correlation \nbetween defect length (circumferential, along direction of rolling) and AE burst \nduration was observed under varying simulated defect cases. In addition, a correlation \nbetween the   amplitude of the burst type AE signature (associated with the bearing \ndefect) to the underlying continuous type emission was noted to increase with \nincreasing defect width (perpendicular to rolling direction). \n \n 12\nLi et al [29] undertook bearing fatigue failure tests at 1600rpm and 167% of the rated \nradial load. To accelerate failure an initial defect was seeded with an electric \ndischarge machine. Li commented that vibration and AE r.m.s increased with \nincreasing defect severity. An adaptive scheme was proposed to predict conditions of \ndefective bearings based on vibration and AE techniques. Vibha Bansal et al [30] \napplied AE as a quality control tool on reconditioned bearings. Bearings were tested \nat 3% of the load rating. It was noted that as the load increased there was little \nincrease in the peak-to-peak amplitude level for standard (operational) and \nreconditioned bearings, however, the peak values of the reconditioned bearing was in \nsome instances five-times that of a new bearing.  \n \nLi and Li [31] presented a pattern recognition technique for early detection of bearing \nfaults using AE. Faults were seeded on an outer race, a roller and multiple outer race \ndefects. It was noted that the occurrence of AE events at a rate equivalent to a bearing \ncharacteristic defect frequency was evidence of the presence of a localised defect. Li \net al presented such a case with the seeded outer race defect but no results on the \nroller defect were presented. This was rather disappointing as Li and Li are the only \ninvestigators to attempt to diagnose roller defects with AE. \n \nSundt [32] detailed two cases where high frequency AE was applied to bearing defect \ndetection. For the first case study high frequency signals associated with a hairline \ncrack in the outer race the defect frequency were detectable above 100 kHz. This \ndefect condition was not observed with vibration analysis. It was stated that the defect \nwas at an early stage of development and the bearing clearances had not deviated \nfrom the normal operating condition; explaining why vibration monitoring was \n 13\nunsuccessful in this particular study. The second case study should the ability of the \nAE technology to detect the presence of foreign matter (sand) in the bearings of a \npump unit. Sundt commented on the use of AE to defect defective bearings utilising \nrace resonance for amplification noting that this could enhance detection sensitivity. \nHowever, it was stated that the mechanical ‘Q’ (dynamic magnification factor) of the \nrace was an un-predictable function of the bearing type, housing constraint, etc. \nFurthermore, it was noted that race resonances could be excited by normal \nbackground noise. Also, similar readings could be obtained from a good bearing with \na high ‘Q’ and a bad bearing with a low ‘Q’. The difficulty with monitoring bearings \nat the element resonating range (20 – 100 kHz) was also discussed by Barclay and \nBannach [33]. It was noted that wavelengths of vibration at these frequencies are \noften comparable with the dimensions of parts in the bearing or bearing housing \nwhich may create standing waves with nodes and anti-nodes. The consequence of this \nmakes sensor position critical. Barclay and Bannach [33] presented the Spectral \nEmitted Energy (SEE) method which combined the high frequency AE detection \nwithin 250 – 350 kHz range with the enveloping technique. The source of AE activity \nwas attributed to the metal-to-metal contact as a result of lubricating film breakdown. \nIt was concluded that the SEE method was a viable technique for detecting rolling \nelement bearing defects and compliments the present-day low frequency vibration.  \n \nBadi et al [34] investigated the condition of automotive gearbox bearings using Stress \nwaves (also known as AE). These sensors were used on a bearing test rig with \nsimulated faults. All the artificially seeded faults were identified by employing the \nstress wave sensor method. The sensors were easy to install & needed simple signal \nprocessing to evaluate bearing faults. The only drawback was the sensors were bulky. \n 14\nSturm et at [35] employed AE to investigate damage processes (pitting and mixed \nfriction) of sliding and rolling element bearings under laboratory and field conditions. \nAnalysis revealed that the amplitude behavior observed from the envelope analysis of \nthe AE signals yielded essential information about the damage processes. Javed and \nLittlefair [36] presented some general aspects of the application of AE for detecting \nthe early development of failures in rolling element bearings. Some results of the \nexperimental investigation of the basic relationship between ball bearing failures and \nthe resulting change in AE signal were presented. Neill et al [37] described the \nrelative sensitivities of accelerometer and AE sensors to a range of defects and \nassessed their merits in an industrial environment, where ambient noise and\/or other \nfaults were highly influential. It was revealed that the AE signals preserve the \nimpulsive nature of defect-element interactions, yielding characteristic harmonics of \nthe defect frequencies in the spectrum. These harmonics distinguished bearing defects \nfrom other periodic faults induced by imbalance or misalignment occurring at the \nsame frequency. Also, Neill concluded that the AE sensors were more sensitive to \nsmall defects.  \n \nSalvan et al [38] adopted a triangulation technique by employing two AE sensors with \nfuzzy neural networks on a high-speed post office mail sorting machinery, which \ncontained a large number of bearings. The investigation was limited to the detection \nof a simpler source and the authors were unable to obtain precise location presumably \ndue to incorrect parameters in the sound velocity equation and the use of an inefficient \ntechnique. Parikka et al [39] reported their findings on the operation of paper \nmachines, which were equipped with a number of oil lubricated rolling bearings. They \nassessed information on the effects of higher or significantly lower than intended \n 15\nbearing loads on its service life, as the lubricant conditions or movement changes with \ntime. It was commented that the possibility of using AE for monitoring critical \noperating situations of rolling bearings was very promising. Based on this \ninvestigation, a window-based diagnostic system (prototype) was developed. Morhain \nand Mba [40] investigated the application of standard AE characteristic parameters on \nlightly radially loaded bearing. An experimental test rig was designed to allow seeded \ndefects on the inner\/outer races. The test rig also produced high background AE noise \nproviding a realistic test for fault diagnostics. It was concluded that irrespective of the \nhigh levels of background noise and low radial load (between 2 to 70% of the bearing \nrating), standard AE parameters provided adequate early indication of bearing defects. \nFan et al presented data streaming technology for non-interrupted acquisition of AE \nwaveforms. In addition, Fan re-iterated that modulation of the AE waveforms could \nidentify the defective part (race, roller) within the bearing. Holroyd [42] detailed \nlaboratory studies on rolling element bearings in which AE signals were processed in \nterms of their dynamic envelop (i.e, rectification and low pass filtering). Tests showed \nthat the periodicity of the enveloped signal corresponded to a bearing defect \nfrequency. A proprietary method of characterising the AE time waveform was \nproposed. Several successful applications of the proprietary method were also \npresented. \n \nFinley [43] developed an incipient failure detection ‘IFD’ system based on high \nfrequency AE’s generated from shock pulses as a rolling element (ball) passes a \ndefective race. A couple of industrial case studies were presented. Finley noted that \nthe AE technology has been proven to be more effective than conventional low \nfrequency sound and vibration measurements. \n 16\n \nJamaludin et al [44] presented research findings on the lubrication monitoring of the \nlow speed rolling element bearings (1rpm). A test rig was designed to simulate the \nreal bearing used in real-life situations. Using a newly developed method called Pulse \nInjection Technique (PIT) the variation of lubricant amount in the low-speed bearing \nwas successfully monitored. This technique was based on transmitting a Dirac pulse \nto the test bearing in operation via an AE sensor. The AE data was processed using a \nclustering technique based on AR coefficient to differentiate between properly and \npoorly lubricated bearings. The acoustic emission technique has also been employed \nby Miettinen et al [45, 46] and Holroyd [42] to monitor the lubricant condition in \nrolling element and plain bearings.  \n \nWhilst monitoring bearing degradation by AE and vibration analysis is relatively  \nestablished at speeds above 600 rpm, at low-rotation speeds there are numerous \ndifficulties with vibration monitoring which have been detailed [47, 48, 49, 50]. The \ndifficulty of monitoring at low rotational speeds was summarised by Kuboyama [51].  \n \nUnlike vibration monitoring there has been considerable success in the development \nand application of AE to monitoring slow speed bearings.  McFadden and Smith [52] \nexplored the use of acoustic emission transducers for the monitoring of rolling \nelement bearings at speeds varying from 10 to 1850 rpm. The sensors were placed on \nthe bearing housing. A fault, simulated by a fine scratch on the inner raceway, formed \nthe basis of this experiment. It was commented that the AE transducer, with a \nfrequency response beyond 300 kHz, failed to perform as expected at the higher end \nof the rotational speed range (850 rpm) and was inferior to the conventional high-\n 17\nfrequency accelerometer. However, at low rotational speeds (10 rpm) the AE \ntransducer appeared to respond to minute strains (local distortions) of the bearing \nhousing caused by the concentrated loading of each ball in the bearing.  These minute \nstrains appeared as spurious spikes superimposed on the ball pass frequency. It was \nconcluded that at low speeds with steady loads, base bending\/strain of the bearing \nhousing could enable the AE transducer to detect signatures from very small defects \nin rolling element bearings, while at higher speeds base bending appears as low \nfrequency noise. \n \nSmith [53] was involved in the experiment mentioned above and in a separate paper \nreiterated McFadden’s [52] findings though puzzled at the behaviour of the AE sensor \nused, stating \" the form of response of the AE sensor was puzzling since the \ntransducer was responding to once-per-ball distorting in the casing at frequencies as \nlow as 1Hz. AE transducers are not supposed to respond to frequencies as low as \nthese\". \n \nTavakoli [54] investigated the application of AE to needle bearings. Interestingly the \nrotational speed for this investigation was 80rpm which some might classify as a low \nspeed application. Three simulations were undertaken; defect free fully lubricated, \ndefect free un-lubricated and a condition in which two adjacent needle elements \n(rollers) were missing.  The frequency domain characteristics of the AE r.m.s voltage \nwere examined in relation to the simulated conditions. It was shown that the mean \nspectral density function of the r.m.s voltage distinguished all three simulations. It \nwas also noted that the source of AE in bearings was attributed to friction and \nimpacting. \n 18\n \nHolroyd [55] described in this application note the results of AE measurements on \nfour heavily loaded roller bearings rotating at 60 rpm. The operation of these bearings \nin the slowly rotating machine was critical indeed. This case study clearly \ndemonstrated the ability of this innovative and profitable technology to prevent \nsecondary damage and to minimise production loss due to machine failures.  \nMiettinen et al [56] described the use of the AE method in monitoring of faults in an \nextremely slowly rotating rolling bearing, whose rotational speed varied from 0.5 to 5 \nrpm. This investigation revealed that the AE measurement was very sensitive and the \nfault was easily identified under laboratory conditions. Jamaludin et al [57] reported \nthe results of an investigation into the applicability of AE for detecting early stages of \nbearing damage at a rotational speed of 1.12rpm. A bearing test rig was used with \nseeded localised surface defects induced by spark erosion on the inner\/outer races and \non a roller element (which resembled pitting). The paper concluded that AE \nparameters such as, amplitude and energy provided valuable information on the \ncondition of a particular low-speed rotating bearing. \n \nSato [58] investigated the use of AE to monitor low-speed bearing damage by \nsimulating metal wipe in journal bearings at 5.5 rpm. It was observed that acoustic \nbursts were generated as a result of slight metallic contact and the amplitude of the \nwaveform became larger with increasing metal wear. Sturm and Uhlemann [59] also \ninvestigated the application of AE to plain bearings, noting the instantaneous response \nof AE to the changes in the frictional state of hydrodynamic fluid film. \n \n 19\nWilliams et al [60] noted that the majority of bearing diagnosis experiments were \nundertaken with seeded defects and as such undertook bearing experiments without \nseeded defects; in essence fatigue tests. The test bearings, roller and ball, were run at \n6000rpm at 67% of the dynamic rated load, though some tests were undertaken at \nvarying speed conditions. Vibration and AE techniques were compared and in one \nparticular instance Williams stated that the AE sensor showed an increase 10 minutes \nafter an increase in vibration. It was also noted that the AE sensor was unresponsive \nto outer race failures. This is rather surprising considering the number of publications \nconfirming the ability of the AE technique to diagnose outer race defects.  \n \nThe development of AE in bearing monitoring and fault diagnosis is the most \nestablished application of AE in rotating machinery and this is reflected in the number \nof commercially available systems in the market today. Needless to say, more detailed \ninvestigations are still required and there are opportunities for applying the AE \ntechnology for prognosis. \n \n3. Application of Acoustic Emission to monitoring gearboxes \n \nWhilst vibration analysis on gear fault diagnosis is well established, the application of \nAE to this field is still in its infancy. In addition, there   are limited publications on \napplication of AE to gear fault diagnosis. Irrespective of the numerous publications on \nthe application of vibration analysis to monitoring gearboxes it still meets with great \nchallenges that monitoring and diagnosis of gearboxes present. The AE technology \noffers a complimentary tool in this instance. \n \n 20\nMiyachika et al [61] presented a study on AE in bending fatigue test of spur gear teeth. \nThree different gears with common module, pressure angle and number of teeth were \nused. Two of the gears were case hardened to different case depths. These gears were \nmade from SC415 steel with a face width of 10 mm whilst the second gear (face \nwidth of 8 mm) was made from S45C steel without any case hardening. An AE sensor \nwas fixed on the gear with a clamp arrangement. AE measurements such as frequency \nspectra, cumulative event count, event count rate and peak amplitude were recorded \nduring the fatigue process under different tooth load conditions. In addition, crack \nlength measurements were made. However, the type and characteristics of the sensor, \nthe sampling rate employed and the loading frequency were not presented in this \npaper. During the fatigue test, it was observed that there was marked increase in AE \ncumulative event count and event count rate just before crack initiation for both case \nhardened gears. For the normalized gear, such an observation was not noted. It was \nalso found that as the tooth load decreased, the number of cycles until the marked \ncumulative event count occurred increased. Miyachika drew the conclusion that the \nprediction of crack initiation using AE technique was possible for case hardened gear \nbut difficult in the case of normalised gear. \n \nMiyachika et al [62] extended their investigations to super-carburised gear material. \nThe investigation was performed under the same test set and procedures as detailed \nabove, with additional analysis techniques; AE cumulative energy count and wavelet \ntransforms of AE signals. From the results, Miyachika concluded the prediction of \ncrack initiation by means of AE method was possible for the various carburised gears \ntested. \n \n 21\nWheitner et al [63] performed a series of gear tooth bending fatigue tests to verify the \neffectiveness of AE and system stiffness measurements for monitoring the crack \ninitiation and propagation. The tests and instrumentation employed were to standards \ndetailed in the Society of Automotive Engineers (SAE) gear geometry, testing \nprocedure and fatigue test fixture. The AE senor had a resonant frequency of 300 kHz \nwas attached to the gear at the root of the tooth with super glue. The tooth stiffness \nmeasurements were done through an accelerometer mounted to the base of the fixture. \nThe test gears were of various materials, surface finishes and surface treatments. All \nthe testing was performed by applying sinusoidal load of 10 Hz and load ratio of 0.1. \nA run-out life of 106 cycles was employed for all the test cases. Wheitner noticed non-\nzero AE counts before the initiation point of the gear tooth root fatigue crack which \nwas attributed to the background noise of the test machine. In general, AE activity \nincreased with crack propagation and very rapidly at the failure point. All the test \ngears exhibited similar trends in stiffness measurements. At high load and low fatigue \nlives, crack propagation life contributed a significant proportion of the gear total life \nas compared to crack initiation life. Wheitner went further to conclude that both the \nAE and system stiffness measurements were effective in monitoring the cracking \nprocesses of the gear tooth. However, in most cases, AE activity was detected before \nthe first change in stiffness compliance was registered.  \n \nSingh et al [64] explored an alternative AE technique to the more widely used \nvibration and debris monitoring methods for detection of gear tooth crack growth. He \nemployed a single tooth bending machine with the load on the tooth varied \nsinusoidally at 40Hz frequency. An AE sensor and accelerometer were mounted on a \nspur gear near to the loading tooth. The test terminated when the loaded tooth broke-\n 22\noff. Raw AE waveforms and fatigue cycles were recorded during the test. There was \nno information given on the type of gear, sensors, the applied load and the sampling \nrate used. The test revealed that AE detected the first sign of failure when the gear \nreached 90% of its final life. As the crack progressed, AE amplitude increased. \nDuring the final stage of gear tooth fracture, a significantly high amplitude AE burst \nwas detected. On the other hand, the vibration level did not change significantly in the \ninitial stage of crack initiation and propagation until the final stage of failure. Hence, \nSingh concluded that AE method offered an advantage over vibration monitoring \ntechniques. \n \nIn order to study the practical aspects of sensor placement in a real life gearbox \nsituation, Singh et al [64] performed an assessment of the transmissibility of an AE \nsignal within a gearbox. The tests were performed with different torque levels using \nlead pencil breaks to simulate AE activity in the gearbox. This technique is known as \nthe Nielsen source test. Firstly, various individual interfaces with varying torques \nwere studied and quantified. Following that, Singh evaluated the total loss of strength \nof the AE signal across multiple interfaces and compared with the sum of losses \nobtained from individual interfaces. Several AE transmission paths were examined. \nFrom the results obtained, Singh et al concluded that the attenuation across the \ngearbox was an accumulation of losses across each individual interface within the \ntransmission path and the optimum path of propagation will be the one with the \nsmallest cumulative loss. \n \nThe investigations detailed earlier [61 to 64] have indicated that AE technique was \nable to detect bending fatigue failure. In addition, the AE technique was capable of \n 23\ndetecting the fault condition in advance of the vibration monitoring technique. This \nconclusion is encouraging and motivating for AE technique to be the new condition \nmonitoring tool. However, to ensure that this technique is robust, the defect detection \ncapability on the other modes of gear failure; surface damage and fatigue, has to be \nexplored. \n \nSiores and Negro [65] explored several AE analysis techniques to correlate possible \nfailure modes of a gearbox during its useful life through. The gearbox employed for \nthe failure interrogation includes two gear sets (input and output), a DC shunt motor \nand a variable speed controller to alter the motor speed for the tests. The AE sensor \nemployed was mounted on the gearbox casing and has a resonant frequency of 175 \nkHz. Prior to the start of the test, the gearbox was allowed to wear-in at 1200 rpm for \nfour one-hour intervals at full load condition. Common gear failures such as excessive \nbacklash, shaft misalignment, tooth breakage, scuffing and worn teeth were seeded on \nthe test gears. All the seeded defect conditions were tested at 300 and 600 rpm whilst \nAE parameters such as r.m.s, standard deviation and duration of AE were measured. \nSiores and Negro concluded that the monitored AE parameters exhibit identifying \nqualities for the respective failure modes. \n \nSingh et al [66] performed two experiments to study the feasibility of applying AE to \ndetect gear pitting. Both simulated and natural pits were used to evaluate this \ndetection technique. The first experiment employed an UH1H generator drive offset \nquill which consisted of the driver, driven and idler gears. In this experiment, the idler \ngear contains the simulated pit of width and depth of 1.25 mm. This pit was simulated \nby removing a thin strip of material from the pitch-line on one of the tooth of the idler \n 24\ngear by Electrical Discharge Machining (EDM) process. A resonant type AE sensor \nwith a resonant frequency 280kHz and an accelerometer were mounted on the \ngearbox housing near the output shaft bearing. A tachometer was used as a trigger to \nensure each cycle of the measurements started with the same idler tooth in contact. \nThe test gearbox was first run with no pit on the idler gear and then replaced by the \nidler gear with simulated pits. AE and vibration data were recorded during the run. \nThis procedure was repeated for several combinations of load and speed. From the \ntest results, Singh concluded that both detection techniques were able to pick up the \nsimulated defect but AE technique exhibited much greater signal to noise ratio (SNR). \nHe also suggested that both detection techniques were unable to detect the simulated \npit at extremely high speeds or unloaded conditions as the noise level increases whilst \nthe amplitude of the defect signal arising from contact of the pitted region decreases. \n \nSingh [66] performed the second experiment using a back-to-back gearbox to study \nthe detectability of natural pits. Similar acquisition systems to the first experiment \nwere employed with both the AE sensor and accelerometer mounted on the housing of \nthe test gearbox. The input speed to the gearbox was 1775 rpm with an unknown \ntorque loading. During the early stage of the test, there were no defects on the mating \ngear teeth surfaces and the signals (both AE and vibration) showed no significant \npeaks above the operational noise level. After 30 minutes of operation, pits started to \ndevelop on the pinion teeth and periodically occurring peaks were observed from the \nAE signals. A further 15 minutes run saw pitting on multiple teeth and the detected \nAE signals revealed more frequently occurred peaks above noise level. There was no \nvisible peak noted for the accelerometer signal. During the test, AE sensor was also \nplaced at the slave gearbox housing and bearing location between the two gearboxes \n 25\nto assess the detectability of the natural pits from the mentioned locations. Singh \nconcluded that the AE sensor should be as close to the monitored part as possible in \norder to maximise the detection capability of pits using AE technique. \n \nRaad et al [67] illustrated the application of AE monitoring technique for gear fault \ndetection by employing an industrial gear rig. No information on the gear test rig, \napplied torque and speed were given in the paper. The experiment was performed \nabove the rated load of the gears for two weeks until near breakage of two teeth. \nVarious types of AE sensor (resonant and wide band) and accelerometers were \nmounted on the bearing. Measured signals were taken at regular intervals and visual \ninspection of gears was performed at end of each day. The recorded AE and vibration \ndata were analysed using four different methodologies: visual comparison, Kurtosis, \nspectral density and envelope analysis. The visual comparison revealed that AE bursts \nappeared with spalling. However, these AE bursts disappeared after the defect was \nestablished. There was no clear indication from vibration signatures. The Kurtosis \nvalues were correlated to spalling defects after 3000 cycles. However, this method \nwas unable to localise the spalling defect to individual tooth. The first sign of spalling \nobserved from the vibration technique was at 5000 cycles. Using the spectral density \nanalysis method, the increased in energy before and after the spall detection was \ncommon to both AE and vibration signals. In the final analysis of the AE and \nvibration signals, the spectrum of the squared envelope was used. Vibration technique \nwas able to pick up the defect by displaying peaks at twice the shaft frequency. \nHowever, these peaks were not visible in the AE spectrum until the logarithm of the \nsquared envelope was employed. The observed peaks occurred at the same frequency \n 26\nfor both AE and vibration techniques. Raad concluded that this first evaluation of AE \nas condition monitoring tool is promising. \n \nSentoku [68] presented an investigation on tooth surface failure with AE \nmeasurements. A power circulating type gear testing machine was employed.  The \ntesting machine consisted of a pair of test and power return spur gears with a forced \nlubrication system that supply oil directly to the engaged teeth surfaces from the side \nof the gear pairs. It is important to note that the oil temperature was maintained \nconstantly at 40±2 0C. This eliminated the effect of oil film thickness on AE activity. \nAn ultra-compact AE sensor of resonant frequency 350 kHz was mounted on the gear \nwheel using screws. AE signature was transmitted from the sensor to the data \nacquisition card via a mercury slip ring. Strain gauge was also adhered to the tooth \nroot to correlate the extracted AE parameters with tooth root strain waves. During the \ntests, the roughness of the gear teeth surfaces and pitting size were measured at \nregular intervals.  \n \nThe first test was performed under applied stress of 960 MPa and pinion speed of 992 \nrpm using hardened gears. From the results obtained, Sentoku observed no change in \nAE amplitude except the unevenness of AE wave lines were smaller with increasing \nnumber of cycles. At this stage of test, no surface damage was noted. Subsequently, \nSentoku performed the second test using heat treated ground gears. During the early \nstage of the test, both AE amplitude and the pitting area ratio remained unchanged. \nHowever, when pitting on the three monitored gear teeth began, AE wave lines started \nto change.  Subsequently, AE amplitudes increased with both the pitting area ratio and \nthe numbers of cycle. Sentoku explained that the increase in AE amplitude was \n 27\ncaused by friction due to increasing pitting. Similar observations were noted for AE \nenergy. Hence, with the results obtained from the test, he drew conclusion that AE \ntechnique could detect gear teeth pitting. \n \nBadi et al [69] performed an investigation on usage of AE and vibration monitoring \ntechniques for condition monitoring of a typical drive-line. A test rig comprised of a \ndrive and simple spur gearbox, loaded by pneumatically operated brake disk was \nemployed to simulate the essential part of this drive-line. The rotating components \nwere connected by flexible couplings and supported by bearing blocks. The rig was \ninstrumented with both accelerometers and AE sensors at several locations along the \ndrive line. However, Badi only reported the results from the sensor which gave the \noptimum location for fault detection. Seeded defects such as “blip” and “shaved” gear \nfaults were introduced on the test gears to simulate scuffing and pitting defects on \ngear tooth. There was no further information on the testing procedures used in this \nexperiment. Analysis techniques such as Crest Factor and Kurtosis were employed for \nboth AE and vibration techniques. For the “blip” gear fault, both monitoring \ntechniques were able to identify the defect through the analysis techniques employed. \nAs for “shaved” gear fault, only the AE technique was able to detect the defect. Badi \nconcluded that the analysis techniques used were ideally suited for identifying faults \nwith impulsive nature. However, for a more comprehensive methodology, other \nanalysis technique should be explored. \n \nTandon and Mata [70] performed seeded defect tests on spur gears using IAE gear \nlubricant testing machine to assess the fault detection capability of AE technique and \nmake comparison with the more widely used vibration technique. Both hardened and \n 28\nground spur gears were employed for the tests. The test gears were lubricated by a jet \nof oil. The AE sensor and accelerometer employed had a resonant frequency of 375 \nand 39 kHz respectively. Both the AE and vibration signals were measured closed to \nthe bearings of the test gearbox. All the tests were carried out at a single speed (1000 \nrpm) and varying load conditions (0 to 10 kg). AE and vibration measurements were \nfirst taken for gears that have no seeded defect, which were treated as reference \nsignals. Subsequently, a simulated pit of constant depth (500µm) and variable \ndiameter (from 250 to 2200µm in incremental order) was introduced on a gear tooth \npitch-line by spark erosion. From the tests, Tandon and Mata made these \nobservations: (a) there was some increase in AE with increase in load. (b) AE \nparameters increased as the defect size (diameter of pit) increased. (c) AE (ring-down) \ncounts showed slightly better results than other AE parameters measure. (d)  AE \ntechnique detected the seeded defect at smaller size (500 µm) compared to vibration \ntechnique (1000µm). (e) In general, the distribution of AE events, counts and peak \namplitude became broader due to the presence of defect in gear. \n \nFinley [43] presented an industrial case study on the application of an AE developed \nsystem (Incipeint Fault Detection) for gearbox monitoring. Al-Balushi and Samanta \n[71] introduced energy-based features extracted from AE signatures for monitoring \nand diagnosing gear faults. This feature, termed as energy index (EI), was defined as \nthe square of the ratio of the r.m.s value for a segment of the signal to the overall r.m.s \nvalue of the entire signal. Various different forms of EI were derived and compared \nwith existing statistical methods for early fault detection. Experiments were \nundertaken on a back-to-back spur gearbox. Three miniature ultra-sound transducers \nwere implanted onto the rolling element bearing adjacent to the gear wheel for \n 29\ncollection of AE data. A triggering system was used to ensure all the acquired data \nhave identical starting locations on the gear. The tests were performed using brand \nnew gears and terminated at the 40th hours when the gear failed. AE signals were \nacquired for 1 revolution of the test gear at hourly interval. However, information \nsuch as the characteristics of the sensors, the applied load and the reason of the \nvarying rotational speeds were undisclosed. Al-Balushi illustrated that the proposed \nEI and the various derived forms were able to locate the broken and pitting teeth more \neffectively than the traditional Kurtosis and Crest Factor methods. By employing the \nproposed analysis technique, the defective tooth was picked up in a helicopter \ngearbox.  \n \nIn a separate report Al-Balushi and Samanta [72] presented a procedure for fault \ndiagnosis of gears through wavelet transforms and ANN. The time domain AE signals \nof a rotating machine with normal and defective gears were processed through \nwavelet transform to decompose in terms of low frequency and high-frequency \ncomponents. The extracted features from the wavelet transform were used as inputs to \nan ANN based diagnostic approach. The procedure was illustrated through the \nexperimental AE signals of a gearbox. \n \nTan and Mba [73, 74] noted difficulties in identifying the location of a defective tooth \nduring an experimental investigation. It was noted that the lubricant temperature had \nan influence on the levels of AE activity\/strength during the gear mesh. This has far \nreaching consequences as it implies that whilst other researchers have stipulated the \neffect of load\/speed on AE activity, the time of data acquisition, in effect the \ntemperature of the lubricant will influence the levels of AE obtained. \n 30\n \nWhile exploring the applicability of AE technique to gear health diagnosis, \nToutountzakis and Mba [75] made some interesting observations of AE activity due to \nmisalignment and natural pitting. The test was performed on a back-to-back spur \ngearbox with the AE sensors placed on the pinion and bearing casing of the pinion \nshaft. The AE sensors used have a relative flat response in the region between 150 and \n750 kHz. A silver contact air-cooled slip ring was employed to transmit the AE signal \nfor further processing. AE parameters such as r.m.s and energy values were recorded \nduring the tests. Prior to the test proper, AE measurements for defect free gears were \nfirstly recorded. As the rotational speed increased, measured AE parameters increased \nfor both AE sensor locations.  Furthermore, Toutountzakis and Mba observed that \nchange in speed resulted in changing AE parameters. During one of the tests, \nToutountzakis et al noted increasing AE r.m.s (at pinion location) for 6 hours before \nthe gearbox was paused for inspection. The results of the inspection revealed signs of \npitting and scuffing which indicating a misalignment in the gearbox. The gearbox was \nreassembled and the test continued. An interesting observation was made: “A \nreduction in AE parameters was noted initially, but these values gradually increased \nto values which did not depart from the initial gradient of the increasing trend.” \nToutountzakis and Mba concluded that there is potential application of AE technique \non gear health diagnostic. \n \nPrice et al [76] investigated the detection of severe sliding and pitting with AE. The \nexperimental results presented were based on a ‘four-ball machine’ test-rig. It was \nobserved that scuffing and pitting were easily detectable by observing changes in AE \nenergy, principally due to changes in contact friction. More interestingly, Price noted \n 31\nchanges in the frequency patterns of measure AE signals prior to pitting and stated \nthat AE monitoring was capable of detecting wear events prior to either vibration \nmonitoring or wear debris analysis. Building on this statement, very recently Tan et al \n[77, 78, 79, 80] presented results of an experimental investigation in which natural \npitting of spur gears was allowed to occur. Throughout the test period, AE, vibration \nand spectrometric oil samples were monitored continuously in order to correlate and \ncompare these techniques to natural life degradation of the gears. It was observed that \nthe AE technique was more sensitive in detecting and monitoring pitting than either \nthe vibration or Spectrometric Oil Analysis (SOA) techniques. It is concluded that as \nAE exhibited a direct relationship with pitting progression, it offered the opportunity \nfor prognosis.  From the results presented it was clearly evident that the AE \nmonitoring indicator could be linearly correlated to the gearbox pitting rates for all \ntorque conditions, with detection of onset of pitting as early as 8% of the pitted gear \nworking face area. This offered much earlier diagnosis than vibration analysis where \nonly after between 20 to 40% of pitted gear working face did this technique offer \ncapability for defect identification. This near linear relationship between AE and pit \nprogression offers great potential, and opportunities, for prognostics in rotating \nmachinery. \n \nTan et al [73, 81, 82, 83] ascertained the AE source mechanism through a series of \nexperimental programmes. These experimental programmes consisted of isothermal \ntests on undamaged gears to explore the effects of rotational speed and applied torque \non AE levels. From the isothermal test results, it was observed that variation of the \napplied torque had a negligible effect on the AE r.m.s levels, similar to the negligible \neffect of load on film thickness under Elastohydrodynamic Lubrication (EHL) of non-\n 32\nconforming mating surfaces. It was noted that the variation in rotation speed had a \nmore pronounced effect on AE r.m.s levels relative to the load. Tan concluded that the \nsource of AE during gear mesh was asperity contact under rolling and sliding of the \nmeshing gear teeth surfaces. \n \nAlthough the development of AE in gear diagnosis is in its infancy, the papers \nreviewed have illustrated the potential and viability of AE becoming a useful \ndiagnostic tool in condition monitoring of gears. However, more detailed \ninvestigations are required to ensure this technique is robust and applicable for \noperational gearboxes. This involves understanding the influences of operational \nvariables on AE generation and investigating the effects of variable load conditions to \nmonitoring with AE. \n \n \n4. Pumps and Acoustic Emission technology \n \nPumps play a significant role in industrial plants and need continuous monitoring to \nminimise loss of production. Every pump manufacturer supplies characteristic curves \nfor their equipment illustrating pump performance under given conditions. These \ncurves demonstrate the inter-relationship between discharge capacities, pump head, \npower and operating efficiency. The ideal operating point for a pump is known as the \nbest efficiency point, or BEP. This is the point where pump capacity and head \npressure combine to provide the maximum efficiency of the pump. If the pump \noperates too far to the left or right of the BEP, not only may its efficiency be \ncompromised, but it can also be subjected to increased wear, reducing operational life. \n 33\nAlso, the pump manufacturer will undertake NPSH (Net Positive Suction Head) tests \non supplied pumps; the significance of the latter is to determine the 3% drop in head \nat which serious cavitations will occur. Cavitation occurs when the absolute static \npressure at some point within the pump falls below the saturated vapour pressure of \nthe liquid. It causes a loss of pump efficiency and degradation of the mechanical \nintegrity of the pump. It is generally accepted that the critical pressure for inception of \ncavitation is not constant and varies with operation fluid physical properties, the \nsurface roughness of the hydraulic equipment, etc. In addition cavitation is known to \nbegin long before the performance of the pump is affected [84].   \n \nThis paper reviews the application of AE for condition monitoring of pumps. Prior to \ndetailing some recent attempts at applying AE to pump health diagnosis, the \ninvestigation of McNulty and Pearsall, and, McNulty and Deeprose [84, 85] is worthy \nof mention. McNulty undertook high frequency measurements (up to 160kHz) taken \nat the suction and discharge sides of the pump and detected incipient cavitation. \nHowever, it was noted that the success was dependent on the operational background \nnoise levels. The results presented by McNulty relating NPSH to varying noise levels \nis of great interest, though undertaken at 40KHz. It clearly relates the audible intensity \nand high frequency energy to the varying cavitation stages experienced by a pump as \nthe head drops to the 3% level. It was noted [84] that during cavitation the high \nfrequency noise increased. In separate paper McNulty [86] showed that minimum \nnoise intensity levels of a pump were obtained at the BEP. Sources of noise were \nnoted as turbulence, impeller and volute interactions and hydraulic interactions.  \n \n 34\nDerakhshan et al [87] investigated the cavitation bubble collapse as a source of \nacoustic emission and commented that the high amplitude pressure pulse associated \nwith bubble collapse generated AE. With the AE sensor was placed on the actual \nspecimen experiencing cavitation Derkhshan observed increasing AE r.m.s levels \nwith increased pressure of flow and cavitation.  However, with the AE sensor \nmounted on the tank wall the reverse was observed, decreasing AE r.m.s levels with \nincreasing pressure and cavitation. This was attributed to a visible bubble cloud that \nincreased with pressure. It was commented that this cloud attenuated the AE signature \nprior to reaching the transducer on the wall casing. In addition to the high amplitude \npressure pulse associated with cavitation, pressure pulses associated with centrifugal \npumps have been detailed [88], these include wake flow from the impeller blade \ntrailing edge, vortices generated by flow separation and recirculation. The influence \nof the latter on pump performance has been presented [89].  \n \nNeill et al [90, 91, 92] assessed the AE technology for detecting early cavitation. It \nwas also noted that the collapse of cavitation bubbles was an impulsive event of the \ntype that could generate AE. These transients cause very high local transient pressure \nthat can damage the internal parts of pumps. It was observed that when the pump was \nunder cavitation the AE operational background levels dropped in comparison to non-\ncavitating conditions. To ensure a more direct transmission path between the fluid and \nthe sensors, metal wave-guides were put into the venture tube wall at different \nlocations. It is worth stating that prior to, and during cavitation, vibration \nmeasurements showed no significant change. In conclusion Neill stated that loss in \nNPSH before the 3% drop-off criterion was detectable with AE and evidence of \nincipient cavitation was detectable in the higher frequency band (0.5 to 1MHz). It is \n 35\ninteresting to note that Neill [93] also successfully applied AE technology to detect \nthe recirculation in a centrifugal pump. Recirculation is defined as a flow reversal at \neither the inlet or the discharge tips of the impeller vanes. It occurs in axial, \ncentrifugal shrouded and un-shrouded pumps. It is important to detect this \nphenomenon at the earliest stage and distinguish it from other undesirable \nphenomenon such as cavitation. \n \nHutton [94] investigated the feasibility of detecting AE in the presence of hydraulic \nnoise. It was noted that artificially seeded AE bursts were detected above background \noperational noise for turbulent flow, with and without cavitations. Furthermore, \nHutton noted that the presence of cavitations in the system increased the operational \nAE noise levels by a factor of 50. In addition, cavitation was found to generate a \nsignificant increase in noise level below 500KHz. Hutton placed AE sensors on the \npipe. Darling and Johnston [95] that the AE from a high pressure hydraulic pump \nduring cavitation was wide band noise; up to 1MHz. Darling and Johnston noted that \nduring cavitation there was little change in the vibration signature from normal \noperation which was not the case with AE observations. It was also commented that \nthe position of the AE sensor was insensitive to mounting position whilst the reverse \nwas observed with the vibration senor. \n \n \nAl-Maskari [96] attempted to detect incipient cavitation with AE but concluded that \nwhilst the inception of cavitation was not detectable with AE, fully developed \ncavitation was detectable. Another interesting observation by Al-Maskari was the \nvariation in AE activity at flow rates below the BEP and it was suggested that \n 36\ninvestigations on applying AE to cavitation detection should be concentrated at the \nBEP. Al-Maskari placed the AE sensor on the pump casing. Sundt [32] detailed a case \nstudy on the application of AE for detecting pump cavitation. It was shown that \nduring cavitation AE levels increased whilst vibration levels dropped. Also, Finley \n[43] presented an industrial case highlighting the successful application of AE to \ncavitation detection. Cudina [97] whilst promoting the use of audible acoustics (less \nthan 20kHz) for monitoring pumps sites some applications of AE for detecting broad \nband noise associated with cavitation. Al-Sulti et al [98] noted that the use of power \nspectrum density of AE acquired over a range of flow rates was not effective in \ndetecting cavitation. However, it was noted that the use of higher order spectral \nanalysis (bi-coherence) showed improved sensitivity of AE over vibration for early \ndetection of cavitation. The results are in contrast to nearly all published work on AE \nfor monitoring cavitation where a clear increase in AE levels was noted without the \nneed for advanced signal processing. \n \nThe papers reviewed above have clearly associated AE with the collapse of cavitation \nbubbles. The presence of cavitation has been shown to increase operational AE noise \nlevels. Recently Alfayez et al [99, 100] undertook experimental tests on a range of \npumps in an attempt to correlate incipient cavitation with AE activity. Results showed \na clear relationship between AE activity measured from the pump casing, suction and \ndischarge pipes, and incipient cavitation. At a high NPSH value, when incipient \ncavitation is known to occur, a significant increase in AE was observed. Experiments \nwere conducted for several flow rates on different sized pumps to validate this \nassumption. Further reduction in NPSH resulted in decrease in measured AE levels \ndue to the presence of bubble clouds.  Observations of the frequency content of \n 37\ncaptured AE time wavefroms showed a shift in frequency range for incipient and \ndeveloped cavitation. Results of this study also showed that the measurement of AE \nr.m.s levels could be employed for determining the BEP of pumps which offers \nenormous opportunities within the industry. Sikorska and Hodkiewicz [101] re-\niterated the observations of Alfayez [99,100] noting that AE was able to detect off \nduty conditions in double suction pumps. Furthermore Sikorska and Hodkiewicz \nnoted that AE could be used to detect cavitation and recirculation and postulated that \nlow flow AE activity was initiated by recirculation whilst high flow AE activity was \ndue to incipient cavitation. Cavitation is known to occur more easily at higher flow \nrates [97].  \n \n5. Monitoring engines and rotating structures with Acoustic Emission \n \nIndustries all over the world use various machines and structures to manufacture and \ndistribute various goods and services to global customers. These include rotating and \nreciprocating machines and mechanical structures of all sizes, shapes and \ncomplexities. Damage assessment of these assets (both old and new) is very crucial as \nit determines the quality, reliability, availability, maintainability and the life \nexpectancy. The reliability and health monitoring of both old and new machineries \nand structures form the subject of extensive research in many academic institutions, \ngovernment laboratories, defense research establishments, and industrial organisations \nworldwide. AE technology is now becoming a widely accepted practice in the field of \nengine and rotating structural monitoring.   \n \n 38\nHolroyd et al [90] illustrated the background to the AE approach and its technological \ndevelopments, which enabled it to be used as a means of dynamically probing the \noperation of machineries and mechanisms, and, attempted to clarify the opinions held \non the similarities and differences of the AE and vibration monitoring techniques \nwhen applied to machinery condition monitoring [91]. Holroyd et al [92] illustrated \nwith examples some real benefits of using AE techniques as a highly sensitive, simple \nto use and cost effective maintenance tool. \n \nGill et al [93] described how AE techniques could be implemented as a condition-\nbased maintenance strategy to monitor the inlet and outlet valves of reciprocating \ncompressors. The investigation was based on an 8-cylinder, horizontally opposed, \nsingle acting, two-stage compressor used to compress ethylene at a large plastics \nplant. Gill highlighted the possibility of detecting fluid movement with AE \ntechnology. The sensor required very little space and was non-intrusive, which was a \nmajor benefit in the hostile conditions. The results revealed the practical deployment \nof AE sensors for condition monitoring applications. \n \nFog et al [94] conducted an experimental investigation into detecting exhaust valve \nburn-through on a 4-cylinder, 500mm bore, 2-stroke marine diesel engine with an \noutput of approx. 10,000 BHP. The investigation comprised monitoring 3 different \nvalve conditions (normal, leak & large leak). Vibration & structure-born stress waves \n(AE) were monitored. The results showed that the AE signals contained more \ninformation for identifying valve and injector related mechanical events during the \ncombustion process than time-series recorded from other sensors. Features of the AE \nsignals were extracted using principal component analysis (PCA). A feed-forward \n 39\nneural classifier was used to discriminate between 3 valve conditions. Friis-Hausen et \nal [95] identified efficient classifiers for detection of two different failure modes in \nmarine diesel engines (exhaust valve leaks and defective injection (misfire)). The \npurpose of the exhaust valve is to seal the combustion chamber from the surroundings \nduring compression, thus securing maximum pressure in the cylinder during the \ncombustion event. This ensures maximum engine performance in terms of output \npower. This study identified an efficient classifier, which could discriminate \ncompletely between leak sizes in the exhaust valve, based on the recorded r.m.s AE \nsignals. An efficient classifier for detection of misfire was also developed. El-Ghamry \net al [96] illustrated the potential of AE sensing to determine the strength of the air-\nfuel mixture in 30.56 litre Perkins 4-stroke, 8-cylinder turbocharged gas engine. AE, \nacceleration, inside cylinder pressure and timing signals were monitored during the \ntests. The results revealed that the AE signal showed additional features, which could \nbe used to identify the strength of the gaseous fuel mixture. \n \nResults that showed that indirect measurements of cylinder pressure from diesel \nengines with AE technology was presented by El-Ghamry [97].  The AE r.m.s was \ncorrelated to the pressure in the time and frequency domain. Furthermore, the \ncomplex cepstrum analysis was used to model the pressure readings from the \ncomplete combustion phase of the engine. El-Ghamry noted the advantage of \nemploying the cepstral analysis for the model, stating that it used the frequency \ncontent of the AE r.m.s signal rather than the energy content, which gave the \nadvantage over signals with low energy content. The application of AE technology to \nmodelling the pressure originated from previous studies by El-Ghamry [98]. In the \nlatter investigation El-Ghamry attempted to develop generic techniques for \n 40\ndiagnosing faults in reciprocating machines. The generic pattern recognition \ntechnique developed was based on the time-domain AE r.m.s signals, statistical \nfeature extraction from the time-domain signal and correlation of the AE response to \nspecific events in the engines. Steel et al [99] recently reviewed developments in \nmonitoring engines with AE.  It was noted that AE signals could be associated with \nthe actual operational and degrading processes in the engine. Furthermore this could \nbe accomplished non-intrusively. It was also stated that analysis of AE data could be \nenhanced with a detailed knowledge of the operating conditions of the engine, such as \ninjector timing, running speed and valve movement.  \n \nMba [100] presented a case study on the application of high frequency acoustic \nemissions as a means of detecting early stages of loss of mechanical integrity in low \nspeed rotating machinery. Investigations were centered on the Rotating Biological \nContactor (RBC) which was used for sewage treatment in small communities and \nrotates at approximately 1rpm. The results presented were obtained from an \noperational unit that suffered a fractured stub shaft retaining bolt head. Evidence to \nsupport the inadequacies of vibration analysis and the applicability of acoustic \nemissions to detecting this fault condition were detailed. The results of the case study \npointed to the potential of AE for diagnosing serious mechanical defects where \nvibration analysis would be ineffective. The investigation showed that AE activity \ncould be related to not only the fractured bolt but also to loose bolts. The mechanism \nfor generation AE signatures was the rubbing in the threaded bolt within its recess and \nthe rubbing and\/or crushing of the fractured bolt shank with wear and rust particles \nwithin the clearance hole of the stub shaft. A typical AE parameter such as amplitude \ncan provide valuable information on the clamped condition of a component on a low \n 41\nspeed rotating machine. These observations confirmed the finds of Hanel and Thelen \n[101, 102, 103] where a relationship between AE activity and the tensile stress on a \nbolt was established. A direct correlation between increased AE activity and plastic \ndeformation of the bolt was presented. Furthermore, the investigators proposed that \nthe low level AE activity in the elastic range of the bolt corresponded to the friction \nprocess in the thread. \n \nSmulders and Loob [104] employed the use of enveloping and high frequency AE \ntechnology for monitoring: bearing fault detection; very slow speed bearing; rail car \nturntables; and lubrication condition in paper mill machinery. Mba et al [105, 106] \npresented the results of a study into the use of stress wave analysis as a means of \ndetecting early stages of loss of mechanical integrity in low speed rotating machinery. \nThe source of AE was attributed the breakage, and entrapment, of surface asperities as \na result of relative movement of clamped components that had lost predefined \ntightening torques (loose clamped components).  Autoregressive (AR) co-efficients \nassociated with each AE provided an efficient parameter for classification and \ndiagnostics. Holroyd [107] reviewed some of his development work in applying the \nAET to machinery condition monitoring over the last decade and also introduced new \ndevelopments in the field of condition monitoring of structures.  \n \n6. Conclusion \n \nAcoustic Emission Technology is a continuously evolving multidiscipline and is now \nthe focus of intense research and application based studies.  The wealth of knowledge \ndiscovered, generated and disseminated in this evolving discipline is itself proof of its \n 42\ndiverse applicability. The interests to develop new technologies to overcome the many \nhitherto unsolved problems in condition monitoring and diagnostics of complex \nindustrial machinery applications offers immense opportunities for the AE \nTechnology to grow unabated. This is also reflected by the significant growth in the \nglobal demands for the AE sensors. With the accelerating speed in the growth of \nintelligent information, sensor and data acquisition technologies, combined with the \nrapid advances in intelligent signal processing techniques, a healthy growth in the \napplication of AE in many engineering, manufacturing, processing and medical \nsectors is to be expected.  The application of AE in prognosis is yet to be fully \nexplored and exploited. We are still a long way away from interpreting and fully \nunderstanding the wonderful ‘sounds of AE’ from rotating machines. \n \n \n7. References \n \n1 Pao, Y-H., Gajewski, R.R. and Ceranoglu, A.N. (1979), Acoustic emission \nand transient waves in an elastic plate, J. Acoust. Soc. Am., 1979, 65(1), 96 –\n102. \n2 Pollock AA, Acoustic Emission Inspection, Physical Acoustics Corporation, \nTechnical Report, 1989, TR-103-96-12\/89. \n3 Mathews, J. R. Acoustic emission, Gordon and Breach Science Publishers Inc., \nNew York. 1983, ISSN 0730-7152. \n4 Viktorov. I. A., Rayleigh and Lamb Waves; Physical theory and application, \nPlenum press, New York,, USA. 1967. \n 43\n5 Non-destructive testing handbook, Volume 5 – Acoustic Emissions. \n(Published by the American Society of Non-destructive testing) ISBN 0-\n931403-02-2. \n6 Catlin Jr., J.B. The Use of ultrasonic diagnostic technique to detect rolling \nelement bearing defects. Proceeding of Machinery and Vibration \nMonitoring and Analysis Meeting, Vibration Institute, USA, April 1983, \n123-130. \n7 Balerston, H. L., The detection of incipient failure in bearings, Materials \nEvaluation, Vol 27, 121-128, 1969. \n8 Rogers, L. M., The application of vibration analysis and acoustic emission \nsource location to on-line condition monitoring of anti-friction bearings. \nTribology International, 1979; 51-59. \n9 Yoshioka T, Fujiwara T. New acoustic emission source locating system \nfor the study of rolling contact fatigue, Wear, 81(1), 183-186. \n10 Yoshioka T, Fujiwara T. Application of acoustic emission technique to \ndetection of rolling bearing failure, American Society of Mechanical \nEngineers, Production Engineering Division publication PED, 1984, 14, \n55-76. \n11 Hawman, M. W., Galinaitis, W. S, Acoustic Emission monitoring of \nrolling element bearings, Proceedings of the IEEE, Ultrasonics \nsymposium, 1988, 885-889 \n12 Holroyd, T.J. and Randall, N., (1993), Use of Acoustic Emission for Machine \nCondition Monitoring, British Journal of Non-Destructive Testing, 1993, \n35(2), 75-78. \n 44\n13 Holroyd, T. Condition monitoring of very slowly rotating machinery using AE \ntechniques. 14th International congress on Condition monitoring and \nDiagnostic engineering management (COMADEM'2001), Manchester, UK, 4-\n6 September 2001, 29, ISBN 0080440363 \n14 Bagnoli, S., Capitani, R. and Citti, P. Comparison of accelerometer and \nacoustic emission signals as diagnostic tools in assessing bearing. Proceedings \nof 2nd International Conference on Condition Monitoring, London, UK, May \n1988, 117-125. \n15 Tandon, N. and Nakra, B.C, Defect Detection of Rolling Element Bearings by \nAcoustic Emission Method, Journal of Acoustic Emission, 1990; 9(1) 25-28. \n16 Choundhury, A. and Tandon, N., Application of acoustic emission \ntechnique for the detection of defects in rolling element bearings, \nTribology International, 2000; 33, 39-45 \n17 Tan, C.C. Application of acoustic emission to the detection of bearing \nfailures. The Institution of Engineers Australia, Tribology conference, \nBrisbane, 3-5 December 1990, 110-114. \n18 Huguet, S, Godin, N, Gaertner, R, Salmon, L, Villard, D. Use of acoustic \nemission to identify damage modes in glass fibre reinforced polyester. \nComposites Science and Technology, 2002, 62, 1433-1444. \n19 Yoshioka, T., korenaga, A., Mano, H. and Yamamoto, T. Diagnosis of rolling \nbearing by measuring time interval of Acoustic Emission generation. Journal \nof Tribology, Transactions of ASME, Vol. 121, July 1999, 468-472. \n20 Morhain, A, Mba, D, Bearing defect diagnosis and acoustic emission, Journal \nof Engineering Tribology, I Mech E, Vol 217, No. 4,  Part J, p 257-272,  2003. \nISSN 1350-6501. \n 45\n21 Kakishima, H., Nagatomo, T., Ikeda, H., Yoshioka,, T., Korenaga, A., \nMeasurement of Acoustic Emisión and vibration of rolling bearings with an \nartificial defect, QR of RTRI, Vol 41, No. 3,127-130, 2000. \n22 Kaewkongka, T and Au, Y. H. J., application of Acoustic Emission to \ncondition monitoring of rolling element bearings. Measurement and Control, \nVol 34, no. 8, 254-247, 2001. \n23 Schoess, J. N.; Development and application of stress-wave acoustic \ndiagnostics for roller bearings, Proceedings of SPIE, The International society \nfor optical engineering, Vol 3986, 58-70, 2000. \n24 Price, E. D., Lees, A. W., M.I. Friswell, Application of high frequency \nmonitoring for classification of rolling element bearing failures. Key \nEngineering Materials, Vol 204-205, 173-182, 2001 \n25 Shiroishi, J., Li, Y., Liang, L. S., Kurfess, T., Danyluk, S., Bearing condition \nvia vibration and acoustics emission measurements. Mechanical Systems and \nSignal Processing, Vol. 11, no. 5, 1997, 693-705. \n26 Hoeprich, M. R., Rolling Element bearing fatigue damage propagation, \nTransactions of ASME, Journal of Tribology, Vol. 114, April 1992, 328-333. \n27 Abdullah M. Al-Ghamdi, P. Cole, Rafael Such, D. Mba, Estimation of bearing \ndefect size with Acoustic Emission, INSIGHT, Vol. 46, no. 12, 758-761, Dec \n2004. \n28 Abdullah M. Al-Ghamdi and D. Mba. A comparative experimental study on \nthe use of Acoustic Emission and vibration analysis for bearing defect \nidentification and estimation of defect size. Mechanical Systems and Signal \nProcessing, Accepted MSSP04-98R2. 2005. \n 46\n29 Li, Y., Billington, S., Zhang, C., Kurfess, T., Danyluk, S., Dynamic prognostic \npredicition of defect propagation on rolling element bearings. ASME\/STLE \nTribology conference, Toronto, Ontario, Canada, Oct 26-28, 1998, 385-392. \n30 Vibha Bansal, Gupta, B.C, Arun Prakash, Eshwar, V. A, Quality \ninspection of rolling element bearing using acoustic emission technique, \n1990, Journal of Acoustic emission, 9(2), 142-146. \n31 Li, C. J, Li, S. Y., Acoustic Emission analysis for bearing condition \nmonitoring, Wear, 185, 1985, 67-74. \n32 Sundt, P. C, Monitoring Acoustic Emission to detect mechanical defects, \nInTech, December 1979, 43 – 44 \n33 Barclay, J., Bannach, R, Multi-parameter condition monitoring, Noise and \nvibration worldwide, March 1992, 17 – 20. \n34 Badi, M.N.M., Johnson, D.E. & Trmal, G.J. (1990). The Use of Stress Wave \nSensors for the Diagnosis of Bearing Faults. Proceedings of COMADEM \n1990. Chapman & Hall, London. 20-25. ISBN 0 – 412 – 38560 - 0 \n35 Sturm, A., Ellmer, G. & Billhardt, S. (1992). Analysis of High-Frequency \nAcoustic Signals of Machines with Rolling-Element Bearings and Sliding \nBearings. Ibid. 184-190. \n36 Javed, M. & Littlefair, G. (1993). Neural Networks based System for Rotating \nMachinery. Proceedings of COMADEM 1993. University of West of England, \nBristol. 418-23. ISBN 1 – 871056 – 72 - 1 \n37 Neill, G.D., Benzie, S., Gill, J.D., Sandford, P.M., Brown, E.R., Steel, J.A. & \nReuben, R.L. (1998). The Relative Merits of Acoustic Emission & \nAcceleration Monitoring for the Detection of Bearing Defects. Proceedings of \nCOMADEM 1998.Monash University, Australia. 651-659. \n 47\n38 Salvan, S.M.E., Parkin, R.M., Coy, J. & Li,W. (2001). Intelligent Condition \nMonitoring of Bearings in Mail Processing Machines using Acoustic \nEmission. Proceedings of COMADEM 2001. Elsevier, Oxford. 67-74.   ISBN \n0 – 08 – 044036 - 3 \n39 Parikka, R., Vidqvist, V., Vaajoensuu, E. & Tervo, J. (2002). Test Equipment \n& Diagnostic System for Determining Lubrication Condition & Running \nClearance of Rolling Bearings. Proceedings of COMADEM 2002. \nCOMADEM International, Birmingham. 153-162. ISBN 0 – 9541307 – 0 - 7 \n40 Morhain, A. & Mba, D. (2002). Defect Diagnosis of Lightly Loaded Bearings \nwith Acoustic Emissions. Proceedings of COMADEM 2002. COMADEM \nInternational, Birmingham. 492-502. ISBN 0 – 9541307 – 0 – 7. \n41 Yibo Edward Fan, Fengshou Gu and Andrew Ball, Condition monitoring of \nrolling element bearings using advanced acoustic emission signal analysis \ntechnique, 18th  International Congress and Exhibition on Condition \nMonitoring and Diagnostic Engineering Management (COMADEM 2005), \nCranfield, UK, August 31st – 2nd September 2005. \n42 Holroyd, T. J., Acoustic Emission as a basis for the condition monitoring of \nindustrial machinery. Proceedings of the 18th Machinery vibration seminar, \nCanadian Machinery vibration association, 27-29 April 2000, Halifax, Nova \nScotia, Canada, p 125-131. ISBN 1-55131-045-7. \n43 Finley, R. W, Computerisation preventive maintenance systems using \nmodified Acoustic Emission techniques, Materials Evaluation, 38(8), p 15-20, \nAugust 1980. \n44 Jamaludin, N., Jailani, M. & Nor, M. (2002). Lubrication Monitoring in a Low \nSpeed Bearing Using Acoustic Emission Technique. Proceedings of \n 48\nCOMADEM 2002. COMADEM International, Birmingham. 521-527. ISBN 0 \n– 9541307 – 0 - 7 \n45 Miettinen, J. & Salmenperä, P. (2000). Acoustic Emission Monitoring of \nGrease Lubricated Rolling Bearings. Proceedings of COMADEM 2000. \nMFPT Society, USA. 21-30. ISBN 0 – 9635450 – 2 - 7 \n46 Miettinen J, Andersson, P. Acoustic emission of rolling bearings \nlubricated with contaminated grease, Tribology International, 2000, \n33(11), 743-802 . \n47 Berry, J. E., 1992  Required vibration analysis techniques and instrumentation \non low speed machines ( particularly 30 to 300 RPM machinery ), Technical \nAssociates of Charlotte Inc.,Advanced Vibration Diagnostic and Reduction \nTechniques. \n48 Canada, R.G., and Robinson, J.C., 1995 Vibration measurements on slow \nspeed machinery. Predictive Maintenance Technology National Conference \n(P\/PM Technology), pp 33-37, Vol. 8, no. 6. Indianapolis, Indiana. \n49 Murphy, T.J., 1992 The development of a data collector for low-speed \nmachinery. 4th international Conference on Profitable Condition Monitoring, \nbHr Group Ltd., pp 251-258, 8-10 Dec., Stratford-upon-Avon, UK. \n50 Robinson, J.C, Canada, R.G., and Piety, R.G. 1996 Vibration Monitoring on \nSlow speed Machinery: New Methodologies covering Machinery from 0.5 to \n600rpm. Proc. 5th International Conference on Profitable Condition \nMonitoring - Fluids and Machinery Performance Monitoring, pp 169-182, bHr \nGroup Ltd., Publication 22, Harrogate, UK. \n51 Kuboyama, K., Development of Low Speed Bearing Diagnosis Technique, \nNKK Fukuyama Works, Fukuyama City, Hiroshima, Japan. \n 49\n52 McFadden, P. D., and Smith, J. D. Acoustic emission tranducers for the \nvibration monitoring of bearings at low speeds, Report no. CUED\/C-\nMech\/TR29 1983.  \n53 Smith, J.D. 1982 Vibration monitoring of bearings at low speeds, Tribiology \nInternational, pp 139-144. \n54 Tavakoli, M. S., Review of bearing monitoring – Application of Acoustic \nEmission, 1st International conference on Acoustic Emission in \nManufacturing; Edited by Vahaviolos, S. J., 16 – 19 Sept, 1991, Boston, \nMassachusetts, USA. \n55 Holroyd, T.J. (1993). Acoustic Emission Monitoring of Slow Moving \nBearings. Proceedings of COMADEM 1993. University of West of England, \nBristol. 518. ISBN 1 – 871056 – 72 - 1 \n56 Miettinen, J. & Pataniitty, P. (1999). Acoustic Emission in Monitoring \nExtremely Slowly Rotating Rolling Bearing. Proceedings of COMADEM \n1999. Coxmoor Publishing Co, UK. 289-297. ISBN 1 – 901892 – 13 - 1 \n57 N. Jamaludin, Dr. D. Mba, Dr. R. H. Bannister Condition monitoring of slow-\nspeed rolling element bearings using stress waves. Journal of Process \nMechanical Engineering, Pro. Inst. Mech Eng., 2001, 215(E):, Issue E4, 245-\n271. \n58 Sato, I. Rotating machinery diagnosis with acoustic emission techniques,  \nElectrical engineering in Japan, 1990; 10(2):115-127. \n59 Sturm A, Uhlemann, S., Diagnosis of plain bearings by Acoustic Emission \nanalysis, Measurements, 3(4), 185-191, 1985. \n 50\n60 Willaims, T., Ribadeneira, X., Billington, S. and Kurfess, T., Rolling element \nbearing diagnosis in run-to-failure lifetime testing. Mechanical Systems and \nSignal Processing, Vol 15, no. 5, 2001, 979-993. \n61 Miyachika, K., Oda, S. and Koide, T. Acoustic Emission of bending fatigue \nprocess of spur gear teeth. Journal of Acoustic Emission. 13(1\/2). S47-S53. \n1995. \n62 Miyachika, K., Zheng, Y., Tsubokura, K., Oda, S., Kanayama, Y., Koide, T., \nNamba, C. and Hayashi, T. Acoustic Emission of bending fatigue process of \nsuper-carburised spur gear teeth. Progress in Acoustic Emission XI. The \nJapanese Society for NDI. 304-310. 2002. \n63 Wheitner, J., Houser, D. and Blazakis, C. Gear tooth bending fatigue crack \ndetection by Acoustic Emissions and tooth compliance. ASME technical paper \n93FTM9. 1-7. 1993. \n64 Singh, A., Houser, D. R., and Vijayakar, S. Detecting Gear Tooth Breakage \nUsing Acoustic Emission: A Feasibility and Sensor Placement Study. Journal \nof Mechanical Design. 121. 587-593. 1999. \n65 Siores, E. and Negro, A.A. Condition Monitoring of a Gear Box Using \nAcoustic Emission Testing. Material Evaluation. 183-187. 1997. \n66 Singh, A., Houser, D. R., and Vijayakar, S. Early Detection of Gear Pitting. \nPower Transmission and Gearing Conference, ASME. DE-Vol. 88, 673-678. \n1996. \n67 Raad, A., Zhang, F., Randall, B. and Sidahmed, M. On the comparison of the \nuse of AE and vibration analysis for early gear fault detection. The 8th Western \nPacific Acoustics Conference. Melbourne, Australia. 7-9 April 2003. \n 51\n68 Sentoku, H. AE in Tooth Surface Failure Process of Spur Gears. Progress in \nAcoustic Emission IX. AEWG & AE Group. S19-S24. 1998. \n69 Badi, M.N.M., Engin, S.N. and Schonfeld, D. Fault classification of a model \ndrive-line using time domain data. COMADEM 1996.  Sheffield, UK. 43-50. \n1996. ISBN 1 – 85075 – 635 - X \n70 Tandon, N. and Mata, S. Detection of Defects in Gears by Acoustic Emission \nMeasurements. Journal of Acoustic Emission. 17(1-2). 23-27. 1999. \n71 Al-Balushi, K. R. and Samanta, B. Gear Faults Diagnosis Using Energy-Based \nFeatures of Acoustic Emission. Journal of Systems and Control Engineering. \n216. 249-263. 2002. \n72 Al-Balushi, K.R. & Samanta, B. (2000). Gear Fault Diagnostics using \nWavelets and Artificial Neural Networks. COMADEM 2000. 1001-1010. 0 – \n9635450 – 2 - 7 \n73 Tan, C. K and Mba, D., Identification of the Acoustic Emission source during \na comparative study on diagnosis of a spur gearbox, Tribology International, \nVolume 38, Issue 5,  Pages 469-480 , May 2005.  \n74 Tan, C. K and Mba, D, Limitation of Acoustic Emission for identifying seeded \ndefects in gearboxes. Journal of Non-Destructive Evaluation, Vol. 24, Issue 2, \nJune 2005.  \n75 Toutountzakis, T. and Mba, D. Observation of Acoustic Emission Activity \nDuring Gear Defect Diagnosis. NDT and E International. 36(7). 471-477. \n2003. \n76 Price, E. D., Lees, A. W., Friswell, M. I., Detection of severe sliding and \npitting fatigue wear regimes through the use of broadband acoustic emission. \n 52\nProceedings of the I MECH E Part J Journal of Engineering Tribology, 219 \n(2), 85-98, 2005. \n77 Tan, C. K., Phil Irving, David Mba, A comparative experimental study on the \ndiagnostic and prognostic capabilities of Acoustics Emission, Vibration and \nSpectrometric Oil Analysis for spur gears. Mechanical Systems and Signal \nProcessing, Submitted and under review, Jan 2005. \n78 Tan, C.K., P. Irving and D. Mba, Prognostic potential of the Acoustic \nEmission technique for spur gears, ‘Essential technologies for successful \nprognostics’, Proceedings of the 59th Meeting of the Society for Machinery \nFailure Prevention Technology (MFPT), Virginia Beach, Virginia, USA, April \n18-21, 2005, p67-76. \n79 Tan, C. K., Phil Irving and David Mba, Opportunities offered by acoustic \nemission (AE) for prognosis of spur gears, Proceedings of the 17th \nInternational congress on Condition Monitoring and Diagnostic Engineering \nmanagement, COMADEM, p 152-163, Aug 2004. ISBN 0-954 1307-1-5. \n80 Chee Keong Tan, Phil Irving and David Mba, Diagnostics and prognostics \nwith Acoustic Emission, Vibration and Spectrometric Oil Analysis for spur \ngears; a comparative study, INSIGHT, Vol. 47 No. 8, August 2005 \n81 Tan, C. K and Mba, D, Acoustic emission source at the gear mesh, \nProceedings of the 17th International congress on Condition Monitoring and \nDiagnostic Engineering management, COMADEM, p 145-151, Aug 2004. \nISBN 0-954 1307-1-5. \n82 Tan, C. K and Mba, D, The source of Acoustic Emission during meshing of \nspur gears, The 26th European conference on Acoustic Emission testing, \nEWGAE, Sept 15 – 17, 2004, p 559-565. ISBN 3-931381-58-7 \n 53\n83 C K Tan and D Mba, Correlation between Acoustic Emission activity and \nasperity contact during meshing of spur gears under partial \nelastohydrodynamic lubrication. Accepetd, TRIBOLOGY LETTERS, 2005 \n84 P. J. McNulty and I.S. Pearsall, Cavitation inception in pumps, Journal of \nFluids Engineering, Vol. 104, p 99 – 104, March 1962. \n85 McNulty P.J, W M Deeprose, Scaling of Non-Cavitating and Cavitating Pump \nNoise Acoustic for Pumps, 1978. Risley, UK. paper 3, 1-17. ISBN 10185621 \n86 P. J. McNulty (1981) Measurement Techniques and Analysis of Fluid-Borne \nNoise in Pumps. National Engineering Laboratory. NEL Report No 674.  \n87 Derakhshan, O., J. Rechard Houghton, R. Keith Jones (1989). Cavitation \nMonitoring of Hydroturbines with RMS Acoustic Emission Measurements. \nWorld Meeting on Acoustic Emission , p305-315, March 1989. \n88 Guelich, J. F and Bolleter, U., Pressure pulsations in centrifugal pumps, \nJournal of Vibration and Acoustics, Transactions of  the ASME, Vol. 114, p \n272-279, April 1992. \n89 Fraser, W. H., Flow recirculation in centrifugal pumps, Proceedings of the 10th \nannual turbomachinery symposium, Turbomachinery laboratory, Texas, USA., \np 95-100, 1981. \n90 G D Neill, R L Reuben, P M Sandford (1997). Detection of Incipient \ncavitation in Pumps Using Acoustic Emission.  Journal of Process Mechanical \nEngineering [H.W. Wilson - AST]. 1997. Vol. 211, E4; p. 267 ) \n91 G D Neill, R L Reuben, P M Sandford, E.R Brown, J. A. Steel. Detection of \nIncipient cavitation in Pumps Using Acoustic Emission. In proceedings of \nCOMADEM 96. Sheffield University, 1996, 391-401. ISBN 1–85075–635-X \n 54\n92 Neill, G.D., Reuben, R.L., Sandford, P.M., Brown, E.R. and Steel, J.A. \n(1996). Detection of Incipient Cavitation in Pumps using Acoustic Emission. \nProceedings of COMADEM 1996. Sheffield Academic Press, Sheffield. 391-\n401. 1 – 85075 – 635 - X \n93 Neill, G.D., Brown, E.R., Reuben, R.L., Sandford, P.M.and Steel, J.A. (1998). \nDetection of Recirculation in Pumps using Acoustic Emission. COMADEM \n1998.Monash University, Australia.  643-649. 0 – 7326 – 2027 - 9 \n94 P. H. Hutton (1969). Detecting Acoustic Emission in Presence of Hydraulic \nNoise. Non Destrictive testing May 1969. \n95 Darling, J. and Johnston, D. N, The use of Acoustic Emission for condition \nmonitoring in high-pressure hydraulic pumps, paper C414\/011, EUROTECH \nDirect 91, IMechE, 2-4 July, 1991, Birmingham, UK. P 137-143. \n96 A. Almaskari (1984).  Detecting of cavitation in centrifugal pump using \nacoustic emission. MSc. Thesis, Cranfield University. \n97 Cudina, M., detection of cavitation phenomenon in a centrifugal pump using \naudible sound, Mechanical Systems and Signal Processing, 17(6), 1335-1347, \n2003. \n98 S. Al-Sulti, B. Samanta, K. R. Al-Balushi, M. Al-Zedjali,  S. A. Al-Araimi, \nand R. A. Siddiqi, Comparison of signal processing techniques for detecting \npump cavitation inception, 18th  International Congress and Exhibition on \nCondition Monitoring and Diagnostic Engineering Management (COMADEM \n2005), Cranfield, UK, August 31st – 2nd September 2005. \n99 L. Alfayez, D. Mba, G. Dyson The application of Acoustic Emission for \ndetecting incipient cavitation and the best efficiency point of a 60KW \n 55\ncentrifugal pump; case study. NDT & E International, Vol 38, no. 5, 354-358. \n2005.  \n100 L. Alfayez, D. Mba, Detection of incipient cavitation and determination of the \nbest efficiency point for centrifugal pumps using Acoustic Emission. Journal \nof Mechanical Process Engineering, Part E, IMechE, 2005.  \n101 J. Z. Sikorska and M.Hodkiewicz, Comparison of acoustic emission, vibration \nand dynamic pressure measurements for detecting change in flow conditions \non a centrifugal pump. 18th  International Congress and Exhibition on \nCondition Monitoring and Diagnostic Engineering Management (COMADEM \n2005), Cranfield, UK, August 31st – 2nd September 2005. \n102 Holroyd, T.J., Randall, N. & Lin, D. (1996). Acoustic Emission as a Means of \nDynamically Probing the Operation of Machines & Mechanisms. COMADEM \n1996. 529-536. 1 – 85075 – 635 - X \n103 Holroyd, T.J. & Brashaw, C. (1999). A Critical Appraisal of Monitoring \nElastic Waves as a Means of Detecting & Diagnosing Machine Faults. \nProceedings of COMADEM 1999. Coxmoor Publishing Co. UK. 491-497. 1 – \n901892 – 13 - 1 \n104 Holroyd, T.J. & Randall, N. (1993). Field Application of Acoustic Emission \nto Machinery Condition Monitoring. Proceedings of COMADEM 1993. \nUniversity of West of England, Bristol. 217-222. 1 – 871056 – 72 - 1 \n105 Gill, J.D., Brown, E.R., Twite, M., Horner, G., Reuben, R.L.  Steel, J.A. \n(1998). Monitoring of a Large Reciprocating Compressor. Proceedings of \nCOMADEM 1998. Monash University, Australia. 317-326. 0 – 7326 – 2027-9 \n 56\n106 Fog, T.L, Brown, E.R., Hanson, H.S., Madsen, L.B., Sørensen, P., Hansel, \nE.R., Steel, J.A., Reuben, R.L and Pedersen, P.S (1998). Proceedings of \nCOMADEM 1998. Monash University, Australia. 269-278. 0 – 7326 – 2027-9 \n107 Friis-Hausen, A. and Fog, T.L. (2001). Monitoring Exhaust Valve Leaks and \nMisfire in Marine Diesel Engines. Proceedings of COMADEM 2001. Elsevier, \nOxford. 641-648. 0 – 08 – 044036 - 3 \n108 El-Ghamry, M.H., Brown, E., Ferguson, I.G., Gill, J.D., Reuben, R.L., Steel, \nJ.A., Scaife, M. and Middleton, S. (1998). Gaseous Air-Fuel Quality \nIdentification for a Spark Ignition Gas Engine using Acoustic Emission \nAnalysis. Proceedings of COMADEM 1998. Monash University, Australia. \n235-244. 0 – 7326 – 2027 - 9 \n109 El-Ghamry, M., Steel, J.A.; Reuben, R.L.; Fog, T.L., Indirect measurement of \ncylinder pressure from diesel engines using acoustic emission, Mechanical \nSystems and Signal Processing, v 19(4),2005, 751-765. \n110 El-Ghamry, M.H., Reuben, R.L.; Steel, J.A., The development of automated \npattern recognition and statistical feature isolation techniques for the diagnosis \nof reciprocating machinery faults using acoustic emission, Mechanical \nSystems and Signal Processing, 17(4), 2003, 805-823. \n111 Steel, J.A. Reuben, R.L., Recent developments in monitoring of engines using \nacoustic emission, Journal of Strain Analysis for Engineering Design, 40(1), \n2005, 45-57. \n112 Mba, D., Applicability of acoustic emissions to monitoring the mechanical \nintegrity of bolted structures in low speed rotating machinery: case study. \nNDT and E International. Vol. 35, No. 5, pp. 293-300. 2002 \n 57\n113 Hanel, V.; Thelen, W. Monitoring screws under tensile load using acoustic \nemission analysis. Instrumentation and Measurement, IEEE Transactions, \nApril 1996 ; 45(2): 547 –550. \n114 Hanel, V.; Thelen, W. Acoustic Emission testing of bolted connections under \ntensile stress. 22nd European conference on Acoustic Emission Testing. The \nRobert Gordon University, Aberdeen. 29-31 May 1996;p 185-188. \n115 Hanel,V.;Thelen,W.   Determination of load condition of standard screws \nduring tensile tests using Acoustic Emission analysis. Instrumentation and \nMeasurement Technology Conference, 1995. IMTC\/95. Proceedings. \nIntegrating Intelligent Instrumentation and Control, IEEE 1995; p284. \n116 Smulders, A. and Loob, C. (1994). Machine Condition Monitoring using \nMulti-Parameter Measurements. Proceedings of COMADEM 1994. Tata \nMcGraw-Hill Publishing Co. India. 147- 152. 0 – 07 – 462360 - 5 \n117 Mba, D.U., Bannister, R.H., Leslie, J.T. & Findlay, G.E. (1996). Condition \nMonitoring of Low Speed Rotating Machinery. Proceedings of COMADEM \n1996. Sheffield Academic Press, Sheffield. 73-84. 1 – 85075 – 635 - X \n118 Mba, D. & Hall, L. (2001). Monitoring the Integrity of Low Speed Rotating \nMachines. COMADEM 2001. 697-707.0 – 08 – 04436 - 3 \n119 Holroyd, T.J. (2002). Simplifying the Condition Monitoring of Machines & \nStructures using Acoustic Emission. Proceedings of COMADEM 2002. \nCOMADEM International, Birmingham. 180-188. 0 – 9541307 – 0 – 7. \n"}