{"doi":"10.1029\/2008GL033545","coreId":"195730","oai":"oai:lra.le.ac.uk:2381\/7841","identifiers":["oai:lra.le.ac.uk:2381\/7841","10.1029\/2008GL033545"],"title":"Interplanetary magnetic field control of fast azimuthal flows in the nightside high-latitude ionosphere","authors":["Grocott, Adrian","Milan, Steve E.","Yeoman, Tim K."],"enrichments":{"references":[{"id":44716280,"title":"A decade of the Super Dual Auroral Radar Network (SuperDARN): Scientific achievements, new techniques and future directions,","authors":[],"date":"2007","doi":"10.1007\/s10712-007-9017-8","raw":"Chisham, G., et al. (2007), A decade of the Super Dual Auroral Radar Network (SuperDARN): Scientific achievements, new techniques and future directions, Surv. Geophys., 28, 33–109.","cites":null},{"id":44716293,"title":"A unifield model of the magnetotail convection in geomagnetically quiet and active times,","authors":[],"date":"1998","doi":"10.1029\/97ja01617","raw":"Nishida, A., T. Mukai, T. Yamamoto, S. Kokubun, and K. Maezawa (1998), A unifield model of the magnetotail convection in geomagnetically quiet and active times, J. Geophys. Res., 103, 4409–4418.","cites":null},{"id":44716279,"title":"Bursty bulk flows in the central plasma sheet,","authors":[],"date":"1992","doi":"10.1029\/91ja02701","raw":"Angelopoulos, V., W. Baumjohann, C. F. Kennel, F. V. Coroniti, M. G. Kivelson, R. Pellat, R. J. Walker, H. Lu¨hr, and G. Paschmann (1992), Bursty bulk flows in the central plasma sheet, J. Geophys. Res., 97, 4027–4039.","cites":null},{"id":44716292,"title":"Convection and auroral response to a southward turning of the IMF: Polar UVI, CUTLASS and IMAGE signatures of transient magnetic flux transfer at the magnetopause,","authors":[],"date":"2000","doi":"10.1029\/2000ja900022","raw":"Milan, S. E., M. Lester, S. W. H. Cowley, and M. Brittnacher (2000), Convection and auroral response to a southward turning of the IMF: Polar UVI, CUTLASS and IMAGE signatures of transient magnetic flux transfer at the magnetopause, J. Geophys. Res., 105, 15,741–15,775.","cites":null},{"id":44716282,"title":"DARN\/SuperDARN: A global view of the dynamics of high-latitude convection,","authors":[],"date":"1995","doi":"10.1007\/bf00751350","raw":"Greenwald, R. A., et al. (1995), DARN\/SuperDARN: A global view of the dynamics of high-latitude convection, Space Sci. Rev., 71, 761–796.","cites":null},{"id":44716283,"title":"Excitation of twin-vortex flow in the nightside highlatitude ionosphere during an isolated substorm,","authors":[],"date":"2002","doi":"10.5194\/angeo-20-1577-2002","raw":"Grocott, A., S. W. H. Cowley, J. B. Sigwarth, J. F. Watermann, and T. K. Yeoman (2002), Excitation of twin-vortex flow in the nightside highlatitude ionosphere during an isolated substorm, Ann. Geophys., 20, 1577–1601.","cites":null},{"id":44716296,"title":"Greenwald (2005), Dependencies of highlatitude plasma convection: Consideration of interplanetary magnetic field, seasonal, and universal time factors in statistical patterns,","authors":[],"date":null,"doi":"10.1029\/2004ja010815","raw":"Ruohoniemi, J. M., and R. A. Greenwald (2005), Dependencies of highlatitude plasma convection: Consideration of interplanetary magnetic field, seasonal, and universal time factors in statistical patterns, J. Geophys. Res., 110, A09204, doi:10.1029\/2004JA010815.","cites":null},{"id":44716286,"title":"Interhemispheric observations of the ionospheric signature of tail reconnection during IMF-northward non-substorm intervals,","authors":[],"date":"2005","doi":"10.5194\/angeo-23-1763-2005","raw":"Grocott, A., T. K. Yeoman, S. E. Milan, and S. W. H. Cowley (2005), Interhemispheric observations of the ionospheric signature of tail reconnection during IMF-northward non-substorm intervals, Ann. Geophys., 23, 1763–1770.","cites":null},{"id":44716284,"title":"Ionospheric flows and magnetic disturbance during extended intervals of northward but Bydominated IMF,","authors":[],"date":"2003","doi":"10.5194\/angeo-21-509-2003","raw":"Grocott, A., S. W. H. Cowley, and J. B. Sigwarth (2003), Ionospheric flows and magnetic disturbance during extended intervals of northward but Bydominated IMF, Ann. Geophys., 21, 509–538.","cites":null},{"id":44716298,"title":"Ionospheric plasma convection in the midnight sector for northward interplanetary magnetic field,","authors":[],"date":"1996","doi":"10.5636\/jgg.48.925","raw":"Taguchi, S., and R. A. Hoffman (1996), Ionospheric plasma convection in the midnight sector for northward interplanetary magnetic field, J. Geomagn. Geoelectr., 48, 925–933.  A. Grocott, S. E. Milan, and T. K. Yeoman, Department of Physics and Astronomy, University of Leicester, Leicester LE1 7RH, UK. (a.grocott@","cites":null},{"id":44716288,"title":"Kletzing (2007), Highlatitude plasma convection from Cluster EDI measurements: Method and IMF-dependence,","authors":[],"date":null,"doi":"10.5194\/angeo-25-239-2007","raw":"Haaland, S. E., G. Paschmann, M. Foerster, J. M. Quinn, R. B. Torbert, C. E. McIlwain, H. Vaith, P. A. Puhl-Quinn, and C. A. Kletzing (2007), Highlatitude plasma convection from Cluster EDI measurements: Method and IMF-dependence, Ann. Geophys., 25, 239–253.","cites":null},{"id":44716295,"title":"Large-scale imaging of highlatitude convection with Super Dual Auroral Radar Network HF radar observations,","authors":[],"date":"1998","doi":"10.1029\/98ja01288","raw":"Ruohoniemi, J. M., and K. B. Baker (1998), Large-scale imaging of highlatitude convection with Super Dual Auroral Radar Network HF radar observations, J. Geophys. Res., 103, 20,797–20,811.","cites":null},{"id":44716287,"title":"Multi-scale observations of magnetotail flux transport during IMF-northward nonsubstorm intervals,","authors":[],"date":"2007","doi":"10.5194\/angeo-25-1709-2007","raw":"Grocott, A., T. K. Yeoman, S. E. Milan, O. Amm, H. U. Frey, L. Juusola, R. Nakamura, C. J. Owen, H. Re`me, and T. Takada (2007), Multi-scale observations of magnetotail flux transport during IMF-northward nonsubstorm intervals, Ann. Geophys., 25, 1709–1720.","cites":null},{"id":44716290,"title":"Observations of significant flux closure by dual lobe reconnection,","authors":[],"date":"2007","doi":"10.5194\/angeo-25-1617-2007","raw":"Imber, S. M., S. E. Milan, and B. Hubert (2007), Observations of significant flux closure by dual lobe reconnection, Ann. Geophys., 25, 1617–1627.","cites":null},{"id":44716291,"title":"Observations of the response time of high latitude ionospheric convection to variations in the interplanetary magnetic field using EISCAT and IMP-8 data,","authors":[],"date":"1999","doi":"10.1007\/s005850050858","raw":"Khan, H., and S. W. H. Cowley (1999), Observations of the response time of high latitude ionospheric convection to variations in the interplanetary magnetic field using EISCAT and IMP-8 data, Ann. Geophys., 17, 1306– 1335.","cites":null},{"id":44716281,"title":"Plasma flow in the coupled magnetosphere-ionosphere system and its relationship to the substorm cycle,","authors":[],"date":"1998","doi":"10.1007\/978-94-011-4798-9_130","raw":"Cowley, S. W. H., H. Khan, and A. Stockton-Chalk (1998). Plasma flow in the coupled magnetosphere-ionosphere system and its relationship to the substorm cycle, in Substorms-4, edited by S. Kokobun and Y. Kamide, pp. 623–628, Terra Sci., Tokyo.","cites":null},{"id":44716294,"title":"Statistical study of high-latitude plasma flow during magnetospheric substorms,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-3607-2004","raw":"Provan, G., M. Lester, S. B. Mende, and S. E. Milan (2004), Statistical study of high-latitude plasma flow during magnetospheric substorms, Ann. Geophys., 22, 3607–3624.","cites":null},{"id":44716297,"title":"Strong sunward propagating flow bursts in the night sector during quiet solar wind conditions: SuperDARN and satellite observations,","authors":[],"date":"2002","doi":"10.5194\/angeo-20-771-2002","raw":"Senior, C., J.-C. Cerisier, F. Rich, M. Lester, and G. K. Parks (2002), Strong sunward propagating flow bursts in the night sector during quiet solar wind conditions: SuperDARN and satellite observations, Ann. Geophys., 20, 771–786.","cites":null},{"id":44716289,"title":"Substorm seasonal and solar cycle dependence, paper presented at","authors":[],"date":"2004","doi":null,"raw":"Hiebert, T., E. Donovan, and B. Jackel (2004). Substorm seasonal and solar cycle dependence, paper presented at 7th International Conference on Substorms, Finn. Meteorol. Inst., Levi.","cites":null},{"id":44716285,"title":"The influence of IMF By on the nature of the nightside highlatitude ionospheric flow during intervals of positive IMF","authors":[],"date":"2004","doi":"10.5194\/angeo-22-1755-2004","raw":"Grocott, A., S. V. Badman, S. W. H. Cowley, T. K. Yeoman, and P. J. Cripps (2004), The influence of IMF By on the nature of the nightside highlatitude ionospheric flow during intervals of positive IMF Bz, Ann.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-04-24","abstract":"SuperDARN radar data from both hemispheres for the interval January 1999 to November 2006 have been inspected for evidence of high-speed azimuthal flows in the nightside high-latitude ionosphere. In the northern hemisphere, 88% of the westward directed fast flows occurred during IMF BY negative intervals and 83% of the eastward flows occurred during IMF BY positive intervals. In the southern hemisphere 82% of the westward flows occurred during IMF BY positive intervals and 74% of the eastward flows occurred during IMF BY negative intervals. ∼74% of these fast flows occurred when the IMF was within the 30° < ∣  ∣ < 100° clock angle range and the AE index was below 150 nT. These results support the hypothesis that highly dynamic magnetospheric activitycan be associated with predominantly northward, but BY-dominated IMF driving conditions and subsequent non-substorm reconnection in a twisted magnetotail","downloadUrl":"http:\/\/www.agu.org\/pubs\/crossref\/2008\/2008GL033545.shtml.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7841\/3\/Interplanetary_magnetic_field_control_of_fast_azimuthal_....pdf","pdfHashValue":"942b724b5f50404d4ecd2b31896bf9b3fed5c2b6","publisher":"American Geophysical Union (AGU)","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7841<\/identifier><datestamp>\n                2015-12-14T17:38:01Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nInterplanetary magnetic field control of fast azimuthal flows in the nightside high-latitude ionosphere<\/dc:title><dc:creator>\nGrocott, Adrian<\/dc:creator><dc:creator>\nMilan, Steve E.<\/dc:creator><dc:creator>\nYeoman, Tim K.<\/dc:creator><dc:description>\nSuperDARN radar data from both hemispheres for the interval January 1999 to November 2006 have been inspected for evidence of high-speed azimuthal flows in the nightside high-latitude ionosphere. In the northern hemisphere, 88% of the westward directed fast flows occurred during IMF BY negative intervals and 83% of the eastward flows occurred during IMF BY positive intervals. In the southern hemisphere 82% of the westward flows occurred during IMF BY positive intervals and 74% of the eastward flows occurred during IMF BY negative intervals. ∼74% of these fast flows occurred when the IMF was within the 30° < ∣  ∣ < 100° clock angle range and the AE index was below 150 nT. These results support the hypothesis that highly dynamic magnetospheric activitycan be associated with predominantly northward, but BY-dominated IMF driving conditions and subsequent non-substorm reconnection in a twisted magnetotail.<\/dc:description><dc:date>\n2010-04-27T15:16:09Z<\/dc:date><dc:date>\n2010-04-27T15:16:09Z<\/dc:date><dc:date>\n2008-04-24<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nGeophysical Research Letters, 2008, 35, L08102.<\/dc:identifier><dc:identifier>\n0094-8276<\/dc:identifier><dc:identifier>\nhttp:\/\/onlinelibrary.wiley.com\/doi\/10.1029\/2008GL033545\/abstract<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7841<\/dc:identifier><dc:identifier>\n10.1029\/2008GL033545<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRadio and Space Plasma Physics<\/dc:relation><dc:rights>\nThis paper was published as Geophysical Research Letters, 2008, 35, L08102.  Copyright 2008 American Geophysical Union.  It is also available from http:\/\/www.agu.org\/pubs\/crossref\/2008\/2008GL033545.shtml.  Doi: 10.1029\/2008GL033545<\/dc:rights><dc:publisher>\nAmerican Geophysical Union (AGU)<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0094-8276","issn:0094-8276"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Radio and Space Plasma Physics"],"year":2008,"topics":[],"subject":["Article"],"fullText":"Interplanetary magnetic field control of fast azimuthal flows in the\nnightside high-latitude ionosphere\nA. Grocott,1 S. E. Milan,1 and T. K. Yeoman1\nReceived 5 February 2008; revised 18 March 2008; accepted 26 March 2008; published 24 April 2008.\n[1] SuperDARN radar data from both hemispheres for the\ninterval January 1999 to November 2006 have been\ninspected for evidence of high-speed azimuthal flows in\nthe nightside high-latitude ionosphere. In the northern\nhemisphere, 88% of the westward directed fast flows\noccurred during IMF BY negative intervals and 83% of the\neastward flows occurred during IMF BY positive intervals.\nIn the southern hemisphere 82% of the westward flows\noccurred during IMF BY positive intervals and 74% of the\neastward flows occurred during IMF BY negative intervals.\n\u000174% of these fast flows occurred when the IMF was\nwithin the 30\u0001 < jqj < 100\u0001 clock angle range and the\nAE index was below 150 nT. These results support the\nhypothesis that highly dynamic magnetospheric acti-\nvity can be associated with predominantly northward,\nbut BY-dominated IMF driving conditions and subsequent\nnon-substorm reconnection in a twisted magnetotail.\nCitation: Grocott, A., S. E. Milan, and T. K. Yeoman (2008),\nInterplanetary magnetic field control of fast azimuthal flows in\nthe nightside high-latitude ionosphere, Geophys. Res. Lett., 35,\nL08102, doi:10.1029\/2008GL033545.\n1. Introduction\n[2] Understanding large-scale magnetospheric dynamics\nis crucial if we are to develop a complete picture of the\ncoupled solar-terrestrial system. It is already known that the\ninterplanetary magnetic field (IMF) plays a significant role\nin controlling the nature of convection in the magnetosphere\nand ionosphere. The steady state pictures in particular have\nbeen derived from radar data [Ruohoniemi and Greenwald,\n2005] and satellite data [Haaland et al., 2007] for different\norientations and strengths of the upstream IMF. These\nstudies have revealed the IMF BY asymmetry between dusk\nand dawn, as well as the existence of reverse convection for\nnorthward IMF. The time dependence of this convection has\nalso been discussed, with observations of dayside convec-\ntion during southward IMF [e.g., Milan et al., 2000] and\nnorthward IMF [e.g., Imber et al., 2007] being considered in\nsome detail. On the nightside it is largely considered that\nmagnetospheric substorms drive the major large-scale com-\nponent of the convection [e.g., Cowley et al., 1998], and\nrecent studies by, for example, Grocott et al. [2002] and\nProvan et al. [2004] have revealed that, for southward IMF\nat least, this is indeed the case. However, exactly how the\nbehavior of the magnetotail during northward IMF fits into\nthis large-scale picture is not so clear.\n[3] Recently, a nightside component of magnetospheric\nconvection has been discussed [e.g., Senior et al., 2002;\nGrocott et al., 2003, 2007] which consists of large-scale\nbursts of fast azimuthal flow across the midnight sector\nionosphere and associated bursty bulk flows (BBFs)\n[Angelopoulos et al., 1992] in the magnetotail. These\nazimuthal flow bursts are observed to occur more commonly\nduring prolonged intervals of northward IMF and recur on\ntimescales of tens of minutes with associated modest con-\ntractions of the polar cap (equating to flux closure rates of\n\u000130–50 kV). They are not, however, associated with any\nsubstorm activity and are therefore interpreted as the iono-\nspheric signatures of reconnection and flux transport in the\nmore distant tail. They have consequently been termed\nTRINNIs (tail reconnection during IMF-northward, non-\nsubstorm intervals). A mechanism for the flux transport\nassociated with this phenomenon was proposed by Grocott\net al. [2007] after further case studies revealed both IMF BY\nand interhemispheric related asymmetries [Grocott et al.,\n2004, 2005]. Based on earlier work by Taguchi and Hoffman\n[1996] and Nishida et al. [1998], their results explain the\nobserved asymmetries in terms of the reconfiguration of a\ntwisted tail, itself caused by a modest, but persistent, level of\ndayside reconnection between the terrestrial field and a\nnorthward, but BY-dominated IMF.\n[4] Whist it is clear, therefore, that TRINNIs are an\nextremely important mechanism for flux transport in the\ntail, individual case studies alone cannot reveal any general\ntrends regarding their significance and phenomenology. In\nthe present study a statistical approach is taken in which\nradar data from an 8 year interval spanning 1999 to 2006\nhave been inspected for evidence of fast azimuthal flows in\nthe nightside ionosphere in order to determine whether there\nis a general tendency for flows of this nature to adhere to the\ncharacteristics of TRINNIs previously identified. The\nresults reveal that during these 8 years such flows persisted\nfor approximately 3% of the time, with \u000180% having a\ndirection consistent with the orientation of IMF BY.\nApproximately 74% occurred when the IMF clock angle\nwas in the 30\u0001 < jqj < 100\u0001 range and the AE index was\nbelow 150 nT. A superposed epoch analysis of the nightside\nconvection patterns reveals that eastward-type flows appear\nto be associated with a more distorted pattern than west-\nward-type flows, irrespective of hemisphere (or, therefore,\nIMF orientation) and that IMF BY-negative intervals appear\nto produce stronger nightside convection than BY-positive\nintervals. These results are discussed in more detail below.\n2. Data Selection\n[5] This study is based on an analysis of the nightside\nhigh-latitude ionospheric flows, provided by the Super Dual\nGEOPHYSICAL RESEARCH LETTERS, VOL. 35, L08102, doi:10.1029\/2008GL033545, 2008\nClick\nHere\nfor\nFull\nArticle\n1Department of Physics and Astronomy, University of Leicester,\nLeicester, UK.\nCopyright 2008 by the American Geophysical Union.\n0094-8276\/08\/2008GL033545$05.00\nL08102 1 of 5\nAuroral Radar Network (SuperDARN), from the eight year\ninterval January 1999 to November 2006. The SuperDARN\nnetwork of HF radars provides almost continuous measure-\nments of ionospheric convection velocities in the auroral\nregions of both hemispheres [Greenwald et al., 1995;\nChisham et al., 2007] and this facilitates the routine\nproduction of large scale maps of the high-latitude convec-\ntion using the ‘‘Map Potential’’ technique [Ruohoniemi and\nBaker, 1998]. However, in order to facilitate a study of such\na large volume of data (the 8 year interval studied here\nconsists of literally millions of 2-minute convection maps\nfor each hemisphere) a reduced statistical database has been\nderived from the results of the full Map Potential analysis.\nThis database consists of values of the convection velocity\n(and associated information on data coverage) for 40 loca-\ntions evenly distributed over the polar cap, along with\ninformation on the upstream interplanetary magnetic field\n(IMF) from the MAG instrument [Smith et al., 1999] on\nboard the ACE spacecraft [Stone et al., 1998], which has\nbeen propagated to the dayside ionosphere via the method\ndescribed by Khan and Cowley [1999]. The velocity is\nderived for the centre point of a set of boxes, the locations\nof which are fixed in magnetic local time (MLT) but are\nscaled in magnetic latitude according to the overall size of\nthe convection pattern. In other words, the lowest latitude\nboxes are located at the equatorward boundary of the\nconvection pattern (lat0), with a further three sets of boxes\nat latitudes evenly distributed between lat0 and the pole. The\nboxes themselves delimit the area in which ‘‘local’’ data\ncoverage is defined.\n[6] Three of these statistical boxes from the lowest\nlatitude range (at magnetic local times of 22:40, 00:00\nand 01:20) can be seen in Figure 3a, which compares an\nexample symmetrical flow pattern (left panel) with a flow\npattern from a previously identified TRINNI event (right\npanel), the most obvious feature of the latter being the band\nof fast azimuthal flow across the midnight meridian. Inter-\nvals have then been selected based on the velocities from\nthese 3 locations and the criteria that (1) there were at least\n2 data points in each box, (2) the east-west flow velocity\nwas in excess of 400 m s\u00031 at midnight and 300 m s\u00031 at the\ntwo adjacent points and (3) the east-west component of\nthe flow was in the same direction for all three points. Of\nthe \u00018 years of convection maps available, 6826 (3473)\nhours of data surveyed in the northern (southern) hemi-\nsphere (10% and 5%, respectively) met criterion 1, and\n183 h (103 h) met criteria 2 and 3. These data and their\nfurther analysis are described below.\n3. Statistical Results\n3.1. IMF Control of Fast Nightside Flows\n[7] To date, the factor most associated with controlling\nTRINNI activity is the orientation of the IMF. Figure 1\ntherefore presents the occurrence statistics of the high-speed\nionospheric flows, with their velocities plotted vs. IMF\nclock angle for the northern (top panels) and southern\n(bottom panels) hemispheres. Here, the clock angle is\ndefined as the angle between the IMF vector (projected into\nthe y-z plane) and the z-direction, such that 0\u0001 clock angle\ncorresponds to a transverse field purely in the +z direction\n(northward), ±90\u0001 to ±y (respectively), and ±180\u0001 to\n\u0003z (southward). The mean IMF vector from the 2 hours\nprior to each interval is used to (1) remove rapid fluctua-\ntions in the data, (2) account for the uncertainty in propa-\ngating the ACE observations to the ionosphere and (3)\nallow for some delay ‘through’ the magnetosphere to the\nnightside ionosphere. The left-hand panels show the fast\nwestward flows and the right-hand panels show the fast\neastward flows. The occurrences are then scaled according\nto the bar shown at the bottom of each panel.\n[8] The data presented in Figure 1 reveal that the fastest\nflow speeds observed were around 1200 m s\u00031, with the\nmajority being under 800 m s\u00031. These high-occurrence\npopulations show a clear IMF clock angle dependence,\nwhich reveals that in the northern hemisphere, 88% of the\nFigure 1. IMF clock angle vs. the eastward component of the ionospheric velocity from the central box location\n(in Figure 3a) for westward (left-hand side) and eastward (right-hand side) fast flows in the northern and southern\nhemispheres. The occurrence of the flows is scaled according to the bars at the bottom.\nL08102 GROCOTT ET AL.: FAST FLOWS IN THE NIGHTSIDE IONOSPHERE L08102\n2 of 5\nwestward directed fast flows occurred during IMF BY\nnegative intervals and 83% of the eastward flows occurred\nduring IMF BY positive intervals whilst in the southern\nhemisphere, 82% of the westward flows occurred during\nIMF BY positive intervals and 74% of the eastward flows\noccurred during IMF BY negative intervals. It is interesting\nto note that the westward flows appear to be more consistent\nwith IMF orientation than the eastward flows (as well as\nbeing more common in general, by approximately 5:4). This\nmay be related to the differences between the eastward- and\nthe westward-type flow patterns discussed in section 3.3.\nThe southern hemisphere flows also appear to be less\nconsistent with IMF orientation than northern hemisphere\nflows, as well as having generally lower occurrences,\nalthough this could be due to the different coverage,\nlocations, and pointing directions of the radars contributing\ndata in each case. There are then much smaller populations\nof examples which appear to exhibit the opposite IMF BY\nrelationship, with a general trend towards very low velo-\ncities only for very strongly northward IMF. Of greatest\nsignificance, however, is the fact that the largest populations\nand the fastest flows occur during intervals of IMF clock\nangle 30\u0001 < jqj < 100\u0001, i.e. predominantly during intervals\nof positive IMF BZ. This suggests that not all modes of\nmagnetospheric activity are strongest when the IMF is\nsouthwards.\n3.2. Solar Cycle and Seasonal Dependence\n[9] The data available for this study span the declining\nphase of the last solar cycle, thus enabling a rudimentary\ncomparison with solar activity to be made. Figure 2a\ntherefore presents the occurrence of fast flows vs. year\n(solid lines), again separated by hemisphere and east-west\nflow direction. Because the amount of HF radar backscatter\nis variable, a ‘‘good radar intervals’’ parameter (henceforth\nreferred to as ‘GRI’) has been defined as the number of\nintervals satisfying criterion 1 in section 2, to put the fast\nflow occurrence variability into context. This is represented\nin Figure 2a by the dotted lines (normalized, and scaled to\nthe plot y-axes) with the fast-flow occurrence scaled to GRI\nshown by the dashed lines. An initial inspection suggests\nthat the flows are indeed dependent on solar cycle, with\ntheir occurrence decreasing in general between the year\n2000 (the last solar maximum) and 2006. Although the GRI\nalso decreases during this period, the scaled flow occurrence\nsuggests that there is still some decline in the number of fast\nflow intervals towards solar minimum. A possible explana-\ntion for this could be related to coronal mass ejections\n(CMEs), which are more common during solar maximum\nand are associated with stable IMF conditions which could\nbe a prerequisite for this mode of non-substorm magneto-\nspheric dynamics. This would also be consistent with the\nFigure 2. The occurrence of fast flows vs. (a) year and (b) month for westward and eastward directions in the northern and\nsouthern hemispheres (solid lines). In each case the corresponding variation in radar data coverage (normalized, and scaled\nto the plot y-axis) is indicated by the dotted line and the fast-flow occurrence scaled by the level of radar data coverage is\nindicated by the dashed line. In Figure 2b mean monthly values of IMF BYare also shown (dot-dash line) scaled to the y-axis\non the right-hand side of the plots.\nL08102 GROCOTT ET AL.: FAST FLOWS IN THE NIGHTSIDE IONOSPHERE L08102\n3 of 5\nfact that substorms have been shown to be less frequent\nduring solar maximum [e.g., Hiebert et al. 2004]. A fuller\ninvestigation of the influence of solar activity on magneto-\nspheric dynamics is certainly warranted, however, this is\nbeyond the scope of the present study.\n[10] The seasonal dependence of the flows is illustrated in\nFigure 2b, which presents their occurrence vs. month in the\nsame format as Figure 2a, but also shows the monthly mean\nvariability of IMF BY (dot-dash lines) scaled to the y-axes\non the right-hand side of the plots. If we consider first the\noccurrence of westward flows in the northern hemisphere\nthere is a striking anti-correlation with GRI, with the\nmajority of the flows occurring during the winter months,\ndespite this being when the least GRIs are observed.\nEastward flows in the same hemisphere, however, exhibit\na different trend with a peak at spring equinox and a\nsecondary peak in the autumn, more resembling the varia-\ntion in GRI. In the southern hemisphere the trend in GRI\ndiffers from the northern hemisphere, having peaks at\nequinox. The main peaks in southern hemisphere flows\nare then somewhat out of phase with the GRI, being post-\nspring equinox for westward flows and pre-autumn equinox\nfor eastward flows.\n[11] The peaks near equinox can be largely explained by\nconsidering the seasonal variation of IMF BY (dot-dash\nlines). Positive BY peaks primarily at spring equinox, which\ncould explain the peaks in northern hemisphere eastward\nflows and southern hemisphere westward flows, although\nthis does not address why they lag the BY peaks by\n\u00012 months. Negative BY peaks at the same time as the\nsouthern hemisphere eastward flows as might be expected,\nbut the winter peak in northern hemisphere westward flows\ndoes not seem to correlate with IMF BY. This winter peak\nfor northern hemisphere westward flows (and the 2-hour lag\ntowards summer associated with the BY-positive flows\nmentioned above) could, however, be related to the fact\nthat the statistical convection pattern for negative BY is most\nasymmetrical during winter whereas that for positive BY\nis most asymmetrical during summer [Ruohoniemi and\nGreenwald, 2005].\n3.3. Statistical Convection Patterns\n[12] To illustrate the generic convection patterns associ-\nated with these fast flow events, the full radar datasets have\nbeen binned according to hemisphere, and whether they\nrevealed eastward or westward flow and then processed into\nfour single convection maps using the Map Potential\nanalysis. In order to minimize the ‘‘contamination’’ by\npossibly misidentified events only intervals which fall into\nthe 30\u0001 < jqj < 100\u0001 regime have been used. The nightside\nsectors of these convection patterns are presented in\nFigure 3b and a number of features are evident. Firstly,\nwestward flow intervals appear to be dominated by a single,\nlarge, dusk convection cell with essentially stagnant flow at\nFigure 3. Streamlines and flow vectors of ionospheric convection patterns derived from SuperDARN velocity\nmeasurements. These data are shown on geomagnetic latitude-MLT grids, with midnight at the bottom and dusk to the left.\n(a) (left) A ‘typical’ symmetrical convection pattern and (right) a typical TRINNI convection pattern. The three boxes in the\nmidnight sector indicate the regions which contribute to the statistical data used in the study. (b) Average nightside\nionospheric convection patterns derived using radar data from all of the fast flow intervals. The arrow in the bottom left\nindicates the average magnitude and orientation of the interplanetary magnetic field in the Y-Z plane.\nL08102 GROCOTT ET AL.: FAST FLOWS IN THE NIGHTSIDE IONOSPHERE L08102\n4 of 5\ndawn. Eastward flow intervals on the other hand, retain a\ntwin-cell pattern, but one with a considerable dusk-dawn\nasymmetry. This is in agreement with the statistical nature\nof ionospheric convection in general which shows that the\nBY-asymmetric convection pattern is more asymmetric\nwhen the dawn cell spans midnight than when the dusk\ncell does, irrespective of hemisphere (and hence the sign of\nIMF BY). Secondly, dawn cell flows appear to be more\nintense, with the fast flows reversing further pre-midnight\nthan the dusk cell flows do pre-midnight.\n3.4. Relationship to Substorms\n[13] The results discussed above suggest that these fast\nazimuthal flows are in general consistent with previous\nobservations of TRINNIs. However, whilst their tendency\nto occur when the IMF is northward suggests an association\nwith non-substorm intervals, a rudimentary inspection of the\nlevels of auroral activity has been performed as an addi-\ntional check. It is found that the mean (median) AE for the\nintervals is 118(90) nT, with \u000174 % of the flows occurring\nwhen AE < 150 nT. It is therefore reasonable to conclude\nthat in a statistical sense these fast flows are not associated\nwith major substorm activity.\n4. Conclusions\n[14] This paper has investigated the nature of fast azimuthal\nflows in the nightside high-latitude ionosphere which have\npreviously been associated with intervals of northward, but\nBY-dominated IMF. It is found that the direction of the\nflows is generally consistent with the orientation of IMF BY,\nsuch that in the northern (southern) hemisphere the flows\nare eastward (westward) for positive IMF BY and westward\n(eastward) for negative IMF BY. Significantly, the largest\npopulations and the fastest flows occurred during intervals\nof IMF clock angle 30\u0001 < jqj < 100\u0001 (i.e. predominantly\nduring intervals of positive IMF BZ) and \u000174 % of the\nflows occurred during intervals of AE < 150 nT. This\nassociation with predominantly northward IMF and low\nauroral activity is consistent with previous observations of\nTRINNIs. This implies that, whilst the magnetosphere may\nwell be highly active during intervals of southward IMF and\nsubstorm activity, there is also a highly dynamic mode of\nconvection in play during more northward IMF intervals,\nand that the magnetosphere is far from ‘quiet’ under such\nconditions.\n[15] Acknowledgments. We would like to thank the PIs of the\nSuperDARN radars for provision of the radar data, R. J. Barnes of the\nJohns Hopkins University for the ‘Map-Potential’ algorithm software, and\nNorman Ness and Charles Smith of the Bartol Research Institute for the\nACE magnetometer data. AG was supported during this study by STFC\ngrant PP\/E000983\/1. SuperDARN operations at the University of Leicester\nare supported by STFC grant PP\/E007929\/1.\nReferences\nAngelopoulos, V., W. Baumjohann, C. F. Kennel, F. V. Coroniti, M. G.\nKivelson, R. Pellat, R. J. Walker, H. Lu¨hr, and G. Paschmann (1992),\nBursty bulk flows in the central plasma sheet, J. Geophys. Res., 97,\n4027–4039.\nChisham, G., et al. (2007), A decade of the Super Dual Auroral Radar\nNetwork (SuperDARN): Scientific achievements, new techniques and\nfuture directions, Surv. Geophys., 28, 33–109.\nCowley, S. W. H., H. Khan, and A. Stockton-Chalk (1998). Plasma flow in\nthe coupled magnetosphere-ionosphere system and its relationship to the\nsubstorm cycle, in Substorms-4, edited by S. Kokobun and Y. Kamide,\npp. 623–628, Terra Sci., Tokyo.\nGreenwald, R. A., et al. (1995), DARN\/SuperDARN: A global view of the\ndynamics of high-latitude convection, Space Sci. Rev., 71, 761–796.\nGrocott, A., S. W. H. Cowley, J. B. Sigwarth, J. F. Watermann, and T. K.\nYeoman (2002), Excitation of twin-vortex flow in the nightside high-\nlatitude ionosphere during an isolated substorm, Ann. Geophys., 20,\n1577–1601.\nGrocott, A., S. W. H. Cowley, and J. B. Sigwarth (2003), Ionospheric flows\nand magnetic disturbance during extended intervals of northward but By-\ndominated IMF, Ann. Geophys., 21, 509–538.\nGrocott, A., S. V. Badman, S. W. H. Cowley, T. K. Yeoman, and P. J. Cripps\n(2004), The influence of IMF By on the nature of the nightside high-\nlatitude ionospheric flow during intervals of positive IMF Bz, Ann.\nGeophys., 22, 1755–1764.\nGrocott, A., T. K. Yeoman, S. E. Milan, and S. W. H. Cowley (2005),\nInterhemispheric observations of the ionospheric signature of tail recon-\nnection during IMF-northward non-substorm intervals, Ann. Geophys.,\n23, 1763–1770.\nGrocott, A., T. K. Yeoman, S. E. Milan, O. Amm, H. U. Frey, L. Juusola,\nR. Nakamura, C. J. Owen, H. Re`me, and T. Takada (2007), Multi-scale\nobservations of magnetotail flux transport during IMF-northward non-\nsubstorm intervals, Ann. Geophys., 25, 1709–1720.\nHaaland, S. E., G. Paschmann, M. Foerster, J. M. Quinn, R. B. Torbert, C. E.\nMcIlwain, H. Vaith, P. A. Puhl-Quinn, and C. A. Kletzing (2007), High-\nlatitude plasma convection from Cluster EDI measurements: Method and\nIMF-dependence, Ann. Geophys., 25, 239–253.\nHiebert, T., E. Donovan, and B. Jackel (2004). Substorm seasonal and solar\ncycle dependence, paper presented at 7th International Conference on\nSubstorms, Finn. Meteorol. Inst., Levi.\nImber, S. M., S. E. Milan, and B. Hubert (2007), Observations of significant\nflux closure by dual lobe reconnection, Ann. Geophys., 25, 1617–1627.\nKhan, H., and S. W. H. Cowley (1999), Observations of the response time\nof high latitude ionospheric convection to variations in the interplanetary\nmagnetic field using EISCAT and IMP-8 data, Ann. Geophys., 17, 1306–\n1335.\nMilan, S. E., M. Lester, S. W. H. Cowley, and M. Brittnacher (2000),\nConvection and auroral response to a southward turning of the IMF:\nPolar UVI, CUTLASS and IMAGE signatures of transient magnetic flux\ntransfer at the magnetopause, J. Geophys. Res., 105, 15,741–15,775.\nNishida, A., T. Mukai, T. Yamamoto, S. Kokubun, and K. Maezawa (1998),\nA unifield model of the magnetotail convection in geomagnetically quiet\nand active times, J. Geophys. Res., 103, 4409–4418.\nProvan, G., M. Lester, S. B. Mende, and S. E. Milan (2004), Statistical\nstudy of high-latitude plasma flow during magnetospheric substorms,\nAnn. Geophys., 22, 3607–3624.\nRuohoniemi, J. M., and K. B. Baker (1998), Large-scale imaging of high-\nlatitude convection with Super Dual Auroral Radar Network HF radar\nobservations, J. Geophys. Res., 103, 20,797–20,811.\nRuohoniemi, J. M., and R. A. Greenwald (2005), Dependencies of high-\nlatitude plasma convection: Consideration of interplanetary magnetic\nfield, seasonal, and universal time factors in statistical patterns, J. Geo-\nphys. Res., 110, A09204, doi:10.1029\/2004JA010815.\nSenior, C., J.-C. Cerisier, F. Rich, M. Lester, and G. K. Parks (2002), Strong\nsunward propagating flow bursts in the night sector during quiet solar\nwind conditions: SuperDARN and satellite observations, Ann. Geophys.,\n20, 771–786.\nSmith, C. W., M. H. Acun˜a, L. F. Burlaga, J. L’Heureux, N. F. Ness, and\nJ. Scheifele (1999), The ACE Magnetic Field Experiment, Space Sci.\nRev., 86, 613–622.\nStone, E. C., A. M. Frandsen, R. A. Mewaldt, E. R. Christian, D. Margolies,\nJ. F. Ormes, and F. Snow (1998), The Advanced Composition Explorer,\nSpace Sci. Rev., 86, 1–22.\nTaguchi, S., and R. A. Hoffman (1996), Ionospheric plasma convection\nin the midnight sector for northward interplanetary magnetic field,\nJ. Geomagn. Geoelectr., 48, 925–933.\n\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\nA. Grocott, S. E. Milan, and T. K. Yeoman, Department of Physics and\nAstronomy, University of Leicester, Leicester LE1 7RH, UK. (a.grocott@\nion.le.ac.uk)\nL08102 GROCOTT ET AL.: FAST FLOWS IN THE NIGHTSIDE IONOSPHERE L08102\n5 of 5\n"}