{"doi":"10.1103\/PhysRevB.73.085104","coreId":"100981","oai":"oai:epubs.surrey.ac.uk:382","identifiers":["oai:epubs.surrey.ac.uk:382","10.1103\/PhysRevB.73.085104"],"title":"Surface plasmon polaritons in generalized slab heterostructures with negative permittivity and permeability","authors":["Tsakmakidis, KL","Hermann, C","Klaedtke, A","Jamois, C","Hess, O"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-02-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMERICAN PHYSICAL SOC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:382<\/identifier><datestamp>\n      2017-10-31T13:58:00Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/382\/<\/dc:relation><dc:title>\n        Surface plasmon polaritons in generalized slab heterostructures with negative permittivity and permeability<\/dc:title><dc:creator>\n        Tsakmakidis, KL<\/dc:creator><dc:creator>\n        Hermann, C<\/dc:creator><dc:creator>\n        Klaedtke, A<\/dc:creator><dc:creator>\n        Jamois, C<\/dc:creator><dc:creator>\n        Hess, O<\/dc:creator><dc:publisher>\n        AMERICAN PHYSICAL SOC<\/dc:publisher><dc:date>\n        2006-02-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/382\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Tsakmakidis, KL, Hermann, C, Klaedtke, A, Jamois, C and Hess, O  (2006) Surface plasmon polaritons in generalized slab heterostructures with negative permittivity and permeability   PHYSICAL REVIEW B, 73 (8), ARTN 0.       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevB.73.085104<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/382\/","10.1103\/PhysRevB.73.085104"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Surface plasmon polaritons in generalized slab heterostructures with negative permittivity\nand permeability\nKosmas L. Tsakmakidis, Christian Hermann, Andreas Klaedtke, Cécile Jamois, and Ortwin Hess\nAdvanced Technology Institute, School of Electronics and Physical Sciences, University of Surrey, Guildford, GU2 7XH, United Kingdom\n\u0001Received 6 September 2005; revised manuscript received 2 December 2005; published 9 February 2006\u0002\nWe present a detailed analytical study of surface plasmon polaritons \u0001SPPs\u0002 in generalized asymmetric slab\nwaveguides with a core of negative permittivity and permeability. Profiting from the duality principle, we\nconfine ourselves to the analysis of p-polarized \u0001TM\u0002 SPP eigenmodes, which also occur in thin metallic films.\nIt is shown that the left-handed \u0001LH\u0002 structures considered here support a richer variety of SPPs when\ncompared to their metallic counterparts. Depending on the refractive index distribution, the permittivity of each\nmedium and the thickness of the core, a total of 30 solutions to the involved characteristic equation are\nidentified in a unified manner and classified systematically. In order to identify conclusively all SPPs, we\nfollow an analytical methodology based directly on the solution constraints inherent in the associated transcen-\ndental equation. This treatment reveals striking features of the formed SPP eigenmodes, such as the existence\nof “supermodes” when no SPP is supported at one of the slab interfaces. Moreover, our study reveals the\nopening of gaps in the SPP dispersion diagrams, occurrence of monomodal propagation for specific choices of\nthe material parameters, presence of SPPs with no cutoff thickness and coexistence of three eigenmodes, with\ndouble mode-degeneracy points occurring twice. The eigenmodes with negative energy flux that give rise to\nnegative group velocity are identified via a closed-form expression for the time-averaged power flow P in the\nguide. For each eigenmode, we examine the variation of P with the reduced slab thickness and discuss key\nfeatures of the effective index geometric dispersion diagram, most of which are unique to the generalized\nstructures studied herein.\nDOI: 10.1103\/PhysRevB.73.085104 PACS number\u0001s\u0002: 41.20.Jb, 42.82.Et, 78.20.Ci\nI. INTRODUCTION\nStructures exhibiting negative permittivity and permeabil-\nity were first analyzed around 40 years ago by Veselago.1 He\ncoined for their description the term “left-handed \u0001LH\u0002 ma-\nterials” to stress that the electric field E, the magnetic field\nH, and the wave vector k of a monochromatic plane wave\ninside such materials form a left-handed triplet. Veselago hy-\npothesized that a material of this kind could exist without\ncontradicting any of the fundamental laws of physics and he\nshowed that it would posses striking electromagnetic proper-\nties, such as inverse Doppler shift, antiparallel phase and\ngroup velocities, backward power flow, and negative refrac-\ntion. Critical issues, such as the actual occurrence of negative\nrefraction2 and the possibility to enhance the evanescent\nwaves,3,4 have been elucidated lately in a series of\ntheoretical,5 numerical,6 and experimental7 investigations.\nHow to construct these metamaterials was not known un-\ntil recently due to the absence of naturally occurring or arti-\nficial materials with negative magnetic permeability. Practi-\ncal suggestions of how LH media could be realized\nexperimentally were first given in a series of works by Pen-\ndry et al.,8 who also predicted theoretically that these media\ncould be used for the creation of a “perfect lens.” After these\ninsights, the physical construction of a composite LH struc-\nture has been demonstrated by Shelby et al.,9 and the possi-\nbility of achieving subwavelength resolution of an object\nwith the same structures has been shown with further\nexperiments.10\nThe perfect-lens action mentioned before relies critically\non the amplification of an object’s near field in a surface\nwave \u0001SW\u0002-like manner inside a LH slab. Due to momentum\nmismatch, radiative waves cannot couple directly to the\nformed SWs \u0001or surface polaritons\u0002 at the interfaces of the\nslab with positive-index media. Pendry, however, showed\nthat the near field of an object, which describes its finest\nfeatures and decays exponentially away form the source\n\u0001evanescent\u0002, can couple to an exponentially increasing field\ninside the LH slab that decays similarly on the other side.\nThe whole field pattern resembles that of a surface polariton,\nalthough the proof of its existence for the particular sym-\nmetrical structure considered by Pendry was not given in\nRef. 3, as well as in other more detailed analyses.11\nGeneralizations of these studies were investigations of\nasymmetric LH slab configurations for lensing,12 sensoring\nand directional coupling13 applications. In both cases, the\nrole of the coupled surface polaritons at the two interfaces of\nthe slab waveguide was shown to be of crucial importance.\nFor the first class of applications, the asymmetry helped to\nimprove the limit imposed on the image resolution by the\nlosses of the core. For the second class it improved the am-\nplification of the evanescent waves in the device-working\nregion, leading to enhanced performance.\nIt is the purpose of this paper to identify and classify all\nsurface plasmon14 polariton \u0001SPP\u0002 eigenmodes supported by\ngeneralized asymmetric slab heterostructures. To this end, a\nrigorous analytical study is pursued that proves that a total of\n30 solutions to the involved characteristic equation giving\nthe SPP eigenmodes can exist for all choices of the refractive\nindex distribution, constitutive parameters \u0001 and \u0002, and the\nthickness of the core. Such an approach is essential,15 par-\nticularly for the investigation of asymmetric slab configura-\nPHYSICAL REVIEW B 73, 085104 \u00012006\u0002\n1098-0121\/2006\/73\u00018\u0002\/085104\u000111\u0002\/$23.00 ©2006 The American Physical Society085104-1\ntions, because the graphical methodologies that have been\nproposed in the past for the modal analysis of LH\nwaveguides12 did not reveal all SPP eigenmodes. A suitably\nmodified form of the associated transcendental equation, de-\nrived from macroscopic electrodynamics using the well-\nknown boundary conditions for the tangential electric and\nmagnetic-field components, obviates this limitation and al-\nlows an analytical, unified treatment. We will confine our-\nselves to the discussion of the geometric dispersion \u0001SPP\neffective index versus reduced slab thickness\u0002 since negative\nmaterial parameters occur near resonances; hence, all experi-\nmental realizations of LH materials considered thus far were\nfor narrowbands. In addition, all transmission \u0001lensing\u0002\nanalyses of LH slab heterostructures, as well as investiga-\ntions of asymmetric LH \u0001Ref. 13\u0002 and metallic15,16 films in\nthe past, involved mainly monochromatic waves. All the im-\nportant modal features, such as the number and classification\nof modes, number and kind of cutoffs, field enhancement,\nphase reversal, and possible double mode-degeneracy occur-\nrence, can be derived in a clear and conclusive way follow-\ning this methodology.\nThe organization of the paper is the following. Section II\nwill make some introductory remarks regarding SPP waves\nat a single interface between a right-handed \u0001RH\u0002 and a LH\nmaterial. Emphasis is given on the conditions for the exis-\ntence of such waves, as these are used later when the effects\nof retardation are taken into account. Section III is devoted to\nthe discussion of the SPP eigenmodes supported by an asym-\nmetric slab waveguide with a negative refractive index core.\nFollowing a macroscopic analysis, the LH waveguide is\ntreated as a boundary value problem. Special solutions of the\nscalar wave equation are sought, subject to boundary condi-\ntions, to obtain the characteristic equation of the SPP eigen-\nmodes. From the restrictions inherent in this equation, which\ndepend on the refractive index distribution, we identify all\nsupported SPP eigenmodes and classify them as forward or\nbackward propagating via a closed-form expression for the\ntotal power flow P in the guide. Finally, Sec. IV summarizes\nthe paper presenting the main conclusions of the present\nstudy.\nII. SURFACE PLASMON POLARITONS AT A PLANE\nLH\/RH INTERFACE\nThe negative permittivity and permeability of a left-\nhanded medium \u0001LHM\u0002 allows the existence of surface\nwaves \u0001SWs\u0002, also called surface polaritons \u0001SPs\u0002, at the in-\nterface with a right-handed medium \u0001RHM\u0002.17 In order to\ninvestigate these solutions and derive the conditions for their\nexistence, we consider the geometry illustrated in Fig. 1.\nHere both media are considered to be semi-infinite,\nhomogeneous11 and isotropic.18 Medium 1 has negative rela-\ntive permittivity \u0001r1=−\u0001r1p\u00030 and permeability \u0002r1=−\u0002r1p\n\u00030, whereas in medium 2 we assume \u0001r2\u00040 and \u0002r2\u00040.\nThe coordinate axes are chosen so that the z axis is directed\nalong the SP propagation and the x axis is perpendicular to\nthe media interface.\nIn what follows, we will examine p-polarized \u0001TM\u0002 SP\nwaves that exist due to the change in the sign of the permit-\ntivities. Analogous results can be obtained for s-polarized\n\u0001TE\u0002 waves, following a dual analysis. The following rela-\ntions describe the field components tangential to the interface\nof the media \u0001in SI units\u0002:\nd2Hy\ndx2\n+ \u0001\u0001r\u0002rk0\n2\n− \u00052\u0002Hy = 0, \u00011a\u0002\nEz = −\nj\n\u0006\u0001\n\u0001Hy\n\u0001x\n. \u00011b\u0002\nInside the LH medium, Eq. \u00011a\u0002 becomes\nd2Hy\ndx2\n− \u0001\u00052 − \u0001r1p\u0002r1pk0\n2\u0002Hy = 0 \u00012\u0002\nwhere \u0005 is the longitudinal propagation constant of the SP\nwave. Assuming \u00052\u0004max\u0003\u0001r1p\u0002r1pk0\n2\n,\u0001r2\u0002r2k0\n2\u0004, the Hy-field\ncomponent in medium 1 will be of the form Hy =Ae\u0007x, where\n\u0007=\u0005\u00052−\u0001r1p\u0002r1pk02 and A is an arbitrary constant. For a\nbound wave to be supported by the interface, we seek Hy\nsolutions that decay exponentially as x→ ±\b. Therefore, we\nseek a solution for medium 2 of the form Hy =Ce−\tx. By\ndirect substitution of this expression into the scalar wave\nequation for Hy in Eq. \u00011a\u0002 we obtain \t=\u0005\u00052−\u0001r2\u0002r2k02.\nApplying the boundary conditions associated with the tan-\ngential Hy and Ez fields at x=0, yields a characteristic or\neigenvalue equation for the formed SP at the plane interface\nthat allows us to determine the conditions for its existence. In\nterms of the eigenmode’s effective index neff=\u0005 \/k0, the\naforementioned equation takes the form\nneff = \u0006\u0001r1p\u0001r2\u0001\u0002r1p\u0001r2 − \u0002r2\u0001r1p\u0002\n\u0001r2\n2\n− \u0001r1p\n2 \u00071\/2. \u00013\u0002\nFIG. 1. Isolated interface between a left-handed material \u0001LHM\u0002\nand a right-handed material \u0001RHM\u0002. The change in sign of the per-\nmittivity allows a p-polarized surface polariton \u0001SP\u0002 to exist at this\ninterface.\nTSAKMAKIDIS et al. PHYSICAL REVIEW B 73, 085104 \u00012006\u0002\n085104-2\nIt is convenient for the subsequent discussions to rewrite\nEq. \u00013\u0002 using the ratios of the permittivities, \n\u0001=\u0001r2 \/\u0001r1p, and\npermeabilities, \n\u0002=\u0002r2 \/\u0002r1p, of the two media17\nneff = \bn1\b\u0006\n\u0001\u0001\n\u0001 − \n\u0002\u0002\n\n\u0001\n2\n− 1 \u00071\/2. \u00014\u0002\nSince \n\u0001 is a positive quantity, we conclude from Eq. \u00014\u0002\nthat an SP at a LH\/RH interface can only exist if\n\u0003\n\u0001 \u0004 1 and \n\u0001 \u0004 \n\u0002\u0004 \u00015a\u0002\nor\n\u0003\n\u0001 \u0003 1 and \n\u0001 \u0003 \n\u0002\u0004 . \u00015b\u0002\nBefore closing this section, we wish to emphasize that\nthese restrictions concern uncoupled \u0001“unretarded”\u0002 SPs\nexisting at isolated LH\/RH interfaces. We demonstrate in\nSec. III that an SP eigenmode violating these constraints may\nexist if the interface that supports it, is brought sufficiently\nclose to another LH\/RH interface creating a “supermode,”\nwhich is not obliged to obey the two different cases in\nEq. \u00015\u0002.\nIII. SURFACE PLASMON POLARITONS IN ASYMMETRIC\nLH SLAB WAVEGUIDES\nIn the following we study surface plasmon polaritons\npropagating along a homogeneous isotropic slab of negative\npermittivity and permeability bounded by two different me-\ndia with positive refractive indices, as illustrated in Fig. 2.\nThe SPP eigenmodes in the slab waveguide will be travelling\nalong the z direction. There is no variation in the guide ge-\nometry in the z direction and by symmetry no variation in the\nfield distributions in the y direction. The thickness of the slab\nis 2\u000b and in all the subsequent discussions we assume, with-\nout loss of generality, that n2\u0004n3.\nIn the analysis of planar dielectric waveguides,19 the so-\nlution ansatz to the master equation is a monochromatic\nplane wave of frequency \u0006 with a functional expression that\ncan be symbolically written as\n\f\u0001x,z,t\u0002 =\r\u0001x\u0002e−j\u0005zej\u0006t, \u00016\u0002\nwhere \f represents an electric or magnetic field component,\n\r describes its amplitude in the x axis, and \u0005 is the longitu-\ndinal component of the wave vector k in the slab. For TM\nSPPs, where the three existing field components are given by\nEq. \u00011\u0002, we are seeking Hy-solutions in the three media, of\nthe form\nHy\u0001x\u0002 = \tAe\n\t3x, x\u000e 0\nB cosh\u0001\u0007x\u0002 + C sinh\u0001\u0007x\u0002 , 0\u000e x\u000e 2\u000b\nDe−\u0001x−2\u000b\u0002\t2, x\u000f 2\u000b ,\n\n \u00017\u0002\nwith \u0007=\u0005\u00052−\u0001r1p\u0002r1pk02, \t2=\u0005\u00052−\u0001r2\u0002r2k02, and \t3\n=\u0005\u00052−\u0001r3\u0002r3k02, as in Sec. II. Similarly to the single inter-\nface case we require neff\u0004max\u0003\bn1\b ,n2 ,n3\u0004, from which we\nmake the ansatz to Eq. \u00017\u0002. By matching the tangential com-\nponents at x=0 and x=2\u000b, we find\nB = A , \u00018a\u0002\nC = −\n\u0001r1p\n\u0001r3\n\t3\n\u0007\nA , \u00018b\u0002\nD = \u0006cosh\u00012\u000b\u0007\u0002 − \u0001r1p\n\u0001r3\n\t3\n\u0007\nsinh\u00012\u000b\u0007\u0002\u0007A , \u00018c\u0002\nand the following SPP characteristic equation is obtained:\ntanh\u00012\u000b\u0007\u0002 =\n\u0001r1p\u0007\u0001\u0001r3\t2 + \u0001r2\t3\u0002\n\u0001r2\u0001r3\u0007\n2 + \u0001r1p\n2 \t2\t3\n. \u00019\u0002\nAs in classical fiber theory,19 it is advantageous to intro-\nduce the following reduced, dimensionless, modal param-\neters:\nU = \u000b\u0007 = \u000bk0\u0005neff2 − \u0001r1p\u0002r1p, \u000110a\u0002\nW2 = \u000b\t2 = \u000bk0\u0005neff2 − \u0001r2\u0002r2, \u000110b\u0002\nW3 = \u000b\t3 = \u000bk0\u0005neff2 − \u0001r3\u0002r3. \u000110c\u0002\nWith these definitions, Eq. \u00019\u0002 takes the form\ntanh\u00012U\u0002 =\n\u0001r1pU\u0001\u0001r3W2 + \u0001r2W3\u0002\n\u0001r2\u0001r3U2 + \u0001r1p\n2 W2W3\n. \u000111\u0002\nIn order to determine the power propagation direction, we\ncalculate the time-averaged power flow in the slab hetero-\nstructure, obtained by the integral over the guide’s cross sec-\ntion of the z component of the complex Poynting vector \u0001Sz\u0002\nP = \u000b\n−\b\n\b\nSz dx =\n1\n2\u000b\n−\b\n\b\nRe\u0001E\u0010H*\u0002z dx . \u000112\u0002\nFor p-polarized SPP eigenmodes, Sz is given by\nSz =\n1\n2\nHy\n*Ex =\n\u0005\n2\u0006\u00010\u0001i\n\bHy\b2 \u0001i = 1,2,3\u0002 . \u000113\u0002\nFrom Eqs. \u00017\u0002–\u00019\u0002, we find the power Pi confined in each\nregion to be\nP3 = \f A24\u0006\u00010\r 1\u0001r1p \u0005\u0011\u0001\t3 , \u000114a\u0002\nFIG. 2. Schematic representation of the asymmetric left-handed\nslab heterostructure. The core is a medium with negative refractive\nindex n1 and thickness 2\u000b. Also shown is a possible field pattern of\na supported SP and the direction of the longitudinal propagation\nconstant \u0005.\nSURFACE PLASMON POLARITONS IN GENERALIZED… PHYSICAL REVIEW B 73, 085104 \u00012006\u0002\n085104-3\nP1 = − \f A24\u0006\u00010\r \u0005\u0001r1p \u0011\u0001\n2\u00072 − \t3\n2\n\u0011\u0001\n2\u00072\n\u00062\u000b + \n\u0001\t2\n\n\u0001\n2\u00072 − \t2\n2 +\n\u0011\u0001\t3\n\u0011\u0001\n2\u00072 − \t3\n2\u0007 ,\n\u000114b\u0002\nP2 = \f A24\u0006\u00010\r \u0005\u0001r1p\n\u0001\t2 \n\u0001\n2\n\u0011\u0001\n2\n\u0011\u0001\n2\u00072 − \t3\n2\n\n\u0001\n2\u00072 − \t2\n2 , \u000114c\u0002\nwhere \u0011\u0001=\u0001r3 \/\u0001r1p and \n\u0001=\u0001r2 \/\u0001r1p. From Eq. \u000114\u0002 we can\nderive a closed-form expression for the total power Ptot\n=\u000ei=1\n3 Pi in terms of the dimensionless parameters defined in\nEq. \u000110\u0002 and the reduced slab thickness \u000bk0\nPtot = \f A24\u0006\u00010\rW3\n2\n− \u0011\u0001\n2U2\n\u0011\u0001\n2U2\n\u0001U2 + \u0001r1p\u0002r1p\u0001\u000bk0\u00022\u00021\/2\n\u0001r1p\n\u0010\u00062 + \n\u0001W2 U\n2\n− W2\n2\nW2\n2\n− \n\u0001\n2U2\n+\n\u0011\u0001\nW3\nU2 − W3\n2\nW3\n2\n− \u00113\n2U2\u0007 . \u000115\u0002\nThe central task at this point is the determination of the\nsolutions to Eq. \u000111\u0002. Their existence is identified following\nan analytical methodology. In what follows, we discuss the\nfeatures and dependence of these solutions on the thickness\nof the inner layer, for the various cases of the refractive\nindex distribution. A brief summary of the results for each\ncase is found in Tables I–III.\nA. Case I: \u000fn1\u000f\u0004n2\u0004n3\nFor this case, we start by defining the following two\nV-parameters:\nV2\u0001\u000bk0\u0002 = \u0001W2\n2\n− U2\u00021\/2 = \u000bk0\u0001\u0001r1p\u0002r1p − \u0001r2\u0002r2\u00021\/2,\n\u000116a\u0002\nV3\u0001\u000bk0\u0002 = \u0001W3\n2\n− U2\u00021\/2 = \u000bk0\u0001\u0001r1p\u0002r1p − \u0001r3\u0002r3\u00021\/2,\n\u000116b\u0002\nwhere it is seen that the usual notation of the V number\nfound in fiber theory19 has been properly modified to accom-\nmodate the changes in the refractive index distribution and\nthat both parameters are functions of \u000bk0. We also introduce\nthe following ratios:\nb\u0001neff\u0002 =\nU\nV2\n= \u0006 \u0001neff\/n1\u00022 − 11 − \n\u0001\n\u0002 \u0007\n1\/2\n, \u000117\u0002\nt =\nV3\nV2\n= \f1 − \u0011\u0001\u0011\u00021 − \n\u0001\n\u0002 \r\n1\/2\n, \u000118\u0002\nobeying the restrictions b\u00040 and t\u00041, where \n\u0002=\u0002r2 \/\u0002r1p\nand \u0011\u0002=\u0002r3 \/\u0002r1p. Note that similar ratios to b and t are\nutilized in the analysis of conventional slab waveguides to\ndenote the “normalized guide index” and the “asymmetry\nmeasure,” respectively,20 and that b is a function of the SPP\neigenmode’s effective index.\nFor the explicit acquisition of the dispersion diagrams and\nthe derivation of the analytical restrictions inherent in\nEq. \u000111\u0002, a common strategy is to produce an inverted ver-\nsion of the associated characteristic equation.15,20 First, we\nnote from Eqs. \u000116\u0002 and \u000117\u0002 that U=bV2, W2=V2\u0001b2+1\u00021\/2\nand W3=V2\u0001b2+ t2\u00021\/2. With these observations, Eq. \u000111\u0002 can\nbe rewritten in the form\nV2 =\n1\n4b\nln\u0006 \u0001X + 1\u0002\u0001Y + 1\u0002\u0001X − 1\u0002\u0001Y − 1\u0002\u0007 , \u000119\u0002\nwhere X\u0001b\u0002=\u0011\u0001b \/ \u0001b2+ t2\u00021\/2 and Y\u0001b\u0002=\n\u0001b \/ \u0001b2+1\u00021\/2. Since\nV2, given in Eq. \u000116a\u0002, is a real number, we immediately see\nthat Eq. \u000119\u0002 only has solutions, when the argument of the\nlogarithm is positive, i.e., for\nTABLE I. Summary of the discussion for the case \bn1\b\u0004n2\u0004n3.\n\u0011\u0001\u00041, \n\u0001\u00041 \u0011\u0001\u00041, \n\u0001\u000e1 \u0011\u0001\u000e1, \n\u0001\u00041 \u0011\u0001\u000e1, \n\u0001\u000e1\n\n\u0001\u0004\u0011\u0001 \n\u0001\u0001\u0012\nFirst: forward,\n2 cutoffs\nFirst: backward,\nlow cutoff\nFirst: forward,\n2 cutoffs\nFirst: forward,\n2 cutoffs\nFirst: forward,\nupper cutoff\nSecond: backward,\nlow cutoff\nSecond: backward,\nno cutoff\nSecond: backward,\nlow cutoff\nSecond: backward,\nlow cutoff\nThird: backward,\nno cutoff\nTABLE II. Summary of the discussion for the case n2\u0004n3\u0004 \bn1\b.\n\u0011\u0001\u000f1, \n\u0001\u000f1 \u0011\u0001\u000f1, \n\u0001\u00031 \u0011\u0001\u00031, \n\u0001\u000f1 \u0011\u0001\u00031, \n\u0001\u00031\n\n\u0001\u0001\u0012 \n\u0001\u0001\u0012\u0001 \n\u0001\n\u0002\u0004 \u0001\u0011\u0001\u0011\u0002−\u0011\u0001\n2\u0002 \/ \u00011−\u0011\u0001\n2\u0002\nFirst: forward,\n2 cutoffs\nFirst: forward,\nlow cutoff\nFirst: forward,\nlow cutoff\nFirst: forward,\nlow cutoff\nFirst: forward,\nlow cutoff\nFirst: forward,\nno cutoff\nSecond: backward,\nupper cutoff\nSecond: forward,\nno cutoff\nSecond: forward,\nno cutoff\nTSAKMAKIDIS et al. PHYSICAL REVIEW B 73, 085104 \u00012006\u0002\n085104-4\n\u0003X\u0004 1 and Y \u0004 1\u0004 , \u000120a\u0002\nor:\n\u00030\u0003 X\u0003 1 and 0\u0003 Y \u0003 1\u0004 . \u000120b\u0002\nWe now examine, in detail, the consequences of these\nrestrictions on X\u0001b\u0002 and Y\u0001b\u0002, based on which the existing\nSPP eigenmodes are rigorously identified. In particular, we\nderive analytically the allowable range of values that b,\nhence the eigenmodes’ effective index, can take. In pursuing\nthis analysis, we find that it is necessary to distinguish be-\ntween the following four situations that describe the possible\nvariations in the permittivity distribution. In all four of them,\nit is implied that \u0011\u0001\u0011\u0002\u0003\n\u0001\n\u0002\u00031 from the initial assumption\n\bn1\b\u0004n2\u0004n3.\nThe first situation occurs for \u0003\u0011\u0001\u00041 and \n\u0001\u00041\u0004. When\n\n\u0001\u0004\u0011\u0001, inspection of Eq. \u000120\u0002 results in the allowable values\nfor b; that is 0\u0003b\u0003b1 or b\u0004b2, where\nb1 = \f 1\n\n\u0001\n2\n− 1\r\n1\/2\n, \u000121\u0002\nand\nb2 = \u0006 1 − \u0011\u0001\u0011\u0002\u0001\u0011\u00012 − 1\u0002\u00011 − \n\u0001\n\u0002\u0002\u0007\n1\/2\n. \u000122\u0002\nThe corresponding geometric dispersion diagram is shown in\nFig. 3\u0001a\u0002, and the variation of the normalized power P\n= Ptot \/ \u0001\bP1\b+ \bP2\b+ \bP3\b\u0002 \u0001Ref. 11\u0002 with the reduced slab thick-\nness for each solution is given in Fig. 3\u0001b\u0002. Three SPP eigen-\nmodes exist in this case. The first has a lower cutoff and an\nupper one at b=0, is forward propagating, having positive\ntotal power P, and the field intensity has a node in the core\nregion. It should be noted that modes with oscillating field\ninside the core can also exist in high-index guiding LH\nstructures.11 Therefore, all SPP cutoff points corresponding\nto b=0 are not necessarily “real” cutoffs where no electro-\nmagnetic mode \u0001SPP or oscillatory\u0002 can exist any more, but a\ntransition point from SPP mode to oscillatory mode. It is\nworth pointing out that for all SPPs considered in case I this\ncontinuous transformation is into the first oscillating mode.\nAt the lower cutoff point, the previous SPP solution de-\ngenerates into the second eigenmode. This SPP has a low\ncutoff and no upper cutoff and is backward propagating, hav-\ning negative energy velocity and, since the dielectric media\nare nonabsorbing, negative group velocity, as well.21 After a\nfinite gap, a third eigenmode appears, which has no cutoff\nand is also backward propagating having negative P for ev-\nery core thickness. The corresponding fields have no node in\nthe core region.\nIt is interesting to discuss the behavior of these solutions\nin the extreme cases of b→b1 and b→b2. First, by letting b\nbecome equal to b1, we recover asymptotically Eq. \u00014\u0002,\nwhich is the SPP characteristic equation at the 1-2 media\ninterface. Such result is expected, since from Eqs. \u000116a\u0002 and\n\u000119\u0002 and from Fig. 3\u0001a\u0002 we note that for b→b1 ,\u000bk0→\b,\nhence the two slab interfaces decouple and the SPP at an\nisolated interface should be recovered. For a relatively large\nvalue of \u000bk0, the result of plotting this SPP eigenmode is\nshown in the middle left inset of Fig. 3\u0001a\u0002, reflecting the\nprevious conclusions. Then, assuming that b=b2, we obtain\nneff,3 = \bn1\b\u0006\u0011\u0001\u0001\u0011\u0001 − \u0011\u0002\u0002\n\u0011\u0001\n2\n− 1 \u00071\/2, \u000123\u0002\nand the SPP eigenmode at the 1-3 interface is recovered\nasymptotically, shown in the top inset.\nWhen \n\u0001\u0003\u0011\u0001, it proves necessary to examine the inter-\nvals that to which the ratio \n\u0001 belongs. If \n\u0001\u0001\u0012, where \u0012\n= \u0003\u0001\n\u0001,1\u0003\n\u0001\u0003\n\u0001,2\u0002\u0001 \u0001\n\u0001\u00041\u0002\u0004 and \n\u0001,1 ,\n\u0001,2 are the two roots\nof the polynomial\n\u0013\u0001\n\u0001\u0002 = \u00011 − \u0011\u0001\u0011\u0002\u0002\n\u0001\n2 + \n\u0002\u0001\u0011\u0001\n2\n− 1\u0002\n\u0001 − \u0010\u00011 − \u0011\u0001\u0011\u0002\u0002\n+ \u0001\u0011\u0001\n2\n− 1\u0002\u0011 , \u000124\u0002\nit is b1\u0004b2, and we see from Fig. 3\u0001c\u0002 that two eigenmodes\nexist, both of which are backward propagating. The first SPP\nhas only a lower cutoff at b=0 and, contrary to the previous\ncase, it concentrates asymptotically at the 1-3 interface while\nexhibiting a phase reversal. The second \u0001upper\u0002 SPP shows\nno cutoff, has positive Hy-field component throughout the\nslab and concentrates at the 1-2 media interface for large\ncore thickness. For \n\u0001\u0001\u0012\u0001, where \u0012\u0001= \u0003\u0010\u0001\n\u0001\u0003\n\u0001,1\u0002\u0002 \u0001\n\u0001\n\u0004\n\u0001,2\u0002\u0011\u0001 \u0001\n\u0001\u00041\u0002\u0004, we have b1\u0003b2 and the results of the\nanalysis hold the same as in the case \n\u0001\u0004\u0011\u0001, apart from the\ndisappearance of the first SPP eigenmode that was forward\npropagating.\nThe second situation occurs for \u0003\u0011\u0001\u00041 and \n\u0001\u000e1\u0004. From\nthe conditions in Eq. \u000120\u0002, we find that b ranges from 0 to b2\nand the corresponding dispersion diagram is illustrated in\nFig. 3\u0001e\u0002. In this case two eigenmodes are shown to exist; for\nboth, the Hy component has a node in the core region. The\nfirst has a low cutoff and an upper one occurring at b=0, and\nTABLE III. Summary of the discussion for the case n2\u0004 \bn1\b\u0004n3.\n\u0011\u0001\u00041, \n\u0001\u000f1 \u0011\u0001\u00041, \n\u0001\u00031 \u0011\u0001\u000e1, \n\u0001\u00031\n\n\u0001\n\u0002\u0003 \u0001\u0011\u0001\n2\n−\u0011\u0001\u0011\u0002\u0002 \/ \u0001\u0011\u0001\n2\n−1\u0002 \n\u0001\n\u0002\u0004 \u0001\u0011\u0001\n2\n−\u0011\u0001\u0011\u0002\u0002 \/ \u0001\u0011\u0001\n2\n−1\u0002 \n\u0001\u0001\u0012 \n\u0001\u0001\u0012\u0001 \n\u0001\n\u0002\u0004 \u0001\u0011\u0001\n2\n−\u0011\u0001\u0011\u0002\u0002 \/ \u0001\u0011\u0001\n2\n−1\u0002\nFirst: backward,\nno cutoff\nFirst: forward,\n2 cutoffs\nFirst: backward,\nlow cutoff\nFirst: forward,\nlow cutoff\nFirst: forward,\n2 cutoffs\nFirst: forward,\nno cutoff\nSecond: backward,\nupper cutoff\nSecond: forward,\nlow cutoff\nSecond: backward,\nlow cutoff\nSecond: backward,\n2 cutoffs\nThird: forward,\nlow cutoff\nSURFACE PLASMON POLARITONS IN GENERALIZED… PHYSICAL REVIEW B 73, 085104 \u00012006\u0002\n085104-5\nis forward propagating. The second SPP has only a low cut-\noff and it concentrates asymptotically at the 1-3 interface. As\nin all the encountered cases that contain degeneracy, the total\npower P at this point equals zero, corresponding to zero\ngroup velocity. Waves with this feature are of great practical\ninterest for optical communication and data storage\napplications.22 It should be noted that, for the particular val-\nues of the permittivity and permeability ratios shown in\nFIG. 3. Variation of an SP eigenmode’s effective index neff and normalized power P with the reduced slab thickness \u000bk0 in a generalized\nLH slab waveguide \u0001case I: \bn1\b\u0004n2\u0004n3, as indicated by the shaded background\u0002. In all cases it is assumed that \u0001r=2, \u0002r=1.2. \u0001a\u0002, \u0001b\u0002 neff\nand P variation for \u0011\u0001=1.1, \u0011\u0002=0.5, \n\u0001=1.15, \n\u0002=0.6. \u0001c\u0002, \u0001d\u0002 Variations for \u0011\u0001=1.8, \u0011\u0002=0.5, \n\u0001=1.55, \n\u0002=0.6. \u0001e\u0002, \u0001f\u0002 Variations for\n\u0011\u0001=1.1, \u0011\u0002=0.5, \n\u0001=0.95, \n\u0002=0.8. \u0001g\u0002, \u0001h\u0002 Variations for \u0011\u0001=0.8, \u0011\u0002=0.2, \n\u0001=1.05, \n\u0002=0.2. \u0001i\u0002, \u0001j\u0002 Variations for \u0011\u0001=0.8, \u0011\u0002=1, \n\u0001\n=0.9, \n\u0002=1.1.\nTSAKMAKIDIS et al. PHYSICAL REVIEW B 73, 085104 \u00012006\u0002\n085104-6\nFig. 3\u0001e\u0002, the 1-2 single interface does not support an SPP\nbecause the constraints in Eq. \u00015\u0002 are violated. However, the\ncoupled SPPs at the interfaces of the slab overcome this limi-\ntation, creating the two new SPP “supermodes” for relatively\nlarge slab thickness.\nIn the third case, which exists for \u0003\u0011\u0001\u000e1 and \n\u0001\u00041\u0004, it is\nfound that the range of values for b is between 0 and b1. The\nvariation of the eigenmodes’ effective index and power with\nthe reduced guide thickness is shown in Figs. 3\u0001g\u0002 and 3\u0001h\u0002.\nThe conclusions for the supported SPPs are similar with\nthose in the previous case, with the difference that the second\n\u0001upper\u0002 eigenmode concentrates asymptotically at the 1-2 in-\nterface while taking negative values. In this case also, it is\nthe 1-3 interface that violates the SPP existence conditions\nand, if isolated, would not support a bound wave.\nThe final situation occurs for \u0003\u0011\u0001\u000e1 and \n\u0001\u000e1\u0004. In this\ncase there are no additional restrictions on b other than b\n\u00040. From Figs. 3\u0001i\u0002 and 3\u0001j\u0002 we see that only one SPP eigen-\nmode exists, which is forward propagating with only a\nhigher cutoff at b=0 and has opposite sign at the two inter-\nfaces of the slab.\nB. Case II: n2\u0004n3\u0004 \u000fn1\u000f\nFor the refractive index distribution considered here, we\nuse the following definitions for the V numbers:\nV2\u0001\u000bk0\u0002 = \u0001U2 − W2\n2\u00021\/2 = \u000bk0\u0001\u0001r2\u0002r2 − \u0001r1p\u0002r1p\u00021\/2,\n\u000125a\u0002\nV3\u0001\u000bk0\u0002 = \u0001U2 − W3\n2\u00021\/2 = \u000bk0\u0001\u0001r3\u0002r3 − \u0001r1p\u0002r1p\u00021\/2,\n\u000125b\u0002\nwith \n\u0001\n\u0002\u0004\u0011\u0001\u0011\u0002\u00041 used throughout the following analy-\nsis. Then, the previously introduced b and t parameters take\nthe form\nb\u0001neff\u0002 =\nU\nV2\n= \u0006 \u0001neff\/n1\u00022 − 1\n\n\u0001\n\u0002 − 1\n\u00071\/2, \u000126\u0002\nt =\nV3\nV2\n= \f\u0011\u0001\u0011\u0002 − 1\n\n\u0001\n\u0002 − 1\n\r1\/2, \u000127\u0002\nobeying the restrictions b\u00041 and t\u00031. The general form of\nEq. \u000119\u0002 and the solution conditions of Eq. \u000120\u0002 remain the\nsame, but now we have W2=V2\u0001b2−1\u00021\/2, W3=V2\u0001b2− t2\u00021\/2,\nX\u0001b\u0002=\u0011\u0001b \/ \u0001b2− t2\u00021\/2 and Y\u0001b\u0002=\n\u0001b \/ \u0001b2−1\u00021\/2. By letting\nX\u0001b\u0002 and Y\u0001b\u0002 fulfill these conditions, we again find that four\ndistinct situations arise depending on the permittivity profile.\nThe first situation occurs for \u0003\u0011\u0001\u000f1 and \n\u0001\u000f1\u0004, and does\nnot contain further restrictions on b. The eigenmodes’ effec-\ntive index and P dispersion diagrams are shown in Figs. 4\u0001a\u0002\nand 4\u0001b\u0002. We see that two SPPs exist; both have no node in\nthe middle layer. The first, which is forward propagating, has\na lower cutoff at b=1 and also an upper cutoff point, where\nit degenerates into the second eigenmode. The second SPP\nhas only a high cutoff and is backward propagating having\nnegative total power P.\nThe second situation occurs for \u0003\u0011\u0001\u000f1 and \n\u0001\u00031\u0004, and it\ncan be shown that b is in the range 1\u0003b\u0003b1, where now\nb1 = \f 11 − \n\u00012\r\n1\/2\n. \u000128\u0002\nIn this case, a single SPP eigenmode is shown to exist, hav-\ning only a low cutoff at b=1. This SPP is forward propagat-\ning and concentrates at the 1-2 media interface for large core\nthickness, as illustrated in the inset of Fig. 4\u0001c\u0002. This result is\nalso verified by letting b=b1, where we obtain the SPP char-\nacteristic Eq. \u00014\u0002.\nThe third case exists for \u0003\u0011\u0001\u00031 and \n\u0001\u000f1\u0004, and it is\nfound that b ranges from 1 to b2, where now\nb2 = \u0006 \u0011\u0001\u0011\u0002 − 1\u00011 − \u0011\u00012\u0002\u0001\n\u0001\n\u0002 − 1\u0002\u0007\n1\/2\n, \u000129\u0002\nwith the constraint \n\u0001\n\u0002\u0003 \u0001\u0011\u0001\u0011\u0002−\u0011\u0001\n2\u0002 \/ \u00011−\u0011\u0001\n2\u0002. The variation\nof the effective index and total power with the reduced guide\nthickness are shown in Figs. 4\u0001e\u0002 and 4\u0001f\u0002. The conclusions\nare similar with the previous case, with the difference that\nthe supported SPP concentrates asymptotically at the 1-3 in-\nterface. For the values of \n\u0001 and \n\u0002 shown in Fig. 4\u0001e\u0002, the\nisolated 1-2 interface would not support an SPP.\nThe final situation occurs for \u0003\u0011\u0001\u00031 and \n\u0001\u00031\u0004. If\n\n\u0001\n\u0002\u0003 \u0001\u0011\u0001\u0011\u0002−\u0011\u0001\n2\u0002 \/ \u00011−\u0011\u0001\n2\u0002, it proves necessary to examine\nthe intervals that the ratio \n\u0001 belongs to. When \n\u0001\u0001\u0012, with\n\u0012= \u0003\u0010\u0001\n\u0001\u0003\n\u0001,1\u0002\u0002 \u0001\n\u0001\u0004\n\u0001,2\u0002\u0011\u0001 \u00010\u0003\n\u0001\u00031\u0002\u0004 and \n\u0001,1 ,\n\u0001,2 be-\ning the two roots of the polynomial\n\u0013\u0001\n\u0001\u0002 = \u0001\u0011\u0001\u0011\u0002 − 1\u0002\n\u0001\n2 + \n\u0002\u00011 − \u0011\u0001\n2\u0002\n\u0001 − \u0010\u00011 − \u0011\u0001\n2\u0002\n+ \u0001\u0011\u0001\u0011\u0002 − 1\u0002\u0011 , \u000130\u0002\nit is b1\u0004b2, and we see from Fig. 4\u0001g\u0002 that two eigenmodes\nexist, both of which are forward propagating. The first SPP\nhas only a low cutoff at b=1 and concentrates asymptotically\nat the 1-3 interface; the corresponding field intensity has no\nnode in the core region. The second SPP has no cutoff, ex-\nhibits phase reversal and concentrates at the 1-2 media inter-\nface for large core thickness. For \n\u0001\u0001\u0012\u0001, where \u0012\u0001= \u0003\u0001\n\u0001,1\n\u0003\n\u0001\u0003\n\u0001,2\u0002\u0001 \u00010\u0003\n\u0001\u00031\u0002\u0004, we have b1\u0003b2 and again two\nSPP eigenmodes are shown to exist in Figs. 4\u0001i\u0002 and 4\u0001j\u0002. The\nfirst has positive Hy-field amplitude across the slab. Com-\npared to the previous two eigenmodes, the cutoff character-\nistics remain the same, but the order of the interfaces to\nwhich these SPPs concentrate is reversed. Finally, if \n\u0001\n\u0002\n\u0004 \u0001\u0011\u0001\u0011\u0002−\u0011\u0001\n2\u0002 \/ \u00011−\u0011\u0001\n2\u0002, the constraint b\u0004b1 becomes manda-\ntory. The dispersion diagrams for this case are shown in\nFigs. 4\u0001k\u0002 and 4\u0001l\u0002. We see that a single SPP exists, which\nshows no cutoff, exhibits phase reversal, concentrates\nasymptotically at the 1-2 interface and has positive total\npower for all core thicknesses.\nC. Case III: n2\u0004 \u000fn1\u000f\u0004n3\nTo reflect the refractive index distribution considered\nhere, the two V numbers are defined as\nV2\u0001\u000bk0\u0002 = \u0001U2 − W2\n2\u00021\/2 = \u000bk0\u0001\u0001r2\u0002r2 − \u0001r1p\u0002r1p\u00021\/2,\n\u000131a\u0002\nSURFACE PLASMON POLARITONS IN GENERALIZED… PHYSICAL REVIEW B 73, 085104 \u00012006\u0002\n085104-7\nFIG. 4. Variation of an SP eigenmode’s effective index neff and normalized power P with the reduced slab thickness \u000bk0 in a generalized\nLH slab waveguide \u0001case II: n2\u0004n3\u0004 \bn1\b, as indicated by the shaded background\u0002. In all cases, it is assumed that \u0001r=2, \u0002r=1.2. \u0001a\u0002, \u0001b\u0002 neff\nand P variation for \u0011\u0001=1.7, \u0011\u0002=1.1, \n\u0001=1.8, \n\u0002=1.2. \u0001c\u0002, \u0001d\u0002 Variations for \u0011\u0001=1.2, \u0011\u0002=0.9, \n\u0001=0.8, \n\u0002=1.6. \u0001e\u0002, \u0001f\u0002 Variations for \u0011\u0001\n=0.9, \u0011\u0002=1.2, \n\u0001=1.1, \n\u0002=1.1. \u0001g\u0002, \u0001h\u0002 Variations for \u0011\u0001=0.7, \u0011\u0002=1.6, \n\u0001=0.71, \n\u0002=1.7. \u0001i\u0002, \u0001j\u0002 Variations for \u0011\u0001=0.7, \u0011\u0002=2.7, \n\u0001\n=0.4, \n\u0002=5.8. \u0001k\u0002, \u0001l\u0002 Variations for \u0011\u0001=0.7, \u0011\u0002=2.7, \n\u0001=0.85, \n\u0002=3.5.\nTSAKMAKIDIS et al. PHYSICAL REVIEW B 73, 085104 \u00012006\u0002\n085104-8\nV3\u0001\u000bk0\u0002 = \u0001W3\n2\n− U2\u00021\/2 = \u000bk0\u0001\u0001r1p\u0002r1p − \u0001r3\u0002r3\u00021\/2,\n\u000131b\u0002\nwith \n\u0001\n\u0002\u00041\u0004\u0011\u0001\u0011\u0002 used in the remaining analysis. Ac-\ncordingly, the b and t ratios take the form\nb\u0001neff\u0002 =\nU\nV2\n= \u0006 \u0001neff\/n1\u00022 − 1\n\n\u0001\n\u0002 − 1\n\u00071\/2, \u000132\u0002\nt =\nV3\nV2\n= \f1 − \u0011\u0001\u0011\u0002\n\n\u0001\n\u0002 − 1\n\r1\/2, \u000133\u0002\nobeying the restrictions b\u00041 and t\u00040. Once more, the gen-\neral form of Eq. \u000119\u0002 and the solution conditions of Eq. \u000120\u0002\nremain the same, but now W2=V2\u0001b2−1\u00021\/2, W3=V2\u0001b2\n+ t2\u00021\/2, X\u0001b\u0002=\u0011\u0001b \/ \u0001b2+ t2\u00021\/2 and Y\u0001b\u0002=\n\u0001b \/ \u0001b2−1\u00021\/2. By\nletting X\u0001b\u0002 and Y\u0001b\u0002 fulfill the aforesaid conditions, the fol-\nlowing four distinct situations arise depending on the permit-\ntivity profile.\nThe first situation occurs for \u0003\u0011\u0001\u00041 and \n\u0001\u000f1\u0004. If \n\u0001\n\u0002\n\u0003 \u0001\u0011\u0001\n2\n−\u0011\u0001\u0011\u0002\u0002 \/ \u0001\u0011\u0001\n2\n−1\u0002, the allowable range of values for b is\nb\u0004b2, where\nb2 = \u0006 1 − \u0011\u0001\u0011\u0002\u0001\n\u0001\n\u0002 − 1\u0002\u0001\u0011\u00012 − 1\u0002\u0007\n1\/2\n. \u000134\u0002\nWe see from Figs. 5\u0001a\u0002 and 5\u0001b\u0002 that a single eigenmode\nexists, which is backward propagating and has no cutoff. For\nlarge core thickness, the SPP characteristic equation at the\n1-3 interface is recovered. The other interface would not sup-\nport a SPP, if isolated. In the case \n\u0001\n\u0002\u0004 \u0001\u0011\u0001\n2\n−\u0011\u0001\u0011\u0002\u0002 \/ \u0001\u0011\u0001\n2\n−1\u0002, it is seen from Figs. 5\u0001c\u0002 and 5\u0001d\u0002 that two SPP eigen-\nmodes can exist; both have no node in the inner layer. The\nfirst one, which is forward propagating, has a low cutoff\npoint at b=1 and a high cutoff, where it degenerates into the\nsecond SPP. This eigenmode is backward propagating having\nonly an upper cutoff.\nThe second situation is described by \u0003\u0011\u0001\u00041 and \n\u0001\u00031\u0004.\nFor \n\u0001\n\u0002\u0003 \u0001\u0011\u0001\n2\n−\u0011\u0001\u0011\u0002\u0002 \/ \u0001\u0011\u0001\n2\n−1\u0002, it proves necessary to exam-\nine the intervals that the ratio \n\u0001 belong to. When \n\u0001\u0001\u0012,\nwith \u0012= \u0003\u0010\u0001\n\u0001\u0003\n\u0001,1\u0002\u0002 \u0001\n\u0001\u0004\n\u0001,2\u0002\u0011\u0001 \u00010\u0003\n\u0001\u00031\u0002\u0004 and\n\n\u0001,1 , \n\u0001,2 being the two roots of the polynomial\n\u0013\u0001\n\u0001\u0002 = \u00011 − \u0011\u0001\u0011\u0002\u0002\n\u0001\n2 + \n\u0002\u0001\u0011\u0001\n2\n− 1\u0002\n\u0001 − \u0010\u00011 − \u0011\u0001\n2\u0002\n+ \u00011 − \u0011\u0001\u0011\u0002\u0002\u0011 , \u000135\u0002\nit is b1\u0004b2, where\nb1 = \f 11 − \n\u00012\r\n1\/2\n, \u000136\u0002\nand it can be shown that b is in the range b2\u0003b\u0003b1. The\ncorresponding dispersion diagrams are illustrated in\nFigs. 5\u0001e\u0002 and 5\u0001f\u0002. We see that two nodeless eigenmodes\nexist. The first one has only a low cutoff, is backward propa-\ngating and concentrates asymptotically at the 1-3 interface.\nThe second SPP has only a low cutoff, is forward propagat-\ning and concentrates at the 1-2 interface for relatively large\ncore thicknesses. For \n\u0001\u0001\u0012\u0001, where \u0012\u0001= \u0003\u0001\n\u0001,1\u0003\n\u0001\n\u0003\n\u0001,2\u0002\u0001 \u00010\u0003\n\u0001\u00031\u0002\u0004, it is b1\u0003b2 and again two SPP eigen-\nmodes are shown to exist in Figs. 5\u0001g\u0002 and 5\u0001h\u0002. Compared to\nthe previous two eigenmodes, the cutoff characteristics and\nthe classification remain the same, but the order of the inter-\nfaces to which these SPPs concentrate is reversed. Also, both\nSPPs now exhibit phase reversal. For \n\u0001\n\u0002\u0004 \u0001\u0011\u0001\n2\n−\u0011\u0001\u0011\u0002\u0002 \/ \u0001\u0011\u0001\n2\n−1\u0002, we have 1\u0003b\u0003b1 and the dispersion dia-\ngrams are shown in Figs. 5\u0001i\u0002 and 5\u0001j\u0002. In this case, three\ndistinct solutions of Eq. \u000111\u0002 are found; the Hy-field intensity\nfor all of them has no node in the core region. The first one,\nwhich corresponds to positive total power P, has a low cutoff\npoint at b=1 and an upper cutoff, where it degenerates into\nthe second SPP. This eigenmode has also a lower and a\nhigher cutoff, but is backward propagating. The third branch\nshows only a low cutoff, corresponds to positive P and,\nasymptotically, degenerates into the isolated 1-2 interface\nsolution. This situation is the only one where two double\nmode-degeneracy points occur.\nIn the third situation, which occurs for \u0003\u0011\u0001\u00031 and \n\u0001\n\u00041\u0004, there are no solutions to Eq. \u000119\u0002 for any b\u00041; hence,\nthe slab waveguide does not support SPPs.\nThe final situation occurs for \u0003\u0011\u0001\u000e1 and \n\u0001\u00031\u0004 and the\ncorresponding dispersion diagrams are shown in Figs. 5\u0001k\u0002\nand 5\u0001l\u0002. From the solution constraints of Eq. \u000120\u0002, we find\nthat b\u0004b1. A single SPP exists, which does not have cutoff,\nis forward propagating, exhibits phase reversal and concen-\ntrates asymptotically at the 1-2 media interface. It should be\nnoted that, for the chosen values of \u0011\u0001 and \u0011\u0002, the isolated\n1-3 interface does not support an SPP.\nIV. CONCLUSIONS\nWe have presented a systematic investigation of all solu-\ntions of the involved characteristic equation giving the\np-polarized surface plasmon polariton eigenmodes in gener-\nalized slab waveguides, comprised of a negative refractive\nindex core that is bounded by two different positive-index\nmedia. Following an analytical methodology, all SPPs are\nclassified as forward or backward propagating, depending on\nthe sign of the associated power flow. Contrary to the case of\nthin metallic films surrounded by two different dielectrics,\nwhere the SPPs depend solely on the permittivity distribu-\ntion, we have shown analytically that, for the corresponding\nleft-handed structures considered here, the refractive index\ndistribution must also be included in the analysis.\nIn particular, if the absolute value of the core refractive\nindex is greater than those of the surrounding dielectrics, we\nidentified ten TM SPP eigenmodes; six of these solutions are\nbackward propagating. Nine solutions existed if the core in-\ndex has the smallest absolute value; one of these SPPs has\nantiparallel phase and group velocities. In the final case,\nwhere the core index value is between those of the claddings,\n11 SPP eigenmodes were identified; five of these solutions\nhave backward power flow in relation to the direction of the\nphase velocity. The total number of 30 SPP eigenmodes,\nwhich is significantly higher than the six SPPs that were\nrecognized in similar metallic film geometries,15 is a direct\nresult of the presence of negative magnetic permeability in\nthe LH structures that provides additional degrees of free-\ndom in the definition of the V numbers.\nSURFACE PLASMON POLARITONS IN GENERALIZED… PHYSICAL REVIEW B 73, 085104 \u00012006\u0002\n085104-9\nFIG. 5. Variation of an SP eigenmode’s effective index neff and normalized power P with the reduced slab thickness \u000bk0 in a generalized\nLH slab waveguide \u0001case III: n2\u0004 \bn1\b\u0004n3, as indicated by the shaded background\u0002. In all cases it is assumed that \u0001r=2, \u0002r=1.2. \u0001a\u0002, \u0001b\u0002 neff\nand P variation for \u0011\u0001=1.1, \u0011\u0002=0.7, \n\u0001=1.38, \n\u0002=1.5. \u0001c\u0002, \u0001d\u0002 Variations for \u0011\u0001=1.1, \u0011\u0002=0.7, \n\u0001=1.95, \n\u0002=1.5. \u0001e\u0002, \u0001f\u0002 Variations \u0011\u0001\n=1.1, \u0011\u0002=0.7, \n\u0001=0.75, \n\u0002=2.5. \u0001g\u0002, \u0001h\u0002 Variations for \u0011\u0001=1.1, \u0011\u0002=0.7, \n\u0001=0.5, \n\u0002=2.5. \u0001i\u0002, \u0001j\u0002 Variations for \u0011\u0001=1.1, \u0011\u0002=0.7, \n\u0001\n=0.92, \n\u0002=2.5. \u0001k\u0002, \u0001l\u0002 Variations for \u0011\u0001=0.9, \u0011\u0002=0.9, \n\u0001=0.95, \n\u0002=1.2.\nTSAKMAKIDIS et al. PHYSICAL REVIEW B 73, 085104 \u00012006\u0002\n085104-10\nThe analytical treatment revealed features not observed\nbefore, such as the occurrence of “supermodes” in the case\nof a violation of the isolated interface condition, strong field\nenhancement and opening of gaps in the geometric disper-\nsion diagrams owing to the asymmetry, and coexistence of\nthree eigenmodes with double mode-degeneracy points oc-\ncurring twice. We also demonstrated that the group velocity\nof the investigated slow waves could be decreased down to\nzero or become negative, by adjusting suitably the thickness\nof the core.\nACKNOWLEDGMENT\nThis work is partially supported by the Engineering and\nPhysical Sciences Research Council \u0001EPSRC\u0002, U.K.\n1 V. G. Veselago, Sov. Phys. Usp. 10, 509 \u00011968\u0002; V. G. Veselago,\nin Proceedings of the First Taormina Research Conference on\nthe Structure of Matter, Pergamon, 1972, edited by E. Burstein\nand F. De Martini \u0001Pergamon Press, New York, 1974\u0002, p. 5.\n2 P. M. Valanju, R. M. Walser, and A. P. Valanju, Phys. Rev. Lett.\n88, 187401 \u00012002\u0002.\n3 J. B. Pendry, Phys. Rev. Lett. 85, 3966 \u00012000\u0002.\n4 N. Garcia and M. Nieto-Vesperinas, Phys. Rev. Lett. 88, 207403\n\u00012002\u0002.\n5 D. R. Smith, D. Schurig, and J. B. Pendry, Appl. Phys. Lett. 81,\n2713 \u00012002\u0002; D. R. Smith, D. Schurig, M. Rosenbluth, S.\nSchultz, S. A. Ramakrishna, and J. B. Pendry, ibid. 82, 1506\n\u00012003\u0002.\n6 S. A. Cummer, Appl. Phys. Lett. 82, 2008 \u00012003\u0002; W. T. Lu, J. B.\nSokoloff, and S. Sridhar, Phys. Rev. E 69, 026604 \u00012004\u0002.\n7 C. G. Parazzoli, R. B. Greegor, K. Li, B. E. C. Koltenbah, and M.\nTanielian, Phys. Rev. Lett. 90, 107401 \u00012003\u0002; A. A. Houck, J.\nB. Brock, and I. L. Chuang, ibid. 90, 137401 \u00012003\u0002.\n8 J. B. Pendry, A. J. Holden, W. J. Stewart, and I. Youngs, Phys.\nRev. Lett. 76, 4773 \u00011996\u0002; J. B. Pendry, A. J. Holden, D. J.\nRobbins, and W. J. Stewart, J. Phys.: Condens. Matter 10, 4785\n\u00011998\u0002; J. B. Pendry, A. J. Holden, D. J. Robbins, and W. J.\nStewart, IEEE Trans. Microwave Theory Tech. 47, 2075 \u00011999\u0002.\n9 R. A. Shelby, D. R. Smith, and S. Shultz, Science 292, 77 \u00012001\u0002.\n10 A. N. Lagarkov and V. N. Kissel, Phys. Rev. Lett. 92, 077401\n\u00012004\u0002.\n11 I. V. Shadrivov, A. A. Sukhorukov, and Y. S. Kivshar, Phys. Rev.\nE 67, 057602 \u00012003\u0002.\n12 S. A. Ramakrishna, J. B. Pendry, D. Schurig, D. R. Smith, and S.\nSchultz, J. Mod. Opt. 49, 1747 \u00012002\u0002; B.-I. Wu, T. M. Grze-\ngorczyk, Y. Zhang, and J. A. Kong, J. Appl. Phys. 93, 9386\n\u00012003\u0002; Y. He, Z. Cao, Q. Shen, Opt. Commun. 245, 125 \u00012005\u0002.\n13 D.-K. Qing and G. Chen, Appl. Phys. Lett. 84, 669 \u00012004\u0002.\n14 We include the term “plasmon” in the naming of the investigated\nsurface polaritons, to denote that the dielectric constant \u0001(\u0006) and\nthe magnetic permeability \u0002(\u0006) of the LH material are described\nmacroscopically by a plasma dispersion law, as explained in\nRef. 9.\n15 B. Prade, J. Y. Vinet, and A. Mysyrowicz, Phys. Rev. B 44,\n13556 \u00011991\u0002.\n16 J. J. Burke, G. I. Stegeman, and T. Tamir, Phys. Rev. B 33, 5186\n\u00011986\u0002.\n17 I. V. Shadrivov, A. A. Sukhorukov, Y. S. Kivshar, A. A. Zharov,\nA. D. Boardman, and P. Egan, Phys. Rev. E 69, 016617 \u00012004\u0002.\n18 R. A. Shelby, D. R. Smith, S. C. Nemat Nasser, and S. Shultz,\nAppl. Phys. Lett. 78, 489 \u00012001\u0002.\n19 A. Snyder and J. D. Love, Optical Waveguide Theory \u0001Chapman\nand Hall, New York, 1983\u0002.\n20 H. Kogelnic and V. Ramaswamy, Appl. Opt. 13, 1857 \u00011974\u0002.\n21 R. Loudon, J. Phys. A 3, 233 \u00011970\u0002; R. Ruppin, Phys. Lett. A\n299, 309 \u00012002\u0002.\n22 M. F. Yanik and S. Fan, Phys. Rev. Lett. 92, 083901 \u00012004\u0002.\nSURFACE PLASMON POLARITONS IN GENERALIZED… PHYSICAL REVIEW B 73, 085104 \u00012006\u0002\n085104-11\n"}