{"doi":"10.1029\/2007GL030580","coreId":"195751","oai":"oai:lra.le.ac.uk:2381\/7863","identifiers":["oai:lra.le.ac.uk:2381\/7863","10.1029\/2007GL030580"],"title":"Auroral streamers and magnetic flux closure","authors":["Hubert, B.","Kauristie, K.","Amm, O.","Milan, Steve E.","Grocott, Adrian","Cowley, S. W. H.","Pulkkinen, T. I."],"enrichments":{"references":[{"id":44718420,"title":"(2006a), Dayside and nightside reconnection rates inferred from IMAGE-FUV and SuperDARN data,","authors":[],"date":null,"doi":"10.1029\/2005ja011140","raw":"Hubert, B., S. E. Milan, A. Grocott, S. W. H. Cowley, and J.-C. Ge´rard (2006a), Dayside and nightside reconnection rates inferred from IMAGE-FUV and SuperDARN data, J. Geophys. Res., 111, A03217, doi:10.1029\/2005JA011140.","cites":null},{"id":44718429,"title":"Analysis of an eastward electrojet by means of upward continuation of groundbased magnetometer data,","authors":[],"date":"1979","doi":null,"raw":"Mersmann, U., W. Baumjohann, F. Ku¨ppers, and K. Lange (1979), Analysis of an eastward electrojet by means of upward continuation of groundbased magnetometer data, J. Geophys., 45, 281–298.","cites":null},{"id":44718433,"title":"Auroral streamers: Characteristics of associated precipitation, convection and field-aligned currents,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-537-2004","raw":"Sergeev, V. A., K. Liou, P. T. Newell, S.-I. Otani, M. R. Hairson, and F. Rich (2004), Auroral streamers: Characteristics of associated precipitation, convection and field-aligned currents, Ann. Geophys., 22, 537.","cites":null},{"id":44718435,"title":"Braking of highspeed flows in the near-Earth tail,","authors":[],"date":"1997","doi":"10.1029\/97gl01062","raw":"Shiokawa, K., W. Baumjohann, and G. Haerendel (1997), Braking of highspeed flows in the near-Earth tail, Geophys. Res. Lett., 24, 1179.  O. Amm, K. Kauristie, and T. I. Pulkkinen, Finnish Meteorological Institute, Space Research, FIN-00101 Helsinki, Finland. S. W. H. Cowley, A. Grocott, and S. E. Milan, Department of Physics and Astronomy, University of Leicester, Leicester LE1 7RH, UK. B. Hubert, Laboratory for Planetary and Atmospheric Physics, University of Lie`ge, B-4000 Lie`ge, Belgium. (b.hubert@ulg.ac.be) L15105 HUBERT ET AL.: STREAMERS AND FLUX CLOSURE L15105","cites":null},{"id":44718415,"title":"bulk flows in the inner central plasmasheet,","authors":[],"date":"1992","doi":"10.1029\/91ja02701","raw":"Angelopoulos, V., W. Baumjohann, C. F. Kennel, F. V. Coroniti, M. G. Kivelson, R. Pellat, R. J. Walker, H. Lu¨hr, and G. Paschmann (1992),Bursty bulk flows in the inner central plasmasheet, J. Geophys. Res., 97, 4027.","cites":null},{"id":44718424,"title":"Bursty bulk flow intrusion to the inner plasma sheet as inferred from auroral observations,","authors":[],"date":"2003","doi":"10.1029\/2002ja009371","raw":"Kauristie, K., V. A. Sergeev, O. Amm, M. V. Kubyshkina, J. Jussila, E. Donovan, and K. Liou (2003), Bursty bulk flow intrusion to the inner plasma sheet as inferred from auroral observations, J. Geophys.","cites":null},{"id":44718418,"title":"Can the ionosphere regulate magnetospheric convection?,","authors":[],"date":"1973","doi":"10.1029\/ja078i016p02837","raw":"Coroniti, F. V., and C. F. Kennel (1973), Can the ionosphere regulate magnetospheric convection?, J. Geophys. Res., 78, 2837.","cites":null},{"id":44718419,"title":"Earthward flow bursts in the inner magnetotail and their relation to auroral brightening, AKR intensifications, geosynchronous particle injections and magnetic activity,","authors":[],"date":"1999","doi":"10.1029\/98ja02661","raw":"Fairfield, D. H., et al. (1999), Earthward flow bursts in the inner magnetotail and their relation to auroral brightening, AKR intensifications, geosynchronous particle injections and magnetic activity, J. Geophys. Res., 104, 355.","cites":null},{"id":44718426,"title":"Far ultraviolet imaging from the IMAGE spacecraft: 3. Spectral imaging of Lyman alpha and OI 135.6 nm,","authors":[],"date":"2000","doi":"10.1007\/978-94-011-4233-5_10","raw":"Mende, S. B., et al. (2000), Far ultraviolet imaging from the IMAGE spacecraft: 3. Spectral imaging of Lyman alpha and OI 135.6 nm, Space Sci. Rev., 91, 287.","cites":null},{"id":44718416,"title":"Interpretation of high-speed flows in the plasma sheet,","authors":[],"date":"1993","doi":"10.1029\/93ja02080","raw":"Chen, C. X., and R. A. Wolf (1993), Interpretation of high-speed flows in the plasma sheet, J. Geophys. Res., 98, 21,409.","cites":null},{"id":44718413,"title":"Ionospheric disturbance magnetic field continuation from the ground to the ionosphere using spherical elementary current systems,","authors":[],"date":"1999","doi":"10.1186\/bf03352247","raw":"Amm, O., and A. Viljanen (1999), Ionospheric disturbance magnetic field continuation from the ground to the ionosphere using spherical elementary current systems, Earth Planet. Space, 51, 431.","cites":null},{"id":44718412,"title":"Ionospheric signatures of bursty bulk flows,","authors":[],"date":"2002","doi":"10.1029\/2008ja013908","raw":"Amm, O., and K. Kauristie (2002), Ionospheric signatures of bursty bulk flows, Surv. Geophys., 23, 1.","cites":null},{"id":44718432,"title":"Large scale imaging of highlatitude convection with Super Dual Auroral Radar Network HF radar observations,","authors":[],"date":"1998","doi":"10.1029\/98ja01288","raw":"Ruohoniemi, J. M., and K. B. Baker (1998), Large scale imaging of highlatitude convection with Super Dual Auroral Radar Network HF radar observations, J. Geophys. Res., 103, 20,797.","cites":null},{"id":44718422,"title":"shocks directly drives transient magnetic flux closure,","authors":[],"date":null,"doi":"10.1029\/2006gl026008","raw":"Hubert, B., M. Palmroth, T. V. Laitinen, P. Janhunen, S. E. Milan, A. Grocott, S. W. H. Cowley, T. Pulkkinen, and J.-C. Ge´rard (2006b), Compression of the Earth’s magnetotail by interplanetary L15105 HUBERT ET AL.: STREAMERS AND FLUX CLOSURE L15105 5 of 6 shocks directly drives transient magnetic flux closure, Geophys. Res.","cites":null},{"id":44718431,"title":"Simple models of timedependent reconnection in a collision-free plasma with an application to substorms in the geomagnetic tail,","authors":[],"date":"1987","doi":"10.1016\/0032-0633(87)90102-4","raw":"Owen, C. J., and S. W. H. Cowley (1987), Simple models of timedependent reconnection in a collision-free plasma with an application to substorms in the geomagnetic tail, Planet. Space Sci., 35, 451.","cites":null},{"id":44718414,"title":"Spatial distribution of conductances and currents associated with north-south auroral form during a multiple-substorm period,","authors":[],"date":"1999","doi":"10.1007\/s005850050864","raw":"Amm, O., A. Pajunpa¨a¨, and U. Brandstro¨m (1999), Spatial distribution of conductances and currents associated with north-south auroral form during a multiple-substorm period, Ann. Geophys., 17, 1385.","cites":null},{"id":44718417,"title":"Theory of thin-filament motion in Earth’s magnetotail and its application to bursty bulk flows,","authors":[],"date":"1999","doi":"10.1029\/1999ja900005","raw":"Chen, C. X., and R. A. Wolf (1999), Theory of thin-filament motion in Earth’s magnetotail and its application to bursty bulk flows, J. Geophys. Res., 104, 14,613.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-08-09","abstract":"On 7 December 2000 at 2200 UT an auroral streamer was observed to develop above Scandinavia with the IMAGE-FUV global imagers. The ionospheric equivalent current deduced from the MIRACLE-IMAGE Scandinavian ground-based network of magnetometers is typical of a substorm-time streamer. Observations of the proton aurora using the SI12 imager onboard the IMAGE satellite are combined with measurements of the ionospheric convection obtained by the SuperDARN radar network to compute the dayside merging and nightside flux closure rates. On the basis of this and other similar events, it is found that auroral streamers appear during the period of most intense flux closure in the magnetotail, most often shortly after substorm onset. The ionospheric convection velocity, as measured by SuperDARN, appears to be reduced in the vicinity of the streamer, suggesting de-coupling of magnetospheric and ionospheric plasma flows in the region of enhanced ionospheric conductance","downloadUrl":"http:\/\/www.agu.org\/pubs\/crossref\/2007\/2007GL030580.shtml.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7863\/3\/Auroral%20streamers%20and%20magnetic%20flux%20closure.pdf","pdfHashValue":"dd700abfa4e1f79682be50dc8930eef7cc8b33de","publisher":"American Geophysical Union (AGU)","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7863<\/identifier><datestamp>\n                2015-12-14T17:30:05Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nAuroral streamers and magnetic flux closure<\/dc:title><dc:creator>\nHubert, B.<\/dc:creator><dc:creator>\nKauristie, K.<\/dc:creator><dc:creator>\nAmm, O.<\/dc:creator><dc:creator>\nMilan, Steve E.<\/dc:creator><dc:creator>\nGrocott, Adrian<\/dc:creator><dc:creator>\nCowley, S. W. H.<\/dc:creator><dc:creator>\nPulkkinen, T. I.<\/dc:creator><dc:description>\nOn 7 December 2000 at 2200 UT an auroral streamer was observed to develop above Scandinavia with the IMAGE-FUV global imagers. The ionospheric equivalent current deduced from the MIRACLE-IMAGE Scandinavian ground-based network of magnetometers is typical of a substorm-time streamer. Observations of the proton aurora using the SI12 imager onboard the IMAGE satellite are combined with measurements of the ionospheric convection obtained by the SuperDARN radar network to compute the dayside merging and nightside flux closure rates. On the basis of this and other similar events, it is found that auroral streamers appear during the period of most intense flux closure in the magnetotail, most often shortly after substorm onset. The ionospheric convection velocity, as measured by SuperDARN, appears to be reduced in the vicinity of the streamer, suggesting de-coupling of magnetospheric and ionospheric plasma flows in the region of enhanced ionospheric conductance.<\/dc:description><dc:date>\n2010-05-04T14:06:13Z<\/dc:date><dc:date>\n2010-05-04T14:06:13Z<\/dc:date><dc:date>\n2007-08-09<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nGeophysical Research Letters, 2007, 34,  L15105.<\/dc:identifier><dc:identifier>\n0094-8276<\/dc:identifier><dc:identifier>\nhttp:\/\/onlinelibrary.wiley.com\/doi\/10.1029\/2007GL030580\/abstract<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7863<\/dc:identifier><dc:identifier>\n10.1029\/2007GL030580<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRadio and Space Plasma Physics<\/dc:relation><dc:rights>\nThis paper was published as Geophysical Research Letters, 2007, 34,  L15105.  It is also available from http:\/\/www.agu.org\/pubs\/crossref\/2007\/2007GL030580.shtml.  Doi: 10.1029\/2007GL030580<\/dc:rights><dc:publisher>\nAmerican Geophysical Union (AGU)<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0094-8276","issn:0094-8276"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Radio and Space Plasma Physics"],"year":2007,"topics":[],"subject":["Article"],"fullText":"Auroral streamers and magnetic flux closure\nB. Hubert,1 K. Kauristie,2 O. Amm,2 S. E. Milan,3 A. Grocott,3 S. W. H. Cowley,3\nand T. I. Pulkkinen2\nReceived 4 May 2007; revised 14 June 2007; accepted 6 July 2007; published 9 August 2007.\n[1] On 7 December 2000 at 2200 UT an auroral streamer\nwas observed to develop above Scandinavia with the\nIMAGE-FUV global imagers. The ionospheric equivalent\ncurrent deduced from the MIRACLE-IMAGE Scandinavian\nground-based network of magnetometers is typical of a\nsubstorm-time streamer. Observations of the proton aurora\nusing the SI12 imager onboard the IMAGE satellite are\ncombined with measurements of the ionospheric convection\nobtained by the SuperDARN radar network to compute the\ndayside merging and nightside flux closure rates. On the\nbasis of this and other similar events, it is found that auroral\nstreamers appear during the period of most intense flux\nclosure in the magnetotail, most often shortly after substorm\nonset. The ionospheric convection velocity, as measured by\nSuperDARN, appears to be reduced in the vicinity of the\nstreamer, suggesting de-coupling of magnetospheric and\nionospheric plasma flows in the region of enhanced\nionospheric conductance. Citation: Hubert, B., K. Kauristie,\nO. Amm, S. E. Milan, A. Grocott, S. W. H. Cowley, and T. I.\nPulkkinen (2007), Auroral streamers and magnetic flux closure,\nGeophys. Res. Lett., 34, L15105, doi:10.1029\/2007GL030580.\n1. Introduction\n[2] Streamers are auroral features which extend roughly\nin the north-south direction, that have been unambiguously\nrelated to bursty bulk flows (BBF) in the magnetotail [Amm\nand Kauristie, 2002, and references therein]. They are\ncharacterized by enhanced field-aligned currents at their\ndusk and dawn edges, the current being oriented downward\n(upward) along the eastern (western) boundary. Several\nstudies have suggested that reconnection plays a role in\nthe dynamics of BBFs [Angelopoulos et al., 1992; Shiokawa\net al., 1997; Fairfield et al., 1999, Chen and Wolf, 1993].\n[3] We have developed of a method that combines global\nremote sensing of the proton aurora with SI12 and measure-\nments of the ionospheric convection with SuperDARN to\nestimate the location of the open\/closed field line boundary,\nthe open flux and the opening and closure rates of magnetic\nflux [Hubert et al., 2006a]. The accuracy of the method was\ndiscussed by Hubert et al. [2006a]. The electric field in the\nframe of reference of the moving open-closed boundary is\ncomputed and integrated along the boundary to retrieve the\nopening and closure reconnection rates. This method has\nalready been applied to several substorm cycles and to cases\nof interplanetary shocks [Hubert et al., 2006a, 2006b]. In\nthe present work, we use the method to investigate the\nrelative contribution of auroral streamers in global magnetic\nflux transfer during a substorm event. The role of BBFs as\nflux carriers has been estimated, e.g., by Angelopoulos et al.\n[1992] from the basis of magnetospheric in situ observa-\ntions which provide accurately plasma flow characteristics\nbut lack the global context.\n2. Observation of a Streamer\n2.1. Data Availability\n[4] Images of the proton aurora were recorded by the SI12\ninstrument of the IMAGE satellite [Mende et al., 2000]. The\nvelocity of the ionospheric convection is obtained from the\nSuper Dual Auroral Radar Network (SuperDARN) measure-\nments, and the ionospheric electric field is deduced by\napplying the method developed by Ruohoniemi and Baker\n[1998]. The Wide band Imaging Camera (WIC) and the\nSpectrographic Imager at 135.6 nm (SI13) instruments of\nthe IMAGE-FUV experiment, which are mostly sensitive to\nthe emissions of the electron aurora, are also used to examine\nthe morphology of the auroral features.\n[5] On 7 December 2000, the IMAGE-FUV instruments\nobserved a substorm expansion following an onset at\n2147 UT. The event started after an interval of southward\nIMF which had led to the accumulation of open magnetic\nflux, as evidenced below by the expansion of the auroral\noval. The substorm activity was seen as a \u0001550 nT\ndisturbance in the AE indices. At 2158 UT WIC recorded\nfirst signatures of the formation of north-south aligned\nauroral structures within the auroral bulge. The clearest\nimages of two coincidental auroral streamers were acquired\nby the WIC and SI13 imagers around 2202 UT (Figure 1a)\nwhile by 2206 UT the structures had faded away. One of the\nstreamers was located above northern Scandinavia, which\nmakes it possible to combine space-based data with the\nground based observations in that region (midnight). For the\nother streamer which was located in the \u00012200 MLT sector,\nground-based data are not available. The open-closed field\nline boundary determined from the SI12 image at 2201 UT,\nwhen the streamers were formed, is presented in Figure 1a.\nSuperDARN data were available at that time. The data\ncoverage was moderately good. Echoes were recorded\nabove Scandinavia, where the midnight streamer is ob-\nserved, and above Iceland, not far from the location of the\nsecond streamer, thus allowing constraint of the fit used to\nobtain the ionospheric electric field in the region of interest.\n2.2. Ionospheric Equivalent Current, and FUV\nObservations\n[6] The ionospheric equivalent current pattern was re-\ntrieved using the MIRACLE-IMAGE magnetometer chain\nGEOPHYSICAL RESEARCH LETTERS, VOL. 34, L15105, doi:10.1029\/2007GL030580, 2007\nClick\nHere\nfor\nFull\nArticle\n1Laboratory for Planetary and Atmospheric Physics, University of\nLie`ge, Lie`ge, Belgium.\n2Finnish Meteorological Institute, Space Research, Helsinki, Finland.\n3Department of Physics and Astronomy, University of Leicester,\nLeicester, U.K.\nCopyright 2007 by the American Geophysical Union.\n0094-8276\/07\/2007GL030580$05.00\nL15105 1 of 6\noperated in Scandinavia (Figure 1b) [Amm and Viljanen,\n1999]. The streamer develops shortly after 2200 UT follow-\ning the expansion onset at 2147 UT. A map of equivalent\ncurrent (EC) obtained at 2201 UT is presented in Figure 1b,\nwith the corresponding part of WIC image overlaid. The EC\npattern of Figure 1b presents strong poleward currents\nflowing roughly along the streamer direction and a\ncounterclockwise vortex on the western side of the current\nchannel, consistently with previous studies [Amm et al.,\n1999; Kauristie et al., 2003]. Assuming a homogeneous\nconductance, this vortex can be associated with upward field\naligned currents (FACs). When the streamer developed, the\nwestward equivalent current moved poleward in concert with\nthe poleward motion of the polar cap boundary deduced from\nthe SI12 observations. Figure 2 shows the EC intensity versus\nlatitude and time in the midnight sector as deduced from\nupward continuated magnetometer data [Mersmann et al.,\n1979] with the polar cap boundary identified from SI12\noverplotted in black. This figure suggests a close relationship\nFigure 1. (a) Polar view of the IMAGE-FUV WIC, SI13 and SI12 images (magnetic coordinates), with the open\/closed\nfield line boundary overlaid on the SI12 image at 2201 UT. (b) Map of the ionospheric equivalent currents above\nScandinavia (geographic coordinates) in arbitrary units, with the auroral signal from the WIC image in AD units.\nFigure 2. East-west equivalent currents (negative values\ncorrespond to westward currents, unit A\/m) deduced from the\nMIRACLE-IMAGE magnetometer network, with the SI12\nopen\/closed boundary overlaid in black (MLT \u0002 UT + 2.5).\nL15105 HUBERT ET AL.: STREAMERS AND FLUX CLOSURE L15105\n2 of 6\nbetween the poleward boundary of the electrojet, the pole-\nward optical boundary of the Doppler-shifted Lyman-a\nemission and the polar cap boundary.\n2.3. Reconnection at the Northern Edge of the\nStreamer\n[7] The location and motion of the open-closed field line\nboundary have been retrieved from the SI12 auroral images.\nThe ionospheric electric field deduced from the Super-\nDARN data is then coupled with these results to estimate\nthe electric field in the reference frame of the moving\nboundary, and hence the reconnection rates. Figure 3a\nshows a UT-MLT plot of the differential reconnection\nvoltage along the open-closed boundary dVdMLT (with MLT\ngiven in degrees), i.e. the voltage per unit MLT degree,\nwhich is proportional to ~E \u0003 d~l. Red (blue) shades corre-\nFigure 3. (a) Differential reconnection voltage, (b) open flux, (c) opening voltage and (d) closure voltage obtained from\nSI12 and SuperDARN observations on 7 December 2000. The solid vertical line indicates the substorm onset, and the\ndotted vertical lines indicate the development of the auroral streamer.\nL15105 HUBERT ET AL.: STREAMERS AND FLUX CLOSURE L15105\n3 of 6\nspond to negative (positive) voltages, i.e. a closure of open\n(opening of closed) magnetic flux, respectively. The flux\nclosure rate was clearly intensified in the midnight sector\naround the time of streamer appearance. Closure rates were\nhigh between 1800 and 0100 MLT and, in particular along\nfield lines threading the poleward edges of both streamers.\nA more global view is shown in Figures 3b–3d where we\npresent both the open magnetic flux (Figure 3b) and\nopening and closure voltages (Figures 3c and 3d) deduced\nfrom the IMAGE-FUV and SuperDARN observations. Due\nto reconnection at the dayside magnetopause, the magneto-\nsphere accumulates up to \u00010.9 GWb of open flux until the\nonset of the substorm expansion phase. The flux closure\nvoltage then reaches \u0001150 kV around 2200 UT, indicating\nvery intense nightside reconnection at that time.\n[8] We have also integrated ~E \u0003 d~l along the open\/closed\nboundary in the MLT sector corresponding to the poleward\nedge of the observed streamer (2255 to 2330 MLT) to\ndetermine the associated closure voltage (Figure 4). A strong\nincrease of the reconnection voltage is observed around\n2200 UT, reaching a maximum of \u000125 kV. The oscillations\nobserved in the closure voltage in Figure 3 between 2200 and\n2330UTwith a period of roughly 30min are also found when\nwe restrict our attention to that narrow MLT sector, and are\ndue to changes in the poleward velocity of the boundary. In\ngeneral, the motion of the boundary produces the main\ncontribution to the closure voltage during the expansion\nphase, as can be expected from the rapid poleward expansion\nof the substorm auroral bulge. In the present case, this\ndominance reduces the impact of potential uncertainties\nrelated with the limited SuperDARN data coverage in some\nareas.We suggest that these oscillations are not specific to the\nstreamer itself, because its lifetime is much shorter than the\n30 min period. The MLT sector of the streamer contributes\nless than 20% to the total, and the oscillations of the closure\nvoltage appear as a global process probably related with the\ndevelopment of the substorm expansion phase. Similar\nresults can be obtained concerning the second streamer\nlocated in the premidnight sector. Note that the period of\n\u000130 min lies in the range of Pc6 pulsations.\n3. Discussion\n[9] We discuss observations of a typical streamer which\ndeveloped during the early stage of a substorm expansion\nphase, when the flux closure voltage dramatically increased\nafter the onset to reach a maximum magnitude of \u0001150 kV.\nThe time coincidence between the formation of the streamer\nand strong overall flux closure rate shortly after the onset\nsuggests a possible causal relation between these two phe-\nnomena. However, intense flux closure may not be the only\ncondition necessary to form BBFs and auroral streamers. An\nenhanced flux closure is the natural signature of the substorm\nexpansion phase, and the simultaneous appearance of the\nstreamer may be considered incidental, unless a mechanism\nlinking BBFs and flux closure would exist.\n[10] The flux tubes threading a BBF consists of a so\ncalled ‘‘plasma bubble’’ flowing fast Earthward in the tail\n[Sergeev et al., 2004; Chen and Wolf, 1993, 1999]. In the\ncase of BBFs and under the frozen-in approximation, the\nflux tubes that go through closure must be initially depleted\ncompared to the surrounding medium, as BBFs present a\nlow plasma density. This might be due either to localised\ntime-dependence of the lobe plasma density flowing into the\nreconnection region, or to a localised displacement (e.g.\nearthward) of the reconnection region itself. Now the initial\nearthward-directed velocity of the newly-closed flux tubes\nand accelerated plasma following tail reconnection is \u0001VA,\nthe Alfven speed in the tail lobes [see, e.g., Owen and\nCowley, 1987]. Since VA is larger for lower plasma density\nwith a given tail lobe field strength, it is inevitable that a\nlocalised reduction in the lobe plasma density on the newly-\nclosed flux tubes, due e.g. to one or other of the above\neffects, will produce a localised channel of higher-speed\nearthward flow in the plasma sheet. From this standpoint,\nthe high velocity of the plasma flowing out of the recon-\nnection site does not stem from the value of the reconnec-\ntion rate itself, but from the value of the Alfven velocity\ncharacterizing the plasma entering the reconnection region.\nThe observations presented here show that the related\nreconnection rates also become enhanced, indicating an\nenhancement in the reconnection-associated cross-tail elec-\ntric field Ey in the tail. Since the earthward contraction\nspeed of the newly-closed flux tubes is given by Ey\/Bz\u0002 VA,\nwhere Bz is the field component threading through the\ncurrent sheet, the implication is that Bz \u0002 Ey\/VA would also\nbecome enhanced in a region where the increase of Ey\nwould dominate that of VA. Regions of high-speed low-\ndensity plasma threaded by a strong Bz are indeed the\ndefining features of BBFs. Within this scenario, the inter-\nchange instability mechanism proposed by Chen and Wolf\n[1993, 1999] might operate in a later phase of flux-tube\nevolution, once the initial contraction following tail recon-\nnection is over.\n[11] SuperDARN radar data obtained above Northern\nScandinavia between 2200 and 2202 UT reveal that the\nionospheric convection was very low within the streamer,\nbelow 200 m s\u00041. This reduced convection suggests that the\nstrong auroral precipitation (responsible for the bright\nsignatures in the IMAGE-FUV images) caused intense\nionisation of the atmospheric gas thus favoring ionospheric\nfield line tying [Coroniti and Kennel, 1973], which does not\nexclude strong flows from occurring along the same field\nline in the equator plane, and allows some decoupling\nbetween the magnetospheric and ionospheric plasma flows\nin mesoscale structures. A highly conductive ionosphere is\nFigure 4. Closure voltage derived from the line integral of\nthe electric field along the open-closed field line boundary\nin the MLT sector where the auroral streamer is observed.\nL15105 HUBERT ET AL.: STREAMERS AND FLUX CLOSURE L15105\n4 of 6\nable to discharge efficiently the electric potentials of mag-\nnetospheric origin which can be considered as a cause for\nthe decoupling. In-situ data from the tail (which are not\navailable for the interval discussed here) would be necessary\nto rigorously establish that the observed streamer was\nactually related with a BBF.\n[12] In order to consolidate the relation between flux\nclosure and streamer formation on observational grounds,\nwe analyzed the reconnection voltage of elevenother intervals\nwith a north-south aligned arc, observed with IMAGE-FUV\nduringwinter 2000on10\/02, 1109UT; 10\/03, 0339UT; 10\/07\n0758 UT; 10\/29, 0420 UT; 11\/01, 0558 UT; 11\/03, 2345 UT;\n11\/29, 0147 UT; 12\/08, 0258 UT, 12\/23, 0802 UT; 12\/23,\n1023 UT and 12\/23, 1207UT. Despite the limited radar data\ncoverage of some of these events, these intervals show a\nrelation between streamers and flux closure. Higher closure\nvoltages appear to favor the appearance of streamers: the\nclosure voltage was found to range between \u0001\u000450 and\n\u0001\u0004125 kV in all cases but one (11\/03\/2000). In this latter\ncase, the voltage was only 22 kV, but the polar edge of the\nstreamer was located in the MLT sector threaded by the field\nlines along which the flux closure takes place. Cases with\nhigher closure voltageswere found during an expansion phase,\nor shortly after during the recovery phase. Surprisingly,\nconsidering longer time scales, most of these streamers were\nobserved during or following an interval of disturbed Dst\nindex (8 cases with Dst < \u000430 nT, and up to Dst \u0001\u0004127 nT).\n[13] Observations of dipolarized field lines threading\nBBFs by Angelopoulos et al. [1992] indeed relate BBFs to\nmagnetic flux closure. The time resolution of our method\n(\u000115 min) does not however allow us to fully resolve\ntransient reconnection on these time scales, so that we may\nhave missed a transient signature directly associated with the\nformation of the streamer. The time lag reported by\nAngelopoulos et al. [1992] between the BBF acceleration\nand the magnetic dipolarization may suggest that the plasma\nthreaded by newly closed field lines evolve slowly uptail\nfrom the reconnection site until the conditions necessary for\nan additional acceleration mechanism are met, due to a\nspecific topology of the electromagnetic field and of the\ncurrent system. Possible candidates to accelerate the plasma\nbubble are again the ~j \u0005 ~B force, and the interchange\ninstability proposed by Chen and Wolf [1993, 1999], for\nexample. Another possibility may be that the onset of\nreconnection takes place under some conditions that differ\nfrom those favoring the formation of BBFs, so that a BBF\nwill not form until other open flux tubes with the suitable\nproperties will have reached the X-line, after the formation of\nthe reconnection site.\n[14] In this study, the ionospheric equivalent currents\ndeduced from the MIRACLE-IMAGE and the SI12 bound-\nary identification consistently indicate that the polar bound-\nary moved poleward prior to the streamer development\n(Figure 2) indicating that flux closure started before the\nformation of the streamer. Indeed, the substorm expansion\nonset appeared in the FUV images \u000113 min before the\nstreamer. However, a more extensive study including in-situ\nmeasurements in the tail is needed to fully verify the scenario\nproposed above. Note that the transition between the\nstretched tail and the dipolarized BBF can be idealized by a\nfield changing orientation along a helix, with a curl parallel to\nthe field implying field-aligned currents compatible with the\nusual current pattern of an auroral streamer.\n4. Summary\n[15] An auroral streamer was observed to develop in the\nmidnight sector during a substorm expansion phase on\n7 December 2000 between 2200 and 2206 UT using the\nMIRACLE-IMAGE magnetometer network, the FUV\ninstruments onboard the IMAGE satellite, and the Super-\nDARN radar network. The open flux accumulated prior to\nonset was high, reaching \u00010.9 GWb. The flux closure\nvoltage, oscillating with a period of \u000130 min, reached a\nmaximum magnitude of \u0001150 kV roughly at the time of\nthe formation of the streamer. The reconnection rate also\nreached a maximum on field lines threading the poleward\nedge of the streamer. Ionospheric convection data suggest\nionospheric field line tying and consequent decoupling of\nmagnetospheric and ionospheric flows in the vicinity of\nthe streamer. The closure voltage computed here is con-\nsistent with a BBF formed by the closure of plasma-\ndepleted open flux tubes some time after the reconnection\nonset, with high plasma velocity at the exit of the\nreconnection site due to the ~j \u0005 ~B acceleration and\npossibly followed by the set up of an interchange insta-\nbility. The relation linking flux closure and north-south\naligned arcs is also found for eleven other cases observed\nwith IMAGE-FUV.\n[16] Acknowledgments. B. Hubert is supported by the Belgian\nNational Fund for Scientific Research (FNRS). This work was funded by\nthe PRODEX program managed by ESA in collaboration with the Belgian\nFederal Science Policy Office. Work at Leicester was supported by PPARC\ngrant PPA\/G\/O\/2003\/00013. S.W.H. Cowley was supported by a Royal\nSociety Leverhulme Trust Senior Fellowship. Work at FMI was supported\nby the Academy of Finland. The MIRACLE and magnetometer (IMAGE)\nnetworks are operated as a European collaboration under the leadership of\nthe Finnish Meteorological Institute.\nReferences\nAmm, O., and K. Kauristie (2002), Ionospheric signatures of bursty bulk\nflows, Surv. Geophys., 23, 1.\nAmm, O., and A. Viljanen (1999), Ionospheric disturbance magnetic field\ncontinuation from the ground to the ionosphere using spherical elemen-\ntary current systems, Earth Planet. Space, 51, 431.\nAmm, O., A. Pajunpa¨a¨, and U. Brandstro¨m (1999), Spatial distribution of\nconductances and currents associated with north-south auroral form during\na multiple-substorm period, Ann. Geophys., 17, 1385.\nAngelopoulos, V., W. Baumjohann, C. F. Kennel, F. V. Coroniti, M. G.\nKivelson, R. Pellat, R. J. Walker, H. Lu¨hr, and G. Paschmann\n(1992),Bursty bulk flows in the inner central plasmasheet, J. Geophys.\nRes., 97, 4027.\nChen, C. X., and R. A. Wolf (1993), Interpretation of high-speed flows in\nthe plasma sheet, J. Geophys. Res., 98, 21,409.\nChen, C. X., and R. A. Wolf (1999), Theory of thin-filament motion in\nEarth’s magnetotail and its application to bursty bulk flows, J. Geophys.\nRes., 104, 14,613.\nCoroniti, F. V., and C. F. Kennel (1973), Can the ionosphere regulate\nmagnetospheric convection?, J. Geophys. Res., 78, 2837.\nFairfield, D. H., et al. (1999), Earthward flow bursts in the inner\nmagnetotail and their relation to auroral brightening, AKR intensi-\nfications, geosynchronous particle injections and magnetic activity,\nJ. Geophys. Res., 104, 355.\nHubert, B., S. E. Milan, A. Grocott, S. W. H. Cowley, and J.-C. Ge´rard\n(2006a), Dayside and nightside reconnection rates inferred from\nIMAGE-FUV and SuperDARN data, J. Geophys. Res., 111, A03217,\ndoi:10.1029\/2005JA011140.\nHubert, B., M. Palmroth, T. V. Laitinen, P. Janhunen, S. E. Milan,\nA. Grocott, S. W. H. Cowley, T. Pulkkinen, and J.-C. Ge´rard\n(2006b), Compression of the Earth’s magnetotail by interplanetary\nL15105 HUBERT ET AL.: STREAMERS AND FLUX CLOSURE L15105\n5 of 6\nshocks directly drives transient magnetic flux closure, Geophys. Res.\nLett., 33, L10105, doi:10.1029\/2006GL026008.\nKauristie, K., V. A. Sergeev, O. Amm, M. V. Kubyshkina, J. Jussila,\nE. Donovan, and K. Liou (2003), Bursty bulk flow intrusion to the\ninner plasma sheet as inferred from auroral observations, J. Geophys.\nRes., 108(A1), 1040, doi:10.1029\/2002JA009371.\nMende, S. B., et al. (2000), Far ultraviolet imaging from the IMAGE space-\ncraft: 3. Spectral imaging of Lyman alpha and OI 135.6 nm, Space Sci.\nRev., 91, 287.\nMersmann, U., W. Baumjohann, F. Ku¨ppers, and K. Lange (1979), Analysis\nof an eastward electrojet by means of upward continuation of ground-\nbased magnetometer data, J. Geophys., 45, 281–298.\nOwen, C. J., and S. W. H. Cowley (1987), Simple models of time-\ndependent reconnection in a collision-free plasma with an application\nto substorms in the geomagnetic tail, Planet. Space Sci., 35, 451.\nRuohoniemi, J. M., and K. B. Baker (1998), Large scale imaging of high-\nlatitude convection with Super Dual Auroral Radar Network HF radar\nobservations, J. Geophys. Res., 103, 20,797.\nSergeev, V. A., K. Liou, P. T. Newell, S.-I. Otani, M. R. Hairson, and F. Rich\n(2004), Auroral streamers: Characteristics of associated precipitation,\nconvection and field-aligned currents, Ann. Geophys., 22, 537.\nShiokawa, K., W. Baumjohann, and G. Haerendel (1997), Braking of high-\nspeed flows in the near-Earth tail, Geophys. Res. Lett., 24, 1179.\n\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\nO. Amm, K. Kauristie, and T. I. Pulkkinen, Finnish Meteorological\nInstitute, Space Research, FIN-00101 Helsinki, Finland.\nS. W. H. Cowley, A. Grocott, and S. E. Milan, Department of Physics and\nAstronomy, University of Leicester, Leicester LE1 7RH, UK.\nB. Hubert, Laboratory for Planetary and Atmospheric Physics, University\nof Lie`ge, B-4000 Lie`ge, Belgium. (b.hubert@ulg.ac.be)\nL15105 HUBERT ET AL.: STREAMERS AND FLUX CLOSURE L15105\n6 of 6\n"}