{"doi":"10.1093\/analys","coreId":"217370","oai":"oai:eprints.lse.ac.uk:32085","identifiers":["oai:eprints.lse.ac.uk:32085","10.1093\/analys"],"title":"Comments on Longworth and Weber","authors":["Cartwright, Nancy"],"enrichments":{"references":[{"id":17250690,"title":"Causal Powers: What Are They? Why Do We Need Them? What Can and Cannot be Done with Them?","authors":[],"date":"2007","doi":null,"raw":"---- (2007). Causal Powers: What Are They? Why Do We Need Them? What Can and Cannot be Done with Them? Contingency and Dissent in Science Series, London: Centre for Philosophy of Natural and Social Science, LSE.","cites":null},{"id":17250697,"title":"Causality and Exogeneity in Non-stationary Economic Time-Series’, Causality: Metaphysics and Methods","authors":[],"date":"2004","doi":"10.1016\/s0573-8555(04)69002-x","raw":"--- (2004). ‘Causality and Exogeneity in Non-stationary Economic Time-Series’, Causality: Metaphysics and Methods Technical Report CTR 18-04, CPNSS, London School of Economics.","cites":null},{"id":17250696,"title":"Causality in Macroeconomics,","authors":[],"date":"2001","doi":"10.1017\/cbo9780511613050.005","raw":"Hendry, David (2001). Causality in Macroeconomics, Cambridge University Press.","cites":null},{"id":17250686,"title":"Connecting Economic Models to the Real World’,","authors":[],"date":"2006","doi":"10.1177\/0048393106287210","raw":"Alexandrova, Anna (2006), ‘Connecting Economic Models to the Real World’, Philosophy of the Social Sciences, 36: 173-192.","cites":null},{"id":17250698,"title":"Guala","authors":[],"date":"2005","doi":"10.1017\/cbo9780511614651","raw":"12 Cf. Guala (2005), Alexandrova (2006), (2007); Gruene-Yanoff (2006); Humphreys (2009); Reiss (2007), Morgan (2001).","cites":null},{"id":17250693,"title":"Learning from Economic Models’, Paper presented at the 20 th","authors":[],"date":"2006","doi":"10.1007\/s10670-008-9138-6","raw":"Grüne-Yanoff, Till (2006). ‘Learning from Economic Models’, Paper presented at the 20 th Biennial Meeting of the Philosophy of Science Association, Vancouver.","cites":null},{"id":17250688,"title":"Making Models Count’,","authors":[],"date":"2007","doi":"10.4324\/9781315054391","raw":"---- (2007) ‘Making Models Count’, Philosophy of Science 75: 383-404.","cites":null},{"id":17250701,"title":"Making Things Happen,","authors":[],"date":"2003","doi":"10.1093\/0195155270.001.0001","raw":"Woodward, James (2003). Making Things Happen, Oxford University Press.","cites":null},{"id":17250700,"title":"Models, Stories and the Economic World’,","authors":[],"date":"2001","doi":"10.1080\/13501780110078972","raw":"Morgan, Mary (2001). ‘Models, Stories and the Economic World’, Journal of Economic Methodology 8;3: 361-384.","cites":null},{"id":17250689,"title":"Nature's Capacities and their Measurement,","authors":[],"date":"1989","doi":"10.1093\/0198235070.001.0001","raw":"Cartwright, Nancy (1989). Nature's Capacities and their Measurement, New York: Oxford University Press.","cites":null},{"id":17250691,"title":"Otto Neurath: Philosophy between Science and Politics,","authors":[],"date":"1996","doi":"10.1017\/cbo9780511598241.001","raw":"Cartwright Nancy, Jordi Cat, Lola Fleck, Thomas E Uebel (1996). Otto Neurath: Philosophy between Science and Politics, New York: Cambridge University Press, Ideas in Context Series No. 38.","cites":null},{"id":17250699,"title":"Preamble to the IARC Monographs on the Evaluation of Carcinogenic Risks to Humans. Available at http:\/\/monographs.iarc.fr Last accessed,","authors":[],"date":"2006","doi":"10.1002\/food.19900341025","raw":"IARC (2006). Preamble to the IARC Monographs on the Evaluation of Carcinogenic Risks to Humans. Available at http:\/\/monographs.iarc.fr Last accessed, September 4, 2009.","cites":null},{"id":17250695,"title":"The Inexact but Separate Science of Economics, Cambridge:","authors":[],"date":"1992","doi":"10.1017\/cbo9780511752032.016","raw":"Hausman, Daniel M. (1992 ). The Inexact but Separate Science of Economics, Cambridge: Cambridge University Press.","cites":null},{"id":17250694,"title":"The Methodology of Experimental Economics, Cambridge:","authors":[],"date":"2005","doi":"10.1017\/cbo9780511614651","raw":"Guala, Francesco (2005). The Methodology of Experimental Economics, Cambridge: Cambridge University Press.","cites":null},{"id":17250692,"title":"The Use of ‘Race’ as a Variable in Biomedical Research,","authors":[],"date":"2009","doi":null,"raw":"Efstathiou, Sophia (2009). The Use of ‘Race’ as a Variable in Biomedical Research, PhD Dissertation, University of California San Diego, UMI Press, 2009.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-04","abstract":"As Francis Longworth discusses, HC&UT argues that there is no such thing as the causal relation nor a handful of causal relations and not even a truckload. Rather, there is only a seemingly endless array of relations, called ‘thick’ relations in the book, that may be loosely grouped under the label ‘causal’, with a vast variety of different clusterings for different purposes. So I do not see Hitchcock’s question as posing an objection. Once we have served our purpose by labelling a relation ‘causal’, there may well be nothing added, helpful to this purpose, by noting further that the relation is one of feeding gasoline to the carburettor rather than, say, stuffing it in or making it available. For instance, if our purpose is to predict how probabilistic changes propagate across a set of quantities supposing the probability of one is changed ‘surgically’, this purpose is served once we can point to the probability-change-making relations among these quantities and label them as ‘causal’ in the Bayes-nets sense.\\ud\n\\ud\nMy purpose in labelling a great many relations as ‘causal’ is to counter current-day ‘Humeans’, like David Lewis, John Earman and Bas van Fraassen. These philosophers are enamoured of some one or another special set of features in nature, features that are conceived of as ‘inert’, ‘non-active’, ‘temporally and spatially local’ or whatever. A great many features I see around me – and that appear to be essential in every successful scientific intervention I have studied – are missing from their special sets. These philosophers – the ‘Humeans’ – are the ones who make the causal\/non-causal distinction, with their favoured concepts labelled ‘non-causal’. In maintaining that pushing, pinching, compressing, repelling, attracting and so forth are causal, I imply that these are not among the favoured sets of the Humeans and they are not ","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/217370.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/32085\/1\/Comments%20on%20Longworth%20and%20Weber%20%28LSERO%29.pdf","pdfHashValue":"6bf0ed6ced31c15fbbc137166bb7023115b70605","publisher":"Oxford Journals","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:32085<\/identifier><datestamp>\n      2012-04-24T11:27:47Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5048<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3134<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/32085\/<\/dc:relation><dc:title>\n        Comments on Longworth and Weber<\/dc:title><dc:creator>\n        Cartwright, Nancy<\/dc:creator><dc:subject>\n        B Philosophy (General)<\/dc:subject><dc:description>\n        As Francis Longworth discusses, HC&UT argues that there is no such thing as the causal relation nor a handful of causal relations and not even a truckload. Rather, there is only a seemingly endless array of relations, called ‘thick’ relations in the book, that may be loosely grouped under the label ‘causal’, with a vast variety of different clusterings for different purposes. So I do not see Hitchcock’s question as posing an objection. Once we have served our purpose by labelling a relation ‘causal’, there may well be nothing added, helpful to this purpose, by noting further that the relation is one of feeding gasoline to the carburettor rather than, say, stuffing it in or making it available. For instance, if our purpose is to predict how probabilistic changes propagate across a set of quantities supposing the probability of one is changed ‘surgically’, this purpose is served once we can point to the probability-change-making relations among these quantities and label them as ‘causal’ in the Bayes-nets sense.\\ud\n\\ud\nMy purpose in labelling a great many relations as ‘causal’ is to counter current-day ‘Humeans’, like David Lewis, John Earman and Bas van Fraassen. These philosophers are enamoured of some one or another special set of features in nature, features that are conceived of as ‘inert’, ‘non-active’, ‘temporally and spatially local’ or whatever. A great many features I see around me – and that appear to be essential in every successful scientific intervention I have studied – are missing from their special sets. These philosophers – the ‘Humeans’ – are the ones who make the causal\/non-causal distinction, with their favoured concepts labelled ‘non-causal’. In maintaining that pushing, pinching, compressing, repelling, attracting and so forth are causal, I imply that these are not among the favoured sets of the Humeans and they are not …<\/dc:description><dc:publisher>\n        Oxford Journals<\/dc:publisher><dc:date>\n        2010-04<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/32085\/1\/Comments%20on%20Longworth%20and%20Weber%20%28LSERO%29.pdf<\/dc:identifier><dc:identifier>\n          Cartwright, Nancy  (2010) Comments on Longworth and Weber.  Analysis, 70 (2).  pp. 325-330.  ISSN 0003-2638     <\/dc:identifier><dc:relation>\n        http:\/\/analysis.oxfordjournals.org\/<\/dc:relation><dc:relation>\n        10.1093\/analys\/anp158<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/32085\/","http:\/\/analysis.oxfordjournals.org\/","10.1093\/analys\/anp158"],"year":2010,"topics":["B Philosophy (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nNancy Cartwright \nComments on Longworth and Weber \n \nArticle (Accepted version) \n \n \n Original citation: \nCartwright, Nancy (2010) Comments on Longworth and Weber. Analysis, 70 (2). pp. 325-330. \nISSN 0003-2638 \nDOI: 10.1093\/analys\/anp158 \n \n© 2010 The Analysis Trust \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/32085\/ \nAvailable in LSE Research Online: April 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n \nComments on Longworth and Weber discussion \n \nAs Francis Longworth discusses, HC&UT argues that there is no such thing as the causal \nrelation nor a handful of causal relations nor even a truck load. Rather, there is only a \nseemingly endless array of relations, called ‘thick’ relations in the book, that may be loosely \ngrouped under the label ‘causal’, with a vast variety of different clusterings for different \npurposes. So I do not see Hitchcock’s question as posing an objection. Once we have \nserved our purpose by labelling a relation ‘causal’, there may well be nothing added, helpful \nto this purpose, by noting further that the relation is one of feeding gasoline to the carburettor \nrather than, say, stuffing it in or making it available. For instance, if our purpose is to predict \nhow probabilistic changes propagate across a set of quantities supposing the probability of \none is changed ‘surgically’, this purpose is served once we can point to the probability-\nchange-making relations among these quantities and label them as ‘causal’ in the Bayes-\nnets sense. \n \nMy purpose in labelling a very great many relations as ‘causal’ is to counter current-day \n‘Humeans’, like David Lewis, John Earman and Bas van Fraassen. These philosophers are \nenamoured of some one or another special set of features in nature, features that are \nconceived of as ‘inert’, ‘non-active’, ‘temporally and spatially local’ or whatever. A great many \nfeatures I see around me – and that appear to be essential in every successful scientific \nintervention I have studied – are missing from their special sets. These philosophers – the \n‘Humeans’ – are the ones who make the causal\/non-causal distinction, with their favoured \nconcepts labelled ‘non-causal’. In maintaining that pushing, pinching, compressing, repelling, \nattracting and so forth are causal, I imply that these are not among the favoured sets of the \nHumeans and they are not reducible to features in these sets. And of course I also maintain \nthat they are every bit as much in the world, and play as great a role in real science, as the \n‘non-causal’ features the Humeans admire.  \n \nSo, thick descriptions of relations labelled ‘causal’ need not be causal-content increasing. \nIndeed they can be causal-content decreasing. Consider ‘the pesticide smothers eel worms’, \nwhich is a possible thick description for an arrow in a causal-Bayes-net of Judea Pearl \nrepresenting ‘the pesticide causes eelworm death’. The arrow is appropriate only if \nsmothering is part of a set of relations that together satisfy the Bayes-nets axioms. But being \npart of such a set is not implied by ‘smothers’. This fact may make trouble for Longworth’s \nown proposal, assuming, as I would, that being correctly representable by a causal-Bayes-\nnet arrow should be among Longworth’s right-hand-side disjuncts.  \n \nI hope that Longworth can steer around this kind of problem, however, because the scheme \nhe offers can make causality a far more useful concept than I fear it to be. Consider: If thick \ndescriptions are not composites of ‘causes’ plus some non-causal description there may well \nbe criteria for the application of the thick label that don’t include the characterizing features \npointed to in labelling the relation ‘causal’. If in turn the thick description implies these \nfeatures, we then have an independent way to identify when these features obtain. This is a \npowerful tool. Consider for instance how useful it would be to have independently accessible \ncriteria for when a set of relations satisfies the Bayes-nets axioms or transmits a mark or \nreliably produces a targeted outcome. \n \nThe possibility of inferring from thick descriptions to ‘causes’ is independent of the other half \nof Longworth’s scheme, which takes causality to be analysable as a (possibly very long) \ndisjunction. Here I have a weaker view: Family resemblance is the best we can hope for.1 \nNor do I see why we need the stronger claim. If the upward implications from thick \ndescriptions to features characterizing causal laws work, Longworth’s answer to Hitchcock \ngoes through whether or not a proper ‘if-and-only-if’ can be provided. And, as I just argued, \n                                                          \n1 Hence I don’t really hold with Longworth’s interpretation (iii) of me. \nthe upwards implications would be a boon whether or not Hitchcock’s question raises \nproblems for my claims about thick relations. \n \nWith respect to ‘if and only if’, I think there’s no point in doing it unless it can be done \nproperly. There I’m sceptical. Hall’s two concepts are not two concepts but two loose \ngroupings, as are the labels in Longworth’s (DTC1). Consider just the probabilistic theory of \ncausality. HC&UT argues that the correct expression of it depends on the exact form of the \ncausal-probabilistic laws at work as well as a variety of facts about the population. Nor \nshould this be surprising. Causation is a concept from ordinary life – what Otto Neurath \ncalled a ‘ballungen’ concept:2 a vague, rough-edged congestion of ideas and criteria that \nserves a lot of different purposes at once and often none of them very precisely. As Stuart \nHampshire maintained, such concepts should not be subject to more rigour than they can \nbear.  \n \nYet to figure in science they must be rigorous. Even narrowing consideration to scientific \ncontexts, though, I would not expect ‘if-and-only-if’ to be possible. As Sophia Efstathiou \nstresses,3 when ordinary concepts are brought into science they get transformed and \ntransformed into concepts that do different but very specific jobs in different sciences in \ndifferent ways. Quantum field theory requires a different concept of causation than bicycle \nmakers do, which is different again from concepts needed in various social sciences. Even \nwithin economics a number of different concepts are available, and useful, as HC&UT \nillustrates. There’s no reason to think that this array of scientifically-transformed causal \nconcepts is finite or fixed or has any system to it. \n \nAs to Weber’s comments, I agree with all, except his interpretation of me and his enthusiasm \nfor IARC. I am less enthusiastic not because I advocate less diversity, but more. My \ndistinction between methods that clinch conclusions and those that merely vouch for them is \npart of a larger study of evidence-ranking and conclusion-grading schemes.4 There is now \nan array of these, all looking much like IARC’s, though often less nuanced. I argue that we \nneed accounts of 1)the quality of evidence – how likely is the evidence claim to be true, \n2)relevance – in what ways and how strongly does it bear on the conclusion, and 3)how to \nevaluate conclusions in light of all evidence. Most guides focus on 1), ignore 2)5 and give \nflawed advice about 3).  \n \nIn IARC we see 1) in the assessment of individual studies (“Each [epidemiological] study is \nassessed according to three criteria….”; for experimental animals, “Conclusion (1) is drawn if \nthere are high quality studies…”).6  3) is done in two steps: First assign sufficient, limited, \ninadequate or lack labels for each of the three categories (epidemiological, animal studies, \nmechanistic); second, draw the conclusion labelled ‘group x’ according to the rules Weber \nsketches. So we can conclude “carcinogenic to humans” if there is sufficient epidemiological \nevidence for carcinogenicity in humans and we can conclude this if “a positive relationship \nhas been observed in studies in which chance, bias and confounding could be ruled out with \nreasonable confidence.” Thus unbiased, etc. epidemiological studies trump the rest: Positive \nresults from these yield a positive conclusion even if evidence from the other modes is \ninadequate or negative.  \n                                                          \n2 For further discussion of this see Cartwright, Cat, Fleck and Uebel (l996). \n3 See Efstathiou (2009) on what she calls ‘founded’ concepts. \n4 See my website (http:\/\/personal.lse.ac.uk\/cartwrig\/Default.htm) for my own papers on these topics and \nreferences therein to others. \n5 For instance, relevance, as opposed to quality and methods for drawing overall conclusions, is not explicitly \naddressed in the IARC scheme. But looking at the scheme, as Weber describes it, it appears that the relevance of \npositive epidemiological results on some human population to ‘is carcinogenic to humans’ is taken for granted (I \nthink fallaciously), whereas the relevance of animal results requires a hypothesis about shared mechanisms. \n6 IARC (2006). \n \nWhy? The only sensible reason I have come up with is that of chapter I.3: These unbiased \n(etc.) studies are clinchers – given the background assumptions,7 a probabilistic difference \nin the occurrence of cancer between exposed and unexposed groups deductively implies \nthat the agent caused cancer in the study population.8 The importance of discussing \nclinching is not, as Weber suggests, to argue that a single study is sufficient but the reverse. \nWhy prefer these studies? ‘Because they are unbiased (etc.)’. What’s so good about that? In \nthe end, I take it, the answer is that lack of bias (etc.) is enough to guarantee the conclusion. \nBut now it is hard to see why these studies trump others. Deductive conclusions are only as \nsure as their premises. Premises are never certain.9 So the conclusions aren’t either. We \ngive a good shot at ensuring the premises. But why have more confidence that we have \nsucceeded than we have in arguments that may have equally – or even more – secure \npremises but not such a tight fit between premises and conclusion? From this perspective \nthe most sensible procedure seems to be to look at all the studies together and give an \noverall evaluation, as best possible, not to suppose that following a recipe to reduce bias \n(etc) will always produce more reliable results than studies that rely on mechanisms or \nanimal models or even statistical studies with some bias. \n \nWeber also takes my connection between types of systems or types of conclusions on the \none hand and types of evidence on the other to suggest conclusions be drawn from one type \nof study alone. In a sense I maintain the reverse. All methods require background \nassumptions; when the assumptions fail, the methods cannot be taken to be reliable. Yet we \noften cannot tell whether the assumptions are met or not. It is good practice then to multiply \nstudies in order to control for error in assumptions, and in the end to make an overall \njudgment based on the pattern of results.  \n \nBeware though. The reliability of method depends on the type of conclusion drawn. So \nWeber’s concern that differentiating kinds of conclusions, as I insist we must, restricts the \nmethods we can use to test them, is a correct one. Indeed it is one of the central lessons I \nurge, and one of great practical significance. We need to be clear about exactly what kind of \ncausal conclusion we are entitled to draw from our studies; and not out of philosophical \npurity but because the inferences we can go on to draw as we imbed that conclusion in other \ncontexts, combining it with other knowledge, depend intimately on what causal claim we \nhave established in the first place. Indeed, this is one of my worries about current causal \ninvestigations in the biomedical and social sciences: They are often sloppy about what the \ncausal conclusion drawn claims.10 \n \nWhat then of the scatter of methods Weber describes from IARC – epidemiological studies, \nstudies on model animals, studies of mechanisms? These can properly be used in a \ncomplex inference to establish not causal laws (which in my account are always population-\nspecific) but more abstract capacity claims: claims about a stable contribution the cause can \nmake. It is a complicated story about what is involved in a capacity claim and how such \nclaims can be justified.11 But epidemiological methods and studies of mechanisms can play \nan important role. \n                                                          \n7 Including common assumptions about the relation between causes and probabilities as well as the context-local \nassumptions that the two groups have the same distribution of other causally relevant features (unbiased) and \nthat there is a genuine probabilistic difference in outcome (the difference in frequency is not a result of chance). \n8 That’s because, given the assumptions, the only possible explanation for the difference is that the agent caused \ncancers in some members of the exposed population. \n9 Including the broad metaphysical premise required in these arguments, which I discuss in HC&UT, that every \nprobabilistic difference requires a causal explanation. \n10 Sometimes this is ‘remedied’ by reporting precise statistical results. This can be an even worse practice since \nthese results are often only useful when interpreted causally – and that is the interpretation they are given. But in \nthis case the causal interpretation, being less explicit, is even less rigorously reviewed. \n11 For further discussion see Cartwright (2007) and (1989) and articles on my website on causal powers.  \n \nFinally, Weber urges attention to simulations and experiments in economics. We are again \nhere in agreement: This is an important topic. I discuss only thought experiments, in a \nchapter on ‘idealized’ models, though many of the cautions about ‘overconstraining’ \nrestrictions in the set-ups apply to actual experiments as well. Other than that, I leave \nexperiments and simulations to other colleagues, including Weber himself, who have more \ninteresting things to say than I would.12 \n \n \n \nReferences \n \nAlexandrova, Anna (2006), ‘Connecting Economic Models to the Real World’, Philosophy of \nthe Social Sciences, 36: 173-192.  \n---- (2007) ‘Making Models Count’, Philosophy of Science 75: 383-404.  \n \nCartwright, Nancy (1989). Nature's Capacities and their Measurement, New York: Oxford \nUniversity Press. \n---- (2007). Causal Powers: What Are They? Why Do We Need Them? What Can and \nCannot be Done with Them? Contingency and Dissent in Science Series, London: Centre for \nPhilosophy of Natural and Social Science, LSE. \n \nCartwright Nancy, Jordi Cat, Lola Fleck, Thomas E Uebel (1996). Otto Neurath: Philosophy \nbetween Science and Politics, New York: Cambridge University Press, Ideas in Context \nSeries No. 38. \n \nEfstathiou, Sophia (2009). The Use of ‘Race’ as a Variable in Biomedical Research, PhD \nDissertation, University of California San Diego, UMI Press, 2009. \n \nGrüne-Yanoff, Till (2006). ‘Learning from Economic Models’, Paper presented at the 20th \nBiennial Meeting of the Philosophy of Science Association, Vancouver. \n \nGuala, Francesco (2005). The Methodology of Experimental Economics, Cambridge: \nCambridge University Press.  \n \nHausman, Daniel M. (1992 ). The Inexact but Separate Science of Economics, Cambridge: \nCambridge University Press. \n \nHendry, David (2001). Causality in Macroeconomics, Cambridge University Press. \n--- (2004). ‘Causality and Exogeneity in Non-stationary Economic Time-Series’, Causality: \nMetaphysics and Methods Technical Report CTR 18-04, CPNSS, London School of \nEconomics.  \n                                                          \n12 Cf. Guala (2005), Alexandrova (2006), (2007); Gruene-Yanoff (2006); Humphreys (2009); Reiss (2007), \nMorgan (2001). \n \nHoover, Kevin (2001). Causality in Macroeconomics, Cambridge University Press, \nCambridge. \n \nHumphreys, Paul (2009). ‘Computational Economics’, Oxford Handbook on Philosophy and \nEconomics, Harold Kincaid and Don Ross (eds). Oxford: Oxford University Press.  \n \nIARC (2006). Preamble to the IARC Monographs on the Evaluation of Carcinogenic Risks to \nHumans. Available at http:\/\/monographs.iarc.fr Last accessed, September 4, 2009.  \n \nMorgan, Mary (2001). ‘Models, Stories and the Economic World’, Journal of Economic \nMethodology 8;3: 361-384.  \n \nReiss, Julian (2007). Error in Economics: The Methodology of Evidence-Based Economics, \nLondon: Routledge. \n  \nWoodward, James (2003). Making Things Happen, Oxford University Press.  \n \n \n \n \n \n \n \n"}