{"doi":null,"coreId":"10454","oai":"oai:eprints.gla.ac.uk:47538","identifiers":["oai:eprints.gla.ac.uk:47538",null],"title":"Why is it difficult to implement e-health initiatives? A qualitative study","authors":["Murray, E.","Burns, J.","May, C.","Finch, T.","O'Donnell, C.","Wallace, P.","Mair, F."],"enrichments":{"references":[{"id":18089089,"title":"A hospital-wide picture archiving and communication system (PACS): the views of users and providers of the radiology service at Hammersmith Hospital. Eur J Radiol","authors":[],"date":"1999","doi":"10.1016\/s0720-048x(99)00134-5","raw":"Watkins J: A hospital-wide picture archiving and communication system (PACS): the views of users and providers of the radiology service at Hammersmith Hospital. Eur J Radiol 1999, 32(2):106-12. doi:10.1186\/1748-5908-6-6 Cite this article as: Murray et al.: Why is it difficult to implement ehealth initiatives? A qualitative study. Implementation Science 2011 6:6. Submit your next manuscript to BioMed Central and take full advantage of: • Convenient online submission • Thorough peer review • No space constraints or color ﬁgure charges • Immediate publication on acceptance • Inclusion in PubMed, CAS, Scopus and Google Scholar • Research which is freely available for redistribution Submit your manuscript at www.biomedcentral.com\/submit Murray et al. Implementation Science 2011, 6:6 http:\/\/www.implementationscience.com\/content\/6\/1\/6 Page 11 of 11","cites":null},{"id":18089085,"title":"A PACS maturity model: A systematic meta-analytic review on maturation and evolvability of PACS in the hospital enterprise.","authors":[],"date":"2009","doi":"10.1016\/j.ijmedinf.2008.06.010","raw":"van de Wetering R, Batenburg R: A PACS maturity model: A systematic meta-analytic review on maturation and evolvability of PACS in the hospital enterprise. Int J Med Inform 2009, 78(2):127-40.","cites":null},{"id":18089064,"title":"A rational model for assessing and evaluating complex interventions in health care.","authors":[],"date":"2006","doi":null,"raw":"May C: A rational model for assessing and evaluating complex interventions in health care. BMC Health Serv Res 2006, 6:86.","cites":null},{"id":630754,"title":"Adopting electronic medical records in primary care: lessons learned from health information systems implementation experience in seven countries.","authors":[],"date":"2009","doi":"10.1016\/j.ijmedinf.2008.06.005","raw":"Ludwick DA, Doucette J: Adopting electronic medical records in primary care: lessons learned from health information systems implementation experience in seven countries. Int J Med Inform 2009, 78(1):22-31.","cites":null},{"id":630762,"title":"al: An implementation research agenda. Implementation Science","authors":[],"date":"2009","doi":"10.1186\/1748-5908-4-18","raw":"Eccles MP, Armstrong D, Baker R, Cleary K, Davies H, Davies S, et al: An implementation research agenda. Implementation Science 2009, 4(1):18.","cites":null},{"id":630757,"title":"al: Understanding the implementation and integration of e-Health Services. Report for the NHS Service and Delivery R and D Organisation (NCCSDO).","authors":[],"date":"2009","doi":null,"raw":"Mair F, May C, Murray E, Finch T, O’Donnell C, Anderson G, et al: Understanding the implementation and integration of e-Health Services. Report for the NHS Service and Delivery R and D Organisation (NCCSDO). London: SDO; 2009.","cites":null},{"id":632337,"title":"Case study: a bridge across the paradigms. Nurs Inq","authors":[],"date":"2006","doi":"10.1111\/j.1440-1800.2006.00309.x","raw":"Luck L, Jackson D, Usher K: Case study: a bridge across the paradigms. Nurs Inq 2006, 13(2):103-9.","cites":null},{"id":632350,"title":"Choose and book. By the book. Health Serv J","authors":[],"date":"2005","doi":null,"raw":"Nolan A, Whitfield L: Choose and book. By the book. Health Serv J 2005, 115(5947), suppl-6.","cites":null},{"id":634967,"title":"Clinical Effectiveness Research Agenda Group: An Implementation Research Agenda. A report prepared for the High Level Group on Clinical Effectiveness. London: Department of Health;","authors":[],"date":"2009","doi":null,"raw":"Clinical Effectiveness Research Agenda Group: An Implementation Research Agenda. A report prepared for the High Level Group on Clinical Effectiveness. London: Department of Health; 2009.","cites":null},{"id":634971,"title":"Collerette P: Why do people use information technology? A critical review of the technology acceptance model. Information and Management","authors":[],"date":"2003","doi":"10.1016\/s0378-7206(01)00143-4","raw":"Legris P, Ingham J, Collerette P: Why do people use information technology? A critical review of the technology acceptance model. Information and Management 2003, 40(3):191-204.","cites":null},{"id":605474,"title":"Computer says yes–and no. BMJ","authors":[],"date":"2007","doi":"10.1136\/bmj.39259.445035.34","raw":"Cross M: Computer says yes–and no. BMJ 2007, 334(7608):1350-1.","cites":null},{"id":632345,"title":"CR: Teledermatology in the UK: lessons in service innovation.","authors":[],"date":null,"doi":null,"raw":"Finch TL, Mair FS, May CR: Teledermatology in the UK: lessons in service innovation. Br J Dermatol 2007, 156(3):521-7.","cites":null},{"id":630761,"title":"Determinants of implementation effectiveness: adapting a framework for complex innovations. Med Care Res Rev","authors":[],"date":"2007","doi":"10.1177\/1077558707299887","raw":"Helfrich CD, Weiner BJ, McKinney MM, Minasian L: Determinants of implementation effectiveness: adapting a framework for complex innovations. Med Care Res Rev 2007, 64(3):279-303.","cites":null},{"id":606818,"title":"DW: The use of health information technology in seven nations.","authors":[],"date":"2008","doi":"10.1016\/j.ijmedinf.2008.06.007","raw":"Jha AK, Doolan D, Grandt D, Scott T, Bates DW: The use of health information technology in seven nations. Int J Med Inform 2008, 77(12):848-54.","cites":null},{"id":600967,"title":"E: Costs and Benefits of Health Information Technology. Rockville: Agency for Healthcare Research and Quality;","authors":[],"date":"2006","doi":null,"raw":"Shekelle P, Morton S, Keeler E: Costs and Benefits of Health Information Technology. Rockville: Agency for Healthcare Research and Quality; 2006, Report No.: Evidence Report\/Technology Assessment No 132.","cites":null},{"id":18089069,"title":"Enhancing the quality of case studies in health services research. Health Serv Res.","authors":[],"date":"1999","doi":null,"raw":"Yin RK: Enhancing the quality of case studies in health services research. Health Serv Res. 1999, 34(5 Pt 2):1209-24.","cites":null},{"id":630753,"title":"et al: Assessing the level of healthcare information technology adoption in the United States: a snapshot. BMC Med Inform Decis Mak","authors":[],"date":"2006","doi":null,"raw":"Poon EG, Jha AK, Christino M, Honour MM, Fernandopulle R, Middleton B, et al: Assessing the level of healthcare information technology adoption in the United States: a snapshot. BMC Med Inform Decis Mak 2006, 6:1.","cites":null},{"id":632349,"title":"et al: Development of a theory of implementation and integration: Normalization Process Theory. Implement Sci","authors":[],"date":"2009","doi":"10.1186\/1748-5908-4-29","raw":"May CR, Mair F, Finch T, MacFarlane A, Dowrick C, Treweek S, et al: Development of a theory of implementation and integration: Normalization Process Theory. Implement Sci 2009, 4:29.","cites":null},{"id":600966,"title":"et al: Systematic review: impact of health information technology on quality, efficiency, and costs of medical care. Ann Intern Med","authors":[],"date":"2006","doi":"10.7326\/0003-4819-144-10-200605160-00125","raw":"Chaudhry B, Wang J, Wu S, Maglione M, Mojica W, Roth E, et al: Systematic review: impact of health information technology on quality, efficiency, and costs of medical care. Ann Intern Med 2006, 144(10):742-52.","cites":null},{"id":630759,"title":"et al: The role of academic health science systems in the transformation of medicine. Lancet","authors":[],"date":"2010","doi":"10.1016\/s0140-6736(09)61082-5","raw":null,"cites":null},{"id":18089065,"title":"et al: Understanding the implementation of complex interventions in health care: the normalization process model. BMC Health Serv Res","authors":[],"date":"2007","doi":"10.1186\/1472-6963-7-148","raw":"May C, Finch T, Mair F, Ballini L, Dowrick C, Eccles M, et al: Understanding the implementation of complex interventions in health care: the normalization process model. BMC Health Serv Res 2007, 7(1):148.","cites":null},{"id":630760,"title":"From best evidence to best practice: effective implementation of change in patients’ care. Lancet","authors":[],"date":"2003","doi":"10.1016\/s0140-6736(03)14546-1","raw":"Grol R, Grimshaw J: From best evidence to best practice: effective implementation of change in patients’ care. Lancet 2003, 362(9391):1225-30.","cites":null},{"id":632344,"title":"Gask L: Integrating service development with evaluation in telehealthcare: an ethnographic study. BMJ","authors":[],"date":"2003","doi":"10.1136\/bmj.327.7425.1205","raw":"Finch T, May C, Mair F, Mort M, Gask L: Integrating service development with evaluation in telehealthcare: an ethnographic study. BMJ 2003, 327(7425):1205-9.","cites":null},{"id":18089062,"title":"Health, technology and society: a sociological critique.","authors":[],"date":"2007","doi":"10.1111\/j.1467-9566.2008.1154_2.x","raw":"Webster A: Health, technology and society: a sociological critique. Basingstoke: Palgrave Macmillan 2007.","cites":null},{"id":605475,"title":"Hospital boss hits out at new computer system. The Independent","authors":[],"date":"2009","doi":null,"raw":"Sinclair J: Hospital boss hits out at new computer system. The Independent 2009.","cites":null},{"id":600968,"title":"How the Performance of the U.S. Health Care System Compares Internationally. New York: Commonwealth Fund;","authors":[],"date":"2010","doi":null,"raw":"Davis K, Schoen C, Stremikis K: How the Performance of the U.S. Health Care System Compares Internationally. New York: Commonwealth Fund; 2010, 2010.","cites":null},{"id":18089063,"title":"Implementation, embedding, and integration: an outline of Normalization Process Theory. Sociology","authors":[],"date":"2009","doi":"10.1177\/0038038509103208","raw":"May C, Finch T: Implementation, embedding, and integration: an outline of Normalization Process Theory. Sociology 2009, 43(3):535-54.","cites":null},{"id":605476,"title":"Information and communications technology in U.S. health care: why is adoption so slow and is slower better? J Health Polit Policy Law","authors":[],"date":"2009","doi":"10.1215\/03616878-2009-034","raw":"Christensen MC, Remler D: Information and communications technology in U.S. health care: why is adoption so slow and is slower better? J Health Polit Policy Law 2009, 34(6):1011-34.","cites":null},{"id":18089086,"title":"L: A balanced evaluation perspective: picture archiving and communication system impacts on hospital workflow.","authors":[],"date":"2006","doi":"10.1007\/s10278-006-0628-2","raw":"van de Wetering R, Batenburg R, Versendaal J, Lederman R, Firth L: A balanced evaluation perspective: picture archiving and communication system impacts on hospital workflow. J Digit Imaging 2006, 19(Suppl 1):10-7.","cites":null},{"id":634969,"title":"Lacity MC: A review of the predictors, linkages, and biases in IT innovation adoption research.","authors":[],"date":"2006","doi":"10.1057\/palgrave.jit.2000056","raw":"Jeyaraj A, Rottman JW, Lacity MC: A review of the predictors, linkages, and biases in IT innovation adoption research. Journal of Information Technology 2006, 21:1-23.","cites":null},{"id":634975,"title":"Lowe A: To reveal is to critique: actor-network theory and critical information systems research.","authors":[],"date":"2002","doi":"10.1080\/02683960210145986","raw":"Doolin B, Lowe A: To reveal is to critique: actor-network theory and critical information systems research. Journal of Information Technology 2002, 17:69-78.","cites":null},{"id":605472,"title":"NHS Connecting for Health: The cost of the National Programme for IT is spiralling.","authors":[],"date":"2009","doi":null,"raw":"NHS Connecting for Health: The cost of the National Programme for IT is spiralling. [http:\/\/webarchive.nationalarchives.gov.uk\/20090501064004\/ http:\/\/connectingforhealth.nhs.uk\/factsandfiction\/mythbusters\/spiralling], NHS Connecting for Health 2009 [cited 9 A.D. May 5].","cites":null},{"id":605473,"title":"Office: The National Programme for IT in the NHS. London: The Stationery Office;","authors":[],"date":"2006","doi":"10.1136\/bmj.333.7568.568-c","raw":"National Audit Office: The National Programme for IT in the NHS. London: The Stationery Office; 2006.","cites":null},{"id":634973,"title":"Patient care information systems and health care work: a sociotechnical approach.","authors":[],"date":"1999","doi":"10.1016\/s1386-5056(99)00011-8","raw":"Berg M: Patient care information systems and health care work: a sociotechnical approach. Int J Med Inform 1999, 55(2):87-101.","cites":null},{"id":632351,"title":"PCTs still only half way to choose and book target. Health Serv J","authors":[],"date":"2007","doi":null,"raw":"Bell J: PCTs still only half way to choose and book target. Health Serv J 2007, 117(6050):9.","cites":null},{"id":18089087,"title":"Picture archiving and communication systems lead to sustained improvements in reporting times and productivity: results of a 5-year audit. Clin Radiol","authors":[],"date":"2008","doi":"10.1016\/j.crad.2007.12.015","raw":"Mackinnon AD, Billington RA, Adam EJ, Dundas DD, Patel U: Picture archiving and communication systems lead to sustained improvements in reporting times and productivity: results of a 5-year audit. Clin Radiol 2008, 63(7):796-804.","cites":null},{"id":18089088,"title":"Priedane E: Implementation of computerised physician order entry (CPOE) and picture archiving and communication systems (PACS) in the NHS: quantitative before and after study. BMJ","authors":[],"date":"2008","doi":"10.1136\/bmj.a939","raw":"Collin S, Reeves BC, Hendy J, Fulop N, Hutchings A, Priedane E: Implementation of computerised physician order entry (CPOE) and picture archiving and communication systems (PACS) in the NHS: quantitative before and after study. BMJ 2008, 337:a939.","cites":null},{"id":18089070,"title":"Qualitative case study methodology in nursing research: an integrative review.","authors":[],"date":"2009","doi":"10.1111\/j.1365-2648.2009.04998.x","raw":"Anthony S, Jack S: Qualitative case study methodology in nursing research: an integrative review. J Adv Nurs 2009, 65(6):1171-81.","cites":null},{"id":632347,"title":"Qualitative data for applied policy research. In Analysing Qualitative Data. Edited by: Bryman","authors":[],"date":"1994","doi":"10.4324\/9780203413081_chapter_9","raw":"Ritchie J, Spencer L: Qualitative data for applied policy research. In Analysing Qualitative Data. Edited by: Bryman A, Burgess R. London: Routledge; 1994:173-94.","cites":null},{"id":632343,"title":"S: Practical considerations in case study research: the relationship between methodology and process.","authors":[],"date":"2000","doi":"10.1046\/j.1365-2648.2000.01487.x","raw":"McDonnell A, Lloyd JM, Read S: Practical considerations in case study research: the relationship between methodology and process. J Adv Nurs 2000, 32(2):383-90.","cites":null},{"id":18089068,"title":"SC: Understanding factors that inhibit or promote the utilization of telecare in chronic lung disease. Chronic Illn","authors":[],"date":"2008","doi":"10.1177\/1742395308092482","raw":"Mair FS, Hiscock J, Beaton SC: Understanding factors that inhibit or promote the utilization of telecare in chronic lung disease. Chronic Illn 2008, 4(2):110-7.","cites":null},{"id":630756,"title":"TB: Technology acceptance among physicians: a new take on TAM. Med Care Res Rev","authors":[],"date":"2007","doi":"10.1177\/1077558707305942","raw":"Yarbrough AK, Smith TB: Technology acceptance among physicians: a new take on TAM. Med Care Res Rev 2007, 64(6):650-72.","cites":null},{"id":630755,"title":"Telemedicine in interdisciplinary work practices: on an IT system that met the criteria for success set out by its sponsors, yet failed to become part of every-day clinical routines. BMC Med Inform Decis Mak","authors":[],"date":"2008","doi":"10.1186\/1472-6947-8-47","raw":"de BA, Bal R: Telemedicine in interdisciplinary work practices: on an IT system that met the criteria for success set out by its sponsors, yet failed to become part of every-day clinical routines. BMC Med Inform Decis Mak 2008, 8:47.","cites":null},{"id":630758,"title":"The meaning of translational research and why it matters. JAMA","authors":[],"date":"2008","doi":"10.1001\/jama.2007.26","raw":"Woolf SH: The meaning of translational research and why it matters. JAMA 2008, 299(2):211-3. Murray et al. Implementation Science 2011, 6:6 http:\/\/www.implementationscience.com\/content\/6\/1\/6 Page 10 of 1117. Dzau VJ, Ackerly DC, Sutton-Wallace P, Merson MH, Williams RS, Krishnan KR, et al: The role of academic health science systems in the transformation of medicine. Lancet 2010, 375(9718):949-53.","cites":null},{"id":600965,"title":"The World Health Report 1999: Making a Difference. Geneva: The World Health Organisation;","authors":[],"date":"1999","doi":"10.1016\/s0031-9406(05)67141-6","raw":"The World Health Report 1999: Making a Difference. Geneva: The World Health Organisation; 1999.","cites":null},{"id":18089061,"title":"Theorising big IT programmes in healthcare: strong structuration theory meets actor-network theory. Soc Sci Med","authors":[],"date":"2010","doi":"10.1016\/j.socscimed.2009.12.034","raw":"Greenhalgh T, Stones R: Theorising big IT programmes in healthcare: strong structuration theory meets actor-network theory. Soc Sci Med 2010, 70(9):1285-94.","cites":null},{"id":18089067,"title":"TL: Process evaluation for complex interventions in primary care: understanding trials using the normalization process model. BMC Fam Pract","authors":[],"date":"2007","doi":"10.1186\/1471-2296-8-42","raw":"May CR, Mair FS, Dowrick CF, Finch TL: Process evaluation for complex interventions in primary care: understanding trials using the normalization process model. BMC Fam Pract 2007, 8:42.","cites":null},{"id":632348,"title":"Using reflexivity to optimize teamwork in qualitative research. Qual Health Res","authors":[],"date":"1999","doi":"10.1177\/104973299129121677","raw":"Barry CA, Britten N, Barber N, Bradley C, Stevenson F: Using reflexivity to optimize teamwork in qualitative research. Qual Health Res 1999, 9(1):26-44.","cites":null},{"id":18089066,"title":"What work has to be done to implement collaborative care for depression? Process evaluation of a trial utilizing the Normalization Process Model. Implement Sci","authors":[],"date":"2010","doi":"10.1186\/1748-5908-5-15","raw":"Gask L, Bower P, Lovell K, Escott D, Archer J, Gilbody S, et al: What work has to be done to implement collaborative care for depression? Process evaluation of a trial utilizing the Normalization Process Model. Implement Sci 2010, 5:15.","cites":null},{"id":632346,"title":"Will Connecting for Health deliver its promises? BMJ","authors":[],"date":"2006","doi":"10.1136\/bmj.332.7541.599","raw":"Cross M: Will Connecting for Health deliver its promises? BMJ 2006, 332(7541):599-601.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011","abstract":"<b>Background<\/b> The use of information and communication technologies in healthcare is seen as essential for high quality and cost-effective healthcare. However, implementation of e-health initiatives has often been problematic, with many failing to demonstrate predicted benefits. This study aimed to explore and understand the experiences of implementers - the senior managers and other staff charged with implementing e-health initiatives and their assessment of factors which promote or inhibit the successful implementation, embedding, and integration of e-health initiatives.<p><\/p>\\ud\n\\ud\n<b>Methods<\/b> We used a case study methodology, using semi-structured interviews with implementers for data collection. Case studies were selected to provide a range of healthcare contexts (primary, secondary, community care), e-health initiatives, and degrees of normalization. The initiatives studied were Picture Archiving and Communication System (PACS) in secondary care, a Community Nurse Information System (CNIS) in community care, and Choose and Book (C&#38;B) across the primary-secondary care interface. Implementers were selected to provide a range of seniority, including chief executive officers, middle managers, and staff with 'on the ground' experience. Interview data were analyzed using a framework derived from Normalization Process Theory (NPT).<p><\/p>\\ud\n\\ud\n<b>Results<\/b> Twenty-three interviews were completed across the three case studies. There were wide differences in experiences of implementation and embedding across these case studies; these differences were well explained by collective action components of NPT. New technology was most likely to 'normalize' where implementers perceived that it had a positive impact on interactions between professionals and patients and between different professional groups, and fit well with the organisational goals and skill sets of existing staff. However, where implementers perceived problems in one or more of these areas, they also perceived a lower level of normalization.<p><\/p>\\ud\n\\ud\n<b>Conclusions<\/b> Implementers had rich understandings of barriers and facilitators to successful implementation of e-health initiatives, and their views should continue to be sought in future research. NPT can be used to explain observed variations in implementation processes, and may be useful in drawing planners' attention to potential problems with a view to addressing them during implementation planning","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"BioMed Central","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.gla.ac.uk:47538<\/identifier><datestamp>\n      2016-08-25T11:32:10Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D52:5241<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><rioxx xmlns=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/\" xmlns:ali=\"http:\/\/ali.niso.org\/2014\/ali\/1.0\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:dcterms=\"http:\/\/purl.org\/dc\/terms\/\" xmlns:rioxxterms=\"http:\/\/docs.rioxx.net\/schema\/v2.0\/rioxxterms\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/ http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/rioxx.xsd\" ><ali:free_to_read>\n    \n      <\/ali:free_to_read><ali:license_ref start_date=\"2011\" >http:\/\/creativecommons.org\/licenses\/by-nc\/3.0<\/ali:license_ref><dc:description><b>Background<\/b> The use of information and communication technologies in healthcare is seen as essential for high quality and cost-effective healthcare. However, implementation of e-health initiatives has often been problematic, with many failing to demonstrate predicted benefits. This study aimed to explore and understand the experiences of implementers - the senior managers and other staff charged with implementing e-health initiatives and their assessment of factors which promote or inhibit the successful implementation, embedding, and integration of e-health initiatives.<p><\/p>\\ud\n\\ud\n<b>Methods<\/b> We used a case study methodology, using semi-structured interviews with implementers for data collection. Case studies were selected to provide a range of healthcare contexts (primary, secondary, community care), e-health initiatives, and degrees of normalization. The initiatives studied were Picture Archiving and Communication System (PACS) in secondary care, a Community Nurse Information System (CNIS) in community care, and Choose and Book (C&#38;B) across the primary-secondary care interface. Implementers were selected to provide a range of seniority, including chief executive officers, middle managers, and staff with 'on the ground' experience. Interview data were analyzed using a framework derived from Normalization Process Theory (NPT).<p><\/p>\\ud\n\\ud\n<b>Results<\/b> Twenty-three interviews were completed across the three case studies. There were wide differences in experiences of implementation and embedding across these case studies; these differences were well explained by collective action components of NPT. New technology was most likely to 'normalize' where implementers perceived that it had a positive impact on interactions between professionals and patients and between different professional groups, and fit well with the organisational goals and skill sets of existing staff. However, where implementers perceived problems in one or more of these areas, they also perceived a lower level of normalization.<p><\/p>\\ud\n\\ud\n<b>Conclusions<\/b> Implementers had rich understandings of barriers and facilitators to successful implementation of e-health initiatives, and their views should continue to be sought in future research. NPT can be used to explain observed variations in implementation processes, and may be useful in drawing planners' attention to potential problems with a view to addressing them during implementation planning.<\/dc:description><dc:format>application\/pdf<\/dc:format><dc:identifier>http:\/\/eprints.gla.ac.uk\/47538\/1\/47538.pdf<\/dc:identifier><dc:language>en<\/dc:language><dc:publisher>BioMed Central<\/dc:publisher><dc:source>1748-5908<\/dc:source><dc:subject>RA<\/dc:subject><dc:title>Why is it difficult to implement e-health initiatives? A qualitative study<\/dc:title><rioxxterms:author>Murray, E.<\/rioxxterms:author><rioxxterms:author>Burns, J.<\/rioxxterms:author><rioxxterms:author>May, C.<\/rioxxterms:author><rioxxterms:author>Finch, T.<\/rioxxterms:author><rioxxterms:author id=\"http:\/\/orcid.org\/0000-0002-5368-3779\" >O'Donnell, C.<\/rioxxterms:author><rioxxterms:author>Wallace, P.<\/rioxxterms:author><rioxxterms:author>Mair, F.<\/rioxxterms:author><rioxxterms:publication_date>2011<\/rioxxterms:publication_date><rioxxterms:type>Journal Article\/Review<\/rioxxterms:type><rioxxterms:version>NA<\/rioxxterms:version><rioxxterms:version_of_record>http:\/\/dx.doi.org\/10.1186\/1748-5908-6-6<\/rioxxterms:version_of_record><\/rioxx><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2011,"topics":["RA"],"subject":["RA"],"fullText":""}