{"doi":"10.1016\/j.clon.2007.06.014.","coreId":"191694","oai":"oai:lra.le.ac.uk:2381\/2666","identifiers":["oai:lra.le.ac.uk:2381\/2666","10.1016\/j.clon.2007.06.014."],"title":"Carbonic anhydrase IX (CA IX) expression and outcome after radiotherapy for muscle-invasive bladder cancer","authors":["Sherwood, B.T.","Colquhoun, A.J.","Richardson, D.","Bowman, K.J.","O'Byrne, K.J.","Kockelbergh, R.C.","Symonds, R. Paul","Mellon, J. Kilian","Jones, George D.D."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-08-13","abstract":"This is the authors' final draft of the paper published as Clinical Oncology, 2007, 19(10), pp.777-783.  The published version is available on Science Direct, DOI: 10.1016\/j.clon.2007.06.014.Aims: Carbonic anhydrase IX (CA IX) expression has been described as an endogenous marker of hypoxia in solid neoplasms. Furthermore, CA IX expression has been associated with an aggressive phenotype and resistance to radiotherapy (RT). Here we assess the prognostic significance of CA IX expression in patients with muscle-invasive bladder cancer treated with RT.\\ud\nMethods and Materials: A standard immunohistochemistry technique was used to demonstrate CA IX expression in 110 muscle-invasive bladder tumours treated with RT. Clinico-pathological data was obtained from medical casenotes.\\ud\nResults: CA IX immunostaining was detected in 89 (~81%) patients. Staining was predominantly membranous, with areas of concurrent cytoplasmic and nuclear staining and was abundant in luminal and perinecrotic areas. No significant correlation was demonstrated between overall CA IX status and initial response to RT, five-year bladder cancer-specific survival or time to local recurrence.\\ud\nConclusions: The distribution of CA IX expression in paraffin-embedded tissue sections seen in this series is consistent with previous studies in bladder cancer but does not provide significant prognostic information with respect to response to RT at 3 months and disease-specific survival following radical RT","downloadUrl":"http:\/\/hdl.handle.net\/2381\/2666","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/2666\/1\/Sherwood%20et%20al%20CAIX%20Manuscript%20for%20LRA.pdf","pdfHashValue":"9f3fbfcbd4c7b2cbcea02f5d7876814a2d08a111","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/2666<\/identifier><datestamp>\n                2010-04-07T13:47:39Z<\/datestamp><setSpec>\n                com_2381_162<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_163<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nCarbonic anhydrase IX (CA IX) expression and outcome after radiotherapy for muscle-invasive bladder cancer<\/dc:title><dc:creator>\nSherwood, B.T.<\/dc:creator><dc:creator>\nColquhoun, A.J.<\/dc:creator><dc:creator>\nRichardson, D.<\/dc:creator><dc:creator>\nBowman, K.J.<\/dc:creator><dc:creator>\nO'Byrne, K.J.<\/dc:creator><dc:creator>\nKockelbergh, R.C.<\/dc:creator><dc:creator>\nSymonds, R. Paul<\/dc:creator><dc:creator>\nMellon, J. Kilian<\/dc:creator><dc:creator>\nJones, George D.D.<\/dc:creator><dc:description>\nThis is the authors' final draft of the paper published as Clinical Oncology, 2007, 19(10), pp.777-783.  The published version is available on Science Direct, DOI: 10.1016\/j.clon.2007.06.014.<\/dc:description><dc:description>\nAims: Carbonic anhydrase IX (CA IX) expression has been described as an endogenous marker of hypoxia in solid neoplasms. Furthermore, CA IX expression has been associated with an aggressive phenotype and resistance to radiotherapy (RT). Here we assess the prognostic significance of CA IX expression in patients with muscle-invasive bladder cancer treated with RT.\\ud\nMethods and Materials: A standard immunohistochemistry technique was used to demonstrate CA IX expression in 110 muscle-invasive bladder tumours treated with RT. Clinico-pathological data was obtained from medical casenotes.\\ud\nResults: CA IX immunostaining was detected in 89 (~81%) patients. Staining was predominantly membranous, with areas of concurrent cytoplasmic and nuclear staining and was abundant in luminal and perinecrotic areas. No significant correlation was demonstrated between overall CA IX status and initial response to RT, five-year bladder cancer-specific survival or time to local recurrence.\\ud\nConclusions: The distribution of CA IX expression in paraffin-embedded tissue sections seen in this series is consistent with previous studies in bladder cancer but does not provide significant prognostic information with respect to response to RT at 3 months and disease-specific survival following radical RT.<\/dc:description><dc:date>\n2007-11-29T16:51:33Z<\/dc:date><dc:date>\n2007-11-29T16:51:33Z<\/dc:date><dc:date>\n2007-08-13<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nClinical Oncology, 2007, 19(10), pp.777-783<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/2666<\/dc:identifier><dc:language>\nen<\/dc:language><dc:publisher>\nElsevier<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article"],"fullText":"Carbonic anhydrase IX (CA IX) expression and outcome \nafter radiotherapy for muscle-invasive bladder cancer. \n \nB. T. Sherwood, A. J. Colquhoun, D. Richardson, K. J. Bowman, K. J. O’Byrne, R. C. \nKockelbergh, R. P. Symonds, J. K. Mellon, and G. D.D. Jones. \n \nDepartment of Cancer Studies & Molecular Medicine, University of Leicester, \nLeicester, LE1 7RH, UK \n \nCurrent addresses:  \n[DR]  Ageing and Stroke Medicine Group, Department of Cardiovascular Sciences, \nUHL NHS Trust, Gwendolen Road, Leicester, LE5 4PW. \n[KJO’B]  HOPE Directorate, St James' Hospital, Dublin 8, Ireland. \n \nCorresponding author: Dr. George DD Jones \nRadiation & Oxidative Stress Group \nDepartment of Cancer Studies & Molecular Medicine \nBiocentre \nUniversity of Leicester \nUniversity Road \nLeicester  LE1 7RH  \nUK \n \nTel: +44-(0)116-223-1841 \nFax: +44-(0116-223-1840 \nE-mail: gdj2@le.ac.uk\n \n \nRunning title:  CA IX expression in muscle-invasive bladder cancer. \n \n                                                                                            Sherwood et al.   2\nABSTRACT \n \nAims: Carbonic anhydrase IX (CA IX) expression has been described as an \nendogenous marker of hypoxia in solid neoplasms.  Furthermore, CA IX expression \nhas been associated with an aggressive phenotype and resistance to radiotherapy (RT).  \nHere we assess the prognostic significance of CA IX expression in patients with \nmuscle-invasive bladder cancer treated with RT. \nMethods and Materials: A standard immunohistochemistry technique was used to \ndemonstrate CA IX expression in 110 muscle-invasive bladder tumours treated with \nRT.  Clinico-pathological data was obtained from medical casenotes.   \nResults: CA IX immunostaining was detected in 89 (~81%) patients.  Staining was \npredominantly membranous, with areas of concurrent cytoplasmic and nuclear \nstaining and was abundant in luminal and perinecrotic areas.  No significant \ncorrelation was demonstrated between overall CA IX status and initial response to \nRT, five-year bladder cancer-specific survival or time to local recurrence.  \nConclusions: The distribution of CA IX expression in paraffin-embedded tissue \nsections seen in this series is consistent with previous studies in bladder cancer but \ndoes not provide significant prognostic information with respect to response to RT at \n3 months and disease-specific survival following radical RT.  \n \nKeywords:  bladder cancer, carbonic anhydrase IX, hypoxia, radiotherapy \n                                                                                            Sherwood et al.   3\nINTRODUCTION \n \nApproximately 30% of bladder tumours are muscle-invasive at presentation and are \ntherefore associated with a significant risk of metastasis and a poor prognosis.  \nRadical radiotherapy (RT) is the cornerstone of treatment regimens aimed at bladder \npreservation; however, complete local response is seen in only 50% of cases.  \nPredictive information regarding the likely response of a bladder tumour to RT would \nbe of enormous benefit in enhancing patient selection for bladder preservation.   \n \nAn association between tumour hypoxia and resistance to treatment with ionising \nradiation has long been recognised.  In other solid tumours, polarographic needle \nmeasurements of hypoxia correlate with increased metastatic potential, resistance to \nRT and an adverse prognosis [1-3].  However, bladder carcinomas are not readily \naccessible to microelectrodes and alternative strategies aimed at hypoxia \nmeasurement need to be assessed.   \n \nThe transcriptional complex hypoxia-inducible factor-1 (HIF-1) is recognised as a key \nmediator of gene expression in hypoxic tumours.  Hypoxic induction of the carbonic \nanhydrase genes CA9, CA12 and corresponding proteins (CA IX, CA XII), has been \nshown to be HIF-1-dependent [4].  In tumour cells, these enzymes are pivotal in \nmaintaining the intracellular pH at physiological levels.  The overall effect of CA \nactivity is the relative acidification of the extracellular space.  This has important \nramifications in promoting further tumour growth and invasion.  CA IX expression \nhas been reported as an endogenous surrogate marker of hypoxia in solid neoplasms.   \nIn cervical carcinoma, for example, CA IX expression correlates well with \n                                                                                            Sherwood et al.   4\npolarographic measurements of tumour oxygen tension [5].  More recently, CA IX \nexpression has been associated with poor prognosis in non-small cell lung cancer [6] \nand has been associated with poor response to chemoradiotherapy in head and neck \ncancer [7]. \n \nIn bladder cancer, CA IX immunostaining is attractive as a marker of hypoxia, since it \nis non-invasive and does not require systemic administration, compared with \npolarographic needle measurements and pimonidazole, respectively.  Significant \ncorrelations have been observed between CA IX expression and pimonidazole levels \nin bladder cancer [4]; however, there is no clear consensus as to the prognostic value \nof CA IX immunostaining in this disease.  Turner et al. [8] studied the distribution of \nvascular endothelial growth factor (VEGF) mRNA (by in situ hybridisation) and CA \nIX expression in 22 bladder cancers of varied pathological stages.  Co-localisation of \nVEGF and CA IX expression was observed, with both being expressed predominantly \non luminal surfaces and in perinecrotic areas.  Expression of both factors was greater \nin superficial compared with invasive disease.  The authors went further, to study the \nrelationship between expression of CA IX and clinical outcome in 49 patients with \nsuperficial bladder cancer.  CA IX expression was not predictive of clinical outcome.  \nHoskin et al. [9] investigated GLUT1 and CA IX as endogenous markers of hypoxia \nand their relationship to outcome in a retrospective series of 64 bladder cancer \npatients treated with radical RT with carbogen and nicotinamide (ARCON).  GLUT1 \nand CA IX staining were found to be independent predictors for overall and disease-\nspecific survival, but not for local control or metastasis-free survival.  A prospective \nstudy was also reported in which pimonidazole, GLUT1 and CA IX staining was \ncompared in 21 patients with bladder cancer.  A good correlation was reported \n                                                                                            Sherwood et al.   5\nbetween CA IX\/GLUT1 expression and pimonidazole staining.  More recently, CA \nIX expression has been studied in 57 patients with superficial or invasive disease [10].  \nAgain, significantly more superficial bladder cancers expressed CA IX strongly. \nHowever, no significant association between CA IX staining and survival was \nestablished in either superficial or invasive disease.   \n \nIn the present study, we evaluate CA IX expression in invasive bladder cancer using \nstandard immunohistochemistry.  We determine the prognostic significance of tumour \nCA IX expression in patients treated with RT; the primary endpoints being initial \nresponse to radiotherapy and survival (bladder-cancer specific) and a secondary \nendpoint being local recurrence. \n \n \nMETHODS AND MATERIALS \n \nStudy Population \nEthical approval was obtained for the study of archival paraffin-embedded tissue \nsections from 110 patients with pathological stage T2-T3 bladder cancer.  The exact \nsame study population was used in a recent immunohistochemical study to \ndemonstrate that epidermal growth factor receptor status predicts local response to \nradical radiotherapy in muscle-invasive bladder cancer [11]. Therefore, we are \nconfident that the size of the study population of the present study has the power to \ndetect any differences, to the extent of the previous study, should they exist.  \n \n                                                                                            Sherwood et al.   6\nAll patients were treated by 6 or 8 Mv X-rays between 1992 and 1997.  The most \ncommonly used regimen (77 patients) was 60 Gy in 30 fractions given over 42 days. \n25 patients were treated with 50-55 Gy in 20 fractions. Others received varying doses \nbetween 45-64 Gy in 20 to 32 fractions.  Treatment was given to the bladder only, \nwith a 1-1.5 cm margin.  Most patients were planned using a cystogram and \ncystoscopic findings were taken into account in deciding the treatment volume.  In the \nlast 2 years of the study, patients were planned on computed tomographic images.  Of \nthe specimens, 91 (82.7%) were from male and 19 (17.3%) were from female \npatients.  Staging was based on biopsy reports from the initial transurethral resection \nof the bladder tumour.  The clinico-pathological data is summarised in Table 1.  \nHospital notes were reviewed to determine the following clinical outcomes; initial \nresponse to RT, local and distant tumour recurrence rates and survival.  Initial \nresponse to RT was determined at 3 months by check cystoscopy\/histology and \ndefined as follows: ‘complete’ (no evidence of tumour in bladder), ‘partial’ (tumour \nof a lower histological grade\/stage than at diagnosis, present in the bladder) or ‘none’ \n(tumour of same or higher stage and grade as at diagnosis, present in the bladder). \n‘Complete’ or ‘partial’ responses were considered positive and ‘none’ responders \nconsidered negative. \n \nMaterials \nThe tumour specimens evaluated were routinely processed, formalin-fixed and \nparaffin-embedded.  All the TURBT sections were reviewed by a pathology SpR at \nLeicester General Hospital and a block was selected for analysis that was \nrepresentative of invasive tumour.  Tissue sections of 4μm thickness were cut onto \n                                                                                            Sherwood et al.   7\nglass slides that were previously treated with 2% 3-aminopropylethoxysilane (in \nmethanol) and dried overnight at 37°C to promote section-to-slide adhesion. \n \nThe murine monoclonal antibody M75, recognising the N-terminal domain of MN\/CA  \nIX protein, has been previously reported by Pastorekova et al [12]. The specificity of \nthe monoclonal antibody M75 for CA IX has been previously reported using Western \nblots and immunostaining of COS-7 cells transfected with CA IX cDNA [13]. The \nsecondary antibody was polymer-conjugated rabbit antimouse from the Envision kit \n(Dako, Ely, UK). \n \nImmunohistochemistry \nNo antigen retrieval was required.  Slides were dewaxed in xylene before rehydration \nby passage through graded alcohols.  Endogenous peroxidase was blocked by \napplying 0.03% hydrogen peroxide containing sodium azide from the Envision kit \n(Dako) for 10 minutes.  Non-specific staining was prevented by the application of \n100μl of 10% human serum for 15 minutes. The working solution of M75 (stock \nsolution diluted 1:50 (vol\/vol) in 5% human serum) was added for 30 minutes.  \nPolymer-conjugated rabbit anti-mouse secondary antibody from the Envision kit \n(Dako) was then added for 30 minutes. Diaminobenzidine substrate (DAB, applied for \n8 minutes) was used to visualise CA IX.  Sections were washed in Tris-buffered \nsaline for 5 minutes following the sequential incubations with M75 and secondary \nantibody.  After DAB staining, slides were immersed in running tap water for 5 \nminutes and counterstained with haematoxylin.  Slides were dehydrated by reverse \npassage through graded alcohols and mounted using DPX (BDH Chemicals Ltd.).  \n \n                                                                                            Sherwood et al.   8\nInterpretation of CA IX staining \nTissue sections from a Non-Small Cell Lung tumour were used as positive controls.  \nNegative controls consisted of bladder tumour sections processed without the use of \nthe primary antibody.  Tissue sections were evaluated blind using light microscopy by \ntwo independent observers.  Consensus was then reached using a conference \nmicroscope.  Sections were classified as positive or negative (<5%) for CA IX \nexpression.  In addition, the type of staining (i.e. membranous, cytoplasmic or \nnuclear) and the presence or absence of necrosis was documented. \n \nStatistics \nThe SPSS software system (SPSS for Windows, version 12.0; SPSS Inc., Chicago, \nIL) was used to perform statistical analysis.  The analysis comparing CA IX status \nwith initial RT response were performed using either Chi-squared or Fisher’s exact \ntests.  Survival curves were plotted using the Kaplan-Meier method and statistical \nsignificance was assessed using the log-rank test.  Univariate analyses, in preparation \nfor subsequent multivariate analysis, were performed using Kaplan-Meier analysis \nand multivariate analysis was performed using Cox’s regression to determine any \npotential independent prognostic factors for diminished bladder-cancer specific \nsurvival. The level of statistical significance was taken to be p< 0.05. \n \n \nRESULTS \n \nCA IX Tumour Cell Expression \n                                                                                            Sherwood et al.   9\nConcordance between the two observers with respect to positivity of immunostaining \nin this series was 97%.  Tumour cell CA IX immunostaining was detected in 89 \n(80.9%) patients.  Staining was predominantly membranous, with areas of concurrent \ncytoplasmic staining (n = 42, Figure 1).  CA IX expression was abundant in luminal \nand perinecrotic areas (Figures 1 & 2).  In a small number of cases (n = 25), areas of \nnuclear staining (Figure 3) were observed along with membranous\/cytoplasmic \npatterns.   \n \nCA IX Expression and Initial Response to RT \n87 patients (79.1%) underwent check cystoscopy at 3 months post RT, to determine \nresponse to treatment.  Cystoscopy was not performed if the patient had developed \nmetastatic disease or was considered unfit for the procedure, i.e. an active decision \nwas taken by the responsible clinician not to perform the procedure. 60 patients (69%) \nhad a positive response (53 complete, 7 partial) and 27 (31%) had a negative response \nto RT.  No significant correlation (Chi-squared and Fisher’s exact tests) was \ndemonstrated between either overall CA IX status or nuclear CA IX staining and \ninitial response to RT (p = 0.561 and p = 0.22 respectively). \n \nCA IX Expression and Survival Following RT \nOverall 5-year survival was 23.6% in this series.  5-year bladder cancer-specific \nsurvival was 40.9%.  No significant association (log-rank test) was observed between \neither overall CA IX status, or nuclear CA IX staining and bladder cancer-specific \nsurvival following RT treatment (p = 0.9014 and p = 0.6381, respectively, Figures 4a \n& 4b)(overall CA IX-negative patients: median survival 29.46 months (IQR: 5.26-\n                                                                                            Sherwood et al.   10\n79.53); overall CA IX-positive patients: median survival 19.59 months (IQR: 7.0-\ninfinity). \n \nCA IX Expression and Local Recurrence \n29 (48%) patients who exhibited a positive response to RT subsequently suffered \nlocal recurrence of their bladder cancer.  No significant association (log-rank test) \nbetween overall CA IX status and time (months) to local recurrence was demonstrated \n(p = 0.4679) (overall CA IX-negative patients: median time to local recurrence 16.9 \nmonths (IQR: 12.50-16.73); overall CA IX-positive patients: median time to local \nrecurrence 14.85 months (IQR: 6.80-17.6). \n \nAnalysis of the effect of nuclear CA IX staining on tumour recurrence rates following \npositive response to RT revealed patients with positive nuclear CA IX staining to be \nsignificantly more likely to experience a more rapid local recurrence after an initial \npositive response to RT (p = 0.0005). However, the small number of patients \nexhibiting both nuclear CA IX staining and tumour recurrence following a positive \nresponse to RT, plus the high numbers of censored events, limited the statistical \nvalidity of this analysis (data not shown for this reason).   \n \nMultivariate analysis of the impact of CA IX expression on response to RT \nIn preparation for multivariate analysis, the effect of several potential independent \nprognostic factors was assessed using univariate (Kaplan-Meier) analysis (see Table \n2).  Only factors which significantly predicted altered bladder-cancer specific survival \nat a significance level of p~0.10 were entered into the final model.  Thus CA IX \nstatus, nuclear CA IX staining, tumour grade and evidence of previous superficial \n                                                                                            Sherwood et al.   11\nTCC were not retained for further multivariate analysis.  Following stepwise \nconditional log rank analysis, whereby each factor is removed from the model in a \nstepwise manner to assess the effect on the model, the following 4 factors retained \nindependent prognostic significance for reduced bladder cancer-specific survival; pre-\ntreatment ureteric obstruction, lack of response to RT at 3-month cystoscopy, local \nrecurrence and metastatic spread (p = 0.005, p = 0.036, p = 0.03 and p = 0.002 \nrespectively, Table 3).  \n \n \nDISCUSSION \n \nCA IX immunostaining has attracted widespread attention as a surrogate marker of \nhypoxia in many tumour models.  However, previous studies of CA IX as a marker of \nhypoxia in bladder cancer have been undertaken using relatively small numbers of \ntumours, which are often heterogeneous with respect to tumour stage and treatment \nmodality.  Collectively, they provide no clear consensus as to the prognostic value, or \nclinical utility of CA IX immunostaining in major patient groups.  No previous studies \nhave examined the relationship between CA IX expression and outcome after radical \nRT (as monotherapy), which is still widely used in the treatment of muscle-invasive \ndisease.  There is a well-recognised need for predictive information regarding tumour \nradiosensitivity, to improve patient selection for RT in treating this disease.  The \npresent study, involving a large series of 110 patients, provides an assessment of the \nprognostic value of CA IX immunostaining in this important group of patients. \n \n                                                                                            Sherwood et al.   12\nThe abundance of CA IX immunostaining in luminal and perinecrotic areas of the \ntumour is consistent with previous studies in bladder cancer [8-10] and supports the \nnotion that CA IX localises to areas of tumour hypoxia.  The observation that CA IX \nimmunostaining localised to the nucleus in 25 cases is interesting and not reported \nelsewhere.   \n \nIn our series, overall CA IX immunostaining was not found to be of prognostic \nsignificance with respect to response to RT in patients with muscle-invasive bladder \ncancer.  In addition, no association between overall CA IX status and local recurrence \nwas observed.  Patients with positive nuclear CA IX staining were found to be \nsignificantly more likely to experience more rapid local recurrence after a positive \ninitial response to RT.  However, the numbers of patients involved in this subgroup \nanalysis were small, and the number of censored events relatively high, thereby \ncasting doubt over the true significance of this observation (data not shown for this \nreason).    \n \nUsing multivariate analysis, pre-treatment ureteric obstruction, lack of response to RT \nat 3-month cystoscopy, local recurrence and metastatic spread were all identified as \nadverse prognostic indicators.  This is in keeping with previous studies [14-16] and \nprovides validation of this series.   \n \nThe lack of an association between CA IX expression and outcome after RT is to be \ncontrasted with reports of other purported endogenous markers of hypoxia (for \nexample GLUT-1 and HIF-1α) [5-7] in other tumours, where expression has been \nassociated with adverse prognosis and radioresistance.  This association has not been \n                                                                                            Sherwood et al.   13\nobserved universally, however.  In a recent study of HIF-1α expression in locally \nadvanced cervical cancer [17], no correlation was observed between HIF-1α \nexpression and outcome after RT, indeed high HIF-1α expression tended to be \nassociated with good outcome in larger tumours.  \n \nThe present findings may reflect the importance of mechanisms other than hypoxia in \ndictating outcome after RT in this disease.  For example, differences in the intrinsic \nradiosensitivity of human tumour cells are well recognised and these differences \nrelate to clinical radiocurability [18].  One mechanism proposed to explain this \nvariation is that the amount and distribution of DNA damage induced may vary \nbetween tumour cells of different radiosensitivity; a view that is supported by \nprevious work with human bladder and breast cancer cell lines [19, 20].  Indeed, the \nimportance of intrinsic radiosensitivity in determining radioresistance in bladder \ncancer, is highlighted by more recent studies in which alkaline comet assay \nmeasurements of damage formation and repair correlate with cell survival as \ndetermined by clonogenic analysis [21, 22].  Differences in tumour cell repopulation \nrates may represent a further confounding variable.  In most centres, radiation therapy \nfor bladder cancer (60-70 Gy) is usually delivered over a period of 6-8 weeks.  Using \nKi67 immunostaining, Lara et al. [23] observed that patients with very low \nproliferating tumours seemed to achieve better local control after fractionated RT \ncompared with other patients.  \n \nAnother explanation for the lack of association between CA IX expression and \ntumour response to RT may arise from mounting evidence that different intracellular \npathways may modify HIF-1α expression and expression of its target proteins.  This \n                                                                                            Sherwood et al.   14\nmay limit the specificity of CA IX expression as a surrogate marker of hypoxia.  The \nphosphotidylinositol 3-kinase (PI3K), mitogen associated protein kinase (MAPK) [24, \n25] and Smad pathways are known to influence HIF-1α expression independently of \nhypoxia and these pathways are overactive in a wide range of tumour models.  In \nprostate cancer cell lines, epidermal growth factor receptor (EGFR) stimulation \ninduces HIF-1α via the PI3K pathway independently and additively to hypoxia [26].  \nEGFR is a member of the c-erb family of tyrosine kinase receptors and is commonly \nover expressed in bladder cancer cells [27].  The effect of interactions between the \nhypoxia response pathway and other cell signalling pathways should be borne in mind \nwhen immunohistochemical studies using so-called surrogate markers of hypoxia are \nundertaken. \n \nA further explanation that may contribute to a lack of association between CA IX \nexpression and tumour response to RT arises from the observations of Sobhanifar et \nal. [28] that the half-life of CAIX was sufficiently long that, once formed, it remained \nfor days in the absence of continued HIF-1 alpha expression; so it could be present in \noxygenated tissue that had recently been hypoxic.  Indeed, very recently Shin et al. \n[29] showed the CA IX levels fail to respond to manipulated changes in tumour \noxygenation mediated by carbogen and hydralazine, treatments that respectively \nincreased and decreased tumour oxygenation (carbogen was given 75 minutes and \nhydralazine 30 minutes before sacrifice). This indicates an inability of CA IX to \nreflect fluctuating (acute) hypoxia accurately and may contribute to the lack of \nassociation between CA IX expression and tumour response to RT observed in the \npresent study. \n \n                                                                                            Sherwood et al.   15\nThis investigation may be hindered by the fact that bladder tumours are often \nextensive, multifocal and heterogeneous, containing numerous biologically different \npopulations within a single neoplasm.  This can give rise to tumour heterogeneity with \nrespect to cellular morphology, karyotype, ploidy, cell cycle and cell proliferation \nkinetics, clonogenic potential, receptor expression and metastatic and tumorigenic \nproperties [30, 31].  Biological heterogeneity has been shown to cause differing \nradiosensitivity in human bladder cancer cell lines in vitro [32] and could therefore be \nconsidered as a cause of differing clinical response to radiation treatment for invasive \nbladder cancer. Finally, the range of radiotherapy doses and fractionation schemes \nused may to some extent confound the results.  \n \n \nCONCLUSIONS \n \nThe distribution of CA IX expression in paraffin-embedded tissue sections seen in this \nseries is consistent with previous studies in bladder cancer.  However, CA IX \nimmunostaining in tissue sections from patients with muscle-invasive bladder cancer \ndoes not provide significant prognostic information with respect to local control and \nbladder-cancer specific survival following radical RT.  The clinical utility of CA IX \nimmunostaining with respect to the treatment of invasive bladder cancer is therefore \nlimited. \n \nACKNOWLEDGEMENTS \n \nThe authors gratefully acknowledge the British Urological Foundation and University \nHospitals of Leicester for the financial support of BTS, Cancer Research UK and the \n                                                                                            Sherwood et al.   16\nRoyal College of Surgeons of England for the financial support of AJC and Professor \nJ Louise Jones for her helpful advice in slide interpretation. This work was supported \nby a Cancer Research UK project grant (C13560\/A4661) awarded to GDDJ. \n \n \nREFERENCES \n \n1. Choi, N., et al., Predictive factors in radiotherapy for non-small cell lung \ncancer: present status. Lung Cancer, 2001. 31(1): p. 43-56. \n2. Hockel, M. and P. Vaupel, Tumor hypoxia: Definitions and current clinical, \nbiologic, and molecular aspects. Journal of the National Cancer Institute, \n2001. 93(4): p. 266-276. \n3. Stadler, P., et al., Influence of the hypoxic subvolume on the survival of \npatients with head and neck cancer. Int J Radiat Oncol Biol Phys, 1999. 44(4): \np. 749-54. \n4. Wykoff, C.C., et al., Hypoxia-inducible expression of tumor-associated \ncarbonic anhydrases. Cancer Research, 2000. 60(24): p. 7075-7083. \n5. Loncaster, J.A., et al., Carbonic anhydrase (CA IX) expression, a potential \nnew intrinsic marker of hypoxia: correlations with tumor oxygen \nmeasurements and prognosis in locally advanced carcinoma of the cervix. \nCancer Res, 2001. 61(17): p. 6394-9. \n6. Swinson, D.E., et al., Carbonic anhydrase IX expression, a novel surrogate \nmarker of tumor hypoxia, is associated with a poor prognosis in non-small-\ncell lung cancer. J Clin Oncol, 2003. 21(3): p. 473-82. \n7. Koukourakis, M.I., et al., Hypoxia-regulated carbonic anhydrase-9 (CA9) \nrelates to poor vascularization and resistance of squamous cell head and neck \ncancer to chemoradiotherapy. Clin Cancer Res, 2001. 7(11): p. 3399-403. \n8. Turner, K.J., et al., The hypoxia-inducible genes VEGF and CA9 are \ndifferentially regulated in superficial vs invasive bladder cancer. Br J Cancer, \n2002. 86(8): p. 1276-82. \n9. Hoskin, P.J., et al., GLUT1 and CAIX as intrinsic markers of hypoxia in \nbladder cancer: relationship with vascularity and proliferation as predictors \nof outcome of ARCON. Br J Cancer, 2003. 89(7): p. 1290-7. \n10. Hussain, S.A., et al., Carbonic anhydrase IX, a marker of hypoxia: correlation \nwith clinical outcome in transitional cell carcinoma of the bladder. Oncol \nRep, 2004. 11(5): p. 1005-10. \n11. Colquhoun, A.J., et al., Epidermal growth factor receptor status predicts local \nresponse to radical radiotherapy in muscle-invasive bladder cancer. Clinical \nOncology, 2006. 18: p. 702-709. \n12. Pastorekova, S., et al., A novel quasi-viral agent, MaTu, is a two-component \nsystem. Virology, 1992. 187(2): p. 620-6. \n13. Saarnio, J., et al., Immunohistochemical study of colorectal tumors for \nexpression of a novel transmembrane carbonic anhydrase, MN\/CA IX, with \n                                                                                            Sherwood et al.   17\npotential value as a marker of cell proliferation. Am J Pathol, 1998. 153(1): p. \n279-85. \n14. Gospodarowicz, M.K., et al., Radical Radiotherapy for Muscle Invasive \nTransitional Cell- Carcinoma of the Bladder - Failure Analysis. Journal of \nUrology, 1989. 142(6): p. 1448-1454. \n15. Duncan, W. and P.M. Quilty, The Results of a Series of 963 Patients with \nTransitional Cell- Carcinoma of the Urinary-Bladder Primarily Treated by \nRadical Megavoltage X-Ray Therapy. Radiotherapy and Oncology, 1986. \n7(4): p. 299-310. \n16. Smaaland, R., et al., Radical Radiation Treatment of Invasive and Locally \nAdvanced Bladder-Carcinoma in Elderly Patients. British Journal of Urology, \n1991. 67(1): p. 61-69. \n17. Hutchison, G.J., et al., Hypoxia-inducible factor 1alpha expression as an \nintrinsic marker of hypoxia: correlation with tumor oxygen, pimonidazole \nmeasurements, and outcome in locally advanced carcinoma of the cervix. Clin \nCancer Res, 2004. 10(24): p. 8405-12. \n18. Fertil, B. and E.P. Malaise, Inherent Cellular Radiosensitivity as a Basic \nConcept for Human-Tumor Radiotherapy. International Journal of Radiation \nOncology Biology Physics, 1981. 7(5): p. 621-629. \n19. Dealmodovar, J.M.R., et al., Initial Radiation-Induced DNA-Damage in \nHuman Tumor-Cell Lines - a Correlation with Intrinsic Cellular \nRadiosensitivity. British Journal of Cancer, 1994. 69(3): p. 457-462. \n20. Price, M.E., et al., Induction and rejoining of DNA double-strand breaks in \nbladder tumor cells. Radiation Research, 2000. 153(6): p. 788-794. \n21. McKeown, S.R., et al., Potential use of the alkaline comet assay as a predictor \nof bladder tumour response to radiation. British Journal of Cancer, 2003. \n89(12): p. 2264-2270. \n22. Moneef, M.A.L., et al., Measurements using the alkaline comet assay predict \nbladder cancer cell radiosensitivity. British Journal of Cancer, 2003. 89(12): \np. 2271-2276. \n23. Lara, P.C., et al., The role of Ki67 proliferation assessment in predicting local \ncontrol in bladder cancer patients treated by radical radiation therapy. \nRadiotherapy and Oncology, 1998. 49(2): p. 163-167. \n24. Sodhi, A., et al., The Kaposi's sarcoma-associated herpes virus G protein-\ncoupled receptor up-regulates vascular endothelial growth factor expression \nand secretion through mitogen-activated protein kinase and p38 pathways \nacting on hypoxia-inducible factor 1alpha. Cancer Res, 2000. 60(17): p. 4873-\n80. \n25. Gao, N., et al., p38 Signaling-mediated hypoxia-inducible factor 1alpha and \nvascular endothelial growth factor induction by Cr(VI) in DU145 human \nprostate carcinoma cells. J Biol Chem, 2002. 277(47): p. 45041-8. \n26. Zhong, H., et al., Modulation of hypoxia-inducible factor 1alpha expression by \nthe epidermal growth factor\/phosphatidylinositol 3-kinase\/PTEN\/AKT\/FRAP \npathway in human prostate cancer cells: implications for tumor angiogenesis \nand therapeutics. Cancer Res, 2000. 60(6): p. 1541-5. \n27. Colquhoun, A.J. and J.K. Mellon, Epidermal growth factor receptor and \nbladder cancer. Postgrad Med J, 2002. 78(924): p. 584-9. \n28. Sobhanifar, S., et al., Reduced expression of hypoxia-inducible factor-1 alpha \nin perinecrotic regions of solid tumors. Cancer Research, 2005. 65: p. 7259-\n7266. \n                                                                                            Sherwood et al.   18\n29. Shin, K.H., et al., Detecting changes in tumor hypoxia with carbonic \nanhydrase IX and pimonidazole. Cancer Biology & Therapy, 2007. 6: p. 70-\n75. \n30. Heppner, G.H., Tumor Heterogeneity. Cancer Research, 1984. 44(6): p. 2259-\n2265. \n31. Suit, H., et al., Clinical Implications of Heterogeneity of Tumor Response to \nRadiation-Therapy. Radiotherapy and Oncology, 1992. 25(4): p. 251-260. \n32. Barnetson, A.R., et al., Heterogeneity of in vitro radiosensitivity in human \nbladder cancer cells. Radiation Oncology Investigations, 1999. 7(2): p. 66-76. \n \n \n \nFIGURE LEGENDS \n \nFigure 1: Typical CA IX staining distribution.  CA IX expression is predominantly \nmembranous (M) with areas of concurrent cytoplasmic staining (C). Expression was \nstrongest in tumour cells near the luminal surface (L) and increased with distance \nfrom the tumour microvasculature (V). \n \nFigure 2: Prominent CA IX expression adjacent to a large area of necrosis (N). \n \nFigure 3: Nuclear CA IX staining (n = 25). \n \nFigure 4: Kaplan-Meier survival curve for bladder cancer-specific survival (Y axes \nare cumulative survival fraction) following treatment with RT, stratified by a) overall \nCA IX status and b) nuclear CA IX status (CA IXn). No significant differences are \ndemonstrable (p = 0.9014 and p = 0.9589 by log-rank, respectively). \n                                                                                            Sherwood et al.   19\nFigure 1  \nC\nM\nVL\n \n \nFigure 2 \nN\n  \n                                                                                            Sherwood et al.   20\nFigure 3 \n \n \n                                                                                            Sherwood et al.   21\nFigure 4a: Overall CA IX status vs. disease specific survival (p = 0.9014) \nTime from RT to death in months\n140120100806040200\nC\num\n S\nur\nvi\nva\nl\n1.2\n1.0\n.8\n.6\n.4\n.2\n0.0\n \n----- CA IX Negative (n = 21) \n \n CA IX Positive (n = 89) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 4b: CA IX nuclear staining (CA IXn) vs. disease specific survival (p = 0.6381) \n                                                                                            Sherwood et al.   22\nTime from RT to death in months\n140120100806040200\nC\num\n S\nur\nvi\nva\nl\n1.2\n1.0\n.8\n.6\n.4\n.2\n0.0\n \n----- CA IXn Negative (n = 85) \n \n CA IXn Positive (n = 25) \n \n                                                                                            Sherwood et al.   23\nTable 1:   Summary of clinicopathological data \n \nCharacteristic      n  % \n \nNo. of patients      110  100 \n \nAge at diagnosis \n 50-59       8  7.3 \n 60-69       25  22.7 \n 70-79       53  48.2 \n 80-89       24  21.8 \n \nSex \n Male       91  82.7 \n Female       19  17.3 \n \nHistological type       \n TCC       106  96.4 \n SCC       4  3.6 \n \nTumour grade \n 2        16  14.5 \n 3        93  84.5 \n Unknown      1  0.9 \n \nTumour stage (clinical) \n T1-2       5  4.5 \n T2-3       48  44.7 \n T3-4       34  30.9 \n T4       7  6.4 \n Not recorded      16  14.5 \n \nPre-treatment ureteric obstruction \n Yes       64  58.2 \n No       27  24.5 \n Not assessed      19  17.3 \n \nPrevious non-muscle-invasive tumour \n Yes       29  26.4 \n No       81  73.6 \n \nRadiation therapy \n Mean total dose (range, SD)    57.9 (49-64 ± 4.3 Gy) \n Modal fraction size (range, SD)   2 (2.0-2.5 ± 0.2 Gy) \n Modal fraction number (range, SD)   30 (20-32 ± 3.5) \nMean duration of treatment (range, SD)  45.1 (27-87 ± 9 days) \n \n \n                                                                                            Sherwood et al.   24\nTable 2:   Potential prognostic variables associated with adverse disease-specific \nsurvival after RT \n \n \nFactor Log rank p value (Kaplan-\nMeier analysis) \nRetained for final \nmultivariate model \nCA IX status \n(positive vs. negative)  \n0.9014 X \nCA IX nuclear staining \n(positive vs. negative) \n0.6381 X \nTumour grade \n(1-2 vs. 3) \n0.4075 X \nClinical stage \n(2 vs. 3-4) \n0.0112 ? \nUreteric obstruction \n(yes vs. no) \n0.0073 ? \nLack of response to \nradiotherapy at 3 months \n(yes vs. no) \n0.0001 ? \nLocal recurrence \n(yes vs. no) \n0.0001 ? \nMetastatic spread \n(yes vs. no) \n0.0001 ? \nPrevious superficial TCC \n(yes vs. no) \n0.9522 X \n \n                                                                                            Sherwood et al.   25\nTable 3: Independent prognostic factors predicting diminished bladder cancer- \nspecific survival following RT, determined by multivariate analysis. \n \n \nFactor Odds Ratio 95% Confidence Interval p value \nUreteric obstruction 2.98 1.40-6.33 0.005 \nLack of response to \nradiotherapy at 3 months \n2.86 1.06-7.69 0.036 \nLocal recurrence 3.31 1.13-9.72 0.030 \nMetastatic spread 4.11 1.68-10.09 0.002 \n \n \n \n \n"}