{"doi":"10.1016\/0375-9601(84)90941-1","coreId":"68428","oai":"oai:eprints.lancs.ac.uk:32411","identifiers":["oai:eprints.lancs.ac.uk:32411","10.1016\/0375-9601(84)90941-1"],"title":"The effect of strong electric fields on exotic negative ions in He II : possible evidence for the nucleation of charged vortex rings.","authors":["Eden, V. L.","McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1984-05-14","abstract":"We present evidence suggesting that Ihas and Sanders' intermediate mobility exotic negative ions can nucleate quantised vortex rings in superfluid 4He when subjected to strong enough electric fields","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68428.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/32411\/1\/ExoticIonsPreprint.pdf","pdfHashValue":"6f092ea59510939e8d32dddd191d6b86fb494a84","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:32411<\/identifier><datestamp>\n      2018-01-01T04:18:26Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The effect of strong electric fields on exotic negative ions in He II : possible evidence for the nucleation of charged vortex rings.<\/dc:title><dc:creator>\n        Eden, V. L.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We present evidence suggesting that Ihas and Sanders' intermediate mobility exotic negative ions can nucleate quantised vortex rings in superfluid 4He when subjected to strong enough electric fields.<\/dc:description><dc:date>\n        1984-05-14<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/32411\/1\/ExoticIonsPreprint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/0375-9601(84)90941-1<\/dc:relation><dc:identifier>\n        Eden, V. L. and McClintock, Peter V. E. (1984) The effect of strong electric fields on exotic negative ions in He II : possible evidence for the nucleation of charged vortex rings. Physics Letters A, 102 (4). pp. 197-200. ISSN 0375-9601<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/32411\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1016\/0375-9601(84)90941-1","http:\/\/eprints.lancs.ac.uk\/32411\/"],"year":1984,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"The Effect of Strong Electric Fields on Exotic Negative Ions\nin He II: Possible Evidence for the Nucleation\nof Charged Vortex Rings∗\nV. L. Eden† and P. V. E. McClintock\nDepartment of Physics,\nUniversity of Lancaster,\nLancaster LAl 4YB, UK.\nAbstract: We present evidence suggesting that Ihas and Sanders’ interme-\ndiate mobility exotic negative ions can nucleate quantised vortex rings in su-\nperfluid 4He when subjected to strong enough electric fields.\nSeveral years ago, Doake and Gribbon discovered [1] that there can exist in He II a fast\nion which, unlike the normal negative ion [2], may be accelerated to the Landau critical\nvelocity vL for roton creation without undergoing metamorphosis to a charged vortex ring,\neven under the saturated vapour pressure. Although Doake and Gribbon were unable to\nascertain the physical conditions needed to generate this mysterious entity reproducibly,\nIhas and Sanders showed [3,4] soon afterwards that the vital factor apparently lay in the\nprovision of an electrical discharge in the vapour above the surface of the liquid. The latter\nauthors also discovered that the glow discharge source produces not only the normal and\nfast negative ions, but also (astonishingly) a large number of other types of negative ion\nwith low-field mobilities lying intermediate between those of the fast and normal ions.\nThe existence of this unexpected plethora of exotic negative charge carriers in He II\nconstitutes an intriguing and still unsolved theoretical problem. Although the structure\nof the normal negative ion is understood in considerable detail [2] the nature(s) of the fast\n∗Work supported by the Science and Engineering Research Council (UK).\n†Now at IBM(UK), 11 Albion Street, Leeds, UK.\n1\nPublished in Phys. Lett. A 102, 197-200 (1984).\nTHE EFFECT OF STRONG ELECTRIC FIELDS ON EXOTIC NEGATNE IONS IN He II:\nPOSSIBLE EVIDENCE FOR THE NUCLEATION OF CHARGED VORTEX RINGS 1:l\nV.L. EDEN 1 and P.V.E. McCLINTOCK\nDepartment of Physics, University of Lancaster, Lancaster LAl 4YB, UK\nReceived 16 January 1984\nRevised manuscript received 14 March 1984\nWe present evidence suggesting that Ihas and Sanders' intermediate mobility exotic negative ions can nucleate quantised\nvortex rings in superfluid 4He when subjected to strong enough electric fields.\nServal years ago, Doake and Gribbon discovered\n[1] that there can exist in He II a fast ion which, un-\nlike the normal negative ion [2], may be accelerated\nto the Landau critical velocity vL for roton creation\nwithout undergoing metamorphosis to a charged vor-\ntex ring, even under the saturated vapour pressure.\nAlthough Doake and Gribbon were unable to ascertain\nthe physical conditions needed to generate this mys-\nterious entity reproducibly, Ihas and Sanders showed\n[3,4] soon afterwards that the vital factor apparently\nlay in the provision of an electrical discharge in the va-\npour above the surface of the liquid. The latter au-\nthors also discovered that the glow discharge source\nproduces not only the normal and fast negative ions,\nbut also (astonishingly) a large number of other types\nof negative ion with low-field mobilities lying inter-\nmediate between those of the fast and normal ions.\nThe existence of this unexpected plethora of exot-\nic negative charge carriers in He II constitutes an in-\ntriguing and still unsolved theoretical problem. Al-\nthough the structure of the normal negative ion is\nunderstood in considerable detail [2] the nature(s)\nof the fast and intermediate ions remain(s) an en-\ntirely open question. One reason for our continuing\nignorance is that the available experimental informa-\ntion [1,3,4] is rather sparse; and we have therefore\n-I< Work supported by the Science and Engineering Research\nCouncil (UK).\n1Now at IBM(UK), 11 Albion Street, Leeds, UK.\n0.375-9601\/84\/$ 03.00 © Elsevier Science Publishers B.V.\n(North-Holland Physics Publishing Division)\nFig. 1. Sketch (not a section) showing the principal compo-\nnents in the experimental cell: a - perspex body; b - per-\nspex cap; c - spring-loaded plunger (total 3); d - brass cath-\node; e - perforated brass anode plate; f, g - gate grids;\nh - Frisch screening grid;j - collector; k - He 11.The rela-\ntively dark-shaded components are of metal, and the lighter\nshading represents insulator.\nFigure 1: Sketch (not a section) showing the principal component in the experimental cell:\na - perspex body; b - perspex cap; c - spring-loaded plunger (total 3); d - brass cathode;\ne - perforated brass anode plat ; f, g - gate grids; h - Frisch screening grid; j - collector;\nk - He II. The relatively dark-shaded components are of metal, and the lighter shading\nrepresents insulator.\nand intermediate ions remain(s) an entirely open question. One reason for our continuing\nignorance is that the available experimental information [1,3,4] is rather sparse; and we\nhave therefore embarked on a research programme aimed at remedying this unsatisfactory\nsituation. In this Letter, we report the preliminary results of what is believed to be the\nfirst experimental study to be made of the behaviour of the intermediate mobility ions in\nstrong electric fields.\nOur ion cell is illustrated schematically in Fig. 1. It is similar in general design to\nthat described by Ihas and Sanders except that, in order to achieve strong electric fields,\nwe have made provision for the application of up to 3 × 103 V across a drift space of\n10 mm. A glow discharge is struck between electrodes d and e, usually while keeping the\n2\nliquid surface level with the upper surface of e. Ions then travel through the liquid to the\nfirst gate grid f, where they are stopped by the retarding potential normally maintained\nbetween f and g. Application of a transient negative voltage pulse to e and f opens the\ngate momentarily, and allows a thin disk of ions to enter the drift space between g and h.\nFinally, the ions pass through the screening grid h and are detected as they approach the\ncollector j. To avoid electrical breakdown in the vapour outside the cell, all connections\nenter it from beneath. The level of the helium surface in the bath can be lowered by\nmeans of a fountain pump, which raises some of the He II via a needle valve to an upper\nreservoir; or it can be raised by switching off the fountain pump and opening the needle\nvalve, so as to allow some of the He II to return to the bath again.\nIn Fig. 2 we show some typical ion signals at 1.03 K in electric fields E that are\nstrong enough to have converted the normal ions to charged vortex rings. The large\nnormal ion\/vortex signal moves to the right with increasing E to reveal a number of small\nmaxima corresponding (presumably) to the intermediate ions. Although signal\/noise\nfrom our relatively short cell is (not surprisingly) rather poor, the drift velocity υ¯ the\nintermediate ions quite evidently decreases with increasing E. Behaviour of this type\nis, of course, highly reminiscent of that displayed by the charged vortex rings formed by\nnormal ions, and it may therefore be regarded as an indication that intermediate ions,\ntoo, can form vortex rings. We have also made measurements for values of E well below\nthat of the “giant fall” in v which occurs at Ecn for the normal ion. In agreement with\nthe earlier work [3,4] we observe several quite distinct mobilities. As E is increased for\nE < Ecn we find that υ¯(E) for the principal intermediate ions bends over and approaches\nthe horizontal. Further increase of E then causes each intermediate ion signal to vanish\nin turn, apparently because their υ¯(E) characteristics undergo “giant falls”, just as in the\ncase of the normal ion, though occurring at a series of critical electric fields Eci which\nlie at values of E considerably below Ecn. The corresponding critical drift velocities are\nfound to be up to 10m s−1 larger than for the normal ion. Unfortunately, it has not so far\nproved possible to associate individual species observed for E < Eci unambiguously with\nthose for E > Eci: this is because there is a range of E running from Eci to beyond Ecn\nwhere the (relatively enormous) normal ion\/vortex signal overlaps and entirely swamps\nthe much weaker intermediate ion signals.\n3\nembarked on a research programme aimed at remedy-\ning this unsatisfactory situation. In this letter, we re-\nport the preliminary results of what is believed to be the\nfirst experimental study to be made of the behaviour\nof the intermediate mobility ions in strong electric\nfields.\nOur ion cell is illustrated schematically in fig. 1. It\nis similar in general design to that described by Ihas\nand Sanders except that, in order to achieve strong\nelectric fields, we have made provision for the appli-\ncation of up to 3 X 103 V across a drift space of\n10 mm. A glow discharge is struck between electrodes\nd and e, usually while keeping the liquid surface level\nwith the upper surface of e. Ions then travel through\nthe liquid to the first gate grid f, where they are\nstopped by the retarding potential normally main-\ntained between f and g. Application of a transient\nnegative voltage pulse to e and f opens the gate mo-\nmentarily, and allows a thin disk of ions to enter the\ndrift space between g and h. Finally, the ions pass\nthrough the screening grid h and are detected as they\napproach the collector j. To avoid electrical break-\ndown in the vapour outside the cell, all connections\nenter it from beneath. The level of the helium surface\nin the bath can be lowered by means of a fountain\npump, which raises some of the He II via a needle val-\nve to an upper reservoir; or it can be raised by switch-\ning off the fountain pump and opening the needle\nvalve, so as to allow some of the He II to return to\nthe bath again.\nIn fig. 2 we show some typical ion signals at 1.03 K\nin electric fields E that are strong enough to have con-\nverted the normal ions to charged vortex rings. The\nlarge normal ion\/vortex signal moves to the right with\nincreasing E to reveal a number of small maxima cor-\nresponding (presumably) to the intermediate ions. Al-\nthough signal\/noise from our relatively short cell is\n(not surprisingly) rather poor, the drift velocity vof\nthe intermediate ions quite eVidently decreases with\nincreasing E. Behaviour of this type is, of course,\nhighly reminiscent of that displayed by the charged\nvortex rings formed by normal ions, and it may there-\nfore be regarded as an indication that intermediate\nions, too, can form vortex rings. We have also made\nmeasurements for values of E well below that of the\n\"giant fall\" in v which occurs at Ecn for the normal\nion. In agreement with the earlier work [3,4] we ob-\nserve several quite distinct mobilities. As E is increased\n?ig. 2. The current at the collector of the velocity spectrom-\neter (arbitrary units) as a function of the elapsed time t af-\nter application of a brief gate-opening pulse. Signals are shown\nfor a range of (strong) electric fields, as indicated in units of\n105 Vim by the number above each trace. The steep rise on\nthe right-hand sides of the signals for E.;;; 2.55 X 105 Vim in-\ndicates the arrival of the (comparatively enormous) normal\nion\/vortex current. The change of timescale between sections\n(a) and (b) of the diagram should be noted.\nfor E<Ecn' we find that v (E) for the principal in-\ntermediate ions bends over and approaches the hori-\nzontal. Further increase of E then causes each inter-\nmediate ion signal to vanish in turn, apparently be-\ncause their v(E) characteristics undergo \"giant falls\",\njust as in the case of the normal ion, though occurring\nat a series of critical electric fields Eci which lie at\nvalues of E considerably below Ecn- The correspond-\ning critical drift velocities are found to be up to 10m s-l\nlarger than for the normal ion. Unfortunately, it has\nnot so far proved possible to associate individual spe-\ncies observed for E <Eci unambiguously with those\nfor E > Eci: this is because there is a range of E mnn-\nFigure 2: The current at the collector of the velocity spectrometer (arbitrary units) as a\nfunction of the elapsed time t after application of a brief gate-opening pulse. Signals are\nshown for a range of (strong) electric fields, as indicated in units of 105 V\/m by the number\nabove each trace. The steep rise on the right-hand sides of the signals for E ≤ 2.55× 105\nV\/m indicates the arrival of the (comparatively enormous) normal ion\/vortex current.\nThe change of timescale between section (a) and (b) of the diagram should be noted.\nThese experimental results are summarised by the υ¯(E) plots of Fig. 3. In the interests\nof cl rity, only three intermediate ion signals have been plotted for E < Ec and only\nthe fastest of them for E > Ec. We have also included, for comparison, our earlier\nmeasurements (with a slightly different el c rode rra gement) of υ¯(E) for the fast ion\n[5], which are clearly seen to flatten out close to vL (60 m\/s at SVP). The precision of the\nlatter measurements is currently insufficient to establish whether or not the velocity is\nbeing limited by roton pair emission [6], as in the case of the normal ion: this will clearly\nbe an interesting and important question for future investigations.\nThe behaviour of the intermediate ions for E > Ec is, to say the least, rather puzzling.\n4\n_x_x-x_x-x\nx_x-xx__ x--\n,\/\n\/,\n!,\nFig. 3. Measured drift velocities v as a function of electric\nfield E for several species of negative ion in He II at 1.03 K:\nthe crosses represent the fast ion [5] ; the diamonds, circles\nand triangles correspond to (selected) intermediate mobility\nions; the squares indicate the (well-known) behaviour of the\nnormal negative ion; and the full curves are guides to the eye.\nThe arrows attached to the three low-field intermediate ion\nplots indicate the abrupt \"disappearance\" of the signals from\nthose species, at critical values of E where they suddenly de-\ncrease in velocity and become engulfed by the very much\nlarger normal ion signal.\ning from Eci to beyond Ecn where the (relatively\nenormous) normal ion\/vortex signal overlaps and en-\ntirely swamps the much weaker intermediate ion\nsignals.\nThese experimental results are summarised by the\nliCE) plots of fig. 3. In the interests of clarity, only\nthree intermediate ion signals have been plotted for\nE < E c' and only the fastest of them for E >E c'\nWe have also included, for comparison, our earlier\nmeasurements (with a slightly different electrode ar-\nrangement) of li(E) for the fast ion [5], which are\nclearly seen to flatten out close to vL (60 m\/s at SVP).\nThe' precision of the latter measurements is currently\ninsufficient to establish whether or not the velocity is\nbeing limited by roton pair emission [6], as in the case\nof the normal ion: this will clearly be an interesting\nand important question for future investigations.\nThe behaviour of the intermediate ions for E >Ec\nis, to say the least, rather puzzling. Drift velocities\nfor the five most prominent species, determined from\ndata such as those of fig. 2 and plotted on an expanded\nscale in fig. 4, each appear to tend towards a (different)\n2·5 3·0\nE (105 Vm\")\nFig. 4. Detailed plot, with expanded scales, of the high field\nregion of fig. 3, showing the drift velocity jj as a function of\nelectric field E for the five most prominent intermediate ions.\nThe half-filled circles represent a case (as in the top signals of\nfig. 2) where an ion peak was found to split into two separate\npeaks on further increase of E. The heavy full curve on the\nleft corresponds to the peak of the normal ion\/vortex signal,\nand the other full curves are guides to the eye.\nfield-independent limiting value of several m\/s in very\nhigh electric fields. If the exotic carriers in this regime\nare indeed charged vortex rings, as we believe to be\nthe case, then it seems extremely likely that their\nmotion will involve a continuous sequence of escape-\ntrapping-escape events [7] ; but it is far from clear\nwhy this should necessarily lead to drift velocities that\nare field independent. We may note that, in view of\ntheir higher zero-field mobilities, the exotic ions are\nprobably smaller than the normal one, so that the hy-\ndrodynamic potential [2] binding them to their rings\nwill be weaker, and thermally activated escapes will\nbe correspondingly more probable for any given temp-\nerature. We have found some indication that the pla-\nteau values of li may fall with increasing temperature.\nA possible explanation might be that the rate of vor-\ntex nucleation increases faster with temperature than\nthat of thermally activated escapes; but the question\ncannot be investigated properly with our present ap-\nparatus because of the rapid increase with tempera-\nture of E cn' which quickly causes the normal ion sig-\nnal to swamp the region of interest. Further studies,\nextending to lower temperatures and using a double-\ngated arrangement in order to separate the different\nFigure 3: Measured drift velocities υ¯ as a function of electric field E for several species of\nnegative ion in He II at 1.03 K: the crosses repr sent the fast ion [5]; the diamonds, c rcles\nand triangles correspond to (selected) intermediate mobility ions; the squares indicate\nthe (well-known) behaviour of the normal negative ion; and the full curves are guides to\nthe eye. The arrows attached to the three low-field intermediate ion plots indicate the\nabrupt “disappearanc ” f the signals from those species, at critical values of E where they\nsuddenly decrease in velocity and become engulfed by the very much larger normal on\nsignal.\nDrift velocities for the five most prominent species, determined from data such as those\nof Fig. 2 and plotted on an expanded cale in Fig. 4, ach appear to tend owards\na (different) field-independent limiting value of several m\/s in very high electric fields.\nIf the exotic carriers in this regime are indeed charged vortex rings, as we elieve to\nbe the case, then it seems extremely likely that their motion will involve a continuous\nsequence of escape-trapping-escape events [7] ; but it is far from clear why this should\nnecessarily lead to drift velocities that are field-independent. We may note that, in view\nof their higher zero-field mobilities, the exotic ions are probably smaller than the normal\none, so that the hydrodynamic potential [2] binding them to their rings will be weaker,\nand thermally activated escapes will be correspondingly more probable for any given\ntemperature. We have found some indication th t the plateau values of υ¯(E) may fall\n5\n_x_x-x_x-x\nx_x-xx__ x--\n,\/\n\/,\n!,\nFig. 3. Measured drift velocities v as a function of electric\nfield E for several species of negative ion in He II at 1.03 K:\nthe crosses represent the fast ion [5] ; the diamonds, circles\nand triangles correspond to (selected) intermediate mobility\nions; the squares indicate the (well-known) behaviour of the\nnormal negative ion; and the full curves are guides to the eye.\nThe arrows attached to the three low-field intermediate ion\nplots indicate the abrupt \"disappearance\" of the signals from\nthose species, at critical values of E where they suddenly de-\ncrease in velocity and become engulfed by the very much\nlarger normal ion signal.\ning from Eci to beyond Ecn where the (relatively\nenormous) normal ion\/vortex signal overlaps and en-\ntirely swamps the much weaker intermediate ion\nsignals.\nThese experimental results are summarised by the\nliCE) plots of fig. 3. In the interests of clarity, only\nthree intermediate ion signals have been plotted for\nE < E c' and only the fastest of them for E >E c'\nWe have also included, for comparison, our earlier\nmeasurements (with a slightly different electrode ar-\nrangement) of li(E) for the fast ion [5], which are\nclearly seen to flatten out close to vL (60 m\/s at SVP).\nThe' precision of the latter measurements is currently\ninsufficient to establish whether or not the velocity is\nbeing limited by roton pair emission [6], as in the case\nof the normal ion: this will clearly be an interesting\nand important question for future investigations.\nThe behaviour of the intermediate ions for E >Ec\nis, to say the least, rather puzzling. Drift velocities\nfor the five most prominent species, determined from\ndata such as those of fig. 2 and plotted on an expanded\nscale in fig. 4, each appear to tend towards a (different)\n2·5 3·0\nE (105 Vm\")\nFig. 4. Detailed plot, with expanded scales, of the high field\nregion of fig. 3, showing the drift velocity jj as a function of\nelectric field E for the five most prominent intermediate ions.\nThe half-filled circles represent a case (as in the top signals of\nfig. 2) where an ion peak was found to split into two separate\npeaks on further increase of E. The heavy full curve on the\nleft corresponds to the peak of the normal ion\/vortex signal,\nand the other full curves are guides to the eye.\nfield-independent limiting value of several m\/s in very\nhigh electric fields. If the exotic carriers in this regime\nare indeed charged vortex rings, as we believe to be\nthe case, then it seems extremely likely that their\nmotion will involve a continuous sequence of escape-\ntrapping-escape events [7] ; but it is far from clear\nwhy this should necessarily lead to drift velocities that\nare field independent. We may note that, in view of\ntheir higher zero-field mobilities, the exotic ions are\nprobably smaller than the normal one, so that the hy-\ndrodynamic potential [2] binding them to their rings\nwill be weaker, and thermally activated escapes will\nbe correspondingly more probable for any given temp-\nerature. We have found some indication that the pla-\nteau values of li may fall with increasing temperature.\nA possible explanation might be that the rate of vor-\ntex nucleation increases faster with temperature than\nthat of thermally activated escapes; but the question\ncannot be investigated properly with our present ap-\nparatus because of the rapid increase with tempera-\nture of E cn' which quickly causes the normal ion sig-\nnal to swamp the region of interest. Further studies,\nextending to lower temperatures and using a double-\ngated arrangement in order to separate the different\nFigure 4: Detailed plot, with expanded scales, of the high field region of Fig. 3, showing the\nd ift velocity υ¯ as a function of electric field E for the five most prominent intermediate\nions. The half-filled circles represent a case (as in the top signals of Fig. 2) where an ion\npeak was found to split into two separate peaks on further increase of E. The heavy full\ncurve on the left corresponds to the peak of the normal ion\/vortex signal, and the other\nfull curves are gu des to th eye.\nwith increasing temperature. A possible explan tion might be that the rate of vortex\nnucleation increases faster with temperature than that of thermally activated escapes;\nbut the question cannot be investigated properly with our present apparatus because of\nthe rapid increase with temperature of Ecn which quickly causes the normal ion signal to\nswamp the region of interest. Further studies, extending to lower temperatures and using\na double-gated arrangement in order o separate th differen ionic species before they\nreach the drift space of the velocity spectrometer, are currently being planned.\nWe gratefully acknowledge helpful correspondence and discussions with R. M. Bowley,\nP. W. F. Gribbon, G. G. Ihas and G. A. Williams.\nReferences\n1. C. S. M. Doake and P. W. F. Gribbon, Phys. Lett. 30A (1969) 251.\n2. A. L. Fetter, in: The Physics of Liquid and Solid Helium, Vol. 1, eds. K. H.\n6\nBennemann and J. B. Ketterson (Wiley, New York, 1976) ch. 3.\n3. G. G. Ihas and T. M. Sanders, Phys. Rev. Lett. 27 (1971) 383.\n4. G. G. Ihas and T. M. Sanders, in: Low Temperature Physics: LT13, Vol. 1, eds. K.\nD. Timmerhaus, W. J. O’Sullivan and E. F. Hammel (Plenum, New York, 1972) p.\n477.\n5. V. L. Eden and P. V. E. McClintock, in: Proc. 75th Jubilee Conf. on Liquid 4He\n(St. Andrews, 1983), to be published.\n6. D. R. Allum, P. V. E. McClintock, A. Phillips and R. M. Bowley, Phil. Trans. R.\nSoc. A284 (1977) 179.\n7. T. C. Padmore, Phys. Rev. A5 (1972) 356.\n7\n"}