{"doi":"10.1109\/RAST.2007.4284097","coreId":"102537","oai":"oai:epubs.surrey.ac.uk:2000","identifiers":["oai:epubs.surrey.ac.uk:2000","10.1109\/RAST.2007.4284097"],"title":"Uk lunar science missions: Moonlite & moonraker","authors":["Davies, P","Phipps, A","Taylor, M","Curiel, ADS","Baker, A","Gao, Y","Sweeting, M","Parker, D","Crawford, IA","Ball, AJ","Wilson, L"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-01-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2000<\/identifier><datestamp>\n      2017-10-31T14:03:58Z<\/datestamp><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:535343<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2000\/<\/dc:relation><dc:title>\n        Uk lunar science missions: Moonlite & moonraker<\/dc:title><dc:creator>\n        Davies, P<\/dc:creator><dc:creator>\n        Phipps, A<\/dc:creator><dc:creator>\n        Taylor, M<\/dc:creator><dc:creator>\n        Curiel, ADS<\/dc:creator><dc:creator>\n        Baker, A<\/dc:creator><dc:creator>\n        Gao, Y<\/dc:creator><dc:creator>\n        Sweeting, M<\/dc:creator><dc:creator>\n        Parker, D<\/dc:creator><dc:creator>\n        Crawford, IA<\/dc:creator><dc:creator>\n        Ball, AJ<\/dc:creator><dc:creator>\n        Wilson, L<\/dc:creator><dc:date>\n        2007-01-01<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2000\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Davies, P, Phipps, A, Taylor, M, Curiel, ADS, Baker, A, Gao, Y, Sweeting, M, Parker, D, Crawford, IA, Ball, AJ and Wilson, L  (2007) Uk lunar science missions: Moonlite & moonraker  In: 3rd International Conference on Recent Advances in Space Technologies, 2007-06-14 - 2007-06-16, Istanbul, TURKEY.     <\/dc:identifier><dc:relation>\n        10.1109\/RAST.2007.4284097<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2000\/","10.1109\/RAST.2007.4284097"],"year":2007,"topics":[],"subject":["Conference or Workshop Item","NonPeerReviewed"],"fullText":"UK LUNAR SCIENCE MISSIONS:\nMOONLITE & MOONRAKER\nPhil Davies\" Andy Phipps', Mark Taylor', Alex da Silva Curiell, Adam Baker', Yang Gao2, Professor Sir\nMartin Sweeting 1,2, Dave Parker3, Ian A. Crawford4, Andrew J. Ball5, Lionel Wilson6\n'Surrey Satellite Technology Limited, Surrey Space Centre, Guildford GU2 7YE,UK\n2Surrey Space Centre, University of Surrey, Guildford, GU2 7XH, UK\n3British National Space Centre\/ Science & Technology Facilities Council, London, SWIW 9SS, UK\n4School of Earth Sciences, Birkbeck College, London WC1E 7HX, UK\n5Planetary and Space Sciences Research Institute, Open University, Milton Keynes MK7 6AA, UK\n6Environmental Science Department, Lancaster University, Lancaster LAI 4YQ, UK\nAbstract - It has been 35 years since the last human presence on * MoonLITE (Moon Lightweight Interior and Telecom\nthe Moon. Since then, our knowledge of the Solar System has Experiment) comprises a small orbiter and four un-braked\nexpanded immeasurably, bringing us up against questions that penetrators. The scientific goal is to emplace a network of\nare impossible to answer on Earth. There is now a global renewed seismology and heat flow experiments to investigate the\ninterest in returning to the Moon, driven by the demands of seismic environment and deep structure of the Moon. The\nscience and as a stepping-stone for human exploration of the Solar four penetrators would be distributed over the surface, with\nSystem. The Moon provides a unique record of processes affecting at least one in the far side and one in the same area as an\nevolution of terrestrial planets in early Solar System history (the Apollo landing site. One penetrator if possible would be\nfirst Gyr or so). This includes internal processes of geological targeted at the South Pole Aitken Basin and equipped with a\nevolution (e.g. differentiation and the first formation of a crust) sensor to detect water or other volatiles.\nand external processes caused by the environment (e.g. meteorite\nflux, interplanetary dust density, solar wind flux and composition, . MoonRaker involves a single propulsive soft-lander targeted\ngalactic cosmic ray flux) that are not as easily accessible anywhere on a near-side landing site with direct communications to\nelse in our solar system. Earth. The mission has a primary goal of attempting in-situ\ndating of the young basalts at northern Oceanus\nSo far, all of the direct information concerning the lunar surface Procellarum.\nhas been obtained by a number of soft landings on the near side of\nthe Moon mainly from Apollo, Luna and Surveyor missions. This paper presents a preliminary mission definition\nActual samples have only been returned from 9 locations from (technology\/science) of the two mission concepts as well as a\nmid to low latitudes on the near side including 6 Apollo and 3 comparison with other proposed international missions. It opens\nLuna landing sites. There is little doubt that returning to the discussion on ways of leveraging the UK's role by strategic\nMoon could, with sustained effort, vastly enhance our knowledge partnering with other nations also interested in pursuing\nof the Solar System and our own planet. The UK already plays a affordable lunar exploration.\nsignificant role in lunar science research by participating in the\nClementine, SMART-1, Chandrayaan-1 and LRO missions, as 1. A UK LED LUNAR MISSION?\nwell as through geological studies using remote sensing and lunar\nmeteorite data as inputs to theoretical modelling. These place the Despite playing a strong role in the European Space Agency's\nUK in a good position to play a leading role in the next steps of Science and Exploration programmes, the UK is also driven by\nlunar exploration. several national objectives:\nRecently, the UK Science & Technology Facilities Council 1. A desire to stimulate young people to study science &\n(formerly known as PPARC) funded Surrey Satellite Technology technology (educational outreach),\nLimited and the Surrey Space Centre to carry out a pre-phase-A\nstudy of a UK-led small-scale lunar mission. A fundamental driver 2. Support of industry to develop innovative robotic\nwas that any UK-led mission must be affordable, while satisfying technology, to enable a leading role in international science\nkey science objectives not yet addressed and offering the & exploration missions,\nopportunity for educational outreach and stimulation of the UK\nindustrial capability in space exploration. The study assessed the 3 Provision to UK scientists of good opportunities for\nscientific and technological requirements of three baseline mission research, particularly in the field of lunar geology.\nOptions, namely orbiter, lander and sample return. The first\nsystem design was performed and design cost drivers in terms ofThsobetvscnalemttrugaUKedihpofe\nscience~~~~~~~~~~~pefracan reqire tcnlgweeinifd. In planetary surface mission similar in scope to the Beagle2 Mars\nthe end, two mission proposals were established, namely lander. UK industry and key UK lunar scientists have been\nMoonLITE and MoonRaker: encouraged by UK space funding agencies to study the\n1-4244-1057-6\/07\/$25.OO ©2007 IEEE. 774\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:51 from IEEE Xplore.  Restrictions apply. \nfeasibility of a low cost lunar mission addressing the objectives\nabove. This is set in the context of a comprehensive Z\ngovernment spending review due to complete in 2007. This\nspending review is an opportunity for a well-made case to be HZ\nmade for new space budget money, where a mission cost not\nexceeding tOOM and meeting the 3 objectives above might\njustify an infusion of 'new money' for UK space industry and\nacademia.\n2. LUNAR SCIENCE\nSSTL and the University of Surrey Space Centre under the\ndirection of the Science & Technology Facilities Research\nCouncil have convened an ad hoc UK lunar science steering\ngroup, S3G to examine the possible lunar science objectives\nthat could be met by a low cost mission. The S G experts come\nfrom the Open University's PSSRI, the University of\nLancashire and University College London (Birckbeck) and are\nworking towards two objectives, to ensure that a UK mission Figure 1: Lunar near side map showing landed missions. Oceanus Procellarum\ncan conduct meaningful, complementary science in a timely is on left, USSR Luna 13 and 9 landed on the Western extremity (NASA)\nfashion when compared with other lunar missions and to assist Given the significance of water ice for future manned missions\nstriking a balance between the objectives listed in Section 1 at as an In-Situ Resource Utilisation resource, considerable\nan affordable cost. attention is being given to its confirmation by the US Vision\nThe S3G rapidly determined that very few fundamental science for Space Exploration, and other international efforts. It was\nquestions, not already being addressed by international efforts not clear what a UK lead effort could contribute to the US\ncould be conducted from lunar orbit. High resolution mapping LCROSS and LPREP, and other efforts in the way of unique\nof the lunar gravity field, and high resolution (1km pixel size) science, while meeting its own objectives.\nx-ray fluorescence of the lunar stratigraphy were identified. Other investigations suggested included monitoring ageing\nHowever high level input from the British National Space effects on previous spacecraft (Apollo, etc.), analysing lunar\nCentre suggested that an orbiter mission would not serve dust in-situ and providing independent proof that the NASA\nobjective 1 well, i.e. the stimulation of young people into lunar missions actually occurred to satisfy the conspiracy\nscience & technology. Coupled with the limited orbital science theorists. Discussions rapidly converged on what science might\npotential, a low cost lunar surface science became the focus for be best performed and what instrumentation would be required:\nthe industry \/ academic team:\n2.] Lunar surface science 2.2 Lunar surface science: details\nGeneric geophysical and geochemical investigations were\nTwo particular areas were felt to be of key scientific interest toGerigopycaan mclivstainswetwoUKparcular arieasnwee felntyto keyscienti int to identified. In particular these are (i) seismology to extend thelimited Apollo seismological investigations to high latitudes\n1. Age dating of the Moon, best done from measurements of and the lunar far side to better understand the Moon's deep\nlunar nearside young basalts in the Lunar Highlands interior, (ii) heat flow measurements to more tightly constrain\n(northern Oceanum Procellarum). This area has not been measurements of lunar heat flow and evolution, and (iii)\nvisited by any current lunar lander, although the Russian geochemical analysis using spectrometers and gas analyzers to\nLuna probes took surface measurements as far north as 380 characterise major elements and minerals in previously un-\nfrom the equator. explored regions.\n2. The search for water ice, and ground truth for observation A specific set of geochemistry experiments to date younger (1\nof hydrogen concentrations by Lunar Prospector. A key Gyr) basaltic flows in the northern Oceanus Procellarum was\ntarget site is the South Pole, far side Aitken basin where defined as most attractive. Geochemistry is a key to\npermanently shadowed areas are believed to exist which understanding lunar evolution, and for better calibrating the\nmay contain water ice. lunar cratering rate that is used, with assumptions, for dating\nterrestrial surfaces throughout the whole Solar System. The\napproach which is under investigation is to adopt the Beagle2\n[2] in-situ radiometric dating package, which includes x-ray\nspectrometry K data with gas analysis package Ar data to\nobtain approximate K-Ar ages), although the feasibility\nremains to be demonstrated.\n775\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:51 from IEEE Xplore.  Restrictions apply. \nhave been envisaged, some of which have been or will be\ntested on planetary soft landers such as Viking, Surveyor,\nLuna, Mars Polar Lander and Phoenix.\n4. Sample return because of the need for surface sample\nacquisition requires a soft lander, which must also carry a\nlaunch vehicle capable of reaching either lunar orbit or with\nsufficient propulsion to return to Earth.\nPhipps and Ward at SSTL compared options (1) to (3) in 2000\n[2] and concluded firstly that off-the-shelf science instrument\ntechnology was not capable of surviving penetrator operation\nas defined in (1) above. Furthermore, soft landers (3) were not\namenable to a low cost approach at the time. The preferred\noption was an impactor (2), which would be decelerated from\nlunar orbit to an 'entry' point around l1km above the ground\nFigure 2: Beagle2 flight model Gas Analysis Package [2]. Approximate and left to fall. A large crushable structure, similar to the USdimensions 300 x 200 x 150mm, mass 6kg. Ranger missions in the 1960s, would be used to mitigate the\nSearching for volatiles, and measurement of dust properties in impact deceleration of around 100 og, leaving an instrument\nsitu were noted as worthy secondary objectives, package of around 1kg (containing COTS hygrometers and\nThe sienc workng goup lso nted hat eablig an electrical resistivity sensors) at rest approximately 0O5m under\nThe ~~~ ~ ~ ~ ~ ~~~imatrsciencegworkingicgroupadalso no that enblnga\neffective Lunar surface to Earth data relay (potentially at high the surface.\nrates of the order of 1Mbps or more) was identified as a major More recent study at SSTL has revisited the trade-offs\nscience enabler although this was not in itself of interest to associated with a soft-lander using a larger, more experienced\nscientists. team of engineers. A direct entry (from Earth) soft lander\ncarrying a geochemistry payload as described in Section 5 has\n3. METHODS OF CONDUCTING SURFACE SCIENCE been compared with an orbiter deploying a number of\nSevralopton fo coducin luar urfcescience exist. impactors carrying geophysics payloads, with a view toSEvperalmoption forage cnbeductnglunar suthrface unrori establishing the mission concept embodying the optimumExprdimentaly pcae a eelydetefrom atnslunar orbittry blend of unique science, UK technology (both COTS and under\nor dieclyfrm tas-unrraecor:development), and publicity impact to stimulate students for\n1. Penetrators, are unbraked after deorbit, and are designed to the envisaged low cost. However sample return missions were\nenter the lunar surface at high velocity typically greater very rapidly dropped from comparison due to the high\nthan lOOmis and embed themselves several metres into the parametrically established cost of known elements, and the\nregolith, decelerating with a shock of up to 250000g. high uncertainty in cost of other elements.\nPayloads are limited to highly robust potted electronics. A\ntypical penetrator example is NASA's Deep Space 2 Mars 4. LAUNCHER\nMicroprobe, which took advantage the Mars atmosphere to The key features of a launcher are principally, an ability to\nslow itself to 180m\/s impact and 30-80000g deceleration by inject a payload out of Earth orbit towards the Moon, which\nmeans of an aeroshell [3]. implies use of an additional propulsive upper stage (a departure\n222. Impactors, can be propulsively braked after deorbit to C3 of -2km s is required). Furthermore low cost, where 'low'\nremove most of the 2km\/s lunar orbital velocity, reaching typically implies a figure between $10 and $50M and heritage\nthe lunar surface with a residual velocity of 20-lOOm\/s, i.e. a successful track record of launching spacecraft beyond\ndecelerating at values not generally exceeding 10000g. Or, LEO and ideally on interplanetary trajectories, are required.\nthey can use a crushable structure that impacts the surface These criteria limit suitable launchers to just two at present, the\nunbraked and limits the deceleration. Impactor payloads are Antrix PSLV and the Soyuz-Fregat. All other launchers present\nmostly limited to solid-state electronics if they are to a significant cost increase or unacceptable risk, in addition to\nsurvive impact and remain operable. NASA's Ranger the high risk implied by a low cost lunar mission. PSLV with\nmissions used an unbraked crushable structure, more recent an estimated TLI throw mass of 810kg, a reported cost of $15-\nmissions such as the by the MER, Pathfinder and ill-fated 25M (based on media reports for Chandrayaan-1) and a 26\nBeagle2 missions reached a terminal velocity of 5-20m\/s, month lead time is attractive. The payload fairing envelope\nequivalent to a free-fall drop from 10-1OOm altitude, which schematic is given below and appears generous compared to\nwas mitigated using airbags (or crushable structure). the volume of many low cost space missions to date:\n3. Soft-landers, use propulsive braking (retro-rockets) to\nreduce terminal velocity to <5m\/s, and compliant structures\nto then cushion the residual velocity. A wide range of\npayloads ranging from robot arms, moles or even rovers\n776\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:51 from IEEE Xplore.  Restrictions apply. \nPower figures are deceptive since not all instruments or sample\nmanipulation devices will be operational simultaneously.\nSensitivity to landing shock, volume, duty cycle and data\nresource requirements must also be considered, and together\nDYNAMCENVLOPE with the comment on power illustrate one of the many limits of\nthe parametric approach.\n6. SSTL'S APPROACH TO LUNAR MISSIONS\nSSTL has been studying low cost lunar missions since the\n1996, notably for ESA's LunarSat study culminating in 2002\n[5]. SSTL's earlier internal lunar orbiter studies are clearly\nsummarised by Phipps in [6], and were largely based on\n.AYMAD _ _UoSAT-12 configuations [7]. The notable difference between\nA-APTC\" J937FI XAYOA the current increase in activity and earlier work is the presence\nof a possible UK government customer, coupled with SSTL's\nnew heritage outside LEO with a high power large payload\nplatform. Since December 2005, SSTL has been operating the\nGIOVE-A minisatellite in MEO for ESA's Galileo In-Orbit\nP8OPU IONCOE - Verification Programme [8]. GIOVE-A and the recently\ncompleted SSTL RapidEye platforms use a number of\nFigure 3: PSLV payload faifing subsystems which might greatly enhance performance and\nSoyuz with a Fregat upper stage, launching from Baikonur has reduce risk on a demanding lunar mission. These include\na 1600kg TLI capability, and the S fairing offers a 3.5m radiation-hard flight computers, fault tolerant high accuracy 3-\ndiameter and 2.3-5.5M of useable length. The price of a Soyuz axis control, deployable solar arrays and a kW class power\nFregat purchased from Starsem is around $60M. The capability system. The lunar orbit environment is generally felt to pose\nwill be raised to -1850kg with launches from Kourou although similar hazards to LEO, so with the development of a highly\nthe price may also rise. capable yet low cost platform (the GIOVE-A contract was\nvalued at 28MkC) and extensive heritage in LEO, SSTL feels a\n5. SCIENCE INSTRUMENT PACKAGE lunar orbit is a reasonable goal for a low cost mission. The\nadvent of at least two low cost launchers (q.v.) and the prospect\nUnlike the launcher capabilities given above, lunar science Of further developments such as Dnepr upper stages and\ninstrument size, mass and also power figures are not so readily Falcon-i I 9 support this case.\navailable. Science instruments tend to be bespoke for a given\nmission, although their development or a heritage development However, either hard or soft landing on the moon poses a\nis usually mature before mission design occurs. The table number of additional challenges to SSTL's low cost satellite\nbelow gives currently estimated mass and power figures for 4 engineering capability. Some of these challenges include:\npossible payloads: * Precision guidance during trans-lunar trajectory, to enable\nPayload Mass PIdk OtherIssus Ieither orbital insertion or a target ellipse on the surface.|PayloadI Mass Peak Othefr issues|(kg) power (W) * Accurately controlled deceleration propulsion, typically of\nGeophysics 13I 5 52 Robot arm, the order of 2-2.5km\/s, to ensure moderate landingGeophysics I | 13.5 | 52 | Robot arm, velocities.\nbasic Mossbauer,\ngeochemistry microscope * Precision guidance during terminal descent phase, to avoid\nl|LAMSS, obstacles, target basalt rocks for grinding \/ coring (and\nseismometer, access fresh sub surface fresh material).\nl________ l____| |__ heat flow\nGeochemistry 23I 1 Basd * Power supply and thermal control if survival beyond 1Geochemistry 23.1 55 Beagle2 GAP lunar 'day' (14 Earth days) above the surface is desired.\nIinc. dating Iege GAP\n+SHADS Although the majority of mission risks associated with a low\nI________ ___________ +LCE [2] cost lander are propulsion and guidance related, these are still\nMicro rover 9.4 37 Nanokhod not significant when considering the propulsion experience ofl_______ l__________ appropriate SSTL has been limited to low thrust deltaV orbit control and\n|Robot arm + |7.3 |20 |Assumes stereo some ground based tests of high thrust 'green' chemical\n|sample prep cam, near infra- propellant systems. Sample return requirements magnify thesample\n' || red microscope, technical challenges further.( sample return) stereo camera\nTable 1: Example payloads for a low cost lunar lander mission\n777\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:51 from IEEE Xplore.  Restrictions apply. \nA parametric analysis identified the following low cost lunar\nmission options, satisfying the UK' s lunar exploration\nobjectives to a greater or lesser degree:\nMission Lanhr Benefit Cost\n(mass ~~~~~~estimnate,\nbudget)\nOrbiter Shared Proton Low: little £50M\nto GEO useful orbital\n(400kg) science\nOrbiter + up to PSLV Medium: > £50M\n4 unbraked (800kg to TLI) Geophysics -\npenetrators heat flow,\nseismology\nSoft lander, PSLV Medium-High: Approaching\ndirect entry (800kg to TLI) Geochemistry £00oM,\nconsiderable\nuncertainty\nSoft lander & Soyuz-Fregat High: At least £100M\ncomms relay (1600kg to Geochemistry |\nTLI) - no restriction Figure 4: MoonLITE\nl__________l _I on landing site Each penetetrator weighs 36kg and contains a de-orbit\nTable 2: Low cost lunar mission options -2006 propulsion system capable of slowing the penetrator down to\n* ~~~~~~300ms- I at impact. The penetrators implement a passiveLunar Sample Return was parametrically costed at £275M. 300mosgiat impact. Thepenetratorimplemena passive\nThis dramatically exceeds even the most optimistic projections seismological network capable of monitoring the deep interior\nof funds available for a UK mission, although this includes over a 1 year mission lifetime. The penetrators all carry\nalmost 100% uncertainty due to the number of complex, low instruments for measuring heat flow. Data is returned from the\nmass system elements which may not be available in COTS\nform. 8. MOONRAKER MISSION SUMMARY\n7. MOONLITE MISSION SUMMARY MoonRaker comprises a single soft lander, establishing a low-\nThe MoonLITE mission comprises a lunar orbiter and four cost European lander capability for robotic exploration of the\npenetrators. The orbiter payload will include a navigation Moon. The aim of the proposed first mission would be to\nsignal and communications demonstration package and support perform in-situ dating of rocks on the near-side, in northern\nequipment for the penetrators. Oceanus Procellarum. The mission could be implemented as abilateral or multilateral co-operation or via ESA's Aurora\nThe launch would be a direct injection into trans-lunar orbit by programme. Moon Raker would demonstrate a key technology\nPSLV. The orbiter carries a MMH\/NTO biprop motor with a required by Europe for future planateray landers, namely\n400-500N main thruster. This system will perform the vision-based precision landing with hazard avoidance.\nmanoeuvres to place MoonLITE into a 100km altitude circular\npolar lunar orbit. The total A\\V required for the mission is 1.217 MoonRaker' s propulsion system would contain a solid rocket\nkm s'l. motor (e.g. Star 30BP) for main braking manoeuvre (which\nwould be performed spin-stabilised). The solid motor is\nMoonLITE is a 3-axis stabilised satellite and carries a full jettisoned and liquid monopropellant (hydrazine) propulsion\ncomplement of SSTL micro-satellite avionics. takes over for despin and 3-axis-stabilised final descent\nCommunications to and from Earth for TT&C is performed in braking.\nS-band and the orbiter will carry a Ku-band receiver for a high- MoonRaker carries a full complement of SSTL micro-satellite\nrate surface communications demonstration.\navionics. Communications to and from Earth for TT&C is\nThe nominal ground station for the mission is the 12m antenna performed in S-band (4kbps up, 2kbps down) and science data\nat Rutherford Appleton Laboratory located at Chilton in (38.4 kbps) is delivered using omnidirectional and high-gain\nOxfordshire. antennas.\nLaunch is targetted for the timeframe 2010-2011. The Payload carried by MoonRaker has a mass of up to 23.6 kg\nThe figure below shows the configuration of the main satellite including the sample acquisition system.\nwith a single, deoloyed, sun tracking array. Mounted on the The mission lifetime on lunar surface would be 3 months (i.e. 3\nside of the satellite are the 4 penetrators. lunar days). MoonRaker is technically compatible with a\nlaunch in 2013. Launch would be direct injection into a\nhyperbolic approach trajectory by a vehicle such as PSLV.\n778\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:51 from IEEE Xplore.  Restrictions apply. \nThe figures below show MoonRaker on its way to the moon, The MoonRaker payload would contain an in-situ dating\nimmediately after the jettison of the solid motor and safely package which would use the K-Ar technique to establish the\nlanded on the surface of the Moon. date of the youngest lava flows on the Moon, suspected to be\n1.2 Ga old from crater counting. A more precise date would be\nuseful for understanding the Moon's thermal evolution and\nprovide better calibration of cratering rates used for dating of\nother surfaces in the Solar System.\nThe in situ K-Ar technique would combine heritage from the\nX-ray fluorescence spectrometer and gas analysis package\nflown on Beagle 2. Sample collection would need to access\nrocks larger thano10 mm diameter in order to obtain dates\nfrom their interiors. One approach might be to use a rake,\nhence the name MoonRaker.\nREFERENCES\n[1] Ball A, Crawford I; Meeting Report: 'Which way to the Moon', Astronomy\n& Geophysics, August 2006 vol. 47, pages 4.17-4.19.\n[2] Pullan D, Sims M, WrightA, Pillinger C, Trautner R, Beagle 2: the\nExobiological Lander of Mars Express, ESA SP-1240, May 2004, pp. 40.\n[3] Smrekar S E, Gavit S A; Dep space 2: The Mars microprobe project andFigure_5: MoonRaker in Transit beyond, presented at the First Intenational Conference on Mars Polar\nScience; October 1998, Houston, USA; pp. 2.\n[4] Phipps A, Ward J; Conceptual study of low cost lunar lander for modest\nscientific objectives; IAC IAA.11.2.xx presented at the 51st Intermational\nAstronautical Congress, Rio de Janeiro, Brazil, 2-6 Oct 2000, pp. 15.\n[5] NASA SP-34 Lunar Fight Handbook (vols 1-3), part of Spaceflight\nHandbooks, Marshall Space Flight Centre under contract NAS 8-503 1, eds. F\nMartiken et al, 1963, pp. 160 (vol.1);\n[6] da Silva Curiel A et al, Lunar Academic Research Satellite LunarSat Phase\nC\/DIE technical proposal; SSTL proposal to ESA, February 14, 2002, pp. 62.\n[7] Phipps A; Low Cost Lunar Orbiter System Design; 24th IEEE Aerospace\nConference, Big Sky, Montana, USA. March 8-15 2003.\n[7] Ward J, Sweeting M, First In-orbit results from the UoSat-12 minisatellite,\nSSC99-1-2, presented at the ]3thi annual AIAA \/ USU small satellites\nconference, Logan, Utah, August 1999, pp. 13.\nFigure 6: MoonRaker Jettisoning Solid Motor [8] First Galileo signals transmitted by GIOVE-A, European Space Agency\npress-release PR 03-2006; 12 January 2006. Available at\nhttp:H\/www.esa.int!esaCP\/SEMQ36MZCIE index O.html. Page accessed 12-\nSept-06.\n[9] Oberto B; Lunar South Pole-Aitken Basin Sample Return 2001-12; JPL\nadvanced concepts team (Team X), September 2003, pp. 74.\n[10] Ellery A; Feasibility of Low-Cost Lunar Sample Return Micro-Mission;\npresentation to the Royal Astronomical Society 'Exploring the Moon in the\n21st Century' symposium; November 11 2005.\n[11I] Baker A M, Coxhill I, Henshall P, Chemical propulsion systems for low\ncost Mars sample return, AIAA 2004-3492, presented at the 40th AIAA Joint\nmUm\n~~~~~~~~~~~~~~~~~PropulsionConference, Fort Lauderdale, Florida, July 2004, pp. 12.\nFigure 7: MoonRaker Landed\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:51 from IEEE Xplore.  Restrictions apply. \n"}