{"doi":"10.1109\/VTEST.1998.670893","coreId":"69884","oai":"oai:eprints.lancs.ac.uk:20376","identifiers":["oai:eprints.lancs.ac.uk:20376","10.1109\/VTEST.1998.670893"],"title":"A design for testability study on a high performance automatic gain control circuit.","authors":["Lechner, A.","Richardson, A. M. D.","Hermes, B.","Ohletz, M."],"enrichments":{"references":[{"id":16336757,"title":"Correct Hardware Design Methodologies: Design for Verifiability vs. Design for Testability: limiting designers’ freedom to achieve what?","authors":[],"date":"1992","doi":null,"raw":"P. Camurati & P. Prinetto: Correct Hardware Design Methodologies: Design for Verifiability vs. Design for Testability: limiting designers’  freedom to achieve what? Elsevier Science Publisher pp. 295-309, 1992.","cites":null},{"id":16336759,"title":"Prevent difficult to detect shorts between resistors connected to each other. Adjacent resistive tracks should not belong to resistors connected to each other (sec. 4.4)","authors":[],"date":null,"doi":null,"raw":"Prevent difficult to detect shorts between resistors connected to each other. Adjacent resistive tracks should not belong to resistors connected to each other (sec. 4.4)","cites":null},{"id":16336760,"title":"Realise stand-by mode by switching gate potentials of cascode transistors to the power supply in order to detect faults affecting cascode transistors (sec.","authors":[],"date":null,"doi":null,"raw":"Realise stand-by mode by switching gate potentials of cascode transistors to the power supply in order to detect faults affecting cascode transistors (sec.","cites":null},{"id":16336761,"title":"Reduce demands on ATE (on-chip test support), preprocess test response on-chip through re- use of existing mixed signal and digital structures (sec. 4.1)","authors":[],"date":null,"doi":null,"raw":"Reduce demands on ATE (on-chip test support), preprocess test response on-chip through re- use of existing mixed signal and digital structures (sec. 4.1)","cites":null},{"id":16336762,"title":"Run simple separate test in reconfigurable structures, such as the AGC feedback network (sec. 4.7)","authors":[],"date":null,"doi":null,"raw":"Run simple separate test in reconfigurable structures, such as the AGC feedback network (sec. 4.7)","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1998","abstract":"A comprehensive testability study on a commercial automatic gain control circuit is presented which aims to identify design for testability (DfT) modifications to both reduce production test cost and improve test quality. A fault simulation strategy based on layout extracted faults has been used to support the study. The paper proposes a number of DfT modifications at the layout, schematic and system levels together with testability. Guidelines that may well have generic applicability. Proposals for using the modifications to achieve partial self test are made and estimates of achieved fault coverage and quality levels presente","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69884.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/20376\/1\/20376.pdf","pdfHashValue":"c915e1d1c6052d21c19427b32d077b8cedf9d841","publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:20376<\/identifier><datestamp>\n      2018-01-24T01:57:26Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5441<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A design for testability study on a high performance automatic gain control circuit.<\/dc:title><dc:creator>\n        Lechner, A.<\/dc:creator><dc:creator>\n        Richardson, A. M. D.<\/dc:creator><dc:creator>\n        Hermes, B.<\/dc:creator><dc:creator>\n        Ohletz, M.<\/dc:creator><dc:subject>\n        TA Engineering (General). Civil engineering (General)<\/dc:subject><dc:description>\n        A comprehensive testability study on a commercial automatic gain control circuit is presented which aims to identify design for testability (DfT) modifications to both reduce production test cost and improve test quality. A fault simulation strategy based on layout extracted faults has been used to support the study. The paper proposes a number of DfT modifications at the layout, schematic and system levels together with testability. Guidelines that may well have generic applicability. Proposals for using the modifications to achieve partial self test are made and estimates of achieved fault coverage and quality levels presented<\/dc:description><dc:publisher>\n        IEEE<\/dc:publisher><dc:date>\n        1998<\/dc:date><dc:type>\n        Contribution in Book\/Report\/Proceedings<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/20376\/1\/20376.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/VTEST.1998.670893<\/dc:relation><dc:identifier>\n        Lechner, A. and Richardson, A. M. D. and Hermes, B. and Ohletz, M. (1998) A design for testability study on a high performance automatic gain control circuit. In: Proceedings of the 16th IEEE VLSI test symposium. IEEE, pp. 376-385.<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/20376\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1109\/VTEST.1998.670893","http:\/\/eprints.lancs.ac.uk\/20376\/"],"year":1998,"topics":["TA Engineering (General). Civil engineering (General)"],"subject":["Contribution in Book\/Report\/Proceedings","NonPeerReviewed"],"fullText":"A Design for Testability Study on a High Performance Automatic Gain Control Circuit\nA. Lechner1, A. Richardson1, B. Hermes2 & M. Ohletz3\n1\n Lancaster University, Engineering Department, Lancaster, LA1 4YR, UK.\n2\n Philips Semiconductors, Millbrook Industrial Estate,  Southampton, SO15 ODJ, UK.\n3\n Universität Hannover, Institut für Theoretische Elektrotechink, 30167 Hannover, Germany.\nAbstract\n A comprehensive testability study on a commercial\nautomatic gain control circuit is presented which aims to\nidentify design for testability (DfT) modifications to both\nreduce production test cost and improve test quality. A\nfault simulation strategy based on layout extracted faults\nhas been used to support the study.\nThe paper proposes a number of DfT modifications at\nthe layout, schematic and system levels together with\ntestability guidelines that may well have generic\napplicability. Proposals for using the modifications to\nachieve partial self test are made and estimates of\nachieved fault coverage and quality levels presented.\nKeywords:  Design-for-testability, mixed signal, test,\nintegrated circuit, IDDQ\n1 Introduction\nThe escalating cost of testing analogue functionality\nin mixed signal VLSI has become a problem requiring an\nurgent solution. In this paper, the testability of a commonly\nused mixed signal macro, an automatic gain control circuit\n(AGC) has been investigated & improved. This has been\nachieved through the application of a structured,\nhierarchical design for testability (DfT) methodology\nvalidated by a robust fault simulation strategy. The\nobjective of the work is to both reduce test cost and test\nescapes and hence improve test quality to a level now\nachieved for digital IC’s through scan and IDDQ test\nstrategies. The circuit is particularly problematic as its\nconfiguration can be changed, the gain varied and its\nfeedback path tends to reduce the impact of faults on\nprimary measurands. A defect oriented test approach has\nbeen applied involving detailed fault simulation to\ndetermine the fault coverage and clearly define the testing\nproblem.  In order to optimise the testability, difficult to\ndetect faults have been examined in detail, leading to DfT\nimprovements involving layout modifications, additional\ncircuitry to support current testing and the integration of\ntest modes capable of reconfiguring parts of the circuit to\nsupport partial built-in self test (BIST). Generic DfT\nguidelines at the schematic and layout level, which can be\napplied in the early design stages to prevent time\nconsuming redesign, have been generated.\n1.1 State-of-the-Art in Analogue and Mixed\nSignal Testing\nIn the digital domain, design for testability (DfT) is\nwell established1, with full or partial scan2 being\nimplemented successfully in the majority of complex\nproducts. In addition, the IEEE standard 1149.1 test access\nport and boundary scan architecture3 has been well\naccepted by digital designers. Due to the dramatic increase\nin complexity of digital circuits, built-in self-test (BIST)\nhas been realised mainly in highly structured commercial\ndesigns to implement some of the test functions on-chip.\nCurrently, functional testing is performed on analogue\ncircuits after wafer processing, where every IC is checked\nagainst critical specifications4,5. The optimisation of such\ncircuit specific test programs is difficult to handle and\nexpensive due to the required engineering resources.\nAdditionally, neither the test quality nor the yield can be\nestimated, as the product is not directly tested for defects.\nGeneric DfT guidelines which can be applied in the early\ndesign stages and practical mixed signal BIST could pave\nthe way to satisfying industrial demands for the use of\ndigital only testers6,7. Increasing test cost, aggressive time\nto market (TTM) and the need to improve product quality\nis currently driving this change in test philosophy. Finally,\nit should be noted that for many highly safety critical\napplications, DfT is already essential, as in many cases the\ncircuit has to be highly testable and capable of on-line\nverification.\nAn overview of defect oriented testing and DfT\noptimisation of mixed signal ICs is presented in5,8. Several\nDfT studies have been published, including work on a\ncurrent mode DAC where test vectors are optimised and\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 17, 2008 at 11:39 from IEEE Xplore.  Restrictions apply.\nredundancies removed9, on analogue filters where the\ncontrollability and observability is improved to test a\nnumber of stages separately10,11,12,13 and on flash ADC14,15.\nMotivated by the success of the 1149.1 scan bus, the IEEE\nMixed-Signal Testability Bus Standard P1149.4 has been\ndeveloped16, 17 which despite little interest to date, is likely\nto radically improve test access at the chip level. The\nAnalogue Circuit Observer Block18 reduces the need for\nprecision by encoding the data during circuit test. A DfT\nsystem level architecture, using the sw-opamp concept19,\nimproves the controllability and observability in a multi\nstage circuit and includes off- and on-line tests with BIST\ncapabilities13. A similar demonstrator has been chosen for\nAUBIST20,21 which compares the output response of\ncascaded biquads. The multifunctional ABILBO structure\nincludes a test stimulus generator (TSG), output response\nanalyser (ORA) and an analogue scan path. Further\nproposals have been made to realise a pure analogue BIST.\nThe TBIST22 translates parameters at certain circuit nodes\ninto a proportional DC voltage to verify whether a\nparameter (gain or phase) is inside specification. The\nABIST23,24 allows parallel loading of test data (voltages or\ncurrents) into a buffer and serial transfer to the output. The\nstructure has been extended for mixed signal circuits in\norder to implement one structure that enables digital and\nanalogue BIST25. The HBIST concept26 includes an on-\nchip TSG that converts digital test patterns to a test\nstimulus, and is realised by the reconfiguration of cells\nalready present to perform the digital BIST. Other concepts\nsuitable for mixed signal circuits where the digital kernel\nis surrounded with analogue sub-circuits on the input and\noutput, are the MADBIST concept for S D  converters 27,28,29\nand the BIST for the converters on a single-chip\nCODEC30. The OBIST technique31, suitable for both\nfunctional and defect oriented testing, is based on the\noscillation test methodology. Finally, a promising approach\nto calculate analogue parameters for DAC’s and ADC’s\nhas been presented by Sunter and Nagi32.\nIn the majority of cases, the effort and initial financial\ninvestments required to integrate DfT are usually justified,\nas either test cost or test quality is improved. Additional\nbenefits are gained where the design becomes part of a cell\nlibrary or is intended for re-use. Most DfT methodology\nshould also be re-usable to be industrially practical.\nIn this paper, some easy to apply DfT guidelines and\nstructures are presented which are transferable to other\nmixed signal designs. The improvement in test quality and\nthe reduced demands on external automatic test equipment\n(ATE) are presented and justified in the following\nsections. In section 2, the AGC structure is summarised\ntogether with the functional tests currently applied. The\nfault simulation approach, including the fault list\ngeneration and fault simulation models used are presented\nin section 3. Section 4 describes the DfT study including\nseveral DfT optimisations at the layout, schematic and\nsystem level. Finally the paper concludes with a discussion\nand future issues.\n2 The Automatic Gain Control Circuit\n(AGC)\n disable\n in       out\nfeed  back\nnet  work\nHPFin1\nin2\nsel\nMUX\n +\n -\nOP1\n +\n -\nOP2 ADC\ndigital\ncontrol\nloop\nDecoder\nADC\nHPb\nmidrail voltage\nout1\nout\nsel\nin2\nIin\nin1\nD\nS\nS\n5\n532\n7\n8\n$*&\nBiasing\nCircuitry\nFigure 1 : Simplified AGC structure\nThe demonstrator is an AGC macro used to digitise\nsound signals. As depicted in figure 1, the input stimulus is\nfed to an adjustable high bandwidth OTA (OP1) in a non-\ninverting configuration whose gain is controlled digitally.\nThe gain can be varied in 32 steps by a decode on the 5-bit\ngain set S provided by the digital control loop. The high\npass filter (HPF) with a 3 dB corner frequency of 3.5 MHz\nis controlled by the top level signal HPb and can be by-\npassed. The second stage of the AGC is an inverting folded\ncascade OTA (OP2) providing a level shift, as the output\n(out) is referenced to the 24.57 MHz flash-ADC mid-\nladder potential.\nThe AGC, containing 544 CMOS transistors, 394 in\nthe digital converter, has been designed in a 1.0 m m single\npoly double metal CMOS process and occupies 0.4 mm2 of\nsilicon. A typical test plan for the AGC circuit is listed in\ntable 1.\nThe main test problem for this circuit is the variable\ngain. Furthermore, two inputs and the configuration with\nen-\/disabled HPF need to be tested. A massive reduction in\ntest time could be achieved by reducing the number of gain\n1 AC performance in all gain sets (gain peaking,\ngroup delay)\n2 DC offsets in 3 gain sets using Monte-Carlo analysis\n3 Transient response to switched capacitor load.\n4 Transient response to input sinusoid at two\nfrequencies\nTable 1: Functional test program\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 17, 2008 at 11:39 from IEEE Xplore.  Restrictions apply.\nsets that the circuit needs to be switched into during test.\nReductions in test cost can also be realised by on-chip test\nresponse evaluation or pre-processing. The surrounding\ndigital and mixed signal cells should be taken into account\nin order to reduce the demands on external ATE.\nThe goal of this paper is to investigate these\npossibilities through extensive fault simulation. A defect\noriented approach has been adopted based on the success of\nthe technique on related projects.\n3 Analogue Fault Simulation\nDefect oriented testing has the potential to decrease\ntest time and cost whilst improving test quality. The costs\nfor collecting process and defect statistics and creating\nsimulation models can be significantly reduced if\nhierarchical defect oriented fault simulation is embedded\nwithin the design cycle, using appropriate CAD tools. The\ntrend towards cell based system design creates a demand\nfor analogue libraries containing testability optimised cells,\nincluding macro fault models and test strategies. Once this\nis achieved, the DfT and fault simulation problem can be\ntransferred to a higher design level.\nThe quality of any fault simulation strategy strongly\ndepends on the simulation models used and the applied\nfault set. Fault simulation models have to be developed to\ntransfer an electrical interpretation of several physical\ndefect mechanisms to the schematic level. For a set of\nfaults, the corresponding fault simulation models are\ninserted at the schematic level and simulated. The fault\ncoverage (FC) can be determined through a comparison of\nthe faulty and the fault free test response by taking realistic\nfault detection criteria into account.\nIn section 3.1 the fault list generation is described,\nfollowed by a presentation of the fault simulation models\nused, (3.2) the fault simulation methodology and the\nestimation of fault detection criteria (3.3).\n3.1 Fault List Generation\nCurrently, a number of different techniques are used\nto generate fault lists for analogue circuits33,34,35. In this\nstudy, the fault list has been extracted from the layout\nusing the Inductive Fault Analysis (IFA)36 tool VLASIC37.\nThe resulting layout extracted fault list contains several\nkinds of shorts (inter-node, inter-resistor or shorts affecting\nmultiple nets) and opens. The main advantage of this fault\nlist is that a weighted fault coverage (WFC), taking the\nfault probability into account, can be computed and\ndifficult to detect faults can be related to certain layout\nstructures38, 39. To enable fault simulation prior to layout,\nthe re-use of DfT optimised cells and their corresponding\nlayout extracted fault list is a promising compromise.\nOther techniques link typical schematic level structures,\nlike current mirrors, differential stages, etc., to a list of\nlikely and realistic faults without layout information40, 41.\n3.2 Fault Simulation Models\nFault simulation results have to be linked to the fault\nlist considered and the fault detection thresholds used. Due\nto the lack of commonly used fault models, those injected\ninto the netlist in this work will be presented briefly in this\nsection. Detailed information about failure mechanisms\nand defects can be found in42,43,44.\nShort: For any kind of short the built-in resistor\nmodel is inserted at the schematic level. If a (polysilicon or\ndiffusion) resistor is connected by a defect to another net,\nthe affected resistor is split in two, each having half the\nvalue. For shorts between more than two nets and\/or\nresistors (fig. 2.a) the short-resistor will be split in the\nsame way. The value of the built-in resistor model depends\non the spot defect size and exact location45. During the\nfault simulation, a minimum value of 0.2 to 20 W ,\ndepending on the kind of defect, and a maximum value of\n1k W  is used. A short will be classified as detected if both of\nthe resistor values, the upper and the lower, result in a\ndetectable deviation during the applied test program.\nOpens at device terminals, inside a resistor and at\nsplit nodes (fig. 2.b) will be modelled by a 10MW  resistor.\nFloating Gate Transistor (FGT): The modelling of\nthe floating gate transistor is not easy to handle46. For the\nsimulation model used, the following assumptions have\nbeen made:\n• large opens, means no tunnelling.47\n• crack close to the gate area.\n• coupling from drain (and channel) greater than\nany other capacitive coupling.48\nThe gate to source voltage that defines the behaviour\nof the FGT can be given as:\ngb +×= dsgs VV ; \nVVVPMOS\nVVVNMOS\n0V ;0V ;2.0;2.0:\n0V ;0V ;5.0;2.0:\ndsgs\ndsgs\n<<==\n>>==\ngb\ngb\nThe term b •Vds characterises the coupling and g\nrepresents the initial positive charge on the floating gate\ncaused by the plasmas used for etching in IC fabrication48.\nThe replacement model is shown in figure 2.d.\nSource Drain Path (SDP): A polysilicon crack in the\nactive gate area results in a smaller width and a diffusion\npath between source and drain49. The corresponding\nsimulation model is shown in figure 2.c. The width of the\ntransistor is assumed to be 50% less in this case with the\ndiffusion path modelled by a resistor. Concerning the fault\nsimulation of the AGC, some devices have a folded poly\ngate structure, thus the width of the transistor will not be\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 17, 2008 at 11:39 from IEEE Xplore.  Restrictions apply.\nreduced by a SDP. The value of the resistor Rcrack has been\ncalculated at 100 W  for a squared defect (1 m m•1 m m) of\nmissing polysilicon. As a crack will have a much smaller\nsize, the simulation model for the SDP includes a 1 k W\nresistor between drain and source.\n           \nlayout       SHORT         schematic\n   R1                              R1\nMe1\n   R2\nR2                       half RSHORTMe1\n      \nmissing oxide\nlayout                OPEN        schematic\n   R1                                                 R1     Ropen\n                             C\n  A                                   D                 Ropen        C\n                                                   A                        D\n                                                   B                       E\n      B                        E\nlayout                  FGT         schematic\n                        D                                                   D\n      crack                                     G\n                       S                                                     S\nG\n             layout           SDP        schematic\n        S                                         S\n          D                                         D\n                                               G                       Rcrack\n  crack\nW\nW’G\n c)  d)\n b) a)\nsplit node\nG’\nb Vds\ng\n10M W\nFigure 2: Fault simulation models\n3.3 Fault Simulation and Fault Detection\nThe analogue fault simulation tool AnaFAULT50 has\nbeen used to run the fault simulation. In addition, the ATE\nresolution, process variations and specification tolerances\nare simulated using Monte Carlo analysis to estimate\nrealistic fault detection thresholds.\nFor future research, the computer aided test (CAT)\ntool, CADEFSIM, that has been embedded into the design\nenvironment and successfully demonstrated by Lancaster\nUniversity38 will be used. This software enables the\ngeneration of a layout extracted fault list by a critical area\nextractor and allows both schematic based fault simulation\nand the graphical output of computed FCs without leaving\nthe design environment.\n4 Design for Testability Optimisation at the\nLayout, Schematic and System Level\nThe generation of an optimum test program for the\nAGC presented in this section is based on fault simulation\nagainst layout extracted faults, as described in section 3.\nUsing this approach, test quality can be calculated in three\ndifferent ways, referred to as fault coverage (FC), weighted\nfault coverage (WFC) and quality estimation in parts per\nmillion (ppm) defect levels as given in equation 138. WFC\nand quality prediction can be achieved because the layout\nextraction process is statistical involving defect extraction\non a batch of devices that is a variable number in the defect\nextraction tool.\nNote that the equation for WFC simply takes into\naccount that some faults will be highly probable and\nstatistically occur on a greater number of devices in a batch\nthan other faults. It hence makes sense that the fault\ndetectability of a certain test should be “weighted” by this\n“probability” figure.\n%100\n*\n            %100\n1\n11\n×=×=\nå\nåå\n=\n==\nN\nn\nN\nn\nN\nn\nWn\nWnDn\nWFC\nN\nDn\nFC\nppm1e\nWDB\nWDW\nFDL 6\nN\n1n\nnn\nN\n1n\nnn\nN\n1n\nn\n×\n×-\n×-\n=\nå\nåå\n=\n==\n(1)\nFC: Fault Coverage N: no. faults simulated\nWFC: Weighted Fault Coverage B: no. devices in batch\nFDL: Faulty Device Level (ppm)\nWn: total number of circuits\n in the batch affected by fault n\nDn: binary function,\ndetected=1, undetected=0\n# faults\n0\n100\n200\n300\n400\nBias OP1 OP2 Global\nopen\nnode-resistor short\nresistor short\nmultiple node short\ninter node short\n#  faulty circuits in ppm\n0\n4000\n8000\n12000\n16000\n20000\nBias OP1 OP2 Global\nFigure 3: Location of faults and affected circuits\nin ppm\nIn the layout extracted fault list, 511 faults affected\nthe digital converter, a FC of more than 99% has been\nproven for the digital test. Analogue faults are related to\nthe cells affected in figure 3, where inter-cell shorts are\ngrouped in global. It can be deduced that most faults (361)\naffect OP1 (fig. 3.a), while the most likely faults are\nlocated in OP2 and the global circuitry (fig. 3.b). These are\nthe shorts in OP2 and the HPF capacitors. It can also be\nseen that shorts between two nodes are more likely to occur\nthan shorts affecting resistors or any kind of open.\nHowever, for each test, 624 different faults need to be\nconsidered resulting in 1150 simulations, as shorts have to\nbe simulated with the upper and lower value for the\nresistor simulation model (sec 3.2).\n4.1 Ramp Stimulus Test\nSeveral AC, DC and transient simulations have\nshown that the AGC circuit should be switched in at least\ntwo gain sets to achieve an acceptable fault coverage. Due\nto the implementation of OP1, the gain sets S1 = 01010\nand S2 = 10101 have been chosen. Furthermore HPF has to\n(a) (b)\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 17, 2008 at 11:39 from IEEE Xplore.  Restrictions apply.\nbe disabled. A ramp stimulus has been applied to the first\ninput (in1) of the analogue multiplexer and characterised\nin such a way that the analogue test response will cover the\nwhole input range of the ADC connected to the analogue\nAGC output (see fig. 1). During test mode, digital cells\nneed to be reconfigured in order to count rising or falling\nedges of the ADC’s least significant bit (LSB). For the\nfault simulation, a very simple behavioural model of an 8-\nbit ADC has been used, and the counter has been written\nas a special fault detection software routine. In future\nprojects the ADC, the 8-bit up\/down counter and layout\nextracted faults for both cells will also be considered.\nDuring the transient fault simulation, the rising and\nfalling edges of the LSB are counted (CNT), the analogue\n(Iana) and digital (Idig) current consumption monitored\nand the analogue output voltage (Vout) measured. The\ncalculated fault coverage figures are depicted in figure 4.\nThe difference in the fault coverage between the LSB\ncounting method and the output voltage measurement\n(Vout) results from a wider tolerance assumed for the ADC\noutput. Once the converter’s characterisation is taken into\naccount, the achieved FC should be the same as for the\nanalogue output voltage. It can be seen from the simulation\nresults above that the overall fault coverage for both tests is\n85.1% (51.28% WFC).\n4.2 Additional DC Test\nThe test program has to be expanded by the inclusion\nof a simple DC measurement that includes the HPF being\nenabled and the use of the second analogue input (in2,\nfig.1). This DC test has been designed so that the fault free\noutput voltage is at 2.0V, which is half way between the\nADC mid-rail voltage (1.5V) and the maximum of the\ninput range (0.5V - 2.5V). Fault coverage may be assessed\nby monitoring either the analogue output voltage or the\noutput pattern of the ADC. As shown in figure 5, the FC is\nimproved by 1.8% (WFC by 40%) approximately. The\nmajor increase in WFC originates from the detection of the\ncapacitor short in the HPF that has a relatively high\noccurrence due to its large area. However, 82 faults\nreported, affecting 2951 ppm, remain undetected. In the\nfollowing section, previously undetected faults will be\nclassified and analysed, DfT optimisations are presented\nfor each class of difficult to detect faults.\n4.3 Test Program Optimisation\nsel\nsel\npos1sel\n12kW\nin2\nin1\nR2\nR3\nbias\n200W\nR1\nbiasc4\n 2.5V\n12kW\nFigure 6: Input Multiplexer MUX\nSome faults cannot be detected by the tests presented\nabove:\n• Two faults (12 ppm) are not detected, as they affect\nnets which are used by cells not included in the AGC\ncircuitry. In the context of fault coverage they will be\nconsidered as detected externally.\n• Five faults (9 ppm) affect the digital part of OP1. As\nan exhaustive test will be run on the digital decoder,\nthese shorts will be detected during the digital test.\n• Two opens (18 ppm) at the resistors connecting the\nanalogue inputs to the mid-rail voltage (R2 and R3 in\nfigure 6) have not been detected. These faults can be\ndetected by measuring the voltage at the floating input\nin2 (in1) during the ramp (dc) test.\n0\n20\n40\n60\n80\n100\nCNT Vout Iana Idig all\nFC\/% WFC\/%\nFigure 4: Fault coverage - ramp stimulus\n85.10 86.86\n51.28\n58.17\n79.70\n91.24\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\nFC WFC\n% Ramp DC Combined\nFigure 5: Fault coverage for DC and ramp test\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 17, 2008 at 11:39 from IEEE Xplore.  Restrictions apply.\n4.4 DfT Layout Optimisation\nThe AGC design contains two resistor ladders, one in\nthe biasing cell and a second in the feedback network. The\nlayout structure is shown in figure 7a. Defect 1 causes a\nshort between resistors R2 and R3 but the fault is likely to\nbe undetectable. In the fault simulation, even defects such\nas defect number 2 will not be detected in all cases, while\ndefects 3 and 4 result in a parametric fault affecting R1,\nwhich has not been reported by VLASIC. It should be\nnoted that the VLASIC output will only list faults which\nresult in a changed netlist, thus parametric faults are\nexcluded. If the layout is improved, as proposed in figure\n7.b, spot defects can neither cause a short between resistors\nconnected to each other nor parametric faults that affect\nonly one resistor. For example defect 5 shorts R1 and R3\n(see figures 7.b and 7.c) which result in equal voltages at\nthe nodes fn1 and fn2. Defect 6 will cause the same\nvoltages at fn2 and fn3. If the resistor layout is changed in\nthis manner, all resistor shorts in the biasing cell will be\ndetected. Concerning the resistor ladder in the feedback\nnetwork, the AGC would have to be tested in all 32 gain\nsets. A DfT optimisation at the system level is proposed in\nsection 4.7, assuming that the improved layout has been\nimplemented. An initial DfT guideline can be developed:\nConcerning resistor layouts, adjacent polysilicon\n(diffusion) tracks should not belong to the same resistor to\nprevent parametric faults caused by extra resistive\nmaterial. Additionally, adjacent tracks should not belong\nto resistors connected to each other, as shorts affecting\nthese tracks are difficult to detect.\n4.5 DfT at Schematic Level to Detect Faults\nAffecting Cascode Transistors\nThe AGC design does not provide a stand-by mode to\nreduce the power consumption, this is however not the\ncase in the next generation designs. In figure 8, a section\nof the OP1 schematic is shown, including the most likely\nundetected faults (F1 to F7). One way to reduce the current\nconsumption from more than 1mA to less than 10 m A is, to\nswitch V(biasc2) to VSS. If a faulty circuit contains the\nshort F7, the fault will be detected by a current\nmeasurement on the AGC. Alternatively V(biasp) can be\nswitched to VDD and four faults can be detected in the\nsame way (F1 to F4). Switching V(biasn) to VSS would\nresult in a current consumption of less than 0.4mA. F5 and\nF6 could then be detected. It has to be mentioned that the\nAGC performance will not be affected, only 12 additional\ntransistors of minimum size have to be implemented to\nswitch three biasing voltages. The WFC increases\napproximately 3%, corresponding to 1036 ppm.\nFurthermore, similar faults will be detected in OP2, 568\nfaulty circuits out of one million can be classified as faulty,\nresulting in an increase of about 1.7% in the WFC. A DfT\nguideline can be formulated:\nThe current consumption and \/ or the output voltage has to\nbe made more sensitive in stand-by mode in order to detect\ndrain to source shorts at cascode transistors.\n(a)\n13\n4\n2\nfn4fn3fn2\nR4R3R2R1\nfn1midrail\npolysiliconmetal extra polysilicon\n(b) \n7\n5\n6\n fn2\nfn3\nfn1 R2R1\n mid rail\n fn2 connection, e.g. metal 2\nR4R3\nfn4\nmid\nrail fn1 fn2\nshort 7\nshort 6short 5\nfn3\nR4R3R2R1\nFigure 7: Present and improved layout of resistor\nladders F1 F3 F4F2\nF6F7F5 biasc2\nbiasc1\nneg1pos1\nbiasp biasp\nbiasnbiasn\nVSS\nVDD\nout1\nFigure 8: Section of OP1 schematic\n(c)\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 17, 2008 at 11:39 from IEEE Xplore.  Restrictions apply.\n4.6 DfT Optimisation at the Schematic Level to\nDetect Faults by Local Current Comparison\nSome shorts within the biasing cell (fig. 9) have not\nbeen detected. In the fault free case, the current in branch 6\n(I6) is 17.84 m A while the input current inbias is equal to\n17.55 m A. Most faults result in a significant change in I6.\nHowever, by measuring the current consumption of the\ncell, no faults will be detected due to the wide tolerances\nthat have to be assumed for analogue current\nmeasurements.51 A solution here is to compare inbias and\nI6 on chip. Four faults (878 ppm) can be detected using this\ntechnique as in the fault free case, I6  is significantly larger\nthan inbias. A similar design for current testability\napproach is presented in52 where an on-chip current\ngeneration avoids global process variations and only\nrelative ones must be accounted for. Future research will\neither utilise existing on-chip techniques53 or develop\nalternative solutions for the implementation of built-in\n(programmable) local current comparators to provide a\npass-fail output or diagnostic output.\nIinbias\nVDD\nI6\nVSS\nVBIASP\nM5M4\nM3M2M1\n65\n1\nFigure 9: Section of biasing cell schematic\n4.7 DfT Optimisation at the System Level\nAs mentioned above, the primary test problem for the\nAGC is the need to test in all gain steps. An alternative test\nprogram can be generated which checks the feedback\nnetwork implemented as discussed in section 4.4. If this\npart of the circuit can be proven fault free, the AGC needs\nonly to be tested in three gain sets (see sections 4.1 and\n4.2). Figure 10 shows the feedback network including the\nadditional devices in the shaded area. Additionally the\ndigital decoder has to be reconfigured in test mode in such\na manner, that the original 32-bit code D (see figure 1) is\nchanged to a new 32-bit code:\n( )e d d testi i i= + ×+1 for  i = 1 32, ... ,  (2)\nIn operational mode (test=0), E is equal to D. In test mode\n(test=1), E is a 32 bit code containing a walking pair of\nbits (as illustrated in table 2). By initiating this sequence in\nthe digital control loop that feeds the decoder, the\ncomparator (COMP in fig.10) will check if the voltages\nv(fn1) up to v(fn32) are in a decreasing (or increasing)\norder. This test can be run in parallel with the stand-by\nmode test for faults in OP1, as its output can be driven to\nVDD or VSS. Future work will examine the use of the sw-\nopamp design13,19 as the structure of OP1 and OP2 is\ncompatible with this approach.\npass\n\/failCOMP\n1\ntest\ne32\ne31\ne30\ne3\nR31\nR30\nR2\nR1\nfn32\nfn31\nfn3\nfn2\nfn1\ne2\ne1\nHP\nOP1\nFigure 10: Testing of the feedback network\nS d32 d31 d4 d3 d2 d1 e32 e31 e30 e4 e3 e2 e1 COMP\n00000 0 0 0 0 0 0 1 0 0 0 0 0 0 0 1\n00001 0 0 0 0 0 1 0 0 0 0 0 0 0 1 1 v(R1)\n00010 0 0 0 0 1 0 0 0 0 0 0 0 1 1 0 v(R2)\n00011 0 0 0 1 0 0 0 0 0 0 0 1 1 0 0 v(R3)\n11110 0 1 0 0 0 0 0 0 1 1 0 0 0 0 0 v(R30)\n11111 1 0 0 0 0 0 0 1 1 0 0 0 0 0 0 v(R31)\nTable 2: Reconfiguration of digital converter\n4.8 Resulting Fault Coverage\nSeveral testability optimisations have been proposed\nin the previous sections. In addition to two shorts (46ppm)\nin the biasing cell, the following faults remain undetected:\n• One open (1 ppm) in OP1 and two shorts (147 ppm)\ninside current mirrors of OP2 are not detected.\n• One fault (10 ppm) shorts the ESD protection resistor\n(R1 in figure 6) at the output of the biasing cell. As its\nvalue is much smaller than R2 and R3, the short cannot be\ndetected by testing the analogue part of the AGC.\nThe maximum FC and WFC achievable by the DfT\noptimisation is 99.04% and 99.39% respectively. In figure\n11 the fault coverage for the complete test program of the\nDfT optimised AGC circuit is shown. This includes the\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 17, 2008 at 11:39 from IEEE Xplore.  Restrictions apply.\nramp test, DC test, the stand-by mode of both opamps,\ncurrent comparison for the biasing cell, feedback network\ntest, digital test, gain measurement, and the measurement\nof the floating analogue inputs.\n51.3\n85.1\n40.0\n1.76\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\nFC WFC\n%\n40.0\n1.76\n4.76\n3.69\n6.09\n0.64\n0.64\n2.61\n0.15\n1.76\n85\n90\n95\n100\nFC WFC\n%\nRamp test (sec. 4.1) DfT system (sec. 4.4 & 4.7)\nDC test (sec.4.2) DfT biasing cell (sec. 4.6)\nDfT schematic (sec. 4.5) test program (sec. 4.3)\n16701\n3045\n1392\n1171\n264 211\n0\n1000\n2000\n3000\n4000\nFDL\/ppm\nRamp test\nDC test\nDfT schematic\nDfT system\nDfT biasing\nTest program\nFigure 11: Fault coverage increase due to DfT\noptimisations\n5 Conclusions\nIn this paper a comprehensive DfT study on a\ncommercial AGC design has been presented. The\ntestability analysis process has been based on fault\nsimulation against layout extracted faults and has lead to a\nnumber of DfT modification proposals at the layout,\nschematic and system level. Generic guidelines drawn in\nthis paper are applicable to the majority of other analogue\nand mixed signal design and can be taken into account\nbefore layout generation. Thus difficult to detect faults can\nbe prevented or the faulty behaviour of the circuit will be\neasier to detect.\nTo improve testability, a number of new test strategies\nhave been proposed including a ramp stimulus test, as IDDQ\ntest and a DC measurement. DfT modifications to support\nthe ramp test include additional digital circuitry to\nreconfigure present digital cells to count rising or falling\nedges. Additional structures need to be implemented to\nmodify the 32-bit converter output pattern in test mode and\nto support current testing.\nIn addition, an important layout modification has\nbeen proposed to reduce the probability of difficult to detect\nparametric faults. These modification allow test time to be\nreduced by minimising the number of gain sets the circuit\nmust be tested in and boosts fault coverage to over 99%.\nFuture work on the AGC will target parametric faults\nand faults affecting the surrounding circuitry. In addition,\ntest time and test cost need to be estimated. The\nimplementation of an on-chip test stimulus generator and\non-chip programmable local current comparator will\naddress the realisation of BIST for a large number of\ntypical mixed signal systems. For this purpose, further DfT\nguidelines will be generated from additional studies on a\nsub-set of typical analogue macros. The time to invest in\nthese new DfT studies can be reduced significantly taking\nthe experience and results of this work into account.\n6. Acknowledgements\nThis work has been supported by both the EPSRC\nTEMSA project (GR\/K32692) and partially by Hannover\n& Lancaster Universities undergraduate programs. The\nauthors would also like to thank Mark Zwolinski and\nAndrew Perkins from the University of Southampton for\ntheir collaboration.\n7. References\n                                                       \n1\n P. Camurati & P. Prinetto: Correct Hardware Design\nMethodologies: Design for Verifiability vs. Design for\nTestability: limiting designers’ freedom to achieve what?\nElsevier Science Publisher pp. 295-309, 1992.\n1 Prevent difficult to detect shorts between resistors\nconnected to each other. Adjacent resistive tracks\nshould not belong to resistors connected to each\nother (sec. 4.4)\n2 Realise stand-by mode by switching gate potentials\nof cascode transistors to the power supply in order\nto detect faults affecting cascode transistors (sec.\n4.5)\n3 Reduce demands on ATE (on-chip test support), pre-\nprocess test response on-chip through re- use of\nexisting mixed signal and digital structures (sec. 4.1)\n4 Run simple separate test in reconfigurable\nstructures,\nsuch as the AGC feedback network (sec. 4.7)\n5 Reduce redundancies\nTable 2: Summary of DfT issues identified\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 17, 2008 at 11:39 from IEEE Xplore.  Restrictions apply.\n                                                                                            \n2\n Various papers: Special Issue on Partial Scan Methods,\nJournal of Electronic Testing: Theory and Applications, vol.\n7, Aug.\/Oct. 1995.\n3\n C. Mauder & R. Tulloss: The Test Access Port and Boundary\nScan Architecture, IEEE Computer Society Press Tutorial,\n1990.\n4\n A. Grochowski, D. Bhattacharya, T.R. Viswanathan & K.\nLaker: Integrated Circuit Testing, IEEE Trans. on Circuits\nand Systems II: Analog and Digital Signal Processing, vol.\n44, no. 8, pp. 610-633, 1997.\n5\n K. Baker, A.M Richardson & A.P. Dorey: Mixed signal test -\ntechniques, applications and demands, IEE Proc.-Circuits\nDevices Systems, vol. 143, no. 6, Dec. 1996.\n6\n F.G.M. de Jong: Analogue system testability: an industrial\nperspective, AMATIST, ESPRIT Open Workshop\nProceedings, Twente, May 1997.\n7\n S. Sunter: Mixed-Signal BIST - Does Industry Need it?, Proc.\n3rd IEEE International Mixed Signal Workshop, Tutorial 2,\nSeattle, June 1997.\n8\n C.-J. Wang & C.-L. Wey: Efficient Testability Design\nMethodologies for Analog\/Mixed-Signal Integrated Circuits,\n3rd Int. Mixed Signal Testing Workshop, Seattle, pp. 68-74,\nJune 1997.\n9\n Olbrich, T., Mozuelos, R., Richardson, A.M. & Bracho, S.\n\"Design-for-Test of a Current Mode Digital to Analogue\nConverter.\" IEE Circuits, Devices and Systems, vol 143, no.\n6, pp374-379, Dec 1996 special issue, mixed signal test.\n10\n M. Soma: A Design-For-Test Methodology for Active Analog\nFilters, IEEE Proc. International Test Conference, pp. 183-\n192, 1990.\n11\n M. Soma & V. Kolarik: A Design-for-Test Technique for\nSwitched-Capacitors Filters, IEEE European Design & Test\nConference, pp. 42-47, Paris, March 1994.\n12\n F. Novak, I. Mozetic, M. Santo-Zarnik & A. Biasizzo:\nEnhancing Design-for-Test for Active Analog Filters by\nUsing CLR(R), Analog Integrated Circuits and Signal\nProcessing, vol. 4, pp. 215-229, 1993.\n13\n D. Vazquez, A. Rueda, J. L. Huertas & E. Peralias: Unified\noff- and on-line testing in analogue circuits: concept and\npractical demonstrator, Proc. 3rd IEEE International Mixed\nSignal Workshop, Seattle, pp. 169-174, June 1997.\n14\n B. Atzema & T. Zwemstra: Expoiting Analogue IFA to\nImprove Specification Based Tests, Proc. European Design &\nTest Conference, pp. 542-546, March 1996.\n15\n R. Ramadoss, M. L. Bushnell: Flash A\/D Converters - Design\nfor Testability, Proc. 3rd IEEE International Mixed Signal\nWorkshop, Seattle, pp. 62-67, June 1997.\n16\n S. Sunter: Cost\/benefit analysis of the P1149.4 mixed-signal\ntest bus, IEE Proc. Circuits Devices Systems, vol. 143, no. 6,\npp. 393-398, 1996.\n17\n B. R. Wilkins, S. Oresjo & B. S. Suparjo: Towards a Mixed-\nSignal Testability Bus Standard P1149.4, Proc. IEEE\nEuropean Design & Test Conference, pp. 58-65, March 1993.\n18\n R. Harjani & B. Vinnakota: Analogue Circuit Observer\nBlocks, IEEE Trans. on Circuits and Systems-II, vol. 44, no.\n2, pp. 154-163, 1997.\n19\n Bratt, A.H., Richardson, A.M., Harvey, R.J. & Dorey, A.P.\n\"A Design-for-test Structure for Optimising Analogue and\nMixed Signal IC Test.”  European Design and Test\nConference, pp. 24-34, Paris, March 6th-9th 1995.\n                                                                                            \n20\n M. Lubaszewski, S. Mir & B. Courtois: Self-Testing and\nSelf-Checking Analogue Integrated Circuits, AMATIST,\nESPRIT Open Workshop Proceedings, Twente, May 1997.\n21\n S. Mir, M. Lubaszewski & B. Courtois: Unified Built-In Self-\nTest For Fully Differential Analogue Circuits, Journal of\nElectronic Testing: Theory and Applications, vol. 9, no. 1-2,\npp. 135-151, 1996.\n22\n M. Slamani, B. Kaminska & G. Quesnal: An Integrated\nApproach for Analog Circuit Testing with a Minimum\nNumber of Detected Parameters, IEEE Proc. International\nTest Conference, pp. 631-640, 1994.\n23\n C.-L Wey: Built-In Self-Test (BIST) Structure for Analog\nCircuit Fault Diagnosis, IEEE Trans. on Instrumentation and\nMeasurement, vol. 39, no. 3, pp. 517-521, 1990.\n24\n C.-L. Wey & S. Krishnan: Built-In Self-Test (BIST)\nStructures for Analogue Circuit Fault Diagnosis with Current\nTest Data, IEEE Trans. on Instrumentation and Measurement,\nvol. 41, no. 4,  pp. 535-539, 1992.\n25\n L. T. Wurtz: Built-In Self Test Structure for Mixed-Mode\nCircuits, IEEE Trans. on Instrumentation and Measurement,\nvol. 42, no. 1, pp. 25-29, 1993.\n26\n M. J. Ohletz: Hybrid Built in Self-Test (HBIST) for mixed\nanalogue\/digital ICs', Proc. European Design & Test\nConference, pp. 307-16, 1991.\n27\n M. F. Toner & G. W. Roberts: A BIST Scheme for an SNR\nTest of a Sigma-Delta ADC, IEEE Proc. International Test\nConference, pp. 805-814, 1993.\n28\n M. F. Toner & G. W. Roberts: A BIST Scheme for a SNR,\nGain Tracking, and Frequency Response Test of a Sigma-\nDelta ADC, IEEE Trans. on Circuits and Systems-II, vol. 42,\nno. 1, pp. 1-15, 1995.\n29\n M. F. Toner & G. W. Roberts: A Frequency Response,\nHarmonic Distortion Test for BIST of a Sigma-Delta ADC,\nIEEE Trans. on Circuits and Systems-II, vol. 43, no. 8,  pp.\n608-613, 1996.\n30\n E. Teraoka, T. Kengaku, I. Yasui, K. Ishikawa, T. Matsuo, H.\nWakada, N. Sakashita, Y. Shimazu & T. Tokada: A Built-In\nSelf-Test for ADC and DAC in a Single Chip Speech\nCODEC, IEEE Proc. International Test Conference, 791-796,\n1993.\n31\n K. Arabi & B. Kaminska: Oscillation Built-In Self Test\n(OBIST) Scheme for Functional and Structural Testing of\nAnalog and Mixed-Signal Integrated Circuits, Proc.\nInternational Test Conference, paper 31.4, pp786-796, Nov\n1st-6th, Washigton DC, 1997.\n32\n S. Sunter & N. Nagi: A Simplified Polynominal-Fitting\nAlgorithm for DAC and ADC BIST, Proc. International Test\nConference 1997, pp389-395.\n33\n F.C.M Kuijstermans M. Sachdev & A.P. Thijssen: Defect-\nOriented Test Methodology for Complex Mixed-Signal\nCircuits, Proc. of European Design and Test Conference,\nParis, March 1995 pp. 18-23.\n34\n M. Sachdev: A Realistic Defect Oriented Testability\nMethodology For Analogue Circuits, Journal of Electronic\nTesting: Theory and Applications, vol. 6, no. 3, pp. 265-276,\n1995.\n35\n M. Soma: Fault Coverage of DC Parametric Tests for\nEmbedded Analog Amplifiers, International Test Conference\n1993 pp. 566-571.\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 17, 2008 at 11:39 from IEEE Xplore.  Restrictions apply.\n                                                                                            \n36\n M. Sachdev & B. Atzema: Industrial Relevance of Analogue\nIFA: A Fact or a Fiction, IEEE Proc. International Test\nConference, pp. 61-70, 1995.\n37\n H. Walker & S. W. Director: VLASIC: A Catastrophic Fault\nYield Simulator for Integrated Circuits, IEEE Trans. on\nComputer-Aided Design, vol. CAD-5, no. 4, pp. 541-556,\n1986.\n38\n Olbrich, T., Grout, I., Eben Aimine, Y., Richardson, A.M. &\nContensou, J. \"IC Product Quality Estimation through IFA\nbased Fault Simulation.\" European Design and Test\nConference, Paris, pp.573-580, March 17th-20th, 1997.\n39\n R.J.A. Harvey, A.M.D. Richardson, E.M.F.G. Bruls, K.\nBaker: Analogue Fault Simulation Based On Layout\nDependent Fault Models, Proc.  International Test\nConference, 1994, pp. 641-649.\n40\n J.A. Prieto, A. Ruenda, I. Grout, E. Peralias, J.L. Huertas &\nA.M Richardson: Towards Realistic Faults Prediction And\nLayout Design For Testability In Analogue Circuits, Proc. 3rd\nIEEE International Mixed Signal Workshop, Seattle, pp. 75-\n80, June 1997.\n41\n M.J. Ohletz: L2RFM - Local Layout Realistic Faults Mapping\nScheme for Analogue Integrated Circuits, Custom Integrated\nCircuits Conference, pp. 475-478, May 1996.\n42\n E. A. Amerasekera & D. S. Campbell: Failure Mechanisms in\nSemiconductor Devices, 2nd edition, John Wiley & Sons,\nNew York, 1996.\n43\n Ping-Chung Li & Tak K. Young: Electromigration: the time\nbomb in deep-submicron ICs, IEEE Spectrum, September, pp.\n75-78, 1996.\n44\n R. Rodrígues-Montanés, J. A. Seguera, V. H. Champac, J.\nFigueras & J. A. Rubio: Current VS. Logic Testing of Gate\nOxide Short, Floating Gate and Bridging Failures in CMOS,\nIEEE Proc. International Test Conference, pp. 510-19, 1991.\n45\n R. Rodríguez, E. M. J. G. Bruls & J. Figueras: Bridging\nDefects Resistance Measurements in a CMOS Process, IEEE\nProc. International Test Conference, pp. 892-899, 1992.\n46\n M. Renovell & G. Cambon: Electrical Analysis and Modeling\nof Floating-Gate Fault, IEEE Trans. on Computer-Aided\nDesign, vol. 11, no. 11, pp. 1450-58, 1992.\n47\n V. H. Champac, A. Rubio & J. Figueras: Electrical Model of\nthe Floating Gate Defect in CMOS IC's: Implications on IDDQ\nTesting, IEEE Trans. on Computer Aided Design of\nIntegrated Circuits and Systems, vol. 13, no. 3, pp. 359-369,\n1994.\n48\n Johnson S, “Residual charge on the faulty floating gate MOS\ntransistor”, International Test Conference, October 1994, pp\n555-561.\n49\n M. J. Ohletz: Reaistic Faults Mapping Scheme for the Fault\nSimulation of Integrated Analogue CMOS Circuits, IEEE\nProc. International Test Conference, pp. 776-785, 1996.\n50\n C. Sebeke, J. P. Teixeira & M. J. Ohletz: Automatic Fault\nExtraction and Simulation of Layout Realistic Faults for\nIntegrated Analogue Circuits, Proc. European Design & Test\nConference, 1995.\n51\n Bratt, A.H., Harvey, R.J., Dorey, A.P. & Richardson, A.M.\n\"Aspects of Current Reference Generation and Distribution\nfor IDDx Pass\/Fail Current Determination.\" IEE colloquium\non Mixed Signal VLSI Test, London 13th Dec 1993. Digest\nno 1993\/240, pp. 3\/1-3\/8.\n52\n I.Baturne, J.L. Huertas, S. Sanchez-Solano & A.M\nRichardson: Supply Current Monitoring for Testing CMOS\n                                                                                            \nAnalogue Circuits, National Congress on ICs Design\n(DCIS96), Barcelona, Nov. 1996.\n53\n J.P.M van Lammeren: ICCQ: A Test Method for Analogue\nVLSI Based on Current Monitoring, pp24-28, IEEE\nIntenational Workshop on IDDQ Testing, Washigton DC, Nov\n5th-6th 1997.\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on December 17, 2008 at 11:39 from IEEE Xplore.  Restrictions apply.\n"}