{"doi":"10.1103\/PhysRevB.73.241301","coreId":"100763","oai":"oai:epubs.surrey.ac.uk:158","identifiers":["oai:epubs.surrey.ac.uk:158","10.1103\/PhysRevB.73.241301"],"title":"Dependence of Exciton Energy on Dot Size in GaN\/AlN Quantum Dots","authors":["Williams, D P","Andreev, A D","O'Reilly, E P"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-01-01","abstract":"<p>Using previously derived analytical expressions for the polarization field in nitride quantum dots (QDs), we show that the potential in the growth direction can be approximated as linear in such dots, and that the slope of this linear potential depends only on the aspect ratio (height\/radius) of the dot. We demonstrate how the large polarization field leads to a linear dependence of the exciton energy on dot size, provided the aspect ratio of the dot is conserved while the size is varied. We also present a useful analytical approximation for the electron and hole wave functions in nitride QDs in terms of Airy functions, which compares well with the solutions of a numerical computation. We note that the disagreement concerning the sign of the shear piezoelectric coefficient e(15) leads to a significant uncertainty in the calculated potential.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:158<\/identifier><datestamp>\n      2017-10-31T13:57:01Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/158\/<\/dc:relation><dc:title>\n        Dependence of Exciton Energy on Dot Size in GaN\/AlN Quantum Dots<\/dc:title><dc:creator>\n        Williams, D P<\/dc:creator><dc:creator>\n        Andreev, A D<\/dc:creator><dc:creator>\n        O'Reilly, E P<\/dc:creator><dc:description>\n        <p>Using previously derived analytical expressions for the polarization field in nitride quantum dots (QDs), we show that the potential in the growth direction can be approximated as linear in such dots, and that the slope of this linear potential depends only on the aspect ratio (height\/radius) of the dot. We demonstrate how the large polarization field leads to a linear dependence of the exciton energy on dot size, provided the aspect ratio of the dot is conserved while the size is varied. We also present a useful analytical approximation for the electron and hole wave functions in nitride QDs in terms of Airy functions, which compares well with the solutions of a numerical computation. We note that the disagreement concerning the sign of the shear piezoelectric coefficient e(15) leads to a significant uncertainty in the calculated potential.<\/p><\/dc:description><dc:date>\n        2006-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/158\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Williams, D P, Andreev, A D and O'Reilly, E P  (2006) Dependence of Exciton Energy on Dot Size in GaN\/AlN Quantum Dots   Physical Review B, 73 (24).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevB.73.241301<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/158\/","10.1103\/PhysRevB.73.241301"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Dependence of exciton energy on dot size in GaN\/AlN quantum dots\nD. P. Williams,1,* A. D. Andreev,2 and E. P. O’Reilly1\n1Tyndall National Institute, Lee Maltings, Cork, Ireland\n2Advanced Technology Institute, University of Surrey, Guildford GU2 7XH, United Kingdom\n\u0001Received 27 January 2006; revised manuscript received 7 April 2006; published 6 June 2006\u0002\nUsing previously derived analytical expressions for the polarization field in nitride quantum dots \u0001QDs\u0002, we\nshow that the potential in the growth direction can be approximated as linear in such dots, and that the slope\nof this linear potential depends only on the aspect ratio \u0001height\/radius\u0002 of the dot. We demonstrate how the\nlarge polarization field leads to a linear dependence of the exciton energy on dot size, provided the aspect ratio\nof the dot is conserved while the size is varied. We also present a useful analytical approximation for the\nelectron and hole wave functions in nitride QDs in terms of Airy functions, which compares well with the\nsolutions of a numerical computation. We note that the disagreement concerning the sign of the shear piezo-\nelectric coefficient e15 leads to a significant uncertainty in the calculated potential.\nDOI: 10.1103\/PhysRevB.73.241301 PACS number\u0001s\u0002: 73.21.La, 77.65.Ly\nQuantum dot \u0001QD\u0002 structures are currently of great inter-\nest due to their advantages over quantum wells and wires, in\nthat they confine charge in all three dimensions, promising\nmore efficient lasers and optical amplifiers as well as pos-\nsible applications for memory storage and quantum comput-\ning. Nitride-based QDs are of particular interest, since the\nlarge built-in electric fields in these structures means they\ncan be potentially engineered to emit anywhere from the in-\nfrared to the ultraviolet simply by varying the dot size and\ncomposition. These large fields arise from both the sponta-\nneous polarization present in the wurtzite crystal structure of\nthe nitrides, and the strain-induced polarization associated\nwith the large piezoelectric constants and lattice mismatch of\nthe materials. Previous investigations on arsenide-based sys-\ntems, which do not exhibit these large fields, have revealed a\nrather complex dependence of the ground-state exciton emis-\nsion energy on dot size.1–3 In contrast, the large built-in fields\nin nitride QDs dominate the behaviour of confined electrons\nand holes, resulting in a near-linear dependence of exciton\nenergy on dot size.4 In this paper, we use a simple analytical\nmodel together with our previously derived expressions for\nthe polarization potential to demonstrate explicitly that the\nsource of this dependence is the built-in electric field along\nthe growth \u0001z\u0002 axis. We will show that the polarization field\nalong the dot axis is approximately constant, and this leads to\na linear variation of the exciton recombination energy with\ndot size, provided the aspect ratio is conserved as the dot size\nis varied. In addition, we present an approximate solution for\nthe electron and hole wave functions in the z direction in-\nvolving Airy functions, which gives energies and wave func-\ntions very close to those of a full numerical simulation. This\nallows the estimation of electron-hole overlap, which is im-\nportant for quantities such as exciton lifetime and oscillator\nstrength.\nOur previous work5,6 on built-in polarization fields in ni-\ntride QDs has shown that the field in the z direction \u0003which\nwe take to be the \u00010001\u0002 growth direction\u0004 has the most\nsignificant effect on the confinement potential, reaching\n6–8 MV\/cm in GaN\/AlN QDs, with the in-plane field of\n\u00051 MV\/cm providing additional lateral confinement. We\ntherefore begin our approximation by separating the potential\ninto a radial part and an axial \u0001z direction\u0002 part. First, the\nradial polarization potential is approximated by a harmonic\noscillator potential 12kr2, with the value of k given by the\nsecond derivative with respect to x of the potential evaluated\nat r=0, \u0001x\n2\u0001\u0001z\u0002, for which we have previously derived ana-\nlytical expressions.6 It remains to decide at what value of z\nthis should be evaluated—this will be discussed later. In the\ncase of a cylindrical dot, this approximation is usually accu-\nrate to within 1% out to about half the radius of the dot, in\nthe range of realistic dot dimensions. However, for very\nsmall dots and dots with very large aspect ratios the potential\nstep at the interface between the materials becomes increas-\ningly important and the lateral potential begins to take on a\nquantum well nature. The approximation is also reasonably\naccurate for truncated cone dots as long as the side angle of\nthe dot is not too small and the dot does not get too narrow\nnear the top. This approach then gives a lateral confinement\nenergy of\nEr = \u0002\u0006 k\nm*\n\u00011\u0002\nwhere m* is the effective mass of the carrier being consid-\nered \u0001electron or hole\u0002.\nFor the axial part, the potential along the central z axis of\na cylindrical QD with radius R and height h with its base\ncentered on the origin is given by6\n\u0001\u0001z\u0002 = JI1 + \u0007K + PQD − PM4\u0003\u0004r\u00040 \bI2 \u00012\u0002\nwhere\nI1 = 2\u0003\u0007 z2\u0006R2 + z2 − z sgn\u0001z\u0002 − \u0001z − h\u0002\n2\n\u0006R2 + \u0001z − h\u00022\n+ \u0001z − h\u0002sgn\u0001z − h\u0002\b , \u00013\u0002\nPHYSICAL REVIEW B 73, 241301\u0001R\u0002 \u00012006\u0002\nRAPID COMMUNICATIONS\n1098-0121\/2006\/73\u000124\u0002\/241301\u00014\u0002 ©2006 The American Physical Society241301-1\nI2 = 2\u0003\u0003− \u0006R2 + z2 + z sgn\u0001z\u0002 + \u0006R2 + \u0001z − h\u00022\n− \u0001z − h\u0002sgn\u0001z − h\u0002\u0004 . \u00014\u0002\nPQD and PM are the spontaneous polarization constants of\nthe QD and matrix materials, respectively, \u0004r is the relative\npermittivity of the QD material, and J and K are constants\ngiven by\nJ =\n− \u00050\u00011 + \u0006\u0002\u00012e15 − e33 + e31\u0002\n8\u0003\u0004r\u00040\u00011 − \u0006\u0002\n,\nK =\n\u00050\n8\u0003\u0004r\u00040\n\u00074e31 + 2e33 − 1 + \u00061 − \u0006 \u00012e15 + e31 + e33\u0002\b\nwhere \u00050 is the isotropic misfit strain, \u0006 is Poisson’s ratio,\nand eij are the piezoelectric constants. A number of assump-\ntions were made in the derivation of these expressions, in-\ncluding isotropic elastic constants and the same elastic, pi-\nezoelectric, and dielectric constants in both materials; see\nRef. 6 for a full discussion.\nWe use the above expressions to calculate the variation of\nthe conduction and valence band energy along the z axis, as\nshown in Fig. 1 \u0001solid line\u0002. For convenience, we do not\nconsider a wetting layer. However, this can be easily in-\ncluded if required and does not change our overall conclu-\nsions. In order to obtain an analytical expression for the axial\nconfinement energy Ez, we approximate the calculated poten-\ntial by a triangular well with one finite potential step \u0001dashed\nline in Fig. 1\u0002, which we can then solve analytically. To\nobtain the slope of this approximate potential, we make a\nseries expansion of Eqs. \u00013\u0002 and \u00014\u0002 in z about the point z\n=h \/2 and take only the linear terms, which gives\nI1 \t 4\u0003\u0007z − h2\b\u0007− 1 + 2f\u00064 + f2 − f\n3\n\u00014 + f2\u00023\/2\b , \u00015\u0002\nI2 \t 4\u0003\u0007z − h2\b\u00071 − f\u00064 + f2\b , \u00016\u0002\nwhere f =h \/R is the ratio of the dot height to radius. The\nslope F of the potential can then be obtained using the ex-\npressions \u00012\u0002, \u00015\u0002, and \u00016\u0002. It is important to note that the size\nof the dot can be varied without changing F, provided the\naspect ratio f is conserved. The validity of this linear ap-\nproximation of the potential for a cylindrical dot can be\ngauged from the maximum error, which occurs at z=0 and\nz=h. With the material parameters from Ref. 7 and taking\n\u0004r=9.6, this error is less than 1% for f\u00070.45, increasing to\n3.5% at f =0.7. In the case of truncated cone QDs, expres-\nsions similar to \u00013\u0002 and \u00014\u0002, but more complicated, can be\nused to obtain the equivalent expression for F.6 Alternatively,\na cylindrical dot with the same height and volume as the\ntruncated cone can be used to give a reasonable estimate for\nF.\nWe note also that there is a large degree of uncertainty in\nmany of the material parameters for the nitrides, and the\nchoice of parameters can have a significant effect on the\npotential obtained. This is particularly noticeable in the case\nof quantum dots, since the expressions for a QD involve e15,\nwhile those for a quantum well do not.8 There is conflicting\nevidence not only for the magnitude of e15, but also for its\nsign, with Refs. 9 and 10 deriving a positive sign while Refs.\n11 and 12 derive a negative sign. In this paper we use the\nparameters from Ref. 7, which give a positive value of e15. In\nprevious work5,13 we have used a different set of parameters\nwith a negative e15, which give a significantly smaller poten-\ntial variation than that calculated here, mostly due to the\nchange in sign of e15. If we expand I1 and I2 in a power\nseries in f and then retain terms up to linear in f , the contri-\nbution \u000115\u0001z\u0002 due to the terms involving e15 is given by\n\u000115\u0001z\u0002 =\n\u00050z\n2\u0004r\u00040\n1 + \u0006\n1 − \u0006\ne15f . \u00017\u0002\nThis term is zero in a quantum well \u0001f =0\u0002 but starts to make\na significant contribution in a QD. Values of e15 in the litera-\nture range from e15=−0.48 to e15= +0.35C\/m2, leading to a\ndifference in potential drop of 8.6% for the dots that we\nconsider here with f =0.38. This emphasizes the need for\nfurther measurement and analysis to develop a reliable set of\nmaterial parameters for the nitrides.\nThe Schrödinger equation for the triangular well potential\nin Fig. 1 can be solved exactly in terms of the Airy function\nAi\u0001x\u0002, giving\n\b\u0001z\u0002 = N\t \nexp\u0001\u0006\n\u0006V − Ezz\u0002 , z\u0007 0,CAi\u000b\u0007 \n\ne2F2\b\n1\/3\n\u0001eFz − Ez\u0002\f , z\u000b 0, \r \u00018\u0002\nwhere\nFIG. 1. \u0001Color online\u0002 Conduction and valence band edges\nthrough the center of a GaN\/AlN cylindrical QD with radius\n10.5 nm and height 4 nm. Solid line, numerically calculated band\nedges. Dashed line, approximate band edges using a linear polar-\nization potential and a single finite potential step. Material param-\neters taken from Ref. 7.\nWILLIAMS, ANDREEV, AND O’REILLY PHYSICAL REVIEW B 73, 241301\u0001R\u0002 \u00012006\u0002\nRAPID COMMUNICATIONS\n241301-2\nC = \u000eAi\u000b− \u0007 \n\ne2F2\b\n1\/3\nEz\f\u000f−1 \u00019\u0002\n\n=2m* \/\u00022, V is the band offset, and N is a normalization\nconstant. \u0001This is the hole wave function; for the electron,\nthe potential is inverted, so z→h−z.\u0002 The energy Ez is ob-\ntained from the boundary conditions, which yield the expres-\nsion\nAi\u0007− \n1\/3Ez\n\u0001eF\u00022\/3\b = \u0001eF\u0002\n1\/3\n\n1\/6\u0006V − Ez\nAi\u0001\u0007− \n1\/3Ez\n\u0001eF\u00022\/3\b . \u000110\u0002\nThis must be solved numerically to get Ez. However, it can\nbe seen from Eq. \u000110\u0002 that the dependence of the energy on\ndot size enters only through the slope F of the potential.\nHence, if F is constant, then Ez is also constant, and so, from\nthe analysis in the previous section, Ez does not change when\nthe height is varied, provided the height to radius ratio f\nremains constant.\nWe are now able to determine the value of k for the radial\npotential by taking \u0001x\n2\u0001\u0001z\u0002 at the position at which the Airy\nfunction solution attains its maximum value, i.e., at\nz =\nEz\neF\n+\nA0\u0001\n\u0001\neF\u00021\/3\n\u000111\u0002\nwhere A0\u0001=−1.018 793 is the first root of Ai\u0001\u0001x\u0002. A linear\nexpansion of k shows that, at fixed f , k has a 1\/R2 depen-\ndence, meaning that the lateral confinement energy Er will\nvary approximately as 1\/R for fixed f . However, the axial\nconfinement energy Ez is typically 1–2 orders of magnitude\nlarger than Er, so this dependence on R will be almost unno-\nticeable in the total exciton energy.\nNow, the ground-state exciton energy X0 is given by\nX0 = Eg\nQD + Ez\ne + Ez\nh + Er\ne + Er\nh + Jeh − eFh \u000112\u0002\nwhere Eg\nQD is the band gap of the QD material, Jeh is the\nCoulomb interaction energy, and the label e \u0001h\u0002 refers to the\nelectron \u0001hole\u0002. Jeh is also about 1–2 orders of magnitude\nsmaller than Ez, so Jeh, Er\ne\n, and Er\nh are of minor significance\nfor the general trends discussed here. With this in mind, it\ncan be seen that the exciton energy X0 decreases linearly\nwith dot height h for a fixed height to radius ratio \u0003Fig. 2\u0001a\u0002,\ndashed line\u0004, and the slope of this dependence is simply the\nslope of the polarization field times the electronic charge, eF.\nStudies by Adelmann et al.14 have shown that GaN\/AlN dots\ntend to conserve the ratio of height to radius as they grow,\nwhich explains why this linear dependence is seen in experi-\nments where no deliberate effort has been made to obtain a\nuniform aspect ratio of the dots.4\nThe solution of the Airy function approximation compares\nwell with the solution of a numerical finite-difference model\nusing a one-band effective mass approximation and the full\nexpression for the potential \u0003solid line in Fig. 2\u0001a\u0002\u0004, overes-\ntimating the energy by about 0.1 eV. The wave functions\nalso show good agreement \u0001Fig. 3\u0002, making the approxima-\ntion suitable for estimating quantities such as oscillator\nstrength and Coulomb interaction energies.\nWe can obtain an analytical expression for the energy if\nwe make the further approximation V→\f, i.e., an infinite\nbarrier. This gives\nEz =\n− A0\u0001eF\u00022\/3\n\n1\/3\n\u000113\u0002\nwhere A0=−2.338 11 is the first root of Ai\u0001x\u0002. This can be\nregarded as an upper bound for Ez. However, the wave func-\ntions are now a poor approximation since the infinite barrier\nforces the wave functions to be zero outside the dot, whereas\nin reality a significant portion of the wave function is non-\nzero outside the dot, as can be seen from Fig. 3. Similarly,\nwe could improve the initial approximation by including a\nsecond finite potential step at the other side of the QD. A\nsolution for this potential can also be found, but this now\ninvolves both Airy functions Ai\u0001x\u0002 and Bi\u0001x\u0002, and the equa-\ntion for the energy is more complex than Eq. \u000110\u0002. Since the\nimprovement in the accuracy of the energies and wave func-\nFIG. 2. \u0001Color online\u0002 \u0001a\u0002 Exciton energies as a function of dot\nheight for cylindrical dots with f =0.38. Solid line, numerical cal-\nculation; dashed line, Airy function model. \u0001b\u0002 Squared overlap of\nthe electron and hole wave functions in each dot.\nFIG. 3. \u0001Color online\u0002 Hole \u0001left\u0002 and electron \u0001right\u0002 wave\nfunctions for the same 4-nm-high QD as Fig. 1. Solid lines, numeri-\ncal calculation; dashed lines: Airy function wave functions.\nDEPENDENCE OF EXCITON ENERGY ON DOT SIZE IN¼ PHYSICAL REVIEW B 73, 241301\u0001R\u0002 \u00012006\u0002\nRAPID COMMUNICATIONS\n241301-3\ntions is only very slight, the increased complexity makes this\nsolution unhelpful for the current analysis.\nThe analysis presented here is for a single QD embedded\nin an infinite matrix. Many of the structures which have been\nstudied experimentally contain multiple layers of dots, where\nthe fields external to one dot \u0001e.g., z\r0 nm and z\u000b4 nm in\nFig. 1\u0002 can reduce the net field in neighboring dots. The\nspatial separation of the electron and hole wave functions\ncaused by the polarization field will also lead to a self-\nscreening effect, as described in the case of quantum wells\nby Di Carlo et al.15 This screening can be included self-\nconsistently in more detailed studies of QDs.16 Fiorentini et\nal.17 also discuss a charge-density-dependent screening, and\nshow that the total potential drop caused by the field will not\nbe greater than the band gap energy. Figure 2\u0001b\u0002 also con-\nfirms that the overlap of the electron and hole wave functions\ndecreases rapidly with increasing dot size, suggesting that\nthere will be little detectable photoluminescence from the\nground state of larger dots. All these effects should be taken\ninto account when comparing with experiment.\nIn conclusion, using analytical expressions that we have\nderived previously, we have shown that the built-in polariza-\ntion potential in cylindrical nitride quantum dots is approxi-\nmately linear in z along the central z axis of the dot for dots\nwith a wide range of height to radius ratios, and we have\npresented an analytical expression for the slope of this po-\ntential. We have shown that this slope depends only on the\naspect ratio of the dot, and so will not change with dot size\nprovided the aspect ratio is conserved. The approximation is\nalso valid for truncated cone dots provided the side angle of\nthe cone is sufficiently large. We have solved the\nSchrödinger equation for this approximate potential, and\ndemonstrated analytically that the recombination energy of\nthe ground-state exciton, X0, varies essentially linearly with\ndot height, again provided the aspect ratio f is held constant.\nOur analytical Airy function solution for the approximate\npotential shows very good agreement with the wave func-\ntions obtained from a one-band numerical calculation using\nthe exact potential, confirming the validity and usefulness of\nthe approximations used here when analyzing the electronic\nstructure of GaN\/AlN QDs. Finally we note that the uncer-\ntainty in the sign of the shear piezoelectric coefficient e15\n\u0001which has no consequence for quantum well structures\u0002, in-\ntroduces a sizable uncertainty into the calculated magnitude\nof the potential in typical quantum dot structures, emphasiz-\ning the need for further measurement and analysis to develop\na reliable value for this parameter.\nWe gratefully acknowledge support from Science Founda-\ntion Ireland and the Irish Research Council For Science, En-\ngineering and Technology \u0001D.P.W.\u0002.\n*Email address: williams@tyndall.ie\n1 M. Grundmann, O. Stier, and D. Bimberg, Phys. Rev. B 52,\n11969 \u00011995\u0002.\n2 T. Yamauchi, Y. Matsuba, L. Bolotov, M. Tabuchi, and A. Naka-\nmura, Appl. Phys. Lett. 77, 4368 \u00012000\u0002.\n3 M. A. Cusack, P. R. Briddon, and M. Jaros, Phys. Rev. B 54,\nR2300 \u00011996\u0002.\n4 J. Simon, N. T. Pelekanos, C. Adelmann, E. Martinez-Guerrero,\nR. André, B. Daudin, L. S. Dang, and H. Mariette, Phys. Rev. B\n68, 035312 \u00012003\u0002.\n5 A. D. Andreev and E. P. O’Reilly, Phys. Rev. B 62, 15851\n\u00012000\u0002.\n6 D. P. Williams, A. D. Andreev, E. P. O’Reilly, and D. A. Faux,\nPhys. Rev. B 72, 235318 \u00012005\u0002.\n7 I. Vurgaftman and J. R. Meyer, J. Appl. Phys. 94, 3675 \u00012003\u0002.\n8 U. M. E. Christmas, A. D. Andreev, and D. A. Faux, J. Appl.\nPhys. 98, 073522 \u00012005\u0002.\n9 S. Muensit, E. M. Goldys, and I. L. Guy, Appl. Phys. Lett. 75,\n3965 \u00011999\u0002.\n10 F. Bernardini and V. Fiorentini, Appl. Phys. Lett. 80, 4145\n\u00012002\u0002.\n11 K. Tsubouchi and N. Mikoshiba, IEEE Trans. Sonics Ultrason.\n32, 634 \u00011985\u0002.\n12 G. Bu, D. Ciplys, M. Shur, L. J. Schowalter, S. Schujman, and R.\nGaska, Appl. Phys. Lett. 84, 4611 \u00012004\u0002.\n13 A. D. Andreev and E. P. O’Reilly, Appl. Phys. Lett. 79, 521\n\u00012001\u0002.\n14 C. Adelmann, B. Daudin, R. A. Oliver, G. A. D. Briggs, and R. E.\nRudd, Phys. Rev. B 70, 125427 \u00012004\u0002.\n15 A. Di Carlo et al., Phys. Rev. B 63, 235305 \u00012001\u0002.\n16 D. P. Williams, A. D. Andreev, and E. P. O’Reilly, Superlattices\nMicrostruct. 36, 791 \u00012004\u0002.\n17 V. Fiorentini, F. Bernardini, F. Della Sala, A. Di Carlo, and P.\nLugli, Phys. Rev. B 60, 8849 \u00011999\u0002.\nWILLIAMS, ANDREEV, AND O’REILLY PHYSICAL REVIEW B 73, 241301\u0001R\u0002 \u00012006\u0002\nRAPID COMMUNICATIONS\n241301-4\n"}