{"doi":"10.1088\/1367-2630","coreId":"100886","oai":"oai:epubs.surrey.ac.uk:287","identifiers":["oai:epubs.surrey.ac.uk:287","10.1088\/1367-2630"],"title":"Manipulating Quantum-Confined Stark Shift in Electroluminescence from Quantum Dots with Side Gates","authors":["Xu, X L","Andreev, A","Willliams, D A"],"enrichments":{"references":[{"id":852608,"title":"A","authors":[],"date":"2002","doi":"10.1143\/JJAP.41.2513","raw":null,"cites":null},{"id":853630,"title":"A and O’Reilly","authors":[],"date":"2000","doi":"10.2307\/4614058","raw":null,"cites":null},{"id":851122,"title":"D et al","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":849525,"title":"Hammura K and Williams D A","authors":[],"date":"2007","doi":"10.1088\/1742-6596\/61\/1\/251","raw":null,"cites":null},{"id":850173,"title":"Imamoglu A","authors":[],"date":"2007","doi":"10.1038\/nature05586","raw":null,"cites":null},{"id":850435,"title":"Reinecke T L and Forchel A","authors":[],"date":"2004","doi":"10.1038\/nature02969","raw":null,"cites":null},{"id":851866,"title":"W et al","authors":[],"date":"2000","doi":"10.1364\/AO.39.005843","raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-01-01","abstract":"<p>Single quantum dot (QD) light-emitting diodes were fabricated with side gates in a lateral p-i-n structure. The electroluminescence (EL) energy from the QDs can be controlled independently by the side gates and by forward bias. Stark shifts in EL have been observed up to 0.4 meV as a function of forward injection current, and around 0.7 meV by applying an electric field of 36 kV cm(-1) across the QDs. The independent control of the QD emission energy is an important step towards electrically tuning the coupling between QDs and cavities, and generating entangled-photon sources.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:287<\/identifier><datestamp>\n      2017-10-31T13:57:37Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/287\/<\/dc:relation><dc:title>\n        Manipulating Quantum-Confined Stark Shift in Electroluminescence from Quantum Dots with Side Gates<\/dc:title><dc:creator>\n        Xu, X L<\/dc:creator><dc:creator>\n        Andreev, A<\/dc:creator><dc:creator>\n        Willliams, D A<\/dc:creator><dc:description>\n        <p>Single quantum dot (QD) light-emitting diodes were fabricated with side gates in a lateral p-i-n structure. The electroluminescence (EL) energy from the QDs can be controlled independently by the side gates and by forward bias. Stark shifts in EL have been observed up to 0.4 meV as a function of forward injection current, and around 0.7 meV by applying an electric field of 36 kV cm(-1) across the QDs. The independent control of the QD emission energy is an important step towards electrically tuning the coupling between QDs and cavities, and generating entangled-photon sources.<\/p><\/dc:description><dc:date>\n        2008-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/287\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Xu, X L, Andreev, A and Willliams, D A  (2008) Manipulating Quantum-Confined Stark Shift in Electroluminescence from Quantum Dots with Side Gates   New Journal of Physics, 10 (5).       <\/dc:identifier><dc:relation>\n        10.1088\/1367-2630\/10\/5\/053036<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/287\/","10.1088\/1367-2630\/10\/5\/053036"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"T h e  o p e n – a c c e s s  j o u r n a l  f o r  p h y s i c s\nNew Journal of Physics\nManipulating quantum-confined Stark shift\nin electroluminescence from quantum dots\nwith side gates\nXiulai Xu1,3, Aleksey Andreev1,2 and David A Williams1\n1Hitachi Cambridge Laboratory, Hitachi Europe Ltd, 19 J J Thomson Avenue,\nCambridge CB3 0HE, UK\n2Advanced Technology Institute, University of Surrey, GU2 7XH, UK\nE-mail: xx757@cam.ac.uk\nNew Journal of Physics 10 (2008) 053036 (7pp)\nReceived 4 March 2008\nPublished 29 May 2008\nOnline at http:\/\/www.njp.org\/\ndoi:10.1088\/1367-2630\/10\/5\/053036\nAbstract. Single quantum dot (QD) light-emitting diodes were fabricated with\nside gates in a lateral p-i-n structure. The electroluminescence (EL) energy from\nthe QDs can be controlled independently by the side gates and by forward\nbias. Stark shifts in EL have been observed up to 0.4meV as a function of\nforward injection current, and around 0.7meV by applying an electric field of\n36 kV cm−1 across the QDs. The independent control of the QD emission energy\nis an important step towards electrically tuning the coupling between QDs and\ncavities, and generating entangled-photon sources.\nContents\n1. Introduction 2\n2. Device fabrication and experimental details 2\n3. Simulations 3\n4. Results and discussion 3\n5. Conclusion 6\nAcknowledgments 6\nReferences 6\n3 Author to whom any correspondence should be addressed.\nNew Journal of Physics 10 (2008) 053036\n1367-2630\/08\/053036+07$30.00 © IOP Publishing Ltd and Deutsche Physikalische Gesellschaft\n21. Introduction\nSemiconductor quantum dots (QDs) have attracted much interest in quantum information\nprocessing because of their ‘artificial atomic’ nature. Investigations have been performed to\nrealize single-photon and entangled-photon sources [1]–[4], photon–exciton entanglement\n[5]–[7] and quantum gates [8]. QD based devices can be fabricated easily with standard\nsemiconductor processing techniques for electroluminescence (EL) and quantum confined\nStark effect, and it appears feasible to produce electrically-pumped and electrically-controlled\nentangled-photon sources. Recently, optically-pumped entangled-photon sources have been\ndemonstrated by compressing the fine splitting of single QDs in a magnetic field [3, 4]. Since\nthis fine splitting can be controlled with an electric field [9], electrically pumped entangled\nphoton sources based on QDs are feasible.\nTo achieve strong coupling between QDs and cavities for exciton–photon entanglement,\ntemperature tuning is normally used to move the peak position of QD emission to match\nthe cavity modes [6, 7]. However, an increased temperature reduces the coherence time of\nthe system, which might limit the application of devices in quantum computation. One way\nto shift the excitonic transition in QDs is to use the Stark shift, the energy shift due to an\nelectric field applied across the dots. The Stark shift makes it possible to manipulate the\nQDs by both electric and optical fields. Stark shifts have been observed in single QDs by\nphotoluminescence [10], electrically-gated photoluminescence [11], electroreflectance [12],\nphotocurrent spectroscopy [13, 14] and EL [15] amongst other techniques. Normally the Stark\nshift observed in EL is due to the forward bias induced electric field, which is also required for\ninjecting electrons and holes [15]. It is desirable to have separate electrodes to inject electrons\nand holes for EL, and to manipulate the electric field for Stark shift. One way to obtain this is to\nuse a lateral electric field. Recently, a lateral electric field controlled Stark shift has only been\ndemonstrated by photoluminescence spectroscopy [16]. In this work, we report a demonstration\nto manipulate the Stark shift of a single QD in EL by side gates in a lateral p-i-n junction.\n2. Device fabrication and experimental details\nIn our previous work, lateral p-i-n junction devices have been fabricated using standard\nmicro-fabrication processing with electron-beam lithography, reactive ion etching and lift-off\ntechniques [1, 17]. These devices have demonstrated single photon emission from single layer\ndots [1] and the coupling between stacked two layer dots [17] in EL, in which no metal mask is\nneeded to confine the emitting site. A AuGeNi alloy annealed at 420 ◦C was used to form n-type\nohmic contacts. Cr\/Au was deposited onto the surface to act both as p-type contacts and as bond\npads. In this work, four Cr\/Au side gates (defined as G1–G4) have been patterned around the\nactive channel in a lateral p-i-n junction with one layer of diluted QDs embedded, as shown in\nfigure 1(a). A layer of polymethylmethacrylate (PMMA) with a thickness of 500 nm was used\nas an insulating layer between the side gates and the active channel.\nThe sample was mounted in a He-flow cryostat and cooled to 5K. The emitted light was\ncollected by a large numerical aperture objective, dispersed through a 0.55m spectrometer and\nthen detected with a cooled charge-coupled device (CCD) camera. Electric field orientation\nacross the QDs at the etched edge were controlled by biasing different side gates.\nNew Journal of Physics 10 (2008) 053036 (http:\/\/www.njp.org\/)\n3(a) (b)\nG1 G2\nn p\nG3 G4 QDsPMMA\nG3 (+) G2 (-)\nGaAs\nPMMA 0\n50\n100\nQDs\nE (kV\/cm)\n2 µm2 µm\nFigure 1. (a) SEM image of a lateral p-i-n junction device with side gates.\nActive regions are mesas. n and p are n-type and p-type electrodes, respectively.\nElectroluminescence is obtained from the dots in the active channel under\nforward bias. (b) Cross-section electric field of the gate 2 and gate 3 in the device\nwith a side-gate voltage of 40V across the QDs.\n3. Simulations\nIn order to estimate the electric field across the QDs, we simulated the static electric field with\nCOMSOLMultiphysics. There are two electric fields across the QDs, one from the forward bias\nof lateral p-i-n junction, another one from the biased side gates. The electric field with forward\nbias is not trivial to model because of the graded electric field across the junction edge in the\nlateral p-i-n junctions, which has been discussed in [18] in detail. Because the QD position is\nnot well defined in the junction edge, it is difficult to estimate the precise electric field with\nforward bias. However, the electric field across the QDs between the two side gates is uniform.\nIn this paper, we illustrate what electric field across the QDs can be achieved with these side\ngates, and that the electric field from the side gates is the main contribution to controlling the\nstark shift. Future simulation with two electric fields is under investigation. With a 2D geometry\nmodel, the electric field is nearly constant across the dots, as shown in figure 1(b). When a bias\nvoltage of 40V is applied on gate 2 and gate 3 with 6µm separation, the effective electric field\non the QD region is approximately 49 kV cm−1. The electric fields in the rest of this paper are\nobtained from the simulations with different bias voltages.\n4. Results and discussion\nFigure 2(a) shows EL spectra as a function of injection current. A single exciton peak at\n1.380 eV can be observed when the injection current is approximately 100µA. With increased\ninjection current, biexciton and exciton complex appear at the low energy side of the exciton\npeak, while the intensity of the exciton peak decreases. The exciton and biexcition transitions\nare confirmed with the dependence of emitting intensities on injection currents, which has\nbeen discussed in [1] with the same wafers. The exciton peak and the biexciton peak are red-\nshifted approximately 0.3–0.4meV with increasing injection current from 100 to 300µA. One\npossibility for this red-shift could be a current-induced heating effect. This was investigated\nby collecting EL spectra from the wetting layer with the same injection currents, as shown in\nfigure 2(b). No apparent shift of EL peak from the wetting layer can be resolved with increasing\nNew Journal of Physics 10 (2008) 053036 (http:\/\/www.njp.org\/)\n4Figure 2. EL spectra from a single QD (a) and the wetting layer (b) with different\ninjection currents in a typical device.\ninjection current. Therefore, the red-shift cannot be due to a heating effect, but must be due\nto the forward bias induced Stark shift. The full widths at half maximum of the EL peaks are\naround 1meV, which is broader than the usual line width around 300µeV in our system. The\nreal reason for this broadening is not very clear. We believe it may be due to the dot density for\nthis wafer being extremely low (less than 0.1 dotµm−2), where QDs are not very well formed\nbecause of the extremely thin InAs layer. These broadened peaks have also been observed on\nthe low density site with a graded dot density wafer.\nWith a forward bias current at 120µA, a bias voltage on side gates between G2 and G3\nwas applied to observe the Stark shift. The results with bias voltages on side gates G1 and\nG4 are similar. These Stark shifts with side gates have been observed from many different\nQDs in different devices with EL. Figure 3 shows the EL spectra as a function of bias\nvoltage in one device. The exciton peak around 1.380 eV is shifted to lower energies with\nincreasing positive and negative bias voltages. The peak position shifts faster with negative\nbias (0.6meV for −30V) than positive bias (0.13meV for 40V), resulting in an asymmetric\nStark shift because of the built-in dipole in the QD structures. The small energy shift (less\nthan 700µeV) is of the same order as previous observations on the lateral Stark shift with\nphotoluminescence spectroscopy [16, 19]. The transition energy E(F) depends quadratically on\nthe electric field F , such that E(F)= E(0)+ pF +βF2, where E(0) is the zero-field transition\nenergy, p is the built-in dipole moment and β measures the polarization of the electron and\nhole wavefunctions [13, 20, 21]. The built-in dipole (electron–hole separation) in our case is\nin the sample plane (perpendicular to the growth direction), which is induced by the in-plane\ncomponent of the built-in electric field in the lateral junction and by a piezoelectric field.\nNew Journal of Physics 10 (2008) 053036 (http:\/\/www.njp.org\/)\n5Figure 3. EL spectra as a function of bias voltage on side gates in a step of 5V.\nEach spectrum is shifted for clarity.\nFigure 4. Spectral positions of EL with injection currents at 120 and 220µA as\na function of bias voltage. The arrows indicate the maxima of exciton transition\nenergy. The inset shows the fitting results.\nFigure 4 shows the field dependence of the transition energy with two injection currents,\n120 and 220µA. The exciton transition energy changes with changing bias voltage on the side\ngates in each case. At a certain injection current, the field dependence of the transition energy\non side-gate bias voltage can be well fitted with the expression E(F)= E(0)+ pF +βF2, as\nshown in figure 4 (dashed line). The fitting parameters are shown in the inset in figure 4. The\nmaximum transition energy positions are located at 11.2 kV cm−1 and 4.12 kV cm−1 for 120 and\n220µA, respectively. The exciton peak position at 220µA without a bias voltage on side gates\nNew Journal of Physics 10 (2008) 053036 (http:\/\/www.njp.org\/)\n6is red-shifted, compared to that of 120µA. This is due to the forward bias induced Stark shift\nin EL, as discussed previously.\nThe polarizability β is determined by the shape of the QDs. The β values (∼ 0.003 e nm\n(kV cm−1)−1) for the two injection currents are similar, as expected, which also corresponds\nwell with the results in [16]. In self-organized QDs grown on 001 planes, the electrical dipole\nEptotal is mainly directed in the growth direction and its sign is controlled by the dot composition\ndistribution and the degree of truncation [13, 22] of the QDs. However, if the external electric\nfield EF is applied in arbitrary direction, the corresponding term in the energy shift that is linear\nin the electric field (dipole-related term) is given by −Eptotal · EF =−pF , where p = | Eptotal| cos θ\nis the effective dipole moment determined from the fit above and θ is the angle between the\napplied electric field and 001-direction. This means that the energy shift is determined by the\ncomponent of the electric field in the growth 001-direction. Why is the dipole p different for\nthe two injection currents in our case? In this lateral p-i-n junction, the forward biased electric\nfield across the QD does not fully lie in the direction of wafer growth anymore, which has an\nin-plane component. The built-in electric field in the lateral p-i-n junction is opposite to this\nin-plane component. The larger forward bias reduces the built-in electric field component in\nthe growth direction, resulting in a smaller effective dipole p. The p values are 0.60± 0.1 and\n0.26± 0.1 eÅ for the injection current of 120 and 220µA. The smaller dipole with large current\ninjection results in a less asymmetric Stark shift.\n5. Conclusion\nIn summary, we have fabricated single quantum dot light-emitting diodes using lateral p-i-n\njunction with side gates, and demonstrated that the exciton transition energy can be tuned by\nforward bias voltage and side-gate bias, respectively. The asymmetric Stark shift induced by the\nbiasing side gates is also influenced by forward bias voltages, which balances the in-plane built-\nin electric field. We believe this method of independently controlling the transition of excitons\nusing side gates is useful in the application of observing quantum coupling between QDs and\ncavities in EL. Fine splitting control has not been resolved with side gates in this work because\nof the relatively broad peak width. Further investigation is under way to realize electrically-\npumped entangled photons [9].\nAcknowledgments\nWe acknowledge Professor M Hopkinson and Dr H Y Liu from the University of Sheffield for\ngrowth of the QD wafer.\nReferences\n[1] Xu X L, Williams D A and Cleaver J R A 2004 Appl. Phys. Lett. 85 3238\n[2] Xu X L, Toft I, Phillips R T, Mar J, Hammura K and Williams D A 2007 Appl. Phys. Lett. 90 061103\n[3] Stevenson R M, Young R J, Atkinson P, Cooper K, Ritchie D A and Shields A J 2006 Nature 439 179\n[4] Akopian N, Lindner N H, Poem E, Berlatzky Y, Avron J, Gershoni D, Gerardot B D and Petroff P M 2006\nPhys. Rev. Lett. 96 130501\n[5] Hennessy K, Badolato A, Winger M, Gerace D, Atature M, Gulde S, Falt S, Hu E L and Imamoglu A 2007\nNature 445 896\nNew Journal of Physics 10 (2008) 053036 (http:\/\/www.njp.org\/)\n7[6] Yoshie T, Scherer A, Hendrickson J, Khitrova G, Gibbs H M, Rupper G, Ell C, Shchekin O B and Deppe D G\n2004 Nature 432 200\n[7] Reithmaier J P, Sek G, Loffler A, Hofmann C, Kuhn S, Reitzenstein S, Keldysh L V, Kulakovskii V D,\nReinecke T L and Forchel A 2004 Nature 432 197\n[8] Li X, Wu Y, Steel D, Gammon D, Stievater T H, Katzer D S, Park D, Piermarocchi C and Sham L J 2003\nScience 301 809\n[9] Gerardot B D et al 2007 Appl. Phys. Lett. 90 041101\n[10] Sanguinetti S, Gurioli M, Grilli E, Guzzi M and Henini M 2000 Appl. Phys. Lett. 77 1982\n[11] Heller W, Bockelmann U and Abstreiter G 1998 Phys. Rev. B 57 6270\n[12] Jin P, Li C M, Zhang Z Y, Liu F Q, Chen Y H, Ye X L, Xu B and Wang Z G 2004 Appl. Phys. Lett. 85 2791\n[13] Fry P W et al 2000 Phys. Rev. Lett. 84 733\n[14] Zrenner A, Beham E, Stufler S, Findeis F, Bichler M and Abstreiter G 2002 Nature 418 612\n[15] Itskevich I E, Rybchenko S I, Tartakovskii I I, Stoddart S T, Levin A, Main P C, Eaves L, Henini M and\nParnell S 2000 Appl. Phys. Lett. 76 3932\n[16] Stavarache V, Reuter D, Wieck A D, Schwab M, Yakovlev D R, Oulton R and Bayer M 2006 Appl. Phys.\nLett. 89 123105\n[17] Xu X L, Andreev A, Williams D A and Cleaver J R A 2006 Appl. Phys. Lett. 89 091120\n[18] Kaestner B, Hasko D H and Williams D A 2002 Japan. J. Appl. Phys. 41 2513\n[19] Kowalik K, Krebs O, Lemaitre A, Laurent S, Senellart P, Voisin P and Gaj J A 2005 Appl. Phys. Lett.\n86 041907\n[20] Sheng W and Leburton J-P 2002 Phys. Rev. Lett. 88 167401\n[21] Barker J A and O’Reilly E P 2000 Phy. Rev. B 61 13840\n[22] Pryor C 1998 Phys. Rev. B 57 7190\nNew Journal of Physics 10 (2008) 053036 (http:\/\/www.njp.org\/)\n"}