{"doi":"10.1016\/j.tsf.2005.08.319","coreId":"140000","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/999","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/999","10.1016\/j.tsf.2005.08.319"],"title":"Electroforming processes for platinum nanoisland thin films","authors":["Bertoni, Cristina","Gallardo, D. E.","Dunn, Steve"],"enrichments":{"references":[{"id":37957281,"title":"Handbook of thin film technology,","authors":[],"date":"1970","doi":"10.1149\/1.2408101","raw":"Neugebauer C.A., in: Maissel L. I. and Glang R. (Eds.), Handbook of thin film technology, McGRAW HILL, New-York NY, 1970, chapter 8.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-01-20T00:00:00Z","abstract":"An investigation of the electroforming processes for platinum discontinuous thin\nfilms is detailed. Current–voltage characteristics, for metal nanoislands\ndeposited by sputtering, were obtained in vacuum and air and typically showed\nvoltage-controlled negative resistance (VCNR) behaviour. The current maximum\nshifted with the electrode separation. Electroforming under high current density\nregimes was non-regenerative as samples showed irreversible resistance changes.\nSEM examination of the film revealed a change in the metal microstructure. Such\nmodifications arise as a result of the current flowing through the film inducing\nelectro and thermal migration. Current-induced effects were studied by modelling\nthe metal nanoisland (MN) layer as an array of cubic cells. Plots of current\ndistribution showed that hot-spots develop along conductive paths.\nElectromigration combined with resistive heating can lead to progressive\ndestruction of current channels at these hot-spots. Hence, current profiles and\nSEM micrographs were interpreted as evidence of a ‘macroscopic’ electrical\nbreakdown of sample conduction due to microstructural modifications of the thin\nfilm. The reduction of ohmic component and consequent resistive heating along\nthe current channels prevented the metal migration and stable current profiles\nwere ob","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140000.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.tsf.2005.08.319","pdfHashValue":"92e65e652182568e7b49e08415b5696bf779999a","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/999<\/identifier><datestamp>2011-06-21T15:40:26Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Electroforming processes for platinum nanoisland thin films<\/dc:title><dc:creator>Bertoni, Cristina<\/dc:creator><dc:creator>Gallardo, D. E.<\/dc:creator><dc:creator>Dunn, Steve<\/dc:creator><dc:subject>Electromigration<\/dc:subject><dc:description>An investigation of the electroforming processes for platinum discontinuous thin\nfilms is detailed. Current–voltage characteristics, for metal nanoislands\ndeposited by sputtering, were obtained in vacuum and air and typically showed\nvoltage-controlled negative resistance (VCNR) behaviour. The current maximum\nshifted with the electrode separation. Electroforming under high current density\nregimes was non-regenerative as samples showed irreversible resistance changes.\nSEM examination of the film revealed a change in the metal microstructure. Such\nmodifications arise as a result of the current flowing through the film inducing\nelectro and thermal migration. Current-induced effects were studied by modelling\nthe metal nanoisland (MN) layer as an array of cubic cells. Plots of current\ndistribution showed that hot-spots develop along conductive paths.\nElectromigration combined with resistive heating can lead to progressive\ndestruction of current channels at these hot-spots. Hence, current profiles and\nSEM micrographs were interpreted as evidence of a ‘macroscopic’ electrical\nbreakdown of sample conduction due to microstructural modifications of the thin\nfilm. The reduction of ohmic component and consequent resistive heating along\nthe current channels prevented the metal migration and stable current profiles\nwere obt<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-04-14T23:33:34Z<\/dc:date><dc:date>2011-04-14T23:33:34Z<\/dc:date><dc:date>2006-01-20T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>C. Bertoni, D.E. Gallardo and S. Dunn, Electroforming processes for platinum nanoisland thin films, Thin Solid Films, Volume 495, Issues 1-2, EMRS 2005 Symposium E - Synthesis, Characterization and Applications of Mesostructured Thin Layers, 20 January 2006, Pages 29-35.<\/dc:identifier><dc:identifier>0040-6090<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.tsf.2005.08.319<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/999<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0040-6090","0040-6090"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Electromigration"],"subject":["Article"],"fullText":" 1\n \nTHIS PAPER MUST BE CITED AS: \nThin Solid Films 495 (2006) 29 – 35 \n \n \n \n \nMANUSCRIPT COVER PAGE FORM \n \n \n \n \nE-MRS Symposium       : Symposium E : Synthesis, Characterization and Applications  \n                                           of Mesostructured Thin Layers \n \nPaper Number                : E\/PI.01 \n \nTitle of Paper                  : Electroforming processes for platinum nanoisland thin films \n \nCorresponding Author  : Cristina Bertoni \n \n \nFull Mailing Address     :  \nNanotechnology Group \nCranfield University  \nSIMS B70 \nCranfield Bedfordshire MK43 0AL \nENGLAND \n \n \nTelephone                        : +44 (0) 1234 750111 ext. 2422 \nFax                                   : +44 (0) 1234 751346 \nE-mail                              : c.bertoni@cranfield.ac.uk \n \n 2\nElectroforming processes for platinum nanoisland thin films \n \nC. Bertoni, D. E. Gallardo, S. Dunn \nNanotechnology Group, School of Industrial and Manufacturing Science \nCranfield University, Cranfield, Bedfordshire MK43 0AL England \nTel +44 (0) 1234 750111 ext 2422 Fax +44 (0) 1234 751346 \nEmail contact: c.bertoni@cranfield.ac.uk \n \nAbstract \nAn investigation of the electroforming processes for platinum discontinuous thin films is \ndetailed. Current-voltage characteristics, for metal nanoislands deposited by sputtering, were \nobtained in vacuum and air and typically showed voltage-controlled negative resistance \n(VCNR) behaviour. The current maximum shifted with the electrode separation. \nElectroforming under high current density regimes was non-regenerative as samples showed \nirreversible resistance changes. SEM examination of the film revealed a change in the metal \nmicrostructure. Such modifications arise as a result of the current flowing through the film \ninducing electro and thermal migration. Current-induced effects were studied by modelling \nthe metal nanoisland (MN) layer as an array of cubic cells. Plots of current distribution \nshowed that hot-spots develop along conductive paths. Electromigration combined with \nresistive heating can lead to progressive destruction of current channels at these hot-spots. \nHence, current profiles and SEM micrographs were interpreted as evidence of a ‘macroscopic’ \nelectrical breakdown of sample conduction due to microstructural modifications of the thin \n 3\nfilm. The reduction of ohmic component and consequent resistive heating along the current \nchannels prevented the metal migration and stable current profiles were obtained. \n \nKeywords: electromigration, discontinuous metal thin films \n \n1. Introduction \nResearch activity on nanophase materials has seen a tremendous growth in the last decade. \nInvestigation of nanometer-sized materials has attracted considerable attention because of \ntheir unique chemical\/physical properties when compared to solid-state bulk materials as well \nas their potential in nanoscale devices.  \n \nThe development of chemical and physical routes to make self-organised MN arrays has seen \na renewed interest due to their relevance in several fields of research. A major technology \nobjective is the ability to control size\/distribution of nano-particles over large areas. As \nreported in [1], size\/shape of metal particles influence the chemisorption and catalytic activity \nin metal-on-oxide systems. They are also critical in determining the optical properties of \nmetal-dielectric nanocomposites thin films [2].  \n \nThere is considerable interest in using ordered MN layers as a method for fabricating intrinsic \nnanoscale devices. Currently the design of nanostructures is unachievable through standard \nUV-lithography and is expensive and time-consuming using e-beam techniques. Self-\nassembled nanoisland arrays could serve as templates for the growth of ordered patterns of \nquantum structures and, hence, the design of novel electronic and optical devices. For instance, \n 4\nMN can be used as catalyst sites for carbon nanotubes [3] and ZnO nanorods growth [4]. Here, \nthe size of the catalyst metal particles determines the growth properties of the quantum \nstructures.  \n \nIn optoelectronics, conduction and optical properties of MN layers have been used to enhance \ncarrier transport and injection in multilayer devices. As shown in [5], optically transparent \nMN thin layers can enhance carrier injection and therefore, device efficiency in OLED. Again, \nthe metal particles size and separation is critical in determining optical transmission of the \nlayer and conduction properties of the overall device.  \n \nHigh work function metals in the form of ultra thin discontinuous electrodes have been \ninvestigated as injection layers for a novel low-voltage thin film electroluminescent device. As \nthe device operation requires high in-plane current densities at low applied voltages (≤10V), it \nwas necessary to find optimal MN size and distribution to avoid metal migration under the \napplication of an external electric field. Electro and thermo migration processes are known in \nthe semiconductor industry causing damage to metal interconnects and eventual device failure \n[6, 7]. Ichinokawa and co-workers [8] showed that such phenomena also affect ultra thin \nmetal films. Various metal films were vacuum evaporated onto a p-type Si (001) wafer. \nHeating to 500˚C caused the nucleation of metal islands. Electromigration of micron size \nislands proceeded on Si substrates in the presence of an electric field or electric current. The \nlarge islands migrate while coalescing with the small islands and increasing diameters. The \nmigration velocity increases with the substrate temperature and island radius.  \n \n 5\nQualitative description of electroforming can be found in [9], a review devoted to electron and \nlight emission from metal nanodispersed films. A typical device structure consists of two \nmetal electrodes ∼100nm thick with a gap of ca 10μm deposited onto a dielectric substrate. \nThe metal layer is usually vacuum-evaporated and electroformed by applying a voltage of 20-\n30V for 0.5-2min. Electron and photon emission centres which are ≤1μm in size are believed \nto arise as a result of electro\/thermomigration processes occurring during the electroforming. \nConduction currents in electroformed films are a few mA and are non-linear. The effect of \noverlayers on light emission from metal islands was studied by coating pre-formed islands \nwith organic molecules layers (e.g., stearone). I-V curves revealed an increase in the overall \nsample conduction, related to organic conducting bridges spanning the gaps between islands, \nand the occurrence of VCNR behaviour.  \n \nVCNR behaviour was also observed in metal-insulator-metal (MIM) structures [10]. The \nMIM device family consists of multilayer structures where the insulating material (5nm to \n1μm thick) is sandwiched between the metal electrodes and open planar devices where a thin \nor semi-continuous metal film is deposited between two planar metal electrodes. In the latter \ncase, the metal film thickness is initially about 10nm, while the actual MIM element is then \nobtained by thermal annealing with consequent rupturing of the metal film and creation of a \nmicroslit (∼1μm broad). Residual metal coagulates into islands located between the electrode \nedges. Typical I-V curves reported for planar devices present non-ohmic profiles at low \nvoltages followed by a current maximum (∼100mA) and a negative differential resistance \nregion. In particular, the first up-ramp is characterised by a steep positive slope until an \ninflexion point where an overall decrease in sample conductance is detected. \n 6\n \nThe aim of the present work is to produce and electrically characterise Pt nanoisland thin films \nwhich could be used as large area (5–30mm2), highly efficient carriers’ injection layers for a \nplanar device structure. Pt was selected because of its high work function and resistance to \noxidation. In this paper, current induced effects occurring during electroforming of ultra thin \nMN layers are studied. Initial experiments were carried on very thin Pt layers (∼2nm) which \nshowed, as observed in the SEM, an island structure and good conductive properties \n(<ρ>=60μΩcm). The procedures to grow nanoscale Pt islands by RF sputtering techniques are \nreported.  \n \n2. Experimental  \n2.1 Preparation of MN thin films \nDeposition experiments to obtain MN on dielectric substrates were carried in a high vacuum \nsputtering system (Nordiko2500) at a base pressure of 8-10×10-7mbar using DC magnetron \nsputtering. Substrates were initially cleaned by organic solvents (acetone and isopropanol) \nrinse at room temperature (RT) in an ultrasonic bath for 15min. \n \nUltra high precision SEM micrographs of both as-deposited and electroformed films were \ntaken using a field emission gun (SFEG) XL30 Philips apparatus.  \n \n2.2 Electrical characterisation  \nRectangular Cr\/Au electrodes 10mm large and spaced from 0.5 to 3.5mm were thermally \nevaporated. Once the discontinuous metal layer was deposited, DC voltage sweeps of ∼0.1V\/s \n 7\nwere applied to the MNs film using a DC power supply (3A-60V) while the current was \nmeasured using an HP34410A multimeter. I-V experiments were carried at RT under high \nvacuum (HV) conditions (at ∼10-6mbar) and in air.  \n \nLinear resistance (LR) was introduced as a reference parameter to compare results obtained \nacross different areas. It is defined as the ratio between the initial resistance measured across \nan electrodes’ pair in vacuum and the distance of separation. \n \n3. Results and discussion \n3.1 MN thin film deposition and characterisation \nExperiments were conducted to determine the optimal sputtering conditions for the MN on a \nseries of substrates taking into account the interaction of surface free energy on nucleation \n[11]. Soda lime glass slides and SiO2(400nm)\/Si wafers were used for these experiments – \nglass being selected for the following I-V study. The sputtering power was decreased and a \ndiscontinuous film was obtained at 30W and 20W, as revealed by SEM examination. Figures \n1a and b depict the film morphology for Pt sputtered on glass and SiO2\/Si at 30W for 10s. As \ncan be seen, the metal nanostructure does not change significantly on different substrates. This \nwas attributed to typical Pt behaviour of forming a dense population of nuclei coalescing to \nform large aggregates at low average film thickness [11]. Control of deposition allows growth \nto be stopped during coalescence, films obtained on different substrates present similar \npatterns. \n \n 8\nContrast and resolution achieved in imaging MNs on SiO2\/Si allowed measuring islands’ size \nand separation. The average gap measured between nanoislands was less than 3nm. Using \ndeposition rate measurements the layer thickness was estimated at less than 2nm. \n \n3.2 I-V characteristics, morphological analysis and percolation modelling of low LR samples \n(∼104Ω\/m) characterised by >60% metal surface coverage \nThe metal surface coverage for MN thin films obtained at 30W for 10s on glass was \ncalculated through image processing of the SEM micrographs. The images were digitalised \nusing Adobe Photoshop 6.0 and a threshold method [12] was applied. The percentage of non \nconductive pixels Pb vs. the digitalisation level I was derived. The derivative dPb\/dI shows a \npeak corresponding to the most significant change in the pattern with the digitalisation level \nwhen the background pixels are separated from ‘conductive’ pixels.  \n \nThe Pb calculated from large area images (figure 1b) was around 35%. Therefore, the \nestimated surface coverage for the metal layers is about 65%. \n \nThe following discussion is focussed on short distance electrode pairs, i.e. 0.5 and 1mm. \nLarge electrode separation areas exhibited low current densities both in vacuum and in air. \nHence, only some results concerning large electrode separation are reported for comparison \n(table 1). \n \nFigure 2 shows I-V curves obtained by applying slow velocity (∼0.1V\/s) DC voltage sweeps \nup to 10V across different areas over the same sample (S1, <LR>=3×104Ω\/m) under HV and \n 9\nair. In both cases, curves are ohmic at low electric fields and show a slow and ‘noisy’ decrease \nin conductance until a current maximum and negative resistance region are reached. \nFurthermore, it can be observed that the critical voltage VC at which the current starts to \nbreakdown shifts with electrodes separation (table 1).  \n \nSEM analysis (figures 3a and b) revealed that migration processes had led to the formation of \na filaments network. The evolution of electro and thermo- migration processes tends to form \nand destroy the filaments under vacuum while it leaves them intact in air.  \n \nThese morphological changes in metal nanostructure were interpreted as evidence of \nproduction of conductive filaments under the influence of intense electric field as proposed to \naccount for VCNR behaviour in sandwich-type and planar MIM structures [10, 13]. In this \nmodel, maximum current occurs when the filaments matrix consists of a large number of \nconducting paths, while the final decrease in current corresponds to filaments rupture due to \nhigh local Joule heating. The decrease in conduction found for this type of films (S1s) during \nthe up-ramps suggests a high rate of filaments rupture at all V’s.  \n \nSamples of similar initial resistance R0 show similar I-V slopes (figure 2) however conduction \nbreakdown occurs earlier under vacuum than in air. This is explained as a consequence of \nlocal reactions (pyrolisis) involving organic molecules adsorbed on the surface and subsequent \nproduction of carbon bridging the islands [14], so that current is shared by many conductive \npaths reducing the amount of heat generated locally.  \n \n 10\nFurthermore, samples characterised in air show a degree of ‘filaments regeneration’, while \nfilaments rupture predominates under vacuum and leads to irreversible changes in sample \nconduction (figure 4). This can be ascribed to the adsorption of organic molecules which act \nas constructive building blocks of new conductive bridges between the islands. \n \nSEM\/EDX analyses were conducted on samples electrically characterised in vacuum and air. \nSpectra were acquired at 5keV and all chemical elements related to the typical composition of \nsoda lime glasses were detected. Different spectra were compared by equating the Ca content \nin correspondence to the L-line at 0.305keV. The comparison qualitatively indicates a larger \npercentage of carbon (K-line at 0.29keV) in the composition of samples characterised in air \n(figure 5). \n \nCurrents through percolated layers in vacuum were studied by simulating the MN layer as an \narray of 3D cells. A code was created in Visual C++ to generate a random configuration of \nmetallic and empty cells from a specified set of parameters, such as cell dimensions and \noccupational probability. A series of simulations were run for occupational probabilities >60% \n(figure 6a) by assuming ohmic conduction through percolation paths. For a given voltage, the \nprogram calculates the potential and current distributions for the generated pattern. Figure 6b \nshows that current is concentrated along low resistance percolation paths within the pattern. \nThese filaments present ‘hot-spots’ where the current reaches maximum values. Current \ndensities estimated at these points were in the range of 107A\/cm2. These values support the \nhypothesis that Joule heating developed locally could cause the rupture of the filament.  \n \n 11\nThe shift of critical voltage with electrodes separation further confirms this hypothesis: as the \nlength of spanning clusters increases with distance between the electrodes, the current density \nwill on average decrease with electrode distance. As a consequence, the process of \noverheating and filaments rupture will be delayed to higher applied voltages. \n \n3.3 I-V characteristics and morphological analysis of high LR (∼105-106Ω\/m) samples \ncharacterised by <60% surface coverage \nTo avoid major morphological changes and increase reproducibility, it was necessary to \nreduce the probability of formation of spanning clusters between the electrodes. It is possible \nto stop the deposition process at a MN distribution characterised by a lower number of \nspanning clusters by monitoring the thin film resistance during deposition.  \n \nNew samples were obtained by sputtering under normal conditions and monitoring the \nresistance across areas of interest (table 1, samples S2 and S3). Surface coverage for these \nsamples was determined using the digitalisation level method and was around 55%. \n \nFigures 7a and b show MNs’ distribution on glass corresponding to samples S2 and S3 \ncharacterised by a LR of 105 and 106Ω\/m respectively. In particular, MNs associated with \nfigure 7b are separated by larger gaps (~5nm). Both images present ‘bright’ spots due to \ncharging effects.  \n \nResults of I-V experiments carried in vacuum at RT are reported in figure 9. After an initial \nohmic behaviour the current increases non-linearly with the applied voltage. This is different \n 12\nfrom what was found in low LR samples where the initial up-ramp shows a slow and \nprogressive decrease in the sample conductance (figure 2 or 5). The current flowing trough \nsample S2 is still important and the electrical conduction failed at about 10V. Conversely, the \ncurrent profile obtained for sample S3 over the same voltage range is characterized by lower \ncurrent densities and did not exhibit electrical breakdown. \n \nSubsequent SEM examination (figure 8a and b) revealed that the forming process has slightly \naffected the metal nanostructure compared to the initial state (figure 7a and b). However the \nfilm morphology still consists of isolated nanoislands. In both cases it is still possible to \ndetermine the shape and separation of electroformed MNs.  \n \nFrom these results, it is possible to infer that the morphology of Pt nanoisland thin films is \npreserved in high surface coverage samples (∼55%) where the power supplied to the system \ncan be dissipated without inducing major electromigration processes.  \n \n4. Conclusions  \nA process for depositing Pt MN thin layers by sputtering techniques was evaluated and used to \nmake films that are consistent and can be investigated in terms of I-V. A range of experiments \nwere conducted in HV and air on conductive Pt nanoisland thin films.  \n \nFor over 60% surface coverage samples, typical I-V curves exhibited a VCNR-like behaviour \nwith a current maximum followed by a negative resistance region. The current peak shifted in \nvoltage depending on either the electrode separation or thin film resistance (see table 1). These \n 13\nresults indicate that the I-V shape and location of current maximum are related to the current \ndensity regime which in turn is determined by MNs distribution. The SEM analysis showed \nthat the MNs nanostructure changes after application of an external electric field and this has \nbeen attributed to an electroforming process. Metal migration irreversibly changes the \nmorphology and electrical properties of the MN thin film.  \n \nDifferences in I-V curves and electroformed film morphology which were observed confirm \nthat sorbed species on the surface of the metal thin films and their ability to bridge gaps \nbetween metal nanoparticles alter the electroforming process and shifts the critical voltage of \nbreakdown upwards. \n \nIt was found that major metal migration processes occurring under vacuum in Pt nanoisland \nthin films can be prevented at surface coverage levels of about 55% where formed metal \npercolated layers still show an island structure.  \n \nOverall, these results show that for a device containing nanometallic structures there will have \nto be some form of conditioning process. The nature of this pre-treatment is likely to be \ndependent on factors such as the type of substrate, metal, the surface coverage of the MN \nlayer and also the atmosphere surrounding the device.  \n 14\nReferences \n[1] Tanner R.E., Goldfarb I., Castell M.R. and Briggs G.A.D, Surf. Sci. 486 (2001), 167-184. \n[2] Mandal S.K., Roy R.K. and Pal A.K., J. Phys. D: Appl. Phys. 36 (2003) 261-265. \n[3] Choi W.B., Chung D.S., Kang J.H., Kim H.Y., Jin Y.W., Han I.T., Lee Y.H., Jung J.E., \nLee N.S., Park G.S. and Kim J.M., Appl. Phys. Lett. 75 (1999) 3129-3131. \n[4] Grabowska J., Tobin G., Nanda K.K., McGlynn E., Mosnier J.-P. and Henry M.O., \nMFMN 2004, Proceedings of Materials for Microelectronics and Nanoengineering, \nSouthampton, U.K., September 13-14, 2004, p.26. \n[5] Chengfeng Q., Haiying C., Zhiliang X., Man W. and Hoi-Sing K., SID 2002, Proceedings \nof The Society for Information Display, Boston, MA, May 19-24, 2002, p.1262. \n[6] Arzt E., Kraft O. and Mockl U.E., Materials Reliability in Microelectronics IV. \nSymposium, San Francisco, CA, USA, April 5-8, 1994, p. 397. \n[7] Lee S.H. and Kwon D., Thin Solid Films 341 (1999) 136-139. \n[8] Ichinokawa T., Haginoya C., Inoue D., Itoh H. and Kirschner J., Jpn. J. Appl. Phys. 32 \n(1993) 1379-1384. \n[9] Fedorovich R.D., Naumovets A.G. and Tomchuk P.M., Phys. Rep. 328 (2000) 73-179.  \n[10] Pagnia H. and Sotnik N., Phys. Stat. Sol. A 108 (1988) 11-65. \n[11] Neugebauer C.A., in: Maissel L. I. and Glang R. (Eds.), Handbook of thin film \ntechnology, McGRAW HILL, New-York NY, 1970, chapter 8.  \n[12] Bieganski P., Dobierzewska-Mozrzymas E., Newelski M., Pieciul E., Vacuum, 46 (1995) \n513-516. \n[13] Dearnaley G., Morgan D.V. and Stoneham A.M., J Non-Crystal. Sol. 4 (1970) 593-612. \n[14] Blessing R., Pagnia H. and Sotnik N., Thin Sol. Films 85 (1981) 119-128. \n 15\nFigure and table captions \nFigure 1 - SEM images of Pt semi-continuous thin films deposited by DC magnetron \nsputtering on glass (a) and silicon (b) substrates at 30W for 10 s. The contrast achieved on \nsilicon allowed accurate measurements of the gap between islands. This resulted always very \nsmall and less than 3nm in all the cases. \n \nFigure 2 – I-V curves obtained at RT under HV and in air by applying slow velocity (∼0.1V\/s) \nDC voltage sweeps up to a limit of 10V across different areas on a glass sample (S1). Both \nvacuum and air curves present an initial ohmic behaviour followed by a slow decrease in \nconductance until reaching a current maximum. The current peak shifts with the electrode \ndistance. \n \nFigure 3 – SEM images of electroformed Pt nanoislands thin films on glass. After two voltage \nsweeps up to 10V (a) under HV and (b) in air (see figure 4) the film microstructure showed in \nboth cases marked morphological changes. In particular, it can be observed that these current-\ninduced effects tend to form and destroy filaments in vacuum while they lead to a filament \nnetwork in air. \n \nFigure 4 – Current profiles obtained at RT under HV and in air over 1mm areas. While the \nsample under vacuum exhibits an irreversible change in resistance, the sample in air shows a \ncertain degree of ‘regeneration’.  \n \n 16\nFigure 5 – SEM\/EDX analysis of Pt MN thin film on soda lime glass after I-Vs conducted in \nvacuum and air. A stronger peak at 0.29keV which can be related to the carbon k-line appears \nin air samples by comparison with vacuum samples. Other chemical elements included in the \nspectra relates to typical composition of soda lime glass.  \n \nFigure 6 – (a) Spanning clusters configuration and (b) current distribution obtained by \nsimulating the metal percolated layer as a 2D mesh of cells either empty or metallic. Current \ndistribution corresponding to occupation probabilities above 60% typically presented ‘hot-\nspots’ (i.e., black cells) along conductive filamentary paths where the current reaches \nmaximum values. These hot-spots could burn out during a voltage sweep, permanently \naffecting the conductivity of current channels.  \n \nFigure 7 – SEM images of MNs films sputtered on glass. Picture (a) refers to the sample S2-\n0.5mm-HV, while (b) depicts nanoislands distribution corresponding to the sample S3-\n0.5mm-HV. These pictures show MN distributions corresponding to LRs of 105 and 106Ω\/m \nrespectively. As the metal film is very thin and less conductive, both images are affected by \ncharging effects which lead to the appearance of ‘bright’ spots. \n \nFigure 8 – SEM images of MN films on glass after electrical characterisation at RT in HV (see \nfigure 9). Pictures (a) and (b) correspond to 0.5mm areas on samples S2 and S3 respectively. \nAs can be observed by comparison with figures 7a and b, the electroforming has slightly \naffected the thin film morphology but the MN shape and separation can still be appreciated. \n \n 17\nFigure 9 – I-V curves obtained under vacuum at RT for high LR 0.5 mm areas (table 1, \nsamples S2 and S3). Along voltage ramps up to 10V, both samples showed an initial ohmic \nbehaviour followed by a non-linear deviation with an increase in sample conductance. \nSamples S2 shows a higher current density and breaks down at about 10V. \n \nTable 1 – Initial resistance R0, LR values and critical voltages for a set of samples \ncharacterised at RT in HV and air. \n 18\n \nPt MN on glass: sample S1 S2 S3 \nelectrode separation (mm) 0.5 1 1 1.5 2 0.5 0.5 0.5 \nHV or air HV HV air air air HV air HV \nR0 (Ω)  18 27 14 46 72 50 72 456 \nLR (x 104 Ω\/m) 3.6 2.7 -- -- -- 105 -- ∼ \n106 \nVC  (V) – 1st up ramp 6.5 8.8 7.7 13.5 14.5 10.2 16.5 -- \n    Table 1 \n 19\n     \n \nFig 1a      Fig 1b \n \n6.5 V\n7.7 V\n8.8 V\n0\n100\n200\n300\n400\n500\n600\n0 2 4 6 8 10 12\nV\n S1 - 0.5 mm HV\n S1 - 1 mm in air\n S1 - 1 mm HV\nFig. 2 \n \n          \n \nFig 3a       Fig 3b \n 20\n \n7.7 V\n9.2 V\n8.8 V\n10 V\n0\n100\n200\n300\n400\n500\n600\n0 2 4 6 8 10 12\nV\nS1 - 1 mm in air - 1\nS1 - 1 mm in air - 2\nS1 - 1mm HV - 1\nS1 - 1mm HV - 2\nFig 4 \nFig 5 \n \n \n         \n \nFig 6a        Fig 6b \n \n 21\n            \n \nFig 7a      Fig 7b \n \n            \n \nFig 8a        Fig 8b \n0\n50\n100\n150\n200\n250\n300\n350\n0 3 6 9 12 15 18\nV\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\nS2 - 0.5 mm HV\nS3 - 0.5 mm HV\nFig 9 \n"}