{"doi":"10.1079\/PGR20031","coreId":"69839","oai":"oai:eprints.lancs.ac.uk:20901","identifiers":["oai:eprints.lancs.ac.uk:20901","10.1079\/PGR20031"],"title":"Winter Wheat in England and Wales, 1923-1995:What do Indices of Genetic Diversity Reveal?","authors":["Srinivasan, C. S.","Thirtle, Colin","Palladino, Paolo"],"enrichments":{"references":[{"id":16338318,"title":"Breeders’ rights and patenting life forms.","authors":[],"date":"1986","doi":"10.1038\/322785a0","raw":"Berlan J-P and Lewontin R (1986) Breeders’ rights and patenting life forms. Nature 322: 785–788.","cites":null},{"id":16338338,"title":"Deﬁ-nition and measurement of crop diversity for economic analysis. In:","authors":[],"date":"1998","doi":"10.1007\/978-94-009-0011-0_2","raw":"Meng ECH, Smale M, Bellon M, and Grimanelli D (1998) Deﬁ-nition and measurement of crop diversity for economic analysis. In: Smale M (editor) Farmers, Gene Banks and Crop Breeding: Economic Analysis of Diversity in Wheat, Rice and Maize. Dordrecht: Kluwer Academic Publishers, pp. 19–32.","cites":null},{"id":16338359,"title":"for the Protection of New Varieties of Plants; Union Internationale pour la Protection des Obtentions Ve ´ge ´tales","authors":[],"date":"1994","doi":null,"raw":"UPOV (International Union for the Protection of New Varieties of Plants; Union Internationale pour la Protection des Obtentions Ve ´ge ´tales) (1994) International Convention for the Protection of New Varieties of Plants of December 2, 1961 as Revised at Geneva on November 10, 1972, and on October 23, 1978, and on March 19, 1991. Geneva: UPOV. Genetic diversity in UK winter wheat 57","cites":null},{"id":16338327,"title":"Genetic relationships among hard red winter wheat cultivars as evaluated by pedigree analysis and gliadin polyacrylamide gel electrophoretic patterns.","authors":[],"date":"1985","doi":"10.2135\/cropsci1985.0011183x002500060039x","raw":"Cox TS, Lookhart GL, Walker DE, Harrell LG, Albers LD and Rodgers DM (1985) Genetic relationships among hard red winter wheat cultivars as evaluated by pedigree analysis and gliadin polyacrylamide gel electrophoretic patterns.","cites":null},{"id":16338342,"title":"Genetic Resources and Sustainable Agriculture: Creating Incentives for Local Innovation and Adaptation.","authors":[],"date":"1992","doi":null,"raw":"Reid WV (1992) Genetic Resources and Sustainable Agriculture: Creating Incentives for Local Innovation and Adaptation. Biopiracy International No. 2. Nairobi and Maastricht: African Centre for Technology Studies.","cites":null},{"id":16338354,"title":"Global Action for Biodiversity: An International Framework for Implementing the Convention on Biodiversity.","authors":[],"date":"1997","doi":"10.4324\/9781315070810","raw":"Swanson T (1997) Global Action for Biodiversity: An International Framework for Implementing the Convention on Biodiversity. London: Earthscan Publications.","cites":null},{"id":16338321,"title":"International Crop Information System (ICIS) (computer program).","authors":[],"date":"1998","doi":null,"raw":"CIMMYT (1998) International Crop Information System (ICIS) (computer program). Mexico: CIMMYT (International Maize and Wheat Improvement Center).","cites":null},{"id":16338352,"title":"Measuring Biological Diversity. Woods Hole, MA: Woods Hole Oceanographic Institution.","authors":[],"date":"1994","doi":null,"raw":"Solow A and Polasky S (1994) Measuring Biological Diversity. Woods Hole, MA: Woods Hole Oceanographic Institution.","cites":null},{"id":16338334,"title":"Options for Access to Plant Genetic Resources and Equitable Sharing of their Use. Document prepared by the International Plant Genetic Resources Institute for the FAO’s Commission on Genetic Resources for Food and Agriculture.","authors":[],"date":"1996","doi":null,"raw":"FAO (Food and Agriculture Organization) (1996) Options for Access to Plant Genetic Resources and Equitable Sharing of their Use. Document prepared by the International Plant Genetic Resources Institute for the FAO’s Commission on Genetic Resources for Food and Agriculture. CGRFAEX3\/96\/LIM\/2. Rome.","cites":null},{"id":16338330,"title":"Temporal trends in the diversity of UK wheat.","authors":[],"date":"2000","doi":"10.1007\/s001220051370","raw":"Donini P, Law JR, Koebner RMD and Reeves JC (2000) Temporal trends in the diversity of UK wheat. Theoretical and Applied Genetics 100: 912–917.","cites":null},{"id":16338346,"title":"The Green Revolution and wheat genetic diversity: some unfounded assumptions.","authors":[],"date":"1997","doi":"10.1016\/s0305-750x(97)00038-7","raw":"Smale M (1997) The Green Revolution and wheat genetic diversity: some unfounded assumptions. World Development 25: 1257–1269.","cites":null},{"id":16338357,"title":"The rise and fall of public sector plant breeding in the UK: a recursive model of basic and applied research, and diffusion. Agricultural Economics","authors":[],"date":"1998","doi":"10.1016\/s0169-5150(98)00029-2","raw":"Thirtle C, Bottomley P, Palladino P and Schimmelpfennig DE (1998) The rise and fall of public sector plant breeding in the UK: a recursive model of basic and applied research, and diffusion. Agricultural Economics 19(1\/2): 127–143.","cites":null},{"id":16338349,"title":"Understanding global trends in the use of wheat diversity and international ﬂows of wheat genetic resources.","authors":[],"date":"1996","doi":null,"raw":"Smale M and McBride T (1996) Understanding global trends in the use of wheat diversity and international ﬂows of wheat genetic resources. Part 1 of CIMMYT 1995\/96 World Wheat Facts and Trends: Understanding Global Trends in the Use of Wheat Diversity and International Flows of Wheat Genetic Resources. Mexico: CIMMYT.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-04","abstract":"Genealogical data have been used very widely to construct indices with which to examine the contribution of plant breeding programmes to the maintenance and enhancement of genetic resources. In this paper we use such indices to examine changes in the genetic diversity of the winter wheat crop in England and Wales between 1923 and 1995. We find that, except for one period characterized by the dominance of imported varieties, the genetic diversity of the winter wheat crop has been remarkably stable. This agrees with many studies of plant breeding programmes elsewhere. However, underlying the stability of the winter wheat crop is accelerating varietal turnover without any significant diversification of the genetic resources used. Moreover, the changes we observe are more directly attributable to changes in the varietal shares of the area under winter wheat than to the genealogical relationship between the varieties sown. We argue, therefore, that while genealogical indices reflect how well plant breeders have retained and exploited the resources with which they started, these indices suffer from a critical limitation. They do not reflect the proportion of the available range of genetic resources which has been effectively utilized in the breeding programme: complex crosses of a given set of varieties can yield high indices, and yet disguise the loss (or non-utilization) of a large proportion of the available genetic diversity","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69839.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/20901\/1\/download.pdf","pdfHashValue":"50c48930db5ba49bfa480a3b320721c276048642","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:20901<\/identifier><datestamp>\n      2018-01-24T02:35:23Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D44:4441<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Winter Wheat in England and Wales, 1923-1995:What do Indices of Genetic Diversity Reveal?<\/dc:title><dc:creator>\n        Srinivasan, C. S.<\/dc:creator><dc:creator>\n        Thirtle, Colin<\/dc:creator><dc:creator>\n        Palladino, Paolo<\/dc:creator><dc:subject>\n        DA Great Britain<\/dc:subject><dc:description>\n        Genealogical data have been used very widely to construct indices with which to examine the contribution of plant breeding programmes to the maintenance and enhancement of genetic resources. In this paper we use such indices to examine changes in the genetic diversity of the winter wheat crop in England and Wales between 1923 and 1995. We find that, except for one period characterized by the dominance of imported varieties, the genetic diversity of the winter wheat crop has been remarkably stable. This agrees with many studies of plant breeding programmes elsewhere. However, underlying the stability of the winter wheat crop is accelerating varietal turnover without any significant diversification of the genetic resources used. Moreover, the changes we observe are more directly attributable to changes in the varietal shares of the area under winter wheat than to the genealogical relationship between the varieties sown. We argue, therefore, that while genealogical indices reflect how well plant breeders have retained and exploited the resources with which they started, these indices suffer from a critical limitation. They do not reflect the proportion of the available range of genetic resources which has been effectively utilized in the breeding programme: complex crosses of a given set of varieties can yield high indices, and yet disguise the loss (or non-utilization) of a large proportion of the available genetic diversity.<\/dc:description><dc:date>\n        2003-04<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/20901\/1\/download.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1079\/PGR20031<\/dc:relation><dc:identifier>\n        Srinivasan, C. S. and Thirtle, Colin and Palladino, Paolo (2003) Winter Wheat in England and Wales, 1923-1995:What do Indices of Genetic Diversity Reveal? Plant Genetic Resources, 1 (1). pp. 43-57. ISSN 1479-2621<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/20901\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1079\/PGR20031","http:\/\/eprints.lancs.ac.uk\/20901\/"],"year":2003,"topics":["DA Great Britain"],"subject":["Journal Article","PeerReviewed"],"fullText":"Winter wheat in England and Wales,\n1923–1995: what do indices of genetic\ndiversity reveal?\nC. S. Srinivasan1*, Colin Thirtle2 and Paolo Palladino3\n1Department of Agricultural and Food Economics, University of Reading, 2Department of\nEnvironmental Science and Technology, Imperial College of Science, Technology and\nMedicine, University of London and 3Department of History, Lancaster University, UK\nReceived 4 June 2002; Accepted 4 December 2003\nAbstract\nGenealogical data have been used very widely to construct indices with which to examine\nthe contribution of plant breeding programmes to the maintenance and enhancement of\ngenetic resources. In this paper we use such indices to examine changes in the genetic\ndiversity of the winter wheat crop in England and Wales between 1923 and 1995. We\nfind that, except for one period characterized by the dominance of imported varieties,\nthe genetic diversity of the winter wheat crop has been remarkably stable. This agrees\nwith many studies of plant breeding programmes elsewhere. However, underlying the stab-\nility of the winter wheat crop is accelerating varietal turnover without any significant diver-\nsification of the genetic resources used. Moreover, the changes we observe are more\ndirectly attributable to changes in the varietal shares of the area under winter wheat\nthan to the genealogical relationship between the varieties sown. We argue, therefore,\nthat while genealogical indices reflect how well plant breeders have retained and exploited\nthe resources with which they started, these indices suffer from a critical limitation. They\ndo not reflect the proportion of the available range of genetic resources which has been\neffectively utilized in the breeding programme: complex crosses of a given set of varieties\ncan yield high indices, and yet disguise the loss (or non-utilization) of a large proportion of\nthe available genetic diversity.\nKeywords: coefficient of parentage; genetic diversity; plant breeding\nIntroduction\nThe transformation of plant breeding into an organized\nscientific activity over the last 100 years, involving the\npurposive incorporation of desirable traits into new var-\nieties, has produced spectacular successes in terms of\nyield gain for a range of crops (Fuglie et al., 1996;\nThirtle et al., 1998). But the very success of modern\nplant breeding has led to apprehensions about its\npotential adverse impact on the genetic diversity\nwithin farmers’ fields. It could be argued that as farmers\nhave adopted modern varieties over large areas for\neconomic reasons, the genetic uniformity of agricultural\ncrops may have increased considerably and some gen-\netic resources may have been irretrievably lost. Erosion\nof genetic diversity can not only increase the vulner-\nability of agricultural crops to diseases and pests, but\nalso affect the possibilities of developing new resistant\nvarieties in the future.\n* Corresponding author: Department of Agricultural and Food\nEconomics, School of Agriculture, Policy and Development,\nThe University of Reading, Reading RG6 6AR, UK.\nE-mail: aes02css@reading.ac.uk\nq NIAB 2003\nISSN 1479-2621\nPlant Genetic Resources 1(1); 43–57\nDOI: 10.1079\/PGR20031\nModern plant breeding continues to be critically\ndependent on the diversity, continued availability and\nexchange of plant genetic resources (PGR). The key con-\ncern has been that the current thrust toward uniformity\ncould undermine these critical resources (FAO, 1996;\nSwanson, 1997). One important reason for this concern\nis that the purposive incorporation of genetic diversity\nin new varieties requires the evaluation and screening\nof a large range of exotic germplasm. The development\nof genebanks with large collections of germplasm may\nimprove the availability of material for plant breeders.\nAt the same time, however, the time and costs associated\nwith evaluation and the pressures for quicker develop-\nment of new varieties may lead breeders to choose\nfrom a narrower range of tried and tested, ‘elite’ germ-\nplasm and consequently to the loss of unused genetic\nresources. Such loss could also be accentuated by the\nintroduction of intellectual property rights (IPRs) for\nplant varieties in the following ways:\n(i) Plant variety protection (PVP) systems stipulate that\na new variety must be phenotypically ‘distinct’ from\nall other varieties in respect of one or more ‘import-\nant’ characteristics. Since the kind of differentiation\nthat is required for protection is not precisely speci-\nfied, it may lead breeders to resort to minimal differ-\nentiation, i.e. to ‘cosmetic’ breeding of elite\ngermplasm.1 Cosmetic breeding could be used to\nundermine the protection afforded by PVP to a\nleading variety. Berlan and Lewontin (1986) argue\nthat product differentiation through creation and\nsale of proprietary varieties is essential if seed com-\npanies are to remain competitive. In such a situ-\nation, the increase in the number of varieties\noffered for sale after PVP may not be an adequate\nmeasure of the increasing agronomic value of var-\nieties, because, meanwhile, the objective of bree-\nders has shifted from increasing farm productivity\nto that of ‘giving sales arguments to the marketing\ndepartments of seed companies’ (1986, p. 787). Cos-\nmetic breeding could lead to a portfolio of varieties\nnot significantly distinct from one another in terms\nof their genetic composition.\n(ii) PVP systems specify that a new variety must be ‘uni-\nform’ and ‘stable’ in order to qualify for protection.\nA plant variety innovation need not be necessarily\nuniform or stable in order to be economically\nuseful. However, if IPRs are to be applied to plant\nvarieties, they must be ‘identifiable’, i.e. distinguish-\nable from other varieties. The uniformity and stab-\nility criteria are intended to facilitate identifiability.\nTherefore, the administrative requirement of iden-\ntifiability in IPR systems creates an incentive for\nbreeding uniform varieties that do not exhibit sig-\nnificant variations over repeated cycles of\npropagation.\n(iii) Institutional changes in plant breeding have tended\nto favour ‘centralized crop breeding’ (Reid, 1992).\nIPRs enhance incentives to develop varieties that\nwill have a large potential demand. To ensure maxi-\nmum demand for their varieties, seed companies\nwill tend to focus their research on commonly uti-\nlized high-value crops and develop varieties that\ncan be cultivated as widely as possible. To do so\nmeans breeding through selection of genes for\nmaximum adaptability while introducing new var-\nieties. This IPR-supported bias toward centralized\ncrop breeding could lead to biodiversity erosion\nthrough (i) decreased crop diversity and (ii)\ndecreased spatial diversity. Temporal diversity\ncould, however, increase if varieties are replaced\nevery few years.\nThe argument that modern plant breeding reduces\ngenetic diversity has been challenged. Smale (1997) has\nquestioned the assertion that modern wheat breeding\ncauses genetic narrowing, arguing that no causal relation-\nship between the green revolution and genetic erosion\ncan be established for bread wheat given the difficulties\nof measuring genetic erosion and demonstrating causal-\nity. The pattern of genetic variation in farmers’ wheat\nfields has undoubtedly changed over the past 100–120\nyears with increasing cultivation of varieties released by\nplant breeding programmes, but the implications of\nthese changes for the scarcity of useful genetic resources\nare unclear. Modern varieties have very complex pedi-\ngrees and incorporate germplasm from a very diverse\nrange of sources often spread across several continents.\nSmale presents some evidence, using different indicators\nof genetic diversity that the genetic diversity of CIMMYT-\nrelated (International Maize and Wheat Improvement\nCenter) wheats has increased since the early years of\nthe green revolution.\nIn this paper, we examine the diversity of winter wheat\nvarieties in England and Wales between 1923 and 1995\nusing the same kind of indices. The beginning of this\nperiod corresponds with the establishment of the\n1 The criterion of distinctness under PVP should normally promote\ngreater differentiation between varieties. However, the incentives for\ncosmetic breeding arise from the fact that under PVP laws a variety,\nwhich is only marginally distinct from another variety, can qualify as\na new variety in its own right and be protected. This allows the\nbreeder of the ‘new’ variety to appropriate returns from the original\ninnovation without much effort. The provisions relating to essentially\nderived varieties in the UPOV (1991) Convention (UPOV, 1994) are\ndesigned to discourage cosmetic breeding. But a clear technical\ndefinition of what constitutes an essentially derived variety is yet to\nemerge and these provisions are yet to be applied in practice.\nC. S. Srinivasan et al.44\nNational Institute of Agricultural Botany (NIAB; 1919) and\nthe collection of data on variety performance and\nnational distribution. It also corresponds with the estab-\nlishment of a more coherent national policy for a\nnumber of important plant breeding institutions, the\nJohn Innes Horticultural Institute (1910), the Plant Breed-\ning Institute (1912) and the Welsh Plant Breeding Station\n(1919) (Thirtle et al., 1998). A major landmark came in\n1964 when the UK enacted Plant Variety Protection legis-\nlation following its membership of the UPOV Conven-\ntion. The scope for protection of intellectual property in\nplant varieties altered the incentives under which public\nplant breeding institutions worked. These changes may\nhave been accentuated in the 1980s by the declining bud-\ngetary support for plant breeding institutions, forcing\nthem to look upon IPRs as sources of revenue. At the\nsame time, the UK’s membership of the European\nUnion and adherence to European seed marketing regu-\nlations (national listing, EU-wide listing, etc.) provided\nopportunities for the better exploitation and enforcement\nof IPRs.2 Therefore, the trends examined in this paper\nwill also indicate the impact of these institutional changes\non genetic diversity.\nMethods of measuring diversity\nOne of the simplest measures of genetic diversity is the\nnumber of varieties in existence in a given geographi-\ncal area at a given point in time. Such a measure\ndoes not take into account the relative abundance of\nindividual varieties. If one variety is grown over a rela-\ntively large area, while several others are confined to\nsmall plots, then the count of varieties does not really\ncapture diversity. It may be more useful to count the\nnumber of varieties that account for a given proportion\nof the total area under a crop. But even such a\nmeasure does not really capture diversity because the\ngenetic relationship between varieties may be very\nclose. It may be still more useful to include genealogi-\ncal information.\nA coefficient of parentage (COP) is an indicator that\nuses pedigrees to estimate the extent of genetic similarity\nbetween two varieties. The COP between two varieties is\ndefined as the probability that a random allele at a\nrandom locus in one individual is identical by descent\nto a random allele at the same locus in the other individ-\nual (Cox et al., 1985). It is a pair-wise comparison and its\ncomputation requires detailed pedigrees of all varieties.\nIn the common algorithms used to compute COP\nvalues (r), the following assumptions are generally\nmade: (i) the original ancestors of the cultivar variety\nare unrelated ðr ¼ 0Þ; (ii) a cultivar obtains equal genetic\ncontributions from its parents; (iii) all ancestors and par-\nental lines are homozygous and homogeneous; (iv) the\nCOP between a selection from a cultivar and the cultivar\nis 0.75; (v) the COP between two selections from the\nsame cultivar is ð0:75Þ2 ¼ 0:56; (vi) the COP of a cultivar\nwith itself is 1.\nThe above assumptions are restrictive and arbitrary.\nThe consequent limitations of the COP measure are\nwell understood. For instance, the assumption that the\noriginal ancestors of the cultivars are unrelated may not\nbe correct from a biological point of view and may\ntend to bias the COP downward. The assumption that\neach parent contributes equally to the genetic make-up\nof the offspring may distort the genetic relationship\nbetween varieties. The impact of recurrent selection on\nallele frequencies in genotypes may not be adequately\ncaptured by the rule-of-thumb adopted. Besides, the\ngenetic composition of a variety itself may not be stable\nover time owing to random genetic drift3 (Meng et al.,\n1998). Despite these limitations COPs have been used\nextensively in the economic analysis of diversity. With\nthe advent of molecular methods, it is possible to esti-\nmate more precisely the degree of relatedness of ances-\ntors and the contribution of parents to the offspring.\nThis holds out the promise that, eventually, measures of\ndiversity based on COPs will overcome many of these\ndifficulties.\nIn an economic analysis of diversity, the coefficient of\ndiversity is calculated as 1 2 COP. However, the COP is a\npair-wise measure and analysis of diversity at the crop\nlevel requires the aggregation of pair-wise COPs into an\naverage COP measure for all varieties. The method\nused to arrive at an average COP from the pair-wise\nvalues depends on the purpose for which it is to be\nused. To assess the progress of breeding programmes\nin incorporating genetic diversity, a simple average of\nthe elements of the COP matrix may be sufficient. Such\nan average will indicate how closely related the varieties\nare and 1 2 average COP (1 2 ACOP) will be a corre-\nsponding indicator of diversity. It must be noted that\nsuch a measure will yield a positive value (1\/n where n\nis the number of varieties) even when all the varieties\nare completely unrelated.4 According to Solow and\nPolasky (1994), any measure of diversity should possess\n2 Berlan and Lewontin (1986) argue that the ‘catalogue’ and ‘seed\ncertification’, the two pillars of the European seed regulatory system,\nprovide de facto appropriability for breeders even in the absence of\nformal PVP systems.\n3 Changes in the genetic composition of a variety over time would,\nhowever, not affect the calculation of COPs.\n4 To overcome the problem of a positive value of average COP even\nwhen all the varieties are unrelated, the average of the off-diagonal\nelements of the COP matrix could be taken.\nGenetic diversity in UK winter wheat 45\nthe following fundamental properties: (i) diversity should\nnot be decreased by the addition of a variety; (ii) diversity\nshould not increase when we add a variety identical to\none already included in the set; and (iii) diversity\nshould not be decreased by increasing the genetic dis-\ntance between varieties.\nSolow and Polasky (1994) have proposed an index of\nspecies diversity based on the notion of genetic distance\nthat fulfils these three criteria. Their measure can be cal-\nculated as:\nV ðSÞ ¼ e0F 21e\nwhere V(S) is a measure of diversity of a set of varieties S;\nV(S) is a function of F, a matrix of pair-wise distances and\ne is a vector of 1 s. Larger values of F imply greater diver-\nsity. The matrix is made up of pair-wise coefficients fjk\ncontained in the interval (0,1).\nfjk ¼ CorrðI j ; I kÞ ¼ f ðdjkÞ\nwhere j, k index the varieties in the pairing.\nThe elements of the correlation matrix can be inter-\npreted as the probability that two varieties share the\nsame characteristics. The pair-wise COP values have\nbeen used as the fjk to compute the Solow-Polasky\nindex for the set of English and Welsh wheat varieties.\nThe above measures, however, will not reflect the\ndiversity in farmers’ fields as they do not take into\naccount the differential adoption of varieties by farmers.\nSome varieties developed by breeding programmes may\nnot be adopted at all by farmers, while some others\nmay have a dominant share of the market in certain\nyears. The diversity seen on farmers’ fields may be\nvery different from the diversity within the set of var-\nieties developed by the breeding programmes. To\nreflect diversity on farmers’ fields, it is necessary to\nuse a weighting scheme that takes into account the\nadoption of varieties by farmers. Several alternative\nweighting schemes are possible. The one which is\nmost commonly used is a scheme based on the acreage\nunder each variety. The area-weighted average COP is\ncomputed as:\nW:COP ¼ a 0Xa\nwhere a0 is an n £ 1 vector of area shares ðSai ¼ 1Þ and\nX is a n £ n matrix of pair-wise COPs for n varieties\nunder consideration. The expression for the average\nCOP can be expanded as:\nW:COP ¼\nXn\n1\na2i COPði; iÞ þ\nXn\ni¼1\naiajCOPði; jÞ\nwhere i, j index varieties and i – j\n¼\nXn\n1\na2i þ\nXn\ni¼1\naiajCOPði; jÞ\nas COPði; iÞ ¼ 1:\nThe W.COP can, thus, be seen as the sum of two com-\nponents—the first component (Sai\n2) reflects the impact of\nthe proportion of area sown to different varieties and the\nsecond component (Saiaj COP(i, j)) is nothing but the\nsum of the pair-wise COPs weighted by the product of\nthe respective area shares. For n varieties, the lowest\ntheoretical value of the first component (1\/n) is reached\nwhen all the varieties are equally distributed (i.e. all the ai\nvalues are equal). As we move away from a uniform dis-\ntribution of varieties, the value of Sai\n2 increases (reaching\na maximum value of 1 when just one variety covers the\nentire area) and correspondingly the measure of diversity\ndecreases.\nThe W.COP takes into account the loss of diversity due\nto varieties not being evenly distributed and this in turn\ncan be attributed to the various economic and social fac-\ntors that influence the adoption of different varieties by\nfarmers. It has, however, the important disadvantage\nthat the ‘area effect’ due to the distribution of varieties\ncan dominate the effect due to the genetic similarity or\ndissimilarity between varieties. When there are a limited\nnumber of varieties in cultivation and their distribution\nis uneven (e.g. one or two cultivars dominate the total\narea), then the value of the W.COP index is not very\ndifferent from the value which would obtain if we were\nto simply assume that all the varieties were completely\nunrelated (all the pair-wise COPs are zero). In this\nsituation, the W.COP index tells us very little about the\ngenetic similarity or dissimilarities between varieties and\nneeds to be interpreted carefully.\nThe genetic diversity of winter wheat varieties in\nEngland and Wales between 1923 and 1995 has been\nassessed in this paper using the following indices:\n(i) the simple average of all the pair-wise COPs\n(ACOP); (ii) the average of the pair-wise COP of the\ntop five varieties in each year (ACOP(5)); (iii) the\nSolow-Polasky index; and (iv) the area-weighted average\nCOP (W.COP).\nData\nGenealogical information on all varieties was collected\nfrom various NIAB publications (Classified List of Cereal\nVarieties; Varieties in Trials; Cereal Variety Handbook—\nvarious years). The pair-wise COPs were computed\nusing the International Crop Improvement System\n(ICIS) software program developed by CIMMYT\n(CIMMYT, 1998). The acreage under different varieties\nfor each of the years (1923–1995) has been estimated\nfrom seed certification data, occasionally published infor-\nmation and data provided by NIAB and the Home Grown\nCereals Authority.\nC. S. Srinivasan et al.46\nResults and discussion\nVariety counts\nThe number of varieties in each year since 1923 that\naccounted for 1% or more of the total area under wheat\nis shown in Fig. 1. The number of leading varieties,\nwhich together accounted for more than 50% of the\ntotal area, is also shown alongside. For the 73-year\nperiod as a whole, farmers in England and Wales used\nan average of 12 varieties each year. The variety count\nranged from a high of 20 in 1944 to a low of three in\n1959. However, the high average of 12 varieties masks\nthe fact that the number of leading varieties accounting\nfor more than 50% of the area moved in a narrow\nrange of one to four. For 10 years, from 1957 to 1967,\njust one variety, ‘Cappelle Desprez’, accounted for more\nthan 50% of the area. Starting with a portfolio of locally\nbred varieties in the 1920s, some of which survived for\nan extraordinary length of time, their numbers increased\nwith the introduction of French varieties in the 1930s and\nthe 1940s. As the French varieties became dominant, they\nalmost completely displaced the locally bred ones and\nthe number of varieties used by farmers declined sharply.\nThis unevenness in the distribution of varieties over\nthe years has had a significant impact on the indices of\ngenetic diversity. The decline was reversed only after\nthe mid-1960s, almost coinciding with the introduction\nin 1964 of plant variety protection. From then on, the\nturnover of wheat varieties accelerated and varieties\nbred by the Plant Breeding Institute (e.g. ‘Maris Hunts-\nman’) acquired significant market shares.\nIndices of genetic diversity\nThe four COP measures are shown in Table 1. The indi-\nces of diversity based on the simple average COP of all\npairs of varieties, the average COP of five leading var-\nieties and the Solow-Polasky index are plotted in Fig. 2,\nwhile the diversity measure based on area-weighted aver-\nage COP is plotted in Fig. 3. For purposes of comparison\nwith other indices whose values lie between 0 and 1\nthe values of the Solow-Polasky index have been divided\nby 10.5\nThe most remarkable feature of all the indices of genetic\ndiversity is the stability they exhibit over a period of 73\nyears. The indices that reflect breeding progress (ACOP\nand ACOP(5)) move in a narrow range of 0.6–0.85.\nFig. 1. Count of UK wheat varieties.\n5 Our main interest here is in the variability of the genetic diversity\nindices over time. Unlike the other indices whose values lie always\nbetween 0 and 1, the values of the Solow-Polasky index can be\ngreater than 1 (see Table 1).\nGenetic diversity in UK winter wheat 47\nTable 1. COP measures and Solow-Polasky index\nYear ACOP ACOP(5)\nSolow-Polasky\nindex W.COP\nContribution of\nvariety distribution\nto W.COP (%)\n1923 0.1560 0.2950 7.9328 0.2505 65.62\n1924 0.1590 0.2950 6.9135 0.2627 65.98\n1925 0.1270 0.2950 8.6892 0.2394 67.02\n1926 0.1141 0.2950 10.6904 0.2356 65.57\n1927 0.1361 0.2950 10.1657 0.2441 61.40\n1928 0.1477 0.2950 7.9574 0.2675 63.69\n1929 0.1687 0.2950 6.9574 0.2869 63.66\n1930 0.1704 0.2950 7.1578 0.2605 62.13\n1931 0.2298 0.2950 5.1578 0.2742 61.03\n1932 0.2022 0.2950 5.5575 0.2576 60.00\n1933 0.1737 0.2950 6.5574 0.2645 59.24\n1934 0.1818 0.3851 6.9574 0.2732 57.21\n1935 0.1886 0.3851 7.5574 0.2561 47.67\n1936 0.2128 0.3851 6.5574 0.2554 47.26\n1937 0.2128 0.3851 6.5574 0.2483 47.32\n1938 0.2747 0.3851 4.7128 0.2639 45.65\n1939 0.1918 0.3851 6.9791 0.2400 44.70\n1940 0.1610 0.3151 8.4296 0.2192 44.08\n1941 0.1396 0.3851 10.2450 0.2174 40.77\n1942 0.1242 0.3151 11.0312 0.1972 41.34\n1943 0.1236 0.3151 11.1213 0.1760 41.79\n1944 0.1183 0.3150 11.3055 0.1598 42.72\n1945 0.1224 0.3150 11.0846 0.1599 43.23\n1946 0.1445 0.2750 9.9617 0.1668 42.96\n1947 0.1377 0.1994 8.9255 0.1504 48.37\n1948 0.1651 0.3150 8.9255 0.1589 46.13\n1949 0.1373 0.2763 9.4790 0.1706 46.11\n1950 0.1788 0.2763 8.6995 0.1577 50.59\n1951 0.1646 0.2413 7.6170 0.1499 56.51\n1952 0.1795 0.3299 7.2770 0.1499 58.38\n1953 0.1680 0.2634 7.5418 0.1554 63.87\n1954 0.1728 0.2334 7.1620 0.1530 60.45\n1955 0.1720 0.3082 6.9454 0.1674 71.95\n1956 0.1544 0.3032 7.0816 0.2003 89.02\n1957 0.2224 0.2225 4.5118 0.3852 97.29\n1958 0.2286 0.2834 4.5891 0.6617 98.66\n1959 0.4680 0.4680 2.2397 0.7745 97.72\n1960 0.2696 0.2696 3.7180 0.6630 97.80\n1961 0.3021 0.3021 3.3412 0.5110 90.26\n1962 0.2798 0.2799 3.5855 0.6465 96.44\n1963 0.2001 0.2379 5.0724 0.6555 94.58\n1964 0.2440 0.2482 4.2949 0.6885 92.60\n1965 0.2992 0.2992 3.4934 0.7206 90.46\n1966 0.2768 0.2769 3.8046 0.5504 92.65\n1967 0.3701 0.3701 2.8046 0.6969 84.99\n1968 0.3286 0.4437 3.6552 0.6093 64.13\n1969 0.3901 0.4411 3.1305 0.5326 48.15\n1970 0.4126 0.4411 2.7970 0.5050 44.69\n1971 0.3135 0.4411 4.0572 0.4602 44.37\n1972 0.2405 0.3631 5.9967 0.3852 43.69\n1973 0.2364 0.4361 6.1916 0.3317 47.95\n1974 0.2268 0.3299 6.3038 0.2848 51.26\n1975 0.2301 0.2855 6.4904 0.3061 60.44\n1976 0.1786 0.3162 8.2846 0.2623 64.13\n1977 0.1547 0.2914 7.5765 0.2518 69.02\n1978 0.1416 0.2871 8.4341 0.2319 64.94\n1979 0.1658 0.2819 6.8127 0.2231 58.08\n1980 0.1526 0.2704 7.6553 0.1949 54.93\n1981 0.1384 0.2762 8.4265 0.2115 82.53\nC. S. Srinivasan et al.48\nThe simple average COP of the top five varieties shows\neven greater stability, reflecting the fact that for long\nstretches of time the portfolio of top varieties did not\nchange at all. These trends provide no support for the\nview that modern plant breeding has led to a relative\ndecline in genetic diversity. There is also no suggestion\nof a structural change following the introduction of plant\nvariety rights. Thus, there is no reason to believe that\nvarieties bred under the incentive of plant variety rights\nincorporate less genetic diversity than their predecessors.\nThe recovery of genetic diversity indices after the\nmid-1960s (following their sharp fall in the 1950s) can be\nattributed to the large number of new varieties developed\nby public research institutions that acquired\nsubstantial market shares. It could, therefore, be argued\nthat the institutional changes of the 1960s contributed to\nFig. 2. Indices of genetic diversity breeding progress.\nTable 1. Continued.\nYear ACOP ACOP(5)\nSolow-Polasky\nindex W.COP\nContribution of\nvariety distribution\nto W.COP (%)\n1982 0.1580 0.2850 7.6519 0.1843 72.02\n1983 0.1472 0.3265 8.1130 0.1913 63.77\n1984 0.1303 0.2900 8.7222 0.1903 59.08\n1985 0.1333 0.2811 9.1461 0.1801 66.03\n1986 0.1682 0.2861 7.1395 0.1926 56.09\n1987 0.1856 0.2699 6.4807 0.2184 70.26\n1988 0.1468 0.2059 7.5510 0.1794 84.13\n1989 0.1353 0.2333 8.8873 0.1636 78.93\n1990 0.1710 0.2666 7.5462 0.1839 58.67\n1991 0.1691 0.2742 7.1215 0.2073 60.50\n1992 0.1678 0.3288 7.0760 0.2543 62.58\n1993 0.1430 0.2699 8.9783 0.1909 50.03\n1994 0.1515 0.3305 8.4256 0.2106 51.33\n1995 0.1767 0.3989 7.1833 0.2893 50.69\nGenetic diversity in UK winter wheat 49\narresting the decline in genetic diversity witnessed\npreviously.\nHowever, when we look at the indices of diversity in\nfarmers’ fields, we find a dramatic decline in diversity\nindices from the late 1940s to the early 1970s. This\ndecline in diversity is not really due to the varieties in\nuse being more closely related, but is instead due to\nthe dominance of one or two varieties and the conse-\nquent decline in the number of varieties used by farmers.\nThe diversity made available by the breeding programme\nwas not reflected on farmers’ fields as farmers chose to\nuse only a limited number of varieties. The Solow-\nPolasky index which is sensitive to the number of\nvarieties in the set, and the area-weighted 12W.COP\nindex both registered a sharp decline during this\nperiod. The last column of Table 1 shows the contri-\nbution of the ‘area effect’ to the 12W.COP index. This\nshows that when the number of varieties is small (e.g.\nless than five) the ‘area effect’ tends to dominate the\nindex. That is, in this situation the value of the index is\ndetermined mainly by the evenness of distribution of var-\nieties rather than by the degree of relatedness between\nvarieties.\nImportantly, the indices discussed above measure the\ndiversity within the set of varieties for each year. What\nthese indices track is the diversity retained in new\nvarieties relative to the diversity available in the original\nset of ancestors. These indices give a fairly good idea\nof the extent to which breeders have retained and\nexploited the diversity in the original set of ancestors.\nThey do not, however, indicate the extent to which the\noverall diversity available for a crop species has been\nexploited. Starting with a given set of varieties, it may\nbe possible to maintain diversity by simply forming few\ncomplex combinations using a large number of those var-\nieties but this may represent the exploitation of only a\nsmall proportion of the available diversity for the crop.\nMoreover, these indices provide no clue about the\nsources of germplasm (and its diversification). To assess\nthe extent of diversification of genetic resources, we\nneed to look at the relationship between varietal turnover\nand genetic diversity and analyse the pedigrees in terms\nof sources.\nVarietal turnover\nThe rate of turnover of varieties can be an important\ndeterminant of genetic diversity over time. If new var-\nieties replace older varieties more quickly, and the new\nvarieties incorporate more diverse sources of germ-\nplasm, then the temporal diversity of the portfolio of\nFig. 3. Indices of genetic diversity on farmers’ fields.\nC. S. Srinivasan et al.50\nvarieties can be expected to increase. The relationship\nbetween the turnover of varieties and genetic diversity\ncan provide important pointers to the strategies fol-\nlowed by the breeding programme. The number of\nyears for which different varieties survived is shown\nin Fig. 4. In Fig. 46 the varieties are arranged according\nto the year in which they first appeared in the portfolio\nof varieties.\nFigure 4 reveals a dramatic decline in the survival of\nvarieties. Starting in 1923 with varieties like ‘Squarehead\nMaster’ and ‘Yeoman’ which survived for 35–40 years,\nthe average number of years for which a variety survives\nhas declined to less than 5 years in recent times. This\ntrend is especially evident since the mid-1960s. This\ndramatic increase in the rate of turnover of varieties is\nreflected in the declining average age of the varietal port-\nfolio (weighted average age of varieties in cultivation in\nany given year, with the share in acreage of each variety\nFig. 4. Survival patterns of UK wheat varieties.\n6 The data set on acreage shares spans the period 1923–1995. In\nFig. 4, varieties which appeared in the National List up to 1991 are\nshown. In the case of recent varieties, which had not completed\ntheir commercial life by 1995, there is a downward bias in the\nnumber of years of survival. However, this affects only a limited\nnumber of varieties and does not alter the conclusion that recent\nvarieties tend to survive for a much shorter time than the varieties of\nthe 1940s, 1950s or 1960s.\nGenetic diversity in UK winter wheat 51\nbeing the weights), which has declined from about 14\nyears in the 1940s to 4 years in the 1990s (Fig. 5). Farmers\nhave had access to a large number of quickly turning-\nover new varieties since the mid-1960s.\nIt is noticeable that a more rapid turnover of\nvarieties has not been associated with an increase in\ngenetic diversity. This, however, provides no support to\nthe argument that the large number of varieties devel-\noped in the post-PVP period mainly represents product\ndifferentiation by seed companies through ‘cosmetic\nbreeding’. If the varietal portfolio had a large number\nof varieties that were only marginally different from one\nanother, then indices of genetic diversity based on gen-\nealogy would have certainly declined sharply. This has\nnot been the case. It must also be noted that in the UK\nand other EU countries, new varieties can be marketed\nonly if they are entered in the national catalogue after\nbeing tested for ‘Value in Cultivation and Use’ (VCU).\nTherefore, while a variety may become eligible for pro-\ntection on the basis of (marginal) ‘distinctness’ it is unli-\nkely to find a place in the national catalogue unless it\nalso demonstrates some agronomic superiority or advan-\ntage. However, the stability of the indices in the context\nof a rapid turnover of varieties also indicates that the\nnewer varieties developed since the 1960s have relied\non a relatively unchanging parental pool. To put it differ-\nently, while newer varieties have been produced through\nnovel combinations of a given set of parental varieties,\nthere has been relatively limited introduction of new\nand hitherto unexploited material into the breeding\nprogramme. This suggests a lack of diversification in\nthe sources of germplasm used.\nWhether the lack of diversification of sources of germ-\nplasm was due to limited access to new sources of germ-\nplasm can be established by analysing the geographical\nprovenance of parental varieties (and germplasm). It\nmust be noted here that such an analysis, if based only\non the immediate parents, may give a misleading picture.\nFor instance, if a variety has two French parents it would\nbe wrong to conclude that the variety is based on French\nmaterial. The French parents may themselves incorporate\nmaterial from very diverse sources. Therefore, it is\nnecessary to go back several generations to assess the\ndiversity of the sources of germplasm incorporated in a\nvariety.7 Such an analysis has been attempted for\nthe winter wheats in England and Wales in Table 2.\nFig. 5. Average age of UK wheat varieties.\n7 On the other hand, it is not very useful to go back too many\ngenerations as the contribution of unknown varieties then becomes\nlarge and confounding.\nC. S. Srinivasan et al.52\nT\nab\nle\n2.\nC\no\nn\ntr\nib\nu\nti\no\nn\no\nf\nd\nif\nfe\nre\nn\nt\nso\nu\nrc\nes\no\nf\nge\nrm\np\nla\nsm\nto\nle\nad\nin\ng\nU\nK\nw\nh\nea\nt\nva\nri\net\nie\ns\n(c\no\nn\ntr\nib\nu\nti\no\nn\no\nf\nso\nu\nrc\ne\nco\nu\nn\ntr\nie\ns\nin\n%\n)\n(a\n)\nEx\np\nan\nsi\no\nn\nle\nve\nl\n1\nV\nar\nie\nti\nes\nC\no\nu\nn\ntr\ny\no\nf\np\nar\nen\nt\nA\np\no\nll\no\nA\nva\nlo\nn\nB\ner\nse\ne\nB\no\nu\nn\nty\nC\nap\np\nel\nle\nD\nes\np\nre\nz\nG\nal\nah\nad\nH\no\nld\nfa\nst\nH\nyb\nri\nd\n4\n6\nM\nar\nis\nH\nu\nn\nts\nm\nan\nM\ner\nci\na\nM\nis\nsi\no\nn\nN\no\nrm\nan\nR\nib\nan\nd\nSl\nep\njn\ner\nA\nv.\nco\nn\ntr\nib\n.\nU\nK\n5\n0\n5\n0\n5\n0\n5\n0\n1\n0\n0\n5\n0\n1\n0\n0\n5\n0\n3\n5\n.7\n1\nFr\nan\nce\n1\n0\n0\n5\n0\n5\n0\n5\n0\n1\n7\n.8\n6\nC\nIM\nM\nY\nTa\n5\n0\n5\n0\n5\n0\n1\n0\n.7\n1\nU\nK\n\/F\nra\nn\nce\nb\n5\n0\n5\n0\n5\n0\n1\n0\n.7\n1\nC\nan\nad\na\n5\n0\n5\n0\n7\n.1\n4\nG\ner\nm\nan\ny\n5\n0\n3\n.5\n7\nU\nSA\n\/F\nra\nn\nce\n5\n0\n3\n.5\n7\nP\no\nla\nn\nd\n5\n0\n3\n.5\n7\nB\nel\ngi\nu\nm\n5\n0\n3\n.5\n7\nN\no\nt\nkn\no\nw\nn\n5\n0\n3\n.5\n7\nG\nra\nn\nd\nto\nta\nl\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n(b\n)\nEx\np\nan\nsi\no\nn\nle\nve\nl\n2\nV\nar\nie\nti\nes\nC\no\nu\nn\ntr\ny\no\nf\np\nar\nen\nt\nA\np\no\nll\no\nB\ner\nse\ne\nC\nap\np\nel\nle\nD\nes\np\nre\nz\nG\nal\nah\nad\nH\no\nld\nfa\nst\nH\nyb\nri\nd\n4\n6\nM\nar\nis\nH\nu\nn\nts\nm\nan\nM\ner\nci\na\nN\no\nrm\nan\nR\nib\nan\nd\nA\nv.\nco\nn\ntr\nib\n.\nC\nIM\nM\nY\nT\n7\n5\n1\n0\n0\n5\n0\n5\n0\n2\n7\n.5\nFr\nan\nce\n5\n0\n7\n5\n7\n5\n2\n5\n2\n2\n.5\nU\nK\n2\n5\n2\n5\n2\n5\n2\n5\n2\n5\n7\n5\n2\n0\nU\nK\n\/F\nra\nn\nce\n2\n5\n2\n5\n2\n5\n7\n.5\nC\nan\nad\na\n2\n5\n5\n0\n7\n.5\nG\ner\nm\nan\ny\n2\n5\n2\n.5\nU\nSA\n\/F\nra\nn\nce\n2\n5\n2\n.5\nN\no\nt\nkn\no\nw\nn\n5\n0\n5\n0\n1\n0\nG\nra\nn\nd\nto\nta\nl\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\nGenetic diversity in UK winter wheat 53\nT\nab\nle\n2.\nC\no\nn\nti\nn\nu\ned\n.\n(c\n)\nEx\np\nan\nsi\no\nn\nle\nve\nl\n3\nC\no\nu\nn\ntr\ny\no\nf\np\nar\nen\nt\nV\nar\nie\nti\nes\nA\np\no\nll\no\nB\ner\nse\ne\nC\nap\np\nel\nle\nD\nes\np\nre\nz\nG\nal\nah\nad\nH\no\nld\nfa\nst\nH\nyb\nri\nd\n4\n6\nM\nar\nis\nH\nu\nn\nts\nm\nan\nM\ner\nci\na\nN\no\nrm\nan\nR\nib\nan\nd\nSl\nep\njn\ner\nA\nv.\nco\nn\ntr\nib\n.\nFr\nan\nce\n1\n2\n.5\n6\n2\n.5\n5\n0\n1\n2\n.5\n1\n2\n.5\n2\n5\n5\n0\n1\n2\n.5\n2\n1\n.5\n9\nC\nIM\nM\nY\nT\n1\n2\n.5\n5\n0\n2\n5\n1\n2\n.5\n1\n2\n.5\n2\n5\n1\n2\n.5\n0\nU\nK\n1\n2\n.5\n2\n5\n2\n5\n1\n2\n.5\n2\n5\n1\n2\n.5\n1\n2\n.5\n1\n1\n.3\n6\nB\nel\ngi\nu\nm\n1\n2\n.5\n1\n2\n.5\n2\n5\n1\n2\n.5\n1\n2\n.5\n1\n2\n.5\n7\n.9\n5\nN\net\nh\ner\nla\nn\nd\ns\n6\n2\n.5\n5\n.6\n8\nU\nSA\n2\n5\n1\n2\n.5\n3\n.4\n1\nU\nK\n\/F\nra\nn\nce\n1\n2\n.5\n1\n2\n.5\n2\n.2\n7\nG\ner\nm\nan\ny\n1\n2\n.5\n1\n2\n.5\n2\n.2\n7\nU\nSA\n\/F\nra\nn\nce\n1\n2\n.5\n1\n2\n.5\n2\n.2\n7\nC\nan\nad\na\n1\n2\n.5\n1\n2\n.5\n2\n.2\n7\nU\nSS\nR\n1\n2\n.5\n1\n.1\n4\nN\no\nt\nkn\no\nw\nn\n1\n2\n.5\n3\n7\n.5\n2\n5\n1\n0\n0\n2\n5\n2\n5\n5\n0\n2\n5\n2\n7\n.2\n7\nG\nra\nn\nd\nto\nta\nl\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n(d\n)\nEx\np\nan\nsi\no\nn\nle\nve\nl\n4\nC\no\nu\nn\ntr\ny\no\nf\np\nar\nen\nt\nV\nar\nie\nti\nes\nA\np\no\nll\no\nB\ner\nse\ne\nC\nap\np\nel\nle\nD\nes\np\nre\nz\nG\nal\nah\nad\nH\nyb\nri\nd\n4\n6\nM\nar\nis\nH\nu\nn\nts\nm\nan\nN\no\nrm\nan\nR\nib\nan\nd\nSl\nep\njn\ner\nA\nv.\nco\nn\ntr\nib\n.\nFr\nan\nce\n1\n2\n.5\n2\n5\n9\n3\n.7\n5\n2\n5\n6\n.2\n5\n3\n1\n.2\n5\n6\n.2\n5\n6\n.2\n5\n2\n2\n.9\n2\nU\nK\n2\n5\n1\n2\n.5\n1\n8\n.7\n5\n2\n5\n1\n2\n.5\n1\n2\n.5\n1\n1\n.8\n1\nC\nIM\nM\nY\nT\n1\n8\n.7\n5\n1\n8\n.7\n5\n6\n.2\n5\n1\n2\n.5\n1\n8\n.7\n5\n1\n2\n.5\n9\n.7\n2\nN\net\nh\ner\nla\nn\nd\ns\n6\n2\n.5\n6\n.9\n4\nU\nSA\n6\n.2\n5\n6\n.2\n5\n1\n2\n.5\n6\n.2\n5\n3\n.4\n7\nU\nK\n\/F\nra\nn\nce\n6\n.2\n5\n6\n.2\n5\n6\n.2\n5\n6\n.2\n5\n2\n.7\n8\nC\nan\nad\na\n6\n.2\n5\n1\n2\n.5\n2\n.0\n8\nG\ner\nm\nan\ny\n6\n.2\n5\n6\n.2\n5\n1\n.3\n9\nU\nSA\n\/F\nra\nn\nce\n6\n.2\n5\n6\n.2\n5\n1\n.3\n9\nB\nel\ngi\nu\nm\n1\n2\n.5\n1\n.3\n9\nJa\np\nan\n6\n.2\n5\n0\n.6\n9\nIt\nal\ny\n6\n.2\n5\n0\n.6\n9\nIn\nd\nia\n6\n.2\n5\n0\n.6\n9\nSw\ned\nen\n6\n.2\n5\n0\n.6\n9\nN\no\nt\nkn\no\nw\nn\n5\n0\n7\n5\n2\n5\n7\n5\n5\n0\n2\n5\n3\n3\n.3\n3\nG\nra\nn\nd\nto\nta\nl\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\n1\n0\n0\nC. S. Srinivasan et al.54\nT\nab\nle\n2.\nC\no\nn\nti\nn\nu\ned\n.\n(e\n)\nEx\np\nan\nsi\no\nn\nle\nve\nl\n5\nC\no\nu\nn\ntr\ny\no\nf\np\nar\nen\nt\nV\nar\nie\nti\nes\nA\np\no\nll\no\nC\nap\np\nel\nle\nD\nes\np\nre\nz\nG\nal\nah\nad\nM\nar\nis\nH\nu\nn\nts\nm\nan\nM\ner\nci\na\nN\no\nrm\nan\nR\nib\nan\nd\nSl\nep\njn\ner\nA\nv.\nco\nn\ntr\nib\n.\nFr\nan\nce\n1\n2\n.5\n2\n1\n8\n.7\n6\n1\n8\n.7\n7\n1\n8\n.7\n7\n1\n8\n.7\n7\n3\n.1\n3\n1\n2\n.5\n2\n6\n.2\n6\n1\n3\n.6\n9\nU\nK\n2\n5\n1\n2\n.5\n1\n2\n5\n1\n2\n.5\n1\n2\n.5\n1\n0\n.9\n4\nC\nIM\nM\nY\nT\n9\n.3\n9\n1\n2\n.5\n2\n2\n1\n.9\n1\n2\n.5\n2\n6\n.2\n6\n1\n2\n.5\n2\n9\n.3\n9\nN\net\nh\ner\nla\nn\nd\ns\n6\n2\n.5\n7\n.8\n1\nU\nSA\n3\n.1\n3\n3\n.1\n3\n1\n5\n.6\n3\n3\n.1\n3\n3\n.1\n3\n9\n.3\n9\n3\n.1\n3\n5\n.0\n8\nB\nel\ngi\nu\nm\n6\n.2\n5\n6\n.2\n5\n6\n.2\n5\n6\n.2\n5\n6\n.2\n5\n3\n.9\n1\nG\ner\nm\nan\ny\n3\n.1\n3\n6\n.2\n6\n3\n.1\n3\n3\n.1\n3\n6\n.2\n6\n3\n.1\n3\n3\n.1\n3\nC\nan\nad\na\n6\n.2\n6\n3\n.1\n3\n3\n.1\n3\n6\n.2\n5\n3\n.1\n3\n2\n.7\n4\nU\nK\n\/F\nra\nn\nce\n3\n.1\n3\n3\n.1\n3\n3\n.1\n3\n3\n.1\n3\n3\n.1\n3\n1\n.9\n6\nJa\np\nan\n3\n.1\n3\n3\n.1\n3\n3\n.1\n3\n1\n.1\n7\nA\nu\nst\nra\nli\na\n6\n.2\n5\n0\n.7\n8\nU\nSA\n\/F\nra\nn\nce\n3\n.1\n3\n0\n.3\n9\nSw\ned\nen\n3\n.1\n3\n0\n.3\n9\nU\nSS\nR\n3\n.1\n3\n0\n.3\n9\nD\nen\nm\nar\nk\n3\n.1\n3\n0\n.3\n9\nN\no\nt\nkn\no\nw\nn\n5\n6\n.2\n5\n8\n1\n.2\n5\n2\n5\n6\n.2\n5\n5\n3\n.1\n3\n5\n0\n3\n1\n.2\n5\n3\n7\n.8\n9\nG\nra\nn\nd\nto\nta\nl\n1\n0\n0\n.0\n6\n1\n0\n0\n.0\n1\n1\n0\n0\n.0\n6\n1\n0\n0\n.0\n9\n1\n0\n0\n.0\n7\n1\n0\n0\n.0\n3\n1\n0\n0\n.0\n7\n1\n0\n0\n.0\n3\n1\n0\n0\nA\nv.\nco\nn\ntr\nib\n.,\nav\ner\nag\ne\nco\nn\ntr\nib\nu\nti\no\nn\n.\na\nC\nIM\nM\nY\nT\nva\nri\net\nie\ns\nre\nfe\nrs\nto\ncr\no\nss\nes\nm\nad\ne\nb\ny\nC\nIM\nM\nY\nT\no\nr\nto\nva\nri\net\nie\ns\nw\nh\no\nse\nge\no\ngr\nap\nh\nic\nal\no\nri\ngi\nn\nh\nas\nn\no\nt\nb\nee\nn\nes\nta\nb\nli\nsh\ned\nb\ny\nC\nIM\nM\nY\nT.\nb\nU\nK\n\/F\nra\nn\nce\nre\nfe\nrs\nto\ncr\no\nss\nes\nm\nad\ne\nin\nth\ne\nU\nK\nu\nsi\nn\ng\nFr\nen\nch\nva\nri\net\nie\ns\nan\nd\nU\nSA\n\/F\nra\nn\nce\nto\ncr\no\nss\nes\nm\nad\ne\nin\nth\ne\nU\nSA\nu\nsi\nn\ng\nFr\nen\nch\nva\nri\net\nie\ns.\nGenetic diversity in UK winter wheat 55\nThe geographical contribution has been assessed for\ndifferent expansions of pedigrees, from one generation\nto five generations. An analysis of the immediate parent-\nage reveals that almost all the leading UK varieties have\nbeen based on crosses of parental material from a fairly\nnarrow range of geographical sources. Most are based\non local, French (or local crosses made from French var-\nieties), American\/Canadian\/Australian, and a sprinkling\nof other European varieties. The interesting feature that\nemerges from this analysis is that even as we expand\nthe pedigrees to five generations, the composition of\nthe sources of parental material does not change signifi-\ncantly. French varieties continue to remain fairly domi-\nnant and the contribution of varieties from the USA,\nCanada and Europe increases. This lends considerable\nsupport to the view that the wheat breeding programme\nin England and Wales has been based on material from a\nrelatively narrow geographical range. A part of the expla-\nnation for this may be that only varieties from a similar\nagro-ecological area may prove useful in a breeding\nprogramme. Nevertheless, this is surprising considering\nCIMMYT appears to use a much more diversified range\nof germplasm.\nThe key result of this paper—that diversity of winter\nwheat varieties has been maintained relative to the orig-\ninal pool of ancestors, but there has been no substantial\ndiversification of the sources of germplasm—is confirmed\nby a detailed analysis of biochemical and molecular mar-\nkers (Donini et al., 2000). The study found that British\nvarieties form a distinct cluster from the cluster of the\n‘rest-of-the-world’ varieties. Moreover, varieties released\nin the later decades of the period studied in this paper\ninclude a significant amount of the germplasm, which\nhad always been available. But there were large pools of\ndiversity that had not been exploited in the UK wheat\nbreeding programme. Therefore, studies based on mol-\necular markers appear to confirm the finding that the\ndevelopment of new UK wheat varieties has relied on a\nrelatively unchanging parental pool of varieties.\nThe limited diversification of winter wheat in\nEngland and Wales may have implications for its vulner-\nability to diseases like rust. CIMMYT seeks to address\nsuch problems by accumulating genes for resistance\nfrom diverse sources (Smale and McBride, 1996).\nWhether this is necessary remains to be demonstrated.\nIt would, therefore, be useful to examine how the\nsusceptibility of winter wheat in England and Wales has\nbeen affected by the geographical distribution of parental\nmaterial. There may be pointers here for the future\nevolution of plant breeding strategies. It must be\nremembered, however, that the present analysis has\ndemonstrated important limitations of genealogical\nindices for any discussion over the utilization of\ngenetic resources.\nConclusions\nSeventy-five years of organized winter wheat breeding in\nEngland and Wales have produced a steady stream of\nnew varieties that have provided impressive yield gains.\nThe institutional changes after the mid-1960s, especially\nthe introduction of plant variety protection, have led to\nan accelerated turnover of varieties. Throughout this\nperiod, however, indices of genetic diversity based on\ngenealogical information have shown remarkable stab-\nility, except during one short interlude characterized by\nthe dominance of foreign varieties. These institutional\nchanges, in fact, have had a generally positive effect on\ngenetic diversity of wheat varieties in the UK. When we\nconsider the entire period spanned by the data set,\nthere is no evidence to suggest that the post-PVP\nperiod has been associated with lower levels of genetic\ndiversity.\nEmpirical evidence for UK wheat does not support the\nview that the large number of varieties developed in the\npost-PVP period merely represent a proliferation of clo-\nsely related varieties resulting from the product-differen-\ntiation efforts of seed companies in their quest for a\nlarger market share. However, the stability of the indices\nin the context of an accelerated turnover of varieties\ndoes indicate a lack of diversification in the (geographical)\nsources of germplasm used in breeding programmes.\nGenetic diversity has been maintained mainly through\nmore intensive use of a relatively unchanging germplasm\npool. Plant breeders have been remarkably adept at\nexploiting the original range of diversity that was available\nto them. But the quicker replacement of varieties has not\nled, as might have been expected, to genetic diversifica-\ntion through incorporation of previously unexplored\ngermplasm. This may have implications for the potential\nvulnerability of wheat varieties to disease and the future\nstrategies of the breeding programme.\nMore importantly, the results for winter wheat in\nEngland and Wales show considerable caution must be\nexercised in using genealogical indices to assess the\nprogress of conservation or utilization of genetic diver-\nsity. Firstly, complex crosses of a given set of varieties\ncan yield high values, and yet disguise the loss (or non-\nutilization) of a large proportion of the available genetic\ndiversity. Secondly, even when these indices are\ncombined with data about varietal distribution to assess\nthe impact of farmers’ choices about which varieties to\ncultivate on genetic diversity, the combined values are\nmore sensitive to changes in varietal shares than to the\ngenealogical relationship between the varieties sown. In\nsum, high values of indices of genetic diversity, as they\nare currently articulated, should not be a cause for com-\nplacency regarding the maintenance and enhancement of\nplant genetic resources.\nC. S. Srinivasan et al.56\nAcknowledgements\nEarlier versions of this paper were presented at the GCTE\nConference, University of Reading, September 1999 and\nat the National Institute of Agricultural Botany in July\n2000. We thank those who attended for their comments.\nWe are also very grateful to the two anonymous referees\nfor their comments and suggestions.\nReferences\nBerlan J-P and Lewontin R (1986) Breeders’ rights and patenting\nlife forms. Nature 322: 785–788.\nCIMMYT (1998) International Crop Information System (ICIS)\n(computer program). Mexico: CIMMYT (International\nMaize and Wheat Improvement Center).\nCox TS, Lookhart GL, Walker DE, Harrell LG, Albers LD and\nRodgers DM (1985) Genetic relationships among hard red\nwinter wheat cultivars as evaluated by pedigree analysis\nand gliadin polyacrylamide gel electrophoretic patterns.\nCrop Science 25: 1058–1063.\nDonini P, Law JR, Koebner RMD and Reeves JC (2000) Temporal\ntrends in the diversity of UK wheat. Theoretical and\nApplied Genetics 100: 912–917.\nFAO (Food and Agriculture Organization) (1996) Options for\nAccess to Plant Genetic Resources and Equitable Sharing\nof their Use. Document prepared by the International\nPlant Genetic Resources Institute for the FAO’s Commission\non Genetic Resources for Food and Agriculture. CGRFA-\nEX3\/96\/LIM\/2. Rome.\nFuglie K, Ballenger N, Day K, Klotz C, Ollinger M, Reilly J,\nVasavada U and Yee J (1996) Agricultural Research\nand Development: Public and Private Investments Under\nAlternative Markets and Institutions. Agricultural Economics\nReport No. 735. Washington, DC: Economic Research\nService, United States Department of Agriculture.\nMeng ECH, Smale M, Bellon M, and Grimanelli D (1998) Defi-\nnition and measurement of crop diversity for economic\nanalysis. In: Smale M (editor) Farmers, Gene Banks and\nCrop Breeding: Economic Analysis of Diversity in Wheat,\nRice and Maize. Dordrecht: Kluwer Academic Publishers,\npp. 19–32.\nReid WV (1992) Genetic Resources and Sustainable Agriculture:\nCreating Incentives for Local Innovation and Adaptation.\nBiopiracy International No. 2. Nairobi and Maastricht:\nAfrican Centre for Technology Studies.\nSmale M (1997) The Green Revolution and wheat genetic diver-\nsity: some unfounded assumptions. World Development 25:\n1257–1269.\nSmale M and McBride T (1996) Understanding global trends in\nthe use of wheat diversity and international flows of\nwheat genetic resources. Part 1 of CIMMYT 1995\/96\nWorld Wheat Facts and Trends: Understanding Global\nTrends in the Use of Wheat Diversity and International\nFlows of Wheat Genetic Resources. Mexico: CIMMYT.\nSolow A and Polasky S (1994) Measuring Biological Diversity.\nWoods Hole, MA: Woods Hole Oceanographic Institution.\nSwanson T (1997) Global Action for Biodiversity: An Inter-\nnational Framework for Implementing the Convention on\nBiodiversity. London: Earthscan Publications.\nThirtle C, Bottomley P, Palladino P and Schimmelpfennig DE\n(1998) The rise and fall of public sector plant breeding\nin the UK: a recursive model of basic and applied\nresearch, and diffusion. Agricultural Economics 19(1\/2):\n127–143.\nUPOV (International Union for the Protection of New Varieties\nof Plants; Union Internationale pour la Protection des\nObtentions Ve´ge´tales) (1994) International Convention\nfor the Protection of New Varieties of Plants of December\n2, 1961 as Revised at Geneva on November 10, 1972,\nand on October 23, 1978, and on March 19, 1991.\nGeneva: UPOV.\nGenetic diversity in UK winter wheat 57\n"}