{"doi":"10.1080\/0968776960040116","coreId":"6873","oai":"oai:generic.eprints.org:207\/core5","identifiers":["oai:generic.eprints.org:207\/core5","10.1080\/0968776960040116"],"title":"Reviews","authors":["Jacobs, Gabriel","Ward, Robert","Kernohan, George","Richards, Stephen","Sloan, Brian","Milne, John","Barker, Philip","Hughes, Lorna"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1996","abstract":"Integrating Information Technology into Education edited by Deryn Watson and David Tinsley, London, Chapman & Hall, 1995, ISBN: 0–412–62250–5, 316 pages","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/6873.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/207\/1\/ALT_J_Vol4_No1_1996_Reviews.pdf","pdfHashValue":"39720452cb5f873b9ac93ce6fb1cb0ad30107ce5","publisher":"Universit of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:207<\/identifier><datestamp>\n      2011-04-04T09:23:49Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/207\/<\/dc:relation><dc:title>\n        Reviews<\/dc:title><dc:creator>\n        Jacobs, Gabriel<\/dc:creator><dc:creator>\n        Ward, Robert<\/dc:creator><dc:creator>\n        Kernohan, George<\/dc:creator><dc:creator>\n        Richards, Stephen<\/dc:creator><dc:creator>\n        Sloan, Brian<\/dc:creator><dc:creator>\n        Milne, John<\/dc:creator><dc:creator>\n        Barker, Philip<\/dc:creator><dc:creator>\n        Hughes, Lorna<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Integrating Information Technology into Education edited by Deryn Watson and David Tinsley, London, Chapman & Hall, 1995, ISBN: 0–412–62250–5, 316 pages.<\/dc:description><dc:publisher>\n        Universit of Wales Press<\/dc:publisher><dc:date>\n        1996<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/207\/1\/ALT_J_Vol4_No1_1996_Reviews.pdf<\/dc:identifier><dc:identifier>\n          Jacobs, Gabriel and Ward, Robert and Kernohan, George and Richards, Stephen and Sloan, Brian and Milne, John and Barker, Philip and Hughes, Lorna  (1996) Reviews.  Association for Learning Technology Journal, 4 (1).  pp. 106-115.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776960040116<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/207\/","10.1080\/0968776960040116"],"year":1996,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Reviews\nedited by Philip Barker\nIntegrating Information Technology into\nEducation edited by Deryn Watson and David\nTinsley, London, Chapman & Hall, 1995, ISBN:\n0-412-62250-5, 316 pages.\nIn these days of research-assessment exercises and\ncost-cutting measures, if you have not arranged\nbeforehand for the proceedings of your conference\nto be published, you can expect fewer proposals\nfor papers from experts at the cutting edge of their\nsubject. Many departments will not normally fund\nattendance at conferences, especially those held\nabroad, unless there is a concrete outcome which\ncan be added to the departmental publications list.\nThis is why, over the last few years, we have seen\nsuch an increase in the number of edited\nconference papers. Unfortunately (and I certainly\ndo not include this current issue of ALT-J in this\nstatement, because the selection procedure has\nbeen really quite cruel), many of these proceedings\nare of low overall quality. The is no doubt partly\nbecause once your paper has been accepted for the\nconference, you want as much of a guarantee of\npublication as possible before you turn up and give\nit, and conference organisers are thus under\npressure not to give the copper-bottomed guarantee\nthey cannot of course give, but at least to keep you,\nas far as possible, in Promise Land. This situation\ntends to lead to diluted proceedings.\nIt was therefore a pleasant surprise to find that this\nset of proceedings - the result of the International\nFederation of Information Processing Working\nConference, held in Barcelona last October, on\nintegrating technology into the curriculum at\nsecondary-school level - was sufficiently focused\noh a main topic (essentially, how do we make IT\nas 'invisible' as TV?) to produce many very\nthoughtful papers. Not only that, but the editors\nhave clearly been at the contributions, prior to\npublication, with a not-so-gentle editing hand, such\nthat they all end up well structured and well\nwritten (it would be hard to believe that they were\nall received in their final published state).\nThe conference was truly an international one; that\nis, not one organized from the UK in some foreign\ntown to give the event an international dimension\nand at which most participants are actually British.\nContributors at this conference came from all over\nthe world, and together were able to give a\ngenuinely global perspective on the problems of\nintegrating IT into schools. Many of these\nproblems are identical in the world of higher\neducation, so these proceedings will be of\nconsiderable interest to ALT members.\nTopics range from learners' expectations and their\nachievements when relying on IT, through the role\nof the teacher in an integrated IT environment, to\nspecific instances of success, part-success and\neven failure in integrating pieces of software into\nthe classroom. There are 23 major (invited) papers,\neight short papers, and nine so-called focus-group\nreports. The latter are summaries of round-table\ndiscussions, and in some ways represent the most\ninteresting part of the proceedings, since they tend\nto highlight practical problems. But, in any case,\nsuch practical problems are everywhere present in\nthe papers, whose themes cover topics such as\ncoming to terms with teachers' concerns, the role\nof software in changing the conceptual basis of\nsubjects, the role of IT itself as a subject of study\nand its role in fostering inter-disciplinary activities,\nand the need for national government initiatives.\nIt would be unfair to pick out one paper rather than\nanother as being more important to, or more\n106\nVolume 4 Number I\nrepresentative of, the proceedings as a whole, but\nALT members will be particularly interested in a\nnumber of contributions. These include Collis on\nsocietal and organizational influences of\nnetworking, Olson on the classroom ethos, van\nWeert on integrating IT generally into education\n(including higher education), Graf on inter-\ndisciplinary and inter-cultural intentions, Teague\nand Clarke on some proposed historical reasons for\ngender differences in interest in computers, and\nAston's short paper on the British approach to\nintegrated IT.\nGabriel Jacobs, University of Wales Swansea\nThe Simulation and Gaming Yearbook. Volume 3:\nGames and Simulations for Business edited by\nDanny Saunders, London, Kogan Page, ISBN:\n0-7494-1617-3, 1995, 331 pages.\nThis series of annual volumes succeeds\nSimulation\/Games for Learning, the quarterly\njournal published from 1970 to 1992. Like the\njournal before it, the yearbook is compiled by\nSAGSET (the Society for the Advancement of\nGames and Simulations in Education and Training)\nwhich has about 150 members, mainly\neducationists and trainers in the UK. Volume 3, the\n1995 yearbook, contains 29 papers arranged into\nsix main sections: Activities and Ideas; Business\nApplications; Transforming the Curriculum;\nDevelopment and Design; The Finland\nSymposium; and Computer Applications. A\nseventh section lists contacts (including SAGSET),\npublishers and recent articles. However, much of\nthe content transcends this simple classification,\nwith themes and ideas recurring across sections.\nNor is the content confined solely to the topic of\nthe book's subtitle - the environment,\nmathematics, primary education, English teaching,\nhigher education and theoretical issues feature as\nwell as business.\nGames and simulations provide frameworks of\nrules and roles with the aim of promoting live,\nvividly interactive learning experiences, usually\nthrough group work, sometimes with computer\nsupport. As Jacques points out (p. 27), 'the magic\ningredient is undoubtedly the imagination,\ntriggered by a sense of play'. Although there are\nways that we in ALT can incorporate such\nelements into the computer-based learning\nsoftware we design, we probably have to accept\nthere is little chance of creating such high levels of\ninteraction for students working one-to-one with\ncomputers.\nSome of the ideas described in the book make no\nuse of computing technology at all. A simple but\nuseful example is the Jigsaw induction activity\ndescribed by King and Saunders (Chapter 6).\nRather than just giving information to new\nstudents verbally or on paper, it is broken down\ninto separate information cards handed out one per\nstudent. All students are then given a questionnaire\nwhich they can complete only by interacting with\nothers.\nMore sophisticated is Walford's Caribbean\nFisherman (Chapter 20) with 30 years of\ndevelopment behind it. Teams decide where to\nfish, whether to risk dangerous currents in order to\ncatch larger fish, whether to run a holiday hotel or\nmake pots rather than fish at all, and so on. It\nseems doubtful that a computer-based version\ncould ever match the flexibility and spontaneity of\nan experienced human facilitator, for example by\ninstantly inventing new rules for fishermen who\nunexpectedly ask whether it is possible to run\ntourist trips.\nThese kinds of activity, when organized well, are\nclearly very motivating. Thiagarajan (Chapter 5)\ngoes one step further in arguing mat the ultimate\nmotivator is money, and describes role play games\nin which actual cash changes hands. These games\nemploy devices such as secret ballots in order to\ncreate conflicts between self-interest and common-\ninterest in competing teams. He writes: '[...] cash\ngames arouse intense emotion, including\ninterpersonal hostility. As a facilitator, you should\nbe ready to abort the game if things appear to be\ngetting out of control'.\nOf course, games and simulations are not just for\nfun, they promote experiential learning. For\nexample, Thiagarajan's cash games are intended to\nbring out concepts such as co-operation,\nconfrontation, escalation and fairness, and to\nexercise skills such as negotiation, persuasion and\nbuilding trust. Several contributors attempt to\nplace games and simulation within a context of\neducational theory. Kolb's experiential learning\ncycle is discussed in several places.\nAnother recurring theme is the importance of\ndebriefing for transforming experience into\npositive and lasting learning. Debriefing usually\ninvolves discussion in which the facilitator's main\ndilemma is to maintain balance between structure\nand free flow of comment. Crookall points out that\ndebriefing is the most neglected stage of\nsimulation and gaming: 'Compared to the amount\nthat has been written about other aspects of\nsimulation\/games, very little has been written\n107\nReviews\nabout debriefing' (p.10). The book goes some way\ntowards making good this deficit.\nAlso running through several papers is the issue of\nthe nature of education and its future, especially\nhigher education. All contributors see simulations\nand games as a means of improving learning\nquality. Evans and Jewell (Chapter 17) answer\nsceptics who might not regard 'games' as a serious\nacademic endeavour. Cudworth (Chapter 19)\ndeplores the stigma of 'abnormality' placed upon\ncreative teaching and the hold of conformist\ntradition upon higher education, which still relies\non lectures as the main form of learning. Yorke\nand McCormick (Chapter 14) report a workshop in\nwhich senior university staff planned institutional\nstrategies beyond 2001 in order to submit\nproposals for an imaginary funding initiative.\nChanges to the nature of teaching and learning\nfeatured heavily in the strategies created.\nComputing technology is by no means absent from\nthe book; it plays a part in more than half of the\ngames and simulations described, especially in\nbusiness games in which teams manage simulated\norganizations competing in simulated marketplaces\nover a series of time periods. The main role of the\ncomputer here is in evaluating performance at the\nend of each time period. Examples include\nFawcett's account of a team game for hospitality\nstudents who manage restaurants competitively\n(Chapter 11) and Gray's cost-accounting game\nwhich simulates competition between manu-\nfacturing companies (Chapter 12). Burgess\n(Chapter 7) traces the evolution of these business\ngames, and the gradually increasing importance of\ncomputers within them. He sees this trend\ncontinuing into the future, with expert systems and\ndecision-support systems to aid both organizers\nand players, and multimedia to give greater\nrealism. Gray's cost-accounting game actually runs\non microcomputer networks, and he sees no reason\nwhy games could not be run with 200 teams and\n1,000 globally distributed participants.\nI found the quality of papers variable. Some seem a\nlittle out of place in the collection. One or two\nwould have benefited from strict editing for length.\nThere is no index. But these things aside, the book\nprovides a rich source of ideas from experienced\ndesigners and users of educational simulations and\ngames. We in ALT, who sometimes perhaps focus\ntoo narrowly on the design of software rather than\nthe design of broader learning experiences involving\ncomputers, might be able to use some of these ideas.\nRobert Ward, University of Huddenfield\nSimulations - a Handbook for Teachers and\nTrainers by Ken Jones, London, Kogan Page (third\nedition), ISBN: 0-7494-1666-1, 1995.\nAs a teacher, how well do you prepare your\nstudents for the workplace?\nFew would deny their ability to convey the basics\nof their own special subject. However, the social\ncontext in which professional graduates find\nthemselves involves a variety of different\nbehavioural skills, often beyond the technical\naspects of the degree subject they have read. In\nattempting to prepare students for a life in a\nworkplace that is dependent on communication\nand negotiation skills, where they are largely self-\nmotivated, and perhaps expected to perform\nsingle-handed in strategic positions, benefit can\noften accrue from the experience of a simulation,\ndescribed by Ken Jones as a classroom event in\nwhich (1) the participants have functional roles -\nsurvivor, journalist, judge, fashion designer, Prime\nMinister; and where, (2) sufficient information is\nprovided on an issue or problem to enable the\nparticipants to function as professionals, using\nreal-world ethics.\nIf an appropriate level of autonomy is granted to\nthe participants, such events permit powerful\nlearning by one's mistakes, making them well\nworth pursuing in most learning areas. And the\nimmense effort of creating a satisfactory\nsimulation can be relieved by use of published\nsimulation material: Jones refers to several\nsources, including his own previous work in this\narea.\nFollowing a thorough grounding in the\ncharacteristics of simulations (where the objective\nis to experience professional activities) and\ncontrasting these with those of a game (where the\nobject is generally entertainment), Jones goes on to\ndescribe how simulation was first used in war and\nbusiness before being transferred to the\neducational arena. Personal development and\nsocial\/cultural awareness are other applications\nthat can benefit from a classroom simulation.\nIndeed, it seems difficult to imagine an area of\nlearning that would not benefit by this immersion\ntechnique.\nFor anyone with an interest in design, choice or\nuse of these activities, this little book holds a real\nwealth of information in an entirely readable\nformat. While many authors have attempted to\nformally assess the value of simulation in\neducation, there is arguably more to be gained\nfrom the flip-side: using simulation in assessment\n108\nALT-J Volume 4 Number i\nrather than assessing simulation. A major role of\nclassroom simulation lies in student-evaluation -\nfor example, of oral skills and behaviour.\nHowever, one note of caution: a section on\ncomputer-assisted simulation presents this only as\na supporting device for the perceived primary role\nof simulation: human interaction, not as a cost-\neffective technological simulation of complex\nsystems in training prospective users. Jones\nconcentrates on the social and behavioural aspects\nrather than the recent innovations of simulation in\nphysiology or surgery; situations where the ability\nto learn by one's mistakes has naturally been\nsomewhat problematical and limited to unfortunate\nanimal work. A reader of modem simulation will\nfind little here to inspire confidence in computer\ntechnology providing virtual learning environ-\nments for those heading for careers in control of\nlarge or vital systems such as trains, boats and\naeroplanes, power-generation plants, hospitals, or\neven electronic design. Perhaps this is due to a risk\nof over-simplification in simulations of this type,\nand the relatively recent introduction of computer-\nsimulation and modelling techniques for such\nspecialized training functions.\nNevertheless, if you teach any subject, and hope in\nvain that the students will somehow absorb the so-\ncalled transferable skills of communication\nnegotiation and\/or the art of listening, then this\nbook will be of considerable value.\nGeorge Kernohan, Queen's University, Belfast\nDesign and Production of Multimedia and\nSimulation-based Learning Material edited by Ton\nde Jong and Luigi Sard, Dordrecht (Netherlands),\nKluwer Academic Publishers, ISBN: 0-7923-3020-\nX, 1994, 253 pages.\nThis book is a collection of papers by different\nauthors chiefly from within the DELTA\n(Developing European Learning through\nTechnological Advance) programme, which aims\nto facilitate the use of information technology in\nlearning through the development of more\neffective design, production, and delivery. Thirty\nprojects are funded under DELTA, and eight of\nthese are covered in this book, though in order to\nprovide a broader view of the current status of\nresearch into learning and technology within\nEurope, three other projects which lie outside the\nDELTA programme are also included.\nThe book has an introduction, followed by 11\nchapters, each focusing on a different project. In\nthe introduction, de Jong and Sarti focus on current\ntrends in the design and production of computer-\nbased learning material. Design and production are\ndefined, and related to the contributions presented\nlater in the book. A distinction is also made\nbetween 'general' courseware and simulation-\nbased training material. Again, the concepts are\nrelated to the individual contributions made later in\nthe book. The introduction ends with a brief\ndescription of each of the contributions which\nmake up the work. This is useful in a book of this\nkind for several reasons: it provides a conceptual\nframework for the reader, and it allows the reader\nto rapidly gain a detailed overview of the contents\nof the book, and to focus in on areas and issues of\nspecific interest. Such a useful introduction is all\ntoo often omitted from books consisting of\ncollections of papers.\nThe range of projects covered in the book is,\ndiverse, but all address the issues of design and\nproduction at some level, and a number of papers\ndeal with both these issues at a significant level\n(Barker; van Rosmalen; de Jong et al; Verreck and\nWeges). Barker, for example, outlines models for\nboth learning design and for interactive learning\nenvironment implementation. Other papers tend to\ncentre primarily on either design or on production\nissues: a strong emphasis on design issues is\nparticularly notable in some contributions\n(Grandbastien and Gavignet; Mispelkamp and\nSarti; and Tait), while a focus on production can be\nfound in others (Ulloa; Benamou and Celentano;\nBusch et al; and Hartel).\nA key problem with books created from\ncollections of papers is the lack of continuity and\nstructure. Authors' styles vary, and they are\nproducing essentially stand-alone pieces of work.\nThis means that such books are less amenable to a\n'cover to cover' approach, and considerable effort\nis required of the editors in order to structure and\nsequence contributions. Although in this particular\nbook some structure is provided by the\nintroduction, it would have been useful if some\nform of sub-sectioning had been applied so that\nreaders could more immediately focus into areas of\ninterest to them. Sub-sections are not used and, as\na result, the order in which papers are organized is\nnot immediately obvious.\nAlthough all contributions are project-based, it is\ninteresting that they successfully address\nunderlying conceptual issues and problems. As a\nresult, this book will be of general interest to\nanyone involved in the design and production of\ncomputer-based learning materials.\nStephen Richards, University of Teesside\n109\nReviews\nHow to Motivate People by Twyla Dell, London,\nKogan Page (second edition), ISBN: 0-7494-1823-\n0,1995, 96 pages.\nThis is one of the books in Kogan Page's Better\nManagement Skills series. It is designed to be used\nas a self-study guide, and offers managers a series\nof practical tips on how to increase employee\ncommitment\nIt centres on Maslow's Hierarchy of Needs, and\nthe theoretical base on which the book is founded\nis thus very narrow. Dell does not deal with the\nwork of many of the motivation theorists which\nwould be expected to be part of a general text on\nthe subject (e.g. Herzberg, McGregor,\nMcClelland), and because of this the book cannot\nbe considered an in-depth treatment. However,\nthrough the clever use of activities and exercises,\nDell brings the reader face to face with the realities\nof their personal management style and the\nexpectations of their subordinates.\nThe book has four parts, which lead from theory to\npractice. One immediate criticism is of Part 3,\nentitled 'Five Steps to Success'. It is wise to be\nsomewhat sceptical of any book which purports to\nhave the answer to management success. Perhaps it\nwould have been better for Dell to use a more\nconsidered approach, drawing readers into full\nknowledge of the complexity of motivation theory,\nand to introduce them to the range of methods\navailable to create an atmosphere within an\norganization where motivation is encouraged.\nAnother possible flaw is the assumption that\nemployees are capable of achieving -100%\nproductivity in the workplace. I have the niggling\nfeeling that if we could get 100% effort out of staff\nin the academic workplace, they would be unlikely\nto give the extra 50% to 60% which is necessary\nfor the survival of higher education. This\nhighlights an obvious weakness in the book - that\nof how to motivate staff where a significant\nproportion of their effort depends on goodwill - a\nweakness no doubt brought about by the author's\nexperience in running a commercial company\nwhere motivation factors (e.g. bonuses, perks and\npromotion) are more readily available than in\neducation. But perhaps it is too much to expect\nDell's book to cater for all eventualities.\nPart 1 ('Close the Commitment Gap') introduces\nthe reader to Maslow's Hierarchy of Needs, and\nbegins the process of applying this knowledge to\nthe reader's specific circumstances. The exercises\nin this section are geared to creating awareness of\nhow one, and one's subordinates, are performing.\nPart 2 ('How to Empower Staff) seeks to convey\nthe three phases of empowerment, which in the\nopinion of Dell are 'to give someone the power to:\njudge - act - command*. As with Part 1, the\npractical exercises are immensely useful, enabling\nreaders to understand their particular management\nstyle, and how they might best empower those\nmembers of staff for whom they are responsible.\nPart 3 consists of those 'Five Steps to Success'.\nAlthough 'instant success' books of this nature\nabound in the area of management, this text does\ncontain some very practical wisdom. The five steps\nwhich, in Dell's opinion, will lead to success are:\nLearn to Lead; Examine Expectations; Act as\nThough You Care; Respect Employees as\nProfessionals; and Never Stifle Personal Growth -\nnot exactly 'earth shattering', but they do offer\nsome common-sense tips towards creating a more\ncontented, productive workforce.\nHaving confronted the reader with the basis of\nmotivation theory and its application in the\nworkplace, Part 4 ('Practise What You've\nLearned') attempts to ensure that what has gone\nbefore is not forgotten, but is put into practice.\nThis book is aimed at anyone who has staff who\nare under-producing in the workplace, either by an\nact of will, or by being prevented from doing so by\ncircumstances or lack of training. The practical,\nwell-thought-out exercises are useful in forcing\nmanagers to be honest with themselves in\nestablishing reasons for lack of motivation.\nAlthough they are designed to be used by\nindividual managers, some would also be\nextremely useful in gaining the opinions of the\nworkforce. This would require some re-wording,\nbut as all the exercises are brief, it would not\npresent too much of a problem.\nThe book would have benefited enormously,\nhowever, from the addition of a bibliography,\nwhich would have added weight and authority to\nthe arguments postulated. Readers would then\nhave become aware that the ideas are based on\nsound theory, as well as practical experience.\nBrian Sloan, Napier University, Edinburgh\nEvaluating and Assessing for Learning by Duncan\nHarris and Chris Bell, London, Kogan Page, ISBN:\n0-7494-1301-8, 1994, 204 pages.\nGood teaching requires evaluation. This means\nmeasuring how well the teaching is going, and\nidentifying areas that need to be improved.\nEvaluation can also identify what the learners need\n110\nVolume 4 Number I\nto know. But an easy criticism of any book on\nevaluation is to ask what evaluation the book itself\nhas undergone. How well have the authors\naddressed the needs of the readers? Did they elicit\nthe views of readers? It would seem that the ideas\nHarris and Bell present have been developed\nthrough discussion and criticism with teachers and\nlearners. Each section has a discussion on\n'difficulties and criticisms', so their ideas do indeed\nseem to have been evaluated. And the book is in its\nsecond edition, so there has been plenty of time for\nevaluation. The structure of the work has been\nretained, but it has also been built upon: this second\nedition has more pages, case studies have been\nexpanded, and sections rewritten and extended.\nThis has improved an already good book.\nThe authors anticipate that the readers of the book\nwill include mature students on advanced courses,\ntutors of advanced courses, teachers or groups of\nteachers undertaking curriculum development, and\ngroups of trainers undertaking development of\ntraining material.\nThere are five sections, each with some\nsuggestions for group activities, the discussion on\ndifficulties and criticisms mentioned above, and a\nuseful annotated bibliography. Harris and Bell\nattempt to cater for different types of learners by\nproviding overviews in the form of concept maps,\nand also a conventional table of contents.\nThe book is centred on the needs of the learner,\nproviding practical, well presented ideas on how to\nassess and evaluate learning. This is not, however,\na how-to guide; rather, it is more of a discussion of\nthe issues necessary for an effective learning\nenvironment Much of the discussion is on the\ncontext of learning, with some advice on how to\nassess or evaluate.\nSection 1 is devoted to the needs of the learner.\nThe types of learner follow Honey and Mumford's\n1982 classification of 'activist, pragmatist,\nreflector, and theorist'. Harris and Bell describe\nhow each type of learner would learn best, then go\non to describe different types of learning. There\nare many ways of describing these, but whatever\nthe terminology used, most readers will be familiar\nwith memorizing, decoding, and creating. The type\nof learning I was not familiar with was termed\n'loving'. This is the learning that occurs in groups,\nand Harris and Bell suggest that it is necessary for\nthe individual and other members of the group to\nidentify each learner's needs rather than depending\non learning that is driven by the teacher.\nSection 2 deals with evaluation, and fitting the\nsystem to the needs of the learner. It is where the\nunderlying theme of the book is discussed. Needs\nanalysis will help to avoid a mismatch between the\nlearner and the content or the approach to learning.\nOne of the methods discussed is the Delphi\nprocedure, a way of collecting information and\ncombining ideas from a number of individuals. The\ninformation collected is fed back to the group to get\nmore information and to refine ideas, the process\ncontinuing for as many iterations as necessary.\nIn Section 3, the authors address the topic assessing\nfor learning, and for me this section was the core of\nthe book. I wanted to find out how to assess\nlearning, and I was looking for techniques that I\ncould use to identify learning gains, techniques that\nwould show that the learners' ideas had changed,\nthat their understanding had developed, or even that\nknowledge had been gained. However, the section\nfocuses on reasons for assessment. It seems that\nlearning is more complex than my ideas would\nallow. Cook-book techniques to assess learning are\nlikely to miss important points, because issues\ncentral to learning have not been addressed. Harris\nand Bell discuss why, how and what you should\nassess. They assert that assessment should be\nfocused on active involvement by the learner on\nlearning. Their philosophy is to feed back\ninformation to the learners, assisting them in\nlearning and giving them responsibility for their\nown learning and assessing.\nIn Section 4, entitled 'Role of Learners and\nTeachers', Harris and Bell adopt a musical\nmetaphor for teaching: composer, conductor,\nperformer, critic; and summarize the learners' role\nas receiver, detective, generator, and facilitator.\nThey take the view that much of the\ncommunication between teachers and learners\nshould be through the medium of assessment and\nevaluation.\nSection 5, 'Meeting the Needs of the Learner',\ndiscusses different forms of teaching and learning.\nHarris and Bell develop a model in which there is\ntwo-way communication between teacher and\nlearner and also between learners. They stress the\nimportance of group work.\nThe learning context and evaluation are\nintertwined: the context will limit the evaluation\nthat can be applied. This book discusses the\ncontext, and explains appropriate evaluation and\nassessment. An ideal learning situation for Harris\nand Bell would be one in which the teacher\nnegotiates the learning task and assessment\nstrategy, and resolves between them the best\napproach for the learner.\nI l l\nReviews\nA ripping good yarn? No, but it is clear and\nreadable, with case studies and different\napproaches to revive waning interest I would\nrecommend it for anyone who is interested in\nimproving teaching and learning.\nJohn Milne, University of Aberdeen\nHTML Manual of Style by L. Aronson, Emeryville\nCA, Ziff-Davis Press, ISBN: 1-56276-300-8, 1994,\n132 pages.\nThe Internet and World Wide Web (WWW, or the\nWeb) have now become valuable learning,\nteaching and training resources. Consequently,\nover the last few years books on these topics have\nbecome very popular. Essentially, these deal with\nthree basic issues: the underlying theoretical and\ntechnical matters relating to using distributed\nnetworks; accessing Internet and Web services;\nand Web publishing. An important aspect of\npublishing material on the Web is the use of an\nappropriate markup language so that search\nengines and Web browsers (such as Lynx, Cello,\nMosaic and Netscape) can access the information\nand interpret it in the correct way. The markup\nlanguage used on the Web is HTML (HyperText\nMarkup Language) which, through the use of an\nappropriate DTD (Document Type Definition), is\nessentially a subset of the ISO 8879 standard\nSGML (Standard Generalized Markup Language).\nObviously, anyone wishing to publish material on\nthe Web will find some knowledge of HTML\nuseful. This monograph provides a helpful\nintroduction to the topic.\nThe book contains just four chapters, plus three\nappendices and a subject index. The opening\nchapter ('What is HTML?') is very short and\nprovides a brief introduction to HTML, hypertext\nand hypermedia, Mosaic, the Web and the Internet.\nChapter 2 is more substantial, and is devoted to the\nHTML (Level 2) language itself. It covers such\nissues as HTML syntax, formatting tags (for\nheadings, paragraphs, lists and styles), anchors and\nlinks, images, and forms (which facilitate input\nfrom users). In Chapter 3, the author discusses how\nto write HTML documents. The chapter is\norganized into four major sections which together\ncover such issues as general principles, identifying\ngood HTML style, how to create a home page, and\nthe conversion of existing documents into HTML\nformat.\nThe final chapter is by far the largest, and is\ndevoted to a series of eight case studies. In each\ncase study, the author describes various existing\nWeb pages accessible, then goes on to discuss the\nHTML encoding underlying their appearance. The\nexamples presented in this chapter include a\npersonal home page, typical home pages for small\nand large organizations, an electronic brochure, a\nWeb survey, and pages for a number of subject\nguides and specialisms. The site addresses (URLs)\nfor the examples are given and, surprisingly, they\ncan all be accessed relatively easily. I used a full-\nscreen, text-based browser (Lynx) to access them.\nIndeed, I explored the home pages described in the\nbook using an old DOS-based computer (an\nAmstrad 1640) as a remote terminal running at\n1200 Baud (using VT100 emulation). Not\nsurprisingly, however, most of the pages (except\nthe Web survey) were in many ways different from\nthose described by Aronson. Obviously, since the\nbook was originally published, much of the\nmaterial has been updated and restructured.\nI was interested to find (p. 107), the example used\nto illustrate the home page for the San Francisco\nBay Area chapter of the ACM's Special Interest\nGroup on Computer-Human Interaction (BayCHI)\nwas advertising a talk entitled 'Too Much\nHypertext or Too Little?' by Jacob Nielson (to be\ngiven on Tuesday, 11 October 1994). When I\naccessed this same page a year later (while writing\nthis review) I was excited to see the BayCHI page\nadvertising a lecture to be given by two of my HCI\n'heroes' (William Buxton and Stuart Card) entitled\n'Radical Human-Computer Interaction'\nscheduled for Tuesday, 10 October 1995 at 7.30\npm! Wouldn't it be lovely if the Internet could be\nused to transmit this lecture 'live' to interested\npeople in Europe? Unfortunately, herein lies some\nof its basic limitations. Maybe the future\ninformation Superhighway will provide enough\nbandwidth for this type of thing to happen. Who\nknows?\nIn addition to the case study examples described\nabove, the three appendices at the end of the book\nare also very useful. The first provides a quick\nreference guide to HTML (based on the HTML 2.0\nDTD specification). The second gives an overview\nof HTML+, describing many of the features and\nextensions that are to appear in new versions of the\nlanguage. The third appendix gives details of\nvarious HTML resources (such as guides and\nreferences, browsers, conversion tools and list-\nservers), many of which can be obtained using the\nWeb itself. Unfortunately, since the book was\npublished, the info.cem.ch documents have been\nrelocated to www.w3.org. This meant that my\ninitial attempts at accessing some of the guides and\nreferences failed when I entered the URLs quoted\nby Larry Aronson.\n112\nALT-J Volume 4 Number I\nOverall, although the book has some very minor\nlimitations (such as out-of-date URLs and the\noccasional spelling error), I found it quite\ninteresting and fairly easy to read. The author is\nthorough in his explanations and has chosen some\ngood examples in order to illustrate the points he\nwanted to make. It is my belief that the text will\nmake a useful first reader for those wishing to\nlaunch themselves into markup techniques and\nWeb publishing. It is also a book that I would\ndefinitely recommend to any student who wants to\nfind out about HTML and what it has to offer.\nPhilip Barker, University of Teesside\nFilm and Television in Education edited by Chris\nDry, London, Chapman & Hall (Bluprint), 1995,\nISBN: 1-857130-16-2, 341 pages.\nThis is the second edition of the Handbook of the\nBritish Universities Rim and Video Council\n(BUFVC). The first edition dates back to 1991;\nthis new one is more extensive. It consists of about\n100 pages of short articles on various aspects of\nfilm and video as educational media, including\n(but by no means limited to) the new digital-video\ntechnologies of the last few years, and about 200\npages of Directory. The Directory consists of\nreference entries on a wide variety organizations\nwhose business, in one way or another, is audio-\nvisual, and on distributors of film, video and\nrelated media, classed by subject. There are also\nlists of sources of multimedia products, library\nsuppliers of audio-visual materials, equipment\nsuppliers, European audio-visual projects, and\ncourses and events. Supplementary information\nincludes a section on media legislation and reports,\nand one on the activities of the BUFVC.\nIn all, then, this work offers a pretty wide coverage\nof the field, and could be very useful to developers\nof courseware, who would do well to keep it on\ntheir shelves. For instance, if you need some top-\nquality sound recording, some 1-inch video\nmastering, some graphic design, some\nprofessionally produced video sequences, or just\nthe loan of a good camcorder, you will certainly\nfind good sign-posts in its pages, as you will if you\nwant to know your nearest audio-visual centre\n(university or otherwise) and precisely what it has\nto offer. Equally, if you need to know exactly what\na particular audio-visual organization can do for\nyou, from the Arts Council of Great Britain to the\nWriters and Scholars Educational Trust, you will\nfind enough to give you a fairly good idea, as well\n(of course) as all relevant contact details. ALT is\nthere too, I am very glad to say. Also of interest to\nmany ALT members will be the lists of UK\ndistributors (116 pages, making up the largest\nsection of the Directory) and what they can offer -\neverything from educational CD-ROMs and videos\nfor sale or hire (there is a good list of available\ncatalogues, too) to printed publications on\nresources.\nThe articles preceding the Directory are of varying\ninterest to educationists. Some, meant of course for\nnon-specialists, merely re-state themes (such as\ninteractivity and technology) which will be well\nknown to ALT members. Others, however, offer\ninteresting insights into aspects of educational\ntechnology not often dealt with in journals and\nnewsletters about computers and education, such\nas the future role of educational television, or the\nhistory of moving pictures and education (a short\nbut excellent contribution by Murray Weston, the\nDirector of the BUFVC), or how to research film\nand television collections in Europe).\nThus, this handbook, while primarily of use a\nreference work, also offers a good overview of\naudio-visual aspects of educational technology. It\nis certainly worth adding to one's collection, and is\nthe sort of thing which will come in useful when\nyou least expect it.\nGabriel Jacobs, University of Wales Swansea\nMultimedia Technologies and Future Applications\nedited by Damper, R.I., Hall, W. and Richards,\nJ.W., London, Pentech Press Publishers, 1994,\nISBN 0-7273-1320-7, 267 pages.\nThis book is the proceedings of the IEEE (Institute\nof Electrical and Electronics Engineers)\nInternational Symposium on Multimedia\nTechnologies and Future Applications, held in\n1993. As such, it is an eclectic collection of papers\non the development of multimedia technologies\nand their applications, ranging from theoretical\noverviews to highly technical reports.\nIt consists of 19 papers by different contributors\nfrom industry and academe, representing a wide\nvariety of backgrounds, from engineers to\nlinguists, computer scientists to broadcasters,\npublishers to human-factors experts. This may\nseem a disparate group, but in fact it actively\nreflects not only the breadth of the appeal of\nmultimedia technologies and techniques at the\nmoment, but a general consensus in almost all\ndisciplines that we are on the brink of a\nmultimedia revolution. It also demonstrates the\noften claimed 'interdisciplinary' nature of\nmultimedia in that the techniques perfected in one\n113\nReviews\ndiscipline are often applied in other, quite\ndifferent, areas.\nThe papers are divided up into four sections. Each\ncontains a helpful introduction which summarizes\nthe content of the papers which follow, and which\nhelp to put them into the context of the work as a\nwhole. These introductory chapters are a very\nuseful addition when material which is\ncomparatively so varied in scope is represented in\none publication. Another useful aspect is the\ninclusion of an introduction or abstract at the start\nof each individual paper. I have one minor quibble,\nhowever, with the lack of chapter numbers within\nthe individual sections. This makes cross-\nreferencing rather difficult - the editor of Section 1\nhimself confused the sequence of two chapters in\nhis introduction.\nThe collection begins with an introductory and\ngeneral foreword looking at the implications of\nmultimedia in publishing, and comparing the\ninformation revolution which is facilitated by\nmultimedia to the technological revolution created\nby Gutenberg. This is a concise and clear\nintroduction to the many political and social issues\nintrinsic to the 'multimedia revolution*.\nPart I, on Core Technical Issues, is primarily\nconcerned with data compression, particularly with\nreference to image quality and speed of delivery.\nAlthough at first frankly terrifying in its technical\ncomplexity to the reviewer with a non-technical\nbackground, it quickly becomes apparent that\nissues of data, image and video compression are\nsomething all of us involved in multimedia\ndevelopment need to be appraised of, and this\ncollection provides an excellent overview of the\nproblems and some possible solutions. The first\npaper presents an identification of the components\nnecessary for a systems approach to solving the\nproblems of standardization across machines and\nnetworks using multimedia communications.\nHaving identified with the systems analyst,\nrecognizing that their concerns are of interest to all\ninvolved in multimedia development, we can more\nconfidently approach the following papers. These\ninclude a new technique for high speed image\ncoding, an overview of design issues pertinent to\nthe development of a low bit-rate audio\/data\/video\nmultimedia system, an exploration of an algorithm\nfor image coding which could help solve problems\nof storage and compression of images, and a\npractical technique for image processing with an\norigin in pure mathematics which is compared to\nmore conventional coding methods based on\nsimulation results. The final paper in this section\ndescribes Acom Replay, software-only full-motion\nvideo from CD-ROM, a patent-pending technique\nwhich has the potential to be used in the\nproduction of low-cost educational software. All\nsix papers in this section deal with highly complex\ntechnical issues in an clear and easy-to-follow\nmanner. They are as good a summary of complex\ntechniques as I believe will be found in one\nvolume.\nPart II, on Audio-visual Delivery Systems\naddresses implementation problems inherent in\naudio-visual systems in the digital domain,\nespecially processing power and bandwidth. The\nfirst paper describes a collaborative project to\ndevelop a multimedia environment which will\nallow high-quality video, data and audio\nconnections between remote sites using ISDN,\nsupporting a multimedia system in both local and\nremote networked environments. This is followed\nby an overview of a technique to store high-quality\npicture information in a way that is compatible\nwith the needs of distributed multimedia\nenvironments. This paper characterizes the\ncomponents of, and interactions within, a\nmultimedia environment. The final paper in this\nsection, entitled 'The multimedia microwave oven'\nis the perspective of a television producer looking\nat the new multimedia communications systems\nwhich are set to replace what was not so long ago\nthe only audio-visual system in use - broadcast\ntelevision. This is a reflective paper in the 'where\nare we and how did we get here?' mould. The\nauthor (MacGregor) reflects upon the political,\nsocial and cultural implications of the adoption of\nmultimedia technologies, and surmises the\ninfrastructure required before the 'multimedia\nrevolution' - which we are constantly reminded is\nupon us - can really begin.\nPart HI, entitled Human-Computer Interface, looks\nat the 'human' issues - how people interact with\ntechnology - rather than the technical concerns of\nthe previous sections. All the papers in this section\naddress the issues involved in creating high-quality\nmultimedia materials, paying particular attention to\nquestions of why and for whom this material is\ncreated. In his thoughtful paper, 'Not a cottage\nindustry: understanding the scale of multimedia\nproduction', Bruce Ingraham addresses the myth\nthat multimedia is a quick and easy solution to\neducational problems. As the developer of France\nInterActive, Ingraham is well placed to realistically\nassess the real cost and scale of developing\nintelligent educational multimedia. His argument is\nthat the investment in educational technology must\ninclude an investment in the structures, skills and\n114\nALT-J Volume 4 Number I\ntools to support its use for real benefits to be\ngained. Other papers in this section report on\nspecific ways in which human interaction can\nassist in the development of multimedia\ntechnologies, including voice and facial image\nintegration for person recognition, interaction\nbetween a patient and psychiatrist to analyse the\nuse of video telecommunications, the way in which\nusers interact with audio and visual information in\nthe workplace, and the perceptions of language,\nsound and vision which may contribute to the\ndevelopment of formal and effective multimedia\napplications.\nPart IV, Applications, presents examples of\napplications in use at the moment, any or all of\nwhich may well become prototypes. All represent\nexamples of good practice in the use of multimedia\nfor specific tasks, practical or pedagogical. Again,\ncontributors come from industry and academia.\nThere is a description of a system in use by Lloyds\nRegister to enable users to make quick and\ninteractive decisions about damage on board a\nship, and a contribution describing the Microcosm\nproject, addressing media integration issues within\nopen-media systems. The papers in this section\nillustrate what Wendy Hall herself says in her\nintroduction to this section: multimedia\napplications are today much more than simply\npresentation systems. Multimedia information\nsystems are merging with computer technologies\nto the extent that soon the two will be inseparable\nand interchangeable.\nMultimedia Technologies is a timely collection,\none which demonstrates the huge impact of\nmultimedia technologies on so many disciplines. It\ndemonstrates clearly that there is more to\nmultimedia than theory - that there is a need for\nthe techniques used in multimedia development to\ncatch up with the technology available. Multi-\nmedia is a term which is bandied around to the\nextent that it seems to mean all things to all-\ncomers - few of us stop to think about the\ntechnical issues which are so crucial in successful\ndevelopment and implementation of multimedia.\nThis collection makes no claims to being\nexhaustive, but is a valuable snapshot of the state\nof play in the technological developments which\nmake it possible for us all to look to the use of\nmultimedia in our own disciplines.\nLorna Hughes, Arizona State University\n115\n"}