{"doi":"10.1016\/j.bios.2003.12.010","coreId":"137844","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/807","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/807","10.1016\/j.bios.2003.12.010"],"title":"Monitoring haemodialysis using electronic nose and chemometrics","authors":["Fend, Reinhard","Bessant, Conrad M.","Williams, Anthony J.","Woodman, Anthony C."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-07-15","abstract":"An ever-increasing number of patients have to undergo regular renal dialysis to compensate for acute or chronic renal failure. The adequacy of the treatment has a profound effect on patients’ morbidity and mortality. Therefore it is necessary to assess the delivered dialysis dose. For the quantification of the dialysis dose two parameters are most commonly used, namely the Kt\/V value (normalised dose of dialysis) and the urea reduction rate, yet the prescribed dialysis dose often differs from the actual delivered dialysis dose. Currently, no interactive process is available to ensure optimal treatment. The aim of this study was to investigate the potential for an “electronic nose” as a novel monitoring tool for haemodialysis. Blood samples were analysed using an electronic nose, comprising an array of 14 conducting polymer sensors, and compared to traditional biochemistry. Principal component analysis and hierarchical cluster analysis were applied to evaluate the data, and demonstrated the ability to distinguish between pre-dialysis blood from post-dialysis blood independent of the method used. It is concluded that the electronic nose is capable of discriminating pre-dialysis from post-dialysis blood and hence, together with an appropriate classification model, suitable for on-line monitoring","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/137844.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/1826\/807","pdfHashValue":"61ca7bd98a449577cbeb90b932e6cb10bf40b83e","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/807<\/identifier><datestamp>2014-06-11T11:20:53Z<\/datestamp><setSpec>hdl_1826_8<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Monitoring haemodialysis using electronic nose and chemometrics<\/dc:title><dc:creator>Fend, Reinhard<\/dc:creator><dc:creator>Bessant, Conrad M.<\/dc:creator><dc:creator>Williams, Anthony J.<\/dc:creator><dc:creator>Woodman, Anthony C.<\/dc:creator><dc:subject>Kidney disease<\/dc:subject><dc:description>An ever-increasing number of patients have to undergo regular renal dialysis to compensate for acute or chronic renal failure. The adequacy of the treatment has a profound effect on patients’ morbidity and mortality. Therefore it is necessary to assess the delivered dialysis dose. For the quantification of the dialysis dose two parameters are most commonly used, namely the Kt\/V value (normalised dose of dialysis) and the urea reduction rate, yet the prescribed dialysis dose often differs from the actual delivered dialysis dose. Currently, no interactive process is available to ensure optimal treatment. The aim of this study was to investigate the potential for an “electronic nose” as a novel monitoring tool for haemodialysis. Blood samples were analysed using an electronic nose, comprising an array of 14 conducting polymer sensors, and compared to traditional biochemistry. Principal component analysis and hierarchical cluster analysis were applied to evaluate the data, and demonstrated the ability to distinguish between pre-dialysis blood from post-dialysis blood independent of the method used. It is concluded that the electronic nose is capable of discriminating pre-dialysis from post-dialysis blood and hence, together with an appropriate classification model, suitable for on-line monitoring.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2005-11-23T13:04:32Z<\/dc:date><dc:date>2005-11-23T13:04:32Z<\/dc:date><dc:date>2004-07-15<\/dc:date><dc:type>Article<\/dc:type><dc:format>1946 bytes<\/dc:format><dc:format>263348 bytes<\/dc:format><dc:format>text\/plain<\/dc:format><dc:format>application\/pdf<\/dc:format><dc:identifier>Reinhard Fend, Conrad Bessant, Anthony J. Williams and Anthony C. Woodman, Monitoring haemodialysis using electronic nose and chemometrics, Biosensors and Bioelectronics, Volume 19, Issue 12, 15 July 2004, Pages 1581-1590<\/dc:identifier><dc:identifier>0956-5663<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/807<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.bios.2003.12.010<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0956-5663","0956-5663"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Kidney disease"],"subject":["Article"],"fullText":"Monitoring Haemodialysis Using \nElectronic Nose and Chemometrics \n \nReinhard FEND1, Conrad BESSANT2, Anthony J. WILLIAMS3, and Anthony C. \nWOODMAN1,*\n \n1)  Cranfield BioMedical Centre, Cranfield University at Silsoe, Silsoe, Bedfordshire, MK 45 4DT, UK \n2)  Cranfield Centre for Analytical Science, Cranfield University at Silsoe, Bedfordshire, MK 45 4DT, UK \n3)  Gloucester Royal Hospital, Great Western Road, Gloucester, Gloucestershire, GL 1 3NN, UK \n \n* Corresponding author: Tel.: +44-1525-863517, fax: +44-1525-863540 \n E-mail address: a.c.woodman@cranfield.ac.uk (A. C. Woodman) \nAbstract \nAn ever-increasing number of patients have to undergo regular renal dialysis to \ncompensate for acute or chronic renal failure. The adequacy of the treatment has a \nprofound effect on patients’ morbidity and mortality. Therefore it is necessary to \nassess the delivered dialysis dose. For the quantification of the dialysis dose two \nparameters are most commonly used, namely the Kt\/V value (normalised dose of \ndialysis) and the urea reduction rate, yet the prescribed dialysis dose often differs \nfrom the actual delivered dialysis dose. Currently, no interactive process is available \nto ensure optimal treatment. The aim of this study was to investigate the potential for \nan “electronic nose” as a novel monitoring tool for haemodialysis. Blood samples \nwere analysed using an electronic nose, comprising an array of 14 conducting \npolymer sensors, and compared to traditional biochemistry. Principal component \nanalysis and hierarchical cluster analysis were applied to evaluate the data, and \ndemonstrated the ability to distinguish between pre-dialysis blood from post-dialysis \nblood independent of the method used. It is concluded that the electronic nose is \ncapable of discriminating pre-dialysis from post-dialysis blood and hence, together \nwith an appropriate classification model, suitable for on-line monitoring.  \n \n \nKeywords: electronic nose, conducting polymers, renal failure, kidney disease, \nprincipal component analysis, hierarchical cluster analysis \n 1\n1. Introduction \n \nAn ever-increasing number of patients have to undergo regular renal dialysis to \ncompensate for acute or chronic renal failure. The estimated annual rate of patients \nstarting renal replacement therapy (RRT) in England and Wales is 89 per million \npopulation indicating that approximately 5350 patients started RRT in 2000, \nhaemodialysis (HD) being the predominant form of RRT (UK Renal Registry Report, \n2001). The frequency and length of dialysis is generally determined empirically, with \nlittle or no on-line analysis available to ensure optimal dosage. \n \n1.1 Renal failure and haemodialysis \nRenal failure is characterised by an impaired kidney function leading to \ndisturbances in waste excretion, hormone production and in the regulation of fluid and \nelectrolyte status. Therefore it is necessary to replace the kidney function by means of \nan artificial device (dialysis) or by organ transplantation. However, artificial devices \ncan only replace certain functions of the kidney, in particular the removal of waste \nproducts and excessive body fluids.  \nIt is well known that the prescribed dialysis dose differs from the actually delivered \ndialysis dose (Manzoni et al., 1996; Keshaviah, 2002). Therefore, it is necessary to \nquantify the delivered dialysis dose because the adequacy of the dose has a profound \neffect on patient morbidity and mortality (Manzoni et al., 1996; Shak, 1999). The \nconcept of dialysis adequacy was developed in the early 1970s to assess the treatment \nefficiency of end-stage renal disease (ESRD) patients (Canaud et al., 2000). From the \nvery beginning the removal of small molecules was considered important as they were \ndirectly linked to the symptoms and signs of uraemia (Keshaviah, 2002; Lindsay and \nSternby, 2001). Therefore, urea has been suggested as a surrogate marker for small \ntoxic solutes (Keshaviah, 2002), and gained wide acceptance in 1975 as a marker \nsubstance (Vanholder et al., 1994).  \nFor the quantification of the dialysis dose two parameters are most commonly \nused, namely the urea reduction rate (URR) and the normalised dose of dialysis \n(Kt\/V) (Lowrie, 2000; Lindsay and Sternby, 2001). Both parameters are based on \nurea. The URR is calculated from the pre-dialysis and post-dialysis blood urea \nnitrogen value, whereas the Kt\/V value is derived from urea kinetic modelling (Levy \n 2\net al., 2001, Kemp et al., 2001). Devices such as the Baxter Biostat 1000 (Baxter \nHealthcare Corp., McGaw Park, IL), the DQM 200 – Device (Gambro Lund AB, \nLund, Sweden), the Bio Care Device (Bio-Care Corp., Hsinchu, Taiwan) and the \nBellco – device (Bellco SpA, Miranda, Italy) are commercially available and calculate \neither of the two parameters on-line. However, there is a controversial discussion \nabout whether these parameters are appropriate or not (Vanholder et al., 2002; Lowrie \n2000). However, it has been shown that oversimplification of the “dialysis dose” to \nthe Kt\/V index might lead to dramatic underdialysis (Canaud et al., 2000). The Kt\/V \nvalue assesses only the removal of small water-soluble compounds from the body \n(Vanholder et al., 2002). Hence, the molecular size of urea means that convective \nand\/or diffusive transport of larger molecules is unlikely to be described by urea \nkinetics (Vanholder et al., 2002; Lowrie, 2000).  Both values (Kt\/V and URR) assume \na dialysis frequency of three times per week. However, recently published data \nsuggest that 5 % of all American patients skip a dialysis session in any month leading \nto an incorrect Kt\/V or URR value (De Palma et al., 2001).  Other pitfalls in \ncalculating the Kt\/V value come from the incorrect post-dialysis blood sampling such \nas urea-rebound effect, sample dilution with dialysis fluid or blood recirculation. (De \nPalma et al., 2001). However, careful post-dialysis blood sampling minimises the \ninfluence of these problems (Levy et al. 2001). \n \n1.2 Electronic nose technology \nElectronic nose (EN) is the colloquial name for an instrument made up of chemical \nsensors combined with some sort of pattern recognition system (Gardner and Bartlett, \n1994). The key idea of an EN is to mimic the human olfactory system. The human \nolfactory receptors are replaced by chemical sensors, which produce an electrical \nsignal (similar to nerve cells). These signals are subsequently analysed by an \nappropriate pattern recognition engine. The pattern recognition software corresponds \nto the cerebral cortex of the brain, and is able to classify or memorise odours. (Bartlett \net al., 1997; Pearce, 1997 (a and b)).   \nThe most commonly used types of sensors in electronic noses are: metal oxide \nsensors (Persaud et al., 1997; Dickinson et al., 1998), conducting polymers (Hatfield \net al., 1994; Gardner and Bartlett, 1995), and piezoelectric based sensors such as bulk \nacoustic wave sensors or surface acoustic wave sensors (D’Amico et al., 1997; Chang \n 3\net al., 2000). All types of sensors share a common basic principle. The interaction of \nvolatile compounds with the sensor surface leads to a change of physical properties \n(conductivity, resistance, frequency) of the sensor, which is measured. In other words, \nthe different types of sensor vary in the way the sensor response is generated.  \nElectronic noses have been applied in several areas to characterise the odour of \nproducts such as beer (Pearce et al., 1993), boartaint (Bourronnet et al., 1995), \ncardboard papers (Holmberg et al., 1995), coffee (Singh et al., 1996), and wine (Di \nNatale et al., 1996; Guadarrama et al., 2001). More recently electronic noses have \nbeen used for the quality control and process monitoring of foodstuffs such as olive \noil (Guadarrama et al., 2000; Guadarrama et al., 2001) or milk spoilage (Magan et al, \n2001). However, the ability of ENs as a diagnostic tool is attracting more and more \nresearch groups. It is well known that smell can be used to diagnose diseases  and has \nbeen used by both the Greeks and the Chinese since 2,000 BC (Mitruka, 1975). Of \nparticular interest are infectious diseases such as bacterial vaginosis (Chandiok et al., \n1997), pulmonary infections (Hanson et al., 1997), tuberculosis (Pavlou and Turner, \n2000), bacteruria (Aathithan et al., 2001) and urinary tract infections (Pavlou et al., \n2002) as well as breath analyses of patients suffering from diabetes (Ping et al., 1997) \nor uraemia (Lin et al., 2001). Di Natale and co-workers (1999) investigated the \ncapability of an EN to detect traces of blood in urine samples of kidney patients.  \nHowever, this group could not give an explanation of which volatiles are responsible \nfor the sensor response.   \n1.3 Aims \nThe study was divided into two parts. In the first part, the potential of an electronic \nnose as a novel monitoring system for haemodialysis was investigated. In the second \npart, the electronic nose data were compared to traditional biochemical monitoring \nparameters (urea, creatinine, etc.). The aim of the study was to find out whether there \nwas sufficient information within the data to discriminate between pre and post \ndialysis blood.  This was achieved using exploratory data analysis techniques. \n \n 4\n2. Materials and Methods \n \n2.1 Blood Collection \n \nBlood samples were collected either from patients undergoing intermittent HD-\ntreatment at Gloucester Royal Hospital or healthy volunteers (Control blood).  Ethical \napproval for this study was obtained from the Gloucestershire Research Ethics \nCommittee (Study No.: 01\/149G). All patients and volunteers participating in this \nstudy gave informed written consent before blood samples were taken. Each sample \nwas encoded to ensure anonymity.  \nAll patients are treated either with a Fresenius F6 or Fresenius F8 dialyser \n(Fresenius AG, Bad Homburg v.d.H., Germany) The surface area of the polysulfone \nmembrane is either 1.3 m2 (F6 dialyser) or 1.8 m2 (F8 dialyser). The blood flow \nvaried between 200 and 350 ml\/min, depending on the patient, whereas the dialysate \nflow rate was kept constant at 500 ml\/min. All patients included in this study undergo \nhaemodialysis treatment three times a week for four hours per session.  \n \n2.1.1 Blood collection for biochemical analysis \nFrom each patient, 10 ml of pre- and post-dialysis blood, respectively and from \neach volunteer 10 ml of control were drawn and placed in Vacuette® Serum tubes \n(Greiner, UK) prior to analysis by the Department of Chemical Pathology at \nGloucestershire Royal Hospital (Gloucester, UK).  \nThe relevant details (Gender, Age) are summarised in table 1. \n \nTable 1  \n \n2.1.2 Blood collection for the analysis of volatile compounds using an electronic nose \nThe analysis of volatile compounds by means of an electronic nose was performed on \nwhole blood. Therefore, sampling tubes containing EDTA as an anticoagulant \n(Greiner bio-one, Vacuette®, coagulation tubes) were used for blood sampling. A \nsubset (8 control samples, 11 dialysis patient) from the original 11 volunteers and 28 \n 5\npatients, respectively were used for this experiment, i.e. the blood samples were taken \nat the same time and from the same patients as for the biochemical analysis.  \n. From each patient, 4 ml of pre- and post-dialysis blood, respectively and from \neach volunteer 4 ml of control blood were taken. The blood samples were stored at –\n20 ºC until the analysis was performed.  \n \nThe relevant details (Gender, Age) are summarised in table 2. \n \nTable 2 \n \n2.2 Analysis of volatile compounds in blood \n \n2.2.1 Preparation of the blood samples \nBlood samples were defrosted on ice to minimise the loss of volatile compounds.  \nSamples were diluted 1:4 in 0.9 % (w\/v) NaCl-solution and mixed thoroughly. A 1 ml \naliquot of the diluted blood was transferred into a 10 ml headspace vial (Jaytee \nBioscience Ltd., UK) and immediately sealed using a crimp cap with Silicon\/Teflon-\nseptum (Jaytee Bioscience Ltd, UK). The sealed headspace vials were subsequently \nincubated for 45 minutes at 37 ºC.  \n \n2.2.2 Gas-sensing system and headspace sampling \n \nFor this study an EN (Bloodhound BH-114, Bloodhound Sensors, Leeds, UK) \nemploying 14 conducting polymers based on polyaniline was used. The sensor unit \nautomatically sets two calibration points. The first one is the baseline, which is \nobtained when activated carbon filtered (Carbon Cap 150, Whatman) air is passed \nover the sensor at a flow rate of 4 ml min-1. The second calibration point is a reference \npoint obtained from the headspace of a control sample vial containing 9 ml of RO-\nwater (Fig. 1).   \n 6\nTwo sensor parameters were selected in this study: divergence (maximum step \nresponse) and area (area under the response curve). The sampling profile was set at 10 \ns of absorption and 15 s of desorption.  \nFor the analysis of the unknown headspace, the sample vials were connected to the \n“electronic nose” by inserting a needle into the headspace of the sample vials (Fig. 1). \nThe test gaseous phase was passed over the sensor surface at a flow rate of 200 ml \nmin-1, which was automatically set by the sensor unit. Between each measurement, a \ntime delay of 2 minutes was set. The individual samples were randomly analysed. \n \nFig. 1 \n \n2.3 Data Analysis \n \nTo analysis the multivariate data, two standard methods, namely principal \ncomponent analysis (PCA) and hierarchical cluster analysis (HCA) were applied. \nPrior to these methods no scaling was undertaken. To perform these analyses an Excel \nadd-in software (XLstat©, version 3.4, France) was used. \n \n2.3.1 Principal Component Analysis  \nPCA is an unsupervised data reduction method. The basic idea of the method is to \ndescribe the variation of a multivariate data set in terms of a set of uncorrelated \nvariables, each of which is a particular linear combination of the original variables. In \nother words, the original data matrix is projected from a high dimensional space into a \nless dimensional space, preferably a plane or a 3-dimensional space. During the \nprocess the original data set is reduced in dimensions, i.e. is compressed, with as little \nloss of information as possible. This is achieved by filtering out the noise in the \noriginal data matrix, without removing essential information described in the variance \nof the data [Otto, 1999; Massart et al., 1988].  \nMathematically, the key idea of PCA is to decompose the original i x j data matrix \nX into its i x k score matrix T, its k x j loading matrix P and the residual matrix E \naccording to: \n 7\n X = TP + E   (1) \n \nwhere i is the number of samples, j is the number of variables and k is the number of \nprincipal components (PCs). The PCs are determined on the basis of the maximum \nvariance criterion. Each subsequent PC describes a maximum of variance, which is \nnot modelled by the previous one. According to this, the first PC contains the most of \nthe variance of the data [Otto, 1999; Everitt and Dunn, 2001]. The relationship \nbetween samples can be visualised by plotting the scores against each other.  \n           \n2.3.2 Hierarchical Cluster Analysis  \nHCA is an unsupervised method that combines individual samples into clusters \naccording to their similarities to each other. The similarity between two samples is \ndetermined by the (Euclidean) distance between them, which can be calculated for \ntwo samples p1 (x1, y1) and p2 (x2, y2) as follows: \n  \n d(p1,p2) = [(x1 – x2)2 +(y1-y2)2]1\/2   (2) \n \nwhere d(p1,p2)  is the distance between the two samples.  \nThe next step is the reduction of the distance matrix by aggregation of clusters, \nwhereby the clusters with the shortest distances between them are aggregated first. \nThe most commonly used technique, and the one used here, is the Ward’s method. \nThe key idea of this method is that clusters are aggregated in such a way, that a \nminimum increase in the within-group variance results [Otto, 1999; Everitt and Dunn, \n2001].  \n3. Results \n3.1 Biochemical Analysis \n \nFive biochemical parameters (urea, creatinine, carbon dioxide, phosphate, and \ncalcium phosphate) were selected for this analysis and are summarised in table 3. \n \n 8\nTable 3 \n \nAs expected, small uremic toxins such as urea and creatinine were effectively \nremoved during haemodialysis. However, the post-dialysis concentrations of these \nmolecules were higher than compared to healthy subjects. These results are well \nknown, but it is almost impossible to present this multivariate data set in a reasonable \nway (two- or three-dimensional space) in their raw form. Therefore, the original \nmatrix was reduced in dimensionality using PCA. The results of plotting the PCA \nscores for all samples is shown in Fig 2.  \n  \nFig. 2 \n \nFig 2a demonstrates that it is possible to discriminate between post- and pre-\ndialysis blood (dashed line) by using the first two PCs (axis 1 and 2), which account \nfor 83 % of the variance of the original data matrix. However, it was impossible to \nseparate control blood from post-dialysis blood, but according to table 3, there is a \nnotable difference. After introducing a third PC (vertical axis 3, Fig. 2b), which \naccounts for 14 % of variance, it was possible to distinguish between control blood \nand post-dialysis blood.    \nThe HCA revealded similar results to the PCA, as shown in Fig. 3. From the \noriginal 28-dialysis patients used in this analysis, only in 3 cases (patients: 15, 19, and \n24) was it not possible to distinguish between post- and pre-dialysis blood. This is due \nto small difference between pre – and post-dialysis blood, i.e. there is just a slight \ndecrease of the concentrations of the five biochemical parameters during dialysis \ntreatment  (data not shown). \n \nFig. 3  \n \n 9\n3.2 Analysis of volatile compounds in blood using an electronic nose \n \nAs can be seen in Fig. 4, a good separation between control blood, pre- and post-\ndialysis blood was obtained (dashed lines added by the author). The first two principal \ncomponents (PC) account for 94 % of the variance in the original data matrix. The \nthird PC accounts for just 2 % of the variance, and therefore made no significant \ncontribution to the discrimination of the samples. \n \nFig. 4 \n \nSimilar results were obtained when using HCA, as shown in Fig. 5. In one case \n(patient 9), no difference between pre- and post-dialysis blood was observable. It can \nbe seen that the odour of the post-dialysis sample of patient 1 (PoD1) resembled the \nodour of control blood, and the odour of the pre-dialysis sample (PD1) was similar to \npost-dialysis blood.  \n \n \n Fig. 5 \n \n \n4. Discussion  \n  \nThis study has shown that by application of multivariate methods combined with \ntraditional biochemistry (see 3.1) and modern electronic nose technology (see 3.2), \nrespectively, it might be possible to discriminate “uremic” blood from control blood. \nHowever, more important is the possibility to distinguish between pre- and post-\ndialysis blood. It has to be mentioned, that PCA as well as HCA are exploratory data \nanalysis techniques, whose main goal to visualise the original data matrix, i.e. they are \nnot classification methods. The application of these methods to traditional \nbiochemical data (Fig. 2 and 3), demonstrated the efficacy of these tools, even when \nthe outcome was not “blinded”.  \n 10\nIn the second part of the study, an electronic nose was applied to investigate the \nheadspace of “uremic” blood and control blood, respectively. The results of this \nexperiment were similar to the first one, i.e. a good separation between the different \ntypes of blood was possible. However, the physical and chemical basis leading to the \nsensor response were more complex. An electronic nose is an array of chemical gas \nsensors, therefore only gas molecules in the sample headspace contribute to the sensor \nresponse. The volatility of molecules is influenced by many parameters such as \nconcentration, equilibration temperature, equilibration time, and viscosity of the \nsample (Seto, 1994).  \nTo determine which volatiles may be responsible for the difference in electronic \nnose response, it is important to consider the nature of chronic renal failure and its \ntreatment. Chronic renal failure is characterised by the accumulation of waste \nproducts and excessive body fluids. These metabolic waste products as well as body \nfluids are normally excreted with urine. Therefore, “uraemic” blood contains \nnumerous compounds, some of them are volatile others are not. In the past, many \ngroups tried to identify “uraemic” molecules, which are generally divided into three \ngroups: small, middle and large molecules (Levy et al. 2001). Volatile compounds are \ngenerally small and polar (Gardner and Bartlett, 1999). In the past, several research \ngroups identified these molecules using mainly gas chromatography and gas \nchromatography – mass spectroscopy. The range of molecules retained in uraemia is \nbroad, including free organic acids, phenolic compounds, aliphatic amines, alcohols, \naldehydes, ketones and guanidines  (Baba et al., 1984; Liebich et al., 1984; Niwa et \nal., 1981; Liebich et al., 1977). All of them are present in elevated concentrations in \nCRF patients. Bowen et al. (1975) investigated benzyl alcohol present in blood of \nCRF patients. They found elevated values of benzyl alcohol in dialysis patients before \nthe session and lower levels after the treatment. Benzyl alcohol was not found in \nnormal controls. Baba et al. (1984) analysed serum aliphatic amines using HPLC. \nThey found a six-fold increase of methylamine and dimethylamine in uraemic serum \ncompared to normal control subjects.  The degree of removal of these compounds is \nsmaller than for urea and creatinine and is approximately 55% (Baba et al, 1984; \nLichtenberger et al., 1993). The same group found similar concentration of the \nvolatile ethanolamine in pre-dialysis serum and control serum, but a two-fold \nincreased level in post-dialysis samples (Baba et al., 1984).  Other investigators found \nvolatiles such as methylmercaptan (Dowty et al., 1975), acetone, 2-butanone, \n 11\nchloroform, benzene, toluene, pyridine, dipropylketone, cycloheaxanone, and 4-\nheptanone in uraemic blood (Liebich, 1977). All these substances are characterised by \na relatively small molecular weight (Mr < 500) and are retained in CRF patients. \nHowever, due to their low molecular weight they are effectively removed during a \nhaemodialysis session, leading to a decreased concentration in post-dialysis samples. \nOn the other hand, investigators found an increased oxidative stress in HD patients \nduring the treatment mainly caused by the incompatibility of the dialysis membrane. \nThis additional oxidative stress leads to the generation of free radicals causing \nenhanced lipid peroxidation (Tetta et al., 1999; Erdogan et al., 2002). The end \nproducts of lipid peroxidation are aldehydes (malonaldehyde, propanal), ketones \n(acetone) and small carbohydrates (ethane, pentane) (Hageman et al., 1992; \nCapodicasa et al., 1999). This process leads to a continuous increase of volatiles in \nthe blood during the treatment.  \nFrom this, we conclude that the sensor response is caused by the combined effect \nof a) removal of accumulated waste products, b) the generation of volatiles during HD \nvia lipid peroxidation and c) probably the generation of volatiles during the sample \nincubation period (e.g. ammonia from urea). Therefore, the difference between pre- \nand post-dialysis samples is mainly caused by different concentrations of molecules \nrather than the appearance of new molecules. Hudon et al. (2000) found that \nconducting polymers show a linear relationship between sensor response and \nconcentration. This finding is in agreement with Persaud et al. (1996). Our hypothesis \nis supported by the fact, that conducting polymers are very sensitive (5 – 0.1 ppm) \ntowards polar molecules (Schiffman et al. 1997).  \nIn the past only a few applications have been described in the literature where \nelectronic noses have been used for renal diseases. Among these is the work of Lin et \nal. (2001), who applied an electronic nose for the diagnosis of uraemia. This group \nfound marker substances in the breath of chronic renal failure patients such as di- and \ntrimethylamine, which allowed the differentiation between healthy controls and \nuraemic patients. Based on these findings, breath analysis may be a useful substrate \nfor a new monitoring system.  \nThe main aim was to investigate the potential of an electronic nose as a novel on-\nline monitoring system for haemodialysis. To date, no medical application could be \nfound in the literature where a gas-sensing array was applied on-line and in real-time. \nSuch applications described in the literature are mainly located in the food industry or \n 12\nfor waste water treatment. For example, Bourgeois et al. (2001) used an electronic \nnose for the on-line monitoring of waste water streams. \nThe electronic nose itself showed good reproducibility, i.e. any sensor drift was \ninsignificant compared to the difference between samples types.  \n \n \n5. Conclusions \n \nThis study suggests that electronic nose technology might be a useful tool in \ndiscriminating pre-dialysis form post-dialysis blood as well as control blood. Together \nwith an appropriate classification model, it might be possible to build an on-line \nmonitoring system for the management of renal failure. It might also be possible to \nimprove and modify currently used sensor arrays towards specific volatile markers or \nmarker groups, which would simplify the optimisation of such applications.  \nHowever, more work needs to be done to make this application a rapid and \nefficient diagnostic\/monitoring device.  \n \n \nAcknowledgement \nThe authors are grateful to the Renal Patient’s Association and Fresenius for financial \nsupport and to the Public Health Laboratory staff (Gloucester Royal Hospital, UK). R. \nFend would like to thank Sharon King for her help.  \n \n \n 13\nReferences \n \nAathithan S., Plant J. C., Chaudry A. N., French G. L. (2001), Diagnosis of \nBacteriuria by Detection of Volatile Organic Compounds in Urine using an \nAutomated Headspace Analyser with Multiple Conducting Polymer sensors, \nJournal of Clinical Microbiology, 39:2590-2593 \nBaba S., Watanabe Y., Gejyo F., Arakawa M. (1984), High-performance liquid \nchromatographic determination of serum aliphatic amines in chronic renal failure, \nClinica Chimica Acta 136:49-56 \nBartlett P. N., Elliot J. M., and Gardner J. W. (1997), Application of, and \nDevelopments in, Machine Olfaction, Annali Di Chimica, 87:33-44 \nBourgeois W., Burgess J. E., Stuetz R M. (2001), On-line monitoring of waste water \nquality: a review, J. Chem. Technol. Biotechnol. 76:337-348 \nBourronnet B et al. (1995), Application of a multi-gas-sensor device in the meat \nindustry for boar-taint detection, Sensors and Actuators B, 26-27:250-254 \nBowen D., Cowburn D., Rennekamp M., Sullivan J. (1975), Benzyl alcohol: high \nlevels found in plasma of uremic patients on hemodialysis, Clinica Chimica Acta \n61:399-401 \nCanaud B., Bosc J. Y., Carrol L., et al. (2000), Urea as a marker of adequacy in \nhemodialysis: Lessons from in vivo urea dynamics monitoring, Kidney \nInternation, 58:28-40 \nCapodicasa E., Trovarelli G., De Medio G., Pelli M., Lippi G., Verdura C., Timio M. \n(1999), Volatile Alkanes and Increased Concentrations of Isoprene in Exhaled Air \nduring Hemodialysis, Nephron 82:331-337 \nChandiok S., Crawley B. A., Oppenheim B. A., et al. (1997), Screening for bacterial \nvaginosis: a novel application of artificial nose technology, Journal of Clinical \nPathology, 50:790-795 \nChang S. M., Muramatsu H., Nakamura C. et al. (2000), The principle and \napplications of piezoelectric crystal sensors, Materials Sciences and Engineering \nC, 12:111-123 \nD’Amico A., Di Natale C. and Verona E. (1997), Acoustic Devices in Handbook of \nBiosensors and Electronic Noses Medicine, Food and the Environment, edited by \nE. Kress-Rogers, CRC press, New York, pp 197-223 \n 14\nDe Palma J. R., Pittard J. D. (2001), Dialysis dose, www.hemodialysis-inc.com\nDickinson T. A., White J., Kauer J. S., Walt D. R. (1998), Current trends in artificial-\nnose technology, Tibtech 16:250-258 \nDi Natale C. et al. (1996), An electronic nose for the recognition of the vineyard of a \nred wine, Sensors and Actuators, B33:83-88 \nDi Natale C., Mantini A., Macagnano A., et al. (1999), Electronic nose analysis of \nurine samples containing blood, Physiological Measurements, 20:377-384 \nDowty B., Charlisle D., Laseter J., Gonzalez F. (1975), Gas chromatographic mass \nspectrometric computer analysis of volatile compounds in blood plasma from \nhemodialysis patients, Biomed. Mass. Spectrometry 2:142-147 \nErdogan C. et al. (2002), The evaluation of oxidative stress in patients with chronic \nrenal failure, Clinica Chimca Acta 322:157-161 \nEveritt B. S., Dunn G. (2001), Applied Multivariate Data Analysis, Arnold Publishers,  \nLondon, 2001 \nGardner J. W., Bartlett P. N. (1995), Application of conducting polymer technology in \nmicrosystems, Sensors and Actuators A, 51:57-66  \nGardner J. W., Bartlett P. N. (1994), A brief history of electronic noses, Sensors and \nActuators B, 18-19:211-220 \nGardner J. W, Bartlett P. N. (1999), Electronic Noses: Principles and Applications, \nOxford University Press, Oxford, 1999 \nGuadarrama A., Rodriguez-Mendez M. L., De Saja J. A., et al. (2000), Array of \nsensors based on conducting polymers for the quality control of the aroma of the \nvirgin olive oil, Sensors and Actuators B, 69:276-282 \nGuadarrama A., Rodriguez-Mendez M. L., Sanz C., et al. (2001), Electronic nose \nbased on conducting polymers for the quality control of the olive oil aroma. \nDiscrimination of quality, variety of olive and geographic origin, Analytica \nChimica Acta, 342:283-292 \nHageman J., Bast A., Vermulen N. (1992), Monitoring of oxidative free radical \ndamage in vivo: analytical aspects, Chem. Biol. Interactions, 82:243-293 \nHanson C. W., et al. (1997), The use of a novel electronic nose to diagnose the \npresence of intrapulmonary infection, Anaesthesiology, 87 (3A), 269. \nHatfield J. V., Neaves P., Hicks P. J., et al. (1994), Towards an integrated electronic \nnose using conducting polymer sensors, Sensors and Actuators B, 18-19:221-228 \n 15\nHolmberg M., Winquist F., Lundström I., et al. (1995), Identification of paper quality \nusing a hybrid electronic nose, Sensors and Actuators B, 26-27:246-249 \nHudon G., Guy C., Hermia J. (2000), Measurement of Odor Intensity by an Electronic \nNose, Air and Waste Management Association, 50:1750-1758 \nKemp H. J., Parnham A., Tomson C. R. (2001), Urea kinetic modelling: a measure of \ndialysis adequacy, Annals of Clinical Biochemistry 38:20-27 \nKeshaviah P. (2002), Adequacy of dialysis: Comparison of hemodialysis (HD) to \nCAPD, Indian Journal of Nephrology, 16:51-55 \nLevy J., Morgan J., Brown E. (2001), Oxford Handbook of Dialysis, Oxford \nUniversity Press, Oxford, 2001 \nLichtenberger L., Gardner J., Barreto J., Dial E., Weinman E. (1993), Accumulation \nof Aliphatic Amines in Gastric Juice of Acute Renal Failure Patients, Digestive \nDiseases and Sciences 38\/10:1885-1888 \nLieblich H., Woell J. (1977), Volatile substances in blood serum: profile analysis and \nquantitative determination, Journal of Chromatography, 142:505-516 \nLieblich H, Pickert A., Tetschner B. (1984), Gas chromatographic and gas \nchromatographic-mass spectrometric analysis of organic acids in plasma of \npatients with chronic renal failure, Journal of Chromatography 289:259-266 \nLin Y. J., Guo H., Chang Y. (2001), Application of the electronic nose for uremia \ndiagnosis, Sensors and Actuators B, 76:177-180 \nLindsay R. M. and Sternby J. (2001), Future Directions in Dialysis Quantification, \nSeminars in Dialysis 14:300-307 \nLowrie E. G. (2000), The Normalised Treatment Ratio (Kt\/V) Is Not the Best Dialysis \nDose Parameter, Blood Purification, 18:286-294 \nMagan N., Pavlou A., Chrysanthakis I. (2001), Milk-sense: a volatile sensing system \nrecognises spoilage bacteria and yeasts in milk, Sensors and Actuators B, 72:28-\n34 \nManzoni C., Di Filippo S., Corti M, et al. (1996), Ionic dialysance as a method for the \non-line monitoring of delivered dialysis without blood sampling, Nephrology \nDialsysis Transplantation 11:2023-2030 \nMassart D. L., Vandeginste B. G. M., Dernign S. N., et al. (1988), Chemometrics: A  \nTextbook. Elsevier Science Publishers, 1998 \n 16\nMitruka B. M., (1975), Presumptive diagnosis of infectious diseases, in: Mitruka B. \nM. (ed.). Gas chromatographic applications in microbiology and medicine, New \nYork, John Wiley and Sons, pp: 349-374 \nNiwa T., Maeda K., Ohki T., et al. (1981), A gas chromatographic-mass spectrometric \nanalysis for phenols in uremic serum, Clinica Chimica Acta 110:51-57 \nOtto M. (1999), Chemometrics: Statistics and Computer Application in Analytical \nChemistry, Wiley-VCH, 1999 \nPavlou A. K., Magan N., McNulty C. et al., (2002), Use of an electronic nose system \nfor diagnosis of urinary tract infections, Biosensors and Bioelectronics 17:893-899  \nPavlou A., Turner A. P. F. (2000), Sniffing out the Truth: Clinical Diagnosis using the \nElectronic Nose, Clin Chem Lab Med, 38:99-112 \nPearce T. C. (1997a), Computational parallels between the biological olfactory \npathway and its analogue ‘The electronic nose’. 1. Biological olfaction, \nBiosystemes, 41:43-67 \nPearce T. C. (1997b), Computational parallels between the biological olfactory \npathway and its analogue ‘The electronic nose’. 2. Sensor based machine \nolfaction, Biosystemes, 41:69-90 \nPearce T. C., Gardner J. W., Friel S. (1993), Electronic nose for monitoring the \nflavour of beers, Analyst, 118:371-377 \nPersaud K. C., Khaffaf S. M., Payne J. S., Pisanalli A. M., Lee  D. H.,  Byun H.G., \n(1996), Sensor array techniques for mimicking the mammalian olfactory system, \nSensors and Acutators B 35-36:267-273 \nPersaud K. C. and Travers P. J. (1997), Arrays of Broad Specificity Film for Sensing \nVolatile Chemicals, in Handbook of Biosensors and Electronic Noses Medicine, \nFood and the Environment, edited by E. Kress-Rogers, CRC press, New York, pp. \n563-592 \nPing W., Yi T., Haibao X., et al. (1997), A novel method for diabetes diagnosis based \non electronic noses, Biosensors and Bioelectronics, 12:1031-1036 \nSchiffman S., Kermani B. Nagle H. (1997), Analysis of Medication Off-odors Using \nan Electronic Nose, Chemical Senses 22\/2:119-128 \nSeto Y., (1994) Determination of volatile substances in biological samples by \nheadspace gas chromatography, Journal of Chromatography A, 674:25-62 \nShak C. G. (1999), The role of Urea Kinetic Modelling in Determining Adequacy of \nHemodialysis, Nephrology News & Issues 13:14-16 \n 17\nSingh P. B., Brown R. E., Roser B. (1996), MHC antigens in urine as olfactory \nrecognition clues. Nature 327:161-164 \nTetta C, Biasioli S. Schiavon R., Inguaggiato P., David S., Panichi V., Wratten M. \n(1999), An Overview of Haemodialysis and Oxidant Stress, Blood Purification \n17:1118-126 \nUK Renal Registry Report (2001), UK Renal Registry, Bristol, UK, eds: Ansell D., \nFeest T, \nVanholder R., De Smet R., Chen H., et al. (1994), Uremic Toxicity: The middle \nmolecule hypothesis revisited, Seminars in Nephrology 14\/3:205-218 \nVanholder R., De Smet R., Lesaffer G. (2002), Dissociation Between Dialysis \nAdequacy and Kt\/V, Sem in Dialysis 15\/1:3-7 \n 18\nLegend: \n \nTable 1: Personal details of volunteers \/ patients for the biochemical analysis \n \nTable 2: Personal details of volunteers \/ patients for the analysis of volatile \ncompounds using an electronic nose \n \nTable 3: Summary of results of biochemical analysis, showing minimal (min) and \nmaximum (max) concentration as well as the mean concentration of Control blood, \nPost- and Pre-dialysis blood \n \n \nFig. 1: Experimental set-up of the electronic nose. The set-up consists of the \nelectronic nose itself, a sample and a control vial as well as two activated carbon \nfilters and a HEPA-Vent filter. The carbon filters ensure an odourless airflow over the \nsensor surface and control and sample headspace, whereas the HEPA-VENT filter \nprevents the fouling of the sensor surface. The electronic nose is connected to a PC \nrunning the control software and a data analysis package.  \n \nFig. 2: PCA – Analysis of Control blood (■), Post-dialysis blood (▲) and Pre-dialysis \nblood (●) based on five biochemical parameters. (a) The first two principal \ncomponents allow the discrimination between pre-dialysis blood and a mixed cluster \ncontaining post-dialysis blood samples and control blood samples. (b) The \nintroduction of a third principal component allows the discrimination between post-\ndialysis blood and control blood.  The Post- and Pre-dialysis blood with the same \nnumber belong to the same patient.  \n \nFig. 3: Cluster analysis of Control blood, Post-dialysis blood and Pre-dialysis blood \nbased on five biochemical parameters Legend: PD = Pre-dialysis blood, PoD = Post-\ndialysis blood, and C = Control blood \n \n 19\nFig. 4: PCA – Analysis of Control blood (■), Post-dialysis blood (▲) and Pre-dialysis \nblood (●) after 45 min incubation at 37 ºC. Post- and Pre-dialysis blood with the same \nnumber belong to the same patient.  \n \nFig. 5: Cluster Analysis of Control blood, Post- and Pre-dialysis blood after 45 min \nincubation at 37 ºC. Legend: PD = Pre-dialysis blood, PoD = Post-dialysis blood, and \nC = Control blood \n 20\nTable 1 \n \n Volunteers  \/ Patients Age \n No. of samples Female Male Mean Median Range \nControl blood 11 6 5 28.3 27 23 - 37 \n       \nPre- and Post- \ndialysis blood \n28 7 21 72.3 72.5 51 - 90 \n \n \nTable 2 \n \n Volunteers  \/ Patients Age \n No. of samples Female Male Mean Median Range \nControl blood 8 5 3 28 26.5 23 - 37 \n       \nPre- and Post- \ndialysis blood 11 3 8 72.2 77 51 - 86 \n \n \n 21\nTable 3 \n \n  Control blood Post – dialysis blood \nPre – dialysis \nblood \nMin 3.61 3.0 9.6 \nMax 7.37 16.6 36.1 \nUrea \n[mmol L-1] \nMean 4.87 7.45 21.4 \nMin 63.7 183 402 \nMax 100.2 659 1194 \nCreatinine \n[mmol L-1] \nMean 77.2 366.5 788.5 \nMin 23.12 26.0 20.00 \nMax 30.38 35.0 31.00 \nCO2 \n[mmol L-1] \nMean 25.76 29.8 25.39 \nMin 1.07 0.52 0.79 \nMax 1.30 1.65 2.78 \nPhosphate \n[mmol L-1] \nMean 1.16 0.94 1.64 \nMin 2.56 1.26 1.90 \nMax 3.50 4.31 6.67 Ca\n2+ x PO42- \n[mmol L-1] \nMean 2.90 2.37 4.17 \n \n 22\n \n \n \nHeadspace Vial with Aluminium  \nPTFE\/Silicone Pressure Release Seal \n \nActivated Carbon Filter \nElectronic Nose - \nBloodhound BH 114 \nControl Sample Vial \nNeedle \nPC with statistics \nsoftware package \nHEPA-VENTTM - Filter \nFig. 1  \n \n \n \n \n 23\n21 2\n3\n4\n5\n 6\n7\n8\n 910\n11\n1213 14\n15 16\n1718\n19\n 20\n21 22  23\n 24\n25\n26\n27\n28\n1\n2\n3\n4 5\n6\n7\n89\n10\n11\n12\n13\n14\n15\n16\n17\n1819\n20\n21\n22\n23\n24\n25\n26\n27\n28\n-2.5\n-2\n-1.5\n-1\n-0.5\n0\n0.5\n1\n1.5\n2\n2.5\n-4 -3 -2 -1 0 1 2 3 4 5 6\n-- Principal Component 1 (69% ) -->\n--\n P\nrin\nci\npa\nl C\nom\npo\nne\nnt\n 3\n (1\n4%\n ) \n--\n>\nPost-dialysis blood\nPre-dialysis blood\nControl blood\n28\n27\n26\n25\n24\n23\n22\n21\n20\n19\n18\n17\n16\n15\n14\n13\n12\n11\n10\n9\n8\n7 6\n5\n4\n3\n2\n1\n28\n27\n26\n25\n24\n23\n22\n21\n20\n19\n18\n17\n16\n15\n1413\n 12\n1110\n9\n8\n 7\n6\n 5\n 4\n3\n2 1\n2\n-2\n-1.5\n-1\n-0.5\n0\n0.5\n1\n1.5\n2\n2.5\n-4 -3 -2 -1 0 1 2 3 4 5 6\n-- Principal Component 1 (69% ) -->\n--\n P\nrin\nci\npa\nl C\nom\npo\nne\nnt\n 2\n (1\n5%\n ) \n--\n>\nPre-dialysis blood \n(a) \n(b)\nControl blood and \nPost-dialysis blood \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 2 \n 24\nDendrogram\nC1\nC2\nC3\nC4\nC5\nC6\nC7\nC8\nC9\nC10\nC11\nPoD 1\nPoD 2\nPoD 3\nPoD 4\nPoD 5\nPoD 6\nPoD 7\nPoD 8\nPoD 9\nPoD 10\nPoD 11\nPoD 12\nPoD 13\nPoD 14\nPoD 15\nPoD 16\nPoD 17\nPoD 18\nPoD 19\nPoD 20\nPoD 21\nPoD 22\nPoD 23\nPoD 24\nPoD 25\nPoD 26\nPoD 27\nPoD 28\nPD1\nPD2\nPD3\nPD4\nPD5\nPD6\nPD7\nPD8\nPD9\nPD10\nPD11\nPD12\nPD13\nPD14\nPD15\nPD16\nPD17\nPD18\nPD19\nPD20\nPD21\nPD22\nPD23\nPD24\nPD25\nPD26\nPD27\nPD28\n0 0.5 1 1.5 2 2.5 3\nDistance between samples\nFig. 3 \n \n 25\n  \n \n \n \n \n \n \n \n \n \n \n \n \n1110\n9\n8\n7\n6\n5\n4\n2\n3\n1\n11\n9\n10\n7\n8\n6\n4\n53\n2\n1\n-2.5\n-2\n-1.5\n-1\n-0.5\n0\n0.5\n1\n1.5\n2\n2.5\n-8 -6 -4 -2 0 2 4 6 8\n-- Principal Component 1 (89% ) -->\n--\n P\nrin\nci\npa\nl C\nom\npo\nne\nnt\n 2\n (5\n%\n ) \n--\n>\nPost-dialysis blood Pre-dialysis blood Control blood\n \n \n \n \n \n \nFig. 4 \n \n \n \n \n 26\nDendrogram\nPD11\nPD10\nPD9\nPD8\nPD7\nPD6\nPD5\nPD4\nPD2\nPD3\nPD1\nPOD11\nPOD9\nPOD10\nPOD7\nPOD8\nPOD6\nPOD4\nPOD5\nPOD3\nPOD2\nPOD1\nC8\nC7\nC6\nC5\nC4\nC3\nC2\nC1\n0 2 4 6 8 10 12 14 16 18\nDistance between samples\n \nFig. 5 \n \n \n \n \n \n \n \n 27\n"}