{"doi":"10.1046\/j.1365-8711.2002.05667.x","coreId":"194805","oai":"oai:lra.le.ac.uk:2381\/781","identifiers":["oai:lra.le.ac.uk:2381\/781","10.1046\/j.1365-8711.2002.05667.x"],"title":"Brown dwarfs in the pleiades: spatial distribution and mass function","authors":["Jameson, Richard F.","Dobbie, P. D.","Hodgkin, S. T.","Pinfield, D. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-09-27","abstract":"Using new infrared data we have reassessed the membership status of candidate low-mass Pleiads unearthed by the International Telescope Project IZ survey. Those with I–K colours consistent with membership of the Pleiades have been compiled with candidate brown dwarfs identified by three other large, deep far-red CCD surveys of the cluster to yield the biggest magnitude-limited sample of substellar members to date. We fit King profiles to their spatial distribution to determine the Pleiades brown dwarf core radius to be rc= 2.22+1.36−0.67 degrees (or 5.0+3.0−1.5 pc). This is consistent with a continuation of the rc∝ m−0.5 relationship found previously for the higher-mass stellar members and suggests that the brown dwarf members are also dynamically relaxed. Using our spatial model we derive the Pleiades mass function in the substellar regime and are able to place stringent limits on its shape. We find that it is well represented by a power law with index α= 0.41 ± 0.08 (0.035 M⊙≲ M ≲ 0.3 M⊙). This result is largely insensitive to our choice of evolutionary model and uncertainties in the cluster age and distance. It is only marginally sensitive to the brown dwarf binary fraction. By assuming that the cluster mass function continues to rise down to the deuterium-burning limit, we estimate that the total brown dwarf mass of the Pleiades is 13+4−3 M⊙. This only represents ∼2 per cent of the total cluster mass. Given that the present-day cluster mass function should be a good representation of the initial mass function, we conclude that brown dwarfs do not contribute significantly to disc dark matter","downloadUrl":"http:\/\/hdl.handle.net\/2381\/781","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/781\/1\/Jameson_et_al-2002-Monthly_Notices_of_the_Royal_Astronomical_Society.pdf","pdfHashValue":"73b6c2db0dec86b17c4f65a697c1ec8bb7e37727","publisher":"Oxford University Press (OUP), Royal Astronomical Society","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/781<\/identifier><datestamp>\n                2015-11-24T03:22:41Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nBrown dwarfs in the pleiades: spatial distribution and mass function<\/dc:title><dc:creator>\nJameson, Richard F.<\/dc:creator><dc:creator>\nDobbie, P. D.<\/dc:creator><dc:creator>\nHodgkin, S. T.<\/dc:creator><dc:creator>\nPinfield, D. J.<\/dc:creator><dc:subject>\nstars: low-mass, brown dwarfs<\/dc:subject><dc:subject>\nstars: luminosity function, mass function<\/dc:subject><dc:subject>\nopen clusters and associations: individual: Pleiades<\/dc:subject><dc:subject>\ninfrared: stars<\/dc:subject><dc:description>\nUsing new infrared data we have reassessed the membership status of candidate low-mass Pleiads unearthed by the International Telescope Project IZ survey. Those with I–K colours consistent with membership of the Pleiades have been compiled with candidate brown dwarfs identified by three other large, deep far-red CCD surveys of the cluster to yield the biggest magnitude-limited sample of substellar members to date. We fit King profiles to their spatial distribution to determine the Pleiades brown dwarf core radius to be rc= 2.22+1.36−0.67 degrees (or 5.0+3.0−1.5 pc). This is consistent with a continuation of the rc∝ m−0.5 relationship found previously for the higher-mass stellar members and suggests that the brown dwarf members are also dynamically relaxed. Using our spatial model we derive the Pleiades mass function in the substellar regime and are able to place stringent limits on its shape. We find that it is well represented by a power law with index α= 0.41 ± 0.08 (0.035 M⊙≲ M ≲ 0.3 M⊙). This result is largely insensitive to our choice of evolutionary model and uncertainties in the cluster age and distance. It is only marginally sensitive to the brown dwarf binary fraction. By assuming that the cluster mass function continues to rise down to the deuterium-burning limit, we estimate that the total brown dwarf mass of the Pleiades is 13+4−3 M⊙. This only represents ∼2 per cent of the total cluster mass. Given that the present-day cluster mass function should be a good representation of the initial mass function, we conclude that brown dwarfs do not contribute significantly to disc dark matter.<\/dc:description><dc:date>\n2009-12-08T16:24:46Z<\/dc:date><dc:date>\n2009-12-08T16:24:46Z<\/dc:date><dc:date>\n2002-09-27<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nMonthly Notices of the Royal Astronomical Society, 2002, 335 (3), pp.853-863<\/dc:identifier><dc:identifier>\nhttp:\/\/onlinelibrary.wiley.com\/doi\/10.1046\/j.1365-8711.2002.05667.x\/abstract<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/781<\/dc:identifier><dc:identifier>\n10.1046\/j.1365-8711.2002.05667.x<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:relation>\nX-ray and Observational Astronomy<\/dc:relation><dc:rights>\nThis article has been accepted for publication in Monthly Notices of the Royal Astronomical Society, Copyright 2002 RAS Published by Oxford University Press on behalf of the Royal Astronomical Society. All rights reserved.<\/dc:rights><dc:publisher>\nOxford University Press (OUP), Royal Astronomical Society<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007","X-ray and Observational Astronomy"],"year":2002,"topics":["stars: low-mass, brown dwarfs","stars: luminosity function, mass function","open clusters and associations: individual: Pleiades","infrared: stars"],"subject":["Article"],"fullText":"Mon. Not. R. Astron. Soc. 335, 853–863 (2002)\nBrown dwarfs in the Pleiades: spatial distribution and mass function\nR. F. Jameson,1\u0002 P. D. Dobbie,1 S. T. Hodgkin2 and D. J. Pinfield3\n1Astronomy Group, Department of Physics and Astronomy, University of Leicester, University Road, Leicester LE1 7RH\n2Institute of Astronomy, Madingley Road, Cambridge CB3 0HA\n3Astrophysics Research Institute, Liverpool John Moores University, Birkenhead, CH41 1LD\nAccepted 2002 May 8. Received 2002 May 7; in original form 2002 April 10\nABSTRACT\nUsing new infrared data we have reassessed the membership status of candidate low-mass\nPleiads unearthed by the International Telescope Project I Z survey. Those with I–K colours\nconsistent with membership of the Pleiades have been compiled with candidate brown dwarfs\nidentified by three other large, deep far-red CCD surveys of the cluster to yield the biggest\nmagnitude-limited sample of substellar members to date. We fit King profiles to their spatial\ndistribution to determine the Pleiades brown dwarf core radius to be rc = 2.22+1.36−0.67 degrees\n(or 5.0+3.0−1.5 pc). This is consistent with a continuation of the rc ∝ m−0.5 relationship found\npreviously for the higher-mass stellar members and suggests that the brown dwarf members\nare also dynamically relaxed. Using our spatial model we derive the Pleiades mass function\nin the substellar regime and are able to place stringent limits on its shape. We find that it\nis well represented by a power law with index α = 0.41 ± 0.08 (0.035 M\u0007\u0001M \u0001 0.3 M\u0007).\nThis result is largely insensitive to our choice of evolutionary model and uncertainties in the\ncluster age and distance. It is only marginally sensitive to the brown dwarf binary fraction. By\nassuming that the cluster mass function continues to rise down to the deuterium-burning limit,\nwe estimate that the total brown dwarf mass of the Pleiades is 13+4−3 M\u0007. This only represents\n∼2 per cent of the total cluster mass. Given that the present-day cluster mass function should\nbe a good representation of the initial mass function, we conclude that brown dwarfs do not\ncontribute significantly to disc dark matter.\nKey words: stars: low-mass, brown dwarfs – stars: luminosity function, mass function – open\nclusters and associations: individual: Pleiades – infrared: stars.\n1 I N T RO D U C T I O N\nIt has long been recognized that the Pleiades open (galactic) cluster\nis a very suitable hunting ground for brown dwarfs (BDs) (e.g.\nJameson & Skillen 1989; Stauffer et al. 1989). The cluster is nearby,\nbut not so close as to cover a very large area of sky. It is also\nyoung, so any BDs have not had much time to cool and are therefore\ncomparatively bright. Furthermore one might hope that the present-\nday cluster mass function would provide a reasonable measure of\nthe initial mass function, which contains information on the process\nof star formation (e.g. Adams & Fatuzzo 1996; Elmegreen 2000).\nOne of the original scientific motivations for searching for BDs was\nto see if they might make a significant contribution to disc dark\nmatter, which is inferred from various ‘stellar tracer’ populations\n(e.g. Bahcall, Flynn & Gould 1992).\nEstimation of both the luminosity and mass functions for the\nentire Pleiades cluster requires a knowledge of how the stars and\n\u0002E-mail: pdd@star.le.ac.uk\nBDs are distributed. It is well known that the lower-mass stars in\nan open cluster are more widely spread than the high-mass stars\n(e.g. Spitzer & Mathieu 1980). Thus a survey of the central regions\nof the Pleiades will not be representative of the cluster as a whole.\nThe cluster spatial distribution can be modelled by a King profile\n(King 1962). An important parameter of this distribution is the core\nradius, the radius at which the surface density of members falls to\nhalf its central value. The core radius is known to vary with stellar\nmass (Pinfield, Jameson & Hodgkin 1998). Thus to obtain the mass\nfunction of the whole cluster we need to determine the core radii for\nboth the stars and the BDs.\nIn this paper we bring together data from the four largest opti-\ncal surveys for Pleiades BDs. We determine the core radius of the\nPleiades BDs and place stringent constraints on the cluster luminos-\nity and mass functions in the substellar regime. In the next section we\nbriefly review, in turn, the four optical surveys. We discuss the photo-\nmetric systems used by each and develop prescriptions to transform\nall I photometry onto the IC system. In Section 3 we present our\nfollow-up K-band photometry for candidate Pleiads from the ITP\n(Zapatero-Osorio et al. 1999) and the CFHT (Bouvier et al. 1998)\nC© 2002 RAS\n854 R. F. Jameson et al.\nsurveys. We construct an I, I –K colour–magnitude diagram (CMD)\nand from this draw a refined list of probable substellar cluster mem-\nbers. In Section 4 we examine the spatial distribution of cluster BDs\nand attempt to measure their core radius. Finally we use our new\nestimate of core radius to derive the cluster luminosity and mass\nfunctions presented in Section 5.\n2 T H E O P T I C A L C C D S U RV E Y S\nTo construct luminosity and mass functions for the Pleiades we\nconsider the four largest area optical surveys to date. These are, in\nno particular order, the International Telescope Project (ITP) survey\n(Zapatero-Osorio et al. 1997c, 1999), the Canada France Hawaii\nTelescope (CFHT) survey (Bouvier et al. 1998), the Burrell Schmidt\n(BPL) survey (Pinfield et al. 2000) and the INT Wide Field Camera\n(IWFC) survey (Dobbie et al. 2002a). We note that Adams et al.\n(2001) have surveyed the entire cluster for stellar members down\nto ∼0.1 M\u0007 using 2MASS near-infrared photometry and proper\nmotions derived from POSS plates digitized by the USNO PMM\nprogram.\n2.1 The ITP survey\nA deep I Z survey covering ∼1 square degree in the central re-\ngion of the Pleiades cluster is presented by Zapatero-Osorio et al.\n(1999). In their table 2 they list a total of 47 candidates with I mag-\nnitudes in the range 17.3–22.3, which were selected on the the basis\nof their position in the I, I –Z CMD. The survey is quoted as be-\ning complete up to IC ∼ 21, Z ∼ 20.5. One of the faintest of these\nITP sources is, to date, the coolest candidate Pleiad for which an\noptical spectrum has been obtained. The early-L type Roque 25 is\ndiscussed in detail by Martı´n et al. (1998). Optical spectroscopy and\ninfrared photometry for several other ITP sources has been presented\nby Zapatero-Osorio, Rebolo & Martı´n (1997a) and Martı´n et al.\n(2000).\n2.2 The CFHT survey\nBouvier et al. (1998) report the identification of 26 candidate cluster\nmembers in a 2.5-square-degrees survey of the Pleiades, complete up\nto R ∼ 23 and IC ∼ 22 (though the effective survey limit is IC ∼ 19.5\nfor the Pleiades sequence due to the saturation of the R–I colour).\nThey proposed that 17 were substellar. However, more-recently-\npublished infrared data indicate that CFHT-PL-19, CFHT-PL-20\nand CFHT-PL-22 are not members of the Pleiades (Martı´n et al.\n2000). An optical spectrum of CFHT-PL-26 and the proper motions\nof CFHT-PL-14 and CFHT-PL-18 suggest that they too are most\nprobably not cluster members (Martı´n et al. 2000; Moraux, Bouvier\n& Stauffer 2001). Hence of the original 17 candidate substellar\nPleiads there remain 9 which are not common to the ITP survey.\n2.3 The Burrell Schmidt survey\nA 6-square-degree I Z survey of the Pleiades undertaken with the\nKitt Peak Burrell Schmidt telescope is presented by Pinfield et al.\n(2000). The survey is quoted as being complete up to IC ∼ 19.5,\nthough the large (2-arcsec) pixel scale means that BD candidates\nclose to brighter stars could not be detected owing to blending (e.g.\nPIZ 1, Cossburn et al. 1997). A total of 30 likely BD candidates was\ninitially proposed on the basis of follow-up K-band photometry and,\nfor the brighter candidates, Schmidt plate proper motions. However,\nBPL 283 (CFHT-PL-18) does not show the expected litium absorp-\ntion (Martı´n et al. 2000) and recently-acquired JHK data (Pinfield\net al. 2002, in preparation) indicate that BPL132 (Roque 11),\nBPL168 and BPL249 are non-members. Here we assume that the\nremaining 26 of the initial 30 candidates identified by Pinfield et al.\n(2000) are members of the cluster. Of these, 10 are not duplicated\nin the ITP and CFHT surveys.\n2.4 The INT Wide Field Camera survey\nThe fourth data set is drawn from a recently-published survey un-\ndertaken with the INT telescope and Wide Field Camera (WFC)\nas part of the Wide Field Survey project (McMahon et al. 2001).\nDobbie et al. (2002a) have surveyed an area of 1.1 square degrees\nof the Pleiades in the IH and ZRGO bands down to a 90 per cent com-\npleteness limit of IH ∼ 21.8. A list of 23 likely low-mass members\nis proposed on the basis of additional follow-up K-band photome-\ntry, 15 of which are previously unpublished. The faintest candidate\nidentified by Dobbie et al. (2002a), INT-PL-IZ-69, has a mass of\nM ∼ 0.03 M\u0007 and may be the coolest Pleiad published to date.\n2.5 I-band CCD photometry\nOne of the principle problems when intercomparing CCD surveys\nis the variety of filter systems in use with different telescopes. Al-\nthough most observers transform photometry onto a standard system\n(e.g. IC), this is fraught with difficulty for very-red stars because of\nthe notable lack of extremely-red standard stars. This is especially\ntrue for the R and I passbands where glass and interference CCD\nfilters deviate significantly from the response of the filter–detector\ncombination employed by Landolt.\nThe I photometry in Zapatero-Osorio et al. (1999) lies on the\nHarris system – that is to say Harris filters (RH,IH) were used with\nLandolt standards. RH is a very good match to RC, but the IH response\nis quite different from IC. For observations calibrated by standards\nthat are not particularly red (as was the case for the ITP survey), there\nis little difference between the two systems, with the net result that\nthe I-band data to all intents and purposes lie on the Harris system.\nThe I photometry in Dobbie et al. (2002a) was similarly obtained\nusing the Harris I filter of the WFC. However, no attempt was made\nby those authors to transform the instrumental magnitudes onto the\nstandard IC system and hence these too lie on the Harris system.\nUsing observed and synthetic photometry drawn from Cossburn\net al. (1998), Dobbie et al. (2002b) and the 2MASS Second Incre-\nmental Point Source Catalogue (SIPSC) (e.g. Skrutskie et al. 1995),\nwe have derived the equation IC − IH = 0.172(IH − K ) − 0.204\n(2.3\u0002 IH − K \u0002 5.0) to transform these magnitudes onto the IC sys-\ntem. Not surprisingly, Bouvier et al. (1998) and Festin (1998), both\nof whom made a specific effort to observe a number of very-red\nstandards to ensure that their photometry was reliably transformed\nonto the Cousins system, have noticed discrepancies between the\nphotometry of Zapatero-Osorio et al. (1999) and their own. We be-\nlieve these discrepancies are fully explained by the difference in the\nfilter systems. For example, for Teide 1, after applying the transfor-\nmation, we find IC = 19.22, within a few per cent of Festin, who\nmeasures IC = 19.26. For the Roque candidates, the new values are\nincluded in Table 1 in preference to the original photometry pre-\nsented in Zapatero-Osorio et al. (1999). For completeness, we have\nalso listed IC photometry from the literature where available.\nThe BPL survey was measured using the Kitt Peak I interfer-\nence filter. To investigate the relationship between KPNO I(IKP)\nand Cousins I, we have compared synthetic IKP and IC magnitudes\ngenerated using the flux-calibrated spectra of the sample of field\nC© 2002 RAS, MNRAS 335, 853–863\nBrown dwarfs in the Pleiades 855\nTable 1. Columns 1 and 2 give the outer and average radii for each annulus. Column 3 gives the surveyed area of each annulus.\nColumn 4 gives the number of BDs from our magnitude-limited sample in each annulus. Columns 5, 6 and 7 give the surface\ndensity, the annulus area and the inferred magnitude-limited total of BDs in each annulus. The quoted uncertainties stem from\ncounting statistics.\nRadius of annulus r◦ Area surveyed Number of BDs Surface density Area of annulus Cumulative total\n(◦) (sq. ◦) (per sq. ◦) (sq. ◦)\n1.0 0.71 1.760 11 6.25 ± 1.88 3.142 19.64 ± 5.91\n1.5 1.27 2.512 12 4.78 ± 1.38 4.712 42.16 ± 8.79\n2.2 1.88 3.308 9 2.72 ± 0.91 10.493 70.70 ± 12.98\nstars employed in Dobbie et al. (2002b). The majority of these stars\nwere originally drawn from the recent 2MASS survey and hence ob-\nserved K photometry has been obtained from the SIPSC. We find that\nthe transform between the two systems is described by the equation\nIC − IKP = 0.049(IKP − K ) + 0.069 (2.3\u0002 IKP − K \u0002 5.8). The typ-\nical differences are found to be consistent with the values derived\nfrom Bessel (1986) using his diagram of IC − ICCD as a function\nof R − I . We have therefore converted the Pinfield et al. (2000)\nphotometry to Cousins using this equation, though preferring other\nestimates of IC (e.g. from the CFHT, ITP or IWFC surveys) where\nthey exist.\n3 I N F R A R E D P H OTO M E T RY O F C A N D I DAT E\nC L U S T E R M E M B E R S\nContamination in the optical colour–magnitude (I–Z and R–I) di-\nagrams is rather uncertain. Martı´n, Rebolo & Zapatero-Osorio\n(1996) present spectroscopic follow-up of a deep RI CCD survey\n(Zapatero-Osorio et al. 1997a) and find that only 50 per cent of their\ncolour–magnitude selected candidates are likely cluster members,\nthe remainder being field M-type dwarfs. Moraux et al. (2001) find\nthe level of contamination in the CFHT survey to be 31 per cent,\nclose to the Bouvier et al. prediction of 25 per cent which was based\non the field-star luminosity function as determined from the DENIS\nsurvey.\nAll four surveys have removed or flagged extended (i.e. likely\ngalaxy) contaminants. A further problem for the ITP, Burrell\nSchmidt and IWFC surveys is the small colour baseline of the I Z\nfilter combination. The cluster sequence is not as well separated\nfrom the field as one would find with longer-baseline colours such\nas I–K. Thus, especially towards the limit of the survey where pho-\ntometric errors become significant (\u0006I = 0.15 mag at I = 22), one\nmay expect a number of objects that are really below the sequence\nto appear red enough to be included in the sample.\nBefore we can accurately determine the luminosity and mass\nfunctions of the Pleiades, it is crucial to weed out the bulk of these\ncontaminants. Dobbie et al. (2002a), Pinfield et al. (2000), Hodgkin\net al. (1999) and Zapatero-Osorio, Martı´n & Rebolo (1997b) have\nshown that an additional measurement at K provides an efficient test\nfor cluster membership in the absence of spectroscopy and proper\nmotions.\n3.1 IR observations\nOur K-band photometry for the IWFC and BPL candidates has been\npublished by Dobbie et al. (2002a) and Pinfield et al. (2000), re-\nspectively. We also supplement the K-band photometry of Pinfield\net al. (2000) with some improved measurements taken from Pinfield\net al. (2002, in preparation). K- (and some J- and H-) band photom-\netry were obtained for the bulk of ITP candidates and the probable\nBDs of the CFHT survey using United Kingdom Infrared Telescope\n(UKIRT) and the IRCAM3 instrument. The data were acquired dur-\ning photometrically-good periods on the nights 1997 November 26\nto December 2 and 1998 November 14–15. IRCAM3 is a 256 × 256\npixel InSb array which for the course of these observing runs was\nemployed with the JBarr, HBarr and KOcli filters. Each candidate was\nobserved for a total of between 150 and 300 s, depending on the I\nmagnitude, initially at K, and where a candidate appeared to be on\nor near to the Pleiades sequence also at J and H. A five-point dither\npattern was used throughout, placing the star on a different part of\nthe detector for each of five sub-exposures. This enables accurate\nflatfielding by using the median of each pixel to derive a sky flat for\neach target.\nAll data reduction (dark subtraction, flatfielding) was performed\nwithin the STARLINK IRCAMDR package. Instrumental magnitudes\nwere also measured using the IRCAMDR package. Photometric errors\nfor the targets were derived from the scatter in each of the five subex-\nposures. To calibrate the JHK photometry observations of UKIRT,\nfaint standards (from the list of Casali & Hawarden 1992) were ob-\ntained each night at a variety of airmasses. The typical residuals\nin the airmass curves for the nights in question were found to be\n∼0.02 mag. These were quadratically combined with the pho-\ntometric errors to provide an estimate of the overall uncer-\ntainty. Subsequently, the photometry was transformed onto the\nMauna Kea Observatories (MKO) system using the equations\nof Hawarden et al. (2001). Where no J photometry was avail-\nable, a colour of J–K = 1.0 was assumed, which is appropri-\nate to objects of mid- to late-M spectral type (e.g. Kirkpatrick\net al. 1999). Our MKO magnitudes and corresponding uncertain-\nties for the brown dwarf candidates are presented in Table 1. We\nfind that, where available for candidates, previously published in-\nfrared data (e.g. Martı´n et al. 2000) are largely consistent with this\nphotometry.\n3.2 Selection of low-mass Pleiads from the IK CMD\nThe IC, IC–KMKO (hereafter I, I –K) CMD for the bulk of the ITP\ncandidates is shown in Fig. 1. Candidate Pleiades BDs from the\nCFHT, BPL and IWFC surveys are shown as filled circles. Over-\nplotted are the NEXTGEN and DUSTY model isochrones for so-\nlar metalicity and ages of 125 and 120 Myr, respectively (Baraffe\net al. 1998; Chabrier et al. 2000). As was done in Dobbie et al.\n(2002a), these have been offset with a distance of (m − M)0 = 5.53\n(Crawford & Perry 1976) and modified for an extinction of\nAI = 0.07 and a reddening of E(I − K = 0.06) (Fitzpatrick 1999).\nWe note that for objects of late-M spectral type, KCIT = KMKO.\nThe strengths of the Lyon group’s models include a detailed and\nself-consistent full non-grey treatment of the stellar atmosphere.\nIn contrast, the models of other theoretical groups (e.g. D’Antona\nC© 2002 RAS, MNRAS 335, 853–863\n856 R. F. Jameson et al.\nFigure 1. An I–K colour–magnitude plot of candidate low-mass Pleiads\nfrom the four optical surveys. Candidates drawn from the CFHT, BPL and\nIWFC surveys and ITP candidates found here to have I–K colours con-\nsistent with cluster membership are represented by filled circles; ITP candi-\ndates deemed non-members are represented by open circles. The NEXTGEN\n(125 Myr; dashed line) and DUSTY (120 Myr; dot–dashed line) theoretical\nisochrones of Baraffe et al. (1998) and Chabrier et al. (2000), respectively,\nare also shown. Our estimated location of the cluster sequence in the range\n19.2 < I < 20.4 is shown by the dotted line.\n& Mazzitelli 1997; Burrows et al. 1993, 1997) employ, to some\ndegree, simpler grey approximations at this outer boundary which\nin addition to differences in the treatment of convection leads to\nthe overestimation of Teff and luminosity at a given mass (e.g.\nsee Baraffe et al. 2002; Chabrier & Baraffe 1996; D’Antona &\nMazzitelli 1997). The detailed treatment of the atmosphere also\nmeans that the Lyon models directly predict the flux in the relevant\nphotometric bands. Hence they do not rely on the application of un-\ncertain bolometric corrections and temperature–colour relationships\nto be transformed onto the observational plane as do the other evo-\nlutionary models. Furthermore, the Lyon group models have been\nfound to be most successful in predicting coeval ages for the differ-\nent mass components in the young multiple system GG Tau (White\net al. 1999). The atmospheres used in the DUSTY models, unlike\nthose used in the NEXTGEN calculations, include a treatment for\nthe formation in cool stellar atmospheres of dust grains: at Teffs that\ncorrespond to late-M and early-L spectral-types, species such as\nTiO and VO begin to condense into dust grains, reducing the level\nof opacity in the I band and resulting in objects having bluer I–K\ncolours than predicted by the NEXTGEN models.\nA glance at the I, I –K CMD reveals a distinct cluster sequence\ndown to I ∼ 19.2, approximately the completeness limit of the BPL\nand CFHT surveys. The level of agreement between the locations of\nthe observed sequence at I \u0001 19.2 and the NEXTGEN isochrone is\nmost satisfying. The cluster binary sequence is also clearly seen\nin the upper quarter of this plot, sitting 0.75 above the single-\nstar sequence. However, this appears to truncate at I–K ∼ 4.2. A\nrather less obvious cluster sequence continues at fainter magnitudes\n(IC\u0003 20.5), the location of which is rather well matched by the\nDUSTY isochrone. We note also a number of sources clumped\naround I ∼ 20.2, I–K ∼ 4.8, approximately 0.75 mag above the\nDUSTY isochrone. We suggest that the observed features of the\nCMD can be explained if the I, I –K isochrone steepens dramati-\ncally at around I–K ∼ 4.0–4.4 as dust begins to exert an influence\non the I–K colour. The cluster sequence then turns back towards\nthe red at I \u0003 20.4, following the DUSTY model predictions quite\nclosely. We have indicated the likely form of the sequence from\nI = 19.2–20.4 with a dotted line in Fig. 1. In this interpretation,\nthe single and binary star sequences would appear to merge be-\ntween 19.2\u0001 I \u0001 19.8. The clump of objects discussed above would\nrepresent the binary sequence after demerging from the single-star\nsequence.\nTo select candidate cluster members from the I, I –K CMD once\nagain, we opt to follow closely the arguments of Dobbie et al.\n(2002a). We use the NEXTGEN isochrone as a guide for I \u0001 19.2,\nthe DUSTY isochrone for I \u0003 20.4 and our dotted line between\nthese limits. In addition we take into account uncertainties in the\nage and the distance of the cluster and the effect of the cluster depth\n(±0.2 mag). The likely extremes of the age of the cluster (70–\n150 Myr) result in a displacement of the theoretical substellar se-\nquence by ∼−0.3 and ∼+0.1 mag, respectively. Different distance\nestimates result in a displacement of∼−0.2 ( Hipparcos) and∼+0.1\n(photometry). An additional factor that must be taken into account\nhere is the presence of unresolved binaries which may lie up to\n0.75 mag above the single-star sequence (e.g. Steele & Jameson\n1995). Accounting for all these uncertainties and allowing for a\nsmall degree of error in both the theoretical models and the trans-\nforms, we choose to select all candidates lying no more than 0.3 mag\nbelow and no more than 1.0 mag above the single-star sequence. In\nthis way we identify 20 of the ITP candidates as probable low-\nmass Pleiades members. These are also shown in Fig. 1 as filled\ncircles. The infrared photometry of Zapatero-Osorio (private com-\nmunication) indicates that the 4 ITP candidates we were unable to\nobserve (Roque 34, Roque 32, Roque 18 and Roque 2) all lie well\nbelow the cluster sequence and do not need to be considered fur-\nther here. Reassuringly, all 11 of the CFHT candidates that have\nproper motions consistent with cluster membership (Moraux et al.\n2001) are also recovered here as probable cluster members. A sum-\nmary of the adopted membership status of the candidate low-mass\nPleiads originally proposed by the four optical surveys is given in\nTable 2.\n3.3 Residual contamination in our definitive\nlist of low-mass Pleiads\nAs determined by previous studies of the Pleiades which used colour\nto select candidate members (e.g. Zapatero-Osorio et al. 1997a;\nFestin 1997), late-type field stars are likely to be the greatest source\nof contamination in our refined candidate list. Estimates of the level\nTable 2. Our estimated values for the Pleiades luminosity and\nmass functions in the substellar regime.\nMag. bin Mass bin m¯ (M\u0007) Ntotal n per 0.1 M\u0007(IC) (M\u0007)\n17.80–19.50 0.074−0.050 0.062 100+11−20 417+46−83\n19.51–21.90 0.050−0.033 0.042 102+37−37 600+218−218\nC© 2002 RAS, MNRAS 335, 853–863\nBrown dwarfs in the Pleiades 857\nof contamination from background giants in such surveys indicate\nthat this is less than that of late-type dwarfs by a factor of a few\nwhile as discussed earlier the four optical surveys have flagged or\nremoved extended objects, eliminating the bulk of contaminating\ngalaxies. However, given the rather mixed nature of the criteria\nwhich have been used either to include or exclude candidates in our\nlist (spectroscopy, photometry, proper motions) we can only provide\nan approximate estimate of the number of residual late-type field-\nstar contaminants.\nWe note that the combined surveys are sensitive to spectral types\n∼M6–L1 over the magnitude range for which the luminosity func-\ntion is to be derived (17.8\u0002 I \u0002 21.9). The models of Baraffe et al.\n(1998) indicate that, owing to their youth, Pleiades members in this\nrange are overluminous with respect to field stars of similar spectral\ntype by approximately 1 mag. If candidates are selected solely on\nthe criterion that they lie within 0.3 and 1.0 mag on the low and\nhigh side of the I, I –K theoretical isochrone, respectively, then the\nsurvey is sensitive to single and binary field dwarfs between 51–92\nand 72–131 pc, respectively (assuming equal-mass binaries). With\na total area surveyed of 7.6 square degrees, allowing for overlap\nbetween the surveys, this corresponds to space volumes of 497 and\n1444 pc3 for single and binary field stars, respectively. However, the\nBD candidates taken from the CFHT survey (Moraux et al. 2001)\nand from the bright end of BPL survey (I \u0002 18.3) have, in addition\nto I–K colour, been discriminated on the grounds of their proper mo-\ntion. Assuming that contamination by field stars in a sample selected\nby both proper motion and I–K colour is negligible, then only the\nIWFC and ITP surveys are likely to contribute a significant number\nof M6–M7 field-star interlopers. From fig. 14 of Kirkpatrick et al.\n(1994) we estimate a space density of ≈0.0025 pc−3 for objects of\nthis type. Thus we estimate that in this range (17.8\u0002 I \u0002 18.3 M6–\nM7), the 2.1 square degrees covered by the IWFC and ITP surveys\ncontributes ∼1 field-star interloper to the refined list. Over the range\n18.3 < I \u0002 19.5 (M7.5–M8.5) candidates were selected from an area\nof 5.1 square degrees largely on the basis of I–K colour alone (i.e. the\nBPL, IWFC, ITP surveys). Again drawing from Kirkpatrick et al.\n(1994), we similarly estimate a space density of ≈0.0025 pc−3 for\nobjects of this type, which should contribute ∼2 field-star interlop-\ners to our refined list of members. Only the ITP and IWFC surveys\ncovering 2.1 square degrees are complete up to fainter magnitudes,\nprobing spectral types M9–L1. Gizis et al. (2000) estimate the space\ndensities of field objects of spectral types M9–M9.5 and L0–L4.5\nto be 0.0026 and 0.002 pc−3, respectively. Combining these values,\nwe estimate the space density of M9–L1 objects to be 0.0035 pc−3.\nThis gives an additional contamination of ∼2 late-type field stars.\nThus of all the candidate brown dwarfs included in our subsequent\nanalyses we estimate that ∼10 per cent are likely non-members.\n4 T H E C L U S T E R C O R E R A D I U S\nF O R B ROW N DWA R F S\n4.1 Defining a magnitude-limited sample\nof Pleiades brown dwarfs\nIn order to analyse the spatial distribution of Pleiades BDs, we must\nconfine ourselves to a well-defined and complete sample. A BD of\nsolar metalicity (and the Pleiades metalicity is approximately so-\nlar), should have a mass <0.075 M\u0007 (Baraffe et al. 1998). However,\nmass is not a directly observable quantity. It has been shown that\nfor the age of the Pleiades this mass corresponds closely to the\nboundary where the lithium 6707-A˚ line reappears in the spectrum\n(e.g. Basri, Marcy & Graham 1996). Stauffer, Schultz & Kirkpatrick\n(1998) measure spectra for some eight low-mass Pleiads and find the\nLithium boundary at I = 17.8 (IC), corresponding to a Pleiades age\nof 125 ± 8 Myr. We therefore adopt the lithium boundary as a work-\ning definition of a Pleiades BD and as a suitable bright limit. Sec-\nondly, the least-sensitive surveys (the BPL and the CFHT) impose\na faint completeness limit of I \u0002 19.5. We imposed these selection\ncriteria on the candidates from the four surveys and produced the\nlist of 32 BDs shown in the upper section of Table 3. For complete-\nness, in the lower section of Table 3 we list 16 additional candidate\nBDs primarily from the two deeper surveys (ITP and IWFC) most\nof which have been included in the calculation of the luminosity and\nmass functions (see Section 5).\n4.2 Fitting the cluster profile\nIt is important to know the spatial distribution of the Pleiades stars as\na function of their mass in order properly to determine the luminosity\nand mass functions for the cluster. Pinfield et al. (1998) show that the\ncluster stars can be well fitted by a King distribution (King 1962)\nwhose core radius increases as the stellar mass decreases. In this\nsection we shall again assume a King distribution and try to find the\ncore radius applicable for BDs. Equation (1) shows the King surface\ndensity distribution:\nf = k\n[\n1√\n1 + x −\n1√\n1 + xt\n]2\n, (1)\nwhere x = (r\/rc)2 and xt = (rt\/rc)2, with r the radius from the\ncluster centre, rc the core radius and rt is the tidal radius of\nthe cluster, where the gravitational potential from the galaxy equals\nthe cluster potential. We take rt = 5.54◦ parsecs after Pinfield et al.\n(1998). f is therefore the stellar density at a radius r, and k is the\nnormalization constant.\nn(x) = πr 2c k\n[\nln(1 + x) − 4\n√\n1 + x − 1√\n1 + xt\n+ x\n1 + xt\n]\n(2)\nEquation (2) is the cumulative King distribution, obtained by inte-\ngrating equation (1) with respect to 2πr dr. It gives the total num-\nber of stars in projection within a distance r of the centre of the\ncluster. The spatial distribution of our magnitude-limited sample of\nPleiades BDs is shown in Fig. 2 together with rectangles to repre-\nsent the areas of the cluster included in the four optical surveys.\nOverplotted are circles of radii 1.0, 1.5 and 2.2 degrees (corre-\nsponding to 2.23, 3.35 and 4.92 parsecs) centred on RA 03h47m\nDec. +24◦07′, J2000.0 (Pinfield et al. 1998). From this diagram we\ndetermined the area surveyed within the central circle and annuli\n(allowing for any overlap between the surveys) and the number of\nBDs found therein. We then obtained radial surface densities by\ndividing the numbers of BDs in any annulus by the surveyed area\nand inferred the total number of magnitude-limited BDs in each an-\nnulus by multiplying this surface density by the total annulus area.\nThe results are given in Table 4 where the errors are from counting\nstatistics.\nThe surface density and cumulative number of magnitude-limited\nBDs as a function of radial distance are plotted in Figs 3(a) and\n3(b), respectively. Using equations (1) and (2) and a tidal radius\nof 5.54◦ (Pinfield et al. 1998), we use a χ -squared minimization\ntechnique (DXSRCHMIN) (R. Willingale) to fit for rc and k. We found\nk = 19.67+2.04−2.91 per square degree and rc = 2.22+1.36−0.67 degrees (or\n5.0+3.0−1.5 pc at Pleiades distance). We also obtain an integrated total\nof 100+11−20 BDs in our magnitude-limited range.\nThe core radii for stellar members, from Pinfield et al. (1998),\ntogether with our BD core radius point are shown in Fig. 4. Pinfield,\nC© 2002 RAS, MNRAS 335, 853–863\n858 R. F. Jameson et al.\nTable 3. IZJHK photometry for ITP and CFHT brown dwarf candidates.\nITP name IC ZRGO JMKO ± HMKO ± KMKO ± IR ref.a Cross IDsc Photometric Comments\nmember?\nRoque 48 17.58 16.75 14.54 0.04 U\n√\nHHJ 3 17.66 16.62 15.16 0.10 14.64 0.09 14.19 0.07 U\n√\nRoque 47 18.12 17.12 14.67 0.06 U IPMBD 20\n√\nIC(IPMBD) = 18.05\nRoque 16 18.12 17.10 15.51 0.11 14.99 0.09 14.62 0.03 U,p02 CFHT-PL-11, BPl 152\n√\nIC(CFHT) = 17.91\nRoque 15 18.21 17.09 15.37 0.08 14.82 0.06 14.34 0.05 U PPl 1\n√\nRoque 17 18.16 16.97 15.31 0.09 14.79 0.07 14.36 0.05 U,p02 BPl 142, INT-PL-IZ-37\n√\nRoque 46 18.18 17.36 15.23 0.03 U ×\nPPl 15 18.24 17.02 15.34 14.77 14.41 0.03 b96,h99 NPL 35, IPMBD 23\n√\nIC(NPL) = 17.91\nRoque 44 18.37 17.50 15.44 0.04 U ×\nRoque 42 18.43 17.60 15.74 0.04 U ×\nRoque 40 18.38 17.68 16.20 0.04 U ×\nRoque 41 18.47 17.61 15.62 0.04 U ×\nRoque 43 18.47 17.38 16.07 0.10 15.57 0.08 15.14 0.05 U JS 1, PPl 3 ×\nRoque 14 18.64 17.42 15.53 0.10 14.96 0.09 14.47 0.03 U,p02 BPl 108\n√\nRoque 13 18.67 17.47 15.65 0.09 15.11 0.08 14.56 0.03 U,p02 BPl 79\n√\nRoque 38 18.64 17.65 15.46 0.04 U ×\nRoque 12 18.86 17.78 15.93 0.10 15.44 0.08 14.97 0.07 U NPL 36, BPl 172\n√\nIC(NPL) = 18.66\nRoque 37 18.78 17.79 16.50 0.10 15.89 0.05 15.54 0.04 U ×\nTeide 1 19.22 17.90 16.19 0.11 15.65 0.09 15.08 0.05 U NPL 39, BPl 137\n√\nIC(NPL) = 19.26\nRoque 10b 18.97 17.99 17.1: 0.3 U ×\nRoque 9 19.43 18.26 16.30 0.19 15.72 0.15 15.22 0.02 U BPl 100\n√\nRoque 8 19.55 18.24 16.68 0.11 16.14 0.10 15.57 0.06 U\n√\nRoque 7 19.74 18.50 16.55 0.18 15.88 0.14 15.47 0.02 U BPl 62, CFHT-PL-24\n√\nIC(CFHT) = 19.50\nRoque 6 19.89 18.75 16.12 0.04 U ×\nRoque 5 20.19 18.90 16.89 0.14 16.33 0.15 15.74 0.10 U\n√\nRoque 4 20.25 18.97 16.69 0.12 16.04 0.09 15.26 0.04 U,p02 BPl 66\n√\nRoque 3 20.11 19.01 17.8: 0.4 17.2: 0.4 16.8: 0.3 U ×\nRoque 36 20.25 19.02 17.17 0.20 16.58 0.12 16.09 0.08 U\n√\nRoque 33 20.44 19.06 17.07 0.12 16.62 0.18 16.02 0.08 U NPL 40\n√\nIC(NPL) = 20.55\nRoque 31 20.49 19.33 17.12 0.06 U ×\nRoque 30 20.82 19.45 17.49 0.12 16.77 0.11 16.14 0.07 U\n√\nRoque 29 20.72 19.65 17.9: 0.2 U ×\nRoque 28 20.70 19.62 18.64 0.12 18.27 0.07 U ×\nRoque 27 21.31 20.06 18.38 0.5 U ×\nRoque 26 21.43 20.12 18.18 0.2 U ×\nRoque 25 21.80 20.14 17.7: 0.3 17.0: 0.3 16.31 0.19 U\n√\nRoque 24 21.97 20.36 18.0: 0.5 U ×\nRoque 23 21.98 20.61 19.2: 0.3 U ×\nRoque 22b 22.1: 20.70 20.1: 0.3 U ×\nRoque 20 22.2: 21.10 U × No source at K\nRoque 21b 22.7: 21.10 18.1: 0.2 U ×\nRoque 19b 22.9: 21.10 17.9: 0.2 U ×\nCFHT-PL-9 17.71 14.49 0.04 U BPl 202\n√\nCFHT-PL-10 17.82 14.49 0.04 U\n√\nCFHT-PL-12 18.00 14.20 0.02 U,p02 BPl 294\n√\nCFHT-PL-13 18.02 15.49 0.08 14.97 0.07 14.54 0.06 U Teide 2, BPl 254\n√\nCFHT-PL-15 18.62 14.93 0.04 U\n√\nCFHT-PL-16 18.66 14.50 0.04 U\n√\nCFHT-PL-17 18.80 16.14 0.10 15.51 0.11 15.07 0.07 U BPL 49\n√\nCFHT-PL-23 19.33 16.38 0.08 15.79 0.08 15.25 0.05 U\n√\nCFHT-PL-25 19.69 16.64 0.15 16.05 0.13 15.47 0.06 U,p02 BPl 303\n√\naU: UKIRT; b96: Basri, Marcy & Graham (1996); h99: Hambly et al. (1999); p02: (Pinfield et al. 2002, in preparation).\nbObjects appear slightly extended in I Z images.\ncPPl objects, Stauffer, Hamilton & Probst (1994); JS objects, Jameson & Skillen (1989); NPL objects, Festin (1998); IPMBD objects, Hambly et al. (1999).\n:Large uncertainties in photometry. For details of uncertainties in I Z photometry see Zapatero-Osorio et al. (1999).\nJameson & Hodgkin (1998) found that the core radius varied with\nstellar mass as m−0.5, as expected for a dynamically-relaxed cluster,\nbut noted a possible levelling-off of the core radius at 1.23◦ in their\nlowest-mass bin (0.3 M\u0007). A study of the spatial distribution of\na small sample of Pleiades BD candidates seemed to support this\nunexpected finding and even suggest that the relationship turned\nover at the very-lowest (substellar) masses (Jameson et al. 1999).\nAs the estimated time-scale on which dynamical relaxation occurs\nin the Pleiades is comparable to the 125 Myr cluster age, it was\nproposed that while the high-mass Pleiads were dynamically relaxed\nC© 2002 RAS, MNRAS 335, 853–863\nBrown dwarfs in the Pleiades 859\nFigure 2. Plot showing the spatial distribution of candidates (I \u0001 19.5; heavy\nblack dots). Overplotted are the outlines of the areas covered by the four\noptical surveys and circles of radii 1.0◦, 1.5◦ and 2.2◦.\nthe lowest-mass members of the cluster may not yet have reached\nthis state of equilibrium.\nAt variance with the findings of this previous study, which used\nfewer BD candidates, Fig. 4 indicates that the core radius does not\nturn over or level off at substellar masses. Indeed, our new result\nis consistent with a continuation of the relationship observed for\nthe higher-mass members suggesting instead that the lowest-mass\nmembers are also in a state of dynamical relaxation. However, given\nthe large errors on our estimate of rc for the BDs our result can also\nbe consistent with a moderate flattening of the relationship at M <\n0.5 M\u0007 and we are unable to exclude the possibility that the lowest-\nmass members may be only partially relaxed. Alternatively, some\ndegree of flattening might be expected because of the evaporation\nfrom the cluster of low-mass members in the high-velocity tail of\nthe equilibrium distribution. Either way, the result presented here\nis important; an incorrect core radius for the BDs will result in\nerroneous estimates of the cluster luminosity and mass functions in\nthe substellar regime.\n5 S T R I N G E N T C O N S T R A I N T S O N T H E M A S S\nF U N C T I O N O F T H E P L E I A D E S\nIn Section 4.3 our fitted cluster profile implies that there are 100+11−20\nPleiades brown dwarfs in the magnitude range 17.8\u0002 I \u0002 19.5.\nHowever, Table 3 contains details of a further 16 candidate BDs\nTable 4. Summary details of the four optical surveys employed here: in column 2 the area covered by each, in column 3 the estimated\ndepth to which each is complete, in column 4 the total number of candidate low-mass stellar and substellar Pleiades originally\nunearthed by each survey, in column 5 the total number of candidates from each survey determined to have IC\u0002 17.8, i.e. BD\ncandidates, in column 6 the number of candidate BDs adopted here as members, in column 7 the number of candidate BDs rejected\nhere as non-members, and finally in column 8 the number of BDs from each survey duplicated in the surveys listed previously.\nSurvey Area surveyed Depth to which Total no. of Total no. of candidate No. adopted No. rejected No. of BDs\n(sqr.◦) compete (IC) candidates BDs (IC\u0002 17.8) here as BDs here as BDs duplicated\nITP 1.1 ∼21.5 47 45 17 28 na\nCFHT 2.5 ∼19.5 26 17 11 6 2\nBPL 6.4 ∼19.5 309 27 23 4 13\nIWFC 1.1 ∼22.0 23 16 16 0 4\nwith I > 19.50. Of these, 14 unearthed by the deeper ITP and IWFC\nsurveys have also been used to determine the cluster mass function.\nWe did not consider BPL303 (CFHT-PL-25) in this analysis as it\nwas unearthed by the Burrell Schmidt and CFHT surveys, which\nare not complete at the magnitude of this source. Furthermore, we\nexcluded INT-PL-IZ-69 as it is fainter than the 90 per cent com-\npleteness limit of the ITP survey, which we estimate to occur at\nI = 21.9. The positions of the fainter candidates used in the mass\nfunction analysis are shown in Fig. 5.\nUsing the same approach as we used for the brighter sample, we\ncounted up the number observed in the central circle and annuli and\nscaled this up to the number expected in the whole region. Subse-\nquently, we summed up the candidates to determine the cumulative\nnumber out to 2.2◦. We then assumed that rc = 2.22◦ and used equa-\ntion (2) to determine the ratio n(rt)\/n(r = 2.2◦), which we used to\nextrapolate the cumulative counts out to the tidal radius. The re-\nsults are given in Table 5. The quoted uncertainties in the faintest\nluminosity function point are dominated by counting statistics.\nAs the DUSTY model provides a systematically lower estimate\nof mass, we have adopted the more conservative NEXTGEN model\nto derive the mass boundaries of the luminosity bins. In this way\nwe calculated the values of the mass function, dN\/dM (0.1 M\u0007).\nOur results are given in the final column of Table 2 and can be seen\nplotted in Fig. 6. Adams et al. (2001) have recently made a large-\nscale survey of the entire Pleiades cluster for stars of mass 1.0–\n0.1 M\u0007. We include in Fig. 6 their estimated mass function and\nbest-fit log-normal function with which they model their points.\nIt is gratifying to note that the stellar and BD mass functions fit\ntogether quite smoothly. The combined result we believe repre-\nsents the best mass function yet obtained for the Pleiades. Using a\nχ -squared minimization technique we fitted a power law to the four\nlowest-mass bins (0.3 M\u0007\u0003M \u0003 0.035 M\u0007) and derived an index\nof α = 0.41 ± 0.08, where the quoted uncertainty is the formal 1σ\nfit error.\nTo determine the robustness of this result first we examine its\nsensitivity to uncertainties in the cluster age. Assuming an age of\n70 Myr and using the NEXTGEN models, we calculated mass func-\ntion points of 526+58−105 and 729+212−212 for mass bins 0.057 − 0.038 and\n0.038 − 0.024 M\u0007, respectively, which resulted in a best-fit power\nlaw that has a slightly steeper index of α = 0.48 ± 0.07. Note that in\nthis case and each of the following we do not modify the mass func-\ntion points from Adams et al. (2001). Assuming an age of 150 Myr\nwe obtain mass function points of 385+42−76 and 567+165−165 for mass bins\n0.08 − 0.054 and 0.054–0.036 M\u0007, respectively. In this case the\nbest-fit power law has a slightly shallower index of α = 0.37 ± 0.08.\nNext we examine the sensitivity to the choice of theoretical\nmodel. By employing the DUSTY model we derived mass func-\ntion points of 526+58−105 and 729+212−212 for mass bins 0.057 − 0.038 and\n0.038–0.024 M\u0007, respectively, giving a best-fit power-law index\nC© 2002 RAS, MNRAS 335, 853–863\n860 R. F. Jameson et al.\nFigure 3. (a) BD surface density as a function of radial distance from the cluster centre. Overplotted is the best-fitting King profile, details of which are given\nin the text. (b) Cumulative number of BDs as a function of radial distance from the cluster centre. Overplotted is the best-fitting King profile, details of which\nare given in the text.\nof α = 0.51 ± 0.07. With the D’Antona & Mazzitelli (1997) model,\nwhere we have used the colour–Teff relationships and bolometric cor-\nrections of Bessell, Castelli & Plez (1998), the mass function points\nare 588+65−117 and 927+269−269 for mass bins 0.057–0.038 and 0.038–\n0.024 M\u0007, respectively. This results in a best-fit power-law index\nof α = 0.59 ± 0.07. Finally, using the Burrows et al. (1993) model\nwe calculated mass function points of 435+48−87 and 927+269−269, respec-\ntively, producing a best-fit power law with index α = 0.45 ± 0.07.\nHence only the index derived using the D’Antona & Mazzitelli\n(1997) model is found to be significantly different from the esti-\nmate obtained using our preferred model, and even this discrepancy\nis marginal. We also find our result to be largely insensitive to plau-\nsible uncertainties in the distance of the cluster, as concluded earlier\nin Section 4.3. For example, assuming a smaller cluster distance of\n(m − M)0 = 5.35 we calculate mass function points of 455+50−91 and\nFigure 4. Plot of core radius as a function of m−0.5. The four leftmost\npoints are taken from Pinfield et al. (1998). The point corresponding to the\nlowest masses is derived here. The dashed line represents the relationship\nrc = 0.733m−0.5.\n637+185−185 in the mass bins 0.07–0.048 and 0.048–0.032 M\u0007, respec-\ntively. The best-fitting power law to the four lowest-mass points is\nthen α = 0.45 ± 0.08.\nThe binary fraction of substellar Pleiads would also affect the\nshape of the CMF but is currently not well known. Steele &\nJameson (1995) have estimated the binary fraction of low-mass\nstellar members to be ∼46 per cent. Assuming a similar fraction\nof the candidate members listed here to be equal-mass binaries, we\ndetermine the index of the best-fit power law to be α = 0.50 ± 0.08.\nMoraux et al. (2001) found a similar steepening of their best-fit\npower law by treating as equal-mass systems those CFHT candi-\ndates suspected of being unresolved binaries from their location in\nthe CMD. Hence our result does not appear to be unduly sensitive\nto the presence of unresolved binaries.\nOur result agrees well with the α = 0.51 ± 0.15 index obtained\nover the range 0.35 M\u0007\u0003M \u0003 0.05 M\u0007 from the CFHT survey\nFigure 5. Plot showing the spatial distribution of candidate BDs (heavy filled\ncircles) in the magnitude range 19.50 < IC \u0001 21.90.\nC© 2002 RAS, MNRAS 335, 853–863\nBrown dwarfs in the Pleiades 861\nTable 5. IJHK photometry for our compilation of Pleiades BDs. Excluding those objects shown in italics, this is a complete magnitude-limited sample\n(17.8\u0001 I \u0001 19.5).\nName\nBurrell CFHT ITP IWFC NOT Schmidt Other IC J H K I ref.a IR ref.a Notes\nCFHT-PL-10 17.82 14.49 C U µ[1]\nBPL163 17.83 14.53 B p02\nBPL58 INT-PL-IZ-6 17.83 14.53 D D\nINT-PL-IZ-42 17.84 14.36 D D\nBPL152 CFHT-PL-11 Roque 16 17.91 15.51 14.99 14.62 C U,p02 Li[2], µ[1,3]\nINT-PL-IZ-60 17.99 14.51 D D\nBPL294 CFHT-PL-12 18.00 14.20 C p02 Li[2], µ[1,3]\nBPL254 CFHT-PL-13 Teide 2 18.02 15.49 14.97 14.54 C U Li[2,4], µ[1]\nBPL327 IPMBD11 18.07 14.60 H p02 µ[5]\nRoque 47 IPMBD20 18.12 14.67 I U IC = 18.05[5]\nBPL142 Roque 17 INT-PL-IZ-37 18.16 15.31 14.79 14.36 I U,p02\nRoque 15 PPL 1 18.21 15.39 14.74 14.34 I U Li[2]\nNPL 35 IPMBD23 PPL 15 18.24 15.34 14.65 14.41 I b96,h99 Li[6]\nBPL316 18.30 14.93 B p02 µ[3]\nINT-PL-IZ-43 18.41 14.70 D D\nCFHT-PL-15 18.62 14.93 C U Li[2], µ[1]\nBPL108 Roque 14 18.64 15.53 14.96 14.47 I U,p02\nCFHT-PL-16 18.66 14.50 C U µ[1]\nBPL78 INT-PL-IZ-44 18.67 15.01 D p02\nBPL79 Roque 13 18.67 15.65 15.11 14.56 I U,p02 Li[2]\nBPL240 18.75 15.11 B p02\nBPL81 18.79 14.98 B p02\nBPL49 CFHT-PL-17 18.80 16.14 15.51 15.07 C U µ[1]\nBPL172 Roque 12 NPL 36 18.86 15.93 15.44 14.97 I U IC = 18.66[7]\nBPL45 INT-PL-IZ-29 18.87 14.93 D p02\nBPL235 CFHT-PL-21 Calar 3 19.00 16.29 15.45 14.91 C U,p02 Li[8], µ[1]\nBPL306 19.09 15.15 B p02\nBPL137 NPL 39 Teide 1 19.22 16.19 15.65 15.08 I U,p02 Li[8], µ[9]\nINT-PL-IZ-33 19.23 15.10 D D\nCFHT-PL-23 19.33 16.38 15.79 15.25 C U µ[1]\nBPL100 Roque 9 19.43 16.32 15.64 15.22 I U\nBPL62 CFHT-PL-24 Roque 7 19.50 16.55 15.88 15.47 C U µ[1]\n19.5 < I \u0001 21.9\nRoque 8 19.55 16.68 16.14 15.57 I U\nBPL303 CFHT-PL-25 19.69 16.64 16.05 15.47 C p02\nINT-PL-IZ-48 19.93 15.54 D D\nINT-PL-IZ-76 19.96 15.32 D D\nINT-PL-IZ-55 20.04 15.78 D D\nRoque 5 20.19 16.89 16.33 15.74 I U\nINT-PL-IZ-25 20.25 15.52 D D\nRoque 36 20.25 17.17 16.58 16.09 I U\nBPL66 Roque 4 20.25 16.69 16.04 15.26 I U,p02\nRoque 33 NPL 40 20.44 17.07 16.62 16.02 I U IC = 20.55[7]\nINT-PL-IZ-20 20.47 15.67 D D\nRoque 30 20.82 15.49 16.77 16.14 I U\nINT-PL-IZ-84 21.12 16.22 D D\nRoque 25 21.80 17.7 17.0 16.31 I U\nINT-PL-IZ-81 21.87 16.32 D D\nINT-PL-IZ-69 22.46 16.51 D D\naC: CFHT; I: ITP; B: Burrell Schmidt; D: IWFC; U: UKIRT; p02: (Pinfield et al. 2002, in preparation); b96: Basri et al. (1996); h99: Hambly et al. (1999).\n[1]Moraux et al. (2001); [2]Stauffer et al. (1998); [3]Pinfield et al. (2000); [4]Martı´n et al. (1998); [5]Hambly et al. (1999); [6]Basri et al. (1996); [7]Festin (1998);\n[8]Rebolo et al. (1996); [9]Rebolo et al. (1995).\n(Moraux et al. 2001). While this may not be a complete surprise\ngiven that the candidates from the CFHT survey are included here,\nit should be borne in mind that this work incorporates mass function\npoints from the independent study of Adams et al. (2001), more\nthan doubles the area sampled by Bouvier et al. (1998) and probes\nabout 2.5 mag deeper over an area comparable in size to the CFHT\nsurvey.\nThe results of detailed N-body simulations that have become\navailable over the last few years (e.g. de la Fuente Marcos & de la\nFuente Marcos 2000; Adams et al. 2002) indicate that we can now\nsensibly compare our result to those obtained recently for young\nclusters such as σ -Orionis (Bejar et al. 2001) and IC 348 (Najita,\nTiede & Carr 2000). For example, fig. 6 of de la Feunte Marcos\n& de la Feunte Marcos (1999) shows that at an age of 125 Myr\nC© 2002 RAS, MNRAS 335, 853–863\n862 R. F. Jameson et al.\nFigure 6. The mass function of the Pleiades cluster from 1–0.04 M\u0007 as\ndetermined here and by Adams et al. (2001). Overplotted are the best-fit\nlog-normal function to the points of Adams et al. (2001) and the best-fit\npower law to the four lowest-mass bins.\n(∼10 cluster crossing times) despite the total number of cluster\nmembers having dropped by ∼10 per cent the fraction of BD mem-\nbers has remained more or less constant. The simulations of Adams\net al. (2002), which include a sizeable population of primordial bi-\nnaries, are entirely consistent with this finding. Bejar et al. (2001)\nand Najita et al. (2000) report that the mass functions of the 5-Myr-\nold σ -Orionis and the 3-Myr-old IC348 clusters can be represented\nby power laws with indices of α = 0.8 ± 0.4 (0.2 M\u0007\u0003M \u0003 0.01\nM\u0007) and α = 0.4 (0.7 M\u0007\u0003M \u0003 0.015 M\u0007), respectively. These\nare consistent with the value determined here for the Pleiades, al-\nthough the MF of σ -Orionis is only just consistent and could be\nintrinsically steeper. The mass function of IC 348 and σ -Orionis\ndo not display any evidence for a turn down at the lowest masses.\nTherefore, by assuming that objects of such low mass were also\nmanufactured in the Pleiades we have extrapolated our power-law\nmass function model down to the deuterium-burning limit (M =\n0.012 M\u0007). This extrapolation indicates that the total mass of BDs\nin the Pleiades is 13+4−3 M\u0007. Clearly, despite BDs being relatively\nnumerous in the Pleiades, they are not present in sufficient numbers\nto contribute significantly to the overall mass of the cluster. Pinfield\net al. (1998) and Raboud & Mermilliod (1998) found the mass of\nthe cluster to be 735 and 720 M\u0007, respectively, and our estimate\nof the total BD mass in the Pleiades makes up only ∼2 per cent of\nthis.\n6 C O N C L U S I O N\nWe have used new infrared data to reassess the membership status\nof candidate low-mass Pleiads from the ITP I Z survey of Zapatero-\nOsorio et al. (1999). Those objects with I–K colours consistent\nwith cluster membership have been compiled with candidates from\nthree other large optical surveys of the cluster to yield the largest\nmagnitude-limited sample of Pleiades BDs to date. From a detailed\nanalysis of their spatial distribution (using King profiles) we have\ndetermined that the core radius of substellar Pleiads is 5.0+3.0−1.5 pc.\nThis is contrary to the findings of our previous study based on a\nsmaller sample of BDs, which suggested that the core radius had\nturned over by the substellar regime to a value of \u00023 pc (Jameson\net al. 1999). Instead, this result is consistent with a continuation of\nthe rc ∝ M−0.5 trend observed by Pinfield et al. (1998) for higher-\nmass stellar members, suggesting that the lowest-mass Pleiads are\nby and large dynamically relaxed. We have used our large sam-\nple of substellar cluster members and improved estimate of the\nBD core radius to place tight constraints on the shape of the mass\nfunction across and below the stellar\/substellar boundary. We find\nthat a power law with index α = 0.41 ± 0.08 provides an excellent\nmatch to the cluster mass function in the regime 0.3 M\u0007\u0003M \u0003\n0.035 M\u0007. This result is not greatly sensitive to our choice of evolu-\ntionary model or uncertainties in the cluster age and distance. How-\never, the cluster mass function steepens slightly to α = 0.50 ± 0.08\nif we assume a plausible fraction of unresolved binaries (46 per\ncent).\nWe have argued that the present-day cluster mass function is a\ngood representation of the IMF and allows for a sensible compari-\nson between our result and those derived for younger clusters. By\nassuming that the mass function of the Pleiades continues to rise\nslowly down to the deuterium-burning limit at 0.012 M\u0007, we cal-\nculate that the mass of all cluster BDs is 13+4−3 M\u0007. Therefore,\nwhile BDs are quite numerous in the Pleiades they only make up\n∼2 per cent of its mass. If this result is generally true for the Galactic\ndisc, then BDs do not contribute significantly to the disc dark matter\nthat is inferred from tracer populations (e.g. Bahcall et al. 1992) in\napproximately equal quantities as the luminous matter.\nAC K N OW L E D G M E N T S\nPDD and DJP acknowledge funding from PPARC. The United\nKingdom Infrared Telescope is operated by the Joint Astronomy\nCentre on behalf of the UK Particle Physics and Astronomy Re-\nsearch Council. This publication makes use of data products from\nthe Two Micron All Sky Survey, which is a joint project of the Uni-\nversity of Massachusetts and the Infrared Processing and Analysis\nCentre\/California Institute of Technology, funded by the National\nAeronautics and Space Administration and the National Science\nFoundation. We thank Joseph Adams for making available to us a\ntabular version of his Pleiades mass function, and finally we thank\nthe referee John Stauffer for useful comments that have improved\nthis work.\nR E F E R E N C E S\nAdams F. C., Fatuzzo M., 1996, ApJ, 464, 256\nAdams J. D., Stauffer J. R., Monet D. G., Skrutskie M. F., Beichman C. A.,\n2001, AJ, 121, 2053\nAdams T., Scally A., Davies M. B., Jameson R. F., 2002, MNRAS, 333, 547\nBahcall J. N., Flynn C., Gould A., 1992, ApJ, 389, 234\nBaraffe I., Chabrier G., Allard F., Hauschildt P. H., 1998, A&A, 337, 403\nBaraffe I., Chabrier G., Allard F., Hauschildt P. H., 2002, A&A, 382, 563\nBasri G., Marcy G. W., Graham J. R., 1996, ApJ., 458, 600\nBejar V. J. S. et al., 2001, ApJ, 556, 830\nBessel M. S., 1986, PASP, 98, 1303\nBessell M. S., Castelli F., Plez B., 1998, A&A, 333, 231\nBouvier J., Stauffer J. R., Martı´n E. L., Barrado y Navascues D., Wallace B.,\nBejar V. J. S., 1998, A&A, 336, 490\nBurrows A., Hubbard W. B., Saumon D., Lunine J., 1993, ApJ, 406, 158\nBurrows A. et al., 1997, ApJ, 491, 856\nCasali M., Hawarden T., 1992, UKIRT Newsletter, 4, 33\nChabrier G., Baraffe I., Allard F., Hauschildt P., 2000, ApJ, 542, 462\nCossburn M. R., Hodgkin S. T., Jameson R. F., Pinfield D. J., 1997, MNRAS,\n287, 180P\nC© 2002 RAS, MNRAS 335, 853–863\nBrown dwarfs in the Pleiades 863\nCossburn M. R., Hodgkin S. T., Jameson R. F., Pinfield D. J., 1998, ASP\nConf. Ser. 154. Astron. Soc. Pac., San Francisco, p. 1854\nCrawford D. L., Perry C. L., 1976, AJ, 81, 419\nD’Antona F., Mazzitelli I., 1997, Memorie della Societa Astronomia Italiana,\n68, 807\nde la Fuente Marcos R., de la Fuente Marcos C., 2000, ApSS, 271,\n127\nDobbie P. D., Kenyon F., Jameson R. F., Hodgkin S. T., Pinfield D. J., Osborne\nS. L., 2002a, MNRAS, 335, 687 (this issue)\nDobbie P. D., Kenyon F., Jameson R. F., Hodgkin S. T., 2002b, MNRAS,\n331, 445\nElmegreen B., 2000, MNRAS, 311L, 5\nFestin L., 1997, A&A, 322, 455\nFestin L., 1998, A&A, 333, 497\nFitzpatrick E., 1999, PASP, 111, 63\nGizis J. E., Monet D. G., Reid I. N., Kirkpatrick J. D., Liebert J., Williams\nR. J., 2000, AJ, 1 20, 1085\nHambly N. C., Hodgkin S. T., Cossburn M. R., Jameson R. F., 1999, MNRAS,\n303, 385\nHawarden T. G., Leggett S. K., Letawsky M. B., Ballantyne D. R., Casali\nM. M., 2001, MNRAS, 325, 563\nHodgkin S. T., Jameson R. F., Pinfield D. J., Steele I. A., Hambly N.\nC., 1999, ASP Conf. Ser. 134. Astron. Soc. Pac., San Francisco,\np. 99\nJameson R. F., Hodgkin S. T., Cossburn M. R., Pinfield D. J., 1999, ASP\nConf. Ser. 134. Astron. Soc. Pac., San Francisco, p. 99\nJameson R. F., Skillen I., 1989, MNRAS, 239, 247\nKing I. R., 1962, AJ, 67, 471\nKirkpatrick J. D., McGraw J. T., Hess T. R., Liebert J., McCarthy D. W. Jr,\n1994, ApJS, 94, 749\nKirkpatrick J. D. et al., 1999, AJ, 519, 802\nLandolt A. U., 1992, AJ, 104, 340\nLeggett S. K., Allard F., Hauschildt P. H., 1998, ApJ, 509, 836\nLuhman K. L., Rieke G. H., Young E. T., Cotera A. S., Chen H., Rieke M.\nJ., Schneider G., Thompson R. I., 2000, ApJ, 540, 1016\nMartı´n E. L., Rebolo R., Zapatero-Osorio M. R., 1996, ApJ, 469,\n706\nMartı´n E. L., Basri G., Zapatero-Osorio M. R., Rebolo R., Garcı´a Lo´pez\nR. J., 1998, ApJ, 507, L41\nMartı´n E. L., Delfosse X., Basri G., Goldman B., Forveille T., Zapatero-\nOsorio M. R., 1999, AJ, 118, 2466\nMartı´n E. L., Brandner W., Bouvier J., Luhman K. L., Stauffer J., Basri G.,\nZapatero-Osorio M. R., Barrado y Navascuos D., 2000, ApJ, 543, 299\nMcMahon R. G., Walton N. A., Irwin M. J., Lewis J. R., Bunclark P. S.,\nJones D. H., 2001, New Astronomy Reviews, 45, 97\nMoraux E., Bouvier J., Stauffer J. R., 2001, A&A, 367, 211\nNajita J. R., Tiede G. P., Carr J. S., 2000, ApJ, 541, 977\nPinfield D. J., Jameson R. F., Hodgkin S. T., 1998, MNRAS, 299, 955\nPinfield D. J., Hodgkin S. T., Jameson R. F., Cossburn M. R., Hambly N. C.,\nDevereux N., 2000, MNRAS, 313, 347\nPinsonneault M. H., Stauffer J., Soderblom D. R., King J. R., Hanson R. B.,\n1998, ApJ, 504, 170\nRaboud D., Mermilliod J. C., 1998, A&A, 329, 101\nRebolo R., Zapatero-Osorio M. R., Martı´n E. L., 1995, Nat, 377, 129\nRebolo R., Martı´n, E. L., Basri G., Marcy W., Zapatero-Osorio M. R., 1996,\nApJL, 469, 53\nSkrutskie M. F. et al., 1995, AAS, 187, 75.07\nSpitzer L., Jr, Mathieu R. D., 1980, ApJ, 241, 618\nStauffer J. R., Hamilton D., Probst R. G., Rieke G., Mateo M., 1989, ApJL,\n344, L21\nStauffer J. R., Hamilton D., Probst R. G., 1994, AJ, 108, 155\nStauffer J. R., Schultz G., Kirkpatrick J. D., 1998, ApJ, 499, L199\nSteele I. S., Jameson R. F., 1995, MNRAS, 272, 630\nvan Leeuwen F., 1999, A&A, 341, L71\nWhite R. J., Ghez A. M., Reid I. N., Schultz G., 1999, ApJ, 520, 811\nZapatero-Osorio M. R., Rebolo R., Martı´n E. L., 1997a, A&A, 317, 164\nZapatero-Osorio M. R., Martı´n E. L., Rebolo R., 1997b, A&A, 323, 105\nZapatero-Osorio M. R., Martı´n E. L., Rebolo R., Basri G., Magazzu A.,\nHodgkin S. T., Jameson R. F., Cossburn M. R., 1997c, ApJL, 491, 81\nZapatero-Osorio M. R., Rebolo R., Martı´n E. L., Hodgkin S. T., Cossburn\nM. R., Magazzu A., Steele I. A., Jameson R. F., 1999, A&A, Supp., 134,\n537\nThis paper has been typeset from a TEX\/LATEX file prepared by the author.\nC© 2002 RAS, MNRAS 335, 853–863\n"}