{"doi":"10.1063\/1.1790063","coreId":"100641","oai":"oai:epubs.surrey.ac.uk:35","identifiers":["oai:epubs.surrey.ac.uk:35","10.1063\/1.1790063"],"title":"Effect of Fluorine Implantation Dose on Boron Thermal Diffusion in Silicon","authors":["El Mubarek, H A","Bonar, J M","Dilliway, G D","Ashburn, P","Karunaratne, M","Willoughby, A F","Wang, Y","Hemment, P L","Price, R","Zhang, J","Ward, P"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-01-01","abstract":"<p>This paper investigates how the thermal diffusion of boron in silicon is influenced by a high energy fluorine implant with a dose in the range 5x10(14)-2.3x10(15) cm(-2). Secondary Ion Mass Spectroscopy (SIMS) profiles of boron marker layers are presented for different fluorine doses and compared with fluorine profiles to establish the conditions under which thermal boron diffusion is suppressed. The (SIMS) profiles show significantly reduced boron thermal diffusion above a critical F+ dose of 0.9-1.4x10(15) cm(-2). Fitting of the measured boron profiles gives suppressions of the boron thermal diffusion coefficient by factors of 1.9 and 3.7 for F+ implantation doses of 1.4x10(15) and 2.3x10(15) cm(-2), respectively. The suppression of boron thermal diffusion above the critical fluorine dose correlates with the appearance of a shallow fluorine peak on the (SIMS) profile in the vicinity of the boron marker layer. This shallow fluorine peak is present in samples with and without boron marker layers, and hence it is not due to a chemical interaction between the boron and the fluorine. Analysis of the (SIMS) profiles and cross-section Transmission Electron Microscope micrographs suggests that it is due to the trapping of fluorine at vacancy-fluorine clusters, and that the suppression of the boron thermal diffusion is due to the effect of the clusters in suppressing the interstitial concentration in the vicinity of the boron profile<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:35<\/identifier><datestamp>\n      2017-10-31T13:56:24Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:696F6E5F6265616D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/35\/<\/dc:relation><dc:title>\n        Effect of Fluorine Implantation Dose on Boron Thermal Diffusion in Silicon<\/dc:title><dc:creator>\n        El Mubarek, H A<\/dc:creator><dc:creator>\n        Bonar, J M<\/dc:creator><dc:creator>\n        Dilliway, G D<\/dc:creator><dc:creator>\n        Ashburn, P<\/dc:creator><dc:creator>\n        Karunaratne, M<\/dc:creator><dc:creator>\n        Willoughby, A F<\/dc:creator><dc:creator>\n        Wang, Y<\/dc:creator><dc:creator>\n        Hemment, P L<\/dc:creator><dc:creator>\n        Price, R<\/dc:creator><dc:creator>\n        Zhang, J<\/dc:creator><dc:creator>\n        Ward, P<\/dc:creator><dc:description>\n        <p>This paper investigates how the thermal diffusion of boron in silicon is influenced by a high energy fluorine implant with a dose in the range 5x10(14)-2.3x10(15) cm(-2). Secondary Ion Mass Spectroscopy (SIMS) profiles of boron marker layers are presented for different fluorine doses and compared with fluorine profiles to establish the conditions under which thermal boron diffusion is suppressed. The (SIMS) profiles show significantly reduced boron thermal diffusion above a critical F+ dose of 0.9-1.4x10(15) cm(-2). Fitting of the measured boron profiles gives suppressions of the boron thermal diffusion coefficient by factors of 1.9 and 3.7 for F+ implantation doses of 1.4x10(15) and 2.3x10(15) cm(-2), respectively. The suppression of boron thermal diffusion above the critical fluorine dose correlates with the appearance of a shallow fluorine peak on the (SIMS) profile in the vicinity of the boron marker layer. This shallow fluorine peak is present in samples with and without boron marker layers, and hence it is not due to a chemical interaction between the boron and the fluorine. Analysis of the (SIMS) profiles and cross-section Transmission Electron Microscope micrographs suggests that it is due to the trapping of fluorine at vacancy-fluorine clusters, and that the suppression of the boron thermal diffusion is due to the effect of the clusters in suppressing the interstitial concentration in the vicinity of the boron profile<\/p><\/dc:description><dc:date>\n        2004-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/35\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          El Mubarek, H A, Bonar, J M, Dilliway, G D, Ashburn, P, Karunaratne, M, Willoughby, A F, Wang, Y, Hemment, P L, Price, R, Zhang, J and Ward, P  (2004) Effect of Fluorine Implantation Dose on Boron Thermal Diffusion in Silicon   Journal of Applied Physics, 96 (8).       <\/dc:identifier><dc:relation>\n        10.1063\/1.1790063<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/35\/","10.1063\/1.1790063"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Effect of fluorine implantation dose on boron thermal diffusion in silicon\nH. A. W. El Mubarek, J. M Bonar, G. D. Dilliway, and P. Ashburn\nSchool of Electronics & Computer Science, University of Southampton, Southampton, United Kingdom\nM. Karunaratne and A. F. Willoughby\nDepartment of Materials, University of Southampton, Southampton, United Kingdom\nY. Wang and P. L. F. Hemment\nSchool of Electrical & Electronic Engineering, University of Surrey, Guildford, United Kingdom\nR. Price and J. Zhang\nDepartment of Physics, Imperial College, University of London, London, United Kingdom\nP. Ward\nST Microelectronics, Catania, Italy\n(Received 23 April 2004; accepted 19 July 2004)\nThis paper investigates how the thermal diffusion of boron in silicon is influenced by a high energy\nfluorine implant with a dose in the range 531014–2.331015 cm−2. Secondary Ion Mass\nSpectroscopy (SIMS) profiles of boron marker layers are presented for different fluorine doses and\ncompared with fluorine profiles to establish the conditions under which thermal boron diffusion is\nsuppressed. The (SIMS) profiles show significantly reduced boron thermal diffusion above a critical\nF+ dose of 0.9–1.431015 cm−2. Fitting of the measured boron profiles gives suppressions of the\nboron thermal diffusion coefficient by factors of 1.9 and 3.7 for F+ implantation doses of 1.4\n31015 and 2.331015 cm−2, respectively. The suppression of boron thermal diffusion above the\ncritical fluorine dose correlates with the appearance of a shallow fluorine peak on the (SIMS) profile\nin the vicinity of the boron marker layer. This shallow fluorine peak is present in samples with and\nwithout boron marker layers, and hence it is not due to a chemical interaction between the boron and\nthe fluorine. Analysis of the (SIMS) profiles and cross-section Transmission Electron Microscope\nmicrographs suggests that it is due to the trapping of fluorine at vacancy-fluorine clusters, and that\nthe suppression of the boron thermal diffusion is due to the effect of the clusters in suppressing the\ninterstitial concentration in the vicinity of the boron profile. © 2004 American Institute of Physics.\n[DOI: 10.1063\/1.1790063]\nI. INTRODUCTION\nOver the past few years there has been considerable in-\nterest in the effect of fluorine on boron diffusion in\nsilicon.1–18 This research has been motivated by the require-\nment in advanced CMOS technologies to minimize boron\ndiffusion for the formation of shallow source\/drain junctions\nand sharply defined halo profiles.19,20 The minimization of\nboron diffusion is also important in bipolar transistors, where\nboron diffusion limits the achievable base width and hence\nthe value of cutoff frequency that can be obtained.21 The\nsuppression of boron diffusion is difficult to achieve in prac-\ntice because of both boron thermal diffusion and boron tran-\nsient enhanced diffusion due to damage created during ion\nimplantation.22\nWork on the effects of fluorine from a BF2\n+ implant\nshowed that shallower junctions could be obtained when\nBF2\n+ was implanted instead of B+.1,7,8 In later\nwork2–6,9–15,17,18 fluorine was implanted separately to the bo-\nron to characterize the effect of the fluorine on boron diffu-\nsion. This work showed that the fluorine implant reduced\nboron transient enhanced diffusion2–5,9,11,13,14,16–18 and in-\ncreased boron activity.2 However, there have also been con-\ntradictory reports in the literature, which showed that fluo-\nrine implants had little or no effect on boron transient\nenhanced diffusion10 and that fluorine enhanced boron diffu-\nsion in preamorphized silicon6 using a silicon implant.15 Re-\ncently El Mubarek and Ashburn18 showed that a deep F+\nimplant significantly reduced boron thermal diffusion, as\nwell as eliminating transient enhanced diffusion.\nSeveral alternative mechanisms have been proposed to\nexplain the effect of the fluorine on both boron transient\nenhanced diffusion and boron thermal diffusion in\nsilicon.1–18 A chemical interaction between boron and fluo-\nrine has been proposed to explain the suppression of boron\ntransient enhanced diffusion by fluorine,4,9,11,14,16 in which\nthe fluorine combines with interstitial boron reducing its\nmobility4,11,14,16 or reduces the probability of formation of a\nboron interstitial pair.9,11 Alternatively, the formation of\nvacancy-fluorine complexes has been proposed,13,17,18,23–26\nwhich act as a barrier for boron diffusion,13 or suppress the\ninterstitial concentration and hence reduce boron transient\nenhanced diffusion17 and thermal diffusion.18 Finally the in-\nteraction of fluorine with silicon interstitials has been widely\nproposed as a mechanism of suppressing boron transient en-\nhanced diffusion.2,4–10,18\nIn this paper, experiments are performed to investigate\nhow the fluorine implantation dose influences the thermal\ndiffusion of boron marker layers in silicon. Boron secondary\nJOURNAL OF APPLIED PHYSICS VOLUME 96, NUMBER 8 15 OCTOBER 2004\n0021-8979\/2004\/96(8)\/4114\/8\/$22.00 © 2004 American Institute of Physics4114\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nion mass spectroscopy (SIMS) profiles are studied for differ-\nent fluorine implantation doses and compared with the cor-\nresponding fluorine profiles. It is shown that a critical fluo-\nrine dose exists, above which the fluorine suppresses boron\nthermal diffusion and below which it does not and that this\ncritical fluorine dose correlates with the appearance of a shal-\nlow fluorine peak on the fluorine SIMS profile in the vicinity\nof the boron marker layer. Explanations are proposed for the\norigin of this shallow fluorine peak and its effect on boron\nthermal diffusion.\nII. EXPERIMENTAL PROCEDURE\nSilicon layers with and without a buried boron-doped\nmarker layer were grown on (100) silicon wafers using mo-\nlecular beam epitaxy at 520 °C and low pressure chemical\nvapor deposition at 800°C, respectively. Samples from the\nsame wafer were then given a 185 keV fluorine implant with\na dose in the range 531014–2.331015 cm−2. By comparing\nboron profiles on F+ implanted and unimplanted samples it is\ntherefore possible to unambiguously determine the effect of\nthe fluorine implantation dose on the boron thermal diffu-\nsion. The layers were annealed by rapid thermal annealing in\nnitrogen at 1000 °C for 30 s. Boron (B11) and fluorine (F19)\nconcentration depth profiles were obtained on all samples by\nSIMS using a 10 keV O2\n+ beam. The annealed boron (SIMS)\nprofiles were fitted using the fully coupled diffusion model in\nthe Silvaco Athena simulation program and the diffusion co-\nefficient was extracted from the best fit obtained. The layers\nwere also analyzed by transmission electron microscopy\n(TEM).\nIII. RESULTS\nFigure 1 shows boron SIMS profiles in samples im-\nplanted with F+ at a dose in the range 531014–1.4\n31015 cm−2 and annealed at 1000 °C. For the two lowest F+\ndoses of 531014 and 931014 cm−2, there is no evidence of\nthe F+ implant reducing the boron thermal diffusion. In con-\ntrast, for a F+ dose of 1.431015 cm−2, the fluorine implanted\nsample shows a significant reduction of boron thermal diffu-\nsion compared with the unimplanted sample. Earlier work18\non samples implanted with 2.331015 cm−2 F+ also showed a\nsignificant reduction of boron thermal diffusion compared\nwith an unimplanted sample. These results show that fluorine\nsignificantly reduces boron thermal diffusion for F+ doses at\nand above 1.431015 cm−2.\nFigure 2 shows a comparison of simulated and measured\nboron profiles of samples implanted with F+ at a dose in the\nrange 531014–1.431015 cm−2 and annealed at 1000 °C for\n30 s. The as-grown boron profile is also included for refer-\nence. In all figures the fitted profiles coincide very well with\nthe measured profiles, indicating a good fit. Extracted values\nof boron thermal diffusion coefficient, normalized to the\nvalue of diffusion coefficient of the unimplanted sample\ns5.9310−14 cm2 s−1d, are summarized in Table I. Also shown\nis a value for a 2.331015 cm−2 F+ implant obtained by fit-\nting the profiles in Ref. 18. The results show a decrease in\nthe boron diffusion coefficient by factors of 1.9 and 3.7 for\nsamples implanted with 1.431015 and 2.331015 cm−2 F+,\nrespectively.\nFigure 3 shows fluorine (SIMS) profiles in samples im-\nplanted with F+ at a dose in the range 531014–1.4\n31015 cm−2 and annealed at 1000 °C. For all the implanted\ndoses the as-implanted fluorine profile is approximately\nGaussian with an implantation range of 0.41 mm. For the\nlowest fluorine implantation dose of 531014 cm−2, negli-\ngible fluorine is present (SIMS background level) in the vi-\ncinity of the boron profile after anneal. The majority of the\nfluorine is located in a broad double peak at a depth corre-\nFIG. 1. Boron SIMS profiles in F+ implanted and unimplanted samples after\nan anneal of 30 s at 1000 °C in dry N2. An as-grown boron profile is also\nincluded for reference. Results are shown for fluorine implantation doses of\n(a) 531014 cm−2, (b) 931014 cm−2, and (c) 1.431015 cm−2.\nJ. Appl. Phys., Vol. 96, No. 8, 15 October 2004 El Mubarek et al. 4115\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nsponding approximately with the range of the fluorine im-\nplant s0.41 mmd and extending from about 0.3 to 0.64 mm.\nFor a fluorine implantation dose of 931014 cm−2 negligible\nfluorine is again visible in the vicinity of the boron profile,\nbut a small shoulder can be seen on the surface side of the\ndeep fluorine peak between about 0.22 and 0.28 mm. This\nshoulder was not present for the lower fluorine dose of 5\n31014 cm−2 in Fig. 3(a). For the highest fluorine dose of\n1.431015 cm−2, an additional shallow, fluorine peak can be\nclearly seen in the vicinity of the boron marker layer, extend-\ning from about 0.07 to 0.22 mm. The shape of this shallow\nfluorine peak is complex and comprises two small ripples at\ndepths of 0.16 and 0.18 mm. A substantial shoulder can also\nbe seen at a similar depth as the shoulder seen in Fig. 3(b)\ns<0.22–0.28 mmd.\nFigure 4 shows a comparison of fluorine SIMS profiles\nin samples with and without a boron marker layer after a\nfluorine implant in the range 531014–2.331015 cm−2 and\nannealed at 1000 °C. The corresponding as-implanted fluo-\nrine profiles are also shown for reference. The fluorine pro-\nfiles in the samples without the boron marker layer show the\nsame overall trends as those with the boron marker layer. For\nall fluorine doses, a broad fluorine peak is seen at a depth\ncorresponding approximately with the range of the fluorine\nimplant. For the lowest F+ dose of 531014 cm−2, there is\nnegligible fluorine in the vicinity of the boron profile. For a\nfluorine dose of 931014 cm−2, there is again negligible fluo-\nrine in the vicinity of the boron profile, but a shoulder can be\nseen between about 0.22 and 0.28 mm. For the highest doses\nof 1.431015 and 2.331015 cm−2, an additional shallow fluo-\nrine peak can he seen in the vicinity of the boron profile,\nextending from 0.07 to 0.22 mm and 0.04 to 0.22 mm, re-\nspectively. A substantial shoulder can also be seen, extending\nfrom about 0.22 to 0.28 mm. The shallow fluorine peak in\nthe samples with a boron marker layer shows the presence of\nripples, whereas no ripples are present in the samples with-\nout the boron marker layer. However, it should be noted that\nthe samples with the boron marker layer were grown using\nmolecular beam epitaxy, whereas the samples without the\nboron marker layer were grown using low pressure chemical\nvapor deposition. The small ripples may therefore be an arte-\nfact of the growth method, for example, due to the trapping\nof fluorine at interfaces created by short growth interrupts\nduring the molecular beam epitaxy.\nTable II summarizes the integrated fluorine doses in dif-\nferent regions of the profiles before and after anneal for fluo-\nrine implanted silicon with boron marker layers. The inte-\ngrated fluorine doses after implant are in reasonable\nagreement with the implanted dose. The total fluorine doses\nafter anneal indicate that considerable fluorine is lost during\nanneal, with less fluorine lost for higher implanted doses. For\nall implant doses the majority of the fluorine after anneal is\nFIG. 2. Simulated and measured boron profiles after an anneal of 30 s at\n1000 °C in dry N2 and for reference an as-grown boron profile; (a) unim-\nplanted sample, and samples implanted with F+ doses: (b) 531014 cm−2, (c)\n931014 cm−2, (d) 1.431015 cm−2, and (e) 2.331015 cm−2.\nTABLE I. Summary of values of normalized boron diffusion coefficient for\nunimplanted samples and samples implanted with F+ doses 531014–2.3\n31015 cm−2. Values are normalized to the diffusion coefficient of 5.9\n310−14 cm−2 s−1 for the unimplanted sample.\nF+ Implant dose cm−2 Normalized boron diffusion coefficient\nUnimplanted 1\n531014 1.3\n931014 0.90\n1.431015 0.53\n2.331015 0.27\n4116 J. Appl. Phys., Vol. 96, No. 8, 15 October 2004 El Mubarek et al.\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nlocated in the deep fluorine peak, which is defined as extend-\ning from 0.28 to 0.70 mm (a range encompassing the deep\nfluorine peak for all doses). For F+ doses of 1.431015 and\n2.331015 cm−2, where suppression of boron thermal diffu-\nsion is seen, 2.5% and 5.2%, respectively, of the fluorine\nresides in the shallow fluorine peak (0.04–0.22 mm, and\n1.6% and 2.9%, respectively, resides in the shoulder (0.22 to\n0.28 mm).\nFigure 5 shows a graph of the peak fluorine concentra-\ntion in the fluorine peaks and shoulders as a function of F+\nimplantation dose. Results are shown for samples with and\nwithout the boron marker layer. For the shallow fluorine\npeak, the peak fluorine concentration rises from the SIMS\nbackground level to a value of around 131018 cm−3 at a F+\nimplantation dose of 1.431015 cm−2 and then rises further as\nthe F+ dose is increased to 2.331015 cm−2. For the fluorine\nshoulder, the peak fluorine concentration rises from the\nFIG. 3. Fluorine SIMS profiles before and after an anneal of 30 s at\n1000 °C in dry N2. Boron profiles after anneal are also included for refer-\nence. Results are shown for fluorine implantation doses of (a) 5\n31014 cm−2, (b) 931014 cm−2, and (c) 1.431015 cm−2.\nFIG. 4. Fluorine SIMS profiles before and after an anneal of 30 s at\n1000 °C in dry N2 for samples with and without a boron marker layer. The\nsamples with the boron marker layer were grown using MBE whereas the\nsamples without the boron marker layer were grown using LPCVD. Results\nare shown for fluorine implantation doses of (a) 531014 cm−2, (b) 9\n31014 cm−2, and (c) 1.431015 cm−2, and (d) 2.331015 cm−2.\nJ. Appl. Phys., Vol. 96, No. 8, 15 October 2004 El Mubarek et al. 4117\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nSIMS background to a value of around 131018 cm−3 at a F+\ndose of 931014 cm−2, and then increases further as the F+\ndose is increased to 2.331015 cm−2. Thus, the trend for the\nfluorine shoulder is similar to that for the shallow fluorine\npeak with the difference that the rise in peak fluorine con-\ncentration from the SIMS background occurs at a lower fluo-\nrine dose. For the deep fluorine peak, a high concentration of\nfluorine is present for all F+ doses and this value rises with\nincreasing F+ dose. A similar trend is seen in samples with\nand without the boron marker layer, though the values of\nfluorine concentrations tend to be slightly higher in the\nformer samples.\nFigure 6(a) shows a light field, cross-section TEM mi-\ncrograph of a silicon layer with a buried boron marker layer\ngrown by molecular beam epitaxy, implanted with 2.3\n31015 cm−2 fluorine and annealed at 1000 °C. A band of\ndefects can be seen extending from a depth of 0.29 to\n0.73 mm but no defects are seen at depths shallower than\n0.29 mm. A comparison with the SIMS profile in Fig. 4(d)\nshows that this band of defects corresponds approximately\nwith the position of the deep fluorine peak on the SIMS\nprofile. Figure 6(b) shows a higher magnification micrograph\nof the band of defects and indicates that the defects consist of\ndislocation loops with various shapes and sizes ranging from\n11 to 96 nm. TEM micographs (not shown here) of samples\nimplanted with 2.331015 cm−2 F+ show that the layers are\ncrystalline after implant and show no amorphization due to\nthe fluorine implant.\nIV. DISCUSSION\nThe results in Fig. 1 clearly show no reduction of boron\nthermal diffusion at F+ doses of 531014 and 931014 cm−2,\nbut significant reduction at a F+ dose of 1.431015 cm−2. Fur-\nthermore, the results in Fig. 3 show that a shallow fluorine\npeak is present in the vicinity of the boron marker layer for a\nF+ dose of 1.431015 cm−2, but is not present for lower\ndoses. Thus there is a correlation between the appearance of\nthe shallow fluorine peak in the vicinity of the boron marker\nlayer and the reduction of boron thermal diffusion. This re-\nduction of boron thermal diffusion occurs above a critical F+\ndose of between 931014 and 1.431015 cm−2.\nThe shallow fluorine peak in Fig. 3(c) lies at a depth of\nabout 0.07–0.22 mm, which corresponds to 0.17–0.53Rp,\nwhere Rp is the range of the fluorine implant. Simulations of\nvacancy and interstitial profiles after implantation27,28 have\npredicted a vacancy-rich region extending from the surface\nto a depth approaching the implantation rang Rp and a deeper\ninterstitial-rich region peaking at a depth just beyond Rp.\nThis indicates that the shallow fluorine peak lies in the\nvacancy-rich region of the damage profile. Work on the dif-\nfusion of fluorine in silicon has shown that fluorine diffuses\nextremely rapidly in silicon with significant diffusion occur-\nring at temperatures as low as 550 °C.29 Thus on the basis of\ndiffusion alone we would not expect to see much fluorine\nremaining after the 30 s anneal at 1000 °C used in our work.\nThe presence of large fluorine peaks in Fig. 3 after anneal,\ntherefore, suggests that fluorine has been trapped at defects\ncreated by the fluorine implant. The TEM micrograph in Fig.\n6 shows no evidence of extended defects down to a depth of\n0.29 mm, and hence the trapping of fluorine at the shallow\nfluorine peak must be due to defects that are too small to\nresolve by TEM.\nFIG. 5. Fluorine concentrations at depths corresponding to the positions of\nthe shallow fluorine peak the fluorine shoulder and the deep fluorine peak as\na function of F+ implantation dose. Results are shown for samples with and\nwithout a boron marker layer.\nTABLE II. Summary of integrated florine doses in different regions of the profiles before and after an anneal of 30 s at 1000°C in dry N2.\nFluorine remaining after anneal\nF implant dose cm−2 Total Shallow peak s0.04–0.22 mmd Shoulder s0.22–0.28 mmd Deep peak s0.28–0.70 mmd\nImplant SIMS scm−2d (%) scm−2d (%) scm−2d (%) scm−2d (%)\n531014 531014 2.2231014 44 1.431012 0.6 3.431011 0.2 2.1731014 98\n931014 8.831014 5.5531014 63 1.631012 0.3 1.831012 0.3 5.4831014 99\n1.431015 1.231015 6.1331014 51 1.531013 2.4 1.031013 1.6 5.8531014 95\n2.331015 2.331015 1.6131015 70 8.431013 5.2 4.631013 2.9 1.4531015 90\nFIG. 6. Cross-section transmission electron micrographs of a sample with a\nboron marker layer, implanted with 2.331015 cm−2 fluorine and annealed\nfor 30 s at 1000 °C in dry N2; (a) low magnification image; (b) high mag-\nnification image.\n4118 J. Appl. Phys., Vol. 96, No. 8, 15 October 2004 El Mubarek et al.\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nThere is considerable evidence in the literature for the\nformation of vacancy-fluorine clusters.13,17,23–25 For example,\nShano et al.13 proposed the presence F-V6 clusters on the\nbasis of ab initio calculations and Diebel et al.17,25 proposed\nthe presence of F-V3 clusters.\n17,25 Positron annihilation spec-\ntroscopy has also been used to directly show the presence of\nfluorine vacancy complexes close to the surface.23 Our re-\nsults are consistent with this work, and hence we propose\nthat the shallow fluorine peak is due to the trapping of fluo-\nrine at vacancy-fluorine clusters. Support for this conclusion\ncomes from the results in Fig. 5, which show that a fluorine\nconcentration after anneal of <131018 cm−3 is needed for\nthe fluorine vacancy clusters to form and for boron thermal\ndiffusion to be reduced. This value is in agreement with the\nresults of Shano et al.,13 who showed that a minimum fluo-\nrine concentration of 131018 cm−3 was required after anneal\nto suppress boron transient enhanced diffusion.\nA comparison of the SIMS profile in Fig. 4(d) with the\nTEM micrograph in Fig. 6, shows that the deep fluorine peak\ncorrelates with the band of dislocation loops. The deep fluo-\nrine peak extends from about 0.28 to 0.70 mm, which com-\npares with the band of defects in Fig. 6 extending from about\n0.29 to 0.73 mm. Similar dislocation loops have been re-\nported by Wu, Fulks, and Mikkelsen30 for a BF2\n+ implant and\nby Pi, Burrows, and Coleman23 for a F+ implant. Wu, Fulks,\nand Mikkelsen reported that the loops were perfect and\nfaulted partial interstitial loops, with sizes ranging from\n<20–80 nm.30 Given the similarity between these reported\nloops and those in Fig. 6, and the location of the deep fluo-\nrine peak in the interstitial-rich region of the fluorine damage\nprofile, we propose that the deep fluorine peak is due to\nfluorine clustering at interstitial dislocation loops.\nAs discussed in the introduction, several alternative\nmechanisms have been proposed to explain the effect of\nfluorine in suppressing the transient enhanced diffusion of\nboron, including a chemical interaction between boron and\nfluorine,4,9,11,14,16 the presence of vacancy-fluorine clus-\nter13,17,18,25 and the interaction of fluorine with\ninterstitials.2,4–10,18 The possibility of a chemical interaction\nbetween boron and fluorine can be discounted, since the\nshallow fluorine peak is seen whether or not a boron marker\nlayer is present, as shown in Figs. 4(c) and 4(d), indicating\nthat the shallow fluorine peak is not caused by the presence\nof the boron marker layer. Figure 4 also shows that the deep\nfluorine peak is present at all F+ doses, while Fig. 1 shows\nthat suppression of boron thermal diffusion is only seen for\nthe highest F+ dose of 1.431015 cm−2. Trapping of intersti-\ntials at dislocation loops in the deep fluorine peak can there-\nfore also be discounted as an explanation for the effect of\nfluorine on boron thermal diffusion. The strong correlation\nbetween the suppression of boron thermal diffusion and the\nappearance of the shallow fluorine peak in the vicinity of the\nboron marker layer at a fluorine implantation dose of 1.4\n31015 cm−2 provides clear evidence that this peak is respon-\nsible for the suppression of boron thermal diffusion. The\npresence of vacancy-fluorine clusters in the vicinity of the\nboron marker layer, as discussed above, would be expected\nto give an undersaturation of the local interstitial concentra-\ntion, since any interstitials in the vicinity would be able to\nrecombine and annihilate with vacancies at or near the\nvacancy-fluorine clusters. Since boron diffusion in silicon is\nmediated by interstitials, an undersaturation of the interstitial\nconcentration would give rise to a suppression of the boron\nthermal diffusion.\nA comparison of the shapes of the shallow fluorine peaks\nin Figs. 4(c) and 4(d) shows not only an increase in peak\nfluorine concentration with F+ implantation dose, but also a\nbroadening of the peak. Taking a fluorine concentration after\nanneal of 131018 cm−3 as a reference (the concentration re-\nquired for the shallow peak formation), the shallow fluorine\npeak extends to within 0.15 mm of the surface for a F+ dose\nof 1.431015 cm−2 and within 0.07 mm for a dose of 2.3\n31015 cm−2, as shown in Table III. Thus the shallow fluorine\npeak extends closer to the surface at the higher F+ dose. This\nbehavior can be understood if critical fluorine and vacancy\nconcentrations after implant are required for the vacancy-\nfluorine clusters to form. The as-implanted fluorine profiles\nin Fig. 4 show a rising fluorine concentration with increasing\ndepth in the vicinity of the shallow fluorine peak. In contrast,\nsimulations of vacancy profiles after implant27 indicate that\nthe vacancy concentration decreases with increasing depth,\nwhich is the opposite trend to the fluorine concentration. In\nthe surface region where the shallow fluorine peak is located,\nthe fluorine concentration is low but the vacancy concentra-\ntion is high, so the fluorine concentration would be expected\nto limit the vacancy-fluorine cluster formation. This can ex-\nplain why the shallow fluorine peak extends towards the sur-\nface with increasing F+ dose, since the depth at which the\nfluorine concentration after implant reaches the critical value\nTABLE III. Estimation of the fluorine concentration after implant required for the formation of the shallow\nfluorine peak and the fluorine shoulder obtained from an analysis of the depths at which the fluorine concen-\ntration after anneal drops below the critical value of 131018 cm−3.\nShallow F peak F shoulder\nF implant dose\nscm−2d\nDepth at which\nF conc. after\nanneal is\n131018 cm−3 smmd\nF concentration\nafter implant at the\ngiven depth scm−3d\nDepth at which\nF conc. after anneal\nis 131018 cm−3 smmd\nF concentration\nafter implant at the\ngiven depth scm−3d\n931014 fl fl 0.28 1.531019\n1.431015 0.15 5.631018 0.23 1.531019\n2.331015 0.07 3.631018 fl fl\nJ. Appl. Phys., Vol. 96, No. 8, 15 October 2004 El Mubarek et al. 4119\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nrequired for cluster formation (value estimated below) lies\ncloser to the surface at higher fluorine doses.\nThe critical fluorine concentration after implant required\nfor vacancy-fluorine cluster formation can be estimated ei-\nther from the point on the shallow fluorine peak at which the\nfluorine concentration drops below 131018 cm−3 or from the\nas-implanted fluorine concentration in the vicinity of the\nshallow fluorine peak at the critical F+ implant dose. Values\nof critical fluorine concentration after implant are summa-\nrized in Table III for the first method and in Table IV for the\nsecond method. Table III shows a critical fluorine concentra-\ntion after implant of 5.631018 cm−3 for a F+ dose of 1.4\n31015 cm−2 and of 3.631018 cm−3 for a F+ dose of 2.3\n31015 cm−2. For comparison, Table IV shows that the shal-\nlow fluorine peak appears at a critical F+ implant dose be-\ntween 931014 and 1.431015 cm−2, which gives a critical\nfluorine concentration after implant between 4.031018 and\n6.631018 cm−3. These values in Table IV are of the same\norder as those in Table III, which gives some confidence in\ntheir validity. From this data it can therefore be concluded\nthat the critical fluorine concentration after implant for the\nformation of the vacancy-fluorine clusters in the shallow\nfluorine peak is in the range 3.631018–6.631018 cm−3.\nFinally, it is interesting to speculate on the origin of the\nfluorine shoulder, which is present at a depth of\n0.22–0.28 mm. This is equivalent to a depth of\n0.52–0.67 Rp, which indicates that the shoulder is in the\nvacancy-rich region of the damage profile. The TEM results\nin Fig. 6 show that there are no dislocation loops at this\ndepth, and hence the shoulder is not due to trapping of fluo-\nrine at dislocation loops. Furthermore, the results in Fig. 5\nshow that the variation of peak fluorine concentration in the\nshoulder with implanted fluorine dose follows a similar trend\nto that seen in the shallow fluorine peak, though with the\ncritical fluorine dose shifted to a lower value. These consid-\nerations point to the conclusion that the shoulder is due to\nsome kind of vacancy-fluorine cluster. Following the two\napproaches described above for estimating the critical F+\ndose after implant, Table III gives a value of 1.5\n31019 cm−3 at a F+ dose of 931014 and 1.531019 cm−3 at a\nF+ dose of 1.431015 cm−2, while Table IV gives a value in\nthe range 1.0–1.731019 cm−3. These two approaches are\nagain giving values of the same order, and all fall within a\nrange of 1.0–1.731019 cm−3. This range is different than\nthat obtained for the shallow fluorine peak s3.631018–6.6\n31018 cm−3d, which suggests that the fluorine shoulder may\nbe due to a different type of vacancy-fluorine cluster than the\nshallow fluorine peak. Since the shoulder is in a region\nwhere the fluorine concentration is high and the vacancy\nconcentration is low27 after implant, we speculate that the\nclusters in this region may be fluorine rich. Similarly, since\nthe shallow fluorine peak is in a region where the fluorine\nconcentration is low and the vacancy concentration high27\nafter implant, we speculate that the clusters in this region\nmay be vacancy rich. Support for this hypothesis comes from\nreports in the literature which showed that for a 0.5 MeV,\n531015 cm−2 F+ implant, V-dominated V-F complexes were\nformed closer to the surface and, F-dominated V-F com-\nplexes were formed deeper closer to the implantation\nrange.23 Further work is needed to confirm this hypothesis.\nV. CONCLUSIONS\nA study has been carried out of the effect of fluorine\nimplants with doses in the range 531014–2.331015 cm−2\non the thermal diffusion of boron marker layers in silicon.\nFor F+ doses of 1.431015 and 2.331015 cm−2 the fluorine\nsignificantly reduces the boron thermal diffusion coefficient\nby factors of 1.9 and 37, respectively. This reduction of bo-\nron thermal diffusion correlates with the appearance of a\nshallow fluorine peak sdepth=0.07–0.22 mmd in the SIMS\nprofile at a F+ dose of 1.431015 cm−2. This peak is present\nin samples with and without the boron marker layer and\nhence is not due to a chemical interaction between the fluo-\nrine and boron. The results suggest that the shallow fluorine\npeak is due to vacancy-fluorine clusters and that the reduc-\ntion in boron thermal diffusion is due to a suppression of the\nexcess interstitial concentration in the vicinity of the boron\nmarker layer due to the presence of the clusters. Analysis of\nthe SIMS profiles indicates that a fluorine concentration after\nimplant in the range 3.6–6.631018 cm−3 is needed for the\nvacancy-fluorine clusters to form.\nACKNOWLEDGMENT\nThe authors would like to acknowledge the Engineering\nand Physical Sciences Research Council for funding this\nwork.\n1R. G. Wilson, J. Appl. Phys. 54, 6879 (1983).\n2K. Ohyu, T. Itoga, and N. Natsuaki, Jpn. J. Appl. Phys., Part 1 29, 457\n(1990).\nTABLE IV. Estimation of the fluorine concentration after implant required for the formation of the shallow\nfluorine peak and the fluorine shoulder obtained from analysis of the peak fluorine concentrations in the shallow\nfluorine peak and fluorine shoulder at different F+ implant doses.\nShallow F peak F shoulder\nF implant dose scm−2d\nF conc. after\nimplant at depth\nof 0.16 nm scm−3d\nShallow\npeak present?\nF conc. after\nimplant at\ndepth of 0.29 nm scm−3d Shoulder present?\n531014 2.531018 1.031019\n931014 4.031018 1.731019 U\n1.431015 6.631018 U 2.531019 U\n2.331015 1131018 U 4.631019 U\n4120 J. Appl. Phys., Vol. 96, No. 8, 15 October 2004 El Mubarek et al.\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\n3D. Fan, J. M. Parks, and R. J. Jaccodine, Appl. Phys. Lett. 59, 1212\n(1991).\n4L. Y. Krasnobaev, N. M. Omelyanovskaya, and V. V. Makarov, J. Appl.\nPhys. 74, 6020 (1993).\n5T. H. Huang, H. Kinoshita, and D. L. Kwong, Appl. Phys. Lett. 65, 1829\n(1994).\n6H. -H. Vuong et al., J. Appl. Phys. 77, 3056 (1995).\n7D. F. Downey, J. W. Chow, E. Ishida, and K. S. Jones, Appl. Phys. Lett.\n73, 1263 (1998).\n8Y.-J. Park and J-J Kim, J. Appl. Phys. 85, 803 (1999).\n9J. Liu, D. F. Downey, K. S. Jones, and E. Ishida, Proceedings of the\nInternational Conference on Ion Implantation Technology, Kyoto, Japan,\n22–26 June 1998, edited by J. Matsuo, G. Takaoka, and I. Yamada\n(IEEE,Piscataway, NJ, 1999), Vol. 2, p. 951.\n10E. Ishida, D. F. Downey, K. S. Jones, and J. Liu, Proceedings of the\nInternational Conference on Ion Implantation Technology, Kyoto, Japan,\n22–26 June 1998, edited by J. Matsuo, G. Takaoka, and I. Yamada (IEEE,\nPiscataway, NJ, 1999), Vol. 2, p. 909.\n11L. S. Robertson, P. N. Warnes, K. S. Jones, S. K. Earles, M. E. Law, D. F.\nDowney, S. Falk, and J. Liu, Mater. Res. Soc. Symp. Proc. 610, B4.2.1\n(2000).\n12N. Ohno, T. Hara, Y. Matsunaga, M. I. Current, and M. Inoue, Mater. Sci.\nSemicond. Process. 3, 221 (2000).\n13T. S. Shano, R. Kim, T. Hirose, Y. Furuta, H. Tsuji, M. Furushashi, and K.\nTaniguchi, Tech. Dig. - Int. Electron Devices Meet. 37, 41 (2001).\n14A. Mokhberi, R. Kasnavi, P. B. Griffin, and J. D. Plummer, Appl. Phys.\nLett. 80, 3530 (2002).\n15J. M. Jacques, L. S. Robertson, and K. S. Jones, Mater. Res. Soc. Symp.\nProc. 717, C461 (2002).\n16A. Dusch, J. Marcon, K. Masmoudi, K. Ketata, F. Olivie, M. Benzohra,\nand M. Ketata, Nucl. Instrum. Methods Phys. Res. B 186, 360 (2002).\n17M. Diebel, S. Charkravarthi, C. F. Machala, S. Ekbote, A. Jain, and S. T.\nDunham, Mater. Res. Soc. Symp. Proc. 765, D6.15 (2003).\n18H. A. W. El Mubarek and P. Ashburn, Appl. Phys. Lett. 83, 4134 (2003).\n19K. Liu, J. Wu, J. Chen, and A. Jain, IEEE Electron Device Lett. 24, 180\n(2003).\n20H. Fukutome, Y. Momiyama, H. Nakao, T. Aoyama, and H. Arimoto,\nTech. Dig. - Int. Electron Devices Meet. 2003, 485.\n21P. Ashburn, Design and Realization of Bipolar Transistors (Wiley, New\nYork, 1988).\n22D. J. Eaglesham, P. A. Stolk, H.-J. Gossmann, and J. M. Poate, Appl.\nPhys. Lett. 65, 2305 (1994).\n23X. D. Pi, C. P. Burrows, and P. G. Coleman, Phys. Rev. Lett. 90, 155901\n(2003).\n24R. R. Robinson and M. E. Law, Tech. Dig. - Int. Electron Devices Meet.\n2002, 883.\n25M. Diebel and S. T. Dunham, Mater. Res. Soc. Symp. Proc. 717, C4.5.1\n(2002).\n26S. Tian, Nucl. Instrum. Methods Phys. Res. B 215, 403 (2004).\n27M. D. Giles, J. Electrochem. Soc. 138, 1160 (1991).\n28A. Sultan, S. Banerjee, S. List, and V. McNeil, J. Appl. Phys. 83, 8046\n(1998).\n29S.–P. Jeng, T.–P. Ma, R. Canteri, M. Anderle, and G. W. Rubloff, Appl.\nPhys. Lett. 61, 1310 (1992).\n30I-W. Wu, R. T. Fulks, and J. C. Mikkelsen Jr., J. Appl. Phys. 60, 2422\n(1986).\nJ. Appl. Phys., Vol. 96, No. 8, 15 October 2004 El Mubarek et al. 4121\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\n"}