{"doi":"10.1680\/ensu.2007.160.4.157","coreId":"140009","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/2489","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/2489","10.1680\/ensu.2007.160.4.157"],"title":"Proposal for a UK domestric water trading scheme.","authors":["Griggs, John","Jeffrey, Paul"],"enrichments":{"references":[{"id":37956780,"title":"35-36, Tyndall centre for climate change research,","authors":[],"date":"2005","doi":null,"raw":", P 35-36, Tyndall centre for climate change research, 2005","cites":null},{"id":37956782,"title":"A guide to Wise Water Use,","authors":[],"date":"1995","doi":null,"raw":"GREEN VENTURE \/ CITY OF HAMILTON, A guide to Wise Water Use, Ontario Canada, 199527","cites":null},{"id":37956759,"title":"Act 2003, 81 Duty to encourage water conservation, The Stationery Office Limited,","authors":[],"date":"2003","doi":null,"raw":"TSO, Water Act 2003, 81 Duty to encourage water conservation, The Stationery Office Limited, 2003","cites":null},{"id":37956779,"title":"by the Rt Hon David Miliband MP –‘The great stink: towards an environmental contract’ at the Audit Commission annual lecture,","authors":[],"date":"2006","doi":null,"raw":"DEFRA, Speech by the Rt Hon David Miliband MP –‘The great stink: towards an environmental contract’ at the Audit Commission annual lecture, Wednesday 19 July 2006","cites":null},{"id":37956791,"title":"Domestic policy frameworks for adaptation to climate change in the water sector – Part 1: Annex 1 countries, p 26-28, Organisation for economic co-operation and development and the International Energy Agency,","authors":[],"date":null,"doi":null,"raw":"LEVINA, E. & ADAMS, H. Domestic policy frameworks for adaptation to climate change in the water sector – Part 1: Annex 1 countries, p 26-28, Organisation for economic co-operation and development and the International Energy Agency,","cites":null},{"id":37956777,"title":"Domestic tradable quotas: A policy instrument for reducing greenhouse gas emissions from energy use,","authors":[],"date":null,"doi":null,"raw":"STARKEY R. & ANDERSON, K., Domestic tradable quotas: A policy instrument for reducing greenhouse gas emissions from energy use, Technical Report","cites":null},{"id":37956767,"title":"Emissions Trading Scheme –","authors":[],"date":"2006","doi":"10.4324\/9781849771085","raw":"DEFRA, EU Emissions Trading Scheme – Consultation on the Phase 2 UK Draft National Allocation Plan, March 200625","cites":null},{"id":37956773,"title":"Explanatory memorandum to The Water Industry (Charges) (Vulnerable Groups) (Amendment) Regulations","authors":[],"date":"2005","doi":null,"raw":"DEFRA, Explanatory memorandum to The Water Industry (Charges) (Vulnerable Groups) (Amendment) Regulations 2005 N0.59, 2005","cites":null},{"id":37956764,"title":"facts, figures and maps, An Environmental Atlas, United Nations environment programme, page 11.","authors":[],"date":"2004","doi":null,"raw":"UNEP, Freshwater in Europe- facts, figures and maps, An Environmental Atlas, United Nations environment programme, page 11. Switzerland, 2004","cites":null},{"id":37956774,"title":"HORIZONS AND OTAGO REGIONAL COUNCILS: Management of freshwater resources, Report of the Controller and Auditor-General, p 83,","authors":[],"date":"2005","doi":null,"raw":"TUMUAKI O TE MANA AROTAKE, HORIZONS AND OTAGO REGIONAL COUNCILS: Management of freshwater resources, Report of the Controller and Auditor-General, p 83, May 200526","cites":null},{"id":37956775,"title":"Interests, incentives and institutions, Policy, The centre for independent studies,","authors":[],"date":"1998","doi":null,"raw":"STIGLITZ, J., Interests, incentives and institutions, Policy, The centre for independent studies, Australia, Spring 1998","cites":null},{"id":37956770,"title":"International experiences with economic incentives for protecting the environment, p27-31, National center for environmental economics, US Environmental Protection Agency,","authors":[],"date":"2004","doi":null,"raw":"NCEE, International experiences with economic incentives for protecting the environment, p27-31, National center for environmental economics, US Environmental Protection Agency, 2004","cites":null},{"id":37956784,"title":"It doesn’t take much energy to get a tax break -Understanding the benefits of the Enhanced Capital Allowance - Scheme for EnergySaving Investments, Carbon Trust,","authors":[],"date":"2005","doi":null,"raw":"CARBON TRUST, It doesn’t take much energy to get a tax break -Understanding the benefits of the Enhanced Capital Allowance - Scheme for EnergySaving Investments, Carbon Trust, March 2005","cites":null},{"id":37956781,"title":"metering: Present position and legislation","authors":[],"date":"2005","doi":null,"raw":"WSGM, Water metering: Present position and legislation – WSGM 01 \/ 04, Water Saving Group Metering Sub-Group, 2005","cites":null},{"id":37956762,"title":"Office of water services,","authors":[],"date":"2005","doi":null,"raw":"OFWAT, Water and Sewerage Bills 2005 2006, Office of water services, 2006","cites":null},{"id":37956776,"title":"Paper 11 – Tradable Quotas: Setting Limits to Carbon Emissions, The Lean Economy Initiative,","authors":[],"date":"1997","doi":null,"raw":"FLEMING, D., Paper 11 – Tradable Quotas: Setting Limits to Carbon Emissions, The Lean Economy Initiative, London, 1997","cites":null},{"id":37956768,"title":"Pollution, property and prices: an essay in policy making and economics,","authors":[],"date":"1968","doi":"10.1017\/s0008423900025282","raw":"DALES, J. H., Pollution, property and prices: an essay in policy making and economics, University of Toronto Press, Toronto, 1968.","cites":null},{"id":37956787,"title":"Security of supply, leakage and the efficient use of water: 2004-05 report, p 49,","authors":[],"date":"2005","doi":null,"raw":"OFWAT, Security of supply, leakage and the efficient use of water: 2004-05 report, p 49, December 2005, Cited in House of Lords, Water Management Volume 1: Report, 8 th report of session 2005-06, Science and Technology Committee, HL Paper","cites":null},{"id":37956766,"title":"Soapboxing – Parts of England get less rain than Istanbul, but we’re using more and more water every year… The real trick in cutting consumption is to create a market in water savings, Green Futures,","authors":[],"date":"2005","doi":null,"raw":"BROWN, C, Soapboxing – Parts of England get less rain than Istanbul, but we’re using more and more water every year… The real trick in cutting consumption is to create a market in water savings, Green Futures, page 25, July\/August 2005","cites":null},{"id":37956771,"title":"Sustainable water usage systems: models for the sustainable utilization of domestic water in urban areas,","authors":[],"date":null,"doi":"10.1016\/s0273-1223(99)00088-8","raw":"TERPSTRA, P.M.J., Sustainable water usage systems: models for the sustainable utilization of domestic water in urban areas, Water Science Technology,","cites":null},{"id":37956765,"title":"The Energy Challenge, Energy Review report, The Stationary Office,","authors":[],"date":"2006","doi":null,"raw":"DTI, The Energy Challenge, Energy Review report, The Stationary Office, page 12. July 2006.","cites":null},{"id":37956760,"title":"THE EUROPEAN COMMUNITIES, Directive 2000\/60\/EC of the European Parliament and of the","authors":[],"date":"2000","doi":"10.1002\/9780470949146.app6","raw":"COUNCIL OF THE EUROPEAN COMMUNITIES, Directive 2000\/60\/EC of the European Parliament and of the Council of 23 October 2000 establishing a framework for Community action in the field of water policy. Official Journal of the European Communities L327 43 1-72, 2000","cites":null},{"id":37956763,"title":"The social impacts of environmental taxes: removing regressivity – Towards the design of an environmentally and socially conscious water metering tariff, PSI research discussion paper 21, Policy Studies Institute,","authors":[],"date":"2004","doi":null,"raw":"DRESNER, S. & EKINS, P. The social impacts of environmental taxes: removing regressivity – Towards the design of an environmentally and socially conscious water metering tariff, PSI research discussion paper 21, Policy Studies Institute, 2004","cites":null},{"id":37956769,"title":"The Structuring of Atmospheric Pollution Control Systems.","authors":[],"date":null,"doi":null,"raw":"CROCKER, T. D. The Structuring of Atmospheric Pollution Control Systems. In Wolozin, H. (Ed) The Economics of Air Pollution, New York, W.Norton & Co,","cites":null},{"id":37956790,"title":"Time-inconsistent environmental policy and optimal delegation,","authors":[],"date":"2003","doi":null,"raw":"HELM, D.R. HEPBURN, C. & MASH, R., Time-inconsistent environmental policy and optimal delegation, Department of Economics Discussion Paper Series, Number 175, Oxford University, 2003","cites":null},{"id":37956778,"title":"Tyndall centre for climate change research,","authors":[],"date":"2005","doi":"10.1016\/j.envdev.2012.03.006","raw":", Tyndall centre for climate change research, 2005","cites":null},{"id":37956783,"title":"update, Directorate-General for research sustainable energy systems, EUR 21951, European Commission,","authors":[],"date":"2005","doi":null,"raw":"BICKEL, P. & FRIEDRICH, R. ExternE – Externalities of energy – Methodology 2005 update, Directorate-General for research sustainable energy systems, EUR 21951, European Commission, 2005","cites":null},{"id":37956772,"title":"Water and Sewerage Services (Northern Ireland) Order, Department for regional development Northern Ireland,","authors":[],"date":"2006","doi":null,"raw":"DRDNI, Draft Water and Sewerage Services (Northern Ireland) Order, Department for regional development Northern Ireland, 2006","cites":null},{"id":37956761,"title":"What value the rural environment?,","authors":[],"date":"2002","doi":null,"raw":"BENNETT, J. What value the rural environment?, Policy, 2002, 14, No 4, 44-","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-01-01T00:00:00Z","abstract":"Water charges in the UK, Ireland, Canada and parts of the USA are largely based\nupon house value rather than consumption. This paper shows how charges based\nupon consumption could facilitate trading among metered consumers and provide\nincentives to non-metered customers to switch to a metered tariff. To develop a\nhousehold domestic water trading scheme, various environmental trading schemes\nwere examined including the EU emissions trading scheme (EU ETS) and tradable\nenergy quotas (TEQs). The derived scheme encourages domestic consumers to trade\nand reduce their water use. Although a degree of trading would be possible on an\noccasional basis for unmetered properties (by the substitution of appliances\nwith water-conserving models) and conventionally metered properties (based upon\nsustained reductions in consumption, but on an annual basis), frequent full\ntrading would only be possible if smart water meters were installed. It is\nconcluded that, while water trading schemes are feasible, they present a number\nof challenges. However, due to the availability of a number of existing\npotential elements, implementation—at least on a regional basis—could be\nachievable relatively quickly. Once an initial scheme is running it could be\nrefined and expanded to other regions, and nationally or internationally, if\nappropr","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140009.pdf","fullTextIdentifier":"https:\/\/dspace.lib.cranfield.ac.uk\/bitstream\/1826\/2489\/1\/Proposal%20UK%20domestic%20water%20trading%20scheme%20-%202007.pdf","pdfHashValue":"75621c3b7a39ef51c905f3aaed42d7baf38ff381","publisher":"Thomas Telford","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/2489<\/identifier><datestamp>2011-04-14T23:37:26Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Proposal for a UK domestric water trading scheme.<\/dc:title><dc:creator>Griggs, John<\/dc:creator><dc:creator>Jeffrey, Paul<\/dc:creator><dc:subject>Business<\/dc:subject><dc:subject>Conservation<\/dc:subject><dc:subject>Hydrology and water resource<\/dc:subject><dc:description>Water charges in the UK, Ireland, Canada and parts of the USA are largely based\nupon house value rather than consumption. This paper shows how charges based\nupon consumption could facilitate trading among metered consumers and provide\nincentives to non-metered customers to switch to a metered tariff. To develop a\nhousehold domestic water trading scheme, various environmental trading schemes\nwere examined including the EU emissions trading scheme (EU ETS) and tradable\nenergy quotas (TEQs). The derived scheme encourages domestic consumers to trade\nand reduce their water use. Although a degree of trading would be possible on an\noccasional basis for unmetered properties (by the substitution of appliances\nwith water-conserving models) and conventionally metered properties (based upon\nsustained reductions in consumption, but on an annual basis), frequent full\ntrading would only be possible if smart water meters were installed. It is\nconcluded that, while water trading schemes are feasible, they present a number\nof challenges. However, due to the availability of a number of existing\npotential elements, implementation—at least on a regional basis—could be\nachievable relatively quickly. Once an initial scheme is running it could be\nrefined and expanded to other regions, and nationally or internationally, if\nappropri<\/dc:description><dc:publisher>Thomas Telford<\/dc:publisher><dc:date>2011-04-14T23:37:26Z<\/dc:date><dc:date>2011-04-14T23:37:26Z<\/dc:date><dc:date>2007-01-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Griggs, J and Jeffrey P. Proposal for a UK domestic water trading scheme. Engineering Sustainability, Vol.160(4), December 2007, pp157-165.<\/dc:identifier><dc:identifier>1478-4629<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1680\/ensu.2007.160.4.157<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/2489<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1478-4629","1478-4629"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Business","Conservation","Hydrology and water resource"],"subject":["Article"],"fullText":"1J. C. Griggs1 BSc, MSc, FIPHE & P. Jeffrey2 BSc, MSc, PhD, FCIWEM\n1Corresponding author:\nPrincipal Consultant, Environmental Consultancy Group, Building Research\nEstablishment Ltd, Bucknalls Lane, Garston, Watford, Herts, WD25 9XX, UK\nTelephone 01923 66 4543, Fax 01923 66 4095, e-mail griggsj@bre.co.uk\n2 Principal Research Fellow, Centre for Water Science, Cranfield University, UK.\nNumber of words 5367 including tables and references\nNumber of tables 4 number of figures 2\nThree key words: Conservation, Hydrology & water resources, Trading Scheme\n2Abstract\nWater charges in the UK, Ireland, Canada and parts of the USA, are largely based\nupon house value rather than consumption. This paper shows how charges based upon\nconsumption could facilitate trading amongst metered consumers, and provide\nincentives to non-metered customers to switch to a metered tariff. To develop a\nhousehold domestic water trading scheme various environmental trading schemes\nwere examined, including European Union Emissions Trading Scheme (EU ETS) and\nTradable Energy Quotas (TEQs). The derived scheme for water incentivises domestic\nconsumers to trade and reduce their use of the resource. Although a degree of trading\nwould be possible on an occasional basis with un-metered properties (by the\nsubstitution of appliances with water conserving models), and conventionally metered\nproperties (based upon sustained reductions in consumption, but on an annual basis),\nfrequent full trading would only be possible if smart water meters were installed. We\nconclude that, whilst water trading schemes are feasible, they present a number of\nchallenges. However, due to the availability of a number of existing potential\nelements, implementation, at least on a regional basis, could be achievable relatively\nquickly. Once an initial scheme is running it could be refined and expanded to other\nregions, and nationally or internationally, if appropriate.\n1 Water conservation in perspective\nSince 2003 it has been a legal requirement for the Government of England and Wales\nto encourage water conservation and report on progress every three years (Section 81\nof the Water Act 20031). ‘To regulate in a way that provides incentives … for\ncustomers in England and Wales’, is also part of the Office of water services’ (Ofwat)\n3mission statement. Additionally, one of the requirements of the EU Water framework\nDirective2 is for Member States to ‘ensure by 2010 that water-pricing policies provide\nadequate incentives to use water resources efficiently and to recover the true costs of\nwater services in an equitable manner’. So, there is a significant and timely political\nand environmental need to develop appropriate water conservation incentives for\nusers not only in the UK but elsewhere.\nThe cost of water is critical to the success of any incentive scheme3. For charges to be\nrelated to consumption, the volume used must be measured, but currently only 26 %\nof UK homes are metered4. Various studies to investigate the costs and benefits of\ninstalling meters throughout the UK have concluded that metering costs are high in\nrelation to the benefits. Apart from the purchase cost, there are the installation,\nmaintenance, reading and verification costs, and the potential social and health costs\nparticularly for poor families. The Policy Studies Institute5 have demonstrated the\nvalue of different tariff structures but with all there would be winners and losers.\nAlso, water charges in the UK are some of the lowest in Europe6. So there is little\nincentive for UK householders to request a meter and be billed accordingly. However,\nin regions such as the South East of England, water stress (withdrawals \/ availability)\nis classified as severe, comparable with the situation in much of Southern Europe.\nSimply installing a meter will not necessarily produce a lifestyle change resulting in\nlong–term water savings. For example, this quote from the Government’s Energy\nReview could equally apply to domestic water – ‘The main obstacles to the take up of\nenergy efficiency are lack of information about costs and benefits, absence of\nappropriate incentives, and lack of motivation among customer.’7 . So if metering will\n4not motivate water efficiency, what alternatives or complimentary approaches could\nbe applied in the UK and elsewhere?\nBrown8 has suggested that the principles of carbon trading schemes could be applied\nto the water sector. For example, she considers the case of a developer who retrofits\nwater saving appliances into housing association properties with payment being in the\nform of in-kind water allowances. The result would be water savings in older houses\nwith commensurate water saving appliances installed in new build houses as part of\nthe planning requirements. Although this innovative approach addresses the issue of\nwater conservation infrastructure in buildings, it does not influence user habits. As an\nelement of a more comprehensive scheme, the approach proposed by Brown could be\nvaluable.\nTraditionally, people are encouraged to reduce their consumption of a product, or\ngeneration of pollution, in exchange for reduced costs. However, trading schemes\ntend to incentivise the participants more than the usual restrictive conservation\nmeasures as each participant is allocated a limit or provided with a specific allowance.\nThis creates awareness of the value of a commodity by generating, or enhancing, the\ncommodity’s market. Users with extravagant consumption will have to reduce or\npurchase additional allowances. Those with low consumption will have excess\nallowances that can be sold and traded.\nCurrently, the most comprehensive trading scheme in the world is the European\nUnion’s Emission Trading Scheme (EU ETS). This scheme is multinational and\naddresses the major emitters of carbon dioxide (CO2) in a way that encourages them\n5to change processes and practices to reduce carbon emissions9. So, could the EU ETS\nbe translated for use in a water context? A critical examination of the theory, structure\nand experiences of trading schemes is used below as a precursor to the development\nof a domestic water trading scheme (DWTS) that could provide incentives for\nhouseholders to save water and invest in water meters.\n2 Background to environmental trading schemes\nEnvironmental trading schemes were first suggested in the 1960s10,11, first\nimplemented in the USA and have since grown in size and coverage. Although\ntrading schemes are simple in concept they tend to be complex in practice to ensure\ntheir operability and fairness. However, trading schemes are very good at creating, or\ndeveloping, markets and making the participants aware of the cost of the commodity\ninvolved; few, if any, other mechanisms are as effective12 .\nIn outline, environmental trading schemes are typically initiated when a limit is\nimposed, or agreed, on a particular commodity, eg water, greenhouse gas emissions or\nfood. The limit is normally applied over a time period, eg 5-20 years, and may be\nsubdivided into reporting periods. Users are constrained by legal requirements, or\nvoluntary agreements, as appropriate. If the commodity limit, often called a ‘cap’, is\nset below existing use, users are encouraged to cut consumption. The cap is divided\ninto appropriate allowances for the individual participants. The allowances may be\ndistributed by an authority using a declared methodology (formula) or by auction.\n6Each participant must determine if they have sufficient commodity for their needs.\nThose with a deficit can make changes to reduce consumption or must buy more\ncommodity. At reconciliation, each user surrenders the appropriate number of\ncommodity rights, or allowances, for that period, or they may be subject to a punitive\nfine. Hence each user can chose the lowest cost way of obtaining the match between\nallowance and use. The trade of allowances may take place throughout the scheme, or\nat specific times depending upon the design and administration method. The incentive\nto trade is normally to minimise costs, but it could also be to minimise environmental\nimpacts. To date, the perfect trading scheme has not been produced, they all have\nflaws. However, the evolving nature of the schemes and the economic theories and\nmodels that support them should help schemes improve and gain acceptability.\nA fundamental issue with environmental trading schemes is the ownership of the\ncommodity concerned. With water, it can be argued that as rain falls on everyone;\nwater should be owned by all and is a right, not a commodity. This argument ignores\nthe fact that most water is not suitable for drinking and that the work and equipment\ninvolved in treating and distributing water needs to be paid for. However, as most\nwater is not drunk, there are arguments that water is over-treated and people should\nnot have to pay for a quality they do not require13.\nWhilst many people will be willing to pay an increased price, as water is a necessity\nits price has to be carefully considered. Although the cost of water is low compared to\nother utilities, there are people who have difficulty paying for it. Any proposed\nincrease needs to be related to the customers’ abilities to pay14,15.\n7One common fundamental problem with environmental trading schemes appears to be\nan almost complete lack of trading16. Another problem with such economic incentives\nis the inadequate consideration of externalities for the particular market17. Trading\nschemes generally take many years to develop and need regular reviews to ensure\nfairness and achievement of the aims. While the concept is simple and\nstraightforward, and most participants want winners and losers in order to stimulate\ntrade, in practice no one wants to be a loser.\n3 Methodology\nAs noted above, the use of a trading scheme for domestically supplied water has been\nsuggested by Brown8 as a concept at developer and housing association level. To\ndetermine whether a wider domestic water trading scheme (DWTS) is indeed feasible,\na literature review was undertaken evaluating existing trading schemes; assessing\ntheir suitability for adaptation to the water sector. Collated information was then\nstructured to identify key details of candidate trading schemes (see Table 1).\nTable 1a. Candidate trading schemes - International 1\nScheme title Lessons for water Key facts or summary\nEuropean Union Emissions\nTrading Scheme EU ETS Phase 1\nThis scheme has a structure that is\nreadily applicable to a water trading\nscheme\nTrial emissions trading scheme\nfor CO2 in the EU\nEuropean Union Emissions\nTrading Scheme EU ETS Phase 2\nAs for phase 1 +. Links with other\nschemes create options and also\nincrease uncertainty\nFirst phase of Kyoto linked\nEurope wide CO2 trading\nscheme\n8Table 1b. Candidate trading schemes - National 2\nScheme title Lessons for water Key facts or summary\nUnited Kingdom Emissions\nTrading Scheme UK ETS\nRelative targets do not limit\nconsumption as well as absolute\ntargets, but relative targets are\nsimpler to police\nRelative cap UK only scheme to\nobtain tax rebates\nEnergy Performance Commitment\nEPC -proposed UK ETS United\nKingdom Emissions Trading\nScheme\nThe quality of smart meters and their\ncommunication network are key to\nthe operation of such schemes\nMandatory scheme proposed for\nindustry that is not covered by\nEU ETS covering energy usage\nnot emissions\nLocal exchange trading schemes\n(LETS)\nThe service and skills based, links\ncould be made with water conservers\nwho could help others implement\nwater savings\nNon-financial trading scheme\nbetween local individuals, but\nlinked nationally through\nLETSlink UK\nLandfill Allowance Trading\nScheme (LATS)\nIf the reconciliation date was\nstaggered throughout the year the\nadministration burden could be\nlevelled and ease the development of\nregular trading\nWaste disposal authorities\nlandfill allowance trading\nscheme to help the UK reduce\nbiodegradable municipal waste\n(BMW) to reach its EU Landfill\nDirective obligation\nWater Rights Trading (UK) This existing scheme could be linked\nto the proposed scheme by\ndevelopment plans that would change\nthe volume of water currently being\nabstracted\nWater abstraction licence\nholders can trade water rights to\nprovide flexibility to manage\ntheir water needs\nWaterfind (Australia) The concept of participants donating\nallowances to others, instead of\ntrading them in the market, is an\noption that could be considered in the\nOn-line water market set up to\nenable irrigators’ excess water\nto be donated to environmental\nprojects\n9future\nSolvent Trading Scheme The predetermined cap reductions\ncould be applied to water use areas,\ncommunities or individual households\nfor long term planning of water\nresource development\nThe USA’s first cap and trade\nscheme for industrial solvent\nusers with a progressively\ntightening cap\nTransferable water permits for\nTasman district in the Waimea\nplains\nTrials need to be conducted in areas\nthat may not be the most water\nstressed, as the price of failure could\nbe too high\nNew Zealand scheme with\npermanent and temporary water\npermit transfers for urban and\nrural users in the Wellington area\nNOx Budget Trading Program\n(NBP)\nThe one off allowance to help at the\nstart of the scheme, to maintain\nservice, could be translated to a\nspecial rebate for communities\njoining the scheme\nCap and trade scheme for\ninstallations over 25MW to\nreduce national ozone levels in\nthe USA\nAcid Rain NOx Reduction\nProgram\nThe relative targets of this simple\nstraightforward scheme may explain\nits longevity\nScheme to reduce acid rain in\nthe USA by reducing SO2 and\nNOx through allowance trading.\nTable 1c. –Candidate trading schemes - Regional 3\nScheme title Lessons for water Key facts or summary\nHunter River salinity trading\nscheme\nOn-line trading works. Good adequate\nconsultation is vital\nControl of saline discharges in\nto the river to improve its\nfreshness\nWatermove Trading can be carried out by other\nmeans than just on-line. Currently, it\nwould be too ambitious for a first\nstage trial\nConfidential water trading in the\nVictoria area of Australia with\nexchanges every Thursday\ncreating a volume limited ‘pool\nprice’ within the various trading\n10\nzones of the region\nInterstate Water Trading Project,\nMurray Darling Basin\nThe concept of ‘no new water’ could\nusefully be applied to various\ndevelopments\nNo new water, so existing water\nrights to irrigators have to be\ntraded to conserve resource\nManawatu-Wanganui Regional\nCouncils Oroua Catchment Plan\nThe lack of trading may be related to\nthe apparent threat that the scheme\nmakes if it is put in operation.\nThe link to an environmental event\nsuggests that for a UK water trading\nscheme, this could be paralleled for a\ndrought situation.\nThe First regional plan\ndeveloped under the New\nZealand Resource Management\nAct to include a transferable\nwater permit scheme as part of a\nresource management plan for\nthe river. Transfers can only\ntake place once the river level\nhas dropped below a threshold\n(30% mean flow) So far there\nhas been no trading\nTransferable water permits for\nTasman district in the Waimea\nplains\nTrials need to be conducted in areas\nthat may not be the most water\nstressed, as the price of failure could\nbe too high\nNew Zealand scheme with\npermanent and temporary water\npermit transfers for urban and\nrural users in the Wellington area\nRegional Clean Air Incentives\nMarket RECLAIM\nThe linking of an industrial scheme\nwith a personal scheme is novel but\nthe issue of fraud puts this model into\nquestion\nTo improve air quality in the\narea around LA by trading\nallowances outside of state\nlimits\nTable 1d. Candidate trading schemes - Personal 4\nScheme title Lessons for water Key facts or summary\nPersonal Carbon Trading\ndomestic tradable quotas (DTQs)\nor tradable energy quotas (TEQs)\nComputer administered trading needs\nto be adopted if the scheme is\nexpanded to the whole country’s 24\nTrading within a carbon budget\nby every individual at each\ntransaction, to create awareness\nof carbon and help reduce\nemissions and pollution\nworldwide\n11\nmillion households.\nFree allocation of allowances would\nnot be applicable to water due to\ndistribution and treatment costs.\nAs the EU ETS is the largest and most developed scheme it arguably provides the best\nbasis for a water trading scheme. Many of the issues of competitiveness, monitoring,\ntransparency and allocation methodology have been resolved and the lessons learnt\ncould be applied to a DWTS. However, as EU ETS only covers major industrial\nemitters, it would need considerable modification to deal with households.\nA personal form of trading scheme that has been proposed in the Carbon emission\nfield is known as DTQs (Domestic Tradable Quotas) or TEQs (Tradable Energy\nQuotas)18. Such schemes, based upon the global ownership principal, provide every\nhuman with an equal allocation of credits in a carbon account. Every transaction\nwould include an exchange of carbon credits for the associated carbon cost, by using a\nform of credit, or identity, card account. Such a scheme would require large\ninvestments and commitment on a national, if not international, scale19 but the\nconcept has received Government backing as a long term possibility20. A DWTS\ncould form a bridge between the established large scale upstream schemes, such as\nEU ETS, and the much more downstream schemes like the proposed TEQs. The links\nand parallels between the key elements of EU ETS, TEQs21 and a hypothetical DWTS\nare set out in Table 2.\n12\nTable 2 - Comparison of trading schemes Table 5\nEU ETS Hypothetical DWTS TEQs\nAllocation method by\ngrandfathering\nAllocation by meter records Allocation by entitlement\nAllocation method by\nbenchmark\nAllocation by water audit Allocation by auction\nSector classifications Consumption profiles Individual or organization\nNational cap National or regional or catchment\ncap\nCarbon budget\nNew Entrant Reserve (NER) New development reserve – if\nrequired\nAuction\nClosure issues Demolition of property \/ change of\nuse\nRetirement of quotas\nReconciliation Reconciliation (annually) Budget monitoring (constant)\nTrading of allowances Trading of allowances Trading of quotas\nLinks with JI and CDM Schemes undertaken by\ncommunities could have benefits\ndistributed to the affected\nhouseholds and others in the\ncommunity. Schemes outside of a\ncatchment area could be considered\nto be similar to CDM projects.\nPossible transfer of some\nquotas to other countries for\nholidays and business travel\nTable 2 indicates that some links between the schemes are stronger than others and\nsome will need further work to develop.\n13\n4 Proposed basis for a domestic water trading scheme\n4.1 Scope and limitations\nBy examining various extant and planned schemes (as discussed above), it is possible\nto outline a basis for a UK DWTS. Most schemes rely upon metering to determine use\nof the controlled substance (eg fuel, water, etc), however it has to be accepted that in\nthe UK, for the foreseeable future, the majority of users will not be metered. Although\na national scheme would be appropriate in some countries, the ownership of water\ncompanies and the large number of water catchment areas in the UK suggests that a\nregional catchment based scheme would be the ideal and this fits in with the\nprinciples of the Water Framework Directive2. The outline structure of a proposed\nscheme is shown in Figure 1. The key elements are expanded upon in the following\nparagraphs.\nFigure 1 to go hereabouts\n4.2 Water Audit\nThe simplest way of determining household water consumption would be to use water\nmeters. However, meters22 have only been fitted in all new houses in the UK since\n1989, so alternative means are needed in the vast majority of the housing stock. One\nway of dealing with the lack of metering is to utilise water audits to determine\nbaselines, changes, and investigate complaints. In a similar way to tax returns,\nhouseholders could be required to complete an assessment that would provide the\nbasis for determining their water use rating and hence their water bill. Audits could be\n14\nconducted annually and submitted with the annual electoral roll reviews. The data\nobtained through the audit needs to be processed to determine consumption and any\nindicative trends.\nAnother approach is to build upon the method used in the various established\nenvironmental rating schemes such as BREEAM (BRE environmental assessment\nmethod) and LEED (leadership in energy and environmental design). These use\nsimple spreadsheets and average values for benchmarks, but can be restrictive in their\nsuitability for non-standard situations.\nAlternatively, a simple survey could be conducted by a trained professional auditor or\nby the householder with guidance. An example of a user-conducted audit with good\nguidance is the Canadian ‘Wise Water Use Guide’23 .\nSome aspects of an audit may already be held on databases that could be accessed by\nappropriate bodies. Such databases include: the electoral roll, planning records, recent\ncensus, tax return, credit rating and market intelligence databases. Although it may be\nuseful to collect as much information as possible, this must be balanced against cost,\ntime, civil liberties, data protection and freedom of information issues.\n4.3 Water charge determination\nFrom the audited returns, annual consumption volumes can be calculated for each\nhousehold. It will be more justifiable than the current rateable value based charge.\nMetered installations’ consumption will be determined from the meter readings, and\nadjusted where necessary using information obtained from the audit, especially when\n15\na meter has not been installed for the full accounting period. The benefit of\nconserving water could be translated into reduced treatment costs resulting in lower\nsupply charges. However, any additional administration costs due to running the\nscheme can be wholly or partially passed on.\nIn addition, the appropriate externalities will be calculated and fed in. Although\nindividual external influences may be small, their consolidated effect needs to be\nincorporated into the pricing of water. The ExternE project has been carried out for\nover 15 years into externalities24. It has produced a methodology for energy that is\napplicable to water due to the study’s comprehensive methodology.\n4.4 Un-metered trading (rebate)\nThe overall objective of the scheme is that householders will be able to moderate their\nconsumption and save water. Un-metered dwellings will have a restricted annual\nscheme of rebates and audits. If the householder has no interest in trading they may\ncontinue to pay the projected charge.\nUn-metered households cannot make financial savings by changing habits, but by\ninstalling water conserving appliances and then applying for a new water audit, which\nwill revise the chargeable volume, until another audit or the property is sold. A similar\nUK scheme is currently in operation for commercial properties using the Enhanced\nCapital Allowance (ECA) scheme that enables firms to recover all of the capital\nexpenditure against taxable profits25. Within the ECA there are currently three\nschemes; one covers water conserving products.\n16\nSuch a scheme could provide un-metered users with the additional incentive to\nrequest a meter to enter fully into the trading scheme and save more than any cost\nassociated with a meter. Although metered installations would not need to obtain\n‘approved’ appliances to enable trading, promotion of such appliances to the un-\nmetered installations could encourage metered customers to regularly review their\nown appliances.\n4.5 Metered trading\nMetered customers will have the greatest opportunities for savings and to benefit from\ntrading as they will be able to trade any monthly surplus throughout the year. The\nadministrators of the scheme have a dual incentive to make trading work for the\nmetered householders; a) encourage further take-up of meters, and b) collect more\naccurate data on water use for better water management26.\nAs demonstrated above, the building blocks needed to instigate a household domestic\nwater trading scheme in the UK are generally available and have been tried and\ntested. Table 3 sets out some of the established components that could be used to put\ntogether a pilot scheme. And Figure 2 suggests a detailed structure for such a scheme.\nTable 3- Building blocks of a domestic water trading schemee 6\nBasic structure (Fig 1) Proposed DWTS Existing ‘blocks’ that\ncould be utilised\nAudit Allocation determined from\nmeter records\nExisting water records\n17\nAllocation determined from water\naudit\nBREEAM, \/ Hamilton A guide to\nWise Water Use\nConsumption profiles Demographic database profiles\n(as used by DCLG for planning)\nDemolition of property \/ change\nof use\nPlanning guidance and policy\nDetermination of relevant\nexternalities and their impact on\nthe water price\nResults of the ExternE project by\nthe European Commission and\nthe USA Department of Energy\nNew development reserve – if\nrequired\nPlanning guidance and policy\nDetermination of charge\nReconciliation (annual event) EA or SEPA, RDAs or Water UK\nNational or regional or catchment\ncap\nEU ETS processTrading\nTrading of allowances Carbon market traders\nRebate Un-metered users appliance\nrebate scheme\nEnhanced Capital Allowance\nscheme and the Water\nTechnology Lists\nIncentives for metering Full trading UK ETS\nPossible future links Community based projects Planning process, Housing\nCorporation, other Member States\nFigure 2 to go hereabouts\n5 Example scenario\nTo illustrate how trading could be implemented amongst households a worked\nexample is provided (see Table 4). It compares four different households: (A) a single\n18\nworking person household with a metered supply, (B) a four person household\ncontaining two adults (one of whom is in full-time employment) and two children\nwith a metered supply, (C) a retired couple with a metered supply, and (D) an\nunmetered version of household B.\nEach household is assumed to possess a six litre WC, a 120 litre bath a 12 l\/min\nshower, a 10 l\/min kitchen tap, a 5 l\/min basin tap, a 50 litre \/ cycle washing machine\nand 20 litre \/ cycle dishwasher. By applying appropriate usage frequencies the weekly\nconsumption figures for households A-D are 1.2, 3.5, 2.4, and 3.5 m3\/week\nrespectively.\nFor the purposes of this illustration, the following tariffs have been applied in the first\nyear:\nA1 A flat rate of £340 a year\nB1 A flat metered rate of £2.50\/m3\nC1 Initial rate of £1.0 per m3 for up to 20m3, second rate of £2.0 per m3 over 20m3\nD1 Initial rate of £1.0 per m3 for up to 20m3, second rate of £2.0 per m3 from 20\nto 50m3, third rate of £3.0 from 50 to 100m3, forth rate of £5.0 over 100m3\nAfter a base year to determine their allocation, the households adopt different\napproaches to the imposed allocations. The single man gives up using the bath, the\nfamily invest in replacement shower head and low flow basin taps, but the retired\ncouple change nothing. As the allocation is always less than the ‘business as usual’\nsituation trading should be required.\n19\nThe first two households obtain a surplus of water units (say m3), but the third has a\ndeficit. Although the retired couple could ignore the deficit and not trade, they would\nbe hit with a fine for exceeding their allocation. The fine is high enough to encourage\ntrading at a lower cost.\nTable 4. Comparison of costs and scenarios over two years of trading\nHousehold\nA B C D\nConsumption in Year 1 (m3) 56 164 112 164\nConsumption in Year 2 (m3) 52 156 124.8 156\nTrading benefits (£) 0 0 0 0\nFines (£) 0 0 0 0\nYr 1 trading costs\nExpenditure on appliances (£) 0 0 0 0\nTrading benefits (£) 40.00 80.00 -128.00 400.00\nFines (£) 0 0 234.80 0\nYr 2 trading costs\nExpenditure on appliances (£) 0 180.00 0 0\nTariff A 1 (£) 340.00 340.00 340.00 340.00\nTariff B 1 (£) 140.00 410.00 280.00 340.00\nTariff C1 (£) 92.00 308.00 204.00 340.00\nYr 1 tariffs\nTariff D1 (£) 98.00 550.00 290.00 340.00\nTariff A2 (£) 340.00 340.00 340.00 340.00\nTariff B2 (£) 130.00 390.00 312.00 340.00\nTariff C2 (£) 84.00 292.00 229.60 340.00\nYr 2 tariffs\nTariff D2 (£) 86.00 510.00 354.00 340.00\nTable 4 shows that in the first year benchmarks are in effect set for subsequent years.\nOnly in the second year does the impact of trading start to emphasise the need to\nchange lifestyles. The tariff structures will impact the overall costs to the consumers,\nbut careful structuring of the metered customers can take place to ensure that financial\nincentives continue to drive efficient water use. Once, most customers have had\n20\nmeters installed, the need for trading, in the format proposed, will reduce. However,\nwithout water trading, it might be difficult to encourage such a take-up of meters.\n6 Discussion and Conclusions\nThe proposed DWTS is not perfect; it has weaknesses, but also considerable\nstrengths. When compared to other trading schemes, the main conceptual weakness is\nthe established market for water. Unlike carbon, where a new market was needed,\npeople are already paying for water. The main practical weakness is that it is, as a\nwhole, unproven. A gateway may be needed, as in DTQs, to enable trading with other\nmarkets such as personal carbon and EU ETS.\nQuestions such as: ‘who should be responsible for cap setting and organising\ntrading?’, and ‘what are the operating overheads?’, do not have clear answers. The\nallocator of responsibilities would normally be the Regulator, on a national basis, or a\nregional authority on a regional basis. Although the cap could be seasonally varied, it\nis far simpler to have an annual cap to enable planning to take place. As with all\ncharges, there will be appeal procedures put in place. If the customer did not agree\nwith their allocation set within the region’s cap, they could appeal, but any increase in\nan individual’s allocation would need to be taken from other household’s allocations\nas the regional, or national, cap must not be exceeded. Water companies could operate\na scheme, but Ofwat or CCfW could also oversee or operate one. Other possible\noperators include: EA, local councils, or GLC in London. However, an independent\nrespected operator could be crucial to the success of a scheme by instilling confidence\nin investors and minimising time inconsistency problems27.\n21\nThe main strength is that the scheme provides incentives to all existing customers and\nsuch a scheme is needed to fulfil National and European legal requirements. Another\nimportant feature is that it can be basin or catchment limited. This would enable pilot\nschemes to be run with relatively low levels of commitment. Also, the basic structure\ncan be used to develop different schemes to provide appropriate incentives in a\nlocality and link with other issues such as planning and inter-catchment trading.\nSustainability is not just a concern of industry, but also the individual. To date,\nalthough individual carbon trading schemes have been proposed, it is only industrial\nschemes (such as EU ETS) that have been set-up and run. Hence, the main models for\nwater trading, or management of any other individually consumed resource, are\ncurrently mainly industrially based. The candidate trading schemes show that\nextensive involvement of all stakeholders is needed, if they are to succeed and the\ndifferent stakeholders have focussed viewpoints. Economists and environmentalists\ntend to dismiss political issues and advocate the implementation of pure theory, issues\nof competitiveness and security of supply are not considered significant enough to\ndeviate from the fundamental principles. However, Governments tend to complicate\nschemes; they address issues of fairness and competitiveness whilst also considering\nthe economic and political impacts of environmental issues. Such conflicts of interests\nand outlook would occur in a DWTS, but with some different players. Within the\nstakeholders for a DWTS will be the key gatekeepers that can enable such a scheme\nto be developed28.\n22\nThe scheme needs to be financially viable and cost effective for both the consumers\nand the suppliers. Water Companies need to maintain profitability and realise\nmeasurably reduced consumption. Also, the Regulator needs to be convinced that the\nscheme is beneficial, fair to both consumers and water companies, legal, and that no\nother better alternative is available.\nAs with any scheme there will be winners and losers, but potentially, everyone could\nwin. Water companies could minimise expenditure on expanding supplies and meet\ntheir legal obligations. Customers could reduce their consumption and hence their\nbills. However, there could be degrees of winning. Metered customers with smart\nmeters have the potential to win the most – if they can continually reduce their\nconsumption. However, the same customers could lose significantly if they increase\ntheir consumption. So, the power to be a winner or loser is in the hands of the\ncustomer.\nFor the water companies, they may win whatever the customer does. Profligate\nconsumers will contribute more through higher charges; economising consumers will\nrequire less supply. Even if more people economise than expected, the Water\nCompany could, in theory – if permitted by the Regulator, just increase prices and\ncharges to maintain an appropriate return. Regulators could cap charges to impose\nfinancial penalties on companies that have not met previous targets and requirements.\nRegulators could also set the allowance limits for householders, the trading unit\nvalues and the conditions.\n23\nThere are legislative needs for a mechanism to incentivise domestic water users in the\nUK to save water and the DWTS scheme outlined above could help enable the UK\nachieve the 2015 target for the Water Framework Directive. Due to the lack of\nuniversal metering a scheme is required that does not rely upon meters, but will\nencourage un-metered householders to become metered. DWTS provides incentives\nand paves the way for a more justifiable water charging structure. The building blocks\nneeded to instigate a DWTS in the UK are generally available.\nAcknowledgment and note\nThanks to the Construction Sector Unit of the Department of Trade and Industry for\ntheir sponsorship. The views expressed in this paper are not necessarily those of BRE.\nReferences\n1 TSO, Water Act 2003, 81 Duty to encourage water conservation, The\nStationery Office Limited, 2003\n2 COUNCIL OF THE EUROPEAN COMMUNITIES, Directive 2000\/60\/EC of\nthe European Parliament and of the Council of 23 October 2000 establishing a\nframework for Community action in the field of water policy. Official Journal of the\nEuropean Communities L327 43 1-72, 2000\n3 BENNETT, J. What value the rural environment?, Policy, 2002, 14, No 4, 44-\n48\n24\n4 OFWAT, Water and Sewerage Bills 2005 2006, Office of water services, 2006\n5 DRESNER, S. & EKINS, P. The social impacts of environmental taxes:\nremoving regressivity – Towards the design of an environmentally and socially\nconscious water metering tariff, PSI research discussion paper 21, Policy Studies\nInstitute, 2004\n6 UNEP, Freshwater in Europe- facts, figures and maps, An Environmental\nAtlas, United Nations environment programme, page 11. Switzerland, 2004\n7 DTI, The Energy Challenge, Energy Review report, The Stationary Office,\npage 12. July 2006.\n8 BROWN, C, Soapboxing – Parts of England get less rain than Istanbul, but\nwe’re using more and more water every year… The real trick in cutting consumption\nis to create a market in water savings, Green Futures, page 25, July\/August 2005\n9 DEFRA, EU Emissions Trading Scheme – Consultation on the Phase 2 UK\nDraft National Allocation Plan, March 2006\n25\n10 DALES, J. H., Pollution, property and prices: an essay in policy making and\neconomics, University of Toronto Press, Toronto, 1968.\n11 CROCKER, T. D. The Structuring of Atmospheric Pollution Control Systems.\nIn Wolozin, H. (Ed) The Economics of Air Pollution, New York, W.Norton & Co,\n1996.\n12 NCEE, International experiences with economic incentives for protecting the\nenvironment, p27-31, National center for environmental economics, US\nEnvironmental Protection Agency, 2004\n13 TERPSTRA, P.M.J., Sustainable water usage systems: models for the\nsustainable utilization of domestic water in urban areas, Water Science Technology,\n39, No 5, 65-72, 1999\n14 DRDNI, Draft Water and Sewerage Services (Northern Ireland) Order,\nDepartment for regional development Northern Ireland, 2006\n15 DEFRA, Explanatory memorandum to The Water Industry (Charges)\n(Vulnerable Groups) (Amendment) Regulations 2005 N0.59, 2005\n16 TUMUAKI O TE MANA AROTAKE, HORIZONS AND OTAGO\nREGIONAL COUNCILS: Management of freshwater resources, Report of the\nController and Auditor-General, p 83, May 2005\n26\n17 STIGLITZ, J., Interests, incentives and institutions, Policy, The centre for\nindependent studies, Australia, Spring 1998\n18 FLEMING, D., Paper 11 – Tradable Quotas: Setting Limits to Carbon\nEmissions, The Lean Economy Initiative, London, 1997\n19 STARKEY R. & ANDERSON, K., Domestic tradable quotas: A policy\ninstrument for reducing greenhouse gas emissions from energy use, Technical Report\n39, Tyndall centre for climate change research, 2005\n20 DEFRA, Speech by the Rt Hon David Miliband MP –‘The great stink:\ntowards an environmental contract’ at the Audit Commission annual lecture,\nWednesday 19 July 2006\n21 STARKEY R. & ANDERSON, K., Domestic tradable quotas: A policy\ninstrument for reducing greenhouse gas emissions from energy use, Technical Report\n39, P 35-36, Tyndall centre for climate change research, 2005\n22 WSGM, Water metering: Present position and legislation – WSGM 01 \/ 04,\nWater Saving Group Metering Sub-Group, 2005\n23 GREEN VENTURE \/ CITY OF HAMILTON, A guide to Wise Water Use,\nOntario Canada, 1995\n27\n24 BICKEL, P. & FRIEDRICH, R. ExternE – Externalities of energy –\nMethodology 2005 update, Directorate-General for research sustainable energy\nsystems, EUR 21951, European Commission, 2005\n25 CARBON TRUST, It doesn’t take much energy to get a tax break -\nUnderstanding the benefits of the Enhanced Capital Allowance - Scheme for Energy-\nSaving Investments, Carbon Trust, March 2005\n26 OFWAT, Security of supply, leakage and the efficient use of water: 2004-05\nreport, p 49, December 2005, Cited in House of Lords, Water Management Volume 1:\nReport, 8th report of session 2005-06, Science and Technology Committee, HL Paper\n191-1, 6th June 2006\n27 HELM, D.R. HEPBURN, C. & MASH, R., Time-inconsistent environmental\npolicy and optimal delegation, Department of Economics Discussion Paper Series,\nNumber 175, Oxford University, 2003\n28 LEVINA, E. & ADAMS, H. Domestic policy frameworks for adaptation to\nclimate change in the water sector – Part 1: Annex 1 countries, p 26-28, Organisation\nfor economic co-operation and development and the International Energy Agency,\n2006\n28\nFigures\nFigure 1 Basic structure of a proposed DWTS Figure 1.\n29\nFigure 2 Detailed structure of a proposed DWTS Figure 2\n"}