{"doi":"10.1103\/PhysRevA.78.063401","coreId":"15513","oai":"oai:dro.dur.ac.uk.OAI2:7056","identifiers":["oai:dro.dur.ac.uk.OAI2:7056","10.1103\/PhysRevA.78.063401"],"title":"Power-law behavior in the quantum-resonant evolution of the delta-kicked accelerator.","authors":["Halkyard,  P. L.","Saunders,  M.","Gardiner,  S. A.","Challis,  K. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-12-01","abstract":"We consider the atom-optical delta-kicked accelerator when the initial momentum distribution is symmetric. We demonstrate the existence of quantum-resonant dynamics, and derive analytic expressions for the system evolution. In particular, we consider the dynamical evolution of the momentum moments and find that all even-ordered momentum moments exhibit a power-law growth. In the ultracold (zero-temperature) limit the exponent is determined by the order of the moment, whereas for a broad, thermal initial momentum distribution the exponent is reduced by 1. To demonstrate the power-law behavior explicitly we consider the evolutions of the second- and fourth-order momentum moments, and cumulants, for an initially Gaussian momentum distribution corresponding to the Maxwell-Boltzmann distribution of an ideal gas at thermal equilibrium","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15513.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7056\/1\/7056.pdf","pdfHashValue":"b9af14e6e59e14fc0fa633e7807ed64f4d5afc79","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7056<\/identifier><datestamp>\n      2010-12-08T09:57:59Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Power-law behavior in the quantum-resonant evolution of the delta-kicked accelerator.<\/dc:title><dc:creator>\n        Halkyard,  P. L.<\/dc:creator><dc:creator>\n        Saunders,  M.<\/dc:creator><dc:creator>\n        Gardiner,  S. A.<\/dc:creator><dc:creator>\n        Challis,  K. J.<\/dc:creator><dc:description>\n        We consider the atom-optical delta-kicked accelerator when the initial momentum distribution is symmetric. We demonstrate the existence of quantum-resonant dynamics, and derive analytic expressions for the system evolution. In particular, we consider the dynamical evolution of the momentum moments and find that all even-ordered momentum moments exhibit a power-law growth. In the ultracold (zero-temperature) limit the exponent is determined by the order of the moment, whereas for a broad, thermal initial momentum distribution the exponent is reduced by 1. To demonstrate the power-law behavior explicitly we consider the evolutions of the second- and fourth-order momentum moments, and cumulants, for an initially Gaussian momentum distribution corresponding to the Maxwell-Boltzmann distribution of an ideal gas at thermal equilibrium.<\/dc:description><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review A, 2008, Vol.78(6), pp.063401  [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2008-12-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7056<\/dc:identifier><dc:identifier>\n        issn:1050-2947<\/dc:identifier><dc:identifier>\n        issn: 1094-1622<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevA.78.063401<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7056\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevA.78.063401<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7056\/1\/7056.pdf<\/dc:identifier><dc:rights>\n        © 2008 by The American Physical Society. All rights reserved.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1050-2947"," 1094-1622","1050-2947","issn: 1094-1622"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n01 July 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nHalkyard, P. L. and Saunders, M. and Gardiner, S. A. and Challis, K. J. (2008) ’Power-law behavior in the\nquantum-resonant evolution of the delta-kicked accelerator.’, Physical review A., 78 (6). 063401 .\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevA.78.063401\nPublisher’s copyright statement:\n2008 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nPower-law behavior in the quantum-resonant evolution of the \u0001-kicked accelerator\nP. L. Halkyard, M. Saunders, and S. A. Gardiner\nDepartment of Physics, Durham University, Rochester Building, South Road, Durham DH1 3LE, United Kingdom\nK. J. Challis\nLundbeck Foundation Theoretical Center for Quantum System Research, Department of Physics and Astronomy,\nUniversity of Aarhus, DK-8000 Århus C, Denmark\n\u0001Received 16 July 2008; revised manuscript received 16 September 2008; published 1 December 2008\u0002\nWe consider the atom-optical \u0001-kicked accelerator when the initial momentum distribution is symmetric. We\ndemonstrate the existence of quantum-resonant dynamics, and derive analytic expressions for the system\nevolution. In particular, we consider the dynamical evolution of the momentum moments and find that all\neven-ordered momentum moments exhibit a power-law growth. In the ultracold \u0001zero-temperature\u0002 limit the\nexponent is determined by the order of the moment, whereas for a broad, thermal initial momentum distribu-\ntion the exponent is reduced by 1. To demonstrate the power-law behavior explicitly we consider the evolutions\nof the second- and fourth-order momentum moments, and cumulants, for an initially Gaussian momentum\ndistribution corresponding to the Maxwell-Boltzmann distribution of an ideal gas at thermal equilibrium.\nDOI: 10.1103\/PhysRevA.78.063401 PACS number\u0001s\u0002: 37.10.Vz, 03.75.Be, 05.45.Mt\nI. INTRODUCTION\nQuantum resonances and antiresonances \u00031–20\u0004 are strik-\ning signatures of ordered quantum manifestations in the\n\u0001-kicked rotor, a paradigm system in the study of classical\n\u000321\u0004 and quantum chaotic dynamics \u000322–24\u0004. The atom-\noptical realization of the \u0001-kicked rotor \u0001more accurately de-\nnoted the \u0001-kicked particle\u0002 has in recent years proved to be\na fertile testing ground for quantum-chaotic phenomena\n\u000314–19,25–43\u0004. An important variant is the \u0001-kicked accel-\nerator, where the kicking potential is aligned parallel to the\nlocal gravitational acceleration \u000344–55\u0004. This gives rise to\nphenomena closely related to quantum resonances, for ex-\nample quantum accelerator modes, and fractional quantum\nresonances \u000356\u0004. Such atom-optical realizations involve sub-\njecting a cold, dilute atomic gas to a periodically pulsed laser\nstanding wave. The amplitude, phase, periodicity, and dura-\ntion of the pulses can be controlled to a high degree of pre-\ncision, allowing theoretical predictions to be thoroughly in-\nvestigated.\nIn this paper we investigate the quantum-resonant behav-\nior \u00035–19\u0004 of laser-driven clouds of freely falling, laser-\ncooled atoms. Such a system closely models the \u0001-kicked\naccelerator, of which the \u0001-kicked particle is a particular\ncase. Experimentally, the system dynamics are typically in-\nterrogated by measuring the atomic center-of mass momen-\ntum distribution, using a time-of-flight technique \u000346\u0004. Al-\nthough there are practical resolution limits, it is then in\nprinciple possible to determine all momentum moments from\nthe measured distribution. A limited number of moments is\nfrequently sufficient to characterize the system: the second-\norder momentum moment provides a clear signature to dis-\ntinguish between quantum-resonant dynamics and dynamical\nlocalization in the \u0001-kicked particle \u000357\u0004, whereas the fourth-\norder moment is necessary to distinguish between different\nfractional quantum resonances in the \u0001-kicked accelerator at\nfinite temperature \u000356\u0004. The momentum moments therefore\nprovide conceptually simple measures to characterize the ef-\nfect of quantum resonant dynamics on the atomic center-of-\nmass momentum distribution. The main focus of this paper is\nto provide fully analytical predictions of the momentum-\nmoment dynamics of the atom-optical \u0001-kicked accelerator\nunder certain physically motivated conditions. We present\ndetailed derivations of the key analytical results utilized in\nSaunders et al. \u000356,57\u0004.\nAssuming only that the initial momentum distribution is\nsymmetric, we find that the time evolution of all even-\nmomentum moments follows power-law behaviors, and ex-\namine how such behavior differs between the opposing limits\nof the initial distribution being either extremely narrow or\nbroad. Assuming the Maxwell-Boltzmann distribution for an\nideal gas, we determine explicit analytic expressions for the\ntime evolution of the second- and fourth-order momentum\nmoments when the gas is initially in an ultracold limit, or at\nfinite temperature. We also outline a procedure for calculat-\ning higher-order momentum moments for a given \u0001but arbi-\ntrary\u0002 initial momentum distribution. Although we neglect\ntwo-body interactions, we note that our model can also be\nused to describe Bose-Einstein condensates where the scat-\ntering length has been made negligibly small by tuning\naround a Feshbach resonance \u000358–61\u0004.\nThe paper is organized as follows. In Sec. II we sketch\nour theoretical model for the atom-optical \u0001-kicked accelera-\ntor, derive the time evolution operator from which the time\nevolution of the momentum moments can be determined, and\nderive general conditions for which antiresonance and reso-\nnance occur. In Sec. III we consider only momentum distri-\nbutions that are initially symmetric, and discuss the power-\nlaw behavior of the evolution of the even-ordered\nmomentum moments in the two limits of narrow and broad\ninitial momentum distributions. In Sec. IV we consider the\ntime evolution of the second- and fourth-order momentum\nmoments and cumulants for momentum distributions that are\ninitially Gaussian, that is, corresponding to a finite-\ntemperature ideal gas. Section V consists of the conclusions,\nwhich are then followed by five technical appendixes.\nPHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n1050-2947\/2008\/78\u00016\u0002\/063401\u000115\u0002 ©2008 The American Physical Society063401-1\nII. ATOM-OPTICAL \u0001-KICKED ACCELERATOR\nA. System Hamiltonian\nWe consider a cloud of trapped and laser-cooled alkali-\nmetal atoms. The cloud is released from the trap and ad-\ndressed by an appropriate configuration of off-resonant laser\nbeams forming a vertically aligned, pulsed, sinusoidal poten-\ntial. We neglect atomic interactions and treat the cloud as an\nensemble of single-particle systems with Hamiltonian\n\u000346,56\u0004\nHˆ =\npˆ2\n2M\n+ Mazˆ −\n\u0002\u0003R\n2\n8\u0004\ncos\u0001Kzˆ\u0002f\u0001t\u0002 . \u00011\u0002\nHere pˆ and zˆ are the center-of-mass momentum and position\noperators, \u0003R is the Rabi frequency, K \/2 is the magnitude of\nthe laser wavevector along the z direction, M is the mass, \u0004\nis the detuning, and f\u0001t\u0002 describes the periodic pulses. The\nparameter a is the relative acceleration between the atomic\ncloud and the optical standing-wave potential and is in gen-\neral given by a\u0005g−a\u0005, where g is the local gravitational\nacceleration and a\u0005 can be chosen with high precision by\ntuning the relative phase of the laser beams creating the op-\ntical field \u000356\u0004. When a is set to zero, we recover the atom-\noptical \u0001-kicked rotor \u000357\u0004.\nWe assume the pulse duration to be sufficiently short for\nthe atoms to be in the Raman-Nath regime, i.e., the displace-\nment of the atoms during the pulse is significantly less than\nthe wavelength of the standing wave. Hence, to a good ap-\nproximation, the pulses may be modeled as a train of \u0001 func-\ntions \u000357\u0004 giving the quantum \u0001-kicked accelerator Hamil-\ntonian \u000346\u0004\nHˆ \u0001ka =\npˆ2\n2M\n+ Mazˆ − \u0002\u0005d cos\u0001Kzˆ\u0002\u0006\nn=0\n\u0006\n\u0001\u0001t − nT\u0002 , \u00012\u0002\nwhere \u0005d\u0005\u0003R\n2 tp \/8\u0004, tp is the pulse duration, and T is the\npulse periodicity. For convenience we apply the unitary op-\nerator Uˆ =exp\u0001iMazˆ \/\u0002\u0002 \u000352–54\u0004, to transform Hamiltonian\n\u00012\u0002 to the spatially periodic form\nH˜ \u0001ka =\n\u0001pˆ − Mat\u00022\n2M\n− \u0002\u0005d cos\u0001Kzˆ\u0002\u0006\nn=0\n\u0006\n\u0001\u0001t − nT\u0002 , \u00013\u0002\nfor which we can invoke Bloch theory \u000357,62\u0004.\nB. Time evolution\n1. Transformed Floquet operator\nThe \u0001-kicked accelerator Hamiltonian \u00012\u0002 is periodic in\ntime, and the system evolution can be described in terms of a\nFloquet \u0001kick-to-kick time evolution\u0002 operator. The trans-\nformed Floquet operator corresponding to the transformed\nHamiltonian \u00013\u0002 is exp\u0003−iMa2T3\u00013n2−3n+1\u0002 \/6\u0002\u0004F˜n \u000354,56\u0004,\nwhere\nF˜n = e−i\u0003\u0002K\n2\u0001kˆ + \u0007ˆ \u00022T\/2M−Ka\u0001kˆ+\u0007ˆ \u0002\u00012n−1\u0002T2\/2\u0004ei\u0005d cos\u0001\b\nˆ \u0002\n, \u00014\u0002\ni.e., we absorb a global phase into the definition of F˜n.1 We\nhave separated the momentum and position operators into\ndiscrete and continuous components \u000354\u0004:\nzˆ = K−1\u00012\tlˆ + \bˆ \u0002, pˆ = \u0002K\u0001kˆ + \u0007ˆ \u0002 , \u00015\u0002\nwhere the eigenvalues of lˆ and kˆ are integers, and the eigen-\nvalues of \bˆ and \u0007ˆ are \b\u0001 \u0003−\t ,\t\u0002 and \u0007\u0001 \u0003−1 \/2,1 \/2\u0002.\nBecause the Hamiltonian \u00013\u0002 is periodic in space, the qua-\nsimomentum \u0007 is conserved \u000352,53\u0004, i.e., \u0007ˆ commutes with\nH˜ \u0001ka \u000354\u0004 and only momentum eigenstates with eigenvalues\ndiffering by integer multiples of \u0002K are coupled \u000346\u0004. There-\nfore, within a particular quasimomentum subspace, the dy-\nnamics are determined by\nF˜n\u0001\u0007\u0002 = e−i\u0003\u0002K\n2\u0001kˆ + \u0007\u00022T\/2M−Ka\u0001kˆ+\u0007\u0002\u00012n−1\u0002T2\/2\u0004ei\u0005d cos\u0001\b\nˆ \u0002\n. \u00016\u0002\nAs is the case for the \u0001-kicked rotor or particle, quantum\nresonances or antiresonances occur when T=\u0001TT \/2 \u000357\u0004,\nwhere TT=4\tM \/\u0002K2 is the Talbot time \u000345\u0004 \u0001so named in\nanalogy with the Talbot effect in optics \u000363\u0004\u0002. In this case,\nEq. \u00016\u0002 becomes\nF˜n\u0001\u0007\u0002 = e−i\t\u0007\u0003\u0007\u0001−\u0003\u00012n−1\u0002\u0004e−i\t\u0003\u0001−\u0003\u00012n−1\u0002+2\u0001\u0007\u0004k\nˆ\nei\u0005d cos\u0001\b\nˆ \u0002\n, \u00017\u0002\nwhere we have used exp\u0001−i\u0001\tkˆ2\u0002=exp\u0001−i\u0001\tkˆ\u0002, and intro-\nduced the dimensionless effective gravitational acceleration\n\u0003=KaT2 \/2\t \u000350\u0004.\n2. Time evolution of the momentum moments\nThe time evolution of a general momentum eigenstate \u0007k\n+\u0007\b can be derived by consecutively applying the trans-\nformed Floquet operator \u00017\u0002, the details of which are given in\nAppendix A \u0003See Eqs. \u0001A15\u0002 and \u0001A19\u0002\u0004. We deduce that\n\u0007\n\u0001t = nT\u0002\b = F˜n\u0001\u0007\u0002F˜n−1\u0001\u0007\u0002 ¯ F˜ 1\u0001\u0007\u0002\u0007k + \u0007\b\n= \u0006\nj=−\u0006\n\u0006\nJj−k\u0001\u000b\u0002ei\u0001j−k\u0002\fe−i\tn\rke−in\n2\t\u0001k+\u0007\u0002\u0003e−in\t\u0007\n2\u0001\u0007j + \u0007\b ,\n\u00018\u0002\nwhere \u000b and \f are defined in Eqs. \u0001A16\u0002 and \u0001A17\u0002, and2\n\r = \u00011 + 2\u0007\u0002\u0001 . \u00019\u0002\nDefining the dimensionless momentum Pˆ \u0005kˆ +\u0007ˆ \u0005 pˆ \/\u0002K,\nit follows straightforwardly from Eq. \u00018\u0002 that the mth-order\nmomentum moment of the evolved state is\n\tPˆ m\bn = \u0006\nj=−\u0006\n\u0006\nJj−k\n2 \u0001\u0005d\u000e\u0002\u0001j + \u0007\u0002m, \u000110\u0002\nwhere \u000e\u0005\u0007\u000b\u0007 \/\u0005d= \u0007\u000f˜\u0007, with\n1The global phase is corrected slightly from that given previously\n\u000346\u0004.\n2The parameter \r is related to \u0010 \u000356,57\u0004 by \u0010=\r\t \/2.\nHALKYARD et al. PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-2\n\u000f˜ = \u0006\nj=0\nn−1\nei\t\u0001\rj−\u0003j\n2\u0002\n. \u000111\u0002\nWe note that Eq. \u000111\u0002 has the form of a Gauss sum, and that\nGauss sums have applications in number theory and various\nareas of theoretical physics \u000364–67\u0004.\nBy extension, the evolution of the moments for an initial\nstatistical mixture of momentum eigenstates, with distribu-\ntion Dk\u0001\u0007\u0002, is described by \u000356,57\u0004\n\tPˆ m\bn = \n\n−1\/2\n1\/2\nd\u0007 \u0006\nj,k=−\u0006\n\u0006\nJj−k\n2 \u0001\u0005d\u000e\u0002\u0001j + \u0007\u0002mDk\u0001\u0007\u0002 . \u000112\u0002\nC. Existence of resonances and antiresonances\n1. Manifestation of resonances in \u0002\nQuantum resonances are characterized by unbounded\ngrowth in the system energy, and we see that this is due to\nthe constructive inteference of oscillatory terms in Eq. \u000111\u0002.\nThey occur in the \u0001-kicked rotor or particle when \u0005d\u000e in Eq.\n\u00018\u0002 can be replaced by \u0005dn \u000357\u0004. To achieve such resonant\ngrowth in \u000e, the oscillatory terms contained within the sum\nin Eq. \u000111\u0002 must add in phase. It follows that the summand of\n\u000f˜ must be periodic with respect to the counting index j. The\nperiod Q \u0001if present\u0002 is determined from\nei\t\u0003\r\u0001j+Q\u0002−\u0003\u0001j\n2+2jQ+Q2\u0002\u0004\n= ei\t\u0001\rj−\u0003j\n2\u0002\n, \u000113\u0002\nimplying that\n\rQ − 2j\u0003Q −\u0003Q2 = 2A \u000114\u0002\nmust be satisfied, where A is an arbitrary integer.\nThe period Q should be independent of the counting index\nj, and so \u0003Q must be integer. Hence, \u0003 is rational, and if we\nset \u0003=r \/s \u0001r and s are integers with no common factors\u0002, it\nfollows that the smallest possible value for Q is s. With this\ninformation we deduce a simpler condition from Eq. \u000113\u0002:\ns\u0001\r − r\u0002 = 2A . \u000115\u0002\nElimination of \r using Eq. \u00019\u0002 gives\n\u0007 =\n2A + s\u0001r − \u0001\u0002\n2\u0001s\n, \u000116\u0002\nindicating the quasimomentum values, subject to \u0007\n\u0001 \u0001−1 \/2,1 \/2\u0004, for which quantum resonances occur.\n2. Manifestation of antiresonances in \u0002\nAn antiresonance, in the strictest sense, is when the state\nperiodically cycles back to its initial condition \u000357\u0004. This can\nonly occur when \u0005d\u000e is periodic in n, implying that\nexp\u0003i\t\u0001\rj−\u0003j2\u0002\u0004 should be oscillatory, i.e.,\nei\t\u0003\r\u0001j+Q\u0002−\u0003\u0001j\n2+2jQ+Q2\u0002\u0004\n= − ei\t\u0001\rj−\u0003j\n2\u0002\n= ei\t\u0001\rj−\u0003j\n2+1\u0002\n.\n\u000117\u0002\nProceeding along similar lines as for the resonant case \u0001see\nSec. II C 1\u0002 this implies that Q=s, and that\ns\u0001\r − r\u0002 = 2A + 1, \u000118\u0002\nwhere A is an arbitrary integer. Condition \u000118\u0002 ensures that\n\u000e=0 when n is an even multiple of s.\nFor a given value of \u0003=r \/s, higher-order antiresonances\nalso exist for different values of \u0007 \u000357\u0004. These are described\nby the condition\nei\t\u0003\r\u0001j+Q\u0002−\u0001r\/s\u0002\u0001j\n2+2jQ+Q2\u0002\u0004\n= ei\tNr\/Nsei\t\u0003\rj−\u0001r\/s\u0002j\n2\u0004\n⇒ ei\t\u0003\r\u0001j+NsQ\u0002−\u0001r\/s\u0002\u0001j\n2+2jNsQ+Ns\n2Q2\u0002\u0004\n= − ei\t\u0003\rj−\u0001r\/s\u0002j\n2\u0004\n. \u000119\u0002\nAs above, it follows that Q=s; hence, the revival period of\nthe initial state is 2Nss. Condition \u000119\u0002 implies a generaliza-\ntion of Eq. \u000118\u0002, i.e.,\ns\u0001\r − r\u0002 = 2A +\nNr\nNs\n. \u000120\u0002\nAntiresonances with revival periods 2Nss therefore occur for\nquasimomentum values \u0003subject to \u0007\u0001 \u0001−1 \/2,1 \/2\u0002\u0004\n\u0007 =\n2A + Nr\/Ns + s\u0001r − \u0001\u0002\n2\u0001s\n. \u000121\u0002\nHow both resonances and antiresonances are manifest in\n\u000e, and their dependence on \u0003 and \u0007, is illustrated in Fig. 1.\nThis demonstrates that the resonances are dense in the pa-\nFIG. 1. \u0001Color online\u0002 Parameter \u000e as a function of \u0003 and \u0007 for\n\u0001=2 at \u0001a\u0002 15 kicks \u0001b\u0002 30 kicks, and \u0001c\u0002 60 kicks. An antiresonance\nof order 2Ns, with \u0003=r \/s, will initially mimic exactly resonant\ngrowth for Nss kicks. The diminishing finite size of the resonances\nin \u0001a\u0002–\u0001c\u0002 is due to nearby high-order antiresonances which become\napparent as n increases. Panel \u0001d\u0002 shows the location of those reso-\nnances \u0001see Eq. \u000116\u0002\u0002 for \u0003=1 \/s, where s=1,2 , . . . ,20. The reso-\nnances become infinite in number as \u0003→0, but for \u0003=0 there are\nonly three resonances. Units are dimensionless.\nPOWER-LAW BEHAVIOR IN THE QUANTUM-RESONANT… PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-3\nrameter space, but diminish in strength for increasing s. Fur-\nthermore, resonances become more sharply defined for in-\ncreasing n as nearby high-order antiresonances become more\nimportant.\nIII. TIME EVOLUTION OF THE MOMENTUM MOMENTS\nA. General symmetric momentum distributions\n1. Physical motivation\nIn the atom-optical kicked systems under consideration,\nthe atomic gas is initially held in a harmonic trapping poten-\ntial. The ground state of the system is therefore spatially\nsymmetric, both in the presence and absence of significant\ninteratomic interactions. We consider the momentum mo-\nment dynamics for the case of symmetric initial momentum\ndistributions D\u0001P\u0002, such that D\u0001P\u0002=D\u0001−P\u0002. In particular, we\nprovide a detailed analytic investigation of the second- and\nfourth-order momentum moments. These moments are most\nrelevant as signatures of dynamics in the atom optical\n\u0001-kicked particle \u000357\u0004 and accelerator \u000356\u0004. The second-order\nmomentum moment \u0003m=2 in Eq. \u000112\u0002\u0004 is proportional to the\nmean kinetic energy, and the fourth-order moment contains\ninformation about the degree to which the distribution is\npeaked.\n2. Consequences of symmetry\nWe consider the initial state to be an incoherent ensemble\nof momentum eigenstates, i.e., the momentum representation\nof the density operator is diagonal. For a symmetric initial\nmomentum distribution, the initial population of state \u0007−k\n−\u0007\b is always equal to the initial population of state \u0007k+\u0007\b.\nUsing Eq. \u000110\u0002, and explicitly stating the \u0007 dependence of\n\u000e\u0001\u0007\u0002, for an initial state \u0007−k−\u0007\b the momentum moments\nevolve as\n\tPˆ m\bn = \u0001− 1\u0002m \u0006\nj=−\u0006\n\u0006\nJj−k\n2 „\u0005d\u000e\u0001− \u0007\u0002…\u0001j + \u0007\u0002m, \u000122\u0002\nwhere we have relabeled the summation \u0001setting j to −j\u0002 and\nused that J\n−j\u0001x\u0002= \u0001−1\u0002 jJj\u0001x\u0002 \u000368\u0004.\nComparing Eqs. \u000122\u0002 and \u000110\u0002, we see that when\n\u000e\u0001−\u0007\u0002=\u000e\u0001\u0007\u0002, it follows that \tPˆ 2m+1\bn for an initial state\n\u0007−k−\u0007\b is equal to −\tPˆ 2m+1\bn for an initial state \u0007k+\u0007\b. The\nmomentum moment for a statistical mixture is the normal-\nized sum of the moments of the individual component states.\nConsequently, for initially symmetric momentum distribu-\ntions, the odd moments are identically zero whenever \u000e\u0001\u0007\u0002 is\nin general equal to \u000e\u0001−\u0007\u0002, i.e., for all values of the quasimo-\nmentum \u0007.\n3. Invariance of \u0002\nThe invariance of \u000e\u0001\u0007\u0002 upon changing \u0007 to −\u0007 is a useful\nproperty which is often satisfied. In particular, for rational\n\u0003=r \/s it is valid at resonance \u0003see Eq. \u000115\u0002\u0004 when n is a\nmultiple of s, and at antiresonance when s is an even mul-\ntiple of s. Here we derive these results.\nTo begin we write Eq. \u000111\u0002, changing the summation in-\ndex j to n− j, i.e.,\n\u000f˜n+1\u0001\u0007\u0002 = \u0006\nj=0\nn\nei\t\u0003\u00011+2\u0007\u0002\u0001\u0001n−j\u0002−\u0001r\/s\u0002\u0001n\n2\n−2nj+j2\u0002\u0004\n= ei\t\u00011+2\u0007\u0002\u0001n−\u0001r\/s\u0002n\n2\u0006\nj=0\nn\nei\t\u0003−\u00011+2\u0007\u0002\u0001j+2\u0001r\/s\u0002nj−\u0001r\/s\u0002j\n2\u0004\n,\n\u000123\u0002\nwhere now we use Eq. \u000123\u0002 to describe the \u0001n+1\u0002th kick.\nNoting that ei\t\u0001j =e−i\t\u0001j and taking n to be a multiple of s\n\u0001i.e., n=\u0011s\u0002, we obtain\n\u000f˜\u0011s+1\u0001\u0007\u0002 = ei\t\u00011+2\u0007\u0002\u0001s\u0011−rs\u0011\n2\u0006\nj=0\n\u0011s\nei\t\u0003\u00011−2\u0007\u0002\u0001j−\u0001r\/s\u0002j\n2\u0004\n. \u000124\u0002\nHence, as \u000e\u0011s+1\u0001\u0007\u0002\u0005\u0007\u000f˜\u0011s+1\u0001\u0007\u0002\u0007, it follows that \u000e\u0011s+1\u0001\u0007\u0002\n=\u000e\u0011s+1\u0001−\u0007\u0002 in general, whenever \u0003=r \/s. If the initial mo-\nmentum distribution is symmetric, all odd moments will be\nzero at these times; for integer \u0003, this means the odd mo-\nments will always be zero.\nIf n=\u0011s−1, we deduce from Eqs. \u000123\u0002 and \u000124\u0002 that\n\u000f˜\u0011s\u0001\u0007\u0002 = \u0006\nj=0\n\u0011s\nei\t\u0003\u00011+2\u0007\u0002\u0001j−\u0001r\/s\u0002j\n2\u0004\n− ei\t\u00011+2\u0007\u0002\u0001s\u0011−rs\u0011\n2\n= ei\t\u00011+2\u0007\u0002\u0001s\u0011−rs\u0011\n2\u000b\u0006\nj=0\n\u0011s\nei\t\u0003\u00011−2\u0007\u0002\u0001j−\u0001r\/s\u0002j\n2\u0004\n− 1\f .\n\u000125\u0002\nHence, it follows that \u000e\u0011s\u0001\u0007\u0002=\u000e\u0011s\u0001−\u0007\u0002 for the values of \u0007\nsatisfying \u00011+2\u0007\u0002\u0001s\u0011−rs\u00112=2A \u0001i.e., for \u0007 an even integer\u0002.\nThis condition is satisfied whenever Eq. \u000115\u0002 or Eq. \u000118\u0002 \u0001for\neven \u0011\u0002 holds, i.e., for values of \u0007 where resonances and\nantiresonances are supported.\nFinally, if the initial momentum distribution is symmetric,\nall odd momentum moments will be zero when n is a mul-\ntiple of s, for resonant evolution, and when n is an even\nmultiple of s, for antiresonant evolution. For this reason, we\nconsider only even momentum moments in the remainder of\nthis work.\n4. Time evolution of the even momentum moments\nThe time evolution of the even momentum moments is\ngiven by\n\tPˆ 2m\bn = \n\n−1\/2\n1\/2\nd\u0007 \u0006\nj,k=−\u0006\n\u0006\nJj\n2\u0001\u0005d\u000e\u0002\u0001j + k + \u0007\u00022mDk\u0001\u0007\u0002 ,\n\u000126\u0002\nwhere we have shifted the index j in Eq. \u000112\u0002 by k. Note that\n\u0003by Eq. \u000111\u0002\u0004 \u000e\u0001\u0007\u0002=\u000e\u0001k+\u0007\u0002. Making the change of variables\nP=k+\u0007 and binomially expanding \u0001j+ P\u00022m implies\nHALKYARD et al. PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-4\n\tPˆ 2m\bn = \n\n−\u0006\n\u0006\ndP D\u0001P\u0002 \u0006\nj=−\u0006\n\u0006\n\u0006\nh=0\nm \u000b2m2h \fJj2\u0001\u0005d\u000e\u0002j2hP2\u0001m−h\u0002,\n\u000127\u0002\nwhere D\u0001P\u0002=Dk\u0001\u0007\u0002 and we have eliminated odd powers of j,\nbecause they sum over j to give zero \u0003see Eq. \u0001B5\u0002\u0004. Using\nthe general form of the summation of Bessel functions over\neven powers of j \u0003see Eq. \u0001B7\u0002\u0004, we find that\n\tPˆ 2m\bn = \tPˆ 2m\b0 + \n\n−\u0006\n\u0006\ndP D\u0001P\u0002\u0006\nh=1\nm \u000b2m2h \fR2h\u0001\u0005d\u000e\u0002P2\u0001m−h\u0002,\n\u000128\u0002\nwhere R2h is a 2hth-degree even polynomial in \u0005d\u000e.\nConsidering the two simplest even momentum moments\n\u0003see Eq. \u0001B8\u0002\u0004, Eq. \u000128\u0002 for m=1 becomes\n\tPˆ 2\bn = \tP2\b0 +\n\u0005d\n2\n2 \n\n−\u0006\n\u0006\ndP D\u0001P\u0002\u000e2, \u000129\u0002\nand for m=2 becomes\n\tPˆ 4\bn = \tP4\b0 + \n\n−\u0006\n\u0006\ndP D\u0001P\u0002\u000b38\u0005d4\u000e4 + 12\u0005d2\u000e2 + 3P2\u0005d2\u000e2\f .\n\u000130\u0002\nB. Ultracold limit\n1. Time evolution of the moments at zero temperature\nWe consider the most trivial example of a symmetric ini-\ntial momentum distribution, i.e., we choose D\u0001P\u0002=\u0001\u0001P\u0002 such\nthat all the atoms are initially in the P=0 state. This de-\nscribes an ideal zero-temperature gas, which we refer to as\nthe ultracold limit. In this case \u0007=0; hence \r=\u0001, and the\nresonance condition \u000115\u0002 becomes s\u0001r−\u0001\u0002=2A. Equation\n\u000128\u0002 then simplifies to\n\tPˆ 2m\bn = R2m\u0001\u0005d\u000e\u0002 , \u000131\u0002\ni.e., the growth of \tPˆ 2m\bn scales to leading order as \u0001\u0005d\u000e\u00022m,\nas shown for integer \u0003 in Fig. 2. In particular, we obtain\n\tPˆ 2\bn =\n\u0005d\n2\n2\n\u000e2, \tPˆ 4\bn =\n3\u0005d\n4\n8\n\u000e4 +\n\u0005d\n2\n2\n\u000e2, \u000132\u0002\nfor m=1 and m=2, respectively.\n2. Integer values of Ω\nThe case where \u0003=r \/s is an integer is equivalent to\nchoosing s=1. The amplitude of Eq. \u000111\u0002 is then given by\nEq. \u0001A22\u0002 as\n\u000e = \r sin\u0003n\u0001\u0001 − r\u0002\t\/2\u0004\nsin\u0003\u0001\u0001 − r\u0002\t\/2\u0004 \r , \u000133\u0002\nwhich identifies \u000e as the modulus of Chebyshev’s polyno-\nmial of the second kind \u000369,70\u0004, Un−1(cos\u0003\u0001\u0001−r\u0002\t \/2\u0004). Im-\nposing the resonance condition s\u0001r−\u0001\u0002=2A with s=1 then\ngives \u000e=n. We therefore deduce from Eq. \u000132\u0002 that\n\tPˆ 2\bn =\n\u0005d\n2\n2\nn2, \tPˆ 4\bn =\n3\u0005d\n4\n8\nn4 +\n\u0005d\n2\n2\nn2. \u000134\u0002\nSimilarly, imposing the antiresonance condition \u000120\u0002 im-\nplies \u0001−r=2A+Nr \/Ns. Hence, in the antiresonant case,\n\u000e = Un−1„\u0001− 1\u0002A cos\u0001\tNr\/2Ns\u0002… , \u000135\u0002\nand the antiresonant evolutions of the second- and fourth-\norder moments for integer \u0003 are given by\n\tPˆ 2\bn = \tP2\b0 +\n\u0005d\n2\n2\nUn−1\n2 „cos\u0001\tNr\/2Ns\u0002… ,\n\tPˆ 4\bn = \tP4\b0 +\n3\u0005d\n4\n8\nUn−1\n4 „cos\u0001\tNr\/2Ns\u0002…\n+\n\u0005d\n2\n2\nUn−1\n2 „cos\u0001\tNr\/2Ns\u0002… . \u000136\u0002\nAs an example, we consider the simplest antiresonance\nwith Nr=Ns=1, so that Un−1= \u0001−1\u0002n sin\u0001n\t \/2\u0002. From Eq.\n\u000136\u0002 we find that\n\tPˆ 2\bn = \tP2\b0 +\n\u0005d\n2\n4\n\u0003\u0001− 1\u0002n+1 + 1\u0004 ,\n\tPˆ 4\bn = \tP4\b0 + \u000b3\u0005d416 + \u0005d\n2\n4 \f\u0003\u0001− 1\u0002n+1 + 1\u0004 , \u000137\u0002\ndemonstrating that the second- and fourth-order momentum\nmoments oscillate with a period of two kicks.\n\u0001Pˆ\n2m\n\u0002\nn\nm=1\nm=2\nm=3\nm=4\nm=5\nm=6\nm=7\n1 2 4 6 8 10 20 40 60\n100\n105\n1010\n1015\n1020\nFIG. 2. \u0001Color online\u0002 The first seven even momentum moments\nof a \u0001-kicked atomic cloud in the ultracold regime as given by Eq.\n\u000131\u0002 for integer \u0003, with the resonance condition \u000115\u0002 satisfied by\nchoosing any appropriate value of \u0001. We choose \u0005d=0.8\t as cor-\nresponding to an experimentally typical driving strength \u000346\u0004. The\ngrowth tends asymptotically to a power-law behavior with the\npower given by the order of the moment. Units are dimensionless.\nPOWER-LAW BEHAVIOR IN THE QUANTUM-RESONANT… PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-5\n3. Rational values of Ω\nIf \u0003=r \/s, then, for n\u0012s, \u000f˜ may be divided into identical\nsummations with a remainder term. Hence, assuming the\nresonance condition \u000115\u0002 to be satisfied, setting n=\u0011s+\u0013\ngives\n\u000f˜ = \u0011\u0006\nj=0\ns−1\nei\t\u0003\u0001j−\u0001r\/s\u0002j\n2\u0004 + \u0006\nj=0\n\u0013−1\nei\t\u0003\u0001j−\u0001r\/s\u0002j\n2\u0004\n. \u000138\u0002\nIt is possible to rewrite the first summation using the reci-\nprocity formula \u000371\u0004\n\u0006\nj=0\n\u0007C\u0007−1\nei\t\u0003\u0001Aj\n2+Bj\u0002\/C\u0004\n=\u000e\rCA\rei\t\u0003\u0001\u0007AC\u0007−B2\u0002\/4AC\u0004 \u0006j=0\n\u0007A\u0007−1\ne−i\t\u0003\u0001Cj\n2+Bj\u0002\/A\u0004\n,\n\u000139\u0002\nwhere A, B, and C are integers such that AC−B is even. This\nrestriction is in fact exactly equivalent to the resonance con-\ndition \u000115\u0002. Consequently,\n\u000f˜ = \u0011\u000es\nr\nei\t\u0001\u0001\n2s\/4r−rs\u0002\u0006\nj=0\n\u0007r\u0007−1\nei\t\u0003\u0001sj\n2+s\u0001j\u0002\/r\u0004 + \u0006\nj=0\n\u0013−1\nei\t\u0003\u0001j−\u0001r\/s\u0002j\n2\u0004\n.\n\u000140\u0002\nWe can then impose \u0013=0 because, for large values of \u0011 un-\nder conditions of quantum resonance, the second summation\nin Eq. \u000140\u0002 is only a small fluctuation in \u000f˜. Taking the sim-\nplest rational value of \u0003=1 \/s, Eq. \u000140\u0002 then simplifies con-\nsiderably to give\n\u000e = \u0011\u000es . \u000141\u0002\nSubstituting Eq. \u000141\u0002 into Eq. \u000132\u0002 and letting \u0011=n \/s yields\n\tPˆ 2\bn =\n\u0005d\n2\n2s\nn2, \tPˆ 4\bn =\n3\u0005d\n4\n8s2\nn4 +\n\u0005d\n2\n2s\nn2, \u000142\u0002\nwhere it should be noted that these expressions are strictly\nvalid only when n is a multiple of s. Hence, in addition to the\nconventional quantum resonances associated with the\n\u0001-kicked rotor\/particle \u000357\u0004 \u0001i.e., when \u0003=0\u0002 there are nu-\nmerous fractional quantum resonances observable in the\n\u0001-kicked accelerator when \u0003 takes rational values. The\nmanifestation of such fractional quantum resonances in an\natom-optical context at finite temperature we address in de-\ntail in another presentation \u000356\u0004.\nC. Finite-width momentum distributions\n1. General form of \u00022q\nFrom Sec. III B it is apparent that elucidation of the time\nevolution of the momentum moments is dependent on\nknowledge of the behavior of \u000e. It is not feasible to evaluate\n\u000e for all cases. However, it is possible to consider its general\nbehavior within certain approximations.\nFrom the definition of \u000e \u0003see Eq. \u000111\u0002\u0004, it follows that\n\u000e2q = \r\u0006\nj=0\nn−1\nei\t\u0001\rj−\u0003j\n2\u0002\r2q = \u0006\njq,jq\u0001=0\nn−1\nei\t\u0003F\u0001jq\u0002+\u0007G\u0001jq\u0002−F\u0001jq\u0001\u0002−\u0007G\u0001jq\u0001\u0002\u0004,\n\u000143\u0002\nwhere\nF\u0001jq\u0002 = \u0006\nr=1\nq\n\u0001\u0001jr −\u0003jr2\u0002 , \u000144a\u0002\nG\u0001jq\u0002 = 2\u0001\u0006\nr=1\nq\njr. \u000144b\u0002\nFor brevity, we have used the convenient shorthand \u0006jq,jq\u0001 to\ndenote the 2q sums, with jq= \u0001j1 , . . . , jq\u0002 and jq\u0001= \u0001j1\u0001 , . . . , jq\u0001\u0002.\nSubstituting Eq. \u000143\u0002 into Eq. \u000128\u0002 then yields\n\tPˆ 2m\b = \tPˆ 0\n2m\b + \u0006\nh=1\nm \u000b2m2h \f\u0006q=1\nh\naq\u0005d\n2q \u0006\njq,jq\u0001=0\nn−1\nei\t\u0003F\u0001jq\u0002−F\u0001jq\u0001\u0002\u0004\n\u0014 \n\n−\u0006\n\u0006\ndP D\u0001P\u0002P2\u0001m−h\u0002ei\tP\u0003G\u0001jq\u0002−G\u0001jq\u0001\u0002\u0004, \u000145\u0002\nwhere we have expanded R2h\u0001\u0005d\u000e\u0002=\u0006q=1\nh aq\u0001\u0005d\u000e\u00022q, and re-\nplaced \u0007 by k+\u0007\u0005P.\n2. Large-finite-width limit\nThe integrands in Eq. \u000145\u0002 are in general oscillatory and,\nby the method of stationary phase, under many circum-\nstances give a negligible contribution to the momentum mo-\nment evolution. We first separate out the integrals with\nnonoscillatory integrands. In particular, if G\u0001jq\u0002=G\u0001jq\u0001\u0002, then\nF\u0001jq\u0002−F\u0001jq\u0001\u0002=2\u0003\u0015\u0001jq , jq\u0001\u0002, where \u0015\u0001jq , jq\u0001\u0002 is an integer given\nby3\n\u0015\u0001jq,jq\u0001\u0002 = \u0006\nx=1\nq\n\u0006\ny=x+1\nq\n\u0001jx\u0001jy\u0001 − jxjy\u0002 . \u000146\u0002\nHence, partitioning Eq. \u000145\u0002, and using Eq. \u000146\u0002 yields\n\tPˆ 2m\bn = \tPˆ 2m\b0 + \u0006\nh=1\nm \u000b2m2h \f\tP2\u0001m−h\u0002\b0\n\u0014\u0006\nq=1\nh\naq\u0005d\n2q \u0006\njq,jq\u0001\nG\u0001jq\u0002=G\u0001jq\u0001\u0002\nei2\t\u0003\u0015\u0001jq,jq\u0001\u0002\n+ \u0006\nh=1\nm \u000b2m2h \f\u0006q=1\nh\naq\u0005d\n2q \u0006\njq,jq\u0001\nG\u0001jq\u0002\u0001G\u0001jq\u0001\u0002\nei\t\u0003F\u0001jq\u0002−F\u0001jq\u0001\u0002\u0004\n\u0014 \n\n−\u0006\n\u0006\ndP D\u0001P\u0002P2\u0001m−h\u0002ei\tP\u0003G\u0001jq\u0002−G\u0001jq\u0001\u0002\u0004. \u000147\u0002\n3A simple example is for q=2 where we have the constraint j1\n+ j2= j1\u0001+ j2\u0001. Considering \u0001j1+ j2\u00022= \u0001j1\u0001+ j2\u0001\u00022 leads to the conclusion\nthat j12+ j22− j1\u00012− j2\u00012=2\u0001j1\u0001j2\u0001− j1j2\u0002.\nHALKYARD et al. PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-6\nIn Eq. \u000147\u0002, the number of terms in the first summation\nover jq and jq\u0001 is equal to the number of different ways\nG\u0001jq\u0002=G\u0001jq\u0001\u0002 can be satisfied. This is given by a degree-\u00012q\n−1\u0002 polynomial in n, i.e.,\nS2q−1\u0001n\u0002 = \u0006\nr=1\n2q−1\nbrnr. \u000148\u0002\nThe coefficients br can readily be computed for a given q, as\noutlined in Appendix 8. Note also that, for integer values of\n\u0003, exp\u0003i2\t\u0003\u0015\u0001jq , jq\u0001\u0002\u0004 collapses to unity, independent of the\nvalue of \u0015\u0001jq , jq\u0001\u0002. Hence, for integer \u0003,\n\u0006\njq,jq\u0001\nG\u0001jq\u0002=G\u0001jq\u0001\u0002\nei2\t\u0003\u0015\u0001jq,jq\u0001\u0002 = S2q−1\u0001n\u0002 , \u000149\u0002\nand substituting Eq. \u000149\u0002 into Eq. \u000147\u0002 yields\n\tPˆ 2m\bn = \tPˆ 2m\b0 + \u0006\nh=1\nm \u000b2m2h \f\tP2\u0001m−h\u0002\b0\u0006q=1\nh\naq\u0005d\n2qS2q−1\u0001n\u0002\n+ \u0006\nh=1\nm \u000b2m2h \f\u0006q=1\nh\naq\u0005d\n2q \u0006\njq,jq\u0001\nG\u0001jq\u0002\u0001G\u0001jq\u0001\u0002\nei\t\u0003F\u0001jq\u0002−F\u0001jq\u0001\u0002\u0004\n\u0014 \n\n−\u0006\n\u0006\ndP D\u0001P\u0002P2\u0001m−h\u0002ei\tP\u0003G\u0001jq\u0002−G\u0001jq\u0001\u0002\u0004. \u000150\u0002\nIt is illustrative to rewrite\nei\tP\u0003G\u0001jq\u0002−G\u0001jq\u0001\u0002\u0004 = ei2\tP\u0001\u0006r=1\nq \u0003jr−jr\u0001\u0004, \u000151\u0002\nfrom which it is apparent that Eq. \u000151\u0002 has a maximum pe-\nriod in P of 1 \/\u0001. We can therefore consider initial distribu-\ntions D\u0001P\u0002 with characteristic width \u00161 \/\u0001 to be “broad,”\nmeaning that the oscillatory terms in the integrals of Eq. \u000150\u0002\ncause them to average essentially to zero. This leaves\n\tPˆ 2m\bn \u000f \tPˆ 2m\b0 + \u0006\nh=1\nm \u000b2m2h \f\tP2\u0001m−h\u0002\b0\u0006q=1\nh\naq\u0005d\n2qS2q−1\u0001n\u0002 ,\n\u000152\u0002\nwhere the leading order is n2m−1. Therefore, for sufficiently\nbroad distributions, we expect the 2mth-order moment to\nscale with the number of kicks n as n2m−1 for integer values\nof \u0003.\nFor \u0003=r \/s, the ei2\t\u0003\u0015\u0001jq,jq\u0001\u0002 terms take s different values.\nIf these values to some extent add in phase, then we expect\nthe growth of the 2mth-order moment to have the same\npower law as for integer values of \u0003, but with a constant\ncoefficient that may depend on \u0003. As described in a compan-\nion paper \u000356\u0004, through a combination of numerical and ana-\nlytical investigation we have found that, for a broad Gauss-\nian initial momentum distribution, the growth of the second-\norder moment appears to be largely independent of the value\nof \u0003. The growth of the fourth-order moment, however, is\ngenerally cubic with n for rational \u0003=r \/s, but with a con-\nstant coefficient that diminishes with increasing s.\nD. Cumulants\nThe 2mth-order moment also includes information regard-\ning all lower-order moments, so observations of the moments\nalone do not explicitly isolate effects of different order. How-\never, the moments \tPmˆ\b may be used to construct cumulants\n\t\tPˆ m\b\b \u000354,72–75\u0004, which are independent quantities. The\nfirst-, second-, third-, and fourth-order cumulants are the\nmean, variance, skew, and kurtosis, respectively, and are\ngiven in terms of the moments by\n\t\tPˆ \b\b = \tPˆ \b , \u000153a\u0002\n\t\tPˆ 2\b\b = \tPˆ 2\b − \tPˆ \b2, \u000153b\u0002\n\t\tPˆ 3\b\b = \tPˆ 3\b − 3\tPˆ \b\tPˆ 2\b + 2\tPˆ \b3, \u000153c\u0002\n\t\tPˆ 4\b\b = \tPˆ \b4 − 3\tPˆ 2\b2 + 12\tPˆ \b2\tPˆ 2\b − 6\tPˆ \b4. \u000153d\u0002\nThe skew quantifies the asymmetry of the distribution\nabout the mean, and the kurtosis quantifies the degree to\nwhich the distribution is peaked. For example, a Gaussian \u0001or\n\u0001 function, which can be defined as a zero-variance limit of a\nGaussian\u0002 has kurtosis =0, whereas a distribution which is\nmore sharply peaked or cusplike has positive kurtosis, and a\ndistribution which is more “blunt” has negative kurtosis.\nAs discussed in Sec. III A, we are largely considering\nsymmetric distributions, where all odd moments, and there-\nfore cumulants, are zero. In this instance, the two lowest-\norder nonzero cumulants are given by\n\t\tPˆ 2\b\b = \tPˆ 2\b, \t\tPˆ 4\b\b = \tPˆ \b4 − 3\tPˆ 2\b2. \u000154\u0002\nThe evolutions of the second- and fourth-order moments in\nthe ultracold regime \u0003D\u0001P\u0002=\u0001\u0001P\u0002\u0004 for \u0003=r \/s are described\nby Eq. \u000142\u0002. From this the lowest even cumulants, as defined\nin Eq. \u000154\u0002, readily follow:\n\t\tPˆ 2\b\bn =\n\u0005d\n2\n2s\nn2, \t\tPˆ 4\b\bn =\n\u0005d\n2\n2s\nn2 −\n3\u0005d\n4\n8s2\nn4. \u000155\u0002\nHence, the leading-order power-law behavior manifest in the\nlowest two even moments is also observed in the lowest two\neven cumulants. We have investigated numerically the be-\nhavior of all even cumulants up to m=100, which also ex-\nhibit the same leading mth-order power-law behaviour as the\nmth moments. The scaling laws therefore do not appear to be\nsimply manifestations of lower-order effects.\nAlthough the cumulant definitions of Eq. \u000153\u0002 are for-\nmally convenient, determining the moments from an experi-\nmentally measured momentum distribution and then combin-\ning them into cumulants will cause experimental errors to\naccumulate. Alternative, more direct assessment of the\n“width” and “pointedness” of the measured distribution, pro-\nviding it yields essentially the same information on the sys-\ntem dynamics, may turn out to be experimentally more con-\nvenient.\nPOWER-LAW BEHAVIOR IN THE QUANTUM-RESONANT… PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-7\nIV. FINITE-TEMPERATURE IDEAL GAS\nA. Overview\nIn Sec. III C 2 we determined that for an initial momen-\ntum distribution that is symmetric and in some sense suffi-\nciently broad, the 2mth-order momentum moments are ex-\npected to grow as n2m−1, where n is the kick number. That is,\nthe power-law growth is in general reduced by one compared\nto the ultracold limit \u0001Sec. III B\u0002. We can illustrate this with\nanalytical expressions for the second- and fourth-order mo-\nments and cumulants when the initial momentum distribution\nis that of an ideal gas in thermal equilibrium, i.e.,\nD\u0001P\u0002 =\n1\n\u000e2\tw2\nexp\u0001− P2\/2w2\u0002 . \u000156\u0002\nHere w is the standard deviation and the corresponding Bolt-\nzmann temperature is given by Tw=\u00022K2w2 \/MkB, where kB\nis Boltzmann’s constant.\nHere we choose to constrain \u0003 to take integer values r,\nthat is we do not consider the fractional quantum resonances\nderived for \u0003=1 \/s in the ultracold limit in Sec. III B 3. We\nnote, however, that when considering the manifestation of\nfractional quantum resonant dynamics in a finite-temperature\nideal gas, the behaviour of the fourth moment distinguishes\nclearly between different kinds of fractional quantum reso-\nnances, whereas the behavior of the second moment does not\n\u000356\u0004. This provides an additional, specific motivation for bet-\nter understanding the dynamics of the fourth-order momen-\ntum moment.\nWhen comparing with experiment, we note that our ana-\nlytical results implicitly assume that the momentum distribu-\ntion can be determined with perfect precision. Obviously this\ncannot be exactly fulfilled experimentally \u0001although Gustavs-\nson et al. \u000376\u0004 report measuring the momentum distribution\nof cold caesium atoms with a resolution equivalent to\n0.05\u0002K\u0002.4 Our numerical investigations indicate that, at least\nfor the second- and fourth-order moments, the qualitative\nbehaviour of the moments is not very sensitive to coarsening\nof the momentum resolution. Also note that, as quantum\nresonant dynamics are associated with the momentum of a\nportion of the atomic cloud increasing ballistically, as time\nprogresses a proportion of the atoms will no longer be in the\nRaman-Nath regime. Experimentally, we therefore expect the\npredicted power-law behavior to be followed for a finite time\nonly, as dictated by details of the experimental configuration.\nB. Calculation of the moments\nThe general procedure is outlined in Appendix D; starting\nwith Eqs. \u000129\u0002 and \u000130\u0002, we evaluate \u000e, expand the resulting\nexpression in terms of cosines, and then integrate. Using\nEqs. \u000129\u0002 and \u000130\u0002 to determine Eqs. \u0001D5\u0002 and \u0001D9\u0002, we find\nthat\n\tPˆ 2\bn = w2 +\n\u0005d\n2\n2\nn + \u0005d\n2\u0006\nq=1\nn−1\n\u0001− 1\u0002q\u0001\u0001−r\u0002\u0001n − q\u0002e−2q\n2\u00012\t2w2\n\u000157\u0002\nand\n4Note that \u0002K is equal to two photon recoils.\n\u0001Pˆ\n2 \u0002\n(a)\nn\n\u0001Pˆ\n4 \u0002\n(b)\n1 2 4 6 8 10 20 40 60\n102\n104\n106\n108\n101\n102\n103\n104\nFIG. 3. \u0001Color online\u0002 Second-order \u0001a\u0002 and fourth-order \u0001b\u0002\nmomentum moments yielded by the quantum-resonant evolution of\nan atomic cloud, as propagated by Eq. \u00017\u0002. We set \u0003=0 \u0001i.e., no net\nacceleration\u0002, T=TT \u0001\u0001=2\u0002, and choose \u0005d=0.8\t \u000346\u0004. The initial\nmomentum distributions are Gaussian \u0003see Eq. \u000156\u0002\u0004 with standard\ndeviations w given by \u0001*\u0002 w=1 \/8, \u0001\u0001\u0002 w=1 \/32, \u0001\u0002\u0002 w=1 \/128,\nand \u0001\u0003\u0002 w=1 \/512. The solid lines correspond to analytic results\ngiven by Eqs. \u000157\u0002 and \u000158\u0002, and the symbols correspond to data\nfrom a Monte Carlo simulation, the details of which are discussed\nelsewhere \u000357\u0004. The dash-dotted lines indicate the ultracold limit\n\u0003see Eq. \u000155\u0002 with s=1\u0004, and the dashed lines are a lower bound\nlimit for a broad distribution \u0003see Eq. \u000159\u0002 with w=0\u0004. The vertical\ndotted lines in \u0001a\u0002 indicate nG=1 \/\u0001\tw for w=1 \/8,1 \/32,1 \/128,\ni.e., the discrete time characterizing when growth in \tPˆ 2\b deviates\nfrom quadratic to linear. Units are dimensionless.\n\u0001\u0001Pˆ\n4 \u0002\u0002\n1\/\n3\nn\n0 200 400 600\n0 10 20 30 40 50 60\n0\n2000\n4000\n200\n-500\n-400\n-300\n-200\n-100\n0\n100\nFIG. 4. \u0001Color online\u0002 Cube roots of the fourth-order momen-\ntum cumulants of a resonantly kicked atomic cloud evolved accord-\ning to Eq. \u00017\u0002. Parameters are \u0003=0, T=TT \u0001\u0001=2\u0002, and we choose\n\u0005d=0.8\t \u000346\u0004. We consider Gaussian initial momentum distribu-\ntions with standard deviation \u0001*\u0002 w=1 \/8, \u0001\u0001\u0002 w=1 \/32,\n\u0001\u0002\u0002 w=1 \/128, and \u0001\u0003\u0002 w=1 \/512. After a certain number of kicks,\nthe growth becomes linear, i.e., the fourth-order cumulant grows\ncubically. The inset shows the ideal \u0001assuming perfect \u0001 kicks\u0002\nlong-time behavior. Units are dimensionless.\nHALKYARD et al. PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-8\n\tPˆ 4\b = 3w4 +\n\u0005d\n4\n8\n\u00012n2 + 1\u0002n +\n\u0005d\n2\n2\nn + 3w2\u0005d\n2n +\n3\u0005d\n4\n8 \u0006q=1\nn−1\n\u0001− 1\u0002q\u0001\u0001−r\u0002e−2q\n2\u00012\t2w2\u000bq3 − 2nq2 − q + 2n3 \u00012n2 + 1\u0002\f\n−\n3\u0005d\n4\n8 \u0006q=n\n2n−2\n\u0001− 1\u0002q\u0001\u0001−r\u0002e−2q\n2\u00012\t2w2\u000bq33 − 2nq2 + \u000112n\n2\n− 1\u0002\n3\nq +\n2n\n3\n\u00011 − 4n2\u0002\f\n+ \u0005d\n2\u0006\nq=1\nn−1\n\u0001− 1\u0002q\u0001\u0001−r\u0002\u0001n − q\u0002e−2q\n2\u00012\t2w2 + 6\u0005d\n2\u0006\nq=1\nn−1\n\u0001− 1\u0002q\u0001\u0001−r\u0002\u0001n − q\u0002w2\u00011 − 4w2q2\u00012\t2\u0002e−2q\n2\u00012\t2w2\n. \u000158\u0002\nThe time scale over which the resonant growth of the\nsecond-order moment \u0001where \u0001−\u0003 is even\u0002 switches from\nthe ultracold regime to the large finite-temperature regime\ncan be deduced from Eq. \u000157\u0002. A substantially diminished\ngrowth of the second-order moment occurs when q2\u00012\t2w2\n\u00161, so we take nG=1 \/\u0001\tw to be the transition time. Assum-\ning that w is sufficiently large that nG\u00171, the exponential\nterms in Eqs. \u000157\u0002 and \u000158\u0002 become vanishingly small, and\nwe find that\n\tPˆ 2\bn = w2 +\n\u0005d\n2\n2\nn , \u000159a\u0002\n\tPˆ 4\bn = 3w4 +\n\u0005d\n4\n8\n\u00012n2 + 1\u0002n + 3w2\u0005d\n2n . \u000159b\u0002\nThe transition time characterizing the transition from quartic\nto cubic growth of the fourth-order moment is not straight-\nforward to define. However, from Eq. \u000158\u0002 and Fig. 3, it is\nclear that this occurs over the same time scale as for the\nsecond-order moment. In previous work we considered a\nsymmetric initial momentum distribution that is uniform\nover a finite range \u0001less than 1 \/\u0001\u0002 \u000357\u0004; the same qualitative\nbehavior is then manifest as in Fig. 3, with comparable time\nscales.\nC. Momentum cumulants and the thermal limit\nAs discussed in Sec. III D, the momentum moments are in\ngeneral not independent quantities and include lower-order\ncorrelations. It is therefore instructive to consider the second-\nand fourth-order cumulants derived from a Gaussian initial\nmomentum distribution \u0003Eq. \u000156\u0002\u0004. From Eqs. \u000154\u0002 and \u000159\u0002\nit follows that \t\tPˆ 2\b\bn= \tPˆ 2\bn and\n\t\tPˆ 4\b\bn =\n\u0005d\n4\n8\n\u00012n2 − 6n + 1\u0002n . \u000160\u0002\nHence, as in the ultracold limit \u0003Eq. \u000155\u0002\u0004, the power laws\nderived for the momentum moments in the thermal regime\nalso appear to hold for the cumulants; the long-term cubic\npower-law growth of \t\tPˆ 4\b\bn is illustrated in Fig. 4. As in the\nultracold limit \u0001Sec. III D\u0002, the scaling laws are therefore not\nsimply manifestations of lower-order effects. Although we\nhave only shown this for the second- and fourth-order cumu-\nlants, we expect it to be generally true.\nNote also that both the moments and the change in the\nfourth-order moment \u0001i.e., \tPˆ 4\bn− \tPˆ 4\b0\u0002 formally diverge for\nlarge w, whereas this is not the case for the changes in the\ncumulants from their initial values. It is therefore in the cu-\nmulants, rather than the moments, that one can speak of a\nwell-defined thermal limit \u000356\u0004.\nV. CONCLUSIONS\nWe have studied the quantum-resonant dynamics of the\natom-optical quantum \u0001-kicked accelerator, a fundamental\nsystem in the study of quantum chaos which reduces to the\n\u0001-kicked particle \u0001the atom-optical realization of the quan-\ntum \u0001-kicked rotor\u0002 when the \u0001tunable\u0002 effective acceleration\nparameter a=0. In the \u0001-kicked particle, quantum resonant\nand antiresonant dynamics result when the periodicity of re-\npeated off-resonant laser pulses is a half-integer multiple of\nthe the Talbot time TT=4\tM \/\u0002K2. We have found that, for\nsuch pulse periodicities, fractional quantum resonances occur\nwhen the rescaled effective acceleration parameter\n\u0003=aKT2 \/2\t takes noninteger rational values.\nWe have focused on the dynamics of the momentum mo-\nments of the atomic centre-of-mass momentum distribution.\nThe moment evolutions are useful for characterizing the dif-\nferent kinds of dynamic behavior in the atom-optical\n\u0001-kicked accelerator. We have found explicitly that, in the\nultracold limit, quantum resonant dynamics cause all even-\nordered momentum moments to exhibit a power-law growth,\nwith an exponent equal to the order of the moment. For\nfractional quantum resonances the moment growth follows\nthe same power laws, but with coefficients that reduce with\nincreasing size of the denominator of \u0003. We have argued\nthat, for a sufficiently broad initial atomic center-of-mass\nmomentum distribution undergoing quantum resonant, or\nfractional quantum resonant evolution, the exponent of the\npower law growth of the even-ordered moments will gener-\nally be reduced by 1. In every case considered, we have\nfound that the long-term momentum cumulant dynamics also\ndisplay power-law growth with the same exponent, meaning\nthe scaling laws in the growth of the moments are not simply\nmanifestations of lower-order effects.\nWe have illustrated a reduction in the power-law exponent\nby calculating explicit expressions for the dynamics of the\nsecond- and fourth-order momentum moments for a finite\ntemperature ideal gas initially at thermal equilibrium, i.e.,\nPOWER-LAW BEHAVIOR IN THE QUANTUM-RESONANT… PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-9\nusing a Maxwell-Boltzmann distribution to describe the ini-\ntial state. These are the two simplest moments to calculate,\nand are physically motivated in that they provide directly\nuseful information on the dynamical behavior of the atomic\ncloud: the second-order moment provides a signature to dis-\ntinguish between dynamical localization and quantum-\nresonant dynamics in the atom-optical \u0001-kicked particle \u000357\u0004\nand accelerator, and the fourth-order momentum moment\ndistinguishes between different classes of fractional resonant\ndynamics in the quantum \u0001-kicked accelerator \u000356\u0004.\nACKNOWLEDGMENTS\nWe would like to thank I. G. Hughes, M. Edwards, K.\nHelmerson, and W. D. Phillips for useful and stimulating\ndiscussions, and V. J. Armitage for discussions regarding\nGauss sums. We acknowledge funding from the U.K. EPSRC\n\u0001Grant No. EP\/D032970\/1\u0002 and P.L.H. also thanks Durham\nUniversity.\nAPPENDIX A: MOMENTUM-STATE TIME EVOLUTION\n1. Overview\nIn this appendix we determine the time evolution of the\neigenstate \u0007k+\u0007\b by applying the Floquet operator \u00017\u0002 con-\nsecutively for n kicks. Our derivation follows closely the\nequivalent calculation for the \u0001-kicked rotor \u0001where \u0003=0\u0002\n\u000357\u0004.\n2. Application of the transformed Floquet operators\nThe effect of applying the nth transformed Floquet opera-\ntor \u00017\u0002 to the momentum eigenstate \u0007k+\u0007\b is\nF˜n\u0001\u0007\u0002\u0007k + \u0007\b =\n dz F˜ n\u0001\u0007\u0002\u0007z\b\tz\u0007k + \u0007\b = ei\u0003\t\u00011+\u0007\u0002\u0001−K\u0018n\u0004\u0007\n\u0014\n dz e−ikˆK\u0018nei\u0005d cos\u0001Kzˆ\u0002\u0007z\b\tz\u0007k + \u0007\b , \u0001A1\u0002\nwhere we have defined\nK\u0018n \u0005 \t\u0003\u00011 + 2\u0007\u0002\u0001 −\u0003\u00012n − 1\u0002\u0004 . \u0001A2\u0002\nUsing exp\u0001−ikˆK\u0018n\u0002 \u0007z\b=exp\u0001i\u0007K\u0018n\u0002 and \tz \u0007k+\u0007\b\n=\u000eK \/2\texp\u0003i\u0001k+\u0007\u0002Kz\u0004, we deduce from Eq. \u0001A1\u0002 that\nFˆ n\u0001\u0007\u0002\u0007k + \u0007\b =\u000e K2\tei\t\u0007\u00011+\u0007\u0002\u0001\n dz\u0007z + \u0018n\bei\u0001k+\u0007\u0002Kz\n\u0014 ei\u0005d cos\u0001Kz\u0002, \u0001A3\u0002\nwhere we have used \tz \u0007k+\u0007\b=\u000eK \/2\tei\u0001k+\u0007\u0002Kz.\nThe combined effect of the nth and \u0001n+1\u0002th transformed\nFloquet operators can be determined similarly, to obtain\nF˜n+1\u0001\u0007\u0002F˜n\u0001\u0007\u0002\u0007k + \u0007\b =\u000e K2\tei2\t\u0007\u00011+\u0007\u0002\u0001\n dz\u0007z + \u0018n + \u0018n+1\b\n\u0014 ei\u0001k+\u0007\u0002Kzei\u0005d\u0003cos\u0001Kz\u0002+cos\u0001Kz+K\u0018n\u0002\u0004.\n\u0001A4\u0002\nHence, the full time evolution of the initial momentum\neigenstate, governed by F˜ n\u0001\u0007\u0002=F˜n\u0001\u0007\u0002F˜n−1\u0001\u0007\u0002¯F˜ 1\u0001\u0007\u0002, is\nF˜ n\u0001\u0007\u0002\u0007k + \u0007\b =\u000e K2\tein\t\u0007\u00011+\u0007\u0002\u0001\n dz\rz + \u0006\nn\u0001=1\nn\n\u0018n\u0001\u0010\n\u0014ei\u0001k+\u0007\u0002Kzexp\u0011i\u0005d\u0012cos\u0001Kz\u0002\n+ \u0006\nj=1\nn−1\ncos\u000bKz + \u0006\nj\u0001=1\nj\nK\u0018 j\u0001\f\u0013\u0014 . \u0001A5\u0002\n3. Spatial representation\nTo determine the matrix element \tz \u0007F˜ n\u0001\u0007\u0002 \u0007k+\u0007\b, we\nproject Eq. \u0001A5\u0002 onto \u0007z\b, i.e.,\n\tz\u0007F˜ n\u0001\u0007\u0002\u0007k + \u0007\b =\u000e K2\tein\t\u0007\u00011+\u0007\u0002\u0001ei\u0001k+\u0007\u0002\u0001Kz−\u0006n\u0001=1n K\u0018n\u0001\u0002\n\u0014 exp\u0011i\u0005d\u0012cos\u000bKz − \u0006\nn\u0001=1\nn\nK\u0018n\u0001\f\n+ \u0006\nj=1\nn−1\ncos\u000bKz − \u0006\nn\u0001=1\nn\nK\u0018n\u0001 + \u0006\nj\u0001=1\nj\nK\u0018 j\u0001\f\u0013\u0014 .\n\u0001A6\u0002\nUsing Eq. \u0001A2\u0002, we can readily evaluate the sum\n\u0006\nn\u0001=1\nn\nK\u0018n\u0001 = n\t\u0003\u00011 + 2\u0007\u0002\u0001 −\u0003n\u0004 , \u0001A7\u0002\nand, with the definition\nqj \u0005 \u0001n − j\u0002\t\u0003\u00011 + 2\u0007\u0002\u0001 −\u0003\u0001n + j\u0002\u0004 , \u0001A8\u0002\nEq. \u0001A6\u0002 simplifies to\n\tz\u0007F˜ n\u0001\u0007\u0002\u0007k + \u0007\b =\u000e K2\tein\t\u0007\u00011+\u0007\u0002\u0001ei\u0001k+\u0007\u0002\u0001Kz−q0\u0002\n\u0014 exp\u000bi\u0005d\u0006\nj=0\nn−1\ncos\u0001Kz − qj\u0002\f . \u0001A9\u0002\nFinally, defining \u0019\u0005\u0006 j=0\nn−1 cos qj and \u001a\u0005\u0006 j=0\nn−1 sin qj, Eq. \u0001A9\u0002\nfurther simplifies to\n\tz\u0007F˜ n\u0001\u0007\u0002\u0007k + \u0007\b =\u000e K2\tein\t\u0007\u00011+\u0007\u0002\u0001ei\u0001k+\u0007\u0002\u0001Kz−q0\u0002\n\u0014 ei\u0005d\u0019 cos\u0001Kz\u0002+i\u0005d\u001a sin\u0001Kz\u0002. \u0001A10\u0002\n4. Probability amplitudes\na. General form of the probability amplitudes\nInvoking Bessel function expansions \u000357\u0004, Eq. \u0001A10\u0002 can\nbe recast in the form\nHALKYARD et al. PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-10\n\tz\u0007F˜ n\u0001\u0007\u0002\u0007k + \u0007\b =\u000e K2\tein\t\u0007\u00011+\u0007\u0002\u0001ei\u0001k+\u0007\u0002\u0001Kz−q0\u0002\n\u0014 \u0006\nj=−\u0006\n\u0006\neijKzJj\u0001\u000b\u0002eij\f, \u0001A11\u0002\nwhere \u000b and \f are real and defined by \u000bei\f\u0005\u0005d\u0001i\u0019+\u001a\u0002. To\nevaluate the matrix element\n\tj + \u0007\u0001\u0007F˜ n\u0001\u0007\u0002\u0007k + \u0007\b =\u000e K2\t \n dz e−i\u0001j+\u0007\u0001\u0002Kz\tz\u0007F˜n\u0001\u0007\u0002\u0007k + \u0007\b ,\n\u0001A12\u0002\nwe substitute Eq. \u0001A11\u0002 into Eq. \u0001A12\u0002 to yield\n\tj + \u0007\u0001\u0007Fn\u0001\u0007\u0002\u0007k + \u0007\b = e−i\tn\rke−in\n2\t\u0001k+\u0007\u0002\u0003e−in\t\u0007\n2\u0001 \u0006\nj\u0001=−\u0006\n\u0006\nJj\u0001\u0001\u000b\u0002\n\u0014 eij\u0001\f\nK\n2\t \n dz ei\u0001k+j\u0001−j+\u0007−\u0007\u0001\u0002Kz,\n\u0001A13\u0002\nwhere \r= \u00011+2\u0007\u0002\u0001.\nWe now consider the general expansion\n\u0007\n\u0001t = nT\u0002\b \u0005 F˜ n\u0001\u0007\u0002\u0007k + \u0007\b = \u0006\nj=−\u0006\n\u0006\nckj\u0001\u0007,nT\u0002\u0007j + \u0007\b ,\n\u0001A14\u0002\nwhere the probability amplitudes ckj\u0001\u0007 ,nT\u0002 are given by\nckj\u0001\u0007 ,nT\u0002\u0001\u0001\u0007−\u0007\u0001\u0002= \tj+\u0007\u0001\u0007Fˆ n\u0001\u0007\u0002\u0007k+\u0007\b. Evaluating the Fou-\nrier integral in Eq. \u0001A13\u0002, it follows that\nckj\u0001\u0007,nT\u0002 = Jj−k\u0001\u000b\u0002ei\u0001j−k\u0002\fe−i\tn\rke−in\n2\t\u0001k+\u0007\u0002\u0003e−in\t\u0007\n2\u0001\n,\n\u0001A15\u0002\nwhere the normalizsation condition \u0006 j=\u0006\n\u0006 \u0007ckj\u0001\u0007 ,nT\u0002\u00072=1 is\nsatisfied. Equations \u0001A14\u0002 and \u0001A15\u0002 describe the time evo-\nlution of the initial momentum eigenstate \u0007k+\u0007\b. However, it\nstill remains to evaluate \u000b and \f.\nb. Evaluation of \u0003 and \u0004\nIt is convenient to define5\n\u0005d\u000f = \u000be\ni\f\n, \u0001A16\u0002\ni.e.,\n\u000f\u0005 i\u0019 + \u001a = i\u0006\nj=0\nn−1\ne−iqj . \u0001A17\u0002\nSubstituting Eq. \u0001A8\u0002 into Eq. \u0001A17\u0002, we obtain\n\u000f = ie−i\t\u0001\rn−\u0003n\n2\u0002\u0006\nj=0\nn−1\nei\t\u0001\rj−\u0003j\n2\u0002\n. \u0001A18\u0002\nAbsorbing the global phase, we define\n\u000f˜ = \u0006\nj=0\nn−1\nei\t\u0001\rj−\u0003j\n2\u0002\n, \u0001A19\u0002\nand hence the magnitude \u000e\u0005\u0007\u000f˜ \u0007 = \u0007\u000f \u0007 = \u0007\u000b \u0007 \/\u0005d. It is perhaps\nnatural to think of \u000b in \u000bei\f as being positive, although we\nfind it more convenient in Eq. \u0001A22\u0002 to allow \u000b to take\nnegative values.\nc. Integer values of Ω\nThe Gauss sum in Eq. \u0001A19\u0002 can be evaluated analytically\nin some particular cases. Here we illustrate this for integer\n\u0003=r. For this choice of \u0003, Eq. \u0001A19\u0002 reduces to a geometric\nsum,\n\u000f˜ = \u0006\nj=0\nn−1\nei\t\u0001\r−r\u0002j , \u0001A20\u0002\nwhich can be evaluated to give\n\u000f˜ =\n1 − ein\u0001\r−r\u0002\t\n1 − ei\u0001\r−r\u0002\t\n= ei\u0001n−1\u0002\u0001\r−r\u0002\t\/2\nsin\u0003n\u0001\r − r\u0002\t\/2\u0004\nsin\u0003\u0001\r − r\u0002\t\/2\u0004\n.\n\u0001A21\u0002\nReferring to Eqs. \u0001A17\u0002 and \u0001A18\u0002, we can now set\n\u000b\n\u0005d\n=\nsin\u0003n\u0001\r − r\u0002\t\/2\u0004\nsin\u0003\u0001\r − r\u0002\t\/2\u0004\n, \u0001A22\u0002\nand \f= \u00031− \u0001\r−r\u0002\u0001n+1\u0002\u0004\t \/2. Note that Eq. \u0001A22\u0002 can take\nnegative values, and hence the absolute value must be taken\nto obtain \u000e, if desired.\nAPPENDIX B: SUMMATIONS OF BESSEL FUNCTIONS\nWe first state the recurrence relation \u000368\u0004\nJn−1\u0001x\u0002 + Jn+1\u0001x\u0002 =\n2n\nx\nJn\u0001x\u0002 , \u0001B1\u0002\nand Neumann’s addition theorem \u000368\u0004\n\u0006\nn=−\u0006\n\u0006\nJn\u0001x1\u0002Jn+k\u0001x2\u0002 = Jk\u0001x1 − x2\u0002 , \u0001B2\u0002\nwhere n and k are integer. The addition theorem \u0001B2\u0002 has two\nspecial cases:\n\u0006\nn=−\u0006\n\u0006\nJn\n2\u0001x\u0002 = \u0006\nn=−\u0006\n\u0006\nJn+k\n2 \u0001x\u0002 = 1 \u0001B3\u0002\nfor any integer value of k, and\n\u0006\nn=−\u0006\n\u0006\nJn\u0001x\u0002Jn+k\u0001x\u0002 = 0 \u0001B4\u0002\nfor integer k\u00010.\n5The parameter \u000f in this paper is related to a previously defined\nparameter \u001b \u000357\u0004 according to \u000f= i\u001b*.\nPOWER-LAW BEHAVIOR IN THE QUANTUM-RESONANT… PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-11\nThe identity J\n−n\u0001x\u0002= \u0001−1\u0002nJn\u0001x\u0002 implies Jn\n2\u0001x\u0002=J\n−n\n2 \u0001x\u0002 \u000368\u0004,\nand therefore that\n\u0006\nn=−\u0006\n\u0006\nn2m−1Jn\n2\u0001x\u0002 = 0 \u0001B5\u0002\nfor integer m\u00120. In contrast, repeated substitution of the\nrecurrence relation \u0001B1\u0002 reveals\n\u0006\nn=−\u0006\n\u0006\nn2mJn\n2\u0001x\u0002 = \u0006\nq=1\n2m \u000b x2\f\nq\n\u0006\np=0\nq\ncq,p \u0006\nn=−\u0006\n\u0006\nJn−q+2p\u0001x\u0002Jn\u0001x\u0002 ,\n\u0001B6\u0002\nwhere it is in principle possible, although often tedious, to\ndetermine the coefficients cq,p. With Eqs. \u0001B3\u0002 and \u0001B4\u0002 we\ncan eliminate all terms in Eq. \u0001B6\u0002 except those where q\n=2p. Hence,\n\u0006\nn=−\u0006\n\u0006\nn2mJn\n2\u0001x\u0002 = \u0006\nq=1\nm\naqx\n2q \u0005 R2m\u0001x\u0002 , \u0001B7\u0002\nwhere aq\u0005c2q,q \/22q, and we note that the leading-order co-\nefficient of the polynomial R2m\u0001x\u0002 is always am= \u0001\n2m\nm \u0002 \/22m. In\nparticular,\n\u0006\nn=−\u0006\n\u0006\nn2Jn\n2\u0001x\u0002 =\nx2\n2\n, \u0006\nn=−\u0006\n\u0006\nn4Jn\n2\u0001x\u0002 =\n3x4\n8\n+\nx2\n2\n. \u0001B8\u0002\nAPPENDIX C: COUNTING TERMS WHERE\nG(jq)=G(jq\u0001)\nTo find the number of terms where G\u0001jq\u0002=G\u0001jq\u0001\u0002, we re-\nquire that \u0003see Eq. \u000144b\u0002\u0004\n\u0001j1 + j2 + ¯ + jq − j1\u0001 − j2\u0001 − ¯ − jq\u0001\u0002 = 0, \u0001C1\u0002\nwhere jq, jq\u0001\u0001 \u00030,n−1\u0004. We follow a well-known number\ntheoretical approach, which is described in detail in \u000366\u0004. The\nnumber of ways that Eq. \u0001C1\u0002 can be satisfied is isomorphic\nto the problem of evaluating the x-independent term in\n\u00011 + x + x2 + ¯ + xn−1\u0002q\u00011 + x−1 + x−2 + ¯ + x−n+1\u0002q,\n\u0001C2\u0002\nwhich we multiply by xq\u0001n−1\u0002, to give\n\u00011 + x + x2 + ¯ + xn−1\u00022q. \u0001C3\u0002\nWe now require the coefficient of xq\u0001n−1\u0002 in Eq. \u0001C3\u0002, which\nis given by6 \u000377\u0004\nW\u00012q,n\u0002 = \u0006\nj=0\nq\n\u0001− 1\u0002 j\u000b2qj \f\u000bn\u0001q − j\u0002 + q − 12q − 1 \f\n= \u0006\nj=0\nq\n\u0001− 1\u0002 j\u000bN + q − 1N − q \f\u000b2qj \f , \u0001C4\u0002\nwhere we have used \u0001 xy \u0002= \u0001\nx\nx−y \u0002 and set N=n\u0001q− j\u0002. The only\nn-dependent part of W\u00012q ,n\u0002 is the binomial coefficient\n\u000bN + q − 1N − q \f = \u0001N + m − 1\u0002\u0001N + m − 2\u0002 ¯ \u0001N − m + 1\u0002\u00012q − 1\u0002! ,\n\u0001C5\u0002\nthe numerator of which is a polynomial in N of degree 2q\n−1. Thus, we may write W\u00012q ,n\u0002=S2q−1\u0001n\u0002 where S2q−1\u0001n\u0002 is\na polynomial in n of degree 2q−1.\nAPPENDIX D: DERIVATION OF MOMENTS\nFOR GAUSSIAN DISTRIBUTIONS\n1. Second moment\nFor a Gaussian initial momentum distribution D\u0001P\u0002\n=exp\u0001−P2 \/2w2\u0002 \/\u000e2\tw2 \u0001w is the standard deviation\u0002, the\ninitial second-order momentum moment is \tPˆ 2\b0=w2. Using\nEqs. \u000129\u0002 and \u0001A22\u0002, we deduce that, for integer \u0003=r,\n\tPˆ 2\bn = w2 +\n\u0005d\n2\n2\u000e2\tw2\n\n−\u0006\n\u0006\ndP\nsin2\u0003n\u0001\r − r\u0002\t\/2\u0004\nsin2\u0003\u0001\r − r\u0002\t\/2\u0004\ne−P\n2\/2w2\n.\n\u0001D1\u0002\nNote that we can replace the \u0007 in \r\u0005\u00011+2\u0007\u0002\u0001 with P\u0005k\n+\u0007 without altering Eq. \u0001A22\u0002. We now use Eq. \u0001E3\u0002 to-\ngether with\ncos\u0015q\u0003\u00011 + 2P\u0002\u0001 − r\u0004\t\u0016 = \u0001− 1\u0002q\u0001\u0001−r\u0002 cos\u00012q\u0001\tP\u0002 ,\n\u0001D2\u0002\nto determine from Eq. \u0001D1\u0002 that\n\tPˆ 2\bn = w2 +\n\u0005d\n2\n2\nn +\n\u0005d\n2\n\u000e2\tw2\u0006q=1\nn−1\n\u0001− 1\u0002q\u0001\u0001−r\u0002\u0001n − q\u0002\n\u0014 \n\n−\u0006\n\u0006\ndP cos\u00012q\u0001\tP\u0002e−P2\/2w2. \u0001D3\u0002\nWe now substitute \u000378\u0004\n1\n\u000e2\tw2\n\n−\u0006\n\u0006\ndP cos\u00012q\u0001\tP\u0002e−P2\/2w2 = e−2q2\u00012\t2w2 \u0001D4\u0002\ninto Eq. \u0001D3\u0002, which gives the final result:\n\tPˆ 2\bn = w2 +\n\u0005d\n2\n2\nn + \u0005d\n2\u0006\nq=1\nn\n\u0001− 1\u0002q\u0001\u0001−r\u0002\u0001n − q\u0002e−2q\n2\u00012\t2w2\n.\n\u0001D5\u0002\n2. Fourth moment\nThe initial fourth-order moment for a Gaussian initial dis-\ntribution is \tPˆ 4\b0=3w4. Using a similar approach to that for\nthe second-order momentum moment, we use Eqs. \u000130\u0002 and\n\u0001A22\u0002 to deduce that, for \u0003=r,\n6This is equivalent to considering 2q n-sided dice and finding the\nnumber of ways W\u00012q ,n\u0002 of totaling q\u0001n−1\u0002.\nHALKYARD et al. PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-12\n\tPˆ 4\bn = 3w4 +\n3\u0005d\n4\n8\u000e2\tw2\n\n−\u0006\n\u0006\ndP\nsin4\u0003n\u0001\r −\u0003\u0002\t\/2\u0004\nsin4\u0003\u0001\r −\u0003\u0002\t\/2\u0004\ne−P\n2\/2w2 +\n\u0005d\n2\n\u000e2\tw2\n\n−\u0006\n\u0006\ndP\u000b12 + 3P2\f sin\n2\u0003n\u0001\r −\u0003\u0002\t\/2\u0004\nsin2\u0003\u0001\r −\u0003\u0002\t\/2\u0004\ne−P\n2\/2w2\n. \u0001D6\u0002\nUsing Eqs. \u0001D2\u0002, \u0001E3\u0002, and \u0001E4\u0002, we deduce from Eq. \u0001D6\u0002 that\n\tPˆ 4\b = 3w4 +\n\u0005d\n4\n8\n\u00012n2 + 1\u0002n +\n\u0005d\n2\n2\nn + 3\tP0\n2\b\u0005d\n2n +\n3\u0005d\n4\n8\u000e2\tw2\u0006q=1\nn−1\n\u0001− 1\u0002q\u0001\u0001−r\u0002\u000bq3 − 2nq2 − q + 2n3 \u0001n2 + 1\u0002\f\n\u0014\n\n−\u0006\n\u0006\ndP cos\u00012q\u0001\tP\u0002e−P2\/2w2 −\n3\u0005d\n4\n8\u000e2\tw2 \u0006q=n\n2n−2\n\u0001− 1\u0002q\u0001\u0001−r\u0002\u000bq33 − 2nq2 + \u000112n\n2\n− 1\u0002\n3\nq +\n2n\n3\n\u00011 − 4n2\u0002\f\n\u0014\n\n−\u0006\n\u0006\ndP cos\u00012q\u0001\tP\u0002e−P2\/2w2 +\n\u0005d\n2\n\u000e2\tw2\u0006q=1\nn−1\n\u0001− 1\u0002q\u0001\u0001−r\u0002\u0001n − q\u0002\n\n−\u0006\n\u0006\ndP cos\u00012q\u0001\tP\u0002e−P2\/2w2\n+\n6\u0005d\n2\n\u000e2\tw2\u0006q=1\nn−1\n\u0001− 1\u0002q\u0001\u0001−r\u0002\u0001n − q\u0002\n\n−\u0006\n\u0006\ndP P2 cos\u00012q\u0001\tP\u0002e−P2\/2w2. \u0001D7\u0002\nFinally, using \tPˆ 2\b0=w2, Eq. \u0001D4\u0002, and the integral \u000378\u0004\n1\n\u000e2\tw2\n\n−\u0006\n\u0006\ndP P2 cos\u00012q\u0001\tP\u0002e−P2\/2w2 = w2\u00011 − 4q2\u00012\t2w2\u0002e−2q2\u00012\t2w2 \u0001D8\u0002\nto simplify Eq. \u0001D7\u0002, we find that\n\tPˆ 4\b = 3w4 +\n\u0005d\n4\n8\n\u00012n2 + 1\u0002n + 3w2\u0005d\n2n +\n3\u0005d\n4\n8 \u0006q=1\nn−1\n\u0001− 1\u0002q\u0001\u0001−r\u0002e−2q\n2\u00012\t2w2\u000bq3 − 2nq2 − q + 2n3 \u00012n2 + 1\u0002\f\n−\n3\u0005d\n4\n8 \u0006q=n\n2n−2\n\u0001− 1\u0002q\u0001\u0001−r\u0002e−2q\n2\u00012\t2w2\u000bq33 − 2nq2 + \u000112n\n2\n− 1\u0002\n3\nq +\n2n\n3\n\u00011 − 4n2\u0002\f + \u0005d2\u0006\nq=1\nn−1\n\u0001− 1\u0002q\u0001\u0001−r\u0002\u0001n − q\u0002e−2q\n2\u00012\t2w2\n.\n+ 6\u0005d\n2\u0006\nq=1\nn−1\n\u0001− 1\u0002q\u0001\u0001−r\u0002\u0001n − q\u0002w2\u00011 − 4w2q2\u00012\t2\u0002e−2q\n2\u00012\t2w2\n. \u0001D9\u0002\nAPPENDIX E: COSINE EXPANSIONS\nIn order to perform many of the integrations in Appendix\nD, we used finite cosine expansions of powers of\nsin\u0001n\u001c\u0002 \/sin\u0001\u001c\u0002. To derive such an expansion for\nsin2\u0001n\u001c\u0002 \/sin2\u0001\u001c\u0002, we first consider the summation\nn + 2\u0006\nq=1\nn−1\n\u0001n − q\u0002cos\u00012q\u001c\u0002 = n + n\u0006\nq=1\nn−1\nei2q\u001c + n\u0006\nq=1\nn−1\ne−i2q\u001c\n− \u0006\nq=1\nn−1\nqei2q\u001c − \u0006\nq=1\nn−1\nqe−i2q\u001c.\n\u0001E1\u0002\nThe exponential sums in Eq. \u0001E1\u0002 are geometric sums, or\ntheir derivatives, which can be evaluated to give\nn + 2\u0006\nq=1\nn−1\n\u0001n − q\u0002cos\u00012q\u001c\u0002 = n + n\nei2\u001cn − e2i\u001c\ne2i\u001c − 1\n− n\ne−i2\u001c\u0001n−1\u0002 − 1\ne2i\u001c − 1\n+\ni\n2\n\u0002\n\u0002\u001c\nei2\u001cn − e2i\u001c\ne2i\u001c − 1\n−\ni\n2\n\u0002\n\u0002\u001c\ne−i2\u001cn − e−2i\u001c\ne−2i\u001c − 1\n. \u0001E2\u0002\nDifferentiating Eq. \u0001E2\u0002 and identifying a mutual denomina-\ntor then gives the desired result:\nn + 2\u0006\nq=1\nn−1\n\u0001n − q\u0002cos\u00012q\u001c\u0002 =\ne2i\u001c\u0001n+1\u0002 − 2e2i\u001c + e−2i\u001c\u0001n−1\u0002\n\u0001e2i\u001c − 1\u00022\n=\nsin2\u0001n\u001c\u0002\nsin2\u0001\u001c\u0002\n. \u0001E3\u0002\nPOWER-LAW BEHAVIOR IN THE QUANTUM-RESONANT… PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-13\nSimilarly, rewriting cos\u00012q\u001c\u0002 and converting terms in-\nvolving powers of q to derivatives of cos\u00012q\u001c\u0002, we find that\nsin4\u0001n\u001c\u0002\nsin4\u0001\u001c\u0002\n=\nn\n3\n\u00012n2 + 1\u0002 + \u0006\nq=1\nn−1 \u000bq3 − 2nq2 − q\n+\n2n\n3\n\u00012n2 + 1\u0002\fcos\u00012q\u001c\u0002\n− \u0006\nq=n\n2n−2 \u0012q33 − 2nq2 + \u000b4n2 − 13\fq\n+\n2n\n3\n\u00011 − 4n2\u0002\u0013cos\u00012q\u001c\u0002 . \u0001E4\u0002\nWe note that Un−1(cos\u0001\u001c\u0002)=sin\u0001n\u001c\u0002 \/sin\u0001\u001c\u0002 is a Cheby-\nshev polynomial of the second kind, and in this appendix we\nhave considered finite expansions of these in terms of\nChebyshev polynomials of the first kind, i.e., Tn(cos\u0001\u001c\u0002)\n=cos\u0001n\u001c\u0002. These are equivalent to discrete Fourier trans-\nforms.\n\u00031\u0004 G. Casati, B. V. Chirikov, F. M. Izraelev, and J. Ford, in Sto-\nchastic Behavior in Classical and Quantum Hamiltonian Sys-\ntems, edited by G. Casati and J. Ford \u0001Springer, New York,\n1979\u0002.\n\u00032\u0004 F. M. Izrailev and D. L. Shepelyanskii, Sov. Phys. Dokl. 24,\n996 \u00011979\u0002.\n\u00033\u0004 F. M. Izrailev and D. L. Shepelyanskii, Theor. Math. Phys. 43,\n553 \u00011980\u0002.\n\u00034\u0004 I. Dana, Phys. Rev. Lett. 73, 1609 \u00011994\u0002.\n\u00035\u0004 I. Dana, E. Eisenberg, and N. Shnerb, Phys. Rev. Lett. 74, 686\n\u00011995\u0002.\n\u00036\u0004 I. Dana, E. Eisenberg, and N. Shnerb, Phys. Rev. E 54, 5948\n\u00011996\u0002.\n\u00037\u0004 I. Dana and D. L. Dorofeev, Phys. Rev. E 72, 046205 \u00012005\u0002.\n\u00038\u0004 I. Dana and D. L. Dorofeev, Phys. Rev. E 73, 026206 \u00012006\u0002.\n\u00039\u0004 I. Dana and D. L. Dorofeev, Phys. Rev. E 74, 045201\u0001R\u0002\n\u00012006\u0002.\n\u000310\u0004 S. Wimberger, I. Guarneri, and S. Fishman, Nonlinearity 16,\n1381 \u00012003\u0002.\n\u000311\u0004 S. Wimberger, I. Guarneri, and S. Fishman, Phys. Rev. Lett.\n92, 084102 \u00012004\u0002.\n\u000312\u0004 S. Wimberger and M. Sadgrove, J. Phys. A 38, 10549 \u00012005\u0002.\n\u000313\u0004 M. Lepers, V. Zehnlé, and J. C. Garreau, Phys. Rev. A 77,\n043628 \u00012008\u0002.\n\u000314\u0004 C. F. Bharucha, J. C. Robinson, F. L. Moore, B. Sundaram, Q.\nNiu, and M. G. Raizen, Phys. Rev. E 60, 3881 \u00011999\u0002.\n\u000315\u0004 W. H. Oskay, D. A. Steck, V. Milner, B. G. Klappauf, and M.\nG. Raizen, Opt. Commun. 179, 137 \u00012000\u0002.\n\u000316\u0004 M. Sadgrove, A. Hilliard, T. Mullins, S. Parkins, and R. Leon-\nhardt, Phys. Rev. E 70, 036217 \u00012004\u0002.\n\u000317\u0004 G. J. Duffy, A. S. Mellish, K. J. Challis, and A. C. Wilson,\nPhys. Rev. A 70, 041602\u0001R\u0002 \u00012004\u0002.\n\u000318\u0004 J. F. Kanem, S. Maneshi, M. Partlow, M. Spanner, and A. M.\nSteinberg, Phys. Rev. Lett. 98, 083004 \u00012007\u0002.\n\u000319\u0004 J.-A. Currivan, A. Ullah, and M. D. Hoogerland, e-print\narXiv:0806.3107v3.\n\u000320\u0004 L. Deng, E. W. Hagley, J. Denschlag, J. E. Simsarian, M.\nEdwards, C. W. Clark, K. Helmerson, S. L. Rolston, and W. D.\nPhillips, Phys. Rev. Lett. 83, 5407 \u00011999\u0002.\n\u000321\u0004 A. J. Lichtenberg and M. A. Lieberman, Regular and Chaotic\nDynamics, 2nd ed. \u0001Springer, New York, 1992\u0002.\n\u000322\u0004 L. E. Reichl, The Transition to Chaos: Conservative Classical\nSystems and Quantum Manifestations, 2nd ed. \u0001Springer, New\nYork, 2004\u0002.\n\u000323\u0004 F. Haake, Quantum Signatures of Chaos, 2nd ed. \u0001Springer,\nBerlin, 2001\u0002.\n\u000324\u0004 M. C. Gutzwiller, Chaos in Classical and Quantum Mechanics\n\u0001Springer, New York, 1990\u0002.\n\u000325\u0004 F. L. Moore, J. C. Robinson, C. F. Bharucha, B. Sundaram, and\nM. G. Raizen, Phys. Rev. Lett. 75, 4598 \u00011995\u0002.\n\u000326\u0004 H. Ammann, R. Gray, I. Shvarchuck, and N. Christensen,\nPhys. Rev. Lett. 80, 4111 \u00011998\u0002.\n\u000327\u0004 M. B. d’Arcy, R. M. Godun, M. K. Oberthaler, D. Cassettari,\nand G. S. Summy, Phys. Rev. Lett. 87, 074102 \u00012001\u0002.\n\u000328\u0004 F. L. Moore, J. C. Robinson, C. Bharucha, P. E. Williams, and\nM. G. Raizen, Phys. Rev. Lett. 73, 2974 \u00011994\u0002.\n\u000329\u0004 B. G. Klappauf, W. H. Oskay, D. A. Steck, and M. G. Raizen,\nPhysica D 131, 78 \u00011999\u0002.\n\u000330\u0004 D. A. Steck, V. Milner, W. H. Oskay, and M. G. Raizen, Phys.\nRev. E 62, 3461 \u00012000\u0002.\n\u000331\u0004 V. Milner, D. A. Steck, W. H. Oskay, and M. G. Raizen, Phys.\nRev. E 61, 7223 \u00012000\u0002.\n\u000332\u0004 W. H. Oskay, D. A. Steck, and M. G. Raizen, Chaos, Solitons\nFractals 16, 409 \u00012003\u0002.\n\u000333\u0004 K. Vant, G. Ball, and N. Christensen, Phys. Rev. E 61, 5994\n\u00012000\u0002.\n\u000334\u0004 A. C. Doherty, K. M. D. Vant, G. H. Ball, N. Christensen, and\nR. Leonhardt, J. Opt. B: Quantum Semiclassical Opt. 2, 605\n\u00012000\u0002.\n\u000335\u0004 M. B. d’Arcy, R. M. Godun, D. Cassettari, and G. S. Summy,\nPhys. Rev. A 67, 023605 \u00012003\u0002.\n\u000336\u0004 C. Ryu, M. F. Andersen, A. Vaziri, M. B. d’Arcy, J. M. Gross-\nman, K. Helmerson, and W. D. Phillips, Phys. Rev. Lett. 96,\n160403 \u00012006\u0002.\n\u000337\u0004 P. Szriftgiser, J. Ringot, D. Delande, and J. C. Garreau, Phys.\nRev. Lett. 89, 224101 \u00012002\u0002.\n\u000338\u0004 H. Ammann and N. Christensen, Phys. Rev. E 57, 354 \u00011998\u0002.\n\u000339\u0004 K. Vant, G. Ball, H. Ammann, and N. Christensen, Phys. Rev.\nE 59, 2846 \u00011999\u0002.\n\u000340\u0004 M. E. K. Williams, M. P. Sadgrove, A. J. Daley, R. N. C. Gray,\nS. M. Tan, A. S. Parkins, N. Christensen, and R. Leonhardt, J.\nOpt. B: Quantum Semiclassical Opt. 6, 28 \u00012004\u0002.\n\u000341\u0004 G. J. Duffy, S. Parkins, T. Müller, M. Sadgrove, R. Leonhardt,\nand A. C. Wilson, Phys. Rev. E 70, 056206 \u00012004\u0002.\n\u000342\u0004 A. Tonyushkin, S. Wu, and M. Prentiss, e-print\narXiv:0803.4153v1.\n\u000343\u0004 S. Wu, A. Tonyushkin, and M. Prentiss, e-print\narXiv:0801.0475v1.\nHALKYARD et al. PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-14\n\u000344\u0004 M. K. Oberthaler, R. M. Godun, M. B. d’Arcy, G. S. Summy,\nand K. Burnett, Phys. Rev. Lett. 83, 4447 \u00011999\u0002.\n\u000345\u0004 R. M. Godun, M. B. d’Arcy, M. K. Oberthaler, G. S. Summy,\nand K. Burnett, Phys. Rev. A 62, 013411 \u00012000\u0002.\n\u000346\u0004 M. B. d’Arcy, R. M. Godun, M. K. Oberthaler, G. S. Summy,\nK. Burnett, and S. A. Gardiner, Phys. Rev. E 64, 056233\n\u00012001\u0002.\n\u000347\u0004 S. Schlunk, M. B. d’Arcy, S. A. Gardiner, D. Cassettari, R. M.\nGodun, and G. S. Summy, Phys. Rev. Lett. 90, 054101 \u00012003\u0002.\n\u000348\u0004 S. Schlunk, M. B. d’Arcy, S. A. Gardiner, and G. S. Summy,\nPhys. Rev. Lett. 90, 124102 \u00012003\u0002.\n\u000349\u0004 Z.-Y. Ma, M. B. d’Arcy, and S. A. Gardiner, Phys. Rev. Lett.\n93, 164101 \u00012004\u0002.\n\u000350\u0004 A. Buchleitner, M. B. d’Arcy, S. Fishman, S. A. Gardiner, I.\nGuarneri, Z.-Y. Ma, L. Rebuzzini, and G. S. Summy, Phys.\nRev. Lett. 96, 164101 \u00012006\u0002.\n\u000351\u0004 G. Behinaein, V. Ramareddy, P. Ahmadi, and G. S. Summy,\nPhys. Rev. Lett. 97, 244101 \u00012006\u0002.\n\u000352\u0004 S. Fishman, I. Guarneri, and L. Rebuzzini, Phys. Rev. Lett. 89,\n084101 \u00012002\u0002.\n\u000353\u0004 S. Fishman, I. Guarneri, and L. Rebuzzini, J. Stat. Phys. 110,\n911 \u00012003\u0002.\n\u000354\u0004 R. Bach, K. Burnett, M. B. d’Arcy, and S. A. Gardiner, Phys.\nRev. A 71, 033417 \u00012005\u0002.\n\u000355\u0004 I. Guarneri and L. Rebuzzini, Phys. Rev. Lett. 100, 234103\n\u00012008\u0002.\n\u000356\u0004 M. Saunders, P. L. Halkyard, S. A. Gardiner, and K. J. Challis,\ne-print arXiv:0806.3894v1.\n\u000357\u0004 M. Saunders, P. L. Halkyard, K. J. Challis, and S. A. Gardiner,\nPhys. Rev. A 76, 043415 \u00012007\u0002.\n\u000358\u0004 S. Inouye, M. R. Andrews, J. Stenger, H.-J. Miesner, D. M.\nStamper-Kurn, and W. Ketterle, Nature \u0001London\u0002 392, 151\n\u00011998\u0002.\n\u000359\u0004 J. L. Roberts, N. R. Claussen, J. P. Burke, C. H. Greene, E. A.\nCornell, and C. E. Wieman, Phys. Rev. Lett. 81, 5109 \u00011998\u0002.\n\u000360\u0004 T. Köhler, K. Góral, and P. S. Julienne, Rev. Mod. Phys. 78,\n1311 \u00012006\u0002.\n\u000361\u0004 M. Gustavsson, E. Haller, M. J. Mark, J. G. Danzl, G. Rojas-\nKopeinig, and H.-C. Nägerl, Phys. Rev. Lett. 100, 080404\n\u00012008\u0002.\n\u000362\u0004 C. Kittel, Introduction to Solid State Physics \u0001John Wiley &\nSons, New York, 1996\u0002.\n\u000363\u0004 E. Hecht, Optics, 4th ed. \u0001Addison-Wesley, San Francisco,\n2002\u0002.\n\u000364\u0004 D. Bigourd, B. Chatel, W. P. Schleich, and B. Girard, Phys.\nRev. Lett. 100, 030202 \u00012008\u0002.\n\u000365\u0004 M. Gilowski, T. Wendrich, T. Muller, C. Jentsch, W. Ertmer, E.\nM. Rasel, and W. P. Schleich, Phys. Rev. Lett. 100, 030201\n\u00012008\u0002.\n\u000366\u0004 T. M. Apostol, Introduction to Analytic Number Theory\n\u0001Springer-Verlag, New York, 1976\u0002.\n\u000367\u0004 V. Armitage and A. Rogers, J. Phys. A 33, 5993 \u00012000\u0002.\n\u000368\u0004 Handbook of Mathematical Functions with Formulas, Graphs,\nand Mathematical Tables, edited by M. Abramowitz and I. A.\nStegun \u0001U. S. GPO, Washington, D.C., 1964\u0002.\n\u000369\u0004 T. J. Rivlin, The Chebyshev Polynomials \u0001Wiley, New York,\n1974\u0002.\n\u000370\u0004 J. C. Mason and D. C. Handscomb, Chebyshev Polynomials\n\u0001Chapman & Hall, Boca Raton, FL, 2003\u0002.\n\u000371\u0004 B. C. Berndt and R. J. Evans, Bull., New Ser., Am. Math. Soc.\n5, 107 \u00011981\u0002.\n\u000372\u0004 R. Kubo, J. Phys. Soc. Jpn. 17, 1100 \u00011962\u0002.\n\u000373\u0004 J. Fricke, Ann. Phys. \u0001N.Y.\u0002 252, 479 \u00011996\u0002.\n\u000374\u0004 T. Köhler and K. Burnett, Phys. Rev. A 65, 033601 \u00012002\u0002.\n\u000375\u0004 C. W. Gardiner, Handbook of Stochastic Methods, 2nd ed.\n\u0001Springer, Berlin, 1996\u0002.\n\u000376\u0004 M. Gustavsson, E. Haller, M. J. Mark, J. G. Danzl, R. Hart, A.\nJ. Daley, and H.-C. Nägerl \u0001unpublished\u0002.\n\u000377\u0004 J. V. Uspensky, Introduction to Mathematical Probability, 1st\ned. \u0001McGraw-Hill, New York, 1937\u0002.\n\u000378\u0004 I. S. Gradshteyn and I. M. Ryzhik, Table of Integrals, Series\nand Products, 7th ed. \u0001Academic Press, San Diego, 2007\u0002.\nPOWER-LAW BEHAVIOR IN THE QUANTUM-RESONANT… PHYSICAL REVIEW A 78, 063401 \u00012008\u0002\n063401-15\n"}